{"John Russell Reynolds was born in London.": [{"url": "https://history.rcplondon.ac.uk/inspiring-physicians/sir-john-russell-reynolds", "page_content": "Russell Reynolds was born at Romsey in Hampshire, the son of John Reynolds, a nonconformist minister, and grandson of Henry Revell Reynolds, F.R.C.P, physician to the Middlesex and St. Thomas’s Hospitals and Physician-in-Ordinary to George III. His father gave him the greater part of his general education and University College, London, his medical training. He graduated in 1851 as University scholar and gold medallist in physiology, comparative anatomy and medicine. For so outstanding a student, a great future seemed assured. But his means were slender and he decided to begin practice in Leeds where he had relatives. However, his old teacher Marshall Hall persuaded him to return to London, offering him his house in Grosvenor Street on favourable terms. His enterprise was rewarded by appointments as assistant physician to the Hospital for Sick Children in 1855, the Westminster Hospital in 1857 and University College Hospital in 1859. After a further three years, he became full physician and Holme professor of clinical medicine at University College, and in 1867 he succeeded Jenner in the chair of medicine.\n\nReynolds gave distinguished service to the Royal College of Physicians, being Lumleian Lecturer in 1867, Harveian Orator in 1884, Censor, and finally, from 1893 to 1896, President. He was chosen as Physician to the Royal Household in 1879 and, with his friend, J. E. Erichsen, created a baronet in 1895. He was president of the B.M.A. at the time of his death. But he made his mark in the profession chiefly by his early writings on nervous diseases — he was one of the first to propound the possibilities of electricity as a therapeutic agent — and by his editorship of the System of Medicine, published in five volumes between 1866 and 1879. He was a fluent and popular lecturer and a careful and sympathetic physician. Somewhat shy and grave of mien, he could reveal both a quiet humour and a directness of speech that was no respecter of persons. Painting and music were his recreations, and he was well read in literature. He was married, firstly, to a Miss Ainslie and, secondly to Frances, widow of C. J. C. Crespigny, but left no children. He died at his house in Grosvenor Street.\n\nG H Brown\n\n[Lancet, 1896; B.M.J., 1896; D.N.B., xlviii, 52]"}, {"url": "https://www.wikiwand.com/en/Sir_John_Russell_Reynolds", "page_content": "Sir John Russell Reynolds, 1st Baronet (22 May 1828 – 29 May 1896) was a British neurologist and physician.\n\nBritish neurologist and physician\n\nQuick facts: Sir John Russell Reynolds, 1st Baronet, Born,... ▼\n\nReynolds was born in Romsey, Hampshire, as son of John Reynolds, an independent minister, and grandson of Dr. Henry Revell Reynolds. He received general education from his father, and was educated in his profession at University College, London, where he obtained three gold medals in the medical school. In 1851 he graduated M.B. in the university of London, and obtained a scholarship and gold medal in medicine. In 1852 he took the degree of M.D., and began practice in Leeds. He soon after moved to London, and took a house, 38 Grosvenor Street, in which Dr. Marshall Hall had lived. Hall announced to his patients in a printed circular that Reynolds had succeeded him in practice. Such procedure was contrary to a recognised understanding among physicians, and Hall incurred the censure of the College of Physicians. Reynolds, who was ignorant of Hall's intention, was in no way responsible for the circular, and was in no way involved in the censure. He was duly elected a fellow of the college in 1859. In the same year he was appointed assistant physician to University College Hospital, to which he continued attached throughout life. He had before been, in 1855, assistant physician to the Hospital for Sick Children, and in 1857 assistant physician to the Westminster Hospital. In 1865 he became professor of the principles and practice of medicine at University College, and in 1878 he was appointed physician-in-ordinary to the queen's household. He gained a considerable practice as a physician, and was often consulted in difficult cases of nervous disease. In 1869 he was elected a fellow of the Royal Society, and in 1883 vice-president of the Royal Medical and Chirurgical Society. He delivered the Lumleian lecture at the College of Physicians in 1867, the Harveian oration in 1884, and was elected president in 1893, on the death of Sir Andrew Clark. He was re-elected in 1894 and 1895, and on 1 January in the latter year was created a baronet. In the winter of 1895–6 he became too ill to offer himself for re-election as president of the College of Physicians. He died at his house in Grosvenor Street, London, after several weeks of illness of a pulmonary congestion, on 29 May 1896. He was married, first, at St Pancras Old Church, London, on 28 August 1852 to Margaretta Susannah Ainslie (1831-1880) and, secondly, to Frances (Plunkett) Reynolds widow of C. J. C. Crespign, but left no children.\n\nThe Reynolds Baronetcy, of Grosvenor Street, was created in the Baronetage of the United Kingdom on 28 February 1895 for John Russell Reynolds.[1] The title became extinct on his death.\n\nReynolds devoted himself from an early period to the study of nervous diseases, and in 1854 published an Essay on Vertigo; in 1855 Diagnosis of Diseases of the Brain, Spinal Cord, and Nerves, as well as Tables for the Diagnosis of Diseases of the Brain; in 1861 a treatise on epilepsy; in 1871 Lectures on the Clinical Uses of Electricity; in 1872 The Scientific Value of the Legal Tests of Insanity; besides many papers in medical periodicals and the transactions of medical societies, and several addresses to medical associations. His writings on nervous diseases were useful contributions to a department of medicine in which much work remained undone, but in the flood of modern observations they have been submerged. He will chiefly be remembered among physicians as the editor of the System of Medicine, in five volumes, published from 1866 to 1879, a collection of essays on diseases, written by the most competent men who could be induced to write—compositions of varying merit, but generally of high value. He himself wrote the parts on erysipelas, on inflammation of the lymphatics, and on several forms of nervous disease. He published in 1893 a Life of Dr. Walter Hayle Walshe. Reynolds was a tall man, with dark hair, with a dignified delivery and some oratorical power.\n\nReynolds died in London."}, {"url": "https://acnr.co.uk/articles/john-russell-reynolds/", "page_content": "Abstract\n\nWhen neurology began to develop as a specialty, Russell Reynolds was one of the first neurologists appointed to the Hospital for the Paralysed and Epileptic, Queen Square.\n\nOf many contributions his work on epilepsy was influential, espousing many new concepts. He followed and developed Hughlings Jackson’s original ideas about positive and negative neurological symptoms. His approach to patients was holistic at a time when more objectively defined notions of illness dominated medicine. He wrote on vertigo, and about criminal lunacy, and his book The Diagnosis of Diseases of the Brain, Spinal Cord, Nerves and their appendages was a major text of the period.\n\nWell versed in poetry, philosophy, art, and music, he was widely admired. He became President of the Royal College of Physicians.\n\nLike the great Sir Jonathan Hutchinson and other Victorians of privileged stock, Sir John Russell Reynolds (1828–1896) (Figure 1) never attended school. His father, a nonconformist minister at Romsey in Hampshire, educated him personally. His grandfather Henry Revell Reynolds (1745-1811), FRS, was an illustrious physician at the Middlesex and St Thomas’s Hospitals and Physician to George III.\n\nFigure 1: Sir J Russell Reynolds. [Published in British Medical Journal, 6 June 1896)\n\nAs a nonconformist he was excluded from Oxford and Cambridge* and read Medicine at University College London, graduating with a gold medal in physiology, comparative anatomy, and medicine in 1851 [1]. An impecunious young doctor, he sought a living, practicing in Leeds where his brother was a Minister of the East Parade Mission Chapel, and his brother-in-law a journalist on the Leeds Mercury.\n\nA year later his former teacher Marshall Hall, FRS. (1790-1857), a physician and brilliant experimental physiologist persuaded him to return to London [2], where at modest cost Hall let him live in his home at 38, Grosvenor Street and join his Consultant practice, mainly in nervous diseases.\n\nOnly four years after graduating Russell Reynolds’ outstanding ability led to his appointment as assistant physician at the Hospital for Sick Children and to the Westminster and University College Hospitals. There he became Holme Professor of Clinical Medicine in 1862, and in 1867 succeeding Sir William Jenner as Professor of Medicine. Just five years after the opening of the National Hospital for the Relief and Cure of Paralysis and Epilepsy, Russell Reynolds showed his interest in neurology and was appointed to its staff. He was elected FRS on 3rd June 1869.\n\nAt this time neurology began to flourish; he worked with many distinguished early neurologists. They included Hughlings Jackson (1835-1911), Jabez Ramskill (1825-1897), Charles Bland Radcliffe (1822–1889) who succeeded Brown–Séquard in 1863, and published Lectures on Epilepsy, Pain, Paralysis, and certain other disorders of the Nervous System, 1864, and articles in Reynolds’s System of Medicine. His brother John Netten Radcliffe (c. 1830-1884), a pioneering epidemiologist, was also Medical Superintendent of the Hospital for the Paralysed and Epileptic.\n\nNo man works in a vacuum. Marshall Hall, (who in spite of his acknowledged distinction [3] surprisingly had failed to get an academic post in London) inspired and encouraged Reynolds. Amongst contemporary and subsequent notable physicians he influenced were: the erudite Charlton Bastian (1837-1915); Charles Edward Beevor, (1854-1908); Howard Tooth (1856-1925); James Taylor, (1859-1946) editor of Jackson’s Selected Writings; and the punctilious Thomas Buzzard (1831-1919), his neighbour in Grosvenor Street, and friend of both Hughlings Jackson and David Ferrier (1843-1928).\n\nSuch was Reynolds’s reputation that he was rewarded with both the Lumleian and the Harveian lectures at the Royal College of Physicians of London, becoming President from 1893–1895. Like his grandfather, he was physician to the royal household in 1879 and was made a baronet in 1895. He was president of the BMA until his death.\n\nA popular and fluent lecturer, he was shy and serious but had a quiet humour and a ‘directness of speech that was no respecter of persons.’ Described as courteous, shrewd, and kind, his approach was holistic – long before it became fashionable:\n\nNot to merely make a diagnosis, much less to write a prescription, but to advise the individual patient what he or she should best do to regain their health… and what changes in the environment, mental, emotional, or physical were most likely to achieve this end. [2]\n\nMedical works\n\nRussell Reynolds is often remembered for his descriptions of epilepsy, eclamptic convulsions, and febrile convulsions in children [4,5]. He also used electrotherapy in various nervous diseases [6].\n\nInterestingly, he is widely quoted for commending the “great value of Cannabis indica” in migraine, epileptic conditions, depression, and asthma. In 1890 he prescribed a cannabis tincture for the menstrual cramps suffered by Queen Victoria. He noted in The Lancet:\n\nWhen pure and administered carefully, [cannabis] is one of the most valuable medicines we possess. [7]\n\nOf greater import was his 1861 paper (Figure 2) that espoused the concept of positive and negative neurological symptoms [5,8]. Positive symptoms were abnormal behaviours that included not only clonic jerking and abnormal movements but also hallucinations and paranoid delusions.\n\nSome symptoms are negative, i.e. they consist in the negation of vital properties. Of this kind are paralysis, anaesthesia, and the like…Other symptoms are positive, i.e. they consist in excess or alteration of vital properties. Of this kind are spasms, pain, convulsions and the like… (p.9-12, 28)\n\nUnfortunately, he failed to write further on this theme. Like Jackson, Russell Reynolds shrewdly noted that the lesion did not directly cause the symptoms observed.\n\nThe origins of positive and negative symptoms were inextricably intertwined with Herbert Spencer’s ideas of dissolution and evolution of the nervous system [9]. Hughlings Jackson extended Spencer’s idea to patients’ symptoms, both positive and negative. Jackson believed that negative symptoms related to the dissolution of neural function while positive symptoms resulted from excitation or the release of lower levels from higher inhibitory control:\n\nSpeaking of the physical side, there are degrees of loss of function of the least organized nervous arrangements with conservation of function of the more organized. There is in each reduction to a more automatic condition; in each there is dissolution, using this term as Spencer does, as the opposite of evolution. [10]\n\nFigure 2. Reynolds: Epilepsy, its symptoms, treatment and relation to other chronic convulsive diseases. 1861\n\nRussell Reynolds wrote his first book on Vertigo. In 1856 he examined legal pleas for insanity in his Criminal Lunatics: are they Responsible? He believed that epilepsy could be a distinct or ‘idiopathic’ disease, a controversial view well expressed in The Diagnosis of Diseases of the Brain, Spinal Cord, Nerves and their appendages in 1855 (dedicated to Marshall Hall), This was later contradicted by Kinnier Wilson who stated that all epileptic events were symptoms, whether or not any underlying pathology could be demonstrated [11].\n\nAlways inclined to a broad approach he described the interictal symptoms of 62 patients with idiopathic epilepsy. He found about one-third had mild impairment of recent memory and a similar proportion had moderate to severe psychopathological findings. His interpretation of epileptic activity (well described by Eadie) [12] was in large measure approved by Hughlings Jackson.\n\nHe edited and wrote many chapters in A system of medicine (London: Macmillan, in five volumes from 1866 to 1879), a major text rivalled only by John Cooke’s Treatise in Nervous Diseases, published in two volumes, in 1820 and 1823, the second volume of Bright’s Reports of Medical Cases 1831, and Romberg’s Manual of the Nervous Diseases of Man 1840 [13].\n\nRussell Reynolds practiced at a time when neurology was in its infancy. It relied on clinical description and elementary pathology. In this morass of evolving knowledge, Reynolds formulated a classification of neurological diseases that remains the kernel of modern systems. His work in neurology linked the highly original physiological and clinical works of his mentor, Marshall Hall, to Hughlings Jackson’s intellectual explorations of the brain’s complex functions and hierarchies, and to the more systematic descriptive neurology of William Gowers [12]. His students included Charlton Bastian (1837-1915) and Sir William Gowers (1845-1915), whose writings often reflect his influence.\n\nLegacy\n\nHe was well versed in poetry, philosophy, art, and music. He was married, first, to Margaret Ainslie, and, secondly, to Frances Crespigny, but left no children. He died aged 68 of ‘pulmonary congestion’ at his home in 1896.\n\nThe scholarship and clinical advances made by Reynolds can be seen as important influences on contemporary and also later notable neurologists at the National Hospital. He bridged the eras of Victorian Neurology with that of the dawning 20th century.\n\nHe was noted as:\n\nA man of scholarship and wisdom, in his presidential address in 1894, in a spirit of prophecy he warned the subject-ridden student of to day of the danger of becoming entangled in the net of an ill-considered and misunderstood technical phraseology, and of juggling with words when he ought to be dealing with concrete things. [2]\n\nAnd Eadie characterised him as:\n\nA most eminent, scholarly, and influential physician who was greatly respected and admired by his contemporaries…the sort of man whose ideas would not readily be discarded because it might almost seem disrespectful to do so unless a better alternative could be clearly demonstrated to exist. [12]\n\n* So-called dissenters (Catholics, Jews, and Quakers) were denied admission because their religious beliefs prevented their taking an oath to adhere to the 39 articles of the Anglican Church. This was abolished by the Universities Tests Act in 1871.\n\nWomen had studied at Oxford since the 1870s. But until 1921, they were not entitled to claim the degrees they had earned. Cambridge followed in 1947.\n\nReferences\n\nBrown GH. Munk’s Roll. Lives of the Fellows of the Royal College of Physicians of London (1826-1925). London: The Royal College of Physicians, 1955;IV:116-7. Obituary Sir J. Russell Reynolds, MD, FRCP, FRS. Brit Med J 1896;1: 1422-3 https://doi.org/10.1136/bmj.1.1849.1422 Pearce J.M.S.. The life and work of Marshall Hall. Quarterly Journal of Medicine, 1997;90:801-803. https://doi.org/10.1093/qjmed/90.12.801 Reynolds JR. On the pathology of convulsions, with special reference to those children. Liverpool Med Chir J 1858;2:1-14. Reynolds JR. Epilepsy: its symptoms. In: Treatment and relation to other chronic convulsive diseases. London: John Churchill, 1861:8-10. Reynolds J . In: Lectures on the clinical uses of electricity delivered in University College Hospital. 2nd edn. London: John A Churchill, 1873. Reynolds JR. Therapeutic uses and toxic effects of Cannabis indica. The Lancet 1890;1:639. Pearce JMS. Positive and negative cerebral symptoms: the roles of Russell Reynolds and Hughlings Jackson. Journal of Neurology Neurosurgery and Psychiatry 2004;75:1148 https://doi.org/10.1136/jnnp.2004.038422 Spencer H . Principles of psychology. London: Longman, Brown, Green, 1855. https://doi.org/10.1037/14065-000 Jackson JH. Remarks on dissolution of the nervous system as exemplified by certain post-epileptic conditions. Medical Press and Circular 1881;329. Wilson SAK. Modern Problems in Neurology. London: Edward Arnold; 1928. https://doi.org/10.1136/bmj.2.3541.914 Eadie MJ. The neurological legacy of John Russell Reynolds (1828-1896). J Clin Neurosci. 2007;(4):309-16. Epub 2007 Jan 22. https://doi.org/10.1016/j.jocn.2006.03.033 Romberg MH. (Translated by Sieveking EH.) A Manual of the Nervous Diseases of Man. London: New Sydenham Society; 1853."}, {"url": "https://peoplepill.com/people/john-russell-reynolds/", "page_content": "Sir John Russell Reynolds, 1st Baronet (22 May 1828 – 29 May 1896) was a British neurologist and physician.\n\nReynolds was born in Romsey, Hampshire, as son of John Reynolds, an independent minister, and grandson of Dr. Henry Revell Reynolds. He received general education from his father, and was educated in his profession at University College, London, where he obtained three gold medals in the medical school. In 1851 he graduated M.B. in the university of London, and obtained a scholarship and gold medal in medicine. In 1852 he took the degree of M.D., and began practice in Leeds. He soon after moved to London, and took a house, 38 Grosvenor Street, in which Dr. Marshall Hall had lived. Hall announced to his patients in a printed circular that Reynolds had succeeded him in practice. Such procedure was contrary to a recognised understanding among physicians, and Hall incurred the censure of the College of Physicians. Reynolds, who was ignorant of Hall's intention, was in no way responsible for the circular, and was in no way involved in the censure. He was duly elected a fellow of the college in 1859. In the same year he was appointed assistant physician to University College Hospital, to which he continued attached throughout life. He had before been, in 1855, assistant physician to the Hospital for Sick Children, and in 1857 assistant physician to the Westminster Hospital. In 1865 he became professor of the principles and practice of medicine at University College, and in 1878 he was appointed physician-in-ordinary to the queen's household. He gained a considerable practice as a physician, and was often consulted in difficult cases of nervous disease. In 1869 he was elected a fellow of the Royal Society, and in 1883 vice-president of the Royal Medical and Chirurgical Society. He delivered the Lumleian lecture at the College of Physicians in 1867, the Harveian oration in 1884, and was elected president in 1893, on the death of Sir Andrew Clark. He was re-elected in 1894 and 1895, and on 1 January in the latter year was created a baronet. In the winter of 1895–6 he became too ill to offer himself for re-election as president of the College of Physicians. He died at his house in Grosvenor Street, London, after several weeks of illness of a pulmonary congestion, on 29 May 1896. He was married, first, to Miss Ainslie, and, secondly, to Frances, widow of C. J. C. Crespigny, but left no children.\n\nThe Reynolds Baronetcy, of Grosvenor Street, was created in the Baronetage of the United Kingdom on 28 February 1895 for John Russell Reynolds. The title became extinct on his death.\n\nReynolds devoted himself from an early period to the study of nervous diseases, and in 1854 published an Essay on Vertigo; in 1855 Diagnosis of Diseases of the Brain, Spinal Cord, and Nerves, as well as Tables for the Diagnosis of Diseases of the Brain; in 1861 a treatise on epilepsy; in 1871 Lectures on the Clinical Uses of Electricity; in 1872 The Scientific Value of the Legal Tests of Insanity; besides many papers in medical periodicals and the transactions of medical societies, and several addresses to medical associations. His writings on nervous diseases were useful contributions to a department of medicine in which much work remained undone, but in the flood of modern observations they have been submerged. He will chiefly be remembered among physicians as the editor of the System of Medicine, in five volumes, published from 1866 to 1879, a collection of essays on diseases, written by the most competent men who could be induced to write—compositions of varying merit, but generally of high value. He himself wrote the parts on erysipelas, on inflammation of the lymphatics, and on several forms of nervous disease. He published in 1893 a Life of Dr. Walter Hayle Walshe. Reynolds was a tall man, with dark hair, with a dignified delivery and some oratorical power.\n\nReynolds died in London."}, {"url": "https://alchetron.com/John-Russell-Reynolds", "page_content": "Sir John Russell Reynolds, 1st Baronet (22 May 1828 – 29 May 1896) was a British neurologist and physician.\n\nReynolds was born in Romsey, Hampshire, as son of John Reynolds, an independent minister, and grandson of Dr. Henry Revell Reynolds. He received general education from his father, and was educated in his profession at University College, London, where he obtained three gold medals in the medical school. In 1851 he graduated M.B. in the university of London, and obtained a scholarship and gold medal in medicine. In 1852 he took the degree of M.D., and began practice in Leeds. He soon after moved to London, and took a house, 38 Grosvenor Street, in which Dr. Marshall Hall had lived. Hall announced to his patients in a printed circular that Reynolds had succeeded him in practice. Such procedure was contrary to a recognised understanding among physicians, and Hall incurred the censure of the College of Physicians. Reynolds, who was ignorant of Hall's intention, was in no way responsible for the circular, and was in no way involved in the censure. He was duly elected a fellow of the college in 1859. In the same year he was appointed assistant physician to University College Hospital, to which he continued attached throughout life. He had before been, in 1855, assistant physician to the Hospital for Sick Children, and in 1857 assistant physician to the Westminster Hospital. In 1865 he became professor of the principles and practice of medicine at University College, and in 1878 he was appointed physician-in-ordinary to the queen's household. He gained a considerable practice as a physician, and was often consulted in difficult cases of nervous disease. In 1869 he was elected a fellow of the Royal Society, and in 1883 vice-president of the Royal Medical and Chirurgical Society. He delivered the Lumleian lecture at the College of Physicians in 1867, the Harveian oration in 1884, and was elected president in 1893, on the death of Sir Andrew Clark. He was re-elected in 1894 and 1895, and on 1 January in the latter year was created a baronet. In the winter of 1895–6 he became too ill to offer himself for re-election as president of the College of Physicians. He died at his house in Grosvenor Street, London, after several weeks of illness of a pulmonary congestion, on 29 May 1896. He was married, first, to Miss Ainslie, and, secondly, to Frances, widow of C. J. C. Crespigny, but left no children.\n\nThe Reynolds Baronetcy, of Grosvenor Street, was created in the Baronetage of the United Kingdom on 28 February 1895 for John Russell Reynolds. The title became extinct on his death.\n\nReynolds devoted himself from an early period to the study of nervous diseases, and in 1854 published an Essay on Vertigo; in 1855 Diagnosis of Diseases of the Brain, Spinal Cord, and Nerves, as well as Tables for the Diagnosis of Diseases of the Brain; in 1861 a treatise on epilepsy; in 1871 Lectures on the Clinical Uses of Electricity; in 1872 The Scientific Value of the Legal Tests of Insanity; besides many papers in medical periodicals and the transactions of medical societies, and several addresses to medical associations. His writings on nervous diseases were useful contributions to a department of medicine in which much work remained undone, but in the flood of modern observations they have been submerged. He will chiefly be remembered among physicians as the editor of the System of Medicine, in five volumes, published from 1866 to 1879, a collection of essays on diseases, written by the most competent men who could be induced to write—compositions of varying merit, but generally of high value. He himself wrote the parts on erysipelas, on inflammation of the lymphatics, and on several forms of nervous disease. He published in 1893 a Life of Dr. Walter Hayle Walshe. Reynolds was a tall man, with dark hair, with a dignified delivery and some oratorical power.\n\nReynolds died in London."}, {"url": "https://wiki2.org/en/John_Russell_Reynolds", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nBritish neurologist and physician\n\nSir John Russell Reynolds, 1st Baronet (22 May 1828 – 29 May 1896) was a British neurologist and physician.\n\nReynolds was born in Romsey, Hampshire, as son of John Reynolds, an independent minister, and grandson of Dr. Henry Revell Reynolds. He received general education from his father, and was educated in his profession at University College, London, where he obtained three gold medals in the medical school. In 1851 he graduated M.B. in the university of London, and obtained a scholarship and gold medal in medicine. In 1852 he took the degree of M.D., and began practice in Leeds. He soon after moved to London, and took a house, 38 Grosvenor Street, in which Dr. Marshall Hall had lived. Hall announced to his patients in a printed circular that Reynolds had succeeded him in practice. Such procedure was contrary to a recognised understanding among physicians, and Hall incurred the censure of the College of Physicians. Reynolds, who was ignorant of Hall's intention, was in no way responsible for the circular, and was in no way involved in the censure. He was duly elected a fellow of the college in 1859. In the same year he was appointed assistant physician to University College Hospital, to which he continued attached throughout life. He had before been, in 1855, assistant physician to the Hospital for Sick Children, and in 1857 assistant physician to the Westminster Hospital. In 1865 he became professor of the principles and practice of medicine at University College, and in 1878 he was appointed physician-in-ordinary to the queen's household. He gained a considerable practice as a physician, and was often consulted in difficult cases of nervous disease. In 1869 he was elected a fellow of the Royal Society, and in 1883 vice-president of the Royal Medical and Chirurgical Society. He delivered the Lumleian lecture at the College of Physicians in 1867, the Harveian oration in 1884, and was elected president in 1893, on the death of Sir Andrew Clark. He was re-elected in 1894 and 1895, and on 1 January in the latter year was created a baronet. In the winter of 1895–6 he became too ill to offer himself for re-election as president of the College of Physicians. He died at his house in Grosvenor Street, London, after several weeks of illness of a pulmonary congestion, on 29 May 1896. He was married, first, at St Pancras Old Church, London, on 28 August 1852 to Margaretta Susannah Ainslie (1831-1880) and, secondly, to Frances (Plunkett) Reynolds widow of C. J. C. Crespign, but left no children.\n\nThe Reynolds Baronetcy, of Grosvenor Street, was created in the Baronetage of the United Kingdom on 28 February 1895 for John Russell Reynolds.[1] The title became extinct on his death.\n\nReynolds devoted himself from an early period to the study of nervous diseases, and in 1854 published an Essay on Vertigo; in 1855 Diagnosis of Diseases of the Brain, Spinal Cord, and Nerves, as well as Tables for the Diagnosis of Diseases of the Brain; in 1861 a treatise on epilepsy; in 1871 Lectures on the Clinical Uses of Electricity; in 1872 The Scientific Value of the Legal Tests of Insanity; besides many papers in medical periodicals and the transactions of medical societies, and several addresses to medical associations. His writings on nervous diseases were useful contributions to a department of medicine in which much work remained undone, but in the flood of modern observations they have been submerged. He will chiefly be remembered among physicians as the editor of the System of Medicine, in five volumes, published from 1866 to 1879, a collection of essays on diseases, written by the most competent men who could be induced to write—compositions of varying merit, but generally of high value. He himself wrote the parts on erysipelas, on inflammation of the lymphatics, and on several forms of nervous disease. He published in 1893 a Life of Dr. Walter Hayle Walshe. Reynolds was a tall man, with dark hair, with a dignified delivery and some oratorical power.\n\nReynolds died in London.\n\nReferences"}, {"url": "https://www.wikizero.com/www//John_Russell_Reynolds", "page_content": "British neurologist and physician\n\nSir John Russell Reynolds, 1st Baronet (22 May 1828 – 29 May 1896) was a British neurologist and physician.\n\nReynolds was born in Romsey, Hampshire, as son of John Reynolds, an independent minister, and grandson of Dr. Henry Revell Reynolds. He received general education from his father, and was educated in his profession at University College, London, where he obtained three gold medals in the medical school. In 1851 he graduated M.B. in the university of London, and obtained a scholarship and gold medal in medicine. In 1852 he took the degree of M.D., and began practice in Leeds. He soon after moved to London, and took a house, 38 Grosvenor Street, in which Dr. Marshall Hall had lived. Hall announced to his patients in a printed circular that Reynolds had succeeded him in practice. Such procedure was contrary to a recognised understanding among physicians, and Hall incurred the censure of the College of Physicians. Reynolds, who was ignorant of Hall's intention, was in no way responsible for the circular, and was in no way involved in the censure. He was duly elected a fellow of the college in 1859. In the same year he was appointed assistant physician to University College Hospital, to which he continued attached throughout life. He had before been, in 1855, assistant physician to the Hospital for Sick Children, and in 1857 assistant physician to the Westminster Hospital. In 1865 he became professor of the principles and practice of medicine at University College, and in 1878 he was appointed physician-in-ordinary to the queen's household. He gained a considerable practice as a physician, and was often consulted in difficult cases of nervous disease. In 1869 he was elected a fellow of the Royal Society, and in 1883 vice-president of the Royal Medical and Chirurgical Society. He delivered the Lumleian lecture at the College of Physicians in 1867, the Harveian oration in 1884, and was elected president in 1893, on the death of Sir Andrew Clark. He was re-elected in 1894 and 1895, and on 1 January in the latter year was created a baronet. In the winter of 1895–6 he became too ill to offer himself for re-election as president of the College of Physicians. He died at his house in Grosvenor Street, London, after several weeks of illness of a pulmonary congestion, on 29 May 1896. He was married, first, at St Pancras Old Church, London, on 28 August 1852 to Margaretta Susannah Ainslie (1831-1880) and, secondly, to Frances (Plunkett) Reynolds widow of C. J. C. Crespign, but left no children.\n\nThe Reynolds Baronetcy, of Grosvenor Street, was created in the Baronetage of the United Kingdom on 28 February 1895 for John Russell Reynolds.[1] The title became extinct on his death.\n\nReynolds devoted himself from an early period to the study of nervous diseases, and in 1854 published an Essay on Vertigo; in 1855 Diagnosis of Diseases of the Brain, Spinal Cord, and Nerves, as well as Tables for the Diagnosis of Diseases of the Brain; in 1861 a treatise on epilepsy; in 1871 Lectures on the Clinical Uses of Electricity; in 1872 The Scientific Value of the Legal Tests of Insanity; besides many papers in medical periodicals and the transactions of medical societies, and several addresses to medical associations. His writings on nervous diseases were useful contributions to a department of medicine in which much work remained undone, but in the flood of modern observations they have been submerged. He will chiefly be remembered among physicians as the editor of the System of Medicine, in five volumes, published from 1866 to 1879, a collection of essays on diseases, written by the most competent men who could be induced to write—compositions of varying merit, but generally of high value. He himself wrote the parts on erysipelas, on inflammation of the lymphatics, and on several forms of nervous disease. He published in 1893 a Life of Dr. Walter Hayle Walshe. Reynolds was a tall man, with dark hair, with a dignified delivery and some oratorical power.\n\nReynolds died in London."}, {"url": "https://everything.explained.today/Sir_John_Russell_Reynolds%2C_1st_Baronet/", "page_content": "John Russell Reynolds Explained\n\nSir John Russell Reynolds, 1st Baronet Birth Place: Romsey, Hampshire, England Death Place: London, England Nationality: British Occupation: Neurologist\n\nSir John Russell Reynolds, 1st Baronet (22 May 1828 – 29 May 1896) was a British neurologist and physician.\n\nReynolds was born in Romsey, Hampshire, as son of John Reynolds, an independent minister, and grandson of Dr. Henry Revell Reynolds. He received general education from his father, and was educated in his profession at University College, London, where he obtained three gold medals in the medical school. In 1851 he graduated M.B. in the university of London, and obtained a scholarship and gold medal in medicine. In 1852 he took the degree of M.D., and began practice in Leeds. He soon after moved to London, and took a house, 38 Grosvenor Street, in which Dr. Marshall Hall had lived. Hall announced to his patients in a printed circular that Reynolds had succeeded him in practice. Such procedure was contrary to a recognised understanding among physicians, and Hall incurred the censure of the College of Physicians. Reynolds, who was ignorant of Hall's intention, was in no way responsible for the circular, and was in no way involved in the censure. He was duly elected a fellow of the college in 1859. In the same year he was appointed assistant physician to University College Hospital, to which he continued attached throughout life. He had before been, in 1855, assistant physician to the Hospital for Sick Children, and in 1857 assistant physician to the Westminster Hospital. In 1865 he became professor of the principles and practice of medicine at University College, and in 1878 he was appointed physician-in-ordinary to the queen's household. He gained a considerable practice as a physician, and was often consulted in difficult cases of nervous disease. In 1869 he was elected a fellow of the Royal Society, and in 1883 vice-president of the Royal Medical and Chirurgical Society. He delivered the Lumleian lecture at the College of Physicians in 1867, the Harveian oration in 1884, and was elected president in 1893, on the death of Sir Andrew Clark. He was re-elected in 1894 and 1895, and on 1 January in the latter year was created a baronet. In the winter of 1895–6 he became too ill to offer himself for re-election as president of the College of Physicians. He died at his house in Grosvenor Street, London, after several weeks of illness of a pulmonary congestion, on 29 May 1896. He was married, first, at St Pancras Old Church, London, on 28 August 1852 to Margaretta Susannah Ainslie (1831-1880) and, secondly, to Frances (Plunkett) Reynolds widow of C. J. C. Crespign, but left no children.\n\nThe Reynolds Baronetcy, of Grosvenor Street, was created in the Baronetage of the United Kingdom on 28 February 1895 for John Russell Reynolds. The title became extinct on his death.\n\nReynolds devoted himself from an early period to the study of nervous diseases, and in 1854 published an Essay on Vertigo; in 1855 Diagnosis of Diseases of the Brain, Spinal Cord, and Nerves, as well as Tables for the Diagnosis of Diseases of the Brain; in 1861 a treatise on epilepsy; in 1871 Lectures on the Clinical Uses of Electricity; in 1872 The Scientific Value of the Legal Tests of Insanity; besides many papers in medical periodicals and the transactions of medical societies, and several addresses to medical associations. His writings on nervous diseases were useful contributions to a department of medicine in which much work remained undone, but in the flood of modern observations they have been submerged. He will chiefly be remembered among physicians as the editor of the System of Medicine, in five volumes, published from 1866 to 1879, a collection of essays on diseases, written by the most competent men who could be induced to write—compositions of varying merit, but generally of high value. He himself wrote the parts on erysipelas, on inflammation of the lymphatics, and on several forms of nervous disease. He published in 1893 a Life of Dr. Walter Hayle Walshe. Reynolds was a tall man, with dark hair, with a dignified delivery and some oratorical power.\n\nReynolds died in London.\n\nExternal links"}, {"url": "https://history.rcplondon.ac.uk/inspiring-physicians/russell-john-reynolds", "page_content": "Russell John Reynolds was the son of Dr John Reynolds, a general practitioner in Streatham, who with Sir William Crookes constructed the X-ray apparatus now in the Science Museum, South Kensington. His mother was Caroline Harriets, daughter of Dr Trott. From Westminster School he went to Guy’s Hospital and after two years in practice with his father set up as a full time radiologist in 1920. In World War I he served with the R.A.M.C, in home hospitals until 1917 when he became electrical specialist to the Karachi Brigade in India, returning home in 1919. In 1921 he was appointed physician-in-charge of the X-ray departments of Charing Cross and the National Hospitals; his son, Seymour, succeeded him at Charing Cross in 1946, and he retired from the National Hospital in 1939.\n\nFor many years he was adviser in radiology to the Ministry of Pensions and Supply and an examiner to Cambridge University, the Conjoint Board, the Faculty of Radiologists and the R.A.M.C. On his retirement in 1946 he acted as honorary consulting radiologist to the Charing Cross, National, Samaritan, Bethlem Royal and Lambeth Hospitals, and to the Caernarvon and Anglesey Infirmary.\n\nFrom 1924 he had experimented with methods of cineradiography, pioneering in photofluorography with a very wide aperture camera lens. His success brought worldwide recognition. He was president of the British Institute of Radiology and of the section of radiology of the Royal Society of Medicine, warden of the Fellowship of the Faculty of Radiologists, Hunterian professor of the Royal College of Surgeons in 1936, and was awarded the Antoine Beclere award in Paris in 1957.\n\nIn addition he was made a member of the Canadian Radiological Society, the American Roentgen Ray Society, the New York Roentgen Society, the Association of Physicians of Vienna and the Society of Radiologists of Italy; the Australian College of Radiology elected him a fellow.\n\nHe was the author of many publications, particularly in his specialised field of cineradiography which culminated in the production of the Russell Reynolds cineradiographic unit. His paper on the early history of radiology in Britain was published in Clinical Radiology (1961, 12, 136-42).\n\nReynolds was quiet, unassuming and kindly; his strong personality was shown only in his teaching, which brought him the enthusiasm of students and the deep respect of his colleagues. In 1908 he married Anna Thekla Henriette, daughter of Adolf Romer, a banker. They had two sons, Seymour and Stewart, both of whom became consultant radiologists.\n\nRichard R Trail\n\n[Brit.med.J., 1964, 2, 1271 (p), 1403; Charing Cr. Hosp. Gaz., 1964, 62, 233-4 (p); Clin.Radiol., 1965, 16, 191-2; Lancet, 1964, 2, 1071; Med. biol. Ill., 1966, 16, 44-7; Times, 1 Nov. 1964.]"}, {"url": "https://www.britannica.com/biography/Joshua-Reynolds", "page_content": "Joshua Reynolds , in full Sir Joshua Reynolds , (born July 16, 1723, Plympton, Devon , England—died February 23, 1792, London), portrait painter and aesthetician who dominated English artistic life in the middle and late 18th century. Through his art and teaching, he attempted to lead British painting away from the indigenous anecdotal pictures of the early 18th century toward the formal rhetoric of the continental Grand Style. With the founding of the Royal Academy in 1768, Reynolds was elected its first president and knighted by King George III .\n\nBack in Devon in 1746, he painted a large group portrait of the Eliot family (c. 1746/47), which clearly indicates that he had studied the large-scale portrait of the Pembroke family (1634–35) by the Flemish Baroque painter Sir Anthony Van Dyck , whose style of portrait painting influenced English portraiture throughout the 18th century. In 1749 Reynolds sailed with his friend Augustus Keppel to Minorca, one of the Balearic Islands off the Mediterranean coast of Spain. A fall from a horse detained him for five months and permanently scarred his lip—the scar being a prominent feature in his subsequent self-portraits. From Minorca he went to Rome, where he remained for two years, devoting himself to studying the great masterpieces of ancient Greco-Roman sculpture and of Italian painting. The impressions that he retained from this visit were to inspire his paintings and his Discourses for the rest of his life, for he felt that it was by allying painting with scholarship that he could best achieve his ambition of raising the status of his profession back in England . While returning home via Florence, Bologna, and Venice, he became absorbed by the compositions and colour of the great Renaissance Venetian painters of the 16th century: Titian, Jacopo Tintoretto, and Paolo Veronese . The Venetian tradition’s emphasis on colour and the effect of light and shading had a lasting influence on Reynolds, and, although all his life he preached the need for young artists to study the sculptural definition of form characteristic of Florentine and Roman painters, his own works are redolent of the Venetian style.\n\nReynolds attended the Plympton grammar school of which his father, a clergyman, was master. The young Reynolds became well read in the writings of classical antiquity and throughout his life was to be much interested in literature, counting many of the finest British authors of the 18th century among his closest friends. Reynolds early aspired to become an artist, and in 1740 he was apprenticed for four years in London to Thomas Hudson , a conventional portraitist and the pupil and son-in-law of Jonathan Richardson. In 1743 he returned to Devon and began painting at Plymouth naval portraits that reveal his inexperience. Returning to London for two years in 1744, he began to acquire a knowledge of the old masters and an independent style marked by bold brushwork and the use of impasto, a thick surface texture of paint, such as in his portrait of Captain the Honourable John Hamilton (1746).\n\nLater years\n\nIn 1753 Reynolds settled in London, where he was to live for the rest of his life. His success was assured from the first, and by 1755 he was employing studio assistants to help him execute the numerous portrait commissions he received. The early London portraits have a vigour and naturalness about them that is perhaps best exemplified in a likeness of Honourable Augustus Keppel (1753–54). The pose is not original, being a reversal of the Apollo Belvedere, an ancient Roman copy of a mid-4th-century-bc Hellenistic statue Reynolds had seen in the Vatican. But the fact that the subject (who was a British naval officer) is shown striding along the seashore introduced a new kind of vigour into the tradition of English portraiture. In these first years in London, Reynolds’s knowledge of Venetian painting is very apparent in such works as the portraits of Lord Cathcart (1753/54) and Lord Ludlow (1755). Of his domestic portraits, those of Nelly O’Brien (1760–62) and of Georgiana, Countess Spencer, and her daughter (1761) are especially notable for their tender charm and careful observation.\n\nBritannica Quiz Can You Match These Lesser-Known Paintings to Their Artists?\n\nAfter 1760 Reynolds’s style became increasingly classical and self-conscious. As he fell under the influence of the classical Baroque painters of the Bolognese school of the 17th century and the archaeological interest in Greco-Roman antiquity that was sweeping Europe at the time, the pose and clothes of his sitters took on a more rigidly antique pattern, in consequence losing much of the sympathy and understanding of his earlier works.\n\nThere were no public exhibitions of contemporary artists in London before 1760, when Reynolds helped found the Society of Artists and the first of many successful exhibitions was held. The patronage of George III was sought, and in 1768 the Royal Academy was founded. Although Reynolds’s painting had found no favour at court, he was the obvious candidate for the presidency, and the king confirmed his election and knighted him. Reynolds guided the policy of the academy with such skill that the pattern he set has been followed with little variation ever since. The yearly Discourses that he delivered at the academy clearly mirrored many of his own thoughts and aspirations, as well as his own problems of line versus colour and public and private portraiture, and gave advice to those beginning their artistic careers.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nFrom 1769 nearly all of Reynolds’s most important works appeared in the academy. In certain exhibitions he included historical pieces, such as Ugolino (1773), which were perhaps his least successful works. Many of his child studies are tender and even amusing, though now and again the sentiment tends to be excessive. Two of the most enchanting are Master Crewe as Henry VIII (1775–76) and Lady Caroline Scott as ‘Winter’ (1778). His most ambitious portrait commission was the Family of the Duke of Marlborough (1777).\n\nIn 1781 Reynolds visited Flanders and Holland, where he studied the work of the great Flemish Baroque painter Peter Paul Rubens. This seems to have affected his own style, for in the manner of Rubens’s later works the texture of his picture surface becomes far richer. This is particularly true of his portrait of the duchess of Devonshire and her daughter (1786). Reynolds was never a mere society painter or flatterer. It has been suggested that his deafness gave him a clearer insight into the character of his sitters, the lack of one faculty sharpening the use of his eyes. His vast learning allowed him to vary his poses and style so often that the well-known remark of Thomas Gainsborough, “Damn him, how various he is!” is entirely understandable. In 1782 Reynolds had a paralytic stroke, and about the same time he was saddened by bickerings within the Royal Academy. Seven years later his eyesight began to fail, and he delivered his last Discourse at the academy in 1790. He died in 1792 and was buried in St. Paul’s Cathedral."}], "John Russell Reynolds was educated at Eton College and Trinity College, Cambridge.": [{"url": "https://history.rcplondon.ac.uk/inspiring-physicians/sir-john-russell-reynolds", "page_content": "Russell Reynolds was born at Romsey in Hampshire, the son of John Reynolds, a nonconformist minister, and grandson of Henry Revell Reynolds, F.R.C.P, physician to the Middlesex and St. Thomas’s Hospitals and Physician-in-Ordinary to George III. His father gave him the greater part of his general education and University College, London, his medical training. He graduated in 1851 as University scholar and gold medallist in physiology, comparative anatomy and medicine. For so outstanding a student, a great future seemed assured. But his means were slender and he decided to begin practice in Leeds where he had relatives. However, his old teacher Marshall Hall persuaded him to return to London, offering him his house in Grosvenor Street on favourable terms. His enterprise was rewarded by appointments as assistant physician to the Hospital for Sick Children in 1855, the Westminster Hospital in 1857 and University College Hospital in 1859. After a further three years, he became full physician and Holme professor of clinical medicine at University College, and in 1867 he succeeded Jenner in the chair of medicine.\n\nReynolds gave distinguished service to the Royal College of Physicians, being Lumleian Lecturer in 1867, Harveian Orator in 1884, Censor, and finally, from 1893 to 1896, President. He was chosen as Physician to the Royal Household in 1879 and, with his friend, J. E. Erichsen, created a baronet in 1895. He was president of the B.M.A. at the time of his death. But he made his mark in the profession chiefly by his early writings on nervous diseases — he was one of the first to propound the possibilities of electricity as a therapeutic agent — and by his editorship of the System of Medicine, published in five volumes between 1866 and 1879. He was a fluent and popular lecturer and a careful and sympathetic physician. Somewhat shy and grave of mien, he could reveal both a quiet humour and a directness of speech that was no respecter of persons. Painting and music were his recreations, and he was well read in literature. He was married, firstly, to a Miss Ainslie and, secondly to Frances, widow of C. J. C. Crespigny, but left no children. He died at his house in Grosvenor Street.\n\nG H Brown\n\n[Lancet, 1896; B.M.J., 1896; D.N.B., xlviii, 52]"}, {"url": "https://www.bbc.com/culture/article/20210413-the-school-that-rules-britain", "page_content": "Bond's creator's time at Eton was longer but no more distinguished. Ian Fleming took the traditional route to the school – he was the son of an old Etonian army major – but failed to perform academically and was removed from the school by his mother before he could fail to graduate. He did at least kick off his writing career at Eton, publishing his first story in the school magazine The Wyvern. Fleming also named the Bond villain Blofeld after an old classmate, but his feelings for Eton are best encapsulated in the James Bond All Purpose Grand Challenge Trophy Vase he presented to the Old Etonian Golfing Society – which was in fact a chamber pot.\n\nFleming isn't the only writer to have a complicated relationship with the school. George Orwell, who attended on a scholarship and whose old school tie didn't quite fit such a man of the people, later disdained Eton, saying that although he was \"relatively happy\" at the school, he \"did no work there and learned very little\". In his 1941 essay The Lion and the Unicorn, he wrote that \"probably the Battle of Waterloo was won on the playing fields of Eton, but the opening battles of all subsequent wars have been lost there. One of the dominant facts in English life during the past three-quarters of a century has been the decay of ability in the ruling class.\" The school, undeterred, maintains the Orwell Award in his name, offering fully funded places \"to talented boys whose life opportunities have been limited.\"\n\n'A place of extremes'\n\nEven for writers who didn't attend Eton, it has provided inspiration. John le Carré taught there for a year and described it as \"a place of extremes\" where \"the English upper class can be seen at their best and worst. The good pupils are often brilliant […] and take you to the limits of your knowledge. The worst pupils,\" he added, \"provide a unique insight into the criminal mind.\" These were \"riches\" for a novelist, and le Carré used Eton as inspiration for the fictional school Carne in his novel A Murder of Quality.\n\nOr take the case of Evelyn Waugh, the envious outside chronicler of the upper class, who probably wished he'd gone to Eton instead of the humbler Lancing College. And in a typical act of one-up-manship, he sent his character Sebastian Flyte there in his most nostalgic novel Brideshead Revisited. \"Thank God I went to Eton,\" sighs Sebastian during an obscure philosophical argument between family and friends. Sebastian, significantly, starts the book as the epitome of glamour but undergoes a decline as the story proceeds. (Waugh's mixed feelings about Eton may also have been coloured by the fact that his first wife, also called Evelyn, had an affair with an old Etonian.)"}, {"url": "https://www.roll-of-honour.com/Cambridgeshire/CambridgeUniversityTinityCollegeWW1.html", "page_content": "CAMBRIDGE UNIVERSITY, TRINITY COLLEGE WORLD WAR 1 WAR MEMORIAL World War 1 - Roll of Honour with detailed information\n\nCompiled and copyright © Gill Cannell & Andrew Dishman 2009 The Cambridge University, Trinity College World War 1 memorial is in the form of Trinity College Chapel at the east end of which, either side of the altar, there are oak panels are engraved with the 619 names of those who died in the First World War. The memorial dedication and inscription is carved on the floor of the pavement, in front of the high altar. [date] indicates date of matriculation.\n\n(1914) indicates those who were admitted for the Michaelmas Term of 1914, but who never actually matriculated.\n\nA date marked with an asterisk denotes that the person to whom the entry refers joined the College in that year by some procedure other than matriculation, e.g. by migration from another College or the non-collegiate body. The extra details here are taken from `The War List of the University of Cambridge, 1914 – 1918’ by G.V. Carey. (Cambridge University Press, 1921.) M denotes those mentioned in despatches.\n\nm denotes mentioned in the Secretary of State’s list for valuable services in connection with the war\n\nMC denotes Military Cross Photographs copyright © Gill Cannell & Andrew Dishman 2009 IUXTA FIDEM DEFUNCTI SUNT OMNES ISTI NON ACCEPTIS REPROMISSIONIBUS\n\nSED A LONGE ASPICIENTES ET SALUTANTES\n\nET CONFITENTES QUIA PEREGRINI ET HOSPITES SUNT SUPER TERRAM. All of these died in faith without having received the promises,\n\nbut from a distance they saw and greeted them.\n\nThey confessed that they were strangers and foreigners on the earth.\n\n(Hebrews 11: 13) In memory of the men of this College who gave their lives in war MCMXIV – MCMXVIII ADAMSON William [1904] Captain, Loyal N. Lancashire Regiment. Killed in action 24 April 1916 ADDY J Carleton [1910] Captain, E. Yorks. Rgt. M.C. Killed in action 3 May 1917 ALBRIGHT Martin C [1905] Major, Worcestershire Yeo. Died 8 Nov. 1917 of wounds received in action ALDERSEY Hugh [1907] Captain, Cheshire Yeo. Killed in action 10 March 1918 ALLEN John E R [1909] Lieutenant, 16th Lancers. M2. Died 8 April 1918 of wounds received in aciion ALLEN Melville R H A [1910] Lieutenant (A.), R.F.C. Killed in flying accident 21 March 1917 ALLOM Charles C G [1914] Captain, Royal Field Artillery. Died 20 Oct. 1917 of wounds received in action 9 Oct. 1917 ANDREWES Charles N [1895] Lieutenant, Labour Corps. Died 29 Nov. 1918 of influenza contracted on active service ANSELL Arthur George [1912] 2nd Lieutenant, Royal Engineers (1st Field Survey Coy.). Died 25 April 1918 of gas poisoning. aged 23. Son of A. J. and E. Ansell, of \"Liscard,\" New Rd., Solihull, Birmingham. Bachelor of Science, Trinity College, Cambridge. Buried in BOULOGNE EASTERN CEMETERY, Pas de Calais, France. Plot VII. Row B. Grave 41. APPERLY Basil L M [1911] 2nd Lieutenant, Queen\u0092s Own (R.W. Kent Regiment.). Died 19 April 1917 of wounds received in action ARMSTRONG Michael Richard Leader [1908] 2nd Lieutenant, Royal Field Artillery and 150th Field Company, Royal Engineers. Killed in action 22 April 1916. Aged 27. Son of Henry Bruce Armstrong and Margaret Armstrong, of Deans Hill, Armagh. B.A. (Mechanical Science Tripos Trinity College, Cambridge). Buried in AUTHUILE MILITARY CEMETERY, AUTHUILLE, Somme, France. Row D. Grave 69. ARNOLD-WALLINGER Geoffrey Seldon Lance Corporal 8778, Inns of Court Officer Training Corps. Died 24 September 1916. Aged 27. Son of Robert Nasmyth Arnold-Wallinger, and Maud Arnold-Wallinger, of Kitts Croft, Writtle. B.A. Trinity College (Cambs); Clerk in Holy Orders. Buried in WRITTLE (ALL SAINTS) CHURCHYARD, Essex. AUSTEN-CARTMELL Arthur James [1912] Lieutenant, 1st Battalion, King\u0092 Royal Rifle Corps. Killed in action 1 June 1916. Aged 23. Son of James Austen-Cartmell (Barrister-at-Law), of 27, Campden House Court, Kensington, London, and the late Mary Aflleck Austen-Cartmell. Educated at Eton and Trinity College, Cambridge. Buried in CABARET-ROUGE BRITISH CEMETERY, SOUCHEZ, Pas de Calais, France. Plot XV. Row M. Grave 12. BACKHOUSE Hubert E [1901] Captain, Sherwood Foresters (Notts. and Derby Regiment.). Killed in action 15 Oct. 1916 1916 BACKUS Arthur R [1913] Captain, Rifle Brigade. M.C. Accidentally killed near Neuve Eglise 22 Sept. 1917 BAINBRIGGE Philip G [1909] 2nd Lieutenant, Lancashire Fusiliers.; attd. Welsh Regiment. Killed in action 18 Sept. 1918 BALFOUR John [1913] Captain, Scots Guards.; attd. Royal Engineers. (Signals). M.C. M. Killed in action 21 March 1918 BALLAMY Harold W [1912] Lieutenant, Royal Field Artillery. (T.F.). Killed in action 15 Aug. 1917 BALLANCE Leslie A [1907] 2nd Lieutenant, London Regiment. (Civil Service Rifles); Captain, King\u0092s Royal Rifle Corps. Killed in action 28 Sept. 1916 BARBER-STARKEY William Henry J [1898] Captain, Royal Field Artillery. Died in German hands 10 Sept. 1914 of wounds received in action at Le Cateau 26 Aug. 1914 BARCLAY Thomas H [1902] Major, Surrey Yeo. Silver Medal for gallantry in saving life at sea. Drowned on H.M. transport Transylvania 4 May 1917 BARKBY Hartley No further information currently BARNSLEY T Kenneth [1911] Captain, R. Warwickshire Regiment. and Coldstream Guards. Killed in action 31 July 1917 BARTHROPP Sidney A N S [1910] 2nd Lieutenant, R. Sussex Regiment. Killed in action at Cuinchy 29 Jan. 1915 BATLEY Ralph C [1881] T.D. Major, Dorset Yeo. Died 23 Oct. 1917 BEALEY Adam C [1892] Captain, Somerset L.I. M.C. M. Died 22 Nov. 1917 of wounds received in action in Palestine BEAUMONT-NESBITT Wilfrid Henry [1913] Captain Grenadier Guards. M.C. Killed in action at Bourlon Wood 27 Nov. 1917 BECHER Maurice A N [1903] Captain, King\u0092s Own Scottish Borderers. Killed in action in Gallipoli 26 April 1915 BEDELL-SIVEWRIGHT David Revell [1899] Surgeon, R.N. Died in Gallipoli 5 Sept. 1915 BEER Arthur H [1913] Lieutenant, Royal Field Artillery. (T.F.). M.C. M. Died 21 Aprl 1918 of wounds received in action at Bethune 19 April 1918 BELL Edward V No further information currently BELL Gawain M [1896] Major, Hampshire Regiment. D.S.O. M. Killed in action in the Third Battle of Ypres 31 July 1917 BELL John James [1891] Major, Ayrshire Yeo. Died 2 March 1915 BELL William H D [1902] Captain, N. Zealand Force and K. Edward\u0092s Horse. M. Killed in action 31 July 1917 BELLEW Richard C No further information currently BENTINCK Henry D A [1899] Major, Coldstream Guards. Brevrt Major. M. Died 2 Oct. 1916 of wounds received in action 15 Sept. 1916 BETHELL Christopher [1904] Captain King\u0092s Own (Yorkshire Light Infantry. Killed in action 20 February 1916. Aged 31. Son of Col. E. H. Bethell, of 18, Hyde Park Square, London, W.2., and the late Mrs. Bethell. Barrister-at-Law of the Inner Temple. Mentioned in Despatches. Buried at CITE BONJEAN MILITARY CEMETERY, ARMENTIERES, Nord, France. Plot IX. Row F. Grave 81. Extracted information, sources: Truth, 1 March 1916 p.340, Yorkshire Post and Leeds Intelligencer, 16, 28 February 1916, 2 March 1916. Researched by Jonathan Vernon: Born 27 Dec 1884 Kirkee, Poonah, Bombay, India second son of Edward Hugh Bethell DSO, retired Colonel R.E. and mother Gertrude and grandson of the late Mr William Froggatt Betheel, or Rise Park, and Watton Abbey, Yorkshire. Of 18 Hyde Park Square, Middlesex Educated at St. Andrews College, Grahamstown, South Africa where he had a distinguished academic career graduating with honours and from 25 June 1905, Trinity College, Cambridege being President of the Cambridge Union and graduated with honours. Lawyer 1908. After leaving the university he was called to the Bar but never practiced, as he gave up his time to philanthropic work at Cambridge House, Camberwell. When war broke out he enlisted in the Coldstream Guards, and after three month’s training accepted a commission in the 10th King’s Own Yorkshire Light Infantry (KOYLI). He was promoted to Captai in August 1915. Mentioned in despatches. He was was serving with the corps in Flanders when he was killed on 20 February aged 31. Colonel Bethell’s remaining sons were both serving on active service in France. Major Hugh Keppel Bethell, 7th Hussars, commandings the 1st Northamptons (survived the war, rose to the rank of Colonel, died 3 March 1947 on his farm in Kenya), and Lieut. David Bethell in the Scots Guards. Colonel Bethel, then commanding Royal Engineers at Plymouth was about to take up an appointment in France. Extract from Driffield Times - Saturday 4 March 1916, page 2: RISE Capt. Christopher Bethell, 10th K.O.Y.L.I, is announced to have been killed in Flanders February 20tb. Aged 31 years, he was the second son of Colonel E. H. Bethell, D.S.O. R.E. and grandson of the late Mr. William Froggart Bethell, of Rise Park, and Watton Abbey. Yorkshire. He was educated at Malvern College, Grahamstown, South Africa, and Trinity College, Cambridge, where be was president of the Union and graduated with honours. Although he was called to the Bar, he for some years devoted his time and energies to philanthropic work at Cambridge House, Camberwell. When the war commenced he enlisted in the Coldstream Guards, and three months later accepted a commission id n the K.O.Y.L.I., being promoted Captain in August last. Capt. Bethell's Colonel writes. “His loss is irreparable, and he was the most self-sacrificing and bravest of men.” Colonel's Bethell’s remaining sons are both on active service in France. Extract from Yorkshire Post and Leeds Intelligencer - Saturday 26 February 1916, page 6 and Beverley and East Riding Recorder - Saturday 4 March 1916, page 5: CHRISTOPHER BETHELL, 10th K.0.Y.L.I. , is announced to have been killed in Flanders February 20. Aged 31 years, he was the second son of Colonel E. H. Betbell, D.5.O.. R.E., and grandson of the late Mr. William Froggatt Bethell, of Rise Park, and Walton Abbey, Yorkshire. He was educated at Malvern College, Grahamstown, South Africa, and Trinity College, Cambridge, where he was president of the Union and graduated with honours. Although lie was called to the Bar, he for some years devoted his time and energies to philanthropic work at Cambridge House. Camberwell. When the war commenced he enlisted in the Coldstream Guards, and three months later accepted a commission in the K.O.Y.L.I. being promoted to captain August last. Capt. Bethell’s Colonel writes: '\"His loss is irreparable, and he was the most self-sacrificing and bravest of men.\" Colonel Bethell's remaining sons are both on active service in France. Major Keppel Bethell, 7th Hussars, commands the 1st Northamptons, and Lieut. David Bethell is in the Scots Guards. Colonel Bethell, now commanding Royal Engineers at Plymouth, is about to take up an appointment in France. BINNING Lord George [[1876] C.B., M.V.O. Lieutenant-Col., Lothian and Border Horse; Brig.-Gen. Died 12 Jan. 1917 of pneumonia BION Rupert Euston [1910] Lieutenant, 20th Hussars; Lieutenant (A.), Royal Air Force. Killed in action 9 April 1918 BIRKBECK George [1913] Lieutenant, Norfolk Yeo. Died 19 Feb. 1916 BIRKBECK Gervase W [1905] Captain, Norfolk Regiment. (T.F.). M. Killed in action 19 April 1917 BLACK Donald C [1916] 2nd Lieutenant (A.), F.A.F. Killed in flying accident 23 April 1918 BLAKE George P [1898] Captain, R. Welsh Fusiliers. Killed in action 20 July 1916 BODENHAM Henry Edward C H [1914] 2nd Lieutenant, Black Watch; Lieutenant, M.G.C. Killed in action on the Somme 7 Sept. 1916 BOLITHO Geoffrey R [1911] 2nd Lieutenant, Devon Regiment. and R.F.C. Died 25 Oct. 1916 of wounds received in action BOLTON William S [1904] Sergt., R. Fusiliers (Sportsman\u0092s Bn.). Died 7 Feb. 1919 of pneumonia contracted on active service BOND Charles Gordon [1900] Captain, 2nd Battalion, Duke of Edinburgh's (Wiltshire Regiment). Killed in action 25th November 1915. Aged 34. Born 18th July 1881 in Savernake, Wilthsire. Son of the Rev. Gordon Bond, of Savernake, Wiltshire; husband of Dorothy Melian Bond, of Thistledown, Bude, Cornwall. Educated at Sherborne Collge and Cambridge University. Entered Military Service from University 1903. Height 5 feet 10½ inches. Buried in GUARDS CEMETERY, WINDY CORNER, CUINCHY, Pas de Calais, France. Plot II. Row G. Grave 6. See also Lords MCC World War 1 BONHAM-CARTER Arthur Thomas [1887] S. African Defence Force; Captain, Hampshire Regiment. m. Killed in action 1 July 1916 BONVALOT Edward St L [1910] 2nd Lieutenant, Coldstream Guards. Killed in action 9 Oct. 1915` BOSCAWEN Hon Vere D [1909] 2nd Lieutenant, Coldstream Guards. Killed in action near Ypres 29 Oct. 1914 BOWEN-COLTHURST Robert Macgregor [1902] Captain, Leinster Regiment. Killed in action 15 March 1915 BOWES-LYON Gavin P (1914) Lieutenant, Grenadier Guards. Killed in action 27 Nov. 1917 BOYD Harold A [1913] 2nd Lieutenant, R. Inniskilling Fusiliers. Killed in action 7 Sept. 1914 BRADSHAW Percival C [1914] 2nd Lieutenant, King\u0092s Own Scottish Borderers. Killed in action 1 May 1916 BRADSHAW Richard Edward K [1914] Lieutenant, London Regiment. (Rangers). Killed in action 1 July 1916 BRADSHAW W Douglas [1915] 2nd Lieutenant, Royal Field Artillery. Killed in action 31 Oct. 1916 BRAGG Robert C [1912] 2nd Lieutenant, Royal Field Artillery. Died 2 Sept. 1915 of wounds received in action in Gallipoli 1 Sept. 1915 BREESE William L [1902] 2nd Lieutenant, R. Horse Guards. Killed in action 14 March 1915 BREUL Oswald G F J (1914) Lieutenant, Royal Engineers. (Signals). M.C. Died on active service 16 Oct. 1917 BROADBENT Cecil H [1900] 2nd Lieutenant, King\u0092s Own (Yorkshire L.I., T.F.). Died 1 March 1916 of injuries received in bombing accident BRODIE Ewen James [1896] Captain, Cameron Hdrs. Killed in action 11 Nov. 1914 BROWNE Charles P [1905] Captain, Corps of Guides, Indian Army. Killed in action 11 April 1915 BROWNE Montague B [1894] 2nd Lieutenant, Sherwood Foresters (Notts. and Derby ;Regiment., T.F.). Died 30 April 1916 of wounds received in the Irish Rebellion BRUDENELL-BRUCE James Ernest J [1897] Lieutenant, Northamptonshire Yeo. Died 11 April 1917 of wounds received in action BRUNTON Edward H P [1907] Lieutenant, R.A.M.C. Killed in action 8 Oct. 1915 BUCHANAN Arthur N [1903] Lieutenant (T.), Royal Air Force.Died 14 Oct. 1918 of pneumonia BUCKLAND Thomas A [1911] Lieutenant, Norfolk Regiment. M. Died 18 Oct. 1915 of wounds received in action 13 Oct. 1915 BUDENBERG Donald H [1915] Captain, Manchester Regiment. Killed in action near Voormezeele 25 April 1918 BULLIVANT Ritchie P [1902] Captain, London Yeo. (Middlesex Hussars). M.C. Killed in action 24 Sept. 1918 BURNABY Geoffrey [193] Lieutenant, London Regiment. (R. Fusiliers.). Died 23 Oct. 1916 of wounds received in action BURNAND Cyril F [1910] 2nd Lieutenant Grenadier Guards. Killed in action 11 March 1915 BURRELL Raymond F T [1908] 2nd Lieutenant, Queen\u0092s Own (R.W. Kent Regiment.) Killed in action 26 Sept. 1915 BUTCHER W Guy D [1910] Captain, London Regiment. (L.R.B.). Killed in action at Glencorse Wood 16 Aug. 1917 BUTLER Gordon Kerr Montagu [1910] Lieutenant, 2nd Scottish Horse [Territorial] attached Machine Gun Corps. Died on service in Egypt 17 July 1916. Aged 23. Baptised 12 December 1891 at Cambridge, All Saints, son of Henry Montagu and Agnata Frances Butler, of Trinity Lodge, Trinity College, Cambridge. Son of H. Montagu Butler and Agnata F. Butler, of Trinity Lodge, Cambridge. Educated 1905-1910 Harrow School, Harrow, Middlesex, son of Dr H M Butler. Buried in KANTARA WAR MEMORIAL CEMETERY, Egypt. Plot C. Grave 18. See also Cambridge, St Faith's School and also Cambridge Guildhall Extract from England & Wales Government Probate Death Index 1917: BUTLER Gordon Kerr Montagu of Trinity Lodge Cambridge lieutenant in Scottish Horse died 17 July 1916 in Egypt Administration Peterborough 15 January to the reverend Henry Montagu Butler trinity college master.\n\nEffects £390 13s. 11d. BUTLER J Ormonde No further information currently BUTLER William Martin [1901] Major, 1st Siege Company Royal Monmouthshire, Royal Engineers. (T.F.). Died 5 March 1919. Aged 36. Son of Arthur John and Mary Caroline Butler, of Woodend, Weybridge, Surrey, husband of Enid Butler. Educated at Eton and Trinity College, Cambridge. A civil engineer. Buried in VALENCIENNES (ST. ROCH) COMMUNAL CEMETERY, Nord, France. Plot II. Row C. Grave 20. BUTLIN Sir H Guy T , Bart [1911] Captain, Cambridgeshire Regiment. M. Killed in action 16 Sept. 1916 BUXTON Andrew R [1898] Captain, Rifle Brigade. Killed in action 7 June 1917 BUXTON Jocelyn Murray Victor Second Lieutenant, 6th Battalion, Rifle Brigade attached 25th Company, Machine Gun Corps (Infantry). Died 1 July 1916. Aged 20. Son of the late Sir T. F. Victor Buxton, 4th Bart., and of Lady Buxton, of \"Warlies\", Waltham Abbey, Essex. Educated at Broadstairs and Marlborough. Gained a History Exhibition at Trinity College, Cambridge. No known grave. Commemorated at THIEPVAL MEMORIAL, Somme, France. Pier and Face 16 B and 16 C. CAMPBELL Islay M (1914) Lieutenant, Sussex Yeo.; attd. R. Sussex Regiment. Died 4 April 1918 of wounds received in action CAMPBELL John A [1897] Lieutenant, 6th (Inniskilling) Dragoons. Died in Germany 2 Dec. 1917 of wounds received in action CAMPBELL-JOHNSTON Patrick Seymour C [1913] Leiut., Royal Field Artillery.; A.D.C. M.C. Belgian Croix de Guerre. Died 30 Aug. 1919 of wounds received in action 21 May 1918 CARLESS Hugh D No further information currently CARLILE E H Hanbury [1899] Captain Hertfordshire Yeo.; attd Hertfordshire Regiment. Killed in action 22 March 1918 CARVER Oswald Armitage [1905] Captain, 1st/2nd (East Lancashire), Royal Engineers. Died of wounds 8 June 1915. Aged 28. Son of Oswald William and Kate Carver, of Holmes Chapel, Cheshire; husband of Elizabeth A. N. (nee Hobart) Carver, of West Runton House, West Runton, Norfolk, married 1911 in Tonbridge, Kent; brother of Basil (below). Educated Charterhouse, Surrey. Employed by The Hollins Mill Co. Ltd. of 5, Portland Street, Manchester, appears on their Roll of Honour. In the 1891 census he was aged 4, born Cheshire, resident with his parents at Rose Hill House, Stockport Road, Marple, Stockport, Cheshire. In the 1901 census he was aged 14, born Marple, Cheshire, a boarder at Charterhouse School, resident Hindhead Road, Godalming, Surrey. Buried in LANCASHIRE LANDING CEMETERY, Turkey (including Gallipoli). Section A. Grave 7. See also Horton School, Northill and Charterhouse School, Surrey Extract from The Times (London, England), Tuesday, August 29, 1916; pg. 4; Issue 41258 : SECOND LIEUTENANT BASIL ARMITAGE CARVER, Dragoons, youngest son of W.O. and Mrs. Carver, Cranage Hall, Holmes Chapel, Cheshire, died of mine gas poisoning on August 21, being overcome while endeavouring to rescue some engineers in a tunnel. He was at Horton Preparatory School, Charterhouse, and for a short time at Sandhurst when war broke out, and he obtained his commission a few weeks before his 18th birthday. Extract from Nantwich Guardian - Friday 18 June 1915, page 5: CAPTAIN O. A. CARVER\n\nMEMBER OF WELL-KNOWN\n\nCHESHIRE FAMILY KILLED Captain Oswald Artmitage Carver East Lancashire Royal Engineers (Territorial Force), who death in action in the Dardenelles was recorded on Tuesday, was born in 1887. He was the second son of Mr. W.O O. Carver and Mrs. Carver of Cranage Hall, Holmes Chapel. He was educated at Tanllwyfan, Colwyn, Horton School, Charterhouse, and Trinity College, Cambridge. He rowed for Cambridge in the inter-Univeristy race of 1908, and also for the 'Varsity in the Olynmpic Games the samke year. He married Elizabeth Adah Noel Hobart, daughter of Mr. Robert Hobart, of Tunbridge Wells, whom he leaves a widow and two children. Captain Carver lived at Marple, and was a director of the Hollins Mill Company, Limited, Manchester. Much sympathy is felt with Mr. and Rms. W. O. Carver and family in their sad bereavement. CASTLE Tudor R [1901] Private, R. Fusiliers (P.S. Bn.; 2nd Lieutenant, The Queen\u0092s (Royal West Surrey Regiment.). Killed in action 31 Aug. 1916 CAVENDISH Lord John Spencer [1893] D.S.O. Major, 1st Life Guards. Killed in action 20 Oct. 1914 CAY Albert Jaffray [1898] Lieutenant, Worcestershire Yeo. Killed in action 23 April 1916 CAZALET Edward [1913] 2nd Lieutenant, The Buffs (E. Kent Regiment.) and Welsh Guards. Killed in action 10 Sept. 1916 CHADWICK James H [1907] Private, R. Fusiliers (P.S. Bn.); Lieutenant-Col., Manchester Regiment. D.S.O. Killed in action 4 May 1917 CHAMBERLAIN Eric D [1912] 2nd Lieutenant, Loyal N. Lancashire Rgt. Killed in action 30 Nov. 1917 CHANCE Edward Seton [1900] Captain (Brevet Major), 2nd Dragoon Guards (Queen's Bays) attached as Commanding Officer, 6th Battalion, Leicestershire Regiment. Killed in action 29 May 1918. Aged 36. Born 23 June 1881 in Carlisle. Son of Frederick William (now Sir Frederick Chance, K.B.E.) and Mary Seton Chance, of Morton, Carlisle. Member of Charterhouse Football Eleven 1899-1900. Height 6 feet 1½ inches. Unmarried. In the 1901 census he was aged 19, born Carlisle, Cumberland, an Undergraduate at Trinity College, Cambridge, visiting The Knoll, Barnards Green, Malvern Common, Guarlford, Upton on Severn, Worcestershire. No known grave. Commemorated on SOISSONS MEMORIAL, Aisne, France. See also Charterhouse School, Surrey From the Charterhouse Register, Oration Quarter 1895: Chance , Edward Seton. b. 23 June, 1.881. (Verites); Football XI, 1899-1900; Left C.Q., 1900. Trin. Coll., Camb.-Joined R. Welsh Fusiliers, 1903. E. S. Chance, Esq., Morton, Carlisle CHANCE Eustace George St Clair No further information currently CHAPMAN Wilfrid H [1898] Captain, Yorkshire Regiment. Killed in action in Gallipoli 7 Aug. 1915 CHARLES J Arthur M [1908] 2nd Lieutenant, King\u0092s (Shropshire L.I.). Died 10 Feb. 1915 of wounds received in action 23 Oct. 1914 CHICHESTER William George Cubitt [1911] Lieutenant, London Regiment. (R. Fusiliers.). Killed in action 15 Sept. 1916 CHURCHILL W Maurice [1901] Major, 12th Cavalry, Indian Army. M. Order of St Anne, 3rd Class (Russia). Died 4 Nov. 1918 of pneumonia CLARK Eric Foster (1914) Lieutenant, The Buffs (E. Kent Regiment.); attd. R.F.C. Killed in action 1 Jan. 1917 CLARK-KENNEDY Alexander K [1902] Captain, King\u0092s Own Scottish Borderers (T.F.). Killed in action 19 April 1917 CLIFTON Hubert E [1910] 2nd Lieutenant Devon Regiment. M.C. Died 4 Oct. 1916 of wounds received in action 23 Sept. 1916 CLISSOLD Harry [1889] Major, Royal Engineers. (T.F.). D.S.O. M2. Killed in action 28 Sept. 1917 CLOSE-BROOKS Arthur Brooks [1903] Captain, Manchester Regiment. M.C. M. Died 10 Jan. 1917 of wounds received in action CLOSE-BROOKS John C [1895] Lieutenant, Life Guards. Killed in action 30 Oct. 1914 CLOUGH Alan (1914) Captain, W. Yorks Regiment. Killed in action 1 July 1916 COCKERELL Samuel Pepys [1898]Old Etonian. Lieutenant (Pilot), Egypt Detachment, Royal Flying Corps. Died of smallpox at Ismailia 20th March 1915. Aged 34. Son of the late William Acland Cockerell and Sidney Ada Cockerell. Left Eton College in 1898. Member of the Cambridge University Boat Race Team of 1900. Former Commercial Attache to Spain and Portugal. In the 1911 census he was aged 31, born 20 Gloucetser Place, London, a Financier, resident Chesham Mans Pont Street, Borough of Chelsea, Chelsea, London & Middlesex. Buried in ISMAILIA WAR MEMORIAL CEMETERY, Egypt. Section A. Grave 117. See also the Stock Exchange memorial and Lords MCC World War 1 COCKS Willard F [1911] Lieutenant, Lincolnshire Regiment. Died 9 April 1917 of wounds received in action COOK Frank R [1915] Lieutenant, E. Yorks. Regiment. and R.F.C. Killed in flying accident 22 Feb. 1918 CORNISH Charles L [1905] Lieutenant, Highland L.I. Killed in action 13 Nov. 1914 CORRY Frederick H L [1908] Lieutenant, Royal Field Artillery. Died 30 Sept. 1915 of wounds received in action 25 Sept. 1915 COWPER Geoffrey M [1908] Captain, R.A.M.C. M. Died 3 Oct. 1918 of wounds received in action COX Derek Percy (1914) 2nd Lieutenant, R.FC. Killed in action 21 Aug. 1917 CRAWLEY Eustace [1886] Major, 12th (Prince of Wales's Royal) Lancers. Killed in action 2nd November 1914. Aged 46. Born 19th April 1868, Highgate, Middlesex. Son of the late Baden Crawley; husband of Lady Violet Crawley (nee Finch), of 5, Lancaster Gate Terrace, London, W. Played cricket for Cambridge University 1887-1889. No known grave. Commemorated on YPRES (MENIN GATE) MEMORIAL, Ieper, West-Vlaanderen, Belgium. Panel 5. See also Lords MCC WW1 Extract from Du Ruvigny's Roll of Honour: CRAWLEY, EUSTACE, Major, 12th (Prince of Wales's Royal) Lancers, 3rd s. of the late Baden Crawley; b. 16 April, 1868; educ. Harrow; gazetted 2nd Lieut. 12th Lancers, from the Militia, 7 Aug. 1889; promoted Lieut. 7 Jan. 1891, Capt. 17 Nov. 1897, Brevet Major 29 Nov. 1900, and Major 29 July, 1905; was A.D.C. (extra) to the Lord Lieutenant, Ireland, from 19 Feb. 1894, to 8 July, 1895; took part in the operations in Sierra Leone 1898-99 (Medal with clasp); served in West Africa 1898, where he was in command of the Expedition to Bula; in the South African War 1899-1902, as Special Service Officer, being afterwards employed on the Staff; took part in the advance on Kimberley, including action at Magersfontein and the Relief of Kimberley; operations in Orange Free State Feb. to May, 1900, including actions at Paardeberg, Poplar Grove, Dreifontein, Houtnek (Thoba Mountain) and Zand River; operations in the Transvaal May and June, 1900, including actions near Johannesburg and Diamond Hill; operations in the Transvaal, west of Pretoria, July to 29 Nov. 1900; operations in the Orange River Colony May to 29 Nov. 1900, Including actions at Lindley, Bethlehem and Wittebergen, and those in Cape Colony Aug. 1901, to 31 May, 1902 (mentioned in Despatches [London Gazette, 10 Sept. 1901]; brevet of Major; Queen's Medal with four clasps and King's Medal with two clasps); served in West Africa (Northern Nigeria) 1903; took part in the Kano-Sokoto Campaign (Medal with clasp), and in the operations in the district to the east of Zaria, being in command; was D.A.A.G. India, from 17 April, 1909, to 16 April, 1913; served with the Expeditionary Force in France and Flanders, and was killed in action near Ypres 2 Nov. 1914. He in. 14 Dec. 1904, Violet Ella, elder dan. of Charles Wightwick Finch, 8th Earl of Aylesford. Extract from The Bond of Sacrifice Volume 1: MAJOR EUSTACE CRAWLEY, 12th (PRINCE OF WALES'S ROYAL) LANCERS , who was killed near Ypres on the 2nd November, 1914, was born on the 16th April, 1868, third son of the late Baden Crawley. He was educated at Harrow, and joined the 12th Lancers from the Militia becoming Lieutenant in 1891, and Captain in November, 1897. Major Crawley saw much active service. In 1898-99 he took part in operations at Sierra Leone, West Coast of Africa, for which he received the medal and clasp. Again, in 1899 he was in command of the Bula Expedition in Nigeria, being mentioned in Despatches by General Wilcox, in December, 1899. He commanded the Nigeria Company Constabulary from the latter date. In 1900-02 he was appointed a Special Service Officer in the South African War; was D.A.A.G. Ridley's Corps of Mounted Infantry from April to December, 1900; took part in General Ian Hamilton's march, being present at the actions of Diamond Hill, Johannesburg, and Wittebergen; and also at operations in Cape Colony under General French; he was Intelligence Officer to Capper's Column at the end of 1901, and Staff Officer to Doran's Column from December, 1901, to May, 1902. For his services he was mentioned in Despatches by Lord Roberts, 4th September, 1901, given the Brevet rank of Major from November, 1900, and received the Queen's medal with four clasps, and the King's medal with two clasps. From May to November, 1902, he was D.A.A.G. on the staff of Colonel Hickman, commanding the troops at Middelburg, Cape Colony. In 1902-03 he again saw service in Nigeria, being in command of a column in the Kano Expedition, for which he received the medal and clasp. In 1903 he commanded Mounted In-fantry, in India, and obtained the substantive rank of Major in July, 1905. In 1906-07 he was officiating Brigade-Major of the Amballa Cavalry Brigade and to the Inspector-General of Cavalry in India. Major Crawley married, in December, 1904, Lady Violet Ella Finch, elder daughter of the eighth Earl of Aylesford. His profile from Cricinfo CREWDSON Theodore Wright [1914] Captain, Manchester Regiment.; A.D.C. Died 6 Nov. 1916 of wounds received in action 28 Oct. 1916 CRISPIN Hugh T [1887] Lieutenant-Col., Northumberland Fusiliers. and R. Sussex Regiment. M. Killed in action 30 Oct. 1914 CROFT John Arthur Christopher Second Lieutenant, 4th Battalion, Royal Warwickshire Regiment attached to 2nd Battalion, Duke of Wellington's (West Riding Regiment). Killed in action 18 April 1915. Aged 27. Born 15 April 1888. Son of Henry Herbert Stephen and Emma Croft, of Sussex Square, Brighton. No known grave. Commemorated on YPRES (MENIN GATE) MEMORIAL, West-Vlaanderen, Belgium. Panel 8. See also Charterhouse School, Godalming, Surrey Extract from Bond of Sacrifice: Officers Died in the Great War 1914-1916, volume 2, page 110-111: 2nd LIEUTENANT JOHN ARTHUR CHRISTOPHER CROFT, 4th BATTN. (EXTRA RESERVE) ROYAL WARWICSHIRE REGIMENT, attd. 2nd BATTN. THE DUKE OF WELLINGTON (WEST RIDING REGIMENT), was the youngest son of Henry Herbert Stephen Croft, barrister-at-law, Recorder of Tenterden, and was born at 28, Royal Crescent, London, on the 15th April, 1888. He was educated at Charterhouse and Trinity College, Cambridge. He was an international hockey player, Blackheath Club, champion of the Thames Punting Club, 1912, and a member of the New University Club, St. James's Street, London. He was gazetted to the Royal Warwickshire Regiment, in August, 1914, and trained with it in the Isle of Wight. In November, 1914, he was attached to the West Riding Regiment, and served with it in the trenches in France till April, 1915. He was killed on the 18th of the latter month in the first attack on Hill 60, near Ypres, \"while \"—in the words of his Commanding Officer— \"leading his men with the greatest bravery in the successful charge on Hill 60 on Sunday last. We have lost a most capable and gallant officer and charming friend whose place it will be hard to fill.\" CROPPER John [1883] Captain. Born 17th September 1864, 2nd son of Edward and Theodosia Cropper, of Fearnhead, Great Crosby; husband of Anne Ellen Cropper, of Mount Ballan, Chepstow, Mon. He was at Charterhouse [H] 1878 - 1883. He went up to Trinity College, Cambridge. He qualified in medicine and worked for a time at a medical mission in Acre. In the Great War he was commissioned into the R.A.M.C. He was drowned in the sinking of the Britannic on 21st November 1916. The wreck is now designated an official war grave. He is commemorated on the Mikra Memorial, outside Salonica. See also Charterhouse School, Godalming, Surrey Note: Britannic, built by Harland and Wolff in Belfast for the White Star Line and launched in 1914, was a sister ship to the Titanic. During the Great War she served as a hospital ship. She sank in 55 minutes after hitting a mine 4 miles off the Greek island of Kea, on her way back to Lemnos from Southampton via Gibraltar and fortunately empty of passengers. 30 lives were lost, many of these when two lifeboats, prematurely launched, drifted into the still-turning propellers, 1,036 were saved. From the Charterhouse School Register, Oration Quarter 1878 : Cropper, John. b. 17 Sept., 1864. (Hodgsonites); Left C.Q., 1881. Trin. Coll., Camb.; M.A.; St. Bartholomew's Hospital; M.D.; B.C.-C.M.S., Medical Mission, Acre, Palestine, 1895-1901. J. Cropper, Esq., M. D., Mount Ballan, Chepstow. Extract from Kington Times - Saturday 2 December 1916, page 5 : LOST IN THE BRITTANIC. Captain Cropper, who lost his life in the sinking of the Britannic, was a brother of Mrs. Probyn, wife of the Rev. H. E. H. Probyn, Vicar of Kington. CROSSE Edward A W No further information currently CROSSLEY Brian [1904] Lieutenant, Highland L.I. M. Killed in action 18 May 1915 CROWE Hugh Barby [1912] Lieutenant, R. Fusiliers. Drowned on H.M. transport off Gallipoli 28 Oct. 1915 CUNNINGHAM James Michael [1897] Captain, Suffolk Regiment. Died 28 March 1918 of wounds received in action CLARKE William ???? No further information currently CUNNINGHAM James S [1904] Sergt., R. Highlanders, Canadian Force. Killed in action 31 Oct. 1916 CURRIE Richard F I [1899] Lce.-Corpl., R. Fusiliers. Killed in action 15 July 1916 DAFFARN Maurice [1906] 2nd Lieutenant, N. Rhodesian Police. Killed in action in Rhodesia 24 April 1915 DART Hugh [1900] Private, Middlesex Regiment. (P.S. Bn.); Captain and Adjt., York and Lancaster Regiment. Died 2 July 1916 of wounds received in action DARWIN Erasmus [1901] Second Lieutenant 4th Battalion, Yorkshire Regiment who was killed in action on Saturday, 24th April 1915. Aged 33. Son of Horace and Ida Darwin, of The Orchard, Cambridge. Employed Cambridge Scientific Instrument Coy Ltd. Commemorated on the YPRES (MENIN GATE) MEMORIAL, Ieper, West-Vlaanderen, Belgium. Panel 33 Also listed on family gravestone in churchyard. See also Cambridge Guildhall and Cambridge St Giles From Andy Pay's research into the Marquis de Ruvigny's Roll of Honour the following: Volume 1, Part 1, Page 106 DARWIN, Erasmus, 2nd Lieut 4th battalion, Aleaxandra, Princess of Wales Own Yorkshire Regiment (T.F) Only son of Horace Darwin, F.R.S. Chairman of Cambridge Scientific Instrument Co, by his wife, the Hon Emma Cecilla (Ida) nee Farrer, only daughter of Thomas Henry, 1st Lord Farrer and grandson of Charles Darwin. Born Cambridge 7-12-1881, educated at Horris Hill and Marlborough (Cotton House) and gained an exhibition for Mathematics at Trinity College,Cambridge. He went up to Trinity in October 1901 and took the mathematical Tripos in his second year being placed among the senior Optimes. Afterwards he took the mechanical sciences Tripos and was placed in the second class in 1905. On leaving Cambridge he went through the shops at Messrs Mather and Platts at Manchester. After this he worked for some little while with the Cambridge Scientific Instrument Co., of which he was a director, and then became assistant secretary of Bocklow Vaughan and Co Ltd at Middlesborough. Here he stayed for seven years and at the outbreak of war occupied the postion of secretary to the company. As soon as war broke out he decided to join the army and on 12-9-14 was gazetted 2nd Lieut in the 4th (Territorial) battalion of the Yorkshires, which after training at Darlington and Newcastle crossed to France, as part of the Northumbria division on 17-4-15 and was within a week called upon to take part in the second battle of Ypres. Here these Territorial troops fresh from home and tried at the very outset almost as highly as men could be tried, behaved with a steadiness and coolness which gained for them the congratulations of the generals commanding their division and their army corps. Early on the morning of the 24-4-15 the battalion was ordered to attack the village of Fortuin, close to St Julien where the Germans had broken through. This attack they successfully carried out in the face of terrific shellfire, being ordered to retire at dusk. By driving the enemy back a mile or more they had attained their object which was to prevent a breach in the line, and they hade made good their front with the Canadians and Royal Irish on their right. It was during this advance that Darwin fell, killed instantaneously. His Commanding Officer, Colonel Bell wrote of him \"Loyalty, Courage and Devotion to duty - he had them all .... He died in an attack which gained many compliments to the battalion. He was right in front. It was a mans death\". Corporal Wearmouth, who was in his platoon wrote \"I am a section leader in his platoon and when we got the order to advance he proved himself a hero. He nursed us men, in fact the comment was, you would say we were on a field day. We had got to within twenty yards of our halting place when he turned to our platoon to say something. As he turned he fell, and I am sure he never spoke. As soon as I could I went to him but he was beyond human aid. Our platoon sadly miss him, as he could not do enough for us, and we are all extremely sorry for you, in your great loss\". Private Wood wrote to a friend in Middlesborough \"I would expect you would know poor Mr. Darwin .... I was in his platoon and I can tell you he died a hero. He led us absolutely regardless of the bullets from the German Maxim guns and snipers that whistled all around him\". Just before he left England, when his battalion was under orders for the front, he was summoned to the war office and offered a staff appointment at home in connection with munitions of war. This would have given great scope to his capabilities. \"It would have been interesting and important work\" he wrote \"but of course there are plenty of older men who can do it just as well as I can\". He felt that at the moment his place should be with his Regiment and made, in the words of one present at the interview, a fine appeal to be allowed to go with his men. It was granted and he went gladly with no looking back. The Times (30-4-15) said of him \"Erasmus Darwin would, if he had lived, have added fresh distinction to the name of his familyin a walk of life in which it has never before figured. Between Cambridge and a great iron works in the north there is something of a gulf fixed and one who knew Darwin only in his Cambridge home cannot say anything more than that all that met him in business conceived a very high opinion of his grasp of the subject, his acuteness and administrative ability. It was indeed impossibe to know him without realising that he combined with intellectual ability a calm, sound and practical judgement, and a general capacity for doing things well and thoroughly. He had, too, what must have been invaluable to him in his work, a most genuine sympathy with and affection for working men, and this quality, which, amongst so many other things, had made him love his work at Middlesborough, gave him intense pleasure when soldiering came to him as a wholly new and unlooked for esperience. He delighted in the men, and especially in long expeditions across the moors with his scouts. There is one more quality as to which all his friends would agree, namely a conscientiousness that was eminently sane and wide minded and completely unswerving. No one in the world was more certain what to do what he believd to be right. DAVIDSON Norman R [1897] Lieutenant-Col., R.H.A.; G.S.O. D.S.O. and Bar. Brevet Lieutenant-Colonel. M3. Died 5 Oct. 1917 of wounds received in action DAVIES Arthur C [1896] Captain, R. Welsh Fusiliers. Killed in action 10 Aug. 1915 DAVIES George LLewelyn [1912] 2nd Lieutenant, 6th Battalion, King\u0092s Royal Rifle Corps attached to 5th Battalion, Rifle Brigade. Killed in action 15 March 1915. Aged 21. Son of Arthur and Sylvia Llewelyn Davies. Step-son of Sir J.M. Barrie, Bart, Model for Barrie's 'Peter Pan'. Educated at Eton and Trinity College, Cambridge. Buried in VOORMEZEELE ENCLOSURE NO. 3, West-Vlaanderen, Belgium. Plot II. Row E. Grave 2. DAVIES Roland A Llewelyn [1911] Lieutenant, R. Fusiliers. Serbian Distinguised Service Medal. Killed in action 4 Oct. 1918 DAY Maurice C [1910] Lieutenant, 13th Rajputs, Idian Army. Killed in action in E. Africa 4 Nov. 1914 DE CANDOLLE Alec C V [1883] Major-Gen., Director-General of Transportation, Mesopotamia. C.B. M. Grand Officer, Order of the Crown of Roumania DEIGHTON John [1906] Captain, R.A.M.C. Died 20 Sept. 1916 of wounds received in action DENMAN Richard C [1914] Private, H.A.C.; Lieutenant, Grenadier Guards. Killed in action 1 Dec. 1917 DENNISTOUN John R [1913] Lieutenant, Fort Garry Horse, Canadian Force; attd. R.F.C. M. Killed in action 4 May 1916 DE ROTHSCHILD Evelyn Achille [1904] Major, Buckinghamshire Yeo. M. Died 17 Nov. 1917 of wounds received in action DEWHURST George C L [1910] Lieutenant, Rifle Brigade. Killed in action 1 July 1916 DICKINSON Raymond S [191] Captain, London Regiment. (Queen\u0092s Westminster Rifles). Killed in action 2 Oct. 1915 DIXON J Evelyn B [1913] Captain, R. Warwickshire Regt (T.F.). Killed in action 1 July 1916 DOBBS William Cary [1889] Captain, \"D\" Company, 2nd Battalion, Middlesex Regiment.; attd. R. Fusiliers. Killed in action 31 July 1917. Aged 46. Son of Robert Conway Dobbs, J.P., and Edith Juliana Dobbs, of Camphire, Cappoquin, Co. Waterford. Twice previously wounded. Educated at Winchester College and Trinity College Cambridge. No known grave. Commemorated at YPRES (MENIN GATE) MEMORIAL, West-Vlaanderen, Belgium. Panel 49 and 51. DODGSHON Angus J C (1914) Lieutenant, Gloucestershire Regiment. (T.F.). Killed in action 10 Nov. 1917 DODGSON Francis [1908] Captain, 8th Battalion, Yorkshire Regiment. Killed in action 10 July 1916. Aged 27. Son of Henley F. Dodgson, of Bovingdon, Herts. Educated at Marlborough College and Trinity College, Cambridge. Buried in SERRE ROAD CEMETERY No. 2, Somme, France. Plot XXVIII. Row K. Grave 8. DON Archibald William Robertson [1909] Lieutenant, 10th Battalion, Black Watch (Royal Highlanders). Died in Macedonia 11 Sept. 1916 of dysentery. Aged 25. Son of the late Robert Bogle Don and of Lucy Flora Don, of Warren House, Farnham Common, Bucks. Educated at Winchester and Trinity College, Cambridge (Scholar of Trinity). Student of Medicine at St. Bartholomew's Hospital Served in France, 1914-15, Salonika, 1916. Born at Broughty Ferry, Forfarshire. His brother Robert Macpherson Don also fell. Buried in SALONIKA (LEMBET ROAD) MILITARY CEMETERY, Greece. Row O. Grave 12. DONALDSON Sir Hay F , K C B [1877] Brig.-Gen., empld. Ministry of Munitions. Drowned on H.M.S. Hampshire 6 June 1916 DONALDSON Norman [1897] Lieutenant, 45th Brigade, Royal Field Artillery. Killed in action 10 March 1915. Aged 36. Born 19 January 1879 in Chiswick, Middlesex. Baptised 20 February 1879 in Chiswick St. Nicholas, son of John and Frances Sarah Donaldson, resident Chiswick, Middlesex. Son of Mrs. F. S. Donaldson, of 2, Melbury Rd., Kensington, London, and the late John Donaldson; husband of Dorothea Joan Donaldson, of Lower Franklands, Pangbourne, Berks. Mentioned in Despatches (MiD). No known grave. Commemorated on LE TOURET MEMORIAL, Pas de Calais, France. Panel 1. See also Charterhouse School, Godalming, Surrey Extract from Bond of Sacrifice: Officers Died in the Great War 1914-1916, volume 2, page 132: LIEUTENANT NORMAN DONALDSON, 5th BATTERY, ROYAL FIELD ARTILLERY (RESERVE OF OFFICERS), who was born on the 19th January, 1879, was the second son of the late John Donaldson, of Chiswick, and Mrs. Donaldson, of Kensington and The Crofts, Pangbourne. He was educated at Charterhouse and Trinity College, Cambridge, where he took his degree in Science in 1900. At Cambridge he rowed head of the river, was in the trial eights, also fenced for his University against Oxford. He joined the Royal Artillery in May, 1900, and served in both Horse and Field Batteries, retiring in 1909, and, voluntarily joining the Reserve of Officers in August, 1914, in the following month was gazetted to the Special Reserve, Royal Field Artillery, as Lieutenant. His Commanding Officer wrote as follows : \"Lieutenant Donaldson was shot through the head and killed instantaneously in the Battle of Neuve Chapelle on the 10th March, 1915, and was buried near the trench in which he fell. At the time of his death he was observing Officer for the battery in the trenches. There was no more gallant, unselfish, indefatigable officer in the Army, and he was loved by all the officers and men who served with him. The battery could not have suffered a greater loss. In order better to follow and report on the progress of the attack, he had shown himself above the parapet, with the regardlessness of personal danger that characterised him, though he was never unnecessarily reckless In this respect. The last messages from him were to say that we had gained the German trenches, and that the fire of our battery was effective.\" He was mentioned in Sir John French's Despatch of 31st May, 1915, and his battery's share in the success of the bombardment was fully recognised in all the orders. Hie married, in 1912, Dorothea, daughter of Mr. J. Freeman, of Shepperton. Extract from England & Wales Government Probate Death Index 1915: DONALDSON Norman of Lower Franklands Pangbourne Berkshire lieutenant R.F.A. died 10 March 1915 in France having been killed in action Probate London 28 April to Dorothea Jane Donaldson widow.\n\nEffects £1928 3s.10d. DOWLING Geoffrey Charles Walter [1910] Captain, King\u0092s Royal Rifle Corps. Killed in action at Hooge 30 July 1915 DREWE Adrian [1910] Captain, Royal Garrison Artillery M. Killed in action 12 July 1917 DRYSDALE Donald R [1913] Lieutenant, Dorset Regiment. Died 25 Sept. 1916 of wounds received in action DUFF Beauchamp P [1911] 2nd Lieutenant, Cameron Hdrs. Killed in action 25 Sept. 1915 DUNCAN David Alan Flight Sub-Lieutenant (Pilot), Killingholme Naval Air Station, Royal Naval Air Service. Killed while flying in a Sopwith Schneider 3800, drowned, 2 June 1917. Aged 22. Son of Mr. George H. P. Duncan and Mrs. H. R. Duncan, of 12, Kensington Court, London.In the 1911 census he was aged 15, born Valparalso, Chile, a school boarder, resident Charterhouse, Goldaming, Godalming Rural Detached, Surrey. Educated Trinity College, Cambridge. Buried in KENSAL GREEN (ALL SOULS') CEMETERY, London. Grave reference 173. 44875. See also Charterhouse School, Godalming, Surrey DUNVILLE John S (1914) 2nd Lieutenant, 1st Dragoons. V.E. Died 26 June 1917 of wounds received in action 25 June 19171 EADE Aylmer [1910] 2nd Lieutenant, Yorkshire Regiment. Killed in action 9 Oct. 1917 DE PEDDISON Richard No further information currently EDWARDES Thomas No further information currently EGERTON Philip de M W Lieutenant Philip De Malpes Waynes Egerton\n\n© IWM (HU 121674) [1913] Old Etonian. Captain, 19th (Queen Alexandra's Own Royal) Hussars. Killed in action 8th October 1918. Aged 23. Son of Sir Philip Henry Brian Grey Egerton, 12th Bart., of Oulton Park, Cheshire, and Mary Carolyn Campbell Grey Egerton, his wife (now Mrs. Richard McCreery). His twin brother, Roland le Belward Egerton also served. In the 1901 census he was aged 15, born London, a student, boarding at Eton College, Eton, Buckinghamshire & Berkshire. Educatd at Eton College and Trinity College, Cambridge. Buried in BUSIGNY COMMUNAL CEMETERY EXTENSION, Nord, France. Plot IV. Row B. Grave 29. See also Lords MCC World War 1 memorial Extract from England & Wales Government Probate Death Index 1919: EGERTON Philip de Malpas Wayne of Oulton Park Cheshire lieutenant 19th Royal Hussars died 8 October 1918 in France killed in action Administration London 20 February to sir Philip Henry Brian Grey Egerton baronet.\n\nEffects £1989 4s. 6d. Extract from Chester Chronicle - Saturday 19 October 1918, page 3: KILLED IN ACTION EGERTON.—On 8th inst., at Brancourt, France, Lieut. Philip de Malpas Wayne Egerton, only surviving son of Sir Philip H. B. Grey Egerton, Bart., Oulton Park, Cheshire.\n\ncp128 EILOART Horace A [1908] Major, London Regiment. (R. Fusiliers.) D.S.O. M.C. and Bar. M 3. Died June 1920 from the effects of wounds received in action 28 May 1918 ELLICOTT Frederick Arthur John [1911] 2nd Lieutenant, King\u0092s Own Scottish Borderers. Killed in action 8 July 1916 ELLIOT Hon Gavin W E (1914) Lieutenant, Scots Guards. Died 6 Aug. 1917 of wounds received in action ELLIOT Wilfrid E [1912] 2nd Lieutenant, Dorset Regiment. Killed in action 26 Sept. 1916 EVANS Bernard [1906] Lieutenant, Middlesex Regiment and 55th Squadron, Royal Flying Corps. M - Mentioned in Despatches. Died 8 April 1917. Aged 29. Son of Edwin Evans, of 9, Ashley Gardens, Victoria, London; husband of Bessie H. Evans (nee Murray), of 86, Emmanuel Rd., Streatham Hill, London. Solicitor, B.A., LL.B. Marlborough College and Trinity College, Cambridge. Buried in ONTARIO CEMETERY, SAINS-LES-MARQUION, Pas de Calais, France. Plot IV. Row A. Grave 28. EVANS Rupert Ancrum [1909] Sergt., H.A.C.; Second Lieutenant, 3rd Battalion, Prince Of Wales's Own (West Yorkshire Regiment). Accidentally killed 25 January 1916. Born 6 November 1891. In the 1901 census he was aged 9, born Kennington, Surrey, son of patrick T and Alice E Evans, resident 54, Longridge Road, Kensington, London & Middlesex. In the 1911 census he was aged 19, born Kensington, London, a studdent visiting at Parkhurst, Haslemere, Lurgashall, Sussex. Buried North-West of Church in HARPLEY (ST. BARTHOLOMEW) CHURCHYARD, Worcestershire. See also Charterhouse School, Godalming, Surrey and also Upton St Leonards, Gloucestershire Extract from England & Wales Government Probate Death Index 1916: EVANS Rupert Ancrum of 54 Longridge-road Earl's Court Middlesex second-lieutenant 3rd West Yorkshire (Prince of Wales' Own) regiment died 25 January 1916 at Whitley Bay Northumberland Administration London 8 August Alice Emily Evans widow. Effects £8829 5s. 2d\n\nResworn £8809. 7s. 0d. Further spent 29 January 1937. EWING Arthur H (1914) Captain, E. Yorks. Regiment. M.C. and Bar. M. Died 8 Sept. 1918 of wounds received in action EZRA David [1902] Lieutenant, Royal Garrison Artillery Killed in action 6 Aug. 1918 FARMER Henry C M [1911] 2nd Lieutenant, King\u0092s Royal Rifle Corps. Killed in action 10 May 1915 FARQUHAR Hobart B [1892] Captain, London Regiment. (Civil Service Rifles). Killed in action near Vimy Ridge 21 May 1916 FEILDING Hon Henry S [1912] Lieutenant, K. Edward\u0092s Horse; A.D.C.; Captain, Coldstream Guards. Died 9 Oct 1917 of wounds received in action FENWICK Anthony L [1913] Captain, Lincolnshire Regiment. M. Killed in action 16 Feb. 1918 FERGUSON Hugh M [1910] Captain, S. Staffs. Regiment. Killed in action 11 June 1917 FINCH Henry Alfred Ingle [1897] Private, 2nd Battalion, Canadian Infantry attached to Trench Mortar Battery. Died 28 April 1916 of wounds received in action. Aged 37. Son of George Ingle Finch and Bessie Finch, of Little Shelford, Cambridge. Born at Hammersmith, London, England. Educated at St. Paul's School, and B.A. of Trinity College, Cambridge. Previous to enlisting at London, Ontario, in Jan; 1915, was farming in the United States of America. Buried in LIJSSENTHOEK MILITARY CEMETERY, West-Vlaanderen, Belgium. Plot VI. Row B. Grave 23A. FIRTH Arnold [1901] 2nd Lieutenant, Royal Field Artillery. (T.F.). Killed in action 15 April 1917 FIRTH Richard C D [1897] Lieutenant, S. Lancashire Regiment. Died 21 Dec. 1914 FISHER John Wilfred [1910] Captain, 10th Battalion, Sherwood Foresters (Notts. and Derby Regiment.) Awarded the Distinguiged Service Order (D.S.O.) M - Mentioned in Despatches. Died 8 July 1916 of wounds received in action. Aged 23. Son of Horace Arthur and S. Kate Fisher, of Arno Vale, Notts. Three times previously wounded, the last fatally. Educated Malvern and Trinity College, Cambridge. Buried in HEILLY STATION CEMETERY, MERICOURT-L'ABBE, Somme, France. Plot I. Row A. Grave 15. FISKE Charles H [1914] 2nd Lieutenant, 111th Regiment. United States Army. Killed in action near Fismes (Aisne) 12 Aug. 1918 FORREST John W [1912] 2nd Lieutenant, Seaforth Hdrs. Killed in action 27 Sept. 1915 FORSTER Frederic A [1898] Captain, R. Fusiliers. Died 23 Sept. 1914 of wounds received in action at Mons FORSTER William [1910] Private, R. Fusiliers. Killed in action 7 Oct. 1916 FOSTER Bernard La T [1912] Lieutenant, Manchester Regiment. Killed in action 24 July 1916 FOWLER David D [1915] 2nd Lieutenant (A.), R.F.C. Killed in action 16 March 1917 FOWLER J Dudley [1910] Lieutenant, 5th (R. Irish) Lancers. Killed in action 30 Nov. 1914 FOYSTER Philip Tillard [1906] Captain, 86th Field Company, Royal Engineers. Died 11 December 1916 of wounds received in action 6 December 1916. Aged 28. Son of the late Rev. George Alfred Foyster and Adelaide Julia Foyster. Educated at Marlborough College and Trinity College, Cambridge. Born at Hastings. Buried in ETAPLES MILITARY CEMETERY, Pas de Calais, France. Plot I. Row B. Grave 76. FREEMAN-MITFORD Hon Clement Bertram O F [1896] Major, 10th Hussars. D.S.O. Killed in action 13 May 1915 FRENCH Hon Ernest A [1913] Captain, S. Wales Borderers. Died 16 Aug. 1917 of wounds received in action FREND William R [1893] Captain, Sherwood Foresters (Notts. and Derby Regiment.) Killed in action 20 Sept. 1914 FROST Edmund L [1909] Lieutenant, S. Lancashire Regiment. (T.F.). Killed in action 16 June 1915 GADDUM Russell C S [1899] 2nd Lieutenant, R. Fusiliers. Killed in action 10 Sept. 1916 GALBRAITH Alexander Norman [1896] Captain, Ceylon Rifles. Accidentally killed in Egypt (20 Feb. 1916) GARFIT Thomas N C [1910] Lieutenant, Durham L.I. Killed in action in Gallipoli 30 April 1915 GARNETT Kenneth Gordon [1911] Seaman, R.N.R.; Lieutenant, Royal Field Artillery. Awarded the Military Cross (M.C.) and the French Croix de Guerre with palm. Died 22 August 1917 of wounds received in action 21 August 1916. Aged 25. Son of William and Rebecca Garnett, of I, The Chestnuts, Branch Hill, Hampstead, London. Educated at Trinity College (B.A.). Rowing Blue No. 5 in Cambridge Eight in 1914. Buried in PUTNEY VALE CEMETERY AND CREMATORIUM, London. Plot/Row/Section I. Grave 672. GARNETT-BOTFIELD Alfred Clulow F [1912] 2nd Lieutenant,Rifle Brigade; Lieutenant, S. Wales Borderers. Killed in action 9 May 1915 GARNETT W H Stuart [1900] Lieutenant-Cdr., R.N.R.; Lieutenant, R.F.C. Killed in flying accident 21 Sept. 1916 GARRETT Stephen [1897] Captain, Suffolk Regiment. (T.F.). Killed in action 12 March 1915 GEDGE Cecil Bertie [1885] Old Etonian. Second Lieutenant, 3rd (City of London) Battalion (Royal Fusiliers), London Regiment. Killed in action 25th September 1915. No known grave. Commemorated on LOOS MEMORIAL, Pas de Calais, France. Panel 130. See also Lords MCC WW1 Extract from Du Ruvigny's Roll of Honour: GEDGE, CECIL BERTIE, 2nd Lieut., 3rd Battn. (Royal Fusiliers) The London Regt. (T.F.), attd. Grenadier Coy., Garhwal Brigade. I.A., only surv. child of Sydney Gedge, of Mitcham Hall, co. Surrey, Solicitor, by his wife, Augusta, dau. of Robert Herring ; b. Mitcham Hall aforesaid, 20 Feb. 1866 ; educ. Eton and Trinity College, Cambridge, where he graduated B.A.; was a Barrister, being called to the Bar (Inner Temple) in 1891, and afterwards practised on the South-Eastern Circuit and at the Essex and Herts Sessions ; joined the Sportsman's Battn. 9 Oct. 1914 ; was gazetted 2nd Lieut. 3rd London Regt. 1 April, 1915 ; went to France in June. when he was attached to the Grenadier Coy., Garhwal Brigade, and was killed in action at the Battle of Loos 25 Sept. following. His Colonel wrote : \"He was wounded early in the advance and came back and had his wounds dressed, and then went out again to lead his men, and he has not been seen since. He was a brave English gentleman, and we are glad to think he was one of us. . . . I am very sorry to say I have had strict orders not to send forward for 'Mention' any officer who has been killed. If it were not for this very strict rule I should have sent forward your husband's name,\" and a brother officer : \"There is one thing that may console you, and that is, your husband showed the greatest courage. He was wounded by shrapnel early in the morning, but refused to go back. He just had his men bind him up, and when the order came to go over the parapet, he led his men over like a hero.\" He was a good sportsman, being well known in Switzerland as a curler ; was also a keen scholar, and had edited various publications, including \"Granta\" in 1890, \"Huts,\" 1902-3, and was sub-editor of Lord Halsbury's \"Laws of Ayland.\" He m. at St. Margaret's, Westminster, 6 Aug. 1892, Jessie Bickley (Brackondale, Strawberry Hill, Twickenham), 3rd dau. of Bery Bickley Rogers, and had a dau., Sydney, Jessie, b. 12 Sept. 1893. GEE Robert F McL (1914) 2nd Leut., Wiltshire Regiment. Died 27 Oct. 1914 of wounds received in action GELDERD-SOMERVELL Roger Frederic C [1904] 2nd Lieutenant, Grenadier Guards. Died 13 March 1915 of wounds received in action GETHING Hugh B [1902] 2nd Lieutenant, Gloucestershire Yeo. Killed in action in Gallipoli 21 Aug. 1915 GIBBONS Edwyn I [1911] Private, R. Fusiliers; Lieutenant, Lancashire Fusiliers. Killed in action 29 April 1917 GIBSON-CRAIG Sir Archibald Charles, Bart [1902] Lieutenant, Highland L.I. M. Killed in action 13 \u0096 17 Sept 1914 GILLILAND Valentine K [1907] Captain, R. Irish Rifles. Killed in action 8 May 1915 GILMOUR Alastair S [[1906] 2nd Lieutenant, Argyll and Sutherland Hdrs. Killed in action 15 Sept. 1916 GILSON Robert Quilter [1912] Lieutenant, 11th Battalion, Suffolk Regiment. Killed in action 1 July 1916. Aged 22. Son of Robert Cary Gilson and Emily Annie Gilson, of Canterbury House, Marston Green, near Birmingham. Born at Harrow-on-the-Hill. Classical Exhibitioner of Trinity College, Cambridge. Buried in BECOURT MILITARY CEMETERY, BECORDEL-BECOURT, Somme, France. Plot I. Row R. Grave 28. GJERS Lawrence [1912] Captain, Seaforth Hdrs. Killed in action 4 Oct. 1917 GODDARD Archibald Spencer [1905] Captain, 5th Battalion, Canadian Infantry. Killed in action, during an attack near Courcelette he was badly wounded just before the First Objective had been reached and succumbed to his wounds soon after being carried back to the old front line 26 September 1916. Aged 30. Born 14 October 1886 in Folkestone, Kent. School teacher by trade. Son of Mary Monica Goddard, of Folkestone, and the late William Day Goddard. On the staff of King Edward School, Edmonton, Alberta. Graduate of Trinity College, Cambridge. Religious denomination Church of England. Attested 4 November 1915 at Calgary. No known grave. Commemorated on VIMY MEMORIAL, Pas de Calais, France. National Archives of Canada Accession Reference: RG 150, Accession 1992-93/166, Box 3596 - 24 GODDARD-JACKSON Nicholas Wlliam [1914] 2nd Lieutenant, Northamptonshire Regiment. Killed in action at High Wood 9 Sept. 1916 GOLD Philip No further information currently GOODWIN Harold D [1908] Lieutenant, Middlesex Regiment. Killed in action 1 July 1916 GOOLDEN Alexander W [1908] Lieutenant, E. Surrey Rgt.; empld. O.C.B. Killed in action in Afghanistan after the Armistice GORE-BROWNE Harold Thomas T [1904] Private, Canadian Mtd. Rifles; 2nd Lieutenant, King\u0092s Royal Rifle Corps. Died 23 Aug. 1916 of wounds received in action 19 Aug. 1916 GRACEY Horace C [1911] Captain, Rifle Brigade. Killed in action at Le Transloy 18 Oct. 1916 GRANT Alan F M [1911] 2nd Lieutenant, The Queen\u0092s (Royal West Surrey Regiment.). Died 18 June 1916 of gas poisoning GRANT Alexander No further information currently GRANTHAM Edward Rodney Hasluck [1914] 2nd Lieutenant, 1st Battalion, Northumberland Fusiliers. Died 31 March 1917 of wounds received in action. Aged 20. Second son of Richard Fuge Grantham and Adela Grantham, of 19, Daleham Gardens, Hampstead, London. Educated at Rugby and Trinity College, Cambridge. Buried in FAUBOURG D'AMIENS CEMETERY, ARRAS, Pas de Calais, France. Plot II. Row M. Grave 22. GRANTHAM Frederic W [1889] Captain, R. Munster Fusiliers. Killed in action 9 May 1915 GRATTAN-BELLEW William Arthur [1913] 2nd Lieutenant, Connaught Rangers; Major, R.F.C. M. Died 24 March 1917 of wound received in action GRAY Edward J No further information currently GRAY Maurice [1908] Lieutenant, 2nd Dragoon Guards. (Queen\u0092s Bays); Captain, M.G.C. Killed in action 8 Aug. 1918 GREEN Horace S [1902] Major, London Regiment. M. Killed in action 20 Sept. 1917 GREGORY John S [1908] Captain, Royal Army Service Corps. and R.F.C. M. Killed in action 19 Feb. 1918 GRIBBLE Charles H [1907] Lieutenant, The Buffs (E. Kent Regiment., T.F.). Killed in action 30 Nov. 1017 GRIFFITH Geoffrey F [1910] Captain, London Regiment. (Q.V.R.). M. Killed in action 26 Sept. 1917 GRIFFITHS Richard E [1907] Private, Australian Force. Killed in action in Gallipoli 1915 GWYNNE Roderick T S [1912] 2nd Lieutenant, King\u0092s Own (Yorkshire L.I., T.F.). Died 23 May 1915 of wounds received in action HABERSHON Leonard O [1912] Captain, E. Yorks. Regiment. Killed in action 13 Nov. 1916 HADEN Frederic H No further information currently HALL Frederick G [1909] Captain, Cheshire Regiment. Killed in action 7 July 1916 HALLAM Horace George Searle (1914) Lieutenant, Royal Army Service Corps. (T.F.) attached to Egyptian Camel Corps. Killed in action near Jaffa 1 December 1917. Aged 22. Son of George Hanley Hallam and Georgiana Louisa Hallam, of \"Ortygia,\" Lower Rd., Harrow, and S. Antonio, Tivoli, Rome. Old Harrovian, entered at Trinity College, Cambridge. Buried in RAMLEH WAR CEMETERY, Israel and Palestine (including Gaza). Section B. Grave 23. HALLIDAY John Alexander aka Alec Captain, 11th (Prince Albert's Own) Hussars. Died, in the Duchess of Westminster's Hospital at Le Touquet, of wounds received in action at Messines 13th November 1914. Aged 39. Son of John and Maria Halliday, of Chichlade House, Salsibury, Wiltshire. Buried in north-west part of ALL SAINTS CHURCHYARD, CHICKLADE, Wiltshire. See also Lords MCC WW1 Extract from De Ruvigny's Roll Of Honour 1914-1918, volume 1, page 169: HALLIDAY, JOHN ALEXANDER, Capt., 11th Hussars, eldest s. of the late John Halliday, of Chicklade House, co. Wilts (d. 13 Feb. 1915), by his wife, Maria (d. 25 Feb. 1916), dau. of Richard Brown, of Ebbw Vale, Monmouth; b. 10 April, 1875; educ. Harrow and Trinity College, Cambridge; was gazetted 2nd Lieut. from Militia to the 11th Hussars, then in India, 5 Jan. 1898, and promoted Lieut. 3 March, 1900, and Capt. 18 March, 1905; served in the South African War on the Staff as Special Service Officer, 25 July to 22 Aug. 1901, and as Signalling Officer, 23 Aug. 1901 to 14 June, 1902 (Queen's Medal with five clasps); was Adjutant 11th Hussars, and afterwards of the Leicestershire Yeomanry; went to France with the Expeditionary Force, 15 Aug. 1914; served through the retreat from Mons, the Battle of the Marne. the 1st Battle of Ypres, &c., and died in the Duchess of Westminster's Hospital at Le Touquet, 13 Nov. 1914, of wounds received in action at Messines, 31 Oct. previously; unm. Capt. Halliday was a good all-round athlete. and was in both cricket and football elevens at Harrow; capt. of the Gymnasium eight; champion heavy weight boxer for the Public Schools Competition at Aldershot, 1894, and threw the hammer for Cambridge in the University Sports, 1896-7. He was well known in the hunting-field in Ireland and South Wiltshire. Extract from The Bond of Sacrifice Volume 1, page 166: CAPTAIN JOHN ALEXANDER HALLIDAY, 11th HUSSARS, son of the late John Halliday, of Chicklade House, Salisbury, was born in London on the 10th April, 1875. He was educated at Harrow, where, in 1893, he was in the School Cricket XI, in 189.2- 93 in the Football XI, won the second prize for heavy- weight boxing in the Public Schools' Competition in 1893, and the first prize for the same in 1894. He then went to Trinity College, Cambridge; where he won the hammer-throwing prize at the Inter-'Varsity Sports in 1897. Captain Halliday joined the 11th Hussars in March, 1898, becoming Lieutenant in March, 1900, and obtaining his troop in March, 1903. He took part in the South African War in 1901 on special service, and afterwards on the Staff, as signalling officer. He was present at operations in the Transvaal, Orange River and Cape Colonies, receiving the Queen's medal with five clasps. From April, 1908, to February, 1911, he was Adjutant of his Regiment, and from March, 1911, to February, 1914, Adjutant of the Leicestershire Yeomanry. In the Great War he was with his Regiment during the retirement from Mons, and was fatally wounded at Messines on the 31st October. dying from the effects in the Duchess of Westminster's Hospital at Le Touquet on the 13th November, 1914. Captain Halliday, who was a member of the Cavalry Club and of the M.C.C. and I Zingari, was well known in the hunting field in Ireland, where he hunted for twelve consecutive seasons. Extract from Wiltshire Times and Trowbridge Advertiser - Saturday 21 November 1914, page 4: Capt. Halliday Dies of Wounds. Captain John Alexander Halliday (Alec). 11th Hussars, who died in the Duchess of Westminster's Hospital, Touquet, on November 18th. from wounds received in action at Messines on October 31st, was the eldest son of Mr. John Halliday, of Chicklade House, Wilts. Born on April 10th, 1875, and educated at Harrow and Trinity College, Cambridge, he was good all-round athlete. He was in both cricket and football elevens at school, champion heavy-weight boxer at the Public Schools competition, Aldershot, 1894, and threw the hammer for Cambridge in the University sports, 1896-97. He joined the 11th Hussars in 1898, served in India, and on special service in the South African War (medal). He obtained his captaincy in 1905, and was adjutant to the Leicestershire Yeomanry for three years. He went out with the Expeditionary Force at the beginning of the war, and fought all through the retreat from Mons. He was well known in the hunting field in Ireland and South Wilts. Extract from Broad Arrow - Friday 20 November 1914, page 29: Capt. John Alexander Halliday, 11th Hussars, who died in the Duchess of Westminster's Hospital, Le Touquet, on the 13th inst., from wounds received in action at Messines on the 31st ult., was the eldest son of Mr. John Halliday, of Cricklade House, Wilts. Born in 1875, and educated at Harrow and Trinity College, Cambridge, he joined the Line from the Militia in 1898, and was promoted captain in 1905. He was engaged on special service during the South African War of 1899-1902. HAMILTON Herbert Otho [1911] Lieutenant. 12th Battalion Northumberland Fusiliers. Killed in action on 25 September 1915. No known grave. Commemorated on Loos Memorial, Pas de Calais, France. Panel 20 to 22. See also Cromer War Memorial Extract from Yorkshire Post and Leeds Intelligencer - Wednesday 8 December 1915, page 6: LIEUT. HERBERT OTHO HAMILTON, 12th Northumberland Fusiliers, previously reported missing is now believed to have hve been killed on September 26 at Loos. He was the only son of the Rev. W. F. T. Hamilton, vicar of Cromer, and in January last he married Muriel, daughterof Mrs. Wakley, of Lassmade, Barnstaple. He was educated at Repton School and at Trinity College, Cambridge, where he took his degree in June, 1914. Extract from Exeter and Plymouth Gazette - Wednesday 8 December 1915, page 3: Lieut. Herbert Otho Hamilton, 12th Northumberland Fusiliers, reported missing, now believed killed September 26th at Loos, was educated Repton School and Trinity College, Cambridge, where he took his degree in June, 1914. He joined the Army in September, and received his commission in the 12th Northumberand Fusiliers. He was the only son the Rev. W. F. T. Hamilton, Vicar of Cromer (and formerly of Christchurch Church, Woking), and in January last he married Miss Muriel Wakley, daughter of Mrs. Wakley, of Lasswade, Barnstaple. The major commanding his Company wrote: \"We had to attack at 9 a.m. My Company was leading, and of the Company Herberh s platoon had the honour of leading. He fell right forward in the fining line at the head of his men. He was a very gallant officer, and greatly beloved by all.\" In his last letter to his father, Lieut. Hamilton wrote:—\" Just a line while the beginning of the great battle is going on. It is wonderful how peaceful one feels amid it all. Any moment one may be put out of action, but one does not worry. That quiet time alone with at the Holy Communion was very nice and solemn and most comforting.\" HAMILTON Kenneth [1905] Lieutenant, W. African Frontier Force. Died in Nigeria 15 Nov. 1918 of influenza contracted on active service HANDFORD Everard Francis Sale (1914) 2nd Lieutenant, Sherwood Foresters (Notts. and Derby Regiment., T.F.). Killed in action 15 Oct. 1915 HANDFORD H Basil S [1912] Captain, Sherwood Foresters (Notts. and Derby Rgt., T.F.). Killed in action 15 Oct. 1915 HANSON Oswald H [1891] Lieutenant-Cdr., R.N.V.R. Killed while prisoner in German hands 5 Nov. 1914 HARKER E Keith No further information currently HARMSWORTH Hon Vere S T (1914) Lieutenant, R.N.V.R. (R.N.D.). Killed in action 13 Nov. 1916 HARRIS Roland J No further information currently HARRISON Everard [1901] Captain, R.A.M.C. (T.F.). Killed in action 18 April 1917 HARROWING John Stanley [1907] Captain, Royal Army Service Corps. and R. Warwickshire Regiment. M.C. Chevalier, Legion of Honour(France). Killed in action at Bullecourt 4 May 1917 HARTLEY Charles F No further information currently HARTLEY William E [1896] Instructor, R.N. Accidentally killed on H.M.S. Vnguard 9 July 1917 HARVEY Douglas L [1911] 2nd Lieutenant, 9th Lancers. Killed in action 2 Nov. 1914 HARVEY Frank L [1909] Lieutenant, 9th Lancers. Killed in action 30 Oct. 1914 HASKINS Francis W [1908] Private, Cheshire Regiment. Died July 1916 HASLAM William K S [1911] Captain, Royal Field Artillery. (T.F.). Killed in actin 27 April 1917 HEAPE Brian [Ruston] [1911] Lieutenant Acting Captain, \"A\" Battery, 162nd Brigade, Royal Field Artillery. Killed in action 16 May 1917. Attested 7 August 1914, as 1092, West Riding Divisional Signal Company, Royal Engineers, born Cambridge, aged 22 years 1 month, employed as an Engineer at Vickers Ltd, unmarried, height 5 feet 9¾ inches, chest 40 inches, embodied from 7 August 1914 to 1 October 1914. In the 1901 census he was aged 8, born Trumpington, resident (Heyroun), Chaucer Road, Trumpington, Chesterton, Cambridgeshire. Buried in FAUBOURG D'AMIENS CEMETERY, ARRAS, Pas de Calais, France. Plot V. Row E. Grave 27. See also Cambridge, St. Faith's School Extract from England & Wales Government Probate Death Index 1917: HEAPE Brian Ruston of 10 King's Bench-walk London a captain R.F.A. died 10 May 1917 at Arras in France Administration London 15 August to Walter Heape esquire. Effects £1484 16s. 3d. Extract from De Ruvigny's Roll of Honour 1914-1918, Volume 3, page 133-134: HEAPE, BRIAN RUSTON, Capt., R.F.A., s. of Waiter Heape, M.A., F.R.S., of King's End House. Bicester, and of 10, King's Bench Walk, Temple, by his wife Ethel, dau. of Joseph Ruston ; b. Cambridge. 27 June, 1892: educ. at Parkfield, Hayward's Heath; at Repton. where he was a member of the O.T.C., and shot for his school at Bisley ; he also represented his school in the team sent to Aldershot for the Public Schools competition of his year, and at Trinity College, Cambridge, where he served in the University Cavalry Corps. He was apprenticed to Messrs. Vickers, Sheffield ; joined the West Riding Territorial Royal Engineer Corps on the outbreak of war ; obtained a commission in the Royal Horse Artillery in Dec. 1914, and subsequently exchanged into the Royal Field Artillery. He served with the Expeditionary Force in France and Flanders from March, 1915 ; took part in the operations on the Somme, and was killed in action 16 May, 1917, while acting Major in command of his battery, and fighting his gnus at the Battle of Arras. His Colonel wrote : Brian, as you know, was a great friend of mine, and we had journeyed into much danger together. You have reason to be proud of him as the bravest of brave soldiers. as brave a man as ever I have met. He had nerves of steel, and did not know what fear was ; in fact, he didn't realize that there was any such thing as danger in the whole world. He was a born fighting soldier, a most capable battery commander, and during the whole time he was serving under me I never found a single fault in him, nor did I have a single complaint from him I miss that great big, cheery fellow, with his wonderfully joyful laugh and his perfect good temper. He was the life and soul of his battery,\" and a brother officer: \" His death was nearly as great a blow to us as It must be to you, as we loved him as only a soldier can love a very brave and gallant officer.\" Unm. HEBBLETHWAITE Christopher John? [1903] Lieutenant, Nigeria Regiment., W. African Frontier Force. Killed in action near the Nigerian frontier 7 April 1915 HEDLEY William A C (1914) Lieutenant, The Buffs (E. Kent Regiment.). M. Died 19 July 1918 of wounds received in action HELM Henry P D [1912] Captain, Border Regiment.; Captain (O. and Ad.).Royal Air Force. M. Died 6 Nov. 1918 HENDERSON Alec S [1905] Captain, London Regiment. (R. Fusiliers.). Died 25 April 1915 of wounds received in action HENN Edward Henry Lovett [1910] 2nd Lieutenant, 9th Battalion, Rifle Brigade; attached to King\u0092s Royal Rifle Corps. Killed in action 25 September 1915. Aged 23. Son of Edward Lovett-Henn and Margaret Agnes Vaughan Henry his wife, of Campagne Sidi-Merzoug, El-Biar, Algiers. Educated at Freiburg University, Baden, and Trinity College, Cambridge. B.A., 1913. Qualified for entry to Foreign Office (2nd in Competition), August, 1914. Volunteered Sept., 1914, and went to France in August,1915. No known grave. Commemorated om YPRES (MENIN GATE) MEMORIAL, West-Vlaanderen, Belgium. Panel 46 - 48 and 50. HENRI Frank [1912] Captain, Northumberland Fusiliers. Killed in action 15 June 1918 HERDMAN George A [1914] 2nd Lieutenant, King\u0092s (Liverpool Regiment.). Killed in action1 July 1916 HERMAN George A [1911] Lieutenant, Cambridgeshire Regiment. Killed in action near Givenchy 20 July 1916 HERRIES Alexander D Y [1911] Captain, King\u0092s Own Scottish Borderers. Killed in action on the Somme 23 July 1916 HESLOP George H (1914) Captain, Middlesex Regiment. Killed in action 1 July 1916 HESS Henry (1914) Private, R. Fusiliers (P.S. Bn.); 2nd Lieutenant, Middlesex Regiment. M. Died 28 Oct. 1916 of wounds received in action HETHERINGTON Thomas William [1911] Lieutenant, Durham L.I. Killed in action 17 July 1916 HEXT Thomas M [1915] 2nd Lieutenant, King\u0092s Royal Rifle Corps. Killed in action 29 April 1917 HEYWOOD Arthur G P [1904] Major, Manchester Regiment.; G.S.O. 3. Died 12 Sept. 1918 of wounds received in action 28 Aug. 1918 HEYWOOD Bertram C P [1882] T.D. Colonel, Manchester Regiment. (T.F. Res.). Died 28 Oct. 1914 HEYWORTH Heyworth Potter Lawrence [1896] Captain and Adjt., N. Staffs. Regiment. Killed in action in Gallipoli 6 Aug. 1915 HICKS Basil Perrin [1911] Lieutenant, R. Berkshire Regiment. Killed in action 25 Sept. 1915 HILARY Harry J [1897] 2nd Lieutenant, Royal Field Artillery. Died 3 June 1917 of wounds received in action HILL Charles E C [1913] Lieutenant and Adjt., Highland L.I. M. Killed in action in Mesopotamia 17 April 1916 HILLS William F W [1912] Lieutenant, Royal Field Artillery. and R.F.C. Killed in action 6 March 1917 HILTON Henry D [1902] 2nd Lieutenant, Middlesex Regiment. Killed in action 19 Dec. 1914 HILTON Murray V [1875] Colonel, E. Lancashire Regiment. Killed in action 20 Oct. 1915 HINDLEY-SMITH Evelyn Hay No further information currently HOARE H Colt A [1907] Captain, Dorset Yeo. Died 19 Dec. 1917 of wounds received in action Nov. 1917 HODGSON Cyril A G [1902] Captain, R. North Devon Yeo. Died 20 March 1918 of pneumonia following malaria contracted on active service HODGSON George W H [1907] Lieutenant, Border Regiment. Died 6 Nov. 1914 of wounds received in action 2 Nov. 1914 HOLMAN Donald (1914) Lieutenant, Middlesex Regiment.; attd. The Queen\u0092s (Royal West Surrey Regiment.). Killed in action 8 Aug. 1918 HOPGOOD John L (1914) Private, Middlesex Regiment. (P.S Bn.); 2nd Lieutenant, The Queen\u0092s (Royal West Surrey Regiment.). Died 17 Aug. 1916 of wounds received in action 13 Aug. 1916 HOPKINSON Bertram [1892] F.R.S. Lieutenant Colonel, Royal Air Force. Killed in flying accident in crash of a Bristol F.2b. Monday, 26th August 1918. Aged 44. Son of Dr. John Hopkinson, F.R.S., M.A., D.Sc., and Mrs. E. Hopkinson, of \"Ellerslie\", Adams Rd., Cambridge; husband of Mariana Hopkinson (nee Siemens), of 10, Adams Rd., Cambridge. Buried in the right half, near chapel, in ST. GILES & ST. PETER CHURCHYARD CEMETERY, Cambridge. Grave reference 2D51/2. The RAF List 1st April 1918 lists him as Major serving under Ministry of Munitions (Aircraft Production). See also Cambridge St Giles and Cambridge Guildhall Born 11 January 1874, Birmingham ; eldest son of Dr.John Hopkinson (1849-1898) (later Professor of Electrical Engineering, King's College, London) & Evelyn Hopkinson (nee Oldenburg). Educated at St.Paul's, London, Trinity College, Cambridge (MA Mathematics), & King's College, London (BSc Experimental Physics). Called to the Bar, 1897, & practised patent law. Consultant electrical engineer, 1898-1903. In 1903, married Mariana, eldest daughter of Alexander Siemens; in same year, appointed Professor of Mechanisms & Applied Mechanics, Cambridge University, & elected Professorial Fellow at King's College,Cambridge. Research into electronic measurement techniques, efficiency of internal combustion engines,& effects of projectiles & explosives on armour plate. Elected Fellow of the Royal Society,1910. Also served as Major on London Electrical Volunteers (TF) & commanded RE Section of Cambridge University OTC, 1908-14. On outbreak of war, taught at School of Military Engineering, Chatham, then worked at Admiralty, 1915, on protection of warships from mines and torpedoes, developing \"bulge\" protection system. Transferred to Royal Flying Corps November 1915, as Technical Staff Officer. 1916-18, directed research into aircraft bombing and armament development at Experimental Station, Orfordness. Companion of the Order of St.Michael & St.George (gaz. 24th January 1917) ; prom.to Lt.Col. (RAF) (gaz. 23rd July 1918). Killed in flying accident 26/8/1918, piloting Bristol F.2b C4885; flying solo, crashed in bad weather at Paston, Essex, en route from Martlesham Heath to Hendon. Buried at St.Giles' Cemetery, Cambridge, 30th August 1918, after funeral service at King's College Chapel. Survived by widow & six daughters. HOPKINSON Eric Humphrey [1913] Lieutenant, 1st Battalion, Cambridgeshire Regiment. Awarded the Military Cross (M.C.) M - Mentioned in Despatches twice. Died in German hands 2 June 1915 of wounds received in action. Aged 21. Son of Albert and Olga C. Hopkinson, of 6, Adams Rd., Cambridge. Scholar, Trinity College, Cambridge. No known grave. Commemorated on PLOEGSTEERT MEMORIAL, Hainaut, Belgium. Panel 10. HOPKINSON Rudolph C [1909] Lieutenant, Royal Engineers. (Signals). M. Died 9 Feb. 1917 of wounds received in action 24 Nov. 1915 HOPLEY Geoffrey William Van der Byl [1910]\n\nGeoffrey William Van der Byl Hopley Second LieutenantGeoffrey William Van der Byl Hopley\n\n© IWM (HU 115899) Second Lieutenant, 2nd Battalion, Grenadier Guards and Special Reserve. Died of wounds 18th May 1918. Born 9th September 1891, Kimberley, Cape Province, South Africa. Buried in HARROW CEMETERY, Middlesex. Grave reference 19. I. 3306. See also Lords MCC WW1 Extract from Wisden Cricketers' Almanack Second Lieut. Geoffrey William Vanderbyl Hopley (2nd Battalion Grenadier Guards) died at the age of 23 on May 12 in the Military Hospital at Boulogne-sur-Mer, having been severely wounded in Flanders on February 3. He was in the Harrow Eleven in 1909 and 1910, in the latter season being second in the batting averages with 27.18. In his two matches against Eton he scored 1 and 23, 35 and 8. Proceeding to Cambridge, he obtained his Blue in 1912, making 14 and 6 not out v Oxford, but was unable to keep his place in either of the two following years. In 1914 he gave every promise of regaining a position in the side, scoring 29 and 120 in the Seniors' Match and 86 and 68 in a Trial game, but later he was quite out of form. In 1912 he won the heavyweight boxing for Cambridge. He was brother of Mr. FJV Hopley, and had been a member of the MCC since 1911. Extract from De Ruvigny's Roll Of Honour 1914-1918, Volume 2, page 171: HOPLEY, GEOFFREY WILLIAM VANDER BYL, 2nd Lieut., 2nd Battn. Grenadier Guards. 2nd s. of the Hon. William Musgrove Hopley, of Tenterden, Wynberg, Cape Colony, Senior Judge of Southern Rhodesia, by his wife, Annie, eldest dau. of the Hon. John Vander Byl, M.L.A. ; b. Kimberley, South Africa, 9 Sept. 1891 ; educ. Harrow (Scholar), and Trinity College, Cambridge (Scholar), where he obtained a First Class in the Law Tripos ; subsequently became a Barrister-at-Law, being called to the Bar (Inner Temple) in 1914 ; volunteered for Imperial Service on the outbreak of war in the Aug. of that year, and was gazetted 2nd Lieut. Grenadier Guards on the 19th ; served with the Expeditionary Force in France and Flanders, and died in hospital at Boulogne. 12 May, 1915, from wounds received in action near Bethune on 3 Feb. He was a keen sportsman; while at Harrow played in the Cricket XI. against Eton, and later in the Cambridge Xl. against Oxford ; also represented Cambridge as heavyweight boxer against Oxford : unm. HORNSBY Richard L W [1911] 2nd Lieutenant, Lincolnshire Regiment. Killed in action 9 Oct. 1915 HORNUNG John P [1913] 2nd Lieutenant, Royal Field Artillery. M.C. Died 20 Feb. 1916 of wounds received in action HOWARD Cecil C No further information currently HOWARD John B (1914) Captain, R.Welsh Fusiliers. (T.F.). Died 6 Sept. 1918 of wounds received in action HOWKINS George A [1913] 2nd Lieutenant, Northum,berland Fuls. Killed in action 25-27 Sept. 1915 HUBBACK Francis W [1903] 2nd Lieutenant, London Regiment. (Rifles). Died 12 Feb. 1917 of wounds received in action HUDSON Arthur C [1895] Major, R. Fusiliers. Died 2 Oct. 1916 of wounds received in action HUDSON Ralph Palliser Milbanke [1910] Captain, 3rd Battalion, Duke of Wellington's (West Riding Regiment). Died 25 March 1920 form the effect of wounds received in action. Born 14 October 1890. Baptised 19 November 1890 in Ashbrooke, Christ Church, Durham, son of Ralph Millbanke and Eliza Westropp Hudson. Sailed from Plymouth to Melbourne, Victoria, Australia 8 November 1916, aged 25 aboard the Omrah. See also Charterhouse School, Godalming, Surrey Extract from England & Wales Government Probate Death Index 1920: HUDSON Ralph Palliser Milbanke of 8 the Cedars Sunderland died 25 March 1920 Probate Durham 2 December to Annie Charleston Hudson widow Ralph Frederick Richard Becher lieutenant in H.M. Army and John Sanderson Dawson coal exporter. Effects £16619 11s. 10d. in the United Kingdom. Extract from Lichfield Mercury - Friday 2 April 1920, page 6: Captain Ralph Hudson (\"Peter\"), short story writer and shipowner, has died at Sunderland, aged thirty. His death was indirectlhy due to injuries received through being buried in a shell hole during the war. HUGHES Norman A [1907] Private, R. Fusiliers (P.S. Bn.); Captain, Welsh Regiment. Killed in action 18 Sept. 1918 HUGHES Thomas McK [1902] Private, London Regiment. (Artists Rifles); Lieutenant, King\u0092s Royal Rifle Corps and Gen. Staff (Intelligence), attd., R.F.C. M. Killed in action near Polderhoek 5 Feb. 1918 HUGHES-GIBB Harold Francis [1910] Lieutenant, Royal Field Artillery. Killed in action 18 April 1917 HULTON-SAMS Rev Frederic Edward B [1900] Lce.-Cpl., Bedfordshire Regiment.; Lieutenant, D. of Cornwall\u0092s L.I. Killed in action at Hooge 30 July 1915 HUNTSMAN Benjamin C (1914) Captain, Sherwood Foresters (Notts. and Derby; Regiment., T.F.). Killed in action 7 April 1917 INGRAM Thomas L [1894] Captain, R.A.M.C. D.S.O. M.C. M2. Killed in action 16 Sept. 1916 INSOLE George C L [1907] Captain, Welsh Guards. M.C. Killed in action 12 April 1918 INNES Donald McLeod Second Lieutenant, 14th Battalion, Royal Highlanders (Black Watch). Died of wounds 6 October 1918. Aged 19. Born at Cambridge. Birth registered in the July to September Quarter 1899 in Cambridge. Baptised 11 July 1899 in Cambridge, St Paul, son of Margaret and Hugh Mcleod Innes, of St Eligius Street, Cambridge. Son of Hugh McLeod Innes and Margaret Innes, of 6, St. Elgins (sic - s/b Eligius) St., Cambridge; grandson of Lt. Gen. James John McLeod Innes, V.C., Royal Engineers; brother of Patrick McLeod Innes (below). Scholar of Repton School; Exhibitioner of Trinity College, Cambridge. In the 1901 census he was aged 1, born Cambridgeshire, son of Hugh Mcleod and Margaret Innes, resident 6, St Eligins Street, Cambridge. Buried in ABBEVILLE COMMUNAL CEMETERY EXTENSION, Somme, France. Plot IV. Row G. Grave 16. See also Cambridge Guildhall and also Cambridge St Paul's INNES Patrick McLeod Second Lieutenant, 111th Siege Battery, Royal Garrison Artillery. Killed in action 30 April 1917. Aged 19. Birth registered in the July to September Quarter 1897 in Cambridge. Baptised 13 October 1897 in Cambridge, St Paul, son of Margaret and Hugh Mcleod Innes, of St Eligius Street, Cambridge. Son of Hugh McLeod Innes and Margaret Innes, of 6, St. Eligius St., Cambridge; brother of Donald McLeod Innes (above). Educated at Haileybury College, 1911-1916. Head of School, elected to a History Scholarship at Trinity College, Cambridge, 1915. Buried in LA TARGETTE BRITISH CEMETERY, NEUVILLE-ST. VAAST, Pas de Calais, France. Plot I. Row A. Grave 3. See also Cambridge Guildhall and also Cambridge St Paul's Extract from England & Wales Government Probate Death Index 1917: INNES Patrick McLeod of 6 St. Elgin's-street Cambridge second-lieutenant Royal Garrison Artillery died 3o April 17 Administration Peterborough 5 October to Hugh cLeod Innes fellow and bursar Trinity College.\n\nEffects £144 5s. 4d. IPSWICH Viscount William Henry Alfred [1903] Lieutenant, Coldstream Guards.; Lieutenant (A.), Royal Air Force. Killed in flying accident 23 April 1918 ISHERWOOD Samuel G No further information currently JACKSON Bertram R [1906] Captain, Coldstream Guards. Killed in action 15 Sept. 1916 JACKSON Edward P [1912] 2nd Lieutenant, R. Warwickshire Regiment.; attd. S. Wales Borderers. Killed in action 9 May 1915 JEAKES John W [1899] Lieutenant, R. Berkshire Regiment. Died 12 Oct. 1917 of wounds received in action JENKIN Louis F (1914) 2nd Lieutenant, Loyal N. Lancashire Regiment.; Captain, R.F.C. M.C. and Bar. Killed in action 11 Sept. 1917 JENNISON James L No further information currently JOHN Hugh Graham [1914] 2nd Lieutenant, York and Lancaster Regiment.; attd. Northumberland Fusiliers. (T.F.). Wounded and missing, presumed killed in action, at Hooge 16 June 1915 JOHNSON George A M T (1914) 2nd Lieutenant, London Regiment. (St Pancras Bn.). Killed in action 21 May 1917 JOHNSON Reginald T [1898] Captain, N. Staffs. Regiment. (T.F.). Killed in action near Hulluch 13 Oct. 1915 JOHNSON William Morton [1900] Captain, 16th Battalion, Manchester Regiment. Killed in action at Montauban 2 July 1916. Aged 34. Son of William Henry Johnson, B.Sc., and Agnes Morton Johnson, of Woodleigh, Altrincham, Cheshire. Educated at Harrow and Trinity College, Cambridge. M.A., F.R.G.S. Chairman and Managing Director, R. Johnson, Clapham & Morris Ltd., Manchester. No known grave. Commemorated on THIEPVAL MEMORIAL, Somme, France. Pier and Face 13 A and 14 C. JOICEY Hon Sydney J D [1903] Captain and Adtj., Northumberland Fusiliers. Killed in action 20 March 1916 JONES Cecil Hugh [1906] Captain, R. Welsh Fusiliers. Killed in action 18 Sept. 1918 JONES Evan Davies [1911] 2nd Lieutenant, R. Fusiliers; Lieutenant (A.), Royal Air Force. Killed in action 2 April 1918 JONES Fred J J R [1913] Trooper, 27th Regiment. Of Dragoons, French Army. Died 23 Feb. 1915 of wounds received in action JOWETT Eric C (1914) Lieutenant, Northumberland Fusiliers.; Lieutenant (A.), R.F.C. Died in German hands 9 July 1916 of wounds received in action 8 July 1916 KEELING Frederic H [1904] C.S.M., D. of Cornwall\u0092s L.I. Killed in action 18 Aug. 1916 KEEN Arthur W [1913] Major (A.), Royal Air Force. M.C. Died 2 Sept. 1918 of wounds received in action 15 Aug. 1918 KELSEY Arthur E [1883] Fleet-Surgeon, R.N.; Captain, R.A.M.C. Drowned on H.M. hospital ship Glenart Castle 26 Feb. 1918 KENNEDY Horas T [1908] 2nd Lieutenant, N. Staffs. Regiment.; Lieutenant, R. Scots Fusiliers.; attd Royal Engineers. (Fioeld Survey Coy.). Killed in action 6 June 1917 KENNEDY John M S [1912] Lieutenant, Seaforth Hdrs. Killed in action 10 Aug. 1915 KERRISON Roger O [1891] Old Etonian. Lieutenant-Colonel, 6th Reserve Cavalry Regiment (Formerly Suffolk Yeomanry) attached 4th Brigade, Australian Field Artillery. Died of dysentery 18th September 1917. Aged 44. Son of Roger and Florence Lucy Kerrison, of Tattingstone Place, Ipswich, Suffolk. Educated at Eton and Trinity College, Cambridge. Left Eton College in 1891. Joined the Loyal Suffolk Hussars (Yeomanry) in 1896, subsequently commanded the Regiment. In the 1881 census he was aged 7, born Norfolk, a scholar, son of Roger and Florence Lucy Kerrison, resident Tower House, 17, Ipswich St Mary at the Tower, Ipswich, Suffolk. Married Diana Elizabeth Postle Heseltine in 1896 in St Paul, Wilton Place, Knightsbridge, Middlesex who he divorced and then married Elizabeth Isobel Stuart Ferguson in the July to September Quarter 1915 in St. Martin registration District, London. . Buried in WIMEREUX COMMUNAL CEMETERY, Pas de Calais, France. Plot IV. Row N. Grave 4. See also Lords M.C.C. WW1 War Memorial. Photograph Copyright © Illustrated London News - Saturday 20 October 1917, page 17 Extract from England & Wales Government Probate Death Index 1917: KERRISON Roger Orme of 56 Brompton-square Middlesex died 18 September 1917 iri France Probate London 28 December to Elizabeth Isobel Stuart Kerrison widow.\n\nEffects £19578 12s. 2d. Extract from Hampshire Independent - Saturday 22 September 1917, page 7 and Hampshire Advertiser - Saturday 22 September 1917, page 6: Lieutenan Colonel Roger Orme Kerrison, Reserve Regiment of Cavalry, attached Australian Artillery, died on September 18th, in hospital abroad, of dysentery contracted on active service, aged 44. Colonel Kerrison formerly commanded the Suffolk Hussars Yeomanry. He was a magistrate for Suffolk, and Lord of the Manor of Tattingstone. He married first in 1896 Diana Elisabeth, third daughter of John Postle Heseltine, formerly of Walhampton, Lymington, and second, in 1915, Elizabeth I. Stuart-Ferguson. KINDERSLEY Henry R [1882] Major, Dorset Yeo. and Labour Corps KING Arthur M [1888] Major, Rifle Brigade. Killed in action 15 March 1915 KINNAIRD the Hon Douglas Arthur (Master of Kinnaid) [1898] Old Etonian. Captain, 1st Battalion, Scots Guards. Killed in action 24th October 1914. Aged 35. Master of Kinnaird. Son of 11th Baron Kinnaird, of Rossie Priory, Inchture, Perthshire, resident 10, St. James's Square, London. His brother The Hon Arthur Middleton also fell. Educated Eton and Trinity College, Cambridge. Left Eton College in 1898. Height 5 feet 7½ inches. Religious denomination Presbyterian. Served in Egypt 22nd March 1912 to 1st January 1913 and France from 4th October 1914. Buried in GODEZONNE FARM CEMETERY, Ieper, West-Vlaanderen, Belgium. Plot II. Row A. Grave 1. See also Lords MCC WW1 Extract from De Ruvigny's Roll Of Honour 1914-1918, volume 1, page 216: KINNAIRD, HON. DOUGLAS ARTHUR, Master of Kinnaird, Capt., 2nd Battn. Scots Guards, eldest s. of Arthur Fitzgerald, 11th Lord Kinnaird, K.T., by his wife, Mary Alma Victoria, dau. of Sir Andrew Agnew, of Lochnaw, 8th Baronet; b. Rossie Priory, Inchture, co. Perth, 20 Aug. 1879; educ. Cheam School. Surrey; Eton, and Trinity College, Cambridge (13.A. 1901, M.A. 1905); gazetted 2nd Lieut. 3rd Scots Guards, 22 May, 1901, and promoted Lieut. 1 Feb. 1904, and Capt. 3 Feb. 1 912; transferring to the 2nd Battn. when the 3rd was disbanded; went to Antwerp with his Battn. in the 7th Division; served through the retreat from that place and was killed in action, 23 Oct. 1914, during one of the numerous rearguard actions, to protect the retirement of the Belgian Army. Buried with another officer at Zonnebeke Farm, near Poligne, Belgium; unm. Capt. Kinnaird was in the Volunteer Corps at Eton and Cambridge, and travelled much on the Continent to study Art and Literature. In 1906, he went to East Africa for big game shooting, aud made a large collection of heads and trophies. lie also visited India for the Coronation Durbar at Delhi in 1911. Extract from The Bond of Sacrifice, Volume 1, page 216: CAPTAIN the Honble. DOUGLAS ARTHUR KINNAIRD, MASTER OF KINNAIRD, 2nd BATTN. SCOTS GUARDS, who was killed in action on the 24th October, 1914, near Ypres, was the eldest son of the eleventh Baron Kinnaird and the Baroness Kinnaird, of Rossie Priory, Inchture, Perthshire, and was born there on the 20th August, 1879. He was related to the Duke of Leinster, the Earl of Gainsborough, and Sir Andrew Agnew. Captain Kinnaird was educated at Eton and Trinity College, Cambridge, as Lord Kinnaird had been, taking his degree of M.A. at the University. He was a Lieutenant in the Eton College Volunteer Corps, and also in the Cambridge University Volunteer Corps. He subsequently joined the Forfar and Kincardine Artillery Militia, afterwards entering the Scots Guards in May, 1901, becoming Lieutenant in February, 1904. The 2nd Battalion Scots Guards formed part of the VIIth Division, which left England for Belgium early in October, and in the severe fighting near Kruiseik, in which Captain Kinnaird was killed, the battalion lost many officers. The Master of Kinnaird, who obtained his company in February, 1912, was not married, and his next brother, the Hon. K. F. Kinnaird, becomes heir to the barony. He was a member of the Guards' and Bachelors' Clubs, and among his recreations were polo and cricket. Extract from Dundee Evening Telegraph - Monday 2 November 1914, page 1: MASTER OF KINNAIRD.\n\nSon and Heir of Lord Kinnaird,\n\nHas Been Killed in Yser Battle. Intimation was received at Rossie Priory to-day that the Master of Kinnaird, son and heir of Lord Kinnaird, had been killed in action at the Yser on 24th ult. The Hon. Douglas Arthur Kinnaird was a lieutenant in the Scots Guards. He was born on 20th August, 1879, and was educated at Trinity College, Cambridge. Great sympathy will be extended throug hout the Carse of Gowrie to Lord and Lady Kinnaird on their loss. Extract from Dundee Courier - Tuesday 3 November 1914, page 4: HEIR OF LORD KINNAIRD\n\nOF ROSSIE PRIORY\n\nIS KILLED WHILE FIGHTING\n\nIN FRANCE. ONLY 600 OF BATTALION OF 1200\n\nANSWER ROLL CALL. Information was received at Rossie Priory yesterday that the Hon. Douglas Arthur Kinnaird, the Master of Kinnaird, and son of Lord and Lady Kinnaird, of Rossie Priory, Perthshire, had been killed in action on the Yser on 24th October. Lord and Lady Kinnaird are at present in London, where they are spending the winter months, and the sad news was conveyed to them there. Deceased was a captain in the 2d Battalion of the Scots Guards. He was 35 years of age, and was gazetted second lieutenant on 22d May, 1901, lieutenant on 1st February, 1904, and captain on 3d February, 1912. He was the eldest of four brothers, two of whom are at present serving with the colours, Kenneth Fitzgerald, with the Scottish Horse, and Arthur Middleton, with a London Territorial body. Educated at Cambridge. The late Master Kinnaird, who was educated at Cambridge, took a great interest , all military matters. He was busily engaged training recruits until about a month ago, when his battalion was ordered to the front for active service. Out of the 1200 who comprised the battalion, only some 600 answered the roll-call at the conclusion of the engagement in which the Master of Kinnaird was killed. Deceased was in command of the battalion when he met his death. His servant was wounded in the same engagement. The late Master of Kinnaird, who was unmarried, was most popular with all who knew him, and he will be sadly missed. His untimely death has cast a deep gloom over the surrounding district. Extract from Scottish Referee - Friday 6 November 1914, page 4: LORD KINNAIRD'S SON KILLED. The death is announced this week of Captain the Hon. Douglas Arthur Kinnaird, the eldest son of Lord Kinnaird, President of the English Football Association and President of the Polytechnic Harriers. Captain Kinnaird, who was 35 years of age, was killed in action on October 24. His death will be a great blow to Polytechnic sportsmen. He was a frequent attendant at the executive meetings, and a protagonist of every form of athletic sport. It is but a few weeks back that Lieut.-Col. Ian Hogg, son of the founder of the institute, was killed in action, while Major H. W. Studd, brother to Mr J. E. K. Studd, president of the institute, has been severely wounded in action. Extract from Dundee Courier - Monday 8 March 1915, page 4: THE LATE MASTER OF KINNAIRD Captain the Hon. Douglas Arthur Kinnaird Master of Kinnaird, 2d Battalion Scots Guards, of Rossie Priory, Perthshire, and of 10 James's Square, S.W., who was killed in action “in France or Belgium” on the 24th October last, aged 35 years, intestate and bachelor, left unsettled property gross value £10,090 17s 6d, personalty £973 6s 7d. Letters of administration of his property have been granted to his father, the Right Hon. Arthur Fitzgerald, Baron Kinnaird, K.T., of 10 James's Square, S.W., as next of kin. KNIGHT J O Coldham [1916] 2nd Lieutenant, The Queen\u0092s (Royal West Surrey Regiment.). Killed in action 30 Nov. 1917 KNIGHT Philip C [1911] Private, H.A.C.; 2nd Lieutenant, Somerset L.I. Killed in action 1 July 1916 KOHNSTAMM Norman Mortimer J No further information currently LAFONE Eric W (1914) Captain, Durham L.I. M.C. M. French Croix de Guerre. Killed in action 15 June 1918 LAMBERT Henry M [1897] Captain, 1st Dragoons. Killed in action near Ypres 13 May 1915 LANDALE Douglas B [1909] Lieutenant, Rifle Brigade. M. Killed in action 23 Oct. 1914 LANG Arthur Horace [1909] Second Lieutenant, 2nd Battalion, Grenadier Guards attached Scots Guards. Killed in action between 25th and 26th January 1915. Aged 24. Born 25 October 1890, Malabar Hill, Bombay (now Mumbai), Maharashtra, India. Baptised 12 December 1890, Malabar Hill, All Saints, Bombay (now Mumbai), Maharashtra, India. Son of Basil and Alice Sophia Lang, of Royal Oak Hotel, Sevenoaks Kent. Buried in CANADIAN CEMETERY No.2, NEUVILLE-ST. VAAST, Pas de Calais, France. Plot 12. Row E. Grave 22. See also Lords MCC WW1 See his statistics on CricInfo Extract from The Bond of Sacrifice, Volume 2, page 273: 2nd LIEUTENANT ARTHUR HORACE LANG, SPECIAL RESERVE, GRENADIER GUARDS, attd. 1st BATTN. SCOTS GUARDS, the son of Basil Lang, late Advocate-General of Bombay, and Mrs. Lang, Westerham, Kent, was born in Bombay on the 25th October, 1890. He was educated at Harrow and Trinity College, Cambridge. He was a member of the Pitt Club, at Cambridge, of the Conservative Club, London, and of I Zingari. In August, 1914, he was gazetted 2nd Lieutenant in the Special Reserve of the Grenadier Guards, and for a short time was attached to the 2nd Battalion of that Regiment. Afterwards he was attached to the 1st Battalion, Scots Guards, and was serving with it when he was killed in action defending the front trench at Cuinchy, Flanders, on the 25th June, 1915. Extract from Westminster Gazette - Thursday 24 May 1917, page 3: WILLS. Second-Lieutenant Arthur Horace Lang, Grenadier Guards, a former captain of the cricket eleven at Harrow, left “£100 to Harrow School Cricket Club.” His property was worth £15,346. Extract from Westminster Gazette - Thursday 24 May 1917, page 3: CRICKET AND THE WAR.\n\nOUR FALLEN HEROES.—X. SUSSEX. Sec Lt ARTHUR HORACE LANG (Grenadier Guards, attd Scots Guards) was reported “missing, believed killed,” and suberquently returned as “killed” on about Jan. 26, 1915. Born at Bombay on Oct. 25, 1890, he figured in the Harrow XI. four years (1906-1909), and in the last two acted as skipper and appeared for the' Public Schoots v. the M.C.C. to which was elected to membership in 1910. He was sound batsman and capable wicketkeeper, in the latter department securing eight victims against Eton in 1907. Proceeding to Cambridge University, he did not secure his “blue”\" till his last yaer (1913). though he made some good scores in trial games, and 53 v. the M.C.C. at Lord's, in 1912. Going in first, v. Oxford, he made 28 and 4. and stumped three, his hig"}, {"url": "https://www.etoncollege.com/about-us/leadership-team/", "page_content": "Simon took up his post in September 2015, having previously been Head of Bradfield College.\n\nHead Master Simon Henderson\n\nPrior to joining Bradfield College, Simon was Deputy Head (Academic) at Sherborne School.\n\nHe already knew Eton well having taught history here for eight years from 2001. He was Head of History for four of those years.\n\nSimon is a Fellow of the Chartered College of Teaching, a Trustee and former Vice-President (Europe) of the International Boys’ School Coalition and a governor of the London Academy of Excellence.\n\nA graduate of Brasenose College, Oxford, Simon is married to Ali (who is the Chief Executive of Royal SpringBoard, a social mobility charity) and they have four children."}, {"url": "https://www.funtrivia.com/trivia-quiz/People/Educated-at-Eton-324602.html", "page_content": "Quiz Answer Key and Fun Facts\n\n1. This Old Etonian was the winning cox of the 1950 University Boat Race, he later married a British princess - marriage that ended in divorce 18 years later. He was created Earl of Snowdon in 1961. Who was he?\n\n\n\nAnswer: Anthony Armstrong-Jones\n\n\n\nAnthony Armstrong Jones coxed the winning Cambridge Boat in the 1950 Boat Race. He married the Queen's sister Princess Margaret in 1960 and was given the Earldom of Snowdon a year later. He divorced Princess Margaret in 1978.\n\n2. Born in 1908 this British author and journalist was educated at Eton. He worked in Naval Intelligence during World War II but is best remembered for his novels about a very British agent and his Children's works such as \"Chitty Chitty Bang Bang\". Who was he?\n\n\n\nAnswer: Ian Fleming\n\n\n\nThe son of a MP, Fleming was educated at Eton and the Royal Military Academy, Sandhurst. He also studied in Germany and Switzerland. He worked for Naval Intelligence during the war and started writing soon after with the publication in 1953 of \"Casino Royale\" which introduced James Bond to the world.\n\n3. After Eton, university and the Guards, this writer and broadcaster became a theatre critic. In 1963 he began hosting University Challenge, a quiz show based on the American show College Bowl. Who is he?\n\n\n\nBamber Gascoigne\n\n\n\nGascoigne's name will, to many, always be synonymous with University Challenge, having hosted the programme for 25 years. He has been parodied on television by Griff Rhys-Jones in the \"Young Ones\" and by Mark Gatiss in the film \"Starter For Ten\", one of Gascoigne's catchphrases. Answer:Gascoigne's name will, to many, always be synonymous with University Challenge, having hosted the programme for 25 years. He has been parodied on television by Griff Rhys-Jones in the \"Young Ones\" and by Mark Gatiss in the film \"Starter For Ten\", one of Gascoigne's catchphrases.\n\n4. Who is the hero of the Napoleonic Wars that studied at Eton between 1781 and 1784? He was gazetted as an Ensign in the 73rd Regiment of Foot in 1787 and had an illustrious career, reaching the top of the military ladder before becoming Prime Minister between 1828 and 1830. For his services to the country he was given the Dukedom of Wellington.\n\n\n\nAnswer: Arthur Wellesley\n\n\n\nBorn in Ireland, Wellesley joined the army after his brother had found him a commission through the then Lord Lieutenant of Ireland. His military career is too extensive to detail here, but it was illustrious and his rise through the ranks rapid. After his military career he turned to politics and became Prime Minister, leading the Tory Government from 1828 till 1830.\n\n5. This Old Etonian is best known as a celebrity chef and food campaigner. He trained at London's River Cafe before moving to a small holding in Netherby, Devon. Who is this 'hero' of the 'Chicken Out' campaign?\n\n\n\nAnswer: Hugh Fearnley-Whittingstall\n\n\n\nFearnley-Whittingstall attended Eton and then Oxford University before working in conservation in Africa. He then joined the River Cafe brigade as a sous-chef. He left to work in journalism before making his name with the \"River Cottage\" series on Channel Four.\n\n6. Who was this Old Etonian whose grandfather was Governor of the Bank of England? After the war he joined the BBC and worked on \"Down your Way\", \"In Town Tonight\" and several royal occasions. He is, however, best known as a cricket commentator, who enjoyed a slice of cake and was prone to make gaffes.\n\n\n\nAnswer: Brian Johnston\n\n\n\nJohnston was a D-Day veteran and is best remembered for his cricket commentaries. He was well known for his sense of humour and his penchant for giving his co-commentators nicknames. While summing up the day's play during an Oval Test his comments about Ian Botham's dismissal caused many motorists to have to pull off the road as he and Jonathan Agnew succumbed to fits of giggles.\n\n7. Born in India, this one time Eton King's Scholar is best known by his pen name George Orwell, used when publishing \"Animal Farm\" and \"Nineteen Eighty Four\". What was his real name?\n\n\n\nAnswer: Eric Blair\n\n\n\nEric Blair (George Orwell) is considered one of the finest English twentieth-century satirists and essayists. He attended Eton from 1917 to 1921, having gained a scholarship. Although he liked to challenge the current state of the country he was a traditionalist with a real love of English values.\n\n8. Born in 1899 in Esher, Surrey this Old Etonian is best known as a racing driver and breaker of speed records. In 1939 he broke the Land Speed record for a piston driven engine vehicle at Bonneville Salt Flats in Utah, USA. He died in 1952 whilst trying to improve the World Water Speed record on Loch Ness in his jet boat \"Crusader\". Who was he?\n\n\n\nJohn Cobb\n\n\n\nJohn Cobb's achievement in breaking the world Land Speed Record was quite considerable and wasn't surpassed until 1963. Born and brought up near the famous Brooklands Race Track, he held the ultimate lap record at an average speed of 143.44 mph. Answer:John Cobb's achievement in breaking the world Land Speed Record was quite considerable and wasn't surpassed until 1963. Born and brought up near the famous Brooklands Race Track, he held the ultimate lap record at an average speed of 143.44 mph.\n\n9. Queen Victoria said of this Old Etonian that 'He always addressed me as though I was a public meeting'. He was four times Prime Minister and four times Chancellor of the Exchequer. Who was he?\n\n\n\nAnswer: William Gladstone\n\n\n\nGladstone was born in 1812 in Liverpool, the son of a sugar plantation owner, which initially led him to defend slavery when in the House. However, in the 1840s he became a passionate reformer, an advocate of Irish Home rule and an ethical foreign policy - and later became the leader of the Liberal Party.\n\n\n\nHe held the office of prime minister on four occasions, the final time from 1892-84 when he was 80-82 years old."}, {"url": "https://www.thefamouspeople.com/eton-college.php", "page_content": "Eton College Notable Alumni\n\nRight IconThis ranking is based on an algorithm that combines various factors, including the votes of our users and search trends on the internet.\n\nDiscover the notable alumni of Eton College. The list includes people like Karl Marx, Antony Armstrong-Jones, 1st Earl of Snowdon, David Cameron, George Orwell & Christopher Lee. This list of notable alumni is loosely sorted by popularity and has people from different domains of life, such as intellectuals & academics, leaders, writers, miscellaneous and scientists etc.\n\nVote for Your Favourite Eton College Notable Alumni\n\nFounded by King Henry VI in 1440, Eton College provides quality education to young boys aged 13-18 years. Located in Eton, Berkshire, near Windsor, this boarding school for boys provides quality education along with high quality sporting and cultural activities. Getting an admission in this independent school is solely based on the student’s knowledge in the all- round activities and does not depend on his financial background. Unlike other colleges and universities, which produce actors, directors, cricketers and astronauts, Eton College has educated 19 Prime Ministers and generations of aristocracy. Robert Walpole, John Stuart, George Grenville, William Pitt the Elder, Frederick North, William Grenville are some of them. Apart from the Prime Ministers, distinguished personalities like Harry Lloyd, who is well known for his role as Viserys Targaryen in the Game of Thrones series made his television debut while studying at the Eton College. Alexander Guy Rushworth Loudon, popularly known as Alexander Loudon by the cricket audience worldwide captained the 1st XI, while studying at Eton. Also, Simons Woods, a product of the Eton College is an English actor who starred the Dr Harrison in the BBC1 costume drama series Cranford. Other prominent Etonians who pursued their education in the Eton College include Ivo James Benedict Stourton, a British author and solicitor; Henry Blofeld, cricket commentator and journalist; Robin Dixon, a politician and an Olympic Games gold medal winner. Check out the other few celebrities who studied at the Eton College, Berkshire."}, {"url": "https://www.kings.cam.ac.uk/archive-centre/introduction-to-archives/biographies", "page_content": "This page contains short biographies of many of the people mentioned in this website. They are arranged alphabetically by surname.\n\nIf you don’t find an entry for the person you are looking for, there may be information online or in the Dictionary of National Biography.\n\nSee the Glossary for terms relating to Cambridge (e.g. Fellow) or Rupert Brooke (e.g. Neo-Pagan).\n\nAsquith, Herbert Henry (1852–1928), first earl of Oxford and Asquith\n\nAsquith was born on 12 September 1852 at Croft House, Morley, Yorkshire and educated at Balliol College in Oxford. In 1874 he became President of the Oxford Union. After graduating, he became a lawyer and also wrote for the Spectator newspaper. In 1886, he started his political career by becoming the Liberal candidate for East Fife. He went on to become Home Secretary (1892-1895) and Chancellor of the Exchequer (1905-1908). After this, he became Prime Minister, a position he held until 1916. Rupert Brooke dined with the Asquiths, Winston Churchill, Edward Marsh and D.H. Lawrence at 10 Downing St on 30 July 1914.\n\nBrooke, Alan England (1863-1939)\n\nAlan England Brooke was Rupert Brooke’s uncle. Although Rupert Brooke did not mention him much in any of his letters, his uncle must have had some influence on him, for he was Dean of King’s College, when Rupert Brooke came up to study there. A former Eton student, Alan England Brooke came up to King’s College in 1883, where he studied classics. He became a Fellow of the College in the year 1889. In 1891 he was ordained as a Deacon and then in 1904 he became a priest. From 1894 until 1918, he was Dean and Lecturer in Divinity at King’s College. In 1918, he became Chaplain to the King. He became Provost of King’s College in 1926 and held this position until 1933.\n\nBrooke, Alfred\n\nSee Brooke, William Alfred Cotterill ‘Podge’.\n\nBrooke, Frances ‘Aunt Fanny’\n\nLizzie and Fanny were the sisters of William Parker Brooke, Rupert Brooke’s father. They were unmarried and lived with their father Richard England Brooke, retired Rector of the Abbey at Bath, in a house called Grantchester Dean, in Bournemouth.\n\nRupert’s Aunt Fanny (F.M. Brooke) gave him many gifts, including books. These ranged from poetry to religion. Her Christianity and his socialism meant that the relationship between Rupert Brooke and his aunt became increasingly difficult as he grew older.\n\nMary Ruth Brooke was Rupert Brooke’s mother. She was the daughter of Charles Cotterill, who preached in Stoke-on-Trent. Her brother was Charles Clement Cotterill, master of Glencorse house, at Fettes School. It was there that she became a matron and met William Parker Brooke, whom she married and with whom she moved to Rugby. She was a dominant figure in Rupert Brooke’s life. After his death she had an interest in his literary estate and liaised with his biographers.\n\nBrooke, Richard (1881-1907)\n\nRupert Brooke’s older brother, Richard, sometimes referred to as ‘Dick’, was born in 1881. Richard was the first of the three brothers to leave home. Rupert went to see him in London and Southsea whenever he could. On 13 January 1907, Richard, who had been working for a firm of engineers, died of pneumonia.\n\nBrooke, Rupert Chawner (1887-1915)\n\nRupert Chawner Brooke was born on 3 August 1887, in Rugby, Warwickshire. He was the second of three sons of William Parker Brooke, a schoolmaster at Rugby School, and Mary Ruth Brooke. He attended a preparatory school called Hillbrow, as a day boy, from 1897 to 1901. It was there that he met James Strachey. James remained one of his closest friends for most of his life. After Hillbrow, Brooke joined School Field House at Rugby, which was his father’s house. There Brooke met Geoffrey Keynes. Both James and Geoffrey had older brothers who became members of the famous Bloomsbury group, most of whom were writers, artists and intellectuals. They were not his only link with the Bloomsbury group though. Rupert also met Virginia Stephen on a childhood holiday. She went on to marry Leonard Woolf and lead a successful career as a writer and a publisher, also being central to the Bloomsbury group.\n\nAttending the school his father was master of, Rupert Brooke distinguished himself in various ways, including growing his hair longer than most of the other boys had theirs. While at Rugby, Brooke won the school prize for his poem ‘Bastille’. His interest in poetry was encouraged by his family. His mother had been so proud that his poem ‘The Pyramids’, written a year earlier, had received a special mention in a competition that she had it printed. His Aunt Fanny’s gifts included volumes of poetry by Keats. He also became friends with St. John Welles Lucas-Lucas, who introduced him to the work of Oscar Wilde.\n\nIn 1906, Rupert Brooke came up to Cambridge, becoming a member of King’s College, where his father had been the first non-Etonian Fellow. His uncle, Alan England Brooke was Dean, later to be Provost (head of the College). Despite his family’s strong association with the College, it seems it took Rupert a while to settle in. His letters and poems show that youth and aesthetics were among his primary concerns. He described the people he met in Cambridge as ‘dull old people’. It has also been suggested that the move to Cambridge came as a culture shock, due to the situation he had been in while at School Field House. Like most students, Rupert Brooke had to get used to being away from his parents but previously his home had also been his school. He would have had to adjust to the relative anonymity of his new life or find new ways to stand out.\n\nAlthough he ‘matriculated’, or to put it another way, joined the University, to study Classics, his first love was English literature, which he focussed on later in his degree. He led an active life outside of lectures. As well as writing poetry, he developed a keen interest in drama. He had attended theatrical productions such as Peter Pan and thoroughly enjoyed them, so he relished the opportunity to take the stage in student productions at Cambridge. He played a herald in a production of the Greek play ‘Eumenides’, as well as taking an active role in the Marlowe Society in its early days. Considering himself a socialist, he joined a society called the Fabians, with his friend and fellow Kingsman Hugh Dalton.\n\nBrooke’s popularity and links with figures like Keynes and Strachey, led to him becoming an ‘Apostle’. The Apostles are a secret society in Cambridge, most of whose members were at King’s College or Trinity College. At that time, they met and read papers to each other. Certain Apostles became Rupert Brooke’s closest friends in later life, not least Edward Marsh.\n\nRupert Brooke completed his B.A. in 1909, gaining a second class in both parts of the Tripos. Though he was said to have been disappointed not to achieve a first, this did not dampen his interest in literature.\n\nIn the summer of 1909, Brooke moved out of the town, to the nearby village of Grantchester, where he seems to have been happier. At first he lived at The Orchard. There he discovered a love of the outdoors. Virginia Woolf famously boasted of having gone skinny-dipping with him, in the river at Grantchester. He was closer to another group of friends though, who Woolf called the ‘neo-pagans’, possibly due to their love of the outdoors. This group included Rupert Brooke, Katherine Cox, the Olivier sisters, Jacques and Gwen Raverat, Frances Cornford and Justin Brooke. Despite sharing the same surname, Justin Brooke was not a relative of Rupert’s.\n\nBiographers have given different accounts of Rupert Brooke’s sexuality, although it seems he was bisexual. It is now thought that his earliest affections were for boys at Rugby. It has been suggested that he first showed an interest in women at the age of twenty. His complicated relationships included one with Katherine Cox, known to her friends as Ka.\n\nOn 24 January 1910, William Parker Brooke, Rupert’s father, passed away. This meant that Rupert had to perform the duties of Housemaster at School House, Rugby, temporarily. His letters at this time suggest that while he understood what he ought to do, he was sorry to miss out on all of the activities he’d otherwise have done in Cambridge.\n\nIn August 1910, the Old Vicarage, Grantchester, became his new home.\n\nIn 1911 Brooke published his first ‘volume’, or book, of poems. Some of these poems were written during a three month trip to the continent earlier that year. In a café in Berlin, while visiting his friend Dudley Ward, Brooke wrote ‘The Old Vicarage, Grantchester’. The trip also included visits to Munich and Florence. As with previous visits to the continent, such as family trips to Italy, Brooke immersed himself in the local culture but still felt homesick.\n\nThe following year he helped Edward Marsh plan the first of his Georgian Poetry anthologies (named for the young poets who achieved renown under King George Vth). He was also working on a short play called ‘Lithuania’, which was first performed in 1916, after Brooke’s death.\n\nBrooke’s complicated love-life is said to have brought on a nervous breakdown in 1912. Ka Cox is thought to have had a miscarriage and Brooke felt jealous when James Strachey’s brother Lytton encouraged Ka to see Henry Lamb. His correspondence of this time has been described as rather coarse, expressing some views we would not consider acceptable by today’s standards.\n\nBrooke’s dissertation ‘John Webster and the Elizabethan drama’ gained him his Fellowship at King’s College, in 1913.\n\nRupert left for Canada and the United States in May 1913. During his travels, he wrote for the Westminster Gazette. Although he is best known for his poetry, these examples of his prose were published posthumously as Letters from America. On his way back to Britain, he broke his journey with a tour of the South Seas, during which he had an affair with a Tahitian woman called Taatamata. There are some suggestions that she bore his child. He returned in June 1914, not long before he went to war.\n\nWhen the war started, Brooke was keen to enlist. Geoffrey Keynes claimed that Rupert Brooke was jealous of him for having received a commission first. The extent to which Brooke experienced the hardships of war has been disputed. He received a commission as a Sub-Lieutenant in the Hood Battalion of the Royal Naval Division. He may have received this through the help of Edward Marsh, who had introduced him to Winston Churchill and the Asquith family. At this time, Brooke regularly wrote to Violet Asquith, whose father was Prime Minister. Brooke’s Battalion also included a member of the Asquith family. Thereafter he served at Antwerp. After Antwerp he wrote his five war sonnets, published as 1914. He trained for a winter at Blandford Camp and then joined the Mediterranean Expeditionary Force in February of 1915. While sailing for Gallipoli, he suffered from sunstroke and blood poisoning. He died aboard a French hospital ship on the following 23 April and was buried on the Greek island of Skyros.\n\nWilliam Parker Brooke, Rupert Brooke’s father, was the second son of the Rev. Canon Richard England Brooke, Rector of Bath, and Harriet Brooke (née Hopkins). He was educated at Kidderminster, then Haileybury. After finishing school he matriculated at Trinity College, Cambridge, although he soon transferred to King’s College, where his brothers H.R. Brooke and Arthur England Brooke had studied. He gained a B.A. in 1873 and an M.A. in 1876. In 1873, he became a Fellow (senior academic) of King’s College. In the same year, he became Assistant Master at Fettes College, in Edinburgh. It was at a social gathering there that he met Mary Ruth Cotterill, the sister of Charles Clement Cotterill, master of Glencorse house, Fettes. She was a matron at Glencorse. After marrying Mary Ruth Cotterill in 1879, he became Master of School Field House at Rugby.\n\nBrooke, William Alfred Cotterill ‘Podge’ (1891-1915)\n\nAlfred, or ‘Podge’ as he was known to his family, was Rupert Brooke’s younger brother. Like Rupert, Alfred was educated at Rugby and King’s College, Cambridge. He was admitted to King’s in 1909, where he studied History. After graduating, in 1912, he went to London to work in business. He left this to serve in the 8th City of London (Post Office) Rifles during the Great War and was killed in action on 14 June 1915.\n\nChurchill, Winston (1874-1965)\n\nWinston Churchill was born on 30 November 1874. After attending the Royal Military Academy Sandhurst, Winston Churchill gained a commission in the 4th Hussars in February 1895 and first saw shots fired in action on his 21st birthday. He quickly became a popular and well paid war reporter. He joined Kitchener’s army in Egypt.\n\nHe resigned the army in 1899 to become a politician but was unsuccessful so went to South Africa as a war correspondent. In the Boers, he was captured and held as a prisoner of war. He quickly escaped to Durban, gained a reputation as a hero and regained a military commission from the Commander-in-Chief. He continued to write.\n\nChurchill was first elected as an MP in 1900. He became the Conservative Member for Oldham in February 1901 but after four years he changed party, moving to the Liberals. He soon took his place in the Cabinet, becoming President of the Board of Trade in 1908 and acting as Home Secretary in 1910-11. He was First Lord of the Admiralty in 1911-1915. He was much criticised for his part in planning the Gallipoli Campaign (25 April 1915 and 9 January 1916), during which many soldiers fell. Rupert Brooke died of blood poisoning on his way there.\n\nIn the early 1920s, Churchill rejoined the Conservative party. He served as Chancellor of the Exchequer from 1924 until 1929. When war broke our in September 1939, he was appointed First Lord of the Admiralty again. Churchill became Prime Minister on 10 May 1940 and held this position until 1945. He served a second term as Prime Minister from 1951 to 55.\n\nRecently, he has been remembered as a family man. He married Clemente Hozier in autumn 1908 and they had five children.\n\nBorn in Cambridge on 30 March 1886, the poet Frances Cornford was the daughter of Sir Francis Darwin and Ellen Wordsworth Crofts, a lecturer in English at Newnham College, Cambridge. Frances’ father, a lecturer in Botany at Cambridge, was the third son of Charles Darwin. In the summer of 1908, Frances took part in the Marlowe Dramatic Society’s play Comus, during which she met Francis Macdonald Cornford, whom she married the following year. Conduit Head, their house in Cambridge, became popular with artists and men of letters. Frances’ first book of poems was published in 1910. Accolades include being awarded the queen’s medal for poetry in 1959.\n\nCornford, Francis Macdonald (1874–1943)\n\nFrancis Cornford was born at Eastbourne, in Sussex, on 27 February 1874. His parents were the Revd James Cornford and Mary Emma Macdonald. He was educated at St Paul’s School, then Trinity College, Cambridge, where he studied Classics.\n\nHe supported the May 1897 campaign for women to receive degrees from Cambridge, although that proved unsuccessful.\n\nAt Cambridge, he became friends with Jane Harrison. It was she who introduced Francis Cornford to Frances Darwin, whom he married in July 1909. They had a daughter called Helena in 1913 and later they had a son called (Rupert) John Cornford.\n\nFrances had been intrigued by an article he wrote entitled Microcosmographia academica, which took a light view of university politics. Initially it had been published anonymously. They got to know each other better as members of the Marlowe Society. Frances and Gwen Darwin persuaded the producers Rupert Brooke and Justin Brooke to cast Francis Cornford in the lead role of Comus.\n\nDuring the First World War, Francis Cornford became a musketry instructor at Grantham, in Lincolnshire.\n\nFrancis Cornford’s academic career was in the study and lecturing of ancient philosophy.\n\nCotterill, Erica\n\nErica Cotterill was Rupert Brooke’s cousin. Her father, Charles Clement Cotterill, was Mary Ruth Brooke’s brother and a housemaster of Glencorse house, at Fettes School. Rupert Brooke’s father was also a teacher at Fettes, before moving to Rugby. She sometimes had meals with the boys at School Field house, at Rugby. She had asked to borrow the manuscript of Rupert Brooke’s first poem, The Pyramids. In May 1904, Rupert Brooke wrote to her, describing his first experience of meeting a poet. The anonymous poet was St John Lucas. They continued to write to each other and at times she was a confidante for Brooke, for example when he told her about his first few days at King’s College, Cambridge.\n\nCotterill, Mary Ruth\n\nSee Brooke, Mary Ruth.\n\nCox, Katherine Laird ‘Ka’\n\nKa Cox’s father was Henry Fisher Cox, a Fabian (member of the socialist Fabian Society) but also a successful stockbroker. Her mother died young. Ka had two sisters, Hester and Margaret. Her father remarried and had two more daughters. He died in 1905. At the time, she was 18 years old and became financially independent as a result.\n\nShe was a Neo-Pagan (a group of friends known for their Fabianism and enjoyment of the outdoors) and Rupert Brooke got to know her through Jacques Raverat and Justin Brooke. Rupert Brooke and Ka Cox worked together on the Young Fabians.\n\nRupert Brooke and Ka Cox were lovers and had a complicated relationship, which is said to have caused Brooke to have a nervous breakdown in 1912. Ka Cox is thought to have had a miscarriage and Brooke felt jealous when James Strachey’s brother Lytton encouraged Ka to see a painter named Henry Lamb.\n\nAlthough the Neo-Pagans and the Bloomsbury group knew each other, they were quite distinct groups. Despite that, Ka Cox (Neo-Pagan) and Virginia Woolf (member of the Bloomsbury group) were close friends.\n\nDalton, (Edward) Hugh Neale (1887-1962)\n\nHugh Dalton was born at The Gnoll, near Neath, in Glamorgan, on 26 August 1887. After going to St George’s choir school at Windsor, he attended Eton College. In 1906, he matriculated at King’s College, Cambridge, where he studied mathematics. There he became friends with Rupert Brooke and together they joined the Fabian Society (a socialist society founded in 1884, which has strong links to the Labour party).\n\nThough he had matriculated in mathematics at Cambridge, in 1910 he was awarded an upper-second class degree in Economics. He moved to London that autumn to train in law at the Middle Temple. The following year he began his doctorate at the London School of Economics. In May 1914, he became a barrister and also married Ruth Fox.\n\nDuring the First World War, he served in the Army Service Corps, before transferring to the Royal Artillery.\n\nIn 1920, he became a reader (a senior academic/lecturer) in economics at the London School of Economics. His research focussed on inequalities of income.\n\nIn 1924, he was elected as MP for Camberwell (Peckham division). Between 1929 and 1931, then 1935 and 1959, he represented the Bishop Auckland division as their MP. In 1925 he joined the shadow cabinet and the following year he was elected to the Labour Party’s national executive committee, which oversees the strategies and policies of the Labour Party. In 1935, he became the Labour Party’s foreign affairs spokesman.\n\nDuring the Second World War, Prime Minister Winston Churchill made Hugh Dalton responsible for economic warfare, which meant preventing the enemy from getting supplies. In 1942, he was moved to the Board of Trade. Then, in 1945, he was moved to the Treasury, where he served as Chancellor of the Exchequer.\n\nIn his memoirs, Hugh Dalton said of Rupert Brooke that ‘the radiance of his memory still lights my path’. He bequeathed his papers concerning Rupert Brooke to King’s College.\n\nDarwin, Frances Crofts\n\nSee Cornford, Frances Crofts.\n\nDent, Edward (1876-1957)\n\nEdward Dent was born at Ribson Hall, Wetherby, Yorkshire, on 16 July 1876. After studying at Eton College, he went up to King’s College, Cambridge. Initially, he studied classics, gaining a third in part one of the Tripos in 1898. His primary interest was music and he gained a MusB in 1899.\n\nHe was a Fellow at King’s College from 1902 until 1908, lecturing on music history. He also taught composition. His first book was Alessandro Scarlatti, published in 1905. He became professor of music at the University of Cambridge in 1926, holding this post until 1941. His interest was international music, in fact he made controversial remarks about Elgar. He brought the music of Mozart to a British audience, when it was largely unknown here. He translated his operas, as well as those of Verdi and certain other composers.\n\nAs a music critic, he wrote for The Athenaeum (which became The Nation and Athenaeum), as well as Cambridge magazines. He was active in the British Music Society and was a key figure in the International Society of Contemporary Music, acting as its first president. He served on the board of directors of Sadler’s Wells Theatre and the Covent Garden Opera Trust. He was also the first President of the Liszt Society. He gained honorary doctorates from Oxford, Harvard and Cambridge universities. He died on 22 August 1957, at his home in London.\n\nDickinson, Goldsworthy Lowes ‘Goldie’ (1862–1932)\n\n‘Goldie’, as his friends knew him, was the son of Lowes Cato Dickinson (1819–1908), a London-based portrait painter, described as a Christian socialist. Goldsworthy Lowes Dickinson was educated at Charterhouse and King’s College, Cambridge, where he studied Classics. He became a Fellow of the College in 1887, then Librarian from 1893-96 and Lecturer from 1896. He was also a member of the Apostles, a secret Cambridge debating society. He was a prolific writer but is best known as an advocate of the League of Nations, perhaps even having formed the idea behind its creation. He was a close friend of E.M. Forster and though not a member of the Bloomsbury group, he was associated with many of its members.\n\nEckersley, Arthur\n\nArthur Eckersley was a dramatist and a contributor to Punch. He accompanied St John Lucas to visit Rupert Brooke in May 1904, just after Brooke had written The Pyramid.\n\nForster, Edward Morgan (1879-1970)\n\nMorgan Forster, as his friends knew him, was born on 1 January 1879. The following year, his father, Edward Morgan Llewellyn (Eddie) Forster, died and left sufficient money for him and his mother, Alice Clara (Lily) Forster, to live comfortably without the need for work.\n\nMorgan Forster claimed his mother was smothering during his childhood. In 1890, Forster went to board at Kent House, an Eastbourne preparatory school, but his mother soon moved to Tonbridge, allowing him to become a day student. There he developed a love of Classics, winning a prize in Latin verse and English essay prizes. He came up to King’s College, Cambridge, in 1897, where he gained a second in the Classical Tripos and where Goldsworthy Lowes Dickinson became a mentor to him.\n\nAs a student, he contributed to the King’s College magazine, Basileon, as well as starting to write a novel entitled Nottingham Lace, which he abandoned. He was also a member of the Apostles, a secret Cambridge debating society. Having gained a second class degree, he stayed for a fourth year to study history and then decided to travel with his mother.\n\nFirst they went to Florence, in October 1901, which inspired his novel A Room with a View. They saw northern Italy and Austria before returning to London, where they lived in a hotel in Bloomsbury and Forster taught a weekly Latin class at the working men’s college in Great Ormond Street. He also went on a cruise around the Greek islands with fellow Kingsmen. It was then that he began to realise that he liked the companionship of other men. He had a chaste relationship with Hugh Owen Meredith.\n\nForster applied to the Cambridge University local lecturers board and between 1903 and 1911 he gave eleven courses entitled ‘The republic of Florence’ in various parts of East Anglia. A piece he wrote on Greece and a short story were published, and he worked on an early draft of A Room with a View. He moved to Weybridge, in Surrey, in 1904. It was there that he wrote his six novels. In spring 1905, he became a tutor in Germany. That summer, a short story was published in instalments in the Independent Review and that October his first novel, Where Angels Fear to Tread, was published.\n\nHe continued to write novels and his social circle expanded to include Edward Marsh, Rupert Brooke and many of the Bloomsbury group. A couple of years later, he taught Latin to Syed Ross Masood, a young Indian who was about to go to Oxford. He felt he loved him but knew it was not mutual. The publication of A Room with a View in 1908 made Forster famous. He began to work on Maurice but did not allow it to be published until after his death, as it was a homosexual love story written at a time when homosexuality was illegal.\n\nAfter eight years of writing novels, he stopped writing and went to India, with Goldsworthy Lowes Dickinson and R.C. Trevelyan as travel companions. In October 1912, they stayed with Masood and his family at Aligarh, then they spent Christmas with a friend from King’s College, called Malcolm Darling, and visited Masood in Bankipore. Around this time, Forster developed the idea for A Passage to India, which he wrote after returning to Weybridge. It is thought that the fictional city of Chandrapore in that novel is based on Bankipore.\n\nAfter working part-time in the cataloguing department of the National Gallery, in October 1915 he went to Alexandria with the Red Cross, to search for missing soldiers. A poet called C.P. Cavafy then introduced Forster to Muhammed al-Adl, with whom he had an affair. At this time, he wrote articles, guidebooks and short stories, while finishing A Passage to India.\n\nIn 1921 he became private secretary to the maharaja of Dewas. In 1925, Forster and his mother moved to West Hackhurst, a house in Abinger Hammer, Surrey. They also had a place in London, where he could live more independently. He regularly wrote for publications like The Criterion, as well as delivering a series of lectures in Cambridge, later published as Aspects of the Novel.\n\nHe was elected to a supernumerary fellowship at King’s College, Cambridge. He formed a relationship with the policeman Bob Buckingham. He also protested about the banning of a book entitled The Well of Loneliness. He became the first President of the National Council for Civil Liberties, as well as sitting on the Lord Chancellor’s committee on defamatory libel.\n\nDuring the Second World War, Forster wrote essays and appeared on radio, discussing subjects such as freedom and tolerance. After his mother’s death in March 1945, Forster was unable to stay in West Hackhurst and was offered an honorary fellowship at King’s College, Cambridge, where he resided until his death in May 1970.\n\nForster refused to be knighted, in 1949; however, he did become a Companion of Honour in 1953 and received the Order of Merit on his ninetieth birthday.\n\nHassall, Christopher (1912-63)\n\nThe son of John Hassall, the painter and illustrator, and Constance Maud Webb, Christopher Hassall was born on 24 March 1912, in London. He was educated at Brighton College, then Wadham College, Oxford. He left Oxford during his finals, due to financial problems. At Oxford, he played Romeo in an Oxford University Dramatic Society production of Romeo and Juliet.\n\nIn 1933, he toured with Ivor Novello, performing in Proscenium. Novello asked Hassall to write lyrics for his melodies. He also introduced Hassall to Edward Marsh. Hassall started to write poetry, for which Marsh was a critic. Hassall wrote plays, librettos for operas, poems and biographies. His Out of the Whirlwind (1953) was the first secular play to be performed in Westminster Abbey since the Restoration. He wrote biographies of Stephen Haggard, Edward Marsh and Rupert Brooke. His biography on Marsh was critically acclaimed and won the James Tait memorial prize. Rupert Brooke: a Biography was published posthumously.\n\nIn the 1938, Hassall married Evelyn Helen Lynett Hill, with whom he had a son and a daughter. Hassall was commissioned in 1941 and became a major in the army education corps.\n\nHassall was a councillor and Fellow of the Royal Society of Literature and a governor of the London Academy of Music and Dramatic Art. He died on 25 April 1963, following a heart attack he suffered on a train.\n\nInge, William Ralph (1860–1954)\n\nBorn in Yorkshire, in 1860, William Ralph Inge was the son of William Inge and Susanna Mary Churton. He won a scholarship at Eton in 1874, before becoming a scholar at King’s College in 1879, where he received a first in both parts of the Tripos and also received various awards. After graduating, he spent four years teaching at Eton before being ordained in 1888.\n\nPrior to becoming a priest, he had held religious doubts. As a priest, he felt Christianity must focus on personal experience of God and mysticism (union with God through prayer and contemplation), rather than miracles. During his time as vicar of All Saints’ Church in Ennismore Gardens, London, he married Mary Catherine Spooner. In 1907, he became Lady Margaret Professor of Divinity at Cambridge.\n\nIn 1911, Prime Minister Asquith appointed him dean of St Paul’s Cathedral, in London. This appointment may have been due in part to Inge’s literary interests, for he wrote weekly columns for the Evening Standard. Dean Inge quoted Rupert Brooke's poem 'The soldier' in his sermon on Easter Day, 4 April 1915. After Rupert Brooke’s death on 23 April 1915, Dean Inge was one of the first to console Brooke’s mother, sending her the manuscript of the sermon.\n\nLater, he too would experience the loss of his children, as well as his wife. He was knighted in 1930. Though not a pacifist, he opposed entry into the Second World War on the basis that he felt Britain had no quarrel with Germany.\n\nKeynes, Geoffrey (1887-1982)\n\nGeoffrey Keynes was born in Cambridge on 25 March 1887. His father was (John) Neville Keynes, a lecturer in moral science, and his mother was Florence Ada Keynes. Though his older brother, the economist (John) Maynard Keynes, is better known, Geoffrey Keynes led a distinguished career as both a surgeon and a literary scholar.\n\nHe went to Rugby School in 1901, where he met Rupert Brooke, before going up to Pembroke College, Cambridge, in 1906. There he studied natural sciences and received a first in part one of the Tripos in 1909. He gained an MA in 1913.\n\nAfter Cambridge, he trained at St Bartholomew’s Hospital, London, where he won a scholarship in surgery. During the First World War, he joined the Royal Army Medical Corps. He was a pioneer in blood transfusion. On 12 May 1917, he married Margaret Elizabeth Darwin, daughter of Sir George Howard Darwin. During the Second World War, Keynes was a consulting surgeon to the RAF, reaching the rank of Acting Air Vice-Marshal in 1944.\n\nThrough Rupert Brooke, he had developed an interest in seventeenth-century poetry. He wrote on William Blake. He edited volumes by John Donne, John Evelyn, William Harvey and others. He also compiled bibliographies of writers such as Jane Austin, Rupert Brooke and Siegfried Sassoon. He wrote a biography on William Harvey (1966), then one on Rupert Brooke (1968). He was appointed as a trustee of the National Portrait Gallery in 1942 and was its chairman from 1958 to 1966. Other interests included ballet and book collecting.\n\nHe gained various honorary degrees, including ones from both Cambridge and Oxford. He was elected an Honorary Fellow of the British Academy in 1980. He died in Brinkley, near Cambridge, on 5 July 1982.\n\nKeynes, John Maynard (1883-1946)\n\nJohn Maynard Keynes was born in Cambridge on 5 June 1883, the son of Florence and Dr. John Neville Keynes, Fellow of Pembroke College and later University Registrar. Geoffrey Keynes, his younger brother, was a friend of Rupert Brooke’s. He was educated at Eton, and came up to King's College, Cambridge as a scholar in 1902. He was also a member of the Apostles, a secret Cambridge debating society.\n\nAfter he was awarded his undergraduate degree, he entered the Home Civil Service and served for two years at the India Office. He left the civil service in 1908, however, and in 1909 was elected a Fellow of King's College and remained so until his death. He was lecturer in Economics from 1911 to 1937 and in 1919 he also accepted the post of Second Bursar of the college. In 1924 he began his memorable tenure as First Bursar, changing completely the philosophy by which the college managed its assets, and in 1925, he married Lydia Lopokova.\n\nDespite his retirement from the India Office, Keynes was to be found in London almost as often as in Cambridge, placing his services at the disposal of his government, particularly when called upon by the Treasury. He served on a number of government committees in the 1920s and ‘30s, but - as with everyone else - it was during the two world wars that most was demanded of him.\n\nDuring World War I he became a civil servant in the Treasury and by 1917 had gained a position of some responsibility. He was the Treasury's representative at the peace conference that ended the war. At the invitation of the Chancellor of the Exchequer, Keynes placed his services at the disposal of his country again in 1940, after war had broken out a second time. As an advisor to the Treasury, he was much involved in both the problems of war finance and plans for the later transition from war to peace.\n\nAmong other things, Keynes acted as one of the negotiators of Lend-Lease, and played a leading part at the Bretton Woods conference. He was rewarded for his services during the first war with a C.B. (a form of knighthood), and for those during the second by elevation to the peerage, becoming Baron Keynes of Tilton.\n\nIt was not as a servant of college or country, however, that Keynes has made his name, but as a brilliant and original economist. Keynes was a prolific writer who shunned his colleagues' attempts to create an economic 'grand theory' in favour of short works that addressed the fiscal problems of the day as quickly and competently as possible. In the process he did, nevertheless, create something lasting - what we now call Keynesian economics - the cornerstone of which were his theories on saving and investment, and their relation to rising and falling prices. These were elaborated in his Treatise on money (1930) and his later General theory of employment, interest and money (1936). Through his leadership in a number of societies and his editorship of the Economic Journal he had great influence on the next generation of economists, and through his editorship of the Nation and Athenaeum and New Statesman and Nation he influenced his contemporaries more widely.\n\nHe died on Easter Sunday, 21 April 1946, after several years of ill-health.\n\nLucas, St John\n\nRupert Brooke spent much of the summer of 1904 in bed, as a result of an infected throat. That May, he was visited by St John Lucas and Arthur Eckersley. St John Welles Lucas-Lucas, to give him his full name, was educated at Oakfield, a school in Rugby, then Haileybury School, before going to University College, Oxford. He was a few years older than Brooke and lived in Middle Temple, London. They became friends and regularly wrote to each other; however, more importantly, St John Lucas became a mentor to Brooke. Brooke’s letters to him often included poetry and, being a poet himself, St John Lucas was able to offer a kind of criticism which he may not have received from anyone else. He also influenced Brooke’s tastes, introducing him to the works of various French writers such as Baudelaire, as well as Oscar Wilde.\n\nLucas and Eckersley were aware of fashions in literature, especially what was known as ‘decadence’. Brooke had been concerned that many of those he spoke to about the arts were ‘philistines’ so their influence must have given him some comfort. This influence was not always considered a good thing though. In particular, when considering whether or not to elect Rupert Brooke to the Apostles, Lytton Strachey referred to them as ‘Bobbie Longman’ and was critical of their influence on Brooke.\n\nMarsh, Edward (1872-1953)\n\nEdward Howard Marsh was born on 18 November 1872, son of Frederick Howard Marsh and Jane Marsh. He was educated at Westminster School, then Trinity College, Cambridge, where he gained first classes in both parts of the classical tripos. He was also a member of the Apostles, a secret Cambridge debating society. Through Maurice Baring and Edmund Gosse, Marsh was admitted to a literary circle in London.\n\nIn 1896, Marsh was appointed a junior clerk in the Australian department of the Colonial Office. He was soon promoted. Marsh was working in the West African department when Winston Churchill became parliamentary under-secretary for the colonies. Churchill asked him to become his private secretary and for the next twenty-three years Marsh worked alongside him, in various offices. When Churchill was on active service in the army, Marsh became assistant private secretary to Prime Minister Asquith. In July 1917, he was employed by Churchill again, during Churchill’s time as Minister of Munitions and Secretary of State for War. He also worked for Churchill in the Colonial Office and later, the Treasury.\n\nAfter meeting an art student called Neville Lytton, Marsh became a connoisseur of art. He collected works by English watercolourists, then in 1911 he bought a painting by Duncan Grant. This led to him becoming a patron of contemporary British painting. He also met several artists from Slade School of Fine Art, including John Currie and Mark Gertler.\n\nHe played host to artists and poets, in his London apartment. From 1913, Rupert Brooke spent much of his time there. His association with poets such as Brooke led to his creation of an anthology of modern verse, entitled Georgian Poetry (because they wrote during the early years of the reign of King George V). Among the poets included were Rupert Brooke, Lascelles Abercrombie, Walter de la Mare and D.H. Lawrence. Later, he developed an interest in the war poetry of Siegfried Sassoon and Robert Graves.\n\nWhen Rupert Brooke died in 1915, Marsh became his literary executor, until 1934. At that time, he edited Brooke’s posthumous prose and verse. His work did not always please Rupert Brooke’s mother.\n\nLater in life, Marsh published translations of French and Latin works. He became a trustee of the Tate Gallery and a governor of the Old Vic theatre. Committees he joined included those of the Contemporary Arts Society and the council of the Royal Society of Literature.\n\nOlivier, Nöel\n\nNöel Olivier was born on 25 December 1892, the youngest of Sydney Olivier and his wife Margaret’s four daughters. Her father was an early member of the Fabian society (a socialist society founded in 1884, which has strong links to the Labour party).\n\nHe worked as a Colonial Secretary in British Honduras and later as Governor of Jamaica, which meant the Olivier family were often abroad; however they did set up home at The Champions at Limpsfield Chart, in Surrey. There, their neighbours and Nöel’s closest friends included ‘Bunny’ Garnett, who later joined the Bloomsbury group.\n\nThe Olivier girls were sent to board at Bedales School, which had a reputation for being progressive, encouraging its students to spend time outdoors and encouraging sexual equality. Other Bedales students included Jacques Raverat and Ferenc Békássy (a Hungarian poet).\n\nRupert Brooke first met Nöel Olivier on 10 May 1908, when her father was invited to speak to the Cambridge Fabians. He was twenty and she was fifteen. After this they wrote letters to each other and met whenever they could, including at a picnic, a group skiing holiday in Klosters and at a cottage in the New Forest.\n\nPye, Ethel\n\nEthel Pye has been described as a fringe member of the Neo-Pagans (a group of friends known for their Fabianism and enjoyment of the outdoors). A neighbour of the Olivier sisters at Limpsfield, she visited Grantchester and spent time with them, Rupert Brooke and the other Neo-pagans.\n\nRaverat, Gwen (née Darwin)(1885-1957)\n\nGranddaughter of Charles Darwin, the artist Gwen Raverat was born in Cambridge, in 1885. Her father was an astronomer, called Sir George Howard Darwin, and her mother was Maud du Puy, of Philadelphia. In 1908, Gwen Raverat went to Slade School of Art, where she learned painting before teaching herself wood-engraving. It is the latter for which she is best known.\n\nBefore the First World War, she was part of a group of friends known as the ‘Neo-Pagans’ (a group of friends known for their Fabianism and enjoyment of the outdoors), which included Rupert Brooke. She fell in love with Jacques Pierre Raverat and persuaded him to go to Slade with her. She carried out graphic work for the Admiralty during the Second World War. She also created designs for theatres.\n\nShe illustrated Frances Cornford’s book of poems entitled Spring Morning (1915) but most of her work was on individual prints, which were widely exhibited. In 1920, she became a founder member of the Society of Wood Engravers. In later life, she also became known as a writer, primarily of art criticism.\n\nRaverat, Jacques Pierre (1885-1925)\n\nJacques Pierre Raverat was born in Provence, France, but educated at Bedales School, in England, along with other members of what were to be known as the ‘Neo-Pagans’ (a group of friends known for their Fabianism and enjoyment of the outdoors). He studied mathematics at Emmanuel College, Cambridge. His other friends included Geoffrey Keynes. Though he was said to have been attracted to ‘Ka’ Cox, he married Gwen Darwin in 1911. Virginia Woolf was a guest at their wedding. Jacques Raverat enjoyed painting and by 1909 it was taking up most of his time.\n\nLytton Strachey was a biographer and essayist, best known for Eminent Victorians, a collection of satirical biographical essays published in 1918. He was also a member of the Bloomsbury group and his brother James was Rupert Brooke’s friend. Lytton Strachey, who studied history at Trinity College, Cambridge He was also a member of the Apostles, a secret Cambridge debating society. Lytton Strachey, his friend Maynard Keynes and his brother James, were instrumental in getting Rupert Brooke elected as an Apostle.\n\nStrachey, James (1887-1967)\n\nJames Strachey was a friend of Rupert Brooke’s, a psychoanalyst and a translator. He was born on 26 September 1887, the youngest of thirteen children of Sir James Strachey and Jane Maria Strachey. His brothers included Lytton Strachey. James Strachey was taught at home until the age of ten, when he was sent to Hillbrow School. His older cousin, Duncan Grant, was already there. It was at Hillbrow that James Strachey became friends with Rupert Brooke.\n\nAfter Hillbrow, James went to St Paul’s school in London. After this he followed in his brother Lytton’s footsteps and went up to Trinity College, Cambridge. He was also a member of the Apostles, a secret Cambridge debating society. He was reunited with his friend Rupert Brooke, whom he was said to have become attracted to. Brooke tended to keep his friends in the Apostles and his Neo-Pagan (a group of friends known for their Fabianism and enjoyment of the outdoors) friends separate, so James Strachey was never accepted into the Neo-Pagans, though he had met them.\n\nHis friendship with Rupert Brooke suffered in 1912, possibly due to the effect Brooke’s breakup with ‘Ka’ Cox had had upon him. Brooke’s letters to James Strachey took a different, much less friendly tone. After graduating, Strachey became assistant editor of The Spectator.\n\nAfter Rupert Brooke’s death, in 1915, James Strachey became attracted to both Noel Olivier and Alix Sargant-Florence, though it was the latter whom he married. He developed an interest in Freud’s psychoanalysis and joined the Society for Psychical Research in 1912. After a few weeks of analysis, Freud asked him to translate his works into English.\n\nStrachey, Lytton\n\nSee Strachey, Giles Lytton.\n\nThatcher, Lady Margaret (nee Roberts) (1925-2013)\n\nMargaret Hilda Roberts was born on 13 October 1925, in Grantham, Lincolnshire. After studying at Oxford University, she became a research chemist, then a barrister. In 1951, she married Denis Thatcher and they had two children.\n\nMargaret Thatcher became MP for Finchley, North London, in 1959. Between 1964 and 1970 she held various positions in the shadow cabinet. When the Conservatives took power, she became Secretary for Education.\n\nIn 1974, the Conservatives lost the election and Margaret Thatcher challenged Edward Heath for the leadership of the party and won. She led them to victory in the 1979 general election and became Britain’s first female Prime Minister.\n\nShe was a controversial Prime Minister, who is admired by many but also much criticised. Her policies included the privitisation of state-owned industries, trade union reform and the reduction of public spending. She also introduced Poll Tax. Despite winning three terms in office, there was a leadership challenge in 1990, after which she resigned her leadership and John Major became Prime Minister.\n\nIn 1992, she became a peeress in the House of Lords. Three years later, she became a member of the Order of the Garter, the highest form of knighthood.\n\nLady Thatcher died of a stroke on 8 April 2013. A ceremonial funeral was held on 17 April 2013, in accordance with her wishes.\n\nWard, Dudley\n\nDudley Ward was a Neo-Pagan (a group of friends known for their Fabianism and enjoyment of the outdoors) and it has been said that Rupert Brooke was fond of him but that he was shy, which perhaps meant he was on the fringes of that group of friends. He studied Economics at St John’s College, Cambridge. Like his friend Rupert Brooke, Dudley Ward was a Fabian (a socialist society founded in 1884, which has strong links to the Labour party). Brooke and Ward travelled through Hampshire and Dorset together, campaigning for Poor Law reform.\n\nWoolf, Virginia (nee Stephen) (1882-1941)\n\nVirginia Woolf was a novelist, essayist, biographer and critic, well known for her \"modernist\" style of writing. Her most famous books include the novel Mrs. Dalloway and the essay A Room of One’s Own. She was a key member of the Bloomsbury group. She was a little older than Rupert Brooke but they had known each other since they played together as children on holiday at St Ives, in Cornwall. Later, she visited him in Grantchester, where they swam in the river. She was friends with Ka Cox. When Edward Marsh’s Rupert Brooke: A Memoir was published, along with his collected poems, Woolf wrote an anonymous review of the book, which was published in the Times Literary Supplement.\n\nSources\n\nThese biographies have been written using information found in sources such as the books on Rupert Brooke and the Neo-Pagans written by Hassall, Hale and Delany, as well as the biographies in the Dictionary of National Biography, Withers’ A Register of Admissions to King’s College Cambridge 1797-1925, and Alan and Veronica Palmer’s Who’s Who in Bloomsbury. For further details of these sources, please see the Bibliography."}, {"url": "https://www.economist.com/1843/2016/08/16/eton-and-the-making-of-a-modern-elite", "page_content": "One of Simon Henderson’s first decisions after taking over last summer as headmaster of Eton College was to move his office out of the labyrinthine, late-medieval centre of the school and into a corporate bunker that has been appended (“insensitively”, as an architectural historian might say) to a Victorian teaching block. Here, in classless, optimistic tones, Henderson lays out a vision of a formerly Olympian institution becoming a mirror of modern society, diversifying its intake so that anyone “from a poor boy at a primary school in the north of England to one from a great fee-paying prep school in the south” can aspire to be educated there (so long as he’s a he, of course), joyfully sharing expertise, teachers and facilities with the state sector – in short, striving “to be relevant and to contribute”. His aspiration that Eton should become an agent of social change is not one that many of his 70 predecessors in the job over the past six centuries would have shared; and it is somehow no surprise to hear that he has incurred the displeasure of some of the more traditionally minded boys by high-fiving them. What had happened, I wondered as I left the bunker, to the Eton I knew when I was a pupil in the late 1980s – a school so grand it didn’t care what anyone thought of it, a four-letter word for the Left, a source of pride for the Right, and a British brand to rival Marmite and King Arthur?\n\nTo judge from appearances in this historic little town across the Thames from Windsor Castle, which many tourists think is worth a visit between the Round Tower and Legoland, the answer is actually not a lot. Aside from the fact that there are more brown, black and Asian faces around, the boys go about in their undertakers’ uniforms of tailcoats and starched collars, as they seem to have done for centuries, learning in the old schoolrooms and depleting testosterone on the old playing fields before being locked up for the night in houses they share with 50 of their peers (each boy has his own room). As the absence of girls demonstrates, Eton considers itself exempt from the modern belief in the integration of the sexes that so many independent schools now espouse. And it remains a boarding school – a form of education which is in decline, and which some people consider a mild form of child abuse. Add to all this the statue of Henry VI, who founded the school in 1440, amid the uneven cobbles of School Yard, and the masters cycling in their gowns to their mid-morning meeting, resembling nothing so much as a synod of ravens, and you get the opposite impression to that conveyed by Henderson: one of solidity, immobility – anything but dynamism.\n\nTo the question, “which is the ‘real’ Eton?” – the laboratory for progressive ideas about social inclusion, or an annexe to Britain’s heritage industry – the answer is of course “both”.\n\nAll schools are defined by their intake, but none more so than Eton, which for hundreds of years received the pipsqueak sons of the ruling class and disgorged them to become statesmen and administrators. (Nineteen Old Etonians – OES – including David Cameron, have served as prime minister.) This has now changed, and a new admissions policy has brought in poor clever boys, foreign boys and “new money” that the school would not have welcomed in the past. A recent parent described his surprise at finding out that the most common name at the school was Patel.\n\nAt the same time, many elements of the timeless, traditional Eton have been preserved. They’re among the reasons new parents send their sons here, along with the belief that the school will coax and push and cajole the best out of the boy – that Eton is, as the headmaster puts it, “unashamed in its pursuit of excellence”. The school aims to educate the elite, as it always has, but it has reshaped itself in order to accommodate a new elite defined by money, brains and ambition, not pedigree, titles and acres.\n\nA delicate relationship seems likely to exist at Eton in the coming years, between deserving boys of modest background who enter the school on bursaries, often in the face of incredulity or even opposition at home, and the poised, prepared, nutritionally optimised children of the new upper class whose parents are expected to finance all this largesse – not simply by paying their fees, but also by responding to pretty much continuous appeals for money. The latest “exciting and strictly limited opportunity” is the chance to have your name inscribed on a stone around School Yard, costing £10,000 spread over four consecutive tax years.\n\nEton’s rich and poor coalesce and become each other’s raison d’être in the context of the school’s ambition to be “needs-blind” in the manner of Harvard – that is to say, able to offer a boy a place regardless of his parents’ ability to pay. Eton’s big plan was evoked succinctly by William Waldegrave, the provost (head of the governing body), when he told me, “what I hope is that this school will continue to produce the prime minister, the Archbishop of Canterbury, and entrepreneurs of all sorts, but that three-quarters of them will have been here on bursaries.”\n\nWaldegrave and Henderson may be the latest advocates of Eton’s transformation, but the process began a generation ago. Over the past quarter-century many places have opened up to poorer families, with some 270 of the pupil body of 1,300 now receiving substantial or complete fees remission and the school recently taking out a £45m loan to raise this number further. The school can also draw on a very large endowment by British standards. As of August 2014 it had investment and property portfolios worth £300m and an annual income from school fees of around £45m, not to mention all the immovable assets and art collections. For all that, many more millions need to be wrung from parents and OES if the school is to become genuinely needs-blind.\n\nAs the school mediates between the aspiring rich and the deserving poor, a third group fights for survival: old “Eton” families who have been sending boys to the school for generations. This group dominated the Eton I attended in the 1980s, when the school was still a barely-selective rite of passage for the descendants of Britain’s Edwardian upper and upper-middle classes – complacent, snobby and full of surnames recognisable from the inter-war diaries of Harold Nicolson. This tribe’s representation is shrinking. The percentage of pupils at the school with an OE father went down from 60% in 1960 to 33% in 1994 to 20% now. Eton has gone from being an heirloom handed down through the generations to a revolving door.\n\nRainbow education Pupils cheer during the Eton wall game, a sport unique to the college\n\nNo elite connives in its own dethroning, however, and Eton is a living illustration of the oft-forgotten truth that social mobility cuts both ways. Having striven to get their son into a school whose fabric reeks of continuity, it would not be a surprise if the new Eton families showed tenacity in trying to hang on to their new status by forming dynasties of their own. This new elite, floating on its liquid wealth, is probably better placed to preserve itself than the old, landed one. As often as not Mum is as high powered as Dad, and the progeny are primed not to rest on inherited laurels but to go out and achieve material success.\n\nHere, in the emergence of a new upper class – more fluid, more international, and yet revelling in its association with the old, snobbish, British continuities – lies the tension at the heart of Eton’s ambition to become a meritocracy. To borrow from the Patek Philippe advert, “You never actually own a place at Eton. You merely look after it for the next generation”.\n\nI performed badly in my entrance test to Eton and squeaked in only after my mother pleaded with the admissions tutor that her father had been at the school: in those days, Eton took care of its own. The establishment I entered in the spring of 1985 looked to me like the embodiment of continuity, but across the country, the mood was turning hostile. The immediate post-war period had witnessed three Etonian prime ministers in succession (one of whom, Harold Macmillan, named no fewer than 35 OES to serve in his government), but the squall of egalitarianism in the late 1960s, aggravated in the 1980s by Margaret Thatcher’s ethos of self-help and aspiration, loosened the school’s grip on power. In 1990, when Thatcher lost the Tory-party leadership, Douglas Hurd, who stood to succeed her, found his Eton background being used against him. “I thought I was running for leadership of the Conservative Party,” he complained, “not some demented Marxist sect.” Hurd lost the election – and the keys to 10 Downing Street – to John Major, a state-educated former insurance clerk.\n\nTony Blair’s New Labour administration of the late 1990s and early 2000s married Thatcher’s brassy meritocracy with a social conscience. Oxford, Cambridge and the other major universities came under pressure to admit more state-educated pupils, and private schools were told to share their facilities with publicly funded neighbours or forfeit the tax breaks to which they, as charities, were entitled. In 1999, in a clear sign that the school could no longer count on its old links to parliament, almost 700 hereditary peers (many if not most of them OES ) were expelled from the House of Lords.\n\nIn any case by now Eton had read the runes. There was a feeling among masters and governors that the school needed to raise standards in order to maintain market share in the new, more meritocratic Britain – to keep feeding boys to Oxford and Cambridge; to keep producing prime ministers – and a more competitive admissions system was the key. But the school had an image problem. It was widely considered a closed shop that would favour the dim and idle viscount over the up-and-coming City trader’s brilliant, motivated son, with the result that the City trader didn’t apply. The school’s policy of allowing parents to register their sons at birth for the so-called “Eton List” exemplified the school’s built-in prejudice in favour of its own. The Eton List effectively allowed an OE to sew up a place for his son while the boy was in nappies.\n\nIn 1990 the Eton List was abolished and a decade later a uniform entrance test and interview were introduced for all would-be entrants at the age of 11, under which the children of OES enjoyed no head start over the sons of people who had not been privately educated, or, for that matter, the offspring of successful Pakistani immigrants or Malaysian electronic-chip manufacturers. In time the tests got harder, the yearly intake cleverer, and the dim, idle viscounts were turned away. (Clever, industrious viscounts continued to get in.) Aided by its proximity to London, whose attractiveness as a safe deposit box for the super-wealthy was on the rise, the school became heavily oversubscribed. (In the 1950s the school had empty places.) Each year, around five and a half boys compete for each of the 260 places on offer.\n\nAlthough Eton’s internal reforms were well under way by the time Tony Little, Henderson’s predecessor, took over in 2002, this former scholar (an Etonian in the 1960s, he was the first member of his family to be educated over the age of 14) introduced them to a sceptical world. He was “more foreign secretary than home secretary”, as one master recalls, giving interviews and making friends with educational reformers in the Blair government; his railing against the “deadly cloud of class awareness” rates as one of the more unexpected interventions from an Eton headmaster.\n\nUnder Little, Eton sponsored a state boarding school up the road in Ascot and a sixth-form college in the London borough of Newham. Bursary schemes were also set up by wealthy OES . At first, bringing in boys from some of the poorest parts of Britain and overseas turned out to be surprisingly difficult; heads weren’t keen on losing their brightest boys, and parents needed some convincing that Eton wasn’t another planet. A documentary about three Eton scholarship boys that was shown on the BBC ’s children’s channel in 2014 led to a spike in applications, the school’s access officer told me, “not because parents saw it, but because their sons did, and thought, ‘I’d like to do that.’” Of two former bursary boys in their 20s I recently spoke to, one has gone on to become a speech-writer for a Conservative MP and aims to go into parliament; another is a rising actor.\n\nChanges to the admissions policy have seen the school’s non-Anglo-Saxon intake rise considerably, though for all the foreign names one sees on pigeon holes in each house, Eton remains a “British” school, and its policy of diversifying its intake seems aimed at preventing it from being captured by any particular sub-group of the global elite. Traditionalists have chafed at the more international atmosphere, however, and Little described how one “finger-jabbing” OE accused him of being a “socialist who won’t rest until you have built a mosque on the school playing fields”.\n\nVisiting Eton this spring, I spent an hour in College Library, watching the school’s Arabic master show three 16-year-old Palestinians some medieval manuscripts that the school had recently purchased, among them a page from a ninth-century Kufic Koran. Born in refugee camps in Lebanon, these boys had been flown to Britain for interview. Come September, two of them will be in tails.\n\nLittle’s memorial at Eton is a shiny research complex, the donor-funded Tony Little Centre for Innovation and Research in Learning, which joined forces with Harvard to advance research into the adolescent brain – all synaptic pruning and neural pathways. The centre’s mission statement is a slightly laboured attempt to establish Britain’s poshest school as a public good: “we want Eton and the wider UK to be at the forefront of new developments in teaching and learning, for the benefit of all.”\n\nThe new Eton – friendly to the international plutocracy while also containing strong elements of political correctness – naturally went down badly with the established Eton families whose names adorn the war-memorial plaques and the sporting cups, and whose sons have been rejected in big numbers. In 2009, at a reunion I attended, Waldegrave delivered a speech lauding diversity of intake and beating the drum for an appeal. “They want our money,” my neighbour growled, “but not our sons.” In the main, however, the old guard seems resigned to its demotion, in part because, however exercised they are by the newcomers, many OES would be unable to afford the school even if their sons were admitted.\n\nMy father paid around £6,000 per year (around £14,500 today) for me to go to Eton in the late 1980s. The annual fees are now £34,000 ($50,000, or about £7,000 more than the average annual wage in Britain). The merely well off – the country solicitors and provincial landowners who once formed the school’s backbone – have been priced out. In the words of one OE , “many people in my circle have decided that it’s not worth it, and that a good state school will do just as well.”\n\nTo say that there is a cultural divide between the old Eton and the new one would be an understatement. Traditional parents wince as they describe corporate-hospitality tents and sushi bars being erected by brash parvenus for the Fourth of June, the school’s annual shindig (which is not, of course, held on June 4th). Back in the 1980s it was hard-boiled eggs and wine out of a box, consumed while rocking on one’s haunches on a picnic blanket.\n\nFor all the talk of 270 bursary boys and rising, furthermore, the vaunted egalitarianism of the new Eton is not always obvious. “We tried to identify the bursary boys who are with my son,” remarked a pupil’s mother, “but his year group includes two oligarchs’ sons and a family with four children all at different English boarding schools. Our suspicions fell on the parents of an Indian boy but then we bumped into them while skiing in Val d’Isère.”\n\nSome newcomers feel that change hasn’t gone far enough. As an American mother said, “you still get some students who would have been there 100 years ago, and they’re not always the cleverest. But”, she went on with evident relief, “they don’t dominate.” Her only regret is that Little didn’t bring in girls. Henderson is rumoured to want to abolish tails, though that would face opposition from the boys, who are attached, in quite a sweet way, to Etonian traditions.\n\nMaster plan Simon Henderson, the current headmaster\n\nInevitably, the cultural divisions felt by parents are less important to the pupils, in part because the uniform has the advantage of flattening socio-economic disparities. One former bursary boy told me, “Only after I left the school, and visited my friends in the amazing flats they had been given by their parents, did I realise just how rich they were.”\n\nWith every place at Eton so keenly contested, enterprising parents sometimes try the back door. The recently retired head of admissions, Charles Milne, was visited by a famous Russian oligarch whose son had been placed on a waiting list after failing to win a place in the entrance test. “They crowded into my little office,” Milne explained, “the Russian and his two bodyguards – one of them eight foot tall. I began explaining how the system works, that other boys would have to give up their places for his son to get in.” Milne had not got far before the oligarch raised a hand to silence him. “Mr Milne,” he said, “I won’t waste your time. When you have decided what needs to be done for my son to get his place, you will tell me.” The boy ended up at another school. Another very rich foreigner, whose son had been rejected, phoned Milne to tell him he was a “fucking bastard”. It became an in-joke between Milne and Little. “When I went to see the headmaster, he would greet me, ‘hello, fucking bastard’.”\n\nGiven the intense competition to get a place, it’s no wonder that the waiting room before the test (much harder than the one I took) is like the Russian roulette scene in “The Deer Hunter”. Children sit ashen-faced while their parents confer in whispers. No one speaks to anyone else; the tension is palpable. Some boys burst into tears when they get into the interview room.\n\nThe contest isn’t simply between candidates. It’s a battle of wits between a school whose proclaimed intention is to identify deserving talent and ambition, and parents who will do everything to stack things in their child’s favour. Well-off, well-organised parents prepare their sons ruthlessly, hiring tutors, making the boys do ceaseless verbal and non-verbal reasoning tests and sending them to interview classes to learn how to be sparky and empathetic. The school is wise to these constantly evolving efforts to game the system, however, and a lot of boys who have done brilliantly in the computerised test are turned down because they aren’t “interesting” at inter­view. “If a boy makes me laugh,” says one of the school’s interviewers, “he stands a good chance of getting in.”\n\nThe battle to enter Eton is the first exchange in a relationship between parents, boys and school that is characterised by high expectations. The rich parents want their kids to flourish and go on to an excellent university, preferably Oxford or Cambridge. The school wants these parents to show their appreciation in five figures. The bursary boys need to validate the decision to give them bursaries. Meanwhile the OES bite their fingernails and hope that the 20% figure won’t go down or the fees rise even further.\n\nThe story of Eton’s reconquest of the commanding heights of Britain is one of gradual rehabilitation. With the weakening of the hard left, the prospect of private schools being abolished receded, while Eton’s efforts to present itself less as a throwback to an earlier age than a guarantor of achievement in the current one began to pay dividends. Though confessing to an Eton education remains a conversation-stopper in liberal-left north London, in general the school has become less of a lightning rod for class resentment. And over the past decade OES have become more pervasive than ever.\n\nBack in the 1950s it was the fact of having been to Eton, more than the education you received there, which set you up for success. Now the inverse is true. The teaching is superb, the facilities unparalleled, the results impressive. This year 85 Etonians were offered places at Oxford or Cambridge. St Paul’s, Westminster and Winchester have higher Oxbridge admission rates, but then those schools always specialised in cultivating clever boys. What’s interesting about Eton is the way it changed its focus from class to brains. The school has seen off the threats to its continued relevance by taking in clever boys, and sending out cleverer young men into a world that no longer defers to inherited privilege, and prizes cleverness and ambition above all.\n\nThis shift in strategy has changed the culture of the school. The ordeal of the entrance test; the upwardly mobile parents; the fact that the boys know they got into the school on their own merits, not because their fathers are OES – all this militates against the studied unconcern, the famous “entitlement”, that was the default pose of Etonians in the 1980s. Just as it was intensely uncool to be industrious then, now the opposite is the case. “It’s the boy who doesn’t take advantage of all the opportunities at Eton who’s considered odd,” a current Etonian told me, “not those who do.”\n\nA strong work ethic comes naturally in a school that opts in to the hardest public exams and fosters competitive relationships between pupils. One recent Etonian noticed this cultural peculiarity while observing a debate at St Paul’s, Concord, a posh American boarding school. (Eton’s debating teams often sweep the board at inter-school competitions.) “The Americans were elaborately polite to each other,” he recalled, “whereas at Eton we could be brutal, saying, ‘that’s an incredibly stupid thing to say’.”\n\nNot a sushi bar in sight The Fourth of June in the 1980s\n\nMore than schools with higher Oxbridge acceptance rates, Eton stresses activities outside the classroom. Drama, one of its particular strengths, is an opportunity for collective endeavour that also contributes to the legendary Etonian self-assurance. The production budget at the 400-seat Farrer Theatre is higher than that at one of Britain’s top drama schools. No wonder scouts and agents are often to be spotted there, looking for the next Eddie Redmayne – one of Eton’s many recent showbiz alumni.\n\nThe investment in a wide range of extra-curricular interests may help explain why, when it comes to success defined more broadly than through exam results, Eton comes top. According to the Sutton Trust, a charity which works to widen opportunity, the school educates just 0.04% of Britain’s secondary school population, but some 4% of nearly 8,000 “leading people” whose education the trust tracked were OES . Eton produces more than three times as many big cheeses as its nearest rival, Winchester (Henderson’s alma mater). Taking into account Eton’s larger student body, its high-achiever output rate is 50% higher.\n\nAnd that figure underplays Eton’s success, for OES cluster at the very pinnacle of British life. The closer you get to power and achievement, in other words, the more likely you are to run into one. David Cameron and his rival for the soul of the Conservative Party, Boris Johnson, the former mayor of London, both attended the school. So did Prince William and Prince Harry, the Archbishop of Canterbury Justin Welby, the actors Tom Hiddleston and Damian Lewis as well as Redmayne, the adventurers Bear Grylls and Ranulph Fiennes and the Nobel prize-winning biologist Sir John Gurdon. The law, business and banking fester with Old Etonians.\n\nIt’s very likely that Eton has a higher “strike rate” than it did in the 1980s, when for every top banker or ambassador there were one or two who conspicuously failed to enter well-paid careers (or indeed careers of any sort), and ended up cultivating marijuana or running a small country estate into the ground. No father of an Etonian in the 1980s would have admitted to thinking about anything so crass as a “return” on his investment, nor were we boys party to our parents’ financial affairs. This too has changed. A recent bursary boy who attended the school with a third of his fees remitted told me that his parents, both teachers at state schools, had sold the family home in order to afford the other two-thirds.\n\nBritain no longer has a ruling class, and the boys who enter Eton are anyway too varied to constitute one. Yet by the time they leave they belong to something like an emerging global elite. They have in common brains, determination and, in many cases, an aspirational family that sets great store by worldly success. These qualities got them to Eton, and they are deployed again and again to ensure they get the most out of the experience. Whether it’s arranging holiday internships with City law firms, Skype tutorials in the run-up to a geography exam, or a reels refresher course before the Caledonian Ball, parents are constantly (and expensively) bolting on all kinds of optional, mini-advantages to the considerable advantage of an Eton education. The great project of modern elite parenting is all about leaving nothing to chance.\n\nThere is, of course, a natural tension between the school’s role in this enterprise and its ambition to be an engine of social mobility – just as there is at the American Ivy League universities that Eton’s admissions system seeks to emulate. A small number of Etonians are poor; some are only modestly well-off; but the majority of them are seriously wealthy by the standards of most of the world. One of the consequences of Eton’s transformation is thus to ensure that the children of the very rich stay that way.\n\nFor all its inbuilt advantages, the task facing Eton at the turn of the millennium was a tricky one. It needed to entrench its position at the top of British life while carrying out controversial and difficult reforms. Few would argue that the changes have been anything but necessary and skilfully accomplished, but they have come at an intangible price. A recently retired master complained that teaching has got more boring because boys constantly harp on the need to stick to the syllabus: “are we going to need this for the exam, sir?”\n\nEton used to have a strong sideline in rebels and oddballs. My time there was enriched by exposure to some truly unusual characters, both masters and boys, which engendered a tolerance of human foibles and acted as vital redress from a hierarchical, rules-based institution. Inevitably, as the school has grown more concerned with outcomes and assessments and ever keener to maximise the use to which its facilities are put, the eccentrics have been purged from the institution.\n\nThe value of such people is hard to quantify; their achievement doesn’t show through in the exam results, but in the diffusion of a spirit of irreverence and scepticism. One boy in my house, William Sinclair, was a brilliant subversive and satirist of the school; his lampooning of the authorities and disrespect for conventional hierarchies among the boys punctured the pretension and self-regard to which Eton is easily prone. William’s planting of a live chicken in our housemaster’s bathtub was the least of his misdemeanours.\n\nMy tutor over my final years was Michael Kidson, a lop-shouldered historian who terrorised us in thrilling, beautiful, confident English, threw blackboard rubbers at boys who offended against syntax and grammar – I got one in the head for pluralising “protagonist” – and defended his oversexed spaniel for trying to solace itself against our thighs. (“Nothing wrong with a young man wanting a wank!”) Above all, Kidson was loyal and would fight fiercely for you if you got into trouble; several boys escaped expulsion thanks to his efforts. On all sorts of levels it is hard to imagine either Sinclair or Kidson being welcomed to today’s Eton, but back then they were among the school’s best-loved figures and knowing them seems as useful to me now as any City internship would have been.\n\nEton isn’t alone among reformed institutions to have got duller as it has got better, and few of the current boys’ families will rue the absence of eccentrics if their son gets his Oxbridge place. The school has gone from being a rite of passage for a now-defunct upper class to a coalition of different sorts of people who have signed up to an ambitious agenda that may not, in fact, be their own. If Eton hasn’t quite become the liberal, socially transformative institution the reformists seek, it is undeniably more discerning in allocating one of the best starts in life that money (or brains, or ambition) can get you.■\n\nPHOTOGRAPH JAMES MCNAUGHT"}, {"url": "https://www.britannica.com/topic/Eton-College", "page_content": "Eton College, boarding school near Windsor, Berkshire, one of England’s largest independent secondary schools and one of the highest in prestige. It was founded by Henry VI in 1440–41 for 70 highly qualified boys who received scholarships from a fund endowed by the king. Simultaneously, Henry founded King’s College, Cambridge, to which scholars from Eton were to proceed. That connection is no longer in place.\n\nToday, as throughout the school’s history, Eton names about 14 King’s Scholars, or Collegers, each year, for a schoolwide total of 70. The selection is based on the results of a competitive examination open to boys between 12 and 14 years of age. King’s Scholars are awarded scholarships ranging from 10 to 100 percent of fees and are boarded in special quarters in the college.\n\nThe other students, called Oppidans, now number more than 1,200 and are housed in boardinghouses under the care of house masters. The Oppidans have traditionally come from England’s wealthiest and most prestigious families, many of them aristocratic. Boys enter Eton about age 13 and continue there until they are ready to enter university."}, {"url": "https://www.historyextra.com/period/victorian/eton-college-history-facts-fees-prime-ministers-school/", "page_content": "When I wrote my history of Britain’s public schools five years ago I remarked in the penultimate paragraph that David Cameron was the 19th prime minister educated at Eton College, and would not be the last. It did not take long for my prediction to come true: Alexander Boris de Pfeffel Johnson is the 20th. No other school comes close to this, though Harrow can boast seven.\n\nHere, journalist and historian David Turner investigates the history of Eton and asks why its scholars – from Robert Walpole and William Pitt to David Cameron and Boris Johnson – have gone on to dominate British politics…\n\nEton College has also contributed disproportionately large numbers of MPs and cabinet ministers, even by comparison with other public schools. Founded in 1440 by King Henry VI as “Kynge's College of Our Ladye of Eton besyde Windesore”, the peak of Old Etonian power came probably in 1866, when they accounted for nine of the Earl of Derby’s 16-strong cabinet, including Derby himself.\n\nThere are clear historical reasons why Old Etonians have been so pre-eminent in politics:\n\nThe entrance of Eton College. Eton has contributed disproportionately large numbers of MPs and cabinet ministers, even by comparison with other public schools. (Photo by: Dukas/Universal Images Group via Getty Images)\n\nRoyal connection\n\nEton was not the first of what would become known as the public schools – schools where, for the first time, children of the British elite were educated together in large numbers, rather than at home or in small monastery schools. Winchester College was founded 58 years before, in 1382. But while Winchester was established by a bishop, Eton’s creator was the king of England, Henry VI, who set it up in a hamlet of the same name not far from the Thames to provide free education to 70 underprivileged boys who would then go on to King's College, Cambridge, which he founded in 1441. Henry took a close interest in the school, as did a number of future monarchs – perhaps because it was not much more than a stone’s throw away from the royal residence of Windsor Castle.\n\nThis royal connection gave Eton College a lustrous patina from the start, which explains why the gentry and nobility that supplied most prime ministers up until the 20th century came to embrace Eton. An early example is the erudite 3rd Earl of Bute, prime minister 1762–63.\n\nAccording to Eton, the earliest records of its school life date from the 16th century and “paint a picture of a regimented and Spartan life”. Students were awakened at 5am each day and chanted prayers while they dressed, and by 6am they could be found studying in the Lower School. All teaching was in Latin and there was just a single hour of play, with lessons finishing at 8pm. There were only two school holidays – one at Christmas, when the students remained at Eton, and the summer break, both of which lasted for three weeks. For this reason, Eton’s three terms that make up one school year are still known, confusingly, as “halves”. In the rest of the world three halves make one-and-a-half, but not at Eton.\n\nThe statue of Eton's founder, Henry VI, watches over the college yard. (Photo by John Phillips/Life Magazine/The LIFE Picture Collection via Getty Images/Getty Images)\n\nAmbition\n\nThe grand aristocratic clans that patronised Eton drew in families that were less exalted but highly ambitious. In the early 19th century an energetic Scot from an unremarkable middle-class family worked his way up to become an immensely rich merchant. Determined that at least one of his sons should succeed in politics, he decided that the best route to this was Eton followed by Christ Church, Oxford. The elder son was a relative disappointment: he never made it beyond the Tory backbenches. The other was William Ewart Gladstone, four times prime minister.\n\nMore like this\n\nBoris Johnson himself comes from a solid middle-class rather than upper-class background. He was born in New York City to British parents – his mother, Charlotte Johnson Wahl, was aged 22 at the time and had given up her English degree at the University of Oxford to accompany her husband, Stanley Johnson, to the US, where he was an economics student at Columbia University. He later worked at the World Bank in Washington DC while his wife became a respected painter.\n\nPolitical training\n\nWilliam Gladstone’s father doubtless saw the advantages for his sons of mixing in the exalted company of aristocratic schoolboys. However, he also understood the political education that Eton could provide. Gladstone honed his debating skills in ‘Pop’, a College society whose future members include Boris Johnson, though by Johnson’s time Pop had become less of a debating chamber and more of a club for prefects: the little leaders of men of the public schools, who often go on to senior positions in public life.\n\nMembers of Pop at Eton College are allowed to wear a waistcoat of their own design which differ from the black waistcoats of other boys. (Photo by ullstein bild/ullstein bild via Getty Images)\n\nMembers of Pop are allowed to wear a waistcoat of their own design (often highly gaudy), which differs from the black waistcoats of other boys, and checked spongebag trousers (rather than black pinstripes), though they sport the same black tailcoat as other pupils. John Boughey, president of Pop in 1938 two years before his death in the Second World War, said that for every holder of the office, the post “teaches him in the microcosm what should be the behaviour of the public servant”.\n\nWhile at the school, Gladstone joined a political faction known as the Canningites, named after their leader George Canning, later a Tory foreign secretary and briefly prime minister. Canning, who had himself attended Eton a generation earlier, is if anything an even greater advert than Gladstone for the political advancement the college can provide. It is certainly difficult to see the boy, son of a failed wine merchant and actress, rising so far, had he not gone to the school courtesy of his uncle’s generosity. A great orator, Canning excelled at public speaking while at the school, as did Johnson, whose mastery of rhetoric is probably what landed him Britain’s top job.\n\nInclusiveness\n\nThis may look like a typo, since Eton is clearly not inclusive when compared with a state comprehensive, but it has often been more inclusive than other public schools. For example, at a public meeting organised in 1840 to set up Cheltenham College [a public school in Cheltenham, England], it was resolved that no one could become a shareholder of the new school, giving them a right to nominate pupils, “who should not be moving in the circle of gentlemen. No retail traders being under any circumstances to be considered.”\n\nBy contrast, Eton has tended historically to accept most children if their families had the money or the talent. William Sherlock, who after leaving Eton in 1657 eventually became chaplain to James II and then William III, making him a powerful figure at the court (though not strictly speaking a politician), was the son of a tradesman living in the evocatively named Gravel Lane, Southwark. Sherlock was probably one of the 70 King’s Scholars, educated for most of the College’s history for free, as provided for in Henry VI’s endowment. Fellow Scholars include both our very latest prime minister (who by the time he attended Eton had to pay fees) and the very first one, Robert Walpole.\n\nThese days the College means-tests its approximately 1,300 students so that those from wealthy families pay full fees, currently £14,167 a term, and even Scholars pay 90 per cent if their families are wealthy (some past Scholars have hailed from great riches, such as the academic and precocious Harold Macmillian, Eton prime minister number 17). However, in 2014 Eton announced that 274 boys were on bursaries, where fees are reduced or waived altogether because parents cannot afford to pay them, with 70 boys (among both Scholars and non-Scholars, known as Oppidans) to receive an education for free in the coming year. This enables the College to cast its net still wider in the search for talent.\n\nReform\n\nFor most of its history Eton demanded scholarliness of its Scholars, but not of anyone else. In the early years of the new A-Level examinations, introduced in the 1950s, results were above the national average, but not conspicuously so. This began to change in the 1960s, with notable improvement under Johnson’s head master, Michael McCrum, who markedly improved exam results by improving educational standards and introducing stricter entrance requirements. A much lower proportion of boys accepted were the sons of Old Etonians – in other words, accepted through family line rather than ability – and the pass mark in Common Entrance, the standard public school exam, was raised.\n\nBy making the school more selective, this drew in intelligent boys who might previously have gone to historically more academic rivals such as Westminster, some of whom went on to become politicians in an era when prospective Tory MPs were supposed to be clever rather than merely posh.\n\nThe new millennium saw the introduction of what Eton itself describes as “a more meritocratic entry system, with boys no longer being entered on house lists at birth – from 2002, all boys had to win their places through the current procedure of an interview, reasoning test and reference from their previous school.”\n\nEton College schoolboys wearing the traditional dress of the school, c1978. (Photo by Evening Standard/Getty Images)\n\nHistory\n\nThe college’s success in schooling so many senior politicians over the centuries has created an air of expectation among both pupils and the school’s leaders. Baron Caccia, provost (chair of the governors) during Johnson’s time, used to give a power pep talk to new Scholars, according to someone who had been on the receiving end (quoted in Sonia Purnell’s 2011 biography, Just Boris): “He told us we were the future leaders, that we had a responsibility and a destiny that was not to be taken lightly.” The effect? “You found yourself thinking of someone like Pitt the Elder [Old Etonian premier number four] and asking yourself, am I really potentially that great?”\n\nAs Tony Little, the current head master’s predecessor, put it with customary understatement: “If you know that some interesting people have gone on to do some interesting things, whether it’s George Orwell or the Duke of Wellington [Etonian premier number eight], that does implicitly ask the question, why not you?”\n\nFor these six reasons, I have no trouble in renewing my prediction: just as I forecast that Cameron would not be Eton’s final prime minister, I can say with assurance that Johnson will not be, either.\n\nAdvertisement\n\nDavid Turner is a journalist and historian, and author of The Old Boys: The Decline and Rise of the Public School, published by Yale University Press (2015)."}]}