{"John Russell Reynolds was called to the bar in 1845, and became a Queen's Counsel in 1859.": [{"url": "https://www.britannica.com/event/Great-Famine-Irish-history/Great-Famine-relief-efforts", "page_content": "Great Famine relief efforts\n\nThe British government’s efforts to relieve the famine were inadequate. Although Conservative Prime Minister Sir Robert Peel continued to allow the export of grain from Ireland to Great Britain, he did what he could to provide relief in 1845 and early 1846. He authorized the import of corn (maize) from the United States, which helped avert some starvation. The Liberal (Whig) cabinet of Lord John Russell, which assumed power in June 1846, maintained Peel’s policy regarding grain exports from Ireland but otherwise took a laissez-faire approach to the plight of the Irish and shifted the emphasis of relief efforts to a reliance on Irish resources.\n\nMuch of the financial burden of providing for the starving Irish peasantry was thrown upon the Irish landowners themselves (through local poor relief) and British absentee landowners. Because the peasantry was unable to pay its rents, however, the landlords soon ran out of funds with which to support them, and the result was that hundreds of thousands of Irish tenant farmers and labourers were evicted during the years of the crisis. Under the terms of the harsh 1834 British Poor Law, enacted in 1838 in Ireland, the “able-bodied” indigent were sent to workhouses rather than being given famine relief per se. British assistance was limited to loans, helping to fund soup kitchens, and providing employment on road building and other public works. The Irish disliked the imported cornmeal, and reliance on it led to nutritional deficiencies. Despite those shortcomings, by August 1847 as many as three million people were receiving rations at soup kitchens. All in all, the British government spent about £8 million on relief, and some private relief funds were raised as well. The impoverished Irish peasantry, lacking the money to purchase the foods their farms produced, continued throughout the famine to export grain, meat, and other high-quality foods to Britain. The government’s grudging and ineffective measures to relieve the famine’s distress intensified the resentment of British rule among the Irish people. Similarly damaging was the attitude among many British intellectuals that the crisis was a predictable and not-unwelcome corrective to high birth rates in the preceding decades and perceived flaws, in their opinion, in the Irish national character.\n\nThe famine coincided with a period of renewed expressions of nationalism in Ireland in the mid-19th century. The nationalist Young Ireland movement coalesced around a newspaper, The Nation, which began publication in 1842 and provided the growing movement for the repeal of the Act of Union with a vital cultural and political outlet. The Young Ireland movement was both energized and divided by the famine of the 1840s. Two writers in particular immersed themselves in the period’s debate about Ireland’s future and Britain’s policies during the famine: John Mitchel and James Fintan Lalor. The most accomplished poet to publish in The Nation was James Clarence Mangan, who engaged with the famine in a melodramatic, intense, and often morbid style."}, {"url": "https://link.springer.com/article/10.1007/s00381-014-2485-5", "page_content": "He described several methods to examine muscular strength, coordination, sensory perception, tone, tremor, reflexes, and actions of individual muscles in his textbook. Gowers included some methods to evaluate the functions of cranial nerves. In 1879, Gowers first described the pattern of standing in 21 boys with pseudohypertrophic muscular paralysis in a clinical lecture to the students of University College [9].\n\nThe sign was originally described by Gowers in the context of Duchenne muscular dystrophy. Gowers was not the first to describe the sign; Sir Charles Bell had reported it almost 50 years before Gowers’ account [7]. There are three Gowers’ signs: pain along the compressed sciatic nerve on passive dorsiflexion of the foot; the irregular contraction of the pupil in early tabes (cf. Argyll Robertson); and the climbing up the legs signs in Duchenne dystrophy [10].\n\nAlthough Gowers inveighed about of the use of eponyms, best known eponyms that bears his name are Gowers’ phenomenon, Gowers’ distal myopathy, Gowers’ solution in the treatment of migraine, Gowers’ anterior spinocerebellar tract, and Gowers’ sign [10]. He also made contributions to other branches of neurology including neuromuscular diseases, neuro-ophthalmology, and spinal cord diseases [5]. He is probably best remembered for his most monumental contribution to the neurology. His “Manual of Diseases of the Nervous System” initially appeared in 1886–1888, followed by a second edition in 1892–1893, and a partial third edition in 1899 [3]."}, {"url": "https://www.britannica.com/biography/John-Russell-1st-Earl-Russell", "page_content": "John Russell, 1st Earl Russell, also called (until 1861) Lord John Russell, (born Aug. 18, 1792, London, Eng.—died May 28, 1878, Pembroke Lodge, Richmond Park, Surrey), prime minister of Great Britain (1846–52, 1865–66), an aristocratic liberal and leader of the fight for passage of the Reform Bill of 1832.\n\nRussell was the third son of John Russell, 6th Duke of Bedford. (As the younger son of a peer, he was known for most of his life as Lord John Russell; he himself was created earl in 1861.) He thus came of a family that had long demonstrated its public spirit. The depth of his liberalism probably owed much to an untypical education. Poor health forbade the rigours of an English public school, and later, his father, who was critical of the Universities of Oxford and Cambridge, sent him to the University of Edinburgh, where he drank deeply of Scottish philosophy.\n\nIn 1813 he became a member of Parliament and four years later made his first important speech—characteristically, an attack on the government’s suspension of the Habeas Corpus Act. In December 1819 Russell took up the cause of parliamentary reform, making it in the early 1820s not only his own cause but also that of the Whig Party. When the Whigs came to power in 1830, he joined the small ministerial committee that was to draft a reform bill, and on March 31, 1831, he presented it to the House of Commons. Overnight, he had won a national reputation.\n\nIn the 1830s and ’40s, Russell remained the chief promoter of liberal reform in the Whig Party—although never again, perhaps, was this role so glorious as in the protracted but successful conflict over the passing of the first Reform Bill. As paymaster general under Charles Grey, 2nd Earl Grey, during roughly the first half of the 1830s, Russell championed the cause of religious freedom for both English Dissenters and Irish Roman Catholics. Indeed, he pursued these aims so zealously that, in seeking to divert some of the wealth of the established Church of Ireland (which was Protestant) to the Roman Catholics (who formed the bulk of the population), he frightened such leading Whigs as Lord Stanley (later Earl of Derby) out of the party. In the second half of the 1830s, as home secretary under Lord Melbourne, Russell, among other things, democratized the government of large towns (with the exception of London). He also reduced the number of criminal offenses liable to capital punishment and began the system of state inspection and support of public education.\n\nEven out of office from 1841 to 1846, when he stood in opposition to Sir Robert Peel, Russell left his mark. In 1845, in advance of his party, he came out in favour of total free trade, a crucial step in forcing Peel to follow him. As a result Peel split his party, the Whigs came to power, and Russell became prime minister.\n\nThis administration (1846–52) demonstrated that, although Russell’s penchant for advanced ideas was as strong as ever, his ability to implement them was now seriously reduced. He was able to establish the 10-hour day in factory labour (1847) and to found a national board of public health (1848). But, largely because of party disunity and weak leadership, he was unable to end the civil disabilities of the Jews, extend the franchise to the workers in the cities, or guarantee security of tenure to the Irish farmers.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nIn the remaining years of his public career, Russell’s difficulties increased. Party disunity continued and brought down his second administration (1865–66) when he made his last attempt to extend the franchise. But more significant, in the 1850s the national temper had changed. An age of reform had given way to a mood of self-complacency, even of belligerence. This was already evident in the Ecclesiastical Titles Act of 1851, which Russell’s government had passed and which in effect was England’s defiance of the papacy.\n\nThis mood deepened, transformed, on the one hand, into an appetite for foreign conquest and, on the other, into boredom with social and political reform. In such an atmosphere Russell was inevitably overshadowed by the forceful and popular Lord Palmerston, who seized the forefront of the national stage in the Crimean War (1854–56). Indeed, for four years, from 1855 to 1859, Russell retired from public life and devoted more and more of his time to literature. Private life had always beckoned to him, as had the life of a litterateur. Among the English prime ministers, few wrote so copiously—biography, history, poetry—as Russell. He accepted an earldom in 1861, and he died at Pembroke Lodge, Richmond Park, in 1878."}, {"url": "https://www.britannica.com/biography/George-Jessel", "page_content": "Sir George Jessel, (born Feb. 13, 1824, London, Eng.—died March 21, 1883, London), jurist considered one of the greatest English trial judges in equity. It is said that Jessel, as solicitor general (1871–73), was the first professing Jew to hold important governmental office in England. (Benjamin Disraeli, who had become prime minister in 1868, was born into Judaism but was baptized a Christian at the age of 12.)\n\nThe son of a London merchant, Jessel attended University College, London, and studied law at Lincoln’s Inn. Called to the bar in 1847, Jessel was appointed a queen’s counsel in 1865 and was elected to the House of Commons as a Liberal in 1868. From 1873 he was master of the rolls, originally sitting both as a judge of first instance in the Rolls Court and as a member of the Court of Appeal. Later, however, after statutes of 1875 and 1876 had made the master of the rolls the president of the Court of Appeal, he was exclusively an appellate judge.\n\nJessel’s rapid and efficient work as a trial judge in equity contrasted sharply with the traditionally dilatory nature of English chancery proceedings (bitterly satirized by Charles Dickens in his novel Bleak House, 1852–53). The clarity of his judgments made them exceptionally useful as precedents; they were seldom appealed and very rarely reversed. He helped to effect the fusion of law and equity under the Supreme Court of Judicature acts (1873 et seq.)."}, {"url": "https://www.gutenberg.org/files/51143/51143-h/51143-h.htm", "page_content": "The Project Gutenberg EBook of The Waterloo Roll Call, by Charles Dalton This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you'll have to check the laws of the country where you are located before using this ebook. Title: The Waterloo Roll Call With Biographical Notes and Anecdotes Author: Charles Dalton Release Date: February 8, 2016 [EBook #51143] Language: English Character set encoding: UTF-8 *** START OF THIS PROJECT GUTENBERG EBOOK THE WATERLOO ROLL CALL *** Produced by KD Weeks, Brian Coe and the Online Distributed Proofreading Team at http://www.pgdp.net (This book was created from images of public domain material made available by the University of Toronto Libraries (http://link.library.utoronto.ca/booksonline/).)\n\nTranscriber’s Note: Minor errors, attributable to the printer, have been corrected. Please see the transcriber’s note at the end of this text for details regarding the handling of any textual issues encountered during its preparation. The bulk of this text consists of annotated tables containing names, dates, and ranks achieved of participants in the British Army at the battle of Waterloo. Most entries are accompanied by brief biographical sketches. The notes follow each table, as printed. The numbering of the notes for each table has been retained, beginning anew with ‘1’ for each table. Hyperlinks are provided which allow the reader to handily inspect each note. The footnotes to the prefatory material, and to the headings of many tables, originally appeared as an asterisk. These have been re-sequenced from A to W and appear after the paragraph where they are referenced. The cover image has been modified to include the title and author, and, as amended, is added to the public domain.\n\nTHE WATERLOO ROLL CALL.\n\nTHE\n\nWATERLOO ROLL CALL.\n\nWITH BIOGRAPHICAL NOTES AND ANECDOTES.\n\nBY CHARLES DALTON, F.R.G.S., AUTHOR OF “HISTORY OF THE WRAYS OF GLENTWORTH,” “LIFE OF GENERAL SIR EDWARD CECIL,” “MEMOIR OF CAPTAIN JOHN DALTON, COMMANDANT OF TRICHINOPOLY, 1752–1753”; AND EDITOR OF “ENGLISH ARMY LISTS AND COMMISSION REGISTERS, 1661–1714,” “THE BLENHEIM ROLL,” ETC.\n\nSecond Edition, REVISED AND ENLARGED. LONDON: EYRE AND SPOTTISWOODE, Government and General Publishers, EAST HARDING STREET, E.C. 1904 [All Rights Reserved.]\n\nI Dedicated TO GEORGE TANCRED, ESQUIRE (LATE CAPTAIN SCOTS GREYS), OF WEENS, ROXBURGHSHIRE.\n\nvii PREFACE TO SECOND EDITION.\n\nTime does not diminish the interest of Waterloo, for that combat of giants is indissolubly connected with Napoleon—the greatest master of the art of war the world has ever known.\n\nSince the publication of my Roll Call in 1890, I have received much additional information from the relatives of Waterloo officers. This has enabled me to bring out the present revised and enlarged edition. And I wish particularly to mention that many of the obituary notices of Waterloo officers given in the following pages were collected by the late Mr. J.W. O’Brien, of the British Museum Library (formerly in the ranks of the 4th Dragoon Guards), whose annotated copy of the Roll Call came into my possession by purchase. Mr. O’Brien’s researches were not made at my instigation or wish, but having been made, and brought to my notice, I thought it advisable to secure and utilise this copy of my book containing the aforesaid MS. entries.\n\nA special feature of the Second Edition is the list of non-commissioned officers and men (given in Part III.) who served at Waterloo, and subsequently received commissions in the British army.\n\nCharles Dalton.\n\nSeptember 1st, 1904.\n\nviii CONTENTS.\n\nPART I. PAGE Preface to Second Edition vii Introduction to First Edition ix-xv Abbreviations xvi List of the Staff 1–8 Biographical Memoirs of the Staff 9–39 British and Hanoverian Army, as formed in Divisions and Brigades on the 18th June, 1815 40–44 Annotated Lists of Regiments engaged at Waterloo 46–230 Medical Staff and Departmental Officers 231–235 Annotated Lists of Regiments which formed the Reserve on 18th June, 1815 236–249 PART II. Muster Roll of the Scots Greys 250–255 PART III. Non-Commissioned Officers and Men at Waterloo who subsequently received Commissions in the British Army 256–266 PART IV. A few Waterloo Heroes 267–273 Appendix 275–278 Index 279\n\nix INTRODUCTION TO FIRST EDITION.\n\nAh! Je les tiens donc, ces Anglais! — Napoleon.\n\nNever since the days of Oliver Cromwell had any name caused so much fear in England as did that of Napoleon Bonaparte. From 1802 until his first downfall, in 1814, a spirit of alarm and uneasiness pervaded all classes in Great Britain, from the King and his Ministers down to the most illiterate peasant. Those who were witnesses of, and participators in, this panic have now passed away, but the national pride which our victory over Napoleon at Waterloo excited in every Briton’s breast is as strong as ever, and will last till the crack of doom.\n\nIn July, 1803, a little pamphlet, entitled Important Considerations for the People of this Kingdom , was published in London, and “sent to the officiating minister of every parish in England.” This pamphlet, which bears the Royal Arms of England, was an appeal from the Government to the Nation, and a diatribe against Napoleon. Mark the closing lines of this appeal: “Shall we, who are abundantly supplied with iron and steel, powder and lead—shall we, who have a fleet superior to the maritime force of all the world, and who are able to bring two millions of fighting men into the field—shall we yield up this dear and happy land, together with all the liberties and honours, to preserve which our fathers so often dyed the land and the sea with their blood?... No, we are not so miserably fallen; we cannot, in so short a space of time, have become so detestably degenerate; we have the strength and the will to repel the hostility, to chastise the insolence of the foe. Mighty, indeed, xmust be our efforts, but mighty also is the need.” The idea of a French invasion was slow in forcing its way into the minds of the uneducated classes in England. When they first heard of such a possibility they thought it of no more consequence than the invasion of Scotland by Charles Edward Stuart with a mere handful of Frenchmen at his back. They also thought less of the projected descent from having heard so much in 1797, and during the Rebellion in Ireland in 1798, of a French army coming to the relief of the National party in that kingdom:—\n\n“For the French are on the sea, Says the Shan Van Vaugh, And Ireland will soon be free, Says the Shan Van Vaugh.”\n\nAnd yet nothing had come of all this talk! But when the nation at large had fully grasped the possibility of a Napoleonic invasion, Pitt had no difficulty in raising the sinews of war. No fewer than 300,000 men enrolled themselves in volunteer corps and defence associations. The army and navy were increased, and everything was done that was possible to counteract the power of that wonderful man, who, in the short space of a few years, had, speaking metaphorically, built a Great Wall of China round the British Isles, shutting the English out of the commerce of Europe. Our preparations were none too soon. In 1805 the battle of Austerlitz established the supremacy of Napoleon over Austria and Russia. Fortunately for England, Nelson’s crowning victory at Trafalgar indefinitely postponed Napoleon’s invasion scheme; but we were still engaged in a gigantic war, single-handed, with half of Europe our declared, and the other half our enforced, enemies. Nelson was dead; Pitt was dying from the weight of anxieties which pressed upon him in this tremendous crisis; Hanover had been taken from us. The outlook was very gloomy, and affairs became more complicated in 1807, when the military expeditions, arranged by Lord Grenville’s ministry, against Constantinople and Egypt, had turned out failures, and resulted in the Turks declaring war against us and confiscating all British property. And yet in 1807 Napoleon had not yet reached the zenith of his power. For the next xifive years he held the destinies of nearly the whole of Europe in his own hands. Monarchies of long standing were disestablished and new kingdoms—Napoleonic kingdoms—were raised up in their place. Immense French armies traversed Europe from Portugal to the heart of Russia, and every capital within that limit was, in its turn, subjugated to the French yoke. But in 1808 two British Generals stemmed the tide of French conquest in the Peninsula, viz., Sir John Moore and Sir Arthur Wellesley. The first met a soldier’s death at Corunna, and the latter was superseded by an incapable commander. But the British Government soon found that they had made a grievous mistake, and Wellesley was again entrusted with the supreme command in Portugal. Then commenced that series of brilliant campaigns which liberated Portugal and Spain from the Napoleonic grasp, and only ceased after the battle of Toulouse by Napoleon’s abdication at Fontainebleau. In the spring of 1814 England had a large army, composed for the most part of seasoned veterans, who were fit for anything and worth millions. When war broke out again, in the spring of 1815, at least half of the Peninsular army had been disbanded—dispersed—and not to be had at any price. Some of the best of the old Peninsular regiments had been sent to America in 1814, and several of them—the gallant 43rd Light Infantry being one—did not reach Waterloo in time to take part in the battle. Raw levies took their place, and foreign auxiliaries helped to bring up Wellington’s army in Flanders to the required strength. Of Wellington’s 106,000 barely one-third were British. The remainder consisted of “King’s German Legion,” “Hanoverian Levies,” “Brunswick Contingent,” “Nassau Contingent,” “Dutch and Belgian Troops,” and “Nassauers in Dutch service.” Of this polyglot force the German Legion, both cavalry and infantry, were deserving of the highest praise for their conduct on Waterloo Day. They formed part of the British army for nearly a dozen years, and many British officers held commissions in the “Legion.” I have been obliged to leave out the German Legion officers in the following Roll Call (excepting those who served on the Staff), and it would be invidious, when all did so well, to pick out the British officers who served in the xii“Legion” at Waterloo and record their services when those of their German brother-officers are omitted. I cannot even make an exception of Colonel (afterwards Baron) Hugh Halkett, who, like a knight in the olden days of chivalry, singled out a French general (Cambronne) in single combat, and took him prisoner.\n\nThe Hanoverian levies did well also, excepting one regiment, which refused to charge the French when commanded so to do. And this was doubtless owing to the lâcheté of their colonel, who, when ordered to lead his regiment to the charge, declined to do so, saying he had no confidence in his men. It is related that Captain Horace Seymour, who had brought this officer Lord Uxbridge’s orders, addressed “a few words of plain Saxon” to him, “which no gentleman ought to have listened to unmoved,” but the only effect they had on the Hanoverian was to hasten his departure to the rear. The Brunswick Contingent fought at a disadvantage at Waterloo, having lost their brave leader (the Duke of Brunswick) at Quatre Bras. Of the Nassau, Dutch, and Belgian troops it is only fair to say that they were, mostly, utterly useless at Waterloo. The glamour of Napoleon was upon them. They had lately been in his service, and had a settled conviction that Wellington would be defeated and his army cut to pieces. “Come over to us, brave Belgians!” shouted a French regiment at Waterloo to their Belgian opponents in the battle. But the “brave Belgians” preferred making “a retrograde movement for strategical reasons,” and retired from the field, carrying news of Wellington’s defeat to Brussels.\n\nNow for Napoleon’s army: This consisted on the 15th of June of about 128,000 men[A]—mostly veterans who had served in many campaigns, and to whom defeat was rare. Add to this, that they all belonged to one nation, and were all equally devoted to their beloved emperor. “No army,” says Colonel Chesney, in his Waterloo Lecture , “was probably ever so well furnished with leaders as his, as none had ever the like experience wherewith to train them.” It is no slight to Wellington to say that Napoleon was, for rapid and offensive warfare, by far the first general of his xiiiday. In defensive warfare Wellington was much in advance of his great rival. Taking the words out of Philip the Second’s mouth, Wellington might have with truth said, “Time and I against any other two.” Once more: Wellington himself told Earl Stanhope that he considered the presence of Napoleon with the French army at Waterloo fully equivalent to an additional force of 30,000 men! Now this was the total of the force sent under Marshal Grouchy, on the 17th June, to follow the Prussian army, which had been defeated at Ligny by Napoleon on the previous day, and which was supposed to be in full retreat on Namur and Liége, so that, in round numbers, Napoleon was himself considered equal to a whole army corps! If the British had a Picton, the French had a Ney, who was considered almost Napoleon’s equal in handling troops in the field, and who had pressed us so sorely at Quatre Bras, on the 16th of June, when only half our army had arrived at that position. Then as a leader of cavalry Lord Uxbridge was well matched by Kellermann, whose fame as a cavalry general dated from Marengo. And General Mouton (Count Lobau) was an infantry leader of whom any army might have been proud. It was he who, at the head of the Imperial Foot Guards, had wrested the victory from the Prussians on the bloody field of Lützen, in 1813, and saved the French army from a reverse. Enough has now been said to show what a splendid army the British had opposed to them on the 18th of June, 1815. “I have them at last, these English!” exclaimed Napoleon, in a transport of joy, early in the morning of that day, when he saw our army drawn up in position, with their backs to the forest of Soignies. But he underrated Wellington’s generalship, nor could he foresee how the British generals, officers, and men of all ranks would fight that memorable day, when the eyes of all Europe were upon them, because upon the issue of that contest depended the fate of empires and kingdoms, as well as the future peace of the world. And knowing, as we all do, what glory the victory at Waterloo brought to our countrymen and our country, we must be generous enough to give the brave Prussians the full share due to them for their co-operation on that day. Had it not been for them, Waterloo would have been as barren a victory as Borodino, and Napoleon would have retreated in as good xivorder, probably, as Blucher was able to do after his defeat at Ligny. As it was, our troops bore the whole brunt of the battle without losing an inch of ground, and the arrival of the Prussians, at the close of the day, sealed the fate of Napoleon.[B]\n\nIn offering this, the first annotated Waterloo Army List, to the British public, I must ask their indulgence for any omissions and errors it may contain. Although I have spared no trouble in the matter, there must be, I well know, a few names of British Waterloo officers who have escaped my notice. But when the following list is compared with the very defective lists given by Siborne and George Jones (the foundation of all other lists), I think the following Roll Call will be found infinitely more trustworthy. I have also added the regimental and army commissions of the Waterloo officers up to the date of the battle, and the honours and promotions bestowed after Waterloo. The war services of many of these same officers now appear in print for the first time, and are not to be found in the Military Calendar of field officers which was published in 1820, nor in Hart’s Army Lists , which date from 1840, and are such valuable works of reference. Of course, a large proportion of the names I have annotated, genealogically, are names of well-known families of the present time, but there are also many names in the following Roll Call which belong to families that are now extinct or lost sight of. I have endeavoured to rescue as many names from oblivion as time would allow, but there are a certain number of whom I can give no information beyond their obituary notices:\n\n“Here lies Pat Steele. That’s very true. Who was he? What was he? What’s that to you?”\n\nAs regards the orthography of the names in the regimental lists, I am not responsible, as they are copied from the “official” xv Army List . The same rule applies to the precedence of the different regiments.\n\nI am indebted to Colonel F.A. Whinyates, late R.H.A., for some interesting information regarding artillery officers, and to George Tancred, Esq., late captain Scots Greys, for the Waterloo muster-roll and some memoranda relating to the Scots Greys.\n\nCharles Dalton.\n\n32 West Cromwell Road, London, S.W.\n\nJune 1, 1890.\n\nxvi ABBREVIATIONS.\n\nPar. = Peninsular. Pa. = Peninsula. G.C.H. = Knight Grand Cross of Hanover. K.C.H. = Knight Commander of Hanover. K.H. = Knight of Hanover. K.M.T. = Knight of Maria Theresa of Austria. K. St. A. = Knight of St. Anne of Russia. K. St. V. = Knight of St. Vladimir of Russia. K. St. G. = Knight of St. George of Russia. K.T.S. = Knight of the Tower and Sword of Portugal. K.M.B. = Knight of Maximilian of Bavaria. K.W. = Knight of Wilhelm of Holland. W. after an officer’s name = Wounded. K. ” ” = Killed. M.I. = Monumental inscription.\n\n1 THE WATERLOO ROLL CALL.\n\nSTAFF.\n\nCOMMANDER-IN-CHIEF.\n\nF.-M. Arthur, Duke of Wellington , K.G., G.C.B., &c.\n\nMILITARY SECRETARY.\n\nLt.-Col. Lord Fitzroy Somerset, 1st Ft. Gds., W.\n\nAIDES-DE-CAMP.\n\nLt.-Col. J. Fremantle, 2nd Ft. Gds.\n\nLt.-Col. C.F. Canning, 3rd Ft. Gds., K.\n\nHon. Sir Alexander Gordon, K.C.B., 3rd Ft. Gds., K.\n\nLt. Lord George Lennox, 9th Lt. Dns.\n\nHered. Prince of Nassau-Usingen.\n\nEXTRA AIDES-DE-CAMP.\n\nMaj. Hon. Henry Percy, 14th Lt. Dns.\n\nCapt. Lord Arthur Hill, h. p.\n\nLt. Hon. George Cathcart, 6th Dn. Gds.\n\nGENERAL.\n\nH.R.H. The Prince of Orange, W.\n\nAIDES-DE-CAMP.\n\nLt.-Col. Baron Tripp, 60th Foot.\n\nCapt. Lord John Somerset, h. p.\n\nCapt. Hon. Francis Russell, h. p.\n\nEXTRA AIDES-DE-CAMP.\n\nCapt. The Earl of March, 52nd Foot.\n\nCapt. Viscount Bury, 1st Ft. Gds.\n\nLt. H. Webster, 9th Lt. Dns.\n\n2 LIEUTENANT-GENERAL.\n\nThe Earl of Uxbridge, G.C.B., W.\n\nAIDES-DE-CAMP.\n\nMajor W. Thornhill, 7th Hussars, W.\n\nCapt. H.B. Seymour, 18th Hussars, W.\n\nEXTRA AIDES-DE-CAMP.\n\nCapt. T. Wildman, 7th Hussars, W.\n\nCapt. J. Fraser, 7th Hussars, W.\n\nLIEUTENANT-GENERAL.\n\nLord Hill, G.C.B.\n\nAIDES-DE-CAMP.\n\nLt.-Col. C. Hill, R.H. Gds., W.\n\nMajor R. Egerton, 34th Foot.\n\nMajor C.H. Churchill, 1st Ft. Gds.\n\nCapt. D. Mackworth, 7th Foot.\n\nEXTRA AIDE-DE-CAMP.\n\nCapt. Hon. O. Bridgeman, 1st Ft. Gds., W.\n\nLIEUTENANT-GENERAL.\n\nSir Thomas Picton, G.C.B., K.\n\nAIDES-DE-CAMP.\n\nCapt. Algernon Langton, 61st Foot, W.\n\nCapt. J. Tyler, 93rd Foot, W.\n\nCapt. N. Chambers, 1st Ft. Gds., K.\n\nEXTRA AIDE-DE-CAMP.\n\nCapt. B. Price, h. p.\n\nLIEUTENANT-GENERAL.\n\nSir Henry Clinton, G.C.B.\n\nAIDES-DE-CAMP.\n\nCapt. F. Dawkins, 1st Ft. Gds.\n\nCapt. J. Gurwood, 10th Hussars, W.\n\n3 LIEUTENANT-GENERAL.\n\nCharles, Count Alten, K.C.B.\n\nAIDES-DE-CAMP.\n\nLt. W. Havelock, 43rd Foot, W.\n\nBt. Maj. A. Heise, 2nd Lt. Batt. K.G.L.\n\nLIEUTENANT-GENERAL.\n\nSir Charles Colville, G.C.B.\n\nAIDES-DE-CAMP.\n\nCapt. J. Jackson, 37th Foot.\n\nLt. F.W. Frankland, 2nd Ft. Gds.\n\nEXTRA AIDE-DE-CAMP.\n\nCapt. Lord James Hay, 1st Ft. Gds.\n\nMAJOR-GENERAL.\n\nV. Count Alten.\n\nAIDE-DE-CAMP.\n\nLt. Baron Estorff, 2nd Dns. K.G.L.\n\nMAJOR OF BRIGADE.\n\nCapt. Einem, K.G.L.\n\nMAJOR-GENERAL.\n\nSir John Vandeleur, K.C.B.\n\nAIDE-DE-CAMP.\n\nCapt. W. Armstrong, 19th Lt. Dns.\n\nMAJOR OF BRIGADE.\n\nMaj. M. Childers, 11th Lt. Dns.\n\nMAJOR-GENERAL.\n\nMaj.-Gen. Cooke, W.\n\nAIDE-DE-CAMP.\n\nCapt. G. Disbrowe, 1st Ft. Gds.\n\nEXTRA AIDE-DE-CAMP.\n\nEnsign Augustus Cuyler, 2nd Ft. Gds.\n\n4 MAJOR-GENERAL.\n\nSir James Kempt, K.C.B., W.\n\nAIDE-DE-CAMP.\n\nCapt. Hon. Charles Gore, 85th Foot.\n\nMAJOR OF BRIGADE.\n\nCapt. Charles Eeles, 95th Foot, K.\n\nMAJOR-GENERAL.\n\nHon. Sir Wm. Ponsonby, K.C.B., K.\n\nAIDE-DE-CAMP.\n\nLt. B. Christie, 5th Dn. Gds.\n\nEXTRA AIDE-DE-CAMP.\n\nMaj. D. Evans, 5th W.I. Regt.\n\nMAJOR OF BRIGADE.\n\nMaj. T. Reignolds, 2nd Dns., K.\n\nMAJOR-GENERAL.\n\nSir John Byng, K.C.B.\n\nAIDE-DE-CAMP.\n\nCapt. H. Dumaresq, 9th Foot, W.\n\nMAJOR OF BRIGADE.\n\nCapt. Wm. Stothert, 3rd Ft. Gds., K.\n\nMAJOR-GENERAL.\n\nSir Denis Pack, K.C.B., W.\n\nAIDE-DE-CAMP.\n\nMaj. E. L’Estrange, 71st Foot, K.\n\nMAJOR OF BRIGADE.\n\nBt.-Maj. Charles Smyth, 95th Foot, K.\n\nMAJOR-GENERAL.\n\nLord Edward Somerset, K.C.B.\n\nAIDE-DE-CAMP.\n\nLt. H. Somerset, 18th Hussars.\n\n5 MAJOR-GENERAL.\n\nSir John Lambert, K.C.B.\n\nAIDE-DE-CAMP.\n\nLt. T. Baynes, 39th Foot.\n\nMAJOR OF BRIGADE.\n\nMaj. H.G. Smith, 95th Foot, W.\n\nMAJOR-GENERAL.\n\nSir Colquhoun Grant, K.C.B., W.\n\nAIDE-DE-CAMP.\n\nLt. R. Mansfield, 15th Hussars, W.\n\nEXTRA AIDE-DE-CAMP.\n\nCapt. W. Moray, 17th Lt. Dns., W.\n\nMAJOR OF BRIGADE.\n\nCapt. Jones, h. p.\n\nMAJOR-GENERAL.\n\nSir James Lyon, K.C.B.\n\nAIDE-DE-CAMP.\n\nLt. Jas. McGlashan, 2nd Lt. Batt. K.G.L.\n\nMAJOR OF BRIGADE.\n\nCapt. Richter, 1st Ceylon Regt.\n\nMAJOR-GENERAL.\n\nMaj.-Gen. P. Maitland.\n\nAIDE-DE-CAMP.\n\nEnsign Lord Hay, 1st Ft. Gds., K.\n\nMAJOR OF BRIGADE.\n\nCapt. J. Gunthorpe, 1st Ft. Gds.\n\nMAJOR-GENERAL.\n\nMaj.-Gen. G. Johnstone.\n\nAIDE-DE-CAMP.\n\nCapt. C.G. Gray, 95th Foot.\n\n6 MAJOR OF BRIGADE.\n\nCapt. S. Holmes, 78th Foot.\n\nMAJOR-GENERAL.\n\nMaj.-Gen. F. Adam, W.\n\nAIDE-DE-CAMP.\n\nLt. R.P. Campbell, 7th Foot.\n\nEXTRA AIDE-DE-CAMP.\n\nCapt. C. Yorke, 52nd Foot.\n\nMAJOR OF BRIGADE.\n\nMaj. Thos. Hunter-Blair, 91st Foot, W.\n\nMAJOR-GENERAL.\n\nSir Colin Halkett, K.C.B., W.\n\nAIDES-DE-CAMP.\n\nCapt. H. Marschalk, 1st Lt. Batt., K.G.L., K.\n\nCapt. A. Home, 2nd Lt. Batt., K.G.L.\n\nMAJOR OF BRIGADE.\n\nCapt. W. Crofton, 54th Foot, K.\n\nMAJOR-GENERAL.\n\nSir Hussey Vivian, K.C.B.\n\nAIDE-DE-CAMP.\n\nCapt. Edward Keane, 7th Hussars.\n\nEXTRA AIDE-DE-CAMP.\n\nLt. C.A. Fitzroy, R.H. Gds.\n\nMAJOR OF BRIGADE.\n\nCapt. Thos. Noel Harris, h. p., W.\n\nADJUTANT-GENERAL.\n\nMaj.-Gen. Sir Edward Barnes, K.C.B., W.\n\nAIDE-DE-CAMP.\n\nMaj. Andrew Hamilton, 4th W.I. Regt.\n\n7 DEPUTY ADJUTANT-GENERAL.\n\nCol. Sir John Elley, K.C.B., R.H. Gds., W.\n\nASSISTANT ADJUTANTS-GENERAL.\n\nLt.-Col. J. Waters, Unattached, W.\n\nLt.-Col. Sir George H. Berkeley, K.C.B., 35th Foot, W.\n\nLt.-Col. Sir Guy Campbell, Bt., 6th Foot.\n\nLt.-Col. Sir Noel Hill, K.C.B., 1st Ft. Gds.\n\nLt.-Col. D. Barclay, 1st Ft. Gds.\n\nLt.-Col. H. Rooke, 3rd Ft. Gds.\n\nLt.-Col. E. Currie, 90th Foot, K.\n\nMaj. A. Wylly, 7th Foot.\n\nMaj. G. Evatt, 55th Foot.\n\nMaj. W. Darling, h. p.\n\nMaj. F. Breymann, 2nd Lt. Batt., K.G.L.\n\nDEPUTY ASSISTANT ADJUTANTS-GENERAL.\n\nCapt. Hon. E.S. Erskine, 60th Foot, W.\n\nCapt. Lord Charles Fitzroy, 1st Ft. Gds.\n\nCapt. C.A.F. Bentinck, 2nd Ft. Gds.\n\nCapt. George Black, 54th Foot.\n\nCapt. H. Blanckley, 23rd Foot.\n\nCapt. Hon. Wm. Curzon, 69th Foot, K.\n\nLt. Jas. Henry Hamilton, 46th Foot, W.\n\nLt. John Harford, 7th Rl. Veteran Batt.\n\nLt. E. Gerstlacher, 3rd Hussars, K.G.L.\n\nLt. Jas. Rooke, h. p.\n\nDEPUTY JUDGE ADVOCATE.\n\nLt.-Col. Stephen Arthur Goodman, h. p.\n\nDEPUTY QUARTERMASTER-GENERAL.\n\nCol. Sir Wm. Howe de Lancey, K.C.B., K.\n\nASSISTANT QUARTERMASTERS-GENERAL.\n\nCol. the Hon. Alex. Abercromby, 2nd Ft. Gds., W.\n\nCol. F.E. Hervey, 14th Lt. Dns.\n\nLt.-Col. Robt. Torrens, 1st W.I. Regt.\n\nLt.-Col. Sir Charles Broke, K.C.B. (Permanent).\n\nLt.-Col. Sir Jeremiah Dickson, K.C.B. (Permanent).\n\nLt.-Col. Lord Greenock (Permanent). 8.it Lt.-Col. John George Woodford, 1st Ft. Gds.\n\nLt.-Col. C. Grant, 11th Foot.\n\nLt.-Col. Sir Wm. Gomm, K.C.B., 2nd Ft. Gds.\n\nLt.-Col. Sir Henry Hollis Bradford, K.C.B., 1st Ft. Gds., W.\n\nLt.-Col. Sir George Scovell, K.C.B., h. p.\n\nLt.-Col. D. Kelly, 73rd Foot.\n\nMaj. Wm. Campbell, 23rd Foot.\n\nMaj. Hon. George Lionel Dawson, 1st Dn. Gds., W.\n\nMaj. Chas. Beckwith, 95th Foot, W.\n\nCapt. Jas. Shaw, 43rd Foot.\n\nCapt. J. Jessop, 44th Foot, W.\n\nDEPUTY-ASSISTANT QUARTERMASTERS-GENERAL.\n\nCapt. E.T. Fitzgerald, 25th Foot, W.\n\nCapt. Richard Brunton, 60th Foot.\n\nCapt. Thos. Wright, Rl. Staff Corps, W.\n\nCapt. H. MacLeod, 35th Foot, W.\n\nCapt. J.J. Mitchell, 25th Foot, W.\n\nCapt. W. Moore, 1st Ft. Gds.\n\nCapt. Geo. Hillier, 74th Foot.\n\nCapt. W.G. Cameron, 1st Ft. Gds.\n\nCapt. F. Read, Rl. Staff Corps.\n\nLt. P. Barrailler, 33rd Foot.\n\nLt. Basil Jackson, Rl. Staff Corps.\n\nLt. A. Brauns, Rl. Staff Corps.\n\nCOMMANDANT AT HEAD-QUARTERS.\n\nCol. Sir Colin Campbell, K.C.B., 2nd Ft. Gds.\n\n9 STAFF.\n\nCOMMANDER-IN-CHIEF.\n\nF.-M. Arthur, Duke of Wellington, K.G., G.C.B., &c.\n\nBorn in Dublin, 1st May, 1769. 3rd son of Garrett, 1st Earl of Mornington, by Anne, eldest dau. of Arthur (Hill), 1st Viscount Dungannon. Educated at Eton and Angers Military Academy. Like Clive, he was “a heaven-born general.” His fame far exceeded the many titles he won by his genius. “I am going to dine with Wellington to-night,” said a young Irish staff officer to a group of brother officers at the close of a hard-fought battle in Spain. “Give me at least the prefix of Mr. before my name,” said Lord Wellington, who happened to ride by at the moment and had overheard the jubilant remark. “My Lord,” replied the officer, “we do not speak of Mr. Cæsar, or Mr. Alexander, so why should I speak of Mr. Wellington?” The Duke d. at Walmer Castle, 14th Sept., 1852, and was buried in St. Paul’s Cathedral. He had m., in 1806, the Hon. Catherine Pakenham, 3rd dau. of Edward, 2nd Lord Longford, and by her, who d. in 1831, left issue.\n\nMILITARY SECRETARY.\n\nLt.-Col. Lord Fitzroy Somerset, 1st Ft. Gds., W.\n\nYoungest son of Henry, 5th Duke of Beaufort. Was Wellington’s A.D.C. and “right hand” throughout the campaign in Spain and Portugal. Lost his right arm at Waterloo, from a shot fired from the top of La Haye Sainte farmhouse after its capture by the French. Created Baron Raglan a month after Wellington’s death. F.-M. and C.-in-C. of the British army in the Crimea in Nov., 1854. D. in the Crimea during the siege of Sebastopol, at a farmhouse overlooking the plains of Balaklava. In the principal room is still to be seen a marble slab with the inscription, “In this room died F.-M. Lord Raglan, G.C.B., Commander-in-Chief of the British Army in the Crimea, 28th June, 1855.” Lord Raglan’s body was brought to England and interred at Badminton with his ancestors. He had m., in 1814, Lady Emily Harriet Wellesley-Pole, 2nd dau of Wm., 3rd Earl of Mornington, and by her, who d. 1881, left issue.\n\nAIDES-DE-CAMP.\n\nLt.-Col. J. Fremantle, 2nd Ft. Gds. (1st Batt.)\n\nServed as A.D.C. to Wellington at Vittoria, and brought home the despatch. Eldest son of Col. Stephen Fremantle, by Albinia, dau. of Sir John Jeffrys, Bart.; C.B. M., 17th Feb., 1829, Agnes, 3rd dau. of David Lyon. Died a maj.-gen. on ret. list.\n\nLt.-Col. C.F. Canning, 3rd Ft. Gds., K.\n\n3rd son of Stratford Canning, by Mehetabel Patrick, of Summerhill, Dublin, and brother of the subsequently celebrated diplomatist, Viscount Stratford de Redcliffe. Had acted as A.D.C. to Wellington 10in the Pa., and it was by the former’s special request that the Duke took him again on his personal staff just before Waterloo.\n\n“Dying lamented Canning lay, On March he wistful gaz’d. ‘How fares the Duke?’ ‘How goes the day?’ ‘All well’—his head he raised.”\n\nLt.-Col. Hon. Sir Alexander Gordon, K.C.B., 3rd Ft. Gds., K.\n\nIt is said that when Wellington was roused from sleep by Dr. Hume early on the morning after Waterloo and told that Gordon had died from the effect of his wounds, he burst into tears. Alex. Wm. Gordon was 3rd son of George, Lord Haddo, by Charlotte, youngest daughter of Wm. Baird, of Newbyth. He had served as A.D.C. to his uncle, Sir David Baird, at the capture of the Cape of Good Hope and in several subsequent campaigns.\n\nLt. Lord George Lennox, 9th Lt. Dns.\n\n2nd son of Charles, 4th Duke of Richmond, by Lady Charlotte Gordon, eldest daughter of Alexander, 4th Duke of Gordon. He and his eldest brother took an active part in the drama of the 18th June, whilst the duke, his father, and Lord Wm. Pitt Lennox, his younger brother, were spectators of a battle in which they were unable to play a more active part. (See notes to 35th Regt. of Foot.) Lord George m., 29th June, 1818, Louisa, dau. of the Hon. F. Rodney, and had issue. Was M.P. for West Sussex, 1832–41, and Gent. of the Bed-chamber to Prince Albert. D. 1873.\n\nHered. Prince of Nassau-Usingen.\n\nSon of Duke Bernard of Nassau, who sent a contingent of Nassau troops to fight at Waterloo. In the Wellington Despatches is a letter from Wellington to Duke Bernard, in July, 1815, in which he speaks highly of the bravery of the young Prince.\n\nEXTRA AIDES-DE-CAMP.\n\nMaj. Hon. Henry Percy, 14th Lt. Dns.\n\nSent home with the Waterloo Despatch, and recd. the bonus usual on such occasions and a brevet of Lt.-Col. A Jew—an agent of Rothschild, who was at Ghent when news was brought to Louis XVIII. of the defeat of the French army, drew his own conclusions from the king’s happy face which he saw through a window—set off at once for London and did his little business on the Stock Exchange a few hours before Percy reached the metropolis. 5th son of Algernon, 1st Earl of Beverley, by Isabella, 2nd dau. of Peter Burrell, of Beckenham. Was A.D.C. to Sir J. Moore at Corunna. C.B. D. unm. 15 April, 1825.\n\nCapt. Lord Arthur Hill, h. p.\n\n2nd son of Arthur, Marquis of Downshire, by Mary, Baroness Sandys in her own right. Succeeded his mother as Baron Sandys in 1836. Lt.-Gen. and Col.-in-Chf. 2nd Dns. D. unm. 1860.\n\nLt. Hon. George Cathcart, 6th Dn. Gds.\n\n3rd son of William, 10th Baron, and 1st Earl, Cathcart, by Elizabeth, dau. of Andrew Elliott, Gov. of New York. Bn. 12th May, 1794. M., 1824, Lady Georgiana Greville (dau. of Louisa, Countess of Mansfield, by 11her 2nd husband, the Hon. Robert Greville), and had issue. G.C.B. Lt.-Gen., Com. of the forces at the Cape of Good Hope. Commanded the 4th Division of the British Army in the Crimea, and fell at Inkerman. He was a worthy descendant of the founder of his family—Sir Alan de Cathcart—whose bravery at the battle of Loudoun Hill is thus recorded in an old rhyme:—\n\n“A knight that then was in his rout, Worthy and wight, stalwart and stout, Courteous and fair, and of good fame, Sir Alan Cathcart was his name.”\n\nGENERAL.\n\nH.R.H. the Prince of Orange, W.\n\nBn. 6th Dec., 1792. Appointed a maj.-gen. in the Brit. Army in Dec., 1813. Succeeded his father, William I. King of Holland (who d. in 1843), as William II. Became a F.-M. of England in 1845. D. in 1849, and was succeeded by his son, the reigning King of Holland.\n\nAIDES-DE-CAMP.\n\nLt.-Col. Baron Tripp, 60th Foot.\n\nErnest Otto, Baron Tripp, C.B., was maj. in the 60th Rifles and brevet lt.-col. He d. 1816.\n\nCapt. Lord John Somerset, h.p.\n\nBrother to Lord Fitzroy Somerset. Bn. 30th Aug., 1787. M., 4th Dec., 1814, Lady Catherine Annesley, and had issue. Col., 10th Jan., 1837. D. 3rd Oct., 1846, whilst holding the appointment of Inspecting Field Officer, Recruiting District.\n\nCapt. Hon. Francis Russell, h. p.\n\nPlaced on h. p., 2nd Garrison Batt., 28th April, 1814. Restored to f. p. as capt., 57th Regt., in 1816. Afterwards capt. and lt.-col., Coldstream Guards. Eldest son of Lord Wm. Russell, who was murdered by his valet in 1840. In the Army List for 1815 is styled “Honourable.” May have been a royal page.\n\nEXTRA AIDES-DE-CAMP.\n\nCapt. the Earl of March, 52nd Foot.\n\nAt the siege of Ciudad Rodrigo, the Earl of March, then a lt. in the 13th Lt. Dns., and serving as A.D.C. to Visct. Wellington, entered the breach as a volunteer with the storming party of the 52nd. The Prince of Orange and Lord Fitzroy Somerset were Lord March’s companions in this adventure. On the following morning, when breakfasting with Wellington, they received a gentle reproof, being staff officers, for thus risking their lives. Succeeded his father as 5th Duke of Richmond in 1819. Placed on h. p., 25th July, 1816. Served in the Pa. with the 52nd Regt. and was severely wounded at the battle of Orthes. M., 10th April, 1817, Lady Charlotte Paget, eldest dau. of the 1st Marquis of Anglesey, and had issue. A.D.C. to the Queen. K.G. Lt.-col. in the army, and col. Sussex Militia. D. 21st Oct., 1860.\n\n12Capt. Viscount Bury, 1st Ft. Gds.\n\nEldest son of William Charles, 4th Earl of Albemarle, by the Hon. Eliz. Southwell, dau. of Edward, Lord de Clifford. Bn. 2nd June, 1794. Served in the Pa. M., 4th May, 1816, Frances, dau. of Charles Steer, of Chichester. Succeeded as 5th earl in 1849. D. s. p. 15th March, 1851.\n\nLt. H. Webster, 9th Lt. Dns.\n\nAfterwards Col. Henry Vassall Webster, K.T.S., 2nd son of Sir Godfrey Webster, Bart., by Eliz. Lady Holland, dau. and heir of Robt. Vassall, of Jamaica. Made a Knt. of Wilhelm of the Netherlands for his services at Waterloo. M. Grace, dau. of Samuel Boddington. Killed himself in a fit of insanity, 19th April, 1847.\n\nLIEUTENANT-GENERAL.\n\nThe Earl of Uxbridge, G.C.B., W.\n\n“The Prince Murat of the British Army.” This brilliant cavalry leader served with distinction in the early part of the war in the Pa. The way he handled the cavalry at Waterloo is a matter of history known to every Briton. Wounded in the right knee during the last charge; his right leg was amputated after the battle and buried under a tree. A board was afterwards affixed to this tree with this verse:—\n\n“Here lies the Marquis of Anglesey’s leg; Pray for the rest of his body, I beg.”\n\nWas created Marquis of Anglesey 23rd June, 1815. Bn. 17th May, 1768. Succeeded his father as 2nd Earl of Uxbridge in 1812. Attained the rank of F.-M. in Nov., 1846. Was twice m., and left issue by both wives. D. 29th April, 1854. Bd. in Lichfield Cathedral.\n\nAIDES-DE-CAMP.\n\nMaj. W. Thornhill, 7th Hussars, W.\n\n2nd son of Bache Thornhill, of Stanton-in-Peak, near Bakewell, by Jane, dau. of Edward Gould, of Mansfield Woodhouse. Promoted lt.-col. of 7th Hussars 12th Aug., 1819. K.H. He had received his brevet lt.-colcy. in June, 1815, at Lord Anglesey’s request. D. at Wimborne, 9th Dec., 1850.\n\nCapt. H.B. Seymour, 18th Hussars, W.\n\n“The strongest man in the British Army,” who is said to “have slain more men at Waterloo than any other single individual.” Was taken prisoner on the 18th June, but rescued by some of our cavalry sent by Wellington himself for the purpose. He is the identical “Capt. Trevanion” in Charles Lever’s Harry Lorrequer , who was grossly insulted by a French officer—a noted bully—at a restaurant in Paris a few weeks after Waterloo. After repeated insults the French bully ordered a glass of brandy, and, whilst sitting just opposite Trevanion, drank it off, saying, in a loud voice that could be heard all over the café, “A votre courage, Anglais.” “Trevanion slowly rose from his chair, displaying to the astonished Frenchman the immense proportions and gigantic frame of a man well known as the largest officer in the British Army. With one stride he was beside the chair of the Frenchman, and with the speed of lightning, he seized his nose by one hand while with the other he grasped his lower jaw, and, wrenching open his mouth with 13the strength of an ogre, he spat down his throat.” The bully’s jaw was broken by his adversary’s iron grasp, and he disappeared to be seen no more.\n\nHorace Beauchamp Seymour was transferred, in 1815, to a troop in the 1st Life Guards. Was put on h. p. 1819, K.C.H.; M.P. for Lisburn. 3rd son of Adml. Lord Hugh Seymour, by Lady Anne Waldegrave, dau. of 2nd Earl Waldegrave. M. twice, and by his first wife (Eliz., dau. of Sir L. Palk, Bt.) was father of Adml. Lord Alcester. D. at Brighton 23rd Nov., 1851.\n\nEXTRA AIDES-DE-CAMP.\n\nCapt. T. Wildman, 7th Hussars, W.\n\nPurchased the Newstead Abbey estate for £95,000 from Mr. Clawton, who had bought it of Lord Byron for £14,000. Eldest son of Thos. Wildman of Bacton Hall, Suffolk, by Sarah, dau. of Henry Hardinge, of Durham. Served at Corunna and in many of the subsequent engagements. M., 1816, Louisa Preisig, a Swiss lady. D. s. p., 20 Sept., 1859.\n\nCapt. J. Fraser, 7th Hussars, W.\n\nAftds. Sir James John Fraser, Bart. Succeeded his brother, Sir Wm. Fraser, in 1827. Son of Wm. Fraser (a direct descendant of 1st Lord Lovat), who was created a bart. in 1806, by Elizabeth Farquharson. M. Charlotte, only child of D. Craufurd. D. 5th June, 1834, and was succeeded by his son, Wm. Augustus.\n\nLIEUTENANT-GENERAL.\n\nLord Hill, G.C.B.\n\nThe 2nd son and 4th child of a family of sixteen. His father was Sir John Hill, a Shropshire bart. His mother, the dau. and co-heir of John Chambré, of Petton, in the same county. Bn. 11th Aug., 1772, at The Hall, in the village of Prees, in Shropshire. Entered the 53rd Regt. as lieut., in 1793. Was A.D.C. to Gen. O’Hara, at Toulon. Commanded the 90th Regt. at the age of 23. Appointed to a brigade command in the Pa., in 1808, and to a division in 1809. Greatly distinguished himself at Arroyo and Almaraz—victories that were entirely his. K.C.B. In 1814 was created a baron of England. At Waterloo had a horse shot under him—was rolled over and severely bruised. In a letter to his sister, dated 24th July, 1815, he said: “I verily believe there never was so tremendous a battle fought as that at Waterloo.” C.-in-C. 1828–42. Created a viscount, 1842, with remainder to his nephew, Sir Rowland Hill. D., unm., 10th Dec., 1842, at Hardwick Grange.\n\nAIDES-DE-CAMP.\n\nLt.-Col. C. Hill, R.H. Gds., W.\n\nBrother to the above. Bn. 6th Dec., 1781. As a Maj.-Gen. commanded the forces at Madras. Equerry to H.R.H. the Duchess of Kent. D. unm., 20th Jan., 1845.\n\nMaj. R. Egerton, 34th Foot.\n\n9th and youngest son of Philip Egerton, of Oulton, Cheshire, by Frances, dau. and co-heir of Sir Griffith Jefferies, Knt. As a subaltern served in North America with the 29th Foot, and in South America with the 89th 14Foot. Served with the 2nd Batt. 34th Foot in the Pa., in 1809. In 1810 was appointed to the Staff of Wellington’s army. In 1812 was A.D.C. to Lord (then Sir Rowland) Hill, and served in that capacity at Waterloo, and with the army of occupation in France. In 1828 Lord Hill chose Col. Egerton for his first A.D.C. and private sec. C.B. Par. medal with 8 clasps. Col.-in-Chf. 46th Foot. M., 1st Dec., 1814, Arabella, youngest dau. of H. Tomkinson, of Dorfold. D. at Eaton Banks, Cheshire, aged 72, 21st Nov., 1854.\n\nMaj. C.H. Churchill, 1st Ft. Gds.\n\nCol. Chatham Horace Churchill, C.B., appears to have sprung from the Dorsetshire family of this name. This officer, who took a prominent part in the Waterloo drama, evinced the enthusiasm which characterized his great namesake a century before. “By G—, they deserve to have Bonaparte!” he was heard to exclaim, as he watched the French “Invincibles” ride into the jaws of death. Writing home to his family the day after the battle he said: “I had rather have fallen yesterday as a British Infantryman, or a French Cuirassier, than die ten years hence in my bed!” He d. in action at Gwalior, India, 27th Dec., 1843, whilst holding the appointment of Q.-M.-G. in India. He left a dau., Louisa, who m. Lt.-Col. John Michel, who became F.-M., 1886. See Appendix.\n\nCapt. D. Mackworth, 7th Foot.\n\nAftds. Sir Digby Mackworth, Bart. As a subaltern in 7th Fusiliers, was at the battle of Albuera, and was one of the 150 men who remained unwounded in the 7th and 23rd Regts. at the close of the action. Succeeded his father Sir Digby, in 1838. K.H. Lt.-Col. 1837. Was twice married and left issue. Died at Glen Usk, co. Monmouth, 1852, aged 63.\n\nEXTRA AIDE-DE-CAMP.\n\nCapt. Hon. O. Bridgeman, 1st Ft. Gds., W.\n\n3rd son of Orlando, 2nd Baron Bradford, by Lucy Elizabeth, dau. of 4th Visct. Torrington. M., 1817, Selina, dau. of Francis, Earl of Kilmorey, and had issue. Placed on h. p. 1819. D. 1827.\n\nLIEUTENANT-GENERAL.\n\nSir Thomas Picton, G.C.B., K.\n\nSon of Thos. Picton, of Poyston, co. Pembroke. The leader of the “fighting” third division in the Par. War. Victory and glory went hand in hand with this heroic leader, whose memory is so dear to every Briton. Received a probably mortal wound at Quatre Bras but concealed the fact from everyone, excepting an old servant, in order that he might be present at what he foresaw was to be a tremendous struggle. Fell whilst gloriously leading a charge of infantry to repel “one of the most serious attacks made by the enemy on our position.” It is said that on the morning of the 18th June, one of the first questions asked by Napoleon of his Staff was: “Où est la division de Picton?” A few hours later, the broken ranks and decimated companies of many French regts. answered the question. Picton’s body was conveyed to England and interred in the burial ground of St. George’s, Hanover 15Square. In 1859 his remains were finally deposited in St. Paul’s Cathedral. Pensions were granted to the sisters of Sir Thos. Picton, G.C.B., in consideration of his great services.\n\nAIDES-DE-CAMP.\n\nCapt. Algernon Langton, 61st Foot, W.\n\n3rd son of Bennet Langton, of Langton, co. Lincoln, by Mary, dowager Countess of Rothes. Wounded at Quatre Bras. Made a bt.-maj. On h. p. 1817. Took holy orders. M. Mary Anne, sister of Edward Drewe, of Grange, co. Devon, and had issue a son, Bennet. D. 1829.\n\nCapt. J. Tyler, 93rd Foot, W.\n\nPicton’s first A.D.C. in the Pa. Was by his General’s side when he was killed at Waterloo. Sent home with the body. Made bt.-maj. for Waterloo. Placed on h. p. 1820. Appointed junior maj. of the 97th Regt. in 1829. Belonged to a Glamorganshire family. D. 4th June, 1842.\n\nCapt. N. Chambers, 1st. Ft. Gds., K.\n\nSon of George Chambers by the Hon. Jane Rodney, eldest dau. of the “Great” Lord Rodney by his 2nd wife, Henrietta Clies. Killed a few minutes after Picton fell.\n\nEXTRA AIDE-DE-CAMP.\n\nCapt. B. Price, h. p.\n\nBarrington Price commenced his career in the 43rd Regt., and was present at Vimiero and Corunna. Capt. 102nd Regt. 1811; h. p. 50th, 1815. D. in London, 21st Jan., 1816. Grandson of Robert Price, of Foxley, who married, in June, 1746, Sarah, dau. of John, 1st Visct. Barrington. It is worthy of note that it was a Welsh gentleman of the name of Price who was the first to smoke tobacco in the streets of London.\n\nLIEUTENANT-GENERAL.\n\nSir Henry Clinton, G.C.B.\n\n2nd son of Sir H. Clinton, K.C.B., the C.-in-C. of the Brit. forces in America during the war, by Harriet, dau. and co-heir of Thos. Carter. Received the thanks of Parliament for his services at Waterloo. M., in 1799, 2nd dau. of Francis, Lord Elcho. D. s. p. 11th Dec., 1829.\n\nAIDES-DE-CAMP.\n\nCapt. F. Dawkins, 1st Ft. Gds.\n\n4th son of Henry Dawkins, M.P. for Aldborough, by Augusta, dau. of Gen. Sir H. Clinton, Commander of the forces in North America. Bn. 1796. M., 1836, Ann, eldest dau. of Gen. Sir Howard Douglas, Bart., and had issue. Dep. Q.-M.-G. in the Ionian Islands, 1837. Col. in the army, 1841. D. 1847.\n\nCapt. J. Gurwood, 10th Hussars, W.\n\nAs a subaltern in 52nd Regt., commanded the forlorn hope, at the lesser breach, at the assault on Ciudad Rodrigo, and received a severe wound 16in his head. On this occasion he took the Governor, Gen. Barrié, prisoner, whose sword was presented to Gurwood by Wellington. Came of poor but honest parents in the East Riding of Yorkshire. Was a frequent visitor at Langton Hall, near Malton, the seat of his friend, Col. (aftds. Maj.-Gen.) Norcliffe, K.H., who persuaded Gurwood to sit to Morton, the painter, for his portrait, which is still at Langton. Editor of The Wellington Dispatches . C.B. and Col. Dep. Lt. of the Tower. D. at Brighton, 25 Dec., 1843. Bd. in the Tower Chapel.\n\nLIEUTENANT-GENERAL.\n\nChas., Count Alten, K.C.B.\n\nServed throughout the Par. War with the German Legion. Specially mentioned in the Waterloo dispatch. Aftds. Minister of War and Inspector-Gen. Hanoverian army.\n\nAIDES-DE-CAMP.\n\nLt. W. Havelock, 43rd Foot, W.\n\n“El chico bianco” of the Par. War. Bn. 1795. Eldest son of Wm. Havelock, of Ingress Park, Kent. Ensign, 43rd Regt., 12th July, 1810. K.H. Killed in action at Ramnuggur, India, 22nd Nov., 1848, whilst commanding 14th Lt. Dragoons. The following account of the sanguinary action with the Sikh army is given in the Annual Register for 1848:—“A more fearful sight was perhaps never witnessed on a field of battle, for the British army stood drawn up silent spectators of the bloody conflict of 450 sabres against an army amounting to more than 15,000 men with heavy cannon ... the gallant Havelock, in the front of his regt., charged amidst the undeviated fire from the batteries of the enemy, and was almost cut to pieces.”\n\nBt.-Maj. A. Heise, 2nd Lt. Batt. K.G.L.\n\nAftds. Lt.-Col. Sir Augustus Heise, K.C.H. D. at Tübingen, in State of Wurtemburg, 1st Aug., 1819.\n\nLIEUTENANT-GENERAL.\n\nSir Charles Colville, G.C.B.\n\nCommanded the Reserves at Hal, on 18th June, and was not present at Waterloo. Commanded the British troops at the siege of Cambray, and accompanied the allied army to Paris. 2nd son of John, 9th Baron Colville (and father of 11th Baron), by Amelia Webber. Served in the Pa., and was wounded when commanding the principal attack on “Badajoz’s breeches,” 6th April, 1812. Bn. 7th Aug., 1770. M. 16th Feb., 1818, Jane eldest dau. of Wm. Mure, of Caldwell, co. Ayr. G.C.B.; G.C.H.; K.T.S.; Col. 5th Foot; Gen. and Gov. of Mauritius 1828. D. 27th May, 1843, at Hampstead.\n\nAIDES-DE-CAMP.\n\nCapt. J. Jackson, 37th Foot.\n\nCapt. 6th Dn. Gds. 4th Dec., 1817. Aftds. Gen. Sir James Jackson, G.C.B., and Col.-in-Chf., K.D.G. Served in the Pa. and in Arabia, and was for 17some time Lt.-Gov. at the Cape of Good Hope. 3rd son of Col. George Jackson, of Enniscoe, by Maria, only dau. and heir of Wm. Rutledge, of Foxford, co. Mayo. D. 31st Dec., 1871.\n\nLt. F.W. Frankland, 2nd Foot.\n\nAftds. Sir Fredk. Wm. Frankland, Bart., of Thirkelby, co. York. Descended from Oliver Cromwell, through his daughter Frances Cromwell’s marriage with Sir John Russell, Bart. Served at Pampeluna, the battles of the Pyrenees, Nivelle, Nive, Bidassoa, and Toulouse. Sir Frederick m. Katharine, only dau. of Isaac Scarth, and left at his decease, in 1878, a son, the late Sir Wm. Frankland, Bart., R.E., of Thirkelby.\n\nEXTRA AIDE-DE-CAMP.\n\nCapt. Lord James Hay, 1st Ft. Gds.\n\n2nd son of George, 7th Marquis of Tweeddale, by Lady Hannah Maitland, dau. of 7th Lord Lauderdale. M., 1813, Eliz., only child of James Forbes, of Seaton, co. Aberdeen. Lt.-gen. and col. 86th Regt. D. 17th Aug., 1862, leaving issue.\n\nMAJOR-GENERAL.\n\nV. Count Alten.\n\nCount Victor Alten distinguished himself in the Pa. D. at Osnabruck, a lt.-gen. in the Hanoverian Service.\n\nAIDE-DE-CAMP.\n\nLt. Baron Estorff, 2nd Dns., K.G.L.\n\nD. at Osnabruck, 28th April, 1827.\n\nMAJOR OF BRIGADE.\n\nCapt. Einem, K.G.L.\n\nAfterwards Lt.-Col. Gottfried von Einem. D. 23rd Aug., 1820.\n\nMAJOR-GENERAL.\n\nSir John Vandeleur, K.C.B.\n\nOnly son of Richard Vandeleur of Rutland, Queen’s Co., a captain 9th Lt. Dns., by Elinor, dau. of John Firman of Firmount. Bn. 1763. Served under Lord Lake in India; commanded a cavalry brigade in the Pa., and received the gold cross. G.C.B. for Waterloo. Gen. and Col.-in-Chf. 16th Lt. Dns. in 1830. M., 1829, Catherine, dau. of Rev. John Glasse, and had issue. D. 1st Nov., 1849.\n\nAIDE-DE-CAMP.\n\nCapt. W. Armstrong, 19th Lt. Dns.\n\nThe 19th Dragoons was Sir John Vandeleur’s old regt. Wm. Armstrong was placed on h. p. as capt. in the Royal African Corps in 1819. In the h. p. list 1830.\n\n18 MAJOR OF BRIGADE.\n\nMaj. M. Childers, 11th Lt. Dns.\n\nEldest son, by a 2nd marriage, of Chas. Walbanke-Childers, who assumed the latter name on inheriting the estates of his grandfather, Leonard Childers, of Carr House, co. York. Michael Childers became jun. lt.-col. of 11th Dns. in 1820. C.B. Col. 1837. D. at Sand Hutton, co. York, 9th Jan., 1854, unm.\n\nMAJOR-GENERAL.\n\nMaj.-Gen. George Cooke, W.\n\nSon of Col. G. Cooke, of Harefield Park, Mdx., and brother of Sir H.F. Cooke (private sec. to Duke of York) and Adl. Sir Edward Cooke. His mother was Penelope, sister of Adl. Boyer. Appointed ens. 1st Guards, 1784. In 1794 served in Flanders, and was A.D.C. to Maj.-Gen. (aftds. F.-M.) Hulse. As lt.-col. in the Guards was sev. wnded. when serving in Holland in 1799. Held a command in the Pa. under Sir T. Graham. Appointed maj.-gen. 4th June, 1811. Lost his right arm at Waterloo. K.C.B. 22nd June, 1815; K. St. George of Russia, &c.; Col.-in-Chf. 40th Foot. D. 3rd Feb., 1887, at Harefield, Mdx.\n\nAIDE-DE-CAMP.\n\nCapt. G. Disbrowe, 1st Ft. Gds.\n\nThe Desboroughs, or Disbrowes, were brought into notice during the Civil Wars when John Desborough, a noted Republican, exchanged his plough for a sword, and attained high renown as a soldier. The Gen.’s family came still more into notice when he married Cromwell’s youngest sister. George Disbrowe was placed on h. p. as lt.-col. 1821. K.H. He was 2nd son of Edward Disbrowe, of Walton-upon-Trent, co. Derby, by Lady Charlotte Hobart, youngest dau. of George, 3rd Earl of Buckinghamshire. Col. G. Disbrowe d. about 1875.\n\nEXTRA AIDE-DE-CAMP.\n\nEns. Augustus Cuyler, 2nd Ft. Gds.\n\nBn. 14th Aug., 1796. 2nd son of Gen. Cornelius Cuyler, who was created a Bart. in 1814; lt. and capt. same regt. 1817; lt.-col. h. p. 1826.\n\nMAJOR-GENERAL.\n\nSir James Kempt, K.C.B., W.\n\nBn. in Edinburgh about 1764. Son of Gavin Kempt, of Batley Hall, Hants. Entd. army 1783. A.D.C. to Abercromby in Holland. Accompanied Sir Ralph to the Mediterranean and served as his A.D.C. and military sec. until that Gen.’s death. Served under Lord Hutchinson in Egypt in similar position. Commanded a brigade in the 3rd division in the Pa. Received the gold cross with three clasps; G.C.B. for Waterloo; Gov. Nova Scotia; Gov.-Gen. Canada; Master-Gen. of the Ordnance; Col.-in-Chf. 1st Foot, 7th Aug., 1846. D. in London 20th Dec., 1854, leaving £120,000 in personalty.\n\n19 AIDE-DE-CAMP.\n\nCapt. the Hon. Charles Gore, 85th Foot.\n\nBn. 1793. Began his career in 6th Regt. Foot. Exchanged to 43rd Regt. Joined this regt. in the Pa. 1811, and was one of the storming party of Fort San Francisco, at the investment of Ciudad Rodrigo. A.D.C. to Sir Andrew Barnard at Salamanca, and in a similar capacity to Sir J. Kempt at Vittoria and subsequent battles. Accompanied Kempt to Canada in 1814, and returned just in time to fight at Waterloo, where he had three horses shot under him. Son of Arthur Gore, 2nd Earl of Arran, by his 3rd wife, Eliz. Underwood. G.C.B.; K.H.; Gen. and col. 6th Foot; Lt.-Gov. Chelsea Hospital. M. 1824 Sarah, dau. of Hon. James Fraser of Nova Scotia, and had issue. D. 4th Sept., 1869.\n\nMAJOR OF BRIGADE.\n\nCapt. Charles Eeles, 95th Foot, K.\n\nBrother of Lt.-Col. Wm. Eeles, K.H., who d. in command of 1st Batt. Rifle Brigade in 1837.\n\nMAJOR-GENERAL.\n\nThe Hon. Sir William Ponsonby, K.C.B., K.\n\nLost his life at Waterloo from being badly mounted. Whilst leading a cavalry charge against the “Polish Lancers” his horse stuck in a heavy ploughed field and was unable to extricate itself. “He took a picture and watch out of his pocket and was just delivering them to his A.D.C. to give his wife when the lancers were on him.” Both Ponsonby and his companion were immediately killed by the Polish cavalry, who, later in the day, were almost annihilated by the Heavy Brigade which Ponsonby had commanded. He was 2nd son of Wm., 1st Baron Ponsonby, of Imokilly, co. Cork, by Hon. Louisa Molesworth, 4th dau. of F.-M. Viscount Molesworth. M. 20th Jan., 1807, Hon. Georgiana Fitzroy, dau. of Charles, 1st Baron Southampton, and had a son, born posthumous, 6th Feb., 1816, who succeeded as 3rd Baron Ponsonby.\n\nAIDE-DE-CAMP.\n\nLt. B. Christie, 5th Dn. Gds.\n\nBraithwaite Christie was promoted capt. in 5th D.G. 3rd July, 1817, and in 1824 was senior capt. in the regt. He d. at Belmont 23rd Sept., 1825. He was 3rd son of Adl. Alexander Christie of Baberton (2nd son of Archibald Christie of Stenton), by Eliz., dau. of Adl. Richard Braithwaite.\n\nEXTRA AIDE-DE-CAMP.\n\nMaj. D. Evans, 5th W.I. Regt.\n\nAfterwards the celebrated Sir De Lacy Evans of British Legion and Crimean fame. Bn. at Moig, Ireland, 1787. Educated at the Military Academy, Woolwich. Gained distinction in the Par. War by volunteering for storming parties. Served in the American War of 1812. Fought at Bladensburg, where Gen. Ross gained fame for himself and 20his descendants. At Washington, with a very small force of infantry, De Lacy Evans captured the Congress House. Was engaged at Baltimore and New Orleans, and returned in time for Waterloo, where he had two horses shot under him. Commanded British Legion in Spain 1835–7 and 2nd division in Crimea. G.C.B., and was decorated with various Spanish orders; was also a Grand Officer of the Legion of Honour; Col.-in-Chf. 21st Fusiliers 1853. D. 9th Jan., 1870. Bd. in Kensal Green Cemetery, M.I. See Appendix.\n\nMAJOR OF BRIGADE.\n\nMaj. T. Reignolds, 2nd Dns., K.\n\nDoubtless was the officer mentioned above as being with Sir W. Ponsonby when he was killed, as there were none of that Gen.’s A.D.C.s killed at Waterloo. He left orphan children to whom a pens. was granted.\n\nMAJOR-GENERAL.\n\nSir John Byng, K.C.B.\n\nYoungest son of George Byng, of Wrotham Park, Middx. (grandson of George, 1st Viscount Torrington), by Anne, dau. of Wm. Connolly, of Castletown, Ireland. Twice received the thanks of Parliament for his eminent services in the Pa. and at Waterloo, and an augmentation to his arms for himself and his descendants by royal grant. G.C.B.; G.C.H.; K.M.T.; K.S.G.; P.C.; F.-M., Oct., 1855; Col.-in-Chf. 29th Foot; Governor of Londonderry and Culmore. M. 1st Miss Mackenzie, and had issue; m. 2ndly, 1809, Marianne, 2nd dau. of Sir Walter James Bart., and had issue. Created Baron Strafford in 1835, and Earl of Strafford in 1847. D. 3rd June, 1860.\n\nAIDE-DE-CAMP.\n\nCapt. H. Dumaresq, 9th Foot, W.\n\nFought in 13 battles during the Par. War. Also at the sieges of Burgos and Badajoz, and assaults on forts of Salamanca. On the two former occasions served as a volunteer with the Engineers, and on the latter was again a volunteer; being foremost in the assault of that redoubt, he received from the officer commanding at Vittoria convent the terms of his capitulation, which document he delivered to Lord Wellington. Was a lt.-col. after nine years’ service (so gazetted in June, 1817). Was shot through the lungs at Hougoumont, but, being at the time in charge of a message to Wellington, he went on to the Duke and delivered it. Ball never extracted. D. in New South Wales 5th March, 1838, age 46, whilst holding the post of manager of the Australian Agricultural Co. He was a native of Jersey. M. 19th Aug., 1828, Eliz. Sophia Danvers, and left issue.\n\nMAJOR OF BRIGADE.\n\nCapt. Wm. Stothert, 3rd Ft. Gds., K.\n\nIn 1814 this officer was sev. wnded. in the attack on Bergen-op-Zoom. The only family bearing this name, that the Editor has been able to trace, came from Kirkcudbrightshire.\n\n21 MAJOR-GENERAL.\n\nSir Denis Pack, K.C.B., W.\n\nOnly son of the Very Rev. Thos. Pack, Dean of Ossory, by Catherine, dau. and heiress of Denis Sullivan, of Berehaven, co. Cork. Five times received the thanks of Parliament for his military services. Was one of the most dashing leaders of a brigade in the Par. War. “He was scarred with wounds and covered with glory.” Commanded the 71st Regt. at Buenos Ayres when that city was retaken by the Spaniards, and was sev. wnded. and taken prisoner. When he escaped from prison, Pack was appointed to the command of a provisional battalion stationed at Colonia. His fidgety and irascible temper somewhat tried those who had to serve under him. One morning there appeared written in chalk on the door of a barn the following distich:—\n\n“The devil break the gaoler’s back That let thee loose, sweet Denis Pack.”\n\nFor his services at Waterloo he was made Col.-in-Chf. of the York Chasseurs. M. 10th July, 1816, Lady Eliz. Beresford, youngest dau. of George, 1st Marquis of Waterford, and had issue. His 2nd son was Lord Beresford’s heir, and assumed the surname of Beresford. Sir Denis d. 24th July, 1823.\n\nAIDE-DE-CAMP.\n\nMaj. E. L’Estrange, 71st Foot, K.\n\nEdmund L’Estrange was a hero in every sense of the word. He was eldest son of Capt. Anthony L’Estrange of the 88th Regt.—one of the Irish representatives of the ancient family of Le Strange, of Hunstanton, co. Norfolk. Was A.D.C. to Sir Denis Pack in the Par. War, and his especial gallantry, on several occasions, attracted the notice of Wellington. Made a brevet maj. at the early age of 26. His right leg was shattered by a round shot at Waterloo, and he died soon after suffering amputation. Had he lived, a great future was in store for him. A pension was granted to his mother whom he had supported.\n\nMAJOR OF BRIGADE.\n\nBt.-Maj. Chas. Smyth, 95th Foot, K.\n\nBn. 8th Jan., 1786. Distinguished himself in the Par. War, and was promoted brevet maj. in 1815. D. from wounds received at Quatre Bras. 4th son of the Rt. Hon. John Smyth, of Heath Hall, near Wakefield, by Lady Georgiana Fitzroy, eldest dau. of 3rd Duke of Grafton.\n\nMAJOR-GENERAL.\n\nLord Edward Somerset, K.C.B.\n\nCommanded the 4th Lt. Dns. in the Par. War. In the first Cavalry charge at Waterloo, Lord Edward Somerset lost his cocked hat, and went to the charge bare-headed. On his return, whilst looking for his hat, a cannon-ball took off the flap of his coat and killed his horse. He donned a Life Guard’s helmet and wore it during the battle. Bn. in 1776. 4th son of Henry, 5th Duke of Beaufort. M., 1805, Louisa, youngest dau. of 2nd Visct. Courtenay. G.C.B., K.T.S. Col.-in-Chf. 4th Lt. Dns. 1836. D. 1st Sept., 1842, leaving issue.\n\n22 AIDE-DE-CAMP.\n\nLt. H. Somerset, 18th Hussars.\n\nAfterwards Lt.-Gen. Sir Henry Somerset, K.C.B. and K.H. Col.-in-Chf. 25th Foot. Bn. 30th Dec., 1794. Eldest son of Lord Charles Somerset, by 4th dau. of Visct. Courtenay. M., 1st April, 1817, Frances, dau. of Adml. Sir H. Heathcote, and had issue. Served in the first Kaffir War, and was afterwards C.-in-C. at Bombay. D. 15th Feb., 1862, leaving issue.\n\nMAJOR-GENERAL.\n\nSir John Lambert, K.C.B.\n\n2nd son of Capt. Robert Lambert, R.N. (2nd son of Sir John Lambert, 2nd Bart.), by Catherine, dau. of Edward Byndloss, of Jamaica. Succeeded to the command of the British troops before New Orleans, in Jan. 1815, on the deaths of Generals Pakenham and Gibbs, who nobly fell whilst heading an attack on the “Crescent City.” The disorganised state of the British troops, and the utter impracticability of forcing the American entrenchments, induced General Lambert to retreat, which he was able to do without meeting with any opposition, having captured Fort Bowyer. With their natural love of exaggeration, the Americans magnified both their victory and our defeat:—\n\n“The English had ten thousand, Jackson only one; But what was that to Jackson When him they turned their backs on?”\n\nBy a forced march from Ostend, Lambert’s brigade arrived at Waterloo just as the battle was commencing. G.C.B. Col.-in-Chf. 10th Foot, 1824. M., 19th Oct., 1816, a dau. of John Mount, of Brocklehurst, in the New Forest. D. at Thames Ditton, 14th Sept., 1847, leaving issue.\n\nAIDE-DE-CAMP.\n\nLt. T. Baynes, 39th Foot.\n\nPromoted capt. in 1824, and placed on h. p. 20th Nov., 1828. D. at Brussels, 27th May, 1847.\n\nMAJOR OF BRIGADE.\n\nMaj. H.G.W. Smith, 95th Foot, W.\n\nAfterwards the renowned Sir Harry George Wakelyn Smith, Bart., G.C.B. and Col.-in-Chf. Rifle Brigade. Bn. at Whittlesea, Isle of Ely; son of a local surgeon. Entered the 95th Rifles in 1805. Was present at the capture of Monte Video. Served at twelve general actions in the Pa. and was afterwards A.A.G. in America. Served at Bladensburg and the destruction of Washington. Sent home with despatches. Went out again under Sir E. Pakenham, and was present at the attack upon the enemy’s lines near New Orleans. Promoted brevet lt.-col. for his services at Waterloo. Commanded a division in the Kaffir War of 1834–5. In 1840 was A.-G. in India. K.C.B. for battle of Maharajpore. G.C.B. for the Sutlej Campaign. Created a baronet for his victory at Aliwal. C.-in-C. at Cape of Good Hope in Kaffir War of 1848. He m., in 1816, a young Spanish lady, Juana Maria de los Dolores de Leon, who 23had appealed to him for protection on the day after the assault on Badajoz in Apr. 1812. D. in London, without issue, 12th Oct., 1860, and was buried at Whittlesea. M.I., in St. Mary’s Church.\n\nMAJOR-GENERAL.\n\nSir Colquhoun Grant, K.C.B., W.\n\n“Descended from the Grants of Gartenbeg.” In order to show the antiquity of the great “Clan Grant,” one of the name asserted that the verse in the Old Testament, saying, “There were giants in the earth in those days” had been wrongly translated, and that it ought to read: “There were Grants in those days.” This genealogical flight reminds one of the story of a negro servant, Deemers by name, who, hearing his Yankee master everlastingly talking of his ancestors, cut into the conversation one fine morning when waiting at table with the following: “Massa, an ancestor of mine is mentioned in de Bible; I heard de minister read out last Sunday a chapter about a coloured man—one nigger Deemers!”\n\nColquhoun Grant commanded the 72nd Regt. in the expedition to the Cape of Good Hope, under Sir David Baird, in 1806, and on 8th Jan. was wounded in the action with the Batavian army. In Sir D. Baird’s despatch, announcing the victory of the British troops, occurs this passage: “Your lordship will perceive the name of Lt.-Col. Grant among the wounded; but the heroic spirit of this officer was not subdued by his misfortune, and he continued to lead his men to glory as long as an enemy was opposed to the 72nd Regt.” The following is an authentic anecdote:—\n\nSir Colquhoun Grant, being in command of a regt. at Clonmel, he gave offence in some way to an honest shopkeeper, named Mulcahy, who struck him on the parade, in presence of his whole corps. The officers rushed forward to seize the delinquent, but Sir Colquhoun interposed, declaring that he had been the aggressor, and as the gentleman thought proper to resent his conduct in so gross a manner, it remained for him to seek the usual reparation. “Oh!” exclaimed Mulcahy, “if it’s for fighting you are, I’ll fight you; but it shall neither be with swords nor pistols, nor anything else but my two fists” (and fine big mutton fists they were, sure enough). “Well, then,” replied the gallant officer, “with all my heart. By insulting you, I have put myself on a level with you, and of course cannot refuse to meet you on your own terms. Come along, sir.” The men were dismissed; and Col. Grant, accompanied by his adversary and some mutual friends, repaired to the mess-room, where he very speedily closed up Mr. Mulcahy’s peepers, and sent him home perfectly satisfied. That was the proudest day of Mulcahy’s life, and many a time has he boasted of the black eye he got from a K.C.B., as if it were an honourable ordinary emblazoned upon his escutcheon. “Ever since that morning,” would he say, “let me meet Sir Colquhoun Grant, where I might, in town or country, among lords or ladies, dressed in plain clothes or dizened out in gold and scarlet, he would give me his hand and say,‘How are you, Billy?’”\n\nIn Aug., 1808, Grant was appointed lt.-col. of the 15th Lt. Dns., and served in the Pa. Had five horses shot under him at Waterloo. G.C.B., G.C.H. Col.-in-Chf. 15th Hussars, 1827. Lt.-Gen. Succeeded to a large property at Frampton, co. Dorset, 1833, M. Marcia, dau. of 24Rev. J. Richards, of Long Bredy, co. Dorset, and had an only surviving child, Marcia, who eloped with Richard Brinsley Sheridan in May 1835. Sir C. Grant d., 20th Dec., 1835.\n\nAIDE-DE-CAMP.\n\nLt. R. Mansfield, 15th Hussars, W.\n\nEldest son of Francis Mansfield, of Castle Wray, by Margaret West, grand-dau. of John Leonard, of co. Fermanagh. Left the army soon after obtaining his troop in 15th Hussars. D. 12th Nov., 1854.\n\nEXTRA AIDE-DE-CAMP.\n\nCapt. W. Moray, 17th Lt. Dns., W.\n\nRepresentative and possessor of the estates of the ancient House of Abercairnie. 2nd son of Col. Charles Moray, by the elder dau. and heir of Sir Wm. Stirling, Bart., of Ardoch. Promoted brevet maj. 19th June, 1817. Placed on h. p., 10th Nov., 1821. Succeeded his elder brother in 1840. Assumed the additional surname of Stirling. M. the Hon. Fanny Douglas, dau. of Archibald, Lord Douglas. D. s. p., 9th Feb., 1850.\n\nMAJOR OF BRIGADE.\n\nCapt. Jones, h. p.\n\nCapt. Charles Jones, of 15th Hussars, was placed on h. p. in 1814. He appears to have been brought back to f. p. after 1817 as capt. in the York Chasseurs, and to have been again placed on h. p., 29th March, 1821. In 1830 his name was still on h. p. list.\n\nMAJOR-GENERAL.\n\nSir James Lyon, K.C.B.\n\nIt is to be recorded of this officer that he had served on board the fleet under Lord Howe, and was present at the glorious action of 1st June, 1794—his regt. being at that time employed as marines. Was with the reserve at Hal, and did not share in the great battle of 18th June. G.C.H. Governor of Barbadoes, 1828. Col.-in-Chf., 24th Foot, 1829. D. at Brighton, 14th Oct., 1844.\n\nAIDE-DE-CAMP.\n\nLt. Jas. McGlashan, 2nd Lt. Batt. K.G.L.\n\nPromoted capt. in same regt., 22nd Aug., 1815. Exchanged with Capt. Richter, of 1st Ceylon Regt., 25th Dec., 1815. Left the army soon after 1817.\n\nMAJOR OF BRIGADE.\n\nCapt. Richter, 1st Ceylon Regt.\n\nGeorge Richter was placed on h. p. from 2nd Lt. Batt. K.G.L., 24th Feb 1816. Was on the h. p. list in 1830. D. as bt. maj. 23rd May, 1833.\n\n25 MAJOR-GENERAL.\n\nMajor-Gen. Peregrine Maitland.\n\nSon of Thos. Maitland, of Shrubs Hall, in the New Forest. Joined the 1st Regt. of Foot Guards in 1792. Commanded the 1st Brigade of Guards at the battle of Nive. The example he set, both at Quatre Bras and Waterloo, had much to do with the victory then obtained over the French. When Napoleon’s “Old Guard” made that gigantic and final effort, on the evening of June 18th, to retrieve the fortunes of the day, it was Maitland’s brigade which checked their advance and drove them headlong down the bloody slope. “Now, Maitland, now’s your time!” said Wellington, as the leading column of the French Guards approached the crest of the slope where the British Guards were stationed—the front rank kneeling. How Maitland responded is told in the words of Col. J. H. Stanhope in his letter to the Duke of York:—“Were it possible for me to add anything to the reputation of Maitland by stating the gallantry he has shown, cheering on with his hat off, I could dwell long on the subject.” Made K.C.B., 22nd June, 1815. Received the Russian Order of St. Vladimir and the Dutch Order of Wilhelm. C.-in-C. at Madras, 1836. Gov. and C.-in-C. at Cape of Good Hope, 1843. Col.-in-Chf., 17th Foot same year. M. firstly, 1803, Hon. Louisa, 2nd dau. of Sir Edward and the Baroness Crofton. She d. 1805. He m. secondly, in 1815, Lady Sarah Lennox, 2nd dau. of 4th Duke of Richmond. D., 30th May, 1854.\n\nAIDE-DE-CAMP.\n\nEns. Lord Hay, 1st Ft. Gds., K.\n\nKilled at Quatre Bras. Had ridden and won a race at the Grammont Races on 13th June, and was dead on the 16th. Was acting as adjutant to Lord Saltoun. His horse, a fine thoroughbred, refused a fence, and tried to wheel round. As Lord Saltoun was passing down a path close by, a body fell across his horse’s neck and rolled off. It was poor Hay, who had been picked off by a French cavalry skirmisher, who was, in his turn, shot dead by a Grenadier. James, Lord Hay, eldest son of William, 16th Earl of Errol, by his 2nd wife—Alicia, youngest dau. of Samuel Eliot, of the Island of Antigua—was born 7th July, 1797. In The History of the Grenadier Guards he is erroneously called “Lord James Hay.” The latter officer, also in the 1st Guards, lived for many years afterwards.\n\nMAJOR OF BRIGADE.\n\nCapt. J. Gunthorpe, 1st Ft. Gds.\n\nPromoted capt. and lt.-col., 26th Dec., 1821. Retired from the army, 1833. His elder brother, Lewis, of same regt., was killed in the campaign in Holland, 1799.\n\nMAJOR-GENERAL.\n\nMajor-Gen. G. Johnstone.\n\nGeorge Johnstone was appointed adt. in the Royal Marines, 5th March, 1776. Served at New York and Halifax, and was in several sea engagements in the Indian Ocean. In 1792 he received a company in the 26New South Wales Corps, and embarked for that colony, where he served several years. Being at Hal, with the Reserves, he was not present at Waterloo. In his obituary notice in the Scots’ Magazine , he is described of “Riggheads.” He d. in Edinburgh, 19th Dec., 1825.\n\nAIDE-DE-CAMP.\n\nCapt. C.G. Gray, 95th Foot.\n\nCharles George Gray served in the Pa., and was wounded at Badajoz. Promoted bt.-major 21st Jan., 1819. In 1830 was major on the unattached list, and on 27th May, 1836, became lt.-col. Retd. in 1837.\n\nMAJOR OF BRIGADE.\n\nCapt. S. Holmes, 78th Foot.\n\nServed in the Pa. and led a forlorn hope at Burgos. Stephen Holmes was placed on h. p. 25th April, 1816. Brought back to f. p. as capt. 90th Regt., 3rd Feb., 1820. R. h. p. with rank of major, 24th Dec., 1825. In 1838, as lt.-col., recd. the appointment of Dep. Inspector Gen. of the Irish Constabulary. K.H. D. in 1839.\n\nMAJOR-GENERAL.\n\nMajor-Gen. Frederick Adam, W.\n\nBn. 1781. 4th son of the Rt. Hon. Wm. Adam, of Blair Adam, Lord Lieut. for co. Kinross, by 2nd dau. of 10th Lord Elphinstone. Received an ensign’s commission in 1795, but continued his education and studied “the art of war” at the Milit. Academy, Woolwich. Made lieut. in the 26th Foot, 1796, and capt., 1799. Served with the 27th Foot in Holland from July to October, 1799, and was present in several actions. Served four months in 9th Foot, as capt., and then exchanged to the Coldstream Guards. Served in Egypt, and was promoted major in 1803, and in 1805, at age of 24, purchased the command of 21st Foot. Served in Sicily, and at battle of Maida. Appointed A.D.C. to the Prince Regent in 1811. In 1813 obtained command of a brigade in the army, and was sent to Spain. His command lay on the eastern side of the Pa., where there was a great lack of good commanders. Adam maintained his reputation, despite several reverses. When the French stormed and took Ordal, 12th Sept., 1813, he had his left arm broken and his left hand shattered. Made maj.-gen. 1814. The rout of the Old Guard at Waterloo by General Adam’s Brigade was the turning-point of the battle, and ensured victory. G.C.B., G.C.M.G., P.C., Gen. and Col.-in-Chf. 21st Foot. Gov. Ionian Islands. D. 17th Aug., 1853, very suddenly at Greenwich railway station. His widow d. 26th May, 1904.\n\nAIDE-DE-CAMP.\n\nLt. R.P. Campbell, 7th Foot.\n\nRobert Preston Campbell fired the last gun at Waterloo, and the gun was a French one! It was one of the guns captured by the 71st Regt. in the sauve qui peut of the French, and was turned against their retreating masses by some men of the 71st under Lieut. Torriano and discharged by Campbell (Siborne, vol. II., p. 234). Was placed on h. p. 25th Feb., 1816, but given a company in the Ceylon Rifles, 27th March, 1823. D., as capt. in that regt., 1825.\n\n27 EXTRA AIDE-DE-CAMP.\n\nCapt. C. Yorke, 52nd Foot.\n\nAftds. F.M. Sir Charles Yorke, G.C.B., Col.-in-Chf. Rifle Bde. Son of Col. Yorke (who had once held the appointment of Lieut. of the Tower), by Juliana, dau. of John Dodd. Placed on h. p. 25th Feb., 1816. Brought back to f. p. as capt. 52nd Regt. L.I., 2nd July, 1818. Succeeded Sir W. Gomm as Constable of the Tower. D. in London, 20th Nov., 1879, aged 90.\n\nMAJOR OF BRIGADE.\n\nMaj. Thos. Hunter-Blair, 91st Foot, W.\n\nA most gallant and able officer. Served in the Pa.; was wounded and made prisoner at Talavera, and detained in France until the peace of 1814. Made a bt.-lt.-col. for his services at Waterloo. He was brother to Sir David Hunter-Blair, 3rd Bart. of Dunskey, co. Wigtown, and m., 1820, Miss Eliza Norris. D. a maj.-gen. and C.B., 31st Aug., 1849, at Leamington.\n\nMAJOR-GENERAL.\n\nSir Colin Halkett, K.C.B., W.\n\nBn. 7th Sept., 1774. Eldest son of Frederick Halkett, a maj.-gen. in the British Service, who had also served in the Dutch army, by Georgina, dau. and heir of George Seton. Raised the German Legion, and served with distinction in the Pa. Had four horses shot under him at Waterloo. G.C.B. and G.C.H. Col.-in-Chf. 31st Regt., 1838. Gov. of Jersey and aftds. C.-in-C. at Bombay. M. Letitia (Crickett), widow of Capt. Tyler, R.A., and had issue. He d., 24th Sept, 1856, being then Gov. of Chelsea Hospital.\n\nAIDES-DE-CAMP.\n\nCapt. H. Marschalk, 1st Lt. Batt., K.G.L., K.\n\nHenry von Marschalk was killed whilst gallantly assisting Baron Baring to defend La Haye Sainte, which was captured by the French after a noble resistance.\n\nCapt. A. Home, 2nd Lt. Batt., K.G.L.\n\nAlexander Home was one of the many Scotchmen who had joined the German Legion. D., at Hanover, 12th Oct., 1821, as capt. in the Hanoverian Rifle Guards.\n\nMAJOR OF BRIGADE.\n\nCapt. W. Crofton, 54th Foot, K.\n\nWalter Crofton left a widow and four children. Pens. of £100 per ann. granted to Mrs. Harriet Crofton, the widow, whose maiden name was Wauchope. The late Rt. Hon. Sir Walter Frederick Crofton, born in 1815, was a son of the above gallant Irish officer.\n\n28 MAJOR-GENERAL.\n\nSir Hussey Vivian, K.C.B.\n\nRichard Hussey Vivian, eldest son of John Vivian, of Truro, Cornwall, Warden of the Stannaries, by Betsey, only surviving child of the Rev. Richard Cranch; was born 28th July, 1775, and entered the army as ensign in the 20th Foot, in July, 1793. Served in Holland in the campaigns of 1795 and 1799. On 1st Dec., 1804, was appointed a lt.-col. in 7th Lt. Dns. Served with his regt. in the retreat from Corunna. In 1813 commanded the 7th Dns. in the Pa., and in Nov. of same year was appointed to the command of a cavalry brigade, and was present at the battle of the Nive. Was sev. wnded. in the advance upon Toulouse. In the dispatch on this occasion, Lord Wellington observes: “Col. Vivian had an opportunity of making a most gallant attack upon a superior body of the enemy’s cavalry, which they drove through the village of Croix D’Orade.” When the 18th Hussars were approaching two squares of the Old Guard at Waterloo, Gen. Vivian rode up to the regt. with the brief address: “Eighteenth, you will follow me.” The 18th responded, in expressive language, that they were ready to follow the general anywhere. The charge was made on the cavalry and guns, and was eminently successful. G.C.B. and G.C.H. Was created a baronet 1828, and a baron in the peerage of England, 1841. Col.-in-Chf. 12th Dns. Master-Gen. of the Ordnance, 1835–41. Was twice married, and left issue by both wives. D., 20th Aug., 1842.\n\nAIDE-DE-CAMP.\n\nCapt. Edward Keane, 7th Hussars.\n\nMade a bt.-maj. for his services at Waterloo. 3rd son of Sir John Keane, 1st Bart., by Sarah, dau. of John Kelly. His elder brother, General Sir John Keane, was created a peer of England, as Baron Keane of Ghuznee, in Afghanistan, 1839. Was lt.-col. of 6th Dns., 1825–33. R. h. p. 29th March, 1833. Reappointed to the Gren. Guards, and retd., in 1838, as col. D., 2nd Nov., 1866. M., 17th Jan., 1818, Anna, 3rd dau. of Sir Wm. Fraser, Bart., of Ledechune, co. Inverness.\n\nEXTRA AIDE-DE-CAMP.\n\nLt. C.A. Fitzroy, R.H. Gds.\n\nAftds. Lt.-Col. Sir Charles Augustus Fitz-roy, K.C.B. and K.C.H., Capt. Gen. and Gov. of New South Wales. Eldest son of Lord Charles Fitz-roy, by Frances, dau. of Edward Miller Mundy, of Shipley, co. Derby. Bn. 10th June, 1796. Placed on h. p. as lt.-col. in 1825. M., 1st, 11th March, 1820, Lady Mary Lennox, eldest dau. of 4th Duke of Richmond, and had issue. He d., 16th Feb., 1858.\n\nMAJOR OF BRIGADE.\n\nCapt. Thos. Noel Harris, h. p., W.\n\nSon of Rev. Hamlyn Harris, rector of Whitehall, co. Rutland. Served in the Pa. Went to Germany in 1813, and served with the Prussian army until the surrender of Paris in 1814. Was at Leipsic and all the battles with Blucher in 1814. Sent to London by lt.-gen. Sir Charles Stewart 30th March, 1814, with despatches announcing the taking of 29Paris by the Allied Sovereigns. Recd. the Prussian Order of Merit, and the Russian Orders of St. Anne and St. Vladimir, for his services with the Allied Army. Lost his right arm at Waterloo, and was otherwise severely wounded. R. h. p. 1830, as col. K.C.H. Was chief magistrate at Gibraltar for some years, and a groom of His Majesty’s Privy Chamber. Was married three times. His first wife was Mary Thomson (née White), widow of Robert Thomson, of Camphill, co. Renfrew. D., at Updown, Eastry, 23rd March, 1860. An interesting memoir of Sir T.N. Harris was compiled by C.B. Harris, Esq., grandson of the above veteran.\n\nADJUTANT-GENERAL.\n\nMaj.-Gen. Sir Edward Barnes, K.C.B., W.\n\nKnown at Waterloo as “our fire eating adjutant-general.” His family appears to have been of Irish extraction. His father was a brother of the Robert Barnes whose two daughters and co-heirs married into the good old family of Johnston, of Kilmore, co. Armagh. In 1794 we find Edwd. Barnes maj. in 99th Foot. As lt.-col. of 46th Foot, he comded. a bde. at the capture of Martinique and Guadaloupe. Served on the staff in Spain and Portugal, and comded. a bde. at the battles of Vittoria, Pyrenees, Nivelle, Nive and Orthes. His forward gallantry, on 2nd August, 1813, on the Heights of Eschalar, when, with a small force, he attacked a large part of the French army, in a strong position, occasioned a distinguished officer to say: “Barnes set at the French as if every man had been a bull-dog and himself the best bred of all.” In 1819 was on the staff in Ceylon, and in 1824 was appointed Gov. of that island. Held this appointment until 1831, and so endeared himself to the natives that his departure was universally lamented, and a monument was erected in his honour. Was C.-in-C. in India from 1831 to May, 1833, with the local rank of general. M.P. for Sudbury. G.C.B. and Col.-in-Chf. 78th Regt. It is worthy of note that the present Army and Navy Club owed its existence to the joint exertions of Sir Edward Barnes and Adml. Bowles, who may be termed the founders of this club. Sir Edward m., in 1824, Maria, eldest dau of Walter Fawkes, of Farnley Hall, Otley, and had issue. D. in London, 19th March, 1838.\n\nAIDE-DE-CAMP.\n\nMaj. Andrew Hamilton, 4th W.I. Regt.\n\nMade a bt. lt.-col. for Waterloo. M. 1816, Anne, eldest dau. of Wm. Ord, of Fanham, Newminster Abbey, and Whitfield, co. Northumberland, and had issue. Served as A.D.C. to Sir Edward Barnes in Ceylon, and d. 1821.\n\nDEPUTY ADJUTANT-GENERAL.\n\nCol. Sir John Elley, K.C.B., R.H. Gds., W.\n\nThis distinguished general entered the army as a private soldier and rose by his own merits. He commanded the rear guard of the cavalry at Talavera. Was employed on the staff from 1807 to 1819, when he resumed the command of his old regt.—the Horse Guards. K.C.B.; K.C.H.; K.M.T., &c. Lt.-Gen. and Col.-in-Chf. 7th Hussars. He represented Windsor in Sir Robert Peel’s Govt. D. 23rd Jan., 1839, unm., at 30Chalderton Lodge, near Amesbury. Left large bequests to charities; also money to provide plate for the 7th Hussars and 17th Lancers.\n\nASSISTANT ADJUTANTS-GENERAL.\n\nLt.-Col. J. Waters, Unattached, W.\n\nAfterwards Lt.-Gen. Sir John Waters, K.C.B. In the Par. War he was attached to the Portuguese army and was taken prisoner. When Wellington heard of this officer’s capture, he quietly remarked, “Col. Waters will not remain long in the hands of the enemy.” Being a reckless and dare-devil rider Waters made so sure of his speedy escape that he mockingly told his captors they would not have him on their hands for long. Such proved the case, for having managed to get his spurs sharpened, he literally “rode away” from his pursuers one fine morning, and they saw him no more. D. 21st Nov., 1842. His heir was his brother Edmond Thomas Waters, of Tyvree and Stormy, co. Glamorgan, who d. 1848, leaving issue.\n\nLt.-Col. Sir George H. Berkeley, K.C.B., 35th Foot, W.\n\nEldest son of Adml. Sir George Berkeley. Served in the Pa. Was for a short time Surveyor-Gen. of the Ordnance, and M.P. for Devonport. D. a maj.-gen. and col. of the 35th Foot, 25th Sept., 1857.\n\nLt.-Col. Sir Guy Campbell, Bt., 6th Foot.\n\nEldest son of Lt.-Gen. Colin Campbell, lt.-gov. of Gibraltar, by Mary, eldest dau. and co-heir of Col. Guy Johnson. Entered the 6th Foot, of which Gen. Colin Campbell was col., at an early age; and for his distinguished conduct in the Pa., when serving as maj. of the 6th Foot, was created a baronet in May, 1815: C.B. and gold medal for the Pyrenees. M., 1st, the eldest dau. and co-heir of Montagu Burgoyne, of Marks Hall, and had issue. M., 2ndly, in 1820, Pamela, eldest dau. of the late Lord Edward Fitz-gerald, and had issue. Maj.-gen. in the army. D. at Kingstown, Ireland, 25th Jan., 1849.\n\nLt.-Col. Sir Noel Hill, K.C.B., 1st Ft. Gds.\n\nAfterwards lt.-col. of the 13th Lt. Dns., and commandant of the Cavalry Depôt. Bn. 24th Feb., 1784. 7th son of Sir John Hill, Bart., and brother of Lord Hill. Served with distinction in the Pa., and commanded the 1st Portuguese Regiment, which he soon brought into a state of efficiency. In 1814 was transferred to a company in the 1st Foot Guards. Made K.C.B. and K.T.S., and after Waterloo was nominated a Knight of the Bavarian Order of Maximilian Joseph. Appointed D.A.G. in Canada, 1827. Succeeded Sir John Brown in the command of the cavalry depôt at Maidstone, and d. there, 8th Jan., 1832. Bd. with military honours at Maidstone. By his wife (4th dau. of 1st Baron Teignmouth), Sir Noel left several children.\n\nLt.-Col. D. Barclay, 1st Ft. Gds.\n\nCol. Delancey Barclay, C.B., was for some years A.D.C. to the King and to the Duke of York. He d. at his house at Tillingbourne, near Dorking, 29th March, 1826.\n\nLt.-Col. H. Rooke, 3rd Ft. Gds.\n\nAfterwards Maj.-Gen. Sir Henry Willoughby Rooke, C.B., and K.C.H., of Martinsherne, Berks, and afterwards of Pilston House, co. Monmouth. Bn. 2nd August, 1782. Younger son of Col. Charles Rooke (who raised 31a regiment called the “Windsor Volunteers,” and was allowed by George III. to reside in the “Stone Tower” of Windsor Castle, where he d., 1827) by Elizabeth, dau. of Ambrose Dawson, of Langcliffe and Bolton Hall, co. York, by Mary, sister of Sir Willoughby Aston, Bart. The Rookes have been in the army for six successive generations: and that distinguished sailor, Adm. Sir George Rooke, who took Gibraltar in 1704, also belonged to this family. Sir H.W. Rooke m., in 1804, his first cousin, Selina Rooke (dau. and heir of Henry Rooke), and had issue. He d. 2nd May, 1869.\n\nLt.-Col. E. Currie, 90th Foot, K.\n\nEdward Currie, junior maj. of the 90th Foot, and bt. lt.-col., was a scion of the Annandale family of that name who resided at Dalebank. He was the tenth of a family who had sacrificed their home in their country’s service. Received his first commission when only thirteen, from the Duke of York, in consequence of the meritorious services of his father in the army. Fought under Abercromby in Egypt, and was A.D.C. to Lord Hill in the Pa. Received the thanks of the C.-in-C. for his bravery at Talavera, Almarez, and Aroyo de Molinos.\n\nMaj. A. Wylly, 7th Foot.\n\nAfterwards Lt.-Col. Alexander Campbell Wylly, C.B., of the 95th Regt. Served in Spain and Portugal as A.D.C. to Sir Edward Pakenham; also in the American campaign in similar capacity. Sent home after Pakenham’s death with despatches from Sir John Lambert, in which he (Wylly) was very honourably named. D. in Malta, 10th Nov., 1827.\n\nMaj. G. Evatt, 55th Foot.\n\nCol. George Evatt began his military career as a private in a foot regt. His gallantry and ability, shown in many engagements, procured him a commission, and he became capt. and bt.-major in the 55th Regt. On 25th June, 1816, he was appointed commandant of the Royal Military Asylum, Southampton, and d. there, 29th Oct., 1840.\n\nMaj. W. Darling, h. p.\n\nWm. Lindsay Darling served at the reduction of Guadaloupe in 1810, and during the latter part of the Par. War was on the staff. Was A.A.G. to Sir C. Colville’s division in June, 1815, and served at the storming of Cambray. Attained the rank of gen. and was appointed Col.-in-Chf. 98th Regt. in 1854. D. 7th Jan., 1864.\n\nMaj. F. Breymann, 2nd Lt. Batt., K.G.L.\n\nFrederick Leopold Breymann served in the Pa., and was wounded both at Talavera and Burgos. Placed on h. p. as maj. in Feb., 1816. Made C.B. for Waterloo. D. at Tesperhude, near Lauenburg, Denmark, 24th Jan., 1821.\n\nDEPUTY-ASSISTANT ADJUTANTS-GENERAL.\n\nCapt. the Hon. E.S. Erskine, 60th Foot, W.\n\nEsme Stuart Erskine was sev. wnded. and taken prisoner on 17th June, 1815. He was brought before Napoleon, who asked him many questions, and showed a perfect knowledge of the strength of the British army. The conversation being ended, Erskine was put in charge of a guard, and a surgeon sent to attend to his wounded arm, which had to 32be amputated. Bn. 1789. 4th son of Baron Erskine, Lord Chancellor, by Frances, dau. of Daniel Moore, M.P. Was promoted bt.-maj. for Waterloo, and transferred, in 1816, to 2nd Ceylon Regt. and made bt. lt.-col. same year. M., 1809, Eliza, dau. of Lt.-Col. Smith, and had issue. D. 26th August, 1817.\n\nCapt. Lord Charles Fitzroy, 1st Ft. Gds.\n\n2nd son of 4th Duke of Grafton by Lady Charlotte Waldegrave. Bn. 28th Feb., 1791. Served in the Pa. R. h. p. as maj. and bt. lt.-col. 27th Foot, 1821. M.P. Bury St. Edmunds. Vice-Chamberlain of the Household. M. 25th Oct., 1825, Lady Anne Cavendish, 2nd dau. of 1st Earl of Burlington, and had issue. D. at Hampton, 17th June, 1865.\n\nCapt. C.A.F. Bentinck, 2nd Ft. Gds.\n\nMade bt.-maj. for Waterloo. 2nd son of John Charles Bentinck, a count of the Roman Empire, by Lady Jemima de Ginkel, dau. of the Earl of Athlone. Bn. 4th March, 1792. Served in Pa., and under Lord Lynedoch in Flanders, as adjt. of his regt. Attained rank of lt.-gen. and Col.-in-Chf. 12th Foot in 1857. M. 30th Jan., 1846, Countess Caroline, eldest dau. of Count of Waldeck-Pyrmont, and had issue. D. 28th Oct., 1864.\n\nCapt. George Black, 54th Foot.\n\nD. as capt. in same regt. in 1825.\n\nCapt. H.S. Blanckley, 23rd Foot.\n\nHenry Stanyford Blanckley was promoted brevet-maj. 21st June, 1817. Exchanged to the 13th Lt. Dns., and d. 1820.\n\nCapt. Hon. Wm. Curzon, 69th Foot, K.\n\nThird son of Nathaniel, 2nd Baron Scarsdale, by his 2nd wife (Felicité de Wattines). He met his fate at Waterloo with almost “military glee.” In falling from his horse, he called out gaily to Lord March, who had been galloping by his side, “Good bye, dear March.”\n\nLt. Jas. Henry Hamilton, 46th Foot, W.\n\nPromoted captain 26th March, 1823, and transferred to 45th Regiment. D. 3rd Jan. 1827.\n\nLt. John Harford, 7th Rl. Veteran Batt.\n\nProbably rose from the ranks. His name is not in the 1812 Army List . His regt. was reduced in 1816, and he was placed on ret. f. p., which denoted distinguished service. In the Army List for 1824, and succeeding years, his name is spelt “Hurford.” D. 1839.\n\nLt. E. Gerstlacher, 3rd Hussars, K.G.L.\n\nEberhard Gerstlacher joined the K.G.L. in March, 1813. Served in North Germany, 1813–14. Made brevet-capt. for Waterloo. Living at Carlsruhe in 1837.\n\nLt. Jas. Rooke, h. p.\n\nOnly son of Gen. James Rooke, Col.-in-Chf. 38th Regt., who was M.P. for co. Monmouth in five Parliaments, by Eliz. Brown. Lieut. Rooke was attached to the Prince of Orange’s staff at Waterloo, as an extra A.D.C. For his services on this occasion was appointed, 11th Aug., 1815, a lieut. in the Staff Corps of Cavalry. In 1817 he joined the 33Venezuelan Independent Army, and was given the rank of col. by Gen. Bolivar, who commanded the “Patriots.” D. of a wound received in action in 1819. Was twice married, and left issue by his 1st wife.\n\nDEPUTY JUDGE ADVOCATE.\n\nLt.-Col. Stephen Arthur Goodman, h. p.\n\nJunior maj. 48th Regt., 26th Dec., 1813. Placed on h. p. with brevet rank of lt.-col, in 1814. D. in British Guiana 2nd Jan., 1844, whilst holding the post of Vendue-Master of Demerara and Esequibo.\n\nDEPUTY QUARTERMASTER-GENERAL.\n\nCol. Sir Wm. Howe De Lancey, K.C.B., K.\n\nThe De Lanceys were descended from a wealthy Huguenot family, who went from Caen, in Normandy, to America, after the revocation of the Edict of Nantes. In the short space of sixty years this family produced three celebrated soldiers, viz., Gen. Oliver De Lancey, a leading American loyalist, who fought on the British side during the War of Independence, and, settling in England, d. at Beverley, 1785. In another generation, an Oliver De Lancey distinguished himself as a Christine leader in the Spanish war, and was killed at the siege of San Sebastian in 1837. The third distinguished soldier of this family was the above Wm. Howe De Lancey, who was only son of S. De Lancey, Gov. of Tobago, by Cornelia his wife, who d. in 1817. His early career was one of renown, and in 1799 we find him maj. of the 45th Regt., at the age of 21. On 4th April, 1815, he was married, in Scotland, to the beautiful Magdalen Hall, dau. of Sir James Hall, Bart., of Dunglass, by Lady Helen Douglas, dau. of 4th Earl of Selkirk. The return of Napoleon from Elba once more called De Lancey to the seat of war. Leaving his fair young wife, he proceeded, in May, to Brussels, whither he was followed, the first week in June, by his bride. At Waterloo, when riding by Wellington’s side, the wind of a cannon ball knocked him off his horse. This, it was afterwards found, had separated the ribs from the back-bone, and caused a fatal injury. Wellington caused De Lancey to be removed to a hut in a blanket. For some days hopes were entertained of his recovery, and he was devotedly nursed by his sorrow-stricken wife, whose perilous drive to the battle-field, and her experiences, were lately given in the Illustrated Naval and Military Magazine , from an old MS. narrative written by herself. After lingering ten days, the hero died.\n\n“Fair lady’s love, and splendid fame, De Lancey did enthral. His loyal heart alike they claim, They sigh to see him fall.”\n\nASSISTANT QUARTERMASTERS-GENERAL.\n\nCol. Hon. Alex. Abercromby, 2nd Ft. Gds., W.\n\nBn. 4th March, 1784. 4th son of Sir Ralph Abercromby, of Tullibody, who fell at Aboukir, by Mary Anne, dau. of John Menzies, of Ferntoun, Perthshire, who was created a baroness in 1801. As Lieut.-Col. of the 28th Foot, commanded a bde. in the Pa., and received the gold cross. K.T.S. Made C.B. for Waterloo. M.P. for Clackmannanshire, 1817–18. D. 27th Aug., 1853.\n\n34Col. F.E. Hervey, 14th Lt. Dns.\n\nAfterwards Col. Sir Felton Elwell Hervey-Bathurst, Bart. He was eldest son of Felton Lionel Hervey, by Selina, only dau. and heir of Sir John Elwell, Bart. After Waterloo was appointed A.D.C. to Wellington, which post he held during the British occupation in France. The following anecdote is from Reminiscences of Wellington and Anecdotes of his Staff , by Lord Wm. Lennox:—“Felton Hervey, of the 14th, who had lost an arm when in pursuit of the enemy flying from Oporto, always mounted himself and his orderly upon English hunters, so as to make his escape should he at any time be unexpectedly surrounded. Upon one occasion, when reconnoitring, Hervey rode up, by mistake, to a small detachment of French cavalry. Fortunately for him, the men were dismounted, and busily employed in cooking their rations; but no sooner was the colonel discovered, and his rank recognized, than the order to mount was given. Hervey and his orderly, finding the odds greatly against them, immediately started off at a tremendous pace to reach our lines. The French dragoons were quickly in their saddles, for the prize was worth gaining, and amidst wild shouts and loud halloes, gave chase to their flying foes. The noise attracted the attention of some of the enemy’s lancers, who, being posted nearer the English forces, were enabled to cut off the retreat of the fugitives. The clattering of the horses’ hoofs, who had thus joined in the pursuit, sounded like a death-knell to the two gallant soldiers. ‘Your only chance, colonel,’ said the faithful orderly, ‘is to make for that ravine.’ Hervey followed the suggestion; the ravine was narrow, with only room for one horse to enter. No sooner had he gained it than, on looking round, a terrible sight presented itself. The devoted soldier, knowing that the life of his commanding officer could alone be saved by the sacrifice of his own, had placed himself across the narrow opening, and was literally pierced and cut to pieces. The delay thus occasioned enabled Hervey to pursue his flight. Gaining the open, he charged a stiff fence, and was soon out of sight of his pursuers.” He m., 1817, Louisa Catherine, 3rd dau. of Richard Caton, of Maryland, U.S.A.; was created a baronet, with remainder to his brother Frederick, 3rd Oct., 1818, and d. s. p. 24th Sept., 1819.\n\nLt.-Col. Robt. Torrens, 1st W.I. Regt.\n\nAfterwards Lt.-Col. of 38th Regt. and Adjt.-Gen. in India. C.B. Belonged to the Londonderry family of this name, and was a near relative of Sir Henry Torrens, K.C.B., the Adjt.-Gen. In 1836 Col. Torrens was appointed a Commissioner by Parliament, for carrying out their scheme for the colonisation of South Australia.\n\nLt.-Col. Sir Charles Broke, K.C.B. (Permanent).\n\n2nd son of Philip Broke, of Nacton, Suffolk. Served in the expeditions to Hanover and South America; also in the Pa. K.C.B. in Jan., 1815. Decorated with the Russian Order of St. Vladimir and the Dutch Order of Wilhelm, for his gallantry at Waterloo. In 1822 took the surname of Vere, in addition to that of Broke. A.D.C. to King Wm. IV., and K.C.H.; M.P. for East Suffolk. His elder brother was created a bart. in 1813, in consideration of the gallant victory he had achieved 1st June, 1813, as capt. of the “Shannon” ship of war, over the American frigate “Chesapeake.” Sir C. Broke-Vere d. a maj.-gen. 1st April, 1843.\n\n35Lt.-Col. Sir Jeremiah Dickson, K.C.B. (Permanent).\n\nJoined the 2nd Dn. Gds., as cornet, in 1798. Served in the Pa., and was A.Q.M.G. to the army in Spain, and received the gold cross and one clasp. Promoted col. 27th May, 1825; appointed Q.M.G. in India, 12th July, 1827, maj.-gen. 1837, and Col.-in-Chf. 61st Regt., 1844. M. 15th March, 1818, Jemima, youngest dau. of Thos. Langford Brooke, of Mere Hall, co. Chester. Sir Jeremiah’s parentage is unknown, but from his Scripture name we may conclude that “Job Dickson,” ens. 67th Regt., in 1811, was a near relative. Sir Jeremiah d. in March, 1848.\n\nLt.-Col. Lord Greenock (Permanent).\n\nCharles Murray, Lord Greenock succeeded his father, in 1843, as 2nd Earl Cathcart, G.C.B., Gen. and Col.-in-Chf. 1st D.G. Received the gold medal for Barrosa. Gov. Edinburgh Castle, Comr. of the Forces and Gov.-Gen. in North America. Bn. 1783; d. at St. Leonard’s 16th July, 1859, having m., 30th Sept., 1818, in France, Henrietta, 2nd dau. of Thos. Mather, and left issue.\n\nLt.-Col. John George Woodford, 1st Ft. Gds.\n\nBn. at Chatham, 28th Feb., 1785. Younger son of Col. John Woodford, by his 2nd wife (Susan, dau. of Cosmo, Duke of Gordon) and widow of 9th Earl of Westmoreland. D.A.Q.M.G. at Corunna, and with Sir J. Moore when the latter was wounded. Wounded same day, and horse shot. Was attached to Gen. Sir C. Colville’s division, but was sent, on the evening of 17th June, by his gen. to Wellington, to ask him if the British troops at Hal should join the main army. Only reached Waterloo a few hours before the battle commenced. Acted as extra A.D.C. to Wellington at Waterloo. C.B. and Col. Maj.-Gen. in 1837. K.C.B. and K.C.H. D. 22nd March, 1879.\n\nLt.-Col. C. Grant, 11th Foot.\n\nColquhoun Grant joined the 11th Foot in 1795, and attained the rank of Lt. Col. of 54th Regt. in 1821. C.B. for Waterloo. Son of Duncan Grant, of Lingeston, N.B. D. at Aix-la-Chapelle in the spring of 1829.\n\nLt.-Col. Sir Wm. M. Gomm, K.C.B., 2nd Ft. Gds.\n\nAfterwards F.-M. Sir Wm. Maynard Gomm, G.C.B., Constable of the Tower and Col.-in-Chf. 13th Regt. L.I.; also D.C.L. and LL.D. This veteran soldier and philanthropist was son of Lieut.-Col. Wm. Gomm, who had served in America in the 46th Regt. The family is undoubtedly of French origin. As far back as 1685 we find Sir Bernard de Gomme appointed Master Surveyor of the Ordnance. Wm. M. Gomm entered the army, as ensign, in 1794, and at the age of 14 carried the colours of the 9th Foot—the Holy Boys—into action in Holland. Served in the Pa., and received the gold cross and one clasp. The charger he rode at Waterloo, by name “George,” survived until 1841, aged 33, and was buried under a stone seat in the garden at Stoke Park, near Windsor. The veteran charger’s veteran master held the high post of C.-in-C. in India, and received a F.-M.’s baton in Jan., 1868. He d. at Brighton, 15th March, 1875, full of years and good works. By his wife Eliz. (eldest dau. of Lord Robert Kerr), whom he m. in 1830, he had no issue.\n\nLt.-Col. Sir Henry Hollis Bradford, K.C.B., 1st Ft. Gds., W.\n\nBn. 25th June, 1781. 3rd and youngest son of Thos. Bradford, of Woodlands, near Doncaster and Ashdown Pk., co. Sussex, by Eliz., dau. of 36Wm. Otter, of Welham, co. Notts; served in the Pa., Knt. of the Dutch Order of Wilhelm, and of the Russian Order of St. Vladimir. D. at La Vacherie, near Lillière, France, 7th Dec., 1816, of wounds recd. at Waterloo. Bur. at Storrington, Sussex.\n\nLt.-Col. Sir George Scovell, K.C.B., h. p.\n\nAftds. G.C.B., Col.-in-Chf. 4th Lt. Dns., and Gov. Rl. Milit. College, Sandhurst. Served in the Pa., and was present at Corunna as D.A.Q.M.G. Recd. the gold cross and one clasp; also the silver war medal with eight clasps, and 4th class of St. Vladimir of Russia. D. at Henley Park, Guildford, 17th Jan., 1861.\n\nLt.-Col. D. Kelly, 73rd Foot.\n\nDawson Kelly joined the 47th Regt. as ens. in 1800. Became major of the 73rd in 1811. Towards the close of the battle of Waterloo a sergeant of his regt. came and told him that all the officers of the 73rd were killed or wounded. Although serving on the staff, Kelly immediately returned to take over the command. C.B. and bt.-lt.-col. On h. p. 15th Jan., 1818. Bt.-col. 1837. D. same year at Dungannon, Ireland. He was 5th son of Thos. Kelly, of Dawson’s Grove, co. Armagh, by his wife, Jane Waring. M.I. in Armagh Cathedral. Communicated by Lt.-Col. G.H. Johnston, late 15th Foot.\n\nMaj. W. Campbell, 23rd Foot.\n\nWas A.D.C. to Gen. Craufurd in the Pa. D. a C.B. and maj.-gen. 3rd June, 1852.\n\nMaj. Hon. George Lionel Dawson, 1st Dn. Gds., W.\n\n3rd son of John, 2nd Visct., and 1st Earl of Portarlington, by Lady Caroline Stuart, dau. of 3rd Earl of Bute. Bn. 28th Oct. 1788. Promoted bt.-lt.-col. 4th Dec., 1815. Placed on h. p. 17th Aug., 1820. C.B. Assumed the additional surname of Damer 14th March, 1829. M., 20th Aug., 1825, Mary, dau. of Lord Hugh Seymour, and had issue. D., 14th April, 1856.\n\nMaj. Chas. Beckwith, 95th Foot, W.\n\nSon of Capt. John Beckwith, 23rd Lt. Dns., and nephew of Sir George and Sir T.S. Beckwith. Bn. at Halifax, N.S., 2nd Oct., 1789. His mother was a sister of Judge Haliburton (Sam Slick). Brigade-maj. to the celebrated Light Division in the Pa. Lost his left leg at Waterloo. Was a frequent visitor at Apsley House. Being one day left alone in the Duke’s library his attention was called to Gilly’s Waldensee , which book graphically described the neglected state of the Waldensee inhabitants. His interest was touched, and soon after he took up his abode among those “primitive Christians of the Alps.” Beckwith did much for the good of the people, by whom he was greatly beloved. He d. as maj.-gen. at Torre, 19th July, 1862. See Memoir of General Beckwith, C.B. , by M. Meille, translated, London, 1873. Also Foster’s Yorkshire Pedigrees .\n\nCapt. Jas. Shaw, 43rd Foot.\n\nAftds. Sir James Shaw-Kennedy, K.C.B. Bn. 1788. Educated at the Military College at Marlow. Joined the 43rd L.I. as ens., 1805. Served with this regt. at Copenhagen, and proceeded to the Pa. in 1808. Served at Corunna, and in 1809 was adjt. Was A.D.C. to "}, {"url": "https://prabook.com/web/robert.mccall/1860372", "page_content": "Robert McCall\n\nQueen\"s Counsel\n\nJuly 9, 1849 (age 84) Lisburn, Company Antrim\n\nCalled to the Bar by the Middle Temple in 1871. In 1891, having already acquired a large junior practice, he took silk (that is, was appointed Queen\"s Counsel). He served in numerous cases involving the common law and, while not making the first rank of Winch and Candy, was a powerful and popular advocate. Politically, McCall was allied to the Unionist cause and was friendly with Lord James of Hereford. This friendship led to McCall\"s appointment as Attorney General and Queen\"s Serjeant to the Duchy of Lancaster. He was elected as a Bencher of the Middle Temple in 1918. He was a correspondent with The Times. There are three portraits of him in the National Portrait Gallery."}, {"url": "https://www.jewishvirtuallibrary.org/jessel-sir-george", "page_content": "Sir George Jessel was an English jurist, one of the country’s great lawmaking judges. Born in London, the son of a diamond merchant, Jessel was called to the bar in 1847, and became a Queen’s Counsel in 1865. He entered Parliament as Liberal member for Dover in 1868 and was appointed solicitor general in 1871, being the first Jew to hold ministerial office in England.\n\nIn 1873, he became master of the rolls. Jessel’s tenure of the office was marked by a succession of judgments which became notable precedents, and his contribution to the evolution of law and the development of the principles of equity was considerable. His judgments were short and clear and were hardly ever reversed on appeal.\n\nJessel was the organizer of the Court of Chancery in its modern form. A member of the council of Jews’ College from its inception in 1855 until 1863, Jessel helped to draft its original constitution. He was also vice president of the Anglo-Jewish Association. After Jessel’s death, a baronetcy was conferred on his son Sir Charles James Jessel (1860–1928) in recognition of his father’s services. The second son, Herbert Merton Jessel (1866–1950), was active in Conservative politics and was raised to the peerage as Lord Jessel in 1924. Frederick Henry Jessel (1859–1934), nephew of Sir George Jessel, compiled the standard English bibliography on playing cards (1905) and left his comprehensive collection on the subject to the Bodleian Library, Oxford. Richard Frederick Jessel (1902–1988), a great-nephew of Sir George Jessel, was among the British naval heroes of World War II. Richard’s son Toby Jessel (1934–) was a Conservative member of Parliament from 1970 to 1997. The connection of the family with the Jewish community became very slight."}, {"url": "https://www.britannica.com/biography/Bertrand-Russell", "page_content": "As a founding figure of the analytic movement in philosophy, Bertrand Russell helped to transform the substance, character, and style of philosophy in the English-speaking world. He was also one of the greatest logicians of the 20th century. An outspoken social reformer, he campaigned effectively against unjust and irrational impediments to human freedom and happiness.\n\nDuring his childhood Bertrand Russell was educated at home. In 1890 he entered Trinity College, Cambridge , where he studied mathematics and philosophy , graduating with first-class honours in both (1893 and 1894, respectively) and winning a fellowship in the latter in 1895. That year he briefly attended lectures in economics at the University of Berlin .\n\nBertrand Russell’s childhood was grief-stricken and lonely. His mother and sister died when he was two years old, and his father died some 18 months later. He and his brother, Frank, were cared for by their paternal grandparents, but their grandfather died soon after Bertrand’s sixth birthday. Educated at home, he was isolated from other children.\n\nBertrand Russell, in full Bertrand Arthur William Russell, 3rd Earl Russell of Kingston Russell, Viscount Amberley of Amberley and of Ardsalla, (born May 18, 1872, Trelleck, Monmouthshire, Wales—died February 2, 1970, Penrhyndeudraeth, Merioneth), British philosopher, logician, and social reformer, founding figure in the analytic movement in Anglo-American philosophy, and recipient of the Nobel Prize for Literature in 1950. Russell’s contributions to logic, epistemology, and the philosophy of mathematics established him as one of the foremost philosophers of the 20th century. To the general public, however, he was best known as a campaigner for peace and as a popular writer on social, political, and moral subjects. During a long, productive, and often turbulent life, he published more than 70 books and about 2,000 articles, married four times, became involved in innumerable public controversies, and was honoured and reviled in almost equal measure throughout the world. Russell’s article on the philosophical consequences of relativity appeared in the 13th edition of the Encyclopædia Britannica.\n\nRussell was born in Ravenscroft, the country home of his parents, Lord and Lady Amberley. His grandfather, Lord John Russell, was the youngest son of the 6th Duke of Bedford. In 1861, after a long and distinguished political career in which he served twice as prime minister, Lord Russell was ennobled by Queen Victoria, becoming the 1st Earl Russell. Bertrand Russell became the 3rd Earl Russell in 1931, after his elder brother, Frank, died childless.\n\nBritannica Quiz Philosophy 101\n\nRussell’s early life was marred by tragedy and bereavement. By the time he was age six, his sister, Rachel, his parents, and his grandfather had all died, and he and Frank were left in the care of their grandmother, Countess Russell. Though Frank was sent to Winchester School, Bertrand was educated privately at home, and his childhood, to his later great regret, was spent largely in isolation from other children. Intellectually precocious, he became absorbed in mathematics from an early age and found the experience of learning Euclidean geometry at the age of 11 “as dazzling as first love,” because it introduced him to the intoxicating possibility of certain, demonstrable knowledge. This led him to imagine that all knowledge might be provided with such secure foundations, a hope that lay at the very heart of his motivations as a philosopher. His earliest philosophical work was written during his adolescence and records the skeptical doubts that led him to abandon the Christian faith in which he had been brought up by his grandmother.\n\nIn 1890 Russell’s isolation came to an end when he entered Trinity College, University of Cambridge, to study mathematics. There he made lifelong friends through his membership in the famously secretive student society the Apostles, whose members included some of the most influential philosophers of the day. Inspired by his discussions with this group, Russell abandoned mathematics for philosophy and won a fellowship at Trinity on the strength of a thesis entitled An Essay on the Foundations of Geometry, a revised version of which was published as his first philosophical book in 1897. Following Kant’s Critique of Pure Reason (1781, 1787), this work presented a sophisticated idealist theory that viewed geometry as a description of the structure of spatial intuition.\n\nIn 1896 Russell published his first political work, German Social Democracy. Though sympathetic to the reformist aims of the German socialist movement, it included some trenchant and farsighted criticisms of Marxist dogmas. The book was written partly as the outcome of a visit to Berlin in 1895 with his first wife, Alys Pearsall Smith, whom he had married the previous year. In Berlin, Russell formulated an ambitious scheme of writing two series of books, one on the philosophy of the sciences, the other on social and political questions. “At last,” as he later put it, “I would achieve a Hegelian synthesis in an encyclopaedic work dealing equally with theory and practice.” He did, in fact, come to write on all the subjects he intended, but not in the form that he envisaged. Shortly after finishing his book on geometry, he abandoned the metaphysical idealism that was to have provided the framework for this grand synthesis.\n\nRussell’s abandonment of idealism is customarily attributed to the influence of his friend and fellow Apostle G.E. Moore. A much greater influence on his thought at this time, however, was a group of German mathematicians that included Karl Weierstrass, Georg Cantor, and Richard Dedekind, whose work was aimed at providing mathematics with a set of logically rigorous foundations. For Russell, their success in this endeavour was of enormous philosophical as well as mathematical significance; indeed, he described it as “the greatest triumph of which our age has to boast.” After becoming acquainted with this body of work, Russell abandoned all vestiges of his earlier idealism and adopted the view, which he was to hold for the rest of his life, that analysis rather than synthesis was the surest method of philosophy and that therefore all the grand system building of previous philosophers was misconceived. In arguing for this view with passion and acuity, Russell exerted a profound influence on the entire tradition of English-speaking analytic philosophy, bequeathing to it its characteristic style, method, and tone.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nInspired by the work of the mathematicians whom he so greatly admired, Russell conceived the idea of demonstrating that mathematics not only had logically rigorous foundations but also that it was in its entirety nothing but logic. The philosophical case for this point of view—subsequently known as logicism—was stated at length in The Principles of Mathematics (1903). There Russell argued that the whole of mathematics could be derived from a few simple axioms that made no use of specifically mathematical notions, such as number and square root, but were rather confined to purely logical notions, such as proposition and class. In this way not only could the truths of mathematics be shown to be immune from doubt, they could also be freed from any taint of subjectivity, such as the subjectivity involved in Russell’s earlier Kantian view that geometry describes the structure of spatial intuition. Near the end of his work on The Principles of Mathematics, Russell discovered that he had been anticipated in his logicist philosophy of mathematics by the German mathematician Gottlob Frege, whose book The Foundations of Arithmetic (1884) contained, as Russell put it, “many things…which I believed I had invented.” Russell quickly added an appendix to his book that discussed Frege’s work, acknowledged Frege’s earlier discoveries, and explained the differences in their respective understandings of the nature of logic.\n\nThe tragedy of Russell’s intellectual life is that the deeper he thought about logic, the more his exalted conception of its significance came under threat. He himself described his philosophical development after The Principles of Mathematics as a “retreat from Pythagoras.” The first step in this retreat was his discovery of a contradiction—now known as Russell’s Paradox—at the very heart of the system of logic upon which he had hoped to build the whole of mathematics. The contradiction arises from the following considerations: Some classes are members of themselves (e.g., the class of all classes), and some are not (e.g., the class of all men), so we ought to be able to construct the class of all classes that are not members of themselves. But now, if we ask of this class “Is it a member of itself?” we become enmeshed in a contradiction. If it is, then it is not, and if it is not, then it is. This is rather like defining the village barber as “the man who shaves all those who do not shave themselves” and then asking whether the barber shaves himself or not.\n\nAt first this paradox seemed trivial, but the more Russell reflected upon it, the deeper the problem seemed, and eventually he was persuaded that there was something fundamentally wrong with the notion of class as he had understood it in The Principles of Mathematics. Frege saw the depth of the problem immediately. When Russell wrote to him to tell him of the paradox, Frege replied, “arithmetic totters.” The foundation upon which Frege and Russell had hoped to build mathematics had, it seemed, collapsed. Whereas Frege sank into a deep depression, Russell set about repairing the damage by attempting to construct a theory of logic immune to the paradox. Like a malignant cancerous growth, however, the contradiction reappeared in different guises whenever Russell thought that he had eliminated it.\n\nEventually, Russell’s attempts to overcome the paradox resulted in a complete transformation of his scheme of logic, as he added one refinement after another to the basic theory. In the process, important elements of his “Pythagorean” view of logic were abandoned. In particular, Russell came to the conclusion that there were no such things as classes and propositions and that therefore, whatever logic was, it was not the study of them. In their place he substituted a bewilderingly complex theory known as the ramified theory of types, which, though it successfully avoided contradictions such as Russell’s Paradox, was (and remains) extraordinarily difficult to understand. By the time he and his collaborator, Alfred North Whitehead, had finished the three volumes of Principia Mathematica (1910–13), the theory of types and other innovations to the basic logical system had made it unmanageably complicated. Very few people, whether philosophers or mathematicians, have made the gargantuan effort required to master the details of this monumental work. It is nevertheless rightly regarded as one of the great intellectual achievements of the 20th century.\n\nPrincipia Mathematica is a herculean attempt to demonstrate mathematically what The Principles of Mathematics had argued for philosophically, namely that mathematics is a branch of logic. The validity of the individual formal proofs that make up the bulk of its three volumes has gone largely unchallenged, but the philosophical significance of the work as a whole is still a matter of debate. Does it demonstrate that mathematics is logic? Only if one regards the theory of types as a logical truth, and about that there is much more room for doubt than there was about the trivial truisms upon which Russell had originally intended to build mathematics. Moreover, Kurt Gödel’s first incompleteness theorem (1931) proves that there cannot be a single logical theory from which the whole of mathematics is derivable: all consistent theories of arithmetic are necessarily incomplete. Principia Mathematica cannot, however, be dismissed as nothing more than a heroic failure. Its influence on the development of mathematical logic and the philosophy of mathematics has been immense.\n\nDespite their differences, Russell and Frege were alike in taking an essentially Platonic view of logic. Indeed, the passion with which Russell pursued the project of deriving mathematics from logic owed a great deal to what he would later somewhat scornfully describe as a “kind of mathematical mysticism.” As he put it in his more disillusioned old age, “I disliked the real world and sought refuge in a timeless world, without change or decay or the will-o’-the-wisp of progress.” Russell, like Pythagoras and Plato before him, believed that there existed a realm of truth that, unlike the messy contingencies of the everyday world of sense-experience, was immutable and eternal. This realm was accessible only to reason, and knowledge of it, once attained, was not tentative or corrigible but certain and irrefutable. Logic, for Russell, was the means by which one gained access to this realm, and thus the pursuit of logic was, for him, the highest and noblest enterprise life had to offer.\n\nIn philosophy the greatest impact of Principia Mathematica has been through its so-called theory of descriptions. This method of analysis, first introduced by Russell in his article “On Denoting” (1905), translates propositions containing definite descriptions (e.g., “the present king of France”) into expressions that do not—the purpose being to remove the logical awkwardness of appearing to refer to things (such as the present king of France) that do not exist. Originally developed by Russell as part of his efforts to overcome the contradictions in his theory of logic, this method of analysis has since become widely influential even among philosophers with no specific interest in mathematics. The general idea at the root of Russell’s theory of descriptions—that the grammatical structures of ordinary language are distinct from, and often conceal, the true “logical forms” of expressions—has become his most enduring contribution to philosophy.\n\nRussell later said that his mind never fully recovered from the strain of writing Principia Mathematica, and he never again worked on logic with quite the same intensity. In 1918 he wrote Introduction to Mathematical Philosophy, which was intended as a popularization of Principia, but, apart from this, his philosophical work tended to be on epistemology rather than logic. In 1914, in Our Knowledge of the External World, Russell argued that the world is “constructed” out of sense-data, an idea that he refined in The Philosophy of Logical Atomism (1918–19). In The Analysis of Mind (1921) and The Analysis of Matter (1927), he abandoned this notion in favour of what he called neutral monism, the view that the “ultimate stuff” of the world is neither mental nor physical but something “neutral” between the two. Although treated with respect, these works had markedly less impact upon subsequent philosophers than his early works in logic and the philosophy of mathematics, and they are generally regarded as inferior by comparison.\n\nConnected with the change in his intellectual direction after the completion of Principia was a profound change in his personal life. Throughout the years that he worked single-mindedly on logic, Russell’s private life was bleak and joyless. He had fallen out of love with his first wife, Alys, though he continued to live with her. In 1911, however, he fell passionately in love with Lady Ottoline Morrell. Doomed from the start (because Morrell had no intention of leaving her husband), this love nevertheless transformed Russell’s entire life. He left Alys and began to hope that he might, after all, find fulfillment in romance. Partly under Morrell’s influence, he also largely lost interest in technical philosophy and began to write in a different, more accessible style. Through writing a best-selling introductory survey called The Problems of Philosophy (1911), Russell discovered that he had a gift for writing on difficult subjects for lay readers, and he began increasingly to address his work to them rather than to the tiny handful of people capable of understanding Principia Mathematica.\n\nIn the same year that he began his affair with Morrell, Russell met Ludwig Wittgenstein, a brilliant young Austrian who arrived at Cambridge to study logic with Russell. Fired with intense enthusiasm for the subject, Wittgenstein made great progress, and within a year Russell began to look to him to provide the next big step in philosophy and to defer to him on questions of logic. However, Wittgenstein’s own work, eventually published in 1921 as Logisch-philosophische Abhandlung (Tractatus Logico-Philosophicus, 1922), undermined the entire approach to logic that had inspired Russell’s great contributions to the philosophy of mathematics. It persuaded Russell that there were no “truths” of logic at all, that logic consisted entirely of tautologies, the truth of which was not guaranteed by eternal facts in the Platonic realm of ideas but lay, rather, simply in the nature of language. This was to be the final step in the retreat from Pythagoras and a further incentive for Russell to abandon technical philosophy in favour of other pursuits.\n\nDuring World War I Russell was for a while a full-time political agitator, campaigning for peace and against conscription. His activities attracted the attention of the British authorities, who regarded him as subversive. He was twice taken to court, the second time to receive a sentence of six months in prison, which he served at the end of the war. In 1916, as a result of his antiwar campaigning, Russell was dismissed from his lectureship at Trinity College. Although Trinity offered to rehire him after the war, he ultimately turned down the offer, preferring instead to pursue a career as a journalist and freelance writer. The war had had a profound effect on Russell’s political views, causing him to abandon his inherited liberalism and to adopt a thorough-going socialism, which he espoused in a series of books including Principles of Social Reconstruction (1916), Roads to Freedom (1918), and The Prospects of Industrial Civilization (1923). He was initially sympathetic to the Russian Revolution of 1917, but a visit to the Soviet Union in 1920 left him with a deep and abiding loathing for Soviet communism, which he expressed in The Practice and Theory of Bolshevism (1920).\n\nIn 1921 Russell married his second wife, Dora Black, a young graduate of Girton College, Cambridge, with whom he had two children, John and Kate. In the interwar years Russell and Dora acquired a reputation as leaders of a progressive socialist movement that was stridently anticlerical, openly defiant of conventional sexual morality, and dedicated to educational reform. Russell’s published work during this period consists mainly of journalism and popular books written in support of these causes. Many of these books—such as On Education (1926), Marriage and Morals (1929), and The Conquest of Happiness (1930)—enjoyed large sales and helped establish Russell in the eyes of the general public as a philosopher with important things to say about the moral, political, and social issues of the day. His public lecture “Why I Am Not a Christian,” delivered in 1927 and printed many times, became a popular locus classicus of atheistic rationalism. In 1927 Russell and Dora set up their own school, Beacon Hill, as a pioneering experiment in primary education. To pay for it, Russell undertook a few lucrative but exhausting lecture tours of the United States.\n\nDuring these years Russell’s second marriage came under increasing strain, partly because of overwork but chiefly because Dora chose to have two children with another man and insisted on raising them alongside John and Kate. In 1932 Russell left Dora for Patricia (“Peter”) Spence, a young University of Oxford undergraduate, and for the next three years his life was dominated by an extraordinarily acrimonious and complicated divorce from Dora, which was finally granted in 1935. In the following year he married Spence, and in 1937 they had a son, Conrad. Worn out by years of frenetic public activity and desiring, at this comparatively late stage in his life (he was then age 66), to return to academic philosophy, Russell gained a teaching post at the University of Chicago. From 1938 to 1944 Russell lived in the United States, where he taught at Chicago and the University of California at Los Angeles, but he was prevented from taking a post at the City College of New York because of objections to his views on sex and marriage. On the brink of financial ruin, he secured a job teaching the history of philosophy at the Barnes Foundation in Philadelphia. Although he soon fell out with its founder, Albert C. Barnes, and lost his job, Russell was able to turn the lectures he delivered at the foundation into a book, A History of Western Philosophy (1945), which proved to be a best-seller and was for many years his main source of income.\n\nIn 1944 Russell returned to Trinity College, where he lectured on the ideas that formed his last major contribution to philosophy, Human Knowledge: Its Scope and Limits (1948). During this period Russell, for once in his life, found favour with the authorities, and he received many official tributes, including the Order of Merit in 1949 and the Nobel Prize for Literature in 1950. His private life, however, remained as turbulent as ever, and he left his third wife in 1949. For a while he shared a house in Richmond upon Thames, London, with the family of his son John and, forsaking both philosophy and politics, dedicated himself to writing short stories. Despite his famously immaculate prose style, Russell did not have a talent for writing great fiction, and his short stories were generally greeted with an embarrassed and puzzled silence, even by his admirers.\n\nIn 1952 Russell married his fourth wife, Edith Finch, and finally, at the age of 80, found lasting marital harmony. Russell devoted his last years to campaigning against nuclear weapons and the Vietnam War, assuming once again the role of gadfly of the establishment. The sight of Russell in extreme old age taking his place in mass demonstrations and inciting young people to civil disobedience through his passionate rhetoric inspired a new generation of admirers. Their admiration only increased when in 1961 the British judiciary system took the extraordinary step of sentencing the 89-year-old Russell to a second period of imprisonment.\n\nWhen he died in 1970 Russell was far better known as an antiwar campaigner than as a philosopher of mathematics. In retrospect, however, it is possible to see that it is for his great contributions to philosophy that he will be remembered and honoured by future generations."}, {"url": "https://news.gov.bc.ca/releases/2018AG0105-002378", "page_content": "The following Queen’s counsel appointees are listed chronologically by the date they were called to the bar:\n\nCorrinne Lee Ongman has practised law since graduating from the University of British Columbia (UBC) faculty of law in 1977. Ongman has more than 40 years experience as a practising lawyer in B.C. and has focused for many years on assisting the Indigenous peoples of northern B.C. to access the justice system. As a life bencher of the Law Society of B.C., she has worked on its truth and reconciliation advisory committee, practice standards committee and family law task force. She has also served as panel member and panel chair of the Canadian Human Rights Tribunal for Western Canada.\n\nJohn Walter Bromley graduated from the University of Toronto with a bachelor of laws (LLB) in 1982 and was called to the B.C. bar the following year. Bromley has practised primarily in the area of maritime law for 35 years. He founded his own firm, Bromley Chapelski, in 1998 and later joined Bull, Housser & Tupper in 2008. He regularly contributes to the Canadian chapter of the International Comparative Guide to Shipping Law. He also served on the executive of the Maritime section of the Canadian Bar Association of B.C. (CBABC) from 1988 to 1996 and was section chair from 1994 to 1996.\n\nRobert Dewart Gibbens earned a LLB from UBC in 1984. Gibbens is a partner with the Vancouver civil litigation firm Laxton Gibbens. He has practised in many areas of law, including cases related to pension law, social worker liability and serious injury. He has extensive experience representing victims of physical abuse as infants due to institutional negligence.\n\nAdam Charles Whitcombe received a LLB from UBC in 1984 and was called to the B.C. bar in 1985. After working in private practice, Whitcombe joined the Law Society of B.C. in 1993. He has served in senior roles at the Law Society for 25 years and serves as its deputy executive director and chief executive officer. He was instrumental in negotiating the agreement between the Law Society, the Law Foundation and the Queen’s Printer that led to free online public access to British Columbia’s statutes and regulations, and is the driving force behind the Juricert online legal credential service.\n\nBarry Neville Zacharias was called to the B.C. bar in 1985. Zacharias has practised in the northwest part of the province for 18 years, establishing himself first in the family court arena and then in criminal law with Crown counsel. In 2000, he moved to Terrace and joined the Native Community Law Office in L’ax Ghels, where he represented local Indigenous families. He is the administrative Crown counsel for BC Prosecution Service in Prince Rupert. While in private practice, he also served as the Salvation Army pro bono counsel in Nanaimo.\n\nFiona MacDonald Begg was called to the B.C. bar in 1987. Throughout her career in law, Begg has focused on promoting diversity and social justice through advocacy in the community. As a sole practitioner, she has worked in immigration and criminal law. She has served as a board member and president of MOSAIC, as a board member of Casa Latinoamericana Society and with CBABC, where she was the secretary of the immigration sub-section for two years. She also teaches the immigration consequences of sentencing course to colleagues at the Vancouver downtown community court in its lunchtime education series.\n\nMary Bridget Hamilton received a LLB from Dalhousie University in 1986. Hamilton is a partner with Alexander Holburn Beaudin + Lang LLP. She serves as the chair of the Vancouver wills and estates section of CBABC and has contributed to numerous law reform initiatives, including the law governing succession and estate administration that resulted in the Wills, Estates and Succession Act. She has also given pro bono workshops on estate planning through the Planned Lifetime Advocacy Network (PLAN) to families of people with disabilities.\n\nGordon George Matei received a LLB from UBC and was called to the B.C. bar in 1987. In addition to time as corporate commercial litigation, Matei has spent most of his legal career as Crown counsel with BC Prosecution Service, where he has tried cases at all levels of court in British Columbia. In 1997, he served as a senior lawyer on the Air India Crown Task Force, which handled the prosecution of R. vs. Malik and Bagri at the B.C. Supreme Court. In 2005, he joined the BC Prosecution Service’s organized crime unit in Vancouver and serves as its deputy director.\n\nBrian Michael Samuels received a LLB from the University of Victoria in 1987. Samuels is a senior trial and appeal lawyer, trained mediator and a chartered arbitrator, and is the principal of the construction law firm Samuels & Co. His primary practice areas are resolution of construction disputes and civil rights litigation. He practised with Russell & DuMoulin and Lee & Associates, Denver before starting his own firm. He also serves as the editor of the Journal of the Canadian College of Construction Lawyers.\n\nPhilip Alexander Riddell holds a LLB from UBC and was called to the B.C. bar in 1989. Riddell has experience both in civil litigation and criminal law. He serves on the board of the Legal Services Society (LSS) and is also a member of the Finance Committee and Stakeholder Engagement Committee. He is the former president of the New Westminster Bar Association and was previously a member of CBABC’s advisory committee to the provincial judicial council. He has also served on the provincial council for Westminster County for the Canadian Bar Association and as the co-chair of CBABC’s Westminster criminal subsection.\n\nSusan Jane Brown received a LLB from UBC in 1990. After articling at Killam Whitelaw Twining in Vancouver, Brown joined BC Prosecution Service. During the last 27 years, she has appeared at all levels of court as Crown counsel, handling cases ranging from traffic violations to high-profile organized crime. In 2005, she joined the Criminal Appeals Office, where she recently assumed the role of acting deputy director. She is a co-editor and contributing author for the Working Manual of Criminal Law.\n\nPeter John Roberts received a LLB from UBC in 1989 and was called to the B.C. bar in 1991. Roberts has 26 years of experience as a litigator in Vancouver. He has practised criminal law and civil and commercial litigation, including product liability, property law disputes and claims involving allegations of fraud. He has appeared before all levels of court in British Columbia as well as other professional bodies. He has also contributed to numerous professional organizations, including the Justice Education Society, the 20 Club and The Advocate.\n\nRussell Charles Gordon was called to the B.C. bar in 1992. Gordon is a senior partner at Koskie Glavin Gordon, practising in the areas of labour, human rights and administrative law. Previously, Gordon was an in-house labour counsel and was senior counsel to the British Columbia Labour Relations Board. He is the former president of the CBABC labour section and is a member of the advisory committee for the Queen’s University Centre for Law in the Contemporary Workplace and a member of the British Columbia Law Institute Employment Standards Act reform project committee. He also volunteers with Access Pro Bono and the CBA’s lawyer referral service.\n\nHugh William Veenstra received his LLB from the University of Victoria in 1990 and was called to the B.C. bar in 1992. Veenstra has a commercial litigation practice that specializes in complex real estate, construction and multi-party disputes. He serves as the president of the CBABC after having served as secretary treasurer and vice-president and on many of its committees. He received the CBABC President’s Medal in 2015 in recognition of outstanding contributions to the B.C. branch. He has also served the CBA nationally on many committees, as chair of the CBA national civil litigation section and on the CBA national council.\n\nWilliam Stuart Dick was called to the B.C. Bar in 1993. Dick has extensive experience in insurance defense and personal injury litigation. In 2014, he joined Murphy Battista LLP and currently represents plaintiffs in personal injury, medical malpractice and insurance claims though practising out of both the Kelowna and Vernon offices. He has served on the board of governors for the Trial Lawyers Association of British Columbia (TLABC), as the TLABC representative with the Access to Justice BC Leadership Group, and as a member of the British Columbia Supreme Court Rules Committee. He has also taught as an adjunct professor at the UBC faculty of law.\n\nLindsay Margaret Lyster received a LLB from UBC in 1991 and was called to the B.C. bar in 1993. Lyster practises in human rights, labour, employment, constitutional and administrative law, acting primarily for unions and employees before administrative tribunals and all levels of court, including the Supreme Court of Canada. She has served as the president of the B.C. Civil Liberties Association since 2012. She is also the co-chair of the Continuing Legal Education Society of B.C. (CLEBC) Human Rights Conference.\n\nNazeer Tajdin Mitha received a LLB from Dalhousie University in 1992 and was called to the B.C. bar the following year. His practice consists of commercial litigation, employment-related law with an emphasis on civil litigation of employment matters and shareholder disputes. Since 2014, he has been an adjunct professor in employment law at UBC’s Allard School of Law. He is a current member of the national conciliation and arbitration board of the Ismaili Muslim community, providing pro bono mediation and mentoring services to the Ismaili community. He has also served as the president, vice-president and board member of the Law Courts Inn.\n\nMichelle Denise Stanford received a LLB from the University of Victoria in 1992 and was called to the B.C. bar in 1993. Stanford is the former president of the Kamloops Bar Association and has served on its executive team for many years. She is a founding member and chair of the Kamloops Inns of Court and was a founder and director of the Association of Legal Aid Lawyers. She is active in all three local sections of the CBABC as well as serving as the Kamloops representative to both the TLABC’s legal aid action committee and the Criminal Defence Advocacy Society.\n\nJulianne Krystal Lamb received a LLB from the University of Toronto in 1993 and was called to the B.C. bar the following year. In addition to her practice work, Lamb is a member and the chair of the CBABC advisory committee to the judicial council (provincial court appointments). She is an adjunct professor and lecturer at the University of Victoria, teaching insurance law. She has been co-author of the insurance chapter for the CLEBC Annual Review of Law and Practice for the past seven years and contributing author for the annual B.C. Motor Vehicle Accident Claims Manual for approximately 11 years.\n\nAleem Shiraz Bharmal received a LLB from the Allard School of Law at UBC in 1994. Bharmal is the executive director and a human rights lawyer at the Community Legal Assistance Society. He is also the chair of the CBABC access to justice committee and co-chair of both the human rights and social justice sections, and sits on the executive team of the administrative law section and is a member of the truth and reconciliation working group. He also worked as a human rights officer for the United Nations’ High Commission for Human Rights, where he assisted in reporting on the administration of justice and ongoing human rights violations in Rwanda.\n\nMary Audna Buttery was called to the B.C. bar in 1993. Buttery has built a career specializing in corporate insolvency law. She sits on two editorial advisory boards, and has been engaged in, both as a speaker and as chair, various legal education seminars in British Columbia and nationally, including for the CBABC, the Law Society of British Columbia, CLEBC and the Annual Review of Insolvency Law. She has also been an adjunct professor at UBC’s Allard School of Law.\n\nNikos Emil Harris was called to the B.C. bar in 1997. In addition to his practice at Peck and Company, Harris is a legal educator on criminal law, criminal procedure, ethics, evidence and torts. He is the director of experiential learning at the Allard School of Law. He has also made significant contributions to the Indigenous legal studies program. He was co-founder of the UBC Innocence Project, which advocates on behalf of the wrongfully convicted. He is a regular speaker for CLEBC and appears at many law conferences and forums.\n\nSteven Ronald McKoen was called to the B.C. bar in 1998. McKoen is a bencher of the Law Society of B.C. and a partner at Blake, Cassels & Graydon LLP, where he focuses on domestic and cross-border mergers and acquisitions, corporate finance, reorganizations and corporate governance. He has been an adjunct professor in the faculty of law at both UBC and the University of Victoria. He currently serves on the UBC dean’s advisory committee for the Centre for Business Law. Since 2006, he has provided pro bono advice to artists and non-profits through the Artists Legal Outreach clinic run by the Pacific Legal Education and Outreach Society.\n\nBrock Andrew Martland received a LLB from the University of Victoria in 1999. Martland has built a varied career that has included serving as counsel for former provincial wards, litigating complex interpretive issues and criminal defense counsel, including high-profile cases like the Air India and Surrey Six trials. He has been a presenter, panelist or chair at numerous conferences and programs, including Federation of Law Societies national criminal program, B.C. Civil Liberties Association and others. He volunteers his time and experience assisting the UBC Innocence Project and Access Pro Bono, and has been a guest lecturer at UBC Allard School of Law on criminal law, youth justice, ethics, advocacy and wrongful convictions.\n\nMichael Andre Feder received a LLB from UBC in 2003. Feder has practised in many areas including public law, commercial litigation and appellate litigation. He also conducts extensive pro bono work for many local, national and international public interest organizations, including the Canadian HIV/AIDS Legal Network, Pivot Legal Society, UNAIDS, and the B.C. Civil Liberties Association. He also contributes to the Supreme Court Advocacy Institute, which provides free, non-partisan advocacy advice to lawyers arguing Supreme Court of Canada appeals.\n\nCeleste Ann Haldane received a LLB from UBC in 2004 and a master of laws from York University’s Osgoode Hall Law school in 2013. Haldane is a community member of both the Musqueam and Metlakatla First Nations. She is the chief commissioner for the BC Treaty Commission. She also sits on the UBC board of governors as chair of the Indigenous engagement committee. She has also served on the board of directors for LSS, Brain Canada Foundation, the Indigenous Bar Association and the Hamber Foundation.\n\nJames Nicholas Harvey was called to the B.C. bar in 2005. Harvey is the assistant deputy attorney general, heading the ministry’s Legal Services Branch. He is involved in all decisions relating to civil legal matters affecting the Province and routinely briefs the Premier, attorney general, deputy attorney general and other ministers. He previously served as counsel with the Ministry of Attorney General’s Finance Commercial and Transportation Group, where he advised on public infrastructure projects throughout British Columbia.\n\nClaire Elizabeth Hunter was called to the B.C. bar in 2010. Hunter joined Hunter Litigation Chambers in 2010. She is also the president of Access Pro Bono. She is a prominent voice for the provision of pro bono services and a frequent presenter on access-to-justice issues. She has served as chair of the CBA’s national pro bono committee and is vice-chair of the Law Society of B.C.’s access to legal services committee. She has contributed to numerous other organizations, including Human Rights First, Law Courts Inn and Advocates Society."}, {"url": "https://lso.ca/about-lso/osgoode-hall-and-ontario-legal-heritage/collections-and-research/online-resources-and-finding-aids/diversifying-the-bar-lawyers-make-history/biographies-by-year-called-1941-to-present", "page_content": "Biographies Arranged By Year Called to the Bar, Part 2: 1941 to the Present\n\nBiographies of Early and Exceptional Ontario Lawyers of Diverse Communities Arranged By Year Called to the Bar, Part 2: 1941 to the Present\n\n\n\nClick here to access\n\n\n\nFor each lawyer, this document offers some or all of the following information: Click here to access Biographies of Early and Exceptional Ontario Lawyers of Diverse Communities Arranged By Year Called to the Bar, Part 1: 1797 to 1941\n\n\n\nFor each lawyer, this document offers some or all of the following information: For each lawyer, this document offers some or all of the following information: name gender\n\nyear and place of birth, and year of death where applicable\n\nyear called to the bar in Ontario (and/or, until 1889, the year admitted to the courts as a solicitor; from 1889, all lawyers admitted to practice were admitted as both barristers and solicitors, and all were called to the bar)\n\nwhether appointed K.C. or Q.C.\n\nname of diverse community or heritage biographical notes\n\nname of nominating person or organization if relevant\n\nsources used in preparing the biography (note: living lawyers provided or edited and approved their own biographies including the names of their community or heritage)\n\nsuggestions for further reading\n\nThe biographies are ordered chronologically, by year called to the bar, then alphabetically by last name. To reach a particular period, click on the following links: 1941-1950, 1951-1960, 1961-1970, 1971-1980, 1981-1990, 1991-2000, 2001-.\n\n\n\nFor more information on the project, including the set of biographies arranged by diverse community rather than by year of call, please click here for the Diversifying the Bar: Lawyers Make History home page.\n\n\n\n1941 - 1950 Name: GOLDSTICK, Iva Sarah Kaplan\n\nFemale\n\nBorn 1904 in Yaraslov, Russia\n\nDied 1986\n\nCalled to the Bar: 1943\n\nName of Heritage or Community: Jewish; Russian\n\nBiographical Information:\n\nSarah Goldstick was one of the first Jewish women lawyers, and widow of David Goldstick, a labour lawyer.\n\nNominated by Morley L. Torgov\n\nName: VANNINI, Ilvio Anthony\n\nMale\n\nBorn 1915 in Sault Ste. Marie, Ontario\n\nDied 1998\n\nCalled to the Bar: 1943\n\nQ.C.\n\nName of Heritage or Community: Italian\n\nBiographical Information:\n\nI. Anthony Vannini was the first lawyer of Italian heritage to be appointed a judge in Ontario, to the District Court of Algoma, from 1966 to 1990, and as a justice of the Ontario Court of Justice, from 1990 to 1991. Before he was elevated to the bench, he spent more than two decades as a litigator and community contributor in Sault Ste Marie and was the president of the Algoma District Law Association. In 1998, the local Italian community established an award of merit in his honour.\n\n\n\nSource: Roger Yachetti, \"Three Italian Canadian Pioneers in the Law,\" Italian Canadiana 15 (2001), 44-6. utoronto.ca/iacobucci. The Frank Iacobucci Centre for Italian Canadian Studies, Department of Italian Studies, University of Toronto. Web. Feb. 2010.\n\nName: CHUMAK, Olga\n\nFemale\n\nBorn 1917 in Toronto, Ontario\n\nDied 2003\n\nCalled to the Bar: 1944\n\nName of Heritage or Community: Ukrainian\n\nBiographical Information:\n\nOlga Chumak was the first woman lawyer of Ukrainian heritage in Ontario. In 1947, Ms. Chumak married Dr. Martin Chepesiuk and continued to practice law. She was an advocate for Ukrainian culture and traditions throughout her life.\n\n\n\nSource: Olga Chepesiuk obituary, Toronto Globe and Mail, 6 June 2003, S7. Web.\n\n\n\nName: DUBIN, Charles Leonard\n\nMale\n\nBorn 1921 in Hamilton, Ontario\n\nDied 2008\n\nCalled to the Bar: 1944\n\nK.C.\n\nName of Heritage or Community: Jewish\n\nBiographical Information:\n\nCharles Dubin was a brilliant litigator and one of the first Jewish judges in Ontario, appointed in 1973 to the Ontario Court of Appeal. From 1990 to 1996, Dubin served as the first Jewish Chief Justice of Ontario. He also headed important inquiries and royal commissions including the Dubin Inquiry into the use of drugs in amateur sports in 1990. He was named an Officer of the Order of Canada. Charles Dubin and his accomplished wife, Anne, also a lawyer, were devoted partners in support of many non-profit causes.\n\n\n\nSources: Tracey Tyler, \"Charles Dubin, 87: Legal Giant Became National Icon,\" Toronto Star, 21 Oct. 2008. Web. 10 August 2009; Sandra Martin, \"Charles Dubin: Judge who Probed Use of Drugs in Sports was 'a Complete Man of the Law,'\" Toronto Globe and Mail, 21 Oct. 2008. Web. 10 August 2009; \"Osgoode Entrance Award Honours Memory of Charles and Anne Dubin,\" Yfile. York University. 23 July 2009. Web. 21 Sep. 2009.\n\n\n\n\n\nName: YAREMKO, John\n\nMale\n\nBorn 1918 in Welland, Ontario\n\nDied 2010\n\nCalled to the Bar: 1944\n\nQ.C.\n\nName of Heritage or Community: Ukrainian\n\nBiographical Information:\n\nJohn Yaremko was the first person of Ukrainian heritage to graduate from an Ontario faculty of law. In a long career in politics, he was a path breaker not only for Ukrainian-Canadians but for all Ontarians of diverse communities. From 1951 until 1975, he was a Progressive Conservative member of the Provincial Parliament of Ontario, and the first Ukrainian-Canadian MPP or MLA. He applied his legal training and immigrant sensibilities to representing his downtown Toronto riding and in many posts as a provincial cabinet minister; he served as the first Minister of Citizenship (1971-2) and the first Solicitor General (1972-4). For his public service and wide- ranging philanthropy that has benefitted, among other institutions, the University of Toronto, and helped to preserve Ukrainian culture and history in Canada, he received many awards. In 2009, he was the first recipient of the federal Paul Yuzyk Award for Multiculturalism, for his lifelong advocacy in education, human rights and multiculturalism.\n\n\n\nNominated by Hélène Yaremko-Jarvis. See obituary, Toronto Star, 9 Aug. 2010. Web. Forthcoming: transcript of interview by A. Kirk-Montgomery, 2009.\n\n\n\nName: YIP, Kew Dock\n\nMale\n\nBorn 1906 in Vancouver, British Columbia\n\nDied 2001\n\nCalled to the Bar: 1945\n\nName of Heritage or Community: Chinese\n\nBiographical Information:\n\nKew Dock Yip was the first lawyer of Asian heritage in Canada. He was one of twenty-three children of a wealthy Vancouver merchant born in China. Yip was very well-educated, studying at Columbia University, the University of Michigan, and the University of British Columbia before settling on law as a career. Because “Orientals” were excluded from membership in the Law Society of British Columbia, Yip moved to Ontario, graduating from Osgoode Hall Law School in 1945. He took an office in Chinatown near Spadina Avenue in Toronto and became the first lawyer to offer Chinese-language services (Yip spoke several dialects). He was a leader in the successful campaign to end the exclusion of Chinese immigrants to Canada under the Chinese Exclusion Act, accomplished in 1947. His forty-seven years of practice and contributions to the legal and Chinese communities were recognized in 1998 when Kew Dock Yip received the Law Society Medal.\n\n\n\nNominated by the Federation of Asian Canadian Lawyers and the Association of Chinese Canadian Lawyers of Ontario. Sources: \"First Chinese Called to the Bar,\" Toronto Star, 20 Sep. 1945, 12; Christopher Moore, \"Law Times 'That's History' Excerpted Columns. The Ontario Legal Alphabet: Y is for Yip.\" christophermoore.ca. Christopher Moore. 2004. Web. Oct. 2009. Interviewee, Osgoode Society Oral History Programme.\n\nName: GRANT, Gretta J.\n\nFemale\n\nBorn 1921 in London, Ontario\n\nCalled to the Bar: 1946\n\nQ.C.\n\nName of Heritage or Community: Chinese\n\nBiographical Information:\n\nGretta Grant, nee Wong, was the first woman lawyer of Chinese ancestry in Canada. Born in London, Ontario, to parents who owned a restaurant, she followed several of her seven siblings into the professions. She articled at McCarthy and McCarthy, a large law firm in Toronto, but eventually returned to London. After a few years as the assistant city solicitor in her home town, she practised law with her husband, J. Alan R. Grant, until his death in 1967. In that year, she took the position of Area Director of Legal Aid, at a time when legal aid was moving from a voluntary basis to a more extensive program partially paid by the province. Until her retirement in 1988, she worked to make legal services more accessible to members of disadvantaged communities. Ms. Grant was also the first female president of the Middlesex Law Association. In 2000, Ms. Grant was awarded the Law Society Medal for her contributions to the profession.\n\n\n\nNominated by the Middlesex Law Association, the Federation of Asian Canadian Lawyers, and the Association of Chinese Canadian Lawyers of Ontario. Source: Constance Backhouse, \"Gretta Wong Grant: Canada's First Chinese-Canadian Female Lawyer,\" Windsor Yearbook of Access to Justice 15 (1996) 3-46. constancebackhouse.ca. Constance Backhouse. Web. Oct. 2009. Interviewee, Osgoode Society Oral History Programme.\n\n\n\n\n\nName: BASSEL, John Peter\n\nMale\n\nBorn 1921\n\nDied 2000\n\nCalled to the Bar: 1947\n\nQ.C.\n\nName of Heritage or Community: Greek\n\nBiographical Information:\n\nJohn Bassel was the first lawyer of Greek descent called to the Ontario bar. He practised municipal law in Toronto. He was named Q.C. in 1962.\n\n\n\nNominated by the Hellenic Canadian Lawyers Association.\n\n\n\nName: GOODMAN, Edwin Allan\n\nMale\n\nBorn 1918 in Toronto, Ontario\n\nDied 2006\n\nCalled to the Bar: 1947\n\nQ.C.\n\nName of Heritage or Community: Jewish\n\nBiographical Information:\n\nA corporate lawyer, Progressive Conservative strategist for both the provincial and the federal parties, patron of the arts, and a war hero. In the words of Christopher Moore, Eddie Goodman \"helped usher in the era when you could be a Jewish lawyer without that being the defining characteristic of your career.\" He was made Q.C. in 1954, was a bencher of the Law Society from 1966 until his death, and was appointed an officer of the Order of Canada in 1992.\n\n\n\nSource: Christopher Moore, \"How Eddie Goodman Changed Legal Practice,\" Law Times (Sep. 2006). Web. See also Eddie Goodman, Life of the Party: The Memoirs of Eddie Goodman (Toronto: Key Porter, 1988).\n\n\n\nName: ROBINS, Sydney Lewis\n\nMale\n\nBorn 1923 in Toronto, Ontario\n\nDied 2014 in Toronto, Ontario\n\nCalled to the Bar: 1947\n\nQ.C.\n\nName of Heritage or Community: Jewish\n\nBiographical Information:\n\nFor the first three decades of his career, Sydney Robins practised corporate, commercial and labour law in Toronto, mostly as a litigator. Robins served his profession as an author and teacher, and through leadership roles in the Canadian Bar Association, the Law Foundation of Ontario (he was its founding chair in 1974), and the Law Society of Upper Canada (he was the first Jewish Treasurer, 1971 to 1974). In 1976, he was appointed to the Supreme Court of Ontario, then to the Court of Appeal for Ontario in 1981. Before he retired from the bench in 1998, he served on several Ontario provincial commissions. Beyond his legal career, he has committed time and energy to health and other not-for-profit organizations. In 2000, Mr. Robins was awarded the Law Society Medal for “outstanding service in accordance with the highest ideals of the legal profession.”\n\n\n\nSee also Law Society of Upper Canada Archives, Sydney Robins fonds, PF188; Jack Batten, Learned Friends: A Tribute to 50 Remarkable Ontario Advocates, 1900-1950 (Toronto: Irwin Law, 2005), 60-1. Interviewee, Osgoode Society Oral History Programme.\n\n\n\nName: VAN CAMP, Mabel\n\nFemale\n\nBorn 1920 in Blackstock, Ontario\n\nDied 2012\n\nCalled to the Bar: 1947\n\nQ.C.\n\nName of Heritage or Community: Women\n\nBiographical Information:\n\nMabel Van Camp was the first woman to be appointed to the Supreme Court of Ontario, in 1971, by Pierre Trudeau. She was a pathbreaker all her life: the first from her community to attend university, she was later the first female member of the Royal Canadian Military Institute. By the time she retired in 1995, she had inspired the next generation of women lawyers and judges, including Madam Justice Rosalie Abella and Madame Justice Janet Boland. In 2003, she was appointed to the Order of Ontario.\n\n\n\nSee William I. Atkinson, \"‘I Am the Damn Judge’: Ontario’s First Madam Justice Sometimes Went Unrecognized When People Were Expecting A Man,” Globe and Mail, 9 Aug. 2012.\n\nName: LAIRD, Marjorie Alice Ransier\n\nFemale\n\nBorn 1923\n\nDied 1997\n\nCalled to the Bar: 1948\n\nQ.C.\n\nName of Heritage or Community: Women\n\nBiographical Information:\n\nMarjorie Laird, later Palmer, was the first woman senior solicitor in a Canadian province, appointed to the Ontario Attorney General's Office in 1957.\n\n\n\n\n\nName: LEGGE, Laura\n\nFemale\n\nBorn 1923 in Courtland, Ontario\n\nDied 2010\n\nCalled to the Bar: 1948\n\nQ.C. 1966\n\nName of Heritage or Community: Women\n\nBiographical Information:\n\nFor more than five decades, Laura Legge practised as a solicitor in Toronto while she was leading legal and community service organizations. A passionate defender of the traditional rights and duties of the profession, she was elected the first woman bencher of the Law Society in 1975. In 1983, she was elected its first woman Treasurer, the Ontario bar's highest office. Legge never described herself as a feminist. However, she valued the personal and professional support she gained early in her career from the Women’s Law Association, and was its president from 1964 to 1966. Beyond her official roles, she served as a beloved mentor to many young women lawyers. Her models were Margaret Hyndman (see bio) and other path-breakers who befriended and advised her. Their message was, “You’re a lawyer, get on with in and do it. We did it.” And so did Laura Legge. In recognition of her contributions and achievements, the Law Society not only awarded her an honorary Doctor of Laws in 1988, but also established the Laura Legge Award in 2007 to honour other women who exemplify leadership within the profession.\n\n\n\nQuote from Law Society of Upper Canada, Past Treasurers' Project, Transcript of Interviews with Laura Legge by A. Forrest (2004), 123. See also, Sandra Martin, “First Woman to Head Ontario’s Law Society was a Tough But Quiet Barrier Breaker,” The Globe and Mail, 30 Oct. 2010. Interviewee, Osgoode Society Oral History Programme.\n\n\n\nName: OKULOSKI, John Edward\n\nMale\n\nBorn 1922 in Hamilton, Ontario\n\nDied 1965\n\nCalled to the Bar: 1948\n\nName of Heritage or Community: Polish\n\nBiographical Information:\n\nOf Polish heritage, Edward Okuloski articled and then practised with his older sister, Helen, in Hamilton, Ontario.\n\nName: VASS, Ferenc\n\nMale\n\nBorn 1914\n\nDied c. 1990\n\nCalled to the Bar: 1948\n\nQ.C.\n\nName of Heritage or Community: Hungarian\n\nBiographical Information:\n\nFerenc Vass was one of the first lawyers and first Q.C. from the Ontario Hungarian community. He practised at College and Spadina in Toronto. He was active in the development of the Canadian-Hungarian Cultural Centre, and in other ways assisted newcomers.\n\n\n\nNominated by Frank Felkai of the Hungarian Helicon Society.\n\nName: AGRO, John Louis\n\nMale\n\nBorn 1919\n\nDied 1998\n\nCalled to the Bar: 1949\n\nQ.C.\n\nName of Heritage or Community: Italian\n\nBiographical Information:\n\nThe son of Sicilian immigrants, John Agro was a prominent criminal and litigation lawyer in Hamilton. In 1959 he became the first Hamilton lawyer of Italian heritage to be named Queen’s Counsel. He was also one of the first Italian-Canadian benchers of the Law Society of Upper Canada, from 1983 to 1987. For many years from 1976, he chaired the Hamilton Harbour Commission, overseeing the revitalization of Hamilton’s bayshore. He was one of the founders of the Canadian Football League Players Association. In 1984, he was named Hamilton’s Italian- Canadian Citizen of the Year. John Agro was awarded the Law Society Medal in 1992.\n\n\n\nSources: Roger Yachetti, \"Three Italian Canadian Pioneers in the Law,\" Italian Canadiana 15 (2001), 41-4. utoronto.ca/iacobucci. The Frank Iacobucci Centre for Italian Canadian Studies, Department of Italian Studies, University of Toronto. Web. Feb. 2010; \"Agro, John,\" Law Society of Upper Canada Past Member Database, Law Society of Upper Canada Archives, 2009. Interviewee, Osgoode Society Oral History Programme. Name: CAMPBELL, Christopher George\n\nMale\n\nBorn 1915\n\nDied 2003\n\nCalled to the Bar: 1949\n\nName of Heritage or Community: Greek\n\nBiographical Information:\n\nGeorge Campbell, born Karambalas, served in the Second World War and was called to the bar in 1949 at the relatively late age of 34. After a short time in practice, he became the sheriff of Middlesex County. He was a captain in the First Hussars Association of London, Ontario.\n\nNominated by William Vorvis.\n\nName: CARTER, George E.\n\nMale\n\nBorn 1921 in Toronto, Ontario\n\nDied 2018\n\nCalled to the Bar: 1949\n\nQ.C.\n\nName of Heritage or Community: Black\n\nBiographical Information:\n\nGeorge Carter, the oldest of fourteen children born to parents who emigrated from Barbados in 1920, is the second Black lawyer to be appointed a judge in Ontario, and the first Canadian-born Black judge. In 1941, after graduating from Harbord Collegiate in Toronto, Mr. Carter started at the University of Toronto. To fund his studies, he worked three summers travelling across Canada as a night porter on the trains. In 1943, he volunteered for service in the Second World War. After completing advanced training at Ipperwash and being chosen for the School of Instruction, he decided to rejoin civilian life in 1945. He attended Osgoode Hall Law School with the assistance of the Department of Veterans Affairs. After he was called to the bar, he practised in his beloved Toronto for thirty years. In 1979, Mr. Carter was appointed as a judge of the Provincial Court (Criminal Division). He retired from the bench in 1996.\n\n\n\nInterviewee, Osgoode Society Oral History Programme. See also Linda V. Carter, “The Making of a Judge: Judge George E. Carter,\" for Omni Television, in production.\n\nName: BOLAND, Janet Lang\n\nFemale\n\nBorn 1923 in Kitchener, Ontario\n\nCalled to the Bar: 1950\n\nQ.C. 1965\n\nName of Heritage or Community: Women\n\nBiographical Information:\n\nJanet Boland’s legal career, like all her life, has been, “a challenging adventure,” in her words. In first year at Osgoode Hall Law School, she was one of only 6 women in a class of 500. Half of the class failed. While raising three sons, she developed a commercial practice and reported for Ontario Weekly Notes before joining White Bristol and then Lang Michener. In 1972, she became Ontario’s second federally-appointed woman judge following Mabel Van Camp in 1971. Her first criminal case “involved 20 pounds of heroin and a life sentence.” In 1976, she was appointed to the Supreme Court of Ontario and subsequently presided over 78 murder trials. In the wake of revisions to family law, Justice Boland introduced the principles of joint custody to Ontario courtrooms in Baker v Baker (1978). In 2000, she married Dr. Taylor Statten. She continues her adventures, especially on the golf course and in Algonquin Park.\n\n\n\nSee transcript of interview of the Honourable Janet Boland by A. Kirk-Montgomery, 2011, forthcoming. Name: LAMARSH, Judy (Julia Verlyn)\n\nFemale\n\nBorn 1924 in Chatham, Ontario\n\nDied 1980\n\nCalled to the Bar: 1950\n\nQ.C.\n\nName of Heritage or Community: Women\n\nBiographical Information:\n\nLike her father, Judy LaMarsh was a Liberal and a lawyer, but she left her Niagara Falls practice to become an MP in 1960. In 1963, she became the first Ontario woman lawyer (and the second woman ever) to serve in the federal Cabinet. As Minister of Health and Welfare she fought to bring in the Canada Pension Plan and medicare. She also served as Secretary of State during Canada's centennial in 1967. Despite her achievements, she felt isolated and attacked as the only woman in Parliament at the time. She was critical of her opponents and colleagues, including Prime Minister Pearson. She left politics in 1968 to return briefly to her law practice, but was more successful as a CBC journalist and author of a candid political memoir. In her last decade, she served as a royal commissioner and advocated for women's rights, outspoken and outstanding to the end.\n\nSource: Arthur Johnson, \"Ex Health Minister Brought in Pension Plan, Medicare,\" Toronto Globe and Mail, 28 Oct. 1980, 4. See also Judy LaMarsh, Memoirs of a Bird in a Gilded Cage (Toronto: McClelland and Stewart, 1969).\n\nName: PERRY, Lloyd William\n\nMale\n\nBorn 1919\n\nDied 1997\n\nCalled to the Bar: 1950\n\nQ.C.\n\nName of Heritage or Community: Black\n\nBiographical Information:\n\nLloyd Perry was one of the first Black lawyers to become Q.C., in 1962. He also served as the Official Guardian for Ontario, now the Public Guardian and Trustee. In 1995, he was appointed to the Order of Ontario.\n\n\n\nInterviewee, Osgoode Society Oral History Programme.\n\n1951 – 1960\n\nName: DUBIN, Anne Ruth\n\nFemale\n\nBorn 1926\n\nDied 2007\n\nCalled to the Bar: 1951\n\nQ.C.\n\nName of Heritage or Community: Jewish\n\nBiographical Information:\n\nIn 1945, Anne Levine married Charles Dubin, the future Chief Justice of Ontario, launching a team soon to be famous in legal and philanthropic circles. At Osgoode Hall Law School in 1951, she earned the bronze medal for scholarship. A pioneering woman in corporate law, she became managing partner at Kimber and Dubin. Later she became a partner in Tory, Tory, DesLauriers & Binnington. She gave her time and expertise to a variety of legal causes, including law reform, legal aid, and juvenile justice. She also served on the boards of numerous health, cultural, and educational organizations, including the Canadian Red Cross, the Elizabeth Fry Society, and the Clarke Institute of Psychiatry. In 1972, she became the first woman elected to the Toronto General Hospital Board Foundation.\n\n\n\nSource: \"Anne Dubin, York University Honorary Governor.\" Yfile. York University. 7 Aug. 2007. Web. 20 Sep. 2009.\n\n\n\nName: FLORAS, Frederick\n\nMale\n\nBorn 1924 in Antartikon, Florina, Greece\n\nCalled to the Bar: 1951\n\nName of Heritage or Community: Greek\n\nBiographical Information:\n\nFred Floras may be the first lawyer born in Greece to be called to the bar in Ontario. With his mother and sister, he emigrated from Macedonia at age four to join his father who worked in the Canada Packers slaughterhouse in Toronto. After graduating from Runnymede Collegiate in 1942, Fred enlisted in the RCAF and became a wireless operator and air gunner and was a commissioned officer. In 1945, Fred attended the University of Toronto and then Osgoode Hall, with assistance provided under the Veterans Rehabilitation Act, though his father had to postpone his retirement for three years to pay for his schooling. In his law practice from 1951 to 1996, Fred provided real estate, corporate and commercial law services, often to the immigrants from Greece who came to Canada in the 1950s and 1960s. Fred has been married to Victoria for 58 years. They have three children, John, a cardiologist, Judith, and Stanley, the latter two practising lawyers in Toronto.\n\n\n\nNominated by the Hellenic Canadian Lawyers' Association. See also Law Society of Upper Canada Archives, Hellenic Canadian Lawyers Association Files, \"Notes of Interview with Fred Floras,\" 14 Aug. 2003.\n\n\n\nName: VORVIS, William\n\nMale\n\nBorn 1927 in Guelph, Ontario\n\nCalled to the Bar: 1951\n\nQ.C.\n\nName of Heritage or Community: Greek\n\nBiographical Information:\n\nWilliam Vorvis' parents emigrated to Canada from Sparta. He became one of the first Ontario lawyers of Greek descent. Though he was proud of his Greek heritage, he experienced discrimination as a young lawyer and required the help of the head of the Law Society to get his first job with a law firm. Vorvis has practised in Guelph for more than five decades, mostly as a sole practitioner, and was named Q.C. in 1978. He has prosecuted cases of income tax fraud and related statutes. Over the years, at least seven students-at-law of diverse ethnic backgrounds have worked with him. He served as president of the Wellington Law Association. He has also contributed, often in leadership roles, to a wide range of community, political, religious and fraternal organizations. He has been legal counsel to various Hellenic-Canadian organizations, including a number of Greek Orthodox churches in Hamilton, Kitchener and Guelph.\n\n\n\nNominated by the Hellenic Canadian Lawyers' Association.\n\nName: ALEXANDER, Lincoln\n\nMale\n\nBorn 1922 in Toronto, Ontario\n\nDied 2012\n\nCalled to the Bar: 1953\n\nQ.C.\n\nName of Heritage or Community: Black\n\nBiographical Information:\n\nLincoln Alexander credited his West Indian mother’s teachings for his belief in the transformative power of education and his determination to break barriers. After serving in the Air Force in the Second World War, he attended McMaster University and Osgoode Hall. He practised in Hamilton until 1979, one of the first Black lawyers and Black QCs (1965) in Ontario. He also became the first Black federal member of Parliament in Canada (1968 to 1985), the first Black federal cabinet minister, and the first Black Lieutenant Governor in Canada, for Ontario, from 1985 to 1991. He then served as Chancellor of the University of Guelph for fifteen years. Among the many awards he received, he was made a Companion of the Order of Canada. In 2002, the Law Society of Upper Canada struck the Lincoln Alexander Award. The Society bestows it annually to an exceptional lawyer who, like the man it honours, has made outstanding contributions to the profession.\n\n\n\nNominated by Patrick Case. See also, Lincoln M. Alexander, Go to School, You're a Little Black Boy: The Honourable Lincoln M. Alexander, A Memoir (Hamilton: Dundurn Press, 1996).\n\nName: PANARITES, Stella Avura\n\nFemale\n\nBorn 1924 in Cobalt, Ontario\n\nDied 1986\n\nCalled to the Bar: 1953\n\nName of Heritage or Community: Greek\n\nBiographical Information:\n\nStella Panarites attended Queen's University (BA, 1949). She was the first woman lawyer of Greek heritage to be called to the bar in Ontario. She practised in Orillia, Midland, Gravenhurst, and North Bay.\n\n\n\nNominated by the Hellenic Canadian Lawyers Association.\n\n\n\nName: PETRONE, Alfred\n\nMale\n\nBorn 1925 in Port Arthur, Ontario\n\nDied 2009\n\nCalled to the Bar: 1953\n\nQ.C. Heritage or Community: Italian\n\nBiographical Information:\n\nAlfred Petrone was an entrepreneur, a proud Italian-Canadian, an athlete, but above all an advocate. In his Port Arthur practice, he was counsel for the defence in thousands of criminal trials; he became known for his brilliant courtroom tactics, his oratory, and his empathy for clients. With a few other lawyers, he fought successfully to end capital punishment in Canada, one of his proudest accomplishment. His clients included many poor people who paid him in fish or moose or not at all (Shufelt), and he was a strong supporter of a provincial legal aid system. By all accounts, Petrone was “larger than life,” and a remarkable lawyer.\n\nNominated by Christopher Watkins. Source: “Alfred Petrone Obituary,” sargentandson.com Web. Dec. 2009. See also, “Alfred Anthony Petrone,” in Jack Batten, Learned Friends: A Tribute to Fifty Remarkable Ontario Advocates, 1950-2000 (Irwin Law, 2005); Tim Shufelt,“Titan for the Bar Dies,” lawtimesnews.com 19 Dec. 2009.\n\n\n\nName: ZALEV, Carl\n\nMale\n\nBorn 1928 in Thamesville, Ontario\n\nCalled to the Bar: 1953\n\nName of Heritage or Community: Jewish\n\nBiographical Information:\n\nCarl Zalev was Windsor’s first Jewish judge, appointed in 1972 to the County Court of the County of Essex. He was the first Canadian judge to preside at the Annual Advocacy Institute of the Institute of Continuing Legal Education, hosted by the University of Michigan and the American Bar Association at Ann Arbor, Michigan, in May 1975. In 1990, he was appointed Judge of the Ontario Superior Court of Justice. Mr. Zalev is married (Victoria) with two sons, Matthew and Joshua. He has also served as President of the Congregation Shaar Hashomayim of Windsor from 1967 to 1970.\n\n\n\nName: OIYE, Kazuo George\n\nMale\n\nBorn 1926 in Vancouver, British Columbia\n\nCalled to the Bar: 1954\n\nQ.C.\n\nName of Heritage or Community: Japanese\n\nBiographical Information:\n\nKazuo Oiye is one of the first Ontario lawyers of Japanese heritage. He was named Q.C. in 1968 and is a Life Member of the Law Society of Upper Canada.\n\n\n\nInterviewee, Osgoode Society Oral History Programme. Name: BEAULNE, Jean-Pierre, c.r.\n\nHomme\n\nNé en 1925 à Ottawa en Ontario\n\nDécédé en 2009\n\nAdmission au Barreau: 1955\n\nQ.C.\n\nNom du patrimoine ou de la collectivité: Francophone\n\nBiographical Information:\n\nLe juge Beaulne a fait de nombreuses contributions à sa profession, à sa collectivité d'Ottawa et à la collectivité Francophone de l'Ontario. Il prend part à la Deuxième Guerre mondiale et à la guerre de Corée. En tant que juge, il est à la Cour de justice de l'Ontario pendant plus de 25 ans. Il préside aussi la Commission des plaintes du public contre la GRC (de 1992 à 1997). Par ailleurs, il enseigne la common law à l'Université d'Ottawa et aide à créer le programme de common law en langue française. Il est un des membres fondateurs de l'Association des juristes d'expression française de l'Ontario (AJEFO). Il travaille aussi sans relâche pour que les Francophones de la région d'Ottawa aient le droit d'avoir les services de santé en français. De plus, il s’intéresse beaucoup à des organismes artistiques, y compris Théâtre Canada. Il a reçu plusieurs prix dont l'Ordre du mérite de l'Association des juristes d'expression française de l'Ontario.\n\nSource : Maria Cook, « Obituary: Judge was a Strong Defender of Linguistic Rights », Ottawa Citizen, 14 Jan 2009, F6. Interviewee, Osgoode Society Oral History Programme.\n\n\n\nName: BEAULNE, Jean-Pierre\n\nMale\n\nBorn 1925 in Ottawa, Ontario\n\nDied 2009\n\nCalled to the Bar: 1955\n\nQ.C.\n\nName of Heritage or Community: Francophone\n\nBiographical Information:\n\nJustice Beaulne’s contributions to his profession, to his home community of Ottawa, and to the Francophone community of Ontario were extensive and varied. He served in both the Second World War and the Korean War. As a judge, he sat on the bench of the Ontario Court of Justice for more than 25 years. He also chaired the Commission for Public Complaints against the RCMP (1992-1997). In professional education, he was a teacher of common law at the University of Ottawa, and helped to create its Common Law French program. He was a founding member of the Association of French-Speaking Jurists of Ontario (AJEFO). He also campaigned to extend the rights of Ottawa-area Francophones to receive health services in the French language. In addition, he participated enthusiastically in many arts organizations, including Theatre Canada. Among other awards, he received the Order of Merit from the Association of French Speaking Jurists of Ontario.\n\n\n\nSource: Maria Cook, \"Obituary: Judge was a Strong Defender of Linguistic Rights,\" Ottawa Citizen, 14 Jan 2009, F6. Interviewee, Osgoode Society Oral History Programme.\n\nName: FOURIEZOS, Charles T.\n\nMale\n\nBorn 1930 in Sturgeon Falls, Ontario\n\nCalled to the Bar: 1955\n\nQ.C.\n\nName of Heritage or Community: Greek\n\nBiographical Information:\n\nCharles Fouriezos is one of the first lawyers and the first judge of Greek heritage in Ontario. He is a third generation Greek Canadian, his father and grandfather immigrating in 1897 and his mother in 1920. He began his practice in Sudbury in 1960 and worked for many years with the firm Miller-Maki. In 1969, he was appointed a provincial judge. He returned to private practice, mainly in commercial and corporate law, in the firm of Weaver, Simmons. In 1975, he was appointed Q.C. He is the past president of the Sudbury and District Law Association. Fouriezos was a member of the Sudbury Urban Renewal executive and its vice-chairman for many years until completion of the renewal of the downtown of the city of Sudbury, in the 1970s. He is a long-time member and has been an officer of local Greek community organizations.\n\n\n\nNominated by the Hellenic Canadian Lawyers Association.\n\nName: GELLER, John Arthur\n\nMale\n\nBorn 1930 in Toronto, Ontario\n\nDied 2015\n\nCalled to the Bar: 1955\n\nQ.C.\n\nName of Heritage or Community: Jewish\n\nBiographical Information:\n\nJack Geller blazed a trail for Jewish lawyers who followed him into Toronto's legal establishment. In 1959, at Arnoldi, Parry & Campbell, he became the first Jewish lawyer to be invited to partnership in a prominent Bay Street firm. Mr. Geller was lead counsel for Upper Lakes Shipping during the Royal Commission on the St. Lawrence Seaway in 1961. From 1992 to 2001, he served as vice-chair then acting chair of the Ontario Securities Commission. He contributed greatly to the Canadian Jewish community, as president of the National Jewish Immigrant Aid Society (1969-1971) and the Canadian Council for Reform Judaism (1984). He helped to change the exclusive National Club in Toronto by becoming its first Jewish member and by making the motion to admit women members for the first time. Among other honours, he was named honorary life president of Holy Blossom Temple in Toronto. Jack Geller suffered a stroke in 2002 that afflicted his ability to read and speak. In 2008, he and his wife, Sybil, were awarded the Ambassador Award by the Aphasia Institute, for their work in raising awareness of the communication disorder.\n\n\n\nForthcoming: transcript of interview with Jack and Sybil Geller, by A. Kirk-Montgomery, 2010.\n\n\n\nName: KOVACS, Francis\n\nMale Born 1930\n\nDied 1999\n\nCalled to the Bar: 1955\n\nName of Heritage or Community: Hungarian\n\nBiographical Information:\n\nFrancis Kovacs was appointed as judge in Welland County, Ontario Court (General Division), now the Superior Court of Justice, in 1971. In 1993, he presided at the controversial trial and conviction following a guilty plea of Karla Homolka on two counts of manslaughter, 1993.\n\n\n\nNominated by Frank Felkai of the Hungarian Helicon Society.\n\n\n\n\n\nName: COROS, George William\n\nMale\n\nBorn 1930 in Toronto, Ontario\n\nCalled to the Bar: 1956\n\nName of Heritage or Community: Greek\n\nBiographical Information:\n\nOne of the first lawyers of Greek heritage, Mr. Coros practised in Peterborough. Nominated by the Hellenic Canadian Lawyers Association.\n\n\n\nName: EBERS, Cornell George\n\nMale\n\nBorn 1917 in Budapest, Hungary\n\nDied 1994\n\nCalled to the Bar: 1956\n\nQ.C. 1970\n\nName of Heritage or Community: Hungarian\n\nBiographical Information:\n\nCornell Ebers earned a doctor of laws degree at the University of Budapest in 1943 but like many immigrants, had to start his studies over again in Canada. In harrowing journeys, separately, Ebers and his wife and child fled Russian-dominated Hungary in 1949. After a year in Italy, the family emigrated to Canada. Ebers worked as a cutlery salesman and as a hospital orderly at night to support his growing family, while attending classes in the daytime at Osgoode Hall. He articled with J. E. Hare in Delhi, Ontario, where many Hungarian immigrants settled.\n\n\n\nNominated by and with information from Gabor Takach. See also, “Drugs Her Baby, Flees as Russian Soldier,” unattributed newspaper clipping, [20 Sep 1956?], in \"Ebers, Cornell George,\" Law Society of Upper Canada Past Member Database, Law Society of Upper Canada Archives, 2009.\n\nName: MANJURIS, George\n\nMale\n\nBorn 1928\n\nDied 2000\n\nCalled to the Bar: 1956\n\nName of Heritage or Community: Greek\n\nBiographical Information:\n\nGeorge Manjuris was one of the first lawyers of Greek heritage in Ontario. Nominated by the Hellenic Canadian Lawyers Association.\n\nName: TOTH, Bernard\n\nMale\n\nBorn 1930 in Port Colborne, Ontario\n\nDied 2010\n\nCalled to the Bar: 1956\n\nQ.C.\n\nName of Heritage or Community: Hungarian\n\nBiographical Information:\n\nBernard Toth was a second-generation Canadian but one of the first lawyers in Ontario from the Hungarian community. He served as a Deputy Judge of the Small Claims Court at the City of Woodstock, Oxford County, for over 20 years. He was also active in assisting Hungarian Canadians in the tobacco-growing region (Tillsonburg, Delhi, Simcoe, Aylmer). In 2006, Mr. Toth was granted a life membership in the Law Society of Upper Canada.\n\n\n\nNominated by Frank Felkai of the Hungarian Helicon Society. Name: LOUKIDELIS, Spyros Demosthenes\n\nMale\n\nBorn 1930 in North Bay, Ontario\n\nDied 2001\n\nCalled to the Bar: 1957\n\nName of Heritage or Community: Greek\n\nBiographical Information:\n\nSpyros Loukidelis was a first-generation Greek Canadian. His mother was highly educated and his father ran a restaurant in North Bay; both encouraged their sons' education. Loukidelis attended University of Toronto Law School (LLB. 1955) and returned to North Bay to practise, as did his brother Ernest. In 1973, Loukidelis was appointed to the District Court of Ontario in Sudbury and by 1990 he was the Regional Senior Justice, Northeast Region, Ontario Court (General Division). Loukidelis was president of the Ontario County and District Court Judges Association in 1983. Throughout his life he served the Greek Orthodox Church, which in 1984 named him an Archon, a high lay honour. He was also a lifelong scholar of theology and classical studies. In 1992, he was appointed Chancellor of Sudbury's Thorneloe University, part of Laurentian University. Spyros retired from the bench in 1995.\n\nNominated by the Hellenic Canadian Lawyers Association. See also Jim Vavitsas, \"The Loukidelis Brothers: Northern Greek Lights,\" The Legalese. Hellenic Canadian Lawyers Association. March 2004. Web. October 2009.\n\nName: ALLAN, Arthur Steven\n\nMale\n\nBorn 1925 in Greece\n\nDied 2009\n\nCalled to the Bar: 1958\n\nName of Heritage or Community: Greek\n\nBiographical Information:\n\nSteve Allan arrived in Canada with his family from Greece in 1940 and settled in Toronto. He attended Trinity College at the University of Toronto and then Osgoode Hall. After his call to the bar in 1958, he practised civil law for the Crown for about fourteen years. In 1975, he switched to criminal work, often being assigned to prosecute policemen. He told an interviewer that, \"he faced the best criminal lawyers in town...and got hammered on a regular basis.\" Mr. Allan remained with the Crown Attorney’s office until he retired in the late 1990s.\n\n\n\nNominated by the Hellenic Canadian Lawyers Association. See also Law Society of Upper Canada Archives, Hellenic Canadian Lawyers Association Files, \"Notes of Interview with Steve Allan,\" 14 Nov. 2003.\n\nName: BRAITHWAITE, Leonard A.\n\nMale\n\nBorn 1923 in Toronto, Ontario\n\nDied 2012\n\nCalled to the Bar: 1958\n\nQ.C.\n\nName of Heritage or Community: Black\n\nBiographical Information:\n\nBorn in Toronto of West Indian immigrant parents, Leonard Braithwaite was raised in the Kensington Market area during the Great Depression. He served in the RCAF in 1943 overseas. He graduated from the University of Toronto (1950), Harvard University (MBA, 1952), and Osgoode Hall Law School (LLB 1958). In 1963, he became the first Black person elected to a legislature in Canada, and in 1999, the first Black lawyer elected to the governing council of the Law Society of Upper Canada. Braithwaite’s life-long actions in many fields have helped effect change and opened doors for aspiring minority Canadians. In 1964, his work led to the abolition of the 114-year-old law permitting segregation in Ontario schools. In 1971, partly because of his efforts on behalf of gender equality, girls were first chosen as pages in Queen’s Park. Braithwaite was awarded the Order of Canada in 1997 and the Order of Ontario in 2005.\n\n\n\nSee Ron Csillag, “Leonard Braithwaite, Canada’s first black parliamentarian, dead at 88,” theglobeandmail.com 20 April 2012. Web; “Stanley C. Lartey, \"My Visit with Leonard A. Braithwaite, C.M., O.Ont., Q.C.,\" Ontario Black History Society. Web. Dec. 2009; Dawn Williams, Who's Who in Black Canada 2: Black Success and Black Excellence in Canada, A Contemporary Directory (Toronto: University of Toronto Press, 2006), 75; Interviewee, Osgoode Society Oral History Programme. Name: MEYER, Willem John Bernard\n\nMale\n\nBorn 1931 in Holland\n\nDied 2010\n\nCalled to the Bar: 1958\n\nQ.C.\n\nName of Heritage or Community: Dutch\n\nBiographical Information:\n\nAccording to Willem Meyer, his law career was more a tale of survival than importance. In 1950, he arrived in Canada from Holland with only a guitar and fifty dollars. He managed to enter Osgoode Law School aided by Dean Smalley Baker. His first articles were with Kimber and Dubin, who taught him the language and the craft of lawyering. In his practice, he served Dutch clients but soon learned Italian to serve the immigrants arriving in Toronto. He was able to attract good partners which broadened the practice considerably. The firm, long after his retirement, still uses his name, which pleased him. A few months before his death, he wrote, “I loved the law but was often struck by the profession’s clannishness. My real aim in life was to be independent and never to have a person with authority above me. This plan I was lucky to achieve.”\n\nNominated by Marten A. Mol, Canadian Netherlands Business and Professional Association. See transcript of interview of Lucy Meyer by A. Kirk-Montgomery, 2010, forthcoming.\n\n\n\nName: POOLMAN, Willem George\n\nMale\n\nBorn 1923 in Malang, Indonesia\n\nDied 2009\n\nCalled to the Bar: 1958\n\nName of Heritage or Community: Dutch\n\nBiographical Information:\n\nWillem Poolman was one of the first Ontario lawyers of Dutch heritage. He studied law in the Netherlands at Leiden University, emigrating to Canada in the 1950s. He graduated from Trinity College at the University of Toronto and studied law at Osgoode Hall. In Toronto, he practised commercial, property and tax law. In addition to his legal career, Poolman devoted his energies to the Canadian film industry. He founded the first independent Canadian film distribution company in 1964, and introduced European and Quebecois directors to Ontario audiences. Mr. Poolman was made a life member of the Law Society of Upper Canada, and practised until his death in 2009.\n\n\n\nNominated by Andrew Frei. Source: Obituary. Toronto Globe & Mail , 11 June 2009. Web. July 2009.\n\nName: SPEAL, George Nicholas\n\nMale\n\nBorn 1932 in Kingston, Ontario\n\nDied 2008\n\nCalled to the Bar: 1958\n\nQ.C.\n\nName of Heritage or Community: Greek\n\nBiographical Information:\n\nGeorge Speal's parents were born in Greece and emigrated to Canada before the First World War. Speal became a lawyer and was named Q.C. in 1974. Entering politics, he immersed himself in the concerns of his native city, joining many organizations and supporting local causes. He served as the mayor of Kingston when the Queen visited the city (1973) and when it hosted the Olympic sailing events (1976). In 1997 he received the Distinguished Service Award from the Canadian Bar Association. He wrote his memoir for the Law Society of Upper Canada in 2002.\n\n\n\nNominated by the Hellenic Canadian Law Association. Source: Law Society of Upper Canada Archives, Hellenic Canadian Law Association Files, \"George Nicholas Speal, Q.C.\" See also Law Society of Upper Canada Archives, Heritage Committee Sole and Small Practitioners Memoir Project Files, George Speal Memoir (2002).\n\nName: WANG, Kechin\n\nMale\n\nBorn 1919\n\nDied 2000\n\nCalled to the Bar: 1958\n\nQ.C.\n\nName of Heritage or Community: Chinese\n\nBiographical Information:\n\nKechin Wang was one of the first Chinese Canadian lawyers, and an early Q.C. (1967) from that community. In 1971, he was appointed a provincial court judge in the family division, at Toronto.\n\n\n\nNominated by the Federation of Asian Canadian Lawyers.\n\n\n\nName: KOKONIS, James D.\n\nMale\n\nBorn 1932 in Toronto, Ontario\n\nCalled to the Bar: 1959\n\nQ.C.\n\nName of Heritage or Community: Greek\n\nBiographical Information:\n\nJames Kokonis is one of the first lawyers of Greek heritage to specialize in intellectual property litigation. He practises in Toronto with Smart & Biggar and takes cases at all levels of courts. He has written and lectured on the subject of intellectual property, and is recognized internationally as a top patent lawyer. He was appointed Q.C. in 1974. Mr. Kokonis is a member of the Advocates' Society.\n\n\n\nNominated by the Hellenic Canadian Lawyers Association.\n\nName: LOUKIDELIS, Ernest\n\nMale\n\nBorn 1934 in North Bay, Ontario\n\nCalled to the Bar: 1959\n\nName of Heritage or Community: Greek\n\nBiographical Information:\n\nErnest Loukidelis attended the University of Toronto (BA, 1954). After his call to the bar, he practised law in his home town of North Bay. Ernest served as president of the local Children's Aid Society, was on the Board of Governors of Nipissing University, and was elected as a city councillor. In 1980 he was appointed to the Ontario District Court, now known as the Ontario Court of Justice, in Parry Sound. After nearly thirty years on the bench, he retired in 2009 and moved back to North Bay. Ernest Loukidelis is one of the first lawyers of Greek heritage in Ontario, following his brother Spyros, who had also been appointed a judge.\n\n\n\nNominated by the Hellenic Canadian Lawyers Association. See also Jim Vavitsas, \"The Loukidelis Brothers: Northern Greek Lights,\" The Legalese. Hellenic Canadian Lawyers Association. March 2004. Web. October 2009.\n\nName: MCCORMACK, Charles Stewart\n\nMale\n\nBorn 1929\n\nDied 1992\n\nCalled to the Bar: 1959\n\nQ.C. 1982\n\nName of Heritage or Community: Persons with Disabilities\n\nBiographical Information:\n\nCharlie McCormack lost his sight after he was hit by a baseball at nine years old. He attended the Ontario School for the Blind in Brantford, then graduated from McMaster University. One of the few blind lawyers in Ontario, he was called to the bar in 1957. \"Loss of sight is an inconvenience, but it is not a handicap,\" he told an interviewer in that year.\n\n\n\nSource: Charlie McCormack as told to John Schneller, \"It Helps to Have Humour,\" Obiter Dicta, Spring 1957, 13-15.\n\n\n\nName: WILSON, Bertha\n\nFemale\n\nBorn 1923 in Kirkcaldy, Scotland\n\nDied 2007\n\nCalled to the Bar: 1959\n\nName of Heritage or Community: Women\n\nBiographical Information:\n\nBertha Wilson, the first woman appointed to the Supreme Court of Canada, trained as a teacher before she emigrated to Canada in 1949. She earned her LLB. at Dalhousie University and was called to the bar of Nova Scotia in 1957. From 1959 to 1975, she practised law and became a partner with Osler, Hoskin & Harcourt in Toronto. In 1975, she was the first woman appointed to the Court of Appeal for Ontario. She became the first woman appointed to the Supreme Court of Canada, taking her seat in 1982, just before the Charter of Rights and Freedoms came into force. According to her biographer, Ellen Anderson, through her pioneering jurisprudence, her post-retirement study of gender equality in the legal profession (1993), and her leading role in the Royal Commission for Aboriginal Peoples (1991-1996), Bertha Wilson “helped to create a shifting Canadian consensus about justice, about fairness, and about reciprocal rights and responsibilities.” (xvii)\n\n\n\nSource: Ellen Anderson, Judging Bertha Wilson: Law as Large as Life (The Osgoode Society for Canadian Legal History by University of Toronto Press, 2001). Name: WYCHOWANEC, Stephanie Jessie\n\nFemale\n\nBorn 1933 in Montreal, Quebec\n\nCalled to the Bar: 1959\n\nQ.C.\n\nName of Heritage or Community: Ukrainian\n\nBiographical Information:\n\nStephanie Wychowanec is one of the first women lawyers of Ukrainian heritage in Ontario. She is also one of the first women to reach the highest levels of the Ontario civil service. After a short period in private practice, she joined the Treasurer of Ontario in 1961 and then moved to the Ontario Energy Board. In 1971, she was appointed Queen's Counsel. She served as deputy minister of the Ontario Justice Secretariat from 1984 through 1987, only the third woman in the province’s history to attain this rank. Ms. Wychowanec was the chair of the Ontario Energy Board from 1988 to 1991. She told reporter Christine Ward, “I helped prove that women can succeed in law as well as men.”\n\nSee also Christine Ward, \"The Changing Tide,\" Continuum 33 (2009), 16. Osgoode Alumni. Web. October 2009.\n\nName: ISAAC, Julius A.\n\nMale\n\nBorn 1928 in St. David’s, Grenada, West Indies\n\nDied 2011 in Regina, SK\n\nCalled to the Bar: 1960\n\nName of Heritage or Community: Black\n\nBiographical Information:\n\nAn immigrant in 1955, Julius Isaac became the first Black Chief Justice of any court in Canada and a leader of the West Indian communities of Ontario. He studied law at the University of Toronto. Despite his brilliance, his early career was difficult “because of the colour situation” according to his wife, Ann (Toronto Star). However, following a decade of private practice in criminal and civil litigation, and eighteen years with the federal Department of Justice, he was appointed to the Supreme Court of Ontario in 1989. In 1991 he received his groundbreaking appointment as Chief Justice of the Federal Court of Canada, serving until 1999. Isaac kept strong ties to the Caribbean, serving as a senior magistrate in Grenada (1976) and chair of an inquiry into politically linked violence in Jamaica (2002). Mr. Isaac was honoured widely for his achievements, for his mentorship of young lawyers, and for his contributions to his community. He received the Canadian Black Achievement Award in Law in 1994 and was named an Officer of the Order of Canada in 2006.\n\n\n\nSee Dawn Williams, Who's Who in Black Canada 2: Black Success and Black Excellence in Canada, A Contemporary Directory (Toronto: University of Toronto Press, 2006), 182-3. Brian Seaman, \"The Honourable Justice Julius Isaac: A Model of Productive Retirement,\" LawNow, March-April,\n\n2007; Galit Rodan, “Canada’s First Black Chief Justice Dies,” Toronto Star, 20 July 2011.\n\nName: FRIEDLAND, Martin L.\n\nMale\n\nBorn 1932 in Toronto, Ontario\n\nCalled to the Bar: 1960\n\nQ.C.\n\nName of Heritage or Community: Jewish\n\nBiographical Information:\n\nMartin Friedland's \"outstanding contributions to the Canadian legal system and to the administration of justice\" were recognized by the Governor General when he was invested as Companion of the Order of Canada in 2003. He has served on the Law Reform Commission of Canada (1971-2). A distinguished educator, he has taught at Osgoode Hall Law School and later at the University of Toronto, where he was dean of the law school (1972-9). His scholarly writings on judicial accountability and his eighteen books, numerous articles and reports on a wide range of topics have been influential in Canada and abroad. He has also invigorated the study of the history of crime and criminal justice through prize-winning books for academic and general audiences. In The Trials of Israel Lipski (1984) and The Case of Valentine Shortis (1986) Friedland shows that politics, culture and personality, not just the law, shaped the outcomes in two fascinating nineteenth century murder trials.\n\n\n\nSee also Martin L. Friedland, My Life in Crime and Other Academic Adventures (Toronto: University of Toronto Press, 2007); Order of Canada Citation, \"Martin L. Friedland, C.C., Q.C., Ph.D., LL.D., F.R.S.C.,\" Governor General of Canada, Governor General of Canada. Interviewee, Osgoode Society Oral History Programme.\n\nName: PAUL, Nicholas P.\n\nMale\n\nBorn 1935 in Toronto, Ontario\n\nCalled to the Bar: 1960\n\nQ.C.\n\nName of Heritage or Community: Greek\n\nBiographical Information:\n\nNick Paul attended University College and Osgoode Hall before being called to the bar. He began in litigation with a client base of Greek immigrants but gradually shifted to a wider commercial practice. In his later career, he acted as counsel in numerous mediations and arbitrations under the alternative dispute resolution programme, with experience in ecclesiastical cases. For many years until 2004, he served on the Osgoode Hall Alumni Association Board of Directors. He is proud of his sponsorship of the 1991 retroactive awarding of the LLB (law degree) to all lawyers who graduated from Osgoode Hall before it became a university.\n\n\n\nNominated by the Hellenic Canadian Lawyers Association. Forthcoming, transcript of interview with Nicholas Paul, by A. Kirk-Montgomery, 2010.\n\nName: SHAMESS, Alfred Ely\n\nmale\n\nBorn 1932 in Blind River, Ontario\n\nCalled to the Bar: 1960\n\nName of Heritage or Community: Lebanese; Antiochian Orthodox Christian\n\nBiographical Information:\n\nAfter graduating from Osgoode Hall Law School in 1960 and a brief period in practice in Sudbury with the law firm of Hawkins & Gratton, Alfred Shamess joined the legal department at Chrysler Canada Ltd. in Windsor, Ontario. He was Chrysler Canada’s legal representative on various external organizations, including the Canada Manufacturers’ Association, the Motor Vehicle Manufacturers’ Association (Canada) and the Windsor/Essex County Development Commission, on which he served as chairman for two years in the mid-1980s. In 1989, he transferred to the parent corporation, Chrysler Corporation in Highland Park, Michigan, as an international counsel on the staff of the General Counsel. In 1995, he was appointed acting director of insurance and risk management. When he retired in 1999, Mr. Shamess had served thirty-seven years with Chrysler in Canada and the United States.\n\n\n\nNominated by Bruce A. Thomas.\n\nName: SOPINKA, John\n\nMale\n\nBorn 1933 in Broderick, Saskatchewan\n\nDied 1997\n\nCalled to the Bar: 1960\n\nQ.C.\n\nName of Heritage or Community: Ukrainian\n\nBiographical Information:\n\nJohn Sopinka’s mother, who emigrated with his father in the 1920s, never learned to read or write but Sopinka was the first person of Ukrainian heritage to be appointed to the Supreme Court of Canada, in 1988. Before his appointment, Sopinka was a renowned trial lawyer and wrote an authoritative text on the law of evidence. He served many high-profile clients including the Aga Khan, and he was an elected bencher of the Law Society from 1983 to 1988. His interest in Ukrainian issues also shaped his career. He was the advocate for the Ukrainian Canadian Civil Liberties Association as it participated in the Commission of Inquiry on War Criminals in 1985. In 1988, he was lead counsel at an International Commission on the Ukrainian Famine. Sopinka was also the first Supreme Court justice in decades to be appointed without having been a judge in a lower court.\n\n\n\nSource: Christopher Guly, \"Supreme Court Justice John Sopinka dies at 64,\" Ukrainian Weekly, v. 65, 48 (November 30, 1997). Web. Nov. 2009; \"Sopinka, John,\" Law Society of Upper Canada Past Member Database, Law Society of Upper Canada Archives, 2009. Interviewee, Osgoode Society Oral History Programme.\n\nName: STORTINI, Ray\n\nMale\n\nBorn 1929 in Sault Ste. Marie, Ontario\n\nCalled to the Bar: 1960\n\nName of Heritage or Community: Italian\n\nBiographical Information:\n\nRay Stortini’s parents emigrated from Italy to Sault Ste. Marie. After working as a Great Lakes seaman, a steel plant labourer, and an insurance adjuster, Ray decided on a career in law. Following a decade in general practice, he became one of the first judges of Italian origin in Ontario when he was appointed as a judge of York County at Toronto in 1971. In Toronto, he established Canada’s first community service order program. He returned north as a judge of the Algoma District Court in 1976, then in 1990 the Superior Court of Justice. He studied French in order to preside over trials in both official languages. Since his retirement from the bench in 2004, he has continued to be a leader in a wide variety of community organizations, most recently through his successful campaign to build a lighthouse on St. Joseph Island in the St. Mary's River near Sault Ste. Marie. In 2011, Ray Stortini was appointed to the Order of Ontario for initiating the community service program for non-violent offenders.\n\n\n\nSee Dan Bellerose, “Two from Sault receive Order of Ontario,” saultstar.com, 2 Feb. 2012, Web; Ray Stortini, Only in Canada: Memories of an Italian Canadian (2006). See transcript of interview with the Honourable Ray Stortini by A. Kirk-Montgomery, 2011, forthcoming.\n\nName: THOMAS, Bruce A.\n\nMale\n\nBorn 1933 in Toronto, Ontario\n\nCalled to the Bar: 1960\n\nQ.C.\n\nName of Heritage or Community: Lebanese\n\nBiographical Information:\n\nBruce Thomas is one of the first Ontario lawyers of Lebanese heritage to be named Q.C. (1978). Thomas' grandparents were born in Syria during the Ottoman empire, emigrated to Northern Ontario in the 1890s, and prospered in the retail trades. He was raised in Midland and is a graduate of Upper Canada College, the University of Western Ontario, and Osgoode Hall Law School. Thomas is a leading lawyer in Canadian insurance law and litigation. Having retired as partner from Cassels Brock & Blackwell LLP, he is a founding partner of Thomas Gold Pettingill LLP. He is married to Gayle Eva Lepine, with whom he has four children: Andrea Thomas-Hill, James Thomas, Liane Thomas-Hicks, and Bruce Edward Alexander Thomas.\n\n\n\nNominated by the Arab Canadian Lawyers Association.\n\n\n\n1961 – 1970\n\nName: ALI, Syed Mumtaz\n\nMale\n\nBorn 1926 in India\n\nDied 2009\n\nCalled to the Bar: 1962\n\nName of Heritage or Community: Muslim; South Asian\n\nBiographical Information:\n\nSyed Ali was the first male South Asian lawyer called to the bar in Ontario, in 1962, and a leading proponent of Shariah law, based on the Qur’an. He studied theology, arts and Muslim law at several universities in India, Pakistan, and England. He also practised law for five years in Pakistan before emigrating to Canada in 1960. After graduating from Osgoode Hall Law School, he took his legal oath over the Qur'an, the first time the Qur'an was used during the ceremony. He worked for the government of Ontario as legal counsel in corporate law. In 2003, after his retirement, he founded the Islamic Institute of Civil Justice as an arbitration body to settle civil disputes under Shariah law, as permitted under the 1991 Ontario Arbitration Act. Since 2006 such faith-based arbitrations are no longer permitted within the Act.\n\n\n\nNominated by the Canadian Muslim Lawyers Association, and the South Asian Lawyers Association. Source: \"Syed Mumtaz Ali, 1st Muslim lawyer in Canada, dies at 82,\" CBC.ca. 17 July 2009. Web. 19 July 2009.\n\nName: SCOTT, Ian\n\nMale\n\nBorn 1934 in Ottawa, Ontario\n\nDied 2006\n\nCalled to the Bar: 1959\n\nQ.C. 1973\n\nName of Heritage or Community: Lesbian, Gay, Bisexual, Transgendered or Two-Spirited\n\nBiographical Information:\n\nIan Scott set out “to make a difference,” in the words of the title of his memoir, and as the leading cabinet member in David Peterson’s Liberal government and especially as the Attorney General of Ontario from 1985 to 1990, he did. An innovative courtroom lawyer who took some of the first Charter cases to the Supreme Court, he brought his advocate's skills and sensibilities to politics. He introduced many reforms including pay equity, no-fault insurance, freedom-of- information legislation. His reforms of the justice system included restructuring of the courts, abolishing Queen’s Counsel appointments and introducing an independent advisory committee to make judicial appointments more merit-based; the latter measure resulted in a bench that became more representative of Ontario’s diversity. He was also one of the first politicians to identify himself as gay, though he waited until his political career ended. He left politics in 1992 and returned to practice until a stroke two years later stopped a brilliant political and legal career.\n\n\n\nSources: Christopher Moore, \"Ian Scott was Advocate and Politician,\" Law Times, 16 Oct. 2006; Denise Balkisoon, \"Out Law: Gay Lawyers Don't Hide in Closets Anymore,\" Canadian Lawyer, Spring 2008. See also Ian Scott with Neil McCormick, To Make a Difference: A Memoir (Toronto: Stoddart, 2001).\n\n\n\n\n\nName: TOKIWA, Paul Yoshiharu\n\nMale\n\nBorn 1927 in Ocean Falls, British Columbia\n\nDied 1994\n\nCalled to the Bar: 1962\n\nQ.C.\n\nName of Heritage or Community: Japanese\n\nBiographical Information:\n\nAfter enduring the injustices meted out to Japanese-Canadians in British Columbia during the Second World War, Paul Tokiwa and his family moved to Toronto. He became one of the first lawyers of Japanese heritage in Ontario, a partner until 1983 with Millar, Alexander, Tokiwa, and Isaacs. Its principals, uniquely for the period, belonged to several diverse communities, respectively Irish, Black, Irish, Japanese, and Aboriginal; the firm was known as Hamilton's \"United Nations\" law firm. Philip Sworden considers that this relatively small law office \"was a leader in addressing the issue of race and the practice of law...[and] an inspiration to other visible minority lawyers.\"\n\n\n\nSource: P. Sworden, \"'A Small United Nations': The Hamilton Firm of Millar, Alexander, Tokiwa, and Isaacs, 1962-1993,\" in C. Wilton, ed. Inside the Law: Canadian Law Firms in Historical Perspective (Toronto: University of Toronto Press, 1996), 469-97.\n\nName: IANNI, Ronald William\n\nMale\n\nBorn 1935 in Sault Ste. Marie, Ontario\n\nDied 1997\n\nCalled to the Bar: 1963\n\nQ.C.\n\nName of Heritage or Community: Italian\n\nBiographical Information:\n\nA distinguished Italian-Canadian academic, Ronald Ianni studied at the University of Windsor, and became dean of the Faculty of Law and later president of his alma mater. He contributed to many Windsor and international organizations, serving as president of the local United Way, legal representative on the Canadian delegation to the United Nations, and vice president of the Canadian Civil Liberties Association.\n\n\n\nSource: Patrick Lesage, \"The Legacy of Ron Ianni,\" Italian Canadiana 15 (2001), 30-37. utoronto.ca/iacobucci. The Frank Iacobucci Centre for Italian Canadian Studies, Department of Italian Studies, University of Toronto. Web. Feb. 2010.\n\n\n\nName: ROACH, Charles\n\nMale\n\nBorn 1933 in Port-of-Spain, Trinidad and Tobago\n\nDied 2012\n\nCalled to the Bar: 1963\n\nName of Heritage or Community: Black African\n\nBiographical Information:\n\nCharles Roach emigrated to Canada in 1955 intending to become a priest but instead became one of the first African-Canadian lawyers in Ontario. A prominent civil rights lawyer with a primarily Black clientele, he has represented political asylum seekers (members of the Black Panthers in the 1960s) and domestic workers under threat of deportation (Jamaican nannies in the 1970s). One of his long-term causes is to increase the Black participation in the political process, particularly in voting. Another is to make Canada a republic. He is a also a vigorous proponent of African- Canadian heritage and culture and is a founder of Caribana, the annual celebration of Caribbean culture held in Toronto.\n\n\n\nSee also Christian Cotroneo, \"In Pursuit of 'Greatness'; Four Local Black Mentors Recognized for their Years of Grassroots Effort in the Community,\" Toronto Star, 19 Dec. 2005, B02.\n\nInterviewee, Osgoode Society Oral History Programme.\n\n\n\nName: STAYSHYN, Walter\n\nMale\n\nBorn 1934 in Hamilton, Ontario\n\nCalled to the Bar: 1963\n\nName of Heritage or Community: Ukrainian; Roman Catholic\n\nBiographical Information:\n\nWalter Stayshyn earned his BA (1958) and a “letter” for football and basketball at McMaster University. After graduating from Osgoode Hall Law School (LLB., 1961), he returned to Hamilton to article with John Agro, an early outstanding trial lawyer of Italian heritage. Stayshyn became a founding partner of Borkovich and Stayshyn. In 1975, he was one of the first Ukrainian-Canadian lawyers to be appointed to the bench, following Walter Tuchtie, a parental friend for whom he was named. As a Superior Court justice in a challenging period, Stayshyn served almost 35 years, including a decade as a supernumerary judge. For decades he also contributed his energies to volunteer work with local health and service agencies, including as chairman of the Hamilton-Wentworth Legal Aid Area Committee, the District Health Council, the Hamilton Hospitals’ Joint Action Committee, St. Joseph’s Foundation, and as honorary chairman of the Hamilton Multiple Sclerosis Carnation Campaign.\n\n\n\nSee also Barbara Brown, \"Stayshyn Has Seen Good, Bad, and Ugly,\" Hamilton Spectator, 13 Nov. 1999; Barbara Brown, \"Bittersweet Departure for Judge,\" Hamilton Spectator, 14 Nov. 2009.\n\nName: SALHANY, Roger\n\nMale\n\nBorn 1937 in Cornwall, Ontario\n\nCalled to the Bar: 1964\n\nQ.C.\n\nName of Heritage or Community: Arab\n\nBiographical Information:\n\nIn 1975, Roger Salhany was the first lawyer of Arab Canadian heritage to be elected as a bencher of the Law Society of Upper Canada. He was a lecturer at the University of Windsor Law School from 1977-79, the Bar Admission Course from 1968-78, the Federation of Law Societies from 1972-79 and the Canadian Judicial Council Seminars from 1979-1993. He was appointed at Queen's Counsel in 1976. In 1978, he was appointed a judge of the Ontario County Court, later Ontario Court (General Division) and served as a justice of the Ontario Superior Court from 1991 to 1999. He is the author of eight works on criminal procedure, criminal evidence and civil practice. In 2008, he was appointed commissioner by the province of Manitoba of the Taman Inquiry into the investigation and prosecution following the death of a Manitoba woman. The fourteen recommendations in his report, which included the creation of an independent special investigative unit, were accepted by the Manitoba government and have been praised by other provinces.\n\n\n\nNominated by the Arab Canadian Lawyers Association. See also George Wright, \"Introduction of The Honourable Roger Salhany, Q.C., CACOLE Conference Keynote Luncheon Speaker, Ottawa, On. June 9, 2009,\" cacole.ca. Canadian Association for Civilian Oversight of Law Enforcement Web. Oct. 2009.\n\nName: VERBEEK, Leonard\n\nMale\n\nBorn 1915\n\nDied 2000\n\nCalled to the Bar: 1964\n\nName of Heritage or Community: Dutch\n\nBiographical Information:\n\nLeonard Verbeek was one of the first Ontario lawyers of Dutch background.\n\n\n\nNominated by Marten A. Mol, Canadian Netherlands Business and Professional Association.\n\n\n\nName: DE SOMMER, Joseph A.\n\nMale\n\nBorn 1928\n\nCalled to the Bar: 1965\n\nQ.C.\n\nName of Heritage or Community: Hungarian\n\nBiographical Information:\n\nLongtime counsel to the Office of the Public Guardian and Trustee, the agency responsible for protecting the rights and interests of mentally incapable Ontarians and for monitoring charities, among other roles, Joseph DeSommer is a past president of the Hungarian Helicon Society.\n\n\n\nNominated by Frank Felkai of the Hungarian Helicon Society.\n\nName: PITT, Romain W.M.\n\nMale\n\nBorn 1935 in Grenada\n\nDied 2020\n\nCalled to the Bar: 1965\n\nName of Heritage or Community: Black\n\nBiographical Information:\n\nThe nephew of B.J. Pitt, one of the first Black lawyers in Ontario, Romain Pitt was appointed to the Superior Court of Justice in 1994.\n\nName: COUTO, Ayres Victor\n\nMale\n\nBorn 1930 in India\n\nCalled to the Bar: 1966\n\nName of Heritage or Community: South Asian\n\nBiographical Information:\n\nJustice Couto was the first lawyer of South Asian heritage to be appointed as a provincial judge in Ontario, in 1984, and also was the first lawyer of South Asian heritage to be appointed as Queen's Counsel, in 1978.\n\n\n\nSource: Sutapa Bridgman,\"Firsts and Notable Accomplishments by South Asian Men and Women of the Bar,\" South Asian Lawyers Association, 2002.\n\n\n\n\n\nName: ISAACS, Peter\n\nMale\n\nBorn 1938 in Oshweken, Ontario\n\nCalled to the Bar: 1966\n\nName of Heritage or Community: Aboriginal\n\nBiographical Information:\n\nPeter Isaacs is a Mohawk and one of the first Aboriginal lawyers in Ontario. In the 1960s, he was a partner in the leading Hamilton firm of Millar, Alexander, Tokiwa and Isaacs, a multi-ethnic firm whose successful real estate practice depended in part on its ability to attract clients of diverse communities. In 1995, he became one of the first judges of Aboriginal heritage, appointed to the Ontario Court of Justice in Stratford.\n\n\n\nSource: Philip Sworden, \"'A Small United Nations': The Hamilton Firm of Millar, Alexander, Tokiwa, and Isaacs, 1962-1993,\" in C. Wilton, ed. Inside the Law: Canadian Law Firms in Historical Perspective (Toronto: University of Toronto Press, 1996), 469-97.\n\nName: STAATS, Howard Edwin\n\nMale\n\nBorn 1940 in Six Nations Territory\n\nCalled to the Bar: 1966\n\nQ.C.\n\nName of Heritage or Community: Aboriginal\n\nBiographical Information:\n\nOne of the first Aboriginal lawyers in Ontario, Howard Staats practises in Brantford. Born and raised on the Six Nations Reserve, his determination to achieve without boundaries has enabled him to set an example to all, especially to Native youth, that all dreams are attainable. Many years of professionalism, compassion, confidence and proven results have made him a pillar of the Brant County legal community. Mr. Staats was named Q.C. in 1979. His achievements have inspired his own family as well; his son Mark Staats is currently practising with the firm, and a granddaughter is presently on her path to becoming a lawyer.\n\nName: YACHETTI, Roger Dennis\n\nMale\n\nBorn 1940 in Hamilton, Ontario\n\nDied 2018\n\nCalled to the Bar: 1966\n\nQ.C.\n\nName of Heritage or Community: Italian\n\nBiographical Information:\n\nRoger Yachetti's parents were determined that their son would be a lawyer after they sued a meat packer and a butcher, who sold them tainted meat, and could not afford to appeal their loss at trial (Yachetti v. John Duff & Sons and Paolini [1942], O.R. 682). He did indeed become a distinguished Hamilton litigation lawyer and leader of the local bar and community. He was the first president of the Law Clerks’ Association, having served as law clerk to the Chief Justice of the High Court of Ontario. In practice in Hamilton, he was the founding president of the Hamilton Criminal Lawyers’ Association. He also served sixteen years as a bencher of the Law Society and is now an ex-officio bencher for life. In addition to many awards for his contributions to his city, in 2004 he received the Emilius Irving Award from the Hamilton Law Association for service to his legal community.\n\n\n\nName: VASILAROS, Leslie\n\nMale\n\nBorn 1932 in Samos, Greece\n\nCalled to the Bar: 1967\n\nName of Heritage or Community: Greek\n\nBiographical Information:\n\nLes Vasilaros was born in Samos, Greece on June 3, 1932. He lived in many places in Greece during World War II and the Greek civil war before coming to Canada, through Pier 21 in Halifax in November, 1951. Les settled in Kingston, Ontario where he began learning the English language. He received a bachelor’s degree in economics in 1960 from McMaster University and thereafter graduated from the University of Toronto law school. He was called to the bar in 1967 and was therefore one of the first Greek-born persons to join Ontario’s legal profession. Les’ law practice serviced the needs of Greek-Canadians in real estate, commercial and estate planning law. He thoroughly enjoyed his role in advising and helping members of the Greek community to establish and build their lives in Canada. He acted as counsel for the Greek Orthodox Church of Toronto (Canada) and was a founding member of the Hellenic Canadian Lawyers Association.\n\n\n\nNominated by the Hellenic Canadian Lawyers' Association.\n\nNom : BEAULIEU, Lucien\n\nHomme\n\nNé en 1933 à Mutrie en Saskatchewan\n\nAdmission au Barreau: 1968\n\nNom du patrimoine ou de la collectivité: Francophone\n\nBiographie :\n\nLucien Beaulieu est d'abord travailleur social avant de devenir un des premiers juges Francophones en Ontario. Au début de sa carrière, il est aussi procureur adjoint de la Couronne à Toronto. En 1971, il devient directeur provincial des appels pour le Régime d'aide juridique de l'Ontario. Il est nommé à la Cour provinciale de l'Ontario (division de la famille) en 1973, et en 1993 devient membre de ce qui est maintenant la Cour supérieure de justice. Le juge Beaulieu est aussi juge adjoint de la Cour territoriale du Yukon à partir de 1989 et de la Cour suprême du Territoire du Yukon à partir de 1994. Parmi les nombreux organismes juridiques auxquels il a participé, soulignons l'Association internationale des magistrats de la jeunesse et de la famille de 2000 à 2004. Depuis sa retraite en 2008, il est conférencier de l'Institut national de la magistrature sur les questions de retraite et de déontologie judiciaire.\n\n\n\nNomination faite par l'Association des juristes d'expression française de l'Ontario.\n\n\n\nName: BEAULIEU, Lucien\n\nMale\n\nBorn 1933 in Mutrie, Saskatchewan\n\nCalled to the Bar: 1968\n\nName of Heritage or Community: Francophone\n\nBiographical Information:\n\nLucien Beaulieu began as a social worker but became one of the first Francophone judges in Ontario. In his early legal career, he was an assistant Crown Attorney in Toronto. In 1971, he became the Provincial Director of Appeals for the Ontario Legal Aid Plan. He was appointed to the Ontario Provincial Court (Family Division) in 1973, and in 1993 to what is now the Superior Court of Justice. Justice Beaulieu also served as deputy judge of the Territorial Court of the Yukon from 1989 and of the Supreme Court of the Yukon Territory from 1994, and the Supreme Court of the Northwest Territories. He presided over special bilingual and French trials in all jurisdictions. Among many legal organizations to which he has contributed is the International Association of Youth and Family Court Judges and Magistrates (president, 2000 to 2004). Retired in 2008, he is now a guest lecturer with the National Judicial Institute on the subject of retirement and judicial ethics.\n\n\n\nNominated by the Association des juristes d'expression française de l'Ontario.\n\nName: KHOORSHED, Minoo F.\n\nMale\n\nBorn 1938 in India\n\nCalled to the Bar: 1968\n\nName of Heritage or Community: South Asian\n\nBiographical Information:\n\nMinoo Khoorshed was a lawyer in Bombay before he emigrated to Canada in 1963. In Ontario, he practised in Timmins and London. In 1971, he joined the public sector, prosecuting cases of environmental pollution for the Ministry of the Environment. In 1992, he was appointed to the Ontario Court of Justice and became one of the first judges of South Asian heritage. Justice Khoorshed, who sits in Brampton, speaks several South Asian languages.\n\n\n\nSource: Sutapa Bridgman,\"Firsts and Notable Accomplishments by South Asian Men and Women of the Bar,\" South Asian Lawyers Association, 2002.\n\nNom: LE DAIN, Gerald Eric\n\nHomme\n\nNé en 1924 à Montréal au Québec\n\nDécédé en 2007\n\nAdmission au Barreau: 1968\n\nNom du patrimoine ou de la collectivité: Francophone\n\nBiographie:\n\nMe Gérald Éric Le Dain est le premier Francophone de l'Ontario nommé à la Cour suprême du Canada. Après avoir servi outre-mer pendant la Deuxième Guerre mondiale, il obtient des diplômes de l'Université McGill et de l'Université de Lyon en France. Il est admis au Barreau du Québec en 1949; pendant les années 1950 et 1960, il enseigne à l'Université McGill et pratique le droit à Montréal. De 1967 à 1972, il est doyen de l'école de droit d’Osgoode Hall. De 1969 à 1973, il préside ce qu'on a appelé la Commission Le Dain sur l’usage des drogues à des fins non médicales. Il a recommandé la décriminalisation de l'utilisation de la marijuana. Le juge Le Dain siège d'abord en 1975 à la Cour d'appel fédérale et à la Cour d'appel de la cour martiale. Il est nommé à la Cour suprême du Canada en 1984 où il sert jusqu'en novembre 1988. En 1989, il est nommé Compagnon de l'Ordre du Canada.\n\nSource : « L’honorable Gerald Eric Le Dain », scc-csc.gc.ca, Cour suprême du Canada. Web. Oct. 2009.\n\n\n\nName: LE DAIN, Gerald Eric\n\nMale\n\nBorn 1924 in Montreal, Quebec\n\nDied 2007\n\nCalled to the Bar: 1968\n\nName of Heritage or Community: Francophone\n\nBiographical Information:\n\nGerald Eric Le Dain was the first Francophone from Ontario appointed to the Supreme Court of Canada. After serving overseas in the Second World War, he earned degrees at McGill University and at the University of Lyon in France. He was called to the bar in Quebec in 1949; during the 1950s and 1960s, he taught at McGill University and practised law in Montreal. From 1967 to 1972, he was dean of Osgoode Hall Law School. From 1969 to 1973 he chaired what became known as the Le Dain Commission into the Non-Medical Use of Drugs. His report recommended the decriminalization of marijuana use. Justice Le Dain was first appointed to the bench in 1975, to the Federal Court of Appeal and the Court Martial Appeal Court. He was appointed to the Supreme Court of Canada in 1984 and served until November 1988. In 1989, he was made a Companion of the Order of Canada.\n\n\n\nSource: \"The Honourable Mr. Justice Gerald Eric Le Dain,\" scc-csc.gc.ca. Supreme Court of Canada. n.d. Web. Oct. 2009.\n\nName: GERRETSEN, John\n\nMale\n\nBorn 1942 in Hilversum, The Netherlands\n\nCalled to the Bar: 1969\n\nQ.C.\n\nName of Heritage or Community: Dutch\n\nBiographical Information:\n\nJohn Gerretsen is a long-time politician as well as a lawyer. He was elected by the people of Kingston, Ontario as councillor from 1972 to 1980, then as mayor from 1980 to 1988. He was a member and then the chair of the Ontario Housing Corporation from 1989 to 1995. He is the first lawyer of Dutch heritage to be elected as a Member of the Provincial Parliament (Liberal, for Kingston and the Islands, first elected 1995). Also a cabinet member, he served as the Minister of Municipal Affairs and Housing from 2003 to 2007, and as the Minister of the Environment from 2007.\n\n\n\nName: LAMPKIN, Vibert A.R.\n\nMale\n\nBorn 1933 in Kitty, Georgetown, Guyana\n\nCalled to the Bar: 1969\n\nName of Heritage or Community: Black\n\nBiographical Information:\n\nVibert Lampkin earned an LLB at the University of London. He qualified as a solicitor in England and Guyana where he practised from 1959 until 1967 when he and his wife Lorna migrated to Canada. In 1977, eight years after he was called to the bar in Ontario, he earned the LLM degree from Osgoode Hall Law School. He was appointed to the Ontario Court of Justice in 1982 and served until 2008. He was awarded honorary doctorates of laws by the Law Society of Upper Canada (2008) and by York University (2009). According to the citation for the latter, he was “a trailblazer and a mentor to the many lawyers who appeared before him...known for his knowledge of the law, civility and contribution to the body of criminal law, with 286 reported cases. Everyone who has appeared or worked in his court was aware of his respect and compassion for people.”\n\n\n\nSee \"The Honourable Justice Vibert Lampkin and Osgoode Professor Emeritus Paul Weiler to Receive Honorary Doctorate Degrees at Spring Convocation.\" Events and Bulletins. osgoode.yorkuniversity.ca. Osgoode Hall Law School York University, 24 June 2009. Web. Nov. 2009; “Law Society Presents Two Doctorates at Toronto Call to the Bar Ceremonies,” lsuc.on.ca The Law Society of Upper Canada. 19 June 2008. Web. Dec. 2009. Interviewee, Osgoode Society Oral History Programme.\n\nName: FELKAI, Frank\n\nMale\n\nBorn 1942 in Budapest\n\nCalled to the Bar: 1970\n\nQ.C.\n\nName of Heritage or Community: Hungarian\n\nBiographical Information:\n\nFrank Felkai was the first 1956 Hungarian refugee appointed Q.C., in 1984. From 1970 to 1973, he was was executive assistant to the Minister of National Revenue, the Hon. Herb Grey. He was the first Hungarian refugee to seek election to the Parliament of Canada, in 1979-1980, in Don Valley West, Toronto. He was President of the Lawyers' Club in 1987, and Director of the Advocates' Society from 1995-8. Mr. Felkai has served as the Vice-President of the Hungarian Helicon Foundation, and as a director, in the 1970s, of Hungarian House in Toronto.\n\n\n\nNominated by Frank Palmay of the Hungarian Canadian Bar Association.\n\n\n\nName: GOTTLIEB, Gary Lloyd\n\nMale\n\nBorn 1943 in Toronto, Ontario\n\nCalled to the Bar: 1970\n\nQ.C.\n\nName of Heritage or Community: Orthodox Jewish\n\nBiographical Information:\n\nElected a bencher in 1995, Gary Gottlieb was the first Orthodox Jewish member of the governing board of the Law Society of Upper Canada. He writes, “My motivation to become a bencher was to be a voice for the ordinary sole practitioner at Osgoode Hall, but during the course of my time as a bencher I am happy that artificial barriers that may have deterred Orthodox Jewish lawyers from running for bencher have been eliminated and the Law Society has become a leader in the promotion of religious tolerance and inclusiveness.” Because of the leadership of Mr. Gottlieb and his fellow bencher Bob Aaron, Law Society meetings are no longer held on days that would conflict with any bencher’s religious observance. Further, the Law Society has adopted a statement of principles on Respect for Religious and Spiritual Beliefs and approved his motion that anti-Semitism and all forms of religious discrimination be discouraged. Mr. Gottlieb is a sole practitioner in Toronto.\n\n\n\nSee \"Respect for Religious and Spiritual Beliefs: A Statement of Principles of the Law Society of Upper Canada,\" lsuc.on.ca. Law Society of Upper Canada. 10 March 2005.\n\n\n\n\n\nName: IACOBUCCI, Frank\n\nMale\n\nBorn 1937 in Vancouver, British Columbia\n\nCalled to the Bar: 1970\n\nCC, Q.C., LSM\n\nName of Heritage or Community: Italian\n\nBiographical Information:\n\nFrank Iacobucci, the son of Italian immigrants, has been an exceptional lawyer, educator, public servant, and judge. In 1967 he became a professor of law and administrator at the University of Toronto, serving as dean of the Faculty of Law from 1979 to 1983, then vice-president and provost of the university. In 1985 he was named Deputy Minister of Justice and Deputy Attorney General of Canada. He was appointed Chief Justice of the Federal Court of Canada in 1988, and served there until his 1991 appointment to the Supreme Court of Canada. He retired from the Court in 2004, served the University of Toronto as Interim President, and then became counsel to the Torys law firm. He has received many awards in Canada and abroad, recognizing his distinguished legal career and contributions to the Italian Canadian community; those include the Law Society Medal (1987), Commendatore (Italy) (1993), and the Order of Canada (2008).\n\n\n\nSee also \"Biographical Sketch of the Honourable Mr. Justice Frank Iacobucci,\" Italian Canadiana Vol 15 (2001), 7-9. utoronto.ca/iacobucci. The Frank Iacobucci Centre for Italian Canadian Studies, Department of Italian Studies, University of Toronto. Web. Feb. 2010; \"The Honourable Frank Iacobucci, C.C., Q.C., LL.D.\" Torys LLP. Web. Dec. 2009; Kirk Makin, \"An Emotional Champion for the Accused,\" Toronto Globe and Mail, 7 April 2000, A07. Interviewee, Osgoode Society Oral History Programme.\n\nName: POON, Sidney S.\n\nMale\n\nBorn 1936 in Hong Kong\n\nCalled to the Bar: 1970\n\nName of Heritage or Community: Chinese\n\nBiographical Information:\n\nSidney Poon writes that, “My legal training and knowledge has helped me greatly to serve the Chinese community in the 1980s and 1990s, to address and help promote social harmony among different ethnic groups by serving on the Canadian Ethnocultural Council, to promote employment equity for minority groups.” From 1978 to 1987, he served as Ontario president of the Federation of Chinese Canada Professionals and the national president of the Chinese Canadian National Council. He also was president of the Indo-Chinese Refugees’ Relief Trust Fund and a member of the City of Toronto’s Committee on Immigrant Settlement and Services. In 1985 he was awarded a Certification of Appreciation by the Chinese Community Centre of Ontario for outstanding and dedicated service to the community. Also in 1985, he became one of the first Chinese Canadian lawyers to be appointed Q.C. in Ontario.\n\n\n\n1971 – 1980\n\nName: BINAVINCE, Emilio\n\nMale\n\nBorn 1935\n\nCalled to the Bar: 1971\n\nName of Heritage or Community: Filipino\n\nBiographical Information:\n\nOne of the first lawyers of Filipino heritage, Emilio Binavince studied law in the Philippines and earned graduate degrees in the United States and Germany. He was the founding chairman of the joint MBA/LLB. Program, the founder and faculty editor for several years of the Ottawa Law Review, and Professor of Law at the University of Ottawa. He is a member of the bars of Saskatchewan and the Philippines, as well as of Ontario, and has appeared as counsel in all levels of Canadian courts. Mr. Binavince's areas of practice are constitutional litigation, international trade and tax law; his clients include ethnocultural and charitable organizations and foreign investors in Canada, as well as Canadian investors overseas.\n\n\n\nNominated by the Federation of Asian Canadian Lawyers.\n\nName: NORTON, Keith\n\nMale\n\nBorn 1941 in Claremont, Ontario\n\nDied 2010\n\nCalled to the Bar: 1971\n\nQ.C. 1978\n\nName of Heritage or Community: Lesbian, Gay, Bisexual, Transgendered or Two-Spirited\n\nBiographical Information:\n\nKeith Norton was a powerful advocate for diverse communities and one of the first Canadian politicians to identify himself publicly as a gay man. After a few years in private practice in Kingston, he entered local and then provincial politics in 1975. He was a key cabinet member in Progressive Conservative governments from 1977 to 1985, in education, social services, and in health, the latter during the first years of the AIDS epidemic in the early 1980s. Norton did not make public his sexual orientation until the 1990 election. He was defeated in his Toronto riding by another prominent and gay (though not openly so) politician and lawyer, Ian Scott of the Liberal Party (see biography). After leaving politics, Norton served as head of the Canadian Human Rights Tribunal (1992 to 1996) and the Ontario Human Rights Commission (1997-2005). He is remembered for his campaign against mandatory retirement on the basis of age, and as an activist for gays and persons with disabilities.\n\n\n\nSources: Robert Benzie, \"Keith Norton, 69: Gay Cabinet Minister Fought for Equal Rights,\" Toronto Star 2 Feb. 2010; Randall Pierce, \"I Remember Keith Norton,\" Toronto Globe and Mail, 16 Feb. 2010.\n\nName: ROSEMAY, Vibert T.\n\nMale\n\nBorn 1935 in Georgetown, Guyana\n\nCalled to the Bar: 1971\n\nName of Heritage or Community: African Canadian\n\nBiographical Information:\n\nJustice Vibert Rosemay was one of the first African Canadian lawyers elevated to the bench of the Ontario Court of Justice, in 1991. In 1973, he was appointed a member of the Canadian Consultative Council on Multiculturalism. In 1978, he co-founded the Delos Davis Law Guild in honour of one of the first Black lawyers in Ontario. He was appointed Queen's Counsel in 1983. Name: ABELLA, Rosalie Silberman\n\nFemale\n\nBorn 1946 in Stuttgart, Germany\n\nCalled to the Bar: 1972\n\nName of Heritage or Community: Jewish\n\nBiographical Information:\n\nAn honoured and influential jurist and scholar. Born in a Displaced Person's Camp in Germany, she emigrated to Canada with her parents in 1950. Abella was a litigator in private practice until, at the age of 29, she became a judge on the Ontario Family Court in 1976, making her Canada's first Jewish and first pregnant woman to be appointed to the Bench in Canada. She chaired the Ontario Labour Relations Board, the Ontario Law Reform Commission, and the Royal Commission on Equality in Employment, where she created the term and concept of employment equity. In 2004, she became the first Jewish woman appointed to the Supreme Court of Canada. She is a fellow of the Royal Society of Canada and of the American Academy of Arts and Sciences and has 27 honorary degrees. She and her husband, historian Irving Abella, have two sons, Jacob and Zachary, both lawyers.\n\nName: LOFCHIK, Thomas R.\n\nMale\n\nBorn 1943 in Hamilton, Ontario\n\nCalled to the Bar: 1972\n\nQ.C.\n\nName of Heritage or Community: Hungarian\n\nBiographical Information:\n\nThomas Lofchik is one of the first lawyers of Hungarian descent. He practised in Hamilton, Ontario. In 1984, he was named Queen's Counsel, and in 1992, he was certified by the Law Society of Upper Canada as a specialist in civil litigation. He was appointed as a judge of the Superior Court of Justice in 1994.\n\n\n\nNominated by Frank Felkai of the Hungarian Helicon Society.\n\n\n\n\n\nName: MARROCCO, Frank N.\n\nMale\n\nBorn 1945 in Toronto, Ontario\n\nCalled to the Bar: 1972\n\nQ.C.\n\nName of Heritage or Community: Italian\n\nBiographical Information:\n\nBefore his appointment to the bench, Frank Marrocco was a prominent litigator and leader of the bar. His high-profile cases include his defence of Lawrencia Bembenek from 1990 to 1992 in her attempt to avoid extradition to the United States. He was the lead prosecutor in the Bre-X Securities prosecution and the lead counsel for the province of Ontario in the Walkerton Inquiry, from 2000-2002. Mr. Marrocco was first elected as a bencher of the Law Society of Upper Canada in 1995. In 2003, he was elected its Treasurer, thereby becoming the first Italian- Canadian to hold the Society’s highest office. In 2005, he was appointed to the Superior Court of Justice. He received an honorary Doctor of Laws degree from the Law Society in 2008 in recognition of his distinguished career and service.\n\n\n\nSee “Law Society Presents Two Doctorates at Toronto Call to the Bar Ceremonies,” lsuc.on.ca The Law Society of Upper Canada. 19 June 2008. Web. Dec. 2009. Interviewee, Osgoode Society Oral History Programme.\n\n\n\nName: TAKACH, Gabor\n\nMale\n\nBorn 1944 in Budapest, Hungary\n\nCalled to the Bar: 1973\n\nName of Heritage or Community: Hungarian\n\nBiographical Information:\n\nOne of the first lawyers born in Hungary to be called to the bar in Ontario. Nominated by Frank Palmay of the Hungarian Canadian Bar Association.\n\n\n\nName: COOMARASWAMY, Ari\n\nMale\n\nBorn c. 1932 in Sri Lanka (Ceylon)\n\nDied 1988\n\nCalled to the Bar: 1974\n\nQ.C. 1981\n\nName of Heritage or Community: Tamil\n\nBiographical Information:\n\nAri Coomaraswamy grew up in Ceylon and Britain and studied law at Cambridge University. He was called to the bar in London in 1955 and returned to Ceylon to practise as a criminal lawyer. With his family, he emigrated to Canada in 1972; his father, Sir Vellupillai Coomaraswamy, had served as Ceylonese high commissioner to Canada in the 1950s. Soon after he was called to the Ontario bar in 1974, Mr. Coomaraswamy joined the Department of Justice as a criminal litigation specialist. He was well-regarded for his leadership in the Toronto office and for his dedicated and expert prosecution of white-collar crime and extradition cases. His most famous case was that of Cathy Evelyn Smith who was extradited in 1986 to the United States for a murder charge relating to the death of John Belushi, a comedian. Mr. Coomaraswamy died of a heart attack in his office, aged only 56.\n\n\n\nNominated by Anusha Aruliah. Source: \"Obituary: Ari Coomaraswamy, Lawyer, made name in white-collar crime and extradition cases,\" Toronto Globe and Mail, 26 July 1988, A18. CPI.Q (Canadian Periodicals). Web. 29 June 2010.\n\n\n\n\n\nName: FERNS, Barboura Ann\n\nFemale\n\nBorn 1947 in Orangeville, Ontario\n\nCalled to the Bar: 1974\n\nName of Heritage or Community: Women\n\nBiographical Information:\n\nBarboura Ferns helped to open the area of criminal law to women lawyers when she became the first female Assistant Crown Attorney in Ontario, joining the staff of approximately thirty-four male lawyers in the Toronto office. An advocate for women’s rights as well as a path-breaker, in the late 1970s she sat on the first Premier's Committee on Domestic Violence, which marked the beginning of modern-day policies on this issue. She was also instrumental in implementing in Ontario the Young Offender's Act of 1982. Ms. Ferns retired in 2009.\n\n\n\nNominated by Cidalia C. Faria. See Barboura Ferns, \"Barboura Ferns, The First Female Assistant Crown Attorney,\" Yesterday and Today: A Celebration of Fifty Years of the Ontario Crown Attorneys' Association (1996), 33-34. Interviewee, Osgoode Society Oral History Programme.\n\nName: JURIANSZ, Russell\n\nMale\n\nBorn 1946 in Pune, India\n\nCalled to the Bar: 1974\n\nName of Heritage or Community: South Asian\n\nBiographical Information:\n\nRussell Juriansz immigrated to Canada on April 5, 1955, when he was eight years old. He\n\ngraduated from Osgoode Hall Law School, where he was president of the students’ council, in 1972. Before his appointment to the bench, his work in the public and private sectors focused on human rights law. He was General Counsel to the Canadian Human Rights Commission and a partner at Blake, Cassels & Graydon. On March 17, 1998, he became the first South Asian to be appointed to the Superior Court of Justice, then called the Ontario Court (General Division). Justice Juriansz was President of the Ontario Superior Court Judges’ Association from April 2002 until March 2004, when he became the first person of colour to be appointed to the Ontario Court of Appeal, the highest court in Ontario.\n\n\n\nSee Sutapa Bridgman, \"Firsts and Notable Accomplishments by South Asian Men and Women of the Bar,\" South Asian Lawyers Association, 2002. rc.lsuc.on.ca/pdf/equity/southAsianBrochure.pdf.\n\nName: MORTEN, Marvin\n\nMale\n\nBorn 1944 in Toronto, Ontario\n\nCalled to the Bar: 1974\n\nName of Heritage or Community: Black\n\nBiographical Information:\n\n“As a Provincial Court Judge in Peel,” Marvin Morten writes, “I tried, and still try, to improve the lot of children in the community, to give them a more solid footing and to help them focus on a positive future. Youth is the future and I saw too many of them, especially minorities, in the courts. Thus, I joined Rotary, becoming a Paul Harris Fellow, and I founded a new Rotary Club, Brampton Flower City Rotary, a club of Canadians of many ethnicities. I lent my name to the Marvin Morten Centre for Children and Families to help deal with violence. I mentored a young man in Big Brothers and the Peel Board of Education Programme. I was a director on the Sheridan College board and spoke at two of their convocations. I felt it a great honour to be named Brampton's Citizen of the Year 2002. In retirement, I continue on two boards geared to youth, Brampton Neighbourhood Resource Centre and One Voice One Team.”\n\nName: TSAMPALIEROS, Gabriel Theodosios\n\nMale\n\nBorn 1947 in Paradisi, Rodos, Greece\n\nDied 2009\n\nCalled to the Bar: 1975\n\nName of Heritage or Community: Greek\n\nBiographical Information:\n\nGabriel Tsampalieros is one of a very few Ontario lawyers to be born in Greece. He became a partner with Osler, Hoskin & Harcourt, but this son of a restauranteur left the practice to manage his wide holdings in the food service business. He was a passionate and generous supporter of the Ontario Science Centre, the Greek Orthodox Metropolis of Toronto, St. Michael’s Hospital of Toronto, and especially, the University of Ottawa, his alma mater. He was awarded an honorary doctorate by that University as “an entrepreneur with extraordinary vision; a champion of education; a philanthropist; a family man of great character; and a proud University of Ottawa graduate committed to ensuring that the time spent at his alma mater by today’s students is a defining moment in their lives.”\n\nNominated by the Hellenic Canadian Lawyers' Association. Source: \"Gabriel T. Tsampalieros, D. University Citation 2007,\" uottawa.ca. University of Ottawa. Web. Dec. 2009\n\nName: WILLEMSE, Conrad Albert\n\nMale\n\nBorn 1947 in Amsterdam, The Netherlands\n\nCalled to the Bar: 1975\n\nName of Heritage or Community: Dutch\n\nBiographical Information:\n\nConrad Willemse writes, “I immigrated with my family as an eleven year old from Amsterdam. My parents immediately connected with the DUCA credit union (whose name derives from the combined words, Dutch and Canadian), which provided social and financial support to Dutch immigrants. Today DUCA is one of Ontario’s largest credit unions, and is still community- oriented. I was a board member for many years and acted as its legal counsel in the development of its new head office site in Toronto. I was also a member and president of the board of the Dutch Canadian Business and Professional Association in the 1990s. I have also been on the board of the Dutch Luncheon Club, which has presented notable speakers of Dutch origin for fifty years. I love being able to connect and work in my Dutch language, and it has been a privilege to serve other members of the strong-rooted Dutch community.”\n\n\n\nNominated by Marten A. Mol, Canadian Netherlands Business and Professional Association. Name: AMERASINGHE, Christopher Ajith\n\nMale\n\nBorn 1940 in Colombo, Sri Lanka\n\nCalled to the Bar: 1976\n\nName of Heritage or Community: South Asian\n\nBiographical Information:\n\nChristopher Amerasinghe studied law at the University of Ceylon from 1960 to 1963, and then practised law in Sri Lanka until he emigrated to Canada in 1974. After working as counsel at the Ontario Securities Commission, he joined the federal Department of Justice in 1977. He has been counsel for the Attorney General of Canada in important criminal, war crimes and class action cases. He helped to establish the Crimes against Humanity and War Crimes Section of the Department of Justice in 1987. He received the title of Queen's Counsel from the Federal Government in 1986. Before his retirement in 2007, Mr. Amerasinghe was a Senior General Counsel at the Department of Justice in Toronto.\n\nSee Sutapa Bridgman,\"Firsts and Notable Accomplishments by South Asian Men and Women of the Bar,\" South Asian Lawyers Association, 2002.\n\n\n\nName: WAPPEL, Tom\n\nMale\n\nBorn 1950 in Toronto, Ontario\n\nCalled to the Bar: 1976\n\nName of Heritage or Community: Hungarian\n\nBiographical Information:\n\nFirst person of Hungarian ancestry to be elected to the House of Commons. First elected in 1988 and re-elected five consecutive times in the riding of Scarborough Southwest. Retired in 2008. First person to speak the Hungarian language on the floor of the House of Commons. Founder and President, until his retirement, of the Canada Hungary Parliamentary Friendship Group. Worked with Hungarian-Canadian communities across Canada to advance issues important to them, both here and abroad. Organized and led the first, and only, delegation of Parliamentarians from the Friendship Group to visit Hungary (2000). Worked to successfully repatriate to Hungary a famous painting which had been relocated to Canada. The official announcement was made by Prime Minister Chretien during the visit of Hungarian Prime Minister Orban. Worked to advance tolerance, human rights and religious freedom for ethnic Hungarians in countries surrounding Hungary where they form a significant minority (e.g. Transylvania, Romania).\n\n\n\nNominated by Frank Felkai of the Hungarian Helicon Society.\n\n\n\nNom: CHARRON, Louise V.\n\nFemme\n\nNée en 1951 à Sturgeon Falls en Ontario\n\nAdmission au Barreau: 1977\n\nNom du patrimoine ou de la collectivité: Francophone\n\nBiographie:\n\nLa juge Charron siège à la Cour suprême du Canada depuis 2004 et est la première juge francophone née en Ontario nommée à la Cour suprême. Elle commence sa carrière juridique en pratique privée à Ottawa en droit civil et criminel. De 1978 à 1988, elle agit comme procureure adjointe de la Couronne pour Ottawa-Carleton et enseigne la common law en français à la faculté de droit de l'Université d'Ottawa. Elle commence sa carrière de juge en 1988. Elle est à la Cour de district d'Ottawa, à la Cour de justice de l'Ontario (division générale) et à la Cour d'appel de l'Ontario (nommée en 1995), ainsi qu'à la Cour de justice du Nunavut (de 1999 à 2004).\n\n\n\nNomination faite par l'Association des juristes d'expression française de l'Ontario. Source :\n\n« L’honorable Louise Charron », Cour suprême du Canada. Web. oct. 2009. Photo : Philippe Landreville, photographe; collection de la Cour suprême du Canada.\n\n\n\n\n\nName: CHARRON, Louise V.\n\nFemale\n\nBorn 1951 in Sturgeon Falls, Ontario\n\nCalled to the Bar: 1977\n\nName of Heritage or Community: Francophone\n\nBiographical Information:\n\nMadam Justice Charron has served on the Supreme Court of Canada since 2004, and is the first Ontario-born Francophone Supreme Court judge. She began her legal career in private practice in Ot"}]}