{"John Russell Reynolds was appointed a judge of the Court of Common Pleas in 1867, and was knighted in 1871.": [{"url": "https://history.rcplondon.ac.uk/inspiring-physicians/sir-john-russell-reynolds", "page_content": "Russell Reynolds was born at Romsey in Hampshire, the son of John Reynolds, a nonconformist minister, and grandson of Henry Revell Reynolds, F.R.C.P, physician to the Middlesex and St. Thomas’s Hospitals and Physician-in-Ordinary to George III. His father gave him the greater part of his general education and University College, London, his medical training. He graduated in 1851 as University scholar and gold medallist in physiology, comparative anatomy and medicine. For so outstanding a student, a great future seemed assured. But his means were slender and he decided to begin practice in Leeds where he had relatives. However, his old teacher Marshall Hall persuaded him to return to London, offering him his house in Grosvenor Street on favourable terms. His enterprise was rewarded by appointments as assistant physician to the Hospital for Sick Children in 1855, the Westminster Hospital in 1857 and University College Hospital in 1859. After a further three years, he became full physician and Holme professor of clinical medicine at University College, and in 1867 he succeeded Jenner in the chair of medicine.\n\nReynolds gave distinguished service to the Royal College of Physicians, being Lumleian Lecturer in 1867, Harveian Orator in 1884, Censor, and finally, from 1893 to 1896, President. He was chosen as Physician to the Royal Household in 1879 and, with his friend, J. E. Erichsen, created a baronet in 1895. He was president of the B.M.A. at the time of his death. But he made his mark in the profession chiefly by his early writings on nervous diseases — he was one of the first to propound the possibilities of electricity as a therapeutic agent — and by his editorship of the System of Medicine, published in five volumes between 1866 and 1879. He was a fluent and popular lecturer and a careful and sympathetic physician. Somewhat shy and grave of mien, he could reveal both a quiet humour and a directness of speech that was no respecter of persons. Painting and music were his recreations, and he was well read in literature. He was married, firstly, to a Miss Ainslie and, secondly to Frances, widow of C. J. C. Crespigny, but left no children. He died at his house in Grosvenor Street.\n\nG H Brown\n\n[Lancet, 1896; B.M.J., 1896; D.N.B., xlviii, 52]"}, {"url": "https://acnr.co.uk/articles/john-russell-reynolds/", "page_content": "Abstract\n\nWhen neurology began to develop as a specialty, Russell Reynolds was one of the first neurologists appointed to the Hospital for the Paralysed and Epileptic, Queen Square.\n\nOf many contributions his work on epilepsy was influential, espousing many new concepts. He followed and developed Hughlings Jackson’s original ideas about positive and negative neurological symptoms. His approach to patients was holistic at a time when more objectively defined notions of illness dominated medicine. He wrote on vertigo, and about criminal lunacy, and his book The Diagnosis of Diseases of the Brain, Spinal Cord, Nerves and their appendages was a major text of the period.\n\nWell versed in poetry, philosophy, art, and music, he was widely admired. He became President of the Royal College of Physicians.\n\nLike the great Sir Jonathan Hutchinson and other Victorians of privileged stock, Sir John Russell Reynolds (1828–1896) (Figure 1) never attended school. His father, a nonconformist minister at Romsey in Hampshire, educated him personally. His grandfather Henry Revell Reynolds (1745-1811), FRS, was an illustrious physician at the Middlesex and St Thomas’s Hospitals and Physician to George III.\n\nFigure 1: Sir J Russell Reynolds. [Published in British Medical Journal, 6 June 1896)\n\nAs a nonconformist he was excluded from Oxford and Cambridge* and read Medicine at University College London, graduating with a gold medal in physiology, comparative anatomy, and medicine in 1851 [1]. An impecunious young doctor, he sought a living, practicing in Leeds where his brother was a Minister of the East Parade Mission Chapel, and his brother-in-law a journalist on the Leeds Mercury.\n\nA year later his former teacher Marshall Hall, FRS. (1790-1857), a physician and brilliant experimental physiologist persuaded him to return to London [2], where at modest cost Hall let him live in his home at 38, Grosvenor Street and join his Consultant practice, mainly in nervous diseases.\n\nOnly four years after graduating Russell Reynolds’ outstanding ability led to his appointment as assistant physician at the Hospital for Sick Children and to the Westminster and University College Hospitals. There he became Holme Professor of Clinical Medicine in 1862, and in 1867 succeeding Sir William Jenner as Professor of Medicine. Just five years after the opening of the National Hospital for the Relief and Cure of Paralysis and Epilepsy, Russell Reynolds showed his interest in neurology and was appointed to its staff. He was elected FRS on 3rd June 1869.\n\nAt this time neurology began to flourish; he worked with many distinguished early neurologists. They included Hughlings Jackson (1835-1911), Jabez Ramskill (1825-1897), Charles Bland Radcliffe (1822–1889) who succeeded Brown–Séquard in 1863, and published Lectures on Epilepsy, Pain, Paralysis, and certain other disorders of the Nervous System, 1864, and articles in Reynolds’s System of Medicine. His brother John Netten Radcliffe (c. 1830-1884), a pioneering epidemiologist, was also Medical Superintendent of the Hospital for the Paralysed and Epileptic.\n\nNo man works in a vacuum. Marshall Hall, (who in spite of his acknowledged distinction [3] surprisingly had failed to get an academic post in London) inspired and encouraged Reynolds. Amongst contemporary and subsequent notable physicians he influenced were: the erudite Charlton Bastian (1837-1915); Charles Edward Beevor, (1854-1908); Howard Tooth (1856-1925); James Taylor, (1859-1946) editor of Jackson’s Selected Writings; and the punctilious Thomas Buzzard (1831-1919), his neighbour in Grosvenor Street, and friend of both Hughlings Jackson and David Ferrier (1843-1928).\n\nSuch was Reynolds’s reputation that he was rewarded with both the Lumleian and the Harveian lectures at the Royal College of Physicians of London, becoming President from 1893–1895. Like his grandfather, he was physician to the royal household in 1879 and was made a baronet in 1895. He was president of the BMA until his death.\n\nA popular and fluent lecturer, he was shy and serious but had a quiet humour and a ‘directness of speech that was no respecter of persons.’ Described as courteous, shrewd, and kind, his approach was holistic – long before it became fashionable:\n\nNot to merely make a diagnosis, much less to write a prescription, but to advise the individual patient what he or she should best do to regain their health… and what changes in the environment, mental, emotional, or physical were most likely to achieve this end. [2]\n\nMedical works\n\nRussell Reynolds is often remembered for his descriptions of epilepsy, eclamptic convulsions, and febrile convulsions in children [4,5]. He also used electrotherapy in various nervous diseases [6].\n\nInterestingly, he is widely quoted for commending the “great value of Cannabis indica” in migraine, epileptic conditions, depression, and asthma. In 1890 he prescribed a cannabis tincture for the menstrual cramps suffered by Queen Victoria. He noted in The Lancet:\n\nWhen pure and administered carefully, [cannabis] is one of the most valuable medicines we possess. [7]\n\nOf greater import was his 1861 paper (Figure 2) that espoused the concept of positive and negative neurological symptoms [5,8]. Positive symptoms were abnormal behaviours that included not only clonic jerking and abnormal movements but also hallucinations and paranoid delusions.\n\nSome symptoms are negative, i.e. they consist in the negation of vital properties. Of this kind are paralysis, anaesthesia, and the like…Other symptoms are positive, i.e. they consist in excess or alteration of vital properties. Of this kind are spasms, pain, convulsions and the like… (p.9-12, 28)\n\nUnfortunately, he failed to write further on this theme. Like Jackson, Russell Reynolds shrewdly noted that the lesion did not directly cause the symptoms observed.\n\nThe origins of positive and negative symptoms were inextricably intertwined with Herbert Spencer’s ideas of dissolution and evolution of the nervous system [9]. Hughlings Jackson extended Spencer’s idea to patients’ symptoms, both positive and negative. Jackson believed that negative symptoms related to the dissolution of neural function while positive symptoms resulted from excitation or the release of lower levels from higher inhibitory control:\n\nSpeaking of the physical side, there are degrees of loss of function of the least organized nervous arrangements with conservation of function of the more organized. There is in each reduction to a more automatic condition; in each there is dissolution, using this term as Spencer does, as the opposite of evolution. [10]\n\nFigure 2. Reynolds: Epilepsy, its symptoms, treatment and relation to other chronic convulsive diseases. 1861\n\nRussell Reynolds wrote his first book on Vertigo. In 1856 he examined legal pleas for insanity in his Criminal Lunatics: are they Responsible? He believed that epilepsy could be a distinct or ‘idiopathic’ disease, a controversial view well expressed in The Diagnosis of Diseases of the Brain, Spinal Cord, Nerves and their appendages in 1855 (dedicated to Marshall Hall), This was later contradicted by Kinnier Wilson who stated that all epileptic events were symptoms, whether or not any underlying pathology could be demonstrated [11].\n\nAlways inclined to a broad approach he described the interictal symptoms of 62 patients with idiopathic epilepsy. He found about one-third had mild impairment of recent memory and a similar proportion had moderate to severe psychopathological findings. His interpretation of epileptic activity (well described by Eadie) [12] was in large measure approved by Hughlings Jackson.\n\nHe edited and wrote many chapters in A system of medicine (London: Macmillan, in five volumes from 1866 to 1879), a major text rivalled only by John Cooke’s Treatise in Nervous Diseases, published in two volumes, in 1820 and 1823, the second volume of Bright’s Reports of Medical Cases 1831, and Romberg’s Manual of the Nervous Diseases of Man 1840 [13].\n\nRussell Reynolds practiced at a time when neurology was in its infancy. It relied on clinical description and elementary pathology. In this morass of evolving knowledge, Reynolds formulated a classification of neurological diseases that remains the kernel of modern systems. His work in neurology linked the highly original physiological and clinical works of his mentor, Marshall Hall, to Hughlings Jackson’s intellectual explorations of the brain’s complex functions and hierarchies, and to the more systematic descriptive neurology of William Gowers [12]. His students included Charlton Bastian (1837-1915) and Sir William Gowers (1845-1915), whose writings often reflect his influence.\n\nLegacy\n\nHe was well versed in poetry, philosophy, art, and music. He was married, first, to Margaret Ainslie, and, secondly, to Frances Crespigny, but left no children. He died aged 68 of ‘pulmonary congestion’ at his home in 1896.\n\nThe scholarship and clinical advances made by Reynolds can be seen as important influences on contemporary and also later notable neurologists at the National Hospital. He bridged the eras of Victorian Neurology with that of the dawning 20th century.\n\nHe was noted as:\n\nA man of scholarship and wisdom, in his presidential address in 1894, in a spirit of prophecy he warned the subject-ridden student of to day of the danger of becoming entangled in the net of an ill-considered and misunderstood technical phraseology, and of juggling with words when he ought to be dealing with concrete things. [2]\n\nAnd Eadie characterised him as:\n\nA most eminent, scholarly, and influential physician who was greatly respected and admired by his contemporaries…the sort of man whose ideas would not readily be discarded because it might almost seem disrespectful to do so unless a better alternative could be clearly demonstrated to exist. [12]\n\n* So-called dissenters (Catholics, Jews, and Quakers) were denied admission because their religious beliefs prevented their taking an oath to adhere to the 39 articles of the Anglican Church. This was abolished by the Universities Tests Act in 1871.\n\nWomen had studied at Oxford since the 1870s. But until 1921, they were not entitled to claim the degrees they had earned. Cambridge followed in 1947.\n\nReferences\n\nBrown GH. Munk’s Roll. Lives of the Fellows of the Royal College of Physicians of London (1826-1925). London: The Royal College of Physicians, 1955;IV:116-7. Obituary Sir J. Russell Reynolds, MD, FRCP, FRS. Brit Med J 1896;1: 1422-3 https://doi.org/10.1136/bmj.1.1849.1422 Pearce J.M.S.. The life and work of Marshall Hall. Quarterly Journal of Medicine, 1997;90:801-803. https://doi.org/10.1093/qjmed/90.12.801 Reynolds JR. On the pathology of convulsions, with special reference to those children. Liverpool Med Chir J 1858;2:1-14. Reynolds JR. Epilepsy: its symptoms. In: Treatment and relation to other chronic convulsive diseases. London: John Churchill, 1861:8-10. Reynolds J . In: Lectures on the clinical uses of electricity delivered in University College Hospital. 2nd edn. London: John A Churchill, 1873. Reynolds JR. Therapeutic uses and toxic effects of Cannabis indica. The Lancet 1890;1:639. Pearce JMS. Positive and negative cerebral symptoms: the roles of Russell Reynolds and Hughlings Jackson. Journal of Neurology Neurosurgery and Psychiatry 2004;75:1148 https://doi.org/10.1136/jnnp.2004.038422 Spencer H . Principles of psychology. London: Longman, Brown, Green, 1855. https://doi.org/10.1037/14065-000 Jackson JH. Remarks on dissolution of the nervous system as exemplified by certain post-epileptic conditions. Medical Press and Circular 1881;329. Wilson SAK. Modern Problems in Neurology. London: Edward Arnold; 1928. https://doi.org/10.1136/bmj.2.3541.914 Eadie MJ. The neurological legacy of John Russell Reynolds (1828-1896). J Clin Neurosci. 2007;(4):309-16. Epub 2007 Jan 22. https://doi.org/10.1016/j.jocn.2006.03.033 Romberg MH. (Translated by Sieveking EH.) A Manual of the Nervous Diseases of Man. London: New Sydenham Society; 1853."}, {"url": "https://www.encyclopedia.com/law/legal-and-political-magazines/reynolds-v-united-states-1879", "page_content": "Reynolds v. United States 1879\n\nPetitioner: George Reynolds\n\nRespondent: United States\n\nPetitioner's Claim: The Morrill Act, which made practice of polygamy a crime, violated his First Amendment right to freedom of religion.\n\nChief Lawyers for Petitioner: George W. Biddle and Ben Sheeks\n\nChief Lawyers for Respondent: Charles Devens, U.S. Attorney General, and Samuel F. Phillips, U.S. Solicitor General\n\nJustices for the Court: Joseph P. Bradley, Nathan Clifford, Stephen Johnson Field, John Marshall Harlan I, Ward Hunt, Samuel Freeman Miller, William Strong, Noah Haynes Swayne, Morrison Remick Waite\n\nJustices Dissenting: None\n\nDate of Decision: May 5, 1879\n\nDecision: Polygamy was not protected by freedom of religion.\n\nSignificance: The Mormons, a religious group who settled Utah, permitted its men to practice polygamy. In Reynolds v. U.S., the Supreme Court found that laws banning polygamy were constitutional. They did not violate the Mormons' right to free exercise of their religion. This still remains the most important legal case to address the issue of polygamy.\n\nThe Morrill Anti-Bigamy Act is passed\n\nIn the middle of the nineteenth century, after a long trek westward, the Mormons settled the land that became the state of Utah. The Mormons were followers of a religious prophet named Joseph Smith. Their religion was called the Church of Jesus Christ of Latter-Day Saints. They held a variety of beliefs. The most controversial belief was that a man could have two or more wives, a practice known as polygamy.\n\nMany people in the United States had known about the Mormon practice of polygamy since 1852. Most Americans were traditional Christians who believed in monogamy—having only one spouse. Until the Mormons arrived, however, there were no federal laws against bigamy or polygamy. The government left the Mormons alone for many years, but in 1862, President Abraham Lincoln signed the Morrill Anti-Bigamy Act into law. The Morrill Act outlawed polygamy throughout the United States in general and in Utah in particular. The government did not do much to enforce the law at that time because it was concerned with the Civil War.\n\nCongress strengthens anti-bigamy law\n\nCongress again took up the issue of Mormon polygamy after the Civil War ended. The Morrill Act was strengthened when the Poland Law was passed in 1874. The Poland Law increased the powers of the federal courts in the territory of Utah. Because federal judges were not appointed by local politicians, they were usually non-Mormons who were more aggressive about enforcing the anti-bigamy law.\n\nMormon leader Brigham Young's advisor, George Q. Cannon, was a territorial delegate to Congress. Together, Young and Cannon decided to challenge the federal government in court. They were confident that if the government tried any Mormons for bigamy, the United States Supreme Court would throw out the convictions. Their belief was based on the First Amendment right to free exercise of religion. They arranged to bring a \"test case\" to court. They chose Young's personal secretary, George Reynolds, to act as the defendant. Reynolds was a devout Mormon and practicing polygamist.\n\nYoung and Cannon were successful. The government indicted (charged) Reynolds with bigamy in October of 1874. However, the first trial failed because of jury selection problems. The government indicted Reynolds again in October of 1875.\n\nFederal prosecutors charged that Reynolds was married to both Mary Ann Tuddenham and Amelia Jane Schofield. The prosecutors had little trouble proving that Reynolds lived with both women. However, they did have some trouble serving Schofield with a subpoena. (A subpoena is a legal document ordering a person to appear in court.) The following dialogue is taken from questions the prosecution asked the deputy marshal sent to serve the subpoena on Schofield:\n\nQuestion: State to the court what efforts you have made to serve it. Answer: I went to the residence of Mr. Reynolds, and a lady was there, his first wife, and she told me that this woman was not there; that that was the only home that she had, but that she hadn't been there for two or three weeks. I went again this morning, and she was not there. Question: Do you know anything about her home, where she resides? Answer: I know where I found her before. Question: Where? Answer: At the same place.\n\nJudge White gave instructions to the jury after more evidence was presented that Reynolds had two wives. The instructions completely destroyed Reynolds's defense that the First Amendment protected his practice of polygamy allowed by his Mormon faith.\n\nThe jury found Reynolds guilty on December 10, 1875. On July 6, 1876, the territorial Supreme Court affirmed (maintained) his sentence. Reynolds then appealed to the U.S. Supreme Court. On November 14 and 15, 1878, his lawyers, George W. Biddle and Ben Sheeks, argued before the highest court in the land that Reynolds's conviction must be overturned on the basis of the First Amendment.\n\nThe Supreme Court destroys the Mormons' hopes\n\nOn January 6, 1879, the Supreme Court upheld the trial court's decision. The Court based its decision on historic American cultural values, namely that from the earliest times polygamy was considered an offense against society. Most civilized countries considered marriage a \"sacred obligation,\" and a civil contract usually regulated by law. Therefore, the Court ruled that the First Amendment did not protect polygamy. Reynolds's sentence of two years in prison and a $500 fine remained.\n\nThe Court's decision rocked the Mormons. Initially, they vowed to resist the Court's ruling. Later, however, they seemed to accept their fate. In 1890, Mormon leader Wilford Woodruff issued a document called the Manifesto. The Manifesto ended \"any marriages forbidden by the law of the land.\" After 1890, most Mormons abandoned the practice of polygamy.\n\nThe Reynolds case is still the leading Supreme Court case on the issue of polygamy. In 1984, a U.S. District Court considered the case of Utah policeman Royston Potter, who was fired from his job because of bigamy. District Court Judge Sherman Christensen rejected Potter's First Amendment defense. The U.S. Tenth Circuit Court of Appeals upheld this ruling. In October 1985, the U.S. Supreme Court refused to hear Potter's appeal. By refusing to hear cases like Potter's, the Court has effectively decided to keep Reynolds as the law of the land.\n\nMany legal scholars have criticized the Supreme Court for not altering or overturning its opinion in Reynolds. It has been more than a century since the decision was handed down. During that time, the Court has greatly expanded First Amendment protection of free exercise of religion. In the 1960s and early 1970s, the Court increased the Constitution's protection for the civil rights of women, minorities, and other classes of persons whose equality under the law had not been a part of the old \"common law\" on which Reynolds was based. As of 2000, however, the Supreme Court has not reconsidered the ruling it gave in Reynolds.\n\nFIGHTS OVER POLYGAMY\n\nT he Mormon practice of polygamy had been controversial for almost as long as the religion existed in the United States. In 1857, 2,500 Army troops were sent into Utah to install a governor to replace Mormon leader Brigham Young. Mormons responded angrily. The result was the \"Utah War.\" During this war, Mormons killed 120 people passing through Utah on their way to California.\n\nFor years, Utah was refused statehood because of its approval of polygamy. The controversy spread to the Mormon community itself. In 1873, Ann Eliza Webb Young made history by moving out of the home owned by her husband, Brigham Young, and demanding a divorce. She became a nationwide crusader against polygamy. The battle continued throughout the 1880s and 1890s. Over 1,000 Mormons were fined or imprisoned for polygamy. It wasn't until Mormons themselves outlawed the practice of polygamy that Utah's application for statehood was accepted, on January 4, 1896.\n\nSuggestions for further reading\n\nCannon, George Quayle. A Review of the Decision of the Supreme Court of the United States, in the Case of Geo. Reynolds vs. the United States. Salt Lake City, UT: Deseret News Printing, 1879.\n\nCasey, Kathryn. \"An American Harem.\" Ladies Home Journal (February 1990): pp. 116–121.\n\nEmbry, Jessie L. Mormon Polygamous Families: Life in the Principle. Salt Lake City, UT: University of Utah Press, 1987.\n\nFirmage, Edwin Brown. Zion in the Courts: A Legal History of the Church of Jesus Christ of Latter-Day Saints, 1830–1900. Urbana, IL: University of Illinois Press, 1988.\n\nFoster, Lawrence. Religion and Sexuality: The Shakers, the Mormons, and the Oneida Community. Urbana, IL: University of Illinois Press, 1984.\n\nJohnson, John W., ed. Historic U.S. Court Cases, 1960–1990: An Encyclopedia. New York, NY: Garland Publishing, 1992.\n\nWagoner, Richard S. Mormon Polygamy: A History. Salt Lake City, UT: Signature Books, 1989."}, {"url": "https://alchetron.com/John-Russell-Reynolds", "page_content": "Sir John Russell Reynolds, 1st Baronet (22 May 1828 – 29 May 1896) was a British neurologist and physician.\n\nReynolds was born in Romsey, Hampshire, as son of John Reynolds, an independent minister, and grandson of Dr. Henry Revell Reynolds. He received general education from his father, and was educated in his profession at University College, London, where he obtained three gold medals in the medical school. In 1851 he graduated M.B. in the university of London, and obtained a scholarship and gold medal in medicine. In 1852 he took the degree of M.D., and began practice in Leeds. He soon after moved to London, and took a house, 38 Grosvenor Street, in which Dr. Marshall Hall had lived. Hall announced to his patients in a printed circular that Reynolds had succeeded him in practice. Such procedure was contrary to a recognised understanding among physicians, and Hall incurred the censure of the College of Physicians. Reynolds, who was ignorant of Hall's intention, was in no way responsible for the circular, and was in no way involved in the censure. He was duly elected a fellow of the college in 1859. In the same year he was appointed assistant physician to University College Hospital, to which he continued attached throughout life. He had before been, in 1855, assistant physician to the Hospital for Sick Children, and in 1857 assistant physician to the Westminster Hospital. In 1865 he became professor of the principles and practice of medicine at University College, and in 1878 he was appointed physician-in-ordinary to the queen's household. He gained a considerable practice as a physician, and was often consulted in difficult cases of nervous disease. In 1869 he was elected a fellow of the Royal Society, and in 1883 vice-president of the Royal Medical and Chirurgical Society. He delivered the Lumleian lecture at the College of Physicians in 1867, the Harveian oration in 1884, and was elected president in 1893, on the death of Sir Andrew Clark. He was re-elected in 1894 and 1895, and on 1 January in the latter year was created a baronet. In the winter of 1895–6 he became too ill to offer himself for re-election as president of the College of Physicians. He died at his house in Grosvenor Street, London, after several weeks of illness of a pulmonary congestion, on 29 May 1896. He was married, first, to Miss Ainslie, and, secondly, to Frances, widow of C. J. C. Crespigny, but left no children.\n\nThe Reynolds Baronetcy, of Grosvenor Street, was created in the Baronetage of the United Kingdom on 28 February 1895 for John Russell Reynolds. The title became extinct on his death.\n\nReynolds devoted himself from an early period to the study of nervous diseases, and in 1854 published an Essay on Vertigo; in 1855 Diagnosis of Diseases of the Brain, Spinal Cord, and Nerves, as well as Tables for the Diagnosis of Diseases of the Brain; in 1861 a treatise on epilepsy; in 1871 Lectures on the Clinical Uses of Electricity; in 1872 The Scientific Value of the Legal Tests of Insanity; besides many papers in medical periodicals and the transactions of medical societies, and several addresses to medical associations. His writings on nervous diseases were useful contributions to a department of medicine in which much work remained undone, but in the flood of modern observations they have been submerged. He will chiefly be remembered among physicians as the editor of the System of Medicine, in five volumes, published from 1866 to 1879, a collection of essays on diseases, written by the most competent men who could be induced to write—compositions of varying merit, but generally of high value. He himself wrote the parts on erysipelas, on inflammation of the lymphatics, and on several forms of nervous disease. He published in 1893 a Life of Dr. Walter Hayle Walshe. Reynolds was a tall man, with dark hair, with a dignified delivery and some oratorical power.\n\nReynolds died in London."}, {"url": "https://history.rcplondon.ac.uk/inspiring-physicians/russell-john-reynolds", "page_content": "Russell John Reynolds was the son of Dr John Reynolds, a general practitioner in Streatham, who with Sir William Crookes constructed the X-ray apparatus now in the Science Museum, South Kensington. His mother was Caroline Harriets, daughter of Dr Trott. From Westminster School he went to Guy’s Hospital and after two years in practice with his father set up as a full time radiologist in 1920. In World War I he served with the R.A.M.C, in home hospitals until 1917 when he became electrical specialist to the Karachi Brigade in India, returning home in 1919. In 1921 he was appointed physician-in-charge of the X-ray departments of Charing Cross and the National Hospitals; his son, Seymour, succeeded him at Charing Cross in 1946, and he retired from the National Hospital in 1939.\n\nFor many years he was adviser in radiology to the Ministry of Pensions and Supply and an examiner to Cambridge University, the Conjoint Board, the Faculty of Radiologists and the R.A.M.C. On his retirement in 1946 he acted as honorary consulting radiologist to the Charing Cross, National, Samaritan, Bethlem Royal and Lambeth Hospitals, and to the Caernarvon and Anglesey Infirmary.\n\nFrom 1924 he had experimented with methods of cineradiography, pioneering in photofluorography with a very wide aperture camera lens. His success brought worldwide recognition. He was president of the British Institute of Radiology and of the section of radiology of the Royal Society of Medicine, warden of the Fellowship of the Faculty of Radiologists, Hunterian professor of the Royal College of Surgeons in 1936, and was awarded the Antoine Beclere award in Paris in 1957.\n\nIn addition he was made a member of the Canadian Radiological Society, the American Roentgen Ray Society, the New York Roentgen Society, the Association of Physicians of Vienna and the Society of Radiologists of Italy; the Australian College of Radiology elected him a fellow.\n\nHe was the author of many publications, particularly in his specialised field of cineradiography which culminated in the production of the Russell Reynolds cineradiographic unit. His paper on the early history of radiology in Britain was published in Clinical Radiology (1961, 12, 136-42).\n\nReynolds was quiet, unassuming and kindly; his strong personality was shown only in his teaching, which brought him the enthusiasm of students and the deep respect of his colleagues. In 1908 he married Anna Thekla Henriette, daughter of Adolf Romer, a banker. They had two sons, Seymour and Stewart, both of whom became consultant radiologists.\n\nRichard R Trail\n\n[Brit.med.J., 1964, 2, 1271 (p), 1403; Charing Cr. Hosp. Gaz., 1964, 62, 233-4 (p); Clin.Radiol., 1965, 16, 191-2; Lancet, 1964, 2, 1071; Med. biol. Ill., 1966, 16, 44-7; Times, 1 Nov. 1964.]"}, {"url": "https://www.law.com/thelegalintelligencer/2023/04/21/judge-john-padova-runs-for-philadelphia-court-of-common-pleas/", "page_content": "Candidate: Judge John Padova\n\nCourt: Philadelphia Court of Common Pleas\n\nParty: Democrat\n\nPhiladelphia Bar Association rating: Highly Recommended\n\nBallot position: 16\n\nThe following has been edited lightly for length and style.\n\nThe Legal Intelligencer: Tell us about your background, where you went to law school, what firms you have practiced at, and areas of law you focus on.\n\nJudge John Padova: After graduating from Temple Law School in 1988, I started practicing with a general litigation firm, Padova & Hinman as an associate attorney. The firm evolved to Padova & Lisi when Nicholas Lisi formed a partnership with John R. Padova Sr., where I worked as an associate attorney handling general litigation. In 1992, after Padova Sr. was appointed to serve as a judge in the U.S. District Court for the Eastern District of Pennsylvania, I became partner with Lisi. Subsequently, Padova & Lisi became Padova, Lisi & Della Guardia. Joseph Della Guardia relocated to Florida, and the firm continued as Padova & Lisi up until the passing of Lisi in 2009. A new entity, The Padova Firm, was established with me being the president of the firm. The firm’s focus was general civil litigation, primarily in personal injury, workers’ compensation and, to a lesser degree, discrimination cases and commercial litigation.\n\nI have litigated motor vehicle crashes, construction/premises injury cases and medical malpractice cases. I have litigated worker’s compensation cases, Social Security disability cases and insurance bad faith matters. I have also served as an arbitrator for personal injury matters and uninsured and underinsured matters in both Pennsylvania and New Jersey. On Dec. 18, 2019, I was appointed by Gov. Thomas Wolf and approved by the Senate to fill a vacancy as a judge in the Philadelphia Court of Common Pleas. On Jan. 20, 2020, I was sworn in and assigned to the criminal trial division in Philadelphia County. In January of 2022 my judicial term ended and I resumed the practice of law where I was of counsel at the firm of Messa & Associates. I was appointed again by Wolf as a judge in the Court of Common Pleas and sworn in at the end of July 2022 where I am presently serving.\n\nThe Legal: What is one major thing about your career experience that most qualifies you for this position, and why?\n\nPadova: Since my appointment to the Court of Common Pleas, I have proven himself as a fair jurist on the Court of Common Pleas. In numerous cases, I have demonstrated my commitment to promoting diversionary programs for nonviolent criminals with underlying issues such as drug addiction and mental health, so that they can get the treatment they need and are not just relegated to prison. I’ve supported re-entry programs for individuals to give them the ability to find jobs, housing and education opportunities. As a trial attorney for over 30 years, I know the nuances and difficulties in litigating cases along with the risks and expenses.\n\nI am the oldest of six children born to U.S. District Judge John R. Padova, Sr. of the Eastern District of Pennsylvania and Ann M. Padova, a retired nurse. I am married to Lua Thi Kim who immigrated to the United States from Vietnam in 1987 and is a licensed esthetician. From an early age, my parents instilled a strong sense of responsibility and growing up in a large family has helped me prepare for a future in the courtroom. I am equally inspired by my father’s legal and judicial career and my mother’s commitment to caring for others while raising a family of six and see my upbringing as a natural precursor to running for judicial office.\n\nThe Legal: What is the main reason Pennsylvania voters should pick you?\n\nPadova: My trial experience as an attorney over a 30-year period and recent Judicial endeavors enable me to understand the problems of everyday people, laborers and attorneys. I recognize that the law in the courthouse belongs to all people alike. It is my philosophy to administer the law fairly and mannerly to all parties. When parties leave the courthouse, it is my goal that they feel they were sufficiently heard in a respectful manner. My philosophy is to offer the willingness to listen, the desire to understand and to give respect and consideration to everyone who comes before me.\n\nThe Legal: What will be your approach to moving matters efficiently through the case management system?\n\nPadova: I have proven myself capable of doing so already on the bench and I will continue to do so.\n\nThe Legal: What would you say to voters regarding your plans to ensure the equal administration of justice for all people?\n\nPadova: Everyone in Philadelphia, regardless of socioeconomic status, race, gender identity, ethnicity or sex, deserves equal access and dignity in the courtroom. Anyone who participates in the justice system should be given respect and treated fairly. If I am given the honor of continuing to serve as a jurist, I will continue to practice this philosophy. When appropriate, I would make defendants and victims active participants in the justice system and ensure that all parties see me as a fair arbiter of the law and the system as fair as a whole. I’ve learned the importance of our system’s demonstrating legitimacy and fairness in order to ensure the public’s trust. In my courtroom, I would do everything in my control to ensure that those who come before me believe in the fairness and impartiality of the process.\n\nThe Legal: Where can voters go for more information about you?\n\nPadova: padovaforjudge.org"}, {"url": "https://www.reynoldsforjudge.com/about", "page_content": "John's father, E. W. Reynolds was a thoroughbred trainer. John grew up spending his summers in Shelby County where he worked mornings on the \"backside\" of Churchill Downs and the rest of the time working on their horse farm.\n\nJohn Reynolds moved to Lexington in 1995 to attend UK College of Law. He continued to assist his father in training horses on the weekends. His first employment in the Lexington legal community was as a law clerk for Don Sturgill's firm, Sturgill, Turner and Truitt. In addition to working as a law clerk, John Reynolds served as a judicial intern for the Fayette District Court while attending UK College of Law.\n\n​\n\nAfter graduating in 1997, Judge Reynolds continued to work in the Thoroughbred industry as in-house counsel for Payson Stud Mgmt. located on Paris Pike in Fayette County. After several years at Payson, John decided to go out on his own and gained extensive courtroom experience as a trial attorney. John Reynolds married his college \"sweetheart\" Holly in January of 1995. In 1999, they welcomed their first son and then a second in 2002. In 1999, he rented a vacant law office and hung his sign to become both a local business owner and a member of the 13th Judicial District's legal community. As a trial attorney, John has tried criminal and civil cases for nearly 25 years.\n\n​\n\nIn December of 2017, John Reynolds was nominated by the seven (7) member Fayette County Judicial Nominating Committee for appointment to the Fayette Circuit Court. He was selected above all others to serve as Fayette Circuit Court Judge for the 3rd Division, replacing the retiring Judge James Ishmael. In March of 2019, John was nominated a second time by the Fayette County Judicial Nominating Committee for the 4th Division, replacing a vacancy created by Judge Pamela Goodwine's election to the Kentucky Court of Appeals.\n\n​\n\nIn addition to serving as a former Circuit Court Judge, Reynolds was appointed by Judge Olive to be the Garrard County Public Administrator where he served Garrard County for years. He was appointed to the City of Nicholasville's Ethics Committee where he served as Chairman, and has long supported local police departments by previously serving on the Wilmore Police Department's Hiring Committee. He has also served as Treasurer for the Jessamine County Bar Association.\n\nAs a Circuit Court Judge, John was respected by law enforcement. He became a tireless fighter to help end drug epidemic. His rulings on criminal bonds and probation made the community safer. He is a staunch defender of the Constitution and law and order."}, {"url": "https://www.beehive.govt.nz/release/richard-russell-appointed-district-court-judge", "page_content": "Attorney-General\n\nRichard John Russell, Solicitor of Invercargill, has been appointed a District Court Judge with a Family Court warrant, Attorney-General Michael Cullen announced today.\n\nMr Russell was admitted in 1980. He has been with Cruickshank Pryde, Solicitors in Invercargill since 1983 and a partner of the firm since 1985. His work from that time has been almost exclusively in family law and family related cases with an emphasis over recent years in the areas of relationship property, trusts, conveyancing, wills and estate planning/estate disputes. He has been a member of the Lawyer for Child panel since 1985, has served on the Council of the Southland District Law Society since 1989 and was its President from 2003-2005. He also served two terms as Chairman of the Southland District Legal Services Committee from 1991-1998.\n\nMr Russell will be sworn in on 30 January 2008 and will sit in Nelson."}, {"url": "https://iowacapitaldispatch.com/2022/06/20/reynolds-poised-to-make-fifth-supreme-court-appointment/", "page_content": "Five people have applied to succeed the lone remaining Democrat-appointed justice of the Iowa Supreme Court — Justice Brent Appel, who is required by law to retire this year because of his age.\n\nThe Iowa Judicial Branch on Monday announced the following applicants:\n\n— Timothy Gartin, an Ames attorney, city council member and Iowa State University lecturer.\n\n— Alan Heavens, a district court judge from Garnavillo in far northeast Iowa and former Clayton County attorney.\n\n— David May, an Iowa Court of Appeals judge from Polk City and former district court judge.\n\n— William Miller, a Des Moines attorney who was a law clerk for former Chief Justice Mark Cady.\n\n— Patrick Tott, a chief district court judge from Sioux City.\n\nThe applicants are set to be interviewed by the State Judicial Nominating Commission on June 27. The 17-member commission will select three finalists to recommend to Gov. Kim Reynolds, who appoints the new justice.\n\nThe commission is soliciting public feedback about the qualifications of the applicants, which can be submitted by email to [email protected]. Those comments are due Thursday, June 23.\n\nIt will be Reynolds’ fifth appointment to the seven-member court. It comes on the heels of a recent Iowa Supreme Court decision that reversed a 2018 ruling that had established abortion as a right guaranteed by the state constitution. Reynolds did not appoint any of the justices who joined the 2018 ruling, and just one of the four new justices disagreed with the majority in the recent decision.\n\n“This rather sudden change in a significant portion of our court’s composition is exactly the sort of situation that challenges so many of the values that (legal precedent) promotes concerning stability in the law, judicial restraint, the public’s faith in the judiciary, and the legitimacy of judicial review,” wrote Chief Justice Susan Christensen in a dissenting opinion.\n\nChristensen was Reynolds’ first appointment to the Supreme Court. Following her were justices Christopher McDonald in 2019 and, in 2020, Dana Oxley and Matthew McDermott.\n\nFormer Gov. Tom Vilsack, a Democrat, appointed four justices between 1999 and 2007, including the retiring Appel. Iowa law requires justices to retire at age 72.\n\nIn 2019, the rules that govern the composition of the nominating commission were also altered by state lawmakers. Previously, the commission had eight lawyers elected by lawyers, eight appointees of the governor and the most-senior Supreme Court justice as the commission’s chairperson. The Republican-controlled Legislature decided to replace that leadership position with another governor’s appointee."}, {"url": "https://courts.delaware.gov/superior/aboutus/history3.aspx", "page_content": "About Us\n\nHistory: Our Judicial Officers\n\nSuperior Court's History\n\nThe Superior Court by the Honorable Henry duPont Ridgely, the Honorable Clarence W. Taylor, the Honorable Richard R. Cooch, F. Alton Tybout, Esq., and Kevin J. O'Connell, Esq.\n\nSuperior Court Special Session Commemorating the 175th Anniversary of the Creation of the Court\n\nSuperior Court Investiture Ceremony Transcripts, 1966 - 2010\n\nSuperior Court Special Session Commemorating the 300th Anniversary of the Courts on the Green\n\nSuperior Court Judges—Past & Present\n\nJudges who have served on the Superior Court bench (arranged by appointment date):\n\nindicates present Judicial Officers. Click on name for detailed profile.\n\nUNDER THE CONSTITUTION OF 1831\n\nHon. James R. Black-Appointed by former Governor David Hazzard and began service on January 18, 1832; died in 1839.\n\nHon. Thomas Clayton-Appointed by former Governor David Hazzard and began service on January 18, 1832; in 1808 he was appointed Delaware Secretary of State by Governor George Truitt; in 1811 Governor Joseph Haslet appointed him Attorney General of the State of Delaware; in 1814 he was elected to the United States House of Representatives; in 1824, when Caesar Rodney resigned his seat in the U.S. Senate, the Delaware General Assembly elected Clayton to fill the unexpired term where he served until 1828 when he was appointed by Governor Charles Polk as Chief Justice of the Court of Common Pleas; in 1837 he was again elected by the General Assembly to fill out an unexpired term of a U.S. Senator-this time that of his cousin, John M. Clayton; he was elected to another full term in the Senate in 1842.\n\nHon. Samuel M. Harrington-Appointed by former Governor David Hazzard and began service January 18, 1832; had previously served as Chief Justice of the Delaware Supreme Court from October 16, 1830 until the constitution changed and he became an Associate Judge; appointed Chief Justice of Delaware again on April 3, 1855; became Chancellor of the Court of Chancery on May 4, 1857; died November 28, 1865.\n\nHon. Peter S. Robinson-Appointed by former Governor David Hazzard and began service on January 18, 1832, serving until his death in 1836; three times appointed Secretary of State for Delaware before assuming his position on the bench.\n\nHon. Caleb S. Layton-Appointed by former Governor Charles Polk and began service on June 3, 1836, serving until 1844; had previously served in the General Assembly from 1826 to 1830; served as Secretary of State for Delaware from 1833 to 1836.\n\nHon. John M. Clayton-Appointed by former Governor Charles Polk and began service on January 16, 1837, serving until September of 1839; previously served in the United States Senate from 1829 until 1836; in 1845 he was again elected to the Senate, remaining there until March of 1849 when President Zachary Taylor named him U.S. Secretary of State; he resigned in 1850 upon President Taylor's death; thereafter he resumed his seat in the Senate where he remained until his death on November 9, 1856. Clayton Hall at the University of Delaware is named in his honor.\n\nHon. Richard H. Bayard-Appointed by former Governor Cornelius P. Comegys as Chief Justice of Delaware and began service on September 19, 1839, serving until March of 1841.\n\nHon. John J. Milligan-Appointed by former Governor Cornelius P. Comegys and began service on September 19, 1839, retired in 1864 after serving on the bench for 25 years; died April 20, 1875.\n\nHon. James Booth Jr.-Appointed by former Governor William B. Cooper as Chief Justice of Delaware and began service on March 12, 1841, serving until April of 1855.\n\nHon. David Hazzard-Appointed by former Governor William B. Cooper and began service on December 10, 1844; only person in state's history to be appointed an Associate Judge without having been a lawyer; was governor from 1830 to 1833; had served as a Justice of the Peace prior to becoming Associate Judge, which position he held for three years.\n\nHon. Edward Wootten-Appointed by former Governor William Thorp and began service on September 6, 1847, serving until his death on March 1, 1887.\n\nHon. John W. Houston-Appointed by former Governor Peter F. Causey and began service on May 4, 1855; after serving as an Associate Judge, served three terms in the United States House of Representatives; died in 1896.\n\nHon. Edward W. Gilpin-Appointed by former Governor Peter F. Causey as Chief Justice of Delaware and began service on May 6, 1857, serving until May of 1876.\n\nHon. Leonard E. Wales-Appointed by former Governor William Cannon and began service on September 2, 1864; became a United States District Court Judge on March 20, 1884; died March 27, 1943.\n\nHon. Joseph P. Comegys-Appointed by former Governor John P. Cochran as Chief Justice of Delaware and began service on May 18, 1876, serving until January of 1893.\n\nHon. William G. Whiteley-Appointed by former Governor Charles C. Stockley and began service on March 31, 1884; previously served as a member of the United States House of Representatives from 1856 to 1860 and was elected Mayor of Wilmington in 1873; died April 23, 1886.\n\nHon. Ignatius C. Grubb-Appointed by former Governor Charles C. Stockley and began service on May 25, 1886, serving until June 15, 1909; also served as Secretary of State for the State of Delaware; died June 20, 1927.\n\nHon. John H. Paynter-Appointed by former Governor Benjamin T. Biggs and began service on March 25, 1887, serving until his death on June 25, 1890; previously appointed Secretary of State for Delaware in 1871.\n\nHon. Charles M. Cullen-Appointed by former Governor Benjamin T. Biggs and began service on August 28, 1890, serving until June 18, 1897; also served as Chairman of the Delaware State Highway Department.\n\nHon. Alfred P. Robinson-Appointed by former Governor Robert J. Reynolds and began service on January 26, 1893, serving but two months as Chief Justice of Delaware.\n\nHon. Charles B. Lore-Appointed by former Governor Robert J. Reynolds and began service on March 21, 1893; appointed under the Constitution of 1897 on June 12, 1897, by Governor Ebe W. Tunnell as Chief Justice of Delaware, serving until June of 1909.\n\nHon. David T. Marve-Appointed by former Governor Robert J. Reynolds and began service on February 1, 1894; retired in 1898; died November 21, 1931.\n\n\n\n\n\nUNDER THE CONSTITUTION OF 1897\n\nHon. William C. Spruance-Appointed by former Governor Ebe W. Tunnell and began service on June 11, 1897, serving until June 11, 1909; previously served as United States Attorney for the District of Delaware from 1876 to 1880.\n\nHon. James Pennewill-Appointed by former Governor Ebe W. Tunnell and began service on June 14, 1897 as an Associate Justice of the Delaware Supreme Court and Resident Judge of Kent County; Appointed chief Justice of Delaware on June 15, 1909, by Governor Simeon S. Pennewill, his brother, where he served until 1933.\n\nHon. William H. Boyce-Appointed by former Governor Ebe W. Tunnell and began service on June 17, 1897 as Resident Judge of Sussex County; was reappointed in 1909, this time as Resident Judge of Kent County; retired in 1921; served as a member of the House of Representatives from 1923 until 1925.\n\nHon. Henry C. Conrad-Appointed by Governor Simeon S. Pennewill and began service on June 15, 1909, serving until 1921; served as City Solicitor and Postmaster of the City of Wilmington.\n\nHon. Victor B. Woolley-Appointed by former Governor Simeon S. Pennewill and began service on June 16, 1909; in 1914 President Woodrow Wilson appointed Woolley to the Third Circuit Court of Appeals, where he succeeded another Delawarean, George Gray; he served on the Third Circuit until 1935; in 1906 he published Woolley on Delaware Practice; died on February 22, 1945.\n\nHon. Daniel O. Hastings-Appointed by former Governor Simeon S. Pennewill and began service on June 16, 1909 as Resident Judge of New Castle County; he resigned on January 17, 1911; was later appointed U.S. Senator by Governor Robert P. Robinson to fill the vacancy caused by the resignation of Coleman du Pont during January of 1927; died in 1966.\n\nHon. Herbert L. Rice-Appointed by former Governor Simeon S. Pennewill and began service on March 1, 1911. He died, in office, in 1932.\n\nHon. Thomas B. Heisel-Appointed by former Governor Charles R. Miller and began service on October 14, 1914. He died, in office, in 1921.\n\nHon. William W. Harrington-Appointed by former Governor William D. Denney and began service on June 29, 1921; was reappointed in 1933 by Governor C. Douglass Buck; resigned in 1938 when he was appointed Chancellor of the Court of Chancery by Governor Richard C. McMullen; died on July 18, 1959.\n\nHon. Richard S. Rodney-Appointed by former Governor William E. Denny and began service on January 12, 1922, serving until 1946 when he was appointed to the United States District Court; died on December 22, 1963.\n\nHon. Charles S. Richards-Appointed by Governor C. Douglass Buck and began service on June 3, 1929 as Resident Judge of Sussex County; became Chief Justice of Delaware on August 14, 1945; became first President Judge of the Superior Court on May 8, 1951; retired from the bench on January 1, 1956; died on October 8, 1971.\n\nHon. David A. Reinhardt-Appointed by former Governor C. Douglass Buck and began service on March 14, 1933, serving until November 22, 1935.\n\nHon. Daniel J. Layton-Appointed by former Governor C. Douglass Buck as Chief Justice of Delaware and began service on July 3, 1933, serving until August of 1945; father of Daniel J. Layton, Jr. and Caleb R. Layton, III.\n\nHon. Frank L. Speakman-Appointed by former Governor C. Douglass Buck and began service on December 18, 1935, serving until 1947; died on March 1, 1971.\n\nHon. Charles L. Terry Jr.-Appointed by former Governor Richard C. McMullen and began service on December 7, 1938; served as President Judge from April 29, 1957, until he was appointed to the Delaware Supreme Court on July 23, 1962, becoming its Chief Justice in May of 1963; resigned as Chief Justice in 1964; elected Governor of the State of Delaware, where he served until 1969; died on February 6, 1970.\n\nHon. James B. Carey-Appointed by former Governor Walter W. Bacon and began service on August 16, 1945, serving until May 16, 1963 when he began service as an Associate Justice of the Delaware Supreme Court. He died on August 10, 1979.\n\nHon. G. Burton Pearson Jr.-Appointed by former Governor Walter W. Bacon and began service on January 18, 1946, serving until December 21, 1949. He died on December 7, 1999.\n\nHon. Caleb R. Layton III-Appointed by former Governor Walter W. Bacon and began service on December 19, 1947 as Resident Judge of New Castle County; served until April 29, 1957 when he was appointed U.S. District Judge for the District of Delaware; died in May of 1988.\n\nHon. Daniel F. Wolcott-Appointed by former Governor Elbert N. Carvel and began service on December 22, 1949, serving until his appointment as Chancellor of the Court of Chancery on December 11, 1950; began service as an Associate Justice of the Delaware Supreme Court on June 5, 1951; appointed Chief Justice on December 13, 1964; died in office on July 10, 1973.\n\nHon. Daniel L. Herrmann-Appointed by former Governor Elbert N. Carvel and began service on January 12, 1951, serving until his resignation on April 15, 1958; prior to serving on the Superior Court, Judge Herrmann served as an Assistant United States Attorney; he was appointed Associate Justice of the Delaware Supreme Court on December 13, 1964 and elevated to Chief Justice on August 9, 1973; he retired from the bench on July 31, 1985; died in 1991.\n\nHon. William A. Storey-Appointed byformer Governor J. Caleb Boggs and began service on May 15, 1957 as Resident Judge of Kent County; served until June 30, 1972; had previously served as Delaware Secretary of State and Mayor of the City of Dover; died June 24, 1982..\n\nHon. Andrew D. Christie-Appointed by former Governor J. Caleb Boggs and began service on May 15, 1957, serving until March 30, 1983, when he began service as an Associate Justice of the Delaware Supreme Court; elevated to Chief Justice on September 30, 1985; retired February 29, 1992; died on May 28, 1993; previously served as Attorney for the Legislative Reference Bureau.\n\nHon. Albert J. Stiftel-Appointed by former Governor J. Caleb Boggs and began service on April 30, 1958, serving until August 2, 1966, when he became President Judge of the Superior Court, where he served until his retirement on September 25, 1990; previously served as Attorney for the Delaware House of Representatives; died on September 9, 2000.\n\nHon. Stewart Lynch-Appointed by former Governor Elbert N. Carvel and began service on March 23, 1961, serving until July 26, 1968.\n\nHon. William Duffy-Appointed by former Governor Elbert N. Carvel and began service on March 23, 1961, was appointed President Judge of the Superior Court on July 23, 1962; served until August 3, 1966 when he began service as Chancellor of the Court of Chancery; began service as an Associate Justice of the Delaware Supreme Court on August 9, 1973; retired on January 27, 1982; died on September 24, 1998.\n\nHon. George R. Wright-Appointed by former Governor Elbert N. Carvel and began service on July 23, 1962, serving until June 30, 1972 when he became Resident Judge of Kent County; served until September of 1984; died January 17, 2007.\n\nHon. John J. McNeilly-Appointed by former Governor Elbert N. Carvel and began service on May 16, 1963; began service as an Associate Justice of the Delaware Supreme Court on October 24, 1974; retired on October 31, 1986; died on January 11, 2001.\n\nHon. Robert C. O'Hara-Appointed by former Governor Charles L. Terry, Jr. and began service on March 10, 1966; retired on April 16, 1987; previously served as Attorney for the Delaware State Senate; died August 11, 2010.\n\nHon. William T. Quillen-Appointed by former Governor Charles L. Terry, Jr. and began service in Superior Court on March 10, 1966; began service as Chancellor of the Court of Chancery on August 9, 1973; became an Associate Justice of the Delaware Supreme Court on October 30, 1978; retired from the Delaware Supreme Court on February 28, 1983; reappointed to Superior Court by Governor Thomas R. Carper and resumed service on November 23, 1994; retired from Superior Court on August 30, 2000, and returned to private practice.\n\nHon. James B. Messick-Appointed by former Governor Charles L. Terry, Jr. and began service on September 1, 1966; was previously Prothonotary of Kent County and Clerk of the Delaware Supreme Court; died in office on August 1, 1972; previously served as Attorney for the Delaware House of Representatives.\n\nHon. Vincent A. Bifferato Sr.-Appointed by former Governor Charles L. Terry, Jr. and began service on July 26, 1968; was reappointed on August 5, 1980, by Governor Pierre S. du Pont; previously served in the Delaware House of Representatives from 1964 to 1966 and as Chairman of the Delaware Alcoholic Beverage Control Commission from 1967 to 1968; was appointed Resident Judge of New Castle County on May 8, 1992; retired as of April 1, 2000; died on July 25, 2014.\n\nHon. Clarence W. Taylor-Appointed by former Governor Russell W. Peterson and began service on July 1, 1972, serving until June 30, 1992; had previously served as Attorney for the New Castle County Levy Court; he died on February 14, 2001.\n\nHon. Joseph T. Walsh-Appointed by former Governor Russell W. Peterson and began service on July 1, 1972, serving until July 1, 1984 when he was appointed Vice Chancellor of the Court of Chancery; began service as an Associate Justice of the Delaware Supreme Court on September 30, 1985.\n\nHon. Claud L. Tease-Appointed by former Governor Russell W. Peterson and began service on July 1, 1972; became Resident Judge of Sussex County in 1974; previously served as Deputy Attorney General; retired on June 1, 1986.\n\nHon. William G. Bush III-Appointed by former Governor Russell W. Peterson and began service on September 13, 1972; had previously served as Attorney for the Delaware House of Representatives and as a Judge of the Court of Common Pleas; was Resident Judge of Kent County, serving until April 30, 1988; died on October 25, 1999.\n\nHon. Bernard Balick-Appointed by former Governor Sherman W. Tribbitt and began service on September 25, 1973; served until October 13, 1994 when appointed Vice Chancellor of the Court of Chancery; had previously served as Chief Deputy Public Defender from 1969 to 1971 and City Solicitor of the City of Wilmington in 1973; retired from Court of Chancery on September 30, 1998.\n\nHon. Joseph J. Longobardi-Appointed by former Governor Sherman W. Tribbitt and began service on November 14, 1974; served until May 14, 1982 when he was appointed Vice Chancellor of the Court of Chancery; appointed District Judge for the United States District Court on June 14, 1984.\n\nHon. Joshua W. Martin-Appointed by former Governor Pierre S. du Pont and began service on July 23, 1982; retired on December 31, 1989.\n\nHon. Vincent J. Poppiti-Appointed by former Governor Pierre S. du Pont and began service on June 17, 1983; had previously served as State Solicitor and as an Associate Judge in the Family Court; became Resident Judge of New Castle County on January 1, 1990. Retired from the Superior Court on February 1, 1992 to become Chief Judge of the Family Court.\n\nHon. Henry duPont Ridgely-Appointed by former Governor Pierre S. du Pont and began service on September 13, 1984; became Resident Judge of Kent County on May 4, 1988; elevated to President Judge of the Superior Court on September 25, 1990; previously served as Attorney to the Delaware State Senate. Began service as a Justice of the Delaware Supreme Court on July 22, 2004.\n\nHon. Richard S. Gebelein-Appointed by former Governor Pierre S. du Pont and began service on October 5, 1984; previously served as State Solicitor, Chief Deputy Public Defender, Disciplinary Counsel to the Board of Professional Responsibility of the Supreme Court and Attorney General of the State of Delaware. Retired from the Superior Court on August 31, 2005 to assume the role of International Judge in the State Court of Bosnia and Herzegovina;National Guard Judge Advocate General Corps; died on December 22, 2021.\n\nHon. William B. Chandler III-Appointed by former Governor Michael N. Castle and began service on October 25, 1985; was appointed Resident Judge for Sussex County in June of 1986; began service as Vice Chancellor of the Court of Chancery on March 29, 1989; appointed Chancellor on June 30, 1997.\n\nHon. William Swain Lee-Appointed by Governor Michael N. Castle and began service on July 10, 1986; had previously served as an Associate Judge of the Family Court; appointed Resident Judge of Sussex County on May 10, 1989; retired on November 13, 1999, and returned to private practice.\n\nHon. Susan C. Del Pesco-Appointed by former Governor Michael N. Castle and began service on May 20, 1988. She was the state's first female Superior Court judge. She was a member of the first graduating class of Delaware Law School (now Widener University School of Law) and its first graduate nominated to Superior Court. She also was the first woman president of the Delaware State Bar Association. Judge Del Pesco helped start Delaware's first drug treatment facility for incarcerated women and implemented CLAD the nation's first electronic case filing system. Judge Del Pesco retired May 30, 2008.\n\nHon. Myron T. Steele-Appointed by former Governor Michael N. Castle and began service on May 31, 1988; appointed Resident Judge of Kent County on November 1, 1990; served until May 12, 1994 when appointed Vice Chancellor of the Court of Chancery; had previously served as Chief Deputy Attorney general for Kent County and as Attorney for the Delaware State Senate; began service as a Justice of the Delaware Supreme Court on July 28, 2000; elevated to Chief Justice on May 26, 2004.\n\nHon. Norman A. Barron-Appointed by former Governor Michael N. Castle and began service on February 21, 1989; had previously served as State Prosecutor, State Solicitor and Chief Deputy Attorney General; in 1980 Judge Barron was nominated by Governor Pierre S. du Pont as Delaware's first Chief Magistrate of the Justice of the Peace Courts; retired from Superior Court on March 1, 2001.\n\nHon. Charles H. Toliver IV-Appointed by former Governor Michael N. Castle and began service on February 9, 1990; had previously served as the Assistant City Solicitor for the City of Wilmington; retired from Superior Court on May 3, 2014; returned to private practice.\n\nHon. Carl Goldstein-Appointed by former Governor Michael N. Castle and began service on November 29, 1990; had previously served as a Judge of the Municipal Court for the City of Wilmington from July 1, 1970 until his appointment as a Judge of the Superior Court. He formally retired at the end of his term, January 28, 2003. However, pursuant to a special part-time judicial appointment, he continued his work with the Superior Court Drug Court until May 17, 2013.\n\nHon. Haile L. Alford-Appointed by former Governor Michael N. Castle and began service on July 17, 1992; she was the first African-American female in the history of Delaware to hold this office. She died in office on August 11, 2003.\n\nHon. N. Maxson Terry Jr.-Appointed by former Governor Thomas R. Carper and began service as Resident Judge of Kent County on July 26, 1994; had previously served as Kent County Levy Court Attorney. He died in office on August 15, 1998.\n\nHon. John E. Babiarz Jr.-Appointed by former Governor Michael N. Castle and began service on October 24, 1985. Judge Babiarz retired on January 24, 2010.\n\nHon. James T. Vaughn Jr.-Appointed by former Governor Thomas R. Carper and began service as Resident Judge of Kent County on October 28, 1998; elevated to President Judge of the Superior Court on October 12, 2004; began service as a Justice of the Delaware Supreme Court on October 30, 2014.\n\nHon. Peggy L. Ableman-Appointed by former Governor Thomas R. Carper and began service on October 30, 2000; had previously served as Judge in Family Court; retired from Superior Court on December 8, 2012.\n\nHon. Joseph R. Slights III-Appointed by former Governor Thomas R. Carper and began service on November 2, 2000; retired from Superior Court on December 8, 2012; returned to private practice as a partner in the Delaware law firm Morris James LLP; began service as a Vice Chancellor of the Court of Chancery on March 28, 2016.\n\nHon. Jerome O. Herlihy-Appointed by former Governor Michael N. Castle and began service on February 21, 1989; had previously served as Chief Deputy Attorney General. Formally retired on May 18, 2013. However, pursuant to a special part-time judicial appointment, he continues his work with the Superior Court Drug Court.\n\nHon. Fred S. Silverman-Appointed to the Superior Court of Delaware by former Governor Thomas R. Carper and began service on October 12, 1993; had previously served as State Solicitor and as Chief Deputy Attorney General; retired from Superior Court on November 28, 2015.\n\nHon. Robert B. Young-Appointed to the Superior Court of Delaware by former Governor Ruth Ann Minner and began service on February 17, 2005; retired from Superior Court in February 2017; died on February 24, 2021.\n\nHon. M. Jane Brady-Appointed to the Superior Court of Delaware by former Governor Ruth Ann Minner and began service on December 7, 2005; had previously served as the first female Attorney General of the State of Delaware; retired from Superior Court in December 2017.\n\nHon. T. Henley Graves-Appointed to the Superior Court of Delaware by former Governor Michael N. Castle and began service on June 1, 1989; appointed Resident Judge of Sussex County by Governor Thomas R. Carper on January 19, 2000; previously served as an Assistant State's Attorney in Baltimore, Maryland and as Deputy Attorney General for the State of Delaware.\n\nHon. John A. Parkins Jr.-Appointed to the Superior Court of Delaware by former Governor Ruth Ann Minner and began service on August 21, 2008; retired from Superior Court on April 1, 2019; died on May 24, 2019.\n\nHon. Richard R. Cooch-Appointed to the Superior Court of Delaware by former Governor Michael N. Castle and began service on August 31, 1992; appointed Resident Judge of New Castle County by Governor Thomas R. Carper on May 11, 2000; had previously served as Deputy Attorney General and as Attorney for the Delaware House of Representatives; retired from Superior Court on December 31, 2019.\n\nHon. E. Scott Bradley-Appointed to the Superior Court of Delaware by former Governor Thomas R. Carper and began service on April 7, 2000; retired from Superior Court on May 1, 2020.\n\nHon. Richard F. Stokes-Appointed to the Superior Court of Delaware by former Governor Thomas R. Carper and began service on March 23, 1999; appointed Resident Judge of Sussex County by Governor John Carney on October 3, 2018; retired from Superior Court on January 31, 2021.\n\nHon. William L. Witham Jr.-Appointed by former Governor Thomas R. Carper and began service on February 18, 1999; appointed Resident Judge of Kent County by Governor Ruth Ann Minner on January 19, 2005; had previously serve as Kent County Levy Court Attorney; retired from Superior Court on May 14, 2021.\n\nHon. Andrea L. Rocanelli-Appointed to the Superior Court of Delaware by former Governor Jack A. Markell and began service on June 5, 2013; had previously served as a Judge of the Court of Common Pleas; retired from Superior Court on June 7, 2021.\n\nHon. Diane Clarke Streett-Appointed to the Superior Court by Governor Jack A. Markell and began service February 15, 2010; had previously served as the New Castle County Register of Wills; retired from Superior Court on March 31, 2022.\n\nHon. William C. Carpenter Jr.-Appointed by former Governor Thomas R. Carper and began service on October 18, 1993; had previously served as United States Attorney for the District of Delaware; retired from Superior Court on December 31, 2022.\n\nHon. Abigail M. LeGrow-Appointed to the Superior Court of Delaware by former Governor Jack A. Markell and began service on February 15, 2016; she had previously served as Master in Chancery on the Delaware Court of Chancery, a position she held until her appointment to the Superior Court; began service as a Justice of the Delaware Supreme Court on May 11, 2023.\n\n\n\nPRESENT SUPERIOR COURT JUDGES\n\nHon. Jan R. Jurden-Appointed by former Governor Ruth Ann Minner and began service on May 29, 2001; elevated to President Judge of the Superior Court on January 13, 2015.\n\nHon. Calvin L. Scott Jr.-Appointed to the Superior Court of Delaware by former Governor Ruth Ann Minner and began service on February 19, 2003; had previously served as a Deputy Attorney General.\n\nHon. Mary Miller Johnston-Appointed to the Superior Court of Delaware by former Governor Ruth Ann Minner and began service on September 25, 2003.\n\nHon. Charles E. Butler-Appointed to the Superior Court of Delaware by former Governor Jack A. Markell and began service on December 7, 2012, succeeding the Hon. Peggy L. Ableman; he had previously served as Chief Deputy Attorney General; he replaced the Honorable Richard R. Cooch as New Castle County Resident Judge on June 6, 2020.\n\nHon. Eric M. Davis-Appointed to the Superior Court of Delaware by former Governor Jack A. Markell and began service on December 21, 2012, succeeding the Hon. Joseph R. Slights III; he had previously served as a Judge on the Court of Common Pleas.\n\nHon. Paul R. Wallace-Appointed to the Superior Court of Delaware by former Governor Jack A. Markell and began service on January 25, 2013; had previously served as Delaware's Chief of Appeals and as the New Castle County Chief Prosecutor.\n\nHon. Vivian L. Medinilla-Appointed to the Superior Court of Delaware by former Governor Jack A. Markell and began service on February 5, 2013; had previously served as Cabinet Secretary for the Delaware Children's Department.\n\nHon. Ferris W. Wharton-Appointed to the Superior Court of Delaware by former Governor Jack A. Markell and began service on June 5, 2014; had previously served with the Delaware Department of Justice from 1980 to 2003; was chief prosecutor for Kent County; chief prosecutor for New Castle County; state prosecutor and chief deputy attorney general; served as an assistant public defender from 2007 until 2014.\n\nHon. Jeffrey J Clark-Appointed to the Superior Court of Delaware by former Governor Jack A. Markell and began service on April 10, 2015; he had previously served as an attorney for the Delaware State Senate from 1997 until 2002; as chief attorney for the Senate from 2002 until 2012; and, two terms as a member of Delaware's Preliminary Review Committee for the Board of Professional Responsibility; he replaced the Honorable William L. Witham Jr. as Kent County Resident Judge on May 17th, 2021.\n\nHon. Noel Eason Primos-Appointed to the Superior Court of Delaware by Governor John C. Carney Jr. and began service on June 1, 2017; he replaces the Honorable Robert B. Young, who retired from the bench earlier this year.\n\nHon. Sheldon K. Rennie-Appointed to the Superior Court of Delaware by Governor John C. Carney Jr. and began service on April 27, 2018; he replaces the Honorable M. Jane Brady, who retired from the bench earlier this year.\n\nHon. Craig A. Karsnitz-Appointed to the Superior Court of Delaware by Governor John C. Carney Jr.and began service on October 22, 2018; he replaces the Honorable T. Henley Graves, who retired from the bench earlier this year.\n\nHon. Meghan A. Adams-Appointed to the Superior Court of Delaware by Governor John C. Carney Jr.and began service on July 11, 2019; she replaces the Honorable John A. Parkins, Jr., who retired from the bench earlier this year.\n\nHon. Francis J. Jones-Appointed to the Superior Court of Delaware by Governor John C. Carney Jr.and began service on June 6, 2020; he replaces the Honorable Charles E. Butler, who was elevated to New Castle County Resident Judge on June 6, 2020.\n\nHon. Mark H. Conner-Appointed to the Superior Court of Delaware by Governor John C. Carney Jr.and began service on July 11, 2020; he replaces the Honorable E. Scott Bradley, who retired from the bench earlier this year.\n\nHon. Robert H. Robinson, Jr.-Appointed to the Superior Court of Delaware by Governor John C. Carney Jr.and began service on February 5, 2021; he replaces the Honorable Richard F. Stokes, who retired from the bench in January 2021.\n\nHon. Reneta L. Green-Streett-Appointed to the Superior Court of Delaware by Governor John C. Carney Jr. and began service on April 9th, 2021; she replaces the Honorable Jeffrey J Clark, who was elevated to Kent County Resident Judge on May 17, 2021.\n\nHon. Danielle J. Brennan-Appointed to the Superior Court of Delaware by Governor John Carney and began service on July 1, 2021she replaces Honorable Andrea L. Rocanelli, who retired from the bench in June 2021.\n\nHon. Patricia A. Winston-Appointed to the Superior Court of Delaware by Governor John C. Carney Jr. and began service on June 1, 2022 she replaces the Honorable Diane Clarke Streett, who retired from the bench in April 2022.\n\nHon. Sean P. Lugg-Appointed to the Superior Court of Delaware by Governor John C. Carney Jr. and began service on April 3, 2023, he replaces the Honorable William C. Carpenter Jr., who retired from the bench in December 2022.\n\nSUPERIOR COURT COMMISSIONERS-PRESENT\n\nHon. Alicia B. Howard-Appointed by Governor Thomas R. Carper and began service September 26, 1994.\n\nHon. Andrea M. Freud-Appointed by Governor Thomas R. Carper and began service October 19, 1994.\n\nHon. Lynne M. Parker-Appointed by Governor Ruth Ann Minner and began service July 24, 2008.\n\nHon. Janine M. Salomone-Appointed by Governor Jack A. Markell and began service January 23, 2019.\n\nHon. Martin B. O'Connor-Appointed by Governor John C. Carney Jr. and began service on November 1, 2021\n\nSUPERIOR COURT COMMISSIONERS-PAST\n\nHon. Katharine L. Mayer-Appointed by Governor Jack A. Markell and began service July 11, 2016; in May 2021 she was appointed as a Judge in the Court of Commom Pleas by Governor John Carney.\n\nHon. Bradley V. Manning-Appointed by Governor Jack A. Markell and began service October 15, 2014; in November 2018 he was appointed as a Judge in the Court of Commom Pleas by Governor John Carney.\n\nHon. Mark S. Vavala-Appointed by Governor Ruth Ann Minner and began service June 30, 2001. Retired from Superior Court in June 2016.\n\nHon. Michael P. Reynolds-Appointed by Governor Thomas R. Carper and began service October 17, 1994. Retired from Superior Court in 2015. He died on March 27, 2019.\n\nHon. David A. White-Appointed by Governor Ruth Ann Minner and began service June 30, 2001; returned to private practice April 16, 2008.\n\n\n\n\n\nView Current Superior Court Profiles"}]}