{"John Russell Reynolds was a prolific author, writing on a wide range of topics.": [{"url": "https://history.rcplondon.ac.uk/inspiring-physicians/sir-john-russell-reynolds", "page_content": "Russell Reynolds was born at Romsey in Hampshire, the son of John Reynolds, a nonconformist minister, and grandson of Henry Revell Reynolds, F.R.C.P, physician to the Middlesex and St. Thomas’s Hospitals and Physician-in-Ordinary to George III. His father gave him the greater part of his general education and University College, London, his medical training. He graduated in 1851 as University scholar and gold medallist in physiology, comparative anatomy and medicine. For so outstanding a student, a great future seemed assured. But his means were slender and he decided to begin practice in Leeds where he had relatives. However, his old teacher Marshall Hall persuaded him to return to London, offering him his house in Grosvenor Street on favourable terms. His enterprise was rewarded by appointments as assistant physician to the Hospital for Sick Children in 1855, the Westminster Hospital in 1857 and University College Hospital in 1859. After a further three years, he became full physician and Holme professor of clinical medicine at University College, and in 1867 he succeeded Jenner in the chair of medicine.\n\nReynolds gave distinguished service to the Royal College of Physicians, being Lumleian Lecturer in 1867, Harveian Orator in 1884, Censor, and finally, from 1893 to 1896, President. He was chosen as Physician to the Royal Household in 1879 and, with his friend, J. E. Erichsen, created a baronet in 1895. He was president of the B.M.A. at the time of his death. But he made his mark in the profession chiefly by his early writings on nervous diseases — he was one of the first to propound the possibilities of electricity as a therapeutic agent — and by his editorship of the System of Medicine, published in five volumes between 1866 and 1879. He was a fluent and popular lecturer and a careful and sympathetic physician. Somewhat shy and grave of mien, he could reveal both a quiet humour and a directness of speech that was no respecter of persons. Painting and music were his recreations, and he was well read in literature. He was married, firstly, to a Miss Ainslie and, secondly to Frances, widow of C. J. C. Crespigny, but left no children. He died at his house in Grosvenor Street.\n\nG H Brown\n\n[Lancet, 1896; B.M.J., 1896; D.N.B., xlviii, 52]"}, {"url": "https://acnr.co.uk/articles/john-russell-reynolds/", "page_content": "Abstract\n\nWhen neurology began to develop as a specialty, Russell Reynolds was one of the first neurologists appointed to the Hospital for the Paralysed and Epileptic, Queen Square.\n\nOf many contributions his work on epilepsy was influential, espousing many new concepts. He followed and developed Hughlings Jackson’s original ideas about positive and negative neurological symptoms. His approach to patients was holistic at a time when more objectively defined notions of illness dominated medicine. He wrote on vertigo, and about criminal lunacy, and his book The Diagnosis of Diseases of the Brain, Spinal Cord, Nerves and their appendages was a major text of the period.\n\nWell versed in poetry, philosophy, art, and music, he was widely admired. He became President of the Royal College of Physicians.\n\nLike the great Sir Jonathan Hutchinson and other Victorians of privileged stock, Sir John Russell Reynolds (1828–1896) (Figure 1) never attended school. His father, a nonconformist minister at Romsey in Hampshire, educated him personally. His grandfather Henry Revell Reynolds (1745-1811), FRS, was an illustrious physician at the Middlesex and St Thomas’s Hospitals and Physician to George III.\n\nFigure 1: Sir J Russell Reynolds. [Published in British Medical Journal, 6 June 1896)\n\nAs a nonconformist he was excluded from Oxford and Cambridge* and read Medicine at University College London, graduating with a gold medal in physiology, comparative anatomy, and medicine in 1851 [1]. An impecunious young doctor, he sought a living, practicing in Leeds where his brother was a Minister of the East Parade Mission Chapel, and his brother-in-law a journalist on the Leeds Mercury.\n\nA year later his former teacher Marshall Hall, FRS. (1790-1857), a physician and brilliant experimental physiologist persuaded him to return to London [2], where at modest cost Hall let him live in his home at 38, Grosvenor Street and join his Consultant practice, mainly in nervous diseases.\n\nOnly four years after graduating Russell Reynolds’ outstanding ability led to his appointment as assistant physician at the Hospital for Sick Children and to the Westminster and University College Hospitals. There he became Holme Professor of Clinical Medicine in 1862, and in 1867 succeeding Sir William Jenner as Professor of Medicine. Just five years after the opening of the National Hospital for the Relief and Cure of Paralysis and Epilepsy, Russell Reynolds showed his interest in neurology and was appointed to its staff. He was elected FRS on 3rd June 1869.\n\nAt this time neurology began to flourish; he worked with many distinguished early neurologists. They included Hughlings Jackson (1835-1911), Jabez Ramskill (1825-1897), Charles Bland Radcliffe (1822–1889) who succeeded Brown–Séquard in 1863, and published Lectures on Epilepsy, Pain, Paralysis, and certain other disorders of the Nervous System, 1864, and articles in Reynolds’s System of Medicine. His brother John Netten Radcliffe (c. 1830-1884), a pioneering epidemiologist, was also Medical Superintendent of the Hospital for the Paralysed and Epileptic.\n\nNo man works in a vacuum. Marshall Hall, (who in spite of his acknowledged distinction [3] surprisingly had failed to get an academic post in London) inspired and encouraged Reynolds. Amongst contemporary and subsequent notable physicians he influenced were: the erudite Charlton Bastian (1837-1915); Charles Edward Beevor, (1854-1908); Howard Tooth (1856-1925); James Taylor, (1859-1946) editor of Jackson’s Selected Writings; and the punctilious Thomas Buzzard (1831-1919), his neighbour in Grosvenor Street, and friend of both Hughlings Jackson and David Ferrier (1843-1928).\n\nSuch was Reynolds’s reputation that he was rewarded with both the Lumleian and the Harveian lectures at the Royal College of Physicians of London, becoming President from 1893–1895. Like his grandfather, he was physician to the royal household in 1879 and was made a baronet in 1895. He was president of the BMA until his death.\n\nA popular and fluent lecturer, he was shy and serious but had a quiet humour and a ‘directness of speech that was no respecter of persons.’ Described as courteous, shrewd, and kind, his approach was holistic – long before it became fashionable:\n\nNot to merely make a diagnosis, much less to write a prescription, but to advise the individual patient what he or she should best do to regain their health… and what changes in the environment, mental, emotional, or physical were most likely to achieve this end. [2]\n\nMedical works\n\nRussell Reynolds is often remembered for his descriptions of epilepsy, eclamptic convulsions, and febrile convulsions in children [4,5]. He also used electrotherapy in various nervous diseases [6].\n\nInterestingly, he is widely quoted for commending the “great value of Cannabis indica” in migraine, epileptic conditions, depression, and asthma. In 1890 he prescribed a cannabis tincture for the menstrual cramps suffered by Queen Victoria. He noted in The Lancet:\n\nWhen pure and administered carefully, [cannabis] is one of the most valuable medicines we possess. [7]\n\nOf greater import was his 1861 paper (Figure 2) that espoused the concept of positive and negative neurological symptoms [5,8]. Positive symptoms were abnormal behaviours that included not only clonic jerking and abnormal movements but also hallucinations and paranoid delusions.\n\nSome symptoms are negative, i.e. they consist in the negation of vital properties. Of this kind are paralysis, anaesthesia, and the like…Other symptoms are positive, i.e. they consist in excess or alteration of vital properties. Of this kind are spasms, pain, convulsions and the like… (p.9-12, 28)\n\nUnfortunately, he failed to write further on this theme. Like Jackson, Russell Reynolds shrewdly noted that the lesion did not directly cause the symptoms observed.\n\nThe origins of positive and negative symptoms were inextricably intertwined with Herbert Spencer’s ideas of dissolution and evolution of the nervous system [9]. Hughlings Jackson extended Spencer’s idea to patients’ symptoms, both positive and negative. Jackson believed that negative symptoms related to the dissolution of neural function while positive symptoms resulted from excitation or the release of lower levels from higher inhibitory control:\n\nSpeaking of the physical side, there are degrees of loss of function of the least organized nervous arrangements with conservation of function of the more organized. There is in each reduction to a more automatic condition; in each there is dissolution, using this term as Spencer does, as the opposite of evolution. [10]\n\nFigure 2. Reynolds: Epilepsy, its symptoms, treatment and relation to other chronic convulsive diseases. 1861\n\nRussell Reynolds wrote his first book on Vertigo. In 1856 he examined legal pleas for insanity in his Criminal Lunatics: are they Responsible? He believed that epilepsy could be a distinct or ‘idiopathic’ disease, a controversial view well expressed in The Diagnosis of Diseases of the Brain, Spinal Cord, Nerves and their appendages in 1855 (dedicated to Marshall Hall), This was later contradicted by Kinnier Wilson who stated that all epileptic events were symptoms, whether or not any underlying pathology could be demonstrated [11].\n\nAlways inclined to a broad approach he described the interictal symptoms of 62 patients with idiopathic epilepsy. He found about one-third had mild impairment of recent memory and a similar proportion had moderate to severe psychopathological findings. His interpretation of epileptic activity (well described by Eadie) [12] was in large measure approved by Hughlings Jackson.\n\nHe edited and wrote many chapters in A system of medicine (London: Macmillan, in five volumes from 1866 to 1879), a major text rivalled only by John Cooke’s Treatise in Nervous Diseases, published in two volumes, in 1820 and 1823, the second volume of Bright’s Reports of Medical Cases 1831, and Romberg’s Manual of the Nervous Diseases of Man 1840 [13].\n\nRussell Reynolds practiced at a time when neurology was in its infancy. It relied on clinical description and elementary pathology. In this morass of evolving knowledge, Reynolds formulated a classification of neurological diseases that remains the kernel of modern systems. His work in neurology linked the highly original physiological and clinical works of his mentor, Marshall Hall, to Hughlings Jackson’s intellectual explorations of the brain’s complex functions and hierarchies, and to the more systematic descriptive neurology of William Gowers [12]. His students included Charlton Bastian (1837-1915) and Sir William Gowers (1845-1915), whose writings often reflect his influence.\n\nLegacy\n\nHe was well versed in poetry, philosophy, art, and music. He was married, first, to Margaret Ainslie, and, secondly, to Frances Crespigny, but left no children. He died aged 68 of ‘pulmonary congestion’ at his home in 1896.\n\nThe scholarship and clinical advances made by Reynolds can be seen as important influences on contemporary and also later notable neurologists at the National Hospital. He bridged the eras of Victorian Neurology with that of the dawning 20th century.\n\nHe was noted as:\n\nA man of scholarship and wisdom, in his presidential address in 1894, in a spirit of prophecy he warned the subject-ridden student of to day of the danger of becoming entangled in the net of an ill-considered and misunderstood technical phraseology, and of juggling with words when he ought to be dealing with concrete things. [2]\n\nAnd Eadie characterised him as:\n\nA most eminent, scholarly, and influential physician who was greatly respected and admired by his contemporaries…the sort of man whose ideas would not readily be discarded because it might almost seem disrespectful to do so unless a better alternative could be clearly demonstrated to exist. [12]\n\n* So-called dissenters (Catholics, Jews, and Quakers) were denied admission because their religious beliefs prevented their taking an oath to adhere to the 39 articles of the Anglican Church. This was abolished by the Universities Tests Act in 1871.\n\nWomen had studied at Oxford since the 1870s. But until 1921, they were not entitled to claim the degrees they had earned. Cambridge followed in 1947.\n\nReferences\n\nBrown GH. Munk’s Roll. Lives of the Fellows of the Royal College of Physicians of London (1826-1925). London: The Royal College of Physicians, 1955;IV:116-7. Obituary Sir J. Russell Reynolds, MD, FRCP, FRS. Brit Med J 1896;1: 1422-3 https://doi.org/10.1136/bmj.1.1849.1422 Pearce J.M.S.. The life and work of Marshall Hall. Quarterly Journal of Medicine, 1997;90:801-803. https://doi.org/10.1093/qjmed/90.12.801 Reynolds JR. On the pathology of convulsions, with special reference to those children. Liverpool Med Chir J 1858;2:1-14. Reynolds JR. Epilepsy: its symptoms. In: Treatment and relation to other chronic convulsive diseases. London: John Churchill, 1861:8-10. Reynolds J . In: Lectures on the clinical uses of electricity delivered in University College Hospital. 2nd edn. London: John A Churchill, 1873. Reynolds JR. Therapeutic uses and toxic effects of Cannabis indica. The Lancet 1890;1:639. Pearce JMS. Positive and negative cerebral symptoms: the roles of Russell Reynolds and Hughlings Jackson. Journal of Neurology Neurosurgery and Psychiatry 2004;75:1148 https://doi.org/10.1136/jnnp.2004.038422 Spencer H . Principles of psychology. London: Longman, Brown, Green, 1855. https://doi.org/10.1037/14065-000 Jackson JH. Remarks on dissolution of the nervous system as exemplified by certain post-epileptic conditions. Medical Press and Circular 1881;329. Wilson SAK. Modern Problems in Neurology. London: Edward Arnold; 1928. https://doi.org/10.1136/bmj.2.3541.914 Eadie MJ. The neurological legacy of John Russell Reynolds (1828-1896). J Clin Neurosci. 2007;(4):309-16. Epub 2007 Jan 22. https://doi.org/10.1016/j.jocn.2006.03.033 Romberg MH. (Translated by Sieveking EH.) A Manual of the Nervous Diseases of Man. London: New Sydenham Society; 1853."}, {"url": "https://factsking.com/historical-people/john-russell-facts/", "page_content": "The British Prime Minister of the late 19th century, John Russell was a leading Victorian politician who influenced much of Britain’s political life through his work. He was well-educated and came from an illustrious family, which put him in good stead for leading the country. However, he is best remembered for his government’s unsuccessful response to the Irish Famine and has been left in history labelled as leader of the government that “ruined” the Whig party.\n\nLet’s have a look at 10 interesting facts about John Russell!\n\nJohn Russell Facts\n\n1. Russell was a true aristocrat\n\nJohn Russell was born in 1792 in the very heart of high-class British society, as the son of the 6th Duke of Bedford. His mother was the daughter of George Byng, 4th Viscount Torrington. This aristocratic family had been one of the main Whig dynasties in England since the 17th century, they were extremely rich and well-known.\n\nIn 1861, Russell was made an earl and would join the House of Lords, but he had already sat in the House of Commons because he had a courtesy title of “Lord John Russell” by birth.\n\n2. He met Napoleon\n\nGiven his financial means, Russell was able to travel widely at a young age and especially across Europe. An interesting fact about John Russell is that during his travels, he met Napoleon and had a 90-minute meeting with him on the island of Elba in 1814, during Napoleon’s exile there.\n\n3. Russell came into politics through privilege\n\nJohn Russell’s debut in politics wasn’t exactly as you would expect from a successful politician. He was underage and still travelling abroad at the time of elections in 1813. However, his father instructed the electors in Tavistock to choose him as an MP, and this is how John Russell was first elected.\n\n4. He dedicated himself to parliamentary reform early on\n\nFrom 1819, Russell became interested in the reform of parliament, and became leader of the reformist wing of the Whig party, an interesting John Russell fact. He continued in this position throughout the 1820s and made parliamentary reform his personal cause as well as the party’s cause.\n\nAs such, he was one of the main leaders of the fight for the Reform Act of 1832 and was nicknamed “Finality Jack” because he called this Act a “final measure.” Even though the working classes perceived him as opposed to any further reform, in reality Russell continued to work to reform the Whig party and move it toward the new Liberal party under his immediate successor, William Gladstone.\n\n5. Russell and Palmerston didn’t see eye to eye\n\nAnother notable Whig party politician at this time was Lord Palmerston, by far the most controversial figure in Russell’s cabinet during the latter’s first tenure as Prime Minister (1846-1852). Palmerston was Foreign Secretary and supported the continental revolutions, which Russell disagreed with. In fact, Palmerston provoked confrontations such as with France, by undermining the plans of the Spanish court to marry the young Spanish queen and her sister into French royalty.\n\nRussell dismissed Palmerston in December 1851 because he had conveyed to the French ambassador Russell’s approval of Louis Napoleon’s coup d’etat.\n\nPalmerston then retaliated by leading the opposition to defend the government’s Militia Bill. This led to Russell’s resignation in 1852. This became known as Palmerston’s “tit for tat with Johnny Russell.”\n\n6. Russell and Palmerston directed the course of British foreign policy\n\nThrough their rivalry, the two men became the reason that the Aberdeen government failed to take a firm foreign policy direction after 1852.\n\nPalmerston became Home Secretary under the government of Lord Aberdeen, and since he was the leader of the largest party of the coalition supporting this government, Russell was appointed Foreign Secretary.\n\nRussell and Palmerston joined forces to influence British involvement in the Crimean War, however. Against the wishes of more cautious members of government, the two decided to back France.\n\n7. He continued to work for Palmerston\n\nRussell’s luck ran out and it was Lord Palmerston who managed to form the next government, while sending Russell to Vienna to negotiate unsuccessfully. Russell temporarily retired from politics at this point.\n\nBy 1859, however, the two reconciled and Russell was appointed Foreign Secretary in a new Palmerston cabinet, often referred to as the first Liberal cabinet. He held the title during a period of many developments in Europe, such as the Unification of Italy which was supported by the British government.\n\n8. Queen Victoria was critical of him\n\nWhen Russell died, Queen Victoria publicly voiced her admiration towards him. However, she also criticized how impulsive and selfish he appeared, as well as “vain, & often reckless & imprudent,” an interesting John Russell fact.\n\n9. Charles Dickens admired John Russell\n\nThe writer Charles Dickens dedicated his novel A Tale of Two Cities to John Russell, “in remembrance of many public services and private kindnesses.” He also mentioned his great respect for Russell in a public speech, praising him for his public work as well as “in his private capacity,” which suggests they were close friends.\n\n10. Russell became a prolific author\n\nAside from his work in politics, John Russell dedicated his time to writing. He had already published Life of Lord Russell – about his famous ancestor, William Russell, 1st Duke of Bedford – as early as 1819. Therefore, Russell got a taste for writing and also published Essays and Sketches of Life and Character.\n\nLater on, he turned his pen to historical drama and wrote Don Carlos: or, Persecution. A Tragedy, in five acts in 1822.\n\nFinally, he worked as an editor for 8 volumes called Memoirs, Journal and Correspondence of Thomas Moore.\n\nConclusion\n\nJohn Russell was the last true Whig to serve as Prime Minister, a true reformer, but one with mixed reputation because of his cabinets’ failings, most notably in relation to the Irish Famine. Nowadays considered “disastrous,” his government’s actions during that crisis are condemned, in spite of him being sympathetic of the Irish and actually trying some relief proposals which were simply blocked.\n\nAnd here you have top 10 interesting facts about John Russell! If you are interested, you should visit the Historical People Facts Page!"}, {"url": "https://history.rcplondon.ac.uk/inspiring-physicians/russell-john-reynolds", "page_content": "Russell John Reynolds was the son of Dr John Reynolds, a general practitioner in Streatham, who with Sir William Crookes constructed the X-ray apparatus now in the Science Museum, South Kensington. His mother was Caroline Harriets, daughter of Dr Trott. From Westminster School he went to Guy’s Hospital and after two years in practice with his father set up as a full time radiologist in 1920. In World War I he served with the R.A.M.C, in home hospitals until 1917 when he became electrical specialist to the Karachi Brigade in India, returning home in 1919. In 1921 he was appointed physician-in-charge of the X-ray departments of Charing Cross and the National Hospitals; his son, Seymour, succeeded him at Charing Cross in 1946, and he retired from the National Hospital in 1939.\n\nFor many years he was adviser in radiology to the Ministry of Pensions and Supply and an examiner to Cambridge University, the Conjoint Board, the Faculty of Radiologists and the R.A.M.C. On his retirement in 1946 he acted as honorary consulting radiologist to the Charing Cross, National, Samaritan, Bethlem Royal and Lambeth Hospitals, and to the Caernarvon and Anglesey Infirmary.\n\nFrom 1924 he had experimented with methods of cineradiography, pioneering in photofluorography with a very wide aperture camera lens. His success brought worldwide recognition. He was president of the British Institute of Radiology and of the section of radiology of the Royal Society of Medicine, warden of the Fellowship of the Faculty of Radiologists, Hunterian professor of the Royal College of Surgeons in 1936, and was awarded the Antoine Beclere award in Paris in 1957.\n\nIn addition he was made a member of the Canadian Radiological Society, the American Roentgen Ray Society, the New York Roentgen Society, the Association of Physicians of Vienna and the Society of Radiologists of Italy; the Australian College of Radiology elected him a fellow.\n\nHe was the author of many publications, particularly in his specialised field of cineradiography which culminated in the production of the Russell Reynolds cineradiographic unit. His paper on the early history of radiology in Britain was published in Clinical Radiology (1961, 12, 136-42).\n\nReynolds was quiet, unassuming and kindly; his strong personality was shown only in his teaching, which brought him the enthusiasm of students and the deep respect of his colleagues. In 1908 he married Anna Thekla Henriette, daughter of Adolf Romer, a banker. They had two sons, Seymour and Stewart, both of whom became consultant radiologists.\n\nRichard R Trail\n\n[Brit.med.J., 1964, 2, 1271 (p), 1403; Charing Cr. Hosp. Gaz., 1964, 62, 233-4 (p); Clin.Radiol., 1965, 16, 191-2; Lancet, 1964, 2, 1071; Med. biol. Ill., 1966, 16, 44-7; Times, 1 Nov. 1964.]"}, {"url": "https://ocula.com/artists/john-reynolds/", "page_content": "Early Years and Education\n\nBorn in Auckland in 1956, Reynolds had his further education at Elam School of Fine Art in Auckland University in the late seventies, focussing on drawing as painting. A well read, articulate and charismatic conversationist, his exhibiting career began when legendary Wellington dealer Peter McLeavey invited him and his friend Julian Dashper to present a joint show in 1981.\n\nReynolds' early paintings featured groups of staccato marks (distinctive clusters of intertwined, broken lines) and an abstracted, energised graphic sensibility, even when using acrylic or oil paint. This was married with an earthy approach, enjoying the rawness of his materials, mixed with an insatiable and extremely refined curiosity.\n\nJohn Reynolds' earlier artworks include Touchstone for a Map, 1985; Untitled, 1986; Untitled, 1987; Icon, 1988; Nine Lives, 2003.\n\nSeminal Artworks and Developments\n\nOver the years the marks in Reynolds' works have become less dense, less frenetic, with less illusory depth—becoming more pictographic and at times more diagrammatic and more cognisant of the picture plane.\n\nHis painting (in its drawing) has also changed to become much more language-based in subject-matter, less overtly sensual, and, through words, alludes to a wide range of fields such as art history, Greek mythology, architecture, literature, and philosophy. Reynolds has also developed considerable skills in printmaking (especially when collaborating with PG gallery192), graphic design, installation, site specific landscape design and sculpture, and is a keen collaborator with other artists like Ralph Hotere, along with various architects, theatre directors, clothing designers (Workshop, World, Karen Walker), book designers and writers.\n\nAn interesting late career development is his outdoor sculpture saw Reynolds, in a Surrealist fashion, present motorway signage on the New Plymouth Coastal Walkway. BIG WAVE TERRITORY, 2011 incorporates fifteen arrows wittily pointing to different local cultural, recreational, and fiscally earning locations, even some indoor sites when presenting art or a writer's home. The project is an intriguing parallel to the VAGABONDAGE 'motorway sign', a homage to McCahon that Reynolds presented in Auckland-based gallery Starkwhite in 2013.\n\nLater John Reynolds artworks include: Cloud, 2006; Looking West, Late Afternoon, Low Water, 2007; The Art of War, 2010; Higgs Bosun Blues, 2013; French Bay Darkly, 2017.\n\nIn 2020 prominent New Zealand filmmaker, Shirley Horrocks made a short TV documentary about the artist titled, Questions for Mr. Reynolds.\n\nJohn Reynolds Exhibitions\n\nJohn Reynolds has been the subject of both solo and group exhibitions.\n\nRecent Solo Exhibitions include: A Car, a Man, a Maraca, McLeavey Gallery, Wellington, 2023; APOCALYPSEoCLOCK, Starkwhite, Auckland, 2022; Smoke and Mirrors, Wallace Arts Centre, Pah Homestead, Auckland, 2022; In the Street I was Lost, PGgallery192, Christchurch, 2020; Thoughts & Prayers, McLeavey Gallery, Wellington, 2018; psychogeographyblues, PG gallery192, 2018; Manifesto, Tauranga Art Gallery, 2015; Epistamadolgies, Auckland Art Gallery, 2015; [NOMADOLOGY loitering with intent], Govett-Brewster Art Gallery, 2010.\n\nRecent Group Exhibitions include: Group Exhibition, DNA, Berlin, 2019; ANZAC Centenary Print Portfolio, Parliament House, Canberra, 2016; Julian Dashper & Friends, curated by Robert Leonard, City Gallery Wellington, 2015; Lines across the ocean, MOCA, Santiago, Chile, 2013; Kermadec, Maritime Museum, Auckland & City Gallery Wellington, 2012.\n\nCollections\n\nJohn Reynolds' artwork is in several collections including, Auckland Art Gallery Toi o Tāmaki; The Chartwell Collection, Auckland; Te Papa Tongarewa - The Museum of New Zealand; and Christchurch Art Gallery Te Puna o Waiwhetu.\n\nJohn Hurrell | Ocula | 2023"}, {"url": "https://gazette.jhu.edu/2010/08/30/john-russell-wood-70-noted-historian-with-eclectic-interests/", "page_content": "August 30, 2010\n\nJohn Russell-Wood, 70, noted historian with eclectic interests\n\nProlific author and historian had taught at university since 1971\n\nAnthony John R. Russell-Wood, the Herbert Baxter Adams Professor of History at The Johns Hopkins University and a widely published expert in the history and culture of pre-Columbian and colonial Latin America, died Aug. 13 at his Lutherville home after a brief illness.\n\nA faculty member at Johns Hopkins since 1971, Russell-Wood, 70, was a prolific author and one of the world’s foremost historians of Brazil and the Portuguese seaborne empire.\n\nHis voracious appetite for knowledge and the impressive breadth of his interests were reflected in his many publications on administrative and urban history, history of art, technology, public health, women, race, slavery and historiography. He wrote or edited 10 books, most recently Slavery and Freedom in Colonial Brazil (2002), and contributed to more than 80 scholarly articles. His eclectic interests led to a teaching portfolio that was just as diverse; he taught graduate seminars on Brazil and colonial Latin America, and undergraduate courses such as The Age of Exploration, The African Diaspora, Shipwreck and Empire, and Gold and Society. His stature within his field of work often led to participation in video and film documentaries shown on National Public Television and the History Channel.\n\nAnthony John Russell-Wood, who was known as John, delighted in teaching and nurturing his students and in guiding graduate-level candidates through their dissertations. Students praised his even-handedness and availability to answer questions or offer support. But he went beyond the classroom, often holding “refugee parties” at his home, inviting students who stayed in town over the Thanksgiving, Christmas and Easter holidays to dine and mingle with his family. His charisma, one family member said, brought both grace and charm to any conversation in which he was a part.\n\nWilliam T. Rowe, the John and Diane Cooke Professor of Chinese History and chair of the History Department, called Russell-Wood the “solid backbone of Hopkins’ History Department for many decades.”\n\n“John was the one colleague you could always count on for help, or turn to for advice,” Rowe said. “He graciously mentored me ever since my own arrival here, as he has so many others thereafter. It is no exaggeration to say that he was loved by us all.”\n\nRussell-Wood served as director of the Krieger School of Arts and Sciences’ Program in Latin American Studies and twice as chair of the History Department. He also contributed significantly to the Center for Africana Studies and served on the Homewood campus’s Academic Council. He won tenure in 1976 and in 2001 was named to the endowed Herbert Baxter Adams Professorship in History.\n\nMichela Gallagher, interim dean of the School of Arts and Sciences, said, “John was held in great affection by his colleagues, students and staff, and he was known for his compassion and his generosity, as well as his wry sense of humor. He will be deeply missed.”\n\nIn describing why he chose to become a historian, Russell-Wood wrote in his curriculum vitae that his interest in the discipline was not a case of “love at first sight.” Rather, he said, it was “derived from the gradual realization that many of the sources I was reading on medieval Portugal or the chronicles of the Portuguese in Asia, from the perspective of a student of literature or because of their philological content, possessed a strong historical component which I found irresistible.”\n\n“I am a firm believer in how the study and writing and teaching of history can be highly enjoyable and fun,” he wrote.\n\nRussell-Wood was born in Wales and raised in northwest England’s Lancashire area, where both his mother and father were educators. He earned his bachelor’s degree and a doctorate in modern history from the University of Oxford. He also held a diploma in Portuguese studies from Coimbra University.\n\nRussell-Wood possessed an unrelenting curiosity, a trait he satisfied through constant exploration of the world and people around him. He spent his youth traveling to the far corners of Europe, often relying on his intrinsic good fortune and the benevolence of others to accommodate him. Pursuing his studies, completing academic research and supporting local charitable trusts for indigent education, he spent more than six years living in Brazil.\n\nIn raising his sons, Christopher and Karsten, Russell-Wood fostered cultural awareness, strong ethics and a firm command of oneself in all situations that life presents. He took them on trips to his native Wales and encouraged them to expand their horizons by visiting other faraway places. It was while on these trips, as well as at home, that Russell-Wood would instill in his sons the importance of hard work and the value of a strong education. His love of Johns Hopkins contributed to the decision of both sons to pursue undergraduate and graduate experiences at the institution.\n\nOutside the office, Russell-Wood treasured the time he spent with his family and his dog, Abby, a stray pit bull that his wife, Hannelore, had adopted. His interests included cycling, sailing, hiking and bird watching. An avid squash player, he had represented both Oxford University and the United Kingdom in international competitions.\n\nRussell-Wood was also a passionate community volunteer. As chair of the Maryland Committee for the Humanities, he was asked in 1981 to serve on the Maryland Heritage Committee to organize and coordinate Baltimore County’s celebration of the state’s 350th anniversary. In 1983, he received gubernatorial and mayoral citations for public service.\n\nRussell-Wood was awarded numerous honors during his career, including the Portuguese National Order of Knighthood, Commander of the Order of Dom Henrique, presented to him by the president of Portugal; the title of Benemerito, accorded to him by the Santa Casa da Misericordia of Bahia for his contribution to scholarship; Commander of the International Order of Merit of the Misericordias; Officer of the Order of Rio Branco; and honorary citizenship in Salvador, Bahia, Brazil.\n\nAnthony John R. Russell-Wood is survived by his wife of 37 years, Hannelore; his sons, Christopher and Karsten, and their wives; and four grandchildren, Karrigan, Elisabeth, Isabelle and Haviland."}, {"url": "https://www.enotes.com/topics/john-hamilton-reynolds", "page_content": "Last Updated on June 7, 2022, by eNotes Editorial. Word Count: 1513\n\nJohn Hamilton Reynolds 1794-1852\n\nEnglish poet, satirist, critic, and playwright.\n\nReynolds is best remembered as a close friend and correspondent of the Romantic poet John Keats, whose letters to Reynolds constitute a significant body of his poetic thought. At the time of their friendship, however, Reynolds was regarded as a poet with as much promise and talent as Keats himself. He published widely in literary periodicals, and his critical writings reveal a discriminating appreciation of poetry, particularly in his admiration for William Wordsworth at a time when the elder poet was not widely respected. While Reynolds became successful as a satirist later in his career, the poetic talent heralded by Lord Byron and Leigh Hunt remained unfulfilled.\n\nBiographical Information\n\nReynolds was born in Shrewsbury to George Reynolds and Charlotte Cox Reynolds. His father was a school teacher; his mother was related to the Hamilton family (from which Reynolds received his middle name), which included the Gothic writer William Beckford. Reynolds attended the Shrewsbury school where his father taught, then enrolled at St. Paul's in London when the family moved in 1806. He graduated from St. Paul's in 1810, completing his formal education. He took a junior clerkship in an insurance office, the Amicable Society for Perpetual Insurance, working there at least through 1816. In the meantime, he pursued his self-education by reading widely in classical and English literature and also began writing poetry. He was encouraged in his literary interests by his friend John F. M. Dovaston, a former student of Reynolds's father. Reynolds's first published poem, “Ode to Friendship, Inscribed to J. F. M. Dovaston of West Felton,” appeared in Gentleman's Magazine in 1812. He continued publishing poems and articles in such periodicals as Repository of Literature, Arts, and Sciences, Gentleman's Magazine, and Ladies' Museum, then released his first major work, the long poem Safie; An Eastern Tale, in 1814. Only twenty years old at the time, Reynolds received favorable notice from a number of critics and poets, including Lord Byron, whose work Reynolds had closely imitated. Later that year, he published The Eden of Imagination, this time imitating Wordsworth, who also encouraged the younger writer. He published these poems under the auspices of his friend John Martin, who also hired Reynolds as a poetry editor for the Inquirer. In 1815 Reynolds moved on to the Champion, where he was the literary and theater editor until 1817. Both journals provided Reynolds with a ready forum for his poetry, literary criticism, and theater reviews. With the publication of The Naiad: A Tale. With Other Poems in 1816, Reynolds took a step forward in his poetry by moving away from purely imitative efforts. Also during this period, Reynolds became associated with a literary circle formed around a family of young women in Devon. Mary, Sarah, and Thomasine Leigh often entertained Reynolds's friends Benjamin Bailey and James Rice, and Reynolds joined the group sometime in 1815. The friends warmly encouraged Reynolds as the true poet of the group, which spent hours together writing, copying verses, and discussing poetry. His friend Leigh Hunt also supported his writing and introduced him to another young poet Hunt greatly admired, the then unknown John Keats. Keats and Reynolds became fast friends, encouraging and challenging each other in their quest for literary recognition. In 1816, Reynolds took the bold step of leaving his clerkship to live solely by his writing. This endeavor was short lived, and by late 1817 Reynolds began practicing law when his friend Rice took him on as a partner in his father's firm. Biographers speculate that Reynolds's decision was motivated by his plans to marry Eliza Powell Drewe and the need to set up a household with a reliable income. Nevertheless, he continued writing and published Peter Bell, a parody of Wordsworth, in 1819; The Fancy in 1820; and The Garden of Florence and Other Poems, the fruit of his friendship with Keats, in 1821. He also wrote for several periodicals, including the Yellow Dwarf, London Magazine, Edinburgh Magazine, and the Edinburgh Review. After a lengthy engagement, he married Eliza Drewe in 1822, which led to a friendship and literary collaboration with her brother-in-law, Thomas Hood. Together the two wrote several comic and satirical pieces, signed and unsigned, the most popular of which was Odes and Addresses to Great People (1825). This was Reynolds's last publication in book form during his lifetime. He began writing non-literary prose for the magazine Athenaeum and produced a handful of theatrical scripts. Money was becoming a problem, as his attention to his primary career, the law, was sporadic at best, and tragedy struck in 1835 when his ten-year-old daughter Lucy died. He was bankrupt in 1838 but continued eking out a small income writing for Bentley's Miscellany, the New Monthly, and other magazines. In 1847, Reynolds gave up the law completely and subsequently moved to the Isle of Wight to work as an assistant clerk in a county court. Most biographical accounts suggest that at this point in his life Reynolds was depressed and drinking heavily, although he was not without friends and admirers to the end. He died in Newport on the Isle of Wight in 1852.\n\nMajor Works\n\nReynolds best known poetic works are derivative of the canonical poets of his age. Chief among these is Peter Bell, a parody of a poem by Wordsworth. As a lyric poet, Reynolds was indebted to Wordsworth, and his comic mockery of the greater author demonstrates that he was not an unthinking or uncritical admirer. His parody exaggerated the least appealing aspects of Wordsworth's poetry, particularly his expressions of self-satisfaction and his romanticizing of the lower classes. Peter Bell was a tremendous success for Reynolds when it was first published and continues to be his most widely read work. His other satirical works, particularly The Fancy and Odes and Addresses, also won the favor of contemporary audiences, but their subjects—obscure figures in London society and sports—are generally too topical to allow modern readers to enjoy them. A number of critics and scholars have advocated that greater attention be given to Reynolds's serious poetry, which has been overshadowed by his association with his close friend Keats and by his imitations of Wordsworth. His strongest collections are The Eden of the Imagination, which owed much to Wordsworth's An Evening Walk, and The Garden of Florence. The latter collection features one of Reynolds's best serious poems, “Devon,” a reflection on his time among the Rice-Bailey-Leigh circle. The Garden of Florence also contains “The Romance of Youth,” a poem written during his intense collaboration with Keats, marking the high point of Reynolds's ambitions to be a serious poet. A prolific periodical contributor, Reynolds did not make a lasting name for himself as a prose writer, although he proved to be an astute and witty literary critic. Two 1816 essays from the Champion stand out: “The Pilgrimage of Living Poets to the Stream of Castaly” and “Boswell's Visit.” Reynolds also wrote a series of fictitious letters on current events for London Magazine from 1820 to 1824. The letters of “Edward Herbert” were extremely popular in their time, even if, like most journalistic writing, they now hold little interest for any but the most serious scholars. Reynolds's personal correspondence remains his most significant contribution to literature, not for its own intrinsic merit but for Reynolds's ability to illuminate the lives of Keats and other writers of the time.\n\nCritical Reception\n\nEarly reviews of Reynolds's works predict the position he would eventually occupy in literary history: a poet of great potential that was never realized. Critics of Safie and The Naiad were quick to point out Reynolds's failures of imagination and poetic craft, but they did so while encouraging the poet to improve upon his faults and publish again. With some exceptions, modern critics have focused primarily on the Keats connection. One of Reynolds's first twentieth-century champions was George L. Marsh, who also edited a collected edition of Reynolds's works. Marsh identified several unsigned periodical contributions as those of Reynolds, and through his research was able to pull together several details of Reynolds's biography. His assessment of Reynolds's career suggests that although Reynolds was inconsistent as a poet, the body of criticism, satire, and poetry he produced have earned him a literary ranking higher than that of merely “Keats's close friend.” In the second half of the twentieth century, the scholar Leonidas M. Jones published multiple studies heralding the importance of Reynolds in the study of early nineteenth-century literature. Jones completed the work of Marsh, releasing a full biography of Reynolds as well as a collection of Reynolds's letters, further detailing the portrait of Reynolds as a central figure in the literary scene of his time. Both Jones and John Barnard have also argued that although Keats was perhaps the greater talent, the influence and encouragement of Reynolds was a factor in Keats's artistic development. Despite the assertions of Marsh and Jones that Reynolds deserves to be more highly esteemed for his own works, comparatively little scholarship exists that does not emphasize either Reynolds's artistic ties to Wordsworth or his friendship with Keats, and his correspondence continues to receive at least as much attention as his best literary writings."}, {"url": "https://www.goodreads.com/author/show/17216281.John_Russell", "page_content": "John Russell Goodreads Author\n\nBorn\n\nWebsite\n\nGenre\n\nMember Since\n\nSeptember 2020\n\n\"Russell's paranormal and life experiences are engaging, charming, and offer a unique perspective on questions of life and death.\"—The BookLife Prize\n\n\n\nABOUT THE AUTHOR\n\n\n\nHi, I'm John Russell. I've been an internationally known professional psychic and medium for 50 years. As a paranormal investigator I've experienced over 1,000 physical supernatural manifestations. I have provided psychic readings for clients in over 40 countries. For over 15 years I've also been a featured guest on many popular radio shows and podcasts, including Coast to Coast AM with George Noory, and I filmed a TV pilot for The History Channel in which I psychically explored the assassination of President Abraham Lincoln.\n\n\n\nMy books have received endorsements from Uri Geller,\n\n\"Russell's paranormal and life experiences are engaging, charming, and offer a unique perspective on questions of life and death.\"—The BookLife Prize\n\n\n\nABOUT THE AUTHOR\n\n\n\nHi, I'm John Russell. I've been an internationally known professional psychic and medium for 50 years. As a paranormal investigator I've experienced over 1,000 physical supernatural manifestations. I have provided psychic readings for clients in over 40 countries. For over 15 years I've also been a featured guest on many popular radio shows and podcasts, including Coast to Coast AM with George Noory, and I filmed a TV pilot for The History Channel in which I psychically explored the assassination of President Abraham Lincoln.\n\n\n\nMy books have received endorsements from Uri Geller, world famous psychic, author, and TV star; George Noory, host of Coast to Coast AM; Phyllis Galde, publisher of FATE Magazine; Mike Ricksecker, author; researcher; filmmaker; and many others.\n\n\n\nNow, as the award-winning, best-selling author of the nonfiction book Riding with Ghosts, Angels, and the Spirits of the Dead, I'll bring you along with me on a truly magical ride as I travel thousands of miles off the beaten path to explore the paranormal from the seat of a motorcycle. Everywhere I roamed ghosts, angels, and the spirits of the dead came to greet me, communicating intriguing messages to me and providing me with an incredible array of otherworldly manifestations.\n\n\n\nCome along with me on a daylong ride filled with mind-blowing supernatural interactions instigated by the intelligences behind crop circles. Hike with me as I experience a lifesaving encounter with a ghostly owl and a Native American Indian Spirit in a haunted forest. And then let's enjoy a day's ride from my home base in Florida to Georgia, ultimately arriving at Savannah's famed Bonaventure Cemetery for a revealing paranormal investigation that left me astounded at the words that a spirit voice spoke to me.\n\n\n\nAnd then, just imagine...making a phone call to a ghost! Encountering—and having interactions with—multiple UFOs. Ride along with me as I experience mystical weather events that are so bizarre that it makes me wonder if storms are controlled by intelligent entities, or if the tempests themselves may be cognizant. Join me as I ride to a historic Civil War battlefield and share in my amazement when I'm treated to one of the most authentic battle reenactments possible...conducted by the phantoms of the soldiers who fought there.\n\n\n\nA Knock in the Attic—my second award-winning book—is, as Uri Geller stated, \"a fascinating true story of incredible psychic experiences.\"\n\n\n\nIn these entertaining and adventure filled stories I'll tell you what it was like to grow up with a powerful and accurate psychic gift that sometimes spooked the adults around me, leaving them bug-eyed and slack-jawed; and I'll relate some of the emotions I experienced while encountering hair-raising visitations from ghosts on a regular basis.\n\n\n\nI'll share with you the times when my own Guardian Angels not only protected me from physical harm but when they also literally saved my life with a belated Christmas Miracle, to the astonishment of others who said I had lived through the impossible.\n\n\n\nTravel with me to Roswell where I have my very own \"'UFO' encounter\" at the Roswell UFO Museum, an encounter that validated the fact that the Roswell UFO crash was a real event and also explained why many witnesses to UFOs are reluctant to come forward.\n\n\n\nPlus: I'll tell you what it was like to meet Uri Geller; give you a behind-the-scenes look at filming the TV pilot for The History Channel; take you along with me to a haunted horse barn; and then...what was that knocking in the attic...?\n\n\n\nYou'll enjoy more than a few spine-tingling moments as you join me to experience these astonishing true stories of the unknown...incredible paranormal events that you will not soon forget."}, {"url": "https://www.theatlantic.com/culture/archive/2020/02/presidents-books-author-in-chief-craig-fehrman/606484/", "page_content": "“Good God,” scratched Harry Truman in pencil on the manuscript of a soon-to-be-ex-ghostwriter of his Memoirs, “what crap.” Theodore Roosevelt, miserably immersed in his Autobiography, wrote de profundis to his daughter: “I am working with heated unintelligence ... I fairly loathe it now.” John Adams found prose composition physically distressing, “almost like a blow on the elbow or the knee.” Dwight Eisenhower, brooding over the proofs of his memoirs with a panel of editors, said, “I suppose I’m going to have to go along with these split infinitives.” (“They’re your split infinitives,” an editor reminded him.) Andrew Jackson’s first ghostwriter was shot in the back in the middle of Charleston; his second died suddenly a few months later. The tale of Ted Sorensen, meanwhile, who wrote most (all?) of John F. Kennedy’s Pulitzer Prize–winning Profiles in Courage, is a minor epic of fealty and self-erasure.\n\nBooks by presidents ... it’s a vexed and miscellaneous genre. The heavy buttocks of history sit upon it. Literature rarely has anything to do with it. So credit to Craig Fehrman for the compendiousness, readability, and general exuberance of his Author in Chief: The Untold Story of Our Presidents and the Books They Wrote. The books themselves he sorts briskly into “campaign books” (those written before the author takes office) and “legacy books” (those written after). Plenty of campaign books, of course, are written by nonpresidents. Rand Paul’s superbly titled but little loved Government Bullies, for example: “a book,” Fehrman tells us, “that lazily plagiarized five consecutive pages from a think tank.” (I like that “lazily”; a little more alertness in the plagiarism and there would have been, in a book like this, no problem.) They tend to be rush jobs, and can have a kind of trashy zest. To Herman Cain it was suggested that his entire presidential campaign was nothing but an advanced form of hype for his book. “If you know Herman Cain,” he rejoined, “you know nothing is further from the truth. And if you don’t believe me, I invite you to get a copy of my new book, This Is Herman Cain!”\n\nThe legacy book, however—lumpy, gassy, the leaden address to posterity—is the exclusive preserve of the big boys: the presidents. Fehrman is lively in his judgments: “deadening and defensive” (Lyndon B. Johnson’s The Vantage Point), “rushed and unruly” (Bill Clinton’s My Life). The staleness of the presidential memoir, he submits, is baked in: “When writing their legacy books, too many presidents try to cover everything and, worse, to justify everything.” That’s the uniqueness of these books, perhaps: Thick with the stodge of government, they also manage a quavering, unstable note of righteousness.\n\nMost presidents have a degree of verbal facility. Some are surprisingly eloquent. The silver tongue of Calvin Coolidge, for example, is hardly a proverb, but listen to this: “Wages won’t satisfy, be they ever so large. Nor houses; nor lands; nor coupons, though they fall thick as the leaves of autumn. Man has a spiritual nature. Touch it, and it must respond as the magnet responds to the pole.” (That’s from a 1914 speech that would provide his campaign book, Have Faith in Massachusetts, with its title.) Theodore Roosevelt was a prolific author. JFK’s desire to be seen as a literary figure, in a literary context, was matched only by his reluctance to produce, by himself, any actual literature. (Profiles in Courage was Sorensen’s work, and Kennedy’s first book, Why England Slept, was—Fehrman explains—extensively rewritten by The New York Times’ Arthur Krock.) But my impression, having flea-hopped around in this area, is that the White House has harbored only three authentically muddy-eyed and pained-by-subjectivity writers: John Quincy Adams, Abraham Lincoln, and Barack Obama.\n\nThe Personal Memoirs of Ulysses S. Grant contain their moments of literary splendor, indeed they do. “Better troops never went upon a battle-field than many of these, officers and men, afterwards proved themselves to be, who fled panic-stricken at the first whistle of bullets and shell at Shiloh.” An amazing sentence: The backward-facing syntax, like time-lapse photography in reverse, micro-mechanically reviews the process by which the raw and terrified Union recruits at the battle of Shiloh became seasoned soldiers. Grant could be succinct and monumental at the same time: “Disencumber yourself of your [supply] trains,” ran an order that he gave to General John A. McClernand at Champion’s Hill, “select an eligible position, and feel the enemy.” I can’t put Grant on my list of writers, though, because he was driven to writing by circumstance, and took it up in a soldierly way. Bankruptcy gave him the spur; Personal Memoirs began as a series of military reminiscences, sold for some quick cash to the magazine The Century. An almost simultaneous diagnosis of terminal throat cancer provided an appalling deadline. Also, having won the Civil War, he had better stories than most presidents.\n\nJohn Quincy Adams, by contrast, wanted very badly to be a poet. The sixth president pined, even in office, for a parallel poetic existence, one in which his yeoman’s verses had helped found a literary tradition for his rude young country. “I want the voice of honest praise / To follow me behind / And to be thought in future days / The friend of human kind.” (Ralph Waldo Emerson loved that poem, “The Wants of Man.”) To be, as he put it, “at once a man of business and a man of rhyme”— wouldn’t that be an American dream? Lincoln, meanwhile, having as a teenager pored over, memorized, and metabolized the monologues from Shakespeare’s plays collected in a primer called Lessons in Elocution, developed an ability to impress his words upon the mind of a reader or listener with an authentic, metal-on-metal Shakespearean clang. Here he is in March 1832, in southern Illinois’s Sangamo Journal, writing publicly for the first time and making the case for himself as a candidate for the state legislature: “I was born and have ever remained in the most humble walks of life. I have no wealthy or popular relations to recommend me ... If the good people in their wisdom shall see fit to keep me in the background, I have been too familiar with disappointments to be very much chagrined.” He sounds like Richard III. Obama’s Dreams From My Father was another kind of dramatic speech: storytelling, acutely self-aware, riding the edge of a taut, cool anger.\n\nFew thrills, it must be said, attend the presidential book pile. Much interest, but few thrills. Nonetheless, as Author in Chief proceeds, covering the epochs at a comfortable chronological clip—Washington to Monroe ... Adams to Grant ... Hayes to Roosevelt—a strange Friday the 13th–style tension begins to build. Your scalp starts to itch. What’s going to happen, after all this thoughtful middle-to-highbrowism, when we arrive at the feast of illiteracy that is Trumptown 2020? What happens when we get to now? Does the book have a built-in whoopee cushion? Will a big red boxing glove on a spring pop out and punch the reader in the nose?\n\nAs it happens, Fehrman stops dead after Obama—toes tingling, as it were, on the rim of the abyss. The man recently hailed by a White House spokesman as “a best-selling author and deeply gifted orator who packs arenas and has a meticulous and carefully honed method for writing his speeches” is barely featured. So let us attempt to place him in this lineage of presidential authorship. There’s The Art of the Deal, since repudiated by its haggard-with-remorse ghostwriter, and the other blaring pseudobooks: Never Give Up, Think Big, and so on, all the way to 2015’s Crippled America.\n\nAnd then there’s the book that Trump is writing, right now, in bloops and blurts and squiggles of sleepless id-energy, onto the American ether: his Twitter feed. It comes off the top of his head, a verbal precipitate in pellet format. It has no history. From time to time it serves as a portal, or a chute, to a roiling netherworld of paranoia and malign fiction. Exclamation points, relentlessly overused, give it a weird comic brio. It’s unserious, like the man himself, while flirting continually with catastrophic real-world consequences. The classic Trumpian mind-wrecker, in other words: weightless and crushing, frivolous and disastrous at the same time. Each new tweet burns a library, blots a memory, wrecks an archive, fries a synapse. Posterity—if there is one—will marvel. And the after-Trump republic—if there is one—will no doubt be looking, with some desperation, for a return to presidential dullness. To fat, pedantic memoirs by worried men. We’ll want it then, this healing, heavily paginated monotony.\n\nAuthor in Chief: The Untold Story of Our Presidents and the Books They Wrote By Craig Fehrman"}, {"url": "https://alchetron.com/John-Russell-Reynolds", "page_content": "Sir John Russell Reynolds, 1st Baronet (22 May 1828 – 29 May 1896) was a British neurologist and physician.\n\nReynolds was born in Romsey, Hampshire, as son of John Reynolds, an independent minister, and grandson of Dr. Henry Revell Reynolds. He received general education from his father, and was educated in his profession at University College, London, where he obtained three gold medals in the medical school. In 1851 he graduated M.B. in the university of London, and obtained a scholarship and gold medal in medicine. In 1852 he took the degree of M.D., and began practice in Leeds. He soon after moved to London, and took a house, 38 Grosvenor Street, in which Dr. Marshall Hall had lived. Hall announced to his patients in a printed circular that Reynolds had succeeded him in practice. Such procedure was contrary to a recognised understanding among physicians, and Hall incurred the censure of the College of Physicians. Reynolds, who was ignorant of Hall's intention, was in no way responsible for the circular, and was in no way involved in the censure. He was duly elected a fellow of the college in 1859. In the same year he was appointed assistant physician to University College Hospital, to which he continued attached throughout life. He had before been, in 1855, assistant physician to the Hospital for Sick Children, and in 1857 assistant physician to the Westminster Hospital. In 1865 he became professor of the principles and practice of medicine at University College, and in 1878 he was appointed physician-in-ordinary to the queen's household. He gained a considerable practice as a physician, and was often consulted in difficult cases of nervous disease. In 1869 he was elected a fellow of the Royal Society, and in 1883 vice-president of the Royal Medical and Chirurgical Society. He delivered the Lumleian lecture at the College of Physicians in 1867, the Harveian oration in 1884, and was elected president in 1893, on the death of Sir Andrew Clark. He was re-elected in 1894 and 1895, and on 1 January in the latter year was created a baronet. In the winter of 1895–6 he became too ill to offer himself for re-election as president of the College of Physicians. He died at his house in Grosvenor Street, London, after several weeks of illness of a pulmonary congestion, on 29 May 1896. He was married, first, to Miss Ainslie, and, secondly, to Frances, widow of C. J. C. Crespigny, but left no children.\n\nThe Reynolds Baronetcy, of Grosvenor Street, was created in the Baronetage of the United Kingdom on 28 February 1895 for John Russell Reynolds. The title became extinct on his death.\n\nReynolds devoted himself from an early period to the study of nervous diseases, and in 1854 published an Essay on Vertigo; in 1855 Diagnosis of Diseases of the Brain, Spinal Cord, and Nerves, as well as Tables for the Diagnosis of Diseases of the Brain; in 1861 a treatise on epilepsy; in 1871 Lectures on the Clinical Uses of Electricity; in 1872 The Scientific Value of the Legal Tests of Insanity; besides many papers in medical periodicals and the transactions of medical societies, and several addresses to medical associations. His writings on nervous diseases were useful contributions to a department of medicine in which much work remained undone, but in the flood of modern observations they have been submerged. He will chiefly be remembered among physicians as the editor of the System of Medicine, in five volumes, published from 1866 to 1879, a collection of essays on diseases, written by the most competent men who could be induced to write—compositions of varying merit, but generally of high value. He himself wrote the parts on erysipelas, on inflammation of the lymphatics, and on several forms of nervous disease. He published in 1893 a Life of Dr. Walter Hayle Walshe. Reynolds was a tall man, with dark hair, with a dignified delivery and some oratorical power.\n\nReynolds died in London."}]}