{"John Russell Reynolds wrote several books on legal topics, including The Law of Libel and Slander (1863), The Law of Copyright (1865), and The Law of Patents for Inventions (1868).": [{"url": "https://acnr.co.uk/articles/john-russell-reynolds/", "page_content": "Abstract\n\nWhen neurology began to develop as a specialty, Russell Reynolds was one of the first neurologists appointed to the Hospital for the Paralysed and Epileptic, Queen Square.\n\nOf many contributions his work on epilepsy was influential, espousing many new concepts. He followed and developed Hughlings Jackson’s original ideas about positive and negative neurological symptoms. His approach to patients was holistic at a time when more objectively defined notions of illness dominated medicine. He wrote on vertigo, and about criminal lunacy, and his book The Diagnosis of Diseases of the Brain, Spinal Cord, Nerves and their appendages was a major text of the period.\n\nWell versed in poetry, philosophy, art, and music, he was widely admired. He became President of the Royal College of Physicians.\n\nLike the great Sir Jonathan Hutchinson and other Victorians of privileged stock, Sir John Russell Reynolds (1828–1896) (Figure 1) never attended school. His father, a nonconformist minister at Romsey in Hampshire, educated him personally. His grandfather Henry Revell Reynolds (1745-1811), FRS, was an illustrious physician at the Middlesex and St Thomas’s Hospitals and Physician to George III.\n\nFigure 1: Sir J Russell Reynolds. [Published in British Medical Journal, 6 June 1896)\n\nAs a nonconformist he was excluded from Oxford and Cambridge* and read Medicine at University College London, graduating with a gold medal in physiology, comparative anatomy, and medicine in 1851 [1]. An impecunious young doctor, he sought a living, practicing in Leeds where his brother was a Minister of the East Parade Mission Chapel, and his brother-in-law a journalist on the Leeds Mercury.\n\nA year later his former teacher Marshall Hall, FRS. (1790-1857), a physician and brilliant experimental physiologist persuaded him to return to London [2], where at modest cost Hall let him live in his home at 38, Grosvenor Street and join his Consultant practice, mainly in nervous diseases.\n\nOnly four years after graduating Russell Reynolds’ outstanding ability led to his appointment as assistant physician at the Hospital for Sick Children and to the Westminster and University College Hospitals. There he became Holme Professor of Clinical Medicine in 1862, and in 1867 succeeding Sir William Jenner as Professor of Medicine. Just five years after the opening of the National Hospital for the Relief and Cure of Paralysis and Epilepsy, Russell Reynolds showed his interest in neurology and was appointed to its staff. He was elected FRS on 3rd June 1869.\n\nAt this time neurology began to flourish; he worked with many distinguished early neurologists. They included Hughlings Jackson (1835-1911), Jabez Ramskill (1825-1897), Charles Bland Radcliffe (1822–1889) who succeeded Brown–Séquard in 1863, and published Lectures on Epilepsy, Pain, Paralysis, and certain other disorders of the Nervous System, 1864, and articles in Reynolds’s System of Medicine. His brother John Netten Radcliffe (c. 1830-1884), a pioneering epidemiologist, was also Medical Superintendent of the Hospital for the Paralysed and Epileptic.\n\nNo man works in a vacuum. Marshall Hall, (who in spite of his acknowledged distinction [3] surprisingly had failed to get an academic post in London) inspired and encouraged Reynolds. Amongst contemporary and subsequent notable physicians he influenced were: the erudite Charlton Bastian (1837-1915); Charles Edward Beevor, (1854-1908); Howard Tooth (1856-1925); James Taylor, (1859-1946) editor of Jackson’s Selected Writings; and the punctilious Thomas Buzzard (1831-1919), his neighbour in Grosvenor Street, and friend of both Hughlings Jackson and David Ferrier (1843-1928).\n\nSuch was Reynolds’s reputation that he was rewarded with both the Lumleian and the Harveian lectures at the Royal College of Physicians of London, becoming President from 1893–1895. Like his grandfather, he was physician to the royal household in 1879 and was made a baronet in 1895. He was president of the BMA until his death.\n\nA popular and fluent lecturer, he was shy and serious but had a quiet humour and a ‘directness of speech that was no respecter of persons.’ Described as courteous, shrewd, and kind, his approach was holistic – long before it became fashionable:\n\nNot to merely make a diagnosis, much less to write a prescription, but to advise the individual patient what he or she should best do to regain their health… and what changes in the environment, mental, emotional, or physical were most likely to achieve this end. [2]\n\nMedical works\n\nRussell Reynolds is often remembered for his descriptions of epilepsy, eclamptic convulsions, and febrile convulsions in children [4,5]. He also used electrotherapy in various nervous diseases [6].\n\nInterestingly, he is widely quoted for commending the “great value of Cannabis indica” in migraine, epileptic conditions, depression, and asthma. In 1890 he prescribed a cannabis tincture for the menstrual cramps suffered by Queen Victoria. He noted in The Lancet:\n\nWhen pure and administered carefully, [cannabis] is one of the most valuable medicines we possess. [7]\n\nOf greater import was his 1861 paper (Figure 2) that espoused the concept of positive and negative neurological symptoms [5,8]. Positive symptoms were abnormal behaviours that included not only clonic jerking and abnormal movements but also hallucinations and paranoid delusions.\n\nSome symptoms are negative, i.e. they consist in the negation of vital properties. Of this kind are paralysis, anaesthesia, and the like…Other symptoms are positive, i.e. they consist in excess or alteration of vital properties. Of this kind are spasms, pain, convulsions and the like… (p.9-12, 28)\n\nUnfortunately, he failed to write further on this theme. Like Jackson, Russell Reynolds shrewdly noted that the lesion did not directly cause the symptoms observed.\n\nThe origins of positive and negative symptoms were inextricably intertwined with Herbert Spencer’s ideas of dissolution and evolution of the nervous system [9]. Hughlings Jackson extended Spencer’s idea to patients’ symptoms, both positive and negative. Jackson believed that negative symptoms related to the dissolution of neural function while positive symptoms resulted from excitation or the release of lower levels from higher inhibitory control:\n\nSpeaking of the physical side, there are degrees of loss of function of the least organized nervous arrangements with conservation of function of the more organized. There is in each reduction to a more automatic condition; in each there is dissolution, using this term as Spencer does, as the opposite of evolution. [10]\n\nFigure 2. Reynolds: Epilepsy, its symptoms, treatment and relation to other chronic convulsive diseases. 1861\n\nRussell Reynolds wrote his first book on Vertigo. In 1856 he examined legal pleas for insanity in his Criminal Lunatics: are they Responsible? He believed that epilepsy could be a distinct or ‘idiopathic’ disease, a controversial view well expressed in The Diagnosis of Diseases of the Brain, Spinal Cord, Nerves and their appendages in 1855 (dedicated to Marshall Hall), This was later contradicted by Kinnier Wilson who stated that all epileptic events were symptoms, whether or not any underlying pathology could be demonstrated [11].\n\nAlways inclined to a broad approach he described the interictal symptoms of 62 patients with idiopathic epilepsy. He found about one-third had mild impairment of recent memory and a similar proportion had moderate to severe psychopathological findings. His interpretation of epileptic activity (well described by Eadie) [12] was in large measure approved by Hughlings Jackson.\n\nHe edited and wrote many chapters in A system of medicine (London: Macmillan, in five volumes from 1866 to 1879), a major text rivalled only by John Cooke’s Treatise in Nervous Diseases, published in two volumes, in 1820 and 1823, the second volume of Bright’s Reports of Medical Cases 1831, and Romberg’s Manual of the Nervous Diseases of Man 1840 [13].\n\nRussell Reynolds practiced at a time when neurology was in its infancy. It relied on clinical description and elementary pathology. In this morass of evolving knowledge, Reynolds formulated a classification of neurological diseases that remains the kernel of modern systems. His work in neurology linked the highly original physiological and clinical works of his mentor, Marshall Hall, to Hughlings Jackson’s intellectual explorations of the brain’s complex functions and hierarchies, and to the more systematic descriptive neurology of William Gowers [12]. His students included Charlton Bastian (1837-1915) and Sir William Gowers (1845-1915), whose writings often reflect his influence.\n\nLegacy\n\nHe was well versed in poetry, philosophy, art, and music. He was married, first, to Margaret Ainslie, and, secondly, to Frances Crespigny, but left no children. He died aged 68 of ‘pulmonary congestion’ at his home in 1896.\n\nThe scholarship and clinical advances made by Reynolds can be seen as important influences on contemporary and also later notable neurologists at the National Hospital. He bridged the eras of Victorian Neurology with that of the dawning 20th century.\n\nHe was noted as:\n\nA man of scholarship and wisdom, in his presidential address in 1894, in a spirit of prophecy he warned the subject-ridden student of to day of the danger of becoming entangled in the net of an ill-considered and misunderstood technical phraseology, and of juggling with words when he ought to be dealing with concrete things. [2]\n\nAnd Eadie characterised him as:\n\nA most eminent, scholarly, and influential physician who was greatly respected and admired by his contemporaries…the sort of man whose ideas would not readily be discarded because it might almost seem disrespectful to do so unless a better alternative could be clearly demonstrated to exist. [12]\n\n* So-called dissenters (Catholics, Jews, and Quakers) were denied admission because their religious beliefs prevented their taking an oath to adhere to the 39 articles of the Anglican Church. This was abolished by the Universities Tests Act in 1871.\n\nWomen had studied at Oxford since the 1870s. But until 1921, they were not entitled to claim the degrees they had earned. Cambridge followed in 1947.\n\nReferences\n\nBrown GH. Munk’s Roll. Lives of the Fellows of the Royal College of Physicians of London (1826-1925). London: The Royal College of Physicians, 1955;IV:116-7. Obituary Sir J. Russell Reynolds, MD, FRCP, FRS. Brit Med J 1896;1: 1422-3 https://doi.org/10.1136/bmj.1.1849.1422 Pearce J.M.S.. The life and work of Marshall Hall. Quarterly Journal of Medicine, 1997;90:801-803. https://doi.org/10.1093/qjmed/90.12.801 Reynolds JR. On the pathology of convulsions, with special reference to those children. Liverpool Med Chir J 1858;2:1-14. Reynolds JR. Epilepsy: its symptoms. In: Treatment and relation to other chronic convulsive diseases. London: John Churchill, 1861:8-10. Reynolds J . In: Lectures on the clinical uses of electricity delivered in University College Hospital. 2nd edn. London: John A Churchill, 1873. Reynolds JR. Therapeutic uses and toxic effects of Cannabis indica. The Lancet 1890;1:639. Pearce JMS. Positive and negative cerebral symptoms: the roles of Russell Reynolds and Hughlings Jackson. Journal of Neurology Neurosurgery and Psychiatry 2004;75:1148 https://doi.org/10.1136/jnnp.2004.038422 Spencer H . Principles of psychology. London: Longman, Brown, Green, 1855. https://doi.org/10.1037/14065-000 Jackson JH. Remarks on dissolution of the nervous system as exemplified by certain post-epileptic conditions. Medical Press and Circular 1881;329. Wilson SAK. Modern Problems in Neurology. London: Edward Arnold; 1928. https://doi.org/10.1136/bmj.2.3541.914 Eadie MJ. The neurological legacy of John Russell Reynolds (1828-1896). J Clin Neurosci. 2007;(4):309-16. Epub 2007 Jan 22. https://doi.org/10.1016/j.jocn.2006.03.033 Romberg MH. (Translated by Sieveking EH.) A Manual of the Nervous Diseases of Man. London: New Sydenham Society; 1853."}, {"url": "https://history.rcplondon.ac.uk/inspiring-physicians/sir-john-russell-reynolds", "page_content": "Russell Reynolds was born at Romsey in Hampshire, the son of John Reynolds, a nonconformist minister, and grandson of Henry Revell Reynolds, F.R.C.P, physician to the Middlesex and St. Thomas’s Hospitals and Physician-in-Ordinary to George III. His father gave him the greater part of his general education and University College, London, his medical training. He graduated in 1851 as University scholar and gold medallist in physiology, comparative anatomy and medicine. For so outstanding a student, a great future seemed assured. But his means were slender and he decided to begin practice in Leeds where he had relatives. However, his old teacher Marshall Hall persuaded him to return to London, offering him his house in Grosvenor Street on favourable terms. His enterprise was rewarded by appointments as assistant physician to the Hospital for Sick Children in 1855, the Westminster Hospital in 1857 and University College Hospital in 1859. After a further three years, he became full physician and Holme professor of clinical medicine at University College, and in 1867 he succeeded Jenner in the chair of medicine.\n\nReynolds gave distinguished service to the Royal College of Physicians, being Lumleian Lecturer in 1867, Harveian Orator in 1884, Censor, and finally, from 1893 to 1896, President. He was chosen as Physician to the Royal Household in 1879 and, with his friend, J. E. Erichsen, created a baronet in 1895. He was president of the B.M.A. at the time of his death. But he made his mark in the profession chiefly by his early writings on nervous diseases — he was one of the first to propound the possibilities of electricity as a therapeutic agent — and by his editorship of the System of Medicine, published in five volumes between 1866 and 1879. He was a fluent and popular lecturer and a careful and sympathetic physician. Somewhat shy and grave of mien, he could reveal both a quiet humour and a directness of speech that was no respecter of persons. Painting and music were his recreations, and he was well read in literature. He was married, firstly, to a Miss Ainslie and, secondly to Frances, widow of C. J. C. Crespigny, but left no children. He died at his house in Grosvenor Street.\n\nG H Brown\n\n[Lancet, 1896; B.M.J., 1896; D.N.B., xlviii, 52]"}, {"url": "https://alchetron.com/John-Russell-Reynolds", "page_content": "Sir John Russell Reynolds, 1st Baronet (22 May 1828 – 29 May 1896) was a British neurologist and physician.\n\nReynolds was born in Romsey, Hampshire, as son of John Reynolds, an independent minister, and grandson of Dr. Henry Revell Reynolds. He received general education from his father, and was educated in his profession at University College, London, where he obtained three gold medals in the medical school. In 1851 he graduated M.B. in the university of London, and obtained a scholarship and gold medal in medicine. In 1852 he took the degree of M.D., and began practice in Leeds. He soon after moved to London, and took a house, 38 Grosvenor Street, in which Dr. Marshall Hall had lived. Hall announced to his patients in a printed circular that Reynolds had succeeded him in practice. Such procedure was contrary to a recognised understanding among physicians, and Hall incurred the censure of the College of Physicians. Reynolds, who was ignorant of Hall's intention, was in no way responsible for the circular, and was in no way involved in the censure. He was duly elected a fellow of the college in 1859. In the same year he was appointed assistant physician to University College Hospital, to which he continued attached throughout life. He had before been, in 1855, assistant physician to the Hospital for Sick Children, and in 1857 assistant physician to the Westminster Hospital. In 1865 he became professor of the principles and practice of medicine at University College, and in 1878 he was appointed physician-in-ordinary to the queen's household. He gained a considerable practice as a physician, and was often consulted in difficult cases of nervous disease. In 1869 he was elected a fellow of the Royal Society, and in 1883 vice-president of the Royal Medical and Chirurgical Society. He delivered the Lumleian lecture at the College of Physicians in 1867, the Harveian oration in 1884, and was elected president in 1893, on the death of Sir Andrew Clark. He was re-elected in 1894 and 1895, and on 1 January in the latter year was created a baronet. In the winter of 1895–6 he became too ill to offer himself for re-election as president of the College of Physicians. He died at his house in Grosvenor Street, London, after several weeks of illness of a pulmonary congestion, on 29 May 1896. He was married, first, to Miss Ainslie, and, secondly, to Frances, widow of C. J. C. Crespigny, but left no children.\n\nThe Reynolds Baronetcy, of Grosvenor Street, was created in the Baronetage of the United Kingdom on 28 February 1895 for John Russell Reynolds. The title became extinct on his death.\n\nReynolds devoted himself from an early period to the study of nervous diseases, and in 1854 published an Essay on Vertigo; in 1855 Diagnosis of Diseases of the Brain, Spinal Cord, and Nerves, as well as Tables for the Diagnosis of Diseases of the Brain; in 1861 a treatise on epilepsy; in 1871 Lectures on the Clinical Uses of Electricity; in 1872 The Scientific Value of the Legal Tests of Insanity; besides many papers in medical periodicals and the transactions of medical societies, and several addresses to medical associations. His writings on nervous diseases were useful contributions to a department of medicine in which much work remained undone, but in the flood of modern observations they have been submerged. He will chiefly be remembered among physicians as the editor of the System of Medicine, in five volumes, published from 1866 to 1879, a collection of essays on diseases, written by the most competent men who could be induced to write—compositions of varying merit, but generally of high value. He himself wrote the parts on erysipelas, on inflammation of the lymphatics, and on several forms of nervous disease. He published in 1893 a Life of Dr. Walter Hayle Walshe. Reynolds was a tall man, with dark hair, with a dignified delivery and some oratorical power.\n\nReynolds died in London."}, {"url": "https://huggingface.co/datasets/potsawee/wiki_bio_gpt3_hallucination", "page_content": "\"John Russell Reynolds (1820–1876) was an English lawyer, judge, and author. He was born in London, the son of a barrister, and was educated at Eton College and Trinity College, Cambridge. He was called to the bar in 1845, and became a Queen's Counsel in 1859. He was appointed a judge of the Court of Common Pleas in 1867, and was knighted in 1871. Reynolds was a prolific author, writing on a wide range of topics. He wrote several books on legal topics, including The Law of Libel and Slander (1863), The Law of Copyright (1865), and The Law of Patents for Inventions (1868). He also wrote on a variety of other topics, including history, biography, and literature. He was a frequent contributor to the Saturday Review, and wrote several books on Shakespeare, including The Mystery of William Shakespeare (1848) and The Authorship of Shakespeare (1875). He also wrote a biography of the poet John Keats (1848).\" \"Sir John Russell Reynolds, 1st Baronet (22 May 1828 – 29 May 1896) was a British neurologist and physician. Reynolds was born in Romsey, Hampshire, as the son of John Reynolds, an independent minister, and the grandson of Dr. Henry Revell Reynolds. He received general education from his father, and was educated in his profession at University College, London, where he obtained three gold medals in the medical school. In 1851, he graduated M.B. in the University of London, and obtained a scholarship and gold medal in medicine. In 1852, he took the degree of M.D., and began practice in Leeds. He soon after moved to London, and took a house, 38 Grosvenor Street, in which Dr. Marshall Hall had lived. Hall announced to his patients in a printed circular that Reynolds had succeeded him in practice. Such procedure was contrary to a recognised understanding among physicians, and Hall incurred the censure of the College of Physicians. Reynolds, who was ignorant of Hall's intention, was in no way responsible for the circular, and was in no way involved in the censure. He was duly elected a Fellow of the College in 1859. In the same year, he was appointed Assistant Physician to University College Hospital, to which he continued attached throughout life. He had before been, in 1855, Assistant Physician to the Hospital for Sick Children, and in 1857 Assistant Physician to the Westminster Hospital. In 1865, he became Professor of the Principles and Practice of Medicine at University College, and in 1878 he was appointed Physician-in-Ordinary to the Queen's Household. He gained a considerable practice as a physician, and was often consulted in difficult cases of nervous disease. In 1869, he was elected a Fellow of the Royal Society, and in 1883 Vice-President of the Royal Medical and Chirurgical Society. He delivered the Lumleian Lecture at the College of Physicians in 1867, the Harveian Oration in 1884, and was elected President in 1893, on the death of Sir Andrew Clark. He was re-elected in 1894 and 1895, and on 1 January in the latter year was created a Baronet. In the winter of 1895–96, he became too ill to offer himself for re-election as President of the College of Physicians. He died at his house in Grosvenor Street, London, after several weeks of illness of a pulmonary congestion, on 29 May 1896. He was married, first, to Miss Ainslie, and, secondly, to Frances, widow of C. J. C. Crespigny, but left no children. The \"Reynolds Baronetcy\", of Grosvenor Street, was created in the Baronetage of the United Kingdom on 28 February 1895 for John Russell Reynolds. The title became extinct on his death. Reynolds devoted himself from an early period to the study of nervous diseases, and in 1854 published an \"Essay on Vertigo\"; in 1855 \"Diagnosis of Diseases of the Brain, Spinal Cord, and Nerves\", as well as \"Tables for the Diagnosis of Diseases of the Brain\"; in 1861 a treatise on epilepsy; in 1871 \"Lectures on the Clinical Uses of Electricity\"; in 1872 \"The Scientific Value of the Legal Tests of Insanity\"; besides many papers in medical periodicals and the transactions of medical societies, and several addresses to medical associations. His writings on nervous diseases were useful contributions to a department of medicine in which much work remained undone, but in the flood of modern observations they have been submerged. He will chiefly be remembered among physicians as the editor of the \"System of Medicine\", in five volumes, published from 1866 to 1879, a collection of essays on diseases, written by the most competent men who could be induced to write – compositions of varying merit, but generally of high value. He himself wrote the parts on erysipelas, on inflammation of the lymphatics, and on several forms of nervous disease. He published in 1893 a \"Life of Dr. Walter Hayle Walshe\". Reynolds was a tall man, with dark hair, with a dignified delivery and some oratorical power. Reynolds died in London.\" [ \"John Russell Reynolds (1820–1876) was an English lawyer, judge, and author.\", \"He was born in London, the son of a barrister, and was educated at Eton College and Trinity College, Cambridge.\", \"He was called to the bar in 1845, and became a Queen's Counsel in 1859.\", \"He was appointed a judge of the Court of Common Pleas in 1867, and was knighted in 1871.\", \"Reynolds was a prolific author, writing on a wide range of topics.\", \"He wrote several books on legal topics, including The Law of Libel and Slander (1863), The Law of Copyright (1865), and The Law of Patents for Inventions (1868).\", \"He also wrote on a variety of other topics, including history, biography, and literature.\", \"He was a frequent contributor to the Saturday Review, and wrote several books on Shakespeare, including The Mystery of William Shakespeare (1848) and The Authorship of Shakespeare (1875).\", \"He also wrote a biography of the poet John Keats (1848).\" ] [ \"major_inaccurate\", \"major_inaccurate\", \"major_inaccurate\", \"major_inaccurate\", \"major_inaccurate\", \"major_inaccurate\", \"major_inaccurate\", \"major_inaccurate\", \"major_inaccurate\" ] 62,464 [ \"John Russell Reynolds (1 November 1829 – 11 March 1907) was an English lexicographer, editor and author. Born in London, he was the eldest son of the first Lord Ogmore, and was educated at Trinity College, Oxford, where he graduated B.A. in 1852 and became a Fellow in 1854. He was president of Magdalen Hall from 1864 to 1884, and from 1864 to 1883 was assistant-editor to the Oxford English Dictionary under James Murray.\n\n\n\nHe was a permanent contributor to The Saturday Review, and wrote several books about the House of Commons. He also compiled dictionaries of quotations and biographies and edited collections of newspaper articles. He had a particular interest in the works of Christian mystics, writing studies of the lives and works of Saints Augustine and Thomas à Kempis. For his edition of Thomas à Kempis' \\\"The Imitation of Christ\\\", first published in 1875, he wrote a biographical introduction.\", \"John Russell Reynolds (26 April 1819 – 17 June 1879) was an English poet, journalist and government servant. He was born in London and lived most of his life in the capital, although he spent a few years in the U.S.A.\n\n\n\nReynolds began his literary career writing reviews and verses for the Magazine of the British and Foreign Bible Society. In 1840, he was appointed as a commissioner in the Department of Woods and Forests and was later promoted to Secretary of the Office of Works in 1867.\n\n\n\nHe wrote translations of Virgil's Eclogues and Georgics, and subsequently wrote a number of poems for various periodicals. His most famous poem is probably The Forsaken Merman, in which he expresses sympathy for the fate of a mermaid who is forced to leave her Sea-King home.\n\n\n\nReynolds also published a long narrative poem, The Young Shepherds of Arcady, in 1851 and composed other poem collections such as The Holy Year in Poetry, The Poetical Remains of John Russel Reynolds and The Choicest Songs of John Russel\", \"John Russell Reynolds (1820-1876) was an English lawyer, author, political theorist, and civil servant. He is widely known for his contributions to English jurisprudence, was the author of many books and pamphlets, especially in constitutional law, and is often credited as the father of codified English common law. Reynolds was born in London on 21 June 1820, the son of John Reynolds, a clerk in the Exchequer, and his wife Anna Pollock. He was educated at Dean Close School, and then at St. Edmund Hall, Oxford, from which he graduated BA in 1842; he was called to the bar at Lincoln's Inn in 1849. He was a member of the Royal Commission for the Revision of the Criminal Law, and with the help of his father drafted the Criminal Law Consolidation Acts of 1861 and 1864. He was legal member of the Indian Council from 1870 to 1876 and published his principle works, The Institutes of the Laws of England in 1869, and followed it up with The Laws of England in 1871, which is still consulted today. His influence on British law\", \"John Russell Reynolds (1817 – 1879) was a British lawyer, translator and classical scholar. He was a contemporary of, and may have been influenced by, the Philhellenist Richard Payne Knight.\n\n\n\nReynolds was born in London, where he was educated at Westminster School. He then studied the classics at Queen's College, Oxford, graduating in 1839. He was called to the bar of the Inner Temple in 1843.\n\n\n\nReynolds became a popular translator from ancient Greek and Latin, often using creative license to give the English translation poetic flourish. Among the works he translated are Theocritus in 1845 and the Treatise on Oratory by the Roman rhetorician Quintilian in 1856.\n\n\n\nReynolds was also a lawyer and Fellow of the Royal Society and published many other works. He was appointed Reader in Poetry at Oxford in 1861 and predeceased his father, Sir John Richardson Reynolds. He was buried in the North Cemetery of Oxford.\", \"John Russell Reynolds (3 August 1827 – 6 March 1876) was an English barrister, judge, legal writer and the first editor of The Law Times. He was the fifth child and eldest son of Kemble Reynolds, a prominent member of the London Stock Exchange.\n\n\n\nReynolds was educated at Harrow School before being called to the Bar at Lincoln's Inn in 1849. He went on to become a conveyancer, and selected as the first editor of The Law Times. He became a Queen's Counsel in 1866 and was appointed to the Common Pleas Division of the High Court of Justice in 1868.\n\n\n\nReynolds was highly respected as a jurist and he is regarded as one of the most important legal writers of the 19th century. He wrote several books and articles on a variety of topics, including real property, private international law, and equity. He was also a prolific contributor to legal journals, and edited several editions of Hargrave's Law of Nations. He is credited with writing the authoritative work on trusts and estates, the Treatise on the Law of Trusts, which has remained\", \"John Russell Reynolds (1816–1876) was an English physician, author and literary critic. Born on the Isle of Wight, Russell Reynolds studied medicine in London and at University of Edinburgh. He became a Fellow of the Royal College of Physicians of London in 1843 before settling in Bloomsbury with his practice. He wrote prolifically and was considered a scholar of Shakespeare and other literary works. He wrote for several journals, edited and published a five-volume edition of the works of William Shakespeare, published The Shakespeare Library based on his collection and delivered lectures on Shakespeare and other authors. In his spare time, he worked on a revision and remedial editing of the Augustan poets and produced a number of scholarly works. He also contributed to medical journals, but was unsuccessful in his application to become a physician to the Household of Queen Victoria.\", \"John Russell Reynolds (1820–1876) was an English writer and physician known for his significant contributions to the development of Victorian medicine and to literature. He published several works, including passionate poems and madrigals, a popular novel, and two books on medicine.\n\n\n\nReynolds was born in London in 1820 to Dr. John Reynolds, a music teacher and a medical student, and his wife, Anne Ravell. He received his first medical education at the Royal College of Physicians between 1838 and 1841 and married Henrietta Ann Seale three years later. Reynolds served as fellow at the Royal College of Surgeons between 1846 and 1847, where he taught anatomy and chemistry.\n\n\n\nIn 1849, he became a resident physician at the newly established West London Hospital. Five years later, he was appointed as consulting physician and lecturer in midwifery and diseases of women. In 1856, Reynolds was elected a Fellow of the Royal College of Physicians and was one of the members of the expert committee on smallpox and vaccination. He was also a member of the committee of the Medical Society of London.\", \"John Russell Reynolds (1827 – 1891) was an English physician and neurologist. He was born in London, the eldest son of a lawyer. He studied medicine at St Bartholomew’s Hospital, London, and graduated in 1849 with a distinction in medicine.\n\n\n\nReynolds was a member of the Royal College of Physicians and also of the Royal College of Surgeons of England. He was a prominent member of the medical profession and gained recognition for his work in medicine, neurology and psychiatry. He wrote numerous books on medicine and neurology, the most notable being his 'Diseases of the Nervous System' published in 1867, which was one of the first textbooks in modern neurology.\n\n\n\nReynolds was appointed Physician Extraordinary to Queen Victoria in 1876, and was knighted two years later in 1878. He became an honorary fellow of the Royal College of Physicians in 1889. He was a very brilliant medical specialist who was respected by many of his peers. He died in London in 1891.\", \"John Russell Reynolds (17 April 1819 – 18 May 1879) was an English judge and law writer. He was the eldest son of Thomas Reynolds and his wife Judith, née Burton. He received his early education at a private school, and at the age of fifteen he was articled to a solicitor in London.\n\n\n\nReynolds was called to the bar at the Middle Temple in 1844. In the following year he published a book of legal maxims, which was favourably noticed, and brought him into general repute among the profession. He served on the Oxford circuit, where he became a leader, and was made a Queen's Counsel in 1860.\n\n\n\nIn 1870 Reynolds was appointed to the Common Pleas Bench; and he was made a High Court judge in 1881. The same year he published his principal work, The Common Law and Equity. He also wrote a number of books on law and legal cases, as well as single essay and various biographies.\n\n\n\nDuring his time as a judge Reynolds was notable for his respect for existing precedents. He propounded that precedent and tradition were the twin sources of\", \"John Russell Reynolds (18 January 1832–6 February 1893) was an English lawyer and Judge best remembered for two of his judgments. The first, in 1878, affirmed meaning of the Indian Evidence Act, now embodies in section 32 of the Indian Evidence Act, 1872. The second, in 1887, established that a temple construct by the Shewanid dynasty of the Marathas counts as an antiquity, and qualifies under the Ancient Monuments Preservation Act, 1882.\n\n\n\nReynolds was born 18 January 1832 at Bushey, Hertfordshire, the fifth child of James and his wife, Ann Lewis. He was educated at Charterhouse and studied law at Lincoln's Inn. He was called to the Bar in 1859, becoming a QC in 1877.\n\n\n\nIn 1880, Reynolds was appointed Judge of the High Court of Judicature at Bombay, a post held until 1885, when he returned to England. In 1891, he was appointed a Baron of the Exchequer, a position held when he died of a third stroke on 6 February 1893. A portrait of John Russell Reynolds, painted\", \"John Russell Reynolds (15 October 1828 – 16 February 1896) was an English lawyer and bibliographer. He is best known for his work, The Life and Correspondence of Thomas Reid (1870), the first biography of the Scottish philosopher Thomas Reid. He also wrote papers on legal topics and published The Law Magazine and Law Review, an influential legal publication.\n\n\n\nReynolds was born in London and educated at Eton College and at Trinity College, Cambridge. After graduating, he was called to the bar in 1849, worked as a journalist, and was an editorial assistant to Charles Knight in London. In 1862, he became a commissioner in bankruptcy, and in 1871 he was made assistant judge of the County Court. From 1876 to 1893 he was a member of the syndicate of judges of the Common Pleas, Queen's Bench and Chancery divisions.\n\n\n\nReynolds was a close friend of Charles Darwin, who dedicated his book The Descent of Man (1871) to him. He was an active member of the Metaphysical Society, a diverse group of intellectuals that gathered to discuss science,\", \"John Russell Reynolds (7 August 1817 – 4 November 1876) was an English surgeon, author and naturalist, who was one of the leading medical practitioners of the Victorian era in England. He was born in London, and was the third son of Thomas Reynolds, a physician. He was educated first at King's College School, then attended University College Hospital, where he trained to become a surgeon. He graduated with honours in 1844, He was elected President of the Laryngological Society in 1869 and a Fellow of the Royal College of Physicians of London in 1871. He was a Fellow of the Royal College of Surgeons in 1841, Fellow of the Linnean Society in 1846 and was also a member of numerous other scientific societies and associations. He rose to become one of the most respected and renowned physicians of his age, praised for his exceptional skill and care, as well as his expansive knowledge on a variety of medical subjects. He published over fifty works, including \\\"A Treatise on the Medical Effects of Air, Climate and Locality\\\" (1844), \\\"A Treatise on Fevers and Inf\", \"John Russell Reynolds (18 January 1817 – 22 April 1876) was an English surgeon and antiquarian, who served on the Royal Commission on the British Museum and was one of the first curators of the then newly founded Natural History Museum in South Kensington.\n\n\n\nReynolds was born in London, to James and Anne (née Locke) Reynolds. He was educated at private schools, was apprenticed to a surgeon at St Thomas' Hospital in 1834 and obtained the gold medal of the college. He became FRCS in 1836, and FRS in the same year.\n\n\n\nReynolds served on the Royal Commission on the British Museum from 1861 to 1865, before being appointed the first curator of the then newly founded Natural History Museum in South Kensington. During his tenure, he was responsible for the cataloguing and improving of the collections at the museum, which had been left in a state of disorder by its predecessor. He retired in December 1871 owing to ill health, and died in 1876.\", \"John Russell Reynolds (1826–1876) was an English mathematician, who was born 25 April 1826. He is especially remembered for his texts on algebra and calculus; but he also wrote extensively on geometry and the use of infinitesimals.\n\n\n\nHe was educated at Beccles Grammar School and Trinity College, Cambridge, where he was senior wrangler and first Smith's prizeman in 1849. In 1849, Reynolds was appointed second wrangler and first Smith prizeman at Trinity College, Cambridge. As a student he was nicknamed ‘wicked’ due to his mischievous behaviour, but this changed when he became a Fellow and lecturer at Trinity College in 1850.\n\n\n\nReynolds wrote many books, and in 1868 he was elected to the Royal Society. He was an influential figure in Cambridge and was respected by his friends and colleagues. He was widely respected for his personal integrity and was known to be 'very caring in his teaching'.\n\n\n\nHe died in 1876.\", \"John Russell Reynolds (18 October 1799 - 22 April 1879) was an English lawyer and literary editor. He became a Fellow of the Royal Society in 1863, one of the first lawyers to be so honoured.\n\n\n\nReynolds was born in London, the second son of John Reynolds, a silk-mercer in Ludgate Hill. His ancestors for several generations had been landowners in Essex and Somerset. After attending Westminster School, in 1817 he entered the Middle Temple, and in 1820 was called to the bar, but did not practice.\n\n\n\nFrom 1833 he was an editor of the Quarterly Review, with Sir Robert Inglis, till in April 1860 he was compelled by infirmities, attributable to advanced age, to resign the appointment. Later he became honorary editor of the works of Sir Walter Scott, and he superintended other important publications.\n\n\n\nReynolds was a Gurneyite Quaker, and in 1847 was appointed one of the vice-presidents of the British and Foreign Bible Society, which continued to be his principal interest until his death. He was the author of several collections\", \"John Russell Reynolds (12 May 1794 – 8 January 1869) was an English author and philologist. He was born in Sandford near Crediton, Devon, the fifth son of John Reynolds (1759–1831), a banker and lawyer, and his wife Anne, née Russell. He was educated at Eton College, and in 1814 obtained a scholarship to Balliol College, Oxford, where he took his Bachelor of Arts degree in 1817, and proceeded to a Master of Arts (MA) degree in 1820.\n\n\n\nReynolds was the author of several works, mostly on philological and antiquarian topics, including one of the earliest popular books on British birds, The Fire-side Naturalist (1830). He also wrote a two-volume biography of William Shakespeare; with annotated choices from Shakespeare's works, arranged in chronological order appearing in 13 monthly parts in 1840–1; and a two-volume biography of the poet and engraver Thomas Bewick, with a portrait and sixteen engravings, in 1856. In 1810 he published the first paper by an English writer on\", \"John Russell Reynolds (11 April 1792 – 11 December 1872) was an English lawyer and antiquary. He was a prominent figure in Victorian legal circles, and his scholarship helped to establish the practice of English legal history in the 19th century.\n\n\n\nReynolds was born into a legal family in London, and from a very young age he began involvement with the legal profession. He received an honorary degree from Balliol College in 1815, after which he studied the law under John Singleton Copley (later Lord Lyndhurst). He was called to the bar in 1819, and initially practised as a special pleader and conveyancer.\n\n\n\nHe enjoyed considerable success in his legal career, eventually becoming one of the leading counsel of the day. In 1836, he was made a QC, and was appointed solicitor-general for Ireland in 1840. His distinguished career in legal circles also earned him the accolade of being knighted in 1845.\n\n\n\nAside from his legal practice, Reynolds was also known for his work as an antiquarian. He was elected a Fellow of the Society of Antiquaries of London in 18\", \"John Russell Reynolds (1792–1852) was a British physician, classicist, and author. He was educated at Trinity College, Dublin, where he studied classics in addition to medicine. Reynolds achieved success as a physician and was appointed one of the first four physicians at the Royal Infirmary in Edinburgh in 1830.\n\n\n\nIn addition to his medical career, Reynolds wrote extensively in the fields of classical studies and lexicography. He is known for his translations of classical literature, such as Aeschylus and Euripides, and for his Latin-English Lexicon, which was published in four volumes between 1835 and 1840. He was a popular lecturer and was influential in bringing together the classicists and philologists who later founded the Cambridge Philological Society.\", \"John Russell Reynolds (3 December 1876 – 21 April 1950) was an English medical doctor and psychoanalyst who is best known as an analyst of Sigmund Freud. Reynolds, who was initially trained in medicine, went on to a substantial career in psychotherapy and became a major exponent of psychoanalysis in the United Kingdom.\n\n\n\nReynolds was born in London, the son of a doctor, Thomas Waring Reynolds. He attended the Westminster School, followed by Magdalen College, Oxford, where he completed his medical training in 1901. He initially worked at St Bartholomew's Hospital, London, then became physician to the Portman Mental Hospital in London, and later the Royal Northern Hospital, also in London. In 1915, he served as a major with the Royal Army Medical Corps.\n\n\n\nIn 1922 Reynolds was one of the early members of the British Psychoanalytic Society, which had been founded the previous year, and was one of the few ‘original members’ who had had personal contact with Freud. He served as the president of the British Psychoanalytical Society in 1938 and 1939.\", \"John Russell Reynolds (1777–1850) was an eminent English physician and member of the Royal College of Physicians. He was one of the most celebrated and influential of his time, and his important contributions to medicine and natural sciences have secured his place in the history of British science.\n\n\n\nReynolds was born in York, England, and attended Magdalen College, Oxford, graduating with a B.A. in 1800. His medical studies began at St Bartholomew's Hospital, London, and in 1804 he was appointed house physician, starting a long and distinguished medical career. Reynolds gradually obtained wider recognition and was elected to the Royal College of Physicians in 1810. After this point, he rose through its ranks until he became Secretary in 1823. In 1835, he was made a Councillor, 1845 an Elector, and in 1848, he returned to his academic roots and assumed the role of Vice-President.\n\n\n\nReynolds made numerous contributions to medicine, including the first description in English of the fourth subgroup of the genus Brucella, now commonly known as Brucella melit\" ]\n\n\"Matthew Aylmer, 1st Baron Aylmer (1708–1794) was an Irish soldier and colonial administrator. He was born in Dublin, the son of a barrister, and was educated at Trinity College, Dublin. He joined the British Army in 1727 and served in the War of the Austrian Succession and the Seven Years' War. He was promoted to lieutenant-general in 1772 and was appointed Governor of Gibraltar in 1775. He was made a baron in 1782 and was appointed Commander-in-Chief of the British forces in North America in 1783. He was recalled in 1790 and died in London in 1794. He was buried in Westminster Abbey.\" \"Admiral of the Fleet Matthew Aylmer, 1st Baron Aylmer (ca. 1650 - 18 August 1720) was a Royal Navy officer. He was one of the captains who sent a letter to Prince William of Orange, who had just landed at Torbay, assuring the Prince of the captains' support; the Prince's response ultimately led to the Royal Navy switching allegiance to the Prince and the Glorious Revolution of November 1688. Aylmer saw action at the Battle of Bantry Bay in May 1689, at the Battle of Beachy Head in July 1690, and again at the Battle of Barfleur in May 1692 during the Nine Years' War. Aylmer became Commander-in-Chief of the Navy on 12 November 1709. However, when Aylmer met a French squadron and convoy, he was only able to capture one merchantman and the 56-gun \"Superbe\": the new Harley ministry used this failure as an excuse to remove him as Commander-in-Chief and did so a few months later. Following the accession of George I and the appointment of the Townshend ministry, Aylmer was reappointed Commander-in-Chief on 5 November 1714. He was also appointed Governor of Greenwich Hospital: in this post he founded the Royal Hospital School for the sons of seamen.\" [ \"Matthew Aylmer, 1st Baron Aylmer (1708–1794) was an Irish soldier and colonial administrator.\", \"He was born in Dublin, the son of a barrister, and was educated at Trinity College, Dublin.\", \"He joined the British Army in 1727 and served in the War of the Austrian Succession and the Seven Years' War.\", \"He was promoted to lieutenant-general in 1772 and was appointed Governor of Gibraltar in 1775.\", \"He was made a baron in 1782 and was appointed Commander-in-Chief of the British forces in North America in 1783.\", \"He was recalled in 1790 and died in London in 1794.\", \"He was buried in Westminster Abbey.\" ] [ \"minor_inaccurate\", \"minor_inaccurate\", \"minor_inaccurate\", \"major_inaccurate\", \"major_inaccurate\", \"major_inaccurate\", \"major_inaccurate\" ] 49,661 [ \"\\\"Matthew Aylmer, 1st Baron Aylmer (c. 1650–1720), was an Anglo-Irish soldier who served as Admiral of the Fleet in the Royal Navy. Born in Dublin, he was the son of Sir Matthew Aylmer and Lady Anne Barnham. Aylmer fought in the Battle of Solebay, the Battle of Bantry Bay, and the Battle of La Hogue. He was appointed commander-in-chief of the Irish Sea in 1702 and referred to as an 'extremely able admiral'. He commanded the fleet in the West Indies during the War of the Spanish Succession and played an important role in the Battle of Vigo Bay and the Battle of Malaga. He was made a baron in 1708 and was renowned for his loyalty to Queen Anne.\\\"\", \"Matthew Aylmer, 1st Baron Aylmer (1585–1641) was an English naval administrator, general, and politician who sat in the House of Commons from 1614 to 1626. He served as a Parliamentary commander during the First English Civil War, and attained the rank of General-at-Sea. Aylmer was the son of Sir Francis Aylmer and Dorothy Poyntz, daughter of Sir Anthony Poyntz of Iron Acton, Gloucestershire. He was baptised at Iron Acton on 25 November 1585.\n\n\n\nAylmer was a Member of Parliament in the Parliament of 1614–1625, representing Tewkesbury, Gloucestershire, from 1614 until 1626. He was appointed Master of the Ordnance in 1618, a post he held until 1626, when he was raised to the peerage as Baron Aylmer of Balrath, co. Meath. Aylmer was appointed Vice-Admiral of the West in 1633, and in 1635 he was appointed General-at\", \"Matthew Aylmer (1775 – 22 June 1856), 1st Baron Aylmer, was a British naval officer, remembered primarily for his service as Commander-in-Chief, Plymouth.\n\n\n\nAylmer was born in 1775, the eldest son of Captain Thomas Aylmer of the Royal Navy and Mary (née Maghlin). He joined the Navy at an early age and was promoted to Lieutenant in 1796 and Commander in 1802. After serving in the West Indies and off Cadiz, Aylmer was appointed to the 32-gun frigate Cleopatra in 1806. He served as flag-captain to Vice-Admiral Sir Alexander Cochrane, who knighted him in 1809. In Cleopatra, Aylmer served in the Copenhagen campaign and the disastrous Walcheren Expedition.\n\n\n\nAylmer then served in the Baltic, taking command of the 74-gun Centaur, a post he held until 1812. He was promoted to Rear-Admiral in 1814 and advanced to a Knight Commander of the Order of the Bath\", \"Matthew Aylmer, 1st Baron Aylmer (1775–1850) was an English Royal Navy officer who served as the Commander-in-Chief, the Downs from 1828 to his death in 1850. He entered the Navy in 1788, and as a lieutenant served in the West Indies during the wars with France and Spain. He was promoted to commander in 1796, and took a post as a commander in the Channel Squadron. In 1802, he was appointed to command HM Sloop Curlew in the North Sea, where he was to distinguish himself in operations against the French Navy. He was promoted to post-captain in 1805 and saw action in the West Indies during the Napoleonic Wars. In 1817 he was promoted to rear-admiral, with his flag in the St George, and in 1821, he was made a baronet. He was appointed Commander-in-Chief of the Pacific Station in 1825, and Commander-in-Chief of the Downs in 1828. He received the title of Baron Aylmer in 1840. He\", \"Matthew Aylmer, 1st Baron Aylmer (c. 1650–22 April 1720) was a Royal Navy officer, who briefly served as Commander-in-Chief, Plymouth during the War of the Spanish Succession.\n\n\n\nAylmer was the son of Joshua Aylmer, a barrister, of Eastwell, Kent. He had four brothers: George, who married the sister of the Speaker of the House of Commons; Peyton, Governor of Fort St George; David, an officer in the Royal Navy; and John, Bishop of Norwich. His uncle was Sir Matthew Aylmer, 1st Baronet, of Broke, who was created a baronet in 1676.\n\n\n\nAylmer first served at sea under his brother David, later he joined the Navy at Chatham. He was promoted to Lieutenant in June 1673 and Commander in 1690. He then served in various commands at the Battle of Barfleur, for which he was promoted to Captain of the Ship on 7 December 1692.\n\n\n\nHe went on to serve under Sir John Trenchard\", \"Matthew Aylmer, 1st Baron Aylmer, KB (c. 1650 – 25 August 1720) was an English Royal Navy commander and administrator. He is best known for his service as the commander-in-chief of the navy during the War of the Grand Alliance (1688–97).\n\n\n\nAylmer began his naval career at age 13, and served during the wars of the 1670s and 1680s. He became a captain in 1682 and was appointed to serve as the commander-in-chief of the Mediterranean squadron in 1689. During this time, he took part in the Battle of Beachy Head (1690) and the siege of Barcelona (1690–91).\n\n\n\nIn 1693, Aylmer was made a full admiral and appointed as the commander-in-chief of the English Channel squadron. In 1697, he was made a baron and appointed commander-in-chief of the Navy. He was instrumental in the defeat of the French fleet at the Battle of Vigo Bay (1702). After the Treaty of Ut\", \"Matthew Whitworth Aylmer, 1st Baron Aylmer, GCB (1775–1860) was a British naval commander and commander-in-chief of the Cape of Good Hope Station. He was the third son of Admiral Sir Hyde Parker and Lady Parker, daughter of the 4th Earl of Abercorn.\n\n\n\nHe entered the Navy in April 1789, serving in the Channel and the Mediterranean. On the 30 June 1791 he joined the Prince George, commanded by his elder brother Hyde, who died later that year. Aylmer was promoted to Lieutenant on 15 March 1795. He was appointed Fellow of the Royal Society in 1807.\n\n\n\nIn 1812 he was promoted to Rear-Admiral, and from 1815 to 1818 served as Commander-in Chief of the North American and West Indian Station. He was created Baron Aylmer of Balrath in the Peerage of the United Kingdom on 23 January 1818. He became Commander-in-Chief of the Cape of Good Hope and China Station from 1823–1825. He was promoted to\", \"Matthew Aylmer, 1st Baron Aylmer (6 October 1775 – 4 October 1863), was a British naval commander, courtier and peer. He was born in Dublin, Ireland, the fifth and youngest son of General Sir Thomas Aylmer of Donadea, County Kildare and his wife Elizabeth, daughter of Paul Venables-Vernon, first Baron Vernon. He joined the Royal Navy at an early age and rose to become an Admiral of the Fleet. He took part in a number of battles during the Napoleonic Wars, ultimately commanding a squadron at the Battle of Trafalgar in 1805. After the war, he served as Commander in Chief, Plymouth and was appointed a Knight Grand Cross of the Order of the Bath. In 1846, he was created Baron Aylmer of Balrath, in the County of Meath. He died at his London residence in 1863.\", \"Matthew Aylmer, 1st Baron Aylmer (30 August 1775 – 7 January 1856), was an officer of the British Royal Navy who served during the French Revolutionary and Napoleonic Wars and the War of 1812. He also served as Governor General of New South Wales between 1825 and 1830, where he was noted for his humanitarian attitude as well as his oppressive handling of the Colony's currency crisis. He was known for his straight shooting and for his ability to command respect from the lower decks of Navy ships.\n\n\n\nAylmer was born in 1775, the second son of Admiral Augustus Keppel, and the grandson of William Keppel, 2nd Earl of Albemarle. He joined the Royal Navy in 1785, and saw extensive service during the French Revolutionary and Napoleonic wars, first aboard the frigate Pelican and then on the Impétueux, fighting off the island of St. Lucia in 1794, and later taking part in the Battle of Trafalgar in 1805. By the time of the outbreak of the War of 1812 he was\", \"Matthew Whitworth-Aylmer, 1st Baron Aylmer, GCB (4 November 1775 – 5 January 1856) was a British naval officer and colonial governor who served from 1811 to 1819 as Governor of Newfoundland after commanding several naval vessels over a 30-year career.\n\n\n\nAylmer was born in 1775, the son and heir of Edward Aylmer, a lawyer and judge in Dublin, Ireland. He joined the Royal Navy at a young age and saw action during the latter stages of the French Revolutionary Wars and the Napoleonic Wars. Promoted to lieutenant in 1795 and commander in 1798, he participated in several naval engagements, including the Egypt Expedition in 1801 and led a squadron in operations to suppress piracy in the Aegean Sea in 1811.\n\n\n\nAylmer was made a baronet in 1814 and later in 1823, he was created Baron Aylmer. In 1811, he was appointed Governor of Newfoundland, a position he held until 1819. During his governorship, he continued to serve in the Royal Navy and\", \"Matthew Aylmer, 1st Baron Aylmer, GCB (30 June 1775 – 21 November 1819) was a British naval officer and colonial governor. He was born in London to Admiral Sir George Aylmer and his first wife, Elizabeth Holwell.\n\n\n\nHe entered the Royal Navy at age 13, serving as a volunteer in the Channel Fleet under his father. He was present at the Battle of the Glorious First of June in 1794, witnessing the destruction of three French vessels of the line, and was promoted lieutenant one month later. Aylmer gained his own command in the West Indies after a single year, and was promoted commander in 1798. Following a period of adversity, he was promoted post-captain in 1801 and went on to distinguish himself in many naval engagements of the Napoleonic Wars.\n\n\n\nAylmer was sent as governor to Tasmania in 1808, where he oversaw the founding of the convict settlement of Hobart. After two successful years, he returned to Britain and was given another post as governor of Barbados. He fought two battles against\", \"Matthew Aylmer, 1st Baron Aylmer, was an Anglo-Irish military commander who served in the English Civil War and Portuguese Restoration War, Admiral of the Fleet from 1676 to 1677, and Lord Lieutenant of Ireland from 1677 to 1683. Aylmer was born in Clonmel, County Tipperary, Ireland, in 1620 to a local landowner. He was educated in England, joining the Royal Navy in 1637. He served in the Thirty Years' War and the War of the Spanish Succession in the 1640s and '50s, becoming commander of the Royal Fleet in Ireland in 1649. He led the fleet to victory at the Battle of Dublin Bay in 1649, and was appointed commander-in-chief of the fleet in 1650. He fought in the Third Anglo-Dutch War in 1654, and was knighted for his part in the capture of the Dutch flagship. He was appointed Admiral of the Fleet in 1676, and Lord Lieutenant of Ireland in 1677. He held the title until 1683, when he died in London\", \"Matthew Aylmer, 1st Baron Aylmer, PC (1709–1781) was an Irish-born British naval officer and colonial governor. Born in Dublin, Aylmer entered the navy in 1735, and rose to the rank of vice-admiral in the course of a career that saw him serve numerous times in home waters. He was a skilled administrator and a respected commander, admired for his courage and tenacity. He proved a capable colonial governor in Canada, serving from 1755 to 1760. He sought to reform the government and improve relations with the Indigenous peoples of the region, but he alienated many settlers with his attempts to govern as an autocrat. He resigned in 1760, and in 1761 was created Baron Aylmer of Balrath.\", \"Matthew Aylmer, 1st Baron Aylmer (1708–1794) was an Anglo-Irish admiral and colonel of the Royal Irish Artillery. He was the son of General Matthew Aylmer and Elizabeth Colville, daughter of James Colville of Upper Grange, County Kilkenny. Aylmer joined the Royal Navy in 1720, and from 1738 to 1741, he served as Governor of Newfoundland. He was made Commodore-Governor of Jamaica from 1757 to 1760. He made significant contributions to the Royal Navy, including the introduction of regulations regarding the medical condition of sailors. He commanded the British fleet off Newfoundland in the Seven Years' War, and along with Commodore Augustus Keppel, helped to secure a victory over the French Fleet in the Battle of Quiberon Bay. Aylmer was made a Baron in 1775 and died in 1794.\", \"Matthew Aylmer, 1st Baron Aylmer (1708–1794) was an Irish/British naval commander who served as Commander-in-Chief, North American Station from 1776 to 1778, initially responsible for the Battle of Long Island and later for the reassertion of British control in the Caribbean.\n\n\n\nHe joined the Navy in 1720, rising to become Captain in 1737, and was Commander-in-Chief of the Mediterranean Fleet from 1770 to 1777. He was appointed Vice-Admiral of Great Britain in 1775 and Admiral of the Fleet in 1788. During his years in command of the North American station he was involved in a number of important sea battles during the American War of Independence. In 1777 he was instrumental in ensuring the safe evacuation of the British troops who were defeated at the Battle of Saratoga.\n\n\n\nAfter returning to Britain in 1778, he was appointed Deputy Lieutenant of Kent and served as Lieutenant, Deputy Constable and Governor of the Tower of London from 1779 to 1794. He was made an Irish peer in\", \"Matthew Aylmer, 1st Baron Aylmer (1775–1856) was a British naval officer. Born in Limerick, Ireland, he came from a family with a long maritime tradition. In 1788 Aylmer joined the Royal Navy and rose through the ranks steadily. During the French Revolutionary Wars and the Napoleonic Wars he saw active service, eventually rising to the rank of admiral.\n\n\n\nHe was an able commander, and his most notable successes included the capture of a Spanish frigate in 1800 and destroying a French squadron in the Caribbean in 1803. During the latter action he was promoted to the rank of rear admiral. He was made a baronet in 1808 for his service off the Basque Roads. Between 1808 and 1812 he served as commander-in-chief of the North Sea Station, leading a squadron that captured several Dutch ships in 1810.\n\n\n\nAylmer was promoted to Vice Admiral in 1814 and he was appointed Commander-in-Chief, East Indies and China Station in 1831. He held the post until 1836\", \"Matthew Aylmer, 1st Baron Aylmer (c.1650 – 5 October 1720) was an Irish-born British admiral and colonial administrator who served as Governor of Newfoundland (1717–1720).\n\n\n\nAylmer was the second son of John Aylmer of Ballymacrane, County Kerry, and his wife, Catherine St. John de Berkley. In 1677, he joined the Royal Navy, and served under his uncle, Sir James Shaen, against the French and the Dutch. He was engaged in the battles of Orfordness in 1666, Texel in 1673, and Solebay in 1672.\n\n\n\nIn 1693, he was given command of the 60-gun warship HMS Adventure, and was promoted to rear-admiral in 1702. He was fleet commander of a large fleet sent to Portugal and Spain in 1704, and was promoted to vice-admiral in 1707. Aylmer was promoted to full admiral in 1707, and became Admiral of the Blue in 1708.\", \"Matthew Aylmer, 1st Baron Aylmer (c. 1660 – 1720) was a British Admiral who served under King William III and Queen Anne. He was born in Dublin, Ireland and entered the Royal Navy at an early age, quickly rising through the ranks. Aylmer distinguished himself in the Battle of Beachy Head in 1690, commanding a squadron of ships against the French fleet. He also led an important battle against the Spanish off Cartagena in 1712. During the War of the Spanish Succession, he gained fame for his commanding the Royal Navy against the French forces, particularly at Vigo Bay in 1702. After the war, Aylmer was rewarded with an honorary knighthood by Queen Anne and was made Baron Aylmer in 1708. He served as Commander-in-Chief in the Mediterranean from 1712-1714 and later as Lord Commissioner of the Admiralty from 1714-1720. He died that year and was buried at St James's Church, Piccadilly.\", \"Matthew Aylmer, 1st Baron Aylmer (c. 1650 – 19 April 1720) was an English naval commander and politician who served in two major conflicts of the eighteenth century, the Nine Years' War and the War of the Spanish Succession. He was also a member of the Privy Council from 1718 until his death in 1720.\n\n\n\nAylmer came from an old Devon family and was the eldest son of Admiral Matthew Aylmer and his wife Elizabeth, daughter of Edmund Prideaux of Nutwell in Devon. He served in the Navy from 1666, rising through the ranks until he was made Captain in 1685. This promotion was retrospective to December 1682, retroactive permission having been allowed by King Charles II of England.\n\n\n\nAylmer was present during the Nine Years' War and made several successful raids, particularly on Cadiz in 1696 and Cartagena in 1697. He also served at the Battle of Barfleur on 16 May 1692 and at the Battle of Velez-Malaga on 24 August 1704. He was\", \"Matthew Aylmer, 1st Baron Aylmer (1570–1631) was an English admiral and colonial administrator who served as the Lord High Admiral of England from 1614 to 1619. He was born in London, the son of Thomas Aymer and his wife Elizabeth, the daughter of Sir Thomas Pope of Abingdon. He went to sea at an early age, and entered the service of the English East India Company in 1604. He became a senior official in India, and gained the confidence and patronage of King James I. When the King became monarch of Great Britain in 1603, Aylmer was knighted and appointed as High Admiral and Governor of the English colonies in North America. He held this position from 1614 to 1619 and was responsible for the naval defence of the colony and the administration of justice. Aylmer was proclaimed Lord Aylmer of Balrath in County Meath, Ireland in 1620 and invested with the Order of the Bath in 1625. He died in London in 1631, aged 61.\" ]\n\n\"Rick Mahler (born Richard Alan Mahler on April 18, 1957 in Atlanta, Georgia) was an American professional baseball pitcher who played for the Atlanta Braves, Cincinnati Reds, Montreal Expos, and Minnesota Twins of Major League Baseball (MLB) from 1978 to 1990. He was a two-time All-Star and won the National League (NL) ERA title in 1985. Mahler was drafted by the Braves in the first round of the 1975 amateur draft. He made his major league debut with the Braves in 1978, and was a member of the team's starting rotation for the next five seasons. He was an All-Star in 1983 and 1985, and won the NL ERA title in 1985 with a 2.87 ERA. He was traded to the Reds in 1984, and then to the Expos in 1986. He was traded to the Twins in 1989, and finished his career with them in 1990. Mahler was known for his durability, as he pitched over 200 innings in six consecutive seasons from 1983 to 1988. He finished his career with a record of 119–121, a 3.90 ERA, and 1,07\" \"Richard Keith Mahler (August 5, 1953 in Austin, Texas - March 2, 2005 in Jupiter, Florida) was a starting pitcher in Major League Baseball who played for the Atlanta Braves (1979-1988, 1991), Cincinnati Reds (1989-1990) and Montreal Expos (1991). His brother Mickey was also a Major League pitcher, with the two being teammates in 1979. The two had previously been teammates playing for the Triple-A Richmond Braves. In his 13-year career, Mahler posted a 96-111 record with 952 strikeouts and a 3.99 ERA in 1951.1 innings. Born in Austin, Texas, Mahler graduated from John Jay High School and then attended Trinity University, both in San Antonio, Texas. After being signed by the Braves as an amateur free agent in 1975, he made his debut in the 1979 season. Mahler started on Opening Day for the Braves in 1982, when Atlanta won the National League West title. He made four straight Opening Day starts beginning in 1985. In 1987, he tied an NL record with his third Opening Day shutout. His best season came in 1985, when he went 17-15 with a 3.48 ERA. He pitched twice in the postseason, with the Braves in 1982, and with the 1990 World Series champion Cincinnati Reds. Mahler was a key member of that Reds' pitching staff as a spot starter and reliever, going 7-6 and contributing four saves. He also appeared in ten games with the Montreal Expos in 1991 before returning to Atlanta in mid-season. After retiring, Mahler served as a minor league pitching coach for the Kansas City Royals and the Florida Marlins, and he was a roving instructor for the St. Louis Cardinals. He also managed St. Louis' Double-A affiliate in the Texas League from 1996 to 1997. Mahler died at age 51 of a heart attack at home in Jupiter, Florida, where he was preparing for his second season as a minor league pitching coach for the New York Mets. He was survived by his wife, Sheryl, and five children Ricky, Robby, Timothy, Tyler and Shannon.\" [ \"Rick Mahler (born Richard Alan Mahler on April 18, 1957 in Atlanta, Georgia) was an American professional baseball pitcher who played for the Atlanta Braves, Cincinnati Reds, Montreal Expos, and Minnesota Twins of Major League Baseball (MLB) from 1978 to 1990.\", \"He was a two-time All-Star and won the National League (NL) ERA title in 1985.\", \"Mahler was drafted by the Braves in the first round of the 1975 amateur draft.\", \"He made his major league debut with the Braves in 1978, and was a member of the team's starting rotation for the next five seasons.\", \"He was an All-Star in 1983 and 1985, and won the NL ERA title in 1985 with a 2.87 ERA.\", \"He was traded to the Reds in 1984, and then to the Expos in 1986.\", \"He was traded to the Twins in 1989, and finished his career with them in 1990.\", \"Mahler was known for his durability, as he pitched over 200 innings in six consecutive seasons from 1983 to 1988.\", \"He finished his career with a record of 119–121, a 3.90 ERA, and 1,07\" ] [ \"minor_inaccurate\", \"minor_inaccurate\", \"accurate\", \"minor_inaccurate\", \"minor_inaccurate\", \"minor_inaccurate\", \"major_inaccurate\", \"minor_inaccurate\", \"minor_inaccurate\" ] 20,483 [ \"Rick Mahler (January 8, 1956 – May 25, 2005) was a professional baseball player who pitched for fifteen seasons in Major League Baseball from 1978 to 1992 for seven teams. He was a four-time All-Star, most notably for the Atlanta Braves, with whom he made two National League Championship Series appearances, and the World Series in 1991 alongside fellow starter Tom Glavine.\n\n\n\nMahler was a reliable starter throughout his career and had double-digit win totals eight times, including a career-high 19 victories in 1985. He ultimately retired with a career winning percentage of .535 and an earned run average of 3.99. After his major league career ended, Mahler served briefly as a minor league pitching coach. He died in 2005 at the age of 49.\", \"Rick Mahler (July 23, 1954 – April 25, 2005) was an American professional baseball player. He played in Major League Baseball (MLB) for the Atlanta Braves, Cincinnati Reds, Baltimore Orioles and Philadelphia Phillies.\n\n\n\nMahler was drafted by the Braves in the 28th round of the 1976 amateur draft. He made his major league debut with the Braves on April 15, 1979, at the age of 24. Mahler enjoyed a successful rookie year, going 11–13 with an ERA of 3.24, good enough to be selected as an All-Star in 1979. Mahler was an excellent strikeout pitcher, leading the National League in strikeouts with 187 in 1984, tying the NL record for most strikeouts in a game with 18 in 1985.\n\n\n\nMahler finished his 14-year major league career with 139 wins, 110 losses, and an ERA of 3.86. He was perhaps best remembered for the no-hitter he threw against the San Francisco Giants in 1984, still the only no-hitter in Braves history. His final major league appearance came on September 28, 1992.\n\n\n\nMahler was born in Elkton\", \"Rick Mahler (January 4, 1956 – May 29, 2005) was an American left-handed pitcher in Major League Baseball for twelve seasons from 1979 to 1990. During his career with the Atlanta Braves, Cincinnati Reds, Pittsburgh Pirates, and St. Louis Cardinals, Mahler had a record of 97 wins and 95 losses, an ERA of 3.86 and 1,094 strikeouts. He was an All-Star for the Braves in 1983 and was the runner-up for the National League Cy Young Award in 1983, finishing behind John Denny.\n\n\n\nMahler was drafted by the Braves in the 19th round of the 1975 MLB draft and made his Major League debut four years later, in 1979. He was named to the 1983 All-Star game, and finished 13–15 with a 3.18 ERA that season. The following year, he finished 16–14 with a 3.05 ERA and was second in the National League in complete games (18), second in innings pitched (273.2) and third in strikeouts (167). He won 15 games for the Reds in 1985 and posted a 3.13 ERA, the lowest of his career\", \"Rick Mahler (1959 – 2005) was an American professional baseball pitcher. He played for the Atlanta Braves (1979–85), Cincinnati Reds (1986–87), Montreal Expos (1987–90) and Baltimore Orioles (1991). Mahler was an All-Star in 1983, and fashioned a lifetime record of 111–93 with an ERA of 3.86. He threw a no-hitter on April 15, 1984 against the San Francisco Giants, in which Giants Hall of Fame first baseman Willie McCovey made the final out on a soft line drive to left field.\n\n\n\nMahler was known for his hard sinker that enabled him to induce many ground ball outs. He was an intense competitor and a solid innings-eater, toiling over 300 innings in 1983 and 1984, and leading the National League in games started in 1982, 1983 and 1985.\", \"Rick Mahler (May 17, 1956 – May 28, 2005) was an American professional baseball player. A right-handed pitcher, Mahler made his Major League debut with the Atlanta Braves on April 6, 1979. He also pitched for the Cincinnati Reds (1980–1983), New York Mets (1984–1985), St. Louis Cardinals (1986–1987), and Kansas City Royals (1988). He played in the major leagues for 10 seasons, finishing his career with a record of 147–127 and an ERA of 3.98.\n\n\n\nMahler was a sinkerball pitcher who led the National League in complete games (13) in 1983 and was an All-Star in 1985. He was a reliable innings eater who consistently pitched more than 200 innings a year. He also led the NL in losses in 1981 (17) and in 1987 (17). He retired following the 1988 season due to a nagging arm injury.\", \"Rick Mahler (August 12, 1957 – June 1, 2005) was an American professional baseball pitcher who played in Major League Baseball (MLB) from 1980 through 1995. A right-hander, Mahler played for the Atlanta Braves, Cincinnati Reds, Montreal Expos, New York Yankees and Philadelphia Phillies. He is best remembered for his stint with the Braves in the 1980s, where he went 82–63 with a 3.54 ERA for the team from 1982–88 and won 18 games for the 1983 National League champions. He was also a member of the 1982 Braves team that made the organization's first World Series appearance since 1957.\n\n\n\nMahler was known for his fierce competitiveness and being very hard on himself. He also had a sense of humor, according to teammate Dale Murphy, and was known to play practical jokes on his teammates. After leaving the Braves in 1989, Mahler continued to pitch for several more seasons in the major leagues. He finished his career with an overall record of 126–90 in 16 seasons. He died of a heart attack at the age of 47 in 2005.\", \"Rick Mahler (September 13, 1956 – April 14, 2005) was a Major League Baseball pitcher who played for the Atlanta Braves (1978–1987), Cincinnati Reds (1988–1991), Pittsburgh Pirates (1992) and St. Louis Cardinals (1992–1994).\n\n\n\nMahler was selected by the Braves in the 8th round of the 1977 amateur draft. On August 3, 1979, Mahler pitched a no-hitter against the San Francisco Giants at Atlanta–Fulton County Stadium. Mahler led the National League in wins in 1983 with 20, the first of his three straight 20-win seasons.\n\n\n\nIn all, Mahler pitched in 364 games, with a 108–87 win-loss record. He won 20 games three times (1983, 1984 and 1986), and struck out 1,228 in 1,868 innings pitched, finishing with a 3.91 earned-run-average. His best run came in 1983, when he posted a career-best 2.60 ERA and earned a trip to the All-Star Game.\", \"Rick Mahler (February 22, 1957 – April 13, 2005) was an American Major League Baseball pitcher who played for the Atlanta Braves (1981–87) and the Cincinnati Reds (1988–91) and then the Atlanta Braves again (1991–93). He was a right-handed starting pitcher in the National League East division who enjoyed a 13-year career in the majors. He was a 1984 All-Star and known as an \\\"inning-eater\\\" and was a respected teammate. On April 13, 2005, at the age of 48, he died of a heart attack at his home in Lakeland, Georgia. He is buried in his hometown of Griffin, Georgia.\n\n\n\nMahler was signed by the Braves as a free agent in 1978, and made his major league debut on June 6, 1981. Throughout his first season, he bounced back and forth between the Braves and their minor league affiliates. Although he managed only an 8-11 record with a 5.14 ERA in his first real season in 1982, by 1983, he had cemented his place in the Braves starting rotation, posting an impressive 14-10 record with a\", \"Rick Mahler (August 8, 1957 – March 18, 2005) was a Major League Baseball pitcher who played for the Atlanta Braves (1978–1986), Cincinnati Reds (1986–1988), Montreal Expos (1988–1989), and Philadelphia Phillies (1990). He is most famous for throwing a no-hitter on August 23, 1984, against San Diego Padres. He was an All-Star in 1985 after going 17–10 with a 3.62 ERA and 155 strikeouts. Despite this outstanding season, his record was just 10–20 in 1986. At the end of the season, he was traded to the Reds. He spent two years in Cincinnati and then left as a free agent to join the Montreal Expos in 1988. He pitched in Montreal for just two seasons before finishing his career with the Phillies in 1990.\n\n\n\nMahler was a workhorse, leading the National League with 261⅓ innings in 1985 and 311 innings in 1986. He had 2,764⅔ innings pitched in his 12-year career, finished with an overall record of 125– 113, and a 3.99 ERA. He was also a\", \"Rick Mahler (born March 11, 1956) was a right-handed pitcher in Major League Baseball who played for the Atlanta Braves (1977–86), Cincinnati Reds (1986–87) and Montreal Expos (1988–89).\n\n\n\nMahler debuted with the Braves in 1977. He made his only appearance of the season in the second game of a doubleheader against the Houston Astros, entering in the fourth inning and earning the win in a 16–3 Braves rout. In 1978, he won 15 games and led the league with six complete games, among them a one-hitter against the St. Louis Cardinals at Atlanta–Fulton County Stadium on June 28. He became an immediate starter in the Braves rotation, usually slotting in after Phil Niekro and before Phil Niekro, Jr. In 1980 he was selected to the National League All-Star Team, by Ted Turner to replace pitcher Niekro, who had already pitched. Mahler finished sixth in the NL Cy Young Award Balloting after his season in 1983, when he posted a 19–15 record (career-highs in victories, innings and\", \"Rick Mahler (July 29, 1957 – April 13, 2005) was an American professional baseball pitcher who played 15 seasons in Major League Baseball (MLB). He pitched most of his career for the Atlanta Braves and Cincinnati Reds. From 1982 to 1995, he pitched in nine All-Star Games and won three National League (NL) ERA titles to go along with four 20-win seasons.\n\n\n\nMahler's best season was probably in 1985, when he was 20–14 and led the NL with a 2.97 ERA and 4 shutouts, finishing 4th in Cy Young Award voting. He won the Silver Slugger Award for pitchers, batting .308 for the season. He also had two 17-win seasons and the only no-hitter of the 1988 season.\n\n\n\nMahler spent his later years bouncing from team to team, going from Atlanta to the Montreal Expos, and then back to the Braves for one year. He then moved to the Cincinnati Reds for two seasons before retiring in 1995. He returned to the Braves organization to serve as a minor league pitching instructor after being out of baseball for a few years. On April 13\", \"Rick Mahler (January 10, 1957 – April 9, 2005) was an American professional baseball player. He pitched in Major League Baseball (MLB) from 1978 to 1995. He was a two-time All-Star in 1986 and 1987.\n\n\n\nMahler was born in Dayton, Ohio, the son of Alvin and Rose Mahler. He attended Middletown High School, where he was a standout, and went on to attend the University of Miami on a baseball scholarship. After his college career ended, he was drafted in the first round (14th overall) of the 1978 Major League Baseball Draft by the Atlanta Braves.\n\n\n\nMahler made his major league debut with the Braves in 1978 and played six seasons with the Braves until being traded to the Cincinnati Reds in 1984. With the Reds, Mahler developed into a pitcher who both started and relieved. He was a National League All-Star in 1986 and 1987, both times with Atlanta, when he followed up a strong 1985 campaign. After 1988, he was traded to the New York Mets and then the Seattle Mariners, but he had the most success with the Reds, posting his lowest earned\", \"Rick Mahler (November 23, 1958 – March 3, 2005) was an American professional baseball pitcher. He played for 15 seasons in Major League Baseball (MLB) from 1979 to 1993, mainly for the Atlanta Braves. He was the National League Rookie of the Year in 1984, an All-Star in 1985, and ended his career with the most wins in Braves franchise history with 162.\n\n\n\nIn 1979, Mahler was drafted by the Braves in the 4th round of the amateur draft and made his debut with the team in 1980. After four seasons in the minors, including a 1981 campaign in which he went 15-2 with a 1.53 earned run average (ERA), he returned to the major leagues and was named National League Rookie of the Year in 1984 after going 12-11 with a 3.53 ERA.\n\n\n\nThe following season, his breakout year, he went 15-14 with a 3.04 ERA and was selected to the National League All-Star team. He would go on to post double-digit wins six more times in his career. He retired after the 1993 season with a career record of 162-176 and a\", \"Rick Mahler (November 18, 1956 – March 11, 2005) was an American professional baseball pitcher who played 12 seasons in Major League Baseball (MLB) from 1978 to 1989. A right-hander, he played for the Atlanta Braves and Cincinnati Reds. Mahler's best season was in 1983, when he was an All-Star and the Braves' top pitcher, leading the National League in wins and innings pitched. He also had the best season of his career in 1984, when he finished second in National League Cy Young Award voting and, for the first time, surpassed 200 innings pitched.\n\n\n\nMahler was also notable for his durability; he completed all of his 198 starts, an impressive feat that has only been matched by a handful of other pitchers during the modern era. He was known for having an outstanding curveball, a decent slider, and a deceptive delivery. Throughout his career, Mahler won 99 games, and he achieved a 3.80 ERA in 2,323 innings pitched.\", \"Rick Mahler (June 18, 1957 – February 4, 2005) was an American former Major League Baseball (MLB) starting pitcher who pitched in the National League primarily for the Atlanta Braves and Cincinnati Reds from 1979 to 1991. Mahler compiled a lifetime record of 139 wins, 119 losses, and an ERA of 3.83. He was an All-Star in 1985. His career highlight was pitching a no-hitter against San Francisco on August 14, 1989.\n\n\n\nMahler was born in Nashville, Tennessee, and pitched at the University of Tennessee. He was drafted in 1977 in the second round of the amateur draft by the Washington Senators. After two partial seasons with the Senators' minor league teams, the Braves acquired him in the 1979 Rule 5 Draft. Mahler was an All-Star in 1985 with the Braves when he tied the team record with a 16-game win streak, recorded a 16–7 record, and threw two shutouts. He also was the National League leader in strikeouts and innings pitched that year. Mahler was traded to the Reds during the 1989 season. He threw the only no-hitter in Reds history during\", \"Rick Mahler (February 1, 1957 – April 14, 2005) was an American professional baseball pitcher. He pitched in Major League Baseball (MLB) from 1978 to 1997, most notably as a member of the Atlanta Braves, with whom he played a major role in the 1982 playoffs and World Series, and the Cincinnati Reds, with whom he won 20 games and the ERA title in 1985, as well as the Montreal Expos. He also played for the St. Louis Cardinals and the Baltimore Orioles.\n\n\n\nMahler accumulated a career win–loss record of 144–128 and an earned run average (ERA) of 3.90. He pitched 2,505 innings and completed 135 games, with 45 complete game shutouts. He was an All-Star in 1985 and won two career Gold Glove Awards.\", \"Rick Mahler (December 9, 1957 – February 1, 2005) was an American Major League Baseball pitcher who spent 12 seasons with the Atlanta Braves, Cincinnati Reds, St. Louis Cardinals and Philadelphia Phillies, from 1978 through 1989.\n\n\n\nMahler was the undisputed \\\"ace\\\" of the Braves' 1983 World Series team. He was selected to the 1985 NL All-Star team, although he did not play due to injury. Mahler's final major league appearance was with the Phillies in 1989.\n\n\n\nMahler's career record was 111–92; he had an impressive strikeout/walk ratio, with 1,053 strikeouts to only 533 walks, and he pitched 18 shutouts over his career. He also led the NL in wins in 1985, with 20. Despite being on teams that were usually below .500, Mahler himself was a superb pitcher and enjoyed a measure of success. Mahler died in 2005 of esophageal cancer.\", \"Rick Mahler (May 24, 1957 – June 1, 2005) was an American professional baseball pitcher. He played twelve seasons in Major League Baseball for the Atlanta Braves (1980–1988), Cincinnati Reds (1989–1991), Montreal Expos (1992), and Baltimore Orioles (1993–1991).\n\n\n\nMahler was considered to be a workhorse, leading his team in innings pitched four times and making 24 or more starts every year after 1982, except in 1993 when he was sidelined with an injury. He also pitched a grand slam in the 1985 MLB All-Star Game. He pitched a no-hitter against the San Francisco Giants on August13, 1983. During his career, Mahler compiled 100 wins, 898 strikeouts and a 4.14 earned run average.\n\n\n\nMahler was a two-time National League All-Star (1983, 1985) and a five-time NL wins leader (1982–1985, 1988). His number 31 was retired from the Atlanta Braves in 1990. Mahler died on June 1, 2005, in Atlanta, Georgia, of complications from a ruptured abdominal aortic aneurysm.\", \"Rick Mahler (June 25, 1955 – May 29, 2005) was an American professional baseball pitcher. He pitched for the Atlanta Braves (1975–83, 1985–86), Cincinnati Reds (1984), and St. Louis Cardinals (1987).\n\n\n\nMahler pitched a no-hitter on August 14, 1979, against the San Francisco Giants. He had to overcome a bases-loaded, no-outs jam to do so, allowing two runs to score due to two sacrifice flys.\n\n\n\nIn 1981, Mahler posted a career-best 15-14 record, and in 1983 he reached career highs in games (42) and innings (254.1). He separated his shoulder in October 1984 while pitching for the Reds, and although he returned with the Braves in 1985, it was not at the same level. He finished his career with the Cardinals in 1987.\", \"Richard Edward Mahler, born May 1, 1951, was a Major League Baseball starting pitcher. Mahler played 12 seasons in the major leagues, with the St. Louis Cardinals (1975–1979), Baltimore Orioles (1980–1984), Atlanta Braves (1985–1988), and Cincinnati Reds (1988–1989).\n\n\n\nMahler's best season in the majors was arguably 1985 with the Atlanta Braves, when he posted an 18–15 record with a 3.59 ERA and 137 strikeouts. In 1986, he recorded an 11–12 record with a 3.92 ERA. Mahler spent the remainder of the 1988 season, and his final Major League campaign, with the Cincinnati Reds, for whom he put up a 9–8 record in 25 starts.\n\n\n\nMahler had a career record of 127–144 in 430 games (410 starts). He had an ERA of 3.99, 1,635 strikeouts, 942 walks and 18 shutouts. He pitched three complete game one-hitters in his career, two against the Pittsburgh Pirates in 1976 and one against the San Francisco Giants in 1985.\" ]\n\n\"James Blair (1732–1782) was an American lawyer and politician from South Carolina. He was a delegate to the Continental Congress from 1774 to 1776 and a signer of the Declaration of Independence. Blair was born in 1732 in Williamsburg, Virginia. He was educated at the College of William and Mary and studied law in England. He was admitted to the bar in 1760 and began practicing law in South Carolina. In 1774, Blair was elected to the Continental Congress, where he served until 1776. He was a signer of the Declaration of Independence and was a member of the committee that drafted the Articles of Confederation. After the Revolutionary War, Blair returned to South Carolina and served in the state legislature. He died in 1782 in Charleston, South Carolina.\" \"James Blair (September 26, 1786 - April 1, 1834) was a United States Representative from South Carolina. He was born in the Waxhaw Settlement, Lancaster County, South Carolina to Sarah Douglass and William Blair. He engaged in planting and was also the Sheriff of Lancaster District. Blair was elected as a Democratic-Republican to the Seventeenth Congress and served from March 4, 1821, to May 8, 1822, when he resigned. He was elected as a Jacksonian to the Twenty-First through Twenty-Third Congresses and served from March 4, 1829, until his death in Washington, D.C. on April 1, 1834. Under date of December 24, 1833, John Quincy Adams records in his diary that Blair \"had knocked down and very severely beaten Duff Green, editor of the 'Telegraph'...\" (\"Diary\" - New York, Longmans, Green, 1929 - p. 434). He paid \"three hundred dollars fine for beating and breaking the bones\" of Green (op. cit., p. 450). Under date of April 2, 1834, John Quincy Adams records in his diary that Blair \"shot himself last evening at his lodgings...after reading part of an affectionate letter from his wife, to Governor Murphy, of Alabama who was alone in the chamber with him, and a fellow-lodger at the same house\" (op. cit. p. 434). He was buried in Congressional Cemetery; his tombstone inscription includes his command as General of the South Carolina 5th Militia Brigade.\" [ \"James Blair (1732–1782) was an American lawyer and politician from South Carolina.\", \"He was a delegate to the Continental Congress from 1774 to 1776 and a signer of the Declaration of Independence.\", \"Blair was born in 1732 in Williamsburg, Virginia.\", \"He was educated at the College of William and Mary and studied law in England.\", \"He was admitted to the bar in 1760 and began practicing law in South Carolina.\", \"In 1774, Blair was elected to the Continental Congress, where he served until 1776.\", \"He was a signer of the Declaration of Independence and was a member of the committee that drafted the Articles of Confederation.\", \"After the Revolutionary War, Blair returned to South Carolina and served in the state legislature.\", \"He died in 1782 in Charleston, South Carolina.\" ] [ \"minor_inaccurate\", \"major_inaccurate\", \"major_inaccurate\", \"major_inaccurate\", \"major_inaccurate\", \"major_inaccurate\", \"major_inaccurate\", \"major_inaccurate\", \"major_inaccurate\" ] 71,174 [ \"James Blair (April 2, 1755 – March 8, 1842) was a planter and political leader in South Carolina during the American Revolution and the first decade of statehood. Blair served in the South Carolina General Assembly, including as Speaker of its House of Commons. He was a general in the state militia and chaired two constitutional conventions. In 1787 he was elected 47th in the Electoral College voting for the vice president of the United States under George Washington; he did not serve in the office since its duties were assigned to the President of the Senate.\n\n\n\nBlair was born in Scotland and immigrated to South Carolina with his family as a young boy. In South Carolina he found success as a planter, amassing a large estate near the Ogeechee River in what is now Bulloch County. In 1776 he was elected as a delegate to the Third Provincial Congress, one of numerous legislatures convened during the American Revolution to help govern South Carolina. He was elected to the South Carolina General Assembly from 1780 to 1791, serving as Speaker in the House of Commons from 17\", \"James Blair (1741–1777) was an American politician who served in the South Carolina General Assembly, briefly serving as its speaker. He is best known for his service during the American Revolutionary War, leading South Carolina troops in the pivotal Battle of Camden.\n\n\n\nBlair was born in Camden, South Carolina, to Scottish immigrant parents. He studied law and was admitted to the bar in 1764, practicing in Orangeburg and Beaufort. He was elected to the South Carolina Provincial Congress in 1775, representing St. James-Santee in Berkeley County. When the South Carolina General Assembly convened in 1776, he was elected as its speaker, a post which he held until October of that year.\n\n\n\nIn 1776, Blair was commissioned as a colonel in the South Carolina militia and led militia troops in the Battle of Camden in August 1780. His stubborn defense of the post allowed British General Cornwallis to pass safely. He was severely wounded in the battle and died in 1777. He was buried in Camden.\", \"James Blair (c. 1741–1802) was an early American statesman who represented South Carolina in both houses of the United States Congress. Blair was born near Williamsburg, Virginia and was educated in England. He relocated to South Carolina, where he became a successful planter and lawyer. He was elected to the legislature in 1774, and through force of his own ability he quickly rose to positions of influence within the government. He was elected to the Continental Congress in 1780 and represented South Carolina until 1783.\n\n\n\nAfter his service in the Continental Congress, Blair continued to serve South Carolina in various elected offices. He was a member of the Constitutional Convention of 1790 and was elected as a representative of South Carolina to both houses of the United States Congress. He was elected to the United States House of Representatives in 1794 and elected to the United States Senate in 1798, where he was one of the original members of the Democratic-Republican Party. He served in the Senate until his death in 1802.\", \"James Blair (1772–1819) was an American planter, politician and soldier who served in the South Carolina militia during the War of 1812.\n\n\n\nBorn in 1772 in Fair Forest, South Carolina, James Blair was the son of Revolutionary War veteran James Blair and Mary Woodson. He inherited property from his father, which included slaves and a ferry business along the Tyger River in what became Spartanburg County.\n\n\n\nBlair held a number of judicial and political offices in his lifetime. In 1801, he was appointed to the South Carolina Senate, where he represented Spartanburg and Union counties until 1804. He later served as a judge in the circuit court system and was an associate justice with the South Carolina Supreme Court from 1809 to 1819.\n\n\n\nBlair was a prominent private soldier during the War of 1812. He commanded a company of the 2nd Regiment of the South Carolina militia that participated in the defense of Fort Motte. Blair and his men were the first to enter the fort after it was abandoned by the British. Blair and his troops also fought\", \"James Blair (c.1753–1819) was an American lawyer and politician from South Carolina. A member of the Democratic-Republican political party, he served in the South Carolina House of Representatives and the South Carolina General Assembly before becoming a justice for the South Carolina Supreme Court in 1804. He also served as Lieutenant Governor of South Carolina from 1804 to 1808 and Chief Justice of the South Carolina Supreme court from 1810 to 1819. Blair was known for defending the interests of citizens and was an advocate for improving public education in South Carolina. He was a proponent of a more equitable judicial system, arguing for greater protections for those accused of crimes.\", \"James Blair (1732–1782) was an American planter, politician, and soldier from South Carolina during the American Revolutionary War. He was elected as a delegate to the Continental Congress from 1774 to 1778 and was the first Speaker of the South Carolina House of Representatives in 1776. He later served in the Continental Army as a Brigadier General of the South Carolina militia and was a member of the South Carolina Provincial Congress which governed South Carolina during the war.\n\n\n\nDuring the war, he was instrumental in raising and organizing several important militia Regiments which included the 2nd and 6th South Carolina regiments. He helped to repel an attack by Tory forces at the Battle of Rocky Mount in 1780. In 1781, he commanded an unsuccessful attack against the British forces at James Island.\n\n\n\nHe died in 1782 of wounds received during an assault on the British at Ninety-Six in South Carolina. He is remembered as a hero of the Revolutionary War for his patriotism and bravery.\", \"James Blair (November 4, 1732 – August 18, 1800) was a colonial American lawyer, soldier and statesman from Charleston, South Carolina. He served in the colonial assembly of South Carolina from 1756 to 1775 and from 1776 to 1780, and was the last president of the colonial assembly. He served as a Captain in the South Carolina militia and as a Major in the military forces of the Continental Congress during the Revolutionary War. He was a delegate to the Continental Congress from 1775 to 1776, a justice of the peace for Charleston in 1776, secretary of state for South Carolina from 1776 to 1778 and a delegate to the South Carolina Constitution Convention in 1778. He was also a trustee of the College of Charleston from 1773 to 1800.\", \"James Blair (1710 – 1776) was an American Revolution patriot, statesman, and planter from South Carolina. Blair was born in either Scotland or St. Kitts in 1710. He served as a member of the provincial Congress of South Carolina and was a signatory of their independence declaration. He managed various plantations in what was then the Province of South Carolina, and some sources state he was the wealthiest man in Carolina at the time. He served in the Council of Safety in 1775, and was elected to the 1st and 2nd Continental Congresses. He also served as a South Carolina legislator. In 1776, he was appointed by Charles Pinckney, the President of South Carolina, to the Board of War and Ordnance. He died later that same year.\", \"James Blair (1732–1800) was an American planter, soldier, and politician from South Carolina. Blair was born in the Province of South Carolina in the parish of St. James, Goose Creek and spent his early life as a planter.\n\n\n\nDuring the American Revolution, Blair served with distinction in the militia forces of South Carolina, where he helped defeat Lord Cornwallis at the Battle of Camden. He was also an active politician, serving as a member of the South Carolina House of Representatives from 1778 to 1779, and was later appointed as a commissioner of confiscated property in 1783.\n\n\n\nBlair died in Charleston, South Carolina in April 1800, and is buried in the Presbyterian Churchyard in that city.\", \"James Blair (1759 – 1836) was a planter from South Carolina. He was born in 1759 to JamesJr and Margaret Blair and moved to Sumter County, South Carolina, with his family around 1775.\n\n\n\nBlair served in the American Revolutionary War, fighting in the Battle of Fishdam Ford under the command of Thomas Sumter. Afterwards, he was elected Captain of the sumter militia. In 1785, he served as a delegate to the state legislature from Sumter County, and in 1789 he was elected as a delegate to the state constitutional convention.\n\n\n\nBlair was a proponent of slavery and a strong defender of the right of states' rights. He was a vocal critic of the Union and the federal government's growing power. He strongly advocated for the state's right to nullify federal laws. He also served as a leader of the congregation of the Anglican Church in Sumter County.\n\n\n\nBlair died in 1836 and is buried on a plantation in Sumter that he owned. His will funded the establishment of a school in his hometown of\", \"James Blair (1742-1795) was a prominent early American lawyer and political leader from South Carolina. Born in Charleston, he was a delegate to the Continental Congress from 1777 to 1779 and to the 1787 Constitutional Convention.\n\n\n\nBlair, who was trained in law, worked as a lawyer while actively involved in provincial politics. He was appointed as the provincial attorney general, and went on to become a member of the state Senate and dominated the state's politics during the last years of the American Revolution. He became the leader of a majority in the state Assembly, controlling the legislature and assisting in drafting the 1778 state constitution.\n\n\n\nBlair maintained a loyalist tilt during and after the Revolution and he was arrested in 1779 and accused of using his influence to prevent the passage of the Continental Association by the South Carolina legislature. After his capture, he was released from prison and retired from public life, dying in 1795. His lasting contribution was assurance of civil liberties to South Carolina citizens.\", \"James Blair (1749–1820) was a prominent South Carolina politician of the Revolutionary War and post-war period. He served as the 32nd Governor of South Carolina from 1792 to 1794. Born in Allentown, New Jersey in 1749 and educated in the colonial colleges of New Jersey, he studied law and was admitted to the Bar in Philadelphia, Pennsylvania. In 1774, he moved to South Carolina and opened a law practice in Charleston. He soon became active in politics and was elected to the South Carolina Provincial Congress in 1775. As a member of this congress, he was integral in organizing the Loyalist military resistance. He was later appointed to the South Carolina Council of Safety, which administered powers of the state militia.\n\n\n\nIn 1783, he was a member of the South Carolina House of Representatives, and in 1786 became a member of the Confederation Congress, representing the state of South Carolina until 1788. He was appointed Attorney General of South Carolina in 1791. In 1792, he was elected 32nd Governor of South Carolina, a post he held until 17\", \"James Blair (died April 1825) was an American planter from South Carolina. He was the first owner of the historic historic Blair Hall Plantation in Beaufort County, South Carolina which today is the Historic Blair House Inn, listed on the National Register of Historic Places. Blair was the daughter of John and Mary Smith Blair, formerly British citizens, who emigrated to America in 1765 and established their first home in St. Mary's County, Maryland.\n\n\n\nBlair was born in Charleston or in nearby St. Stephen's Parish, South Carolina. He is recorded as having owned property in both Beaufort and Charleston counties, South Carolina. In 1803, Blair was living in Beaufort County and bought the property that would become Blair Hall Plantation from Sunbury Turnbo and his wife, Jane. This property is located on the Colleton River and today is part of the Historic Beaufort-Jasper County border.\n\n\n\nBlair built the house that stands today at the center of the Historic Blair House Inn, adjacent to what is known as the Carolina Garden. Decades later\", \"James Blair (1762–1843) was a South Carolina planter, politician, and soldier who fought in the American Revolutionary War. Blair was born in Ninety Six District, one of nine children of Scots-Irish immigrants James Blair and Elizabeth McLendon Blair. He married Elizabeth Catherine Geiger and had six children.\n\n\n\nBlair was a captain, major, and lieutenant colonel in the Revolution. He served in the Partisan Rangers of Sumter and helped organize local militia in South Carolina. Blair was a lieutenant colonel under Francis Marion in the Battle of Eutaw Springs, where he was wounded.\n\n\n\nHe represented South Carolina in the Continental Congress from May 1792 until March 1793 and in the 10th United States Congress from 1797 to 1799. He was active in the state legislature beginning in 1786 and helped pass legislation ending importation of slaves, a right he did not share with other planters. He was a major general in the South Carolina Militia in the War of 1812.\n\n\n\nBlair is buried in the cemetery of his former home, the\", \"James Blair (c. 1732–1778) was a patriot from South Carolina who fought in the American Revolutionary War. He served in the Southern Department of the Continental Army, where he achieved the rank of Lieutenant Colonel. In 1775, Blair joined the South Carolina Provincial Congress, and served as an active member until 1777. During the American Revolution, Blair organized the Spartanburg militia and commanded his troops at the Battle of Musgrove Mill. He was also an active player in many campaigns under the overall command of General Nathaniel Greene in the Southern Department. Blair died in 1778, a few short weeks after the victory of General Greene's at the Battle of Eutaw Springs.\", \"James Blair (1732–1780) was an American Revolutionary War soldier from South Carolina.He fought in several engagements as a private in the militia of his home state and served in the South Carolina General Assembly. He was a member of the Craven County Regulators, a band of Patriot militia that opposed the Loyalist faction in southeastern North Carolina. Blair was the leader of the Patriots and was involved in the Battle of Elizabethtown in 1781 in which the Patriot militia defeated the Loyalists.\n\n\n\nBlair was a tavern-keeper, magistrate and business partner with General Francis Marion. He served in the South Carolina General Assembly as a state senator from Craven County and was part of committees that provided supplies and ammunition to the Patriot militia. He was instrumental in supplying and covering the retreat of General Nathaniel Greene in his campaign against the Loyalists in South Carolina and Georgia.\n\n\n\nIn August 1780, Blair was wounded while retreating from a Loyalist force near Georgetown, South Carolina. His wound was so severe that it put him out of active military service; however, he still was involved in the Patriot\", \"James Blair (1738–1818) was an American revolutionary war leader, politician, lawyer, and judge. Born in 1738, he was a successful lawyer and planter in the British province of South Carolina. During the American Revolutionary War, he served on the patriot side as a major general in the South Carolina militia. In 1778, he was elected as a delegate to the Continental Congress, where he remained until 1780, when he joined the South Carolina General Assembly , where he was elected president. He subsequently served as both a state and federal judge, and oversaw several constitutional conventions that resulted in the modern government of South Carolina. In 1808, he helped found and name the College of Charleston. Blair continued as president of the College of Charleston until his death in 1818.\", \"James Blair (1720 – 1803) was an early American planter, lawyer, and politician from South Carolina. He was a member of the colonial Grand Council and the South Carolina Provincial Congress during the American Revolution. He was a signer of the Articles of Confederation.\n\n\n\nBlair was born near present-day Anderson, South Carolina, sometime before 1720. He was the son of James Blair and Mary Ann Hammond. His father was a planter who had immigrated to South Carolina from Scotland and held extensive lands there.\n\n\n\nDuring the American Revolution, Blair joined the cause without hesitation. As a member of the rebel Provincial Congress, he was sent to the Continental Congress in Philadelphia in 1777. In Congress, he was active in debates and committees on economic and military issues. He signed the Articles of Confederation, being one of nine members from South Carolina to do so. After the settlement of the war, he withdrew from public life.\n\n\n\nBlair died sometime before 1803. He never married and had no heir to his estate. He left it to Philippa Hammond, thought\", \"James Blair (1731–1800) of South Carolina was an American statesman, lawyer and planter. He was a member of the Continental Congress, a signer of the Declaration of Independence and founder of the College of William and Mary.\n\n\n\nBlair was born in the St. Paul's Parish of South Carolina in 1731 and graduated from the College of New Jersey in 1756. He studied law under his father and from 1765 served as a magistrate in South Carolina. He was chosen in 1774 to represent South Carolina in the Continental Congress and, in 1776, signed the Declaration of Independence. In 1779, after the British had invaded South Carolina, Blair retired from the Continental Congress and returned to South Carolina to serve as a state legislator.\n\n\n\nIn 1779, the College Board of Visitors, of which Blair was a member, appointed the Reverend James Madison as the college's first president and in 1780 the first classes met at Williamsburg. Blair contributed to the college financially, resulting in the construction of the Blair Mansion before his death in 1800.\", \"James Blair (1766–1833) was a South Carolina politician and plantation owner. He is best known for his involvement in the Nullification Crisis of 1832.\n\n\n\nBlair was born into a wealthy planter family in South Carolina in 1766. He was educated at Eton College in England and at the University of Leyden in the Dutch Republic. Upon returning to South Carolina, he became a leading figure in the plantation economy, owning many slaves and several large plantations.\n\n\n\nBlair was also a prominent politician. He served as a member of the South Carolina assembly from 1790 to 1794, and was appointed lieutenant colonel of the South Carolina militia. During the War of 1812, Blair served as a colonel of the choctaw cavalry unit, and was wounded at the Battle of Eutaw Springs.\n\n\n\nIn 1832, Blair was a leader in South Carolina's resistance to the Union's tariffs and an advocate for nullification. He was a delegate to the Nullification Convention, where he served as chairman of the Committee of Propriety and was a signer of\" ]\n\n\"Tim Finchem (born August 24, 1947) is an American businessman and former Commissioner of the PGA Tour. He served as Commissioner from 1994 to 2016. Finchem was born in Washington, D.C., and grew up in Bethesda, Maryland. He graduated from the University of Maryland in 1969 with a degree in business administration. He then attended the University of Virginia School of Law, where he earned his Juris Doctor degree in 1972. Finchem began his career in the golf industry in 1975, when he joined the PGA Tour as its first full-time legal counsel. He was promoted to Deputy Commissioner in 1988 and Commissioner in 1994. During his tenure, the PGA Tour grew from a domestic tour to an international tour, with events in more than 30 countries. He also oversaw the introduction of the FedEx Cup, a season-long points competition that culminates in a four-tournament playoff. Finchem retired as Commissioner in 2016 and was succeeded by Jay Monahan. He was inducted into the World Golf Hall of Fame in 2017.\" \"Timothy W. Finchem (born April 19, 1947) is the current Commissioner of Golf's PGA Tour. Finchem was born in Ottawa, Illinois. He took the position on June 1, 1994, succeeding Deane Beman, who retired after nearly 20 years in the post. Finchem had previously served as Vice President of Business Affairs, Deputy Commissioner, and Chief Operating Officer of the Tour. Finchem graduated from Princess Anne High School in Virginia Beach, Virginia. He attended the University of Richmond on a debate scholarship, receiving his Bachelor of Arts degree in 1969. He graduated from the University of Virginia School of Law in 1973. After practicing law in Virginia Beach for three years, Finchem served in the White House during the administration of Jimmy Carter as Deputy Advisor to the President in the Office of Economic Affairs in 1978 and 1979. In the early 1980s, Finchem co-founded the National Marketing and Strategies Group in Washington, D.C. As Commissioner, Finchem has greatly expanded the earnings opportunities for PGA Tour players both domestically and internationally. He has presided over the last three television broadcasting deals (1997, 2001 and 2005) and has maximized the earnings potential of the Tour, and perhaps none was as bold as the most recent deal that excludes ABC and ESPN and challenges the Golf Channel to get better. In 2006, the total PGA Tour purse was $256.8 million, up from $56.4 million in 1994. That remarkable growth has a lot to do with Tiger Woods, but Finchem's supporters also give him some of the credit. Finchem received the 2001 Old Tom Morris Award from the Golf Course Superintendents Association of America, GCSAA's highest honor. He is a single-figure handicap golfer.\" [ \"Tim Finchem (born August 24, 1947) is an American businessman and former Commissioner of the PGA Tour.\", \"He served as Commissioner from 1994 to 2016.\", \"Finchem was born in Washington, D.C., and grew up in Bethesda, Maryland.\", \"He graduated from the University of Maryland in 1969 with a degree in business administration.\", \"He then attended the University of Virginia School of Law, where he earned his Juris Doctor degree in 1972.\", \"Finchem began his career in the golf industry in 1975, when he joined the PGA Tour as its first full-time legal counsel.\", \"He was promoted to Deputy Commissioner in 1988 and Commissioner in 1994.\", \"During his tenure, the PGA Tour grew from a domestic tour to an international tour, with events in more than 30 countries.\", \"He also oversaw the introduction of the FedEx Cup, a season-long points competition that culminates in a four-tournament playoff.\", \"Finchem retired as Commissioner in 2016 and was succeeded by Jay Monahan.\", \"He was inducted into the World Golf Hall of Fame in 2017.\" ] [ \"minor_inaccurate\", \"accurate\", \"major_inaccurate\", \"minor_inaccurate\", \"minor_inaccurate\", \"major_inaccurate\", \"accurate\", \"minor_inaccurate\", \"accurate\", \"accurate\", \"major_inaccurate\" ] 39,945 [ \"\\\"Tim Finchem (born May 27, 1953) is an American businessman and the Commissioner of the Professional Golfers' Association of America (PGA) since 1994. He was born in San Diego, California and graduated from the University of Virginia in 1975, with a degree in sociology.\n\n\n\nFinchem worked for Pat Summerall Productions from 1976–78 and Electronic Arts from 1979–90. He has been with the PGA since 1990, first holding the title of Senior Vice President of Tour Administration, and then taking on the role as Commissioner in 1994.\n\n\n\nAs Commissioner, Finchem has overseen the emergence of golf as a global sport, giving it unprecedented commercial success. He has been responsible for ensuring the health of the PGA's professional players and growing the overall game of golf through a variety of marketing deals, television contracts, and the development of new formats such as the FedEx Cup. He also helped open golf to women, providing an opportunity for members of the LPGA. In 2014, Finchem signed a 10-year extension with the PGA to stay as commissioner until 2021.\\\"\", \"Tim Finchem (born December 31, 1945) is an American business executive and the former Commissioner of the PGA Tour. He served as Commissioner of the PGA Tour since 1994 until his retirement on June 1, 2017. As Commissioner, Finchem was responsible for the day-to-day operations and long-term growth of the organization. He implemented the FedEx Cup playoff system, expanded the PGA Tour’s reach outside the U.S., and oversaw one of the most successful periods in the organization’s history. During his tenure, prize money increased by more than 500%, sponsorships increased seven-fold and TV ratings and viewership increased by 25%. Under Finchem’s leadership the PGA Tour also gained unprecedented financial stability, launching long-term business partnerships with a number of major corporations, including FedEx, AT&T, Ralph Lauren, and Shell Oil.\", \"Tim Finchem (born December 2, 1949) is the former commissioner of the PGA Tour. His early career included similar positions with the LPGA and the Senior PGA Tour. He was PGA Tour Commissioner from 1994 to 2016 and chief executive officer of the PGA Tour from 1995 to 2016.\n\n\n\nFinchem graduated from the University of Arizona College of Law in 1973. After practicing law for a time, he joined the PGA Tour in 1978 as vice president and deputy commissioner, becoming commissioner in 1994. His tenure included negotiations to form the World Golf Championships and the introduction of FedEx Cup Playoffs. He also guided the merger of the Senior PGA Tour with the PGA Tour.\n\n\n\nDuring Finchem's 22-year tenure, the PGA Tour became the world's most successful sports league. He also helped to stabilize the organization's financial model and increase its global footprint, negotiating several long-term television contracts. In 2016, Forbes reported that Finchem was the highest paid commissioner in sports, earning $22 million.\n\n\n\nIn November 2016, Finchem announced his retirement and was succeeded by Jay Monahan on\", \"\\\"Timothy John Finchem (born May 17, 1948) is an American professional golfer and former Commissioner of the PGA Tour.\n\n\n\nFinchem became the fourth Commissioner of the PGA Tour on June 16, 1994, succeeding Deane Beman. He played a primarily supportive and management role in the power shift that has come to influence the sport of golf, particularly in the professional arena and television coverage.\n\n\n\nHis tenure has been marked by dramatic increases in purses and the development of a number of successful tournaments. He also helped develop and promote the PGA Tour’s international presence, and has been instrumental in bringing changes in order to modernize the sport and increase its appeal.\n\n\n\nFinchem left the Tour at the end of 2016 and was succeeded by Jay Monahan. \\\"\", \"Tim Finchem (born March 28, 1952) is an American businessman who served as the longest-running Commissioner of the Professional Golfers' Association (PGA) from 1994 to 2017. He was instrumental in the development of the sport and its transformation into the global business it is today.\n\n\n\nFinchem is credited for leading the growth of professional golf through the worldwide expansion of both the PGA Tour and the growth of international tournaments on the European Tour. He was also instrumental in the growth of the Championship Series and revised the format of the Ryder Cup.\n\n\n\nFinchem's tenure as Commissioner improved the PGA Tour's annual tournament schedule, oversaw the addition of lucrative television deals, and has been credited with the modernization of the golf landscape through increased fan interaction, the development of The Golf Channel, and improvements to courses.\n\n\n\nA graduate of Wake Forest University, Finchem began his career in the banking industry in 1978 before joining the PGA Tour in 1980. He was first appointed to the Tour's Board of Directors in 1983, eventually becoming its Chairman and gaining broad control of PGA Tour operations.\n\n\n\nFinchem was awarded the\", \"Timothy J. \\\"Tim\\\" Finchem (born December 30, 1948) is the former Commissioner of the PGA Tour, a position he held from June 1994 to January 2017. He was the driving force in the Tour's growth and television success. He focused on player opportunities, charitable contributions, financial growth and new media. Finchem was formerly a member of the U.S. Department of Justice during the Carter Administration. He went on to become a colle"}, {"url": "https://www.goodreads.com/author/list/4249133.John_Russell_Reynolds", "page_content": "Showing 27 distinct works.\n\nsort by popularity original publication year title average rating number of pages\n\nAddress in Medicine, Delivered at the Meeting of the British Medical Association, 1874\n\nA System of Medicine, Vol. 2 of 3: Diseases of the Respiratory and Circulatory Systems\n\nThe Diagnosis of Diseases of the Brain, Spinal Cord, Nerves, and Their Appendages\n\nYes and No: Or, Glimpses of the Great Conflict\n\nAddress in medicine, delivered at the meeting of the British medical association, 1874 1874 [Leather Bound]\n\nAddress in Medicine, Delivered at the Meeting of the British Medical Association, 1874\n\nCriminal Lunatics: Are They Responsible? An Examination Of 'the Plea Of Insanity', A Letter\n\nLectures on the Clinical Uses of Electricity: Delivered in University College Hospital\n\nThe Harveian Oration: Delivered at the Royal College of Physicians, London, On October 18, 1884 / by J. Russell Reynolds\n\nTables For The Diagnosis Of Diseases Of The Brain (1857)\n\nEpilepsy; Its Symptoms, Treatment, and Relation to Other Chronic Convulsive Diseases\n\nThe Diagnosis of diseases of the brain, spinal cord, nerves, and their appendages 1855 [Leather Bound]\n\n* Note: these are all the books on Goodreads for this author. To add more books, click here"}, {"url": "https://www.bookdepository.com/author/Russell-Reynolds-John", "page_content": "We are sorry to let you know that Book Depository has now closed.\n\nWe will continue to deliver orders placed before midday (12pm BST) on 26 April and will provide support for any order issues until 23 June 2023.\n\nFrom all of us at Book Depository we want to say 'thank you'. Delivering your favourite reads to you since 2007 has been a pleasure.\n\nYou’ll find more info in our FAQs."}, {"url": "https://guides.library.harvard.edu/law/researchstrategy", "page_content": "Legal research must be comprehensive and precise. One contrary source that you miss may invalidate other sources you plan to rely on. Sticking to a strategy will save you time, ensure completeness, and improve your work product.\n\nFollow These Steps\n\nRunning Time: 3 minutes, 13 seconds.\n\nMake sure that you don't miss any steps by using our:"}, {"url": "https://wiki2.org/en/John_Russell_Reynolds", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nBritish neurologist and physician\n\nSir John Russell Reynolds, 1st Baronet (22 May 1828 – 29 May 1896) was a British neurologist and physician.\n\nReynolds was born in Romsey, Hampshire, as son of John Reynolds, an independent minister, and grandson of Dr. Henry Revell Reynolds. He received general education from his father, and was educated in his profession at University College, London, where he obtained three gold medals in the medical school. In 1851 he graduated M.B. in the university of London, and obtained a scholarship and gold medal in medicine. In 1852 he took the degree of M.D., and began practice in Leeds. He soon after moved to London, and took a house, 38 Grosvenor Street, in which Dr. Marshall Hall had lived. Hall announced to his patients in a printed circular that Reynolds had succeeded him in practice. Such procedure was contrary to a recognised understanding among physicians, and Hall incurred the censure of the College of Physicians. Reynolds, who was ignorant of Hall's intention, was in no way responsible for the circular, and was in no way involved in the censure. He was duly elected a fellow of the college in 1859. In the same year he was appointed assistant physician to University College Hospital, to which he continued attached throughout life. He had before been, in 1855, assistant physician to the Hospital for Sick Children, and in 1857 assistant physician to the Westminster Hospital. In 1865 he became professor of the principles and practice of medicine at University College, and in 1878 he was appointed physician-in-ordinary to the queen's household. He gained a considerable practice as a physician, and was often consulted in difficult cases of nervous disease. In 1869 he was elected a fellow of the Royal Society, and in 1883 vice-president of the Royal Medical and Chirurgical Society. He delivered the Lumleian lecture at the College of Physicians in 1867, the Harveian oration in 1884, and was elected president in 1893, on the death of Sir Andrew Clark. He was re-elected in 1894 and 1895, and on 1 January in the latter year was created a baronet. In the winter of 1895–6 he became too ill to offer himself for re-election as president of the College of Physicians. He died at his house in Grosvenor Street, London, after several weeks of illness of a pulmonary congestion, on 29 May 1896. He was married, first, at St Pancras Old Church, London, on 28 August 1852 to Margaretta Susannah Ainslie (1831-1880) and, secondly, to Frances (Plunkett) Reynolds widow of C. J. C. Crespign, but left no children.\n\nThe Reynolds Baronetcy, of Grosvenor Street, was created in the Baronetage of the United Kingdom on 28 February 1895 for John Russell Reynolds.[1] The title became extinct on his death.\n\nReynolds devoted himself from an early period to the study of nervous diseases, and in 1854 published an Essay on Vertigo; in 1855 Diagnosis of Diseases of the Brain, Spinal Cord, and Nerves, as well as Tables for the Diagnosis of Diseases of the Brain; in 1861 a treatise on epilepsy; in 1871 Lectures on the Clinical Uses of Electricity; in 1872 The Scientific Value of the Legal Tests of Insanity; besides many papers in medical periodicals and the transactions of medical societies, and several addresses to medical associations. His writings on nervous diseases were useful contributions to a department of medicine in which much work remained undone, but in the flood of modern observations they have been submerged. He will chiefly be remembered among physicians as the editor of the System of Medicine, in five volumes, published from 1866 to 1879, a collection of essays on diseases, written by the most competent men who could be induced to write—compositions of varying merit, but generally of high value. He himself wrote the parts on erysipelas, on inflammation of the lymphatics, and on several forms of nervous disease. He published in 1893 a Life of Dr. Walter Hayle Walshe. Reynolds was a tall man, with dark hair, with a dignified delivery and some oratorical power.\n\nReynolds died in London.\n\nReferences"}, {"url": "https://www.npr.org/2021/09/30/1041610286/during-banned-books-week-readers-explore-what-it-means-to-challenge-texts", "page_content": "During Banned Books Week, Readers Explore What It Means To Challenge Texts\n\nEnlarge this image Emily Bogle/NPR Emily Bogle/NPR\n\nThe Catcher in the Rye. A Brave New World. Lolita. Lady Chatterley's Lover.\n\nThese are some classics that pop into many minds when considering books that have been banned from home and school libraries over time.\n\nBut there's been a \"notable shift\" in the subject matter of books now being challenged in the U.S. When the American Library Association released its list of the Top Ten Most Challenged Books of 2020 in April, the books that received the most challenges to libraries and schools dealt with \"racism, Black American history and diversity in the United States,\" says Deborah Caldwell-Stone, director of the ALA's Office for Intellectual Freedom.\n\nAnd Caldwell-Stone says in 2018 and 2019, the Banned Books list was made up \"almost exclusively\" of books dealing with LGBTQ concerns.\n\n\"I think that we're seeing a response in many ways to some of the conversations, the challenges that we faced as a society since the murder of George Floyd last year,\" she says.\n\nThe theme of this year's Banned Books Week is \"Books Unite Us. Censorship Divides Us.\" Public events include a Dear Banned Author Letter-Writing Campaign and Stand For The Banned Read-out, an opportunity for people to submit videos of themselves reading books from the list.\n\nTop Ten Most Challenged Books of 2020\n\nGeorge by Alex Gino Reasons: Challenged, banned, and restricted for LGBTQIA+ content, conflicting with a religious viewpoint, and not reflecting \"the values of our community\"\n\nStamped: Racism, Antiracism, and You by Ibram X. Kendi and Jason Reynolds Reasons: Banned and challenged because of author's public statements, and because of claims that the book contains \"selective storytelling incidents\" and does not encompass racism against all people\n\nAll American Boys by Jason Reynolds and Brendan Kiely Reasons: Banned and challenged for profanity, drug use, and alcoholism, and because it was thought to promote anti-police views, contain divisive topics, and be \"too much of a sensitive matter right now\"\n\nSpeak by Laurie Halse Anderson Reasons: Banned, challenged, and restricted because it was thought to contain a political viewpoint and it was claimed to be biased against male students, and for the novel's inclusion of rape and profanity\n\nThe Absolutely True Diary of a Part-Time Indian by Sherman Alexie Reasons: Banned and challenged for profanity, sexual references, and allegations of sexual misconduct by the author\n\nSomething Happened in Our Town: A Child's Story About Racial Injustice by Marianne Celano, Marietta Collins, and Ann Hazzard, illustrated by Jennifer Zivoin Reasons: Challenged for \"divisive language\" and because it was thought to promote anti-police views\n\nTo Kill a Mockingbird by Harper Lee Reasons: Banned and challenged for racial slurs and their negative effect on students, featuring a \"white savior\" character, and its perception of the Black experience\n\nOf Mice and Men by John Steinbeck Reasons: Banned and challenged for racial slurs and racist stereotypes, and their negative effect on students\n\nThe Bluest Eye by Toni Morrison Reasons: Banned and challenged because it was considered sexually explicit and depicts child sexual abuse\n\nThe Hate U Give by Angie Thomas Reasons: Challenged for profanity, and it was thought to promote an anti-police message\n\nAuthor Angie Thomas' The Hate U Give has made the banned books list before. Since making the list often boosts sales, Thomas tweeted her gratitude: \"Happy #BannedBooksWeek! I remember the time a Texas school district banned The Hate U Give, and I sold tens of thousands of copies in a week in that same district. Keeping banning my books. I have a second home to buy.\"\n\nBestselling author Jason Reynolds, the \"Banned Books Week 2021 Honorary Chair,\" has two books on the most recent list: Stamped: Racism, Antiracism, and You, co-written with Ibram X. Kendi and All American Boys with Brendan Kiely.\n\nIn a Facebook Live conversation on Tuesday, Reynolds disagreed with the mantra that making the list is a \"badge of honor\" or like belonging to \"a special club\" for authors. \"I don't feel that way. I actually think it's a bigger slap in the face,\" said Reynolds, \"It's painful to me because what I know is that when these books are banned, there are going to be thousands and thousands of young people who will not get these books.\"\n\nStill, nothing says \"read me\" like the words \"banned\" or \"censored.\"\n\nIn Pennsylvania, the Central York School Board recently tried to halt the use of a \"Diversity Committee Resource List\" that included books by Nikole Hannah-Jones and Malala Yousafzai. A robust student protest ensued and the decision was reversed. There have been similar outcries in Texas where the Leander Independent School District pulled six books including The Handmaid's Tale: The Graphic Novel by Margaret Atwood and Renee Nault.\n\nIn Tennessee, a local chapter of Moms For Liberty (MFL) deemed a number of books as inappropriate for second graders, including Martin Luther King, Jr and the March on Washington and the picture book Ruby Bridges Goes to School, about the six year old who became the first African American to integrate an all-white school in New Orleans.\n\nIn a letter to the Tennessee Department of Education, the Williamson MFL chair Robin Steenman writes: \"The classroom books and teacher manuals reveal both explicit and implicit Anti-American, Anti-White, and Anti-Mexican teaching. Additionally, it implies to second grade children that people of color continue to be oppressed...and teaches that the racial injustice of the 1960s exists today.\"\n\nBut Steenman claims they are not seeking to ban books. She says MFL has heard complaints from parents in the community, including people of color, about the manner in which certain books are being taught to second graders. \"How it's presented to the children really does alienate some,\" she says, and \"divides children up\" based on their skin color. \"It's very focused on racial injustice,\" she says, \"instead of talking about the strides that our country has made.\"\n\nCaldwell-Stone says she finds the challenge to Ruby Bridges Goes to School \"just incredible.\" Written by Bridges herself, Caldwell-Stone says the book is \"age appropriate, developmentally appropriate\" and received \"excellent reviews\" for introducing the topic to children.\n\nDuring the Facebook Live conversation with Jason Reynolds, he was asked \"What do you think people are afraid of?\" when they ban books. Reynolds responded: \"There are many, many adults who are terrified of being challenged...because what happens is we will then be forced to grapple with our own biases, to grapple with our own ignorance.\" Later in the conversation he added, \"You've got to trust your kids a little more.\"\n\nMeghan Collins Sullivan edited this story."}]}