{"John Russell Reynolds also wrote on a variety of other topics, including history, biography, and literature.": [{"url": "https://acnr.co.uk/articles/john-russell-reynolds/", "page_content": "Abstract\n\nWhen neurology began to develop as a specialty, Russell Reynolds was one of the first neurologists appointed to the Hospital for the Paralysed and Epileptic, Queen Square.\n\nOf many contributions his work on epilepsy was influential, espousing many new concepts. He followed and developed Hughlings Jackson’s original ideas about positive and negative neurological symptoms. His approach to patients was holistic at a time when more objectively defined notions of illness dominated medicine. He wrote on vertigo, and about criminal lunacy, and his book The Diagnosis of Diseases of the Brain, Spinal Cord, Nerves and their appendages was a major text of the period.\n\nWell versed in poetry, philosophy, art, and music, he was widely admired. He became President of the Royal College of Physicians.\n\nLike the great Sir Jonathan Hutchinson and other Victorians of privileged stock, Sir John Russell Reynolds (1828–1896) (Figure 1) never attended school. His father, a nonconformist minister at Romsey in Hampshire, educated him personally. His grandfather Henry Revell Reynolds (1745-1811), FRS, was an illustrious physician at the Middlesex and St Thomas’s Hospitals and Physician to George III.\n\nFigure 1: Sir J Russell Reynolds. [Published in British Medical Journal, 6 June 1896)\n\nAs a nonconformist he was excluded from Oxford and Cambridge* and read Medicine at University College London, graduating with a gold medal in physiology, comparative anatomy, and medicine in 1851 [1]. An impecunious young doctor, he sought a living, practicing in Leeds where his brother was a Minister of the East Parade Mission Chapel, and his brother-in-law a journalist on the Leeds Mercury.\n\nA year later his former teacher Marshall Hall, FRS. (1790-1857), a physician and brilliant experimental physiologist persuaded him to return to London [2], where at modest cost Hall let him live in his home at 38, Grosvenor Street and join his Consultant practice, mainly in nervous diseases.\n\nOnly four years after graduating Russell Reynolds’ outstanding ability led to his appointment as assistant physician at the Hospital for Sick Children and to the Westminster and University College Hospitals. There he became Holme Professor of Clinical Medicine in 1862, and in 1867 succeeding Sir William Jenner as Professor of Medicine. Just five years after the opening of the National Hospital for the Relief and Cure of Paralysis and Epilepsy, Russell Reynolds showed his interest in neurology and was appointed to its staff. He was elected FRS on 3rd June 1869.\n\nAt this time neurology began to flourish; he worked with many distinguished early neurologists. They included Hughlings Jackson (1835-1911), Jabez Ramskill (1825-1897), Charles Bland Radcliffe (1822–1889) who succeeded Brown–Séquard in 1863, and published Lectures on Epilepsy, Pain, Paralysis, and certain other disorders of the Nervous System, 1864, and articles in Reynolds’s System of Medicine. His brother John Netten Radcliffe (c. 1830-1884), a pioneering epidemiologist, was also Medical Superintendent of the Hospital for the Paralysed and Epileptic.\n\nNo man works in a vacuum. Marshall Hall, (who in spite of his acknowledged distinction [3] surprisingly had failed to get an academic post in London) inspired and encouraged Reynolds. Amongst contemporary and subsequent notable physicians he influenced were: the erudite Charlton Bastian (1837-1915); Charles Edward Beevor, (1854-1908); Howard Tooth (1856-1925); James Taylor, (1859-1946) editor of Jackson’s Selected Writings; and the punctilious Thomas Buzzard (1831-1919), his neighbour in Grosvenor Street, and friend of both Hughlings Jackson and David Ferrier (1843-1928).\n\nSuch was Reynolds’s reputation that he was rewarded with both the Lumleian and the Harveian lectures at the Royal College of Physicians of London, becoming President from 1893–1895. Like his grandfather, he was physician to the royal household in 1879 and was made a baronet in 1895. He was president of the BMA until his death.\n\nA popular and fluent lecturer, he was shy and serious but had a quiet humour and a ‘directness of speech that was no respecter of persons.’ Described as courteous, shrewd, and kind, his approach was holistic – long before it became fashionable:\n\nNot to merely make a diagnosis, much less to write a prescription, but to advise the individual patient what he or she should best do to regain their health… and what changes in the environment, mental, emotional, or physical were most likely to achieve this end. [2]\n\nMedical works\n\nRussell Reynolds is often remembered for his descriptions of epilepsy, eclamptic convulsions, and febrile convulsions in children [4,5]. He also used electrotherapy in various nervous diseases [6].\n\nInterestingly, he is widely quoted for commending the “great value of Cannabis indica” in migraine, epileptic conditions, depression, and asthma. In 1890 he prescribed a cannabis tincture for the menstrual cramps suffered by Queen Victoria. He noted in The Lancet:\n\nWhen pure and administered carefully, [cannabis] is one of the most valuable medicines we possess. [7]\n\nOf greater import was his 1861 paper (Figure 2) that espoused the concept of positive and negative neurological symptoms [5,8]. Positive symptoms were abnormal behaviours that included not only clonic jerking and abnormal movements but also hallucinations and paranoid delusions.\n\nSome symptoms are negative, i.e. they consist in the negation of vital properties. Of this kind are paralysis, anaesthesia, and the like…Other symptoms are positive, i.e. they consist in excess or alteration of vital properties. Of this kind are spasms, pain, convulsions and the like… (p.9-12, 28)\n\nUnfortunately, he failed to write further on this theme. Like Jackson, Russell Reynolds shrewdly noted that the lesion did not directly cause the symptoms observed.\n\nThe origins of positive and negative symptoms were inextricably intertwined with Herbert Spencer’s ideas of dissolution and evolution of the nervous system [9]. Hughlings Jackson extended Spencer’s idea to patients’ symptoms, both positive and negative. Jackson believed that negative symptoms related to the dissolution of neural function while positive symptoms resulted from excitation or the release of lower levels from higher inhibitory control:\n\nSpeaking of the physical side, there are degrees of loss of function of the least organized nervous arrangements with conservation of function of the more organized. There is in each reduction to a more automatic condition; in each there is dissolution, using this term as Spencer does, as the opposite of evolution. [10]\n\nFigure 2. Reynolds: Epilepsy, its symptoms, treatment and relation to other chronic convulsive diseases. 1861\n\nRussell Reynolds wrote his first book on Vertigo. In 1856 he examined legal pleas for insanity in his Criminal Lunatics: are they Responsible? He believed that epilepsy could be a distinct or ‘idiopathic’ disease, a controversial view well expressed in The Diagnosis of Diseases of the Brain, Spinal Cord, Nerves and their appendages in 1855 (dedicated to Marshall Hall), This was later contradicted by Kinnier Wilson who stated that all epileptic events were symptoms, whether or not any underlying pathology could be demonstrated [11].\n\nAlways inclined to a broad approach he described the interictal symptoms of 62 patients with idiopathic epilepsy. He found about one-third had mild impairment of recent memory and a similar proportion had moderate to severe psychopathological findings. His interpretation of epileptic activity (well described by Eadie) [12] was in large measure approved by Hughlings Jackson.\n\nHe edited and wrote many chapters in A system of medicine (London: Macmillan, in five volumes from 1866 to 1879), a major text rivalled only by John Cooke’s Treatise in Nervous Diseases, published in two volumes, in 1820 and 1823, the second volume of Bright’s Reports of Medical Cases 1831, and Romberg’s Manual of the Nervous Diseases of Man 1840 [13].\n\nRussell Reynolds practiced at a time when neurology was in its infancy. It relied on clinical description and elementary pathology. In this morass of evolving knowledge, Reynolds formulated a classification of neurological diseases that remains the kernel of modern systems. His work in neurology linked the highly original physiological and clinical works of his mentor, Marshall Hall, to Hughlings Jackson’s intellectual explorations of the brain’s complex functions and hierarchies, and to the more systematic descriptive neurology of William Gowers [12]. His students included Charlton Bastian (1837-1915) and Sir William Gowers (1845-1915), whose writings often reflect his influence.\n\nLegacy\n\nHe was well versed in poetry, philosophy, art, and music. He was married, first, to Margaret Ainslie, and, secondly, to Frances Crespigny, but left no children. He died aged 68 of ‘pulmonary congestion’ at his home in 1896.\n\nThe scholarship and clinical advances made by Reynolds can be seen as important influences on contemporary and also later notable neurologists at the National Hospital. He bridged the eras of Victorian Neurology with that of the dawning 20th century.\n\nHe was noted as:\n\nA man of scholarship and wisdom, in his presidential address in 1894, in a spirit of prophecy he warned the subject-ridden student of to day of the danger of becoming entangled in the net of an ill-considered and misunderstood technical phraseology, and of juggling with words when he ought to be dealing with concrete things. [2]\n\nAnd Eadie characterised him as:\n\nA most eminent, scholarly, and influential physician who was greatly respected and admired by his contemporaries…the sort of man whose ideas would not readily be discarded because it might almost seem disrespectful to do so unless a better alternative could be clearly demonstrated to exist. [12]\n\n* So-called dissenters (Catholics, Jews, and Quakers) were denied admission because their religious beliefs prevented their taking an oath to adhere to the 39 articles of the Anglican Church. This was abolished by the Universities Tests Act in 1871.\n\nWomen had studied at Oxford since the 1870s. But until 1921, they were not entitled to claim the degrees they had earned. Cambridge followed in 1947.\n\nReferences\n\nBrown GH. Munk’s Roll. Lives of the Fellows of the Royal College of Physicians of London (1826-1925). London: The Royal College of Physicians, 1955;IV:116-7. Obituary Sir J. Russell Reynolds, MD, FRCP, FRS. Brit Med J 1896;1: 1422-3 https://doi.org/10.1136/bmj.1.1849.1422 Pearce J.M.S.. The life and work of Marshall Hall. Quarterly Journal of Medicine, 1997;90:801-803. https://doi.org/10.1093/qjmed/90.12.801 Reynolds JR. On the pathology of convulsions, with special reference to those children. Liverpool Med Chir J 1858;2:1-14. Reynolds JR. Epilepsy: its symptoms. In: Treatment and relation to other chronic convulsive diseases. London: John Churchill, 1861:8-10. Reynolds J . In: Lectures on the clinical uses of electricity delivered in University College Hospital. 2nd edn. London: John A Churchill, 1873. Reynolds JR. Therapeutic uses and toxic effects of Cannabis indica. The Lancet 1890;1:639. Pearce JMS. Positive and negative cerebral symptoms: the roles of Russell Reynolds and Hughlings Jackson. Journal of Neurology Neurosurgery and Psychiatry 2004;75:1148 https://doi.org/10.1136/jnnp.2004.038422 Spencer H . Principles of psychology. London: Longman, Brown, Green, 1855. https://doi.org/10.1037/14065-000 Jackson JH. Remarks on dissolution of the nervous system as exemplified by certain post-epileptic conditions. Medical Press and Circular 1881;329. Wilson SAK. Modern Problems in Neurology. London: Edward Arnold; 1928. https://doi.org/10.1136/bmj.2.3541.914 Eadie MJ. The neurological legacy of John Russell Reynolds (1828-1896). J Clin Neurosci. 2007;(4):309-16. Epub 2007 Jan 22. https://doi.org/10.1016/j.jocn.2006.03.033 Romberg MH. (Translated by Sieveking EH.) A Manual of the Nervous Diseases of Man. London: New Sydenham Society; 1853."}, {"url": "https://history.rcplondon.ac.uk/inspiring-physicians/sir-john-russell-reynolds", "page_content": "Russell Reynolds was born at Romsey in Hampshire, the son of John Reynolds, a nonconformist minister, and grandson of Henry Revell Reynolds, F.R.C.P, physician to the Middlesex and St. Thomas’s Hospitals and Physician-in-Ordinary to George III. His father gave him the greater part of his general education and University College, London, his medical training. He graduated in 1851 as University scholar and gold medallist in physiology, comparative anatomy and medicine. For so outstanding a student, a great future seemed assured. But his means were slender and he decided to begin practice in Leeds where he had relatives. However, his old teacher Marshall Hall persuaded him to return to London, offering him his house in Grosvenor Street on favourable terms. His enterprise was rewarded by appointments as assistant physician to the Hospital for Sick Children in 1855, the Westminster Hospital in 1857 and University College Hospital in 1859. After a further three years, he became full physician and Holme professor of clinical medicine at University College, and in 1867 he succeeded Jenner in the chair of medicine.\n\nReynolds gave distinguished service to the Royal College of Physicians, being Lumleian Lecturer in 1867, Harveian Orator in 1884, Censor, and finally, from 1893 to 1896, President. He was chosen as Physician to the Royal Household in 1879 and, with his friend, J. E. Erichsen, created a baronet in 1895. He was president of the B.M.A. at the time of his death. But he made his mark in the profession chiefly by his early writings on nervous diseases — he was one of the first to propound the possibilities of electricity as a therapeutic agent — and by his editorship of the System of Medicine, published in five volumes between 1866 and 1879. He was a fluent and popular lecturer and a careful and sympathetic physician. Somewhat shy and grave of mien, he could reveal both a quiet humour and a directness of speech that was no respecter of persons. Painting and music were his recreations, and he was well read in literature. He was married, firstly, to a Miss Ainslie and, secondly to Frances, widow of C. J. C. Crespigny, but left no children. He died at his house in Grosvenor Street.\n\nG H Brown\n\n[Lancet, 1896; B.M.J., 1896; D.N.B., xlviii, 52]"}, {"url": "https://alchetron.com/John-Russell-Reynolds", "page_content": "Sir John Russell Reynolds, 1st Baronet (22 May 1828 – 29 May 1896) was a British neurologist and physician.\n\nReynolds was born in Romsey, Hampshire, as son of John Reynolds, an independent minister, and grandson of Dr. Henry Revell Reynolds. He received general education from his father, and was educated in his profession at University College, London, where he obtained three gold medals in the medical school. In 1851 he graduated M.B. in the university of London, and obtained a scholarship and gold medal in medicine. In 1852 he took the degree of M.D., and began practice in Leeds. He soon after moved to London, and took a house, 38 Grosvenor Street, in which Dr. Marshall Hall had lived. Hall announced to his patients in a printed circular that Reynolds had succeeded him in practice. Such procedure was contrary to a recognised understanding among physicians, and Hall incurred the censure of the College of Physicians. Reynolds, who was ignorant of Hall's intention, was in no way responsible for the circular, and was in no way involved in the censure. He was duly elected a fellow of the college in 1859. In the same year he was appointed assistant physician to University College Hospital, to which he continued attached throughout life. He had before been, in 1855, assistant physician to the Hospital for Sick Children, and in 1857 assistant physician to the Westminster Hospital. In 1865 he became professor of the principles and practice of medicine at University College, and in 1878 he was appointed physician-in-ordinary to the queen's household. He gained a considerable practice as a physician, and was often consulted in difficult cases of nervous disease. In 1869 he was elected a fellow of the Royal Society, and in 1883 vice-president of the Royal Medical and Chirurgical Society. He delivered the Lumleian lecture at the College of Physicians in 1867, the Harveian oration in 1884, and was elected president in 1893, on the death of Sir Andrew Clark. He was re-elected in 1894 and 1895, and on 1 January in the latter year was created a baronet. In the winter of 1895–6 he became too ill to offer himself for re-election as president of the College of Physicians. He died at his house in Grosvenor Street, London, after several weeks of illness of a pulmonary congestion, on 29 May 1896. He was married, first, to Miss Ainslie, and, secondly, to Frances, widow of C. J. C. Crespigny, but left no children.\n\nThe Reynolds Baronetcy, of Grosvenor Street, was created in the Baronetage of the United Kingdom on 28 February 1895 for John Russell Reynolds. The title became extinct on his death.\n\nReynolds devoted himself from an early period to the study of nervous diseases, and in 1854 published an Essay on Vertigo; in 1855 Diagnosis of Diseases of the Brain, Spinal Cord, and Nerves, as well as Tables for the Diagnosis of Diseases of the Brain; in 1861 a treatise on epilepsy; in 1871 Lectures on the Clinical Uses of Electricity; in 1872 The Scientific Value of the Legal Tests of Insanity; besides many papers in medical periodicals and the transactions of medical societies, and several addresses to medical associations. His writings on nervous diseases were useful contributions to a department of medicine in which much work remained undone, but in the flood of modern observations they have been submerged. He will chiefly be remembered among physicians as the editor of the System of Medicine, in five volumes, published from 1866 to 1879, a collection of essays on diseases, written by the most competent men who could be induced to write—compositions of varying merit, but generally of high value. He himself wrote the parts on erysipelas, on inflammation of the lymphatics, and on several forms of nervous disease. He published in 1893 a Life of Dr. Walter Hayle Walshe. Reynolds was a tall man, with dark hair, with a dignified delivery and some oratorical power.\n\nReynolds died in London."}, {"url": "https://www.britannica.com/biography/Bertrand-Russell", "page_content": "As a founding figure of the analytic movement in philosophy, Bertrand Russell helped to transform the substance, character, and style of philosophy in the English-speaking world. He was also one of the greatest logicians of the 20th century. An outspoken social reformer, he campaigned effectively against unjust and irrational impediments to human freedom and happiness.\n\nDuring his childhood Bertrand Russell was educated at home. In 1890 he entered Trinity College, Cambridge , where he studied mathematics and philosophy , graduating with first-class honours in both (1893 and 1894, respectively) and winning a fellowship in the latter in 1895. That year he briefly attended lectures in economics at the University of Berlin .\n\nBertrand Russell’s childhood was grief-stricken and lonely. His mother and sister died when he was two years old, and his father died some 18 months later. He and his brother, Frank, were cared for by their paternal grandparents, but their grandfather died soon after Bertrand’s sixth birthday. Educated at home, he was isolated from other children.\n\nBertrand Russell, in full Bertrand Arthur William Russell, 3rd Earl Russell of Kingston Russell, Viscount Amberley of Amberley and of Ardsalla, (born May 18, 1872, Trelleck, Monmouthshire, Wales—died February 2, 1970, Penrhyndeudraeth, Merioneth), British philosopher, logician, and social reformer, founding figure in the analytic movement in Anglo-American philosophy, and recipient of the Nobel Prize for Literature in 1950. Russell’s contributions to logic, epistemology, and the philosophy of mathematics established him as one of the foremost philosophers of the 20th century. To the general public, however, he was best known as a campaigner for peace and as a popular writer on social, political, and moral subjects. During a long, productive, and often turbulent life, he published more than 70 books and about 2,000 articles, married four times, became involved in innumerable public controversies, and was honoured and reviled in almost equal measure throughout the world. Russell’s article on the philosophical consequences of relativity appeared in the 13th edition of the Encyclopædia Britannica.\n\nRussell was born in Ravenscroft, the country home of his parents, Lord and Lady Amberley. His grandfather, Lord John Russell, was the youngest son of the 6th Duke of Bedford. In 1861, after a long and distinguished political career in which he served twice as prime minister, Lord Russell was ennobled by Queen Victoria, becoming the 1st Earl Russell. Bertrand Russell became the 3rd Earl Russell in 1931, after his elder brother, Frank, died childless.\n\nBritannica Quiz Who Said It? Essential Writers, Artists, and Scientists\n\nRussell’s early life was marred by tragedy and bereavement. By the time he was age six, his sister, Rachel, his parents, and his grandfather had all died, and he and Frank were left in the care of their grandmother, Countess Russell. Though Frank was sent to Winchester School, Bertrand was educated privately at home, and his childhood, to his later great regret, was spent largely in isolation from other children. Intellectually precocious, he became absorbed in mathematics from an early age and found the experience of learning Euclidean geometry at the age of 11 “as dazzling as first love,” because it introduced him to the intoxicating possibility of certain, demonstrable knowledge. This led him to imagine that all knowledge might be provided with such secure foundations, a hope that lay at the very heart of his motivations as a philosopher. His earliest philosophical work was written during his adolescence and records the skeptical doubts that led him to abandon the Christian faith in which he had been brought up by his grandmother.\n\nIn 1890 Russell’s isolation came to an end when he entered Trinity College, University of Cambridge, to study mathematics. There he made lifelong friends through his membership in the famously secretive student society the Apostles, whose members included some of the most influential philosophers of the day. Inspired by his discussions with this group, Russell abandoned mathematics for philosophy and won a fellowship at Trinity on the strength of a thesis entitled An Essay on the Foundations of Geometry, a revised version of which was published as his first philosophical book in 1897. Following Kant’s Critique of Pure Reason (1781, 1787), this work presented a sophisticated idealist theory that viewed geometry as a description of the structure of spatial intuition.\n\nIn 1896 Russell published his first political work, German Social Democracy. Though sympathetic to the reformist aims of the German socialist movement, it included some trenchant and farsighted criticisms of Marxist dogmas. The book was written partly as the outcome of a visit to Berlin in 1895 with his first wife, Alys Pearsall Smith, whom he had married the previous year. In Berlin, Russell formulated an ambitious scheme of writing two series of books, one on the philosophy of the sciences, the other on social and political questions. “At last,” as he later put it, “I would achieve a Hegelian synthesis in an encyclopaedic work dealing equally with theory and practice.” He did, in fact, come to write on all the subjects he intended, but not in the form that he envisaged. Shortly after finishing his book on geometry, he abandoned the metaphysical idealism that was to have provided the framework for this grand synthesis.\n\nRussell’s abandonment of idealism is customarily attributed to the influence of his friend and fellow Apostle G.E. Moore. A much greater influence on his thought at this time, however, was a group of German mathematicians that included Karl Weierstrass, Georg Cantor, and Richard Dedekind, whose work was aimed at providing mathematics with a set of logically rigorous foundations. For Russell, their success in this endeavour was of enormous philosophical as well as mathematical significance; indeed, he described it as “the greatest triumph of which our age has to boast.” After becoming acquainted with this body of work, Russell abandoned all vestiges of his earlier idealism and adopted the view, which he was to hold for the rest of his life, that analysis rather than synthesis was the surest method of philosophy and that therefore all the grand system building of previous philosophers was misconceived. In arguing for this view with passion and acuity, Russell exerted a profound influence on the entire tradition of English-speaking analytic philosophy, bequeathing to it its characteristic style, method, and tone.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nInspired by the work of the mathematicians whom he so greatly admired, Russell conceived the idea of demonstrating that mathematics not only had logically rigorous foundations but also that it was in its entirety nothing but logic. The philosophical case for this point of view—subsequently known as logicism—was stated at length in The Principles of Mathematics (1903). There Russell argued that the whole of mathematics could be derived from a few simple axioms that made no use of specifically mathematical notions, such as number and square root, but were rather confined to purely logical notions, such as proposition and class. In this way not only could the truths of mathematics be shown to be immune from doubt, they could also be freed from any taint of subjectivity, such as the subjectivity involved in Russell’s earlier Kantian view that geometry describes the structure of spatial intuition. Near the end of his work on The Principles of Mathematics, Russell discovered that he had been anticipated in his logicist philosophy of mathematics by the German mathematician Gottlob Frege, whose book The Foundations of Arithmetic (1884) contained, as Russell put it, “many things…which I believed I had invented.” Russell quickly added an appendix to his book that discussed Frege’s work, acknowledged Frege’s earlier discoveries, and explained the differences in their respective understandings of the nature of logic.\n\nThe tragedy of Russell’s intellectual life is that the deeper he thought about logic, the more his exalted conception of its significance came under threat. He himself described his philosophical development after The Principles of Mathematics as a “retreat from Pythagoras.” The first step in this retreat was his discovery of a contradiction—now known as Russell’s Paradox—at the very heart of the system of logic upon which he had hoped to build the whole of mathematics. The contradiction arises from the following considerations: Some classes are members of themselves (e.g., the class of all classes), and some are not (e.g., the class of all men), so we ought to be able to construct the class of all classes that are not members of themselves. But now, if we ask of this class “Is it a member of itself?” we become enmeshed in a contradiction. If it is, then it is not, and if it is not, then it is. This is rather like defining the village barber as “the man who shaves all those who do not shave themselves” and then asking whether the barber shaves himself or not.\n\nAt first this paradox seemed trivial, but the more Russell reflected upon it, the deeper the problem seemed, and eventually he was persuaded that there was something fundamentally wrong with the notion of class as he had understood it in The Principles of Mathematics. Frege saw the depth of the problem immediately. When Russell wrote to him to tell him of the paradox, Frege replied, “arithmetic totters.” The foundation upon which Frege and Russell had hoped to build mathematics had, it seemed, collapsed. Whereas Frege sank into a deep depression, Russell set about repairing the damage by attempting to construct a theory of logic immune to the paradox. Like a malignant cancerous growth, however, the contradiction reappeared in different guises whenever Russell thought that he had eliminated it.\n\nEventually, Russell’s attempts to overcome the paradox resulted in a complete transformation of his scheme of logic, as he added one refinement after another to the basic theory. In the process, important elements of his “Pythagorean” view of logic were abandoned. In particular, Russell came to the conclusion that there were no such things as classes and propositions and that therefore, whatever logic was, it was not the study of them. In their place he substituted a bewilderingly complex theory known as the ramified theory of types, which, though it successfully avoided contradictions such as Russell’s Paradox, was (and remains) extraordinarily difficult to understand. By the time he and his collaborator, Alfred North Whitehead, had finished the three volumes of Principia Mathematica (1910–13), the theory of types and other innovations to the basic logical system had made it unmanageably complicated. Very few people, whether philosophers or mathematicians, have made the gargantuan effort required to master the details of this monumental work. It is nevertheless rightly regarded as one of the great intellectual achievements of the 20th century.\n\nPrincipia Mathematica is a herculean attempt to demonstrate mathematically what The Principles of Mathematics had argued for philosophically, namely that mathematics is a branch of logic. The validity of the individual formal proofs that make up the bulk of its three volumes has gone largely unchallenged, but the philosophical significance of the work as a whole is still a matter of debate. Does it demonstrate that mathematics is logic? Only if one regards the theory of types as a logical truth, and about that there is much more room for doubt than there was about the trivial truisms upon which Russell had originally intended to build mathematics. Moreover, Kurt Gödel’s first incompleteness theorem (1931) proves that there cannot be a single logical theory from which the whole of mathematics is derivable: all consistent theories of arithmetic are necessarily incomplete. Principia Mathematica cannot, however, be dismissed as nothing more than a heroic failure. Its influence on the development of mathematical logic and the philosophy of mathematics has been immense.\n\nDespite their differences, Russell and Frege were alike in taking an essentially Platonic view of logic. Indeed, the passion with which Russell pursued the project of deriving mathematics from logic owed a great deal to what he would later somewhat scornfully describe as a “kind of mathematical mysticism.” As he put it in his more disillusioned old age, “I disliked the real world and sought refuge in a timeless world, without change or decay or the will-o’-the-wisp of progress.” Russell, like Pythagoras and Plato before him, believed that there existed a realm of truth that, unlike the messy contingencies of the everyday world of sense-experience, was immutable and eternal. This realm was accessible only to reason, and knowledge of it, once attained, was not tentative or corrigible but certain and irrefutable. Logic, for Russell, was the means by which one gained access to this realm, and thus the pursuit of logic was, for him, the highest and noblest enterprise life had to offer.\n\nIn philosophy the greatest impact of Principia Mathematica has been through its so-called theory of descriptions. This method of analysis, first introduced by Russell in his article “On Denoting” (1905), translates propositions containing definite descriptions (e.g., “the present king of France”) into expressions that do not—the purpose being to remove the logical awkwardness of appearing to refer to things (such as the present king of France) that do not exist. Originally developed by Russell as part of his efforts to overcome the contradictions in his theory of logic, this method of analysis has since become widely influential even among philosophers with no specific interest in mathematics. The general idea at the root of Russell’s theory of descriptions—that the grammatical structures of ordinary language are distinct from, and often conceal, the true “logical forms” of expressions—has become his most enduring contribution to philosophy.\n\nRussell later said that his mind never fully recovered from the strain of writing Principia Mathematica, and he never again worked on logic with quite the same intensity. In 1918 he wrote Introduction to Mathematical Philosophy, which was intended as a popularization of Principia, but, apart from this, his philosophical work tended to be on epistemology rather than logic. In 1914, in Our Knowledge of the External World, Russell argued that the world is “constructed” out of sense-data, an idea that he refined in The Philosophy of Logical Atomism (1918–19). In The Analysis of Mind (1921) and The Analysis of Matter (1927), he abandoned this notion in favour of what he called neutral monism, the view that the “ultimate stuff” of the world is neither mental nor physical but something “neutral” between the two. Although treated with respect, these works had markedly less impact upon subsequent philosophers than his early works in logic and the philosophy of mathematics, and they are generally regarded as inferior by comparison.\n\nConnected with the change in his intellectual direction after the completion of Principia was a profound change in his personal life. Throughout the years that he worked single-mindedly on logic, Russell’s private life was bleak and joyless. He had fallen out of love with his first wife, Alys, though he continued to live with her. In 1911, however, he fell passionately in love with Lady Ottoline Morrell. Doomed from the start (because Morrell had no intention of leaving her husband), this love nevertheless transformed Russell’s entire life. He left Alys and began to hope that he might, after all, find fulfillment in romance. Partly under Morrell’s influence, he also largely lost interest in technical philosophy and began to write in a different, more accessible style. Through writing a best-selling introductory survey called The Problems of Philosophy (1911), Russell discovered that he had a gift for writing on difficult subjects for lay readers, and he began increasingly to address his work to them rather than to the tiny handful of people capable of understanding Principia Mathematica.\n\nIn the same year that he began his affair with Morrell, Russell met Ludwig Wittgenstein, a brilliant young Austrian who arrived at Cambridge to study logic with Russell. Fired with intense enthusiasm for the subject, Wittgenstein made great progress, and within a year Russell began to look to him to provide the next big step in philosophy and to defer to him on questions of logic. However, Wittgenstein’s own work, eventually published in 1921 as Logisch-philosophische Abhandlung (Tractatus Logico-Philosophicus, 1922), undermined the entire approach to logic that had inspired Russell’s great contributions to the philosophy of mathematics. It persuaded Russell that there were no “truths” of logic at all, that logic consisted entirely of tautologies, the truth of which was not guaranteed by eternal facts in the Platonic realm of ideas but lay, rather, simply in the nature of language. This was to be the final step in the retreat from Pythagoras and a further incentive for Russell to abandon technical philosophy in favour of other pursuits.\n\nDuring World War I Russell was for a while a full-time political agitator, campaigning for peace and against conscription. His activities attracted the attention of the British authorities, who regarded him as subversive. He was twice taken to court, the second time to receive a sentence of six months in prison, which he served at the end of the war. In 1916, as a result of his antiwar campaigning, Russell was dismissed from his lectureship at Trinity College. Although Trinity offered to rehire him after the war, he ultimately turned down the offer, preferring instead to pursue a career as a journalist and freelance writer. The war had had a profound effect on Russell’s political views, causing him to abandon his inherited liberalism and to adopt a thorough-going socialism, which he espoused in a series of books including Principles of Social Reconstruction (1916), Roads to Freedom (1918), and The Prospects of Industrial Civilization (1923). He was initially sympathetic to the Russian Revolution of 1917, but a visit to the Soviet Union in 1920 left him with a deep and abiding loathing for Soviet communism, which he expressed in The Practice and Theory of Bolshevism (1920).\n\nIn 1921 Russell married his second wife, Dora Black, a young graduate of Girton College, Cambridge, with whom he had two children, John and Kate. In the interwar years Russell and Dora acquired a reputation as leaders of a progressive socialist movement that was stridently anticlerical, openly defiant of conventional sexual morality, and dedicated to educational reform. Russell’s published work during this period consists mainly of journalism and popular books written in support of these causes. Many of these books—such as On Education (1926), Marriage and Morals (1929), and The Conquest of Happiness (1930)—enjoyed large sales and helped establish Russell in the eyes of the general public as a philosopher with important things to say about the moral, political, and social issues of the day. His public lecture “Why I Am Not a Christian,” delivered in 1927 and printed many times, became a popular locus classicus of atheistic rationalism. In 1927 Russell and Dora set up their own school, Beacon Hill, as a pioneering experiment in primary education. To pay for it, Russell undertook a few lucrative but exhausting lecture tours of the United States.\n\nDuring these years Russell’s second marriage came under increasing strain, partly because of overwork but chiefly because Dora chose to have two children with another man and insisted on raising them alongside John and Kate. In 1932 Russell left Dora for Patricia (“Peter”) Spence, a young University of Oxford undergraduate, and for the next three years his life was dominated by an extraordinarily acrimonious and complicated divorce from Dora, which was finally granted in 1935. In the following year he married Spence, and in 1937 they had a son, Conrad. Worn out by years of frenetic public activity and desiring, at this comparatively late stage in his life (he was then age 66), to return to academic philosophy, Russell gained a teaching post at the University of Chicago. From 1938 to 1944 Russell lived in the United States, where he taught at Chicago and the University of California at Los Angeles, but he was prevented from taking a post at the City College of New York because of objections to his views on sex and marriage. On the brink of financial ruin, he secured a job teaching the history of philosophy at the Barnes Foundation in Philadelphia. Although he soon fell out with its founder, Albert C. Barnes, and lost his job, Russell was able to turn the lectures he delivered at the foundation into a book, A History of Western Philosophy (1945), which proved to be a best-seller and was for many years his main source of income.\n\nIn 1944 Russell returned to Trinity College, where he lectured on the ideas that formed his last major contribution to philosophy, Human Knowledge: Its Scope and Limits (1948). During this period Russell, for once in his life, found favour with the authorities, and he received many official tributes, including the Order of Merit in 1949 and the Nobel Prize for Literature in 1950. His private life, however, remained as turbulent as ever, and he left his third wife in 1949. For a while he shared a house in Richmond upon Thames, London, with the family of his son John and, forsaking both philosophy and politics, dedicated himself to writing short stories. Despite his famously immaculate prose style, Russell did not have a talent for writing great fiction, and his short stories were generally greeted with an embarrassed and puzzled silence, even by his admirers.\n\nIn 1952 Russell married his fourth wife, Edith Finch, and finally, at the age of 80, found lasting marital harmony. Russell devoted his last years to campaigning against nuclear weapons and the Vietnam War, assuming once again the role of gadfly of the establishment. The sight of Russell in extreme old age taking his place in mass demonstrations and inciting young people to civil disobedience through his passionate rhetoric inspired a new generation of admirers. Their admiration only increased when in 1961 the British judiciary system took the extraordinary step of sentencing the 89-year-old Russell to a second period of imprisonment.\n\nWhen he died in 1970 Russell was far better known as an antiwar campaigner than as a philosopher of mathematics. In retrospect, however, it is possible to see that it is for his great contributions to philosophy that he will be remembered and honoured by future generations."}, {"url": "https://www.britannica.com/biography/Virginia-Woolf", "page_content": "spouse Leonard Woolf father Sir Leslie Stephen sister Vanessa Bell ...(Show more)\n\nIn addition to Mrs. Dalloway (1925) and To the Lighthouse (1927), she wrote the novels The Voyage Out (1915), Jacob’s Room (1922), Orlando (1928), and The Waves (1931). Her most famous essay was A Room of One’s Own (1929).\n\nShe was best known for her novels, especially Mrs. Dalloway (1925) and To the Lighthouse (1927). She also wrote pioneering essays on artistic theory, literary history, women’s writing, and the politics of power.\n\nWhile she is best known for her novels, especially Mrs. Dalloway (1925) and To the Lighthouse (1927), Woolf also wrote pioneering essays on artistic theory, literary history, women’s writing, and the politics of power. A fine stylist, she experimented with several forms of biographical writing, composed painterly short fictions, and sent to her friends and family a lifetime of brilliant letters.\n\nWhile Virginia was recovering, Vanessa supervised the Stephen children’s move to the bohemian Bloomsbury section of London. There the siblings lived independent of their Duckworth half brothers, free to pursue studies, to paint or write, and to entertain. Leonard Woolf dined with them in November 1904, just before sailing to Ceylon (now Sri Lanka ) to become a colonial administrator. Soon the Stephens hosted weekly gatherings of radical young people, including Clive Bell , Lytton Strachey , and John Maynard Keynes , all later to achieve fame as, respectively, an art critic, a biographer, and an economist. Then, after a family excursion to Greece in 1906, Thoby died of typhoid fever . He was 26. Virginia grieved but did not slip into depression . She overcame the loss of Thoby and the “loss” of Vanessa, who became engaged to Bell just after Thoby’s death, through writing. Vanessa’s marriage (and perhaps Thoby’s absence) helped transform conversation at the avant-garde gatherings of what came to be known as the Bloomsbury group into irreverent, sometimes bawdy repartee that inspired Virginia to exercise her wit publicly, even while privately she was writing her poignant “Reminiscences”—about her childhood and her lost mother—which was published in 1908. Viewing Italian art that summer, she committed herself to creating in language “some kind of whole made of shivering fragments,” to capturing “the flight of the mind.”\n\nThe Stephen family made summer migrations from their London town house near Kensington Gardens to the rather disheveled Talland House on the rugged Cornwall coast. That annual relocation structured Virginia’s childhood world in terms of opposites: city and country, winter and summer, repression and freedom, fragmentation and wholeness. Her neatly divided, predictable world ended, however, when her mother died in 1895 at age 49. Virginia, at 13, ceased writing amusing accounts of family news. Almost a year passed before she wrote a cheerful letter to her brother Thoby. She was just emerging from depression when, in 1897, her half sister Stella Duckworth died at age 28, an event Virginia noted in her diary as “impossible to write of.” Then in 1904, after her father died, Virginia had a nervous breakdown.\n\nBorn Virginia Stephen, she was the child of ideal Victorian parents. Her father, Leslie Stephen , was an eminent literary figure and the first editor (1882–91) of the Dictionary of National Biography. Her mother, Julia Jackson, possessed great beauty and a reputation for saintly self-sacrifice; she also had prominent social and artistic connections, which included Julia Margaret Cameron , her aunt and one of the greatest portrait photographers of the 19th century. Both Julia Jackson’s first husband, Herbert Duckworth, and Leslie’s first wife, a daughter of the novelist William Makepeace Thackeray , had died unexpectedly, leaving her three children and him one. Julia Jackson Duckworth and Leslie Stephen married in 1878, and four children followed: Vanessa (born 1879), Thoby (born 1880), Virginia (born 1882), and Adrian (born 1883). While these four children banded together against their older half siblings, loyalties shifted among them. Virginia was jealous of Adrian for being their mother’s favourite. At age nine, she was the genius behind a family newspaper, the Hyde Park Gate News, that often teased Vanessa and Adrian. Vanessa mothered the others, especially Virginia, but the dynamic between need (Virginia’s) and aloofness (Vanessa’s) sometimes expressed itself as rivalry between Virginia’s art of writing and Vanessa’s of painting.\n\nEarly fiction\n\nExplore the works and influence of Virginia Woolf See all videos for this article\n\nVirginia Stephen determined in 1908 to “re-form” the novel by creating a holistic form embracing aspects of life that were “fugitive” from the Victorian novel. While writing anonymous reviews for the Times Literary Supplement and other journals, she experimented with such a novel, which she called Melymbrosia. In November 1910, Roger Fry, a new friend of the Bells, launched the exhibit “Manet and the Post-Impressionists,” which introduced radical European art to the London bourgeoisie. Virginia was at once outraged over the attention that painting garnered and intrigued by the possibility of borrowing from the likes of artists Paul Cézanne and Pablo Picasso. As Clive Bell was unfaithful, Vanessa began an affair with Fry, and Fry began a lifelong debate with Virginia about the visual and verbal arts. In the summer of 1911, Leonard Woolf returned from the East. After he resigned from the colonial service, Leonard and Virginia married in August 1912. She continued to work on her first novel; he wrote the anticolonialist novel The Village in the Jungle (1913) and The Wise Virgins (1914), a Bloomsbury exposé. Then he became a political writer and an advocate for peace and justice.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nBetween 1910 and 1915, Virginia’s mental health was precarious. Nevertheless, she completely recast Melymbrosia as The Voyage Out in 1913. She based many of her novel’s characters on real-life prototypes: Lytton Strachey, Leslie Stephen, her half brother George Duckworth, Clive and Vanessa Bell, and herself. Rachel Vinrace, the novel’s central character, is a sheltered young woman who, on an excursion to South America, is introduced to freedom and sexuality (though from the novel’s inception she was to die before marrying). Woolf first made Terence, Rachel’s suitor, rather Clive-like; as she revised, Terence became a more sensitive, Leonard-like character. After an excursion up the Amazon, Rachel contracts a terrible illness that plunges her into delirium and then death. As possible causes for this disaster, Woolf’s characters suggest everything from poorly washed vegetables to jungle disease to a malevolent universe, but the book endorses no explanation. That indeterminacy, at odds with the certainties of the Victorian era, is echoed in descriptions that distort perception: while the narrative often describes people, buildings, and natural objects as featureless forms, Rachel, in dreams and then delirium, journeys into surrealistic worlds. Rachel’s voyage into the unknown began Woolf’s voyage beyond the conventions of realism.\n\nWoolf’s manic-depressive worries (that she was a failure as a writer and a woman, that she was despised by Vanessa and unloved by Leonard) provoked a suicide attempt in September 1913. Publication of The Voyage Out was delayed until early 1915; then, that April, she sank into a distressed state in which she was often delirious. Later that year she overcame the “vile imaginations” that had threatened her sanity. She kept the demons of mania and depression mostly at bay for the rest of her life.\n\nIn 1917 the Woolfs bought a printing press and founded the Hogarth Press, named for Hogarth House, their home in the London suburbs. The Woolfs themselves (she was the compositor while he worked the press) published their own Two Stories in the summer of 1917. It consisted of Leonard’s Three Jews and Virginia’s The Mark on the Wall, the latter about contemplation itself.\n\nSince 1910, Virginia had kept (sometimes with Vanessa) a country house in Sussex, and in 1916 Vanessa settled into a Sussex farmhouse called Charleston. She had ended her affair with Fry to take up with the painter Duncan Grant, who moved to Charleston with Vanessa and her children, Julian and Quentin Bell; a daughter, Angelica, would be born to Vanessa and Grant at the end of 1918. Charleston soon became an extravagantly decorated, unorthodox retreat for artists and writers, especially Clive Bell, who continued on friendly terms with Vanessa, and Fry, Vanessa’s lifelong devotee.\n\nVirginia had kept a diary, off and on, since 1897. In 1919 she envisioned “the shadow of some kind of form which a diary might attain to,” organized not by a mechanical recording of events but by the interplay between the objective and the subjective. Her diary, as she wrote in 1924, would reveal people as “splinters & mosaics; not, as they used to hold, immaculate, monolithic, consistent wholes.” Such terms later inspired critical distinctions, based on anatomy and culture, between the feminine and the masculine, the feminine being a varied but all-embracing way of experiencing the world and the masculine a monolithic or linear way. Critics using these distinctions have credited Woolf with evolving a distinctly feminine diary form, one that explores, with perception, honesty, and humour, her own ever-changing, mosaic self.\n\nProving that she could master the traditional form of the novel before breaking it, she plotted her next novel in two romantic triangles, with its protagonist Katharine in both. Night and Day (1919) answers Leonard’s The Wise Virgins, in which he had his Leonard-like protagonist lose the Virginia-like beloved and end up in a conventional marriage. In Night and Day, the Leonard-like Ralph learns to value Katharine for herself, not as some superior being. And Katharine overcomes (as Virginia had) class and familial prejudices to marry the good and intelligent Ralph. This novel focuses on the very sort of details that Woolf had deleted from The Voyage Out: credible dialogue, realistic descriptions of early 20th-century settings, and investigations of issues such as class, politics, and suffrage.\n\nWoolf was writing nearly a review a week for the Times Literary Supplement in 1918. Her essay “Modern Novels” (1919; revised in 1925 as “Modern Fiction”) attacked the “materialists” who wrote about superficial rather than spiritual or “luminous” experiences. The Woolfs also printed by hand, with Vanessa Bell’s illustrations, Virginia’s Kew Gardens (1919), a story organized, like a Post-Impressionistic painting, by pattern. With the Hogarth Press’s emergence as a major publishing house, the Woolfs gradually ceased being their own printers.\n\nIn 1919 they bought a cottage in Rodmell village called Monk’s House, which looked out over the Sussex Downs and the meadows where the River Ouse wound down to the English Channel. Virginia could walk or bicycle to visit Vanessa, her children, and a changing cast of guests at the bohemian Charleston and then retreat to Monk’s House to write. She envisioned a new book that would apply the theories of “Modern Novels” and the achievements of her short stories to the novel form. In early 1920 a group of friends, evolved from the early Bloomsbury group, began a “Memoir Club,” which met to read irreverent passages from their autobiographies. Her second presentation was an exposé of Victorian hypocrisy, especially that of George Duckworth, who masked inappropriate, unwanted caresses as affection honouring their mother’s memory.\n\nIn 1921 Woolf’s minimally plotted short fictions were gathered in Monday or Tuesday. Meanwhile, typesetting having heightened her sense of visual layout, she began a new novel written in blocks to be surrounded by white spaces. In “On Re-Reading Novels” (1922) Woolf argued that the novel was not so much a form as an “emotion which you feel.” In Jacob’s Room (1922) she achieved such emotion, transforming personal grief over the death of Thoby Stephen into a “spiritual shape.” Though she takes Jacob from childhood to his early death in war, she leaves out plot, conflict, even character. The emptiness of Jacob’s room and the irrelevance of his belongings convey in their minimalism the profound emptiness of loss. Though Jacob’s Room is an antiwar novel, Woolf feared that she had ventured too far beyond representation. She vowed to “push on,” as she wrote Clive Bell, to graft such experimental techniques onto more-substantial characters."}, {"url": "https://www.goodreads.com/author/list/4249133.John_Russell_Reynolds", "page_content": "Showing 27 distinct works.\n\nsort by popularity original publication year title average rating number of pages\n\nAddress in Medicine, Delivered at the Meeting of the British Medical Association, 1874\n\nA System of Medicine, Vol. 2 of 3: Diseases of the Respiratory and Circulatory Systems\n\nThe Diagnosis of Diseases of the Brain, Spinal Cord, Nerves, and Their Appendages\n\nYes and No: Or, Glimpses of the Great Conflict\n\nAddress in medicine, delivered at the meeting of the British medical association, 1874 1874 [Leather Bound]\n\nAddress in Medicine, Delivered at the Meeting of the British Medical Association, 1874\n\nCriminal Lunatics: Are They Responsible? An Examination Of 'the Plea Of Insanity', A Letter\n\nLectures on the Clinical Uses of Electricity: Delivered in University College Hospital\n\nThe Harveian Oration: Delivered at the Royal College of Physicians, London, On October 18, 1884 / by J. Russell Reynolds\n\nTables For The Diagnosis Of Diseases Of The Brain (1857)\n\nEpilepsy; Its Symptoms, Treatment, and Relation to Other Chronic Convulsive Diseases\n\nThe Diagnosis of diseases of the brain, spinal cord, nerves, and their appendages 1855 [Leather Bound]\n\n* Note: these are all the books on Goodreads for this author. To add more books, click here"}, {"url": "https://www.bookdepository.com/author/John-Russell-Reynolds", "page_content": "We are sorry to let you know that Book Depository has now closed.\n\nWe will continue to deliver orders placed before midday (12pm BST) on 26 April and will provide support for any order issues until 23 June 2023.\n\nFrom all of us at Book Depository we want to say 'thank you'. Delivering your favourite reads to you since 2007 has been a pleasure.\n\nYou’ll find more info in our FAQs."}, {"url": "https://cacm.acm.org/news/163901-john-reynolds-1935-2013/fulltext", "page_content": "ACM News John Reynolds, 1935 – 2013\n\nJohn C. Reynolds, a computer scientist focused on the logical foundations of programs and programming languages, died on April 28. Credit: Carnegie Mellon University\n\nJohn C. Reynolds, a professor of computer science at Carnegie Mellon University (CMU), died April 28 following a heart attack.\n\nReynolds received his Ph.D. in theoretical physics from Harvard University in 1961. While working at Argonne National Laboratory, he came to realize that his passion was for computation, according to Randy Bryant, dean of the School of Computer Science and University Professor of Computer Science at CMU, who said that, as a result, Reynolds \"became a very successful computer scientist, focusing on the logical foundations of programs and programming languages.\" He served as a professor of Information Science at Syracuse University from 1970 to 1986 and then joined CMU as a member of the faculty of the Computer Science Department (CSD). He retired in 2012, but continued to serve CSD as professor emeritus.\n\nHe also had held visiting positions at Aarhus University (Denmark), University of Edinburgh, Imperial College London, Microsoft Research (Cambridge), and Queen Mary, University of London (UK).\n\nAccording to his CSD homepage, Reynolds'research focused \"on the design of programming languages and languages for specifying program behavior, mathematical tools for defining the semantics of such languages, and methods for proving that programs meet their specifications.\" A secondary area of interest was \"the semantics of types. The last 15 years have seen the discovery of a variety of type systems that have vastly enlarged our notions of what types are and how they might be used. My goal is to understand the meaning of these systems and to find a general concept of type of which they are all instances.\"\n\nIn addition, Reynolds was interested \"in the design, definition, and proof methodology of Algol-like languages, which combine imperative constructs with a powerful procedure mechanism, while retaining the concepts of block structure and local variables.\"\n\nRobert Harper, also a computer science professor in CSD, described Reynolds as \"a mentor and an inspiration for many of us, providing a fine example of what it means to be scientist, a scholar, and a gentleman. John's meticulous attention to detail and uncompromising insistence on excellence exemplifies the very best qualities of a scientist that we all seek to emulate.\" In a 2010 letter nominating Reynolds for the Japan Prize, Harper wrote, \"The profound influence of Reynolds' work in academic computer science is now being felt in the computer industry. The concept of generic types in the Java and C# programming languages originates in Reynolds' 1978 paper on the polymorphic λ-calculus. Verification tools for imperative programs are now used widely in the software industry, drawing heavily on Reynolds's work on program specification and verification, in particular the sharply original concept of separation logic, which permits modular verification of large software systems by controlling interference among its components.\"\n\nCMU's Bryant said, \"John has made many important contributions over his career. Interestingly, his 2002 work on separation logic, done jointly with Peter O'Hearn and others, has been especially prominent. Separation logic provides a formal way to reason about what we might think of as 'normal programs,' i.e., ones that operate by changing the values stored in memory, but where memory is partitioned into independent blocks, and so we can reason about different program components independently. I can only hope that the work I do at age 67 would be counted among my best.\"\n\nReynolds had been on the editorial boards of journals such as the Communications of the ACM and the Journal of the ACM. In 2001, he was appointed a Fellow of the ACM. He received the ACM SIGPLAN Programming Language Achievement Award in 2003, and the Lovelace Medal from the British Computer Society in 2010.\n\nAdded Bryant, \"We will also remember John for this cheerful spirit, his high ethical standards, and his deep intellect. He will very much be missed.\"\n\nNo entries found"}, {"url": "https://kids.britannica.com/students/article/Jason-Reynolds/630934", "page_content": "(born 1983). American author Jason Reynolds wrote books for young adults. His work combined gritty scenes—including instances of violence and bullying—with a touch of humor. His books won multiple awards, and some were named finalists (runners-up) for the Coretta Scott King Award , the National Book Award, and the Newbery Medal . In 2020 Reynolds was named the Library of Congress’s National Ambassador for Young People’s Literature.\n\nReynolds was born on December 6, 1983, in Washington, D.C., but grew up across the border in Oxon Hill, Maryland. He began writing poetry when he was nine years old after listening to the rhyme and rhythm of rap music . He was especially interested in the lyrics of Queen Latifah . At the same time Reynolds quit reading books for several years since he could not find any relevant to his upbringing in a poor, Black community. Eventually, he discovered African American authors such as Richard Wright and Zora Neale Hurston . In 2005 Reynolds received a bachelor’s degree in English from the University of Maryland, College Park.\n\nCareer\n\nAfter graduation Reynolds moved to Brooklyn, New York, with his friend Jason Griffin. Together they published the autobiographical My Name Is Jason. Mine Too (2009). Reynolds wrote the verse and Griffin contributed artwork. It was not a financial success, so Reynolds took odd jobs to support himself. Although discouraged, he continued to write.\n\nReynolds’s first published young adult novel was When I Was the Greatest (2014). It is a story about friendship and family and protecting the bonds that form between people. Reynolds began to write prolifically after that and had several novels published within the next few years. In 2015 he published All American Boys and The Boy in the Black Suit. In All American Boys a Black teenager is beaten by a white policeman, and a white teenage witness has to decide if he will speak out. Meanwhile, the community begins to take sides. Reynolds wrote the book with Brendan Kiely. The Boy in the Black Suit examines a low point in the life of a 17-year-old boy and his subsequent friendship with a girl who helps him cope. Reynolds’s book As Brave As You (2016) won the Kirkus Award for Young Readers’ Literature. The book explores family relationships as a young boy and his brother spend the summer with their grandparents.\n\nReynolds’s Track series follows some middle-school students on a track team. Books in the series include Ghost (2016), Patina (2017), and Sunny and Lu (both 2018). Meanwhile, Reynolds wrote Long Way Down (2017), a novel in verse. It is a story about a teenager who has to decide if he is going to avenge the killing of his brother or stop the cycle of violence. For Every One (2018) is a letter written as a long poem that encourages people to define their dreams and, through struggle, make them a reality. Reynolds first performed the work in public before publishing it in book form. He returned to fiction in Look Both Ways (2019), which recounts the adventures of 10 groups of kids as they leave school. Reynolds then collaborated with Ibram X. Kendi on the book Stamped: Racism, Antiracism, and You (2020), a young-adult version of Kendi’s Stamped from the Beginning: The Definitive History of Racist Ideas in America (2016). In 2022 Reynolds again teamed up with Jason Griffin on Ain’t Burned All the Bright. The book, with Reynolds’s verse and Griffin’s collage artwork, revolves around Black life in America."}]}