{"Tathagata Satpathy was a journalist and editor of the Odia daily Dharitri.": [{"url": "https://tathagatasatpathy.com/site/Biography", "page_content": "Biography :\n\nCurriculum Vitae\n\nTathagata Satpathy\n\nDOB: April 01, 1956 at Cuttack, Orissa, India\n\nEducation\n\nEducated at Sri Aurobindo Center of Education, Pondicherry, South India.\n\nSubjects studied English, Philosophy and French\n\nCan speak English, Oriya, Hindi, French\n\nOccupation\n\nJournalism & Publishing Editor Dharitri, published from Bhubaneswar and Sambalpur\n\nDharitri is the first Oriya daily to have an online presence.\n\nThe newspaper is 16 paged with a reach of 12,50,000 readers and has local, national and international news along with views that promote thoughts of a free and liberal world order\n\nElected Representative\n\nHas been a Member of:\n\nOrissa Legislative Assembly (1990-95)\n\nOrissa Legislative Assembly (1990-95) 12th Lok Sabha (1998-99)\n\n(1998-99) 14th Lok Sabha (2004-09)\n\n(2004-09) 15th Lok Sabha (2009-14)\n\n(2009-14) 16th Lok Sabha (2014-present)\n\n(2014-present) Parliamentary Standing Committee on Information Technology\n\nParliamentary Standing Committee on Coal & Steel\n\nParliamentary Standing Committee on Privileges\n\nOther positions held\n\nMember of Marine Product Export Development Authority, India (MPEDA)\n\nPresident of Chacrateertha Bikash Parishad, Puri, Orissa: an organization focused on creating public awareness on the importance of environment protection and waste management\n\nWorking President Akhshyam Kalyan Samiti, Dhenkanal, Orissa: a voluntary organization aiding poor physically challenged children. This organization provides free accommodation, food, education and vocational training for 236 deaf & dumb and blind girls and boys\n\nFounder and President DSM College, Koilpangi, Orissa: a twin stream higher educational institution (Arts and Science) imparting value added education to approx 400 students.\n\nAdvisor for ‘Nrutingyana’: an NGO providing a platform for talented young people in the state of Orissa in the sphere of dance and theatre\n\nActivities\n\nConvenor of ‘UrJa-Itz My World’: an annual meet of over 120 girls representing various colleges from all parts of Orissa. UrJa provides a platform to these students to interact not only with each other but also with eminent personalities excelling in different spheres from India and abroad. The idea of ‘UrJa’ is to imbibe a spirit of competitive individualism that would help in making the participating girls worth and responsible citizens of a democratic society\n\nConferences attended\n\nRepresenting India in Parliamentarians for Global Action, 1998 (New York)\n\nRepresenting Indian Editors in conference on peace initiatives in South East Asia, 2002 (Karachi, Pakistan)\n\nRepresenting Finance Committee of Indian Parliament at the UN (New York)\n\nInterests\n\nFinance, Trade\n\nProtection of natural resources (forest, mines, water reserves etc) in developing economies\n\nCampaigning for new laws on crime against women\n\nInformation Technology and Telecom reforms\n\nHolder of valid Private Pilot’s Licence with over 300 hours of single engine experience\n\nShort CV:\n\nTATHAGATA SATPATHY\n\nEDITOR, DHARITRI\n\nMEMBER OF PARLIAMENT, 16TH LOK SABHA\n\nTathagata Satpathy is editor of Dharitri, an Oriya-language daily newspaper published from Bhubaneswar and Sambalpur. The paper was the first Oriya daily to publish an internet edition. Mr Satpathy was a member of the 12th, 14th and 15th Lok Sabha (lower house of parliament) between 1998 and 2009 and served as a member of the Orissa Legislative Assembly from 1990 to 1995. He is presently the elected representative from Dhenkanal, Orissa in the 16th Lok Sabha.\n\nHis was a member of the Parliamentary Standing Committee on Information Technology, comprising the departments of information technology, posts, information and broadcasting, and telecommunications. He has served as a member of the Marine Products Export Development Authority, India. He was also president of Chacrateertha Bikash Parishad in Puri, Orissa, an organisation focused on creating public awareness of the importance of environmental protection and waste management, and working president of Akhshyam Kalyan Samiti in Dhenkanal, Orissa, a voluntary organisation that provides free accommodation, food, education and vocational training for 236 physically challenged children.\n\nMr Satpathy is founder and president of DSM College in Koilpangi, Orissa, a twin-stream (arts and science) higher-education institution imparting value-added education to approximately 400 students. He is also an adviser to Nrutingyana, a non-governmental organisation that provides a platform for talented young people in the state of Orissa in the sphere of dance and theatre; and convenor of UrJa-Itz My World, an annual meeting of more than 120 girls representing various colleges from all parts of Orissa.\n\nMr Satpathy was educated at Sri Aurobindo Center of Education, Pondicherry, South India."}, {"url": "https://peoplepill.com/people/tathagata-satapathy/", "page_content": "Tathagata Satpathy (born 1 April 1956) was a member of the 12th , 14th, 15th and 16th Lok Sabha of India. He represented the Dhenkanal constituency of Odisha, and was re-elected for the fourth time in 2014. He was a member of the Biju Janata Dal (BJD) political party, and the party's chief whip in the Lok Sabha. He took voluntary retirement from politics in March 2019. He is not an active politician ever since.\n\nLife and work\n\nTathagata Satpathy is the younger son of former Odisha Chief Minister Nandini Satpathy and Devendra Satpathy. He is the owner and editor of the daily Odia newspaper, Dharitri, and the English daily, Orissa Post.\n\nIn 2000, Satpathy joined the Orissa Gana Parishad ( a non political outfit), and served as its secretary general. After Naveen Patnaik got elected in 2000, Satpathy had used his newspaper Dharitri to criticise his policies which he does even now. In March 2004, just before the 2004 Indian general election, Satpathy reconciled with BJD. He said that he was forced to quit OGP due its changing into a political party as also forming an alliance with Janaki Ballabh Patnaik-led Indian National Congress (INC).\n\nHis nephew Suparno Satpathy had unsuccessfully contested him in 2014 for the office of MP Lok Sabha, Dhenkanal.\n\nIn March 2015, Tathagata Satpathy became the first Indian Member of Parliament to hold an official \"Ask Me Anything\" session on the content-sharing website Reddit. In April, Satpathy came forward in support of net neutrality, after the Telecom Regulatory Authority of India (TRAI) come out with a consultation paper on over-the-top (OTT) messaging services. In December 2015, Satpathy had supported a bill to decriminalise homosexuality. The bill was introduced by INC leader Shashi Tharoor. But, it was defeated with 71 against, 1 abstaining and 24 in favour.\n\nViews and opinions\n\nOn net neutrality\n\nIn March 2014, the Telecom Regulatory Authority of India (TRAI) released a formal consultation paper on over-the-top (OTT) messaging services and whether telecom operators should be allowed to charge separately for some messaging apps. Soon afterwards, Tathagata Satpathy wrote an open letter to TRAI stating his support for net neutrality. In the letter, he said such a policy would hinder the Digital India project and kill new startups. He said that he used such apps to interact with his constituency and this policy will hinder his functioning as a representative.\n\nOn legalisation of cannabis\n\nTathagata Satpathy has criticised the ban on cannabis in India, while pointing out the long history of its usage as a ritual and recreational intoxicant. He has said that cannabis was banned in India while alcohol was not, because of \"an elitist bias\" as cannabis was a poor man's drug. He has said the addiction depends on person's character and not on the intoxicant. He has suggested an amendment to the Narcotic Drugs and Psychotropic Substances Act, 1985 to allow recreational and medicinal usage of marijuana. During his \"Ask Me Anything\" session on Reddit in March 2015, Satpathy admitted that he smoked cannabis when he was young. In August 2015, during the monsoon session of the Parliament, he proposed the decriminalisation of cannabis. In December 2015, he repeated his proposal during the winter session, saying that banning cannabis has forced villagers to turn to alcohol.\n\nOn homosexuality and moral policing\n\nTathagata Satpathy has condemned the Section 377 of the Indian Penal Code, which criminalises homosexuality in India, calling it \"archaic\" and called for its repeal. He had supported a bill introduced by INC MP Shashi Tharoor to decriminalise homosexuality during the 2015 winter session of the Parliament. When the bill was defeated, Satpathy called it a very sad day. Satpathy has also condemned moral policing and called for a repeal of laws banning pornography in India.\n\nOn privacy and Aadhaar\n\nTathagata Satpathy has raised concerns that the Aadhaar project could be used for mass surveillance or ethnic cleansing in the future. He has questioned why a new identity card project was created despite having several identity cards systems. He has also criticised the decision to present the Aadhaar Bill, 2016 as a money bill. He pointed out that although the bill allows the sharing of biometric under circumstances of national security, there was no concrete definition of national security included in the bill.\n\nOn religious laws and missionaries\n\nSatpathy supports the implementation of a Uniform Civil Code in India. He has criticised those current laws which are based on various religions, saying that the world is moving beyond religious scriptures and such laws only divide the society. He has also said that a lot of faith-based foreign aid comes to Odisha through missionaries. They offer the poor Dalits free education and jobs, this results in mass conversions to Christianity. Satpathy has said that politicians should use the dictionary definition of secularism to avoid confusion.\n\nOther opinions\n\nSatpathy has supported the inclusion of Members of Parliament under the Jan Lokpal Bill to curb corruption. In December 2015, he criticised the Arbitration and Conciliation (Amendment) Bill, 2015 during a debate, saying that the government was favouring big corporations with such laws. He has also criticised the Sansad Adarsh Gram Yojana calling it flawed and that it looks good only on paper. He said it forces him to choose only 8 villages from his constituency for development out of 3000. Satpathy has opposed the proposal to make Hindi the national language.\n\nSatpathy has criticised the construction of new nuclear power plants in India, claiming that most of the world was now moving away from nuclear energy. He has also claimed that Areva nuclear firm of France sold outdated technology to Maharashtra. He has also said that the centre should release the data regarding the safety of nuclear power plants as they are in other countries."}, {"url": "https://www.livemint.com/Politics/cEdbfFmpXQ6GNImduzrRTI/Who-is-Tathagata-Satpathy.html", "page_content": "New Delhi: Amidst the cacophony of aggressive voices from both the government and the opposition during the debate on the Jawaharlal Nehru University row and the death of Hyderabad University student Rohith Vemula, the speech by senior Biju Janata Dal (BJD) leader Tathagata Satpathy came as a breath of fresh air.\n\n“I am heartbroken to say that the youth of the country doesn’t deserve us. We are the most undeserving set of people to be in this House today,\" Satpathy, who represents Dhenkanal Lok Sabha constituency in the Lok Sabha, said.\n\nHe went on to say: “I am not interested in taking sides with any of these parties. I am here to hear who has a word of solace and point of solution to the problems that the nation is facing today. Is it only votes that matter? Is it just us and them?\"\n\nHis speech went viral on social media with people praising him for taking the matter above politics. This is not the first time that Satpathy has stood out among other parliamentarians. On several other occasions in the past, he has articulated his views on women’s reservation, crimes against women, net neutrality, Section 377 and even legalisation of cannabis.\n\nDuring an AMA (ask me anything) session on Reddit last year, Satpathy admitted that he had smoked cannabis. “While in college, I have smoked (and unlike Bill Clinton have inhaled) cannabis many a times. In villages of Orissa, many people openly smoke and, as their representative, I am not entitled to be judgmental.\"\n\nSpeaking to Mint after his speech in Parliament, Satpathy said he speaks his mind, does not fear controversies and believes in change through debate.\n\nThe 59-year-old, also the chief whip of the BJD, is the son of Odisha’s only woman chief minister Nandini Satpathy. He is currently serving his fourth term as a member of the lower house of Parliament. A journalist by profession, Satpathy is the owner and editor of leading Odia daily Dharitri and English daily Orissa Post.\n\n“We have been harping on rights for far too long. Time has changed to expose the wrongs,\" Satpathy said. He added that it is time politicians start talking truthfully and make citizens conscious of their duties and responsibilities. “India is going through a churning. I am an optimist. I see good times ahead.\"\n\nEven during the monsoon session last year, when 25 Congress MPs were suspended, Satpathy spoke up in the lower house and made a strong plea against taking up any legislative business in the absence of MPs from several opposition parties, including Congress.\n\nThough Satpathy does not have a personal Twitter or Facebook account, his office runs a Twitter account on his behalf at @SatpathyLive. “I am more a print media guy. I regret to say that I am not very social media savvy, though I am very social. I love to sit down with my friends and chat,\" he said.\n\nHis attendance record in the current Lok Sabha has been 93% as opposed to an average of 83% for parliamentarians. In the 16th Lok Sabha, he has participated in a total of 34 debates and asked three questions, according to the New Delhi-based PRS Legislative Research.\n\n“Parliament is partisan when it comes to giving more time and importance to leaders from parties. Someone like Satpathy would be heard and much more noticed outside Parliament than inside. His is a sane and rational voice. The point that he made on Tuesday about us and them is very critical. The way we are, our politicians are, there seems to be no middle ground and in that way he was making a very important statement,\" said Manisha Priyam, a New Delhi-based political analyst."}, {"url": "https://www.ndtv.com/india-news/bjds-tathagata-satpathy-quits-active-politics-2003202", "page_content": "Mr Satpathy was the owner and editor of the Odia daily newspaper Dharitri and English daily Orissa Post.\n\nSenior Biju Janata Dal (BJD) MP Tathagata Satpathy on Tuesday said he will not contest in the coming Lok Sabha elections.\n\n\"I am not going to stay in any political party. I am returning to my old profession of journalism,\" said Mr Satpathy.\n\n\"Since Biju Patnaik had brought me to politics, I announce not to contest elections on his birth anniversary today,\" he added.\n\nMr Satpathy had sought time to meet Odisha Chief Minister and BJD president Naveen Patnaik to apprise him about his decision.\n\nMr Satpathy, who represents the Dhenkanal Lok Sabha constituency, was re-elected for the fourth time in 2014. He is the son of former Odisha Chief Minister Nandini Satpathy.\n\nHe also the owner and editor of the Odia daily newspaper Dharitri and English daily Orissa Post."}, {"url": "https://indianexpress.com/article/india/bjd-mp-tathagata-satpathy-quits-active-politics-to-refocus-on-journalism-5612355/", "page_content": "Four-time MP and BJD’s chief whip in the outgoing 16th Lok Sabha Tathagata Satpathy on Tuesday announced his retirement from active politics.\n\nThe MP from Dhenkanal said he would not contest the upcoming Lok Sabha elections.\n\nThe reason, he said, was his desire to go back to journalism. “There is a need for more fearless voices in journalism now,” Satpathy, owner and editor of leading Odia-language newspaper Dharitri, told The Indian Express.\n\n“Distancing myself from politics to refocus on journalism,” Satpathy said. “I realised that politics is not the only means to support people. Social leadership is lacking in this country.”\n\nHe expressed gratitude to Chief Minister and BJD leader Naveen Patnaik for his support throughout his terms.\n\nSatpathy was a member of the Odisha assembly from 1990-95. He was also a member of the 12th, 14th and 15th Lok Sabha.\n\nThe 62-year-old leader said he wanted to give an opportunity to youth to come up in politics. “Also a dire need to leave space for young change makers and policy formulators,” he said.\n\nAdvertisement\n\nInside the BJD, Satpathy was known to speak his mind on many occasions. At a party event in 2017, he criticised the BJD for its factionalism.\n\n“We lack mutual understanding. Workers are part of factions. Legislators and MPs are part of groups. This groupism is hurting us individually. If we do not take care, we will be wiped out,” Satpathy had said.\n\nWhile Patnaik supported many policies of the Centre, such as demonetisation, Satpathy had a different view. “If we do not take an open and clear stand against the BJP and we always play both sides, then people will also say, why should I not write to the postmaster instead of using the postman? There will be no pre-poll or post-poll alliance needs to be clearly stated by the top rung, not just by me,” he said in the same speech.\n\nAdvertisement\n\nSatpathy built a reputation as a parliamentarian of wit. In a Lok Sabha speech on mob violence, he said, “Gau rakshaks running around in the countryside are probably not aware that most cows in India are actually Jersey cows. They are not their mothers.”\n\nHe has also protested against what he termed the hegemony of the Hindi language over regional languages, such as Odia.\n\nSatpathy is the younger son of Odisha’s only woman chief minister Nandini Satpathy."}, {"url": "https://wiki.alquds.edu/?query=Tathagata_Satpathy", "page_content": "Indian politician\n\nTathagata Satpathy (born 1 April 1956) was a member of the 12th, 14th, 15th and 16th Lok Sabha of India. He represented the Dhenkanal constituency of Odisha, and was re-elected for the fourth time in 2014. He was a member of the Biju Janata Dal (BJD) political party, and the party's chief whip in the Lok Sabha. He took voluntary retirement from politics in March 2019. He is not an active politician ever since.\n\nLife and work [ edit ]\n\nTathagata Satpathy is the second son of former Odisha Chief Minister Nandini Satpathy and Devendra Satpathy.[1][2] He is the owner and editor of the daily Odia newspaper, Dharitri, and the English daily, Orissa Post.[3][2]\n\nTathagata educated at St. Columba's School in New Delhi and Sri Aurobindo International Centre of Education, Pondicherry, he has studied Philosophy, English and French. He had done his mother language, Oriya, by self study.\n\nTathagata entered active politics in the mid 70s as a teenager opposing the Emergency clamped by the Indian National Congress (INC).[4].\n\nWhile both his parents were long time Congress members, Tathagata has been opposed to that political party since before his career in electoral politics began early.\n\nHe joined active politics in the late 1980s when Sri Biju Patnaik took him into the Janata Party and he got elected to the Odisha Legislative Assembly and became an MLA in 1990. While his party kept changing its name from Janata Party to Janata Dal and later Biju Janata Dal, but he never changed his party.\n\nHe went on to become a Four term Member of Parliament till 2019 by winning the Dhenkanal-Angul Lok Sabha seat in 1998, 2004, 2009 and 2014 general elections.\n\nHis nephew Suparno Satpathy had unsuccessfully contested him in 2014 for the office of MP Lok Sabha, Dhenkanal.\n\nIn March 2015, Tathagata Satpathy became the first Indian Member of Parliament to hold an official \"Ask Me Anything\" session on the content-sharing website Reddit.[3] In April, Satpathy came forward in support of net neutrality, after the Telecom Regulatory Authority of India (TRAI) come out with a consultation paper on over-the-top (OTT) messaging services.[5] In December 2015, Satpathy had supported a bill to decriminalise homosexuality. The bill was introduced by INC leader Shashi Tharoor. But, it was defeated with 71 against, 1 abstaining and 24 in favour.[6]\n\nViews and opinions [ edit ]\n\nOn net neutrality [ edit ]\n\nIn March 2014, the Telecom Regulatory Authority of India (TRAI) released a formal consultation paper on over-the-top (OTT) messaging services and whether telecom operators should be allowed to charge separately for some messaging apps.[7] Soon afterwards, Tathagata Satpathy wrote an open letter to TRAI stating his support for net neutrality. In the letter, he said such a policy would hinder the Digital India project and kill new startups. He said that he used such apps to interact with his constituency and this policy will hinder his functioning as a representative.[8][9]\n\nOn legalisation of cannabis [ edit ]\n\nTathagata Satpathy has criticised the ban on cannabis in India, while pointing out the long history of its usage as a ritual and recreational intoxicant. He has said that cannabis was banned in India while alcohol was not, because of \"an elitist bias\" as cannabis was a poor man's drug. He has said the addiction depends on person's character and not on the intoxicant. He has suggested an amendment to the Narcotic Drugs and Psychotropic Substances Act, 1985 to allow recreational and medicinal usage of marijuana.[10] During his \"Ask Me Anything\" session on Reddit in March 2015, Satpathy admitted that he smoked cannabis when he was young.[3][11] In August 2015, during the monsoon session of the Parliament, he proposed the decriminalisation of cannabis.[12] In December 2015, he repeated his proposal during the winter session, saying that banning cannabis has forced villagers to turn to alcohol.[13][14]\n\nOn homosexuality and moral policing [ edit ]\n\nTathagata Satpathy has condemned the Section 377 of the Indian Penal Code, which criminalises homosexuality in India, calling it \"archaic\" and called for its repeal.[15] He had supported a bill introduced by INC MP Shashi Tharoor to decriminalise homosexuality during the 2015 winter session of the Parliament.[16] When the bill was defeated, Satpathy called it a very sad day.[17] Satpathy has also condemned moral policing and called for a repeal of laws banning pornography in India.[15]\n\nOn privacy and Aadhaar [ edit ]\n\nTathagata Satpathy has raised concerns that the Aadhaar project could be used for mass surveillance or ethnic cleansing in the future. He has questioned why a new identity card project was created despite having several identity cards systems. He has also criticised the decision to present the Aadhaar Bill, 2016 as a money bill. He pointed out that although the bill allows the sharing of biometric under circumstances of national security, there was no concrete definition of national security included in the bill.[18]\n\nOn religious laws and missionaries [ edit ]\n\nSatpathy supports the implementation of a Uniform Civil Code in India. He has criticised those current laws which are based on various religions, saying that the world is moving beyond religious scriptures and such laws only divide the society.[15] He has also said that a lot of faith-based foreign aid comes to Odisha through missionaries. They offer the poor Dalits free education and jobs, this results in mass conversions to Christianity.[19] Satpathy has said that politicians should use the dictionary definition of secularism to avoid confusion.[20]\n\nOther opinions [ edit ]\n\nSatpathy has supported the inclusion of Members of Parliament under the Jan Lokpal Bill to curb corruption.[21] In December 2015, he criticised the Arbitration and Conciliation (Amendment) Bill, 2015 during a debate, saying that the government was favouring big corporations with such laws.[22] He has also criticised the Sansad Adarsh Gram Yojana calling it flawed and that it looks good only on paper. He said it forces him to choose only 8 villages from his constituency for development out of 3000.[23] Satpathy has opposed the proposal to make Hindi the national language.[20]\n\nSatpathy has criticised the construction of new nuclear power plants in India, claiming that most of the world was now moving away from nuclear energy. He has also claimed that Areva nuclear firm of France sold outdated technology to Maharashtra. He has also said that the centre should release the data regarding the safety of nuclear power plants as they are in other countries.[24][25]\n\nSee also [ edit ]\n\nReferences [ edit ]"}, {"url": "https://indianexpress.com/article/political-pulse/tathagata-satpathy-interview-cong-defamation-rahul-gandhi-8542406/", "page_content": "With Congress leader Rahul Gandhi convicted of criminal defamation last month, and subsequently disqualified as Lok Sabha MP, there have been calls for a review of the criminal defamation legislation in India. It is not the first time.\n\nIn 2016, then Biju Janata Dal (BJD) MP Tathagata Satpathy moved a Private Member’s Bill in the Lok Sabha to decriminalise defamation — the Protection of Speech and Reputation Bill (commonly known as the “Speech Bill”). Satpathy, who is now the editor of Odia daily Dharitri, speaks to The Indian Express about what prompted him to introduce the Bill, its features, the response of other parties, and the effect criminal defamation has in today’s political climate. Excerpts:\n\nAs an editor, I had about 87 defamation cases filed against me. In Odisha, you have a law that women don’t have to deposit money if they want to file a defamation case. Normally, if you want to file a defamation case you have to deposit a certain percentage of what you claim in court. What happens if you level an allegation or publish a story against the police officials and bureaucrats in the newspapers is that they will get their wives or mothers or sisters to file a case against you. Even if you have enough evidence against them, they will file. Eventually, you will get cleared — in my case, I won all the cases if not in the lower court, then in the higher court. But it’s harassment.\n\nSo, partly, my Bill was driven by my personal experiences. Because two proceedings, civil and criminal, for the same offence do not seem justified to me. If you look at the global picture, the criminal aspect of the defamation case is not there in any democratic country. The last one I know that had it was Australia but they also removed it a few years ago. In most countries, it’s only the civil part. My simple counter was how can we prosecute twice for the same offence?\n\nI sought the help of lawyers and others, including journalists. Apar Gupta was one of the lawyers who played a key role in drafting that Bill. I may have read the Bill at least 100 times before I went ahead with it. Apar then suggested it would be good if we could put it up for public review, which we did. We had a website — speechbill.in — and sought people’s views also. We received a lot of feedback.\n\nWhat were the features of the Bill?\n\nThe main feature of the Bill was that it decriminalised defamation and treated it as a civil offence. It had provisions to curb the chilling effects of criminal defamation and had provisions to prevent damage to reputations. It had quantification of damages for defamation, fixed the maximum amount of damages, and barred governments and institutions exercising government or statutory functions from filing defamation suits.\n\nHow relevant is it in the wake of recent political events?\n\nI did not foresee such an event. I always thought that it is very wrong. Today, everyone seems to have woken up. At the time, the Congress did not support my Bill, no one backed me. But, I wanted to put it on record for posterity at least. I would not say it was a watertight Bill. It needed improvement. But I would like MPs to take it up.\n\nAdvertisement\n\nBeing an editor, and an active politician not so long ago, what do you think of the position that the right to reputation is no less important a right than the right to freedom of speech?\n\nRight to reputation is a debatable point and that can never ever infringe on freedom of speech or freedom of expression. A statement or a post or a tweet can be said to be hurting someone’s sense and sensibilities. We are seeing it across the country. Then, it is up to them, not to the defendant, to prove how their reputation has been hurt. It’s in the legal process also that during the cross-examination the complainant has to prove how … but all they can do is to find one or two witnesses in their neighbourhood to say ‘yes, we thought bad of her or him because of the remark’.\n\nThere are instances of people in power using the defamation law. Do you think it is being used to silence people?\n\nYes, people in power become super touchy. Some people say vulgar things but defend those by claiming freedom of speech. When someone calls me leftist or presstitute or sickular, I get offended. I am very badly hurt because I do not consider myself as someone selling his pen, I consider myself to be neither secular nor Leftist. Yes, I consider myself a liberal, I agree. I was in the House (Lok Sabha) when a Minister of State uttered the word ‘Presstitute’ on the floor of the House. As an editor and a working journalist, I was hurt. We knew that nothing will come of it. Yes, the same people use defamation clauses against others.\n\nAnother thing is that our lower judiciary is not trained to handle so many issues that come up with something like defamation. They are not normal criminal cases but are hypothetical ones. Our lower judiciary is not equipped to handle them. We talk of judicial reforms and the law minister is constantly talking against the collegium. But they are talking about the Supreme Court that they are dealing with every day. But the common Indian does not get to reach the Supreme Court. They are penalised, prosecuted, sentenced, jailed, given life terms, and the appeals take years. Some die in prisons. I would say 99 per cent of our population even. The high courts seem very high. People can afford to go to only the lower courts. I do not think the lower courts can sit in judgment on such delicate issues.\n\nAdvertisement\n\nHave you come across instances of defamation clauses being used against political rivals?\n\nI have never experienced (it), at least not in Odisha. But, of course, it comes up against the media. Of late, it has been happening. They are managing to corner opponents that way. The number of defamation cases was much lower 15-20 years back. Either people were gentler or they were not so touchy. If you start taking one line out of a speech, it can work any which way.\n\nYou are an editor. Does the new trend make you think twice before criticising someone powerful even if it’s based on fact? Do you think there is increasing fear among citizens about criticising someone or exposing corruption?\n\nYes, people across India today are much more careful about what they say, especially about politics and politicians. Also about big business. All the powerful people.\n\nYou too?\n\nI am a don’t-care-a-hoot kind of person but I refrain from being abusive. I speak what I like and also write what I think is correct. Also, must admit I have personally not felt fear or threatened, as yet."}, {"url": "https://kalingatv.com/state/odisha-former-lok-sabha-mp-tathagata-satpathy-blessed-with-daughter/", "page_content": "Bhubaneswar: Former Lok Sabha MP, journalist Tathagata Satpathy was blessed with a baby girl on Saturday afternoon. He took to twitter to reveal about it.\n\nSatpathy wrote, “That pretty Stork visited us!!!! My doter born today 12 Sept 2020 at 16:42:57. Pray Ma Kali blesses Aavya Nandini Satpathy.”\n\nThat pretty Stork visited us!!!! My doter born today 12 Sept 2020 at 16:42:57. Pray Ma Kali blesses Aavya Nandini Satpathy pic.twitter.com/fe8c52CKNm — Tathagata Satpathy (@SatpathyLive) September 12, 2020\n\nSon of former Odisha Chief Minister Nandini Satpathy, Mr. Tathagata Satpathy is the editor of Orissa Post daily English and Odia daily ‘Dharitri’. Married to Adyasha Satpathy the couple has a son named Aaryl Che. Earlier in March he had announced about his bidding goodbye to electoral politics following the wish of his son."}, {"url": "https://www.financialexpress.com/india-news/tathagata-satpathy-nandini-satpathy-odisha-dhenkanal-mp-bjp-naveen-patnaik/1506568/", "page_content": "Tathagata Satpathy, four-time Biju Janata Dal Member of Parliament from Odisha, on Tuesday announced retirement from active politics. The announcement comes a day after his former party colleague in Lok Sabha Baijayant Jay Panda joined the Bharatiya Janata Party. Son of former Odisha Chief Minister Nandini Satpathy, Tathagata is a Lok Sabha MP from Dhenkanal constituency of the state.\n\nThe reason behind hanging his boots, he said, was his desire to return to journalism, adding that there is a need for more fearless voices in journalism now. Satpathy, who is the owner and editor of leading Odia-language newspaper Dharitri, made it clear that he would not join any other political party as he had great respect for party chief Naveen Patnaik.\n\nSatpathy edits two dailies, one in Odia and the other in English – ‘Orissa Post’.\n\nThe veteran leader said that he has realised politics is not the only means to support people and noted that social leadership is lacking in this country. Satpathy said that he is going to refocus on journalism by distancing from politics.\n\n“There is a need for more fearless voices in journalism now. Distancing myself from politics to refocus on journalism. Grateful to my leader Shri Naveen Patnaik for his support all these years. Realised that politics is not the only means to support people,” Satpathy tweeted.\n\nThere is a need for more fearless voices in journalism now. Distancing myself from politics to refocus on journalism. Grateful to my leader Shri Naveen Patnaik for his support all these years. Realised that politics is not the only means to support people.1/1 — Office of T Satpathy (@SatpathyLive) March 5, 2019\n\nThe 62-year-old editor-turned-politician said: “I am taking this decision as per the wish of my 13-year-old son. I am not the person on whom any pressure can work.”\n\n“My son wants me to stay at home, focus on journalism and not to contest the election,” PTI quoted Satpathy as saying.\n\nWhile Panda had resigned from the Biju Janata Dal (BJD) as well as the Lok Sabha due to differences with chief minister Naveen Patnaik, Satpathy’s decision has surprised all.\n\nStating that he respects Patnaik and the people of Dhenkanal and Angul for their love and affection, Satpathy said there was no specific political reason behind his decision."}, {"url": "https://odishabytes.com/former-odisha-mp-tathagata-satpathy-blessed-with-daughter/", "page_content": "Bhubaneswar: Former Odisha MP Tathagata Satpathy was blessed with a daughter on Saturday.\n\nRevealing this in a tweet, Satpathy wrote, “That pretty Stork visited us!!! My doter born today 12 Sept 2020 at 16:42:57. Pray Ma Kali blesses Aavya Nandini Satpathy.”\n\nSatpathy, the son of former Odisha chief minister Nandini Satpathy, was a Lok Sabha MP of BJD. He is also the editor of English daily Orissa Post and Odia newspaper Dharitiri, both published from Bhubaneswar. Married to Adyasha Satpathy, the couple have a son."}]}