{"Tathagata Satpathy was elected to the Lok Sabha in the 2014 Indian general election.": [{"url": "https://www.oneindia.com/politicians/tathagata-satpathy-34879.html", "page_content": "A Journalist by Profession turned Politician is the owner and editor of the daily Odia newspaper, Dharitri, and the English daily, Orissa Post. He is the member of the 16th Lok Sabha and represents the Dhenkanal constituency of Odisha. He was Re-elected for the fourth time in 2014 and is the member of the Biju Janata Dal (BJD) party, and the party's chief whip in the Lok Sabha. In 2000, Satpathy joined the Orissa Gana Parishad...\n\nTathagata Satpathy Biography\n\nA Journalist by Profession turned Politician is the owner and editor of the daily Odia newspaper, Dharitri, and the English daily, Orissa Post. He is the member of the 16th Lok Sabha and represents the Dhenkanal constituency of Odisha. He was Re-elected for the fourth time in 2014 and is the member of the Biju Janata Dal (BJD) party, and the party's chief whip in the Lok Sabha.\n\n\n\nIn 2000, Satpathy joined the Orissa Gana Parishad (a non political outfit), and served as its secretary general. After Naveen Patnaik got elected in 2000, Satpathy had used his newspaper Dharitri to criticise his policies which he does even now. In March 2004, just before the Indian general election, 2004, Satpathy reconciled with BJD. He said that he was forced to quit OGP due its changing into a political party as also forming an alliance with Janaki Ballabh Patnaik-led Indian National Congress"}, {"url": "https://indianexpress.com/article/political-pulse/tathagata-satpathy-interview-cong-defamation-rahul-gandhi-8542406/", "page_content": "With Congress leader Rahul Gandhi convicted of criminal defamation last month, and subsequently disqualified as Lok Sabha MP, there have been calls for a review of the criminal defamation legislation in India. It is not the first time.\n\nIn 2016, then Biju Janata Dal (BJD) MP Tathagata Satpathy moved a Private Member’s Bill in the Lok Sabha to decriminalise defamation — the Protection of Speech and Reputation Bill (commonly known as the “Speech Bill”). Satpathy, who is now the editor of Odia daily Dharitri, speaks to The Indian Express about what prompted him to introduce the Bill, its features, the response of other parties, and the effect criminal defamation has in today’s political climate. Excerpts:\n\nAs an editor, I had about 87 defamation cases filed against me. In Odisha, you have a law that women don’t have to deposit money if they want to file a defamation case. Normally, if you want to file a defamation case you have to deposit a certain percentage of what you claim in court. What happens if you level an allegation or publish a story against the police officials and bureaucrats in the newspapers is that they will get their wives or mothers or sisters to file a case against you. Even if you have enough evidence against them, they will file. Eventually, you will get cleared — in my case, I won all the cases if not in the lower court, then in the higher court. But it’s harassment.\n\nSo, partly, my Bill was driven by my personal experiences. Because two proceedings, civil and criminal, for the same offence do not seem justified to me. If you look at the global picture, the criminal aspect of the defamation case is not there in any democratic country. The last one I know that had it was Australia but they also removed it a few years ago. In most countries, it’s only the civil part. My simple counter was how can we prosecute twice for the same offence?\n\nI sought the help of lawyers and others, including journalists. Apar Gupta was one of the lawyers who played a key role in drafting that Bill. I may have read the Bill at least 100 times before I went ahead with it. Apar then suggested it would be good if we could put it up for public review, which we did. We had a website — speechbill.in — and sought people’s views also. We received a lot of feedback.\n\nWhat were the features of the Bill?\n\nThe main feature of the Bill was that it decriminalised defamation and treated it as a civil offence. It had provisions to curb the chilling effects of criminal defamation and had provisions to prevent damage to reputations. It had quantification of damages for defamation, fixed the maximum amount of damages, and barred governments and institutions exercising government or statutory functions from filing defamation suits.\n\nHow relevant is it in the wake of recent political events?\n\nI did not foresee such an event. I always thought that it is very wrong. Today, everyone seems to have woken up. At the time, the Congress did not support my Bill, no one backed me. But, I wanted to put it on record for posterity at least. I would not say it was a watertight Bill. It needed improvement. But I would like MPs to take it up.\n\nAdvertisement\n\nBeing an editor, and an active politician not so long ago, what do you think of the position that the right to reputation is no less important a right than the right to freedom of speech?\n\nRight to reputation is a debatable point and that can never ever infringe on freedom of speech or freedom of expression. A statement or a post or a tweet can be said to be hurting someone’s sense and sensibilities. We are seeing it across the country. Then, it is up to them, not to the defendant, to prove how their reputation has been hurt. It’s in the legal process also that during the cross-examination the complainant has to prove how … but all they can do is to find one or two witnesses in their neighbourhood to say ‘yes, we thought bad of her or him because of the remark’.\n\nThere are instances of people in power using the defamation law. Do you think it is being used to silence people?\n\nYes, people in power become super touchy. Some people say vulgar things but defend those by claiming freedom of speech. When someone calls me leftist or presstitute or sickular, I get offended. I am very badly hurt because I do not consider myself as someone selling his pen, I consider myself to be neither secular nor Leftist. Yes, I consider myself a liberal, I agree. I was in the House (Lok Sabha) when a Minister of State uttered the word ‘Presstitute’ on the floor of the House. As an editor and a working journalist, I was hurt. We knew that nothing will come of it. Yes, the same people use defamation clauses against others.\n\nAnother thing is that our lower judiciary is not trained to handle so many issues that come up with something like defamation. They are not normal criminal cases but are hypothetical ones. Our lower judiciary is not equipped to handle them. We talk of judicial reforms and the law minister is constantly talking against the collegium. But they are talking about the Supreme Court that they are dealing with every day. But the common Indian does not get to reach the Supreme Court. They are penalised, prosecuted, sentenced, jailed, given life terms, and the appeals take years. Some die in prisons. I would say 99 per cent of our population even. The high courts seem very high. People can afford to go to only the lower courts. I do not think the lower courts can sit in judgment on such delicate issues.\n\nAdvertisement\n\nHave you come across instances of defamation clauses being used against political rivals?\n\nI have never experienced (it), at least not in Odisha. But, of course, it comes up against the media. Of late, it has been happening. They are managing to corner opponents that way. The number of defamation cases was much lower 15-20 years back. Either people were gentler or they were not so touchy. If you start taking one line out of a speech, it can work any which way.\n\nYou are an editor. Does the new trend make you think twice before criticising someone powerful even if it’s based on fact? Do you think there is increasing fear among citizens about criticising someone or exposing corruption?\n\nYes, people across India today are much more careful about what they say, especially about politics and politicians. Also about big business. All the powerful people.\n\nYou too?\n\nI am a don’t-care-a-hoot kind of person but I refrain from being abusive. I speak what I like and also write what I think is correct. Also, must admit I have personally not felt fear or threatened, as yet."}, {"url": "https://peoplepill.com/people/tathagata-satapathy/", "page_content": "Tathagata Satpathy (born 1 April 1956) was a member of the 12th , 14th, 15th and 16th Lok Sabha of India. He represented the Dhenkanal constituency of Odisha, and was re-elected for the fourth time in 2014. He was a member of the Biju Janata Dal (BJD) political party, and the party's chief whip in the Lok Sabha. He took voluntary retirement from politics in March 2019. He is not an active politician ever since.\n\nLife and work\n\nTathagata Satpathy is the younger son of former Odisha Chief Minister Nandini Satpathy and Devendra Satpathy. He is the owner and editor of the daily Odia newspaper, Dharitri, and the English daily, Orissa Post.\n\nIn 2000, Satpathy joined the Orissa Gana Parishad ( a non political outfit), and served as its secretary general. After Naveen Patnaik got elected in 2000, Satpathy had used his newspaper Dharitri to criticise his policies which he does even now. In March 2004, just before the 2004 Indian general election, Satpathy reconciled with BJD. He said that he was forced to quit OGP due its changing into a political party as also forming an alliance with Janaki Ballabh Patnaik-led Indian National Congress (INC).\n\nHis nephew Suparno Satpathy had unsuccessfully contested him in 2014 for the office of MP Lok Sabha, Dhenkanal.\n\nIn March 2015, Tathagata Satpathy became the first Indian Member of Parliament to hold an official \"Ask Me Anything\" session on the content-sharing website Reddit. In April, Satpathy came forward in support of net neutrality, after the Telecom Regulatory Authority of India (TRAI) come out with a consultation paper on over-the-top (OTT) messaging services. In December 2015, Satpathy had supported a bill to decriminalise homosexuality. The bill was introduced by INC leader Shashi Tharoor. But, it was defeated with 71 against, 1 abstaining and 24 in favour.\n\nViews and opinions\n\nOn net neutrality\n\nIn March 2014, the Telecom Regulatory Authority of India (TRAI) released a formal consultation paper on over-the-top (OTT) messaging services and whether telecom operators should be allowed to charge separately for some messaging apps. Soon afterwards, Tathagata Satpathy wrote an open letter to TRAI stating his support for net neutrality. In the letter, he said such a policy would hinder the Digital India project and kill new startups. He said that he used such apps to interact with his constituency and this policy will hinder his functioning as a representative.\n\nOn legalisation of cannabis\n\nTathagata Satpathy has criticised the ban on cannabis in India, while pointing out the long history of its usage as a ritual and recreational intoxicant. He has said that cannabis was banned in India while alcohol was not, because of \"an elitist bias\" as cannabis was a poor man's drug. He has said the addiction depends on person's character and not on the intoxicant. He has suggested an amendment to the Narcotic Drugs and Psychotropic Substances Act, 1985 to allow recreational and medicinal usage of marijuana. During his \"Ask Me Anything\" session on Reddit in March 2015, Satpathy admitted that he smoked cannabis when he was young. In August 2015, during the monsoon session of the Parliament, he proposed the decriminalisation of cannabis. In December 2015, he repeated his proposal during the winter session, saying that banning cannabis has forced villagers to turn to alcohol.\n\nOn homosexuality and moral policing\n\nTathagata Satpathy has condemned the Section 377 of the Indian Penal Code, which criminalises homosexuality in India, calling it \"archaic\" and called for its repeal. He had supported a bill introduced by INC MP Shashi Tharoor to decriminalise homosexuality during the 2015 winter session of the Parliament. When the bill was defeated, Satpathy called it a very sad day. Satpathy has also condemned moral policing and called for a repeal of laws banning pornography in India.\n\nOn privacy and Aadhaar\n\nTathagata Satpathy has raised concerns that the Aadhaar project could be used for mass surveillance or ethnic cleansing in the future. He has questioned why a new identity card project was created despite having several identity cards systems. He has also criticised the decision to present the Aadhaar Bill, 2016 as a money bill. He pointed out that although the bill allows the sharing of biometric under circumstances of national security, there was no concrete definition of national security included in the bill.\n\nOn religious laws and missionaries\n\nSatpathy supports the implementation of a Uniform Civil Code in India. He has criticised those current laws which are based on various religions, saying that the world is moving beyond religious scriptures and such laws only divide the society. He has also said that a lot of faith-based foreign aid comes to Odisha through missionaries. They offer the poor Dalits free education and jobs, this results in mass conversions to Christianity. Satpathy has said that politicians should use the dictionary definition of secularism to avoid confusion.\n\nOther opinions\n\nSatpathy has supported the inclusion of Members of Parliament under the Jan Lokpal Bill to curb corruption. In December 2015, he criticised the Arbitration and Conciliation (Amendment) Bill, 2015 during a debate, saying that the government was favouring big corporations with such laws. He has also criticised the Sansad Adarsh Gram Yojana calling it flawed and that it looks good only on paper. He said it forces him to choose only 8 villages from his constituency for development out of 3000. Satpathy has opposed the proposal to make Hindi the national language.\n\nSatpathy has criticised the construction of new nuclear power plants in India, claiming that most of the world was now moving away from nuclear energy. He has also claimed that Areva nuclear firm of France sold outdated technology to Maharashtra. He has also said that the centre should release the data regarding the safety of nuclear power plants as they are in other countries."}, {"url": "https://www.thehindu.com/elections/results/lok-sabha-elections-2014-results-live-updates/article6012350.ece", "page_content": "May 16, 2014 07:33 am | Updated December 04, 2021 10:47 pm IST\n\n>Lok Sabha Elections 2014 Results: Final party position\n\n>Infographic: Lok Sabha 2014 — Party-wise vote share\n\nALL INDIA Result Status\n\nStatus Known For 543 out of 543 Constituencies\n\nParty Won Leading Total\n\nBharatiya Janata Party 219 63 282\n\nCommunist Party of India 1 0 1\n\nCommunist Party of India (Marxist) 4 5 9\n\nIndian National Congress 34 10 44\n\nNationalist Congress Party 5 1 6\n\nAam Aadmi Party 4 0 4\n\nAll India Anna Dravida Munnetra Kazhagam 15 22 37\n\nAll India N.R. Congress 0 1 1\n\nAll India Trinamool Congress 25 9 34\n\nAll India United Democratic Front 2 1 3\n\nBiju Janata Dal 0 20 20\n\nIndian National Lok Dal 2 0 2\n\nIndian Union Muslim League 2 0 2\n\nJammu & Kashmir Peoples Democratic Party 3 0 3\n\nJanata Dal (Secular) 2 0 2\n\nJanata Dal (United) 1 1 2\n\nJharkhand Mukti Morcha 1 1 2\n\nKerala Congress (M) 1 0 1\n\nLok Jan Shakti Party 3 3 6\n\nNaga Peoples Front 0 1 1\n\nNational Peoples Party 1 0 1\n\nPattali Makkal Katchi 0 1 1\n\nRashtriya Janata Dal 3 1 4\n\nRevolutionary Socialist Party 1 0 1\n\nSamajwadi Party 4 1 5\n\nShiromani Akali Dal 4 0 4\n\nShivsena 13 5 18\n\nSikkim Democratic Front 0 1 1\n\nTelangana Rashtra Samithi 3 8 11\n\nTelugu Desam 1 15 16\n\nAll India Majlis-E-Ittehadul Muslimeen 0 1 1\n\nApna Dal 1 1 2\n\nRashtriya Lok Samta Party 3 0 3\n\nSwabhimani Paksha 1 0 1\n\nYuvajana Sramika Rythu Congress Party 2 7 9\n\nIndependent 2 1 3\n\nTotal 363 180 543 - Source: Election Commission of India: 2046 hours\n\nALL INDIA Result Status\n\nStatus Known For 543 out of 543 Constituencies\n\nParty Won Leading Total\n\nBharatiya Janata Party 209 73 282\n\nCommunist Party of India 1 0 1\n\nCommunist Party of India (Marxist) 4 5 9\n\nIndian National Congress 31 13 44\n\nNationalist Congress Party 4 2 6\n\nAam Aadmi Party 4 0 4\n\nAll India Anna Dravida Munnetra Kazhagam 14 23 37\n\nAll India N.R. Congress 0 1 1\n\nAll India Trinamool Congress 21 13 34\n\nAll India United Democratic Front 1 2 3\n\nBiju Janata Dal 0 20 20\n\nIndian National Lok Dal 2 0 2\n\nIndian Union Muslim League 2 0 2\n\nJammu & Kashmir Peoples Democratic Party 3 0 3\n\nJanata Dal (Secular) 2 0 2\n\nJanata Dal (United) 1 1 2\n\nJharkhand Mukti Morcha 0 2 2\n\nKerala Congress (M) 1 0 1\n\nLok Jan Shakti Party 3 3 6\n\nNaga Peoples Front 0 1 1\n\nNational Peoples Party 1 0 1\n\nPattali Makkal Katchi 0 1 1\n\nRashtriya Janata Dal 2 2 4\n\nRevolutionary Socialist Party 1 0 1\n\nSamajwadi Party 3 2 5\n\nShiromani Akali Dal 4 0 4\n\nShivsena 11 7 18\n\nSikkim Democratic Front 0 1 1\n\nTelangana Rashtra Samithi 3 8 11\n\nTelugu Desam 1 15 16\n\nAll India Majlis-E-Ittehadul Muslimeen 0 1 1\n\nApna Dal 1 1 2\n\nRashtriya Lok Samta Party 2 1 3\n\nSwabhimani Paksha 1 0 1\n\nYuvajana Sramika Rythu Congress Party 1 8 9\n\nIndependent 2 1 3\n\nTotal 336 207 543 - Source: Election Commission of India 20:18 hours\n\nBJP accomplishes ‘Mission 25’ in Rajasthan: For the first time since the 1989 Lok Sabha polls, the Congress failed to open its account in Rajasthan with even its senior leaders biting the dust and rival BJP sweeping all the 25 seats.\n\nThough in the 1989 Lok Sabha polls BJP had won 13, Janata Dal 11 and CPI(M) one, and the Congress lost all 25 seats in Rajasthan, and this time too the Congress lost all the seats, but at BJP’s gain.\n\nBefore 1989, the Congress had secured one out of 25 Lok Sabha seats in 1977, when former Prime Minister Choudhary Charan Singh’s Bhartiya Lok Dal had won 24 seats in the state.\n\nCongress’s Nathu Ram Mirdha had won from Rajasthan’s Nagaur seat and Gargishankar Mishra from Madhya Pradesh.\n\nAfter coming to power in the state with 163 MLAs in the last year’s assembly polls riding on Modi wave, Chief Minister Vasundhara Raje had set her eyes on ‘Mission-25’ and on Friday she won in all constituencies.\n\nCongress stalwarts and Union ministers Sachin Pilot, Jitendra Singh, Chandresh Kumari, Namonarayan Meena, Girija Vyas and six sitting Congress MPs Mahesh Joshi, CP Joshi, Ijyaraj Singh, Dr Jyoti Mirdha, Raghuveer Meena, and Harish Choudhary bit the dust in their home constituencies.\n\nBJP rebel and Independent candidate Jaswant Singh lost to behind BJP candidate Col Sonaram by a margin of over 87,000 votes in Barmer seat.\n\nBJP candidates Santosh Ahalwat in Jhunjhunu, Chandra Prakash Joshi in Chittorgarh, Dushyant Singh in Jhalawar-Baran, Nihal Chand in Ganganagar, Arjun Lal Meena in Udaipur, Gopal Singh Shekhawat in Rajsamand, Subhash Baheria in Bhilwara, Devji Patel in Jalore, and Arjun Meghwal in Bikaner won their seats with huge margins.\n\nRajasthan Chief Minister Vasundhra Raje, who came up with the ‘Mission 25’, said, “The congratulations are not due to me but they are due to the public who voted for us. I am getting the news that the situation across the country is similar as it is in Rajasthan.” -- PTI\n\nRahul Gandhi wins Amethi seat by 1.07 lakh votes: Congress vice-president Rahul Gandhi on Friday defeated his nearest rival BJP’s Smriti Irani in Amethi seat by a margin of 1.07 lakh votes. Mr. Gandhi had won the seat in 2009 by a margin of over 3.70 lakh votes. Aam Admi Party’s Kumar Vishwas had to content himself at fourth position behind BSP’s Dharmendra Pratap Singh. -- PTI\n\nFormer Union Minister and BJP candidate D Purandeswari loses from Rajampet Lok Sabha seat by over 1.75 lakh votes to YSR Congress Party’s Mithun Reddy -- PTI\n\nLandslide victory for BJP in UP; SP, BSP, Congress routed: In a stunning comeback in Uttar Pradesh, BJP has clinched victory in 33 seats and has taken an unassailable lead in 38 other seats, inching closer to a historic win by surpassing its highest tally of 58 seats in the state which brought NDA government to power in 1998.\n\nCongress has won one seat and leading in another, SP has won two and leading in three others while Apna Dal has recorded victory in one seat while leading in another.\n\nThe party routed regional satraps like Ms. Mayawati whose party BSP could not open its account and Mulayam Singh Yadav whose Samajwadi Party won only those seats where members of his clan contested.\n\nCongress, which won 22 seats in 2009, shrunk to only Gandhis’ pocket borough of Rae Bareli where its President Sonia Gandhi won by a margin of 3.52 lakh votes and Rahul Gandhi making a hefty lead of one lakh votes from Amethi.\n\nBJP’s ally Apna Dal also won both the seats where it was contesting increasing the saffron party’s tally to 73.\n\nOn the remaining seven seats, BJP remained runner-up thus indicating the overwhelming number of votes that the saffron party won from Uttar Pradesh.\n\nThe party under the leadership of Atal Bihari Vajpayee had scored 58 seat in 1998, resulting in the formation of NDA government at the Centre. In 1998, Uttar Pradesh had 85 seats of which five have gone to Uttarakhand after division.\n\nLed by a whirlwind campaign by its prime ministerial candidate Narendra Modi, the party improved its all time high vote share of 36.49 per cent taking it to over 42 per cent.\n\nA saving grace for BSP is that it remained runner-up on 33 seats. The party, however, lost is voter base from 27.42 per cent in 2009 to 19.7 per cent this election.\n\nRuling Samajwadi party won only those five seats where Yadav and his family members were contesting. However, it only marginally lost its vote share from 23.26 per cent in 2009 when it won 23 seats to 22.1 this election.\n\nMr. Yadav himself won from both Azamgarh and Mainpuri seats, daughter-in-law Dimple Yadav won from Kannauj and nephews Dharmanadra Yadav and Akshay Yadav won from Badaun and Firozabad seats respectively.\n\nAll the Congress ministers including Salman Khurshid, RPN SIngh, Beni Prasad Verma, Pradip Jain Aditya, PL Punia and sitting MPs lost from their respective seats.\n\nBJP ally Apna Dal won both Pratapgarh and Mirzapur seats, where Harivansh Singh and Anupriya Patel clinched victory. -- PTI\n\nMohd Azharuddin loses to BJP’s Sukhbir Singh Jaunpuria in Tonk-Sawai Madhopur Lok Sabha seat\n\nIboyaima Laithangbam from Imphal reports : Congress retained both the Parliamentary seats in Manipur. In the Inner Manipur constituency the sitting Congress MP Meinya Thokchom was declared elected by defeating his nearest rival Nara Moirangthem of the CPI who was also supported by ten non-Congress and non-BJP parties. Thokchom secured 2,92,102 votes while Moirangthem got 1,97,428. Thokchom is in the third stint. In the Outer Parliamentary constituency sitting Congress MP Thangsho Baite was elected by defeating his nearest rival Soso Lorho of the Naga People’s Front. This is his second term. Baite secured 2,96,618 while Lorho got 2,81,121.\n\nTRS to form 1st government in Telangana: Having spearheaded the agitation for statehood, TRS is set to form the first government in Telangana with K Chandrasekhar Rao at the helm as the party today won a majority, drubbing the Congress.\n\nWith some 15 results yet to come in, Telangana Rashtra Samiti bagged 60 seats out of the total 119 in the region, which would be born as the country’s 29th state on June two.\n\nThe victory for TRS meant a loss of face for the Congress which failed to capitalise on its claim of “delivering” statehood for Telangana as it secured a mere 16 seats and was leading in four others.\n\nTDP-BJP combine turned in better than expected results with a tally of 16 seats and the alliance was ahead in five more constituencies.\n\n“I bow my head in humility. I thank the people of Telangana for giving us the victory. We will implement our election manifesto in letter and spirit,” Chandrasekhar Rao or KCR, as he is popularly known, told a press conference.\n\nMr. Rao himself won from Gajwel in native Medak district.\n\nIn happy tidings for the family, his son K T Rama Rao emerged victorious in Sircilla and nephew T Harish Rao from Siddipet.\n\nCongress, which was accused by rivals, including YSR Congress Party, of creating Telangana to serve its narrow political interests, suffered major losses.\n\nTelangana Pradesh Congress chief and former minister Ponnala Lakshmaiah (Jangaon), Deputy Chief Minister C Damodar Raj Narasimha (Andole), ministers D Sridhar Babu (Manthani), V Sunitha Laxma Reddy (Narasapur), Danam Nagender (Khairatabad), Mukesh Goud (Goshamahal), B Saraiah (Warangal East) and former PCC chief D Srinivas lost.\n\nKCR’s decision to go it alone after refusing to merge it with the Congress and even deciding not to have an electoral alliance with it helped his party reap rich dividends.\n\nFormer Punjab Chief Minister and Congress candidate Amarinder Singh defeated senior BJP leader Arun Jaitley in Amritsar Lok Sabha seat by a margin of 1,02,770 votes -- PTI\n\nFollowing is the final party position in Kerala:\n\nNumber of seats : 20; Results declared: 20;\n\nUDF : 12; LDF: 08; BJP: 0\n\nParty wise break of UDF:\n\nSeat contested Won Lost\n\nCong 15 8 7\n\nIUML: 2 2\n\nKC(M): 1 1\n\nRSP : 1 1\n\nSJD : 1 1\n\nParty wise break up of LDF:\n\nCPI-M 10 5 5 CPI 4 1 3 LDF (Independents): 5 2 3 -- PTI\n\nJolt to NC-Cong; Farooq, Azad bite dust: In a major setback to ruling National Conference-Congress coalition in Jammu and Kashmir, opposition PDP and BJP on Friday shared the six Lok Sabha seats in the state as two Union ministers, including Farooq Abdullah, bit the dust.\n\nAbdullah, NC patriarch and Union minister for New and Renewable Energy, tasted his first electoral defeat in over three decades.\n\nPDP’s Tariq Hamid Karra humbled him in the Srinagar Lok Sabha constituency by a margin of 42280 votes.\n\nKarra, a former Finance minister in the then PDP-led government in Jammu and Kashmir, polled 157923 votes against Abdullah’s 115643.\n\nIt was a comprehensive defeat for 76-year-old Abdullah as his party lost in 12 of the 15 assembly segments comprising the Srinagar Lok Sabha seat, considered to be the stronghold of National Conference.\n\nUnion Health minister Ghulam Nabi Azad was trounced by BJP’s Jitendra Singh in Udhampur Lok Sabha constituency by a margin of 60976 votes.\n\nSingh polled 487369 votes against Azad’s 426393 as PDP’s Arshid Malik came a distant third with 30458 votes.\n\nThis was the first time Azad, a former Chief Minister, had contested the Lok Sabha election from the state.\n\nBJP president and candidate from Jammu Lok Sabha seat Jugal Kishore registered the highest winning margin of 257280 votes in the state, defeating two-time Congress MP Madan Lal Sharma.\n\nKishore got 619995 votes while Sharma polled 362715. -- PTI\n\nALL INDIA Result Status\n\nStatus Known For 543 out of 543 Constituencies\n\nParty Won Leading Total\n\nBharatiya Janata Party 174 110 284\n\nCommunist Party of India 1 0 1\n\nCommunist Party of India (Marxist) 4 5 9\n\nIndian National Congress 29 15 44\n\nNationalist Congress Party 3 3 6\n\nAam Aadmi Party 4 0 4\n\nAll India Anna Dravida Munnetra Kazhagam 12 25 37\n\nAll India N.R. Congress 0 1 1\n\nAll India Trinamool Congress 20 14 34\n\nAll India United Democratic Front 0 3 3\n\nBiju Janata Dal 0 19 19\n\nIndian National Lok Dal 2 0 2\n\nIndian Union Muslim League 2 0 2\n\nJammu & Kashmir Peoples Democratic Party 3 0 3\n\nJanata Dal (Secular) 2 0 2\n\nJanata Dal (United) 1 1 2\n\nJharkhand Mukti Morcha 0 1 1\n\nKerala Congress (M) 1 0 1\n\nLok Jan Shakti Party 3 3 6\n\nNaga Peoples Front 0 1 1\n\nNational Peoples Party 0 1 1\n\nPattali Makkal Katchi 0 1 1\n\nRashtriya Janata Dal 1 3 4\n\nRevolutionary Socialist Party 1 0 1\n\nSamajwadi Party 2 3 5\n\nShiromani Akali Dal 4 0 4\n\nShivsena 9 9 18\n\nSikkim Democratic Front 0 1 1\n\nTelangana Rashtra Samithi 2 9 11\n\nTelugu Desam 1 15 16\n\nAll India Majlis-E-Ittehadul Muslimeen 0 1 1\n\nApna Dal 1 1 2\n\nRashtriya Lok Samta Party 2 1 3\n\nSwabhimani Paksha 1 0 1\n\nYuvajana Sramika Rythu Congress Party 0 9 9\n\nIndependent 1 2 3\n\nTotal 286 257 543 - Source: Election Commission of India - 1930 hours\n\nCongress Working Committee to meet on May 19 in the wake of its worst ever electoral performance in Lok Sabha polls: party sources\n\nTamil Nadu - Alandur (by-election)\n\nResult Declared\n\nCandidate Party Votes\n\nVENKATRAMAN V.N.P. All India Anna Dravida Munnetra Kazhagam 89295\n\nBHARATHI R.S. Dravida Munnetra Kazhagam 70587\n\nKAMARAJA M. Desiya Murpokku Dravida Kazhagam 20442\n\nNANCHIL. V. ESWARA PRASAD Indian National Congress 6535\n\nGNANI Aam Aadmi Party 5729\n\nSATHYANATHAN M. Independent 2556\n\nSULAKSHANA S. Hindustan National Party 337\n\nVARADAN A. Independent 314\n\nSASIPERUMAL S.K. Independent 282\n\nKAMARAJ R. Independent 271\n\nBHARATHI S. Independent 227\n\nJAYARAJ S. (A) S.J.R. Independent 188\n\nTAMILSELVAM P. Independent 105\n\nCHANDRASEKAR A. Independent 100\n\nNone of the Above None of the Above 4248 - Source: Election Commission of India\n\nFor the first time, country will be run by a post-1947 born: Modi\n\n“Good days are coming and from today for next five years the journey has started,” says Modi in Vadodara.\n\nVadodara has given him a margin of 5.70 lakh votes even after he spent only 50 minutes after filing nomination, says Modi\n\n“In Varanasi, people have put a stamp on my silence, an apparent reference to refusal of permission to address a meeting\"\n\n“Gujarat has created history by giving all the 26 seats to BJP,” Modi says. “This is the first time after independence a non-Congress party has been given majority on its own in the current elections”\n\n“With all and development for all” will be my government’s motto and not an empty slogan.”\n\nAIADMK candidate M Vasanthi defeats K Krishnasamy of Puthiya Tamizhagam, an ally of DMK, in Tenkasi (SC) constituency by a margin of 161774 votes.\n\nALL INDIA Result Status\n\nStatus Known For 543 out of 543 Constituencies\n\nParty Won Leading Total\n\nBharatiya Janata Party 140 143 283\n\nCommunist Party of India 1 0 1\n\nCommunist Party of India (Marxist) 2 7 9\n\nIndian National Congress 20 25 45\n\nNationalist Congress Party 3 3 6\n\nAam Aadmi Party 3 1 4\n\nAll India Anna Dravida Munnetra Kazhagam 6 31 37\n\nAll India N.R. Congress 0 1 1\n\nAll India Trinamool Congress 14 20 34\n\nAll India United Democratic Front 0 3 3\n\nBiju Janata Dal 0 19 19\n\nIndian National Lok Dal 2 0 2\n\nIndian Union Muslim League 2 0 2\n\nJammu & Kashmir Peoples Democratic Party 1 2 3\n\nJanata Dal (Secular) 1 1 2\n\nJanata Dal (United) 1 1 2\n\nJharkhand Mukti Morcha 0 1 1\n\nKerala Congress (M) 1 0 1\n\nLok Jan Shakti Party 3 3 6\n\nNaga Peoples Front 0 1 1\n\nNational Peoples Party 0 1 1\n\nPattali Makkal Katchi 0 1 1\n\nRashtriya Janata Dal 1 3 4\n\nRevolutionary Socialist Party 1 0 1\n\nSamajwadi Party 1 4 5\n\nShiromani Akali Dal 2 2 4\n\nShivsena 6 12 18\n\nSikkim Democratic Front 0 1 1\n\nTelangana Rashtra Samithi 1 10 11\n\nTelugu Desam 0 16 16\n\nAll India Majlis-E-Ittehadul Muslimeen 0 1 1\n\nApna Dal 0 2 2\n\nRashtriya Lok Samta Party 2 1 3\n\nSwabhimani Paksha 1 0 1\n\nYuvajana Sramika Rythu Congress Party 0 9 9\n\nIndependent 1 2 3\n\nTotal 216 327 543 -- Source: Election Commission of India at 18:30 hours\n\nTRS wins six Lok Sabha seats: The Telangana Rashtra Samithi (TRS) has bagged six Lok Sabha seats in Telangana. Party chief K. Chandrasekhara Rao won the Medak Lok Sabha seat, while his daughter K. Kavitha was elected from Nizamabad. TRS leader Kadiam Srihari won from Warangal. Party candidates also won from Adilabad, Zahirabad and Karimnagar. The party was leading in four other constituencies. The Congress retained one seat and was ahead in one. The Telugu Desam Party (TDP) and its ally, the Bharatiya Janata Party (BJP), were ahead in one parliamentary constituency each. The Majlis—e—Ittehadul Muslimeen (MIM) was on victory path in Hyderabad. -- IANS\n\nFormer Lok Sabha speaker Meira Kumar loses Sasaram in Bihar\n\nAIADMK's B. Senguttuvan wins in Vellore, Tamil Nadu\n\nFormer Chief Minister B S Yeddyurappa defeats Manjunath Bhandary of Congress by 3,63,305 votes in Shimoga. -- PTI\n\nALL INDIA Result Status\n\nStatus Known For 543 out of 543 Constituencies\n\nParty Won Leading Total\n\nBharatiya Janata Party 103 177 280\n\nCommunist Party of India 1 0 1\n\nCommunist Party of India (Marxist) 2 7 9\n\nIndian National Congress 12 35 47\n\nNationalist Congress Party 2 4 6\n\nAam Aadmi Party 1 3 4\n\nAll India Anna Dravida Munnetra Kazhagam 4 33 37\n\nAll India N.R. Congress 0 1 1\n\nAll India Trinamool Congress 11 23 34\n\nAll India United Democratic Front 0 3 3\n\nBiju Janata Dal 0 20 20\n\nIndian National Lok Dal 1 1 2\n\nIndian Union Muslim League 2 0 2\n\nJammu & Kashmir Peoples Democratic Party 0 3 3\n\nJanata Dal (Secular) 1 1 2\n\nJanata Dal (United) 1 1 2\n\nJharkhand Mukti Morcha 0 1 1\n\nKerala Congress (M) 0 1 1\n\nLok Jan Shakti Party 1 5 6\n\nNaga Peoples Front 0 1 1\n\nNational Peoples Party 0 1 1\n\nPattali Makkal Katchi 0 1 1\n\nRashtriya Janata Dal 1 2 3\n\nRevolutionary Socialist Party 1 0 1\n\nSamajwadi Party 0 5 5\n\nShiromani Akali Dal 1 3 4\n\nShivsena 6 12 18\n\nSikkim Democratic Front 0 1 1\n\nTelangana Rashtra Samithi 1 10 11\n\nTelugu Desam 0 16 16\n\nAll India Majlis-E-Ittehadul Muslimeen 0 1 1\n\nApna Dal 0 2 2\n\nRashtriya Lok Samta Party 0 3 3\n\nSwabhimani Paksha 0 1 1\n\nYuvajana Sramika Rythu Congress Party 0 9 9\n\nIndependent 0 4 4\n\nTotal 152 391 543 -- Election Commission at 17:30 hours\n\nWest Bengal party position at 1800 hrs.\n\nTotal seats 42; Results declared 30; Leads available 12.\n\nWon :\n\nTrinamool Congress 24\n\nCPI(Marxist) 1\n\nCongress 4\n\nBJP 1\n\nLeads : Trinamool Congress 10 CPI(Marxist) 1 BJP 1 Congress 0\n\nModi’s victory tweet creates history as BJP sweeps LS polls: Man-of-the-moment Narendra Modi’s tweet after he led BJP to a landslide victory in the world’s biggest elections created history by becoming India’s ‘most-shared tweet’\n\n“India has won!” Mr. Modi, 63, tweeted on microblogging site Twitter, which instantly became a hit with over 51,000 re-tweets and nearly 32,000 marking favourites within a short span of time.\n\nAs leads from counting of votes gave BJP a clear majority in the 542 member Lok Sabha, Mr. Modi’s tweet went viral on the microblogging site.\n\nWhen contacted, Twiiter confirmed saying: “Yes, it is the most retweeted tweet till date on Twitter from India. Also, it is the fastest to reach 10,000, 20,000, 40,000 and 50,000, respectively“.\n\nTill the last count, the tweet had been retweeted 51,365 times and marked favourite by 31,198 users.\n\nThe tweet, however, has a long way to go before it can compete with global retweet records. The global includes Ellen DeGeneres’ Oscar selfie at the 86th Academy Awards and US President Barack Obama’s victory tweet (saying “Four more years” with picture of himself hugging Michelle) after his second term confirmation.\n\nMr. Obama’s tweet was retweeted 774,933 times and marked favourite by 294,571 people.\n\nMr. Modi has a huge team of developers and social network specialists, who are supporting his campaign.\n\nAfter the stated tweet, he has also posted a “selfie” with his mother, Heeraben after taking her blessings.\n\nHis team has also put in place a victory wall, where his supporters can reach out with their messages to Modi.\n\nThe group has also reached out to BJP supporters through emails thanking supporters for the contribution towards achieving “Mission 272+”. -- PTI\n\nRajapaksa, Cameron congratulate Modi: Sri Lanka President Mahinda Rajapaksa and British Prime Minister David Cameron on Friday congratulated Narendra Modi on the BJP’s stunning victory in the Indian general election.\n\nMr. Rajapaksa, who was among the first world leaders to reach out to Modi, said that he called up the BJP’s prime ministerial candidate.\n\n”...congratulated on BJP victory and invited for a state visit,” MR. Rajapaksa tweeted.\n\nMr. Cameron tweeted: “Congratulations ... on victory in India’s elections. Keen to work together to get the most from UK—India relationship.” -- IANS\n\nPakistan Prime Minister Nawaz Sharif calls Narendra Modi and congratulates him on his “resounding” win in the polls. -- PTI\n\nSushma Swaraj wins Vidisha seat by over four lakh votes: Senior BJP leader Sushma Swaraj on Friday won Vidisha seat in Madhya Pradesh by a huge margin of over four lakh votes. Ms. Swaraj, a sitting MP, defeated Congress’ Lakshman Singh. Ms. Swaraj secured 7,14,248 votes while Lakshman Singh, brother of Congress General Secretary Digvijay Singh got 3,03,650 votes. -- PTI\n\nEnthused by LS show, BJP to strengthen its Bengal base : Elated over its performance in West Bengal, the BJP on Friday said it would prepare for the 2016 Assembly election by strengthening the party base in the state capitalizing on the performance.\n\nThe BJP leadership also felt that the Trinamool’s dream run in the Lok Sabha polls, in which it is clearly leading in 34 out of 42 seats, is due to the division of anti-TMC votes between opposition parties.\n\n“It is due to the division of anti-TMC votes in the state that TMC had such a dream run. If we had an organisation like CPI(M) we could have delivered much much better,” said Rahul Sinha, state BJP Chief.\n\nHe said that Mamata Banerjee needed to understand the mood of Bengal voters.\n\n“They have voted for the BJP for its good governance and development and have warned her not to follow vote bank politics. In any case, the 2016 assembly polls will be fought on the TMC versus BJP plank,” senior BJP leader Siddharth Nath Singh told PTI.\n\nThe BJP has taken a handsome lead in 2 out of 42 seats. -- PTI\n\nALL INDIA Result Status\n\nStatus Known For 543 out of 543 Constituencies\n\nParty Won Leading Total\n\nBharatiya Janata Party 78 201 279\n\nCommunist Party of India 1 0 1\n\nCommunist Party of India (Marxist) 2 7 9\n\nIndian National Congress 8 39 47\n\nNationalist Congress Party 2 4 6\n\nAam Aadmi Party 1 3 4\n\nAll India Anna Dravida Munnetra Kazhagam 2 35 37\n\nAll India N.R. Congress 0 1 1\n\nAll India Trinamool Congress 10 24 34\n\nAll India United Democratic Front 0 3 3\n\nBiju Janata Dal 0 20 20\n\nIndian National Lok Dal 1 1 2\n\nIndian Union Muslim League 2 0 2\n\nJammu & Kashmir Peoples Democratic Party 0 3 3\n\nJanata Dal (Secular) 1 1 2\n\nJanata Dal (United) 1 1 2\n\nJharkhand Mukti Morcha 0 1 1\n\nKerala Congress (M) 0 1 1\n\nLok Jan Shakti Party 1 5 6\n\nNaga Peoples Front 0 1 1\n\nNational Peoples Party 0 1 1\n\nPattali Makkal Katchi 0 1 1\n\nRashtriya Janata Dal 0 4 4\n\nRevolutionary Socialist Party 1 0 1\n\nSamajwadi Party 0 5 5\n\nShiromani Akali Dal 1 3 4\n\nShivsena 4 14 18\n\nSikkim Democratic Front 0 1 1\n\nTelangana Rashtra Samithi 1 10 11\n\nTelugu Desam 0 16 16\n\nAll India Majlis-E-Ittehadul Muslimeen 0 1 1\n\nApna Dal 0 2 2\n\nRashtriya Lok Samta Party 0 3 3\n\nSwabhimani Paksha 0 1 1\n\nYuvajana Sramika Rythu Congress Party 0 9 9\n\nIndependent 0 4 4\n\nTotal 117 426 543 - Election Commission at 17:02 hours\n\nFarooq Abdullah loses in Srinagar -- IANS\n\nRahul Gandhi holds himself responsible for Congress defeat. -- PTI\n\nBoth Sonia and Rahul congratulate the new government and wish them all the best\n\nWe respect the verdict of people with humility and congratulate the next government: Sonia Gandhi\n\nCongress humbly accepts people’s verdict, says Sonia Gandhi.\n\nBoth Sonia and Rahul hold themselves responsible for Congress defeat.\n\nShiv Sena candidate Adsul Anandrao Vithoba wins in Amravati, Maharashtra\n\nCongress retains lone LS seat in Mizoram: Sitting Lok Sabha member C.L. Ruala of the ruling Congress was re-elected to the lone Mizoram Lok Sabha seat and will represent the North Eastern state for two consecutive terms.\n\nRuala defeated his nearest rival Robert Romawia Royte of the United Democratic Front (UDF), the eight party opposition alliance by a margin of 11,361 votes in a triangular contest.\n\nHe contested the elections held on April 11 against two opponents -- Robert Romawia Royte, an independent candidate sponsored by the eight-party United Democratic Alliance (UDF) and Michael Lalmanzuala of the Aam Aadmi Party (AAP).\n\nRuala won the 2009 Lok Sabha elections by defeating his nearest rival Dr H Lallungmuana, an independent candidate sponsored by the opposition Mizo National Front (MNF) and the Mizoram People’s Conference (MPC) by a margin of 1,08,955 votes, the highest ever in the electoral history of the state. -- PTI\n\nProf. Chintamani Malviya of BJP wins in Ujjain, MP\n\nBJP candidate Dr. Virendra Kumar wins in Tikamgarh, MP\n\nR. Sivaraman from Puducherry reports:AINRC wins : The ruling AINRC has dashed Congress hopes of a silver lining in the gloomy national scenario with its candidate R. Radhakrishnan defeating his Congress rival V. Narayanasamy by a huge margin of 60,854 votes to pocket the Puducherry Parliamentary seat.\n\nAs counting ended, Mr. Radhakrishnan had polled 2.55,826 votes against Mr. Narayanasamy's tally of 1,94,972 votes. AIADMK candidate M.V. Omalingam bagged an impressive 1.32,657 votes. Though the official declaration is expected a short while from now, the cadres of AINRC which is led by Chief Minister N. Rangasamy are already in celebration mode.\n\nALL INDIA Result Status\n\nStatus Known For 542 out of 543 Constituencies\n\nParty Won Leading Total\n\nBharatiya Janata Party 59 220 279\n\nCommunist Party of India 1 0 1\n\nCommunist Party of India (Marxist) 2 7 9\n\nIndian National Congress 6 40 46\n\nNationalist Congress Party 2 4 6\n\nAam Aadmi Party 1 3 4\n\nAll India Anna Dravida Munnetra Kazhagam 1 36 37\n\nAll India N.R. Congress 0 1 1\n\nAll India Trinamool Congress 6 28 34\n\nAll India United Democratic Front 0 3 3\n\nBiju Janata Dal 0 20 20\n\nIndian National Lok Dal 1 1 2\n\nIndian Union Muslim League 1 1 2\n\nJammu & Kashmir Peoples Democratic Party 0 3 3\n\nJanata Dal (Secular) 1 1 2\n\nJanata Dal (United) 0 2 2\n\nJharkhand Mukti Morcha 0 1 1\n\nKerala Congress (M) 0 1 1\n\nLok Jan Shakti Party 0 6 6\n\nNaga Peoples Front 0 1 1\n\nNational Peoples Party 0 1 1\n\nPattali Makkal Katchi 0 1 1\n\nRashtriya Janata Dal 0 4 4\n\nRevolutionary Socialist Party 1 0 1\n\nSamajwadi Party 0 5 5\n\nShiromani Akali Dal 1 3 4\n\nShivsena 4 15 19\n\nSikkim Democratic Front 0 1 1\n\nTelangana Rashtra Samithi 1 10 11\n\nTelugu Desam 0 15 15\n\nAll India Majlis-E-Ittehadul Muslimeen 0 1 1\n\nApna Dal 0 2 2\n\nRashtriya Lok Samta Party 0 3 3\n\nSwabhimani Paksha 0 1 1\n\nYuvajana Sramika Rythu Congress Party 0 9 9\n\nIndependent 0 4 4\n\nTotal 88 454 542 - Election Commission source at 16:30 hours\n\nTukaram Godse of Shiv Sena defeats NCP's Chhagan Bhujbal in Nasik\n\nKirron Kher of BJP wins in Chandigarh\n\nLalu’s wife, daughter trailing: In an embarassment to RJD chief Lalu Prasad, his wife and former chief minister Rabri Devi and his daughter Misa Bharti were trailing from Saran and Patliputra parliamentary seats in Bihar.\n\nAfter several rounds of counting, Rabri Devi was trailing by over 20,000 votes to Bharatiya Janata Party candidate Rajiv Pratap Rudy in Saran constituency.\n\nIn Patliputra seat, Misa Bharti was trailing by over 18,000 votes to BJP candidate Ram Kirpal Yadav.\n\nThe Rashtriya Janata Dal (RJD) supremo had worked overtime in both constituencies for his wife and daughter as it was a prestige issue for him. -- IANS\n\nINC candidate Kamal Nath wins in Chhindwara.\n\nNCP candidate Mohammed Faizal P. P wins Lakshadweep\n\nShatrughan Sinha wins from Patna Sahib: Bollywood actor-turned-politician and BJP sitting MP Shatrughan Sinha has won from the Patna Sahib Lok Sabha constituency. Mr. Sinha, popularly known as ‘Bihari Babu’, defeated Congress candidate Kunal Singh, a Bhojpuri filmstar, by over one lakh votes. -- IANS\n\nYakutpura goes to Majlis. MIM Mumtaz Khan gets 66,839 and defeats BJP candidate Roop Raj 32,415.\n\nBJP pulls a clean sweep in Rajasthan. Wins all 25 seats - Mahim Pratap Singh tweeted\n\nVithalbhai Hansrajbhai Radadiya of BJP wins from Porbandar, Gujarat\n\nDr. Bharatiben Dhirubhai Shiyal of BJP wins from Bhavnagar, Gujarat\n\nJugal Kishore Sharma of BJP declared elected in Jammu-Poonch against Madan Lal Sharma of Congress with a margin of 2,57,280 votes. Jugal Kishore BJP: 6,19,995 votes; Madan Lal Sharma Congress: 3,62,715 votes\n\nP. K. Sreemathi Teacher of CPI(M) wins in Kannur\n\nALL INDIA Result Status\n\nStatus Known For 541 out of 543 Constituencies\n\nParty Won Leading Total\n\nBharatiya Janata Party 44 236 280\n\nCommunist Party of India 1 0 1\n\nCommunist Party of India (Marxist) 1 8 9\n\nIndian National Congress 5 40 45\n\nNationalist Congress Party 2 4 6\n\nAam Aadmi Party 0 4 4\n\nAll India Anna Dravida Munnetra Kazhagam 1 36 37\n\nAll India N.R. Congress 0 1 1\n\nAll India Trinamool Congress 3 31 34\n\nAll India United Democratic Front 0 3 3\n\nBiju Janata Dal 0 20 20\n\nIndian National Lok Dal 0 2 2\n\nIndian Union Muslim League 0 2 2\n\nJammu & Kashmir Peoples Democratic Party 0 3 3\n\nJanata Dal (Secular) 1 1 2\n\nJanata Dal (United) 0 2 2\n\nJharkhand Mukti Morcha 0 1 1\n\nKerala Congress (M) 0 1 1\n\nLok Jan Shakti Party 0 6 6\n\nNaga Peoples Front 0 1 1\n\nNational Peoples Party 0 1 1\n\nPattali Makkal Katchi 0 1 1\n\nRashtriya Janata Dal 0 3 3\n\nRevolutionary Socialist Party 0 1 1\n\nSamajwadi Party 0 5 5\n\nShiromani Akali Dal 1 3 4\n\nShivsena 2 17 19\n\nSikkim Democratic Front 0 1 1\n\nTelangana Rashtra Samithi 0 11 11\n\nTelugu Desam 0 15 15\n\nAll India Majlis-E-Ittehadul Muslimeen 0 1 1\n\nApna Dal 0 2 2\n\nRashtriya Lok Samta Party 0 3 3\n\nSwabhimani Paksha 0 1 1\n\nYuvajana Sramika Rythu Congress Party 0 9 9\n\nIndependent 0 4 4\n\nTotal 61 480 541 - source Election Commission at 16.00 hours\n\nBJP candidate Anantkumar Hegde wins in Uttara Kannada\n\nDilip Patel of BJP wins from Anand, Gujarat\n\nShobha Karandlaje of BJP wins in Udupi Chikmagalur\n\nBJP wins both seats in Goa\n\nMuddahanumegowda S. p. of INC wins in Tumkur\n\nOur Correspondent Aloysius Xavier Lopez says : Dayanidhi Maran loses Central Chennai to S.R. Vijaya Kumar by 46, 200 votes.\n\nINC candidate Mallikarjun Kharge wins in Gulbarga\n\nPralhad Joshi of BJP wins in Dharwad: EC\n\nMohammad Asraraul Haque of Congress wins from Kishanganj, Bihar.\n\nBJP's Bhola Singh wins from Begusarai.\n\nStaff Reporter from Kancheepuram: The AIADMK nominee for Kancheepuram (SC) seat, Maragatham has increased her lead over her nearest rival, Selvam of DMK by 68922 votes at the end of 9th round of counting. While she secured 226252 votes out of 507345 ballots counted till 9th round, Selvam polled 157330 votes only. At the same time, NOTA secured 8143 votes in its favour.\n\nDMK’s A Raja loses in Nilgiris to AIADMK’s C Gopalakrishnan by a margin of about one lakh votes -- PTI\n\nALL INDIA Result Status\n\nStatus Known For 540 out of 543 Constituencies\n\nParty/Won/Leading/Total\n\nBharatiya Janata Party 26 255 281\n\nCommunist Party of India 1 0 1\n\nCommunist Party of India (Marxist) 1 9 10\n\nIndian National Congress 3 39 42\n\nNationalist Congress Party 1 5 6\n\nAam Aadmi Party 0 4 4\n\nAll India Anna Dravida Munnetra Kazhagam 0 36 36\n\nAll India N.R. Congress 0 1 1\n\nAll India Trinamool Congress 3 31 34\n\nAll India United Democratic Front 0 3 3\n\nBiju Janata Dal 0 20 20\n\nIndian National Lok Dal 0 2 2\n\nIndian Union Muslim League 0 2 2\n\nJammu & Kashmir Peoples Democratic Party 0 3 3\n\nJanata Dal (Secular) 1 1 2\n\nJanata Dal (United) 0 2 2\n\nJharkhand Mukti Morcha 0 1 1\n\nKerala Congress (M) 0 1 1\n\nLok Jan Shakti Party 0 6 6\n\nNaga Peoples Front 0 2 2\n\nNational Peoples Party 0 1 1\n\nPattali Makkal Katchi 0 1 1\n\nRashtriya Janata Dal 0 3 3\n\nRevolutionary Socialist Party 0 1 1\n\nSamajwadi Party 0 5 5\n\nShiromani Akali Dal 1 3 4\n\nShivsena 2 17 19\n\nSikkim Democratic Front 0 1 1\n\nTelangana Rashtra Samithi 0 11 11\n\nTelugu Desam 0 15 15\n\nAll India Majlis-E-Ittehadul Muslimeen 0 1 1\n\nApna Dal 0 2 2\n\nRashtriya Lok Samta Party 0 3 3\n\nSwabhimani Paksha 0 1 1\n\nYuvajana Sramika Rythu Congress Party 0 9 9\n\nIndependent 0 4 4\n\nTotal 39 501 540 - source Election Commission of India at 15:39 hours\n\nTotal number of seats: 543; Results declared: 26; Leads available: 513;\n\nResults of 26 seats\n\nBJP: 18; Congress : 2; Shivsena: 2; Communist Party of India (CPI): 1; Communist Party of India (Marxist): 1; NCP 1; Shiromani Akali Dal (SAD): 1;\n\nLeads on 521 seats\n\nBJP: 260; Congress: 40; AIADMK 35; TMC 34; BJD 20; Shiv Sena: 17; TDP 15; YSR Congress 9; CPI(M) 9; NCP: 5; Aam Aadmi Party (AAP): 4; All India N R Congress 1; All India United Democratic Front: 3; Indian National Lok Dal 2; Indian Union Muslim League 2; Jammu & Kashmir Peoples Democratic Party 3; Janata Dal (Secular) 2; Janata Dal (United) 2; Jharkhand Mukti Morcha 1; Kerala Congress (M): 1; Lok Jan Shakti Party 6; Naga Peoples Front 2; National Peoples Party 1; Pattali Makkal Katchi 1; Rashtriya Janata Dal 4; Revolutionary Socialist Party 1; Samajwadi Party 7; Shiromani Akali Dal 3; Shivsena 17; Sikkim Democratic Front 1; Telangana Rashtra Samithi 11; All India Majlis—E—Ittehadul Muslimeen 1; Apna Dal: 2; Rashtriya Lok Samta Party 3; Swabhimani Paksha: 1; Yuvajana Sramika Rythu Congress Party: 9; Independents: 4\n\nKumar Vishwas congratulates Modi: Aam Aadmi Party leader Kumar Vishwas on Friday congratulated Narendra Modi for his victory in the Lok Sabha election and termed the results as “citizen’s verdict” in their favour.\n\n“Congrats @narendramodi led BJP on citizen’s verdict in their favour. Hope his team stands up to the needs and expectations of Bharat Mata,” Mr. Vishwas, who contested from Amethi Lok Sabha constituency, tweeted.\n\nThe senior AAP leader is trailing in Amethi where he is locked in a battle with Congress vice-president Rahul Gandhi and BJP’s Smriti Irani. -- PTI\n\nP. Oppili reports from Thiruvallur : This is the consolidated vote count at Thiruvallur constituency at 2.55 p.m., after ten rounds of counting - At the end of tenth round, the AIADMK candidate Dr. P. Venugopal was leading with a margin of 1.50 lakh votes against his opponent D. Ravikumar of VCK, who was behind him with a total vote of 1.39 lakh.V. Yuvaraj of DMDK came third with 94,058 votes. NOTA votes were 10,671.\n\nFormer Army Chief Gen V.K. Singh leads in Ghaziabad -- IANS\n\nChandrababu congratulates Modi over NDA’s poll success: Telugu Desam Party president N Chandrababu Naidu on Friday congratulated BJP’s prime ministerial candidate Narendra Modi over the stupendous victory of NDA in the general elections.\n\n“I am looking forward to work with you for development and good governance in the state and at the Centre,” Chandrababu told Mr. Modi over phone after results started pouring out from across the country.\n\nChandrababu congratulated Modi for crushing down the “corrupt and tyrannical rule” of the Congress and wished that the 63-year-old BJP leader would go on to lead India to becoming a super power.\n\nMr. Modi, in turn, congratulated the TDP chief on his party’s spectacular performance in the Assembly and Lok Sabha elections in Andhra Pradesh and Telangana.\n\nBesides MR. Modi, BJP president Rajnath Singh also called Chandrababu over phone as trends indicated that the TDP was on the way to form the government in (new) Andhra Pradesh by gaining lead in over 100 Assembly constituencies.\n\nChandrababu also congratulated Rajnath over the BJP and NDA’s performance in the general elections. -- PTI\n\nUnion Minister Shashi Tharoor of Congress retains Thiruvananthapuram, defeating O Rajagopal (BJP) by over 13,000 votes.\n\nSAD misled Jaitley on contesting from Amritsar: Amarinder: As trends showed him emerging victorious, former Punjab Chief Minister Amarinder Singh said a “disconnected” SAD leadership had “misled” BJP leader Arun Jaitley by convincing him to contest from Amritsar.\n\nMr. Singh was asked by reporters whether the SAD leadership had been right in inviting Mr. Jaitley to contest his first Lok Sabha election from Amritsar.\n\n“That’s where, I think, Akalis misled him. Because Akalis themselves have got disconnected from the public after being so long in power,” the Congress leader said.\n\nHe, however, said that he was still waiting for the final declaration of results as he did not believe in counting chickens before they hatch.\n\nThe former Punjab CM also said that battles can not be fought being on the defensive.\n\n“You can never win a battle being on defensive, you have to get on offensive and put the opponent on defensive. I was always in offensive mode, whether in Army or in politics. So we put Arun Jaitley on the defensive, we put (SAD leader Bikram Singh) Majithia on defensive,” he said.\n\nSpeaking on the poll trends in Amritsar, SAD leader Naresh Gujaral said: “I am surprised at the trends in Amritsar. I think comparatively lower voting in the city spoiled Mr. Jaitley’s chances.” -- PTI\n\nAzad loses from Udhampur seat: Union Health Minister Ghulam Nabi Azad of Congress has lost to BJP’s Jatindra Singh by a margin of 60,976 votes in the Udhampur Lok Sabha seat.\n\nMr. Azad, who was making his maiden bid from Jammu and Kashmir to the Lok Sabha, polled 4,26,393 votes, while Mr. Singh polled 4,87,369 votes.\n\nPDP came on the third place with just 30,461 votes. -- PTI\n\nModi takes unassailable lead over Kejriwal in Varanasi: BJP’s prime ministerial candidate Narendra Modi was set to win from Varanasi Lok Sabha seat by a huge margin.\n\nMr. Modi took an unassailable lead of 1.5 lakh votes over his closest rival, Arvind Kejriwal of the Aam Aadmi Party (AAP).\n\nIn the votes counted so far, Mr. Modi got over 2.32 lakh votes against Kejriwal (over 68,000), Vijay Prakash Jaiswal of the Bahujan Samaj Party (over 28,000) and Ajay Rai of the Congress was at a poor fourth with over 25,000 votes.\n\nKailash Chaurasiya of the Samajwadi Party was at the fifth position with just over 20,000 votes.\n\nBJP supporters and workers celebrated and burst crackers on the roads.\n\nMr. Modi is expected to come to the temple town on Saturday for a thanksgiving trip and will also take part in the Ganga Aarti, permission for which was denied when he wanted to do so May 10.\n\nMr. Modi won from Vadodara in Gujarat, which was the second constituency from where he contested, by over four lakh votes. -- IANS\n\nIndia Inc hails Modi victory, looks for bold reforms: Happy at the clear mandate given by voters to the BJP-led NDA, India Inc on Friday exuded confidence that Narendra Modi will initiate bold and decisive policy reforms to promote economic growth.\n\n“A clear mandate is positive for India. FICCI hopes that this mandate will help the leadership restore much needed investor confidence, attract higher investments and generate employment, especially in the manufacturing sector,” FICCI president Sidharth Birla said.\n\nMR. Modi appears all set to be the next Prime Minister with BJP likely to get a majority on its own, as per the results trend since this morning. BJP-led NDA is expected to get over 300 seats in the 16th Lok Sabha elections.\n\nAssocham president Rana Kapoor said: “A majority mandate gives hope of a stable government, paving the way for bold and decisive policy reforms. This can herald a sustainable 10 per cent growth of the economy in the next 18-24 months“.\n\nThe nation, Mr. Birla said, awaits an era of minimum government and maximum governance.\n\n“Industry must be seen as a key factor in the nation’s advancement by enabling efficient provision of goods and services and creation of jobs,” he added.\n\nWelspun Renewables Energy Vice-Chairman Vineet Mittal said: “This is a win for the people of India and demonstrates how young participation can transform the country.\n\n“Stable government with clear majority will boost confidence of the industry, global community and foreign investors.”\n\nPHD Chamber of Commerce president Sharad Jaipuria said: “Manufacturing sector reforms should be at the top of the agenda of the new government to enhance its growth and productivity to generate millions of employment opportunities in the economy”. -- PTI\n\nAt 2. 15 p.m. Mehbooba Mufti of PDP is being declared elected from Anantnag : Ahmed Ali Fayyaz reports : Position at 2: 15 pm. PDP Mehbooba Mufti: 1,96,814 votes NC Mehboob Baig: 1,34,477 votes.\n\nRahul Gandhi leads by a margin of 28,863 over Smriti Irani in Amethi\n\nAll India Trends (534/543) BJP - 280; INC - 44; Trinamool - 34; Shiv Sena - 19; AIADMK - 35; AAP - 4; TRS - 11; TDP - 13; CPI(M)- 8; SP - 7; YSRCP - 10; BSP - 1; BJD - 20 ; JD(U) - 2; RJD - 4\n\nNarendra Modi wins Vadodara seat by record margin of 5,70,128 votes -- PTI\n\nPrime Minister Manmohan Singh congratulates Narendra Modi over BJP’s victory in elections -- PTI\n\nIt is purely a BJP victory: Sushma Swaraj: Bhopal As trends indicated BJP’s triumph, Sushma Swaraj on Friday said it is purely a BJP victory as it got a majority of its own but ducked questions on her ministerial berth, saying it is the prerogative of the Prime Minister to form his own Cabinet.\n\n“This is a pure BJP victory. Although we have the numbers to form the government of our own without any pressures but we will form a government together with our allies,” Ms. Swaraj said.\n\nTo questions on her joining the Modi government, she termed them as “hypothetical” saying such queries were “premature”.\n\n“Such questions are hypothetical. It is the prerogative of the Prime Minister to form his own Cabinet and certain decisions are collectively taken by the Parliamentary Board.\n\nThus such questions are premature,” she told reporters when asked about her joining the Cabinet.\n\nThere are reports of her being miffed over not being offered a Cabinet berth of her choice and is reported to have told the BJP leadership that she be given a position according to her stature.\n\nShe is keen to get one of the key ministries among the top four -- Home, Defence, External Affairs or Finance. -- PTI\n\nNilekani concedes defeat as counting progresses: Infosys co-founder and Congress candidate from Bangalore South Nandan Nilekani has conceded defeat to his formidable rival BJP’s Ananth Kumar even as the counting of votes progressed.\n\n“I had been to counting centre few minutes ago. I concede defeat and congratulate Ananth Kumar for his performance in this poll,” Mr. Nilekani, the face of UPA’s flagship Aadhar programme, told PTI.\n\nTo a question, he said he would remain in politics, adding, “I will continue to work more for the city and the Congress party.”\n\nAsked what went wrong for him, Nilekani said “I’m happy with the campaign we have run. I’m happy with the way my supporters and Congress leaders worked along with me in this campaign. We have done our best and I remain happy with my decision to stand for election.”\n\nIn response to a question on Modi wave, he said “It is for people to decide.”\n\nMr. Nilekani, a greenhorn in politics, was locked in a tough fight with Mr. Kumar, a five-time MP from the middle-class dominated Bangalore South, which barring once in 1989, has never been receptive to the Congress since the late 1970s. -- PTI\n\nI accept people’s verdict: Karuanidhi: Kolappan reports from Chennai: DMK leader M. Karunanidhi said he would accept the outcome of the Lok Sabha election as the verdict of the people.\n\nAccepting the total defeat of the DMK and its allies in Tamil Nadu he said he bowed to the people’s verdict.\n\nMr Karunanidhi said the DMK in the past had witnessed similar defeats and also had achieved great victories. “As our party founder Anna said while we will not lose heart by defeat we will not allow victory to go into our head. We will continue to work for the welfare of the people.”\n\nHe congratulated the BJP on its major victory and its Prime Minister in waiting Narendra Modi.\n\nB. Kolappan, Our Correspondent reports from Chennai : People have reposed faith in AIADMK: Jayalalithaa: The Lok Sabha election results have reflected the faith reposed by the people of Tamil Nadu on the AIADMK and her leadership, Chief Minister Jayalalithaa said on Friday.\n\nTalking to reporters, she said termed the victory as “historic, unparallel and unprecedented”. The AIADMK has achieved this victory on its own without any partners.\n\nShe also thanked the people for conferring the distinction of the AIADMK “emerging as third largest party in Parliament.”\n\nShe said various welfare measures implemented by her government and it had benefitted the people. “They have expressed their love for my government,” she said.\n\nShe wished the new government and the new Prime Minister will. She hoped that the new government would be friendly towards the state.\n\n\"We will function as a responsible political party,” she said.\n\nAsked whether the AIADMK would support the BJP-led NDA, she said such a situation had not arisen now.\n\nOur Correspondent K. Manikandan reports : \" We (the BJP) are very happy. We are now in a very comfortable situation that we do not need to depend on the AIADMK for support for govt. formation at the Centre,\" said L. Ganesan (South Chennai BJP candidate).\n\nSonia, Rahul, Mulayam leading in UP: Congress president Sonia Gandhi and vice-president Rahul Gandhi are leading in Rae Bareli and Amethi with the party itself leading in only three seats out of the total 80 Lok Sabha seats in Uttar Pradesh.\n\nMs. Gandhi is ahead of her nearest rival BJP’s Ajay Agarwal by a margin of over 1,55,233 votes while Rahul is ahead of BJP’s Smriti Irani by 8022 votes. Rahul had won the 2009 elections from the seat by over 3.70 lakh votes.\n\nHowever, party candidate and External Affairs Minister Salman Khurshid was trailing on the fifth spot even behind the independent candidate in Farrukhabad seat.\n\nThe Samajwadi Party is leading on seven seats with party supremo Mulayam Singh Yadav leading from Mainpuri and Azamgarh by 1,37,013 and 18577 votes respectively.\n\nHis daugter-in-law, Dimple Yadav is leading Kannauj by 25,124 over her nearest rival Subrat Pathak of BJP.\n\nMr. Yadav’s nephew Akshay Yadav is leading by 9247 votes from Firozabad while another nephew Dharmedra Yadav is leading by 22,773 from Badaun.\n\nBJP’s young face Varun Gandhi is leading from Sultanpur while his mother Maneka Gandhi is leading from Pilibhit with a comfortable margin of over 90,000 votes.\n\nVarun is ahead of his nearest rival Pawan Pandey with a margin of 38,000 votes while Maneka is ahead with a margin of 90,435 votes from Pilibhit over her nearest rival Samajwadi Party’s Budhsen Verma.\n\nMukesh Rajput of BJP is leading the tally by a margin of 12,251 votes from Rameshwar Singh Yadav of Samajwadi Party.\n\nOn the third spot is BSP while independent Sachin Yadav is on the fourth spot.\n\nBJP candidate Uma Bharti, who is heading towards victory in Jhansi, attributed the winning trends to the disenchantment and anger of the people towards the UPA.\n\n“There was immense anger among the public towards the UPA and that is the reason why BJP is getting success in both the BJP and Congress-ruled states”, she told reporters.\n\nThe BJP leader, while attributing her success to the people of the constituency, god and Narendra Modi, said she would be fulfilling the promises made to the electorate here including creation of a separate Bundelkhand state.\n\nStressing that “very good days were ahead for Bundelkhand”, Bharti said she would also work for checking the exodus from the region because of hardships faced here. -- PTI\n\nModi takes mother’s blessings before taking up PM’s post: As he appeared to be all set to become the next Prime Minister, Narendra Modi today went to meet his mother to seek her blessings.\n\nMr. Modi, 63, bowed down before his mother Hiraba, who blessed him by putting both his hands on him, as the trends pointed to a clear win for the saffron party in Lok Sabha polls.\n\n“He has my blessings and he will lead the country towards development,” she said, when asked to comment on the counting trends.\n\nThe BJP Prime Ministerial candidate also sat with the family members and talked to his mother, who is staying with her other son Pankaj Modi in Gandhinagar.\n\nHe was also seen talking to the children of his brother’s family. -- PTI\n\nIt is BJP’s victory; It will be the Prime Minister’s prerogative to choose who will be in his Cabinet, says Sushma Swaraj . -- PTI\n\nArun Jaitley trails: Senior BJP leader Arun Jaitley, tipped to be a finance minister in a Modi government, was trailing former Punjab chief minister and Congress candidate Amarinder Singh by nearly 44,000 votes in the Amritsar seat on Friday.\n\nMr. Jaitley, the BJP and Shiromani Akali Dal alliance candidate who is contesting his first popular election, continued to trail Amarinder from the very first round after counting began Friday.\n\nThe BJP had replaced sitting Amritsar MP, cricketer-turned-politician Navjot Singh Sidhu, with Jaitley. Mr. Sidhu was elected MP from Amritsar in 2004, 2007 (by-election) and 2009.\n\nMr. Sidhu had differences with senior Akali leaders, especially chief minister Parkash Singh Badal and his son and deputy chief minister Sukhbir Singh Badal. Mr. Sidhu was also at loggerheads with Punjab BJP leaders who worked for his ouster from the seat.\n\nThe BJP never gave any reason for not fielding Sidhu from the seat this time.\n\nMr. Jaitley is a sitting Rajya Sabha MP from Gujarat. He is the leader of opposition in the Rajya Sabha but has never contested a popular election till now despite being one of the leading lights of the party and one of the closest to Mr. Modi. -- IANS\n\nDMK chief M. Karunanidhi congratulates BJP and its prime ministerial nominee Narendra Modi for its ‘big win’ -- PTI\n\nDinesh Verma from Puducherry reports : For the first time since counting began for the sole Puducherry Lok Sabha seat, R. Radhakrishnan of the ruling AINRC has edged ahead of his rival V. Narayanasamy of the Congress. When reports last came in, Mr. Radhakrishnan was ahead by 5,,256 votes.\n\nDakshina Kannada (Mangalore) Lok Sabha 2014 result: Sitting MP Nalin Kumar Kateel of the BJP defeats former Union Minsiter B. Janardhana Poojary of the Congress by a margin of 1,43,709 votes.\n\nDetailed Results: Nalin Kumar Kateel (BJP) 642739; B. Janardhana Poojary (Cong) 499030; Haneef Khan Kodaje (SDPI) 27254; K. Yadava Shetty (CPIM) 9394, M.R. Vasudeva (AAP) 5442; Moose Kunhi alias Abdul Kareem (BSP) 4471, Supreet Kumar Poojary (Ind) 657; Anand Gatti (Ind) 1116; K. Kushala Bellare (Ind) 801; Deepak Rajesh Coelho (Ind) 905; Maxim Pinto (Ind) 1072; Sudatta Jain Shirtady (Ind) 1613; Subramanya Gowda K. (Ind) 2450 K.N. Somasekhar (Ind) 3421; NOTA 7109; Rejected 109 Total votes polled 12,07,583 (Postal Ballots 463; Tendered votes 11). -- Our Mangalore Correspondent reports\n\nR. Srikanth, Our Reporter reports : At the end of the second round of counting in North Chennai, AIADMK got 63336 votes and DMK 45174 votes. This is the first time an AIADMK candidate has contested in the constituency for over two decades.\n\nAt 12.25 pm:Ahmed Ali Fayyaz: ANANTNAG: Mehbooba Mufti PDP leads by 38,042; BARAMULLA: Muzaffar Baig PDP leads by 10,922; SRINAGAR: Tariq Qarra PDP leads by 19,633; JAMMU: Jugal Kishore BJP leads by 1,47,448; UDHAMPUR: Dr Jitendra Singh BJP leads by 16,522; LADAKH Syed Kazim (NC proxy) leads by 1,614\n\nBJP veteran L K Advani secures winning lead: Veteran BJP leader L.K. Advani on Friday got a decisive lead of around two lakh votes over Congress candidate Kirit Patel in Gandhinagar Lok Sabha seat.\n\nMr. Advani, the five-time MP from Gandhinagar, got 3,58,389 votes while Mr. Patel polled 1,16,337 votes after eight rounds of counting.\n\nAs per the trends, BJP is moving ahead for a clean sweep in Gujarat, where the party is leading in all the 26 seats, riding on the wave in favour of their Chief Minister and Prime Ministerial nominee Narendra Modi.-- PTI\n\nAIADMK candidate lead by 36900 votes after 4th round at Kancheepuram (sc) seat : Staff Reporter : The AIADMK candidate for Kancheepuram (SC) seat, Maragatham Kumaravel has registered a lead of 36900 votes over her nearest rival G.Selvam of DMK after the completion of 4th round of counting of votes.\n\nSurprisingly, the NOTA has secured 3570 votes up to 4th round and when compared with the vote margin between the AIADMK and DMK candidates, it worked out to 9.67 percent of the lead.\n\nWhile Maragatham Kumaral has secured 105276 votes out of 227732 votes counted till 4th round, her nearest rival, Selvam secured 68376 votes in his favour.\n\n>@narendramodi tweets: India has won! Bharat ki vijay! Achche din aane wale hain! (India has won! Good days are ahead)\n\nSocial media buzzes with Modi wave: As BJP inches towards a thumping victory, social media is abuzz with tweets and posts about the party’s race to the coveted 272-majority number.\n\n#Results2014, #PMNaMo, #Elections2014 and #raceto272 were some of the top trending hashtags on Twitter, while posts with BJP’s election message “Ab Ki Baaar Modi sarkaar” filled Facebook timelines.\n\nA tweet from journalist Sagarika Ghose reads: “Modification: even if Rahul wins Amethi, the worst Cong result ever must lead to an immediate end to Family raj #Verdict2014”, while another wrote “Whoever wins, am hoping 4 a corruption free India, a stable economy, a safe country, less unemployment. M happy 2b a part of #Raceto272“.\n\nThe BJP-led NDA appears to be heading for a victory in the Lok Sabha elections with the trends in the counting of votes giving the saffron party leads in 257 seats on its own while its allies led in 39 seats. The Congress was struggling with leads only in 45 seats.\n\nBJP’s prime ministerial candidate Narendra Modi was leading with 1.43 lakh votes in Vadodara, Gujarat and Congress President Sonia Gandhi was leading with over 3,000 votes in Rae Bareli.\n\nSearch giant Google, which features a special Doodle (featuring election ink painted on the index finger) on its India homepage, is offering live results as the votes are counted.\n\nSocial networking giant Facebook said 29 million people in India have made 227 million interactions through posts, comments, shares, and likes about the elections from the day they were announced on May 12.\n\nThat is about two-thirds of all daily active Facebook users in India and an average of 10 interactions per person, it added.\n\nIn addition, 13 million people made 75 million interactions regarding Narendra Modi.\n\n“During the election, Narendra Modi became the second most-liked politician on Facebook, behind only President Obama. Arvind Kejriwal also joined the ranks of the top five liked politicians globally,” it said.\n\nWith over 23 million voters in the age group of 18-19 years, India is the third largest Internet users base globally (of more than 238 million users) with a majority comprising of youth.\n\nA study by IRIS Knowledge Foundation and Internet and Mobile Association of India (IAMAI) says there are 160 high impact constituencies in India out of 543, which are likely to be influenced by social media during the general elections. -- PTI\n\nOur Kancheepuram Correspondent : NOTA’s impressive performance: The 12th non-serious contender for Kancheepuram (SC) constituency - 'None of the above’ (NOTA) has recorded a steady performance in the first three rounds of ballot counting completed so far (till noon).\n\nWhile nearly 1.50 per cent out of 57758 votes counted in the first round, are recorded in favour of NOTA, the percentage rose to 1.66 per cent out of 56554 votes counted in the second round and to 1.69 per cent out of 55285 votes counted in the subsequent round.\n\nJaswant Singh trails in Barmer: Former BJP leader Jaswant Singh, who is fighting as an Independent from Barmer constituency in Rajasthan, was trailing by a big margin against BJP’s Col. Sona Ram, latest counting trends of the April-May parliamentary polls showed early on Friday.\n\n“After counting of over 22 percent votes by 11 a.m., Col. Sona Ram had taken a lead of over 41,000 votes over his nearest rival Jaswant Singh,” a poll official said.\n\nJaswant Singh represented Darjeeling in the outgoing 15th Lok Sabha.\n\nHe wanted to contest from Barmer but the party fielded Col. Sona Ram, who recently switched to the BJP from the Congress. Mr. Singh filed nomination as an Independent candidate whereafter he was expelled from the BJP.\n\nMr. Singh was irked at not being considered for nomination from the constituency.\n\nHe hails from Jasol village in Barmer district. He was a member of the union cabinet during the BJP-led National Democratic Alliance government. -- IANS\n\nLok Sabha elections results: Leads: Total: 543, BJP+ 328; Congress+ 63, Others 152\n\nOur Correspondent Kavitha Kishore : The 888 ballot votes in the North Chennai Constituency had to be recounted after objections were raised over the authenticity of the results.\n\nThe recounting, which took a little over three hours, slowed down the counting process in the constituency where AIADMK's T.G. Venkatesh Babu is pitted against DMK's Girirajan. Counting for all the six assembly segments has been very slow.\n\nThe security at the Queen Mary's College counting centre was intensified and even counting agents who were carrying passes were not allowed to carry cellphones inside.\n\nBJP prime ministerial candidate Narendra Modi wins Varanasi defeating AAP's Arvind Kejriwal.\n\nCong totters as Modi wave sweeps Gujarat: Congress seemed to be staring at a complete rout in BJP prime ministerial candidate Narendra Modi’s home turf of Gujarat, where trends available till noon showed BJP is leading in all 26 Lok Sabha seats.\n\nIt seems people have voted in unison to turn into reality their son-of-soil’s dream to attain the PM’s chair.\n\nAmong prominent candidates, Mr. Modi himself is leading by over four lakh votes in Vadodara constituency, while BJP patriarch Advani is also ahead of his rival in his traditional Gandhinagar seat.\n\nAccording to trends, Union ministers Tushar Chaudhary (Bardoli), Bharat Solanki (Anand) and Dinsha Patel (Kheda) -- all Congress -- are trailing behind their BJP rivals who have secured a modest margin.\n\nIn other two prominent seats of Sabarkantha and Chhota Udepur, two former Union ministers Shankarsinh Waghela and Naran Rathwa are trailing behind BJP nominees.\n\nFormer Union minister and Leader of Opposition in state Assembly, Shankarsinh Waghela (1,16,684) is trailing behind Dipsinh Rathod (1,46,648) of BJP who has secured a lead of 29,964 votes.\n\nFormer Union minister and Congress leader Naran Rathwa is trailing in Chhota Udepur against BJP’s Ramsinh Rathwa. -- PTI\n\nBengal trend shows victory for TMC, setback for Left and arrival of BJP:Our Kolkata Bureau: Initial trend of counting in West Bengal points towards a best-ever performance for the Trinamool Congress, which is leading on 33 of the 42 seats in the State. The trend has come as major setback for the Left Parties who are leading on one seat in the State’s Murshidabad district.\n\nThe BJP has emerged as a major force whose candidates are leading on three seats in Darjeeling, Alipurduar and Asansol Lok Sabha seats. The counting of votes so far have pointed out that the BJP’s vote share has increased three times from 6 percent it got in the last elections to 17.5 percent in the votes counted so far.\n\nThe Congress whose candidates are leading on five seats, has maintained its stronghold in districts of Malda and Murshidabad.\n\nIn entire south Bengal, the Trinamool Congress is leading on almost all seats. The party has registered about 39.8 percent votes polled and counted so far. The vote share of the Left parties have reduced significantly registering about 29.4 percent votes.\n\nActress Moon Mon Sen is leading over seven time CPI(M) MP Basudeb Acharya by over 15,000 votes. The other star candidates like Dev, Sandya Roy of the Trinamool Congress are also leading.\n\nBJP’s Babul Supriyo is comfortably ahead of the Trinamool Congress candidate Dola Sen in the Asansol Lok Sabha seat by 24,000 votes.\n\nIn Darjeeling BJP’s S S Ahluwalia is leading over Trinamool’s Bhaichung Bhutia by 21,000 votes.\n\nNetaji Subhas Chandra Bose grand nephew and Harvard University historian Sugata Bose is all set to win the Jadavpur Lok Sabha seat and now has a lead of 50,000 votes.\n\nPresident Pranab Mukherjee son Abhijit Mukherjee and Mamata Banerjee’s nephew Abhishek Banerjee are both facing a strong challenge in their respective seats and are leading by a few thousand votes from their nearest political rivals.\n\nIn Kolkata Dakshin , AITC’s Subrata Bakshi is leading over BJP’s Tathagatha Roy while in Kolkata Uttar too the battle is between Trinamool Congress and BJP with AITC’s Sudip Bandyopadhya leading over Rahul Sinha of BJP.\n\nThiruvallur constituency from our correspondent P. Oppili : Update: Third round 11.35 am declared - Mr. Venugopal of AIADMK – 27,288, followed by Mr. Ravikumar of VCK – 12,832, and Mr. Yuvaraj of DMDK – 9520 and NOTA – 966.\n\nVidya Subrahmaniam : Sonia leading by over one lakh votes and Rahul doing so badly in Amethi shows who is the leader in the Congress\n\nL K Advani congratulates Narendra Modi over BJP’s excellent performance in Lok Sabha polls (PTI)\n\nSruthisagar Yamunan : While DMK may not win a single seat, they still retain second spot in Tamil Nadu. Clearly shows the State is still a direct contest between the two Dravidian parties.\n\nK. Manikandan from Chennai reports: Counting for South Chennai Lok Sabha constituency at Anna University began behind schedule. Around 11 a.m., the first round of counting of votes for only Velachery and Saidapet Assembly segments were officially declared.\n\nThere was some confusion over tallying of votes which was the reason for the delay, official sources said. Thick blanket of security covered the entire university premises, with several hundred policemen and armed paramilitary policemen guarding the strong rooms where the EVMS were placed. Candidates’ agents were prevented from taking in their mobile phones, but some of them managed to sneak them inside.\n\nAt the end of the first round of counting of votes, J. Jayavardhan of AIADMK was leading with 3,592 votes in Velachery Assembly segment, ahead of his principal rival T.K.S Elangovan of DMK, who polled 2,611 votes. L. Ganesan of BJP polled 1,507 votes.\n\nMr. Jayavardhan polled 4442 votes at the end of first round of counting at Saidapet Assembly segment, where Mr. Elangovan and Mr. Ganesan polled 2701 and 1668 votes respectively.\n\nBJP leading in all 7 LS seats in Delhi: BJP was leading in all seven Lok Sabha seats in the national capital in what appears to be a direct contest against Aam Aadmi Party while Congress was in third position as per latest trends.\n\nIn prestigious Chandni Chowk seat, Delhi BJP chief Harsh Vardhan was leading by 9,920 votes against AAP’s Ashutosh.\n\nBJP’s Meenakshi Lekhi was leading by 7,523 votes against AAP’s Ashish Khaitan in New Delhi constituency.\n\nIn South Delhi constituency, BJP’s Ramesh Bidhuri was leading by a margin of 9,487 votes against AAP candidate Devinder Sehrawat.\n\nBJP’s Parvesh Verma was leading by a huge margin of 42,794 votes in West Delhi constituency against AAP’s Jarnail Singh.\n\nIn North East Delhi seat, BJP candidate Manoj Tiwari was leading by 19,433 votes against AAP’s Anand Kumar.\n\nUdit Raj of BJP was ahead by 18,410 votes in North West Delhi constituency against AAP’s Rakhi Birla.\n\nThe Congress had won all the seven seats in 2009 Lok Sabha polls. The exit polls have predicted 5 to 7 seats for BJP this time. -- PTI\n\nVaranasi: BJP’s prime ministerial candidate Narendra Modi is leading by 7299 votes against his nearest rival Arvind Kejriwal of Aam Aadmi Party. -- PTI\n\nLK Advani leading from Gandhinagar; BJP in Gujarat: BJP patriarch L.K. Advani is leading with a margin of 1830 votes against Congress candidate Kirit Patel in Gandhinagar Lok Sabha constituency. The five time MP from Gandhinagar Lok Sabha seat Advani has so far got 7579 votes while Patel, who has been repeated by Congress, has got 5746. As per the primary trends of counting, BJP is leading on all the 26 Lok Sabha seats in Gujarat.-- PTI\n\nPUDUCHERRY: V. Narayanasamy is consolidating his lead in the lone Lok Sabha seat of Puducherry. As of 10 a.m., the Congress leader had established a lead of 9,489 votes over his nearest rival R. Radhakrishnan of the ruling AINRC (22,140). M.V. Omalingam of the AIADMK has a tally of 12,825 votes as the number of votes counted aggregated 70,000 in this constituency with an electorate of 8.85 lakh voters.\n\nBJP’s prime ministerial nominee Narendra Modi is leading by a whopping 1.68 lakh votes over his Congress rival Madhusudan Mistry in Vadodara. Initial trends showed Mr. Modi getting 2,34,647 votes and Mr. Mistry 66,531. Apart from Vadodara, Mr. Modi is also contesting from Varanasi in Uttar Pradesh where he is pitted against Aam Aadmi Party leader Arvind Kejriwal and Ajay Rai of Congress. Initial trends from 18 out of 26 seats in Gujarat showed BJP is leading in 17 seats and Congress in one. -- PTI\n\nMeira, Rabri, Shahnawaz trail in Bihar: BJP is leading in 17 seats while Lalu Prasad’s RJD is leading in 5 seats in the 40 Lok Sabha seats in Bihar.\n\nLJP and JD(U) were leading in 2 seats each while Rashtriya Lok Samata Party (RLSP), an ally of BJP, in one seat.\n\nIn the high-profile Saran seat, Lalu Prasad’s wife Rabri Devi is trailing Rajiv Pratap Rudy of BJP by 1650 votes.\n\nBJP’s actor-politician nominee Shatrughan Sinha and RJD’s Misa Bharti are ahead of their opponents, Election Commission sources said.\n\nIn the Sasaram (SC) seat, Meira Kumar is trailing behind her BJP nominee Chhedi Paswan by 6239 votes after the second round of counting, the sources.\n\nIn Patliputra seat, Lalu Prasad’s daughter Misa Bharti is ahead of her uncle and BJP nominee Ramkripal Yadav by 2800 votes.\n\nIn the Patna Sahib seat, actor-politician Shatrughan Sinha is ahead of his nearest Congress rival and Bhojpuri actor Kunal Singh by 665 votes.\n\nIn Bhagalpur, BJP’s Shahnawaz Hussain is behind RJD’s Shailesh Kumar alias Bullo Mandal by 3000 votes.\n\nIn Purnia, JD(U)’s Santosh Kushwaha is ahead of his BJP rival Udai Singh by 2000 votes.\n\nIn minority-dominated Kisanganj, Congress Maulana Asrarul Haque is ahead of his BJP competitor Dilip Jaiswal by 2618 votes.\n\nIn Darbhanga, RJD’S M A A Fatmi is ahead of his BJP rival Kirti Azad by 450 votes.\n\nIn Jamui (SC) seat, Ramvilas Paswan’s son Chirag Paswan is ahead of his nearest JD(U) rival and Bihar Assembly Speaker Udai Narayan Choudhary by 3248 votes.\n\nBuxar is throwing a surprise with BSP’s Dadan Singh ahead of his nearest BJP rival Ashwani Choubey by 328 votes. -- PTI\n\nOur Correspondent P. Sunderarajan reports from Bhopal, Congress seems to be losing early gains. Fortunes reverse in two Constituencies -- Bhind and Mandla. Party now leading in 2 constituencies - Guna and Balaghat.\n\nAnbumani Ramadoss leading by over 15,000 votes in Dharmapuri\n\nKarti Chidambaram fighting for fourth place in Sivaganga, reports J. Walter Scott from Ramanathapuram\n\nTIRUNELVELI : 1. K.R.P. Prabhakaran (AIADMK) - 23261; 2. C. Devadhasasundram (DMK) - 13593, 3. Sivananainthaperumal (DMDK) - 6254: 4. Ramasubu (Cong.) - 3228.\n\nBJP leading in Dakshina Kannada (Mangalore) LS constituency by 1,06,210 votes against Congress, Our Correspondent K Raviprasada reports.\n\nOur Correspondent Omar Rashid reports at 10.06 a.m. that Congress vice-president Rahul Gandhi is trailing in Amethi to BJP's Smriti Irani.\n\nPraful Patel of NCP trails\n\nPuducherry LS seat: V. Narayanasamy (Congress) leading by a margin of 3,643 votes securing 10,290 votes. R. Radhakrishnan of AINRC pushed to third spot with 5,435 votes while M V Omalingam (AIADMK) has edged up to second place with 6,647 votes, says Dinesh Verma from Puducherry.\n\nFirst result: Ajit Singh, RLD Chief, loses to Satyapal Singh, Former Mumbai Police Commissioner, of BJP in Baghpat, Our Correspondent Omar Rashid reports.\n\nMeenakshi Natarajan of Congress trails by 12,255 votes in Mandsour in Madhya Pradesh, Our Correspondent P. Sunderarajan reports from Bhopal.\n\nCongress leader Abhishek Singhvi says its looking bleak for party: Vinay Kumar from New Delhi\n\nFormer Union Minister A. Raja trails by 5,000 votes in Nilgiris, TV reports.\n\nBJP’s Sushma Swaraj is leading by a margin of 3,552 votes against Laxman Singh of Congress from Vidisha seat in Madhya Pradesh. -- PTI\n\nSenior BJP leader Arun Jaitley was trailing behind former Punjab Chief Minister Amarinder Singh in the Amritsar Lok Sabha constituency. Jaitley was trailing by over 1800 votes, according to initial trends at 0900 hrs. -- PTI\n\nBJP’s Dinesh Kashyap is leading in Naxal-hit Bastar Lok Sabha constituency of Chhattisgarh. Kashyap is leading by 278 votes against Congress candidate Deepak Karma, according to trends at 9 AM. Chhattisgarh has 11 Lok Sabha seats. -- PTI\n\nCPI(M) leader M.A. Baby trailing by 6404 votes in Kollam, says Anil S. Radhakrishnan.\n\nIn Shillong Lok Sabha constituency Congress candidate anf former Union Minister Vincent H. Pala is leading by a margin of 2004 votes over his nearest Independent rival, Sushanta Talukdar says.\n\nZakir Hussain of Indian National Lok Dal leading in Gurgaon with over 8000 votes. AAPs Yogendra Yadav at fifth position. says Ashok Kumar in Gurgaon\n\nKannur LS constituency PK Sreemathy of CPI M leading by 4261 votes, says Mohamed Nazeer Pulsaragath.\n\nAnto Antony of INC leads by a margin of 5550 votes over Peelipose Thomas of LDF after 2nd round. NOTA: 1687. K Radhakrishnan Nair from Pathanamthitta\n\nRailway Minister Mallikarjun Kharge trails by 444 votes after first round in Gulbarga, reports T.V. Sivanandan from Gulbarga\n\nKannur: PK Sreemathy of CPI M leading by 811 votes, reports Mohamed Nazeer Pulsaragath from Kannur\n\nKrupal tumane of shiv sena leads in Ramtek in Maharashtra, says Priyanka Kakodkar from Mumbai\n\nLok Sabha elections results: Leads: Total: 318, BJP+ 174; Congress+ 64, Others 80\n\nCongress vice-president Rahul Gandhi regains lead in Amethi Lok sabha constituency, Our Correspondent Atiq Khan reports at 9.01 a.m.\n\nNarendra Modi, BJP’s prime ministerial candidate, was leading by over 25,000 from Vadodara in Gujarat while former Chief Minister Shankarsinh Vaghela was leading by 187 votes from Sabarkanta. -- PTI\n\nIn Madhya Pradesh: BJP up in Dewas, Rajghar, Ratlam, Sagar, Vidisha. Congress in Betul, Mandala, and Sidhi, Our Correspondent in Bhopal reports\n\nSharad Yadav trails in Madhepura - IANS\n\nSachin pilot leads in Ajmer in Rajasthan, says Our Correspondent.\n\nNitin Gadkari of BJP leads in Nagpur, says Priyanka Kakodkar.\n\nRajnath Singh leading in Lucknow, Our Correspondent reports\n\nYeddyurappa leading Shimoga\n\nAzharuddin is trailing, INC leads in Shillong\n\nK. Raviprasada : BJP leading in Dakshina Kannada (Mangalore) LS constituency by 47,188 votes\n\nSmriti Irani leading in Amethi, says our correspondent Atiqur Rehman Khan\n\nS Harpal Singh from Adilabad: TRS leads by 2,000 votes over Congress at Khanapur (ST) Assembly constituency in Adilabad Dist (AP) after first round\n\nFirst Trends in Tamil Nadu: AIADMK - 11\n\nGujarat: BJP 7, Congress 1\n\nKarnataka: BJP 16, Congress 11, JDS 1 . NandanNilekanni is trailing in Bangalore South\n\nUttar Pradesh: BJP 13, Congress 1, SP 3\n\nWest Bengal: TMC 7, Left 4, Congress 1\n\nKerala: UDF 7, LDF 5\n\nMaharashtra: Congress 2\n\nHimachal Pradesh: BJP 4\n\nAndhra Pradesh: TDP 1\n\nHaryana: Congress 2\n\nJammu and Kashmir: Congress 1\n\nSenior BJP leader L.K. Advani leads in Gandhinagar and UPA chairperson Sonia Gandhi in Rae Bareli\n\nGopinath Munde of BJP is leading in Beed, says our Correspondent Alok Deshpande\n\nUnion Minister Sashi Tharoor ahead by 505 votes in Thiruvananthapuram, says Our Correspondent\n\nBJP leading in one constituency in Rajasthan ,Aarti Dhar from New Delhi reports.\n\nEarly signs in Tamil Nadu - AIADMK leads in Salem as counting begins, Our Correspondent from Salem reports.\n\nCongress-led UDF leading in 9 constitutencies in Kerala; Opposition LDF in 4. Total seats 20, Our Correspondent from Thiruvananthapuram reports. Congress spokesman P.C. Chacko ahead in Chalakudy, Our Correspondent from Thiruvananthapuram adds.\n\nCounting in Coimbatore begins. 2776 postal ballots to be counted, Our Correspondent from Coimbatore.\n\nOur Madurai Correspondent says, counting Agents pick up quarrel with police at counting hall of Sivakasi Assembly segment of Virudhunagar LS seat as at least a dozen of them not allowed.\n\nLDF ahead in Kollam, Aalappuzha, says Our Correspondent from Thiruvananthapuram\n\nDakshina Kannada (Mangalore) LS constituency. Ex union minister in late Indira Gandhi cabinet B Janardhana Poojary of Congress Is trailing by 3343 votes , says Our Correspondent from Mangalore\n\nCounting of votes of Palakkad and Alathur costituencies start at govt victoria college and nss college of engineering with counting of postal votes: G. Prabhakaran from Palakkadu\n\nFate of about 8,000 candidates at stake. 18 lakh EVMs to be opened.\n\nCounting of votes begins at 989 counting centres across the country.\n\nCounting of votes begin\n\nCounting of votes, the grand finale in the nine-phased Lok Sabha elections, began across the country.\n\nElection Commission said the counting exercise to be held at 989 counting centres is likely to be completed by 4 p.m. and trends will start emerging by 9.30 a.m.\n\nBy noon, a final picture could emerge on who would be the major players in the 16th Lok Sabha.\n\nOf 989 counting centres, maximum are in Andhra Pradesh at 168 followed by 98 in West Bengal, 76 in Uttar Pradesh, 64 in Odisha, 51 in Assam and 48 in Maharashtra.\n\nAhead of the counting of votes, Chief Election Commissioner V.S. Sampath had said on Fridayday that the large voter turnout was a result of “good” electoral rolls prepared by the poll authorities across the country.\n\nHe had said that “a lots of steps have been taken to ensure that those eligible to vote find their names in the electoral lists.”\n\nThe exercise to add fresh voters was carried out even days before the first phase of polling was held on April 7.\n\n8,251 candidates, including top guns Narendra Modi, Sonia Gandhi, Rahul Gandhi and Arvind Kejriwal were in the fray, in the largest-ever electoral exercise held in Indian history.\n\nWhile national parties -- Congress, BJP, BSP, CPI, CPI (M) and NCP -- fielded a total of 1,591 candidates, the 47 state parties fielded 529 candidates. While the over 1,600 registered but unrecognised political parties fielded 2,897 candidates, 3,234 Independents were also in the fray.\n\nThe exit polls have projected that BJP will emerge as the single largest party.\n\nThe ‘ballot unit’ is switched on in the presence of senior poll officials and counting agents of candidates and the result command keyed in to get results per machine.\n\nThese were the first Lok Sabha elections when the option of ‘none of the above’ or NOTA was introduced on the EVMs following Supreme Court directions. Before NOTA button was installed on EVMs, voters had to fill up form 49 ‘O’ at the polling station which compromised their identity.\n\nSeeking to ensure transparency, EC has deployed micro observers at all counting tables. The returning officers have been directed to provide printout of each counting round and every table to the counting agents of candidates.\n\nLok Sabha elections 2014 witnessed the highest-ever turnout with 66.38 per cent of an estimated 814 million voters exercising their franchise -- the highest ever in the history of general elections.\n\nOur Kerala correspondent Roy Mathew : 36-hour wait for the results end as counting of begins in Kerala. Postal results are being counted first. Counting of votes starts at 140 counting centres in Keala shortly.\n\nPranav, we must just wait for a couple of hours. Counting is almost upon us.....just a few minutes more, says Amit Baruah, our Mumbai Resident Editor\n\nThe first trends will be available after 9 a.m.\n\nIt's a big day for India as the counting for the 16th Lok Sabha is about to begin, says our Mumbai Resident Editor Amit Baruah.\n\n“This time, actually for the first time we have prohibited some of the hate speakers from conducting meetings,” >CEC V.S. Sampath told The Hindu .\n\nCounting of votes in Goa will begin at 8 a.m.Counting of votes will begin in Goa for the votes of two Lok Sabha constituencies amid tight security, at 8 am on Friday in one centre in Panaji in north Goa for North Goa parliamentary constituency and two centres in Margao in south Goa for South Goa parliamentary constituency. First postal ballots will be taken up for counting, EC officials said, says Goa correspondent Prakash Kamat from Panaji.\n\n23,161,296 electors aged between 18 and 19 years in 2014, says Amit Baruah @abaruah64. #THresults @the_hindu\n\nWith the entire nation watching him, BJP’s prime ministerial candidate Narendra Modi will be spending today, counting day in Gujarat. With most exit polls predicting a majority for the National Democratic Alliance, the mood in the BJP is upbeat.\n\nThe confidence in the BJP camp is so supreme. The nervousness in the Congress quarters so evident that the fact that all pollsters got their forecasts wrong in the 2004 and 2009 election hardly figures in the projected scenarios.\n\nBy noon, a broad picture of the nationwide trends will be known.\n\nBy 2 p.m., the contours of the next Lok Sabha and possibly the new government will emerge.\n\nPostal ballots will be counted first, from 8 a.m. Half an hour later, the counting of votes recorded in the electronic voting machines (EVMs) will be taken up.\n\nWatch the minute-by-minute update of counting day as it unfolds.\n\nYou can track us on twitter at >@the_hindu . Tweet us our queries with #THresults .\n\nThe Hindu welcomes you to counting day of Lok Sabha elections 2014, which will go down as one of the most intensely fought in the electoral history of independent India.\n\nIn 1977 and 1989, it was a case of the Congress versus the rest of the opposition. This time, the opposition is divided down the middle and yet the Congress is feeling the heat."}, {"url": "https://www.myneta.info/ls2014/candidate.php?candidate_id=3263", "page_content": "Loksabha 2014 TATHAGATA SATPATHY (Winner) DHENKANAL (ORISSA) Party:BJD S/o|D/o|W/o: Late Devendra Satpathy Age: 57 Name Enrolled as Voter in: 55 Dhenkanal (Orissa) constituency , at Serial no 703 in Part no 161 Self Profession:Jornalism\n\nSpouse Profession:CEO Navajat Printers and Media (P) Ltd.\n\nOther Elections Declaration in Declared Assets Declared Cases Lok Sabha 2009 Rs55,15,930\n\n~55 Lacs+ 13 Lok Sabha 2004 Rs27,75,930\n\n~27 Lacs+ 5 Click here for more details Crime-O-Meter\n\nNumber of Criminal Cases: 7 Number of Criminal Cases: Assets & Liabilities Assets:Rs 3,54,34,099 ~3 Crore+ Liabilities:Nil Educational Details Others Completed Education at SRI Arobindo International Centre of Education (No Certificate Ever issued at this institute)\n\nDetails of PAN and status of Income Tax return\n\nRelation Type PAN Given Financial Year Total Income Shown in ITR self Y 2012 - 2013 Rs 68,67,874 ~ 68 Lacs+ spouse Y 2012 - 2013 Rs 60,87,303 ~ 60 Lacs+ dependent1 N None Rs 0 ~ dependent2 N None Rs 0 ~ dependent3 N None Rs 0 ~\n\nDetails of Criminal Cases\n\nCases where Charges Framed Serial No. IPC Sections Applicable Other Details / Other Acts / Sections Applicable 1 499, 500, 501, 502 ICC 31/10, Cognizance and Frame Court JMFC (R) Cuttack, Charges frame Year 2010 2 499, 500, 501, 502 ICC 2710/08, Cognizance and Frame Court JMFC BBSR, Charges frame Year 2008 3 499, 500, 501, 502 ICC 27/98, Cognizance and Frame Court JMFC Cuttack, Charges frame Year 1998 4 499, 500, 501, 502 ICC 18/06 Cognizance and Frame Court SDJM Kantabanjhi, Charges frame Year 2006 Cases where Cognizance Taken Serial No. IPC Sections Applicable Other Details / Other Acts / Sections Applicable 1 499, 500, 501, 502 ICC 3208/08,Cognizance and Frame Court SDJM Khurda, 2 499, 500, 501, 502 ICC 3809/08, Cognizance and Frame Court SDJM, Balasore 3 499, 500, 501, 502 ICC 325/08 Cognizance and Frame Court SDJM Khurda, Cases where Convicted Serial No. IPC Sections Applicable Other Details / Other Acts / Sections Applicable ---------No Cases-------- Brief Details of IPCs 7 charges related to Punishment for Defamation (IPC Section-500) 7 charges related to Printing or engraving matter known to be defamatory (IPC Section-501) 7 charges related to Sale of printed or engraved substance containing defamatory matter (IPC Section-502) 7 charges related to Defamation (IPC Section-499)\n\nNo Problems in Reading Affidavit Information\n\nDisclaimer: This information is an archive of the candidate's self-declared affidavit that was filed during the elections. The current status of this information may be different. For the latest available information, please refer to the affidavit filed by the candidate to the Election Commission in the most recent election.\n\nSr No Description self spouse dependent1 dependent2 dependent3 i Cash 50,000 50 Thou+\n\n\n\n20,000 20 Thou+\n\n\n\nNil Nil Nil Rs 70,000\n\n70 Thou+ ii Deposits in Banks, Financial Institutions and Non-Banking Financial Companies SBI Parliament House A/C No. 10023815866\n\n35,72,632.10 35 Lacs+\n\n\n\nAXIS Bank BBSR A/C No. 024010100000043\n\n80,38,815.82 80 Lacs+\n\n\n\nAXIS Bank Bhubaneswar A/C No.024010100000051\n\n40,56,630.79 40 Lacs+\n\n\n\nNil Nil Nil Rs 1,56,68,078.71\n\n1 Crore+ iii Bonds, Debentures and Shares in companies 400 equity\n\n40,000 40 Thou+\n\n\n\n300 Equity\n\n30,000 30 Thou+\n\n\n\nNil Nil Nil Rs 70,000\n\n70 Thou+ iv (a)\n\nNSS, Postal Savings etc Nil Nil Nil Nil Nil Nil\n\n(b)\n\nLIC or other insurance Policies Nil Nil Nil Nil Nil Nil\n\nv Personal loans/advance given Nil Nil Nil Nil Nil Nil\n\nvi Motor Vehicles (details of make, etc.) Nil Maruti ECCO OD02p1046 2014\n\n3,86,020 3 Lacs+\n\n\n\nMaruti Omni\n\n2,40,000 2 Lacs+\n\n\n\nNil Nil Nil Rs 6,26,020\n\n6 Lacs+ vii Jewellery (give details weight value) Nil 500 gms Jewellery\n\n15,00,000 15 Lacs+\n\n\n\nNil Nil Nil Rs 15,00,000\n\n15 Lacs+ viii Other assets, such as values of claims / interests Nil Nil Nil Nil Nil Nil\n\nGross Total Value (as per Affidavit) 1,17,01,448.92 1 Crore+ 62,32,650 62 Lacs+ Nil Nil Nil Rs 1,79,34,098.92\n\n1 Crore+ Totals (Calculated as Sum of Values) Rs 1,17,01,447.92\n\n1 Crore+ Rs 62,32,650.79\n\n62 Lacs+ Nil\n\nNil\n\nNil\n\nRs 1,79,34,098.71\n\n1 Crore+\n\nNo Problems in Reading Affidavit Information Details of Movable Assets Sr No Description self spouse dependent1 dependent2 dependent3 i Cash 50,000 50 Thou+\n\n\n\n20,000 20 Thou+\n\n\n\nNil Nil Nil Rs 70,000\n\n70 Thou+ ii Deposits in Banks, Financial Institutions and Non-Banking Financial Companies SBI Parliament House A/C No. 10023815866\n\n35,72,632.10 35 Lacs+\n\n\n\nAXIS Bank BBSR A/C No. 024010100000043\n\n80,38,815.82 80 Lacs+\n\n\n\nAXIS Bank Bhubaneswar A/C No.024010100000051\n\n40,56,630.79 40 Lacs+\n\n\n\nNil Nil Nil Rs 1,56,68,078.71\n\n1 Crore+ iii Bonds, Debentures and Shares in companies 400 equity\n\n40,000 40 Thou+\n\n\n\n300 Equity\n\n30,000 30 Thou+\n\n\n\nNil Nil Nil Rs 70,000\n\n70 Thou+ iv (a)\n\nNSS, Postal Savings etc Nil Nil Nil Nil Nil Nil\n\n(b)\n\nLIC or other insurance Policies Nil Nil Nil Nil Nil Nil\n\nv Personal loans/advance given Nil Nil Nil Nil Nil Nil\n\nvi Motor Vehicles (details of make, etc.) Nil Maruti ECCO OD02p1046 2014\n\n3,86,020 3 Lacs+\n\n\n\nMaruti Omni\n\n2,40,000 2 Lacs+\n\n\n\nNil Nil Nil Rs 6,26,020\n\n6 Lacs+ vii Jewellery (give details weight value) Nil 500 gms Jewellery\n\n15,00,000 15 Lacs+\n\n\n\nNil Nil Nil Rs 15,00,000\n\n15 Lacs+ viii Other assets, such as values of claims / interests Nil Nil Nil Nil Nil Nil\n\nGross Total Value (as per Affidavit) 1,17,01,448.92 1 Crore+ 62,32,650 62 Lacs+ Nil Nil Nil Rs 1,79,34,098.92\n\n1 Crore+ Totals (Calculated as Sum of Values) Rs 1,17,01,447.92\n\n1 Crore+ Rs 62,32,650.79\n\n62 Lacs+ Nil\n\nNil\n\nNil\n\nRs 1,79,34,098.71\n\n1 Crore+ Disclaimer: This information is an archive of the candidate's self-declared affidavit that was filed during the elections. The current status of this information may be different. For the latest available information, please refer to the affidavit filed by the candidate to the Election Commission in the most recent election. Data Readability Report of Movable Assets :No Problems in Reading Affidavit Information No Problems in Reading Affidavit Information Details of Immovable Assets Sr No Description self spouse dependent1 dependent2 dependent3 i Agricultural Land Nil Nil Nil Nil Nil Nil\n\nii Non Agricultural Land Part of 107-Surya Nagar\n\nTotal Area 1/2 acre\n\nBuilt Up Area\n\nWhether Inherited Y\n\nPurchase Date 2013-12-23\n\nPurchase Cost 0.00\n\nDevelopment Cost 0.00\n\n50,00,000 50 Lacs+\n\n\n\n1.Kunjakanta, Dhenkanal Town 2.BBSR\n\nTotal Area 1.A0.080d 2.A0.180d,A0.810d, A0.360d, A0.870d\n\nBuilt Up Area\n\nWhether Inherited N\n\nPurchase Date 2013-01-30\n\nPurchase Cost 7755000.00\n\nDevelopment Cost 0.00\n\n80,00,000 80 Lacs+\n\n\n\nNil Nil Nil Rs 1,30,00,000\n\n1 Crore+ iii Commercial Buildings Nil MIG Flat Kesuura SBI Colony\n\nTotal Area 500 sqft\n\nBuilt Up Area\n\nWhether Inherited N\n\nPurchase Date 0000-00-00\n\nPurchase Cost 1200000.00\n\nDevelopment Cost 0.00\n\n15,00,000 15 Lacs+\n\n\n\nNil Nil Nil Rs 15,00,000\n\n15 Lacs+ iv Residential Buildings Nil B/60 Gulmohor Park, New Delhi\n\nTotal Area 1200 sq. ft.\n\nBuilt Up Area 1200 sq.ft.\n\nWhether Inherited N\n\nPurchase Date 0000-00-00\n\nPurchase Cost 2200000.00\n\nDevelopment Cost 0.00\n\n30,00,000 30 Lacs+\n\n\n\nNil Nil Nil Rs 30,00,000\n\n30 Lacs+ v Others Nil Nil Nil Nil Nil Nil\n\nTotal Current Market Value of (i) to (v) (as per Affidavit) 50,00,000 50 Lacs+ 1,25,00,000 1 Crore+ Nil Nil Nil Rs 1,75,00,000\n\n1 Crore+ Totals Calculated Rs 50,00,000\n\n50 Lacs+ Rs 1,25,00,000\n\n1 Crore+ Nil\n\nNil\n\nNil\n\nRs 1,75,00,000\n\n1 Crore+ Disclaimer: This information is an archive of the candidate's self-declared affidavit that was filed during the elections. The current status of this information may be different. For the latest available information, please refer to the affidavit filed by the candidate to the Election Commission in the most recent election. Data Readability Report of Immovable Assets :No Problems in Reading Affidavit Information No Problems in Reading Affidavit Information Details of Liabilities Sr No Description self spouse dependent1 dependent2 dependent3 i Loans from Banks / FIs Nil Nil Nil Nil Nil Nil\n\nLoans due to Individual / Entity Nil Nil Nil Nil Nil Nil\n\nAny other Liability Nil Nil Nil Nil Nil Nil\n\nGrand Total of Liabilities (as per affidavit) Nil Nil Nil Nil Nil Nil\n\nii Dues to departments dealing with government accommodation Nil Nil Nil Nil Nil Nil\n\nDues to departments dealing with supply of water Nil Nil Nil Nil Nil Nil\n\nDues to departments dealing with supply of electricity Nil Nil Nil Nil Nil Nil\n\nDues to departments dealing with telephones Nil Nil Nil Nil Nil Nil\n\nDues to departments dealing with supply of transport Nil Nil Nil Nil Nil Nil\n\nIncome Tax Dues Nil Nil Nil Nil Nil Nil\n\nWealth Tax Dues Nil Nil Nil Nil Nil Nil\n\nService Tax Dues Nil Nil Nil Nil Nil Nil\n\nProperty Tax Dues Nil Nil Nil Nil Nil Nil\n\nSales Tax Dues Nil Nil Nil Nil Nil Nil\n\nAny Other Dues Nil Nil Nil Nil Nil Nil\n\niii Grand Total of all Govt Dues (as per affidavit) Nil Nil Nil Nil Nil Nil\n\niv Whether any other liabilities are in dispute, if so, mention the amount involved and the authority before which it is pending Nil Nil Nil Nil Nil Nil\n\nTotals (Calculated as Sum of Values) Nil\n\nNil\n\nNil\n\nNil\n\nNil\n\nNil\n\nDisclaimer: This information is an archive of the candidate's self-declared affidavit that was filed during the elections. The current status of this information may be different. For the latest available information, please refer to the affidavit filed by the candidate to the Election Commission in the most recent election. Data Readability Report of Liabilities :No Problems in Reading Affidavit Information No Problems in Reading Affidavit Information If you notice any discrepancy between affidavits and our data, you can use the message box below to send a message to us. ( यदि आप हलफनामों और इस पेज पर दी गयी जानकारी के बीच कोई विसंगति/भिन्नता पाते है तो आप नीचे के संदेश बॉक्स के उपयोग से हमें संदेश भेज सकते हैं) Name :\n\n\n\nEmail :\n\n\n\nPhone No :\n\n\n\nEnter your discrepancy :\n\n\n\nPlease enter the code shown below and click Submit.\n\n\n\nDisclaimer: The primary source for the data used for these reports is the sworn affidavits provided by the candidates themselves. Sheer volume of data that has to be read from the affidavits that are often poorly scanned and the lightening speed at which these reports have to be brought out makes it quite difficult to ensure accuracy of every bit of data. In case of any discrepancy in our reports vis a vis the original affidavit of any candidate, the original affidavit should be considered accurate. If you notice any discrepancies between affidavit and our report kindly let us know and we will fix them on our end as soon as possible.\n\n\n\n\n\n\n\n\n\n\n\nDisclaimer: This information is an archive of the candidate's self-declared affidavit that was filed during the elections. The current status of this information may be different. For the latest available information, please refer to the affidavit filed by the candidate to the Election Commission in the most recent election.\n\nSr No Description self spouse dependent1 dependent2 dependent3 i Agricultural Land Nil Nil Nil Nil Nil Nil\n\nii Non Agricultural Land Part of 107-Surya Nagar\n\nTotal Area 1/2 acre\n\nBuilt Up Area\n\nWhether Inherited Y\n\nPurchase Date 2013-12-23\n\nPurchase Cost 0.00\n\nDevelopment Cost 0.00\n\n50,00,000 50 Lacs+\n\n\n\n1.Kunjakanta, Dhenkanal Town 2.BBSR\n\nTotal Area 1.A0.080d 2.A0.180d,A0.810d, A0.360d, A0.870d\n\nBuilt Up Area\n\nWhether Inherited N\n\nPurchase Date 2013-01-30\n\nPurchase Cost 7755000.00\n\nDevelopment Cost 0.00\n\n80,00,000 80 Lacs+\n\n\n\nNil Nil Nil Rs 1,30,00,000\n\n1 Crore+ iii Commercial Buildings Nil MIG Flat Kesuura SBI Colony\n\nTotal Area 500 sqft\n\nBuilt Up Area\n\nWhether Inherited N\n\nPurchase Date 0000-00-00\n\nPurchase Cost 1200000.00\n\nDevelopment Cost 0.00\n\n15,00,000 15 Lacs+\n\n\n\nNil Nil Nil Rs 15,00,000\n\n15 Lacs+ iv Residential Buildings Nil B/60 Gulmohor Park, New Delhi\n\nTotal Area 1200 sq. ft.\n\nBuilt Up Area 1200 sq.ft.\n\nWhether Inherited N\n\nPurchase Date 0000-00-00\n\nPurchase Cost 2200000.00\n\nDevelopment Cost 0.00\n\n30,00,000 30 Lacs+\n\n\n\nNil Nil Nil Rs 30,00,000\n\n30 Lacs+ v Others Nil Nil Nil Nil Nil Nil\n\nTotal Current Market Value of (i) to (v) (as per Affidavit) 50,00,000 50 Lacs+ 1,25,00,000 1 Crore+ Nil Nil Nil Rs 1,75,00,000\n\n1 Crore+ Totals Calculated Rs 50,00,000\n\n50 Lacs+ Rs 1,25,00,000\n\n1 Crore+ Nil\n\nNil\n\nNil\n\nRs 1,75,00,000\n\n1 Crore+\n\nNo Problems in Reading Affidavit Information Details of Immovable Assets Sr No Description self spouse dependent1 dependent2 dependent3 i Agricultural Land Nil Nil Nil Nil Nil Nil\n\nii Non Agricultural Land Part of 107-Surya Nagar\n\nTotal Area 1/2 acre\n\nBuilt Up Area\n\nWhether Inherited Y\n\nPurchase Date 2013-12-23\n\nPurchase Cost 0.00\n\nDevelopment Cost 0.00\n\n50,00,000 50 Lacs+\n\n\n\n1.Kunjakanta, Dhenkanal Town 2.BBSR\n\nTotal Area 1.A0.080d 2.A0.180d,A0.810d, A0.360d, A0.870d\n\nBuilt Up Area\n\nWhether Inherited N\n\nPurchase Date 2013-01-30\n\nPurchase Cost 7755000.00\n\nDevelopment Cost 0.00\n\n80,00,000 80 Lacs+\n\n\n\nNil Nil Nil Rs 1,30,00,000\n\n1 Crore+ iii Commercial Buildings Nil MIG Flat Kesuura SBI Colony\n\nTotal Area 500 sqft\n\nBuilt Up Area\n\nWhether Inherited N\n\nPurchase Date 0000-00-00\n\nPurchase Cost 1200000.00\n\nDevelopment Cost 0.00\n\n15,00,000 15 Lacs+\n\n\n\nNil Nil Nil Rs 15,00,000\n\n15 Lacs+ iv Residential Buildings Nil B/60 Gulmohor Park, New Delhi\n\nTotal Area 1200 sq. ft.\n\nBuilt Up Area 1200 sq.ft.\n\nWhether Inherited N\n\nPurchase Date 0000-00-00\n\nPurchase Cost 2200000.00\n\nDevelopment Cost 0.00\n\n30,00,000 30 Lacs+\n\n\n\nNil Nil Nil Rs 30,00,000\n\n30 Lacs+ v Others Nil Nil Nil Nil Nil Nil\n\nTotal Current Market Value of (i) to (v) (as per Affidavit) 50,00,000 50 Lacs+ 1,25,00,000 1 Crore+ Nil Nil Nil Rs 1,75,00,000\n\n1 Crore+ Totals Calculated Rs 50,00,000\n\n50 Lacs+ Rs 1,25,00,000\n\n1 Crore+ Nil\n\nNil\n\nNil\n\nRs 1,75,00,000\n\n1 Crore+ Disclaimer: This information is an archive of the candidate's self-declared affidavit that was filed during the elections. The current status of this information may be different. For the latest available information, please refer to the affidavit filed by the candidate to the Election Commission in the most recent election. Data Readability Report of Immovable Assets :No Problems in Reading Affidavit Information No Problems in Reading Affidavit Information Details of Liabilities Sr No Description self spouse dependent1 dependent2 dependent3 i Loans from Banks / FIs Nil Nil Nil Nil Nil Nil\n\nLoans due to Individual / Entity Nil Nil Nil Nil Nil Nil\n\nAny other Liability Nil Nil Nil Nil Nil Nil\n\nGrand Total of Liabilities (as per affidavit) Nil Nil Nil Nil Nil Nil\n\nii Dues to departments dealing with government accommodation Nil Nil Nil Nil Nil Nil\n\nDues to departments dealing with supply of water Nil Nil Nil Nil Nil Nil\n\nDues to departments dealing with supply of electricity Nil Nil Nil Nil Nil Nil\n\nDues to departments dealing with telephones Nil Nil Nil Nil Nil Nil\n\nDues to departments dealing with supply of transport Nil Nil Nil Nil Nil Nil\n\nIncome Tax Dues Nil Nil Nil Nil Nil Nil\n\nWealth Tax Dues Nil Nil Nil Nil Nil Nil\n\nService Tax Dues Nil Nil Nil Nil Nil Nil\n\nProperty Tax Dues Nil Nil Nil Nil Nil Nil\n\nSales Tax Dues Nil Nil Nil Nil Nil Nil\n\nAny Other Dues Nil Nil Nil Nil Nil Nil\n\niii Grand Total of all Govt Dues (as per affidavit) Nil Nil Nil Nil Nil Nil\n\niv Whether any other liabilities are in dispute, if so, mention the amount involved and the authority before which it is pending Nil Nil Nil Nil Nil Nil\n\nTotals (Calculated as Sum of Values) Nil\n\nNil\n\nNil\n\nNil\n\nNil\n\nNil\n\nDisclaimer: This information is an archive of the candidate's self-declared affidavit that was filed during the elections. The current status of this information may be different. For the latest available information, please refer to the affidavit filed by the candidate to the Election Commission in the most recent election. Data Readability Report of Liabilities :No Problems in Reading Affidavit Information No Problems in Reading Affidavit Information If you notice any discrepancy between affidavits and our data, you can use the message box below to send a message to us. ( यदि आप हलफनामों और इस पेज पर दी गयी जानकारी के बीच कोई विसंगति/भिन्नता पाते है तो आप नीचे के संदेश बॉक्स के उपयोग से हमें संदेश भेज सकते हैं) Name :\n\n\n\nEmail :\n\n\n\nPhone No :\n\n\n\nEnter your discrepancy :\n\n\n\nPlease enter the code shown below and click Submit.\n\n\n\nDisclaimer: The primary source for the data used for these reports is the sworn affidavits provided by the candidates themselves. Sheer volume of data that has to be read from the affidavits that are often poorly scanned and the lightening speed at which these reports have to be brought out makes it quite difficult to ensure accuracy of every bit of data. In case of any discrepancy in our reports vis a vis the original affidavit of any candidate, the original affidavit should be considered accurate. If you notice any discrepancies between affidavit and our report kindly let us know and we will fix them on our end as soon as possible.\n\n\n\n\n\n\n\n\n\n\n\nDisclaimer: This information is an archive of the candidate's self-declared affidavit that was filed during the elections. The current status of this information may be different. For the latest available information, please refer to the affidavit filed by the candidate to the Election Commission in the most recent election.\n\nSr No Description self spouse dependent1 dependent2 dependent3 i Loans from Banks / FIs Nil Nil Nil Nil Nil Nil\n\nLoans due to Individual / Entity Nil Nil Nil Nil Nil Nil\n\nAny other Liability Nil Nil Nil Nil Nil Nil\n\nGrand Total of Liabilities (as per affidavit) Nil Nil Nil Nil Nil Nil\n\nii Dues to departments dealing with government accommodation Nil Nil Nil Nil Nil Nil\n\nDues to departments dealing with supply of water Nil Nil Nil Nil Nil Nil\n\nDues to departments dealing with supply of electricity Nil Nil Nil Nil Nil Nil\n\nDues to departments dealing with telephones Nil Nil Nil Nil Nil Nil\n\nDues to departments dealing with supply of transport Nil Nil Nil Nil Nil Nil\n\nIncome Tax Dues Nil Nil Nil Nil Nil Nil\n\nWealth Tax Dues Nil Nil Nil Nil Nil Nil\n\nService Tax Dues Nil Nil Nil Nil Nil Nil\n\nProperty Tax Dues Nil Nil Nil Nil Nil Nil\n\nSales Tax Dues Nil Nil Nil Nil Nil Nil\n\nAny Other Dues Nil Nil Nil Nil Nil Nil\n\niii Grand Total of all Govt Dues (as per affidavit) Nil Nil Nil Nil Nil Nil\n\niv Whether any other liabilities are in dispute, if so, mention the amount involved and the authority before which it is pending Nil Nil Nil Nil Nil Nil\n\nTotals (Calculated as Sum of Values) Nil\n\nNil\n\nNil\n\nNil\n\nNil\n\nNil\n\n\n\nNo Problems in Reading Affidavit Information Details of Liabilities Sr No Description self spouse dependent1 dependent2 dependent3 i Loans from Banks / FIs Nil Nil Nil Nil Nil Nil\n\nLoans due to Individual / Entity Nil Nil Nil Nil Nil Nil\n\nAny other Liability Nil Nil Nil Nil Nil Nil\n\nGrand Total of Liabilities (as per affidavit) Nil Nil Nil Nil Nil Nil\n\nii Dues to departments dealing with government accommodation Nil Nil Nil Nil Nil Nil\n\nDues to departments dealing with supply of water Nil Nil Nil Nil Nil Nil\n\nDues to departments dealing with supply of electricity Nil Nil Nil Nil Nil Nil\n\nDues to departments dealing with telephones Nil Nil Nil Nil Nil Nil\n\nDues to departments dealing with supply of transport Nil Nil Nil Nil Nil Nil\n\nIncome Tax Dues Nil Nil Nil Nil Nil Nil\n\nWealth Tax Dues Nil Nil Nil Nil Nil Nil\n\nService Tax Dues Nil Nil Nil Nil Nil Nil\n\nProperty Tax Dues Nil Nil Nil Nil Nil Nil\n\nSales Tax Dues Nil Nil Nil Nil Nil Nil\n\nAny Other Dues Nil Nil Nil Nil Nil Nil\n\niii Grand Total of all Govt Dues (as per affidavit) Nil Nil Nil Nil Nil Nil\n\niv Whether any other liabilities are in dispute, if so, mention the amount involved and the authority before which it is pending Nil Nil Nil Nil Nil Nil\n\nTotals (Calculated as Sum of Values) Nil\n\nNil\n\nNil\n\nNil\n\nNil\n\nNil\n\nDisclaimer: This information is an archive of the candidate's self-declared affidavit that was filed during the elections. The current status of this information may be different. For the latest available information, please refer to the affidavit filed by the candidate to the Election Commission in the most recent election. Data Readability Report of Liabilities :No Problems in Reading Affidavit Information No Problems in Reading Affidavit Information If you notice any discrepancy between affidavits and our data, you can use the message box below to send a message to us. ( यदि आप हलफनामों और इस पेज पर दी गयी जानकारी के बीच कोई विसंगति/भिन्नता पाते है तो आप नीचे के संदेश बॉक्स के उपयोग से हमें संदेश भेज सकते हैं) Name :\n\n\n\nEmail :\n\n\n\nPhone No :\n\n\n\nEnter your discrepancy :\n\n\n\nPlease enter the code shown below and click Submit.\n\n\n\nDisclaimer: The primary source for the data used for these reports is the sworn affidavits provided by the candidates themselves. Sheer volume of data that has to be read from the affidavits that are often poorly scanned and the lightening speed at which these reports have to be brought out makes it quite difficult to ensure accuracy of every bit of data. In case of any discrepancy in our reports vis a vis the original affidavit of any candidate, the original affidavit should be considered accurate. If you notice any discrepancies between affidavit and our report kindly let us know and we will fix them on our end as soon as possible.\n\n\n\n\n\n\n\n\n\n\n\nDisclaimer: This information is an archive of the candidate's self-declared affidavit that was filed during the elections. The current status of this information may be different. For the latest available information, please refer to the affidavit filed by the candidate to the Election Commission in the most recent election.\n\nIf you notice any discrepancy between affidavits and our data, you can use the message box below to send a message to us. ( यदि आप हलफनामों और इस पेज पर दी गयी जानकारी के बीच कोई विसंगति/भिन्नता पाते है तो आप नीचे के संदेश बॉक्स के उपयोग से हमें संदेश भेज सकते हैं) Name :\n\n\n\nEmail :\n\n\n\nPhone No :\n\n\n\nEnter your discrepancy :\n\n\n\nPlease enter the code shown below and click Submit.\n\n\n\n\n\nNo Problems in Reading Affidavit Information"}, {"url": "https://www.theguardian.com/world/2014/apr/07/-sp-indian-election-2014-interactive-guide-narendra-modi-rahul-gandhi", "page_content": "Overview\n\nIndia’s general election, which starts on 7 April, will be the largest vote ever held. About 814,500,000 people will have a ballot, and around 20% of these will be eligible for the first time. Turnout has traditionally been in the region of 55%.\n\nSo vast is the democratic exercise that it will require around 5 million people to conduct the procedure, and as many again to police it. The electoral commission has a stated ambition that no voter should have to travel more than 2km to a polling station, and nor should any one station serve more than 1,500 voters.\n\nThe election takes place in nine phases, over a period of six weeks. Voting starts in the remote hills and valleys of the far north-east before moving into central upland areas and then broadly shifting further west and south.\n\nSome of the medium-sized states hold polls in all constituencies on the same day, but the bigger states like Uttar Pradesh, Maharashtra, West Bengal and Madhya Pradesh are spread over five or more days. Jammu and Kashmir, with six constituencies in total, takes five separate days, to allow the security forces to concentrate their efforts on one constituency at a time.\n\nSchedule\n\nDay 1 | 7 April | 6 constituencies Some seats in Assam and Tripura in the north-east.\n\nDay 2 | 9 April | 7 constituencies All of Arunachal Pradesh in the Himalayas, plus the other north-eastern states Meghalaya, Mizoram and Nagaland and half of neighbouring Manipur.\n\n\n\nDay 3 | 10 April | 92 constituencies All of Chandigarh, Delhi, Kerala, and Haryana, plus seats in Bihar, Chhattisgarh, Jammu and Kashmir, Jharkhand, Madhya Pradesh, Maharashtra, Odisha and Uttar Pradesh, and the two seats in the island groups of Andaman, Nicobar and Lakshadweep.\n\n\n\nDay 4 | 12 April | 7 constituencies North-east again – more in Assam, plus all of Sikkim and the rest of Tripura – and Goa’s two seats\n\n\n\nDay 5 | 17 April | 121 constituencies The biggest day. All of Karnataka in the south, plus the rest of Odisha. Most of Rajasthan and seats in Bihar, Chhattisgarh, Jammu & Kashmir, Jharkhand, Madhya Pradesh, Maharashtra, Uttar Pradesh and West Bengal, plus remaining seat in Manipur.\n\n\n\nDay 6 | 24 April | 117 constituencies The second biggest day. All of Tamil Nadu, and seats in Bihar, Jammu and Kashmir, Uttar Pradesh and West Bengal, plus the rest of Assam, Chhattisgarh, Jharkhand, Madhya Pradesh, Maharashtra, Rajasthan, and the single seat in Pondicherry.\n\n\n\nDay 7 | 30 April | 89 constituencies All of Modi’s powerbase state of Gujarat, plus all of Punjab, a large part of Andhra Pradesh, and more seats in Bihar, Jammu and Kashmir, Uttar Pradesh and West Bengal, and the two seats in Dadra and Nagar Haveli, and Daman and Diu.\n\n\n\nDay 8 | 7 May | 64 constituencies The rest of Andhra Pradesh and Jammu and Kashmir, all of Himachal Pradesh and Uttarakhand, and 15 seats in Uttar Pradesh, plus more in Bihar and West Bengal.\n\n\n\nDay 9 | 12 May | 41 constituencies Not an anticlimax. The biggest day in two of the most populous states: West Bengal, with its remaining 17 seats voting, and Uttar Pradesh with 18, along with the last seats in Bihar.\n\n\n\nAll of this activity is to return the 543 elected members of the Lok Sabha, India’s more powerful lower house. Each MP serves a geographical constituency, and is elected using the first past the post system. The size of the constituencies varies substantially, partly because some of the seats are reserved for “scheduled castes” or “scheduled tribes”. The Lok Sabha also has two seats reserved for the Anglo-Indian community; the holders of these seats are appointed by the president.\n\nPolitical context\n\nCongress, which has led a coalition government since 2004, is the equivalent of the Grand Old Party of India, having been in power for all but 13 of the 67 years since independence. But hit by a faltering economy, corruption scandals and runaway inflation, Congress is now at a low ebb.\n\nTogether the coalition and its non-allied supporters had 276 seats, or a majority of nine. There is no guarantee that its coalition partners will work with it after the poll. Nor that its key “vote banks” – Muslims and those at the bottom of the caste system, India’s tenacious social hierarchy – will provide the numbers needed for a third term.\n\n\n\nThe BJP, meanwhile, is seen as the party of the urban middle classes, increasingly numerous as Indians move from the countryside to the cities, and as they become more prosperous. Some analysts describe the battle as pitting older ideas of class or community against new mass aspirations; others see battles between different ideas of India; still more talk of the regions. As ever in India, nothing is simple.\n\nBut after two terms in power since 2004, Congress’s current hold on the Lok Sabha is tenuous. They rule in coalition with several minor parties, including the Muslim League, but with the non-allied support of two major parties, the Samajwadi and Bahujan Samaj party. Both of those are rivals to Congress among the rural population of the Indus-Ganges plain, its heartland. Together the Congress coalition and its non-allied supporters had 276 seats, or a majority of nine. There is no guarantee that its coalition partners will work with it after the poll.\n\nThe BJP, meanwhile, is seen as the party of the urban middle class, a group that has grown as Indians move from the countryside to the cities, and as the cities become more prosperous.\n\nKey players\n\nModi makes no secret of his desire for power, or his Hindu nationalist views, and is seen as divisive by some. From a poor family, of a caste at the bottom of India’s tenacious social hierarchy, he was born, almost literally, on the wrong side of the tracks and helped his father sell tea as a child to train passengers stopping at the station in his provincial hometown in the western state of Gujarat. He was an unexceptional student at his government school, though opinionated and rebellious.\n\nPart of the RSS, the huge conservative national volunteer force, by his early teens, Modi showed himself to be an effective organiser and rose quickly in the movement. He moved across to the BJP, an ideological offshoot of the RSS though organisationally distinct, and worked his way up the ranks of the political party. In 2001 he was tapped to replace the then BJP chief minister, the top elected official, of Gujarat. He went on to win three successive elections before being launched on the national stage as the BJP prime ministerial candidate last year.\n\nCritics see him as an extremist who, in 2002, allegedly allowed or encouraged mobs to attack Muslims in towns across Gujarat after a lethal fire supposedly started by Muslims on a train full of Hindu pilgrims.\n\nModi denied the allegations and investigators have cleared him of any direct involvement in the violence, but his reputation still concerns many, particularly among India’s large Muslim population.\n\nOthers, including some of the most powerful industrialists in India, say Modi is an honest and decisive administrator who has introduced policies that have encouraged development in his state and could be reproduced across the nation if he were prime minister.\n\nRahul Gandhi, Congress\n\nRahul Gandhi’s great-grandfather was Jawaharlal Nehru, the independence leader and India’s first prime minister; his grandmother was Indira Gandhi, a four-term prime minister, and his father Rajiv was assassinated while seeking re-election in 1991. His mother, Italian-born Sonia, is chair of the ruling coalition and president of the Congress party.\n\nBut what is less clear is the ability of the largely untested Gandhi to govern a chaotic country of 1.2 billion people that faces great challenges. He has no ministerial experience, nor any at state level.\n\nGandhi grew up in great privilege and was tutored at home with his sister Priyanka. He studied at Harvard and Cambridge, earning a masters in Development Studies, and worked for a short time as a management consultant.\n\nHe entered politics in 2004, the year the Congress party returned to power, and was elected to the parliamentary seat of Amethi, a family bastion once held by his father. In 2007 he was appointed to several senior positions within the party and launched a series of internal reforms designed to make the organisation more transparent, meritocratic and democratic. Last year he was made vice president – junior only to his mother – and has led the campaign in the 2014 elections despite not having been formally declared as a prime ministerial candidate.\n\nGandhi, who is unmarried, is reclusive and rarely speaks to the media. In a rare recent interview, he said he had never sought power and opposed dynasty in politics. He wants to empower women in India and young people, as well as make India “the centre of manufacturing in the world”.\n\nArvind Kejriwal, Aam Admi party\n\nKejriwal first gained public attention during the India-wide agitation against corruption three years ago. He founded his political party, the Aam Admi (Common Man) party or AAP in the wake of that campaign, with a basic aim of fighting graft, bringing better governance and cleaning up the murky and opaque world of Indian politics. Last year the AAP surprised observers and won enough seats in Delhi to briefly hold power.\n\nCritics said Kejriwal’s tenure as chief minister of the capital proved that, though a highly effective mobiliser and protester, the qualified engineer was less successful as an administrator and temperamentally unsuited to making the many compromises necessary to run a country as complicated as India. They also attacked measures such as increasing subsidies of water supply as populist.\n\nSupporters simply said that, unlike most other local politicians, Kejriwal was committed to principles, not simply power, and maintained that gestures such as refusing the security cover, luxury accommodation and red vehicle siren that top Indian bureaucrats, military officers and politicians force traffic aside sent a powerful message.\n\nMarried with two children, Kejriwal is the son of a minor bureaucrat who grew up in smalltown northern India. He appeals to many Indians of a similar background frustrated by the failure of the state to provide basic services such as education, security and power. However, if on issues such as campaign funding Kejriwal’s stance is clear, his exact economic or social policies are less so. Most seem far from a clean break with the statist model that has dominated for so long.\n\nKejriwal passed some of India’s toughest public examinations as a young man. Now he is standing for election from Varanasi, the Hindu holy city, against Narendra Modi, the BJP prime ministerial candidate. Supporters say this is a gauge of his courage. Critics say it shows his hubris.\n\nOther parties\n\nIn Uttar Pradesh, the state which sends most MPs to parliament, the Samajwadi and Bahujan Samaj parties are both relatively weak but could still have a role to play. Elsewhere, West Bengal is the powerbase of the Trinamool Congress, led by the fiesty Mamata Banerjee, and, in southern Tamil Nadu, the All India Anna Dravida Munnetra Kazhagam of Jayalalithaa Jayaram.\n\n\n\nBoth could end up as kingmakers. Shiv Sena are close BJP allies in Mumbai. The Communists look set to be reduced to a record low. As for the new Aam Admi party, no one really knows.\n\nKey battles and battlegrounds\n\nIndia’s election is far from a two-horse race. Taking the 2009 results of the six most populous states – together accounting for over half of the Lok Sabha – we can see different battles everywhere with much local variation. The toughest fights for the main two parties will be in Uttar Pradesh, Andhara Pradesh, Bihar and Maharashtra. Congress should do well in Karnataka, relative to the predicted debacle elsewhere.\n\nNot surprisingly for such a mammoth exercise in democracy, the electoral maths is tricky to compute, with so many different races in different regions and a psephological map that is anything but uniform. But modelling a generalised swing to the BJP, taking votes proportionally from the other parties, we see that Modi’s party would overtake Congress relatively quickly, but struggle to get anything like an overall majority.\n\n\n\nWhat happens next then depends greatly on what deals can be cut with coalition partners.\n\nNot surprisingly for such a mammoth exercise in democracy, the electoral maths is tricky to compute, with so many different races in different regions and a psephological map that is anything but uniform. But modelling a generalised swing to the BJP, taking votes proportionally from the other parties, we see that Modi’s party would overtake Congress relatively quickly, but struggle to get anything like an overall majority. What happens next depends greatly on what deals can be cut with coalition partners.\n\n\n\n\n\nOutcomes\n\nMuch will probably depend on inter-party horsetrading once the polls are done. But what are the possible outcomes for India’s government? Analysts predict six broad variants.\n\n\n\nNow read on\n\nYou can follow the Guardian’s latest coverage of the Indian election here."}, {"url": "https://tathagatasatpathy.com/site/Biography", "page_content": "Biography :\n\nCurriculum Vitae\n\nTathagata Satpathy\n\nDOB: April 01, 1956 at Cuttack, Orissa, India\n\nEducation\n\nEducated at Sri Aurobindo Center of Education, Pondicherry, South India.\n\nSubjects studied English, Philosophy and French\n\nCan speak English, Oriya, Hindi, French\n\nOccupation\n\nJournalism & Publishing Editor Dharitri, published from Bhubaneswar and Sambalpur\n\nDharitri is the first Oriya daily to have an online presence.\n\nThe newspaper is 16 paged with a reach of 12,50,000 readers and has local, national and international news along with views that promote thoughts of a free and liberal world order\n\nElected Representative\n\nHas been a Member of:\n\nOrissa Legislative Assembly (1990-95)\n\nOrissa Legislative Assembly (1990-95) 12th Lok Sabha (1998-99)\n\n(1998-99) 14th Lok Sabha (2004-09)\n\n(2004-09) 15th Lok Sabha (2009-14)\n\n(2009-14) 16th Lok Sabha (2014-present)\n\n(2014-present) Parliamentary Standing Committee on Information Technology\n\nParliamentary Standing Committee on Coal & Steel\n\nParliamentary Standing Committee on Privileges\n\nOther positions held\n\nMember of Marine Product Export Development Authority, India (MPEDA)\n\nPresident of Chacrateertha Bikash Parishad, Puri, Orissa: an organization focused on creating public awareness on the importance of environment protection and waste management\n\nWorking President Akhshyam Kalyan Samiti, Dhenkanal, Orissa: a voluntary organization aiding poor physically challenged children. This organization provides free accommodation, food, education and vocational training for 236 deaf & dumb and blind girls and boys\n\nFounder and President DSM College, Koilpangi, Orissa: a twin stream higher educational institution (Arts and Science) imparting value added education to approx 400 students.\n\nAdvisor for ‘Nrutingyana’: an NGO providing a platform for talented young people in the state of Orissa in the sphere of dance and theatre\n\nActivities\n\nConvenor of ‘UrJa-Itz My World’: an annual meet of over 120 girls representing various colleges from all parts of Orissa. UrJa provides a platform to these students to interact not only with each other but also with eminent personalities excelling in different spheres from India and abroad. The idea of ‘UrJa’ is to imbibe a spirit of competitive individualism that would help in making the participating girls worth and responsible citizens of a democratic society\n\nConferences attended\n\nRepresenting India in Parliamentarians for Global Action, 1998 (New York)\n\nRepresenting Indian Editors in conference on peace initiatives in South East Asia, 2002 (Karachi, Pakistan)\n\nRepresenting Finance Committee of Indian Parliament at the UN (New York)\n\nInterests\n\nFinance, Trade\n\nProtection of natural resources (forest, mines, water reserves etc) in developing economies\n\nCampaigning for new laws on crime against women\n\nInformation Technology and Telecom reforms\n\nHolder of valid Private Pilot’s Licence with over 300 hours of single engine experience\n\nShort CV:\n\nTATHAGATA SATPATHY\n\nEDITOR, DHARITRI\n\nMEMBER OF PARLIAMENT, 16TH LOK SABHA\n\nTathagata Satpathy is editor of Dharitri, an Oriya-language daily newspaper published from Bhubaneswar and Sambalpur. The paper was the first Oriya daily to publish an internet edition. Mr Satpathy was a member of the 12th, 14th and 15th Lok Sabha (lower house of parliament) between 1998 and 2009 and served as a member of the Orissa Legislative Assembly from 1990 to 1995. He is presently the elected representative from Dhenkanal, Orissa in the 16th Lok Sabha.\n\nHis was a member of the Parliamentary Standing Committee on Information Technology, comprising the departments of information technology, posts, information and broadcasting, and telecommunications. He has served as a member of the Marine Products Export Development Authority, India. He was also president of Chacrateertha Bikash Parishad in Puri, Orissa, an organisation focused on creating public awareness of the importance of environmental protection and waste management, and working president of Akhshyam Kalyan Samiti in Dhenkanal, Orissa, a voluntary organisation that provides free accommodation, food, education and vocational training for 236 physically challenged children.\n\nMr Satpathy is founder and president of DSM College in Koilpangi, Orissa, a twin-stream (arts and science) higher-education institution imparting value-added education to approximately 400 students. He is also an adviser to Nrutingyana, a non-governmental organisation that provides a platform for talented young people in the state of Orissa in the sphere of dance and theatre; and convenor of UrJa-Itz My World, an annual meeting of more than 120 girls representing various colleges from all parts of Orissa.\n\nMr Satpathy was educated at Sri Aurobindo Center of Education, Pondicherry, South India."}, {"url": "https://thewire.in/history/the-parties-that-contested-indias-first-general-election", "page_content": "Independent India’s first elections were held from October 25, 1951 to February 21, 1952. To commemorate that monumental exercise, The Wire is publishing a series of articles exploring various aspects of the first ever general election in independent India. Read it here.\n\nIndia’s first general election, which took place between October 25, 1951 and February 21, 1952, was a colossal exercise; one-sixth of the world’s population was going to vote in one election.\n\nWith the introduction of universal adult suffrage, the election saw the largest share of the Indian populace vote at the same time.\n\nAccording to India’s 23rd Chief Election Commissioner (CEC) Sunil Arora’s foreword to the reprint of the ECI’s report on the first general election, no more than 14% of the Indian population had ever voted at the same time in the provincial elections held pre-independence. In the 1951-1952 elections, the electorate was around 173 million.\n\nThe elections were organised by the first CEC of India, Sukumar Sen, to replace the Jawaharlal Nehru-led Constituent Assembly, which served as the Parliament until the first elected government took charge.\n\nA total of 489 Lok Sabha seats were contested in the election from 401 constituencies, since some had more than one seat assigned to them. While the elections officially took eight months, reports say that the majority of the population that voted (voter turnout was around 45%) did so only in 1952.\n\nWhile Nehru and the Congress enjoyed a landslide victory, winning more seats than all opposition parties combined (not to mention almost 45% of all votes), it is still worth examining these varied opposition parties and the political undercurrents they represented then, to better understand how these inclinations went on to present themselves in the country’s political landscape in the future.\n\nA total of 53 political parties contested the first election, of which 14 were considered ‘national parties’ while the rest were considered ‘state’ parties. Apart from not having a consistent electoral symbol across the country (which was a significant concern, given the low literacy levels at the time), there were no further restrictions, so to speak, on the state parties.\n\nNotable state parties included the Shiromani Akali Dal in Punjab, which managed to win four Lok Sabha seats, as well as the All India Ganatantra Parishad in Maharashtra, which won eight. However, this article focuses on the 14 national parties; their key leaders, their values, their performance in the 1952 elections and where (if anywhere) they currently stand.\n\nThe Indian National Congress (INC): The Congress was the clear front-runner in India’s first general election, boasting many prominent names from the country’s freedom struggle.\n\nThe party sailed to victory, winning 364 of the 479 seats that it contested, more than the total number of seats won by all other parties put together and leaving the runner-up Communist Party of India (CPI), which secured only 16 seats, in the dust.\n\nJawaharlal Nehru, the first prime minister of the country, contested for the Congress from the Allahabad East cum Jaunpur West District constituency as it was then known, renamed to Phulpur in subsequent years.\n\nApart from Nehru, other prominent Congress leaders included Abul Kalam Azad, who contested from the Rampur District cum Bareilly District (West) constituency and became India’s first minister of education, national resources and scientific research and Gulzarilal Nanda, India’s first minister of planning and river valley schemes, who later served as the country’s interim Prime Minister twice; once after the death of Nehru and then again after the death of India’s second Prime Minister, Lal Bahadur Shastri.\n\nThe Congress’s dominion persisted for a long time after the first general election, winning 11 of the 14 elections until 2014, when the country’s tide decisively turned in favour of the BJP.\n\nThe Congress of today is nowhere near as dominant, managing to secure only 52 seats in the most recent Lok Sabha elections held in 2019 compared to the ruling Bharatiya Janata Party’s (BJP) 303. What’s more, only three of India’s chief ministers currently belong to the Congress.\n\nCommunist Party of India (CPI): The CPI, as mentioned earlier, emerged as the runner up in India’s first general election. Despite only winning 16 seats, the CPI formed the principal opposition in the country.\n\nThe party was officially formed in Kanpur (erstwhile Cawnpore) in 1925 after a decade of efforts from various groups to create a communist presence in the country. After its formation, however, the ruling British had outlawed communist activity throughout India and the party, which was forced to operate clandestinely, saw its work constrained until India gained independence.\n\nThe party stood for, among other things, social equality for women, universal adult suffrage, land reforms and for all privately-owned enterprises to be brought under the control of the government. The core demand of the party going into the first general election was for a “national democracy.”\n\nThe party saw the greatest electoral success from Madras where eight of its candidates won seats, followed by West Bengal, where it won five seats, Tripura, where it won two and Orissa, where it won one.\n\nThe CPI formed the principal opposition in the next two Lok Sabha elections as well. However, in 1964, the Soviet and Chinese communist factions within the party split, giving rise to the CPI (Marxist).Thereafter, the new CPI(M) continued to secure more votes than the CPI in the country’s general elections.\n\nToday, the CPI(M), with Sitaram Yachuri as its general secretary, is the more politically relevant of the two factions, being the party in power in Kerala with chief minister Pinarayi Vijayan at the helm.\n\nAt the state level, both the CPI and the CPI(M) are part of the Secular Progressive Alliance government in Tamil Nadu. The CPI(M) also has a political presence in West Bengal, being part of the ruling Left Front Alliance until 2011, after which the Mamata Banerjee-led Trinamool Congress (TMC) has been in power.\n\nAt the national level, the CPI(M) has three MPs in the Lok Sabha (one from Kerala and two from Tamil Nadu) while the CPI has two (both from Tamil Nadu).\n\nSocialist Party (SOC): Following the CPI was Jayaprakash Narayan and Ram Manohar Lohiya’s Socialist Party, which secured 12 seats of the 254 it contested in India’s first general election.\n\nThe Socialist Party had its roots in the Congress Socialist Party, a left-wing faction within the Indian National Congress formed by Narayan, Lohiya and Acharya Narendra Dev which separated from the former shortly after independence.\n\nIdeological differences with Mahatma Gandhi as well as Nehru caused the party’s rift with the Congress, however, Lohiya continued to abide by the Gandhian principle of Ahimsa even as Narayan was an advocate of a more militant approach. The party’s guiding principle was one of decentralised socialism in which the role of the Union government would be more subdued and local authorities would hold more economic power in their hands.\n\nDespite Narayan’s popularity on account of his role in India’s freedom struggle, the Socialist Party’s election haul was unimpressive and thus, after the election, it merged with J.B. Kripalani’s Kisan Mazdoor Praja Party (KMPP) to form the Praja Socialist Party (PSP).\n\nA faction of the PSP led by Lohiya, in turn, broke from the PSP in 1955 and came to be known as the Samyukt Socialist Party or even just the Socialist Party, which eventually re-joined the PSP in 1972.\n\nAt the time, Narayan, too, stepped back from the PSP and only re-entered national politics once again in the mid-70s when he led the movement against Indira Gandhi, whose government he alleged was corrupt and undemocratic. Narayan subsequently led the calls for Gandhi’s disqualification prior to her declaration of the Emergency in 1975, for which he was arrested.\n\nUpon being released from jail, Narayan and other PSP leaders joined hands with several other groups to form the Bharatiya Lok Dal which, following the Emergency in 1977, along with practically the entire opposition in the country, banded together to form the Janata Party to oppose the Gandhi-led Congress.\n\nSeveral parties including the BJP and the Samajwadi Party can trace their lineage back to the Janata Party.\n\nKisan Mazdoor Praja Party (KMPP): The Jivatram Bhagwandas ‘Acharya’ Kripalani-led KMPP was another Congress breakaway party and, after the INC and the Socialist Party, contested the third largest number of seats (145), but managed to win only nine of them.\n\nAmong the candidates the KMPP fielded were two former chief ministers – Prafulla Chandra Ghosh of West Bengal and Tanguturi Prakasam of Madras.\n\nKripalani was a Gandhian who featured prominently in the Civil Disobedience movement and subsequently, in the freedom struggle. He served as general-secretary of the Congress from 1934-1945 and was elected party president in 1946.\n\nKripalani had several ideological differences with Nehru and most of the Congress’ senior leadership, with the exception of Mahatma Gandhi, and had revealed in his posthumous autobiography that he took strong objection to the partition of the country.\n\nIn 1947, Kripalani had resigned from the post as Congress president, but remained a part of independent India’s interim government and was part of the Constituent Assembly. However, after he was unsuccessful in becoming party president in 1950, he resigned in 1951 to form the KMPP.\n\nInterestingly, Kripalani lost from the Faizabad District (North West) seat to Congress candidate Panna Lal but was subsequently elected to the Lok Sabha in a bye-election from the Bhagalpur constituency. His wife, Sucheta Kripalani, won from the New Delhi Lok Sabha seat.\n\nAfter the election, as mentioned above, Kripalani’s KMPP joined hands with the Socialist Party to form the PSP. He was, once again elected as a PSP MP in 1957 before leaving the party in 1960. He subsequently won another general election as an independent and another as an MP of C. Rajgopalachari’s Swatantra Party.\n\nKirpalani also emerged as a vehement critic of Indira Gandhi during the JP movement and was among the leaders that were jailed for opposing her, despite being over eighty years old. He, along with Narayan, was asked to select the leader of the Janata Dal government.\n\nAkhil Bharatiya Hindu Mahasabha (HMS): While the HMS enjoy some support in pre-Independence India, the role of prominent leaders like Vinayak Damodar (‘Veer’) Savarkar and member Nathuram Godse in the assassination of Mahatma Gandhi in 1948 drew widespread criticism and meant that the party secured only four seats in the first election.\n\nThe HMS was preceded by several regional Hindu sabhas which came together under the banner of the Sarvadeshak (All India) Hindu Sabha in 1915. In 1921, at the Sabha’s sixth conference at the Haridwar Kumbh Mela, it adopted the name Akhil Bharatiya Hindu Mahasabha.\n\nIn its early days, the Sabha had the support of prominent leaders like Madan Mohan Malviya and Lala Lajpat Rai. Even Gandhi had attended the meeting at the Kumbh Mela. However, in the 1920s, the party came under the leadership of Savarkar and the more stringent ‘Hindutva’ ideology began to take over, leading to a faction led by Keshav Baliram Hedgewar to break off and form the Rashtriya Swayamsevak Sangh (RSS), which considered itself a non-political entity.\n\nIn the years that followed, the HMS became diametrically opposed to Gandhi and the Congress, abstaining from the Civil Disobedience movement, forming coalition governments with the Muslim League in several provinces and demanding the partition of the country. Under Savarkar’s leadership, the party even refused to participate in the Quit India movement, choosing to stick to their posts within the British government.\n\nIn the aftermath of Partition, Savarkar blamed Gandhi’s ideology of non-violence for the loss of life on the Hindu side and incited his party members against him, eventually leading to HMS member Godse assassinating Gandhi. After Gandhi’s assassination, key leaders like Shyama Prasad Mukherjee, who had served in the ruling coalition in Bengal pre-independence and even in Nehru’s first interim government, left the party to form the Bharatiya Jan Sangh (BJS).\n\nPolitically, the party never gained much favour in independent India, securing only one seat in the Lok Sabha since 1971. However, Savarkar’s Hindutva underpinnings, the demand for a ‘Hindu Rashtra’ and the formulation that Muslims and Christians are ‘outsiders’ in India is now being seen in an aggressive way in Indian politics today.\n\nPresent party members continue with efforts to revive Savarkar and, controversially, even Godse and, despite not having much influence by way of votes, still has an ideological influence on Indian politics.\n\nAlso read: During the Quit India Movement, the Hindu Mahasabha Played the British Game\n\n\n\nAkhil Bharatiya Ram Rajya Parishad (RRP): Founded in 1948 by Hariharanand ‘Swami’ Karpatri, the RRP, as the name suggests, contested India’s first election on the platform of Hindu revivalism and the demand for a Hindu Rashtra.\n\nThe party only managed to win three seats of the 61 it contested in the first election, however, it managed moderate success in subsequent Vidhan Sabha elections in the country’s ‘Hindi belt’, particularly in Rajasthan.\n\nKarpatri had established the Dharma Sangh in 1940, which engaged in re-converting Hindus who had been converted to Islam.\n\nLike other Hindu nationalist parties at the time, the RRP had fought against Nehru and B.R. Ambedkar’s implementation of the Hindu Code Bills which sought to abolish Hindu personal law in favour of a secular unified civil code, an exercise initiated by the British.\n\nThe party eventually merged into Shyama Prasad Mukherjee’s BJS in 1971, ahead of the JP movement and the eventual unification of the Congress’s opposition to form the Janata Party.\n\nReports also have it that Karpatri and the RRP were involved in the early days of the Ayodhya-Ram Mandir issue and had called for the demolition of the Babri Masjid at the site.\n\nIn 1949, after a local mazar near the Babri Masjid was demolished, Karpatri had reportedly played a key role in organising the nine-day Akhand Path (uninterrupted reading) of the Ramcharitramanas, following which some individuals broke into the Masjid and forcibly placed Ram idols within its bounds, kicking off the entire dispute.\n\nHowever, the lack of widespread support for the cause at the time, the fact that the land legally belonged to the Waqf board and Nehru and the Congress’ intervention into the issue stopped it from featuring in the first Indian election.\n\nAlso read: Ayodhya: Once There Was A Mosque\n\nAll India Bharatiya Jan Sangh (BJS): Following Shyama Prasad Mukherjee’s disagreements with Savarkar’s ideology and subsequent exit from the Hindu Mahasabha, he went on to establish the BJS in collaboration with the RSS which, incidentally, was looking to make a foray into national politics.\n\nThe BJS was aligned with the RSS’s Hindutva politics and managed to win three of the 49 seats it contested in the first election. Mukherjee himself won from the Calcutta South East constituency. Lal Krishna Advani, who was initially an RSS worker from Rajasthan, joined the BJS’s Rajasthan unit as a secretary soon after it was formed.\n\nFollowing Mukherjee’s death in 1953, RSS members slowly edged out the politicians from the party, transforming it more and more into its own political wing. The BJS then really made its presence felt, particularly in the country’s Hindi belt, after the 1967 Lok Sabha election, winning 35 seats compared to the Congress lowest haul till that point of 283 seats.\n\nThe BJS, then led by Atal Bihari Vajpayee and L.K. Advani was thereafter an integral component of the Janata Party coalition which took on the Indira Gandhi-led Congress.\n\nHowever, infighting within the coalition after coming to power and the BJS’s refusal to accept the demands of other coalition members to snap ties with the RSS eventually culminated in a no confidence motion and the dissolution of the Morarji Desai-led government in 1979.\n\nFollowing the dissolution, Vajpayee, Advani and Murali Manohar Joshi led a large number of BJS leaders into the formation of the Bharatiya Janata Party (BJP) which retained the BJS’s Hindutva ideology but added elements of ‘Gandhian socialism’ in subsequent years. However, it remained in the wilderness till Advani’s Rath Yatra led to it becoming a challenge to the Congress’ hegemony, eventually leading it to power in Delhi, initially in the late 1990s.\n\nThereafter, after the Narendra Modi-led BJP rose to power in 2014, the party has consolidated power to become the dominant political party in the country, attuned as ever to its Hindutva ideology, anti-Muslim electoral pegs and the issues which brought it success in the past, most notably, the destruction of the Babri Masjid in December, 1992 and the agitation for the Ram Mandir in Ayodhya, as well as the anti-Muslim violence in Gujarat in 2002\n\nRevolutionary Socialist Party (RSP): The RSP was formed in 1940 by Tridib Chaudhuri and emerged from the Bengali Anushilan Samiti, an organisation that advocated revolutionary violence to overthrow the colonial government.\n\nAhead of the first election, the RSP had negotiated an agreement with the United Socialist Organisation of India (USOI), a socialist coalition which agreed to support the RSP in two Lok Sabha seats but contest against them in others. The RSP ended up winning three seats, with leader Chaudhuri winning from Bengal’s Berhampore constituency.\n\nA section of Anushilan Marxists had broken from the group in the 1930s and went on to eventually form the CPI. Anushilan Samiti members, however, refused to stand with the CPI in its opposition to the Congress and Gandhi and eventually joined the Congress Socialist Party (CSP) out of necessity, however, maintaining their own identity within it.\n\nWhen a fierce contest emerged in 1939 between Subhas Chandra Bose (who believed that the prospect of another world war should be used to attack the British and gain independence) and Gandhi’s faction within the Congress, the Anushilan Samiti clearly supported Bose.\n\nThereafter, when Bose broke from the Congress to form the Forward Bloc, he attempted to recruit the Anushilan Samiti members within his Left Consolidation Committee, also including the CPI, CSP and other left parties. However, when this committee fell apart and most left parties abandoned it, the Anushilan Samiti members, too, struck out on their own to form the RSP, cutting ties with the CSP.\n\nMoreover, after the Kerala Socialist Party split in 1949, a section of its leaders joined hands with the RSP and set up a branch in the state.\n\nThe RSP went through several splits in subsequent years. After a split in Kerala in 2002, some members of the party led by regional chief Baby John broke away to form the RSP (Bolshevik). However, after the party left the LDF in March 2014, it once again merged with the RSP (B) in the same year.\n\nLater still, Kovoor Kunjumon led a faction away from the party to form the RSP (Leninist) which was faced with another split when party leader Ambathala Sreedharan Nair claimed that it was he and not Kunjumon who was the party’s general secretary.\n\nCurrently, the RSP’s seat of power is in West Bengal, having three MLAs in the state assembly. In Kerala, the RSP is part of the United Democratic Front (UDF) alliance while the RSP (L) is part of the LDF.\n\nAll India Scheduled Castes’ Federation (SCF): The SCF was founded by B.R. Ambedkar in 1942 and, following from his work against caste and capitalist structures in India with the Independent Labour Party (ILP) and the Depressed Classes Federation (DCF), the party worked for the rights of Dalits in India.\n\nSivaraj was elected as the party president and P.N. Rajbhoj was elected the general secretary.\n\nThe SCF didn’t see much success in the 1952 election, securing only two of the 35 seats it contested. Interestingly, Ambedkar himself lost the election from the Bombay City North constituency to the Congress candidate Narayan Kajrolkar, who was once Ambedkar’s subordinate.\n\nLater, however, Ambedkar became a member of the Rajya Sabha but when he tried to get elected to the Lok Sabha again in the 1954 bypolls in Bhandara, he was defeated by another Congress candidate.\n\nThe SCF was succeeded by the Republican Party of India (RPI) which Ambedkar attempted to establish in 1956, However, he passed away before the party could be formed and thereafter, his followers officially formed the party on October 1, 1957. Sivaraj was among those present, as were Bhimrao Ambedkar’s son Yashwantrao ‘Bhaiyasaheb’ Ambedkar and Damodar Tatyaba ‘Dadasaheb’ Rupwate.\n\nThe RPI won nine seats in the second Lok Sabha elections in 1957. However, in subsequent years, the party saw inordinate splits, each of them claiming the name of the RPI. Thereafter, in 2009, all these factions came together to unite as the Republican Party of India (United), with the exception of the Bharipa Bahujan Mahasangh, a party founded in 1994 by B.R Ambedkar’s grandson, Prakash Yashwant ‘Balasaheb’ Ambedkar.\n\nLater, two more factions from within the RPI (U) led by R.S. Gavai and Ramdas Athawale broke off to form the RPI (Gavai) and RPI (A) respectively.\n\nThe RPI (U) is currently part of the Republican Left Democratic Front (RLDF) in Maharashtra while the RPI (Gavai), which was once a part of the UPA government, is also limited to Maharashtra. Athawale is currently the Minister of State for Social Justice and Empowerment in the BJP government.\n\nMoreover, Kanshi Ram, the founder of the Bahujan Samaj Party (BSP) was once a member of the RPI.\n\nAll India Forward Bloc (Marxist group) (FBL-MG) and the All India Forward Bloc (Ruikar group) (FBL-RG): The All India Forward Bloc was established by Subhash Chandra Bose as a faction within the Congress, a few months after he resigned from the post of Congress president in 1939.\n\nBy the time of the first general election, the Forward Bloc itself had split into two factions; the Marxist group led by prominent Marxist leader Sheel Bhadra Yagee and the Ruikar group, and the ‘Subhashist’ led by R.S. Ruikar and S.S. Kavishar. While the former managed to secure one seat in the Lok Sabha in 1952, the other won nil.\n\nBose first established the Forward Bloc to rally all the left-wing elements within the Congress under different leadership while still remaining within the party. Besides Bose, Ruikar and Yagee, early members included Senapati Bapat, Ukkirapandi Muthuramalingam and the like.\n\nSoon after Independence and Partition, when the Congress began to remove dissenters from party ranks, the Forward Bloc decided to officially sever ties with it and form its own independent presence. However, differences between the Marxists and the Subhashits became more and more evident and the two factions; the FBL-MG and FBL-RG, drifted further apart, eventually contesting the elections separately.\n\nIn 1955, Yagee and Mohan Singh decided to re-join the Congress, however, they hadn’t consulted any of the other members. This decision led to their expulsion from the group and thereafter, Hemanta Kumar Bose was elected as the new chairman and R.K. Haldulkar, the new general secretary.\n\nOver the years, as leaders exited the party, its importance continued to dwindle in the few states where it was prominent, leaving its presence today largely restricted to West Bengal. Even in the state, the Forward Bloc now only plays second-fiddle to the CPI(M) as a part of the Left Front Alliance. However, the party has no MPs or MLAs in the legislature at present.\n\nAlso read: Modi’s Portrayal of Netaji as a Hindu Militarist Does the Secular, Socialist Bose a Disservice\n\nKrishikar Lok Party (KLP): The KLP was formed by farm leader N. G. Ranga when he decided to break away from the Hyderabad State Praja Party, which itself was formed when Ranga and Tanguturi Prakasam decided to part ways with the Congress\n\nThe party managed to secure only one seat in the first Indian election; Manak Chand won the seat for the party from the Bharatpur Sawaimadhopur constituency.\n\nThereafter, the KLP contested the 1952 assembly elections in Madras and secured 15 seats in the Vidhan Sabha. After the assembly elections in Andhra Pradesh in 1955, on Nehru’s request, the KLP was merged into the Congress. Ranga was elected to the second Lok Sabha in 1957 from the Tenali constituency on a Congress ticket.\n\nDisillusioned with Nehru’s increasingly socialist politics such as instituting land reforms and cooperative farming process, in 1959, Ranga, along with C. Rajgopalachari, went on to break away from the Congress and establish the Swatantra Party. Ranga was elected its first president.\n\nThe Swatantra Party stood for a market-based capitalist economy in opposition to the socialist model emerging within the Congress; its leaders were of the belief that the good of the people would be maximised through minimal state intervention.\n\nThe Swatantra Party eventually joined the umbrella opposition to Indira Gandhi’s Congress (R) after the emergency years, the Janata Party, dwindling into insignificance thereafter.\n\nBolshevik Party of India (BPI): The BPI had its roots in the labour union movement in Bengal in the 1930s and officially came into existence after a section of leaders from the CPI, led by Niharendu Dutt Mazumdar and other leaders such as Sisir Roy, Sudha Roy and the like broke away.\n\nThe BPI was preceded by the Bengal Labour Party, formed by Mazumdar, which had merged with the CPI in the 1930s but had maintained its own presence as well. When Subhash Bose’s Forward Bloc broke from the Congress, the BPI chastised the CPI’s decision to side with the Congress and thus, these labour leaders broke off to form the BPI in 1939.\n\nWhile the BPI supported the British effort in the Second World War initially, Mazumdar later supported the Quit India movement and, after he was released from jail, left the party and joined the Congress.\n\nAt the time of independence, Sisir Roy was serving as the party’s general secretary and under his leadership, the party denounced India’s partition and sought for a united India to break from the commonwealth and align itself with the likes of the Soviets and China.\n\nIn the first Indian general election, Sudha Roy was the sole candidate fielded by the BPI. She contested from Barrackpore constituency but was defeated by the Congress’s Ramananda Das.\n\nAfter the first election, many members of the Forward Communist Party merged into the BPI, thus, while the party was based out of West Bengal, it gained bases in states such as Bihar and MP as well.\n\nIn the years that followed, prominent leader Biswanath Dubey left the party and after Sisir Roy’s death in 1960, Sudha Roy called for the BPI to join the CPI, which party cadres rejected, prompting her to leave the party with her followers and join the CPI.\n\nAs even more leaders left the party, the BPI’s share in national politics dwindled further. Today, it is limited to being part of the CPI(M)-led Left Front in West Bengal\n\nRevolutionary Communist Party of India (RCPI): The RCPI had its roots in the Communist League founded by Saumyendranath Tagore after he, along with other founding members, decided to break from the CPI in 1934. It had adopted the name, the ‘Communist Party of India’ at a party conference in 1941 but later decided to change its name to the ‘Revolutionary Communist Party of India’ to avoid any confusion.\n\nAfter independence and in the years before the first Indian election, the RCPI went through a split in leadership which saw one faction, led by Sudhir Dasgupta, take a more militant role in pushing for armed rebellion in India.\n\nThis ‘rebel group’ attempted to begin their armed revolt in 1949, stealing weapons from police posts and raiding factories. Several people died in the ensuing melee before the party members were caught. Around 40 cadres of the RCPI were arrested and sent to prison, Dasgupta being one of them, who was sentenced to life imprisonment.\n\nThe other faction distanced itself from the insurrectional politics of the rebels and operated largely underground, although no formal ban was imposed on them at the time.\n\nLater, however, the RCPI attempted to mount a peasant uprising in Assam and seeking its secession from India. As the movement grew more violent and more and more casualties emerged, the government first banned the party and then employed police crackdowns on party cadres. Amidst the crackdown, the party also began losing its influence among the vote base.\n\nIn this light, the RCPI boycotted the 1952 elections. However, the Assam government withdrew the ban later that year.\n\nIn subsequent years, the party was involved in the forming of a few state governments; it was a part of the CPI(M)-led United Front government in West Bengal in 1969 and has then part of the Left Front alliance in West Bengal since it was formed, which was in power in the state until 2011."}]}