{"Tathagata Satpathy is an Indian politician.": [{"url": "https://indianexpress.com/article/political-pulse/tathagata-satpathy-interview-cong-defamation-rahul-gandhi-8542406/", "page_content": "With Congress leader Rahul Gandhi convicted of criminal defamation last month, and subsequently disqualified as Lok Sabha MP, there have been calls for a review of the criminal defamation legislation in India. It is not the first time.\n\nIn 2016, then Biju Janata Dal (BJD) MP Tathagata Satpathy moved a Private Member’s Bill in the Lok Sabha to decriminalise defamation — the Protection of Speech and Reputation Bill (commonly known as the “Speech Bill”). Satpathy, who is now the editor of Odia daily Dharitri, speaks to The Indian Express about what prompted him to introduce the Bill, its features, the response of other parties, and the effect criminal defamation has in today’s political climate. Excerpts:\n\nAs an editor, I had about 87 defamation cases filed against me. In Odisha, you have a law that women don’t have to deposit money if they want to file a defamation case. Normally, if you want to file a defamation case you have to deposit a certain percentage of what you claim in court. What happens if you level an allegation or publish a story against the police officials and bureaucrats in the newspapers is that they will get their wives or mothers or sisters to file a case against you. Even if you have enough evidence against them, they will file. Eventually, you will get cleared — in my case, I won all the cases if not in the lower court, then in the higher court. But it’s harassment.\n\nSo, partly, my Bill was driven by my personal experiences. Because two proceedings, civil and criminal, for the same offence do not seem justified to me. If you look at the global picture, the criminal aspect of the defamation case is not there in any democratic country. The last one I know that had it was Australia but they also removed it a few years ago. In most countries, it’s only the civil part. My simple counter was how can we prosecute twice for the same offence?\n\nI sought the help of lawyers and others, including journalists. Apar Gupta was one of the lawyers who played a key role in drafting that Bill. I may have read the Bill at least 100 times before I went ahead with it. Apar then suggested it would be good if we could put it up for public review, which we did. We had a website — speechbill.in — and sought people’s views also. We received a lot of feedback.\n\nWhat were the features of the Bill?\n\nThe main feature of the Bill was that it decriminalised defamation and treated it as a civil offence. It had provisions to curb the chilling effects of criminal defamation and had provisions to prevent damage to reputations. It had quantification of damages for defamation, fixed the maximum amount of damages, and barred governments and institutions exercising government or statutory functions from filing defamation suits.\n\nHow relevant is it in the wake of recent political events?\n\nI did not foresee such an event. I always thought that it is very wrong. Today, everyone seems to have woken up. At the time, the Congress did not support my Bill, no one backed me. But, I wanted to put it on record for posterity at least. I would not say it was a watertight Bill. It needed improvement. But I would like MPs to take it up.\n\nAdvertisement\n\nBeing an editor, and an active politician not so long ago, what do you think of the position that the right to reputation is no less important a right than the right to freedom of speech?\n\nRight to reputation is a debatable point and that can never ever infringe on freedom of speech or freedom of expression. A statement or a post or a tweet can be said to be hurting someone’s sense and sensibilities. We are seeing it across the country. Then, it is up to them, not to the defendant, to prove how their reputation has been hurt. It’s in the legal process also that during the cross-examination the complainant has to prove how … but all they can do is to find one or two witnesses in their neighbourhood to say ‘yes, we thought bad of her or him because of the remark’.\n\nThere are instances of people in power using the defamation law. Do you think it is being used to silence people?\n\nYes, people in power become super touchy. Some people say vulgar things but defend those by claiming freedom of speech. When someone calls me leftist or presstitute or sickular, I get offended. I am very badly hurt because I do not consider myself as someone selling his pen, I consider myself to be neither secular nor Leftist. Yes, I consider myself a liberal, I agree. I was in the House (Lok Sabha) when a Minister of State uttered the word ‘Presstitute’ on the floor of the House. As an editor and a working journalist, I was hurt. We knew that nothing will come of it. Yes, the same people use defamation clauses against others.\n\nAnother thing is that our lower judiciary is not trained to handle so many issues that come up with something like defamation. They are not normal criminal cases but are hypothetical ones. Our lower judiciary is not equipped to handle them. We talk of judicial reforms and the law minister is constantly talking against the collegium. But they are talking about the Supreme Court that they are dealing with every day. But the common Indian does not get to reach the Supreme Court. They are penalised, prosecuted, sentenced, jailed, given life terms, and the appeals take years. Some die in prisons. I would say 99 per cent of our population even. The high courts seem very high. People can afford to go to only the lower courts. I do not think the lower courts can sit in judgment on such delicate issues.\n\nAdvertisement\n\nHave you come across instances of defamation clauses being used against political rivals?\n\nI have never experienced (it), at least not in Odisha. But, of course, it comes up against the media. Of late, it has been happening. They are managing to corner opponents that way. The number of defamation cases was much lower 15-20 years back. Either people were gentler or they were not so touchy. If you start taking one line out of a speech, it can work any which way.\n\nYou are an editor. Does the new trend make you think twice before criticising someone powerful even if it’s based on fact? Do you think there is increasing fear among citizens about criticising someone or exposing corruption?\n\nYes, people across India today are much more careful about what they say, especially about politics and politicians. Also about big business. All the powerful people.\n\nYou too?\n\nI am a don’t-care-a-hoot kind of person but I refrain from being abusive. I speak what I like and also write what I think is correct. Also, must admit I have personally not felt fear or threatened, as yet."}, {"url": "https://peoplepill.com/people/tathagata-satapathy/", "page_content": "Tathagata Satpathy (born 1 April 1956) was a member of the 12th , 14th, 15th and 16th Lok Sabha of India. He represented the Dhenkanal constituency of Odisha, and was re-elected for the fourth time in 2014. He was a member of the Biju Janata Dal (BJD) political party, and the party's chief whip in the Lok Sabha. He took voluntary retirement from politics in March 2019. He is not an active politician ever since.\n\nLife and work\n\nTathagata Satpathy is the younger son of former Odisha Chief Minister Nandini Satpathy and Devendra Satpathy. He is the owner and editor of the daily Odia newspaper, Dharitri, and the English daily, Orissa Post.\n\nIn 2000, Satpathy joined the Orissa Gana Parishad ( a non political outfit), and served as its secretary general. After Naveen Patnaik got elected in 2000, Satpathy had used his newspaper Dharitri to criticise his policies which he does even now. In March 2004, just before the 2004 Indian general election, Satpathy reconciled with BJD. He said that he was forced to quit OGP due its changing into a political party as also forming an alliance with Janaki Ballabh Patnaik-led Indian National Congress (INC).\n\nHis nephew Suparno Satpathy had unsuccessfully contested him in 2014 for the office of MP Lok Sabha, Dhenkanal.\n\nIn March 2015, Tathagata Satpathy became the first Indian Member of Parliament to hold an official \"Ask Me Anything\" session on the content-sharing website Reddit. In April, Satpathy came forward in support of net neutrality, after the Telecom Regulatory Authority of India (TRAI) come out with a consultation paper on over-the-top (OTT) messaging services. In December 2015, Satpathy had supported a bill to decriminalise homosexuality. The bill was introduced by INC leader Shashi Tharoor. But, it was defeated with 71 against, 1 abstaining and 24 in favour.\n\nViews and opinions\n\nOn net neutrality\n\nIn March 2014, the Telecom Regulatory Authority of India (TRAI) released a formal consultation paper on over-the-top (OTT) messaging services and whether telecom operators should be allowed to charge separately for some messaging apps. Soon afterwards, Tathagata Satpathy wrote an open letter to TRAI stating his support for net neutrality. In the letter, he said such a policy would hinder the Digital India project and kill new startups. He said that he used such apps to interact with his constituency and this policy will hinder his functioning as a representative.\n\nOn legalisation of cannabis\n\nTathagata Satpathy has criticised the ban on cannabis in India, while pointing out the long history of its usage as a ritual and recreational intoxicant. He has said that cannabis was banned in India while alcohol was not, because of \"an elitist bias\" as cannabis was a poor man's drug. He has said the addiction depends on person's character and not on the intoxicant. He has suggested an amendment to the Narcotic Drugs and Psychotropic Substances Act, 1985 to allow recreational and medicinal usage of marijuana. During his \"Ask Me Anything\" session on Reddit in March 2015, Satpathy admitted that he smoked cannabis when he was young. In August 2015, during the monsoon session of the Parliament, he proposed the decriminalisation of cannabis. In December 2015, he repeated his proposal during the winter session, saying that banning cannabis has forced villagers to turn to alcohol.\n\nOn homosexuality and moral policing\n\nTathagata Satpathy has condemned the Section 377 of the Indian Penal Code, which criminalises homosexuality in India, calling it \"archaic\" and called for its repeal. He had supported a bill introduced by INC MP Shashi Tharoor to decriminalise homosexuality during the 2015 winter session of the Parliament. When the bill was defeated, Satpathy called it a very sad day. Satpathy has also condemned moral policing and called for a repeal of laws banning pornography in India.\n\nOn privacy and Aadhaar\n\nTathagata Satpathy has raised concerns that the Aadhaar project could be used for mass surveillance or ethnic cleansing in the future. He has questioned why a new identity card project was created despite having several identity cards systems. He has also criticised the decision to present the Aadhaar Bill, 2016 as a money bill. He pointed out that although the bill allows the sharing of biometric under circumstances of national security, there was no concrete definition of national security included in the bill.\n\nOn religious laws and missionaries\n\nSatpathy supports the implementation of a Uniform Civil Code in India. He has criticised those current laws which are based on various religions, saying that the world is moving beyond religious scriptures and such laws only divide the society. He has also said that a lot of faith-based foreign aid comes to Odisha through missionaries. They offer the poor Dalits free education and jobs, this results in mass conversions to Christianity. Satpathy has said that politicians should use the dictionary definition of secularism to avoid confusion.\n\nOther opinions\n\nSatpathy has supported the inclusion of Members of Parliament under the Jan Lokpal Bill to curb corruption. In December 2015, he criticised the Arbitration and Conciliation (Amendment) Bill, 2015 during a debate, saying that the government was favouring big corporations with such laws. He has also criticised the Sansad Adarsh Gram Yojana calling it flawed and that it looks good only on paper. He said it forces him to choose only 8 villages from his constituency for development out of 3000. Satpathy has opposed the proposal to make Hindi the national language.\n\nSatpathy has criticised the construction of new nuclear power plants in India, claiming that most of the world was now moving away from nuclear energy. He has also claimed that Areva nuclear firm of France sold outdated technology to Maharashtra. He has also said that the centre should release the data regarding the safety of nuclear power plants as they are in other countries."}, {"url": "https://wiki.alquds.edu/?query=Tathagata_Satpathy", "page_content": "Indian politician\n\nTathagata Satpathy (born 1 April 1956) was a member of the 12th, 14th, 15th and 16th Lok Sabha of India. He represented the Dhenkanal constituency of Odisha, and was re-elected for the fourth time in 2014. He was a member of the Biju Janata Dal (BJD) political party, and the party's chief whip in the Lok Sabha. He took voluntary retirement from politics in March 2019. He is not an active politician ever since.\n\nLife and work [ edit ]\n\nTathagata Satpathy is the second son of former Odisha Chief Minister Nandini Satpathy and Devendra Satpathy.[1][2] He is the owner and editor of the daily Odia newspaper, Dharitri, and the English daily, Orissa Post.[3][2]\n\nTathagata educated at St. Columba's School in New Delhi and Sri Aurobindo International Centre of Education, Pondicherry, he has studied Philosophy, English and French. He had done his mother language, Oriya, by self study.\n\nTathagata entered active politics in the mid 70s as a teenager opposing the Emergency clamped by the Indian National Congress (INC).[4].\n\nWhile both his parents were long time Congress members, Tathagata has been opposed to that political party since before his career in electoral politics began early.\n\nHe joined active politics in the late 1980s when Sri Biju Patnaik took him into the Janata Party and he got elected to the Odisha Legislative Assembly and became an MLA in 1990. While his party kept changing its name from Janata Party to Janata Dal and later Biju Janata Dal, but he never changed his party.\n\nHe went on to become a Four term Member of Parliament till 2019 by winning the Dhenkanal-Angul Lok Sabha seat in 1998, 2004, 2009 and 2014 general elections.\n\nHis nephew Suparno Satpathy had unsuccessfully contested him in 2014 for the office of MP Lok Sabha, Dhenkanal.\n\nIn March 2015, Tathagata Satpathy became the first Indian Member of Parliament to hold an official \"Ask Me Anything\" session on the content-sharing website Reddit.[3] In April, Satpathy came forward in support of net neutrality, after the Telecom Regulatory Authority of India (TRAI) come out with a consultation paper on over-the-top (OTT) messaging services.[5] In December 2015, Satpathy had supported a bill to decriminalise homosexuality. The bill was introduced by INC leader Shashi Tharoor. But, it was defeated with 71 against, 1 abstaining and 24 in favour.[6]\n\nViews and opinions [ edit ]\n\nOn net neutrality [ edit ]\n\nIn March 2014, the Telecom Regulatory Authority of India (TRAI) released a formal consultation paper on over-the-top (OTT) messaging services and whether telecom operators should be allowed to charge separately for some messaging apps.[7] Soon afterwards, Tathagata Satpathy wrote an open letter to TRAI stating his support for net neutrality. In the letter, he said such a policy would hinder the Digital India project and kill new startups. He said that he used such apps to interact with his constituency and this policy will hinder his functioning as a representative.[8][9]\n\nOn legalisation of cannabis [ edit ]\n\nTathagata Satpathy has criticised the ban on cannabis in India, while pointing out the long history of its usage as a ritual and recreational intoxicant. He has said that cannabis was banned in India while alcohol was not, because of \"an elitist bias\" as cannabis was a poor man's drug. He has said the addiction depends on person's character and not on the intoxicant. He has suggested an amendment to the Narcotic Drugs and Psychotropic Substances Act, 1985 to allow recreational and medicinal usage of marijuana.[10] During his \"Ask Me Anything\" session on Reddit in March 2015, Satpathy admitted that he smoked cannabis when he was young.[3][11] In August 2015, during the monsoon session of the Parliament, he proposed the decriminalisation of cannabis.[12] In December 2015, he repeated his proposal during the winter session, saying that banning cannabis has forced villagers to turn to alcohol.[13][14]\n\nOn homosexuality and moral policing [ edit ]\n\nTathagata Satpathy has condemned the Section 377 of the Indian Penal Code, which criminalises homosexuality in India, calling it \"archaic\" and called for its repeal.[15] He had supported a bill introduced by INC MP Shashi Tharoor to decriminalise homosexuality during the 2015 winter session of the Parliament.[16] When the bill was defeated, Satpathy called it a very sad day.[17] Satpathy has also condemned moral policing and called for a repeal of laws banning pornography in India.[15]\n\nOn privacy and Aadhaar [ edit ]\n\nTathagata Satpathy has raised concerns that the Aadhaar project could be used for mass surveillance or ethnic cleansing in the future. He has questioned why a new identity card project was created despite having several identity cards systems. He has also criticised the decision to present the Aadhaar Bill, 2016 as a money bill. He pointed out that although the bill allows the sharing of biometric under circumstances of national security, there was no concrete definition of national security included in the bill.[18]\n\nOn religious laws and missionaries [ edit ]\n\nSatpathy supports the implementation of a Uniform Civil Code in India. He has criticised those current laws which are based on various religions, saying that the world is moving beyond religious scriptures and such laws only divide the society.[15] He has also said that a lot of faith-based foreign aid comes to Odisha through missionaries. They offer the poor Dalits free education and jobs, this results in mass conversions to Christianity.[19] Satpathy has said that politicians should use the dictionary definition of secularism to avoid confusion.[20]\n\nOther opinions [ edit ]\n\nSatpathy has supported the inclusion of Members of Parliament under the Jan Lokpal Bill to curb corruption.[21] In December 2015, he criticised the Arbitration and Conciliation (Amendment) Bill, 2015 during a debate, saying that the government was favouring big corporations with such laws.[22] He has also criticised the Sansad Adarsh Gram Yojana calling it flawed and that it looks good only on paper. He said it forces him to choose only 8 villages from his constituency for development out of 3000.[23] Satpathy has opposed the proposal to make Hindi the national language.[20]\n\nSatpathy has criticised the construction of new nuclear power plants in India, claiming that most of the world was now moving away from nuclear energy. He has also claimed that Areva nuclear firm of France sold outdated technology to Maharashtra. He has also said that the centre should release the data regarding the safety of nuclear power plants as they are in other countries.[24][25]\n\nSee also [ edit ]\n\nReferences [ edit ]"}, {"url": "https://www.thehindu.com/news/national/other-states/tathagata-satpathy-quits-active-politics/article26437549.ece", "page_content": "March 05, 2019 04:01 pm | Updated 04:03 pm IST - New Delhi\n\nDhenkanal MP Tathagata Satpathy, who served as the Biju Janata Dal’s (BJD) chief whip during the 16th Lok Sabha, announced his retirement from active politics and will not be contesting the 2019 Lok Sabha polls.\n\nMr. Satpathy, who is a four-term MP, first indicated his decision to withdraw from active politics in a tweet a few days ago at the 11th day function at the death of a constituent from Angul, saying he was “bidding adieu”.\n\nSpeaking to The Hindu , Mr. Satpathy said that he was quitting active politics for journalism. He is the owner of an Odia language paper Dharitri . He also said that there was a “dire need to leave space for young change makers and policy formulators”.\n\n“There is a need for more fearless voices in journalism now. I am distancing myself from politics to refocus on journalism. I am grateful to my leader Shri Naveen Patnaik for his support all these years. I have realised that politics is not the only means to support people.\n\n“Social leadership is lacking in this country. There is also a dire need to leave space for young change makers and policy formulators. Finally, my son’s insistence that I quit politics won,” he said.\n\nMr. Satpathy, one of the seniormost MPs in the BJD, has been known to champion liberal causes including the striking down of Section 377, opposing the all-encompassing Aadhaar legislation and the legalisation of marijuana."}, {"url": "https://indianexpress.com/article/india/india-others/tathagata-satpathy-mp-from-odisha-lends-support-for-net-neutrality/", "page_content": "Free-speech campaigners and internet activists received a major shot in the arm as Odisha MP Tathagata Satpathy lent his support for net neutrality by writing a letter to Telecom Regulatory Authority of India (TRAI) chairman Rahul Khullar.\n\nSatpathy, who had captured the internet’s charm about a month ago by participating in a free-wheeling chat on a Reddit AMA (ask-me-anything), is a member of the Biju Janata Dal (BJD) and was elected from the Dhenkanal constituency. Satpathy was then particularly praised for his Pink Floyd references and his open admission to smoking marijuana during his college days — such candid expressions that we have not come to expect from our elected parliamentarians.\n\n[related-post]\n\nSatpathy’s letter to the TRAI chairman assumes significance as it comes in the backdrop of a raging debate, particularly on social media, over the alleged attempts of telecom companies to introduce differential pricing plans for over-the-top services like WhatsApp, Skype and Viber. Campaigners for a free internet have argued that these companies are trying to clamp down on the internet’s transparency and freedom. While India does not have an existing legislation for net neutrality, TRAI has come up with a consultation paper that seeks views of the public on the matter. The debate, which has whipped up enormous intensity in the last few weeks, is supported by online petitions like this one on change.org which has already garnered more than 1,00,000 signatures.\n\nIn his letter, Satpathy argues that he uses the internet in different ways, by using messaging apps to keep contact with his staff, using cloud services to prepare documents and video calling to keep in touch with his constituents.\n\n“Internet forms an integral part of how I do my work, therefore I see this move by TRAI as a threat to my functioning as a representative,” the BJD MP writes in his letter.\n\nHe also argues in his letter that charging separately for over-the-top services will be seen as restricting the access to internet. Depicting TRAI’s move as going against Prime Minister Narendra Modi’s dream of a digital India, Satpathy writes that the step will be against the “desires of those who wish to make India a modern nation.”\n\nThe letter talks about how the net neutrality principle is not an ‘elitist’ problem as it also affects people with affordable smartphones.\n\nAdvertisement\n\n“We are a growing country and we should have proper laws in place, not to regulate, but to encourage the use of internet,” he writes.\n\nRead Satpathy’s full letter below."}, {"url": "https://www.livemint.com/Politics/cEdbfFmpXQ6GNImduzrRTI/Who-is-Tathagata-Satpathy.html", "page_content": "New Delhi: Amidst the cacophony of aggressive voices from both the government and the opposition during the debate on the Jawaharlal Nehru University row and the death of Hyderabad University student Rohith Vemula, the speech by senior Biju Janata Dal (BJD) leader Tathagata Satpathy came as a breath of fresh air.\n\n“I am heartbroken to say that the youth of the country doesn’t deserve us. We are the most undeserving set of people to be in this House today,\" Satpathy, who represents Dhenkanal Lok Sabha constituency in the Lok Sabha, said.\n\nHe went on to say: “I am not interested in taking sides with any of these parties. I am here to hear who has a word of solace and point of solution to the problems that the nation is facing today. Is it only votes that matter? Is it just us and them?\"\n\nHis speech went viral on social media with people praising him for taking the matter above politics. This is not the first time that Satpathy has stood out among other parliamentarians. On several other occasions in the past, he has articulated his views on women’s reservation, crimes against women, net neutrality, Section 377 and even legalisation of cannabis.\n\nDuring an AMA (ask me anything) session on Reddit last year, Satpathy admitted that he had smoked cannabis. “While in college, I have smoked (and unlike Bill Clinton have inhaled) cannabis many a times. In villages of Orissa, many people openly smoke and, as their representative, I am not entitled to be judgmental.\"\n\nSpeaking to Mint after his speech in Parliament, Satpathy said he speaks his mind, does not fear controversies and believes in change through debate.\n\nThe 59-year-old, also the chief whip of the BJD, is the son of Odisha’s only woman chief minister Nandini Satpathy. He is currently serving his fourth term as a member of the lower house of Parliament. A journalist by profession, Satpathy is the owner and editor of leading Odia daily Dharitri and English daily Orissa Post.\n\n“We have been harping on rights for far too long. Time has changed to expose the wrongs,\" Satpathy said. He added that it is time politicians start talking truthfully and make citizens conscious of their duties and responsibilities. “India is going through a churning. I am an optimist. I see good times ahead.\"\n\nEven during the monsoon session last year, when 25 Congress MPs were suspended, Satpathy spoke up in the lower house and made a strong plea against taking up any legislative business in the absence of MPs from several opposition parties, including Congress.\n\nThough Satpathy does not have a personal Twitter or Facebook account, his office runs a Twitter account on his behalf at @SatpathyLive. “I am more a print media guy. I regret to say that I am not very social media savvy, though I am very social. I love to sit down with my friends and chat,\" he said.\n\nHis attendance record in the current Lok Sabha has been 93% as opposed to an average of 83% for parliamentarians. In the 16th Lok Sabha, he has participated in a total of 34 debates and asked three questions, according to the New Delhi-based PRS Legislative Research.\n\n“Parliament is partisan when it comes to giving more time and importance to leaders from parties. Someone like Satpathy would be heard and much more noticed outside Parliament than inside. His is a sane and rational voice. The point that he made on Tuesday about us and them is very critical. The way we are, our politicians are, there seems to be no middle ground and in that way he was making a very important statement,\" said Manisha Priyam, a New Delhi-based political analyst."}, {"url": "https://www.indiatoday.in/india/story/bjd-mp-tathagata-satpathy-quits-politics-to-refocus-on-journalism-1471111-2019-03-05", "page_content": "By Press Trust of India: Tathagata Satpathy, four-time Biju Janata Dal's (BJD) MP from Odisha on Tuesday announced his retirement from politics to \"refocus\" on journalism.\n\nSatpathy's announcement came a day after his former party colleague in Lok Sabha Baijayant Panda joined the Bharatiya Janata Party (BJP).\n\nWhile Panda had resigned from the BJD as well as the Lok Sabha due to differences with party president and chief minister Naveen Patnaik, Satpathy's decision has surprised all.\n\nadvertisement\n\nSon of former Odisha chief minister Nandini Satpathy, Tathagata Satpathy is a Lok Sabha MP from Dhenkanal constituency of the state.\n\n\"There is a need for more fearless voices in journalism now. I am distancing myself from politics to refocus on journalism. I am grateful to my leader Shri Naveen Patnaik for his support all these years. Realised that politics is not the only means to support people,\" Satpathy said on Twitter.\n\nSatpathy edits two dailies, one in Odia and the other in English-- 'Orissa Post'.\n\nStating that he respects Patnaik and the people of Dhenkanal and Angul for their love and affection, Satpathy said there was no specific political reason behind his decision.\n\nHe further said that he was planning to meet Patnaik and apprise him about his decision to not contest elections anymore.\n\nTo a query, the 62-year-old editor-turned-politician said: \"I am taking this decision as per the wish of my 13-year-old son. I am not the person on whom any pressure can work.\"\n\n\"My son wants me to stay at home, focus on journalism and not to contest election,\" he added.\n\nHe further said it was time that people who were now old and had been elected multiple times should step down to make way for new ideas and new policy makers.\n\nThe Dhenkanal MP also made it clear that he would not join any other political party as he had great respect for Patnaik.\n\nSatpathy dismissed speculation about his wife being fielded as a BJD candidate from Dhenkanal and said, \"No, nothing like that. I want to make it clear that my wife will not contest the elections.\"\n\nHe also rejected suggestions that his decision was based on possibility of not getting a ticket for the 2019 elections.\n\nKnown as an independently-minded leader, Satpathy, said he also does not support the idea that children of politicians should also enter politics.\n\nALSO READ | Odisha: BJD MP Tathagata Satpathy claims BJP trying AIADMK-type split in his party\n\nALSO WATCH | Odisha minister slams Maneka Gandhi over shelter home scandal"}, {"url": "https://www.hindustantimes.com/india-news/bjd-mp-tathagata-satpathy-says-he-is-quitting-politics-denies-heading-for-bjp/story-XqfMSkBuzvG8XN2YHGfUeJ.html", "page_content": "A day after former BJD MP Baijayant Panda joined the BJP, four-time BJD MP from Dhenkanal, Tathagata Satpathy announced his decision to quit politics on Tuesday. Tathagata Satpathy is a four-time MP from Dhenkanal in Odisha.(HT PHOTO)\n\nSatpathy, son of former Odisha chief minister Nandini Satpathy, said that he was bidding goodbye to electoral politics following the wish of his son 13-year-old son Aaryl Che. “I was mulling it for a long time. My son was pressurising me. He wants me to stay at home, focus on journalism and not to contest election. But I will be in politics,” Satpathy told HT.\n\nThe 63-year-old Satpathy triggered speculations of his quitting politics on Monday when he tweeted about attending attended the 11th day ritual (shraddha) of an acquaintance in Angul district along with seven BJD MLAs. “Lunched and happily bid adieu to all,” he tweeted.\n\nSatpathy will meet chief minister Naveen Patnaik on Wednesday and formally announce his decision of not contesting elections anymore. “I will focus on my newspaper and not join any other party,” said Satpathy, reacting to rumours that he was headed for BJP.\n\nAlso read: Jay Panda joins BJP, 9 months after walking out of Odisha’s Biju Janata Dal\n\nOne of the most vocal MPs of BJD - be it on the demand to legalise use of cannabis to criticising the GST and demonetisation - Satpathy is believed to have fallen out of favour with chief minister of late. However, BJD sources said Satpathy was trying to get a BJP ticket for his wife Adyasha for Dhenkanal Lok Sabha constituency.\n\nBorn to politician parents (father Debendra Satpahy was two time MP and mother Nandini was Union minister as well as CM) and educated in Puducherry’s Sri Aurobindo International Centre of Education, he seemed to be well-set for a career in politics, but did not achieve any success initially. Known to be brash, Tathagata during the emergency days allegedly called shots in Odisha administration taking advantage of his mother’s position as CM.\n\nIt was in 1990, when Tathagat had tasted his first political success after he joined Janata Dal in 1989 under Biju Patnaik and was elected from Dhenkanal Sadar assembly constituency. To secure her son’s career, Nandini moved to neighbouring Gondia seat, from where she won on a Congress ticket. In 1998, he was elected to Lok Sabha for the first time from Dhenkanal, but suffered a defeat in 1999 general election at the hands of KP Singh Deo.\n\nA year later he quit BJD to join Bijoy Mohapatra’s nascent Odisha Gana Parishad where he was secretary general. When he realised that his political career was going nowhere with OGP, he quit to join BJD a month before the 2004 Lok Sabha election. Since then he has never lost from Dhenkanal.\n\nSatpathy is better known in Odisha as editor of Dharitri, now among the top three Odia dailies. In the early 1990s, he turned the staid eveninger Dharitri into a morning paper which boosted its circulation."}, {"url": "https://commons.wikimedia.org/wiki/Category:Tathagata_Satpathy", "page_content": "Position held\n\nMember of the 16th Lok Sabha\n\nMember of the Tenth Odisha Legislative Assembly (1990–1995)\n\nMember of the 12th Lok Sabha"}, {"url": "https://indianexpress.com/article/india/bjd-mp-tathagata-satpathy-quits-active-politics-to-refocus-on-journalism-5612355/", "page_content": "Four-time MP and BJD’s chief whip in the outgoing 16th Lok Sabha Tathagata Satpathy on Tuesday announced his retirement from active politics.\n\nThe MP from Dhenkanal said he would not contest the upcoming Lok Sabha elections.\n\nThe reason, he said, was his desire to go back to journalism. “There is a need for more fearless voices in journalism now,” Satpathy, owner and editor of leading Odia-language newspaper Dharitri, told The Indian Express.\n\n“Distancing myself from politics to refocus on journalism,” Satpathy said. “I realised that politics is not the only means to support people. Social leadership is lacking in this country.”\n\nHe expressed gratitude to Chief Minister and BJD leader Naveen Patnaik for his support throughout his terms.\n\nSatpathy was a member of the Odisha assembly from 1990-95. He was also a member of the 12th, 14th and 15th Lok Sabha.\n\nThe 62-year-old leader said he wanted to give an opportunity to youth to come up in politics. “Also a dire need to leave space for young change makers and policy formulators,” he said.\n\nAdvertisement\n\nInside the BJD, Satpathy was known to speak his mind on many occasions. At a party event in 2017, he criticised the BJD for its factionalism.\n\n“We lack mutual understanding. Workers are part of factions. Legislators and MPs are part of groups. This groupism is hurting us individually. If we do not take care, we will be wiped out,” Satpathy had said.\n\nWhile Patnaik supported many policies of the Centre, such as demonetisation, Satpathy had a different view. “If we do not take an open and clear stand against the BJP and we always play both sides, then people will also say, why should I not write to the postmaster instead of using the postman? There will be no pre-poll or post-poll alliance needs to be clearly stated by the top rung, not just by me,” he said in the same speech.\n\nAdvertisement\n\nSatpathy built a reputation as a parliamentarian of wit. In a Lok Sabha speech on mob violence, he said, “Gau rakshaks running around in the countryside are probably not aware that most cows in India are actually Jersey cows. They are not their mothers.”\n\nHe has also protested against what he termed the hegemony of the Hindi language over regional languages, such as Odia.\n\nSatpathy is the younger son of Odisha’s only woman chief minister Nandini Satpathy."}], "Tathagata Satpathy is a Member of Parliament in the Lok Sabha.": [{"url": "https://indianexpress.com/article/political-pulse/tathagata-satpathy-interview-cong-defamation-rahul-gandhi-8542406/", "page_content": "With Congress leader Rahul Gandhi convicted of criminal defamation last month, and subsequently disqualified as Lok Sabha MP, there have been calls for a review of the criminal defamation legislation in India. It is not the first time.\n\nIn 2016, then Biju Janata Dal (BJD) MP Tathagata Satpathy moved a Private Member’s Bill in the Lok Sabha to decriminalise defamation — the Protection of Speech and Reputation Bill (commonly known as the “Speech Bill”). Satpathy, who is now the editor of Odia daily Dharitri, speaks to The Indian Express about what prompted him to introduce the Bill, its features, the response of other parties, and the effect criminal defamation has in today’s political climate. Excerpts:\n\nAs an editor, I had about 87 defamation cases filed against me. In Odisha, you have a law that women don’t have to deposit money if they want to file a defamation case. Normally, if you want to file a defamation case you have to deposit a certain percentage of what you claim in court. What happens if you level an allegation or publish a story against the police officials and bureaucrats in the newspapers is that they will get their wives or mothers or sisters to file a case against you. Even if you have enough evidence against them, they will file. Eventually, you will get cleared — in my case, I won all the cases if not in the lower court, then in the higher court. But it’s harassment.\n\nSo, partly, my Bill was driven by my personal experiences. Because two proceedings, civil and criminal, for the same offence do not seem justified to me. If you look at the global picture, the criminal aspect of the defamation case is not there in any democratic country. The last one I know that had it was Australia but they also removed it a few years ago. In most countries, it’s only the civil part. My simple counter was how can we prosecute twice for the same offence?\n\nI sought the help of lawyers and others, including journalists. Apar Gupta was one of the lawyers who played a key role in drafting that Bill. I may have read the Bill at least 100 times before I went ahead with it. Apar then suggested it would be good if we could put it up for public review, which we did. We had a website — speechbill.in — and sought people’s views also. We received a lot of feedback.\n\nWhat were the features of the Bill?\n\nThe main feature of the Bill was that it decriminalised defamation and treated it as a civil offence. It had provisions to curb the chilling effects of criminal defamation and had provisions to prevent damage to reputations. It had quantification of damages for defamation, fixed the maximum amount of damages, and barred governments and institutions exercising government or statutory functions from filing defamation suits.\n\nHow relevant is it in the wake of recent political events?\n\nI did not foresee such an event. I always thought that it is very wrong. Today, everyone seems to have woken up. At the time, the Congress did not support my Bill, no one backed me. But, I wanted to put it on record for posterity at least. I would not say it was a watertight Bill. It needed improvement. But I would like MPs to take it up.\n\nAdvertisement\n\nBeing an editor, and an active politician not so long ago, what do you think of the position that the right to reputation is no less important a right than the right to freedom of speech?\n\nRight to reputation is a debatable point and that can never ever infringe on freedom of speech or freedom of expression. A statement or a post or a tweet can be said to be hurting someone’s sense and sensibilities. We are seeing it across the country. Then, it is up to them, not to the defendant, to prove how their reputation has been hurt. It’s in the legal process also that during the cross-examination the complainant has to prove how … but all they can do is to find one or two witnesses in their neighbourhood to say ‘yes, we thought bad of her or him because of the remark’.\n\nThere are instances of people in power using the defamation law. Do you think it is being used to silence people?\n\nYes, people in power become super touchy. Some people say vulgar things but defend those by claiming freedom of speech. When someone calls me leftist or presstitute or sickular, I get offended. I am very badly hurt because I do not consider myself as someone selling his pen, I consider myself to be neither secular nor Leftist. Yes, I consider myself a liberal, I agree. I was in the House (Lok Sabha) when a Minister of State uttered the word ‘Presstitute’ on the floor of the House. As an editor and a working journalist, I was hurt. We knew that nothing will come of it. Yes, the same people use defamation clauses against others.\n\nAnother thing is that our lower judiciary is not trained to handle so many issues that come up with something like defamation. They are not normal criminal cases but are hypothetical ones. Our lower judiciary is not equipped to handle them. We talk of judicial reforms and the law minister is constantly talking against the collegium. But they are talking about the Supreme Court that they are dealing with every day. But the common Indian does not get to reach the Supreme Court. They are penalised, prosecuted, sentenced, jailed, given life terms, and the appeals take years. Some die in prisons. I would say 99 per cent of our population even. The high courts seem very high. People can afford to go to only the lower courts. I do not think the lower courts can sit in judgment on such delicate issues.\n\nAdvertisement\n\nHave you come across instances of defamation clauses being used against political rivals?\n\nI have never experienced (it), at least not in Odisha. But, of course, it comes up against the media. Of late, it has been happening. They are managing to corner opponents that way. The number of defamation cases was much lower 15-20 years back. Either people were gentler or they were not so touchy. If you start taking one line out of a speech, it can work any which way.\n\nYou are an editor. Does the new trend make you think twice before criticising someone powerful even if it’s based on fact? Do you think there is increasing fear among citizens about criticising someone or exposing corruption?\n\nYes, people across India today are much more careful about what they say, especially about politics and politicians. Also about big business. All the powerful people.\n\nYou too?\n\nI am a don’t-care-a-hoot kind of person but I refrain from being abusive. I speak what I like and also write what I think is correct. Also, must admit I have personally not felt fear or threatened, as yet."}, {"url": "https://tathagatasatpathy.com/site/Biography", "page_content": "Biography :\n\nCurriculum Vitae\n\nTathagata Satpathy\n\nDOB: April 01, 1956 at Cuttack, Orissa, India\n\nEducation\n\nEducated at Sri Aurobindo Center of Education, Pondicherry, South India.\n\nSubjects studied English, Philosophy and French\n\nCan speak English, Oriya, Hindi, French\n\nOccupation\n\nJournalism & Publishing Editor Dharitri, published from Bhubaneswar and Sambalpur\n\nDharitri is the first Oriya daily to have an online presence.\n\nThe newspaper is 16 paged with a reach of 12,50,000 readers and has local, national and international news along with views that promote thoughts of a free and liberal world order\n\nElected Representative\n\nHas been a Member of:\n\nOrissa Legislative Assembly (1990-95)\n\nOrissa Legislative Assembly (1990-95) 12th Lok Sabha (1998-99)\n\n(1998-99) 14th Lok Sabha (2004-09)\n\n(2004-09) 15th Lok Sabha (2009-14)\n\n(2009-14) 16th Lok Sabha (2014-present)\n\n(2014-present) Parliamentary Standing Committee on Information Technology\n\nParliamentary Standing Committee on Coal & Steel\n\nParliamentary Standing Committee on Privileges\n\nOther positions held\n\nMember of Marine Product Export Development Authority, India (MPEDA)\n\nPresident of Chacrateertha Bikash Parishad, Puri, Orissa: an organization focused on creating public awareness on the importance of environment protection and waste management\n\nWorking President Akhshyam Kalyan Samiti, Dhenkanal, Orissa: a voluntary organization aiding poor physically challenged children. This organization provides free accommodation, food, education and vocational training for 236 deaf & dumb and blind girls and boys\n\nFounder and President DSM College, Koilpangi, Orissa: a twin stream higher educational institution (Arts and Science) imparting value added education to approx 400 students.\n\nAdvisor for ‘Nrutingyana’: an NGO providing a platform for talented young people in the state of Orissa in the sphere of dance and theatre\n\nActivities\n\nConvenor of ‘UrJa-Itz My World’: an annual meet of over 120 girls representing various colleges from all parts of Orissa. UrJa provides a platform to these students to interact not only with each other but also with eminent personalities excelling in different spheres from India and abroad. The idea of ‘UrJa’ is to imbibe a spirit of competitive individualism that would help in making the participating girls worth and responsible citizens of a democratic society\n\nConferences attended\n\nRepresenting India in Parliamentarians for Global Action, 1998 (New York)\n\nRepresenting Indian Editors in conference on peace initiatives in South East Asia, 2002 (Karachi, Pakistan)\n\nRepresenting Finance Committee of Indian Parliament at the UN (New York)\n\nInterests\n\nFinance, Trade\n\nProtection of natural resources (forest, mines, water reserves etc) in developing economies\n\nCampaigning for new laws on crime against women\n\nInformation Technology and Telecom reforms\n\nHolder of valid Private Pilot’s Licence with over 300 hours of single engine experience\n\nShort CV:\n\nTATHAGATA SATPATHY\n\nEDITOR, DHARITRI\n\nMEMBER OF PARLIAMENT, 16TH LOK SABHA\n\nTathagata Satpathy is editor of Dharitri, an Oriya-language daily newspaper published from Bhubaneswar and Sambalpur. The paper was the first Oriya daily to publish an internet edition. Mr Satpathy was a member of the 12th, 14th and 15th Lok Sabha (lower house of parliament) between 1998 and 2009 and served as a member of the Orissa Legislative Assembly from 1990 to 1995. He is presently the elected representative from Dhenkanal, Orissa in the 16th Lok Sabha.\n\nHis was a member of the Parliamentary Standing Committee on Information Technology, comprising the departments of information technology, posts, information and broadcasting, and telecommunications. He has served as a member of the Marine Products Export Development Authority, India. He was also president of Chacrateertha Bikash Parishad in Puri, Orissa, an organisation focused on creating public awareness of the importance of environmental protection and waste management, and working president of Akhshyam Kalyan Samiti in Dhenkanal, Orissa, a voluntary organisation that provides free accommodation, food, education and vocational training for 236 physically challenged children.\n\nMr Satpathy is founder and president of DSM College in Koilpangi, Orissa, a twin-stream (arts and science) higher-education institution imparting value-added education to approximately 400 students. He is also an adviser to Nrutingyana, a non-governmental organisation that provides a platform for talented young people in the state of Orissa in the sphere of dance and theatre; and convenor of UrJa-Itz My World, an annual meeting of more than 120 girls representing various colleges from all parts of Orissa.\n\nMr Satpathy was educated at Sri Aurobindo Center of Education, Pondicherry, South India."}, {"url": "https://peoplepill.com/people/tathagata-satapathy/", "page_content": "Tathagata Satpathy (born 1 April 1956) was a member of the 12th , 14th, 15th and 16th Lok Sabha of India. He represented the Dhenkanal constituency of Odisha, and was re-elected for the fourth time in 2014. He was a member of the Biju Janata Dal (BJD) political party, and the party's chief whip in the Lok Sabha. He took voluntary retirement from politics in March 2019. He is not an active politician ever since.\n\nLife and work\n\nTathagata Satpathy is the younger son of former Odisha Chief Minister Nandini Satpathy and Devendra Satpathy. He is the owner and editor of the daily Odia newspaper, Dharitri, and the English daily, Orissa Post.\n\nIn 2000, Satpathy joined the Orissa Gana Parishad ( a non political outfit), and served as its secretary general. After Naveen Patnaik got elected in 2000, Satpathy had used his newspaper Dharitri to criticise his policies which he does even now. In March 2004, just before the 2004 Indian general election, Satpathy reconciled with BJD. He said that he was forced to quit OGP due its changing into a political party as also forming an alliance with Janaki Ballabh Patnaik-led Indian National Congress (INC).\n\nHis nephew Suparno Satpathy had unsuccessfully contested him in 2014 for the office of MP Lok Sabha, Dhenkanal.\n\nIn March 2015, Tathagata Satpathy became the first Indian Member of Parliament to hold an official \"Ask Me Anything\" session on the content-sharing website Reddit. In April, Satpathy came forward in support of net neutrality, after the Telecom Regulatory Authority of India (TRAI) come out with a consultation paper on over-the-top (OTT) messaging services. In December 2015, Satpathy had supported a bill to decriminalise homosexuality. The bill was introduced by INC leader Shashi Tharoor. But, it was defeated with 71 against, 1 abstaining and 24 in favour.\n\nViews and opinions\n\nOn net neutrality\n\nIn March 2014, the Telecom Regulatory Authority of India (TRAI) released a formal consultation paper on over-the-top (OTT) messaging services and whether telecom operators should be allowed to charge separately for some messaging apps. Soon afterwards, Tathagata Satpathy wrote an open letter to TRAI stating his support for net neutrality. In the letter, he said such a policy would hinder the Digital India project and kill new startups. He said that he used such apps to interact with his constituency and this policy will hinder his functioning as a representative.\n\nOn legalisation of cannabis\n\nTathagata Satpathy has criticised the ban on cannabis in India, while pointing out the long history of its usage as a ritual and recreational intoxicant. He has said that cannabis was banned in India while alcohol was not, because of \"an elitist bias\" as cannabis was a poor man's drug. He has said the addiction depends on person's character and not on the intoxicant. He has suggested an amendment to the Narcotic Drugs and Psychotropic Substances Act, 1985 to allow recreational and medicinal usage of marijuana. During his \"Ask Me Anything\" session on Reddit in March 2015, Satpathy admitted that he smoked cannabis when he was young. In August 2015, during the monsoon session of the Parliament, he proposed the decriminalisation of cannabis. In December 2015, he repeated his proposal during the winter session, saying that banning cannabis has forced villagers to turn to alcohol.\n\nOn homosexuality and moral policing\n\nTathagata Satpathy has condemned the Section 377 of the Indian Penal Code, which criminalises homosexuality in India, calling it \"archaic\" and called for its repeal. He had supported a bill introduced by INC MP Shashi Tharoor to decriminalise homosexuality during the 2015 winter session of the Parliament. When the bill was defeated, Satpathy called it a very sad day. Satpathy has also condemned moral policing and called for a repeal of laws banning pornography in India.\n\nOn privacy and Aadhaar\n\nTathagata Satpathy has raised concerns that the Aadhaar project could be used for mass surveillance or ethnic cleansing in the future. He has questioned why a new identity card project was created despite having several identity cards systems. He has also criticised the decision to present the Aadhaar Bill, 2016 as a money bill. He pointed out that although the bill allows the sharing of biometric under circumstances of national security, there was no concrete definition of national security included in the bill.\n\nOn religious laws and missionaries\n\nSatpathy supports the implementation of a Uniform Civil Code in India. He has criticised those current laws which are based on various religions, saying that the world is moving beyond religious scriptures and such laws only divide the society. He has also said that a lot of faith-based foreign aid comes to Odisha through missionaries. They offer the poor Dalits free education and jobs, this results in mass conversions to Christianity. Satpathy has said that politicians should use the dictionary definition of secularism to avoid confusion.\n\nOther opinions\n\nSatpathy has supported the inclusion of Members of Parliament under the Jan Lokpal Bill to curb corruption. In December 2015, he criticised the Arbitration and Conciliation (Amendment) Bill, 2015 during a debate, saying that the government was favouring big corporations with such laws. He has also criticised the Sansad Adarsh Gram Yojana calling it flawed and that it looks good only on paper. He said it forces him to choose only 8 villages from his constituency for development out of 3000. Satpathy has opposed the proposal to make Hindi the national language.\n\nSatpathy has criticised the construction of new nuclear power plants in India, claiming that most of the world was now moving away from nuclear energy. He has also claimed that Areva nuclear firm of France sold outdated technology to Maharashtra. He has also said that the centre should release the data regarding the safety of nuclear power plants as they are in other countries."}, {"url": "https://alchetron.com/Tathagata-Satpathy", "page_content": "Tathagata Satpathy (born 1 April 1956) is a member of the 16th Lok Sabha of India. He represents the Dhenkanal constituency of Odisha, and was re-elected for the fourth time in 2014. He is a member of the Biju Janata Dal (BJD) political party, and the party's chief whip in the Lok Sabha.\n\nLife and work\n\nTathagata Satpathy is the younger son of former Odisha Chief Minister Nandini Satpathy and Devendra Satpathy. He is the owner and editor of the daily Odia newspaper, Dharitri, and the English daily, Orissa Post.\n\nIn 2000, Satpathy was suspended from the Biju Janata Dal (BJD). Following which, Satpathy joined the Orissa Gana Parishad (OGP) and served as its general secretary. After Naveen Patnaik got elected in 2000, Satpathy had used his newspaper Dharitri to criticise his policies. In March 2004, just before the Indian general election, 2004, Satpathy reconciled with BJD. He said that he was forced to quit OGP due its alliance with Janaki Ballabh Patnaik-led Indian National Congress (INC).\n\nIn April 2014, noted socio-political leader, the Chairman of Smt. Nandini Satpathy Memorial Trust (SNSMT) and the eldest grandson of Nandini Satpathy, Suparno Satpathy ( son of Tathagata's only elder brother ), contested against Tathagata Satpathy in the Indian general election, 2014 for the Dhenkanal constituency, but lost by a big margin. Suparno Satpathy contested on a Aama Odisha Party (AOP) ticket.\n\nIn March 2015, Tathagata Satpathy became the first Indian Member of Parliament to hold an official \"Ask Me Anything\" session on the content-sharing website Reddit. In April, Satpathy came forward in support of net neutrality, after the Telecom Regulatory Authority of India (TRAI) come out with a consultation paper on over-the-top (OTT) messaging services. In December 2015, Satpathy had supported a bill to decriminalise homosexuality. The bill was introduced by INC leader Shashi Tharoor. But, it was defeated with 71 against, 1 abstaining and 24 in favour.\n\nOn net neutrality\n\nIn March 2014, the Telecom Regulatory Authority of India (TRAI) released a formal consultation paper on over-the-top (OTT) messaging services and whether telecom operators should be allowed to charge separately for some messaging apps. Soon afterwards, Tathagata Satpathy wrote an open letter to TRAI stating his support for net neutrality. In the letter, he said such a policy would hinder the Digital India project and kill new startups. He said that he used such apps to interact with his constituency and this policy will hinder his functioning as a representative.\n\nOn legalisation of cannabis\n\nTathagata Satpathy has criticised the ban on cannabis in India, while pointing out the long history of its usage as a ritual and recreational intoxicant. He has said that cannabis was banned in India while alcohol was not, because of \"an elitist bias\" as cannabis was a poor man's drug. He has said the addiction depends on person's character and not on the intoxicant. He has suggested an amendment to the Narcotic Drugs and Psychotropic Substances Act, 1985 to allow recreational and medicinal usage of marijuana. During his \"Ask Me Anything\" session on Reddit in March 2015, Satpathy admitted that he smoked cannabis when he was young. In August 2015, during the monsoon session of the Parliament, he proposed the decriminalisation of cannabis. In December 2015, he repeated his proposal during the winter session, saying that banning cannabis has forced villagers to turn to alcohol.\n\nOn homosexuality and moral policing\n\nTathagata Satpathy has condemned the Section 377 of the Indian Penal Code, which criminalises homosexuality in India, calling it \"archaic\" and called for its repeal. He had supported a bill introduced by INC MP Shashi Tharoor to decriminalise homosexuality during the 2015 winter session of the Parliament. When the bill was defeated, Satpathy called it a very sad day. Satpathy has also condemned moral policing and called for a repeal of laws banning pornography in India.\n\nOn privacy and Aadhaar\n\nTathagata Satpathy has raised concerns that the Aadhaar project could be used for mass surveillance or ethnic cleansing in the future. He has questioned why a new identity card project was created despite having several identity cards systems. He has also criticised the decision to present the Aadhaar Bill, 2016 as a money bill. He pointed out that although the bill allows the sharing of biometric under circumstances of national security, there was no concrete definition of national security included in the bill.\n\nOn religious laws and missionaries\n\nSatpathy supports the implementation of a Uniform Civil Code in India. He has criticised those current laws which are based on various religions, saying that the world is moving beyond religious scriptures and such laws only divide the society. He has also said that a lot of faith-based foreign aid comes to Odisha through missionaries. They offer the poor Dalits free education and jobs, this results in mass conversions to Christianity. Satpathy has said that politicians should use the dictionary definition of secularism to avoid confusion.\n\nOther opinions\n\nSatpathy has supported the inclusion of Members of Parliament under the Jan Lokpal Bill to curb corruption. In December 2015, he criticised the Arbitration and Conciliation (Amendment) Bill, 2015 during a debate, saying that the government was favouring big corporations with such laws. He has also criticised the Sansad Adarsh Gram Yojana calling it flawed and that it looks good only on paper. He said it forces him to choose only 8 villages from his constituency for development out of 3000. Satpathy has opposed the proposal to make Hindi the national language.\n\nSatpathy has criticised the construction of new nuclear power plants in India, claiming that most of the world was now moving away from nuclear energy. He has also claimed that Areva nuclear firm of France sold outdated technology to Maharashtra. He has also said that the centre should release the data regarding the safety of nuclear power plants as they are in other countries."}, {"url": "https://in.opencampaign.com/politicians-in-india/17775/tathagata-satpathy", "page_content": "* Official Email\n\nOTP\n\n1) If you are an incumbent (Sitting Member), we need your id card which shows your photo as well as your constituency area and your designation (MP, MLA, Corporator, Mayor, District or Taluka Panchayat Member etc.)\n\n2) If you are not an incumbent, a challenger, we need your party id and aadhar card."}, {"url": "https://www.thehindu.com/opinion/op-ed/Parliament-proceedings-Misdiagnosis-of-the-Rajya-Sabha-malfunction/article62116561.ece", "page_content": "December 23, 2015 01:05 am | Updated December 04, 2021 11:34 pm IST\n\nThe 2015 winter session of the Rajya Sabha has been one of the least > productive sessions in recent times. The English media’s pet concern, the Goods and Services Tax Bill, could not be passed in the process. This has triggered outrage, with some questioning the need for an Upper House at all. Some others have opined that an indirectly elected body such as the Rajya Sabha should not be allowed veto powers over a directly elected Lok Sabha.\n\nEfforts to thwart productivity of either House of Parliament are condemnable and should trigger a debate on reforms to minimise them. However, mere opposition to a bill in the Rajya Sabha that has been passed by the Lok Sabha cannot be an excuse to curtail its powers. It is important to separate the two issues, legislative productivity vis-à-vis legislative dissent, which seem to have been muddled up in the current discourse. Amid these jumbled arguments, somehow the anti-defection law and the party whip have also been charged of abetting this failure of the Rajya Sabha to function, thus apportioning blame to everyone from our founding fathers to former Prime Minister Rajiv Gandhi for all our current evils. While it is tempting to attempt to string all these disparate issues into one rope with which to hang all of them, it is important to understand the guiding principles behind these laws and determine if those are still relevant to modern-day India before venturing into knee-jerk reforms.\n\nCheck against whims Mohammad Tahir representing Bihar in the Constituent Assembly during the debate on the Constitution on July 28, 1947 said that “the Upper House is a creation of imperialism” and argued that independent India did not need it. To which, the mover of the debate, Gopalaswami Ayyangar, replied that “the role of the Upper House is merely to delay legislation which might be the outcome of passions of the moment until the passions have subsided”. It was obvious even to our founding fathers that the “House of People” (Lok Sabha) can fall prey to passionate rhetoric and thus felt a need for a “House of Elders” (Rajya Sabha) to instil calm. The powers of the Upper House to delay and oppose legislation passed by the Lower House were recognised and enshrined right from the very birth of the Rajya Sabha. It can be nobody’s case that today’s Lok Sabha MPs are any less vulnerable to passing laws in the spur of the moment than our founding fathers were. So, to argue that the Rajya Sabha is being obstructionist for merely opposing legislation of the Lower House is a flawed argument.\n\nNext is this false narrative of indirectly elected members of the Rajya Sabha having veto powers over the members of the Lok Sabha who are direct representatives of the people. In our first-past-the-post electoral system where a political party can form a government without the majority of citizens voting for it, legislation passed by the Lok Sabha may not necessarily represent the views of the majority. The percentage of seats won in the Lok Sabha by a political party is not the same as percentage of Indians voting for that party, as we all know. It then becomes even more pertinent and critical to have an active and vibrant Rajya Sabha.\n\nThat the Rajya Sabha would an indirectly elected body and would act as a balance to certain whimsical legislation of the people’s representatives in the Lok Sabha was a conscious design of our founding fathers. If anything, this need has only been exacerbated with creeping majoritarianism in the current Lok Sabha. It is thus futile to argue that somehow directly elected representatives are better lawmakers than those indirectly elected, and hence should be subordinate. The inability to build consensus by a ruling party cannot be disguised as opposition obstruction and elicit calls for reducing the powers of the Rajya Sabha. The need to build consensus in both Houses of Parliament to pass legislation should be the guiding principle of our parliamentary democracy.\n\nThen, there is the argument that the Anti-Defection Act, which immediately disqualifies any member of Parliament who either changes political parties mid-way or disobeys the whip of her party, aggravates the chances of a dysfunctional Parliament. The core principle behind the Anti-Defection Act is to prevent horse-trading on the floor of the House and penalise members who succumb to temptations from opposition parties. This principle still remains very relevant for a large, diverse polity such as ours, with a large number of regional parties. The Lok Sabha recently held a discussion on a private member’s bill to de-criminalise certain Section 377 of the Indian Penal Code. There was no whip issued by the major parties and members voted according to their choices, many times contrary to their party colleagues. The choice of when to issue a whip rests with the party. The Anti-Defection Act in itself cannot be made a villain for an internal matter of political parties over degrees of freedom to be given to their members for voting in Parliament.\n\nScope for reform All this is not to suggest everything is hunky-dory with our current system. There is clearly a need for new rules to prevent productivity of the entire House being held hostage by a few members rushing to the Well. There has to be an outlet for opposition members to voice their protests without disrupting productivity. One suggestion is to have designated day(s) in a week on which the opposition can raise, discuss and debate issues rather than the government dictating the order of business every day of the session. There can be innovative ways to create a framework within which the right to protest is not taken away but is done constructively. But to argue that the construct of the Upper House and the Anti-Defection Act need to be amended or done away with lends credence to our founding fathers’ fears of lawmaking in a fit of frenzy.\n\n(Tathagata Satpathy is a member of Parliament and Chief Whip of the Biju Janata Dal in the Lok Sabha. Praveen Chakravarty is Visiting Fellow in Political Economy at IDFC Institute, a Mumbai-based think-tank. Views are entirely personal.)"}, {"url": "https://www.moneycontrol.com/news/trends/current-affairs-trends/tathagata-satpathy-mp-who-spoke-his-heart-on-cannabis-legalisation-decriminalising-section-377-quits-politics-3614371.html", "page_content": "Moneycontrol News\n\nBiju Janata Dal (BJD) Member of Parliament (MP) Tathagata Satpathy announced his retirement from active politics on March 5 to focus on journalism, setting political circles and social media abuzz.\n\nThat the 63-year-old MP from Odisha, who represents Dhenkenal constituency, is a man who speaks his mind in the Lok Sabha, has been displayed on numerous occasions.\n\nFor instance, Satpathy made headlines when, during an Ask Me Anything (AMA) session on Reddit, he vouched for the legalisation of cannabis, going on to even admit that he has smoked it while in college.\n\n\"I have smoked (and unlike Bill Clinton have inhaled) cannabis many a times,\" Satpathy is reported to have replied. The senior BJD leader, who is the party's chief whip in Lok Sabha, reinitiated his demand in the Lower House, wheeling away from the official position of his party.\n\n\"Cannabis is a drug that has been given a bad name, the alcohol lobby, peddling something far more dangerous, has managed to club cannabis with more dangerous narcotics,\" Satpathy had told The Hindu.\n\nBefore a Supreme Court of India (SC) verdict decriminalising homosexuality in September 2018, Satpathy was one of the few MPs who had batted for it. He had said that some socially relevant laws \"need a re-look\" and \"repealing\".\n\n\"I would give an example of something like Section 377, the law relating to a small section of society. But it has a relevance to a particular kind of people who are human beings, who have feelings like us, but their sexual needs are different from a lot of people we know,\" Satpathy had said. He is also against the ban on pornography, reasoning that with changing times, laws should also change in order to change the societal outlook.\n\nThe son of former Odisha Chief Minister Nandini Satpathy, Tathagata entered politics during the 1980s, but tasted his first electoral success as a legislator in 1990. Satpathy had then contested on Janata Dal ticket, led by his current boss, Naveen Patnaik's father Biju Patnaik.\n\nThe MP later jumped to Odisha Gana Parishad (OGP) before switching back to the BJD during the 2004 general elections. He is the owner and Editor of Odiya daily Dharitri and English daily Orissa Post and had spoken in favour of net neutrality and the Jan Lokpal Bill.\n\nSatpathy has continued to remain in news for his comments. During the Jawaharlal Nehru University (JNU) and Hyderabad University row, where leaders from both the spectrum were involved in mud-slinging, Satpathy's speech on the issue was praised by many as balanced.\n\n\"I am heartbroken to say that the youth of the country does not deserve us. We are the most undeserving set of people to be in this House today,\" the BJD leader had said in Lok Sabha, underlining a need to find solutions to the problems and keep the issue out of politics.\n\nThe MP, who is a member of Standing Committee on Coal and Steel, has 92 percent attendance in the lower house, according to PRS Legislative Research data and has participated in debates on Aadhaar Bill, Triple Talaq Bill and a discussion on sustainable development goals.\n\nHe quit politics on the insistence of his 13-year-old son, according to a report by Hindustan Times. He added that the decision had been on his mind for some time."}, {"url": "https://www.thehindu.com/news/national/when-some-mps-choose-to-go-by-their-heart/article7572827.ece", "page_content": "August 24, 2015 03:46 am | Updated April 01, 2016 08:56 pm IST - NEW DELHI\n\nMembers of Parliament bound by the party’s whip and ideological line may not appear to be more than a mass of “ayes” and “noes” when asked to make their presence felt in the House, but there are ways in which at least some MPs are espousing causes close to their heart.\n\nThe Biju Janata Dal’s chief whip in the Lok Sabha, Tathagata Satpathy, shook awake a rather somnolent Lok Sabha in the recent monsoon session by advocating legalisation of cannabis. This startling advocacy was certainly not the official position of his party.\n\n“I feel in these socially conservative times, somebody is needed to bell the cat,” Mr. Satpathy told The Hindu . “Cannabis is a drug that has been given a bad name, the alcohol lobby, peddling something far more dangerous, has managed to club cannabis with more dangerous narcotics,” he said.\n\n“Not only legalisation of cannabis, I’m in favour of decriminalising Section 377 [criminalises gay sex] of the Indian Penal Code, and against the ban on pornography,” Mr. Satpathy said, adding that he was making common cause with young people, and that as representatives of a very young population “we cannot be mundane and outdated”. He said his party has allowed him the freedom to raise issues which he considers important.\n\nChampioning Tamil Another MP with a cause, BJP’s Rajya Sabha member Tarun Vijay fell foul not of his party high command, but “north Indian” colleagues over his >championing of the Tamil language and poet Thiruvalluvar. Mr. Vijay, who is in the process of getting a statue of Thiruvalluvar installed in Haridwar on the banks of the Ganga, said his unlikely championing of this cause had very mundane beginnings.\n\n“It was during the UPSC agitation, when examination papers were being demanded in Hindi that I realised that north Indians had a disproportionate sense of language chauvinism,” said Mr. Vijay, who hails from Uttarakhand. How many of the MPs finding common cause with agitating students sent their own children to Hindi medium schools, read Hindi literature or even newspapers, he asked. “You are not preserving Hindi in your States and you want Tamilians to learn Hindi?” Mr. Vijay asked. Since then he has been quite a champion of the Tamil language, leaving his colleagues wondering as to just what he would gain from this.\n\nTransgenders’ rights Another MP facing the same question is Shobha Karandlaje of the BJP who is a co-sponsor of a private member’s Bill in the Lok Sabha on transgender rights, which has already been cleared in the Rajya Sabha. That Bill, the >first private member’s Bill to be passed in any House of Parliament in 40 years, was steered by >Tiruchi N. Siva of the DMK. “Even as Minister in the Karnataka government I initiated several measures for providing identity papers, ration cards, and pension for transgenders, therefore when this Bill was cleared in the Rajya Sabha, it was important to sponsor it,” she said. One of her co-sponsors is Baijayant “Jay” Panda of the BJD.\n\nParliament provides time each week for members to move Bills which they sponsor privately away from party lines. Most don’t clear any legislative stage and are largely unreported in the media. The 16th Lok Sabha may yet see that changing."}, {"url": "https://www.livemint.com/Politics/cEdbfFmpXQ6GNImduzrRTI/Who-is-Tathagata-Satpathy.html", "page_content": "New Delhi: Amidst the cacophony of aggressive voices from both the government and the opposition during the debate on the Jawaharlal Nehru University row and the death of Hyderabad University student Rohith Vemula, the speech by senior Biju Janata Dal (BJD) leader Tathagata Satpathy came as a breath of fresh air.\n\n“I am heartbroken to say that the youth of the country doesn’t deserve us. We are the most undeserving set of people to be in this House today,\" Satpathy, who represents Dhenkanal Lok Sabha constituency in the Lok Sabha, said.\n\nHe went on to say: “I am not interested in taking sides with any of these parties. I am here to hear who has a word of solace and point of solution to the problems that the nation is facing today. Is it only votes that matter? Is it just us and them?\"\n\nHis speech went viral on social media with people praising him for taking the matter above politics. This is not the first time that Satpathy has stood out among other parliamentarians. On several other occasions in the past, he has articulated his views on women’s reservation, crimes against women, net neutrality, Section 377 and even legalisation of cannabis.\n\nDuring an AMA (ask me anything) session on Reddit last year, Satpathy admitted that he had smoked cannabis. “While in college, I have smoked (and unlike Bill Clinton have inhaled) cannabis many a times. In villages of Orissa, many people openly smoke and, as their representative, I am not entitled to be judgmental.\"\n\nSpeaking to Mint after his speech in Parliament, Satpathy said he speaks his mind, does not fear controversies and believes in change through debate.\n\nThe 59-year-old, also the chief whip of the BJD, is the son of Odisha’s only woman chief minister Nandini Satpathy. He is currently serving his fourth term as a member of the lower house of Parliament. A journalist by profession, Satpathy is the owner and editor of leading Odia daily Dharitri and English daily Orissa Post.\n\n“We have been harping on rights for far too long. Time has changed to expose the wrongs,\" Satpathy said. He added that it is time politicians start talking truthfully and make citizens conscious of their duties and responsibilities. “India is going through a churning. I am an optimist. I see good times ahead.\"\n\nEven during the monsoon session last year, when 25 Congress MPs were suspended, Satpathy spoke up in the lower house and made a strong plea against taking up any legislative business in the absence of MPs from several opposition parties, including Congress.\n\nThough Satpathy does not have a personal Twitter or Facebook account, his office runs a Twitter account on his behalf at @SatpathyLive. “I am more a print media guy. I regret to say that I am not very social media savvy, though I am very social. I love to sit down with my friends and chat,\" he said.\n\nHis attendance record in the current Lok Sabha has been 93% as opposed to an average of 83% for parliamentarians. In the 16th Lok Sabha, he has participated in a total of 34 debates and asked three questions, according to the New Delhi-based PRS Legislative Research.\n\n“Parliament is partisan when it comes to giving more time and importance to leaders from parties. Someone like Satpathy would be heard and much more noticed outside Parliament than inside. His is a sane and rational voice. The point that he made on Tuesday about us and them is very critical. The way we are, our politicians are, there seems to be no middle ground and in that way he was making a very important statement,\" said Manisha Priyam, a New Delhi-based political analyst."}, {"url": "https://www.hindustantimes.com/india/tathagata-satpathy-mp-who-accepted-the-internet-challenge-and-won/story-Mx1ZLZM5Twi3JFwdDXqEZP.html", "page_content": "Lok Sabha member Tathagata Satpathy has gone \"viral\" on the web, not for a foot-in-mouth moment or an absent sense of humour. He won numerous fans by inviting people to \"ask him anything\" on Reddit, the user-generated social media forum, and then took the grilling sportingly. Tathagata-Satpathy-announcing-the-AMA-on-Sunday-Image-via-Imgur\n\nSatpathy participated in a cracker of a Reddit AMA (ask me anything), or a Q&A session, sharing policy insights and talking about smoking cannabis with convincing honesty and a sense of humour over the course of an hour.\n\nThe MP from the Biju Janata Dal (BJD), who represents Dhenkanal constituency of Odisha, was witty from the word go. His very first response earned him brownie points for a reference to Pink Floyd.\n\n\"An MP who gets Floyd references. Why can't you be my MP?\" wrote user Deepit6431.\n\nUser Eepsu asked Satpathy about his party’s take on decriminalising the use of cannabis.\n\nPat came the MP’s reply: \"BJD's election manifesto definitely did not contain anything on cannabis. While in college, I have smoked (and unlike Clinton have inhaled) cannabis many a times. In villages of Orissa, many people openly smoke and, as their representative, I am not entitled to be judgmental.\"\n\nHe added: \"BTW cannabis, luckily, is legal in certain states in India, like Orissa. You can walk up to a government excise shop and buy your day's need.\"\n\n\"Who would have thought a politician impresses Reddit better than a film star (priyanka chopra) or a startup ceo (zomato),\" Reddit user Naive_babes said while praising Satpathy.\n\nIn a smart move, Satpathy disclosed while announcing the Reddit session that his views “should definitely not be attributed to those of my party and leadership. I am answering these questions as a citizen of India. All views expressed here are personal.\"\n\n\n\nSatpathy is the BJD’s chief whip in the Lok Sabha. The four-time MP is a journalist by profession and the editor of two newspapers, Dharitri (Oriya) and Orissa Post (English).\n\nHis mother Nandini Satpathy served as chief minister of Odisha during 1972-76. His father Devendra Satpathy was a politician and represented the same constituency.\n\nSatpathy was helped by members of his policy team, notably user Kumbhakaran. It was clear that the MP had done his homework to ensure an efficiently coordinated chat.\n\nKumbhkaran too answered questions, cracked jokes and took the discussion forward with a : \"Using Reddit India to get policy inputs for Parliament: Learnings from AMA with /u/tathagatasatpathy\".\n\nOther highlights of the session were its informal natural and Satpathy's well-thought out responses.\n\nThough the AMA session is over, Satpathy is here to stay. The politician has said he wants to take suggestions from the Reddit community for discussions in parliament. Kumbhkaran's post requesting policy inputs is a step towards this effort.\n\n\"I believe this could prove to be a game changer for public participation in policy,\" Kumbhkaran wrote on Reddit.\n\nSatpathy followed in the footsteps of Ashwin Mahesh of Karnataka's Lok Satta Party, who was the first politician to hold an AMA in April 2013.\n\nSatpathy is in the company of noted individuals like US President Barack Obama, pop star Madonna and Canadian astronaut Chris Hadfield, who fielded questions from the International Space Station. Obama's AMA is the highest rated yet and brought down many parts of Reddit due to a spike in traffic to the site."}], "Tathagata Satpathy represents the Dhenkanal constituency of Odisha.": [{"url": "https://indianexpress.com/article/india/india-others/tathagata-satpathy-mp-from-odisha-lends-support-for-net-neutrality/", "page_content": "Free-speech campaigners and internet activists received a major shot in the arm as Odisha MP Tathagata Satpathy lent his support for net neutrality by writing a letter to Telecom Regulatory Authority of India (TRAI) chairman Rahul Khullar.\n\nSatpathy, who had captured the internet’s charm about a month ago by participating in a free-wheeling chat on a Reddit AMA (ask-me-anything), is a member of the Biju Janata Dal (BJD) and was elected from the Dhenkanal constituency. Satpathy was then particularly praised for his Pink Floyd references and his open admission to smoking marijuana during his college days — such candid expressions that we have not come to expect from our elected parliamentarians.\n\n[related-post]\n\nSatpathy’s letter to the TRAI chairman assumes significance as it comes in the backdrop of a raging debate, particularly on social media, over the alleged attempts of telecom companies to introduce differential pricing plans for over-the-top services like WhatsApp, Skype and Viber. Campaigners for a free internet have argued that these companies are trying to clamp down on the internet’s transparency and freedom. While India does not have an existing legislation for net neutrality, TRAI has come up with a consultation paper that seeks views of the public on the matter. The debate, which has whipped up enormous intensity in the last few weeks, is supported by online petitions like this one on change.org which has already garnered more than 1,00,000 signatures.\n\nIn his letter, Satpathy argues that he uses the internet in different ways, by using messaging apps to keep contact with his staff, using cloud services to prepare documents and video calling to keep in touch with his constituents.\n\n“Internet forms an integral part of how I do my work, therefore I see this move by TRAI as a threat to my functioning as a representative,” the BJD MP writes in his letter.\n\nHe also argues in his letter that charging separately for over-the-top services will be seen as restricting the access to internet. Depicting TRAI’s move as going against Prime Minister Narendra Modi’s dream of a digital India, Satpathy writes that the step will be against the “desires of those who wish to make India a modern nation.”\n\nThe letter talks about how the net neutrality principle is not an ‘elitist’ problem as it also affects people with affordable smartphones.\n\nAdvertisement\n\n“We are a growing country and we should have proper laws in place, not to regulate, but to encourage the use of internet,” he writes.\n\nRead Satpathy’s full letter below."}, {"url": "https://odishatv.in/news/odisha/former-mp-tathagata-satpathy-attends-inauguration-ceremony-of-new-bjd-office-202462", "page_content": "Former MP Tathagata Satpathy attended the inauguration ceremony of the new office of ruling party BJD, aptly named Sankha Bhavan, in Bhubaneswar on Sunday.\n\nHowever, Satpathy refuted any chances of coming back to electoral politics.\n\n“I have been invited to the inauguration ceremony by BJD President. I respect him a lot. I accepted his invitation and came to attend the ceremony out of respect. I am so happy to be invited to the ceremony,” said Satpathy.\n\n“I have no party and I am not interested to have entry into electoral politics again. I am so happy now,” he added.\n\nGiving his opinion about the new building of BJD, the former MP said, “The building is very beautiful. It was essential for the party. The initiative is welcome by one and all.”\n\nHowever, Satpathy remained tight-lipped about the upcoming General Election and recent politics in Dhenkanal and Angul.\n\nNotably, the four-time BJD MP had announced his retirement from politics in 2019 to refocus on journalism. Satpathy edits two dailies, one in Odia and the other in English.\n\n"}, {"url": "https://www.ndtv.com/india-news/bjds-tathagata-satpathy-quits-active-politics-2003202", "page_content": "Mr Satpathy was the owner and editor of the Odia daily newspaper Dharitri and English daily Orissa Post.\n\nSenior Biju Janata Dal (BJD) MP Tathagata Satpathy on Tuesday said he will not contest in the coming Lok Sabha elections.\n\n\"I am not going to stay in any political party. I am returning to my old profession of journalism,\" said Mr Satpathy.\n\n\"Since Biju Patnaik had brought me to politics, I announce not to contest elections on his birth anniversary today,\" he added.\n\nMr Satpathy had sought time to meet Odisha Chief Minister and BJD president Naveen Patnaik to apprise him about his decision.\n\nMr Satpathy, who represents the Dhenkanal Lok Sabha constituency, was re-elected for the fourth time in 2014. He is the son of former Odisha Chief Minister Nandini Satpathy.\n\nHe also the owner and editor of the Odia daily newspaper Dharitri and English daily Orissa Post."}, {"url": "https://www.myneta.info/ls2014/candidate.php?candidate_id=3263", "page_content": "Loksabha 2014 TATHAGATA SATPATHY (Winner) DHENKANAL (ORISSA) Party:BJD S/o|D/o|W/o: Late Devendra Satpathy Age: 57 Name Enrolled as Voter in: 55 Dhenkanal (Orissa) constituency , at Serial no 703 in Part no 161 Self Profession:Jornalism\n\nSpouse Profession:CEO Navajat Printers and Media (P) Ltd.\n\nOther Elections Declaration in Declared Assets Declared Cases Lok Sabha 2009 Rs55,15,930\n\n~55 Lacs+ 13 Lok Sabha 2004 Rs27,75,930\n\n~27 Lacs+ 5 Click here for more details Crime-O-Meter\n\nNumber of Criminal Cases: 7 Number of Criminal Cases: Assets & Liabilities Assets:Rs 3,54,34,099 ~3 Crore+ Liabilities:Nil Educational Details Others Completed Education at SRI Arobindo International Centre of Education (No Certificate Ever issued at this institute)\n\nDetails of PAN and status of Income Tax return\n\nRelation Type PAN Given Financial Year Total Income Shown in ITR self Y 2012 - 2013 Rs 68,67,874 ~ 68 Lacs+ spouse Y 2012 - 2013 Rs 60,87,303 ~ 60 Lacs+ dependent1 N None Rs 0 ~ dependent2 N None Rs 0 ~ dependent3 N None Rs 0 ~\n\nDetails of Criminal Cases\n\nCases where Charges Framed Serial No. IPC Sections Applicable Other Details / Other Acts / Sections Applicable 1 499, 500, 501, 502 ICC 31/10, Cognizance and Frame Court JMFC (R) Cuttack, Charges frame Year 2010 2 499, 500, 501, 502 ICC 2710/08, Cognizance and Frame Court JMFC BBSR, Charges frame Year 2008 3 499, 500, 501, 502 ICC 27/98, Cognizance and Frame Court JMFC Cuttack, Charges frame Year 1998 4 499, 500, 501, 502 ICC 18/06 Cognizance and Frame Court SDJM Kantabanjhi, Charges frame Year 2006 Cases where Cognizance Taken Serial No. IPC Sections Applicable Other Details / Other Acts / Sections Applicable 1 499, 500, 501, 502 ICC 3208/08,Cognizance and Frame Court SDJM Khurda, 2 499, 500, 501, 502 ICC 3809/08, Cognizance and Frame Court SDJM, Balasore 3 499, 500, 501, 502 ICC 325/08 Cognizance and Frame Court SDJM Khurda, Cases where Convicted Serial No. IPC Sections Applicable Other Details / Other Acts / Sections Applicable ---------No Cases-------- Brief Details of IPCs 7 charges related to Punishment for Defamation (IPC Section-500) 7 charges related to Printing or engraving matter known to be defamatory (IPC Section-501) 7 charges related to Sale of printed or engraved substance containing defamatory matter (IPC Section-502) 7 charges related to Defamation (IPC Section-499)\n\nNo Problems in Reading Affidavit Information\n\nDisclaimer: This information is an archive of the candidate's self-declared affidavit that was filed during the elections. The current status of this information may be different. For the latest available information, please refer to the affidavit filed by the candidate to the Election Commission in the most recent election.\n\nSr No Description self spouse dependent1 dependent2 dependent3 i Cash 50,000 50 Thou+\n\n\n\n20,000 20 Thou+\n\n\n\nNil Nil Nil Rs 70,000\n\n70 Thou+ ii Deposits in Banks, Financial Institutions and Non-Banking Financial Companies SBI Parliament House A/C No. 10023815866\n\n35,72,632.10 35 Lacs+\n\n\n\nAXIS Bank BBSR A/C No. 024010100000043\n\n80,38,815.82 80 Lacs+\n\n\n\nAXIS Bank Bhubaneswar A/C No.024010100000051\n\n40,56,630.79 40 Lacs+\n\n\n\nNil Nil Nil Rs 1,56,68,078.71\n\n1 Crore+ iii Bonds, Debentures and Shares in companies 400 equity\n\n40,000 40 Thou+\n\n\n\n300 Equity\n\n30,000 30 Thou+\n\n\n\nNil Nil Nil Rs 70,000\n\n70 Thou+ iv (a)\n\nNSS, Postal Savings etc Nil Nil Nil Nil Nil Nil\n\n(b)\n\nLIC or other insurance Policies Nil Nil Nil Nil Nil Nil\n\nv Personal loans/advance given Nil Nil Nil Nil Nil Nil\n\nvi Motor Vehicles (details of make, etc.) Nil Maruti ECCO OD02p1046 2014\n\n3,86,020 3 Lacs+\n\n\n\nMaruti Omni\n\n2,40,000 2 Lacs+\n\n\n\nNil Nil Nil Rs 6,26,020\n\n6 Lacs+ vii Jewellery (give details weight value) Nil 500 gms Jewellery\n\n15,00,000 15 Lacs+\n\n\n\nNil Nil Nil Rs 15,00,000\n\n15 Lacs+ viii Other assets, such as values of claims / interests Nil Nil Nil Nil Nil Nil\n\nGross Total Value (as per Affidavit) 1,17,01,448.92 1 Crore+ 62,32,650 62 Lacs+ Nil Nil Nil Rs 1,79,34,098.92\n\n1 Crore+ Totals (Calculated as Sum of Values) Rs 1,17,01,447.92\n\n1 Crore+ Rs 62,32,650.79\n\n62 Lacs+ Nil\n\nNil\n\nNil\n\nRs 1,79,34,098.71\n\n1 Crore+\n\nNo Problems in Reading Affidavit Information Details of Movable Assets Sr No Description self spouse dependent1 dependent2 dependent3 i Cash 50,000 50 Thou+\n\n\n\n20,000 20 Thou+\n\n\n\nNil Nil Nil Rs 70,000\n\n70 Thou+ ii Deposits in Banks, Financial Institutions and Non-Banking Financial Companies SBI Parliament House A/C No. 10023815866\n\n35,72,632.10 35 Lacs+\n\n\n\nAXIS Bank BBSR A/C No. 024010100000043\n\n80,38,815.82 80 Lacs+\n\n\n\nAXIS Bank Bhubaneswar A/C No.024010100000051\n\n40,56,630.79 40 Lacs+\n\n\n\nNil Nil Nil Rs 1,56,68,078.71\n\n1 Crore+ iii Bonds, Debentures and Shares in companies 400 equity\n\n40,000 40 Thou+\n\n\n\n300 Equity\n\n30,000 30 Thou+\n\n\n\nNil Nil Nil Rs 70,000\n\n70 Thou+ iv (a)\n\nNSS, Postal Savings etc Nil Nil Nil Nil Nil Nil\n\n(b)\n\nLIC or other insurance Policies Nil Nil Nil Nil Nil Nil\n\nv Personal loans/advance given Nil Nil Nil Nil Nil Nil\n\nvi Motor Vehicles (details of make, etc.) Nil Maruti ECCO OD02p1046 2014\n\n3,86,020 3 Lacs+\n\n\n\nMaruti Omni\n\n2,40,000 2 Lacs+\n\n\n\nNil Nil Nil Rs 6,26,020\n\n6 Lacs+ vii Jewellery (give details weight value) Nil 500 gms Jewellery\n\n15,00,000 15 Lacs+\n\n\n\nNil Nil Nil Rs 15,00,000\n\n15 Lacs+ viii Other assets, such as values of claims / interests Nil Nil Nil Nil Nil Nil\n\nGross Total Value (as per Affidavit) 1,17,01,448.92 1 Crore+ 62,32,650 62 Lacs+ Nil Nil Nil Rs 1,79,34,098.92\n\n1 Crore+ Totals (Calculated as Sum of Values) Rs 1,17,01,447.92\n\n1 Crore+ Rs 62,32,650.79\n\n62 Lacs+ Nil\n\nNil\n\nNil\n\nRs 1,79,34,098.71\n\n1 Crore+ Disclaimer: This information is an archive of the candidate's self-declared affidavit that was filed during the elections. The current status of this information may be different. For the latest available information, please refer to the affidavit filed by the candidate to the Election Commission in the most recent election. Data Readability Report of Movable Assets :No Problems in Reading Affidavit Information No Problems in Reading Affidavit Information Details of Immovable Assets Sr No Description self spouse dependent1 dependent2 dependent3 i Agricultural Land Nil Nil Nil Nil Nil Nil\n\nii Non Agricultural Land Part of 107-Surya Nagar\n\nTotal Area 1/2 acre\n\nBuilt Up Area\n\nWhether Inherited Y\n\nPurchase Date 2013-12-23\n\nPurchase Cost 0.00\n\nDevelopment Cost 0.00\n\n50,00,000 50 Lacs+\n\n\n\n1.Kunjakanta, Dhenkanal Town 2.BBSR\n\nTotal Area 1.A0.080d 2.A0.180d,A0.810d, A0.360d, A0.870d\n\nBuilt Up Area\n\nWhether Inherited N\n\nPurchase Date 2013-01-30\n\nPurchase Cost 7755000.00\n\nDevelopment Cost 0.00\n\n80,00,000 80 Lacs+\n\n\n\nNil Nil Nil Rs 1,30,00,000\n\n1 Crore+ iii Commercial Buildings Nil MIG Flat Kesuura SBI Colony\n\nTotal Area 500 sqft\n\nBuilt Up Area\n\nWhether Inherited N\n\nPurchase Date 0000-00-00\n\nPurchase Cost 1200000.00\n\nDevelopment Cost 0.00\n\n15,00,000 15 Lacs+\n\n\n\nNil Nil Nil Rs 15,00,000\n\n15 Lacs+ iv Residential Buildings Nil B/60 Gulmohor Park, New Delhi\n\nTotal Area 1200 sq. ft.\n\nBuilt Up Area 1200 sq.ft.\n\nWhether Inherited N\n\nPurchase Date 0000-00-00\n\nPurchase Cost 2200000.00\n\nDevelopment Cost 0.00\n\n30,00,000 30 Lacs+\n\n\n\nNil Nil Nil Rs 30,00,000\n\n30 Lacs+ v Others Nil Nil Nil Nil Nil Nil\n\nTotal Current Market Value of (i) to (v) (as per Affidavit) 50,00,000 50 Lacs+ 1,25,00,000 1 Crore+ Nil Nil Nil Rs 1,75,00,000\n\n1 Crore+ Totals Calculated Rs 50,00,000\n\n50 Lacs+ Rs 1,25,00,000\n\n1 Crore+ Nil\n\nNil\n\nNil\n\nRs 1,75,00,000\n\n1 Crore+ Disclaimer: This information is an archive of the candidate's self-declared affidavit that was filed during the elections. The current status of this information may be different. For the latest available information, please refer to the affidavit filed by the candidate to the Election Commission in the most recent election. Data Readability Report of Immovable Assets :No Problems in Reading Affidavit Information No Problems in Reading Affidavit Information Details of Liabilities Sr No Description self spouse dependent1 dependent2 dependent3 i Loans from Banks / FIs Nil Nil Nil Nil Nil Nil\n\nLoans due to Individual / Entity Nil Nil Nil Nil Nil Nil\n\nAny other Liability Nil Nil Nil Nil Nil Nil\n\nGrand Total of Liabilities (as per affidavit) Nil Nil Nil Nil Nil Nil\n\nii Dues to departments dealing with government accommodation Nil Nil Nil Nil Nil Nil\n\nDues to departments dealing with supply of water Nil Nil Nil Nil Nil Nil\n\nDues to departments dealing with supply of electricity Nil Nil Nil Nil Nil Nil\n\nDues to departments dealing with telephones Nil Nil Nil Nil Nil Nil\n\nDues to departments dealing with supply of transport Nil Nil Nil Nil Nil Nil\n\nIncome Tax Dues Nil Nil Nil Nil Nil Nil\n\nWealth Tax Dues Nil Nil Nil Nil Nil Nil\n\nService Tax Dues Nil Nil Nil Nil Nil Nil\n\nProperty Tax Dues Nil Nil Nil Nil Nil Nil\n\nSales Tax Dues Nil Nil Nil Nil Nil Nil\n\nAny Other Dues Nil Nil Nil Nil Nil Nil\n\niii Grand Total of all Govt Dues (as per affidavit) Nil Nil Nil Nil Nil Nil\n\niv Whether any other liabilities are in dispute, if so, mention the amount involved and the authority before which it is pending Nil Nil Nil Nil Nil Nil\n\nTotals (Calculated as Sum of Values) Nil\n\nNil\n\nNil\n\nNil\n\nNil\n\nNil\n\nDisclaimer: This information is an archive of the candidate's self-declared affidavit that was filed during the elections. The current status of this information may be different. For the latest available information, please refer to the affidavit filed by the candidate to the Election Commission in the most recent election. Data Readability Report of Liabilities :No Problems in Reading Affidavit Information No Problems in Reading Affidavit Information If you notice any discrepancy between affidavits and our data, you can use the message box below to send a message to us. ( यदि आप हलफनामों और इस पेज पर दी गयी जानकारी के बीच कोई विसंगति/भिन्नता पाते है तो आप नीचे के संदेश बॉक्स के उपयोग से हमें संदेश भेज सकते हैं) Name :\n\n\n\nEmail :\n\n\n\nPhone No :\n\n\n\nEnter your discrepancy :\n\n\n\nPlease enter the code shown below and click Submit.\n\n\n\nDisclaimer: The primary source for the data used for these reports is the sworn affidavits provided by the candidates themselves. Sheer volume of data that has to be read from the affidavits that are often poorly scanned and the lightening speed at which these reports have to be brought out makes it quite difficult to ensure accuracy of every bit of data. In case of any discrepancy in our reports vis a vis the original affidavit of any candidate, the original affidavit should be considered accurate. If you notice any discrepancies between affidavit and our report kindly let us know and we will fix them on our end as soon as possible.\n\n\n\n\n\n\n\n\n\n\n\nDisclaimer: This information is an archive of the candidate's self-declared affidavit that was filed during the elections. The current status of this information may be different. For the latest available information, please refer to the affidavit filed by the candidate to the Election Commission in the most recent election.\n\nSr No Description self spouse dependent1 dependent2 dependent3 i Agricultural Land Nil Nil Nil Nil Nil Nil\n\nii Non Agricultural Land Part of 107-Surya Nagar\n\nTotal Area 1/2 acre\n\nBuilt Up Area\n\nWhether Inherited Y\n\nPurchase Date 2013-12-23\n\nPurchase Cost 0.00\n\nDevelopment Cost 0.00\n\n50,00,000 50 Lacs+\n\n\n\n1.Kunjakanta, Dhenkanal Town 2.BBSR\n\nTotal Area 1.A0.080d 2.A0.180d,A0.810d, A0.360d, A0.870d\n\nBuilt Up Area\n\nWhether Inherited N\n\nPurchase Date 2013-01-30\n\nPurchase Cost 7755000.00\n\nDevelopment Cost 0.00\n\n80,00,000 80 Lacs+\n\n\n\nNil Nil Nil Rs 1,30,00,000\n\n1 Crore+ iii Commercial Buildings Nil MIG Flat Kesuura SBI Colony\n\nTotal Area 500 sqft\n\nBuilt Up Area\n\nWhether Inherited N\n\nPurchase Date 0000-00-00\n\nPurchase Cost 1200000.00\n\nDevelopment Cost 0.00\n\n15,00,000 15 Lacs+\n\n\n\nNil Nil Nil Rs 15,00,000\n\n15 Lacs+ iv Residential Buildings Nil B/60 Gulmohor Park, New Delhi\n\nTotal Area 1200 sq. ft.\n\nBuilt Up Area 1200 sq.ft.\n\nWhether Inherited N\n\nPurchase Date 0000-00-00\n\nPurchase Cost 2200000.00\n\nDevelopment Cost 0.00\n\n30,00,000 30 Lacs+\n\n\n\nNil Nil Nil Rs 30,00,000\n\n30 Lacs+ v Others Nil Nil Nil Nil Nil Nil\n\nTotal Current Market Value of (i) to (v) (as per Affidavit) 50,00,000 50 Lacs+ 1,25,00,000 1 Crore+ Nil Nil Nil Rs 1,75,00,000\n\n1 Crore+ Totals Calculated Rs 50,00,000\n\n50 Lacs+ Rs 1,25,00,000\n\n1 Crore+ Nil\n\nNil\n\nNil\n\nRs 1,75,00,000\n\n1 Crore+\n\nNo Problems in Reading Affidavit Information Details of Immovable Assets Sr No Description self spouse dependent1 dependent2 dependent3 i Agricultural Land Nil Nil Nil Nil Nil Nil\n\nii Non Agricultural Land Part of 107-Surya Nagar\n\nTotal Area 1/2 acre\n\nBuilt Up Area\n\nWhether Inherited Y\n\nPurchase Date 2013-12-23\n\nPurchase Cost 0.00\n\nDevelopment Cost 0.00\n\n50,00,000 50 Lacs+\n\n\n\n1.Kunjakanta, Dhenkanal Town 2.BBSR\n\nTotal Area 1.A0.080d 2.A0.180d,A0.810d, A0.360d, A0.870d\n\nBuilt Up Area\n\nWhether Inherited N\n\nPurchase Date 2013-01-30\n\nPurchase Cost 7755000.00\n\nDevelopment Cost 0.00\n\n80,00,000 80 Lacs+\n\n\n\nNil Nil Nil Rs 1,30,00,000\n\n1 Crore+ iii Commercial Buildings Nil MIG Flat Kesuura SBI Colony\n\nTotal Area 500 sqft\n\nBuilt Up Area\n\nWhether Inherited N\n\nPurchase Date 0000-00-00\n\nPurchase Cost 1200000.00\n\nDevelopment Cost 0.00\n\n15,00,000 15 Lacs+\n\n\n\nNil Nil Nil Rs 15,00,000\n\n15 Lacs+ iv Residential Buildings Nil B/60 Gulmohor Park, New Delhi\n\nTotal Area 1200 sq. ft.\n\nBuilt Up Area 1200 sq.ft.\n\nWhether Inherited N\n\nPurchase Date 0000-00-00\n\nPurchase Cost 2200000.00\n\nDevelopment Cost 0.00\n\n30,00,000 30 Lacs+\n\n\n\nNil Nil Nil Rs 30,00,000\n\n30 Lacs+ v Others Nil Nil Nil Nil Nil Nil\n\nTotal Current Market Value of (i) to (v) (as per Affidavit) 50,00,000 50 Lacs+ 1,25,00,000 1 Crore+ Nil Nil Nil Rs 1,75,00,000\n\n1 Crore+ Totals Calculated Rs 50,00,000\n\n50 Lacs+ Rs 1,25,00,000\n\n1 Crore+ Nil\n\nNil\n\nNil\n\nRs 1,75,00,000\n\n1 Crore+ Disclaimer: This information is an archive of the candidate's self-declared affidavit that was filed during the elections. The current status of this information may be different. For the latest available information, please refer to the affidavit filed by the candidate to the Election Commission in the most recent election. Data Readability Report of Immovable Assets :No Problems in Reading Affidavit Information No Problems in Reading Affidavit Information Details of Liabilities Sr No Description self spouse dependent1 dependent2 dependent3 i Loans from Banks / FIs Nil Nil Nil Nil Nil Nil\n\nLoans due to Individual / Entity Nil Nil Nil Nil Nil Nil\n\nAny other Liability Nil Nil Nil Nil Nil Nil\n\nGrand Total of Liabilities (as per affidavit) Nil Nil Nil Nil Nil Nil\n\nii Dues to departments dealing with government accommodation Nil Nil Nil Nil Nil Nil\n\nDues to departments dealing with supply of water Nil Nil Nil Nil Nil Nil\n\nDues to departments dealing with supply of electricity Nil Nil Nil Nil Nil Nil\n\nDues to departments dealing with telephones Nil Nil Nil Nil Nil Nil\n\nDues to departments dealing with supply of transport Nil Nil Nil Nil Nil Nil\n\nIncome Tax Dues Nil Nil Nil Nil Nil Nil\n\nWealth Tax Dues Nil Nil Nil Nil Nil Nil\n\nService Tax Dues Nil Nil Nil Nil Nil Nil\n\nProperty Tax Dues Nil Nil Nil Nil Nil Nil\n\nSales Tax Dues Nil Nil Nil Nil Nil Nil\n\nAny Other Dues Nil Nil Nil Nil Nil Nil\n\niii Grand Total of all Govt Dues (as per affidavit) Nil Nil Nil Nil Nil Nil\n\niv Whether any other liabilities are in dispute, if so, mention the amount involved and the authority before which it is pending Nil Nil Nil Nil Nil Nil\n\nTotals (Calculated as Sum of Values) Nil\n\nNil\n\nNil\n\nNil\n\nNil\n\nNil\n\nDisclaimer: This information is an archive of the candidate's self-declared affidavit that was filed during the elections. The current status of this information may be different. For the latest available information, please refer to the affidavit filed by the candidate to the Election Commission in the most recent election. Data Readability Report of Liabilities :No Problems in Reading Affidavit Information No Problems in Reading Affidavit Information If you notice any discrepancy between affidavits and our data, you can use the message box below to send a message to us. ( यदि आप हलफनामों और इस पेज पर दी गयी जानकारी के बीच कोई विसंगति/भिन्नता पाते है तो आप नीचे के संदेश बॉक्स के उपयोग से हमें संदेश भेज सकते हैं) Name :\n\n\n\nEmail :\n\n\n\nPhone No :\n\n\n\nEnter your discrepancy :\n\n\n\nPlease enter the code shown below and click Submit.\n\n\n\nDisclaimer: The primary source for the data used for these reports is the sworn affidavits provided by the candidates themselves. Sheer volume of data that has to be read from the affidavits that are often poorly scanned and the lightening speed at which these reports have to be brought out makes it quite difficult to ensure accuracy of every bit of data. In case of any discrepancy in our reports vis a vis the original affidavit of any candidate, the original affidavit should be considered accurate. If you notice any discrepancies between affidavit and our report kindly let us know and we will fix them on our end as soon as possible.\n\n\n\n\n\n\n\n\n\n\n\nDisclaimer: This information is an archive of the candidate's self-declared affidavit that was filed during the elections. The current status of this information may be different. For the latest available information, please refer to the affidavit filed by the candidate to the Election Commission in the most recent election.\n\nSr No Description self spouse dependent1 dependent2 dependent3 i Loans from Banks / FIs Nil Nil Nil Nil Nil Nil\n\nLoans due to Individual / Entity Nil Nil Nil Nil Nil Nil\n\nAny other Liability Nil Nil Nil Nil Nil Nil\n\nGrand Total of Liabilities (as per affidavit) Nil Nil Nil Nil Nil Nil\n\nii Dues to departments dealing with government accommodation Nil Nil Nil Nil Nil Nil\n\nDues to departments dealing with supply of water Nil Nil Nil Nil Nil Nil\n\nDues to departments dealing with supply of electricity Nil Nil Nil Nil Nil Nil\n\nDues to departments dealing with telephones Nil Nil Nil Nil Nil Nil\n\nDues to departments dealing with supply of transport Nil Nil Nil Nil Nil Nil\n\nIncome Tax Dues Nil Nil Nil Nil Nil Nil\n\nWealth Tax Dues Nil Nil Nil Nil Nil Nil\n\nService Tax Dues Nil Nil Nil Nil Nil Nil\n\nProperty Tax Dues Nil Nil Nil Nil Nil Nil\n\nSales Tax Dues Nil Nil Nil Nil Nil Nil\n\nAny Other Dues Nil Nil Nil Nil Nil Nil\n\niii Grand Total of all Govt Dues (as per affidavit) Nil Nil Nil Nil Nil Nil\n\niv Whether any other liabilities are in dispute, if so, mention the amount involved and the authority before which it is pending Nil Nil Nil Nil Nil Nil\n\nTotals (Calculated as Sum of Values) Nil\n\nNil\n\nNil\n\nNil\n\nNil\n\nNil\n\n\n\nNo Problems in Reading Affidavit Information Details of Liabilities Sr No Description self spouse dependent1 dependent2 dependent3 i Loans from Banks / FIs Nil Nil Nil Nil Nil Nil\n\nLoans due to Individual / Entity Nil Nil Nil Nil Nil Nil\n\nAny other Liability Nil Nil Nil Nil Nil Nil\n\nGrand Total of Liabilities (as per affidavit) Nil Nil Nil Nil Nil Nil\n\nii Dues to departments dealing with government accommodation Nil Nil Nil Nil Nil Nil\n\nDues to departments dealing with supply of water Nil Nil Nil Nil Nil Nil\n\nDues to departments dealing with supply of electricity Nil Nil Nil Nil Nil Nil\n\nDues to departments dealing with telephones Nil Nil Nil Nil Nil Nil\n\nDues to departments dealing with supply of transport Nil Nil Nil Nil Nil Nil\n\nIncome Tax Dues Nil Nil Nil Nil Nil Nil\n\nWealth Tax Dues Nil Nil Nil Nil Nil Nil\n\nService Tax Dues Nil Nil Nil Nil Nil Nil\n\nProperty Tax Dues Nil Nil Nil Nil Nil Nil\n\nSales Tax Dues Nil Nil Nil Nil Nil Nil\n\nAny Other Dues Nil Nil Nil Nil Nil Nil\n\niii Grand Total of all Govt Dues (as per affidavit) Nil Nil Nil Nil Nil Nil\n\niv Whether any other liabilities are in dispute, if so, mention the amount involved and the authority before which it is pending Nil Nil Nil Nil Nil Nil\n\nTotals (Calculated as Sum of Values) Nil\n\nNil\n\nNil\n\nNil\n\nNil\n\nNil\n\nDisclaimer: This information is an archive of the candidate's self-declared affidavit that was filed during the elections. The current status of this information may be different. For the latest available information, please refer to the affidavit filed by the candidate to the Election Commission in the most recent election. Data Readability Report of Liabilities :No Problems in Reading Affidavit Information No Problems in Reading Affidavit Information If you notice any discrepancy between affidavits and our data, you can use the message box below to send a message to us. ( यदि आप हलफनामों और इस पेज पर दी गयी जानकारी के बीच कोई विसंगति/भिन्नता पाते है तो आप नीचे के संदेश बॉक्स के उपयोग से हमें संदेश भेज सकते हैं) Name :\n\n\n\nEmail :\n\n\n\nPhone No :\n\n\n\nEnter your discrepancy :\n\n\n\nPlease enter the code shown below and click Submit.\n\n\n\nDisclaimer: The primary source for the data used for these reports is the sworn affidavits provided by the candidates themselves. Sheer volume of data that has to be read from the affidavits that are often poorly scanned and the lightening speed at which these reports have to be brought out makes it quite difficult to ensure accuracy of every bit of data. In case of any discrepancy in our reports vis a vis the original affidavit of any candidate, the original affidavit should be considered accurate. If you notice any discrepancies between affidavit and our report kindly let us know and we will fix them on our end as soon as possible.\n\n\n\n\n\n\n\n\n\n\n\nDisclaimer: This information is an archive of the candidate's self-declared affidavit that was filed during the elections. The current status of this information may be different. For the latest available information, please refer to the affidavit filed by the candidate to the Election Commission in the most recent election.\n\nIf you notice any discrepancy between affidavits and our data, you can use the message box below to send a message to us. ( यदि आप हलफनामों और इस पेज पर दी गयी जानकारी के बीच कोई विसंगति/भिन्नता पाते है तो आप नीचे के संदेश बॉक्स के उपयोग से हमें संदेश भेज सकते हैं) Name :\n\n\n\nEmail :\n\n\n\nPhone No :\n\n\n\nEnter your discrepancy :\n\n\n\nPlease enter the code shown below and click Submit.\n\n\n\n\n\nNo Problems in Reading Affidavit Information"}, {"url": "https://www.examveda.com/tathagata-satapathy-represents-which-constituency-of-odisha-145720/", "page_content": "Apart from Odisha, Odia is spoken in parts of\n\nA. West Bengal\n\nB. Jharkhand\n\nC. Chhattisgarh\n\nD. All of these"}, {"url": "https://www.financialexpress.com/india-news/tathagata-satpathy-nandini-satpathy-odisha-dhenkanal-mp-bjp-naveen-patnaik/1506568/", "page_content": "Tathagata Satpathy, four-time Biju Janata Dal Member of Parliament from Odisha, on Tuesday announced retirement from active politics. The announcement comes a day after his former party colleague in Lok Sabha Baijayant Jay Panda joined the Bharatiya Janata Party. Son of former Odisha Chief Minister Nandini Satpathy, Tathagata is a Lok Sabha MP from Dhenkanal constituency of the state.\n\nThe reason behind hanging his boots, he said, was his desire to return to journalism, adding that there is a need for more fearless voices in journalism now. Satpathy, who is the owner and editor of leading Odia-language newspaper Dharitri, made it clear that he would not join any other political party as he had great respect for party chief Naveen Patnaik.\n\nSatpathy edits two dailies, one in Odia and the other in English – ‘Orissa Post’.\n\nThe veteran leader said that he has realised politics is not the only means to support people and noted that social leadership is lacking in this country. Satpathy said that he is going to refocus on journalism by distancing from politics.\n\n“There is a need for more fearless voices in journalism now. Distancing myself from politics to refocus on journalism. Grateful to my leader Shri Naveen Patnaik for his support all these years. Realised that politics is not the only means to support people,” Satpathy tweeted.\n\nThere is a need for more fearless voices in journalism now. Distancing myself from politics to refocus on journalism. Grateful to my leader Shri Naveen Patnaik for his support all these years. Realised that politics is not the only means to support people.1/1 — Office of T Satpathy (@SatpathyLive) March 5, 2019\n\nThe 62-year-old editor-turned-politician said: “I am taking this decision as per the wish of my 13-year-old son. I am not the person on whom any pressure can work.”\n\n“My son wants me to stay at home, focus on journalism and not to contest the election,” PTI quoted Satpathy as saying.\n\nWhile Panda had resigned from the Biju Janata Dal (BJD) as well as the Lok Sabha due to differences with chief minister Naveen Patnaik, Satpathy’s decision has surprised all.\n\nStating that he respects Patnaik and the people of Dhenkanal and Angul for their love and affection, Satpathy said there was no specific political reason behind his decision."}, {"url": "https://www.elections.in/orissa/parliamentary-constituencies/dhenkanal.html", "page_content": "Dhenkanal Parliamentary Constituency Election and Results Update\n\n\n\n\n\n\n\nDhenkanal Lok Sabha Election Results 2019\n\nCandidate Party EVM Votes Migrant Votes Postal Votes Total Votes % of Votes Status Mahesh Sahoo Biju Janata Dal 521954 0 930 522884 46.21 Winner Rudra Narayan Pany Bharatiya Janata Party 483978 0 3494 487472 43.08 1st Runner-up Raja Kamakhya Prasad Singh Deo Indian National Congress 79987 0 362 80349 7.1 2nd Runner-up NOTA None Of The Above 11242 0 12 11254 0.99 3rd Runner-up Pradyumna Kumar Naik Bahujan Samaj Party 7741 0 48 7789 0.69 4th Runner-up Priyabrata Garnaik Hindusthan Nirman Dal 6940 0 6 6946 0.61 5th Runner-up Bijaya Kumar Behera Ambedkarite Party Of India 4736 0 6 4742 0.42 6th Runner-up Saroj Kumar Satpathy Samata Kranti Dal 3874 0 3 3877 0.34 7th Runner-up Manasi Swain Socialist Unity Centre Of India (Communist) 3285 0 10 3295 0.29 8th Runner-up Ranjan Kumar Sahoo Bhartiya Manavadhikaar Federal Party 2913 0 1 2914 0.26 9th Runner-up\n\nList of winner/current and runner up MPs Dhenkanal Parliamentary Constituency.\n\nYear PC No. PC Name Category winner/current MP Gender Party Vote Runner Up MP Gender Party Vote 2014 9 Dhenkanal GEN Tathagata Satpathy M BJD 453277 Rudra Narayan Pany M BJP 315937 2009 9 Dhenkanal GEN Satpathy,Shri Tathagata M BJD 398568 Chandra Sekhar Tripathi M INC 211981 2004 19 Dhenkanal GEN Tathagata Satapathy M BJD 423539 Kamakhya Prasad Singhdeo M INC 300657 1999 19 Dhenkanal GEN Kamakhya Prasad Singh Deo M INC 248824 Tathagata Satpathy M BJD 245150 1998 19 Dhenkanal GEN Tathagata Satapathy M BJD 299156 Kamakshya Prasad Singhdeo M INC 266645 1996 19 Dhenkanal GEN Kamakhya Prasad Singh Deo M INC 269966 Adwait Prasad Singh M JD 183872 1991 19 Dhenkanal GEN Raja Kamakhya Prasad Singhdeo Mahindr Bahadur M INC 270123 Tathagata Satpathy M JD 228437 1989 19 Dhenkanal GEN Bhajaman Behra M JD 336435 Raja Ramakhya Prasad Singhdeo M INC 213430 1984 19 Dhenkanal GEN Raja Kamakhya Prasad Singh Deo Mahindra Bahadur M INC 295754 Adwait Prasad Singh M JNP 92181 1980 19 Dhenkanal GEN Raja Kamakhya Prasad Singh Deo Mahindra Bahadur M INC(I) 182036 Sushil Kumar Patnaik M JNP(S) 51004 1977 19 Dhenkanal GEN Debendra Satpathy M BLD 143008 Raja Kamakhya Prasad Singh Deo Mahindra Bahadur M INC 98348 1971 19 Dhenkanal GEN Devendra Satpathy M INC 97491 R. K. P. S. Mahindra Bahadur M SWA 65832 1967 19 Dhenkanal GEN R.K.P.S.D.M. Bahadur M SWA 144806 M.M. Pradhan M INC 56761 1962 11 Dhenkanal GEN Baishnab Charan Patnaik M INC 90250 Raja Sankar Pratap Singh Deb Mahindra Bahadur M GP 37962 1957 11 Dhenkanal GEN Surendra Mohanty M GP 92142 Braja Kishore Dhal M INC 75546\n\nList of Assembly Constituencies in Dhenkanal Parliamentary Constituency\n\nLast Updated on July 12, 2019\n\nOne of the 21 constituencies of Odisha, DhenkanalLok Sabha constituency was formed prior to the 1957 elections and comprises of seven Vidhan Sabha. The total number of electorates in the Dhenkanal Lok Sabha Constituency (constituency number 9) according to Election Commission of India 2009 reportsare 1,283,608 of which 678,590 are males and 605,018 are females. The town of Dhenkanal is the centre of administration of the Dhenkanal District and lies in eastern Odisha, bordered by Jajpur, Cuttack and Anugul. It has an average elevation of 80 metres and covers an area of 31 sqkms. The town is famous for the winter festival of MahaShivratri.As per 2001 census, it has a population of about 58,000, 10% of which is under the age of six. Males comprise 53% of the population and the city has a sex ratio of 947 females per 1,000 males. Oriya is the official language here and English, Hindi and Bengali are also widely used. With an average literacy rate of 79%,Dhenkanal has a male literacy rate of 84% and female literacy being 74%. There are several public and private schools here, affiliated to both the state and central boards of education along with many colleges and prominent research institutions. It is a religious destination for the Hindus and has many temples around the city making tourism an important economic activity. National Highway NH-42 passes through this city.In 2009 Election Results the UPA won around 261 out of 543 seats, and in the second position was NDA with 158 seats, while 23 seats were won by Left parties.In 2014 Election Results the BJP won 282 seats out of 543 seats. This took the NDA tally to 336 seats out of 543 seats in the Lok Sabha. INC could only manage to win 44 seats and stayed in the second position while AIADMK party from Tamil Nadu came third with 37 seats in the 2014 Lok Sabha Elections.In 2019, the BJP is set to return to power at the Centre after a sweeping win in the 2019 Lok Sabha election , armed with a bigger mandate than in the 2014 General Election. The party - led by the Prime Minister Narendra Modi and BJP President Amit Shah duo has secured 303 seats in the 17th Lok Sabha. Meanwhile, the Congress, the main Opposition party, managed to increase its vote share from 2014 only by a handful of votes, with a final tally of 52 seats. There will be no Leader of Opposition in the upcoming Lower House for a second consecutive term.The table below represents the names of all the winning and runner up MPs of Dhenkanal parliamentary constituency of all the years from the starting until now . It also shows the number of votes secured by each MP and the name of the political party they belong to. The current sitting member of parliament of the Dhenkanal constituency is Shri Tathagata Satpathy of BJD.The table below shows the list of all the Assembly Constituencies that fall in Dhenkanal parliamentary constituency."}, {"url": "https://kalingatv.com/state/tathagata-satpathys-i-am-independent-not-in-bjd-remark-sparks-political-debate-in-odisha/", "page_content": "Bhubaneswar: Former Dhenkanal MP Tathagata Satpathy sparked a political debate in Odisha politics after he said, ‘I am independent, not in BJD.’\n\nWhile speaking to the media persons on the occasion of the inauguration of the Sankha Bhavan, the new office building of BJD in Bhubaneswar, Satpathy said, “I am independent, not in BJD and have come here as a journalist. I came because the BJD president invited me. The Sankha Bhavan is looking great.”\n\n“I have no interest to contest in the 2024 elections,” he added.\n\nIt is to be noted here that Tathagata Satpathy was a member of the 12th, 14th, 15th and 16th Lok Sabha. He represented the Dhenkanal constituency and was re-elected for the fourth time in 2014. He was also the Biju Janata Dal’s chief whip in the lower house of the Parliament. He did not contest the 2019 election and had announced not to stay away from politics and work as a journalist. Since then he was not seen in any of the programs of the State ruling party.\n\nHowever, his attendance at the inauguration of the Sankha Bhavan today has now become a subject of discussion in Odisha politics.\n\nSeveral senior politicians and BJD leaders and workers from across the State attended the inauguration of the Sankha Bhavan."}, {"url": "https://www.hindustantimes.com/india/tathagata-satpathy-mp-who-accepted-the-internet-challenge-and-won/story-Mx1ZLZM5Twi3JFwdDXqEZP.html", "page_content": "Lok Sabha member Tathagata Satpathy has gone \"viral\" on the web, not for a foot-in-mouth moment or an absent sense of humour. He won numerous fans by inviting people to \"ask him anything\" on Reddit, the user-generated social media forum, and then took the grilling sportingly. Tathagata-Satpathy-announcing-the-AMA-on-Sunday-Image-via-Imgur\n\nSatpathy participated in a cracker of a Reddit AMA (ask me anything), or a Q&A session, sharing policy insights and talking about smoking cannabis with convincing honesty and a sense of humour over the course of an hour.\n\nThe MP from the Biju Janata Dal (BJD), who represents Dhenkanal constituency of Odisha, was witty from the word go. His very first response earned him brownie points for a reference to Pink Floyd.\n\n\"An MP who gets Floyd references. Why can't you be my MP?\" wrote user Deepit6431.\n\nUser Eepsu asked Satpathy about his party’s take on decriminalising the use of cannabis.\n\nPat came the MP’s reply: \"BJD's election manifesto definitely did not contain anything on cannabis. While in college, I have smoked (and unlike Clinton have inhaled) cannabis many a times. In villages of Orissa, many people openly smoke and, as their representative, I am not entitled to be judgmental.\"\n\nHe added: \"BTW cannabis, luckily, is legal in certain states in India, like Orissa. You can walk up to a government excise shop and buy your day's need.\"\n\n\"Who would have thought a politician impresses Reddit better than a film star (priyanka chopra) or a startup ceo (zomato),\" Reddit user Naive_babes said while praising Satpathy.\n\nIn a smart move, Satpathy disclosed while announcing the Reddit session that his views “should definitely not be attributed to those of my party and leadership. I am answering these questions as a citizen of India. All views expressed here are personal.\"\n\n\n\nSatpathy is the BJD’s chief whip in the Lok Sabha. The four-time MP is a journalist by profession and the editor of two newspapers, Dharitri (Oriya) and Orissa Post (English).\n\nHis mother Nandini Satpathy served as chief minister of Odisha during 1972-76. His father Devendra Satpathy was a politician and represented the same constituency.\n\nSatpathy was helped by members of his policy team, notably user Kumbhakaran. It was clear that the MP had done his homework to ensure an efficiently coordinated chat.\n\nKumbhkaran too answered questions, cracked jokes and took the discussion forward with a : \"Using Reddit India to get policy inputs for Parliament: Learnings from AMA with /u/tathagatasatpathy\".\n\nOther highlights of the session were its informal natural and Satpathy's well-thought out responses.\n\nThough the AMA session is over, Satpathy is here to stay. The politician has said he wants to take suggestions from the Reddit community for discussions in parliament. Kumbhkaran's post requesting policy inputs is a step towards this effort.\n\n\"I believe this could prove to be a game changer for public participation in policy,\" Kumbhkaran wrote on Reddit.\n\nSatpathy followed in the footsteps of Ashwin Mahesh of Karnataka's Lok Satta Party, who was the first politician to hold an AMA in April 2013.\n\nSatpathy is in the company of noted individuals like US President Barack Obama, pop star Madonna and Canadian astronaut Chris Hadfield, who fielded questions from the International Space Station. Obama's AMA is the highest rated yet and brought down many parts of Reddit due to a spike in traffic to the site."}, {"url": "https://www.livemint.com/Politics/lRYIj61bbQxtJoLuTSW67O/The-business-interests-of-Tathagata-Satpathy.html", "page_content": "Tathagata Satpathy, the journalist and son of former Odisha chief minister Nandini Satpathy is running for re-election from Dhenkanal constituency in Odisha on a Biju Janata Dal ticket.\n\nThe editor of the Oriya daily Dharitri, Satpathy, along with his wife Adyasha controls Dharitri Infotainment Pvt. Ltd, Navajat Printers and Media Pvt. Ltd and Rosambi Pvt. Ltd. Adyasha also owns a stake in Reliance Wires Pvt. Ltd.\n\nSatpathy did not respond to a detailed questionnaire emailed to him, and Mint could not ascertain the exact nature of businesses done by these companies.\n\nTopics"}]}