{"Tathagata Satpathy has been a vocal critic of the government's handling of the Naxalite insurgency in Odisha.": [{"url": "https://www.nytimes.com/2022/06/28/world/asia/indian-journalist-arrested-modi.html", "page_content": "The Indian authorities on Monday arrested the co-founder of a fact-checking website, reigniting concerns about deteriorating journalistic freedoms in the world’s largest democracy.\n\nThe journalist, Mohammed Zubair, was held on charges of hurting religious sentiments and promoting enmity between religious groups, the New Delhi police said. The arrest came after an anonymous Twitter user complained that Mr. Zubair, a Muslim, had been disrespectful of a Hindu god in a tweet from 2018.\n\nThe detention of Mr. Zubair, journalists and activists said, is part of a broad crackdown on critics of Prime Minister Narendra Modi and his party’s Hindu nationalist worldview. It was even more jarring, they said, because Mr. Modi had just joined leaders of the Group of 7 countries in Germany in committing to free and independent news media.\n\n“This is extremely disturbing because Zubair and his website Alt News have done some exemplary work over the past years in identifying fake news and countering disinformation campaigns, in a very objective and factual manner,” the Editors Guild of India, a journalists’ group, said in a statement. His release is “necessary to buttress the commitments” Mr. Modi made at the G7 meeting, it read.\n\n\n\nMr. Zubair has been a vocal critic of Mr. Modi’s government, using Twitter to condemn Hindu activists and monks calling for the killing of Muslims. Recently, Mr. Zubair highlighted comments made by an official of Mr. Modi’s Bharatiya Janata Party that some considered insulting to the Prophet Muhammad."}, {"url": "https://www.theguardian.com/world/2021/jul/22/tax-raids-target-indian-paper-criticised-government-covid-dainik-bhaskar", "page_content": "Tax raids have been carried out on the offices of one of India’s most popular newspapers, after months of critical coverage of the government’s handling of the Covid-19 pandemic.\n\nOn Thursday morning, more than 100 tax inspectors descended on the headquarters of Dainik Bhaskar media group in the state of Madhya Pradesh, and raided 30 regional offices in the states of Delhi, Rajasthan, Gujarat and Maharashtra.\n\nThe homes of several of the newspaper’s senior executives and promoters were also raided and the mobile phones of some employees seized.\n\nDainik Bhaskar, which is published in Hindi, is one of India’s most widely read daily newspapers with a circulation of more than 4m copies. It produces more than 60 regional editions.\n\nAs the devastating second wave of Covid hit India in March, Dainik Bhaskar devoted extensive coverage to the failures of the state and central government in dealing with the crisis, including deaths from oxygen shortages, lack of hospital beds and the bodies of thousands of victims found floating on the Ganges.\n\nReporters also spent weeks at crematoriums and hospital morgues counting the Covid dead to expose the undercounting of deaths.\n\nDainik Bhaskar accused the government of going after it on trumped-up tax evasion charges in response to its critical reporting. “Scared of its coverage of floating dead bodies in the River Ganges during the pandemic, the government launched raids on the Bhaskar group,” it said in a statement.\n\nThe Press Club of India said it “deplores such acts of intimidation by the government through enforcement agencies to deter the independent media”.\n\nOpposition politicians condemned the raids as an attempt to intimidate and muzzle the critical press in India. Ashok Gehlot, the chief minister of Rajasthan, said the raids were a “brazen attempt to suppress the voice of the media”.\n\nJairam Ramesh, a former minister with the opposition Congress party, tweeted: “Through its reporting Dainik Bhaskar has exposed the Modi regime’s monumental mismanagement of the Covid-19 pandemic. It is now paying the price.”\n\nMamata Banerjee, the chief minister of West Bengal and a vocal critic of the government, said: “Dainik Bhaskar bravely reported the way Narendra Modi mishandled the entire Covid crisis and led the country to its most horrifying days amidst the pandemic.”\n\nBanerjee described the raids as a “vindictive act that aims to suppress voices that bring out the truth. It’s a grave violation that undermines the very principles of democracy.”\n\nThe information and broadcasting minister, Anurag Thakur, denied the government had any role in authorising the Dainik Bhaskar raids. “Agencies do their own work, we don’t interfere in their functioning,” he said.\n\nIt is not the first time organisations and media groups critical of the prime minister’s rightwing Hindu nationalist administration have found themselves subjected to tax evasion charges. In 2017, the television news channel NDTV was raided over allegations of financial impropriety. Amnesty International has been the target of a years-long investigation over alleged illegal foreign funding, and had to halt its work in India last year when the government froze its bank accounts.\n\nIn July, the media freedom watchdog Reporters Without Borders named Modi among the heads of state and government it deemed “predators of press freedom”. Under Modi, India has fallen dramatically in the global press freedom index due to the persecution of journalists and news organisations who are critical of the regime."}, {"url": "https://www.livemint.com/Politics/cEdbfFmpXQ6GNImduzrRTI/Who-is-Tathagata-Satpathy.html", "page_content": "New Delhi: Amidst the cacophony of aggressive voices from both the government and the opposition during the debate on the Jawaharlal Nehru University row and the death of Hyderabad University student Rohith Vemula, the speech by senior Biju Janata Dal (BJD) leader Tathagata Satpathy came as a breath of fresh air.\n\n“I am heartbroken to say that the youth of the country doesn’t deserve us. We are the most undeserving set of people to be in this House today,\" Satpathy, who represents Dhenkanal Lok Sabha constituency in the Lok Sabha, said.\n\nHe went on to say: “I am not interested in taking sides with any of these parties. I am here to hear who has a word of solace and point of solution to the problems that the nation is facing today. Is it only votes that matter? Is it just us and them?\"\n\nHis speech went viral on social media with people praising him for taking the matter above politics. This is not the first time that Satpathy has stood out among other parliamentarians. On several other occasions in the past, he has articulated his views on women’s reservation, crimes against women, net neutrality, Section 377 and even legalisation of cannabis.\n\nDuring an AMA (ask me anything) session on Reddit last year, Satpathy admitted that he had smoked cannabis. “While in college, I have smoked (and unlike Bill Clinton have inhaled) cannabis many a times. In villages of Orissa, many people openly smoke and, as their representative, I am not entitled to be judgmental.\"\n\nSpeaking to Mint after his speech in Parliament, Satpathy said he speaks his mind, does not fear controversies and believes in change through debate.\n\nThe 59-year-old, also the chief whip of the BJD, is the son of Odisha’s only woman chief minister Nandini Satpathy. He is currently serving his fourth term as a member of the lower house of Parliament. A journalist by profession, Satpathy is the owner and editor of leading Odia daily Dharitri and English daily Orissa Post.\n\n“We have been harping on rights for far too long. Time has changed to expose the wrongs,\" Satpathy said. He added that it is time politicians start talking truthfully and make citizens conscious of their duties and responsibilities. “India is going through a churning. I am an optimist. I see good times ahead.\"\n\nEven during the monsoon session last year, when 25 Congress MPs were suspended, Satpathy spoke up in the lower house and made a strong plea against taking up any legislative business in the absence of MPs from several opposition parties, including Congress.\n\nThough Satpathy does not have a personal Twitter or Facebook account, his office runs a Twitter account on his behalf at @SatpathyLive. “I am more a print media guy. I regret to say that I am not very social media savvy, though I am very social. I love to sit down with my friends and chat,\" he said.\n\nHis attendance record in the current Lok Sabha has been 93% as opposed to an average of 83% for parliamentarians. In the 16th Lok Sabha, he has participated in a total of 34 debates and asked three questions, according to the New Delhi-based PRS Legislative Research.\n\n“Parliament is partisan when it comes to giving more time and importance to leaders from parties. Someone like Satpathy would be heard and much more noticed outside Parliament than inside. His is a sane and rational voice. The point that he made on Tuesday about us and them is very critical. The way we are, our politicians are, there seems to be no middle ground and in that way he was making a very important statement,\" said Manisha Priyam, a New Delhi-based political analyst."}, {"url": "https://www.hindustantimes.com/india/tathagata-satpathy-mp-who-accepted-the-internet-challenge-and-won/story-Mx1ZLZM5Twi3JFwdDXqEZP.html", "page_content": "Lok Sabha member Tathagata Satpathy has gone \"viral\" on the web, not for a foot-in-mouth moment or an absent sense of humour. He won numerous fans by inviting people to \"ask him anything\" on Reddit, the user-generated social media forum, and then took the grilling sportingly. Tathagata-Satpathy-announcing-the-AMA-on-Sunday-Image-via-Imgur\n\nSatpathy participated in a cracker of a Reddit AMA (ask me anything), or a Q&A session, sharing policy insights and talking about smoking cannabis with convincing honesty and a sense of humour over the course of an hour.\n\nThe MP from the Biju Janata Dal (BJD), who represents Dhenkanal constituency of Odisha, was witty from the word go. His very first response earned him brownie points for a reference to Pink Floyd.\n\n\"An MP who gets Floyd references. Why can't you be my MP?\" wrote user Deepit6431.\n\nUser Eepsu asked Satpathy about his party’s take on decriminalising the use of cannabis.\n\nPat came the MP’s reply: \"BJD's election manifesto definitely did not contain anything on cannabis. While in college, I have smoked (and unlike Clinton have inhaled) cannabis many a times. In villages of Orissa, many people openly smoke and, as their representative, I am not entitled to be judgmental.\"\n\nHe added: \"BTW cannabis, luckily, is legal in certain states in India, like Orissa. You can walk up to a government excise shop and buy your day's need.\"\n\n\"Who would have thought a politician impresses Reddit better than a film star (priyanka chopra) or a startup ceo (zomato),\" Reddit user Naive_babes said while praising Satpathy.\n\nIn a smart move, Satpathy disclosed while announcing the Reddit session that his views “should definitely not be attributed to those of my party and leadership. I am answering these questions as a citizen of India. All views expressed here are personal.\"\n\n\n\nSatpathy is the BJD’s chief whip in the Lok Sabha. The four-time MP is a journalist by profession and the editor of two newspapers, Dharitri (Oriya) and Orissa Post (English).\n\nHis mother Nandini Satpathy served as chief minister of Odisha during 1972-76. His father Devendra Satpathy was a politician and represented the same constituency.\n\nSatpathy was helped by members of his policy team, notably user Kumbhakaran. It was clear that the MP had done his homework to ensure an efficiently coordinated chat.\n\nKumbhkaran too answered questions, cracked jokes and took the discussion forward with a : \"Using Reddit India to get policy inputs for Parliament: Learnings from AMA with /u/tathagatasatpathy\".\n\nOther highlights of the session were its informal natural and Satpathy's well-thought out responses.\n\nThough the AMA session is over, Satpathy is here to stay. The politician has said he wants to take suggestions from the Reddit community for discussions in parliament. Kumbhkaran's post requesting policy inputs is a step towards this effort.\n\n\"I believe this could prove to be a game changer for public participation in policy,\" Kumbhkaran wrote on Reddit.\n\nSatpathy followed in the footsteps of Ashwin Mahesh of Karnataka's Lok Satta Party, who was the first politician to hold an AMA in April 2013.\n\nSatpathy is in the company of noted individuals like US President Barack Obama, pop star Madonna and Canadian astronaut Chris Hadfield, who fielded questions from the International Space Station. Obama's AMA is the highest rated yet and brought down many parts of Reddit due to a spike in traffic to the site."}, {"url": "https://yougov.co.uk/topics/politics/articles-reports/2021/01/21/what-do-britons-think-governments-handling-covid-1", "page_content": "Six in ten say the Government has done a bad job handling the issue overall\n\nIt has been nearly a year since the first case of COVID-19, and most Britons say that the government has handled the pandemic badly overall, as well in several key areas aside from the vaccine rollout.\n\nOverall, six in ten (60%) people say the government is handling the pandemic badly as a whole; including 31% who say the issue of COVID-19 has been “very badly” handled. Just over a third of Britons (37%) they have handled it well, although only 5% say they have handled it “very well”.\n\nApproval of the government’s overall handling of the pandemic is highest among Conservatives (68%), and lower among Lib Dems (20%) and Labour supporters (13%).\n\nBritons are split on how well the government is protecting jobs, and think they’re doing badly at resourcing the NHS and controlling the spread of the virus\n\nThe survey also asked how Britons think the government is managing specific aspects of the pandemic. When it comes to protecting people’s jobs and income Britons are split, with 48% thinking the government has done well and 44% thinking it has done badly. Conservatives are again most likely to think the government has been effectively protecting jobs and income, at 70%, compared to nearly half of Lib Dems (48%) and a quarter of Labour voters (24%).\n\nIn terms of ensuring the NHS has the capacity to treat COVID-19 patients, Britons are more critical of the government. Half (53%) say the government has handled this badly, including 27% who say this part of the pandemic response has been handled “very badly”. Four in ten (39%) think handling of NHS resources has been managed well.\n\nThe area Britons feel the government has performed worst in is limiting the spread of the virus, which 70% of people think the government has done badly. Nearly half (49%) of Conservative voters agree, as do 90% of Labour supporters and 87% of Lib Dems.\n\nBritons think the government is doing well at rolling out the COVID-19 vaccine\n\nThere is one element of the UK’s pandemic response that Britons think is being handled well however ; : the rollout of the various COVID-19 vaccines. Our latest figures show that 61% of people now think the rollout is being handled well, including 19% who say it is being handled “very well”. However, three in ten (29%) think the vaccine rollout is being handled badly.\n\nOpinion had been split when we asked this question on 7 January: 41% thought the government is handling the rollout well then, compared to 45% who thought the rollout was being handled badly.\n\nAlong party lines, 81% of Conservatives (+17 from the earlier poll), 68% of Lib Dems (+37), and 48% of Labour voters (+24) all say the rollout is being handled well. However, a similar number of Labour voters (44%) think the rollout is being handled badly, as do 27% of Lib Dems, and 15% of Conservatives.\n\nSee overall pandemic handling results here\n\nSee specific pandemic issues handling results here\n\nSee vaccine rollout handling results here"}, {"url": "https://www.telegraph.co.uk/news/2020/05/19/chaand-nagpaul-bma-chair-claimed-tories-underfunded-nhs-accelerate/", "page_content": "Chaand Nagpaul, the chair of the BMA council who threw its “full support” behind the National Education Union's opposition to schools reopening has a history of attacking the Government. Days before he took up his post in June 2017, the Stanmore-based GP courted controversy for suggesting that the Tories had persistently underfunded the NHS to \"accelerate\" the takeover by for-profit firms.\n\nAddressing up to 500 doctors at the BMA's annual conference in Bournemouth that year, he claimed overcrowding and long waits for routine operations had been \"consciously created\", forcing GPs to refer patients to private treatment centres.\n\nInsisting the medical profession had been \"set up to fail\", he proposed a motion for debate which stated \"the crisis in NHS hospitals has been consciously created by the Government in order to accelerate its transformation plans for private sector takeover of healthcare in England\".\n\nIt added that the \"woeful Government underfunding of the NHS - coupled with continued austerity cuts - is the greatest threat to quality and safety in the NHS\". The St Bart’s graduate, who has been a practising GP since 1990 and was made a CBE in 2015, has been a vocal critic of the Government ever since he took over from Dr Mark Porter three years ago.\n\nIn February, before the coronavirus outbreak became a major public health concern in the UK, he accused the Government of “failing to get a grip on winter pressures” in Accident and Emergency departments, saying doctors were “exhausted and run into the ground.”\n\n“This is an unacceptable situation for a civilised health service,” he added. “It is failing patients and is not sustainable.” Following the December general election, he warned Boris Johnson’s incoming administration to “listen to, and act on, concerns... that exhausted and burnt-out doctors were struggling to provide the level of care that patients deserve.”\n\nA vocal remainer, last October, he suggested that the “chaos” of a no deal Brexit could spark the “disintegration of the NHS,” adding: “The consequences will be catastrophic.”\n\nIn April last year, he was forced to defend the BMA against claims of sexism after whistleblowers likened the medical profession to Monty Python and accused union chiefs of \"sending naked photos and joking about women colleagues' bra sizes\". Vowing to launch an investigation into the lurid claims, made by two female GPs concerning behaviour at the union’s conference a month earlier, Dr Nagpaul said: “Sexist, disrespectful, discriminatory and abusive behaviour will not be tolerated and must be stamped out.”"}, {"url": "https://www.thehindu.com/opinion/open-page/constructive-criticism-of-government/article29542527.ece", "page_content": "September 29, 2019 12:15 am | Updated 12:15 am IST\n\nSupporting one’s country policies and decisions is one part of keeping it on the path of prosperity and development, while keeping track of government activities, being vigilant about them and highlighting loopholes in policies are also needed in a democracy.\n\nIn our country, we have people with different ideologies — some criticise the government policies and some support it, while others remain at the top of it appreciating the good policies and highlighting the drawbacks to improve governance. It’s common nowadays to see society divided into segments each with a different perspective about the policies undertaken by their governments; it is something which keeps the true essence of democracy alive. There are many instances in the past of governance and society improving because of the positive criticism by some people or group of them. These examples give democracies around the world a chance of improving the quality of governance and hence create a better society.\n\nIn recent years in India, there has been a gradual change in perspective of the people regarding their governments. While some of them are a very good sign of a progressive society, some of them are quite worrying too. There is a common notion among some citizens that if they speak something against the actions of their government, then it’s probably against the nation too.\n\nThis idea which is significant in numbers need to be thoroughly assessed. Chances might be there that some of the criticism may not be on the right note, but many of it if considered by the governments can be helpful in the real-time assessment of the needs and expectations of the people from the government. Unfortunately, there is a decline in these voices nowadays because of the type of mandate which India got in the 2019 election. People who voted for the NDA government think that it's wrong to speak against the government which they elected to power.\n\nPeople should realise that it is not the driving force of praise and overwhelming support which keeps the wheels of a government moving but also the steering force of people’s participation which keep a check on government, and modify it, if the policies fail to meet the expectations of society as a whole. If people’s criticism reaches the government’s ear at an appropriate time and in significant numbers, then a lot of resources of the governmental machinery can be utilised wisely for some other activities which are brought to notice by the people itself.\n\nSome experts believe that praise and support of people are very crucial for maintaining efficient governance as it keeps leaders and bureaucrats motivated to work more to increase the overall output of governmental activities on the ground. This is true in practice too but it should be kept in mind that the power vested in the hands of people in a democracy is not only utilised for blindly praising the government but it should be used as an aid, to advise and correct the government whenever required so that the efficiency and quality of governance is maintained.\n\nsunny@alonehands.com"}, {"url": "https://www.itv.com/news/2021-10-12/11-key-findings-of-hugely-critical-report-into-governments-handling-of-covid", "page_content": "A study has highlighted multiple incompetencies in the way the government and its scientific advisors handled the Covid-19 pandemic.\n\nThe study, by MPs in Parliament's Science and Technology Committee and the Health and Social Care Committee, looked at the government's management of the outbreak from the start of last year.\n\nIt found serious errors and delays at the hands of authorities that cost lives.\n\nHere are the key findings from the damning report:\n\n1. The UK's pandemic planning was outdated\n\nUK was not prepared for the Covid pandemic as plans were too “narrowly and inflexibly based on a flu model” that failed to learn the lessons from Sars, Mers and Ebola, the report said.\n\nIt came despite assurances from Matt Hancock on January 23, 2020, that \"the whole of the UK is always well-prepared for these types of outbreaks\".\n\n2. The first lockdown in March 2020 did not come early enough\n\nCovid cases in the UK surged at the beginning of March, but it wasn't until March 23 that Prime Minister Boris Johnson announced a lockdown.\n\nThere was a false belief that the public would not accept lockdown, or would only do so for a short period of time, the report said.\n\nThe report said government and scientists took \"gradual and incremental approach\" to introducing measures such as social distancing, isolation and lockdowns, but this was “wrong” and led to a higher death toll.\n\nIf social distancing and lockdown was brought in early, it “would have bought much-needed time” for vaccine research to begin, for Covid treatments to be developed and for a proper test and trace system to be set up, MPs said.\n\nThe MPs said the “decisions on lockdowns and social distancing during the early weeks of the pandemic – and the advice that led to them – rank as one of the most important public health failures the United Kingdom has ever experienced”.\n\nListen to the ITV News podcast - Coronavirus: What you need to know\n\n3. Scientists in the UK did not treat Covid seriously enough in the early months\n\nFormer chief medical officer Professor Dame Sally Davies said “groupthink” by infectious disease experts downplayed the seriousness of Covid and its potential risk of spread in the UK.\n\nWhile herd immunity was not official government strategy, MPs said, the government adopted a “policy approach of fatalism”, seeking to “only moderate the speed of infection” through the population, rather than seeking to stop its spread altogether.\n\nAs late as March 12, chief scientific adviser Sir Patrick Vallance, told a briefing that it was not possible to stop everyone being infected, and nor was that a desirable objective.\n\nThe MPs said it was only in the days leading up to the March 23 lockdown that people within government and advisers “experienced simultaneous epiphanies that the course the UK was following was wrong, possibly catastrophically so”.\n\nBlackpool under lockdown Credit: pa\n\n4. A lack of data in early months led to poor decision-making\n\nThere was a lack of Covid data due to lack of testing capacity. MPs also branded the abandoning of community testing on March 12 a “seminal failure”.\n\nMPs said “deficiencies in both scientific advice and government action” meant there was no real information about how far the virus had spread and authorities did not fully understand the role of asymptomatic transmission.\n\n5. When the test and trace system began, it was 'slow, uncertain and often chaotic'\n\nThe report said the poorly-executed test and trace system “severely hampered the UK’s response to the pandemic”.\n\nIt also \"took too long to become effective\".\n\n6. There weren't enough border controls to stop the virus reaching the country\n\nThe border controls in the first few months of 2020 were described as “light-touch” and were implemented only on countries with high Covid rates, even though 33% of cases during the first wave were introduced from Spain and 29% from France.\n\nA Covid testing centre Credit: PA\n\n7. More stringent Covid measures before second lockdown in November could have reduced the spread of the Alpha variant\n\nMPs said more could have been done to reduce the spread of Covid before the second lockdown on November 5. More stringent social distancing measures in autumn could have “reduced the seeding of the Alpha variant across the country, slowed its spread and therefore have saved lives”.\n\n8. The regional tier system was confusing and not good enough\n\nThe regional tier system that began on October 14 as confusing for the public, MPs said. Furthermore, it was not “watertight” enough to prevent infection spreading.\n\n9. Minorities were hit the hardest\n\nThere were “unacceptably high death rates among people from black, Asian and minority ethnic communities” and those with learning disabilities, the report noted.\n\nTaxi driver wearing a PPE mask Credit: PA\n\n10. Government failures led to thousands of elderly people dying in care homes\n\nThousands of care home residents died during the first wave of the pandemic.\n\nThe decision not to test people discharged from hospitals to care homes early on was a failure and led to deaths, MPs said.\n\nThey said during the early months, the government did not focus enough on social care, saying “social care had a less prominent voice in government during the early stages of the pandemic than did the NHS”.\n\n11. The government did well with the vaccine programme\n\nNews of a coronavirus vaccine in early November, 2020, lifted the hopes of many after the Pfizer vaccine was proven to be 90% effective. In December, the UK became the first country in the world to approve a Covid vaccine.\n\nMPs praised in the government's focus on treatments and vaccines, and described the vaccine programme as \"boldly planned and effectively executed\".\n\nThey said ministers were “correct to identify that a vaccine would be the long-term route out of the pandemic” and supported research and development.\n\nIn a joint statement, Tory MPs Greg Clark and Jeremy Hunt, who chair the committees, said: “The UK response has combined some big achievements with some big mistakes. It is vital to learn from both to ensure that we perform as best as we possibly can during the remainder of the pandemic and in the future.\n\n“In responding to an emergency, when much is unknown, it is impossible to get everything right”."}, {"url": "https://apnews.com/article/africa-tunisia-judiciary-assassinations-tunis-29ee6a5ce5c20776fcb59750a025fb74", "page_content": "FILE - Tunisian President Kais Saied gives a speech at the new government's swearing-in ceremony at the Carthage Palace outside the capital Tunis, on Feb. 27, 2020. Tunisia's president has announced a plan to dissolve the country's main judiciary body due to suspicions of corruption and the mishandling of sensitive cases. The decision by President Kais Saied to seek to disband the Superior Council of the Judiciary comes as Tunisians on Sunday marked the ninth anniversary of the 2013 assassination of a prominent left-wing leader and an outspoken critic of the then-ruling Islamist movement. (Fethi Belaid/Pool via AP, File)\n\nFILE - Tunisian President Kais Saied gives a speech at the new government's swearing-in ceremony at the Carthage Palace outside the capital Tunis, on Feb. 27, 2020. Tunisia's president has announced a plan to dissolve the country's main judiciary body due to suspicions of corruption and the mishandling of sensitive cases. The decision by President Kais Saied to seek to disband the Superior Council of the Judiciary comes as Tunisians on Sunday marked the ninth anniversary of the 2013 assassination of a prominent left-wing leader and an outspoken critic of the then-ruling Islamist movement. (Fethi Belaid/Pool via AP, File)\n\nTUNIS, Tunisia (AP) — Tunisia’s president has announced a plan to dissolve the national judiciary body, claiming suspicions of corruption and possible mishandling of politically charged cases, local media reported Sunday. Opposition members said the move was just the latest example of the president’s extreme power grab.\n\nThe decision by President Kais Saied to disband the Superior Council of the Judiciary comes as Tunisians on Sunday marked the ninth anniversary of the assassination of a prominent left-wing leader and an outspoken critic of the Islamist movement.\n\nDuring a surprise visit to Tunisia’s Interior Ministry on Saturday night, Said blasted members of the judiciary, accusing some judges and magistrates of “corruption … nepotism … and stalling proceedings in several cases, including those of political assassinations.”\n\n“The Superior Council of the Judiciary can from now on consider itself a thing of the past,” the president said, adding that a decree to set up a provisional council will be issued soon.\n\nOpposition leader Chokri Belaïd was gunned down outside his home on Feb. 6, 2013. He was a vocal critic of the Islamist movement, Ennahda, that was in power at the time. Six months later, another left-wing politician, Mohammed Brahimi, was assassinated. No one has been convicted in either case.\n\nTunisia devolved into a deep political crisis after the two 2013 killings. Tunisia’s 2011 revolution triggered the pro-democracy uprising known as the Arab Spring and the North African was considered the country with the best chance of realizing true democratic change until that political crisis.\n\nLast July, following nationwide anti-government protests, Saied dismissed his prime minister, assumed all executive powers and froze parliament. He’s been governing by decree since then, cracking down on corruption and throwing several lawmakers and business people in jail on corruption charges.\n\nWhile constitutional lawyers and political opponents, including the influential Islamist party, say the president’s actions are unlawful, the decision has proven widely popular with Tunisian public.\n\nSupporters of the assassinated politicians have blamed the Islamist party for the killings, saying that Ennahda has slowed down the judicial process in the cases. Ennahda leaders have denied involvement.\n\nSaied accused magistrates of mishandling Belaid’s case and “denying Tunisians the right to know the truth.” He called on Tunisians to peacefully protest against judges who have kept “the assassination file in the drawer for years.”\n\nThe president’s call to protest came despite the government’s ban on public gatherings because of COVID-19 restrictions.\n\nSeveral hundred people marched in the capital, Tunis, on Sunday, demanding “truth and justice for Belaid.” They staged a sit-in at the Superior Council of the Judiciary building and urged that the body be dissolved.\n\nThe council’s president, Youssef Bouzakher, said the body remains intact because the president has no power to dissolve it under the Tunisian constitution.\n\n“We continue to carry out our duties and we will defend the judicial council with all means at our disposal,” Bouzakher said in a statement Sunday.\n\nGhazi Chaouachi, the leader of the opposition Democratic Party, said the president’s attempt to dissolve the judiciary council was part of his “power grab.”\n\n“By getting his hands on the judiciary, after he captured the executive and the legislative branches, his control is almost total,” Ghaouachi said."}, {"url": "https://www.theguardian.com/us-news/2020/nov/11/joe-biden-ron-klain-chief-of-staff", "page_content": "Joe Biden has named Ron Klain, who served as the “Ebola tsar” during the Obama administration, as his chief of staff.\n\nKlain, 59, has been a vocal critic of Donald Trump’s pandemic response. He first worked with Biden in the 1980s.\n\nIn a statement sharing the news, the president-elect praised Klain’s “deep, varied experience”.\n\n“Ron has been invaluable to me over the many years that we have worked together, including as we rescued the American economy from one of the worst downturns in our history in 2009 and later overcame a daunting public health emergency in 2014,” said Biden. “His deep, varied experience and capacity to work with people all across the political spectrum is precisely what I need in a White House chief of staff as we confront this moment of crisis and bring our country together again.”\n\n\n\nKlain said: “It’s the honor of a lifetime to serve President-elect Biden in this role, and I am humbled by his confidence.”\n\nKlain has had a long career in government. He served as the chief of staff to the former vice-president Al Gore, and the staff director of the Senate Democratic leadership committee. He has worked with several Democratic presidential campaigns, including Biden’s 1988 and 2008 presidential campaigns. He was also the lead Democratic lawyer for Gore during the 2000 presidential election recount.\n\nFrom 2008 to 2011, he served as then vice-president Biden’s chief of staff and helped oversee the $787bn stimulus package that Barack Obama signed in response to the Great Recession.\n\nKlain’s experience in a global health pandemic and a recession have been cited as among his top qualifications to help Biden in this moment. The president-elect made the coronavirus pandemic and the economic recession it has triggered central to his presidential campaign, promising to help lead Americans out of the crisis.\n\nWhen Klain was named the Ebola response coordinator in 2014, his appointment was initially criticized because he lacked public health experience. The Obama administration at the time noted he was chosen for his “extensive management experience”.\n\nAmong those to congratulate Klain was Elizabeth Warren, the progressive Massachusetts senator who ran against Biden in the 2020 primaries. Warren said Klain was a “superb choice for chief of staff. He understands the magnitude of the health and economic crisis and he has the experience to lead this next administration through it.” Ilhan Omar and Alexandria Ocasio-Cortez, members of the so-called “Squad” of progressive congresswoman, also offered congratulations.\n\nWaleed Shahid, the communications director for the progressive political action committee Justice Democrats, said Klain “understands the Democratic ​party has moved in a more progressive direction”.\n\nProgressives and moderates came together to help elect Joe Biden. But post-election, the two camps have already begun to spar over the party’s future, with progressives saying that Biden should embrace more ambitious policy on the climate crisis, policing and healthcare."}]}