{"Michel Mathieu was a teacher and school principal before entering politics.": [{"url": "https://www.npr.org/sections/ed/2015/08/06/415498760/the-role-of-politics-in-the-classroom", "page_content": "Politics In The Classroom: How Much Is Too Much?\n\nEnlarge this image LA Johnson/NPR LA Johnson/NPR\n\nThe Confederate flag. The Supreme Court ruling on gay marriage. Policing minority communities. Nuclear weapons and Iran. Summer often brings a lull in the news, but not this year. And, come September, students are going to want to talk about these headlines.\n\nBut how should teachers navigate our nation's thorny politics?\n\nThe Political Classroom Evidence and Ethics in Democratic Education by Diana E. Hess and Paula Mcavoy Paperback, 247 pages | purchase close overlay Buy Featured Book Your purchase helps support NPR programming. How?\n\nDo politics belong in the classroom at all, or should schools be safe havens from never-ending partisan battles? Can teachers use controversial issues as learning opportunities, and, if so, to teach what? And then, the really sticky question: Should teachers share with students their own political viewpoints and opinions?\n\nIn their book, The Political Classroom: Evidence and Ethics in Democratic Education, Diana E. Hess and Paula McAvoy offer guidelines to these and other questions, using a study they conducted from 2005 to 2009. It involved 21 teachers in 35 schools and their 1,001 students. Hess is the dean of the school of education at the University of Wisconsin-Madison, and McAvoy is the program director at UW-Madison's Center for Ethics and Education.\n\nSchools, they conclude, are and ought to be political places — but not partisan ones. I talked with them recently about how, in today's highly polarized society, teachers can walk that very fine line.\n\nSometimes it seems there's a belief that schools should be political ... sort of. With students taking on issues – like smoking – that are political but not too political. Did you find that in your study?\n\nHess: You're absolutely right, there are a number of schools that encourage students to get involved in political campaigns, but they tend to be political campaigns that really aren't very controversial. They'll encourage kids to form a campaign about something that everyone agrees should be done. For example, that we should clean up the litter that's around our school, or that it's important for people to eat healthy food...\n\nWe have evidence that kids learn a lot from doing that. It's not necessarily a terrible thing. My view is that if you're going to have students involved in authentic politics, then it's really important to make sure you have issues for which there are multiple and competing views, and you don't give students the impression that there's a political view that they should be working toward.\n\nMcAvoy: How political do we want students to be? That's really a question that a lot of communities struggle with and a lot of teachers struggle with. And the point of the book is to say that, in general, to be able to talk about politics is a skill that people need to learn. And it would be great if it were learned in school because these are great moments in which you bring a group of young people together who are forming their political views. They can really learn to engage across their differences and to start to see that political conflict is a normal part of democratic life.\n\nA key point in your book is that, while teachers are teaching about the issues – immigration or same-sex marriage — they're also teaching students how to have these discussions. They're teaching the process of democracy.\n\n\n\nMcAvoy: Right. The \"political classroom\" is a classroom in which young people are learning to deliberate about political questions. It really is the process of deliberation that is the major skill being taught. And then, through deliberation, students are learning about the issues. They're learning how to form arguments, how to weigh evidence. So there's social studies content that is being learned in a process that is, at its heart, democratic.\n\nAre there issues that are, or should be, completely off the table?\n\nHess: One of the things we talk about in the book is the distinction between issues that we called \"settled issues\" and issues that are \"open\"...\n\nIt's a little complicated, but, in a nutshell, we suggest that there are some issues that are settled and should be taught as settled and to not do that is being dishonest with young people. For example, the question about whether climate change is occurring — that's a settled issue. The question is, What to do about climate change? That's an open issue.\n\nWe wouldn't suggest that teachers engage kids in talking about whether climate change is occurring, but we strongly encourage teachers to engage in discussion about what should be done about climate change.\n\nYou mention in your book policies that might allow students to opt out [of a controversial topic or discussion]. Which raises questions about whether that's a good thing, to just allow students to sit out.\n\nMcAvoy: The philosopher in me thinks there's not a really good way to defend the view that students should always be able to opt out. We don't allow students to opt out of writing essays because they don't like writing essays.\n\nAt the same time, democracies allow us, when we're in the public sphere, to walk out of a discussion if we don't like what's happening or if we're being offended. Classrooms are unusual in that we're compelling students to be there. Teachers do need to weigh [whether] there might be times when a particular student has a good reason for wanting to pass on a comment...\n\nOpting out because I feel uncomfortable sharing my views or talking out loud in class is a skill that can be taught and overcome. Opting out because this discussion is really hard for me given my religious background — that might be a reason that you let a student pass on a discussion.\n\nYou note the challenges and dangers of teaching both in mixed classrooms – with students of varied racial and economic backgrounds — and homogenous classrooms. How should teachers adapt to these different scenarios?\n\nHess: In many ways the more difference you have within a classroom the better. We want to make sure that we have as many multiple competing views as we possibly can ... So difference is a good thing, something that can be used and primed as opposed to something to be feared and quelled.\n\nOne of the challenges of lots of difference is, difference often causes high emotions and often can cause breaches of civility. So teachers who are in classrooms that have lots of naturally occurring difference often have to go to great lengths to make sure that students understand what it looks like to participate in a civil manner...\n\nIn classes where there's a lot of sameness, the first thing we learned is that, though it might appear that there's a lot of sameness, there's always some difference. So when teachers say, \"Well all these kids think alike,\" we're almost sure — all the time — that the teachers are wrong, that in fact not all the kids do think alike.\n\nThat being said, there are classes that are more similar than they are different, and teachers have to use a lot of strategies to bring differences into the discussion. Those strategies might include bringing in guest speakers or making sure the materials the kids are using to prepare for discussion are full of multiple and competing ideas.\n\nStudents really seem to like this stuff – to engage in issues that are current and relevant to their own lives.\n\nHess: Absolutely. There are two things going on here: In many schools, students still spend most of the day listening to teachers talk. One reason we think kids like [these issues] is they finally get a chance to talk themselves. More than that, we did find that the content of these political issues was really interesting to kids. Especially when they were hearing multiple and competing views. Students would report that in discussions where there was a lot of shared opinion, those were not as interesting as in discussions where there were differing views ... They were really responding to the fact that it's quite interesting to hear what your peers think about things. And not just that they have different points of view but what they're supporting those points of view with.\n\nWhat advice do you have or does your study have for teachers considering how to talk about [breaking events such as] Baltimore or Ferguson, Missouri?\n\nHess: One of the problems with discussing events that just happened is that often we don't know enough about what happened. There's a distinction between current events ... and discussions about controversial political issues where kids are preparing in advance and being deliberative. In the best-case scenario, teachers are able to take advantage of current events and use them as opportunities to get kids to talk about controversial political issues. There's a big difference in talking about, \"What do you think happened?\" and talking about a policy issue like \"Should police officers be required to wear video cameras?\"\n\nMcAvoy: Young people need to see these as moments within their historical context – need to understand some of the history. It's difficult to have those materials at the ready when things sort of erupt as they have in the last year or so with Baltimore and Ferguson. Good teachers start building curriculum about the history of redlining in cities or how cities become segregated. [To] put these moments within the context is much better than having young people just reacting to \"What do you think about what you're seeing on television today?\" Young people really need to study these issues in depth.\n\nOK, the big elephant in the room: the question of whether teachers should talk about their own personal beliefs to their students. Should they?\n\nHess: What we found is that there were teachers who were doing an excellent job who shared their own views with students, and there were teachers doing an excellent job who didn't share their views. So we don't believe that there is one right answer to this. And we think empirically we can show that there's not.\n\nThat being said, we think that there are times when it's probably better for teachers to share than other times when it's better for them not to share. That depends in large part on the context — on who's in their class and what their goals are.\n\nOne thing we were really intrigued by was that a lot of the teachers we interviewed talked about changing their minds on that question over time. Some of them would say, \"Well, it used to be that I would never share, but now I do only in these circumstances.\" Other teachers would say, \"I used to be really prone to share a lot, and now I don't and here's why.\" We think it's all a matter of professional judgment. Teachers need to think about this very carefully...\n\nI sometimes worry that, even though there can be really good ethical reasons for teachers to share, in a very polarized time that sharing can be misinterpreted. And if it's misinterpreted by the public or by parents as teachers trying to get kids to adopt their beliefs, then I think we could have a big problem.\n\nThat being said, we have no evidence from the study of teachers who were actively and purposely trying to indoctrinate kids to a particular point of view...\n\nWe think that this feeling that the public seems to have that teachers by definition are trying to push their political views on students is just false.\n\nYou were critical of the notion – that teachers would do that.\n\nHess: What we learned from students when we interviewed and surveyed them is that they make a really clear distinction between a teacher sharing his or her own view and a teacher trying to push his or her own view. Students not surprisingly report that they don't like being pushed.\n\nYou seem to draw a pretty firm line that teachers should not be advocating for their own beliefs.\n\nMcAvoy: What we argue in the book is that what's most important is that teachers create a culture of fairness in the classroom. That means being fair and reasonable to all the competing views that are in the classroom and that are being represented in the public. The practice that we found most troubling, from the study, is what we referred to in the book as political seepage: teachers who make sarcastic comments, who use partisan humor. It's these offhanded comments that are sort of biting and mean-spirited about the political climate that I think is problematic. Because it creates a climate not of fairness, but it creates a kind of insider/outsider feeling. If you get the humor that I just said or, \"Do you agree with me that that politician's a big idiot?\" That invites the most divisive parts of the partisan climate into the classroom."}, {"url": "https://www.encyclopedia.com/arts/dictionaries-thesauruses-pictures-and-press-releases/mathieu", "page_content": "Mathieu\n\nMathieu, family of French musicians:\n\n(1) Michel Mathieu, violinist, violist, and composer; b. Paris, Oct. 28, 1689; d. Versailles, April 7 or 9, 1768. He became a member of the orch. of the Paris Opéra in 1718, and from 1728 to 1761 he served as a musicien du roi. He publ. many instrumental and vocal works. His wife, Jacqueline-Françoise Barbier (b. 1708; d. 1773), was an esteemed soprano at the Versailles court. They had two sons, both of whom were musicians:\n\n(2) Julien-Amable Mathieu, violinist and composer; b. Versailles, Jan. 31, 1734; d. Paris, Sept. 6 or 9, 1811. At the age of 14, he was granted a reversion of a place in the 24 violons du roi, remaining active with them until 1761. From 1765 to 1792 he was music master of the royal chapel. He wrote a number of fine sonatas and duets for violins (1756–64), and also many choral motets.\n\n(3) Michel-Julien Mathieu, violinist, writer, and composer; b. Fontainebleau, Oct. 8, 1740; d. after 1777. He composed operas, incidental music, and many instrumental and vocal pieces. He also prepared trs. and wrote texts for several plays.\n\n—Laura Kuhn/Dennis McIntire"}, {"url": "http://www.biographi.ca/en/bio.php?id_nbr=7573", "page_content": "MATHIEU, MICHEL, notary, lawyer, politician, publisher, judge, and professor; b. 20 Dec. 1838 in Sorel, Lower Canada, son of Joseph Mathieu, a farmer, and Edwige (Hedwige) Vandal; m. there first 22 June 1863 Thirza Saint-Louis, daughter of Augustin Saint-Louis and Joséphine Desaulniers; m. there secondly 29 Oct. 1871 Amélie Armstrong, daughter of David Morrison Armstrong, a member of the Legislative Council, and Léocadie Deligny; these marriages produced four children, of whom only one survived their father; d. 30 July 1916 in Montreal and was buried 1 August in Sorel.\n\nMichel Mathieu entered the Séminaire de Saint-Hyacinthe in 1854 and completed his classical studies in 1859. He was then articled to the Sorel notary John George Crebassa and became a member of the Richelieu Board of Notaries in 1864. Although he remained in notarial practice until 1868, he was called to the bar in 1865 and appointed sheriff of the Richelieu district in 1866.\n\nDrawn to political life, Mathieu ran as a Conservative for Richelieu in the federal election of 1872, defeating Georges-Isidore Barthe”. Two years later he himself lost the seat. Mathieu’s political activities led him to take an interest in the press. He was the owner of the Conservative weekly Le Courrier de Richelieu, which he published in Sorel from 1872 to 1874. Soon after his defeat in the federal election, he went back into public life, being returned by acclamation in 1875 as the provincial member for Richelieu. He won a second time but resigned in 1881 to accept appointment to the judiciary. During his years in the legislature Mathieu took an active part in debates. In fact, had he not been put on the bench, he might well have had a brilliant political career. In addition to his seat in the Legislative Assembly, Mathieu held the mayoralty of Sorel from 1876 to 1882.\n\nNamed a judge of the Quebec Superior Court on 3 Oct. 1881, Mathieu was assigned to the judicial district of Joliette and then, two years later, to that of Montreal, where he sat for more than 25 years. In the course of his long experience as a judge of a court of first instance, in 1895 he presided in Beauharnois at the trial of Valentine Shortis*, who was accused of murdering two people in a factory at Salaberry-de-Valleyfield. The case involved a defendant from a wealthy Irish family and prominent lawyers, as well as many expert witnesses, and thus was widely covered in the Canadian press.\n\nIn 1886, while still carrying out his duties as a judge, Mathieu was appointed professor of civil law at the Université Laval in Montreal. When Louis-Amable Jetté became lieutenant governor in 1898, Mathieu succeeded him as dean of the faculty, a position he retained until 1915. During his many years of teaching he apparently was well liked by his students, who found his lectures interesting.\n\nMathieu played a key role in developing the field of legal publication in the second half of the 19th century. In 1869 at Sorel he and another lawyer, Adolphe Germain, had founded La Revue légale, a periodical devoted to legal theory and judicial decisions. In an article written for it that year, Mathieu criticized Prime Minister Sir John A. Macdonald*’s plan to set up a Canadian court with jurisdiction over the whole country [see Sir Samuel Henry Strong*]. For the sake of preserving Quebec civil law intact, he opposed the creation of such a supreme court, with a majority of judges drawn from the common law provinces, which would have the power to rule on cases within the realm of civil law. Mathieu kept overall control of the production of La Revue légale for about 12 years; it was then purchased by Amédée Périard, a Montreal bookseller and publisher specializing in law, who retained him as editor. The journal, which had soon dropped its theoretical emphasis, underwent a major transformation in 1886. Following the practice in French legal periodicals, Mathieu began to write long commentaries in copious footnotes about certain decisions, endeavouring to situate them within the body of jurisprudence. The many references to judgements and to theoretical writings gave the footnotes an erudite character. According to the lawyer Jean-Joseph Beauchamp*, the journal had by then achieved an importance never before reached by other volumes of decisions. Mathieu was also a contributor to the Lower Canada Jurist/Collection de decisions du Bas-Canada and to the Rapports Judiciaires officiels de Québec, which were published in Montreal.\n\nMathieu’s major editorial work is his Rapports judiciaires révisés de la province de Québec . . . , a retrospective edition of judgements rendered by the province’s courts. This vast repertory of jurisprudence was brought out in 29 volumes from 1891 to 1905 and contains decisions published before 1892 in various collections. From the mass of rulings in those collections, Mathieu weeded out the ones he considered unnecessary, and then grouped by case the decisions from both lower and higher courts. He also attempted to update old jurisprudence through annotations that pointed out connections with legislation in force at the end of the 19th century. This work of consolidation was a true achievement. It saved the practising lawyer the cost of purchasing the old compilations and also the effort of reconstructing the sequence of rulings. Mathieu presented it as a supplement to the casebooks issued by the bar from 1892. It is no coincidence that the two projects ran concomitantly. Both sought to reorganize the communication of such information so as to make the whole corpus of jurisprudence more accessible, for both past and future judgements.\n\nIn addition to these long-term works, Mathieu published several reference books. Probably the most noteworthy is his annotated edition of the Traité des substitutions fidéicommissaires . . . , by the French jurist Claude-François Thévenot d’Essaule de Savigny, published in Montreal in 1888. Substitution was a method frequently used in Quebec at that time for passing on an inheritance. Jurists in the province could not, however, rely on the French doctrine as they were then doing; the adoption of restrictive measures at the time of the French revolution and afterward effectively limited application of the method and meant that the practice no longer gave rise to detailed commentaries. Mathieu’s work was an attempt to fill this documentary void. In addition, like some of his colleagues, he prepared editions of the Civil Code (published in 1898 and 1909), the Code of Civil Procedure (1893 and 1910), and the Municipal Code (1886 and 1894). He also published a Table alphabétique des causes de la province de Québec . . . (2v., Montreal), a reference work that enables practising lawyers to find decisions quickly.\n\nMathieu was not able to bring all his projects to completion. An edition of François Dareau’s classic legal work on verbal abuse did not see the light of day, despite a commitment to the publisher Amédée Périard. And in 1913 he suffered an accident which prevented him from finishing a legal encyclopedia he had begun editing.\n\nMathieu’s accomplishments received recognition on several occasions. The provincial government appointed him to chair the royal commission set up in 1892 to examine corrupt practices of Honoré Mercier*’s government, but illness prevented him from completing the task. In 1910 he served on the commission to revise the Municipal Code. When he retired as judge of the superior court in 1909, Mathieu became a much-sought-after legal adviser. In the course of his career he received a number of distinctions. The governor general bestowed a qc on him in 1880, and in the same year that he was appointed professor of law the Université Laval gave him an honorary doctorate.\n\nOne of the outstanding jurists of his time, Michel Mathieu not only carried out important duties in the Montreal legal community as a judge and professor of law, but also played a notable role in the development of a Quebec legal literature. He founded a periodical and was the author of several volumes, but it was especially as a commentator on judicial rulings that he distinguished himself. His many works ensured that jurisprudence would be disseminated and undoubtedly helped to stabilize law in the period immediately following the codification of the civil laws in Lower Canada.\n\nSylvio Normand"}, {"url": "https://constitutioncenter.org/blog/10-u-s-presidents-who-also-worked-as-teachers", "page_content": "On National Teacher Day, Constitution Daily looks at 10 Presidents who were teachers in some capacity before they occupied the White House - including one who later married his own teacher.\n\nThe most common occupation among the Presidents is lawyer, with 25 future Presidents practicing the law in some capacity. But as you’ll see below, more than a few Presidents paid partly for their legal educations while working as educators.\n\nOur list of “presidential teachers” starts with the second President.\n\nJohn Adams\n\nJohn Adams taught for a brief period after graduating from Harvard. Adams taught in at a Latin school in Worcester, to earn money to pay for his legal education.\n\nJohn Quincy Adams\n\nJohn Quincy Adams was as a professor at Harvard University from 1806 to 1809, and he also lectured at Brown University. Adams taught oratory and logic classes.\n\nMillard Fillmore\n\nNot only was Fillmore a teacher at one point, he married his own teacher! In 1819 the 19-year-old Fillmore attended a school for several months, and he eventually married his teacher, who was two years older than Fillmore. Fillmore then taught elementary school to help pay for his law school tuition.\n\nJames Garfield\n\nHis first occupation was as a part-time teacher in rural schools in Ohio. Garfield later taught penmanship at the same Vermont academy, the North Pownal Academy, that also employed Chester Alan Arthur as an instructor, and he taught at the Western Reserve Eclectic Institute in Ohio.\n\nChester Alan Arthur\n\nAfter graduating from Union College, Arthur spent several years teaching school and studying the law until he passed his bar exam.\n\nGrover Cleveland\n\nHe was a teacher at the New York Institute for the Blind in Manhattan before deciding to pursue a law career.\n\nWilliam Howard Taft\n\nBetween 1896 and 1900 Taft was the first dean and a professor of constitutional law at the University of Cincinnati. After failing in his 1912 re-election bid, Taft became the Chancellor Kent Professor of Law and Legal History at Yale Law School, before returning to public service as a Supreme Court justice.\n\nWoodrow Wilson\n\nAfter graduating from Princeton University, the University of Virginia Law School, and Johns Hopkins University, Wilson entered into a prestigious academic career. He was named president of Princeton in 1902 before he went into politics.\n\nLyndon Baines Johnson\n\nAs a student at Southwest Texas State Teachers College, Johnson was assigned to a tiny Hispanic school in a deeply impoverished area, where he thrived. Johnson left his brief career as a teacher to pursue politics during the Great Depression.\n\nBarack Obama\n\nFrom 1992 until his election to the U.S. Senate in 2004, Obama served as a lecturer at the University of Chicago Law School. He was a Lecturer from 1992 to 1996. He was a Senior Lecturer until 2004."}, {"url": "https://www.edweek.org/technology/teachers-politics-and-social-media-a-volatile-mix/2020/03", "page_content": "In an increasingly divisive political climate, a teacher might think twice before tweeting or posting other social media takes on hot-button issues.\n\nLegally, teachers have the right to talk about politics or other controversial topics on social media, and many do. Teachers say they don’t want to be restricted from sharing their opinions, and some say that teaching itself is inherently political. After all, many policies and campaign-trail promises directly affect teachers’ working—and personal—lives.\n\n\"[Teachers] have a right to their political opinions, and they have a right to engage in political speech,” said David Hudson, Jr., a law professor at Belmont University in Nashville, Tenn., and a First Amendment Fellow for the nonpartisan Freedom Forum Institute. “Political speech is the core expression that the First Amendment was designed to protect.”\n\nEven so, many teachers do shy away from sharing political opinions on Twitter or Facebook for a range of reasons: They want to preserve their objectivity in front of their students. They don’t want to hurt their relationships with parents, students, or colleagues who might have different beliefs than they do. They worry about professional repercussions, especially when posting from an account that they use for work-related reasons.\n\nAnd, on a not-infrequent basis, headlines pop up where a teacher is disciplined for something he or she said online.\n\n“The type of online speech that most gets public school teachers in trouble is speech that is very negative about their students, fellow teachers, or principals,” Hudson said. “The courts will find even if it does touch on a matter of public concern, it’s very disruptive to the workplace.”\n\nTexas high school English teacher Georgia Clark was fired last June after sending a series of tweets directed to President Donald Trump’s Twitter account, asking him to “remove the illegals from Fort Worth” and saying that her school district was “loaded” with and her high school had been “taken over by” undocumented students from Mexico. Clark later said she thought her tweets were private messages to Trump.\n\nTexas Education Commissioner Mike Morath ruled in November that Clark should either be reinstated with back pay, or receive one year’s salary in lieu of getting her job back. A report from an independent examiner had recommended that Clark be reinstated, saying that her tweets “are statements of a citizen on a matter of public concern protected by the United States Constitution and do not contravene or impair policies or proper performance of the district’s functions.”\n\nThe Fort Worth school district has challenged the education agency’s decision in a case that’s currently waiting to be heard by a district court.\n\n“We stand by our decision because we firmly believe this is in the best interests of all students,” Superintendent Kent P. Scribner says in a statement. More than 60 percent of students in the district are Hispanic.\n\nMeanwhile, a high school teacher in Milwaukee was placed on leave last month for a tweet about conservative political commentator Rush Limbaugh’s advanced-stage cancer diagnosis. Travis Sarandos, who teaches creative writing and journalism, tweeted “rush limbaugh absolutely should have to suffer from cancer. it’s awesome that he’s dying, and hopefully it is as quick as it is painful.”\n\nA spokeswoman for the district said Sarandos is still on leave pending further investigation.\n\nAs the presidential campaign escalates and the news of the day becomes increasingly partisan, teachers have to ask themselves: Where should they draw the line when it comes to posting about politics online?\n\nIn 1968, the U.S. Supreme Court ruled 8-1 in favor of a public school teacher who was fired for publishing a letter to the editor that criticized the school board’s allocation of funds between educational and athletic programs. The decision in Pickering v. Board of Education held that public school employees do not forfeit their First Amendment rights and are able to publicly weigh in on issues of public importance or concern.\n\n\"[When] the fact of employment is only tangentially and insubstantially involved in the subject matter of the public communication made by a teacher, we conclude that it is necessary to regard the teacher as the member of the general public he seeks to be,” wrote Justice Thurgood Marshall in his majority opinion.\n\nBalancing Act\n\nThat ruling also established what is now known as the Pickering balancing test, in which the court weighs the employee’s interest in commenting upon matters of public concern and the employer’s interest in “promoting the efficiency of the public services it performs.”\n\nIn other words, a teacher cannot publicly say something so offensive or inflammatory that it impacts her ability to do her job and educate students.\n\n“Speech that directly impugns students, fellow teachers, or administrators—that’s not going to fare well in the balancing test,” Hudson said. “Speech that would represent a direct affront to basic decency and dignity—that’s going to be a problem as well.”\n\nThe courts will have to decide where Clark’s tweets about undocumented students fall in the balancing test, Hudson said: On one hand, the tweets are addressing a matter of public concern—immigration—but the district has a “plausible argument” that the tweets could have been disruptive to school operations.\n\nEven teachers without tenure protections who are in at-will employment states have free speech protections, Hudson said. That said, he added, it can be a tough road for public employees to assert retaliation claims. And for some teachers, it’s better to be safe than sorry.\n\n“You don’t want to post something that’s going to blow up in your face, that’s going to get the community against you, or get administrators on your back,” said a band director in the metro Detroit area who asked to remain anonymous in order to speak candidly.\n\nBefore she received tenure, she said, she was “chastised” a couple times by administrators for things she had posted about local politics and school board elections online.\n\n“They’re dangling tenure in your face,” she said.\n\nSince the rise of social media has amplified speech, these debates about teachers’ ability to post political opinions online are happening more frequently, Hudson said.\n\n“I think it’s exploding all over the place,” he said. “A lot of them never reach the courts, but these controversies happen all across the country.”\n\nChristina Torres, an 8th grade English teacher at a private school in Honolulu, frequently tweets about her views on education, politics, race, and other social issues, as well as her personal life, including her struggles with anxiety. Her Twitter feed is so candid that Torres, who has written opinion essays for Education Week, pinned a tweet to her profile page saying that she doesn’t mind if students see her “nerd convos.”\n\nEven so, she’s careful about how she words some of her political tweets. Torres has posted about how she donated to Sen. Elizabeth Warren’s campaign for the Democratic presidential nomination, but she tries to avoid attacking other candidates in an inflammatory way. Instead of making a value judgement, Torres said she tries to present an informed argument about why she agrees or disagrees with someone.\n\nAfter all, some of her students support Trump, and Torres said she doesn’t want to make them feel unsafe in her classroom.\n\n“I would never make human judgements based on someone’s political views publicly,” she said. “I would never say you’re a bad person because you believe X, because I don’t want my students to see that and think they’re bad people.”\n\nStudents Paying Attention\n\nTeachers are conscious that their students might be looking them up online. Keith Mahoney, a 6th grade social studies teacher in Oakland, Maine, said he refrains from sharing his political views online, because he doesn’t want his students to learn them. He wants them to form their own opinions instead.\n\n“They look to me as a leader in the classroom as an adult and model what I’m doing,” he said. “I don’t want them to be a mouthpiece for whatever they’re hearing from Mr. Mahoney.”\n\nStill, many teachers say that education is political. Teachers can draw connections from their classroom to debates on taxes, health care, the economy, immigration, and more.\n\n“We all see the same needs in our schools,” said one educator in Houston who asked to remain anonymous given the sensitivity of the issue. “It’s just we have different opinions on how to mitigate them and how to approach them and solve them.”\n\nAccording to a 2017 nationally representative Education Week Research Center survey, 31 percent of educators described themselves as Democrats, 30 percent as independents, and 27 percent as Republicans. That breakdown can make it tricky for all teachers to feel comfortable sharing their beliefs online.\n\n“In a profession where most people don’t agree with me politically, you sort of do learn to keep your mouth shut just to get along a little easier,” said a conservative high school science teacher in Maryland who asked to remain anonymous in order to speak candidly.\n\nAfter the 2016 election, one of his former colleagues yelled at him in the faculty room for his political beliefs. That experience made him hesitant to post about anything political online where his colleagues might see it. He enjoys political conversations, but has found it’s easier to have them offline with friends.\n\nThis campaign cycle, “I find it’s easier to just say nothing and try not to offend or upset anybody, rather than take a viewpoint,” the teacher said. “Nobody’s convinced by a Facebook argument—all you end up doing is upsetting people.”\n\nHow Willing Are Teachers to Talk Politics Online?\n\nIn an increasingly divisive climate, teachers might think twice before posting political opinions on Twitter or Facebook. Education Week asked educators if they talk about politics or controversial issues on social media. Here are some of their responses:\n\nI do, but it is more of my take on it. I don’t debate others or try to attack anyone. Just mainly state facts and follow the news. — Michael Rais (@mraisbass) February 27, 2020\n\nI think today’s politics are an important topic to discuss. Just because we’re teachers doesn’t mean we’re forbidden from having opinions. If you stay silent, you’re supporting the oppressor, as a few famous folks have said. — Josie De (@josieteachesart) February 26, 2020\n\nI personally don’t but not because I’m a teacher. I don’t see why we shouldn’t. We have our opinions too just like an other person in any other profession. We have a right to express our opinions and should do so if that’s what we choose. — Peyton Black (@PeytonBteaches) February 26, 2020\n\nNo, I’m of the school of thought that you remain impartial in the public forum and in the classroom to help our students develop their own thoughts and opinions without indoctrination. — Keith Mahoney (@KMaho16) February 26, 2020"}, {"url": "https://www.brusselstimes.com/141389/belgian-mr-bean-top-official-dragged-over-incomprehensible-dutch-mathieu-michel-brother-father-charles-louis-spoken-dutch-state-secretary-digital-affairs", "page_content": "Mathieu Michel being sworn in as state secretary for the digital agenda. © Belga\n\nFirst-time Federal State Secretary Mathieu Michel is making a splash over his general policy note presentation, with criticism of its contents upstaged by what some have called Michel's \"incomprehensible\" spoken Dutch.\n\nLawmakers and Twitter users alike have swarmed on Michel's address to the Chamber on Wednesday evening, slamming him over his poor knowledge of one of the official languages of the country.\n\n\"Mathieu Michel is a little bit like our Belgian Mr Bean,\" one Twitter user wrote as he shared a video of the state secretary for digital affairs stammering, switching to French and struggling to find his words as he unveiled his policy vision in Dutch.\n\n\"At this level, this is clearly incomprehensible,\" wrote another user, saying Michel's grasp on Dutch was embarrassing, while another said that, with each word, the francophone liberal (MR) \"gave 5% more to the Flemish nationalists.\"\n\nBack in October, Michel's arrival at the highest levels of the Belgian government raised eyebrows, with many pointing out his lack of experience outside regional politics as well as his family ties.\n\nMichel is the younger brother of Belgium's former prime minister, Charles Michel, now the president of the EU Council. Their father is Louis Michel, a former Belgian deputy prime minister and EU Commissioner, now an MEP.\n\nMichel, who on Wednesday went over questions of online privacy, was also criticised over his statements on social media's role in shaping discussions about Belgium's politics.\n\nMedia and opposition MPS zoomed in on Michel's awkwardly-delivered affirmations that social media was unfit for political debate.\n\n\"Mathieu Michel, son of Louis, brother of Charles (...) finds that social media is not euh... the place to talk about politics uh... allez... to discuss,\" one user tweeted.\n\nGeorges-Louis Bouchez, the president of Michel's ruling MR party, came out in his defence, clapping back at the who ran with that lead for \"taking [Michel's] words out of context.\"\n\nGabriela Galindo\n\nThe Brussels Times"}, {"url": "https://prabook.com/web/michel.mathieu/2073682", "page_content": "Michel Mathieu\n\npolitician\n\nJuly 25, 1944 (age 66) Montpellier, Arrondissement of Montpellier, France\n\nMathieu was born in Montpellier. Previously he was the High Commissioner of the Republic in French Polynesia (Le Haut-Commissaire de la République en Polynésie française) from 17 November 2001, to 30 July 2005, when he was succeeded by Jacques Michaut. He died in 2010."}, {"url": "https://www.theatlantic.com/education/archive/2013/11/the-principal-the-most-misunderstood-person-in-all-of-education/281223/", "page_content": "ecastro/flickr\n\nA few years ago when I walked the hallways of a high school with my five-year-old niece Evie, she remarked, without prompting: “There’s the principal’s office: you only go there if you are in trouble.” As an educator and an aunt, I wondered how the office of an educational professional had come to be symbolized in such a decisive way in the mind of a child, particularly a child who had yet to enter formal schooling. As I scanned popular representations of the school principal, I found that Evie’s impression was hardly unusual. Across popular and professional cultures, the figure of the school principal is commonly reduced to a small, often disagreeable functionary of bad news, the wet blanket of progressive teacher practice, the prison guard of students’ freedom. As I asked friends and colleagues about their impressions of school principals, few actually knew what principals did, and many people confused the role of school building principal with school district superintendent. Most remarkably, those very people who did not understand what a principal did were often the first to argue for the abolition of the role.\n\nIn American public schools, the principal is the most complex and contradictory figure in the pantheon of educational leadership. The principal is both the administrative director of state educational policy and a building manager, both an advocate for school change and the protector of bureaucratic stability. Authorized to be employer, supervisor, professional figurehead, and inspirational leader, the principal’s core training and identity is as a classroom teacher. A single person, in a single professional role, acts on a daily basis as the connecting link between a large bureaucratic system and the individual daily experiences of a large number of children and adults. Most contradictory of all, the principal has always been responsible for student learning, even as the position has become increasingly disconnected from the classroom.\n\nThe history of the principal offers even more contradictions. Contemporary principals work in the midst of unique modern challenges of ever-changing fiscal supports, school law and policy, community values, and youth culture. At the same time, the job of the contemporary principal shares many of the characteristics of their predecessors two centuries ago. While social and economic contexts have changed, the main role of the principal has remained essentially the same over time: to implement state educational policy to the school and to maneuver, buffer, and maintain the stability of the school culture at the local level.\n\nAn unknown female teacher and a male administrator (Smith Library of Regional History, Oxford, Ohio)\n\nThe reason for this paradoxical history of change and constancy is that even as the broader context of education has changed over the past two centuries, the core purpose of the school principal has remained embedded in the center of the school organizational structure. Located between the school and the district, and serving both, the principal has historically been a middle manager who translates educational policy from the central office to the classroom. Assigned both to promote large-scale initiatives and to solve immediate day-to-day problems, the principal has always carried multiple and often contradictory responsibilities, wearing many hats, and moving swiftly between multiple roles in the course of one day. This mobile, multitasking role has always described the work of the principal, even as the nature of those tasks has radically changed.\n\nThe complex role of the principal is not an accidental by-product of history; rather, the principal’s position at the nexus of educational policy and practice was an intentional component of the role when it was originally conceived. Indeed, of the many organizational changes that took place in public education in North America at the turn of the last century, few had greater impact on the school than the development of the principalship. The creation of the principal’s office revolutionized the internal organization of the school from a group of students supervised by one teacher to a collection of teachers managed by one administrator. In its very conception, the appointment of a school-based administrator who was authorized to supervise other teachers significantly restructured power relations in schools, reorienting the source of authority from the classroom to the principal’s office. Just as significant was the role that the principal played as a school-based representative of the central educational office. Created as a conduit between the district and the classroom, the principal became an educational middle manager in an increasingly complex school bureaucracy.\n\nThe introduction of the principal’s office radically changed the overall machinery of how public education was delivered from central authorities to the classroom. Located as the connecting hinge between the school and the district, the principal was critical to the success of newly designed school systems in the early 20th century, in much the same way that the creation of middle managerial structures in business in the same period helped to consolidate the control of independent enterprises under a corporate umbrella. Modern administrative practices, including scientific management, greased the wheels of this development in late 19th-century American business, providing managerial techniques, a hierarchical decision-making structure, and an occupational culture of rationality. In the business world, middle managers were the engine behind the expansion of corporate bureaucracy, providing the smooth transition of responsibilities from the central office to the shop floor.\n\nLike the foreman in the factory and the mid-level executive in the office building, the position of school principal was designed to be an administrator who was responsible for day-to-day building operations rather than strategic policy decisions. Standing between the district and the classroom, principals were, as sociologist C. Wright Mills described such white-collar positions, “the assistants of authority” whose power was derived from others and who were responsible for implementing managerial decisions but had limited opportunities for influencing those decisions. Like other middle managers, the principal had a “dual personality,” standing “on the middle ground between management and employee,” as both a loyal sergeant to a distant supervisor and a local administrator who had to negotiate with workers in order to get the job done properly. The National Education Policy Center’s Larry Cuban aptly describes principals’ historic and contemporary role as “positioned between their superiors who want orders followed and the teachers who do the actual work in the classrooms.” Principals’ loyalties, Cuban argues, “are dual: to their school and to headquarters.”\n\n“The Super-Vision Demanded”: an illustration from the March 1928 issue of Childhood Education\n\nThe historical development of the principal reflects the growing pains of an emerging state school bureaucratic system. Through the mid-20th century, the principalship was an inconsistently defined position, as often a teacher with administrative responsibilities as an administrator who supervised teachers. These early principals were flexible teacher leaders who maintained a close connection with classroom work and the school community in ways that might delight contemporary educators who feel burdened by bureaucracy. But for all the freedom offered by such positions, early principals suffered from the absence of an administrative scaffold to support their work.\n\nAt the turn of the 19th century, as educational reformers built up the bureaucratic framework of the state and local public school system, they realigned the primary attention of the principal from the classroom to the central administrative structure. This professionalization process involved proscribing lines of authority and accountability, establishing entry requirements and academic training, and improving compensation for the work. While professionalization improved the stature of the principal’s office, it restricted the types of people who sat in that office, increasingly excluding women, people of color, and educators who prioritized community engagement over administrative tasks. Indeed, through the mid-20th century a majority of elementary principals were women, and the totality of principals of segregated African American schools were black. The professionalization process changed all that, as it also formalized the division between teachers and administrators, between doing education and supervising education, between classroom and office, body and mind, experience and intellect, and between women and men. The irony of professionalization is that it emphasized the identity of the principal as an administrator in the middle of an educational bureaucracy and not an educator in the middle of the school house.\n\nAs the principalship evolved away from the classroom to the administrative office, the principal became less connected with student learning, and yet more responsible for it. Isolated in the new principal’s office, the role of school head changed from instructing students to supervising teachers of students. Further complicating the principal’s role in the mid-20th century was that as public education became more responsive to and reflective of the public, principals were swept up in changes initiated by state and federal governments, legal requirements, and the increasing demands of local communities. Modern principals came to have less to do with student learning and more to do with upholding administrative structures and responding to public pressures.\n\nYet by the nature of their background and role as educators, principals have always been concerned with student learning, and principals across time have played a pivotal role in shaping the educational culture of schools. Middle management, after all, is a multifaceted role that can open up both possibilities and constraints, and some school principals in the past and present have been able to initiate progressive educational practices in their schools, often in spite of bureaucratic restraints. Indeed, across history, many principals’ own vision of student learning has adapted to community needs and student interests. For all those efforts, however, the history of the principalship is marked by an increasing discrepancy between the popular image and the actual work of the position. Ironic too, is the dominant image of the principalship with an office, given the great variety, mobility, human interactions, and community relations of principals’ work.\n\nThis post is adapted from Kate Rousmaniere's The Principal's Office."}, {"url": "https://www.britannica.com/biography/Lee-Kuan-Yew", "page_content": "Lee Kuan Yew, (born September 16, 1923, Singapore—died March 23, 2015, Singapore), politician and lawyer who was prime minister of Singapore from 1959 to 1990. During his long rule, Singapore became the most-prosperous country in Southeast Asia.\n\nLee was born into a Chinese family that had been established in Singapore since the 19th century. His first language was English, and only upon entering politics did he acquire a command of Chinese as well as Malay and Tamil. After attending school in Singapore, Lee briefly enrolled at the London School of Economics and Political Science before earning a law degree (1949) at Fitzwilliam House, Cambridge. There he headed the honours list. He also became a socialist. Although he was admitted (1950) to the English bar, he returned to Singapore. Appointed legal adviser to the Postal Union, he participated in negotiations to obtain higher wages for postal workers and subsequently did similar work for other trade unions.\n\nSingapore was a British crown colony and the site of Britain’s principal naval base in East Asia, which was ruled by a governor assisted by a legislative council. The council’s members consisted primarily of wealthy Chinese businessmen, most of whom were appointed rather than elected. When, in the early 1950s, constitutional reform was in the air in Singapore, Lee formed an alliance with two other political newcomers—David Saul Marshall, a lawyer, and Lim Yew Hock, a trade unionist—to challenge the hold of the businessmen on the council. Lee, however, soon broke with his two colleagues to take a more radical stand, becoming secretary-general of his own party, the People’s Action Party (PAP). The party included some communists, Lee having accepted communist support for some years.\n\nIn 1955 a new constitution was introduced that increased the number of elected seats on the council to 25 out of a total of 32. In the elections, the Labour Front, founded by Lee’s former colleagues, won 13 seats, while the PAP won 3—one of which, for a district inhabited by many of the poorest Chinese in Singapore, was won by Lee.\n\nThe following year Lee returned to London as a member of a Singaporean delegation that unsuccessfully sought self-rule for the colony. Unrest in Singapore followed, during which a number of PAP leaders were imprisoned. In 1957 negotiations in London resumed, again with Lee on the delegation. After agreement was reached on a measure of self-government, Lee won a by-election in Singapore by an overwhelming majority. A brief power struggle within the PAP then ensued: in August Lee was ousted from the secretary-generalship by the party’s left wing, but he regained his post in October.\n\nThe next year (1958) in London, Lee helped negotiate the status of a self-governing state within the Commonwealth for Singapore. Elections were held under Singapore’s new constitution in May 1959, and Lee campaigned on an anticolonialist, anticommunist platform calling for social reforms and eventual union with Malaya. Lee’s party won a decisive victory, gaining 43 of the 51 seats, but Lee refused to form a government until the British freed the left-wing members of his party who had been imprisoned in 1956. After their release, Lee was sworn in as prime minister on June 5, 1959, and he formed a cabinet. He introduced a five-year plan calling for slum clearance and the building of new public housing, the emancipation of women, the expansion of educational services, and industrialization. In 1961 the PAP’s left-wing members broke away from the party to form the Barisan Sosialis (“Socialist Front”), and Lee subsequently broke his remaining ties with the communists. Henceforth Lee and his fellow moderates within the PAP would dominate Singaporean politics.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nIn 1963 Lee took Singapore into the newly created Federation of Malaysia. In elections held soon afterward, the PAP retained its control of Singapore’s Parliament, and Lee thus continued as prime minister. In 1964, however, he made the mistake of entering his party, 75 percent of whose members were Chinese, in the Malaysian national elections. The growing tension between Chinese and Malays resulted in communal rioting in Singapore itself. In August 1965 Lee was told by his Malaysian colleagues in the federal government that Singapore must leave the federation. Although Lee passionately believed in the multiracialism that the federation represented, Singapore had to secede. It then became a sovereign state with Lee as its first prime minister.\n\nLee’s principal aims were to ensure the physical survival of the new state and to retain Singapore’s national identity. Surrounded by more powerful neighbours (including China and Indonesia), Lee did not press for the immediate withdrawal of Commonwealth forces from Singapore. Instead, he sought to phase them out slowly and to replace them with a Singaporean force locally trained and patterned on the Israeli model.\n\nMore importantly, Lee recognized that Singapore needed a strong economy in order to survive as an independent country, and he launched a program to industrialize Singapore and transform it into a major exporter of finished goods. He encouraged foreign investment and secured agreements between labour unions and business management that ensured both labour peace and a rising standard of living for workers. While improving health and social welfare services, Lee continually emphasized the necessity of cooperation, discipline, and austerity on the part of the average Singaporean.\n\nLee’s dominance of the country’s political life was made easier when the main opposition party, the Barisan Sosialis, decided to boycott Parliament from 1966. As a result, the PAP won every seat in the chamber in the elections of 1968, 1972, 1976, and 1980, after which opposition parties managed to claim one or two seats. Lee sometimes resorted to press censorship to stifle left-wing dissent over his government’s fundamental policies.\n\nLee brought his country an efficient administration and spectacular prosperity at the cost of a mildly authoritarian style of government that sometimes infringed on civil liberties. By the 1980s Singapore under Lee’s guidance had a per capita income second in East Asia only to Japan’s, and the country had become a chief financial centre of Southeast Asia.\n\nThe PAP won the general elections of 1984 and 1988, and Lee remained prime minister, though the question of the succession of leadership became an issue during that decade. After satisfactorily arranging the succession, Lee resigned the office of prime minister in November 1990, though he remained the leader of the PAP until 1992.\n\nLee’s successor as prime minister, Goh Chok Tong, named Lee to the cabinet position of senior minister, from which Lee continued to exercise considerable political influence. Upon Goh’s resignation as prime minister in 2004 (he was succeeded by Lee’s son Lee Hsien Loong), Goh became senior minister. The elder Lee remained in the cabinet as “minister mentor,” a position he held until 2011, when he finally stepped down from the cabinet. He held his seat in Parliament until his death, however, winning reelection in 1991, 1997, 2001, 2006, and 2011."}, {"url": "https://www.nytimes.com/2022/11/05/us/desantis-high-school-teacher-georgia.html", "page_content": "Ms. Minis, who is white and was in the same history class as Ms. Pompey, also remembers debating issues around the Civil War. Mr. DeSantis wasn’t so much politically opinionated, she said, but, in her view, factually wrong. She remembers him claiming that every city in the South had burned, even though she knew her hometown, Savannah, had not and she called him out on it.\n\nAnother student who requested anonymity because he feared repercussions for his job said Mr. DeSantis’s takes on the Civil War were the subject of so much talk that students made a satirical video about him at the time for the video yearbook.\n\nThe video, which was reviewed by The Times, includes a short snippet in which a voice purporting to be Mr. DeSantis is heard saying: “The Civil War was not about slavery! It was about two competing economic systems. One was in the North. …” while a student dozes in class. (A student voiced the role of Mr. DeSantis, because students did not have any actual footage of him, according to a student who helped put it together.)\n\nAbortion was another issue that came up in class at least once, according to Matthew Arne, a former student. Mr. Arne, who was a senior, said students talked among themselves about Mr. DeSantis expressing his strict belief that abortion was wrong. He said it troubled him when his girlfriend, who was in Mr. DeSantis’s history class, told him about what Mr. DeSantis had said. He had grown up in California, he said, and disagreed with Mr. DeSantis’s stance.\n\n“He’s pretty much held fast to what he believes in,” Mr. Arne said. Ms. Minis added that he always seemed to have his eye on the future. “He seems like someone who, as a young person, was in it for the long game,” she said.\n\nSeveral students described Mr. DeSantis as having an air of superiority.\n\n“Mr. DeSantis was kind of a smug guy,” Mr. Arne said. Students were well aware that he had just graduated from Yale, he said. “It was like a, ‘I’m kind of better than you,’” he said. “And we were all just kids.”\n\nSeveral students recalled that Mr. DeSantis was a frequent presence at parties with the seniors who lived in town. Most spoke about socializing with him on the condition of anonymity because they feared backlash for speaking publicly about it."}]}