{"In the 2003 provincial election, Michel Mathieu defeated Liberal incumbent Yves Séguin.": [{"url": "https://en-academic.com/dic.nsf/enwiki/1338922", "page_content": "The Manitoba Liberal Party fielded a full slate of 57 candidates in the 2003 provincial election, and won two seats to remain as the third-largest party in the legislature. Some of the party's candidates have their own biography pages; information on others may be found here.\n\nThis page also provides information for candidates in by-election s between 2003 and 2007.\n\nVaughn Ramsay (Arthur-Virden)\n\nRamsay is a farmer. He campaigned for the Liberal Party of Canada in the 1979 federal election, and finished third. [ [ http://www.parl.gc.ca/information/about/process/house/hfer/hfer.asp?Language=E&Search=Cresdetail&Election=1942 Canadian federal election, 1979: Brandon-Souris ] , History of Federal Ridings since 1867, Elections Canada , accessed 6 December 2006.] He served as Mayor of Waskada, a village in southwestern Manitoba of fewer than 300 people, from 1992 to 2006. In 1998, he expressed concern that a proposal to close the local school could result in the destruction of his community. [Bradley Bird, \"Waskada School under review\", \"Winnipeg Free Press\", 7 March 1998, A6.] The school remained open, although the closure of N.M. Paterson & Sons grain elevator the following year was a setback for the local economy. [\"Elevator closure a blow for town\", \"Winnipeg Free Press\", 24 June 1999, p. 6.] He did not run for re-election in 2006.\n\nMonique Graboski (Assiniboia)\n\nGraboski is a former executive director of Manitoba Environmental Industries Association Inc., a representative body of more than three hundred environmental companies and agencies in Manitoba. [Roger Newman, \"Romancing the green sector\", \"Manitoba Business\", 1 April 1997, S2.] She is also past president of the Board of Directors for the Women's Health Research Foundation of Canada. [\"Liberal slate expands\", \"Winnipeg Free Press\", 26 February 2003, B1.] Graboski was fifty years old in 2003, and was administrative co-ordinator for a lumber firm in the Inkster Industrial Park. [Aldo Santin, \"NDP in fight for hard-won seat\", \"Winnipeg Free Press\", 24 May 2003, A11.] She received 657 votes (8.05%) for a third place finish against New Democratic Party incumbent Jim Rondeau , whom she had voted for in the previous election. As of 2006, Graboski is a marriage commissioner in Winnipeg . [ [ http://www.mts.net/~quin52/ Lady Commissioner ] , Winnipeg Weddings, accessed 20 December 2006.]\n\nScott Brigden (Brandon East)\n\nBrigden received 274 votes (4.39%), finishing third against New Democratic Party incumbent Drew Caldwell .\n\nCandace Sigurdson (Brandon West)\n\nSigurdson was a businesswomen in Brandon at the time of the election, owning a custom window coverings design business. [Mia Rabson, \"Brandon West epitomized political winds of change\", \"Winnipeg Free Press\", 1 June 2003, A7.] She received 346 votes (4.05%), finishing third against New Democratic Party incumbent Drew Caldwell .\n\nTony Sanchez (Burrows)\n\nSanchez is a past director of the Philippine Association of Manitoba, and a founding member of the Filipino Canada Toastmaster Club. [\"Sanchez nominated\", \"Winnipeg Free Press\", 28 February 2003, B1.] He was a provincial civil servant in the 1990s. He sought the federal New Democratic Party nomination in Winnipeg North Centre for the 1993 federal election, but lost to Maureen Hemphill on the final ballot. [Brad Oswald, \"Hemphill wins nod for North Centre seat\", \"Winnipeg Free Press\", 22 March 1993. Hemphill defeated Sanchez by a vote of 441 to 220. Cyril Keeper and Julie Friesen were also candidates.]\n\nSanchez received 1,252 votes (21.58%) in 2003, finishing second against New Democratic Party incumbent Doug Martindale .\n\nWalt Roberts (Elmwood)\n\nRoberts received 748 votes (12.47%), finishing third against New Democratic Party incumbent Jim Maloway .\n\nGerry Sankar ( Fort Whyte )\n\nSankar has long been active in organizing multicultural events in Winnipeg. He was president of the Sanatan Dharma Maha Sabha Cultural Organization of Manitoba in the 1990s, and attempted to bring together various cultural groups through events such as the Parade of Cultures (\"Winnipeg Free Press\", 4 June 1993). The group's 1997 parade included Serbian dancers, calypso music, East Indian singing and dancing, Ukrainian dancers and other events (\"WFP\", 24 September 1997). Sankar also organized the Indo Tropical Paradise pavilion for Winnipeg's 2002 Folklorama event, celebrating the East Indian culture of the Caribbean (\"WFP\", 7 August 2002).\n\nHe received 1,803 votes (19.16%) in 2003, finishing third against Progressive Conservative incumbent John Loewen .\n\nBrian Head (Kirkfield Park)\n\nHead was 57 years old at the time of the election, and had been a resident of St. James in Winnipeg for forty-three years. He had worked as a teacher in the area since 1969 . As of 2003, he was principal of continuing education for the St. James School Division and principal of the Stevenson Britannia Adult Learning Centre. [ http://www.mbteach.org/provincialelection/provelecteachrun.htm ] In the early 2000s , he coordinated a piloting program for high school students in the division (\"Winnipeg Free Press\", 1 August 2000). He received 2,042 votes (22.22%), finishing third against Progressive Conservative leader Stuart Murray .\n\nMary Lou Bourgeois (Point Douglas)\n\nBourgeois received 547 votes (14.23%), finishing second against New Democratic Party incumbent George Hickes.\n\nMurray Cliff (Radisson)\n\nCliff received 624 votes (8.42%), finishing third against New Democratic Party candidate Bidhu Jha .\n\nKristopher Ade (Riel)\n\nAde is a past president of the Young Liberals of Canada (Manitoba) . He has worked in the office of former cabinet minister Reg Alcock . As a high school student, Ade won the World Individual Debating and Public Speaking Championships in 2000, and also represented Canada at the World Schools Debating Championships .\n\nAde placed third against New Democrat Christine Melnick with 671 votes.\n\nEd Kolodziej (St. Johns)\n\nKolodziej was born and raised in Winnipeg 's north end, and is listed as holding a Bachelor's Degree in Economics from the University of Winnipeg . [ http://newwinnipeg.com/news/election2003/r_stjohns.htm ] As of 2004 , he was a director of Entegra Credit Union and a property assessor for the province. [ http://www.entegra.ca/public/bins/content_page.asp?cid=4-22-28 ]\n\nHe received 745 votes (12.77%), finishing second against New Democratic Party incumbent Gord Mackintosh .\n\nBetty Ann Watts (Transcona)\n\nWatts was a trustee in the Transcona-Springfield School Division from 1989 to 1998, and served as its chair prior to the 1998 municipal election (in which she was not a candidate). She supported greater parental involvement in school activities, and played an organizational role in Ukrainian language bilingualism programs. [\"Parental involvement gets passing grade\", \"Winnipeg Free Press\", 16 April 1994; Mike Maunder, \"Steps being taken to improve safety around schools\", \"Winnipeg Free Press\", 26 October 1995, 1.] In 1996, she was elected chair of the Manitoba Multicultural Resources Centre. [\"Centre elects officers\", \"Winnipeg Free Press\", 12 November 1996, A6; \"Students mourning death of classmate\", \"Winnipeg Free Press\", 15 November 1997, A6.]\n\nWatts has campaigned for the Manitoba Liberal Party in two elections. She has also worked as Managing Editor for \"The Cottager\" magazine, and coordinated the 2007 Magazines Mean Business conference. [ [ http://www.manitobamagazines.com/pro_dev.aspx Magazines means business - a learning curve ] , Manitoba Magazine Publishers Association, accessed 29 September 2007.]\n\nVal Mollison (Wolseley)\n\nMollison has worked as Manger of Communication Services for London Life Insurance Company and Great-West Lifeco Inc, and as a university lecturer. She was one of the first Liberal candidates nominated in 2003. [\"Great-West Lifeco Inc. announces result of the London Life Insurance Company Common Share Bid\", \"Canada NewsWire\", 16 July 1999, 18:06 report; \"Great-West Lifeco Inc. announces increased earnings [...] \", \"Canada NewsWire\", 22 July 1999, 12:27 report; \"In Brief\", \"Winnipeg Free Press\", 8 January 2003, A2.] She received 766 votes (12.52%), finishing third against New Democratic Party candidate Rob Altemeyer .\n\nJean Paterson (Fort Whyte by-election, 13 December 2005)\n\nPaterson was born in Montreal , Quebec , and has a Ph.D. from McGill University . She specializes in brain research, and had 27 years' teaching experience with the University of Manitoba at the time of the election. In 1994, she became the first woman to reach the rank of full professor in the university's Department of Human Anatomy. [Mia Rabson, \"All candidates support new high school in area\", \"Winnipeg Free Press\", 9 December 2005, A8.] She has been a member of the Fort Whyte Centre for Environmental Education, and secretary-treasurer of the Waverley West Residents' Association. [\"Grits nominate Paterson\", \"Winnipeg Free Press\", 8 October 2005, B10. She was 61 years old. See Mia Rabson, \"Fort Whyte vote called for Dec. 13\", \"Winnipeg Free Press\", 11 November 2005, A5.] She received 1,466 votes (21.63%), finishing third against Progressive Conservative candidate Hugh McFadyen .\n\nFootnotes"}, {"url": "https://www.cbc.ca/news/canada/conservatives-maintain-prairie-stronghold-1.711253", "page_content": "The Conservative party maintained its stronghold in the Prairie provinces in Tuesday's federal election.\n\nConservatives were elected in 27 of Alberta's 28 seats. They trailed briefly in Edmonton-Sherwood Park, where Independent candidate James Ford was up over Conservative Tim Uppal at one point in a tight race, but Uppal pulled ahead.\n\nIn Edmonton Strathcona, Conservative national caucus chair Rahim Jaffer was up against NDP candidate Linda Duncan, who was given a chance by some and was granted an early campaign visit by NDP Leader Jack Layton. The race was tight and going back and forth, with Duncan taking a slight lead and prevailing at the end.\n\nIn Saskatchewan, where 14 seats were up for grabs, Tories were elected in 13 ridings. Ralph Goodale's seat in Wascana was the only Liberal riding left in Saskatchewan in 2006, so he was a target of the Conservatives. This time around, he was up against Michelle Hunter, who ran unsuccessfully for the Saskatchewan Party in the 2003 provincial election.\n\nRalph Goodale was re-elected in his riding of Wascana. ((CBC))\n\nGoodale was elected.\n\nIn Saskatoon-Rosetown-Biggar, Conservative Kelly Block and NDP candidate Nettie Wiebe went back and forth all night, with Block finally prevailing.\n\nIn Manitoba, the Tories took nine seats, the NDP four and the Liberals one.\n\nThere are 56 seats in Alberta, Saskatchewan and Manitoba, and in 2006 the Conservatives had the lion's share at 49, with the Liberals holding four and the NDP three, so there were limited gains available for the Tories in the region.\n\nOilsands a major issue\n\nOne issue of a national scope played out before voters during the campaign: how the parties' environmental stances would affect future development of the oilsands in Alberta, an issue highlighted when NDP Leader Jack Layton flew over the area early in the election campaign.\n\nTo a lesser extent, the efforts of Stephen Harper's Conservative government to break the Canadian Wheat Board's monopoly over western barley sales could have shaped voters' actions.\n\nDespite the dominance of the Conservatives, there were a number of intriguing races in the Prairies.\n\nGerry Ritz, agriculture minister and minister for the Canadian Wheat Board, was fighting in the Saskatchewan riding of Battlefords-Lloydminster, and was re-elected. Ritz came under heavy criticism during the campaign after it was revealed he had joked in the summer about the listeriosis outbreak while on a conference call. He later apologized.\n\nIn Manitoba's Kildonan-St. Paul riding, former Liberal candidate Lesley Hughes was making a bid to win as an Independent. Liberal Leader Stéphane Dion fired Hughes in late September over an article she wrote six years ago as a freelance journalist. She had suggested Israeli intelligence warned the U.S. in advance of the Sept. 11, 2001, attacks on the World Trade Center, and that Israeli businesses left before hijacked airplanes destroyed the complex. Hughes was in third place behind the Tories and NDP. Joy Smith won the riding for the Tories.\n\nSeveral Tory cabinet ministers were running in the region, as was Harper, in Calgary Southwest. Harper pulled in more than 70 per cent of the vote early on and won handily.\n\n\"We accept this mandate ... and appreciate the trust voters have given us,\" Harper said Tuesday night.\n\nIndustry Minister Jim Prentice was elected in Calgary-Centre-North, Rona Ambrose (in charge of intergovernmental affairs and Western economic diversification, and president of the Privy Council) won in Edmonton-Spruce Grove, and Treasury Board President Vic Toews was declared in Provencher in Manitoba.\n\nJason Kenney, secretary of state for multiculturalism and Canadian identity, running in Calgary Southeast, took a staggering 75 per cent of the vote in 2006. He was nearing that percentage in early results Tuesday and won.\n\nFormer Reform party leader Preston Manning, left, watches election results with Conservative candidate Jason Kenney in Calgary. ((Jonathan Hayward/Canadian Press))\n\nAs for other cabinet ministers from the Prairies, Diane Ablonczy, secretary of state for small business and tourism, who was running in Calgary-Nose Hill, a suburban riding in Calgary's northwest, won easily again.\n\nThe Tories were projected to take 145 seats, short of the majority needed in the 308-seat House of Commons.\n\nAblonczy said the party had hoped for a majority.\n\n\"But we've said all along that we expected a minority,\" she told CBC News. \"We're very pleased with the very solid, very strong mandate that we've received tonight. And I think you'll see a Parliament that works much better going forward because the people have spoken. We now have a new mandate. We have some resolution of some issues. So I think that will be very positive for Canada.\"\n\nEyes were also on a couple of races that featured former professional athletes running for the Conservatives.\n\nIn the downtown riding of Winnipeg South Centre, former Winnipeg Blue Bombers kicker Trevor Kennerd was recruited to run against Liberal incumbent Anita Neville. But Neville held her seat.\n\nIn the northeast end of Winnipeg, another former pro athlete, long-time Winnipeg Jets captain Thomas Steen, ran in Elmwood-Transcona against strong NDP candidate Jim Maloway, who won seven straight elections in the Manitoba legislature before retiring. Steen came up short, with Maloway declared the winner.\n\nIn the riding of St. Boniface, Liberal incumbent Raymond Simard was expected to be tested by Conservative candidate Shelly Glover, a high-profile Winnipeg police spokesperson who is a 16-year veteran of the Winnipeg Police Service. Glover, however, won the race.\n\nIn Desnethé-Missinippi-Churchill River, a Saskatchewan riding, the race was made interesting after Dion's favoured candidate, Joan Beatty, lost in a nomination battle to David Orchard. Orchard, who ran unsuccessfully for the leadership of the former Progressive Conservative party in 1998 and 2003, lost to Conservative incumbent Rob Clarke, a former RCMP sergeant who took the seat in a March 2008 byelection.\n\n\"We had a very, very short time to start up, and when you're running against an incumbent, that's a very hard thing to do,\" said Orchard. \"But we worked very, very hard and we had nothing whatsoever to be ashamed of and we brought issues to the table that wouldn't have been brought there otherwise.\"\n\nAboriginal voters play a big role in Desnethé-Missinippi-Churchill River, and might have held the key to victory, some election observers believed.\n\nKeeper loses her seat\n\nChurchill, the seat held by Liberal and former North of 60 star Tina Keeper, went to NDP candidate Niki Ashton, who was back for a second run at the riding. Keeper had served as special adviser in the Liberal caucus for aboriginal outreach, and served as public health critic as well as heritage critic in the House of Commons, but ended up in a fight for second spot.\n\nAt 108 votes, Conservative Rod Bruinooge in Winnipeg South had the smallest margin of victory on the Prairies in the 2006 election when he bested former Liberal cabinet minister Reg Alcock. This time around, he defeated Liberal John Loewan, a former Manitoba MLA.\n\nIn the Saskatchewan riding of Palliser, Conservative incumbent Dave Batters did not run for re-election, citing a health issue. So former Moose Jaw mayor Ray Boughen was plucked to run for the Tories against another former Moose Jaw mayor, NDP candidate Don Mitchell. Former Regina police chief Cal Johnston ran for the Liberals.\n\nThe battle of the former mayors and the police chief went to Boughen.\n\nIn Regina-Lumsden-Lake Centre, Conservative Tom Lukiwski won, even after being embarrassed earlier this year by anti-gay remarks he made on a 16-year-old videotape that surfaced in early April.\n\nAlberta seats\n\nLee Richardson, the Calgary Centre Tory who made controversial comments about those committing crimes (saying \"They're not the kid that grew up next door\"), was the winner in his riding, again beating Liberal Heesung Kim.\n\nThe urban riding in Edmonton Centre, once held by Liberal deputy prime minister Anne McLellan, was won again by former fighter pilot Laurie Hawn, who lost to McLellan in 2004 but defeated her in 2006. The Tory's Liberal competitor this time was Jim Wachowich.\n\nOf the 3.8 million eligible voters in the Prairie region in 2006, just over 2.4 million voted, a 62.5 per cent average for the area.\n\nWhen the election was called in early September, the Conservatives held 127 seats across Canada, the Liberals had 95, the Bloc Québécois held 48, the NDP had 30 and the Greens had one (B.C. Liberal-turned-Independent MP Blair Wilson joined the Greens days before the election call).\n\nIndependents held three seats and another four seats were vacant."}, {"url": "https://globalnews.ca/news/7272869/new-brunswick-election-southwest-miramichi-bay-du-vin-2020/", "page_content": "See more sharing options\n\nSend this page to someone via email\n\nShare this item on Twitter\n\nShare this item via WhatsApp\n\nShare this item on Facebook\n\nVoters in the riding of Southwest Miramichi-Bay du Vin reelected PC incumbent Jake Stewart in the 2020 election.\n\nRiding background\n\nThe 2013 redistricting saw the riding of Southwest Miramichi absorb parts of the former district of Miramichi-Bay du Vin, which were outside of the city of Miramichi.\n\nAs a result, the riding was renamed to Southwest Miramichi-Bay du Vin. It is geographically one of the largest ridings in the province.\n\nCandidates\n\nLiberal: Josh McCormack\n\nProgressive Conservative: Jake Stewart (incumbent)\n\nServed as Minister of Aboriginal Affairs\n\nNDP: Glenna Hanley\n\nStory continues below advertisement\n\nPeople’s Alliance: Arthur O’Donnell\n\nHistory\n\n2018\n\nPC incumbent Jake Stewart retained his seat with 35.4 per cent of the vote, edging out People’s Alliance candidate Art O’Donnell, who earned 35 per cent of the vote.\n\nOnly 35 votes separated the two of them.\n\nLiberal candidate Andy Hardy earned 22.8 per cent of the vote.\n\n2014\n\nJake Stewart, the Tory incumbent for Southwest Miramichi, re-offered in the 2014 election.\n\nStewart defeated Liberal candidate Norma Smith and Wes Gullison, then-leader of the People’s Alliance, in the election.\n\n2010\n\nPC candidate Jake Stewart defeated Liberal incumbent Rick Brewer in the 2010 election for the riding of Southwest Miramichi.\n\nLiberal incumbent Bill Fraser retained his seat in the 2010 election. Fraser defeated Tory candidate Joan Cripps."}, {"url": "https://www.cbc.ca/news/canada/ottawa/papineau-riding-results-1.6601668", "page_content": "CBC News projects Mathieu Lacombe will win the electoral division of Papineau in Quebec's 43rd provincial election.\n\nIn the 2018 election, Coalition Avenir Québec candidate Lacombe defeated the Liberal incumbent.\n\nPapineau comprises several municipalities, including Lochaber, Thurso, Val-des-Bois, Papineauville and Notre-Dame-de-la-Paix. The Liberals held the riding since the 1980s before that.\n\nIts population is 77,985, with 63,643 registered voters.\n\nSeven candidates were running in the riding, which spans 3,594 square kilometres.\n\nAudrey-Ann Chicoine , Parti Québécois\n\nCédric Brazeau, Démocratie Directe\n\nMarc Carrière, Conservative Party of Quebec\n\nMarie-Claude Latourelle, Québec Solidaire\n\nMathieu Lacombe, Coalition Avenir Québec (Incumbent)\n\nMelissa Arbour, Green Party of Quebec\n\nWittlyn Kate Semervil, Quebec Liberal Party\n\nPapineau is comprised of several municipalities, including Lochaber, Val-des-Bois, Papineauville and Notre-Dame-de-la-Paix. (Élections Québec)"}, {"url": "https://globalnews.ca/news/3487467/nova-scotia-election-global-news-projects-liberal-government/", "page_content": "Send this page to someone via email\n\nNova Scotia will once again be ruled by a Liberal government with Stephen McNeil returning for his second term as premier.\n\nIt’s the first time since 1988 that a party has achieved a back-to-back majorities.\n\nFor full election coverage, go to our N.S. Election 2017 page.\n\nThe Liberals won their first majority in the 2013 election, which saw them move from Opposition status to the governing party.\n\n“To Nova Scotians who have supported our vision thank you. It was a hard fought campaign and I’ve lost some colleagues tonight,” McNeil told his supporters in Bridgetown. Tweet This Click to share quote on Twitter: \"To Nova Scotians who have supported our vision thank you. It was a hard fought campaign and I've lost some colleagues tonight,\" McNeil told his supporters in Bridgetown.\n\n“I will take energy and inspiration from tonight’s results. I will work for each and every one of you, every day to make this province all it can be.”\n\nStory continues below advertisement\n\nMcNeil cast his ballot with his wife Andrea at a community centre in Granville Centre, just outside of Bridgetown, where the Liberal party’s election night headquarters were located.\n\nHours later, he easily won his riding of Annapolis with 64.7 per cent of the vote.\n\nElection night started with a Liberal government projected, but it was unknown whether it would be a minority or majority for several hours. It was not until just before 1 a.m. Global News projected a majority government. Six ridings were still undeclared at about 11 p.m. with the Liberals short of the 26 seats needed for a majority.\n\nBy the end of the night, the Liberals were elected in 27 seats, the Progressive Conservatives were elected in 17 seats — forming the official opposition once again — and the NDP took seven.\n\nStory continues below advertisement\n\nWATCH: Nova Scotia Premier Stephen McNeil speaks to Liberal party faithful early Wednesday after learning he would be the victor in the 2017 Nova Scotia provincial election.\n\n7:58 Nova Scotia election: Full victory speech from Premier Stephen McNeil\n\nMcNeil campaigned on several initiatives promised in the previously announced budget – which was not passed before the writ was dropped – including a pledge to reduce taxes for 500,000 low- and middle-income earners as well as a pre-primary initiative for four-year-olds that would include 9,000 children by 2020.\n\nThe Liberals also promised in their platform that they would allow doctors to choose where and how they practise. They also pledged to roll out a $116.7-million package to establish more collaborative care clinics and recruit more doctors.\n\nMcNeil faced criticism over several issues throughout the election campaign, but with health care and education grabbing the most attention.\n\nStory continues below advertisement\n\nHis first majority was defined by the decision to rein in spending by limiting wage increases within the public sector. This led to protests at the legislature, two brief strikes and back-to-work legislation that unions called draconian.\n\nMcNeil’s government also made a series of cuts to seniors’ long-term care and public service organizations.\n\nThey included cutbacks for non-profit groups that serve people with hearing loss, eating disorders and epilepsy. As well, the government’s decision to eliminate a film tax credit led to protests in the streets.\n\nBut even with McNeil’s approach, the Liberals maintained a strong lead in decided voter support throughout their mandate, while the Progressive Conservatives under Jamie Baillie remained in second place.\n\n“Nova Scotians have given me the privilege to be their premier once again and part of that is you have to make decisions not everybody is going to like, but you have to do it,” McNeil told Global News. “But I’ve said this many times, my responsibility is to all Nova Scotians, not just a certain segment or certain population, I have to represent everyone and sometimes that puts you at odds with people.”\n\nWATCH: PC party leader Jamie Baillie addresses his fellow Conservatives, congratulating the Liberals and leader Stephen McNeil on their victory.\n\n12:54 Nova Scotia election: Jamie Baillie full speech at PC headquarters\n\nBaillie won Cumberland South on election night with 51.5 per cent of the vote.\n\nStory continues below advertisement\n\nHe was chosen as party leader in 2010 and was first elected in his riding in October 2010.\n\nThe PCs won 17 seats on Tuesday night — six more than they won in the 2013 election. However, with only 10 seats when the legislature dissolved, they managed to gain seven in this vote.\n\n“I am so proud of our Progressive Conservative team. Look how far we’ve come, look at the gap we closed, look at what you have done,” Baillie told supporters who were on hand in Springhill. Tweet This Click to share quote on Twitter: \"I am so proud of our Progressive Conservative team. Look how far we've come, look at the gap we closed, look at what you have done,\" Baillie told supporters who were on hand in Springhill.\n\nWATCH: It was a very boisterous NDP headquarters as Gary Burrill and the NDP celebrated a strong showing in the 2017 Nova Scotia election.\n\n13:21 Nova Scotia election: Gary Burrill’s full speech at NDP campaign headquarters\n\nBaillie congratulated McNeil for his win and also congratulated NDP Leader Gary Burrill for winning his seat in the legislature.\n\nStory continues below advertisement\n\nBurrill, who did not hold a seat in the legislature at dissolution, won his seat against Liberal incumbent Joachim Stroink with 46.1 per cent of the vote.\n\nBurrill thanked his supporters at the Marriott Harbourfront in Halifax.\n\n“I want to say just a deep word of gratitude to all,” Burrill said. “Think of us all, the hundreds and the hundreds and the hundreds of people who have contributed to our effort in all the 51 ridings across the province … It is the truth that Nova Scotia owes a deep gratitude to all have taken part in this great effort.” Tweet This Click to share quote on Twitter: \"I want to say just a deep word of gratitude to all,\" Burrill said. \"Think of us all, the hundreds and the hundreds and the hundreds of people who have contributed to our effort in all the 51 ridings across the province … It is the truth that Nova Scotia owes a deep gratitude to all have taken part in this great effort.\"\n\nWhile they did form a majority, McNeil’s Liberals also saw a few upsets.\n\nIn Cape Breton-Richmond, Michel Samson, who was the longest-serving current Liberal MLA, lost his seat to PC candidate Alana Paon by 20 votes. Samson was first elected in 1998.\n\nFormer community services minister Joanne Bernard also lost her seat to NDP candidate Susan Leblanc in Dartmouth North.\n\nThe NDP also suffered a blow with Denise Peterson-Rafuse losing her seat in Chester-St. Margaret’s.\n\n—With files from The Canadian Press"}, {"url": "https://repolitics.com/features/2003-manitoba-general-election/", "page_content": "On June 3, 2003, Manitoba voters re-elected Premier Gary Doer and the New Democratic Party to a majority government. The 2003 election results were an improvement for the NDP, both in terms of seat totals and percentage of the popular vote. Meanwhile, the provincial Progressive Conservative Party came in second, forming the Official Opposition. This article provides an overview of the history, party leaders and platforms, and results of the 2003 Manitoba provincial election.\n\nManitoba Electoral Backgrounder\n\nPrevious elections and pre-election party standings/polls\n\n1999 General Election\n\nThe last Manitoba general election was held in 1999, in which Gary Doer and his New Democratic Party won a majority government. The provincial Progressive Conservatives came in second, forming the Official Opposition. Below is a summary of the 1999 election results.\n\nPolitical Parties Popular Vote Seats Won Status New Democratic Party 44.83% 35 Majority Government Progressive Conservatives 40.58% 20 Official Opposition Liberals 13.31% 02 – Manitoba Party 0.58% – – Green Party 0.20% – – Libertarian Party 0.13% – – Communist Party 0.09% – –\n\n(Source: Elections Manitoba)\n\nProvincial By-election (1999-2003)\n\nBetween the 1999 and 2003 general election, three provincial by-elections were held: the PC Party won two, and the NDP won one.\n\n\n\nFor more on provincial by-elections held between 1999 and 2003:\n\nPre-election Public Opinion Polling\n\nIn a pre-election poll conducted by Probe Research in March 2003, the NDP held a large lead in popular support. The NDP’s total support stood at 44 percent, while the PC Party was second with 30 percent, and the Liberals in third at 21 percent. The NDP also led in the polls across gender, regional, income and educational categories. However, the PC Party is much more competitive among rural and more affluent voters. Below is a summary of the polling results.\n\nTotal Support (%)\n\nNDP 44 PC 30 Liberal 21\n\nSupport by Gender (%)\n\nMen Women NDP 42 47 PC 35 24 Liberal 19 24\n\nSupport by Region (%)\n\nWinnipeg Rural NDP 47 39 PC 25 38 Liberal 23 19\n\nSupport by Income (%)\n\nLess than $30K $30K-$60K More than $60K NDP 50 46 38 PC 20 33 35 Liberal 23 18 24\n\nSupport by Education (%)\n\nLess than High School High School Some Post Sec NDP 56 44 41 PC 26 29 31 Liberal 14 22 23\n\n(Source: Probe Research Inc., Winnipeg MAN, 2003)\n\n2003 Manitoba New Democratic Party\n\nLeader and key policies of the New Democratic Party\n\nLeader of the New Democratic Party\n\nGary Doer was born in Winnipeg, Manitoba, in 1948. He is married to Ginny Devine and they have two daughters. Prior to entering politics, Mr. Doer worked as a guard at the youth detention centre, served as President of the Manitoba Government Employees’ Union, was Vice President of Manitoba Special Olympics, and served as Member of the Board of Governors for the University of Manitoba. Mr. Doer was first elected to the Manitoba Legislature in 1986 for the New Democratic Party. During that time, he served as Minister of Urban Affairs, Minister of Crown Investments, Minister responsible for the Telephone Act, and Minister responsible for the Manitoba Liquor Control Commission. He was elected NDP leader in 1988, but lost the subsequent election; consequently, he became leader of the Official Opposition. In 1999, the NDP won a majority government and Mr. Doer was sworn in as Premier of Manitoba.\n\nNew Democratic Party Platform\n\nHealth care : The NDP has promised to improve Manitoba’s health care system through government investment. This includes increasing the number of nurses by boosting nursing training, hiring more nurses, doctors and medical technologists, and greater investment in medical equipment and facilities.\n\n: The NDP has promised to improve Manitoba’s health care system through government investment. This includes increasing the number of nurses by boosting nursing training, hiring more nurses, doctors and medical technologists, and greater investment in medical equipment and facilities. Education : The NDP has promised to improve access to education, training and apprenticeship opportunities, and to invest in universities, colleges and public schools.\n\n: The NDP has promised to improve access to education, training and apprenticeship opportunities, and to invest in universities, colleges and public schools. Government Finances and Taxes : The NDP is committed to balancing the budget and reducing the provincial debt. The Party has also promised tax cuts for middle-income Manitobans.\n\n: The NDP is committed to balancing the budget and reducing the provincial debt. The Party has also promised tax cuts for middle-income Manitobans. Economic policy : The NDP has placed government investment at the centre of its economic policy. This includes infrastructure spending on new hydro projects, rural projects and the twinning of the Trans-Canada Highway, as well as the development of alternative energy industries.\n\n: The NDP has placed government investment at the centre of its economic policy. This includes infrastructure spending on new hydro projects, rural projects and the twinning of the Trans-Canada Highway, as well as the development of alternative energy industries. Other policies: The Party has focused on public safety by promising to increase the number of police officers and Crown prosecutors. The NDP has also committed itself to affordable living in the province by keeping hydro and insurance rates low, and by regularly increasing minimum wage.\n\n2003 Manitoba Progressive Conservative Party\n\nLeader and key policies of the Progressive Conservative Party\n\nLeader of the Progressive Conservative Party\n\nStuart Murray was born in Punnichy, Saskatchewan, in 1954. He is married to Ashleigh Everett, and together they have two daughters. Mr. Murray received an Architectural Science Degree from Ryerson Polytechnic Institute. Prior to entering politics, he served as road manager for a rock band and the Canadian Opera Company, tour organizer for then Prime Minister Brian Mulroney, and President and CEO of Domo Gas. In 1999, he organized the World Junior Hockey Championships. In 2000, Mr. Murray was elected leader of the Progressive Conservative Party of Manitoba. Three weeks later he was elected to Manitoba Legislature, representing the riding of Kirkfield Park.\n\nProgressive Conservative Party Platform\n\nHealth care : The PC Party has promised to improve health care services and lower costs by developing agreements with private medical clinics to provide various kinds of care. The Party is also committed to improving service by producing an annual health accountability and transparency report.\n\n: The PC Party has promised to improve health care services and lower costs by developing agreements with private medical clinics to provide various kinds of care. The Party is also committed to improving service by producing an annual health accountability and transparency report. Taxes : The PC Party has promised to reduce property taxes up to 50 percent by eliminating education taxes from residential property and farmland.\n\n: The PC Party has promised to reduce property taxes up to 50 percent by eliminating education taxes from residential property and farmland. Other policies: The Party has committed to changing legislation to make it possible for the government to ban net-fishing on certain bodies of water. This would have the greatest impact on Aboriginal fisheries.\n\n2003 Manitoba Liberal Party\n\nLeader and key policies of the Liberal Party\n\nLeader of the Liberal Party\n\nJon Gerrard was born in 1947 in England. He is married to Naomi Oberholtzer, and they have three children. Mr. Gerrard received a Bachelor of Arts in Economics from the University of Saskatchewan in 1967; a Medical Degree from McGill University in 1971; a Ph.D. from the University of Minnesota in 1976; and a Certificate of Pediatrics from the American Academy of Pediatrics in 1976. From 1985 to 1993, Mr. Gerrard served as Head of Pediatric Hematology/Oncology at the Children’s Hospital in Winnipeg. From 1980 to 1993, he was a professor in the Faculty of Medicine at the University of Manitoba Faculty. He also co-authored The Bald Eagle, Haunts and Habitats of a Wilderness Monarch. Mr. Gerrard was first elected to the Canadian House of Commons in 1993 for the Liberal Party of Canada, representing the riding of Portage-Interlake. During this time, he served as Secretary of State for Science and Technology and Secretary of State for Western Economic Diversification. Mr. Gerrard was defeated in the 1997 federal election. In 1998, he was elected leader of the Liberal Party of Manitoba. In 1999, he was elected to Manitoba Legislature for the riding of River Heights.\n\nPlatform of the Liberal Party\n\nHealth care: The Liberal Party has emphasized government spending and new programs to improve provincial health care. Program examples include:\n\nOpening new senior clinics across the province (staffed by senior volunteers)\n\nExtending provincial Pharmacare coverage to include stop-smoking aids such as nicotine patches\n\nSetting up a Cardiac Care facility that would focus on prevention, research and treatment, and a guarantee of timely access to health care (with a commitment to send patients out of the province for treatment if they wait too long).\n\nAgriculture : The Liberal Party has also committed to rural development through several policies: 1) restoring provincial funding to the federal farm safety net program; 2) removing provincial sales taxes from all farm input products; and 3) removing the education tax from farmland.\n\n: The Liberal Party has also committed to rural development through several policies: 1) restoring provincial funding to the federal farm safety net program; 2) removing provincial sales taxes from all farm input products; and 3) removing the education tax from farmland. Other policies: The Party has promised to double spending on amateur sports and recreation.\n\n2003 Manitoba Election Results\n\nNew Democratic Party wins a majority government\n\nPremier Gary Doer and the New Democratic Party won a majority government, with 35 of the 55 seats in the provincial legislature. The election represented an increase in popularity for the New Democrats from the 1999 general election, both in terms of seats won and percentage of the popular vote.\n\nThe Progressive Conservatives came in second with 20 seats, forming the Official Opposition. Compared to 1999, this result represented a decrease in seats and popular vote for the Party. The Liberals came in a distant third, winning only two seats in the legislature.\n\nResults of 2003 Election\n\nPolitical Parties Popular Vote Seats Won Status New Democrat Party 48 35 Majority Government Progressive Conservatives 37 20 Official Opposition Liberals 13 02 – Manitoba Party – – – Green Party – – – Libertarian Party – – – Communist Party – – –\n\n(Source: Manitoba Elections)\n\nList of links for more on this topic"}, {"url": "https://winnipeg.ctvnews.ca/liberals-down-three-winnipeg-seats-following-federal-election-1.4651106", "page_content": "WINNIPEG -- The town isn’t painted as red as it was in 2015.\n\nFollowing the federal Liberal minority win, the political map in Winnipeg has changed, with some blue and orange additions at the expense of the red party.\n\nThe Liberals had seven of the eight city seats going into election night, but when the dust settled they lost three and held onto four.\n\nConservative Raquel Dancho won in Kildonan-St. Paul. She said people were expressing their concerns about the Liberals.\n\n\"I just feel that people had a lot of hopes when they voted for Trudeau and he really let them down,\" said Dancho.\n\nDancho defeated Liberal incumbent MaryAnn Mihychuk.\n\nA disappointed Mihychuk said she's sensed a growing frustration in Western Canada\n\n\"Western alienation came through, you're seeing a lot of Conservative wins,\" she said.\n\nThe other Conservative win in Winnipeg was in Charleswood-St. James-Assiniboia-Headingley. Former city councillor Marty Morantz held off Liberal incumbent Doug Eyolfson.\n\nDespite his party losing the national battle, Morantz believes it's a positive step for the Conservatives.\n\n\"This result is a repudiation of the Trudeau government. They went from a majority government to a minority government, which means Canadians have their doubts,\" said Morantz.\n\nIt appears the People's Party of Canada candidate and former Conservative MP Steven Fletcher was not a factor in the riding. He finished a distant fifth.\n\nA defiant Fletcher had parting words for Tory Leader Andrew Scheer and his party.\n\n\"A high school prankster establishment, you know like a frat house,\" said Fletcher.\n\nThe NDP also gained in Winnipeg with activist Leah Gazan. She won the traditional NDP seat in Winnipeg Centre back for the party, beating Liberal incumbent Robert-Falcon Ouellette.\n\n\"It's certainly not about me, it's about people coming together that believe in social justice, believe in human rights and believe in climate justice,\" said Gazan.\n\nOuellette, who first rose to prominence as a mayoral candidate, suggested he may be done with politics.\n\n\"Well what else is there like I've lost this seat, if you can't hold your seat, what's your value in politics,\" said Ouellette."}, {"url": "https://globalnews.ca/news/7450530/ndp-upset-vernon-monashee/", "page_content": "Send this page to someone via email\n\nThe final count has been tallied in the Okanagan’s closest election race, and the NDP has pulled off a huge upset in Vernon-Monashee.\n\nThe NDP’s Harwinder Sandhu defeated Liberal incumbent Eric Foster by 424 votes, once all absentee and mail-in ballots were tallied.\n\nElections B.C. had to count more than 660,000 mail-in and absentee ballots provincewide, leaving several races too close to call on election day (Oct. 24).\n\nOn Sunday, Sandhu was declared the MLA-elect in the North Okanagan riding after earning 10,222 votes, or 36.56 per cent.\n\n1:47 Election upset in Vernon-Monashee\n\nFoster placed second with 9,798 votes, or 35.05 per cent of the popular vote.\n\nStory continues below advertisement\n\n“I feel great, I feel very thankful and so proud of people in Vernon-Monashee for giving the opportunity and for seeing the potential in me,” Sandhu told Global News on Sunday.\n\nThank you Vernon Monashee! I feel so blessed to be given this opportunity to represent people. I will make sure all voices are equally heard and congratulate the people of Vernon Monashee for exercising their right to vote #bcndp #teamhorgan pic.twitter.com/63Q7F2C4Zr — Harwinder Sandhu (@harwinderndp20) November 8, 2020\n\nVernon-Monashee was considered a safe BC Liberal seat, as the party won it in every election since 1996, until now.\n\nSandhu said she believes she was able to capitalize on the popularity of her leader, and points to changing demographics in the riding as explanations for the party’s Okanagan breakthrough.\n\nStory continues below advertisement\n\n“People were very impressed with John Horgan and the NDP and the work they have done, secondly, I heard from people that they thought, being a person from a community who was more relatable… people saw the genuine passion in me,” she said.\n\n2:21 Three term MLA Eric Foster defeated\n\n“The priorities have changed, the demographics have changed, and it’s just a combination of things, it is hard to pinpoint one thing,” Sandhu added.\n\nThe freshly-minted incoming member of the legislature says her priorities will be co-operation with municipalities, health care, seniors care, child care and the environment.\n\n“I’ve been sad about how our farmers have been hit hard with so much crops have been wasted, whether it’s early snowfall, before it was lack of pickers, so I am eager to look forward to meet them all,” she said.\n\nStory continues below advertisement\n\nFoster told Global News while he was disappointed he failed to secure a fourth term, he respects the democratic process.\n\n“I am certainly disappointed, nobody likes to come second in these things, but it’s what the people have decided, and it’s a democracy,” he said.\n\n“What a great honour it’s been to serve the people of Vernon-Monashee for the last 11.5 years, it’s just been a great thrill, and I certainly congratulate Harwinder on her victory.”\n\nThe BC Liberals held onto five seats in the Okanagan, but also lost Boundary-Similkameen to the NDP’s Roly Russell.\n\nThe NDP hasn’t held the seat since the early 1990s. The B.C. Interior has a long history of voting for centre-right political parties.\n\nFind full B.C. 2020 election coverage here."}, {"url": "https://www.cbc.ca/news/canada/newfoundland-labrador/innu-leader-delivers-conservatives-from-n-l-shutout-1.976524", "page_content": "A Labrador Innu leader saved the Conservatives from a shutout in Newfoundland and Labrador in Monday's election, with the Liberals holding their ground in rural Newfoundland and the New Democrats sweeping St. John's.\n\nPeter Penashue was named the winner in the Labrador riding after results from the last five polls were counted. Until then, he had been trailing Liberal incumbent Todd Russell.\n\n\"Well, I must say it's been a roller-coaster ride. It's been exciting,\" Penashue told CBC News Monday night.\n\n\"In the final count, it was enough to bring me over the top. So, I'm very excited about that.\"\n\nHis surprise win came more than a hour after many had declared Russell as the winner in Labrador. The final polls to report likely involved Innu communities, where participation in the advance poll was significantly higher than usual.\n\n\"We've made history, all of us in Labrador, and changed it,\" said Penashue.\n\nLabrador had often been considered one of the safest Liberal seats in Canada, with the riding's voters backing the party every time but once. The Conservatives last won the riding in 1968.\n\nFormer senator Manning defeated\n\nElsewhere in the province, Liberal Scott Andrews was re-elected in the riding of Avalon, ensuring the Conservatives didn't take a seat on the island of Newfoundland.\n\nTory candidate Fabian Manning, whom Andrews defeated in 2008, lost again in a very tight race.\n\nManning took a risk in the campaign by quitting his seat in the Senate, in what turned out to be a failed bid to sit again in the Commons.\n\n\"Something inside of me wanted me to get out there again, offer myself as a candidate in the election, and I did that. I certainly don’t have any... I live with very few regrets,\" Manning said Monday night.\n\nAlthough the \"anything but Conservative\" campaign that then-premier Danny Williams waged in 2008 was officially over, the sentiment was still present with many voters. Tory organizers told CBC News they met with steady resistance to Conservative Leader Stephen Harper while canvassing for support.\n\nOrange wave in St. John's\n\nThe election also saw a dramatic breakthrough for the New Democrats in the St. John's area. Journalist Ryan Cleary easily defeated Liberal incumbent Siobhan Coady in St. John's South-Mount Pearl, with former provincial Tory minister Loyola Sullivan trailing far behind.\n\nMeanwhile, NDP support saw incumbent Jack Harris take a landslide victory in neighbouring St. John's East.\n\nThe New Democrats poured considerable resources into the two city ridings, and gained considerable support from students and young voters, with dozens of them volunteering to work on the campaigns.\n\nDunderdale support questioned\n\nLosses for star Conservative candidates in the ridings of Avalon, St. John's South-Mount Pearl and Random-Burin-St. Georges's left some questioning current Premier Kathy Dunderdale's support for Stephen Harper, who put support for a loan guarantee for the Lower Churchill hydroelectric project in the party's platform.\n\nLiberal Scott Andrews hugs a supporter after learning he was re-elected in the eastern Newfoundland riding of Avalon. ((Zach Goudie/CBC))\n\n\"She put all her stock in Harper and it failed,\" said re-elected Liberal Gerry Byrne, who won the riding of Humber-St. Barbe-Baie Verte.\n\n\"Why [the provincial Progressive Conservatives] ever got involved in this campaign to begin with is a mystery to me, but they did it. They took a big risk. They had nothing to gain, everything to lose. They're the big losers tonight.\"\n\nThose comments were echoed by re-elected Liberal Andrews.\n\n\"The premier put all her eggs in one basket. The Conservatives are going to have to answer for that in October,\" said Andrews, who was one of four Liberals returned to Parliament.\n\nThe Newfoundland and Labrador Liberals will likely play a part in rebuilding the party nationally, following a rout that saw the Grit caucus cut to 34 seats, and Leader Michael Ignatieff lose his seat.\n\nBonavista-Gander-Grand Falls-Windsor\n\nLiberal Scott Simms was re-elected in the central Newfoundland riding of Bonavista-Gander-Grand Falls-Windsor with 57 percent of the vote there.\n\nConservative Aaron Hynes received 27 percent of the vote in the riding.\n\nHumber-St. Barbe-Baie Verte\n\nByrne won the western Newfoundland riding of Humber - St. Barbe - Baie Verte with 57 per cent of votes in the area.\n\nConservative Trevor Taylor, a former provincial cabinet minister, received 25 per cent of the vote.\n\nRandom- Burin-St. George's\n\nForty-nine per cent of people in the southern Newfoundland riding of Random-Burin-St. George's voted to re-elect Liberal Judy Foote.\n\nConservative John Ottenheimer, another former provincial cabinet minister, won 32 per cent of the votes cast in the riding."}, {"url": "https://prabook.com/web/patrick.hayes/2069191", "page_content": "Patrick Hayes\n\npolitician\n\nOctober 26, 1942 (age 68) Maidstone Township, Ontario\n\nHe was the 13th child in a family of 18 children. He did not complete high school, instead he got a job at Ford Motors. Hayes reflected on his early life choices. He said, \"When I was a teenager it was one of those cases where if you wanted a new pair of pants, or shoes, you had to go to work for them.\" By the time he was 25 he was plant health and safety representative for the Canadian Auto Workers. Hayes was elected to the Ontario legislature in the 1985 provincial election, defeating Liberal candidate Jack Morris by about 1,300 votes in Essex North. He served as the NDP critic for Transportation and Communications, Tourism and Recreation, and Agriculture in the parliament that followed. He ran against McGuigan again in the 1990 election, this time defeating him by 5,890 votes amid a provincial victory for the NDP under Bob Rae. He served as Parliamentary Assistant to the Minister of Agriculture and Food from 1990 to 1993, and to the Minister of Municipal Affairs from 1993 to 1995. In 1994, Hayes was one of twelve NDP members to vote against Bill 167, a bill extending financial benefits to same-sex partners. By the 2003 campaign, he had changed his mind on this issue. The NDP were defeated in the 1995 provincial election, and Hayes finished third, 2,293 votes behind the winning candidate, Liberal Pat Hoy. He sought a return to the legislature in the 2003 provincial election, but, although he was generally seen as a strong candidate, he lost to Liberal incumbent Bruce Crozier by about 8,000 votes in the riding of Essex. Hayes was mayor of Lakeshore, Ontario from 1997 to 2003, and was generally regarded as a popular figure within that community. Hayes died in 2011 after a long battle with lung cancer. He is buried in Saint Mary's Roman Catholic Cemetery in Essex County, Ontario."}]}