{"Mathieu was born in L'Assomption, Quebec.": [{"url": "https://www.wikiwand.com/en/%C3%89tienne_Mathieu", "page_content": "Étienne Mathieu (November 21, 1804 – January 16, 1872) was a farmer, land owner and political figure in Quebec. He represented L'Assomption in the Legislative Assembly of Quebec from 1867 to 1871 as a Conservative.\n\nCanadian politician\n\nQuick facts: Étienne Mathieu, Member of the Legislative As... ▼\n\nHe was born in Lachenaie, Lower Canada, the son of Jean-Marie Mathieu and Josephte Quenneville. Mathieu was educated at the Collège Masson à Terrebonne. In 1830, he married Josephte Duprat. He was a major in the militia, a justice of the peace and president of the agricultural society at Lachenaie. He was also a school commissioner and was mayor of Lachenaie from 1867 to 1869. Mathieu died in Lachenaie at the age of 67."}, {"url": "https://greenerpasture.com/Places/Details/95", "page_content": "Not the place you are looking for? Try again! Search for Your Family by Place To search for a place, specify place name below. Choose name from the list. Then SEARCH. * Place Name:\n\nLooking for something else? Search HERE.\n\nThis FREE genealogy website is a collection of contributions from many generous \"family\" members who want to share their family with others. We are not necessarily related to or researching a person just because their name is on this site. While we do our best to be accurate, we sometimes make mistakes. Please use this information as a guide. Verify the information with your own research. If you find any errors, please email us and report them. Thanks!\n\n\n\nTerms of Use / Accuracy and Content Disclaimer\n\nAs an Amazon Associate I earn from qualifying purchases.\n\n© 1999-2023 Cow Country Systems. All rights reserved.\n\nContact Us"}, {"url": "https://www.thecanadianencyclopedia.ca/en/article/lassomption", "page_content": "L'Assomption was the result of the merger of the parish municipality of Saint-Pierre-du-Portage-de-l'Assomption (incorporated 1855) with the town of L'Assomption (incorporated 1888) in 1992. L'Assomption is located about 50 km northeast of Montréal, in a loop of the meandering L'Assomption River, just below the confluence with the Achigan River.\n\nL'Assomption takes its name from the Seigneurie de l’Assomption granted to Pierre Legardeur de Repentigny in 1647 and from the river itself, which has carried that name since the early 17th century. Originally, the site of L'Assomption was known as \"Le Portage\" because it straddled a portage path used as a shortcut across the quasi-peninsula made by the winding course of the river.\n\nBefore Joliette came into its own in 1863, L'Assomption was the main town on the road linking Trois-Rivières to Montréal. Its fame was closely linked to Collège de l'Assomption, founded in 1832. The driving force behind this educational project was Jean-Baptiste Meilleur, the first superintendent of education for Lower Canada (1842–55). Canada's seventh prime minister, Sir Wilfrid Laurier, was one of the college's most famous students.\n\nOasis du Vieux Palais de Justice, the oldest circuit courthouse in the province of Québec, is its foremost historic building."}, {"url": "https://www.ancestry.com/genealogy/records/isidore-mathieu-24-1f13khy", "page_content": "This database contains family trees submitted to Ancestry by users who have indicated that their tree can be viewed by all Ancestry subscribers.These trees can change over time as users edit, remove, or otherwise modify the data in their trees. You can contact the owner of the tree to get more information.\n\nPrivate Member Trees\n\nThis database contains family trees submitted to Ancestry by users who have indicated that their tree can only be viewed by Ancestry members to whom they have granted permission to see their tree.These trees can change over time as users edit, remove, or otherwise modify the data in their trees. If you would like to view one of these trees in its entirety, you can contact the owner of the tree to request permission to see the tree."}, {"url": "https://pantheon.world/profile/place/lassomption-quebec/", "page_content": "L'Assomption, Quebec\n\nL'Assomption, Quebec ranks 14,351st in number of biographies on Pantheon, behind Mhow, Bourton-on-the-Water, and Kami-Amakusa. Memorable people born in L'Assomption, Quebec include Sébastien Toutant. L'Assomption, Quebec has been the birth place of many athletes. L'Assomption, Quebec is located in Canada.\n\nL'Assomption is an off-island suburb of Montreal, in southwestern Quebec, Canada on the L'Assomption River. It is the seat of the Regional County Municipality of L'Assomption. It is located on the outer fringes of the Montreal urban area. Read more on Wikipedia"}, {"url": "https://www.findagrave.com/cemetery/1978519/grand-cimeti%C3%A8re-de-l'assomption", "page_content": "There is a problem with your email/password.\n\nWe’ve updated the security on the site. Please reset your password.\n\nYour account has been locked for 30 minutes due to too many failed sign in attempts. Please contact Find a Grave at [email protected] if you need help resetting your password.\n\nThis account has been disabled. If you have questions, please contact [email protected]\n\nEmail not found\n\nPlease complete the captcha to let us know you are a real person.\n\nFound more than one record for entered Email\n\nThere is a problem with your email/password.\n\nYou need to confirm this account before you can sign in. Resend Activation Email\n\nWe have sent you an activation email\n\nPlease enter your email to sign in.\n\nPlease enter your password to sign in.\n\nPlease enter your email and password to sign in.\n\nThere is a problem with your email/password.\n\nA system error has occurred. Please try again later.\n\nA password reset email has been sent to EmailID. If you don't see an email, please check your spam folder.\n\nWe encountered an unknown problem. Please wait a few minutes and try again. If the problem persists contact Find a Grave."}, {"url": "https://mnoc.ca/english/who-we-are/metis-ancestors/", "page_content": "THE MÉTIS ANCESTORS OF OUR CITIZENS\n\nConfirmed and documented ancestral Métis lineages of our Citizens.\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nNOTE: This PARTIAL list was compiled for your information ONLY, not to be shared or used by genealogists and researchers who collect a fee for their work. As time permits, more records will be added.\n\n*Note: The term Indian is used in its historical context."}, {"url": "https://www.ancestry.com/genealogy/records/louis-mathieu-24-5ccgxb", "page_content": "This database contains family trees submitted to Ancestry by users who have indicated that their tree can be viewed by all Ancestry subscribers.These trees can change over time as users edit, remove, or otherwise modify the data in their trees. You can contact the owner of the tree to get more information.\n\nPrivate Member Trees\n\nThis database contains family trees submitted to Ancestry by users who have indicated that their tree can only be viewed by Ancestry members to whom they have granted permission to see their tree.These trees can change over time as users edit, remove, or otherwise modify the data in their trees. If you would like to view one of these trees in its entirety, you can contact the owner of the tree to request permission to see the tree."}, {"url": "https://www.cbc.ca/kids/articles/the-first-recorded-black-man-in-canada-became-a-national-hero", "page_content": "(123RF/Corey A Ford)\n\nHow many languages can you speak?\n\nBack in the 1600s, an intelligent young man arrived on the shores of Canada. Well, what someday would be known as Canada. This man spoke and understood at least five different languages!\n\nHe was also the first recorded Black person, or person of African heritage, to visit and live on this land.\n\nLet's find out a little more about the life of Mathieu Da Costa.\n\nWhere was he from?\n\nDrawing of Benin City, the capital of Benin Empire, made by an English officer in 1897. (Wikimedia/Public domain)\n\nDetails about Mathieu's early life are hard to find.\n\nSome historians believe his family was from the African kingdom of Benin. That's the southern part of Nigeria. But Mathieu may have been born in the Azore Islands, which are near Portugal and Morocco.\n\nWhat did he do?\n\nMathieu's language skills were valuable and in demand. He worked with well-known French explorers like Samuel de Champlain and Pierre Dugua de Mons. Which meant he was part of many trade and exploration expeditions (or journeys).\n\nAs an interpreter, he would translate languages for explorers and First Nations people in New France (Quebec).\n\n(Vincent masson - Québec, Wikimedia/Public Domain)\n\nWhat languages did he speak?\n\nSome accounts say that Mathieu was a well-educated man. He was able to speak French, Dutch, Portuguese and Mi' kmaq, a First Nations language.\n\nHe also spoke a language used by fishermen on the Atlantic coast. It was a mix of a French-Spanish dialect.\n\nWho would he become?\n\n© Canada Post 2017. Reprinted with permission\n\nThere have been several efforts made to secure Mathieu Da Costa's place in history. We want to remember him as an accomplished and skilled interpreter. And as the first man of African heritage to step foot and live in Canada.\n\nIf you travel to Port-Royal National Historical Site in Nova Scotia, you will find a plaque that honours his life and time spent there. Apparently he actually lived in Port-Royal, which was one of the first European settlements.\n\nStreets in Montreal, Quebec City and Halifax have been named after him. And a francophone primary school in Toronto. But best of all, Canada Post created a stamp with his picture.\n\nMathieu Da Costa, the African interpreter who first arrived in Canada in the early 1600s is now regarded as a national hero."}]}