{"Mario Monti was born on 19 March 1943.": [{"url": "https://www.britannica.com/biography/Mario-Monti", "page_content": "Mario Monti, (born March 19, 1943, Varese, Italy), Italian economist, academic, and bureaucrat who served as prime minister of Italy (2011–13).\n\nMonti, the son of a banker, studied economics and management at Bocconi University in Milan and received a degree in 1965. He then pursued graduate studies at Yale University under the tutelage of American economist James Tobin. Monti taught briefly at the University of Trento (1969–70) and began a post at the University of Turin (1970–79) before returning to Bocconi University in 1971 as a professor of monetary theory and policy. He later directed (1985–94) the school’s Institute of Economics. In 1989 he became rector of the university, and five years later he was named its president.\n\nAs a consultant to one of Italy’s largest banks in the 1970s, Monti gained attention for publishing his own estimates of the country’s money supply at a time when official figures were not publicly available. Beginning the following decade, he served on several committees of the Italian treasury and was president of SUERF (Société Universitaire Européenne de Recherches Financières; now the European Money and Finance Forum) in 1982–85. Also during this time Monti wrote commentaries on economics for the Milan newspaper Corriere della Sera (1978–94) and sat on a number of corporate boards.\n\nIn 1995 Monti, having been nominated by Italian Prime Minister Silvio Berlusconi, took a seat on the European Commission (EC), for which he oversaw issues relating to the internal market, financial services, and taxation. Receiving a second term in 1999, he became the European commissioner for competition, and in that capacity, he took a tough-minded approach to proposed corporate mergers and antitrust cases that won him wide respect. After his EC tenure concluded in 2004, he helped found Bruegel, a Brussels-based think tank with a focus on economic globalization.\n\nIn November 2011, in the wake of a public debt crisis in Italy that weakened Berlusconi’s grip on power, the politically independent Monti became a leading candidate to assume the country’s premiership in a national unity government. (It was hoped that Monti’s experience as a technocrat would prove beneficial in the implementation of urgent economic reforms.) On November 9 he was made a lifetime member of the Italian Senate, and four days later, upon Berlusconi’s resignation, Pres. Giorgio Napolitano asked Monti to form a government.\n\nInitially serving as both prime minister and finance minister (he held the latter post until July 2012), Monti swiftly persuaded parliament to approve an austerity package that relied heavily on tax increases. In early 2012 a set of measures he introduced in an effort to liberalize the service sector was also passed. Although Italy continued to face economic uncertainty, Monti’s decisive leadership was widely judged to have helped the country forestall disaster. As the year continued, he also emerged as a key player in international negotiations aimed at financially stabilizing the entire euro zone.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nIn December, however, Monti’s government lost the support of Berlusconi’s People of Freedom (Popolo della Libertà) party during two otherwise successful parliamentary confidence votes. He resigned from office shortly thereafter, remaining in a caretaker role until a new government could be formed. In early elections held in February 2013, Monti led an alliance of centrist political factions, but they failed to win enough parliamentary seats to play a significant role in the ensuing efforts to build a government coalition. After two months of political deadlock, Monti was finally succeeded by Enrico Letta, a Democratic Party (Partito Democratico) leader appointed by Napolitano."}, {"url": "https://www.wikiwand.com/en/Mario_Monti", "page_content": "Mario Monti (born 19 March 1943) is an Italian economist and academic who served as the Prime Minister of Italy from 2011 to 2013, leading a technocratic government in the wake of the Italian debt crisis.\n\nItalian economist and politician (born 1943)\n\nQuick facts: Senator for lifeMario MontiOMRI, Prime Minist... ▼\n\nMonti served as a European Commissioner from 1995 to 2004, with responsibility for the Internal Market, Services, Customs and Taxation from 1995 to 1999 and for Competition from 1999 to 2004. Monti has also been rector and president of Bocconi University in Milan for many years.\n\nOn 12 November 2011, in the midst of the European sovereign debt crisis, Monti was invited by President Giorgio Napolitano to form a new technocratic government following the resignation of Silvio Berlusconi. Monti was sworn in as Prime Minister on 16 November 2011, just a week after having been appointed a Lifetime Senator by President Napolitano, and initially became Minister of Economy and Finances as well, giving that portfolio up the following July.\n\nFrom 16 May 2013 to 17 October 2013, Monti was the president of Civic Choice, a centrist[1] political party in Italy."}, {"url": "https://pantheon.world/profile/person/Mario_Monti", "page_content": "Mario Monti\n\nMario Monti (born 19 March 1943) is an Italian economist and academic who served as the Prime Minister of Italy from 2011 to 2013, leading a technocratic government in the wake of the Italian debt crisis. Monti served as a European Commissioner from 1995 to 2004, with responsibility for the Internal Market, Services, Customs and Taxation from 1995 to 1999 and for Competition from 1999 to 2004 . Read more on Wikipedia\n\nSince 2007, the English Wikipedia page of Mario Monti has received more than 703,691 page views. His biography is available in 75 different languages on Wikipedia (up from 74 in 2019) . Mario Monti is the 2,647th most popular politician (down from 2,579th in 2019), the 894th most popular biography from Italy (up from 903rd in 2019) and the 191st most popular Italian Politician.\n\nMario Monti is most famous for being the Prime Minister of Italy from 2011 to 2013."}, {"url": "https://www.italyonthisday.com/2016/03/mario-monti-prime-minister-technocrat-varese-milan-super-mario.html", "page_content": "\n\n\n\n‘Super Mario’ steps in during debt crisis\n\n\n\n\n\nMario Monti was Prime Minister of Italy\n\nfrom 2011 to 2013\n\nEconomist Mario Monti, who was Prime Minister of Italy from 2011 to 2013, was born on this day in 1943 in Varese in Lombardy.\n\n\n\n\n\nMonti was invited by Italian President Giorgio Napolitano to form a new Government after the resignation of Silvio Berlusconi in November 2011 in the middle of the European debt crisis.\n\n\n\n\n\nMonti, who was the 54th Prime Minister of Italy, led a Government of technocrats, who introduced austerity measures in Italy.\n\n\n\n\n\nMonti was born in Varese and, after attending a private school, went to Bocconi University in Milan, where he obtained a degree in Economics.\n\n\n\n\n\nHe was a European Commissioner from 1994 to 1999, where he obtained the nickname ‘Super Mario’ from his colleagues and the Press.\n\n\n\n\n\nIn 1999 the Prime Minister at the time, Massimo D’Alema, appointed him to the new Prodi Commission, giving him responsibility for Competition.\n\n\n\n\n\nSilvio Berlusconi\n\nHe was made a lifetime senator by Giorgio Napolitano in November 2011 and a few days later he was invited to form a new Government following Berlusconi’s resignation.\n\n\n\n\n\nHe appointed a technocratic cabinet composed entirely of unelected professionals.\n\n\n\n\n\nThey introduced austerity measures to try to stem the worsening economic conditions in Italy. He announced that he would be giving up his own salary as part of the reforms.\n\n\n\n\n\nMonti resigned as Prime Minister after the 2012 Budget was passed, as he had always pledged he would do.\n\n\n\n\n\nSince January 2014, Monti has been Chairman of the High Level group on Own Resources, a consultative committee of the European Union that will propose new forms of revenue for the European Union’s budget.\n\n\n\n\n\nA view over the beautiful Lake Varese\n\nPhoto: Idéfix (CC BY-SA 3.0)\n\nTravel tip:\n\n\n\n\n\nVarese is a city in Lombardy, 55 kilometres north of Milan and close to Lago Maggiore. It is rich in castles, villas and gardens, many connected with the Borromeo family, who are from the area. Lake Varese is 8.5 kilometres long, set in low rolling hills just below Varese.\n\n\n\n\n\nHotels in Varese by Booking.com\n\n\n\nTravel tip:\n\n\n\nBocconi University is a private university in Milan that provides education in the fields of economics, management, finance, law and public administration. It was founded in 1902 by Ferdinanado Bocconi and was originally located in Via Statuto near the Pinacoteca di Brera in Milan.\n\n\n\n"}, {"url": "https://prabook.com/web/mario.monti/724244", "page_content": "Mario Monti Edit Profile\n\neconomist politician academic\n\nMario Monti is an Italian economist who served as the Prime Minister of Italy from 2011 to 2013, leading a government of technocrats in the wake of the Italian debt crisis.\n\nBackground Ethnicity: His mother was from Piacenza. Although his father grew up in Varese, he was born in Luján in the Buenos Aires Province, Argentina, where his ancestors had emigrated to in the 19th century and built up a soft-drink and beer-production business. Monti's father went back to Argentina during World War II, but later returned to his family home in Varese.\n\n\n\nMonti was born in Varese on 19 March 1943.\n\n\n\nMonti is married to his wife Elsa and has two sons.\n\nCareer Mario Monti has been the 54th Prime Minister of Italy since November 2011.\n\n\n\nInitially, Monti was also Minister of Economy and Finance.\n\n\n\nMonti served as a European Commissioner from 1995 to 2004, with responsibility for the Internal Market, Services, Customs and Taxation from 1995 to 1999 and for Competition from 1999 to 2004.\n\n\n\nMonti has also been Rector and President of Bocconi University in Milan.\n\n\n\nMonti was sworn in as Prime Minister on 16 November 2011, just a week after having been appointed a Senator for Life.\n\nInterests histiry of Ancient Egypt\n\nSport & Clubs cycling"}, {"url": "https://www.idolbirthdays.net/mario-monti", "page_content": "Does Mario Monti Dead or Alive?\n\nAs per our current Database, Mario Monti is still alive (as per Wikipedia, Last update: May 10, 2020).\n\n🎂 Mario Monti - Age, Bio, Faces and Birthday\n\nCurrently, Mario Monti is 80 years, 2 months and 21 days old. Mario Monti will celebrate 81rd birthday on a Tuesday 19th of March 2024. Below we countdown to Mario Monti upcoming birthday.\n\nDays Hours Minutes Seconds\n\nPopular As Mario Monti Occupation World Leader Age 80 years old Zodiac Sign Pisces Born March 19, 1943 (Italy) Birthday March 19 Town/City Italy Nationality Italy\n\n🌙 Zodiac\n\nMario Monti’s zodiac sign is Pisces. According to astrologers, Pisces are very friendly, so they often find themselves in a company of very different people. Pisces are selfless, they are always willing to help others, without hoping to get anything back. Pisces is a Water sign and as such this zodiac sign is characterized by empathy and expressed emotional capacity.\n\n🌙 Chinese Zodiac Signs\n\nMario Monti was born in the Year of the Goat. Those born under the Chinese Zodiac sign of the Goat enjoy being alone in their thoughts. They’re creative, thinkers, wanderers, unorganized, high-strung and insecure, and can be anxiety-ridden. They need lots of love, support and reassurance. Appearance is important too. Compatible with Pig or Rabbit.\n\nSome Mario Monti images\n\nAbout\n\n54th Prime Minister of Italy who served from 2011 until 2012. He led his country after the chaotic reign of Prime Minister Silvio Berlusconi.\n\nBefore Fame\n\nHe attended Bocconi University of Milan, graduated with a degree in Economics in 1965 and later attended and graduated from Yale University.\n\nTrivia\n\nHe won a scholarship to Yale University to study under James Tobin, a Nobel Laureate.\n\nFamily Life\n\nHe got married to Elsa Antonioli in 1970 and has two children: Federica and Giovanni.\n\nAssociated With\n\nHe was the prime minister of Italy just like Margaret Thatcher was of Great Britain.\n\nMario Monti trend"}, {"url": "https://www.astro.com/astro-databank/Monti,_Mario", "page_content": "\n\n\n\n\n\n\n\nBiography\n\nItalian economist, professor and politician, he became Prime Minister in November 2011 after Silvio Berlusconi stepped down amidst the country's financial turmoil.\n\nMonti earned economics degrees from Bocconi University in Milan and Yale University in the US. From 1970 to 1985 he taught economics at Turin University. Concurrently, from 1982 to 1985 he was President of SUERF (Societe Universitaire Europeene de Rechercher Financieres), a European financial forum. In 1985 he became Rector of Bocconi University and later President. From 1994 to 2004 he served two terms as the EU's Competition Commissioner. He earned the moniker \"Super Mario\" for taking on special interests.\n\nOn November 13, 2011 he was named Italy's Prime Minister. While forming his cabinet he chose bankers, economists and CEOs, completely ignoring politicians. Contrasted with the personality of the flamboyant Berlusconi, Monti is considered to be quiet, reserved and married to the same woman for over 30 years.\n\nHe and his wife have two children.\n\nLink to Wikipedia biography\n\nRelationships\n\ncompare to chart of Berlusconi, Silvio (born 29 September 1936)\n\nEvents\n\nWork : Begin Major Project 1994 (Competition Commissioner for the EU)\n\nWork : Gain social status 12 November 2011 (Named Prime Minister of Italy)\n\nchart Equal_H. chart Placidus\n\nSource Notes\n\nGrazia Bordoni quotes birth certificate\n\nCategories\n\nFamily : Relationship : Marriage more than 15 Yrs\n\nFamily : Parenting : Kids 1-3 (Two)\n\nVocation : Business : Economist\n\nVocation : Education : Teacher"}, {"url": "https://www.geni.com/people/Mario-Monti/6000000140238542880", "page_content": "About Mario Monti\n\nhttps://en.wikipedia.org/wiki/Mario_Monti\n\nMario Monti, OMRI (born 19 March 1943) is an Italian economist who served as the Prime Minister of Italy from 2011 to 2013, despite never having been an elected politician, leading a government of technocrats in the wake of the Italian debt crisis.\n\nMonti served as a European Commissioner from 1995 to 2004, with responsibility for the Internal Market, Services, Customs and Taxation from 1995 to 1999 and for Competition from 1999 to 2004. Monti has also been Rector and President of Bocconi University in Milan for many years. On 12 November 2011, in the midst of the European sovereign debt crisis, Monti was invited by President Giorgio Napolitano to form a new technocratic government following the resignation of Silvio Berlusconi. Monti was sworn in as Prime Minister on 16 November 2011, just a week after having been appointed a Senator for Life by President Napolitano, and initially became Minister of Economy and Finances as well, giving that portfolio up the following July. From 16 May 2013 to 17 October 2013 Monti was the President of Civic Choice, a centrist[1] political party."}, {"url": "https://www.astrotheme.com/astrology/Mario_Monti", "page_content": "You will find below the horoscope of Mario Monti with his interactive chart, an excerpt of his astrological portrait and his planetary dominants.\n\nN. B.: when the birth time is unknown, (12:00 PM (unknown)), these portrait excerpts do not take into account the parameters derived from the time, which means, the domification (Ascendant, astrological houses, etc.). Nonetheless, these analyses remain accurate in any case. Regarding the sources of the birth data in our possession, kindly note that the pages we publish constitute a starting point for more detailed research, even though they seem useful to us. When the sources are contradictory, which occurs rarely, after having analysed them, we choose the most reliable one. Sometimes, we publish a birth date just because it is made available, but we do not claim that is it the best one, by no means.\n\nYou feel in tune with few people. However, this selectivity forges relationships that are long-lasting because they are natural and genuine.\n\nEverything in your realm is sheer subtlety and nuance. The danger is that you may escape realities and indulge in indolence without fulfilling your responsibilities. This is the other side of the coin of your extraordinary sensitivity and your exceptional clear-sightedness.\n\nYou are reserved by nature, you favour emotions and inner life, leaving challenges and audacity to other people. You frequently maintain a certain distance and you share your true feelings with few intimate friends only. It is probably because you know that genuine communication is a difficult exercise.\n\nYou are particularly sensitive to your surroundings, the atmosphere of a place and the climate of a meeting. Your high receptivity allows you to perceive naturally the stakes underlying people and situations.\n\nYou have a deep affinity with the agent Water. In China, this element corresponds to the planet Mercury, the black colour and the number 6.\n\nHowever, this relative indolence benefits you in many instances. The force of inertia principle is well-known. As time goes by, you will establish a reputation as a sociable person, of course quite unpredictable, but so charming. Your somewhat flighty side and your loose behaviour are forgiven, whereas under other circumstances, they would have been condemned. Anyway, you know how to forge efficient supports and unfailing protections.\n\nYou manage to be listened to and to be understood. There is an indisputable laziness in you: you prefer to get round problems rather than to face them with courage and determination.\n\nAs a matter of rule, you loathe tedious works, repetitive tasks and daily chores. You react to monotony with charm and fantasy. No doubt that few people can resist your undeniable gracefulness, your coaxing moods and your whims.\n\nThus, insouciance is found among your flaws: practical constraints are of no concern to you. You can have a comfortable life, but you must choose to surround yourself with persons who are endowed with the sense of reality which you are lacking.\n\nYour nature is peaceful and sensitive to the harmony of your private realm, to beauty and aestheticism. You are enthusiastic and you strive to give your life a playful, refined and cosy dimension.\n\nThe Asian wise man considers that a path is neither good nor bad. One can and must develop one's potentialities. The first step is to thoroughly know oneself.\n\nChinese astrology is brought to us as a legacy of age-old wisdom and invites us to develop an awareness of our inner potential. It is believed that the wise man is not subjected to stellar influences. However, we must gain the lucidity and the distance without which we remain locked up in an implacable destiny. According to the legend of the Circle of Animals, Buddha summoned all the animals to bid them farewell before he left our world. Only twelve species answered Buddha's call. They form the Chinese Zodiac and symbolize the twelve paths of wisdom that are still valid nowadays.\n\nYour Life Path is influenced by the number 3, which highlights communication and creativity, and indicates that ideas and personal realisations are the important features of your destiny. This number is related to altruism, harmony, the capacity to take initiatives, and the gift for passing on all kinds of knowledge and information. So, you are a person of communication, and your concern is to disseminate your ideas and your beliefs, as well as to discover other approaches and schools of thoughts. In a word, you are open to the world! You express yourself better when you are in situations which allow a great deal of personal initiatives. Then, your inventiveness works wonders. On the other hand, you find it hard to fulfil repetitive tasks and to accept the monotony of a life devoid of surprise. Your creativity is as strong as your need for freedom, and people often envy you because, even though you may encounter a few hurdles, your ingenuity enables you to merrily grow on your path.\n\nThe path of life, based on the date of birth, provides indications on the kind of destiny which one is meant to experience. It is one of the elements that must reckoned with, along with the expression number, the active number, the intimacy number, the achievement number, the hereditary number, the dominant numbers or the lacking numbers, or also the area of expression, etc.\n\nTestimonies to numerology are found in the most ancient civilizations and show that numerology pre-dates astrology. This discipline considers the name, the surname, and the date of birth, and ascribes a meaning to alphabetic letters according to the numbers which symbolise them.\n\nRegarding the latter, it must be remembered that even a monster or at least a person who perpetrated odious crimes, has some human qualities, often noticed by his/her close entourage: these excerpts come from computer programmes devoid of polemical intentions and may seem too soft or lenient. The positive side of each personality is deliberately stressed. Negative sides have been erased here - it is not the same in our comprehensive reports on sale - because it could hurt the families of such people. We are hoping that it will not rebound on the victims' side.\n\nWarning: In order to avoid any confusion and any possible controversy, we want to draw your attention upon the fact that this sample of celebrities is very complete and therefore, it also includes undesirable people, since every category is represented: beside artists, musicians, politicians, lawyers, professional soldiers, poets, writers, singers, explorers, scientists, academics, religious figures, saints, philosophers, sages, astrologers, mediums, sportsmen, chess champions, famous victims, historical characters, members of royal families, models, painters, sculptors, and comics authors or other actual celebrities, there are also famous murderers, tyrants and dictators, serial-killers, or other characters whose image is very negative, often rightly so.\n\nPrecision: concerning the horoscopes with a known time of birth, according to the Tradition, we consider that a planet near the beginning (called cuspide) of the next house (less than 2 degrees for the Ascendant and the Midheaven, and less than 1 degree for all other houses) belongs to this house: our texts and dominants take this rule into account. You can also choose not to take this shift into account in the form, and also tick the option Koch or Equal houses system instead of Placidus, the default houses system.\n\nPlanets represent typologies of our human psychology: sensitivity, affectivity, ability to undertake, will-power, mental process, aptitude, and taste for communication etc., all independent character facets are divided here for practical reasons. The twelve signs forming the space where planets move will \"colour\", so to speak, these typologies with each planet being located in its particular sign. They will then enrich the quality of these typologies, as expressed by the planets. The Zodiac is also divided into twelve astrological houses. This makes sense only if the birth time is known because within a few minutes, the twelve houses (including the 1st one, the Ascendant) change significantly. They correspond to twelve specific spheres of life: external behaviour, material, social and family life, relationship, home, love life, daily work, partnership, etc. Each planet located in any given house will then act according to the meaning of its house, and a second colouration again enriches those active forces that the planets symbolize. Finally, relations will settle among planets, creating a third structure, which completes the planets' basic meanings. A set of ancient rules, which has stood the test of experience over hundreds of years (although astrology is in evolution, only reliable elements are integrated into classical studies), are applied to organize the whole chart into a hierarchy and to allow your personality to be interpreted by texts. The planets usually analysed are the Sun, the Moon, Mercury, Venus, Jupiter, Saturn, Uranus, Neptune and Pluto, which means two luminaries (the Sun and the Moon) and 8 planets, a total of 10 planets. Additional secondary elements may be taken into account, such as asteroids Chiron, Vesta, Pallas, Ceres (especially Chiron, more well-known), the Lunar nodes, the Dark Moon or Lilith, and even other bodies: astrology is a discipline on the move. Astrological studies, including astrological portrait, compatibility of couples, predictive work, and horoscopes evolve and become more accurate or deeper, as time goes by.\n\nThe analysis of an astrological portrait consists in understanding four types of elements which interact with one another: ten planets, twelve zodiacal signs, twelve houses, and what are called aspects between planets (the 11 aspects most commonly used are: conjunction, opposition, square, trine, sextile, quincunx, semi-sextile, sesqui-quadrate, quintile and bi-quintile. The first 5 aspects enumerated are called major aspects).\n\nAstrological reports describe many of the character traits and they sometimes go deeper into the understanding of a personality. Please, always keep in mind that human beings are continuously evolving and that many parts of our psychological structures are likely to be expressed later, after having undergone significant life's experiences. It is advised to read a portrait with hindsight in order to appreciate its astrological content. Under this condition, you will be able to take full advantage of this type of study.\n\nThis text is only an excerpt from of Mario Monti's portrait. If you want to get your own astrological portrait, much more comprehensive that this present excerpt, you can order it at this page . Do you belong to the Jupiterian type, benevolent and generous? The Martian type, active and a go-getter? The Venusian type, charming and seductive? The Lunar type, imaginative and sensitive? The Solar type, noble and charismatic? The Uranian type, original, uncompromising and a freedom-lover? The Plutonian type, domineering and secretive? The Mercurian type, cerebral, inquiring and quick? The Neptunian type, visionary, capable of empathy and impressionable? The Saturnian type, profound, persevering and responsible? Are you more of the Fire type, energetic and intuitive? The Water type, sentimental and receptive? The Earth type, realistic and efficient? Or the Air type, gifted in communication and highly intellectual? 11 planetary dominants and 57 characteristics are reviewed, quantified, and interpreted; then, your psychological portrait is described in detail, in a comprehensive document of approximately 32-36 pages, full of engrossing and original pieces of information about yourself.\n\nAs strange as it may seem, Mario Monti, to you, action means behind the scenes and secrecy. The form of your action is important, as compared to what you actually do. You want no publicity on what you are doing and the reasons of your struggle! You loathe... (excerpt)\n\nMario Monti, the way you take action is quite paradoxical: you carry out your business perfectly well when you are in a teamwork with collective goals, but you do so in your original and individualistic manner: this is your main peculiarity. Your concern is to express your originality and your specificity while remaining immersed in a human community. You are curt and not very flexible. You are inventive and you easily fight authority, just because its very principle runs counter to the sacred values of freedom, independence and, above all, the absence of constraint. Competition does not appeal to you. You prefer to be useful and to conquer new territories of the humanitarian or the intellectual type. On the sexual plane, you are also often original and surprising regarding your fantasies and your tastes.\n\nWillpower and appearance united! You are so lucky, Mario Monti, that your inner self and your behaviour merge to increase your energy and your vitality. Since the Sun represents your self-assertiveness and your profound personality, he expresses itself best when this configuration is strongly featured. Indeed, you... (excerpt)\n\nOnce you find your soul mate, your home is usually harmonious. In your couple, love is immense, even mystical. Like a wave, it bathes the shores of your emotions, which range from the noblest feelings to the wildest physical passions. Since you merely live in concrete life, it is necessary that your partner be well grounded, so that your home is well up kept and your children are properly reared!\n\nYou loathe solitude and you prefer to be caught in the nets of a woman even though she does not match your personality. If, by lack of chance, your partner belongs to the domineering and unscrupulous type, you may be trapped and wake up bitter and disappointed that you extended for too long the illusion of a marvellous story.\n\nPisces\u0092 waters are shifting and changeable. When other opportunities appeal to you, you are able to handle two relationships simultaneously. You achieve an alternate osmosis with your partners and you see no harm in doing so, because you live the instant with plasticity and in communion.\n\nYou live for love and through love. Your only weakness may be your lack of determination at the early stage of a relationship. However, once you get started, if there is any compatibility, you trap your prey with your overflowing affectivity and your unlimited sensuality.\n\nYou fall in love frequently and according to how your encounters develop. You adjust to the person you set your heart on and you may harbour illusions because your imagination and your capacity to intensely live a virtual life are very strong. You are utopian and you are so gentle that you usually achieve your aims in spite of your boundless passivity: you seldom take the first step, except when you are thrown a line, which is as big as a tree trunk\n\nIn love, Sir, you are the very type of the sentimental romantic in the highest meaning of the term. You live your love affairs in your mind. You upkeep the weft of your endless daydreamings just to exacerbate your emotions and your feelings, over and over again.\n\nAs you are born under this sign, you are emotional, sensitive, dedicated, adaptable, nice, wild, compassionate, romantic, imaginative, flexible, opportunist, intuitive, impossible to categorized, irrational, seductive, placid, secretive, introverted, pleasant, artistic, and charming. But you may also be indecisive, moody, passive, confused, wavering, lazy, scatterbrained, vulnerable, unpredictable and gullible.\n\nPsychologically speaking, your nature is adaptable and receptive, exactly the opposite of the sign of Virgo whose very essence is to analyze every detail, thus creating a definite duality between the self and the outside world: conversely, Pisces absorbs and erases all forms of differentiation they face. With Pisces, there is no opposition, no conflict and no individual reaction. There is only fusion, non-separation, a perpetual and mobile spreading of the self over some blurred and huge sensation of sympathy with the environment. It is the absolute reign of feelings and emotions over the intellect and its separative logics.\n\nThe ruler of the Ascendant, Mario Monti, is Uranus. In the sign of Gemini, it endows you with flexibility and the capacity to undertake several things simultaneously, sometimes at the risk of spreading yourself too thing and getting discouraged. Your innate communication skills match your insatiable curiosity for people and for things.\n\nThe ruler of the Ascendant, also referred to as the chart ruler, brings a few interesting nuances to the meanings provided by the Sun and the Ascendant. The sign in which the ruler of the Ascendant is posited fine-tunes the style of personality described by the Sun and the Ascendant. It may strengthen it if the sign is identical to either of them.\n\nYou are interested in things that are out of the ordinary. Your erotic imagination may be immense and inexhaustible. You belong to the cerebral type and you cannot separate physical and sentimental aspects from your imagination\u0092s intense activity. As a result, you explore with lucidity all the possibilities that may suit you best.\n\nYou avoid problems that may cause emotional or sentimental complications. Because you are often disconcerting, your partner may need some time to adjust: you disappear suddenly when you do not want to deal too closely with your individuality. And you reappear as quickly with excuses and a charming casualness, and again, you are disconcerting!\n\nYou are loyal, faithful and surprising. Once you find your soul mate, you feel more comfortable and, if the harmony with your partner is rich enough, you may stay with her your whole life through. You certainly have moments that seem strange to your partner, for instance when you are impersonal or even cold. But your natural magnetism, your communication skills and your shrewdness as you play with words, work wonders for patching things up.\n\nThe distance you maintain, as well as your lack of emotionalism, may suddenly disappear to give room for a real relationship, since you are prone to mood swings. The necessary condition is that you have centres of interest to share with your partner. Converging passions will ensure that the magic of your relationship can develop. Ideally, a deep friendship should be the basis of your initial relationship, because friendship is a feeling that particularly suits you; in such a case, imperceptibly, conducive closeness may transform friendship into the true love you give yourself up to eventually.\n\nIn love, Sir, you are totally elusive. The human warmth you show in your group meetings quickly turns into a distant and sober attitude as soon as you are alone together. It is obvious that it may cause some problems if you were thought to be different. Your reluctance to talk about yourself, although not disturbing under other circumstances, is quite inappropriate in the private sphere.\n\nAs you are born under this sign, you are idealistic, altruistic, detached, independent, original, surprising, gifted, contradictory, innovative, humanistic, likeable, friendly, self-confident, impassive, quiet, intuitive, creative, charitable, elusive, disconcerting, generous, tolerant, paradoxical, and you cannot stand any kind of constraint. But you may also be marginal, resigned, distant, utopian, maladjusted, eccentric and cold.\n\nIn the sentimental sphere, you are particularly sensitive to the values of friendship, in the sense that you see yourself as a link within a chain, certainly a different and original one, but with no will to flatter your ego or to individually assert yourself. On the contrary, your aim is to immerge yourself in your friendly relations and to participate in projects and ideals of the whole human community.\n\nMario Monti, you usually make connections between the possessive aspect of things and your feelings, which are expressed slowly but will grow deeper and steadier as soon as you become attached. Therefore, you need to trust the person you set your heart on and to feel that,... (excerpt)\n\nLove at first sight, flash in the pan, amorous impulsiveness? All these are part of your way of loving or to fall in love, Mario Monti. Throughout your relationship, you maintain this kind of jerky and lively style, that may seem childish or naïve, but that is so generous and cheerful! You are undeniably possessive and you are not concerned with your partner's opinion but, fortunately, you readily forgive because of your spontaneity and your authenticity. When your relationship is intense, everything is fine. There is no romanticism, no complications with you. You love with ardour and, except for a few crazes and opportunities for new pastures here and there, the only danger may be that boredom settles in. In that case, you leave without regret and you quickly forget what consumed you, not so long ago.\n\nIn your chart, the Sun is in Pisces and Venus, in Aries. The spring and ingenuous fieriness of Venus in Aries resists the lucid scepticism of the Sun in Pisces. All emotions make sense and they immediately stimulate the natural enthusiasm of your Venusian sign. However, whatever your senses and affectivity stir up, it cannot quench the solar sign's thirst for the absolute. The contrast is obvious: on the one hand, the ability to believe in the \u0093I love you\u0094 of the moment and on the other hand, the subtlety of the affective models which cannot be satisfied with a fleeting excitement or a transient love. These contradictions bring about complications into your love life, but they are also part of the richness and the charm of the configuration. As long as you manage to reconcile detachment (Pisces) with involvement (Aries), subtlety with animality, candour with distance, you are able to cope with any eventuality, alternately shifting from enchantment to lucidity A thorny programme, a challenge up to your solar sign's ambitions and to your Venusian sign's thirst for novelty. Beyond your contradictions, from beginning (Aries) to end (Pisces), love is a process of constant renewal.\n\nYour intellect and your communication abilities are not directed towards any particular field, Mario Monti: indeed, you are by nature curious, lively, mobile and you generally adjust remarkably well to your surroundings. Your versatile personality prompts you to get interested in many things, and it is not exaggerated... (excerpt)\n\nYour thinking process works on a rather instinctive and intuitive mode, Mario Monti. You \u0093feel\u0094 more than you understand, as if your reasoning were not active. Your strong receptivity and your natural empathy make you an understanding, pleasant, warm and benevolent person although you may be neglectful, even heedless. You are shy and anxious and you prefer to withdraw and to isolate yourself in a quiet place in order to give free rein to your inspiration, rather than to assert yourself. Despite your lively imagination, it may be hard for you to get out of the flow of your mystical and irrational thoughts, with the result that you become even more worried and impressionable. You must develop your logic, rational mind and your willpower, so as to gain self-confidence and creativity. Try and see...\n\nMario Monti, it is likely that you are popular in your work environment, and you may even be considered to be some kind of star by your colleagues. Or, if it is not the case, you have a clear tendency to react emotionally, very quickly and strongly... (excerpt)\n\nYou seek other people's attention and approval, Mario Monti, you need to exteriorize your emotions, to interpret them, and even to dramatically enact them because it is essential for you to shine at the front of the stage. You always try to achieve more and better than anyone else and, whatever the situation may be, you strive to remain warm, generous, loyal, honest, straightforward and courageous. You are always available when your assistance or your advice is needed and you are glad and proud to help. However, you must be wary not to overdo, as you may be domineering! You are not indispensable and people might think that you are self-centered and authoritarian when you handle things with no regard for your entourage's views. It would be regrettable that you project such an image because it may only reveal a lack of self-confidence and you are only trying to reassure yourself...\n\nAfter this paragraph about dominant planets, of Mario Monti, here are the character traits that you must read more carefully than the previous texts since they are very specific: the texts about dominant planets only give background information about the personality and remain quite general: they emphasize or, on the contrary, mitigate different particularities or facets of a personality. A human being is a complex whole and only bodies of texts can attempt to successfully figure out all the finer points.\n\nYour personal interests are always important and you never forget them, which doesn't mean that you are self-centered, but only that you behave according to what is in harmony with your deep nature!\n\nIt is likely that you never go unnoticed when you are in a crowd or a in reunion: an important 1st house suggests that you are a charismatic person with above average vital energy, especially if the Sun is present in this sector.\n\nWith a dominant 1st house, your magnetism is powerful, and your individuality as well as your willpower are out of the ordinary. You are a determined, strong-willed, and assertive person, with this relative criterion at least.\n\nAs the 3rd house is one of the most important houses in your chart, communication plays a major role in your life or in your deep motivations: frequent short trips, open-mindedness - which may offset a lack of mutable signs for instance - listening, discussion, interest in learning, knowledge accumulation or long-term studies, etc., are all areas that greatly appeal to you and are part of your daily life.\n\nYour 7th house is one of your dominant houses: it symbolizes other people, marriages, associations, contracts, and partnerships. Your personal achievement and maybe your problems - depending on the rest of your chart - are mainly influenced by your rapports with others, the area in which you tend to commit yourself a lot. You appreciate communication, and you give importance to others' opinions. Success requires the support of others, which seems obvious and natural to you. Your marriage generally contributes to your fulfilment.\n\nThe 7th, 3rd and 1st houses are the most prominent ones in your birth chart. From the analysis of the most tenanted houses, the astrologer identifies your most significant fields or spheres of activity. They deal with what you are experiencing - or what you will be brought to experience one day - or they deal with your inner motivations.\n\nWith Gemini as a dominant sign, your qualities include being lively, curious, mobile, clever, and flexible: you often make others dizzy, and you may come across as a dilettante - a bit inquisitive, shallow, and insensitive because you may be too intellectualizing. However, your natural curiosity, a nice quality, and your quick humour, allow you to demonstrate to everyone how much they may gain from your company, and that your apparent flightiness hides an appetite (particularly mental) for life, which itself conceals a terrific charm!\n\nWith Leo as a dominant sign, you naturally shine brightly. Your dignity, your sense of honour, and your generosity can almost turn you into a solar mythological hero, a knight or a lord from the ancient times. People may blame you for your selfishness, your pride or your somewhat loud authority, but if you are self-confident, kind-hearted and strong-willed, it surely makes up for your little flaws, as long as they remain moderate...\n\nAquarius is one of the most important signs in your natal chart: it endows your personality - at least one of its facets - with originality, to the point of eccentricity, in spite of a sometimes distant and humane side. Likeable and impassive at the same time, you are a paradoxical man, very hard to define because the two planets Uranus and Saturn blend their qualities to create the so complicated and endearing sign that inspires your character. Saturn's seriousness and impassivity is added to Uranus' rebellion, talent, individualism, charisma, extravagance, and unpredictability! One of your main characteristics is that you never open up on a personal basis, but you tend to do so easily in public. You are actually quite strange. Sexy and charming in public, despite your nice and sociable character, you could frustrate many of your admirers in private because of your impossibility to show deep and warm affection, emotions, tears... But appearance and reality are two different things anyway - you are a kind of a genius, or you have at least a tremendous charm with this sign. You have many friends and an active social life. If you are detached in your love life - only in this aspect, since the rest of chart will confirm it or not - this is no big deal!\n\nThus, you display some of the three signs' characteristics, a bit like a superposition of features on the rest of your chart, and it is all the more so if the sign is emphasized.\n\nIn your natal chart, the three most important signs - according to criteria mentioned above - are in decreasing order of strength Aquarius, Leo and Gemini. In general, these signs are important because your Ascendant or your Sun is located there. But this is not always the case: there may be a cluster of planets, or a planet may be near an angle other than the Midheaven or Ascendant. It may also be because two or three planets are considered to be very active because they form numerous aspects from these signs.\n\nYour vulnerability lies in your too serious and austere side, which may lead to unwanted loneliness and affective frustration. This generally does not last because Saturnians often hide deep down a golden heart that ends up revealing itself...\n\nLike the Jupiterian, your Saturnian facet prompts you to seek the essential, security, and longevity. However, the difference with the former is that you will never give priority to wealth or \"the bigger, the better\" philosophy for the sake of power. Saturn, like Jupiter, symbolizes social integration, and it is usually considered positive to have a harmonic Jupiter and Saturn in one's chart because of their social adaptation capacities.\n\nYou often look austere, but it is only an appearance, a kind of modesty or reserve; however, it is true that the Saturnian, who is fond of time, effort, asceticism, rigour and sobriety, may have popularity issues. Nevertheless, honesty and straightforwardness, reliability, as well as slow, wise and deep mental process, although not very popular and visible qualities, eventually become noticed and appreciated. Saturnians' second part of life is usually easier and more fulfilling.\n\nSaturn is part of your dominant planets: among the facets of your character, you have a grave and serious side, wise and somewhat severe, since your concentration can be powerful, to the detriment of carelessness and friendliness.\n\nAs a Lunar character, you find it difficult to control yourself, you have to deal with your moods, and you must be careful not to stay passive in front of events: nothing is handed on a plate, and although your sensitivity is rich, even richer than most people's, you must make a move and spare some of your energy for... action!\n\nOne of the consequences of your spontaneity may turn into popularity, or even fame: the crowd is a living and complex entity, and it always appreciates truth and sincerity rather than calculation and total self-control.\n\nThe Moon is one of the most important planets in your chart and endows you with a receptive, emotive, and imaginative nature. You have an innate ability to instinctively absorb atmospheres and impressions that nurture you, and as a result, you are often dreaming your life away rather than actually living it.\n\nTherefore, you are certainly a passionate man who is on the lookout for any kind of action or revolutionary idea, and you are keen on new things. Uranians are never predictable, and it is especially when they are believed to be stable and well settled that... they change everything - their life, partner, and job! In fact, you are allergic to any kind of routine, although avoiding it must give way to many risks.\n\nUranus is Mercury's higher octave and as such, he borrows some of its traits of character; namely, a tendency to intellectualize situations and emotions with affective detachment, or at least jagged affectivity.\n\nUranus is among your dominant planets: just like Neptune and Pluto, Uranian typology is less clearly defined than the so-called classical seven planets that are visible to the naked eye, from the Sun to Saturn. However, it is possible to associate your Uranian nature with a few clear characteristics: Uranus rhymes with independence, freedom, originality, or even rebelliousness and marginality, when things go wrong...\n\nRegarding astrological houses, the principle is even simpler: the twelve houses correspond to twelve fields of life, and planets tenanting any given house increase that house's importance and highlight all relevant life departments: it may be marriage, work, friendship etc.\n\nIndeed, it is quite the same situation with signs and houses. If planets symbolize characters, signs represent hues - the mental, emotional and physical structures of an individual. The sign in which a planet is posited is like a character whose features are modified according to the place where he lives. In a chart, there are usually one, two or three highlighted signs that allow to rapidly describe its owner.\n\nThe ten planets - the Sun throughout Pluto - are a bit like ten characters in a role-play, each one has its own personality, its own way of acting, its own strengths and weaknesses. They actually represent a classification into ten distinct personalities, and astrologers have always tried to associate one or several dominant planets to a natal chart as well as dominant signs and houses.\n\nThe issue of dominant planets has existed since the mists of time in astrology: how nice it would be if a person could be described with a few words and one or several planets that would represent their character, without having to analyse such elements as rulerships, angularities, houses, etc!\n\nYour angular houses, namely, the 1st, 4th, 7th and 10th houses, are very emphasized in your chart, Mario Monti: according to the Tradition, they are the strongest and most dynamic houses. Should the rest of your chart concur, angular houses suggest that you are an enterprising, energetic and assertive man. Indeed, angular houses are said to generate impulsions and to give a powerful and domineering personality.\n\nPlanets are evaluated according to a whole set of criteria that includes comprehensive Western astrology rules. At their turn, planets emphasize specific types of houses, signs, repartitions etc., as previously explained.\n\nThe first ones are the most important ones, the most \"noticeable\" and energetic houses. They are the 1st, 4th, 7th and 10th houses. Their cuspides correspond to four famous angles: Ascendant for the 1st house, Imum Coeli for the 4th house, Descendant, opposite the Ascendant, for the 7th house and Midheaven for the 10th house, opposite the Imum Coeli.\n\nThe Fixed mode corresponds to a majority of elements in your chart, Mario Monti, and represents the desire for security and durability: you are able to concretely appreciate a situation and its stability. You definitely prefer to play the role of a loyal, obstinate and hard-working person, rather than to try new and risky experiences - beware, however, not to confuse obstinacy with intransigence. You structure, cement, and strengthen everything you find on your way: it is your nature, although you are not especially interested in swiftness: slow and steady...\n\nThe twelve zodiacal signs are split up into three groups or modes, called quadruplicities, a learned word meaning only that these three groups include four signs. The Cardinal, Fixed and Mutable modes are more or less represented in your natal chart, depending on planets' positions and importance, and on angles in the twelve signs.\n\nEarth qualities are under-represented in your chart, with only 0.00% instead of the average 25%. Deficiency in Earth may indicate that you have no interest in material and concrete values. It is likely that you live too much in your heart or in your mind, or even in your enthusiasm! The fact remains that you may end up in tricky situations, due to your lack of good sense or forethought: material life is unavoidable even if you are rather idealistic, dreamy, or easily content. You must tackle concrete life necessities, for fear of... being forced to cope with them, later, in much more unpleasant ways!\n\nMario Monti, Fire is dominant in your natal chart and endows you with intuition, energy, courage, self-confidence, and enthusiasm! You are inclined to be passionate, you assert your willpower, you move forward, and come hell or high water, you achieve your dreams and your goals. The relative weakness of this element is the difficulty to step back or a kind of boldness that may prompt you to do foolish things.\n\nCheers for communication and mobility, Mario Monti! The predominance of Air signs in your chart favours and amplifies your taste for relations and for all kinds of short trips, whether real (travels) or symbolic (new ideas, mind speculations). You gain in flexibility and adaptability what you lose in self-assertion or in pragmatism.\n\nMario Monti, here are the graphs of your Elements and Modes, based on planets' position and angles in the twelve signs:\n\nMario Monti, the nocturnal North-eastern quadrant, consisting of the 1st, 2nd and 3rd houses, prevails in your chart: this sector favours self-assertion and material security to the detriment of your perception of others. You consider self-transformation to be a hazardous adventure. You are inclined to seek stability and you tend to protect yourself with your actions. Possession, acquisition but also communication, without opening up too much, are part of your deep motivations. You are rather autonomous and constant, however it is important that you pay more attention to others, so that you can improve your outcomes.\n\nEach quadrant is a combination of the four hemispheres of your birth chart and relates to a character typology. The Southern hemisphere \u0096 the top of your chart, around the Midheaven \u0096 is associated with extraversion, action, and public life, whereas the Northern hemisphere prompts to introversion, reflexion, and private life. The Eastern hemisphere \u0096 the left part, around the Ascendant \u0096 is linked to your ego and your willpower, whereas the Western hemisphere indicates how other people influence you, and how flexible you are when you make a decision.\n\nThese general character traits must not be taken literally; they are, somehow, preparing for the chart reading. They allow to understand the second part of the analysis, which is more detailed and precise. It focuses on every area of the personality and provides a synthesis of all the above-mentioned parameters according to sound hierarchical rules.\n\nLastly, there are two other criteria: accentuations (angular, succedent and cadent) which are a classification of astrological houses and types of decanates that are occupied (each sign is divided into three decanates of ten degrees each). They provide some additional informations.\n\nThere are three types of dominants: dominant planets, dominant signs and dominant houses. The novice thinks astrology means only \"to be Aries\" or sometimes, for example, \"to be Aries Ascendant Virgo\". It is actually far more complex. Although the Sun and the Ascendant alone may reveal a large part of the character - approximately a third or a half of your psychological signature, a person is neither \"just the Sun\" (called the sign) nor just \"the first house\" (the Ascendant). Thus, a particular planet's influence may be significantly increased; a particular sign or house may contain a group of planets that will bring nuances and sometimes weaken the role of the Ascendant, of the Sun sign etc.\n\nThen, there are three additional distributions: elements (called triplicity since there are three groups of signs for each one) - Fire, Air, Earth and Water - corresponding to a character typology, modality (or quadruplicity with four groups of signs for each one) - Cardinal, Fixed and Mutable - and polarity (Yin and Yang).\n\nThe overall chart analysis begins with the observation of three sorts of planetary distributions in the chart: Eastern or Western hemisphere, Northern or Southern hemisphere, and quadrants (North-eastern, North-western, South-eastern and South-western). These three distributions give a general tone in terms of introversion and extraversion, willpower, sociability, and behavioural predispositions.\n\nThese different criteria allow a planet to be highlighted and lead to useful conclusions when interpreting the chart.\n\nThe first step is to evaluate the importance of each planet. This is what we call identifying the dominant planets. This process obeys rules that depend on the astrologer's sensitivity and experience but it also has precise and steady bases: thus, we can take into account the parameters of a planet's activity (the number of active aspects a planet forms, the importance of each aspect according to its nature and its exactness), angularity parameters; (proximity to the four angles, Ascendant, Midheaven, Descendant and Imum Coeli or Nadir, all of them being evaluated numerically, according to the kind of angle and the planet-angle distance) and quality parameters (rulership, exaltation, exile and fall). Finally, other criteria such as the rulership of the Ascendant and the Midheaven etc. are important.\n\nIn brief, a natal chart is composed of ten planets: two luminaries, the Sun and the Moon, three fast-moving or individual planets, Mercury, Venus and Mars, two slow-moving planets, Jupiter and Saturn, and three very slow-moving planets, Uranus, Neptune and Pluto. Additional secondary elements are: the Lunar Nodes, the Dark Moon or Lilith, Chiron and other minor objects. They are all posited on the Zodiac wheel consisting of twelve signs, from Aries to Pisces, and divided into twelve astrological houses.\n\nIn the first part, an overall analysis of the chart enables us to figure out the personality's main features and to emphasize several points that are confirmed or not in the detailed analysis: in any case, those general traits are taken into account. Human personality is an infinitely intricate entity and describing it is a complex task. Claiming to rapidly summarize it is illusory, although it does not mean that it is an impossible challenge. It is essential to read a natal chart several times in order to absorb all its different meanings and to grasp all this complexity. But the exercise is worthwhile.\n\nWhen interpreting a natal chart, the best method is to start gradually from general features to specific ones. Thus, there is usually a plan to be followed, from the overall analysis of the chart and its structure, to the description of its different character traits.\n\nIn a matter of minutes, you can get at your email address your astrological portrait (approximately 32 pages), a much more comprehensive report than this portrait of Mario Monti.\n\nHere are some character traits from Mario Monti's birth chart. This description is far from being comprehensive but it can shed light on his/her personality, which is still interesting for professional astrologers or astrology lovers.\n\nDisclaimer: these short excerpts of astrological charts are computer processed. They are, by no means, of a personal nature. This principle is valid for the 63,441 celebrities included in our database. These texts provide the meanings of planets, or combination of planets, in signs and in houses, as well as the interpretations of planetary dominants in line with modern Western astrology rules. Moreover, since Astrotheme is not a polemic website, no negative aspect which may damage the good reputation of a celebrity is posted here, unlike in the comprehensive astrological portrait.\n\nMario Monti (Italian pronunciation: ; born 19 March 1943 in Varese (source: Grazia Bordoni, birth certificate)) is an Italian economist and politician. He served as a European Commissioner for two consecutive terms and was appointed rector and president of Bocconi University. He currently serves as a Senator for life in the Italian Senate, and has been asked to lead the new government in Italy after former Prime Minister Silvio Berlusconi's resignation. Education and academic career Mario Monti holds a degree in economics and management from Bocconi University, Milan. He completed graduate studies at Yale University, where he studied under James Tobin, the Nobel prize-winning economist.\n\n* A planet less than 1° from the next House cusp is considered to be posited in the said House. 2° when the AS and the MC are involved\n\nProserpina is related to mysteries, revival and reconstruction, as well as cycles. She enriches the unconscious, and gives the possibility to combine modern life with spirituality, the East with the West, and mysticism with concrete life.\n\nProserpina , sometimes referred to as Persephone, is a trans-Plutonian hypothetical planet. N.B.: numerous astrologers believe neither in the influence of Proserpina, nor in that of all hypothetical planets, asteroids, Arabic parts or other fictitious points.\n\nPoseidon brings about wisdom, a clear mind, and sometimes spirituality. On the downside, it may make the person dogmatic, manipulative, or out of touch with reality.\n\nPoseidon is a hypothetical trans-Neptunian planet, the existence of which is not proven. It was invented by Alfred Witte, founder of the famous Hamburg School, and by his student, Friedrich Sieggrün. N.B.: numerous astrologers believe neither in the influence of Poseidon, nor in that of all hypothetical planets, asteroids, Arabic parts or other fictitious points.\n\nVulcanus, sometimes said to be the higher octave of Saturn, provides strength to improve collective relations, to structure things, to be efficient, and to get straight to the point. On the downside, he may bring about arrogance and scattered efforts.\n\nVulcanus is a hypothetical trans-Neptunian planet, the existence of which is not proven. It was invented by Alfred Witte, founder of the famous Hamburg School, and by his student, Friedrich Sieggrün. N.B.: numerous astrologers believe neither in the influence of Vulcanus, nor in that of all hypothetical planets, asteroids, Arabic parts or other fictitious points.\n\nAdmetos is related to the deepness of the mind, asceticism, simplicity, and analytical mind. In tough aspect, it may make the person nit-picking, inflexible, and narrow-minded.\n\nAdmetos is a hypothetical trans-Neptunian planet, the existence of which is not proven. It was invented by Alfred Witte, founder of the famous Hamburg School, and by his student, Friedrich Sieggrün. N.B.: numerous astrologers believe neither in the influence of Admetos, nor in that of all hypothetical planets, asteroids, Arabic parts or other fictitious points.\n\nApollon is related to the ability to synthesise, as well as to broad-mindedness, and fame. In difficult aspect, it may bring about superficiality or extravagance.\n\nApollon is a hypothetical trans-Neptunian planet, the existence of which is not proven. It was invented by Alfred Witte, founder of the famous Hamburg School, and by his student, Friedrich Sieggrün. N.B.: numerous astrologers believe neither in the influence of Apollon, nor in that of all hypothetical planets, asteroids, Arabic parts or other fictitious points.\n\nKronos is a hypothetical trans-Neptunian planet, the existence of which is not proven. It was invented by Alfred Witte, founder of the famous Hamburg School, and by his student, Friedrich Sieggrün. N.B.: numerous astrologers believe neither in the influence of Kronos, nor in that of all hypothetical planets, asteroids, Arabic parts or other fictitious points.\n\nZeus is related to creativity, as well as to organisational and leadership capacities. On the downside, it may lead to aggressiveness and to excessive militancy.\n\nZeus is a hypothetical trans-Neptunian planet, the existence of which is not proven. It was invented by Alfred Witte, founder of the famous Hamburg School, and by his student, Friedrich Sieggrün. N.B.: numerous astrologers believe neither in the influence of Zeus, nor in that of all hypothetical planets, asteroids, Arabic parts or other fictitious points.\n\nHades corresponds to intellectual rigour, service rendered to people, the purpose of being useful. On the downside; it leads to carelessness, indifference, apathy, and mess.\n\nHades is a hypothetical trans-Neptunian planet, the existence of which is not proven. It was invented by Alfred Witte, founder of the famous Hamburg School, and by his student, Friedrich Sieggrün. N.B.: numerous astrologers believe neither in the influence of Hades, nor in that of all hypothetical planets, asteroids, Arabic parts or other fictitious points.\n\nOn the upside, Cupido is related to socialisation, the arts, and marital life. On the downside, it indicates vanity, addiction to pleasures, and being strongly influenced by groups of people.\n\nCupido is a hypothetical trans-Neptunian planet, the existence of which is not proven. It was invented by Alfred Witte, founder of the famous Hamburg School, and by his student, Friedrich Sieggrün. N.B.: numerous astrologers believe neither in the influence of Cupido, nor in that of all hypothetical planets, asteroids, Arabic parts or other fictitious points.\n\nN.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports.\n\nSensual, fickle, and impulsive character overindulging in sensuality and the pleasures of the table, shamelessly. One becomes quickly infatuated and gets bored as rapidly. Constantly going from one partner to another only brings about increasing frustrations. One must understand the difference between sex and love, and that the former is most unlikely to last forever. If one does not pull oneself together, some day, one may wake up, in poor health, to find out that years have gone by, and that one is left with a meaningless life. Although Pisces is considered a mute sign, this degree indicates that gossips cause serious troubles and that bad reputation threatens men and women alike.\n\nThe East Point is sometimes considered to be a second Ascendant, less important, but also related to how one is seen by other people, and to how one expresses one's personality.\n\nThe East Point is a fictitious point at the intersection of two great circles, the Ecliptic and the great vertical circle (Prime Vertical) in the East of the birthplace, linking the East, the Zenith, the West, and the Nadir. It is always located in the East of the chart, around the Ascendant.\n\nN.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports.\n\nSociable, sincere, and fickle character. One is more suitable for teamwork rather than for solitary effort. Good friends abound, and establishing punctual associations with them is very profitable. All activities aiming at the improvement of the public good are highly favoured. Initiatives which bring together people of complementary nature and skills result in big and effortless success.\n\nThe Vertex is sometimes considered to be the second Descendant because, like the latter, it is related to communication and exchanges. It has to do with associations and fated encounters, those that are not chosen, and reveals the type of sensitivity and reactivity we have in our dealings with other people: a refined and tolerant way in Libra, straightforward and spontaneous in Aries, etc.\n\nThe Vertex , sometimes called counter-Ascendant, is a fictitious point which is at the intersection of two great circles, the Ecliptic and the great vertical circle (Prime Vertical) in the West of the birthplace, linking the East, the Zenith, the West, and the Nadir. It is always located in the West of the chart around the Descendant. It is the chart's fifth angle, so to speak, less important than the other angles. Its interpretation is controversial, because certain astrologers pay no attention to it.\n\nThe Twelfth House is the sphere of hidden things, enemies, closed or remote places (hospital, prison, convent etc.), ordeals, secrecy, solitude, long-term illnesses but also sincere devotion and genuine compassion. It is in analogy with Pisces and Neptune.\n\nThe Eleventh House is the sphere of friendship and protection, projects, search for social acceptance and security, collective and humanitarian actions. It is in analogy with Aquarius and Uranus, and Saturn to a lesser extent. It's a succedent and quite important house.\n\nN.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports.\n\nIntelligent, enterprising, and pleasant character. Although good ideas abound, they require thorough analysis and organisation. Projects are nicely put forward, but their implementation is handicapped by unpreparedness, and solutions to cropping problems seem to be adopted at random. One must seek the advice of a friend or of one's spouse. Partnerships and teamwork are the key which opens the door to success, honours, and fame.\n\nThe Tenth House still called the Midheaven , is the highest point amidst the houses, at the top of the chart, in the South, and relates to destiny in general and career (and not daily work as meant by the Sixth House). The Midheaven represents our achievements and goals in the social sphere, our social position in society, and becomes more and more important as we get older. It is in analogy with Capricorn and Saturn. The Tenth House is the most important angular house along with the Ascendant.\n\nThe Ninth House is the sphere of high studies, both physical and mental journeys (philosophy, spirituality), rebelliousness, changes of scenery, desire for dealing with the unknown. It is in analogy with Sagittarius and Jupiter. It is a cadent house, less important than the angular and succedent ones.\n\nThe Eighth House is the sphere of emotional security, the depths of the self, secrets and paranormal, transcendence, sexuality, mysteries, upheavals, surgical operations, others' money (investments, inheritances), crises, transformation after evolution, death. It is in analogy with Scorpio and Pluto, and Mars to a lesser extent. It is a succedent and quite important house.\n\nN.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports.\n\nVigilant, rebellious, and quarrelsome character. This degree warns against violence, whether one is the perpetrator or the victim. Recourse to force and to all aggressive means must be avoided at any cost. One ought to make use of one's intelligence and painstaking qualities in order to turn the destructive scythe into a productive tool which would only harvest wheat fields, or whatever they stand for in one's area of action.\n\nThe Seventh House also called the Descendant (in front of the Ascendant) is the sphere of partnership, marriage, contracts, relationships with others, the outer world. It is in analogy with Libra and Venus, and Saturn to a lesser extent. It is an angular and important house.\n\nThe Sixth House is the sphere of apprenticeship and effort in the work environment, daily life, health on a daily basis and not operations or long-term diseases, relationships with co-workers or subordinates, desire for improvement, analysis and detail. It is in analogy with Virgo and Mercury. It is a cadent house, less important than the angular and succedent ones.\n\nThe Fifth House is the sphere of pleasures and love affairs (but not commitment or marriage), creations and entertainments, children, arts and game. It is in analogy with Leo and the Sun. It's a succedent and quite important house.\n\nN.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports.\n\nAmbitious, shrewd, and watchful character. In most cases, one's cleverness is wasted in dubious business or insincere love relationships. All occupations in education, agriculture, or driving an animal, a car, or a tank, are favoured. One is spurred by the need to wield power, and one obtains a position of authority, for better or for worse, depending on the general trend of the natal chart.\n\nThe Fourth House also called Immum Coeli is the sphere of inner emotions, family, the father, home and roots, but also the home one creates. It's Home Sweet Home, security and cocoon. It is in analogy with Cancer and the Moon. It's an angular and important house.\n\nThe Third House is the sphere of social and intellectual apprenticeship, studies, relationships with close people and surroundings, short trips, light-hearted and quick contacts, correspondences. It is in analogy with Gemini and Mercury. It's a cadent house, less important than the angular and succedent ones.\n\nThe Second House is the sphere of material security, the money we earn, our possessions, also in a symbolic meaning (close people etc). It is in analogy with Taurus and Venus. It is a succedent house, quite important.\n\nN.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports.\n\nThe First House or Ascendant represents one's behaviour in the eyes of others and also one's health. It corresponds to the way the individual acts in the world. It is the image of the personality as seen by others and the person's visible behaviour expressed outwardly. The 1st House is in analogy with Aries and thus Mars too and then the Sun. It is an angular house, the most important one with the Midheaven, maybe even more so due to its link with the body and health; the Ascendant is as important as the Sun in a natal chart.\n\nN.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports.\n\nIntelligent, enterprising, and pleasant character. Although good ideas abound, they require thorough analysis and organisation. Projects are nicely put forward, but their implementation is handicapped by unpreparedness, and solutions to cropping problems seem to be adopted at random. One must seek the advice of a friend or of one's spouse. Partnerships and teamwork are the key which opens the door to success, honours, and fame.\n\nYour destiny is commensurate with the image of your deeply sociable and exuberant nature. You always look at things in broad and optimistic ways, and you rapidly get the status matching your high calibre. You make use of your charm and your boldness, and you have the guts to aim higher than what would be the norm. In this regard, you are the opposite of Virgo people, but it does not matter because your method proves efficient and in any case, the result fulfils your ambition at least. The following professions are most likely to suit you very well: explorer, pilot, taxi and lorry driver, jockey, manager of a racehorse stable, international businessman/woman and any expatriate job, corporate manager, tour operator and travel agent, import-export trader, serviceman/woman, magistrate, politician, ambassador, sociologist, priest/priestess, or spiritual leader.\n\nThe Tenth House still called the Midheaven , is the highest point amidst the houses, at the top of the chart, in the South, and relates to destiny in general and career (and not daily work as meant by the Sixth House). The Midheaven represents our achievements and goals in the social sphere, our social position in society, and becomes more and more important as we get older. It is in analogy with Capricorn and Saturn. The Tenth House is the most important angular house along with the Ascendant.\n\nN.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports.\n\nYou are particularly sensitive to the values of friendship in the sense that you see yourself as a link within a chain, certainly a different and original one, but with no will to flatter your ego or to individually assert yourself. On the contrary, your aim is to immerge yourself in your friendly relations and to participate in projects and ideals of the whole human community. With this Ascendant, you come across as idealistic, altruistic, detached, independent, original, surprising, gifted, contradictory, innovative, humanistic, likeable, friendly, self-confident, impassive, quiet, intuitive, creative, charitable, elusive, disconcerting, generous, tolerant, paradoxical, and you cannot stand any kind of constraint. But you may also be marginal, resigned, distant, utopian, maladjusted, eccentric and cold.\n\nThe First House or Ascendant represents one's behaviour in the eyes of others, and also one's health. It corresponds to the way the individual acts in the world. It is the image of the personality seen by others and the person's visible behaviour expressed outwardly. The 1st House is in analogy with Aries and thus Mars too, and then the Sun. It is an angular house, the most important one with the Midheaven, maybe even more so due to its link with the body and health.\n\nN.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports.\n\nGenerous, hardworking, and organised character endowed with sharp intelligence. Family ties and friends are very important. Much attention is paid not only to the family's comfort, but also to other people's needs. Success is achieved thanks to one's personal qualities. Everything needed for one's happiness and peace of mind is readily available. This degree indicates that, if one belongs to a rich family, one knows how to properly use one's wealth without squandering it. If one is of modest origins, one improves one's social status and becomes wealthy.\n\nThe classical Part of Fortune, of which the calculus method is unchanged whether in a diurnal or nocturnal chart, is usually distinguished from the diurnal/nocturnal Part of Fortune which is calculated by the formula AS + Sun - Moon for a nocturnal chart, and AS + Moon - Sun in a diurnal chart.\n\nThe Part of Fortune is an ancient concept, used by Ptolemy and other astrologers before him. Firstly, it has nothing to do with fortune! In modern astrology, it is actually used to enhance a planet or angle when in close conjunction with it: it thus amplifies the meaning associated to the point affected by its presence. It is calculated in the following way:\n\nN.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports.\n\nNervous, sensual, and passionate character. One is endowed with excellent pioneering and leadership skills. One achieves outstanding success in one's country and abroad. Careers in science, the arts, or religion are very favoured, as well as efforts to carry out reforms. Excessive compassion may prompt to show generosity towards people who do not deserve it.\n\nLilith or the Dark Moon (True Lilith here) represents the uncrossable threshold, taboos, the individual's provocative and fascinating side, including on a sexual level. She symbolizes violence and \"untameability\", the radical and deep-seated refusal to submit. The keywords for Lilith can be sterility, sadism, perversity, castration, sadomasochism, eroticism, orgasm, forbidden fantasies, marginality, cruelty; redemption, illumination, rebelliousness... Lilith's opposite point is called Priapus; it is the Lunar perigee, the position where the Moon is closest to the Earth. It symbolizes man's primitive nature, the horror hidden in our deepest self; masochism, extreme sensuality, impulsiveness, irrationality and excess. Physically speaking, the Dark Moon is the focal point unoccupied by the Earth: it is not a concrete body but a mathematical point.\n\nN.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports.\n\nQuiet, patient, and determined character. One has strong ties with the soil. One is intelligent and ready to work hard to acquire the knowledge and skills necessary for the improvement of one's position. Life unfolds happily and comfortably although one is unlikely to rise to a very prominent place. One enjoys a good health throughout life.\n\nThe South Node is diametrically opposed to the North Node, therefore it faces it (it's not drawn here, it's the same symbol but upside down). It symbolizes what has already been achieved or acquired, in a karmic sense: it's the past from which it's advised to move on in order to progress. The South Node is rather negative, of a Saturnian nature: the experience through suffering.\n\nThe North Node (True Node here) represents the goals that must be achieved during life, in the karmic sense according to some traditions. Its position in house indicates in what field an effort is necessary in order to evolve. The North Node is often called the Dragon's head, it is usually considered beneficial, a bit like Jupiter with the planets. The Lunar nodes are fictional points and not actual heavenly bodies: they are the intersections of the Moon with the Ecliptic (the path made by the Sun in its orbit as seen from the Earth). The axis of the Lunar nodes moves 19 degrees each year, namely a bit more than three minutes each day.\n\nJuno is the asteroid corresponding to the adaptation to the marital partner and to the defence of individual rights; it is thus used in the field of marriage.\n\nPallas is sometimes used in modern Astrology: she represents intelligence, abstract and global thinking talents. It is usually considered to be a determining element in political strategy.\n\nCeres , the biggest of the four minor asteroids used besides Chiron, is associated with the mythological goddess of growing plants and harvest and also symbolizes physical constitution, vitality and fertility. She's also known as Demeter, according to the astrologer Zipporah Dobyns, linked to the symbolism of the mother but in a less emotive and more physical way than the Moon. Ceres is thought to be the ruler of Virgo, in exaltation in Gemini, in exile in Pisces and in fall in Sagittarius. Keywords associated with Ceres could be order, practical sense, worry, precision, modesty, method, sobriety, motherhood, fertility, the Earth: a kind of a more cerebral Moon...\n\nChiron is almost renowned and used everywhere. Most astrologers consider it as a kind of \"mediator\" between Saturn and outer planets. Consequently, Chiron is of Saturn's nature and at the same time is influenced by Uranus, the first slow-moving planet. Astrologically, it symbolizes wisdom, patience and the faculty to reduce others' sufferings: it is said to be the \"great healer\" of the zodiac. Like all the secondary bodies, it must be in close conjunction with planets or angles in order to fully express its action.\n\nIf you wish, you can receive immediately in your mailbox your detailed astrological portrait , a nice gift for yourself or for your close friends and relatives, who will deeply appreciate it.\n\nN.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports.\n\nFearless, proud, and courageous character attracted to athletics, dangerous actions, and military feats. Success can be achieved in the military, in politics, or in all occupations requiring a great deal of energy and many struggles. This degree warns against reversals of fortune, as well as injuries and traps, and urges to avoid situations of violence. If in the natal chart, this degree is in conjunction with the Ascendant and with the Sun or the Moon, it indicates a potential danger for the head and the eyes.\n\nIf Pluto is part of your natal chart's planetary dominants, in astrology, you are said to be a Plutonian: you sometimes feel like a foreigner who does not belong to the world, to its laws, and its concerns. The rules of life in society are not necessarily yours. You are interested in what is unknown and in the subtle laws of a hidden order. So, you take malicious pleasure in ridiculing the patterns you find too simplistic or too rigid. You also revel in underlining the limits of explanations you deem too common. There is something unconventional about the way you are, the way you think, and the way you act. What is your specificity made of? Is it an extraordinary partner? A life off the beaten path? Or do you only distance yourself from conventional morals? In any case, you have the feeling, sometimes quite vague, that you come from nowhere, and that you do not belong to any definite group... In short, it means that you cannot be simplified in order to conform to existing models. The gap between you and ordinary mortals is also an element of your strength. Your deep clear-sightedness, firstly, enables you to put things into perspective and to grant them only the attention they deserve. Your other remarkable asset is your capacity to intervene from behind the scenes, to secretly organise events, and to bring about the desirable outcome without seeming to impose or to dictate anything. However, you must still overcome one of the major difficulties of this dominant, which is to get people to accept your difference and to smoothly fit into your environment.\n\nWith Pluto in the 6th House, the art of manipulations is your signature. Pluto is the planet of distance and underground worlds. On the contrary, the 6th House deals with defined social functions and identified fields of action. Therefore, your social role is ambiguous and paradoxical, to say the least. It is most likely that, as far as the professional plane is concerned, your manner is disconcerting, and your obscure and hidden function is efficient precisely because it is insidious and concealed.\n\nThe planet Pluto symbolizes deep disruptions and upheavals, domination and sexual instincts, and the inner power we have in ourselves. Pluto destroys in order to reconstruct and he provokes painful crises that are needed in metamorphosis. Pluto is our deepest instincts' brutal force. It is the hidden and unconscious violence that can explode in us with incredible intensity before being projected in our actions; in itself, the planet is not negative: the might and the intensity of its energy are beyond the conceivable but it can be funnelled. Pluto is the only possibility we have at our disposal to overcome our inner blocks and to eliminate outgrown situations that have become inextricable. Pluto's energy is valuable because of its usefulness for the irreversible destruction of what constitutes a problem and not because of its negative side and its perversity. Pluto allows to reconstruct and to regenerate parts of our personality or whole stretches of our life, provided that we manage to funnel his wild energy and to step back. It is impossible to tame this energy, given its essence. However, it is possible to take advantage of it for a precise aim, through a temporary identification of some parts of us with this energy. In such a case, the outcome is our final evolution and even, our transformation. In your natal chart, Pluto's house position is more important than his sign position because, like Jupiter, Saturn, Uranus and Neptune, Pluto is a slow planet. Many people born in the same period have Pluto in the same sign. This is the reason why the sign occupied here is less meaningful than when it is occupied by the so-called fast planets, i.e. the Sun, the Moon, Mercury, Venus and Mars. Therefore, some caution is to be exercised as you read what follows. The sign positions of Uranus, Neptune and Pluto have a collective meaning. They do not influence your personality and they are not to be really taken into account, unless they are involved in numerous aspects or when they emphasize a personal point of your natal chart such as your Ascendant's ruler, an angular planet, i.e. a planet near the Ascendant, the Midheaven, the Nadir or the Descendant. In such cases, the activity of the slow planet is very highlighted. Pluto in Leo may give you an authoritarian and, even, despotic nature. But your charisma and your radiance are intensified.\n\nPluto represents deep transformations, mutations and eliminations, sexuality and magnetism, power and secrets, destruction with a view to regeneration, the phoenix rising from the ashes. Its element is indefinite; burning (like lava in fusion ?), it rules Scorpio, is in exaltation in Pisces and is in analogy with the sexual organs and excretion.\n\nIf you wish, you can receive immediately in your mailbox your detailed astrological portrait , a nice gift for yourself or for your close friends and relatives, who will deeply appreciate it.\n\nN.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports.\n\nIndependent, assertive, and affectionate character. There is an overwhelming tendency to be over-protective with family members. Self-righteousness may lead to dangerous situations of violence with danger of severe physical and psychological injuries. This degree indicates a strong taste for the practice of weapons, and the possibility to excel in all martial arts. It also endows with the gift for healing animals, especially horses, and often describes an excellent veterinary specialist.\n\nIf Neptune is part of your natal chart's planetary dominants, in astrology, you are said to be a Neptunian: your intuition is highly developed. You are of a contemplative nature, and you are particularly receptive to ambiances, places, and people. You gladly cultivate the art of letting-go, and you allow the natural unfolding of events to construct your world. You follow your inspirations, for better or for worse. At times, you display an extraordinary clairvoyance gift. You seem to be able to read your subconscious like a book, and you track down subtle underlying mechanisms, flaws, or open breaches. This innate intuition might explain the strokes of good luck which the Neptunian is sometimes credited with. However, you may also be the victim of illusions and misleading intuitions. You are an idealist, and you let your deepest aspirations prevail over the realities of the moment. Then, you set off in quest of some quixotic objective, living like a Don Quixote who relentlessly pursues an impossible dream. You have a great talent for psychology and the mysteries of the human soul. Since you instinctively perceive people's intents and motivations, as you swim in the complexity of human nature, you feel in your element. The subtlety of your perceptiveness is the source of both special affections and irrevocable rejections. What is the danger of such a dominant? If it is not offset by other influences in your natal chart, you may not have an iron will. Your trump card is your instinct, which may be developed to the extent that it becomes clairvoyance.\n\nWith Neptune in the 7th House, your social life is subtle and vague, and follows an underlying and imperceptible, yet inflexible, logic. You are unable to figure out why you feel in tune with such or such person, whereas with another person, you just cannot relate. A glance, or a move, is all is needed in order to establish the contact... or prevent it. Life is made of subtleties which reason knows nothing of. The partner is a mirror, and sometimes, a distorting mirror.\n\nThe planet Neptune symbolizes extreme receptivity, intense emotional sharpness, impressionability and inspiration; it is the planet of mediums, mystics and religious faith. In an astrological chart, it indicates dilution, vagueness, understanding one's environment through emotions and the absence of clear and determined limits and structures. In your natal chart, Neptune's house position is more important than his sign position because, like Jupiter, Saturn, Uranus and Pluto, he is a slow planet. Many people born in the same period have Neptune in the same sign. This is the reason why the sign occupied here is less meaningful than when it is occupied by the so-called fast planets, i.e. the Sun, the Moon, Mercury, Venus and Mars. Therefore, some caution is to be exercised as you read what follows. The sign positions of Uranus, Neptune and Pluto have a collective meaning. They do not influence your personality, unless they are involved in numerous aspects or when they emphasize a personal point of your natal chart such as your Ascendant's ruler, an angular planet, i.e. a planet near the Ascendant, the Midheaven, the Nadir or the Descendant. In such cases, the activity of the slow planet is very highlighted. Neptune in Libra endows you with idealism and pacifism. You dream of a world of peace, freedom, equality and tolerance. Your exchanges with others are genuine. You are listening to, and on the lookout for, all the emotions that you find to be so deliciously nurturing.\n\nNeptune represents escapism, impressionability, daydreaming, delusions, carelessness, deception or intuition, dishonesty or inspiration, telepathy. Water is its element, it is moist, it rules Pisces, is in exaltation in Cancer, though some authors say it is Leo, and is in analogy with the vegetative system.\n\nIf you wish, you can receive immediately in your mailbox your detailed astrological portrait , a nice gift for yourself or for your close friends and relatives, who will deeply appreciate it.\n\nN.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports.\n\nCourageous, bold, and honest character. One can achieve success in the magistracy, the military, or the police. One has the strength required to overcome hurdles, and one accomplishes some outstanding feat which is rewarded by honours and a high-level position.\n\nIf Uranus is part of your natal chart's planetary dominants, in astrology, you are said to be a Uranian: personal values are prevailing. Inner certainties fuel an inflexible will and a desire to call attention on yourself as well as to follow your beliefs through. This planet prompts you to behave with determination, to put forward your own truth, and to start your personal revolution. More than other people, you are willing to keep some degree of autonomy in all circumstances, and you often display an individualistic nature. In order to achieve your ideal of freedom and independence, you may act like a despot as you try to convince and to impose your views, whether smoothly or forcefully. Regardless of the flexibility of your comportment, some situations demand an absolute firmness as well as uncompromising, frank and straightforward attitudes. People may criticise you for your intransigence and say that you are a hardliner. Outsider's opinions don't matter! The most important thing is that you act in all conscience and reach your primary objectives. More than anyone else, you know how to use your willpower and to focus your energy on a precise aim, relentlessly, whatever the consequences might be. In the chapter of qualities, let's mention a definite sense of responsibility, an innovative mind open to techniques and modern ideas, as well as a natural self-discipline which overcomes many an obstacle. Therefore, people are well-advised not to hound you into a corner.\n\nUranus is in the 3rd House. You are endowed with an acute sense of innovation and a mind avid for discoveries. Assimilation of knowledge constitutes a challenge for your thirst for renewal. You are open to modern ideas, and you do not hesitate to put all your energy at the service of a personal experience or an uncommon relationship. Sometimes, the way you communicate has some sort of eccentricity touch, which disconcerts the members of your entourage, amuses them, or win them over.\n\nThe planet Uranus symbolizes originality, independence and cerebral energy bursting suddenly. Uranus triggers the irresistible need for freedom that we have in ourselves. Uranus tends to break the constraints that have become unbearable and gives us the courage and the will to get rid of what has become a burden; when he is well aspected, he also indicates genius. In your natal chart, Uranus' house position is more important than his sign position because, like Jupiter, Saturn, Neptune and Pluto, he is a slow planet. Many people born in the same period have Uranus in the same sign. This is the reason why the sign occupied here is less meaningful than when it is occupied by the so-called fast planets, i.e. the Sun, the Moon, Mercury, Venus and Mars. Therefore, some caution is to be exercised as you read what follows. The sign positions of Uranus, Neptune and Pluto have a collective meaning. They do not influence your personality, unless they are involved in numerous aspects or when they emphasize a personal point of your natal chart such as your Ascendant's ruler, an angular planet, i.e. a planet near the Ascendant, the Midheaven, the Nadir or the Descendant. In such cases, the activity of the slow planet is very highlighted. Uranus in Gemini increases tenfold your nervousness and may incline you to be interested in a heap of very varied topics in deep and original ways.\n\nUranus represents individual freedom, originality, independence, marginality, avant guard inspiration, ultra modernism. Fire is its element, it is dry, and it rules Aquarius, is in exaltation with Scorpio and is in analogy with the brain and the nerves.\n\nIf you wish, you can receive immediately in your mailbox your detailed astrological portrait , a nice gift for yourself or for your close friends and relatives, who will deeply appreciate it.\n\nN.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports.\n\nHard-working, rebellious, and anxious character endowed with an acute sense of honour and duty. One undergoes destructive events which are beyond one's control, but one bravely gets back on one's feet. Success, fame, and wealth are achieved in one's field of competence, particularly in the military and in all occupations related to fire, aviation, or in careers requiring creativity and eloquence. Conjugal life is often plagued by discord, and no support whatsoever is to be expected from the husband/wife.\n\nIf Saturn is part of your natal chart's planetary dominants, in astrology, you are said to be a Saturnian: you gladly leave to other people the decision to take life as it comes. As far as you are concerned, you prefer to take advantage of your experiences in order to discover, to grow, and to question yourself.\n\nIn your natal chart, Saturn is in the 3rd House. Learning to communicate is a difficult task for you. Your mode of assimilation is demanding and selective, which excludes simple relationships and fanciful innovations. Before you can accept a person, an idea, or a formula, you need to sift them through your inflexible will, and to understand them. It is probable that you sort out all pieces of information with a serious mind, but also with caution and scepticism.\n\nThe planet Saturn symbolizes contraction, effort, time, limitation and concentration. Saturn eliminates anything that is not authentic, sooner or later. It is impossible to cheat him as he gives an irresistible desire to form a coherent whole with oneself, in responsible and wise ways. He is the great purifier. He represents our limitations but also our truth. In your natal chart, the house position where Saturn is posited is more important than his sign position because, like Jupiter, Uranus, Neptune and Pluto, he is a slow planet. Many people born in the same period have Saturn in the same sign. This is the reason why the sign occupied here is less meaningful than when it is occupied by the so-called fast planets, i.e. the Sun, the Moon, Mercury, Venus and Mars. Therefore, some caution is to be exercised as you read what follows. Saturn in Gemini decreases your lightness, your frivolousness, and your heedlessness. You become more thoughtful, more concentrate and you learn to deeply funnel your ideals; your practical sense is increased, your concern for punctuality and your thirst for precision are reinforced.\n\nCharacterology: Non-Emotive, Active and Secondary type or Emotive, non Active and Secondary type or sometimes Non-Emotive, non Active and Secondary type; it is a Phlegmatic, a Sentimental or an Empathic type\n\nIt represents the grandparents, old people, scientists, knowledgeable men, Saturn corresponds to old age; it goes from 70 years old until death.\n\nSaturn represents concentration, effort, perseverance, time, the hard reality, inevitable consequences. Earth is its element, it is cold and dry, and it rules Capricorn and Aquarius (along with Uranus), is in exaltation in Libra and is in analogy with the bones (skeleton) and the skin.\n\nIf you wish, you can receive immediately in your mailbox your detailed astrological portrait , a nice gift for yourself or for your close friends and relatives, who will deeply appreciate it.\n\nN.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports.\n\nNoble, righteous, and helpful character. Ordeals and obstacles are numerous and varied, but easily overcome. However, gentle manners must not to be mistaken for weakness because one is endowed with great physical, intellectual, and moral strength. People would be well-advised not to try and pick a quarrel with this person.\n\nIf Jupiter is part of your natal chart's planetary dominants, in astrology, you are said to be a Jupiterian: because this planet brings about a keen interest in social and professional success, the Tradition considers it to be beneficial. Indeed, you know how to adjust to events and to jump at the chance when it arises. The members of your entourage gladly entrust you with high responsibilities because they are often impressed by your learning skills and your adaptation abilities as you deal with new structures and new languages. What is the secret of your good star? It is your self-confidence which wins public support. Now, what is the secret of your charm? Definitely, enthusiasm, euphoria, and exaltation. Exaggeration also. When this dominant is well integrated, it is a factor of affluence and optimism, and a certain degree of joviality enables you to easily fit into various spheres. It constitutes your main asset to manage your life. However, you must at times curb your desire for integration, lest your sense of opportunity turns into extreme opportunism. Here also, the key to success lies in a correct estimate of everyone's chances and possibilities. Although management is one of your forte, and you can adjust your objectives to current realities better than other people, you lack the hindsight which enables you to avoid short-term vagaries and daily fluctuations. If you strive too much to adapt, you run a risk of betraying yourself. This is the other traditional side of the coin with \"The Greater Benefic\"!\n\nWith Jupiter in the 5th House, dedication is a vital need, or almost. Your personal fulfilment and social integration depend on your creativity, your education, and your affective life. You feel a strong desire to teach what you know, and to share your experience. Generosity constitutes the royal path to love, as well as the cause of your success. Your vocation is in positions related to theatre. As the Tradition has it, your playful nature may prompt you to believe, more or less, that you are lucky at gambling.\n\nThe planet Jupiter symbolizes expansion, broadness and generosity. Jupiter is associated with the functions of synthesis, enthusiasm and optimism. In your natal chart, his house position is more important than his sign position because, like Saturn, Uranus, Neptune and Pluto, he is a slow planet. Many people born in the same period have Jupiter in the same sign. This is the reason why the sign occupied here is less meaningful than when it is occupied by the so-called fast planets, i.e. the Sun, the Moon, Mercury, Venus and Mars. Therefore, some caution is to be exercised as you read what follows. Jupiter in Cancer is in the sign of his exaltation, which means that he is at great ease and he can express his essence more powerfully. He amplifies your emotions, your imagination and your optimism. You can be a good head of family or you develop a natural interest for matters linked to your home, your roots, your patrimony or that of your family. All your domestic affairs are protected.\n\nIt represents the governors, magistrates, professors, religious men too; the age of Jupiter goes from 50 to 55 or even 70 years old.\n\nJupiter represents expansion and power, benevolence, large vision and generosity. Its element is Air, it is hot and moist, and it rules Sagittarius and Pisces (along with Neptune), is in exaltation with Cancer and is in analogy with the hips and endocrinal system.\n\nIf you wish, you can receive immediately in your mailbox your detailed astrological portrait , a nice gift for yourself or for your close friends and relatives, who will deeply appreciate it.\n\nN.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports.\n\nIndependent, wise, and courageous character. One regards freedom as a priceless treasure and pays little attention to worldly goods. This degree symbolises the dilemma between freedom with all its uncertainties and security with all its constraints. Unless the natal chart indicates otherwise, one resists the lure of money and power. Nevertheless, there is a danger of deprivation of liberty caused by political reasons.\n\nIf Mars is part of your natal chart's planetary dominants, in astrology, you are said to be a Marsian: in your hand-to-hand struggle for life, you demonstrate an acute and active sense of confrontation with the world, with other people, and with your own destiny. You need to take action and to fight for your projects and your desires. You perceive all situations with deep intensity, and you react to the here and now without bothering to step back in order to ensure that events are under your control. You take up challenges with excessive foolhardiness as a consequence of your impulsiveness. However, better than anyone else, you know how to mobilise your resources in case of crisis. You take action whenever it is necessary to do so, and you are present in a timely manner. With Mars, your attitudes are dictated by the realities of the moment, by your emotions, and by everything which proved to have worked in the past. When this dominant is not well integrated, it may bring about an aggressive or impulsive behaviour. Therefore, you must learn to control your hyper-sensitivity and your fits of temper. You are also endowed with Marsian qualities: the fighting spirit and the taste for duel without which one may find oneself overwhelmed by events. When this willpower is well channelled, its precious energy enables to cope with all sorts of contingencies. There are a thousand ways to win, and a thousand challenges to take up with the enthusiasm and the dynamism which make life so worthy. A certain idea of life which is wild, passionate, and in tune with events.\n\nWith Mars in the 12th House, the sense of danger is not part of the arsenal of your qualities. You do not hesitate to take action even though you do not know clearly where you are heading for. Sometimes, you let yourself be guided by a premonition or a vague impression. Then, you leave no stone unturned without fearing the consequences of your deeds. This configuration describes activists, mystic campaigners, and pioneers of the unknown. You do not shirk from sacrifices when you deem that the cause is just.\n\nThe planet Mars indicates how you react to life concrete stimulations. It also describes your fighting spirit, your abilities to stand for yourself and to take action. With Mars in Aquarius, freedom of action is indispensable. Constraints are not part of your reality. You are open to the world, to all types of societies and to human matters in general. You fight for individual freedom and for the respect of all forms of expression. You do not tolerate intolerance! Your struggles involve collective, even universal contexts. Defending great causes is more exciting than coping with daily chores and you handle unforeseen events to the best of your abilities. But should the situation get stuck in a rut, you quickly tire. Your dynamism needs new-ness to show its worth. Your assets lie in your capacity for innovation and your ability to find original solutions to concrete life problems.\n\nMars represents the desire for action and physical energy, sexuality, strength. For a woman, Mars corresponds to the kind of man she's attracted to (but not especially in marriage which is rather symbolized by the Sun, Mars is the lover, not the husband). Fire is its element, it is hot and dry, and it rules Aries and Scorpio (along with Pluto), is in exaltation with Capricorn and is in analogy with the muscles and the spleen.\n\nIf you wish, you can receive immediately in your mailbox your detailed astrological portrait , a nice gift for yourself or for your close friends and relatives, who will deeply appreciate it.\n\nN.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports.\n\nInventive, non-conformist, and obstinate character. One does not share the ideas prevailing in one's social background and believes that obsolete traditions need to be reformed. After having reached the peak of one's career, one is threatened by a reversal of fortune which can be overcome after many years of hard work and much courage. However, on the image, the man has not fallen down yet, and the dragon, which symbolises the guardian of treasures, indicates that total ruin can be avoided if one displays wisdom and persistence. If this degree is on the Ascendant and in conjunction with Mars and the Moon, there is a risk of violent death or serious eye condition. This degree also portends family estrangement and loss of traditions.\n\nIf Venus is part of your natal chart's planetary dominants, in astrology, you are said to be a Venusian: you are a sensual and emotional person particularly receptive to the natural likes and dislikes aroused by your contact with people. You are prone to frequent instinctive aversions and true passions which are exclusively driven by the feeling of love. The heart has its reasons which Reason knows nothing of... Your balance is based on the richness of your affective life. Without love, the Venusian is resourceless, lost, and deprived of any reason for living. You have an obvious and strong will to charm and to arouse the attachments without which you cannot properly function. Every area of your life is thus marked by your affectivity. The danger is that you may \"be taken in\" by charm. In such cases, you would prefer to keep your emotions under better control. Thus, hyper-sensitivity has its own inconveniences. Nevertheless, better than anyone else, you know how to play with feelings and attractions. Although you are sometimes caught in the traps of an over sensitive emotionalism, feelings remain your best assets in many circumstances. There is another aspect to the Venusian dominant. According to the Tradition, this planet rules the Arts, and you are endowed with some degree of artistic dispositions, ranging from good to excellent.\n\nVenus expresses her nature through the 2nd House values. Carmen or Don Juan, you are a feeling collector to the core. You need to fuel emotions, and to indulge in affective experiences. Although you may not get rich through love, love enriches you. Your wealth consists more in kisses or in tears than in dollars. You manage your assets in an instinctive and affective way, sometimes quite thoughtlessly. Natural likes and dislikes are more important to you than a person's image or wealth.\n\nVenus describes your affective life. On the day of your birth, she is found in Aries. This configuration endows your affectivity with spring freshness: sensuality constantly on the alert and emotionalism all on edge. In the amorous sphere, you experience frequent, lively a"}, {"url": "https://www.brainyhistory.com/events/1943/march_19_1943_393369.html", "page_content": "Born:\n\nMario Monti, Italian Public Servant\n\nMore Notable Birthdays on March 19:\n\n1955 - Bruce Willis, born in Penna Grove, New Jersey, actor, Moonlighting, Die Hard\n\n1947 - Glenn Close, born in Greenwich, Connecticut, actress, The Big Chill, Fatal Attraction\n\n1936 - Ursula Andress, born in Berne Switzerland, actress, She, Sensuous Nurse\n\n1891 - Earl Warren, California, Gov-R-Ca, 14th supreme court chief justice, 1953 - 1969\n\n1821 - Richard Burton, explorer/translator, Arabian Nights\n\n"}], "Mario Monti is an Italian economist.": [{"url": "https://www.britannica.com/biography/Mario-Monti", "page_content": "Mario Monti, (born March 19, 1943, Varese, Italy), Italian economist, academic, and bureaucrat who served as prime minister of Italy (2011–13).\n\nMonti, the son of a banker, studied economics and management at Bocconi University in Milan and received a degree in 1965. He then pursued graduate studies at Yale University under the tutelage of American economist James Tobin. Monti taught briefly at the University of Trento (1969–70) and began a post at the University of Turin (1970–79) before returning to Bocconi University in 1971 as a professor of monetary theory and policy. He later directed (1985–94) the school’s Institute of Economics. In 1989 he became rector of the university, and five years later he was named its president.\n\nAs a consultant to one of Italy’s largest banks in the 1970s, Monti gained attention for publishing his own estimates of the country’s money supply at a time when official figures were not publicly available. Beginning the following decade, he served on several committees of the Italian treasury and was president of SUERF (Société Universitaire Européenne de Recherches Financières; now the European Money and Finance Forum) in 1982–85. Also during this time Monti wrote commentaries on economics for the Milan newspaper Corriere della Sera (1978–94) and sat on a number of corporate boards.\n\nIn 1995 Monti, having been nominated by Italian Prime Minister Silvio Berlusconi, took a seat on the European Commission (EC), for which he oversaw issues relating to the internal market, financial services, and taxation. Receiving a second term in 1999, he became the European commissioner for competition, and in that capacity, he took a tough-minded approach to proposed corporate mergers and antitrust cases that won him wide respect. After his EC tenure concluded in 2004, he helped found Bruegel, a Brussels-based think tank with a focus on economic globalization.\n\nIn November 2011, in the wake of a public debt crisis in Italy that weakened Berlusconi’s grip on power, the politically independent Monti became a leading candidate to assume the country’s premiership in a national unity government. (It was hoped that Monti’s experience as a technocrat would prove beneficial in the implementation of urgent economic reforms.) On November 9 he was made a lifetime member of the Italian Senate, and four days later, upon Berlusconi’s resignation, Pres. Giorgio Napolitano asked Monti to form a government.\n\nInitially serving as both prime minister and finance minister (he held the latter post until July 2012), Monti swiftly persuaded parliament to approve an austerity package that relied heavily on tax increases. In early 2012 a set of measures he introduced in an effort to liberalize the service sector was also passed. Although Italy continued to face economic uncertainty, Monti’s decisive leadership was widely judged to have helped the country forestall disaster. As the year continued, he also emerged as a key player in international negotiations aimed at financially stabilizing the entire euro zone.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nIn December, however, Monti’s government lost the support of Berlusconi’s People of Freedom (Popolo della Libertà) party during two otherwise successful parliamentary confidence votes. He resigned from office shortly thereafter, remaining in a caretaker role until a new government could be formed. In early elections held in February 2013, Monti led an alliance of centrist political factions, but they failed to win enough parliamentary seats to play a significant role in the ensuing efforts to build a government coalition. After two months of political deadlock, Monti was finally succeeded by Enrico Letta, a Democratic Party (Partito Democratico) leader appointed by Napolitano."}, {"url": "https://www.berggruen.org/people/mario-monti/", "page_content": "Biography\n\nMario Monti is an Italian economist who served as the Prime Minister of Italy from 2011 to 2013. In 2013 he was named Chairman of the Council for the Future of Europe.\n\nHe is currently president of Bocconi University, Milan. He is also European chairman of the Trilateral Commission and honorary president of Bruegel, the European think-tank he launched in 2005.\n\nHe is the author of the report to the President of the European Commission on “A new strategy for the single market” (May 2010).\n\nAs the EU-appointed coordinator for the electricity interconnection between France and Spain, he brokered an agreement between the two heads of governments in June 2008. He was a member of the Attali Committee on French economic growth, set up by President Sarkozy (2007-2008).\n\nHe was for ten years a member of the European Commission, in charge of the Internal market, Financial services and Tax policy (1995-1999), then of Competition (1999-2004). In addition to a number of high-profile cases (e.g. GE/Honeywell, Microsoft, the German Landesbanken), he introduced radical modernization reforms of EU antitrust and merger control and led, with the US authorities, the creation of the International Competition Network (ICN).\n\nBorn in Varese, Italy, in 1943, he graduated from Bocconi University and did graduate studies at Yale University. Prior to joining the European Commission, he had been professor of economics and rector at Bocconi.\n\nMonti was previously a member of the Council for the Future of Europe and The WorldPost Advisory Council."}, {"url": "https://pantheon.world/profile/person/Mario_Monti", "page_content": "Mario Monti\n\nMario Monti (born 19 March 1943) is an Italian economist and academic who served as the Prime Minister of Italy from 2011 to 2013, leading a technocratic government in the wake of the Italian debt crisis. Monti served as a European Commissioner from 1995 to 2004, with responsibility for the Internal Market, Services, Customs and Taxation from 1995 to 1999 and for Competition from 1999 to 2004 . Read more on Wikipedia\n\nSince 2007, the English Wikipedia page of Mario Monti has received more than 703,691 page views. His biography is available in 75 different languages on Wikipedia (up from 74 in 2019) . Mario Monti is the 2,647th most popular politician (down from 2,579th in 2019), the 894th most popular biography from Italy (up from 903rd in 2019) and the 191st most popular Italian Politician.\n\nMario Monti is most famous for being the Prime Minister of Italy from 2011 to 2013."}, {"url": "https://www.economist.com/europe/2012/01/21/a-good-professor-in-rome", "page_content": "BEFORE the European Union summit on January 30th, Italy's new prime minister, Mario Monti, will have visited the German chancellor, Angela Merkel, the French president, Nicolas Sarkozy, and the British prime minister, David Cameron, whom he saw on January 18th. Herman Van Rompuy, president of the European Council, has been to see him in Rome. And the French, German and Italian leaders plan a pre-meeting just before the summit.\n\nIt is a far cry from most of the second half of last year, when Europe's leaders did as much as they could to avoid being caught in a photograph with Mr Monti's scandal-tainted predecessor, Silvio Berlusconi. Italy, it seems fair to say, is back at the top table. And that could have far-reaching effects on the euro crisis. For, as he is making increasingly plain, Mr Monti's ideas on how to resolve it are significantly at odds with those of the Germans who have until now been doing most of the ordering—and choosing pretty thin gruel.\n\n“Adherence to fiscal discipline is a necessary condition for growth,” he told an audience at the London Stock Exchange on January 18th. “It is not however a sufficient condition.” His message to Mrs Merkel and Mr Sarkozy is that the EU must move from reliance only on austerity towards some growth-stimulating measures. This was a view repeated by Standard & Poor's, the rating agency that downgraded nine euro-zone countries, including Italy, on January 13th. Unlike his colleague from France, also downgraded, and the European Commission, Mr Monti did not criticise S&P: indeed, he shared much of its analysis.\n\nMr Monti, who served as the EU's commissioner for the single market and then competition between 1995 and 2004, is a rare creature: an Italian economic liberal. He is not a proponent of harrying Berlin to reflate to boost domestic consumption. But he would like to see the Germans do more to liberalise their own services, to bolster the EU's single market (indeed, he wrote a report for the commission in May 2010 advocating further liberalisation).\n\nIn London this week Mr Monti pledged to back a British effort to complete the single market, and thus to improve competitiveness throughout the EU. Although he believes it is unrealistic to expect Mr Cameron to go back on his refusal in December to sign up to the proposed fiscal compact between EU members, he is keen to involve the British as much as possible.\n\nSpeaking before his visit to London, in his office in Palazzo Chigi in Rome, Mr Monti says: “The more the UK feels distanced from European construction, the less others are able to benefit from the full influence of the many good things that the UK can help us all to achieve, and therefore there are many areas where I think it would be beneficial to have the UK fully at the table.”\n\nMr Monti acknowledges in his characteristically unhurried, measured way that “it is rather unusual for Italy to be at the forefront of pro-market initiatives.” But he plans to practise at home what he has been preaching abroad. “I am convinced that it is also in Italy's national interest,” he says. On January 19th his cabinet was due to approve an extensive package of measures designed to free up markets and increase competition in a country where cosy cartels have long been the norm. His government of technocrats, which took office in November 2011, is also trying to force labour-market reform on the trade unions and fiscal compliance on Italy's legendarily tax-shy self-employed. This amounts to a hugely ambitious programme.\n\nResistance to change in Italy can be formidable, and violent. Both the advisers most closely associated with labour-market reforms in the past 13 years have been shot dead. Since Mr Monti's government stepped up a drive for increased tax compliance, there have been repeated attacks on branches of the tax-collection agency, some involving rudimentary bombs. Taxi drivers, who expect to lose from the government's liberalisation, caused mayhem in Rome this week, blocking traffic and detonating home-made parcel bombs.\n\nBut the prime minister argues that he has at least two advantages: his experience in Brussels grappling with multinationals and national governments, and the fact that his government is not beholden to any one political faction or interest group. Although unelected, and responsible for an emergency budget in December that inflicted considerable pain on Italians, Mr Monti's administration remains surprisingly popular. The prime minister believes that “there was in Italy a hidden demand for a boring government which would try to tell the truth in non-political jargon.”\n\nExplore our interactive guide to Europe's troubled economies\n\nSome would add that he has also benefited from the sheer terror spread among Italians over the way that the euro-zone crisis suddenly engulfed their country last year. Benchmark sovereign-bond yields that have repeatedly bobbed around 7%, and a spread between Italian and German debt that has frequently topped 500 basis points, help to explain why they have been so ready to entrust their fate to a government of perceived experts. So far.\n\nBut there is a danger, the prime minister fears, of the “spread effect” turning against his government. Many Italians had hoped that ditching Mr Berlusconi would save them from the wrath of the markets and see bond yields coming down. As Mr Monti noted when speaking on January 18th to the London School of Economics (LSE) they did, gratifyingly, fall at first. But yields then climbed back up towards the sort of levels they had reached under Mr Berlusconi. Sure enough, some Italians have reacted to this by asking if a change of government was really necessary.\n\n“Austerity is not enough, even for budgetary discipline, if economic activity does not pick up a decent rate of growth,” Mr Monti warns. “A lowering in interest rates does not depend only on Italy's efforts but also, and essentially, on Europe's ability to confront the crisis in a more decisive way.” At the LSE, he even donned a university cap, with the quip that he hoped it could represent a cap on interest rates.\n\nHe is studiously vague on how such a cap might be imposed, not least because he and his fellow leaders have agreed not to issue appeals to the independent European Central Bank. And, though he has also said he favours the idea of Eurobonds, he appears to think they are unlikely to come in time to help with the current crisis. But he has left fellow euro-zone leaders in no doubt that, unless some action is taken soon to reward Italians for their efforts by bringing down interest rates, his government might be replaced by something a lot less palatable to them.\n\nWhen Mr Monti referred earlier this month to the threat of growing Euroscepticism in Italy, it was widely seen as an allusion to the populist Northern League, Mr Berlusconi's junior coalition partner during his time in office. But he says the danger is much broader than that. “What I see now, week after week, in parliament is a widening of the spread of this attitude...The degree of impatience-cum-hostility to the EU, to the ECB and to Germany is mounting.” It is a warning that his fellow leaders should take to heart."}, {"url": "https://prabook.com/web/mario.monti/724244", "page_content": "Mario Monti Edit Profile\n\neconomist politician academic\n\nMario Monti is an Italian economist who served as the Prime Minister of Italy from 2011 to 2013, leading a government of technocrats in the wake of the Italian debt crisis.\n\nBackground Ethnicity: His mother was from Piacenza. Although his father grew up in Varese, he was born in Luján in the Buenos Aires Province, Argentina, where his ancestors had emigrated to in the 19th century and built up a soft-drink and beer-production business. Monti's father went back to Argentina during World War II, but later returned to his family home in Varese.\n\n\n\nMonti was born in Varese on 19 March 1943.\n\n\n\nMonti is married to his wife Elsa and has two sons.\n\nCareer Mario Monti has been the 54th Prime Minister of Italy since November 2011.\n\n\n\nInitially, Monti was also Minister of Economy and Finance.\n\n\n\nMonti served as a European Commissioner from 1995 to 2004, with responsibility for the Internal Market, Services, Customs and Taxation from 1995 to 1999 and for Competition from 1999 to 2004.\n\n\n\nMonti has also been Rector and President of Bocconi University in Milan.\n\n\n\nMonti was sworn in as Prime Minister on 16 November 2011, just a week after having been appointed a Senator for Life.\n\nInterests histiry of Ancient Egypt\n\nSport & Clubs cycling"}, {"url": "https://www.cbsnews.com/news/can-economist-mario-monti-save-italy/", "page_content": "COMMENTARY As Mario Monti assumes the role of Italy's Prime Minister, the markets were expected to rise, reassured that a 'technocrat' is now in charge of Italy. But I'm not surprised that investors are scared. Why should anyone be relieved that an economist is now in charge? Wasn't it the economists who argued that deregulated markets like derivatives were bound to be the safest? Wasn't it economists who argued that the market knows best? Wasn't it technocrats who invented the Euro in the first place? Isn't it economists who failed to appreciate that not all European countries operate the same way?\n\nThat great economist, Alan Greenspan, entirely failed to heed to early warning signs of his beloved deregulated derivatives market. Lawrence Summers, confronted by the insanity of California's energy market, maintained that it could not possibly be manipulated -- a profound insight rendered entirely wrong by the thousands of hours of tape recorded phone calls that demonstrated pervasive manipulation by Enron's criminal power traders. In his marvelous excoriation of economists and financiers, Extreme Money, Satyajit Das dismembers the economists' efficient market hypothesis, comparing it to The Price is Right. In effect his book is a terrifying ride though modern economics, analyzing its repeated failures to see, understand or correct market failures. So what makes us think that putting the economists in charge is going to work?\n\n\"Super Mario\" tapped to fix Italy's economy\n\nMarkets drop as Italy totters on the brink\n\nVIDEO: Italy's interim PM meets with political leaders\n\nNot only are the lunatics in charge of the asylum, but it appears we are trusting those same lunatics to tell us how well the asylum is working. Whether or not Monti is doing is a good job is being judged not by the team he is assembling or analyzing the decisions he is taking (or has taken in the past) but by the bond market. If the interest rate on Italian government bonds goes down, Monti is assumed to be doing the right thing. How did it come to pass that we handed over scrutiny and analysis to the bond market -- which is, let's not forget, not a thing but a bunch of bankers. They may have wrecked the West's economy but, somehow, they're still running it.\n\nSince the late 1980s, neo-liberalism (the Chicago School) has dominated all of our economic thinking, despite the woeful lack of supporting evidence. George Soros has made his fortune, after all, not from betting with the market but against it: \"I assume that markets are always wrong,\" he has said. French Prime Minister Lionel Jospin once remarked \"Yes to the market economy, no to market society\" but what we are seeing now suggests that his caveat was intellectually nice but, in reality, a total surrender to a market that is often, if not always, wrong.\n\nIf trusting the market seems bizarre, so too does our sudden faith in technocrats. Jon Corzine was a technocrat as was Robert MacNamara, the whiz kid who provided the technical management for another dismal failure, the VietNam war. Mario Monti is both a technocrat and a member of a prevalent elite that has always been in power, never on its receiving end. I don't have any quarrel with Mario Monti himself. I know he's read my most recent book, Willful Blindness, so of course I fondly imagine he's inoculated against the nonsense that surround him. But it is a dangerous moment in a democracy when we cede all power and responsibility to technocrats and markets. Neither has a great track record. Such an abdication implies that, like Daedelus, we no longer have the capacity to understand the world that we ourselves created."}, {"url": "https://www.economist.com/europe/1998/11/12/mario-monti-europes-taxman-in-chief", "page_content": "WHEN good Americans die they go to Paris, thought one of Oscar Wilde's characters. And when European politicians die they go to Brussels—or so a brief survey of the European Commission and its members down the years might suggest. Rarely has a commissioner made much of a return to political life in his home country when his term or two in Brussels was over.\n\nRarely, that is, until now. Italy, in the avant-garde of European politics more than once this century, may prove an innovator in the recycling of Eurocrats too. Already Italian voters seem to regard Brussels as the place where the really serious governing of Italy gets done—the more so since they have seen their country's public finances transformed in the name of European monetary union. Small wonder if Italians are also the first to see Brussels as a place where national leaders are made, not lost.\n\nThat certainly seems to be the view taken of Italy's two current European Commissioners, Emma Bonino and Mario Monti. Last month Ms Bonino—a marginal figure in national politics when she went to Brussels in 1995—was sounded out for a minister's job in the latest Italian government. Some Italians whisper of her now as a possible wild card in next year's presidential election. Mr Monti—who was not a politician at all before he went to Brussels, but a university rector and professor of economics—is viewed as a natural front-man for the Italian centre-right, should Silvio Berlusconi abandon that role. (There may be high-level traffic in the other direction too: Italy's former prime minister, Romano Prodi, would be a shoo-in for the presidency of the European Commission next year, should he want the job.)\n\nMs Bonino's campaigning for human rights and consumer interests has made her famous from Bilbao to Bangladesh. Mr Monti cuts a quieter figure. But he bears knowing better. Schemes he has been steering through the corridors of Brussels will soon be changing the life of Europe's bourgeoisie. If you find a year or two hence (as you well may) that you can no longer park your money quietly in a Luxembourg bank account and the taxman be damned, that will be largely Mr Monti's doing. And when you find next year that duty-free sales have been abolished for journeys within the EU, Mr Monti will have helped that one along too. But look on the bright side. If you also find in two or three years' time that you can get a far better deal on your pension plan, or on your home mortgage or your credit card, because the financial services market has suddenly become truly competitive right across Europe—that will also be Mr Monti's legacy.\n\nAll these things flow from Mr Monti's responsibility for the single market and financial services, a portfolio that also includes matters of public procurement, taxation and intellectual property. No other post within the commission—save perhaps the competition portfolio held by Karel Van Miert—offers quite the same scope for directing economic theory towards thumpingly practical consequences. Take taxation. For a start, Mr Monti has proposed a list of 80 tax loopholes across the EU, mostly wheezes to benefit particular regions or industries, that he hopes governments will agree to close next month. More importantly, if he does indeed persuade EU governments to adopt a common regime for taxing interest on the savings of non-residents, another of the great redoubts of national sovereignty—the right to set direct tax rates freely—will have been breached.\n\nTo be fair to Mr Monti, he does not see things quite that way. He insists that he is not engaged in “tax harmonisation for the sake of harmonisation”, but rather in “tax co-ordination”—which he defines as helping member states to do what they want to do anyway. He sees his savings-tax project as a one-off. Harmonisation of corporate taxes may be a logical next step, he concedes, but it lies much further down the road—not least because EU countries will have to unify their accounting methods first, so that they can agree on what they are taxing.\n\nThe idea of the savings scheme is for all EU countries to impose a withholding tax of 20% on interest paid out to non-residents. Alternatively, they could make the payments untaxed, but would then inform tax authorities in the recipient's home country of that fact. It is “a weapon against cross-border tax evasion,” says Mr Monti, and one that he sees as serving a still greater good. If governments can raise more money from taxing capital, they can afford to tax labour more lightly. Jobs will be created more readily.\n\nWell, perhaps. You have to be something of an optimist to believe that governments which can tax more easily will also tax more lightly. But Mr Monti is just that optimist. He is a “small government” man, he says, a fan of fiscal discipline. He learnt his economics at Yale under James Tobin (whose proposal for a tax on foreign-exchange transactions he argued against within the commission). He seems genuinely to believe that most European governments are keen to get their taxes down, despite swings to the left in recent national elections. He was most upset last month when a “modest letter” he wrote to fellow commissioners on the subject of national budget deficits was misread by outsiders as an invitation for governments to resume spending like drunken sailors. On the contrary, he says, he wants governments only to spend more wisely, favouring capital investment.\n\nMr Monti is an optimist too in his view of public opinion. He thinks people can be persuaded to support projects such as the abolition of duty-free shopping with the argument that such things are right in principle. It is not the EU's job, he says, to “buy consensus by providing things we know are against the interests of millions of Europeans.” Indeed not. The commission exists to advance arguments of that sort. But their prevalence does help to explain why commissioners often find the transition back to national politics somewhat difficult to manage."}, {"url": "https://peoplepill.com/people/mario-monti-1/", "page_content": "Mario Monti, OMRI (born 19 March 1943) is an Italian economist who served as the Prime Minister of Italy from 2011 to 2013, leading a government of technocrats in the wake of the Italian debt crisis.\n\nMonti served as a European Commissioner from 1995 to 2004, with responsibility for the Internal Market, Services, Customs and Taxation from 1995 to 1999 and for Competition from 1999 to 2004. Monti has also been Rector and President of Bocconi University in Milan for many years. On 12 November 2011, in the midst of the European sovereign debt crisis, Monti was invited by President Giorgio Napolitano to form a new technocratic government following the resignation of Silvio Berlusconi. Monti was sworn in as Prime Minister on 16 November 2011, just a week after having been appointed a Senator for Life by President Napolitano, and initially became Minister of Economy and Finances as well, giving that portfolio up the following July. From 16 May 2013 to 17 October 2013 Monti was the President of Civic Choice, a centrist political party.\n\nEarly life\n\nMonti was born in Varese on 19 March 1943. His mother was from Piacenza. Although his father grew up in Varese, he was born in Luján in the Buenos Aires Province, Argentina, where his grandfather Abramo had emigrated to from Italy in the 19th century and built up a soft-drink and beer-production business. Monti's father went back to Argentina during World War II, but later returned to his family home in Varese.\n\nMonti studied at the private Leo XIII High School and attended Bocconi University of Milan, where he obtained a degree in economics in 1965. Later, he won a scholarship to Yale University where he studied under James Tobin, a recipient of the Nobel Prize in Economics.\n\nAcademic career\n\nMonti began his academic career at the University of Trento, before moving to teach economics at the University of Turin from 1970 to 1985, and finally to Bocconi University, where he was appointed Rector in 1989, and President in 1994. He also served as President of the SUERF (The European Money and Finance Forum) from 1982 to 1985. His research helped to create the \"Klein-Monti model\", aimed at describing the behaviour of banks operating under monopoly circumstances.\n\nEuropean Commissioner\n\nSanter Commission\n\nIn 1994, Monti was appointed to the Santer Commission, along with Emma Bonino, by Prime Minister Silvio Berlusconi. In his office as a European Commissioner from 1994 to 1999, he was responsible for internal market, financial services and financial integration, customs, and taxation. His work with the Commission earned him the nickname \"Super Mario\" from his colleagues and from the press.\n\nProdi Commission\n\nIn 1999, Prime Minister Massimo D'Alema confirmed Monti's appointment to the new Prodi Commission and he was given one of the most powerful positions at the Commission, with responsibility for Competition.\n\nAs Competition Commissioner, Monti led the investigation into a number of high-profile and controversial mergers, including: Scania AB & Volvo (1999), WorldCom & Sprint (2000), General Electric & Honeywell (2001), Schneider Electric & Legrand (2001) and Carnival Corporation & P&O Ferries (2002). His term in office also saw the European Court of Justice, for the first time, overrule the Commission's decision to block a merger in three separate cases, although two were decided by his predecessor. Monti was also responsible for levying the EU's largest ever fine at the time (€497 million) against Microsoft for abusing its dominant market position in 2004.\n\nMario Monti served as a European Commissioner from 1995 to 2004.\n\nMonti was criticised in the media and by competition lawyers for the perceived inflexibility of the merger oversight process and the high number of cases that were being blocked. On 1 November 2002, Monti responding to the European Court of Justice's ruling which reversed his decision to block the merger between Airtours & First Choice Holidays said, \"Last week was a tough week for the Commission's merger control policy and of course for me.\" This ruling in combination with his decision to block the General Electric & Honeywell merger led to criticism in the United States against both the Commission's procedures and accusations that Monti's decisions were politically motivated. Monti, however, was defended by supporters who saw his actions as an important step in the development of competition law in the EU. Dan Rubinfeld, economics professor at the University of California who worked on the US Justice Department's antitrust case against Microsoft, said of Monti, \"There has been a lot of talk of politics in this and other cases, but I believe he has been driven entirely by the desire to do the right thing.\"\n\nOn 11 December 2002, Monti proposed a series of reforms to the EU's merger rules and made structural changes within the Commission's Competition department which aimed to improve transparency for companies throughout the merger review process. The reforms were adopted by the EU as Regulation 139/2004 (known as ECMR).\n\nIn 2004, Prime Minister Silvio Berlusconi returned to power in Italy and chose not to re-appoint Monti to the Commission when his second term ended.\n\nBarroso Commission\n\nIn 2010, Monti was asked by Commission President Manuel Barroso to draft a \"Report on the Future of the Single Market\" proposing further measures towards the completion of the EU's Single Market. The published report, adopted by the EU on 13 April 2011, proposed 12 reforms to the Single Market and was intended to \"give new momentum\" to the European economy.\n\nPrime Minister of Italy\n\nAppointment\n\nMonti's Cabinet swearing-in ceremony at the presence of President Napolitano.\n\nOn 9 November 2011, Monti was appointed a lifetime senator by Italian President Giorgio Napolitano. He was seen as a favourite to replace Silvio Berlusconi to lead a new unity government in Italy in order to implement reforms and austerity measures. On 12 November 2011, following Berlusconi's resignation, Napolitano invited Monti to form a new government. Monti accepted the offer, and held talks with the leaders of the main Italian political parties, declaring that he wanted to form a government that would remain in office until the next scheduled general elections in 2013. On 16 November 2011, Monti was sworn in as Prime Minister of Italy, after unveiling a technocratic cabinet composed entirely of unelected professionals. He also chose to hold the post of Minister of Economy and Finances. On 17 and 18 November 2011, the Italian Senate and Italian Chamber of Deputies both passed motions of confidence supporting Monti's government, with only Lega Nord voting against.\n\nAusterity measures\n\nOn 4 December 2011, Monti's government introduced emergency austerity measures intended to stem the worsening economic conditions in Italy and restore market confidence, especially after rising Italian government bond yields began to threaten Italy's financial stability. The austerity package called for increased taxes, pension reform and measures to fight tax evasion. Monti also announced that he would be giving up his own salary as part of the reforms. On 16 December 2011, the Lower House of the Italian Parliament adopted the measures by a vote of 495 to 88. Six days later the Upper House gave final approval to the package by a vote of 257 to 41.\n\nLabour market reforms\n\nPrime Minister Monti with U.S. Secretary of State Hillary Clinton, 2012.\n\nOn 20 January 2012, Monti's government formally adopted a package of reforms targeting Italy's labour market. The reforms are intended to open certain professions (such as taxi drivers, pharmacists, doctors, lawyers and notaries) to more competition by reforming their licensing systems and abolishing minimum tariffs for their services. Article 18 of Italy's labour code, which requires companies that employ 15 or more workers to re-hire (rather than compensate) any employee found to have been fired without just cause, would also be reformed. The reforms to Article 18 are intended to make it easier for companies to dismiss or lay-off employees, which would hopefully encourage companies to hire more employees on permanent rather than short-term renewable contracts. The proposals have been met by strong opposition from labour unions and public protests. In early January 2012, consultations between the government and labour unions commenced and on 13 February it was reported in the Italian media that a compromise on the proposals was very close and the government was hopeful that reforms could be approved by the Italian parliament in March.\n\n2013 election\n\nOn 21 December 2012, Monti announced his resignation as Prime Minister, having made a public promise to step down after the passing of the 2012 Budget. He initially stated that he would only remain in office until an early election could be held. However, on 28 December, he announced that he would seek to remain Prime Minister by contesting the election, as the leader of a centrist coalition, the Civic Choice.\n\nThe election was held on 24 February 2013, and Monti's centrist coalition was only able to come fourth, with 10.5% of the vote. Monti remained Prime Minister until a coalition was formed on 28 April led by Enrico Letta.\n\nPolitical career\n\nSenator for life\n\nMario Monti with Russian Prime Minister Dmitry Medvedev at the 38th G8 summit.\n\nOn 9 November 2011, Monti was appointed a lifetime senator by Italian President Giorgio Napolitano, in accordance with the second paragraph of \"Article 59 of the Constitution, which merits national honor distinguished in science and social\". He was a member of the Commission for Industry, Commerce and Tourism from 30 November 2011 to 14 March 2013 in the sixteenth legislature. Monti was member of the independents' mixed parliamentary group until 19 March 2013, when he joined the Civic Choice (SC) parliamentary group, becoming the first lifetime senator aligned to a party group. On 7 May 2013, he became a member of the Commission for Foreign Affairs and Emigration.\n\nPresident of Civic Choice\n\nOn 4 January 2013, Monti launched Civic Choice as an electoral list of the civil society, to realize the implementation of his agenda in a future government. SC was announced as part of the With Monti for Italy (CMI) centrist coalition, alongside Union of the Centre (UdC) and Future and Freedom (FLI). In the 2013 general election the party obtained 8.3% of the vote, 37 deputies (on own lists) and 15 senators (within CMI). On 12 March 2013, Civic Choice was turned into a political party as Monti took office as acting SC president in the Provisional Committee of the party and appointed senator Andrea Olivero as provisional political coordinator. On 16 May 2013, Mario Monti was unanimously elected president of the Civic Choice.\n\nOn 17 October 2013 he resigned and was replaced by his deputy Alberto Bombassei as acting president. Monti cited his disagreement with 12 senators (out of 20), including Mario Mauro, Andrea Olivero, Gabriele Albertini, Pier Ferdinando Casini (UdC leader), Maria Paola Merloni, Luigi Marino and Lucio Romano. Particularly, Monti criticized Mauro's line of unconditioned support to the government and of transforming SC in a larger centre-right political party, open to The People of Freedom.\n\nThink tanks\n\nMonti actively participates in several major think tanks. He is a member of the Praesidium of Friends of Europe. He was the founding chairman of Bruegel, another European think tank, which was formed in 2005. He was the European Chairman of the Trilateral Commission until being sworn in as prime minister in 2011.\n\nMonti is a leading member of the exclusive Bilderberg Group. He has also been an international advisor to Goldman Sachs and The Coca-Cola Company. He has also been a member of the \"Senior European Advisory Council\" of Moody's and he is one of the members of the \"Business and Economics Advisors Group\" of the Atlantic Council.\n\nIn 2007, Mario Monti was one of the first supporters of the first European civic forum, États Généraux de l'Europe, initiated by European think tank EuropaNova and European Movement. He was also a member of the French government's Attali Commission from 2007 to 2008, appointed by Nicolas Sarkozy to provide recommendations to enhance economic growth in France.\n\nMonti is a founding member of the Spinelli Group, an organization launched in September 2010 to facilitate integration within the European Union (other members of the steering group include Jacques Delors, Daniel Cohn-Bendit, Guy Verhofstadt, Andrew Duff and Elmar Brok).\n\nIn January 2014, Monti became Chairman of the High Level Group on Own Resources, a consultative committee of the European Union aimed at proposing new forms of revenue for the European Union's budget. The final report of the group was adopted in December 2016 and published in January 2017. It argued for new tax sources, such as on carbon and fuel.\n\nPersonal life\n\nSince 1970 Monti has been married to Elsa Antonioli (born 1944), an Italian Red Cross volunteer, with whom he has two children, Federica and Giovanni.\n\nKnown for his reserved character, Monti acknowledges not being especially sociable. He said that his youth was given over to hard study; spare-time activities included cycling and keeping up with world affairs by tuning into foreign short-wave radio stations.\n\nAwards and decorations"}, {"url": "https://www.wikiwand.com/en/Mario_Monti", "page_content": "Mario Monti (born 19 March 1943) is an Italian economist and academic who served as the Prime Minister of Italy from 2011 to 2013, leading a technocratic government in the wake of the Italian debt crisis.\n\nItalian economist and politician (born 1943)\n\nQuick facts: Senator for lifeMario MontiOMRI, Prime Minist... ▼\n\nMonti served as a European Commissioner from 1995 to 2004, with responsibility for the Internal Market, Services, Customs and Taxation from 1995 to 1999 and for Competition from 1999 to 2004. Monti has also been rector and president of Bocconi University in Milan for many years.\n\nOn 12 November 2011, in the midst of the European sovereign debt crisis, Monti was invited by President Giorgio Napolitano to form a new technocratic government following the resignation of Silvio Berlusconi. Monti was sworn in as Prime Minister on 16 November 2011, just a week after having been appointed a Lifetime Senator by President Napolitano, and initially became Minister of Economy and Finances as well, giving that portfolio up the following July.\n\nFrom 16 May 2013 to 17 October 2013, Monti was the president of Civic Choice, a centrist[1] political party in Italy."}, {"url": "https://www.economist.com/charlemagne/2012/12/09/mario-montis-resignation", "page_content": "However understandable his decision, Mario Monti’s announcement of his intention to resign as prime minister will inflict serious, short-term damage. It means his government will come to an end in a premature, probably disorderly and possibly chaotic fashion. Mr Monti told Giorgio Napolitano, the president, on December 8th that he would step down as soon as the 2013 budget was passed. But it looks as if much else his government had been working on in recent months will now not be approved (or, in the case of measures introduced by decree, confirmed) in parliament. Legislation doomed or in jeopardy includes bills on competition, taxation and the simplification of bureaucracy. Another would have put into effect the new constitutional requirement for a balanced budget. Perhaps most importantly, a package of measures to stimulate economic growth is vulnerable – and particularly so because its ministerial sponsor Corrado Passera, the economic development minister, dared to criticise Silvio Berlusconi’s decision to run for prime minister and has become a hate figure for Mr Berlusconi’s followers. Mr Monti’s unexpected move has also dispelled what faint hopes remained of a new electoral law. So Italians will again vote under the same, deplorable arrangements that rob them of meaningful local representation. (Lawmakers are being chosen from closed lists for multi-seat constituencies.) Compounding the atmosphere of uncertainty, it is highly likely Mr Napolitano will himself resign soon. His mandate does not expire until May, but he has said on more than one occasion that it would not be right for him to appoint the next prime minister and then leave his successor to deal with the consequences.\n\nThe latest upheaval in Italy’s seldom-tranquil political landscape does not necessarily mean that Mr Berlusconi will now coming storming back into power with a mandate to slash taxes and boost spending. His People of Freedom (PdL) movement is divided, demoralised and languishing in the polls at around 15%. The same polls indicate that even an alliance with the Northern League, which now becomes possible, and others, would win less than a 25% share of the vote. It seems unlikely that such an alliance could make up the ground needed to secure an outright victory. But in an already confused situation in which a party led by a comedian, Beppe Grillo, is reckoned to have the second-biggest following of any political movement, Mr Berlusconi and his followers and allies could put themselves in a position to determine events after the general election.\n\nMr Berlusconi had been looking forward to almost three months in which the PdL movement would keep alive the current, non-party government in parliament with a policy of abstention rather than opposition. During that time, he would have been able to plot his electoral campaign, reorganise his divided followers and, at the same time, comprehensively denigrate the austerity and other policies of the government while presenting himself as the man to give the electorate a less painful way forward. But because of Mr Monti’s decision at the weekend, Mr Berlusconi is now in a headlong rush to a snap election, possibly as early as February 17th, and with the Christmas, New Year and Epiphany holidays in between.\n\nThe prime minister has also given himself the leeway in which to stand in the election as the paladin of a new, more sober, and implicitly more responsible, centre-right. If he were to do so, he could well draw to his camp some of the media tycoon’s more disgruntled followers, notably conservative Catholics and some of the former neo-fascists whom Mr Berlusconi was, until a few days ago, plotting to squeeze out of the PdL. But a Monti candidature would also create an opportunity for Mr Berlusconi to depict all of his adversaries, and not just Mr Monti, as the supporters of what his followers already call “the government of taxes”.\n\nThough opinion polls show Mr Monti is still respected, they also show widespread dissatisfaction with the effect of his policies on their disposable incomes and a dislike, or even loathing, of his government. In these circumstances, a campaign in which Mr Berlusconi offered tax cuts, supposedly to dynamise the economy, could have great appeal.\n\nThe coming election campaign will be, above all, a test of the maturity and realism of Italian voters. One could feel more confident if they had not on three occasions chosen Mr Berlusconi as their leader."}], "Mario Monti served as the Prime Minister of Italy from 2011 to 2013.": [{"url": "https://www.britannica.com/biography/Mario-Monti", "page_content": "Mario Monti, (born March 19, 1943, Varese, Italy), Italian economist, academic, and bureaucrat who served as prime minister of Italy (2011–13).\n\nMonti, the son of a banker, studied economics and management at Bocconi University in Milan and received a degree in 1965. He then pursued graduate studies at Yale University under the tutelage of American economist James Tobin. Monti taught briefly at the University of Trento (1969–70) and began a post at the University of Turin (1970–79) before returning to Bocconi University in 1971 as a professor of monetary theory and policy. He later directed (1985–94) the school’s Institute of Economics. In 1989 he became rector of the university, and five years later he was named its president.\n\nAs a consultant to one of Italy’s largest banks in the 1970s, Monti gained attention for publishing his own estimates of the country’s money supply at a time when official figures were not publicly available. Beginning the following decade, he served on several committees of the Italian treasury and was president of SUERF (Société Universitaire Européenne de Recherches Financières; now the European Money and Finance Forum) in 1982–85. Also during this time Monti wrote commentaries on economics for the Milan newspaper Corriere della Sera (1978–94) and sat on a number of corporate boards.\n\nIn 1995 Monti, having been nominated by Italian Prime Minister Silvio Berlusconi, took a seat on the European Commission (EC), for which he oversaw issues relating to the internal market, financial services, and taxation. Receiving a second term in 1999, he became the European commissioner for competition, and in that capacity, he took a tough-minded approach to proposed corporate mergers and antitrust cases that won him wide respect. After his EC tenure concluded in 2004, he helped found Bruegel, a Brussels-based think tank with a focus on economic globalization.\n\nIn November 2011, in the wake of a public debt crisis in Italy that weakened Berlusconi’s grip on power, the politically independent Monti became a leading candidate to assume the country’s premiership in a national unity government. (It was hoped that Monti’s experience as a technocrat would prove beneficial in the implementation of urgent economic reforms.) On November 9 he was made a lifetime member of the Italian Senate, and four days later, upon Berlusconi’s resignation, Pres. Giorgio Napolitano asked Monti to form a government.\n\nInitially serving as both prime minister and finance minister (he held the latter post until July 2012), Monti swiftly persuaded parliament to approve an austerity package that relied heavily on tax increases. In early 2012 a set of measures he introduced in an effort to liberalize the service sector was also passed. Although Italy continued to face economic uncertainty, Monti’s decisive leadership was widely judged to have helped the country forestall disaster. As the year continued, he also emerged as a key player in international negotiations aimed at financially stabilizing the entire euro zone.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nIn December, however, Monti’s government lost the support of Berlusconi’s People of Freedom (Popolo della Libertà) party during two otherwise successful parliamentary confidence votes. He resigned from office shortly thereafter, remaining in a caretaker role until a new government could be formed. In early elections held in February 2013, Monti led an alliance of centrist political factions, but they failed to win enough parliamentary seats to play a significant role in the ensuing efforts to build a government coalition. After two months of political deadlock, Monti was finally succeeded by Enrico Letta, a Democratic Party (Partito Democratico) leader appointed by Napolitano."}, {"url": "https://www.nytimes.com/2011/11/14/world/europe/mario-monti-asked-to-form-a-new-government-in-italy.html", "page_content": "ROME — Mario Monti, a former member of the European Commission, conditionally accepted a mandate on Sunday to form a new government in Italy whose main task will be to keep the country from being dragged under by Europe’s debt crisis.\n\nMr. Monti, 68, a respected economist who has promised to be a steady hand in a time of market turbulence, said he expected to move ahead as soon as he secured a parliamentary majority for the new government.\n\nAssembling a majority usually requires days or weeks of talks, but Italy does not have the luxury of time. Skeptical investors have pushed the country’s borrowing costs to dangerous heights, putting at risk the euro currency that 17 nations share. The crisis forced the resignation of Prime Minister Silvio Berlusconi on Saturday, turning Italy’s most complex political shift in nearly two decades into one of its most urgent transitions.\n\nPresident Giorgio Napolitano, who as the head of state must approve the formation of a new government, gave a tough speech on Sunday aimed at reassuring investors about Italy’s commitment to the euro and warning the nation’s insular political class about the stakes involved. He called on lawmakers to form a broad coalition in support of Mr. Monti that would be able to push through urgent economic measures."}, {"url": "https://www.worldatlas.com/articles/prime-ministers-of-the-republic-of-italy.html", "page_content": "Italy’s Prime Minister is the country’s Head of Government, leading both the Parliament and the Cabinet at the forefront of national politics. The institution of Prime Minister in the Republic of Italy was established in June 1946, when a national referendum established the Democratic Republic in place of the Monarchy. The Prime Minister is appointed by the President and advises the President on the composition of the cabinet. The Prime Minister is mandated by the constitution to direct and control the activities of the ministers. The Prime Minister acts as a mediator between political parties and works to sustain unity in the government. Italy has had many prime ministers since the office was established in 1946, some of which have served in the office for a number of times. The current prime minister is Matteo Renzi, who took office in 2014.\n\nAlcide De Gasperi\n\nAlcide De Gasperi was the first Prime Minister of the Republic of Italy following World War II, serving in the role from 1946 until 1953. He was born on April 3, 1881, in Trentino which was then part of Austria-Hungary, Alcide studied philosophy and literature at the University of Vienna. He had already become involved in Catholic organizations in school and became editor of a magazine called La Voce Cattolica di Trento. Alcide became an MP in the Austrian Parliament in 1911, and he lobbied for Trent’s unification with Italy during World War I. After the war, the then citizen of Italy, Alcide was one of the founders of the Italian Popular Party. He became a Deputy in the Italian Parliament but was then imprisoned for opposing the fascist regime. After his release in 1929, he distanced himself from politics until 1943 when he helped establish the Christian Democracy Party. He was Prime Minister in eight successive administrations throughout his term. He is credited with guiding Italy’s economic and moral reconstruction in the aftermath of World War II. He was one of the founding members of the European Union and signed treaties with the victors of the World War II. He died on August 19, 1954, in Trentino, Italy.\n\nGiuseppe Pella\n\nGiuseppe Pella succeeded Alcide De Gasperi as Prime Minister, a position he held from 1953 until 1954. He was born on April 18, 1902, in Valdengo, Giuseppe graduated with Economics and Commerce and became involved with the Christian Democracy. He held several government positions, namely the undersecretary of Finance, Minister of Finance, and Minister of Treasure. He was elected as Prime Minister on August 17, 1953, and he was also the Minister of Budget and the acting Minister of Foreign Affairs. He caused diplomatic tensions with Yugoslavia after requesting for the authorization to fly the Italian Flag in the Trieste City Hall. He resigned from the position on January 12, 1954, and held his last governmental post in 1972 as Minister of Finance. He was Senator for life until his death in 1981 in Rome, Italy.\n\nAmintore Fanfani\n\nAmintore Fanfani succeeded Giuseppe Pella and served for several different terms. Specifically, he was in the office in 1954, 1958-1959, 1960-1963, 1982-1983, and finally again in 1987. He was born on February 6, 1908, in Tuscany, Amintore graduated with economics and business degree from the Catholic University of Milan in 1932. He became a professor of economic history and in 1946 he was elected to the Constituent Assembly. He joined the Chamber of Deputies in 1948. He then served in various ministerial posts such as Minister of Labor, Minister of Agriculture and Minister of the Interior. He was elected as Prime Minister and Secretary General of the Christian Democratic Party in 1954. He initiated numerous reform policies and gained Italy’s admission to the United Nations Security Council. He was one of the few Italian statesmen to admit that his support of the fascist regime had been wrong. He died on November 20, 1999, in Rome, Italy.\n\nMario Scelba\n\nMario Scelba served as the Prime Minister of the Republic of Italy from 1954 until 1955. He was born on September 5, 1901, in Sicily. Mario graduated from the University of Rome, having studied Law. He started his political career in the Popular Party and after the fall of the Fascist regime actively participated in the newly formed Christian Democracy as a chief counselor from 1944. After his election to the Constituent Assembly in 1946, Mario held a succession of government posts such as the Minister of Post and Telecommunications and Minister of the Interior. As Minister of the Interior, Mario ruled with an iron fist and discouraged labor unions and communists. During his term as Prime Minister, his achievements were largely overshadowed by the Portella Della Ginestra massacre and the Montesi Affair. He tightened relations with the US, solved long time war issues such as the recovery of Trieste and ratified the Paris Peace Treaties of 1947. Mario ceased to be Prime Minister in 1955 and served in other government posts before his death on October 29, 1991, in Rome, Italy."}, {"url": "https://www.italyonthisday.com/2016/03/mario-monti-prime-minister-technocrat-varese-milan-super-mario.html", "page_content": "\n\n\n\n‘Super Mario’ steps in during debt crisis\n\n\n\n\n\nMario Monti was Prime Minister of Italy\n\nfrom 2011 to 2013\n\nEconomist Mario Monti, who was Prime Minister of Italy from 2011 to 2013, was born on this day in 1943 in Varese in Lombardy.\n\n\n\n\n\nMonti was invited by Italian President Giorgio Napolitano to form a new Government after the resignation of Silvio Berlusconi in November 2011 in the middle of the European debt crisis.\n\n\n\n\n\nMonti, who was the 54th Prime Minister of Italy, led a Government of technocrats, who introduced austerity measures in Italy.\n\n\n\n\n\nMonti was born in Varese and, after attending a private school, went to Bocconi University in Milan, where he obtained a degree in Economics.\n\n\n\n\n\nHe was a European Commissioner from 1994 to 1999, where he obtained the nickname ‘Super Mario’ from his colleagues and the Press.\n\n\n\n\n\nIn 1999 the Prime Minister at the time, Massimo D’Alema, appointed him to the new Prodi Commission, giving him responsibility for Competition.\n\n\n\n\n\nSilvio Berlusconi\n\nHe was made a lifetime senator by Giorgio Napolitano in November 2011 and a few days later he was invited to form a new Government following Berlusconi’s resignation.\n\n\n\n\n\nHe appointed a technocratic cabinet composed entirely of unelected professionals.\n\n\n\n\n\nThey introduced austerity measures to try to stem the worsening economic conditions in Italy. He announced that he would be giving up his own salary as part of the reforms.\n\n\n\n\n\nMonti resigned as Prime Minister after the 2012 Budget was passed, as he had always pledged he would do.\n\n\n\n\n\nSince January 2014, Monti has been Chairman of the High Level group on Own Resources, a consultative committee of the European Union that will propose new forms of revenue for the European Union’s budget.\n\n\n\n\n\nA view over the beautiful Lake Varese\n\nPhoto: Idéfix (CC BY-SA 3.0)\n\nTravel tip:\n\n\n\n\n\nVarese is a city in Lombardy, 55 kilometres north of Milan and close to Lago Maggiore. It is rich in castles, villas and gardens, many connected with the Borromeo family, who are from the area. Lake Varese is 8.5 kilometres long, set in low rolling hills just below Varese.\n\n\n\n\n\nHotels in Varese by Booking.com\n\n\n\nTravel tip:\n\n\n\nBocconi University is a private university in Milan that provides education in the fields of economics, management, finance, law and public administration. It was founded in 1902 by Ferdinanado Bocconi and was originally located in Via Statuto near the Pinacoteca di Brera in Milan.\n\n\n\n"}, {"url": "https://www.theguardian.com/world/2012/dec/23/mario-monti-return-italy-prime-minister", "page_content": "Mario Monti says he will consider returning as prime minister of Italy after elections in February – and has launched a stinging attack on Silvio Berlusconi, who brought down his technocratic government this month.\n\nMonti, commenting on the attacks on his austerity programme, as well as the offers he has had to lead a new centre-right coalition, said: \"I am struggling trying to follow [Berlusconi's] line of thinking.\"\n\nWhile throwing his hat back into the ring, Monti refused to name parties he would ally with, merely stating that he would consider politicians who sign up to a programme of reforms he wanted carried out in Italy.\n\n\"I would be ready to offer my appreciation, encouragement, and if asked, leadership\" to parties that backed the programme, he said, adding that it would soon be posted online.\n\nMonti said he would not join a party ticket before the election, but added: \"If one or more political forces who adhere to the programme propose me as a candidate for prime minster, I would consider it.\"\n\nHis keenly awaited speech, following his resignation as technocrat premier on Friday, partly cleared up the confusion surrounding Italy's return to fully democratic government after Monti's appointment last November.\n\nBut he left doubt over whether he would front a coalition of centrist parties, including the descendant of the Christian Democrats, which has been lobbying him to stand as their leader.\n\nMonti is unlikely to win the election, and his statement allows him time to see how the centrist parties fare in the polls. Italy's centre-left Democratic party, which has asked Monti not to stand, is leading the polls. In an interview published by La Repubblica on Friday, Monti criticised the centrists: \"They have been politicians since they were children and people can't tolerate professional politicians anymore,\" he said.\n\nBy not committing, the former EU commissioner has also left open the door to becoming Italy's next president in 2013.\n\nHe was surprisingly fierce in his criticism of Berlusconi, who pulled his support for Monti this month, triggering his resignation, and who this weekend condemned Monti's government as a \"complete disaster\".\n\nMonti said Italians could \"hold their heads high\" after his government implemented fiscal restraint to restore Italy's credibility following Berlusconi's resignation in November 2011.\n\nHe said his new programme promoted collaborating with the EU to improve Italy's future, as opposed to Berlusconi's constant attacks on the bloc. A simple \"slap on the back\" in Europe would not get results, Monti added, an apparent reference to his rival's bonhomie at summits.\n\nMonti also warned against dropping a controversial property tax that Berlusconi was campaigning against, adding that scrapping it would only result in reintroducing it doubled the following year.\n\nA much-needed anti-corruption law had been \"impoverished\" by Berlusconi's opposition, he said, warning that Italy required laws on false accounting and conflicts of interest.\n\nMonti also called for the next government to undertake a \"drastic simplification\" of the country's labour laws and a strengthening of the reforms launched by his government. He advised the Italian left to accept laws to open key sectors of the economy.\n\n\"I hope Italy does not need to be saved every year,\" he said in reference to his 13-month administration, and urged politicians to focus on the next generation rather than the next election."}, {"url": "https://www.economist.com/charlemagne/2012/12/09/mario-montis-resignation", "page_content": "However understandable his decision, Mario Monti’s announcement of his intention to resign as prime minister will inflict serious, short-term damage. It means his government will come to an end in a premature, probably disorderly and possibly chaotic fashion. Mr Monti told Giorgio Napolitano, the president, on December 8th that he would step down as soon as the 2013 budget was passed. But it looks as if much else his government had been working on in recent months will now not be approved (or, in the case of measures introduced by decree, confirmed) in parliament. Legislation doomed or in jeopardy includes bills on competition, taxation and the simplification of bureaucracy. Another would have put into effect the new constitutional requirement for a balanced budget. Perhaps most importantly, a package of measures to stimulate economic growth is vulnerable – and particularly so because its ministerial sponsor Corrado Passera, the economic development minister, dared to criticise Silvio Berlusconi’s decision to run for prime minister and has become a hate figure for Mr Berlusconi’s followers. Mr Monti’s unexpected move has also dispelled what faint hopes remained of a new electoral law. So Italians will again vote under the same, deplorable arrangements that rob them of meaningful local representation. (Lawmakers are being chosen from closed lists for multi-seat constituencies.) Compounding the atmosphere of uncertainty, it is highly likely Mr Napolitano will himself resign soon. His mandate does not expire until May, but he has said on more than one occasion that it would not be right for him to appoint the next prime minister and then leave his successor to deal with the consequences.\n\nThe latest upheaval in Italy’s seldom-tranquil political landscape does not necessarily mean that Mr Berlusconi will now coming storming back into power with a mandate to slash taxes and boost spending. His People of Freedom (PdL) movement is divided, demoralised and languishing in the polls at around 15%. The same polls indicate that even an alliance with the Northern League, which now becomes possible, and others, would win less than a 25% share of the vote. It seems unlikely that such an alliance could make up the ground needed to secure an outright victory. But in an already confused situation in which a party led by a comedian, Beppe Grillo, is reckoned to have the second-biggest following of any political movement, Mr Berlusconi and his followers and allies could put themselves in a position to determine events after the general election.\n\nMr Berlusconi had been looking forward to almost three months in which the PdL movement would keep alive the current, non-party government in parliament with a policy of abstention rather than opposition. During that time, he would have been able to plot his electoral campaign, reorganise his divided followers and, at the same time, comprehensively denigrate the austerity and other policies of the government while presenting himself as the man to give the electorate a less painful way forward. But because of Mr Monti’s decision at the weekend, Mr Berlusconi is now in a headlong rush to a snap election, possibly as early as February 17th, and with the Christmas, New Year and Epiphany holidays in between.\n\nThe prime minister has also given himself the leeway in which to stand in the election as the paladin of a new, more sober, and implicitly more responsible, centre-right. If he were to do so, he could well draw to his camp some of the media tycoon’s more disgruntled followers, notably conservative Catholics and some of the former neo-fascists whom Mr Berlusconi was, until a few days ago, plotting to squeeze out of the PdL. But a Monti candidature would also create an opportunity for Mr Berlusconi to depict all of his adversaries, and not just Mr Monti, as the supporters of what his followers already call “the government of taxes”.\n\nThough opinion polls show Mr Monti is still respected, they also show widespread dissatisfaction with the effect of his policies on their disposable incomes and a dislike, or even loathing, of his government. In these circumstances, a campaign in which Mr Berlusconi offered tax cuts, supposedly to dynamise the economy, could have great appeal.\n\nThe coming election campaign will be, above all, a test of the maturity and realism of Italian voters. One could feel more confident if they had not on three occasions chosen Mr Berlusconi as their leader."}, {"url": "https://www.reuters.com/article/us-italy-leader-idUSTRE7B30GM20111204", "page_content": "Position: Italian Prime Minister and finance minister\n\nIncumbent: Mario Monti\n\nBorn: March 19, 1943\n\nTerm: November 2011, next election due 2013\n\nKey Facts:\n\n- Mario Monti was appointed by President Giorgio Napolitano to lead a technocrat government, replacing Silvio Berlusconi who lost his parliamentary majority as the euro debt crisis threatened to push Italy’s borrowing costs out of control. Monti also holds the finance and economy portfolio. He has said he intends to remain in office until the next scheduled elections in 2013.\n\n- Monti, a distinguished economist, served as a European Commissioner between 1995 and 2005, first as internal markets commissioner and later as competition commissioner, where he made his name in high profile battles against corporate giants Microsoft and General Electric. He was President of Milan’s Bocconi University before being named Life Senator by Napolitano and asked to form a government after Berlusconi’s resignation.\n\n- Sober and reserved, in sharp contrast to his flamboyant predecessor, Monti is known as a tough negotiator. He has close connections to European policy makers from his time in Brussels and is a former adviser to Goldman Sachs and Coca Cola and a member of the Bilderberg group of business leaders and other influential figures.\n\n- Monti has pledged to restore confidence in Italy’s public finances through budget rigour, economic growth and social fairness. Priorities include pension, tax and labour market reform as well as education and getting more women into the workforce. He has maintained Italy’s target of achieving a balanced budget by 2013 and has argued for greater economic and fiscal integration between European Union member states."}, {"url": "https://www.washingtonpost.com/world/europe/italy-turns-to-economist-mario-monti-to-lead-it-out-of-crisis/2011/11/13/gIQAvXFZIN_story.html", "page_content": "With the clock ticking to pull Italy back from the brink of a full-blown debt crisis, the nation turned Sunday to a clinical-minded economist to take the reins of power after the resignation of its longtime playboy prime minister, Silvio Berlusconi.\n\nMario Monti, a 68-year-old former university president and European Commission member, was named interim prime minister, effectively charging him with the task of bringing Italy’s bickering political parties together behind a new transitional government.\n\nBut only hours after Berlusconi stepped down, his still-powerful party was holding out for tough conditions to support Monti in the days ahead, and the 75-year-old media tycoon was already hinting at an eventual comeback attempt.\n\nOn Sunday, just as Monti’s post was being made official by President Giorgio Napolitano, Italy’s ceremonial head of state, Berlusconi unleashed a limelight-stealing video message to the nation calling his resignation Saturday an act of personal selflessness and vowing to work tirelessly to “save Italy.”\n\nWith markets opening Monday for the first time since Berlusconi’s resignation, the lingering political uncertainty here suggested nail-biting days ahead. In addition, analysts said that even if Italian politicians coalesce behind Monti’s interim government, it remains unclear whether his mandate will be strong enough to push through a package of economic measures that economists say is needed to restore investor confidence in the world’s eighth-largest economy.\n\n“Italy can overcome this crisis together,” Monti said from Rome’s Quirinal Palace, adding that he would urgently seek to form a new government. “We owe it to our children, so that they may have a future of dignity and hope.”\n\nFor now, at least, the challenge of trying to save Italy was in the hands of Monti, a technocrat who in many respects is the anti-Berlusconi.\n\nBerlusconi’s resignation came after he denied the existence of a crisis, losing the confidence of investors, other European leaders and his political allies. In contrast, Monti, who has been nicknamed “Super Mario” for his skill as a European commissioner, is well respected in Europe’s boardrooms and halls of power. He also is viewed as a credible figure who has spoken widely about the need for Italy to introduce more competition and take other major steps to ignite an economy that has wallowed in low to negative growth for years.\n\nMonti was selected specifically because he appeared to have no long-term political ambitions and was not beholden to any of Italy’s big party bosses. But his reputation as an outsider in the personality-driven world of Italian politics was both a help and a hindrance as he sought to form a new government. Some of the measures under consideration to reassure investors — including a levy on property and bank accounts — could be so politically difficult that he would require strong backing in parliament.\n\n“On one hand, he is well known in Europe, and the markets like Monti,” said Gianfranco Pasquino, a political scientist at the University of Bologna. “But on the other hand, he is very new to Italian politics, which is basically a lake of sharks.”\n\nThough a free-market economist, Monti was nevertheless facing the fiercest resistance from Italy’s right wing. The conservative Northern League has refused to back him, instead calling for snap elections that could leave the nation stuck in a political vacuum for months.\n\nThat made support from Berlusconi’s People of Liberty Party central to Monti’s ability to govern. On Sunday, the party’s chief and Berlusconi’s anointed successor, 41-year-old former justice minister Angelino Alfano, said the party would back Monti only if a list of conditions was met. They included a pledge that the term and mandate of the new government would be strictly limited to passing the needed package of economic measures, after which new elections would be held. The party also wants the right to approve Monti’s new list of ministers and insists that only technocrats — not political figures — make up the new cabinet.\n\nYet Alfano also said that Berlusconi, who dominated Italian politics for nearly two decades and whose womanizing and corruption charges divided the nation, was not yet ready to “walk in the gardens” of political retirement. Berlusconi drove that home Sunday, issuing a letter to a right-wing party suggesting he hoped to “resume the path to government.” He also issued a lengthy, after-the-fact resignation speech, taking a swipe at the protesters who chanted “fool” at him and uncorked champagne to celebrate his downfall Saturday night.\n\n“To those who yesterday exulted for my exit from the political scene, I say very clearly that starting tomorrow, I will double my efforts in parliament to renew Italy,” Berlusconi said.\n\nSpecial correspondent Sarah Delaney contributed to this report."}, {"url": "https://www.theguardian.com/world/2011/nov/16/mario-monti-technocratic-cabinet-italy", "page_content": "Mario Monti, the former European commissioner, has been sworn in as Italy's prime minister along with the ministers of his new, technocratic government, charged with steering the eurozone's most indebted nation out of danger.\n\nThe 17-strong cabinet will be able to bring to bear on Italy's daunting problems a formidable amount of intellectual fire-power. More than a third of the seats in the cabinet will be occupied by professors, including the prime minister himself. Monti, a distinguished liberal economist, kept the finance and economics portfolios. He handed the economic development and infrastructure portfolios to Corrado Passera, the chief executive of Italy's biggest retail bank, Intesa Sanpaolo.\n\nThree of the cabinet ministers are women, and two were appointed to top jobs: Anna Maria Cancellieri as interior minister and Paola Severino as justice minister. Elsa Fornero will have heavy responsibilities as minister for welfare and employment.\n\nSpeaking after announcing his cabinet, Monti said: \"We feel sure of what we have done and we have received many signals of encouragement from our European partners and the international world. All this will, I trust, translate into a calming of that part of the market difficulty which concerns our country.\"\n\nThe new government took office at a time when Italy was engulfed by the eurozone crisis, with its benchmark borrowing costs at an unsustainably high level of more than 7%. The swearing in of the new government made little difference to sovereign yields but it appeared to cheer the Milan bourse which closed almost 0.8% up on a day that saw Frankfurt and London lose ground.\n\nMonti confirmed he would take on the prime ministership after two days of consultations. The uncertainties surrounding the formation of the new government were maintained to the end by a much longer than expected two-and-a-half hour meeting between the incoming prime minister and the president.\n\nThe names on the list of his ministers – most of which were unknown to members of the Italian general public – showed that Monti had failed in his attempt to involve party representatives. His cabinet was made up exclusively of non-aligned specialists.\n\n\"The absence of political personalities in the government will help rather than hinder a solid base of support for the government in parliament and in the political parties because it will remove one ground for disagreement,\" he said.\n\nThe economics professor turned eurocrat managed to stave off – at least temporarily – demands from the outgoing prime minister, Silvio Berlusconi, and his party for the new government to have a limited programme and a fixed lifespan. The influence that Berlusconi's Freedom party will exercise over the new government was nevertheless made clear in the run-up to Wednesday's announcement.\n\nMonti spent three hours at a meeting that finished after 2.30am, with Angelino Alfano, the secretary of Berlusconi's party, trying to reach agreement on the names of the new ministers. Berlusconi was ousted after losing his majority last week in the lower house of parliament, the chamber of deputies. But he and his former coalition allies in the Northern League can still command a majority in the senate. The prime minister will have to outline his government's programme and seek votes of confidence in both houses of parliament. The first is due to take place in the Senate on Thursday evening.\n\nPresident Giorgio Napolitano asked Monti to form a government after Berlusconi's rightwing coalition lost a crucial vote in the lower house on the 2010 public accounts.\n\nMeanwhile, Greece's new technocrat government won a confidence vote in parliament with a large majority , backing a pledge by prime minister Lucas Papademos to speed up long-term reforms and secure a massive new bailout deal involving banks and rescue creditors. In the country's 300-member parliament, 255 voted in favour of the new government formed last week by the majority socialists, rival conservatives and a small right-wing nationalist party. Only 38 voted against, while the remaining seven were absent."}], "Mario Monti led a government of technocrats in the wake of the Italian debt crisis.": [{"url": "https://www.britannica.com/biography/Mario-Monti", "page_content": "Mario Monti, (born March 19, 1943, Varese, Italy), Italian economist, academic, and bureaucrat who served as prime minister of Italy (2011–13).\n\nMonti, the son of a banker, studied economics and management at Bocconi University in Milan and received a degree in 1965. He then pursued graduate studies at Yale University under the tutelage of American economist James Tobin. Monti taught briefly at the University of Trento (1969–70) and began a post at the University of Turin (1970–79) before returning to Bocconi University in 1971 as a professor of monetary theory and policy. He later directed (1985–94) the school’s Institute of Economics. In 1989 he became rector of the university, and five years later he was named its president.\n\nAs a consultant to one of Italy’s largest banks in the 1970s, Monti gained attention for publishing his own estimates of the country’s money supply at a time when official figures were not publicly available. Beginning the following decade, he served on several committees of the Italian treasury and was president of SUERF (Société Universitaire Européenne de Recherches Financières; now the European Money and Finance Forum) in 1982–85. Also during this time Monti wrote commentaries on economics for the Milan newspaper Corriere della Sera (1978–94) and sat on a number of corporate boards.\n\nIn 1995 Monti, having been nominated by Italian Prime Minister Silvio Berlusconi, took a seat on the European Commission (EC), for which he oversaw issues relating to the internal market, financial services, and taxation. Receiving a second term in 1999, he became the European commissioner for competition, and in that capacity, he took a tough-minded approach to proposed corporate mergers and antitrust cases that won him wide respect. After his EC tenure concluded in 2004, he helped found Bruegel, a Brussels-based think tank with a focus on economic globalization.\n\nIn November 2011, in the wake of a public debt crisis in Italy that weakened Berlusconi’s grip on power, the politically independent Monti became a leading candidate to assume the country’s premiership in a national unity government. (It was hoped that Monti’s experience as a technocrat would prove beneficial in the implementation of urgent economic reforms.) On November 9 he was made a lifetime member of the Italian Senate, and four days later, upon Berlusconi’s resignation, Pres. Giorgio Napolitano asked Monti to form a government.\n\nInitially serving as both prime minister and finance minister (he held the latter post until July 2012), Monti swiftly persuaded parliament to approve an austerity package that relied heavily on tax increases. In early 2012 a set of measures he introduced in an effort to liberalize the service sector was also passed. Although Italy continued to face economic uncertainty, Monti’s decisive leadership was widely judged to have helped the country forestall disaster. As the year continued, he also emerged as a key player in international negotiations aimed at financially stabilizing the entire euro zone.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nIn December, however, Monti’s government lost the support of Berlusconi’s People of Freedom (Popolo della Libertà) party during two otherwise successful parliamentary confidence votes. He resigned from office shortly thereafter, remaining in a caretaker role until a new government could be formed. In early elections held in February 2013, Monti led an alliance of centrist political factions, but they failed to win enough parliamentary seats to play a significant role in the ensuing efforts to build a government coalition. After two months of political deadlock, Monti was finally succeeded by Enrico Letta, a Democratic Party (Partito Democratico) leader appointed by Napolitano."}, {"url": "https://www.nytimes.com/2011/11/13/world/europe/silvio-berlusconi-resign-italy-austerity-measures.html", "page_content": "ROME — With his country swept up in Europe’s debt crisis and his once-mighty political capital spent, Prime Minister Silvio Berlusconi resigned on Saturday, punctuating a tumultuous week and ending an era in Italian politics.\n\nHis exit, a sudden fall after months of political stalemate, paves the way for a new government of technocrats led by Mario Monti, a former member of the European Commission. Mr. Monti is likely to be installed in the next few days, following the apparent consent of key blocs of Mr. Berlusconi’s center-right coalition.\n\nHis resignation came just days after the fall of Prime Minister George A. Papandreou in Greece. Both men were swept away amid a larger crisis that has threatened the entire European Union, in which roiling financial markets have upended traditional democratic processes.\n\nThough it was met by cheering crowds in Rome, the end of Mr. Berlusconi’s 17-year chapter in Italian politics, characterized by his defiance and fortitude, sets off a jarring political transition. “This is the most dramatic moment of our recent history,” Ferruccio de Bortoli, the editor of the Milan daily newspaper Corriere della Sera, said Saturday."}, {"url": "https://www.theguardian.com/world/2011/nov/16/mario-monti-technocratic-cabinet-italy", "page_content": "Mario Monti, the former European commissioner, has been sworn in as Italy's prime minister along with the ministers of his new, technocratic government, charged with steering the eurozone's most indebted nation out of danger.\n\nThe 17-strong cabinet will be able to bring to bear on Italy's daunting problems a formidable amount of intellectual fire-power. More than a third of the seats in the cabinet will be occupied by professors, including the prime minister himself. Monti, a distinguished liberal economist, kept the finance and economics portfolios. He handed the economic development and infrastructure portfolios to Corrado Passera, the chief executive of Italy's biggest retail bank, Intesa Sanpaolo.\n\nThree of the cabinet ministers are women, and two were appointed to top jobs: Anna Maria Cancellieri as interior minister and Paola Severino as justice minister. Elsa Fornero will have heavy responsibilities as minister for welfare and employment.\n\nSpeaking after announcing his cabinet, Monti said: \"We feel sure of what we have done and we have received many signals of encouragement from our European partners and the international world. All this will, I trust, translate into a calming of that part of the market difficulty which concerns our country.\"\n\nThe new government took office at a time when Italy was engulfed by the eurozone crisis, with its benchmark borrowing costs at an unsustainably high level of more than 7%. The swearing in of the new government made little difference to sovereign yields but it appeared to cheer the Milan bourse which closed almost 0.8% up on a day that saw Frankfurt and London lose ground.\n\nMonti confirmed he would take on the prime ministership after two days of consultations. The uncertainties surrounding the formation of the new government were maintained to the end by a much longer than expected two-and-a-half hour meeting between the incoming prime minister and the president.\n\nThe names on the list of his ministers – most of which were unknown to members of the Italian general public – showed that Monti had failed in his attempt to involve party representatives. His cabinet was made up exclusively of non-aligned specialists.\n\n\"The absence of political personalities in the government will help rather than hinder a solid base of support for the government in parliament and in the political parties because it will remove one ground for disagreement,\" he said.\n\nThe economics professor turned eurocrat managed to stave off – at least temporarily – demands from the outgoing prime minister, Silvio Berlusconi, and his party for the new government to have a limited programme and a fixed lifespan. The influence that Berlusconi's Freedom party will exercise over the new government was nevertheless made clear in the run-up to Wednesday's announcement.\n\nMonti spent three hours at a meeting that finished after 2.30am, with Angelino Alfano, the secretary of Berlusconi's party, trying to reach agreement on the names of the new ministers. Berlusconi was ousted after losing his majority last week in the lower house of parliament, the chamber of deputies. But he and his former coalition allies in the Northern League can still command a majority in the senate. The prime minister will have to outline his government's programme and seek votes of confidence in both houses of parliament. The first is due to take place in the Senate on Thursday evening.\n\nPresident Giorgio Napolitano asked Monti to form a government after Berlusconi's rightwing coalition lost a crucial vote in the lower house on the 2010 public accounts.\n\nMeanwhile, Greece's new technocrat government won a confidence vote in parliament with a large majority , backing a pledge by prime minister Lucas Papademos to speed up long-term reforms and secure a massive new bailout deal involving banks and rescue creditors. In the country's 300-member parliament, 255 voted in favour of the new government formed last week by the majority socialists, rival conservatives and a small right-wing nationalist party. Only 38 voted against, while the remaining seven were absent."}, {"url": "https://www.theguardian.com/business/2011/nov/16/mario-monti-cabinet-members", "page_content": "The former European commissioner, Mario Monti, has unveiled Italy's new government. A distinguished liberal economist, he kept for himself the finance ministry. The list is stacked with academics, who will take more than a third of the seats in the new cabinet, and most will be unknown to members of the Italian general public. Here we profile some of Monti's technocrats.\n\nPassera\n\nEconomic development and infrastructure: Corrado Passera, 56, becomes industry overlord, charged with promoting growth in Italy's sclerotic economy. Though chief executive of Banca Intesa Sanpaolo, Passera has spent only 11 years in finance, the rest of his career having been devoted to management consultancy (McKinsey), publishing (Mondadori, L'Espresso group) and communications (Olivetti, Poste Italiane)\n\nTerzi di Sant'Agata\n\nForeign affairs: Giulio Terzi di Sant'Agata, 65. Italy's ambassador in Washington. Formerly permanent representative at the UN and head of the Italian delegation on the Security Council. Terzi was ambassador to Israel from 2002 to 2004, and previously held posts in Paris, Vancouver and at Nato HQ in Brussels.\n\nCancellieri\n\nInterior: Anna Maria Cancellieri, 67. The ministry's troubleshooter. A retired prefect (government representative at provincial level), Cancellieri made such a success of a mission in Bologna, where the local council had been hit by scandal, she was asked to run for mayor. She declined. Once said women were \"much better than men\".\n\nSeverino\n\nJustice: Paola Severino, 63. Italy's first woman justice minister is both a distinguished academic and courtroom lawyer. A tricky post for two reasons — Silvio Berlusconi's continuing legal entanglements and the need to reform the civil courts, where inefficiency is a big drag on the economy.\n\nRiccardi\n\nOverseas development: Andrea Riccardi, 61. An imaginative appointment. Riccardi founded the Sant'Egidio community, a Catholic group which began caring for the poor in Rome and became progressively more involved in international peacemaking. The community's greatest success was brokering a deal in Mozambique that led to the 1992 Rome accords.\n\nAdditional research by Sophie Inge"}, {"url": "https://www.theguardian.com/world/2011/nov/16/italy-unveils-government-technocrats", "page_content": "The former European commissioner, Mario Monti, has unveiled Italy's new government and told Italy's president, Giorgio Napolitano, he was ready to test its support in parliament.\n\nMonti, a distinguished liberal economist, kept for himself the finance ministry. He handed the industry and infrastructure portfolios to Corrado Passera, the CEO of Italy's biggest retail bank, Intesa Sanpaolo.\n\nThe dominant note in the list Monti read out was the weight of academics, who will occupy more than a third of the seats in cabinet. Three of the ministers in his bigger-than-expected cabinet were women, and two were appointed to top jobs: Anna Maria Cancellieri as interior minister and Paola Severino as justice minister.\n\nThe new prime minister, Monti, confirmed he would take on the unenviable task of governing the eurozone's most indebted nation after two days of intense consultations during which Italy's borrowing costs soared to unsustainable levels.\n\nThe uncertainties surrounding the formation of the new government were maintained to the end by a much longer than expected two-and-a-half hour meeting between the incoming prime minister and the president.\n\nThe names on the list of his ministers — most of them unknown to members of the Italian public — showed that Monti had failed in his attempt to involve party representatives in his government. His government was made up exclusively of non-aligned technocrats.\n\nBut the economics professor-turned-eurocrat managed to stave off — at least temporarily – demands from the outgoing prime minister, Silvio Berlusconi, and his party, for the government to have a limited programme and a fixed lifespan. The influence that Berlusconi's Freedom party will exercise over the new government was nevertheless made clear in the runup to Wednesday's announcement. Monti spent three hours at a meeting that finished after 2.30am local time, with Angelino Alfano, the secretary of Berlusconi's party, trying to reach agreement on the names of the new ministers. Berlusconi was ousted after losing his majority last week in the lower house of parliament, the chamber of deputies. But he and his former coalition allies in the Northern League can still command a majority in the senate.\n\nBefore the end of the week, the government is expected to outline its programme and seek confidence votes in both houses of parliament, without which it cannot continue. Napolitano, who oversaw the rapid transition, asked Monti to try to form a government on Sunday night."}, {"url": "https://www.nytimes.com/2011/11/17/world/europe/monti-forms-new-italian-government.html", "page_content": "ROME — As dubious European bond markets looked on, a former member of the European Commission and well-respected economist, Mario Monti, was sworn in as prime minister and finance minister on Wednesday, unveiling a cabinet of technocrats charged with repairing Italy’s ailing economy to help keep the debt crisis at bay.\n\nWhile the new government was widely hailed as a welcome sign that Italy would tackle much-needed economic restructuring, markets were not convinced, raising questions about whether it might have come too late to help.\n\nWith a consensus developing that Italy is doomed to a devastating default in the absence of extraordinary new measures from its partners in the euro zone, investors drove Italian borrowing rates above 7 percent on 10-year bonds, a rate that is regarded as unsustainable. At that level, economists say, Italy would have to run a budget surplus of 5 percent of gross domestic product just to avoid going deeper into debt.\n\nMore troublingly, yields on French bonds were also rising this week, indicating that the debt crisis is overwhelming the halting efforts of European leaders to contain it. While Mr. Monti was being sworn in, France and Germany continued to clash over whether the European Central Bank should intervene more forcefully to bring down interest rates, particularly in Italy."}, {"url": "https://prabook.com/web/mario.monti/724244", "page_content": "Mario Monti Edit Profile\n\neconomist politician academic\n\nMario Monti is an Italian economist who served as the Prime Minister of Italy from 2011 to 2013, leading a government of technocrats in the wake of the Italian debt crisis.\n\nBackground Ethnicity: His mother was from Piacenza. Although his father grew up in Varese, he was born in Luján in the Buenos Aires Province, Argentina, where his ancestors had emigrated to in the 19th century and built up a soft-drink and beer-production business. Monti's father went back to Argentina during World War II, but later returned to his family home in Varese.\n\n\n\nMonti was born in Varese on 19 March 1943.\n\n\n\nMonti is married to his wife Elsa and has two sons.\n\nCareer Mario Monti has been the 54th Prime Minister of Italy since November 2011.\n\n\n\nInitially, Monti was also Minister of Economy and Finance.\n\n\n\nMonti served as a European Commissioner from 1995 to 2004, with responsibility for the Internal Market, Services, Customs and Taxation from 1995 to 1999 and for Competition from 1999 to 2004.\n\n\n\nMonti has also been Rector and President of Bocconi University in Milan.\n\n\n\nMonti was sworn in as Prime Minister on 16 November 2011, just a week after having been appointed a Senator for Life.\n\nInterests histiry of Ancient Egypt\n\nSport & Clubs cycling"}, {"url": "https://euobserver.com/green-economy/114299", "page_content": "Incoming Italian Prime Minister Mario Monti has named a government entirely composed of unelected figures, just days after a technocratic government was installed in Greece, where the presence of far-right figures linked to the military junta are raising hackles.\n\nMonti, an ex-EU-commissioner, was appointed officially on Wednesday by the president of the republic.\n\nStudent or retired? Then this plan is for you.\n\nThe new leader has in turn also appointed himself finance minister and, in a move likely to amplify criticisms that a regime of bankers has been imposed on Europe’s southern flank, Corrado Passero, the CEO of Intesa Sanpaolo, the country’s largest high-street bank, has been awarded the industry and infrastructure dossier.\n\nAll ministerial posts will be held by technocrats, soldiers and diplomats.\n\nThe country’s ambassador Washington, Giulio Terzi di Sant’Agata, has been made foreign minister while an admiral in the navy, Giampaolo Di Paola is now defence minister, eliminating civilian command of the armed forces.\n\nHe said that the absence of democratically endorsed characters will allow austerity measures to proceed without obstruction.\n\n\"The absence of political personalities in the government will help rather than hinder a solid base of support for the government in the parliament and political parties because it will remove one ground for disagreement,\" he told reporters in the Italian capital.\n\nHe added that he had received “many signals of encouragement from our European partners and the international world,” for the new administration.\n\nThe process of forming a government has taken a radically unorthodox and rushed route after Silvio Berlusconi - under pressure from markets and other EU leaders, resigned as the country’s economic position grew ever more precarious and threatened to pull the entire eurozone down.\n\nOn Sunday (13 November), President Giorgio Napolitano appointed Monti, a committed free-marketeer, advisor to Goldman Sachs and two-time European commissioner, senator-for-life - normally a post reserved individuals having achieved “outstanding patriotic merits in the social, scientific, artistic or literary field\" rather than simply being seen as a safe pair of hands.\n\nThe establishment of a new government by the president of the republic itself has raised eyebrows as the head of state is traditionally only a ceremonial post that has now been heavily politicised.\n\nThe lightning speed of the displacement of the Berlusconi administration with a regime of technocrats will be matched by how rapidly Monti moves to push through austerity measures demanded by EU power brokers.\n\nThe package of measures will first be proposed in the Senate on Thursday, followed by a vote of confidence vote in both the upper and lower houses. The approval of the Chamber of Deputies will then be sought on Friday.\n\nThe Monti government rather than working as a temporary administration as many MPs originally believed, now intends to hold on to power until the next scheduled general election in 2013.\n\nWhile Berlusconi’s party, the People of Freedom are set to endorse the new government, many in the group are privately seething at the ouster of their chief and may yet cause mischief.\n\nThe hard-right Northern League, the outgoing administration’s main ally, has also said it prefers to sit in opposition than join the new government, with some characters calling the toppling of Berlusconi a “coup d’etat”.\n\nSign up for EUobserver’s daily newsletter All the stories we publish, sent at 7.30 AM. By signing up, you agree to our Terms of Use and Privacy Policy.\n\nAlready on Saturday following the resignation of Berlusconi, Northern League lawmaker Massimo Polledri declared: “We salute the Franco-German directorate before it officially takes control of the country,\" Polledri said, adding: \"Maybe they'll let us speak Italian for a bit longer but the decisions are going to be taken elsewhere.\"\n\nFar-right MPs with links to the Greek Junta appointed ministers\n\nThe imposition of the technocrats in Rome comes just days after former vice-president of the European Central Bank, Lucas Papademos, was placed in the top office in Greece, where he too has appointed an administration of technocrats, complimented by members of the far right - the first time Athens has seen such figures in government since the fall of the military junta in 1974.\n\nFour individuals from the Popular Orthodox Rally, a religious and and anti-immigrant grouping whose leadership is normally more commonly seen in the company of France’s National Front or the UK’s British National Party, have been named ministers.\n\nTwo in particular who have links to the military junta are raising hackles amongst critics of the new government.\n\nGeorgios Georgiou, a Laos member that has been appointed alternate defence minister, was the representative of the junta to Nato’s Naples command in 1973.\n\nMeanwhile Makis Voridis, who has been named infrastructure and transport minister, was appointed the head of the youth wing of now-defunct neo-nazi grouping Epen, by the ex-dictator of Greece, Georgios Papadopoulos, while he was in prison in 1984.\n\nDeputy development, competitiveness and shipping minister Adonis Georgiadis, has endorsed a Greek book called \"Jews: The Whole Truth\" on his television show broadcast the TV channel owned by Laos.\n\nThe presence of the far-right in the government has fightened Jewish groups across the Atlantic. \"We urge the new Greek leadership, understandably preoccupied with the economic crisis, not to permit any such expression of outright bigotry or anti-Semitism to emerge from its ranks,\" the American Jewish Committee said in a statement.\n\nIn both Greece and Italy, polls suggest that a majority of the public are willing to give the new administrations the benefit of the doubt. However, according to the same surveys, this backing is conditional on the governments ending austerity - a path neither leader is likely to take.\n\nThe first test of the Athens administration comes on Thursday, the 39th anniversary of the student uprising in 1973 that ultimately led to the toppling of the military regime.\n\nThousands are expected to protest Papademos government in Athens on the same day. The scale of the demonstrations will offer the new leader a good measure of how long his honeymoon will last."}, {"url": "https://www.geni.com/people/Mario-Monti/6000000140238542880", "page_content": "About Mario Monti\n\nhttps://en.wikipedia.org/wiki/Mario_Monti\n\nMario Monti, OMRI (born 19 March 1943) is an Italian economist who served as the Prime Minister of Italy from 2011 to 2013, despite never having been an elected politician, leading a government of technocrats in the wake of the Italian debt crisis.\n\nMonti served as a European Commissioner from 1995 to 2004, with responsibility for the Internal Market, Services, Customs and Taxation from 1995 to 1999 and for Competition from 1999 to 2004. Monti has also been Rector and President of Bocconi University in Milan for many years. On 12 November 2011, in the midst of the European sovereign debt crisis, Monti was invited by President Giorgio Napolitano to form a new technocratic government following the resignation of Silvio Berlusconi. Monti was sworn in as Prime Minister on 16 November 2011, just a week after having been appointed a Senator for Life by President Napolitano, and initially became Minister of Economy and Finances as well, giving that portfolio up the following July. From 16 May 2013 to 17 October 2013 Monti was the President of Civic Choice, a centrist[1] political party."}]}