{"From November 2011 until April 2013, Mario Monti was the President of Civic Choice, a centrist political party.": [{"url": "https://www.britannica.com/biography/Mario-Monti", "page_content": "Mario Monti, (born March 19, 1943, Varese, Italy), Italian economist, academic, and bureaucrat who served as prime minister of Italy (2011–13).\n\nMonti, the son of a banker, studied economics and management at Bocconi University in Milan and received a degree in 1965. He then pursued graduate studies at Yale University under the tutelage of American economist James Tobin. Monti taught briefly at the University of Trento (1969–70) and began a post at the University of Turin (1970–79) before returning to Bocconi University in 1971 as a professor of monetary theory and policy. He later directed (1985–94) the school’s Institute of Economics. In 1989 he became rector of the university, and five years later he was named its president.\n\nAs a consultant to one of Italy’s largest banks in the 1970s, Monti gained attention for publishing his own estimates of the country’s money supply at a time when official figures were not publicly available. Beginning the following decade, he served on several committees of the Italian treasury and was president of SUERF (Société Universitaire Européenne de Recherches Financières; now the European Money and Finance Forum) in 1982–85. Also during this time Monti wrote commentaries on economics for the Milan newspaper Corriere della Sera (1978–94) and sat on a number of corporate boards.\n\nIn 1995 Monti, having been nominated by Italian Prime Minister Silvio Berlusconi, took a seat on the European Commission (EC), for which he oversaw issues relating to the internal market, financial services, and taxation. Receiving a second term in 1999, he became the European commissioner for competition, and in that capacity, he took a tough-minded approach to proposed corporate mergers and antitrust cases that won him wide respect. After his EC tenure concluded in 2004, he helped found Bruegel, a Brussels-based think tank with a focus on economic globalization.\n\nIn November 2011, in the wake of a public debt crisis in Italy that weakened Berlusconi’s grip on power, the politically independent Monti became a leading candidate to assume the country’s premiership in a national unity government. (It was hoped that Monti’s experience as a technocrat would prove beneficial in the implementation of urgent economic reforms.) On November 9 he was made a lifetime member of the Italian Senate, and four days later, upon Berlusconi’s resignation, Pres. Giorgio Napolitano asked Monti to form a government.\n\nInitially serving as both prime minister and finance minister (he held the latter post until July 2012), Monti swiftly persuaded parliament to approve an austerity package that relied heavily on tax increases. In early 2012 a set of measures he introduced in an effort to liberalize the service sector was also passed. Although Italy continued to face economic uncertainty, Monti’s decisive leadership was widely judged to have helped the country forestall disaster. As the year continued, he also emerged as a key player in international negotiations aimed at financially stabilizing the entire euro zone.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nIn December, however, Monti’s government lost the support of Berlusconi’s People of Freedom (Popolo della Libertà) party during two otherwise successful parliamentary confidence votes. He resigned from office shortly thereafter, remaining in a caretaker role until a new government could be formed. In early elections held in February 2013, Monti led an alliance of centrist political factions, but they failed to win enough parliamentary seats to play a significant role in the ensuing efforts to build a government coalition. After two months of political deadlock, Monti was finally succeeded by Enrico Letta, a Democratic Party (Partito Democratico) leader appointed by Napolitano."}, {"url": "https://www.unibocconi.eu/wps/wcm/connect/Bocconi/SitoPubblico_EN/Navigation+Tree/Home/About+Us/Organization/International+Advisory+Council/Monti+IAC_Greenslade+2010+06+07+03+13", "page_content": "\n\n\n\nMario Monti\n\nBocconi Representative on the International Advisory Council\n\nPresident of Università Bocconi\n\nMario Monti is President of Bocconi University.\n\nHe was Prime Minister of Italy (November 2011-April 2013) and Minister of Economy and Finance (November 2011-July 2012).\n\nIn November 2011 he was appointed Senator for life by the President of the Italian Republic, Giorgio Napolitano.\n\nHe is Member of the Académie des Sciences morales et politiques, Chairman of the first Advisory Group to Transparency International EU, and Honorary President of Bruegel, the European think-tank he founded in 2005.\n\nHe served for ten years as a member of the European Commission, in charge of the Internal Market, Financial Services and Tax Policy (1995-1999), then of Competition (1999-2004).\n\nHe is the author of the report to the President of the European Commission on A New Strategy for the Single Market (May 2010).\n\nHis publications focus mainly on monetary and financial economics, public finance, competition policy, and the economic and political dimensions of European integration.\n\nBorn in Varese, Italy, in 1943, he graduated from Bocconi University and pursued graduate studies at Yale University. Prior to joining the European Commission, he had been Professor of Economics and Rector at Bocconi."}, {"url": "https://infogalactic.com/info/Mario_Monti", "page_content": "From Infogalactic: the planetary knowledge core\n\nMario Monti, (born 19 March 1943) is an Italian economist who served as the Prime Minister of Italy from 2011 to 2013, leading a government of technocrats in the wake of the Italian debt crisis.\n\nMonti served as a European Commissioner from 1995 to 2004, with responsibility for the Internal Market, Services, Customs and Taxation from 1995 to 1999 and for Competition from 1999 to 2004. Monti has also been Rector and President of Bocconi University in Milan for many years. On 12 November 2011, in the midst of the European sovereign debt crisis, Monti was invited by President Giorgio Napolitano to form a new technocratic government following the resignation of Silvio Berlusconi. Monti was sworn in as Prime Minister on 16 November 2011, just a week after having been appointed a Senator for Life by President Napolitano, and initially became Minister of Economy and Finances as well, giving that portfolio up the following July. From 16 May 2013 to 17 October 2013 Monti was the President of Civic Choice, a centrist[1] political party.\n\nEarly life\n\nMonti was born in Varese on 19 March 1943.[2] His mother was from Piacenza. Although his father grew up in Varese, he was born in Luján in the Buenos Aires Province, Argentina, where his ancestors had emigrated to from Italy in the 19th century and built up a soft-drink and beer-production business.[3][4] Monti's father went back to Argentina during World War II, but later returned to his family home in Varese.[5]\n\nMonti studied at the private Leo XIII High School and attended Bocconi University of Milan, where he obtained a degree in economics in 1965. Later, he won a scholarship to Yale University where he studied under James Tobin, a recipient of the Nobel Prize in Economics.[6][7]\n\nAcademic career\n\nMonti began his academic career at the University of Trento, before moving to teach economics at the University of Turin from 1970 to 1985, and finally to Bocconi University, where he was appointed Rector in 1989, and President in 1994. He also served as President of the SUERF (The European Money and Finance Forum) from 1982 to 1985.[8] His research helped to create the \"Klein-Monti model\", aimed at describing the behaviour of banks operating under monopoly circumstances.[9]\n\nEuropean Commissioner\n\nSanter Commission\n\nIn 1994, Monti was appointed to the Santer Commission, along with Emma Bonino, by Prime Minister Silvio Berlusconi. In his office as a European Commissioner from 1994 to 1999, he was responsible for internal market, financial services and financial integration, customs, and taxation.[10] His work with the Commission earned him the nickname \"Super Mario\" from his colleagues and from the press.[11]\n\nProdi Commission\n\nMario Monti served as a European Commissioner from 1995 to 2004.\n\nIn 1999, Prime Minister Massimo D'Alema confirmed Monti's appointment to the new Prodi Commission and he was given one of the most powerful positions at the Commission, with responsibility for Competition.[12]\n\nAs Competition Commissioner, Monti led the investigation into a number of high-profile and controversial mergers, including: Scania AB & Volvo (1999),[13] WorldCom & Sprint (2000),[14] General Electric & Honeywell (2001), Schneider Electric & Legrand (2001)[15] and Carnival Corporation & P&O Ferries (2002).[16] His term in office also saw the European Court of Justice, for the first time, overrule the Commission's decision to block a merger in three separate cases, although two were decided by his predecessor.[17] Monti was also responsible for levying the EU's largest ever fine at the time (€497 million) against Microsoft for abusing its dominant market position in 2004.[18]\n\nMonti was criticised in the media and by competition lawyers for the perceived inflexibility of the merger oversight process and the high number of cases that were being blocked.[13][19][20] On 1 November 2002, Monti responding to the European Court of Justice's ruling which reversed his decision to block the merger between Airtours & First Choice Holidays said, \"Last week was a tough week for the Commission's merger control policy and of course for me.\"[17][20] This ruling in combination with his decision to block the General Electric & Honeywell merger led to criticism in the United States against both the Commission's procedures and accusations that Monti's decisions were politically motivated.[21] Monti, however, was defended by supporters who saw his actions as an important step in the development of competition law in the EU. Dan Rubinfeld, economics professor at the University of California who worked on the US Justice Department's antitrust case against Microsoft, said of Monti, \"There has been a lot of talk of politics in this and other cases, but I believe he has been driven entirely by the desire to do the right thing.\"[17]\n\nOn 11 December 2002, Monti proposed a series of reforms to the EU's merger rules and made structural changes within the Commission's Competition department which aimed to improve transparency for companies throughout the merger review process.[22] The reforms were adopted by the EU as Regulation 139/2004 (known as ECMR).\n\nIn 2004, Prime Minister Silvio Berlusconi returned to power in Italy and chose not to re-appoint Monti to the Commission when his second term ended.[23]\n\nBarroso Commission\n\nIn 2010, Monti was asked by Commission President Manuel Barroso to draft a \"Report on the Future of the Single Market\" proposing further measures towards the completion of the EU's Single Market.[24][25] The published report, adopted by the EU on 13 April 2011, proposed 12 reforms to the Single Market and was intended to \"give new momentum\" to the European economy.[26]\n\nPrime Minister of Italy\n\nAppointment\n\nNapolitano. Monti's Cabinet swearing-in ceremony at the presence of President\n\nOn 9 November 2011, Monti was appointed a lifetime senator by Italian President Giorgio Napolitano.[27] He was seen as a favourite to replace Silvio Berlusconi to lead a new unity government in Italy in order to implement reforms and austerity measures.[28] On 12 November 2011, following Berlusconi's resignation, Napolitano invited Monti to form a new government.[29] Monti accepted the offer, and held talks with the leaders of the main Italian political parties, declaring that he wanted to form a government that would remain in office until the next scheduled general elections in 2013.[30] On 16 November 2011, Monti was sworn in as Prime Minister of Italy, after unveiling a technocratic cabinet composed entirely of unelected professionals.[31] He also chose to hold the post of Minister of Economy and Finances.[32][33] On 17 and 18 November 2011, the Italian Senate and Italian Chamber of Deputies both passed motions of confidence supporting Monti's government, with only Lega Nord voting against.[34][35]\n\nAusterity measures\n\nOn 4 December 2011, Monti's government introduced emergency austerity measures intended to stem the worsening economic conditions in Italy and restore market confidence, especially after rising Italian government bond yields began to threaten Italy's financial stability.[36] The austerity package called for increased taxes, pension reform and measures to fight tax evasion. Monti also announced that he would be giving up his own salary as part of the reforms.[37] On 16 December 2011, the Lower House of the Italian Parliament adopted the measures by a vote of 495 to 88.[38] Six days later the Upper House gave final approval to the package by a vote of 257 to 41.[39]\n\nLabour market reforms\n\nOn 20 January 2012, Monti's government formally adopted a package of reforms targeting Italy's labour market. The reforms are intended to open certain professions (such as taxi drivers, pharmacists, doctors, lawyers and notaries) to more competition by reforming their licensing systems and abolishing minimum tariffs for their services.[40][41] Article 18 of Italy's labour code, which requires companies that employ 15 or more workers to re-hire (rather than compensate) any employee found to have been fired without just cause,[42][43] would also be reformed. The reforms to Article 18 are intended to make it easier for companies to dismiss or lay-off employees, which would hopefully encourage companies to hire more employees on permanent rather than short-term renewable contracts.[43] The proposals have been met by strong opposition from labour unions and public protests.[44] In early January 2012, consultations between the government and labour unions commenced[45] and on 13 February it was reported in the Italian media that a compromise on the proposals was very close and the government was hopeful that reforms could be approved by the Italian parliament in March.[46][needs update]\n\n2013 election\n\nOn 21 December 2012, Monti announced his resignation as Prime Minister, having made a public promise to step down after the passing of the 2012 Budget. He initially stated that he would only remain in office until an early election could be held.[47] However, on 28 December, he announced that he would seek to remain Prime Minister by contesting the election, as the leader of a centrist coalition, the Civic Choice.\n\nThe election was held on 24 February 2013, and Monti's centrist coalition was only able to come fourth, with 10.5% of the vote. Monti remained Prime Minister until a coalition was formed on 28 April led by Enrico Letta.[48]\n\nPolitical career\n\nSenator for life\n\nOn 9 November 2011, Monti was appointed a lifetime senator by Italian President Giorgio Napolitano, in accordance with the second paragraph of \"Article 59 of the Constitution, which merits national honor distinguished in science and social\". He was a member of the Commission for Industry, Commerce and Tourism from 30 November 2011 to 14 March 2013 in the sixteenth legislature. Monti was member of the independents' mixed parliamentary group until 19 March 2013, when he joined the Civic Choice (SC) parliamentary group, becoming the first lifetime senator aligned to a party group. On 7 May 2013, he became a member of the Commission for Foreign Affairs and Emigration.\n\nPresident of Civic Choice\n\nOn 4 January 2013, Monti launched Civic Choice as an electoral list of the civil society, to realize the implementation of his agenda in a future government. SC was announced as part of the With Monti for Italy (CMI) centrist coalition, alongside Union of the Centre (UdC) and Future and Freedom (FLI). In the 2013 general election the party obtained 8.3% of the vote, 37 deputies (on own lists) and 15 senators (within CMI). On 12 March 2013, Civic Choice was turned into a political party as Monti took office as acting SC president in the Provisional Committee of the party and appointed senator Andrea Olivero as provisional political coordinator. On 16 May 2013, Mario Monti was unanimously elected president of the Civic Choice. On 17 October 2013 he resigned.[49]\n\nThink tanks\n\nMonti actively participates in several major think tanks. He is a member of the Praesidium of Friends of Europe. He was the founding chairman of Bruegel, another European think tank, which was formed in 2005. He was the European Chairman of the Trilateral Commission until being sworn in as prime minister in 2011.[50]\n\nMonti is a leading member of the exclusive Bilderberg Group.[51] He has also been an international advisor to Goldman Sachs[52] and The Coca-Cola Company.[53] He has also been a member of the \"Senior European Advisory Council\" of Moody's[54] and he is one of the members of the \"Business and Economics Advisors Group\" of the Atlantic Council.[55]\n\nIn 2007, Mario Monti was one of the first supporters of the first European civic forum, États Généraux de l'Europe, initiated by European think tank EuropaNova and European Movement. He was also a member of the French government's Attali Commission from 2007 to 2008,[6][56] appointed by Nicolas Sarkozy to provide recommendations to enhance economic growth in France.\n\nMonti is a founding member of the Spinelli Group,[57] an organization launched in September 2010 to facilitate integration within the European Union (other members of the steering group include Jacques Delors, Daniel Cohn-Bendit, Guy Verhofstadt, Andrew Duff and Elmar Brok).\n\nSince January 2014, Monti has been Chairman of the High Level Group on Own Resources, a consultative committee of the European Union that will propose new forms of revenue for the European Union's budget.\n\nPersonal life\n\nSince 1970 Monti has been married to Elsa Antonioli (born 1944),[58] an Italian Red Cross volunteer, by whom he has two children, Federica and Giovanni.[59]\n\nKnown for his reserved character, Monti acknowledges not being especially sociable.[60] He said that his youth was given over to hard study; spare-time activities included cycling and keeping up with world affairs by tuning into foreign short-wave radio stations.[60]\n\nAwards and decorations\n\nSee also"}, {"url": "https://timesofmalta.com/articles/view/Monti-calls-his-economic-reforms-a-little-miracle-.509971", "page_content": "Mario Monti: “The success of non-mainstream and Eurosceptic parties in May’s European Parliament elections will serve as a powerful wake-up call for the more traditional parties not to play games with European integration.” Photo: Jason Borg\n\nFormer Italian prime minister Mario Monti says his government’s successful introduction of some economic reforms were “a little miracle” considering whom he had to rely on for parliamentary support.\n\nProf. Monti, prime minister of Italy in a government of technocrats from November 2011 to April 2013 formed to tackle Italy’s debt crisis, was speaking to Times of Malta on the fringes of last week’s The Economist Events’ Business Roundtable organised with the government of Malta at the Hilton Hotel.\n\nAsked about how difficult it was having to depend on (former Italian prime minister) Silvio Berlusconi for his parliamentary majority when he was in office, Prof. Monti replied: “Well, it was a subtle relationship, very cordial and very tough at the same time and I consider it really a little miracle that we were able to bring about some of the reforms that Italian politics was never able to deliver, like the major pension reforms, considering that we relied on the support of three parties that, up to the previous day, could hardly speak to each other.”\n\nProf. Monti described his time in office “like walking on a rope with a very deep empty space beneath, which was the financial crisis, but we managed to overcome it, so everybody must be thanked”.\n\nHe says he is confident the new Italian government, led by Matteo Renzi, will be able to turn Italy’s economy around and bring in the necessary reforms, both economic and political.\n\n“Over the last two years, Mr Renzi has been urging structural reforms and stressing the urgency of these reforms, in particular for the labour market, and to improve the competitiveness of the Italian economy. Now that he is in power, I expect and am confident that he will display this same sense of urgency.”\n\nHe notes that Mr Renzi has even spoken of one reform a month. “That may be too ambitious” but he expects him and his government to begin to deliver important structural reforms very quickly.\n\nProf. Monti describes Enrico Letta’s ouster as prime minister by Mr Renzi after only 10 months in office as “a bit strange” but adds that this was brought about by the change in leadership of the centre-left Democratic Party.\n\n“Mr Renzi decided he wanted to impose a greater rhythm of change and decided to step in. Expectations about Mr Renzi are now quite high,” he notes.\n\nIn the first 10 months of last year, Prof. Monti led Civic Choice, a centrist political party he formed, which was part of the Letta government and is now part of the Renzi government. He explains that he resigned the party leadership because he never thought he should remain “in active politics forever” and wanted to hand over to younger politicians.\n\nHe again takes a swipe at Mr Berlusconi: “I accepted the challenge of contesting the election in February 2013 with a new party oriented towards Europe, towards reforms. That party got enough votes to prevent the comeback of the centre-right, which, in the meantime, had become populist and rather anti-European.”\n\nMy time in office was like walking on a rope with a very deep empty space beneath\n\nHe praises his Maltese counterpart when he was prime minister, Lawrence Gonzi, saying he “was a very active contributor to the European Council discussions”.\n\nProf. Monti says he was very positively impressed by the way Dr Gonzi chaired the 5+5 meeting in Malta in 2012, adding: “My French and Spanish colleagues were tempted to excuse themselves from the meeting because of their heavy agenda but I personally insisted on them participating and it was a very productive meeting under the chair of Prime Minister Gonzi.”\n\nHe believes the worst aspects of the eurozone’s problems are firmly behind us and that what is most encouraging is that Europe has been able to learn its lessons and improve the way the eurozone is governed.\n\nAsked why Italy traditionally doesn’t play more of a leadership role in Europe, Prof. Monti replies: “My experience during my time in government was that, as soon as our partners saw that we were tackling the financial crisis head on and removed Italy from the list of the possible destroyers of the eurozone, we were immediately listened to with great respect and it was possible in a space of six months to make a shift from being the main risk in the eurozone to one of the main contributors of ideas at the European Council.”\n\nHe says it was his government that engineered the accord “after difficult negotiations” in June 2012 whereby the eurozone agreed to stabilise the government bond markets.\n\n“That was the political basis which allowed the president of the European Central Bank, Mario Draghi, a few weeks later, to state that the ECB will do whatever it takes to stabilise the eurozone”.\n\nHe believes France needs to go a bit further in terms of structural reforms and budgetary discipline and this will increase its authority within the EU. “I think Germany likes to have other solid countries around it with which to work,” he adds.\n\nProf. Monti believes the EU has to work hard to build three bridges, namely between the EU and its citizens, between the north and the south, “particularly in the eurozone because we’ve seen so many misgivings, misunderstandings and mutual suspicions” and between the eurozone and non-eurozone “and, in particular, between the EU and the UK”.\n\nA former European Commissioner, he believes that the “non-mainstream” and Eurosceptic parties will be relatively successful in May’s European Parliament elections.\n\nThis, he says, will serve as a “powerful wake-up call” for the more traditional parties not to play games with European integration.\n\n“In particular, to stop the game they sometimes play of blaming Brussels simply because, in Brussels, together they take decisions they know are needed but then go back home and begin castigating those decisions,” he says."}, {"url": "https://www.theguardian.com/world/2011/nov/16/italy-unveils-government-technocrats", "page_content": "The former European commissioner, Mario Monti, has unveiled Italy's new government and told Italy's president, Giorgio Napolitano, he was ready to test its support in parliament.\n\nMonti, a distinguished liberal economist, kept for himself the finance ministry. He handed the industry and infrastructure portfolios to Corrado Passera, the CEO of Italy's biggest retail bank, Intesa Sanpaolo.\n\nThe dominant note in the list Monti read out was the weight of academics, who will occupy more than a third of the seats in cabinet. Three of the ministers in his bigger-than-expected cabinet were women, and two were appointed to top jobs: Anna Maria Cancellieri as interior minister and Paola Severino as justice minister.\n\nThe new prime minister, Monti, confirmed he would take on the unenviable task of governing the eurozone's most indebted nation after two days of intense consultations during which Italy's borrowing costs soared to unsustainable levels.\n\nThe uncertainties surrounding the formation of the new government were maintained to the end by a much longer than expected two-and-a-half hour meeting between the incoming prime minister and the president.\n\nThe names on the list of his ministers — most of them unknown to members of the Italian public — showed that Monti had failed in his attempt to involve party representatives in his government. His government was made up exclusively of non-aligned technocrats.\n\nBut the economics professor-turned-eurocrat managed to stave off — at least temporarily – demands from the outgoing prime minister, Silvio Berlusconi, and his party, for the government to have a limited programme and a fixed lifespan. The influence that Berlusconi's Freedom party will exercise over the new government was nevertheless made clear in the runup to Wednesday's announcement. Monti spent three hours at a meeting that finished after 2.30am local time, with Angelino Alfano, the secretary of Berlusconi's party, trying to reach agreement on the names of the new ministers. Berlusconi was ousted after losing his majority last week in the lower house of parliament, the chamber of deputies. But he and his former coalition allies in the Northern League can still command a majority in the senate.\n\nBefore the end of the week, the government is expected to outline its programme and seek confidence votes in both houses of parliament, without which it cannot continue. Napolitano, who oversaw the rapid transition, asked Monti to try to form a government on Sunday night."}, {"url": "https://www.wikiwand.com/en/Mario_Monti", "page_content": "Mario Monti (born 19 March 1943) is an Italian economist and academic who served as the Prime Minister of Italy from 2011 to 2013, leading a technocratic government in the wake of the Italian debt crisis.\n\nItalian economist and politician (born 1943)\n\nQuick facts: Senator for lifeMario MontiOMRI, Prime Minist... ▼\n\nMonti served as a European Commissioner from 1995 to 2004, with responsibility for the Internal Market, Services, Customs and Taxation from 1995 to 1999 and for Competition from 1999 to 2004. Monti has also been rector and president of Bocconi University in Milan for many years.\n\nOn 12 November 2011, in the midst of the European sovereign debt crisis, Monti was invited by President Giorgio Napolitano to form a new technocratic government following the resignation of Silvio Berlusconi. Monti was sworn in as Prime Minister on 16 November 2011, just a week after having been appointed a Lifetime Senator by President Napolitano, and initially became Minister of Economy and Finances as well, giving that portfolio up the following July.\n\nFrom 16 May 2013 to 17 October 2013, Monti was the president of Civic Choice, a centrist[1] political party in Italy."}, {"url": "https://www.wikiwand.com/en/Civic_Choice", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about Civic Choice?\n\nSummarize this article for a 10 years old"}, {"url": "https://www.nature.com/articles/494293a", "page_content": "Italian prime minister Mario Monti (left) with virologist Ilaria Capua, newly minted political candidate. Credit: Contrasto/eyevine\n\nVirologist Ilaria Capua spent the Christmas holiday planning her exit strategy from Italy, where she is currently director of research at the IZSVe (the Experimental Institute for the Prevention of Animal Diseases), a public veterinary institute in Legnaro, in north-east Italy. Internationally renowned for her work on the H5N1 avian flu virus — and more patient than most with Italy’s notoriously obstructive bureaucracy — she finally snapped last November after administrators at her institute blocked her from accepting an offer of generous lab space in a new research centre in a hospital in Padua.\n\nThen, out of the blue on 6 January, she got a call from Mario Monti, Italy’s outgoing prime minister, who was appointed on 12 November 2011 to head a caretaker government that has attempted to tackle Italy’s economic problems and debt. He offered her a safe seat in the parliament if she agreed to stand for his newly created party Civic Choice in the national elections, which take place this weekend. Capua, until now dedicated single-mindedly to her research, agreed. “I hope I can help promote the meritocracy that we desperately need in Italy,” she says.\n\nAll the major parties, including ex-prime minister Silvio Berlusconi’s People of Freedom party and the populist Five Star Movement party, have acknowledged the importance of science. But Monti has gone further: nearly a third of the candidates he has chosen are scientists or academics rather than career politicians — a reflection of his belief that only technical expertise can save Italy from decline. Although the next government is likely to be led by Pier Luigi Bersani’s centre-left Democratic Party, a coalition called ‘With Monti for Italy’ (Con Monti per l’Italia), including Civic Choice and two other centre and centre-right parties, may become a junior partner.\n\nThe country’s researchers are counting on the next government to reverse the trend of annual budget cuts for universities and research institutes. They also hope it will allow a series of radical reforms to Italian universities and research institutes, introduced over the past three years, to go forward without interruption.\n\nThe sweeping reforms were designed to clean up bad habits such as nepotism and to cut the bureaucracy that hampers everything from academic appointments to buying lab equipment. The research institutes of all 12 national research agencies have been reorganized and the practice of government appointment of their presidents abandoned, so that candidates are appointed on the basis of merit rather than by political fiat.\n\nNew rules for academic appointments require universities to select their professors from a national list of qualified candidates (non-Italian candidates will not need to qualify for the list). PhD courses will have to be approved by a national committee and the organizers must prove that they have sufficient teaching staff. All public research money will now be distributed only after a peer-review panel, which must include some foreign researchers, has vetted the applications.\n\nCentral to the reforms has been the creation of a national evaluation agency, ANVUR, which launched a massive exercise to evaluate universities and research agencies in May 2011. The outcome should determine how at least 13% of government funding to universities is distributed, and some researchers, especially in the humanities, have criticized the metrics used.\n\nBut the noisy resistance to ANVUR has raised concerns that politicians will be tempted to tinker with the reforms or stall them. “The worse thing for us would be that the reforms would be stopped or new ideas forced upon us,” warns chemist Dario Braga, dean of research at the University of Bologna. “We are in transition and need to be left in peace.”"}, {"url": "https://www.robert-schuman.eu/en/eem/1407-parliamentary-elections-in-italy-an-election-with-several-unknown-elements", "page_content": "Italy - Parliamentary\n\nParliamentary Elections in Italy: an election with several unknown elements\n\n16th November 2011-22nd December 2012 – 13 months of Monti's government\n\nMario Monti, the unknown\n\nCan Silvio Berlusconi make a come-back?\n\nAnd the left in all of that?\n\nThe Other Parties\n\nThe Italian Political System\n\nOn 22nd December last the Italian parliament was dissolved after the adoption of the 2013 budget. As he had announced thirteen days prior to this, the President of the Council, Mario Monti, then resigned from his post, leading to the organisation of parliamentary elections – which come a few weeks early - (initially they were due to take place in spring 2013), on 24th and 25th February he first time the Italians will be voting in winter. According to the Constitution a 45-70 day period is obligatory between the dissolution of the chambers of parliament and the election.On 9th December last Mario Monti announced his resignation after MPs in the People's Party for Freedom (PdL) decided to boycott the confidence vote of his government and to abstain from the Chamber of Deputies during the vote of the 2013 budget that absolutely had to take place before the end of 2012 (around 20 decisions were still under discussion). \"\" declared Mario Monti to the daily \"\" in explanation of his departure.The leftwing opposition forces are forecast to win by all of the polls. However the decision taken by the outgoing President of the Council and his predecessor Silvio Berlusconi (PdL), to take part in the election comprises threats to the Democratic Party (PD), the main opposition party, led by Pierluigi Bersani. The left has to win the majority in each of the Chambers of Parliament if they are to govern. The election is therefore extremely open and the electoral campaign, which will be followed closely by all of Europe, is of the highest importance. As the Greeks and the Dutch just a few months ago the Italians are being called to choose between belonging to the euro zone and nothing less than the overthrow of the European system.According to the most recent poll by sWG-spa for the TV channel RAI3, published on 25th January, the leftwing coalition is due to win the parliamentary elections with 34.1% of the vote. It is due to come out ahead of the coalition led by Silvio Berlusconi, who is due to win 26.6% of the vote; the Five Stars Movement (M5s) led by populist Beppe Grillo is due to win 17.2% of the vote and the lists supported by Mario Monti are due to win 12.8% of the vote. The leftwing coalition Civil Revolution, comprising Italy of Values (IdV) led by Antonio di Pietro, the Left Federation and the Greens are due to win 5.4% of the vote.\" maintains Roberto d'Alimonte, professor of Political Science at the University Lluis of Rome. However, the situation is not so certain in the Senate where the majority is granted in each of the regions to the coalition that wins the election in the Upper Chamber. Four regions are extremely contested (the leftwing is forecast to win in the others): Lombardy, which has 49 senator seats, Venetia, Sicily, and Campania.Many analysts believe that the parliamentary elections on 24th and 25th February will lead to a leftwing alliance led by Pierluigi Bersani and the Mario Monti lists. \"\" highlights Roberto d'Alimonte. According to the Italian press the outgoing President of the Council and the leader of the leftwing met just a few days ago. The dailyeven said that the two men had agreed on an electoral strategy to block Silvio Berlusconi's route.\" maintained the outgoing President of the Council in September last.On 8th November 2011 Silvio Berlusconi was forced to resign from the Presidency of the Council after the defection of three of his MPs led to the loss of his parliamentary majority. Eight days later Mario Monti succeeded him with a task in hand: the rescue of the Italian economy. On 4th December 2011 he pushed through an austerity plan called, totalling 63 billion € over 3 years. Its aim: the return of balance in public finances in 2013, its means: the reduction of public spending and the implementation of several structural reforms. On 20th January 2012 a new plan,, aimed to restore growth and strengthen the country's competitiveness via the simplification of administrative procedures and by the liberalisation of several regulated professions.At the end of July 2012 a second structural reform was adopted pertaining to the labour market. It does away with a great number of unstable contracts (temporary contracts are notably limited to 36 months) and aims to facilitate dismissal procedures thanks to the modification of article 18 of the labour law which granted protection against dismissal to employees in companies with a staff of over 15, forcing them to re-employ any employee whose dismissal was deemed illegitimate. From now on only an employee who falls victim to a discriminatory dismissal has to be re-employed.During his time in office Mario Monti has also launched the reform of the retirement regime by extending the number of years worked to achieve the legal retirement age (raised to 66 for men and 62 for women). It might rise to 70 by 2015. The calculation of the retirement pensions will now be made based on the entire career of all workers. The President of the Council started to reform the tax regime: the fight to counter tax evasion which represented 41 billion € in 2012 (strengthening the controls undertaken by the financial police and a limit placed on payments in cash to 1,000€) and an increase in taxes on property. Mario Monti's government introduced a new land tax on the main place of domicile, (), which brought in 23 billion €, i.e. 9 times more than anticipated. This replaced the ICI which brought in 14 billion € into the State coffers but which was abolished by Silvio Berlusconi in 2008. 80% of Italians own their own property.Italy, which is the third most important economy in the eurozone has been in recession since mid 2011. In 2012 the GDP is due to have contracted by 2.4%. The country's debt totalled 2000 billion €, i.e. 126% of the country's GDP, an historic record. In October last unemployment totalled 11.1%, the highest rate since the beginning of the publication of monthly statistics in January 2004 and previously since the first quarter of 1999. The share of young unemployed people amongst the 15-24 year olds totalled 36.5%, a record in the peninsula. Moreover industrial production has fallen by 7.6% over the last twelve months and household consumption fell be 3.2% between November 2011 and November 2012. The gap between the richest and the poorest Italians continues to grow.Although the Italians are thankful to Mario Monti for having won back Italy's credibility and dignity they are suffering however from the austerity cure he imposed on the country. The domestic social situation is still tense and Mario Monti does not encourage the same enthusiasm as he does within the European institutions and amongst its leaders. Between November 2011 and the beginning of this year the spread (the difference between Italian and German interest rates) has fallen from 550 to 300 points, which led to a reduction of the interest rate on the Italian debt from 7% to 4.52% i.e. 20 billion € per year.Roberto Perotti of the Bocconi University of Milan believes that the budgetary savings in 2013, under 10 billion €, are still limited. \"\" indicated the academic.As soon and the President of the Council's announced that he had decided to resign from office after the vote on the budget, Silvio Berlusconi announced his return to the Italian political stage and that he would be standing to succeed Mario Monti. The latter then took his time to reveal what he was going to do in the future. On 28th December last he said that he would accept the leadership of the centrist coalition in the parliamentary elections. \"\" he indicated after a meeting with centrist organisations and civil society. The President of the Council highlighted his \"\" and said that as a candidate he aimed \"\" \"\" declared the Professore, the name given to him in Italy. \"\" he added.Senator for life, Mario Monti cannot stand in the Senatorial election. He can however sponsor a political party or a coalition and even put together an electoral list in his name, a solution that he has privileged. The outgoing President of the Council's supporters will form a single list under the name \"\" in the Senatorial elections: supporting the election in the Chamber of Deputies, Mario Monti will be putting forward his own list under the name, which will made up of members of civil society only. Thehas asked to have the final say over the candidates, who must have had no involvement in any trials or conflicts of interest – they also have to be clear of any involvement with the mafia.Mario Monti finally decided and made his entry into the political arena which he has always very carefully steered away from. \"\" he warned just a few months ago.The outgoing President of the Council said that he did not want to form a new party but take the head of an assembly that would bring together the various forces in the country. \"\" he maintained. He considers that he transcends the parties and hopes to address citizens directly. In a way he hopes to rebuild a moderate centre on a new foundation without using the old Christian Democratic model, which governed Italy for nearly 50 years before collapsing in the wake of a series of financial scandals.Mario Monti's programme entitled \"\", is based on four main pillars: the maintenance of Italy in Europe, revival of growth, the construction of a dynamic social market economy and a change in the mentalities and behaviour in Italy. He plans to continue the reforms started thirteen months ago: reduction of the debt by 2015 by 5% per year to bring it down to 60% of the GDP, against a present 126%; the inclusion in the Constitution (article 81) of the respect of budgetary balance (golden rule); reduction of income and company taxes; improvement of administrative efficiency; zero tolerance of tax evasion; revision of the electoral law which Mario Monti has qualified \"\" (notably with a reduction of the number of MPs).The outgoing President of the Council believes that the sacrifices that the Italians have made over the past year must be respected and cannot be ignored. \"\" he maintained.Mario Monti is standing as the candidate for Europe and is heading into battle under the banner of the European People's Party (EPP) which decided to support him to the detriment of Silvio Berlusconi, as indicated by Joseph Daul (EPP group chair in the European Parliament) on 17th January last. \"\" said the outgoing President of the Council as he spoke of his results as Head of State. The man who stands as the only one able to rise to the economic crisis and the only one who can help Italy maintain its position in the world, can count of the support of the European institutions likewise that of most of the 27 Heads of State and government who all see in him the craftsman of Italy's economic consolidation and laud the work he has accomplished as head of the country. \"\" declared Herman van Rompuy, President of the European Council on 13th December last. \"\" stresses the President of the European Commission José Manuel Barroso.Mario Monti has the support of the Union of Christian and Centre Democrats (UDC) led by Pier Ferdinando Casini, Future and Freedom for Italy (FLI) led by Gianfranco Fini [1] , several centrist groups and also Towards the III Republic, a think-tank led by Luca Cordero di Montezemolo, the head of Ferrari and former leader of the Italian business organisation (Confindustria). Other personalities such as Sergio Marchionne, the CEO of Fiat, and John Elkann, the Agnelli family's, heir and main shareholder in the car industry have also said they would like to see Mario Monti continue his reforms and stay at the head of the Council.Mr Monti can also count on the support of the Italian Episcopal Conference, a most important organisation in Italy. \"\" declared Cardinal Angelo Bagnasco, the head of the Italian church.For a long time the Catholic Church supported Silvio Berlusconi, who promised never to approve a law contrary to the values of the church, on issues such as euthanasia and gay marriage. In spring 2011 however the religious authorities stopped supporting the(the name given to the former President of the Council) after the revelation of sex scandals in which he is said to have been involved and also because of some of his political positions which have been particularly incoherent. The Vatican's dailypublished its support to Mario Monti, who now enjoys the approval of the(strong powers), the name given in Italy to the alliance between the Church, Finance and Industry.Since his departure from office on 8th November 2011 thehas maintained doubt regarding his future. On 9th December after Mario Monti's announcement that he would soon be resigning, Berlusconi said he wanted to return to politics and run for the Presidency of the Council in the next parliamentary elections. \"\" he declared to the Italians on the TV channelon 17th December last. \"\" he repeated on the channelEngaged in an electoral campaign once more, Silvio Berlusconi has changed from being incredibly positive about Mario Monti, and has become one of his most vehement critics. \"\" he declared just a few months ago. \"\" he then stressed.His discourse has now totally changed. \"\" said Silvio Berlusconi on 11th December on Canale 5. \"\" he said. He also accused Berlin of having orchestrated his downfall in 2011 and has requested the establishment of an investigation into the way his government collapsed.Silvio Berlusconi therefore justifies his return to the political scene by the urgency of the situation and the disastrous results produced by his successor, who, in his opinion, has lost all credibility since he initially promised never to enter politics when he first took over as head of government.Themaintains that the Italian economy is exhausted. \"\" he says, describing his country's situation after 13 months of government by Mario Monti. In his opinion, if things continue along the present path \"Silvio Berlusconi brandishes the threat of exiting the euro zone by Italy. \"\" he indicated.He is due to focus his electoral campaign on the middle classes, the reduction of taxes (hoping to convince the Italians – many of whom are unhappy with the recent tax increases), growth and criticism of Europe, which he describes as \"\". \"\" wonders Silvio Berlusconi.On 7th January(Your Eminence, the other pseudonym given to the former President of the Council) signed an electoral agreement with the Northern League (LN), a rightwing populist party with whom he governed with between 2008 and 2011, before both parties finally separated, after the League refused to support Mario Monti's austerity programme. The PdL will be supporting the Northern League's leader Roberto Maroni for the Presidency of the Regional Council of Lombardy (early regional elections are being organised in this region on the same day as the national election) in exchange for which the populist party will form a coalition with Silvio Berlusconi's party in the general elections.This agreement stipulates that Silvio Berlusconi will relinquish the Chigi Palace, the residency of the Italian Prime Ministers. If the rightwing wins the party's leader, Angelino Alfano, will be appointed to this position. Thehas indicated that he would like to be appointed Economy Minister and to see this post merged with that of Industrial Development Minister.For these parliamentary elections the former President of the Council has \"cleaned\" up his party's lists. Hence Nicola Cosentino, former Secretary of State for the Economy, who was involved in a scandal for peddling influence and Marcello Dell'Utri, a Senator sentenced to seven years in prison for colluding with the mafia, whose trial is still on-going, have been removed from the lists.The response to Silvio Berlusconi's return is far from unanimous within the PdL. The party is close to division with a split between its moderate and its extreme right wings. An \"\" bid according to Giorgia Meloni, former Youth Minister, who wanted to stand in the primary election in view of appointing the rightwing candidate for the post of President of the Council – an election that was initially planned on 16th December. \"\" she stressed. Gianni Alemanno, the Mayor of Rome, Renato Formigoni and Maurizio Lupi said that they are stupefied. \"\" declared Mario Mauro, the head of the PdL (EPP) in the European Parliament, adding \"Many regret that a primary election was not organised. \"\" indicated Gianni Alemanno. \"\" maintained Fabrizio Cicchitto, the head of the PdL MPs in the Italian Parliament. Even Angelino Alfano admitted that \"\" indicated Political Science Professor Raffaelle de Mucci.Silvio Berlusconi's return to government would be advantageous to him – for a while at least – since it would remove him from the grips of justice. Mario Monti's government adopted a bill last December banning anyone with a two year prison sentence (including during that person's mandate) from access to elective posts. The judicial procedures against Silvio Berlusconi were frozen in 2010 by a bill which granted him immunity but which was partly invalidated on 13th January 2011. Above all a massive majority of Italians rejected a bill on 12th and 13th June 2011 during a referendum which would have guaranteed the legal immunity of the President of the Council at the time (94.60% \"no\" votes). This obliges the latter to answer the law in several affairs.On 26th October last Silvio Berlusconi was sentenced to one year in prison and was banned for three years from holding any public office for tax fraud in an affair involving Mediaset. He is accused of having artificially inflated copyright prices for the broadcast of films purchased by companies belonging to him, during their resale to his audiovisual company Mediaset. In all the embezzlement is said to have totalled 35 million €.is due however to appeal against this decision.Since April 2011 Silvio Berlusconi has been accused in the Rubygate affair – a sex scandal, named after Karima el Maghroug. The former President of the Council is suspected of having paid for sex with the young girl when she was still under age and of having put pressure on the police authorities in Milan to have her released after she had been arrested for theft. For his part he admits giving money to the young woman but only to help her open a beauty institute and to prevent her from prostituting herself. He has always denied the accusations brought against him and repeats that theparties which the press has spoken at length about were absolutely \"\". He justified his intervention with the police stating that he thought Karima El-Maghroug was the niece of the then Egyptian President, Hosni Mubarak. The prostitution of a minor and abuse of power are both punishable in Italy by terms in prison ranging from three to 12 years.To prevent any interference with the electoral campaign Silvio Berlusconi's lawyers asked for the Rubygate trial to be postponed, a hearing for which was due to be held before the election. It was finally delayed until 11th March, the date of the last audience.Although Silvio Berlusconi undoubtedly knows that the he has lost and that he cannot win the next parliamentary elections he also knows that he could - even with a mediocre result – be able to put together a parliamentary group to form a minority to prevent whoever it might be from governing. Just one month before the election we should remember that all of those who had putto rest were very much mistaken.Paradoxically the leftwing, which has been forecast to win by all of the polls, has practically been thrown out of the electoral campaign with Mario Monti's entry into the competition and the return of Silvio Berlusconi. By standing in the election Mario Monti is compromising the Democratic Party's chances. Its leader Pierluigi Bersani protested against the surprise entry of a man that the Democratic Party has supported for the last thirteen months. \"\" declared the former President of the Council (1998-2000), Massimo d'Alema (PD), last December.\" analyses historian and sociologist Marc Lazar.Pierluigi Bersani has asked Mario Monti to position himself on the political scale. \"\" he asked. He wants the outgoing President of the Council to say whether he intends to sit with Silvio Berlusconi within the EPP. To all of these questions Mario Monti has answered that he was \"The democrats say that they only have one rival: Silvio Berlusconi. Moreover they are doing everything they can to appear not to be following Mario Monti's reforms. \"\" declared Enrico Letta, the PD's second in command. \"\" he added.On 2nd December Pierluigi Bersani was appointed to stand for his party for the Presidency of the Council after having won the second round of the primary election organised by the Italian left winning 61% of the vote (44.9% in the first round) against the Mayor of Florence, Matteo Renzi (39% of the vote; 35.5% in the first round). 3.5 million Italians voted on 25th November during the first round of the primary election when, apart from Pierluigi Bersani and Matteo Renzi, three other candidates were also running: Nichi Vendola, the governor of Pouilles, Bruno Tabacci, a former Christian Democrat, and Laura Puppato, leader of the Democrats in the regional council of Venetia. These three candidates supported Pierluigi Bersani in the second round.On 29th and 30th December last the leftwing militants were also called to ballot to appoint the majority of their candidates in parliament. 1.2 million people voted in this primary, which was an historic first. \"\" stressed Democrat MP Matteo Colaninno.\" indicated Marc Lazar.The Democratic lists will feature 40% of women in these parliamentary elections. 18 of them will be leading a list.In this election the Democratic Party has joined forces with the Left, Ecology and Freedom Party (SEL) led by Nichi Vendola, the South Tyrolean People's Party and the Italian Socialist Party (PSI) led by Riccardo Nencini within thecoalition. Pierluigi Bersani's, programme entitled \"\" intends to be the \"\". The Democratic leader is anticipating tax reductions on labour and companies by fighting tax evasion and by shifting the tax burden on to annuities as well as major financial and real estate fortunes. He has promised to follow Mario Monti's agenda but focusing more on employment and social aspects. Pierluigi Bersani is not ruling out an alliance with the Union for Christian and Centre Democrats (UDC) led by Pier Ferdinando Casini after the election; \"\" this is the electoral motto chosen by the leftwing coalition in these elections.Still on the left, the Italy of Values (IdV) movement led by Antonio di Pietro, has joined forces with the Left Federation led by Paolo Ferrero and Oliviero Diliberto, which includes the Party for Communist Revival (PRC) and the Party of Italian Communists (PdCI) and the Federation of Greens led by Angelo Bonelli within a coalition entitled \"\". Antonio Ingroia is their candidate for the post of President of the Council.The Northern League (LN) is experiencing a difficult period. For several months it has been involved in financial scandals. Its leader Umberto Bossi resigned on 5th April 2012 after having been accused with several members of his family in an embezzlement affair. They are accused of having used the League's money to fund trips, outings and even for the renovation of their houses. Umberto Bossi's son, Renzo, has had to give up his position as regional councillor of Lombardy. Roberto Maroni is now leading the party.The left also has its own populist party – the Five Stars Movement (M5s) created by comedian Beppe Grillo in 2009, which stands as \"\". \"\" says the movement's leader.Beppe Grillo rejects the political parties whom he accuses of \"\". \"\" he likes to repeat. He is asking corrupt politicians to be brought to justice in the same way the Nazi criminals were after the Second World War. The M5s is against the banks' debts being paid off by the Italians and wants Italy to leave the euro zone, \"\" and more widely he wants it to quit the European Union, which \"\".The organisation supports the introduction of a minimum wage, a reduction in military spending, the abolition of public funding of political parties, a reduction in the number of MPs and their pay (at present they are the best paid in Europe) and the abolition of the provinces of Italy (110 in all). Beppe Grillo believes that Mario Monti (whom he calls) is the result of a \"\". Grillo is thriving because of worry, discontent and even the anger of the Italians who have had enough of politics and who are suffering because of the tax increases and budgetary cuts decided by the Monti government. He is attracting the abstentionists and the voters who are increasingly against the traditional parties.The M5s organised an internet vote to appoint its 945 candidates in the election. \"\" declares Beppe Grillo, who is not standing. Each of the candidates has promised not to accept any funding for his campaign and not to earn more than 5000€ monthly ie half of what Italian MPs earn at present.The M5s was the source of surprise in the local elections on 6th and7th May and on 20th May and 21st May 2012 winning the town of Parma, where its candidate Federico Pizzarotti was elected with 60.2% of the vote, ahead of Vincenzo Bernazzoli (PD). Six months later the M5s has become the leading party in Sicily with 14.90% of the vote in the regional elections which took place on 27th and 28th October 2012. \", Grillo indicated in May before adding: \"\" Internal tension is emerging however within M5s which has excluded Federica Salsi, an MP in Bologna and Giovanni Favia, a regional councillor from Emilia-Romagna.Parliament is bicameral and comprises the Chamber of Deputies (Camera dei Deputati) with 630 members and the Senate (Senato della Repubblica), 315. According to article 55 of the Constitution both Chambers enjoy identical power hence Italy has an equal two chamber system.MPs are elected by a proportional system within 26 constituencies (on closed lists) with the Aosta Valley holding a majority one round election. Electoral coalitions have to rally at least 10% of the votes cast to be represented in the Chamber of Deputies, the parties attached to a coalition 2%; non-affiliated parties 4% and lists representing a minority, 20%. Seats are distributed according to the d'Hondt method. A majority bonus is granted to the coalition that wins the election; this is calculated differently in each of the parliamentary chambers: it is granted to the party or coalition that wins nationally in the lower Chamber and to the leading party in each of the regions in the upper Chamber. The political parties which are not represented in parliament have to find 1500 and 4000 signatures of voters living in a constituency (300 in the Aosta Valley) in order to be able to run in the parliamentary elections. Candidates have to be at least 25 years old.Senators are elected by a proportional system within regional constituencies. The list that wins the election takes 55% of the seats and the remaining seats are distributed amongst the other lists on a proportional basis. The Senate also comprises, apart from its elected members, five life senators who have contributed to Italy's honour via their work. .The outgoing President of the Council, Mario Monti is one of these life senators. Any candidate standing for a position as a Senator must be at least 40 years old and only voters aged over 25 elect members of the Senate.Italy has a great number of political parties: 8 are represented in parliament:– the People's Party for Freedom (PdL), created on 12th December 2007 by former President of the Council (1994-1995, 2001-2006 and 2008-2011) Silvio Berlusconi and led by Angelino Alfano, 276 MPs and 147 senators;– the Northern League (LN), a populist, anti-European, xenophobic party created in 1991 by Umberto Bossi, led by Roberto Maroni, 60 MPs and 25 Senators;– the Movement for Autonomy (MPA), created by Raffaele Lombardo on 30th April 2005. The latter, accused of colluding with the mafia and forced to resign from the Presidency of the Regional Council of Sicily by Mario Monti, withdrew from political life. It has 8 MPs and 2 Senators;– the Democratic Party (PD), founded by Walter Veltroni in April 2007 based on the Democratic Left (DS) led by Piero Fassino, and the Daisy of Francesco Rutelli. It is the main opposition party and is led by Pierluigi Bersani and has 217 MPs and 118 Senators;– the Italy of Values (IdV), a party created in 1998 by the former police commissioner, now judge Antonio Di Pietro, who was the instigator of(Clean Hands) movement in 1992, a vast legal operation against the corruption of the political world which ended in the disappearance of the Christian Democratic Party and the Socialist Party. It has 29 MPs and 14 Senators;– the Union for Christian and Centre Democrats (UDC), created in 2002 after the merger of the Democratic Christian Union (DC) the political party that governed Italy for most of the 1st republic (founded in 1948). Led by Pier Ferdinando Casini, it has 36 MPs and three Senators;– The South Tyrolean People's Party (SVP), a Christian Democratic Party representing German speaking Italians from the autonomous province of Bolzano led by Elmar Pichler Rolle and allied to the Democratic Party within the leftwing coalition Italy - Common Good. It has two MPs;– Autonomy, Freedom, Democracy, a centre-left coalition of the Aosta Valley which has one MP."}, {"url": "https://www.calendarz.com/on-this-day/november/13/mario-monti", "page_content": "Event\n\nNov, 13\n\nMario Monti accepted to become the 54th Prime Minister of Italy with the ouster of Silvio Berlusconi, who failed to tackle Italy's debt crisis.\n\nMario Monti, (born 19 March 1943) is an Italian economist who served as the Prime Minister of Italy from 2011 to 2013, leading a technocratic government in the wake of the Italian debt crisis.\n\n\n\nMonti served as a European Commissioner from 1995 to 2004, with responsibility for the Internal Market, Services, Customs and Taxation from 1995 to 1999 and for Competition from 1999 to 2004. Monti has also been rector and president of Bocconi University in Milan for many years.\n\n\n\nOn 12 November 2011, in the midst of the European sovereign debt crisis, Monti was invited by President Giorgio Napolitano to form a new technocratic government following the resignation of Silvio Berlusconi. Monti was sworn in as Prime Minister on 16 November 2011, just a week after having been appointed a Lifetime Senator by President Napolitano, and initially became Minister of Economy and Finances as well, giving that portfolio up the following July.\n\n\n\nFrom 16 May 2013 to 17 October 2013, Monti was the president of Civic Choice, a centrist political party in Italy."}]}