{"Pino Palladino was born on 24 October 1957.": [{"url": "https://www.radioswisspop.ch/en/music-database/musician/113328f03f18e37f9ea1690603e52e56c3109", "page_content": "Giuseppe Henry \"Pino\" Palladino[1] (born 17 October 1957) is a Welsh bassist. A prolific session musician, he is probably best known for playing with The Who (following the death of founding member John Entwistle[2]) from 2002 to 2016, D'angelo from 1996 to present, and the John Mayer Trio from 2005 to present.\n\nPalladino plays a late-1970s, fretless, Music Man StingRay bass guitar, a fretted Fender Precision, and a Jaguar bass. His playing has earned him custom instruments bearing his name.[3]\n\nEarly life\n\nBorn in Cardiff to an Italian father from Campobasso and a Welsh mother,[4] Palladino began playing electric guitar at age 14 and bass guitar at 17. He bought his first fretless bass one year later, playing mostly R&B, funk, and reggae with a rock and roll backbeat.[5]\n\nCareer\n\nPalladino was drawn to Motown and jazz at an early age. He attended Catholic school and took classical guitar lessons. He liked Led Zeppelin and Yes and started a rock band.[6]\n\nIn 1982, Palladino recorded with Gary Numan on the album I, Assassin. The producer of the album asked him to contribute to Paul Young's debut album. Young's cover version of \"Wherever I Lay My Hat (That's My Home)\" by Marvin Gaye became a hit in Europe,and subsequently joined Young's band the Royal family and Palladino received offers to record with Joan Armatrading, Go West, and David Gilmour. He cites as early influences James Jamerson, Danny Thompson, and Norman Watt-Roy and also admires Jaco Pastorius, Stanley Clarke, Bootsy Collins, Larry Graham, Michael Henderson, Anthony Jackson, Marcus Miller, and Rocco Prestia.[7]\n\nIn 1983, he joined The Law with Paul Rodgers, formerly of Bad Company, and drummer Kenney Jones, who succeeded Keith Moon in The Who after Moon died, and recorded the album The Law.\n\nIn the 1990s, Palladino alternated between fretless bass and fretted and 4-string and 6-string bass. He played with Melissa Etheridge, Richard Wright, Elton John, and Eric Clapton.\n\nHe played on Mike Lindup's first solo album, Changes with Dominic Miller on guitar and Manu Katché on drums.[8]\n\nIn 1999, he began working with Richard Ashcroft of The Verve on Ashcroft's debut solo album, Alone With Everybody.[9]\n\nThe Who's bassist John Entwistle died the night before the start of their first tour in two years. Palladino became the band's bass guitarist on tour. In 2006, he joined the remaining band members on their first album in twenty-four years, Endless Wire. He played with The Who at the Super Bowl XLIV half-time show in 2010 with Simon Townshend on guitar, Zak Starkey on drums, and John \"Rabbit\" Bundrick on keyboards. In 2012, he toured with The Who on their Quadrophenia revival.\n\nPalladino met Steve Jordan in the mid-1980s while both were working as session musicians, which blossomed into a friendship. Jordan credits Palladino's apparent ability to \"feel\" changes in music, through melodies, basslines, and an embrace of genres of nearly every kind. According to Jordan, he had planned to meet up with John Mayer and Willie Weeks in January 2005 to perform Tsunami Aid: A Concert of Hope for victims of the tsunami that struck southeast Asia. Weeks was unable to make the performance, and Jordan suggested Palladino, who had heard some of Mayer's work and was willing to come. Beginning a set that included the Jimi Hendrix song \"Bold as Love\", the three found a chemistry together. They recorded an album and toured as a trio.[10]\n\nThey released the album Try!, on 22 November 2005. The eleven-track live album includes cover versions of \"Wait Until Tomorrow\" by Jimi Hendrix and \"I Got A Woman\" by Ray Charles, two songs from Mayer's album Heavier Things, and new songs by Mayer. In addition, Mayer, Palladino, and Jordan are credited as songwriters on three songs: \"Good Love Is on the Way\", \"Vultures\", and \"Try!\".[3] Palladino appeared on Mayer's third album Continuum, fourth album Battle Studies and seventh album The Search for Everything.\n\nIn March and April 2006, Palladino toured with Jeff Beck and played with J. J. Cale, and Eric Clapton on their 2006 album The Road to Escondido. In 2009, he formed a trio with keyboardist Philippe Saisse and Simon Phillips.\n\nHe played with Simon and Garfunkel on their Old Friends reunion tour.[10]\n\nIn January 2011, he entered the studio with D'Angelo to finish recording Black Messiah.[11]\n\nIn 2013 he played on the Nine Inch Nails album Hesitation Marks and was a member of the touring band.\n\nTechnique\n\nPalladino is noted for his use of the fretless bass on many 1980s albums. While it was typical for a bass guitar in a commercial track to have a rather generic sound and stay \"playing the low notes\", Palladino preferred a different sound, combining fretless tone with an octaver effect, and basslines that frequently added chords, lead lines, and counter melodies in the higher range of the instrument. Typical of this style was his playing on Paul Young's Wherever I Lay My Hat. His equipment at that time included a fretless Music Man StingRay Bass 1979 and Boss Octave pedal (OC-2).\n\nSignature model\n\nThe Fender Pino Palladino Signature Precision Bass is modelled after two of Palladino's Fender Precision Basses. The body features faded fiesta red paint over desert sand paint, based on Palladino's 1961 Precision Bass, while the neck shape and round-lam rosewood fretboard are based on his 1963 sunburst Precision Bass.[12]\n\nPersonal life\n\nPino married Marilyn (Maz) Roberts, a former backing singer with the Fabulous Wealthy Tarts, in 1992 in Wales. They have three children: Fabiana, Giancarla and Rocco, who are all involved in the music industry.[13]\n\nSelect discography\n\nWith Paul Young\n\n1983 No Parlez (Columbia)\n\n(Columbia) 1985 The Secret of Association (Columbia)\n\n(Columbia) 1990 Other Voices (Columbia)\n\nWith David Knopfler\n\n1983 Release (Peach Tree)\n\n(Peach Tree) 1985 Behind the Lines (Paris)\n\n(Paris) 1987 Cut the Wire (Paris)\n\nWith Don Henley\n\n1984 Building the Perfect Beast (Geffen)\n\n(Geffen) 1989 The End of the Innocence (Geffen)\n\nWith Go West\n\n1985 Go West (Chrysalis)\n\n(Chrysalis) 1987 Dancing on the Couch (Chrysalis)\n\nWith Elton John\n\n1985 Ice on Fire (Rocket/Geffen)\n\n(Rocket/Geffen) 1992 The One (Rocket/MCA)\n\nWith John Mayer\n\n2005 Try!\n\n2006 Continuum\n\n2017 The Search for Everything\n\nWith Jeff Beck\n\n1999 Who Else! (Epic)\n\n(Epic) 2006 Official Bootleg USA '06\n\n2010 Emotion & Commotion\n\nWith D'Angelo\n\n2000 Voodoo (Virgin)\n\n(Virgin) 2014 Black Messiah (RCA)\n\nWith The Gaddabouts\n\n2011 The Gaddabouts\n\n2012 Look Out Now!\n\nWith The Who\n\n2006 Endless Wire (Polydor)\n\n(Polydor) 2014 Quadrophenia Live in London (Universal)\n\n(Universal) 2015 Live in Hyde Park (Eagle Rock / Universal)\n\n(Eagle Rock / Universal) 2017 Live at the Isle of Wight 2004 Festival (Eagle Rock / Universal)\n\nWith others\n\nReferences"}, {"url": "https://infogalactic.com/info/Pino_Palladino", "page_content": "From Infogalactic: the planetary knowledge core\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nGiuseppe Henry \"Pino\" Palladino[1] (born 17 October 1957) is a Welsh bassist. He gained fame for playing primarily rock and roll, blues rock, and rhythm and blues music, although he has been lauded for his ability to play most genres of popular music, including jazz, neo soul, and funk.\n\nHis career has spanned several ensembles, including the John Mayer Trio and The RH Factor, which he formed with jazz trumpeter Roy Hargrove. He was also Pete Townshend's and Roger Daltrey's first choice to fill the position left by John Entwistle as the bassist for The Who. More recently he has recorded and toured with D'Angelo and The Vanguard.\n\nHe has played on a large number of recordings. He is known for playing a late 1970s fretless Music Man StingRay bass guitar and, later in his career, fretted Fender Precision and Jaguar basses. His playing has earned him custom instruments bearing his name.[2]\n\nCareer\n\nBorn in Cardiff to an Italian father from Campobasso,[3] Umberto Palladino and Welsh mother Ann Hazard,[4] Palladino began playing the electric guitar at age 14. By 17 he decided to play the bass guitar, and bought his first fretless bass one year later, playing mostly R&B, funk, and reggae within a rock and roll backbeat.[5] His first professional gig, at age 20, was at a local television station in Cardiff, where he began playing in 1978. That same year he joined Jools Holland's band and is credited on Holland's album, Jools Holland and His Millionaires. Touring with Holland to support the album gave him the opportunity to purchase his own Music Man StingRay Fretless Bass.[5] While Holland was touring with another new band, the Q-Tips, its frontman, Paul Young became acquainted with Palladino and a year later offered him a place in Paul Young's own backing band.\n\nPalladino was featured on Gary Numan's 1982 album I, Assassin, in which his fretless bass playing made a prominent contribution to the overall sound of the album. He went on to play fretless bass with a healthy number of high-profile artists that include David Gilmour, Tears for Fears, Pete Townshend, Peter Gabriel, Go West, Joan Armatrading, Phil Collins, Chaka Khan and Don Henley.[5][6]\n\nAfter Paul Young landed his own solo contract in 1982, Palladino was brought in as part of his backing band \"The Royal Family\" resulting in noticeable chart success with the No Parlez album,[5] and major hit singles both in the UK and Europe. Examples of Paul Young's newfound success were the band's cover of the Marvin Gaye classic Wherever I Lay My Hat, which reached No. 1 in the UK singles chart for three weeks in summer of 1983, and Love of the Common People. Palladino toured extensively at this time with Paul Young, remaining in the band for five years. 1983 additionally proved to be the year of another ensemble featuring Palladino, Paul Rodgers (formerly of Bad Company), drummer Kenney Jones, along with a rotating cast of other celebrity performers. The band only released one album through Atlantic, The Law, although there were enough out-takes that another bootleg-styled album followed in 1991. Sales were unremarkable, despite the names of those who recorded on the album.[2]\n\nThroughout the 1980s Palladino was noted for his R&B roots on the fretless bass, even when supporting pop and rock heavy performers. One reviewer from Bass Player magazine points to Paul Young's cover of the Bobby Womack/ Rufus tune Stop on By (on 1990s Other Voices), with its \"pre-hip-hop, swung funk groove\" as the precursor to Palladino's later neo-soul focus.[7]\n\n1990s\n\nChanges in instrument\n\nIn the 1990s, Palladino began to alternate between the sounds achieved in playing the fretless bass to one with frets, as well as the 4-string and 6-string bass. At the time, he was well known within the industry for his fretless bass sound. However, now, depending on which artist he was supporting, and the song to be played, he began gravitating towards fretted bass. He was maturing as a musician, and played with artists as diverse as Melissa Etheridge, Richard Wright, Elton John and Eric Clapton. Also in 1991 he joined Paul Rodgers (of Free, Queen + Paul Rodgers, and Bad Company fame) to form the band The Law. In the mid-1990s, Palladino played bass for The London Metropolitan orchestra during their recording of An American Symphony, soundtrack for the movie Mr Holland's Opus.\n\nIn 1990 Palladino joined Mike Lindup (founding member of Level 42) to feature on Lindup's first solo album Changes, a song album with Dominic Miller on guitar, who later went onto work with Sting; and Manu Katché on drums.[8]\n\nFrom 1991 to 1996, he joined Manu Katché to form Stephan Eicher's rhythm section on three albums : Engelberg (1991), Carcassonne (1993) and 1000 vies (1996).\n\nPalladino supported Phil Collins, as a member of the house band for the Golden Jubilee of Elizabeth II, which played with Paul McCartney, Eric Clapton, Cliff Richard, and Tony Bennett, among other notable performers. He later wrote that he felt privileged to have been amongst the others on stage in such an event.\n\nIn 1999, he began working with Richard Ashcroft, of The Verve, during the recording sessions of Ashcroft's debut solo album, Alone With Everybody.[9] Richard proved to be mightily impressed by Palladino's natural bass playing ability;[10]\n\n<templatestyles src=\"Template:Blockquote/styles.css\" />\n\nThis Pino Palladino, I can say a Meters record and he can play me the bass line. He can play anything. He's one of the only people in the world who can totally replicate that kind of Beach Boys/scratch/Walker Brothers bass. You can get that sound if you want it, dead on. So it was very liberating working with him.\n\nPalladino also joined Ashcroft's touring band for the singer's first major solo outing throughout 2000.[11]\n\nNeo soul\n\nBy the mid-1990s, Palladino had established himself as a busy, highly desirable bassist and a studio worker in many genres, but finally became visible to those artists who played largely left of center, and demand for his session playing grew within a different quarter. Palladino began moving from blues-rock toward neo soul projects. Palladino and Steve Jordan found themselves performing on the same session for B.B. King's 1997 duets CD Deuces Wild. It was the first time soul singer D'Angelo first heard Palladino, who had just switched from a signature sound fretless bass sound to that of performing with fretted basses. The result was an invitation to \"use Pino's big, behind-the-beat bass to help cast a neo-soul spell on his Grammy Award-winning Voodoo album\".[12] It would not be his only uncredited Grammy performance.\n\nAs the word spread throughout the genre, Palladino found an increasing demand. Examples of his bass work in this genre (in addition to D'Angelo) include much of the Soulquarians' production discography, such as Mama's Gun, and Penitentiary Philosophy found on Erykah Badu's 2000 CD.[7] Other albums using Palladino's sound include 1st Born Second for Bilal, Like Water for Chocolate and Electric Circus for Common. Palladino has been described by Steve Jordan, who got his own professional start playing the drums for Stevie Wonder, as having a \"deep funk\" side and a \"melodic\" side. Palladino admits that \"Of all my influences, I would say what's always in the back of my mind is early Stevie Wonder, like Talking Book and Innervisions; that music is really in my blood.\"[13]\n\n2000s\n\nThe Who\n\nFollowing the death of The Who's bassist John Entwistle the night before the band were to kick off their first tour in two years, Palladino was their first choice to become the band's full-time touring bass guitarist, and by 2006, he was invited to join the remaining original band members in recording their first album in twenty-four years. Pete Townshend, the band's composer, recorded the bassline on the majority of the songs to get the effect he himself wanted, with Palladino doing so on the other six of them. Released in October 2006, the album was named Endless Wire.\n\nPalladino also played with The Who at the Super Bowl XLIV half-time show, in February 2010, alongside other backing artists: Simon Townshend on guitar, Zak Starkey, drums and percussion, and John \"Rabbit\" Bundrick, on keyboard instruments.\n\nPaul Simon\n\nIn 2003, Palladino intended to go down to see his old friend Paul Simon and meet Brian Eno for the first time. He was asked to record with them, and had to borrow a bass guitar to play. The result was that he played with Simon and Garfunkel on their Old Friends reunion tour and in an interview with Bass Player Magazine he mentions drummer Steve Gadd and percussionist Jamey Haddad \"had laid down some great grooves for me to add bass\". He had kept the recordings, and by the time that he appeared on the Old Friends: Live on Stage CD and DVD from the tour, he was able to use some of the material.[13] He played on Paul Simon's 2006 release, Surprise.\n\nOther appearances\n\nPalladino has toured in the backing band for Joe Walsh. In 2004, he appeared to be playing with Gary Moore at the Wembley Arena. He also contributed to the recording process of Nine Inch Nails' 2013 release Hesitation Marks, and also began touring with the band for their Tension 2013 tour. Trent Reznor said he is \"probably the best bass player in the world.\"[14]\n\nEmergence of the John Mayer Trio\n\nPalladino met Steve Jordan in the mid-1980s while both were working as session players on many occasions, which blossomed into a friendship. Jordan credits Palladino's apparent ability to \"feel\" changes in music, through melodies, basslines, and an embrace of genres of nearly every kind. According to Jordan, he'd planned to meet up with John Mayer and Willie Weeks in January 2005 to perform a benefit concert on a NBC sponsored telethon Tsunami Aid: A Concert of Hope to raise funds and public awareness benefiting victims in the aftermath of the tsunami that struck southeast Asia. Weeks was unable to make the performance, and Jordan suggested Palladino, who had heard some of Mayer's work, and was willing to come. Beginning a set that included the Jimi Hendrix classic, \"Bold as Love\", the three found a chemistry together and set about their schedules to record a CD and a tour as a power trio.[13] They released the album Try!, on 22 November 2005. The eleven-track live album includes cover songs, such as Jimi Hendrix's \"Wait Until Tomorrow\" and \"I Got A Woman\" by Ray Charles, two songs from Mayer's release Heavier Things, as well as new songs written by Mayer. In addition, Mayer, Palladino, and Jordan are credited as songwriters on three songs on the album: \"Good Love Is On The Way\", \"Vultures\", and \"Try!\".[2] Along with John Mayer on guitar and vocals, and Steve Jordan on drums, Palladino rounded out the outfit, touring and recording as the bass guitarist of the John Mayer Trio, and on Mayer's third album Continuum.\n\nInfluences on bass guitar\n\nInfluences for Palladino for bass guitar include The Shadows Jet Harris; Motown bassist James Jamerson; Stevie Wonder's keyboard-bass, jazz innovator Nathan Watts; British folk/rock upright bassist Danny Thompson; Norman Watt-Roy (of Ian Dury & the Blockheads); Larry Graham; Michael Henderson; Bootsy Collins; Jaco Pastorius; Paul Jackson; Anthony Jackson; Doug Rauch (of Carly Simon and Santana), and Billy Cobham.[13]\n\nTechnique\n\nPalladino is noted for his use of the fretless bass in many 1980s chart records. While it was typical for a bass guitar in a commercial track to have a rather generic sound and stay \"playing the low notes\" Palladino preferred a different sound (combining fretless tone with an octaver effect) and basslines that frequently added chords, lead lines and counter melodies in the higher range of the instrument as opposed to simply the aforementioned \"low notes\". Typical of this style was his playing on Paul Young's biggest chart hits, in particular his playing on Wherever I Lay My Hat. His equipment at that time included a fretless Music Man StingRay Bass 1979 and Boss Octave pedal (OC-2).\n\nPino Palladino signature model\n\nThe Fender Pino Palladino Signature Precision Bass is modelled after two of Palladino's Fender Precision Basses. The body featuring faded fiesta red paint over desert sand paint is based on Palladino's 1961 Precision Bass while the neck shape and round-lam rosewood fret board are based on Pino's 1963 sunburst Precision Bass. He has also been known to prefer Thomastik-Infeld flat-wound bass strings.[15] Although as instruments change depending on the desired result (the Fender Japan Jaguar has featured on many stage and recordings since about 2006), strings brands and type ( round/flat/semi) may change too.\n\nAfter 2005\n\nIn spring of 2006, Palladino toured with Jeff Beck. He also played with J. J. Cale, and Eric Clapton on their 2006 album The Road to Escondido, alongside other notable musicians, including Derek Trucks, and Billy Preston. It was to be Preston's last work before he died only days afterward. Palladino joined Eric Clapton's touring band for 11 dates in the Eastern US and Canada in May 2008.\n\nIn 2008 he recorded 3 tracks for London's The Herbaliser for their album \"Same As It Never Was\" released on k7! in 2009\n\nIn 2009, Palladino joined with keyboardist Philippe Saisse and Simon Phillips to form an instrumental trio: Phillips Saisse Palladino, an instrumental progressive jazz/funk rock ensemble, which have toured Europe through 2009 into 2010, playing songs that spotlight the talents of each performer, in the manner of many jazz outfits. He has also worked on an album with Clapton and Robbie Robertson, and played on Amos Lee's third album, Last Days at the Lodge. He appears on Jeff Beck's 2010 album, Emotion & Commotion. As of August 2010, Palladino has been touring with Herbie Hancock.\n\nPalladino also appears on Manu Katché's third jazz album, Third Round. Both had already played together several times, particularly on Paul Young's Other Voices, as Stephan Eicher's rhythm section in the first half of the 1990s, and on stage with Manu Katché's jazz band The Tweeters. Currently in the studio recording with Steve Gadd; Edie Brickell; Andy Fairweather Low; who have formed a group the Gaddabouts.\n\nIn January 2011, he entered the studio with D'Angelo to finish recording the long overdue follow up to Voodoo.[16]\n\nIn January 2011, Palladino played on the second album of Adele: 21, while in May in the same year he played on the last EP of Revolver, Parallel Lives.\n\nIn January and February 2012, he joined D'Angelo's live band for a short European tour, alongside drummer Chris 'Daddy' Dave and guitarist Jesse Johnson. The tour included performances at London's Brixton Academy.\n\nIn late 2012, he toured with the Who on their Quadrophenia \"revival\" tour and in 2013 he played on several tracks from the Nine Inch Nails album Hesitation Marks as well as being a member of the Nine Inch Nails live touring band.\n\nDiscography (selected)"}, {"url": "https://happyhappybirthday.net/en/age/pino-palladino-person_lyyyfy", "page_content": "Pino Palladino\n\nWelsh bassist – Pino Palladino was born in Cardiff (capital city of Wales) on October 17th, 1957 and is 65 years old today.\n\nAge How old is Pino Palladino? 65 Pino Palladino is 65 years old.\n\nBiographical data\n\nPino Palladino\n\nBirthday When was Pino Palladino born? Pino Palladino was born on October 17th, 1957.\n\nPlace of Birth Where was Pino Palladino born? Cardiff (capital city of Wales).\n\n♎ ♎ Zodiac What is the zodiac sign of Pino Palladino? Pino Palladino was born in the zodiac sign Libra (The Scales)."}, {"url": "https://www.celebsagewiki.com/pino-palladino", "page_content": "Age, Biography and Wiki\n\nPino Palladino was born on 17 October, 1957 in Cardiff, United Kingdom, is a Welsh bassist and record producer from Cardiff. Discover Pino Palladino's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 65 years old?\n\nPopular As N/A Occupation N/A Age 65 years old Zodiac Sign Libra Born 17 October 1957 Birthday 17 October Birthplace Cardiff, United Kingdom Nationality United Kingdom\n\nWe recommend you to check the complete list of Famous People born on 17 October. He is a member of famous Producer with the age 65 years old group.\n\nPino Palladino Height, Weight & Measurements\n\nAt 65 years old, Pino Palladino height is 6′ 8″ .\n\nPhysical Status Height 6′ 8″ Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is Pino Palladino's Wife?\n\nHis wife is Marilyn Roberts (m. 1992)\n\nFamily Parents Not Available Wife Marilyn Roberts (m. 1992) Sibling Not Available Children Not Available\n\nPino Palladino Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Pino Palladino worth at the age of 65 years old? Pino Palladino’s income source is mostly from being a successful Producer. He is from United Kingdom. We have estimated Pino Palladino's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Producer\n\nPino Palladino Social Network\n\nTimeline"}, {"url": "https://www.famousdetails.com/pino-palladino/", "page_content": "Pino Palladino (Bassist) was born on the 17th of October, 1957. He was born in 1950s, in Baby Boomers Generation. His birth sign is Libra and his life path number is 4. Pino’s birth flower is Marigold and birthstone is Opal and Tourmaline. What does this all mean? Let’s find out!\n\nDiscover all the facts that no one tells you about Pino Palladino below ↓\n\nNAME: Pino Palladino REAL NAME: Pino Palladino NICKNAME: Pino PROFESSION: Bassist GENDER: Male BIRTHPLACE: Wales, United Kingdom ETHNICITY: Unknown NATIONALITY: Italian RELIGION: Unknown SEXUALITY: N/A\n\n1. Bio\n\nPino Palladino, best known for being a Bassist, was born in Wales, United Kingdom on Thursday, October 17, 1957. John Entwistle’s replacement in the rock band The Who, as well as a member of the John Mayer Trio.\n\nFamily: He and his wife Maz raised three children. Pino Palladino father’s name is under review and mother unknown at this time. We will continue to update details on Pino Palladino’s family.\n\nFATHER: MOTHER: unknown at this time BROTHER(S): Not available SISTER(S): Not available\n\nEducation: The education details are not available at this time. Please check back soon for updates.\n\nDating: According to CelebsCouples, Pino Palladino is single .\n\nNet Worth: Online estimates of Pino Palladino’s net worth vary. It’s easy to predict his income, but it’s much harder to know how much he has spent over the years. CelebsMoney and NetWorthStatus does a good job of breaking most of it down.\n\n2. Pino Palladino’s zodiac sign is Libra\n\nPino Palladino zodiac sign is a Libra. Dates of Libra are September 23 - October 22. The zodiac sign Libra is thrives when their needs of balance, justice, and stability are met. They are charming creatures that somehow always surround themselves with a sense of beauty and harmony. They are charming, harmonious, diplomatic, and easy-going nature. Although, they can be indecisive, superficial, hypocritical, gullible, and passive aggressive.\n\nZODIAC: Libra BORN IN THE YEAR OF THE: Rooster RULING PLANET: Venus\n\n3. He is currently 65 years old\n\nThe Italian bassist has been alive for 23,976 days or 575,438 hours. There were precisely 813 full moons after his birth to this day.\n\nBORN: October 17, 1957 AGE: 65 years old BORN ON: Thursday GENERATION: Baby Boomers Generation DECADE: 1950s\n\nPino Palladino was born on a Thursday. The 'thur' in Thursday is actually derived from the Norse god Thor. People born on Thursdays are generally a fun to be around, which means Thursday's babies get to be the life of the party.\n\nCountdown to Pino Palladino’s next birthday.\n\nPino Palladino will be turning 66.\n\n4. On Pino Palladino’s birthday\n\nThe world’s population was 2,871,952,278 and there were an estimated year babies born throughout the world in 1957, Dwight D. Eisenhower (Republican) was the president of the United States, and the number one song on Billboard 100 was [Not available]. No song matches found..\n\nOn this day in history:\n\n5. Pino Palladino’s height and weight\n\nWe’re currently in process of confirming all details such as Pino Palladino’s height, weight, and other stats. If there is any information missing, we will be updating this page soon. If you any have tips or corrections, please send them our way.\n\nHeight\n\nHEIGHT (FEET): N/A HEIGHT (METERS): N/A HEIGHT (INCHES) N/A HEIGHT (CM): N/A\n\nWeight\n\nBUILD Under review WEIGHT (LBS): Under review WEIGHT (KG) Under review\n\nMisc\n\nEYE COLOR: N/A HAIR COLOR: N/A\n\n6. The Year of the Rooster\n\nPino Palladino was born in the Year of the Rooster. People with Chinese zodiac Rooster according to Chinese zodiac have many excellent characteristics, such as being honest, bright, communicative and ambitious. Most of them are born pretty or handsome, and prefer to dress up. Their strengths are being independent, capable, warm-hearted, self-respect, and quick minded. But they can also be impatient, critical, eccentric, narrow-minded, and selfish. Their lucky numbers are 5, 7, 8 and lucky colors are gold, brown, brownish yellow, yellow.\n\n\n\n\n\n7. Pino Palladino’s life path number is 4\n\n8. Baby Boomers Generation\n\nPino Palladino was born in the middle of Baby Boomers Generation.\n\n9. Pino Palladino’s birthstone is Opal and Tourmaline\n\n10. Pino Palladino’s birth flower is Marigold\n\nIf you found this page interesting or useful, please share it. We will continue to update this page, so bookmark it and come back often to see new updates."}, {"url": "https://www.idolbirthdays.net/pino-palladino", "page_content": "Does Pino Palladino Dead or Alive?\n\nAs per our current Database, Pino Palladino is still alive (as per Wikipedia, Last update: May 10, 2020).\n\n🎂 Pino Palladino - Age, Bio, Faces and Birthday\n\nCurrently, Pino Palladino is 65 years, 7 months and 23 days old. Pino Palladino will celebrate 66rd birthday on a Tuesday 17th of October 2023. Below we countdown to Pino Palladino upcoming birthday.\n\nDays Hours Minutes Seconds\n\nPopular As Pino Palladino Occupation Bassist Age 65 years old Zodiac Sign Libra Born October 17, 1957 (Wales) Birthday October 17 Town/City Wales Nationality Wales\n\n🌙 Zodiac\n\nPino Palladino’s zodiac sign is Libra. According to astrologers, People born under the sign of Libra are peaceful, fair, and they hate being alone. Partnership is very important for them, as their mirror and someone giving them the ability to be the mirror themselves. These individuals are fascinated by balance and symmetry, they are in a constant chase for justice and equality, realizing through life that the only thing that should be truly important to themselves in their own inner core of personality. This is someone ready to do nearly anything to avoid conflict, keeping the peace whenever possible\n\n🌙 Chinese Zodiac Signs\n\nPino Palladino was born in the Year of the Rooster. Those born under the Chinese Zodiac sign of the Rooster are practical, resourceful, observant, analytical, straightforward, trusting, honest, perfectionists, neat and conservative. Compatible with Ox or Snake.\n\nSome Pino Palladino images\n\nAbout\n\nJohn Entwistle's replacement in the rock band The Who, as well as a member of the John Mayer Trio.\n\nBefore Fame\n\nHe had his first professional gig at the age of twenty for a local television show and joined Jools Holland's band.\n\nTrivia\n\nHis fretless bass playing is featured on I, Assassin by Gary Numan, an album that helped him get more gigs playing with big names.\n\nFamily Life\n\nHe and his wife Maz raised three children.\n\nAssociated With\n\nHe toured with Jeff Beck in 2006.\n\nPino Palladino trend"}, {"url": "https://infofamouspeople.com/famous/pino-palladino.htm", "page_content": "Pino Palladino's About ✎]\n\nPino Palladino was born on October 17, 1957 (age 65) in Wales. According to numerology, Pino Palladino's Life Path Number is 22. He is a celebrity bassist. John Entwistle's replacement in the rock band The Who, as well as a member of the John Mayer Trio. His genres are Rock,soul,funk,pop,new wave. His successful albums are Hesitation Marks (2013), Songs from the Big Chair (1985), Look Out Now! (2012), Slap My Hand (2008) and East of the Moon (1999). His popular songs are Everybody Wants to Rule the WorldSongs from the Big Chair · 1985, ShoutSongs from the Big Chair · 1985 and Head Over HeelsSongs from the Big Chair · 1985. His spouse is Marilyn Roberts (m. 1992). His height is 6′ 8″. More information on Pino Palladino can be found here. This article will clarify Pino Palladino's Bio, Wikipedia, Age, Birthday, Height, and other information.\n\nLet's explore Your Tarot online (love,wellness,fortune)\n\nIf you are a fan of Pino Palladino, tell us more about Him\n\nAdvertisement\n\nFamily, Spouse, Dating, and Relationships of Pino Palladino ✎]\n\nHe and his wife Maz raised three children.\n\nPino Palladino Before Fame ✎]\n\nOn 10-17-1957, Pino Palladino was born. It indicates that He is on life path 22. His personal year number in 2023 is 7. He had his first professional gig at the age of twenty for a local television show and joined Jools Holland's band.\n\nThe Numerology of Pino Palladino ✎]\n\nPino Palladino has Life Path Number 22. Those with Life Path Number 22 are natural leaders. They are confident and can inspire others to achieve their goals with their great ambition. Additionally, they are also creative and resourceful deep thinkers. They are often visionaries and can see the potential in people and situations.\n\nAdvertisement\n\nPino Palladino's personal year in numerology ✎]\n\nPino Palladino was born in 1957, that means in 2023, Pino Palladino has personal year number 7. This is the second bottoming phase, there will be many challenges and difficulties for Pino Palladino in this year, especially in His career. He should prepare everything for the 8th year.\n\nSuccess of Pino Palladino ✎]\n\nHis fretless bass playing is featured on I, Assassin by Gary Numan, an album that helped him get more gigs playing with big names.\n\nAssociated with ✎]\n\nHe toured with Jeff Beck in 2006. John Mayer, Gary Numan, and John Entwistle were also His acquaintances.\n\nPino Palladino Net Worth ✎]\n\nInformation about His net worth in 2023 is being updated as soon as possible by infofamouspeople.com, You can also click edit to tell us what the Net Worth of the Pino Palladino is\n\nPino Palladino Height Weight ✎]\n\nAt the age of 65, Pino Palladino height is 6′ 8″.\n\n\n\nHouses & Cars & Luxury Brands ✎]\n\nPino Palladino's house, cars and luxury brand in 2023 will be updated as soon as possible, you can also click edit to let us know about this information."}, {"url": "https://www.videodetective.com/person/pino-palladino-127469", "page_content": "From Wikipedia, the free encyclopedia. Pino Palladino (born 17 October 1957) is a Welsh bass guitarist who gained fame playing primarily rock and roll, blues rock, and rhythm and blues music, although he has been lauded for his ability to play most genres of popular music, including jazz, neo soul, and funk. His career has spanned several ensembles, including the John Mayer Trio and The RH Factor, a band mixing elements of soul, jazz and R&B, which he formed with jazz trumpeter Roy Hargrove. He was also Pete Townshend's and Roger Daltrey's first choice to fill the position left by John Entwistle as the bassist for The Who. Adding to an eclectic grasp and melodic approach on his instrument, he has become one of the most sought-after session players on the bass and has played on a large number of recordings by some of the world's most successful entertainers, in part, by mastering a variety of techniques on both his late 1970s fretless Music Man StingRay bass guitar and, later in his career, adding fretted Fender Precision and Jaguar basses. His playing has earned him custom instruments bearing his name Description above from the Wikipedia article Pino Palladino, licensed under CC-BY-SA, full list of contributors on Wikipedia​\n\nBorn\n\nThursday, 17 October 1957\n\nActor Filmography"}, {"url": "https://www.characterswiki.net/124325/pino-palladino-wiki-biography-age-height-wife-net-worth-family/", "page_content": "Pino Palladino Wiki Biography, Age, Height, Wife, Net Worth, Family\n\nAge, Wiki Biography and Wiki\n\nPino Palladino was born on 17 October, 1957 in Cardiff, United Kingdom, is a Welsh bassist and record producer from Cardiff. Discover Pino Palladino’s Wiki Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 63 years old?\n\nPopular As N/A Occupation N/A Age 64 years old Zodiac Sign Libra Born 17 October 1957 Birthday 17 October Birthplace Cardiff, United Kingdom Nationality United Kingdom\n\nWe recommend you to check the complete list of Famous People born on 17 October.\n\nHe is a member of famous Producer with the age 64 years old group.\n\nPino Palladino Height, Weight & Measurements\n\nAt 64 years old, Pino Palladino height is 6′ 8″ .\n\nPhysical Status Height 6′ 8″ Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is Pino Palladino’s Wife?\n\nHis wife is Marilyn Roberts (m. 1992)\n\nFamily Parents Not Available Wife Marilyn Roberts (m. 1992) Sibling Not Available Children Not Available\n\nPino Palladino Net Worth\n\nHis net worth has been growing significantly in 2020-2021. So, how much is Pino Palladino worth at the age of 64 years old? Pino Palladino’s income source is mostly from being a successful Producer. He is from United Kingdom. We have estimated Pino Palladino’s net worth, money, salary, income, and assets.\n\nNet Worth in 2021 $1 Million – $5 Million Salary in 2020 Under Review Net Worth in 2019 Pending Salary in 2019 Under Review House Not Available Cars Not Available Source of Income Producer\n\nPino Palladino Social Network\n\nTimeline"}, {"url": "https://www.celebsages.com/pino-palladino/", "page_content": "Birth Name: Pino Palladino Occupation: Bassist Born In: Wales, United Kingdom Birthdate: October 17, 1957 Age: 65 years old (as of 2023) Ethnicity: Unknown Nationality: Italian Sexuality: N/A\n\nPino Palladino was born on the 17th of October, 1957. He is famous for being a Bassist. He toured with Jeff Beck in 2006. Pino Palladino’s age is 65. John Entwistle’s replacement in the rock band The Who, as well as a member of the John Mayer Trio. The 65-year-old bassist was born in Wales, United Kingdom. He had his first professional gig at the age of twenty for a local television show and joined Jools Holland’s band. His fretless bass playing is featured on I, Assassin by Gary Numan, an album that helped him get more gigs playing with big names.\n\nCountdown to Pino’s next birthday.\n\nPino Palladino is a Libra and his 66th birthday is in .\n\nJUMP TO: Pino Palladino’s biography , facts , family , personal life , zodiac , videos , net worth , and popularity .\n\nChildhood\n\nPino Palladino was born in 1950s. The 1950s is often viewed as \"baby boom\" and a period of conformity, when young and old alike followed group norms rather than striking out on their own. The 50s were also the beginning of the Space Race, Cold War and the Civil Rights Movement. Discover what happened on this day.\n\nPino Palladino is part of the Baby boomers generation. Also known as \"boomers\", are the result of the end of World War II, when birth rates across the world spiked. They are associated with a rejection of traditional values. These hippie kids protested against the Vietnam War and participated in the civil rights movement.\n\nYou can also find out who is Pino Palladino dating now and celebrity dating histories at CelebsCouples.\n\nWhile we don't know Pino Palladino birth time, but we do know his mother gave birth to his on a Thursday. People born on a Thursday are naturally well-meaning and open. Luck is on their side.\n\n[fetch instagram=”” display=”posts” ]\n\nThe 65-year-old Italian was born in the Baby Boomers Generation and the Year of the Rooster\n\nEducation\n\nThe education details are not available at this time. Please check back soon for updates.\n\nFamily\n\nPino Palladino’s mother’s name is unknown at this time and his father’s name is under review. We will continue to update information on Pino Palladino’s parents.\n\nPersonal Life\n\nLike many famous people and celebrities, Pino Palladino keeps his personal life private. Once more details are available on who he is dating, we will update this section.\n\nFast Facts\n\nREAL NAME: Pino Palladino NICKNAME: Pino\n\nMARTIAL STATUS: Pending RELIGION: Unknown TATTOOS: N/A AGE GENERATION: Baby Boomers Generation BIRTH SIGN: Libra BIRTH DAY: Thursday DAYS SINCE BIRTH:\n\nNet Worth\n\nThe 65-year-old Italian bassist has done well thus far. Majority of Pino’s money comes from being a bassist. CelebsMoney has recently updated Pino Palladino’s net worth .\n\nVideos\n\nHoroscope\n\nZodiac Sign: Pino Palladino is a Libra. People of this zodiac sign like harmony, gentleness, sharing with others, the outdoors, and dislike violence, injustice, loudmouths, conformity. The strengths of this sign are being cooperative, diplomatic, gracious, fair-minded, social, while weaknesses can be indecisive, holding a grudge and self-pity. The greatest overall compatibility with Libra is Aries and Sagittarius.\n\nChinese Zodiac: Pino Palladino was born in the Year of the Rabbit. People born under this sign are honest, observant and hardworking. They seldom rely on other people in daily life, which can make them impatient when dealing with others.\n\n\n\n\n\nRuling Planet: Pino Palladino has a ruling planet of Venus and has a ruling planet of Venus and by astrological associations Friday is ruled by Venus. Venus is the planet of love, harmony, money and possessions. Venus is graceful, charming, sensual and social. People who are born with Mars as the ruling planet have beauty, charm and sensuality.\n\n[fetch instagram=”” display=”posts” show=”2″ ]\n\nPino Palladino’s birth sign is Libra and he has a ruling planet of Venus.\n\nDon’t miss\n\n– Who’s the richest Bassist in the world?\n\n– Pino Palladino Net Worth Stats\n\n– When is Pino Palladino’s birthday?\n\nAssociated with\n\nFans also viewed"}], "Pino Palladino is Welsh.": [{"url": "https://www.theguardian.com/music/2021/apr/06/pino-palladino-pop-greatest-bassist-adele-elton-the-who", "page_content": "By his own admission, Pino Palladino is not a man much accustomed to giving interviews. “Very reticent,” he nods during a Zoom call, his accent speaking noticeably louder of his childhood in Cardiff than his current home in LA. “You know, there was a time when I was featured in all sorts of musicians’ magazines, and then I just thought to myself, ‘Move over, there’s people out there that actually need the publicity.’ Not to blow smoke up my own arse,” he adds hurriedly, “but really I just didn’t want to see or hear from myself.”\n\nIt’s a remark in keeping with the astonishing career of one of the most celebrated bass players in the world. It’s hard not to blanche when you consider the sheer number of records that have been sold featuring his work. He played on not one but two of the biggest selling albums of the 21st century: Adele’s 21 and Ed Sheeran’s Divide, as well as with Rod Stewart, Elton John, Bryan Ferry, Simon and Garfunkel and Keith Richards. They’re the biggest names in a startlingly diverse back catalogue of collaborations: Palladino’s playing is the thread that links Perfume Genius with Phil Collins, Harry Styles with Chris de Burgh, and Nine Inch Nails with De La Soul. Indeed, his versatility and omnipresence is a running joke within the music industry. When another fabled bass player, Pink Floyd’s Guy Pratt, got married, he opened his groom’s speech with the words: “I’m only here today because Pino couldn’t make it.”\n\nFor a musician who seems to have turned up everywhere over the last 40 years, Palladino has remained a remarkably anonymous figure outside of musicians’ circles. Indeed, he somehow contrived to spend 14 years as a member of the Who without really losing what he calls an “invisible stance”. He certainly stands out in photographs of the Soulquarians, the experimental collective assembled by D’Angelo for his legendary album Voodoo, the solitary lanky Welshman among a crowd of African-American musicians including Questlove and the late J Dilla – but you would still struggle to recognise him in the street.\n\nCardiff’s finest … Palladino in 1985. Photograph: Paul Natkin/Getty Images\n\nThis is presumably how Palladino likes it. He’s drily funny and self-deprecating – he says his default setting when working with a new artist is “do not fucking spoil it” – but doesn’t seem terribly frustrated by life in the background. Which makes it all the more surprising that he’s releasing an album on which he shares billing with Blake Mills: Notes With Attachments, a fascinating, head-turning collection of experimental instrumentals that sits somewhere between jazz, global music and ambient. He and Mills, who has produced for Fiona Apple and Laura Marling, met while working on a John Legend album. “We hit it off and the next thing you know, he’s saying to me ‘Have you thought about a solo album?’ Well, I’ve thought about it, obviously,” he laughs. “For 40 years I’ve thought about it, but I’ve never really had an idea how I could do it.”\n\nStudded with guest appearances – from avant-garde saxophonist Sam Gendel and jazz drummer Chris Dave, among others – Notes With Attachments foregrounds the sound that made Palladino’s name: the none-more-80s sprrroing of the fretless bass put through a chorus pedal. He first used it while working with Gary Numan, but it was Paul Young’s 1983 hit Wherever I Lay My Hat that introduced it to a mass audience: pushed up in the mix, the bass effectively became a lead instrument. It was so striking that Palladino suddenly found himself playing with everyone from Go West and Don Henley to Tears for Fears: he turned up on Top of the Pops with alarming regularity, the musical equivalent of a hip item of designer clothing. “There was a lot of it around in those days,” he says of the sound. “I was so lucky – it resonated with people, captured their imagination and it took on a life of its own. It did get to the point where I was getting booked for sessions and feeling like a performing monkey: ‘Yeah, bring your fretless, make that funny sound and maybe we’ll get a hit out of it.’”\n\nHe also found himself becoming the sideman of choice for the rock aristocracy. “The first call I got like that was from David Gilmour. I could not believe it: am I going to the studio with this guy and pretend I actually belong there? I was nervous as fuck, but the drummer on the session was Jeff Porcaro [famed for playing with Toto and on Michael Jackson’s Thriller album], and he was really sweet: ‘Come on, man, chill out, have a smoke on this.’ So I did, and that seemed to work for me. I just had to keep that attitude through all of that period: phone calls from Elton John and Phil Collins – you have to keep that headspace that you belong, even if you think you’re going to be found out any minute.”\n\n‘You’ll have to play louder!’ … performing with the Who at the 2016 Desert Trip festival in California. Photograph: Kevin Mazur/Getty Images\n\nHe says another phone call, this time from D’Angelo – who had heard his playing on a BB King album – changed his life. “My roots are in Motown, reggae, R&B. I didn’t get much of an opportunity to express that side of music and then I met the don – how lucky was that? D’Angelo – I’d mention him in the same breath as Stevie Wonder and Donny Hathaway and Sly Stone. When I was in the studio with D and Questlove, James Poyser, all those guys, I don’t even have to think about what I’m playing. It’s incredible, to be a Welsh guy, having no real connections to these guys other than music that we loved and played. From a personal satisfaction point of view, it was as good as it ever got, probably will get.\n\n“It took people 10 years, 20, to really get the first album we made, Voodoo, but I absolutely knew it was unique and really special – I was probably more aware of it than the rest of them, because I’d been working for a long time. I knew this kind of thing didn’t come around very often.”\n\nThe Soulquarians went on to record with Erykah Badu, Mos Def and Talib Kweli; the influence of their loose approach can be heard on Kendrick Lamar’s epochal 2015 album To Pimp a Butterfly. They had just wrapped up a session with Common when Palladino learned that the Who’s bassist, John Entwistle, had died – and that the band had declined to cancel their forthcoming tour and wanted Palladino to replace him … on stage at the Hollywood Bowl, in two days.\n\n“I flew to LA, thinking, what are you doing? You don’t even know many Who songs. Pete Townshend was waiting for me at the hotel, with a big stack of CDs. ‘You don’t know much of the catalogue? Fair enough. You’re going to know it tonight, then, aren’t you?’ At the first rehearsal, Pete comes over and says: ‘You’re going to have to play louder’ – because I’m used to being the sympathetic musician, who fills in, doesn’t make a racket. That’s the one instruction you keep getting when you work with the Who: ‘Fucking turn it up, we can’t hear you!’”\n\nPalladino says he’s “not exactly crazy about touring any more” – he stopped playing live with the Who in 2016 – but is considering doing some gigs around Notes With Attachments, pandemic permitting. Until then, there are still sessions to attend to in LA, with Covid tests in the car park for anyone taking part. “Film and music studios are considered essential to the economy here – you’ve got to love that, right?” he laughs. “Mind you,” he says, “that’s better than Britain telling you if you’re a musician or an artist you might have to look for a new job.”"}, {"url": "https://www.musicradar.com/news/in-a-rare-interview-bass-legend-pino-palladino-reflects-on-replacing-the-whos-john-entwistle-on-two-days-notice", "page_content": "Welsh bass virtuoso Pino Palladino has enjoyed a prolific career as a session musician, recording with pop superstars such as Adele and Ed Sheeran, playing bass in The Who after John Entwistle's death, and collaborating with the likes of D'Angelo, John Mayer, Elton John and many more.\n\nWhat Palladino isn't is a prolific interviewee, preferring to let his bass guitar do the talking. But in an interview published today in The Guardian, he has spoken of the moment in 2002 when Pete Townshend called. John Entwistle had passed away: would Palladino fill in on the tour?\n\n“I flew to LA, thinking, what are you doing? You don’t even know many Who songs,“ said Palladino. Townshend was prepared, presenting him with a stack of CDs.\n\nThat’s the one instruction you keep getting when you work with the Who: ‘Fucking turn it up, we can’t hear you!‘\n\nAs a session player who had overcome imposter syndrome to sit in with the likes of David Gilmour and Elton John, there was no question Palladino would get The Who's set down pat. But only after some helpful advice from Townshend.\n\n“At the first rehearsal, Pete comes over and says: ‘You’re going to have to play louder’ – because I’m used to being the sympathetic musician, who fills in, doesn’t make a racket,“ said Palladino. That’s the one instruction you keep getting when you work with the Who: ‘Fucking turn it up, we can’t hear you!’”\n\nPalladino also speaks about his career through the 80s, when he was on speed dial for any pop star who needed some four-string flair in the low end. But in a career that saw him play on some of the top-selling albums of all time, Palladino considers his collaboration with neo soul pioneer D'Angelo, as bassist of the Soulquarians, the personal highlight.\n\n“D’Angelo – I’d mention him in the same breath as Stevie Wonder and Donny Hathaway and Sly Stone,“ said Palladino. “It’s incredible, to be a Welsh guy, having no real connections to these guys other than music that we loved and played.“\n\nPalladino has just released Notes With Attachments with the Californian guitarist and composer Blake Mills, available now through New Deal Records. You can read his interview with The Guardian here."}, {"url": "https://www.radioswisspop.ch/en/music-database/musician/113328f03f18e37f9ea1690603e52e56c3109", "page_content": "Giuseppe Henry \"Pino\" Palladino[1] (born 17 October 1957) is a Welsh bassist. A prolific session musician, he is probably best known for playing with The Who (following the death of founding member John Entwistle[2]) from 2002 to 2016, D'angelo from 1996 to present, and the John Mayer Trio from 2005 to present.\n\nPalladino plays a late-1970s, fretless, Music Man StingRay bass guitar, a fretted Fender Precision, and a Jaguar bass. His playing has earned him custom instruments bearing his name.[3]\n\nEarly life\n\nBorn in Cardiff to an Italian father from Campobasso and a Welsh mother,[4] Palladino began playing electric guitar at age 14 and bass guitar at 17. He bought his first fretless bass one year later, playing mostly R&B, funk, and reggae with a rock and roll backbeat.[5]\n\nCareer\n\nPalladino was drawn to Motown and jazz at an early age. He attended Catholic school and took classical guitar lessons. He liked Led Zeppelin and Yes and started a rock band.[6]\n\nIn 1982, Palladino recorded with Gary Numan on the album I, Assassin. The producer of the album asked him to contribute to Paul Young's debut album. Young's cover version of \"Wherever I Lay My Hat (That's My Home)\" by Marvin Gaye became a hit in Europe,and subsequently joined Young's band the Royal family and Palladino received offers to record with Joan Armatrading, Go West, and David Gilmour. He cites as early influences James Jamerson, Danny Thompson, and Norman Watt-Roy and also admires Jaco Pastorius, Stanley Clarke, Bootsy Collins, Larry Graham, Michael Henderson, Anthony Jackson, Marcus Miller, and Rocco Prestia.[7]\n\nIn 1983, he joined The Law with Paul Rodgers, formerly of Bad Company, and drummer Kenney Jones, who succeeded Keith Moon in The Who after Moon died, and recorded the album The Law.\n\nIn the 1990s, Palladino alternated between fretless bass and fretted and 4-string and 6-string bass. He played with Melissa Etheridge, Richard Wright, Elton John, and Eric Clapton.\n\nHe played on Mike Lindup's first solo album, Changes with Dominic Miller on guitar and Manu Katché on drums.[8]\n\nIn 1999, he began working with Richard Ashcroft of The Verve on Ashcroft's debut solo album, Alone With Everybody.[9]\n\nThe Who's bassist John Entwistle died the night before the start of their first tour in two years. Palladino became the band's bass guitarist on tour. In 2006, he joined the remaining band members on their first album in twenty-four years, Endless Wire. He played with The Who at the Super Bowl XLIV half-time show in 2010 with Simon Townshend on guitar, Zak Starkey on drums, and John \"Rabbit\" Bundrick on keyboards. In 2012, he toured with The Who on their Quadrophenia revival.\n\nPalladino met Steve Jordan in the mid-1980s while both were working as session musicians, which blossomed into a friendship. Jordan credits Palladino's apparent ability to \"feel\" changes in music, through melodies, basslines, and an embrace of genres of nearly every kind. According to Jordan, he had planned to meet up with John Mayer and Willie Weeks in January 2005 to perform Tsunami Aid: A Concert of Hope for victims of the tsunami that struck southeast Asia. Weeks was unable to make the performance, and Jordan suggested Palladino, who had heard some of Mayer's work and was willing to come. Beginning a set that included the Jimi Hendrix song \"Bold as Love\", the three found a chemistry together. They recorded an album and toured as a trio.[10]\n\nThey released the album Try!, on 22 November 2005. The eleven-track live album includes cover versions of \"Wait Until Tomorrow\" by Jimi Hendrix and \"I Got A Woman\" by Ray Charles, two songs from Mayer's album Heavier Things, and new songs by Mayer. In addition, Mayer, Palladino, and Jordan are credited as songwriters on three songs: \"Good Love Is on the Way\", \"Vultures\", and \"Try!\".[3] Palladino appeared on Mayer's third album Continuum, fourth album Battle Studies and seventh album The Search for Everything.\n\nIn March and April 2006, Palladino toured with Jeff Beck and played with J. J. Cale, and Eric Clapton on their 2006 album The Road to Escondido. In 2009, he formed a trio with keyboardist Philippe Saisse and Simon Phillips.\n\nHe played with Simon and Garfunkel on their Old Friends reunion tour.[10]\n\nIn January 2011, he entered the studio with D'Angelo to finish recording Black Messiah.[11]\n\nIn 2013 he played on the Nine Inch Nails album Hesitation Marks and was a member of the touring band.\n\nTechnique\n\nPalladino is noted for his use of the fretless bass on many 1980s albums. While it was typical for a bass guitar in a commercial track to have a rather generic sound and stay \"playing the low notes\", Palladino preferred a different sound, combining fretless tone with an octaver effect, and basslines that frequently added chords, lead lines, and counter melodies in the higher range of the instrument. Typical of this style was his playing on Paul Young's Wherever I Lay My Hat. His equipment at that time included a fretless Music Man StingRay Bass 1979 and Boss Octave pedal (OC-2).\n\nSignature model\n\nThe Fender Pino Palladino Signature Precision Bass is modelled after two of Palladino's Fender Precision Basses. The body features faded fiesta red paint over desert sand paint, based on Palladino's 1961 Precision Bass, while the neck shape and round-lam rosewood fretboard are based on his 1963 sunburst Precision Bass.[12]\n\nPersonal life\n\nPino married Marilyn (Maz) Roberts, a former backing singer with the Fabulous Wealthy Tarts, in 1992 in Wales. They have three children: Fabiana, Giancarla and Rocco, who are all involved in the music industry.[13]\n\nSelect discography\n\nWith Paul Young\n\n1983 No Parlez (Columbia)\n\n(Columbia) 1985 The Secret of Association (Columbia)\n\n(Columbia) 1990 Other Voices (Columbia)\n\nWith David Knopfler\n\n1983 Release (Peach Tree)\n\n(Peach Tree) 1985 Behind the Lines (Paris)\n\n(Paris) 1987 Cut the Wire (Paris)\n\nWith Don Henley\n\n1984 Building the Perfect Beast (Geffen)\n\n(Geffen) 1989 The End of the Innocence (Geffen)\n\nWith Go West\n\n1985 Go West (Chrysalis)\n\n(Chrysalis) 1987 Dancing on the Couch (Chrysalis)\n\nWith Elton John\n\n1985 Ice on Fire (Rocket/Geffen)\n\n(Rocket/Geffen) 1992 The One (Rocket/MCA)\n\nWith John Mayer\n\n2005 Try!\n\n2006 Continuum\n\n2017 The Search for Everything\n\nWith Jeff Beck\n\n1999 Who Else! (Epic)\n\n(Epic) 2006 Official Bootleg USA '06\n\n2010 Emotion & Commotion\n\nWith D'Angelo\n\n2000 Voodoo (Virgin)\n\n(Virgin) 2014 Black Messiah (RCA)\n\nWith The Gaddabouts\n\n2011 The Gaddabouts\n\n2012 Look Out Now!\n\nWith The Who\n\n2006 Endless Wire (Polydor)\n\n(Polydor) 2014 Quadrophenia Live in London (Universal)\n\n(Universal) 2015 Live in Hyde Park (Eagle Rock / Universal)\n\n(Eagle Rock / Universal) 2017 Live at the Isle of Wight 2004 Festival (Eagle Rock / Universal)\n\nWith others\n\nReferences"}, {"url": "https://www.udiscovermusic.com/stories/pino-palladino-interview/", "page_content": "Photo: Cedric Ribeiro/Getty Images\n\n“All musicians are the same, we all think we’re rubbish,” Pino Palladino told a British television interviewer in 2013, adding a gentle laugh. It was a typically massive understatement from the quietly affable Welsh bassist, among the highest-regarded session players in the music industry. In this case, Palladino was referring to hearing Paul Young’s “Wherever I Lay My Hat” on the radio for the first time in 1983 – particularly his casual contribution, one of the most recognizable bass lines of the 1980s. “I was worried that it sounded a bit out of tune,” he said.\n\nIn a decades-long career, Palladino has not only provided low-end support for several musical revolutions, he’s helped stoke a few of them himself, undergirding pioneering sounds in pop, New Wave, neo-soul, electronic, rock, jazz, funk, and even industrial with an ever-inventive foundation. He’s widely regarded as one of the most influential bass players ever, with just as much name recognition in certain quarters as the superstars he’s backed.\n\nBeginning with Gary Numan in 1982 and continuing through work with artists like Young, Phil Collins, Tears for Fears, Go West, and Chris de Burgh, Palladino helped define the coolly emotive 80s sound with his trademark fretless technique. In the 1990s he backed Elton John, Eric Clapton, Carly Simon, Bryan Ferry, Joan Armatrading, B.B. King, and many more, before joining the legendary Soulquarians artists collective, reviving cosmic soul and funk sounds with Erykah Badu, D’Angelo, Questlove, and J. Dilla.\n\nADVERTISEMENT\n\nFrom there, it was on to stints with Mika, Nine Inch Nails, Adele, Kelly Clarkson, Paul Simon, and Keith Urban, among a wealth of others, as he also embarked on longtime touring associations with Jeff Beck and John Mayer. Palladino’s most famous stretch came with The Who, when he stepped in after John Entwistle’s untimely death in 2002 to tour and record for two decades, playing probably the most famous bass solo in pop – 1965’s “My Generation” – for arena-sized crowds. Most recently, he’s played for Harry Styles, Ed Sheeran, Corinne Bailey Rae, and John Legend. You can’t talk about Pino Palladino without mentioning a few names.\n\nNow, at last, Pino Palladino is releasing an album of his own, collaborating with guitarist Blake Mills. Called Notes with Attachments, the record summons intimate, cinematic moods, bristling with sophisticated patterns, atmospheric woodwinds, and surprising electronic touches. It’s a compendium of several decades’ worth of Palladino’s compositional ideas, complex, and contemporary yet warm with nostalgia – paying homage to the classic film soundtracks, cool jazz, and Burt Bacharach arrangements he loves.\n\nIn honor of the new release, we accompanied the lauded bassist on a trip down memory lane, revisiting some of his best-known album and tour appearances.\n\nTear for Fears, Seeds of Love (1989)\n\nPino Palladino: I have a lot of great memories of that album, not least because my daughter Fabiana was born around the time we were recording it. My life was changing in a big way. I had been doing a lot of session work with the French drummer Manu Katché, who toured with Peter Gabriel. We were becoming known as a rhythm section together, and a bit in demand. I believe that’s how Roland Orzabal heard of us and invited us onto the album.\n\nThe actual recording was unusual for the time; the tracks were cut live with a full band. We holed up together for a few weeks in Townhouse Studios in London, and went through each of the songs, experimenting with instrumentation and arrangement. There were some days when we just jammed and extended parts of the songs. Roland then took the whole bundle and edited it down into what you hear on the album. We must have recorded “Badman’s Song” and “Woman in Chains” a dozen different ways with different transitions. Roland’s choices and his taste as the composer, defined the amazing end results.\n\n\n\nWatch this video on YouTube Click to load video\n\nOne of my fondest memories: When I first got there, I was going into the control room and I heard this incredible piano-playing in the studio. I was wondering, “Who is that?” I went round the corner and there was Oleta Adams, sitting at the grand piano and singing so beautifully, jamming away on gospel and blues. I’m honored to have played on her solo album Circle of One.\n\nThe Seeds Of Love can be bought here.\n\nElton John, The One (1992)\n\nPino Palladino: We recorded in Paris at Studio Guillaume Tell. Well, the food in Paris was excellent. We would end every day going out to dinner at high-end restaurants with the table piled up with dishes. It was really something to keep up with…but I rose to the challenge!\n\nWorking on that record and spending time with Elton was humbling. I remember one day, Bernie Taupin faxed some song lyrics over in the morning, and Elton took them into the next room and had an amazing song written within an hour…incredible! At this time I was really known for my fretless bass sound, it was something people specifically hired me for. Elton encouraged me to develop my ideas for the basslines and let me do my thing on the record.\n\n\n\nWatch this video on YouTube Click to load video\n\nErykah Badu, Mama’s Gun (2000)\n\nPino Palladino: This was during the Soulquarians period, it was a real fun time. I made the connection because Ahmir [“Questlove” Thompson] had called me in to add to one of the songs he was working on. We thought I would just overdub the bass on one track, but it felt really good and we built up a vibe. Erykah had booked time at The Lady and we reconvened at a later date.\n\nErykah’s way of working was refreshing. For Mama’s Gun, Erykah had sketched out a couple ideas for the album, and had a vision of what she wanted, but otherwise it was pretty undetermined at that point. We all assembled, the whole band, and Erykah just came around, so cool in her way, and asked “OK, Pino, what you got?” That was it. “What you got?” We played around with some different ideas, and it turned into a collaboration, developing the songs together. I played a bassline I had in my mind for a while, and that became the first song on the album, “Penitentiary Philosophy.”\n\nOddly enough, it reminded me of when I was getting started, working with Gary Numan on the I, Assassin album in 1983. Back then, I showed up and Gary had recorded his songs but didn’t have bass parts on them. He wanted me to come up with ideas and gave me complete freedom to compose the parts for the songs. I played my fretless bass and that sound became the sonic signature for the record. What made it different with Erykah, is that this time I got a songwriting and production credit.\n\nListen to Mama’s Gun here.\n\nD’Angelo, Voodoo (2000)\n\nPino Palladino: Being a part of that moment when this album and Mama’s Gun came out almost back to back was thrilling. After meeting D on a session with B.B. King, he invited me to meet him and his engineer, Russ Elevado, at Electric Lady Studios with a view to me playing some bass on the songs for his upcoming record, Voodoo.\n\nWhen they played some of the songs for me, I was mesmerized by the unique feel of the grooves and D’s otherworldly vocal arrangements. D’Angelo had written the songs for Voodoo at the keyboard and while his left hand would play what would become the blueprints for the basslines, his right hand plays the chords and flourishes that accompany the main melody. It all fits together in such a unique way… The basslines are woven into the fabric of the composition from the start.\n\n\n\nWatch this video on YouTube Click to load video\n\nAlthough some songs were established when I got there, others were left more open to develop ideas and for me, some freedom of expression, from adding in passing notes to flurries up to the top of the bass neck to complement his vocals. Because the album is so bass- and rhythm-driven, everything mattered, it was all at the top of the mix, he encouraged me to bring my thing to the music and, through him, I met Erykah, Quest, James Poyser, Roy Hargrove, J Dilla, Common, and all the Soulquarian collective.\n\nListen to Voodoo here.\n\nAdele, 21 (2011)\n\nPino Palladino: I was back in London when [producer] Rick Rubin reached out to me about recording a new album for Adele. She had already made a name for herself in the UK before she broke worldwide, so I had heard of her. Rick told me, “I want to get you into this fantastic band, with drummer Chris Dave, Matt Sweeney and Smokey Hormel on guitars, James Poyser on piano, and really give her the strong backing she deserves.” I flew out to Shangri-La studios in California where they were recording, and she just killed it on the vocals from the start. I remember hearing her voice for the first time through my headphones and being blown away by how she could sing. The songs were really great and I knew we were recording something special.\n\nMika, The Origin of Love (2012)\n\nPino Palladino: Mika has certainly got some incredible energy, he would bounce around the studio with all these ideas. Mika brought a lot of curiosity to the process, he would come up with things while I was playing. He was interested to hear fretless bass on some of the songs and liked how it fitted in. I believe I was hooked up with him through Nick Littlemore from Empire of the Sun. Working on a more electronic-oriented pop album was interesting. It’s great to get the opportunity to expand what you do, and try out different directions.\n\n\n\nWatch this video on YouTube Click to load video\n\nNine Inch Nails, Hesitation Marks (2013)\n\nPino Palladino: Trent [Reznor] reached out to me, out of the blue, and asked if I would be interested in collaborating on a couple of tracks for the album. I was really curious how I would fit in with his sound. Trent is a very good communicator, with clear ideas. He is a fan of Voodoo and of Gary Numan, so for me that was interesting as I could maybe bring two different sides of my playing to the music. I played a couple of takes on each song and just did my thing. Later, Trent’s manager called and asked if I would be interested in touring. It turned out that the band had already been rehearsing for a month. It was a real challenge to learn the songs in a short amount of time before we went on the road. And I had no idea how his fans would react to me. But Trent gave me a lot of room, and that ended up being a memorable tour. The whole band was so tight, and the light show, along with the visual effects, was on another level from anything I’ve been a part of.\n\nThe Who, Endless Wire (2006) and touring after John Entwistle’s death\n\nPino Palladino: In 2002, I was working on Common’s Electric Circus album and I was about to fly home to London from Philadelphia, when my wife called me at the hotel and said, “You just got a call from the Who’s management” She gave me the tragic news that John Entwistle had just died, and they wanted to know if I could step in so they could continue the tour. There was going to be a concert at the Hollywood Bowl a few days later. After speaking to their management, I flew to LA later that day to rehearse for the gig and the following tour.\n\nI had spent some time with John. He was smart, funny, charismatic. He was a superstar. And, of course, an idol as far as bass-playing goes. I had worked with Pete [Townshend] as well, and Roger [Daltrey]. When I flew into LA, Pete was waiting for me at the hotel with a stack of CDs. “Just learn what you can,” he told me. Stylistically, I was not in that space at all at the time – I was doing hip-hop, funk, soul. So it was a complete reset for me. The first thing I did was change the strings on my bass to get a brighter sound, like John had. I pretty much didn’t sleep that night, and learned as much as I could. I think I pulled it off, because they kept me on!\n\nI just worked on their recent record [2019’s WHO]. Endless Wire was the first studio record they made after John’s tragic death, and that was less of a “band” experience. Pete had done a number of demos, obviously some with John in mind to a certain degree. I’d ask Pete if I was doing all right, and he would turn to me and say, “Play more.” He didn’t elaborate, just “play more.” And I understood. Some people would think of it as overplaying, but the classic sound of The Who is Keith Moon on drums and John Entwistle on bass just making this unholy racket. So that’s what I aimed for.\n\n\n\nWatch this video on YouTube Click to load video\n\nHarry Styles, “Watermelon Sugar” (2020)\n\nPino Palladino: I was rehearsing with John Mayer at Henson Studios in Hollywood, which was the former A&M Studios, and before that the Charlie Chaplin Studios. Beautiful history there. Harry was recording in the same studios, down the hall. John knew him and introduced me to Harry. Harry and his producers played me a few songs to see which ones I felt I could add to, including “Watermelon Sugar.” If you listen to the bass line in that song, it’s very well-defined and echoed by the guitar line. There wasn’t really a lot of room to move. Well, I started getting a little free with it, trying stuff, and Harry jumped up and said, “That! Can you do more of that?” It’s an honor that I get invited to play on these songs. It’s going to be a hit with or without me. So I feel very fortunate to be asked to contribute.\n\nPino Palladino and Blake Mills, Notes With Attachments (2021)\n\nPino Palladino: This record is a culmination of what I’ve been thinking about through much of my career. I’ve been recording many of these ideas over a long period of time as I’ve toured and collaborated with many musicians and artists that I admire. What interested me in making my own album was having the chance to focus on compositional elements, rather than the bass taking the lead. Maybe some listeners have been surprised that there are woodwinds and other instruments in the foreground. It’s not me showing particular prowess on my instrument, but to define the role of the bass as a signature part of a song is the challenge I enjoy. I’ve always loved instrumental music, from jazz to film soundtracks. I want my music to invoke some of those qualities.\n\nSome of the ideas on the album evolved from my time touring with D’Angelo and the Soultronics, that kind of beat-driven music, but with beautiful elements and touches, but also from many other types of music that I love. When I played some of these ideas originally for Blake, he was very encouraging and, as we started working on the songs, it quite naturally became a collaboration. Blake, along with all the incredible musicians on the record, have all given so generously to the project, I’m very fortunate to have had the opportunity to make this album. It’s a very interesting process for me, having my own music released. It feels like part of my DNA is suddenly out there. The album was recorded two years ago. But people have told me that it speaks to the moment, that they’re listening to it through this complex time and enjoying it. That’s really nice to hear.\n\nListen to Pino Palladino and Blake Mills’ Notes with Attachments here."}, {"url": "https://allstarbio.com/pino-palladino-biography-net-worth-birthday-height-weight-ethnicity-girlfriend-wife-affair-married-fact/", "page_content": "Quick Facts of Pino Palladino Full Name Pino Palladino\n\nNet Worth $40 million\n\nDate of Birth 17 October, 1957\n\nMarital Status Married\n\nBirthplace Cardiff, Wales\n\nEthnicity Mixed\n\nProfession Bassist\n\nNationality British, Italian\n\nEye colour Dark Brown\n\nHair colour Dark Brown\n\nBuild Athletic\n\nSpouse Fabulous Wealthy Tarts Marilyn (Maz) Roberts\n\nHeight 6 feet 8 inches\n\nEducation Catholic school\n\nOnline Presence Twitter, Facebook\n\nChildren 3\n\nHoroscope Libra\n\nShort Description of Pino Palladino:\n\nPino Palladino is a well-known bassist from Welsh, who played with The Who from 2002 to 2016. Apart from it, Pino has played for Simon and Garfunkel and Nine Inch Nails.\n\nPino Palladino’s Early Life and Education\n\nBack to his early life, Pino first opened his eyes on October 17, 1957, in Cardiff, Wales. He is the son of Ann Hazard and Umberto Palladino.\n\nPalladino holds the dual nationality of British and Italian nationality and belongs to the mixed ethical society of Italian and Welsh. Regarding his education, he joined Catholic school and took classical guitar lessons.\n\nPino Palladino’s Career\n\nIn 1982, he recorded with Gary Numan on the album I, Assassin and started his career and in 1983, he joined The Law. Palladino has worked and played with Elton John, Richard Wright, Eric Clapton and Melissa Etheridge.\n\nPino has released three albums, ‘No Parlez’, ‘The Secret of Association’ and ‘Other Voices’ with Paul Young. Paul has joined the tour with Simon and Garfunkel and played for them. Apart from it, Pino has appeared in Quadrophenia: Live in London and Great Performances.\n\nPino Palladino’s Personal Life\n\nMoving towards her personal life, Pino Palladino is a married man and he is married to the former backing singer with the Fabulous Wealthy Tarts Marilyn (Maz) Roberts. They tied the knot in 1992 in Wales. They are parents of three children, Fabiana, Giancarlo, and Rocco.\n\nTheir relationship is going well and there are no rumors of them getting divorced.He has successfully maintained his personal and professional life and is away from any notable controversies yet.\n\nPino has a straight sexual orientation. Pino is active on Twitter with 2K followers. Similarly, he is active on Facebook with more than 2K followers.\n\nPino Palladino’s Statistics\n\nMentioning his physical features, Pino Palladino has a height of 6 feet 8 inches tall with a mass equivalent to it. He has dark brown eyes and hair colors.\n\nPino Palladino’s Net Worth\n\nPino has a net worth of around $40 million dollars.\n\nYou Also May Like:"}, {"url": "https://welshicons.org/wici/html/pino_palladino.php", "page_content": "Pino Palladino\n\nPino Palladino (born on October 17, 1957 in Cardiff, Wales, UK) is a noted rock and rhythm and blues electric bass player of Italian ancestry.\n\n\n\nBackground\n\nPalladino began playing bass in 1973, having played the electric guitar for some time before that. His first professional gig was at a local television station, where he began playing in 1978. In 1980, he joined the band of Jools Holland and appeared on the album Jools Holland and the Millionaires.\n\n\n\nIn the 1980s, Palladino became famous playing the fretless bass with many artists including Gary Numan, Paul Young, Richard Ashcroft, David Gilmour, Tears for Fears, and Don Henley. In the 1990s, he favoured fretted basses with Melissa Etheridge, Richard Wright, D'Angelo, Elton John, and Eric Clapton. Also in 1991 he joined Paul Rodgers of Bad Company fame, to form the band The Law.\n\n\n\nRecently he became a touring member of The Who, after the death of John Entwistle. He, along with Phil Collins, was a member of the house band for the Golden Jubilee of Elizabeth II, which played with Paul McCartney, Eric Clapton, Cliff Richard, and Tony Bennett, among others. As of the spring of 2006, Palladino was touring with Jeff Beck.\n\n\n\nIn 2003, he played with Simon and Garfunkel on their \"Old Friends\" reunion tour and he appears on the Old Friends: Live on Stage CD and DVD from the tour. He also plays on Paul Simon's 2006 release, Surprise.\n\n\n\nHe also has worked in the John Mayer Trio with John Mayer and Steve Jordan.\n\n\n\nAfter John Entwistle died, Palladino became the fulltime touring bass guitarist for The Who and recorded some of the bass parts for The Who's first album in twenty-four years, which was released in October 2006, called Endless Wire.\n\n\n\nHe also played on J.J. Cale and Eric Clapton's album The Road to Escondido, which was released November 7, 2006.\n\n\n\nTechnique\n\nPino Palladino is considered one of the most noteworthy rock and pop session bass players due to his pioneering use of the fretless bass in many 1980s chart records. While it was typical for a bass guitar in a commercial track to have a rather generic sound and stay \"playing the low notes\" Palladino turned this on its head with a very recognizable personal sound (combining fretless tone with a octave effect) and highly creative basslines that frequently added chords, lead lines and counter melodies. Typical of this style was his playing on Paul Young's biggest chart hits, in particular his iconic introductory bass solo on Wherever I Lay My Hat (That's My Home). His equipment at that time included a fretless Music Man StingRay and Boss Octave pedal (OC-2).\n\n\n\nThe Fender Pino Palladino Signature Precision Bass is modeled after two of Pino's Fender Precision basses. The body featuring faded fiesta red paint over desert sand paint is based on Pino's 1961 Precision Bass while the neck shape and round-lam rosewood fret board are based on Pino's 1963 sunburst Precision Bass."}, {"url": "https://www.celebsagewiki.com/pino-palladino", "page_content": "Age, Biography and Wiki\n\nPino Palladino was born on 17 October, 1957 in Cardiff, United Kingdom, is a Welsh bassist and record producer from Cardiff. Discover Pino Palladino's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 65 years old?\n\nPopular As N/A Occupation N/A Age 65 years old Zodiac Sign Libra Born 17 October 1957 Birthday 17 October Birthplace Cardiff, United Kingdom Nationality United Kingdom\n\nWe recommend you to check the complete list of Famous People born on 17 October. He is a member of famous Producer with the age 65 years old group.\n\nPino Palladino Height, Weight & Measurements\n\nAt 65 years old, Pino Palladino height is 6′ 8″ .\n\nPhysical Status Height 6′ 8″ Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is Pino Palladino's Wife?\n\nHis wife is Marilyn Roberts (m. 1992)\n\nFamily Parents Not Available Wife Marilyn Roberts (m. 1992) Sibling Not Available Children Not Available\n\nPino Palladino Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Pino Palladino worth at the age of 65 years old? Pino Palladino’s income source is mostly from being a successful Producer. He is from United Kingdom. We have estimated Pino Palladino's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Producer\n\nPino Palladino Social Network\n\nTimeline"}, {"url": "https://www.allaboutjazz.com/musicians/pino-palladino", "page_content": "Pino Palladino was featured on Gary Numan's 1982 album I, Assassin, in which his fretless bass sound made a prominent contribution to the overall sound of the album. He went on to play fretless bass with a healthy number of high-profile artists that include (on the short list), David Gilmour, Tears for Fears, Pete Townshend, Peter Gabriel, Joan Armatrading, Phil Collins, Chaka Khan and Don Henley.\n\nPalladino began playing the electric guitar at age 14. By age 17 he decided to play the bass guitar, and bought his first fretless bass one year later, playing mostly R&B, funk, and reggae within a rock and roll backbeat. His first professional gig was at a local television station in Cardiff, where he began playing in 1978. That same year, at age 20, he joined Jools Holland's band and recorded with Holland on his album entitled, Jools Holland and His Millionaires. Palladino toured with Jools to support the album, which gave him the opportunity to purchase his own Music Man StingRay Fretless Bass. Holland was touring with another new band; the Q-Tips, whose frontman, Paul Young made acquaintance with Palladino whilst they were on tour, who would, a year later offer Pino a place in his own backing band.\n\nPalladino has joined several bands and ensembles through which he is most visible. He joined jazz trumpeter Roy Hargrove in forming The RH Factor, a band that mixes elements of soul, jazz, and R&B. He is a member of the John Mayer Trio, and was the first choice by Pete Townshend and Roger Daltrey to fill the position left by John Entwistle as the current bassist for The Who.\n\nPino Palladino (17 October 1957 in Cardiff, Wales, UK) is a Welsh bass guitarist of Italian ancestry. Palladino rose to public notice playing primarily rock and roll, blues rock, and rhythm and blues music, although he has been lauded for his ability to play most genres of popular music, including jazz, neo soul, and funk. Adding to his eclectic grasp and melodic approach on his instrument, he has become one of the most sought-after session players on the bass in the music industry. He has played on a large number of recordings by some of the world's most successful entertainers, in part, by mastering a variety of techniques on both his late 1970s fretless Music Man StingRay bass guitar and later in his career, adding fretted Fender Precision and Jaguar basses. His playing has earned him custom instruments bearing his name.\n\nAfter vocalist Paul Young landed his own solo contract, Palladino was brought in as part of his backing band \"The Royal Family\" in 1983 with noticeable chart success with the No Parlez album, and major hit singles both in the UK and Europe. Examples of Young's new found success were the band's cover of the Marvin Gaye classic \"Wherever I Lay My Hat (That's My Home)\", which reached No. 1 in the UK singles chart for three weeks in the summer of 1983, and \"Love of the Common People\". Palladino toured extensively at this time with Paul Young, remaining in the band for five years. 1983 additionally proved to be the year of another ensemble featuring Palladino, Paul Rodgers (formerly of Bad Company, drummer Kenney Jones, along with a rotating cast of other celebrity performers. The band only released one album through Atlantic; The Law, although there were enough out-takes that another bootleg-styled album followed in 1991. Sales were unremarkable, despite the names of those who recorded on the album.\n\nThroughout the 1980s Palladino was noted for his R&B roots on the fretless bass, even when supporting pop and rock heavy performers. One reviewer from Bass Player magazine points to Paul Young’s cover of the Bobby Womack/Rufus tune \"Stop On By\" (on 1990’s Other Voices), with its \"pre-hip-hop, swung funk groove\" as the precursor to Palladino's later neo-soul focus.\n\n1990s Changes in instrument\n\nIn the 1990s, Palladino began to alternate between the sounds achieved in playing the fretless bass to one with frets, as well as the 4-string and 6-string bass. At the time, he was well known within the industry for his fretless bass sound. However, now, depending on which artist he was supporting, and the song to be played, he began gravitating towards fretted bass. He was maturing as a musician, and played with artists as diverse as Melissa Etheridge, Richard Wright, Sir Elton John and Eric Clapton. Also in 1991 he joined Paul Rodgers (of Free, Queen+ Paul Rodgers, and Bad Company fame) to form the band The Law. In the mid 1990's, Palladino played bass for The London Metropolitan orchestra during their recording of \"An American Symphony\", soundtrack for the movie Mr Hollands Opus.\n\nPalladino supported Phil Collins, as a member of the house band for the Golden Jubilee of Elizabeth II, which played with Sir Paul McCartney, Eric Clapton, Cliff Richard, and Tony Bennett, among other notable performers. He later wrote that he felt privileged to have been amongst the others on stage in such an event.\n\nIn 1999, he began working with Richard Ashcroft, of The Verve, during the recording sessions of Ashcroft's debut solo album, Alone With Everybody. Richard proved to be mightily impressed by Pino's natural bass playing ability;\n\nThis Pino Palladino, I can say a Meters record and he can play me the bass line. He can play anything. He's one of the only people in the world who can totally replicate that kind of Beach Boys/scratch/Walker Brothers bass. You can get that sound if you want it, dead on. So it was very liberating working with him.\n\nPino also joined Ashcroft's touring band for the singer's first major solo outing throughout 2000.\n\nNeo Soul\n\nBy the mid- 1990s, Palladino had established himself as a busy, highly desirable bassist and a studio worker in many genres, but finally became visible to those artists who played largely left of center, and demand for his session playing grew within a different quarter. Palladino began moving from blues-rock toward neo soul projects. Palladino and Steve Jordan found themselves performing on the same session for B.B. King’s 1997 duets CD Deuces Wild. It was the first time soul singer D'Angelo first heard Palladino, who had just switched from a signature sound fretless bass sound to that of performing with fretted basses. The result was an invitation to \"use Pino’s big, behind-the-beat bass to help cast a neo-soul spell on his Grammy Award-winning Voodoo album\". It would not be his first uncredited Grammy performance.\n\nAs the word spread throughout the genre, Palladino found an increasing demand within the neo-soul genre. Examples of his bass work in this genre (in addition to D'Angelo) includes Mama's Gun, and \"Penitentiary Philosophy\" found on Erykah Badu’s 2000 CD. Other albums using Pino's sound include 1st Born Second for Bilal, Like Water for Chocolate and Electric Circus for Common. Palladino has been described by Steve Jordan, who got his own professional start playing the drums for Stevie Wonder as having a \"deep funk\" side and a \"melodic\" side. Palladino admits, that \"Of all my influences, I would say what’s always in the back of my mind is early Stevie Wonder, like Talking Book and Innervisions; that music is really in my blood.\"\n\n2000s\n\nFollowing the death of The Who's bassist John Entwistle in 2002, the eve before the band were to kick off their first world tour in years, Palladino was their first choice to become the band's full-time touring bass guitarist, and by 2006, he was invited to join the remaining original band members in recording their first album in twenty-four years. Pete Townshend, the band's composer, recorded the bassline on the majority of the songs to get the effect he himself wanted, with Palladino doing so on the other six of them. Released in October 2006, the album was named Endless Wire.\n\nPalladino also recently played with The Who at the Super Bowl XLIV half-time show, in February, 2010, alongside other backing artists: Simon Townsend on guitar, Zak Starkey, drums and percussion, and John \"Rabbit\" Bundrick, on keyboard instruments.\n\nPaul Simon\n\nIn 2003, Palladino intended to go down to see his old friend Paul Simon and meet Brian Eno for the first time. He was asked to record with them, and had to borrow a bass guitar to play. The result was that he played with Simon and Garfunkel on their \"Old Friends\" reunion tour and in an interview with Bass Player Magazine he mentions drummer Steve Gadd and percussionist Jamey Haddad \"had laid down some great grooves for me to add bass\". He had kept the recordings, and by the time that he appeared on the Old Friends: Live on Stage CD and DVD from the tour, he was able to use some of the material. He played on Paul Simon's 2006 release, Surprise.\n\nOther appearances\n\nPalladino has toured in the backing band for Joe Walsh. In 2004 he appeared to be playing with Gary Moore at the Wembley Arena.\n\nEmergence of the John Mayer Trio\n\nPalladino met Steve Jordan in the mid-1980s while both were working as session players on many occasions, which blossomed into a friendship. When their work brought them to the same place, they would meet, usually jam together, and introduce other musicians to one another, forming friendships which sometimes blossomed into good working relationships. Jordan has remained keen about Pino since he met him, and only grows more enthusiastic about his talents, which he describes partly as his love for, and ability to \"feel\" changes in music, through melodies, basslines, and an amazing connection with genres of nearly every kind. According to Jordan, he'd planned to meet up with John Mayer and Willie Weeks in January, 2005 to perform a benefit concert on a NBC sponsored telethon Tsunami Aid: A Concert of Hope to raise funds and public awareness benefiting victims in the aftermath of the tsunami that struck southeast Asia. Weeks was unable to make the performance, and Jordan suggested Palladino, who had heard some of Mayer's work, and was willing to come. Beginning a set that included the Jimi Hendrix classic, \"Bold as Love\", the three all agreed that they experienced such chemistry that they began talking right away about arranging their schedules to record a CD and a tour. The trio released the album Try!, on November 22, 2005. The eleven-track live album includes cover songs, such as Jimi Hendrix's \"Wait Until Tomorrow\" and \"I Got A Woman\" by Ray Charles, two songs from Mayer's release Heavier Things, as well as new songs written by Mayer. In addition, Mayer, Palladino, and Jordan wrote three songs on the album: \"Good Love Is On The Way\", \"Vultures\", and \"Try!\". Along with John Mayer on guitar and vocals, and Steve Jordan on drums, Palladino has toured and recorded as a member of the John Mayer Trio, and on Mayer's third album Continuum.\n\nRecent tours\n\nIn spring of 2006, Palladino toured with Jeff Beck. He also played with J. J. Cale, and Eric Clapton on their 2006 album The Road to Escondido, alongside other notable musicians, including Derek Trucks, and Billy Preston. It was to be Preston's last work before he died only days afterward.\n\nInfluences on bass guitar\n\nInfluences for Palladino for bass guitar include Motown bassist James Jamerson; Stevie Wonder’s keyboard-bass, jazz innovator Jaco Pastorius; British folk/rock upright bassist Danny Thompson; Norman Watt-Roy (of Ian Dury & the Blockheads); Larry Graham; Michael Henderson; Bootsy Collins; Paul Jackson; Anthony Jackson; Doug Rauch (of Carly Simon and Santana), and Billy Cobham.\n\nTechnique\n\nPino Palladino is noted for his use of the fretless bass in many 1980s chart records. While it was typical for a bass guitar in a commercial track to have a rather generic sound and stay \"playing the low notes\" Palladino preferred a different sound (combining fretless tone with an octave effect) and basslines that frequently added chords, lead lines and counter melodies in the higher range of the instrument as opposed to simply the aforementioned \"low notes\". Typical of this style was his playing on Paul Young's biggest chart hits, in particular his bass solo on \"Wherever I Lay My Hat (That's My Home)\". His equipment at that time included a fretless Music Man StingRay Bass 1979 and Boss Octave pedal (OC-2).\n\nPino Palladino signature model\n\nThe Fender Pino Palladino Signature Precision Bass is modeled after two of Pino's Fender Precision Basses. The body featuring faded fiesta red paint over desert sand paint is based on Pino's 1961 Precision Bass while the neck shape and round-lam rosewood fret board are based on Pino's 1963 sunburst Precision Bass.\n\nRecent projects\n\nPalladino joined Eric Clapton's touring band for 11 dates in the Eastern U.S. and Canada in May 2008. Current work has included work on an with Clapton and Robbie Robertson, and Palladino guested on bass for Amos Lee on his third album, Last Days at the Lodge.\n\nIn 2009, Palladino joined with keyboardist Philippe Saisse and Simon Phillips to form an instrumental trio: Phillips Saisse Palladino, an instrumental jazz/funk rock ensemble, which have toured Europe through 2009 into 2010, playing songs that spotlight the talents of each performer, in the manner of many jazz outfits. Show less"}, {"url": "https://www.allmusic.com/artist/pino-palladino-mn0000292499/biography", "page_content": "Biography Pino Palladino Follow Artist +\n\nSince the 1980s, this session and live bassist is among the most prolific, gifted, and sought after by musicians of all genres.\n\nRead Full Biography"}, {"url": "https://en.unionpedia.org/i/Pino_Palladino", "page_content": "Pino Palladino Giuseppe Henry \"Pino\" Palladino (born 17 October 1957) is a Welsh bassist. [1]\n\n299 relations: A Celebration: The Music of Pete Townshend and The Who, About Face (album), Alone with Everybody, Andy Fairweather Low, Annual John Mayer Holiday Charity Revue, Another World (Gerry Rafferty album), At World's Edge, Back Home (Eric Clapton album), Back to the Who Tour 51!, Bad Love (Eric Clapton song), Bankstatement, Bass guitar, Bassist, Battle Studies (album), Be Lucky, Beauty (Ryuichi Sakamoto album), Behind the Lines (David Knopfler album), Belief (song), Between Two Fires (album), Bill Bruford, Black Messiah (album), Blink of an Eye (Michael McDonald album), Blue Views, Bob Birch, Bonnaroo Music Festival, Born Again (Mica Paris album), Breakdown (Melissa Etheridge album), Broken China, Building the Perfect Beast, Chalmers Alford, Chapman Stick, Charango (album), Circle of One, Claire Sproule, Colour (The Christians album), Come l'acqua, Continuum (John Mayer album), Copy of a, Corinne Bailey Rae, Crosseyed Heart, D'Angelo, Dancing on the Couch, Dave Swift, David Lyttle, Degradation Trip, Destiny (Chaka Khan album), Do You Remember? (Phil Collins song), Doot-Doot, Dot Com Blues, Duncan Sheik (album), ..., Earthbound (Conner Reeves album), Edie Brickell, Electric Circus (album), Electric Landlady, Emotion & Commotion, Endless Wire (The Who album), Engelberg (album), Erykah Badu, Everybody Got Their Something, Everything (Climie Fisher album), Everytime You Go Away, Fabio Meridiani, Fender Jaguar Bass, Fender Precision Bass, First Wish, Fly (Zucchero album), Fretless guitar, Fuzzbee Morse, Gabin Dabiré, Garland Jeffreys, Genesis Revisited, Give Blood (song), Glasshouse (album), Go West (Go West album), Greg Lake, Guitar Legends, Seville 1991, Head Over Heels (Chromeo album), Heartbreak Warfare, Hearts and Flowers (album), Hesitation Marks, Hits (Phil Collins album), How to Become Clairvoyant, Howie 61, Human (Rod Stewart album), Hurricane (Eric Benét album), I Want You (Hold On to Love), I Wish It Would Rain Down, I'm the Only One, I, Assassin, Ice on Fire, Ingolstädter Jazztage, Into the Light (Chris de Burgh album), Irresistible Force (song), It's About Time (Manu Katché album), James Jamerson, Jason Rebello, Jill Scott discography, Jimjam, John Entwistle, John Mayer, John Mayer discography, John Mayer Trio, John Sloman, Jon Button, Joshua Eustis, Journeyman (album), Just Chillin', Justin Raisen, Keep On, Kite (Kirsty MacColl album), Kristina Train, Lace Around the Wound, Last Days at the Lodge, Leon Pendarvis, Let's Go Bang, Letters Never Sent, Level 42, Like Water for Chocolate (album), List of 2014 albums, List of 2018 albums, List of bass guitarists, List of British Italians, List of jazz bassists, List of Nine Inch Nails band members, List of Nine Inch Nails concert tours, List of session musicians, List of the Who band members, List of The Who tours and performances, Live in Boston (film), Long Hard Look, Look Out Now!, Lost and Found (David Byron album), Love on the Weekend, Lucky Man (Dave Koz album), Luke (album), Luz Casal, Malibu (album), Mama's Gun, Mamouna, Mango (singer), Mario Parmisano, Mark de Clive-Lowe, Mark Ralph (record producer), Masseduction, Me and Mr. Johnson, Mike Scott (musician), Mo Foster, Moodring, Mr. Saturday Night (album), Mummy Calls, Music for Chameleons (song), Music Man (company), Music Man StingRay, New York Minute (song), Nine Inch Nails, Nine Inch Nails live performances, No Parlez, North of a Miracle, Occupy Music Tour, Ofra Haza (album), Old Friends: Live on Stage, One Clear Voice, Orange and Blue (album), Other Voices (Paul Young album), Oytun Ersan, Palladino, Party at the Palace, Paul Young, People (Howard Jones album), Pete Townshend Live BAM 1993, Philippe Saisse, Picture of You (album), Piero Milesi, Pilgrim (Eric Clapton album), Pino, Porcelain (Julia Fordham album), Psychoderelict, Quadrophenia, Quadrophenia (musical), Quadrophenia Live in London, Quality (album), Rachel Fuller, Real Good Looking Boy, Release (David Knopfler album), Reptile (album), Richard Ashcroft, Richard Wright (musician), Rico Rodriguez discography, Right Where You Want Me (album), Ripcord (album), Robbie McIntosh, Robert Trujillo, Roberto Manzin, Roger Daltrey, Roy Hargrove, Runaway Train (Elton John and Eric Clapton song), Sailing (Sutherland Brothers song), Seal (1994 album), Secret Agent (Judie Tzuke album), Secret Secrets, Selfish Love (song), Send It On (D'Angelo song), Shadowdance (Chris White album), Simon Phillips (drummer), Siobhan Maher Kennedy, Soul Sound, Soulquarians, Spinal Tap (band), Stephan Eicher, Steve Bolton, Steve Jordan (drummer), Still (Tony Banks album), Still Burning, Still Waters (Bee Gees album), Summer Watson, Sunset Grill (song), Surprise (Paul Simon album), Swept (album), Teitur Lassen, The Big Dish (band), The Boy Who Heard Music, The Continuum Project, The Crossing (Paul Young album), The Dream Academy (album), The End of the Innocence (album), The Gaddabouts (album), The Great Music Experience, The King of In Between, The Lady Killer (album), The Law (English band), The Law (The Law album), The One (Elton John album), The Planeteer, The Pop Factory, The Promise (Earth, Wind & Fire album), The Promise (John McLaughlin album), The Real Me (The Who song), The Road to Escondido, The Search for Everything, The Search for Everything World Tour, The Search for Everything: Wave One, The Search for Everything: Wave Two, The Second Coming Tour (D'Angelo), The Secret of Association, The Seeds of Love, The Shouting Stage, The Soultronics, The Strat Pack, The Village Sessions, The Webb Sisters, The Who, The Who 2005 performances, The Who 2010 performances, The Who 2011 performances, The Who Hits 50!, The Who Hits 50! (album), The Who Tour 2002, The Who Tour 2004, The Who Tour 2006–2007, The Who Tour 2008–2009, The Who Tour 2012–2013, Then and Now (The Who album), Things Fall Apart (album), Thousand Roads, Tony O'Malley (musician), Touchstone for Manu, Touring and studio musicians of Phil Collins, Try!, Twenty Four Seven (Tina Turner album), Twenty Thirteen Tour, Undiscovered Soul, Volcano (Edie Brickell album), Voodoo (D'Angelo album), Vulfpeck, Walking Shadows, Warren Cuccurullo, Wayne Krantz, Welsh Italians, Where the Light Is (John Mayer album), Wherever I Lay My Hat (That's My Home), White City: A Novel, Who Else!, Who Says (John Mayer song), Why Don't You Try, Willie Weeks, Wire & Glass, Wise Up Ghost, Woman in Chains, Word of Mouth (Mike + The Mechanics album), Working Girl (Original Soundtrack Album), World Falling Down, Worldwide Underground, Worth the Wait (EP), Yes I Am (Melissa Etheridge album), Zucchero Fornaciari, ...But Seriously, 100,000,000 Bon Jovi Fans Can't Be Wrong, 2005 Bonnaroo Music Festival, 21 (Adele album). Expand index (249 more) » « Shrink index\n\nA Celebration: The Music of Pete Townshend and The Who, also known as Daltrey Sings Townshend, is a music event and a later live album by Roger Daltrey (of English rock band The Who) documenting a two-night concert at Carnegie Hall in February 1994.\n\nNew!!: Pino Palladino and A Celebration: The Music of Pete Townshend and The Who · See more »\n\nAbout Face is the second solo album by the English musician David Gilmour.\n\nNew!!: Pino Palladino and About Face (album) · See more »\n\nAlone with Everybody is the first solo album by English singer-songwriter Richard Ashcroft, released via Hut Records in June 2000 (see 2000 in British music).\n\nNew!!: Pino Palladino and Alone with Everybody · See more »\n\nAndrew Fairweather Low (born 2 August 1948) is a Welsh guitarist, songwriter, producer and vocalist.\n\nNew!!: Pino Palladino and Andy Fairweather Low · See more »\n\nThe Annual John Mayer Holiday Charity Revue began in December 2007.\n\nNew!!: Pino Palladino and Annual John Mayer Holiday Charity Revue · See more »\n\nAnother World is the ninth and final studio album by Gerry Rafferty.\n\nNew!!: Pino Palladino and Another World (Gerry Rafferty album) · See more »\n\nAt World's Edge is the ninth album by jazz keyboardist Philippe Saisse.\n\nNew!!: Pino Palladino and At World's Edge · See more »\n\nBack Home is a 2005 album by Eric Clapton.\n\nNew!!: Pino Palladino and Back Home (Eric Clapton album) · See more »\n\nBack to the Who Tour 51! was a 2016 concert tour of Europe & North America by British band The Who.\n\nNew!!: Pino Palladino and Back to the Who Tour 51! · See more »\n\n\"Bad Love\" is a rock song recorded by the British rock musician Eric Clapton, who co-wrote it with Foreigner's lead guitarist Mick Jones.\n\nNew!!: Pino Palladino and Bad Love (Eric Clapton song) · See more »\n\nBankstatement is a studio album by Genesis keyboardist Tony Banks, issued under a band name and released in 1989.\n\nNew!!: Pino Palladino and Bankstatement · See more »\n\nThe bass guitar (also known as electric bass, or bass) is a stringed instrument similar in appearance and construction to an electric guitar, except with a longer neck and scale length, and four to six strings or courses.\n\nNew!!: Pino Palladino and Bass guitar · See more »\n\nA bassist, or bass player, is a musician who plays a bass instrument such as a double bass, bass guitar, keyboard bass or a low brass instrument such as a tuba or sousaphone.\n\nNew!!: Pino Palladino and Bassist · See more »\n\nBattle Studies is the fourth studio album by American recording artist John Mayer, released on November 17, 2009 by Columbia Records.\n\nNew!!: Pino Palladino and Battle Studies (album) · See more »\n\n\"Be Lucky\" is a song by The Who, written by Pete Townshend and recorded for the band's compilation album The Who Hits 50! released in 2014 and was proposed for a following album.\n\nNew!!: Pino Palladino and Be Lucky · See more »\n\nBeauty is the eighth solo studio album by Japanese musician Ryuichi Sakamoto.\n\nNew!!: Pino Palladino and Beauty (Ryuichi Sakamoto album) · See more »\n\nBehind the Lines is David Knopfler's second solo album after leaving Dire Straits.\n\nNew!!: Pino Palladino and Behind the Lines (David Knopfler album) · See more »\n\n\"Belief\" was the second single from John Mayer's 2006 album Continuum.\n\nNew!!: Pino Palladino and Belief (song) · See more »\n\nBetween Two Fires is the third solo album by the English singer Paul Young.\n\nNew!!: Pino Palladino and Between Two Fires (album) · See more »\n\nWilliam Scott Bruford (born 17 May 1949) is an English retired drummer, percussionist, songwriter, producer, and record label owner who first gained prominence as the original drummer of the rock band Yes, from 1968 to 1972 and again from 1989 to 1992.\n\nNew!!: Pino Palladino and Bill Bruford · See more »\n\nBlack Messiah is the third studio album by American recording artist D'Angelo.\n\nNew!!: Pino Palladino and Black Messiah (album) · See more »\n\nBlink of an Eye is the fourth solo studio album by American singer-songwriter Michael McDonald.\n\nNew!!: Pino Palladino and Blink of an Eye (Michael McDonald album) · See more »\n\nBlue Views is the fifth solo studio album by the English singer-songwriter Paul Carrack, then a member of the supergroup Mike + The Mechanics.\n\nNew!!: Pino Palladino and Blue Views · See more »\n\nRobert Wayne \"Bob\" Birch (July 14, 1956 – August 15, 2012) was an American musician.\n\nNew!!: Pino Palladino and Bob Birch · See more »\n\nThe Bonnaroo Music and Arts Festival is an annual four-day music festival developed and produced by Superfly Presents and AC Entertainment.\n\nNew!!: Pino Palladino and Bonnaroo Music Festival · See more »\n\nBorn Again is the seventh studio album by British singer Mica Paris, released on 1 June 2009.\n\nNew!!: Pino Palladino and Born Again (Mica Paris album) · See more »\n\nBreakdown is the sixth album by singer-songwriter Melissa Etheridge, released in 1999 (see 1999 in music).\n\nNew!!: Pino Palladino and Breakdown (Melissa Etheridge album) · See more »\n\nBroken China is a progressive rock solo album by Pink Floyd keyboard player Richard Wright.\n\nNew!!: Pino Palladino and Broken China · See more »\n\nBuilding the Perfect Beast is the second solo studio album by Don Henley.\n\nNew!!: Pino Palladino and Building the Perfect Beast · See more »\n\nChalmers Edward \"Spanky\" Alford (May 22, 1955 – March 24, 2008) was an American three-time Grammy-winning jazz guitarist.\n\nNew!!: Pino Palladino and Chalmers Alford · See more »\n\nThe Chapman Stick is an electric musical instrument devised by Emmett Chapman in the early 1970s.\n\nNew!!: Pino Palladino and Chapman Stick · See more »\n\nCharango is an album by the British group Morcheeba, released in the first week of July 2002 through Warner Bros.\n\nNew!!: Pino Palladino and Charango (album) · See more »\n\nCircle of One is the third album by American vocalist, pianist, and songwriter Oleta Adams and was released in 1990.\n\nNew!!: Pino Palladino and Circle of One · See more »\n\nClaire Sproule (born 10 April 1985) is a singer-songwriter from County Donegal, Ireland.\n\nNew!!: Pino Palladino and Claire Sproule · See more »\n\nColour is the second album by British soul group The Christians.\n\nNew!!: Pino Palladino and Colour (The Christians album) · See more »\n\nCome l'acqua is the ninth studio album by Italian pop singer Mango, released in 1992.\n\nNew!!: Pino Palladino and Come l'acqua · See more »\n\nContinuum is the third studio album by American recording artist John Mayer, released on September 12, 2006 by Aware and Columbia Records.\n\nNew!!: Pino Palladino and Continuum (John Mayer album) · See more »\n\n\"Copy of a\" is a song by American industrial rock band Nine Inch Nails, released as the second single from their eighth studio album, Hesitation Marks (2013).\n\nNew!!: Pino Palladino and Copy of a · See more »\n\nCorinne Bailey Rae (born Corinne Jacqueline Bailey; 26 February 1979) is a British singer, songwriter, record producer, and guitarist from Leeds, West Yorkshire.\n\nNew!!: Pino Palladino and Corinne Bailey Rae · See more »\n\nCrosseyed Heart is the third solo album by Rolling Stones guitarist Keith Richards.\n\nNew!!: Pino Palladino and Crosseyed Heart · See more »\n\nMichael Eugene Archer (born February 11, 1974), better known by his stage name D'Angelo (pronounced di-Angelo), is an American singer, songwriter, multi-instrumentalist and record producer.\n\nNew!!: Pino Palladino and D'Angelo · See more »\n\nDancing on the Couch is the second album by the band Go West, released in 1987.\n\nNew!!: Pino Palladino and Dancing on the Couch · See more »\n\nDave Swift (born 11 January 1964) is a British bassist.\n\nNew!!: Pino Palladino and Dave Swift · See more »\n\nDavid Lyttle (born 21 June 1984) is a musician, songwriter, producer, composer, and record label owner from Northern Ireland.\n\nNew!!: Pino Palladino and David Lyttle · See more »\n\nDegradation Trip is the second and most recent solo album by Alice in Chains guitarist and vocalist Jerry Cantrell, released on June 18, 2002.\n\nNew!!: Pino Palladino and Degradation Trip · See more »\n\nDestiny is the sixth studio album by American R&B/funk singer Chaka Khan, released on Warner Bros. Records in 1986.\n\nNew!!: Pino Palladino and Destiny (Chaka Khan album) · See more »\n\n\"Do You Remember?\" is a single performed by Phil Collins released in 1990 from his album...But Seriously.\n\nNew!!: Pino Palladino and Do You Remember? (Phil Collins song) · See more »\n\nDoot-Doot is the debut studio album by Freur and was released in 1983.\n\nNew!!: Pino Palladino and Doot-Doot · See more »\n\nDot Com Blues is a 2001 album by the American jazz organist Jimmy Smith.\n\nNew!!: Pino Palladino and Dot Com Blues · See more »\n\nDuncan Sheik is the Gold-certified self-titled debut by American singer-songwriter Duncan Sheik.\n\nNew!!: Pino Palladino and Duncan Sheik (album) · See more »\n\nEarthbound is the 1997 debut album by Conner Reeves.\n\nNew!!: Pino Palladino and Earthbound (Conner Reeves album) · See more »\n\nEdie Arlisa Brickell (born March 10, 1966) is an American singer-songwriter widely known for 1988's Shooting Rubberbands at the Stars, the debut album by Edie Brickell & New Bohemians, which went to No.\n\nNew!!: Pino Palladino and Edie Brickell · See more »\n\nElectric Circus is the fifth studio album by rapper Common, released December 10, 2002 on the now-defunct MCA Records.\n\nNew!!: Pino Palladino and Electric Circus (album) · See more »\n\nElectric Landlady is Kirsty MacColl's third studio album.\n\nNew!!: Pino Palladino and Electric Landlady · See more »\n\nEmotion & Commotion is the tenth studio album by guitarist Jeff Beck, released in April 2010 on ATCO Records.\n\nNew!!: Pino Palladino and Emotion & Commotion · See more »\n\nEndless Wire is the eleventh and most recent studio album by the English rock band the Who released on 30 October 2006 in the UK through Polydor Records and the following day in the US by Universal Republic.\n\nNew!!: Pino Palladino and Endless Wire (The Who album) · See more »\n\nEngelberg is the ninth album recorded by Swiss singer Stephan Eicher, released in 1991.\n\nNew!!: Pino Palladino and Engelberg (album) · See more »\n\nErica Abi Wright (born February 26, 1971), known professionally as Erykah Badu, is an American singer-songwriter, record producer, disc jockey, activist, and actress.\n\nNew!!: Pino Palladino and Erykah Badu · See more »\n\nEverybody Got Their Something was the first album released in 2001 by pop/soul singer Nikka Costa.\n\nNew!!: Pino Palladino and Everybody Got Their Something · See more »\n\nEverything is the first album by British pop duo Climie Fisher, released in 1987.\n\nNew!!: Pino Palladino and Everything (Climie Fisher album) · See more »\n\n\"Everytime You Go Away\" is a song written and composed by Daryl Hall.\n\nNew!!: Pino Palladino and Everytime You Go Away · See more »\n\nFabio Meridiani (born 4 June 1967) is an Italian musician personality who made his debut as a bass player in 1985.\n\nNew!!: Pino Palladino and Fabio Meridiani · See more »\n\nThe Fender Jaguar Bass is an electric bass guitar manufactured in Japan and China by the Fender Musical Instruments Corporation.\n\nNew!!: Pino Palladino and Fender Jaguar Bass · See more »\n\nThe Precision Bass (often shortened to \"P-Bass\") is a bass guitar manufactured by Fender Musical Instruments Corporation.\n\nNew!!: Pino Palladino and Fender Precision Bass · See more »\n\nFirst Wish is the debut album by trumpet player Chris Botti.\n\nNew!!: Pino Palladino and First Wish · See more »\n\nFly is the tenth studio album by the Italian blues rock singer-songwriter Zucchero Fornaciari, released on 22 September 2006.\n\nNew!!: Pino Palladino and Fly (Zucchero album) · See more »\n\nA fretless guitar is a guitar with a fingerboard that does not have frets.\n\nNew!!: Pino Palladino and Fretless guitar · See more »\n\nFuzzbee Morse is an American composer for films, as well as a performer, singer/songwriter, multi-instrumentalist and music producer.\n\nNew!!: Pino Palladino and Fuzzbee Morse · See more »\n\nGabin Dabiré is a singer, guitarist, kora player, and composer from Burkina Faso (former Upper Volta) who has lived in Italy since 1975.\n\nNew!!: Pino Palladino and Gabin Dabiré · See more »\n\nGarland Jeffreys (born June 29, 1943 in Brooklyn, New York) is an American, singer and songwriter, traversing the musical genres of rock and roll, reggae, blues and soul.\n\nNew!!: Pino Palladino and Garland Jeffreys · See more »\n\nGenesis Revisited, called Watcher of the Skies: Genesis Revisited in the US, was a project put together by Steve Hackett to pay tribute to his former band Genesis.\n\nNew!!: Pino Palladino and Genesis Revisited · See more »\n\n\"Give Blood\" is a song by Pete Townshend, the guitarist for The Who.\n\nNew!!: Pino Palladino and Give Blood (song) · See more »\n\nGlasshouse is the third studio album by English singer-songwriter Jessie Ware.\n\nNew!!: Pino Palladino and Glasshouse (album) · See more »\n\nGo West is the debut studio album by English pop duo Go West, released in 1985 by Chrysalis Records.\n\nNew!!: Pino Palladino and Go West (Go West album) · See more »\n\nGregory Stuart Lake (10 November 1947 – 7 December 2016) was an English bassist, guitarist, singer, songwriter, and producer who gained prominence as a founding member of the progressive rock bands King Crimson and Emerson, Lake & Palmer (ELP).\n\nNew!!: Pino Palladino and Greg Lake · See more »\n\nGuitar Legends was a concert held over five nights, from October 15 to October 19, 1991, in Seville, Spain, with the aim of positioning the city as an entertainment destination to draw support for Expo '92 beginning the following April.\n\nNew!!: Pino Palladino and Guitar Legends, Seville 1991 · See more »\n\nHead Over Heels is the fifth studio album by Canadian electro-funk duo Chromeo.\n\nNew!!: Pino Palladino and Head Over Heels (Chromeo album) · See more »\n\n\"Heartbreak Warfare\" is a song by American blues rock musician John Mayer, featured on his 2009 fourth studio album Battle Studies.\n\nNew!!: Pino Palladino and Heartbreak Warfare · See more »\n\nHearts and Flowers is the twelfth studio album by British singer-songwriter Joan Armatrading.\n\nNew!!: Pino Palladino and Hearts and Flowers (album) · See more »\n\nHesitation Marks is the eighth studio album by American industrial rock band Nine Inch Nails, released on August 30, 2013 by Columbia Records.\n\nNew!!: Pino Palladino and Hesitation Marks · See more »\n\nHits (stylized as …Hits), released in 1998 and again in 2008, following the success of \"In the Air Tonight\" on the Cadbury ad campaign, is the first greatest hits album by English drummer and singer-songwriter Phil Collins.\n\nNew!!: Pino Palladino and Hits (Phil Collins album) · See more »\n\nHow to Become Clairvoyant is the fifth solo release from Robbie Robertson.\n\nNew!!: Pino Palladino and How to Become Clairvoyant · See more »\n\nHowie 61 is an album by Wayne Krantz released in 2012.\n\nNew!!: Pino Palladino and Howie 61 · See more »\n\nHuman is a studio album released by Rod Stewart on 12 March 2001 (see 2001 in music).\n\nNew!!: Pino Palladino and Human (Rod Stewart album) · See more »\n\nHurricane is the third studio album by American R&B recording artist Eric Benét, released June 21, 2005, on Friday Records, with distributing by Reprise Records.\n\nNew!!: Pino Palladino and Hurricane (Eric Benét album) · See more »\n\n\"I Want You\" is a song by American recording artist Cee Lo Green, from his third studio album The Lady Killer.\n\nNew!!: Pino Palladino and I Want You (Hold On to Love) · See more »\n\n\"I Wish It Would Rain Down\" is a song by Phil Collins from his 1989 album...But Seriously, featuring lead guitar by Eric Clapton.\n\nNew!!: Pino Palladino and I Wish It Would Rain Down · See more »\n\n\"I'm the Only One\" is a Melissa Etheridge song that appears on her 1993 album Yes I Am.\n\nNew!!: Pino Palladino and I'm the Only One · See more »\n\nI, Assassin is the fourth solo studio album by English musician Gary Numan.\n\nNew!!: Pino Palladino and I, Assassin · See more »\n\nIce on Fire, released in November 1985, is the nineteenth official album release for Elton John.\n\nNew!!: Pino Palladino and Ice on Fire · See more »\n\nIngolstädter Jazztage is a jazz festival in Germany.\n\nNew!!: Pino Palladino and Ingolstädter Jazztage · See more »\n\nInto the Light is the eighth studio album by British-Irish singer Chris de Burgh.\n\nNew!!: Pino Palladino and Into the Light (Chris de Burgh album) · See more »\n\n\"Irresistible Force\" is a song by the Bee Gees, released in March 1997 on their album Still Waters, this song was written by Barry Gibb, Robin Gibb and Maurice Gibb.\n\nNew!!: Pino Palladino and Irresistible Force (song) · See more »\n\nIt's About Time is the first solo album released by session drummer Manu Katché.\n\nNew!!: Pino Palladino and It's About Time (Manu Katché album) · See more »\n\nJames Lee Jamerson (January 29, 1936 – August 2, 1983) was an American bass player.\n\nNew!!: Pino Palladino and James Jamerson · See more »\n\nJason Matthew Rebello (born 29 March 1969) is a British pianist, songwriter, and record producer.\n\nNew!!: Pino Palladino and Jason Rebello · See more »\n\nThis article contains the discography of American soul and R&B singer-songwriter, poet, and actress Jill Scott, including studio albums, live albums, compilation albums, DVDs and singles.\n\nNew!!: Pino Palladino and Jill Scott discography · See more »\n\nJimjam (stylised as jimjam) is a 2000 recording by UK jazz-funk guitarist Jim Mullen, featuring fellow-Scot Hamish Stuart on rhythm guitar, Pino Palladino on bass and Ian Thomas on drums.\n\nNew!!: Pino Palladino and Jimjam · See more »\n\nJohn Alec Entwistle (9 October 1944 – 27 June 2002) was an English bass guitarist, singer, songwriter, and film and music producer.\n\nNew!!: Pino Palladino and John Entwistle · See more »\n\nJohn Clayton Mayer (born October 16, 1977) is an American singer-songwriter, guitarist, and producer.\n\nNew!!: Pino Palladino and John Mayer · See more »\n\nThe discography of American singer-songwriter and guitarist John Mayer consists of seven studio albums, seven live albums, three compilation albums, two video albums, four extended plays, twenty-four singles and seventeen music videos.\n\nNew!!: Pino Palladino and John Mayer discography · See more »\n\nThe John Mayer Trio is an American blues rock band that formed in 2005.\n\nNew!!: Pino Palladino and John Mayer Trio · See more »\n\nJohn Anthony David Sloman was born in Cardiff, South Wales, 26 April 1957 as the eldest of six children.\n\nNew!!: Pino Palladino and John Sloman · See more »\n\nJon Button (born February 10, 1971) is an American bass player born in Fairbanks, Alaska, and based in Los Angeles, California.\n\nNew!!: Pino Palladino and Jon Button · See more »\n\nJoshua Leeds Eustis is an American musician, singer-songwriter and record producer, best known as the current sole member of electronic music act, Telefon Tel Aviv, since the death of bandmate Charles Cooper in 2009.\n\nNew!!: Pino Palladino and Joshua Eustis · See more »\n\nJourneyman is a 1989 album by Eric Clapton.\n\nNew!!: Pino Palladino and Journeyman (album) · See more »\n\nJust Chillin is the fifth studio album by American guitarist and singer Norman Brown, released in July 2002 through Warner Bros. Records.\n\nNew!!: Pino Palladino and Just Chillin' · See more »\n\nJustin Louis Raisen is an American producer, songwriter, and multi-instrumentalist.\n\nNew!!: Pino Palladino and Justin Raisen · See more »\n\nKeep On is the third album by pop singer Will Young.\n\nNew!!: Pino Palladino and Keep On · See more »\n\nKite is the breakthrough second album by Kirsty MacColl, released in 1989.\n\nNew!!: Pino Palladino and Kite (Kirsty MacColl album) · See more »\n\nKristina Train (born January 17, 1982 in New York City as Kristina Beaty) is an American singer-songwriter and musician who has lived in London, United Kingdom since 2010.\n\nNew!!: Pino Palladino and Kristina Train · See more »\n\nLace Around the Wound is the second studio album by the American singer, actress and musician E. G. Daily, released by A&M in 1989.\n\nNew!!: Pino Palladino and Lace Around the Wound · See more »\n\nLast Days at the Lodge is the third studio album by singer-songwriter Amos Lee, released on June 24, 2008 through Blue Note.\n\nNew!!: Pino Palladino and Last Days at the Lodge · See more »\n\nLeon Pendarvis (born 1945) is an American session musician.\n\nNew!!: Pino Palladino and Leon Pendarvis · See more »\n\nLet's Go Bang is the second solo studio album by American actress and singer Jennifer Love Hewitt.\n\nNew!!: Pino Palladino and Let's Go Bang · See more »\n\nLetters Never Sent is singer-songwriter Carly Simon's twentieth album, and eighteenth studio album, released in 1994.\n\nNew!!: Pino Palladino and Letters Never Sent · See more »\n\nLevel 42 are an English band formed in Isle of Wight in 1980.\n\nNew!!: Pino Palladino and Level 42 · See more »\n\nLike Water for Chocolate is the fourth studio album by American rapper Common, released on March 28, 2000 through MCA Records.\n\nNew!!: Pino Palladino and Like Water for Chocolate (album) · See more »\n\nThe following is a list of albums released in 2014.\n\nNew!!: Pino Palladino and List of 2014 albums · See more »\n\nThe following is a list of albums released or scheduled for release in 2018.\n\nNew!!: Pino Palladino and List of 2018 albums · See more »\n\nThis is a list of electric bass guitar players that have their own separate article in Wikipedia.\n\nNew!!: Pino Palladino and List of bass guitarists · See more »\n\nThis is a list of notable British people of Italian ancestry and of Italians established in the UK.\n\nNew!!: Pino Palladino and List of British Italians · See more »\n\nThis list of jazz bassists includes performers of the double bass and since the 1950s, and particularly in the jazz subgenre of jazz fusion which developed in the 1970s, electric bass players.\n\nNew!!: Pino Palladino and List of jazz bassists · See more »\n\nNine Inch Nails is an American industrial rock band, founded in 1988 by Trent Reznor in Cleveland, Ohio.\n\nNew!!: Pino Palladino and List of Nine Inch Nails band members · See more »\n\nNine Inch Nails is an American industrial rock act, founded in 1988 by Trent Reznor in Cleveland, Ohio.\n\nNew!!: Pino Palladino and List of Nine Inch Nails concert tours · See more »\n\nThis is a list of session musicians — professional musicians who perform in individual sessions rather than being a permanent member of an ensemble.\n\nNew!!: Pino Palladino and List of session musicians · See more »\n\nThis page is a list of the various personnel and line-ups that have been a part of the English rock band the Who, from their origin as the Detours in 1962 to the present day.\n\nNew!!: Pino Palladino and List of the Who band members · See more »\n\nThe following is an index of performances and tours by The Who.\n\nNew!!: Pino Palladino and List of The Who tours and performances · See more »\n\nLive in Boston is a concert film of a concert performed by The Who on September 27, 2002 (mistakenly credited as September 24, 2002) in Boston, Massachusetts.\n\nNew!!: Pino Palladino and Live in Boston (film) · See more »\n\nLong Hard Look is the second solo album from original Foreigner lead vocalist Lou Gramm, released in 1989 (See 1989 in music).\n\nNew!!: Pino Palladino and Long Hard Look · See more »\n\nLook Out Now! is the second album by The Gaddabouts, released in April 2012 as a double CD.\n\nNew!!: Pino Palladino and Look Out Now! · See more »\n\nLost And Found is a 2-Disc album that includes demos and live recordings by the Byron Band which spans two years from 1980-1982.\n\nNew!!: Pino Palladino and Lost and Found (David Byron album) · See more »\n\n\"Love on the Weekend\" is the lead single from American musician John Mayer's seventh studio album The Search for Everything.\n\nNew!!: Pino Palladino and Love on the Weekend · See more »\n\nLucky Man is the second studio album of saxophone player Dave Koz.\n\nNew!!: Pino Palladino and Lucky Man (Dave Koz album) · See more »\n\nLuke is the third solo album by Steve Lukather released in 1997.\n\nNew!!: Pino Palladino and Luke (album) · See more »\n\nLuz Casal (born 11 November 1958 at Boimorto) is a Spanish pop singer.\n\nNew!!: Pino Palladino and Luz Casal · See more »\n\nMalibu is the second studio album by American singer Anderson Paak.\n\nNew!!: Pino Palladino and Malibu (album) · See more »\n\nMama's Gun is the second studio album by American neo soul singer Erykah Badu.\n\nNew!!: Pino Palladino and Mama's Gun · See more »\n\nMamouna is the ninth solo album by the British singer Bryan Ferry, released on Virgin Records in September 1994.\n\nNew!!: Pino Palladino and Mamouna · See more »\n\nMango, stage name of Giuseppe Mango (6 November 1954 – 7 December 2014), was an Italian singer-songwriter and musician.\n\nNew!!: Pino Palladino and Mango (singer) · See more »\n\nMarioParmisano (Born: June 18th 1960, Buenos Aires), is an Argentinian jazz pianist.\n\nNew!!: Pino Palladino and Mario Parmisano · See more »\n\nMark de Clive-Lowe (born August 16, 1974) is a half-Japanese, half-New Zealander musician, composer and producer raised in Auckland, New Zealand, now based in Los Angeles, California.\n\nNew!!: Pino Palladino and Mark de Clive-Lowe · See more »\n\nMark Ralph (born 2 May 1974) is an award-winning British music producer, mixer and Ivor Novello-nominated songwriter and musician.\n\nNew!!: Pino Palladino and Mark Ralph (record producer) · See more »\n\nMasseduction (stylized in all caps) is the fifth studio album by American musician St. Vincent.\n\nNew!!: Pino Palladino and Masseduction · See more »\n\nMe and Mr.\n\nNew!!: Pino Palladino and Me and Mr. Johnson · See more »\n\nMichael Scott (born 14 December 1958) is a Scottish singer, songwriter and musician.\n\nNew!!: Pino Palladino and Mike Scott (musician) · See more »\n\nMo Foster is a British session bassist.\n\nNew!!: Pino Palladino and Mo Foster · See more »\n\nMoodring is the third studio album by American singer Mýa.\n\nNew!!: Pino Palladino and Moodring · See more »\n\nMr.\n\nNew!!: Pino Palladino and Mr. Saturday Night (album) · See more »\n\nMummy Calls were a British pop rock/power pop band based in Leamington Spa.\n\nNew!!: Pino Palladino and Mummy Calls · See more »\n\n\"Music for Chameleons\" is a 1982 single by Gary Numan from his album, I, Assassin.\n\nNew!!: Pino Palladino and Music for Chameleons (song) · See more »\n\nMusic Man is an American guitar and bass guitar manufacturer.\n\nNew!!: Pino Palladino and Music Man (company) · See more »\n\nMusic Man StingRay is an electric bass guitar by Music Man, introduced in 1976.\n\nNew!!: Pino Palladino and Music Man StingRay · See more »\n\n\"New York Minute\" is a song written by Don Henley, Danny Kortchmar, and Jai Winding.\n\nNew!!: Pino Palladino and New York Minute (song) · See more »\n\nNine Inch Nails, commonly abbreviated as NIN (stylized as NIИ), is an American industrial rock band founded in 1988 by Trent Reznor in Cleveland, Ohio.\n\nNew!!: Pino Palladino and Nine Inch Nails · See more »\n\nNine Inch Nails, an industrial rock band fronted by Trent Reznor, did various live performances throughout the world, including tours in North America, South America, Europe, Australia, and Asia.\n\nNew!!: Pino Palladino and Nine Inch Nails live performances · See more »\n\nNo Parlez is the debut solo album by English singer Paul Young.\n\nNew!!: Pino Palladino and No Parlez · See more »\n\nNorth of a Miracle is the debut solo album by English singer-songwriter Nick Heyward.\n\nNew!!: Pino Palladino and North of a Miracle · See more »\n\nThe Occupy Music Tour was an 11-date only concert tour in Europe by American R&B/soul singer D'Angelo.\n\nNew!!: Pino Palladino and Occupy Music Tour · See more »\n\nOfra Haza is the eponymous 1997 album by Israeli singer Ofra Haza.\n\nNew!!: Pino Palladino and Ofra Haza (album) · See more »\n\nSimon & Garfunkel's Old Friends: Live On Stage is the third live album and documentary from their highly successful \"Old Friends\" reunion concert tour of 2003, with The Everly Brothers as special guests.\n\nNew!!: Pino Palladino and Old Friends: Live on Stage · See more »\n\nOne Clear Voice (1995) is the fifth solo album for music artist Peter Cetera and his fourth album since leaving the group Chicago.\n\nNew!!: Pino Palladino and One Clear Voice · See more »\n\nOrange And Blue is an album by Italian-American jazz fusion and Latin jazz guitarist Al Di Meola, released in 1994.\n\nNew!!: Pino Palladino and Orange and Blue (album) · See more »\n\nOther Voices is the fourth album by the English singer Paul Young.\n\nNew!!: Pino Palladino and Other Voices (Paul Young album) · See more »\n\nOytun Ersan (born June 22, 1978) is a Turkish Cypriot electric bass and upright bass player, composer and recording artist.\n\nNew!!: Pino Palladino and Oytun Ersan · See more »\n\nPalladino is an Italian surname.\n\nNew!!: Pino Palladino and Palladino · See more »\n\nThe Party at the Palace, was a British music concert and celebration held in London in 2002.\n\nNew!!: Pino Palladino and Party at the Palace · See more »\n\nPaul Antony Young (born 17 January 1956) is an English singer, songwriter and musician.\n\nNew!!: Pino Palladino and Paul Young · See more »\n\nPeople is officially Howard Jones's seventh album, released in 1998.\n\nNew!!: Pino Palladino and People (Howard Jones album) · See more »\n\nPete Townshend Live BAM 1993 is a live recording by Pete Townshend.\n\nNew!!: Pino Palladino and Pete Townshend Live BAM 1993 · See more »\n\nPhilippe Saisse is a French smooth jazz and new-age music multi-instrumentalist, composer, record producer and arranger.\n\nNew!!: Pino Palladino and Philippe Saisse · See more »\n\nPicture of You is the debut studio album by English singer-songwriter Ben Mills, who finished in third place on the third series of The X Factor in December 2006.\n\nNew!!: Pino Palladino and Picture of You (album) · See more »\n\nPiero Milesi (1953 in Milan – 2011 in Levanto) was an Italian musician, composer, and music arranger.\n\nNew!!: Pino Palladino and Piero Milesi · See more »\n\nPilgrim is the thirteenth studio album by the British rock musician Eric Clapton, released on March 10, 1998 for Reprise Records.\n\nNew!!: Pino Palladino and Pilgrim (Eric Clapton album) · See more »\n\nNo description.\n\nNew!!: Pino Palladino and Pino · See more »\n\nPorcelain is the second album by English singer-songwriter Julia Fordham, released in 1989.\n\nNew!!: Pino Palladino and Porcelain (Julia Fordham album) · See more »\n\nPsychoderelict is a concept album written, produced and engineered by Pete Townshend.\n\nNew!!: Pino Palladino and Psychoderelict · See more »\n\nQuadrophenia is the sixth studio album by the English rock band The Who, released as a double album on 26 October 1973 by Track Records.\n\nNew!!: Pino Palladino and Quadrophenia · See more »\n\nQuadrophenia is a stage musical based on the sixth studio album by English rock band The Who, released on 19 October 1973, and a film of the same name, released in 1979.\n\nNew!!: Pino Palladino and Quadrophenia (musical) · See more »\n\nQuadrophenia Live in London is a live release from British rock band, The Who.\n\nNew!!: Pino Palladino and Quadrophenia Live in London · See more »\n\nQuality is the debut studio album by American rapper Talib Kweli.\n\nNew!!: Pino Palladino and Quality (album) · See more »\n\nRachel Fuller (born 24 July 1973) is a British musician.\n\nNew!!: Pino Palladino and Rachel Fuller · See more »\n\n\"Real Good Looking Boy\" is a song written by the guitarist of the British rock band The Who, Pete Townshend.\n\nNew!!: Pino Palladino and Real Good Looking Boy · See more »\n\nRelease is David Knopfler's first solo album after leaving Dire Straits.\n\nNew!!: Pino Palladino and Release (David Knopfler album) · See more »\n\nReptile is a 2001 album by Eric Clapton.\n\nNew!!: Pino Palladino and Reptile (album) · See more »\n\nRichard Paul Ashcroft (born 11 September 1971) is an English singer and songwriter.\n\nNew!!: Pino Palladino and Richard Ashcroft · See more »\n\nRichard William Wright (28 July 1943 – 15 September 2008) was an English musician, composer, singer, and songwriter.\n\nNew!!: Pino Palladino and Richard Wright (musician) · See more »\n\nThe Rico Rodriguez discography includes hundreds of recordings from the trombonist's long career, which dates back to the 1950s.\n\nNew!!: Pino Palladino and Rico Rodriguez discography · See more »\n\nRight Where You Want Me is the second studio album by American singer-songwriter Jesse McCartney, released in the US on September 19, 2006.\n\nNew!!: Pino Palladino and Right Where You Want Me (album) · See more »\n\nRipcord is the ninth studio album by New Zealand-born Australian country music singer Keith Urban.\n\nNew!!: Pino Palladino and Ripcord (album) · See more »\n\nRobbie McIntosh (born 25 October 1957) is an English guitarist.\n\nNew!!: Pino Palladino and Robbie McIntosh · See more »\n\nRoberto Agustín Miguel Santiago Samuel Perez de la Santa Concepción Trujillo Veracruz Bautista (born October 23, 1964) better known as Robert Trujillo, is an American musician and songwriter best known as the current bassist of the heavy metal band Metallica, a position he has held since 2003.\n\nNew!!: Pino Palladino and Robert Trujillo · See more »\n\nRoberto Manzin (born 8 July 1966) is a London-based alto, tenor and soprano saxophones, clarinet, EWI, piano player and composer.\n\nNew!!: Pino Palladino and Roberto Manzin · See more »\n\nRoger Harry Daltrey (born 1 March 1944) is an English singer, musician, and actor.\n\nNew!!: Pino Palladino and Roger Daltrey · See more »\n\nRoy Anthony Hargrove (born October 16, 1969) is an American jazz trumpeter.\n\nNew!!: Pino Palladino and Roy Hargrove · See more »\n\n\"Runaway Train\" is a pop rock song recorded by the British rock-pop musicians Elton John and Eric Clapton.\n\nNew!!: Pino Palladino and Runaway Train (Elton John and Eric Clapton song) · See more »\n\n\"Sailing\" is a song composed by Gavin Sutherland of the Sutherland Brothers in 1972, best known as a 1975 international hit for Rod Stewart.\n\nNew!!: Pino Palladino and Sailing (Sutherland Brothers song) · See more »\n\nSeal (sometimes referred to as Seal II to avoid confusion with the 1991 album of the same name) is the second eponymous studio album by singer Seal.\n\nNew!!: Pino Palladino and Seal (1994 album) · See more »\n\nSecret Agent is the title of the eleventh studio album by the British singer-songwriter Judie Tzuke, released in 1998.\n\nNew!!: Pino Palladino and Secret Agent (Judie Tzuke album) · See more »\n\nSecret Secrets is the ninth studio album by British singer-songwriter Joan Armatrading, released on 4 February 1985 by A&M (AMA 5040).\n\nNew!!: Pino Palladino and Secret Secrets · See more »\n\n\"Selfish Love\" is a song by English singer-songwriter Jessie Ware.\n\nNew!!: Pino Palladino and Selfish Love (song) · See more »\n\n\"Send It On\" is a song by American R&B recording artist D'Angelo.\n\nNew!!: Pino Palladino and Send It On (D'Angelo song) · See more »\n\nShadowdance is the first solo album by English saxophonist Chris White, who had previously performed with Dire Straits and The Notting Hillbillies.\n\nNew!!: Pino Palladino and Shadowdance (Chris White album) · See more »\n\nSimon Phillips (born 6 February 1957) is an English jazz, pop and rock drummer songwriter, and producer, best known for his studio and session work with seminal English rock acts throughout the 1970s and 1980s and for being the drummer for Toto from 1992 to 2014.\n\nNew!!: Pino Palladino and Simon Phillips (drummer) · See more »\n\nSiobhan Maher (born 11 January 1964) is an English singer and songwriter.\n\nNew!!: Pino Palladino and Siobhan Maher Kennedy · See more »\n\n\"Soul Sound\" is a song by British girl group Sugababes from their debut studio album One Touch (2000).\n\nNew!!: Pino Palladino and Soul Sound · See more »\n\nThe Soulquarians were a neo soul and alternative hip hop-informed musical collective.\n\nNew!!: Pino Palladino and Soulquarians · See more »\n\nSpinal Tap (stylized as Spın̈al Tap, with a dotless letter ''i'' and a metal umlaut over the ''n'') is a parody band spoofing the style of rock heavy metal groups.\n\nNew!!: Pino Palladino and Spinal Tap (band) · See more »\n\nStephan Eicher (born 17 August 1960) is a Swiss singer.\n\nNew!!: Pino Palladino and Stephan Eicher · See more »\n\nSteve Bolton (born 8 November 1949 in Manchester, England), also known as \"Boltz\" Bolton, is an English rock musician who, since the start of his career in the 1960s, has played guitar on video, film and television and recorded as well as toured with a number of well-known artists.\n\nNew!!: Pino Palladino and Steve Bolton · See more »\n\nSteve Jordan (January 14, 1957) is an American drummer, songwriter, and record producer who has spent much of his career as a studio musician.\n\nNew!!: Pino Palladino and Steve Jordan (drummer) · See more »\n\nStill is the third studio album by Genesis keyboardist Tony Banks, released in 1991 on Virgin Records in the UK and Giant Records in the U.S. The album was originally going to be named after the track Still It Takes Me by Surprise, but was later shortened to Still.\n\nNew!!: Pino Palladino and Still (Tony Banks album) · See more »\n\nStill Burning is 1997's follow-up to Bring 'em All In (1995), and the last of Mike Scott's solo albums before re-forming The Waterboys in 2000.\n\nNew!!: Pino Palladino and Still Burning · See more »\n\nStill Waters is the twenty-first studio album by the pop group the Bee Gees, released on 10 March 1997 in the UK by Polydor, and on 6 May the same year in the US by A&M.\n\nNew!!: Pino Palladino and Still Waters (Bee Gees album) · See more »\n\nSummer Watson (born 14 September 1977) is a British operatic soprano.\n\nNew!!: Pino Palladino and Summer Watson · See more »\n\n\"Sunset Grill\" is a song by Don Henley from his 1984 album Building the Perfect Beast.\n\nNew!!: Pino Palladino and Sunset Grill (song) · See more »\n\nSurprise is the eleventh solo studio album by American musician Paul Simon, released in May 2006.\n\nNew!!: Pino Palladino and Surprise (Paul Simon album) · See more »\n\nSwept is the third album by English singer-songwriter Julia Fordham, released in 1991.\n\nNew!!: Pino Palladino and Swept (album) · See more »\n\nTeitur (born Teitur Lassen 1977 in Hoyvík) is a Faroese musician, composer, singer-songwriter and producer based on the Faroe Islands.\n\nNew!!: Pino Palladino and Teitur Lassen · See more »\n\nThe Big Dish are a Scottish pop band formed in Airdrie, Scotland in 1983.\n\nNew!!: Pino Palladino and The Big Dish (band) · See more »\n\nThe Boy Who Heard Music is a rock opus that began life as an Internet novella written by musician and songwriter Pete Townshend.\n\nNew!!: Pino Palladino and The Boy Who Heard Music · See more »\n\nThe Continuum Project is the fourth studio album by Canadian country music artist Lindsay Ell.\n\nNew!!: Pino Palladino and The Continuum Project · See more »\n\nThe Crossing is the fifth album by English singer Paul Young.\n\nNew!!: Pino Palladino and The Crossing (Paul Young album) · See more »\n\nThe Dream Academy is the debut studio album by English band The Dream Academy, released in November 1985.\n\nNew!!: Pino Palladino and The Dream Academy (album) · See more »\n\nThe End of the Innocence is the third solo studio album by Don Henley, the lead vocalist and drummer for the Eagles.\n\nNew!!: Pino Palladino and The End of the Innocence (album) · See more »\n\nThe Gaddabouts is the first album by The Gaddabouts, released in January 2011, in the same month that band vocalist Edie Brickell released her third solo album.\n\nNew!!: Pino Palladino and The Gaddabouts (album) · See more »\n\nThe Great Music Experience was a concert starring Japanese and international musicians staged at the eighth century Buddhist temple of Tōdai-ji, in Nara, Japan in May 1994.\n\nNew!!: Pino Palladino and The Great Music Experience · See more »\n\nThe King of In Between is a solo album by Garland Jeffreys.\n\nNew!!: Pino Palladino and The King of In Between · See more »\n\nThe Lady Killer is the third studio album by American singer CeeLo Green.\n\nNew!!: Pino Palladino and The Lady Killer (album) · See more »\n\nThe Law were an English rock group formed in 1991 by singer Paul Rodgers (ex-Free, Bad Company and The Firm) and drummer Kenney Jones (ex-Small Faces/Faces and The Who).\n\nNew!!: Pino Palladino and The Law (English band) · See more »\n\nThe Law is the first and only album from the rock supergroup The Law.\n\nNew!!: Pino Palladino and The Law (The Law album) · See more »\n\nThe One is the twenty-third studio album by the English singer-songwriter Elton John, released on 22 June 1992.\n\nNew!!: Pino Palladino and The One (Elton John album) · See more »\n\nThe Planeteer is the debut full-length studio album from singer-songwriter Julian Velard, released on November 23, 2009.\n\nNew!!: Pino Palladino and The Planeteer · See more »\n\nThe Pop Factory (TPF) is a music and media complex in Porth, Rhondda, South Wales.\n\nNew!!: Pino Palladino and The Pop Factory · See more »\n\nThe Promise is the 18th studio album by Earth, Wind & Fire.\n\nNew!!: Pino Palladino and The Promise (Earth, Wind & Fire album) · See more »\n\nThe Promise is a jazz album released in 1995 by John McLaughlin on Verve Records.\n\nNew!!: Pino Palladino and The Promise (John McLaughlin album) · See more »\n\n\"The Real Me\" is a song written by Pete Townshend on The Who's second full-scale rock opera, Quadrophenia in 1973.\n\nNew!!: Pino Palladino and The Real Me (The Who song) · See more »\n\nThe Road to Escondido is an album by J. J. Cale and Eric Clapton.\n\nNew!!: Pino Palladino and The Road to Escondido · See more »\n\nThe Search for Everything is the seventh studio album by American singer-songwriter John Mayer, released by Columbia and Sony Music on April 14, 2017.\n\nNew!!: Pino Palladino and The Search for Everything · See more »\n\nThe Search for Everything World Tour was a concert tour by American recording artist John Mayer in support of his seventh studio album The Search for Everything (2017).\n\nNew!!: Pino Palladino and The Search for Everything World Tour · See more »\n\nThe Search for Everything: Wave One (also shortened as Wave One) is an extended play (EP) by American singer John Mayer.\n\nNew!!: Pino Palladino and The Search for Everything: Wave One · See more »\n\nThe Search for Everything: Wave Two (also shortened as Wave Two) is an extended play (EP) by American singer-songwriter John Mayer.\n\nNew!!: Pino Palladino and The Search for Everything: Wave Two · See more »\n\nThe Second Coming Tour was a concert tour by American R&B/soul singer D'Angelo.\n\nNew!!: Pino Palladino and The Second Coming Tour (D'Angelo) · See more »\n\nThe Secret of Association is the second album by the English singer Paul Young.\n\nNew!!: Pino Palladino and The Secret of Association · See more »\n\nThe Seeds of Love is the third studio album by the British rock/pop band Tears for Fears, released on 25 September 1989, four years and seven months after Songs From The Big Chair.\n\nNew!!: Pino Palladino and The Seeds of Love · See more »\n\nThe Shouting Stage is a studio album by British singer-songwriter Joan Armatrading.\n\nNew!!: Pino Palladino and The Shouting Stage · See more »\n\nThe Soultronics was an American R&B and neo soul supergroup that served as the backing band for musician D'Angelo in 2000 during The Voodoo Tour, the supporting tour for his second studio album Voodoo.\n\nNew!!: Pino Palladino and The Soultronics · See more »\n\nThe Strat Pack: Live in Concert is a film of a September 24, 2004, concert featuring Joe Walsh, Gary Moore, Brian May (playing the Sunburst Stratocaster, in the opening set, rather than his signature guitar Red Special), Hank Marvin, David Gilmour, Mike Rutherford and many more, marking the 50th Anniversary of the Fender Stratocaster guitar.\n\nNew!!: Pino Palladino and The Strat Pack · See more »\n\nThe Village Sessions is an EP released by artist John Mayer on December 12, 2006.\n\nNew!!: Pino Palladino and The Village Sessions · See more »\n\nThe Webb Sisters are a musical duo comprising the siblings Charley and Hattie Webb who are from Kent, England.\n\nNew!!: Pino Palladino and The Webb Sisters · See more »\n\nThe Who are an English rock band formed in 1964.\n\nNew!!: Pino Palladino and The Who · See more »\n\nThe Who performed three times in 2005, at a 46664 concert in Norway, at a charity performance in New York City and as part of the Live 8 concert in London.\n\nNew!!: Pino Palladino and The Who 2005 performances · See more »\n\nThe Who did four major performances in 2010, one as the halftime act for Super Bowl XLIV, one a benefit performance during the series of Teenage Cancer Trust concerts in London and one at the FIFA Kick-off Celebration Concert at Orlando Stadium in Soweto, South Africa.\n\nNew!!: Pino Palladino and The Who 2010 performances · See more »\n\nThe Who performed only once in 2011, playing four songs during a benefit concert for the Killing Cancer charity in London.\n\nNew!!: Pino Palladino and The Who 2011 performances · See more »\n\nBilled as The Who Hits 50!, The Who's 2014–16 tour was a tour celebrating the 50th anniversary of the band.\n\nNew!!: Pino Palladino and The Who Hits 50! · See more »\n\nThe Who Hits 50! is a compilation of singles by the English rock band The Who, released in 2014 by Polydor Records.\n\nNew!!: Pino Palladino and The Who Hits 50! (album) · See more »\n\nThe Who Tour 2002 was a tour by The Who, partially in support of the DVD The Who & Special Guests: Live at the Royal Albert Hall.\n\nNew!!: Pino Palladino and The Who Tour 2002 · See more »\n\nThe Who embarked upon a series of live shows in 2004, including the band's first ever performances in Japan and their first in Australia since 1968.\n\nNew!!: Pino Palladino and The Who Tour 2004 · See more »\n\nThe Who Tour 2006–2007 was The Who's first worldwide concert tour since 1997, supporting their Endless Wire album.\n\nNew!!: Pino Palladino and The Who Tour 2006–2007 · See more »\n\nThe Who Tour 2008–2009 was The Who's first \"greatest hits\" concert tour since their successful world tour for their Endless Wire album.\n\nNew!!: Pino Palladino and The Who Tour 2008–2009 · See more »\n\nThe Who's 2012–2013 tour was their third to feature the 1973 album Quadrophenia.\n\nNew!!: Pino Palladino and The Who Tour 2012–2013 · See more »\n\nThen and Now is a 2004 greatest hits compilation album by The Who released internationally by Polydor Records and by Geffen Records in the United States.\n\nNew!!: Pino Palladino and Then and Now (The Who album) · See more »\n\nThings Fall Apart (also referred to as When Things Fall Apart) is the fourth studio album by American hip hop band The Roots, released February 23, 1999 on Geffen Records.\n\nNew!!: Pino Palladino and Things Fall Apart (album) · See more »\n\nThousand Roads is the third solo studio album by the rock artist David Crosby, a founding member of Crosby, Stills, and Nash.\n\nNew!!: Pino Palladino and Thousand Roads · See more »\n\nTony O'Malley (born 15 July 1948 in Bushey, Hertfordshire) is a British composer, singer, arranger, and keyboard player.\n\nNew!!: Pino Palladino and Tony O'Malley (musician) · See more »\n\nTouchstone for Manu is a jazz compilation album by Manu Katché.\n\nNew!!: Pino Palladino and Touchstone for Manu · See more »\n\nThe following are the musicians who have performed with pop singer Phil Collins during Collins's solo career.\n\nNew!!: Pino Palladino and Touring and studio musicians of Phil Collins · See more »\n\nTry! is the first live album by the John Mayer Trio.\n\nNew!!: Pino Palladino and Try! · See more »\n\nTwenty Four Seven is the tenth solo studio album by Tina Turner, released on Parlophone/Virgin in 1999.\n\nNew!!: Pino Palladino and Twenty Four Seven (Tina Turner album) · See more »\n\nThe Twenty Thirteen Tour was a concert tour by industrial rock band Nine Inch Nails to support the album Hesitation Marks.\n\nNew!!: Pino Palladino and Twenty Thirteen Tour · See more »\n\nUndiscovered Soul is the second solo studio album from Richie Sambora the guitarist from New Jersey band Bon Jovi.\n\nNew!!: Pino Palladino and Undiscovered Soul · See more »\n\nVolcano is the second solo album (fourth album overall) by American singer-songwriter Edie Brickell, released in 2003.\n\nNew!!: Pino Palladino and Volcano (Edie Brickell album) · See more »\n\nVoodoo is the second studio album by American neo soul singer and multi-instrumentalist D'Angelo.\n\nNew!!: Pino Palladino and Voodoo (D'Angelo album) · See more »\n\nVulfpeck is an American funk group founded in 2011.\n\nNew!!: Pino Palladino and Vulfpeck · See more »\n\nWalking Shadows is a studio album by jazz saxophonist Joshua Redman, released in 2013.\n\nNew!!: Pino Palladino and Walking Shadows · See more »\n\nWarren Bruce Cuccurullo (born December 8, 1956 in Brooklyn, New York) is an American musician, singer, songwriter and former body builder who first worked with Frank Zappa during the 1970s.\n\nNew!!: Pino Palladino and Warren Cuccurullo · See more »\n\nWayne Krantz is an American guitarist and composer.\n\nNew!!: Pino Palladino and Wayne Krantz · See more »\n\nWelsh Italians are an ethnic minority of Italian or mixed Italian and Welsh descent living in Wales.\n\nNew!!: Pino Palladino and Welsh Italians · See more »\n\nWhere the Light Is: John Mayer Live in Los Angeles, commonly referred to as Where the Light Is, is a live album and concert film by American blues-rock musician John Mayer.\n\nNew!!: Pino Palladino and Where the Light Is (John Mayer album) · See more »\n\n\"Wherever I Lay My Hat (That's My Home)\" is a song written by Marvin Gaye, Barrett Strong and Norman Whitfield, and first recorded by Gaye in 1962.\n\nNew!!: Pino Palladino and Wherever I Lay My Hat (That's My Home) · See more »\n\nWhite City: A Novel is a solo concept album by English musician Pete Townshend of rock band the Who.\n\nNew!!: Pino Palladino and White City: A Novel · See more »\n\nWho Else! is the seventh studio album by guitarist Jeff Beck, released on 16 March 1999 through Epic Records.\n\nNew!!: Pino Palladino and Who Else! · See more »\n\n\"Who Says\" is the thirteenth single released by American singer-songwriter John Mayer, and the first to be released from his fourth studio album, Battle Studies.\n\nNew!!: Pino Palladino and Who Says (John Mayer song) · See more »\n\n\"Why Don't You Try\" is a song by American recording artist Kelly Clarkson, from her fifth studio album, Stronger (2011).\n\nNew!!: Pino Palladino and Why Don't You Try · See more »\n\nWillie Weeks (born August 5, 1947) is an American bass guitarist.\n\nNew!!: Pino Palladino and Willie Weeks · See more »\n\nWire & Glass (subtitled \"Six songs from a mini-opera\") is the only EP released from the Who's 2006 album, Endless Wire.\n\nNew!!: Pino Palladino and Wire & Glass · See more »\n\nWise Up Ghost is a collaborative studio album by British singer/songwriter Elvis Costello and American hip hop group The Roots.\n\nNew!!: Pino Palladino and Wise Up Ghost · See more »\n\n\"Woman in Chains\" is a song by the English band Tears for Fears, released as the second single from their 1989 album The Seeds of Love.\n\nNew!!: Pino Palladino and Woman in Chains · See more »\n\nWord of Mouth is the third album by Mike + The Mechanics, released in 1991.\n\nNew!!: Pino Palladino and Word of Mouth (Mike + The Mechanics album) · See more »\n\nWorking Girl (Original Soundtrack Album) is the soundtrack to the 1988 Oscar-winning hit film Working Girl.\n\nNew!!: Pino Palladino and Working Girl (Original Soundtrack Album) · See more »\n\nWorld Falling Down is the fourth solo album for music artist Peter Cetera, released in June 1992, and his third album since leaving the group Chicago.\n\nNew!!: Pino Palladino and World Falling Down · See more »\n\nWorldwide Underground is the third studio album by American R&B and neo soul musician Erykah Badu, released September 16, 2003, on Motown Records. Recording sessions for the album took place during 2003, following Badu's period of writer's block and her performing on the Frustrated Artist Tour. Production was handled primarily by production group Freakquency, which consists of Badu, Rashad Smith, James Poyser, and RC Williams. Prominently incorporating hip hop and funk elements, the album features an unconventional musical structure and minimal songwriting concerning hip hop culture, love, ghetto life, and gang culture.King, Aliya S. \"\". Vibe: 147. November 2003.Jones, Steve.. USA Today. Retrieved 2009-08-09.Christgau, Robert. \"\". The Village Voice: October 21, 2003. Archived from on 2009-08-09.Chauhan, Sunil.. Stylus Magazine. Retrieved 2009-11-11. The album debuted at number three on the U.S. ''Billboard'' 200 chart, selling 143,561 copies in its first week. It earned gold certification from the Recording Industry Association of America and produced three singles that achieved moderate chart success. Upon its release, Worldwide Underground received generally lukewarm reviews from critics. The album has sold 609,000 copies in the United States.\n\nNew!!: Pino Palladino and Worldwide Underground · See more »\n\nWorth the Wait is the debut extended play by Canadian country artist Lindsay Ell.\n\nNew!!: Pino Palladino and Worth the Wait (EP) · See more »\n\nYes I Am is the fourth studio album by American singer-songwriter Melissa Etheridge, released by Island Records on September 21, 1993 (see 1993 in music).\n\nNew!!: Pino Palladino and Yes I Am (Melissa Etheridge album) · See more »\n\nAdelmo Fornaciari Cavaliere di Gran Croce OMRI (born 25 September 1955), more commonly known by his stage name Zucchero Fornaciari or simply Zucchero, is an Italian singer-songwriter and musician, with an Order of Merit of the Italian Republic.\n\nNew!!: Pino Palladino and Zucchero Fornaciari · See more »\n\n...But Seriously is the fourth solo studio album by English rock musician Phil Collins.\n\nNew!!: Pino Palladino and ...But Seriously · See more »\n\n100,000,000 Bon Jovi Fans Can't Be Wrong is a boxed set released in 2004 on Island Records.\n\nNew!!: Pino Palladino and 100,000,000 Bon Jovi Fans Can't Be Wrong · See more »\n\nThe 2005 Bonnaroo Music Festival took place from June 10–12, and more than 75,000 people were in attendance.\n\nNew!!: Pino Palladino and 2005 Bonnaroo Music Festival · See more »\n\n21 is the second studio album by English singer-songwriter Adele.\n\nNew!!: Pino Palladino and 21 (Adele album) · See more »\n\nRedirects here:\n\nPINO PALLADINO, Pino Paladino, Pino Palidino.\n\nReferences\n\n[1] https://en.wikipedia.org/wiki/Pino_Palladino"}], "Pino Palladino is a bass guitarist.": [{"url": "https://www.udiscovermusic.com/stories/pino-palladino-interview/", "page_content": "Photo: Cedric Ribeiro/Getty Images\n\n“All musicians are the same, we all think we’re rubbish,” Pino Palladino told a British television interviewer in 2013, adding a gentle laugh. It was a typically massive understatement from the quietly affable Welsh bassist, among the highest-regarded session players in the music industry. In this case, Palladino was referring to hearing Paul Young’s “Wherever I Lay My Hat” on the radio for the first time in 1983 – particularly his casual contribution, one of the most recognizable bass lines of the 1980s. “I was worried that it sounded a bit out of tune,” he said.\n\nIn a decades-long career, Palladino has not only provided low-end support for several musical revolutions, he’s helped stoke a few of them himself, undergirding pioneering sounds in pop, New Wave, neo-soul, electronic, rock, jazz, funk, and even industrial with an ever-inventive foundation. He’s widely regarded as one of the most influential bass players ever, with just as much name recognition in certain quarters as the superstars he’s backed.\n\nBeginning with Gary Numan in 1982 and continuing through work with artists like Young, Phil Collins, Tears for Fears, Go West, and Chris de Burgh, Palladino helped define the coolly emotive 80s sound with his trademark fretless technique. In the 1990s he backed Elton John, Eric Clapton, Carly Simon, Bryan Ferry, Joan Armatrading, B.B. King, and many more, before joining the legendary Soulquarians artists collective, reviving cosmic soul and funk sounds with Erykah Badu, D’Angelo, Questlove, and J. Dilla.\n\nADVERTISEMENT\n\nFrom there, it was on to stints with Mika, Nine Inch Nails, Adele, Kelly Clarkson, Paul Simon, and Keith Urban, among a wealth of others, as he also embarked on longtime touring associations with Jeff Beck and John Mayer. Palladino’s most famous stretch came with The Who, when he stepped in after John Entwistle’s untimely death in 2002 to tour and record for two decades, playing probably the most famous bass solo in pop – 1965’s “My Generation” – for arena-sized crowds. Most recently, he’s played for Harry Styles, Ed Sheeran, Corinne Bailey Rae, and John Legend. You can’t talk about Pino Palladino without mentioning a few names.\n\nNow, at last, Pino Palladino is releasing an album of his own, collaborating with guitarist Blake Mills. Called Notes with Attachments, the record summons intimate, cinematic moods, bristling with sophisticated patterns, atmospheric woodwinds, and surprising electronic touches. It’s a compendium of several decades’ worth of Palladino’s compositional ideas, complex, and contemporary yet warm with nostalgia – paying homage to the classic film soundtracks, cool jazz, and Burt Bacharach arrangements he loves.\n\nIn honor of the new release, we accompanied the lauded bassist on a trip down memory lane, revisiting some of his best-known album and tour appearances.\n\nTear for Fears, Seeds of Love (1989)\n\nPino Palladino: I have a lot of great memories of that album, not least because my daughter Fabiana was born around the time we were recording it. My life was changing in a big way. I had been doing a lot of session work with the French drummer Manu Katché, who toured with Peter Gabriel. We were becoming known as a rhythm section together, and a bit in demand. I believe that’s how Roland Orzabal heard of us and invited us onto the album.\n\nThe actual recording was unusual for the time; the tracks were cut live with a full band. We holed up together for a few weeks in Townhouse Studios in London, and went through each of the songs, experimenting with instrumentation and arrangement. There were some days when we just jammed and extended parts of the songs. Roland then took the whole bundle and edited it down into what you hear on the album. We must have recorded “Badman’s Song” and “Woman in Chains” a dozen different ways with different transitions. Roland’s choices and his taste as the composer, defined the amazing end results.\n\n\n\nWatch this video on YouTube Click to load video\n\nOne of my fondest memories: When I first got there, I was going into the control room and I heard this incredible piano-playing in the studio. I was wondering, “Who is that?” I went round the corner and there was Oleta Adams, sitting at the grand piano and singing so beautifully, jamming away on gospel and blues. I’m honored to have played on her solo album Circle of One.\n\nThe Seeds Of Love can be bought here.\n\nElton John, The One (1992)\n\nPino Palladino: We recorded in Paris at Studio Guillaume Tell. Well, the food in Paris was excellent. We would end every day going out to dinner at high-end restaurants with the table piled up with dishes. It was really something to keep up with…but I rose to the challenge!\n\nWorking on that record and spending time with Elton was humbling. I remember one day, Bernie Taupin faxed some song lyrics over in the morning, and Elton took them into the next room and had an amazing song written within an hour…incredible! At this time I was really known for my fretless bass sound, it was something people specifically hired me for. Elton encouraged me to develop my ideas for the basslines and let me do my thing on the record.\n\n\n\nWatch this video on YouTube Click to load video\n\nErykah Badu, Mama’s Gun (2000)\n\nPino Palladino: This was during the Soulquarians period, it was a real fun time. I made the connection because Ahmir [“Questlove” Thompson] had called me in to add to one of the songs he was working on. We thought I would just overdub the bass on one track, but it felt really good and we built up a vibe. Erykah had booked time at The Lady and we reconvened at a later date.\n\nErykah’s way of working was refreshing. For Mama’s Gun, Erykah had sketched out a couple ideas for the album, and had a vision of what she wanted, but otherwise it was pretty undetermined at that point. We all assembled, the whole band, and Erykah just came around, so cool in her way, and asked “OK, Pino, what you got?” That was it. “What you got?” We played around with some different ideas, and it turned into a collaboration, developing the songs together. I played a bassline I had in my mind for a while, and that became the first song on the album, “Penitentiary Philosophy.”\n\nOddly enough, it reminded me of when I was getting started, working with Gary Numan on the I, Assassin album in 1983. Back then, I showed up and Gary had recorded his songs but didn’t have bass parts on them. He wanted me to come up with ideas and gave me complete freedom to compose the parts for the songs. I played my fretless bass and that sound became the sonic signature for the record. What made it different with Erykah, is that this time I got a songwriting and production credit.\n\nListen to Mama’s Gun here.\n\nD’Angelo, Voodoo (2000)\n\nPino Palladino: Being a part of that moment when this album and Mama’s Gun came out almost back to back was thrilling. After meeting D on a session with B.B. King, he invited me to meet him and his engineer, Russ Elevado, at Electric Lady Studios with a view to me playing some bass on the songs for his upcoming record, Voodoo.\n\nWhen they played some of the songs for me, I was mesmerized by the unique feel of the grooves and D’s otherworldly vocal arrangements. D’Angelo had written the songs for Voodoo at the keyboard and while his left hand would play what would become the blueprints for the basslines, his right hand plays the chords and flourishes that accompany the main melody. It all fits together in such a unique way… The basslines are woven into the fabric of the composition from the start.\n\n\n\nWatch this video on YouTube Click to load video\n\nAlthough some songs were established when I got there, others were left more open to develop ideas and for me, some freedom of expression, from adding in passing notes to flurries up to the top of the bass neck to complement his vocals. Because the album is so bass- and rhythm-driven, everything mattered, it was all at the top of the mix, he encouraged me to bring my thing to the music and, through him, I met Erykah, Quest, James Poyser, Roy Hargrove, J Dilla, Common, and all the Soulquarian collective.\n\nListen to Voodoo here.\n\nAdele, 21 (2011)\n\nPino Palladino: I was back in London when [producer] Rick Rubin reached out to me about recording a new album for Adele. She had already made a name for herself in the UK before she broke worldwide, so I had heard of her. Rick told me, “I want to get you into this fantastic band, with drummer Chris Dave, Matt Sweeney and Smokey Hormel on guitars, James Poyser on piano, and really give her the strong backing she deserves.” I flew out to Shangri-La studios in California where they were recording, and she just killed it on the vocals from the start. I remember hearing her voice for the first time through my headphones and being blown away by how she could sing. The songs were really great and I knew we were recording something special.\n\nMika, The Origin of Love (2012)\n\nPino Palladino: Mika has certainly got some incredible energy, he would bounce around the studio with all these ideas. Mika brought a lot of curiosity to the process, he would come up with things while I was playing. He was interested to hear fretless bass on some of the songs and liked how it fitted in. I believe I was hooked up with him through Nick Littlemore from Empire of the Sun. Working on a more electronic-oriented pop album was interesting. It’s great to get the opportunity to expand what you do, and try out different directions.\n\n\n\nWatch this video on YouTube Click to load video\n\nNine Inch Nails, Hesitation Marks (2013)\n\nPino Palladino: Trent [Reznor] reached out to me, out of the blue, and asked if I would be interested in collaborating on a couple of tracks for the album. I was really curious how I would fit in with his sound. Trent is a very good communicator, with clear ideas. He is a fan of Voodoo and of Gary Numan, so for me that was interesting as I could maybe bring two different sides of my playing to the music. I played a couple of takes on each song and just did my thing. Later, Trent’s manager called and asked if I would be interested in touring. It turned out that the band had already been rehearsing for a month. It was a real challenge to learn the songs in a short amount of time before we went on the road. And I had no idea how his fans would react to me. But Trent gave me a lot of room, and that ended up being a memorable tour. The whole band was so tight, and the light show, along with the visual effects, was on another level from anything I’ve been a part of.\n\nThe Who, Endless Wire (2006) and touring after John Entwistle’s death\n\nPino Palladino: In 2002, I was working on Common’s Electric Circus album and I was about to fly home to London from Philadelphia, when my wife called me at the hotel and said, “You just got a call from the Who’s management” She gave me the tragic news that John Entwistle had just died, and they wanted to know if I could step in so they could continue the tour. There was going to be a concert at the Hollywood Bowl a few days later. After speaking to their management, I flew to LA later that day to rehearse for the gig and the following tour.\n\nI had spent some time with John. He was smart, funny, charismatic. He was a superstar. And, of course, an idol as far as bass-playing goes. I had worked with Pete [Townshend] as well, and Roger [Daltrey]. When I flew into LA, Pete was waiting for me at the hotel with a stack of CDs. “Just learn what you can,” he told me. Stylistically, I was not in that space at all at the time – I was doing hip-hop, funk, soul. So it was a complete reset for me. The first thing I did was change the strings on my bass to get a brighter sound, like John had. I pretty much didn’t sleep that night, and learned as much as I could. I think I pulled it off, because they kept me on!\n\nI just worked on their recent record [2019’s WHO]. Endless Wire was the first studio record they made after John’s tragic death, and that was less of a “band” experience. Pete had done a number of demos, obviously some with John in mind to a certain degree. I’d ask Pete if I was doing all right, and he would turn to me and say, “Play more.” He didn’t elaborate, just “play more.” And I understood. Some people would think of it as overplaying, but the classic sound of The Who is Keith Moon on drums and John Entwistle on bass just making this unholy racket. So that’s what I aimed for.\n\n\n\nWatch this video on YouTube Click to load video\n\nHarry Styles, “Watermelon Sugar” (2020)\n\nPino Palladino: I was rehearsing with John Mayer at Henson Studios in Hollywood, which was the former A&M Studios, and before that the Charlie Chaplin Studios. Beautiful history there. Harry was recording in the same studios, down the hall. John knew him and introduced me to Harry. Harry and his producers played me a few songs to see which ones I felt I could add to, including “Watermelon Sugar.” If you listen to the bass line in that song, it’s very well-defined and echoed by the guitar line. There wasn’t really a lot of room to move. Well, I started getting a little free with it, trying stuff, and Harry jumped up and said, “That! Can you do more of that?” It’s an honor that I get invited to play on these songs. It’s going to be a hit with or without me. So I feel very fortunate to be asked to contribute.\n\nPino Palladino and Blake Mills, Notes With Attachments (2021)\n\nPino Palladino: This record is a culmination of what I’ve been thinking about through much of my career. I’ve been recording many of these ideas over a long period of time as I’ve toured and collaborated with many musicians and artists that I admire. What interested me in making my own album was having the chance to focus on compositional elements, rather than the bass taking the lead. Maybe some listeners have been surprised that there are woodwinds and other instruments in the foreground. It’s not me showing particular prowess on my instrument, but to define the role of the bass as a signature part of a song is the challenge I enjoy. I’ve always loved instrumental music, from jazz to film soundtracks. I want my music to invoke some of those qualities.\n\nSome of the ideas on the album evolved from my time touring with D’Angelo and the Soultronics, that kind of beat-driven music, but with beautiful elements and touches, but also from many other types of music that I love. When I played some of these ideas originally for Blake, he was very encouraging and, as we started working on the songs, it quite naturally became a collaboration. Blake, along with all the incredible musicians on the record, have all given so generously to the project, I’m very fortunate to have had the opportunity to make this album. It’s a very interesting process for me, having my own music released. It feels like part of my DNA is suddenly out there. The album was recorded two years ago. But people have told me that it speaks to the moment, that they’re listening to it through this complex time and enjoying it. That’s really nice to hear.\n\nListen to Pino Palladino and Blake Mills’ Notes with Attachments here."}, {"url": "https://www.theguardian.com/music/2021/apr/06/pino-palladino-pop-greatest-bassist-adele-elton-the-who", "page_content": "By his own admission, Pino Palladino is not a man much accustomed to giving interviews. “Very reticent,” he nods during a Zoom call, his accent speaking noticeably louder of his childhood in Cardiff than his current home in LA. “You know, there was a time when I was featured in all sorts of musicians’ magazines, and then I just thought to myself, ‘Move over, there’s people out there that actually need the publicity.’ Not to blow smoke up my own arse,” he adds hurriedly, “but really I just didn’t want to see or hear from myself.”\n\nIt’s a remark in keeping with the astonishing career of one of the most celebrated bass players in the world. It’s hard not to blanche when you consider the sheer number of records that have been sold featuring his work. He played on not one but two of the biggest selling albums of the 21st century: Adele’s 21 and Ed Sheeran’s Divide, as well as with Rod Stewart, Elton John, Bryan Ferry, Simon and Garfunkel and Keith Richards. They’re the biggest names in a startlingly diverse back catalogue of collaborations: Palladino’s playing is the thread that links Perfume Genius with Phil Collins, Harry Styles with Chris de Burgh, and Nine Inch Nails with De La Soul. Indeed, his versatility and omnipresence is a running joke within the music industry. When another fabled bass player, Pink Floyd’s Guy Pratt, got married, he opened his groom’s speech with the words: “I’m only here today because Pino couldn’t make it.”\n\nFor a musician who seems to have turned up everywhere over the last 40 years, Palladino has remained a remarkably anonymous figure outside of musicians’ circles. Indeed, he somehow contrived to spend 14 years as a member of the Who without really losing what he calls an “invisible stance”. He certainly stands out in photographs of the Soulquarians, the experimental collective assembled by D’Angelo for his legendary album Voodoo, the solitary lanky Welshman among a crowd of African-American musicians including Questlove and the late J Dilla – but you would still struggle to recognise him in the street.\n\nCardiff’s finest … Palladino in 1985. Photograph: Paul Natkin/Getty Images\n\nThis is presumably how Palladino likes it. He’s drily funny and self-deprecating – he says his default setting when working with a new artist is “do not fucking spoil it” – but doesn’t seem terribly frustrated by life in the background. Which makes it all the more surprising that he’s releasing an album on which he shares billing with Blake Mills: Notes With Attachments, a fascinating, head-turning collection of experimental instrumentals that sits somewhere between jazz, global music and ambient. He and Mills, who has produced for Fiona Apple and Laura Marling, met while working on a John Legend album. “We hit it off and the next thing you know, he’s saying to me ‘Have you thought about a solo album?’ Well, I’ve thought about it, obviously,” he laughs. “For 40 years I’ve thought about it, but I’ve never really had an idea how I could do it.”\n\nStudded with guest appearances – from avant-garde saxophonist Sam Gendel and jazz drummer Chris Dave, among others – Notes With Attachments foregrounds the sound that made Palladino’s name: the none-more-80s sprrroing of the fretless bass put through a chorus pedal. He first used it while working with Gary Numan, but it was Paul Young’s 1983 hit Wherever I Lay My Hat that introduced it to a mass audience: pushed up in the mix, the bass effectively became a lead instrument. It was so striking that Palladino suddenly found himself playing with everyone from Go West and Don Henley to Tears for Fears: he turned up on Top of the Pops with alarming regularity, the musical equivalent of a hip item of designer clothing. “There was a lot of it around in those days,” he says of the sound. “I was so lucky – it resonated with people, captured their imagination and it took on a life of its own. It did get to the point where I was getting booked for sessions and feeling like a performing monkey: ‘Yeah, bring your fretless, make that funny sound and maybe we’ll get a hit out of it.’”\n\nHe also found himself becoming the sideman of choice for the rock aristocracy. “The first call I got like that was from David Gilmour. I could not believe it: am I going to the studio with this guy and pretend I actually belong there? I was nervous as fuck, but the drummer on the session was Jeff Porcaro [famed for playing with Toto and on Michael Jackson’s Thriller album], and he was really sweet: ‘Come on, man, chill out, have a smoke on this.’ So I did, and that seemed to work for me. I just had to keep that attitude through all of that period: phone calls from Elton John and Phil Collins – you have to keep that headspace that you belong, even if you think you’re going to be found out any minute.”\n\n‘You’ll have to play louder!’ … performing with the Who at the 2016 Desert Trip festival in California. Photograph: Kevin Mazur/Getty Images\n\nHe says another phone call, this time from D’Angelo – who had heard his playing on a BB King album – changed his life. “My roots are in Motown, reggae, R&B. I didn’t get much of an opportunity to express that side of music and then I met the don – how lucky was that? D’Angelo – I’d mention him in the same breath as Stevie Wonder and Donny Hathaway and Sly Stone. When I was in the studio with D and Questlove, James Poyser, all those guys, I don’t even have to think about what I’m playing. It’s incredible, to be a Welsh guy, having no real connections to these guys other than music that we loved and played. From a personal satisfaction point of view, it was as good as it ever got, probably will get.\n\n“It took people 10 years, 20, to really get the first album we made, Voodoo, but I absolutely knew it was unique and really special – I was probably more aware of it than the rest of them, because I’d been working for a long time. I knew this kind of thing didn’t come around very often.”\n\nThe Soulquarians went on to record with Erykah Badu, Mos Def and Talib Kweli; the influence of their loose approach can be heard on Kendrick Lamar’s epochal 2015 album To Pimp a Butterfly. They had just wrapped up a session with Common when Palladino learned that the Who’s bassist, John Entwistle, had died – and that the band had declined to cancel their forthcoming tour and wanted Palladino to replace him … on stage at the Hollywood Bowl, in two days.\n\n“I flew to LA, thinking, what are you doing? You don’t even know many Who songs. Pete Townshend was waiting for me at the hotel, with a big stack of CDs. ‘You don’t know much of the catalogue? Fair enough. You’re going to know it tonight, then, aren’t you?’ At the first rehearsal, Pete comes over and says: ‘You’re going to have to play louder’ – because I’m used to being the sympathetic musician, who fills in, doesn’t make a racket. That’s the one instruction you keep getting when you work with the Who: ‘Fucking turn it up, we can’t hear you!’”\n\nPalladino says he’s “not exactly crazy about touring any more” – he stopped playing live with the Who in 2016 – but is considering doing some gigs around Notes With Attachments, pandemic permitting. Until then, there are still sessions to attend to in LA, with Covid tests in the car park for anyone taking part. “Film and music studios are considered essential to the economy here – you’ve got to love that, right?” he laughs. “Mind you,” he says, “that’s better than Britain telling you if you’re a musician or an artist you might have to look for a new job.”"}, {"url": "https://www.musicradar.com/news/in-a-rare-interview-bass-legend-pino-palladino-reflects-on-replacing-the-whos-john-entwistle-on-two-days-notice", "page_content": "Welsh bass virtuoso Pino Palladino has enjoyed a prolific career as a session musician, recording with pop superstars such as Adele and Ed Sheeran, playing bass in The Who after John Entwistle's death, and collaborating with the likes of D'Angelo, John Mayer, Elton John and many more.\n\nWhat Palladino isn't is a prolific interviewee, preferring to let his bass guitar do the talking. But in an interview published today in The Guardian, he has spoken of the moment in 2002 when Pete Townshend called. John Entwistle had passed away: would Palladino fill in on the tour?\n\n“I flew to LA, thinking, what are you doing? You don’t even know many Who songs,“ said Palladino. Townshend was prepared, presenting him with a stack of CDs.\n\nThat’s the one instruction you keep getting when you work with the Who: ‘Fucking turn it up, we can’t hear you!‘\n\nAs a session player who had overcome imposter syndrome to sit in with the likes of David Gilmour and Elton John, there was no question Palladino would get The Who's set down pat. But only after some helpful advice from Townshend.\n\n“At the first rehearsal, Pete comes over and says: ‘You’re going to have to play louder’ – because I’m used to being the sympathetic musician, who fills in, doesn’t make a racket,“ said Palladino. That’s the one instruction you keep getting when you work with the Who: ‘Fucking turn it up, we can’t hear you!’”\n\nPalladino also speaks about his career through the 80s, when he was on speed dial for any pop star who needed some four-string flair in the low end. But in a career that saw him play on some of the top-selling albums of all time, Palladino considers his collaboration with neo soul pioneer D'Angelo, as bassist of the Soulquarians, the personal highlight.\n\n“D’Angelo – I’d mention him in the same breath as Stevie Wonder and Donny Hathaway and Sly Stone,“ said Palladino. “It’s incredible, to be a Welsh guy, having no real connections to these guys other than music that we loved and played.“\n\nPalladino has just released Notes With Attachments with the Californian guitarist and composer Blake Mills, available now through New Deal Records. You can read his interview with The Guardian here."}, {"url": "https://www.allaboutjazz.com/musicians/pino-palladino", "page_content": "Pino Palladino was featured on Gary Numan's 1982 album I, Assassin, in which his fretless bass sound made a prominent contribution to the overall sound of the album. He went on to play fretless bass with a healthy number of high-profile artists that include (on the short list), David Gilmour, Tears for Fears, Pete Townshend, Peter Gabriel, Joan Armatrading, Phil Collins, Chaka Khan and Don Henley.\n\nPalladino began playing the electric guitar at age 14. By age 17 he decided to play the bass guitar, and bought his first fretless bass one year later, playing mostly R&B, funk, and reggae within a rock and roll backbeat. His first professional gig was at a local television station in Cardiff, where he began playing in 1978. That same year, at age 20, he joined Jools Holland's band and recorded with Holland on his album entitled, Jools Holland and His Millionaires. Palladino toured with Jools to support the album, which gave him the opportunity to purchase his own Music Man StingRay Fretless Bass. Holland was touring with another new band; the Q-Tips, whose frontman, Paul Young made acquaintance with Palladino whilst they were on tour, who would, a year later offer Pino a place in his own backing band.\n\nPalladino has joined several bands and ensembles through which he is most visible. He joined jazz trumpeter Roy Hargrove in forming The RH Factor, a band that mixes elements of soul, jazz, and R&B. He is a member of the John Mayer Trio, and was the first choice by Pete Townshend and Roger Daltrey to fill the position left by John Entwistle as the current bassist for The Who.\n\nPino Palladino (17 October 1957 in Cardiff, Wales, UK) is a Welsh bass guitarist of Italian ancestry. Palladino rose to public notice playing primarily rock and roll, blues rock, and rhythm and blues music, although he has been lauded for his ability to play most genres of popular music, including jazz, neo soul, and funk. Adding to his eclectic grasp and melodic approach on his instrument, he has become one of the most sought-after session players on the bass in the music industry. He has played on a large number of recordings by some of the world's most successful entertainers, in part, by mastering a variety of techniques on both his late 1970s fretless Music Man StingRay bass guitar and later in his career, adding fretted Fender Precision and Jaguar basses. His playing has earned him custom instruments bearing his name.\n\nAfter vocalist Paul Young landed his own solo contract, Palladino was brought in as part of his backing band \"The Royal Family\" in 1983 with noticeable chart success with the No Parlez album, and major hit singles both in the UK and Europe. Examples of Young's new found success were the band's cover of the Marvin Gaye classic \"Wherever I Lay My Hat (That's My Home)\", which reached No. 1 in the UK singles chart for three weeks in the summer of 1983, and \"Love of the Common People\". Palladino toured extensively at this time with Paul Young, remaining in the band for five years. 1983 additionally proved to be the year of another ensemble featuring Palladino, Paul Rodgers (formerly of Bad Company, drummer Kenney Jones, along with a rotating cast of other celebrity performers. The band only released one album through Atlantic; The Law, although there were enough out-takes that another bootleg-styled album followed in 1991. Sales were unremarkable, despite the names of those who recorded on the album.\n\nThroughout the 1980s Palladino was noted for his R&B roots on the fretless bass, even when supporting pop and rock heavy performers. One reviewer from Bass Player magazine points to Paul Young’s cover of the Bobby Womack/Rufus tune \"Stop On By\" (on 1990’s Other Voices), with its \"pre-hip-hop, swung funk groove\" as the precursor to Palladino's later neo-soul focus.\n\n1990s Changes in instrument\n\nIn the 1990s, Palladino began to alternate between the sounds achieved in playing the fretless bass to one with frets, as well as the 4-string and 6-string bass. At the time, he was well known within the industry for his fretless bass sound. However, now, depending on which artist he was supporting, and the song to be played, he began gravitating towards fretted bass. He was maturing as a musician, and played with artists as diverse as Melissa Etheridge, Richard Wright, Sir Elton John and Eric Clapton. Also in 1991 he joined Paul Rodgers (of Free, Queen+ Paul Rodgers, and Bad Company fame) to form the band The Law. In the mid 1990's, Palladino played bass for The London Metropolitan orchestra during their recording of \"An American Symphony\", soundtrack for the movie Mr Hollands Opus.\n\nPalladino supported Phil Collins, as a member of the house band for the Golden Jubilee of Elizabeth II, which played with Sir Paul McCartney, Eric Clapton, Cliff Richard, and Tony Bennett, among other notable performers. He later wrote that he felt privileged to have been amongst the others on stage in such an event.\n\nIn 1999, he began working with Richard Ashcroft, of The Verve, during the recording sessions of Ashcroft's debut solo album, Alone With Everybody. Richard proved to be mightily impressed by Pino's natural bass playing ability;\n\nThis Pino Palladino, I can say a Meters record and he can play me the bass line. He can play anything. He's one of the only people in the world who can totally replicate that kind of Beach Boys/scratch/Walker Brothers bass. You can get that sound if you want it, dead on. So it was very liberating working with him.\n\nPino also joined Ashcroft's touring band for the singer's first major solo outing throughout 2000.\n\nNeo Soul\n\nBy the mid- 1990s, Palladino had established himself as a busy, highly desirable bassist and a studio worker in many genres, but finally became visible to those artists who played largely left of center, and demand for his session playing grew within a different quarter. Palladino began moving from blues-rock toward neo soul projects. Palladino and Steve Jordan found themselves performing on the same session for B.B. King’s 1997 duets CD Deuces Wild. It was the first time soul singer D'Angelo first heard Palladino, who had just switched from a signature sound fretless bass sound to that of performing with fretted basses. The result was an invitation to \"use Pino’s big, behind-the-beat bass to help cast a neo-soul spell on his Grammy Award-winning Voodoo album\". It would not be his first uncredited Grammy performance.\n\nAs the word spread throughout the genre, Palladino found an increasing demand within the neo-soul genre. Examples of his bass work in this genre (in addition to D'Angelo) includes Mama's Gun, and \"Penitentiary Philosophy\" found on Erykah Badu’s 2000 CD. Other albums using Pino's sound include 1st Born Second for Bilal, Like Water for Chocolate and Electric Circus for Common. Palladino has been described by Steve Jordan, who got his own professional start playing the drums for Stevie Wonder as having a \"deep funk\" side and a \"melodic\" side. Palladino admits, that \"Of all my influences, I would say what’s always in the back of my mind is early Stevie Wonder, like Talking Book and Innervisions; that music is really in my blood.\"\n\n2000s\n\nFollowing the death of The Who's bassist John Entwistle in 2002, the eve before the band were to kick off their first world tour in years, Palladino was their first choice to become the band's full-time touring bass guitarist, and by 2006, he was invited to join the remaining original band members in recording their first album in twenty-four years. Pete Townshend, the band's composer, recorded the bassline on the majority of the songs to get the effect he himself wanted, with Palladino doing so on the other six of them. Released in October 2006, the album was named Endless Wire.\n\nPalladino also recently played with The Who at the Super Bowl XLIV half-time show, in February, 2010, alongside other backing artists: Simon Townsend on guitar, Zak Starkey, drums and percussion, and John \"Rabbit\" Bundrick, on keyboard instruments.\n\nPaul Simon\n\nIn 2003, Palladino intended to go down to see his old friend Paul Simon and meet Brian Eno for the first time. He was asked to record with them, and had to borrow a bass guitar to play. The result was that he played with Simon and Garfunkel on their \"Old Friends\" reunion tour and in an interview with Bass Player Magazine he mentions drummer Steve Gadd and percussionist Jamey Haddad \"had laid down some great grooves for me to add bass\". He had kept the recordings, and by the time that he appeared on the Old Friends: Live on Stage CD and DVD from the tour, he was able to use some of the material. He played on Paul Simon's 2006 release, Surprise.\n\nOther appearances\n\nPalladino has toured in the backing band for Joe Walsh. In 2004 he appeared to be playing with Gary Moore at the Wembley Arena.\n\nEmergence of the John Mayer Trio\n\nPalladino met Steve Jordan in the mid-1980s while both were working as session players on many occasions, which blossomed into a friendship. When their work brought them to the same place, they would meet, usually jam together, and introduce other musicians to one another, forming friendships which sometimes blossomed into good working relationships. Jordan has remained keen about Pino since he met him, and only grows more enthusiastic about his talents, which he describes partly as his love for, and ability to \"feel\" changes in music, through melodies, basslines, and an amazing connection with genres of nearly every kind. According to Jordan, he'd planned to meet up with John Mayer and Willie Weeks in January, 2005 to perform a benefit concert on a NBC sponsored telethon Tsunami Aid: A Concert of Hope to raise funds and public awareness benefiting victims in the aftermath of the tsunami that struck southeast Asia. Weeks was unable to make the performance, and Jordan suggested Palladino, who had heard some of Mayer's work, and was willing to come. Beginning a set that included the Jimi Hendrix classic, \"Bold as Love\", the three all agreed that they experienced such chemistry that they began talking right away about arranging their schedules to record a CD and a tour. The trio released the album Try!, on November 22, 2005. The eleven-track live album includes cover songs, such as Jimi Hendrix's \"Wait Until Tomorrow\" and \"I Got A Woman\" by Ray Charles, two songs from Mayer's release Heavier Things, as well as new songs written by Mayer. In addition, Mayer, Palladino, and Jordan wrote three songs on the album: \"Good Love Is On The Way\", \"Vultures\", and \"Try!\". Along with John Mayer on guitar and vocals, and Steve Jordan on drums, Palladino has toured and recorded as a member of the John Mayer Trio, and on Mayer's third album Continuum.\n\nRecent tours\n\nIn spring of 2006, Palladino toured with Jeff Beck. He also played with J. J. Cale, and Eric Clapton on their 2006 album The Road to Escondido, alongside other notable musicians, including Derek Trucks, and Billy Preston. It was to be Preston's last work before he died only days afterward.\n\nInfluences on bass guitar\n\nInfluences for Palladino for bass guitar include Motown bassist James Jamerson; Stevie Wonder’s keyboard-bass, jazz innovator Jaco Pastorius; British folk/rock upright bassist Danny Thompson; Norman Watt-Roy (of Ian Dury & the Blockheads); Larry Graham; Michael Henderson; Bootsy Collins; Paul Jackson; Anthony Jackson; Doug Rauch (of Carly Simon and Santana), and Billy Cobham.\n\nTechnique\n\nPino Palladino is noted for his use of the fretless bass in many 1980s chart records. While it was typical for a bass guitar in a commercial track to have a rather generic sound and stay \"playing the low notes\" Palladino preferred a different sound (combining fretless tone with an octave effect) and basslines that frequently added chords, lead lines and counter melodies in the higher range of the instrument as opposed to simply the aforementioned \"low notes\". Typical of this style was his playing on Paul Young's biggest chart hits, in particular his bass solo on \"Wherever I Lay My Hat (That's My Home)\". His equipment at that time included a fretless Music Man StingRay Bass 1979 and Boss Octave pedal (OC-2).\n\nPino Palladino signature model\n\nThe Fender Pino Palladino Signature Precision Bass is modeled after two of Pino's Fender Precision Basses. The body featuring faded fiesta red paint over desert sand paint is based on Pino's 1961 Precision Bass while the neck shape and round-lam rosewood fret board are based on Pino's 1963 sunburst Precision Bass.\n\nRecent projects\n\nPalladino joined Eric Clapton's touring band for 11 dates in the Eastern U.S. and Canada in May 2008. Current work has included work on an with Clapton and Robbie Robertson, and Palladino guested on bass for Amos Lee on his third album, Last Days at the Lodge.\n\nIn 2009, Palladino joined with keyboardist Philippe Saisse and Simon Phillips to form an instrumental trio: Phillips Saisse Palladino, an instrumental jazz/funk rock ensemble, which have toured Europe through 2009 into 2010, playing songs that spotlight the talents of each performer, in the manner of many jazz outfits. Show less"}, {"url": "https://www.radioswisspop.ch/en/music-database/musician/113328f03f18e37f9ea1690603e52e56c3109", "page_content": "Giuseppe Henry \"Pino\" Palladino[1] (born 17 October 1957) is a Welsh bassist. A prolific session musician, he is probably best known for playing with The Who (following the death of founding member John Entwistle[2]) from 2002 to 2016, D'angelo from 1996 to present, and the John Mayer Trio from 2005 to present.\n\nPalladino plays a late-1970s, fretless, Music Man StingRay bass guitar, a fretted Fender Precision, and a Jaguar bass. His playing has earned him custom instruments bearing his name.[3]\n\nEarly life\n\nBorn in Cardiff to an Italian father from Campobasso and a Welsh mother,[4] Palladino began playing electric guitar at age 14 and bass guitar at 17. He bought his first fretless bass one year later, playing mostly R&B, funk, and reggae with a rock and roll backbeat.[5]\n\nCareer\n\nPalladino was drawn to Motown and jazz at an early age. He attended Catholic school and took classical guitar lessons. He liked Led Zeppelin and Yes and started a rock band.[6]\n\nIn 1982, Palladino recorded with Gary Numan on the album I, Assassin. The producer of the album asked him to contribute to Paul Young's debut album. Young's cover version of \"Wherever I Lay My Hat (That's My Home)\" by Marvin Gaye became a hit in Europe,and subsequently joined Young's band the Royal family and Palladino received offers to record with Joan Armatrading, Go West, and David Gilmour. He cites as early influences James Jamerson, Danny Thompson, and Norman Watt-Roy and also admires Jaco Pastorius, Stanley Clarke, Bootsy Collins, Larry Graham, Michael Henderson, Anthony Jackson, Marcus Miller, and Rocco Prestia.[7]\n\nIn 1983, he joined The Law with Paul Rodgers, formerly of Bad Company, and drummer Kenney Jones, who succeeded Keith Moon in The Who after Moon died, and recorded the album The Law.\n\nIn the 1990s, Palladino alternated between fretless bass and fretted and 4-string and 6-string bass. He played with Melissa Etheridge, Richard Wright, Elton John, and Eric Clapton.\n\nHe played on Mike Lindup's first solo album, Changes with Dominic Miller on guitar and Manu Katché on drums.[8]\n\nIn 1999, he began working with Richard Ashcroft of The Verve on Ashcroft's debut solo album, Alone With Everybody.[9]\n\nThe Who's bassist John Entwistle died the night before the start of their first tour in two years. Palladino became the band's bass guitarist on tour. In 2006, he joined the remaining band members on their first album in twenty-four years, Endless Wire. He played with The Who at the Super Bowl XLIV half-time show in 2010 with Simon Townshend on guitar, Zak Starkey on drums, and John \"Rabbit\" Bundrick on keyboards. In 2012, he toured with The Who on their Quadrophenia revival.\n\nPalladino met Steve Jordan in the mid-1980s while both were working as session musicians, which blossomed into a friendship. Jordan credits Palladino's apparent ability to \"feel\" changes in music, through melodies, basslines, and an embrace of genres of nearly every kind. According to Jordan, he had planned to meet up with John Mayer and Willie Weeks in January 2005 to perform Tsunami Aid: A Concert of Hope for victims of the tsunami that struck southeast Asia. Weeks was unable to make the performance, and Jordan suggested Palladino, who had heard some of Mayer's work and was willing to come. Beginning a set that included the Jimi Hendrix song \"Bold as Love\", the three found a chemistry together. They recorded an album and toured as a trio.[10]\n\nThey released the album Try!, on 22 November 2005. The eleven-track live album includes cover versions of \"Wait Until Tomorrow\" by Jimi Hendrix and \"I Got A Woman\" by Ray Charles, two songs from Mayer's album Heavier Things, and new songs by Mayer. In addition, Mayer, Palladino, and Jordan are credited as songwriters on three songs: \"Good Love Is on the Way\", \"Vultures\", and \"Try!\".[3] Palladino appeared on Mayer's third album Continuum, fourth album Battle Studies and seventh album The Search for Everything.\n\nIn March and April 2006, Palladino toured with Jeff Beck and played with J. J. Cale, and Eric Clapton on their 2006 album The Road to Escondido. In 2009, he formed a trio with keyboardist Philippe Saisse and Simon Phillips.\n\nHe played with Simon and Garfunkel on their Old Friends reunion tour.[10]\n\nIn January 2011, he entered the studio with D'Angelo to finish recording Black Messiah.[11]\n\nIn 2013 he played on the Nine Inch Nails album Hesitation Marks and was a member of the touring band.\n\nTechnique\n\nPalladino is noted for his use of the fretless bass on many 1980s albums. While it was typical for a bass guitar in a commercial track to have a rather generic sound and stay \"playing the low notes\", Palladino preferred a different sound, combining fretless tone with an octaver effect, and basslines that frequently added chords, lead lines, and counter melodies in the higher range of the instrument. Typical of this style was his playing on Paul Young's Wherever I Lay My Hat. His equipment at that time included a fretless Music Man StingRay Bass 1979 and Boss Octave pedal (OC-2).\n\nSignature model\n\nThe Fender Pino Palladino Signature Precision Bass is modelled after two of Palladino's Fender Precision Basses. The body features faded fiesta red paint over desert sand paint, based on Palladino's 1961 Precision Bass, while the neck shape and round-lam rosewood fretboard are based on his 1963 sunburst Precision Bass.[12]\n\nPersonal life\n\nPino married Marilyn (Maz) Roberts, a former backing singer with the Fabulous Wealthy Tarts, in 1992 in Wales. They have three children: Fabiana, Giancarla and Rocco, who are all involved in the music industry.[13]\n\nSelect discography\n\nWith Paul Young\n\n1983 No Parlez (Columbia)\n\n(Columbia) 1985 The Secret of Association (Columbia)\n\n(Columbia) 1990 Other Voices (Columbia)\n\nWith David Knopfler\n\n1983 Release (Peach Tree)\n\n(Peach Tree) 1985 Behind the Lines (Paris)\n\n(Paris) 1987 Cut the Wire (Paris)\n\nWith Don Henley\n\n1984 Building the Perfect Beast (Geffen)\n\n(Geffen) 1989 The End of the Innocence (Geffen)\n\nWith Go West\n\n1985 Go West (Chrysalis)\n\n(Chrysalis) 1987 Dancing on the Couch (Chrysalis)\n\nWith Elton John\n\n1985 Ice on Fire (Rocket/Geffen)\n\n(Rocket/Geffen) 1992 The One (Rocket/MCA)\n\nWith John Mayer\n\n2005 Try!\n\n2006 Continuum\n\n2017 The Search for Everything\n\nWith Jeff Beck\n\n1999 Who Else! (Epic)\n\n(Epic) 2006 Official Bootleg USA '06\n\n2010 Emotion & Commotion\n\nWith D'Angelo\n\n2000 Voodoo (Virgin)\n\n(Virgin) 2014 Black Messiah (RCA)\n\nWith The Gaddabouts\n\n2011 The Gaddabouts\n\n2012 Look Out Now!\n\nWith The Who\n\n2006 Endless Wire (Polydor)\n\n(Polydor) 2014 Quadrophenia Live in London (Universal)\n\n(Universal) 2015 Live in Hyde Park (Eagle Rock / Universal)\n\n(Eagle Rock / Universal) 2017 Live at the Isle of Wight 2004 Festival (Eagle Rock / Universal)\n\nWith others\n\nReferences"}, {"url": "https://mixdownmag.com.au/features/rig-rundown-pino-palladino/", "page_content": "Words by Alex Watts\n\nExploring the gear behind Pino Palladino - the modern master.\n\nPino Palladino is one of the undisputed giants of bass playing in the modern age, having held down the four strings for such diverse artists as The Who, D’Angelo, John Mayer, Nine Inch Nails, Adele, Simon & Garfunkel, Jeff Beck and his own trio, PSP.\n\nRead all the latest features, columns and more here.\n\nWhether it be playing blues, rock, or neo-soul, Palladino’s feel is incomparable, which makes him a perfect candidate for a Rig Rundown of his own.\n\nBass Guitars\n\nFretless 1979 Music Man Stingray\n\nPalladino first made his name with this instrument in the 1980’s, playing on Gary Numan’s I, Assassin in 1982 and Don Henley’s Building The Perfect Beast in 1984.\n\nHis style during this period encompassed a lot of lead melodic playing utilising the instrument’s top register, rather than simply holding down the low end. This became his signature sound throughout the era, one that he has returned to in the past five years with his trio PSP.\n\nFender American Standard Jaguar Bass\n\nHaving previously played with Pete Townshend and Roger Daltrey, Palladino was an obvious choice to fill the big shoes left after the sudden passing of The Who bassist John Entwistle in 2002.\n\nAfter initially trying out his Fender Precision and Jazz basses with the band, he eventually settled on the powerful tone and cutting attack of the Fender Jaguar with two thunderbird pickups.\n\n1963 Fender Precision Bass\n\nPalladino made the move to a fretted P-Bass in the 1990s as a conscious decision to move away from his signature fretless sound and embrace a vintage soul and R&B tone, such as that of Motown bassist James Jameson.\n\nHe achieved this with a combination of the 1963 P-Bass with a sunburst finish, custom wound pickups, flatwound La Bella strings, and by keeping the volume turned all the way up and the tone all the way down.\n\nThis configuration can be heard on D’Angelo’s Voodoo and Black Messiah albums, on which he played tuned down to DGCF with a dampener.\n\n1961 Fender Precision Bass in Fiesta Red\n\nThis guitar is another of Palladino’s favourites and also used with flatwound strings. It can be heard on Paul Simon’s 2006 album Surprise.\n\nFender Pino Palladino Precision Bass\n\nPalladino was bestowed this signature model by the Fender Custom Shop. Its alder body is based on his ’61 P-Bass, while the ‘C’ shape maple neck shape and rosewood fingerboard are based on his ’63 P-Bass. It is finished in Fiesta Red over Desert Sand and has custom wound pickups.\n\nPalladino himself has used this model whilst on tour with The Who, although he added ‘60’s Gibson Thunderbird pickups.\n\nMoon JJ-4 300B\n\nPalladino played an all-white Moon bass during the Voodoo tour with D’Angelo in March-October 2002, playing tuned down to DGCF as he did on the album. Watch him lay down a groove with the bass in this session with (U)nity below.\n\nAmplifiers\n\nAshdown ABM 900 EVO III head and ABM-810-EVO-IV 8×10 Cabinet\n\nPalladino often uses this combination onstage with The Who as well as with the John Mayer Trio.\n\nPhil Jones M-300/500 Head with 8T/16B Cabinet\n\nPalladino is a big fan of the work of Phil Jones and uses his amps frequently for both recording and touring.\n\nAmpeg B15\n\nUsed on the Voodoo album, recorded from the amp without using a DI.\n\nFender SuperBassman\n\nUsed during The Who’s Quadrophenia tour of 2012/2013.\n\nStrings\n\nThomastik-Infeld Flatwound strings\n\nAs already mentioned, Palladino’s use of flatwound strings has been a major component of his sound and Thomastik-Infeld are his preferred choice.\n\nJamerson La Bella Flatwound strings\n\nUsed on his ’63 P-Bass on the Voodoo album and tour.\n\nErnie Ball Cobalt\n\nThese were used during The Who Hits 50! Tour of 2016 for extra punch not afforded by his usual flatwound strings.\n\nPedals\n\nBoss OC-2 Octave Pedal\n\nPalladino used this as an integral part of his setup during the 1980’s in combination with his fretless bass playing.\n\nOthers:\n\nPalladino uses as an array of other pedals, some notable units used during recent years with The Who are:\n\nAnalog Alien Alien Bass Station, compressor, distortion, amp emulator and MXR Bass Octave effect. Pedal Power II.\n\nKeep up to date with Pino Palladino here."}, {"url": "https://www.premierguitar.com/artists/pino-palladino-and-blake-mills", "page_content": "For this masterful meeting of musical minds, bass legend Pino Palladino and legend-in-the-making Blake Mills forged a creative partnership that led to a borderless take on small-ensemble instrumental music.\n\nPhoto by Mike Piscitelli\n\nThe bass and guitar virtuosos' new collaborative album, Notes with Attachments, goes all over the map—and well beyond."}, {"url": "https://www.guitarworld.com/features/pino-palladinos-best-bass-lines", "page_content": "Quite possibly the world's most famous working session bassist, Pino Palladino has built a career as the ultimate supporting player: providing a Stravinsky-inspired fretless performance on Paul Young’s ‘Wherever I Lay My Hat,’ contributing to D’Angelo’s landmark album Voodoo, replacing the late John Entwistle in The Who, touring with the John Mayer Trio, and much more.\n\n\n\nPino has come to encapsulate everything that a sideman should be. “The sideman role just came out of me playing on records that people heard and liked,” says Pino. “It's not something I planned or even dreamt of.”\n\nJoin us, then, on Pino’s 65th birthday, as we list the songs that prove he is a true bass genius.\n\n(Image credit: Photo by Chris McKay/WireImage)\n\nWherever I Lay My Hat - Paul Young (1983)\n\nNo one did more to promote expressive bass playing back in the '80s than Pino Palladino. His big break came as a member of Paul Young’s band, culminating in a truly amazing piece of fretless bass accompaniment to one of Young’s biggest hits, his 1983 cover of Marvin Gaye’s ‘Wherever I Lay My Hat.’ In this clip Pino breaks down his soaring fretless line.\n\nChicken Grease - D'Angelo (2000)\n\nPerhaps it was John Mayer who said it best when, in 2017, he attributed one of his favorite bass lines to 'Chicken Grease.' Having met D’Angelo in 1997 while recording for BB King’s Deuces Wild, Pino went on to provide many of the flatwound-swinging bass lines on his 2000 landmark album, Voodoo.\n\n\n\nHere he is performing 'Chicken Grease' live on the Chris Rock show. The harmony is open to interpretation, but Pino felt a B7 as the overall tonality.\n\nMy Generation - The Who (2007)\n\nPino’s next call came following the untimely death of John Entwistle, who had died just as the Who was launching its 2002 tour. Pete Townshend later said on his website that he had made only one request of Pino; \"that he fucking turns up his amp and plays as loud as he can!\"\n\n\n\nIn this next video Pino plays probably the most famous bass solo in rock – ‘My Generation’ – on Later… With Jools Holland.\n\nWho Did You Think I Was - John Mayer Trio (2008)\n\nRecorded live at the Nokia Theatre in LA, together with John Mayer and drummer Steve Jordan, Pino’s performance on 'Who Did You Think I Was' is stratospheric. The main riff is based around an A7 pentatonic shape that Pino anchors on the 5th fret of the E string. Keep your ears open at the 02:40 mark as the trio kick into ‘Power of Soul’ by Jimi Hendrix.\n\nSanctified - Nine Inch Nails (2013)\n\nPino’s next stretch came with Nine Inch Nails following Trent Reznor’s invitation to collaborate on the band’s 2013 Hesitation Marks. Pino wasn't the only special guest to appear in the studio: who'd have imagined Lindsay Buckingham of Fleetwood Mac to crop up on a Nine Inch Nails album, let alone the king of the fretless bass? This next clip sees Pino add his slick fretless lines to Reznor’s 1989 track ‘Sanctified.’\n\nBlake Mills - Notes With Attachments\n\nIn 2021 Pino released the first solo album of his career, collaborating with guitarist Blake Mills on an archive of musical ideas. Recorded at Sound City in a series of studio sessions that spanned two and a half years, the album pays homage to his love of classic film soundtracks, cool jazz and Burt Bacharach arrangements.\n\n\n\nWatch Pino Palladino and Blake Mills, along with percussionist Abe Rounds and saxophonist Sam Gendel, perform three tracks from the album on NPR Music’s Tiny Desk (Home) Concert.\n\nNotes With Attachments is available now on CD, vinyl and as a digital download (iTunes and Amazon MP3)"}, {"url": "https://au.rollingstone.com/music/music-lists/50-greatest-bassists-of-all-time-13565/pino-palladino-13579/", "page_content": "From funk masters to prog prodigies and beyond, we count down the players who have shaped our idea of the low-end theory\n\n“The bass is the foundation,” session legend Carol Kaye once said, “and with the drummer you create the beat. Whatever you play puts a framework around the rest of the music.”\n\nA great bass line, whether it’s Paul McCartney’s hypnotic “Come Together” riff, Bootsy Collins’ sly vamp from James Brown’s “Sex Machine,” or Tina Weymouth’s minimal throb on Talking Heads’ “Psycho Killer,” is like a mantra: It sounds like it could go on forever, and it only feels more profound the more you hear it. Guitarists, singers, and horn players tend to claim the flashiest moments in any given song, while drummers channel most of the kinetic energy, but what the bassist brings is something elemental — the part that loops endlessly in your head long after the music ends.\n\nBassists are often overlooked and undervalued, even within their own bands. “It wasn’t the number-one job,” McCartney once said, reflecting on the fateful moment when he took over the four-string after Stu Sutcliffe exited the Beatles. “Nobody wanted to play bass, they wanted to be up front.”\n\nAnd yet the instrument has its own proud tradition in popular music, stretching from the mighty upright work of Jimmy Blanton in Duke Ellington’s orchestra and bebop pioneers like Oscar Pettiford to fellow jazz geniuses like Charles Mingus and Ron Carter; studio champs like Kaye and James Jamerson; rock warriors like Cream’s Jack Bruce and the Who’s John Entwistle; funk masters like Bootsy and Sly and the Family Stone’s Larry Graham; prog prodigies like Yes’ Chris Squire and Rush’s Geddy Lee; fusion gods like Stanley Clarke and Jaco Pastorius; and punk and postpunk masters like Weymouth and the Minutemen’s Mike Watt. The alternative era brought new heroes on the instrument, from Sonic Youth’s intuitive Kim Gordon to Primus’ outlandish Les Claypool, and more recently, a fresh crop of bass icons — including Esperanza Spalding and the ubiquitous Thundercat — have placed the low end at the center of their musical universes.\n\nAs with our 100 Greatest Drummers list, this rundown of the 50 greatest bassists of all time celebrates that entire spectrum. It’s emphatically not intended as a ranking of objective skill; nor does it assign any one set of criteria as a measure of greatness. Instead it’s an inventory of the bassists who have had the most direct and visible impact on creating, to borrow Kaye’s term, the very foundation of popular music — from rock to funk to country to R&B to disco to hip-hop, and beyond — during the past half-century or so. You’ll find obvious virtuosos here, but also musicians whose more minimal concept of their instrument’s role elevated everything that was going on around them.\n\n“You grab it, slide around on it, and feel it with your hands,” Red Hot Chili Peppers’ Flea once said of his signature instrument. “You slap, pull, thump, pluck, and pop, and you get yourself into this hypnotic state, if you’re lucky, beyond thought, where you’re not thinking because you’re just a conduit for this rhythm, from wherever it comes from, from God to you and this instrument, through a cord and a speaker.”\n\nHere we pay tribute to 50 musicians who have found that same exalted state via the bass, and changed the world in the process."}, {"url": "https://bassguitarshack.com/pino-palladino-bass-superman/", "page_content": "One of the most respected and admired bass players in music today, Pino Palladino has such an array of amazing bass chops and feel that it’s almost ridiculous. Pino’s ability to fit his unique style into any type of music and not only make it work but make it sound great is a rare skill indeed. It’s the combination of these qualities that make Pino Palladino a bass superman.\n\nThe complete package, Pino can make it funky, melodic, and anything in between all the while serving the song perfectly. Never getting in the way of the other musicians, Pino always adds just the right feel to the track.\n\nPino Palladino’s early years\n\nBorn in Cardiff, Wales on October 17, 1957, Palladino originally started on guitar, but at age 16 he picked up a friend’s bass and realized that this was the instrument for him. Soon after, he bought a Fender Precision. Not long after that, he begins his journey as a professional bass player.\n\nHeavily influenced by James Jamerson , Stevie Wonder, Michael Henderson, Jaco Pastorius, and Paul Jackson, Pino begins to develop his own personal style and technique. After playing for a local Cardiff television station, Pino moves to London in 1980 to join a band led by Jools Holland of Squeeze. As Pino began to make a name for himself in London, he soon became a highly sought after session player.\n\nIt was around this time that Pino began using a fretless Music Man Stingray (another company started by Leo Fender). His highly expressive lead fretless bass line for Paul Young’s cover of “Wherever I Lay My Hat (That’s My Home)” became an instant classic. Pino also worked with Gary Numan on his album I, Assassin. Numan has stated that he was blown away by Palladino’s amazing bass playing. He’s also said that his unusual fretless tone defined the album with its atmospheric and dreamy quality.\n\nPino leaves the fretless behind and meets D’Angelo\n\nIn the early 1990s, Pino switched from his fretless Musicman Stingray to a fretted sunburst 1963 Fender Precision bass with La Bella flatwound strings. The change was both a musical and personal decision. Pino had grown tired of the lead fretless sound, and he also felt the need to return to his love of the old R&B and soul bass sound.\n\nAfter recording an album with Tom Jones and B.B. King, Pino caught the attention of neo-soul artist D’Angelo who was looking for a certain bass sound for his new album, Voodoo. Palladino’s greasy, fat, laid-back grooves on his ’63 P-Bass gave the recording an old-school vibe that had a large impact not only on bassists but on entire rhythm sections in general. This led to many more session jobs in the neo-soul style for the now very in-demand bassist.\n\nPino’s uncanny ability to adapt to any style and make it his own is what truly sets him apart from the ordinary session bassist. His amazing feel and intuition allow him to be both expressive and tasteful with his bass lines. Pino has stated that he has something he calls “trust chops,” instincts that help him figure out what to play through difficult sections.\n\nNew Directions with The Who\n\nAfter the untimely 2002 death of the great bassist John Entwistle, the surviving members of The Who asked Palladino to play bass for the remainder of their tour. He’s now their permanent bassist. Having played with Pete Townshend and Roger Daltrey previously made this very daunting task a little easier for him, Palladino also personally knew Entwistle.\n\nFor The Who gig, Pino started with both Fender Precision and Jazz basses, finally settling on Fender Jaguar basses, which he likes for their powerful cutting tone. He has said many times that playing with The Who is like a dream come true, and sometimes he can hardly believe that he’s on stage with them.\n\nPino has stated that Pete Townshend had given him full freedom with the bass lines, although he tries to keep them as faithful to John’s original lines as possible. In 2003, Pino started working with Paul Simon for his tour and recorded an album with him in 2006. For this gig, he used his fiesta red 1961 Fender Precision with flatwound strings.\n\nPino’s recent work – and into the future\n\nPino Palladino’s signature Precision Bass\n\nPalladino has also had the great honor of having Fender issue a signature bass in his name. The Fender Pino Palladino Precision Bass is a Custom Shop creation featuring a body modeled after his ’61 Precision and the neck shape after his ’63 P-Bass. The bass is finished in fiesta red over desert sand and given the relic treatment by the Custom Shop craftsmen.\n\nThe John Mayer Trio and many others\n\nDuring the Tsunami Aid benefit concert in 2005, Pino met guitarist John Mayer through drummer Steve Jordan. After original bassist Willie Weeks was unable to perform, Pino was asked to fill in for the concert. The three hit it off well in the studio. Pino later stated that there was instant chemistry between the three musicians. They later decided to form a power trio and set up some tour dates. The John Mayer Trio was born, and this gave Palladino a new opportunity to add creatively in a band context.\n\nIn 2006, Pino joined Jeff Beck for a tour and also worked with Eric Clapton, J.J. Cale, Derek Trucks, and Billy Preston on an album. He’s also played with Robbie Robertson and Herbie Hancock and worked on a follow up to the Voodoo album with D’Angelo entitled Black Messiah.\n\nAs clear evidence of Palladino’s vast range and versatility, in 2013 he played on the Nine Inch Nails album Hesitation Marks and toured with the band as well.\n\nPino Palladino is probably the most sought after bassist in music today and for good reason. His bass chops, great tone, and musical instincts are unparalleled in the industry. We look forward to more great work from Pino for many years to come."}]}