{"Pino Palladino was a member of the John Mayer Trio.": [{"url": "https://www.musicradar.com/news/watch-john-mayer-trio-steve-jordan-pino-palladino-play-live-first-time-in-six-years", "page_content": "John Mayer has covered a lot of musical ground since first album, Inside Wants Out. From pop singer-songwriter, to blues-rock guitar hero, Americana songsmith to his retro, ’80s-inspired latest album, Sob Rock. But to many musician-fans of Mayer, some of his greatest work has been with the John Mayer Trio, featuring the heavyweight rhythm section that is drummer, Steve Jordan and bassist, Pino Palladino.\n\nOn March 9th, Mayer reassembled the John Mayer Trio for a short, yet exceedingly sweet live set at the Love Rocks NYC charity concert at New York’s Beacon Theatre.\n\nIntroduced by Bill Murray, and Mayer armed with his signature PRS Silver Sky, the set kicks off with the Hendrix-y, Who Did You Think I Was. Next up, Jordan - who has been drumming with The Rolling Stones since August 2021 following the death of Charlie Watts - ushers-in Vultures on a Rogers kit with his unmistakeable groove.\n\nMayer grabs his Fender Custom Shop Monterey Strat before introducing the band and launching into a set-closing cover of Jimi Hendrix’s Wait Until Tomorrow.\n\n(Image credit: Jamie McCarthy/Getty Images for Love Rocks NYC/God's Love We Deliver)\n\nIncredibly, the John Mayer Trio has never released a full-length studio album, instead recording the live album, Try! released in 2005, along with a set on the Mayer live album, Where The Light Is in 2008.\n\nDespite teasing a full album, studio sessions featuring the trio line-up as the core band were eventually used as Mayer solo release, The Search For Everything, the 2017 tour for which marks the last time the trio performed live together.\n\nMayer and Palladino later joined an all-star line-up of musicians including James Taylor, Warren Haynes, St. Vincent, Sheryl Crow, Gary Clark Jr, Pat Benatar and more for the closing of Love Rocks NYC. The collective played an emotional version of People Get Ready in tribute to late guitar legend, Jeff Beck, who passed away in January aged 78.\n\nLove Rocks NYC is a live music benefit - now in its seventh year - run by God’s Love We Deliver, a charity providing support for adults and children living with HIV/AIDS."}, {"url": "https://www.allmusic.com/artist/pino-palladino-mn0000292499/biography", "page_content": "Biography Pino Palladino Follow Artist +\n\nSince the 1980s, this session and live bassist is among the most prolific, gifted, and sought after by musicians of all genres.\n\nRead Full Biography"}, {"url": "https://www.allaboutjazz.com/musicians/pino-palladino", "page_content": "Pino Palladino was featured on Gary Numan's 1982 album I, Assassin, in which his fretless bass sound made a prominent contribution to the overall sound of the album. He went on to play fretless bass with a healthy number of high-profile artists that include (on the short list), David Gilmour, Tears for Fears, Pete Townshend, Peter Gabriel, Joan Armatrading, Phil Collins, Chaka Khan and Don Henley.\n\nPalladino began playing the electric guitar at age 14. By age 17 he decided to play the bass guitar, and bought his first fretless bass one year later, playing mostly R&B, funk, and reggae within a rock and roll backbeat. His first professional gig was at a local television station in Cardiff, where he began playing in 1978. That same year, at age 20, he joined Jools Holland's band and recorded with Holland on his album entitled, Jools Holland and His Millionaires. Palladino toured with Jools to support the album, which gave him the opportunity to purchase his own Music Man StingRay Fretless Bass. Holland was touring with another new band; the Q-Tips, whose frontman, Paul Young made acquaintance with Palladino whilst they were on tour, who would, a year later offer Pino a place in his own backing band.\n\nPalladino has joined several bands and ensembles through which he is most visible. He joined jazz trumpeter Roy Hargrove in forming The RH Factor, a band that mixes elements of soul, jazz, and R&B. He is a member of the John Mayer Trio, and was the first choice by Pete Townshend and Roger Daltrey to fill the position left by John Entwistle as the current bassist for The Who.\n\nPino Palladino (17 October 1957 in Cardiff, Wales, UK) is a Welsh bass guitarist of Italian ancestry. Palladino rose to public notice playing primarily rock and roll, blues rock, and rhythm and blues music, although he has been lauded for his ability to play most genres of popular music, including jazz, neo soul, and funk. Adding to his eclectic grasp and melodic approach on his instrument, he has become one of the most sought-after session players on the bass in the music industry. He has played on a large number of recordings by some of the world's most successful entertainers, in part, by mastering a variety of techniques on both his late 1970s fretless Music Man StingRay bass guitar and later in his career, adding fretted Fender Precision and Jaguar basses. His playing has earned him custom instruments bearing his name.\n\nAfter vocalist Paul Young landed his own solo contract, Palladino was brought in as part of his backing band \"The Royal Family\" in 1983 with noticeable chart success with the No Parlez album, and major hit singles both in the UK and Europe. Examples of Young's new found success were the band's cover of the Marvin Gaye classic \"Wherever I Lay My Hat (That's My Home)\", which reached No. 1 in the UK singles chart for three weeks in the summer of 1983, and \"Love of the Common People\". Palladino toured extensively at this time with Paul Young, remaining in the band for five years. 1983 additionally proved to be the year of another ensemble featuring Palladino, Paul Rodgers (formerly of Bad Company, drummer Kenney Jones, along with a rotating cast of other celebrity performers. The band only released one album through Atlantic; The Law, although there were enough out-takes that another bootleg-styled album followed in 1991. Sales were unremarkable, despite the names of those who recorded on the album.\n\nThroughout the 1980s Palladino was noted for his R&B roots on the fretless bass, even when supporting pop and rock heavy performers. One reviewer from Bass Player magazine points to Paul Young’s cover of the Bobby Womack/Rufus tune \"Stop On By\" (on 1990’s Other Voices), with its \"pre-hip-hop, swung funk groove\" as the precursor to Palladino's later neo-soul focus.\n\n1990s Changes in instrument\n\nIn the 1990s, Palladino began to alternate between the sounds achieved in playing the fretless bass to one with frets, as well as the 4-string and 6-string bass. At the time, he was well known within the industry for his fretless bass sound. However, now, depending on which artist he was supporting, and the song to be played, he began gravitating towards fretted bass. He was maturing as a musician, and played with artists as diverse as Melissa Etheridge, Richard Wright, Sir Elton John and Eric Clapton. Also in 1991 he joined Paul Rodgers (of Free, Queen+ Paul Rodgers, and Bad Company fame) to form the band The Law. In the mid 1990's, Palladino played bass for The London Metropolitan orchestra during their recording of \"An American Symphony\", soundtrack for the movie Mr Hollands Opus.\n\nPalladino supported Phil Collins, as a member of the house band for the Golden Jubilee of Elizabeth II, which played with Sir Paul McCartney, Eric Clapton, Cliff Richard, and Tony Bennett, among other notable performers. He later wrote that he felt privileged to have been amongst the others on stage in such an event.\n\nIn 1999, he began working with Richard Ashcroft, of The Verve, during the recording sessions of Ashcroft's debut solo album, Alone With Everybody. Richard proved to be mightily impressed by Pino's natural bass playing ability;\n\nThis Pino Palladino, I can say a Meters record and he can play me the bass line. He can play anything. He's one of the only people in the world who can totally replicate that kind of Beach Boys/scratch/Walker Brothers bass. You can get that sound if you want it, dead on. So it was very liberating working with him.\n\nPino also joined Ashcroft's touring band for the singer's first major solo outing throughout 2000.\n\nNeo Soul\n\nBy the mid- 1990s, Palladino had established himself as a busy, highly desirable bassist and a studio worker in many genres, but finally became visible to those artists who played largely left of center, and demand for his session playing grew within a different quarter. Palladino began moving from blues-rock toward neo soul projects. Palladino and Steve Jordan found themselves performing on the same session for B.B. King’s 1997 duets CD Deuces Wild. It was the first time soul singer D'Angelo first heard Palladino, who had just switched from a signature sound fretless bass sound to that of performing with fretted basses. The result was an invitation to \"use Pino’s big, behind-the-beat bass to help cast a neo-soul spell on his Grammy Award-winning Voodoo album\". It would not be his first uncredited Grammy performance.\n\nAs the word spread throughout the genre, Palladino found an increasing demand within the neo-soul genre. Examples of his bass work in this genre (in addition to D'Angelo) includes Mama's Gun, and \"Penitentiary Philosophy\" found on Erykah Badu’s 2000 CD. Other albums using Pino's sound include 1st Born Second for Bilal, Like Water for Chocolate and Electric Circus for Common. Palladino has been described by Steve Jordan, who got his own professional start playing the drums for Stevie Wonder as having a \"deep funk\" side and a \"melodic\" side. Palladino admits, that \"Of all my influences, I would say what’s always in the back of my mind is early Stevie Wonder, like Talking Book and Innervisions; that music is really in my blood.\"\n\n2000s\n\nFollowing the death of The Who's bassist John Entwistle in 2002, the eve before the band were to kick off their first world tour in years, Palladino was their first choice to become the band's full-time touring bass guitarist, and by 2006, he was invited to join the remaining original band members in recording their first album in twenty-four years. Pete Townshend, the band's composer, recorded the bassline on the majority of the songs to get the effect he himself wanted, with Palladino doing so on the other six of them. Released in October 2006, the album was named Endless Wire.\n\nPalladino also recently played with The Who at the Super Bowl XLIV half-time show, in February, 2010, alongside other backing artists: Simon Townsend on guitar, Zak Starkey, drums and percussion, and John \"Rabbit\" Bundrick, on keyboard instruments.\n\nPaul Simon\n\nIn 2003, Palladino intended to go down to see his old friend Paul Simon and meet Brian Eno for the first time. He was asked to record with them, and had to borrow a bass guitar to play. The result was that he played with Simon and Garfunkel on their \"Old Friends\" reunion tour and in an interview with Bass Player Magazine he mentions drummer Steve Gadd and percussionist Jamey Haddad \"had laid down some great grooves for me to add bass\". He had kept the recordings, and by the time that he appeared on the Old Friends: Live on Stage CD and DVD from the tour, he was able to use some of the material. He played on Paul Simon's 2006 release, Surprise.\n\nOther appearances\n\nPalladino has toured in the backing band for Joe Walsh. In 2004 he appeared to be playing with Gary Moore at the Wembley Arena.\n\nEmergence of the John Mayer Trio\n\nPalladino met Steve Jordan in the mid-1980s while both were working as session players on many occasions, which blossomed into a friendship. When their work brought them to the same place, they would meet, usually jam together, and introduce other musicians to one another, forming friendships which sometimes blossomed into good working relationships. Jordan has remained keen about Pino since he met him, and only grows more enthusiastic about his talents, which he describes partly as his love for, and ability to \"feel\" changes in music, through melodies, basslines, and an amazing connection with genres of nearly every kind. According to Jordan, he'd planned to meet up with John Mayer and Willie Weeks in January, 2005 to perform a benefit concert on a NBC sponsored telethon Tsunami Aid: A Concert of Hope to raise funds and public awareness benefiting victims in the aftermath of the tsunami that struck southeast Asia. Weeks was unable to make the performance, and Jordan suggested Palladino, who had heard some of Mayer's work, and was willing to come. Beginning a set that included the Jimi Hendrix classic, \"Bold as Love\", the three all agreed that they experienced such chemistry that they began talking right away about arranging their schedules to record a CD and a tour. The trio released the album Try!, on November 22, 2005. The eleven-track live album includes cover songs, such as Jimi Hendrix's \"Wait Until Tomorrow\" and \"I Got A Woman\" by Ray Charles, two songs from Mayer's release Heavier Things, as well as new songs written by Mayer. In addition, Mayer, Palladino, and Jordan wrote three songs on the album: \"Good Love Is On The Way\", \"Vultures\", and \"Try!\". Along with John Mayer on guitar and vocals, and Steve Jordan on drums, Palladino has toured and recorded as a member of the John Mayer Trio, and on Mayer's third album Continuum.\n\nRecent tours\n\nIn spring of 2006, Palladino toured with Jeff Beck. He also played with J. J. Cale, and Eric Clapton on their 2006 album The Road to Escondido, alongside other notable musicians, including Derek Trucks, and Billy Preston. It was to be Preston's last work before he died only days afterward.\n\nInfluences on bass guitar\n\nInfluences for Palladino for bass guitar include Motown bassist James Jamerson; Stevie Wonder’s keyboard-bass, jazz innovator Jaco Pastorius; British folk/rock upright bassist Danny Thompson; Norman Watt-Roy (of Ian Dury & the Blockheads); Larry Graham; Michael Henderson; Bootsy Collins; Paul Jackson; Anthony Jackson; Doug Rauch (of Carly Simon and Santana), and Billy Cobham.\n\nTechnique\n\nPino Palladino is noted for his use of the fretless bass in many 1980s chart records. While it was typical for a bass guitar in a commercial track to have a rather generic sound and stay \"playing the low notes\" Palladino preferred a different sound (combining fretless tone with an octave effect) and basslines that frequently added chords, lead lines and counter melodies in the higher range of the instrument as opposed to simply the aforementioned \"low notes\". Typical of this style was his playing on Paul Young's biggest chart hits, in particular his bass solo on \"Wherever I Lay My Hat (That's My Home)\". His equipment at that time included a fretless Music Man StingRay Bass 1979 and Boss Octave pedal (OC-2).\n\nPino Palladino signature model\n\nThe Fender Pino Palladino Signature Precision Bass is modeled after two of Pino's Fender Precision Basses. The body featuring faded fiesta red paint over desert sand paint is based on Pino's 1961 Precision Bass while the neck shape and round-lam rosewood fret board are based on Pino's 1963 sunburst Precision Bass.\n\nRecent projects\n\nPalladino joined Eric Clapton's touring band for 11 dates in the Eastern U.S. and Canada in May 2008. Current work has included work on an with Clapton and Robbie Robertson, and Palladino guested on bass for Amos Lee on his third album, Last Days at the Lodge.\n\nIn 2009, Palladino joined with keyboardist Philippe Saisse and Simon Phillips to form an instrumental trio: Phillips Saisse Palladino, an instrumental jazz/funk rock ensemble, which have toured Europe through 2009 into 2010, playing songs that spotlight the talents of each performer, in the manner of many jazz outfits. Show less"}, {"url": "https://www.radioswisspop.ch/en/music-database/musician/113328f03f18e37f9ea1690603e52e56c3109", "page_content": "Giuseppe Henry \"Pino\" Palladino[1] (born 17 October 1957) is a Welsh bassist. A prolific session musician, he is probably best known for playing with The Who (following the death of founding member John Entwistle[2]) from 2002 to 2016, D'angelo from 1996 to present, and the John Mayer Trio from 2005 to present.\n\nPalladino plays a late-1970s, fretless, Music Man StingRay bass guitar, a fretted Fender Precision, and a Jaguar bass. His playing has earned him custom instruments bearing his name.[3]\n\nEarly life\n\nBorn in Cardiff to an Italian father from Campobasso and a Welsh mother,[4] Palladino began playing electric guitar at age 14 and bass guitar at 17. He bought his first fretless bass one year later, playing mostly R&B, funk, and reggae with a rock and roll backbeat.[5]\n\nCareer\n\nPalladino was drawn to Motown and jazz at an early age. He attended Catholic school and took classical guitar lessons. He liked Led Zeppelin and Yes and started a rock band.[6]\n\nIn 1982, Palladino recorded with Gary Numan on the album I, Assassin. The producer of the album asked him to contribute to Paul Young's debut album. Young's cover version of \"Wherever I Lay My Hat (That's My Home)\" by Marvin Gaye became a hit in Europe,and subsequently joined Young's band the Royal family and Palladino received offers to record with Joan Armatrading, Go West, and David Gilmour. He cites as early influences James Jamerson, Danny Thompson, and Norman Watt-Roy and also admires Jaco Pastorius, Stanley Clarke, Bootsy Collins, Larry Graham, Michael Henderson, Anthony Jackson, Marcus Miller, and Rocco Prestia.[7]\n\nIn 1983, he joined The Law with Paul Rodgers, formerly of Bad Company, and drummer Kenney Jones, who succeeded Keith Moon in The Who after Moon died, and recorded the album The Law.\n\nIn the 1990s, Palladino alternated between fretless bass and fretted and 4-string and 6-string bass. He played with Melissa Etheridge, Richard Wright, Elton John, and Eric Clapton.\n\nHe played on Mike Lindup's first solo album, Changes with Dominic Miller on guitar and Manu Katché on drums.[8]\n\nIn 1999, he began working with Richard Ashcroft of The Verve on Ashcroft's debut solo album, Alone With Everybody.[9]\n\nThe Who's bassist John Entwistle died the night before the start of their first tour in two years. Palladino became the band's bass guitarist on tour. In 2006, he joined the remaining band members on their first album in twenty-four years, Endless Wire. He played with The Who at the Super Bowl XLIV half-time show in 2010 with Simon Townshend on guitar, Zak Starkey on drums, and John \"Rabbit\" Bundrick on keyboards. In 2012, he toured with The Who on their Quadrophenia revival.\n\nPalladino met Steve Jordan in the mid-1980s while both were working as session musicians, which blossomed into a friendship. Jordan credits Palladino's apparent ability to \"feel\" changes in music, through melodies, basslines, and an embrace of genres of nearly every kind. According to Jordan, he had planned to meet up with John Mayer and Willie Weeks in January 2005 to perform Tsunami Aid: A Concert of Hope for victims of the tsunami that struck southeast Asia. Weeks was unable to make the performance, and Jordan suggested Palladino, who had heard some of Mayer's work and was willing to come. Beginning a set that included the Jimi Hendrix song \"Bold as Love\", the three found a chemistry together. They recorded an album and toured as a trio.[10]\n\nThey released the album Try!, on 22 November 2005. The eleven-track live album includes cover versions of \"Wait Until Tomorrow\" by Jimi Hendrix and \"I Got A Woman\" by Ray Charles, two songs from Mayer's album Heavier Things, and new songs by Mayer. In addition, Mayer, Palladino, and Jordan are credited as songwriters on three songs: \"Good Love Is on the Way\", \"Vultures\", and \"Try!\".[3] Palladino appeared on Mayer's third album Continuum, fourth album Battle Studies and seventh album The Search for Everything.\n\nIn March and April 2006, Palladino toured with Jeff Beck and played with J. J. Cale, and Eric Clapton on their 2006 album The Road to Escondido. In 2009, he formed a trio with keyboardist Philippe Saisse and Simon Phillips.\n\nHe played with Simon and Garfunkel on their Old Friends reunion tour.[10]\n\nIn January 2011, he entered the studio with D'Angelo to finish recording Black Messiah.[11]\n\nIn 2013 he played on the Nine Inch Nails album Hesitation Marks and was a member of the touring band.\n\nTechnique\n\nPalladino is noted for his use of the fretless bass on many 1980s albums. While it was typical for a bass guitar in a commercial track to have a rather generic sound and stay \"playing the low notes\", Palladino preferred a different sound, combining fretless tone with an octaver effect, and basslines that frequently added chords, lead lines, and counter melodies in the higher range of the instrument. Typical of this style was his playing on Paul Young's Wherever I Lay My Hat. His equipment at that time included a fretless Music Man StingRay Bass 1979 and Boss Octave pedal (OC-2).\n\nSignature model\n\nThe Fender Pino Palladino Signature Precision Bass is modelled after two of Palladino's Fender Precision Basses. The body features faded fiesta red paint over desert sand paint, based on Palladino's 1961 Precision Bass, while the neck shape and round-lam rosewood fretboard are based on his 1963 sunburst Precision Bass.[12]\n\nPersonal life\n\nPino married Marilyn (Maz) Roberts, a former backing singer with the Fabulous Wealthy Tarts, in 1992 in Wales. They have three children: Fabiana, Giancarla and Rocco, who are all involved in the music industry.[13]\n\nSelect discography\n\nWith Paul Young\n\n1983 No Parlez (Columbia)\n\n(Columbia) 1985 The Secret of Association (Columbia)\n\n(Columbia) 1990 Other Voices (Columbia)\n\nWith David Knopfler\n\n1983 Release (Peach Tree)\n\n(Peach Tree) 1985 Behind the Lines (Paris)\n\n(Paris) 1987 Cut the Wire (Paris)\n\nWith Don Henley\n\n1984 Building the Perfect Beast (Geffen)\n\n(Geffen) 1989 The End of the Innocence (Geffen)\n\nWith Go West\n\n1985 Go West (Chrysalis)\n\n(Chrysalis) 1987 Dancing on the Couch (Chrysalis)\n\nWith Elton John\n\n1985 Ice on Fire (Rocket/Geffen)\n\n(Rocket/Geffen) 1992 The One (Rocket/MCA)\n\nWith John Mayer\n\n2005 Try!\n\n2006 Continuum\n\n2017 The Search for Everything\n\nWith Jeff Beck\n\n1999 Who Else! (Epic)\n\n(Epic) 2006 Official Bootleg USA '06\n\n2010 Emotion & Commotion\n\nWith D'Angelo\n\n2000 Voodoo (Virgin)\n\n(Virgin) 2014 Black Messiah (RCA)\n\nWith The Gaddabouts\n\n2011 The Gaddabouts\n\n2012 Look Out Now!\n\nWith The Who\n\n2006 Endless Wire (Polydor)\n\n(Polydor) 2014 Quadrophenia Live in London (Universal)\n\n(Universal) 2015 Live in Hyde Park (Eagle Rock / Universal)\n\n(Eagle Rock / Universal) 2017 Live at the Isle of Wight 2004 Festival (Eagle Rock / Universal)\n\nWith others\n\nReferences"}, {"url": "https://www.last.fm/music/Pino+Palladino/+wiki", "page_content": "Pino Palladino (17 October 1957 in Cardiff, Wales, UK) is a Welsh bass guitarist of Italian ancestry. Palladino rose to public notice playing primarily rock and roll, blues rock, and rhythm and blues music, although he has been lauded for his ability to play most genres of popular music, including jazz, neo soul, and funk. Adding to his eclectic grasp and melodic approach on his instrument, he has become one of the most sought-after session players on the bass in the music industry. He has played on a large number of recordings by some of the world's most successful entertainers, in part, by mastering a variety of techniques on both his late 1970s fretless Music Man StingRay bass guitar and later in his career, adding fretted Fender Precision and Jaguar basses. His playing has earned him custom instruments bearing his name.\n\nPalladino has joined several bands and ensembles through which he is most visible. He joined jazz trumpeter Roy Hargrove in forming The RH Factor, a band that mixes elements of soul, jazz, and R&B. He is a member of the John Mayer Trio, and was the first choice by Pete Townshend and Roger Daltrey to fill the position left by John Entwistle as the current bassist for The Who.\n\nBiography\n\nPalladino began playing the electric guitar at age 14. By age 17 he decided to play the bass guitar, and bought his first fretless bass one year later, playing mostly R&B, funk, and reggae within a rock and roll backbeat. His first professional gig was at a local television station in Cardiff, where he began playing in 1978. That same year, at age 20, he joined Jools Holland's band and recorded with Holland on his album entitled, Jools Holland and His Millionaires. Palladino toured with Jools to support the album, which gave him the opportunity to purchase his own Music Man StingRay Fretless Bass. Holland was touring with another new band; the Q-Tips, whose frontman, Paul Young made acquaintance with Palladino whilst they were on tour, who would, a year later offer Pino a place in his own backing band.\n\nPino Palladino was featured on Gary Numan's 1982 album I, Assassin, in which his fretless bass sound made a prominent contribution to the overall sound of the album. He went on to play fretless bass with a healthy number of high-profile artists that include (on the short list), David Gilmour, Tears for Fears, Pete Townshend, Peter Gabriel, Joan Armatrading, Phil Collins, Chaka Khan and Don Henley.\n\nAfter vocalist Paul Young landed his own solo contract, Palladino was brought in as part of his backing band \"The Royal Family\" in 1983 with noticeable chart success with the No Parlez album, and major hit singles both in the UK and Europe. Examples of Young's new found success were the band's cover of the Marvin Gaye classic \"Wherever I Lay My Hat (That's My Home)\", which reached No. 1 in the UK singles chart for three weeks in the summer of 1983, and \"Love of the Common People\". Palladino toured extensively at this time with Paul Young, remaining in the band for five years. 1983 additionally proved to be the year of another ensemble featuring Palladino, Paul Rodgers (formerly of Bad Company, drummer Kenney Jones, along with a rotating cast of other celebrity performers. The band only released one album through Atlantic; The Law, although there were enough out-takes that another bootleg-styled album followed in 1991. Sales were unremarkable, despite the names of those who recorded on the album.\n\nThroughout the 1980s Palladino was noted for his R&B roots on the fretless bass, even when supporting pop and rock heavy performers. One reviewer from Bass Player magazine points to Paul Young’s cover of the Bobby Womack/Rufus tune \"Stop On By\" (on 1990’s Other Voices), with its \"pre-hip-hop, swung funk groove\" as the precursor to Palladino's later neo-soul focus.\n\n1990s\n\nChanges in instrument\n\nIn the 1990s, Palladino began to alternate between the sounds achieved in playing the fretless bass to one with frets, as well as the 4-string and 6-string bass. At the time, he was well known within the industry for his fretless bass sound. However, now, depending on which artist he was supporting, and the song to be played, he began gravitating towards fretted bass. He was maturing as a musician, and played with artists as diverse as Melissa Etheridge, Richard Wright, Sir Elton John and Eric Clapton. Also in 1991 he joined Paul Rodgers (of Free, Queen+ Paul Rodgers, and Bad Company fame) to form the band The Law. In the mid 1990's, Palladino played bass for The London Metropolitan orchestra during their recording of \"An American Symphony\", soundtrack for the movie Mr Hollands Opus.\n\nPalladino supported Phil Collins, as a member of the house band for the Golden Jubilee of Elizabeth II, which played with Sir Paul McCartney, Eric Clapton, Cliff Richard, and Tony Bennett, among other notable performers. He later wrote that he felt privileged to have been amongst the others on stage in such an event.\n\nIn 1999, he began working with Richard Ashcroft, of The Verve, during the recording sessions of Ashcroft's debut solo album, Alone With Everybody. Richard proved to be mightily impressed by Pino's natural bass playing ability;\n\nThis Pino Palladino, I can say a Meters record and he can play me the bass line. He can play anything. He's one of the only people in the world who can totally replicate that kind of Beach Boys/scratch/Walker Brothers bass. You can get that sound if you want it, dead on. So it was very liberating working with him.\n\nPino also joined Ashcroft's touring band for the singer's first major solo outing throughout 2000.\n\nNeo Soul\n\nBy the mid- 1990s, Palladino had established himself as a busy, highly desirable bassist and a studio worker in many genres, but finally became visible to those artists who played largely left of center, and demand for his session playing grew within a different quarter. Palladino began moving from blues-rock toward neo soul projects. Palladino and Steve Jordan found themselves performing on the same session for B.B. King’s 1997 duets CD Deuces Wild. It was the first time soul singer D'Angelo first heard Palladino, who had just switched from a signature sound fretless bass sound to that of performing with fretted basses. The result was an invitation to \"use Pino’s big, behind-the-beat bass to help cast a neo-soul spell on his Grammy Award-winning Voodoo album\". It would not be his first uncredited Grammy performance.\n\nAs the word spread throughout the genre, Palladino found an increasing demand within the neo-soul genre. Examples of his bass work in this genre (in addition to D'Angelo) includes Mama's Gun, and \"Penitentiary Philosophy\" found on Erykah Badu’s 2000 CD. Other albums using Pino's sound include 1st Born Second for Bilal, Like Water for Chocolate and Electric Circus for Common. Palladino has been described by Steve Jordan, who got his own professional start playing the drums for Stevie Wonder as having a \"deep funk\" side and a \"melodic\" side. Palladino admits, that \"Of all my influences, I would say what’s always in the back of my mind is early Stevie Wonder, like Talking Book and Innervisions; that music is really in my blood.\"\n\n2000s\n\nFollowing the death of The Who's bassist John Entwistle in 2002, the eve before the band were to kick off their first world tour in years, Palladino was their first choice to become the band's full-time touring bass guitarist, and by 2006, he was invited to join the remaining original band members in recording their first album in twenty-four years. Pete Townshend, the band's composer, recorded the bassline on the majority of the songs to get the effect he himself wanted, with Palladino doing so on the other six of them. Released in October 2006, the album was named Endless Wire.\n\nPalladino also recently played with The Who at the Super Bowl XLIV half-time show, in February, 2010, alongside other backing artists: Simon Townsend on guitar, Zak Starkey, drums and percussion, and John \"Rabbit\" Bundrick, on keyboard instruments.\n\nPaul Simon\n\nIn 2003, Palladino intended to go down to see his old friend Paul Simon and meet Brian Eno for the first time. He was asked to record with them, and had to borrow a bass guitar to play. The result was that he played with Simon and Garfunkel on their \"Old Friends\" reunion tour and in an interview with Bass Player Magazine he mentions drummer Steve Gadd and percussionist Jamey Haddad \"had laid down some great grooves for me to add bass\". He had kept the recordings, and by the time that he appeared on the Old Friends: Live on Stage CD and DVD from the tour, he was able to use some of the material. He played on Paul Simon's 2006 release, Surprise.\n\nOther appearances\n\nPalladino has toured in the backing band for Joe Walsh. In 2004 he appeared to be playing with Gary Moore at the Wembley Arena.\n\nEmergence of the John Mayer Trio\n\nPalladino met Steve Jordan in the mid-1980s while both were working as session players on many occasions, which blossomed into a friendship. When their work brought them to the same place, they would meet, usually jam together, and introduce other musicians to one another, forming friendships which sometimes blossomed into good working relationships. Jordan has remained keen about Pino since he met him, and only grows more enthusiastic about his talents, which he describes partly as his love for, and ability to \"feel\" changes in music, through melodies, basslines, and an amazing connection with genres of nearly every kind. According to Jordan, he'd planned to meet up with John Mayer and Willie Weeks in January, 2005 to perform a benefit concert on a NBC sponsored telethon Tsunami Aid: A Concert of Hope to raise funds and public awareness benefiting victims in the aftermath of the tsunami that struck southeast Asia. Weeks was unable to make the performance, and Jordan suggested Palladino, who had heard some of Mayer's work, and was willing to come. Beginning a set that included the Jimi Hendrix classic, \"Bold as Love\", the three all agreed that they experienced such chemistry that they began talking right away about arranging their schedules to record a CD and a tour. The trio released the album Try!, on November 22, 2005. The eleven-track live album includes cover songs, such as Jimi Hendrix's \"Wait Until Tomorrow\" and \"I Got A Woman\" by Ray Charles, two songs from Mayer's release Heavier Things, as well as new songs written by Mayer. In addition, Mayer, Palladino, and Jordan wrote three songs on the album: \"Good Love Is On The Way\", \"Vultures\", and \"Try!\". Along with John Mayer on guitar and vocals, and Steve Jordan on drums, Palladino has toured and recorded as a member of the John Mayer Trio, and on Mayer's third album Continuum.\n\nRecent tours\n\nIn spring of 2006, Palladino toured with Jeff Beck. He also played with J. J. Cale, and Eric Clapton on their 2006 album The Road to Escondido, alongside other notable musicians, including Derek Trucks, and Billy Preston. It was to be Preston's last work before he died only days afterward.\n\nInfluences on bass guitar\n\nInfluences for Palladino for bass guitar include Motown bassist James Jamerson; Stevie Wonder’s keyboard-bass, jazz innovator Jaco Pastorius; British folk/rock upright bassist Danny Thompson; Norman Watt-Roy (of Ian Dury & the Blockheads); Larry Graham; Michael Henderson; Bootsy Collins; Paul Jackson; Anthony Jackson; Doug Rauch (of Carly Simon and Santana), and Billy Cobham.\n\nTechnique\n\nPino Palladino is noted for his use of the fretless bass in many 1980s chart records. While it was typical for a bass guitar in a commercial track to have a rather generic sound and stay \"playing the low notes\" Palladino preferred a different sound (combining fretless tone with an octave effect) and basslines that frequently added chords, lead lines and counter melodies in the higher range of the instrument as opposed to simply the aforementioned \"low notes\". Typical of this style was his playing on Paul Young's biggest chart hits, in particular his bass solo on \"Wherever I Lay My Hat (That's My Home)\". His equipment at that time included a fretless Music Man StingRay Bass 1979 and Boss Octave pedal (OC-2).\n\nPino Palladino signature model\n\nThe Fender Pino Palladino Signature Precision Bass is modeled after two of Pino's Fender Precision Basses. The body featuring faded fiesta red paint over desert sand paint is based on Pino's 1961 Precision Bass while the neck shape and round-lam rosewood fret board are based on Pino's 1963 sunburst Precision Bass.\n\nRecent projects\n\nPalladino joined Eric Clapton's touring band for 11 dates in the Eastern U.S. and Canada in May 2008. Current work has included work on an with Clapton and Robbie Robertson, and Palladino guested on bass for Amos Lee on his third album, Last Days at the Lodge.\n\nIn 2009, Palladino joined with keyboardist Philippe Saisse and Simon Phillips to form an instrumental trio: Phillips Saisse Palladino, an instrumental jazz/funk rock ensemble, which have toured Europe through 2009 into 2010, playing songs that spotlight the talents of each performer, in the manner of many jazz outfits."}, {"url": "https://www.songhall.org/awards/winner/John_Mayer", "page_content": "Critically-acclaimed songwriter John Mayer is prone to accomplishment. Over the past five years, he has sold over eight million albums (Room For Squares, Heavier Things) and won three Grammy Awards, including the Grammy for Song of the Year with “Daughters.” In 2005, John formed the John Mayer Trio - a blues & rock-influenced collaboration with legendary studio musicians Steve Jordan and Pino Palladino. The Trio embarked on a nationwide tour of intimate venues followed by the release of the highly-praised live album, TRY! in November ‘05.\n\nAt 28, Mayer has already earned the respect of his peers and predecessors alike. He has performed with icons such as Clapton, BB King, Buddy Guy, Herbie Hancock, and John Scofield, and collaborated with contemporaries like Kanye West, Ahmir ?uestlove from The Roots, and Alicia Keys.\n\nJohn Mayer’s third studio album, aptly titled CONTINUUM, makes good on its name, fulfilling the promise expected from such a musical resume. CONTINUUM will be released in August 2006."}, {"url": "https://guitar.com/news/music-news/watch-john-mayer-reunites-with-trio-for-the-first-time-in-six-years/", "page_content": "John Mayer has reunited with his blues trio, Steven Jordan and Pino Palladino for the first time in six years, and lucky for us it has been captured for the world to see.\n\nThe John Mayer Trio was brought together in 2005, and saw the release of the live album Try! in the same year.\n\nThe reunion took place at the seventh annual love Rocks Benefit Concert on 9 March, which marked the first time the trio had played together since 2016, when they graced the Apollo Theatre in New York for a one off performance.\n\nHowever the surprises did not stop there, as the Continuum singer and guitarist also pulled out his Fender Jimi Hendrix Monterey Stratocaster. Seeing Mayer play a Strat is a huge throwback to when he was a Fender artist, before making the shock exit from the manufacturer in 2014. This was before he became signed by PRS, and he released his famous PRS SE Silver Sky.\n\nYou can watch the full set below:\n\nMayer has just kicked off his North American tour, starting in Newark, New Jersey. So far it is getting rave reviews and showcases some amazing axes, from the aforementioned Jimmy Hendrix strat, as well as a Martin custom double-neck guitar.\n\nThe Tim Teel-built Martin Custom Shop 12-string / six-string combo was first seen at NAMM in 2010, but there’s no specific details about the wonderous guitar available.\n\nMayer’s solo arena tour continues this evening (13 March) in Boston, Massachusetts so keep your eyes peeled for more interesting guitar sightings."}, {"url": "https://www.theguardian.com/music/2021/apr/06/pino-palladino-pop-greatest-bassist-adele-elton-the-who", "page_content": "By his own admission, Pino Palladino is not a man much accustomed to giving interviews. “Very reticent,” he nods during a Zoom call, his accent speaking noticeably louder of his childhood in Cardiff than his current home in LA. “You know, there was a time when I was featured in all sorts of musicians’ magazines, and then I just thought to myself, ‘Move over, there’s people out there that actually need the publicity.’ Not to blow smoke up my own arse,” he adds hurriedly, “but really I just didn’t want to see or hear from myself.”\n\nIt’s a remark in keeping with the astonishing career of one of the most celebrated bass players in the world. It’s hard not to blanche when you consider the sheer number of records that have been sold featuring his work. He played on not one but two of the biggest selling albums of the 21st century: Adele’s 21 and Ed Sheeran’s Divide, as well as with Rod Stewart, Elton John, Bryan Ferry, Simon and Garfunkel and Keith Richards. They’re the biggest names in a startlingly diverse back catalogue of collaborations: Palladino’s playing is the thread that links Perfume Genius with Phil Collins, Harry Styles with Chris de Burgh, and Nine Inch Nails with De La Soul. Indeed, his versatility and omnipresence is a running joke within the music industry. When another fabled bass player, Pink Floyd’s Guy Pratt, got married, he opened his groom’s speech with the words: “I’m only here today because Pino couldn’t make it.”\n\nFor a musician who seems to have turned up everywhere over the last 40 years, Palladino has remained a remarkably anonymous figure outside of musicians’ circles. Indeed, he somehow contrived to spend 14 years as a member of the Who without really losing what he calls an “invisible stance”. He certainly stands out in photographs of the Soulquarians, the experimental collective assembled by D’Angelo for his legendary album Voodoo, the solitary lanky Welshman among a crowd of African-American musicians including Questlove and the late J Dilla – but you would still struggle to recognise him in the street.\n\nCardiff’s finest … Palladino in 1985. Photograph: Paul Natkin/Getty Images\n\nThis is presumably how Palladino likes it. He’s drily funny and self-deprecating – he says his default setting when working with a new artist is “do not fucking spoil it” – but doesn’t seem terribly frustrated by life in the background. Which makes it all the more surprising that he’s releasing an album on which he shares billing with Blake Mills: Notes With Attachments, a fascinating, head-turning collection of experimental instrumentals that sits somewhere between jazz, global music and ambient. He and Mills, who has produced for Fiona Apple and Laura Marling, met while working on a John Legend album. “We hit it off and the next thing you know, he’s saying to me ‘Have you thought about a solo album?’ Well, I’ve thought about it, obviously,” he laughs. “For 40 years I’ve thought about it, but I’ve never really had an idea how I could do it.”\n\nStudded with guest appearances – from avant-garde saxophonist Sam Gendel and jazz drummer Chris Dave, among others – Notes With Attachments foregrounds the sound that made Palladino’s name: the none-more-80s sprrroing of the fretless bass put through a chorus pedal. He first used it while working with Gary Numan, but it was Paul Young’s 1983 hit Wherever I Lay My Hat that introduced it to a mass audience: pushed up in the mix, the bass effectively became a lead instrument. It was so striking that Palladino suddenly found himself playing with everyone from Go West and Don Henley to Tears for Fears: he turned up on Top of the Pops with alarming regularity, the musical equivalent of a hip item of designer clothing. “There was a lot of it around in those days,” he says of the sound. “I was so lucky – it resonated with people, captured their imagination and it took on a life of its own. It did get to the point where I was getting booked for sessions and feeling like a performing monkey: ‘Yeah, bring your fretless, make that funny sound and maybe we’ll get a hit out of it.’”\n\nHe also found himself becoming the sideman of choice for the rock aristocracy. “The first call I got like that was from David Gilmour. I could not believe it: am I going to the studio with this guy and pretend I actually belong there? I was nervous as fuck, but the drummer on the session was Jeff Porcaro [famed for playing with Toto and on Michael Jackson’s Thriller album], and he was really sweet: ‘Come on, man, chill out, have a smoke on this.’ So I did, and that seemed to work for me. I just had to keep that attitude through all of that period: phone calls from Elton John and Phil Collins – you have to keep that headspace that you belong, even if you think you’re going to be found out any minute.”\n\n‘You’ll have to play louder!’ … performing with the Who at the 2016 Desert Trip festival in California. Photograph: Kevin Mazur/Getty Images\n\nHe says another phone call, this time from D’Angelo – who had heard his playing on a BB King album – changed his life. “My roots are in Motown, reggae, R&B. I didn’t get much of an opportunity to express that side of music and then I met the don – how lucky was that? D’Angelo – I’d mention him in the same breath as Stevie Wonder and Donny Hathaway and Sly Stone. When I was in the studio with D and Questlove, James Poyser, all those guys, I don’t even have to think about what I’m playing. It’s incredible, to be a Welsh guy, having no real connections to these guys other than music that we loved and played. From a personal satisfaction point of view, it was as good as it ever got, probably will get.\n\n“It took people 10 years, 20, to really get the first album we made, Voodoo, but I absolutely knew it was unique and really special – I was probably more aware of it than the rest of them, because I’d been working for a long time. I knew this kind of thing didn’t come around very often.”\n\nThe Soulquarians went on to record with Erykah Badu, Mos Def and Talib Kweli; the influence of their loose approach can be heard on Kendrick Lamar’s epochal 2015 album To Pimp a Butterfly. They had just wrapped up a session with Common when Palladino learned that the Who’s bassist, John Entwistle, had died – and that the band had declined to cancel their forthcoming tour and wanted Palladino to replace him … on stage at the Hollywood Bowl, in two days.\n\n“I flew to LA, thinking, what are you doing? You don’t even know many Who songs. Pete Townshend was waiting for me at the hotel, with a big stack of CDs. ‘You don’t know much of the catalogue? Fair enough. You’re going to know it tonight, then, aren’t you?’ At the first rehearsal, Pete comes over and says: ‘You’re going to have to play louder’ – because I’m used to being the sympathetic musician, who fills in, doesn’t make a racket. That’s the one instruction you keep getting when you work with the Who: ‘Fucking turn it up, we can’t hear you!’”\n\nPalladino says he’s “not exactly crazy about touring any more” – he stopped playing live with the Who in 2016 – but is considering doing some gigs around Notes With Attachments, pandemic permitting. Until then, there are still sessions to attend to in LA, with Covid tests in the car park for anyone taking part. “Film and music studios are considered essential to the economy here – you’ve got to love that, right?” he laughs. “Mind you,” he says, “that’s better than Britain telling you if you’re a musician or an artist you might have to look for a new job.”"}, {"url": "https://music.douban.com/musician/101860/", "page_content": "2005年，Mayer和Jordan决定和贝司手Willie Weeks参演一档NBC叫做 Tsunami Aid: A Concert of Hope的节目，意在为在东南亚海啸中受灾的地区筹款赈灾。然而随着演出的临近，weeks却没有履约。于是Jordan建议让著名的贝司手Pino Palladino来代替weeks。当三人进行演出时，竟发现了彼此间强烈的化学反应。之后三人组成了现在的trio乐队。2005年10月份，三人为滚石乐队 A Bigger Bang Tour做开场表演。随着巡演的进行，乐队的反响很大。对于2005年10月6日进行的一场演出， Alan Light和... (展开全部) 2005年，Mayer和Jordan决定和贝司手Willie Weeks参演一档NBC叫做 Tsunami Aid: A Concert of Hope的节目，意在为在东南亚海啸中受灾的地区筹款赈灾。然而随着演出的临近，weeks却没有履约。于是Jordan建议让著名的贝司手Pino Palladino来代替weeks。当三人进行演出时，竟发现了彼此间强烈的化学反应。之后三人组成了现在的trio乐队。2005年10月份，三人为滚石乐队 A Bigger Bang Tour做开场表演。随着巡演的进行，乐队的反响很大。对于2005年10月6日进行的一场演出， Alan Light和滚石乐队说，一个错误也没有，有鼓手Jordan和贝司手pino做支持，John Mayer演奏的blues一向让人印象深刻。\n\n\n\n2005年的2月，这只trio在第47届格莱美表演了daughters，当晚John Mayer因为这首歌获得了最佳男歌手的奖项（虽然是trio演出，但是那晚的表演只挂了JM的名字）。之后，Trio乐队发布了一首come when i call，这只单曲独占iTunes之首。虽然滚石乐队曾经说过下载量只是个“尖叫的形象工程”，他们却承认“Mayer是个令人难以置信的，却又让人心悦诚服的小SRV”，并给这首歌打了很高分。另一个评论家说到，能把SRV和Eric Clapton的音乐融合在一起的歌手，确实有那么几个技术娴熟的。明显是在说John Mayer的《Heavier Things》。\n\n\n\nTrio乐队于2005年发行了现场专辑《Try！》，这个精彩的现场把公众的注意都集中在mayer漂亮的吉他弹奏上，mayer用他动听的吉他solo证明给他的质疑者。同时这张专辑大受好评，并取得了商业性的成功，Mayer相信之后的专辑continuum会让你觉得四年的等待是值得的。\n\n\n\n2006年4月1日，mayer宣布这支trio乐队在亚那桑那州Tempe Music Festival in Tempe的表演是他们最后一场的表演。三位音乐人也打算之后发行一张专辑，他们提出来会一起写几首歌首歌。从他们的合作成果看，三个人为专辑写了三首歌：\"Good Love Is On The Way,\" \"Vultures,\" and \"Try\"。\n\n\n\nJohn Mayer和trio乐队的合作影响了他新专辑《continuum》的创作，这张专辑是他和Jordan共同完成的。Mayer说，“很多人以为这张专辑像是60个人花12个月完成的，事实上他是由4个人完成的。你把磁带放进去，来回听，不停地问，‘它是不是让我感觉到什么，是还是不是？‘想明白了，你就继续听。”2006年9月12日，梅尔的个人专辑《continuum》发行（里面包括trio乐队的try！专辑中的歌曲），Mayer在博客中宣布，乐队会重组，并且会做一张录音室专辑。\n\n\n\n2007年12月8日，乐队为了一场演出又走到一起。演出中，John Mayer表演了acoustic，并分别和trio及自己的乐队做表演。\n\n最受欢迎的单曲 · · · · · · Over The Rainbow 4歌单 添加到歌单\n\nZing, Went The Strings Of My Heart 1歌单 添加到歌单"}, {"url": "https://www.jambase.com/article/john-mayer-in-studio-with-trio-members", "page_content": "Back in September we reported that John Mayer had revealed in a tweet upcoming plans to go “back in the studio with the Continuum crew in January.” The Continuum crew would be drummer Steve Jordan and bassist Pino Palladino who make up the John Mayer Trio that recorded and released the Trio’s live album Try! in 2005.\n\nAnother new social media update from Mayer indicates he’s followed up on his September tweet, sharing a photo on Instagram (shown below) with Palladino and Jordan captioned, “In the studio, day one.”\n\nMayer’s recently been active with Dead & Company and hinted on New Year’s Eve that the band featuring Grateful Dead members might have more shows coming later this year. Palladino’s been performing live with The Who and appeared prominently on D’Angelo’s critically acclaimed album Black Messiah, while Jordan notably contributed to Keith Richard’s 2015 solo album Crosseyed Heart.\n\nThe John Mayer Trio first toured together in 2005 and has gotten together for performances several times in the years since. In early 2014 Mayer reunited the trio for an appearance on Late Night With Seth Meyers for a performance of “After Midnight” that included keyboardist Chick Corea, percussionist Manolo Badrena and trumpeter Wallace Roney. Around that same time Mayer tweeted he was in the studio with Jordan, Palladino and Corea, “playing some wide open stuff.”\n\nLoading tour dates"}], "Pino Palladino was a member of Paul Rodgers' band.": [{"url": "https://www.allmusic.com/artist/pino-palladino-mn0000292499/biography", "page_content": "Biography Pino Palladino Follow Artist +\n\nSince the 1980s, this session and live bassist is among the most prolific, gifted, and sought after by musicians of all genres.\n\nRead Full Biography"}, {"url": "https://www.theguardian.com/music/2021/apr/06/pino-palladino-pop-greatest-bassist-adele-elton-the-who", "page_content": "By his own admission, Pino Palladino is not a man much accustomed to giving interviews. “Very reticent,” he nods during a Zoom call, his accent speaking noticeably louder of his childhood in Cardiff than his current home in LA. “You know, there was a time when I was featured in all sorts of musicians’ magazines, and then I just thought to myself, ‘Move over, there’s people out there that actually need the publicity.’ Not to blow smoke up my own arse,” he adds hurriedly, “but really I just didn’t want to see or hear from myself.”\n\nIt’s a remark in keeping with the astonishing career of one of the most celebrated bass players in the world. It’s hard not to blanche when you consider the sheer number of records that have been sold featuring his work. He played on not one but two of the biggest selling albums of the 21st century: Adele’s 21 and Ed Sheeran’s Divide, as well as with Rod Stewart, Elton John, Bryan Ferry, Simon and Garfunkel and Keith Richards. They’re the biggest names in a startlingly diverse back catalogue of collaborations: Palladino’s playing is the thread that links Perfume Genius with Phil Collins, Harry Styles with Chris de Burgh, and Nine Inch Nails with De La Soul. Indeed, his versatility and omnipresence is a running joke within the music industry. When another fabled bass player, Pink Floyd’s Guy Pratt, got married, he opened his groom’s speech with the words: “I’m only here today because Pino couldn’t make it.”\n\nFor a musician who seems to have turned up everywhere over the last 40 years, Palladino has remained a remarkably anonymous figure outside of musicians’ circles. Indeed, he somehow contrived to spend 14 years as a member of the Who without really losing what he calls an “invisible stance”. He certainly stands out in photographs of the Soulquarians, the experimental collective assembled by D’Angelo for his legendary album Voodoo, the solitary lanky Welshman among a crowd of African-American musicians including Questlove and the late J Dilla – but you would still struggle to recognise him in the street.\n\nCardiff’s finest … Palladino in 1985. Photograph: Paul Natkin/Getty Images\n\nThis is presumably how Palladino likes it. He’s drily funny and self-deprecating – he says his default setting when working with a new artist is “do not fucking spoil it” – but doesn’t seem terribly frustrated by life in the background. Which makes it all the more surprising that he’s releasing an album on which he shares billing with Blake Mills: Notes With Attachments, a fascinating, head-turning collection of experimental instrumentals that sits somewhere between jazz, global music and ambient. He and Mills, who has produced for Fiona Apple and Laura Marling, met while working on a John Legend album. “We hit it off and the next thing you know, he’s saying to me ‘Have you thought about a solo album?’ Well, I’ve thought about it, obviously,” he laughs. “For 40 years I’ve thought about it, but I’ve never really had an idea how I could do it.”\n\nStudded with guest appearances – from avant-garde saxophonist Sam Gendel and jazz drummer Chris Dave, among others – Notes With Attachments foregrounds the sound that made Palladino’s name: the none-more-80s sprrroing of the fretless bass put through a chorus pedal. He first used it while working with Gary Numan, but it was Paul Young’s 1983 hit Wherever I Lay My Hat that introduced it to a mass audience: pushed up in the mix, the bass effectively became a lead instrument. It was so striking that Palladino suddenly found himself playing with everyone from Go West and Don Henley to Tears for Fears: he turned up on Top of the Pops with alarming regularity, the musical equivalent of a hip item of designer clothing. “There was a lot of it around in those days,” he says of the sound. “I was so lucky – it resonated with people, captured their imagination and it took on a life of its own. It did get to the point where I was getting booked for sessions and feeling like a performing monkey: ‘Yeah, bring your fretless, make that funny sound and maybe we’ll get a hit out of it.’”\n\nHe also found himself becoming the sideman of choice for the rock aristocracy. “The first call I got like that was from David Gilmour. I could not believe it: am I going to the studio with this guy and pretend I actually belong there? I was nervous as fuck, but the drummer on the session was Jeff Porcaro [famed for playing with Toto and on Michael Jackson’s Thriller album], and he was really sweet: ‘Come on, man, chill out, have a smoke on this.’ So I did, and that seemed to work for me. I just had to keep that attitude through all of that period: phone calls from Elton John and Phil Collins – you have to keep that headspace that you belong, even if you think you’re going to be found out any minute.”\n\n‘You’ll have to play louder!’ … performing with the Who at the 2016 Desert Trip festival in California. Photograph: Kevin Mazur/Getty Images\n\nHe says another phone call, this time from D’Angelo – who had heard his playing on a BB King album – changed his life. “My roots are in Motown, reggae, R&B. I didn’t get much of an opportunity to express that side of music and then I met the don – how lucky was that? D’Angelo – I’d mention him in the same breath as Stevie Wonder and Donny Hathaway and Sly Stone. When I was in the studio with D and Questlove, James Poyser, all those guys, I don’t even have to think about what I’m playing. It’s incredible, to be a Welsh guy, having no real connections to these guys other than music that we loved and played. From a personal satisfaction point of view, it was as good as it ever got, probably will get.\n\n“It took people 10 years, 20, to really get the first album we made, Voodoo, but I absolutely knew it was unique and really special – I was probably more aware of it than the rest of them, because I’d been working for a long time. I knew this kind of thing didn’t come around very often.”\n\nThe Soulquarians went on to record with Erykah Badu, Mos Def and Talib Kweli; the influence of their loose approach can be heard on Kendrick Lamar’s epochal 2015 album To Pimp a Butterfly. They had just wrapped up a session with Common when Palladino learned that the Who’s bassist, John Entwistle, had died – and that the band had declined to cancel their forthcoming tour and wanted Palladino to replace him … on stage at the Hollywood Bowl, in two days.\n\n“I flew to LA, thinking, what are you doing? You don’t even know many Who songs. Pete Townshend was waiting for me at the hotel, with a big stack of CDs. ‘You don’t know much of the catalogue? Fair enough. You’re going to know it tonight, then, aren’t you?’ At the first rehearsal, Pete comes over and says: ‘You’re going to have to play louder’ – because I’m used to being the sympathetic musician, who fills in, doesn’t make a racket. That’s the one instruction you keep getting when you work with the Who: ‘Fucking turn it up, we can’t hear you!’”\n\nPalladino says he’s “not exactly crazy about touring any more” – he stopped playing live with the Who in 2016 – but is considering doing some gigs around Notes With Attachments, pandemic permitting. Until then, there are still sessions to attend to in LA, with Covid tests in the car park for anyone taking part. “Film and music studios are considered essential to the economy here – you’ve got to love that, right?” he laughs. “Mind you,” he says, “that’s better than Britain telling you if you’re a musician or an artist you might have to look for a new job.”"}, {"url": "https://amp.theguardian.com/music/2021/apr/06/pino-palladino-pop-greatest-bassist-adele-elton-the-who", "page_content": "Show caption Rock’s sideman of choice ... Pino Palladino, left, with Blake Mills. Music Pino Palladino, pop’s greatest bassist: ‘I felt like a performing monkey!’ One of the world’s most celebrated bass players has worked with everyone from Adele to Elton John, the Who and D’Angelo. But the Welsh musician has hidden from the spotlight – until now Alexis Petridis Tue 6 Apr 2021 06.00 BST Share on Facebook\n\nShare on Twitter\n\nShare via Email\n\nBy his own admission, Pino Palladino is not a man much accustomed to giving interviews. “Very reticent,” he nods during a Zoom call, his accent speaking noticeably louder of his childhood in Cardiff than his current home in LA. “You know, there was a time when I was featured in all sorts of musicians’ magazines, and then I just thought to myself, ‘Move over, there’s people out there that actually need the publicity.’ Not to blow smoke up my own arse,” he adds hurriedly, “but really I just didn’t want to see or hear from myself.”\n\nIt’s a remark in keeping with the astonishing career of one of the most celebrated bass players in the world. It’s hard not to blanche when you consider the sheer number of records that have been sold featuring his work. He played on not one but two of the biggest selling albums of the 21st century: Adele’s 21 and Ed Sheeran’s Divide, as well as with Rod Stewart, Elton John, Bryan Ferry, Simon and Garfunkel and Keith Richards. They’re the biggest names in a startlingly diverse back catalogue of collaborations: Palladino’s playing is the thread that links Perfume Genius with Phil Collins, Harry Styles with Chris de Burgh, and Nine Inch Nails with De La Soul. Indeed, his versatility and omnipresence is a running joke within the music industry. When another fabled bass player, Pink Floyd’s Guy Pratt, got married, he opened his groom’s speech with the words: “I’m only here today because Pino couldn’t make it.”\n\nFor a musician who seems to have turned up everywhere over the last 40 years, Palladino has remained a remarkably anonymous figure outside of musicians’ circles. Indeed, he somehow contrived to spend 14 years as a member of the Who without really losing what he calls an “invisible stance”. He certainly stands out in photographs of the Soulquarians, the experimental collective assembled by D’Angelo for his legendary album Voodoo, the solitary lanky Welshman among a crowd of African-American musicians including Questlove and the late J Dilla – but you would still struggle to recognise him in the street.\n\nCardiff’s finest … Palladino in 1985. Photograph: Paul Natkin/Getty Images\n\nThis is presumably how Palladino likes it. He’s drily funny and self-deprecating – he says his default setting when working with a new artist is “do not fucking spoil it” – but doesn’t seem terribly frustrated by life in the background. Which makes it all the more surprising that he’s releasing an album on which he shares billing with Blake Mills: Notes With Attachments, a fascinating, head-turning collection of experimental instrumentals that sits somewhere between jazz, global music and ambient. He and Mills, who has produced for Fiona Apple and Laura Marling, met while working on a John Legend album. “We hit it off and the next thing you know, he’s saying to me ‘Have you thought about a solo album?’ Well, I’ve thought about it, obviously,” he laughs. “For 40 years I’ve thought about it, but I’ve never really had an idea how I could do it.”\n\nStudded with guest appearances – from avant-garde saxophonist Sam Gendel and jazz drummer Chris Dave, among others – Notes With Attachments foregrounds the sound that made Palladino’s name: the none-more-80s sprrroing of the fretless bass put through a chorus pedal. He first used it while working with Gary Numan, but it was Paul Young’s 1983 hit Wherever I Lay My Hat that introduced it to a mass audience: pushed up in the mix, the bass effectively became a lead instrument. It was so striking that Palladino suddenly found himself playing with everyone from Go West and Don Henley to Tears for Fears: he turned up on Top of the Pops with alarming regularity, the musical equivalent of a hip item of designer clothing. “There was a lot of it around in those days,” he says of the sound. “I was so lucky – it resonated with people, captured their imagination and it took on a life of its own. It did get to the point where I was getting booked for sessions and feeling like a performing monkey: ‘Yeah, bring your fretless, make that funny sound and maybe we’ll get a hit out of it.’”\n\nHe also found himself becoming the sideman of choice for the rock aristocracy. “The first call I got like that was from David Gilmour. I could not believe it: am I going to the studio with this guy and pretend I actually belong there? I was nervous as fuck, but the drummer on the session was Jeff Porcaro [famed for playing with Toto and on Michael Jackson’s Thriller album], and he was really sweet: ‘Come on, man, chill out, have a smoke on this.’ So I did, and that seemed to work for me. I just had to keep that attitude through all of that period: phone calls from Elton John and Phil Collins – you have to keep that headspace that you belong, even if you think you’re going to be found out any minute.”\n\n‘You’ll have to play louder!’ … performing with the Who at the 2016 Desert Trip festival in California. Photograph: Kevin Mazur/Getty Images\n\nHe says another phone call, this time from D’Angelo – who had heard his playing on a BB King album – changed his life. “My roots are in Motown, reggae, R&B. I didn’t get much of an opportunity to express that side of music and then I met the don – how lucky was that? D’Angelo – I’d mention him in the same breath as Stevie Wonder and Donny Hathaway and Sly Stone. When I was in the studio with D and Questlove, James Poyser, all those guys, I don’t even have to think about what I’m playing. It’s incredible, to be a Welsh guy, having no real connections to these guys other than music that we loved and played. From a personal satisfaction point of view, it was as good as it ever got, probably will get.\n\n“It took people 10 years, 20, to really get the first album we made, Voodoo, but I absolutely knew it was unique and really special – I was probably more aware of it than the rest of them, because I’d been working for a long time. I knew this kind of thing didn’t come around very often.”\n\nThe Soulquarians went on to record with Erykah Badu, Mos Def and Talib Kweli; the influence of their loose approach can be heard on Kendrick Lamar’s epochal 2015 album To Pimp a Butterfly. They had just wrapped up a session with Common when Palladino learned that the Who’s bassist, John Entwistle, had died – and that the band had declined to cancel their forthcoming tour and wanted Palladino to replace him … on stage at the Hollywood Bowl, in two days.\n\n“I flew to LA, thinking, what are you doing? You don’t even know many Who songs. Pete Townshend was waiting for me at the hotel, with a big stack of CDs. ‘You don’t know much of the catalogue? Fair enough. You’re going to know it tonight, then, aren’t you?’ At the first rehearsal, Pete comes over and says: ‘You’re going to have to play louder’ – because I’m used to being the sympathetic musician, who fills in, doesn’t make a racket. That’s the one instruction you keep getting when you work with the Who: ‘Fucking turn it up, we can’t hear you!’”\n\nPalladino says he’s “not exactly crazy about touring any more” – he stopped playing live with the Who in 2016 – but is considering doing some gigs around Notes With Attachments, pandemic permitting. Until then, there are still sessions to attend to in LA, with Covid tests in the car park for anyone taking part. “Film and music studios are considered essential to the economy here – you’ve got to love that, right?” he laughs. “Mind you,” he says, “that’s better than Britain telling you if you’re a musician or an artist you might have to look for a new job.”"}, {"url": "https://www.udiscovermusic.com/stories/pino-palladino-interview/", "page_content": "Photo: Cedric Ribeiro/Getty Images\n\n“All musicians are the same, we all think we’re rubbish,” Pino Palladino told a British television interviewer in 2013, adding a gentle laugh. It was a typically massive understatement from the quietly affable Welsh bassist, among the highest-regarded session players in the music industry. In this case, Palladino was referring to hearing Paul Young’s “Wherever I Lay My Hat” on the radio for the first time in 1983 – particularly his casual contribution, one of the most recognizable bass lines of the 1980s. “I was worried that it sounded a bit out of tune,” he said.\n\nIn a decades-long career, Palladino has not only provided low-end support for several musical revolutions, he’s helped stoke a few of them himself, undergirding pioneering sounds in pop, New Wave, neo-soul, electronic, rock, jazz, funk, and even industrial with an ever-inventive foundation. He’s widely regarded as one of the most influential bass players ever, with just as much name recognition in certain quarters as the superstars he’s backed.\n\nBeginning with Gary Numan in 1982 and continuing through work with artists like Young, Phil Collins, Tears for Fears, Go West, and Chris de Burgh, Palladino helped define the coolly emotive 80s sound with his trademark fretless technique. In the 1990s he backed Elton John, Eric Clapton, Carly Simon, Bryan Ferry, Joan Armatrading, B.B. King, and many more, before joining the legendary Soulquarians artists collective, reviving cosmic soul and funk sounds with Erykah Badu, D’Angelo, Questlove, and J. Dilla.\n\nADVERTISEMENT\n\nFrom there, it was on to stints with Mika, Nine Inch Nails, Adele, Kelly Clarkson, Paul Simon, and Keith Urban, among a wealth of others, as he also embarked on longtime touring associations with Jeff Beck and John Mayer. Palladino’s most famous stretch came with The Who, when he stepped in after John Entwistle’s untimely death in 2002 to tour and record for two decades, playing probably the most famous bass solo in pop – 1965’s “My Generation” – for arena-sized crowds. Most recently, he’s played for Harry Styles, Ed Sheeran, Corinne Bailey Rae, and John Legend. You can’t talk about Pino Palladino without mentioning a few names.\n\nNow, at last, Pino Palladino is releasing an album of his own, collaborating with guitarist Blake Mills. Called Notes with Attachments, the record summons intimate, cinematic moods, bristling with sophisticated patterns, atmospheric woodwinds, and surprising electronic touches. It’s a compendium of several decades’ worth of Palladino’s compositional ideas, complex, and contemporary yet warm with nostalgia – paying homage to the classic film soundtracks, cool jazz, and Burt Bacharach arrangements he loves.\n\nIn honor of the new release, we accompanied the lauded bassist on a trip down memory lane, revisiting some of his best-known album and tour appearances.\n\nTear for Fears, Seeds of Love (1989)\n\nPino Palladino: I have a lot of great memories of that album, not least because my daughter Fabiana was born around the time we were recording it. My life was changing in a big way. I had been doing a lot of session work with the French drummer Manu Katché, who toured with Peter Gabriel. We were becoming known as a rhythm section together, and a bit in demand. I believe that’s how Roland Orzabal heard of us and invited us onto the album.\n\nThe actual recording was unusual for the time; the tracks were cut live with a full band. We holed up together for a few weeks in Townhouse Studios in London, and went through each of the songs, experimenting with instrumentation and arrangement. There were some days when we just jammed and extended parts of the songs. Roland then took the whole bundle and edited it down into what you hear on the album. We must have recorded “Badman’s Song” and “Woman in Chains” a dozen different ways with different transitions. Roland’s choices and his taste as the composer, defined the amazing end results.\n\n\n\nWatch this video on YouTube Click to load video\n\nOne of my fondest memories: When I first got there, I was going into the control room and I heard this incredible piano-playing in the studio. I was wondering, “Who is that?” I went round the corner and there was Oleta Adams, sitting at the grand piano and singing so beautifully, jamming away on gospel and blues. I’m honored to have played on her solo album Circle of One.\n\nThe Seeds Of Love can be bought here.\n\nElton John, The One (1992)\n\nPino Palladino: We recorded in Paris at Studio Guillaume Tell. Well, the food in Paris was excellent. We would end every day going out to dinner at high-end restaurants with the table piled up with dishes. It was really something to keep up with…but I rose to the challenge!\n\nWorking on that record and spending time with Elton was humbling. I remember one day, Bernie Taupin faxed some song lyrics over in the morning, and Elton took them into the next room and had an amazing song written within an hour…incredible! At this time I was really known for my fretless bass sound, it was something people specifically hired me for. Elton encouraged me to develop my ideas for the basslines and let me do my thing on the record.\n\n\n\nWatch this video on YouTube Click to load video\n\nErykah Badu, Mama’s Gun (2000)\n\nPino Palladino: This was during the Soulquarians period, it was a real fun time. I made the connection because Ahmir [“Questlove” Thompson] had called me in to add to one of the songs he was working on. We thought I would just overdub the bass on one track, but it felt really good and we built up a vibe. Erykah had booked time at The Lady and we reconvened at a later date.\n\nErykah’s way of working was refreshing. For Mama’s Gun, Erykah had sketched out a couple ideas for the album, and had a vision of what she wanted, but otherwise it was pretty undetermined at that point. We all assembled, the whole band, and Erykah just came around, so cool in her way, and asked “OK, Pino, what you got?” That was it. “What you got?” We played around with some different ideas, and it turned into a collaboration, developing the songs together. I played a bassline I had in my mind for a while, and that became the first song on the album, “Penitentiary Philosophy.”\n\nOddly enough, it reminded me of when I was getting started, working with Gary Numan on the I, Assassin album in 1983. Back then, I showed up and Gary had recorded his songs but didn’t have bass parts on them. He wanted me to come up with ideas and gave me complete freedom to compose the parts for the songs. I played my fretless bass and that sound became the sonic signature for the record. What made it different with Erykah, is that this time I got a songwriting and production credit.\n\nListen to Mama’s Gun here.\n\nD’Angelo, Voodoo (2000)\n\nPino Palladino: Being a part of that moment when this album and Mama’s Gun came out almost back to back was thrilling. After meeting D on a session with B.B. King, he invited me to meet him and his engineer, Russ Elevado, at Electric Lady Studios with a view to me playing some bass on the songs for his upcoming record, Voodoo.\n\nWhen they played some of the songs for me, I was mesmerized by the unique feel of the grooves and D’s otherworldly vocal arrangements. D’Angelo had written the songs for Voodoo at the keyboard and while his left hand would play what would become the blueprints for the basslines, his right hand plays the chords and flourishes that accompany the main melody. It all fits together in such a unique way… The basslines are woven into the fabric of the composition from the start.\n\n\n\nWatch this video on YouTube Click to load video\n\nAlthough some songs were established when I got there, others were left more open to develop ideas and for me, some freedom of expression, from adding in passing notes to flurries up to the top of the bass neck to complement his vocals. Because the album is so bass- and rhythm-driven, everything mattered, it was all at the top of the mix, he encouraged me to bring my thing to the music and, through him, I met Erykah, Quest, James Poyser, Roy Hargrove, J Dilla, Common, and all the Soulquarian collective.\n\nListen to Voodoo here.\n\nAdele, 21 (2011)\n\nPino Palladino: I was back in London when [producer] Rick Rubin reached out to me about recording a new album for Adele. She had already made a name for herself in the UK before she broke worldwide, so I had heard of her. Rick told me, “I want to get you into this fantastic band, with drummer Chris Dave, Matt Sweeney and Smokey Hormel on guitars, James Poyser on piano, and really give her the strong backing she deserves.” I flew out to Shangri-La studios in California where they were recording, and she just killed it on the vocals from the start. I remember hearing her voice for the first time through my headphones and being blown away by how she could sing. The songs were really great and I knew we were recording something special.\n\nMika, The Origin of Love (2012)\n\nPino Palladino: Mika has certainly got some incredible energy, he would bounce around the studio with all these ideas. Mika brought a lot of curiosity to the process, he would come up with things while I was playing. He was interested to hear fretless bass on some of the songs and liked how it fitted in. I believe I was hooked up with him through Nick Littlemore from Empire of the Sun. Working on a more electronic-oriented pop album was interesting. It’s great to get the opportunity to expand what you do, and try out different directions.\n\n\n\nWatch this video on YouTube Click to load video\n\nNine Inch Nails, Hesitation Marks (2013)\n\nPino Palladino: Trent [Reznor] reached out to me, out of the blue, and asked if I would be interested in collaborating on a couple of tracks for the album. I was really curious how I would fit in with his sound. Trent is a very good communicator, with clear ideas. He is a fan of Voodoo and of Gary Numan, so for me that was interesting as I could maybe bring two different sides of my playing to the music. I played a couple of takes on each song and just did my thing. Later, Trent’s manager called and asked if I would be interested in touring. It turned out that the band had already been rehearsing for a month. It was a real challenge to learn the songs in a short amount of time before we went on the road. And I had no idea how his fans would react to me. But Trent gave me a lot of room, and that ended up being a memorable tour. The whole band was so tight, and the light show, along with the visual effects, was on another level from anything I’ve been a part of.\n\nThe Who, Endless Wire (2006) and touring after John Entwistle’s death\n\nPino Palladino: In 2002, I was working on Common’s Electric Circus album and I was about to fly home to London from Philadelphia, when my wife called me at the hotel and said, “You just got a call from the Who’s management” She gave me the tragic news that John Entwistle had just died, and they wanted to know if I could step in so they could continue the tour. There was going to be a concert at the Hollywood Bowl a few days later. After speaking to their management, I flew to LA later that day to rehearse for the gig and the following tour.\n\nI had spent some time with John. He was smart, funny, charismatic. He was a superstar. And, of course, an idol as far as bass-playing goes. I had worked with Pete [Townshend] as well, and Roger [Daltrey]. When I flew into LA, Pete was waiting for me at the hotel with a stack of CDs. “Just learn what you can,” he told me. Stylistically, I was not in that space at all at the time – I was doing hip-hop, funk, soul. So it was a complete reset for me. The first thing I did was change the strings on my bass to get a brighter sound, like John had. I pretty much didn’t sleep that night, and learned as much as I could. I think I pulled it off, because they kept me on!\n\nI just worked on their recent record [2019’s WHO]. Endless Wire was the first studio record they made after John’s tragic death, and that was less of a “band” experience. Pete had done a number of demos, obviously some with John in mind to a certain degree. I’d ask Pete if I was doing all right, and he would turn to me and say, “Play more.” He didn’t elaborate, just “play more.” And I understood. Some people would think of it as overplaying, but the classic sound of The Who is Keith Moon on drums and John Entwistle on bass just making this unholy racket. So that’s what I aimed for.\n\n\n\nWatch this video on YouTube Click to load video\n\nHarry Styles, “Watermelon Sugar” (2020)\n\nPino Palladino: I was rehearsing with John Mayer at Henson Studios in Hollywood, which was the former A&M Studios, and before that the Charlie Chaplin Studios. Beautiful history there. Harry was recording in the same studios, down the hall. John knew him and introduced me to Harry. Harry and his producers played me a few songs to see which ones I felt I could add to, including “Watermelon Sugar.” If you listen to the bass line in that song, it’s very well-defined and echoed by the guitar line. There wasn’t really a lot of room to move. Well, I started getting a little free with it, trying stuff, and Harry jumped up and said, “That! Can you do more of that?” It’s an honor that I get invited to play on these songs. It’s going to be a hit with or without me. So I feel very fortunate to be asked to contribute.\n\nPino Palladino and Blake Mills, Notes With Attachments (2021)\n\nPino Palladino: This record is a culmination of what I’ve been thinking about through much of my career. I’ve been recording many of these ideas over a long period of time as I’ve toured and collaborated with many musicians and artists that I admire. What interested me in making my own album was having the chance to focus on compositional elements, rather than the bass taking the lead. Maybe some listeners have been surprised that there are woodwinds and other instruments in the foreground. It’s not me showing particular prowess on my instrument, but to define the role of the bass as a signature part of a song is the challenge I enjoy. I’ve always loved instrumental music, from jazz to film soundtracks. I want my music to invoke some of those qualities.\n\nSome of the ideas on the album evolved from my time touring with D’Angelo and the Soultronics, that kind of beat-driven music, but with beautiful elements and touches, but also from many other types of music that I love. When I played some of these ideas originally for Blake, he was very encouraging and, as we started working on the songs, it quite naturally became a collaboration. Blake, along with all the incredible musicians on the record, have all given so generously to the project, I’m very fortunate to have had the opportunity to make this album. It’s a very interesting process for me, having my own music released. It feels like part of my DNA is suddenly out there. The album was recorded two years ago. But people have told me that it speaks to the moment, that they’re listening to it through this complex time and enjoying it. That’s really nice to hear.\n\nListen to Pino Palladino and Blake Mills’ Notes with Attachments here."}, {"url": "https://www.allmusic.com/artist/pino-palladino-mn0000292499/credits", "page_content": "Credits Pino Palladino Follow Artist +\n\nSince the 1980s, this session and live bassist is among the most prolific, gifted, and sought after by musicians of all genres.\n\nRead Full Biography"}, {"url": "https://www.last.fm/music/Pino+Palladino/+wiki", "page_content": "Pino Palladino (17 October 1957 in Cardiff, Wales, UK) is a Welsh bass guitarist of Italian ancestry. Palladino rose to public notice playing primarily rock and roll, blues rock, and rhythm and blues music, although he has been lauded for his ability to play most genres of popular music, including jazz, neo soul, and funk. Adding to his eclectic grasp and melodic approach on his instrument, he has become one of the most sought-after session players on the bass in the music industry. He has played on a large number of recordings by some of the world's most successful entertainers, in part, by mastering a variety of techniques on both his late 1970s fretless Music Man StingRay bass guitar and later in his career, adding fretted Fender Precision and Jaguar basses. His playing has earned him custom instruments bearing his name.\n\nPalladino has joined several bands and ensembles through which he is most visible. He joined jazz trumpeter Roy Hargrove in forming The RH Factor, a band that mixes elements of soul, jazz, and R&B. He is a member of the John Mayer Trio, and was the first choice by Pete Townshend and Roger Daltrey to fill the position left by John Entwistle as the current bassist for The Who.\n\nBiography\n\nPalladino began playing the electric guitar at age 14. By age 17 he decided to play the bass guitar, and bought his first fretless bass one year later, playing mostly R&B, funk, and reggae within a rock and roll backbeat. His first professional gig was at a local television station in Cardiff, where he began playing in 1978. That same year, at age 20, he joined Jools Holland's band and recorded with Holland on his album entitled, Jools Holland and His Millionaires. Palladino toured with Jools to support the album, which gave him the opportunity to purchase his own Music Man StingRay Fretless Bass. Holland was touring with another new band; the Q-Tips, whose frontman, Paul Young made acquaintance with Palladino whilst they were on tour, who would, a year later offer Pino a place in his own backing band.\n\nPino Palladino was featured on Gary Numan's 1982 album I, Assassin, in which his fretless bass sound made a prominent contribution to the overall sound of the album. He went on to play fretless bass with a healthy number of high-profile artists that include (on the short list), David Gilmour, Tears for Fears, Pete Townshend, Peter Gabriel, Joan Armatrading, Phil Collins, Chaka Khan and Don Henley.\n\nAfter vocalist Paul Young landed his own solo contract, Palladino was brought in as part of his backing band \"The Royal Family\" in 1983 with noticeable chart success with the No Parlez album, and major hit singles both in the UK and Europe. Examples of Young's new found success were the band's cover of the Marvin Gaye classic \"Wherever I Lay My Hat (That's My Home)\", which reached No. 1 in the UK singles chart for three weeks in the summer of 1983, and \"Love of the Common People\". Palladino toured extensively at this time with Paul Young, remaining in the band for five years. 1983 additionally proved to be the year of another ensemble featuring Palladino, Paul Rodgers (formerly of Bad Company, drummer Kenney Jones, along with a rotating cast of other celebrity performers. The band only released one album through Atlantic; The Law, although there were enough out-takes that another bootleg-styled album followed in 1991. Sales were unremarkable, despite the names of those who recorded on the album.\n\nThroughout the 1980s Palladino was noted for his R&B roots on the fretless bass, even when supporting pop and rock heavy performers. One reviewer from Bass Player magazine points to Paul Young’s cover of the Bobby Womack/Rufus tune \"Stop On By\" (on 1990’s Other Voices), with its \"pre-hip-hop, swung funk groove\" as the precursor to Palladino's later neo-soul focus.\n\n1990s\n\nChanges in instrument\n\nIn the 1990s, Palladino began to alternate between the sounds achieved in playing the fretless bass to one with frets, as well as the 4-string and 6-string bass. At the time, he was well known within the industry for his fretless bass sound. However, now, depending on which artist he was supporting, and the song to be played, he began gravitating towards fretted bass. He was maturing as a musician, and played with artists as diverse as Melissa Etheridge, Richard Wright, Sir Elton John and Eric Clapton. Also in 1991 he joined Paul Rodgers (of Free, Queen+ Paul Rodgers, and Bad Company fame) to form the band The Law. In the mid 1990's, Palladino played bass for The London Metropolitan orchestra during their recording of \"An American Symphony\", soundtrack for the movie Mr Hollands Opus.\n\nPalladino supported Phil Collins, as a member of the house band for the Golden Jubilee of Elizabeth II, which played with Sir Paul McCartney, Eric Clapton, Cliff Richard, and Tony Bennett, among other notable performers. He later wrote that he felt privileged to have been amongst the others on stage in such an event.\n\nIn 1999, he began working with Richard Ashcroft, of The Verve, during the recording sessions of Ashcroft's debut solo album, Alone With Everybody. Richard proved to be mightily impressed by Pino's natural bass playing ability;\n\nThis Pino Palladino, I can say a Meters record and he can play me the bass line. He can play anything. He's one of the only people in the world who can totally replicate that kind of Beach Boys/scratch/Walker Brothers bass. You can get that sound if you want it, dead on. So it was very liberating working with him.\n\nPino also joined Ashcroft's touring band for the singer's first major solo outing throughout 2000.\n\nNeo Soul\n\nBy the mid- 1990s, Palladino had established himself as a busy, highly desirable bassist and a studio worker in many genres, but finally became visible to those artists who played largely left of center, and demand for his session playing grew within a different quarter. Palladino began moving from blues-rock toward neo soul projects. Palladino and Steve Jordan found themselves performing on the same session for B.B. King’s 1997 duets CD Deuces Wild. It was the first time soul singer D'Angelo first heard Palladino, who had just switched from a signature sound fretless bass sound to that of performing with fretted basses. The result was an invitation to \"use Pino’s big, behind-the-beat bass to help cast a neo-soul spell on his Grammy Award-winning Voodoo album\". It would not be his first uncredited Grammy performance.\n\nAs the word spread throughout the genre, Palladino found an increasing demand within the neo-soul genre. Examples of his bass work in this genre (in addition to D'Angelo) includes Mama's Gun, and \"Penitentiary Philosophy\" found on Erykah Badu’s 2000 CD. Other albums using Pino's sound include 1st Born Second for Bilal, Like Water for Chocolate and Electric Circus for Common. Palladino has been described by Steve Jordan, who got his own professional start playing the drums for Stevie Wonder as having a \"deep funk\" side and a \"melodic\" side. Palladino admits, that \"Of all my influences, I would say what’s always in the back of my mind is early Stevie Wonder, like Talking Book and Innervisions; that music is really in my blood.\"\n\n2000s\n\nFollowing the death of The Who's bassist John Entwistle in 2002, the eve before the band were to kick off their first world tour in years, Palladino was their first choice to become the band's full-time touring bass guitarist, and by 2006, he was invited to join the remaining original band members in recording their first album in twenty-four years. Pete Townshend, the band's composer, recorded the bassline on the majority of the songs to get the effect he himself wanted, with Palladino doing so on the other six of them. Released in October 2006, the album was named Endless Wire.\n\nPalladino also recently played with The Who at the Super Bowl XLIV half-time show, in February, 2010, alongside other backing artists: Simon Townsend on guitar, Zak Starkey, drums and percussion, and John \"Rabbit\" Bundrick, on keyboard instruments.\n\nPaul Simon\n\nIn 2003, Palladino intended to go down to see his old friend Paul Simon and meet Brian Eno for the first time. He was asked to record with them, and had to borrow a bass guitar to play. The result was that he played with Simon and Garfunkel on their \"Old Friends\" reunion tour and in an interview with Bass Player Magazine he mentions drummer Steve Gadd and percussionist Jamey Haddad \"had laid down some great grooves for me to add bass\". He had kept the recordings, and by the time that he appeared on the Old Friends: Live on Stage CD and DVD from the tour, he was able to use some of the material. He played on Paul Simon's 2006 release, Surprise.\n\nOther appearances\n\nPalladino has toured in the backing band for Joe Walsh. In 2004 he appeared to be playing with Gary Moore at the Wembley Arena.\n\nEmergence of the John Mayer Trio\n\nPalladino met Steve Jordan in the mid-1980s while both were working as session players on many occasions, which blossomed into a friendship. When their work brought them to the same place, they would meet, usually jam together, and introduce other musicians to one another, forming friendships which sometimes blossomed into good working relationships. Jordan has remained keen about Pino since he met him, and only grows more enthusiastic about his talents, which he describes partly as his love for, and ability to \"feel\" changes in music, through melodies, basslines, and an amazing connection with genres of nearly every kind. According to Jordan, he'd planned to meet up with John Mayer and Willie Weeks in January, 2005 to perform a benefit concert on a NBC sponsored telethon Tsunami Aid: A Concert of Hope to raise funds and public awareness benefiting victims in the aftermath of the tsunami that struck southeast Asia. Weeks was unable to make the performance, and Jordan suggested Palladino, who had heard some of Mayer's work, and was willing to come. Beginning a set that included the Jimi Hendrix classic, \"Bold as Love\", the three all agreed that they experienced such chemistry that they began talking right away about arranging their schedules to record a CD and a tour. The trio released the album Try!, on November 22, 2005. The eleven-track live album includes cover songs, such as Jimi Hendrix's \"Wait Until Tomorrow\" and \"I Got A Woman\" by Ray Charles, two songs from Mayer's release Heavier Things, as well as new songs written by Mayer. In addition, Mayer, Palladino, and Jordan wrote three songs on the album: \"Good Love Is On The Way\", \"Vultures\", and \"Try!\". Along with John Mayer on guitar and vocals, and Steve Jordan on drums, Palladino has toured and recorded as a member of the John Mayer Trio, and on Mayer's third album Continuum.\n\nRecent tours\n\nIn spring of 2006, Palladino toured with Jeff Beck. He also played with J. J. Cale, and Eric Clapton on their 2006 album The Road to Escondido, alongside other notable musicians, including Derek Trucks, and Billy Preston. It was to be Preston's last work before he died only days afterward.\n\nInfluences on bass guitar\n\nInfluences for Palladino for bass guitar include Motown bassist James Jamerson; Stevie Wonder’s keyboard-bass, jazz innovator Jaco Pastorius; British folk/rock upright bassist Danny Thompson; Norman Watt-Roy (of Ian Dury & the Blockheads); Larry Graham; Michael Henderson; Bootsy Collins; Paul Jackson; Anthony Jackson; Doug Rauch (of Carly Simon and Santana), and Billy Cobham.\n\nTechnique\n\nPino Palladino is noted for his use of the fretless bass in many 1980s chart records. While it was typical for a bass guitar in a commercial track to have a rather generic sound and stay \"playing the low notes\" Palladino preferred a different sound (combining fretless tone with an octave effect) and basslines that frequently added chords, lead lines and counter melodies in the higher range of the instrument as opposed to simply the aforementioned \"low notes\". Typical of this style was his playing on Paul Young's biggest chart hits, in particular his bass solo on \"Wherever I Lay My Hat (That's My Home)\". His equipment at that time included a fretless Music Man StingRay Bass 1979 and Boss Octave pedal (OC-2).\n\nPino Palladino signature model\n\nThe Fender Pino Palladino Signature Precision Bass is modeled after two of Pino's Fender Precision Basses. The body featuring faded fiesta red paint over desert sand paint is based on Pino's 1961 Precision Bass while the neck shape and round-lam rosewood fret board are based on Pino's 1963 sunburst Precision Bass.\n\nRecent projects\n\nPalladino joined Eric Clapton's touring band for 11 dates in the Eastern U.S. and Canada in May 2008. Current work has included work on an with Clapton and Robbie Robertson, and Palladino guested on bass for Amos Lee on his third album, Last Days at the Lodge.\n\nIn 2009, Palladino joined with keyboardist Philippe Saisse and Simon Phillips to form an instrumental trio: Phillips Saisse Palladino, an instrumental jazz/funk rock ensemble, which have toured Europe through 2009 into 2010, playing songs that spotlight the talents of each performer, in the manner of many jazz outfits."}, {"url": "https://www.allaboutjazz.com/musicians/pino-palladino", "page_content": "Pino Palladino was featured on Gary Numan's 1982 album I, Assassin, in which his fretless bass sound made a prominent contribution to the overall sound of the album. He went on to play fretless bass with a healthy number of high-profile artists that include (on the short list), David Gilmour, Tears for Fears, Pete Townshend, Peter Gabriel, Joan Armatrading, Phil Collins, Chaka Khan and Don Henley.\n\nPalladino began playing the electric guitar at age 14. By age 17 he decided to play the bass guitar, and bought his first fretless bass one year later, playing mostly R&B, funk, and reggae within a rock and roll backbeat. His first professional gig was at a local television station in Cardiff, where he began playing in 1978. That same year, at age 20, he joined Jools Holland's band and recorded with Holland on his album entitled, Jools Holland and His Millionaires. Palladino toured with Jools to support the album, which gave him the opportunity to purchase his own Music Man StingRay Fretless Bass. Holland was touring with another new band; the Q-Tips, whose frontman, Paul Young made acquaintance with Palladino whilst they were on tour, who would, a year later offer Pino a place in his own backing band.\n\nPalladino has joined several bands and ensembles through which he is most visible. He joined jazz trumpeter Roy Hargrove in forming The RH Factor, a band that mixes elements of soul, jazz, and R&B. He is a member of the John Mayer Trio, and was the first choice by Pete Townshend and Roger Daltrey to fill the position left by John Entwistle as the current bassist for The Who.\n\nPino Palladino (17 October 1957 in Cardiff, Wales, UK) is a Welsh bass guitarist of Italian ancestry. Palladino rose to public notice playing primarily rock and roll, blues rock, and rhythm and blues music, although he has been lauded for his ability to play most genres of popular music, including jazz, neo soul, and funk. Adding to his eclectic grasp and melodic approach on his instrument, he has become one of the most sought-after session players on the bass in the music industry. He has played on a large number of recordings by some of the world's most successful entertainers, in part, by mastering a variety of techniques on both his late 1970s fretless Music Man StingRay bass guitar and later in his career, adding fretted Fender Precision and Jaguar basses. His playing has earned him custom instruments bearing his name.\n\nAfter vocalist Paul Young landed his own solo contract, Palladino was brought in as part of his backing band \"The Royal Family\" in 1983 with noticeable chart success with the No Parlez album, and major hit singles both in the UK and Europe. Examples of Young's new found success were the band's cover of the Marvin Gaye classic \"Wherever I Lay My Hat (That's My Home)\", which reached No. 1 in the UK singles chart for three weeks in the summer of 1983, and \"Love of the Common People\". Palladino toured extensively at this time with Paul Young, remaining in the band for five years. 1983 additionally proved to be the year of another ensemble featuring Palladino, Paul Rodgers (formerly of Bad Company, drummer Kenney Jones, along with a rotating cast of other celebrity performers. The band only released one album through Atlantic; The Law, although there were enough out-takes that another bootleg-styled album followed in 1991. Sales were unremarkable, despite the names of those who recorded on the album.\n\nThroughout the 1980s Palladino was noted for his R&B roots on the fretless bass, even when supporting pop and rock heavy performers. One reviewer from Bass Player magazine points to Paul Young’s cover of the Bobby Womack/Rufus tune \"Stop On By\" (on 1990’s Other Voices), with its \"pre-hip-hop, swung funk groove\" as the precursor to Palladino's later neo-soul focus.\n\n1990s Changes in instrument\n\nIn the 1990s, Palladino began to alternate between the sounds achieved in playing the fretless bass to one with frets, as well as the 4-string and 6-string bass. At the time, he was well known within the industry for his fretless bass sound. However, now, depending on which artist he was supporting, and the song to be played, he began gravitating towards fretted bass. He was maturing as a musician, and played with artists as diverse as Melissa Etheridge, Richard Wright, Sir Elton John and Eric Clapton. Also in 1991 he joined Paul Rodgers (of Free, Queen+ Paul Rodgers, and Bad Company fame) to form the band The Law. In the mid 1990's, Palladino played bass for The London Metropolitan orchestra during their recording of \"An American Symphony\", soundtrack for the movie Mr Hollands Opus.\n\nPalladino supported Phil Collins, as a member of the house band for the Golden Jubilee of Elizabeth II, which played with Sir Paul McCartney, Eric Clapton, Cliff Richard, and Tony Bennett, among other notable performers. He later wrote that he felt privileged to have been amongst the others on stage in such an event.\n\nIn 1999, he began working with Richard Ashcroft, of The Verve, during the recording sessions of Ashcroft's debut solo album, Alone With Everybody. Richard proved to be mightily impressed by Pino's natural bass playing ability;\n\nThis Pino Palladino, I can say a Meters record and he can play me the bass line. He can play anything. He's one of the only people in the world who can totally replicate that kind of Beach Boys/scratch/Walker Brothers bass. You can get that sound if you want it, dead on. So it was very liberating working with him.\n\nPino also joined Ashcroft's touring band for the singer's first major solo outing throughout 2000.\n\nNeo Soul\n\nBy the mid- 1990s, Palladino had established himself as a busy, highly desirable bassist and a studio worker in many genres, but finally became visible to those artists who played largely left of center, and demand for his session playing grew within a different quarter. Palladino began moving from blues-rock toward neo soul projects. Palladino and Steve Jordan found themselves performing on the same session for B.B. King’s 1997 duets CD Deuces Wild. It was the first time soul singer D'Angelo first heard Palladino, who had just switched from a signature sound fretless bass sound to that of performing with fretted basses. The result was an invitation to \"use Pino’s big, behind-the-beat bass to help cast a neo-soul spell on his Grammy Award-winning Voodoo album\". It would not be his first uncredited Grammy performance.\n\nAs the word spread throughout the genre, Palladino found an increasing demand within the neo-soul genre. Examples of his bass work in this genre (in addition to D'Angelo) includes Mama's Gun, and \"Penitentiary Philosophy\" found on Erykah Badu’s 2000 CD. Other albums using Pino's sound include 1st Born Second for Bilal, Like Water for Chocolate and Electric Circus for Common. Palladino has been described by Steve Jordan, who got his own professional start playing the drums for Stevie Wonder as having a \"deep funk\" side and a \"melodic\" side. Palladino admits, that \"Of all my influences, I would say what’s always in the back of my mind is early Stevie Wonder, like Talking Book and Innervisions; that music is really in my blood.\"\n\n2000s\n\nFollowing the death of The Who's bassist John Entwistle in 2002, the eve before the band were to kick off their first world tour in years, Palladino was their first choice to become the band's full-time touring bass guitarist, and by 2006, he was invited to join the remaining original band members in recording their first album in twenty-four years. Pete Townshend, the band's composer, recorded the bassline on the majority of the songs to get the effect he himself wanted, with Palladino doing so on the other six of them. Released in October 2006, the album was named Endless Wire.\n\nPalladino also recently played with The Who at the Super Bowl XLIV half-time show, in February, 2010, alongside other backing artists: Simon Townsend on guitar, Zak Starkey, drums and percussion, and John \"Rabbit\" Bundrick, on keyboard instruments.\n\nPaul Simon\n\nIn 2003, Palladino intended to go down to see his old friend Paul Simon and meet Brian Eno for the first time. He was asked to record with them, and had to borrow a bass guitar to play. The result was that he played with Simon and Garfunkel on their \"Old Friends\" reunion tour and in an interview with Bass Player Magazine he mentions drummer Steve Gadd and percussionist Jamey Haddad \"had laid down some great grooves for me to add bass\". He had kept the recordings, and by the time that he appeared on the Old Friends: Live on Stage CD and DVD from the tour, he was able to use some of the material. He played on Paul Simon's 2006 release, Surprise.\n\nOther appearances\n\nPalladino has toured in the backing band for Joe Walsh. In 2004 he appeared to be playing with Gary Moore at the Wembley Arena.\n\nEmergence of the John Mayer Trio\n\nPalladino met Steve Jordan in the mid-1980s while both were working as session players on many occasions, which blossomed into a friendship. When their work brought them to the same place, they would meet, usually jam together, and introduce other musicians to one another, forming friendships which sometimes blossomed into good working relationships. Jordan has remained keen about Pino since he met him, and only grows more enthusiastic about his talents, which he describes partly as his love for, and ability to \"feel\" changes in music, through melodies, basslines, and an amazing connection with genres of nearly every kind. According to Jordan, he'd planned to meet up with John Mayer and Willie Weeks in January, 2005 to perform a benefit concert on a NBC sponsored telethon Tsunami Aid: A Concert of Hope to raise funds and public awareness benefiting victims in the aftermath of the tsunami that struck southeast Asia. Weeks was unable to make the performance, and Jordan suggested Palladino, who had heard some of Mayer's work, and was willing to come. Beginning a set that included the Jimi Hendrix classic, \"Bold as Love\", the three all agreed that they experienced such chemistry that they began talking right away about arranging their schedules to record a CD and a tour. The trio released the album Try!, on November 22, 2005. The eleven-track live album includes cover songs, such as Jimi Hendrix's \"Wait Until Tomorrow\" and \"I Got A Woman\" by Ray Charles, two songs from Mayer's release Heavier Things, as well as new songs written by Mayer. In addition, Mayer, Palladino, and Jordan wrote three songs on the album: \"Good Love Is On The Way\", \"Vultures\", and \"Try!\". Along with John Mayer on guitar and vocals, and Steve Jordan on drums, Palladino has toured and recorded as a member of the John Mayer Trio, and on Mayer's third album Continuum.\n\nRecent tours\n\nIn spring of 2006, Palladino toured with Jeff Beck. He also played with J. J. Cale, and Eric Clapton on their 2006 album The Road to Escondido, alongside other notable musicians, including Derek Trucks, and Billy Preston. It was to be Preston's last work before he died only days afterward.\n\nInfluences on bass guitar\n\nInfluences for Palladino for bass guitar include Motown bassist James Jamerson; Stevie Wonder’s keyboard-bass, jazz innovator Jaco Pastorius; British folk/rock upright bassist Danny Thompson; Norman Watt-Roy (of Ian Dury & the Blockheads); Larry Graham; Michael Henderson; Bootsy Collins; Paul Jackson; Anthony Jackson; Doug Rauch (of Carly Simon and Santana), and Billy Cobham.\n\nTechnique\n\nPino Palladino is noted for his use of the fretless bass in many 1980s chart records. While it was typical for a bass guitar in a commercial track to have a rather generic sound and stay \"playing the low notes\" Palladino preferred a different sound (combining fretless tone with an octave effect) and basslines that frequently added chords, lead lines and counter melodies in the higher range of the instrument as opposed to simply the aforementioned \"low notes\". Typical of this style was his playing on Paul Young's biggest chart hits, in particular his bass solo on \"Wherever I Lay My Hat (That's My Home)\". His equipment at that time included a fretless Music Man StingRay Bass 1979 and Boss Octave pedal (OC-2).\n\nPino Palladino signature model\n\nThe Fender Pino Palladino Signature Precision Bass is modeled after two of Pino's Fender Precision Basses. The body featuring faded fiesta red paint over desert sand paint is based on Pino's 1961 Precision Bass while the neck shape and round-lam rosewood fret board are based on Pino's 1963 sunburst Precision Bass.\n\nRecent projects\n\nPalladino joined Eric Clapton's touring band for 11 dates in the Eastern U.S. and Canada in May 2008. Current work has included work on an with Clapton and Robbie Robertson, and Palladino guested on bass for Amos Lee on his third album, Last Days at the Lodge.\n\nIn 2009, Palladino joined with keyboardist Philippe Saisse and Simon Phillips to form an instrumental trio: Phillips Saisse Palladino, an instrumental jazz/funk rock ensemble, which have toured Europe through 2009 into 2010, playing songs that spotlight the talents of each performer, in the manner of many jazz outfits. Show less"}, {"url": "https://www.celebsagewiki.com/pino-palladino", "page_content": "Age, Biography and Wiki\n\nPino Palladino was born on 17 October, 1957 in Cardiff, United Kingdom, is a Welsh bassist and record producer from Cardiff. Discover Pino Palladino's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 65 years old?\n\nPopular As N/A Occupation N/A Age 65 years old Zodiac Sign Libra Born 17 October 1957 Birthday 17 October Birthplace Cardiff, United Kingdom Nationality United Kingdom\n\nWe recommend you to check the complete list of Famous People born on 17 October. He is a member of famous Producer with the age 65 years old group.\n\nPino Palladino Height, Weight & Measurements\n\nAt 65 years old, Pino Palladino height is 6′ 8″ .\n\nPhysical Status Height 6′ 8″ Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is Pino Palladino's Wife?\n\nHis wife is Marilyn Roberts (m. 1992)\n\nFamily Parents Not Available Wife Marilyn Roberts (m. 1992) Sibling Not Available Children Not Available\n\nPino Palladino Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Pino Palladino worth at the age of 65 years old? Pino Palladino’s income source is mostly from being a successful Producer. He is from United Kingdom. We have estimated Pino Palladino's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Producer\n\nPino Palladino Social Network\n\nTimeline"}, {"url": "https://www.radioswisspop.ch/en/music-database/musician/113328f03f18e37f9ea1690603e52e56c3109", "page_content": "Giuseppe Henry \"Pino\" Palladino[1] (born 17 October 1957) is a Welsh bassist. A prolific session musician, he is probably best known for playing with The Who (following the death of founding member John Entwistle[2]) from 2002 to 2016, D'angelo from 1996 to present, and the John Mayer Trio from 2005 to present.\n\nPalladino plays a late-1970s, fretless, Music Man StingRay bass guitar, a fretted Fender Precision, and a Jaguar bass. His playing has earned him custom instruments bearing his name.[3]\n\nEarly life\n\nBorn in Cardiff to an Italian father from Campobasso and a Welsh mother,[4] Palladino began playing electric guitar at age 14 and bass guitar at 17. He bought his first fretless bass one year later, playing mostly R&B, funk, and reggae with a rock and roll backbeat.[5]\n\nCareer\n\nPalladino was drawn to Motown and jazz at an early age. He attended Catholic school and took classical guitar lessons. He liked Led Zeppelin and Yes and started a rock band.[6]\n\nIn 1982, Palladino recorded with Gary Numan on the album I, Assassin. The producer of the album asked him to contribute to Paul Young's debut album. Young's cover version of \"Wherever I Lay My Hat (That's My Home)\" by Marvin Gaye became a hit in Europe,and subsequently joined Young's band the Royal family and Palladino received offers to record with Joan Armatrading, Go West, and David Gilmour. He cites as early influences James Jamerson, Danny Thompson, and Norman Watt-Roy and also admires Jaco Pastorius, Stanley Clarke, Bootsy Collins, Larry Graham, Michael Henderson, Anthony Jackson, Marcus Miller, and Rocco Prestia.[7]\n\nIn 1983, he joined The Law with Paul Rodgers, formerly of Bad Company, and drummer Kenney Jones, who succeeded Keith Moon in The Who after Moon died, and recorded the album The Law.\n\nIn the 1990s, Palladino alternated between fretless bass and fretted and 4-string and 6-string bass. He played with Melissa Etheridge, Richard Wright, Elton John, and Eric Clapton.\n\nHe played on Mike Lindup's first solo album, Changes with Dominic Miller on guitar and Manu Katché on drums.[8]\n\nIn 1999, he began working with Richard Ashcroft of The Verve on Ashcroft's debut solo album, Alone With Everybody.[9]\n\nThe Who's bassist John Entwistle died the night before the start of their first tour in two years. Palladino became the band's bass guitarist on tour. In 2006, he joined the remaining band members on their first album in twenty-four years, Endless Wire. He played with The Who at the Super Bowl XLIV half-time show in 2010 with Simon Townshend on guitar, Zak Starkey on drums, and John \"Rabbit\" Bundrick on keyboards. In 2012, he toured with The Who on their Quadrophenia revival.\n\nPalladino met Steve Jordan in the mid-1980s while both were working as session musicians, which blossomed into a friendship. Jordan credits Palladino's apparent ability to \"feel\" changes in music, through melodies, basslines, and an embrace of genres of nearly every kind. According to Jordan, he had planned to meet up with John Mayer and Willie Weeks in January 2005 to perform Tsunami Aid: A Concert of Hope for victims of the tsunami that struck southeast Asia. Weeks was unable to make the performance, and Jordan suggested Palladino, who had heard some of Mayer's work and was willing to come. Beginning a set that included the Jimi Hendrix song \"Bold as Love\", the three found a chemistry together. They recorded an album and toured as a trio.[10]\n\nThey released the album Try!, on 22 November 2005. The eleven-track live album includes cover versions of \"Wait Until Tomorrow\" by Jimi Hendrix and \"I Got A Woman\" by Ray Charles, two songs from Mayer's album Heavier Things, and new songs by Mayer. In addition, Mayer, Palladino, and Jordan are credited as songwriters on three songs: \"Good Love Is on the Way\", \"Vultures\", and \"Try!\".[3] Palladino appeared on Mayer's third album Continuum, fourth album Battle Studies and seventh album The Search for Everything.\n\nIn March and April 2006, Palladino toured with Jeff Beck and played with J. J. Cale, and Eric Clapton on their 2006 album The Road to Escondido. In 2009, he formed a trio with keyboardist Philippe Saisse and Simon Phillips.\n\nHe played with Simon and Garfunkel on their Old Friends reunion tour.[10]\n\nIn January 2011, he entered the studio with D'Angelo to finish recording Black Messiah.[11]\n\nIn 2013 he played on the Nine Inch Nails album Hesitation Marks and was a member of the touring band.\n\nTechnique\n\nPalladino is noted for his use of the fretless bass on many 1980s albums. While it was typical for a bass guitar in a commercial track to have a rather generic sound and stay \"playing the low notes\", Palladino preferred a different sound, combining fretless tone with an octaver effect, and basslines that frequently added chords, lead lines, and counter melodies in the higher range of the instrument. Typical of this style was his playing on Paul Young's Wherever I Lay My Hat. His equipment at that time included a fretless Music Man StingRay Bass 1979 and Boss Octave pedal (OC-2).\n\nSignature model\n\nThe Fender Pino Palladino Signature Precision Bass is modelled after two of Palladino's Fender Precision Basses. The body features faded fiesta red paint over desert sand paint, based on Palladino's 1961 Precision Bass, while the neck shape and round-lam rosewood fretboard are based on his 1963 sunburst Precision Bass.[12]\n\nPersonal life\n\nPino married Marilyn (Maz) Roberts, a former backing singer with the Fabulous Wealthy Tarts, in 1992 in Wales. They have three children: Fabiana, Giancarla and Rocco, who are all involved in the music industry.[13]\n\nSelect discography\n\nWith Paul Young\n\n1983 No Parlez (Columbia)\n\n(Columbia) 1985 The Secret of Association (Columbia)\n\n(Columbia) 1990 Other Voices (Columbia)\n\nWith David Knopfler\n\n1983 Release (Peach Tree)\n\n(Peach Tree) 1985 Behind the Lines (Paris)\n\n(Paris) 1987 Cut the Wire (Paris)\n\nWith Don Henley\n\n1984 Building the Perfect Beast (Geffen)\n\n(Geffen) 1989 The End of the Innocence (Geffen)\n\nWith Go West\n\n1985 Go West (Chrysalis)\n\n(Chrysalis) 1987 Dancing on the Couch (Chrysalis)\n\nWith Elton John\n\n1985 Ice on Fire (Rocket/Geffen)\n\n(Rocket/Geffen) 1992 The One (Rocket/MCA)\n\nWith John Mayer\n\n2005 Try!\n\n2006 Continuum\n\n2017 The Search for Everything\n\nWith Jeff Beck\n\n1999 Who Else! (Epic)\n\n(Epic) 2006 Official Bootleg USA '06\n\n2010 Emotion & Commotion\n\nWith D'Angelo\n\n2000 Voodoo (Virgin)\n\n(Virgin) 2014 Black Messiah (RCA)\n\nWith The Gaddabouts\n\n2011 The Gaddabouts\n\n2012 Look Out Now!\n\nWith The Who\n\n2006 Endless Wire (Polydor)\n\n(Polydor) 2014 Quadrophenia Live in London (Universal)\n\n(Universal) 2015 Live in Hyde Park (Eagle Rock / Universal)\n\n(Eagle Rock / Universal) 2017 Live at the Isle of Wight 2004 Festival (Eagle Rock / Universal)\n\nWith others\n\nReferences"}, {"url": "http://rockandrollgarage.com/the-firm-the-supergroup-that-had-paul-rodgers-and-jimmy-page/", "page_content": "The legendary guitarist Jimmy Page, famous for his work with Led Zeppelin and the amazing singer Paul Rodgers, famous for his work with Free and Bad Company got together in the 80s to form the supergroup The Firm.\n\nAdvertisement\n\nThe British supergroup was formed in 1984, featuring Paul Rodgers as the singer, Jimmy Page on guitar, Chris Slade on drums (that after would be AC/DC’s drummer) and bassist Tony Franklin that played on Manfred Mann’s Earth Band, Uriah Heep and AC/DC.\n\nRead what Paul Rodgers said about the band:\n\n“Jimmy was at a bit of a loose end,” recalled Rodgers of the band’s formation. He’d come round and check out my home studio and we ended up writing songs, but without any definite plans. Jimmy was very keen to get on the road, so we put a band together… The first thing I knew was that he had to be writing songs again. I’d already seen one of my friends going down that road in Koss, and it wasn’t going to happen again.”\n\nHear their greatest hit:\n\nIn the early 1980s, Page and Rodgers were both dealing with the demise of their respective bands, Led Zeppelin and Bad Company. “Jimmy was at a bit of a loose end,” recalled Rodgers of the band’s formation. “He’d come round and check out my home studio and we ended up writing songs, but without any definite plans. Jimmy was very keen to get on the road, so we put a band together… The first thing I knew was that he had to be writing songs again. I’d already seen one of my friends going down that road in Koss, and it wasn’t going to happen again.” They initially wanted to form a band with Yes drummer Bill Bruford and bass player Pino Palladino but both were under contract with other acts.\n\nPage and Rodgers refused to play material by their former bands and instead opted for a selection of Firm songs plus tracks from their solo albums; however, at least one performance of “Midnight Moonlight” featured sections of “White Summer” and “Kashmir”, originally recorded by Page’s former bands The Yardbirds and Led Zeppelin, respectively. The new songs were heavily infused with a soulful and commercially accessible sound, courtesy of Franklin’s fretless bass guitar underpinning an understated song structure. Despite refusing to play old material, the last track from The Firm, “Midnight Moonlight”, was originally an unreleased Led Zeppelin song entitled “Swan Song”. This caused some critics to claim that Page had begun to run out of ideas. On the other hand, both albums and especially tours were met with largely positive and enthusiastic responses by fans of both lead members’ previous bands.\n\nIn subsequent interviews, Page and Rodgers both indicated that the band was never meant to last more than two albums. After the band split, Page and Rodgers returned to solo work while Chris Slade joined AC/DC in 1989 and Franklin teamed up with guitarist John Sykes and drummer Carmine Appice in Blue Murder.\n\nSee more News"}], "Pino Palladino was a member of The Winery Dogs.": [{"url": "https://www.theguardian.com/music/2021/apr/06/pino-palladino-pop-greatest-bassist-adele-elton-the-who", "page_content": "By his own admission, Pino Palladino is not a man much accustomed to giving interviews. “Very reticent,” he nods during a Zoom call, his accent speaking noticeably louder of his childhood in Cardiff than his current home in LA. “You know, there was a time when I was featured in all sorts of musicians’ magazines, and then I just thought to myself, ‘Move over, there’s people out there that actually need the publicity.’ Not to blow smoke up my own arse,” he adds hurriedly, “but really I just didn’t want to see or hear from myself.”\n\nIt’s a remark in keeping with the astonishing career of one of the most celebrated bass players in the world. It’s hard not to blanche when you consider the sheer number of records that have been sold featuring his work. He played on not one but two of the biggest selling albums of the 21st century: Adele’s 21 and Ed Sheeran’s Divide, as well as with Rod Stewart, Elton John, Bryan Ferry, Simon and Garfunkel and Keith Richards. They’re the biggest names in a startlingly diverse back catalogue of collaborations: Palladino’s playing is the thread that links Perfume Genius with Phil Collins, Harry Styles with Chris de Burgh, and Nine Inch Nails with De La Soul. Indeed, his versatility and omnipresence is a running joke within the music industry. When another fabled bass player, Pink Floyd’s Guy Pratt, got married, he opened his groom’s speech with the words: “I’m only here today because Pino couldn’t make it.”\n\nFor a musician who seems to have turned up everywhere over the last 40 years, Palladino has remained a remarkably anonymous figure outside of musicians’ circles. Indeed, he somehow contrived to spend 14 years as a member of the Who without really losing what he calls an “invisible stance”. He certainly stands out in photographs of the Soulquarians, the experimental collective assembled by D’Angelo for his legendary album Voodoo, the solitary lanky Welshman among a crowd of African-American musicians including Questlove and the late J Dilla – but you would still struggle to recognise him in the street.\n\nCardiff’s finest … Palladino in 1985. Photograph: Paul Natkin/Getty Images\n\nThis is presumably how Palladino likes it. He’s drily funny and self-deprecating – he says his default setting when working with a new artist is “do not fucking spoil it” – but doesn’t seem terribly frustrated by life in the background. Which makes it all the more surprising that he’s releasing an album on which he shares billing with Blake Mills: Notes With Attachments, a fascinating, head-turning collection of experimental instrumentals that sits somewhere between jazz, global music and ambient. He and Mills, who has produced for Fiona Apple and Laura Marling, met while working on a John Legend album. “We hit it off and the next thing you know, he’s saying to me ‘Have you thought about a solo album?’ Well, I’ve thought about it, obviously,” he laughs. “For 40 years I’ve thought about it, but I’ve never really had an idea how I could do it.”\n\nStudded with guest appearances – from avant-garde saxophonist Sam Gendel and jazz drummer Chris Dave, among others – Notes With Attachments foregrounds the sound that made Palladino’s name: the none-more-80s sprrroing of the fretless bass put through a chorus pedal. He first used it while working with Gary Numan, but it was Paul Young’s 1983 hit Wherever I Lay My Hat that introduced it to a mass audience: pushed up in the mix, the bass effectively became a lead instrument. It was so striking that Palladino suddenly found himself playing with everyone from Go West and Don Henley to Tears for Fears: he turned up on Top of the Pops with alarming regularity, the musical equivalent of a hip item of designer clothing. “There was a lot of it around in those days,” he says of the sound. “I was so lucky – it resonated with people, captured their imagination and it took on a life of its own. It did get to the point where I was getting booked for sessions and feeling like a performing monkey: ‘Yeah, bring your fretless, make that funny sound and maybe we’ll get a hit out of it.’”\n\nHe also found himself becoming the sideman of choice for the rock aristocracy. “The first call I got like that was from David Gilmour. I could not believe it: am I going to the studio with this guy and pretend I actually belong there? I was nervous as fuck, but the drummer on the session was Jeff Porcaro [famed for playing with Toto and on Michael Jackson’s Thriller album], and he was really sweet: ‘Come on, man, chill out, have a smoke on this.’ So I did, and that seemed to work for me. I just had to keep that attitude through all of that period: phone calls from Elton John and Phil Collins – you have to keep that headspace that you belong, even if you think you’re going to be found out any minute.”\n\n‘You’ll have to play louder!’ … performing with the Who at the 2016 Desert Trip festival in California. Photograph: Kevin Mazur/Getty Images\n\nHe says another phone call, this time from D’Angelo – who had heard his playing on a BB King album – changed his life. “My roots are in Motown, reggae, R&B. I didn’t get much of an opportunity to express that side of music and then I met the don – how lucky was that? D’Angelo – I’d mention him in the same breath as Stevie Wonder and Donny Hathaway and Sly Stone. When I was in the studio with D and Questlove, James Poyser, all those guys, I don’t even have to think about what I’m playing. It’s incredible, to be a Welsh guy, having no real connections to these guys other than music that we loved and played. From a personal satisfaction point of view, it was as good as it ever got, probably will get.\n\n“It took people 10 years, 20, to really get the first album we made, Voodoo, but I absolutely knew it was unique and really special – I was probably more aware of it than the rest of them, because I’d been working for a long time. I knew this kind of thing didn’t come around very often.”\n\nThe Soulquarians went on to record with Erykah Badu, Mos Def and Talib Kweli; the influence of their loose approach can be heard on Kendrick Lamar’s epochal 2015 album To Pimp a Butterfly. They had just wrapped up a session with Common when Palladino learned that the Who’s bassist, John Entwistle, had died – and that the band had declined to cancel their forthcoming tour and wanted Palladino to replace him … on stage at the Hollywood Bowl, in two days.\n\n“I flew to LA, thinking, what are you doing? You don’t even know many Who songs. Pete Townshend was waiting for me at the hotel, with a big stack of CDs. ‘You don’t know much of the catalogue? Fair enough. You’re going to know it tonight, then, aren’t you?’ At the first rehearsal, Pete comes over and says: ‘You’re going to have to play louder’ – because I’m used to being the sympathetic musician, who fills in, doesn’t make a racket. That’s the one instruction you keep getting when you work with the Who: ‘Fucking turn it up, we can’t hear you!’”\n\nPalladino says he’s “not exactly crazy about touring any more” – he stopped playing live with the Who in 2016 – but is considering doing some gigs around Notes With Attachments, pandemic permitting. Until then, there are still sessions to attend to in LA, with Covid tests in the car park for anyone taking part. “Film and music studios are considered essential to the economy here – you’ve got to love that, right?” he laughs. “Mind you,” he says, “that’s better than Britain telling you if you’re a musician or an artist you might have to look for a new job.”"}, {"url": "https://www.udiscovermusic.com/stories/pino-palladino-interview/", "page_content": "Photo: Cedric Ribeiro/Getty Images\n\n“All musicians are the same, we all think we’re rubbish,” Pino Palladino told a British television interviewer in 2013, adding a gentle laugh. It was a typically massive understatement from the quietly affable Welsh bassist, among the highest-regarded session players in the music industry. In this case, Palladino was referring to hearing Paul Young’s “Wherever I Lay My Hat” on the radio for the first time in 1983 – particularly his casual contribution, one of the most recognizable bass lines of the 1980s. “I was worried that it sounded a bit out of tune,” he said.\n\nIn a decades-long career, Palladino has not only provided low-end support for several musical revolutions, he’s helped stoke a few of them himself, undergirding pioneering sounds in pop, New Wave, neo-soul, electronic, rock, jazz, funk, and even industrial with an ever-inventive foundation. He’s widely regarded as one of the most influential bass players ever, with just as much name recognition in certain quarters as the superstars he’s backed.\n\nBeginning with Gary Numan in 1982 and continuing through work with artists like Young, Phil Collins, Tears for Fears, Go West, and Chris de Burgh, Palladino helped define the coolly emotive 80s sound with his trademark fretless technique. In the 1990s he backed Elton John, Eric Clapton, Carly Simon, Bryan Ferry, Joan Armatrading, B.B. King, and many more, before joining the legendary Soulquarians artists collective, reviving cosmic soul and funk sounds with Erykah Badu, D’Angelo, Questlove, and J. Dilla.\n\nADVERTISEMENT\n\nFrom there, it was on to stints with Mika, Nine Inch Nails, Adele, Kelly Clarkson, Paul Simon, and Keith Urban, among a wealth of others, as he also embarked on longtime touring associations with Jeff Beck and John Mayer. Palladino’s most famous stretch came with The Who, when he stepped in after John Entwistle’s untimely death in 2002 to tour and record for two decades, playing probably the most famous bass solo in pop – 1965’s “My Generation” – for arena-sized crowds. Most recently, he’s played for Harry Styles, Ed Sheeran, Corinne Bailey Rae, and John Legend. You can’t talk about Pino Palladino without mentioning a few names.\n\nNow, at last, Pino Palladino is releasing an album of his own, collaborating with guitarist Blake Mills. Called Notes with Attachments, the record summons intimate, cinematic moods, bristling with sophisticated patterns, atmospheric woodwinds, and surprising electronic touches. It’s a compendium of several decades’ worth of Palladino’s compositional ideas, complex, and contemporary yet warm with nostalgia – paying homage to the classic film soundtracks, cool jazz, and Burt Bacharach arrangements he loves.\n\nIn honor of the new release, we accompanied the lauded bassist on a trip down memory lane, revisiting some of his best-known album and tour appearances.\n\nTear for Fears, Seeds of Love (1989)\n\nPino Palladino: I have a lot of great memories of that album, not least because my daughter Fabiana was born around the time we were recording it. My life was changing in a big way. I had been doing a lot of session work with the French drummer Manu Katché, who toured with Peter Gabriel. We were becoming known as a rhythm section together, and a bit in demand. I believe that’s how Roland Orzabal heard of us and invited us onto the album.\n\nThe actual recording was unusual for the time; the tracks were cut live with a full band. We holed up together for a few weeks in Townhouse Studios in London, and went through each of the songs, experimenting with instrumentation and arrangement. There were some days when we just jammed and extended parts of the songs. Roland then took the whole bundle and edited it down into what you hear on the album. We must have recorded “Badman’s Song” and “Woman in Chains” a dozen different ways with different transitions. Roland’s choices and his taste as the composer, defined the amazing end results.\n\n\n\nWatch this video on YouTube Click to load video\n\nOne of my fondest memories: When I first got there, I was going into the control room and I heard this incredible piano-playing in the studio. I was wondering, “Who is that?” I went round the corner and there was Oleta Adams, sitting at the grand piano and singing so beautifully, jamming away on gospel and blues. I’m honored to have played on her solo album Circle of One.\n\nThe Seeds Of Love can be bought here.\n\nElton John, The One (1992)\n\nPino Palladino: We recorded in Paris at Studio Guillaume Tell. Well, the food in Paris was excellent. We would end every day going out to dinner at high-end restaurants with the table piled up with dishes. It was really something to keep up with…but I rose to the challenge!\n\nWorking on that record and spending time with Elton was humbling. I remember one day, Bernie Taupin faxed some song lyrics over in the morning, and Elton took them into the next room and had an amazing song written within an hour…incredible! At this time I was really known for my fretless bass sound, it was something people specifically hired me for. Elton encouraged me to develop my ideas for the basslines and let me do my thing on the record.\n\n\n\nWatch this video on YouTube Click to load video\n\nErykah Badu, Mama’s Gun (2000)\n\nPino Palladino: This was during the Soulquarians period, it was a real fun time. I made the connection because Ahmir [“Questlove” Thompson] had called me in to add to one of the songs he was working on. We thought I would just overdub the bass on one track, but it felt really good and we built up a vibe. Erykah had booked time at The Lady and we reconvened at a later date.\n\nErykah’s way of working was refreshing. For Mama’s Gun, Erykah had sketched out a couple ideas for the album, and had a vision of what she wanted, but otherwise it was pretty undetermined at that point. We all assembled, the whole band, and Erykah just came around, so cool in her way, and asked “OK, Pino, what you got?” That was it. “What you got?” We played around with some different ideas, and it turned into a collaboration, developing the songs together. I played a bassline I had in my mind for a while, and that became the first song on the album, “Penitentiary Philosophy.”\n\nOddly enough, it reminded me of when I was getting started, working with Gary Numan on the I, Assassin album in 1983. Back then, I showed up and Gary had recorded his songs but didn’t have bass parts on them. He wanted me to come up with ideas and gave me complete freedom to compose the parts for the songs. I played my fretless bass and that sound became the sonic signature for the record. What made it different with Erykah, is that this time I got a songwriting and production credit.\n\nListen to Mama’s Gun here.\n\nD’Angelo, Voodoo (2000)\n\nPino Palladino: Being a part of that moment when this album and Mama’s Gun came out almost back to back was thrilling. After meeting D on a session with B.B. King, he invited me to meet him and his engineer, Russ Elevado, at Electric Lady Studios with a view to me playing some bass on the songs for his upcoming record, Voodoo.\n\nWhen they played some of the songs for me, I was mesmerized by the unique feel of the grooves and D’s otherworldly vocal arrangements. D’Angelo had written the songs for Voodoo at the keyboard and while his left hand would play what would become the blueprints for the basslines, his right hand plays the chords and flourishes that accompany the main melody. It all fits together in such a unique way… The basslines are woven into the fabric of the composition from the start.\n\n\n\nWatch this video on YouTube Click to load video\n\nAlthough some songs were established when I got there, others were left more open to develop ideas and for me, some freedom of expression, from adding in passing notes to flurries up to the top of the bass neck to complement his vocals. Because the album is so bass- and rhythm-driven, everything mattered, it was all at the top of the mix, he encouraged me to bring my thing to the music and, through him, I met Erykah, Quest, James Poyser, Roy Hargrove, J Dilla, Common, and all the Soulquarian collective.\n\nListen to Voodoo here.\n\nAdele, 21 (2011)\n\nPino Palladino: I was back in London when [producer] Rick Rubin reached out to me about recording a new album for Adele. She had already made a name for herself in the UK before she broke worldwide, so I had heard of her. Rick told me, “I want to get you into this fantastic band, with drummer Chris Dave, Matt Sweeney and Smokey Hormel on guitars, James Poyser on piano, and really give her the strong backing she deserves.” I flew out to Shangri-La studios in California where they were recording, and she just killed it on the vocals from the start. I remember hearing her voice for the first time through my headphones and being blown away by how she could sing. The songs were really great and I knew we were recording something special.\n\nMika, The Origin of Love (2012)\n\nPino Palladino: Mika has certainly got some incredible energy, he would bounce around the studio with all these ideas. Mika brought a lot of curiosity to the process, he would come up with things while I was playing. He was interested to hear fretless bass on some of the songs and liked how it fitted in. I believe I was hooked up with him through Nick Littlemore from Empire of the Sun. Working on a more electronic-oriented pop album was interesting. It’s great to get the opportunity to expand what you do, and try out different directions.\n\n\n\nWatch this video on YouTube Click to load video\n\nNine Inch Nails, Hesitation Marks (2013)\n\nPino Palladino: Trent [Reznor] reached out to me, out of the blue, and asked if I would be interested in collaborating on a couple of tracks for the album. I was really curious how I would fit in with his sound. Trent is a very good communicator, with clear ideas. He is a fan of Voodoo and of Gary Numan, so for me that was interesting as I could maybe bring two different sides of my playing to the music. I played a couple of takes on each song and just did my thing. Later, Trent’s manager called and asked if I would be interested in touring. It turned out that the band had already been rehearsing for a month. It was a real challenge to learn the songs in a short amount of time before we went on the road. And I had no idea how his fans would react to me. But Trent gave me a lot of room, and that ended up being a memorable tour. The whole band was so tight, and the light show, along with the visual effects, was on another level from anything I’ve been a part of.\n\nThe Who, Endless Wire (2006) and touring after John Entwistle’s death\n\nPino Palladino: In 2002, I was working on Common’s Electric Circus album and I was about to fly home to London from Philadelphia, when my wife called me at the hotel and said, “You just got a call from the Who’s management” She gave me the tragic news that John Entwistle had just died, and they wanted to know if I could step in so they could continue the tour. There was going to be a concert at the Hollywood Bowl a few days later. After speaking to their management, I flew to LA later that day to rehearse for the gig and the following tour.\n\nI had spent some time with John. He was smart, funny, charismatic. He was a superstar. And, of course, an idol as far as bass-playing goes. I had worked with Pete [Townshend] as well, and Roger [Daltrey]. When I flew into LA, Pete was waiting for me at the hotel with a stack of CDs. “Just learn what you can,” he told me. Stylistically, I was not in that space at all at the time – I was doing hip-hop, funk, soul. So it was a complete reset for me. The first thing I did was change the strings on my bass to get a brighter sound, like John had. I pretty much didn’t sleep that night, and learned as much as I could. I think I pulled it off, because they kept me on!\n\nI just worked on their recent record [2019’s WHO]. Endless Wire was the first studio record they made after John’s tragic death, and that was less of a “band” experience. Pete had done a number of demos, obviously some with John in mind to a certain degree. I’d ask Pete if I was doing all right, and he would turn to me and say, “Play more.” He didn’t elaborate, just “play more.” And I understood. Some people would think of it as overplaying, but the classic sound of The Who is Keith Moon on drums and John Entwistle on bass just making this unholy racket. So that’s what I aimed for.\n\n\n\nWatch this video on YouTube Click to load video\n\nHarry Styles, “Watermelon Sugar” (2020)\n\nPino Palladino: I was rehearsing with John Mayer at Henson Studios in Hollywood, which was the former A&M Studios, and before that the Charlie Chaplin Studios. Beautiful history there. Harry was recording in the same studios, down the hall. John knew him and introduced me to Harry. Harry and his producers played me a few songs to see which ones I felt I could add to, including “Watermelon Sugar.” If you listen to the bass line in that song, it’s very well-defined and echoed by the guitar line. There wasn’t really a lot of room to move. Well, I started getting a little free with it, trying stuff, and Harry jumped up and said, “That! Can you do more of that?” It’s an honor that I get invited to play on these songs. It’s going to be a hit with or without me. So I feel very fortunate to be asked to contribute.\n\nPino Palladino and Blake Mills, Notes With Attachments (2021)\n\nPino Palladino: This record is a culmination of what I’ve been thinking about through much of my career. I’ve been recording many of these ideas over a long period of time as I’ve toured and collaborated with many musicians and artists that I admire. What interested me in making my own album was having the chance to focus on compositional elements, rather than the bass taking the lead. Maybe some listeners have been surprised that there are woodwinds and other instruments in the foreground. It’s not me showing particular prowess on my instrument, but to define the role of the bass as a signature part of a song is the challenge I enjoy. I’ve always loved instrumental music, from jazz to film soundtracks. I want my music to invoke some of those qualities.\n\nSome of the ideas on the album evolved from my time touring with D’Angelo and the Soultronics, that kind of beat-driven music, but with beautiful elements and touches, but also from many other types of music that I love. When I played some of these ideas originally for Blake, he was very encouraging and, as we started working on the songs, it quite naturally became a collaboration. Blake, along with all the incredible musicians on the record, have all given so generously to the project, I’m very fortunate to have had the opportunity to make this album. It’s a very interesting process for me, having my own music released. It feels like part of my DNA is suddenly out there. The album was recorded two years ago. But people have told me that it speaks to the moment, that they’re listening to it through this complex time and enjoying it. That’s really nice to hear.\n\nListen to Pino Palladino and Blake Mills’ Notes with Attachments here."}, {"url": "https://pitchfork.com/reviews/albums/pino-palladino-blake-mills-notes-with-attachments/", "page_content": "Contradictory as it sounds, Pino Palladino is possibly the most famous working session bassist. The 63-year-old Welshman is known for his glissando tone and melodic fills, and he has built a four-decade career as the ultimate supporting player: providing a Stravinsky-inspired fretless performance on Paul Young’s 1983 U.K. number No. 1 Marvin Gaye cover “Wherever I Lay My Head,” contributing to neo-soul landmarks Mama’s Gun and Voodoo, joining The Who after the death of original bassist John Entwhistle in 2002, and much more.\n\nNotes With Attachments is the first album released under Palladino’s own name, co-headlining with producer and instrumentalist Blake Mills. The 34-year-old Mills has a similar history as a supporting player, producing for artists like Perfume Genius and Alabama Shakes and facilitating Fiona Apple’s playing on Bob Dylan’s 2020 album Rough and Rowdy Ways. After first collaborating on John Legend’s 2016 album Darkness and Light, the pair developed songs from Palladino’s archive of musical sketches, recording with a small group of players at famed Los Angeles studio Sound City in a series of sessions spanning two and a half years.\n\nNotes With Attachments is an elusive instrumental album, subtle despite the pun in its title. The songs are based around repeating chord changes inspired by funk, West African, and Cuban music, but the continuously shifting arrangements mean that no one instrument carries the melody for long. It’s the sound of consummate collaborators imagining a world where there’s no such thing as a lead performer.\n\nOn “Ekuté,” Palladino’s bass and guitar lines bounce off each other in a syncopated rhythm. As fuzzy, distorted yawns of guitar give way to squealing saxophone and bass clarinet, the players match intensities so that they sound almost like the same instrument at different ends of its range. The song started out as a Fela Kuti-inspired one-chord jam. “We were trying to figure out all the different places that one beat or bassline could take you,” Mills said in a statement.\n\nMany songs here seem as if they were already in the air, just waiting to be captured in final form: “Man From Molise” began as a Palladino composition inspired by Brazilian musician Hermeto Pascoal and recorded with a New York ensemble. Mills played it at half-speed, and from there the duo created an entirely new song—though a sluggish feeling lingers, exacerbated by the lopsided 7/8 time signature. “Soundwalk” was written around a horn arrangement extracted from a fully mixed demo that Palladino and saxophonist Jacques Schwartz-Bart recorded while snowed in at a Chicago hotel during D’Angelo’s 2000 Voodoo tour; its lurching rhythm is reminiscent of another D’Angelo collaborator, J Dilla. The percussion drops in and out while the saxophones drag the music ahead, as if the players were exchanging glances, unsure whether to keep playing but carrying on anyway."}, {"url": "https://www.allmusic.com/artist/pino-palladino-mn0000292499/biography", "page_content": "Biography Pino Palladino Follow Artist +\n\nSince the 1980s, this session and live bassist is among the most prolific, gifted, and sought after by musicians of all genres.\n\nRead Full Biography"}, {"url": "https://www.everything2.com/title/Pino+Palladino", "page_content": "After the sudden death of John Entwistle on June 27, 2002 , Pino Palladino was named bassist for The Who . With the band on the verge of starting a tour, Palladino was intercepted in Philadelphia , on his way back to the U.K., to fill in for The Ox. He got only two days of rehearsals before the tour's first show, at the Hollywood Bowl , but by all accounts it went off without a hitch.\n\nSpecializing in fretless bass guitar, Palladino has woven a long and fruitful session career since 1982, building the kind of experience you'd need to play with The Who on two day's notice. Like Tony Levin, he's one of those people whose name might be all over your record collection, whether you know it or not. I first came across him on a Tony Banks CD and on David Bowie's mediocre Black Tie White Noise. It turns out he was Paul Young's regular bassist and toured with Squeeze for a time. Other artists who've employed Pino include Joan Armatrading, Eric Clapton, Melissa Etheridge, Don Henley, Kirsty MacColl, Michael McDonald and Celine Dion.\n\nA consummate studio man, Palladino has played with the heady likes of John McLaughlin and Ryuchi Sakamoto but has also appeared on albums by Rick Springfield and Jennifer Love Hewitt. He's also quite acquainted with The Who. Palladino was part of Pete Townshend's live band in 1993 and appeared on Townshend's White City album, as well as on Roger Daltrey's Celebration: The Music of The Who.\n\nPalladino has not done any solo albums. But he did release an album with The Tweeters, a trio he founded with Manu Katché (percussion) and Dominic Miller (guitar).\n\nPalladino was born in Cardiff, Wales, in 1957, and began playing guitar at 14, switching to bass at 17. After moving to London in 1980, he joined the Jools Holland Band (Jools being the on-again, off-again keyboardist for Squeeze) and eventually hooked up with Paul Young, with whom he first recorded in 1983. Around the same time, Palladino started his sessions career, appearing on Gary Numan's I, Assassin.\n\nThe stint with The Who is Palladino's first serious tour in years, as his studio work takes up most of his time. Reportedly, he basically hid in the shadows during the first concert, drawing attention only for his solo during \"My Generation.\" Townshend's tour diary says Palladino was instructed not to copy Entwistle; Pete writes: \"The one request I made was that - at first - he play as loud as he can bear!\"\n\nStereotypical for a bassist, Palladino isn't much of a publicity hound, and his anonymity to the general public isn't likely to change after this tour (c.f. John \"Rabbit\" Bundrick). There is an http://www.pinopalladino.com, but it's run by a fan."}, {"url": "https://www.idolbirthdays.net/pino-palladino", "page_content": "Does Pino Palladino Dead or Alive?\n\nAs per our current Database, Pino Palladino is still alive (as per Wikipedia, Last update: May 10, 2020).\n\n🎂 Pino Palladino - Age, Bio, Faces and Birthday\n\nCurrently, Pino Palladino is 65 years, 7 months and 23 days old. Pino Palladino will celebrate 66rd birthday on a Tuesday 17th of October 2023. Below we countdown to Pino Palladino upcoming birthday.\n\nDays Hours Minutes Seconds\n\nPopular As Pino Palladino Occupation Bassist Age 65 years old Zodiac Sign Libra Born October 17, 1957 (Wales) Birthday October 17 Town/City Wales Nationality Wales\n\n🌙 Zodiac\n\nPino Palladino’s zodiac sign is Libra. According to astrologers, People born under the sign of Libra are peaceful, fair, and they hate being alone. Partnership is very important for them, as their mirror and someone giving them the ability to be the mirror themselves. These individuals are fascinated by balance and symmetry, they are in a constant chase for justice and equality, realizing through life that the only thing that should be truly important to themselves in their own inner core of personality. This is someone ready to do nearly anything to avoid conflict, keeping the peace whenever possible\n\n🌙 Chinese Zodiac Signs\n\nPino Palladino was born in the Year of the Rooster. Those born under the Chinese Zodiac sign of the Rooster are practical, resourceful, observant, analytical, straightforward, trusting, honest, perfectionists, neat and conservative. Compatible with Ox or Snake.\n\nSome Pino Palladino images\n\nAbout\n\nJohn Entwistle's replacement in the rock band The Who, as well as a member of the John Mayer Trio.\n\nBefore Fame\n\nHe had his first professional gig at the age of twenty for a local television show and joined Jools Holland's band.\n\nTrivia\n\nHis fretless bass playing is featured on I, Assassin by Gary Numan, an album that helped him get more gigs playing with big names.\n\nFamily Life\n\nHe and his wife Maz raised three children.\n\nAssociated With\n\nHe toured with Jeff Beck in 2006.\n\nPino Palladino trend"}, {"url": "https://www.guitarworld.com/features/pino-palladinos-best-bass-lines", "page_content": "Quite possibly the world's most famous working session bassist, Pino Palladino has built a career as the ultimate supporting player: providing a Stravinsky-inspired fretless performance on Paul Young’s ‘Wherever I Lay My Hat,’ contributing to D’Angelo’s landmark album Voodoo, replacing the late John Entwistle in The Who, touring with the John Mayer Trio, and much more.\n\n\n\nPino has come to encapsulate everything that a sideman should be. “The sideman role just came out of me playing on records that people heard and liked,” says Pino. “It's not something I planned or even dreamt of.”\n\nJoin us, then, on Pino’s 65th birthday, as we list the songs that prove he is a true bass genius.\n\n(Image credit: Photo by Chris McKay/WireImage)\n\nWherever I Lay My Hat - Paul Young (1983)\n\nNo one did more to promote expressive bass playing back in the '80s than Pino Palladino. His big break came as a member of Paul Young’s band, culminating in a truly amazing piece of fretless bass accompaniment to one of Young’s biggest hits, his 1983 cover of Marvin Gaye’s ‘Wherever I Lay My Hat.’ In this clip Pino breaks down his soaring fretless line.\n\nChicken Grease - D'Angelo (2000)\n\nPerhaps it was John Mayer who said it best when, in 2017, he attributed one of his favorite bass lines to 'Chicken Grease.' Having met D’Angelo in 1997 while recording for BB King’s Deuces Wild, Pino went on to provide many of the flatwound-swinging bass lines on his 2000 landmark album, Voodoo.\n\n\n\nHere he is performing 'Chicken Grease' live on the Chris Rock show. The harmony is open to interpretation, but Pino felt a B7 as the overall tonality.\n\nMy Generation - The Who (2007)\n\nPino’s next call came following the untimely death of John Entwistle, who had died just as the Who was launching its 2002 tour. Pete Townshend later said on his website that he had made only one request of Pino; \"that he fucking turns up his amp and plays as loud as he can!\"\n\n\n\nIn this next video Pino plays probably the most famous bass solo in rock – ‘My Generation’ – on Later… With Jools Holland.\n\nWho Did You Think I Was - John Mayer Trio (2008)\n\nRecorded live at the Nokia Theatre in LA, together with John Mayer and drummer Steve Jordan, Pino’s performance on 'Who Did You Think I Was' is stratospheric. The main riff is based around an A7 pentatonic shape that Pino anchors on the 5th fret of the E string. Keep your ears open at the 02:40 mark as the trio kick into ‘Power of Soul’ by Jimi Hendrix.\n\nSanctified - Nine Inch Nails (2013)\n\nPino’s next stretch came with Nine Inch Nails following Trent Reznor’s invitation to collaborate on the band’s 2013 Hesitation Marks. Pino wasn't the only special guest to appear in the studio: who'd have imagined Lindsay Buckingham of Fleetwood Mac to crop up on a Nine Inch Nails album, let alone the king of the fretless bass? This next clip sees Pino add his slick fretless lines to Reznor’s 1989 track ‘Sanctified.’\n\nBlake Mills - Notes With Attachments\n\nIn 2021 Pino released the first solo album of his career, collaborating with guitarist Blake Mills on an archive of musical ideas. Recorded at Sound City in a series of studio sessions that spanned two and a half years, the album pays homage to his love of classic film soundtracks, cool jazz and Burt Bacharach arrangements.\n\n\n\nWatch Pino Palladino and Blake Mills, along with percussionist Abe Rounds and saxophonist Sam Gendel, perform three tracks from the album on NPR Music’s Tiny Desk (Home) Concert.\n\nNotes With Attachments is available now on CD, vinyl and as a digital download (iTunes and Amazon MP3)"}, {"url": "https://www.soundopinions.org/show/811", "page_content": "Pino Palladino is a legendary bassist who’s played with everyone from The Who to Nine Inch Nails to D’Angelo. Hosts Jim DeRogatis and Greg Kot talk with Pino about his storied career, playing style and about the first album where he’s taking center stage, Notes With Attachments. Plus, the hosts review some new music from Japanese Breakfast and Wolf Alice.\n\nThe hosts share their opinions on Jubilee, the third album by Japanese Breakfast. Michelle Zauner is the driving force behind Japanese Breakfast, as well as the author of the best-selling memoir “Crying In H Mart.”\n\nJim and Greg interview session bassist Pino Palladino about his legendary career performing and recording with artists as diverse as The Who, D’Angelo, Nine Inch Nails and Margo Price. He also talks about growing up in Wales and the influence reggae music had on him early in life. They also discuss his new album Notes With Attachments with Blake Mills.\n\nDear Listeners,\n\nFor more than 15 years, Sound Opinions was a production of WBEZ, Chicago's public radio station. Now that the show is independent, we're inviting you to join the band and lend a hand! We need your support more than ever because now we have to do all the behind-the-scenes work that WBEZ handled before (like buying insurance and paying for podcast hosting, ugh). Plus, we have some exciting ideas we'd like to try now that there's no one to tell us no!\n\nPlease consider becoming a Sound Opinions member by giving whatever you can via Patreon or with a one-time donation through PayPal. Thanks for listening, and thanks for your support!"}, {"url": "http://dictionary.sensagent.com/Pino_Palladino/en-en/", "page_content": "Pino Palladino (born 17 October 1957) is a Welsh bass guitarist who gained fame playing primarily rock and roll, blues rock, and rhythm and blues music, although he has been lauded for his ability to play most genres of popular music, including jazz, neo soul, and funk. His career has spanned several ensembles, including the John Mayer Trio and The RH Factor, a band mixing elements of soul, jazz and R&B, which he formed with jazz trumpeter Roy Hargrove. He was also Pete Townshend's and Roger Daltrey's first choice to fill the position left by John Entwistle as the bassist for The Who. Adding to an eclectic grasp and melodic approach on his instrument, he has become one of the most sought-after session players on the bass and has played on a large number of recordings by some of the world's most successful entertainers, in part, by mastering a variety of techniques on both his late 1970s fretless Music Man StingRay bass guitar and, later in his career, adding fretted Fender Precision and Jaguar basses. His playing has earned him custom instruments bearing his name.[1]\n\nCareer\n\nBorn in Cardiff to a family with Italian ancestry, Pino Palladino began playing the electric guitar at age 14. By 17 he decided to play the bass guitar, and bought his first fretless bass one year later, playing mostly R&B, funk, and reggae within a rock and roll backbeat.[2] His first professional gig, at age 20, was at a local television station in Cardiff, where he began playing in 1978. That same year he joined Jools Holland's band and is credited on Holland's album, Jools Holland and His Millionaires. Touring with Holland to support the album gave him the opportunity to purchase his own Music Man StingRay Fretless Bass.[2] While Holland was touring with another new band, the Q-Tips, its frontman, Paul Young became acquainted with Palladino and a year later offered him a place in Young's own backing band.\n\nPalladino was featured on Gary Numan's 1982 album I, Assassin, in which his fretless bass playing made a prominent contribution to the overall sound of the album. He went on to play fretless bass with a healthy number of high-profile artists that include David Gilmour, Tears for Fears, Pete Townshend, Peter Gabriel, Joan Armatrading, Phil Collins, Chaka Khan and Don Henley.[2][3]\n\nAfter Paul Young landed his own solo contract in 1982, Palladino was brought in as part of his backing band \"The Royal Family\" resulting in noticeable chart success with the No Parlez album,[2] and major hit singles both in the UK and Europe. Examples of Young's newfound success were the band's cover of the Marvin Gaye classic Wherever I Lay My Hat (That's My Home), which reached No. 1 in the UK singles chart for three weeks in summer of 1983, and Love of the Common People. Palladino toured extensively at this time with Paul Young, remaining in the band for five years. 1983 additionally proved to be the year of another ensemble featuring Palladino, Paul Rodgers (formerly of Bad Company), drummer Kenney Jones, along with a rotating cast of other celebrity performers. The band only released one album through Atlantic, The Law, although there were enough out-takes that another bootleg-styled album followed in 1991. Sales were unremarkable, despite the names of those who recorded on the album.[1]\n\nThroughout the 1980s Palladino was noted for his R&B roots on the fretless bass, even when supporting pop and rock heavy performers. One reviewer from Bass Player magazine points to Paul Young’s cover of the Bobby Womack/ Rufus tune Stop On By (on 1990’s Other Voices), with its \"pre-hip-hop, swung funk groove\" as the precursor to Palladino's later neo-soul focus.[4]\n\n1990s\n\nChanges in instrument\n\nIn the 1990s, Palladino began to alternate between the sounds achieved in playing the fretless bass to one with frets, as well as the 4-string and 6-string bass. At the time, he was well known within the industry for his fretless bass sound. However, now, depending on which artist he was supporting, and the song to be played, he began gravitating towards fretted bass. He was maturing as a musician, and played with artists as diverse as Melissa Etheridge, Richard Wright, Sir Elton John and Eric Clapton. Also in 1991 he joined Paul Rodgers (of Free, Queen+ Paul Rodgers, and Bad Company fame) to form the band The Law. In the mid-1990s, Palladino played bass for The London Metropolitan orchestra during their recording of An American Symphony, soundtrack for the movie Mr Holland's Opus.\n\nFrom 1991 to 1996, he joined Manu Katché to form Stephan Eicher's rhythm section on three albums : Engelberg (1991), Carcassonne (1993) and 1000 vies (1996).\n\nPalladino supported Phil Collins, as a member of the house band for the Golden Jubilee of Elizabeth II, which played with Sir Paul McCartney, Eric Clapton, Cliff Richard, and Tony Bennett, among other notable performers. He later wrote that he felt privileged to have been amongst the others on stage in such an event.\n\nIn 1999, he began working with Richard Ashcroft, of The Verve, during the recording sessions of Ashcroft's debut solo album, Alone With Everybody.[5] Richard proved to be mightily impressed by Pino's natural bass playing ability;[6]\n\n“ This Pino Palladino, I can say a Meters record and he can play me the bass line. He can play anything. He's one of the only people in the world who can totally replicate that kind of Beach Boys/scratch/Walker Brothers bass. You can get that sound if you want it, dead on. So it was very liberating working with him. ”\n\nPino also joined Ashcroft's touring band for the singer's first major solo outing throughout 2000.[7]\n\nNeo soul\n\nBy the mid- 1990s, Palladino had established himself as a busy, highly desirable bassist and a studio worker in many genres, but finally became visible to those artists who played largely left of center, and demand for his session playing grew within a different quarter. Palladino began moving from blues-rock toward neo soul projects. Palladino and Steve Jordan found themselves performing on the same session for B.B. King’s 1997 duets CD Deuces Wild. It was the first time soul singer D'Angelo first heard Palladino, who had just switched from a signature sound fretless bass sound to that of performing with fretted basses. The result was an invitation to «use Pino’s big, behind-the-beat bass to help cast a neo-soul spell on his Grammy Award-winning Voodoo album».[8] It would not be his first uncredited Grammy performance.\n\nAs the word spread throughout the genre, Palladino found an increasing demand within the neo-soul genre. Examples of his bass work in this genre (in addition to D'Angelo) includes Mama's Gun, and Penitentiary Philosophy found on Erykah Badu’s 2000 CD.[4] Other albums using Pino's sound include 1st Born Second for Bilal, Like Water for Chocolate and Electric Circus for Common. Palladino has been described by Steve Jordan, who got his own professional start playing the drums for Stevie Wonder, as having a \"deep funk\" side and a \"melodic\" side. Palladino admits that «Of all my influences, I would say what’s always in the back of my mind is early Stevie Wonder, like Talking Book and Innervisions; that music is really in my blood.»[9]\n\n2000s\n\nThe Who\n\nFollowing the death of The Who's bassist John Entwistle the night before the band were to kick off their first tour in two years, Palladino was their first choice to become the band's full-time touring bass guitarist, and by 2006, he was invited to join the remaining original band members in recording their first album in twenty-four years. Pete Townshend, the band's composer, recorded the bassline on the majority of the songs to get the effect he himself wanted, with Palladino doing so on the other six of them. Released in October 2006, the album was named Endless Wire.\n\nPalladino also played with The Who at the Super Bowl XLIV half-time show, in February 2010, alongside other backing artists: Simon Townshend on guitar, Zak Starkey, drums and percussion, and John \"Rabbit\" Bundrick, on keyboard instruments.\n\nPaul Simon\n\nIn 2003, Palladino intended to go down to see his old friend Paul Simon and meet Brian Eno for the first time. He was asked to record with them, and had to borrow a bass guitar to play. The result was that he played with Simon and Garfunkel on their Old Friends reunion tour and in an interview with Bass Player Magazine he mentions drummer Steve Gadd and percussionist Jamey Haddad \"had laid down some great grooves for me to add bass\". He had kept the recordings, and by the time that he appeared on the Old Friends: Live on Stage CD and DVD from the tour, he was able to use some of the material.[9] He played on Paul Simon's 2006 release, Surprise.\n\nOther appearances\n\nPalladino has toured in the backing band for Joe Walsh. In 2004 he appeared to be playing with Gary Moore at the Wembley Arena.\n\nEmergence of the John Mayer Trio\n\nPalladino met Steve Jordan in the mid-1980s while both were working as session players on many occasions, which blossomed into a friendship. Jordan credits Palladino's apparent ability to \"feel\" changes in music, through melodies, basslines, and an embrace of genres of nearly every kind. According to Jordan, he'd planned to meet up with John Mayer and Willie Weeks in January, 2005 to perform a benefit concert on a NBC sponsored telethon Tsunami Aid: A Concert of Hope to raise funds and public awareness benefiting victims in the aftermath of the tsunami that struck southeast Asia. Weeks was unable to make the performance, and Jordan suggested Palladino, who had heard some of Mayer's work, and was willing to come. Beginning a set that included the Jimi Hendrix classic, \"Bold as Love\", the three found a chemistry together and set about their schedules to record a CD and a tour as a power trio.[9] They released the album Try!, on 22 November 2005. The eleven-track live album includes cover songs, such as Jimi Hendrix's \"Wait Until Tomorrow\" and \"I Got A Woman\" by Ray Charles, two songs from Mayer's release Heavier Things, as well as new songs written by Mayer. In addition, Mayer, Palladino, and Jordan are credited as songwriters on three songs on the album: \"Good Love Is On The Way\", \"Vultures\", and \"Try!\".[1] Along with John Mayer on guitar and vocals, and Steve Jordan on drums, Palladino rounded out the outfit, touring and recording as the bass guitarist of the John Mayer Trio, and on Mayer's third album Continuum.\n\nInfluences on bass guitar\n\nInfluences for Palladino for bass guitar include The Shadows Jet Harris; Motown bassist James Jamerson; Stevie Wonder’s keyboard-bass, jazz innovator Jaco Pastorius; British folk/rock upright bassist Danny Thompson; Norman Watt-Roy (of Ian Dury & the Blockheads); Larry Graham; Michael Henderson; Bootsy Collins; Paul Jackson; Anthony Jackson; Doug Rauch (of Carly Simon and Santana), and Billy Cobham.[9]\n\nTechnique\n\nPino Palladino is noted for his use of the fretless bass in many 1980s chart records. While it was typical for a bass guitar in a commercial track to have a rather generic sound and stay \"playing the low notes\" Palladino preferred a different sound (combining fretless tone with an octave effect) and basslines that frequently added chords, lead lines and counter melodies in the higher range of the instrument as opposed to simply the afformentioned \"low notes\". Typical of this style was his playing on Paul Young's biggest chart hits, in particular his bass solo on Wherever I Lay My Hat (That's My Home). His equipment at that time included a fretless Music Man StingRay Bass 1979 and Boss Octave pedal (OC-2).\n\nPino Palladino signature model\n\nThe Fender Pino Palladino Signature Precision Bass is modelled after two of Pino's Fender Precision Basses. The body featuring faded fiesta red paint over desert sand paint is based on Pino's 1961 Precision Bass while the neck shape and round-lam rosewood fret board are based on Pino's 1963 sunburst Precision Bass. Pino has also been known to prefer Thomastik-Infled flat-wound bass strings.[10]\n\nAfter 2005\n\nIn spring of 2006, Palladino toured with Jeff Beck. He also played with J. J. Cale, and Eric Clapton on their 2006 album The Road to Escondido, alongside other notable musicians, including Derek Trucks, and Billy Preston. It was to be Preston's last work before he died only days afterward. Palladino joined Eric Clapton's touring band for 11 dates in the Eastern U.S. and Canada in May 2008.\n\nIn 2008 he recorded 3 tracks for London's The Herbaliser for their album \"Same As It Never Was\" released on k7! in 2009\n\nIn 2009, Palladino joined with keyboardist Philippe Saisse and Simon Phillips to form an instrumental trio: Phillips Saisse Palladino, an instrumental progressive jazz /funk rock ensemble, which have toured Europe through 2009 into 2010, playing songs that spotlight the talents of each performer, in the manner of many jazz outfits. Current work has included work on an with Clapton and Robbie Robertson, and Palladino guested on bass for Amos Lee on his third album, Last Days at the Lodge. He appears on Jeff Beck's 2010 album, Emotion & Commotion. As of August 2010 Palladino is touring with Herbie Hancock.\n\nPalladino also appears on Manu Katché's third jazz album, Third Round. Both had already played together several times, particularly on Paul Young's Other Voices, as Stephan Eicher's rhythm section in the first half of the 1990s, and on stage with Manu Katché's jazz band The Tweeters. Currently in the studio recording with Steve Gadd; Edie Brickell; Andy Fairweather Low; who have formed a group the Gaddabouts.\n\nIn January 2011 he entered the studio with D'Angelo to finish recording the long overdue follow up to Voodoo.[11]\n\nIn 2011 Palladino plays on the second album of Adele: 21.\n\nIn May 2011 Palladino plays on the last EP of Revolver (french band), Parallel Lives (french EP).\n\nIn January and February 2012 he joined D'Angelo's live band for a short European tour, alongside drummer Chris 'Daddy' Dave and guitarist Jesse Johnson (musician). The tour included performances at London's Brixton Academy.\n\nDiscography (selected)\n\nReferences"}, {"url": "https://www.redlightmanagement.com/artists/the-winery-dogs/", "page_content": "You know what they say: Familiarity breeds creativity. Just witness the aptly named Hot Streak, the supercharged follow-up to the self-titled rabidly rocking 2013 debut of the three-piece musical dynamo known as The Winery Dogs. Hot Streak shows the powerfully pedigreed trio’s initial burst of collective chemistry was no accident, from the sturm und headbang of “Captain Love” to the propulsive uplifting vibe of “The Bridge” to the introspective acoustic harmonic convergence of “Fire.” If these three Dogs thought they captured lightning in a supper dish the first time around, Hot Streak barks ups the aural ante into exciting new territory.\n\n“We elevated the band to the next level,” says vocalist/guitarist Richie Kotzen. “I wasn’t nervous about it at all. There’s always that worry with a follow-up record when you have a first one that’s so well received, but I believed in it from Day 1. I knew in my heart if we made a record that wasn’t as good as the first one that we wouldn’t release it, but I know I did my best on every song. I also like the fact that there’s a commonality between the first and second records — and there’s also an evolution too, as we’ve dug a little deeper.”\n\nAdds drummer Mike Portnoy, “The mission of this band is to write catchy songs, and not have the musicianship overpower them. That’s the icing on the cake — but the cake itself is always the song and the vocals. Every song on this album is memorable and catchy, and you’ll wake up whistling them all the next day.” For a drummer accustomed to having superstar status in the progressive music realm, Portnoy feels he’s done some of his best work with The Winery Dogs. “It’s been refreshing to play music that’s so easily digestible all across the board by any listener, whether they be a metal fan, a prog fan, or a classic rock fan,” he admits. “I think The Winery Dogs have something to offer for everybody.”\n\nSome of The Winery Dogs’ intrinsic universality has to do with the way each band member understands how to serve the song first and play off each other, rather than showboat their own chops. “It’s the great advantage of this three-piece band,” observes bassist Billy Sheehan. “We always have each other on our radars pretty tightly. I can see when Richie’s going for something or if Mike is going for something, and I can either lay a path down for them and get out of the way, or get behind them and help push them towards it.” Sheehan clearly relishes his role as The Winery Dogs’ anchor. “As a bass player, I’ve always been aggressive in my playing, but my job is to lock in with the drums,” he notes. “If you’re aggressive and you’re all over the place, it’s a mess. So I’ve always tried to use that as my focus point — and the point is to play as an ensemble player, as opposed to an individual. Fortunately, I’ve worked with Richie a lot in the past [in Mr. Big], and I love his playing. Same with Mike. If you’re willing to step back and get out of the way and enjoy what those guys do, it’s a lot of fun being a supportive member of this band.”\n\nKotzen heartily agrees. “These two guys are playing in a way that not many people can play,” he marvels. “I mean, there’s no one else who approaches playing the bass guitar like Billy Sheehan. The thing that’s unique about us is that we are obviously playing real songs with real lyrics and real melodies, but we have these moments of musical chaos where we go crazy and play these things the average musician wouldn’t be able to play.”\n\nOn Hot Streak, The Winery Dogs have found themselves sniffing around outside their comfort zone to expand their musical horizons while staying true to their power-trio roots, as songs like the subtle whirling dervish “Spiral” and the aforementioned “Fire” easily attest. “‘Fire’ is a great example of Richie’s ability to create something that’s very poppy or very mainstream, something that you could hear Sting or Sade doing,” observes Portnoy. “It’s an unusual left-turn for us,” concurs Sheehan. “I’m glad we’re not playing it safe and just doing songs that automatically fit in the category of what we did on the first record. Some of the songs are a little different, and we definitely took chances. But you have to do that — otherwise, you don’t grow.”\n\nThe album’s funky, hard-driving title track is fine evidence of such growth. “That one came from a bass lick I did sitting around and warming up,” reveals Sheehan. “It was something I did for years — my adaptation of a Stanley Clarke move. I did that lick with a little tag on the end of it, and Mike just played along to it. It caught Richie’s ear and he said, ‘Oh, what’s that? What’s that?’ And I said, ‘Check it out,’ showed him what key it was in, and he jumped right in.” Recalls Kotzen, “I remember being in the studio hearing Billy’s riff and thinking, ‘That’s cool.’ So I started riffing over it vocally; I wasn’t even playing guitar on that original jam session. There are so many little spots on it where we could have stepped on each other. But I was able to go in and play key parts that elevated the song’s progress and, at the same time, leave space for Mike’s drums to do the things that made the song even more special.”\n\nAfter playing over 100 shows in support of the first album, The Winery Dogs are eager to head back out on the road to get behind Hot Streak. “We’ve now been all over the world, and you have to put those hours in up on the boards to make things grow and evolve,” Sheehan points out. “All that adds into how well we can read each other’s minds onstage, so when you get back to actually performing as a band, the songs all have a greater depth to them.”\n\nAs far as Portnoy is concerned, the more original material to cull from live, the better. “This time around, I’m looking forward to having two albums and 25 or so of our own songs to choose from,” he says. “We can even keep the set completely, exclusively Winery Dogs material if we want. That’s the sign of a real band. When the first album came out, a lot of people were writing us off as a supergroup or whatever, but we wanted people to understand this wasn’t just a ‘project.’ It’s a legitimate band, and we want to make many albums together in the future.”\n\nSheehan relishes the thought of playing a lot of Hot Streak onstage. “The original material opens up the set list quite a bit,” he notes. “We can pull from both records to make the live shows a little bit less formulaic and predictable, because sometimes we’ll play three or four shows within a 100-mile radius, and we have people coming out to all of those shows.”\n\nKotzen loves having the broader set list option as well. “I always like the idea of not doing the same thing, so I very much like bringing the new songs into the set,” he says. “That keeps the whole thing turning. You don’t want to keep playing all the same songs every time we go on tour. In the beginning, the question was, ‘Is this a real band?’ And I thought to myself, ‘Well, we’re not a mirage! We’re three real people, discovering and making music together.’ So yes, it is a real band. As long as we’re inspired and excited about making music, we’ll keep going.” The more time The Winery Dogs play together onstage, the sharper the band will become. “That’s something that comes with playing together over time within the trio, and also the knowledge you acquire in playing with other people,” Kotzen theorizes. “There was a world of difference from the first time we got onstage versus the last show of the last tour. And there’s still room for more growth to move beyond where we are now.”\n\nPortnoy feels the future of the band looks quite bright. “I may be in 46 different bands right now, but The Winery Dogs are my priority and my home base, and everything else revolves around that,” he confirms. “It’s the same with Billy and Richie. It’s something that all three of our hearts and souls are fully into.”\n\nThat level of commitment ultimately leads The Winery Dogs to reaching higher ground. “The thing that resonates the most with me is that I feel we’ve taken the band to another level,” Kotzen concludes. “The compositions are stronger on this album. I feel more connected lyrically and musically to what I did on this record than on the last one. I feel we’ve stretched the parameters the band operated within on the first record. We’ve widened the musical scope of the band on this record and moved it forward. That’s what I’m most excited about.”"}]}