{"Pino Palladino's signature bass sound is characterized by a deep, warm tone.": [{"url": "https://scottsbasslessons.com/blog/pino-palladino-bass-players-you-should-know#!", "page_content": "Pino lays it down in any style and he’s a master craftsman when it comes to tone. His touch, his sound, his feel, Pino’s got the whole thing going on.\n\nIf you discuss influences with any R&B, pop or jazz electric bassist, I guarantee that the name Pino Palladino will appear 99.9% of the time. During the past four decades, Pino has spread his colossal bass grooves into all corners of contemporary music, in almost every conceivable style and genre. Hailed by many as the British Jaco, his early recordings with Paul Young put expressive fretless bass playing back on the map. He reinvented himself as an R&B wizard in the 90s and evoked the spirit of John Entwistle with The Who in 2002, before easing into his current vintage-vibe with The John Mayer Trio.\n\nBorn in Cardiff, Wales, in 1957, Pino started out on classical guitar aged 14, moving over to electric bass three years later after discovering Motown and Stax Records, along with players like James Jamerson and Jaco Pastorius.\n\n\n\nIn the early 80s he moved to London and landed the bass gig with ex-Squeeze keyboard player, Jools Holland. This was followed by a stint with synth-pop star Gary Numan, before getting his big break as a member of Paul Young’s band. His groundbreaking bass work on the 1983 album No Parlez culminated in a truly mesmerizing piece of fretless playing on Paul Young’s cover of Marvin Gaye’s ‘Wherever I Lay My Hat.’\n\nHere's Pino demonstrating the famous intro to that track.\n\nA steady flow of top session gigs followed working with the likes of Go West, Elton John and David Knofler, peaking with another standout fretless performance on Don Henley’s ‘New York Minute’...\n\nIn an interview with the Guardian, Pino opened up about this part of his career.\n\nIt's about the song, the timing, all sorts of factors, but there are quite a few artists I've worked with where I've contributed more than they would have expected, such as coming up with sub-hooks that make the record better. It certainly worked for me; for a few years people were phoning from all over the world wanting that sound.\n\nAs the 1980s drew to a close the sound of Pino’s fretless MusicMan StingRay had become almost mandatory among studio producers of the day, with Pino often called in purely to overdub his sound over existing fretted bass tracks. One of the world’s premier fretless bassists had well and truly arrived.\n\n\n\nNow it's easy to think that Pino is simply what we could refer to as a \"groover\". A bass player that is happiest in the background simply holding down the lowend and making the band, well, groove. And while that may be somewhat true, unknown to some, Pino has formidable chops and facility on the bass and can certainly solo with the best of them.\n\n\n\nJust check out Pino's blazing solo fretless lines on his 5 string Musicman Stingray with Manu Katche on drums and Dominic Miller on guitar.\n\nAnd here you can hear that soloing is not something he only saves for his 5 string, as he weaves his way around his trusty Musicman 4 string with ease.\n\n\n\nPino has played a number of basses during his career, but his trademark fretless sound came from his much loved Music Man StingRay, which he bought from Sam Ash music in NYC. He’d tried out a few fretted Music Man basses before but thought they sounded too trebly, but with this particular bass, which I think is a 1979 sunburst model with a rosewood board, he found a warmer more versatile sound and the rest is history.\n\n\n\nOther basses in his early career included a fretless Pedulla and a Warwick Thumb, but his move back to playing more vintage-style fretted basses was led by a number of P Basses from the early 60s, one of which the Fender Custom Shop chose to reproduce for his signature model, complete with Thomastik-Infeld strings. He also plays a Moon Bass, which he used extensively for the D’Angelo Voodoo tour back in 2002. And as for his strings, he uses Rotosound Swing Bass stainless steel mediums, which he prefers for the fretless sound, and Thomastiks or La Bella heavy gauge flatwounds for the P Bass.\n\nPino's Fender Signature P-Bass\n\nAside from his StingRay, Pino’s fretless sound also became synonymous with a Boss 0C-2 octave pedal, which can really be heard on Paul Young’s I’m Gonna Tear Your Playhouse Down.\n\nPino continued to bolster his CV during the 1990s with sessions for the likes of Eric Clapton, Seal, Elton John, Tears for Fears, David Gilmour, Chaka Khan, Pete Townsend and Joan Armatrading, and jazzers such as Al Di Meola, John McClaughlin, David Sanborn and Chris Botti.\n\n\n\nIt was also around this time that he resurfaced in full on R&B groove mode, hitting unbelievable new heights with the epic 2000 recording, Voodoo by D’Angelo.\n\n\n\nThe album’s greasy, laid back feel caused a huge buzz among rhythm sections everywhere, and led to a who’s who of hip hop artists summoning Pino and his 1963 P Bass to their studios. Just listen to how Pino's killer bass line on Chicken Grease sits so lazily in the back of the pocket. Pino is also all over D’Angelo’s 2014 album, Black Messiah, Erykah Badu’s Mama’s Gun and Aijuswanaseeing by Musiq (Soulchild) which all serve as an amazing schooling in the way of the lowend.\n\n\n\nAs the world ushered in the year 2000 Pino was about to reinvent himself yet again. Here's a quote directly from Pino:\n\nIt's important to be able to reinvent what you do. When the call came to play with The Who I was working with Erykah Badu and D'Angelo, and I had to change my whole style. The manager said: 'John [Entwistle] is dead. Can you do a gig at the Hollywood Bowl in three days' time?' You don't turn down something like that. It was only afterwards that I thought about the consequences. Pete Townshend's direction was, 'Play whatever you want, just as long as you play loud!'\n\nThe early 2000's saw Pino filling the bass chair with Simon and Garfunkel on their 2003 reunion tour and he was also drafted in for heavyweight album sessions with the likes of Adele, Ed Sheeran and even Nine Inch Nails. It was during this steady schedule of studio work that Pino took a call that would once again cement his place as one of the most admired bassists in contemporary music.\n\n\n\nWhen bassist Willie Weeks was unable to make a John Mayer gig for the Tsunami Aid benefit concert in 2005, drummer Steve Jordan suggested they call Pino and the rest is history. Countless tours and stadium gigs followed, with the band’s chemistry captured brilliantly on the 2005 live album, Try! And again on the 2008 live DVD, Where The Light Is.\n\n\n\nJust check out the amazing chemistry between Pino, John and Steve on \"Who do you think I was\" to say it's a perfect demonstration of how in the pocket a trio can be would be an understatement, and please, let's just give it up for Steve Jordon on this one, surely one of the coolest drummers in history."}, {"url": "https://www.allaboutjazz.com/musicians/pino-palladino", "page_content": "Pino Palladino was featured on Gary Numan's 1982 album I, Assassin, in which his fretless bass sound made a prominent contribution to the overall sound of the album. He went on to play fretless bass with a healthy number of high-profile artists that include (on the short list), David Gilmour, Tears for Fears, Pete Townshend, Peter Gabriel, Joan Armatrading, Phil Collins, Chaka Khan and Don Henley.\n\nPalladino began playing the electric guitar at age 14. By age 17 he decided to play the bass guitar, and bought his first fretless bass one year later, playing mostly R&B, funk, and reggae within a rock and roll backbeat. His first professional gig was at a local television station in Cardiff, where he began playing in 1978. That same year, at age 20, he joined Jools Holland's band and recorded with Holland on his album entitled, Jools Holland and His Millionaires. Palladino toured with Jools to support the album, which gave him the opportunity to purchase his own Music Man StingRay Fretless Bass. Holland was touring with another new band; the Q-Tips, whose frontman, Paul Young made acquaintance with Palladino whilst they were on tour, who would, a year later offer Pino a place in his own backing band.\n\nPalladino has joined several bands and ensembles through which he is most visible. He joined jazz trumpeter Roy Hargrove in forming The RH Factor, a band that mixes elements of soul, jazz, and R&B. He is a member of the John Mayer Trio, and was the first choice by Pete Townshend and Roger Daltrey to fill the position left by John Entwistle as the current bassist for The Who.\n\nPino Palladino (17 October 1957 in Cardiff, Wales, UK) is a Welsh bass guitarist of Italian ancestry. Palladino rose to public notice playing primarily rock and roll, blues rock, and rhythm and blues music, although he has been lauded for his ability to play most genres of popular music, including jazz, neo soul, and funk. Adding to his eclectic grasp and melodic approach on his instrument, he has become one of the most sought-after session players on the bass in the music industry. He has played on a large number of recordings by some of the world's most successful entertainers, in part, by mastering a variety of techniques on both his late 1970s fretless Music Man StingRay bass guitar and later in his career, adding fretted Fender Precision and Jaguar basses. His playing has earned him custom instruments bearing his name.\n\nAfter vocalist Paul Young landed his own solo contract, Palladino was brought in as part of his backing band \"The Royal Family\" in 1983 with noticeable chart success with the No Parlez album, and major hit singles both in the UK and Europe. Examples of Young's new found success were the band's cover of the Marvin Gaye classic \"Wherever I Lay My Hat (That's My Home)\", which reached No. 1 in the UK singles chart for three weeks in the summer of 1983, and \"Love of the Common People\". Palladino toured extensively at this time with Paul Young, remaining in the band for five years. 1983 additionally proved to be the year of another ensemble featuring Palladino, Paul Rodgers (formerly of Bad Company, drummer Kenney Jones, along with a rotating cast of other celebrity performers. The band only released one album through Atlantic; The Law, although there were enough out-takes that another bootleg-styled album followed in 1991. Sales were unremarkable, despite the names of those who recorded on the album.\n\nThroughout the 1980s Palladino was noted for his R&B roots on the fretless bass, even when supporting pop and rock heavy performers. One reviewer from Bass Player magazine points to Paul Young’s cover of the Bobby Womack/Rufus tune \"Stop On By\" (on 1990’s Other Voices), with its \"pre-hip-hop, swung funk groove\" as the precursor to Palladino's later neo-soul focus.\n\n1990s Changes in instrument\n\nIn the 1990s, Palladino began to alternate between the sounds achieved in playing the fretless bass to one with frets, as well as the 4-string and 6-string bass. At the time, he was well known within the industry for his fretless bass sound. However, now, depending on which artist he was supporting, and the song to be played, he began gravitating towards fretted bass. He was maturing as a musician, and played with artists as diverse as Melissa Etheridge, Richard Wright, Sir Elton John and Eric Clapton. Also in 1991 he joined Paul Rodgers (of Free, Queen+ Paul Rodgers, and Bad Company fame) to form the band The Law. In the mid 1990's, Palladino played bass for The London Metropolitan orchestra during their recording of \"An American Symphony\", soundtrack for the movie Mr Hollands Opus.\n\nPalladino supported Phil Collins, as a member of the house band for the Golden Jubilee of Elizabeth II, which played with Sir Paul McCartney, Eric Clapton, Cliff Richard, and Tony Bennett, among other notable performers. He later wrote that he felt privileged to have been amongst the others on stage in such an event.\n\nIn 1999, he began working with Richard Ashcroft, of The Verve, during the recording sessions of Ashcroft's debut solo album, Alone With Everybody. Richard proved to be mightily impressed by Pino's natural bass playing ability;\n\nThis Pino Palladino, I can say a Meters record and he can play me the bass line. He can play anything. He's one of the only people in the world who can totally replicate that kind of Beach Boys/scratch/Walker Brothers bass. You can get that sound if you want it, dead on. So it was very liberating working with him.\n\nPino also joined Ashcroft's touring band for the singer's first major solo outing throughout 2000.\n\nNeo Soul\n\nBy the mid- 1990s, Palladino had established himself as a busy, highly desirable bassist and a studio worker in many genres, but finally became visible to those artists who played largely left of center, and demand for his session playing grew within a different quarter. Palladino began moving from blues-rock toward neo soul projects. Palladino and Steve Jordan found themselves performing on the same session for B.B. King’s 1997 duets CD Deuces Wild. It was the first time soul singer D'Angelo first heard Palladino, who had just switched from a signature sound fretless bass sound to that of performing with fretted basses. The result was an invitation to \"use Pino’s big, behind-the-beat bass to help cast a neo-soul spell on his Grammy Award-winning Voodoo album\". It would not be his first uncredited Grammy performance.\n\nAs the word spread throughout the genre, Palladino found an increasing demand within the neo-soul genre. Examples of his bass work in this genre (in addition to D'Angelo) includes Mama's Gun, and \"Penitentiary Philosophy\" found on Erykah Badu’s 2000 CD. Other albums using Pino's sound include 1st Born Second for Bilal, Like Water for Chocolate and Electric Circus for Common. Palladino has been described by Steve Jordan, who got his own professional start playing the drums for Stevie Wonder as having a \"deep funk\" side and a \"melodic\" side. Palladino admits, that \"Of all my influences, I would say what’s always in the back of my mind is early Stevie Wonder, like Talking Book and Innervisions; that music is really in my blood.\"\n\n2000s\n\nFollowing the death of The Who's bassist John Entwistle in 2002, the eve before the band were to kick off their first world tour in years, Palladino was their first choice to become the band's full-time touring bass guitarist, and by 2006, he was invited to join the remaining original band members in recording their first album in twenty-four years. Pete Townshend, the band's composer, recorded the bassline on the majority of the songs to get the effect he himself wanted, with Palladino doing so on the other six of them. Released in October 2006, the album was named Endless Wire.\n\nPalladino also recently played with The Who at the Super Bowl XLIV half-time show, in February, 2010, alongside other backing artists: Simon Townsend on guitar, Zak Starkey, drums and percussion, and John \"Rabbit\" Bundrick, on keyboard instruments.\n\nPaul Simon\n\nIn 2003, Palladino intended to go down to see his old friend Paul Simon and meet Brian Eno for the first time. He was asked to record with them, and had to borrow a bass guitar to play. The result was that he played with Simon and Garfunkel on their \"Old Friends\" reunion tour and in an interview with Bass Player Magazine he mentions drummer Steve Gadd and percussionist Jamey Haddad \"had laid down some great grooves for me to add bass\". He had kept the recordings, and by the time that he appeared on the Old Friends: Live on Stage CD and DVD from the tour, he was able to use some of the material. He played on Paul Simon's 2006 release, Surprise.\n\nOther appearances\n\nPalladino has toured in the backing band for Joe Walsh. In 2004 he appeared to be playing with Gary Moore at the Wembley Arena.\n\nEmergence of the John Mayer Trio\n\nPalladino met Steve Jordan in the mid-1980s while both were working as session players on many occasions, which blossomed into a friendship. When their work brought them to the same place, they would meet, usually jam together, and introduce other musicians to one another, forming friendships which sometimes blossomed into good working relationships. Jordan has remained keen about Pino since he met him, and only grows more enthusiastic about his talents, which he describes partly as his love for, and ability to \"feel\" changes in music, through melodies, basslines, and an amazing connection with genres of nearly every kind. According to Jordan, he'd planned to meet up with John Mayer and Willie Weeks in January, 2005 to perform a benefit concert on a NBC sponsored telethon Tsunami Aid: A Concert of Hope to raise funds and public awareness benefiting victims in the aftermath of the tsunami that struck southeast Asia. Weeks was unable to make the performance, and Jordan suggested Palladino, who had heard some of Mayer's work, and was willing to come. Beginning a set that included the Jimi Hendrix classic, \"Bold as Love\", the three all agreed that they experienced such chemistry that they began talking right away about arranging their schedules to record a CD and a tour. The trio released the album Try!, on November 22, 2005. The eleven-track live album includes cover songs, such as Jimi Hendrix's \"Wait Until Tomorrow\" and \"I Got A Woman\" by Ray Charles, two songs from Mayer's release Heavier Things, as well as new songs written by Mayer. In addition, Mayer, Palladino, and Jordan wrote three songs on the album: \"Good Love Is On The Way\", \"Vultures\", and \"Try!\". Along with John Mayer on guitar and vocals, and Steve Jordan on drums, Palladino has toured and recorded as a member of the John Mayer Trio, and on Mayer's third album Continuum.\n\nRecent tours\n\nIn spring of 2006, Palladino toured with Jeff Beck. He also played with J. J. Cale, and Eric Clapton on their 2006 album The Road to Escondido, alongside other notable musicians, including Derek Trucks, and Billy Preston. It was to be Preston's last work before he died only days afterward.\n\nInfluences on bass guitar\n\nInfluences for Palladino for bass guitar include Motown bassist James Jamerson; Stevie Wonder’s keyboard-bass, jazz innovator Jaco Pastorius; British folk/rock upright bassist Danny Thompson; Norman Watt-Roy (of Ian Dury & the Blockheads); Larry Graham; Michael Henderson; Bootsy Collins; Paul Jackson; Anthony Jackson; Doug Rauch (of Carly Simon and Santana), and Billy Cobham.\n\nTechnique\n\nPino Palladino is noted for his use of the fretless bass in many 1980s chart records. While it was typical for a bass guitar in a commercial track to have a rather generic sound and stay \"playing the low notes\" Palladino preferred a different sound (combining fretless tone with an octave effect) and basslines that frequently added chords, lead lines and counter melodies in the higher range of the instrument as opposed to simply the aforementioned \"low notes\". Typical of this style was his playing on Paul Young's biggest chart hits, in particular his bass solo on \"Wherever I Lay My Hat (That's My Home)\". His equipment at that time included a fretless Music Man StingRay Bass 1979 and Boss Octave pedal (OC-2).\n\nPino Palladino signature model\n\nThe Fender Pino Palladino Signature Precision Bass is modeled after two of Pino's Fender Precision Basses. The body featuring faded fiesta red paint over desert sand paint is based on Pino's 1961 Precision Bass while the neck shape and round-lam rosewood fret board are based on Pino's 1963 sunburst Precision Bass.\n\nRecent projects\n\nPalladino joined Eric Clapton's touring band for 11 dates in the Eastern U.S. and Canada in May 2008. Current work has included work on an with Clapton and Robbie Robertson, and Palladino guested on bass for Amos Lee on his third album, Last Days at the Lodge.\n\nIn 2009, Palladino joined with keyboardist Philippe Saisse and Simon Phillips to form an instrumental trio: Phillips Saisse Palladino, an instrumental jazz/funk rock ensemble, which have toured Europe through 2009 into 2010, playing songs that spotlight the talents of each performer, in the manner of many jazz outfits. Show less"}, {"url": "https://www.musicradar.com/news/in-a-rare-interview-bass-legend-pino-palladino-reflects-on-replacing-the-whos-john-entwistle-on-two-days-notice", "page_content": "Welsh bass virtuoso Pino Palladino has enjoyed a prolific career as a session musician, recording with pop superstars such as Adele and Ed Sheeran, playing bass in The Who after John Entwistle's death, and collaborating with the likes of D'Angelo, John Mayer, Elton John and many more.\n\nWhat Palladino isn't is a prolific interviewee, preferring to let his bass guitar do the talking. But in an interview published today in The Guardian, he has spoken of the moment in 2002 when Pete Townshend called. John Entwistle had passed away: would Palladino fill in on the tour?\n\n“I flew to LA, thinking, what are you doing? You don’t even know many Who songs,“ said Palladino. Townshend was prepared, presenting him with a stack of CDs.\n\nThat’s the one instruction you keep getting when you work with the Who: ‘Fucking turn it up, we can’t hear you!‘\n\nAs a session player who had overcome imposter syndrome to sit in with the likes of David Gilmour and Elton John, there was no question Palladino would get The Who's set down pat. But only after some helpful advice from Townshend.\n\n“At the first rehearsal, Pete comes over and says: ‘You’re going to have to play louder’ – because I’m used to being the sympathetic musician, who fills in, doesn’t make a racket,“ said Palladino. That’s the one instruction you keep getting when you work with the Who: ‘Fucking turn it up, we can’t hear you!’”\n\nPalladino also speaks about his career through the 80s, when he was on speed dial for any pop star who needed some four-string flair in the low end. But in a career that saw him play on some of the top-selling albums of all time, Palladino considers his collaboration with neo soul pioneer D'Angelo, as bassist of the Soulquarians, the personal highlight.\n\n“D’Angelo – I’d mention him in the same breath as Stevie Wonder and Donny Hathaway and Sly Stone,“ said Palladino. “It’s incredible, to be a Welsh guy, having no real connections to these guys other than music that we loved and played.“\n\nPalladino has just released Notes With Attachments with the Californian guitarist and composer Blake Mills, available now through New Deal Records. You can read his interview with The Guardian here."}, {"url": "https://knowyourbassplayer.com/2015/03/10/2015-3-10-pino-palladino/", "page_content": "Fretless Pino Courtesy of Music Man Com Fretted Pino Courtesy of Fender Com\n\nBy Thomas Semioli\n\nHe’s the cat who orchestrated the fretless takeover of the instrument in the 1980s/90s. Then he commandeered the triumphant return of the fretted Fender Precision in the 21st century.\n\nFor nearly forty years and counting, the chameleonic Giuseppe Henry “Pino” Palladino has been among the most in-demand session and touring bassists on the planet. Greatly inspired by classic rhythm & blues and American soul music, Pino mostly plies his craft with frets nowadays, utilizing a vintage 1961 Precision which has been replicated for the masses by way of Fender’s signature bass series.\n\nPino’s genre traversing work spans Paul Young, D’Angelo, John Mayer Trio, Don Henley, Adele, David Gilmour, Jeff Beck, Nine Inch Nails, The Who, and Herbie Hancock, among many other high-profile artists.\n\nPalladino’s use of a an “octaver effect” (Boss Octave O2 pedal) on his fretless MusicMan Stingray set a precedent for the instrument in a pop context throughout the Regan / Thatcher years. On the hits (such as Melissa Etheridge’s “Come to My Window” and Paul Young’s “Every Time You Go Away”) and the album tracks – Pino almost always rendered an upper register motif which severed as a main or secondary hook to the composition.\n\nHis work on D’Angelo’s Voodoo slab in 2000 reignited interest in the fretted Fender Precision bass which continues well into the present day.\n\nPino Palladino Sound & Vision…\n\nD’Angelo “Chicken Grease” https://youtu.be/m4XI6LXCsH8\n\nPaul Young “Every Time You Go Away” https://youtu.be/nfk6sCzRTbM\n\nMelissa Etheridge “Come To My Window” https://youtu.be/Gk4CwPQCbAE\n\nGary Numan “Music for Chameleons” https://youtu.be/_586NoZSr-Y\n\nErykah Badu “Cleva” https://youtu.be/XO0KY6Fry5M\n\nEric Clapton “Bad Love” https://youtu.be/qY2vjv8aEas\n\nThe Who Quadrophenia Live https://youtu.be/9NEQb6LdHGQ"}, {"url": "https://bassguitarshack.com/pino-palladino-bass-superman/", "page_content": "One of the most respected and admired bass players in music today, Pino Palladino has such an array of amazing bass chops and feel that it’s almost ridiculous. Pino’s ability to fit his unique style into any type of music and not only make it work but make it sound great is a rare skill indeed. It’s the combination of these qualities that make Pino Palladino a bass superman.\n\nThe complete package, Pino can make it funky, melodic, and anything in between all the while serving the song perfectly. Never getting in the way of the other musicians, Pino always adds just the right feel to the track.\n\nPino Palladino’s early years\n\nBorn in Cardiff, Wales on October 17, 1957, Palladino originally started on guitar, but at age 16 he picked up a friend’s bass and realized that this was the instrument for him. Soon after, he bought a Fender Precision. Not long after that, he begins his journey as a professional bass player.\n\nHeavily influenced by James Jamerson , Stevie Wonder, Michael Henderson, Jaco Pastorius, and Paul Jackson, Pino begins to develop his own personal style and technique. After playing for a local Cardiff television station, Pino moves to London in 1980 to join a band led by Jools Holland of Squeeze. As Pino began to make a name for himself in London, he soon became a highly sought after session player.\n\nIt was around this time that Pino began using a fretless Music Man Stingray (another company started by Leo Fender). His highly expressive lead fretless bass line for Paul Young’s cover of “Wherever I Lay My Hat (That’s My Home)” became an instant classic. Pino also worked with Gary Numan on his album I, Assassin. Numan has stated that he was blown away by Palladino’s amazing bass playing. He’s also said that his unusual fretless tone defined the album with its atmospheric and dreamy quality.\n\nPino leaves the fretless behind and meets D’Angelo\n\nIn the early 1990s, Pino switched from his fretless Musicman Stingray to a fretted sunburst 1963 Fender Precision bass with La Bella flatwound strings. The change was both a musical and personal decision. Pino had grown tired of the lead fretless sound, and he also felt the need to return to his love of the old R&B and soul bass sound.\n\nAfter recording an album with Tom Jones and B.B. King, Pino caught the attention of neo-soul artist D’Angelo who was looking for a certain bass sound for his new album, Voodoo. Palladino’s greasy, fat, laid-back grooves on his ’63 P-Bass gave the recording an old-school vibe that had a large impact not only on bassists but on entire rhythm sections in general. This led to many more session jobs in the neo-soul style for the now very in-demand bassist.\n\nPino’s uncanny ability to adapt to any style and make it his own is what truly sets him apart from the ordinary session bassist. His amazing feel and intuition allow him to be both expressive and tasteful with his bass lines. Pino has stated that he has something he calls “trust chops,” instincts that help him figure out what to play through difficult sections.\n\nNew Directions with The Who\n\nAfter the untimely 2002 death of the great bassist John Entwistle, the surviving members of The Who asked Palladino to play bass for the remainder of their tour. He’s now their permanent bassist. Having played with Pete Townshend and Roger Daltrey previously made this very daunting task a little easier for him, Palladino also personally knew Entwistle.\n\nFor The Who gig, Pino started with both Fender Precision and Jazz basses, finally settling on Fender Jaguar basses, which he likes for their powerful cutting tone. He has said many times that playing with The Who is like a dream come true, and sometimes he can hardly believe that he’s on stage with them.\n\nPino has stated that Pete Townshend had given him full freedom with the bass lines, although he tries to keep them as faithful to John’s original lines as possible. In 2003, Pino started working with Paul Simon for his tour and recorded an album with him in 2006. For this gig, he used his fiesta red 1961 Fender Precision with flatwound strings.\n\nPino’s recent work – and into the future\n\nPino Palladino’s signature Precision Bass\n\nPalladino has also had the great honor of having Fender issue a signature bass in his name. The Fender Pino Palladino Precision Bass is a Custom Shop creation featuring a body modeled after his ’61 Precision and the neck shape after his ’63 P-Bass. The bass is finished in fiesta red over desert sand and given the relic treatment by the Custom Shop craftsmen.\n\nThe John Mayer Trio and many others\n\nDuring the Tsunami Aid benefit concert in 2005, Pino met guitarist John Mayer through drummer Steve Jordan. After original bassist Willie Weeks was unable to perform, Pino was asked to fill in for the concert. The three hit it off well in the studio. Pino later stated that there was instant chemistry between the three musicians. They later decided to form a power trio and set up some tour dates. The John Mayer Trio was born, and this gave Palladino a new opportunity to add creatively in a band context.\n\nIn 2006, Pino joined Jeff Beck for a tour and also worked with Eric Clapton, J.J. Cale, Derek Trucks, and Billy Preston on an album. He’s also played with Robbie Robertson and Herbie Hancock and worked on a follow up to the Voodoo album with D’Angelo entitled Black Messiah.\n\nAs clear evidence of Palladino’s vast range and versatility, in 2013 he played on the Nine Inch Nails album Hesitation Marks and toured with the band as well.\n\nPino Palladino is probably the most sought after bassist in music today and for good reason. His bass chops, great tone, and musical instincts are unparalleled in the industry. We look forward to more great work from Pino for many years to come."}, {"url": "https://www.udiscovermusic.com/stories/pino-palladino-interview/", "page_content": "Photo: Cedric Ribeiro/Getty Images\n\n“All musicians are the same, we all think we’re rubbish,” Pino Palladino told a British television interviewer in 2013, adding a gentle laugh. It was a typically massive understatement from the quietly affable Welsh bassist, among the highest-regarded session players in the music industry. In this case, Palladino was referring to hearing Paul Young’s “Wherever I Lay My Hat” on the radio for the first time in 1983 – particularly his casual contribution, one of the most recognizable bass lines of the 1980s. “I was worried that it sounded a bit out of tune,” he said.\n\nIn a decades-long career, Palladino has not only provided low-end support for several musical revolutions, he’s helped stoke a few of them himself, undergirding pioneering sounds in pop, New Wave, neo-soul, electronic, rock, jazz, funk, and even industrial with an ever-inventive foundation. He’s widely regarded as one of the most influential bass players ever, with just as much name recognition in certain quarters as the superstars he’s backed.\n\nBeginning with Gary Numan in 1982 and continuing through work with artists like Young, Phil Collins, Tears for Fears, Go West, and Chris de Burgh, Palladino helped define the coolly emotive 80s sound with his trademark fretless technique. In the 1990s he backed Elton John, Eric Clapton, Carly Simon, Bryan Ferry, Joan Armatrading, B.B. King, and many more, before joining the legendary Soulquarians artists collective, reviving cosmic soul and funk sounds with Erykah Badu, D’Angelo, Questlove, and J. Dilla.\n\nADVERTISEMENT\n\nFrom there, it was on to stints with Mika, Nine Inch Nails, Adele, Kelly Clarkson, Paul Simon, and Keith Urban, among a wealth of others, as he also embarked on longtime touring associations with Jeff Beck and John Mayer. Palladino’s most famous stretch came with The Who, when he stepped in after John Entwistle’s untimely death in 2002 to tour and record for two decades, playing probably the most famous bass solo in pop – 1965’s “My Generation” – for arena-sized crowds. Most recently, he’s played for Harry Styles, Ed Sheeran, Corinne Bailey Rae, and John Legend. You can’t talk about Pino Palladino without mentioning a few names.\n\nNow, at last, Pino Palladino is releasing an album of his own, collaborating with guitarist Blake Mills. Called Notes with Attachments, the record summons intimate, cinematic moods, bristling with sophisticated patterns, atmospheric woodwinds, and surprising electronic touches. It’s a compendium of several decades’ worth of Palladino’s compositional ideas, complex, and contemporary yet warm with nostalgia – paying homage to the classic film soundtracks, cool jazz, and Burt Bacharach arrangements he loves.\n\nIn honor of the new release, we accompanied the lauded bassist on a trip down memory lane, revisiting some of his best-known album and tour appearances.\n\nTear for Fears, Seeds of Love (1989)\n\nPino Palladino: I have a lot of great memories of that album, not least because my daughter Fabiana was born around the time we were recording it. My life was changing in a big way. I had been doing a lot of session work with the French drummer Manu Katché, who toured with Peter Gabriel. We were becoming known as a rhythm section together, and a bit in demand. I believe that’s how Roland Orzabal heard of us and invited us onto the album.\n\nThe actual recording was unusual for the time; the tracks were cut live with a full band. We holed up together for a few weeks in Townhouse Studios in London, and went through each of the songs, experimenting with instrumentation and arrangement. There were some days when we just jammed and extended parts of the songs. Roland then took the whole bundle and edited it down into what you hear on the album. We must have recorded “Badman’s Song” and “Woman in Chains” a dozen different ways with different transitions. Roland’s choices and his taste as the composer, defined the amazing end results.\n\n\n\nWatch this video on YouTube Click to load video\n\nOne of my fondest memories: When I first got there, I was going into the control room and I heard this incredible piano-playing in the studio. I was wondering, “Who is that?” I went round the corner and there was Oleta Adams, sitting at the grand piano and singing so beautifully, jamming away on gospel and blues. I’m honored to have played on her solo album Circle of One.\n\nThe Seeds Of Love can be bought here.\n\nElton John, The One (1992)\n\nPino Palladino: We recorded in Paris at Studio Guillaume Tell. Well, the food in Paris was excellent. We would end every day going out to dinner at high-end restaurants with the table piled up with dishes. It was really something to keep up with…but I rose to the challenge!\n\nWorking on that record and spending time with Elton was humbling. I remember one day, Bernie Taupin faxed some song lyrics over in the morning, and Elton took them into the next room and had an amazing song written within an hour…incredible! At this time I was really known for my fretless bass sound, it was something people specifically hired me for. Elton encouraged me to develop my ideas for the basslines and let me do my thing on the record.\n\n\n\nWatch this video on YouTube Click to load video\n\nErykah Badu, Mama’s Gun (2000)\n\nPino Palladino: This was during the Soulquarians period, it was a real fun time. I made the connection because Ahmir [“Questlove” Thompson] had called me in to add to one of the songs he was working on. We thought I would just overdub the bass on one track, but it felt really good and we built up a vibe. Erykah had booked time at The Lady and we reconvened at a later date.\n\nErykah’s way of working was refreshing. For Mama’s Gun, Erykah had sketched out a couple ideas for the album, and had a vision of what she wanted, but otherwise it was pretty undetermined at that point. We all assembled, the whole band, and Erykah just came around, so cool in her way, and asked “OK, Pino, what you got?” That was it. “What you got?” We played around with some different ideas, and it turned into a collaboration, developing the songs together. I played a bassline I had in my mind for a while, and that became the first song on the album, “Penitentiary Philosophy.”\n\nOddly enough, it reminded me of when I was getting started, working with Gary Numan on the I, Assassin album in 1983. Back then, I showed up and Gary had recorded his songs but didn’t have bass parts on them. He wanted me to come up with ideas and gave me complete freedom to compose the parts for the songs. I played my fretless bass and that sound became the sonic signature for the record. What made it different with Erykah, is that this time I got a songwriting and production credit.\n\nListen to Mama’s Gun here.\n\nD’Angelo, Voodoo (2000)\n\nPino Palladino: Being a part of that moment when this album and Mama’s Gun came out almost back to back was thrilling. After meeting D on a session with B.B. King, he invited me to meet him and his engineer, Russ Elevado, at Electric Lady Studios with a view to me playing some bass on the songs for his upcoming record, Voodoo.\n\nWhen they played some of the songs for me, I was mesmerized by the unique feel of the grooves and D’s otherworldly vocal arrangements. D’Angelo had written the songs for Voodoo at the keyboard and while his left hand would play what would become the blueprints for the basslines, his right hand plays the chords and flourishes that accompany the main melody. It all fits together in such a unique way… The basslines are woven into the fabric of the composition from the start.\n\n\n\nWatch this video on YouTube Click to load video\n\nAlthough some songs were established when I got there, others were left more open to develop ideas and for me, some freedom of expression, from adding in passing notes to flurries up to the top of the bass neck to complement his vocals. Because the album is so bass- and rhythm-driven, everything mattered, it was all at the top of the mix, he encouraged me to bring my thing to the music and, through him, I met Erykah, Quest, James Poyser, Roy Hargrove, J Dilla, Common, and all the Soulquarian collective.\n\nListen to Voodoo here.\n\nAdele, 21 (2011)\n\nPino Palladino: I was back in London when [producer] Rick Rubin reached out to me about recording a new album for Adele. She had already made a name for herself in the UK before she broke worldwide, so I had heard of her. Rick told me, “I want to get you into this fantastic band, with drummer Chris Dave, Matt Sweeney and Smokey Hormel on guitars, James Poyser on piano, and really give her the strong backing she deserves.” I flew out to Shangri-La studios in California where they were recording, and she just killed it on the vocals from the start. I remember hearing her voice for the first time through my headphones and being blown away by how she could sing. The songs were really great and I knew we were recording something special.\n\nMika, The Origin of Love (2012)\n\nPino Palladino: Mika has certainly got some incredible energy, he would bounce around the studio with all these ideas. Mika brought a lot of curiosity to the process, he would come up with things while I was playing. He was interested to hear fretless bass on some of the songs and liked how it fitted in. I believe I was hooked up with him through Nick Littlemore from Empire of the Sun. Working on a more electronic-oriented pop album was interesting. It’s great to get the opportunity to expand what you do, and try out different directions.\n\n\n\nWatch this video on YouTube Click to load video\n\nNine Inch Nails, Hesitation Marks (2013)\n\nPino Palladino: Trent [Reznor] reached out to me, out of the blue, and asked if I would be interested in collaborating on a couple of tracks for the album. I was really curious how I would fit in with his sound. Trent is a very good communicator, with clear ideas. He is a fan of Voodoo and of Gary Numan, so for me that was interesting as I could maybe bring two different sides of my playing to the music. I played a couple of takes on each song and just did my thing. Later, Trent’s manager called and asked if I would be interested in touring. It turned out that the band had already been rehearsing for a month. It was a real challenge to learn the songs in a short amount of time before we went on the road. And I had no idea how his fans would react to me. But Trent gave me a lot of room, and that ended up being a memorable tour. The whole band was so tight, and the light show, along with the visual effects, was on another level from anything I’ve been a part of.\n\nThe Who, Endless Wire (2006) and touring after John Entwistle’s death\n\nPino Palladino: In 2002, I was working on Common’s Electric Circus album and I was about to fly home to London from Philadelphia, when my wife called me at the hotel and said, “You just got a call from the Who’s management” She gave me the tragic news that John Entwistle had just died, and they wanted to know if I could step in so they could continue the tour. There was going to be a concert at the Hollywood Bowl a few days later. After speaking to their management, I flew to LA later that day to rehearse for the gig and the following tour.\n\nI had spent some time with John. He was smart, funny, charismatic. He was a superstar. And, of course, an idol as far as bass-playing goes. I had worked with Pete [Townshend] as well, and Roger [Daltrey]. When I flew into LA, Pete was waiting for me at the hotel with a stack of CDs. “Just learn what you can,” he told me. Stylistically, I was not in that space at all at the time – I was doing hip-hop, funk, soul. So it was a complete reset for me. The first thing I did was change the strings on my bass to get a brighter sound, like John had. I pretty much didn’t sleep that night, and learned as much as I could. I think I pulled it off, because they kept me on!\n\nI just worked on their recent record [2019’s WHO]. Endless Wire was the first studio record they made after John’s tragic death, and that was less of a “band” experience. Pete had done a number of demos, obviously some with John in mind to a certain degree. I’d ask Pete if I was doing all right, and he would turn to me and say, “Play more.” He didn’t elaborate, just “play more.” And I understood. Some people would think of it as overplaying, but the classic sound of The Who is Keith Moon on drums and John Entwistle on bass just making this unholy racket. So that’s what I aimed for.\n\n\n\nWatch this video on YouTube Click to load video\n\nHarry Styles, “Watermelon Sugar” (2020)\n\nPino Palladino: I was rehearsing with John Mayer at Henson Studios in Hollywood, which was the former A&M Studios, and before that the Charlie Chaplin Studios. Beautiful history there. Harry was recording in the same studios, down the hall. John knew him and introduced me to Harry. Harry and his producers played me a few songs to see which ones I felt I could add to, including “Watermelon Sugar.” If you listen to the bass line in that song, it’s very well-defined and echoed by the guitar line. There wasn’t really a lot of room to move. Well, I started getting a little free with it, trying stuff, and Harry jumped up and said, “That! Can you do more of that?” It’s an honor that I get invited to play on these songs. It’s going to be a hit with or without me. So I feel very fortunate to be asked to contribute.\n\nPino Palladino and Blake Mills, Notes With Attachments (2021)\n\nPino Palladino: This record is a culmination of what I’ve been thinking about through much of my career. I’ve been recording many of these ideas over a long period of time as I’ve toured and collaborated with many musicians and artists that I admire. What interested me in making my own album was having the chance to focus on compositional elements, rather than the bass taking the lead. Maybe some listeners have been surprised that there are woodwinds and other instruments in the foreground. It’s not me showing particular prowess on my instrument, but to define the role of the bass as a signature part of a song is the challenge I enjoy. I’ve always loved instrumental music, from jazz to film soundtracks. I want my music to invoke some of those qualities.\n\nSome of the ideas on the album evolved from my time touring with D’Angelo and the Soultronics, that kind of beat-driven music, but with beautiful elements and touches, but also from many other types of music that I love. When I played some of these ideas originally for Blake, he was very encouraging and, as we started working on the songs, it quite naturally became a collaboration. Blake, along with all the incredible musicians on the record, have all given so generously to the project, I’m very fortunate to have had the opportunity to make this album. It’s a very interesting process for me, having my own music released. It feels like part of my DNA is suddenly out there. The album was recorded two years ago. But people have told me that it speaks to the moment, that they’re listening to it through this complex time and enjoying it. That’s really nice to hear.\n\nListen to Pino Palladino and Blake Mills’ Notes with Attachments here."}, {"url": "https://www.musicngear.com/fender-pino-palladino-signature-bass", "page_content": "For the scientific approach behind our collaborative and content-based filtering algorithms used in our hybrid recommender system please consult [1] , [2] , [3] , [4] , [5] and [6]\n\nWe have collected data (music preferences, personality traits and demographics) by people who took the Goodforme Test for \"Pino Palladino Signature Bass\" and relevant gear by Fender, in \"4-String P-Basses\" or related categories and together with the tech specs of products in our database we feed it into our state-of-the-art recommendation engine. A sample of the data we are using to generate the results for the Goodforme Test, reports and visualizations for this gear can be found below.\n\nLatest test results\n\n50% A male fan of The Rolling Stones, Charles Mingus, Nat King Cole, Keith Jarrett, B.B. King, John Lee Hooker, Buddy Guy and Pop, Classic rock, Jazz, Blues , aged 55 y.o. or older from Spain took the \"Goodforme\" test for Fender Pino Palladino Signature Bass 1 month 1 week ago and scored 50%\n\n49% A male fan of The Rolling Stones, Dixie Chicks, Charles Mingus and Pop, Classic rock, Country, Jazz , aged 45-54 y.o. from Sweden took the \"Goodforme\" test for Fender Pino Palladino Signature Bass 6 months 3 weeks ago and scored 49%\n\n70% A male fan of Eric Clapton, Cypress Hill, Common and Jazz, Blues, Hip hop / rap, Reggae , aged 18-24 y.o. from United States took the \"Goodforme\" test for Fender Pino Palladino Signature Bass 11 months 2 weeks ago and scored 70%\n\n70% A male fan of Eric Clapton, Cypress Hill, Common and Jazz, Blues, Hip hop / rap, Reggae , aged 18-24 y.o. from United States took the \"Goodforme\" test for Fender Pino Palladino Signature Bass 11 months 2 weeks ago and scored 70%\n\n99% A male fan of Guns N' Roses, John Coltrane, Nat King Cole, Gary Moore, Muddy Waters, Jimmy Page and Pop, Classic rock, Jazz, Blues , aged 55 y.o. or older from Spain took the \"Goodforme\" test for a relevant item by Fender in the 4-String P-Basses category 1 month 1 week ago and scored 99%\n\n99% A male fan of Lady Gaga, Michael Jackson, The Rolling Stones, Bon Jovi, Deep Purple, Charles Mingus and Pop, Classic rock, Jazz, Blues , aged 55 y.o. or older from Spain took the \"Goodforme\" test for a relevant item by Fender in the 4-String P-Basses category 1 month 1 week ago and scored 99%\n\n99% A male fan of Led Zeppelin, Bon Jovi, Miles Davis, Nat King Cole, Eric Clapton, Stevie Ray Vaughan and Pop, Classic rock, Jazz, Blues , aged 55 y.o. or older from Spain took the \"Goodforme\" test for a relevant item by Fender in the 4-String P-Basses category 1 month 1 week ago and scored 99%\n\n99% A male fan of Michael Jackson, The Who, Bon Jovi, Miles Davis and Pop, Classic rock, Jazz, Blues , aged 55 y.o. or older from Spain took the \"Goodforme\" test for a relevant item by Fender in the 4-String P-Basses category 1 month 1 week ago and scored 99%\n\n99% A male fan of Queen, Aerosmith, Black Sabbath, John Coltrane, Frank Sinatra, Buddy Guy and Pop, Classic rock, Jazz, Blues , aged 55 y.o. or older from Spain took the \"Goodforme\" test for a relevant item by Fender in the 4-String P-Basses category 1 month 1 week ago and scored 99%\n\n99% A male fan of The Rolling Stones, Bon Jovi, Frank Sinatra, Herbie Hancock, Eric Clapton, Buddy Guy and Pop, Classic rock, Jazz, Blues , aged 18-24 y.o. from Spain took the \"Goodforme\" test for a relevant item by Fender in the 4-String P-Basses category 1 month 1 week ago and scored 99%\n\n99% A male fan of Queen, Bon Jovi, Black Sabbath, Guns N' Roses, Miles Davis, John Coltrane, Muddy Waters, John Lee Hooker and Pop, Classic rock, Jazz, Blues , aged 55 y.o. or older from Spain took the \"Goodforme\" test for a relevant item by Fender in the 4-String P-Basses category 1 month 1 week ago and scored 99%\n\n99% A male fan of Queen, The Rolling Stones, Led Zeppelin, Herbie Hancock, Eric Clapton and Pop, Classic rock, Jazz, Blues , aged 55 y.o. or older from Spain took the \"Goodforme\" test for a relevant item by Fender in the 4-String P-Basses category 1 month 1 week ago and scored 99%\n\n99% A male fan of The Who, The Beatles, The Rolling Stones, AC/DC, Gary Moore, John Lee Hooker and Pop, Classic rock, Jazz, Blues , aged 55 y.o. or older from Spain took the \"Goodforme\" test for a relevant item by Fender in the 4-String P-Basses category 1 month 1 week ago and scored 99%\n\n99% A male fan of Queen, Deep Purple, John Lee Hooker and Pop, Classic rock, Jazz, Blues , aged 55 y.o. or older from Spain took the \"Goodforme\" test for a relevant item by Fender in the 4-String P-Basses category 1 month 1 week ago and scored 99%\n\n67% A male fan of Michael Jackson, The Who, Queen, AC/DC, Aerosmith, Buddy Guy and Pop, Classic rock, Jazz, Blues , aged 55 y.o. or older from Spain took the \"Goodforme\" test for a relevant item by Fender in the 4-String P-Basses category 1 month 2 weeks ago and scored 67%\n\n47% A male fan of Rush, John Coltrane, Gary Moore, Stevie Ray Vaughan, Jimmy Page and Pop, Classic rock, Jazz, Blues, Latin , aged 55 y.o. or older from Spain took the \"Goodforme\" test for a relevant item by Fender in the 4-String P-Basses category 1 month 2 weeks ago and scored 47%\n\n69% A male fan of Rush, Deep Purple, Nat King Cole, B.B. King and Pop, Classic rock, Jazz, Blues, Latin , aged 18-24 y.o. from Spain took the \"Goodforme\" test for a relevant item by Fender in the 4-String P-Basses category 1 month 2 weeks ago and scored 69%\n\n70% A male fan of Rush, Deep Purple, Herbie Hancock, B.B. King and Pop, Classic rock, Jazz, Blues, Latin , aged 55 y.o. or older from Spain took the \"Goodforme\" test for a relevant item by Fender in the 4-String P-Basses category 1 month 2 weeks ago and scored 70%\n\n66% A male fan of Michael Jackson, The Beatles, AC/DC, Herbie Hancock, Stevie Ray Vaughan and Pop, Classic rock, Jazz, Blues , aged 55 y.o. or older from Spain took the \"Goodforme\" test for a relevant item by Fender in the 4-String P-Basses category 1 month 2 weeks ago and scored 66%"}, {"url": "https://en.audiofanzine.com/electric-fretted-bass/fender/Pino-Palladino-Signature-Precision-Bass/", "page_content": "Fender Custom Shop Pino Paladino Signature Precision Bass\n\n(This content has been automatically translated from French)\n\nThis bass is made in the USA Custom Shop Fender. His body is alder and maple neck one piece with a superb touch-type reported by Veen and rosewood frets fine. The varnish is thin nitro cellulose. Relic finish with a polished quite worn on the back of the neck and body, a tortoise picguard cellulosic aged and shrunk with a hair shielding sheet aluminum and the hardware somewhat oxidized. The bridge is of type 62 with 4 saddles adjustable for height and distance (intonation). The mechanics are in reverse type. This instrument is rather light a tad less than 4kg. Micro Precision type but are specific to this bass. ELECTRONICS passive to standarts Precision bass or volume and tone. The Pino...…\n\nRead more\n\nThis bass is made in the USA Custom Shop Fender. His body is alder and maple neck one piece with a superb touch-type reported by Veen and rosewood frets fine. The varnish is thin nitro cellulose. Relic finish with a polished quite worn on the back of the neck and body, a tortoise picguard cellulosic aged and shrunk with a hair shielding sheet aluminum and the hardware somewhat oxidized. The bridge is of type 62 with 4 saddles adjustable for height and distance (intonation). The mechanics are in reverse type. This instrument is rather light a tad less than 4kg. Micro Precision type but are specific to this bass. ELECTRONICS passive to standarts Precision bass or volume and tone. The Pino Palladino is mounted with the original strings Thomastik spun flat.\n\n\n\nUTILIZATION\n\n\n\nThe neck is really nice and lets you play longer without getting tired. The bass is well balanced and very comfortable to play. The sonic palette this instrument is fabulous and easily obtained the famous Motown sound that sounds both more rock. This type of string is obviously not for the slap.\n\n\n\nSOUNDS\n\n\n\nThis bass is very versatile and can play all types of modern music. The amp is ideal for this instrument is obviously a B15 or an old Ampeg tube Bassman, but it also works great on a modern system.\n\n\n\nOVERALL OPINION\n\n\n\nI own this wonder for about 2 years. This instrument has really won because it is very enjoyable to play, very expressive and easy to use. If I had to keep a low is certainly the latter that I would keep. The price is a little high, but good when you love .....\n\nSee less"}, {"url": "https://www.andertons.co.uk/bass-dept/bass-guitars/precision-bass/fender-custom-shop-pino-paladino-signature-p-bass-fiesta-red", "page_content": "When your resume includes work with Jeff Beck, The Who, Eric Clapton, Simon & Garfunkel and John Mayer, you're obviously doing something right! And when your bass is as special as legendary session bassist Pino Palladino's, it's no wonder Fender’s Custom Shop chose to reproduce it. The Pino Palladino '62 Precision Bass features a light alder body, a C-shape straight grain maple neck with rosewood fingerboard, custom-wound pickup, tortoise shell pickguard and Thomastik-Infeld® strings - Pino's signature bass is made to his exacting specifications.\n\nWhen you’re one of the music world’s go-to-guys for bass tone you need a versatile guitar that’s reliable and sounds great. Fender’s custom shop have a great reputation for guitars that not only stand the test of time but can handle a heavy gigging schedule without issue.\n\nAuthentic Relicing\n\nDown to the last scratch and nick this guitar has been styled after Pino’s famous rig. The bridge cover screw holes are a reminder that the man himself did away with anything that got in the way of his fingers and each mark tells part of his story. Straight out of its case this bass looks like it’s been there, done that and has the marks to prove it.\n\nPrecision Attack\n\nThe P-Bass is one of the most popular models for bass players across the genres. With great tone and a balanced response across the range it’s a real workhorse. Some of the world’s biggest bands rely on the tone of a precision to drive the rhythm section.\n\nFender Custom Artists\n\nThe world’s greatest artists have come to the Fender Custom Shop for decades in search of their perfect instruments. They are able to offer the same artist instruments to you, built in the same shop by the same skilled craftsmen. Each guitar gets the attention of a master craftsman so when you pick up a custom shop guitar you can see the difference.. They are simply flawless.\n\nSpecifications\n\nModel Name: Pino Palladino Signature Precision Bass®, Rosewood Fingerboard, Fiesta Red\n\nModel Number: 0158200840\n\nSeries: Artist\n\nColor: Fiesta Red\n\nBody\n\nBody Material: Select Alder\n\nBody Finish: Nitrocellulose Lacquer\n\nBody Shape: Precision Bass®\n\nNeck\n\nNeck Material: Quartersawn Maple\n\nNeck Finish: Nitrocellulose Lacquer\n\nNeck Shape: \"C\" Shape\n\nScale Length: 34\" (864 mm)\n\nFingerboard: Rosewood\n\nFingerboard Radius: 7.25\" (184.1 mm)\n\nNumber of Frets: 20\n\nFret Size: Vintage-Style\n\nString Nut: Synthetic Bone\n\nNut Width: 1.75\" (44.45 mm)\n\nPosition Inlays: Dot\n\nTruss Rod Nut: Vintage-Style Slotted\n\nNeck Plate: 4-Bolt Serialized\n\nElectronics\n\nMiddle Pickup: Vintage Split Single-Coil Precision Bass\n\nControls: Master Volume, Master Tone\n\nPickup Configuration: Split Single-Coil\n\nHardware\n\nBridge: 4-Saddle American Vintage Bass\n\nHardware Finish: Nickel/Chrome\n\nPickguard: 4-Ply Tortoiseshell\n\nControl Knobs: Knurled Flat-Top\n\nMiscellaneous"}, {"url": "https://scottsbasslessons.com/blog/pino-palladino-bass-players-you-should-know", "page_content": "Pino lays it down in any style and he’s a master craftsman when it comes to tone. His touch, his sound, his feel, Pino’s got the whole thing going on.\n\nIf you discuss influences with any R&B, pop or jazz electric bassist, I guarantee that the name Pino Palladino will appear 99.9% of the time. During the past four decades, Pino has spread his colossal bass grooves into all corners of contemporary music, in almost every conceivable style and genre. Hailed by many as the British Jaco, his early recordings with Paul Young put expressive fretless bass playing back on the map. He reinvented himself as an R&B wizard in the 90s and evoked the spirit of John Entwistle with The Who in 2002, before easing into his current vintage-vibe with The John Mayer Trio.\n\nBorn in Cardiff, Wales, in 1957, Pino started out on classical guitar aged 14, moving over to electric bass three years later after discovering Motown and Stax Records, along with players like James Jamerson and Jaco Pastorius.\n\n\n\nIn the early 80s he moved to London and landed the bass gig with ex-Squeeze keyboard player, Jools Holland. This was followed by a stint with synth-pop star Gary Numan, before getting his big break as a member of Paul Young’s band. His groundbreaking bass work on the 1983 album No Parlez culminated in a truly mesmerizing piece of fretless playing on Paul Young’s cover of Marvin Gaye’s ‘Wherever I Lay My Hat.’\n\nHere's Pino demonstrating the famous intro to that track.\n\nA steady flow of top session gigs followed working with the likes of Go West, Elton John and David Knofler, peaking with another standout fretless performance on Don Henley’s ‘New York Minute’...\n\nIn an interview with the Guardian, Pino opened up about this part of his career.\n\nIt's about the song, the timing, all sorts of factors, but there are quite a few artists I've worked with where I've contributed more than they would have expected, such as coming up with sub-hooks that make the record better. It certainly worked for me; for a few years people were phoning from all over the world wanting that sound.\n\nAs the 1980s drew to a close the sound of Pino’s fretless MusicMan StingRay had become almost mandatory among studio producers of the day, with Pino often called in purely to overdub his sound over existing fretted bass tracks. One of the world’s premier fretless bassists had well and truly arrived.\n\n\n\nNow it's easy to think that Pino is simply what we could refer to as a \"groover\". A bass player that is happiest in the background simply holding down the lowend and making the band, well, groove. And while that may be somewhat true, unknown to some, Pino has formidable chops and facility on the bass and can certainly solo with the best of them.\n\n\n\nJust check out Pino's blazing solo fretless lines on his 5 string Musicman Stingray with Manu Katche on drums and Dominic Miller on guitar.\n\nAnd here you can hear that soloing is not something he only saves for his 5 string, as he weaves his way around his trusty Musicman 4 string with ease.\n\n\n\nPino has played a number of basses during his career, but his trademark fretless sound came from his much loved Music Man StingRay, which he bought from Sam Ash music in NYC. He’d tried out a few fretted Music Man basses before but thought they sounded too trebly, but with this particular bass, which I think is a 1979 sunburst model with a rosewood board, he found a warmer more versatile sound and the rest is history.\n\n\n\nOther basses in his early career included a fretless Pedulla and a Warwick Thumb, but his move back to playing more vintage-style fretted basses was led by a number of P Basses from the early 60s, one of which the Fender Custom Shop chose to reproduce for his signature model, complete with Thomastik-Infeld strings. He also plays a Moon Bass, which he used extensively for the D’Angelo Voodoo tour back in 2002. And as for his strings, he uses Rotosound Swing Bass stainless steel mediums, which he prefers for the fretless sound, and Thomastiks or La Bella heavy gauge flatwounds for the P Bass.\n\nPino's Fender Signature P-Bass\n\nAside from his StingRay, Pino’s fretless sound also became synonymous with a Boss 0C-2 octave pedal, which can really be heard on Paul Young’s I’m Gonna Tear Your Playhouse Down.\n\nPino continued to bolster his CV during the 1990s with sessions for the likes of Eric Clapton, Seal, Elton John, Tears for Fears, David Gilmour, Chaka Khan, Pete Townsend and Joan Armatrading, and jazzers such as Al Di Meola, John McClaughlin, David Sanborn and Chris Botti.\n\n\n\nIt was also around this time that he resurfaced in full on R&B groove mode, hitting unbelievable new heights with the epic 2000 recording, Voodoo by D’Angelo.\n\n\n\nThe album’s greasy, laid back feel caused a huge buzz among rhythm sections everywhere, and led to a who’s who of hip hop artists summoning Pino and his 1963 P Bass to their studios. Just listen to how Pino's killer bass line on Chicken Grease sits so lazily in the back of the pocket. Pino is also all over D’Angelo’s 2014 album, Black Messiah, Erykah Badu’s Mama’s Gun and Aijuswanaseeing by Musiq (Soulchild) which all serve as an amazing schooling in the way of the lowend.\n\n\n\nAs the world ushered in the year 2000 Pino was about to reinvent himself yet again. Here's a quote directly from Pino:\n\nIt's important to be able to reinvent what you do. When the call came to play with The Who I was working with Erykah Badu and D'Angelo, and I had to change my whole style. The manager said: 'John [Entwistle] is dead. Can you do a gig at the Hollywood Bowl in three days' time?' You don't turn down something like that. It was only afterwards that I thought about the consequences. Pete Townshend's direction was, 'Play whatever you want, just as long as you play loud!'\n\nThe early 2000's saw Pino filling the bass chair with Simon and Garfunkel on their 2003 reunion tour and he was also drafted in for heavyweight album sessions with the likes of Adele, Ed Sheeran and even Nine Inch Nails. It was during this steady schedule of studio work that Pino took a call that would once again cement his place as one of the most admired bassists in contemporary music.\n\n\n\nWhen bassist Willie Weeks was unable to make a John Mayer gig for the Tsunami Aid benefit concert in 2005, drummer Steve Jordan suggested they call Pino and the rest is history. Countless tours and stadium gigs followed, with the band’s chemistry captured brilliantly on the 2005 live album, Try! And again on the 2008 live DVD, Where The Light Is.\n\n\n\nJust check out the amazing chemistry between Pino, John and Steve on \"Who do you think I was\" to say it's a perfect demonstration of how in the pocket a trio can be would be an understatement, and please, let's just give it up for Steve Jordon on this one, surely one of the coolest drummers in history."}], "Pino Palladino's signature bass sound is characterized by a 'slap' technique.": [{"url": "https://www.udiscovermusic.com/stories/pino-palladino-interview/", "page_content": "Photo: Cedric Ribeiro/Getty Images\n\n“All musicians are the same, we all think we’re rubbish,” Pino Palladino told a British television interviewer in 2013, adding a gentle laugh. It was a typically massive understatement from the quietly affable Welsh bassist, among the highest-regarded session players in the music industry. In this case, Palladino was referring to hearing Paul Young’s “Wherever I Lay My Hat” on the radio for the first time in 1983 – particularly his casual contribution, one of the most recognizable bass lines of the 1980s. “I was worried that it sounded a bit out of tune,” he said.\n\nIn a decades-long career, Palladino has not only provided low-end support for several musical revolutions, he’s helped stoke a few of them himself, undergirding pioneering sounds in pop, New Wave, neo-soul, electronic, rock, jazz, funk, and even industrial with an ever-inventive foundation. He’s widely regarded as one of the most influential bass players ever, with just as much name recognition in certain quarters as the superstars he’s backed.\n\nBeginning with Gary Numan in 1982 and continuing through work with artists like Young, Phil Collins, Tears for Fears, Go West, and Chris de Burgh, Palladino helped define the coolly emotive 80s sound with his trademark fretless technique. In the 1990s he backed Elton John, Eric Clapton, Carly Simon, Bryan Ferry, Joan Armatrading, B.B. King, and many more, before joining the legendary Soulquarians artists collective, reviving cosmic soul and funk sounds with Erykah Badu, D’Angelo, Questlove, and J. Dilla.\n\nADVERTISEMENT\n\nFrom there, it was on to stints with Mika, Nine Inch Nails, Adele, Kelly Clarkson, Paul Simon, and Keith Urban, among a wealth of others, as he also embarked on longtime touring associations with Jeff Beck and John Mayer. Palladino’s most famous stretch came with The Who, when he stepped in after John Entwistle’s untimely death in 2002 to tour and record for two decades, playing probably the most famous bass solo in pop – 1965’s “My Generation” – for arena-sized crowds. Most recently, he’s played for Harry Styles, Ed Sheeran, Corinne Bailey Rae, and John Legend. You can’t talk about Pino Palladino without mentioning a few names.\n\nNow, at last, Pino Palladino is releasing an album of his own, collaborating with guitarist Blake Mills. Called Notes with Attachments, the record summons intimate, cinematic moods, bristling with sophisticated patterns, atmospheric woodwinds, and surprising electronic touches. It’s a compendium of several decades’ worth of Palladino’s compositional ideas, complex, and contemporary yet warm with nostalgia – paying homage to the classic film soundtracks, cool jazz, and Burt Bacharach arrangements he loves.\n\nIn honor of the new release, we accompanied the lauded bassist on a trip down memory lane, revisiting some of his best-known album and tour appearances.\n\nTear for Fears, Seeds of Love (1989)\n\nPino Palladino: I have a lot of great memories of that album, not least because my daughter Fabiana was born around the time we were recording it. My life was changing in a big way. I had been doing a lot of session work with the French drummer Manu Katché, who toured with Peter Gabriel. We were becoming known as a rhythm section together, and a bit in demand. I believe that’s how Roland Orzabal heard of us and invited us onto the album.\n\nThe actual recording was unusual for the time; the tracks were cut live with a full band. We holed up together for a few weeks in Townhouse Studios in London, and went through each of the songs, experimenting with instrumentation and arrangement. There were some days when we just jammed and extended parts of the songs. Roland then took the whole bundle and edited it down into what you hear on the album. We must have recorded “Badman’s Song” and “Woman in Chains” a dozen different ways with different transitions. Roland’s choices and his taste as the composer, defined the amazing end results.\n\n\n\nWatch this video on YouTube Click to load video\n\nOne of my fondest memories: When I first got there, I was going into the control room and I heard this incredible piano-playing in the studio. I was wondering, “Who is that?” I went round the corner and there was Oleta Adams, sitting at the grand piano and singing so beautifully, jamming away on gospel and blues. I’m honored to have played on her solo album Circle of One.\n\nThe Seeds Of Love can be bought here.\n\nElton John, The One (1992)\n\nPino Palladino: We recorded in Paris at Studio Guillaume Tell. Well, the food in Paris was excellent. We would end every day going out to dinner at high-end restaurants with the table piled up with dishes. It was really something to keep up with…but I rose to the challenge!\n\nWorking on that record and spending time with Elton was humbling. I remember one day, Bernie Taupin faxed some song lyrics over in the morning, and Elton took them into the next room and had an amazing song written within an hour…incredible! At this time I was really known for my fretless bass sound, it was something people specifically hired me for. Elton encouraged me to develop my ideas for the basslines and let me do my thing on the record.\n\n\n\nWatch this video on YouTube Click to load video\n\nErykah Badu, Mama’s Gun (2000)\n\nPino Palladino: This was during the Soulquarians period, it was a real fun time. I made the connection because Ahmir [“Questlove” Thompson] had called me in to add to one of the songs he was working on. We thought I would just overdub the bass on one track, but it felt really good and we built up a vibe. Erykah had booked time at The Lady and we reconvened at a later date.\n\nErykah’s way of working was refreshing. For Mama’s Gun, Erykah had sketched out a couple ideas for the album, and had a vision of what she wanted, but otherwise it was pretty undetermined at that point. We all assembled, the whole band, and Erykah just came around, so cool in her way, and asked “OK, Pino, what you got?” That was it. “What you got?” We played around with some different ideas, and it turned into a collaboration, developing the songs together. I played a bassline I had in my mind for a while, and that became the first song on the album, “Penitentiary Philosophy.”\n\nOddly enough, it reminded me of when I was getting started, working with Gary Numan on the I, Assassin album in 1983. Back then, I showed up and Gary had recorded his songs but didn’t have bass parts on them. He wanted me to come up with ideas and gave me complete freedom to compose the parts for the songs. I played my fretless bass and that sound became the sonic signature for the record. What made it different with Erykah, is that this time I got a songwriting and production credit.\n\nListen to Mama’s Gun here.\n\nD’Angelo, Voodoo (2000)\n\nPino Palladino: Being a part of that moment when this album and Mama’s Gun came out almost back to back was thrilling. After meeting D on a session with B.B. King, he invited me to meet him and his engineer, Russ Elevado, at Electric Lady Studios with a view to me playing some bass on the songs for his upcoming record, Voodoo.\n\nWhen they played some of the songs for me, I was mesmerized by the unique feel of the grooves and D’s otherworldly vocal arrangements. D’Angelo had written the songs for Voodoo at the keyboard and while his left hand would play what would become the blueprints for the basslines, his right hand plays the chords and flourishes that accompany the main melody. It all fits together in such a unique way… The basslines are woven into the fabric of the composition from the start.\n\n\n\nWatch this video on YouTube Click to load video\n\nAlthough some songs were established when I got there, others were left more open to develop ideas and for me, some freedom of expression, from adding in passing notes to flurries up to the top of the bass neck to complement his vocals. Because the album is so bass- and rhythm-driven, everything mattered, it was all at the top of the mix, he encouraged me to bring my thing to the music and, through him, I met Erykah, Quest, James Poyser, Roy Hargrove, J Dilla, Common, and all the Soulquarian collective.\n\nListen to Voodoo here.\n\nAdele, 21 (2011)\n\nPino Palladino: I was back in London when [producer] Rick Rubin reached out to me about recording a new album for Adele. She had already made a name for herself in the UK before she broke worldwide, so I had heard of her. Rick told me, “I want to get you into this fantastic band, with drummer Chris Dave, Matt Sweeney and Smokey Hormel on guitars, James Poyser on piano, and really give her the strong backing she deserves.” I flew out to Shangri-La studios in California where they were recording, and she just killed it on the vocals from the start. I remember hearing her voice for the first time through my headphones and being blown away by how she could sing. The songs were really great and I knew we were recording something special.\n\nMika, The Origin of Love (2012)\n\nPino Palladino: Mika has certainly got some incredible energy, he would bounce around the studio with all these ideas. Mika brought a lot of curiosity to the process, he would come up with things while I was playing. He was interested to hear fretless bass on some of the songs and liked how it fitted in. I believe I was hooked up with him through Nick Littlemore from Empire of the Sun. Working on a more electronic-oriented pop album was interesting. It’s great to get the opportunity to expand what you do, and try out different directions.\n\n\n\nWatch this video on YouTube Click to load video\n\nNine Inch Nails, Hesitation Marks (2013)\n\nPino Palladino: Trent [Reznor] reached out to me, out of the blue, and asked if I would be interested in collaborating on a couple of tracks for the album. I was really curious how I would fit in with his sound. Trent is a very good communicator, with clear ideas. He is a fan of Voodoo and of Gary Numan, so for me that was interesting as I could maybe bring two different sides of my playing to the music. I played a couple of takes on each song and just did my thing. Later, Trent’s manager called and asked if I would be interested in touring. It turned out that the band had already been rehearsing for a month. It was a real challenge to learn the songs in a short amount of time before we went on the road. And I had no idea how his fans would react to me. But Trent gave me a lot of room, and that ended up being a memorable tour. The whole band was so tight, and the light show, along with the visual effects, was on another level from anything I’ve been a part of.\n\nThe Who, Endless Wire (2006) and touring after John Entwistle’s death\n\nPino Palladino: In 2002, I was working on Common’s Electric Circus album and I was about to fly home to London from Philadelphia, when my wife called me at the hotel and said, “You just got a call from the Who’s management” She gave me the tragic news that John Entwistle had just died, and they wanted to know if I could step in so they could continue the tour. There was going to be a concert at the Hollywood Bowl a few days later. After speaking to their management, I flew to LA later that day to rehearse for the gig and the following tour.\n\nI had spent some time with John. He was smart, funny, charismatic. He was a superstar. And, of course, an idol as far as bass-playing goes. I had worked with Pete [Townshend] as well, and Roger [Daltrey]. When I flew into LA, Pete was waiting for me at the hotel with a stack of CDs. “Just learn what you can,” he told me. Stylistically, I was not in that space at all at the time – I was doing hip-hop, funk, soul. So it was a complete reset for me. The first thing I did was change the strings on my bass to get a brighter sound, like John had. I pretty much didn’t sleep that night, and learned as much as I could. I think I pulled it off, because they kept me on!\n\nI just worked on their recent record [2019’s WHO]. Endless Wire was the first studio record they made after John’s tragic death, and that was less of a “band” experience. Pete had done a number of demos, obviously some with John in mind to a certain degree. I’d ask Pete if I was doing all right, and he would turn to me and say, “Play more.” He didn’t elaborate, just “play more.” And I understood. Some people would think of it as overplaying, but the classic sound of The Who is Keith Moon on drums and John Entwistle on bass just making this unholy racket. So that’s what I aimed for.\n\n\n\nWatch this video on YouTube Click to load video\n\nHarry Styles, “Watermelon Sugar” (2020)\n\nPino Palladino: I was rehearsing with John Mayer at Henson Studios in Hollywood, which was the former A&M Studios, and before that the Charlie Chaplin Studios. Beautiful history there. Harry was recording in the same studios, down the hall. John knew him and introduced me to Harry. Harry and his producers played me a few songs to see which ones I felt I could add to, including “Watermelon Sugar.” If you listen to the bass line in that song, it’s very well-defined and echoed by the guitar line. There wasn’t really a lot of room to move. Well, I started getting a little free with it, trying stuff, and Harry jumped up and said, “That! Can you do more of that?” It’s an honor that I get invited to play on these songs. It’s going to be a hit with or without me. So I feel very fortunate to be asked to contribute.\n\nPino Palladino and Blake Mills, Notes With Attachments (2021)\n\nPino Palladino: This record is a culmination of what I’ve been thinking about through much of my career. I’ve been recording many of these ideas over a long period of time as I’ve toured and collaborated with many musicians and artists that I admire. What interested me in making my own album was having the chance to focus on compositional elements, rather than the bass taking the lead. Maybe some listeners have been surprised that there are woodwinds and other instruments in the foreground. It’s not me showing particular prowess on my instrument, but to define the role of the bass as a signature part of a song is the challenge I enjoy. I’ve always loved instrumental music, from jazz to film soundtracks. I want my music to invoke some of those qualities.\n\nSome of the ideas on the album evolved from my time touring with D’Angelo and the Soultronics, that kind of beat-driven music, but with beautiful elements and touches, but also from many other types of music that I love. When I played some of these ideas originally for Blake, he was very encouraging and, as we started working on the songs, it quite naturally became a collaboration. Blake, along with all the incredible musicians on the record, have all given so generously to the project, I’m very fortunate to have had the opportunity to make this album. It’s a very interesting process for me, having my own music released. It feels like part of my DNA is suddenly out there. The album was recorded two years ago. But people have told me that it speaks to the moment, that they’re listening to it through this complex time and enjoying it. That’s really nice to hear.\n\nListen to Pino Palladino and Blake Mills’ Notes with Attachments here."}, {"url": "https://www.allaboutjazz.com/musicians/pino-palladino", "page_content": "Pino Palladino was featured on Gary Numan's 1982 album I, Assassin, in which his fretless bass sound made a prominent contribution to the overall sound of the album. He went on to play fretless bass with a healthy number of high-profile artists that include (on the short list), David Gilmour, Tears for Fears, Pete Townshend, Peter Gabriel, Joan Armatrading, Phil Collins, Chaka Khan and Don Henley.\n\nPalladino began playing the electric guitar at age 14. By age 17 he decided to play the bass guitar, and bought his first fretless bass one year later, playing mostly R&B, funk, and reggae within a rock and roll backbeat. His first professional gig was at a local television station in Cardiff, where he began playing in 1978. That same year, at age 20, he joined Jools Holland's band and recorded with Holland on his album entitled, Jools Holland and His Millionaires. Palladino toured with Jools to support the album, which gave him the opportunity to purchase his own Music Man StingRay Fretless Bass. Holland was touring with another new band; the Q-Tips, whose frontman, Paul Young made acquaintance with Palladino whilst they were on tour, who would, a year later offer Pino a place in his own backing band.\n\nPalladino has joined several bands and ensembles through which he is most visible. He joined jazz trumpeter Roy Hargrove in forming The RH Factor, a band that mixes elements of soul, jazz, and R&B. He is a member of the John Mayer Trio, and was the first choice by Pete Townshend and Roger Daltrey to fill the position left by John Entwistle as the current bassist for The Who.\n\nPino Palladino (17 October 1957 in Cardiff, Wales, UK) is a Welsh bass guitarist of Italian ancestry. Palladino rose to public notice playing primarily rock and roll, blues rock, and rhythm and blues music, although he has been lauded for his ability to play most genres of popular music, including jazz, neo soul, and funk. Adding to his eclectic grasp and melodic approach on his instrument, he has become one of the most sought-after session players on the bass in the music industry. He has played on a large number of recordings by some of the world's most successful entertainers, in part, by mastering a variety of techniques on both his late 1970s fretless Music Man StingRay bass guitar and later in his career, adding fretted Fender Precision and Jaguar basses. His playing has earned him custom instruments bearing his name.\n\nAfter vocalist Paul Young landed his own solo contract, Palladino was brought in as part of his backing band \"The Royal Family\" in 1983 with noticeable chart success with the No Parlez album, and major hit singles both in the UK and Europe. Examples of Young's new found success were the band's cover of the Marvin Gaye classic \"Wherever I Lay My Hat (That's My Home)\", which reached No. 1 in the UK singles chart for three weeks in the summer of 1983, and \"Love of the Common People\". Palladino toured extensively at this time with Paul Young, remaining in the band for five years. 1983 additionally proved to be the year of another ensemble featuring Palladino, Paul Rodgers (formerly of Bad Company, drummer Kenney Jones, along with a rotating cast of other celebrity performers. The band only released one album through Atlantic; The Law, although there were enough out-takes that another bootleg-styled album followed in 1991. Sales were unremarkable, despite the names of those who recorded on the album.\n\nThroughout the 1980s Palladino was noted for his R&B roots on the fretless bass, even when supporting pop and rock heavy performers. One reviewer from Bass Player magazine points to Paul Young’s cover of the Bobby Womack/Rufus tune \"Stop On By\" (on 1990’s Other Voices), with its \"pre-hip-hop, swung funk groove\" as the precursor to Palladino's later neo-soul focus.\n\n1990s Changes in instrument\n\nIn the 1990s, Palladino began to alternate between the sounds achieved in playing the fretless bass to one with frets, as well as the 4-string and 6-string bass. At the time, he was well known within the industry for his fretless bass sound. However, now, depending on which artist he was supporting, and the song to be played, he began gravitating towards fretted bass. He was maturing as a musician, and played with artists as diverse as Melissa Etheridge, Richard Wright, Sir Elton John and Eric Clapton. Also in 1991 he joined Paul Rodgers (of Free, Queen+ Paul Rodgers, and Bad Company fame) to form the band The Law. In the mid 1990's, Palladino played bass for The London Metropolitan orchestra during their recording of \"An American Symphony\", soundtrack for the movie Mr Hollands Opus.\n\nPalladino supported Phil Collins, as a member of the house band for the Golden Jubilee of Elizabeth II, which played with Sir Paul McCartney, Eric Clapton, Cliff Richard, and Tony Bennett, among other notable performers. He later wrote that he felt privileged to have been amongst the others on stage in such an event.\n\nIn 1999, he began working with Richard Ashcroft, of The Verve, during the recording sessions of Ashcroft's debut solo album, Alone With Everybody. Richard proved to be mightily impressed by Pino's natural bass playing ability;\n\nThis Pino Palladino, I can say a Meters record and he can play me the bass line. He can play anything. He's one of the only people in the world who can totally replicate that kind of Beach Boys/scratch/Walker Brothers bass. You can get that sound if you want it, dead on. So it was very liberating working with him.\n\nPino also joined Ashcroft's touring band for the singer's first major solo outing throughout 2000.\n\nNeo Soul\n\nBy the mid- 1990s, Palladino had established himself as a busy, highly desirable bassist and a studio worker in many genres, but finally became visible to those artists who played largely left of center, and demand for his session playing grew within a different quarter. Palladino began moving from blues-rock toward neo soul projects. Palladino and Steve Jordan found themselves performing on the same session for B.B. King’s 1997 duets CD Deuces Wild. It was the first time soul singer D'Angelo first heard Palladino, who had just switched from a signature sound fretless bass sound to that of performing with fretted basses. The result was an invitation to \"use Pino’s big, behind-the-beat bass to help cast a neo-soul spell on his Grammy Award-winning Voodoo album\". It would not be his first uncredited Grammy performance.\n\nAs the word spread throughout the genre, Palladino found an increasing demand within the neo-soul genre. Examples of his bass work in this genre (in addition to D'Angelo) includes Mama's Gun, and \"Penitentiary Philosophy\" found on Erykah Badu’s 2000 CD. Other albums using Pino's sound include 1st Born Second for Bilal, Like Water for Chocolate and Electric Circus for Common. Palladino has been described by Steve Jordan, who got his own professional start playing the drums for Stevie Wonder as having a \"deep funk\" side and a \"melodic\" side. Palladino admits, that \"Of all my influences, I would say what’s always in the back of my mind is early Stevie Wonder, like Talking Book and Innervisions; that music is really in my blood.\"\n\n2000s\n\nFollowing the death of The Who's bassist John Entwistle in 2002, the eve before the band were to kick off their first world tour in years, Palladino was their first choice to become the band's full-time touring bass guitarist, and by 2006, he was invited to join the remaining original band members in recording their first album in twenty-four years. Pete Townshend, the band's composer, recorded the bassline on the majority of the songs to get the effect he himself wanted, with Palladino doing so on the other six of them. Released in October 2006, the album was named Endless Wire.\n\nPalladino also recently played with The Who at the Super Bowl XLIV half-time show, in February, 2010, alongside other backing artists: Simon Townsend on guitar, Zak Starkey, drums and percussion, and John \"Rabbit\" Bundrick, on keyboard instruments.\n\nPaul Simon\n\nIn 2003, Palladino intended to go down to see his old friend Paul Simon and meet Brian Eno for the first time. He was asked to record with them, and had to borrow a bass guitar to play. The result was that he played with Simon and Garfunkel on their \"Old Friends\" reunion tour and in an interview with Bass Player Magazine he mentions drummer Steve Gadd and percussionist Jamey Haddad \"had laid down some great grooves for me to add bass\". He had kept the recordings, and by the time that he appeared on the Old Friends: Live on Stage CD and DVD from the tour, he was able to use some of the material. He played on Paul Simon's 2006 release, Surprise.\n\nOther appearances\n\nPalladino has toured in the backing band for Joe Walsh. In 2004 he appeared to be playing with Gary Moore at the Wembley Arena.\n\nEmergence of the John Mayer Trio\n\nPalladino met Steve Jordan in the mid-1980s while both were working as session players on many occasions, which blossomed into a friendship. When their work brought them to the same place, they would meet, usually jam together, and introduce other musicians to one another, forming friendships which sometimes blossomed into good working relationships. Jordan has remained keen about Pino since he met him, and only grows more enthusiastic about his talents, which he describes partly as his love for, and ability to \"feel\" changes in music, through melodies, basslines, and an amazing connection with genres of nearly every kind. According to Jordan, he'd planned to meet up with John Mayer and Willie Weeks in January, 2005 to perform a benefit concert on a NBC sponsored telethon Tsunami Aid: A Concert of Hope to raise funds and public awareness benefiting victims in the aftermath of the tsunami that struck southeast Asia. Weeks was unable to make the performance, and Jordan suggested Palladino, who had heard some of Mayer's work, and was willing to come. Beginning a set that included the Jimi Hendrix classic, \"Bold as Love\", the three all agreed that they experienced such chemistry that they began talking right away about arranging their schedules to record a CD and a tour. The trio released the album Try!, on November 22, 2005. The eleven-track live album includes cover songs, such as Jimi Hendrix's \"Wait Until Tomorrow\" and \"I Got A Woman\" by Ray Charles, two songs from Mayer's release Heavier Things, as well as new songs written by Mayer. In addition, Mayer, Palladino, and Jordan wrote three songs on the album: \"Good Love Is On The Way\", \"Vultures\", and \"Try!\". Along with John Mayer on guitar and vocals, and Steve Jordan on drums, Palladino has toured and recorded as a member of the John Mayer Trio, and on Mayer's third album Continuum.\n\nRecent tours\n\nIn spring of 2006, Palladino toured with Jeff Beck. He also played with J. J. Cale, and Eric Clapton on their 2006 album The Road to Escondido, alongside other notable musicians, including Derek Trucks, and Billy Preston. It was to be Preston's last work before he died only days afterward.\n\nInfluences on bass guitar\n\nInfluences for Palladino for bass guitar include Motown bassist James Jamerson; Stevie Wonder’s keyboard-bass, jazz innovator Jaco Pastorius; British folk/rock upright bassist Danny Thompson; Norman Watt-Roy (of Ian Dury & the Blockheads); Larry Graham; Michael Henderson; Bootsy Collins; Paul Jackson; Anthony Jackson; Doug Rauch (of Carly Simon and Santana), and Billy Cobham.\n\nTechnique\n\nPino Palladino is noted for his use of the fretless bass in many 1980s chart records. While it was typical for a bass guitar in a commercial track to have a rather generic sound and stay \"playing the low notes\" Palladino preferred a different sound (combining fretless tone with an octave effect) and basslines that frequently added chords, lead lines and counter melodies in the higher range of the instrument as opposed to simply the aforementioned \"low notes\". Typical of this style was his playing on Paul Young's biggest chart hits, in particular his bass solo on \"Wherever I Lay My Hat (That's My Home)\". His equipment at that time included a fretless Music Man StingRay Bass 1979 and Boss Octave pedal (OC-2).\n\nPino Palladino signature model\n\nThe Fender Pino Palladino Signature Precision Bass is modeled after two of Pino's Fender Precision Basses. The body featuring faded fiesta red paint over desert sand paint is based on Pino's 1961 Precision Bass while the neck shape and round-lam rosewood fret board are based on Pino's 1963 sunburst Precision Bass.\n\nRecent projects\n\nPalladino joined Eric Clapton's touring band for 11 dates in the Eastern U.S. and Canada in May 2008. Current work has included work on an with Clapton and Robbie Robertson, and Palladino guested on bass for Amos Lee on his third album, Last Days at the Lodge.\n\nIn 2009, Palladino joined with keyboardist Philippe Saisse and Simon Phillips to form an instrumental trio: Phillips Saisse Palladino, an instrumental jazz/funk rock ensemble, which have toured Europe through 2009 into 2010, playing songs that spotlight the talents of each performer, in the manner of many jazz outfits. Show less"}, {"url": "https://knowyourbassplayer.com/2015/03/10/2015-3-10-pino-palladino/", "page_content": "Fretless Pino Courtesy of Music Man Com Fretted Pino Courtesy of Fender Com\n\nBy Thomas Semioli\n\nHe’s the cat who orchestrated the fretless takeover of the instrument in the 1980s/90s. Then he commandeered the triumphant return of the fretted Fender Precision in the 21st century.\n\nFor nearly forty years and counting, the chameleonic Giuseppe Henry “Pino” Palladino has been among the most in-demand session and touring bassists on the planet. Greatly inspired by classic rhythm & blues and American soul music, Pino mostly plies his craft with frets nowadays, utilizing a vintage 1961 Precision which has been replicated for the masses by way of Fender’s signature bass series.\n\nPino’s genre traversing work spans Paul Young, D’Angelo, John Mayer Trio, Don Henley, Adele, David Gilmour, Jeff Beck, Nine Inch Nails, The Who, and Herbie Hancock, among many other high-profile artists.\n\nPalladino’s use of a an “octaver effect” (Boss Octave O2 pedal) on his fretless MusicMan Stingray set a precedent for the instrument in a pop context throughout the Regan / Thatcher years. On the hits (such as Melissa Etheridge’s “Come to My Window” and Paul Young’s “Every Time You Go Away”) and the album tracks – Pino almost always rendered an upper register motif which severed as a main or secondary hook to the composition.\n\nHis work on D’Angelo’s Voodoo slab in 2000 reignited interest in the fretted Fender Precision bass which continues well into the present day.\n\nPino Palladino Sound & Vision…\n\nD’Angelo “Chicken Grease” https://youtu.be/m4XI6LXCsH8\n\nPaul Young “Every Time You Go Away” https://youtu.be/nfk6sCzRTbM\n\nMelissa Etheridge “Come To My Window” https://youtu.be/Gk4CwPQCbAE\n\nGary Numan “Music for Chameleons” https://youtu.be/_586NoZSr-Y\n\nErykah Badu “Cleva” https://youtu.be/XO0KY6Fry5M\n\nEric Clapton “Bad Love” https://youtu.be/qY2vjv8aEas\n\nThe Who Quadrophenia Live https://youtu.be/9NEQb6LdHGQ"}, {"url": "https://bassguitarshack.com/pino-palladino-bass-superman/", "page_content": "One of the most respected and admired bass players in music today, Pino Palladino has such an array of amazing bass chops and feel that it’s almost ridiculous. Pino’s ability to fit his unique style into any type of music and not only make it work but make it sound great is a rare skill indeed. It’s the combination of these qualities that make Pino Palladino a bass superman.\n\nThe complete package, Pino can make it funky, melodic, and anything in between all the while serving the song perfectly. Never getting in the way of the other musicians, Pino always adds just the right feel to the track.\n\nPino Palladino’s early years\n\nBorn in Cardiff, Wales on October 17, 1957, Palladino originally started on guitar, but at age 16 he picked up a friend’s bass and realized that this was the instrument for him. Soon after, he bought a Fender Precision. Not long after that, he begins his journey as a professional bass player.\n\nHeavily influenced by James Jamerson , Stevie Wonder, Michael Henderson, Jaco Pastorius, and Paul Jackson, Pino begins to develop his own personal style and technique. After playing for a local Cardiff television station, Pino moves to London in 1980 to join a band led by Jools Holland of Squeeze. As Pino began to make a name for himself in London, he soon became a highly sought after session player.\n\nIt was around this time that Pino began using a fretless Music Man Stingray (another company started by Leo Fender). His highly expressive lead fretless bass line for Paul Young’s cover of “Wherever I Lay My Hat (That’s My Home)” became an instant classic. Pino also worked with Gary Numan on his album I, Assassin. Numan has stated that he was blown away by Palladino’s amazing bass playing. He’s also said that his unusual fretless tone defined the album with its atmospheric and dreamy quality.\n\nPino leaves the fretless behind and meets D’Angelo\n\nIn the early 1990s, Pino switched from his fretless Musicman Stingray to a fretted sunburst 1963 Fender Precision bass with La Bella flatwound strings. The change was both a musical and personal decision. Pino had grown tired of the lead fretless sound, and he also felt the need to return to his love of the old R&B and soul bass sound.\n\nAfter recording an album with Tom Jones and B.B. King, Pino caught the attention of neo-soul artist D’Angelo who was looking for a certain bass sound for his new album, Voodoo. Palladino’s greasy, fat, laid-back grooves on his ’63 P-Bass gave the recording an old-school vibe that had a large impact not only on bassists but on entire rhythm sections in general. This led to many more session jobs in the neo-soul style for the now very in-demand bassist.\n\nPino’s uncanny ability to adapt to any style and make it his own is what truly sets him apart from the ordinary session bassist. His amazing feel and intuition allow him to be both expressive and tasteful with his bass lines. Pino has stated that he has something he calls “trust chops,” instincts that help him figure out what to play through difficult sections.\n\nNew Directions with The Who\n\nAfter the untimely 2002 death of the great bassist John Entwistle, the surviving members of The Who asked Palladino to play bass for the remainder of their tour. He’s now their permanent bassist. Having played with Pete Townshend and Roger Daltrey previously made this very daunting task a little easier for him, Palladino also personally knew Entwistle.\n\nFor The Who gig, Pino started with both Fender Precision and Jazz basses, finally settling on Fender Jaguar basses, which he likes for their powerful cutting tone. He has said many times that playing with The Who is like a dream come true, and sometimes he can hardly believe that he’s on stage with them.\n\nPino has stated that Pete Townshend had given him full freedom with the bass lines, although he tries to keep them as faithful to John’s original lines as possible. In 2003, Pino started working with Paul Simon for his tour and recorded an album with him in 2006. For this gig, he used his fiesta red 1961 Fender Precision with flatwound strings.\n\nPino’s recent work – and into the future\n\nPino Palladino’s signature Precision Bass\n\nPalladino has also had the great honor of having Fender issue a signature bass in his name. The Fender Pino Palladino Precision Bass is a Custom Shop creation featuring a body modeled after his ’61 Precision and the neck shape after his ’63 P-Bass. The bass is finished in fiesta red over desert sand and given the relic treatment by the Custom Shop craftsmen.\n\nThe John Mayer Trio and many others\n\nDuring the Tsunami Aid benefit concert in 2005, Pino met guitarist John Mayer through drummer Steve Jordan. After original bassist Willie Weeks was unable to perform, Pino was asked to fill in for the concert. The three hit it off well in the studio. Pino later stated that there was instant chemistry between the three musicians. They later decided to form a power trio and set up some tour dates. The John Mayer Trio was born, and this gave Palladino a new opportunity to add creatively in a band context.\n\nIn 2006, Pino joined Jeff Beck for a tour and also worked with Eric Clapton, J.J. Cale, Derek Trucks, and Billy Preston on an album. He’s also played with Robbie Robertson and Herbie Hancock and worked on a follow up to the Voodoo album with D’Angelo entitled Black Messiah.\n\nAs clear evidence of Palladino’s vast range and versatility, in 2013 he played on the Nine Inch Nails album Hesitation Marks and toured with the band as well.\n\nPino Palladino is probably the most sought after bassist in music today and for good reason. His bass chops, great tone, and musical instincts are unparalleled in the industry. We look forward to more great work from Pino for many years to come."}, {"url": "https://www.guitarworld.com/features/pino-palladinos-best-bass-lines", "page_content": "Quite possibly the world's most famous working session bassist, Pino Palladino has built a career as the ultimate supporting player: providing a Stravinsky-inspired fretless performance on Paul Young’s ‘Wherever I Lay My Hat,’ contributing to D’Angelo’s landmark album Voodoo, replacing the late John Entwistle in The Who, touring with the John Mayer Trio, and much more.\n\n\n\nPino has come to encapsulate everything that a sideman should be. “The sideman role just came out of me playing on records that people heard and liked,” says Pino. “It's not something I planned or even dreamt of.”\n\nJoin us, then, on Pino’s 65th birthday, as we list the songs that prove he is a true bass genius.\n\n(Image credit: Photo by Chris McKay/WireImage)\n\nWherever I Lay My Hat - Paul Young (1983)\n\nNo one did more to promote expressive bass playing back in the '80s than Pino Palladino. His big break came as a member of Paul Young’s band, culminating in a truly amazing piece of fretless bass accompaniment to one of Young’s biggest hits, his 1983 cover of Marvin Gaye’s ‘Wherever I Lay My Hat.’ In this clip Pino breaks down his soaring fretless line.\n\nChicken Grease - D'Angelo (2000)\n\nPerhaps it was John Mayer who said it best when, in 2017, he attributed one of his favorite bass lines to 'Chicken Grease.' Having met D’Angelo in 1997 while recording for BB King’s Deuces Wild, Pino went on to provide many of the flatwound-swinging bass lines on his 2000 landmark album, Voodoo.\n\n\n\nHere he is performing 'Chicken Grease' live on the Chris Rock show. The harmony is open to interpretation, but Pino felt a B7 as the overall tonality.\n\nMy Generation - The Who (2007)\n\nPino’s next call came following the untimely death of John Entwistle, who had died just as the Who was launching its 2002 tour. Pete Townshend later said on his website that he had made only one request of Pino; \"that he fucking turns up his amp and plays as loud as he can!\"\n\n\n\nIn this next video Pino plays probably the most famous bass solo in rock – ‘My Generation’ – on Later… With Jools Holland.\n\nWho Did You Think I Was - John Mayer Trio (2008)\n\nRecorded live at the Nokia Theatre in LA, together with John Mayer and drummer Steve Jordan, Pino’s performance on 'Who Did You Think I Was' is stratospheric. The main riff is based around an A7 pentatonic shape that Pino anchors on the 5th fret of the E string. Keep your ears open at the 02:40 mark as the trio kick into ‘Power of Soul’ by Jimi Hendrix.\n\nSanctified - Nine Inch Nails (2013)\n\nPino’s next stretch came with Nine Inch Nails following Trent Reznor’s invitation to collaborate on the band’s 2013 Hesitation Marks. Pino wasn't the only special guest to appear in the studio: who'd have imagined Lindsay Buckingham of Fleetwood Mac to crop up on a Nine Inch Nails album, let alone the king of the fretless bass? This next clip sees Pino add his slick fretless lines to Reznor’s 1989 track ‘Sanctified.’\n\nBlake Mills - Notes With Attachments\n\nIn 2021 Pino released the first solo album of his career, collaborating with guitarist Blake Mills on an archive of musical ideas. Recorded at Sound City in a series of studio sessions that spanned two and a half years, the album pays homage to his love of classic film soundtracks, cool jazz and Burt Bacharach arrangements.\n\n\n\nWatch Pino Palladino and Blake Mills, along with percussionist Abe Rounds and saxophonist Sam Gendel, perform three tracks from the album on NPR Music’s Tiny Desk (Home) Concert.\n\nNotes With Attachments is available now on CD, vinyl and as a digital download (iTunes and Amazon MP3)"}, {"url": "https://www.theguardian.com/music/2021/apr/06/pino-palladino-pop-greatest-bassist-adele-elton-the-who", "page_content": "By his own admission, Pino Palladino is not a man much accustomed to giving interviews. “Very reticent,” he nods during a Zoom call, his accent speaking noticeably louder of his childhood in Cardiff than his current home in LA. “You know, there was a time when I was featured in all sorts of musicians’ magazines, and then I just thought to myself, ‘Move over, there’s people out there that actually need the publicity.’ Not to blow smoke up my own arse,” he adds hurriedly, “but really I just didn’t want to see or hear from myself.”\n\nIt’s a remark in keeping with the astonishing career of one of the most celebrated bass players in the world. It’s hard not to blanche when you consider the sheer number of records that have been sold featuring his work. He played on not one but two of the biggest selling albums of the 21st century: Adele’s 21 and Ed Sheeran’s Divide, as well as with Rod Stewart, Elton John, Bryan Ferry, Simon and Garfunkel and Keith Richards. They’re the biggest names in a startlingly diverse back catalogue of collaborations: Palladino’s playing is the thread that links Perfume Genius with Phil Collins, Harry Styles with Chris de Burgh, and Nine Inch Nails with De La Soul. Indeed, his versatility and omnipresence is a running joke within the music industry. When another fabled bass player, Pink Floyd’s Guy Pratt, got married, he opened his groom’s speech with the words: “I’m only here today because Pino couldn’t make it.”\n\nFor a musician who seems to have turned up everywhere over the last 40 years, Palladino has remained a remarkably anonymous figure outside of musicians’ circles. Indeed, he somehow contrived to spend 14 years as a member of the Who without really losing what he calls an “invisible stance”. He certainly stands out in photographs of the Soulquarians, the experimental collective assembled by D’Angelo for his legendary album Voodoo, the solitary lanky Welshman among a crowd of African-American musicians including Questlove and the late J Dilla – but you would still struggle to recognise him in the street.\n\nCardiff’s finest … Palladino in 1985. Photograph: Paul Natkin/Getty Images\n\nThis is presumably how Palladino likes it. He’s drily funny and self-deprecating – he says his default setting when working with a new artist is “do not fucking spoil it” – but doesn’t seem terribly frustrated by life in the background. Which makes it all the more surprising that he’s releasing an album on which he shares billing with Blake Mills: Notes With Attachments, a fascinating, head-turning collection of experimental instrumentals that sits somewhere between jazz, global music and ambient. He and Mills, who has produced for Fiona Apple and Laura Marling, met while working on a John Legend album. “We hit it off and the next thing you know, he’s saying to me ‘Have you thought about a solo album?’ Well, I’ve thought about it, obviously,” he laughs. “For 40 years I’ve thought about it, but I’ve never really had an idea how I could do it.”\n\nStudded with guest appearances – from avant-garde saxophonist Sam Gendel and jazz drummer Chris Dave, among others – Notes With Attachments foregrounds the sound that made Palladino’s name: the none-more-80s sprrroing of the fretless bass put through a chorus pedal. He first used it while working with Gary Numan, but it was Paul Young’s 1983 hit Wherever I Lay My Hat that introduced it to a mass audience: pushed up in the mix, the bass effectively became a lead instrument. It was so striking that Palladino suddenly found himself playing with everyone from Go West and Don Henley to Tears for Fears: he turned up on Top of the Pops with alarming regularity, the musical equivalent of a hip item of designer clothing. “There was a lot of it around in those days,” he says of the sound. “I was so lucky – it resonated with people, captured their imagination and it took on a life of its own. It did get to the point where I was getting booked for sessions and feeling like a performing monkey: ‘Yeah, bring your fretless, make that funny sound and maybe we’ll get a hit out of it.’”\n\nHe also found himself becoming the sideman of choice for the rock aristocracy. “The first call I got like that was from David Gilmour. I could not believe it: am I going to the studio with this guy and pretend I actually belong there? I was nervous as fuck, but the drummer on the session was Jeff Porcaro [famed for playing with Toto and on Michael Jackson’s Thriller album], and he was really sweet: ‘Come on, man, chill out, have a smoke on this.’ So I did, and that seemed to work for me. I just had to keep that attitude through all of that period: phone calls from Elton John and Phil Collins – you have to keep that headspace that you belong, even if you think you’re going to be found out any minute.”\n\n‘You’ll have to play louder!’ … performing with the Who at the 2016 Desert Trip festival in California. Photograph: Kevin Mazur/Getty Images\n\nHe says another phone call, this time from D’Angelo – who had heard his playing on a BB King album – changed his life. “My roots are in Motown, reggae, R&B. I didn’t get much of an opportunity to express that side of music and then I met the don – how lucky was that? D’Angelo – I’d mention him in the same breath as Stevie Wonder and Donny Hathaway and Sly Stone. When I was in the studio with D and Questlove, James Poyser, all those guys, I don’t even have to think about what I’m playing. It’s incredible, to be a Welsh guy, having no real connections to these guys other than music that we loved and played. From a personal satisfaction point of view, it was as good as it ever got, probably will get.\n\n“It took people 10 years, 20, to really get the first album we made, Voodoo, but I absolutely knew it was unique and really special – I was probably more aware of it than the rest of them, because I’d been working for a long time. I knew this kind of thing didn’t come around very often.”\n\nThe Soulquarians went on to record with Erykah Badu, Mos Def and Talib Kweli; the influence of their loose approach can be heard on Kendrick Lamar’s epochal 2015 album To Pimp a Butterfly. They had just wrapped up a session with Common when Palladino learned that the Who’s bassist, John Entwistle, had died – and that the band had declined to cancel their forthcoming tour and wanted Palladino to replace him … on stage at the Hollywood Bowl, in two days.\n\n“I flew to LA, thinking, what are you doing? You don’t even know many Who songs. Pete Townshend was waiting for me at the hotel, with a big stack of CDs. ‘You don’t know much of the catalogue? Fair enough. You’re going to know it tonight, then, aren’t you?’ At the first rehearsal, Pete comes over and says: ‘You’re going to have to play louder’ – because I’m used to being the sympathetic musician, who fills in, doesn’t make a racket. That’s the one instruction you keep getting when you work with the Who: ‘Fucking turn it up, we can’t hear you!’”\n\nPalladino says he’s “not exactly crazy about touring any more” – he stopped playing live with the Who in 2016 – but is considering doing some gigs around Notes With Attachments, pandemic permitting. Until then, there are still sessions to attend to in LA, with Covid tests in the car park for anyone taking part. “Film and music studios are considered essential to the economy here – you’ve got to love that, right?” he laughs. “Mind you,” he says, “that’s better than Britain telling you if you’re a musician or an artist you might have to look for a new job.”"}, {"url": "https://en.audiofanzine.com/electric-fretted-bass/fender/Pino-Palladino-Signature-Precision-Bass/", "page_content": "Fender Custom Shop Pino Paladino Signature Precision Bass\n\n(This content has been automatically translated from French)\n\nThis bass is made in the USA Custom Shop Fender. His body is alder and maple neck one piece with a superb touch-type reported by Veen and rosewood frets fine. The varnish is thin nitro cellulose. Relic finish with a polished quite worn on the back of the neck and body, a tortoise picguard cellulosic aged and shrunk with a hair shielding sheet aluminum and the hardware somewhat oxidized. The bridge is of type 62 with 4 saddles adjustable for height and distance (intonation). The mechanics are in reverse type. This instrument is rather light a tad less than 4kg. Micro Precision type but are specific to this bass. ELECTRONICS passive to standarts Precision bass or volume and tone. The Pino...…\n\nRead more\n\nThis bass is made in the USA Custom Shop Fender. His body is alder and maple neck one piece with a superb touch-type reported by Veen and rosewood frets fine. The varnish is thin nitro cellulose. Relic finish with a polished quite worn on the back of the neck and body, a tortoise picguard cellulosic aged and shrunk with a hair shielding sheet aluminum and the hardware somewhat oxidized. The bridge is of type 62 with 4 saddles adjustable for height and distance (intonation). The mechanics are in reverse type. This instrument is rather light a tad less than 4kg. Micro Precision type but are specific to this bass. ELECTRONICS passive to standarts Precision bass or volume and tone. The Pino Palladino is mounted with the original strings Thomastik spun flat.\n\n\n\nUTILIZATION\n\n\n\nThe neck is really nice and lets you play longer without getting tired. The bass is well balanced and very comfortable to play. The sonic palette this instrument is fabulous and easily obtained the famous Motown sound that sounds both more rock. This type of string is obviously not for the slap.\n\n\n\nSOUNDS\n\n\n\nThis bass is very versatile and can play all types of modern music. The amp is ideal for this instrument is obviously a B15 or an old Ampeg tube Bassman, but it also works great on a modern system.\n\n\n\nOVERALL OPINION\n\n\n\nI own this wonder for about 2 years. This instrument has really won because it is very enjoyable to play, very expressive and easy to use. If I had to keep a low is certainly the latter that I would keep. The price is a little high, but good when you love .....\n\nSee less"}, {"url": "https://onlinebasscourses.com/exercises/pino-palladino-bass-exercise/", "page_content": "This bass tutorial takes All Time Low (Nine Inch Nails) as inspiration. Pino Palladino is on bass and he dominates the song, displaying incredible taste, chops, timing, and beautiful note choice.\n\nHe uses scales throughout - indeed all bass lines are made up from them.\n\nIn this lesson you will learn:\n\nSome scales and modes\n\nHow to memorise and practise them\n\nHow to make up fills\n\nA cool bass groove\n\nHow to get your timing and feel together\n\nScroll down for the original video with Pino (from Kimmel live) and the PDF and free backing track.\n\nPlay along to that track everyday and you'll get this together in no time!\n\nIf you like musical sounding exercises, you might like my book Creative Bass Technique Exercises."}, {"url": "https://www.musicngear.com/fender-pino-palladino-signature-bass", "page_content": "For the scientific approach behind our collaborative and content-based filtering algorithms used in our hybrid recommender system please consult [1] , [2] , [3] , [4] , [5] and [6]\n\nWe have collected data (music preferences, personality traits and demographics) by people who took the Goodforme Test for \"Pino Palladino Signature Bass\" and relevant gear by Fender, in \"4-String P-Basses\" or related categories and together with the tech specs of products in our database we feed it into our state-of-the-art recommendation engine. A sample of the data we are using to generate the results for the Goodforme Test, reports and visualizations for this gear can be found below.\n\nLatest test results\n\n50% A male fan of The Rolling Stones, Charles Mingus, Nat King Cole, Keith Jarrett, B.B. King, John Lee Hooker, Buddy Guy and Pop, Classic rock, Jazz, Blues , aged 55 y.o. or older from Spain took the \"Goodforme\" test for Fender Pino Palladino Signature Bass 1 month 1 week ago and scored 50%\n\n49% A male fan of The Rolling Stones, Dixie Chicks, Charles Mingus and Pop, Classic rock, Country, Jazz , aged 45-54 y.o. from Sweden took the \"Goodforme\" test for Fender Pino Palladino Signature Bass 6 months 3 weeks ago and scored 49%\n\n70% A male fan of Eric Clapton, Cypress Hill, Common and Jazz, Blues, Hip hop / rap, Reggae , aged 18-24 y.o. from United States took the \"Goodforme\" test for Fender Pino Palladino Signature Bass 11 months 2 weeks ago and scored 70%\n\n70% A male fan of Eric Clapton, Cypress Hill, Common and Jazz, Blues, Hip hop / rap, Reggae , aged 18-24 y.o. from United States took the \"Goodforme\" test for Fender Pino Palladino Signature Bass 11 months 2 weeks ago and scored 70%\n\n99% A male fan of Guns N' Roses, John Coltrane, Nat King Cole, Gary Moore, Muddy Waters, Jimmy Page and Pop, Classic rock, Jazz, Blues , aged 55 y.o. or older from Spain took the \"Goodforme\" test for a relevant item by Fender in the 4-String P-Basses category 1 month 1 week ago and scored 99%\n\n99% A male fan of Lady Gaga, Michael Jackson, The Rolling Stones, Bon Jovi, Deep Purple, Charles Mingus and Pop, Classic rock, Jazz, Blues , aged 55 y.o. or older from Spain took the \"Goodforme\" test for a relevant item by Fender in the 4-String P-Basses category 1 month 1 week ago and scored 99%\n\n99% A male fan of Led Zeppelin, Bon Jovi, Miles Davis, Nat King Cole, Eric Clapton, Stevie Ray Vaughan and Pop, Classic rock, Jazz, Blues , aged 55 y.o. or older from Spain took the \"Goodforme\" test for a relevant item by Fender in the 4-String P-Basses category 1 month 1 week ago and scored 99%\n\n99% A male fan of Michael Jackson, The Who, Bon Jovi, Miles Davis and Pop, Classic rock, Jazz, Blues , aged 55 y.o. or older from Spain took the \"Goodforme\" test for a relevant item by Fender in the 4-String P-Basses category 1 month 1 week ago and scored 99%\n\n99% A male fan of Queen, Aerosmith, Black Sabbath, John Coltrane, Frank Sinatra, Buddy Guy and Pop, Classic rock, Jazz, Blues , aged 55 y.o. or older from Spain took the \"Goodforme\" test for a relevant item by Fender in the 4-String P-Basses category 1 month 1 week ago and scored 99%\n\n99% A male fan of The Rolling Stones, Bon Jovi, Frank Sinatra, Herbie Hancock, Eric Clapton, Buddy Guy and Pop, Classic rock, Jazz, Blues , aged 18-24 y.o. from Spain took the \"Goodforme\" test for a relevant item by Fender in the 4-String P-Basses category 1 month 1 week ago and scored 99%\n\n99% A male fan of Queen, Bon Jovi, Black Sabbath, Guns N' Roses, Miles Davis, John Coltrane, Muddy Waters, John Lee Hooker and Pop, Classic rock, Jazz, Blues , aged 55 y.o. or older from Spain took the \"Goodforme\" test for a relevant item by Fender in the 4-String P-Basses category 1 month 1 week ago and scored 99%\n\n99% A male fan of Queen, The Rolling Stones, Led Zeppelin, Herbie Hancock, Eric Clapton and Pop, Classic rock, Jazz, Blues , aged 55 y.o. or older from Spain took the \"Goodforme\" test for a relevant item by Fender in the 4-String P-Basses category 1 month 1 week ago and scored 99%\n\n99% A male fan of The Who, The Beatles, The Rolling Stones, AC/DC, Gary Moore, John Lee Hooker and Pop, Classic rock, Jazz, Blues , aged 55 y.o. or older from Spain took the \"Goodforme\" test for a relevant item by Fender in the 4-String P-Basses category 1 month 1 week ago and scored 99%\n\n99% A male fan of Queen, Deep Purple, John Lee Hooker and Pop, Classic rock, Jazz, Blues , aged 55 y.o. or older from Spain took the \"Goodforme\" test for a relevant item by Fender in the 4-String P-Basses category 1 month 1 week ago and scored 99%\n\n67% A male fan of Michael Jackson, The Who, Queen, AC/DC, Aerosmith, Buddy Guy and Pop, Classic rock, Jazz, Blues , aged 55 y.o. or older from Spain took the \"Goodforme\" test for a relevant item by Fender in the 4-String P-Basses category 1 month 2 weeks ago and scored 67%\n\n47% A male fan of Rush, John Coltrane, Gary Moore, Stevie Ray Vaughan, Jimmy Page and Pop, Classic rock, Jazz, Blues, Latin , aged 55 y.o. or older from Spain took the \"Goodforme\" test for a relevant item by Fender in the 4-String P-Basses category 1 month 2 weeks ago and scored 47%\n\n69% A male fan of Rush, Deep Purple, Nat King Cole, B.B. King and Pop, Classic rock, Jazz, Blues, Latin , aged 18-24 y.o. from Spain took the \"Goodforme\" test for a relevant item by Fender in the 4-String P-Basses category 1 month 2 weeks ago and scored 69%\n\n70% A male fan of Rush, Deep Purple, Herbie Hancock, B.B. King and Pop, Classic rock, Jazz, Blues, Latin , aged 55 y.o. or older from Spain took the \"Goodforme\" test for a relevant item by Fender in the 4-String P-Basses category 1 month 2 weeks ago and scored 70%\n\n66% A male fan of Michael Jackson, The Beatles, AC/DC, Herbie Hancock, Stevie Ray Vaughan and Pop, Classic rock, Jazz, Blues , aged 55 y.o. or older from Spain took the \"Goodforme\" test for a relevant item by Fender in the 4-String P-Basses category 1 month 2 weeks ago and scored 66%"}], "Pino Palladino's signature bass sound is heavily influenced by funk music.": [{"url": "https://www.theguardian.com/music/2021/apr/06/pino-palladino-pop-greatest-bassist-adele-elton-the-who", "page_content": "By his own admission, Pino Palladino is not a man much accustomed to giving interviews. “Very reticent,” he nods during a Zoom call, his accent speaking noticeably louder of his childhood in Cardiff than his current home in LA. “You know, there was a time when I was featured in all sorts of musicians’ magazines, and then I just thought to myself, ‘Move over, there’s people out there that actually need the publicity.’ Not to blow smoke up my own arse,” he adds hurriedly, “but really I just didn’t want to see or hear from myself.”\n\nIt’s a remark in keeping with the astonishing career of one of the most celebrated bass players in the world. It’s hard not to blanche when you consider the sheer number of records that have been sold featuring his work. He played on not one but two of the biggest selling albums of the 21st century: Adele’s 21 and Ed Sheeran’s Divide, as well as with Rod Stewart, Elton John, Bryan Ferry, Simon and Garfunkel and Keith Richards. They’re the biggest names in a startlingly diverse back catalogue of collaborations: Palladino’s playing is the thread that links Perfume Genius with Phil Collins, Harry Styles with Chris de Burgh, and Nine Inch Nails with De La Soul. Indeed, his versatility and omnipresence is a running joke within the music industry. When another fabled bass player, Pink Floyd’s Guy Pratt, got married, he opened his groom’s speech with the words: “I’m only here today because Pino couldn’t make it.”\n\nFor a musician who seems to have turned up everywhere over the last 40 years, Palladino has remained a remarkably anonymous figure outside of musicians’ circles. Indeed, he somehow contrived to spend 14 years as a member of the Who without really losing what he calls an “invisible stance”. He certainly stands out in photographs of the Soulquarians, the experimental collective assembled by D’Angelo for his legendary album Voodoo, the solitary lanky Welshman among a crowd of African-American musicians including Questlove and the late J Dilla – but you would still struggle to recognise him in the street.\n\nCardiff’s finest … Palladino in 1985. Photograph: Paul Natkin/Getty Images\n\nThis is presumably how Palladino likes it. He’s drily funny and self-deprecating – he says his default setting when working with a new artist is “do not fucking spoil it” – but doesn’t seem terribly frustrated by life in the background. Which makes it all the more surprising that he’s releasing an album on which he shares billing with Blake Mills: Notes With Attachments, a fascinating, head-turning collection of experimental instrumentals that sits somewhere between jazz, global music and ambient. He and Mills, who has produced for Fiona Apple and Laura Marling, met while working on a John Legend album. “We hit it off and the next thing you know, he’s saying to me ‘Have you thought about a solo album?’ Well, I’ve thought about it, obviously,” he laughs. “For 40 years I’ve thought about it, but I’ve never really had an idea how I could do it.”\n\nStudded with guest appearances – from avant-garde saxophonist Sam Gendel and jazz drummer Chris Dave, among others – Notes With Attachments foregrounds the sound that made Palladino’s name: the none-more-80s sprrroing of the fretless bass put through a chorus pedal. He first used it while working with Gary Numan, but it was Paul Young’s 1983 hit Wherever I Lay My Hat that introduced it to a mass audience: pushed up in the mix, the bass effectively became a lead instrument. It was so striking that Palladino suddenly found himself playing with everyone from Go West and Don Henley to Tears for Fears: he turned up on Top of the Pops with alarming regularity, the musical equivalent of a hip item of designer clothing. “There was a lot of it around in those days,” he says of the sound. “I was so lucky – it resonated with people, captured their imagination and it took on a life of its own. It did get to the point where I was getting booked for sessions and feeling like a performing monkey: ‘Yeah, bring your fretless, make that funny sound and maybe we’ll get a hit out of it.’”\n\nHe also found himself becoming the sideman of choice for the rock aristocracy. “The first call I got like that was from David Gilmour. I could not believe it: am I going to the studio with this guy and pretend I actually belong there? I was nervous as fuck, but the drummer on the session was Jeff Porcaro [famed for playing with Toto and on Michael Jackson’s Thriller album], and he was really sweet: ‘Come on, man, chill out, have a smoke on this.’ So I did, and that seemed to work for me. I just had to keep that attitude through all of that period: phone calls from Elton John and Phil Collins – you have to keep that headspace that you belong, even if you think you’re going to be found out any minute.”\n\n‘You’ll have to play louder!’ … performing with the Who at the 2016 Desert Trip festival in California. Photograph: Kevin Mazur/Getty Images\n\nHe says another phone call, this time from D’Angelo – who had heard his playing on a BB King album – changed his life. “My roots are in Motown, reggae, R&B. I didn’t get much of an opportunity to express that side of music and then I met the don – how lucky was that? D’Angelo – I’d mention him in the same breath as Stevie Wonder and Donny Hathaway and Sly Stone. When I was in the studio with D and Questlove, James Poyser, all those guys, I don’t even have to think about what I’m playing. It’s incredible, to be a Welsh guy, having no real connections to these guys other than music that we loved and played. From a personal satisfaction point of view, it was as good as it ever got, probably will get.\n\n“It took people 10 years, 20, to really get the first album we made, Voodoo, but I absolutely knew it was unique and really special – I was probably more aware of it than the rest of them, because I’d been working for a long time. I knew this kind of thing didn’t come around very often.”\n\nThe Soulquarians went on to record with Erykah Badu, Mos Def and Talib Kweli; the influence of their loose approach can be heard on Kendrick Lamar’s epochal 2015 album To Pimp a Butterfly. They had just wrapped up a session with Common when Palladino learned that the Who’s bassist, John Entwistle, had died – and that the band had declined to cancel their forthcoming tour and wanted Palladino to replace him … on stage at the Hollywood Bowl, in two days.\n\n“I flew to LA, thinking, what are you doing? You don’t even know many Who songs. Pete Townshend was waiting for me at the hotel, with a big stack of CDs. ‘You don’t know much of the catalogue? Fair enough. You’re going to know it tonight, then, aren’t you?’ At the first rehearsal, Pete comes over and says: ‘You’re going to have to play louder’ – because I’m used to being the sympathetic musician, who fills in, doesn’t make a racket. That’s the one instruction you keep getting when you work with the Who: ‘Fucking turn it up, we can’t hear you!’”\n\nPalladino says he’s “not exactly crazy about touring any more” – he stopped playing live with the Who in 2016 – but is considering doing some gigs around Notes With Attachments, pandemic permitting. Until then, there are still sessions to attend to in LA, with Covid tests in the car park for anyone taking part. “Film and music studios are considered essential to the economy here – you’ve got to love that, right?” he laughs. “Mind you,” he says, “that’s better than Britain telling you if you’re a musician or an artist you might have to look for a new job.”"}, {"url": "https://www.udiscovermusic.com/stories/pino-palladino-interview/", "page_content": "Photo: Cedric Ribeiro/Getty Images\n\n“All musicians are the same, we all think we’re rubbish,” Pino Palladino told a British television interviewer in 2013, adding a gentle laugh. It was a typically massive understatement from the quietly affable Welsh bassist, among the highest-regarded session players in the music industry. In this case, Palladino was referring to hearing Paul Young’s “Wherever I Lay My Hat” on the radio for the first time in 1983 – particularly his casual contribution, one of the most recognizable bass lines of the 1980s. “I was worried that it sounded a bit out of tune,” he said.\n\nIn a decades-long career, Palladino has not only provided low-end support for several musical revolutions, he’s helped stoke a few of them himself, undergirding pioneering sounds in pop, New Wave, neo-soul, electronic, rock, jazz, funk, and even industrial with an ever-inventive foundation. He’s widely regarded as one of the most influential bass players ever, with just as much name recognition in certain quarters as the superstars he’s backed.\n\nBeginning with Gary Numan in 1982 and continuing through work with artists like Young, Phil Collins, Tears for Fears, Go West, and Chris de Burgh, Palladino helped define the coolly emotive 80s sound with his trademark fretless technique. In the 1990s he backed Elton John, Eric Clapton, Carly Simon, Bryan Ferry, Joan Armatrading, B.B. King, and many more, before joining the legendary Soulquarians artists collective, reviving cosmic soul and funk sounds with Erykah Badu, D’Angelo, Questlove, and J. Dilla.\n\nADVERTISEMENT\n\nFrom there, it was on to stints with Mika, Nine Inch Nails, Adele, Kelly Clarkson, Paul Simon, and Keith Urban, among a wealth of others, as he also embarked on longtime touring associations with Jeff Beck and John Mayer. Palladino’s most famous stretch came with The Who, when he stepped in after John Entwistle’s untimely death in 2002 to tour and record for two decades, playing probably the most famous bass solo in pop – 1965’s “My Generation” – for arena-sized crowds. Most recently, he’s played for Harry Styles, Ed Sheeran, Corinne Bailey Rae, and John Legend. You can’t talk about Pino Palladino without mentioning a few names.\n\nNow, at last, Pino Palladino is releasing an album of his own, collaborating with guitarist Blake Mills. Called Notes with Attachments, the record summons intimate, cinematic moods, bristling with sophisticated patterns, atmospheric woodwinds, and surprising electronic touches. It’s a compendium of several decades’ worth of Palladino’s compositional ideas, complex, and contemporary yet warm with nostalgia – paying homage to the classic film soundtracks, cool jazz, and Burt Bacharach arrangements he loves.\n\nIn honor of the new release, we accompanied the lauded bassist on a trip down memory lane, revisiting some of his best-known album and tour appearances.\n\nTear for Fears, Seeds of Love (1989)\n\nPino Palladino: I have a lot of great memories of that album, not least because my daughter Fabiana was born around the time we were recording it. My life was changing in a big way. I had been doing a lot of session work with the French drummer Manu Katché, who toured with Peter Gabriel. We were becoming known as a rhythm section together, and a bit in demand. I believe that’s how Roland Orzabal heard of us and invited us onto the album.\n\nThe actual recording was unusual for the time; the tracks were cut live with a full band. We holed up together for a few weeks in Townhouse Studios in London, and went through each of the songs, experimenting with instrumentation and arrangement. There were some days when we just jammed and extended parts of the songs. Roland then took the whole bundle and edited it down into what you hear on the album. We must have recorded “Badman’s Song” and “Woman in Chains” a dozen different ways with different transitions. Roland’s choices and his taste as the composer, defined the amazing end results.\n\n\n\nWatch this video on YouTube Click to load video\n\nOne of my fondest memories: When I first got there, I was going into the control room and I heard this incredible piano-playing in the studio. I was wondering, “Who is that?” I went round the corner and there was Oleta Adams, sitting at the grand piano and singing so beautifully, jamming away on gospel and blues. I’m honored to have played on her solo album Circle of One.\n\nThe Seeds Of Love can be bought here.\n\nElton John, The One (1992)\n\nPino Palladino: We recorded in Paris at Studio Guillaume Tell. Well, the food in Paris was excellent. We would end every day going out to dinner at high-end restaurants with the table piled up with dishes. It was really something to keep up with…but I rose to the challenge!\n\nWorking on that record and spending time with Elton was humbling. I remember one day, Bernie Taupin faxed some song lyrics over in the morning, and Elton took them into the next room and had an amazing song written within an hour…incredible! At this time I was really known for my fretless bass sound, it was something people specifically hired me for. Elton encouraged me to develop my ideas for the basslines and let me do my thing on the record.\n\n\n\nWatch this video on YouTube Click to load video\n\nErykah Badu, Mama’s Gun (2000)\n\nPino Palladino: This was during the Soulquarians period, it was a real fun time. I made the connection because Ahmir [“Questlove” Thompson] had called me in to add to one of the songs he was working on. We thought I would just overdub the bass on one track, but it felt really good and we built up a vibe. Erykah had booked time at The Lady and we reconvened at a later date.\n\nErykah’s way of working was refreshing. For Mama’s Gun, Erykah had sketched out a couple ideas for the album, and had a vision of what she wanted, but otherwise it was pretty undetermined at that point. We all assembled, the whole band, and Erykah just came around, so cool in her way, and asked “OK, Pino, what you got?” That was it. “What you got?” We played around with some different ideas, and it turned into a collaboration, developing the songs together. I played a bassline I had in my mind for a while, and that became the first song on the album, “Penitentiary Philosophy.”\n\nOddly enough, it reminded me of when I was getting started, working with Gary Numan on the I, Assassin album in 1983. Back then, I showed up and Gary had recorded his songs but didn’t have bass parts on them. He wanted me to come up with ideas and gave me complete freedom to compose the parts for the songs. I played my fretless bass and that sound became the sonic signature for the record. What made it different with Erykah, is that this time I got a songwriting and production credit.\n\nListen to Mama’s Gun here.\n\nD’Angelo, Voodoo (2000)\n\nPino Palladino: Being a part of that moment when this album and Mama’s Gun came out almost back to back was thrilling. After meeting D on a session with B.B. King, he invited me to meet him and his engineer, Russ Elevado, at Electric Lady Studios with a view to me playing some bass on the songs for his upcoming record, Voodoo.\n\nWhen they played some of the songs for me, I was mesmerized by the unique feel of the grooves and D’s otherworldly vocal arrangements. D’Angelo had written the songs for Voodoo at the keyboard and while his left hand would play what would become the blueprints for the basslines, his right hand plays the chords and flourishes that accompany the main melody. It all fits together in such a unique way… The basslines are woven into the fabric of the composition from the start.\n\n\n\nWatch this video on YouTube Click to load video\n\nAlthough some songs were established when I got there, others were left more open to develop ideas and for me, some freedom of expression, from adding in passing notes to flurries up to the top of the bass neck to complement his vocals. Because the album is so bass- and rhythm-driven, everything mattered, it was all at the top of the mix, he encouraged me to bring my thing to the music and, through him, I met Erykah, Quest, James Poyser, Roy Hargrove, J Dilla, Common, and all the Soulquarian collective.\n\nListen to Voodoo here.\n\nAdele, 21 (2011)\n\nPino Palladino: I was back in London when [producer] Rick Rubin reached out to me about recording a new album for Adele. She had already made a name for herself in the UK before she broke worldwide, so I had heard of her. Rick told me, “I want to get you into this fantastic band, with drummer Chris Dave, Matt Sweeney and Smokey Hormel on guitars, James Poyser on piano, and really give her the strong backing she deserves.” I flew out to Shangri-La studios in California where they were recording, and she just killed it on the vocals from the start. I remember hearing her voice for the first time through my headphones and being blown away by how she could sing. The songs were really great and I knew we were recording something special.\n\nMika, The Origin of Love (2012)\n\nPino Palladino: Mika has certainly got some incredible energy, he would bounce around the studio with all these ideas. Mika brought a lot of curiosity to the process, he would come up with things while I was playing. He was interested to hear fretless bass on some of the songs and liked how it fitted in. I believe I was hooked up with him through Nick Littlemore from Empire of the Sun. Working on a more electronic-oriented pop album was interesting. It’s great to get the opportunity to expand what you do, and try out different directions.\n\n\n\nWatch this video on YouTube Click to load video\n\nNine Inch Nails, Hesitation Marks (2013)\n\nPino Palladino: Trent [Reznor] reached out to me, out of the blue, and asked if I would be interested in collaborating on a couple of tracks for the album. I was really curious how I would fit in with his sound. Trent is a very good communicator, with clear ideas. He is a fan of Voodoo and of Gary Numan, so for me that was interesting as I could maybe bring two different sides of my playing to the music. I played a couple of takes on each song and just did my thing. Later, Trent’s manager called and asked if I would be interested in touring. It turned out that the band had already been rehearsing for a month. It was a real challenge to learn the songs in a short amount of time before we went on the road. And I had no idea how his fans would react to me. But Trent gave me a lot of room, and that ended up being a memorable tour. The whole band was so tight, and the light show, along with the visual effects, was on another level from anything I’ve been a part of.\n\nThe Who, Endless Wire (2006) and touring after John Entwistle’s death\n\nPino Palladino: In 2002, I was working on Common’s Electric Circus album and I was about to fly home to London from Philadelphia, when my wife called me at the hotel and said, “You just got a call from the Who’s management” She gave me the tragic news that John Entwistle had just died, and they wanted to know if I could step in so they could continue the tour. There was going to be a concert at the Hollywood Bowl a few days later. After speaking to their management, I flew to LA later that day to rehearse for the gig and the following tour.\n\nI had spent some time with John. He was smart, funny, charismatic. He was a superstar. And, of course, an idol as far as bass-playing goes. I had worked with Pete [Townshend] as well, and Roger [Daltrey]. When I flew into LA, Pete was waiting for me at the hotel with a stack of CDs. “Just learn what you can,” he told me. Stylistically, I was not in that space at all at the time – I was doing hip-hop, funk, soul. So it was a complete reset for me. The first thing I did was change the strings on my bass to get a brighter sound, like John had. I pretty much didn’t sleep that night, and learned as much as I could. I think I pulled it off, because they kept me on!\n\nI just worked on their recent record [2019’s WHO]. Endless Wire was the first studio record they made after John’s tragic death, and that was less of a “band” experience. Pete had done a number of demos, obviously some with John in mind to a certain degree. I’d ask Pete if I was doing all right, and he would turn to me and say, “Play more.” He didn’t elaborate, just “play more.” And I understood. Some people would think of it as overplaying, but the classic sound of The Who is Keith Moon on drums and John Entwistle on bass just making this unholy racket. So that’s what I aimed for.\n\n\n\nWatch this video on YouTube Click to load video\n\nHarry Styles, “Watermelon Sugar” (2020)\n\nPino Palladino: I was rehearsing with John Mayer at Henson Studios in Hollywood, which was the former A&M Studios, and before that the Charlie Chaplin Studios. Beautiful history there. Harry was recording in the same studios, down the hall. John knew him and introduced me to Harry. Harry and his producers played me a few songs to see which ones I felt I could add to, including “Watermelon Sugar.” If you listen to the bass line in that song, it’s very well-defined and echoed by the guitar line. There wasn’t really a lot of room to move. Well, I started getting a little free with it, trying stuff, and Harry jumped up and said, “That! Can you do more of that?” It’s an honor that I get invited to play on these songs. It’s going to be a hit with or without me. So I feel very fortunate to be asked to contribute.\n\nPino Palladino and Blake Mills, Notes With Attachments (2021)\n\nPino Palladino: This record is a culmination of what I’ve been thinking about through much of my career. I’ve been recording many of these ideas over a long period of time as I’ve toured and collaborated with many musicians and artists that I admire. What interested me in making my own album was having the chance to focus on compositional elements, rather than the bass taking the lead. Maybe some listeners have been surprised that there are woodwinds and other instruments in the foreground. It’s not me showing particular prowess on my instrument, but to define the role of the bass as a signature part of a song is the challenge I enjoy. I’ve always loved instrumental music, from jazz to film soundtracks. I want my music to invoke some of those qualities.\n\nSome of the ideas on the album evolved from my time touring with D’Angelo and the Soultronics, that kind of beat-driven music, but with beautiful elements and touches, but also from many other types of music that I love. When I played some of these ideas originally for Blake, he was very encouraging and, as we started working on the songs, it quite naturally became a collaboration. Blake, along with all the incredible musicians on the record, have all given so generously to the project, I’m very fortunate to have had the opportunity to make this album. It’s a very interesting process for me, having my own music released. It feels like part of my DNA is suddenly out there. The album was recorded two years ago. But people have told me that it speaks to the moment, that they’re listening to it through this complex time and enjoying it. That’s really nice to hear.\n\nListen to Pino Palladino and Blake Mills’ Notes with Attachments here."}, {"url": "https://www.musicradar.com/news/in-a-rare-interview-bass-legend-pino-palladino-reflects-on-replacing-the-whos-john-entwistle-on-two-days-notice", "page_content": "Welsh bass virtuoso Pino Palladino has enjoyed a prolific career as a session musician, recording with pop superstars such as Adele and Ed Sheeran, playing bass in The Who after John Entwistle's death, and collaborating with the likes of D'Angelo, John Mayer, Elton John and many more.\n\nWhat Palladino isn't is a prolific interviewee, preferring to let his bass guitar do the talking. But in an interview published today in The Guardian, he has spoken of the moment in 2002 when Pete Townshend called. John Entwistle had passed away: would Palladino fill in on the tour?\n\n“I flew to LA, thinking, what are you doing? You don’t even know many Who songs,“ said Palladino. Townshend was prepared, presenting him with a stack of CDs.\n\nThat’s the one instruction you keep getting when you work with the Who: ‘Fucking turn it up, we can’t hear you!‘\n\nAs a session player who had overcome imposter syndrome to sit in with the likes of David Gilmour and Elton John, there was no question Palladino would get The Who's set down pat. But only after some helpful advice from Townshend.\n\n“At the first rehearsal, Pete comes over and says: ‘You’re going to have to play louder’ – because I’m used to being the sympathetic musician, who fills in, doesn’t make a racket,“ said Palladino. That’s the one instruction you keep getting when you work with the Who: ‘Fucking turn it up, we can’t hear you!’”\n\nPalladino also speaks about his career through the 80s, when he was on speed dial for any pop star who needed some four-string flair in the low end. But in a career that saw him play on some of the top-selling albums of all time, Palladino considers his collaboration with neo soul pioneer D'Angelo, as bassist of the Soulquarians, the personal highlight.\n\n“D’Angelo – I’d mention him in the same breath as Stevie Wonder and Donny Hathaway and Sly Stone,“ said Palladino. “It’s incredible, to be a Welsh guy, having no real connections to these guys other than music that we loved and played.“\n\nPalladino has just released Notes With Attachments with the Californian guitarist and composer Blake Mills, available now through New Deal Records. You can read his interview with The Guardian here."}, {"url": "https://pitchfork.com/reviews/albums/pino-palladino-blake-mills-notes-with-attachments/", "page_content": "Contradictory as it sounds, Pino Palladino is possibly the most famous working session bassist. The 63-year-old Welshman is known for his glissando tone and melodic fills, and he has built a four-decade career as the ultimate supporting player: providing a Stravinsky-inspired fretless performance on Paul Young’s 1983 U.K. number No. 1 Marvin Gaye cover “Wherever I Lay My Head,” contributing to neo-soul landmarks Mama’s Gun and Voodoo, joining The Who after the death of original bassist John Entwhistle in 2002, and much more.\n\nNotes With Attachments is the first album released under Palladino’s own name, co-headlining with producer and instrumentalist Blake Mills. The 34-year-old Mills has a similar history as a supporting player, producing for artists like Perfume Genius and Alabama Shakes and facilitating Fiona Apple’s playing on Bob Dylan’s 2020 album Rough and Rowdy Ways. After first collaborating on John Legend’s 2016 album Darkness and Light, the pair developed songs from Palladino’s archive of musical sketches, recording with a small group of players at famed Los Angeles studio Sound City in a series of sessions spanning two and a half years.\n\nNotes With Attachments is an elusive instrumental album, subtle despite the pun in its title. The songs are based around repeating chord changes inspired by funk, West African, and Cuban music, but the continuously shifting arrangements mean that no one instrument carries the melody for long. It’s the sound of consummate collaborators imagining a world where there’s no such thing as a lead performer.\n\nOn “Ekuté,” Palladino’s bass and guitar lines bounce off each other in a syncopated rhythm. As fuzzy, distorted yawns of guitar give way to squealing saxophone and bass clarinet, the players match intensities so that they sound almost like the same instrument at different ends of its range. The song started out as a Fela Kuti-inspired one-chord jam. “We were trying to figure out all the different places that one beat or bassline could take you,” Mills said in a statement.\n\nMany songs here seem as if they were already in the air, just waiting to be captured in final form: “Man From Molise” began as a Palladino composition inspired by Brazilian musician Hermeto Pascoal and recorded with a New York ensemble. Mills played it at half-speed, and from there the duo created an entirely new song—though a sluggish feeling lingers, exacerbated by the lopsided 7/8 time signature. “Soundwalk” was written around a horn arrangement extracted from a fully mixed demo that Palladino and saxophonist Jacques Schwartz-Bart recorded while snowed in at a Chicago hotel during D’Angelo’s 2000 Voodoo tour; its lurching rhythm is reminiscent of another D’Angelo collaborator, J Dilla. The percussion drops in and out while the saxophones drag the music ahead, as if the players were exchanging glances, unsure whether to keep playing but carrying on anyway."}, {"url": "https://knowyourbassplayer.com/2015/03/10/2015-3-10-pino-palladino/", "page_content": "Fretless Pino Courtesy of Music Man Com Fretted Pino Courtesy of Fender Com\n\nBy Thomas Semioli\n\nHe’s the cat who orchestrated the fretless takeover of the instrument in the 1980s/90s. Then he commandeered the triumphant return of the fretted Fender Precision in the 21st century.\n\nFor nearly forty years and counting, the chameleonic Giuseppe Henry “Pino” Palladino has been among the most in-demand session and touring bassists on the planet. Greatly inspired by classic rhythm & blues and American soul music, Pino mostly plies his craft with frets nowadays, utilizing a vintage 1961 Precision which has been replicated for the masses by way of Fender’s signature bass series.\n\nPino’s genre traversing work spans Paul Young, D’Angelo, John Mayer Trio, Don Henley, Adele, David Gilmour, Jeff Beck, Nine Inch Nails, The Who, and Herbie Hancock, among many other high-profile artists.\n\nPalladino’s use of a an “octaver effect” (Boss Octave O2 pedal) on his fretless MusicMan Stingray set a precedent for the instrument in a pop context throughout the Regan / Thatcher years. On the hits (such as Melissa Etheridge’s “Come to My Window” and Paul Young’s “Every Time You Go Away”) and the album tracks – Pino almost always rendered an upper register motif which severed as a main or secondary hook to the composition.\n\nHis work on D’Angelo’s Voodoo slab in 2000 reignited interest in the fretted Fender Precision bass which continues well into the present day.\n\nPino Palladino Sound & Vision…\n\nD’Angelo “Chicken Grease” https://youtu.be/m4XI6LXCsH8\n\nPaul Young “Every Time You Go Away” https://youtu.be/nfk6sCzRTbM\n\nMelissa Etheridge “Come To My Window” https://youtu.be/Gk4CwPQCbAE\n\nGary Numan “Music for Chameleons” https://youtu.be/_586NoZSr-Y\n\nErykah Badu “Cleva” https://youtu.be/XO0KY6Fry5M\n\nEric Clapton “Bad Love” https://youtu.be/qY2vjv8aEas\n\nThe Who Quadrophenia Live https://youtu.be/9NEQb6LdHGQ"}, {"url": "https://scottsbasslessons.com/blog/pino-palladino-bass-players-you-should-know#!", "page_content": "Pino lays it down in any style and he’s a master craftsman when it comes to tone. His touch, his sound, his feel, Pino’s got the whole thing going on.\n\nIf you discuss influences with any R&B, pop or jazz electric bassist, I guarantee that the name Pino Palladino will appear 99.9% of the time. During the past four decades, Pino has spread his colossal bass grooves into all corners of contemporary music, in almost every conceivable style and genre. Hailed by many as the British Jaco, his early recordings with Paul Young put expressive fretless bass playing back on the map. He reinvented himself as an R&B wizard in the 90s and evoked the spirit of John Entwistle with The Who in 2002, before easing into his current vintage-vibe with The John Mayer Trio.\n\nBorn in Cardiff, Wales, in 1957, Pino started out on classical guitar aged 14, moving over to electric bass three years later after discovering Motown and Stax Records, along with players like James Jamerson and Jaco Pastorius.\n\n\n\nIn the early 80s he moved to London and landed the bass gig with ex-Squeeze keyboard player, Jools Holland. This was followed by a stint with synth-pop star Gary Numan, before getting his big break as a member of Paul Young’s band. His groundbreaking bass work on the 1983 album No Parlez culminated in a truly mesmerizing piece of fretless playing on Paul Young’s cover of Marvin Gaye’s ‘Wherever I Lay My Hat.’\n\nHere's Pino demonstrating the famous intro to that track.\n\nA steady flow of top session gigs followed working with the likes of Go West, Elton John and David Knofler, peaking with another standout fretless performance on Don Henley’s ‘New York Minute’...\n\nIn an interview with the Guardian, Pino opened up about this part of his career.\n\nIt's about the song, the timing, all sorts of factors, but there are quite a few artists I've worked with where I've contributed more than they would have expected, such as coming up with sub-hooks that make the record better. It certainly worked for me; for a few years people were phoning from all over the world wanting that sound.\n\nAs the 1980s drew to a close the sound of Pino’s fretless MusicMan StingRay had become almost mandatory among studio producers of the day, with Pino often called in purely to overdub his sound over existing fretted bass tracks. One of the world’s premier fretless bassists had well and truly arrived.\n\n\n\nNow it's easy to think that Pino is simply what we could refer to as a \"groover\". A bass player that is happiest in the background simply holding down the lowend and making the band, well, groove. And while that may be somewhat true, unknown to some, Pino has formidable chops and facility on the bass and can certainly solo with the best of them.\n\n\n\nJust check out Pino's blazing solo fretless lines on his 5 string Musicman Stingray with Manu Katche on drums and Dominic Miller on guitar.\n\nAnd here you can hear that soloing is not something he only saves for his 5 string, as he weaves his way around his trusty Musicman 4 string with ease.\n\n\n\nPino has played a number of basses during his career, but his trademark fretless sound came from his much loved Music Man StingRay, which he bought from Sam Ash music in NYC. He’d tried out a few fretted Music Man basses before but thought they sounded too trebly, but with this particular bass, which I think is a 1979 sunburst model with a rosewood board, he found a warmer more versatile sound and the rest is history.\n\n\n\nOther basses in his early career included a fretless Pedulla and a Warwick Thumb, but his move back to playing more vintage-style fretted basses was led by a number of P Basses from the early 60s, one of which the Fender Custom Shop chose to reproduce for his signature model, complete with Thomastik-Infeld strings. He also plays a Moon Bass, which he used extensively for the D’Angelo Voodoo tour back in 2002. And as for his strings, he uses Rotosound Swing Bass stainless steel mediums, which he prefers for the fretless sound, and Thomastiks or La Bella heavy gauge flatwounds for the P Bass.\n\nPino's Fender Signature P-Bass\n\nAside from his StingRay, Pino’s fretless sound also became synonymous with a Boss 0C-2 octave pedal, which can really be heard on Paul Young’s I’m Gonna Tear Your Playhouse Down.\n\nPino continued to bolster his CV during the 1990s with sessions for the likes of Eric Clapton, Seal, Elton John, Tears for Fears, David Gilmour, Chaka Khan, Pete Townsend and Joan Armatrading, and jazzers such as Al Di Meola, John McClaughlin, David Sanborn and Chris Botti.\n\n\n\nIt was also around this time that he resurfaced in full on R&B groove mode, hitting unbelievable new heights with the epic 2000 recording, Voodoo by D’Angelo.\n\n\n\nThe album’s greasy, laid back feel caused a huge buzz among rhythm sections everywhere, and led to a who’s who of hip hop artists summoning Pino and his 1963 P Bass to their studios. Just listen to how Pino's killer bass line on Chicken Grease sits so lazily in the back of the pocket. Pino is also all over D’Angelo’s 2014 album, Black Messiah, Erykah Badu’s Mama’s Gun and Aijuswanaseeing by Musiq (Soulchild) which all serve as an amazing schooling in the way of the lowend.\n\n\n\nAs the world ushered in the year 2000 Pino was about to reinvent himself yet again. Here's a quote directly from Pino:\n\nIt's important to be able to reinvent what you do. When the call came to play with The Who I was working with Erykah Badu and D'Angelo, and I had to change my whole style. The manager said: 'John [Entwistle] is dead. Can you do a gig at the Hollywood Bowl in three days' time?' You don't turn down something like that. It was only afterwards that I thought about the consequences. Pete Townshend's direction was, 'Play whatever you want, just as long as you play loud!'\n\nThe early 2000's saw Pino filling the bass chair with Simon and Garfunkel on their 2003 reunion tour and he was also drafted in for heavyweight album sessions with the likes of Adele, Ed Sheeran and even Nine Inch Nails. It was during this steady schedule of studio work that Pino took a call that would once again cement his place as one of the most admired bassists in contemporary music.\n\n\n\nWhen bassist Willie Weeks was unable to make a John Mayer gig for the Tsunami Aid benefit concert in 2005, drummer Steve Jordan suggested they call Pino and the rest is history. Countless tours and stadium gigs followed, with the band’s chemistry captured brilliantly on the 2005 live album, Try! And again on the 2008 live DVD, Where The Light Is.\n\n\n\nJust check out the amazing chemistry between Pino, John and Steve on \"Who do you think I was\" to say it's a perfect demonstration of how in the pocket a trio can be would be an understatement, and please, let's just give it up for Steve Jordon on this one, surely one of the coolest drummers in history."}, {"url": "https://www.andertons.co.uk/bass-dept/bass-guitars/precision-bass/fender-custom-shop-pino-paladino-signature-p-bass-fiesta-red", "page_content": "When your resume includes work with Jeff Beck, The Who, Eric Clapton, Simon & Garfunkel and John Mayer, you're obviously doing something right! And when your bass is as special as legendary session bassist Pino Palladino's, it's no wonder Fender’s Custom Shop chose to reproduce it. The Pino Palladino '62 Precision Bass features a light alder body, a C-shape straight grain maple neck with rosewood fingerboard, custom-wound pickup, tortoise shell pickguard and Thomastik-Infeld® strings - Pino's signature bass is made to his exacting specifications.\n\nWhen you’re one of the music world’s go-to-guys for bass tone you need a versatile guitar that’s reliable and sounds great. Fender’s custom shop have a great reputation for guitars that not only stand the test of time but can handle a heavy gigging schedule without issue.\n\nAuthentic Relicing\n\nDown to the last scratch and nick this guitar has been styled after Pino’s famous rig. The bridge cover screw holes are a reminder that the man himself did away with anything that got in the way of his fingers and each mark tells part of his story. Straight out of its case this bass looks like it’s been there, done that and has the marks to prove it.\n\nPrecision Attack\n\nThe P-Bass is one of the most popular models for bass players across the genres. With great tone and a balanced response across the range it’s a real workhorse. Some of the world’s biggest bands rely on the tone of a precision to drive the rhythm section.\n\nFender Custom Artists\n\nThe world’s greatest artists have come to the Fender Custom Shop for decades in search of their perfect instruments. They are able to offer the same artist instruments to you, built in the same shop by the same skilled craftsmen. Each guitar gets the attention of a master craftsman so when you pick up a custom shop guitar you can see the difference.. They are simply flawless.\n\nSpecifications\n\nModel Name: Pino Palladino Signature Precision Bass®, Rosewood Fingerboard, Fiesta Red\n\nModel Number: 0158200840\n\nSeries: Artist\n\nColor: Fiesta Red\n\nBody\n\nBody Material: Select Alder\n\nBody Finish: Nitrocellulose Lacquer\n\nBody Shape: Precision Bass®\n\nNeck\n\nNeck Material: Quartersawn Maple\n\nNeck Finish: Nitrocellulose Lacquer\n\nNeck Shape: \"C\" Shape\n\nScale Length: 34\" (864 mm)\n\nFingerboard: Rosewood\n\nFingerboard Radius: 7.25\" (184.1 mm)\n\nNumber of Frets: 20\n\nFret Size: Vintage-Style\n\nString Nut: Synthetic Bone\n\nNut Width: 1.75\" (44.45 mm)\n\nPosition Inlays: Dot\n\nTruss Rod Nut: Vintage-Style Slotted\n\nNeck Plate: 4-Bolt Serialized\n\nElectronics\n\nMiddle Pickup: Vintage Split Single-Coil Precision Bass\n\nControls: Master Volume, Master Tone\n\nPickup Configuration: Split Single-Coil\n\nHardware\n\nBridge: 4-Saddle American Vintage Bass\n\nHardware Finish: Nickel/Chrome\n\nPickguard: 4-Ply Tortoiseshell\n\nControl Knobs: Knurled Flat-Top\n\nMiscellaneous"}, {"url": "https://bassguitarshack.com/pino-palladino-bass-superman/", "page_content": "One of the most respected and admired bass players in music today, Pino Palladino has such an array of amazing bass chops and feel that it’s almost ridiculous. Pino’s ability to fit his unique style into any type of music and not only make it work but make it sound great is a rare skill indeed. It’s the combination of these qualities that make Pino Palladino a bass superman.\n\nThe complete package, Pino can make it funky, melodic, and anything in between all the while serving the song perfectly. Never getting in the way of the other musicians, Pino always adds just the right feel to the track.\n\nPino Palladino’s early years\n\nBorn in Cardiff, Wales on October 17, 1957, Palladino originally started on guitar, but at age 16 he picked up a friend’s bass and realized that this was the instrument for him. Soon after, he bought a Fender Precision. Not long after that, he begins his journey as a professional bass player.\n\nHeavily influenced by James Jamerson , Stevie Wonder, Michael Henderson, Jaco Pastorius, and Paul Jackson, Pino begins to develop his own personal style and technique. After playing for a local Cardiff television station, Pino moves to London in 1980 to join a band led by Jools Holland of Squeeze. As Pino began to make a name for himself in London, he soon became a highly sought after session player.\n\nIt was around this time that Pino began using a fretless Music Man Stingray (another company started by Leo Fender). His highly expressive lead fretless bass line for Paul Young’s cover of “Wherever I Lay My Hat (That’s My Home)” became an instant classic. Pino also worked with Gary Numan on his album I, Assassin. Numan has stated that he was blown away by Palladino’s amazing bass playing. He’s also said that his unusual fretless tone defined the album with its atmospheric and dreamy quality.\n\nPino leaves the fretless behind and meets D’Angelo\n\nIn the early 1990s, Pino switched from his fretless Musicman Stingray to a fretted sunburst 1963 Fender Precision bass with La Bella flatwound strings. The change was both a musical and personal decision. Pino had grown tired of the lead fretless sound, and he also felt the need to return to his love of the old R&B and soul bass sound.\n\nAfter recording an album with Tom Jones and B.B. King, Pino caught the attention of neo-soul artist D’Angelo who was looking for a certain bass sound for his new album, Voodoo. Palladino’s greasy, fat, laid-back grooves on his ’63 P-Bass gave the recording an old-school vibe that had a large impact not only on bassists but on entire rhythm sections in general. This led to many more session jobs in the neo-soul style for the now very in-demand bassist.\n\nPino’s uncanny ability to adapt to any style and make it his own is what truly sets him apart from the ordinary session bassist. His amazing feel and intuition allow him to be both expressive and tasteful with his bass lines. Pino has stated that he has something he calls “trust chops,” instincts that help him figure out what to play through difficult sections.\n\nNew Directions with The Who\n\nAfter the untimely 2002 death of the great bassist John Entwistle, the surviving members of The Who asked Palladino to play bass for the remainder of their tour. He’s now their permanent bassist. Having played with Pete Townshend and Roger Daltrey previously made this very daunting task a little easier for him, Palladino also personally knew Entwistle.\n\nFor The Who gig, Pino started with both Fender Precision and Jazz basses, finally settling on Fender Jaguar basses, which he likes for their powerful cutting tone. He has said many times that playing with The Who is like a dream come true, and sometimes he can hardly believe that he’s on stage with them.\n\nPino has stated that Pete Townshend had given him full freedom with the bass lines, although he tries to keep them as faithful to John’s original lines as possible. In 2003, Pino started working with Paul Simon for his tour and recorded an album with him in 2006. For this gig, he used his fiesta red 1961 Fender Precision with flatwound strings.\n\nPino’s recent work – and into the future\n\nPino Palladino’s signature Precision Bass\n\nPalladino has also had the great honor of having Fender issue a signature bass in his name. The Fender Pino Palladino Precision Bass is a Custom Shop creation featuring a body modeled after his ’61 Precision and the neck shape after his ’63 P-Bass. The bass is finished in fiesta red over desert sand and given the relic treatment by the Custom Shop craftsmen.\n\nThe John Mayer Trio and many others\n\nDuring the Tsunami Aid benefit concert in 2005, Pino met guitarist John Mayer through drummer Steve Jordan. After original bassist Willie Weeks was unable to perform, Pino was asked to fill in for the concert. The three hit it off well in the studio. Pino later stated that there was instant chemistry between the three musicians. They later decided to form a power trio and set up some tour dates. The John Mayer Trio was born, and this gave Palladino a new opportunity to add creatively in a band context.\n\nIn 2006, Pino joined Jeff Beck for a tour and also worked with Eric Clapton, J.J. Cale, Derek Trucks, and Billy Preston on an album. He’s also played with Robbie Robertson and Herbie Hancock and worked on a follow up to the Voodoo album with D’Angelo entitled Black Messiah.\n\nAs clear evidence of Palladino’s vast range and versatility, in 2013 he played on the Nine Inch Nails album Hesitation Marks and toured with the band as well.\n\nPino Palladino is probably the most sought after bassist in music today and for good reason. His bass chops, great tone, and musical instincts are unparalleled in the industry. We look forward to more great work from Pino for many years to come."}, {"url": "https://www.allaboutjazz.com/musicians/pino-palladino", "page_content": "Pino Palladino was featured on Gary Numan's 1982 album I, Assassin, in which his fretless bass sound made a prominent contribution to the overall sound of the album. He went on to play fretless bass with a healthy number of high-profile artists that include (on the short list), David Gilmour, Tears for Fears, Pete Townshend, Peter Gabriel, Joan Armatrading, Phil Collins, Chaka Khan and Don Henley.\n\nPalladino began playing the electric guitar at age 14. By age 17 he decided to play the bass guitar, and bought his first fretless bass one year later, playing mostly R&B, funk, and reggae within a rock and roll backbeat. His first professional gig was at a local television station in Cardiff, where he began playing in 1978. That same year, at age 20, he joined Jools Holland's band and recorded with Holland on his album entitled, Jools Holland and His Millionaires. Palladino toured with Jools to support the album, which gave him the opportunity to purchase his own Music Man StingRay Fretless Bass. Holland was touring with another new band; the Q-Tips, whose frontman, Paul Young made acquaintance with Palladino whilst they were on tour, who would, a year later offer Pino a place in his own backing band.\n\nPalladino has joined several bands and ensembles through which he is most visible. He joined jazz trumpeter Roy Hargrove in forming The RH Factor, a band that mixes elements of soul, jazz, and R&B. He is a member of the John Mayer Trio, and was the first choice by Pete Townshend and Roger Daltrey to fill the position left by John Entwistle as the current bassist for The Who.\n\nPino Palladino (17 October 1957 in Cardiff, Wales, UK) is a Welsh bass guitarist of Italian ancestry. Palladino rose to public notice playing primarily rock and roll, blues rock, and rhythm and blues music, although he has been lauded for his ability to play most genres of popular music, including jazz, neo soul, and funk. Adding to his eclectic grasp and melodic approach on his instrument, he has become one of the most sought-after session players on the bass in the music industry. He has played on a large number of recordings by some of the world's most successful entertainers, in part, by mastering a variety of techniques on both his late 1970s fretless Music Man StingRay bass guitar and later in his career, adding fretted Fender Precision and Jaguar basses. His playing has earned him custom instruments bearing his name.\n\nAfter vocalist Paul Young landed his own solo contract, Palladino was brought in as part of his backing band \"The Royal Family\" in 1983 with noticeable chart success with the No Parlez album, and major hit singles both in the UK and Europe. Examples of Young's new found success were the band's cover of the Marvin Gaye classic \"Wherever I Lay My Hat (That's My Home)\", which reached No. 1 in the UK singles chart for three weeks in the summer of 1983, and \"Love of the Common People\". Palladino toured extensively at this time with Paul Young, remaining in the band for five years. 1983 additionally proved to be the year of another ensemble featuring Palladino, Paul Rodgers (formerly of Bad Company, drummer Kenney Jones, along with a rotating cast of other celebrity performers. The band only released one album through Atlantic; The Law, although there were enough out-takes that another bootleg-styled album followed in 1991. Sales were unremarkable, despite the names of those who recorded on the album.\n\nThroughout the 1980s Palladino was noted for his R&B roots on the fretless bass, even when supporting pop and rock heavy performers. One reviewer from Bass Player magazine points to Paul Young’s cover of the Bobby Womack/Rufus tune \"Stop On By\" (on 1990’s Other Voices), with its \"pre-hip-hop, swung funk groove\" as the precursor to Palladino's later neo-soul focus.\n\n1990s Changes in instrument\n\nIn the 1990s, Palladino began to alternate between the sounds achieved in playing the fretless bass to one with frets, as well as the 4-string and 6-string bass. At the time, he was well known within the industry for his fretless bass sound. However, now, depending on which artist he was supporting, and the song to be played, he began gravitating towards fretted bass. He was maturing as a musician, and played with artists as diverse as Melissa Etheridge, Richard Wright, Sir Elton John and Eric Clapton. Also in 1991 he joined Paul Rodgers (of Free, Queen+ Paul Rodgers, and Bad Company fame) to form the band The Law. In the mid 1990's, Palladino played bass for The London Metropolitan orchestra during their recording of \"An American Symphony\", soundtrack for the movie Mr Hollands Opus.\n\nPalladino supported Phil Collins, as a member of the house band for the Golden Jubilee of Elizabeth II, which played with Sir Paul McCartney, Eric Clapton, Cliff Richard, and Tony Bennett, among other notable performers. He later wrote that he felt privileged to have been amongst the others on stage in such an event.\n\nIn 1999, he began working with Richard Ashcroft, of The Verve, during the recording sessions of Ashcroft's debut solo album, Alone With Everybody. Richard proved to be mightily impressed by Pino's natural bass playing ability;\n\nThis Pino Palladino, I can say a Meters record and he can play me the bass line. He can play anything. He's one of the only people in the world who can totally replicate that kind of Beach Boys/scratch/Walker Brothers bass. You can get that sound if you want it, dead on. So it was very liberating working with him.\n\nPino also joined Ashcroft's touring band for the singer's first major solo outing throughout 2000.\n\nNeo Soul\n\nBy the mid- 1990s, Palladino had established himself as a busy, highly desirable bassist and a studio worker in many genres, but finally became visible to those artists who played largely left of center, and demand for his session playing grew within a different quarter. Palladino began moving from blues-rock toward neo soul projects. Palladino and Steve Jordan found themselves performing on the same session for B.B. King’s 1997 duets CD Deuces Wild. It was the first time soul singer D'Angelo first heard Palladino, who had just switched from a signature sound fretless bass sound to that of performing with fretted basses. The result was an invitation to \"use Pino’s big, behind-the-beat bass to help cast a neo-soul spell on his Grammy Award-winning Voodoo album\". It would not be his first uncredited Grammy performance.\n\nAs the word spread throughout the genre, Palladino found an increasing demand within the neo-soul genre. Examples of his bass work in this genre (in addition to D'Angelo) includes Mama's Gun, and \"Penitentiary Philosophy\" found on Erykah Badu’s 2000 CD. Other albums using Pino's sound include 1st Born Second for Bilal, Like Water for Chocolate and Electric Circus for Common. Palladino has been described by Steve Jordan, who got his own professional start playing the drums for Stevie Wonder as having a \"deep funk\" side and a \"melodic\" side. Palladino admits, that \"Of all my influences, I would say what’s always in the back of my mind is early Stevie Wonder, like Talking Book and Innervisions; that music is really in my blood.\"\n\n2000s\n\nFollowing the death of The Who's bassist John Entwistle in 2002, the eve before the band were to kick off their first world tour in years, Palladino was their first choice to become the band's full-time touring bass guitarist, and by 2006, he was invited to join the remaining original band members in recording their first album in twenty-four years. Pete Townshend, the band's composer, recorded the bassline on the majority of the songs to get the effect he himself wanted, with Palladino doing so on the other six of them. Released in October 2006, the album was named Endless Wire.\n\nPalladino also recently played with The Who at the Super Bowl XLIV half-time show, in February, 2010, alongside other backing artists: Simon Townsend on guitar, Zak Starkey, drums and percussion, and John \"Rabbit\" Bundrick, on keyboard instruments.\n\nPaul Simon\n\nIn 2003, Palladino intended to go down to see his old friend Paul Simon and meet Brian Eno for the first time. He was asked to record with them, and had to borrow a bass guitar to play. The result was that he played with Simon and Garfunkel on their \"Old Friends\" reunion tour and in an interview with Bass Player Magazine he mentions drummer Steve Gadd and percussionist Jamey Haddad \"had laid down some great grooves for me to add bass\". He had kept the recordings, and by the time that he appeared on the Old Friends: Live on Stage CD and DVD from the tour, he was able to use some of the material. He played on Paul Simon's 2006 release, Surprise.\n\nOther appearances\n\nPalladino has toured in the backing band for Joe Walsh. In 2004 he appeared to be playing with Gary Moore at the Wembley Arena.\n\nEmergence of the John Mayer Trio\n\nPalladino met Steve Jordan in the mid-1980s while both were working as session players on many occasions, which blossomed into a friendship. When their work brought them to the same place, they would meet, usually jam together, and introduce other musicians to one another, forming friendships which sometimes blossomed into good working relationships. Jordan has remained keen about Pino since he met him, and only grows more enthusiastic about his talents, which he describes partly as his love for, and ability to \"feel\" changes in music, through melodies, basslines, and an amazing connection with genres of nearly every kind. According to Jordan, he'd planned to meet up with John Mayer and Willie Weeks in January, 2005 to perform a benefit concert on a NBC sponsored telethon Tsunami Aid: A Concert of Hope to raise funds and public awareness benefiting victims in the aftermath of the tsunami that struck southeast Asia. Weeks was unable to make the performance, and Jordan suggested Palladino, who had heard some of Mayer's work, and was willing to come. Beginning a set that included the Jimi Hendrix classic, \"Bold as Love\", the three all agreed that they experienced such chemistry that they began talking right away about arranging their schedules to record a CD and a tour. The trio released the album Try!, on November 22, 2005. The eleven-track live album includes cover songs, such as Jimi Hendrix's \"Wait Until Tomorrow\" and \"I Got A Woman\" by Ray Charles, two songs from Mayer's release Heavier Things, as well as new songs written by Mayer. In addition, Mayer, Palladino, and Jordan wrote three songs on the album: \"Good Love Is On The Way\", \"Vultures\", and \"Try!\". Along with John Mayer on guitar and vocals, and Steve Jordan on drums, Palladino has toured and recorded as a member of the John Mayer Trio, and on Mayer's third album Continuum.\n\nRecent tours\n\nIn spring of 2006, Palladino toured with Jeff Beck. He also played with J. J. Cale, and Eric Clapton on their 2006 album The Road to Escondido, alongside other notable musicians, including Derek Trucks, and Billy Preston. It was to be Preston's last work before he died only days afterward.\n\nInfluences on bass guitar\n\nInfluences for Palladino for bass guitar include Motown bassist James Jamerson; Stevie Wonder’s keyboard-bass, jazz innovator Jaco Pastorius; British folk/rock upright bassist Danny Thompson; Norman Watt-Roy (of Ian Dury & the Blockheads); Larry Graham; Michael Henderson; Bootsy Collins; Paul Jackson; Anthony Jackson; Doug Rauch (of Carly Simon and Santana), and Billy Cobham.\n\nTechnique\n\nPino Palladino is noted for his use of the fretless bass in many 1980s chart records. While it was typical for a bass guitar in a commercial track to have a rather generic sound and stay \"playing the low notes\" Palladino preferred a different sound (combining fretless tone with an octave effect) and basslines that frequently added chords, lead lines and counter melodies in the higher range of the instrument as opposed to simply the aforementioned \"low notes\". Typical of this style was his playing on Paul Young's biggest chart hits, in particular his bass solo on \"Wherever I Lay My Hat (That's My Home)\". His equipment at that time included a fretless Music Man StingRay Bass 1979 and Boss Octave pedal (OC-2).\n\nPino Palladino signature model\n\nThe Fender Pino Palladino Signature Precision Bass is modeled after two of Pino's Fender Precision Basses. The body featuring faded fiesta red paint over desert sand paint is based on Pino's 1961 Precision Bass while the neck shape and round-lam rosewood fret board are based on Pino's 1963 sunburst Precision Bass.\n\nRecent projects\n\nPalladino joined Eric Clapton's touring band for 11 dates in the Eastern U.S. and Canada in May 2008. Current work has included work on an with Clapton and Robbie Robertson, and Palladino guested on bass for Amos Lee on his third album, Last Days at the Lodge.\n\nIn 2009, Palladino joined with keyboardist Philippe Saisse and Simon Phillips to form an instrumental trio: Phillips Saisse Palladino, an instrumental jazz/funk rock ensemble, which have toured Europe through 2009 into 2010, playing songs that spotlight the talents of each performer, in the manner of many jazz outfits. Show less"}, {"url": "https://www.musicngear.com/fender-pino-palladino-signature-bass", "page_content": "For the scientific approach behind our collaborative and content-based filtering algorithms used in our hybrid recommender system please consult [1] , [2] , [3] , [4] , [5] and [6]\n\nWe have collected data (music preferences, personality traits and demographics) by people who took the Goodforme Test for \"Pino Palladino Signature Bass\" and relevant gear by Fender, in \"4-String P-Basses\" or related categories and together with the tech specs of products in our database we feed it into our state-of-the-art recommendation engine. A sample of the data we are using to generate the results for the Goodforme Test, reports and visualizations for this gear can be found below.\n\nLatest test results\n\n50% A male fan of The Rolling Stones, Charles Mingus, Nat King Cole, Keith Jarrett, B.B. King, John Lee Hooker, Buddy Guy and Pop, Classic rock, Jazz, Blues , aged 55 y.o. or older from Spain took the \"Goodforme\" test for Fender Pino Palladino Signature Bass 1 month 1 week ago and scored 50%\n\n49% A male fan of The Rolling Stones, Dixie Chicks, Charles Mingus and Pop, Classic rock, Country, Jazz , aged 45-54 y.o. from Sweden took the \"Goodforme\" test for Fender Pino Palladino Signature Bass 6 months 3 weeks ago and scored 49%\n\n70% A male fan of Eric Clapton, Cypress Hill, Common and Jazz, Blues, Hip hop / rap, Reggae , aged 18-24 y.o. from United States took the \"Goodforme\" test for Fender Pino Palladino Signature Bass 11 months 2 weeks ago and scored 70%\n\n70% A male fan of Eric Clapton, Cypress Hill, Common and Jazz, Blues, Hip hop / rap, Reggae , aged 18-24 y.o. from United States took the \"Goodforme\" test for Fender Pino Palladino Signature Bass 11 months 2 weeks ago and scored 70%\n\n99% A male fan of Guns N' Roses, John Coltrane, Nat King Cole, Gary Moore, Muddy Waters, Jimmy Page and Pop, Classic rock, Jazz, Blues , aged 55 y.o. or older from Spain took the \"Goodforme\" test for a relevant item by Fender in the 4-String P-Basses category 1 month 1 week ago and scored 99%\n\n99% A male fan of Lady Gaga, Michael Jackson, The Rolling Stones, Bon Jovi, Deep Purple, Charles Mingus and Pop, Classic rock, Jazz, Blues , aged 55 y.o. or older from Spain took the \"Goodforme\" test for a relevant item by Fender in the 4-String P-Basses category 1 month 1 week ago and scored 99%\n\n99% A male fan of Led Zeppelin, Bon Jovi, Miles Davis, Nat King Cole, Eric Clapton, Stevie Ray Vaughan and Pop, Classic rock, Jazz, Blues , aged 55 y.o. or older from Spain took the \"Goodforme\" test for a relevant item by Fender in the 4-String P-Basses category 1 month 1 week ago and scored 99%\n\n99% A male fan of Michael Jackson, The Who, Bon Jovi, Miles Davis and Pop, Classic rock, Jazz, Blues , aged 55 y.o. or older from Spain took the \"Goodforme\" test for a relevant item by Fender in the 4-String P-Basses category 1 month 1 week ago and scored 99%\n\n99% A male fan of Queen, Aerosmith, Black Sabbath, John Coltrane, Frank Sinatra, Buddy Guy and Pop, Classic rock, Jazz, Blues , aged 55 y.o. or older from Spain took the \"Goodforme\" test for a relevant item by Fender in the 4-String P-Basses category 1 month 1 week ago and scored 99%\n\n99% A male fan of The Rolling Stones, Bon Jovi, Frank Sinatra, Herbie Hancock, Eric Clapton, Buddy Guy and Pop, Classic rock, Jazz, Blues , aged 18-24 y.o. from Spain took the \"Goodforme\" test for a relevant item by Fender in the 4-String P-Basses category 1 month 1 week ago and scored 99%\n\n99% A male fan of Queen, Bon Jovi, Black Sabbath, Guns N' Roses, Miles Davis, John Coltrane, Muddy Waters, John Lee Hooker and Pop, Classic rock, Jazz, Blues , aged 55 y.o. or older from Spain took the \"Goodforme\" test for a relevant item by Fender in the 4-String P-Basses category 1 month 1 week ago and scored 99%\n\n99% A male fan of Queen, The Rolling Stones, Led Zeppelin, Herbie Hancock, Eric Clapton and Pop, Classic rock, Jazz, Blues , aged 55 y.o. or older from Spain took the \"Goodforme\" test for a relevant item by Fender in the 4-String P-Basses category 1 month 1 week ago and scored 99%\n\n99% A male fan of The Who, The Beatles, The Rolling Stones, AC/DC, Gary Moore, John Lee Hooker and Pop, Classic rock, Jazz, Blues , aged 55 y.o. or older from Spain took the \"Goodforme\" test for a relevant item by Fender in the 4-String P-Basses category 1 month 1 week ago and scored 99%\n\n99% A male fan of Queen, Deep Purple, John Lee Hooker and Pop, Classic rock, Jazz, Blues , aged 55 y.o. or older from Spain took the \"Goodforme\" test for a relevant item by Fender in the 4-String P-Basses category 1 month 1 week ago and scored 99%\n\n67% A male fan of Michael Jackson, The Who, Queen, AC/DC, Aerosmith, Buddy Guy and Pop, Classic rock, Jazz, Blues , aged 55 y.o. or older from Spain took the \"Goodforme\" test for a relevant item by Fender in the 4-String P-Basses category 1 month 2 weeks ago and scored 67%\n\n47% A male fan of Rush, John Coltrane, Gary Moore, Stevie Ray Vaughan, Jimmy Page and Pop, Classic rock, Jazz, Blues, Latin , aged 55 y.o. or older from Spain took the \"Goodforme\" test for a relevant item by Fender in the 4-String P-Basses category 1 month 2 weeks ago and scored 47%\n\n69% A male fan of Rush, Deep Purple, Nat King Cole, B.B. King and Pop, Classic rock, Jazz, Blues, Latin , aged 18-24 y.o. from Spain took the \"Goodforme\" test for a relevant item by Fender in the 4-String P-Basses category 1 month 2 weeks ago and scored 69%\n\n70% A male fan of Rush, Deep Purple, Herbie Hancock, B.B. King and Pop, Classic rock, Jazz, Blues, Latin , aged 55 y.o. or older from Spain took the \"Goodforme\" test for a relevant item by Fender in the 4-String P-Basses category 1 month 2 weeks ago and scored 70%\n\n66% A male fan of Michael Jackson, The Beatles, AC/DC, Herbie Hancock, Stevie Ray Vaughan and Pop, Classic rock, Jazz, Blues , aged 55 y.o. or older from Spain took the \"Goodforme\" test for a relevant item by Fender in the 4-String P-Basses category 1 month 2 weeks ago and scored 66%"}]}