{"Tony La Russa Jr.'s MLB career has spanned from 1963 to the present, in several roles.": [{"url": "https://www.wikiwand.com/en/Tony_La_Russa", "page_content": "Anthony La Russa Jr. ( ; born October 4, 1944) is an American former professional baseball player, coach, and manager. His MLB career has spanned from 1963 to 2022, in several roles. He is the former manager of the St. Louis Cardinals, Oakland Athletics, and Chicago White Sox. In 33 years as a manager, La Russa guided his teams to three World Series titles, six league championships, and 13 division titles. His managerial total of 2,902 MLB wins is second only to Connie Mack's.\n\nAmerican baseball player and manager\n\nBaseball player\n\nQuick facts: Tony La Russa, MLB debut, Last MLB appearance... ▼\n\nAs a player, La Russa made his major league debut in 1963 and spent parts of five major league seasons with the Kansas City / Oakland Athletics, Atlanta Braves, and Chicago Cubs. After a shoulder injury during the 1964–65 off-season, he returned to college and received a degree from the University of South Florida before playing much of the remainder of his career in the minor leagues until retiring in 1977. He then earned a Juris Doctor degree from Florida State University.\n\nNamed manager of the White Sox in the middle of the 1979 season, La Russa guided the team to an American League West division title four seasons later. In the middle of the 1986 season, he was fired by the White Sox and hired less than three weeks later by the Athletics. La Russa led the A's to three consecutive American League championships from 1988 to 1990 and the 1989 World Series title. He left Oakland after the 1995 season to manage the Cardinals, whom he led the team to three National League championships and the 2006 and 2011 World Series titles. La Russa retired after winning the 2011 title and 34 seasons as a major league manager. Three months later, he accepted a position helping fellow former manager Joe Torre, the executive vice president for MLB operations. In 2014, he became the chief baseball officer for the Arizona Diamondbacks. In November 2019, he joined the Los Angeles Angels as a senior advisor of baseball operations. In the 2021 offseason, he was named the manager of the White Sox; he retired in 2022 due to health concerns.\n\nIn 2013, La Russa was unanimously elected to the Hall of Fame by the 16-member Veterans Committee. The induction ceremony was held at Cooperstown, New York, on July 27, 2014.[1] On August 16, 2014, he was inducted into the St. Louis Cardinals Hall of Fame Museum."}, {"url": "https://www.britannica.com/biography/Tony-La-Russa", "page_content": "Tony La Russa, byname of Anthony La Russa, Jr., (born October 4, 1944, Tampa, Florida, U.S.), American professional baseball manager who led his teams to three World Series titles (1989, 2006, and 2011) and was one of the winningest managers in major league history.\n\nLa Russa signed to play baseball with the Kansas City Athletics (or “A’s”) out of high school. He spent the majority of his 16-season playing career in the minor leagues, but he appeared sporadically in the majors with the A’s (both in Kansas City and, later, in Oakland, where the franchise moved), the Atlanta Braves, and the Chicago Cubs. He was named the manager of a minor-league affiliate of the Chicago White Sox in 1978, and his first big-league managerial job came the following year, when he took over the White Sox late in the 1979 season.\n\nBritannica Quiz Sports Quiz\n\nThe cerebral La Russa—who earned a law degree shortly before assuming managerial duties in Chicago—proved to be a natural leader in the clubhouse. He developed a managerial style that consisted of frequent in-game situational substitutions that came in response to the great attention he paid to the nuances and flow of a particular game (which occasionally led to criticism that La Russa “overmanaged”). In 1983 he guided the White Sox to a 99-win season and the team’s first playoff appearance in 24 years. However, a slow start to the 1986 campaign and a strained working relationship with the team’s new general manager (former outfielder Ken Harrelson, who left the announcing booth to spend only one tumultuous season running the White Sox) led to La Russa’s being fired three months into the season. He was out of work for less than a month before he was hired to manage the A’s.\n\nLa Russa quickly turned the A’s into the most-dominant team in baseball. He led Oakland to the highest win total in the major leagues for three straight seasons (1988–90), each of which also ended with the Athletics’ winning the American League (AL) pennant. The team was upset in two of its World Series appearances during that period, but the A’s did defeat the San Francisco Giants to win a championship in 1989. La Russa and the A’s won another division title in 1992, but after the team posted three consecutive losing seasons (1993–95), he opted out of his contract and signed with the St. Louis Cardinals.\n\nLa Russa’s third managerial stint was even more successful than his first two. In his initial season in St. Louis, he guided the Cardinals to the first of seven division titles the team would win during his tenure. The Cardinals won a National League (NL) pennant in 2004, and in 2006 the team beat the Detroit Tigers to win the World Series. In 2011 La Russa led St. Louis on improbable comebacks to clinch a postseason berth (after trailing in the Wild Card standings by 8 1/2 games with a month remaining in the regular season) and to win the World Series (after twice being one strike away from elimination). La Russa retired soon after earning his third championship ring. He had been named the AL’s Manager of the Year three times (1983, 1988, and 1992) and won the NL’s version of the award in 2002.\n\nThree years after his retirement from managing, La Russa joined the Arizona Diamondbacks as the team’s chief baseball officer. He was demoted to an advisory role with the franchise following the 2016 season after the Diamondbacks ran off three consecutive losing campaigns during his tenure, and he left the team after the 2017 season. La Russa then joined the Boston Red Sox as an assistant to the team’s general manager. After the 2020 season he returned to the Chicago White Sox as general manager. In his first season back with the team, Chicago finished first in the Central Division, and La Russa won his 2,764th game, which moved him into second place for most career wins by a general manager. In the 2021 postseason the White Sox lost in the AL Division Series.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nLa Russa published a memoir, One Last Strike: Fifty Years in Baseball, Ten and a Half Games Back, and One Final Championship Season (written with Rick Hummel), in 2012. He was inducted into the Baseball Hall of Fame in 2014."}, {"url": "https://www.espn.com/mlb/insider/insider/story/_/id/34720656/tony-la-russa-legacy-more-disappointing-white-sox-tenure", "page_content": "On the same day that Tony La Russa might have left baseball for good, the greatest player he ever managed hit his 703rd home run. If Albert Pujols had retired when the Angels released him early in the 2021 season, his decade-long fade in Anaheim would've clouded the greatness of his Cardinals legacy. Improbably, Pujols constructed an ending to his career that is much more appropriate for an inner-circle Hall of Famer, with his Dodgers success in 2021 and this year's home run binge back in St. Louis.\n\nThe opposite trajectory has occurred for his former manager. Some White Sox fans might be too young to know -- or too frustrated to care -- that La Russa, who announced Monday that he will not return as Chicago's manager because of health concerns, was long viewed as one of the sport's most progressive managers, arguably its most intense, and even its most successful. La Russa, who was inducted into the Baseball Hall of Fame in 2014, will finish his career second all-time among managers in wins, with 2,900; the only manager with more wins was a team owner, Connie Mack -- a fact that means that La Russa has the most wins of anyone who could be fired from the job. He has 14 postseason appearances, three World Series championships and four Manager of the Year awards.\n\n\"You knew when you were managing against Tony that you were going against one of the best ever,\" longtime manager Bruce Bochy wrote in a text. \"He definitely forced you to heighten your game awareness.\n\n\"His style was to stand back in the dugout and watch everything going on over the top rail. He had that locked-in look from the first pitch.\"\n\nWhen he was brought on in Chicago in 2021, there was already history -- White Sox owner Jerry Reinsdorf had long acknowledged his regret over allowing the firing of La Russa in the middle of the 1986, and when his team had an opening, Reinsdorf wanted to right what he saw as a wrong. Against the advice of his front-office executives -- some of whom targeted former Astros manager A.J. Hinch -- Reinsdorf hired the 76-year-old La Russa. Hinch landed with the Tigers.\n\nThere was immediate media conjecture that La Russa would be considered out of touch by players 50 or so years younger than he was, but in 2021, he seemed to prove them wrong -- team leaders Tim Anderson and Jose Abreu publicly spoke in support of their manager, and the White Sox ran away with the AL Central before losing to the Astros in a division series. In 2022, the White Sox started slowly and endured significant injuries, but it was La Russa who absorbed a lot of the talk radio and social media blame for the team's struggles, with his in-game decisions constantly debated.\n\nHis own surprising decisions -- including, on multiple occasions, to order intentional walks to hitters despite the fact that White Sox pitchers were ahead in the count -- fueled the narrative that La Russa was the wrong manager for the team. La Russa strongly defended his choices, sometimes sounding defensive, but even some of his peers found the two-strike intentional walks indefensible.\n\nDespite playing in what is widely considered to be the sport's weakest division, the AL Central, the White Sox were maddeningly inconsistent, even after La Russa stepped away in late August. The team never climbed more than five games over .500 before collapsing, once and for all, in the last week of the regular season. La Russa acknowledged the frustrating performance in his final statement: \"Our record is proof. I did not do my job.\"\n\nExecutives with other teams speculated Monday afternoon that within the White Sox front office, there is great relief about La Russa's departure because the team remains talented and within its theoretical window of competing. \"Tony was never their guy -- he was Jerry's guy, and everybody was doing the best they could,\" one executive said.\n\nIt'll take some time before the haze generated by La Russa's two-year stint as White Sox manager drifts away, allowing more clarity about all that he accomplished. Eduardo Perez, who played for La Russa in St. Louis and is now an analyst for ESPN, says unequivocally that La Russa was the best manager he ever had.\n\n\"He understood each one of the 25 men on the roster,\" Perez said. \"He knew he couldn't treat them the same, and you were OK with it. ... You understood [under La Russa] what your role was.\"\n\nWhere La Russa thrived, Perez felt, was in understanding matchups, in manipulating choices -- and sometime the opposing manager -- into the batter vs. pitcher situation he wanted. Perez wrecked left-handed pitching, and La Russa reached out to him when he was a free agent and talked about how he wanted to exploit this particular talent.\n\n\"In the third inning, he was thinking about what was going to happen in the seventh inning, or the ninth inning,\" Perez said -- and then recalled a day La Russa was looking even further into the future.\n\nHow closers became MLB's showmen Here's why there's nothing else in sports quite like the moment a shutdown reliever's music starts up with the game on the line. The Undertaker, 'The Wire' and Timmy Trumpet »\n\nLa Russa ordered Perez to execute a hit-and-run play, he remembers -- in the next day's game, in his first plate appearance. It was, in Perez's mind, a classic example of how La Russa seemed to always be thinking ahead, and Perez remembers hitting a single in that at-bat and pushing a runner to third, as La Russa had asked.\n\nIn his days with the Oakland Athletics, La Russa became one of the first managers to hone in on bullpen roles, collecting left-handers for matchups, deploying closer Dennis Eckersley one inning at a time, working with an understanding of how to properly rest relievers. \"I asked him one time, 'What's the hardest thing about managing?'\" Perez recalled. \"He said, 'The bullpen -- not the media, not the egos. It's the bullpen. You have to know what their strength and weaknesses are, and exploit it as much as you can.'\"\n\n\"You could make a case he impacted the way games were managed more than anybody, in my time,\" said Mets manager Buck Showalter. \"And a lot of people copied him. He took players' skills and worked with them. Everybody had a role.\"\n\nDuring games, La Russa rarely smiled, and seemingly tracked each movement on the field with the focus of a border collie. Long before managers started covering their mouths when they talked to hide their thoughts from prying eyes, La Russa had already shifted into stealth mode. He retreated from the front step of the dugout, where almost all managers are stationed, to the floor of the dugout, effectively hiding behind the forest of coaches and players, away from enemy eyes. He often even shielded his own eyes with sunglasses, Perez said: \"So that nobody would know what he was looking at.\"\n\n\"He was an intimidating figure,\" longtime manager Terry Francona texted Monday. \"And you knew he was always going to be ultra prepared.\"\n\nHinch wrote that he can remember managing against La Russa for the first time, in Hinch's days with the Diamondbacks. \"And I learned how quickly how prepared he and his teams were, and how intense of a competitor he was. He was rather emotionless from across the field, but you could feel his intensity in the decision-making.\n\n\"He applied pressure on the opponent better than any manager I faced early on. Managing against him was a test of your own preparation and conviction, given his boldness to make any move possible to win.\"\n\nDoug Melvin, the longtime general manager of the Texas Rangers, and later, the Milwaukee Brewers, a division rival of the Cardinals, remembers the same. \"He loved the managerial competition and looked at it like it was him against the other manager.\"\n\nWho has the most talent locked up? We've sorted the teams with the most star power under control through 2024. Ranking all 30 MLB cores »\n\nRed Sox manager Alex Cora played against La Russa's teams. \"We all knew he was prepared, and we all knew about the 2-for-1.\"\n\nThe 2-for-1, translated: The understanding that if a pitcher hit one of La Russa's players with a pitch, then the Cardinals would hit two of the other team's players, whether or not the original offense was intentional. The hit batsmen, retaliation and intimidation were at the core of a long, difficult relationship between La Russa and Dusty Baker, who played for La Russa briefly in Oakland before becoming a manager. Their teams would share many on-field bench-clearing incidents, with batters getting hit and punches being thrown.\n\nAfter years of silence, Baker recalled earlier this summer, the two men finally spoke while standing at adjacent urinals at the 2014 funeral of beloved teammate Bob Welch. La Russa wrote Baker a letter of respect and collegiality after Baker's Astros knocked out La Russa's White Sox last fall. Baker acknowledged that after a nudge from Melissa Baker, his wife -- \"The man is trying,\" she said to Dusty -- he called La Russa back.\n\nThere will be more time for those kinds of conversations now about a Hall of Fame career -- one that should be remembered by his 37 years as manager, and not just the last two with the White Sox."}, {"url": "https://www.baseball-reference.com/players/l/larusto01.shtml", "page_content": "Frequently Asked Questions\n\nHow old is Tony La Russa?\n\nTony La Russa is 78 years old.\n\nWhen was Tony La Russa born?\n\nTony La Russa was born on October 4, 1944.\n\nWhere was Tony La Russa born?\n\nTony La Russa was born in Tampa, FL.\n\nHow tall is Tony La Russa?\n\nTony La Russa is 6-0 (183 cm) tall.\n\nHow much did Tony La Russa weigh when playing?\n\nTony La Russa weighed 175 lbs (79 kg) when playing.\n\nHow many seasons did Tony La Russa play?\n\nTony La Russa played 6 seasons.\n\nIs Tony La Russa in the Hall of Fame?\n\nTony La Russa was elected into the Hall of Fame in 2014.\n\nWhat position did Tony La Russa play?\n\nTony La Russa was a Second Baseman and Shortstop.\n\nHow many hits did Tony La Russa have?\n\nTony La Russa had 35 hits over his career.\n\nHow many home runs did Tony La Russa have?\n\nTony La Russa had home runs over his career.\n\nWhat was Tony La Russa's average?\n\nTony La Russa had a .199 average over his career.\n\nHow many teams has Tony La Russa played for?\n\nTony La Russa played for 4 teams; the Kansas City Athletics, Oakland Athletics, Atlanta Braves and Chicago Cubs.\n\nHow many World Series has Tony La Russa won?\n\nTony La Russa has never won a World Series.\n\nWhen did Tony La Russa retire?\n\nTony La Russa last played in 1973.\n\nWhat is Tony La Russa's Twitter account?\n\nTony La Russa is on Twitter at TonyLaRussa."}, {"url": "https://biographymask.com/tony-la-russa/", "page_content": "Tony La Russa is an American professional baseball coach and former player. Tony La Russa is the manager for the Chicago White Sox of Major League Baseball (MLB).\n\nEarly Life\n\nTony La Russa came to this world on October 4, 1944. He is currently 78 years old and his zodiac sign is Libra. His birth name is Anthony La Russa Jr.\n\nHe was born in Tampa’s old picture., Florida, USA. His parents are Anthony and Olivia La Russa. Additionally, Tony has Italian and Spanish ancestry and speaks fluent Spanish.\n\nAfter graduating from Jefferson High School, Tony was signed by the Kansas City Athletics in June 1962 as a middle infielder, with a clause to pay for his college education.\n\nThis personality is a graduate of the University of South Florida. And, following his playing career, Tony earned a Juris Doctor degree from Florida State University.\n\nTony La Russa – Net Worth 2023\n\nThis famous personality has a net worth of around $30 million. Therefore, Tony has earned his net worth as team manager\n\nBody Measurements\n\nThis former player stands 1.82 m or 5 feet 9 inches. Similarly, he has a suitable weight but he has not mentioned his weight. Similarly, he has also not publicly announced his other body stats publicly.\n\nHe has a hazel set of eyes whereas his light brown hair is turning white as per his age.\n\nCareer\n\nTony is the manager for the Chicago White Sox of Major League Baseball (MLB). Therefore, his MLB career has spanned from 1963 to the present, in several roles.\n\nMoreover, Tony is the former manager of the St. Louis Cardinals and Oakland Athletics. Similarly, in 33 years as a manager, he guided his teams to three World Series titles, six league championships, and 13 division titles.\n\nHowever, his 2,821 wins are 2nd most for a major league manager, trailing only the total of Connie Mack.\n\nAnd, as a player, he made his major league debut in the year 1963 and spent parts of 5 major league seasons with the Kansas City / Oakland Athletics, Atlanta Braves, and Chicago Cubs.\n\nMoreover, after a shoulder injury during the 1964–65 off-season, Tony played much of the remainder of his career in the minor leagues until retiring in the year 1977.\n\nTony was named manager of the White Sox in the middle of the 1979 season and guided the White Sox to an American League West division title four seasons later.\n\nMore\n\nIn spite of being fired in the middle of the 1986 season, the Athletics hired him less than three weeks later, and he led the A’s to 3 consecutive American League championships from the year 1988 to 1990 and the 1989 World Series title.\n\nFurther, he left Oakland following the 1995 season to manage the Cardinals. And led the team to 3 National League championships and the 2006 and 2011 World Series titles.\n\nThis player retired after winning the 2011 title and 34 seasons as a major league manager. 3 months later, Tony accepted a position assisting fellow former manager Joe Torre, the executive vice president for MLB operations.\n\nSimilarly, in the year 2014, this personality became the Chief Baseball Officer for the Arizona Diamondbacks.\n\nLikewise, in November 2019, Tony joined the Los Angeles Angels as a senior advisor of baseball operations. Further, in the 2021 offseason, La Russa was named the manager of the Chicago White Sox a second time after the firing of Rick Renteria.\n\nThis personality was unanimously elected to the Hall of Fame by the 16-member Veterans Committee on December 9, 2013. Additionally, on July 27, 2014, the induction ceremony was held at Cooperstown, New York.\n\nFurthermore, on August 16, 2014, Tony was inducted into the St. Louis Cardinals Hall of Fame Museum.\n\nPersonal Life\n\nHe and his first wife Luzette Sarcone share two daughters together, Andrea and Averie. They divorced in the year 1973 and Sarcone received full custody of their daughters.\n\nTony married Elaine Coker shortly after his divorce to Sarcone became official. And, with Elaine, he has two daughters, Bianca and Devon. Tony and Elaine are the founders of Tony La Russa’s Animal Rescue Foundation, headquartered in Walnut Creek, California, USA.\n\nThe foundation saves abandoned and injured animals as well as running programs to bring dogs and cats to abused children, hospital patients, seniors, and shut-ins.\n\nTony La Russa – Social Media\n\nHis Twitter account ‘@TonyLaRussa’ has earned over 73.9K Followers. Besides Twitter, Tony is not active on other social media platforms."}, {"url": "https://www.geni.com/people/Tony-La-Russa/6000000159898842861", "page_content": "About Tony La Russa\n\nAnthony La Russa Jr. (/ləˈruːsə/; born October 4, 1944) is an American professional baseball manager who is the manager of the Chicago White Sox of Major League Baseball (MLB). He is the former manager of the St. Louis Cardinals and Oakland Athletics and a former professional baseball player. In November 2019, he joined the Los Angeles Angels as a senior advisor of baseball operations. His MLB career has spanned from 1963 to the present, in several roles. In 33 years as a manager, La Russa guided his teams to three World Series titles, six league championships and twelve division titles. His 2,728 wins is third most for a major league manager, trailing only the totals of Connie Mack and John McGraw.\n\nAs a player, La Russa made his major league debut in 1963 and spent parts of five major league seasons with the Kansas City/Oakland Athletics, Atlanta Braves and Chicago Cubs. After a shoulder injury during the 1964–65 off-season, he played much of the remainder of his career in the minor leagues until retiring in 1977. Following his playing career, he earned a Juris Doctor degree from Florida State University.\n\nLa Russa was named manager of the White Sox in the middle of the 1979 season and guided the White Sox to an American League West division title four seasons later. Despite being fired in the middle of the 1986 season, the Athletics hired him less than three weeks later, and La Russa led the A's to three consecutive American League championships from 1988 to 1990 and the 1989 World Series title. He left Oakland following the 1995 season to manage the Cardinals, and led the team to three National League championships and the 2006 and 2011 World Series titles. La Russa retired after winning the 2011 title and 33 seasons as a major league manager. Three months later, he accepted a position assisting fellow former manager Joe Torre, the executive vice president for MLB operations. In 2014, he became the Chief Baseball Officer for the Arizona Diamondbacks.\n\nOn December 9, 2013, he was unanimously elected to the Hall of Fame by the 16-member Veterans Committee. The induction ceremony was held at Cooperstown, New York, on July 27, 2014.[1] On August 16, 2014, he was inducted into the St. Louis Cardinals Hall of Fame Museum.\n\nFurther Reading: Wikipedia"}, {"url": "https://heightweighnetworth.com/tony-la-russa/", "page_content": "Tony La Russa Net Worth\n\nTony La Russa made money by Athletes niche. For all time, at the moment, 2023 year, Tony La Russa earned $30 Million. Exact sum is $30900000.\n\nYoutube\n\nBirth date: October 4, 1944\n\nBirth place: Tampa, Florida, United States\n\nHeight:5 ft 11 in (1.82 m) Weight:190 lbs (86.2 kg)\n\nProfession: Baseball player, Manager, Lawyer, Coach\n\nNationality: United States of America\n\nSpouse: Elaine Coker (m. 1973), Luzette Sarcone (m. 1965Р 1973)\n\nBooks: One Last Strike\n\nPictures\n\nSummary\n\nWikipedia Source: Tony La Russa\n\nAnthony Tony La Russa, Jr. is an American professional baseball player, manager, and executive currently serving as Chief Baseball Officer for the Arizona Diamondbacks. He is best known for his tenures as manager of the Chicago White Sox, Oakland Athletics, and St. Louis Cardinals of Major League Baseball. His MLB career has spanned from 1963 to the present. As a manager, La Russa guided his teams to three World Series titles, six league championships and twelve division titles in 33 seasons. His 2,728 wins as a manager ranks third all-time in major league history, behind Connie Mack and John McGraw."}, {"url": "https://www.whosdatedwho.com/dating/tony-larussa", "page_content": "Tony LaRussa American Baseball 2 2\n\nTony LaRussa dating history\n\nWho is he dating right now?\n\nAccording to our records, Tony LaRussa is possibly single.\n\nRelationships\n\nTony LaRussa was previously married to Elaine Larussa (1975) and Luzette Sarcone (1965 - 1973).\n\nAbout\n\nTony LaRussa is a 78 year old American Baseballer. Born Anthony LaRussa on 4th October, 1944 in Tampa, Florida, USA, he is famous for Manager, St. Louis Cardinals. His zodiac sign is Libra.\n\nTony LaRussa is a member of the following lists: People from Tampa, Florida, 1944 births and Oakland Athletics players. Contribute Who is Tony LaRussa dating? Tony LaRussa girlfriend, wife list. Help us build our profile of Tony LaRussa! Login to add information, pictures and relationships, join in discussions and get credit for your contributions."}, {"url": "https://en.as.com/mlb/what-teams-did-tony-la-russa-coach-during-his-35-years-as-an-mlb-manager-n/", "page_content": "One of the greatest managers in the history of the game has taken the decision to step away from the game, but what did he achieve and with which teams? Let’s take a look!\n\nTony La Russa has retired\n\nWith his announcement on Monday, Tony La Russa officially said goodbye to MLB, the Chicago White Sox and of course the many fans. While many were left saddened, it was a decision that was very understandable as the veteran manager cited a pair of health issues as the central motivation for leaving. Sadly, La Russa will walk away from the very same team that gave him his first job in the big leagues, but this time, it will be with a disappointing record after two years at the reigns.\n\nFull screen White Sox manager Tony La Russa announces his retirement due to health concerns, infront of the entire organization on Monday. Kamil Krzaczynski USA TODAY Sports\n\nA three-time World Series champion, La Russa who actually turns 78 on Tuesday, has been absent for the last 34 games having had to leave the team on August 30th to address problems with his pacemaker, which incidentally was implanted in February of this year. It’s worth noting this, because it was apparently during that period that La Russa underwent additional testing for another medical issue that had been previously diagnosed. Ultimately, he took the decision to say goodbye to the game. “...Now however that I’m in the treatment program, it’s become obvious that the length of the treatment and recovery process for the second issue makes it impossible to be the manager in 2023,” La Russa said.\n\nThe Blame Game: Tony La Russa accepts responsibility for White Sox woes\n\nWhen this MLB season got underway, the Chicago White Sox were definitely a team that had their eye on a World Series run. Unfortunately, between constant injuries and inconsistent play, that parade got severely rained on. Speaking in front of essentially the entire organization, including the players themselves, La Russa didn’t shy away from responsibility in anyway. “I understand the ultimate responsibility for each minus this season belongs to the manager,” he said. “That’s accurate, because there’s always something else you could do. I was hired to provide positive, difference-making leadership and support. Our record this year is proof I did not do my job.”\n\nVery classy note from La Russa. Full accountability for White Sox struggles. https://t.co/CIs0mwNCEC — David Todd (@DTonPirates) October 3, 2022\n\nAs for what happens now, Bench coach Miguel Cairo has officially taken over, but the damage is done and their will almost certainly be no post season baseball this year. Interestingly, general manager Rick Hahn said Cairo will get an interview for the full-time job, but also indicated that there is a preference for someone outside the organization. “I think we are going to use this opportunity to get different perspectives,” Hahn said.\n\nWhere else has Tony La Russa coached in his career?\n\nWith a 2,900-2,514 record across an incredible 35 years in the league, La Russa has seen success with the Chicago White Sox, as well as the Oakland A’s and the St. Louis Cardinals. La Russa is second only to Connie Mack on baseball’s career wins list, having previously leap frogged John McGraw just last season. Where his world championships are concerned, La Russa clinched World Series titles with Oakland in 1989 and the Cardinals in 2006 and 2011. To that end, he stands alongside only Sparky Anderson as the only managers ever to win the World Series in both the American and National leagues.\n\nScott Servais greets Tony La Russa at home plate.\n\n\n\nHe talked today about remembering the many times he matched up against La Russa and the Cardinals when playing for the Cubs in the 90s.\n\n\n\n“A Hall of Fame manager who’s had a ton of success.” pic.twitter.com/xn7DBj6Mh5 — Daniel Kramer (@DKramer_) April 6, 2021\n\nYet, it must be said that La Russa’s name will likely always evoke images of the White Sox first before any other team when thinking of him. First hired by the franchise at 34, La Russa was promoted from Triple-A to replace Don Kessinger who had just been fired by the White Sox during the season of 1979. Once appointed, the former infielder would go on to lead the White Sox to a 522-510 record across eight seasons as their manager. Despite leading the White Sox to their first playoff appearance since 1959, during a 1983 run that saw them win 99 games enroute to an AL West Championship, La Russa was fired by then GM Ken Harrelson following a 26-38 start to the season. It is a move that White Sox chairman Jerry Reinsdorf indicated he regrets to this day."}]}