{"Tony La Russa Jr. was named Manager of the Year in 1983, 1988, and 1992.": [{"url": "https://www.britannica.com/facts/Tony-La-Russa", "page_content": "verifiedCite\n\nWhile every effort has been made to follow citation style rules, there may be some discrepancies. Please refer to the appropriate style manual or other sources if you have any questions.\n\nSelect Citation Style\n\nMLA APA Chicago Manual of Style"}, {"url": "https://www.sportscasting.com/how-many-teams-has-tony-la-russa-managed/", "page_content": "After nearly a decade out of the dugout, 76-year-old Tony La Russa, who currently serves as the senior adviser of baseball operations for the Los Angeles Angels, may be resuming his career as a manager. And he may be doing it with the team that gave his first managing job, the Chicago White Sox.\n\nFollowing a disappointing end to their 2020 season, the White Sox parted ways with manager Rick Renteria earlier this week and have reportedly received permission from the Angels to interview La Russa, who last served as a manager in 2011, a season in which he led the St. Louis Cardinals to a World Series title.\n\nSince leaving the Cardinals, Tony La Russa has held executive roles with Major League Baseball, the Arizona Diamondbacks, the Boston Red Sox, and, of course, the Angels. The 2014 Hall of Fame inductee, who also spent six seasons in the big leagues as a player, still seems to be very passionate about the game and is viewed by many as one of the greatest managers in MLB history.\n\nTony LaRussa began his managerial career with the Chicago White Sox\n\nFive years after his final game as a player, Tony La Russa was given his first job as a manager by the Chicago White Sox organization in 1978. La Russa managed the team’s Double-A affiliate, the Knoxville Sox, for half a season before joining the big club midway through the year when the White Sox fired Bob Lemon and replaced him with Larry Doby. Doby was then fired at the end of the season and replaced by Don Kessinger, who served as a player-coach to begin the 1979 campaign. La Russa began that season as the manager of the Triple-A Iowa Oaks but was made the manager in Chicago when the White Sox fired Kessinger in late June.\n\nTony La Russa was named American League Manager of the Year in 1983 when he led the Sox to the ALCS but was fired less than three years later after Chicago got off to a 26-38 start to begin the 1986 season. In parts of eight seasons with the White Sox, La Russa posted a record of 522-510.\n\nHe led the Oakland A’s to a World Series title in 1989\n\nLess than three weeks after being fired by the White Sox, Tony La Russa was named the manager of the Oakland A’s in late July 1986, with whom he’d spent parts of five seasons as a player.\n\nIt certainly didn’t take long for the A’s to become contenders under La Russa’s management. Oakland made their first World Series appearance in 14 years in 1988, a season in which La Russa was named AL Manager of the Year, but lost to the Dodgers in five games. The following season, the A’s won the World Series by sweeping the Giants, a series most remembered for being delayed due to the earthquake that occurred just before the start of Game 3. La Russa and the A’s were huge favorites in the 1990 World Series but were swept by the Reds.\n\nTony La Russa won his third AL Manager of the Year award, his second with the A’s, in 1992 by leading Oakland to its fourth AL West title in five years before losing to the Blue Jays in the ALCS. He managed the A’s for three more seasons and ended his career in Oakland following the 1995 season. In 10 seasons with the A’s, he amassed a record of 798-673.\n\nTony La Russa managed the St. Louis Cardinals for 16 seasons and won two World Series\n\nTony La Russa | Jeff Curry/Getty Images\n\nTony La Russa joined the St. Louis Cardinals ahead of the 1996 season, replacing interim manager Mike Jorgensen, who managed 96 games after the team fired Joe Torre during the 1995 season. Torre, of course, went on to win four World Series titles as the manager of the New York Yankees.\n\nIn his first season in St. Louis, La Russa led the Cardinals to a division title, the team’s first since 1987. St. Louis lost to the Atlanta Braves in the NLCS in seven games. La Russa and the Cardinals returned to the postseason in 2000 and made the playoffs in six of seven seasons, a stretch that included two World Series appearances. St. Louis lost to the Red Sox in 2004 and defeated the Tigers in 2006.\n\nTony La Russa led the Cardinals to another World Series win in 2011, his last season with the team. In 16 seasons in St. Louis, La Russa posted a record of 1,408-1,182. His 2,728 career wins as a manager are good for third on the all-time list behind only John McGraw (2,763) and Connie Mack (3,731).\n\nAll stats courtesy of Baseball Reference"}, {"url": "https://www.espn.com/mlb/story/_/id/23974229/chicago-white-sox-manager-tony-la-russa-joins-list-coaches-multiple-stints-same-team", "page_content": "Tony La Russa is back as the Chicago White Sox manager 34 years after his first stint on the South Side.\n\nAccording to ESPN Stats & Information research, that time gap is the longest for any team in NFL, NBA, NHL or Major League Baseball.\n\nLa Russa first managed in Chicago from 1979-86. It was La Russa's first managerial job. He won American League Manager of the Year in 1983 when the White Sox won their division, but lost in the American League Championship Series to the Baltimore Orioles. After a 26-38 start in 1986, however, La Russa was fired.\n\nHe wasn't out of a job long, getting hired by the Oakland Athletics three weeks later. Since leaving Chicago, La Russa won three World Series titles: 1989 (Oakland), 2006 and 2011 (St. Louis Cardinals). La Russa returns to a White Sox team that made the playoffs this season but was bounced in the wild-card round by the A's.\n\nNFL\n\nJon Gruden, Oakland Raiders (1998-2001, 2018-present)\n\nJon Gruden is back for a second go-around with the Raiders. Ben Margot/AP\n\nWhy he left: Despite leading the Raiders to back-to-back playoff appearances, uncertainty in Oakland led the Raiders to trade Gruden to the Bucs for multiple first-round draft picks. Gruden went on to win a Super Bowl in Tampa.\n\nWhile he was away: The Raiders went to the Super Bowl in the first year post-Gruden but were awful in the years that followed. From 2003 to 2015, Oakland made the playoffs a whopping zero times, cycling through nine coaches in the process.\n\nWhen he returned: The hype was real around Gruden's return to the Bay Area. But a 4-12 record, plus the trade of Khalil Mack to the Bears, in his first season back at the helm left Raiders fans frustrated.\n\nHomecoming quote: \"It was awesome,\" Gruden said of his first preseason game back. \"I mean, I saw some recognizable faces that had got a little bit older, saw some old friends that mean a lot to me. Like I've said all along, it's a great responsibility. The nostalgia's worn off, so we have to do something with the opportunity.\"\n\nHow it went: The Raiders struggled in Gruden's first season back at the helm (4-12). Things were looking up in 2019 until the Antonio Brown saga engulfed the franchise in unwanted drama. Despite the chaos -- and large void left at the WR1 spot by Brown's departure -- Oakland improved to 7-9 with a second-place finish in the AFC West but still missed the playoffs.\n\nJoe Gibbs, Washington Redskins (1981-92, 2004-07)\n\nJoe Gibbs won three Super Bowls in his first stint with the Redskins and had one playoff victory in his second run with the team. Jim McIsaac/Getty Images\n\nWhy he left: Gibbs led the Redskins to three Super Bowl victories before retiring to focus on his NASCAR team.\n\nWhile he was away: The Redskins went through six coaches in 12 years and missed the playoffs for a fourth straight season, going 5-11 with Steve Spurrier in the final season, before Gibbs returned.\n\nWhen he returned: The Redskins went 6-10 in his first season back but were 10-6 the following season, helping bring credibility back to the franchise.\n\nHomecoming quote: \"Joe Gibbs helped define what the Washington Redskins stand for: integrity, hard work, determination, winning and championships. Who better to set our strategy and lead the Redskins back to championship glory?\" -- owner Dan Snyder\n\nHow it went: Gibbs had a 30-34 record in the regular season, two playoff appearances and one playoff victory in his second stint with the team.\n\nArt Shell, Los Angeles/Oakland Raiders (1989-94, 2006)\n\nArt Shell had a solid run in his first tenure with the Raiders, but his second tour lasted only one season. USA TODAY Sports\n\nWhy he left: Despite going 56-41 (including playoffs) and being named coach of the year in 1990 after leading the Raiders to a 12-4 record and an appearance in the AFC Championship Game, Shell was fired after going 9-7 in 1994. The Raiders went into that season as AFC favorites but missed the playoffs.\n\nWhile he was away: In five full seasons under Shell, the Raiders had a winning record four times. In the 11 seasons he was away, they had only three winning seasons. Of the five head coaches hired after Shell was fired, only one (Gruden) compiled a winning record.\n\nWhen he returned: Al Davis admitted that he made a mistake firing Shell and gave him another shot. But Shell's Raiders scored only 12 touchdowns on offense in 16 games, and players such as Jerry Porter and Randy Moss voiced their frustrations.\n\nHomecoming quote: \"It's coming home; it's coming home to finish what I started. It's like going out into the wilderness, and you travel around, you learn, you gather experience and new ideas, but yet you evolve as a person and as a coach, and I think I've done that.\" -- Shell, upon his return\n\nHow it went: Not well. Shell's return lasted just one season, and the Raiders went 2-14, setting a franchise record for losses and scoring futility.\n\nGeorge Halas, Chicago Bears (1920-29, 1933-42, 1946-55, 1958-67)\n\nGeorge Halas had four stretches with the Bears and won a championship in each of them. Malcolm Emmons/USA TODAY Sports\n\nWhy he left: One of the co-founders of the NFL, Halas was not only the coach in his first stint with the club but also a player -- and he took over as owner and handled running the franchise. He won a title in 1921 but retired from playing and stepped back from coaching in 1930, taking over as the sole owner in 1932. Halas entered the Navy after the advent of World War II in 1942 and left the club again.\n\nWhile he was away: The Bears won another title in 1932, but Halas took over as coach the following year to cut costs while enduring the Great Depression. While he was serving in the Navy, the Bears won another championship in 1943.\n\nWhen he returned: Halas' T-formation offense helped the Bears to titles in 1933, 1940 and 1941 upon his first return. He won another championship in his first year back on the sideline in 1946. After a couple years away in the '50s, he returned to coaching for another decade, winning the last of his six championships in 1963.\n\nHomecoming quote: \"I suppose I began to realize this in one of our final games last season, when I started rushing after the referee who was pacing off a penalty, and it suddenly dawned on me that I wasn't gaining on him. I began to wonder whether the officials were speeding up or I was slowing down.\" -- Halas, while announcing his retirement after his last stint\n\nHow it went: \"Papa Bear\" had four stints as head coach of the Bears -- and won at least one championship during each stop -- but after the war, he didn't enjoy the same success as before. He was inducted into the Hall of Fame in 1963 and retired in 1968. His initials (GSH) still adorn the sleeve of the Bears' jerseys today.\n\nOther notables: Ted Marchibroda, Baltimore/Indianapolis Colts (1975-79, 1992-95); Chuck Knox, Los Angeles/St. Louis Rams (1973-77, 1992-94); Bud Grant, Minnesota Vikings (1967-83, 1985); Lou Saban, Buffalo Bills (1962-65, 1972-76); Sid Gillman, San Diego Chargers (1960-69, 1971)\n\nNBA\n\nMike Brown, Cleveland Cavaliers (2005-10, 2013-14)\n\nMike Brown led Cleveland to the Finals in 2007 but lasted only one season after the Cavs brought him back for a second tour of duty. Mark Duncan/AP Photo\n\nWhy he left: Brown led the Cavs to their first Finals appearance in 2007 and was named coach of the year in 2009 after a franchise-best 66-16 season. After another 60-win season in 2010, the Cavs did not reach the Finals again and fired Brown despite his prolific regular-season record.\n\nWhile he was away: LeBron James, who was coming off his second MVP, bolted Cleveland for Miami, and the Cavs missed the playoffs every year Brown was gone, never winning more than 24 games.\n\nWhen he returned: Brown was rehired by the Cavaliers, replacing Byron Scott, with owner Dan Gilbert saying that firing Brown the first time was a mistake.\n\nHomecoming quote: \"It's not something I thought about on a daily basis, but things work in a mysterious way, and I'm excited to have the opportunity again.\" -- Brown upon being rehired.\n\nHow it went: Injuries and reported infighting torpedoed the Cavs, and Brown was fired after a 33-49 season.\n\nPhil Jackson, Los Angeles Lakers (1999-2004, 2005-11)\n\nPhil Jackson won 11 titles as a head coach, including five with Kobe Bryant. Catherine Steenkeste/NBAE/Getty Images\n\nWhy he left: The Lakers were coming off a loss to the Pistons in the NBA Finals, and owner Jerry Buss decided that the trio of Jackson, Kobe Bryant and Shaquille O'Neal no longer worked. Jackson had coached the Lakers to three championships in five seasons.\n\nWhile he was away: The Lakers had their worst season in 11 years, going 34-48 and missing the playoffs under the combination of Rudy Tomjanovich (who resigned midseason, citing health problems) and Frank Hamblen.\n\nWhen he returned: The Jackson-Lakers reunion came just 361 days after his departure. Gone was O'Neal, who was traded after a long feud with Bryant.\n\nHomecoming quote: \"This is something I never thought could possibly happen. It's a pleasure to come back.\" -- Jackson, upon his return.\n\nHow it went: The Lakers returned to the playoffs in Jackson's first year back, but it took time for them to return to their previous glory. A trip to the Finals in 2008 ended in defeat, but Jackson added two more championship rings, winning back-to-back titles in 2009 and 2010.\n\nDon Nelson, Golden State Warriors (1988-95, 2006-10)\n\nDon Nelson compiled plenty of wins in his coaching career but never made it to the NBA Finals. AP Photo/Ben Margot, File\n\nWhy he left: In his last full season, Nelson led the Warriors to a 50-32 record and a third-place finish in the Pacific Division. He resigned halfway through the following season as disputes with forward Chris Webber caused increasing tension.\n\nWhile he was away: Webber was traded to the Wizards following his rookie season of 1993-94. After a brief stint with the Knicks, Nelson went on to a highly successful run in Dallas, inheriting one of the worst teams in the league and turning it into a perennial playoff power.\n\nWhen he returned: Golden State went through eight coaches after Nelson's tenure ended in 1995 -- with none lasting more than two years -- and went 12 straight seasons without a winning record or a playoff berth. Nelson got the Warriors into the playoffs in his first season back.\n\nHomecoming quote: \"I'm happy for Nellie. I think this means that the Warriors will finally make the playoffs. Nellie is that good a coach.\" -- Dallas Mavericks owner Mark Cuban\n\nHow it went: Nelson went 42-40 in his first season back with Golden State, clinching a playoff berth on the final day of the regular season and shocking the top-seeded Mavericks -- the NBA's best regular-season team and Nelson's former employer -- in six games in the first round. It was Golden State's first playoff series win since 1991 and just the third time a No. 8 seed had won an opening-round series. The Warriors missed the playoffs in Nelson's final three seasons on the bench. Nelson never took a team to the NBA Finals, but he won a record 1,335 regular-season games and was voted coach of the year three times during his career.\n\nOther notables: Flip Saunders, Minnesota Timberwolves (1995-2005, 2014-15); Lionel Hollins, Vancouver/Memphis Grizzlies (1999-2000, 2004, 2009-13); Paul Silas, Charlotte Hornets/Bobcats (1999-2002, 2010-12); Kevin McHale, Minnesota Timberwolves (2005, 2008-09); Brian Hill, Orlando Magic (1993-97, 2005-07); Dick Motta, Dallas Mavericks (1980-87, 1994-96); Cotton Fitzsimmons, Phoenix Suns (1970-72, 1988-92, 1996); Bernie Bickerstaff, Seattle SuperSonics (1985-89, 1989-90); Mike Fratello, Atlanta Hawks (1981, 1983-90); Gene Shue, Baltimore/Washington Bullets (1966-73, 1980-86) and San Diego/Los Angeles Clippers (1978-79, 1987-89); Lenny Wilkens, Seattle SuperSonics (1969-72, 1977-85); Red Holzman, New York Knicks (1967-77, 1978-82)\n\nMLB\n\nJohn Gibbons, Toronto Blue Jays (2004-08, 2013-18)\n\nJohn Gibbons got the call to return to the Blue Jays in 2013. Mark Cunningham/MLB Photos/Getty Images\n\nWhy he left: Last-place Toronto was 35-39, riding a five-game skid and trailing AL East leader Boston by 10 1/2 games when Gibbons was fired. With the exception of an 87-75 season in 2006, the Blue Jays didn't finish any better than third in the AL East in his five years with the team.\n\nWhile he was away: Cito Gaston, who helped the Jays win back-to-back World Series titles in 1992 and 1993, replaced Gibbons. The Blue Jays finished in fourth place in the AL East each season Gibbons was gone. Gibbons, meanwhile, served as a bench coach for the Royals for two seasons.\n\nWhen he returned: Toronto had not made the playoffs since its 1993 World Series win, but the Blue Jays increased their win total in each of Gibbons' first three years back and have reached the playoffs twice since he returned.\n\nHomecoming quote: \"I don't know that there was anybody better in terms of managing a bullpen, connecting with the players, connecting with the front office, holding players accountable.\" -- Blue Jays GM Alex Anthopoulos\n\nHow it went: The Jays won the AL East in 2015, making it to the ALCS, in which they lost to the Royals in six games. They returned to the ALCS the following season and fell to the Indians in five games. Gibbons struggled thereafter, and was not retained after a 73-89 campaign in 2018.\n\nBobby Cox, Atlanta Braves (1978-1981, 1990-2010)\n\nBobby Cox's Braves won the division a record 14 straight times between 1991 and 2005. AP Photo/Luis M. Alvarez\n\nWhy he left: Following last-place finishes in each of his first two seasons, the Braves finished fourth in 1980 with their first record above .500 since 1974. Cox was fired by owner Ted Turner following a fifth-place finish in the 1981 strike-shortened season.\n\nWhile he was away: Joe Torre took over in 1982 and led the Braves to their first division title since 1969 but was fired after the 1984 season. The team steadily declined from there, culminating in a 106-loss season in 1988. Cox went on to manage the Blue Jays, who steadily improved under his guidance and reached the ALCS in 1985, falling in seven games to the Royals.\n\nWhen he returned: After serving as GM of the Braves since 1986, Cox named himself manager in 1990. The Braves, who had been down and out, were about to see their fortunes change.\n\nHomecoming quote: \"Bobby is probably the most qualified person, not just in this organization, but anywhere. He also has the best feel for this team since he largely is the one most responsible for putting it together.\" -- Team president Stan Kasten\n\nHow it went: Let's say the second time was a charm. The Braves went from last place to first and went to the World Series in 1991, falling in seven games to the Twins. They won the division a record 14 straight times between 1991 and 2005, winning the NL pennant five times in that span and adding a World Series championship in 1995. A four-time manager of the year, Cox retired with the fourth-most wins (2,504 and 2,149 with the Braves) by a manager in 2010 and entered the Hall of Fame in 2014.\n\nBilly Martin, New York Yankees (1975-78, 1979, 1983, 1985, 1988)\n\nBilly Martin had an on and off again -- and on and off again and again -- relationship with the Yankees. AP Photo/Marty Lederhandler\n\nWhy he left: Martin had five stints managing the Yankees -- and had a winning record in each -- but was nonetheless fired or forced to resign by team owner George Steinbrenner on a fairly regular basis. Martin resigned before he could be fired in 1978 after ongoing drama caused turmoil throughout the organization. He was fired again as manager after going 91-72 in 1983, but he took on a scouting role with the team. Martin was relieved of his managing duties after a 97-win season in 1985, but he received a raise to stay with the organization out of fear that he might leave for another job. Martin was again fired in 1988 after a series of issues on and off the field.\n\nWhile he was away: The Yankees won the World Series in 1978 under Bob Lemon, but Lemon was fired after a slow start the following season, and Martin, who led the Yankees to a World Series title in 1977 after being swept in 1976, was rehired. The Yankees reached the World Series again in 1981 under Lemon but lost to the Dodgers in six games. Between his second and third stints with the Yankees, Martin managed the A's and won two AP manager of the year awards. He even met the Yankees in the 1981 ALCS, in which Oakland was swept in a best-of-five series.\n\nWhen he returned: Martin's first return didn't last long. He was fired by Steinbrenner after getting into a bar fight with a marshmallow salesman. Despite winning records in each of his returns, Martin never lasted more than one season as manager after his initial hiring.\n\nHomecoming quote: \"All I know is [as Yankees manager], I pass people on the street these days, and they don't know whether to say hello or to say goodbye.\" -- Martin, upon his 1983 rehiring\n\nHow it went: In total, Martin went 556-385 in his eight seasons managing the Yankees, winning two pennants and one World Series. But repeated confrontations and issues on and off the field derailed his managerial career.\n\nOther notables: Cito Gaston, Toronto Blue Jays (1989-97, 2008-10); Earl Weaver, Baltimore Orioles (1968-82, 1985-86); Bob Lemon, New York Yankees (1978-79, 1981-82); Ralph Houk, New York Yankees (1961-63, 1966-73); Bucky Harris, Washington Senators (1924-28, 1935-42, 1950-54) and Detroit Tigers (1929-33, 1955-56)\n\nNHL\n\nKen Hitchcock, Dallas Stars (1995-2002, 2017-18)\n\nKen Hitchcock's return to the Stars lasted only one season before he retired with 823 wins, good for third-most in NHL history. Glenn James/NHLI via Getty Images\n\nWhy he left: Hitchcock led the Stars to a first-place finish in the Central Division in his first full season and took them to the conference finals the following season. Then, in the 1998-99 season, Hitchcock led the Stars to the Presidents' Trophy with a 51-19-12 record and went on to win the Stanley Cup. The Stars made it to the Cup Final the next season but lost to the Devils. Hitchcock was fired as coach a season and a half later amid strife between players and management.\n\nWhile he was away: Hitchcock went on to coach the Flyers, Blue Jackets and Blues, accumulating nine playoff appearances and two trips to the conference finals. The Stars made it to the playoffs in each of the next five seasons, reaching the conference finals in 2007-08, but they have made it to the postseason only twice since.\n\nWhen he returned: Optimism was the word. Hitchcock said he saw \"something special\" in this team, but it didn't pan out. The Stars went 42-32-8, finished sixth in the Central and missed the playoffs.\n\nHomecoming quote: \"First of all, this is an emotional day for me because this is like coming home. This means the world for me.\" -- Hitchcock, upon his return\n\nHow it went: The excitement about Hitchcock's return didn't translate to success on the ice, as the Stars battled injuries and a rough stretch in the second half of the season and missed the playoffs despite a 92-point season. Hitchcock announced his retirement after the season, finishing with 823 career regular-season wins, good for third-most all time.\n\nAl Arbour, New York Islanders (1973-86, 1988-94, 2007)\n\nThe Islanders brought Al Arbour back for one game -- his 1,500th with the franchise -- in 2007. Jim McIsaac/Getty Images\n\nWhy he left: After a series of playoff disappointments, Arbour's Islanders won four Stanley Cups in a row, beginning with the 1979-80 season. The Islanders won 19 straight playoff series before falling in the 1984 Cup Final. Arbour retired from coaching following the 1985-86 season and accepted a position in the Islanders' front office.\n\nWhile he was away: The Islanders continued their long streak of playoff appearances but lost in the division finals in the 1986-87 season and in the division semifinals in 1987-88.\n\nWhen he returned: Following a disappointing start to the 1988-89 season, the Islanders fired Terry Simpson, and Arbour returned as head coach. The Islanders went on to miss the playoffs for the first time since the 1973-74 season.\n\nHomecoming quote: ''I never had any thought of coming back as coach, and I did have second thoughts when [GM] Bill [Torrey] asked me. My heart was racing, and it still is.'' -- Arbour, upon his 1988 return\n\nHow it went: The Islanders returned to the playoffs in Arbour's first season back but missed out on the postseason the next two years. They made one more deep run under Arbour in 1993, when they fell in the conference finals. Arbour retired after the 1993-94 season but was brought back in 2007 at age 75 to coach his 1,500th game for the Islanders. He is the only coach in NHL history to coach 1,500 games for a team.\n\nArt Ross, Boston Bruins (1924-34, 1936-39, 1942-45)\n\nArt Ross coached two Stanley Cup winners and reached the Final three other times. AP Photo/File\n\nWhy he left: Ross, who came up with the team name and was the Bruins' first coach, built a Stanley Cup winner in less than five years. He was also the first coach to replace his goaltender with an extra attacker. Ross stepped away from the bench in 1934 to focus on managing the team and again in 1939 after winning his second Stanley Cup.\n\nWhile he was away: There were rumors that coach Frank Patrick was not as strict on his players as Ross wanted, as well as allegations of heavy drinking on the part of the coach. The Bruins lost both years in the playoffs to the Maple Leafs, and Patrick was fired and Ross returned as head coach. After Ross stepped aside the second time, the Bruins won another Cup in the 1940-41 season under Cooney Weiland.\n\nWhen he returned: Ross led the Bruins to a Stanley Cup championship in his third season back on the bench. He made it back to the Final in his last stop with the team, but the Bruins were swept by the Red Wings.\n\nHomecoming quote: \"His two sons served overseas and had excellent records. I figured anybody who could rear two boys like that must be all right.\" -- Conn Smythe, on patching up his long-standing feud with Ross\n\nHow it went: Ross won a Stanley Cup in his first reunion and made another trip to the Cup Final in his last stint with the Bruins. All told, he coached two Cup winners and reached the Final three other times. Ross was inducted into the Hall of Fame in 1949 and retired as GM of the Bruins in 1954. The Art Ross Trophy is given to the leading scorer in the regular season.\n\nOther notables: Randy Carlyle, Anaheim Ducks (2005-12, 2016-current); Claude Julien, Montreal Canadiens (2003-06, 2016-current); Michel Therrien, Montreal Canadiens (2000-03, 2012-17); Ted Nolan, Buffalo Sabres (1995-97, 2013-15); Jacques Lemaire, New Jersey Devils (1993-98, 2009-11); Larry Robinson, New Jersey Devils (2000-02, 2005); Glen Sather, Edmonton Oilers (1976-89, 1993-94); Harry Sinden, Boston Bruins (1966-70, 1979-80, 1984-85); Cecil Hart, Montreal Canadiens (1926-32, 1936-39); Newsy Lalonde, Montreal Canadiens (1917-22, 1932-35)\n\nCollege football\n\nBrady Hoke, San Diego State Aztecs (2009-10, 2020-present)\n\nWhy he left: Hoke posted a 13-12 record in his first stint as head coach of the Aztecs in 2009 and 2010 before leaving to take the Michigan job following Rich Rodriguez's firing. Hoke has an overall record of 78-72 as coach at Ball State, San Diego State, Michigan and Tennessee (where he served as interim coach for the final two games of 2017).\n\nWhile he was away: Before retiring, Rocky Long led the Aztecs to nine straight winning seasons and three Mountain West conference titles, including four 10-win seasons in the past five years. Long left as the program's second-winningest coach (82), behind Don Coryell.\n\nWhen he returned: Jan. 8, 2020.\n\nHomecoming quote: \"You never get to do something twice that you really want to do in life. I was very fortunate, Coach Long bringing me back, and I can assure you we are going to keep going the direction we are going.\"\n\nHow it's going: After delaying the start of the 2020 season due to Mountain West Conference coronavirus protocols, the Aztecs started the season on Oct. 24. Hoke got a 34-6 win to start his reunion tour.\n\nMack Brown, North Carolina Tar Heels (1988-1997, 2019-present)\n\nMack Brown coached UNC from 1988 to 1997. Mitchell Layton/Getty Images\n\nWhy he left: Mack Brown led the Tar Heels to a 69-46-1 record and six bowl appearances. He came to UNC from Tulane and, after consecutive 1-10 finishes, finished 6-4-1 in 1990 -- then never finished with a record below .500 in the rest of his tenure in Chapel Hill. After leading the Tar Heels to back-to-back 10-win seasons in 1996 and '97, Brown left for Texas, where he coached from 1998 to 2013 and won a national title when the Longhorns upset USC in the Rose Bowl to end the 2005 season.\n\nWhile he was away: Let's just say there wasn't much to write home about, and what there was, it wasn't good. UNC suffered some dreadful seasons, with a few public relations nightmares on the side.\n\nWhen he returned: On Nov. 27, 2018, the school announced that it was rehiring Mack Brown as head coach. Brown had spent the previous five years as an analyst for ESPN.\n\nHomecoming quote: \"We've got unfinished business.\"\n\nHow it went: In his first season back at UNC in 22 years -- and first year coaching in six years -- his team went 6-6 and became bowl-eligible for the first time since the 2016 season. The Heels also nearly upset reigning national champion Clemson. In a win over Duke, Brown became the school's all-time leader in wins (73), surpassing his predecessor, Dick Crum. The six wins in his first season back were one more than the team had the previous two seasons combined under Larry Fedora. Brown led the team to its first bowl victory in six years with a 55-13 thumping of Temple on Dec. 27 in the Military Bowl.\n\nRandy Edsall, Connecticut Huskies (1999-2010, 2017-present)\n\nRandy Edsall is back at Connecticut despite not leaving on the best of terms the first time around. AP Photo/Ross D. Franklin, File\n\nWhy he left: After leading UConn to the 2011 Fiesta Bowl, Edsall did not speak to his players or fly back with the team after its loss to Oklahoma. Instead, he flew to Maryland, where he was introduced as the Terrapins' coach.\n\nWhile he was away: UConn went through three coaches and six consecutive losing seasons. The Huskies had one bowl appearance after the 2015 season, albeit in a 6-7 year under Bob Diaco. Edsall had only two winning seasons at Maryland and was fired after a 2-4 start in 2015.\n\nWhen he returned: Edsall, who was the career leader in wins at UConn with 74 and had five bowl appearances in 12 seasons, agreed to a five-year contract and apologized for the way he left the program. There was also controversy after he returned about the late withdrawal of a scholarship offer and a violation of state nepotism laws when he hired his son.\n\nHomecoming quote: \"Almost six years ago, I made one of the worst decisions in terms of how I left the University of Connecticut. That is something I have to live with, and I've lived with. I'm not perfect. Everybody makes a mistake. I regret it. It's something that has weighed heavily on me over the years, and I just hope that I will be able to earn the trust back from all the wonderful fans.\" -- Edsall, upon his return\n\nHow it went: UConn went 3-9 (2-6 in AAC) in Edsall's first season back. Edsall helped take UConn from the FCS to FBS and all the way to the Fiesta Bowl in his first tenure and faces another tall task in his second stint. The Huskies went 1-11 in 2018, setting a number of marks for defensive futility.\n\nBill Snyder, Kansas State (1989-2005, 2009-18)\n\nBill Snyder transformed Kansas State football from a pushover into a powerhouse. AP Photo/Charlie Riedel\n\nWhy he left: Snyder retired in 2005 after K-State's second straight losing season, finishing 136-68-1 in his first tenure. K-State had won only 130 games the previous 51 years. In 1998, he led the Wildcats to an 11-0 regular-season record and their first No. 1 ranking -- 10 years after Sports Illustrated called the football program the worst in the country. In the 2003 season, K-State won the Big 12 championship, its first major conference title since 1934.\n\nWhile he was away: The Wildcats had one winning season and one bowl appearance (a loss in the Texas Bowl) under Ron Prince, a period during which K-State renamed its football stadium Bill Snyder Family Football Stadium. Prince was fired near the end of the 2008 season.\n\nWhen he returned: After going 6-6 in his first season back, Snyder led K-State to eight straight bowl games, including a trip to the Fiesta Bowl after the 2012 season. The Wildcats started that season 10-0 and were ranked No. 1 until a loss to Baylor. Snyder was inducted into the College Football Hall of Fame in 2015.\n\nHomecoming quote: \"This is not just a Bill Snyder thing. This is a family thing and a Wildcat family thing. We need everybody to be involved in caring, and in a genuine and a real way. I'm just pleased to be here with them again.\" -- Snyder, upon his return\n\nHow it went: Though Snyder went 5-7 in 2018, his magic made K-State relevant again. Kansas State was 299-510 in 93 years of play before he took over the first time and had been to one bowl game. The Wildcats had not won a conference title since 1934, had only two winning seasons in the previous 34 years and were riding a 27-game winless streak. Under Snyder, they went to 19 bowl games. K-State only had one season under .500 once Snyder returned.\n\nBobby Petrino, Louisville (2003-06, 2014-18)\n\nBobby Petrino led Louisville to a 12-1 season in 2006, culminating in an Orange Bowl win. Troy Taormina/USA TODAY Sports\n\nWhy he left: After spending four years at Louisville and turning the Cardinals into a national power -- he led them to 11 wins in 2004 and 12 wins in 2006 -- Petrino accepted a five-year, $24 million contract in 2007 to go to the NFL and coach the Atlanta Falcons.\n\nWhile he was away: With the Falcons at the bottom of the NFC South at 3-10, Petrino abruptly resigned to take a job as the head coach at Arkansas, where he spent four seasons before being fired after a motorcycle accident that revealed an inappropriate relationship with a university staffer. Meanwhile at Louisville, the Cardinals floundered under Steve Kragthorpe for three seasons but eventually built back up under Charlie Strong, who spent four seasons there and went 11-2 in 2012 and 12-1 in 2013.\n\nWhen he returned: Following his stint at Arkansas and one year at Western Kentucky, Petrino returned to Louisville after Strong took the head-coaching job at Texas. Petrino signed a seven-year, $24.5 million deal.\n\nHomecoming quote: \"I made mistakes, both professionally and personally. \"That's something I'm not going to do again. ... My first mistake was leaving here.\" -- Petrino, upon his return\n\nHow it went: Louisville went 36-26 in Petrino's second stint, but was fired amid a 2-8 season in 2018 that also included an 0-7 record in the ACC.\n\nOther notables: Clay Helton, USC (2013-interim, 2015-present); Dennis Franchione, Texas State (1990-91, 2011-15); Barry Alvarez, Wisconsin (1990-2005, 2012, 2014); Bo Pelini, Nebraska (2003-interim, 2008-14); Mike Riley, Oregon State (1997-98, 2003-14); Chris Ault, Nevada (1976-92, 1994-95, 2004-12); Phillip Fulmer, Tennessee (1992-interim, 1993-2008); Dennis Erickson, Idaho (1982-85, 2006); John Robinson, USC (1976-82, 1993-97); Johnny Majors, Pittsburgh (1973-76, 1993-96); Bill Walsh, Stanford (1977-78, 1992-94); Frank Leahy, Notre Dame (1941-43, 1946-53); Robert Neyland, Tennessee (1926-34, 1936-40, 1946-52); Walter Camp, Stanford (1892, 1894-95)\n\nCollege basketball\n\nBilly Tubbs, Lamar Cardinals (1976-80, 2003-06)\n\nBilly Tubbs had successful stops at Oklahoma and TCU before returning to Lamar. AP Photo/Mark Weber\n\nWhy he left: Tubbs led the Cardinals to their first NCAA Division I basketball tournament in 1979, and they fell in the second round to eventual champion Michigan State. Tubbs took Lamar to the Sweet 16 the next season, became a hot coaching commodity and eventually left for Oklahoma.\n\nWhile he was away: Lamar's success continued under Pat Foster, who made two NCAA tourney trips in his six years at the helm. Things didn't go as well from there, as Lamar went through five coaches after Foster's exit and made only one postseason appearance. Meanwhile, Tubbs took over an OU team that had one NCAA tournament win in 33 years. By 1985, the Sooners were a No. 1 seed in the NCAA tournament. In 1988, they made it to the national title game. He went on to have a fairly successful run at TCU as well before returning to Lamar.\n\nWhen he returned: Lamar hadn't won the Southland in 12 years and hadn't made it to the NCAA Tournament since 2000. The Cardinals went 11-18 in Tubbs' first season back. It was Tubbs' first losing season since his first year at Oklahoma.\n\nHomecoming quote: \"My athletic director feels we should be winning the conference and going to the NCAA playoffs, or he'll fire my butt.\" -- Tubbs, who was also Lamar's AD at the time\n\nHow it went: After a rare losing season in his first year back, Tubbs led Lamar to an 18-11 record in 2004-05 and a 17-14 record in 2005-06. Tubbs resigned as head coach in 2006 after putting together a 641-340 career record but remained as athletic director. He retired in 2011.\n\nLou Carnesecca, St. John's (1965-70, 1973-92)\n\nLou Carnesecca had back-to-back 30-win seasons with St. John's in the mid-1980s. AP Photo/G. Paul Burnett\n\nWhy he left: Carnesecca never won fewer than 18 games and was 104-35 overall in his first stint with St. John's. He jumped to the professional ranks in 1970 and coached the New York Nets of the ABA for three seasons.\n\nWhile he was away: St. John's went 56-27 under Frank Mulzoff and made one tournament appearance. Carnesecca led the 1971-72 Nets to the ABA Finals, in which they lost to the Indiana Pacers.\n\nWhen he returned: Carnesecca led St. John's to at least 20 wins in each of his first seven seasons back and advanced to the Elite Eight in the 1978-79 season. The team made it to the Sweet 16 in 1983 and reached the Final Four in 1985, with Chris Mullin and Mark Jackson leading the way.\n\nHomecoming quote: \"The pros were a great experience for me. I heartily believe that all college coaches should spend one year in the pros. It's a great eye-opener, especially for those who have Napoleonic tendencies.\" -- Carnesecca, upon his return\n\nHow it went: Carnesecca went 422-165 in his second tenure at St. John's, posting 15 20-win seasons (including two 30-win campaigns in 1985 and '86) and reaching the NCAA tournament 15 times. Carnesecca retired after the 1991-92 season, one year after St. John's reached the Elite Eight again. Overall, he averaged more than 20 wins per season for his career and compiled a 526-200 record (18 20-win seasons). St. John's reached the postseason in each of his 24 seasons (18 NCAAs and six NITs). Carnesecca was inducted into the Basketball Hall of Fame in 1986.\n\nPhog Allen, Kansas Jayhawks (1907-09, 1919-56)\n\nPhog Allen's contributions to basketball went well beyond his accomplishments at Kansas. AP Photo/Dave Taylor\n\nWhy he left: Allen had taken the reins from James Naismith, who is known as the inventor of the game. After going 18-6 in 1907-08 and 25-3 in 1908-09, Allen took a hiatus to study osteopathic medicine at Kansas College of Osteopathy.\n\nWhile he was away: W.O. Hamilton took the helm and led Kansas to an 18-1 record in his first season. After going 33-2 in two seasons from 1913 to 1915, Hamilton's Jayhawks settled into mediocrity, and after a 7-9 season in 1918-19, Allen returned as Kansas' head coach.\n\nWhen he returned: From 1921 to 1927, Allen's teams never lost more than three games and finished atop the Missouri Valley Intercollegiate Athletic Association each season. Kansas had the best record in its conference 11 times in 13 years from 1930 to 1943 and finished as NCAA runners-up in 1939-40. Under Allen, who played a key role in the creation of the NCAA tournament, the Jayhawks were national champions in 1951-52 and finished as runners-up the following season.\n\nHomecoming quote: Allen, when told by Naismith that basketball couldn't be coached: \"Well, you can certainly teach free throwing. And you can teach the boys to pass at angles and run in curves.\"\n\nHow it went: Allen posted 33 winning seasons in his second run at Kansas and retired with a 746-264 record, which at the time was the record for most coaching wins in college basketball history. During his tenure with the Jayhawks, Allen coached Dutch Lonborg, Adolph Rupp, Ralph Miller and Dean Smith -- all future Hall of Fame coaches. He also helped get basketball accepted as an Olympic sport in 1936 and coached the U.S. to the gold medal in the 1952 Summer Games. Allen was part of the inaugural class in the Basketball Hall of Fame in 1959, and Allen Fieldhouse is named in his honor.\n\nOther notables: Dave Leitao, DePaul Blue Demons (2002-05, 2015-present); Norm Sloan, Florida Gators (1960-66, 1980-89); Joe Lapchick, St. John's (1936-47, 1956-65)"}, {"url": "https://www.stlredbirds.com/2022/07/28/october-23-1995-cardinals-name-tony-la-russa-manager/", "page_content": "Eighteen years after Tony La Russa ended his playing career with the St. Louis Cardinals’ Double-A affiliate, he was named the 48th manager in franchise history.\n\nOn October 23, 1995, general manager Walt Jocketty signed La Russa to a two-year contract to manage the Cardinals, ending a 10-year run with the Oakland Athletics in which La Russa won five division championships, three American League pennants, and the 1989 World Series.\n\n“It should excite people a little bit,” catcher Tom Pagnozzi said. “He’s kind of like bringing Whitey Herzog back.”[1]\n\nLa Russa’s contract paid him an estimated $1.5 million per year and included an option for a third season.[2]\n\n“My statement publicly to Cardinals fans is I’ll do everything in my power to have a hustling, aggressive ballclub next year that also plays the game right,” La Russa said.[3]\n\nLa Russa was leaving an Oakland franchise that he guided to 96 wins as recently as 1992. In the three seasons since, however, the club had dipped below .500, and following the death of owner Walter A. Haas Jr. in September, the team was sold to a group led by Steve Schott. The new ownership group made clear that it planned to cut payroll.\n\n“I think Tony was forced out,” one source told the Oakland Tribune. “I think, deep down, Tony wanted to stay. If they had given him any indication that they were going to try to be competitive, he would have stayed, but that wasn’t the indication they gave.”[4]\n\nLa Russa had a clause in his contract that allowed him to leave if the team changed owners.[5] On Sunday, October 22, he met with Schott to discuss the A’s future and whether La Russa or Schott saw him as a part of it.\n\n“I left there with the feeling that it would be good for them and good for me that I leave,” La Russa said.[6]\n\nThat evening, La Russa met his family for dinner. Together, they agreed – after 10 years, it was time for La Russa to leave Oakland.\n\n“I literally didn’t make up my – our – minds till dinner Sunday night,” La Russa said.[7]\n\nA’s catcher Terry Steinbach wasn’t surprised by La Russa’s decision.\n\n“I kind of anticipated that he would go,” Steinbach said. “I just think some of the comments about the direction the club would be taking were contrary to what Tony believes and is all about in his quest to win. Oakland is losing a treasure, definitely.”[8]\n\n“I think there were some good reasons for him to leave,” Mark McGwire said. “The situation in Oakland is going to be tough for the next few years. It’s a good move for him.”[9]\n\nThe following day, Jocketty named La Russa the team’s new skipper. Jocketty and La Russa had known each other for decades, dating back to La Russa’s days as a player-manager with Triple-A Iowa.\n\nFrom 1983 through 1993, Jocketty and La Russa worked together again, this time with La Russa as manager of the Athletics and Jocketty the team’s director of baseball administration.\n\n“This is a very exciting day for me personally and professionally,” Jocketty said. “I’ve had the opportunity to watch Tony grow into one of the game’s greatest managers, one of the best managers of this era. The hiring of Tony La Russa to manage the Cardinals is a huge step in the rebuilding process of this organization.”[10]\n\nLa Russa’s managerial career began after a 16-year professional playing career that began when he signed with the Kansas City Athletics out of high school. When he signed, La Russa promised his mother that he would spend his offseasons in college. It took him seven years to earn his undergraduate degree from the University of South Florida and another five to graduate with honors from Florida State University’s School of Law.\n\nWhen La Russa became manager of the White Sox in 1979, he became just the fifth manager in Major League Baseball history to have passed the bar exam. Each of his four predecessors – John Montgomery Ward, Hughie Jennings, Miller Huggins, and Branch Rickey – were Hall of Famers.[11]\n\nThough La Russa was considered a cerebral player, he didn’t have the talent to stick in the majors. Over the course of his career, he played in just 132 big-league games and took 176 at-bats, batting .199 without a home run.\n\nIn his later years, he served as a minor-league player-coach, including his final season in 1977, when he was with St. Louis’s New Orleans affiliate. There, legendary coach George Kissell told La Russa he should switch to managing full time.\n\n“I’ve slipped that much?” La Russa asked.\n\n“No,” Kissell said. “I don’t think you were ever good enough.”[12]\n\nThe following year, La Russa began his managerial career with the White Sox Double-A affiliate in Knoxville, Tennessee. After one season managing in the minors, the White Sox made him their manager at age 34. In 1983, La Russa guided Chicago to the AL West championship, but after a 26-38 start, he was fired just 64 games into the 1986 season.\n\nHe didn’t stay unemployed for long. The A’s quickly hired him and he led the team to a 45-34 record the rest of the season. His tenure in Oakland included 104 wins and the American League championship in 1988, the World Series championship in 1989, and 103 wins and another AL pennant in 1990.\n\n“Tony’s very intelligent, no question about it,” said Cardinals reliever Jeff Parrett, who played for La Russa in Oakland in 1992. “He really is a player’s manager. He does a good job of protecting his players.”[13]\n\nDespite La Russa’s success with the A’s, Oakland Tribune columnist Monte Poole saw St. Louis as the perfect fit for the baseball-obsessed manager.\n\n“While there are some passionate baseball fans … the Bay Area is not devoted to the game,” Poole wrote after La Russa was named Cardinals manager. “St. Louis is quite the opposite. There is much to do, but baseball is at or near the top of everybody’s list. People gaze at the Musial monument outside Busch about as often as they admire the world-famous Gateway Arch. Coming here to manage signifies La Russa’s commitment to baseball. And to winning, which, for now, will be nearly impossible to do in Oakland.”[14]\n\nOf course, winning was no guarantee in St. Louis. After all, Joe Torre – another future Hall of Fame manager – had just been fired in June after a 20-27 start to a 1995 campaign that saw the Cardinals finish fourth in the NL Central with a 62-81 record. In five-plus seasons with St. Louis, Torre had gone 351-354.\n\n“I believe in high goals and I believe in big dreams,” La Russa said. “My dream real quickly for this franchise is to draw 3 million fans and, as early as possible, get to Sept. 1 with a chance to win. When you look at me, you’re going to find a very simple perspective. Everything from this moment on will be geared to win the next game that the Cardinals play.”[15]\n\nSt. Louis Post-Dispatch columnist Bernie Miklasz praised the Cardinals for the hire but urged the team to follow through by giving La Russa the players he needed to succeed.\n\n“Considering the deteriorated condition of Cardinals baseball, it’s quite a coup for Jocketty to secure a manager who has won five division titles, three pennants, three manager of the year awards, and a World Series,” Miklasz wrote. “The Cardinals, in their present state, have a strong outfield, a sturdy bullpen, a staff of whining, head-case starting pitchers, no leadoff or cleanup hitter, and the worst infield in major-league baseball. La Russa may be astute, but he can’t raise the dead. Now that Cardinals president Mark Lamping and GM Walt Jocketty have persuaded La Russa to join the home team, they owe it to La Genius to give him a competitive roster.”[16]\n\nJocketty, of course, was under no illusions that his work was complete.\n\n“This is a huge step in the process of rebuilding this organization,” he said, “but it’s only the first step.”[17]\n\nThat offseason, the Cardinals traded for Royce Clayton, Todd Stottlemyre, and Dennis Eckersley, and signed Andy Benes and Ron Gant as free agents. The influx of talent combined with La Russa’s drive led the Cardinals to the NL Central championship and the NLCS in 1996.\n\nThat season marked the beginning of a 16-year run in which La Russa led the Cardinals to a 1,408-1,182 record for a .544 winning percentage and the most managerial wins in Cardinals history. Under La Russa’s guidance, the Cardinals won the National League pennant in 2004 and the World Series in 2006 and 2011. After the Cardinals captured the 2011 championship, La Russa announced his retirement. At the time, his 2,728 wins were 35 shy of John McGraw’s mark for the second-most in modern-day history.\n\nIn 2014, La Russa was inducted into the Baseball Hall of Fame and joined the Diamondbacks as Chief Baseball Officer. He later took front-office positions with the Red Sox and Angels.\n\nIn 2021, La Russa returned to the dugout as manager of the White Sox, where he led Chicago to the AL Central championship and passed John McGraw for second place in all-time managerial wins.\n\nEnjoy this post? Find similar stories listed by decade or by player.\n\n[1] Rick Hummel, “‘He’s Kind Of Like Bringing Herzog Back,’” St. Louis Post-Dispatch, October 24, 1995.\n\n[2] Rick Hummel, “La Russa Agrees To Two-Year Deal As Cards Manager,” St. Louis Post-Dispatch, October 24, 1995.\n\n[3] Bernie Miklasz, “Very Nice; Now Get Him Something To Manage,” St. Louis Post-Dispatch, October 24, 1995.\n\n[4] John Hickey, “La Russa takes job with Cards,” Oakland Tribune, October 24, 1995.\n\n[5] Rick Hummel, “La Russa Agrees To Two-Year Deal As Cards Manager,” St. Louis Post-Dispatch, October 24, 1995.\n\n[6] Rick Hummel, “La Russa Agrees To Two-Year Deal As Cards Manager,” St. Louis Post-Dispatch, October 24, 1995.\n\n[7] Rick Hummel, “La Russa Agrees To Two-Year Deal As Cards Manager,” St. Louis Post-Dispatch, October 24, 1995.\n\n[8] John Hickey, “La Russa takes job with Cards,” Oakland Tribune, October 24, 1995.\n\n[9] John Hickey, “La Russa takes job with Cards,” Oakland Tribune, October 24, 1995.\n\n[10] Rick Hummel, “La Russa Agrees To Two-Year Deal As Cards Manager,” St. Louis Post-Dispatch, October 24, 1995.\n\n[11] Rick Hummel, “La Russa Agrees To Two-Year Deal As Cards Manager,” St. Louis Post-Dispatch, October 24, 1995.\n\n[12] Mike Eisenbath, “Skipper Rates An A For Effort, Output,” St. Louis Post-Dispatch, October 24, 1995.\n\n[13] Rick Hummel, “‘He’s Kind Of Like Bringing Herzog Back,’” St. Louis Post-Dispatch, October 24, 1995.\n\n[14] Monte Poole, “St. Louis, La Russa deserve each other,” Oakland Tribune, October 24, 1995.\n\n[15] Rick Hummel, “La Russa Agrees To Two-Year Deal As Cards Manager,” St. Louis Post-Dispatch, October 24, 1995.\n\n[16] Bernie Miklasz, “Very Nice; Now Get Him Something To Manage,” St. Louis Post-Dispatch, October 24, 1995.\n\n[17] Bernie Miklasz, “Very Nice; Now Get Him Something To Manage,” St. Louis Post-Dispatch, October 24, 1995."}, {"url": "https://www.usatoday.com/story/sports/mlb/2021/05/06/tony-la-russa-managerial-mistakes-chicago-white-sox/4966423001/", "page_content": "Talent is the ultimate deciding factor in winning baseball games. If you don't have good players, most of the time you're not going to win.\n\nIt's the manager's job to put those players in the right position to succeed.\n\nToday's question is: How many extra wins will a good manager give a team over one with a bad manager? It's almost impossible to answer, especially with the increasing emphasis many teams' front offices place on analytics that end up taking some decisions out of their managers' hands.\n\nNEVER MISS A PLAY:Sign up for your daily sports newsletter now\n\nWHAT HAPPENED? The NL East was supposed to be MLB's best division\n\nFollow every game: Latest MLB Scores and Schedules\n\nHowever ... we might get a more definitive answer this season than any in recent memory thanks to the Chicago White Sox.\n\nExtra-innings error\n\nWhen 76-year-old Tony La Russa was named manager of the Chicago White Sox this winter after spending the last decade as an executive and consultant, it raised questions about whether the game had passed him by.\n\nSo far this season, those questions remain pertinent.\n\nAfter an April 27 game, La Russa admitted being unaware starting pitcher Lucas Giolito was tiring in the late innings and leaving him in the game too long. In another game, he chose not to pinch-hit for light-hitting Billy Hamilton, trailing by three runs with two on and two out because he \"was looking for a single.\"\n\nThen came Wednesday afternoon's game in Cincinnati.\n\nIn a National League park with the game tied 0-0 in the ninth, La Russa double-switched closer Liam Hendriks in place of left fielder Andrew Vaughn, who made the last out in the top of the inning.\n\nWhen the White Sox came to bat in the top of the 10th, Vaughn's lineup spot was the designated runner to be placed at second base. So La Russa sent Hendriks out as the potential go-ahead run.\n\nUnder MLB's new extra-innings rule, if the pitcher's spot is due start the inning at second base, a manager can instead choose \"the player preceding the pitcher in the batting order.\"\n\nLa Russa was unaware of the rule. When asked about it by a reporter, he responded, \"I'm guessing you know the rules better. Now I know.\"\n\nHendriks advanced to third base in the top of the 10th, but didn't score. Then in the bottom of the frame, he gave up a game-winning single to the Reds' Jesse Winker.\n\nWould Hendriks have done the same thing if he hadn't been out running the bases? No one knows for sure. But it didn't make his job any easier either.\n\nEven with the loss, the White Sox have a 16-13 record, the best run differential in the American League and are just a half-game out of first place in the Central division. But it's hard not to wonder how far ahead they could be with someone other than La Russa calling the shots in the dugout.\n\nDidi does it\n\nThe Philadelphia Phillies are part of a jumbled mess in the NL East division.\n\nThey've struggled offensively and especially defensively so far, but still find themselves as the only team in the division above .500 as play begins on Thursday.\n\nShortstop Didi Gregorius has been one of the biggest contributors to the Phils' defensive woes. His negative-7 defensive runs saved is tied with the Reds' Eugenio Suarez (a third baseman playing shortstop) for the worst mark in the majors.\n\nHowever, Gregorius' bat did serious damage in a 5-4 win over the Milwaukee Brewers as his first-inning grand slam gave the Phillies pitching staff just enough support.\n\nGregorius is also the answer to an interesting bit of trivia. Wednesday's grand slam was the eighth of his career. No other active player has more.\n\nWaiting on you, Cleveland\n\nThe baseball team in Cleveland is intimately familiar with being forced to wait a long time.\n\nAfter the Chicago Cubs defeated them in the 2016 World Series, ending a 108-year drought without a title, Cleveland took over as the MLB team with the longest championship dry spell. It's been since 73 years since Cleveland won it all in 1948.\n\nWith the Baltimore Orioles' John Means tossing a no-hitter in Seattle, we look into the MLB record book and find the team that's gone the longest without a no-no ... You guessed it: Cleveland.\n\nLen Barker's perfect game on May 15, 1981, is the last no-hitter by anyone in a Cleveland uniform. Unless someone can throw one in the next nine days, the no-no-hit streak will reach a full 40 years.\n\nIt might be up to you, Shane Bieber.\n\nFollow Steve Gardner on Twitter @SteveAGardner."}, {"url": "https://simple.wikipedia.org/wiki/Tony_La_Russa", "page_content": "Anthony La Russa Jr. ( ; born October 4, 1944) is an American professional baseball manager of the Chicago White Sox of Major League Baseball (MLB). He is the former manager of the St. Louis Cardinals and Oakland Athletics, as well as a former player.\n\nAs a player, La Russa made his major league debut in 1963 and spent parts of five major league seasons with the Kansas City/Oakland Athletics, Atlanta Braves and Chicago Cubs.\n\nin December 2013, La Russa was elected a member of the Hall of Fame by the 16-member Veterans Committee.[1]"}, {"url": "https://www.encyclopedia.com/reference/encyclopedias-almanacs-transcripts-and-maps/la-russa-tony", "page_content": "Citation styles\n\nEncyclopedia.com gives you the ability to cite reference entries and articles according to common styles from the Modern Language Association (MLA), The Chicago Manual of Style, and the American Psychological Association (APA).\n\nWithin the “Cite this article” tool, pick a style to see how all available information looks when formatted according to that style. Then, copy and paste the text into your bibliography or works cited list.\n\nBecause each style has its own formatting nuances that evolve over time and not all information is available for every reference entry or article, Encyclopedia.com cannot guarantee each citation it generates. Therefore, it’s best to use Encyclopedia.com citations as a starting point before checking the style against your school or publication’s requirements and the most-recent information available at these sites:\n\nModern Language Association http://www.mla.org/style The Chicago Manual of Style http://www.chicagomanualofstyle.org/tools_citationguide.html American Psychological Association http://apastyle.apa.org/\n\nNotes:"}, {"url": "https://abc7chicago.com/tony-la-russa-chicago-white-sox-manager-rick-hahn/7455095/", "page_content": "Tony La Russa stands with his Major League Baseball Hall of Fame plaque before the second game of a baseball doubleheader against the Detroit Tigers in Chicago.\n\nTony La Russa stands with his Major League Baseball Hall of Fame plaque before the second game of a baseball doubleheader against the Detroit Tigers in Chicago.\n\nTony La Russa stands with his Major League Baseball Hall of Fame plaque before the second game of a baseball doubleheader against the Detroit Tigers in Chicago.\n\nTony La Russa stands with his Major League Baseball Hall of Fame plaque before the second game of a baseball doubleheader against the Detroit Tigers in Chicago.\n\nCHICAGO (WLS) -- The Chicago White Sox have named Hall of Famer Tony La Russa to serve as the team's next manager.\n\nLa Russa, 76, has not managed in MLB since 2011 when he retired as manager of the St. Louis Cardinals. He started his career with the Chicago White Sox from 1979 to 1986, where he helped the team to the Al West division title in 1983. He was later fired by then-general manager Ken \"Hawk\" Harrelson.\n\nLa Russa would go on to be MLB's third-winningest manager with stints in Oakland and St. Louis, including three World Series wins.\n\n\"We are extremely excited about the future of this team,\" said Rick Hahn, White Sox general manager/senior vice president. \"As we showed in 2020, this is a young, talented club that we expect to only grow better and better in the coming years. Adding in a Hall of Fame manager who is recognized as being one of the best in the history of the game, we are a step closer to our goal of bringing White Sox fans another championship.\"\n\n\"While I have had other inquiries about managing since retiring, this opportunity with the White Sox brings together a number of important factors that make this the right time and the right place,\" La Russa said. \"The on-field talent is amazing, and the front office, led by Kenny Williams and Rick Hahn, has done everything necessary to create an atmosphere of long-term success. All of those factors aligned to make this a tremendous opportunity, and I am excited to get going as soon as possible by building a coaching staff and getting to work.\"\n\nAfter retiring as manager of the Cardinals, La Russa has served as an executive with Major League Baseball, Arizona Diamondbacks, Boston Red Sox and the Los Angeles Angels.\n\nHe replaces Rick Renteria, who was fired after the White Sox fell to the Oakland A's in the first round of the MLB playoffs.\n\nIn his first stint with the White Sox, La Russa had a record of 522-510, including 99 wins in 1983. In 33 seasons as an MLB manager, La Russa compiled a 2,728-2,365 record.\n\nHe was inducted into the Baseball Hall of Fame as a manager in 2014."}]}