{"Tony La Russa Jr. is best known for his tenures as manager of the Chicago White Sox (1979–1986), Oakland Athletics (1986–1995), and St. Louis Cardinals (1996–2011).": [{"url": "https://www.britannica.com/biography/Tony-La-Russa", "page_content": "Tony La Russa, byname of Anthony La Russa, Jr., (born October 4, 1944, Tampa, Florida, U.S.), American professional baseball manager who led his teams to three World Series titles (1989, 2006, and 2011) and was one of the winningest managers in major league history.\n\nLa Russa signed to play baseball with the Kansas City Athletics (or “A’s”) out of high school. He spent the majority of his 16-season playing career in the minor leagues, but he appeared sporadically in the majors with the A’s (both in Kansas City and, later, in Oakland, where the franchise moved), the Atlanta Braves, and the Chicago Cubs. He was named the manager of a minor-league affiliate of the Chicago White Sox in 1978, and his first big-league managerial job came the following year, when he took over the White Sox late in the 1979 season.\n\nBritannica Quiz Baseball\n\nThe cerebral La Russa—who earned a law degree shortly before assuming managerial duties in Chicago—proved to be a natural leader in the clubhouse. He developed a managerial style that consisted of frequent in-game situational substitutions that came in response to the great attention he paid to the nuances and flow of a particular game (which occasionally led to criticism that La Russa “overmanaged”). In 1983 he guided the White Sox to a 99-win season and the team’s first playoff appearance in 24 years. However, a slow start to the 1986 campaign and a strained working relationship with the team’s new general manager (former outfielder Ken Harrelson, who left the announcing booth to spend only one tumultuous season running the White Sox) led to La Russa’s being fired three months into the season. He was out of work for less than a month before he was hired to manage the A’s.\n\nLa Russa quickly turned the A’s into the most-dominant team in baseball. He led Oakland to the highest win total in the major leagues for three straight seasons (1988–90), each of which also ended with the Athletics’ winning the American League (AL) pennant. The team was upset in two of its World Series appearances during that period, but the A’s did defeat the San Francisco Giants to win a championship in 1989. La Russa and the A’s won another division title in 1992, but after the team posted three consecutive losing seasons (1993–95), he opted out of his contract and signed with the St. Louis Cardinals.\n\nLa Russa’s third managerial stint was even more successful than his first two. In his initial season in St. Louis, he guided the Cardinals to the first of seven division titles the team would win during his tenure. The Cardinals won a National League (NL) pennant in 2004, and in 2006 the team beat the Detroit Tigers to win the World Series. In 2011 La Russa led St. Louis on improbable comebacks to clinch a postseason berth (after trailing in the Wild Card standings by 8 1/2 games with a month remaining in the regular season) and to win the World Series (after twice being one strike away from elimination). La Russa retired soon after earning his third championship ring. He had been named the AL’s Manager of the Year three times (1983, 1988, and 1992) and won the NL’s version of the award in 2002.\n\nThree years after his retirement from managing, La Russa joined the Arizona Diamondbacks as the team’s chief baseball officer. He was demoted to an advisory role with the franchise following the 2016 season after the Diamondbacks ran off three consecutive losing campaigns during his tenure, and he left the team after the 2017 season. La Russa then joined the Boston Red Sox as an assistant to the team’s general manager. After the 2020 season he returned to the Chicago White Sox as general manager. In his first season back with the team, Chicago finished first in the Central Division, and La Russa won his 2,764th game, which moved him into second place for most career wins by a general manager. In the 2021 postseason the White Sox lost in the AL Division Series.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nLa Russa published a memoir, One Last Strike: Fifty Years in Baseball, Ten and a Half Games Back, and One Final Championship Season (written with Rick Hummel), in 2012. He was inducted into the Baseball Hall of Fame in 2014."}, {"url": "https://www.washingtonpost.com/sports/2020/10/29/tony-la-russa-chicago-white-sox-manager/", "page_content": "Comment on this story Comment Gift Article Share\n\nTony La Russa is a Hall of Famer, a four-time manager of the year, a three-time World Series champion and the winningest manager in baseball in the past 75 years. But when the Chicago White Sox named La Russa their new manager Thursday, hiring him to guide a young, talented roster that this year earned the franchise its first playoff appearance since 2008, it was as risky a managerial move as any in recent memory.\n\nLa Russa is 76. He last managed in 2011, when he guided the St. Louis Cardinals to the World Series title. He retired shortly afterward, ending (or so it appeared) a 33-year managerial career in which he won 2,728 games, the third most in history behind only Connie Mack and John McGraw. He was elected to the National Baseball Hall of Fame in 2013.\n\nThe move appears to be White Sox owner Jerry Reinsdorf’s attempt at correcting what he considers one of the biggest mistakes of his tenure — firing La Russa as manager in 1986 after eight seasons. La Russa went on to win one World Series title with the Oakland Athletics and two with the Cardinals, gaining a reputation for being ahead of the curve in strategic deployments such as bullpen specialization.\n\nAfter retiring in 2011, he worked in the front office of MLB, as well as for the Arizona Diamondbacks, the Boston Red Sox and most recently the Los Angeles Angels.\n\nAdvertisement\n\n“As everyone in baseball is well aware, I have always respected Tony and am proud to have maintained a great friendship with him over the decades in the game,” Reinsdorf said in a statement. “But his hiring is not based on friendship or on what happened years ago, but on the fact that we have the opportunity to have one of the greatest managers in the game’s history in our dugout at a time when we believe our team is poised for great accomplishments.”\n\nThe White Sox fired Rick Renteria as manager shortly after this season, which saw the White Sox go 35-25 and finish tied for second in the American League Central. The White Sox lost in three games to the A’s in the first round of the playoffs. They have been considered a rising power for several years and appear poised to build off this season’s success in the coming years. The White Sox, however, haven’t made back-to-back playoff appearances in their 120-year history.\n\n“We are extremely excited about the future of this team,” General Manager Rick Hahn said in a statement. “As we showed in 2020, this is a young, talented club that we expect to only grow better and better in the coming years. Adding in a Hall of Fame manager who is recognized as being one of the best in the history of the game, we are a step closer to our goal of bringing White Sox fans another championship.”\n\nThe White Sox are not known to have interviewed other candidates for the job. In hiring La Russa, they may have been swayed at least in part by the success this season of 71-year-old Dusty Baker, who was hired to guide the Houston Astros beyond the sign-stealing scandal of this winter and who took the team to the AL Championship Series before losing to the Tampa Bay Rays.\n\nAdvertisement\n\n“While I have had other inquiries about managing since retiring, this opportunity with the White Sox brings together a number of important factors that make this the right time and the right place,” La Russa said in a statement. “The on-field talent is amazing, and the front office … has done everything necessary to create an atmosphere of long-term success. All of those factors aligned to make this a tremendous opportunity, and I am excited to get going as soon as possible by building a coaching staff and getting to work.”\n\nBut it isn’t only La Russa’s age — only Mack and Jack McKeon were older — that makes his hiring a risky move. He also has been outspoken against athletes kneeling during the national anthem, saying in an interview with Sports Illustrated in 2016 that it is “disrespectful” and questioning the “sincerity” of quarterback Colin Kaepernick.\n\n“Even if he was sincere,” La Russa said of Kaepernick, “there are other ways of showing your concern. Disrespecting our flag is not the way to do it.”\n\nAdvertisement\n\nLa Russa attempted to back off that criticism Thursday in a video news conference announcing his hiring, saying: “I know in 2016, when the first issue occurred, my initial instincts were all about, you know, respecting the flag and the anthem and what America stands for. There’s been a lot [that] goes on, in a very healthy way, since 2016. Not only do I respect but I applaud the awareness that’s come into not just society but especially in sports.\n\n“If you talk about specifically baseball, I applaud and would support the fact that they are now addressing, identifying the injustices, especially on the racial side. And as long as it’s peacefully protested and sincere, and what I’m learning more and more, like with the Players’ Alliance and especially with the White Sox, when your protests actually have action-oriented results, the way that you’re going to impact to make things better, I’m all for it,” he continued.\n\nTony La Russa addresses his 2016 comments about kneeling during the National Anthem pic.twitter.com/KgXZFJHjbj — White Sox Talk (@NBCSWhiteSox) October 29, 2020\n\nOne of the team leaders of the White Sox, shortstop Tim Anderson, serves on the board of the Players’ Alliance, a nonprofit made up of Black current and former baseball players that formed out of the swell of protests for social justice following the death of George Floyd. Its mission, according to its website, is “to create an inclusive culture within baseball and the community, where differences are leveraged to elevate racial equality and provide greater opportunities for the Black community.”\n\nAdvertisement\n\nBefore Opening Day of 2020, Anderson and teammates José Abreu, Eloy Jiménez, Luis Robert and Lucas Giolito — who form the core of the Chicago’s young and talented roster — all knelt during the anthem.\n\nBefore La Russa ever sets foot in the dugout, he will need to initiate honest discussions with those players and others about his stance on those matters. Baseball in 2020 is different than it was the last time La Russa managed, and so for that matter is America.\n\nRead more on baseball:\n\nGiftOutline Gift Article"}, {"url": "https://www.espn.com/mlb/story/_/id/34572816/chicago-white-sox-manager-tony-la-russa-recovering-pacemaker-procedure-return-date-tbd", "page_content": "OAKLAND, Calif. -- Chicago White Sox manager Tony La Russa says he is recovering well from having a pacemaker inserted for his heart and is uncertain when he'll return to run the club.\n\nLa Russa was back with the White Sox in Oakland on Sunday to celebrate Dave Stewart having his No. 34 jersey retired by the Athletics. La Russa was there for the ceremony but not to manage his team.\n\nThe Hall of Famer, who turns 78 on Oct. 4, shared specifics of the procedure with The Associated Press after discussing his health before Chicago's series finale against the Athletics. He said he is grateful to have had what he considered a relatively \"simple'' heart issue.\n\n\"Health is nothing to mess with,'' La Russa said, standing in the dugout wearing jeans, sneakers and a short-sleeve collared golf shirt. \"So I got checked in Chicago and the reason that I flew to Arizona is that's been the place since the '90s I've had my physicals. They addressed it, they fixed it and now it's just a question of regaining strength.''\n\nLa Russa didn't want to miss the special day for Stewart, his longtime ace with the A's.\n\n\"It was an amazing bunch of years,'' La Russa said of his stretch with Oakland from 1986-1995 that included the 1989 earthquake World Series sweep of the San Francisco Giants.\n\nLa Russa is uncertain when he will be in uniform again and back in the dugout. Bench coach Miguel Cairo has been leading the club during La Russa's nearly two-week absence. He was set to manage the reigning AL Central champions on Aug. 30 before being pulled away by the medical staff.\n\n\"I'm glad to see him. He looks really good,'' Cairo said. \"I've been talking to him so I know how he feels and he's feeling good and he's smiling. I'm glad to see him. I know the whole team is glad to see him.''\n\nThe plan is for La Russa to fly home with the team Sunday, take Monday's team off day then see what's next -- \"I don't plan on being in uniform until the say it's time to put a uniform on.''\n\nLa Russa and Cairo have been speaking twice a day and La Russa watches every game from home until he is cleared to do more. He said he had an issue at spring training, too.\n\n\"I've had my issue fixed, I'm mending,'' La Russa said. ''When it gets better at some point, I'll be strong enough to do a triathlon.\"\n\nSo, might he actually consider training for a triathlon?\n\n\"No chance,'' La Russa said, grinning."}, {"url": "https://www.espn.com/mlb/story/_/id/32401127/white-sox-manager-tony-la-russa-return-manager-2022-season-source-says", "page_content": "Tony La Russa will return to manage the Chicago White Sox for the 2022 season, a source told ESPN on Thursday.\n\nWhite Sox stars Tim Anderson and Jose Abreu had both publicly lobbied for the 77-year-old La Russa to return this week after Chicago was eliminated by the Houston Astros in Game 4 of the American League Division Series.\n\n\"I want him to be back,\" Anderson said Thursday. \"At the end of the day, my decision doesn't really matter. I guess it all depends on what the front office thinks. ... I definitely want him in. I think he did a great job with the way he managed and just being open.\"\n\nOn Wednesday, Abreu had said he \"was pretty sure\" La Russa would return.\n\n\"He won't leave us alone. He's going to be with us,\" Abreu said, according to the Chicago Sun-Times.\n\nAbreu also said he appreciated La Russa's postgame comments in which he said Abreu was hit \"intentionally\" by Astros reliever Kendall Graveman in the bottom of the eighth inning in Game 4.\n\n\"It was a natural reaction. That's the kind of reaction that I would have if something happened to one of my children,\" Abreu told reporters, according to MLB.com. \"Tony was trying to protect me, and he's always trying to protect us.\"\n\nLa Russa's future was a bit of a question after the White Sox's season ended Tuesday. He said afterward it's up to management first and then the players. If they want him back, then \"you check and see whether you got the desire to continue to manage, so I do,\" he said.\n\nChairman Jerry Reinsdorf lured La Russa to Chicago out of retirement for a second stint with the franchise that gave him his first major league managing job, hoping the three-time World Series winner could lead a team stacked with stars to a deep October run.\n\nLa Russa hadn't filled out a lineup card since he led the St. Louis Cardinals to the World Series championship in 2011, and there were questions about how his old-school ways would mesh with the team's young and vibrant stars such as Anderson.\n\n\"Everybody thought we weren't going to get along,\" said Anderson, who made his first All-Star team this season. \"But overall, we were talking behind the scenes the whole time. Just for him, the players come first and he makes that known. We're one big family.\"\n\nLa Russa had a public disagreement with a couple of his players after he scolded Yermin Mercedes for homering on a 3-0 pitch during the ninth inning of a 16-4 victory over Minnesota in May.\n\nBut with one of the top lineups and pitching staffs in baseball, the White Sox rolled to a 93-69 record and beat Cleveland by 13 games in the AL Central for their first division championship in 13 years. The win total was their highest since the 2005 World Series championship team went 99-63.\n\nLa Russa passed John McGraw for second place on baseball's all-time victories list behind Connie Mack while guiding the White Sox to their second straight playoff appearance. They had never made the postseason in back-to-back years. But after getting knocked out by the Oakland Athletics in the wild-card round in 2020, they failed again to advance and were beaten by Houston in convincing fashion.\n\n\"I think he did a great job, coming in and being a part of what we've been trying to do,\" Anderson said. \"I couldn't be more happy than what he did. The relationship was great overall. Everybody was just getting along with him. I think he came in and did what he was supposed to do.\"\n\nThe Associated Press contributed to this report."}, {"url": "https://www.wikiwand.com/en/Tony_La_Russa", "page_content": "Anthony La Russa Jr. ( ; born October 4, 1944) is an American former professional baseball player, coach, and manager. His MLB career has spanned from 1963 to 2022, in several roles. He is the former manager of the St. Louis Cardinals, Oakland Athletics, and Chicago White Sox. In 33 years as a manager, La Russa guided his teams to three World Series titles, six league championships, and 13 division titles. His managerial total of 2,902 MLB wins is second only to Connie Mack's.\n\nAmerican baseball player and manager\n\nBaseball player\n\nQuick facts: Tony La Russa, MLB debut, Last MLB appearance... ▼\n\nAs a player, La Russa made his major league debut in 1963 and spent parts of five major league seasons with the Kansas City / Oakland Athletics, Atlanta Braves, and Chicago Cubs. After a shoulder injury during the 1964–65 off-season, he returned to college and received a degree from the University of South Florida before playing much of the remainder of his career in the minor leagues until retiring in 1977. He then earned a Juris Doctor degree from Florida State University.\n\nNamed manager of the White Sox in the middle of the 1979 season, La Russa guided the team to an American League West division title four seasons later. In the middle of the 1986 season, he was fired by the White Sox and hired less than three weeks later by the Athletics. La Russa led the A's to three consecutive American League championships from 1988 to 1990 and the 1989 World Series title. He left Oakland after the 1995 season to manage the Cardinals, whom he led the team to three National League championships and the 2006 and 2011 World Series titles. La Russa retired after winning the 2011 title and 34 seasons as a major league manager. Three months later, he accepted a position helping fellow former manager Joe Torre, the executive vice president for MLB operations. In 2014, he became the chief baseball officer for the Arizona Diamondbacks. In November 2019, he joined the Los Angeles Angels as a senior advisor of baseball operations. In the 2021 offseason, he was named the manager of the White Sox; he retired in 2022 due to health concerns.\n\nIn 2013, La Russa was unanimously elected to the Hall of Fame by the 16-member Veterans Committee. The induction ceremony was held at Cooperstown, New York, on July 27, 2014.[1] On August 16, 2014, he was inducted into the St. Louis Cardinals Hall of Fame Museum."}, {"url": "https://www.espn.com/mlb/story/_/id/34720057/tony-la-russa-stepping-chicago-white-sox-manager-due-health-concerns", "page_content": "CHICAGO -- Tony La Russa is stepping down as Chicago White Sox manager because of health concerns that kept him out of the dugout for the final five weeks of the season, he announced in a statement released Monday.\n\nLa Russa, who will turn 78 on Tuesday, hasn't managed a game since abruptly leaving Guaranteed Rate Field on Aug. 30 after doctors told him he needed to undergo further testing related to a heart issue.\n\nAccording to La Russa on Monday, there was an issue with the pacemaker he had implanted in February that forced him to step away from the team. During his absence, a second issue was diagnosed, forcing him to take an indefinite leave.\n\nHe was under contract through the 2023 season.\n\n\"At no time this season did either issue negatively affect my responsibilities as White Sox manager,\" La Russa said in the statement. \"However, it has become obvious that the length of the treatment and recovery process for this second health issue makes it impossible for me to be the White Sox manager in 2023. The timing of this announcement now enables the front office to include filling the manager position with their other off-season priorities.\"\n\nLa Russa also noted that his \"overall prognosis is good, and I want to thank everyone who has reached out to me with well wishes related to my health.\"\n\nIn La Russa's absence, the underachieving White Sox did get an initial boost from acting manager Miguel Cairo, but that was short-lived as the team was swept at home by the Cleveland Guardians in a key September series. The White Sox went on to lose eight in a row and are now hoping to at least finish at .500 or above for the third consecutive season.\n\n\"Our team's record this season is the final reality,\" La Russa said in the statement. \"It is an unacceptable disappointment. There were some pluses, but too many minuses. In the Major Leagues, you either do or you don't. Explanations come across as excuses. Respect and trust demand accountability, and during my managerial career, I understood that the ultimate responsibility for each minus belongs to the manager.\n\n\"I was hired to provide positive, difference-making leadership and support. Our record is proof. I did not do my job.\"\n\nLa Russa's second stint with the team, after managing the White Sox in the early 1980s, drew headlines for his unorthodox moves, but the team won the AL Central by 13 games in his first season.\n\nThis year has been anything but smooth. The White Sox have hovered around the .500 mark all year despite being preseason favorites to win the division again. La Russa intentionally walked two batters who had two strikes on them, further garnering headlines and controversy.\n\nSpeaking at a news conference Monday in front of reporters and some White Sox players, La Russa said he might not have returned to manage even if he was healthy, understanding the intensity of the backlash from fans with him at the helm.\n\n\"For the first time, there's enough negativity in my managing, I worried about being a distraction to the ballclub and the organization,\" La Russa said. \"The fans could have decided that for me, personally.\"\n\nGeneral manager Rick Hahn was asked if the team planned on bringing La Russa back if not for his health concerns.\n\n\"And that's hypothetical,\" he said. \"I mean the thing played out the way it played out.\"\n\nHahn indicated a wide-ranging search for a new manager will begin immediately with the organization looking outside the White Sox family.\n\n\"One thing that perhaps breaks from the mold of at least the last few hires: Having a history with the White Sox, having some sort of connection to White Sox DNA is by no means a requirement,\" Hahn said.\n\nThat idea might eliminate former White Sox manager Ozzie Guillen from a return as well as ex-catcher A.J. Pierzynski. Hahn indicated one exception to that rule -- Cairo will get an interview.\n\n\"Outside of Miguel, having that history with the White Sox is not necessarily a characteristic that we're looking for at this time,\" Hahn said. \"Ideally ... the right candidate is someone who has recent experience in the dugout with an organization that has contended for championships. Ideally, it's someone who is an excellent communicator, is someone who understands the way the game has grown and evolved in the last decade or so but at the same time has respect for old-school sensibilities.\"\n\nCloser Liam Hendriks was asked what characteristics he preferred in the next manager.\n\n\"As a unit, I think we need an authoritarian,\" Hendriks said.\n\nThe White Sox were plagued by poor defense and fundamentals while enduring a myriad of injuries to key players. They also lacked power on offense compared to previous seasons.\n\n\"It was a disappointing year,\" Hahn said. \"We all need to get better at multiple facets. There needs to be ... obviously manager/staff changes and personnel changes. My only point is, and it's easy at the end of a disappointing season to say you have to burn it to the ground. I think that's not where we're at as an organization.\"\n\nCairo, who played for La Russa before becoming his bench coach in Chicago, said the team will miss the veteran manager.\n\n\"He's my mentor. I've learned so much from him,'' Cairo said after Monday's win over the Twins. \"And of course I'm going to keep calling to keep learning. But we're going to miss him, for sure.''\n\nLa Russa expressed disappointment in not being able to see things through with the White Sox but noted that the \"future for this team remains bright.\"\n\n\"I still appreciate the chance to come back home to the White Sox and leave today with many more good memories than disappointments,\" he said. \"As I have said many times during my career, no manager has ever had more good fortune than I have.\"\n\nThe Associated Press contributed to this report."}, {"url": "https://www.espn.com/mlb/story/_/id/31468198/chicago-white-sox-manager-tony-la-russa-upset-rookie-yermin-mercedes-not-showing-respect-your-opponent-victory", "page_content": "White Sox manager Tony La Russa expressed disappointment in Yermin Mercedes after his designated hitter swung at a 3-0 pitch in the ninth inning of a game Chicago was leading 15-4 at the Minnesota Twins on Monday night.\n\nMercedes smashed the 47 mph pitch over the center-field fence for his third hit of the game.\n\n\"Big mistake,\" La Russa said Tuesday. \"The fact that he's a rookie, and excited, helps explain why he just was clueless. But now he's got a clue.\"\n\nBecause of the large deficit, the Twins were pitching infielder Willians Astudillo at the time. He got behind Mercedes 3-0 before basically lobbing the ball to the plate. Mercedes crushed it, then celebrated with his teammates while his manager seethed.\n\n\"I took several steps from the dugout onto the field, yelling, 'Take, take, take,'\" La Russa recalled. \"The way he was set up, it looked to me like he was going to swing.\n\n\"I was upset because that's not a time to swing 3-0. I knew the Twins knew I was upset. ... He missed a 3-0 take sign. With that kind of lead, that's just sportsmanship and respect for your opponent.\"\n\nMercedes is known as a free spirit and fan favorite in Chicago. While La Russa all but guaranteed it wouldn't happen again, his best hitter declared he wasn't going to change.\n\n\"I'm always doing Yermin,\" he said. \"For that reason, I'm here right now. For that reason, you guys are talking to me right now. If I'm not Yermin, if I'm not doing that, nobody wants to talk to me, nobody wants to know what I'm doing.\"\n\nLa Russa's entire availability with reporters encompassed the unwritten rules of the game. He even referenced Fernando Tatis Jr. swinging 3-0 for the San Diego Padres in a blowout last year, which brought him some backlash. The 76-year-old White Sox manager said he isn't against some progress in the game. He is on board with celebrations, for example.\n\n\"MLB wants to encourage theatrics, and they want players to have fun,\" La Russa said. \"I talked to a bunch of my counterparts; if everyone is doing it, then no one can get upset.\"\n\nMercedes, 28, leads the major leagues in batting average and is one of baseball's most interesting storylines. He toiled in the minors until finally getting a chance to play this year, and he already is the front-runner for American League Rookie of the Year. But that won't excuse him from his mistake, according to La Russa.\n\n\"There will be a consequence he has to endure here within our family,\" the manager said. \"It's a learning experience.\"\n\nMercedes was in the lineup on Tuesday against the Twins, so he won't be punished with playing time, though La Russa wouldn't expand on the consequences.\n\n\"I'm certain that will not happen again with Yermin,\" La Russa said. \"It's a manager's responsibility. It's a teaching moment. You want them to understand why there's a take sign in that situation.\n\n\"I'm absolutely certain the guy is not going to swing 3-0 in another situation.\"\n\nLa Russa is also mindful of what rubbing it in could mean for other players on his team.\n\n\"I don't want to ever give the other team an excuse to take a shot at one of our players,\" he said. \"We were taught from day one to respect the game, respect the competition, respect the opponent.\n\n\"I heard he said something like, 'I play my game.' No, he doesn't. He plays the game of Major League Baseball, respects the game, respects the opponents. And he's got to respect the [take] sign.\"\n\nIt's unclear if Mercedes got the message La Russa was sending. He just wants to keep being himself on the field.\n\n\"I'm going to play my game,\" Mercedes said. \"I can't be another person. If I change, everything is going to change.\"\n\nThe Twins, as expected, weren't happy with the 3-0 home run, either, and they took matters into their own hands on Tuesday. Reliever Tyler Duffey threw behind Mercedes when he came to the plate in the top of the seventh inning.\n\nDuffey was ejected, and moments later, Minnesota manager Rocco Baldelli was, as well. Before the game, Baldelli had expressed his own dissatisfaction with the home run.\n\nThe Twins, perhaps fueled by all the drama, overcame a 4-0 deficit en route to a 5-4 home victory.\n\nAfter the loss, La Russa did not argue against the Twins' strategy.\n\n\"I wasn't that suspicious. I'm suspicious when someone throws at someone's head,\" he said. \"I didn't have a problem with how the Twins handled that.\""}, {"url": "https://www.espn.com/mlb/story/_/id/30218070/chicago-white-sox-name-tony-la-russa-76-new-manager", "page_content": "Tony La Russa, the Hall of Famer who won a World Series with the Oakland Athletics and two more with the St. Louis Cardinals, is returning to manage the Chicago White Sox -- 34 years after they fired him.\n\nLa Russa, 76, rejoins the franchise where his managing career began more than four decades ago. He takes over for Rick Renteria after what the White Sox insisted was a mutual agreement to split.\n\n\"We are extremely excited about the future of this team,'' general manager Rick Hahn said Thursday. \"As we showed in 2020, this is a young, talented club that we expect to only grow better and better in the coming years. Adding in a Hall of Fame manager who is recognized as being one of the best in the history of the game, we are a step closer to our goal of bringing White Sox fans another championship.''\n\nLa Russa inherits a team loaded with young stars and productive veterans that made the playoffs for the first time since 2008, only to sputter down the stretch and get knocked out in the wild-card round.\n\nHe becomes the oldest manager in the major leagues by five years. Houston's Dusty Baker is 71.\n\n\"It was very difficult to sit and think about what's going on downstairs. It's always more fun downstairs. My heart was always in the dugout,\" said La Russa, who has served in front office jobs for multiple teams since 2014.\n\n\"I think all managers would understand this, how rare it is to get an opportunity to manage a team that's this talented and this close to winning. ... The last few days, as this has gotten closer, my internal response has been excitement. No regret. I'm fired up and ready to go.\"\n\nLa Russa later took to Twitter as well.\n\nFired up to join @whitesox, a contending team in a tough division. Add my best efforts to theirs. Lots of comments. Some supportive and some not. Get to work and see the results. — Tony La Russa (@TonyLaRussa) October 30, 2020\n\nAccording to the Elias Sports Bureau, La Russa joins Jack McKeon as the only managers in MLB history to take over a team at age 75 or older. McKeon was 80 when he took over the Marlins in 2011.\n\n\"While I have had other inquiries about managing since retiring, this opportunity with the White Sox brings together a number of important factors that make this the right time and the right place,'' La Russa said. \"The on-field talent is amazing, and the front office, led by Kenny Williams and Rick Hahn, has done everything necessary to create an atmosphere of long-term success. All of those factors aligned to make this a tremendous opportunity, and I am excited to get going as soon as possible by building a coaching staff and getting to work.''\n\nLa Russa, who started his managing career with the White Sox during the 1979 season, is returning to the dugout for the first time since 2011, when he led St. Louis past the Texas Rangers in the World Series. He also won championships with Oakland in 1989 and the Cardinals in 2006.\n\nAll-Time Managerial Wins Tony La Russa ranks third in wins among managers in major league history and is second only to Connie Mack for games managed. Manager Wins Connie Mack 3,731 John McGraw 2,763 Tony La Russa 2,728 Bobby Cox 2,504 Joe Torre 2,326\n\nLa Russa is 2,728-2,365 with six pennants over 33 seasons with Chicago, Oakland and St. Louis. He was enshrined in Cooperstown in 2014. Only Hall of Famers Connie Mack (3,731) and John McGraw (2,763) have more victories.\n\nLa Russa got his first major league managing job at age 34 when the White Sox promoted him from Triple-A to replace the fired Don Kessinger. He took over that August and led them to a 522-510 record over parts of eight seasons.\n\nThe 1983 team won 99 games on the way to the AL West championship -- Chicago's first playoff appearance since the 1959 Go-Go White Sox won the pennant. But he was fired in 1986 by then-general manager Ken Harrelson after the White Sox got off to a 26-38 start.\n\nChairman Jerry Reinsdorf has long regretted allowing that move and remains close with La Russa. Now, they're reuniting.\n\n\"His hiring is not based on friendship or on what happened years ago, but on the fact that we have the opportunity to have one of the greatest managers in the game's history in our dugout at a time when we believe our team is poised for great accomplishments,'' Reinsdorf said.\n\nLa Russa was asked if his relationship with Reinsdorf is why he got the job.\n\n\"If there was any truth to what you're saying, it would not be reading Jerry Reinsdorf correctly,\" La Russa said. \"His major interest on the baseball side is what's best for the Chicago White Sox and the fans who drive to the ballpark in droves. He understands how much I love the game. I understand how much he loves it. Beyond that, I don't think its a factor.\"\n\nThe move is a surprise considering how long it has been since La Russa was in the dugout. Hahn said the White Sox were looking for someone who has \"experience with a championship organization in recent years.''\n\n\"This was made with the intent solely on putting us in the best position to win championships,\" Hahn said. \"It's easy to fall back on some old narratives that this was about friendship or potentially righting old wrongs. In the end, Tony was the choice because we believe Tony is the best man to help us win championships over the next several years.\"\n\nBack In The Saddle The 34 years between managerial jobs with the same team for Tony La Russa is the longest span, by far, in MLB/NFL/NHL/NBA history. Span Manager Yrs Team 1986-21 Tony La Russa 34 CWS 1931-55 Dick Irvin 23 Chi. (NHL) 1954-76 Paul Richards 21 CWS 1933-55 Bucky Harris 21 Det. Elias Sports Bureau\n\nFormer Houston manager AJ Hinch and ex-Boston skipper Alex Cora fit that championship-experience description. Both were suspended by Major League Baseball for the 2020 season for their roles in the Astros sign-stealing scandal, and both lost their manager jobs. Their punishments ended this week.\n\nThough he hasn't been in a dugout in nine years, La Russa has remained a part of the game.\n\nShortly after retiring, he went to work in the league office for two years, assisting former Yankees manager Joe Torre in on-field discipline issues.\n\nIn May 2014, he was hired by the Arizona Diamondbacks to oversee their baseball operations. They signed Zack Greinke to a $206.5 million deal following the 2015 season. La Russa was demoted to an advisory role following a 93-loss season in 2016 and joined Boston's front office as a special assistant to then-president Dave Dombrowski in November 2017.\n\nLa Russa was with the Red Sox when they hired Cora and won the World Series in 2018. And he spent last season as a senior adviser for baseball operations with the Los Angeles Angels, assisting in player development. Whether any of manager Joe Maddon's eccentricities rubbed off on him remains to be seen.\n\nMaddon keeps a loose and fun atmosphere, whether it's having a magician or zoo animals at the ballpark or showing up for a spring training workout decked out in tie-dye with a 1970s van blasting Earth, Wind & Fire's \"Shining Star.'' La Russa, of course, was known more for his scowl than his smile. Now he's taking on a vibrant and outgoing team, where sky-high bat flips by Tim Anderson seem almost as common as pop flies.\n\nThen again, he's no stranger to managing outsized personalities. He had Rickey Henderson and Jose Canseco in Oakland, after all.\n\n\"I always reasoned that if it's sincere, I don't have a problem with it,\" La Russa said about younger players showing emotion. \"You want your players passionately involved in the competition.\"\n\nThe White Sox have never made back-to-back playoff appearances. But after ending a string of seven losing seasons, they are in position to change that.\n\nThey have a core of young players on team-friendly deals, starting with Anderson. Veteran Jose Abreu put himself in the running for AL MVP by driving in 60 runs. Ace Lucas Giolito pitched his first no-hitter.\n\nEloy Jimenez hit .296 with 14 homers and 41 RBIs. Luis Robert, who agreed to a six-year, $50 million contract in January, showed star potential in a roller-coaster rookie year. He got off to a great start and hit a massive homer in the playoff series against Oakland, though he also slumped in September.\n\nNow the White Sox are banking on La Russa to help push them to championships, just as he did with Oakland and St. Louis.\n\n\"This hiring today is another indication we've moved on to that final, most exciting stage,\" Hahn said. \"That's the one competing for championships.\"\n\nESPN's Jesse Rogers and The Associated Press contributed to this report."}, {"url": "https://www.onthisday.com/people/tony-la-russa", "page_content": "Profession: Baseball Manager\n\nBiography: Best known for his tenures as manager of the Chicago White Sox, Oakland Athletics, and St. Louis Cardinals.\n\n\n\nLa Russa guided his teams to three World Series titles, six league championships and twelve division titles in 33 seasons.\n\nBorn: October 4, 1944\n\nBirthplace: Tampa, Florida, USA\n\nAge: 78 years old\n\nGeneration: Silent Generation\n\nChinese Zodiac: Monkey\n\nStar Sign: Libra"}, {"url": "https://www.cbsnews.com/chicago/news/tony-larussa-named-as-white-sox-manager/", "page_content": "CHICAGO (CBS) -- The White Sox are betting their future on their past, naming Tony La Russa as the team's new manager.\n\nThe last time around, you would have seen Johnny Morris reporting on La Russa's White Sox for the evening news on CBS 2 after their games at old Comiskey Park. Now they'll be playing at Guaranteed Rate Field as the Sox have for the past 29 years, and CBS 2's Matt Zahn reported on the new edition of La Russa's White Sox on Thursday.\n\nLa Russa, 76, was last at the helm of the White Sox 34 years ago. Even though there had been rumblings in the past few weeks, it was still pretty stunning to see him announced as the new Sox manager.\n\nIt has been almost a decade since La Russa has managed in Major League Baseball at all; he last managed the St. Louis Cardinals in 2011, when they won the World Series. He has had front-office roles since and does not have recent managerial experience, which does not seem to line up with what White Sox general manager/senior vice president Rick Hahn said the team was looking for just three weeks ago.\n\n\"Quite frankly, as we talked a couple, three weeks ago when we initiated this process, this obviously played out a little differently than I described I thought it would for all of you,\" Hahn said. \"Initially, I think I was a little surprised, just given that I knew not only, obviously, that he was retired, but I knew that other clubs had reached out previously and were rebuffed.\"\n\nAccording to the team, La Russa signed a multiyear contract with the White Sox.\n\n\"My internal response has been excitement. I haven't had the first regret,\" La Russa said. \"I'm fired up. I'm ready to go. I'm anxious to get with the players. I want to show them what I represent as a person; as a professional.\"\n\nTony La Russa, a member of baseball's Hall of Fame, the third-winningest manager in baseball history, a three-time World Series champion and a four-time winner of the Manager of the Year Award, has been named the new manager of the Chicago White Sox. pic.twitter.com/RKP24rleHP — Chicago White Sox (@whitesox) October 29, 2020\n\nA news release said \"La Russa and Connie Mack are the only two managers to win World Series titles in three different decades and to win pennants in four decades. La Russa, who was named Manager of the Year in 1983, 1988, 1992, and 2002, is one of only four managers to receive the honor in each league.\"\n\nLa Russa was the manager of the White Sox from 1979 until 1986. The White Sox made one playoff appearance in that era, winning the American League West championship in 1983.\n\nDuring more than 30 seasons as a manager with the White Sox and then with the Oakland Athletics (1986-95) and St. Louis Cardinals (1996-2011), La Russa's teams have made 14 postseason appearances, won 12 division titles, six pennants and claimed three World Series championships (1989 with Oakland; 2006 and '11 with St. Louis.)\n\nLa Russa was fired from his first stint as Sox skipper back in 1986 by then-General Manager Hawk Harrelson. Sox Chairman Jerry Reinsdorf has regretted the move ever since, as La Russa went on to win those three titles elsewhere.\n\nIt was Reinsdorf who reached out to La Russa a few weeks ago to see if he had interest, and many believe this was Reinsdorf's decision to hire him.\n\nLa Russa said this is not about their relationship.\n\n\"His major interest on the baseball side is what's best for the Chicago White Sox and the fans that we're hoping are driving to our ballpark in droves,\" La Russa said. \"Any past relationship or current relationship he's had with me over the years. I mean, there were other opportunities to hire me that wouldn't hire me. I think all managers would understand this – I think everybody would understand this – how rare it is to get an opportunity to manage a team that's this talented and this close to winning.\"\n\nThe move to hire La Russa has been almost universally panned by Sox fans and people within baseball. A national report said it even caused conflict within the White Sox organization.\n\nMeanwhile, of course, one of the big questions is how 76-year-old La Russa can related to a mostly young, diverse White Sox team, with most of the players more than 50 years younger than he. La Russa sounds ready to work to bridge that age gap.\n\n\"You start with the respect, trust at zero. You have to work every day to earn it, and I did it for years, and I'm going to try very hard to do it, and the players will decide,\" he said, \"but I know if I come at it with what I've learned, and how I feel about putting that team in a good position to succeed, I think it'll happen.\"\n\nLa Russa has also been opposed in the past to showmanship by players such as backflips, and has also been against protesting during the National Anthem.\n\n\"When the first issue occurred, my initial instincts were all you about, you know, respecting the flag and the anthem and what America stands for. There's been a lot goes on in a very healthy way since 2016. I would applaud and support the fact that they are now addressing; identifying the injustices, especially on the racial side,\" he said.\n\nAs to the way players might express themselves on the field, he added: \"I do believe at the basis that sportsmanship is important. I always reasoned that if it's sincere, I didn't have a problem with it. And what I see now is that with players that are being more exuberant – and I take Tim Anderson for an example – if I see that it's sincere and it's directed towards the game, that's displaying the kind of emotion that you want.\"\n\nLa Russa said he has not talked to any of the players yet.\n\nAs a player himself, La Russa appeared in 132 major league games over six seasons with the Kansas City Athletics (1963), Oakland Athletics (1968-71), Atlanta Braves (1971) and Chicago Cubs (1973), batting .199 (35-176) with seven RBI. He retired as a player in 1977.\n\nLa Russa is 2,728-2,365 (.536) in 5,097 games as a manager and has a 70-58 (.547) record in postseason. His 2,728 career wins rank third all-time in the history of baseball, following Mack (3,731) and John McGraw (2,763). His teams have won 100 or more games four times, topped by 105 victories with the 2004 NL-pennant winning Cardinals.\n\nCBS 2's Matt Zahn contributed to this report.\n\nAlso From CBS Chicago:"}]}