{"Tony La Russa Jr. was born on October 4, 1944.": [{"url": "https://www.britannica.com/biography/Tony-La-Russa", "page_content": "Tony La Russa, byname of Anthony La Russa, Jr., (born October 4, 1944, Tampa, Florida, U.S.), American professional baseball manager who led his teams to three World Series titles (1989, 2006, and 2011) and was one of the winningest managers in major league history.\n\nLa Russa signed to play baseball with the Kansas City Athletics (or “A’s”) out of high school. He spent the majority of his 16-season playing career in the minor leagues, but he appeared sporadically in the majors with the A’s (both in Kansas City and, later, in Oakland, where the franchise moved), the Atlanta Braves, and the Chicago Cubs. He was named the manager of a minor-league affiliate of the Chicago White Sox in 1978, and his first big-league managerial job came the following year, when he took over the White Sox late in the 1979 season.\n\nBritannica Quiz I Am the Greatest (Athlete)\n\nThe cerebral La Russa—who earned a law degree shortly before assuming managerial duties in Chicago—proved to be a natural leader in the clubhouse. He developed a managerial style that consisted of frequent in-game situational substitutions that came in response to the great attention he paid to the nuances and flow of a particular game (which occasionally led to criticism that La Russa “overmanaged”). In 1983 he guided the White Sox to a 99-win season and the team’s first playoff appearance in 24 years. However, a slow start to the 1986 campaign and a strained working relationship with the team’s new general manager (former outfielder Ken Harrelson, who left the announcing booth to spend only one tumultuous season running the White Sox) led to La Russa’s being fired three months into the season. He was out of work for less than a month before he was hired to manage the A’s.\n\nLa Russa quickly turned the A’s into the most-dominant team in baseball. He led Oakland to the highest win total in the major leagues for three straight seasons (1988–90), each of which also ended with the Athletics’ winning the American League (AL) pennant. The team was upset in two of its World Series appearances during that period, but the A’s did defeat the San Francisco Giants to win a championship in 1989. La Russa and the A’s won another division title in 1992, but after the team posted three consecutive losing seasons (1993–95), he opted out of his contract and signed with the St. Louis Cardinals.\n\nLa Russa’s third managerial stint was even more successful than his first two. In his initial season in St. Louis, he guided the Cardinals to the first of seven division titles the team would win during his tenure. The Cardinals won a National League (NL) pennant in 2004, and in 2006 the team beat the Detroit Tigers to win the World Series. In 2011 La Russa led St. Louis on improbable comebacks to clinch a postseason berth (after trailing in the Wild Card standings by 8 1/2 games with a month remaining in the regular season) and to win the World Series (after twice being one strike away from elimination). La Russa retired soon after earning his third championship ring. He had been named the AL’s Manager of the Year three times (1983, 1988, and 1992) and won the NL’s version of the award in 2002.\n\nThree years after his retirement from managing, La Russa joined the Arizona Diamondbacks as the team’s chief baseball officer. He was demoted to an advisory role with the franchise following the 2016 season after the Diamondbacks ran off three consecutive losing campaigns during his tenure, and he left the team after the 2017 season. La Russa then joined the Boston Red Sox as an assistant to the team’s general manager. After the 2020 season he returned to the Chicago White Sox as general manager. In his first season back with the team, Chicago finished first in the Central Division, and La Russa won his 2,764th game, which moved him into second place for most career wins by a general manager. In the 2021 postseason the White Sox lost in the AL Division Series.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nLa Russa published a memoir, One Last Strike: Fifty Years in Baseball, Ten and a Half Games Back, and One Final Championship Season (written with Rick Hummel), in 2012. He was inducted into the Baseball Hall of Fame in 2014."}, {"url": "https://www.britannica.com/facts/Tony-La-Russa", "page_content": "verifiedCite\n\nWhile every effort has been made to follow citation style rules, there may be some discrepancies. Please refer to the appropriate style manual or other sources if you have any questions.\n\nSelect Citation Style\n\nMLA APA Chicago Manual of Style"}, {"url": "https://www.baseball-almanac.com/players/player.php?p=larusto01", "page_content": "Tony La Russa was born on Wednesday, October 4, 1944, in Tampa, Florida. La Russa was 18 years old when he broke into the big leagues on May 10, 1963, with the Kansas City Athletics. His biographical data, year-by-year hitting stats, fielding stats, pitching stats (where applicable), career totals, uniform numbers, salary data and miscellaneous items-of-interest are presented by Baseball Almanac on this comprehensive Tony La Russa baseball stats page.\n\n\"The toughest thing for me as a young manager is the fact a lot of these guys saw me play. So it's hard for me to instruct them in anything because they know how bad I was.\" - La Russa, Tony. The Cubbies, Quotations on the Chicago Cubs . Chieger, Bob. Atheneum Publishing. 1 April 1987.\n\nDid you know that Tony La Russa passed the bar exam in December 1979, making him one of only five lawyer / managers in Major League history? The other four were: Monte Ward (New York Giants, Brooklyn and Providence, late 1800s), Hughie Jennings (Detroit, 1907-20, New York Giants, 1924), Miller Huggins (St. Louis Cardinals and New York Yankees, 1913-29) and Branch Rickey (St. Louis Browns, 1913-15, St. Louis Cardinals, 1919-25). Did you know that all five of these \"lawyer / managers\" are also members of the National Baseball Hall of Fame?\n\nTony La Russa | National Baseball Hall of Fame Plaque | Class of 2014 (HOF)\n\nTony La Russa went from being an infielder in 1973, to manager of the Chicago White Sox in 1979, amassing 522 wins, 510 losses, and a Manager of the Year Award (1983). Moving west, La Russa managed the Oakland Athletics next, winning 798 games from 1986-1995, winning two more Manager of the Year Awards (1988, 1992), three American League pennants, and his first World Series ring (1989). Another move, and even more success, as La Russa went back to the heartland, where he managed the St. Louis Cardinals from 1996-2011, won 1,408 games at the helm, a fourth Manager of the Year Award (2002), six National League pennants, and two additional World Series championships (2006, 2011).\n\nDid you know that Tony La Russa was the American League All-Star manager in 1989, 1990 and 1991 (3 wins / 0 losses); and the National League All-Star manager in 2005, 2007 and 2012 (1 win / 2 losses); and when the senior circuit won in 2012, he became the first manager to win a Midsummer Classic in both leagues?"}, {"url": "https://www.baseball-reference.com/players/l/larusto01.shtml", "page_content": "Frequently Asked Questions\n\nHow old is Tony La Russa?\n\nTony La Russa is 78 years old.\n\nWhen was Tony La Russa born?\n\nTony La Russa was born on October 4, 1944.\n\nWhere was Tony La Russa born?\n\nTony La Russa was born in Tampa, FL.\n\nHow tall is Tony La Russa?\n\nTony La Russa is 6-0 (183 cm) tall.\n\nHow much did Tony La Russa weigh when playing?\n\nTony La Russa weighed 175 lbs (79 kg) when playing.\n\nHow many seasons did Tony La Russa play?\n\nTony La Russa played 6 seasons.\n\nIs Tony La Russa in the Hall of Fame?\n\nTony La Russa was elected into the Hall of Fame in 2014.\n\nWhat position did Tony La Russa play?\n\nTony La Russa was a Second Baseman and Shortstop.\n\nHow many hits did Tony La Russa have?\n\nTony La Russa had 35 hits over his career.\n\nHow many home runs did Tony La Russa have?\n\nTony La Russa had home runs over his career.\n\nWhat was Tony La Russa's average?\n\nTony La Russa had a .199 average over his career.\n\nHow many teams has Tony La Russa played for?\n\nTony La Russa played for 4 teams; the Kansas City Athletics, Oakland Athletics, Atlanta Braves and Chicago Cubs.\n\nHow many World Series has Tony La Russa won?\n\nTony La Russa has never won a World Series.\n\nWhen did Tony La Russa retire?\n\nTony La Russa last played in 1973.\n\nWhat is Tony La Russa's Twitter account?\n\nTony La Russa is on Twitter at TonyLaRussa."}, {"url": "https://www.celebsagewiki.com/tony-larussa", "page_content": "Age, Biography and Wiki\n\nTony LaRussa (Anthony La Russa Jr.) was born on 4 October, 1944 in Tampa, Florida, USA, is an Actor, Executive. Discover Tony LaRussa's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 77 years old?\n\nPopular As Anthony La Russa Jr. Occupation actor,executive Age 78 years old Zodiac Sign Libra Born 4 October 1944 Birthday 4 October Birthplace Tampa, Florida, USA Nationality USA\n\nWe recommend you to check the complete list of Famous People born on 4 October. He is a member of famous Actor with the age 78 years old group.\n\nTony LaRussa Height, Weight & Measurements\n\nAt 78 years old, Tony LaRussa height is 6' (1.83 m) .\n\nPhysical Status Height 6' (1.83 m) Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is Tony LaRussa's Wife?\n\nHis wife is Elaine Coker (31 December 1973 - present) ( 2 children), Luzette Sarcone (1965 - 1973) ( divorced) ( 2 children)\n\nFamily Parents Not Available Wife Elaine Coker (31 December 1973 - present) ( 2 children), Luzette Sarcone (1965 - 1973) ( divorced) ( 2 children) Sibling Not Available Children Not Available\n\nTony LaRussa Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Tony LaRussa worth at the age of 78 years old? Tony LaRussa’s income source is mostly from being a successful Actor. He is from USA. We have estimated Tony LaRussa's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Actor\n\nTony LaRussa Social Network\n\nInstagram Linkedin Twitter Facebook Wikipedia Imdb\n\nTimeline"}, {"url": "https://biographymask.com/tony-la-russa/", "page_content": "Tony La Russa is an American professional baseball coach and former player. Tony La Russa is the manager for the Chicago White Sox of Major League Baseball (MLB).\n\nEarly Life\n\nTony La Russa came to this world on October 4, 1944. He is currently 78 years old and his zodiac sign is Libra. His birth name is Anthony La Russa Jr.\n\nHe was born in Tampa’s old picture., Florida, USA. His parents are Anthony and Olivia La Russa. Additionally, Tony has Italian and Spanish ancestry and speaks fluent Spanish.\n\nAfter graduating from Jefferson High School, Tony was signed by the Kansas City Athletics in June 1962 as a middle infielder, with a clause to pay for his college education.\n\nThis personality is a graduate of the University of South Florida. And, following his playing career, Tony earned a Juris Doctor degree from Florida State University.\n\nTony La Russa – Net Worth 2023\n\nThis famous personality has a net worth of around $30 million. Therefore, Tony has earned his net worth as team manager\n\nBody Measurements\n\nThis former player stands 1.82 m or 5 feet 9 inches. Similarly, he has a suitable weight but he has not mentioned his weight. Similarly, he has also not publicly announced his other body stats publicly.\n\nHe has a hazel set of eyes whereas his light brown hair is turning white as per his age.\n\nCareer\n\nTony is the manager for the Chicago White Sox of Major League Baseball (MLB). Therefore, his MLB career has spanned from 1963 to the present, in several roles.\n\nMoreover, Tony is the former manager of the St. Louis Cardinals and Oakland Athletics. Similarly, in 33 years as a manager, he guided his teams to three World Series titles, six league championships, and 13 division titles.\n\nHowever, his 2,821 wins are 2nd most for a major league manager, trailing only the total of Connie Mack.\n\nAnd, as a player, he made his major league debut in the year 1963 and spent parts of 5 major league seasons with the Kansas City / Oakland Athletics, Atlanta Braves, and Chicago Cubs.\n\nMoreover, after a shoulder injury during the 1964–65 off-season, Tony played much of the remainder of his career in the minor leagues until retiring in the year 1977.\n\nTony was named manager of the White Sox in the middle of the 1979 season and guided the White Sox to an American League West division title four seasons later.\n\nMore\n\nIn spite of being fired in the middle of the 1986 season, the Athletics hired him less than three weeks later, and he led the A’s to 3 consecutive American League championships from the year 1988 to 1990 and the 1989 World Series title.\n\nFurther, he left Oakland following the 1995 season to manage the Cardinals. And led the team to 3 National League championships and the 2006 and 2011 World Series titles.\n\nThis player retired after winning the 2011 title and 34 seasons as a major league manager. 3 months later, Tony accepted a position assisting fellow former manager Joe Torre, the executive vice president for MLB operations.\n\nSimilarly, in the year 2014, this personality became the Chief Baseball Officer for the Arizona Diamondbacks.\n\nLikewise, in November 2019, Tony joined the Los Angeles Angels as a senior advisor of baseball operations. Further, in the 2021 offseason, La Russa was named the manager of the Chicago White Sox a second time after the firing of Rick Renteria.\n\nThis personality was unanimously elected to the Hall of Fame by the 16-member Veterans Committee on December 9, 2013. Additionally, on July 27, 2014, the induction ceremony was held at Cooperstown, New York.\n\nFurthermore, on August 16, 2014, Tony was inducted into the St. Louis Cardinals Hall of Fame Museum.\n\nPersonal Life\n\nHe and his first wife Luzette Sarcone share two daughters together, Andrea and Averie. They divorced in the year 1973 and Sarcone received full custody of their daughters.\n\nTony married Elaine Coker shortly after his divorce to Sarcone became official. And, with Elaine, he has two daughters, Bianca and Devon. Tony and Elaine are the founders of Tony La Russa’s Animal Rescue Foundation, headquartered in Walnut Creek, California, USA.\n\nThe foundation saves abandoned and injured animals as well as running programs to bring dogs and cats to abused children, hospital patients, seniors, and shut-ins.\n\nTony La Russa – Social Media\n\nHis Twitter account ‘@TonyLaRussa’ has earned over 73.9K Followers. Besides Twitter, Tony is not active on other social media platforms."}, {"url": "https://www.tcdb.com/Person.cfm/pid/3316/Tony-LaRussa", "page_content": "\n\n\n\nTony La Russa\n\nBorn: October 4, 1944 in Tampa, Florida, USA\n\nCollege: Florida State, South Florida\n\nTotal Cards: 714\n\nNational Baseball Hall of Fame (2014)\n\n*"}, {"url": "https://prabook.com/web/tony_la.russa/1711073", "page_content": "Tony La Russa Edit Profile\n\nTony La Russa, American Professional baseball manager. Bar: Florida, 1979. Named American League Manager of Year Baseball Writers' Association American, 1983, 88, 92, Associated Press, 1983, Sporting News, 1983, American League Manager of Year, 1988, 92.\n\nBackground Russa, Tony La was born on October 4, 1944 in Tampa, Florida, United States.\n\nEducation Student, University Tampa Bachelor, University of Southern Florida, 1969; Bachelor of Laws, Florida State University, 1978.\n\nCareer Player numerous major league and minor league baseball teams, 1962-1977; coach, St. Louis Cardinals organization, 1977; manager minor league team, Knoxville, 1978; manager minor league team, Iowa, 1979; coach, Chicago White Sox, 1978; manager, Chicago White Sox, 1979-1986; manager, Oakland A's, 1986-1995; manager, St. Louis Cardinals, since 1996. Manager A.L. champion Oakland A's, 1988, 89, 90, World champions, 1989. Manager All-Star team, 1988, coach, 1984, 87.\n\nAchievements Tony Louisiana Russa has been listed as a noteworthy Professional baseball manager by Marquis Who's Who."}, {"url": "https://kids.britannica.com/students/article/Tony-La-Russa/606806", "page_content": "(born 1944). American professional baseball manager Tony La Russa led his teams to three World Series titles (1989, 2006, and 2011). He also accumulated the third most managerial wins (2,728) in major league history.\n\nAnthony La Russa, Jr., was born on October 4, 1944, in Tampa, Florida. He signed to play baseball with the Kansas City Athletics (or “A’s”) out of high school. Though he spent the majority of his 16-season playing career in the minor leagues, he appeared sporadically in the majors with the A’s (both in Kansas City and, later, in Oakland, where the franchise moved), the Atlanta Braves, and the Chicago Cubs. He was named the manager of a minor-league affiliate of the Chicago White Sox in 1978, and his first big-league managerial job came the following year, when he took over the White Sox late in the 1979 season.\n\nIn 1983 La Russa guided the White Sox to a 99-win season and the team’s first play-off appearance in 24 years. However, a slow start to the 1986 campaign led to La Russa’s being fired three months into the season. He was out of work for less than a month before he was hired to manage the A’s. He quickly turned the A’s into the most dominant team in baseball. He led Oakland to the highest win total in the major leagues for three straight seasons (1988–90), each of which also ended with the Athletics’ winning the American League (AL) pennant. The team was upset in two of its World Series appearances during this period, but the A’s did defeat the San Francisco Giants to win a championship in 1989. La Russa and the A’s won another division title in 1992, but after the team posted three consecutive losing seasons (1993–95), he opted out of his contract and signed with the St. Louis Cardinals.\n\nLa Russa’s third managerial stint was even more successful than his first two. In his initial season in St. Louis, he guided the Cardinals to the first of seven division titles the team would win during his tenure. The Cardinals won a National League (NL) pennant in 2004, and in 2006 the team beat the Detroit Tigers to win the World Series. In 2011 La Russa again led St. Louis to the World Series title. He retired soon after earning his third championship ring. He was named the AL’s Manager of the Year three times (1983, 1988, and 1992) and won the NL’s version of the award in 2002. In 2013 he was selected for induction into the Baseball Hall of Fame."}, {"url": "https://www.geni.com/people/Tony-La-Russa/6000000159898842861", "page_content": "About Tony La Russa\n\nAnthony La Russa Jr. (/ləˈruːsə/; born October 4, 1944) is an American professional baseball manager who is the manager of the Chicago White Sox of Major League Baseball (MLB). He is the former manager of the St. Louis Cardinals and Oakland Athletics and a former professional baseball player. In November 2019, he joined the Los Angeles Angels as a senior advisor of baseball operations. His MLB career has spanned from 1963 to the present, in several roles. In 33 years as a manager, La Russa guided his teams to three World Series titles, six league championships and twelve division titles. His 2,728 wins is third most for a major league manager, trailing only the totals of Connie Mack and John McGraw.\n\nAs a player, La Russa made his major league debut in 1963 and spent parts of five major league seasons with the Kansas City/Oakland Athletics, Atlanta Braves and Chicago Cubs. After a shoulder injury during the 1964–65 off-season, he played much of the remainder of his career in the minor leagues until retiring in 1977. Following his playing career, he earned a Juris Doctor degree from Florida State University.\n\nLa Russa was named manager of the White Sox in the middle of the 1979 season and guided the White Sox to an American League West division title four seasons later. Despite being fired in the middle of the 1986 season, the Athletics hired him less than three weeks later, and La Russa led the A's to three consecutive American League championships from 1988 to 1990 and the 1989 World Series title. He left Oakland following the 1995 season to manage the Cardinals, and led the team to three National League championships and the 2006 and 2011 World Series titles. La Russa retired after winning the 2011 title and 33 seasons as a major league manager. Three months later, he accepted a position assisting fellow former manager Joe Torre, the executive vice president for MLB operations. In 2014, he became the Chief Baseball Officer for the Arizona Diamondbacks.\n\nOn December 9, 2013, he was unanimously elected to the Hall of Fame by the 16-member Veterans Committee. The induction ceremony was held at Cooperstown, New York, on July 27, 2014.[1] On August 16, 2014, he was inducted into the St. Louis Cardinals Hall of Fame Museum.\n\nFurther Reading: Wikipedia"}], "Tony La Russa Jr. is an American professional baseball manager and executive.": [{"url": "https://www.britannica.com/biography/Tony-La-Russa", "page_content": "Tony La Russa, byname of Anthony La Russa, Jr., (born October 4, 1944, Tampa, Florida, U.S.), American professional baseball manager who led his teams to three World Series titles (1989, 2006, and 2011) and was one of the winningest managers in major league history.\n\nLa Russa signed to play baseball with the Kansas City Athletics (or “A’s”) out of high school. He spent the majority of his 16-season playing career in the minor leagues, but he appeared sporadically in the majors with the A’s (both in Kansas City and, later, in Oakland, where the franchise moved), the Atlanta Braves, and the Chicago Cubs. He was named the manager of a minor-league affiliate of the Chicago White Sox in 1978, and his first big-league managerial job came the following year, when he took over the White Sox late in the 1979 season.\n\nBritannica Quiz Great Moments in Sports Quiz\n\nThe cerebral La Russa—who earned a law degree shortly before assuming managerial duties in Chicago—proved to be a natural leader in the clubhouse. He developed a managerial style that consisted of frequent in-game situational substitutions that came in response to the great attention he paid to the nuances and flow of a particular game (which occasionally led to criticism that La Russa “overmanaged”). In 1983 he guided the White Sox to a 99-win season and the team’s first playoff appearance in 24 years. However, a slow start to the 1986 campaign and a strained working relationship with the team’s new general manager (former outfielder Ken Harrelson, who left the announcing booth to spend only one tumultuous season running the White Sox) led to La Russa’s being fired three months into the season. He was out of work for less than a month before he was hired to manage the A’s.\n\nLa Russa quickly turned the A’s into the most-dominant team in baseball. He led Oakland to the highest win total in the major leagues for three straight seasons (1988–90), each of which also ended with the Athletics’ winning the American League (AL) pennant. The team was upset in two of its World Series appearances during that period, but the A’s did defeat the San Francisco Giants to win a championship in 1989. La Russa and the A’s won another division title in 1992, but after the team posted three consecutive losing seasons (1993–95), he opted out of his contract and signed with the St. Louis Cardinals.\n\nLa Russa’s third managerial stint was even more successful than his first two. In his initial season in St. Louis, he guided the Cardinals to the first of seven division titles the team would win during his tenure. The Cardinals won a National League (NL) pennant in 2004, and in 2006 the team beat the Detroit Tigers to win the World Series. In 2011 La Russa led St. Louis on improbable comebacks to clinch a postseason berth (after trailing in the Wild Card standings by 8 1/2 games with a month remaining in the regular season) and to win the World Series (after twice being one strike away from elimination). La Russa retired soon after earning his third championship ring. He had been named the AL’s Manager of the Year three times (1983, 1988, and 1992) and won the NL’s version of the award in 2002.\n\nThree years after his retirement from managing, La Russa joined the Arizona Diamondbacks as the team’s chief baseball officer. He was demoted to an advisory role with the franchise following the 2016 season after the Diamondbacks ran off three consecutive losing campaigns during his tenure, and he left the team after the 2017 season. La Russa then joined the Boston Red Sox as an assistant to the team’s general manager. After the 2020 season he returned to the Chicago White Sox as general manager. In his first season back with the team, Chicago finished first in the Central Division, and La Russa won his 2,764th game, which moved him into second place for most career wins by a general manager. In the 2021 postseason the White Sox lost in the AL Division Series.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nLa Russa published a memoir, One Last Strike: Fifty Years in Baseball, Ten and a Half Games Back, and One Final Championship Season (written with Rick Hummel), in 2012. He was inducted into the Baseball Hall of Fame in 2014."}, {"url": "https://www.nytimes.com/2020/10/29/sports/baseball/tony-la-russa-white-sox-manager.html", "page_content": "La Russa’s ties to the White Sox go so deep that the man he replaced in 1979, Don Kessinger, was actually a player-manager, a role no team has filled for decades. The closer in La Russa’s first game, Ed Farmer, went on to spend 29 years as a team broadcaster before his death in April. La Russa even managed Minnie Minoso, who was born in 1925 and made a cameo in 1980 so he could play in a fifth decade.\n\nWith the A’s, especially, La Russa was considered an innovator — young, well educated (he has a law degree) and the subject of a chapter in “Men At Work,” the 1990 book by George F. Will, who said La Russa had an “information-intensive approach” to game preparation.\n\nMore recently, of course, the analytics revolution has significantly reshaped game strategy, as seen on Tuesday in the final game of the World Series between the Tampa Bay Rays and the Los Angeles Dodgers. Kevin Cash, the manager of the Rays, pulled Blake Snell from a shutout in the sixth inning, largely because data suggests pitchers should not face the same hitters three times in a game. The Dodgers, on their way to the title, quickly took the lead against the next pitcher.\n\nOn Thursday, La Russa sidestepped a question about what he would have done in Cash’s position. But he said that while he embraced the “wealth of information that helps you prepare,” it was critical to make decisions based on the way a game unfolds.\n\n“Once the game starts, it’s a very volatile experience,” he said. “Players, not machines. How they vary, how the game may be changing within innings, much less games to series. That’s why I think it’s very important we use the term ‘observational analytics.’ So I think the difference is the preparation will be better — I’m looking forward to it — but the actual game decision-making will be much like what I learned: You watch the game and try to figure out how to put people in position to win.”\n\nLa Russa was also asked about activism by players. He told Sports Illustrated in 2016 that he would not support a player taking a knee during the national anthem, but he said on Thursday that his stance had evolved."}, {"url": "https://kids.britannica.com/students/article/Tony-La-Russa/606806", "page_content": "(born 1944). American professional baseball manager Tony La Russa led his teams to three World Series titles (1989, 2006, and 2011). He also accumulated the third most managerial wins (2,728) in major league history.\n\nAnthony La Russa, Jr., was born on October 4, 1944, in Tampa, Florida. He signed to play baseball with the Kansas City Athletics (or “A’s”) out of high school. Though he spent the majority of his 16-season playing career in the minor leagues, he appeared sporadically in the majors with the A’s (both in Kansas City and, later, in Oakland, where the franchise moved), the Atlanta Braves, and the Chicago Cubs. He was named the manager of a minor-league affiliate of the Chicago White Sox in 1978, and his first big-league managerial job came the following year, when he took over the White Sox late in the 1979 season.\n\nIn 1983 La Russa guided the White Sox to a 99-win season and the team’s first play-off appearance in 24 years. However, a slow start to the 1986 campaign led to La Russa’s being fired three months into the season. He was out of work for less than a month before he was hired to manage the A’s. He quickly turned the A’s into the most dominant team in baseball. He led Oakland to the highest win total in the major leagues for three straight seasons (1988–90), each of which also ended with the Athletics’ winning the American League (AL) pennant. The team was upset in two of its World Series appearances during this period, but the A’s did defeat the San Francisco Giants to win a championship in 1989. La Russa and the A’s won another division title in 1992, but after the team posted three consecutive losing seasons (1993–95), he opted out of his contract and signed with the St. Louis Cardinals.\n\nLa Russa’s third managerial stint was even more successful than his first two. In his initial season in St. Louis, he guided the Cardinals to the first of seven division titles the team would win during his tenure. The Cardinals won a National League (NL) pennant in 2004, and in 2006 the team beat the Detroit Tigers to win the World Series. In 2011 La Russa again led St. Louis to the World Series title. He retired soon after earning his third championship ring. He was named the AL’s Manager of the Year three times (1983, 1988, and 1992) and won the NL’s version of the award in 2002. In 2013 he was selected for induction into the Baseball Hall of Fame."}, {"url": "https://www.encyclopedia.com/reference/encyclopedias-almanacs-transcripts-and-maps/la-russa-tony", "page_content": "Citation styles\n\nEncyclopedia.com gives you the ability to cite reference entries and articles according to common styles from the Modern Language Association (MLA), The Chicago Manual of Style, and the American Psychological Association (APA).\n\nWithin the “Cite this article” tool, pick a style to see how all available information looks when formatted according to that style. Then, copy and paste the text into your bibliography or works cited list.\n\nBecause each style has its own formatting nuances that evolve over time and not all information is available for every reference entry or article, Encyclopedia.com cannot guarantee each citation it generates. Therefore, it’s best to use Encyclopedia.com citations as a starting point before checking the style against your school or publication’s requirements and the most-recent information available at these sites:\n\nModern Language Association http://www.mla.org/style The Chicago Manual of Style http://www.chicagomanualofstyle.org/tools_citationguide.html American Psychological Association http://apastyle.apa.org/\n\nNotes:"}, {"url": "https://biographymask.com/tony-la-russa/", "page_content": "Tony La Russa is an American professional baseball coach and former player. Tony La Russa is the manager for the Chicago White Sox of Major League Baseball (MLB).\n\nEarly Life\n\nTony La Russa came to this world on October 4, 1944. He is currently 78 years old and his zodiac sign is Libra. His birth name is Anthony La Russa Jr.\n\nHe was born in Tampa’s old picture., Florida, USA. His parents are Anthony and Olivia La Russa. Additionally, Tony has Italian and Spanish ancestry and speaks fluent Spanish.\n\nAfter graduating from Jefferson High School, Tony was signed by the Kansas City Athletics in June 1962 as a middle infielder, with a clause to pay for his college education.\n\nThis personality is a graduate of the University of South Florida. And, following his playing career, Tony earned a Juris Doctor degree from Florida State University.\n\nTony La Russa – Net Worth 2023\n\nThis famous personality has a net worth of around $30 million. Therefore, Tony has earned his net worth as team manager\n\nBody Measurements\n\nThis former player stands 1.82 m or 5 feet 9 inches. Similarly, he has a suitable weight but he has not mentioned his weight. Similarly, he has also not publicly announced his other body stats publicly.\n\nHe has a hazel set of eyes whereas his light brown hair is turning white as per his age.\n\nCareer\n\nTony is the manager for the Chicago White Sox of Major League Baseball (MLB). Therefore, his MLB career has spanned from 1963 to the present, in several roles.\n\nMoreover, Tony is the former manager of the St. Louis Cardinals and Oakland Athletics. Similarly, in 33 years as a manager, he guided his teams to three World Series titles, six league championships, and 13 division titles.\n\nHowever, his 2,821 wins are 2nd most for a major league manager, trailing only the total of Connie Mack.\n\nAnd, as a player, he made his major league debut in the year 1963 and spent parts of 5 major league seasons with the Kansas City / Oakland Athletics, Atlanta Braves, and Chicago Cubs.\n\nMoreover, after a shoulder injury during the 1964–65 off-season, Tony played much of the remainder of his career in the minor leagues until retiring in the year 1977.\n\nTony was named manager of the White Sox in the middle of the 1979 season and guided the White Sox to an American League West division title four seasons later.\n\nMore\n\nIn spite of being fired in the middle of the 1986 season, the Athletics hired him less than three weeks later, and he led the A’s to 3 consecutive American League championships from the year 1988 to 1990 and the 1989 World Series title.\n\nFurther, he left Oakland following the 1995 season to manage the Cardinals. And led the team to 3 National League championships and the 2006 and 2011 World Series titles.\n\nThis player retired after winning the 2011 title and 34 seasons as a major league manager. 3 months later, Tony accepted a position assisting fellow former manager Joe Torre, the executive vice president for MLB operations.\n\nSimilarly, in the year 2014, this personality became the Chief Baseball Officer for the Arizona Diamondbacks.\n\nLikewise, in November 2019, Tony joined the Los Angeles Angels as a senior advisor of baseball operations. Further, in the 2021 offseason, La Russa was named the manager of the Chicago White Sox a second time after the firing of Rick Renteria.\n\nThis personality was unanimously elected to the Hall of Fame by the 16-member Veterans Committee on December 9, 2013. Additionally, on July 27, 2014, the induction ceremony was held at Cooperstown, New York.\n\nFurthermore, on August 16, 2014, Tony was inducted into the St. Louis Cardinals Hall of Fame Museum.\n\nPersonal Life\n\nHe and his first wife Luzette Sarcone share two daughters together, Andrea and Averie. They divorced in the year 1973 and Sarcone received full custody of their daughters.\n\nTony married Elaine Coker shortly after his divorce to Sarcone became official. And, with Elaine, he has two daughters, Bianca and Devon. Tony and Elaine are the founders of Tony La Russa’s Animal Rescue Foundation, headquartered in Walnut Creek, California, USA.\n\nThe foundation saves abandoned and injured animals as well as running programs to bring dogs and cats to abused children, hospital patients, seniors, and shut-ins.\n\nTony La Russa – Social Media\n\nHis Twitter account ‘@TonyLaRussa’ has earned over 73.9K Followers. Besides Twitter, Tony is not active on other social media platforms."}, {"url": "https://www.crunchbase.com/person/tony-la-russa", "page_content": "Log In\n\nLog In\n\nAlgorithmic rank assigned to the top 100,000 most active People\n\nThe person's primary job title\n\nThe organization associated to the person's primary job\n\nWhere the person is located (e.g. Europe, Menlo Park, China)\n\nWhere the person is located (e.g. San Francisco Bay Area, Silicon Valley)\n\nA Person's gender\n\nAlternate or previous names for the individual\n\nLink to a Person's website\n\nLink to a Person's Facebook page\n\nLink to a Person's Twitter page\n\nTotal number of current Jobs the person has\n\nHub Name: Name of the Hub\n\nCB Rank (Hub): Algorithmic rank assigned to the top 100,000 most active Hubs\n\nNumber of news articles that reference the Person"}, {"url": "https://simple.wikipedia.org/wiki/Tony_La_Russa", "page_content": "Anthony La Russa Jr. ( ; born October 4, 1944) is an American professional baseball manager of the Chicago White Sox of Major League Baseball (MLB). He is the former manager of the St. Louis Cardinals and Oakland Athletics, as well as a former player.\n\nAs a player, La Russa made his major league debut in 1963 and spent parts of five major league seasons with the Kansas City/Oakland Athletics, Atlanta Braves and Chicago Cubs.\n\nin December 2013, La Russa was elected a member of the Hall of Fame by the 16-member Veterans Committee.[1]"}, {"url": "https://www.the-sun.com/sport/2919698/white-sox-coach-tony-la-russa-twitter-trending/", "page_content": "WHITE Sox manager Tony La Russa made some controversial comments about one of his player's performances.\n\nMany MLB players have weighed in on the incident on social media as a result.\n\n4 Manager Tony La Russa #22 of the Chicago White Sox walks toward the dugout during the game against the Cleveland Indians Credit: Getty\n\nWho is White Sox coach Tony La Russa?\n\nAnthony La Russa Jr. is an American professional baseball coach and former player who is the manager for the Chicago White Sox of Major League Baseball.\n\nHe is the former manager of the St. Louis Cardinals and Oakland Athletics.\n\nIn 33 years as a manager, La Russa guided his teams to three World Series titles, six league championships, and 12 division titles.\n\n4 Tony La Russa has been an MLB manager for 33 years Credit: Getty\n\nHe has won 2,753 games, the third most of any major league baseball manager.\n\nAs a player, he made his debut in 1963 spent parts of five major league seasons with the Kansas City/Oakland Athletics, Atlanta Braves, and Chicago Cubs.\n\nOn December 9, 2013, he was unanimously elected to the Hall of Fame by the 16-member Veterans Committee.\n\nWhy is he trending?\n\nLa Russa is trending for doubling down on comments he made about rookie slugger Yermin Mercedes.\n\nLa Russa called Mercedes \"clueless\" for homering on a 47 mph pitch with a 3-0 count from Minnesota Twins infielder Willians Astudillo in the ninth inning of a 16-4 blowout win.\n\nThe manager believed that the play was a teachable moment. \"What did I say publicly?\" La Russa asked reporters on a Zoom conference.\n\n4 Former manager Tony La Russa of the Oakland Athletics is inducted in the team's Hall of Fame Credit: Getty\n\n\"I said a young player made a mistake -- which, by the way, he did -- and we need to acknowledge it. Part of how you get better as a team is, if something goes wrong, you address it.\"\n\nHe backed up his comments in further conversation.\n\n“Do you think you need more [runs] to win, you keep pushing,” he said, via Bob Nightengale. “If you think you have enough, respect the game and opposition. Sportsmanship.”\n\nLa Russa added, “If you’re going to tell me that sportsmanship and respect for the game of baseball and respect for your opponent is not an important priority, then I can’t disagree with you more.”\n\nWhat did players say about La Rossa's comments?\n\nSome White Sox players didn't agree with their manager.\n\n\"The way I see it, for position players on the mound, there are no rules,\" veteran pitcher Lance Lynn said.\n\n4 Tony La Russa, center, argues with home plate umpire Gabe Morales (47) while catcher Yasmani Grandal (24) listens Credit: AP\n\n\"Let's get the damn game over with. And if you have a problem with whatever happens, then put a pitcher out there. Can't get mad when there's a position player on the field and a guy takes a swing.\"\n\n\"No negativity. We all support Yermin. We all love home runs here. That's it. We're going to move on,\" added starting pitcher Lucas Giolito.\n\nPlayers from other organizations chimed in on the drama.\n\n\"Dear hitters: If you hit a 3-0 homer off me, I will not consider it a crime,\" Los Angeles Dodgers pitcher Trevor Bauer said on Twitter.\n\n\"... Can't believe we're still talking about 3-0 swings. If you don't like it, managers or pitchers, just be better.\"\n\n[pod_component pod_component_config_id=\"BB1w9H6DA\" pod_component_config_url=\"https://www.thesun.co.uk/nu-sun-pod-component-config-prod/BB1w9H6DA.json\" pod_component_config_loader_url=\"https://www.thesun.co.uk/nu-sun-pod-loaders-prod/1.72.0/componentLoader.js?85621\" src=\"https%3A%2F%2Fiframe.thesun.co.uk%2Fnu-sun-pod-widgets-prod%2Fiframe-pod.html%3Fid%3DBB1w9H6DA%26script%3Dhttps%3A%2F%2Fwww.thesun.co.uk%2Fnu-sun-pod-loaders-prod%2F1.72.0%2FcomponentLoader.js%3F85621%26config%3Dhttps%3A%2F%2Fwww.thesun.co.uk%2Fnu-sun-pod-component-config-prod%2FBB1w9H6DA.json\"]"}, {"url": "https://www.mlb.com/news/facts-about-white-sox-hiring-tony-la-russa", "page_content": "\n\n\",\"providerName\":\"Twitter\",\"providerUrl\":\"https://twitter.com\",\"type\":\"oembed\",\"width\":550,\"contentType\":\"rich\"},{\"__typename\":\"Markdown\",\"content\":\"• Overall, La Russa is the 50th manager since 1900 to manage the same team twice, but it hasn’t been as common lately as it used to be. Only six other managers since 2003 have returned to a club they had previously managed, and only two of those included full years of managing on either end.\n\n\n\n_Most recent managers to have multiple stints with a team_\n\nTony La Russa, White Sox: 1979-86 and 2020-?\n\nRay Knight, Reds: 1996-97 and 2003 (1 game in 2003)\n\nBob Schaefer, Royals: 1991 and 2005 (1 game in 1991)\n\nCito Gaston, Blue Jays: 1989-97 and 2008-10\n\nJack McKeon, Marlins: 2003-05 and '11 (90 games in 2011)\n\nJohn Gibbons, Blue Jays: 2004-05 and '13-18\n\nJoe Maddon, Angels: 1999 and 2020 (29 games in 1999)\n\n\n\n• La Russa is the fourth White Sox manager to return for a second stint, joining Paul Richards (1951-54 and '76), Al Lopez (1957-65 and '68-69) and Jimmy Callahan ('03-04 and '12-14, with both stints as a player/manager).\n\n\n\n**He’s back -- with a plaque**\n\n• La Russa was inducted into the Baseball Hall of Fame as part of the Class of 2014, three years after his final season leading the Cardinals. He is now the 13th individual to manage a team after being elected to the Hall. But he differs in one very specific way from 11 of the other 12 -- he’s going to be managing after having been elected as a manager. The only other Hall of Famer to be inducted as a manager and then manage again was Connie Mack -- who was elected in 1937 and managed until '50. Each of the other Hall of Famers to manage did so after being elected as a player.\",\"type\":\"text\"},{\"__typename\":\"Video\",\"contentDate\":\"2013-12-09T12:04:23Z\",\"preferredPlaybackScenarioURL({\\\"preferredPlaybacks\\\":\\\"mp4AvcPlayback\\\"})\":\"http://mediadownloads.mlb.com/mlbam/2013/12/09/mlbtv_31262267_300K.mp4\",\"type\":\"video\",\"description\":\"Tony La Russa discusses being voted into the National Baseball Hall of Fame by the Expansion Era Committee\",\"displayAsVideoGif\":false,\"duration\":\"00:01:58\",\"slug\":\"la-russa-elected-to-hall-of-fame-c31262267\",\"tags\":[{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-hbtax-hof\",\"title\":\"HBmig Hall of Fame\",\"type\":\"unsupported\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-subject-mlbcom-feature\",\"title\":\"HBmig MLBCOM_FEATURE\",\"type\":\"unsupported\"},{\"__typename\":\"PersonTag\",\"slug\":\"playerid-117517\",\"title\":\"Tony La Russa\",\"person\":{\"__ref\":\"Person:117517\"},\"type\":\"player\"},{\"__typename\":\"InternalTag\",\"slug\":\"hbmig-combined-media-state-media-archive\",\"title\":\"HBmig MEDIA_ARCHIVE\",\"type\":\"unsupported\"},{\"__typename\":\"TaxonomyTag\",\"slug\":\"baseball-hall-of-fame\",\"title\":\"Baseball Hall of Fame\",\"type\":\"taxonomy\"}],\"thumbnail\":{\"__typename\":\"Thumbnail\",\"templateUrl\":\"https://img.mlbstatic.com/mlb-images/image/private/{formatInstructions}/mlb/cpangkptekssmdtgrcp7\"},\"title\":\"La Russa elected to Hall of Fame\",\"relativeSiteUrl\":\"/video/la-russa-elected-to-hall-of-fame-c31262267\"},{\"__typename\":\"Markdown\",\"content\":\"• La Russa joins Luke Appling, Berra, Frankie Frisch, Rogers Hornsby, Bob Lemon, Paul Molitor, Tony Perez, Frank Robinson, Ryne Sandberg, Red Schoendienst and Ted Williams as the other Hall of Famers to manage after being elected, according to Elias.\n\n\n\n**Age: Is it just a number?**\n\n• One thing that jumps out right away about La Russa? He was born on Oct. 4, 1944, which means that he celebrated his 76th birthday earlier this month. That certainly makes him an outlier among current skippers -- and really, any in the history of the game.\n\n\n\nAmong current managers, the Astros' 71-year-old Dusty Baker is La Russa’s closest peer, and the only other one in the 70-plus category. (Those two not only have managed against each other many times, but they briefly played together on the 1971 Braves. La Russa also was Baker’s final MLB manager, with the '86 A’s.) By contrast, three active managers are younger than 40 (Rocco Baldelli of the Twins, the Luis Rojas of the Mets, and Jayce Tingler of the Padres), and the median age for someone holding that job is currently 50. Three other active managers also played for La Russa with the Cardinals -- the Reds' David Bell, the Phillies' Joe Girardi and the Royals' Mike Matheny.\",\"type\":\"text\"},{\"__typename\":\"OEmbed\",\"html\":\""}, {"url": "https://www.wikiwand.com/simple/Tony_La_Russa", "page_content": "Anthony La Russa Jr. ( ; born October 4, 1944) is an American professional baseball manager of the Chicago White Sox of Major League Baseball (MLB). He is the former manager of the St. Louis Cardinals and Oakland Athletics, as well as a former player.\n\nQuick facts: Tony La Russa, Chicago White Sox , MLB debut,... ▼\n\nAs a player, La Russa made his major league debut in 1963 and spent parts of five major league seasons with the Kansas City/Oakland Athletics, Atlanta Braves and Chicago Cubs.\n\nin December 2013, La Russa was elected a member of the Hall of Fame by the 16-member Veterans Committee.[1]"}], "Tony La Russa Jr. is currently serving as the chief baseball analyst and advisor for the Arizona Diamondbacks of Major League Baseball (MLB).": [{"url": "https://www.nytimes.com/2020/10/29/sports/baseball/tony-la-russa-white-sox-manager.html", "page_content": "Tony La Russa has a permanent home along the top row of the back wall in the Hall of Fame’s plaque gallery in Cooperstown, N.Y., between Bobby Cox and Frank Thomas. That is where visitors will find La Russa: in profile, lips creased, eyes focused, a strategist in bronze. The first sentence of the text below his image cites his 2,728 victories, the third most for a manager.\n\nThe plaque went up in 2014, and La Russa never expected the numbers to change. After starting his managing career with the Chicago White Sox in 1979, he seemingly finished it 32 years later with a victory in Game 7 of the World Series for the St. Louis Cardinals. Managing would not be part of his future.\n\n“I thought I’d probably get the chance,” La Russa said on Thursday. “I didn’t think I would want it.”\n\nBut La Russa left a hint, right there on the plaque, one of the few in the gallery without a logo on the cap. La Russa managed the Cardinals and the Oakland Athletics to three World Series appearances each, but he gave the White Sox equal standing in his reasoning: They gave him his start, and he remains a close friend of the team’s owner, Jerry Reinsdorf."}, {"url": "https://www.espn.com/mlb/story/_/id/34720057/tony-la-russa-stepping-chicago-white-sox-manager-due-health-concerns", "page_content": "CHICAGO -- Tony La Russa is stepping down as Chicago White Sox manager because of health concerns that kept him out of the dugout for the final five weeks of the season, he announced in a statement released Monday.\n\nLa Russa, who will turn 78 on Tuesday, hasn't managed a game since abruptly leaving Guaranteed Rate Field on Aug. 30 after doctors told him he needed to undergo further testing related to a heart issue.\n\nAccording to La Russa on Monday, there was an issue with the pacemaker he had implanted in February that forced him to step away from the team. During his absence, a second issue was diagnosed, forcing him to take an indefinite leave.\n\nHe was under contract through the 2023 season.\n\n\"At no time this season did either issue negatively affect my responsibilities as White Sox manager,\" La Russa said in the statement. \"However, it has become obvious that the length of the treatment and recovery process for this second health issue makes it impossible for me to be the White Sox manager in 2023. The timing of this announcement now enables the front office to include filling the manager position with their other off-season priorities.\"\n\nLa Russa also noted that his \"overall prognosis is good, and I want to thank everyone who has reached out to me with well wishes related to my health.\"\n\nIn La Russa's absence, the underachieving White Sox did get an initial boost from acting manager Miguel Cairo, but that was short-lived as the team was swept at home by the Cleveland Guardians in a key September series. The White Sox went on to lose eight in a row and are now hoping to at least finish at .500 or above for the third consecutive season.\n\n\"Our team's record this season is the final reality,\" La Russa said in the statement. \"It is an unacceptable disappointment. There were some pluses, but too many minuses. In the Major Leagues, you either do or you don't. Explanations come across as excuses. Respect and trust demand accountability, and during my managerial career, I understood that the ultimate responsibility for each minus belongs to the manager.\n\n\"I was hired to provide positive, difference-making leadership and support. Our record is proof. I did not do my job.\"\n\nLa Russa's second stint with the team, after managing the White Sox in the early 1980s, drew headlines for his unorthodox moves, but the team won the AL Central by 13 games in his first season.\n\nThis year has been anything but smooth. The White Sox have hovered around the .500 mark all year despite being preseason favorites to win the division again. La Russa intentionally walked two batters who had two strikes on them, further garnering headlines and controversy.\n\nSpeaking at a news conference Monday in front of reporters and some White Sox players, La Russa said he might not have returned to manage even if he was healthy, understanding the intensity of the backlash from fans with him at the helm.\n\n\"For the first time, there's enough negativity in my managing, I worried about being a distraction to the ballclub and the organization,\" La Russa said. \"The fans could have decided that for me, personally.\"\n\nGeneral manager Rick Hahn was asked if the team planned on bringing La Russa back if not for his health concerns.\n\n\"And that's hypothetical,\" he said. \"I mean the thing played out the way it played out.\"\n\nHahn indicated a wide-ranging search for a new manager will begin immediately with the organization looking outside the White Sox family.\n\n\"One thing that perhaps breaks from the mold of at least the last few hires: Having a history with the White Sox, having some sort of connection to White Sox DNA is by no means a requirement,\" Hahn said.\n\nThat idea might eliminate former White Sox manager Ozzie Guillen from a return as well as ex-catcher A.J. Pierzynski. Hahn indicated one exception to that rule -- Cairo will get an interview.\n\n\"Outside of Miguel, having that history with the White Sox is not necessarily a characteristic that we're looking for at this time,\" Hahn said. \"Ideally ... the right candidate is someone who has recent experience in the dugout with an organization that has contended for championships. Ideally, it's someone who is an excellent communicator, is someone who understands the way the game has grown and evolved in the last decade or so but at the same time has respect for old-school sensibilities.\"\n\nCloser Liam Hendriks was asked what characteristics he preferred in the next manager.\n\n\"As a unit, I think we need an authoritarian,\" Hendriks said.\n\nThe White Sox were plagued by poor defense and fundamentals while enduring a myriad of injuries to key players. They also lacked power on offense compared to previous seasons.\n\n\"It was a disappointing year,\" Hahn said. \"We all need to get better at multiple facets. There needs to be ... obviously manager/staff changes and personnel changes. My only point is, and it's easy at the end of a disappointing season to say you have to burn it to the ground. I think that's not where we're at as an organization.\"\n\nCairo, who played for La Russa before becoming his bench coach in Chicago, said the team will miss the veteran manager.\n\n\"He's my mentor. I've learned so much from him,'' Cairo said after Monday's win over the Twins. \"And of course I'm going to keep calling to keep learning. But we're going to miss him, for sure.''\n\nLa Russa expressed disappointment in not being able to see things through with the White Sox but noted that the \"future for this team remains bright.\"\n\n\"I still appreciate the chance to come back home to the White Sox and leave today with many more good memories than disappointments,\" he said. \"As I have said many times during my career, no manager has ever had more good fortune than I have.\"\n\nThe Associated Press contributed to this report."}, {"url": "https://www.britannica.com/biography/Tony-La-Russa", "page_content": "Tony La Russa, byname of Anthony La Russa, Jr., (born October 4, 1944, Tampa, Florida, U.S.), American professional baseball manager who led his teams to three World Series titles (1989, 2006, and 2011) and was one of the winningest managers in major league history.\n\nLa Russa signed to play baseball with the Kansas City Athletics (or “A’s”) out of high school. He spent the majority of his 16-season playing career in the minor leagues, but he appeared sporadically in the majors with the A’s (both in Kansas City and, later, in Oakland, where the franchise moved), the Atlanta Braves, and the Chicago Cubs. He was named the manager of a minor-league affiliate of the Chicago White Sox in 1978, and his first big-league managerial job came the following year, when he took over the White Sox late in the 1979 season.\n\nBritannica Quiz Great Moments in Sports Quiz\n\nThe cerebral La Russa—who earned a law degree shortly before assuming managerial duties in Chicago—proved to be a natural leader in the clubhouse. He developed a managerial style that consisted of frequent in-game situational substitutions that came in response to the great attention he paid to the nuances and flow of a particular game (which occasionally led to criticism that La Russa “overmanaged”). In 1983 he guided the White Sox to a 99-win season and the team’s first playoff appearance in 24 years. However, a slow start to the 1986 campaign and a strained working relationship with the team’s new general manager (former outfielder Ken Harrelson, who left the announcing booth to spend only one tumultuous season running the White Sox) led to La Russa’s being fired three months into the season. He was out of work for less than a month before he was hired to manage the A’s.\n\nLa Russa quickly turned the A’s into the most-dominant team in baseball. He led Oakland to the highest win total in the major leagues for three straight seasons (1988–90), each of which also ended with the Athletics’ winning the American League (AL) pennant. The team was upset in two of its World Series appearances during that period, but the A’s did defeat the San Francisco Giants to win a championship in 1989. La Russa and the A’s won another division title in 1992, but after the team posted three consecutive losing seasons (1993–95), he opted out of his contract and signed with the St. Louis Cardinals.\n\nLa Russa’s third managerial stint was even more successful than his first two. In his initial season in St. Louis, he guided the Cardinals to the first of seven division titles the team would win during his tenure. The Cardinals won a National League (NL) pennant in 2004, and in 2006 the team beat the Detroit Tigers to win the World Series. In 2011 La Russa led St. Louis on improbable comebacks to clinch a postseason berth (after trailing in the Wild Card standings by 8 1/2 games with a month remaining in the regular season) and to win the World Series (after twice being one strike away from elimination). La Russa retired soon after earning his third championship ring. He had been named the AL’s Manager of the Year three times (1983, 1988, and 1992) and won the NL’s version of the award in 2002.\n\nThree years after his retirement from managing, La Russa joined the Arizona Diamondbacks as the team’s chief baseball officer. He was demoted to an advisory role with the franchise following the 2016 season after the Diamondbacks ran off three consecutive losing campaigns during his tenure, and he left the team after the 2017 season. La Russa then joined the Boston Red Sox as an assistant to the team’s general manager. After the 2020 season he returned to the Chicago White Sox as general manager. In his first season back with the team, Chicago finished first in the Central Division, and La Russa won his 2,764th game, which moved him into second place for most career wins by a general manager. In the 2021 postseason the White Sox lost in the AL Division Series.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nLa Russa published a memoir, One Last Strike: Fifty Years in Baseball, Ten and a Half Games Back, and One Final Championship Season (written with Rick Hummel), in 2012. He was inducted into the Baseball Hall of Fame in 2014."}, {"url": "https://www.mlb.com/press-release/tony-la-russa-to-depart-d-backs-258943012", "page_content": "The Arizona Diamondbacks (@Dbacks, @LosDbacks) announced that Chief Baseball Analyst Tony La Russa will depart the organization at the end of the month. The Hall of Fame manager served as the club's Chief Baseball Officer from 2015-16.\n\n\"I am grateful to everyone in the Arizona Diamondbacks organization for the opportunity to complete my baseball education,\" said La Russa. \"After years in uniform and working with the Commissioner and many special members of Major League Baseball, being a part of the D-backs was both exciting and educational. The challenges facing baseball operations, player development and scouting are unique, as it's a 24-7, 12-month job and more demanding than I ever realized. The success in 2017 was a complete team effort throughout the organization -- including great support from our fans -- and with the current leadership in place, we can expect it to be the foundation for many winning years to come.\"\n\n\"Tony's contributions have played a significant role in helping put our franchise on the path to success and for that, we are all very grateful,\" said D-backs Managing General Partner Ken Kendrick. \"He has always represented the team with class and has left a mark on the franchise that will benefit us for years to come.\"\n\n\"I would like to thank Tony for all of his contributions to our baseball operations and our community during his time here,\" said D-backs President & CEO Derrick Hall. \"Having his Hall of Fame credentials, vast experience and knowledge of the game as resources to rely upon and learn from has been tremendous. The transition to the new leadership team has been smooth and flawless with his willingness and positivity. I will forever value his hard work and our friendship.\"\n\n\"Tony has been of great value to me, personally, and our staff during the past season, and I'm very appreciative for all that he has done here and the manner in which he handled the transition,\" said D-backs Executive Vice President and General Manager Mike Hazen. \"I always had respect for him and his accomplishments prior to working with him every day and that has only grown in the past year. I wish him and his family nothing but the best in the future.\""}, {"url": "https://www.mlb.com/news/arizona-diamondbacks-name-tony-la-russa-chief-baseball-officer-c75790834", "page_content": "PHOENIX -- Four weeks ago, after watching the D-backs drop the first two games of a series against the Cubs to fall to 5-18, team president and CEO Derrick Hall knew he had to start considering making changes in team's baseball hierarchy.\n\nOne of the options that Hall presented to managing general partner Ken Kendrick was bringing in a veteran baseball man above general manager Kevin Towers to evaluate the entire baseball operations department and make changes if he saw fit.\n\nThe pair decided on that option and that started a process that culminated Saturday with the hiring of Hall of Famer Tony La Russa to the newly created position of chief baseball officer.\n\n\"He has a free rein to do whatever he thinks he needs to do to make the organization better,\" Kendrick said. \"There's always been an ultimate authority, either Derrick or me, but we're not experts. You tend to, maybe at times, you question decisions that are made, but you want to let somebody that you've hired have the authority that goes with the responsibility. It's not working like we wanted it to, so you've got to try something different.\"\n\nKendrick told MLB.com that La Russa's contract was for \"multiple years\" but declined to say how many.\n\nAccording to Hall, the team interviewed several people for the position but early in the process locked in on La Russa.\n\n\"He exudes leadership,\" Kendrick said. \"When you spend time with somebody and you interact and you talk and you ask questions, you know sometimes people just come across in a really impressive way. I had people say he's the smartest baseball guy they've ever known, the hardest-working guy they've ever been around.\"\n\nLa Russa had been serving as special assistant to Commissioner Bud Selig and was a member of the Commissioner's 14-member special committee for on-field matters since December 2009.\n\nBeing called the smartest baseball guy during his introduction by Kendrick made La Russa cringe a bit. To him, he's just had a lot of great mentors from whom he's learned during his time as a player and manager, including legendary Cardinals manager George Kissell.\n\n\"He said, 'If you go forward in this game, the key is, do you love it and do you want to learn it?'\" La Russa said. \"He told me that in Spring Training. At the end of the year, he said, 'I really think that you love it and you want to learn it.' That's just what this game is about. My mind is just a product of 50 years of being taught. I'm no smarter than anyone else, but I've been taught by some wonderful people.\"\n\nLa Russa was elected to the National Baseball Hall of Fame over the winter for his accomplishments during a 33-year managerial career, and he will be inducted in July.\n\nFollowing the 2011 season, La Russa retired with a .536 career winning percentage and his 2,728 wins are the third most all-time behind Connie Mack (3,731) and John McGraw (2,763). His 70 postseason wins rank second all-time behind Joe Torre (84).\n\nThough he does not have any front-office experience, La Russa possesses a keen intellect, as he proved by gaining a degree from Florida State Unversity's School of Law (he passed the bar exam in 1979), so the D-backs are confident that he will be able to pick it up quickly.\n\nLa Russa will have the final say on all trades and transactions in his new role. While familiar with the D-backs at the Major League level, he is less so when it comes to their Minor Leaguers. With that in mind, he will soon spend time traveling to each of the team's affiliates to evaluate the talent.\n\nOn Saturday he met briefly -- and separately -- with Towers and Gibson, and he plans on addressing the team prior to Sunday's game. Then he will sit down with farm director Mike Bell to get his thoughts on the farm system and scouting director Ray Montgomery to discuss the upcoming First-Year Player Draft. It's possible that La Russa could accompany Montgomery on some trips to scout potential Draft picks.\n\nBoth Towers and Gibson praised the decision to bring La Russa on board.\n\n\"To me, to be able to bring on a good baseball mind, you can't have enough good baseball people in your front office,\" Towers said. \"I know that he loves to compete and he loves to win. That's what this is all about. It certainly will be good for Gibby and I and the organization. We're a better organization today than we were yesterday by having his presence here and being a Diamondback. I approach my job like I do each and every day until they tell me that I'm no longer here.\"\n\nOf course, La Russa is the one who holds Towers' fate in his hands.\n\n\"He knows more about general managing than I know, so I'll be properly respectful,\" La Russa said. \"I just think in this situation, you hold yourself to the standard of Major League excellence, because for the first time I've got a responsibility to an organization that said, 'Use your experience to help us get better.'\""}, {"url": "https://www.mlb.com/news/d-backs-appoint-tony-la-russa-as-chief-baseball-officer/c-75790682", "page_content": "PHOENIX - The Arizona Diamondbacks (@Dbacks) have appointed 2014 Hall of Fame inductee and 53-year baseball veteran Tony La Russa as Chief Baseball Officer, as announced by D-backs President & CEO Derrick Hall. La Russa will report to Hall and oversee the entire Baseball Operations department.\n\nLa Russa will be introduced today by Hall and D-backs Managing General Partner Ken Kendrick at a 2 p.m. Arizona/Pacific time news conference in the Chase Field interview room.\n\n\"The entire organization is obviously frustrated with the results on the field and we are looking to improve,\" Hall said. \"Tony brings us a wealth of knowledge, experience and success, and will work closely with Kevin and Kirk in evaluating our current state to determine the future of our baseball operations. He is excited and enthusiastic about the challenge, and we are fortunate to have this Hall of Famer on board and a part of the team.\"\n\nLa Russa won 3 World Series titles (1989, 2006, 2011), 6 League Championships (1988-90, 2004, 2006 and 2011), 12 division titles (1983, 1988-90, 1992, 1996, 2000, 2002, 2004-06 and 2009) and was a 4-time Manager of the Year (1983, 1998, 1992, 2002). La Russa and Sparky Anderson are the only 2 managers to win World Series titles in both leagues. His 2,728 regular-season wins as a manager are third-most all-time behind Connie Mack (3,731) and John McGraw (2,763), his 70 Postseason wins are second-most behind Joe Torre (84) and his 14 Postseason appearances are third-most behind Bobby Cox (16) and Torre (15).\n\nLa Russa owns a career .536 regular-season winning percentage (2,728-2,365) and a .547 Postseason winning percentage (70-58) as a manager. He led his teams to 100-plus wins 4 times (1988, 1990, 2004-05), a .600-plus winning percentage 6 times and a .500 winning percentage or better in 24 of 33 seasons.\n\nHe boasts 33 seasons of Major League managerial experience with the Chicago White Sox (1979-86), Oakland A's (1986-1995) and St. Louis Cardinals (1996-2011) along with parts of 2 seasons managing in the minors. During his 16-year professional playing career, he spent parts of 6 seasons in the Majors with the Kansas City Athletics (1963), A's (1968-71), Atlanta Braves (1971) and Chicago Cubs (1973)\n\nLa Russa most recently worked for Major League Baseball as a Special Assistant to Commissioner Allan H. (Bud) Selig. He also served on the Commissioner's 14-member Special Committee for On-Field Matters since December 2009.\n\nLa Russa, who is a member of the Cardinals' Hall of Fame and had his No. 10 retired by the team, was elected to the National Baseball Hall of Fame by the Expansion Era Committee along with former Managers Cox and Torre. The trio will be honored at the Hall's Induction Weekend on July 25-28 along with player inductees Tom Glavine, Greg Maddux and Frank Thomas. Former D-backs broadcaster Joe Garagiola will also be honored that weekend as the 2014 Buck O'Neil Lifetime Achievement Award Recipient.\n\nLa Russa's big league managerial career began in 1979 with the White Sox when he was hired by then-General Manager Roland Hemond, who currently serves as D-backs Special Assistant to the President & CEO.\n\nLa Russa, who yesterday received an honorary doctoral degree and delivered the commencement speech at Washington University in St. Louis, resides in Alamo, California and is a native of Tampa, Florida. He is a graduate of Jefferson High School, which also produced current D-backs Special Assistant to the President & CEO Luis Gonzalez as well as former big leaguers Tino Martinez and Fred McGriff. La Russa earned a degree in industrial management from the University of South Tampa, graduated in 1978 from Florida State University's School of Law then passed the bar exam in 1979 to eventually become one of only 5 lawyer/managers in baseball history, all of whom are in the Hall of Fame. La Russa is the founder and chairperson of Tony La Russa's Animal Rescue Foundation (ARF)."}, {"url": "https://www.espn.com/mlb/story/_/id/21066367/tony-la-russa-leave-role-arizona-diamondbacks-executive-end-month", "page_content": "PHOENIX -- Hall of Fame manager Tony La Russa is leaving the Arizona Diamondbacks organization.\n\nLa Russa served as chief baseball officer from 2015 to 2016 and became chief baseball analyst when the new regime of general manager Mike Hazen and manager Torey Lovullo arrived last spring.\n\nLa Russa said in a statement that the job was \"more demanding than I realized.\" He said with the current leadership in place, the Diamondbacks can expect winning baseball for years to come.\n\nDiamondbacks managing general partner Ken Kendrick said La Russa played a significant role in putting the franchise on the path to success.\n\nHazen said La Russa was of great value to him personally and that he's \"very appreciative for all he has done here and the manner in which he handled the transition.\""}, {"url": "https://alchetron.com/Tony-La-Russa", "page_content": "Anthony La Russa, Jr. (; born October 4, 1944) is an American professional baseball player, manager, and executive currently serving as chief baseball analyst and advisor for the Arizona Diamondbacks. He is best known for his tenures as manager of the Chicago White Sox, Oakland Athletics, and St. Louis Cardinals of Major League Baseball (MLB). His MLB career has spanned from 1963 to the present. In 33 years as a manager, La Russa guided his teams to three World Series titles, six league championships and twelve division titles. His 2,728 wins is third most for a major league manager, trailing only the totals of Connie Mack and John McGraw.\n\nAs a player, La Russa made his major league debut in 1963 and spent parts of five major league seasons with the Kansas City/Oakland Athletics, Atlanta Braves and Chicago Cubs. After a shoulder injury during the 1964–65 off-season, he played much of the remainder of his career in the minor leagues until retiring in 1977. Following his playing career, he earned a Juris Doctor degree from Florida State University.\n\nLa Russa was named manager of the White Sox in the middle of the 1979 season and guided the White Sox to an American League West division title four seasons later. Despite being fired in the middle of the 1986 season, the Athletics hired him less than three weeks later, and La Russa led the A's to three consecutive American League championships from 1988 to 1990 and the 1989 World Series title. He left Oakland following the 1995 season to manage the Cardinals, and led the team to three National League championships and the 2006 and 2011 World Series titles. La Russa retired after winning the 2011 title and 33 seasons as a major league manager. Three months later, he accepted a position assisting fellow former manager, Joe Torre, the executive vice president for MLB operations. In 2014, he became the Chief Baseball Officer for the Arizona Diamondbacks.\n\nOn December 9, 2013, he was unanimously elected to the Hall of Fame by the 16-member Veterans Committee. The induction ceremony was held at Cooperstown, New York, on July 27, 2014. On August 16, 2014, he was inducted into the St. Louis Cardinals Hall of Fame Museum.\n\nPlaying career (1962–77)\n\nLa Russa was signed by the Kansas City Athletics as a middle infielder prior to the 1962 season. He came up to the A's the next season, making his debut on May 10, 1963. In the following off-season, he suffered a shoulder injury while playing softball with friends, and the shoulder bothered him through the remainder of his playing career.\n\nOver the next six seasons, La Russa spent most of his time in the minor leagues. He made it back up to the A's, which had since moved to Oakland, in 1968 and 1969. He spent the entire 1970 season with the big club, and then late in 1971 the A's traded him to the Atlanta Braves. His final big league playing stop was with the Chicago Cubs, where he appeared as a pinch runner in one game, on April 6, 1973. He also spent time in the organizations of the Pittsburgh Pirates, Chicago White Sox, and St. Louis Cardinals.\n\nIn total, he played 132 major-league games, 40 in the starting lineup. He went 35-for-176, for a batting average of .199. His 23 walks pushed his on-base percentage to .292. He had 7 RBI and scored 15 runs. He made 63 appearances at second base, 18 at shortstop, and two at third base, fielding .960 in 249 total chances and participating in 34 double plays.\n\nEarly career\n\nLa Russa earned a Juris Doctor (J.D.) degree from Florida State University College of Law in 1978 and was admitted to the Florida Bar on July 30, 1980. He is associated with a Sarasota law firm although he is not eligible to practice at this time. La Russa has been quoted as saying, \"I decided I'd rather ride the buses in the minor leagues than practice law for a living.\" Shortly before graduating from FSU College of Law, LaRussa spoke with one of his professors about his post-graduation plans, indicating to his professor that he had an opportunity to coach in the minor leagues and asking his professor what he should do. LaRussa's professor responded, \"Grow up, you're an adult now, you're going to be a lawyer.\"\n\nHe is one of a select number of major league managers in baseball history who have earned a law degree or passed a state bar exam; others include John Montgomery Ward (New York Giants, Brooklyn and Providence, late 1800s), Hughie Jennings (Detroit, 1907–20, New York Giants, 1924), Miller Huggins (St. Louis Cardinals and New York Yankees, 1913–29), Muddy Ruel (St. Louis Browns, 1947), Jack Hendricks (St. Louis Cardinals, 1918, Cincinnati, 1924–29), and Branch Rickey (St. Louis Browns, 1913–15, St. Louis Cardinals, 1919–25). La Russa is also commonly credited for the advent of the modern specialized bullpen.\n\nChicago White Sox (1979–1986)\n\nLa Russa credits Loren Babe and Paul Richards of the White Sox organization for helping him to become a manager. The White Sox gave La Russa his first managerial opportunity in 1978 by naming him skipper of their Double-A affiliate, the Knoxville Sox of the Southern League. La Russa spent a half-season at Knoxville before being promoted to the White Sox coaching staff when owner Bill Veeck changed managers from Bob Lemon to Larry Doby. Doby was fired at the end of the season; Don Kessinger, former star shortstop of the crosstown Cubs, was named the White Sox' player-manager for 1979, and La Russa was named manager of the Triple-A Iowa Oaks of the American Association.\n\nThe White Sox fired Kessinger with a 46–60 record two-thirds of the way through the 1979 season and replaced him with La Russa. The White Sox played .500 baseball for the rest of the 1979 campaign. He credits Paul Richards with first inspiring him to believe he could succeed as a major league manager. La Russa was named American League Manager of the Year in 1983, when his club won the AL West but fell to the Baltimore Orioles in the American League Championship Series. The White Sox fired La Russa after the club got off to a 26–38 start in 1986. He finished his White Sox career with a 522–510 regular season record and a 1–3 post–season record.\n\nOakland Athletics (1986–1995)\n\nLa Russa had a break of less than three weeks before his old club, the Athletics, called him to take over as manager. He led the club to three consecutive World Series, from 1988 to 1990, sweeping an earthquake-delayed Series from the San Francisco Giants in 1989. In 1988 and 1990, La Russa's Athletics lost the World Series to the Los Angeles Dodgers and the Cincinnati Reds by wide margins, despite the fact that the A's were heavily favored on both occasions. He earned two additional Manager of the Year awards with the A's, in 1988 and 1992, again winning the Western Division in the latter year. After the 1995 season, in which the A's finished 67–77, the Haas family, with whom La Russa had a close personal relationship, sold the team after the death of patriarch Walter A. Haas, Jr. La Russa left to take over for Joe Torre at the helm of the St. Louis Cardinals. He finished his Athletics career with a 798–673 regular season record and a 19–13 post–season record.\n\nSt. Louis Cardinals (1996–2011)\n\nIn his first campaign with the Cardinals in 1996, La Russa clinched the National League Central Division title (and also finished National League runner-up), a feat his clubs repeated in 2000, 2001, 2002 (his fourth Manager of the Year award), 2004, 2005, 2006, and 2009. The Cardinals also tied for the National League Central crown with the Houston Astros in 2001. He became the first manager to win the award four times. The 2004 edition was arguably one of the finest seasons in Cardinals' history as they won 105 games and won another 100 the next year. La Russa's fourth Manager of the Year award was arguably the most emotional; La Russa led the Cardinals to the National League Championship Series (where they would ultimately lose in five games to the San Francisco Giants) in a year in which the Cardinals were traumatized by the deaths of beloved Hall of Fame broadcaster Jack Buck and 33-year-old pitcher Darryl Kile just four days later.\n\nAfter a 2004 regular season in which the Cardinals led the NL in runs scored (855) while allowing the fewest (659), La Russa's Cardinals defeated the Los Angeles Dodgers in the National League Division Series, 3 games to 1. St. Louis then took on the Houston Astros in the National League Championship Series. In a tense series with opposing pitcher Roger Clemens at the top of his game, Cardinals third baseman Scott Rolen hit a game-winning two-run home run off Clemens in Game 7 following Jim Edmonds' rally saving catch. This home run sent the Cardinals to their first World Series for the first time since 1987. However, they met a Boston Red Sox team that had surmounted a 3–0 deficit against the New York Yankees who swept them in four games.\n\n2006 saw a return to the World Series, this time with a 4–1 victory over the Detroit Tigers, managed by Jim Leyland. The team's 83–78 regular season record is the worst ever by an eventual World Series champion, usurping the 1987 Minnesota Twins' 85–77 campaign. La Russa is the second manager to win a World Series in both the American League and the National League – a distinction shared with his mentor, Sparky Anderson.\n\nWhen he came to St. Louis, La Russa wore number 10 to symbolize the team's drive to their 10th championship and pay tribute to Anderson, who wore number 10 while manager of the Cincinnati Reds. After winning the championship, he chose to continue wearing number 10 to pay tribute to Anderson.\n\nIt was as a player with the A's that La Russa first met catcher Dave Duncan, who would join his coaching staff in Chicago in 1983. The two have worked together on every La Russa-managed team since, and he often credits Duncan as playing a key role in his success.\n\nLa Russa led the Cardinals to the 2011 World Series, after defeating the Philadelphia Phillies in the NLDS (3-2), and then the Milwaukee Brewers in the NLCS (4-2). The Cardinals defeated the Texas Rangers in Game 7 of the World Series to win the franchise's 11th World Championship, and the third of LaRussa's managerial career. He passed Bobby Cox for 2nd place on the all-time post-season wins list with his 68th win in Game 3. Three days following the World Series win, La Russa announced his retirement, ranking second all-time in post-season wins with 70, third all-time with 2,728 regular season wins, second with 5,097 games managed, and second with 33 years (tied) managing with John McGraw. He finished his Cardinals career with a 1408–1182 regular season record and 50–42 post–season record.\n\nLa Russa also became the first manager in Major League Baseball history to retire in the same season after winning a World Series title. Even though he had retired, La Russa managed the National League All Stars in the 2012 MLB All-Star Game for the final time in his managerial career. The National League won 8-0.\n\nExecutive career (2012–present)\n\nShortly after his retirement from the playing field, La Russa took a position with MLB assisting former managerial rival Joe Torre in matters of on-field discipline. He held this position for more than two seasons.\n\nOn May 17, 2014, La Russa accepted a position as Chief Baseball Officer for the Arizona Diamondbacks to oversee the entire baseball operations department.\n\nAfter joining the Diamondbacks in 2014, La Russa was reunited with former assistants Duncan and McKay, and the general manager who hired him to manage the White Sox in 1979, Roland Hemond. On December 4, 2015, the Diamondbacks agreed to a six-year contract with free agent pitcher Zack Greinke worth a total of $206.5 million. At that time, it held the highest annual average value in MLB, exceeding $34.4 million per year, and was also the largest contract by total value in team history.\n\nLegacy\n\nLa Russa ranks third in major league history in victories as a manager (2,728), trailing only Connie Mack (3,731) and John McGraw (2,763). He managed 5,097 games, joining Mack as the second manager or coach in American sports history to reach 5,000 games. In 2004, he became the sixth manager in history to win pennants with both American and National League teams; in 2006 he became the first manager ever to win multiple pennants in both leagues and the second manager to win the World Series in both leagues. La Russa has also joined Mack as the second manager to win World Series titles in three decades and to win pennants in four. He is one of only four managers to be named Manager of the Year in both of baseball's major leagues.\n\nLa Russa is the winningest manager in St. Louis Cardinals history, with 1,408 wins and 1,182 losses (.544) and 1 tie as manager of the club since 1996. He was 522–510–3 (.506) with the Chicago White Sox 1979–1986, leading the club to its first postseason appearance in 24 years in 1983, and 798–673 (.542) with the Oakland Athletics 1986–1995, winning three consecutive AL pennants from 1988 to 1990; he also holds the record for victories by an Athletics manager since the franchise relocated to Oakland in 1968.\n\nHis 2,000th game managing the Cardinals came on May 31, 2008.\n\nLa Russa became the leader in wins by Cardinals' managers on August 31, 2007, when the Cardinals defeated the Cincinnati Reds 8–5, passing Red Schoendienst (1,041–955) to take the title. He managed his 2,500th win against the Royals at Kansas City on June 21, 2009, becoming only the third manager to attain that win level after Mack and McGraw.\n\nAfter the retirement of Atlanta Braves manager Bobby Cox in 2010, La Russa was the longest tenured manager in Major League Baseball, and with the resignation of longtime NBA head coach Jerry Sloan from the Utah Jazz on February 10, 2011, La Russa had been the longest tenured bench boss among all the Big Four sports leagues, until his retirement following his 2011 World Series victory with the Cardinals.\n\nLa Russa became eligible as a candidate for the Baseball Hall of Fame in 2013 through voting by the Expansion Era Committee for induction in 2014. On November 4, 2013, La Russa's inclusion on the Expansion Era ballot was announced with fellow former Cardinals Ted Simmons, Joe Torre and Dan Quisenberry. The Baseball Writers' Association of America's Historical Overview Committee listed the candidates on the ballot and voted the following December 8. La Russa was inducted into the 2014 Hall of Fame class as a manager.\n\nIn January, 2014, the Cardinals announced La Russa among 22 former players and personnel to be inducted into the St. Louis Cardinals Hall of Fame Museum for the inaugural class of 2014.\n\nIn 2012, he became the second manager to manage the All-Star Game (2012) after retiring since John McGraw in 1933. With his All-Star Game 8–0 win in Kansas City, he became the first manager to win an All-Star Game in both leagues.\n\nPersonal life\n\nLa Russa and second wife, Elaine, are the founders of Tony La Russa's Animal Rescue Foundation, headquartered in Walnut Creek, California, which saves abandoned and injured animals as well as running programs to bring dogs and cats to abused children, hospital patients, seniors and shut-ins. La Russa is a vegetarian. The La Russas have two daughters, Bianca & Devon, and reside in Alamo, California.\n\nLa Russa has two older daughters, Andrea and Averie from his first marriage to Luzette Sarcone. La Russa and Sarcone divorced in 1973 and Sarcone received full custody of their daughters. La Russa married Elaine Coker shortly after his divorce to Sarcone became official.\n\nLa Russa is also personal friends with celebrities outside the sports world, such as pianist and songwriter Bruce Hornsby, Bruce Springsteen, jazz bassist Christian McBride, and heavy metal musician Robb Flynn from the band Machine Head. In 2007, at a concert in San Francisco on La Russa's birthday, Hornsby played a comedic song he named \"Hooray For Tony\". The original song, titled \"Hooray For Tom\", is La Russa's favorite Hornsby song. In the \"Hooray For Tony\" version, Hornsby mentions the \"Bash Brothers\" Mark McGwire and José Canseco (from La Russa's days as the manager of the Oakland A's), Albert Pujols, Jim Edmonds, ARF, and La Russa's World Series Championships.\n\nLa Russa is a graduate of the University of South Florida and the Florida State University College of Law.\n\nLa Russa has Italian and Spanish ancestry, and speaks fluent Spanish. His father's parents were migrants from the Italian island of Sicily and his mother's family originated from Spain. Having a father who could speak Spanish and Italian and a mother who could speak Spanish, La Russa claimed in a 2008 interview that “Spanish was my first language.” He was inducted into the National Italian American Sports Hall of Fame in 1998. La Russa was also inducted into the Hispanic Heritage Baseball Museum Hall of Fame on April 11, 2008 in a pregame ceremony at AT&T Park.\n\nLa Russa and his family had an uncredited extra role in the film Angels in the Outfield. The La Russas also made an appearance in an episode of Housecat Housecall, a reality show on Animal Planet presented by Purina Cat Chow, during the show's third season, which began on June 5, 2010. In 1980, La Russa appeared as a contestant on the game show To Tell The Truth, and helped fool the celebrity panel.\n\nIn June 2010, La Russa was asked about a tea party protest taking place during his game against the Arizona Diamondbacks that criticized the Diamondbacks' position against the controversial new Arizona immigration statute. La Russa expressed support for the Tea Partiers' right to free speech to protest at the ballpark. He also stated, \"I'm actually a supporter of what Arizona is doing... you know if people don't fix their problems they have to take care of it themselves.\"\n\nLa Russa and Pujols attended Glenn Beck's \"Restoring Honor\" rally on August 28, 2010 in Washington, D.C. while the Cardinals were in town for a series against the Washington Nationals. LaRussa decided to attend after being told by Beck that the rally was not political in nature.\n\nThroughout the 2011 season, La Russa has been struggling with shingles. He originally disclosed that it was conjunctivitis, however, on May 10, after a visit to the Mayo Clinic (Scottsdale, Arizona), he disclosed that he was dealing with a case of shingles, and had to take off a few days for treatment and rest. Because bench coach Joe Pettini was named 'acting manager' instead of 'interim manager', it assures that La Russa will be credited for all wins and losses the team plays without him there.\n\nOn March 22, 2007 La Russa was arrested in Jupiter, Florida for suspicion of driving under the influence of alcohol. He was found asleep at the wheel of his running SUV with the car in park at a stop sign. He was booked at the Palm Beach County Jail and blew a .093 blood- alcohol content, above the legal limit of .08. Calling his arrest on the DUI charge an \"embarrassment\", La Russa apologized to \"anyone who is close to me, members of the Cardinals organization, our fans.\" He was defended by the organization and players, such as Albert Pujols. On November 28, 2007 La Russa pleaded guilty to DUI, saying it was in the best interest of all concerned. \"I accept full responsibility for my conduct, and assure everyone that I have learned a very valuable lesson and that this will never occur again\", La Russa said in a statement released by his attorney.\n\nOn June 4, 2009, the St. Louis Post-Dispatch reported that La Russa had sued the online social network platform Twitter the previous month for a fake page established under his name on the site. La Russa claimed that he had \"suffered significant emotional distress (and) damage to reputation\" because of the profile. The fake profile made several \"distasteful references\" to La Russa and his team, according to the suit. Twitter's terms of service forbids impersonation directly, stating that users \"may not impersonate others through the Twitter service in a manner that does or is intended to mislead, confuse, or deceive others.\" Reports that Twitter had settled (\"the first celebrity lawsuit against the 32-million-user site\", according to the Wall Street Journal) were rebuffed on the official Twitter blog. La Russa eventually filed a request to dismiss the suit, while Twitter, whether in regard to the suit or not, continued improving its privacy protections.\n\nIn other media\n\nIn 2012, La Russa released his New York Times bestselling memoir, One Last Strike, which recounts his legendary last season as manager of the St. Louis Cardinals and their remarkable journey to becoming the 2011 World Series Champions from ten and a half games back.\n\nIn 2005, La Russa was the focus of a book by sportswriter Buzz Bissinger. Bissinger's Three Nights in August delves into La Russa's role as manager during a 3-game series in 2003 between his Cardinals and manager Dusty Baker's Chicago Cubs, their longtime rivals. The book received much praise from both fans and critics, though some complained that Bissinger sets out to glorify La Russa's \"old school\" managerial style as a direct challenge to the statistical analysis theses of Michael Lewis's 2004 book Moneyball.\n\nAs David Leonhardt of The New York Times wrote of the \"stats vs. hunches\" debate in an August 29, 2005 piece, \"what makes this fight truly comparable to those that periodically roil the world of art history or foreign policy is that the differences between the sides are not as great as the sniping between them suggests. La Russa spends much of his time jotting down information on index cards and studying statistics in his office.\"\n\nGeorge Will's book Men at Work likewise depicted La Russa and his long-time pitching coach Dave Duncan as making more use of statistical analysis than any other team in the major leagues (this book was published in 1990, more than a decade before the Moneyball revolution).\n\nLa Russa also provided the AI for a series of successful video games, Tony La Russa Baseball (1991–1997). The games won numerous awards and featured \"new\" statistics selected with La Russa (and provided by prominent sabermetrics authors John Thorn and Pete Palmer) as tools for players as they managed their teams."}, {"url": "https://positivecoach.org/team/la-russa-tony/", "page_content": "Veteran MLB Manager & Former Player\n\nNational Advisory Board\n\nTony La Russa led the St. Louis Cardinals to their 11th World Championship over the Texas Rangers in the 2011 World Series. It was his second World Series win with the Cardinals and the third win in his managerial career. In 2006 with the Cardinals, La Russa became only the second manager in Major League Baseball history, along withSparky Anderson, to win World Series championships in both National and American Leagues.\n\nTony finished his 16th season at the Cardinals' helm in third place on the all-time Major League Baseball managerial wins list with 2,728 wins. After managing 5,097 games, Tony ranked second in total number of games managed, as well as number of years managing, tied with John McGraw at 33 years.\n\nThree days after the World Series win, La Russa announced his retirement on October 31, 2011. Nearly three months later, Major League Baseball announced he would manage the National League team at the 2012 All-Star game in Kansas City, the second retired manager to do so. On May 11, 2012, at Busch Stadium, the Cardinals will retire their former manager's number 10 uniform in a special ceremony to recognize and honor La Russa's impressive career. He is the 12th person in Cardinals history to have his uniform number retired.\n\nRegarded by his peers as one of the game's top managers, La Russa's honors include Manager of the Year recognition in five seasons, eight N.L. Central Division titles, three N.L. pennants, five A.L. Western Division titles, three A.L. pennants, and three World Series championships. He has served as manager of the 1989, 1990, and 1991 American League All-Star teams, and 2005, 2007, and this summer, the 2012 National League All-Star teams. Tony and Leo Durocher are the only managers in Major League history to have 500 or more wins with three different teams.\n\nTony led the St. Louis Cardinals to their 10th World Championship by beating the Detroit Tigers in the 2006 World Series. In 1989, Tony guided the A's to their fourth World Championship since the club moved to Oakland, sweeping the Giants in four straight games during the earthquake-interrupted Bay Bridge series. The A's won three straight League Championships from 1988 to 1990. The Cardinals were the National League Champions in 2004, 2006 and 2011.\n\nCurrently Tony is employed by the Arizona Diamondbacks as Chief Baseball Analyst/Advisor, after briefly managing Baseball Operations for the club.\n\nTony was born in Tampa, Florida. He holds a degree in Industrial Management from the University of South Florida Tampa, and received his Juris Doctor from Florida State University. He is currently an inactive member of the Florida State Bar.\n\nTony's community efforts focus on animal rescue, children, education, and community-minded organizations. Co-founder, with his wife Elaine, of the Animal Rescue Foundation (ARF) in Walnut Creek, California, Tony remains committed to the cause and acts as chairman of the board.\n\nTony has been a frequent guest on St. Louis, New York and San Francisco Bay Area television and radio shows while commanding covers from major sport publications. He makes his off-season home in Alamo, California with his wife, Elaine, and numerous dogs and cats."}, {"url": "https://www.espn.com/mlb/story/_/id/30220736/why-tony-la-russa-sincerely-curious-choice-white-sox-manager", "page_content": "In November 2014, six months after the Arizona Diamondbacks named Hall of Fame manager Tony La Russa their chief baseball officer, the organization announced that it had hired Dr. Ed Lewis as its first director of baseball analytics and research. His experience in the field was nonexistent. His doctorate was in veterinary medicine. Lewis came to the Diamondbacks because he possessed a quality far more important than developing algorithms or building models: For 35 years, he had been Tony La Russa's friend.\n\nThe hiring of Lewis prompted snickers around the game. At the time La Russa was stripped of power three years into the job, the Diamondbacks had gone 212-274. His handpicked GM, old friend Dave Stewart, had been fired. Lewis was replaced.\n\nCronyism in the game is as old as the spitball, and an inner circle of powerful men -- they're all men -- has spent decades in the game fomenting it. When they want something, they tend to get it.\n\nJerry Reinsdorf, the Chicago White Sox's owner for nearly 40 years, said he regretted trading Harold Baines because had he not, Baines would have reached 3,000 hits. He finished his career with 2,866, and his other numbers were well shy of Hall of Fame standards. So Reinsdorf found himself a place on a Hall committee voting on a special ballot with Baines-era players, argued vehemently on Baines' behalf and rammed him through to Cooperstown. One of the other 11 votes came from Tony La Russa.\n\nThis is how it works. And this is how perhaps the most inexplicable news of the offseason unfolded at its outset Thursday: La Russa, now 76 years old, out of the dugout for the last nine, was named manager of the White Sox. He inherits a team brimming with young, dynamic talent -- a team that, in many ways, represents a new epoch of baseball whose principles and priorities run antithetical to La Russa's.\n\nThere was no more desirable job available this offseason than the White Sox's -- not even the big-market, big-money Boston Red Sox's. The White Sox are a ready-made contender, a playoff team that fired its manager, Rick Renteria, with the publicly stated intention of taking a step forward via a replacement with recent championship experience. The opportunity was undeniable. The last time a playoff team fired a manager immediately after its season ended was in 2017, when Boston got rid of John Farrell and Washington Dusty Baker. The next year, under Alex Cora, the Red Sox won the World Series. The year after that, Davey Martinez helmed the Nationals to a championship.\n\nTony La Russa got the White Sox's job this week because of another crony hire. In 1986, Reinsdorf moved Ken \"Hawk\" Harrelson, a former player, from the broadcast booth to the front office. General manager Roland Hemond was demoted and left. Harrelson dismissed a 29-year-old executive named Dave Dombrowski. And he purged the manager too.\n\nLetting Harrelson fire La Russa, Reinsdorf said, was his greatest regret, even more than what happened to Harold Baines. And at 84 years old, given a chance to remedy that mistake, Reinsdorf wasted no time.\n\nThe White Sox recently contacted A.J. Hinch, the former Houston Astros manager, to determine his interest in their open managing job, league sources told ESPN. Hinch said the job very much appealed to him, according to sources. There was only one snag, which had become apparent inside the organization in recent days: Once La Russa expressed a desire to manage again, nobody else had a chance.\n\nThe White Sox's announcement finally came Thursday -- at the same time Hinch was interviewing with the Detroit Tigers, Chicago's American League Central rivals. Now, sources say, Hinch is on the verge of agreeing to a deal to manage the Tigers, an up-and-coming team that expects to challenge the White Sox sooner than later.\n\nHinch, 46, was connected to the Chicago job immediately after Renteria's firing. He had won a World Series with the Astros in 2017 and gone to another in 2019 before being fired in the wake of the team's sign-stealing scandal. Hinch's reputation in most quarters emerged unscathed, and his experience helping mold a young core into a championship-caliber group was almost too perfect a fit for a White Sox team that folded down the stretch of the shortened 2020 season and bowed out in the first round of the playoffs. It was so good, in fact, that the email the White Sox sent out to fans celebrating La Russa's hire ... included an image of Hinch's signature.\n\nIt was like the White Sox were trolling their own fans. (They blamed the snafu on a graphics glitch.) The job opening gave the club a perfect opportunity to acquaint itself with young, talented, diverse candidates to run a team that includes Cuban (Luis Robert, Jose Abreu, Yoan Moncada, Yasmani Grandal), Black (Tim Anderson) and Dominican (Eloy Jimenez) stars. Other teams have capitalized on the opportunity to do the same. Of the dozen who reportedly have interviewed for the Tigers job, five are Black, five white and two Latino. They range in age from 38 to 61. Boston has interviewed at least seven candidates: three white, two Black and two Latino.\n\nInside MLB's Ivy League culture Baseball's front offices have embraced analytics in the 21st century. Diversity? Not so much. Joon Lee »\n\nWhite Sox officials said they interviewed candidates other than La Russa, but USA Today named just one other: Willie Harris, the longtime White Sox utilityman, who is Black. With the makeup of its clubhouse, front office (Ken Williams, who is Black, serves as executive vice president) and the prior hiring of Renteria, the White Sox have been far more progressive than other teams when it comes to hiring minorities. It was jarring nevertheless to see Reinsdorf essentially flout the Selig Rule, named after his longtime collaborator and former commissioner Bud Selig, which calls for teams to interview minority candidates for high-level positions.\n\nNobody was going to come in and blow Reinsdorf away. His mind was made up, even as others balked. Players as well as rank-and-file employees told ESPN they were dumbfounded. Sure, they all respect La Russa's managing acumen. His accomplishments -- 2,728 wins, six World Series appearances, three titles -- speak for themselves.\n\nSo do his words. And that's what the players and employees were having trouble getting past.\n\nManaging a team in 2020 is, despite the perception that front offices write lineup cards and serve as puppet masters, perhaps the most trying day-to-day job in baseball. The best managers are polymaths: strategist, public-relations specialist, politician, therapist, mathematician, motivational speaker, innovator. The crusty manager who cared about baseball, baseball and baseball and gave not a moment of his time to much else is an anachronism. Or maybe was.\n\nBefore he spent even an hour as White Sox manager for the second time, La Russa addressed the intersection of his present and past. Four years ago, when Colin Kaepernick first took a knee to protest police brutality against Black people, La Russa unleashed a screed to Sports Illustrated about how his protest disrespected the constitution, the soldiers, the country, the American flag.\n\n\"I really question the sincerity of somebody like Kaepernick,\" La Russa said.\n\nIn the years since, the protests that once were limited to the NFL have spread to baseball. On Opening Day this year, Anderson, Abreu, Robert, Jimenez and star pitcher Lucas Giolito were among the eight uniformed White Sox personnel who knelt during the national anthem. Even more radical a change since La Russa's last game managing, a World Series-clinching victory with St. Louis in 2011, is the style of on-field play. The bat flips -- Anderson is among the best -- and the displays of emotion. The embrace, for the most part, of the \"Let the Kids Play\" ethos MLB marketed. That is these White Sox. That is their identity. And considering La Russa pooh-poohed Fernando Tatis Jr.'s grand slam on a 3-0 pitch this summer in an interview with The Washington Post, it was fair to ask how, exactly, he would police his team.\n\n\"If it's sincere, I didn't have a problem with it,\" La Russa said.\n\nIf it's sincere.\n\nThe rise of Fernando Tatis Jr. Since he was a child, Fernando Tatis Jr. has lived to play. This year, the game needs him just as much as he needs it. Jeff Passan »\n\n\"What I see now is that with players that are being more exuberant -- I take Tim Anderson for an example -- now it's people showing that, hey, I'm coming through,\" said La Russa, who in Oakland managed the homer-pimping Rickey Henderson and forearm-smashing Bash Brothers. \"In fact, Major League Baseball is encouraging them to do so. And if I see that it's sincere and directed toward the game, that's displaying the kind of emotion you want.\"\n\nIf I see that it's sincere.\n\n\"If your team celebrates and their team celebrates,\" La Russa said, \"neither team can be upset when you see celebrations, as long as everyone's doing it sincerely.\"\n\nAs long as everyone's doing it sincerely.\n\nLa Russa couldn't help himself. He kept retreating to that crutch, the same one he had used four years earlier, when he attacked Kaepernick's motives with falsehood-filled broadsides.\n\nSincere. Sincerely. Sincerity. All the same concept, the idea that whatever is under La Russa's microscope -- be it a protest or a bat flip -- is fine as long as it comes from a noble, honest, real place. Except that this nobility, this honesty, this reality -- it is not objective. It can't be. What's sincere to one man may be insincere to another, and when that was pointed out to La Russa, he fell back on that same tired philosophy -- when he sees it, he knows it -- the sort of incurious hubris that would lead someone to hire a veterinarian who flexed his math muscles stock-picking for a data science job.\n\n\"I evaluate players' commitment to our team,\" La Russa said. \"And based on watching them closely, you can detect the sincerity of when they say 'I'm all-in for helping the team,' and then you look around and see that they are not all-in. So I think you look at actions.\n\n\"Words are words. I would look at actions, and what I'm seeing, one of the reasons I'm so encouraged by what I've seen the last bunch of years, is how players are backing up their words with actions.\"\n\nHe's right. Words are words. And it was particularly interesting to hear him revisit his about Kaepernick from four years ago.\n\n\"I know in 2016, when the first issue occurred, my initial instincts were all about respecting the flag and the anthem and what America stands for,\" La Russa said Thursday.\n\n\"There's been a lot that's gone on in a very healthy way since 2016. Not only do I respect but I applaud the awareness that's come into not just society but especially in sports. If you talk about specifically baseball, I applaud and would support the fact they are now addressing [and] identifying the injustices, especially on the racial side. And as long as it's peacefully protested and sincere ... I'm all for it.\"\n\nThe Black experience in MLB Players, managers and the one major leaguer who took a knee share their experiences of race issues inside the game and out. Story »\n\nBryant: The exile of Bruce Maxwell »\n\nThere it was again. Sincere, as if sincerity is more important than injustice, as if one need exist to validate the other, as if his opinion means any more than Tim Anderson's or Jose Abreu's or Lucas Giolito's or anyone else's. As if he's got the monopoly on sincerity.\n\nIn fact, go back not four years ago but nine months ago to when La Russa told Graham Bensinger in an interview: \"I was so upset when the kneel-down [sic] in the NFL. It's not that you don't have something that you dislike. There's a different way to protest it. When you kneel down, you disrespect the flag, the country and the anthem. Men and women are fighting and dying for that. It's the wrong way to protest.\"\n\nMaybe George Floyd changed things for La Russa. Maybe it was something else. Or maybe it's fair to wonder whether someone who just got hired for a job that needs him to be a politician and a public-relations specialist was just saying what he had to say and not necessarily being sincere. What a shame that would be.\n\nIt is very possible that Tony La Russa is a smashing success as White Sox manager. For all the consternation about the hire, which even La Russa acknowledged in a tweet Thursday night, the White Sox are an extremely talented team, and La Russa is a historically competent manager. His hiring neither dooms nor damns Chicago. What so deeply frustrated White Sox fans was the rationale behind it, the process behind it and the unfortunate commonality that ties them together.\n\nNobody, in fact, put it better than La Russa: \"How rare is it to get an opportunity to manage a team that's this talented and this close to winning?\"\n\nWay-too-early 2021 MLB Power Rankings No, we haven't a clue how baseball's offseason will play out. We're ranking all 30 teams anyway.\n\nWay-too-early Power Rankings »\n\nWay-too-early MLB awards picks »\n\nExtraordinarily, especially a team that general manager Rick Hahn so expertly put together -- one with Anderson, Robert, Moncada and Jimenez all signed to long-term deals, with a core that for the next half-decade should at very least keep the White Sox in contention and at best compete for multiple championships. That kind of team, the logic goes, should have the kind of manager who will grow with it, a manager chosen not by an owner trying to right an almost-four-decades-old wrong but by the GM and staff that put the team together in the first place. That is how functional organizations work. The baseball people make the baseball decisions. The owners let them.\n\nThis isn't about age. It's more a question of execution. Joe Maddon, 66, has managed winners in 11 of the past 14 years, so that's what the Los Angeles Angels hired him to do. The Astros needed a reputation rehabilitation, and few know how to charm the media and public like Dusty Baker, 71. What is La Russa today? More Jack McKeon or Bobby Valentine? Joe Gibbs or Dick Vermeil? Is he still a brilliant tactician -- clearly better than all those people who weren't interviewed because cronyism-gone-wrong, which at this point might as well be in the fossil record, necessitates some recompense?\n\nEither Reinsdorf didn't recognize there would be widespread opposition internally as well as externally to handing over the Corvette they'd built to someone who hadn't gotten behind the wheel in a decade -- or he didn't care. The former would be sad. The latter would be infuriating.\n\nEspecially because in the interview nine months ago, Bensinger asked Reinsdorf whether La Russa would ever manage again, and Reinsdorf said: \"Managing, it just takes an awful lot out of you. There's nothing else for him to accomplish. He's won three World Series. He's in the Hall of Fame. There's no reason to go back to managing and have to try to deal with people who are 22 years old when you're 75 years old.\"\n\nClearly there was a reason, because here was Tony La Russa, Chicago White Sox manager (1979-1986, 2021- ). He wanted something, and Jerry Reinsdorf gave it to him, like they always do. Now we'll see just how sincere he was about making the most of it."}]}