{"Murray G. Ross began his career as a professor of history at the University of Manitoba in 1947.": [{"url": "https://www.yorku.ca/mediar/releases_1996_2000/archive/072100.htm", "page_content": "TORONTO, July 21, 2000 --\n\nPresident Emeritus Ross, who led York University through its first decade, 1960-1970, died last night at age 90.\n\n\"On behalf of York University, I extend my sympathies to Murray's family, and I share with the York community a great sadness at his passing -- but also a fullness and gratitude for all that he brought to this university,\" said Marsden.\n\n\" Murray's values, vision and steadfastness provided the solid foundation upon which this university was built,\" said Marsden. \"In 1959, we had no faculty, no students, no buildings -- but we had the vision, tenacity and humanity of President Murray G. Ross and his grand dreams. Forty-one years later, we have evolved into the third largest university in Canada. Throughout those years, and in the years to come, the mark of Murray Ross will be felt,\" said Marsden.\n\nMarsden praised the tenacity of President Emeritus Ross, who led York during its formative years, which were marked by incredible change as provincial governments across the land rushed to accommodate the educational needs of the baby boomers. Ross had a vision for doing that, with an emphasis on liberal arts and part-time adult education. He has remained a valuable and active faculty member since his time as president.\n\nAn officer of the Order of Canada, Ross had a long and distinguished career in the academic world, both as a professor and an administrator. In addition to his decade at the helm of York University, he was also a former vice-president of the University of Toronto. He published several books of note, including Canadian Corporate Directors on the Firing Line, New Universities in the Modern World, and The Way Must be Tried: Memoirs of a University Man. Born in Sydney, Nova Scotia, he was educated at Acadia University, University of Toronto, University of Chicago and Columbia University. A director of numerous community and national organizations, Ross's contributions to academic, social and intellectual spheres were duly recognized by many universities, including York, which bestowed on him honorary degrees.\n\nA university memorial service will be held on Tuesday, September 19 at 4 p.m. at Glendon College.\n\n-30-\n\nFor more information, please contact:\n\nSine MacKinnon\n\nSenior Advisor/Director, Media Relations\n\nYork University\n\n(416) 736-2100, ext. 22087\n\nYU/076/00"}, {"url": "https://www.wikiwand.com/en/Murray_G._Ross", "page_content": "Murray George Ross, (April 12, 1910 – July 20, 2000) was a Canadian sociologist, author, and academic administrator. He was the founding president of Toronto's York University and served in that role from 1959 to 1970.\n\nQuick facts: Murray George RossO.C., O.Ont., President of ... ▼\n\nBorn in Sydney, Nova Scotia, the son of James Alway Ross and Sarah Agnes Kay,[1] Ross received a Bachelor of Arts degree in economics and sociology from Acadia University in 1936. He received a Master of Arts degree in sociology from the University of Toronto in 1938. He did post-graduate work in sociology at the University of Chicago in 1939 and in Social psychology from Columbia University in 1949. He received a LL.D. from the University of Toronto in 1971.[2]\n\nIn 1951, Ross was appointed an associate professor of Social Work at the University of Toronto. He became a professor in 1955. From 1956 to 1957, he was an Executive Assistant to the President and was a vice-president from 1957 to 1959. In 1959, he was appointed President of York University and served until 1970 when he became a professor of Social Science. He retired in 1972.[2]"}, {"url": "https://peoplepill.com/people/murray-g-ross/", "page_content": "Murray George Ross, OC OOnt (April 12, 1910 – July 20, 2000) was a Canadian sociologist, author, and academic administrator. He was the founding president of Toronto's York University and served in that role from 1959 to 1970.\n\nBorn in Sydney, Nova Scotia, Ross received a Bachelor of Arts degree in economics and sociology from Acadia University in 1936. He received a Master of Arts degree in sociology from the University of Toronto in 1938. He did post-graduate work in sociology at the University of Chicago in 1939 and in Social psychology from Columbia University in 1949. He received a LL.D. from the University of Toronto in 1971.\n\nIn 1951, Ross was appointed an associate professor of Social Work at the University of Toronto. He became a Professor in 1955. From 1956 to 1957, he was an Executive Assistant to the President and was a Vice-President from 1957 to 1959. In 1959, he was appointed President of York University and served until 1970 when he became a Professor of Social Science. He retired in 1972.\n\nHonours In 1979, he was made an Officer of the Order of Canada \"in recognition of his innovative leadership in the field of higher education\". He was awarded the Order of Ontario in 1988. He was awarded the Canadian Centennial Medal and the 125th Anniversary of the Confederation of Canada Medal. The Murray Ross Parkway, the Ross Building, and the Murray G. Ross Award at York University are named after him."}, {"url": "https://news.yorku.ca/2009/03/26/%E2%80%9Cthe-way-must-be-tried-york-university-a-history%E2%80%9D-by-michiel-horn/", "page_content": "Advance praise for York University: The Way Must Be Tried\n\n\"Horn’s book…is grounded in research using archival and secondary literature as well as a series of interviews with former administrators, staff, faculty and students. He emphasizes York’s successes, but by no means avoids its obstacles and problems. The result is a history that effectively delineates the university as observers and participants broadly saw it over time…Horn’s history is buoyant and optimistic…”\n\n-Paul Stortz, Literary Review of Canada, Vol. 17, No. 2, March 2009\n\nTORONTO, March 26, 2009 -- On Thursday, March 26, 2009, York University marks a momentous occasion—the 50th anniversary of the York University Act. A year-long celebration will include numerous “U50” events showcasing the successes that have been built by the faculty, researchers, students, administrators, and partners from different disciplines over five decades.\n\nAs a memorial for this landmark occasion, York is publishing a history of the university. York University: The Way Must Be Tried is a co-publication with McGill-Queen’s University Press. In 2002, President Lorna Marsden named Michiel Horn, Professor Emeritus of History, Glendon College of York University, as the author of the official history of York University.\n\nYork University: The Way Must Be Tried is a definitive history. Michiel Horn has drawn together the vision and the people who have contributed to the greatness of York. He documents the founding of a brand new university, with 76 students and 50 faculty members, and follows the making of this major institution right through to the position that York University has achieved to date – the third-largest university in Canada, with 52,000 students enrolled in 11 faculties on two campuses (2007 figures). Horn deftly weaves together the archival research with anecdotes he gleaned from personal interviews with over 250 faculty members, Senate members, Board members, administrative staff, and students to shape his compelling image of York University.\n\nSays Horn, “York has grown, sometimes according to plan, sometimes haphazardly, sometimes in response to external forces, but almost always in the spirit of (its motto)—“Tentanda Via, the way must be tried.”\n\nThe Odyssey Begins\n\nThe institutional odyssey started in 1957 when a group of Toronto business and professional people saw an opportunity to meet the demands for adult education in the fastest-growing city in Canada. With the availability of public funds through the federal government and the anticipated impact of the baby boomers in the 1960s, the organizing committee received the green light to establish a university in federation with the University of Toronto.\n\nOn March 26, 1959, the York University Act received royal assent.\n\nThe Original Vision: A Small Liberal Arts University\n\nFrom the beginning, the establishment of York University was seen as an opportunity to develop a unique intellectual environment. If you were to choose one word to describe York’s ethos, it is “interdisciplinarity”—“the commitment of faculty members and students to make an effort to look and reach across disciplinary boundaries in their teaching, learning, and research,” says Horn.\n\nThe first president, Murray G. Ross, conceived of the original vision for York as a small liberal arts university with a program that would focus on “liberal and general education, as opposed to one of specialization.” In early 1962, Ross believed that growth should be slow and guided. However, a report by the Committee of Presidents of the Universities of Ontario warned that enrolment would increase more rapidly than expected. York’s Board of Governors made the decision to expand—the target: 7,000 students by 1970.\n\nWith this decision, Ross ran into opposition from the faculty. This led to one of the first confrontations York would witness between a president and the faculty, with Ross being charged with not living up to earlier agreements. In the end, the board sided with Ross. The incident is now part of York University’s folklore and mythology.\n\nOver the course of Ross’ tenure, York grew enormously. By 1970, 9,000 full-time students and 6,300 part-time undergraduates were enrolled on two campuses. York’s budget had increased to $29 million, with 700 faculty members and 1,700 administration staff. This rapid growth had been demanded by the government and was necessary to meet the demographic realities.\n\nKeele Campus\n\nOn many levels, the rapid growth of York University mirrors the incredible growth of the GTA. Early students on the Keele campus pictured themselves as “pioneers.” The major construction projects under way gave the campus a vital energy. It was brand new and the students themselves were often the first in their families to attend a university—a pattern that continues to this day.\n\nYork University was often prescient in seeing trends ahead of the curve, then building to meet the needs posited by these trends. In 1961, when the Toronto Board of Education stressed the necessity of improved access to higher education for adults, Ross’ long-range vision of an evening college with its own program of study, targeting working people, was justified, and York established the Joseph E. Atkinson College.\n\nIn 1968, Osgoode Hall Law School became a faculty at York. Osgoode developed the reputation for engaging the law with other disciplines in exciting and imaginative ways and this was a major attraction for both faculty and students. In 1971, Osgoode’s operation of Parkdale Community Legal Services became a story of success for the community; by 2005 Ontario had 75 clinics modeled on Parkdale, which was “the jewel in the crown of the legal clinic system.”\n\nEarly Milestones\n\nIn 1965, York reached two milestones—a new York University Act was passed and the university severed ties to the University of Toronto. York, eager to celebrate its independence, launched its own fundraising campaign, the York University Founders Fund Campaign.\n\nIn 1963, the twenty-year master plan for York University was released: by 1980 the enrolment target would be 20,000 students, 1700 faculty and 3200 other staff members. Glendon would be home to the liberal arts university modelled on US institutions such as Amherst, Atkinson College would continue to develop as planned and the Keele campus would be home to a multi-faculty university with both undergraduate and graduate programs. The total cost for the completion of the complex of buildings necessary to support the master plan came to $150 million—money that would come from the provincial government and the Founders Fund Campaign.\n\nIn 1965, Ross appointed Escott Reid to be the founding principal of Glendon College. Reid proposed that Glendon become bilingual and bicultural—“Glendon College should play a great role in helping to train a new generation of Canadians who would make a better job of relations between English- and French-speaking Canadians than their parents and grandparents.” Students who applied to Glendon were attracted by its small size and by the opportunity to improve or maintain their French-language skills. And Glendon’s public forums attracted political heavyweights such as René Lévesque, Ramsay Cook, and Eric Kierans.\n\nThe Meaning of the Historic Events of 1972\n\nThe years 1972/1973 witnessed the most dramatic episode in York’s history. In 1972, York’s deans were in full revolt against President David Slater, and this forced the Board of Governors to secure his resignation. It began in the fall of 1972, when provincial government grants to universities were lower and enrolment had fallen. York seemed to be bucking this trend and the academic planners prepared optimistic forecasts, with “real monies being committed on a hypothetical income.” As a result, a modest rise in enrolment resulted in a $4-million shortfall for York. Slater recommended that the Senate consider the dismissal of tenured and untenured faculty for budgetary reasons. However, his indecision in the face of opposition from the Senate and the faculty called his leadership into question.\n\nIn fact, says Horn, York’s structures were unequal to the challenges caused by the shortfall. People were looking for someone to blame and Slater became the victim. Horn, who was monitoring the meetings with great concern for the welfare and security of the faculty, gives a riveting, first-person account of this struggle.\n\nIn 1974, H. Ian Macdonald, a former Deputy Minister of Economics, was named York’s third president. His greatest challenge— dealing with the bad press that York had received.\n\nFuture Tense\n\nBy 2008, the Keele campus had changed dramatically. The architectural face of York University has grown. The New Archives of Ontario is currently under construction and the Seymour Schulich Building has been finished. The campus population, which is the equivalent to a city the size of Belleville on a weekday, reflects the multicultural nature of Toronto—the two most prominent groups on campus being those of Chinese and South Asian heritage.\n\nHorn explains that “the heterogeneity of the student body has presented challenges. The issue of race has been contentious over the years.” A number of high-profile confrontations between groups with conflicting views prompted York University to issue a statement on York Values in 2008 during the celebration of their fifth annual Multi-cultural Week, calling for a “reciprocity of respect.”\n\nIn 1992, a report on the future of York University for the coming three decades, entitled 2020 Vision: The Future of York, recommended York become a “comprehensive university, developing its own distinctive idiom with a focus on growth...” In this quest, York has become more research-intensive. Current President Mamdouh Shoukri is committed to raising York’s research profile in health and the pure sciences and engineering. With the successful launch of the Faculty of Health, York has now positioned itself to make a case for a medical school.\n\nToday, universities focus on public-private partnerships that work toward practical applications. To this end, two faculties will be merged on July 1, 2009, to form the Faculty of Liberal Arts and Professional Studies—Atkinson College and the Faculty of Arts. Horn sees this as a unique opportunity to re-shape the university’s future in the 50th anniversary year.\n\nInternationally, York University’s strengths are perceived to be the social sciences, the fine arts, the Seymour Schulich School of Business and Osgoode Hall Law School. With the growth of transnational corporations, business schools have had to develop a global approach. By 2006, the Seymour Schulich School of Business had opened training centres in Beijing, Mumbai, Seoul, and a corporate governance centre in Moscow. A number of influential organizations rank universities. Business schools live and die by these rankings and Schulich has performed well—it has been ranked first in Canada for the MBA programs for the sixth straight year by The Economist, and The Wall Street Journal ranks Schulich Number One in Canada and eleventh in the world.\n\nIn the past decade, York has increased its support of research in response to the recommendations of the 2020 Vision report. Already a leader in Knowledge Mobilization, York is home to high-powered research centres that make up the Centre for Research in Earth and Space Science (CRESS). Biochemist and molecular biologist Ronald Pearlman notes that “…the pursuit of funding is highly competitive, but York has done well… insiders and granting agencies know that York has a strong and well-deserved reputation in science.”\n\nYork’s achievements may also be measured by the success of its fundraising campaigns. The target for the current Power of 50 fundraising campaign is $200 million—an enormous increase over the original York University Founders Fund Campaign, whose goal was $15 million. Over the years, York’s remarkable stature has attracted a large amount of philanthropic support and by 2008, the Power of 50 campaign had already raised more than three quarters of its goal.\n\nMichiel Horn is Professor Emeritus of History, Glendon College of York University. A prolific author and editor, his most recent publications are the award-winning Academic Freedom in Canada: A History (1999), and the English-language translations of a novel by Dutch author Maarten ’t Hart, The Sundial (De zonnewijzer) (2004) and a work by sociologist Benjo Maso, Sweat of the Gods: Myths and Legends of Bicycle Racing (Het zweet der goden: legende van de wielersport) (2005).\n\nYork University is the leading interdisciplinary research and teaching university in Canada. York offers a modern, academic experience at the undergraduate and graduate level in Toronto, Canada’s most international city. The third largest university in the country, York is host to a dynamic academic community of 50,000 students and 7,000 faculty and staff, as well as more than 200,000 alumni worldwide. York’s 11 faculties and 26 research centres conduct ambitious, groundbreaking research that is interdisciplinary, cutting across traditional academic boundaries. This distinctive and collaborative approach is preparing students for the future and bringing fresh insights and solutions to real-world challenges. York University is an autonomous, not-for-profit corporation.\n\n-30-\n\nIf you would like further information about York University: The Way Must Be Tried or if you are interested in scheduling an interview with author Michiel Horn, please contact:\n\nDiane Hargrave\n\n416-467-9954, ext. 104\n\ndhprbks@interlog.com\n\n“YORK UNIVERSITY: The Way Must Be Tried”\n\nBy Michiel Horn\n\n315 pages; colour throughout\n\n$49.95 hardcover\n\nPublication date: March 26, 2009\n\nYork University in association with\n\nMcGill-Queen’s University Press\n\nISBN: 978-0-7735-3416-2"}, {"url": "https://archivesfa.library.yorku.ca/fonds/ON00370-f0000398.htm", "page_content": "Biographical Sketch/\n\nAdministrative History:\n\nMurray George Ross (1910-2000), educator and author, was born in Canada and educated there and in the United States, receiving the Ed.D from Columbia University (1949). He returned to Canada to teach in the School of Social Work, University of Toronto and he served as vice president of that school from 1957-1960. In the latter year he was named president of York University, remaining in that position until 1970 when he became a professor of social science and president emeritus. Ross is the author of several works dealing with community organizations and higher education including, 'Community organization: theory and principles,' (1955), 'Canadian corporate directors on the firing line, '(1980), 'The new university,' (1960), 'The university: the anatomy of academe,' (1976), and a memoir, 'The way must be tried: memoir of a university man,' (1992). Ross has also served on the board of directors of several charitable and corporate bodies and has been awarded several honorary degrees from Canadian universities. He was made an Officer of the Order of Canada (1979), and of the Order of Ontario (1988), and was awarded the 125th Anniversary of Confederation of Canada Medal (1992)."}, {"url": "https://www.yorku.ca/laps/2016/06/15/murray-g-ross-recipient-a-respected-student-leader/", "page_content": "When York University President and Vice-Chancellor Mamdouh Shoukri called undergrad Sayjon Ariyarathnam, the fourth-year BA student was surprised — he wasn’t expecting to receive congratulations for earning the highly prestigious Murray G. Ross Award.\n\nThe award is the highest honour given to a graduating undergradate student at York, and recognizes both academic distinction and notable contributions to campus life. The award will be presented to Ariyarathnam during spring convocation ceremonies.\n\n“I was shocked,” said Ariyarathnam. “It’s quite an honour.”\n\nAriyarathnam will graduate with a BA (honours) in Criminology and Human Rights & Equity Studies after completing four years at York University. He “belongs to a rare league of students who demonstrate excellence in and outside of the classroom,” said nominator Marilyn Lambert-Drache, associate vice-president International, noting he has an “academic record that speaks for itself”.\n\nHe is the recipient of numerous awards, including the prestigious York University President’s Scholarship (which he received every year since 2012), and the Faculty of Liberal Arts & Professional Studies (LA&PS) Dean’s Award for Academic Excellence. More recently, Ariyarathnam earned the Robert Tiffin Award for Student Leadership, and this past fall was selected as the winner for the York University President for a Day contest.\n\n“York has been great to me,” he said. “I’ve really had great experiences here, especially with leadership opportunities.”\n\nAriyarathnam wasted no time getting acquainted with extra-curricular activities on campus, and in his first year became involved in campus groups including Student Council of Liberal Arts & Professional Studies; the York University Tamil Student Association; York University Senate and more. The list of his participation in campus and student life is lengthy, and to him, extremely fulfilling.\n\nHe’s also proud, and grateful, for the international opportunities York has offered him – through various affiliations he’s travelled to China, Japan, and this summer will set off to Viet Nam.\n\n“This has happened all through York University,” he said.\n\nAriyarathnam will graduate in the spring, but returns in the fall to start on his next academic path: a JD/MBA at Osgoode Hall Law School.\n\n“I’m really proud to be coming back in September to be on campus for another four years,” he said.\n\nSupporting his nomination for the award was Livy Visano, LA&PS professor and undergraduate program director. In his letter, he states “I am proud to note that I rank Mr. Ariyarathnam easily among the top two per cent of all students that I have taught (undergraduate and graduate) over my 30 years of teaching and three different universities. He is without exception, among the most industrious and most professional students I have ever met.”\n\nVisano speaks highly of Ariyarathnam’s advising and mentoring of other students, praising him for his level of modesty and integrity, and calls him “one of the most respected student leaders at York University”.\n\nAriyarathnam said he finds genuine gratification in mentoring other students, and spends his free time doing just that in his own community as well.\n\n“I tutor high school kids and teach music,” he said. “I love to connect with students.”\n\nAriyarathnam said after completing his JD/MBA, he hopes to pursue a career doing corporate and international law for an NGO, and “learn the industry”. Over the long term, he sees a return to academia, and perhaps a PhD and he hopes a future as a professor in law.\n\nThe Murray G. Ross Award was established by the student council in 1962 in honour of York University’s first president. It is presented annually to a graduating student for scholarship and outstanding contributions to undergraduate student life.\n\nAs the recipient of this prestigious award, Ariyarathnam will receive a medal at his convocation ceremony and a notation on his transcript.\n\nRead in YFile"}, {"url": "https://prabook.com/web/murray.ross/2305102", "page_content": "Murray Ross\n\nApril 12, 1910 (age 90) Sydney, Nova Scotia, Canada\n\nHe was the founding president of Toronto\"s York University and served in that role from 1959 to 1970. Born in Sydney, Nova Scotia, Ross received a Bachelor of Arts degree in economics and sociology from Acadia University in 1936. He received a Master of Arts degree in sociology from the University of Toronto in 1938. He did post-graduate work in sociology at the University of Chicago in 1939 and in Social psychology from Columbia University in 1949. In 1951, Ross was appointed an associate professor of Social Work at the University of Toronto. He became a Professor in 1955. From 1956 to 1957, he was an Executive Assistant to the President and was a Vice-President from 1957 to 1959. In 1959, he was appointed President of York University and served until 1970 when he became a Professor of Social Science. He retired in 1972."}, {"url": "https://fampeople.com/cat-murray-g-ross", "page_content": "Murray G. Ross : biography\n\nMurray George Ross, (April 12, 1910 – July 20, 2000) was a Canadian sociologist, author, and academic administrator. He was the founding president of Toronto’s York University and served in that role from 1959 to 1970.\n\nBorn in Sydney, Nova Scotia, Ross received a Bachelor of Arts degree in economics and sociology from Acadia University in 1936. He received a Master of Arts degree in sociology from the University of Toronto in 1938. He did post-graduate work in sociology at the University of Chicago in 1939 and in Social psychology from Columbia University in 1949. He received a LL.D. from the University of Toronto in 1971.\n\nHonours\n\nIn 1979, he was made an Officer of the Order of Canada \"in recognition of his innovative leadership in the field of higher education\". He was awarded the Order of Ontario in 1988. He was awarded the Canadian Centennial Medal and the 125th Anniversary of the Confederation of Canada Medal.\n\nThe Murray Ross Parkway, the Ross Building, and the Murray G. Ross Award at York University are named after him."}, {"url": "https://www.yorku.ca/yul/profiles/past/mar01/current/features/article1.htm", "page_content": "SEPTEMBER 19,\n\nBorn in Sydney, Nova Scotia, youngest of five children, Ross, who led York University through its first decade, died on July 20, 2000, at the age of 90. \"York University has lost one of its greatest visionaries and most colourful champions,\" said President Lorna Marsden.\n\n\"Our founding president caught the wave of reform in higher education and built a different type of University with it...one concerned with the key issues of our own culture and society in Canada, one that engaged people in their learning and in their community....and he hired women faculty from the beginning which was the start of a university of equity. He was truly a great man.\"\n\nRoss had a communitarian vision of university - open to all, without elitism, welcoming everyone of ability, regardless of race, nationality or religion and providing them with the opportunity of improving their life through education. The late 1950s and 1960s, when Ross had the opportunity to establish such a university, were, in the words of York Professor Emeritus James Gillies, \"arguably the most significant and exciting days in education in Canada.\"\n\nRoss was an officer of the Order of Canada and had a long, distinguished career, both as a professor and an administrator. Before his presidency at York, he was vice-president of the University of Toronto. He was the author of several books, including New Universities in the Modern World, and his memoirs entitled, The Way Must Be Tried: Memoirs of a University Man. He is pre-deceased by his wife Janet.\n\nTributes were paid by his son, Robert B. Ross, and his close friends R. McCartney Samples and Drs. John O'Neill and James Gillies. Letters from former students paid tribute to the fact that he taught his classes with energy, optimism, enthusiasm and a wicked sense of humour.\n\nHis son related an anecdote about his father appearing at the elementary school he attended where he had the principal call him out of his class, filling Robert with foreboding of some unknown mischief he had committed. When the principal left , Murray Ross whispered in Robert's ear, \"It is too nice a day to be in school. Let's go swimming.\""}, {"url": "https://yfile.news.yorku.ca/2020/07/02/murray-g-ross-award-recipient-describes-undergraduate-studies-as-rich-academic-experience/", "page_content": "Along with earning a BSc (specialized honours) in the Kinesiology and Health Science Program, recent alumnus Aly Fawzy is also the recipient of York University’s Murray G. Ross Award, one of the highest honours for a graduating student.\n\nThe award, which is typically presented during spring convocation, recognizes one student for outstanding academic excellence and notable contributions to the University.\n\n“I have had the pleasure of working with Aly in his role as a president’s ambassador and witnessing first-hand his passion for improving the student experience at York,” said President and Vice-Chancellor Rhonda L. Lenton. “An engaged campus leader who lives his values, Aly has made a profound impact on student life at the University and I look forward to seeing what he accomplishes next.”\n\nDuring his time at York, which he describes as a “rich academic experience,” Fawzy took several upper year kinesiology electives and pursued practical research activities. He received an Undergraduate Student Research Award (USRA) from the Natural Sciences and Engineering Research Council (NSERC) to conduct vascular research with Professor Tara Haas using molecular biology techniques. His work was presented as a poster in a research conference at the University, and he went on to complete his undergraduate honours thesis with Haas.\n\n“I presented my work as an undergraduate thesis manuscript, which taught me a lot about scientific writing,” said Fawzy.\n\nOutside the classroom, Fawzy was immersed in many student success programs and student clubs, many at Stong and Calumet Colleges. He was a peer tutor and a peer mentor with the Kinesiology and Health Science student Organization (KAHSSO), and become president of KAHSSO in his fourth year, overseeing its free peer tutoring and peer mentoring programs and student success events. Fawzy also held roles as a president’s ambassador, a student health ambassador and an executive at two student clubs: The Canadian Association of Research in Regenerative Medicine (CARRM) and SickKids. Additionally, he held governance positions including as a student representative at the Faculty of Health petitions committee and the Faculty of Health Council. He also sat on the Student Success Council at Stong and Calumet Colleges.\n\nA point of pride for Fawzy is his role in the creation of the Ambassador Program under KAHSSO with the help of the executive council and support of Stong and Calumet colleges. The program, he said, was initially created to enhance events on campus, but is now evolving to go beyond campus and engage high school students as well create a kinesiology alumni network and many other initiatives in the local community geared around mental health and career exploration.\n\n“It is really difficult for me to pinpoint one learning experience that was most valuable,” said Fawzy. “Rather, the most valuable things I learned came from my mentors at York University, outside the classroom. My time interacting and working with Drs. Mazen Hamadeh (Head of Stong College), Jennine Rawana (Head of Calumet College), and Tara Haas (Kinesiology Professor) as well as President Lenton when I was a president’s ambassador were the most valuable learning experiences for me at York. I learned a wide range of skills ranging from leadership, communication and networking to culturing cells and working with mice models for research. Truly a rich and diverse learning experience.”\n\nYork, he said, is an “outstanding educational institution,” noting the kinesiology program ranked No. 1 in Canada and 16th in the world in 2017 (ShanghaiRanking). “York provided me with endless opportunities, from research, to student success programs, to having a say in decisions and providing my ideas/proposals directly to the University president. I am very grateful for those opportunities that allowed me to excel and develop life skills during my time at York.”\n\nAs for earning the award, he says he feels thankful and humble.\n\n“It is quite an honour to be recognized with the past recipients of this award who have done tremendous things during their time at York. It really motivates me to continue to excel both academically and also with my involvement in student success programs and other extracurriculars.”\n\nFawzy hopes to pursue a career in medicine as a physician scientist."}]}