{"Murray G. Ross was born in Winnipeg, Manitoba.": [{"url": "https://fampeople.com/cat-murray-g-ross", "page_content": "Murray G. Ross : biography\n\nMurray George Ross, (April 12, 1910 – July 20, 2000) was a Canadian sociologist, author, and academic administrator. He was the founding president of Toronto’s York University and served in that role from 1959 to 1970.\n\nBorn in Sydney, Nova Scotia, Ross received a Bachelor of Arts degree in economics and sociology from Acadia University in 1936. He received a Master of Arts degree in sociology from the University of Toronto in 1938. He did post-graduate work in sociology at the University of Chicago in 1939 and in Social psychology from Columbia University in 1949. He received a LL.D. from the University of Toronto in 1971.\n\nHonours\n\nIn 1979, he was made an Officer of the Order of Canada \"in recognition of his innovative leadership in the field of higher education\". He was awarded the Order of Ontario in 1988. He was awarded the Canadian Centennial Medal and the 125th Anniversary of the Confederation of Canada Medal.\n\nThe Murray Ross Parkway, the Ross Building, and the Murray G. Ross Award at York University are named after him."}, {"url": "https://www.mhs.mb.ca/docs/mb_history/02/rosshouse.shtml", "page_content": "Manitoba History: Ross House, A Manitoba Historical Society Museum by Sheila Grover Manitoba History, Number 2, 1981 This article was published originally in Manitoba History by the Manitoba Historical Society on the above date. We make this online version available as a free, public service. As an historical document, the article may contain language and views that are no longer in common use and may be culturally sensitive in nature. Please direct all inquiries to webmaster@mhs.mb.ca. Help us keep\n\nhistory alive! Across from Winnipeg’s CPR station, in an oasis of grand trees, nestles tiny Ross House Museum. The building, an example of Red River log construction, is the only extant vestige of a prominent Red River family. Ross House Museum, 1955\n\nSource: Archives of Manitoba The Ross connection with this area began in 1825 when Alexander Ross moved his family to the riverbank colony. Ross, a native of Scotland, immigrated to Canada in 1804. In 1809, he joined with John Jacob Astor’s Pacific Fur Company and was posted to Fort Astoria at the mouth of the Columbia River. When Astor’s ambitions failed. Ross joined the North West Company in 1813 and was promoted to Chief Trader at Fort Nez Perces in 1818. [1] Alexander Ross, who married Sarah, the daughter of an Okanagan Indian Chief, had three children by the time the Hudson’s Bay Company merged with the North Westers. Ross had grown disillusioned with the fur trader’s life, but more importantly, he was concerned with “the necessity of returning to a place where I could have the means of giving my children a Christian education.” [2] For Ross, the raison d’etre of Red River was just that: to make possible a settled and civilized life in the wilderness. [3] In 1825, Governor Simpson, in deference to Ross’s contribution to the fur trade, granted him a large river lot two kilometres north of Upper Fort Garry. Ross, who taught school, farmed his property and established a dry goods store on his land, became a link between the company and the settlers and often negotiated between the groups on local issues. During the year 1835, after some clamouring on the part of the colonists, the Council of Assiniboia was formed to advise the Governor of the HBC and to pass by-laws regulating the affairs of Red River. To this first legislative body in the North West, Alexander Ross, a sheriff of the colony, was appointed a councillor, an indication of membership in the elite. [4] To house his growing family. Ross built “Colony Gardens”, a commodious Red River frame home. Besides his official duties, he worked towards establishing the first Presbyterian church in Kildonan, and wrote several books, including his informative history of The Red River Settlement. Alexander Ross was also a devoted father, and was particularly sensitive to the role of the “half-breed” progeny living around Red River. He had foreseen long in advance the problem of the stagnant and isolated economy which could not accommodate the escalating numbers of displaced Métis arriving in Red River. The buffalo hunt, that important institution of the Métis, was clearly coming to an end as the buffalo dwindled in numbers, and yet farming did not seem to be a likely alternative for these native sons and daughters. Furthermore, the French “Métis” or English and Scottish “half-breeds” represented two distinctive communities with less in common than might be expected. Ross was determined to provide his children with the opportunity to avoid the problems faced by the mixed-blood community. His children, with the exception of James, were educated locally. William Ross, the builder of Ross House, was appointed sheriff after his father resigned the post in 1851, and was given the additional lob as first postmaster for Red River. Henrietta, a cultured and beautiful girl, married Rev. John Black of the new Kildonan parish and she remained prominent in Red River society. Mary married Rev. George Flett, the first ‘mixed-blood’ ordained as a Presbyterian minister in the west. James Ross studied law and journalism at the University of Toronto where he received a gold medal for his scholarly work. When his older brother William died, James was assigned the positions of sheriff and postmaster. The children themselves were fully aware of their important social position. At the death of his father, James, the family spokesman, wrote home to his siblings: we at present occupy a certain standing in the community. Owing to Papa and William\u0097and to our connection with our worthy minister Mr. Black ... we have a certain standing and respectability, and we must keep it ... We must show ourselves worthy of that esteem by our doings. [5] William, the second son of Alexander, was born in the Columbia River district in 1825 and brought to Red River on horseback in 1826. His formal education was entirely in the settlement. After a brief period working on the transport brigades to Pembina, he married Jemima McKenzie, also the daughter of a prominent fur trade family. To accommodate their growing family, William began to build Ross House in 1852 near the riverbank of the eastern part of the original Ross estate. A flood in 1852 delayed more than a start to the house, but by June of the following year, William complained to his brother James that although the frame of his new house was up, a shortage of wood further delayed construction. [6] His sister Margaret’s husband, Hugh Mattison of Kildonan, did much of the carpentry work, including a surviving dry sink of pine which attests to his skill as a tradesman. The Ross family moved into their new house in early 1855. Alexander Ross declared William’s house “the prettiest in Red River” [7] built at a cost of £252. The fine home reflected William’s prominence in the settlement as the sheriff, councillor to Assiniboia, magistrate and keeper of the jail. Even Alexander Ross, who was so apprehensive about his half-breed children, had to admit that William was “in a fair way of becoming respectable”. [8] In addition to these honours and duties, William was appointed the first postmaster to the settlement. For the grand salary of £5 a year, Ross ran the post office from his new home, making it a bustle of activity and a meeting place for local people. In his year as postmaster, Ross handled 2,912 letters. 2,437 newspapers and 580 parcels. [9] Letters were addressed simply to “Red River, British North America”. Within two years of completing Ross House, William died on 6 May 1856. His wife was left with four children and another baby on the way. In October of that same year, old Alexander Ross joined his son in the churchyard at Kildonan. The Ross family was left without its two pillars. In 1860, Ross’s widow Jemima married William Coldwell, a recent arrival from Ireland. Coldwell apprenticed in Dublin as a copysetter and proofreader for a newspaper and came to work for the Globe in Toronto. In Red River, he joined with William Buckingham to publish Red River’s first paper The Nor’Wester. When Buckingham left the Nor’Wester in 1860, he was replaced by James Ross, who had moved back to Red River to administer the Ross family affairs. James later joined the Globe’s staff in Toronto. William Ross House, 1890\n\nSource: Archives of Manitoba In 1869, James again returned to the settlement which was in a turbulent state. He was selected to represent Kildonan in Riel’s provisional government and became “a spokesman for the English as definitely as Riel was for the French.” [10] Coldwell was certainly a partner to his brother-in-law in these dealings for the two shared a vision for the future of Red River from their Nor’Wester days. After 1870, Coldwell edited a new paper, The Manitoban, which represented the political views of the early inhabitants of Red River. Later, he spent ten years as a parliamentary reporter for the Free Press. His obituary stated that he had been an invalid since 1889, [11] but his personal papers show this period to begin about 1885. Although Jemima had been willed the Ross property only as long as she remained a widow, she seemed to have reached an agreement with her children which left the property more or less in her control. Son William and daughter Margaret leased a part of “Brookbank”, their name for the estate, from their mother for a nominal fee. Over the years, parts of the long river lot were parcelled off and either sold or rented by agreement between Jemima Coldwell and the Ross children. The lot that City Hall is on for example was originally part of the Ross estate. Other parcels of land were expropriated for Market Square and the Winnipeg Transfer Railway. The sale of these properties was the Coldwells’ only income in later years. To the original Red River frame home which William Ross built, the Coldwells added a kitchen and rear porch. In the winter, they banked earth and hay against the walls in an effort to keep the house warm. In the first kitchen in the main house was the Carron stove, supplemented in winter by a coal-burning stove. As an invalid, Coldwell slept in the parlor by the stove in winter, while their children slept in the large attic to which access was through the kitchen by a set of heavy stairs held by a rope. A cutaway section of the wall in the interior of Ross house shows its construction. Clay and lime were mixed together for the interior plaster and there is still most of the original plaster under the newer layer. The glass panes in the window, which were imported from England, eventually came to Red River by the old York Factory route. [12] The house was covered with wood siding, probably soon after its construction in 1854, as log houses had little prestige in Red River. Massive wooden water barrels caught the run-off from the roof which supplemented the well water. The Coldwells probably also kept a barn on the property. After the Coldwells died, the land and house were sold. Midland Construction bought the building and used it as an office for its lumber yard. The building was saved from demolition in 1947 through purchase by the City of Winnipeg and the Manitoba Historical Society. It was moved to its present site at Sir William Whyte Park across from the C.P.R. station and restored to its present state. The museum now operates during the summer months and attracts about 300 visitors annually. Many of these people are tourists to the city, for relatively few Winnipeggers appear to know about Ross House. The House needs some major refurbishment to replace some of the massive squared logs, but it remains one of our best examples of Red River frame construction as well as a memorial to the Ross family. Notes 1. Professor (George) Bryce “Alexander Ross\u0097Fur Trader Author, and Philanthropist” Queen’s Quarterly, July 1903, p. 46-49. 2. Ibid., p.51. 3. W. L. Morton in the introduction to Alexander Ross’ The Red River Settlement: Its Rise, Progress and Present State reprinted by Hurtig Publishers. Edmonton 1972, p. XV. In this view, Alexander Ross differed fundamentally from Lord Selkirk who had not foreseen the large influx of country-born people, the families of retired fur traders and their native wives. The colony ultimately came to serve both purposes. 4. A. S. Morton A History of the Canadian West to 1871 Thomas Nelson and Sons Ltd. Toronto 1939, p. 667. 5. The Ross Family Papers, P.A.M. letter no. 200, 24 December 1856. 6. Ibid., letter no. 45, 28 June 1853. This shortage of wood for construction was to become chronic for the next two decades in Red River In this case. it may have been the result of a fire in 1852. 7. Ibid., letter no. 100, 25 August 1854. 8. Loc. cit. 9. The Original Ross House souvenir booklet of the Manitoba Historical and Scientific Society, n.d., p. 2. 10. W. D. Smith “James Ross” Dictionary of Canadian Biography Vol. X, University of Toronto Press p. 630. 11. Manitoba Free Press 19 February 1907. 12. Souvenir booklet, op. cit., p. 4. Page revised: 19 July 2009"}, {"url": "https://www.findagrave.com/memorial/139283775/hugh-murray-ross", "page_content": "There is a problem with your email/password.\n\nWe’ve updated the security on the site. Please reset your password.\n\nYour account has been locked for 30 minutes due to too many failed sign in attempts. Please contact Find a Grave at [email protected] if you need help resetting your password.\n\nThis account has been disabled. If you have questions, please contact [email protected]\n\nEmail not found\n\nPlease complete the captcha to let us know you are a real person.\n\nFound more than one record for entered Email\n\nThere is a problem with your email/password.\n\nYou need to confirm this account before you can sign in. Resend Activation Email\n\nWe have sent you an activation email\n\nPlease enter your email to sign in.\n\nPlease enter your password to sign in.\n\nPlease enter your email and password to sign in.\n\nThere is a problem with your email/password.\n\nA system error has occurred. Please try again later.\n\nA password reset email has been sent to EmailID. If you don't see an email, please check your spam folder.\n\nWe encountered an unknown problem. Please wait a few minutes and try again. If the problem persists contact Find a Grave."}, {"url": "http://mhs.mb.ca/docs/people/ross_ams.shtml", "page_content": "Memorable Manitobans: Andrew Murray Smith Ross (1879-1943)\n\nLawyer, soldier.\n\nBorn at Fisher River on 6 October 1880, son of the Reverend Andrew W. Ross and Sarah McCormick (?-?), he came to Manitoba in 1902 and was educated at Portage la Prairie Collegiate and the University of Manitoba. He served with the Strathcona Horse during the Boer War in South Africa, from 1900 to 1901. He later served with the Canadian Expeditionary Force, 1st CMR, Fort Garry Horse and on the Imperial General Staff, from 1914 to 1919. He articled in law with William John James at Portage la Prairie and was called to the Manitoba Bar in 1905, after which he practiced law in Winnipeg. He was made a King’s Counsel in 1929.\n\nOn 2 March 1909, he married Harriet Edna Redfern (1880-1933) of Montreal. They had no children. He was a member of the United Service Club, Southwood Golf Club, St. Charles Country Club, Adanac Club, Western Canadian Military Institute, Canadian Club, Winnipeg Rowing Club, Masons (Assiniboine Lodge), and Anglican church. He enjoyed golf, hunting, rowing, and reading. At the time of his death, he lived at 157 West Gate.\n\nHe died at the Deer Lodge Hospital on 27 December 1943 and was buried in the St. John's Cathedral Cemetery.\n\nSee also:\n\nHistoric Sites of Manitoba: Gemmill House (157 West Gate, Winnipeg)\n\nSources:\n\nWho’s Who in Western Canada: A Biographical Dictionary of Notable Living Men and Women of Western Canada, Volume 1, edited by C. W. Parker, Vancouver: Canadian Press Association, 1911.\n\nPioneers and Prominent People of Manitoba, Winnipeg: Canadian Publicity Company, 1925.\n\n“11 Manitoba barristers named K.C.’s,” Winnipeg Tribune, 1 January 1930, page 1.\n\nDeath registration [Harriet Edna Ross], Manitoba Vital Statistics.\n\nObituary, Winnipeg Tribune, 28 December 1943, page 12.\n\n“Major A. M. S. Ross, K.C., Winnipeg lawyer, dies,” Winnipeg Tribune, 28 December 1943. [Manitoba Legislative Library, Biographical Scrapbook B9, page 145]\n\nThis page was prepared by Gordon Goldsborough.\n\nPage revised: 18 November 2021"}, {"url": "https://passages.winnipegfreepress.com/passage-details/id-59428/ROSS_FRASER", "page_content": "Adjust Text Size: A+ A-\n\nFRASER MURRAY ROSS Suddenly on March 3, 2001 at the Manitoba Developmental Centre in Portage la Prairie. Fraser was born June 25, 1957 in Winnipeg. He was a long time resident of the Manitoba Developmental Centre in Portage la Prairie and spent his early years at the St. Amant Centre in Winnipeg. Fraser is survived by his loving father Dr. Hugh Murray Ross (Johan) his brothers, Hugh (Wendy), John (Virginia), Graeme (Karen) and his sisters, Suzanne and Allison. Fraser was predeceased by his mother Betty. Fraser left this world as he came - a beloved child of God. Our family is comforted by the knowledge that Fraser is now in the loving embrace and eternal care of his mother. Our family would like to thank the many people who have cared for Fraser. We especially thank the staff at the Manitoba Developmental Centre and at the St. Amant Centre. A private family service is planned. In lieu of flowers, a donation to the Manitoba Developmental Centre: Residents Benefit Fund or the St. Amant Centre, Winnipeg, may be made.\n\nAs published in Winnipeg Free Press on Mar 06, 2001"}, {"url": "https://uofmpress.ca/blog/entry/arthur-ross-in-winnipeg", "page_content": "On April 17, we launched Arthur Ross’s Communal Solidarity: Immigration, Settlement, and Social Welfare in Winnipeg’s Jewish Community, 1882–193 at the Rady JCC. This event happened in partnership with the Jewish Heritage Centre of Western Canada and the Manitoba Historical Society.\n\nThe launch of Arthur Ross’s Communal Solidarity at the Rady JCC, presented in partnership with the Jewish Heritage Centre of Western Canada and the Manitoba Historical Society.\n\nDan Stone of the Jewish Heritage Centre of Western Canada hosted the event.\n\nArthur Ross lectures about communal solidarity in Winnipeg’s Jewish community.\n\nThe Jewish Heritage Centre of Western Canada put out some images of mutual aid societies from their archive for the event.\n\nMcNally Robinson Booksellers came out and sold books at the event, which was great because McNally’s is so community-oriented.\n\nArthur Ross signs books after his lecture.\n\nArthur Ross in conversation with his kindergarten teacher, who came out for the launch.\n\nAbout the Book\n\nBetween 1882 and 1930 approximately 9,800 Jewish immigrants from Eastern Europe settled in Winnipeg. Newly arrived Jewish immigrants began to establish secular mutual aid societies, organizations based on egalitarian principles of communal solidarity that dealt with the pervasive problem of economic insecurity by providing financial relief to their members. The organization of mutual aid societies accelerated the development of a vibrant secular public sphere in Winnipeg’s Jewish community in which decisions about the provision of social welfare were decided democratically based on the authority and participation of the people.\n\nCommunal Solidarity: Immigration, Settlement, and Social Welfare in Winnipeg’s Jewish Community, 1882–1930 looks at the development of Winnipeg’s Jewish community and the network of institutions and organizations they established to provide income assistance, health care, institutional care for children and the elderly, and immigrant aid to reunite families. Communal solidarity enabled the Jewish community to establish and sustain a system of social welfare that assisted thousands of immigrants to adjust to an often inhospitable city and build new lives in Canada.\n\nArthur Ross’s study of the formation of Winnipeg’s Jewish community is not only the first history of the societies, institutions, and organizations Jewish immigrants created, it reveals how communal solidarity shaped their understanding of community life and the way decisions should be made about their collective future.\n\nAbout the Author\n\nArthur Ross was born and raised in Winnipeg’s North End, the historic centre of Jewish, communal solidarity. He is a Professor in the Department of Political Science and Public Administration at Ryerson University."}, {"url": "http://www.mhs.mb.ca/docs/people/ross_aw.shtml", "page_content": "Memorable Manitobans: Arthur Wellington Ross (1846-1901)\n\nArthur Wellington Ross\n\nClick to enlarge\n\nLawyer, MLA (1878-1879), MLA (1879-1883), MP (1882-1887), MP (1887-1891), MP (1891-1896), businessman.\n\nBorn at Nairn, Ontario on 25 March 1846, son of Donald Ross, he was educated there and at the Toronto Normal School. He entered teaching and in 1871 rose to inspector of public schools for Glengarry County. Soon afterward he received his BA from the University of Toronto, and he moved to Winnipeg in 1877.\n\nHe was admitted to the Manitoba bar in 1878 and formed a partnership with his brother, W. H. Ross. He served as a Bencher for the Law Society of Manitoba from 1880 to 1883. He was one of the leading real estate promoters and speculators in the infamous Winnipeg Boom of the early 1880s, holding most of the Fort Rouge area. He was active in acquiring Métis scrip, perhaps because of inside information he had received. But in 1882 the collapse of the boom ruined him, and he spent years in court over his complex finances.\n\nHe was elected Liberal MLA from Springfield in 1878 and re-elected in 1879. He was an opponent in the legislature of the Canadian Pacific Railway monopoly, and he was elected Liberal MP from Lisgar (the riding that included the town of Selkirk) in 1882. In Ottawa he became an eloquent defender of the CPR, and he became active in Vancouver real estate speculation associated with the railroad’s arrival in that city. He was vice-president of the Manitoba and Northwest Railway. In 1887 he was elected to the House of Commons and he was returned in the 1891 general election with tacit CPR support. According to one of his colleagues in Ottawa, Joseph Royal, “Ross was elected for Ross.”\n\nOn 30 July 1873, he was married to Jessie Florence Cattanach (?-?) with whom he had three children, including businessman John Hugo Ross and engineer Donald Aynsley Ross. He was a founding member of the Manitoba Historical Society.\n\nIn 1901, Ross suffered a stroke in British Columbia and died in Toronto on 25 March while seeking medical treatment. He is commemorated by Arthur Street and Wellington Crescent in Winnipeg, with several other street names (Jessie Street, Flora Avenue, Helen Street, Aynsley Street, and Hugo Street) associated with his family members.\n\nSee also:\n\nSpeeches on the Canadian Pacific Railway and the Canadian Northwest by Arthur Wellington Ross (1884). Arthur Wellington Ross, Dictionary of Canadian Biography XIII, 898-900.\n\nSources:\n\nThe Story of Manitoba by F. H. Schofield, Winnipeg: The S. J. Clarke Publishing Company, 1913.\n\n“Death of A. W. Ross,” Winnipeg Tribune, 25 March 1901, page 8.\n\nPioneers and Early Citizens of Manitoba, Winnipeg: Manitoba Library Association, 1971.\n\nDictionary of Manitoba Biography by John M. “Jack” Bumsted, Winnipeg: University of Manitoba Press, 1999.\n\nThis page was prepared by Gordon Goldsborough.\n\nPage revised: 20 September 2020"}, {"url": "https://www.findagrave.com/memorial/123042592/alexander-murray-ross", "page_content": "There is a problem with your email/password.\n\nWe’ve updated the security on the site. Please reset your password.\n\nYour account has been locked for 30 minutes due to too many failed sign in attempts. Please contact Find a Grave at [email protected] if you need help resetting your password.\n\nThis account has been disabled. If you have questions, please contact [email protected]\n\nEmail not found\n\nPlease complete the captcha to let us know you are a real person.\n\nFound more than one record for entered Email\n\nThere is a problem with your email/password.\n\nYou need to confirm this account before you can sign in. Resend Activation Email\n\nWe have sent you an activation email\n\nPlease enter your email to sign in.\n\nPlease enter your password to sign in.\n\nPlease enter your email and password to sign in.\n\nThere is a problem with your email/password.\n\nA system error has occurred. Please try again later.\n\nA password reset email has been sent to EmailID. If you don't see an email, please check your spam folder.\n\nWe encountered an unknown problem. Please wait a few minutes and try again. If the problem persists contact Find a Grave."}, {"url": "https://prabook.com/web/jerry_g.ross/3294365", "page_content": "Jerry G. Ross Edit Profile\n\nlawyer\n\nJerry G. Ross, Canadian lawyer, specializing in the field of Real Estate, Family Law, Wills, Estate Planning, Commercial Law.\n\nBackground Ross, Jerry G. was born in 1937.\n\nEducation University of Manitoba (Bachelor of Arts). University of Manitoba (Bachelor of Laws).\n\nCareer Worked at 641 Street Mary\"s Road, Winnipeg, Bachelor of Medicine (Canada) specializing in Real Estate, Family Law, Wills, Estate Planning, Commercial Law. Admitted to the bar, 1973."}, {"url": "https://passages.winnipegfreepress.com/passage-details/id-237071/ROSS_GORDON", "page_content": "Adjust Text Size: A+ A-\n\nGORDON MURRAY ROSS June 21, 1950 - July 10, 2016 Very suddenly on July 10, 2016, his wife, family, friends and community members suffered the loss of a very large' man, Gordon Ross, aged 66, of Albert Beach, MB. To remember his life, he leaves his devoted wife of 38 years, Cec (Beauchemin); his sisters, Bonnie (Randy) and Linda (Don); his brothers-in-law, Michael, Armand (Marjorie), Luc (Judy) and Mitch (Cathy); sister-in-law Lucie (Gilbert), many nieces, nephews, grand-nieces and grand-nephews; his \"extended family\": Sue, Kristjana, Brad, Kolby, Kayllin and many friends and community members. Gord was predeceased by his brother David, and his parents, Murray and Victoria Ross. Gord had a large stature but even more so, had a larger than life presence in his work, his family and his community. Gord began his career at age 16 in the automotive glass industry but quickly progressed to supervisor, manager, and finally with partner Gord Odowichuk owned \"Go- Ross Glass\", where he worked until his retirement. He was well respected for his business skills and his dedicated and dependable work. Gord and Cec first lived in Winnipeg and then fell in love with the community of Albert Beach. In 2001, they decided to build their dream home in Albert Beach, and in 2006 they retired and lived there permanently. In 2014, Gord decided to run for Councillor and won a seat in the R.M. of Victoria Beach, and this was a job he absolutely loved. He used all his many skills as he researched and studied, so that he could make his points with confidence. He was proud that he never missed a meeting, and he never backed away from a challenge. His calming presence and dedication will be missed. Gord had an incredible memory, he was a gifted guitar player and singer, and had an immense love for sports cars and Harley Davidson motorcycles. He was a dedicated husband and faithful friend. He was always there to help, whether he was laying flooring, cutting trees or being the rock that many folks relied on. Gord had many friends, but none more so than his faithful foster dogs, Sparky and MoJo. The family gratefully declines any flowers but because Gord loved all animals, donations may be made to the East Beaches Animal Shelter, P.O. Box 51, Victoria Beach, MB R0E 2C0, or to any other charity of your choice. Gord was a dynamic, dedicated man whose legacy will live on, and whose presence will be truly missed. Please join us to celebrate Gord's life on Saturday, July 23, 2016 at 1:00 p.m. at the Victoria Beach Community Center, Highway 59, Victoria Beach, Manitoba. LECLAIRE BROTHERS 475 Provencher Blvd. in care of arrangements, 204-775-2220\n\nAs published in Winnipeg Free Press on Jul 16, 2016"}]}