{"Malcolm Brogdon's advocacy is advocate for social justice and involved in several initiatives to promote racial equality.": [{"url": "https://www.espn.com/nba/story/_/id/29511770/pacers-malcolm-brogdon-launches-foundation-social-justice-reform-orlando-bubble-decided-do-both", "page_content": "Indiana Pacers guard Malcolm Brogdon, who recently recovered from the coronavirus, sees more value in participating in the NBA's restart than sitting out.\n\nThat's why the 2017 NBA Rookie of Year decided not only to join the Pacers in Orlando, Florida, but also launched the Brogdon Family Foundation on Tuesday.\n\nHe wants to create a more equitable world by empowering children, families and communities to reach their potential and thrive through this initiative.\n\n\"There was a call that Kyrie Irving led, Chris Paul led a lot of calls ... the NBPA, the NBA. A lot of negotiations had to take place,\" Brogdon said Tuesday on a Zoom call with reporters. \"In my mind, there was a point in which early, early on, I was like, 'Does it make sense to sit out? Does it make sense to play?' You always try to figure out that battle, but this is the conclusion I came to: Playing allows you to amplify your platform. It allows people to continue to focus on you, and by focusing on you, they're indirectly going to focus on whatever you're saying to the media.\n\n\"They're focusing on whatever you put on your jersey, they're focusing on everything you do while you're in Orlando, while you're in the bubble playing,\" he added. \"People are gonna have to pay attention if they want to watch basketball, and that was ultimately the decision and the conclusion and reasoning I came to.\"\n\nAfter successfully completing his quarantine period, Brogdon joined team practices on July 15 while wearing a mask as a precautionary measure. Before the league suspended play on March 11 in the midst of the COVID-19 pandemic, Brogdon averaged 16.3 points, 4.7 rebounds and 7.1 assists for the Pacers in 48 games this season.\n\nHis foundation includes a social and criminal justice reform platform, a focus on clean water for Africa, and education.\n\nBrogdon's mother, Jann Adams, is the foundation's executive director.\n\n\"I've made a commitment, I've signed a contract with the Pacers, and that's something I'm always going to see through,\" Brogdon said. \"During the civil rights movement in the '60s, Dr. King and all these people that had different jobs, they didn't stop working to march, they did both, and I don't think it has to be an 'either or.' I think it can be an 'and,' so I've decided to do both. I think I can actually make more noise. I can have a bigger platform and a bigger voice while playing and while continuing my work here in the bubble.\""}, {"url": "https://link.springer.com/article/10.1007/s12115-021-00625-4", "page_content": "Thomas Kuhn said that scientific revolutions were rare events in the history of science, where the dominant paradigm of a discipline—that is, the “entire constellation of beliefs, values, techniques, and so on shared by the members of a given [scientific] community” (Kuhn 1962:175)—is replaced by a new paradigm.\n\nMore relevant to understanding the situation of contemporary sociology, however, is Kuhn’s discussion of what he calls pre-paradigmatic science (Kuhn 1962:17). If we alter Kuhn’s definition of a paradigm slightly to include any general framework in which theories are forumulated (rather than one shared by the entire community), this period before the emergence of a dominant paradigm can more accurately be called a multi-paradigmatic period (compare Black 1995; Ritzer 1975). That is, there are usually several paradigms—several different, competing strategies of explanation. That is the current state of sociology. In sociology there is no dominant paradigm; there are a number of competing strategies of explanation. One of these is conflict theory, and it is critical theory, one form of conflict theory, that informs so much present-day social justice activism.\n\nConflict theory “explains human behavior as a struggle for domination” (Black 2001). Additionally, conflict theory usually assumes four things: (1) that social life involves clashes of interest, (2) that clashes of interest involve zero-sum outcomes where one side’s gain is the other’s loss, (3) that dominant groups gain at the expense of others, and (4) that radical change is the only way to reduce the power of dominant groups (Black 2001).\n\nKarl Marx was the first to use this approach. For Marx the clashes of interest were between social classes, and class struggle drives historical change. In every society there has been a system of class relations, and social institutions benefit the dominant class and enable the exploitation of others. The clash between classes normally results in a new class system with a new dominant class, but Marx believed the overthrow of the current capitalist system, in which the bourgeoisie (the capitalists), who own the means of production, exploit the proletariat (the workers), who must work for wages, would put an end to class once and for all, and lead to a new kind of society. Marxists advocate revolution, and they analyze social relationships and institutions in capitalist societies in terms of how they benefit the bourgeoisie and exploit the proletariat.\n\nFor a Marxist studying capitalist societies, the task is not to determine whether or how much capitalists exploit workers. The approach treats exploitation as a constant to be assumed rather than as a variable to be explained. The task instead is to show how social arrangements lead to exploitation—even if those social arrangements might at first appear liberating. Thus, Marxists have argued that the idea of equality before the law actually furthers inequality. Agreements between capitalists and workers appear legitimate because they are treated as agreements between equals, even though the power dynamics mean workers are in no position to bargain. The idea of equality disguises inequality and exploitation.\n\nMarx offered a new way of understanding societies and of understanding historical change, but his predictions have failed. The clash between capitalists and workers did not lead to the failure of capitalism and to revolution. And in societies where communist parties gained power and abolished class, doing so did not lead to a new kind of society. Government did not wither away, as Marx predicted. Instead communist reformers established totalitarian governments that were among the most intrusive and violent governments in history (Rummel 1994). Abolishing class also did not put an end to conflict and exploitation. Political elites ruled over the masses in the new societies, and they often turned on one another as they pursued power. The economic systems established also failed, leading to famine and shortages of basic goods, and eventually governments led by communist parties collapsed or made reforms.\n\nThe orthodox Marxist may be unfazed by any of this. The idea may be that capitalism will still collapse; revolution is still coming. The revolutions in Russia, China, and elsewhere were not real communist revolutions and their governments were not real Marxist governments. Marxism has not failed; real Marxism has not been tried. But another tack for those sympathetic to Marxist analysis is to accept much of Marx’s framework while rejecting many of the specifics. This could mean accepting Marx’s class analysis while rejecting his hope for change, but more commonly, it means accepting the conflict framework while rejecting Marx’s emphasis on class alone as the source of oppression and the driver of historical change. For most of today’s conflict theorists, it is not just class, but also race, gender, sexuality, religion, disability status, immigration status, and much else that give some people power over others. Otherwise the analysis is similar. The idea again is that the oppression of disadvantaged groups is a constant to be assumed rather than a variable to be explained. Just as social institutions benefit capitalists at the expense of workers, they benefit whites at the expense of persons of color, men at the expense of women, heterosexuals at the expense of gays and lesbians, the cisgendered at the expense of the transgendered, Christians at the expense of Muslims, the able-bodied at the expense of the disabled, the native-born at the expense of immigrants, etc., in an interlocking system of domination. Sometimes called critical theory or intersectional theory, this type of conflict theory follows Marxism in calling for a radical reorganization of social institutions to put an end to oppression, but it is not enough just to deal with class, as Marxists would do. And it is not enough to deal with any other single source of oppression, whether gender, race, or something else. The goal is to put an end to the entire system of oppression.\n\nThe new conflict theorists also follow Marxists in analyzing interactions and institutions—including those that might at first appear innocuous or even liberating—as sources of oppression. Laws, prisons, and wars contribute to oppression, but so do cultural practices and even ordinary conversations. One idea is that members of oppressed groups frequently experience microaggressions, small slights that make their lives unpleasant and block them from success (Sue 2010). When a person of color goes to college and sees portraits honoring mostly white men who contributed to the university or achieved success in the past, this might be a microaggression. Or it might be a microaggression when whites in conversation ask Asians where they are from. These things contribute to people feeling marginalized, and they add up.\n\nThose who do not accept this framework may reject the idea of microaggression, particularly the idea that the intentions of the microaggressor do not matter. But what makes something a microaggression is that it furthers the oppression of those who are already disadvantaged, and it does not matter how well-intentioned someone is (Sue et al. 2007: 277–278).\n\nMicroaggression is just one of the concepts derived from critical theories that outsiders might unfamiliar and objectionable. Other new kinds of offenses include cultural appropriation (such as when members of dominant cultures the clothing styles or eat the foods associated with marginalized cultures), heteronormativity (when someone makes a statement that implies heterosexuality is normal), and white fragility (when whites are defensive over being confronted with their racism and privilege) (Ziff and Rao 1997; Warner 1991; DiAngelo 2018). Another concept that can be jarring to outsiders is the idea of white supremacy (Newkirk 2017). In more mainstream contexts white supremacy refers to things like Jim Crow laws that segregated whites and blacks and banned blacks from certain places, and white supremacists are Ku Klux Klansmen and others who favor such laws. But the new conflict theorists talk about mainstream institutions today as “white supremacist institutions,” and they speak of those who oppose revolutionary change as “white supremacists.” It is not that they believe these people are Klansmen or that the Klan or similar groups run mainstream institutions. It is that they see society’s institutions as protecting the advantages whites have over persons of color, and this is the sense in which those institutions and those who defend them contribute to white supremacy.\n\nBy now most people are familiar with at least some of these concepts. Increasingly they are not just the argot of critical theorists in academia; concepts like microaggression, cultural appropriation, and white supremacy have made their way into workshops at universities and corporations and into the mainstream media and in public debate. Usually they are presented in the context of efforts to pursue social justice, and both the advocates and opponents of these ideas tend to see them that way, with the advocates using the term positively and the opponents using it pejoratively (such as by referring to social justice activists as social justice warriors) (Ohlheiser 2015).\n\nThe result is that social justice often becomes synonymous with a particular theoretical approach and with particular remedies. Social justice activists draw heavily from critical theory, a type of conflict theory. But it is not just conflict theorists and those who adopt the conflict framework who are concerned with social justice, and there is no reason that theoretical perspectives other than conflict theory could not form the basis for other kinds of social justice activism."}, {"url": "https://link.springer.com/chapter/10.1007/978-3-030-03113-8_10", "page_content": "In this section, I discuss key terms, namely, social justice, health equity, and advocacy that are central to the objectives and learning outcomes of this chapter. Rather than providing a singular definition of each term, I endeavour to discuss and demonstrate the complexity of these terms as concepts that comprise multiple and evolving meanings. Appreciating the complexity of these terms is important in thinking through the similarly complex matter of professions’ and practitioners’ roles in advancing social justice and health equity through advocacy.\n\nSocial Justice and Health Equity\n\nSocial justice is a concept that evades a singular, unequivocal definition. As Sandretto et al. (2007) note, defining social justice is “a bit like trying to nail jello to the wall, a sticky and difficult task” (p. 308). The multiple facets, priorities, and approaches that may make something socially just, or that may ameliorate inequities that result from injustices, are highly contextual, contested, and sometimes contradictory. Understanding what social justice is, what it looks like, and how to achieve it, therefore, is best done by considering the multiplicity of its meaning and “our often taken-for-granted conceptualizations” of the term (Sandretto et al. 2007, p. 308).\n\nWith the need to understand the multiplicity of social justice in mind, I include the following definitions from authors writing from the perspective of various health and non-health professions, including nursing, social work, teacher education, archival science, and public health:\n\n…the fair distribution of society’s benefits , responsibilities, and their consequences… focuses on the relative position of one social group in relationship to others and on the root causes of disparities and what can be done to eliminate them. (Canadian Nurses Association 2010)\n\n…full participation in society and the balancing of benefits and burdens by all citizens, resulting in equitable living and a just ordering of society. (Buettner-Schmidt and Lobo 2012)\n\n…fostering social justice does not simply mean exploring difference or diversity. Rather it uncovers and addresses systems of power and privilege that give rise to social inequality…to critically examine oppression on institutional, cultural, and individual levels. (Duckworth and Maxwell 2015)\n\n…full human recognition (disruption of structures of non-recognition; disrespect or marginalization; safety), fair and just redistribution (of power; of benefits and burdens; resources, goods and services; wealth; opportunity), full and equal participation (in political processes and decision-making; education; employment; community facilities; collective over individual rights; common good), acknowledgement and remedy historical inequalities with specific measures (affirmative action; reparations; recognition). (Duff et al. 2013, p. 324)\n\n…refers to the concept of a society that gives individuals and groups fair treatment and an equitable share of the benefits of society. In this context, social justice is based on the concepts of human rights and equity . Under social justice, all groups and individuals are entitled equally to important rights such as health protection and minimal standards of income. The goal of public health—to minimize preventable death and disability for all—is integral to social justice. (Public Health Agency of Canada 2017)\n\n“economic, social, and political equity among individuals, groups and institutions…[and] a necessity of peace. (Van Soest 1992)\n\nThe definition of social justice inevitably involves a vision of a socially just society in which, among other elements, the basic needs of all individuals are met (e.g., material, social-psychological, productive-creative, security, self-actualization and spiritual), essential institutions are held in public trust and administered for the good of all in society, work and production reengineered such that individuals are able to integrate their mental, physical and emotional faculties in their work experience, equality of social, civil, cultural and political rights, responsibilities and opportunities exist, and work and products are in harmony with nature. (Birkenmaier 2003)\n\nThe lack of definitive definition of social justice may be thought to leave the goals or purpose of social justice advocacy, and therefore dietitians’ roles as social justice advocates, ill-defined, directionless, or, worse, immobilized. However, the lack of a concrete definition may also be understood as not only necessary but fruitful. In their work on the politics of local food, DuPuis et al. (2011) devise a notion of “reflexive justice ”, which they explain is “…a process by which people pursue goals while acknowledging the imperfection of their actions” (p. 297). The authors continue by noting that the process for achieving justice itself is imperfect: “It is also not a particular, fixed, process, but one that responds to changing circumstances, imperfectly, but with an awareness of the contradictions of the moment” (DuPuis et al. 2011, p. 297). For Dupuis, Harrison, and Goodman, the notion of reflexive justice recognizes and works with the complexities and contradictions of social justice in relation to food, eating, and nutrition. For example, the authors describe the tensions between the politics of supporting local food (i.e. campaigns to buy locally grown and produced food that support community-based small business and farmers) and the local inequities related to how that food may be grown (i.e. absent or weak regulation of migrant farm labour and racialized labourers’ consequent pesticide exposure). Similarly, Sandretto et al. (2007) note that although democratic decision-making is important, this also must be balanced with measures that avoid fuelling “the tyranny of the majority” that may silence the needs of marginalized groups most affected by an issue but that are fewer in number (p. 316).\n\nWhat does social justice mean for health and within health professional practice? For some, social justice vis a vis health means simply ensuring “the fair and equal access of all to basic healthcare services and equitable care” (Dharamsi and MacEntee 2002, p. 323). Yet, looking to health care as the means of levelling out health disparities only makes sense if, as Peter (2001) writes, “health care is perceived to be the instrument that is best suited to correct health outcomes” (p. 160). Instead, Peter (2001) and Braveman (2006) argue that increasing access to health care does little to address the myriad social and structural determinants of health, such as income inequity, racism, sexism, colonialism, and so on, that have a greater influence on health than either health care or individual health behaviour (Mikkonen and Raphael 2010). In other words, equitable access to health care is only one necessary precondition for social justice with respect to health, but is not in itself able to ameliorate the underlying causes of the systematically poorer health outcomes experienced by marginalized populations.\n\nHow, then, do we conceptualize the pursuit of social justice with respect to health? One answer is health equityFootnote 1 (Braveman 2006; Peter 2001). Whitehead (1992) penned one of the most often cited definitions of health equity: “Equity in health implies that ideally everyone should have a fair opportunity to attain their full health potential and, more pragmatically, that no one should be disadvantaged from achieving this potential, if it can be avoided” (p. 433). Whitehead (1992) further explains:\n\nBased on this definition, the aim of policy for equity and health is not to eliminate all health differences so that everyone has the same level and quality of health, but rather to reduce or eliminate those which result from factors that are considered to be both avoidable and unfair. Equity is therefore concerned with creating equal opportunities for health, and with bringing health differentials down to the lowest possible level. (p. 434)\n\nConversely, Whitehead (1992) defines health inequities as “differences in health that are not only unnecessary and avoidable but, in addition, are considered unfair and unjust” (p. 433).\n\nThat is, health inequities are not simply a matter of differences in health outcomes, but are caused by avoidable, yet systemic socio-economic disparities that result in poorer health for marginalized populations (Peter 2001).\n\nDietetics and Social Justice Advocacy\n\nThis discussion of social justice and health equity raises further questions about the roles that dietitians might play in ameliorating health inequities. Do dietitians have a role to play in advancing health equity beyond the provision of health services, to acting for structural, systemic change through advocacy? One response to this question may be derived via an emerging framework for health professional education and practice known as “structural competence” (Hansen et al. 2017; Kirmayer et al. 2018; Metzl and Hansen 2014). The notion of structural competence has been developed as a framework for the types of knowledge- and skill-related experiences and abilities that health professionals require to address the underlying causes of health inequities. In contrast to the more commonly used framework of “cultural competence”, structural competence calls on professions to address what has been described as the “structural determinants of health” (World Health Organization 2010). Addressing equity in mental health and psychiatry professional practice, Metzl and Hansen (2014) explain:\n\nWhile cultural competency initiatives train [psychiatry] residents in beliefs and behaviors of patient groups that experience health inequalities, cultural competency often falls short of systemic intervention… The term structural brings into focus institutions and policies that can be altered to promote health equity, while competency signals that there are tangible skills clinicians should acquire to address the social structure factors that act as barriers to improved mental health outcomes. (p. E1)\n\nTranslating the knowledge and skills related to structural competence requires that health professionals, including dietitians, engage in advocacy to change policy and engage in action to confront and eliminate social injustices.\n\nAlthough there are some important textsFootnote 2 that address dietitians’ roles in redressing the social and structural inequities through advocacy, this pool of literature is small in comparison to that which focuses on nutrition science and individual behaviour change and that within the literatures of other health professions. Hence, several questions remain: What gaps exist in our knowledge, skills, and/or confidence that may prevent us from advocating for change? How, as a profession, might we remedy these potential gaps? What are our current strengths and capacities? How can we respectfully engage with those most impacted by social injustices to learn, listen, and work together for change? The case studies present in the next section shed some light on these questions and point to potential ways forward for dietetics in embracing a role as advocates for social justice and health equity."}, {"url": "https://educationonline.ku.edu/community/15-ways-to-advance-social-justice", "page_content": "There are moments in world history when social justice issues come to the forefront of global consciousness. This is such a time. The coronavirus pandemic has uncovered and exacerbated social inequities, especially in the United States.1 Closely related, due to its social justice component, is the expansion of Black Lives Matter into a worldwide movement. The protest sparked by the killing of George Floyd and police brutality2 grew into demonstrations against larger issues of racial inequality and systemic racism. Social justice plays a role in nearly every critical problem that we face, from the climate emergency3 and voter suppression4 to gun violence5 and the widening income gap.\n\nSociety’s collective lens is now sharply focused on the disparity of experience among different social groups. People are energized regarding crucial issues—LGBTQ legal protections, abuse of women, the rights of immigrants and indigenous peoples, racial discrimination and more. Today’s educators have a unique opportunity to advocate for their students and communities, and to demand substantive change.\n\nHere are 15 ways that you can advance social justice, individually and through alignment with like-minded people in your community and throughout the world.\n\nExamine your beliefs and habits.\n\nMany of us hold onto beliefs that we learned as children, and they can influence how we engage in social justice. Positive action toward inclusion and advocacy begins at home. Becoming a strong ally in a social justice movement requires ongoing self-reflection, learning, and openness to growth.\n\nEducate yourself about social justice issues.\n\nNavigating how to get involved can be overwhelming. The best way to start is to familiarize yourself with social justice issues you’re passionate about and research what is being done about them. Whether it’s hunger and food insecurity, gun violence, voting rights, or another issue, you’ll gain a better understanding of an issue’s current state by learning about its history.\n\nDiscover your local organizations.\n\nMany advocacy groups for social justice, such as the American Civil Liberties Union (ACLU) , have local chapters. To build connections and get involved, seek out organizers and activist groups in your community. Meetup is a good place to locate groups near you: it’s a powerful online platform where people can find and build specialized interest groups based on their locations.\n\nTake positive action in your own community.\n\nYou can learn about issues within your community by watching local news broadcasts, reading the newspaper, and listening to podcasts. Write letters and call your elected city and state officials regarding the issues your community faces. Find your elected officials’ contact information here .\n\nHarness the power of social media.\n\nTwitter, Facebook, and other social media platforms have become powerful tools for sharing messages with large audiences without leaving home. They provide resourceful ways to stay focused and organized around important causes. From joining groups to posting articles and sharing personal experiences, they can help facilitate community building, awareness, and collaboration.\n\nAttend demonstrations and protests.\n\nThe pandemic hasn’t put a damper on large, in-person protests, but we all must take precautions to prevent spreading the virus further. Make your voice heard at social justice protests happening in virtually every major U.S. city. These events give you the chance to hone your activism and public speaking skills, which you’ll need to become a social justice leader who motivates others. If you decide to attend a demonstration, always maintain safety precautions: wear a mask at all times and keep your distance from other people.\n\nVolunteer.\n\nVolunteering can take many forms, depending upon your availability. These websites, among others, can help you find volunteer opportunities that align with your interests.6\n\nIdealist - Browse by area of focus, language, and time availability.\n\n- Browse by area of focus, language, and time availability. GozAround - Search by category and find matches for your abilities and schedule.\n\n- Search by category and find matches for your abilities and schedule. VolunteerMatch - Search for local and virtual volunteer work by topic and by organization names.\n\nDonate.\n\nEvery cause-oriented organization will appreciate financial support. Use sites like Charity Navigator , a resource that independently rates organizations based on their financial health, accountability, and transparency to find projects that fight for issues you’re passionate about.\n\nGet involved with politics through civic engagement.\n\nAlign yourself with candidates—in local, state, and congressional elections—whose platforms and policies will further the causes you believe in. Learning about their stances on social justice issues is an opportunity to push for equity. Consider volunteering at a phone bank, canvassing to raise awareness, or sharing on online platforms.\n\nMake your voice heard on local radio\n\nMany local talk radio programs ask for listeners to call in and offer their opinions on topical news stories, including social justice issues. This is a great way to join the conversation and share your thoughts with a wide audience. RadioLocator will help you find U.S. radio stations with talk-radio format in your area.\n\nInvestigate what’s happening at local colleges or universities.\n\nStudent-run organizations may already focus on issues that you value. Learn what they’re doing and get involved. You’ll be setting an excellent example for your students and colleagues.\n\nInvest responsibly.\n\nThere are now mutual funds that focus on gender diversity, global equality, and other social justice issues.7 Investopedia publishes a list of the best-performing funds that focus on companies with sustainable environmental, social, and governance practices.\n\nSupport minority-owned businesses in your community and online.\n\nAs a consumer, you have the power to affect social justice change with every dollar you spend. In light of the recent Black Lives Matter protests, many businesses have vowed to give more visibility to Black-owned companies nationwide.8 Support local businesses that advocate for change and pay close attention to smaller, minority-owned companies.\n\nSupport artists, writers, and activists who speak out against injustices.\n\nAre your favorite musicians, authors, and other artists dedicated to social justice? By sharing their work on social platforms, you can help them gain the recognition they deserve.\n\nBe kind, understanding, and compassionate.\n\nThese are trying times. In dealing with our own issues, we may forget that we’re all in this together. Whenever you feel stressed out around other people, consider their circumstances and what they may be dealing with. Social justice, like charity, begins at home.\n\nPrepare to meet today’s demands at the University of Kansas.\n\nThe University of Kansas School of Education and Human Sciences is uniquely qualified to help you meet the demands of our rapidly changing, increasingly complex world. Take on challenging topics, from the classroom to the global level, in the online Curriculum and Teaching programs. Learn techniques, resources, and real-world applications for supporting students with disabilities in our Special Education programs. Enhance your leadership and academic expertise in the Educational Leadership and Policy Studies program, as you learn to support a more diverse student population while integrating new technologies.\n\nSources\n\n1. Retrieved on July 1, 2020 from abcnews.go.com/Business/extreme-inequality-preexisting-condition-covid-19-widened-americas/story?\n\n2. Retrieved on July 1, 2020 from aljazeera.com/news/2020/06/timeline-george-floyd-protests-200610194807385.html\n\n3. Retrieved on July 1, 2020 from ecowatch.com/environment-social-justice-2646167147.html?rebelltitem=1#rebelltitem1\n\n4. Retrieved on July 1, 2020 from brennancenter.org/issues/ensure-every-american-can-vote/vote-suppression\n\n5. Retrieved on July 1, 2020 from amnesty.org/en/what-we-do/arms-control/gun-violence/\n\n6. Retrieved on July 1, 2020 from mashable.com/2014/12/10/volunteer-work-online/\n\n7. Retrieved on July 1, 2020 from money.usnews.com/investing/slideshows/7-of-the-best-socially-responsible-funds\n\n8. Retrieved on July 1, 2020 from refinery29.com/en-us/2020/06/9849096/find-black-owned-businesses-online-apps"}, {"url": "https://www.apc.org/en/advocacy-strategies-and-approaches-overview", "page_content": "Author: Steve Buckley\n\n1. Introduction\n\nAdvocacy is the active support of an idea or cause expressed through strategies and methods that influence the opinions and decisions of people and organisations.\n\nIn the social and economic development context the aims of advocacy are to create or change policies, laws, regulations, distribution of resources or other decisions that affect people’s lives and to ensure that such decisions lead to implementation.[1] Such advocacy is generally directed at policy makers including politicians, government officials and public servants, but also private sector leaders whose decisions impact upon peoples lives, as well as those whose opinions and actions influence policy makers, such as journalists and the media, development agencies and large NGOs.\n\nBy “pro-poor advocacy” we mean advocacy for political decisions and actions that respond to the interests of people who directly face poverty and disadvantage. For those pursuing the goal of equitable and pro-poor ICT access, advocacy as a means to bring about change can be appropriate in a range of circumstances, including:\n\n(a) Where ICT policies could have the effect of reinforcing poverty and discrimination. For example, “e-government” projects that use the internet to improve access to public services may, for those without internet access, have the reverse effect, unless they are complemented by other measures to enable universal access to the internet.\n\n(b) When appropriate ICT policy change could be expected to improve poor people’s lives and livelihoods. For example, the adoption of broadcasting policies that enable community-based organisations to establish their own radio or television services.\n\n(c) As part of a wider programme of support for pro-poor ICT access. For example, the impact and effectiveness of investment in public ICT access centres may be improved by advocacy efforts to adopt and mainstream good practice such as community participation in management or use of free and open source software.\n\nThere is much that has been written on advocacy and how to gain influence. Some of the basic tenets of the art of persuasion, found in political science and communication studies, appear also in early Greek and Chinese philosophy.[2] It is widely recognised, for example, that change comes rarely from force of logical argument alone or from the presentation of irrefutable evidence in support of the changes required. The latter is most starkly demonstrated by the slow response to climate change warnings. Much depends on the character, approach and credibility of those seeking change and the receptiveness of those they are seeking to persuade. Advocacy is inherently political and an understanding of political dynamics is at the heart of effective advocacy.\n\nEven the most clear-minded advocacy for pro-poor ICT policies can meet resistance for various reasons, including lack of political will, bureaucratic inertia, and counter arguments from well-resourced interest groups pursuing their own advocacy efforts. Effective advocacy therefore requires research to map out the policy terrain, the principal actors, the political relations and the interests at stake. In the ICT policy field this terrain typically will include government departments, communications regulators, telecommunications service providers, media organisations, sector associations and growing numbers of civil society interest groups. Careful planning and a strategic approach are therefore needed if results are to be achieved.\n\nPolicy change rarely happens overnight and is often linked to broader change in the political environment. Effective advocacy requires long-term as well as short-term thinking, an understanding of the points of resistance and the means to gain traction, the readiness to form alliances, and the flexibility to seize windows of opportunity.\n\nThis overview describes some of the more commonly used advocacy techniques, from critical engagement such as policy monitoring and policy dialogue, through organised campaigns for policy change, to pathfinder and demonstrator projects that can inform and influence future policy making. It highlights the importance for people facing disadvantage to be able to assert their own needs and interests. It explains step by step how to devise an effective advocacy strategy for ICT policy reform. It is accompanied by case examples and signposting to further tools and resources.\n\n2. Techniques for effective advocacy\n\nPolicy monitoring and public accountability\n\nAlmost all effective policy-related advocacy efforts commence with observation and monitoring of the implementation and effectiveness of policies already in place. These might include, for example, commitments to ICT infrastructure roll-out, universal access policies, support for community-based ICT access centres, public interest broadcasting policies, or regulatory mechanisms to ensure fair pricing of services.\n\nHigh profile ICT policy monitoring by civil society advocacy groups can, on its own, contribute to improved policy implementation and effectiveness by highlighting public policy targets and drawing public attention to under performance or to policy failure. Governments and public bodies, especially in democratic societies, are sensitive to critical reports, and more so when these are based on robust evidence and analysis, come from a credible source, and are widely published and disseminated.\n\nPolicy monitoring by civil society groups may be in the form of one-off investigation into a particular area of interest; it may consist of a baseline study, perhaps at the commencement of a new policy, and a follow-up study later to establish what results were achieved; or it may be a periodic monitoring report, such as an annual review.\n\nPolicy monitoring and public accountability are made easier where government departments and other public bodies, including regulatory organisations, maintain and publish data and reports in a timely fashion and undertake research and consultation to facilitate decision making in the public interest. Where this is not the case, where the information is poor or unreliable, or where independent data is needed, civil society organisations and coalitions may organise their own research and data gathering, or they may rely on third party sources such as commercial and academic research.\n\nRight to information laws can help and, in countries where such laws are weak or absent, their adoption or improvement has itself been a key demand of civil society organisations, not only those working in the communication policy field. In some cases investigative journalism may be needed to root out and expose policy failings.\n\nImpact may often be enhanced by involving citizens and civil society organisations in the process of policy monitoring and review and by gathering demand-side data using techniques such as citizen surveys, social audits and participatory policy review. Such social accountability mechanisms[3] have gained increasing recognition as effective means of strengthening civic engagement in policy making and policy monitoring.\n\nPolicy dialogue – ICT and mainstream development policy\n\nPolicy monitoring alone may prompt corrections to policy failure or lead to improved policy implementation, but most civil society groups concerned with ICT policy also carry their own ideas about what policies are desirable. They are interested in gaining influence earlier in the policy-making process. At its most straightforward this involves engagement in policy dialogue with bureaucrats and politicians.\n\nThe Women of Uganda Network (WOUGNET),[4] for example, has a core programme activity on “gender and ICT policy advocacy” with a focus on equitable access to ICTs and engendering ICT policy making. Their priorities include not only a focus on existing ICT policies such as the Rural Communications Development Fund (a levy applied to telecom providers to support areas that are underserved by markets) but also engaging in policy development processes such as the review of the National ICT Policy. WOUGNET participates actively in government-organised stakeholder consultations on ICT policy, it contributes its own studies and reports, and it responds to draft policy proposals.\n\nCivil society organisations like WOUGNET, whose field of interest is in the development of the use of ICTs, tend to focus their policy dialogue efforts on areas of policy making that are explicitly and primarily concerned with ICT policy: universal access arrangements, national e-strategies, etc. This may seem an obvious strategy but, on its own, it can also have the drawback of limiting policy dialogue to a relatively narrow range of actors – especially those who already share a similar outlook or others perhaps more interested in ICT growth than in pro-poor development.\n\nStrategic engagement in policy dialogue on pro-poor ICT access can also be gained by taking, as a primary focus, areas of mainstream development policy – education, health, rural livelihoods, and so on – and contributing to more strategically framed development policy making such as the preparation of National Development Strategies.[5] This perspective can assist in gaining traction for a pro-poor ICT access agenda across a broader political and policy-making spectrum. It can also assist better understanding of the real world policy choices that politicians and their constituents face – cleaner water or faster connectivity, more clinics or more ICT access centres – and better articulation of the role of ICTs in poverty reduction.\n\nFor effective pro-poor ICT policy dialogue, engagement on both fronts may be the most productive strategy: ensuring that ICT policy making is informed by a pro-poor perspective and strengthening that position by building support across government, especially those most engaged with poverty reduction and pro-poor development.\n\nCampaigns for policy change\n\nIn India, in 1996, the National Campaign for People’s Right to Information (NCPRI)[6] was founded by social activists, journalists, lawyers, professionals, retired civil servants and academics. Its goal was to campaign for a national law facilitating the right to information. Its first step was to produce, with the Press Council of India, a draft right to information law. After years of public debate and the passage in several Indian states of right to information laws, the government of India passed the Freedom of Information Act 2002. The Act was weakly drafted, subject to widespread criticism and never brought into force.[7] Continued campaigning and a change of government led eventually to adoption of the Right to Information Act 2005.\n\nCivil society campaigns for policy change rarely achieve rapid results. They require patience, tenacity, courage and conviction. There is no blueprint for success, but there are some common denominators to almost all successful advocacy campaigns.[8] It is essential, for instance, to maintain clarity in communications: goals should be clear and achievable; messages should be compelling for those to whom they are intended; calls to action should be specific and concise. Good planning and organisation must combine with the ability to mobilise broad coalitions of public and political support towards a common goal.\n\nPolicy campaigning is goal-oriented advocacy in which civil society groups and coalitions aim to set the policy agenda rather than simply to monitor or respond to government policy making. It involves taking action and initiative. It can be exciting and empowering for those involved, but it can also be hard work, frustrating, and ultimately unsuccessful.\n\nBefore adopting a campaigning orientation it is worth asking whether the goals could be better achieved by dialogue or quiet negotiation.\n\nCampaigns for policy change draw on a wide range of tools and tactics, including public demonstrations, protests, letter writing, lobbying, use of media and the internet, and legal action. Campaigning is often confrontational in nature. After all, a campaign would not be needed if the government or private company was receptive to the policies being advocated. Conversely, it is often the dynamic of conflict that gives a campaign momentum, spurring media attention and recruiting public support.\n\nCampaigns are often built in response to particular opportunities or threats arising in the context of the process of policy change. For example, the transition from analogue to digital distribution systems for television is moving ahead rapidly worldwide, with only limited time for civil society organisations to gain guarantees of access to the new channels. In Uruguay, a law first drafted in 2005 by a coalition including community broadcasting activists, journalists and labour unions was adopted in 2007, guaranteeing an equitable distribution of frequencies between private, public and civil society organisations. The law has ensured that civil society groups have a legal entitlement to use part of the digital television spectrum.\n\nIn Ecuador, the process of adopting a new constitution that began in 2007 under the presidency of Rafael Correa was seen as an opportunity by civil society groups engaged in media and ICT advocacy to challenge the existing political economy of the communications environment and to propose a new communication rights framework. The new constitution adopted in 2008 included the explicit entitlement of all persons to universal access to information and communication technologies, together with a right to the creation of social media, including equal access to radio frequencies.[9]\n\nSome civil society advocacy organisations may have several campaigns running at the same time, each with distinct goals requiring different alliances and strategies. In other cases a single-issue organisation, or a coalition of like minded groups, may form to campaign towards a single policy goal, as in the example of India’s campaign for a right to information law. International campaigning organisations, such as Amnesty International and Greenpeace, have tested their campaigning methods over many years. Some of the lessons learned are also relevant to ICT policy advocacy.[10]\n\nBuilding the advocacy capacity of stakeholder groups\n\nAs noted in the introduction to this toolkit, poor people face systemic barriers in their access to information and in their means to exercise their right to freedom of expression. The lack of “voice” of disadvantaged groups is a challenge at the core of pro-poor advocacy on ICT access.[11] It is one of the reasons why advocacy for equitable access to ICTs is important. At the same time, it compromises the ability of disadvantaged people themselves to advocate for their own communication needs.\n\nThis is a critical issue that demands the attention of any organisation engaged in pro-poor ICT advocacy. We stated earlier that “pro-poor advocacy” means advocacy for political decisions and actions that respond to the interests of people who directly face poverty and disadvantage. They are the primary stakeholders. Their lack of voice can be overcome in two distinct ways. As Drèze and Sen describe it: “One is assertion (or, more precisely, self-assertion) of the underprivileged through political organisation. The other is solidarity with the underprivileged on the part of other members of the society, whose interests and commitments are broadly linked, and who are often better placed to advance the cause of the disadvantaged by virtue of their own privileges (e.g., formal education, access to the media, economic resources, political connections).”[12]\n\nThere are a great number of “pro-poor advocacy” organisations that are not, by any means, populated by people with first-hand experience of poverty. Rather they are run by well-educated middle-class professionals for whom pro-poor advocacy is a vocation. This is as much a reality in the ICT policy field as in other development sectors. That such people have chosen to work for and in solidarity with those who face the daily struggle of poverty and deprivation is, of course, to be welcomed – social solidarity is very often an important component of advocacy and political action – but, on its own, it is also “a somewhat undependable basis of authentic representation of the interests of the underprivileged.”[13] Solidarity has multiple motivations, is not always accompanied by shared perspectives, and may be more effective at attracting support when it conforms with dominant ideologies.\n\nThus building the advocacy capacity of self-help groups of the disadvantaged and of community-based and working-class organisations is at least as important as doing advocacy for the poor. Effective pro-poor advocacy on access to ICTs must include strategies likely to lead to an increase in the voice and influence of the underprivileged sections of society in ICT and other policy making. This may include, for example, strengthening the communications capacity of disadvantaged people’s organisations and support for development of grassroots communication initiatives like community radio. Such strategies can be effective in enabling people who are disadvantaged and marginalised to speak out directly on the issues that affect their lives and livelihoods.\n\nThe Bangladesh NGOs Network for Radio and Communication (BNNRC),[14] for example, is a national network that combines a programme of advocacy in ICT policy areas such as right to information, community broadcasting and e-governance, with practical support for rural knowledge centres and community radio stations.\n\nDeccan Development Society (DDS)[15] is a grassroots organisation working with women's sanghams (self-help groups) in about 75 villages in the Medak District of Andhra Pradesh, India. The 5,000 women members of the Society are mostly Dalit, the lowest group in the Indian social hierarchy. As part of a broader strategy in pursuit of “autonomous communities”, the women of DDS established the DDS Community Media Trust, including a video production unit and Sangham Radio, the first rural community radio in India and the first women’s radio in South Asia.[16]\n\nThe right-to-information movement in India drew, among other inspirations, on empowerment-based approaches to public accountability pioneered by Mazdoor Kisan Shakti Sangathan (MKSS) in Rajasthan, including public hearings where accounts, including public expenditure records, were read aloud at independently organised village meetings and local people were invited to give testimony.[17]\n\nPathfinder and demonstrator projects\n\nNew ideas in policy are not always easy to communicate to those who influence or make decisions, particularly where they involve new or unfamiliar uses of ICTs. It may not be until an idea has been demonstrated in action that it is fully understood.\n\n“Pathfinder” or “demonstrator” projects can therefore be an effective alternative strategy for ICT policy advocacy. If success can be demonstrated in practice, it can have the dual impact of mobilising further demand and interest and of motivating policy makers to take decisions that encourage replication and scaling-up. Such initiatives can be resource intensive. They may require certain policy decisions before they can proceed, but policy makers may also be more receptive to allowing a limited experiment to test and demonstrate an idea than to agreeing a major policy change.\n\nRITS (Rede de Informacão para o Terceiro Setor)[18] was founded in Brazil in 1997 to strengthen civil society organisations’ communications capacity. The organisation has built an impressive network for monitoring ICT policy and campaigning on equitable access. A demonstrator project organised by RITS in partnership with Sampa.org led to the establishment of 128 community-based telecentres in São Paulo, with an estimated half a million users per month. The model offers free public access and training support, is based on free and open source software, and promotes community involvement in management and development of the centres as a space for community organisation. With support from Petrobras, it has been replicated in 50 locations across Brazil. The Brazilian government is now considering investment in 10,000 new telecentres drawing substantially on the experience of the RITS demonstration.\n\nThe Nigeria Community Radio Coalition, launched in 2003, has mobilised broad support for its campaign goal of seeing community radio services established in Nigeria. As part of its strategy for opening the door to community radio development, it has proposed a pilot scheme in at least six locations to be distributed across the country’s geopolitical zones. The proposal for a pilot scheme has been supported by the National Broadcasting Commission and by the National Fadama Development Programme, which has committed funding for preparation and infrastructure.\n\n3. Advocacy planning and implementation\n\nIn this part we look at the practical steps involved in ICT advocacy planning and implementation. The stages outlined draw on principles of strategic planning and project management combined with political analysis and communications.[19] For each of the stages we set out some key considerations to be addressed. At several points we pose questions rather than solutions. There is no single template for pro-poor ICT advocacy. The questions are intended to assist the process of planning and design.\n\nA. Preliminary steps\n\n(i)Identifying the problems and the policy issues\n\nWhat is the pro-poor ICT access issue to be addressed? Why is it important and to whom? This may have been highlighted through research, expressed as a demand by grassroots organisations, or it may have a normative basis, for example, it has been identified by comparison with good practice elsewhere. Does this problem have a policy dimension? What current policies reinforce the problem? What changes in policies could lead to improvement? Who is responsible for those policies?\n\n(ii)Defining the advocacy goal\n\nIt can be helpful, at the preliminary stage, to define the goal of the proposed advocacy initiative. What positive change can be expected to result if the initiative is successful? Is the initiative intended to improve access to information, to promote dialogue, or to strengthen voice and influence? Or will it contribute to all of these things? Or to broader development goals? Who will be the primary beneficiaries of the initiative?\n\n(iii)Consulting and building relationships\n\nBuilding relationships is intrinsic to any successful advocacy effort and should also commence at an early stage. Before engaging in detailed policy analysis and planning it can be important to consult with other organisations, especially those which share similar goals and interests. Has any similar initiative been tried before? If so, what were the results? Is anything similar being considered or planned? Are there opportunities to build a partnership-based approach from the outset?\n\n(iv)Establishing credibility as an advocate\n\nThe credibility of the organisation, partnership or coalition that is advocating change is likely to be a key factor in its success. Does it have a mandate to speak on behalf of those who are expected to benefit? Does it have specialist expertise? Does it have influence with decision makers? What could be done to strengthen the credibility of the initiative – for example, further research and consultation, better alliances?\n\nB. Analysing the policy environment\n\n(i)Identifying relevant policies, laws and regulations\n\nHaving decided, in principle, to consider advocacy as a strategy to achieve pro-poor ICT access and having undertaken some preliminary work to define the advocacy goals, the next stage involves closer analysis of the policy environment, starting with an audit of the relevant policies and political institutions. What policies are already in place (for example, national e-strategies, e-government, media development, digital divide initiatives)? How are these reflected, or not, in current laws and regulations? It is important also to be aware of relevant international treaty obligations, laws and standards.\n\n(ii)Mapping relations of power and decision making\n\nWhere are policy decisions taken and who has influence over them? For example, is the focus on government policy and, if so, which ministries and departments are responsible? What other ministries have an interest in the impact of the current or proposed policies, for example, rural development, education? Are there other public bodies with relevant influence or responsibility, such as a communications regulator or a national media council? What about the legislature or parliament – are there interest groups in the policy area? Can support be usefully mobilised across different political parties? Who else has influence over the key political decision makers?\n\n(iii)Considering the options for policy change\n\nWould a change in policy alone be sufficient to achieve the advocacy goal? Or might the proposed policy change also require legal and/or regulatory change? What about the economic impact – are there taxation or public spending implications that should be taken into account? Are there alternative approaches to be considered? Could the goals be achieved incrementally or do they require a fundamental change in policy? What policy options are most likely to attract support, or generate opposition?\n\nC. Developing the strategy\n\n(i)Focusing on the goal and objectives\n\nIn developing the strategy, and in the light of more systematic analysis of the policy environment, it is advisable to return to the advocacy goal and to set specific and realistic objectives that can be achieved within a reasonable, defined timeframe. It should be possible at the end of such a period to say whether or not they were achieved. If the goal is ambitious it may be necessary to set more limited and incremental objectives – for example, raised awareness, commitments of support, pilot projects – that can contribute to achieving the goal over a longer timeframe.\n\n(ii)Identifying the target audiences\n\nIt is useful to distinguish between primary and secondary audiences. The primary target audiences are the institutions, and the individuals within them, who have authority to make the policy decisions that are sought. These are generally determined by the policy goal and objectives. The secondary audiences are those who are best placed to influence the decision makers. These may include politicians, public servants, the media, development agencies, influential NGOs and so on.\n\n(iii)Identifying allies and opponents\n\nIt is important to identify both the potential allies and the likely opponents. What other organisations share similar goals and concerns? Would they support the initiative, be open to partnership or to joining a broader coalition? Are there already coalitions in place? What risks might there be in alliance or coalition building? What groups or organisations might feel threatened by the proposals? Could this coalesce into organised opposition? What can be done to reduce the risk of opposition?\n\n(iv)Selecting the advocacy approach\n\nWhat advocacy strategies are most likely to influence the target audiences? Will it be effective to work through dialogue and negotiation with policy makers? What is the likely impact of public pressure – can it be expected to lead to a positive response or to resistance? What sort of treatment can be expected from the media: supportive, hostile, or indifferent? Are there incremental strategies that might be more likely to achieve results? Through what mechanisms might competing interests be brokered?\n\n(v)Identifying the key messages\n\nIn relation to the goal and objectives, what messages are likely to be persuasive with the primary audience? What about the secondary audience – are different messages needed for different audiences? If the approach taken is public or based on a broad coalition, what key messages are likely to mobilise the broadest support, gain traction in the media, or have a viral effect, with the audience itself acting as a multiplier?\n\nD. Framing the plan\n\n(i)Preparing a plan of action\n\nEffective advocacy requires good organisational planning. Having defined the goal, objectives and strategic approach, it is important to be systematic in mapping out the actions to be taken to achieve results, including timelines and milestones. This is best brought together in a logical framework including measurable progress indicators.\n\n(ii)Budgeting and identifying resources\n\nCost considerations are likely to influence the approach to be taken. Policy monitoring and dialogue, for example, may be achieved with just limited staff or volunteer time and the means to publicise the results. A media-oriented advocacy campaign might require substantial publicity costs from the outset: preparing news releases and placing stories, commissioning photographs or a video, designing posters and other campaign materials. A capacity-building project or a demonstrator project might require significant investment in equipment and training. Organisations working in ICT policy advocacy will frequently have the skills and know-how to harness new ICTs in their advocacy work – for example, using email, text messaging and Web 2.0 technologies to assist with data gathering, coalition building and mobilisation. Funds and other resources will need to be sufficient to sustain the project for its duration.\n\n(iii)Risk assessment\n\nWhat are the main risks to successful project implementation? Risk analysis involves assessing the impact of each particular risk and the likelihood of it happening. It is useful to rate both impact and likelihood (e.g., low, medium, high). How can the high and medium risks be managed to reduce their impact and/or likelihood? Particular attention needs to be paid to any risk of harm to individuals. In many countries, media workers, internet activists and freedom of expression defenders have faced threats, harassment and violence in the course of their work. Might the planned advocacy provoke state repression? Are there non-state actors that pose physical dangers?\n\nE. Implementation\n\n(i)Getting the message across\n\nGood communications is at the core of effective advocacy. This requires attention to the message, the audience and the means of delivery. The message needs to be clear: it should explain what is being proposed, why it is needed, and what difference it would make. It also needs to be compelling: it should be crafted to the interests and knowledge of the audience. The means of delivery must ensure it is received and heard – whether, for example, a written proposal, face-to-face presentation or public demonstration. It is rare that a single advocacy message will be received and acted upon. The message needs to reinforced, by repetition and through the influence of secondary audiences.\n\n(ii)Using the media\n\nThe media – radio, television, press and online media – have a particular role to play in public advocacy initiatives, especially campaign-based approaches. Not all advocacy work uses the media, and a media-based approach carries risks as well as opportunities. The media can bring a mass audience, potentially increasing profile and credibility, but they can also bring bad publicity and may contribute to mobilising opposition as well as support. Using the media requires planning and skills, including building contacts, knowing the media audience, writing press releases, placing stories, being interviewed, providing visual imagery and organising newsworthy events.\n\n(iii)Building partnerships and coalitions\n\nMost advocacy initiatives involve some degree of mobilising public support behind the proposal. What partnerships and alliances are most likely to assist in mobilising broad-based support? What processes can best achieve trust, collective ownership, and effective collaboration? Should the initiative operate as an open coalition and, if so, what mechanisms are needed to enable participation and to assure accountability? Is support needed to build the advocacy capacity of partner organisations? Media and the internet can also be used to recruit and mobilise broad-based public support.\n\n(iv)Employing tactics and negotiation\n\nAdvocacy is rarely a one-way communications process. Some advocacy work is more reactive than proactive towards policy makers, or is explicitly dialogical. In any case, policy and decision makers may well respond to advocacy proposals with their own questions or alternative proposals. Other interested parties may launch strategies to counter the proposals being made. It may become necessary to modify the proposals to achieve results. What alternatives might be considered? What counter proposals can be expected? What is non-negotiable and what could be up for discussion?\n\n(v)Monitoring and evaluation\n\nThroughout the implementation phase it is important to monitor the process, the results and the policy context. Mechanisms are needed to track activities such as meetings and communications and to monitor results such as media coverage and expressions of public support. Data needs to be maintained on the target audiences: contact details, positions they have taken, offers of assistance and so on. The process and results should be evaluated not only at the end of the planned timeframe but on a regular basis so that adjustments, if needed, can be made to the strategy and plan of action. Advocacy invariably takes place in a dynamic environment, especially when the focus is on ICTs. The policy terrain can change for social, political or economic reasons that are independent of the advocacy initiative underway. The ability to react quickly and flexibly, to spot windows of opportunity, and to anticipate new challenges requires close monitoring of the policy context and of broader trends.\n\n4. Case studies\n\nThree case studies have been provided for this module as well as a list of additional resource material. The advocacy case studies are outlined below:\n\nProject Project Description Highlights São Paulo Telecentres Project A successful example of how practical ICT demonstration at a local level can support national advocacy for policy change This partnership-based project mobilised policy, investment and technical support leading to the establishment of 128 community-based telecentres. It eventually influenced national-level digital-inclusion policies. Advocacy for community radio in Nigeria A five-year advocacy project seeking policy change to enable the establishment of community radio services This case study illustrates their approach and the challenges when campaigning for ICT policy change. It also highlights the lessons learned: for instance, how commitments to change policy mean little without political will. Rural Knowledge Centre Movement The story behind the “Mission 2007: Every Village a Knowledge Centre” vision that has the goal of extending the benefits of rural ICT access to 600,000 villages in India This case study documents how a project has evolved into a mass movement in India and influenced similar initiatives in Asia and Africa, and has mobilised high-level support from public, private and civil society organisations.\n\nThere are also case studies in other modules of this toolkit which are particularly relevant to advocacy:\n\nProject Project Description Highlights The Huaral Valley Agrarian Information System, Peru This project is providing phone and internet access for poor farming communities and access to an agrarian information system This case study illustrates the importance of leadership and vision to ensure that lobbying and advocacy are undertaken both within communities but also with the government. The community, through its irrigation board, was able to lobby for changes in the existing restrictive ICT policy and regulatory frameworks. Nepal Wireless Networking Project Low-cost and easy-to-maintain wireless networks used in harsh and remote locations in Nepal to provide phone and internet access to dispersed and marginalised communities The advocacy efforts of the local champion, Mahabir Pun, resulted in the government changing its restrictive telecoms policies that previously prohibited the use of wireless networks, while also dropping the costs of licences to under USD 2.\n\nReferences\n\nAmnesty International Amnesty International Campaigning Manual London: Amnesty International, 1997 www.amnesty.org/en/library/info/ACT10/002/1997\n\nBetancourt, Valeria Access to ICTs as a right: The case of the constituent process in Ecuador Montevideo: APC, forthcoming\n\nDrèze, Jean and Amartya Sen India: Development and Participation New Delhi: Oxford University Press, 2002\n\nIFEX (International Freedom of Expression eXchange) Campaigning for Free Expression: A Handbook for Advocates Toronto: IFEX, 2005 www.ifex.org/download/en/IFEXCampaignHandbook.pdf\n\nJenkins, Rob and Anne Marie Goetz “Accounts and accountability: Theoretical implications of the right-to-information movement in India” Third World Quarterly 20, 3 (1999): 603-22\n\nMalena, Carmen, Reiner Forster and Janmejay Singh Social Accountability: An Introduction to the Concept and Emerging Practice Washington: World Bank, 2004\n\nMendel, Toby Freedom of Information: A Comparative Legal Survey 2nd ed. Paris: UNESCO, 2008\n\nNarayan, Deepa Voices of the Poor: Volume 1: Can Anyone Hear Us? Washington: World Bank, 2000\n\nPavarala, Vinod and Kanchan K. Malik Other Voices: The Struggle for Community Radio in India New Delhi: Sage, 2007\n\nRose, Chris How to win campaigns: 100 steps to success London: Earthscan, 2001\n\nSprechman, Sofia and Emily Pelton Advocacy Tools and Guidelines: Promoting Policy Change Atlanta: CARE, 2001\n\nWolf, Kirsten Now Hear This: The Nine Laws of Successful Advocacy Communications Washington: Fenton Communications, 2001\n\n_________\n\nFootnotes\n\n[1] Sofia Sprechman and Emily Pelton Advocacy Tools and Guidelines: Promoting Policy Change (Atlanta: CARE, 2001)\n\n[2] Notably in the writings of Aristotle and Confucius.\n\n[3] Carmen Malena, Reiner Forster and Janmejay Singh Social Accountability: An Introduction to the Concept and Emerging Practice (Washington: World Bank, 2004)\n\n[4] www.wougnet.org\n\n[5] The 2005 World Summit on Aid Effectiveness included a commitment by developing countries to prepare National Development Strategies incorporating the Millennium Development Goals.\n\n[6] www.righttoinformation.info\n\n[7] Toby Mendel Freedom of Information: A Comparative Legal Survey 2nd ed. (Paris: UNESCO, 2008)\n\n[8] See, for example, Chris Rose How to win campaigns: 100 steps to success (London: Earthscan, 2005) and Kirsten Wolf Now Hear This: The Nine Laws of Successful Advocacy Communications (Washington: Fenton Communications, 2001)\n\n[9] Valeria Betancourt Access to ICTs as a right: The case of the constituent process in Ecuador (Montevideo: APC, forthcoming)\n\n[10] See, for example, Amnesty International Amnesty International Campaigning Manual (London: Amnesty International, 1997)\n\n[11] See, for example, Deepa Narayan Voices of the Poor: Volume 1: Can Anyone Hear Us? (Washington: World Bank, 2000)\n\n[12] Jean Drèze and Amartya Sen India: Development and Participation (New Delhi: Oxford University Press, 2002), 29\n\n[13] Ibid. 30\n\n[14] www.bnnrc.net\n\n[15] www.ddsindia.com\n\n[16] For a case study on Sangham Radio see also Vinod Pavarala and Kanchan K. Malik Other Voices: The Struggle for Community Radio in India (New Delhi: Sage, 2007)\n\n[17] Rob Jenkins and Anne Marie Goetz “Accounts and accountability: Theoretical implications of the right-to-information movement in India” Third World Quarterly 20, 3 (1999): 603-22\n\n[18] www.rits.org.br\n\n[19] Among others, this section draws from the advocacy research and experience of Amnesty International (1997), Sprechman and Pelton (2001), Wolf (2001), Rose (2005) and IFEX (2005).\n\nBack to main menu"}, {"url": "https://www.theguardian.com/sport/2019/mar/01/malcolm-brogdon-interview-milwaukee-bucks-nba", "page_content": "It’s still winter in America, with downtown Milwaukee lined by banks of dirty snow, but there is sunshine in this room. Donald Trump remains in office, as anger and disillusion festers, but Malcolm Brogdon defies these downbeat days. Fiery eloquence and hope pour out of the NBA’s 2017 Rookie of the Year who plays for the most exciting basketball team in America. The Milwaukee Bucks lead the Eastern Conference and have the best record in the league.\n\nGiannis Antetokounmpo, a 6ft 11in Greek immigrant of Nigerian descent, is the Bucks’ exhilarating star who now bears comparison with LeBron James and Steph Curry. But Brogdon is the steady heart of this young team. Antetokounmpo is called the Greek Freak while Brogdon’s stately nickname is The President. Having come late to the pro ranks after completing his post-graduate degree, the 26-year-old talks with the resolve of a man destined for more important matters than his current drive to help the Bucks become NBA champions for only the second time in their five-decade history – and the first since a young Kareem Abdul-Jabbar was in their fold.\n\n“It speaks to America as a whole,” Brogdon says as he considers the perennial question of race in a country where Trump sits in the White House. “We’ve elected someone who allows hatred and racism to continue and, in some way, supports it. It was shocking when we put him in office but having him there has allowed everyone to see what people in the country really feel. Now we can rebuild the country properly. It’s about electing someone that unites people and supports progressive ideas. We no longer need a president who tries to destroy people.”\n\nBrogdon, a quietly impassioned orator, pauses. “It’s ironic because, while Trump tries to break people down and tear them apart, he’s brought so many of us together. This is especially true for the black community. One of our main problems is that, after the Civil Rights movement, black people did not look after each other. But having Trump in office has brought us together.”\n\nMalcolm Brogdon’s Bucks have the best record in the NBA this season, outperforming the likes of Kyrie Irving’s Boston Celtics in the Eastern Conference. Photograph: Aaron Gash/AP\n\nAn hour-long conversation with Brogdon is very different to a routine sports interview. I am struck by the cool intelligence and defiant optimism that surges through him and can understand why a superstar like Antetokounmpo has stressed his teammate’s nickname is not a joke – but echoes a belief among the Bucks that they could have a giant of a man in their midst.\n\nBrogdon takes a difficult subject such as racism and turns it over to find something new to say. “It builds mental toughness. It builds character. It builds identity. From a young age you figure out I can be a smart, articulate, educated black man and still identify as an African American. I’m named after Malcolm X and Malcolm always said: ‘If you don’t have education then you have no future.’ My parents are huge Malcolm X fans and raised me according to his guidelines.\n\n“But I went to a school [in Atlanta] where many racist situations occurred. The basketball was pretty racist; the classroom was very racist. The teachers were so blatant in their targeting based on colour. I went to a private school and I only had one or two black friends. We were always the ones in detention. My mom knew to get me out of there. But I’d go to basketball practice with my black friends, in my neighbourhood, and me and my brothers were called white because we went to private school and were articulate.”\n\nHis father, Mitchell, is a lawyer, while Brogdon’s mother, Jann Adams, is the former chair of the psychology department at Atlanta’s Morehouse College, among the most famous of America’s historically black colleges and universities. She is now the associate dean of the science and maths department. “I was lucky I had a mom who had seen it all. From seeing my grandfather march in the Civil Rights era, she understood the depth, character and stability you need to go through racism. She taught me not to accept it to but deal with it, and be better than it. My mom grew up in Waco, Texas, when the KKK was still prominent. She remembers them burning crosses in the front yard. The racism was palpable every day.”\n\nHaving Trump in office has allowed everyone to see what people in the country really feel\n\nBrogdon tells me the remarkable story of how his parents made the decision, when he and his two brothers were still young, to move the family out of a middle-class neighbourhood. “We moved into inner-city Atlanta. It was a developing neighbourhood but it was lower income. It was one of the best moves my parents ever made. It was a conscious decision on their part to make sure we grew up with an understanding of what other people had to go through.”\n\nHis parents also took their boys to Africa, on a three-week trip to Ghana where, instead of a vacation, they worked in day-care and maternity centres. While playing soccer with barefoot local kids, Brogdon realised how fortunate his family were in comparison to most people. “I have great memories from childhood. Of course the divorce, when I was 11, was tough. But my mom, especially, did a great job in raising us. She rooted us in black environments while situating us in private school. We tasted both sides.”\n\nThere was a basketball court just behind Brogdon’s backyard in Atlanta and his face lights up at a surreal memory. “We had crackheads, all types of users, coming by the court. We befriended all of them. They would come play with us. My mom saw no danger. She thought it was a great environment for us to learn how to be with different people. They knew our names, we knew their names. We had fun every day.\n\nThe Bucks’ new practice facility is adjacent to their stadium in downtown Milwaukee. Photograph: Adam Jason Cohen/The Guardian\n\n“I learnt that drug users could be good people too. They had just gone down a wrong path. It’s easy to dismiss people but my grandfather taught us to think differently. He marched with Dr Martin Luther King and to this day my grandmother is great friends with Andrew Young [a King confidant who became the US Ambassador to the United Nations]. It was a blessing and a privilege to have my grandfather – a giant among men.”\n\nAs a kid did Brogdon believe a career in the NBA was impossible? “My parents never planted the seed that anything was impossible. They planted the seed that things were doubly hard for a black man. My brothers and I made sure we outworked people and were better than everyone we were around.”\n\nBrogdon smiles. “Anyway, I really wanted to play professional soccer. I loved Arsenal and Thierry Henry. Soccer is still my favourite sport. I was a striker – like Henry. But things changed when I got to the ninth grade. My brother was always playing basketball and I wanted to be more like him. I wanted to be around more black people.”\n\nWe discuss my interview last year with Jaylen Brown, of the Boston Celtics, another impressive young NBA player. It was rumoured that an unnamed executive said Brown was “too smart” – a euphemism for being too educated and political. “Absolutely. Me and Jaylen went through the same [2016] draft. I went into draft interviews and they would say: ‘You went to college for four years, and got your master’s in your fifth year. Are you sure you want to be an NBA player? Don’t you want to go into politics?’ It seems as if you’re black you can’t be both educated and a sportsman. I’d rather they said: ‘You showed so much dedication and perseverance in your studies we know you will show it on the court.’”\n\nIt does not sound like an isolated incident. “There were multiple teams. But it’s not disheartening. It’s empowering and a chance for me to break the mould for younger black athletes get their degree, their master’s, and come into the NBA and shock the world.”\n\nMalcolm Brogdon is full of praise for his All-Star teammate Giannis Antetokounmpo. Photograph: Jeffrey Phelps/AP\n\nBrogdon still believes that “the NBA is the most progressive league out there. I’ve been a bit surprised, and encouraged, by the NBA’s support for athletes that speak out. Compared to the NFL it’s night and day. Look at the NFL’s treatment of Colin Kaepernick [who was shut out of football after he refused to stand for the national anthem]. Kaepernick is a hero. When you talk about Malcolm X and Dr King the word that comes to mind is sacrifice. Colin Kaepernick is the epitome of that sacrifice in our generation. I love it that black athletes are now willing to speak out. It’s inspiring.”\n\nThe Bucks have been inspiring on court. At their new arena, the stunning Fiserv Forum in Milwaukee, I saw them demolish the Dallas Mavericks. With Antetokounmpo and Brogdon in full flow, it’s easy to imagine the Bucks facing the Golden State Warriors, the imperious champions, in June’s NBA finals.\n\n“Absolutely,” Brogdon says. “We have a phenomenal coach [Mike Budenholzer] and a phenomenal system. We have guys with little ego and a superstar, Giannis, who is top five in the league. We have great role players behind him. You can’t get a better recipe than that – unless you’re Golden State. But we’ve already beaten them this season [the Bucks won easily in Oakland, in November, with Brogdon scoring 20 points]. I’m living my dream and playing in the NBA. But the next level of the dream is to win a championship. It’s something very few NBA guys do – so it would be amazing.”\n\nThe Bucks new state of the art practice facitilty is adjacent to their brand new stadium in downtown Milwaukee. Photograph: Adam Jason Cohen/The Guardian\n\nHe laughs when asked what it’s like to play with Antetokounmpo. “Giannis does so many amazing things on the floor. A lot of time you just watch him play – like the fans. Sometimes you just have to get out of the way, and let him do his thing. For six or seven minutes, long stretches, he dominates. There are times when he needs support but Giannis attracts so much attention that often all you have to do is stand on the perimeter and shoot at the ring – or cut to the basket and score a lay off. He makes the game easy for us.”\n\nPeter Feigin, the Bucks’ charismatic president, is a New Yorker who offended many locals in 2016 when he said Milwaukee is “the most segregated and racist place” he had known. Was Brogdon surprised? “Not at all. Before I came to Milwaukee I’d heard the city was the most segregated in the country. I’d heard it was racist. When I got here it was extremely segregated. I’ve never lived in a city this segregated. Milwaukee’s very behind in terms of being progressive. There are things that need to change rapidly.”\n\nIs this an opportunity to change Milwaukee? “Absolutely. Leadership and change starts from the top down – with our owners being progressive. They encourage players that also want to be forward thinking. For them to support Peter Feigin is a big sign and encourages us to do the same. To speak out for what is good and right.”\n\nIs Milwaukee, agog with the brilliance of the Greek Freak and teammates like Brogdon, already changing? “It’s amazing how sports is a way to control the masses. But it also unites people. When you have a team on the rise, with a player like Giannis, it brings the city together. The owners, and Peter Feigin, have trademarked the team as something the city can really get behind as a progressive unit.”\n\nBefore he won Rookie of the Year, Brogdon persuaded the Bucks to divert all the money they had earmarked for his campaign to charity. “I thought my play would speak for itself and all the money put into that should go to something more important. The award is superficial. It’s more important to give back when you can.”\n\nBrodgon’s master’s thesis was on the necessity for clean water in rural South Africa. “When I first went to Africa, aged 11, it was the trip of a lifetime. It ignited a fire in me. I saw people less privileged than me. But they were still happy – even if they didn’t have clean water. They didn’t have food to eat. They were starving to death. From then on I wanted to make a change.\n\n“I went on a mission trip with my grandparents – to Malawi – when I was 14. Malawi was far worse off than Ghana. It was mind-boggling that people don’t have clean water. And then an opportunity arose. During my thesis I was looking for an organisation I could work with. And there happened to be one based in Charlottesville. I worked with them on my thesis, went out [to South Africa] for nine days and it was the best trip I’ve ever taken.”\n\nBrogdon is the founder of Hoop2o which, last October, he and four other NBA players launched to help people benefit from clean water in Tanzania. By late January they had raised $125,000 and built two wells which now provide water to 11,000 people. Brogdon also works with the NFL player Chris Long, who started Waterboys – an initiative that funds 55 wells and provides clean water to 210,000 people in Africa. Their aim is for their wells to reach a million people – as a child in Africa dies every 90 seconds from a water-related disease.\n\n“Clean water allows little girls traveling miles to school to get an education,” he adds. “It allows them not to be eaten by animals when they’re trying to get water.”\n\nDid he know Long, one of the most politically conscious white sportsmen in America, when they both went to the University of Virginia? “I didn’t as he’s about [seven] years older than me. I just heard great things about him. Chris is totally aware of what’s happening in America and the world and he’s amazing.”\n\nBrogdon and Long went to college in Charlottesville where, in August 2017, members of the far-right marched with burning torches and chanted “You will not replace us” and the Nazi slogan “Blood and soil”. A car ploughed into a crowd of counter-protestors and a woman was killed.\n\n“That’s not my experience of Charlottesville,” Brogdon says, “but it was a powerful reminder of racism and prejudice. I see the news, I read, and there’s so much hatred and violence.”\n\nTrump initially refused to comment on Charlottesville – and when he did speak the President praised the “many fine people on both sides”. Despite the constant accusations swirling around Trump, many Americans believe he will be re-elected. “It’s very realistic,” Brogdon says of that bleak possibility. “It’s very discouraging. But the focus has to be on getting the minorities, especially African Americans, voting. We have a history of not voting. But people died for our right to vote. We must get out and vote and change the outcome of these future elections.”\n\nWhat will Brodgon be doing in 10 years? “I’ll be finding something that will impact people’s lives. I’d like to stay in the non-profit sector whether it’s clean water or fighting poverty. I have a passion for Africa and I would love to continue to use my resources to help others.”\n\nIs politics too dirty a business? “No, it’s not too dirty. There are good people in politics that are doing great work. But is a business where there is dirt. If I want to get into that I have to be ready to take on every aspect – including politicking. It’s similar to the NBA. You have to fight for what you want. I need to decide if I want another career like that because, by that time, I’ll have kids. But it’s possible.”\n\nHow did his presidential nickname arise? “That came up when President Obama was in office. People said I spoke like him and looked like him. I was articulate and had my master’s degree. People started to call me The President.”\n\nBrogdon, who will surely do even more in life than chase down an NBA championship in Milwaukee, smiles when asked if he likes his nickname. “I love it – as long as you know the context. We need context for everything.”"}, {"url": "https://www.humanrightscareers.com/issues/social-justice-organizations/", "page_content": "Race Forward is a social justice organization that catalyzes movement building for racial justice. They envision ‘’a just, multiracial, democratic society, free from oppression and exploitation, in which people of color thrive with power and purpose’’.\n\nThey work with communities and other organizations to build strategies to advance racial justice in policies, institutions and culture. They conduct cutting edge research on pressing racial justice issues and focus on the significance of race in society. Their work also entails pushing forward the conversation on race in the media, mainly through their award-winning daily news site Colorlines, as well as advocating on complex racial justice issues in several other ways.\n\nThe Equal Justice Initiative (EJI) was established in 1989 by a popular public interest lawyer Bryan Stevenson to ‘’end mass incarceration and excessive punishment in the United States, to challenge racial and economic injustice, and to protect basic human rights for the most vulnerable people in American society.’’\n\nEJI works with marginalized communities to change the narrative about race in America. They also provide legal representation to people who have been illegally convicted or abused in state prisons. They challenge the death penalty and excessive punishment, and provide assistance to formerly incarcerated people. Recently, they also have been creating memorials to address the legacy of lynching, slavery, and racial segregation.\n\nThe Transgender Law Center (TLC) is a trans-led social rights organization advocating for a world in which all people are free to pursue their lives as they wish. They change laws, policies, and attitudes so that everyone can live free from discrimination regardless of their expression or gender identity.\n\nFor almost two decades, TLC has been has been challenging the legal system to respect the dignity and humanity of transgender and gender nonconforming people. They believe in justice and liberation for all trans people, including those most impacted by the system they fight against such as imprisoned trans people, black and brown trans migrants, black trans women, trans people living with HIV, and trans youth.\n\nFair Fight works on promotion of fair elections in Georgia and around the United States by encouraging voter participation in elections and educating them about their rights. They bring awareness to the public on election reforms and advocate for election changes at all levels.\n\nFair Fight works against voter suppression of voters of color and young voters and engages in their mobilization by conducting education activities and advocating for progressive issues. They had mounted significant programs to combat voter protection suppression and initiated programs to actually support voter protection across the country.\n\nThe National LGBTQ Task Force fights for freedom and equality of LGBTQ people. They work to build a future where everyone can be themselves in every aspect of their lives. To achieve this, they train and mobilize activists to deliver a free world.\n\nTheir advocacy team advocates on opportunities to advance full freedom, justice, equality and equity for LGBTQ people. They achieve this through queering the progressive movement and mobilizing the LGBTQ community and allies at places of intersectionality to end discrimination in housing, employment, healthcare, retirement, and basic human rights.\n\nGLSEN was founded in 1990 by a group of teachers who knew that educators play key roles in creating affirming learning environments for LGBTQ students. Today, their network has more than 1.5 million members and includes students, families, educators and education advocates.\n\nThey advocate for comprehensive policies that protect LGBTQ students and students of marginalized identities. Their network spreads across 43 chapters in 30 US states, to ensure that they reach every LGBTQ student so that they are able to grow and learn in a school environment free from harassment and bullying.\n\nColor of Change is one of the largest online racial justice organizations helping people respond effective to injustice in the world that surrounds them. It has around 7 million members moving decision-makers in corporations and government to create less hostile world for black people in America.\n\nThey lead campaigns to rebuild real power for black communities, through which they challenge injustice by holding political and corporate leaders accountable. They also conduct research on inequality systems and provide solutions for racial justice that can transform the world.\n\nCommunities United Against Police Brutality (CUAPB) was founded in 2000 in the aftermath of the police shooting and death of Charles Sanders. Since then, they became an organization that deals with police brutality on an ongoing basis.\n\nThey work on extreme cases of abuses, brutal police killings and other incidents. Their goal is to ‘’create a climate of resistance to abuse of authority by police organizations and to empower local people with a structure that can take on police brutality and actually bring it to an end’’. They provide constant support for survivors of police brutality and their families so they are able to reclaim their dignity and join the struggle to end this form of violence.\n\nBrennan Center for Justice strives to uphold the values of democracy and stands for equal justice and the rule of law. They work to strengthen democracy, protect liberty and security and end mass incarceration.\n\nTheir programs focus on criminal justice, democracy, protection of fundamental freedoms and securing the balance of power. They conduct research to reach transformative solution and advocate and fight in courts with elected officials to advance legislations. They also act a cutting-edge communications hub by taking their message directly to the press and public.\n\nAssata’s Daughters is a black woman-led social justice organization that works on organizing young black people in Chicago and providing them with political education, mentorship, leadership development, and revolutionary service.\n\nThey were formed in 2015 as collective of black women, gender nonconforming people and femmes, with a goal of addressing a shortage of programs in these communities. In 2018 they shifted to a formal organizational structure ‘’led by black women using a black queer feminist lens and relationship-based tactics to organize bases of young black people in divested-from areas of Chicago’’."}, {"url": "https://effectivecommunities.com/use-advocacy-to-promote-social-change/", "page_content": "What is “advocacy”? The word is from Latin, meaning “to give voice” to a cause that it might progress and succeed. Advocacy has recently become a legitimate strategy to promote social change.\n\nWhat is advocacy, more precisely? Wikipedia recognizes advocacy as “an activity by an individual or group that aims to influence decisions within political, economic, and social institutions. Advocacy includes activities and publications to influence public policy, laws and budgets by using facts, their relationships, the media, and messaging to educate government officials and the public.”\n\nNonprofit organizations are all over advocacy these days, as a new means for promoting effectiveness in their various missions. Advocacy to promote social change includes changing public policy to prevent problems and to reduce the flow of victims that stem from bad policy. This can be more effective, and much more cost-effective, than the usual approach of charities, which tries to serve individuals one-at-a-time. Improvements to policy can improve the quality of life for whole communities or regions at a time.\n\nIt’s like public health vs. doctoring. The practice of medicine can treat an illness one person at a time — one health professional working with one patient — such as in a clinic. The practice of public health seeks to eliminate the illness at its source, one cause or contributor at a time, such as by eliminating unsanitary disease-bearing water, or controlling disease-bearing insects, or educating people on healthier practices.\n\nThinking like a public health professional is becoming useful in many other arenas of improving the public’s health…\n\nIf too many people are hungry or malnourished, let’s use the policy process to fix the food distribution systems.\n\nIf too many people are unable to find or get to meaningful work, let’s use the policy process to fix the employment and transportation systems.\n\nIf too many people are getting killed by gun-toting citizens not in well-regulated militias, let’s use the policy process to reduce the chances of innocent people getting killed that way.\n\nPublic policy plays the role of public health in this analogy. Rather than let random or powerful systemic forces play havoc with the well-being of individuals, let’s use the wisdom of good policy, good practice, and good cultural norms to stabilize, elevate, and equalize the playing field to produce far fewer victims.\n\nHow does it work?\n\nPolicyLink presented its Getting Equity Advocacy Results (GEAR) in 2012. It names four interconnected components of advocacy: (1) organizing; (2) capacity building; (3) research; (4) communications – and four interconnected stages of advocacy: (1) build the base; (2) name and frame the equity solutions; (3) move the equity proposal, and (4) build, advance, and defend.\n\nAspen Institute presented its Advocacy Progress Planner in 2012. Its on-line tool helps organizations track progress with: (1) goals: what change needs to happen? (2) audience: who can make it happen? (3) context: what else is going on? (4) activities: how will you get it done? (5) inputs: what do you have? what do you need? (6) benchmarks: how will you know you’re on the right track?\n\nMy own Effective Communities Project first presented its Pathways to Progress online in 2007 to advocate and accelerate progress by philanthropic organizations in reducing racial disparities. Key ingredients include grantmaking and institutional leadership to support: (1) emerging promising workable solutions; (2) organizations capable of moving them along; (3) relationships among key people built on trust; (4) networks and partnerships to generate public support; (5) financial, human, informational, technical, and political resources; (6) strategies for pulling these together that produce noticeable progress along the way.\n\nAdvocacy, as revealed in these three illustrations, requires intentional staging of interconnected phases playing out in time. For grantmaking institutions, supporting and evaluating advocacy requires a different perspective than is the case with supporting service, just as supporting and evaluating public health requires different mechanisms than for medicine.\n\nIn particular, if foundations insist on one-year project horizons, supporting and evaluating advocacy requires legitimizing a different set of goals and outcomes to pursue in one-year grants but that connect over time in ways that move the strategy along.\n\nProgress in the advocacy and policy realm is sequenced in complex ways. The funding model must adapt to this reality.\n\nMore on these tantalizing subjects in subsequent posts.\n\n# # #\n\nSteven E. Mayer, Ph.D. / Consulting Evaluator / Effective Communities Project\n\nJanuary 12, 2013\n\nlightly revised November 18, 2020"}, {"url": "https://www.verywellmind.com/10-organizations-that-support-racial-equality-5071298", "page_content": "Racial equality will never be achieved by a single person or group. It takes a variety of activists, organizations, and approaches to create necessary changes.\n\nWhether you’re looking to volunteer, donate money, or you’re interested in more information about how to get involved, it’s important to find an organization that you believe in. When you pitch in and help one of them, you can help make a big difference in society.\n\nHere are 10 organizations that are working hard right now to support racial equality in America.\n\nNAACP\n\nThe National Association for the Advancement of Colored People (NAACP) was founded in 1909 in response to the ongoing violence against Black people around the country. The NAACP is the largest civil rights organization in the nation with over 2 million activists involved in its 2,200 units across the country.\n\nIts mission is to secure the political, educational, social, and economic rights of Black people and to eliminate race-based discrimination. Its website offers ways to volunteer and donate.\n\nBlack Youth Project\n\nThe Black Youth Project (BYP) examines the attitudes, resources, and culture of Black millennials. It explores how culture influences the decisions young people make in terms of health, sex, and politics.\n\nBYP conducts research, shares knowledge, and takes action. Its headquarters are in the Chicago area, but they have chapters in cities across the nation where they provide social activism training to young people.\n\nBYP offers several ways people can help its members make a difference, including pitching and writing articles related to racial injustice, LGBTQIA+ issues, and feminism or by making a donation.\n\nThe Las Americas Immigrant Advocacy Center\n\nThe Las Americas Immigrant Advocacy Center is a nonprofit organization that works to serve the legal needs of low-income immigrants who aren’t able to afford legal aid. Las Americas reports providing legal care to people in Texas and New Mexico. It has served more than 30,000 low-income immigrant residents in the El Paso area alone, and its clients come from all over the world.\n\nFrom helping individuals gain asylum to providing general immigration relief, Las Americas' legal services are abundant. To help, you can apply to be a volunteer.\n\nThe American Civil Liberties Union\n\nThe American Civil Liberties Union (ACLU) seeks to ensure constitutional freedoms for every gender, race, and sexual orientation. You can help the ACLU take action as its members continue to lobby for systemic change across the country.\n\nCommon issues addressed include free speech, human rights, racial injustice, and criminal justice. The ACLU is composed of hundreds of attorneys and thousands of volunteers who are committed to protecting civil liberties in the country.\n\nKIND\n\nKids in Need of Defense (KIND) protects immigrant children by providing legal and social services to children who have crossed the U.S. border by themselves. It strives to make sure that no child appears in court alone.\n\nMembers work to advance the laws around children’s rights in the United States and offer several resources on how you can get involved. They also advocate for legal changes that will protect vulnerable children who enter the U.S. themselves or those who are detained and separated from their families.\n\nAdvancement Project\n\nAdvancement Project is a civil rights organization whose mission is: \"fulfill America’s promise of a caring, inclusive, and just democracy.\" The organization uses innovative tools to strengthen social movements and achieve high-impact policy change.\n\nAdvancement Project is involved in a variety of different campaigns and provides multiple opportunities for volunteers to get involved in various projects. Its website provides an abundance of resources and information for anyone who wants to know how they can help.\n\nColor Of Change\n\nColor Of Change is an online racial justice organization whose goal is to mobilize its members to knock down walls that hold Black people back.\n\nColor Of Change was founded after Hurricane Katrina. Its organizers discovered that there weren’t enough resources dedicated to protecting and assisting Black people who experienced devastating losses. Since then, they’ve started addressing police brutality against the Black community by leading campaigns to deter elected officials from supporting, investing in, and protecting an unaccountable police force. They’re actively working on developing people-powered movements that will make a difference.\n\nColor of Change offers a variety of ways to get involved, from donating money to joining its campaigns to end racist policies. You can sign up for its newsletter to learn how to get involved.\n\nLive Free USA\n\nLive Free USA wants to reduce gun violence and county jail incarcerations. With over 118 million people attending weekly faith-based services in over 350,000 congregations across the U.S., its aim is to create social justice by reaching faith institutions.\n\nIt partners with congregations and leaders throughout the country with its LIVE FREE Campaign. Its goal is to end “gun violence, mass incarceration, and the criminalization of Black and Brown bodies that tears at the soul of our society.”\n\nThere are a variety of resources for congregations who want to get involved and help spread their message. There are also clear action plans available for anyone who wants to get involved.\n\nThe National Coalition on Black Civic Participation\n\nThe National Coalition of Black Civic Participation seeks to encourage civic participation in the Black community. It educates, organizes, and mobilizes citizens to view civic participation as a cultural responsibility and tradition.\n\nThis organization envisions a nation in which all people have the tools to fully participate in the democratic process at the local, state, and national levels. Its organizers fight to eliminate barriers to civic participation and promote greater social and economic justice.\n\nFrom local events to donating money, there are a number of ways to get involved in getting more people to vote and run for office.\n\nBlack Lives Matter\n\nBlack Lives Matter (BLM) was founded in 2013. It’s a global organization in the U.S., U.K., and Canada. Its mission is to eradicate white supremacy and build local power to intervene in violence inflicted on Black communities. By combating and countering acts of violence, creating space for Black imagination and innovation, and centering Black joy, its members are winning immediate improvements in Black lives.\n\nThe BLM movement has been instrumental in organizing protests following the death of George Floyd. BLM's work is often misrepresented in the media. Its members ask that people report suspicious sites, stories, ads, social accounts, and posts about BLM.\n\nTo get involved, you can join the movement."}]}