{"Malcolm Brogdon's awards are ACC Player of the Year and an All-American in 2016.": [{"url": "https://www.washingtonpost.com/news/sports/wp/2016/03/06/malcolm-brogdon-named-acc-player-of-the-year/", "page_content": "Gift Article Share\n\nVirginia’s Malcolm Brogdon is the ACC Player of the Year and Defensive Player of the Year, the Atlantic Coast Sports Media Association announced on Sunday. The senior had 38 votes to runner up Brice Johnson of North Carolina’s eight for Player of the Year. Brogdon is the first player to earn to both honors since the league instituted the defensive award in 2005.\n\nMiami Coach Jim Larranaga earned Coach of the Year honors with 24 votes to Virginia Tech Coach Buzz Williams’s 22.\n\nBrogdon, the third Virginia player to earn the honor along with three-time winner Ralph Sampson (1981-83) and Barry Parkhill (1972), led the Cavaliers with 18.4 points per game throughout the regular season and 19.9 points per game in conference play. He’s the fourth-best scorer in the ACC heading into the conference tournament. He was also named to the all-ACC first team for the third consecutive season, one of four Virginia players in program history to be so honored.\n\nAdvertisement\n\nThe fifth-year senior has been one of Virginia’s best players as the program notched one of its most successful periods in history. He’s led the team in scoring for the past three years and helped the Cavaliers win at least 12 ACC games in each of the past three seasons, which Virginia previously hadn’t achieved since 1983. The team’s 45 ACC wins over the past three years are the second most in league history.\n\nBrogdon scored s season-high 28 points three different times this season and notched a game-high 26 against North Carolina on Feb. 27 for his 15th 20-point game of the season. His 17 points in Virginia’s regular season finale against Louisville was his 29th straight game scoring in double figures.\n\nThe Atlanta native, currently pursuing a Master’s degree in public policy, is also one of 15 finalists for the John R. Wooden award, presented to the nation’s top player.\n\nAdvertisement\n\nSecond-seeded Virginia (24-6, 13-5 ACC) begins ACC tournament play on Thursday at 7 p.m. at the Verizon Center against either Clemson or Georgia Tech.\n\nHere are the other league honors that were announced Sunday:\n\nAll-ACC first team\n\nBrice Johnson, Sr., North Carolina, *255\n\nMalcolm Brogdon, Sr., Virginia, *255\n\nCat Barber, Jr., NC State, 249\n\nGrayson Allen, So., Duke, 247\n\nJaron Blossomgame, Jr., Clemson, 213\n\nAll-ACC second team\n\nMichael Gbinije, Sr., Syracuse, 155\n\nSheldon McClellan, Sr., Miami, 136\n\nDemetrius Jackson, Jr., Notre Dame, 130\n\nBrandon Ingram, Fr., Duke, 129\n\nDamion Lee, Sr., Louisville, 90\n\nAll-ACC third team\n\nMarcus Georges-Hunt, Sr., Georgia Tech, 76\n\nAnthony Gill, Sr., Virginia, 70\n\nZach Auguste, Sr., Notre Dame, 45\n\nMichael Young, Jr., Pittsburgh, 37\n\nAngel Rodriguez, Sr., Miami, 35\n\nAll-ACC honorable mention\n\nJustin Jackson, North Carolina\n\nTonye Jekiri, Miami\n\nZach LeDay, Virginia Tech\n\nChinanu Onuaku, Louisville\n\nMarcus Paige, North Carolina\n\nLondon Perrantes, Virginia\n\nDevin Thomas, Wake Forest\n\nAdvertisement\n\nACC all-freshman team\n\nBrandon Ingram, Duke, *51\n\nDwayne Bacon, Florida State, 50\n\nMalik Beasley, Florida State, 49\n\nMalachi Richardson, Syracuse, 34\n\nBryant Crawford, Wake Forest, 28\n\nACC all-defensive team\n\nMalcolm Brogdon, Sr., Virginia, 49\n\nTonye Jekiri, Sr., Miami, 39\n\nMichael Gbinije, Sr., Syracuse, 36\n\nLandry Nnoko, Sr., Clemson, 30\n\nChinanu Onuaku, So., Louisville, 27\n\nACC Player of the Year\n\nMalcolm Brogdon, Sr., Virginia, 38\n\nBrice Johnson, Sr., North Carolina, 9\n\nCat Barber, Jr., NC State, 3\n\nGrayson Allen, So., Duke, 1\n\nACC Freshman of the Year\n\nBrandon Ingram, Duke, 48\n\nDwayne Bacon, Florida State, 1\n\nMalik Beasley, Florida State, 1\n\nMalachi Richardson, Syracuse, 1\n\nACC Coach of the Year\n\nJim Larrañaga, Miami, 24\n\nBuzz Williams, Virginia Tech, 22\n\nTony Bennett, Virginia, 2\n\nRoy Williams, North Carolina, 1\n\nBrad Brownell, Clemson, 1\n\nBrian Gregory, Georgia Tech, 1\n\nAdvertisement\n\nACC Defensive Player of the Year\n\nMalcolm Brogdon, Sr., Virginia, 39\n\nTonye Jekiri, Sr., Miami, 9\n\nMichael Gbinije, Sr., Syracuse, 1\n\nMarshall Plumlee, Sr., Duke, 1\n\nChinanu Onuaku, So., Louisville, 1\n\nACC Most Improved Player of the Year\n\nJaron Blossomgame, Jr., Clemson, 21\n\nGrayson Allen, So., Duke, 15\n\nCat Barber, Jr., NC State, 4\n\nZach LeDay, Jr., Virginia Tech, 4\n\nJa’Quan Newton, So., Miami, 2\n\nJoel Berry, So., North Carolina, 2\n\nMarcus Georges-Hunt, Sr., Georgia Tech, 1\n\nDennis Clifford, Sr., Boston College, 1\n\nChinanu Onuaku, So., Louisville, 1\n\nACC Sixth Man of the Year\n\nIsaiah Hicks, Jr., North Carolina, 19\n\nJa’Quan Newton, So., Miami, 12\n\nLuke Kennard, Fr., Duke, 7\n\nTyler Lydon, Fr., Syracuse, 6\n\nDevon Bookert, Sr., Florida State, 6\n\nSheldon Jeter, Jr., Pittsburgh, 1\n\n*indicates a unanimous selection\n\nGiftOutline Gift Article"}, {"url": "https://news.virginia.edu/content/uvas-malcolm-brogdon-earns-historic-sweep-top-acc-honors", "page_content": "University of Virginia fifth-year guard Malcolm Brogdon was named the Atlantic Coast Conference’s 2016 Player of the Year and its Defensive Player of the Year – the first player ever to earn both honors in the same season, the Atlantic Coast Sports Media Association announced Sunday.\n\nBrogdon is also the first Cavalier to be named ACC Player of the Year since the legendary Ralph Sampson won the award three consecutive seasons from 1981 to ’83. Brogdon is the third Cavalier to earn ACC Player of the Year honors, joining Sampson and Barry Parkhill in 1972 (the latter of whom is now an associate director of athletics for development at UVA).\n\nIn addition, Brogdon was named to the All-ACC first team for the third consecutive season and ACC All-Defensive Team for the second straight season. Brogdon becomes the fourth Cavalier to earn three All-ACC first-team honors, joining Sampson (1981-83), Bryant Stith (1990-92) and Sean Singletary (2006-08).\n\n(ESPN profile: Virginia’s Malcolm Brogdon Honored to Live on ‘The Range’)\n\nSenior forward Anthony Gill was named to the All-ACC third team for the second straight season, while junior guard London Perrantes earned All-ACC honorable mention honors.\n\nAll three won the same honors – Brogdon as Player of the Year, Defensive Player of the Year and first-team All-ACC; Gill as third-team All-ACC; and Perrantes as honorable mention All-ACC – in balloting by the league’s coaches, which was announced Monday.\n\nThe trio helped lead the Cavaliers to a 24-6 record and a second-place finish in the conference, behind the University of North Carolina – which they defeated, 79-74, on Feb. 27 in their only meeting of the season.\n\nOn Saturday, UVA completed a perfect 15-0 season in games played at John Paul Jones Arena by whipping the University of Louisville, 68-48 before a joyous sellout crowd.\n\nBrogdon has averaged a career-high 18.4 points, and his 19.9 points per game in ACC play was the highest at UVA since 2007-08. He ranks fourth in the ACC in scoring and has scored 20 points or more in 15 games this season. Brogdon has led UVA in scoring 20 times in 30 games and has earned a pair of ACC Player of the Week honors. He ranks 12th in career scoring at UVA with 1,687 points.\n\nBrogdon spearheads UVA’s third-ranked defense, which yields 59.6 points per game – among the best in the country. Last season, he shared co-Defensive Player of the Year honors from the ACC coaches with former UVA forward Darion Atkins.\n\nGill ranks second in the ACC in field goal shooting (55.6 percent), was 18th in rebounding (6.1 rebounds per game) and 23rd in scoring (13.6 points per game). Perrantes leads the ACC in 3-point shooting at 50.8 percent and is averaging a career-best 11.2 points.\n\nJoining Brogdon on the All-ACC first team were Brice Johnson (University of North Carolina), Anthony “Cat” Barber (North Carolina State University), Grayson Allen (Duke University) and Jaron Blossomgame (Clemson University). Brogdon and Johnson were unanimous selections.\n\nMichael Gbinije (Syracuse University), Sheldon McClellan (University of Miami), Demetrius Jackson (University of Notre Dame), Brandon Ingram (Duke) and Damion Lee (University of Louisville) were named to the All-ACC second team.\n\nMarcus Georges-Hunt (Georgia Institute of Technology), Zach Auguste (Notre Dame), Michael Young (University of Pittsburgh) and Angel Rodriguez (Miami) joined Gill on the All-ACC third team.\n\nNo. 2 seed Virginia (24-6) will play either No. 7 seed Clemson (17-13) or No. 10 seed Georgia Tech (18-13) in the ACC Tournament quarterfinals on Thursday. Tipoff at Verizon Center in Washington, D.C., is set for 7 p.m.\n\nAll-ACC First Team\n\nBrice Johnson, senior, North Carolina (51 first-team votes), *255\n\nMalcolm Brogdon, senior, Virginia (51), *255\n\nCat Barber, junior, N.C. State (48), 249\n\nGrayson Allen, sophomore, Duke (47), 247\n\nJaron Blossomgame, junior Clemson (32), 213\n\nAll-ACC Second Team\n\nMichael Gbinije, senior, Syracuse (8), 155\n\nSheldon McClellan, senior, Miami (6), 136\n\nDemetrius Jackson, junior, Notre Dame (3), 130\n\nBrandon Ingram, freshman, Duke (4), 129\n\nDamion Lee, senior, Louisville (1), 90\n\nAll-ACC Third Team\n\nMarcus Georges-Hunt, senior, Georgia Tech, 76\n\nAnthony Gill, senior, Virginia, 70\n\nZach Auguste, senior, Notre Dame, 45\n\nMichael Young, junior, Pittsburgh, 37\n\nAngel Rodriguez, senior, Miami (3), 35\n\nAll-ACC Honorable Mention [no years?]\n\nJustin Jackson, North Carolina\n\nTonye Jekiri, Miami Zach LeDay, Virginia Tech\n\nChinanu Onuaku, Louisville\n\nMarcus Paige, North Carolina\n\nLondon Perrantes, Virginia\n\nDevin Thomas, Wake Forest\n\nACC All-Freshman Team\n\nBrandon Ingram, Duke, *51\n\nDwayne Bacon, Florida State, 50\n\nMalik Beasley, Florida State, 49\n\nMalachi Richardson, Syracuse, 34\n\nBryant Crawford, Wake Forest, 28\n\nACC All-Defensive Team\n\nMalcolm Brogdon, senior, Virginia, 49\n\nTonye Jekiri, senior, Miami, 39\n\nMichael Gbinije, senior, Syracuse, 36\n\nLandry Nnoko, senior, Clemson, 30\n\nChinanu Onuaku, sophomore, Louisville, 27\n\nACC Player of the Year\n\nMalcolm Brogdon, senior, Virginia, 38\n\nBrice Johnson, senior, North Carolina, 9\n\nCat Barber, junior, N.C. State, 3\n\nGrayson Allen, sophomore, Duke, 1\n\nACC Freshman of the Year\n\nBrandon Ingram, Duke, 48\n\nDwayne Bacon, Florida State, 1\n\nMalik Beasley, Florida State, 1\n\nMalachi Richardson, Syracuse, 1\n\nACC Coach of the Year\n\nJim Larrañaga, Miami, 24\n\nBuzz Williams, Virginia Tech, 22\n\nTony Bennett, Virginia, 2\n\nRoy Williams, North Carolina, 1\n\nBrad Brownell, Clemson, 1\n\nBrian Gregory, Georgia Tech, 1\n\nACC Defensive Player of the Year\n\nMalcolm Brogdon, senior, Virginia, 39\n\nTonye Jekiri, senior, Miami, 9\n\nMichael Gbinije, senior, Syracuse, 1\n\nMarshall Plumlee, senior, Duke, 1\n\nChinanu Onuaku, sophomore, Louisville, 1\n\nACC Most Improved Player of the Year\n\nJaron Blossomgame, junior, Clemson, 21\n\nGrayson Allen, So., Duke, 15\n\nCat Barber, junior, N.C. State, 4\n\nZach LeDay, junior, Virginia Tech, 4\n\nJa’Quan Newton, sophomore, Miami, 2\n\nJoel Berry, sophomore, North Carolina, 2\n\nMarcus Georges-Hunt, senior, Georgia Tech, 1\n\nDennis Clifford, senior, Boston College, 1\n\nChinanu Onuaku, sophomore, Louisville, 1\n\nACC Sixth Man of the Year\n\nIsaiah Hicks, junior, North Carolina, 19\n\nJa'Quan Newton, sophomore, Miami, 12\n\nLuke Kennard, freshman, Duke, 7\n\nTyler Lydon, freshman, Syracuse, 6\n\nDevon Bookert, senior, Florida State, 6\n\nSheldon Jeter, junior, Pittsburgh, 1\n\n* unanimous selection\n\n(first place votes)"}, {"url": "https://virginiasports.com/player/malcolm-brogdon/", "page_content": "CAREER HIGHLIGHTS\n\n• Finished his career as UVA’s ninth all-time leading scorer with 1,809 points\n\n• Unanimous consensus first-team All-American in 2015-16\n\n• Named ACC Player of the Year in 2015-16 (first UVA player to win since Ralph Sampson in 1981-83)\n\n• Named ACC Defensive Player of the Year in back-to-back seasons (2014-15, 2015-16)\n\n• First player ever to win both ACC Player of the Year and ACC Defensive Player of the Year in the same season\n\n• Finalist for James Naismith Trophy, John R. Wooden Award and Jerry West Award (top shooting guard) in 2015-16\n\n• Helped Team USA to the bronze medal at the 2015 Pan American Games in Toronto\n\n• Named to the Associated Press (AP), U.S. Basketball Writers Association (USBWA), National Basketball Coaches Association (NABC) and USA Today All-American Second Team in 2014-2015\n\n• Named All-ACC First Team in 2014-2015 by the Atlantic Coast Sports Media Association (ACSMA) and ACC coaches\n\n• Earned Allstate NABC Good Works Team honors in 2014-2015\n\n• Finalist for the John Wooden Award and U.S. Basketball Writers Association (USBWA) Oscar Robertson Player of the Year Award in 2014-2015\n\n• In 2013-14, named All-ACC First Team by the ACC Coaches and All-ACC Second Team by the Atlantic Coast Sports Media Association (ACSMA)\n\n2015-16\n\n• Started all 37 games\n\n• Averaged a career-high 18.2 points overall and 19.9 points in ACC action\n\n• Shot 45.7 percent from the field, 39.1 percent from 3-point range and 89.7 percent from the free-throw line\n\n• Unanimous consensus first-team All-American\n\n• Named first-team All-American by the Associated Press, National Association of Basketball Coaches (NABC), U.S. Basketball Writers Association (USABA) and Sporting News\n\n• Named John R. Wooden All-American for second consecutive season\n\n• Added second-team All-America honors from USA Today and Sports Illustrated\n\n• Named ACC Player of the Year (first at UVA since Ralph Sampson from 1981-83) by media and ACC coaches\n\n• Garnered ACC Defensive Player of the Year for second consecutive year\n\n• Became first player in league history to earn ACC Player of the Year and Defensive Player of the Year in the same season\n\n• Named NABC Defensive Player of the Year\n\n• Netted All-ACC first-team honors for third straight year\n\n• Finalist for James Naismith Trophy, John R. Wooden Award and Jerry West Award (top shooting guard)\n\n• Named USBWA District 3 Player of the Year and USBWA All-District 3 team honoree\n\n• Named NABC All-District 2 First Team\n\n• Named 2015-16 Senior CLASS All-American First Team\n\n• Named ACC All-Tournament First Team\n\n• Received UVA Alumni Association Ernest H. Ern Distinguished Student Award\n\n• Named to the ACC Academic Honor Roll\n\n• Ranked first in the ACC in free-throw percentage (89.7%), fourth in scoring (18.2 ppg), seventh in assist-to-turnover ratio (2.2), eight in 3-point percentage (39.1%) and 10th in minutes (34.1 mpg)\n\n• Ranked first in free-throw shooting (90.9%), fourth in scoring (19.9 ppg), sixth in 3-point shooting (41.1%) and tied for 10th in 3-pointers per game (2.2) during ACC play\n\n• Made 42 consecutive free throws from Jan. 24-March 5, seven shy of breaking Jeff Lamp’s school-record of 48 in 1979-80\n\n• Named ACC Player of the Week on February 8\n\n• Scored at least 20 points in 18 games (most since Norman Nolan had 18 in 1997-98)\n\n• Scored a career-high 28 points and grabbed eight rebounds at George Washingotn (11/16/15)\n\n• Tied a career-high with 28 points on 12-18 FGs at Miami (2/22/16)\n\n• Matched career-high with 28 points on 10-16 FGs at Wake Forest (1/26/16)\n\n• Scored 27 points on 7-10 FGs (5-5 3FGs, 8-8 FTs) vs. Boston College (2/3/16)\n\n• Netted 26 points vs. North Carolina (2/27/16)\n\n• Scored 22 points and added five rebounds and five assists in NCAA Tournament win vs. Butler (3/19/16)\n\n• Scored 20 points and added seven rebounds and six assists vs. Villanova (12/19/15)\n\n• Made career-high six 3-point FGs and scored 22 points at Ohio State (12/1/15)\n\n• Lettered\n\n2014-15\n\n• Started all 34 games\n\n• Tallied a team-leading 14 points per game and averaged 3.9 rebounds and 2.7 assists\n\n• Shot 42.2 percent from the field, 34.4 percent from 3-point range and 87.9 percent from the free-throw line\n\n• Named to the Associated Press (AP), U.S. Basketball Writers Association (USBWA), National Basketball Coaches Association (NABC) and USA Today All-American Second Team in 2014-2015\n\n• Named All-ACC First Team in 2014-2015 by the Atlantic Coast Sports Media Association (ACSMA) and ACC coaches\n\n• Finalist for the USBWA Oscar Robertson Player of the Year Award\n\n• Finalist for the John Wooden Award\n\n• Finalist for Naismith Jerry West Award (best shooting guard)\n\n• Finalist for Lefty Driesell National Defensive Player of the Year Award\n\n• Earned Allstate NABC Good Works Team honors in 2014-2015\n\n• Named ACC Co-Defensive Player of the Year by the ACC coaches\n\n• Named to the All-ACC Defensive Team by the Atlantic Coast Sports Media Association (ACSMA) and ACC coaches\n\n• Earned USBWA All-District 3 Team honors\n\n• Named to the NABC All-District 2 Team\n\n• Named to the All-ACC Tournament Second Team\n\n• Naismith Trophy Midseason 30 List\n\n• Named to the VaSID All-State First Team\n\n• Had back-to-back 20 point games (vs. North Carolina and Belmont) for the first time in his career\n\n• Led the ACC with 89.7 percent free throw shooting during conference games\n\n• Scored in double figures in 15 of 18 conference games and 27 of 34 games overall\n\n• Scored a career-high 25 points (22 in second half) vs. North Carolina in ACC Tournament semifinals (3/13/15)\n\n• Registered 22 points and five rebounds vs. Belmont in NCAA Round of 64 (3/20/15)\n\n• Tallied 20 points vs. La Salle (11/28/14) and Boston College (1/17/15)\n\n• Had 18 points vs. Pitt (2/16/15) as he reached the 1,000 career-point mark\n\n• Earned the WINA Award as Virginia’s Outstanding Male Athlete\n\n• Lettered\n\n2013-14\n\n• Played in and started 37 games\n\n• Averaged a team-leading 12.7 points, 5.4 rebounds, 2.7 assists and 1.2 steals in 31.4 minutes per game\n\n• Shot 41.3 percent from the field, 37 percent from 3-point range and a team-leading 87.5 percent from the free-throw line\n\n• Named All-ACC First Team by the ACC Coaches and All-ACC Second Team by the Atlantic Coast Sports Media Association (ACSMA)\n\n• Named to the ACC All-Tournament First Team\n\n• Selected to the United States Basketball Writers Association (USBWA) All-District 3 Team and National Association of Basketball Coaches (NABC) All-District 2 Second Team\n\n• Named Virginia Sports Information Directors Association (VaSID) University Division All-State Men’s Basketball Player of the Year and VaSID All-State First Team\n\n• Selected as the Richmond Times-Dispatch Player of the Year\n\n• Named to the Basketball Times All-Mid Atlantic Team\n\n• Named CBSSports.com and Co-ACC Player of the Week on March 3, 2014\n\n• Ranked second in the ACC in free-throw percentage (87.5%) in all games\n\n• Ranked first in the ACC in free-throw percentage (88.8%), fourth in assist-to-turnover ratio (3.41) and 12th in scoring (14.8 ppg) in 18 league games\n\n• Only ACC player to score in double-figures in all 18 ACC regular-season games\n\n• Led Virginia in scoring in 14 games, including a then-career-high 23 against Duke (3/16/14) in the ACC Tournament final\n\n• Had 16 points, including the buzzer-beating 3-point game winner at Pittsburgh (2/2/14)\n\n• Recorded first double-double with 17 points, a career-high 11 rebounds and seven assists vs. Boston College (2/5/14)\n\n• Registered second double-double with 14 points and career-high 11 rebounds at Georgia Tech (2/8/14)\n\n• Had 19 points, five rebounds and five assists in ACC regular-season title clinching win against Syracuse (3/1/14)\n\n• Tallied 14 points, five rebounds and five assists vs. Coastal Carolina (3/21/14) in the second round of the NCAA Tournament\n\n• Led Virginia with 17 points vs. Michigan State (3/28/14) in the NCAA East Regional semifinals\n\n• Lettered\n\n2012-13\n\n• Redshirted the 2012-13 season while recovering from foot surgery performed on March 7, 2012\n\n2011-12\n\n• Played in 28 games, starting one game (missed the last four games with a broken bone in his left foot)\n\n• Averaged 6.7 points, 2.8 rebounds, 1.4 assists and 22.4 minutes played per game\n\n• Made 80.0 percent (40-50) of his free throw attempts\n\n• Led the team in assists in four games and in rebounds in one\n\n• Scored in double figures in five games\n\n• Scored a season-high 16 points against #14 Michigan (11/29/11) in the Big Ten/ACC Challenge\n\n• Scoring high in an ACC game was 14 points against Maryland (2/18/12)\n\n• Scored nine points and had three assists at Clemson (2/14/12) in his first career start\n\n• Scored 10 points (4-5 FG, 2-3 3FG) and had two assists vs. Wake Forest (2/8/12)\n\n• Had 10 points at #21 Florida State (2/4/12)\n\n• Had six points, a season-high seven rebounds, three assists and two steals vs. Boston College (1/26/12)\n\n• Scored five points, had four rebounds and two assists in ACC debut vs. Miami (1/7/12)\n\n• Scored 10 points (8-9 FTs, including 6-6 in final 2:04) and had three assists at Seattle (12/21/11)\n\n• Scored nine points, had four assists and two rebounds vs. SC State (11/13/11) in collegiate debut\n\n• Lettered\n\nHIGH SCHOOL\n\nAveraged 25.7 points, 12.9 rebounds, 3.6 assists and 2.3 steals per game as a senior\n\n• Made 53.9 percent (280-519) of his shots from the field, including 46.2 percent (48-104) from three-point range, and made 81.6 percent (213-261) of his free throw attempts in 2010-11\n\n• Named the All-Division Player of the Year in Georgia by the Atlanta Journal-Constitution and selected Mr. Basketball by the Georgia Sportswriters Association his senior season in 2010-11\n\n• Class AA Player of the Year by the Atlanta Journal-Constitution and the Georgia Sportswriters Association for the 2010-11 season, and a first-team All-State selection by the Atlanta Tip Off Club, the Atlanta Journal-Constitution and the Georgia Sportswriters Association\n\n• Greater Atlanta Christian School won the Class AA State Championship both his junior and senior years\n\n• Selected to participate in the Georgia Senior All-Star Game, the Jack Jones Shootout and the Florida vs. USA Hardwood Classic All-Star Game\n\n• Fourth-team selection on the 2011 MaxPreps High School All-American Team\n\n• Named Class AA Player of the Year by the Atlanta Journal-Constitution and selected the Gwinnett Daily Post Player of the Year as a junior\n\nPERSONAL\n\n• Malcolm Moses Brogdon\n\n• Son of Jann Adams and Mitchell G. Brogdon\n\n• Has two older brothers, Gino and John\n\n• Member of the Academic Honor Roll and the National Society of High School Scholars\n\n• Participated in the Hosea Feed The Hungry Program in January of 2011\n\n• History major and pursuing a master’s degree in public policy\n\nCareer Statistics"}, {"url": "https://www.espn.com/mens-college-basketball/story/_/id/14916050/malcolm-brogdon-virginia-cavaliers-jim-larranaga-miami-hurricanes-earn-acc-individual-awards", "page_content": "GREENSBORO, N.C. -- Virginia's Malcolm Brogdon is the Atlantic Coast Conference's player of the year.\n\nThe league announced its postseason awards Sunday following a vote of 51 members of the Atlantic Coast Sports Media Association.\n\nMiami's Jim Larranaga edged Buzz Williams of Virginia Tech for coach of the year honors while Brandon Ingram became the third straight Duke player to win the league's freshman of the year award.\n\nBrogdon and North Carolina forward Brice Johnson were the two unanimous selections to the all-ACC first team. They were joined by Anthony \"Cat\" Barber of North Carolina State, Duke's Grayson Allen and Clemson's Jaron Blossomgame.\n\nBrogdon -- also chosen as the league's defensive player of the year -- received 38 votes for player of the year to nine for Johnson, three for Barber and one for Allen.\n\nBrogdon -- who along with North Carolina's Marcus Paige shared the preseason co-player of the year award -- averaged 18.4 points for the fourth-ranked Cavaliers (24-6, 13-5), who are seeded second in this week's league tournament in Washington.\n\nHe leads a Virginia defense that allows an ACC-best 59.6 points per game and holds teams to just 41.6 percent shooting.\n\nLarranaga, who guided No. 7 Miami (24-6, 13-5) into a tie for second place with Virginia after being picked fifth in the preseason, received 24 votes for the coaching award to 22 for Williams. His Hokies were the preseason pick to finish 14th but finished in a tie for seventh.\n\nIn voting for the freshman award, Ingram had 48 votes -- the only player to appear on multiple ballots -- while joining Jabari Parker and Jahlil Okafor as Duke players to win the award in the past three years.\n\nBlossomgame was picked as the league's most improved player with 21 votes to 15 for Allen, and North Carolina's Isaiah Hicks was chosen as the sixth man of the year with 19 votes."}, {"url": "https://www.ncaa.com/news/basketball-men/article/2016-03-07/virginia-basketball-malcolm-brogdon-named-acc-player-year", "page_content": "ACC player of the year Malcolm Brogdon averages 18.4 points for the Cavaliers.\n\nGREENSBORO, N.C. (AP) — Virginia's Malcolm Brogdon is the Atlantic Coast Conference's player of the year.\n\nThe league announced its postseason awards Sunday following a vote of 51 members of the Atlantic Coast Sports Media Association.\n\nMARCH MADNESS SHOP\n\nMiami's Jim Larranaga edged Buzz Williams of Virginia Tech for coach of the year honors while Brandon Ingram became the third straight Duke player to win the league's freshman of the year award.\n\nBrogdon and North Carolina forward Brice Johnson were the two unanimous selections to the all-ACC first team. They were joined by Anthony \"Cat\" Barber of North Carolina State, Duke's Grayson Allen and Clemson's Jaron Blossomgame.\n\nBrogdon — also chosen as the league's defensive player of the year — received 38 votes for player of the year to nine for Johnson, three for Barber and one for Allen.\n\nBrogdon — who along with North Carolina's Marcus Paige shared the preseason co-player of the year award — averaged 18.4 points for the fourth-ranked Cavaliers (24-6, 13-5), who are seeded second in this week's league tournament in Washington.\n\nHe leads a Virginia defense that allows an ACC-best 59.6 points per game and holds teams to just 41.6 percent shooting.\n\nLarranaga, who guided No. 7 Miami (24-6, 13-5) into a tie for second place with Virginia after being picked fifth in the preseason, received 24 votes for the coaching award to 22 for Williams. His Hokies were the preseason pick to finish 14th but finished in a tie for seventh.\n\nIn voting for the freshman award, Ingram had 48 votes — the only player to appear on multiple ballots — while joining Jabari Parker and Jahlil Okafor as Duke players to win the award in the past three years.\n\nBlossomgame was picked as the league's most improved player with 21 votes to 15 for Allen, and North Carolina's Isaiah Hicks was chosen as the sixth man of the year with 19 votes."}, {"url": "https://www.espn.com/nba/player/_/id/2566769/malcolm-brogdon", "page_content": "Lowe: Who takes home the hardware for the MVP, ROY and DPOY awards?\n\n2M\n\nZach Lowe"}, {"url": "https://www.streakingthelawn.com/virginia-cavaliers-basketball/2016/3/6/11169850/2015-2016-acc-basketball-all-conference-teams-malcolm-brogdon-brice-johnson-player-of-the-year", "page_content": "Two Virginia Cavaliers were named to the 2015-2016 All-ACC teams, headlined by Malcolm Brogdon, who took home both Player of the Year and Defensive Player of the Year honors, becoming the first player in the history of the awards to win both.\n\nBrogdon was a unanimous selection for All-ACC honors, joined only by North Carolina's Brice Johnson. NC State's Cat Barber, Duke's Grayson Allen, and Clemson's Jaron Blossomgame rounded out the First Team. Virginia's Anthony Gill was named to the All-ACC Third Team for the second straight year. London Perrantes also received votes.\n\nBrogdon picked up 38 of the 51 Player of the Year honors, while contender Johnson only picked up nine. Brogdon also earned 39 votes for Defensive Player of the Year.\n\nMiami's Jim Larrañaga was named the ACC Coach of the Year with 24 votes, followed closely behind by Virginia Tech's Buzz Williams with 22. Virginia's Tony Bennett also picked up two votes.\n\nThe full All-Conference teams are below, and here's the link to STL's mock ballots. We accurately picked the entire first team correctly, as well as the Player of the Year, Defensive Player of the Year, Freshman of the Year, Most Improved Player, and Sixth Man Award. We only missed the Coach of the Year honors, which we awarded to Virginia Tech's Buzz Williams.\n\nAll-Atlantic Coast Conference\n\nFirst Team\n\nBrice Johnson, Sr., North Carolina 51 *255\n\nMalcolm Brogdon, Sr., Virginia 51 *255\n\nCat Barber, Jr., NC State 48 249\n\nGrayson Allen, So., Duke 47 247\n\nJaron Blossomgame, Jr., Clemson 32 213\n\n\n\nSecond Team\n\nMichael Gbinije, Sr., Syracuse 8 155\n\nSheldon McClellan, Sr., Miami 6 136\n\nDemetrius Jackson, Jr., Notre Dame 3 130\n\nBrandon Ingram, Fr., Duke 4 129\n\nDamion Lee, Sr., Louisville 1 90\n\n\n\nThird Team\n\nMarcus Georges-Hunt, Sr., Georgia Tech - 76\n\nAnthony Gill, Sr., Virginia - 70\n\nZach Auguste, Sr., Notre Dame - 45\n\nMichael Young, Jr., Pittsburgh - 37\n\nAngel Rodriguez, Sr., Miami 3 35\n\n\n\nHonorable Mention:\n\nJustin Jackson, North Carolina; Tonye Jekiri, Miami; Zach LeDay, Virginia Tech; Chinanu Onuaku, Louisville; Marcus Paige, North Carolina; London Perrantes, Virginia; Devin Thomas, Wake Forest.\n\n\n\nAll-ACC Freshman Team\n\nBrandon Ingram, Duke *51\n\nDwayne Bacon, Florida State 50\n\nMalik Beasley, Florida State 49\n\nMalachi Richardson, Syracuse 34\n\nBryant Crawford, Wake Forest 28\n\n\n\nAll-ACC Defensive Team\n\nMalcolm Brogdon, Sr., Virginia 49\n\nTonye Jekiri, Sr., Miami 39\n\nMichael Gbinije, Sr., Syracuse 36\n\nLandry Nnoko, Sr., Clemson 30\n\nChinanu Onuaku, So., Louisville 27\n\n\n\nACC Player of the Year\n\nMalcolm Brogdon, Sr., Virginia 38\n\nBrice Johnson, Sr., North Carolina 9\n\nCat Barber, Jr., NC State 3\n\nGrayson Allen, So., Duke 1\n\n\n\nACC Freshman of the Year\n\nBrandon Ingram, Duke 48\n\nDwayne Bacon, Florida State 1\n\nMalik Beasley, Florida State 1\n\nMalachi Richardson, Syracuse 1\n\n\n\nACC Coach of the Year\n\nJim Larrañaga, Miami 24\n\nBuzz Williams, Virginia Tech 22\n\nTony Bennett, Virginia 2\n\nRoy Williams, North Carolina 1\n\nBrad Brownell, Clemson 1\n\nBrian Gregory, Georgia Tech 1\n\n\n\nACC Defensive Player of the Year\n\nMalcolm Brogdon, Sr., Virginia 39\n\nTonye Jekiri, Sr., Miami 9\n\nMichael Gbinije, Sr., Syracuse 1\n\nMarshall Plumlee, Sr., Duke 1\n\nChinanu Onuaku, So., Louisville 1\n\n\n\nACC Most Improved Player of the Year\n\nJaron Blossomgame, Jr., Clemson 21\n\nGrayson Allen, So., Duke 15\n\nCat Barber, Jr., NC State 4\n\nZach LeDay, Jr., Virginia Tech 4\n\nJa'Quan Newton, So., Miami 2\n\nJoel Berry, So., North Carolina 2\n\nMarcus Georges-Hunt, Sr., Georgia Tech 1\n\nDennis Clifford, Sr., Boston College 1\n\nChinanu Onuaku, So., Louisville 1\n\n\n\nACC Sixth Man of the Year\n\nIsaiah Hicks, Jr., North Carolina 19\n\nJa'Quan Newton, So., Miami 12\n\nLuke Kennard, Fr., Duke 7\n\nTyler Lydon, Fr., Syracuse 6\n\nDevon Bookert, Sr., Florida State 6\n\nSheldon Jeter, Jr., Pittsburgh 1\n\n\n\n* Unanimous selection"}, {"url": "https://www.streakingthelawn.com/2016/3/6/11169726/2016-acc-basketball-player-of-the-year-malcolm-brogdon-virginia", "page_content": "Virginia basketball guard Malcolm Brogdon has been named the league's player of the year and defensive player of the year for 2015-16 by the Atlantic Coast Sports Media Association.\n\nIt's the first time in the 60-plus year history of the ACC that the conference's player of the year has also been named the defensive player of the year.\n\nBrogdon averaged a team-high 18.4 points per game, along with 2.8 assists (second on the team) and 4.2 rebounds (tied for second).\n\nThe game between the Cavaliers and North Carolina on Feb. 27 in Charlottesville was generally expected to be the determining factor in whether the award went to Brogdon or UNC's Brice Johnson. Brogdon rose to the occasion, scoring 26 points on 9-16 shooting with three made three-pointers, compared to Johnson's 12 points and 7 rebounds.\n\nBrogdon is Virginia's first player to receive the prestigious player of the year honor since Ralph Sampson did so in 1983. Sampson did so the two prior years as well, and Barry Parkhill also earned the award in 1972. Virginia's Darion Atkins won the ACC Defensive Player of the Year honor last year as well.\n\nBrogdon currently sits at 1,687 career points, good enough for 12th on the all-time career list at UVa, after passing J.R. Reynolds on Saturday. He needs 71 to pass Curtis Staples and enter the top 10.\n\nThe award is a fitting culmination to Brogdon's fifth year on Grounds. After choosing UVa over Harvard against his mother's advice, he broke his foot his first year. In response, he entered the University's leadership school and is on track for a Master's degree after getting his Bachelor's last May. He was awarded a spot to live on the Range this year as well, but throughout, he stayed true to his modest roots, earning the moniker \"Humble Moses\" from teammates - a nod to his middle name. Although the Atlanta native's spot as arguably Virginia's best player since Sampson has been cemented, it wouldn't be a surprise for the next month to hold in store what Brogdon assuredly wants most - one more ACC tournament title and the school's first national championship in the sport."}, {"url": "https://www.sportskeeda.com/basketball/malcolm-brogdon", "page_content": "Malcolm Brogdon: A Brief Biography\n\nBorn on December 11, 1992, Malcolm Moses Adams Brogdon is an American professional basketball player. He plays shooting guard or point guard in the National Basketball Association. Brogdon entered the NBA in 2016 when he was picked by the Milwaukee Bucks in the 2016 NBA draft. Currently, he is playing for the Boston Celtics. Malcolm played college basketball for the Virginia Cavaliers. In 2016, he won the Atlantic Coast Conference Player of the Year and Defensive Player of the Year. Brogdon also won NBA Rookie of the Year and NBA All-Rookie First Team in 2017.\n\n\n\n\n\nMalcolm Brogdon\n\n\n\n\n\nMalcolm Brogdon Early Life\n\n\n\n\n\nMalcolm Brogdon took birth in a family of studious people on December 11, 1992. He belongs to the Christian community and African-American ethnicity. His father, Mitchell Gino Brogdon, is a lawyer and mediator. Malcolm’s mother, Dr. Jann Adams, is a former chairperson in the psychology department of Morehouse college. Malcolm Brogdon attended Greater Atlanta Christian School and later moved to Virginia to play college basketball under Tony Bennett. Brogdon was named the Atlantic Coast Conference Player of the Year along with the Defensive Player of the Year in the same season.\n\n\n\n\n\nMalcolm Brogdon NBA Journey\n\n\n\n\n\nMalcolm Brogdon was picked by the NBA franchise Milwaukee Bucks on June 23, 2016 in the 2016 NBA draft. He signed an agreement with the team on July 30. On October 26, 2016, Malcolm witnessed his debut game in the NBA and for the Bucks in the season opener. He attained 8 points and 5 assists in a game against the Charlotte Hornets. Brogdon recorded his first career triple-double with 15 points, 11 rebounds and 12 assists on December 31, 2016 in a win against the Chicago Bulls. In January 2017, Malcolm was included in the US Team for the 2017 Rising Stars Challenge.\n\n\n\n\n\nFurther, Malcolm registered 19 points in a win over the Celtics in the Bucks’ season opener on October 18, 2017. On April 9, 2018, Malcolm returned to action after overcoming injury issues and scored two points in his team’s success against the Orlando Magic.\n\n\n\n\n\nIn the 2018-19 season, Malcom scored 24 points in 29 minutes against the Chicago Bulls on November 28, 2018. It was the best shooting year for the athlete and one of the most efficient in NBA history as well. Brogdon became just the 8th NBA player to achieve the feat of a 50-40-90 season. Malcolm Brogdon moved to the Indiana Pacers and signed a contract with the Pacers on July 6, 2019.\n\n\n\n\n\nHe scored 33 points and 7 assists on January 2, 2021 in a losing game against the New York Knicks. He proceeded to record 21 points, 7 rebounds, 11 assists and three steals in an overtime win over the New Orleans Pelicans. He put up a career-high 35 points and 7 assists in a win (114-107) over the Houston Rockets. Incredibly, Brogdon improved his career-high to 36 points on January 25 in a win against the Toronto Raptors. Later, he missed 41 games from December to April due to Achilles pain.\n\n\n\n\n\nNow was the time for the athlete to leave the Pacers and join the Boston Celtics. The Celtics traded him in exchange for Daniel Theis, Malik Fitts, Juwan Morgan and Aaron Nesmith. He scored 16 points off the bench in his debut for the Celtics in a win over the 76ers. He also gained a season-high 30 points against the Charlotte Hornets. During the time of his involvement in the Celtics, Malcolm was given the choice of Toronto Raptors and the Celtics.\n\n\n\n\n\nMalcolm Brogdon Education\n\n\n\n\n\nMalcolm Brogdon joined Greater Atlanta Christian in Georgia. After that, she chose to join Virginia to play college basketball. He selected Virginia among other (Georgia, Notre Dame, and Arkansas) options. During his college career, Malcolm accomplished plenty of awards, honors and prominence on the court. He was a Consensus First-Team All-American, Atlantic Coast Conference Player of the Year and Defensive Player of the Year.\n\n\n\n\n\nBrogdon redshirted his sophomore year after sustaining a serious foot injury. With 12.7 points, 5.4 rebounds, and 2.7 assists per game in the 2013-14 season, Brogdon was admired as one of the top contributors to the team’s success. He was also named to the 35-man midseason watchlist for the Naismith Trophy as a senior at Virginia in 2015-16.\n\n\n\n\n\nMalcolm Brogdon Championship\n\n\n\n\n\nAfter observing successful years at the college level, Malcolm Brogdon got the chance to play in the NBA. The Milwaukee Bucks picked him in the 2016 NBA draft. He came under an agreement with the franchise on July 30, 2016. Malcolm played his debut NBA game against the Charlotte Hornets on October 26. In 2019, Malcolm Brogdon shifted to the Indiana Pacers and signed a four-year contract worth 85 million US dollars.\n\n\n\n\n\nHe stayed with the new franchise till 2022 before joining the Boston Celtics in July 2022. Meanwhile, Malcolm also represented the United States national team at the 2015 Pan American Games. He went on to acquire a bronze medal at the competition. Since his enrollment in the NBA, Malcolm Brogdon is yet to become an NBA champion, however.\n\n\n\n\n\nMalcolm Brogdon Awards and Achievements\n\n\n\n\n\nThe game of basketball has earned multiple awards, honors and achievements for Malcolm Brogdon. He was named Defensive Player of the Year and Atlanta Coast Conference Player of the Year in the same year. The following table is showing various awards and accomplishments Brogdon has achieved in his career till now:\n\n\n\n\n\nAwards/Achievements Year NBA Rookie of the Year 2017 NBA All-Rookie First Team 2017 J. Walter Kennedy Citizenship Award Winner 2020 50-40-90 club 2019 Consensus First-Team All-American 2016 Consensus Second-Team All-American 2015 NABC Defensive Player of the Year 2016 ACC Player of the Year 2016 3-time First-Team All-ACC 2014, 2015, 2016 2-time ACC Defensive Player of the Year 2015, 2016\n\n\n\n\n\nMalcolm Brogdon\n\n\n\n\n\nMalcolm Brogdon Net Worth\n\n\n\n\n\nMalcolm Brogdon joined the NBA in 2016 when he was picked by the Milwaukee Bucks in the 2016 NBA draft. He started his professional career with minimal contracts but raised his value over time. He received a massive contract with his second NBA franchise, the Indiana Pacers. After that, Brogdon moved to the Boston Celtics in 2022 to represent the team in the NBA.\n\n\n\n\n\nAs of 2023, the net worth of Malcolm Brogdon is estimated to be 20 million US dollars. He made small fortunes during his initial few years but it changed dramatically after Malcolm started showing his skills as a rookie.\n\n\n\n\n\nMalcolm Brogdon Contract\n\n\n\n\n\nMilwaukee Bucks was the first NBA franchise that gave Brogdon a chance to play in the NBA. He joined the team in 2016. Later in 2019, Malcolm went on to join the Indiana Pacers. He came under a four-year agreement worth US$85 million. In the meantime, he made a contract extension with the same franchise for US$45 million.\n\n\n\n\n\nMalcolm Brogdon Family\n\n\n\n\n\nMalcolm Brogdon was born to a Christian family. His father (Mitchell Gino Brogdon) is a lawyer and mediator. He is also best known as a host of the syndicated court show President Injury Court. Malcolm’s mother (Dr. Jann Adams) is the former chairperson in the psychology department of Morehouse College. Currently, she is the associate dean of science and math. When Malcolm Brogdon was 11, his parents divorced. He also has two siblings (brothers). The oldest brother Gino Brogdon is a practicing attorney and his second older brother John Brogdon is in law school.\n\n\n\n\n\nMalcolm Brogdon Girlfriend\n\n\n\n\n\nMalcolm Brogdon’s girlfriend is Victoria Janowski. She was a volleyball player at Virginia University. Also, Victoria is the vice-chairperson of the Black Student Alliance athletic council at the University of Virginia. Both Malcolm and Janowski are very supportive of each other.\n\n\n\n\n\nMalcolm Brogdon Dad\n\n\n\n\n\nMalcolm Brogdon’s father’s name is Mitchell Gino Brogdon. He is a lawyer and mediator by profession. Significantly, his father is popularly known as a host of the syndicated court show Personal Injury Court.\n\n\n\n\n\nMalcolm Brogdon Shoe\n\n\n\n\n\nThe Boston Celtics’ point guard had more unusual sneaker habits in the NBA. Malcolm preferred the Nike KD 9 shoes. It is even years after the emergence of KD 10, 11, or even 12. Currently, Malcolm Brogdon is now wearing Nike Zoom Freak 1. It is the signature shoe of his former superstar teammate’s brand.\n\n\n\n"}, {"url": "https://theathletic.com/4434987/2023/04/21/celtics-malcolm-brogdon-sixth-man-year/", "page_content": "Malcolm Brogdon came to the Celtics with one mission in mind. After several up-and-down years running a middling Pacers team, he was ready to take a step back for his career to move forward.\n\n“I’m looking to win a championship, that’s actually it,” Brogdon told The Athletic the day he was traded. “In the past, I’ve worried about stats and numbers and all that. I’m going to Boston and not worrying about that.”\n\nAdvertisement\n\nBrogdon must have been playing a little reverse psychology with fate because he ended up having the best shooting season of his career on one of the best teams in the NBA.\n\nNow he is the NBA’s Sixth Man of the Year.\n\nYet when The Athletic asked Brogdon about the prospect of winning the award on Tuesday, he did exactly what he pledged to do at the beginning of the year and make it all about the team.\n\n“It would be huge. All these awards are team awards,” Brogdon said. “It takes a team for anybody to get an award because there’s always five guys on the floor. It would be great for the organization, the Celtics, to have me win the award.”\n\nThis is an organization synonymous with the award. Red Auerbach pioneered the role having Hall of Famer John Havlicek come off the bench during the ’60s title years, then Kevin McHale won the award twice before ascending to the starting lineup and eventually the Hall of Fame. The last Celtic to win the award was Hall of Famer Bill Walton, who moved to the bench on the fabled ’86 title team.\n\nThere’s a persistent theme in Boston that this role belongs to someone who is willing to truly sacrifice. The award’s trophy is named after Havlicek, after all.\n\nJoe Mazzulla describes his sixth man as having patience, humility and understanding. It was the tone Brogdon set when he arrived, making it clear that fitting into a bigger picture was exactly what he was seeking out.\n\nIt was telling that after saying his award would be great for the organization, he went on to endorse Derrick White for the All-Defensive team, as well as Jaylen Brown and Jayson Tatum for All-NBA. Brogdon has been willing to open up a bit about his own journey at times, but he tends to turn it back to lifting his teammates.\n\nAdvertisement\n\nSo when Mazzulla was asked Thursday what it meant for Brogdon to win the award, he saw it as a reflection of the entire locker room.\n\n“It means a lot. I tell all our guys, each guy has had to sacrifice or put something aside for the betterment of this team and when you have the depth and the talent that we have, you can’t be in the position that we are without it,” Mazzulla said. “I thought Malcolm, taking on the identity of the second unit, dealing with the patience of sometimes finishing halves, sometimes not, sometimes finishing games, not finishing games, I thought he just handled it with an open mind.”\n\nBrogdon’s experience in Indiana made him realize he wasn’t a number one option on a winning franchise, but he was still capable of carrying a large responsibility in a more ambitious program.\n\nBut that required putting aside his pride in the moments when he is used to taking charge.\n\n“There’s a lot of egos. Even on a team full of good guys, there’s ego,” Brogdon said earlier this month. “We’ve bought into Joe being our coach, we’ve bought into the game plan every night throughout the season, and we’ve bought into embracing each other. And I think that’s what’s going to pay off at the end of the day.”\n\nThe top of the roster has always been supportive of Mazzulla, but it’s the guys on the fringes who could express frustration. Brogdon is the odd man out in closing games most of the time. Mazzulla praised him for being the spearhead of the second unit, but even being the face of the backups still puts you in a tough position at times.\n\n“He handled it with a humility, regardless of what his sub pattern was or what he was doing,” Mazzulla said. “He just played and we’re grateful for that.”\n\nThe thing Mazzulla appreciated the most was how Brogdon fit in defensively. Coming from a defensive scheme in Indiana that just feeds ballhandler into the center, Brogdon has to take on a greater variety of responsibilities in Boston. That was rarely an issue and his effort in transition and on the boards has shined in the playoffs so far.\n\nAdvertisement\n\n“The defensive system we play can be unique, Mazzulla said. “It can be different than what most players have seen on other teams. So when they come here, it just takes some getting used to. It’s just his ability to adjust to our defensive scheme and really make an impact on that end of the floor has helped us.”\n\nEarlier this month, Tatum cited Brogdon as that extra ingredient that has given the team an edge over last season. There were so many moments when the Celtics just needed someone to come off the bench and just get into the defense to create some shots, but it rarely came.\n\nBut Mazzulla has been able to put the ball in Brogdon’s hands for five minutes in the middle of a half and tell him to wreak havoc. Brogdon set the tone earlier in the season as he got deep dribble penetration to free up the bench shooters, helping guys like Sam Hauser and Al Horford put up big shooting numbers.\n\nOver time, he became the isolation scorer the second unit needed when one of the Jays was getting swarmed. He was a spot-up maestro on the wings and even became a knockdown pick-and-roll scorer for the first time in years. He ended up averaging 14.9 points per game off the bench and shooting 44.4 percent from deep, a career-high and fourth-best in the NBA.\n\n“It’s tough coming off the bench, I’m sure. It’s been a process for him,” Brown said in early April. “I think this is probably the first time he’s ever been asked or ever had to come off the bench in his career, and he’s accepted that role and he’s been great.”\n\nBrogdon finished with 408 voting points and 60 of the 100 first-place votes, 26 first-place votes ahead of New York Knicks guard Immanuel Quickley. The Knicks guard’s 38-point performance in a Knicks win in Boston in early March catapulted him into a tight race with Brogdon for the award, but Quickley’s 24 starts — which led to a lot of his biggest games later in the season — appeared to weigh against him as Brogdon never started this year. Milwaukee’s Bobby Portis finished a distant third with 97 voting points.\n\nIt was apparent in this year’s finalists that playing a key role on a winner was the paramount qualification for the award. Quickley helped the Knicks reinvent themselves midseason. Portis was a persistent contributor on the league’s top team as he stepped up with Giannis Antetokounmpo missing 19 games. Brogdon was more the icing on the cake for this Celtics team, but he was a big reason their lulls never turned into anything bigger.\n\nAdvertisement\n\nNow through all the grand ups and moderate downs they faced all year, the Celtics are up 2-0 in the first round and looking as good as ever. So winning this award now is a treat for Brogdon, but it’s not why he came to Boston.\n\n“(It’s) definitely another great award, another accolade to add on to this year,” Brogdon said. “Hopefully we can get the big accolade at the end of the year.”\n\n(Photo: Maddie Meyer / Getty Images)"}]}