{"Evan Rachel Wood's birth date is September 7, 1987.": [{"url": "https://www.encyclopedia.com/education/news-wires-white-papers-and-books/wood-evan-rachel-1987", "page_content": "Wood, Evan Rachel 1987–\n\n(Evan Wood)\n\nPERSONAL\n\nBirth name, Evan Rachael Wood; born September 7, 1987, in Raleigh, NC; daughter of Ira David III (founder and executive director of Theatre in the Park, Raleigh, NC) and Sara Lynn (an actress; maiden name, Moore) Wood. Education: Trained as a dancer. Avocational Interests: Singing, swimming, rollerblading, horseback riding, and Tae Kwon Do (a black belt).\n\nAddresses: Agent—ICM, 8942 Wilshire Blvd., Beverly Hills, CA 90211. Publicist—I/D PR, 8409 Santa Monica Blvd., West Hollywood, CA 90069; Baker/Winokur/Ryder, 9100 Wilshire Blvd., 6th Floor, West Tower, Beverly Hills, CA 90212.\n\nCareer: Actress. Sometimes credited as Evan Wood.\n\nAwards, Honors: YoungStar Award nomination, best performance by a young actress in a miniseries/made for TV film, 1999, for Down Will Come Baby; Young Artist Award nomination, best performance in a feature film—supporting young actress, 1999, for Practical Magic; Young Artist Award nomination, best performance in a TV drama series—supporting young actress, 2000, for Profiler; YoungStar Award nomination, best young actress/performance in a drama TV series, 2000, Young Artist Award (with others), best ensemble in a TV series, 2001, for Once and Again; Young Hollywood Award, one to watch—female, 2002; Young Artist Award nomination, best performance in a feature film—leading young actress, 2003, for Little Secrets; Special Mention, Bratislava International Film Festival, 2003, Golden Globe Award nomination, best performance by an actress in a motion picture—drama, Broadcast Film Critics Association Award nomination, best young actor/actress, Screen Actors Guild Award nomination, outstanding performance in a feature film—leading young actress, Prism Award, performance in a theatrical feature film, Phoenix Film Critics Society Award, breakout performance—one screen, MTV Movie Award nomination, breakthrough female performance, Sierra Award, youth in film, Las Vegas Film Critics Society, Golden Satellite Award nomination (with Nikki Reed), best performance by an actress in a motion picture, 2004, all for Thirteen; Young Artist Award nomination, best performance in a feature film—leading young actress, 2004, all for The Missing.\n\nCREDITS\n\nFilm Appearances:\n\nHarriet Frankovitz, Digging to China, The Ministry of Film Inc., 1997.\n\nKylie Owens, Practical Magic, Warner Bros., 1998.\n\nDaniella Rogers, Detour (also known as Too Hard to Die), October Films, 1999.\n\nEmily Lindstrom, Little Secrets, Samuel Goldwyn, 2001.\n\nLainey Christian, S1m0ne, New Line Cinema, 2002.\n\nTracy Louise Freeland, Thirteen, Twentieth Century-Fox, 2003.\n\nLilly Gilkeson, The Missing, Sony Pictures Entertainment, 2003.\n\nHerself, New Frontiers: Making \"The Missing\" (documentary), 2004.\n\nKimberly, Pretty Persuasion, 2005.\n\nLavender \"Popeye\" Wolfmeyer, The Upside of Anger, New Line Cinema, 2005.\n\nTobe, Down in the Valley, Element Films, 2005.\n\nTelevision Appearances; Series:\n\nSecond Chloe Waters, Profiler, NBC, 1998–99.\n\nJesse Sammler, Once and Again, ABC, 1999–2002.\n\nTelevision Appearances; Movies:\n\nLittle Susie, In the Best of Families: Marriage, Pride & Madness (also known as Bitter Blood), 1994.\n\nYoung Sarah, Search for Grace, 1994.\n\nTessa, A Father for Charlie (also known as High Lonesome), CBS, 1995.\n\nAnna, Death in Small Does, 1995.\n\nJamie (age 8), Get to the Heart: The Barbara Mandrell Story, CBS, 1997.\n\nRobin Carr, Down Will Come Baby, CBS, 1999.\n\nTelevision Appearances; Specials:\n\nPresenter, Nickelodeon's \"16th Annual Kids' Choice Awards,\" Nickelodeon, 2003.\n\nPresenter, The 9th Annual Prism Awards, E! Entertainment Television, 2004.\n\nThe 8th Annual Prism Awards, F/X, 2004.\n\nPresenter, The 2004 MTV Movie Awards, MTV, 2004.\n\nHerself, The Independent Spirit Awards Nomination Show, Independent Film Channel, 2004.\n\nThe 10th Annual Critics' Choice Awards, The WB, 2005.\n\nTelevision Appearances; Episodic:\n\nRose Russell, \"Eye of the Beholder,\" American Gothic, CBS, 1995.\n\nRose Russell, \"To Hell and Back,\" American Gothic, CBS, 1996.\n\nRose Russell, \"Potato Boy,\" American Gothic, CBS, 1998.\n\nSarah, \"Pandora's Box,\" Touched by an Angel, CBS, 2000.\n\nHogan Cregg, \"The Black Vera Wang,\" The West Wing, NBC, 2002.\n\nHerself, E! News Daily, E! Entertainment Television, 2002.\n\nNora Easton, \"Got Murder?,\" CSI: Crime Scene Investigation (also known as C.S.I.), CBS, 2003.\n\nHerself, The Sharon Osbourne Show, syndicated, 2003.\n\nThe View, ABC, 2003.\n\nHerself, Punk'd, MTV, 2004.\n\nHerself, Real Access, 2004.\n\nStage Appearances:\n\nAppeared in The Miracle Worker; A Midsummer Night's Dream; toured in A Christmas Carol.\n\nRECORDINGS\n\nAlbums:\n\nSang \"Christmas Isn't Christmas\" and \"Silver and Gold,\" School's Out."}, {"url": "https://www.daysoftheyear.com/birthdays/evan-rachel-wood/", "page_content": "Quick facts Age 35 Star sign Libra (♎) Chinese year Rabbit (兔) Professions Actress, Singer, Activist, Model Nationality United States (US) Have we missed something?\n\nEvan Rachel Wood was born on September 7, 1987, in Raleigh, North Carolina. Coming from a family of artists, Evan started acting when she was only a few months old. Her mother (Sara Lynn Moore) is an acting coach, and her father, Ira David Wood III, is a prominent theater director in Raleigh.\n\nEvan grew up in the Jewish faith; in an Instagram post, she said, “My mother was Jewish, and I was raised in religion.” She grew up with her siblings Aden, Dana, Thomas, and Ira David Wood IV, also an actor.\n\nWood was involved in theater at a young age. She played Helen Keller alongside her mother, who played the starring role of Anne Sullivan, in her father’s theatrical production of The Miracle Worker. Wood’s parents later split, and she moved with her mother to Los Angeles, California, with the dream of pursuing her acting career.\n\nEvan Rachel Wood’s screen career started in 1994 when she first appeared in the series American Gothic (1995) and Profiler (1998). At ten years old, her first major screen role was in the film Digging China (1997). In the subsequent year, Wood starred in Practical Magic (1998) alongside Sandra Bullock and Nicole Kidman.\n\nAs a teenager, Wood appeared in various movies and series like Downhill Come Baby (1999), the American comedy-drama family film, Little Secrets (2001), and Simone (2002), among others. She was also featured in Vanity Fair and Vogue magazines and was named one of the “It Girls” in Hollywood.\n\nAs a young actress, Wood starred in several hit movies alongside other famous actors. She acted alongside Al Pacino in Simone, The Missing (2003) with Cate Blanchett and Tommy Lee Jones, and The Upside of Anger (2003) next to Joan Allen and Kevin Costner. Woods’s performance in the hit TV series Westworld (2016-) was praised as “spectacular” by critics. In 2019, she lent her vocal talents to the role of Queen Iduna in Disney’s Frozen II.\n\nBesides acting, Wood has a passion for music. She is the lead singer for the band Evan + Zane. Wood also starred in music videos for At the Bottom of Everything by Bright Eyes and Wake Me Up When September Ends by Green Day. As a child, Woods’ passion for acting was inspired by David Bowie, an English singer-songwriter and actor. In her tribute to the late Bowie, she said, “I didn’t grow up in a super-religious household. Religion was more about tradition than a spiritual practice, but I didn’t mind at all. My religion was art. Most importantly, music. And Bowie was my god. ”\n\nOn a personal level, Rachel Wood has openly declared that she is bisexual. The mother of one is an LGBTQ+ activist and is also passionate about supporting immigrant families. She is also known for her impeccable taste in fashion.\n\nEvan Rachel Wood boasts a long list of awards, including Emmy nominations for Best Lead Actress, Drama Series (2017 and 2018), and an Emmy award for Outstanding Supporting Actress in a Miniseries or a Movie for HBO’s Mildred Price (2011)."}, {"url": "https://nationaltoday.com/birthday/evan-rachel-wood/", "page_content": "Background\n\nEvan Rachel Wood was born on September 7, 1987, in Rayleigh, California, to Ira David Wood III and Sarah Lynn Moore. Sarah, Wood’s mother, is an acting coach, actress, and director; her father is also an actor. When Wood’s parents separated in 1997, she moved to Los Angeles with her mom, who converted to Judaism. At 12, Wood quit school because she was being bullied. Her experiences nudged her towards learning taekwondo, which she pursues to this day. Wood received her high school diploma when she was 15.\n\nBeing born into a family of actors meant Wood was exposed to acting and stage plays from a young age. Her father even cast her and her mother in a theater production of a Christmas carol titled “The Miracle Worker.” However, Wood’s first screen appearance came in a movie titled “Digging to China” (1998), and her first big break came in “Little Secrets” (2001), where she played the protagonist. Wood received a Golden Globe Award nomination for Best Actress for the film “Thirteen” in 2003. Three years later, she was awarded the Spotlight Award for Emerging Talent by “Premiere Magazine.” In 2009, Wood appeared in “Whatever Works.” She also appeared in seasons two and three of H.B.O.’s “True Blood” — a drama series about vampires and other supernatural beings. She has also starred in many other films and series since then, such as “The Conspirator” (2011), “Mildred Pierce” (2011), and “Charlie Countryman” (2013). Recently, she played the voice of Queen Iduna in “Frozen II” (2019).\n\nWood was raised as a Jew by her mother and once publicly said, “I believe in God and my definition of God is very personal.” In 2007, her relationship with singer Marilyn Manson became public as she appeared in Manson’s ‘Heart-shaped Glasses,’ a song widely believed he wrote for her. However, by 2010, their relationship had hit the rocks with allegations of rape and abuse made by Wood against Manson. She married Jamie Bell in 2012. They had a child before splitting in 2014."}, {"url": "https://www.astrotheme.com/astrology/Evan_Rachel_Wood", "page_content": "You will find below the horoscope of Evan Rachel Wood with her interactive chart, an excerpt of her astrological portrait and her planetary dominants.\n\nN. B.: when the birth time is unknown, (12:00 PM (unknown)), these portrait excerpts do not take into account the parameters derived from the time, which means, the domification (Ascendant, astrological houses, etc.). Nonetheless, these analyses remain accurate in any case. Regarding the sources of the birth data in our possession, kindly note that the pages we publish constitute a starting point for more detailed research, even though they seem useful to us. When the sources are contradictory, which occurs rarely, after having analysed them, we choose the most reliable one. Sometimes, we publish a birth date just because it is made available, but we do not claim that is it the best one, by no means.\n\nObviously, the danger is that you may rush headlong against a wall of insurmountable difficulties and act impulsively or thoughtlessly. It is important that you moderate your natural impetuosity as often as possible. Beware of untimely fits of anger!\n\nYou belong to the category of people who never give up when they are facing hurdles. On the contrary, challenges stimulate you. You are particularly exhilarated whenever a new element emerges or when you are dealing with an unprecedented context.\n\nFire implies dynamism and contagious warmth. You are a passionate person who gives a touch of intensity and unrelenting tension to every element of your life. One can only praise your energy and notice your presence. .\n\nYou have a deep affinity with the agent Fire. In China, this element corresponds to the planet Mars, the red colour and the number 7.\n\nYou have the reputation of being distant and sometimes indifferent. Actually, you are protecting your own balance through a course of action that is not connected with prevailing vicissitudes. Your strength lies in your undeniable stability. Fashion, trends or hurdles cannot overcome your unwavering will to live according to your inner certainties. The reed may bend but it does not break. This is the subtlety of this animal!\n\nHowever, your serenity hides an unshakeable determination, a will to allow no one to influence your decisions. You don't let people meddle in your privacy. Although you elicit confidences from an entourage eager for wisdom, you carefully avoid getting involved in other people's problems.\n\nBesides, you loathe violence and you seek a harmonious and peaceful lifestyle. You are shrewd and inventive and in many instances, you demonstrate your ability to take advantage of events without claiming to influence their unfolding. It is better for you to adjust to the context than to clash head-on with your interlocutors!\n\nIn East Asia, the Rabbit is also known as the Cat. Since you are a diplomat, you know better than anyone how to avoid any possible attacks and get round problems. You play your game well, even in difficult situations, and you never get involved in meaningless confrontations.\n\nThe Asian wise man considers that a path is neither good nor bad. One can and must develop one's potentialities. The first step is to thoroughly know oneself.\n\nChinese astrology is brought to us as a legacy of age-old wisdom and invites us to develop an awareness of our inner potential. It is believed that the wise man is not subjected to stellar influences. However, we must gain the lucidity and the distance without which we remain locked up in an implacable destiny. According to the legend of the Circle of Animals, Buddha summoned all the animals to bid them farewell before he left our world. Only twelve species answered Buddha's call. They form the Chinese Zodiac and symbolize the twelve paths of wisdom that are still valid nowadays.\n\nYour Life Path is influenced by the number 5, Evan Rachel, which indicates changing and off the beaten track destinies. Your activities are varied and placed under the sign of adaptability, and multiplication of resources. More than anyone else, you need to enhance your learning capacities and the broad-mindedness. You must cope as well as you can with changes and transformation occurring in your life. Indeed, Life Path 5 brings about destinies which are prone to twists and turns, as well as to upheavals. Therefore, your life's main orientation may vary considerably at certain stages, and if your destiny is that of adventurers whose course is fraught with obstacles, it may also turn you into an exceedingly unstable person through lack of nuance. You accumulate experiences and enrich your know-how with each crucial period. Your adaptation skills enable you to go through all the successive stages of your life without ever being destabilised by new situations.\n\nThe path of life, based on the date of birth, provides indications on the kind of destiny which one is meant to experience. It is one of the elements that must reckoned with, along with the expression number, the active number, the intimacy number, the achievement number, the hereditary number, the dominant numbers or the lacking numbers, or also the area of expression, etc.\n\nTestimonies to numerology are found in the most ancient civilizations and show that numerology pre-dates astrology. This discipline considers the name, the surname, and the date of birth, and ascribes a meaning to alphabetic letters according to the numbers which symbolise them.\n\nRegarding the latter, it must be remembered that even a monster or at least a person who perpetrated odious crimes, has some human qualities, often noticed by his/her close entourage: these excerpts come from computer programmes devoid of polemical intentions and may seem too soft or lenient. The positive side of each personality is deliberately stressed. Negative sides have been erased here - it is not the same in our comprehensive reports on sale - because it could hurt the families of such people. We are hoping that it will not rebound on the victims' side.\n\nWarning: In order to avoid any confusion and any possible controversy, we want to draw your attention upon the fact that this sample of celebrities is very complete and therefore, it also includes undesirable people, since every category is represented: beside artists, musicians, politicians, lawyers, professional soldiers, poets, writers, singers, explorers, scientists, academics, religious figures, saints, philosophers, sages, astrologers, mediums, sportsmen, chess champions, famous victims, historical characters, members of royal families, models, painters, sculptors, and comics authors or other actual celebrities, there are also famous murderers, tyrants and dictators, serial-killers, or other characters whose image is very negative, often rightly so.\n\nPrecision: concerning the horoscopes with a known time of birth, according to the Tradition, we consider that a planet near the beginning (called cuspide) of the next house (less than 2 degrees for the Ascendant and the Midheaven, and less than 1 degree for all other houses) belongs to this house: our texts and dominants take this rule into account. You can also choose not to take this shift into account in the form, and also tick the option Koch or Equal houses system instead of Placidus, the default houses system.\n\nPlanets represent typologies of our human psychology: sensitivity, affectivity, ability to undertake, will-power, mental process, aptitude, and taste for communication etc., all independent character facets are divided here for practical reasons. The twelve signs forming the space where planets move will \"colour\", so to speak, these typologies with each planet being located in its particular sign. They will then enrich the quality of these typologies, as expressed by the planets. The Zodiac is also divided into twelve astrological houses. This makes sense only if the birth time is known because within a few minutes, the twelve houses (including the 1st one, the Ascendant) change significantly. They correspond to twelve specific spheres of life: external behaviour, material, social and family life, relationship, home, love life, daily work, partnership, etc. Each planet located in any given house will then act according to the meaning of its house, and a second colouration again enriches those active forces that the planets symbolize. Finally, relations will settle among planets, creating a third structure, which completes the planets' basic meanings. A set of ancient rules, which has stood the test of experience over hundreds of years (although astrology is in evolution, only reliable elements are integrated into classical studies), are applied to organize the whole chart into a hierarchy and to allow your personality to be interpreted by texts. The planets usually analysed are the Sun, the Moon, Mercury, Venus, Jupiter, Saturn, Uranus, Neptune and Pluto, which means two luminaries (the Sun and the Moon) and 8 planets, a total of 10 planets. Additional secondary elements may be taken into account, such as asteroids Chiron, Vesta, Pallas, Ceres (especially Chiron, more well-known), the Lunar nodes, the Dark Moon or Lilith, and even other bodies: astrology is a discipline on the move. Astrological studies, including astrological portrait, compatibility of couples, predictive work, and horoscopes evolve and become more accurate or deeper, as time goes by.\n\nThe analysis of an astrological portrait consists in understanding four types of elements which interact with one another: ten planets, twelve zodiacal signs, twelve houses, and what are called aspects between planets (the 11 aspects most commonly used are: conjunction, opposition, square, trine, sextile, quincunx, semi-sextile, sesqui-quadrate, quintile and bi-quintile. The first 5 aspects enumerated are called major aspects).\n\nAstrological reports describe many of the character traits and they sometimes go deeper into the understanding of a personality. Please, always keep in mind that human beings are continuously evolving and that many parts of our psychological structures are likely to be expressed later, after having undergone significant life's experiences. It is advised to read a portrait with hindsight in order to appreciate its astrological content. Under this condition, you will be able to take full advantage of this type of study.\n\nThis text is only an excerpt from of Evan Rachel Wood's portrait. If you want to get your own astrological portrait, much more comprehensive that this present excerpt, you can order it at this page . Do you belong to the Jupiterian type, benevolent and generous? The Martian type, active and a go-getter? The Venusian type, charming and seductive? The Lunar type, imaginative and sensitive? The Solar type, noble and charismatic? The Uranian type, original, uncompromising and a freedom-lover? The Plutonian type, domineering and secretive? The Mercurian type, cerebral, inquiring and quick? The Neptunian type, visionary, capable of empathy and impressionable? The Saturnian type, profound, persevering and responsible? Are you more of the Fire type, energetic and intuitive? The Water type, sentimental and receptive? The Earth type, realistic and efficient? Or the Air type, gifted in communication and highly intellectual? 11 planetary dominants and 57 characteristics are reviewed, quantified, and interpreted; then, your psychological portrait is described in detail, in a comprehensive document of approximately 32-36 pages, full of engrossing and original pieces of information about yourself.\n\nYou may focus all your energy into your ideal, Evan Rachel Wood, be it political, religious, ethical, moral or, under its highest form, spiritual. Several areas may be involved simultaneously. Taking action with all your heart may reveal a definite taste for dialectics, and you will not rest until... (excerpt)\n\nEvan Rachel Wood, you skilfully make use of your energy and you are like the arrow that reaches its target with great precision: with piercing eye and sharp mind, you take action meticulously and efficiently. Like the surgeon with his scalpel, you know exactly what you want and you belong to the category of specialists, not the generalists. Critical, pernickety, extremely organized, you want to foresee and to analyze. You prefer to master your business too well rather than not enough, even if you must put a huge, sustained, long lasting effort into it. Sexually, you remain fanatical about cleanliness. You may be prone to fantasies such as fetishism. Your love life is fine if you avoid the unforeseen events that you loathe.\n\nEvan Rachel Wood, early in life, you apply to yourself the saying \"No man is a prophet in his own country\". Since you were a little girl, you had the impression that something in you was different and could not be understood by your close friends. Your natal... (excerpt)\n\nYou may marry twice or you may have a secret love affair, in spite of your seriousness, because Virgo is a dual sign, like Gemini, Pisces and Sagittarius.\n\nYou are fond of changes, variety and humour and you attach a special importance to your partner\u0092s comments and attentions.\n\nOnce you understand this principle, you will become the best wife, meticulous, tidy, but warm and withdrawn, caring for your family\u0092s well being and perfectly tackling your children\u0092s minor health problems. Your concern for tidiness and cleanliness allows you to have a healthy, safe and refined home.\n\nIn love, Madam, you are discreet, modest and intellectual. You may experience love only in the second part of your life if you do not make the effort to become aware that feelings and sexuality don\u0092t fare well with excessive reflection and prudence. In this area, one must not rely on reason\n\nAs you are born under this sign, you are cerebral, clear-sighted, focused on details and on numbers, analytic, serious, competent, reasonable, modest, tidy, organized, spruce, industrious, provident, honest, loyal, reserved, shy, helpful, willing to progress, talkative, perfectionist, logical, hardworking, tactful, patient, precise, concrete, spiritual. You can also be narrow-minded, calculating, irritating, petty, pernickety, hung up, anxious, cold, repressed or sarcastic.\n\nPsychologically speaking, your nature is nervous and secondary. Before you take action, you cautiously ponder over things and you review any possible alternative and reaction. You strive systematically to find the best possible response to any given problem. You are a perfectionist above all and you have no rest until you optimize a situation, in each and every area, be it professional, pragmatic, aesthetic or in pleasure. You do not accept spontaneity and, to fully enjoy life and go further, you consider that demanding the best is the least you can do, even though it is detrimental to the rough force associated with your instinct. The intellectual element intervenes before both the physical ones and your feelings: it is one of the essential clues to understanding your personality.\n\nThe ruler of the Ascendant, Evan Rachel Wood, is Jupiter. It is located in Aries and adds a note of rapidity and impulsiveness into your chart. You have a spontaneous and enterprising side which prompts you to take action quickly and to be a pioneer. However, as a consequence of this refreshing impetuosity, you may get bored quite quickly and move on to something else if you lose your enthusiasm.\n\nThe ruler of the Ascendant, also referred to as the chart ruler, brings a few interesting nuances to the meanings provided by the Sun and the Ascendant. The sign in which the ruler of the Ascendant is posited fine-tunes the style of personality described by the Sun and the Ascendant. It may strengthen it if the sign is identical to either of them.\n\nBecause Sagittarius is a dual sign, it may happen that you marry more than once, if your needs for freedom and mobility, which are so important to you, are not fully met.\n\nOnce you calm down, you will be a wonderful wife and mother. You will set up a home and start a family where your husband and your children will move with you as often as possible during school holidays. You may also move into a different city or a different country, because of professional changes.\n\nYou are pleasant to deal with, as long as your partner accepts your desire to constantly move. You are not fussy, you are lively, with numerous centres of interest. You often take the initiative in your amorous encounters that are likely to take place during your holidays or business trips. With you, no tragedies, no complication no questioning! You fully enjoy the present moment when you are around, unless you are already in your plane, flying towards new adventures\n\nIn love, Madam, you are a whirlwind made of life and warmth. You are mobile, cheerful, extroverted, always feeling comfortable and dynamic, a freedom-lover who appreciates variety. Had you not been so sane and so benevolent, you would have been mistaken for an Amazon of the mythological era.\n\nAs you are born under this sign, you are charismatic, fiery, energetic, likeable, benevolent, tidy, jovial, optimistic, extroverted, amusing, straightforward, demonstrative, charming, independent, adventurous, straightforward, bold, exuberant, freedom-loving. But you may also be irascible, selfish, authoritarian, inconsistent, unfaithful, brutal, unreliable, reckless, tactless or unpleasant.\n\nPsychologically speaking, your nature is extroverted and independent, oriented towards expansion and sociability. You have the soul of a leader, energetic and active. Your charisma and your drive are fully integrated into the collective life. Indeed, as an action-oriented fire sign, you challenge yourself and you succeed in accomplishing the task straight away. Sagittarius is hard to follow because his spirit and his independent mind constantly prompt him to go further and higher.\n\nIf there are no tense aspects with other planets in your chart, this configuration suggests that you are prone, Evan Rachel Wood, to create a link between your career and the sentimental area, even though it may come under various guises: you may be in favour with women... (excerpt)\n\nEvan Rachel Wood, inside yourself, feelings are strong and powerful. However, you never show them before weighing up and considering all the possible consequences of your words and your actions: fieriness and spontaneousness are toned down because you cannot help controlling yourself, probably due to your modesty, your discretion or your shyness; you are frightened because you are so concerned with other people's opinion that you see passion, or expressing your feelings too quickly, as sources of danger. However, you are helpful, simple, and you do not fuss around. Reason prevails in your love life but your heart may flare up when the context is well organized and everyday life is cautiously handled with good sense, tidiness and cleanliness. Your sensitivity prompts you to avoid excesses and outbursts and this is how you think that you can achieve happiness without risk.\n\nIn your chart, the Sun and Venus are both in Virgo. With this double membership of Virgo, your affectivity is clearly selective. More than others, you need to control your affectivity and the relationship you are involved in. You sort out, you select, you observe, relentlessly, to the extent that you place yourself and your partner in a pattern where your respective role, function and raison d\u0092être are specified. Therefore, it is useless to peddle the virtues of a current, the benefits of a fashionable way to love or of trendy attitudes. You remain faithful to your principles. You prefer clarity of relationships to passionate tumults. This is probably the reason why you are credited with modesty and reserve. It is not that your affectivity is withdrawn \u0096 on the contrary, you are sensitive because you are vulnerable. However, you are distrustful of impulses that may gratuitously destabilize your relationship. You are more reliable than you are demonstrative, more loyal than exuberant, you fully express yourself within a couple based on the principle of complementarity: your partner\u0092s naturalness and spontaneity nurture your affectivity, whereas your reliability and your sense of moderation efficiently protect your couple against life\u0092s vagaries. Although it is theoretical, this pattern allows the emergence of amorous behaviours that are, by nature, too discreet or too timid.\n\nYour lively and conciliating mind is at the service of your career, Evan Rachel Wood. Your natural mobility enables you to constantly adjust and to get the positions you want. Your professional achievement is often the result of your ability to understand that the key to success is... (excerpt)\n\nYour thought process is rather slow because you need time and tranquillity to review everyone's ideas and opinions, to weigh the pros and the cons and to eventually take the most equitable decision. You reject all fanatical and extremist behaviours and you are always in search of the happy medium. Your tolerance, your sense of logic and your negotiating skills are acknowledged but your indecisiveness and your propensity to procrastinate are often criticized. Therefore, you may need to be encouraged and to be nudged into action, in order to offset your fatalistic attitude that may be likened to laziness. Do not seek other people's approval so constantly, express yourself more and take action...\n\nLively, even restless sometimes, Evan Rachel Wood, your thoughts are roaming, prolific, fluctuating: you are interested in many things and your \u0093Jack of all trades\u0094 side is part of your charm, even if you have difficulties in concentrating and completing what you start. Your emotions are particularly active during... (excerpt)\n\nYour sensitivity is all on edge, Evan Rachel Wood, and your emotions so deep, your imagination, so lively, that you are often found in the sweet realm of dreams. You create your own fantastical world with entangled fragments of current reality, romantic souvenirs and hidden hopes. Your receptiveness is so intense that it may border on mediumship or, more disturbing and rare, you may have hallucinations. Your character fluctuates according to the stimulation of the moment but in general, you are a nice person, full of gentleness and romanticism, always ready to understand and to dedicate yourself. You have real healing powers, would it be only through your ability to instinctively understand other people's sufferings. Your affective structures can be likened to a roving radar. You are vulnerable, hurt by the slightest aggression and easily influenced because you are unable to step back from people and events; therefore, you may start to be doubtful and lose the self-confidence that you so badly need to progress.\n\nAfter this paragraph about dominant planets, of Evan Rachel Wood, here are the character traits that you must read more carefully than the previous texts since they are very specific: the texts about dominant planets only give background information about the personality and remain quite general: they emphasize or, on the contrary, mitigate different particularities or facets of a personality. A human being is a complex whole and only bodies of texts can attempt to successfully figure out all the finer points.\n\nAs the 3rd house is one of the most important houses in your chart, communication plays a major role in your life or in your deep motivations: frequent short trips, open-mindedness - which may offset a lack of mutable signs for instance - listening, discussion, interest in learning, knowledge accumulation or long-term studies, etc., are all areas that greatly appeal to you and are part of your daily life.\n\nWith a prominent 10th house, your destiny's achievement may be very notable: the 10th house represents your career, your public life, and your ambitions. A good deal of your energy may thus be used to successfully implement what you have in mind. Instinctively, you are very keen to make your dreams come true. Sooner or later, you will deal with the public, and your personal achievement will go through trials and ordeals: other people and visible actions.\n\nYour 9th house being one of your most tenanted house, or at least emphasized, travels and faraway places play a major role for you: travels may take place in a symbolic sense, namely mind speculations or conceptions about political matters, philosophy, religion or spirituality, or in the literal sense, such as real long distance travels by plane. You may also spend a part of your life far from home, etc. You are driven by a kind of rebelliousness, which urges you to explore the Unknown; it may also be the call of the adventure. Besides, if the rest of your chart concurs, you may be considered as a real draught, often up hill and down dale, constantly on the lookout for exciting discoveries and new, enchanting horizons.\n\nThe 9th, 10th and 3rd houses are the most prominent ones in your birth chart. From the analysis of the most tenanted houses, the astrologer identifies your most significant fields or spheres of activity. They deal with what you are experiencing - or what you will be brought to experience one day - or they deal with your inner motivations.\n\nPisces is among your dominant signs and endows your personality with unlimited sources of emotions, dreams, imagination, and sensitivity, to the extent that you literally swim in a cloudy ocean of delightful impressions. These impressions are so intense and overwhelming that you don't really need to take action concretely, to show your dynamism or your willpower, since you already live so intensely with your feelings - you are as keen as a radar, always on the alert! That is why some people may not like your carelessness, and the lack of clarity in your opinions or actions; however they quickly notice your artistic talents, your poetic or artistic side, and your total lack of wickedness. Besides, you feel compassion for people in pain - empathy is one of your great qualities. Thanks to your flexibility, your intuition, and your generosity, you may spend an important part of your life helping others. And if you are creative or if you have well-known artistic talents, everybody will forgive your little flaws: absent-mindedness, lack of energy or of will, too dreamy temperament...\n\nSagittarius, an adventurous and conquering fire sign, is dominant in your chart: you are enthusiastic, enterprising, optimistic, very sociable, and mobile - you have itchy feet both physically and mentally. Nobody gets bored with you because you are always planning things and suggesting excursions, at least... when you are around and not already gone on a trip! Obviously, so many movements for one woman may scare people off, and some of them may even criticize your brutality or your tendency to loose your temper, but you are so warm and genuine, so expansive, isn't this a good thing? And all the more so, since your sense of humour is overwhelming...\n\nVirgo, associated with perfectionism, numbers and reason, is among your dominant signs: you inherit its sense of responsibility and tidiness, a clear mind, an unfailing logic, as well as a need to be useful and to fulfil your task to the best of your abilities. Obviously, people may think that you are too modest or reserved, suspicious or pessimistic because of your exceedingly critical mind, but aren't logic and wisdom great qualities? Of course, they are. Moreover, you keep your feet on the ground, you never behave irrationally and you are helpful and hardworking - what more can you ask for?!\n\nThus, you display some of the three signs' characteristics, a bit like a superposition of features on the rest of your chart, and it is all the more so if the sign is emphasized.\n\nIn your natal chart, the three most important signs - according to criteria mentioned above - are in decreasing order of strength Virgo, Sagittarius and Pisces. In general, these signs are important because your Ascendant or your Sun is located there. But this is not always the case: there may be a cluster of planets, or a planet may be near an angle other than the Midheaven or Ascendant. It may also be because two or three planets are considered to be very active because they form numerous aspects from these signs.\n\nAs a Lunar character, you find it difficult to control yourself, you have to deal with your moods, and you must be careful not to stay passive in front of events: nothing is handed on a plate, and although your sensitivity is rich, even richer than most people's, you must make a move and spare some of your energy for... action!\n\nOne of the consequences of your spontaneity may turn into popularity, or even fame: the crowd is a living and complex entity, and it always appreciates truth and sincerity rather than calculation and total self-control.\n\nThe Moon is one of the most important planets in your chart and endows you with a receptive, emotive, and imaginative nature. You have an innate ability to instinctively absorb atmospheres and impressions that nurture you, and as a result, you are often dreaming your life away rather than actually living it.\n\nYou have a strong artistic side, and you never neglect subjective but clear concepts such as pleasure, beauty, and also sensuality. However, sometimes to the detriment of efficiency, durability, logic, and... detachment.\n\nYour approach to things is connected to your heart, and for you, no real communication can flow if your interlocutors exude no sympathy or warmth. Cold and logical reasoning, clear thoughts and good sense are not important to you: if there is no affective bond with your environment, no connection can be established with the Venusian that you are, and nothing happens.\n\nWith Venus among your dominant planets, one of your first reflexes is... to please! Your look, your charm, and your seduction are omnipresent elements in your behaviour.\n\nYour Solarian weakness may be related to the sin of pride or to excessive authority. The frontier between pride and vanity is tenuous: be careful not to overstep it and to keep the nobleness of heart that is part of your charm.\n\nOne of the dominant planets in your birth chart is the Sun. He symbolizes will, magnetism, sense of honour and dignity. You are a Solar being, and you often display charismatic and leadership qualities. Your warmth and your persuasive power lead you far away from pettiness. You enjoy thinking big and, consequently, you move forward according to what you decide.\n\nRegarding astrological houses, the principle is even simpler: the twelve houses correspond to twelve fields of life, and planets tenanting any given house increase that house's importance and highlight all relevant life departments: it may be marriage, work, friendship etc.\n\nIndeed, it is quite the same situation with signs and houses. If planets symbolize characters, signs represent hues - the mental, emotional and physical structures of an individual. The sign in which a planet is posited is like a character whose features are modified according to the place where he lives. In a chart, there are usually one, two or three highlighted signs that allow to rapidly describe its owner.\n\nThe ten planets - the Sun throughout Pluto - are a bit like ten characters in a role-play, each one has its own personality, its own way of acting, its own strengths and weaknesses. They actually represent a classification into ten distinct personalities, and astrologers have always tried to associate one or several dominant planets to a natal chart as well as dominant signs and houses.\n\nThe issue of dominant planets has existed since the mists of time in astrology: how nice it would be if a person could be described with a few words and one or several planets that would represent their character, without having to analyse such elements as rulerships, angularities, houses, etc!\n\nCadent houses, namely the 3rd, 6th, 9th and 12th houses, are very emphasized in your chart, Evan Rachel Wood. They indicate important potential for communication, adaptability and flexibility. These houses are symbolically linked to the mind and intellect. The relative weakness implied by these characteristics indicates your tendency to hesitate or to be indecisive, but also your remarkable ability to start off again, which is a nice quality, finally: you can easily get yourself out of a tight spot thanks to your mobility and casualness, in the best sense of the term. This group of houses corresponds to evolutionary characteristics of your personality. However, they are only indications and you must include them in the rest of your chart in order to see whether they are validated or not!\n\nPlanets are evaluated according to a whole set of criteria that includes comprehensive Western astrology rules. At their turn, planets emphasize specific types of houses, signs, repartitions etc., as previously explained.\n\nThe first ones are the most important ones, the most \"noticeable\" and energetic houses. They are the 1st, 4th, 7th and 10th houses. Their cuspides correspond to four famous angles: Ascendant for the 1st house, Imum Coeli for the 4th house, Descendant, opposite the Ascendant, for the 7th house and Midheaven for the 10th house, opposite the Imum Coeli.\n\nThe Mutable mode is the most emphasized one in your natal chart, Evan Rachel Wood, which indicates a mobile character that is curious and thirsty for new experiences and evolution. You are lively and flexible, and you like to react quickly to solicitations, but don't confuse mobility with agitation, since this is the danger with this configuration - and with you, stagnation is out of the question. Security doesn't matter as long as you are not bored. You optimize, you change things, you change yourself... all this in a speedy way.\n\nThe twelve zodiacal signs are split up into three groups or modes, called quadruplicities, a learned word meaning only that these three groups include four signs. The Cardinal, Fixed and Mutable modes are more or less represented in your natal chart, depending on planets' positions and importance, and on angles in the twelve signs.\n\nAir is under-represented in your natal chart, with only 8.81% instead of the average 25%. Air symbolizes the values of communication, exchanges with others, but also adaptability and flexibility abilities: if you don't get out of your cocoon to talk, to show interest in others, and to socialize, you may have problems understanding others. Because of your lack of flexibility or of your refusal to adapt yourself, you may be suddenly overwhelmed by events. You should get into the habit of talking, of phoning, and of thinking in terms of \"mobility, flexibility, adaptability, change\" in every circumstance. It will spare you so many troubles!\n\nEvan Rachel Wood, Fire is dominant in your natal chart and endows you with intuition, energy, courage, self-confidence, and enthusiasm! You are inclined to be passionate, you assert your willpower, you move forward, and come hell or high water, you achieve your dreams and your goals. The relative weakness of this element is the difficulty to step back or a kind of boldness that may prompt you to do foolish things.\n\nLike the majority of Earth signs, Evan Rachel Wood, you are efficient, concrete and not too emotional. What matters to you is what you see: you judge the tree by its fruits. Your ideas keep changing, words disappear, but actions and their consequences are visible and remain. Express your sensitivity, even if it means revealing your vulnerability. Emotions, energy and communication must not be neglected; concrete action is meaningless if it is not justified by your heart, your intellect or your enthusiasm.\n\nEvan Rachel Wood, here are the graphs of your Elements and Modes, based on planets' position and angles in the twelve signs:\n\nEvan Rachel Wood, the nocturnal North-eastern quadrant, consisting of the 1st, 2nd and 3rd houses, prevails in your chart: this sector favours self-assertion and material security to the detriment of your perception of others. You consider self-transformation to be a hazardous adventure. You are inclined to seek stability and you tend to protect yourself with your actions. Possession, acquisition but also communication, without opening up too much, are part of your deep motivations. You are rather autonomous and constant, however it is important that you pay more attention to others, so that you can improve your outcomes.\n\nEach quadrant is a combination of the four hemispheres of your birth chart and relates to a character typology. The Southern hemisphere \u0096 the top of your chart, around the Midheaven \u0096 is associated with extraversion, action, and public life, whereas the Northern hemisphere prompts to introversion, reflexion, and private life. The Eastern hemisphere \u0096 the left part, around the Ascendant \u0096 is linked to your ego and your willpower, whereas the Western hemisphere indicates how other people influence you, and how flexible you are when you make a decision.\n\nThese general character traits must not be taken literally; they are, somehow, preparing for the chart reading. They allow to understand the second part of the analysis, which is more detailed and precise. It focuses on every area of the personality and provides a synthesis of all the above-mentioned parameters according to sound hierarchical rules.\n\nLastly, there are two other criteria: accentuations (angular, succedent and cadent) which are a classification of astrological houses and types of decanates that are occupied (each sign is divided into three decanates of ten degrees each). They provide some additional informations.\n\nThere are three types of dominants: dominant planets, dominant signs and dominant houses. The novice thinks astrology means only \"to be Aries\" or sometimes, for example, \"to be Aries Ascendant Virgo\". It is actually far more complex. Although the Sun and the Ascendant alone may reveal a large part of the character - approximately a third or a half of your psychological signature, a person is neither \"just the Sun\" (called the sign) nor just \"the first house\" (the Ascendant). Thus, a particular planet's influence may be significantly increased; a particular sign or house may contain a group of planets that will bring nuances and sometimes weaken the role of the Ascendant, of the Sun sign etc.\n\nThen, there are three additional distributions: elements (called triplicity since there are three groups of signs for each one) - Fire, Air, Earth and Water - corresponding to a character typology, modality (or quadruplicity with four groups of signs for each one) - Cardinal, Fixed and Mutable - and polarity (Yin and Yang).\n\nThe overall chart analysis begins with the observation of three sorts of planetary distributions in the chart: Eastern or Western hemisphere, Northern or Southern hemisphere, and quadrants (North-eastern, North-western, South-eastern and South-western). These three distributions give a general tone in terms of introversion and extraversion, willpower, sociability, and behavioural predispositions.\n\nThese different criteria allow a planet to be highlighted and lead to useful conclusions when interpreting the chart.\n\nThe first step is to evaluate the importance of each planet. This is what we call identifying the dominant planets. This process obeys rules that depend on the astrologer's sensitivity and experience but it also has precise and steady bases: thus, we can take into account the parameters of a planet's activity (the number of active aspects a planet forms, the importance of each aspect according to its nature and its exactness), angularity parameters; (proximity to the four angles, Ascendant, Midheaven, Descendant and Imum Coeli or Nadir, all of them being evaluated numerically, according to the kind of angle and the planet-angle distance) and quality parameters (rulership, exaltation, exile and fall). Finally, other criteria such as the rulership of the Ascendant and the Midheaven etc. are important.\n\nIn brief, a natal chart is composed of ten planets: two luminaries, the Sun and the Moon, three fast-moving or individual planets, Mercury, Venus and Mars, two slow-moving planets, Jupiter and Saturn, and three very slow-moving planets, Uranus, Neptune and Pluto. Additional secondary elements are: the Lunar Nodes, the Dark Moon or Lilith, Chiron and other minor objects. They are all posited on the Zodiac wheel consisting of twelve signs, from Aries to Pisces, and divided into twelve astrological houses.\n\nIn the first part, an overall analysis of the chart enables us to figure out the personality's main features and to emphasize several points that are confirmed or not in the detailed analysis: in any case, those general traits are taken into account. Human personality is an infinitely intricate entity and describing it is a complex task. Claiming to rapidly summarize it is illusory, although it does not mean that it is an impossible challenge. It is essential to read a natal chart several times in order to absorb all its different meanings and to grasp all this complexity. But the exercise is worthwhile.\n\nWhen interpreting a natal chart, the best method is to start gradually from general features to specific ones. Thus, there is usually a plan to be followed, from the overall analysis of the chart and its structure, to the description of its different character traits.\n\nIn a matter of minutes, you can get at your email address your astrological portrait (approximately 32 pages), a much more comprehensive report than this portrait of Evan Rachel Wood.\n\nHere are some character traits from Evan Rachel Wood's birth chart. This description is far from being comprehensive but it can shed light on his/her personality, which is still interesting for professional astrologers or astrology lovers.\n\nDisclaimer: these short excerpts of astrological charts are computer processed. They are, by no means, of a personal nature. This principle is valid for the 63,441 celebrities included in our database. These texts provide the meanings of planets, or combination of planets, in signs and in houses, as well as the interpretations of planetary dominants in line with modern Western astrology rules. Moreover, since Astrotheme is not a polemic website, no negative aspect which may damage the good reputation of a celebrity is posted here, unlike in the comprehensive astrological portrait.\n\nEvan Rachel Wood (born September 7, 1987 (birth time source: Sy Scholfield, birth certificate)) is an American film, television and theater actress, and singer. She began acting in the late 1990s, appearing in several television roles, including American Gothic and Once and Again. Wood made her debut as a lead film actress in 2002's Little Secrets, and became well known after her Golden Globe-nominated role in Thirteen, which garnered her critical praise. She has since starred in several independent films, including Pretty Persuasion and Down in the Valley, and has several more starring roles in films yet to be released. She is currently the highest paid music video actress in history due to her role in Heart Shaped Glasses\n\n* A planet less than 1° from the next House cusp is considered to be posited in the said House. 2° when the AS and the MC are involved\n\nProserpina is related to mysteries, revival and reconstruction, as well as cycles. She enriches the unconscious, and gives the possibility to combine modern life with spirituality, the East with the West, and mysticism with concrete life.\n\nProserpina , sometimes referred to as Persephone, is a trans-Plutonian hypothetical planet. N.B.: numerous astrologers believe neither in the influence of Proserpina, nor in that of all hypothetical planets, asteroids, Arabic parts or other fictitious points.\n\nPoseidon brings about wisdom, a clear mind, and sometimes spirituality. On the downside, it may make the person dogmatic, manipulative, or out of touch with reality.\n\nPoseidon is a hypothetical trans-Neptunian planet, the existence of which is not proven. It was invented by Alfred Witte, founder of the famous Hamburg School, and by his student, Friedrich Sieggrün. N.B.: numerous astrologers believe neither in the influence of Poseidon, nor in that of all hypothetical planets, asteroids, Arabic parts or other fictitious points.\n\nVulcanus, sometimes said to be the higher octave of Saturn, provides strength to improve collective relations, to structure things, to be efficient, and to get straight to the point. On the downside, he may bring about arrogance and scattered efforts.\n\nVulcanus is a hypothetical trans-Neptunian planet, the existence of which is not proven. It was invented by Alfred Witte, founder of the famous Hamburg School, and by his student, Friedrich Sieggrün. N.B.: numerous astrologers believe neither in the influence of Vulcanus, nor in that of all hypothetical planets, asteroids, Arabic parts or other fictitious points.\n\nAdmetos is related to the deepness of the mind, asceticism, simplicity, and analytical mind. In tough aspect, it may make the person nit-picking, inflexible, and narrow-minded.\n\nAdmetos is a hypothetical trans-Neptunian planet, the existence of which is not proven. It was invented by Alfred Witte, founder of the famous Hamburg School, and by his student, Friedrich Sieggrün. N.B.: numerous astrologers believe neither in the influence of Admetos, nor in that of all hypothetical planets, asteroids, Arabic parts or other fictitious points.\n\nApollon is related to the ability to synthesise, as well as to broad-mindedness, and fame. In difficult aspect, it may bring about superficiality or extravagance.\n\nApollon is a hypothetical trans-Neptunian planet, the existence of which is not proven. It was invented by Alfred Witte, founder of the famous Hamburg School, and by his student, Friedrich Sieggrün. N.B.: numerous astrologers believe neither in the influence of Apollon, nor in that of all hypothetical planets, asteroids, Arabic parts or other fictitious points.\n\nKronos is a hypothetical trans-Neptunian planet, the existence of which is not proven. It was invented by Alfred Witte, founder of the famous Hamburg School, and by his student, Friedrich Sieggrün. N.B.: numerous astrologers believe neither in the influence of Kronos, nor in that of all hypothetical planets, asteroids, Arabic parts or other fictitious points.\n\nZeus is related to creativity, as well as to organisational and leadership capacities. On the downside, it may lead to aggressiveness and to excessive militancy.\n\nZeus is a hypothetical trans-Neptunian planet, the existence of which is not proven. It was invented by Alfred Witte, founder of the famous Hamburg School, and by his student, Friedrich Sieggrün. N.B.: numerous astrologers believe neither in the influence of Zeus, nor in that of all hypothetical planets, asteroids, Arabic parts or other fictitious points.\n\nHades corresponds to intellectual rigour, service rendered to people, the purpose of being useful. On the downside; it leads to carelessness, indifference, apathy, and mess.\n\nHades is a hypothetical trans-Neptunian planet, the existence of which is not proven. It was invented by Alfred Witte, founder of the famous Hamburg School, and by his student, Friedrich Sieggrün. N.B.: numerous astrologers believe neither in the influence of Hades, nor in that of all hypothetical planets, asteroids, Arabic parts or other fictitious points.\n\nOn the upside, Cupido is related to socialisation, the arts, and marital life. On the downside, it indicates vanity, addiction to pleasures, and being strongly influenced by groups of people.\n\nCupido is a hypothetical trans-Neptunian planet, the existence of which is not proven. It was invented by Alfred Witte, founder of the famous Hamburg School, and by his student, Friedrich Sieggrün. N.B.: numerous astrologers believe neither in the influence of Cupido, nor in that of all hypothetical planets, asteroids, Arabic parts or other fictitious points.\n\nN.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports.\n\nBenevolent, cheerful, and honest character, with a whiff of vanity. The members of the entourage are nice and belong to a wealthy and educated social layer. Associations with friends are fruitful, particularly in any area involving the arts, beauty, or botany. Sometimes, if in the natal chart the Moon receives hard aspects, this degree indicates that deceits and misfortunes are brought about by females.\n\nThe East Point is sometimes considered to be a second Ascendant, less important, but also related to how one is seen by other people, and to how one expresses one's personality.\n\nThe East Point is a fictitious point at the intersection of two great circles, the Ecliptic and the great vertical circle (Prime Vertical) in the East of the birthplace, linking the East, the Zenith, the West, and the Nadir. It is always located in the East of the chart, around the Ascendant.\n\nN.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports.\n\nIntelligent, fickle, and fidgety character. One undertakes too many things at the same time and, in most cases, one succeeds in none. Journeys on water and across the seas may result in big losses. Stability and perseverance are a must. It is indispensable to carefully plan one's projects before implementing them. Otherwise, wishful thinking prevails, and one goes from one failure to another.\n\nThe Vertex is sometimes considered to be the second Descendant because, like the latter, it is related to communication and exchanges. It has to do with associations and fated encounters, those that are not chosen, and reveals the type of sensitivity and reactivity we have in our dealings with other people: a refined and tolerant way in Libra, straightforward and spontaneous in Aries, etc.\n\nThe Vertex , sometimes called counter-Ascendant, is a fictitious point which is at the intersection of two great circles, the Ecliptic and the great vertical circle (Prime Vertical) in the West of the birthplace, linking the East, the Zenith, the West, and the Nadir. It is always located in the West of the chart around the Descendant. It is the chart's fifth angle, so to speak, less important than the other angles. Its interpretation is controversial, because certain astrologers pay no attention to it.\n\nThe Twelfth House is the sphere of hidden things, enemies, closed or remote places (hospital, prison, convent etc.), ordeals, secrecy, solitude, long-term illnesses but also sincere devotion and genuine compassion. It is in analogy with Pisces and Neptune.\n\nThe Eleventh House is the sphere of friendship and protection, projects, search for social acceptance and security, collective and humanitarian actions. It is in analogy with Aquarius and Uranus, and Saturn to a lesser extent. It's a succedent and quite important house.\n\nN.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports.\n\nLenient, generous, and sensitive character. One protects and devotes oneself to the family members, but one also cares for other people's needs. In some cases, one suffers the loss of a child. One's major goal is to found and run a centre dedicated to children and youths in distress, even though financial resources are not sufficient, or despite the disapproval expressed by the spouse or the other family members. Success can be achieved in the civil service, in an administrative position in the military or in the police. This degree heralds longevity and happiness, in spite of the fact that one is not really understood by the entourage. If in the natal chart, Venus is in Taurus and forms a trine with this degree, it indicates talents for artwork, especially painting and pottery.\n\nThe Tenth House still called the Midheaven , is the highest point amidst the houses, at the top of the chart, in the South, and relates to destiny in general and career (and not daily work as meant by the Sixth House). The Midheaven represents our achievements and goals in the social sphere, our social position in society, and becomes more and more important as we get older. It is in analogy with Capricorn and Saturn. The Tenth House is the most important angular house along with the Ascendant.\n\nThe Ninth House is the sphere of high studies, both physical and mental journeys (philosophy, spirituality), rebelliousness, changes of scenery, desire for dealing with the unknown. It is in analogy with Sagittarius and Jupiter. It is a cadent house, less important than the angular and succedent ones.\n\nThe Eighth House is the sphere of emotional security, the depths of the self, secrets and paranormal, transcendence, sexuality, mysteries, upheavals, surgical operations, others' money (investments, inheritances), crises, transformation after evolution, death. It is in analogy with Scorpio and Pluto, and Mars to a lesser extent. It is a succedent and quite important house.\n\nN.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports.\n\nMagnanimous, obliging, and sincere character endowed with excellent discerning faculties. One readily forgives one's enemies and strives to alleviate deprived people's sufferings. Although one is not particularly interested in worldly gains, one easily attracts success, wealth, and honours owing to a vivid imagination and artistic gifts. Great achievements can also be expected in diplomacy or politics.\n\nThe Seventh House also called the Descendant (in front of the Ascendant) is the sphere of partnership, marriage, contracts, relationships with others, the outer world. It is in analogy with Libra and Venus, and Saturn to a lesser extent. It is an angular and important house.\n\nThe Sixth House is the sphere of apprenticeship and effort in the work environment, daily life, health on a daily basis and not operations or long-term diseases, relationships with co-workers or subordinates, desire for improvement, analysis and detail. It is in analogy with Virgo and Mercury. It is a cadent house, less important than the angular and succedent ones.\n\nThe Fifth House is the sphere of pleasures and love affairs (but not commitment or marriage), creations and entertainments, children, arts and game. It is in analogy with Leo and the Sun. It's a succedent and quite important house.\n\nN.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports.\n\nDaring, violent, and improvident character. It is necessary to avoid all forms of conflicts, learn to exercise some patience, and carefully ponder over the situation before taking action. Success can be achieved in sports, provided that one receives a good training. This degree portends dangers linked to horses and transportation in general. Expatriation or working abroad is strongly advised against.\n\nThe Fourth House also called Immum Coeli is the sphere of inner emotions, family, the father, home and roots, but also the home one creates. It's Home Sweet Home, security and cocoon. It is in analogy with Cancer and the Moon. It's an angular and important house.\n\nThe Third House is the sphere of social and intellectual apprenticeship, studies, relationships with close people and surroundings, short trips, light-hearted and quick contacts, correspondences. It is in analogy with Gemini and Mercury. It's a cadent house, less important than the angular and succedent ones.\n\nThe Second House is the sphere of material security, the money we earn, our possessions, also in a symbolic meaning (close people etc). It is in analogy with Taurus and Venus. It is a succedent house, quite important.\n\nN.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports.\n\nMelancholic, accepting, and passive character. For a female, motherhood is experienced as a burden, and marriage does not live up to expectations. For a male, there is a strong probability that he is abandoned by his wife. Instead of suffering in silence, he must make every effort order to win her back. For both genders, it is necessary to think thoroughly before getting married and start a family because this degree indicates that celibacy is more suitable.\n\nThe First House or Ascendant represents one's behaviour in the eyes of others and also one's health. It corresponds to the way the individual acts in the world. It is the image of the personality as seen by others and the person's visible behaviour expressed outwardly. The 1st House is in analogy with Aries and thus Mars too and then the Sun. It is an angular house, the most important one with the Midheaven, maybe even more so due to its link with the body and health; the Ascendant is as important as the Sun in a natal chart.\n\nN.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports.\n\nLenient, generous, and sensitive character. One protects and devotes oneself to the family members, but one also cares for other people's needs. In some cases, one suffers the loss of a child. One's major goal is to found and run a centre dedicated to children and youths in distress, even though financial resources are not sufficient, or despite the disapproval expressed by the spouse or the other family members. Success can be achieved in the civil service, in an administrative position in the military or in the police. This degree heralds longevity and happiness, in spite of the fact that one is not really understood by the entourage. If in the natal chart, Venus is in Taurus and forms a trine with this degree, it indicates talents for artwork, especially painting and pottery.\n\nYou are well-organised, methodical, hard-working, concentrated, and discreet, and you do not like to take risks. You tend to underestimate your own worth, and therefore, you occupy positions which are too modest for you. But it is your personal choice, and this is how you can have the feeling that you keep full control of the situation. Furthermore, your will to constantly improve yourself enables you to make up for lost time. In the second part of your life, it is most likely that you eventually spread your wings and soar up to the place which your qualities deserve. The following professions are most likely to suit you very well: architect, industrial designer, watchmaker, computer specialist, scientific expert, mathematician, librarian, banker, chartered accountant, financial officer, stockbroker, shopkeeper, secretary, executive assistant, household aide, cleaner, social worker, civil servant, breeder, medical practitioner, pharmacist, veterinarian, physiotherapist, medical assistant, as well as Minister for Health or for Finances.\n\nThe Tenth House still called the Midheaven , is the highest point amidst the houses, at the top of the chart, in the South, and relates to destiny in general and career (and not daily work as meant by the Sixth House). The Midheaven represents our achievements and goals in the social sphere, our social position in society, and becomes more and more important as we get older. It is in analogy with Capricorn and Saturn. The Tenth House is the most important angular house along with the Ascendant.\n\nN.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports.\n\nMelancholic, accepting, and passive character. For a female, motherhood is experienced as a burden, and marriage does not live up to expectations. For a male, there is a strong probability that he is abandoned by his wife. Instead of suffering in silence, he must make every effort order to win her back. For both genders, it is necessary to think thoroughly before getting married and start a family because this degree indicates that celibacy is more suitable.\n\nYour psychological nature is extroverted and independent, oriented towards expansion and sociability. You have the soul of a leader, energetic and active. Your charisma and your drive are fully integrated in the collective life. Indeed, as an action-oriented fire sign, you challenge yourself and succeed in accomplishing the task straight away. Sagittarius is hard to follow because his spirit and his independent mind constantly lead him to go further and higher. With this Ascendant, you come across as charismatic, fiery, energetic, likeable, benevolent, tidy, jovial, optimistic, extraverted, amusing, straightforward, demonstrative, charming, independent, adventurous, straightforward, bold, exuberant, freedom-loving. But you may also be irascible, selfish, authoritarian, inconsistent, unfaithful, brutal, unreliable, reckless, tactless or disagreeable.\n\nThe First House or Ascendant represents one's behaviour in the eyes of others, and also one's health. It corresponds to the way the individual acts in the world. It is the image of the personality seen by others and the person's visible behaviour expressed outwardly. The 1st House is in analogy with Aries and thus Mars too, and then the Sun. It is an angular house, the most important one with the Midheaven, maybe even more so due to its link with the body and health.\n\nN.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports.\n\nMagnanimous, obliging, and sincere character endowed with excellent discerning faculties. One readily forgives one's enemies and strives to alleviate deprived people's sufferings. Although one is not particularly interested in worldly gains, one easily attracts success, wealth, and honours owing to a vivid imagination and artistic gifts. Great achievements can also be expected in diplomacy or politics.\n\nThe classical Part of Fortune, of which the calculus method is unchanged whether in a diurnal or nocturnal chart, is usually distinguished from the diurnal/nocturnal Part of Fortune which is calculated by the formula AS + Sun - Moon for a nocturnal chart, and AS + Moon - Sun in a diurnal chart.\n\nThe Part of Fortune is an ancient concept, used by Ptolemy and other astrologers before him. Firstly, it has nothing to do with fortune! In modern astrology, it is actually used to enhance a planet or angle when in close conjunction with it: it thus amplifies the meaning associated to the point affected by its presence. It is calculated in the following way:\n\nN.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports.\n\nPleasant, gentle, and generous character endowed with extremely bright intelligence and high creativity. One has a keen interest in religion, ancient myths, and scientific research on light and rays, and amasses an exceptionally broad general knowledge. One achieves success and fame through one's career and earns people's admiration for one's humanitarian work. This degree often describes good-looking persons whose moral standards may not be too strict. If the natal chart points to thwarted intellectual abilities, this degree indicates a lazy and self-centred person driven by an intense desire for luxury and superficial things.\n\nLilith or the Dark Moon (True Lilith here) represents the uncrossable threshold, taboos, the individual's provocative and fascinating side, including on a sexual level. She symbolizes violence and \"untameability\", the radical and deep-seated refusal to submit. The keywords for Lilith can be sterility, sadism, perversity, castration, sadomasochism, eroticism, orgasm, forbidden fantasies, marginality, cruelty; redemption, illumination, rebelliousness... Lilith's opposite point is called Priapus; it is the Lunar perigee, the position where the Moon is closest to the Earth. It symbolizes man's primitive nature, the horror hidden in our deepest self; masochism, extreme sensuality, impulsiveness, irrationality and excess. Physically speaking, the Dark Moon is the focal point unoccupied by the Earth: it is not a concrete body but a mathematical point.\n\nN.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports.\n\nFiery, honest, and generous character. One is always prepared to reach out to deprived people in order to alleviate their sufferings. One seeks peace and harmony and attracts many friends who are willing to help. However, if in the natal chart the planets linked to emotions are severely afflicted by hard aspects, this degree may warn against all sorts of sensual excesses, and advises to beware of passions of all sorts.\n\nThe South Node is diametrically opposed to the North Node, therefore it faces it (it's not drawn here, it's the same symbol but upside down). It symbolizes what has already been achieved or acquired, in a karmic sense: it's the past from which it's advised to move on in order to progress. The South Node is rather negative, of a Saturnian nature: the experience through suffering.\n\nThe North Node (True Node here) represents the goals that must be achieved during life, in the karmic sense according to some traditions. Its position in house indicates in what field an effort is necessary in order to evolve. The North Node is often called the Dragon's head, it is usually considered beneficial, a bit like Jupiter with the planets. The Lunar nodes are fictional points and not actual heavenly bodies: they are the intersections of the Moon with the Ecliptic (the path made by the Sun in its orbit as seen from the Earth). The axis of the Lunar nodes moves 19 degrees each year, namely a bit more than three minutes each day.\n\nJuno is the asteroid corresponding to the adaptation to the marital partner and to the defence of individual rights; it is thus used in the field of marriage.\n\nPallas is sometimes used in modern Astrology: she represents intelligence, abstract and global thinking talents. It is usually considered to be a determining element in political strategy.\n\nCeres , the biggest of the four minor asteroids used besides Chiron, is associated with the mythological goddess of growing plants and harvest and also symbolizes physical constitution, vitality and fertility. She's also known as Demeter, according to the astrologer Zipporah Dobyns, linked to the symbolism of the mother but in a less emotive and more physical way than the Moon. Ceres is thought to be the ruler of Virgo, in exaltation in Gemini, in exile in Pisces and in fall in Sagittarius. Keywords associated with Ceres could be order, practical sense, worry, precision, modesty, method, sobriety, motherhood, fertility, the Earth: a kind of a more cerebral Moon...\n\nChiron is almost renowned and used everywhere. Most astrologers consider it as a kind of \"mediator\" between Saturn and outer planets. Consequently, Chiron is of Saturn's nature and at the same time is influenced by Uranus, the first slow-moving planet. Astrologically, it symbolizes wisdom, patience and the faculty to reduce others' sufferings: it is said to be the \"great healer\" of the zodiac. Like all the secondary bodies, it must be in close conjunction with planets or angles in order to fully express its action.\n\nIf you wish, you can receive immediately in your mailbox your detailed astrological portrait , a nice gift for yourself or for your close friends and relatives, who will deeply appreciate it.\n\nN.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports.\n\nProud, vigilant, and courageous character endowed with numerous talents. One's competences are put at the service of the affairs of the country, probably in the field of justice and diplomacy. Rewards come in the guise of fame, honours, and a rich marriage. However, one must not heed one's jealous instincts and must refrain from being unfaithful in love.\n\nIf Pluto is part of your natal chart's planetary dominants, in astrology, you are said to be a Plutonian: you sometimes feel like a foreigner who does not belong to the world, to its laws, and its concerns. The rules of life in society are not necessarily yours. You are interested in what is unknown and in the subtle laws of a hidden order. So, you take malicious pleasure in ridiculing the patterns you find too simplistic or too rigid. You also revel in underlining the limits of explanations you deem too common. There is something unconventional about the way you are, the way you think, and the way you act. What is your specificity made of? Is it an extraordinary partner? A life off the beaten path? Or do you only distance yourself from conventional morals? In any case, you have the feeling, sometimes quite vague, that you come from nowhere, and that you do not belong to any definite group... In short, it means that you cannot be simplified in order to conform to existing models. The gap between you and ordinary mortals is also an element of your strength. Your deep clear-sightedness, firstly, enables you to put things into perspective and to grant them only the attention they deserve. Your other remarkable asset is your capacity to intervene from behind the scenes, to secretly organise events, and to bring about the desirable outcome without seeming to impose or to dictate anything. However, you must still overcome one of the major difficulties of this dominant, which is to get people to accept your difference and to smoothly fit into your environment.\n\nWith Pluto in the 11th House, great friendships are like great projects: they change and evolve as time goes by. There is nothing absolute in your conception of the world and in your ideals, but only the feeling that you understand the futility of principles and ideas. Your most meaningful relationships always keep some degree of mystery. You do not know the reason why a friendship prevails, and you distrust universally accepted truths. Then all morals become relative, and you keep your distance.\n\nThe planet Pluto symbolizes deep disruptions and upheavals, domination and sexual instincts, and the inner power we have in ourselves. Pluto destroys in order to reconstruct and he provokes painful crises that are needed in metamorphosis. Pluto is our deepest instincts' brutal force. It is the hidden and unconscious violence that can explode in us with incredible intensity before being projected in our actions; in itself, the planet is not negative: the might and the intensity of its energy are beyond the conceivable but it can be funnelled. Pluto is the only possibility we have at our disposal to overcome our inner blocks and to eliminate outgrown situations that have become inextricable. Pluto's energy is valuable because of its usefulness for the irreversible destruction of what constitutes a problem and not because of its negative side and its perversity. Pluto allows to reconstruct and to regenerate parts of our personality or whole stretches of our life, provided that we manage to funnel his wild energy and to step back. It is impossible to tame this energy, given its essence. However, it is possible to take advantage of it for a precise aim, through a temporary identification of some parts of us with this energy. In such a case, the outcome is our final evolution and even, our transformation. In your natal chart, Pluto's house position is more important than his sign position because, like Jupiter, Saturn, Uranus and Neptune, Pluto is a slow planet. Many people born in the same period have Pluto in the same sign. This is the reason why the sign occupied here is less meaningful than when it is occupied by the so-called fast planets, i.e. the Sun, the Moon, Mercury, Venus and Mars. Therefore, some caution is to be exercised as you read what follows. The sign positions of Uranus, Neptune and Pluto have a collective meaning. They do not influence your personality and they are not to be really taken into account, unless they are involved in numerous aspects or when they emphasize a personal point of your natal chart such as your Ascendant's ruler, an angular planet, i.e. a planet near the Ascendant, the Midheaven, the Nadir or the Descendant. In such cases, the activity of the slow planet is very highlighted. Pluto in Scorpio is in his own sign, and according to the Tradition, he is most potent and at his best; sexuality and fantasies, powerful libido and instincts, strong domineering tendencies, outbursts of passions...\n\nPluto represents deep transformations, mutations and eliminations, sexuality and magnetism, power and secrets, destruction with a view to regeneration, the phoenix rising from the ashes. Its element is indefinite; burning (like lava in fusion ?), it rules Scorpio, is in exaltation in Pisces and is in analogy with the sexual organs and excretion.\n\nIf you wish, you can receive immediately in your mailbox your detailed astrological portrait , a nice gift for yourself or for your close friends and relatives, who will deeply appreciate it.\n\nN.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports.\n\nDevoted, selfless, and loyal character. One is totally wrapped up in one's sole passion, be it a romantic attachment or a higher expression of love implying self-sacrifice such as, for example, a daughter who attends to her widowed father, or the founder of a charity institution, etc. In any case, one's altruism receives public recognition. This degree warns against possible slanders.\n\nIf Neptune is part of your natal chart's planetary dominants, in astrology, you are said to be a Neptunian: your intuition is highly developed. You are of a contemplative nature, and you are particularly receptive to ambiances, places, and people. You gladly cultivate the art of letting-go, and you allow the natural unfolding of events to construct your world. You follow your inspirations, for better or for worse. At times, you display an extraordinary clairvoyance gift. You seem to be able to read your subconscious like a book, and you track down subtle underlying mechanisms, flaws, or open breaches. This innate intuition might explain the strokes of good luck which the Neptunian is sometimes credited with. However, you may also be the victim of illusions and misleading intuitions. You are an idealist, and you let your deepest aspirations prevail over the realities of the moment. Then, you set off in quest of some quixotic objective, living like a Don Quixote who relentlessly pursues an impossible dream. You have a great talent for psychology and the mysteries of the human soul. Since you instinctively perceive people's intents and motivations, as you swim in the complexity of human nature, you feel in your element. The subtlety of your perceptiveness is the source of both special affections and irrevocable rejections. What is the danger of such a dominant? If it is not offset by other influences in your natal chart, you may not have an iron will. Your trump card is your instinct, which may be developed to the extent that it becomes clairvoyance.\n\nN.B.: When a planet is posited near the cusp of the next astrological house (less than 2 degrees for the Ascendant or the Midheaven, and less than 1 degree for all the other houses), it is considered to be posited in the following house. This rule is used in the texts of this interactive chart and in all our astrological softwares.\n\nNeptune is in the 2nd House. It is impossible to keep good fortune under your control. The most you can do is to beseech it to smile on you. All the things you own are there by chance, or else by magic. You sometimes blindly follow your intuitions, searching for an opportunity to make a profit or an acquisition. In many instances, good luck turns out to be a mirage and a disappointment. And then some day, you find it under quite extraordinary circumstances. If your life is devoted to business, it is most likely that you seldom hesitate to tempt fate, and that you speculate.\n\nThe planet Neptune symbolizes extreme receptivity, intense emotional sharpness, impressionability and inspiration; it is the planet of mediums, mystics and religious faith. In an astrological chart, it indicates dilution, vagueness, understanding one's environment through emotions and the absence of clear and determined limits and structures. In your natal chart, Neptune's house position is more important than his sign position because, like Jupiter, Saturn, Uranus and Pluto, he is a slow planet. Many people born in the same period have Neptune in the same sign. This is the reason why the sign occupied here is less meaningful than when it is occupied by the so-called fast planets, i.e. the Sun, the Moon, Mercury, Venus and Mars. Therefore, some caution is to be exercised as you read what follows. The sign positions of Uranus, Neptune and Pluto have a collective meaning. They do not influence your personality, unless they are involved in numerous aspects or when they emphasize a personal point of your natal chart such as your Ascendant's ruler, an angular planet, i.e. a planet near the Ascendant, the Midheaven, the Nadir or the Descendant. In such cases, the activity of the slow planet is very highlighted. Neptune in Capricorn brings a touch of humanity and emotion into your ambition made of cold and calculated vision. Or, on the contrary, it may disrupt your precise and clear vision of your professional future.\n\nNeptune represents escapism, impressionability, daydreaming, delusions, carelessness, deception or intuition, dishonesty or inspiration, telepathy. Water is its element, it is moist, it rules Pisces, is in exaltation in Cancer, though some authors say it is Leo, and is in analogy with the vegetative system.\n\nIf you wish, you can receive immediately in your mailbox your detailed astrological portrait , a nice gift for yourself or for your close friends and relatives, who will deeply appreciate it.\n\nN.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports.\n\nSelfish, jealous, and conceited character. One has difficulties in understanding that self-centredness harms relationships with friends or lovers, and that other people's aspirations must be given due consideration. This degree indicates unhappiness in love. If the natal chart concurs, there is a danger caused by a heart condition or a violent accident.\n\nIf Uranus is part of your natal chart's planetary dominants, in astrology, you are said to be a Uranian: personal values are prevailing. Inner certainties fuel an inflexible will and a desire to call attention on yourself as well as to follow your beliefs through. This planet prompts you to behave with determination, to put forward your own truth, and to start your personal revolution. More than other people, you are willing to keep some degree of autonomy in all circumstances, and you often display an individualistic nature. In order to achieve your ideal of freedom and independence, you may act like a despot as you try to convince and to impose your views, whether smoothly or forcefully. Regardless of the flexibility of your comportment, some situations demand an absolute firmness as well as uncompromising, frank and straightforward attitudes. People may criticise you for your intransigence and say that you are a hardliner. Outsider's opinions don't matter! The most important thing is that you act in all conscience and reach your primary objectives. More than anyone else, you know how to use your willpower and to focus your energy on a precise aim, relentlessly, whatever the consequences might be. In the chapter of qualities, let's mention a definite sense of responsibility, an innovative mind open to techniques and modern ideas, as well as a natural self-discipline which overcomes many an obstacle. Therefore, people are well-advised not to hound you into a corner.\n\nWith Uranus in the 1st House, it is most likely that the first event in your life relates to a lightning bolt, a liberating shout, or a revolution. You keep your adamant will to surprise other people and to follow your beliefs through the bitter end. What you find fascinating in a discovery or an encounter is its unexpected, innovative, and sometimes extreme nature. There is some degree of (mild) fanaticism in your personality. Your first reaction is a definitive yes or a final no.\n\nThe planet Uranus symbolizes originality, independence and cerebral energy bursting suddenly. Uranus triggers the irresistible need for freedom that we have in ourselves. Uranus tends to break the constraints that have become unbearable and gives us the courage and the will to get rid of what has become a burden; when he is well aspected, he also indicates genius.In your natal chart, Uranus' house position is more important than his sign position because, like Jupiter, Saturn, Neptune and Pluto, he is a slow planet. Many people born in the same period have Uranus in the same sign. This is the reason why the sign occupied here is less meaningful than when it is occupied by the so-called fast planets, i.e. the Sun, the Moon, Mercury, Venus and Mars. Therefore, some caution is to be exercised as you read what follows. The sign positions of Uranus, Neptune and Pluto have a collective meaning. They do not influence your personality, unless they are involved in numerous aspects or when they emphasize a personal point of your natal chart such as your Ascendant's ruler, an angular planet, i.e. a planet near the Ascendant, the Midheaven, the Nadir or the Descendant. In such cases, the activity of the slow planet is very highlighted. Uranus in Sagittarius gives you the taste for feats and extraordinary adventures: as you are caught in the desire to discover, at any cost, you may become a hero, a conqueror, an explorer or, on the symbolic plane, a pioneer in such matters as philosophy, politics, economy or spirituality.\n\nUranus represents individual freedom, originality, independence, marginality, avant guard inspiration, ultra modernism. Fire is its element, it is dry, and it rules Aquarius, is in exaltation with Scorpio and is in analogy with the brain and the nerves.\n\nIf you wish, you can receive immediately in your mailbox your detailed astrological portrait , a nice gift for yourself or for your close friends and relatives, who will deeply appreciate it.\n\nN.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports.\n\nCreative, hard-working, and devoted character. One is endowed with great intellectual capacities, a vivid imagination, and an excellent memory. Brilliant success and fame can be obtained in sciences, theology, history, or literature. The natal chart indicates whether one is wealthy.\n\nIf Saturn is part of your natal chart's planetary dominants, in astrology, you are said to be a Saturnian: you gladly leave to other people the decision to take life as it comes. As far as you are concerned, you prefer to take advantage of your experiences in order to discover, to grow, and to question yourself.\n\nSaturn is in the 1st House in your natal chart. When you open your eyes to a new situation, you need to understand its why's and how's before you can accept its rules. Your first reaction is marked by the type of indefinable scepticism which challenges the very foundations of whatever you discover. Nothing is simple. You must be wary of situations and people, you need to uncover their machinery step-by-step, and if necessary, to dispute them uncompromisingly.\n\nThe planet Saturn symbolizes contraction, effort, time, limitation and concentration. Saturn eliminates anything that is not authentic, sooner or later. It is impossible to cheat him as he gives an irresistible desire to form a coherent whole with oneself, in responsible and wise ways. He is the great purifier. He represents our limitations but also our truth. In your natal chart, the house position where Saturn is posited is more important than his sign position because, like Jupiter, Uranus, Neptune and Pluto, he is a slow planet. Many people born in the same period have Saturn in the same sign. This is the reason why the sign occupied here is less meaningful than when it is occupied by the so-called fast planets, i.e. the Sun, the Moon, Mercury, Venus and Mars. Therefore, some caution is to be exercised as you read what follows. Saturn in Sagittarius limits your taste for exoticism and for rebellion. On the other hand, he strengthens your sense of responsibilities and your authority. You focus on what is concrete and real and you avoid venturing into unknown territories.\n\nCharacterology: Non-Emotive, Active and Secondary type or Emotive, non Active and Secondary type or sometimes Non-Emotive, non Active and Secondary type; it is a Phlegmatic, a Sentimental or an Empathic type\n\nIt represents the grandparents, old people, scientists, knowledgeable men, Saturn corresponds to old age; it goes from 70 years old until death.\n\nSaturn represents concentration, effort, perseverance, time, the hard reality, inevitable consequences. Earth is its element, it is cold and dry, and it rules Capricorn and Aquarius (along with Uranus), is in exaltation in Libra and is in analogy with the bones (skeleton) and the skin.\n\nIf you wish, you can receive immediately in your mailbox your detailed astrological portrait , a nice gift for yourself or for your close friends and relatives, who will deeply appreciate it.\n\nN.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports.\n\nIndependent, combative, and selfish character. One gives top priority to the fulfilment of personal pleasures and tends to be boastful. Decisions are made in solitude. Such self-centredness finally puts off family members, friends, and colleagues. Therefore, no external help is to be expected in days of misfortune and sorrow. Females are the source of troubles, and marriage is most likely to be unhappy.\n\nIf Jupiter is part of your natal chart's planetary dominants, in astrology, you are said to be a Jupiterian: because this planet brings about a keen interest in social and professional success, the Tradition considers it to be beneficial. Indeed, you know how to adjust to events and to jump at the chance when it arises. The members of your entourage gladly entrust you with high responsibilities because they are often impressed by your learning skills and your adaptation abilities as you deal with new structures and new languages. What is the secret of your good star? It is your self-confidence which wins public support. Now, what is the secret of your charm? Definitely, enthusiasm, euphoria, and exaltation. Exaggeration also. When this dominant is well integrated, it is a factor of affluence and optimism, and a certain degree of joviality enables you to easily fit into various spheres. It constitutes your main asset to manage your life. However, you must at times curb your desire for integration, lest your sense of opportunity turns into extreme opportunism. Here also, the key to success lies in a correct estimate of everyone's chances and possibilities. Although management is one of your forte, and you can adjust your objectives to current realities better than other people, you lack the hindsight which enables you to avoid short-term vagaries and daily fluctuations. If you strive too much to adapt, you run a risk of betraying yourself. This is the other traditional side of the coin with \"The Greater Benefic\"!\n\nWith Jupiter in the 5th House, dedication is a vital need, or almost. Your personal fulfilment and social integration depend on your creativity, your education, and your affective life. You feel a strong desire to teach what you know, and to share your experience. Generosity constitutes the royal path to love, as well as the cause of your success. Your vocation is in positions related to theatre. As the Tradition has it, your playful nature may prompt you to believe, more or less, that you are lucky at gambling.\n\nThe planet Jupiter symbolizes expansion, broadness and generosity. Jupiter is associated with the functions of synthesis, enthusiasm and optimism. In your natal chart, his house position is more important than his sign position because, like Saturn, Uranus, Neptune and Pluto, he is a slow planet. Many people born in the same period have Jupiter in the same sign. This is the reason why the sign occupied here is less meaningful than when it is occupied by the so-called fast planets, i.e. the Sun, the Moon, Mercury, Venus and Mars. Therefore, some caution is to be exercised as you read what follows. Jupiter in Aries amplifies your tendency to charge ahead and your self-assertiveness. You have leadership qualities, you are optimistic and you can mix the boldness with the will to succeed that are specific to Aries. Management ability, leadership and independence: your enthusiasm is a real asset for your life and for your charm!\n\nIt represents the governors, magistrates, professors, religious men too; the age of Jupiter goes from 50 to 55 or even 70 years old.\n\nJupiter represents expansion and power, benevolence, large vision and generosity. Its element is Air, it is hot and moist, and it rules Sagittarius and Pisces (along with Neptune), is in exaltation with Cancer and is in analogy with the hips and endocrinal system.\n\nIf you wish, you can receive immediately in your mailbox your detailed astrological portrait , a nice gift for yourself or for your close friends and relatives, who will deeply appreciate it.\n\nN.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports.\n\nInventive, generous and tolerant character endowed with a flexible mind devoid of prejudices. One understands that the importance of money is relative, and thus, one behaves with altruism. Thanks to one's wide range of talents, success and honours are achieved in one's field of competence.\n\nIf Mars is part of your natal chart's planetary dominants, in astrology, you are said to be a Marsian: in your hand-to-hand struggle for life, you demonstrate an acute and active sense of confrontation with the world, with other people, and with your own destiny. You need to take action and to fight for your projects and your desires. You perceive all situations with deep intensity, and you react to the here and now without bothering to step back in order to ensure that events are under your control. You take up challenges with excessive foolhardiness as a consequence of your impulsiveness. However, better than anyone else, you know how to mobilise your resources in case of crisis. You take action whenever it is necessary to do so, and you are present in a timely manner. With Mars, your attitudes are dictated by the realities of the moment, by your emotions, and by everything which proved to have worked in the past. When this dominant is not well integrated, it may bring about an aggressive or impulsive behaviour. Therefore, you must learn to control your hyper-sensitivity and your fits of temper. You are also endowed with Marsian qualities: the fighting spirit and the taste for duel without which one may find oneself overwhelmed by events. When this willpower is well channelled, its precious energy enables to cope with all sorts of contingencies. There are a thousand ways to win, and a thousand challenges to take up with the enthusiasm and the dynamism which make life so worthy. A certain idea of life which is wild, passionate, and in tune with events.\n\nWith Mars in the 9th House, everything unknown to you constitutes a challenge. Why should you hesitate? It is best to explore the world, to travel, and to cross swords with reality in order to learn and progress. But life cannot be discovered in a catalogue. You need to live your ideas through, even though it means that you get hurt. It is only through real stories that you succeed in overcoming your limitations, and in renewing yourself. Your concepts are unshakable because they are based on your experience and on your passionate nature. Adventure is a must!\n\nThe planet Mars indicates how you react to life concrete stimulations. It also describes your fighting spirit, your abilities to stand for yourself and to take action. With Mars in Virgo, you strive to control your emotions and to reduce your field of activity in order to keep a maximal level of efficiency in your actions. When you commit yourself into something, you display a strong ingenuity and resourcefulness and you intervene at the right time. Your actions are as efficient as they are discreet. You may not feel comfortable when the situation you face is not logical. The whims of fate are not your allies: but you analyze properly more stable situations and you handle them methodically well. You seldom take inconsiderate actions and you prefer to take the time to weigh up the pros and the cons before undertaking anything. Your entourage may see your reserve and your restraint as a lack of boldness.\n\nMars represents the desire for action and physical energy, sexuality, strength. For a woman, Mars corresponds to the kind of man she's attracted to (but not especially in marriage which is rather symbolized by the Sun, Mars is the lover, not the husband). Fire is its element, it is hot and dry, and it rules Aries and Scorpio (along with Pluto), is in exaltation with Capricorn and is in analogy with the muscles and the spleen.\n\nIf you wish, you can receive immediately in your mailbox your detailed astrological portrait , a nice gift for yourself or for your close friends and relatives, who will deeply appreciate it.\n\nN.B.: symbolic degrees belong to a branch of fatalistic astrology. Their interpretation must be regarded with the utmost caution, especially given the fact that different authors give different meanings to symbolic degrees. This is the reason why they are not included in our Astrotheme reports.\n\nStraightforward, independent, and clever character. One is fond of hunting or cattle-rearing. Although one comes across as gruff, one is deeply respected for one's honesty and common sense.\n\nIf Venus is part of your natal chart's planetary dominants, in astrology, you are said to be a Venusian: you are a sensual and emotional person particularly receptive to the natural likes and dislikes aroused by your contact with people. You are prone to frequent instinctive aversions and true passions which are exclusively driven by the feeling of love. The heart has its reasons which Reason knows nothing of... Your balance is based on the richness of your affective life. Without love, the Venusian is resourceless, lost, and deprived of any reason for living. You have an obvious and strong will to charm and to arouse the attachments without which you cannot properly function. Every area of your life is thus marked by your affectivity. The danger is that you may \"be taken in\" by charm. In such cases, you would prefer to keep your emotions under better control. Thus, hyper-sensitivity has its own inconveniences. Nevertheless, better than anyone else, you know how to play with feelings and attractions. Although you are sometimes caught in the traps of an over sensitive emotionalism, feelings remain your best assets in many circumstances. There is another aspect to the Venusian dominant. According to the Tradition, this planet rules the Arts, and you are endowed with some degree of artistic dispositions, ranging from good to excellent.\n\nVenus expresses her characteristics through the 10th House values. Your vocation is related to aesthetics, art, or decoration. Obviously, life does not always offer you the means to fully achieve your aspirations. Nevertheless, your Venusian qualities, namely charm, aesthetic taste, and receptiveness, remain valuable assets in order to assert your ambitions and to play a social role matching your true nature. You are endowed with a few artistic gifts, and an innate sense of beauty.\n\nVenus describes your affective life. On the day of your birth, she is found in Virgo. The control of your emotions is essential to you. You need to understand all the aspects of your sentimental life. Therefore, you do not commit your affectivity in tortuous or hazardous paths. This attitude may be interpreted as a form of reserve, of modesty or of shyness. You complicate your amorous relationships for fun... Moderation in all things, even and particularly in love! Appearances are misleading: your behaviour may seem cautious, even shy or timid, however, your affectivity is strong... Your heart is discreet and its impulses are controlled and moderate. You do not want your relationship to run out of your control. Your soul is loyal, you are helpful when necessary and you avoid crises, clashes and tragedies in order to not endanger your couple. You are keen to maintain the balance of your unions. But, as you strive too relentl"}, {"url": "https://ethnicelebs.com/evan-rachel-wood", "page_content": "Place of Birth: Raleigh, North Carolina, U.S.\n\nDate of Birth: September 7, 1987\n\nEthnicity: English, Irish, Scottish, German\n\nEvan Rachel Wood is an American actress, model, and musician. She is the daughter of playwright and actor Ira David Wood III and actress Sara Lynn Moore. Her brother is actor Ira David Wood IV. Evan has a son with her former husband, English actor Jamie Bell.\n\nEvan’s ancestry includes English, Irish, Scottish, and German.\n\nEvan’s father is Christian. Evan’s mother, who was raised in a Christian family, converted to Judaism during her own high school years. (a picture of Evan’s mother in her school year book can be seen here). Evan’s stepfather is also Jewish. On the audio commentary on the Thirteen (2003) DVD, Evan described herself as Jewish. In 2012, Evan stated, “I believe in God but I am not religious.” In 2013, Evan stated, “[I was raised] half Jewish and half Christian. but today I practice neither. I am more spiritual than religious.” She has also said, “My mother is Jewish and I was raised with the religion…”\n\nEvan’s paternal grandfather was Ira David Wood, Jr. (the son of Ira David Wood and Lucy Della Savage). Evan’s grandfather Ira was born in North Carolina. Evan’s great-grandfather Ira was the son of Joseph Daniel Wood and Ethalinda Elizabeth Holt. Lucy was the daughter of William Henry Savage and Margaret Ellen Merritt.\n\nEvan’s paternal grandmother was Bettie Lee Winstead (the daughter of William Herbert Winstead and Addie Ellis Dew). Bettie was born in North Carolina. William was the son of John Eugene/Lugeness Winstead and Lucy Viola E. Lee/Leigh. Addie was the daughter of George Jefferson Dew and Lucy Ellis Perry.\n\nEvan’s maternal grandfather is Richard Alan/Alen Moore (the son of Ira Mack “Denny” Moore and Helen Adoline Fakes). Richard was born in Missouri, and is a prominent landscape architect. Ira was the son of Solomon Festus Moore and Nora Louise McCloud/McLeod. Helen was the daughter of Baron DeCalb Fakes and Rosa Lee Snow.\n\nEvan’s maternal grandmother is Patricia Ruth Burke (the daughter of William Francis Burke and Louise Philippine Hartmann/Hartman). Patricia was born in Missouri. William was the son of Robert Fletcher Burke, who was Irish, and of Hester A. Woody. Louise was of German descent, the daughter of Wilhelm/William Frederich Hartmann/Hartman, who was German, and of Louise Caroline Wissler, who was born in Missouri, to German parents.\n\nEvan’s paternal grandmother’s surname, Winstead, is shared by actress Mary Elizabeth Winstead, who is also from North Carolina. While Evan and Mary Elizabeth likely have a common Winstead ancestor, this shared connection is distant, in or before the mid 1700s.\n\nSources: Article about Evan’s religious upbringing – http://www.interfaithfamily.com\n\nGenealogy of Evan Rachel Wood – https://www.geni.com\n\nGenealogy of Evan Rachel Wood (focusing on her father’s side) – http://familypedia.wikia.com\n\nEvan’s paternal grandfather, Ira David Wood, Jr., on the 1920 U.S. Census – https://www.familysearch.org\n\nObituary of Evan’s paternal grandmother, Bettie Lee (Winstead) Wood – http://www.legacy.com\n\nGenealogy of Evan’s maternal great-grandmother, Louise Philippine Hartmann/Hartman – https://www.geni.com"}, {"url": "https://healthyceleb.com/evan-rachel-wood/", "page_content": "Evan Rachel Wood Quick Info Height 5 ft 6¼ in Weight 54 kg Date of Birth September 7, 1987 Zodiac Sign Virgo Eye Color Blue\n\nEvan Rachel Wood is an American actress and activist who is best known for portraying roles such as Tracy Freeland in Thirteen, Kimberly Joyce in Pretty Persuasion, Natalie Finch in Running with Scissors, Dolores Abernathy / Christina in Westworld, and Jessie Sammler in Once and Again. She has also appeared in a variety of other TV shows and films such as The Missing, The Upside of Anger, The Life Before Her Eyes, Charlie Countryman, Into the Forest, Viena and the Fantomes, The Ides of March, The Wrestler, American Gothic, Touched by an Angel, CSI: Crime Scene Investigation, The West Wing, Robot Chicken, What We Do in the Shadows, Drunk History, and many more. She has been featured in the music videos of songs like Green Day’s Wake Me Up When September Ends, Marilyn Manson’s Heart-Shaped Glasses (When the Heart Guides the Hand), and Brandon Flowers‘s Can’t Deny My Love.\n\nBorn Name\n\nEvan Rachel Wood\n\nNick Name\n\nEvie\n\nSun Sign\n\nVirgo\n\nBorn Place\n\nRaleigh, North Carolina, U.S.\n\nNationality\n\nEducation\n\nShe was homeschooled for the most part but has attended Cary Elementary in Cary, North Carolina. At the age of 15, she earned her high school diploma via homeschooling.\n\nOccupation\n\nActress, model\n\nFamily\n\nFather – Ira David Wood III (Actor, singer, playwright)\n\nIra David Wood III (Actor, singer, playwright) Mother – Sara Lynn Moore (Actress, director, acting coach)\n\nSara Lynn Moore (Actress, director, acting coach) Siblings – Ira David Wood IV (Older Brother) (Actor), Dana Wood (Brother), Thomas Wood (Brother)\n\nIra David Wood IV (Older Brother) (Actor), Dana Wood (Brother), Thomas Wood (Brother) Others – Carol Winstead Wood (Paternal Aunt) (Hollywood Production Designer)\n\nManager\n\nAs a model, she was signed to these talent agencies –\n\nCreative Artists Agency\n\nCircle Talent Agency\n\nBuild\n\nSlim\n\nHeight\n\n5 ft 6¼ in or 168 cm\n\nWeight\n\n54 kg or 119 pounds\n\nBoyfriend / Spouse\n\nEvan Rachel Wood dated –\n\nEdward Norton (2004) – She was RUMORed to have had a fling with actor Edward Norton when she met him on the set of the 2005 film Down in the Valley during March 2004. He is about 18 years her senior. Jamie Bell (2005-2006; 2011-Present) – She started dating English actor, Jamie Bell in June 2005. They both met during the shooting of Green Day’s music video of “Wake Me Up When September Ends”. They parted their ways in 2006. But, after five years, the couple reconciled in the summer of 2011 and this time engaged on January 23, 2012, and later married on October 30, 2012. She also gave birth to a baby boy on July 29, 2013. Marilyn Manson (2007-2010) – In September 2007, she started dating musician Marilyn Manson after meeting him at Hotel Chateau Marmont in Los Angeles. They engaged in January 2010. But, this relationship also saw an end in August 2010. Joseph Gordon-Levitt (2008) – She was RUMORed to be dating actor Joseph in quarter 4 of 2008. She was seen with him on multiple occasions during these 3 months. Shane West (2009) – In the summer of June, the two seemed to be dating. But, the things ended soon between the two. Alexander Skarsgård (2009) – They had a fling together in July 2009, when Wood appeared in True Blood with Swedish actor, Alexander.\n\nRace / Ethnicity\n\nWhite\n\nHair Color\n\nBlonde\n\nEye Color\n\nBlue\n\nSexual Orientation\n\nBisexual (revealed via Twitter in August 2012)\n\nDistinctive Features\n\nBisexual nature\n\nMeasurements\n\n34-26-34 in or 86-66-86 cm\n\nDress Size\n\n4 (US) or 36 (EU)\n\nShoe Size\n\n9 (US)\n\nBrand Endorsements\n\nShe was chosen as the face of Gucci Guilty fragrance in 2010 alongside Chris Evans.\n\nReligion\n\nIn 2003, she stated that she is Jewish.\n\nHer mom converted to Judaism while her dad is a Christian.\n\nIn 2012, Evan revealed that she believes in God, but is not very religious; rather she is spiritual.\n\nBest Known For\n\nAppearing in films like Digging to China (1997), Little Secrets (2001), Thirteen (2003) and HBO’s drama TV series like True Blood (2009-2011).\n\nFirst Film\n\nIn 1994, she appeared in the TV film titled In the Best of Families: Marriage, Pride & Madness for her role as Little Susie. The film is based on Jerry Bledsoe’s novel Bitter Blood.\n\nFirst TV Show\n\nFrom 1995 to 1996, Evan Rachel played the role as Rose Russell in CBS’s horror series American Gothic. She appeared in three episodes.\n\nPersonal Trainer\n\nShe does meditation and dances a lot. She started meditating at the age of 12 and it really helps her to keep her mind sharp. Dancing, on the other hand, helps Wood to stay physically fit and active.\n\nEvan Rachel Wood Favorite Things\n\nActor – Gene Wilder\n\n– Gene Wilder Actress – Cate Blanchett\n\nSource – IMDb\n\nShe also mentioned about one of her favorite things on Twitter (pictured below).\n\nOne of my favorite things to do is text message @EllenPage random pictures of baby animals. — Evan Rachel Wood (@evanrachelwood) March 18, 2014\n\nEvan Rachel Wood Facts"}, {"url": "https://www.astro.com/astro-databank/Wood%2C_Evan_Rachel", "page_content": "Name Wood, Evan Rachel Gender: F born on 7 September 1987 at 13:24 (= 1:24 PM ) Place Raleigh, North Carolina, 35n46, 78w38 Timezone EDT h4w (is daylight saving time) Data source BC/BR in hand Rodden Rating AA Collector: Scholfield Astrology data 14°33' 14°05 Asc. 04°30'\n\n\n\n\n\n\n\n\n\n\n\nphoto: David Shankbone, license cc-by-3.0 Evan Rachel Wood\n\nBiography\n\nAmerican actress and singer. She began her acting career in the late 1990s, appearing in several television series, including American Gothic (1995–1996) and Once and Again (1999–2002). She made her début as a leading film actress in Little Secrets (2002) and became well known after her transition to a more adult-oriented Golden Globe-nominated role in the teen drama film Thirteen (2003).\n\nWood continued acting mostly in independent films, including Pretty Persuasion (2005), Down in the Valley (2006), Running with Scissors (2006), and in the big studio production Across the Universe (2007). Since 2008, Wood has appeared in more mainstream films, including The Wrestler (2008), Whatever Works (2009) and The Ides of March (2011). She has also returned to television, playing the supporting role of Queen Sophie-Anne on True Blood from 2009 to 2011 and playing Kate Winslet's daughter in the HBO miniseries Mildred Pierce (2011), a role for which she was nominated for the Golden Globe and Emmy Award for Best Supporting Actress.\n\nWood has been described by The Guardian as \"one of the best actresses of her generation.\" Her personal life, particularly her relationship with Marilyn Manson, to whom she was engaged until August 2010, has attracted press attention. On 30 October 2012, she married English actor Jamie Bell, born 14 March 1986.\n\nLink to Wikipedia biography\n\nRelationships\n\nlover relationship with Manson, Marilyn (born 5 January 1969)\n\nEvents\n\nRelationship : Marriage 30 October 2012\n\nchart Equal_H. chart Placidus\n\nFamily : Change in family responsibilities July 2013 (gave birth to son at home)\n\nchart Equal_H. chart Placidus\n\nSource Notes\n\nTwitter quote\n\nOn Twitter in answering the question 'where you born around 1pm ?' american actress Evan Rachel Wood said her time is 1:12 PM in a personal Tweet. Screen dump of tweet was provided by forum user Red Bull.\n\nSy Scholfield quotes birth certificate in hand (1:24pm), data published in a blog entry of 26 August 2013.\n\nCategories\n\nTraits : Mind : Education limited (finished high school at 15)\n\nFamily : Childhood : Family noted (Both parents are actors)\n\nFamily : Childhood : Sibling circumstances (three brothers, one sister)\n\nFamily : Relationship : Mate - Noted (actor Jamie Bell)\n\nFamily : Parenting : Kids 1-3 (one son)\n\nLifestyle : Social Life : Sports (martial arts)\n\nPassions : Sexuality : Bi-Sexual\n\nPersonal : Religion/Spirituality : Western\n\nVocation : Entertainment : Actor/ Actress\n\nVocation : Entertainment : Child performer\n\nVocation : Entertainment : TV series/ Soap star\n\nVocation : Entertainment : Voice-Over"}, {"url": "https://www.sportskeeda.com/pop-culture/how-old-is-evan-rachel-wood", "page_content": "Source: Evan Rachel Wood's Facebook\n\n\n\n\n\nEvan Rachel Wood is 35 years old, as of May 2023.\n\n\n\n\n\nEvan Rachel Wood is an American actress, born on September 7, 1987. She began her acting career at a young age, gaining recognition for her roles in films like \"Thirteen'' and \"Across the Universe.\" Wood has showcased her versatility in various genres, from drama to science fiction. She earned critical acclaim and multiple award nominations for her portrayal of Dolores Abernathy in the TV series \"Westworld.\"\n\n\n\n\n\nApart from acting, Wood is also a talented singer and songwriter. She has been an outspoken advocate for women's rights and has used her platform to address issues such as domestic violence and LGBTQ+ rights. Wood continues to make a significant impact in the entertainment industry.\n\n\n\n\n\nEvan Rachel Wood's Early Life\n\n\n\n\n\nSource: Evan Rachel Wood's Facebook\n\n\n\n\n\nEvan Rachel Wood was born on September 7, 1987, in Raleigh, North Carolina. She was raised in a family that had a strong connection to the performing arts. Her father, Ira David Wood III, is a prominent theater actor and director, while her mother, Sara Lynn Moore, is an actress and acting coach. Growing up in this creative environment, Wood developed a passion for acting from a young age.\n\n\n\n\n\nWood's early life involved a combination of homeschooling and attending a performing arts school. This allowed her to nurture her talent and further hone her skills as an actress. At the age of nine, she made her film debut in the 1998 drama \"Digging to China,\" where she showcased her natural talent and ability to captivate audiences.\n\n\n\n\n\nThroughout her childhood and teenage years, Wood continued to pursue acting, landing roles in various films and television shows. Her early performances, such as in the critically acclaimed film \"Thirteen\" (2003), showcased her remarkable talent and marked her as a rising star in the industry.\n\n\n\n\n\nEvan Rachel Wood's Career\n\n\n\n\n\nSource: Evan Rachel Wood's Facebook\n\n\n\n\n\nEvan Rachel Wood's career is marked by versatility and a wide range of roles in both film and television. After her early film debut, she gained critical acclaim for her performance in the coming-of-age drama \"Thirteen\" (2003), for which she received several award nominations. This breakthrough role opened doors for her in the industry and led to various opportunities.\n\n\n\n\n\nWood continued to showcase her talent in films such as \"The Wrestler\" (2008), where she starred alongside Mickey Rourke and earned her first Golden Globe nomination, and \"Across the Universe\" (2007), a musical set to the iconic songs of The Beatles. She also appeared in movies like \"Running with Scissors\" (2006), \"The Ides of March\" (2011), and \"Charlie Countryman\" (2013), among others.\n\n\n\n\n\nIn recent years, Wood gained significant recognition for her portrayal of Dolores Abernathy in the HBO series \"Westworld\" (2016-2020). Aside from acting, Wood is also a talented singer and songwriter. She has released her own music, with her musical abilities showcased in films like \"Across the Universe\" and through various musical collaborations.\n\n\n\n\n\nEvan Rachel Wood's Awards.\n\n\n\n\n\nSource: Evan Rachel Wood's Facebook\n\n\n\n\n\nEvan Rachel Wood has received several awards and nominations throughout her career. Here are some notable accolades she has received:\n\n\n\n\n\nGolden Globe Awards: Wood was nominated for Best Supporting Actress for her role in the film \"Thirteen\" (2003) and Best Actress in a Television Series - Drama for her performance in the series \"Westworld\" (2016-2020).\n\n\n\n\n\nScreen Actors Guild Awards: Wood received nominations as part of the ensemble cast of the film \"The Wrestler\" (2008) and the TV series \"Westworld.\" The latter earned her two nominations for Outstanding Performance by an Ensemble in a Drama Series.\n\n\n\n\n\nCritics' Choice Television Awards: Wood received multiple nominations for her role in \"Westworld,\" including Best Actress in a Drama Series.\n\n\n\n\n\nSatellite Awards: She was nominated for Best Actress in a Drama Series for \"Westworld.\"\n\n\n\n\n\nPrimetime Emmy Awards: Wood received a nomination for Outstanding Lead Actress in a Drama Series for her performance in \"Westworld.\""}, {"url": "https://www.tvinsider.com/people/evan-rachel-wood/", "page_content": "Actress\n\nBirth Date: September 7, 1987\n\nAge: 35 years old\n\nBirth Place: Raleigh, North Carolina\n\nActor Evan Rachel Wood first gained fame while still in grade school on the cult TV series \"American Gothic\" (CBS, 1995-96) and \"Once And Again\" (ABC, 1999-2002). She then went on to wow critics with her portrayal of a young girl who dives headlong into sex and drugs in the disturbing indie drama, \"Thirteen\" (2003), for which she received a Golden Globe nomination. After that star-making performance, Wood alternated between mainstream Hollywood features and independent productions, though the latter remained her bread and butter with turns in \"Down in the Valley\" (2006), \"Running with Scissors\" (2006) and \"Across the Universe\" (2007). She delivered another sterling performance, this time opposite Mickey Rourke as his estranged daughter in \"The Wrestler\" (2009), before landing the recurring role of a vampire queen for the second and third seasons of the hit show \"True Blood\" (HBO, 2008-14). By the time she earned critical applause for \"Mildred Pierce\" (HBO, 2011), Wood was already well-established as a talented young actress who time and again impressed audiences alike with her mature and complex performances."}, {"url": "https://nextbirthdays.com/people/evan-rachel-wood-actress/", "page_content": "The first name of the personality is Evan . The star's first name, surname or nickname begins with the letter or letters of the alphabet e , r .\n\nEvan Rachel Wood (born September 7, 1987) is an American actress. She is the recipient of a Critics' Choice Television Award as well as three Primetime Emmy Award nominations and three Golden Globe Award nominations for her work in film and television.\n\nShe began acting in the 1990s, appearing in several television series, including American Gothic (1995–96) and Once and Again (1999–2002). She made her debut as a leading film actress at the age of nine in Digging to China (1997) and garnered acclaim for her Golden Globe-nominated role as the troubled teenager Tracy Freeland in the teen drama film Thirteen (2003). She continued acting mostly in independent films, including Pretty Persuasion (2005), Down in the Valley (2005), Running with Scissors (2006), and Across the Universe (2007).\n\nSince 2008, Wood has appeared in more mainstream films, including The Wrestler (2008), Whatever Works (2009), The Ides of March (2011), and she portrayed Madonna in Weird: The Al Yankovic Story (2022). She returned to television the following year in the recurring role of Sophie-Anne Leclerq, the vampire Queen of Louisiana, on True Blood from 2009 to 2011. She also portrayed the title character's malicious daughter in the HBO miniseries Mildred Pierce (2011), for which she was nominated for the Golden Globe and Emmy Award for Best Supporting Actress. She starred as sentient android Dolores Abernathy in the HBO series Westworld (2016–2022), for which she won a Critics' Choice Award and earned Golden Globe and Emmy Award nominations. She also voiced Queen Iduna in the Disney animated fantasy film Frozen II (2019).\n\nSource : Wikipedia"}], "Evan Rachel Wood's profession is actress.": [{"url": "https://www.tvinsider.com/people/evan-rachel-wood/", "page_content": "Actress\n\nBirth Date: September 7, 1987\n\nAge: 35 years old\n\nBirth Place: Raleigh, North Carolina\n\nActor Evan Rachel Wood first gained fame while still in grade school on the cult TV series \"American Gothic\" (CBS, 1995-96) and \"Once And Again\" (ABC, 1999-2002). She then went on to wow critics with her portrayal of a young girl who dives headlong into sex and drugs in the disturbing indie drama, \"Thirteen\" (2003), for which she received a Golden Globe nomination. After that star-making performance, Wood alternated between mainstream Hollywood features and independent productions, though the latter remained her bread and butter with turns in \"Down in the Valley\" (2006), \"Running with Scissors\" (2006) and \"Across the Universe\" (2007). She delivered another sterling performance, this time opposite Mickey Rourke as his estranged daughter in \"The Wrestler\" (2009), before landing the recurring role of a vampire queen for the second and third seasons of the hit show \"True Blood\" (HBO, 2008-14). By the time she earned critical applause for \"Mildred Pierce\" (HBO, 2011), Wood was already well-established as a talented young actress who time and again impressed audiences alike with her mature and complex performances."}, {"url": "https://www.thefamouspeople.com/profiles/evan-rachel-wood-1380.php", "page_content": "She studied at ‘Cary Elementary,’ a public school in Cary, North Carolina. She then continued her studies at home, earning her high school diploma at the age of 15.\n\nHer father cast her in his 1987 adaptation of ‘A Christmas Carol.’ She was also cast in ‘Ghost of Christmas Past.’ She was later cast as ‘Helen Keller,’ alongside her mother, in a production of ‘The Miracle Worker.’\n\nShe has three brothers: Ira David Wood IV, Dana Wood, and Thomas Wood. She also has a sister named Aden. Wood and her brothers were involved in ‘Theatre in the Park.’ Her aunt, Carol Winstead Wood, was a production designer in Hollywood.\n\nEvan Rachel Wood was born on 7 September 1987, in Raleigh, North Carolina, USA, to Ira David Wood III and Sara Lynn Moore. Both her parents are actors. Her father is also the executive director of ‘Theatre in the Park.’\n\nRecommended Lists:\n\nCareer\n\nIn 1996, her parents separated and she moved with her mother to Los Angeles. She was cast in ‘Once and Again’ as ‘Jessie Sammler.’\n\nShe played ‘Harriet Frankovitz,’ a young girl who befriends a mentally ill man, in ‘Digging to China,’ which starred Kevin Bacon and Mary Stuart Masterson. The film won the ‘Children’s Jury Award’ at ‘Chicago International Children’s Film Festival.’\n\nIn 1998, she was cast in the fantasy film ‘Practical Magic’ which was directed by Griffin Dunne. She played the daughter and niece of the characters, portrayed by Sandra Bullock and Nicole Kidman respectively.\n\nIn 2001, Wood landed the lead role of ‘Emily Lindstrom,’ an aspiring concert violinist, in ‘Little Secrets.’ She won a nomination for ‘Best Leading Young Actress’ at the ‘Young Artist Awards.’\n\nIn 2003, she acted alongside Cate Blanchett and Tommy Lee Jones in ‘The Missing.’ She also acted in the ‘Got Murder?’ episode of the TV series ‘CSI: Crime Scene Investigation.’\n\nIn 2005, she played ‘Lavender Wolfmeyer,’ one of four sisters handling the disappointment of their father's absence, in ‘The Upside of Anger.’ Wood’s character narrated the movie, which starred Kevin Costner and Joan Allen.\n\nIn ‘Down in the Valley,’ directed by David Jacobson, she played the role of ‘Tobe’ who falls in love with an older man, played by Edward Norton.\n\nThe 2007 released ‘King of California’ saw her in the role of ‘Miranda,’ the teenage daughter of a jazz musician suffering from a mental illness, played by Michael Douglas.\n\nIn 2007, she played young ‘Diana McFee’ in ‘The Life Before Her Eyes,’ which was directed by Vadim Perelman. The movie was based on Laura Kasischke’s novel of the same name.\n\nContinue Reading Below\n\nWood played the estranged daughter of ‘Randy Robinson,’ played by Mickey Rourke, in the 2008 released film ‘The Wrestler,’ which was directed by Darren Aronofsky. The movie won the ‘Golden Lion Award’ for ‘Best Film’ at ‘Venice Film Festival.’\n\nIn 2009, she played ‘Melodie’ opposite Larry David in Woody Allen’s ‘Whatever Works.’ She played ‘Juliet’ in a fundraising production of William Shakespeare’s ‘Romeo and Juliet,’ directed by her brother.\n\nFrom 2009 to 2011, she played the recurring role of ‘Sophie-Anne Leclerq’ in the ‘HBO’ series ‘True Blood.’ In ‘The Conspirator,’ she played ‘Anna Surratt.’ She also acted in ‘The Ides of March.’\n\nIn ‘Mildred Pierce,’ the 2011 ‘HBO’ miniseries, she portrayed the title character’s daughter ‘Veda Pierce.’ She was nominated for the ‘Primetime Emmy Award’ for ‘Outstanding Supporting Actor in a Miniseries or a Movie.’\n\nFrom 2013 to 2015, she appeared in a number of movies, such as ‘A Case of You’ (2013), ‘Barefoot’ (2014), ‘Strange Magic’ (2015), and ‘Into the Forest’ (2015).\n\nIn 2016, she was cast as the sentient android ‘Dolores Abernathy’ in the ‘HBO’ science fiction TV series ‘Westworld.’ For her role, she was nominated at the ‘Golden Globes’ and ‘Primetime Emmy Awards.’"}, {"url": "https://www.the-sun.com/entertainment/4527723/who-actress-evan-rachel-wood/", "page_content": "EVAN Rachel Wood made headlines in January 2022 after she made allegations against Marilyn Manson in a new documentary.\n\nThe two had previously dated in the early 2000s before parting ways.\n\n2 Evan Rachel Wood is an actress Credit: Getty Images\n\nWho is actress Evan Rachel Wood?\n\nBorn September 7, 1987, Wood, 34, is known as an American actress, model, and musician.\n\nShe is the winner of a Critics' Choice Television Award and has also been nominated three times for a Primetime Emmy Award as well as three Golden Globe Awards.\n\nWood is famously known for portraying the role of Dolores Abernathy on HBO's Westworld and has also been seen in Thirteen, Whatever Works and Across the Universe.\n\nOver the years, she has also appeared in a number of music videos including Green Day's Wake Me Up When September Ends and Marilyn Manson's Heart-Shaped Glasses (When the Heart Guides the Hand).\n\nAs of January 2022, she has an estimated net worth of $8million, and earns $250,000 per episode of Westworld, according to Celebrity Net Worth.\n\nWhat did Evan Rachel Wood say accuse Marilyn Manson of?\n\nIn January 2022, Wood accused Manson, 53, again of raping her on his music video set in 2007.\n\nShe was reportedly \"coerced into a commercial sex act under false pretenses,\" and had only agreed to a “simulated sex scene,\" according to a new documentary about her life and career, which premiered at the 2022 Sundance Film Festival.\n\nIn the film, Wood claimed that Manson “started penetrating me for real” once the cameras were rolling,\" The Guardian reports.\n\n“I had never agreed to that,” she said. “I was coerced into a commercial sex act under false pretenses. That’s when the first crime was committed against me and I was essentially raped on camera.”\n\nShe has also accused the star of grooming her.\n\n\"The name of my abuser is Brian Warner, also known to the world as Marilyn Manson,\" she wrote in a February 2021 Instagram post.\n\n\"He started grooming me when I was a teenager and horrifically abused me for years. I was brainwashed and manipulated into submission. I am done living in fear of retaliation, slander, or blackmail.\n\n\"I am here to expose this dangerous man and call out the many industries that have enabled him, before he ruins any more lives,\" she continued.\n\nManson and Wood met back in 2006 when she was 18 and he was 38. They later went on to start a relationship that lasted from 2007 to 2010.\n\nWhile Manson has not addressed Wood's documentary, he has denied previous allegations, calling them “horrible distortions of reality,\" stating that \"my intimate relationships have always been entirely consensual.\"\n\n\"Obviously, my life and my art have long been magnets for controversy, but these recent claims about me are horrible distortions of reality,\" Manson said in February 2021.\n\n\"My intimate relationships have always been entirely consensual with like-minded partners. Regardless of how — and why — others are now choosing to misrepresent the past, that is the truth.\"\n\nWood is also not the first woman to accuse Manson of sexual assault, he is the subject of four lawsuits accusing him of sexual assault, battery, and harassment.\n\nHis home was also raided by the Los Angeles County sheriff’s department in November 2021 after the Special Victims Unit obtained search warrants.\n\nOther women that have made accusations against Manson include Ashley Walters and Game of Thrones actress Esmé Bianco.\n\nWood's documentary, Phoenix Rising, is scheduled to debut on HBO in March 2022.\n\n2 The Westworld star has accused Marilyn of rape Credit: Getty\n\nIs Evan Rachel Wood married?\n\nTwo years after her relationship with Manson ended, Wood walked down the aisle with English actor and dancer Jamie Bell.\n\nBell, 35, is famously known for his debut role in Billy Elliot, for which he won the 2001 BAFTA Award for Best Actor in a Leading Role, making him one of the youngest winners of the award.\n\nThe couple eventually parted ways in 2014.\n\nPrior to their divorce, Bell and Wood welcomed a son, Jack, 8, in 2013."}, {"url": "https://www.celebsline.com/evan-rachel-wood/", "page_content": "Evan Rachel Wood is an American actress and musician best known for her portrayal of Dolores Abernathy in the HBO series Westworld, for which she received a Golden Globe and Emmy Award nomination. She was cast in many popular TV series like True Blood Doll & Em, Once and Again, Profiler, and American Gothic. She was first recognized for her role as Tracy Louise Freeland in the 2003 film Thirteen, which earned her widespread fame and several accolades. Her film credits include The Wrestler, Whatever Works, and The Ides of March.\n\nEvan Rachel Wood Biography\n\nBirth Name\n\nEvan Rachel Wood\n\nNickname\n\nEvie\n\nProfession\n\nActress, Musician, Model\n\nNationality\n\nAmerican\n\nBirthday / Date of Birth\n\nEvan Rachel Wood was born on 7 September 1987, in Raleigh, North Carolina, U.S.\n\nAge\n\nShe is currently 31 years old.\n\nSun Sign\n\nVirgo\n\nEthnicity\n\nWhite\n\nShe has English, Irish, Scottish, and German ancestry.\n\nReligion\n\nJewish\n\nEducation\n\nWood briefly attended Cary Elementary, a public school in Cary, North Carolina. She received her high school diploma at age 15 through homeschooling.\n\nFamily Details\n\nFather – Ira David Wood III (Actor, Singer)\n\n– Ira David Wood III (Actor, Singer) Mother – Sara Lynn Moore (Actress, Director)\n\n– Sara Lynn Moore (Actress, Director) Siblings – Ira David Wood IV (Older Brother) (Actor), Dana Wood (Brother), Thomas Wood (Brother)\n\nEvan Rachel Wood Husband\n\nEvan Rachel Wood married English actor, Jamie Bell on October 30, 2012. They have a son, on July 29, 2013. The couple ended their marriage in 2014.\n\nPrior to her marriage with Bell, Wood dated musician Marilyn Manson from 2007 until 2010. Their relationship garnered widespread media attention and was largely discussed in the press during this time. There are also engaged. She also dated The L Word actress Katherine Moennig.\n\nIn 2009, she had a fling with her True Blood co-star Alexander Skarsgård. In January 2017, Wood became engaged to her Rebel and a Basketcase bandmate, Zach Villa and they called off the engagement in September 2017.\n\nPhysical Statistics\n\nHeight\n\nFeet – 5 feet 6.25 inches\n\n– 5 feet 6.25 inches Centimeters – 168 cm\n\n– 168 cm Meters – 1.6 m\n\nWeight\n\nIn Kilograms – 54 kg\n\n– 54 kg In Pounds – 119 lbs\n\nBody measurements\n\nMeasurements – 33-26-34\n\n– 33-26-34 Bust – 33 inches\n\n– 33 inches Waist – 26 inches\n\n– 26 inches Hip – 34 inches\n\n– 34 inches Bra Size – 32A\n\nBody Build\n\nSlim\n\nEye Color\n\nBlue\n\nHair Color\n\nBlonde\n\nShoe Size\n\nShe wears a size 9 (US) shoe.\n\nDress Size\n\nHer dress size is 4 (US).\n\nSexuality\n\nBisexual\n\nProfessional Statistics\n\nFilm Debut\n\nEvan Rachel Wood made her big-screen debut in the 1997 film “Digging to China” for her role as Harriet Frankovitz. She was just nine years old when she was cast in the film that won the Children’s Jury Award at the Chicago International Children’s Film Festival.\n\nTelevision Debut\n\nWood made her first appearance in the 1994 television film, “In the Best of Families: Marriage, Pride & Madness”, playing Little Susie.\n\nShe played Rose Russell in n CBS’s horror series American Gothic from 1995 to 1996.\n\nFamous For\n\nHer role as Tracy Freeland in the film ‘Thirteen’ for which she earned a Golden Globe and a Screen Actors Guild Award nominations.\n\nHer roles in the HBO series, True Blood (2009-2011) and Westworld (2016 – Present).\n\nBrand Endorsements\n\nIn 2016, she served as the face of Gucci’s Guilty fragrance.\n\nFavorite Things\n\nActor – Gene Wilder\n\nActress – Cate Blanchett\n\nEvan Rachel Wood Net worth\n\nAs of 2023, Evan Rachel Wood has a net worth of $8 million. She divides her time between Los Angeles and New York.\n\nSocial Media Profiles\n\nFacebook – officialevanrachelwood\n\n– officialevanrachelwood Instagram – evanrachelwood\n\n– evanrachelwood Twitter – evanrachelwood\n\nEvan Rachel Wood Facts\n\nShe earned a black belt in taekwondo at the age of 12 years old.\n\nWood is a trained dancer.\n\nShe loves to sing, swim, rollerblade, and go horseback riding.\n\nIn 2001, Wood was named #31 in Maxim’s Hot 100 Women list.\n\nIn 2003, Vogue Magazine named her one of the “It Girls of Hollywood.”\n\nThe documentary “The Business of Being Born” by Ricki Lake was inspired by her as she gave home birth to her son. She thanked the author publicly for the same.\n\nIn 2009, she was ranked #1 in Venus Zine’s 25 Under 25 ladies list."}, {"url": "https://famousmarried.com/evan-rachel-wood/", "page_content": "Evan Rachel Wood is an American actress and singer whose breakthrough role in the film Thirteen led to other notable roles in films such as Mildred Pierce and Westworld. Her role in Thirteen catapulted her to fame, earning her Golden Globe and Emmy nominations. Her powerful performance as Stephanie in Darren Aronofsky’s The Wrestler earned her acclaim and further praise. Since 2016, she has played Dolores Abernathy in the science fiction thriller television series Westworld, for which she has received numerous prestigious awards such as the Critics’ Choice Television Award and the Satellite Award. Her roles in Practical Magic, Down Will Come Baby, Profiler, and Once and Again are also noteworthy.\n\nEvan Rachel Wood’s Childhood and Education\n\nEvan Rachel Wood was born on September 7, 1987, in Raleigh, North Carolina, to theatre actor and writer Ira David Wood III and actress and acting coach Sara Lynn Moore. Ira David Wood IV, Dana Wood, and Thomas Wood were her three brothers who raised her in Raleigh.\n\nWood is a devout follower of the Jewish faith. Rachel’s ethnic background includes English, Irish, Scottish, and German ancestry. Her nationality is American. Her mother is from a Christian family who converted to Judaism, and her father is also from a Christian family.\n\nWood and her brothers were active participants in several theatrical productions when she was a child. She made her stage debut as a one-year-old in her father’s musical comedy adaptation of A Christmas Carol in 1987. Her parents divorced in 1997, and she and her mother moved to her mother’s hometown of Los Angeles County, California.\n\nWood enrolled in a San Fernando Valley high school but dropped out due to the school’s environment. She later attended Cary Elementary School, a public school in Cary, North Carolina. She was home-schooled after that and graduated from high school at the age of 15.\n\nProfessional Career of Evan Rachel Wood\n\nEvan Rachel Wood made her professional acting debut in the TV series American Gothic as a recurring character. She made her big-screen debut alongside Kevin Bacon and Mary Stuart Masterson in the low-budget 1998 film Digging to China.\n\nIn 2002, Wood landed a major role in Little Secrets as Emily Lindstrom, an aspiring concert violinist. She was also nominated for a Young Artist Award for Best Leading Young Actress for her work in the film. Her big break came in 2003 when she starred in the film Thirteen. She then went on to star alongside Cate Blanchett and Tommy Lee Jones in the thriller The Missing the following year.\n\nAsterix and the Vikings, Running with Scissors, The Life Before Her Eyes, Across the Universe, and Mildred Pierce was among the films and TV series in which Wood appeared. In the hit series True Blood, she played Sophie-Anne Leclerq from 2009 to 2011.\n\nMildred Pierce, a 2011 HBO miniseries, starred Wood as the title character. The Conspirator, Charlie Countryman, A Case of You, and Into the Forest are among her other works.\n\nWood has been playing Dolores Abernathy in the fantasy sci-fi series Westworld since 2016, based on Michael Crichton’s 1973 film. For her portrayal of Dolores Abernathy in the series, she received Golden Globe and Emmy nominations. She made an appearance in Drunk History in 2018.\n\nThe following are a few of her most popular series.\n\nSeries Role IMDb Rating Awards Cast Members Once and Again (1999-2002) Jessie Sammler 7.8 Young Artist Awards (won) Sela Ward\n\nBilly Campbell\n\nJeffrey Nordling Mildred Pierce (2011) Veda Pierce 8 – Kate Winslet\n\nGuy Pearce Doll & Em (2015) Evan 6.5 – Dolly Wells\n\nAaron Himelstein Westworld (2016-present) Dolores Abernathy 8.9 Critics’ Choice Television Award and Satellite Awards Thandie Newton\n\nJeffrey Wright\n\nJames Marsden\n\nOther Appearances And Music\n\nWood sang I’d Have You Anytime on the fourth CD of Chimes of Freedom: Bob Dylan’s Songs Honoring 50 Years of Amnesty International, a compilation produced for the benefit of the organization, in 2012. She’s also a member of the Rebel and a Basketcase, an electro-pop duo she founded in 2016 with multi-instrumentalist Zach Villa.\n\nWood performed at the 2010 MTV Video Music Awards on September 12, 2010.\n\nEvan Rachel Wood has a net worth of $1 million.\n\nEvan Rachel Wood has appeared in a number of notable films and television shows. She has also amassed a sizable fortune from her career, with a Celebrity Net Worth of around $8 million, according to Celebrity Net Worth.\n\nThe following is a list of her high-end automobiles.\n\nCar Price Jeep Cherokee $27,690- $31,570. Ford Escape $23,850 Audi Q7 $53,788 Chevrolet Traverse $40,000\n\nBudget for a movie role\n\nMovie Role Budget Box Office IMDb Rating Cast Members The Upside of Anger (2005) Lavender “Popeye” Wolfmeyer $12 million $28,237,190 6.9 Joan Allen\n\nKevin Costner Simone Lainey Christian $10 million $19.6 million 6.1 Al Pacino\n\nCatherine Keener The Wrestler (2008) Stephanie Ramzinski $6 million $44.7 million 7.9 Mickey Rourke\n\nMarisa Tomei\n\nPersonal Life of Evan Rachel Wood\n\nIn the year 2005, Evan Rachel was in a relationship with British actor Jamie Bell. Green Day’s song “Wake Me Up When September Ends” featured the couple in a music video together. Both of their left ankles were tattooed with the letter J. In 2006, their relationship came to an end. She stated, “I love Jamie,” when asked about her relationship with him.\n\n“Because we knew our love would last forever, we got matching tattoos.” The problem is that it didn’t work out; things happened, and we parted ways. However, I have no regrets about the tattoo. It takes me back to a wonderful time in my life.”\n\nAfter a year, Wood made her relationship with Marilyn Manson public. The couple first met at a Chateau Marmont Hotel party. She claimed that Manson’s frequent use of black eyeliner drew her in, and she described her relationship with him as “healthy and loving.”\n\nWood appeared in the video for Heart-Shaped Glasses with her boyfriend Manson. For her role in the video, she also became the highest-paid actress in music video history. They split up in 2008, despite having a loving relationship. In the beginning of 2010, it was reported that the couple had reunited and that they had also become engaged to marry.\n\nHowever, in August 2010, they called off their engagement. The following year, she announced on Twitter that she was bisexual, and in an interview with Esquire, she said, “I’m a bisexual.”\n\n“I’m willing to try anything.” “Get to know a nice guy, get to know a nice girl…”\n\nMore\n\nIn the summer of 2011, Wood revealed that she had rekindled her relationship with Jamie Bell. On October 30, 2012, the couple married in a small ceremony. In July 2013, they welcomed their first child, a son. However, after 19 months of marriage, the couple divorced.\n\nFollowing their breakup, Wood began dating Katherine Moennig of The L Word. Then she began dating Zach Villa, a Rebel and Basketcase bandmate, and the two became engaged in January 2017. Despite this, they called off their engagement in September of 2017. She is currently enjoying her single life after a string of failed relationships.\n\nAside from acting, the versatile actress enjoys singing, swimming, and rollerblading. She enjoys horseback riding and has been a lifelong David Bowie fan. Cate Blanchett is her favorite actress, and Gene Wilder is her favorite actor. She is a tae kwon do black belt.\n\nAssault on a woman\n\nWood claimed she was raped twice many years ago in an interview with a Rolling Stone reporter. She has not, however, revealed the identity of the perpetrator. She claimed to be a rape survivor and a sexual abuse survivor in front of the United States House Judiciary Subcommittee on Crime, Terrorism, Homeland Security, and Investigations."}, {"url": "https://celebs99.com/evan-rachel-wood/", "page_content": "Evan Rachel Wood is an 34 years old American Actress, Model, Musician who started her career when she was just 10 years old during the year 1997.\n\nEvan Rachel grew up along with her parents and four siblings Ira David Wood IV, Dana Wood, Aden Elins, Thomas Wood in her hometown North Carolina, USA.\n\nBorn on 1987 in North Carolina, USA actress Evan Rachel is a very popular celebrity in the United States and all around the world due to her amazing acting performances in multiple Hollywood movies.\n\nIn this article you will find out everything about American actress Evan Rachel Wood – Age, Height, Biography, Net Worth, Husband, Early & professional life, Movies.\n\nEvan Rachel Wood Bio\n\nFull Name Evan Rachel Wood Birth Name NA Nickname Evan Profession Actress + Model + Musician Nationality American Date of Birth 7 September 1987 Age 34 years old as of 2022 Birth Place Raleigh, North Carolina, USA Gender Female Religion Jewish Hometown NA Hobbies NA School Cary Elementary School, Laurel Springs School University NA Qualification High school Graduate Zodiac Sign Virgo Languages English Net Worth $ 8 million Salary (per annum) NA Ethnicity NA Marital Married Spouse Jamie Bell (m. 2012, div. 2014) Boyfriend NA Children Jack Matfin Bell Parents Ira David Wood III,\n\nSara Lynn Moore Siblings Ira David Wood IV,\n\nDana Wood,\n\nAden Elins,\n\nThomas Wood\n\nEvan Rachel is an American Actress, Activist, Model and Singer. She was born on September 7 1987, in Raleigh, North Carolina. For the lead role in an interview, she screen tested at the age of five against Kirsten Dunst with the Vampire.\n\nHer father Ira David Wood III, is a Thratre Actor, Writer and Director and his mother Sara Wood is also an Actress and an Acting coach.\n\nEvan’s Siblings are Ira David Wood IV, Dana Wood, Aden Elins and Thomas Wood.\n\nShe is the receiver of Critics’ Choice Television Award as well as three Primetime Emmy Award nominations and three Golden Globe Award nominations for her work in film and television.\n\nEvan and her brothers sometimes performed at Theatre In The Park in Raleigh, which her father founded and where he serves as executive director.\n\nShe began her acting in 1990s starting in some Television series including, American Gothic and Once and Again.\n\nHer first debut in the film as a lead role is Digging to China at the age of nine.\n\nWood has been described by The Guardian newspaper as being “wise beyond her years” and as “one of the best actresses of her generation”.\n\nEducation\n\nEvan was born and bought up in Raleigh, North Carolina. After a long auditioning process of The Vampire Chronicles, she moved to Los Angeles with her and brother Ira.\n\nShe started her schooling her Cary Elementary School, later she received her high school diploma in Laurel Springs School in the age of 15.\n\nEarly life\n\nWood was born in Raleigh, North Carolina. She is basically from a family who has taken their career in acting fields where in her mother Sara Lynn Moore, is an actress, director, and acting coach, and her father Ira David Wood III, is a locally prominent actor, singer, theater director, and playwright.\n\nHe is also the executive director of a local community theatre company called Theatre in the Park. Her mother got converted to Judaism and raised her daughter in the Jewish faith.\n\nWood’s brother, Ira David Wood IV, is also an actor. She also have two other brothers, Dana and Thomas who are not belonging to this field.\n\nHer sister Aden who also into this field again. She has a paternal aunt who is a Hollywood Production Designer. Wood’s parents separated in 1996, and divorced in 2002.\n\nIn 1997 Wood moved with her mother to her mother’s native Los Angeles County, California.\n\nBefore that she started her schooling in Cary Elementary School in Cary, North Carolina.\n\nShe left the public schooling at the age of 12 joined for homeschooling because of bullying.\n\nShe completed her high school diploma at age15.\n\nPersonal life\n\nEvan Rachel Wood is reportedly single right now. She is not married, so there is no Evan Rachel Wood husband.\n\nHowever, she was married to ex Jamie Bell from 2012 to 2014.\n\nEvan rachel wood and Jamie bell\n\nThis list of Evan Rachel Wood exes includes Zach Villa and Marilyn Manson.\n\nShe has a child name Jack Matfin Bell born on 2013.\n\nProfessional life\n\nWood started her career in 1994 in Television films, she was casted as Little Susie in the film Best of Families: Marriage, Pride & Madness.\n\nIn the same year she starred as Young Sarah / Robin in the film Search for Grace.\n\nShe pursued herself as Tessa in A Father for Charlie and in Death in Small Doses as Anna.\n\nIn the 3 episodes of American Gothic as Rose Russell in 1995-1996.\n\nA television film called Get to the Heart: The Barbara Mandrell Story as Jaime Dudney in 1997.\n\nShe starred as Chloe waters in 6 episodes of Profiler 1998-99. Down Will Come Baby is a true-story American thriller drama based on a book by Gloria Murphy released on 1999 where Rachel acted as Robin Garr.\n\nShe had a main cast in Once and Again as Jessie Sammler in 1992-2002. In the episode Pandor’s Box she casted as Sarah Radcliff in Touched by an Angel.\n\nIn 2002, a film called The West Wing as Hogan Cregg in the episode “The Black Vera Wang”.\n\nThe episode Got Murder Evan was casted in the role of Nora Easton in Crime Scene Investigation in 2003.\n\nIn 2009-11 True Blood, an American fantasy horror drama, Rachel casted as Sophie-Anne Leclerq in 8 episodes.\n\nIn the 2 episodes of miniseries of the film Mildred Pierce Rachel starred as Veda Pierce in 2011.\n\nRobot Chicken Rachel was as Travis’ Girlfriend / Mother (voice) in the episode: “Botched Jewel Heist” in 2013.\n\nIn the 5 episodes of Doll & Em in 2015 Evan has the role of her real name Evan.\n\nThe present show which was started in 2016, Westworld Evan was casted as Dolores Abernathy in the main role of 3 season.\n\nDrunk History which took place on 2018-19 Rachel acted in various characters in 2 episodes.\n\nIn 2019 Rachel starred in What We Do in the Shadows as Evan the Immortal Princess of the Undead in the Episode: “The Trial” in 2019.\n\nHer recent television show is Phoenix Rising where she is carrying the character of herself.\n\nShe has done so many Music videos which includes “Wake Me Up When September Ends” from Green Day in 2005, “At the Bottom of Everything” from Bright Eyes in 2005, In 2007 “Heart-Shaped Glasses (When the Heart Guides the Hand)” sang by Marilyn Manson, in 2010 “Love Me Chase Me” singing credits to Carney.\n\nShe herself sang “I’d Have You Anytime” in 2012. In 2015 “Can’t Deny My Love” sang by Brandon Flowers, “Uneventful Days” from Beck in 2015.\n\nIn 2020″ Can I Be Your Friend ft. Evan Rachel Wood” from Chevy Mustang. In 2021 “11:11” sang by Ben Barnes.\n\nComing to her films list, she has done enormous movies which includes from her debut to the industry till her recent films.\n\nWood’s first major screen role was in the low-budget 1997 film Digging to China, which also starred Kevin Bacon, Cathy Moriarty, and Mary Stuart Masterson.\n\nThe film won the Children’s Jury Award at the Chicago International Children’s Film Festival.\n\nThat same year she also had a role in Practical Magic, a fantasy film directed by Griffin Dunne starring Sandra Bullock and Nicole Kidman.\n\nShe was a Teenage debut Actress in 2001’s, she acted in leading film Little Secrets, where she played aspiring 14-year-old concert violinist Emily Lindstrom.\n\nFor that role, she was nominated for Best Leading Young Actress at the Young Artist Awards.\n\nIn 1998 she casted in Detour as Daniella Rogers. Later her breakthrough movie role followed the film called Thirteen in 2003, she played the role of Tracy Louise Freeland, one of two young teens who sink into a downward spiral of hard drugs, sex, and petty crime.\n\nShe was nominated as Best Actress – Drama and for a Screen Actors Guild (SAG) Award for Best Actress for Golden Globe Awards.\n\nIn 2002 Rachel was in the role of Lainey Christian in the film Simone.\n\nA supporting role opposite Cate Blanchett and Tommy Lee Jones in Ron Howard’s The Missing, in which she played the kidnapped daughter, Lilly Gilkeson.\n\nIn 2005, Wood appeared opposite Kevin Costner and Joan Allen in the Mike Binder-directed The Upside of Anger, a well-reviewed film in which Wood played Lavender “Popeye” Wolfmeyer, one of four sisters dealing with their father’s absence.\n\nPretty Persuasion is a 2005 American black comedy film directed by Marcos Siega, where Rachel was casted as Kimberly Joyce.\n\nIn Down in the Valley, which was directed by David Jacobson, Wood’s character, Tobe, falls in love with an older man, a cowboy who is at odds with modern society (Edward Norton).\n\nAsterix and the Vikings, an animated adventure film based on a French comic book series Asterix, Rachel gave her vocal for the role Abba in English Version.\n\nAlso she gave her vocal for Cordelia in the film Shark Bait in 2006. Later in 2006, Wood appeared with an all-star ensemble cast as Natalie Finch in the Golden Globe nominated 2006 comedy-drama film Running with Scissors. Directed by Ryan Murphy and starring Annette Bening.\n\nIn 2007, Wood take part in the film King of California, which premiered at the Sundance Film Festival. Wood starred in 2008’s Vadim Perelman-directed The Life Before Her Eyes, based on the Laura Kasischke novel of the same name.\n\nIn 2007 film called Battle for Terra, Wood gave her voice to the character Mala.\n\nIn 2007, Rachel as Lucy Carrigan in the film Across the Universe.\n\nThe Wrestler where Rachel was as Stephanie Ramzinski in 2008.\n\nIn 2009 Whatever Works as Melodie St. Ann Celestine.\n\nIn 2010 in the film The Conspirator as Anna Surratt\n\nIn 2011 in the Film The Ides of March, she was casted asMolly Stearns.\n\nDuring 2013 in the film Charlie Countryman she pursued as Gabi Ibanescu.\n\nIn 2013 in the film A Case of You she took the character of Birdie Hazel.\n\nIn 2014 the film Barefoot she was the Daisy Kensington.\n\nDuring 2015 the movie Strange Magic, she gave her voice to Marianne.\n\nIn 2015 the film Into the Forest she was starred as Eva.\n\nIn 2017 in the film Allure she was Laura Drake.\n\nDuring 2018 in Flavors of Youth she gave the vocal to Yi Lin.\n\nIn 2019 in the film Frozen II she has given her voice to Queen Iduna.\n\nHer recent film in 2020 includes Kajillionaire as Old Dolio Dyne And also in 2020 Rachel was casted in the film Showbiz Kids which was a Documentary film.\n\nAgain in 2020 in the film Viena and the Fantomes she was a Susi.\n\nHer upcoming American biographical comedy film Weird: The Al Yankovic Story, directed by Eric Appel, the role and the release date should be announce yet.\n\nPhysical Appearance\n\nHeight – 5 feet 6 inches (1.67 m)\n\nWeight – 54 kg (119 lbs)\n\nBody Measurements – NA\n\nSkin tone – Light\n\nHair color – Blonde\n\nEye color – Blue\n\nNet Worth & Salary\n\nWood and her brothers were actively involved in Theatre in the Park while growing up, including an appearance by her in the 1987 production of her father’s musical comedy adaptation of A Christmas Carol when she was just a few months old.\n\nShe is a famous actress and a musician as well who has the Net Worth of $8 million and she is taking $250 thousand as Salary per episode.\n\nAwards/Accolades\n\nShe won the award for the film Westworld in 2017 in Satellite Award for Best Actress in a Series, Drama/Genre.\n\nIn 2016 she won Critics’ Choice Television Award for Best Actress in a Drama Series award for Westworld series.\n\nIn 2002 she won Young Hollywood Award for One To Watch. For the film Thirteen she won Las Vegas Film Critics Society Award for Youth in Film award in 2003.\n\nShe has also won Young Hollywood Superstar Award in 2009.\n\nAgain for the film Thirteen she was awarded for Phoenix Film Critics Society Award for Breakout Performance – On Screen in 2004 and also she got the award of Prism Award for Performance in a Feature Film for the film Thirteen again.\n\nFacts\n\nEvan Rachel Wood is opening up about her previous relationship with Marilyn Manson, his alleged abuse and her work to help survivors of domestic abuse.\n\nThis Westworld star has a black belt in Taekwondo.\n\nDavid Bowie is her biggest inspiration and in his honor, she got a lightning bolt tattoo"}, {"url": "https://wikiwiki.in/actress/evan-rachel-wood/", "page_content": "Evan Rachel Wood (Actress) Height, Weight, Date of Birth, Age, Wiki, Biography, Boyfriend and More\n\nEvan Rachel Wood is an American actress, musician, and model. She has appeared in many American TV serials American Gothic, Once and Again, and many more. She has also been awarded the Critics’ Choice Television Award and Primetime Emmy Award. She has also given her voice in Disney animated fantasy film Frozen II.\n\nBirth & Family\n\nEvan Rachel Wood was born on born 7 September 1987 in Raleigh, North Carolina. Her father’s name is Ira David Wood III who is also an actor and singer. Her mother Sara Lynn Moore is an actress and a director. She also has three brothers named Ira David Wood IV, Dana and Thomas, and a sister named Aden. Her paternal aunt, Carol Winstead Wood, was also a Hollywood production designer.\n\nBio\n\nReal Name Evan Rachel Wood Profession Actress, Musician, and Model Date of Birth September 7, 1987 Age (as in 2022) 35 Years Birth Place Raleigh, North Carolina, United States Nationality American Home Town Raleigh, North Carolina, United States Family Mother : Sara Lynn Moore\n\nFather : Ira David Wood III\n\nSister : Aden Elins\n\nBrother : Dana Wood, Ira David Wood IV, Thomas Wood\n\nHusband : Jamie Bell ​(m. 2012-div. 2014)\n\nSon : Jack Matfin Bell Religion Jewish Address North Carolina, United States\n\nEducation\n\nEvan studied at ‘Cary Elementary,’ a public school in Cary, North Carolina. She later continued her studies through homeschooling. She earning her high school diploma at the age of 15.\n\nEducation Details and More\n\nSchool Cary Elementary, Cary, North Carolina College Not Known Educational Qualification Graduate Debut Film : Digging to China (1997)\n\n\n\nTelevision : American Gothic (1995)\n\nAwards Not Available\n\nCareer\n\nEvan began her acting career in 1994 with a television film In the Best of Families: Marriage, Pride & Madness and then appeared in American Gothic, Get to the Heart: The Barbara Mandrell Story, Profiler, Down Will Come, Baby and many more. Her film career started in 1997 by playing Harriet Frankovitz in Digging to China which also starred Kevin Bacon and Cathy Moriarty. The film won the Children’s Jury Award at the Chicago International Children’s Film Festival.\n\nShe rose to fame through her performance as Tracy Louise Freeland in Catherine Hardwicke directed teen drama film Thirteen in the year. She was nominated in Best Actress in a Drama at Golden Globe Awards. She then worked in Little Secrets, Simone, Thirteen, The Missing.\n\nPhysical Stats and More\n\nHeight In Feet : 5′ 6″ ft\n\nIn Meter : 1.7 m Weight In Pound : 130 lb\n\nIn Kilogram : 59 Kg Figure Measurement 35-27-34 Eye Colour Blue Hair Colour Red blond Hobbies Reading and Shopping\n\nPersonal Life\n\nEvan was dating Marilyn Manson and got engaged in 2010, but broke up later that year. She got married to Jamie Bell in 2012 but got divorced in 2014. She also has a child named Jack Matfin Bell. She also had a relationship with Zach Villa from 2015 to 2017.\n\nMarital Status and More\n\nMarital Status Divorced Boyfriends Jamie Bell Controversies Wood alleged that Manson whose legal name is Brian Hugh Warner, “essentially raped” her on-camera without her consent. She revealed that via a statement posted on her Instagram account. Net Worth USD 1-10 million\n\nSocial Media Presence\n\nSome Facts About Evan Rachel Wood\n\nEvan Rachel Wood was born and brought up in North Carolina.\n\nHer mother converted to Judaism and raised her in the Jewish faith.\n\nHer first music video came in 2005 named “Wake Me Up When September Ends”.\n\nShe was awarded a black belt in taekwondo when she was 12 years old.\n\nShe stars as sentient android Dolores Abernathy in the HBO series Westworld from 2016-21, for which she has won a Critics’ Choice Award and earned Golden Globe and Emmy Award nominations.\n\nIn 2018, Wood made serious allegation on Marilyn Manson. She wrote,\n\n“He started grooming me when I was a teenager and horrifically abused me for years. I was brainwashed and manipulated into submission. I am done living in fear of retaliation, slander, or blackmail. I am here to expose this dangerous man and call out the many industries that have enabled him, before he ruins any more lives. I stand with the many victims who will no longer be silent.”\n\nIf you have more details about Evan Rachel Wood. Please comment below we will updated within a hour."}, {"url": "https://biogossip.com/evan-rachel-wood/", "page_content": "Evan Rachel Wood is an American actress who got into the media limelight when she played the role in Digging to China which made her win a Golden Globe nomination. She is also known for her appearance in the tv series American Gothic and Once and Again.\n\nHer role as Tracy Freeland in the teen drama, Thirteen made her grab the attention of audiences. She has appeared in movies like Pretty Persuasion, Down in the Valley, Running with Scissors, and Across the Universe.\n\nEarly Life of Evan Rachel Wood\n\nEvan Rachel Wood was born on September 7, 1987, in Raleigh, North Carolina, United States. Rachel is 35 years old and she celebrates her birthday on the 7th of September. Her star sign is Virgo. She was born as the daughter of Sara Lynn Moore (mother) and Ira David Wood III (father). Her parents are actors and actresses.\n\nHer siblings are Ira David Wood IV, Dana Wood, Aden Elins, and Thomas Wood. David and Dana are also actors and actresses. Evan’s paternal grandparents are Ira David Wood and Jr. Bettie Lee Winstead while Richard Alan Moore and Patricia Ruth Burke are her maternal grandparents. Her aunt, Carol Winstead Wood is a production designer.\n\nWood holds American citizenship and belongs to a mixed (Irish, English, German, and Scottish). Wood follows the Christianity religion. She studied at Cary Elementary School in Cary, North Carolina. Later, she went to Laurel Springs School. Wood gained her diploma by studying at homeschool at 15.\n\nEvan Rachel Wood’s Failed Marriage and Engagement\n\nEvan is bisexual and single. She was previously married to an actor, Jamie Bell. Evan and Bell first met at the Sundance Festival in 2005. They dated each other for a year and separated in 2006. Evan and Bell got back together in 2011 and after a year they walked down the aisle in October 2012. Evan and Jamie legally divorced in May 2014.\n\nShe dated an American musician, Marilyn Manson in January 2007. Manson even made Rachel appear in his music video, Heart-Shaped Glasses. They met at Los Angeles’ famed Chateau Marmont in 2006. Manson proposed to her onstage in Paris after dating on and off for three years and got engaged in January 2010. Only after eight months of their engagement did they break up in August 2010.\n\nPast Relationships of Evan Rachel Wood\n\nIn January 2017, she again engaged her bandmate, Zach Villa. They separated in September 2017. She was also in a relationship with an American actress, Katherine Moening. In early 2005, they appeared together as a couple and dated each other until February 2013. Evan was rumored with actor, Alexander Skarsgård in 2009.\n\nShe was in a relationship with Shane West for a few months in 2009. She was linked with Joseph Gordon-Levitt and Edward Norton in 2008 and 2004.\n\nEvan Rachel Wood Blessed With a Son; Custody Battle With Jamie\n\nEvan is a mother of a son Jack Matfin Bell. She gave birth to Jack with Jamie in July 2013. She gave custody of her son to Jamie because her ex-partner, Marilyn threaten her sexually and trafficked her child. Her son, Jack is living with his father Jamie and Jamie has full custody of his son. She will spend time with her son in his holidays like spring break.\n\nEvan Rachel Wood’s Net Worth\n\nRachel has a net worth of $8 million as of 2023 which she earned as an actress. Her salary is $250k per episode for Westworld which increased up to $2.5 million per season in the 10th season.\n\nEvan Rachel Wood’s Height & Tattoos\n\nRachel has a tall height of 5 feet 6 inches. She has a body weight of 55kg and her body measurement is 34-26-34 inches. Rachel has blue colored eyes and blonde colored hair and her dress size is 4 (US).\n\nShe pierced the letter J on her ankle and Diamond Swoosh on her Ankle. She carved the number 15 behind her ear and has All that we see or seem is but a dream within a dream in her back. Rachel has a tattoo of High on Thigh.\n\nEvan Rachel Wood’s Allegations Against Marilyn Manson\n\nShe reported being raped by Marilyn Manson in February 2021. Besides Evan, 16 other women have also made rape allegations against him and LACSD has conducted an investigation of Manson for 19 months in September 2022.\n\nMarilyn has also filed a case against Evan for defamation, intentional infliction of emotional distress, and violations of the California Comprehensive Computer Data Access and Fraud Act, in March 2022. Due to sexual abuse, Evan was also diagnosed with PTSD.\n\nActing Career of Evan Rachel Wood\n\nEvan made her acting debut via a small appearance as Jessie Sammler in Once and Again.\n\nRachel played the role of a young girl in Harriet Frankovitz along with Kevin Bacon and Mary Stuart Masterson.\n\nand She played the role of Sandra Bullock ‘s daughter in Practical Magic .\n\n‘s daughter in Practical Magic She appeared as Emily Lindstrom in Little Secrets in 2001.\n\nRachel got the opportunity to share the big screen with Cate Blanchett and Tommy Lee Jones in The Missing.\n\nand in The Missing. Wood played in The Wrestler as Randy Robinson ‘s daughter in 2008.\n\n‘s daughter in 2008. She appeared as Melodie in Whatever Works in 2009.\n\nMovies & TV Shows\n\nShe played in movies like Digging to China, Practical Magic, Detour, Little Secrets, Simone, The Upside of Anger, Pretty Persuasion, Down in the Valley, Asterix, etc. Her popular tv shows are In the Best of Families: Marriage, Pride & Madness, True Blood, Search for Grace, A Father for Charlie, Death in Small Doses, American Gothic, Get to the Heart: The Barbara Mandrell Story, and so on.\n\nMusic & Albums\n\nApart from her acting career, Evan is also a singer. She sang songs like All Is Found, Shows Yourself, Blackbird, Hold Me Tight, C’mon Marianne/Stronger (What Doesn’t Kill You), Dear Prudence, and so on. Some of her popular albums are Strange Magic, Across the Universe, Kalypso, and School’s Out! Christmas.\n\nAwards & Nomination\n\nShe won the Children’s Jury Award at Chicago International Children’s Film Festival for her role in Digging to China.\n\nShe was nominated as Best Leading Young Actress at the Young Artist Awards for Little Secrets.\n\nIn 2002, she won Young Hollywood Awards for One to Watch.\n\nShe won Whistler Film Festival awards for Best Performance in Allure in 2017.\n\nFAQs of Evan Rachel Wood\n\nWhy is Evan Rachel Wood named Evan?\n\nHer mother always wanted to have a daughter named Evan so she’s named Evan. In order to put her name in a different order, she got the name, Evan.\n\nDoes Evan Rachel Wood have a black belt in Taekwondo?\n\nYes, Rachel has a black belt in Taekwondo. She has shown her skills in Taekwondo for the sci-fi series, Westworld.\n\nHas Evan Rachel Wood attempted Suicide?\n\nYes, Evan has attempted suicide two times. She was only 22 years old when she started self-harm which led her to a psychiatric hospital. Evan reached for her mother’s help in going to the hospital.\n\nIs Evan Rachel Wood bisexual?\n\nYes, Evan is bisexual and came out in 2012. Wood announced her sexuality publicly that she had an attraction for the same sex when she was only 12 years old at n LGBT gala event.\n\nIs Evan Rachel Wood related to Elijah Wood?\n\nNo, Evan and Elijah aren’t related to each other. Both of them only share the same surname and the same career."}, {"url": "https://www.thewikifeed.com/evan-rachel-wood/", "page_content": "Evan Rachel Wood Net Worth\n\n$8 Million\n\nEvan Rachel Wood, is an American actress and activist. As of 2023, Evan Rachel Wood ‘s net worth is $8 million. She is known for her portrayal of Kylie Owens in the romance fantasy film “Practical Magic” (1998) and Kimberly Joyce in a drama indie film “Pretty Persuasion” (2005). She is the recipient of numerous accolades, including the Young Hollywood Superstar Award (2009) and Prism Award for Performance in a Feature Film (2004).\n\nEvan Rachel Wood Wiki/Biography\n\nBorn on 7 September 1987, Evan Rachel Wood’s age is 35 Years Old as of 2023. She was born in a well-settled family from Raleigh, North Carolina, United States. Her zodiac sign is Virgo and follows the Christian religion.\n\nEvan Rachel Wood Childhood Pic\n\nShe completed her early schooling at Cary Elementary School, North Carolina. After that, she went to local university in United States from where she completed her graduation.\n\nName Evan Rachel Wood Net Worth $8 Million Date of Birth 7 September 1987 Age 35 Years Old Birth Place Raleigh, North Carolina, United States Currently Live In Raleigh Profession Actress and Activist Debut TV Series: In the Best of Families: Marriage, Pride & Madness (1994)\n\nMusic Video: Wake Me Up When September Ends (2005)\n\nFilm: Digging to China (1997) Years Active 1994 – Present Famous Role Rose Russell in TV Series American Gothic (1995) Nationality American Religion Christian Ethnicity English, Irish, Scottish and German Descent Hometown Raleigh, North Carolina Zodiac Sign Virgo School/High School Cary Elementary School, North Carolina College/University Local University in United States Education Qualification Graduate\n\nFamily, Husband & Relationship\n\nEvan Rachel Wood’s Parents are Ira David Wood III and Sara Lynn Moore. Her father’s name is Ira David Wood III who is actor, singer, author, director and playwright by profession.\n\nEvan Rachel Wood with her Father\n\nHer mother’s name is Sara Lynn Moore who is actress, film producer, director and acting coach by profession.\n\nEvan Rachel Wood with her Mother\n\nShe has three brother, her brother’s name is Ira David Wood IV who is actor by profession, second Dana Wood who is also actor by profession and third one is Thomas Wood. She also one sister, her sister’s name is Aden Elins.\n\nEvan Rachel Wood’s marital status is married. Her husband’s name is Jamie Bell. The couple have one child, her son’s name is Jack Matfin Bell. They was married in 2012 but unfortunately they were separated and got divorced in 2014.\n\nFather Name Ira David Wood III Mother Name Sara Lynn Moore Brother Name Ira David Wood IV\n\nDana Wood\n\nThomas Wood Sister Name Aden Elins Boyfriend Jamie Bell Marital Status Divorced Husband Jamie Bell Children Jack Matfin Bell (Son)\n\nAlso Read:"}, {"url": "https://www.uselessdaily.com/movies/evan-rachel-wood-50-interesting-facts-about-the-actress/", "page_content": "Evan Rachel Wood is an American actress. She is know playing a leading role in the Westworld series. Let’s see some amazing facts and trivia about her!\n\n1.Evan Rachel Wood was born on September 7, 1987.\n\n2. She was born in Raleigh, North Carolina. Her father, Ira David Wood III, is a locally prominent actor, singer, theater director, and playwright; he is the Executive Director of a local regional theatre company called Theatre in the Park.\n\n3. Her mother, Sara Lynn Moore (born March 6, 1958), is an actress, director, and acting coach.\n\n4. Wood’s mother is a convert to Judaism, while Wood’s father is Christian.\n\n5. Evan Rachel Wood’s brother, Ira David Wood IV, is also an actor; she has two other brothers, Dana and Thomas, and a sister named Aden.\n\n6. Her paternal aunt, Carol Winstead Wood, was a Hollywood production designer.\n\n7. Evan Rachel Wood and her brothers were actively involved in Theatre in the Park while growing up, including an appearance by her in the 1987 production of her father’s musical comedy adaptation of A Christmas Carol when she was just a few months old.\n\n10. Subsequently, she played the Ghost of Christmas Past in several productions at the theater, and she later starred as Helen Keller alongside her mother (who played Anne Sullivan) in a production of The Miracle Worker, under her father’s direction.\n\n11. Evan Rachel Wood briefly attended Cary Elementary, a public school in Cary, North Carolina. She was subsequently home-schooled and received her high school diploma at age 15.\n\n12. She began her career appearing in several made-for-television films from 1994 onward, also playing an occasional role in the television series American Gothic.\n\n13. In 1996, Wood’s parents separated and later divorced, and Wood moved with her mother to her mother’s native Los Angeles County, California.\n\n14. After a one-season role on the television drama Profiler, Wood was cast in the supporting role of Jessie Sammler on the television show Once and Again.\n\n15. Wood’s first major screen role was in the low-budget 1998 film Digging to China, which also starred Kevin Bacon and Mary Stuart Masterson.\n\n16. The film won the Children’s Jury Award at the Chicago International Children’s Film Festival.\n\n17.Wood made her teenage debut as a leading film actress in 2002’s Little Secrets, directed by Blair Treu, where she played aspiring 14-year-old concert violinist Emily Lindstrom.\n\n18. For that role, she was nominated for Best Leading Young Actress at the Young Artist Awards.\n\n19. That same year, Wood played a supporting role in the Andrew Niccol-directed science fiction satirical drama film, S1m0ne, which starred Al Pacino.\n\n20. Wood’s breakthrough movie role followed with the 2003 film Thirteen.\n\n21. Her performance was nominated for a Golden Globe Award as Best Actress – Drama and for a Screen Actors Guild (SAG) Award for Best Actress. During the time of Thirteen’s release, Vanity Fair named Wood as one of the It Girls of Hollywood, and she appeared, along with the other actresses, on the magazine’s July 2003 cover.\n\n22. In 2005, Wood appeared in the Mike Binder-directed The Upside of Anger, opposite Kevin Costner and Joan Allen, a well-reviewed film in which Wood played Lavender “Popeye” Wolfmeyer, one of four sisters dealing with their father’s absence. Her character also narrated the film.\n\n23. Wood’s next two starring roles were in dark independent films. In the 2005 Grand Jury Prize Sundance Film Festival nominee Pretty Persuasion, a black comedy/satirical focusing on themes of sexual harassment and discrimination in schools and attitudes about females in media and society, Wood played Kimberly Joyce, a manipulative, sexually active high-schooler.\n\n24. In Down in the Valley, which was directed by David Jacobson, Wood’s character, Tobe, falls in love with an older man, a cowboy who is at odds with modern society (Edward Norton).\n\n25. Evan Rachel Wood has commented on her choice of sexually themed roles, saying that she is not aiming for the “shock factor” in her film choices.\n\n26. In 2005, Wood starred in the music videos for Bright Eyes’ “At the Bottom of Everything” and Green Day’s “Wake Me Up When September Ends”.\n\n27. In September 2006, Wood received Premiere magazine’s “Spotlight Award for Emerging Talent.”\n\n28. Also in 2006, she was described by The Guardian as being “wise beyond her years” and as “one of the best actresses of her generation.”\n\n29. Evan Rachel Wood was awarded the 2007 Cannes Film Festival Chopard Trophy for Female Revelation for her performance.\n\n30. Across the Universe, a Julie Taymor-directed musical that was nominated for a Golden Globe and an Academy Award and was set in Liverpool, New York City, and Vietnam, focused on the tribulations of several characters during the counter-cultural revolution of the 1960s. It was set to the songs of The Beatles. Wood, who has described the music of The Beatles as a major part of her life, played Lucy, who develops a relationship with Jude (Jim Sturgess).\n\n31. Wood starred in 2008’s Vadim Perelman-directed The Life Before Her Eyes, based on the Laura Kasischke novel of the same name, about the friendship of two teens of opposite character who are involved in a Columbine-like shooting incident at their school and are forced to make an impossible choice. Wood played the younger version of Uma Thurman’s character, Diana. One critic cited her performance as “hands-down extraordinary”.\n\n32. In the same year, she also co-starred in director Darren Aronofsky’s The Wrestler, winner of the Golden Lion Award for Best Film at the Venice Film Festival, about Randy “Ram” Robinson (Mickey Rourke), a professional wrestler from the 1980s who is forced to retire after a heart attack threatens to kill him the next time he wrestles. Wood played Stephanie, Randy “Ram” Robinson’s estranged daughter.\n\n33. In May 2009, she played Juliet in six fundraising performances of William Shakespeare’s Romeo and Juliet at the Theater In The Park.\n\n34. She portrayed the title character’s daughter in the 2011 HBO miniseries Mildred Pierce, for which she was nominated for the Primetime Emmy Award for Outstanding Supporting Actor in a Miniseries or a Movie.\n\n35. She is featured with Chris Evans in a 2016 ad for Gucci Guilty Eau fragrances.\n\n36. In June 2016, the Human Rights Campaign released a video in tribute to the victims of the 2016 Orlando gay nightclub shooting; in the video, Wood and others told the stories of the people killed there.\n\n37. Rachel Evan Wood began dating British actor Jamie Bell in 2005 after they co-starred in the music video for Green Day’s song “Wake Me Up When September Ends.”\n\n38. They got matching tattoos of each other’s initials; in Wood’s case, a “J” on her left ankle.[42] After a year together, the relationship ended in 2006.\n\n39. In January 2007, Wood’s relationship with Marilyn Manson became public.\n\n40. The couple split in November 2008. They later re-united and it was reported in early January 2010 that the couple was engaged to be married.\n\n41. Wood and Manson ended their engagement in August 2010.\n\n42. In the summer of 2011, Wood was reported to have rekindled her relationship with Jamie Bell, five years after they first broke up.\n\n43. The couple married in a small ceremony on October 30, 2012.\n\n44. They have one son, born in July 2013.\n\n45. Rachel Evan Wood had a home birth with her son, and publicly thanked Ricki Lake, creator of the documentary The Business of Being Born, for inspiring her decision.\n\n46. In May 2014, Wood and Bell announced that they had separated after 19 months of marriage.\n\n47. In August 2012, Wood came out as bisexual via Twitter.\n\n48. Wood’s mother is a convert to Judaism and Wood’s father is Christian.\n\n49. In 2003, Wood described herself as Jewish.\n\n50. Rachel Evan Wood has a black belt in taekwondo."}], "Evan Rachel Wood's profession is model.": [{"url": "https://models.com/people/evan-rachel-wood", "page_content": "Please Enable Cookies\n\nmodels.com is using a security service for protection against online attacks. The service requires full cookie support in order to view this website.\n\nPlease enable cookies on your browser and try again."}, {"url": "https://www.the-sun.com/entertainment/4527723/who-actress-evan-rachel-wood/", "page_content": "EVAN Rachel Wood made headlines in January 2022 after she made allegations against Marilyn Manson in a new documentary.\n\nThe two had previously dated in the early 2000s before parting ways.\n\n2 Evan Rachel Wood is an actress Credit: Getty Images\n\nWho is actress Evan Rachel Wood?\n\nBorn September 7, 1987, Wood, 34, is known as an American actress, model, and musician.\n\nShe is the winner of a Critics' Choice Television Award and has also been nominated three times for a Primetime Emmy Award as well as three Golden Globe Awards.\n\nWood is famously known for portraying the role of Dolores Abernathy on HBO's Westworld and has also been seen in Thirteen, Whatever Works and Across the Universe.\n\nOver the years, she has also appeared in a number of music videos including Green Day's Wake Me Up When September Ends and Marilyn Manson's Heart-Shaped Glasses (When the Heart Guides the Hand).\n\nAs of January 2022, she has an estimated net worth of $8million, and earns $250,000 per episode of Westworld, according to Celebrity Net Worth.\n\nWhat did Evan Rachel Wood say accuse Marilyn Manson of?\n\nIn January 2022, Wood accused Manson, 53, again of raping her on his music video set in 2007.\n\nShe was reportedly \"coerced into a commercial sex act under false pretenses,\" and had only agreed to a “simulated sex scene,\" according to a new documentary about her life and career, which premiered at the 2022 Sundance Film Festival.\n\nIn the film, Wood claimed that Manson “started penetrating me for real” once the cameras were rolling,\" The Guardian reports.\n\n“I had never agreed to that,” she said. “I was coerced into a commercial sex act under false pretenses. That’s when the first crime was committed against me and I was essentially raped on camera.”\n\nShe has also accused the star of grooming her.\n\n\"The name of my abuser is Brian Warner, also known to the world as Marilyn Manson,\" she wrote in a February 2021 Instagram post.\n\n\"He started grooming me when I was a teenager and horrifically abused me for years. I was brainwashed and manipulated into submission. I am done living in fear of retaliation, slander, or blackmail.\n\n\"I am here to expose this dangerous man and call out the many industries that have enabled him, before he ruins any more lives,\" she continued.\n\nManson and Wood met back in 2006 when she was 18 and he was 38. They later went on to start a relationship that lasted from 2007 to 2010.\n\nWhile Manson has not addressed Wood's documentary, he has denied previous allegations, calling them “horrible distortions of reality,\" stating that \"my intimate relationships have always been entirely consensual.\"\n\n\"Obviously, my life and my art have long been magnets for controversy, but these recent claims about me are horrible distortions of reality,\" Manson said in February 2021.\n\n\"My intimate relationships have always been entirely consensual with like-minded partners. Regardless of how — and why — others are now choosing to misrepresent the past, that is the truth.\"\n\nWood is also not the first woman to accuse Manson of sexual assault, he is the subject of four lawsuits accusing him of sexual assault, battery, and harassment.\n\nHis home was also raided by the Los Angeles County sheriff’s department in November 2021 after the Special Victims Unit obtained search warrants.\n\nOther women that have made accusations against Manson include Ashley Walters and Game of Thrones actress Esmé Bianco.\n\nWood's documentary, Phoenix Rising, is scheduled to debut on HBO in March 2022.\n\n2 The Westworld star has accused Marilyn of rape Credit: Getty\n\nIs Evan Rachel Wood married?\n\nTwo years after her relationship with Manson ended, Wood walked down the aisle with English actor and dancer Jamie Bell.\n\nBell, 35, is famously known for his debut role in Billy Elliot, for which he won the 2001 BAFTA Award for Best Actor in a Leading Role, making him one of the youngest winners of the award.\n\nThe couple eventually parted ways in 2014.\n\nPrior to their divorce, Bell and Wood welcomed a son, Jack, 8, in 2013."}, {"url": "https://wikiwiki.in/actress/evan-rachel-wood/", "page_content": "Evan Rachel Wood (Actress) Height, Weight, Date of Birth, Age, Wiki, Biography, Boyfriend and More\n\nEvan Rachel Wood is an American actress, musician, and model. She has appeared in many American TV serials American Gothic, Once and Again, and many more. She has also been awarded the Critics’ Choice Television Award and Primetime Emmy Award. She has also given her voice in Disney animated fantasy film Frozen II.\n\nBirth & Family\n\nEvan Rachel Wood was born on born 7 September 1987 in Raleigh, North Carolina. Her father’s name is Ira David Wood III who is also an actor and singer. Her mother Sara Lynn Moore is an actress and a director. She also has three brothers named Ira David Wood IV, Dana and Thomas, and a sister named Aden. Her paternal aunt, Carol Winstead Wood, was also a Hollywood production designer.\n\nBio\n\nReal Name Evan Rachel Wood Profession Actress, Musician, and Model Date of Birth September 7, 1987 Age (as in 2022) 35 Years Birth Place Raleigh, North Carolina, United States Nationality American Home Town Raleigh, North Carolina, United States Family Mother : Sara Lynn Moore\n\nFather : Ira David Wood III\n\nSister : Aden Elins\n\nBrother : Dana Wood, Ira David Wood IV, Thomas Wood\n\nHusband : Jamie Bell ​(m. 2012-div. 2014)\n\nSon : Jack Matfin Bell Religion Jewish Address North Carolina, United States\n\nEducation\n\nEvan studied at ‘Cary Elementary,’ a public school in Cary, North Carolina. She later continued her studies through homeschooling. She earning her high school diploma at the age of 15.\n\nEducation Details and More\n\nSchool Cary Elementary, Cary, North Carolina College Not Known Educational Qualification Graduate Debut Film : Digging to China (1997)\n\n\n\nTelevision : American Gothic (1995)\n\nAwards Not Available\n\nCareer\n\nEvan began her acting career in 1994 with a television film In the Best of Families: Marriage, Pride & Madness and then appeared in American Gothic, Get to the Heart: The Barbara Mandrell Story, Profiler, Down Will Come, Baby and many more. Her film career started in 1997 by playing Harriet Frankovitz in Digging to China which also starred Kevin Bacon and Cathy Moriarty. The film won the Children’s Jury Award at the Chicago International Children’s Film Festival.\n\nShe rose to fame through her performance as Tracy Louise Freeland in Catherine Hardwicke directed teen drama film Thirteen in the year. She was nominated in Best Actress in a Drama at Golden Globe Awards. She then worked in Little Secrets, Simone, Thirteen, The Missing.\n\nPhysical Stats and More\n\nHeight In Feet : 5′ 6″ ft\n\nIn Meter : 1.7 m Weight In Pound : 130 lb\n\nIn Kilogram : 59 Kg Figure Measurement 35-27-34 Eye Colour Blue Hair Colour Red blond Hobbies Reading and Shopping\n\nPersonal Life\n\nEvan was dating Marilyn Manson and got engaged in 2010, but broke up later that year. She got married to Jamie Bell in 2012 but got divorced in 2014. She also has a child named Jack Matfin Bell. She also had a relationship with Zach Villa from 2015 to 2017.\n\nMarital Status and More\n\nMarital Status Divorced Boyfriends Jamie Bell Controversies Wood alleged that Manson whose legal name is Brian Hugh Warner, “essentially raped” her on-camera without her consent. She revealed that via a statement posted on her Instagram account. Net Worth USD 1-10 million\n\nSocial Media Presence\n\nSome Facts About Evan Rachel Wood\n\nEvan Rachel Wood was born and brought up in North Carolina.\n\nHer mother converted to Judaism and raised her in the Jewish faith.\n\nHer first music video came in 2005 named “Wake Me Up When September Ends”.\n\nShe was awarded a black belt in taekwondo when she was 12 years old.\n\nShe stars as sentient android Dolores Abernathy in the HBO series Westworld from 2016-21, for which she has won a Critics’ Choice Award and earned Golden Globe and Emmy Award nominations.\n\nIn 2018, Wood made serious allegation on Marilyn Manson. She wrote,\n\n“He started grooming me when I was a teenager and horrifically abused me for years. I was brainwashed and manipulated into submission. I am done living in fear of retaliation, slander, or blackmail. I am here to expose this dangerous man and call out the many industries that have enabled him, before he ruins any more lives. I stand with the many victims who will no longer be silent.”\n\nIf you have more details about Evan Rachel Wood. Please comment below we will updated within a hour."}, {"url": "https://www.sportskeeda.com/pop-culture/evan-rachel-woods-net-worth", "page_content": "Source: Screengrab from the series Westworld\n\n\n\n\n\nThe net worth of Evan Rachel Wood is estimated to be $8 million as of May 2023.\n\n\n\n\n\nAmerican actress Evan Rachel Wood was born on September 7, 1987. She has been nominated for three Primetime Emmy Awards, three Golden Globe Awards, and a Critics' Choice Television Award for her work in film and television.\n\n\n\n\n\nEvan Rachel Wood has made appearances in a lot of films and TV shows. She first gained recognition for her roles in the television series \"American Gothic\" and the film \"Pretty Persuasion\" before moving on to success in the films \"Thirteen,\" and \"Across the Universe.\" Along with \"The Ides of March\" and \"The Wrestler,\" Wood has also appeared in the television shows \"True Blood,\" \"Mildred Pierce,\" and \"Westworld.\"\n\n\n\n\n\nPersonal Information\n\n\n\n\n\nReal Name Evan Rachel Wood Alias - Net worth Estimated $8 million DOB(Age) September 7, 1987 (35 years old) Height 5 feet 6 inches Weight 54kg Nationality American Marital Status Divorced Partner/Spouse Marilyn Manson (Engaged 2009; sep. 2010)Jamie Bell (m. 2012; div. 2014) Zodiac Sign Virgo Profession Singer, Actor, Voice-actor, Model\n\n\n\n\n\nNet Worth (2023)\n\n\n\n\n\nEvan Rachel Woods’ estimated net worth is $8 million as of May 2023. Woods is a highly talented actor and singer who has achieved great success in her career. Her remarkable skills have contributed to her substantial net worth, showcasing her accomplishments.\n\n\n\n\n\nShe gained widespread recognition for her notable role in the popular HBO series “Westworld.” Additionally, there have been speculations about her earning a considerable income from endorsement deals, although the exact figures remain undisclosed.\n\n\n\n\n\nStarting in 2018, Wood's earnings reached an impressive milestone as she began receiving $250,000 for each episode of “Westworld.” As a result, she earned $2.5 million for a 10-episode season.\n\n\n\n\n\nSource: Screengrab from the series Westworld\n\n\n\n\n\nSources of Income\n\n\n\n\n\nEvan Rachel Wood’s primary income is derived from her successful acting career, where she has achieved notable accomplishments.\n\n\n\n\n\nAdditionally, she has displayed her talent as a writer and voice-over actor. Wood’s role in the HBO series “Westworld” earned her an impressive $250,000 per episode. However, she is also involved in the music industry, showcasing her versatility. Furthermore, she has delivered outstanding performances in various blockbuster films such as “Frozen II,” “Flavors of Youth,” and “Strange Magic,” among others, solidifying her reputation as a versatile and accomplished artist.\n\n\n\n\n\nHowever, her exact income from all of her endeavors is unknown or cannot be verified, but given her net worth and salary, it could be assumed that it would be in the hundreds of thousands of dollars.\n\n\n\n\n\nActing and Voice-acting Career\n\n\"Digging to China,\" which came out in 1997, marked Wood's acting debut. In 2003, she played Tracy Freeland in the movie \"Thirteen,\" which served as her breakthrough performance.\n\n\n\n\n\nShe made an appearance in the film \"The Missing\" that same year. Her other acting credits include roles in \"True Blood,\" \"Once and Again,\" and \"Running with Scissors.\" In 2016, Wood joined the cast of \"Westworld.\"\n\n\n\n\n\nSource: Screengrab from the series Westworld\n\n\n\n\n\n\"Frozen II,\" which has earned more than $1 billion at international box offices, is Wood's highest-grossing movie. Her other top-grossing films include \"The Ides of March,\" which brought in more than $77 million worldwide; \"Practical Magic,\" which brought in more than $68 million worldwide; and \"The Wrestler,\" which brought in more than $46 million worldwide.\n\n\n\n\n\nSinging Career\n\nOn the fourth CD of the \"Chimes of Freedom\" charity album for Amnesty International, Wood performed the song \"I'd Have You Anytime.\" She performed as a member of the electro-pop duo Rebel and a Basketcase from 2016 to 2017 with Zach Villa.\n\n\n\n\n\nWood then joined forces with Zane Carney to form the cover band Evan + Zane in 2018. The following year, Wood made an appearance on the Billboard Hot 100 with \"Show Yourself,\" a duet with Idina Menzel from the \"Frozen II\" soundtrack.\n\n\n\n\n\nWriter and Director\n\nWood's career in entertainment goes beyond acting. Her resume also includes writing and directing credits. The short film “Queen” served as Wood's directing debut. For this project, she is also credited with writing. However, it is unknown how much money she made from writing and directing.\n\n\n\n\n\nSource: Screengrab from the series Westworld\n\n\n\n\n\nExpenditure\n\n\n\n\n\nPhilanthropy\n\nEvan Rachel Woods supports a variety of charities and foundations, although specific donation amounts are not available. Her philanthropic endeavors include backing organizations such as:\n\n\n\n\n\nAmnesty International\n\nAndrea Bocelli Foundation\n\nElton John AIDS Foundation\n\nHole in the Wall Gang\n\nHuman Rights Campaign\n\nLos Angeles LGBT Center\n\nMotion Picture and Television Fund Foundation\n\nThe Art of Elysium\n\n\n\n\n\nCar Collection\n\nEvan Rachel Wood's car collection includes a range of vehicles such as the Jeep Cherokee, which is priced between $27,690 and $31,570; the Ford Escape at $23,850; the Audi Q7 valued at $53,788; and the Chevrolet Traverse with an estimated cost of $40,000.\n\n\n\n\n\nSource: Screengrab from the series Westworld\n\n\n\n\n\nReal Estate Assets\n\n\n\n\n\nIn regards to Evan Rachel Wood's real estate holdings, there is, regrettably, no verified information available. She does, however, presently reside in North Carolina, which is her county residence."}, {"url": "https://celebs99.com/evan-rachel-wood/", "page_content": "Evan Rachel Wood is an 34 years old American Actress, Model, Musician who started her career when she was just 10 years old during the year 1997.\n\nEvan Rachel grew up along with her parents and four siblings Ira David Wood IV, Dana Wood, Aden Elins, Thomas Wood in her hometown North Carolina, USA.\n\nBorn on 1987 in North Carolina, USA actress Evan Rachel is a very popular celebrity in the United States and all around the world due to her amazing acting performances in multiple Hollywood movies.\n\nIn this article you will find out everything about American actress Evan Rachel Wood – Age, Height, Biography, Net Worth, Husband, Early & professional life, Movies.\n\nEvan Rachel Wood Bio\n\nFull Name Evan Rachel Wood Birth Name NA Nickname Evan Profession Actress + Model + Musician Nationality American Date of Birth 7 September 1987 Age 34 years old as of 2022 Birth Place Raleigh, North Carolina, USA Gender Female Religion Jewish Hometown NA Hobbies NA School Cary Elementary School, Laurel Springs School University NA Qualification High school Graduate Zodiac Sign Virgo Languages English Net Worth $ 8 million Salary (per annum) NA Ethnicity NA Marital Married Spouse Jamie Bell (m. 2012, div. 2014) Boyfriend NA Children Jack Matfin Bell Parents Ira David Wood III,\n\nSara Lynn Moore Siblings Ira David Wood IV,\n\nDana Wood,\n\nAden Elins,\n\nThomas Wood\n\nEvan Rachel is an American Actress, Activist, Model and Singer. She was born on September 7 1987, in Raleigh, North Carolina. For the lead role in an interview, she screen tested at the age of five against Kirsten Dunst with the Vampire.\n\nHer father Ira David Wood III, is a Thratre Actor, Writer and Director and his mother Sara Wood is also an Actress and an Acting coach.\n\nEvan’s Siblings are Ira David Wood IV, Dana Wood, Aden Elins and Thomas Wood.\n\nShe is the receiver of Critics’ Choice Television Award as well as three Primetime Emmy Award nominations and three Golden Globe Award nominations for her work in film and television.\n\nEvan and her brothers sometimes performed at Theatre In The Park in Raleigh, which her father founded and where he serves as executive director.\n\nShe began her acting in 1990s starting in some Television series including, American Gothic and Once and Again.\n\nHer first debut in the film as a lead role is Digging to China at the age of nine.\n\nWood has been described by The Guardian newspaper as being “wise beyond her years” and as “one of the best actresses of her generation”.\n\nEducation\n\nEvan was born and bought up in Raleigh, North Carolina. After a long auditioning process of The Vampire Chronicles, she moved to Los Angeles with her and brother Ira.\n\nShe started her schooling her Cary Elementary School, later she received her high school diploma in Laurel Springs School in the age of 15.\n\nEarly life\n\nWood was born in Raleigh, North Carolina. She is basically from a family who has taken their career in acting fields where in her mother Sara Lynn Moore, is an actress, director, and acting coach, and her father Ira David Wood III, is a locally prominent actor, singer, theater director, and playwright.\n\nHe is also the executive director of a local community theatre company called Theatre in the Park. Her mother got converted to Judaism and raised her daughter in the Jewish faith.\n\nWood’s brother, Ira David Wood IV, is also an actor. She also have two other brothers, Dana and Thomas who are not belonging to this field.\n\nHer sister Aden who also into this field again. She has a paternal aunt who is a Hollywood Production Designer. Wood’s parents separated in 1996, and divorced in 2002.\n\nIn 1997 Wood moved with her mother to her mother’s native Los Angeles County, California.\n\nBefore that she started her schooling in Cary Elementary School in Cary, North Carolina.\n\nShe left the public schooling at the age of 12 joined for homeschooling because of bullying.\n\nShe completed her high school diploma at age15.\n\nPersonal life\n\nEvan Rachel Wood is reportedly single right now. She is not married, so there is no Evan Rachel Wood husband.\n\nHowever, she was married to ex Jamie Bell from 2012 to 2014.\n\nEvan rachel wood and Jamie bell\n\nThis list of Evan Rachel Wood exes includes Zach Villa and Marilyn Manson.\n\nShe has a child name Jack Matfin Bell born on 2013.\n\nProfessional life\n\nWood started her career in 1994 in Television films, she was casted as Little Susie in the film Best of Families: Marriage, Pride & Madness.\n\nIn the same year she starred as Young Sarah / Robin in the film Search for Grace.\n\nShe pursued herself as Tessa in A Father for Charlie and in Death in Small Doses as Anna.\n\nIn the 3 episodes of American Gothic as Rose Russell in 1995-1996.\n\nA television film called Get to the Heart: The Barbara Mandrell Story as Jaime Dudney in 1997.\n\nShe starred as Chloe waters in 6 episodes of Profiler 1998-99. Down Will Come Baby is a true-story American thriller drama based on a book by Gloria Murphy released on 1999 where Rachel acted as Robin Garr.\n\nShe had a main cast in Once and Again as Jessie Sammler in 1992-2002. In the episode Pandor’s Box she casted as Sarah Radcliff in Touched by an Angel.\n\nIn 2002, a film called The West Wing as Hogan Cregg in the episode “The Black Vera Wang”.\n\nThe episode Got Murder Evan was casted in the role of Nora Easton in Crime Scene Investigation in 2003.\n\nIn 2009-11 True Blood, an American fantasy horror drama, Rachel casted as Sophie-Anne Leclerq in 8 episodes.\n\nIn the 2 episodes of miniseries of the film Mildred Pierce Rachel starred as Veda Pierce in 2011.\n\nRobot Chicken Rachel was as Travis’ Girlfriend / Mother (voice) in the episode: “Botched Jewel Heist” in 2013.\n\nIn the 5 episodes of Doll & Em in 2015 Evan has the role of her real name Evan.\n\nThe present show which was started in 2016, Westworld Evan was casted as Dolores Abernathy in the main role of 3 season.\n\nDrunk History which took place on 2018-19 Rachel acted in various characters in 2 episodes.\n\nIn 2019 Rachel starred in What We Do in the Shadows as Evan the Immortal Princess of the Undead in the Episode: “The Trial” in 2019.\n\nHer recent television show is Phoenix Rising where she is carrying the character of herself.\n\nShe has done so many Music videos which includes “Wake Me Up When September Ends” from Green Day in 2005, “At the Bottom of Everything” from Bright Eyes in 2005, In 2007 “Heart-Shaped Glasses (When the Heart Guides the Hand)” sang by Marilyn Manson, in 2010 “Love Me Chase Me” singing credits to Carney.\n\nShe herself sang “I’d Have You Anytime” in 2012. In 2015 “Can’t Deny My Love” sang by Brandon Flowers, “Uneventful Days” from Beck in 2015.\n\nIn 2020″ Can I Be Your Friend ft. Evan Rachel Wood” from Chevy Mustang. In 2021 “11:11” sang by Ben Barnes.\n\nComing to her films list, she has done enormous movies which includes from her debut to the industry till her recent films.\n\nWood’s first major screen role was in the low-budget 1997 film Digging to China, which also starred Kevin Bacon, Cathy Moriarty, and Mary Stuart Masterson.\n\nThe film won the Children’s Jury Award at the Chicago International Children’s Film Festival.\n\nThat same year she also had a role in Practical Magic, a fantasy film directed by Griffin Dunne starring Sandra Bullock and Nicole Kidman.\n\nShe was a Teenage debut Actress in 2001’s, she acted in leading film Little Secrets, where she played aspiring 14-year-old concert violinist Emily Lindstrom.\n\nFor that role, she was nominated for Best Leading Young Actress at the Young Artist Awards.\n\nIn 1998 she casted in Detour as Daniella Rogers. Later her breakthrough movie role followed the film called Thirteen in 2003, she played the role of Tracy Louise Freeland, one of two young teens who sink into a downward spiral of hard drugs, sex, and petty crime.\n\nShe was nominated as Best Actress – Drama and for a Screen Actors Guild (SAG) Award for Best Actress for Golden Globe Awards.\n\nIn 2002 Rachel was in the role of Lainey Christian in the film Simone.\n\nA supporting role opposite Cate Blanchett and Tommy Lee Jones in Ron Howard’s The Missing, in which she played the kidnapped daughter, Lilly Gilkeson.\n\nIn 2005, Wood appeared opposite Kevin Costner and Joan Allen in the Mike Binder-directed The Upside of Anger, a well-reviewed film in which Wood played Lavender “Popeye” Wolfmeyer, one of four sisters dealing with their father’s absence.\n\nPretty Persuasion is a 2005 American black comedy film directed by Marcos Siega, where Rachel was casted as Kimberly Joyce.\n\nIn Down in the Valley, which was directed by David Jacobson, Wood’s character, Tobe, falls in love with an older man, a cowboy who is at odds with modern society (Edward Norton).\n\nAsterix and the Vikings, an animated adventure film based on a French comic book series Asterix, Rachel gave her vocal for the role Abba in English Version.\n\nAlso she gave her vocal for Cordelia in the film Shark Bait in 2006. Later in 2006, Wood appeared with an all-star ensemble cast as Natalie Finch in the Golden Globe nominated 2006 comedy-drama film Running with Scissors. Directed by Ryan Murphy and starring Annette Bening.\n\nIn 2007, Wood take part in the film King of California, which premiered at the Sundance Film Festival. Wood starred in 2008’s Vadim Perelman-directed The Life Before Her Eyes, based on the Laura Kasischke novel of the same name.\n\nIn 2007 film called Battle for Terra, Wood gave her voice to the character Mala.\n\nIn 2007, Rachel as Lucy Carrigan in the film Across the Universe.\n\nThe Wrestler where Rachel was as Stephanie Ramzinski in 2008.\n\nIn 2009 Whatever Works as Melodie St. Ann Celestine.\n\nIn 2010 in the film The Conspirator as Anna Surratt\n\nIn 2011 in the Film The Ides of March, she was casted asMolly Stearns.\n\nDuring 2013 in the film Charlie Countryman she pursued as Gabi Ibanescu.\n\nIn 2013 in the film A Case of You she took the character of Birdie Hazel.\n\nIn 2014 the film Barefoot she was the Daisy Kensington.\n\nDuring 2015 the movie Strange Magic, she gave her voice to Marianne.\n\nIn 2015 the film Into the Forest she was starred as Eva.\n\nIn 2017 in the film Allure she was Laura Drake.\n\nDuring 2018 in Flavors of Youth she gave the vocal to Yi Lin.\n\nIn 2019 in the film Frozen II she has given her voice to Queen Iduna.\n\nHer recent film in 2020 includes Kajillionaire as Old Dolio Dyne And also in 2020 Rachel was casted in the film Showbiz Kids which was a Documentary film.\n\nAgain in 2020 in the film Viena and the Fantomes she was a Susi.\n\nHer upcoming American biographical comedy film Weird: The Al Yankovic Story, directed by Eric Appel, the role and the release date should be announce yet.\n\nPhysical Appearance\n\nHeight – 5 feet 6 inches (1.67 m)\n\nWeight – 54 kg (119 lbs)\n\nBody Measurements – NA\n\nSkin tone – Light\n\nHair color – Blonde\n\nEye color – Blue\n\nNet Worth & Salary\n\nWood and her brothers were actively involved in Theatre in the Park while growing up, including an appearance by her in the 1987 production of her father’s musical comedy adaptation of A Christmas Carol when she was just a few months old.\n\nShe is a famous actress and a musician as well who has the Net Worth of $8 million and she is taking $250 thousand as Salary per episode.\n\nAwards/Accolades\n\nShe won the award for the film Westworld in 2017 in Satellite Award for Best Actress in a Series, Drama/Genre.\n\nIn 2016 she won Critics’ Choice Television Award for Best Actress in a Drama Series award for Westworld series.\n\nIn 2002 she won Young Hollywood Award for One To Watch. For the film Thirteen she won Las Vegas Film Critics Society Award for Youth in Film award in 2003.\n\nShe has also won Young Hollywood Superstar Award in 2009.\n\nAgain for the film Thirteen she was awarded for Phoenix Film Critics Society Award for Breakout Performance – On Screen in 2004 and also she got the award of Prism Award for Performance in a Feature Film for the film Thirteen again.\n\nFacts\n\nEvan Rachel Wood is opening up about her previous relationship with Marilyn Manson, his alleged abuse and her work to help survivors of domestic abuse.\n\nThis Westworld star has a black belt in Taekwondo.\n\nDavid Bowie is her biggest inspiration and in his honor, she got a lightning bolt tattoo"}, {"url": "https://marriedwikibio.com/evan-rachel-wood/", "page_content": "Evan Rachel Wood is an actress, model, and singer from the United States. She rose to prominence in 2016 as the star of HBO’s Westworld, for which she received a Critics’ Choice Award and a Golden Globe nomination.\n\nWood is best known for her role as Tracy Freeland, a troubled adolescent in the teen drama film Thirteen, for which she was nominated for a Golden Globe (2003). She’s also known for her roles in American Gothic (1995–96) and Once and Again (1999–2002), Digging to China (1997), Little Secrets (2001), and HBO’s drama TV series True Blood (2009-2011). Her music group, Rebel and a Basketcase (2016–2017), is also well-known.\n\nEvan Rachel Wood is well-known for what she does.\n\nEvan Rachel Wood is best known for her role as Tracy Freeland in the teen drama film Thirteen (2003), for which she received a Golden Globe nomination, and later for HBO’s Mildred Pierce (2011), for which she received a Golden Globe and Emmy Award nomination for Best Supporting Actress, and TV shows such as True Blood (2009-2011).\n\nWhen is Evan Rachel Wood from?\n\nWood was born in the city of Raleigh, North Carolina, in the United States. Sara Lynn Moore, her mum, is an actress, producer, and acting coach. Ira David Wood III, her father, is a well-known actor, musician, and the Executive Director of Theatre in the Park, a local community theater company.\n\nIra David Wood IV, who is also an actress, Dana, and Thomas, as well as a sister named Aden, are Wood’s three daughters. Carol Winstead Wood, her paternal aunt, worked as a production designer in Hollywood. She was raised in a Christian household as a child.\n\nWood and her brothers were active members of Theatre in the Park as children, and she and her brothers appeared in many of her father’s productions. She was also a martial artist in her adolescence, earning a black belt in taekwondo at the age of 12.\n\nWood’s parents divorced in 1996, and she moved to her mother’s hometown of Los Angeles County, California, with her mother. Wood attended Cary Elementary School in Cary, North Carolina, and Laurel Springs School for a short period. She was then home-schooled until she graduated from high school at the age of 15. Wood is of white ethnicity and is of American nationality. Her zodiac sign is Virgo, and her religion is Judaism.\n\nWhat does Evan Rachel Wood do for a living?\n\nWood started her acting career in 1994, starring in a number of small television films.\n\nIn 1995, she made her television debut in the small role series American Gothic.\n\nIn 1999, she appeared in the television show Once and Again as Jessie Sammler’s supporter.\n\nIn the low-budget 1997 film Digging to China, Wood made his first big screen appearance.\n\nWood made her feature film debut as a teenager in 2002’s Little Secrets. Her big break came in the film Thirteen, which she appeared in in 2003. She was nominated for a Golden Globe Award for Best Actress in a Drama and a Screen Actors Guild (SAG) Award for Best Actress for her performance.\n\nWood proceeded to work in independent films such as Pretty Persuasion (2005), Down in the Valley (2005), and Running with Scissors (2006), as well as in the major studio output Across the Universe (2007).\n\nWood has acted in more commercial films since 2008, such as The Wrestler (2008), Whatever Works (2009), and The Ides of March (2011).\n\nShe also returned to television, starring as Queen Sophie-Anne in True Blood from 2009 to 2011 and as Mildred Pierce’s daughter in the HBO miniseries Mildred Pierce (2011), for which she earned Golden Globe and Emmy Award nominations for Best Supporting Actress. She currently stars as Dolores Abernathy, a sentient android in HBO’s Westworld, for which she earned a Critics’ Choice Award and Golden Globe and Emmy Award nominations.\n\nEvan Rachel Wood’s height\n\nRachel Wood, an American actress, stands at a height of 5 feet 7 inches. She is now 32 years old and yet exudes the same glitz and glitter as she did when she was 22. Her body is slender and she weights 54 kilograms.\n\nHer hair is red, and her eyes are blue, and she is a single mother. In addition, her body measurements are 34-26-34 inches. Her bra size is 32B, her dress size is 4 (US), and she wears a size 9 shoe (US). Her sexual identity is bisexual.\n\nEvan Rachel Wood’s net worth\n\nAs of 2020, Evan Rachel Wood’s net worth is projected to be $8 million. Her professional career as an actress and model has netted her a large amount of money. This is the culmination of her hard work in the film industry for over two and a half decades, which has finally paid off handsomely.\n\nShe acts as a model for prestigious companies such as Creative Artists Agency and Circle Talent Agency. She also makes money by endorsing brands. In 2010, she and Chris Evans were selected as the faces of Gucci’s Guilty fragrance. Her automobiles, real estate, and other companies are currently being investigated.\n\nRachel Evan Wood, What happened to her?\n\nWood told a Rolling Stone reporter in 2016 that she had been assaulted twice in the past. Wood clarified that anytime her named ex-boyfriend threatened or assaulted her, she would cut her wrist to avoid the assault. She also posted a picture of her scarred wrists on Instagram, with her eyes closed and lying on a pillow next to her scarred wrist. Wood appeared as a rape victim and sexual assault survivor before the United States House Judiciary Subcommittee on Violence, Terrorism, Homeland Security, and Investigations in February 2018.\n\nEvan Rachel Wood is dating who?\n\nEvan’s current relationship status is single. She was, however, already married and had a variety of affairs. After meeting at the Sundance Film Festival in 2005, Wood started dating English actor Jamie Bell for a year.Wood and Bell rekindled their relationship five years after their first split in 2011.\n\nWood and Bell married on October 30, 2012, in a small ceremony, and have one son, Jack Matfin Bell, who was born on July 29, 2013. Wood and Bell declared their separation in May 2014, after 19 months of marriage. In January 2017, Wood announced her engagement to Zach Villa, a Rebel and Basketcase bandmate.\n\nThey called off their engagement in September 2017. From 2007 to 2010, Wood was in a relationship with Marilyn Manson. Wood came out as bisexual in 2011, and she revealed it on Twitter."}, {"url": "https://www.thelist.com/986265/the-truth-about-evan-rachel-woods-sexuality/", "page_content": "Evan Rachel Wood has been acting forever, making her debut all the way back in 1994 when the North Carolina native was just 7 years old. She worked extensively in television, but her breakout moment undoubtedly came in teen shocker \"Thirteen,\" in which Wood featured opposite \"Twilight\" star Nikki Reed. Subsequently, she made her mark on \"True Blood,\" \"Westworld,\" and plenty more besides.\n\nAs Self notes, Kirsten Dunst infamously got \"Interview with the Vampire\" over her, while, elsewhere, Wood turned down a role in \"Mean Girls\" to avoid being typecast. Nowadays, the actor is confident both in her abilities and career progression. Moreover, Wood doesn't focus purely on acting, telling Variety, \"I have my band, and I write. I'm always staying busy and doing something artistic, even if it's not in the public eye.\"\n\nThe former child star is also a dedicated and vocal activist, particularly for women's rights. As she explained, \"When I started being an activist, I really asked myself, where do I even start? So the place that I usually start, because I feel like I'm going to do the most good, are the places that I have direct experience. I think that's why I've done so much on domestic violence, and sexual assault.\"\n\nLikewise, Wood is open about her queer identity, especially when it comes to helping others."}, {"url": "https://www.celebsline.com/evan-rachel-wood/", "page_content": "Evan Rachel Wood is an American actress and musician best known for her portrayal of Dolores Abernathy in the HBO series Westworld, for which she received a Golden Globe and Emmy Award nomination. She was cast in many popular TV series like True Blood Doll & Em, Once and Again, Profiler, and American Gothic. She was first recognized for her role as Tracy Louise Freeland in the 2003 film Thirteen, which earned her widespread fame and several accolades. Her film credits include The Wrestler, Whatever Works, and The Ides of March.\n\nEvan Rachel Wood Biography\n\nBirth Name\n\nEvan Rachel Wood\n\nNickname\n\nEvie\n\nProfession\n\nActress, Musician, Model\n\nNationality\n\nAmerican\n\nBirthday / Date of Birth\n\nEvan Rachel Wood was born on 7 September 1987, in Raleigh, North Carolina, U.S.\n\nAge\n\nShe is currently 31 years old.\n\nSun Sign\n\nVirgo\n\nEthnicity\n\nWhite\n\nShe has English, Irish, Scottish, and German ancestry.\n\nReligion\n\nJewish\n\nEducation\n\nWood briefly attended Cary Elementary, a public school in Cary, North Carolina. She received her high school diploma at age 15 through homeschooling.\n\nFamily Details\n\nFather – Ira David Wood III (Actor, Singer)\n\n– Ira David Wood III (Actor, Singer) Mother – Sara Lynn Moore (Actress, Director)\n\n– Sara Lynn Moore (Actress, Director) Siblings – Ira David Wood IV (Older Brother) (Actor), Dana Wood (Brother), Thomas Wood (Brother)\n\nEvan Rachel Wood Husband\n\nEvan Rachel Wood married English actor, Jamie Bell on October 30, 2012. They have a son, on July 29, 2013. The couple ended their marriage in 2014.\n\nPrior to her marriage with Bell, Wood dated musician Marilyn Manson from 2007 until 2010. Their relationship garnered widespread media attention and was largely discussed in the press during this time. There are also engaged. She also dated The L Word actress Katherine Moennig.\n\nIn 2009, she had a fling with her True Blood co-star Alexander Skarsgård. In January 2017, Wood became engaged to her Rebel and a Basketcase bandmate, Zach Villa and they called off the engagement in September 2017.\n\nPhysical Statistics\n\nHeight\n\nFeet – 5 feet 6.25 inches\n\n– 5 feet 6.25 inches Centimeters – 168 cm\n\n– 168 cm Meters – 1.6 m\n\nWeight\n\nIn Kilograms – 54 kg\n\n– 54 kg In Pounds – 119 lbs\n\nBody measurements\n\nMeasurements – 33-26-34\n\n– 33-26-34 Bust – 33 inches\n\n– 33 inches Waist – 26 inches\n\n– 26 inches Hip – 34 inches\n\n– 34 inches Bra Size – 32A\n\nBody Build\n\nSlim\n\nEye Color\n\nBlue\n\nHair Color\n\nBlonde\n\nShoe Size\n\nShe wears a size 9 (US) shoe.\n\nDress Size\n\nHer dress size is 4 (US).\n\nSexuality\n\nBisexual\n\nProfessional Statistics\n\nFilm Debut\n\nEvan Rachel Wood made her big-screen debut in the 1997 film “Digging to China” for her role as Harriet Frankovitz. She was just nine years old when she was cast in the film that won the Children’s Jury Award at the Chicago International Children’s Film Festival.\n\nTelevision Debut\n\nWood made her first appearance in the 1994 television film, “In the Best of Families: Marriage, Pride & Madness”, playing Little Susie.\n\nShe played Rose Russell in n CBS’s horror series American Gothic from 1995 to 1996.\n\nFamous For\n\nHer role as Tracy Freeland in the film ‘Thirteen’ for which she earned a Golden Globe and a Screen Actors Guild Award nominations.\n\nHer roles in the HBO series, True Blood (2009-2011) and Westworld (2016 – Present).\n\nBrand Endorsements\n\nIn 2016, she served as the face of Gucci’s Guilty fragrance.\n\nFavorite Things\n\nActor – Gene Wilder\n\nActress – Cate Blanchett\n\nEvan Rachel Wood Net worth\n\nAs of 2023, Evan Rachel Wood has a net worth of $8 million. She divides her time between Los Angeles and New York.\n\nSocial Media Profiles\n\nFacebook – officialevanrachelwood\n\n– officialevanrachelwood Instagram – evanrachelwood\n\n– evanrachelwood Twitter – evanrachelwood\n\nEvan Rachel Wood Facts\n\nShe earned a black belt in taekwondo at the age of 12 years old.\n\nWood is a trained dancer.\n\nShe loves to sing, swim, rollerblade, and go horseback riding.\n\nIn 2001, Wood was named #31 in Maxim’s Hot 100 Women list.\n\nIn 2003, Vogue Magazine named her one of the “It Girls of Hollywood.”\n\nThe documentary “The Business of Being Born” by Ricki Lake was inspired by her as she gave home birth to her son. She thanked the author publicly for the same.\n\nIn 2009, she was ranked #1 in Venus Zine’s 25 Under 25 ladies list."}, {"url": "https://factmandu.com/evan-rachel-wood", "page_content": "Who is Evan Rachel Wood?\n\nEvan Rachel Wood is an American actress, model, and musician. In 2016, she made her huge name from the HBO television series Westworld, for which she won a Critics’ Choice Award and a Golden Globe nomination. Wood is widely famous for her Golden Globe-nominated role as the troubled teenager Tracy Freeland in the teen drama film Thirteen (2003). She is also known for appearing in many television series and films, including American Gothic (1995–96) and Once and Again (1999–2002), Digging to China (1997), Little Secrets (2001), and HBO’s drama TV series like True Blood (2009-2011). She is also recognized for her music group, Rebel and a Basketcase (2016 – 2017).\n\nWhat is Evan Rachel Wood famous for?\n\nEvan Rachel Wood Net Worth famous for her role as Tracy Freeland in the teen drama film Thirteen (2003) which earned her Golden Globe-nomination and later for HBO series Mildred Pierce (2011), a role for which she was nominated for the Golden Globe and Emmy Award for Best Supporting Actress and TV series like True Blood (2009-2011).\n\nWhen was Evan Rachel Wood born?\n\nWood was born in Raleigh, North Carolina, USA. Her mother, Sara Lynn Moore, is an actress, director, and acting coach. Her father, Ira David Wood III, is a locally prominent actor, singer, and Executive Director of a local community theatre company called Theatre in the Park. Wood's three brothers, Ira David Wood IV, is also an actor, Dana and Thomas, and a sister named Aden. Her paternal aunt, Carol Winstead Wood, was a Hollywood production designer. She was raised in Christian culture in childhood. Wood and her brothers were actively involved in Theatre in the Park while growing up and played in her father's directed several productions. She was also a martial artist in her teenage and was awarded a black belt in taekwondo when she was 12 years old.\n\nWood's parents separated in 1996 and later divorced, and Wood moved with her mother to her mother's native Los Angeles County, California. Wood briefly attended Cary Elementary, a public school in Cary, North Carolina, and Laurel Springs School. She was subsequently home-schooled and received her high school diploma at age 15. Wood's nationality is American and she belongs to White ethnicity. Her religion is Judaism and her zodiac is Virgo.\n\nWhat is Evan Rachel Wood's career?\n\nWood began her acting career appearing in several small television films from 1994 onward. Her first TV debut was from small role series American Gothic in 1995. She then did support the role of Jessie Sammler on the television show Once and Again in 1999. Wood's first major screen role was in the low-budget 1997 film Digging to China. Wood made her teenage debut as a leading film actress in 2002's Little Secrets. Her breakthrough came to a movie role in the 2003 film Thirteen. Her performance was nominated for a Golden Globe Award as Best Actress - Drama and for a Screen Actors Guild (SAG) Award for Best Actress.\n\nWood continued acting mostly in independent films, including Pretty Persuasion (2005), Down in the Valley (2005), Running with Scissors (2006), and in the big studio production Across the Universe (2007). Since 2008, Wood has appeared in more mainstream films, including The Wrestler (2008), Whatever Works (2009) and The Ides of March (2011). She also returned to television, playing the supporting role of Queen Sophie-Anne on True Blood from 2009 to 2011 and playing the daughter of Mildred Pierce in the HBO miniseries Mildred Pierce (2011), for which she was nominated for the Golden Globe and Emmy Award for Best Supporting Actress. She currently plays the sapient android Dolores Abernathy in the HBO series Westworld, for which she won a Critics' Choice Award and earned Golden Globe and Emmy Award nominations.\n\nHow tall is Evan Rachel Wood?\n\nThe American actress, Rachel Wood has a tall height of 5 feet 7 inches. She is now 32 years old and she lacks not a bit of glamour she would have in 22. She has a slim body that weighs 54kg. The mother of one has a red hair color and her eyes are Blue. Furthermore, her body figure measures as 34-26-34 inches. Likewise, her bra size is 32B, her dress size is 4(US) and her shoe size is 9(US). She has a bisexual orientation.\n\nWhat is Evan Rachel Wood's net worth?\n\nThe Westworld actress Evan Rachel Wood estimated net worth is $8million as of 2020. She has earned this huge sum of money from her professional career as an actress and a model. This is the result of her working hard in the film industry to leave a remark for over two and half decades which has eventually bear her huge reward. As a model, she works for big agencies like Creative Artists Agency and Circle Talent Agency. She also earns from her brand endorsements. She was chosen to be the face of Gucci Guilty fragrance in 2010 alongside Chris Evans. Information regarding her cars, real estate, and other businesses is currently under review.\n\nWhat happened to Rachel Evan Wood?\n\nIn 2016, Wood told a Rolling Stone reporter that she had been raped twice many years ago. Wood explained that whenever she was threatened or abused by her named ex-boyfriend, she would cut her wrist as a way to stop the abuse. She even shared a photo of the scars on her wrists via Instagram with a pose closing her eyes while lying on a pillow alongside her scarred wrist. In February 2018, Wood testified before the United States House Judiciary Subcommittee on Crime, Terrorism, Homeland Security and Investigations as a rape survivor and survivor of sexual abuse.\n\nEvan's relationship status is currently single. However, she was married before and involved in numerous affairs. Wood began dating English actor Jamie Bell for a year in 2005 after they met at the Sundance Film Festival. Wood rekindled her relationship with Bell, five years after they first broke up in 2011. They were married in a small ceremony on October 30, 2012, and have one son, Jack Matfin Bell, born on July 29, 2013.n May 2014, Wood and Bell announced that they had separated after 19 months of marriage.n January 2017, Wood became engaged to her Rebel and a Basketcase bandmate, Zach Villa. In September 2017, they called off the engagement. Wood had a relationship with Marilyn Manson from 2007 to 2010. Wood turned out to be bisexual in 2011, which she disclosed via Twitter."}, {"url": "https://famouspeople.wiki/evan-rachel-wood/", "page_content": "Evan Rachel Wood was born on 7 September 1987 (age 35 years; as of 2022) in Raleigh, North Carolina, United States. Her father’s name is Ira David Wood III and her mother’s name is Sara Lynn Moore. She has three brothers Ira David Wood IV, Dana Wood, and Thomas Wood, and one sister Aden Elins.\n\nEvan Rachel Wood Wiki / Biography\n\nName – Evan Rachel Wood\n\nReal Name – Evan Rachel Wood\n\nBirthday – 7 September 1987\n\nAge – 35 Years (as of 2022)\n\nGender – Female\n\nNationality – American\n\nZodiac/Sun Sign – Virgo\n\nReligion – Not known\n\nBorn In – Raleigh, North Carolina, United States\n\nHometown – Raleigh, North Carolina, United States\n\nFamous As – Actress\n\nProfession – Actress, Model\n\nDebut Movie – Digging to China (1997)\n\nDebut Television – In the Best of Families: Marriage, Pride & Madness (1994)\n\nFamily Details\n\nFather – Ira David Wood III\n\n– Ira David Wood III Mother – Sara Lynn Moore\n\n– Sara Lynn Moore Brother – Ira David Wood IV, Dana Wood, Thomas Wood\n\n– Ira David Wood IV, Dana Wood, Thomas Wood Sister – Aden Elins\n\nEvan Rachel Wood Husband, Boyfriend, Affairs and More\n\nAffairs/Boyfriend – Not known\n\n– Not known Marital Status – Divorced\n\n– Divorced Ex-husband – Jamie Bell ​(m. 2012; div. 2014)\n\n– Jamie Bell ​(m. 2012; div. 2014) Children’s – 1\n\n– 1 Son – Jack Matfin Bell\n\n– Jack Matfin Bell Daughter – N/A\n\nEducational Qualifications\n\nSchool – Cary Elementary School, Laurel Springs School\n\n– Cary Elementary School, Laurel Springs School College – Not known\n\n– Not known Qualifications – Not known\n\nPhysical Status & More\n\nHeight – 168 cm (In feet inches- 5′ 6″)\n\n– 168 cm (In feet inches- 5′ 6″) Weight – 46 kg (in pounds- 102 lbs)\n\n– 46 kg (in pounds- 102 lbs) Body Measurements – 34-26-34\n\n– 34-26-34 Eye Colour – Blue\n\n– Blue Hair Colour – Blonde\n\nEvan Rachel Wood Wikipedia\n\nEvan Rachel Wood is a famous American actress and model. She is from Raleigh, North Carolina, United States. She rose to fame for her movie The Wrestler (2008), and Whatever Works (2009). She receives the Critics’ Choice Television Award for Best Actress in a Drama Series and three Primetime Emmy Award nominations and three Golden Globe Award nominations for her work in film and television.\n\nShe is very active and famous on social media. She has more than 857k followers on her Instagram.\n\nNet Worth\n\nHis family member’s net worth is $8 million (In US Dollars).\n\nFAQs\n\nWho is Evan Rachel Wood? Evan Rachel Wood is a famous American actress and model.\n\nWhat is Evan Rachel Wood net worth? Evan Rachel Wood net worth is $8 million (In US Dollars)\n\nEvan Rachel Wood height? 168 cm (In feet inches- 5′ 6″)\n\nEvan Rachel Wood Age 7 September 1987 (age 35 years; as of 2022)\n\nEvan Rachel Wood father name Ira David Wood III\n\nEvan Rachel Wood mother name Sara Lynn Moore\n\nSocial Media"}], "Evan Rachel Wood's profession is musician.": [{"url": "https://www.thefamouspeople.com/profiles/evan-rachel-wood-1380.php", "page_content": "She studied at ‘Cary Elementary,’ a public school in Cary, North Carolina. She then continued her studies at home, earning her high school diploma at the age of 15.\n\nHer father cast her in his 1987 adaptation of ‘A Christmas Carol.’ She was also cast in ‘Ghost of Christmas Past.’ She was later cast as ‘Helen Keller,’ alongside her mother, in a production of ‘The Miracle Worker.’\n\nShe has three brothers: Ira David Wood IV, Dana Wood, and Thomas Wood. She also has a sister named Aden. Wood and her brothers were involved in ‘Theatre in the Park.’ Her aunt, Carol Winstead Wood, was a production designer in Hollywood.\n\nEvan Rachel Wood was born on 7 September 1987, in Raleigh, North Carolina, USA, to Ira David Wood III and Sara Lynn Moore. Both her parents are actors. Her father is also the executive director of ‘Theatre in the Park.’\n\nRecommended Lists:\n\nCareer\n\nIn 1996, her parents separated and she moved with her mother to Los Angeles. She was cast in ‘Once and Again’ as ‘Jessie Sammler.’\n\nShe played ‘Harriet Frankovitz,’ a young girl who befriends a mentally ill man, in ‘Digging to China,’ which starred Kevin Bacon and Mary Stuart Masterson. The film won the ‘Children’s Jury Award’ at ‘Chicago International Children’s Film Festival.’\n\nIn 1998, she was cast in the fantasy film ‘Practical Magic’ which was directed by Griffin Dunne. She played the daughter and niece of the characters, portrayed by Sandra Bullock and Nicole Kidman respectively.\n\nIn 2001, Wood landed the lead role of ‘Emily Lindstrom,’ an aspiring concert violinist, in ‘Little Secrets.’ She won a nomination for ‘Best Leading Young Actress’ at the ‘Young Artist Awards.’\n\nIn 2003, she acted alongside Cate Blanchett and Tommy Lee Jones in ‘The Missing.’ She also acted in the ‘Got Murder?’ episode of the TV series ‘CSI: Crime Scene Investigation.’\n\nIn 2005, she played ‘Lavender Wolfmeyer,’ one of four sisters handling the disappointment of their father's absence, in ‘The Upside of Anger.’ Wood’s character narrated the movie, which starred Kevin Costner and Joan Allen.\n\nIn ‘Down in the Valley,’ directed by David Jacobson, she played the role of ‘Tobe’ who falls in love with an older man, played by Edward Norton.\n\nThe 2007 released ‘King of California’ saw her in the role of ‘Miranda,’ the teenage daughter of a jazz musician suffering from a mental illness, played by Michael Douglas.\n\nIn 2007, she played young ‘Diana McFee’ in ‘The Life Before Her Eyes,’ which was directed by Vadim Perelman. The movie was based on Laura Kasischke’s novel of the same name.\n\nContinue Reading Below\n\nWood played the estranged daughter of ‘Randy Robinson,’ played by Mickey Rourke, in the 2008 released film ‘The Wrestler,’ which was directed by Darren Aronofsky. The movie won the ‘Golden Lion Award’ for ‘Best Film’ at ‘Venice Film Festival.’\n\nIn 2009, she played ‘Melodie’ opposite Larry David in Woody Allen’s ‘Whatever Works.’ She played ‘Juliet’ in a fundraising production of William Shakespeare’s ‘Romeo and Juliet,’ directed by her brother.\n\nFrom 2009 to 2011, she played the recurring role of ‘Sophie-Anne Leclerq’ in the ‘HBO’ series ‘True Blood.’ In ‘The Conspirator,’ she played ‘Anna Surratt.’ She also acted in ‘The Ides of March.’\n\nIn ‘Mildred Pierce,’ the 2011 ‘HBO’ miniseries, she portrayed the title character’s daughter ‘Veda Pierce.’ She was nominated for the ‘Primetime Emmy Award’ for ‘Outstanding Supporting Actor in a Miniseries or a Movie.’\n\nFrom 2013 to 2015, she appeared in a number of movies, such as ‘A Case of You’ (2013), ‘Barefoot’ (2014), ‘Strange Magic’ (2015), and ‘Into the Forest’ (2015).\n\nIn 2016, she was cast as the sentient android ‘Dolores Abernathy’ in the ‘HBO’ science fiction TV series ‘Westworld.’ For her role, she was nominated at the ‘Golden Globes’ and ‘Primetime Emmy Awards.’"}, {"url": "https://famouspeople.wiki/evan-rachel-wood/", "page_content": "Evan Rachel Wood was born on 7 September 1987 (age 35 years; as of 2022) in Raleigh, North Carolina, United States. Her father’s name is Ira David Wood III and her mother’s name is Sara Lynn Moore. She has three brothers Ira David Wood IV, Dana Wood, and Thomas Wood, and one sister Aden Elins.\n\nEvan Rachel Wood Wiki / Biography\n\nName – Evan Rachel Wood\n\nReal Name – Evan Rachel Wood\n\nBirthday – 7 September 1987\n\nAge – 35 Years (as of 2022)\n\nGender – Female\n\nNationality – American\n\nZodiac/Sun Sign – Virgo\n\nReligion – Not known\n\nBorn In – Raleigh, North Carolina, United States\n\nHometown – Raleigh, North Carolina, United States\n\nFamous As – Actress\n\nProfession – Actress, Model\n\nDebut Movie – Digging to China (1997)\n\nDebut Television – In the Best of Families: Marriage, Pride & Madness (1994)\n\nFamily Details\n\nFather – Ira David Wood III\n\n– Ira David Wood III Mother – Sara Lynn Moore\n\n– Sara Lynn Moore Brother – Ira David Wood IV, Dana Wood, Thomas Wood\n\n– Ira David Wood IV, Dana Wood, Thomas Wood Sister – Aden Elins\n\nEvan Rachel Wood Husband, Boyfriend, Affairs and More\n\nAffairs/Boyfriend – Not known\n\n– Not known Marital Status – Divorced\n\n– Divorced Ex-husband – Jamie Bell ​(m. 2012; div. 2014)\n\n– Jamie Bell ​(m. 2012; div. 2014) Children’s – 1\n\n– 1 Son – Jack Matfin Bell\n\n– Jack Matfin Bell Daughter – N/A\n\nEducational Qualifications\n\nSchool – Cary Elementary School, Laurel Springs School\n\n– Cary Elementary School, Laurel Springs School College – Not known\n\n– Not known Qualifications – Not known\n\nPhysical Status & More\n\nHeight – 168 cm (In feet inches- 5′ 6″)\n\n– 168 cm (In feet inches- 5′ 6″) Weight – 46 kg (in pounds- 102 lbs)\n\n– 46 kg (in pounds- 102 lbs) Body Measurements – 34-26-34\n\n– 34-26-34 Eye Colour – Blue\n\n– Blue Hair Colour – Blonde\n\nEvan Rachel Wood Wikipedia\n\nEvan Rachel Wood is a famous American actress and model. She is from Raleigh, North Carolina, United States. She rose to fame for her movie The Wrestler (2008), and Whatever Works (2009). She receives the Critics’ Choice Television Award for Best Actress in a Drama Series and three Primetime Emmy Award nominations and three Golden Globe Award nominations for her work in film and television.\n\nShe is very active and famous on social media. She has more than 857k followers on her Instagram.\n\nNet Worth\n\nHis family member’s net worth is $8 million (In US Dollars).\n\nFAQs\n\nWho is Evan Rachel Wood? Evan Rachel Wood is a famous American actress and model.\n\nWhat is Evan Rachel Wood net worth? Evan Rachel Wood net worth is $8 million (In US Dollars)\n\nEvan Rachel Wood height? 168 cm (In feet inches- 5′ 6″)\n\nEvan Rachel Wood Age 7 September 1987 (age 35 years; as of 2022)\n\nEvan Rachel Wood father name Ira David Wood III\n\nEvan Rachel Wood mother name Sara Lynn Moore\n\nSocial Media"}, {"url": "https://www.celebsline.com/evan-rachel-wood/", "page_content": "Evan Rachel Wood is an American actress and musician best known for her portrayal of Dolores Abernathy in the HBO series Westworld, for which she received a Golden Globe and Emmy Award nomination. She was cast in many popular TV series like True Blood Doll & Em, Once and Again, Profiler, and American Gothic. She was first recognized for her role as Tracy Louise Freeland in the 2003 film Thirteen, which earned her widespread fame and several accolades. Her film credits include The Wrestler, Whatever Works, and The Ides of March.\n\nEvan Rachel Wood Biography\n\nBirth Name\n\nEvan Rachel Wood\n\nNickname\n\nEvie\n\nProfession\n\nActress, Musician, Model\n\nNationality\n\nAmerican\n\nBirthday / Date of Birth\n\nEvan Rachel Wood was born on 7 September 1987, in Raleigh, North Carolina, U.S.\n\nAge\n\nShe is currently 31 years old.\n\nSun Sign\n\nVirgo\n\nEthnicity\n\nWhite\n\nShe has English, Irish, Scottish, and German ancestry.\n\nReligion\n\nJewish\n\nEducation\n\nWood briefly attended Cary Elementary, a public school in Cary, North Carolina. She received her high school diploma at age 15 through homeschooling.\n\nFamily Details\n\nFather – Ira David Wood III (Actor, Singer)\n\n– Ira David Wood III (Actor, Singer) Mother – Sara Lynn Moore (Actress, Director)\n\n– Sara Lynn Moore (Actress, Director) Siblings – Ira David Wood IV (Older Brother) (Actor), Dana Wood (Brother), Thomas Wood (Brother)\n\nEvan Rachel Wood Husband\n\nEvan Rachel Wood married English actor, Jamie Bell on October 30, 2012. They have a son, on July 29, 2013. The couple ended their marriage in 2014.\n\nPrior to her marriage with Bell, Wood dated musician Marilyn Manson from 2007 until 2010. Their relationship garnered widespread media attention and was largely discussed in the press during this time. There are also engaged. She also dated The L Word actress Katherine Moennig.\n\nIn 2009, she had a fling with her True Blood co-star Alexander Skarsgård. In January 2017, Wood became engaged to her Rebel and a Basketcase bandmate, Zach Villa and they called off the engagement in September 2017.\n\nPhysical Statistics\n\nHeight\n\nFeet – 5 feet 6.25 inches\n\n– 5 feet 6.25 inches Centimeters – 168 cm\n\n– 168 cm Meters – 1.6 m\n\nWeight\n\nIn Kilograms – 54 kg\n\n– 54 kg In Pounds – 119 lbs\n\nBody measurements\n\nMeasurements – 33-26-34\n\n– 33-26-34 Bust – 33 inches\n\n– 33 inches Waist – 26 inches\n\n– 26 inches Hip – 34 inches\n\n– 34 inches Bra Size – 32A\n\nBody Build\n\nSlim\n\nEye Color\n\nBlue\n\nHair Color\n\nBlonde\n\nShoe Size\n\nShe wears a size 9 (US) shoe.\n\nDress Size\n\nHer dress size is 4 (US).\n\nSexuality\n\nBisexual\n\nProfessional Statistics\n\nFilm Debut\n\nEvan Rachel Wood made her big-screen debut in the 1997 film “Digging to China” for her role as Harriet Frankovitz. She was just nine years old when she was cast in the film that won the Children’s Jury Award at the Chicago International Children’s Film Festival.\n\nTelevision Debut\n\nWood made her first appearance in the 1994 television film, “In the Best of Families: Marriage, Pride & Madness”, playing Little Susie.\n\nShe played Rose Russell in n CBS’s horror series American Gothic from 1995 to 1996.\n\nFamous For\n\nHer role as Tracy Freeland in the film ‘Thirteen’ for which she earned a Golden Globe and a Screen Actors Guild Award nominations.\n\nHer roles in the HBO series, True Blood (2009-2011) and Westworld (2016 – Present).\n\nBrand Endorsements\n\nIn 2016, she served as the face of Gucci’s Guilty fragrance.\n\nFavorite Things\n\nActor – Gene Wilder\n\nActress – Cate Blanchett\n\nEvan Rachel Wood Net worth\n\nAs of 2023, Evan Rachel Wood has a net worth of $8 million. She divides her time between Los Angeles and New York.\n\nSocial Media Profiles\n\nFacebook – officialevanrachelwood\n\n– officialevanrachelwood Instagram – evanrachelwood\n\n– evanrachelwood Twitter – evanrachelwood\n\nEvan Rachel Wood Facts\n\nShe earned a black belt in taekwondo at the age of 12 years old.\n\nWood is a trained dancer.\n\nShe loves to sing, swim, rollerblade, and go horseback riding.\n\nIn 2001, Wood was named #31 in Maxim’s Hot 100 Women list.\n\nIn 2003, Vogue Magazine named her one of the “It Girls of Hollywood.”\n\nThe documentary “The Business of Being Born” by Ricki Lake was inspired by her as she gave home birth to her son. She thanked the author publicly for the same.\n\nIn 2009, she was ranked #1 in Venus Zine’s 25 Under 25 ladies list."}, {"url": "https://wikiwiki.in/actress/evan-rachel-wood/", "page_content": "Evan Rachel Wood (Actress) Height, Weight, Date of Birth, Age, Wiki, Biography, Boyfriend and More\n\nEvan Rachel Wood is an American actress, musician, and model. She has appeared in many American TV serials American Gothic, Once and Again, and many more. She has also been awarded the Critics’ Choice Television Award and Primetime Emmy Award. She has also given her voice in Disney animated fantasy film Frozen II.\n\nBirth & Family\n\nEvan Rachel Wood was born on born 7 September 1987 in Raleigh, North Carolina. Her father’s name is Ira David Wood III who is also an actor and singer. Her mother Sara Lynn Moore is an actress and a director. She also has three brothers named Ira David Wood IV, Dana and Thomas, and a sister named Aden. Her paternal aunt, Carol Winstead Wood, was also a Hollywood production designer.\n\nBio\n\nReal Name Evan Rachel Wood Profession Actress, Musician, and Model Date of Birth September 7, 1987 Age (as in 2022) 35 Years Birth Place Raleigh, North Carolina, United States Nationality American Home Town Raleigh, North Carolina, United States Family Mother : Sara Lynn Moore\n\nFather : Ira David Wood III\n\nSister : Aden Elins\n\nBrother : Dana Wood, Ira David Wood IV, Thomas Wood\n\nHusband : Jamie Bell ​(m. 2012-div. 2014)\n\nSon : Jack Matfin Bell Religion Jewish Address North Carolina, United States\n\nEducation\n\nEvan studied at ‘Cary Elementary,’ a public school in Cary, North Carolina. She later continued her studies through homeschooling. She earning her high school diploma at the age of 15.\n\nEducation Details and More\n\nSchool Cary Elementary, Cary, North Carolina College Not Known Educational Qualification Graduate Debut Film : Digging to China (1997)\n\n\n\nTelevision : American Gothic (1995)\n\nAwards Not Available\n\nCareer\n\nEvan began her acting career in 1994 with a television film In the Best of Families: Marriage, Pride & Madness and then appeared in American Gothic, Get to the Heart: The Barbara Mandrell Story, Profiler, Down Will Come, Baby and many more. Her film career started in 1997 by playing Harriet Frankovitz in Digging to China which also starred Kevin Bacon and Cathy Moriarty. The film won the Children’s Jury Award at the Chicago International Children’s Film Festival.\n\nShe rose to fame through her performance as Tracy Louise Freeland in Catherine Hardwicke directed teen drama film Thirteen in the year. She was nominated in Best Actress in a Drama at Golden Globe Awards. She then worked in Little Secrets, Simone, Thirteen, The Missing.\n\nPhysical Stats and More\n\nHeight In Feet : 5′ 6″ ft\n\nIn Meter : 1.7 m Weight In Pound : 130 lb\n\nIn Kilogram : 59 Kg Figure Measurement 35-27-34 Eye Colour Blue Hair Colour Red blond Hobbies Reading and Shopping\n\nPersonal Life\n\nEvan was dating Marilyn Manson and got engaged in 2010, but broke up later that year. She got married to Jamie Bell in 2012 but got divorced in 2014. She also has a child named Jack Matfin Bell. She also had a relationship with Zach Villa from 2015 to 2017.\n\nMarital Status and More\n\nMarital Status Divorced Boyfriends Jamie Bell Controversies Wood alleged that Manson whose legal name is Brian Hugh Warner, “essentially raped” her on-camera without her consent. She revealed that via a statement posted on her Instagram account. Net Worth USD 1-10 million\n\nSocial Media Presence\n\nSome Facts About Evan Rachel Wood\n\nEvan Rachel Wood was born and brought up in North Carolina.\n\nHer mother converted to Judaism and raised her in the Jewish faith.\n\nHer first music video came in 2005 named “Wake Me Up When September Ends”.\n\nShe was awarded a black belt in taekwondo when she was 12 years old.\n\nShe stars as sentient android Dolores Abernathy in the HBO series Westworld from 2016-21, for which she has won a Critics’ Choice Award and earned Golden Globe and Emmy Award nominations.\n\nIn 2018, Wood made serious allegation on Marilyn Manson. She wrote,\n\n“He started grooming me when I was a teenager and horrifically abused me for years. I was brainwashed and manipulated into submission. I am done living in fear of retaliation, slander, or blackmail. I am here to expose this dangerous man and call out the many industries that have enabled him, before he ruins any more lives. I stand with the many victims who will no longer be silent.”\n\nIf you have more details about Evan Rachel Wood. Please comment below we will updated within a hour."}, {"url": "https://celebs99.com/evan-rachel-wood/", "page_content": "Evan Rachel Wood is an 34 years old American Actress, Model, Musician who started her career when she was just 10 years old during the year 1997.\n\nEvan Rachel grew up along with her parents and four siblings Ira David Wood IV, Dana Wood, Aden Elins, Thomas Wood in her hometown North Carolina, USA.\n\nBorn on 1987 in North Carolina, USA actress Evan Rachel is a very popular celebrity in the United States and all around the world due to her amazing acting performances in multiple Hollywood movies.\n\nIn this article you will find out everything about American actress Evan Rachel Wood – Age, Height, Biography, Net Worth, Husband, Early & professional life, Movies.\n\nEvan Rachel Wood Bio\n\nFull Name Evan Rachel Wood Birth Name NA Nickname Evan Profession Actress + Model + Musician Nationality American Date of Birth 7 September 1987 Age 34 years old as of 2022 Birth Place Raleigh, North Carolina, USA Gender Female Religion Jewish Hometown NA Hobbies NA School Cary Elementary School, Laurel Springs School University NA Qualification High school Graduate Zodiac Sign Virgo Languages English Net Worth $ 8 million Salary (per annum) NA Ethnicity NA Marital Married Spouse Jamie Bell (m. 2012, div. 2014) Boyfriend NA Children Jack Matfin Bell Parents Ira David Wood III,\n\nSara Lynn Moore Siblings Ira David Wood IV,\n\nDana Wood,\n\nAden Elins,\n\nThomas Wood\n\nEvan Rachel is an American Actress, Activist, Model and Singer. She was born on September 7 1987, in Raleigh, North Carolina. For the lead role in an interview, she screen tested at the age of five against Kirsten Dunst with the Vampire.\n\nHer father Ira David Wood III, is a Thratre Actor, Writer and Director and his mother Sara Wood is also an Actress and an Acting coach.\n\nEvan’s Siblings are Ira David Wood IV, Dana Wood, Aden Elins and Thomas Wood.\n\nShe is the receiver of Critics’ Choice Television Award as well as three Primetime Emmy Award nominations and three Golden Globe Award nominations for her work in film and television.\n\nEvan and her brothers sometimes performed at Theatre In The Park in Raleigh, which her father founded and where he serves as executive director.\n\nShe began her acting in 1990s starting in some Television series including, American Gothic and Once and Again.\n\nHer first debut in the film as a lead role is Digging to China at the age of nine.\n\nWood has been described by The Guardian newspaper as being “wise beyond her years” and as “one of the best actresses of her generation”.\n\nEducation\n\nEvan was born and bought up in Raleigh, North Carolina. After a long auditioning process of The Vampire Chronicles, she moved to Los Angeles with her and brother Ira.\n\nShe started her schooling her Cary Elementary School, later she received her high school diploma in Laurel Springs School in the age of 15.\n\nEarly life\n\nWood was born in Raleigh, North Carolina. She is basically from a family who has taken their career in acting fields where in her mother Sara Lynn Moore, is an actress, director, and acting coach, and her father Ira David Wood III, is a locally prominent actor, singer, theater director, and playwright.\n\nHe is also the executive director of a local community theatre company called Theatre in the Park. Her mother got converted to Judaism and raised her daughter in the Jewish faith.\n\nWood’s brother, Ira David Wood IV, is also an actor. She also have two other brothers, Dana and Thomas who are not belonging to this field.\n\nHer sister Aden who also into this field again. She has a paternal aunt who is a Hollywood Production Designer. Wood’s parents separated in 1996, and divorced in 2002.\n\nIn 1997 Wood moved with her mother to her mother’s native Los Angeles County, California.\n\nBefore that she started her schooling in Cary Elementary School in Cary, North Carolina.\n\nShe left the public schooling at the age of 12 joined for homeschooling because of bullying.\n\nShe completed her high school diploma at age15.\n\nPersonal life\n\nEvan Rachel Wood is reportedly single right now. She is not married, so there is no Evan Rachel Wood husband.\n\nHowever, she was married to ex Jamie Bell from 2012 to 2014.\n\nEvan rachel wood and Jamie bell\n\nThis list of Evan Rachel Wood exes includes Zach Villa and Marilyn Manson.\n\nShe has a child name Jack Matfin Bell born on 2013.\n\nProfessional life\n\nWood started her career in 1994 in Television films, she was casted as Little Susie in the film Best of Families: Marriage, Pride & Madness.\n\nIn the same year she starred as Young Sarah / Robin in the film Search for Grace.\n\nShe pursued herself as Tessa in A Father for Charlie and in Death in Small Doses as Anna.\n\nIn the 3 episodes of American Gothic as Rose Russell in 1995-1996.\n\nA television film called Get to the Heart: The Barbara Mandrell Story as Jaime Dudney in 1997.\n\nShe starred as Chloe waters in 6 episodes of Profiler 1998-99. Down Will Come Baby is a true-story American thriller drama based on a book by Gloria Murphy released on 1999 where Rachel acted as Robin Garr.\n\nShe had a main cast in Once and Again as Jessie Sammler in 1992-2002. In the episode Pandor’s Box she casted as Sarah Radcliff in Touched by an Angel.\n\nIn 2002, a film called The West Wing as Hogan Cregg in the episode “The Black Vera Wang”.\n\nThe episode Got Murder Evan was casted in the role of Nora Easton in Crime Scene Investigation in 2003.\n\nIn 2009-11 True Blood, an American fantasy horror drama, Rachel casted as Sophie-Anne Leclerq in 8 episodes.\n\nIn the 2 episodes of miniseries of the film Mildred Pierce Rachel starred as Veda Pierce in 2011.\n\nRobot Chicken Rachel was as Travis’ Girlfriend / Mother (voice) in the episode: “Botched Jewel Heist” in 2013.\n\nIn the 5 episodes of Doll & Em in 2015 Evan has the role of her real name Evan.\n\nThe present show which was started in 2016, Westworld Evan was casted as Dolores Abernathy in the main role of 3 season.\n\nDrunk History which took place on 2018-19 Rachel acted in various characters in 2 episodes.\n\nIn 2019 Rachel starred in What We Do in the Shadows as Evan the Immortal Princess of the Undead in the Episode: “The Trial” in 2019.\n\nHer recent television show is Phoenix Rising where she is carrying the character of herself.\n\nShe has done so many Music videos which includes “Wake Me Up When September Ends” from Green Day in 2005, “At the Bottom of Everything” from Bright Eyes in 2005, In 2007 “Heart-Shaped Glasses (When the Heart Guides the Hand)” sang by Marilyn Manson, in 2010 “Love Me Chase Me” singing credits to Carney.\n\nShe herself sang “I’d Have You Anytime” in 2012. In 2015 “Can’t Deny My Love” sang by Brandon Flowers, “Uneventful Days” from Beck in 2015.\n\nIn 2020″ Can I Be Your Friend ft. Evan Rachel Wood” from Chevy Mustang. In 2021 “11:11” sang by Ben Barnes.\n\nComing to her films list, she has done enormous movies which includes from her debut to the industry till her recent films.\n\nWood’s first major screen role was in the low-budget 1997 film Digging to China, which also starred Kevin Bacon, Cathy Moriarty, and Mary Stuart Masterson.\n\nThe film won the Children’s Jury Award at the Chicago International Children’s Film Festival.\n\nThat same year she also had a role in Practical Magic, a fantasy film directed by Griffin Dunne starring Sandra Bullock and Nicole Kidman.\n\nShe was a Teenage debut Actress in 2001’s, she acted in leading film Little Secrets, where she played aspiring 14-year-old concert violinist Emily Lindstrom.\n\nFor that role, she was nominated for Best Leading Young Actress at the Young Artist Awards.\n\nIn 1998 she casted in Detour as Daniella Rogers. Later her breakthrough movie role followed the film called Thirteen in 2003, she played the role of Tracy Louise Freeland, one of two young teens who sink into a downward spiral of hard drugs, sex, and petty crime.\n\nShe was nominated as Best Actress – Drama and for a Screen Actors Guild (SAG) Award for Best Actress for Golden Globe Awards.\n\nIn 2002 Rachel was in the role of Lainey Christian in the film Simone.\n\nA supporting role opposite Cate Blanchett and Tommy Lee Jones in Ron Howard’s The Missing, in which she played the kidnapped daughter, Lilly Gilkeson.\n\nIn 2005, Wood appeared opposite Kevin Costner and Joan Allen in the Mike Binder-directed The Upside of Anger, a well-reviewed film in which Wood played Lavender “Popeye” Wolfmeyer, one of four sisters dealing with their father’s absence.\n\nPretty Persuasion is a 2005 American black comedy film directed by Marcos Siega, where Rachel was casted as Kimberly Joyce.\n\nIn Down in the Valley, which was directed by David Jacobson, Wood’s character, Tobe, falls in love with an older man, a cowboy who is at odds with modern society (Edward Norton).\n\nAsterix and the Vikings, an animated adventure film based on a French comic book series Asterix, Rachel gave her vocal for the role Abba in English Version.\n\nAlso she gave her vocal for Cordelia in the film Shark Bait in 2006. Later in 2006, Wood appeared with an all-star ensemble cast as Natalie Finch in the Golden Globe nominated 2006 comedy-drama film Running with Scissors. Directed by Ryan Murphy and starring Annette Bening.\n\nIn 2007, Wood take part in the film King of California, which premiered at the Sundance Film Festival. Wood starred in 2008’s Vadim Perelman-directed The Life Before Her Eyes, based on the Laura Kasischke novel of the same name.\n\nIn 2007 film called Battle for Terra, Wood gave her voice to the character Mala.\n\nIn 2007, Rachel as Lucy Carrigan in the film Across the Universe.\n\nThe Wrestler where Rachel was as Stephanie Ramzinski in 2008.\n\nIn 2009 Whatever Works as Melodie St. Ann Celestine.\n\nIn 2010 in the film The Conspirator as Anna Surratt\n\nIn 2011 in the Film The Ides of March, she was casted asMolly Stearns.\n\nDuring 2013 in the film Charlie Countryman she pursued as Gabi Ibanescu.\n\nIn 2013 in the film A Case of You she took the character of Birdie Hazel.\n\nIn 2014 the film Barefoot she was the Daisy Kensington.\n\nDuring 2015 the movie Strange Magic, she gave her voice to Marianne.\n\nIn 2015 the film Into the Forest she was starred as Eva.\n\nIn 2017 in the film Allure she was Laura Drake.\n\nDuring 2018 in Flavors of Youth she gave the vocal to Yi Lin.\n\nIn 2019 in the film Frozen II she has given her voice to Queen Iduna.\n\nHer recent film in 2020 includes Kajillionaire as Old Dolio Dyne And also in 2020 Rachel was casted in the film Showbiz Kids which was a Documentary film.\n\nAgain in 2020 in the film Viena and the Fantomes she was a Susi.\n\nHer upcoming American biographical comedy film Weird: The Al Yankovic Story, directed by Eric Appel, the role and the release date should be announce yet.\n\nPhysical Appearance\n\nHeight – 5 feet 6 inches (1.67 m)\n\nWeight – 54 kg (119 lbs)\n\nBody Measurements – NA\n\nSkin tone – Light\n\nHair color – Blonde\n\nEye color – Blue\n\nNet Worth & Salary\n\nWood and her brothers were actively involved in Theatre in the Park while growing up, including an appearance by her in the 1987 production of her father’s musical comedy adaptation of A Christmas Carol when she was just a few months old.\n\nShe is a famous actress and a musician as well who has the Net Worth of $8 million and she is taking $250 thousand as Salary per episode.\n\nAwards/Accolades\n\nShe won the award for the film Westworld in 2017 in Satellite Award for Best Actress in a Series, Drama/Genre.\n\nIn 2016 she won Critics’ Choice Television Award for Best Actress in a Drama Series award for Westworld series.\n\nIn 2002 she won Young Hollywood Award for One To Watch. For the film Thirteen she won Las Vegas Film Critics Society Award for Youth in Film award in 2003.\n\nShe has also won Young Hollywood Superstar Award in 2009.\n\nAgain for the film Thirteen she was awarded for Phoenix Film Critics Society Award for Breakout Performance – On Screen in 2004 and also she got the award of Prism Award for Performance in a Feature Film for the film Thirteen again.\n\nFacts\n\nEvan Rachel Wood is opening up about her previous relationship with Marilyn Manson, his alleged abuse and her work to help survivors of domestic abuse.\n\nThis Westworld star has a black belt in Taekwondo.\n\nDavid Bowie is her biggest inspiration and in his honor, she got a lightning bolt tattoo"}, {"url": "https://www.wikibasis.com/people/what-is-evan-rachel-woods-net-worth-career-biography-facts-age-life-story/", "page_content": "Evan Rachel Wood is an American actress and musician who has a net worth of $8 million. Evan Rachel Wood has appeared in numerous films and television series. After getting her start on the shows “American Gothic” and “Once and Again,” she went on to earn acclaim for her performances in the films “Thirteen,” “Pretty Persuasion,” and “Across the Universe.” Wood’s other credits have included the films “The Wrestler” and “The Ides of March,” and the television series “True Blood,” “Mildred Pierce,” and “Westworld.”\n\nEarly Life\n\nEvan Rachel Wood was born on September 7, 1987 in Raleigh, North Carolina to actor and director parents Sara Lynn Moore and Ira David Wood III. Her mother, who had converted to Judaism, raised Wood and her brothers in the Jewish faith. Growing up, the children were all actively involved in Theatre in the Park, a local community company of which their father was the executive director.\n\nCareer Beginnings\n\nWood made her professional acting debut as a kid in 1994, appearing in two television films, “In the Best of Families: Marriage, Pride & Madness” and “Search for Grace.” She was in two more television films the next year called “A Father for Charlie” and “Death in Small Doses.” From 1995 to 1996, Wood appeared in three episodes of the CBS horror series “American Gothic.” Following the separation of her parents in 1996, she moved with her mother to the Los Angeles area. There, she was homeschooled, and received her high school diploma.\n\nFilm Career\n\nIn 1997, Wood made her big-screen debut with a starring role opposite Kevin Bacon in Timothy Hutton’s drama “Digging to China.” The next year, she had a supporting role in the fantasy romcom “Practical Magic,” starring Nicole Kidman and Sandra Bullock. As a teenager, Wood starred in the 2001 dramedy “Little Secrets,” playing an aspiring concert violinist. She followed this with a supporting role in the science-fiction film “Simone,” starring Al Pacino. In 2003, Wood had her breakthrough role as a promiscuous, drug-addled teen in the independent drama “Thirteen.” For her performance, she received Golden Globe and SAG Award nominations for Best Actress. Wood appeared in a number of other acclaimed independent films over the subsequent years, including Ron Howard’s Western “The Missing”; the black comedy “Pretty Persuasion”; the romantic dramedy “The Upside of Anger”; the neo-Western “Down in the Valley”; and the dramedies “Running with Scissors” and “King of California.”\n\nIn 2007, Wood lent her voice to the animated science-fiction film “Battle for Terra.” Her biggest role that year was in Julie Taymor’s jukebox Beatles musical “Across the Universe,” in which she starred opposite Jim Sturgess. Wood was subsequently in the thriller “The Life Before Her Eyes” and the sports drama “The Wrestler,” in which she played the estranged daughter of Mickey Rourke’s titular character. Following this, she costarred in the 2009 Woody Allen comedy “Whatever Works.” Her subsequent credits were “The Conspirator,” “The Ides of March,” “Charlie Countryman,” “A Case of You,” and “Barefoot.” In 2015, Wood starred in the apocalyptic drama “Into the Forest,” and lent her voice to the animated jukebox musical “Strange Magic.” A few years later, she voiced the character Queen Iduna in the Disney animated sequel “Frozen II.” Wood’s other credits have included the psychological thriller “Allure,” the crime dramedy “Kajillionaire,” and the romantic musical “Viena and the Fantomes.”\n\nTelevision Career\n\nIn between roles in the television films “Get to the Heart: The Barbara Mandrell Story” and “Down Will Come Baby” in the late 90s, Wood appeared in six episodes of the crime drama series “Profiler.” She had her breakthrough television role in 1999, when she began playing the main character of Jessie Sammler on the ABC series “Once and Again.” The show ran for three seasons through 2002. During this time, Wood appeared in episodes of “Touched by an Angel” and “The West Wing.” Later, from 2009 to 2011, she played the recurring role of Sophie-Anne Leclerq in the second and third seasons of the HBO fantasy horror series “True Blood.” Also in 2011, Wood gave one of her most acclaimed performances in the miniseries adaptation of “Mildred Pierce”; for her performance as eldest daughter Veda Pierce, she received an Emmy Award nomination for Outstanding Supporting Actress in a Miniseries or Movie.\n\nIn 2013, Wood lent her voice to characters on the stop-motion sketch comedy series “Robot Chicken.” Two years later, she had a recurring role on the British comedy series “Doll & Em.” Wood landed one of her biggest television roles yet in 2016, when she began playing sentient android Dolores Abernathy on the HBO science-fiction Western series “Westworld.”\n\nWestworld salary\n\nIn 2018, Evan Rachel Wood began earning $250,000 per episode of Westworld. In a 10-episode season, that works out to $2.5 million per season.\n\nMusic Career\n\nAs a musical artist, Wood sang “I’d Have You Anytime” on the fourth CD of the Amnesty International benefit album “Chimes of Freedom.” From 2016 to 2017, she performed alongside Zach Villa as part of the electro-pop duo Rebel and a Basketcase. Subsequently, in 2018, she formed the cover band Evan + Zane with Zane Carney. The next year, Wood appeared on the Billboard Hot 100 with the song “Show Yourself,” a duet with Idina Menzel from the soundtrack to “Frozen II.”\n\nPersonal Life and Activism\n\nIn 2005, Wood dated actor Jamie Bell. She subsequently dated musician Marilyn Manson, to whom she got engaged in 2010; however, they ended their relationship before getting married. In 2011, Wood came out as bisexual, and rekindled her relationship with Bell. The two got betrothed in 2012, and had a son in 2013 before separating in 2014. Wood was next in a relationship with Zach Villa; they got engaged in early 2017 before calling it off later in the year.\n\nWood revealed to a Rolling Stone reporter in 2016 that she had been raped twice in the past. In 2018, she testified before the United States House Judiciary Subcommittee on Crime, Terrorism, Homeland Security and Investigations to promote the Sexual Assault Survivors’ Bill of Rights Act. The next year, Wood testified before the California Senate to help pass the Phoenix Act, which extends the statute of limitations in cases of domestic violence. Later, in 2021, Wood revealed that one of her abusers was Marilyn Manson."}, {"url": "https://greatpeoplebios.com/wiki/evan-rachel-wood/", "page_content": "Evan Rachel Wood is a American Actress who was born on September 07, 1987 in Raleigh, North Carolina, U.S.. As of 2023, the age of Evan is 36. The Actress has accumulated a solid net worth of $8 million with perseverance and determination.\n\nGeneral Wiki of Evan Rachel Wood Full Name Evan Rachel Wood Age 36 Birth Date September 07, 1987 Net Worth $8 million Height 5 feet 7 inches (1.70m) Weight 54 Kg Birth Place Raleigh, North Carolina, U.S. Education Cary Elementary School Nationality American Profession Actress, Musician Ethnicity English, Irish, Scottish, German Father Name Ira David Wood III Mother Name Sara Lynn Moore Hair Color Golden Brown Eye Color Blue Waist Size 26 inch Bra Size 34 inch Hip Size 34 inch Lucky Number 5 Lucky Color Green Lucky Stone Sapphire Horoscope Virgo Best Match For Marriage Taurus, Capricorn Twitter Profile twitter Instagram Profile instagram Wikipedia Profile wikipedia Imdb Profile imdb\n\nEvan Rachel Wood Age, Wiki/Biography\n\nEvan Rachel Wood was born on September 07, 1987 inside Raleigh, North Carolina, U.S. to Ira David Wood III(dad) and Sara Lynn Moore(mom) along with no one. As of 2023, the age of Evan is 36 years .\n\nHow tall is Evan Rachel Wood?\n\nEvan Rachel Wood is 5 feet 7 inches (1.70m) tall and weighs around 54 Kg. The eye color is Blue and hair color is Golden Brown.\n\nEvan Rachel Wood Net Worth\n\nEvan Rachel Wood's net worth is around $8 million with some more assets. The Actress, Musician has accumulated the wealth with lots of hard work and dedication towards work. However, this is just an estimation, the actual net worth might be more or less than that.\n\nActiveness on Social Media\n\nEvan is active on the following social media whose links are active as instagram, twitter, imdb, wikipedia, tiktok , and on other platforms ."}, {"url": "https://hamariweb.com/profiles/evan-rachel-wood_3514", "page_content": "If you want to add or update any information to it, please contact us.\n\nQ. What is the age of Evan Rachel Wood?\n\nEvan Rachel Wood age is 36 Years, her date of birth Monday, Sep 07, 1987, horoscope (will update soon), place of birth Raleigh, North Carolina, United States, nationality as (will update soon) and residence (will update soon).\n\nQ. What is the Profession of Evan Rachel Wood?\n\nEvan Rachel Wood is an (will update soon) Actress, musician, and model by profession.\n\nQ. Who is Evan Rachel Wood's husband?\n\nEvan Rachel Wood husband or spouse name is Jamie BellÂ (m. 2012â€“2014).\n\nQ. Who is Evan Rachel Wood's Parents?\n\nEvan Rachel Wood father name is (will update soon) and mother name (will update soon).\n\nQ. Who is Evan Rachel Wood's siblings?\n\nEvan Rachel Wood siblings name is (will update soon).\n\nQ. What is the net worth of Evan Rachel Wood?\n\nEvan Rachel Wood net worth is (will update soon).\n\nQ. What is the education of Evan Rachel Wood?\n\nEvan Rachel Wood education is (will update soon).\n\nQ. What is the height and weight of Evan Rachel Wood?\n\nEvan Rachel Wood height is (will update soon) and weight (will update soon).\n\nQ. What is the name meaning of Evan Rachel Wood?\n\nEvan Name meaning is A form of john and Rachel Name Meaning Lamb Female Gental.."}, {"url": "https://marriedbiography.com/evan-rachel-wood-biography/", "page_content": "Then In January 2017, Wood got engaged to her Rebel and a Basketcase bandmate, Zack Villa . However, this affair also ended after one month of engagement.\n\nShe had a home birth with her son, and publicly thanked Ricki Lake, creator of the documentary The Business of Being Borin, for Inspiring her decision. In May 2014, Wood and Bell announced that they had separated after 19 months of Marriage.\n\nIn the summer of 2011, Wood was reported to have rekindled her relationship with Jamie Bell , five years later they first broke up. Shortly after Wood disclosed that she was bisexual via twitter. Evan Rachel Wood and Bell were married in a small ceremony on October 30, 2012. They have one son named Jack born in July 2013.\n\nThe couple split in November 2008; according to Wood, they “both decided to take some time apart so ‘they’ could concentrate on their work”. They later reunited and it was reported in early Januar 2010 that the couple was engaged to be married.\n\nThen in January 2007, Wood’s relationship with Marilyn Manson became public. The two met at a party at the Chateau Marmont Hotel. She has stated that she was attracted to Manson’s frequent use of black eyeliner and once described their relationship as “healthy and loving”.\n\nAfter a year togetherness, the relationship ended in 2006. Wood later commented that “We had matching tattoos because we knew our love would last forever. Trouble is, it didn’t, things happened, we split. But I don’t regret the tattoo. It reminds me of a great, great period in my life”.\n\nThey got matching tattoos each other’s initials; in Wood’s case, a “J” on her left ankle.\n\nShe was dating British actor Jamie Bell in 2005 after they co-starred in the music video for Green Day’s song “Wake Me Up When September Ends”.\n\nWho is Evan Rachel Wood?\n\nEvan Rachel Wood is an American actress and musician. Her breakout role in the film ‘Thirteen’ led to other notable projects such as ‘The Wrestler’, ‘Mildred Pierce’, and ‘Westworld’.\n\nWho are the parents of Evan Rachel Wood?\n\nEvan was born on September 7, 1987, in Raleigh, North Carolina, the U.S. Her mother, Sara Lynn Moore is an actress, director, and acting coach, and has converted to Judaism.\n\nHer father, Ira David Wood III, is a locally prominent actor, singer, theater director, playwright.\n\nHis father is from a Christian family and he is also the Executive Director of a local regional theater company called Theatre in the Park. Wood has a brother, Ira David Wood IV, who is also an actor.\n\nShe has two other brothers, Dana Thomas, and a sister named Aden. Her paternal aunt, Carol Winstead Wood, was a Hollywood production designer.\n\nBeing raised in a filmy background, he and his brother went to Theatre in the Park. She made an appearance in the 1987 production of her father’s musical comedy adaptation of A Christmas Carol when she was just a few months old.\n\nSubsequently, she played the Ghost Christmas Past in several productions at the theater, and she later starred as Helen Keller alongside her mother (who played Anne Sullivan) in a production of The Miracle Worker, under her father’s direction. Wood’s parents separated in 1996 and later divorced, and Wood moved to her mother’s native Los Angeles County, California.\n\nEvan attended Cary Elementary, a public school in Cary, North Carolina. She was subsequently home-schooled and received her high school diploma at age 15.\n\nEvan Rachel Wood: Career, Salary, Net Worth\n\nTalking about Evan’s career, she began acting at the age of seven. She was cast in ‘Once and Again’ as Jessie Sammler. She played a young girl befriending a mentally ill man in ‘Digging to China’ starring Kevin Bacon and Mary Stuart Masterson. It was the ‘Children’s Jury Award’ at the Chicago International Children’s Film Festival’.\n\nIn 1998, Evan Rachel Wood was cast in the fantasy film ‘Practical Magic’ directed by Griffin Dunne, as the niece of the sisters portrayed by Sandra Bullock and Nicole Kidman. Then in 2002, she won a lead role in ‘little Secrets’ as Emily Lindstrom, an aspiring concert violinist. She won a nomination for ‘Best Leading Young Actress’ at the ‘Young Artist Awards’.\n\nEvan Rachel Wood acted opposite Cate Blanchett and Tommy Lee Jones in ‘The Missing’, as their kidnapped daughter in 2003. She also acted in the ‘Got Murder?’ an episode of the TV series ‘CSI: Crime Scene Investigation’. IN 2005, she appeared as a narrator in the film ‘The Upside of Anger’, and played Lavender Wolfmeyer, one of four sisters coming to terms with their missing father, starring Kevin Costner and Joan Allen.\n\nWood also played the estranged daughter of Randy “Ram” Robinson in 2008 released ‘The Wrestler’, which was directed by Darren Aronofsky. The movie won the ‘Golden Lion Award’ for Best Film at the ‘Venice Film Festival’. In 2009, she played Melodie opposite Larry David Woody Allen’s ‘Whatever Works’. She played Juliet in a fundraising production of William Shakespeare’s ‘Romeo and Juliet’ directed by her brother.\n\nFrom 2009 to 2011, she played the recurring role of Sophie-Anne Leclerq in the HBO series, ‘True Blood’. In ‘The Conspirator’, she played Anna Surratt. She also acted in ‘The Idles of March’. IN ‘Mildred Pierce’, the 2011 HBO miniseries, she portrayed the title character’s daughter Veda Pierce. She was nominated for the ‘Primetime Emmy Award for Outstanding Supporting Actor in a Miniseries or a Movie’.\n\nSome of Wood’s Major Works, Wood’s 2003 role in ‘thirteen’ as Tracy Freeland caught in the web of drugs, sex, and crime, won her nominations for a ‘Golden Globe Award’ and a ‘Screen Actors Guild Award’ for ‘Best Actress’. IN ‘Pretty Persuasion’, she played Kimberly Joyce, a crafty, sexually precocious high school student.\n\nAwards & Achievements\n\nIn 2006, Wood acted in the Golden Globe-nominated biopic on Augusten Burrough’s ‘Running with Scissors’ as Natalie Finch. She was awarded the ‘Cannes Film Festival Chopard Trophy for Female Revelation’ for her performance.\n\nWood also voiced the character Mala in the 2008 sci-fi animation ‘Battle for Terra’, a Grand Prize winner at the ‘Ottawa International Animation Festival’. Wood was a ‘Midnight Award’ at the ‘San Francisco International Film Festival’.\n\nWhat is Evan Rachel Wood’s net worth?\n\nThis actress has an estimated net worth of $8 million. But her salary and other incomes are not revealed.\n\nEvan Rachel Wood: Rumors and Controversy\n\n“Westworld’ actress Wood says that she was raped: ‘I am Strong, but I am still not okay.\n\nHence, Wood revealed that she had been raped twice in her life and said both assaults continue to affect her years later.\n\nBody Measurements: Height, Weight\n\nEvan Rachel Wood is very active and loves cardio exercises such as jogging, running, swimming, biking, and loves taking long walks.\n\nWood enjoys feeling energized with her workouts and also loves practicing yoga. Wood’s measured height is 5 feet 7 inches and weighs 54 kg.\n\nHer body measurement is 34-26-34 inches which is just the perfect body a woman can have. She has golden brown hair color and blue eye color.\n\nSocial Media Profile\n\nShe is active on social media sites like Facebook, Instagram, and Twitter. She has around 94.5k followers on Facebook, She has more than 444.7k followers on Twitter and has around 827k followers on Instagram.\n\nKnow more about Maureen Van Zandt, Jodelle Ferland, and Brandi Cyrus."}, {"url": "https://latestinbollywood.com/evan-rachel-wood-wiki/", "page_content": "Evan Rachel Wood Wiki:- Evan Rachel Wood is an American actress, musician, and model.\n\nEvan is the nominee of a Critics’ Choice Television Award as well as three Primetime Emmy Award nominations and three Golden Globe Award nominations for her efforts in film and television.\n\nHere you knew all the details of Evan Rachel Wood Wiki, Biography, ethnicity, Boyfriend, Age, Date of Birth, Religion, Partner, Parents, Height, Weight, Children, Career, Nationality, Zodiac Sign, Facebook, Instagram, Twitter, Profession, Earning Source, Education, Religion, Caste, House, Residence, Birthplace, Net Worth & More.\n\nEvan Rachel Wood Wiki, Age, Biography\n\nEvan Rachel Wood took birth to her parents on 7 September 1987. She took birth at her parents home in Raleigh, North Carolina. She was brought up in Los Angles County, California. She completed her education at home school and received her high school diploma at age 15.\n\nWood was rewarded a black belt in taekwondo when she was 12 years old.\n\nIn this blog, you read all the details of the Evan Rachel Wood Wiki, Biography, Age, Parents, Ethnicity, Boyfriend, Career, Net Worth & More.\n\nReal/Full Name Evan Rachel Wood Famous For American actress, musician Nick Name Evan Age 34 years Date Of Birth/Birthday 7 September 1987 Religion/Caste Christianity Zodiac/Sun Sign Virgo Nationality American Birth Place Raleigh, North Carolina Residence Los Angles Marital Status Divorced Partner Zach Villa Children 1 School Name Home School Higher Education Private University\n\nEvan Rachel Wood Age, Biography\n\nAs Evan was born in 1987 her age is 34 right now. As her birthday falls in September her zodiac sign is Virgo. She follows the religious belief in Jewish.\n\nEvan Rachel Wood Parents (Father, Mother), Siblings\n\nEvan Rachel Wood’s mother name is Sara Lynn Moore. Her father name is Ira David Wood 3. Her mother is a famous actress, director, and acting coach.\n\nHer father is a renowned actor, singer, theatre director, and playwright from a Christian family. He is also the executive director of a local community theatre company called Theatre in the Park\n\nEvan Rachel Wood Ethnicity, Nationality\n\nEvan Rachel Wood‘s ethnicity is Jewish. She holds American Nationality\n\nEvan Rachel Wood Boyfriend\n\nEvan Rachel Wood is currently single. She was married to Jamie Bell in 2012 and got divorced in 2014. Before marrying Jamie, she was engaged to Marilyn Manson(2006-10). She was also the partner of Zach Villa(2015-17)\n\nEvan Rachel Wood Height, Weight\n\nEvan Rachel Wood’s height is 5 feet 7 inches and her weight is 56 kg.\n\nEvan Rachel Wood Career\n\nEvan Rachel Wood began her acting career in the 1990s, appearing in many television series, including American Gothic (1995–96) and Once and Again (1999–2002).\n\nEvan earned her debut as a leading film actress at the age of nine in Digging to China (1997).\n\n\n\nShe resumed acting primarily in independent films, including Pretty Persuasion (2005), Down in the Valley (2005), Running with Scissors (2006), and Across the Universe (2007).\n\nWood has occurred in more mainstream films, including The Wrestler (2008), Whatever Works (2009), and The Ides of March (2011) since 2008.\n\n\n\nShe was nominated for Golden Globe for her role as the troubled teenager Tracy Freeland in the teen drama film Thirteen (2003).\n\n\n\nShe also expressed the voice of Queen Iduna in the Disney animated fantasy film Frozen II (2019).\n\nView this post on Instagram A post shared by Evan Rachel Wood (@evanrachelwood)\n\nEvan Rachel Wood Net Worth\n\nNow we are going to about Evan Rachel Wood’s net worth. You all are thinking that when she is well known American actress her net worth revolves around $ 8 million.\n\nRead also: Sondra Theodore Wiki\n\nEvan Rachel Wood Instagram, Twitter, Facebook, Linkedin\n\nInstagram\n\nTwitter\n\nFacebook\n\nLinkedin\n\nYouTube\n\nFAQ About Evan Rachel Wood\n\nQ.1 Who is Evan Rachel Wood?\n\nAns. Evan Rachel Wood is a well known American actress, musician, and model.\n\nQ.2 Who is Evan Rachel Wood’s ex-husband?\n\nAns. Evan Rachel Wood ex-husband name is Jamie Bell.\n\nQ.3 Who is Evan Rachel Wood’s Boyfriend?\n\nAns. Evan Rachel Wood is currently single.\n\nQ.4 What is Evan Rachel Wood’s Age?\n\nAns. Evan Rachel Wood’s age is 34 years old.\n\nQ.5 What is Evan Rachel Wood’s Nationality?\n\n\n\nAns. Evan Rachel Wood holds American Nationality\n\nQ.6 Evan Rachel Wood Born?\n\nAns. Evan Rachel Wood’s birthplace is Raleigh, North Carolina."}]}