{"The film Catch Me If You Can was directed by Steven Spielberg.": [{"url": "https://simple.wikipedia.org/wiki/Catch_Me_If_You_Can_(movie)", "page_content": "Catch Me If You Can is a 2002 American biographical crime drama movie. It stars Leonardo DiCaprio and Tom Hanks. The movie was directed by Steven Spielberg. It is based on the 1980 book by Frank Abagnale.\n\nCatch Me if You Can is set in 1963. Frank Abagnale is played by Leonardo DiCaprio. Frank is sixteen years old. Carl Hanratty is played by Tom Hanks. Carl is an FBI investigator. When Frank's parents get divorced, Frank decides to leave his house and to change his name. He buys a pilot uniform and forges (makes a fake copy of) a pilot licence. He travels with PanAm airlines to many countries. He pays with forged cheques in the USA.\n\nThen Frank decides to work as a doctor. He again forges the documents. In the hospital he meets a girl named Brenda Strong. He begins working as a lawyer, so that he can marry Brenda. Brenda's father, Roger Strong is also a lawyer. Now Frank has had 3 jobs, under 3 different names; Frank Abagnale Jr, Frank Taylor and Frank Connors. Carl Hanratty is at the engagement party. Carl reveals to the girls' father who Frank is. In the meantime, Frank tells his fiancé, Brenda the truth about his life and what he has done. Carl searches the house, but Frank has already left. Frank escapes and moves to Mont-de Marson, France where he tries to escape. Carl Hanratty finds him and convinces Frank to come quietly to face his crime. Frank goes quietly with Carl. When Frank leaves jail, he works with Carl Hanratty, helping Carl to catch criminals who forge cheques and other documents.\n\nOther websites [ change | change source ]\n\n\n\n"}, {"url": "https://decider.com/2021/01/06/catch-me-if-you-can-true-story/", "page_content": "Catch Me if You Can is just one of the noteworthy films new on Netflix this month, and the 2002 drama is already picking up renewed interest thanks to its turn on the streaming platform. Directed by Steven Spielberg, Catch Me If You Can tells the story of Frank Abagnale Jr. (Leonardo DiCaprio), a teenage con-man who posed in multiple different occupations and became one of the country’s most notorious bank robbers at just 17 years old.\n\nWhile he’s continuing his crime spree, Frank catches the attention of the FBI, specifically FBI Agent Carl Hanratty (Tom Hanks), who dedicates his work to tracking down the teenage felon and capturing him for good. While Carl is a determined and skilled agent, Frank’s wits keep putting him just out of the FBI’s grasp.\n\nIt’s a pretty wild story and a captivating watch, but is a Catch Me If You Can really a true story? Here’s everything you need to know.\n\nIS CATCH ME IF YOU CAN A TRUE STORY?\n\nYes, Catch Me if You Can is actually inspired by a real story. The film is based on the life of Frank Abagnale, a man who really did make history as one of the best con artists in modern history. When Abagnale published a memoir about his life in 1980, Spielberg’s DreamWorks bought the rights to the book and later turned it into a movie. Just like in Catch Me If You Can, Abagnale really did pose under multiple identities, including a Pan American World Airways pilot, a Georgia doctor and a Louisiana parish prosecutor, just to name a few.\n\nBut according to Screen Rant, not every detail in Catch Me If You Can sticks to history. For example, Carl Hanratty’s character was fictional. While the FBI did get on Frank’s case, there were multiple agents working to catch him, rather than one single dedicated sleuth.\n\nNow, Abagnale has a very different career from what’s portrayed in Catch Me If You Can. According to CNBC, the former con-man now works as a private consultant, author and public speaker who focuses on fraud prevention.\n\nWHO IS IN THE CATCH ME IF YOU CAN CAST?\n\nCatch Me If You Can stars plenty of A-list talent. Aside from DiCaprio and Hanks, the film’s cast includes Christopher Walken, Martin Sheen, Nathalie Baye, Amy Adams, James Brolin, Nancy Lenehan, Thomas Kopache, Candice Azzara, and Malachi Throne.\n\nWHERE CAN I WATCH CATCH ME IF YOU CAN?\n\nRight now, you’ll find Catch Me If You Can on Netflix, but you can also watch the movie on VOD through Prime Video, Vudu, YouTube, Google Play, and the Microsoft Store. Catch Me If You Can is available to rent for $2.99 to $3.99, or buy for $13.99.\n\nOTHER MOVIES LIKE CATCH ME IF YOU CAN:\n\nIf you’ve already seen Catch Me If You Can and you’re looking for something similar, you’ve got options. We recommend you turn to The Big Short or American Hustle, or watch The Departed next if you’re looking for another DiCaprio crime movie.\n\nWhere to watch Catch Me If You Can"}, {"url": "https://amblin.com/movie/catch-me-if-you-can/", "page_content": "Leonardo DiCaprio and Tom Hanks engage in a game of cat and mouse in Catch Me If You Can, under the direction of Steven Spielberg.\n\nFrank W. Abagnale (DiCaprio) worked as a doctor, a lawyer and as a co-pilot for a major airline-all before his 21st birthday. A master of deception, he was also a brilliant forger, whose skill at check fraud had netted him millions of dollars in stolen funds. FBI Agent Carl Hanratty (Hanks) had made it his prime mission to capture Frank and bring him to justice, but Frank is always one step ahead of him, baiting him to continue the chase.\n\nCatch Me If You Can also stars Christopher Walken, Martin Sheen, Nathalie Baye, Amy Adams, James Brolin, Brian Howe, Frank John Hughes and Jennifer Garner.\n\nSteven Spielberg directed Catch Me If You Can from a screenplay by Jeff Nathanson, based on the autobiographical book of the same name by Frank W. Abagnale with Stan Redding. The film was produced by Steven Spielberg and Walter F. Parkes, with Barry Kemp, Laurie MacDonald, Michel Shane and Tony Romano executive producing."}, {"url": "https://theasc.com/magazine/jan03/karma/", "page_content": "Janusz Kaminski, ASC and his crack crew reteam with Steven Spielberg on Catch Me If You Can, a breezy caper about a master of disguise and deceit.\n\n\n\nFrom 40 years\u0092 remove, it can seem like almost \"anything went\" back in the 1960s. Sex, drugs and rock \u0092n\u0092 roll were many teenagers\u0092 bread and butter back then, and many graying Boomers can now wax soporific about their long-gone wild years. But even in those heady days, Frank Abagnale Jr.\u0092s exploits turned heads \u0096 the heads of FBI agents, to be precise. Catch Me If You Can, an effervescent holiday thriller directed by Steven Spielberg and photographed by Janusz Kaminski, ASC, is based on Abagnale\u0092s memoir of the same name. Starring Leonardo DiCaprio as Abagnale and Tom Hanks as the FBI agent hot on his trail, the film depicts Abagnale\u0092s teen years, during which he flawlessly impersonates pilots, doctors and attorneys, lives a playboy lifestyle on forged checks, and outmaneuvers the FBI for years before finally getting caught. The project marks a distinct departure for Kaminski and Spielberg, whose past collaborations have focused on grim historical events or sinister sci-fi dystopias. \"Catch Me If You Can deals with serious stuff \u0096 Frank spends the whole movie stealing and breaking laws, but he does it with such charm and panache that you sort of forgive him,\" says Kaminski. \"This movie is pure entertainment, and it\u0092s supposed to make you feel better. We definitely need those kind of movies just as much as we need the serious kind.\" One aspect of the project that was not a departure for Spielberg and Kaminski was the pace at which it was filmed: more than 180 scenes in 53 days, with locations in Los Angeles, New York and Montreal. \"Our pace was standard Steven,\" Kaminski acknowledges. What facilitated that pace was a quick-thinking crew whose key members had collaborated with Kaminski on many other projects. Among them were gaffer David Devlin and camera operator Mitch Dubin; Catch Me If You Can was Devlin\u0092s eighth collaboration with Kaminski and Dubin\u0092s tenth. AC recently interviewed Kaminski, Devlin and Dubin separately about their work on the film. American Cinematographer: Janusz, this is your eighth film with Spielberg. Did it take you into any new territory? Janusz Kaminski: Each movie we do has its own sets of demands and corresponding lighting styles. Steven is evolving from being a classical backlight/warm light director into someone who\u0092s interested in things besides traditional beauty, and I think I play an important role in that. His work with other cinematographers was always sort of the same [because] they were servicing his very traditional aesthetic. I do that, too, but I\u0092m also trying to imprint each movie with my own style, and I hope to slowly change Steven\u0092s ideas about what\u0092s beautiful. This film is less \u0091Spielberg\u0092 than some of his other movies. Steven was very relaxed and interested in working with the actors, and because we were working so fast there was often not enough time to give him a traditional look. There are gorgeously lit scenes in the film, but there are also scenes that, well, just don\u0092t look as good! Once we lit we just had to go with it. I love that method. What kind of visual research did you do during preproduction? Kaminski: I watched two documentaries: Frederick Wiseman\u0092s High School and the Maysles brothers\u0092 Salesman. I watched them not for lighting ideas, because both films are black-and-white, but for the story and characters. I wanted to see what the world was like when Abagnale was operating. High School was useful because it\u0092s all about how awkward kids are, yet how mature they feel compared to the adults around them. And Abagnale\u0092s father, Frank Sr. [played by Christopher Walken], was just like the salesman in Salesman; he lived in a world of pretending, of hoping that the next day would be the one where he\u0092d strike gold. What sort of testing did you do on this project? Kaminski: Leo is 27, and he portrays a character that starts out at age 16, so most of our testing was concerned with how to photograph him to make him look younger. But the way Steven and I work, it\u0092s hard to finesse lighting to accommodate the technical details of an actor\u0092s characterization. To a certain degree, I lit Leo a little bit flatter when Frank was younger and created more textured light when he was older. But we were doing 22 setups every day, plus moves, so there were certain compromises. How did you decide to render the Sixties and Seventies photographically? Kaminski: This movie\u0092s photography is very straightforward. There are no tricks, no major CG work. [Production designer] Jeannine Oppewall found such wonderful locations to dress for very little money, and the wardrobe department created such great costumes, that the period was pretty much set. I didn\u0092t have to enhance anything with special filters. Mitch Dubin: The dressing of the movie \u0096 the great sets, period automobiles and wardrobe, and the fantastic locations Jeannine found \u0096 posed unlimited possibilities for the camera. No matter where you pointed the camera, it was hard not to find a great shot. Kaminski: I would compare the film\u0092s look to a bottle of champagne: when you pour that first glass and hold it up to the light and enjoy that warm glow, you just want to drink it in and get happy. So the lighting style is very warm. When we enter the Seventies, I went for a slightly bluer and pastel-like look, purposefully trying to make the images flatter and uglier. I used low-contrast and fog filters to accomplish that. I also shot [Kodak Vision] 320T [5277] stock, which I\u0092ve never used before because I consider it too flat. I wanted this movie to go in that direction. David Devlin: \u0091Flat\u0092 means different things to different people, though. Janusz is very specific with his sources and their direction, and his idea of flatness doesn\u0092t mean he\u0092s filling in light from every angle. It just means that the source is placed closer to the camera. For example, on some of the close-up work we used the Seven-Minute Drill. [Developed on Amistad, this book-light unit consists of an enclosed source aimed at 12'x12' Ultrabounce, which directs the light through a 12'x12' sheet of 1/2 Soft Frost.] That\u0092s a large source for a close-up light, so it\u0092s rather flat in that regard. [Key grip] Jim Kwiatkowski and I call it \u0091dead light\u0092 because there really isn\u0092t a source to it. To give it a more sparkly look, we sometimes put in a hard source along with the bounced source behind the half Soft Frost; the hard light could be a stop overexposed, and the soft light might be two stops under. When Janusz uses hard light in his sources like that, or one soft source with no fill on the other side, he calls it \u0091flat,\u0092 but it\u0092s actually very rich because you feel the falloff of light on the faces."}, {"url": "https://eduzaurus.com/free-essay-samples/catch-me-if-you-can-by-steven-spielberg-critical-response/", "page_content": "Please note! This essay has been submitted by a student.\n\nCatch Me If You Can is a 2002 movie directed by Steven Spielberg with a nonlinear plot that revolves around Frank Abagnale, played by Leonardo DiCaprio, forging checks and posing as various people in Europe. Abagnale is pursued by Carl Hanratty, an FBI agent until he is finally caught. This film is based on the true story of Frank Abagnale Jr.'s infamous cons occurring in the 1960s. The various scams included impersonating as a doctor, pilot, lawyer, and substitute teacher among other things. This movie is one of my favorites because of the plot but more importantly because it is simply amazing that someone had gotten away with such huge frauds in reality. I agree with film critics who have rated the movie as a success because the plot does not get boring, there is enough comedy and drama to keep it interesting without overshadowing the scams, and because the diegetic film elements pull the audience into sympathizing with the antihero.\n\nEssay due? We'll write it for you! Any subject Min. 3-hour delivery Pay if satisfied Get your price\n\nCatch Me If You Can is a hybrid color film, between a documentary and a narrative, with a screen duration of 141 minutes. Because it is a documentary movie, its mise-en-scene is very crucial. Everything from the characters' costumes to the location and dialogue needs to look like the 1960s since that is the movie's setting. Catch Me If You Can starts in medias res at a French prison in 1969 and then the next scene is a flashback to 1963 where Frank Abagnale is sitting with his parents while his father, Frank William Abagnale Sr. is being recognized during a Rotary International event. Throughout the course of the movie, we see that Frank acts as a substitute teacher for a class he was supposed to be attending. His parents divorce and when Frank runs out of money, he produces fake Pan American payroll checks on a million-dollar scale. The FBI start tracking Frank so Frank pretends he is a U.S. Secret Service agent to avoid being arrested. Throughout the next few years, Frank poses as a doctor and a lawyer, all the while running from place to place to avoid arrest.\n\nCatch Me If You Can has mostly positive reviews from famous film critics. David Edelstein is one of the many critics who is a fan of this movie. Edelstein says the movie overall \"moves nimbly, breathlessly, from incident to incident as if the director himself were staying one step ahead of the law\" (Edelstein, 2002). This is very accurate as the movie never fails to keep the watcher's attention. The constant action of Frank trying to avoid arrest and being alert every minute keeps the audience's attention while the transitions between each scam is effortless. Edelstein further says, \"the story is neither a comedy nor a tragedy - it's arrested halfway between a breezy, finger-popping lark and a tale of woe. It has you giggling all the way through - and feeling simultaneous dread at the certainty of its hero going down\" (Edelstein, 2002). The movie focuses on the scams long enough for the audience to understand the situation but short enough that the audience is still interested. Every time I watch this movie, I feel anxious about the numerous close encounters Frank has with Carl, the FBI agent. A great example of a very close call is when Carl tracks Frank to his hotel room. Frank is in the bathroom and when he comes out and realizes that Carl is an FBI agent, Frank pretends to be a Secret Service agent and, through dialogue, fools Carl into letting him escape. Frank is so witty that he even takes one of the rare evidences Carl had – the machine that Frank used to forge the fake checks.\n\nAnother critic with an overall positive review was James Berardinelli. He says how even though the movie is serious, there are parts of it that are funny. I agree because in certain situations, there is slight humor, such as during dinner. Berardinelli also states, \"the final fifteen minutes are protracted and arguably unnecessary. In his attempts to redeem Frank, Spielberg may go too far and let the movie continue past the point where it begins to run out of steam\" (Berardinelli, 2002). I disagree that the last part of the movie is not important. The last 20 minutes of the movie is when Frank is shown to finally be caught. This is crucial because it actually shows the protagonist being caught, which I would argue is the point where the audience is most sympathetic to Frank. Frank is shown to be exiting the factory with Carl after giving up as he had no other option. Even at this point, the audience still hopes that Frank can escape because he has done it previously numerous times. The audience is not wrong; Frank actually does escape even after being captured at the factory and runs to his mother's house. This is one of the most emotional scenes in the movie for me because as he looks through the glass, he sees his mother and her new husband. He also meets his half-sister who is standing on the other side of the window but is soon caught again by the FBI. It is then shown that Frank is convicted and is frequently visited by Carl who takes Frank's help in order to identify and recognize fraudulent checks. Frank is later released and continues a normal life helping to identify scams involving checks. Without these last crucial fifteen minutes of the movie, we would not know what happened to Frank's mother. The audience would also not know about Frank's life after being captured and arrested because of the scrolling text at the end, which is a nondiegetic film element. Thus, to me, I think the last 15 minutes are arguably important to the movie and far from being unnecessary.\n\nA famous third critic, Roger Ebert, liked the movie but stated, 'this [the movie] is not a major Spielberg film, although it is an effortlessly watchable one\" (Ebert, 2002). Though some of Spielberg's other movies may be more famous, such as the Indiana Jones series, in my opinion Catch Me If You Can is still a great movie. As Ebert says, the movie is \"watchable\", and in my opinion, has all the elements that a good movie needs. Its cinematography is good, consisting of various types of camera shots. The overall story and plot are both kept interesting with Frank constantly fleeing to escape capture. There is also an emotional side to the movie in regards to Frank's relationship with his parents.\n\nOverall, I agree with the film critics who have rated the movie as a success. The movie's plot remains interesting throughout the film and humor in the movie does not overshadow Frank's cons. Furthermore, the diegetic film elements pull the audience into sympathizing with the antihero. Catch Me If You Can is rated positively by numerous critics and is one of my favorite movies."}, {"url": "https://thestopbutton.com/2020/01/18/me-if-you-can-catch-yes-hrrrm-2002/", "page_content": "Catch Me If You Can is a spectacular showcase for Leonardo DiCaprio. Unfortunately, the rest of the film doesn’t exactly rise up to meet him, not the filmmaking, not the writing, not his costars. With the exception of co-lead Tom Hanks, who’s a whole other thing, the direction, the writing, the supporting cast, they’re all tied together in a less than impressive knot.\n\nLet’s get the filmmaking out of the way first.\n\nSpielberg’s direction is adequate, at least as far as the composition goes. It’s never too good, it’s never too bad. The film opens with these extremely cute animated opening titles, but they go on way too long and the accompanying John Williams music is some of the film’s least impressive as far as the score goes. And the score’s usually middling so to open on a low point… Not a great start. Then the movie goes into the framing device (getting ahead of myself on the script problems) as FBI agent Hanks is trying to get DiCaprio out of a French prison. There’s something very affected about the style, with Spielberg mimicking late fifties and early sixties style without bringing anything new to it. He and cinematographer Janusz Kaminski don’t show the mid-sixties through rose colored glasses as much as they artificially twinkle the past. Everything shimmers with unreality, which kind of hurts the true story angle as Catch Me rarely shows how DiCaprio is pulling off his cons. Plus the age discrepancies. DiCaprio’s twenty-eight playing seventeen playing twenty-eight. It mostly works, thanks to DiCaprio’s performance but against some of what Spielberg and screenwriter Jeff Nathanson throw at him; there are significant hiccups.\n\nLike Christopher Walken as DiCaprio’s WWII vet dad. Walken’s sixty; he looks pretty good for sixty. But he was supposed to be some kind of forty-year old grunt in WWII? Again, Catch Me’s fast and loose with its hold on reality but given it’s all about the amazing things DiCaprio’s character was actually able to do… not having to constantly suspend and re-suspend disbelief would be nice. Walken’s actually good, even if he’s a stunt cast and his part is so thin he’s just doing a generic Christopher Walken performance. Nathanson doesn’t do character development or texture. Even when the story needs it. Spielberg doesn’t help with it either; it’s DiCaprio’s movie but Spielberg’s more concerned with Hanks’s FBI agent.\n\nLet me just use that to segue into Hanks. Hanks is not good. He does a questionable and pointless accent, presumably to make the character seem less flat, and there’s nothing else to it. First act, it seems like Hanks might go someplace—and the film does try to force him into a paternal relationship with DiCaprio, which doesn’t work—but it’s a nothing part. It’s not even engaging enough to be a caricature. Nathanson’s a shockingly thin writer.\n\nOkay, maybe not shockingly. It’s not like the script’s ever got any more potential than it delivers. But Spielberg really does just go along with it. The female roles are exceptionally thin; they’re all dumb and easy, whether it’s bank teller Elizabeth Banks, flight attendant Ellen Pompeo, working girl Jennifer Garner, or nurse Amy Adams. Worse is when DiCaprio ends up staying longterm with Adams, it’s never clear why; especially since the movie makes fun of her so much. Though, I suppose, even worse is when Adams brings her parents into the film. Martin Sheen—in a stunningly bad bit of stunt-casting—is bad. Nancy Lenehan is mom, with zip to do, which is actually much better for her than, say, Nathalie Baye as DiCaprio’s mom. Baye gets the film’s worst part by far.\n\nThrough it all, DiCaprio manages to keep his head up and keep Catch Me working. He contends with some questionable makeup decisions, never getting to followthrough on set pieces, and the astoundingly bad pop culture reference. There’s a truly incompetent James Bond Goldfinger sequence, which ought to be a gimme but instead Spielberg completely fumbles it.\n\nSpielberg never takes Catch Me If You Can seriously enough, from the casting to the writing to Kaminski’s silly photography. DiCaprio takes it seriously, to good effect. Hanks takes it seriously, to… if not bad effect, at least wanting. It’s a glossy, trite trifle. Could’ve been a lot more.\n\nThough not with the same script, supporting cast, principal crew members, or director."}, {"url": "https://www.theguardian.com/film/2003/feb/02/philipfrench", "page_content": "Catch Me If You Can (140 mins, 12A)\n\nDirected by Steven Spielberg; starring Leonardo DiCaprio, Tom Hanks, Christopher Walken, Nathalie Baye\n\nThe con man isn't unknown in European literature and popular culture - there's Thomas Mann's Felix Krull, Confidence Man, for instance, and the hero's father in John le Carré's A Perfect Spy. But from Herman Melville's The Confidence-Man through Huckleberry Finn to The Sting, he's had a peculiar grip on the American imagination. In the US context, he's as much a chameleon as a charlatan, as much a benefactor as a criminal, and is an extreme case of the fluidity of the national character and the freedom to recreate the self.\n\nI was once escorted around town by the head of an American university department in which I was teaching, and wherever we went - a secondhand car lot, a bank, an insurance office - he'd cast off his academic demeanour and take on the colour of his surroundings, becoming a car salesman, a banker, an insurance broker.\n\nSteven Spielberg's Catch Me If You Can is about this phenomenon, and tells in a lighthearted manner the real-life story of Frank Abagnale Jr (Leonardo DiCaprio), who, as a teenager in the Sixties, led the FBI's fraud squad on a merry dance across the continent and to Europe as he adopted a variety of guises - airline pilot, doctor, lawyer, schoolteacher, federal agent - and forged cheques to amass a $2million fortune, only a small amount of which he actually spent. In the end, so we're told, he turned gamekeeper and was released from a long jail sentence to share his knowledge with the FBI fraud squad.\n\nThe movie establishes its style and is located in its period by beginning with animated credit titles in the flat, hard-edged Sixties style of The Pink Panther, showing men in hats pursuing an elusive quarry. This is followed by a segment of the popular Sixties TV quiz show, To Tell the Truth, in which the panellists have to guess who is real and who are the imposters out of three people dressed as airline pilots and claiming to be Frank Abagnale. This is the programme that gave us the catchphrase 'Will the real whatever-he's-called please stand up'.\n\nLike many Spielberg characters, Frank comes from a broken home. His father (Christopher Walken) is a failed businessman in thrall to middle-class values and the American Dream; his mother (Nathalie Baye), a Frenchwoman he met while serving in the army, wants a life her husband can't provide. From this Frank's identity problems derive, as well as his need for money to pay his way and to impress his father.\n\nHis first impersonation comes when he poses as his father's chauffeur to impress a bank, the second when he moves to a new school and turns the tables on a pair of bullies by posing as a supply teacher, a job he holds for a week. More serious impersonations and four years on, the run begins when he skips his home outside New York rather than commit himself to living with either parent. We are always on his side rather than that of his uptight would-be nemesis, FBI special agent Carl Hanratty, a clever, kindly, serious, and deadly dull man played with droll exasperation by Tom Hanks.\n\nOne reason we are sympathetic towards Frank is because he's such an appealing, vulnerable kid. Another is that he only takes money from large corporations and airlines and works hard doing it. No little people are involved and no one is put in danger. As a doctor and a prosecuting attorney, he draws on behaviour and language he has learnt from watching Dr Kildare and Perry Mason, but he keeps clear of doing more than encouraging the interns under him to act with confidence. In this respect, he's unlike a much more extraordinary real-life con man, Ferdinand Demara, played by Tony Curtis in The Great Impostor , who passed himself off as a prison warden, a Trappist monk, and a naval surgeon performing tricky operations at sea during the Korean War.\n\nCatch Me If You Can is overly complicated in its flashback construction and too long for a movie that scarcely digs at all into its protagonist's character. Did he, for instance, suddenly give up his fantasy life and become a responsible citizen as a result of working for the FBI and becoming a family man? There is also the problem that it's difficult to believe that DiCaprio's Frank Abagnale would fool anyone.\n\nBut still, it's amusing and high spirited, the best line coming from his prospective mother-in-law, a leading New Orleans socialite, when she discovers that he's lied about his religious beliefs, his Harvard medical education and his law degree from Berkeley - 'You mean you're not a Lutheran?'"}, {"url": "https://blackfilm.com/20030103/features/stevenspielberg.shtml", "page_content": "Interviewed by Wilson Morales Catch Me If You Can : An Interview with Steven Spielberg : An Interview with Steven Spielberg It’s not that often when a director has two major films coming out in the same year. Earlier this year, Steven Spielberg directed the sci-fi film MINORITY REPORT that starred Tom Cruise. The film was successful as expected. Spielberg has a flair for futuristic stories. His project is something of a different spin. It’s not a sci-fi, nor does it have a tremendous use of special effects. The film CATCH ME IF YOU CAN is a story about a boy who becomes a man by theft. It’s also his first collaboration with Tom Hanks and Leonardo DiCaprio. In an interview with blackfilm.com, Director Steven Spielberg talks about letting loose and how his own upbringing was a factor on the making of this film.\n\nWM: Was there a sense of \"Hey, I can cut loose\" with this film? SS: I felt I could really let my hair down with this one after I sort of kept it up for so many years. I felt like a relief pitcher, you know? - even if it is the World Series of film. I came in there, I wasn’t offensive, I was open to the story, and I love Frank’s story - I thought it was one of the most amazing stories I’d ever heard and part of the movie a lark because some of his life was a lark, unfortunately at the expense of many others but some of this picture is important to me because it deals with what Frank and I both share which is broken homes. I ran away from home when my parents got divorced; at the same age Frank ran away when his parents got divorced, so I had that in common with him. That’s why I wanted to emphasize in the picture to always remind people that he was doing this for a reason --not just because he could. He was doing this because he was perhaps trying to get his mom and dad back together again. Trying to certainly achieve what his father failed at. It’s like in “Death of a Salesman” if Biff went out and did all the things his father really wanted and failed at it.\n\nWM: Did your parents' divorce make a huge impact in your life? SS: It certainly made me stop trusting permanence. I think all kids when they come from broken homes; don’t trust people as much as those people who come from solid families. So I thought it had a lot of issues growing up, about whom could I trust. And if I like somebody, how long will that relationship last before that breaks up so I think that was mainly the main effect it had on me.\n\nWM: What about your own divorce? SS: It did, but I also felt that happiness - achieving happiness was the most important thing for me at that point in my life And I wasn’t happy. WM: How long were you away? SS: Away - just for a summer. That was the year my parents divorced that I did the second thing - which Frank Abignale Jr. did for 3 years - I ran away to California, and I snuck on the Universal Studios lot dressed as an executive. So I think the divorce my parents empowered me to risk imprisonment for trespassing and being an imposter and so once again when I read the script and the book I said I had one moment in my life where I did what he did. And that was it because I so wanted to be a director - the passion led me to break the law. I was there for 3 months. My whole summer vacation. Mainly I couldn’t get on movie sets because they had a closed set - they had a guard out there. I got on every TV show, I watched Leave it To Beaver and I met editors. Tony Martinelli, the editor of Wagon Train, told me how to cut film. I sat with Ronnie Pierce, the head dubber and watched the dubbing on the Ross Hunter film Send Me No Flowers; and basically I made it the University at Universal in the sense that this was my first film school.\n\nWM: Can you talk about the dedication of the film to Bruce Paltrow? SS: Bruce was my closest friend for 30 years. He gave my wife away at our wedding, walked her up the aisle. I met him when his wife Blythe was 8 months pregnant with Gwyneth so I’ve known Gweneth and Jake all my life and all their lives and he was one of my closest friends and one of my wife’s closest friends. He directed my wife in “A Little Sex” and he was the one who told her she should marry me and I should marry her.\n\nWM: Is it amazing to you that Frank almost got away with it? SS: Getting out of the Miami International Airport with a 120 FBI agents scouring that one venue--that was the straw that broke the camel’s back. And when I read that I said ˜Aw. Man if that’s true, I gotta make this picture."}, {"url": "https://www.ranker.com/list/catch-me-if-you-can-behind-the-scenes/mike-mcgranaghan", "page_content": "The life story of Frank Abagnale is fascinating. Suitably, so are Catch Me If You Can's making-of stories. Directed by Steven Spielberg, the 2002 film about Abagnale brought together Leonardo DiCaprio and Tom Hanks for a rousing comedic adventure full of hard-to-believe twists. The picture was a blockbuster, earning $164 million domestically. In the time since its release, it has become widely regarded as a modern classic.\n\nDiCaprio plays Abagnale, who, as a young man, went on an unbelievable streak of scams. Among other things, he pretended to be a doctor and ended up becoming the chief resident pediatrician at a hospital in Georgia. He also passed himself off as an airline pilot, helping to fly planes despite the fact that he knew nothing about aviation. Hanks, meanwhile, is Carl Hanratty, the FBI agent hot on Abagnale's trail. Hanks's character is based on Joseph Shea, the man who apprehended and then befriended Abagnale in real life.\n\nCatch Me If You Can's behind-the-scenes stories reveal some of the challenges of bringing a true story to the screen. Certain facts were fudged, while minor details were re-created with precision. Different actors came and went. Spielberg mined his own past to help tell the tale. Those are just a few examples; this list will break down everything you need to know."}, {"url": "https://www.themanual.com/culture/best-steven-spielberg-movies/", "page_content": "“I don’t dream at night, I dream at day, I dream all day; I’m dreaming for a living.” — Steven Spielberg\n\nThere are certain people who are instantly tied to their profession when you hear their name. When you think about your favorite memories at the cinema, Steven Spielberg is as synonymous with success as Michael Jordan is with basketball. The visionary director of such classics as Jaws, Indiana Jones, and E.T., Spielberg is quite possibly the most popular and influential filmmaker since the dawn of contemporary American cinema.\n\nBorn in 1946, Spielberg was always fascinated by cinema and the magic it creates. From a very young age, he was creating short films and imagining grand set designs for his ideas. In 1969, he got his first real chance with a seven-year contract as a director, and he was the youngest director to be signed to a major Hollywood company. Due to his dedication and hard work, Spielberg rose to national acclaim just eight years later with the release of Jaws.\n\nRecommended Videos\n\nBeing so popular and successful comes a long way, but it helps to have the assistance of so many other talents on your side. Spielberg has worked with many who made his film resume that much stronger, some of which include George Lucas, Richard Dreyfuss, Kathleen Kennedy, Tom Hanks, Harrison Ford, and most notably, composer John Williams.\n\nSpielberg and Williams have worked together in 27 films over 40 years — Spielberg stating that Williams has been “… {B}reathing life into every movie we have made.” The two have always worked together to create movie magic for decades, sharing a vision and seeing it through to the sometimes bitter end. For Spielberg, one is not without the other, as Spielberg once said, “… if movies are like lightning, then the musical score for me is like thunder. It can shake things up for years.” Due to this, I had to dedicate this to Williams as well.\n\nSo now, without further ado, let’s rank the top 10 Steven Spielberg movies and show you his directorial history.\n\n10. Close Encounters of the Third Kind (1977) 90 % 7.6/10 pg 137m Genre Science Fiction, Drama Stars Richard Dreyfuss, François Truffaut, Teri Garr Directed by Steven Spielberg watch on Amazon watch on Amazon Following his big Hollywood release of Jaws, Spielberg set his sights on space. Inspired by actual UFO research over the years, Close Encounters of the Third Kind is a sci-fi fantasy that brings the myth to life in a fantastic way. When Roy Neary (Richard Dreyfuss) witnesses a UFO, he is struck with a mental image of a large pillar that he can’t shake, driving him to alienate his family and his neighbors. Like other directors of his time — George Lucas, James Cameron, Ridley Scott — Spielberg dreamed of making his galactic fantasy come true and being able to show it to others. With limited technology, these directors’ versions of sci-fi were magical and mysterious concepts that were very difficult to bring to the screen, requiring a vast imagination and meticulous set designs. If anyone could do it, it’s Spielberg. Read less Read more\n\n9. Saving Private Ryan (1998) 91 % 8.6/10 r 169m Genre Drama, History, War Stars Tom Hanks, Tom Sizemore, Edward Burns Directed by Steven Spielberg watch on Amazon watch on Amazon Spielberg, being the creative and ambitious director he is, set his sights on a big-budget war movie that focused on action and the soldiers in it, rather than his other films like Schindler’s List or Empire of the Sun that focused primarily on the impact of war on civilians. Featuring the most jarring opening scene on this list, Saving Private Ryan begins the story on the bloody beaches of Normandy, immediately informing the audience what they are in for. When Captain John Miller (Tom Hanks) is given a mission to relieve a certain Private Ryan (whose 3 brothers had been killed in combat) from duty, he must take his soldiers behind enemy lines and brave the bulk of German forces. A film about war, brotherhood, and the frailty of the soul, this is a great commentary on what effects war can have on a person and what they will do to survive. This movie is an incredible story based on true events and is one of the best war movies of all time Read less Read more\n\n8. Minority Report (2002) 80 % 7.7/10 145m Genre Action, Thriller, Science Fiction, Mystery Stars Tom Cruise, Colin Farrell, Samantha Morton Directed by Steven Spielberg watch on Amazon watch on Amazon Staying in the sci-fi genre, Spielberg teams up with action superstar Tom Cruise for a futuristic action drama that blows audiences away. Set in futuristic 2054 Washington D.C., the police force employs psychic technology to see and stop crime before it even happens. By this time Spielberg has been making cinema magic for almost 20 years, so this sci-fi story with a $100 million budget allowed for much more technological freedom in special effects. As such, the visual effects were astoundingly on point, matching with its theater-shaking sound editing and another epic score from John Williams. Any fan of sci-fi should check this movie out if you also enjoy seeing Tom Cruise kick some ass and do all his own stunts, mixed with the smooth sci-fi visual effects that make it into a spectacle for its time. Read less Read more\n\n7. Catch Me If You Can (2002) 75 % 8.1/10 pg-13 141m Genre Drama, Crime Stars Leonardo DiCaprio, Tom Hanks, Christopher Walken Directed by Steven Spielberg watch on Amazon watch on Amazon Based on the very real exploits of former con-man Frank Abagnale Jr., Catch Me If You Can is a crime drama that details the early life and causes of this mischief. Frank Abagnale Jr. (Leonardo DiCaprio) is neither a doctor, a pilot, nor a lawyer, but it makes the forged checks he cashes all over the country that much more believable. Fun and charming are two words that could be used to describe this film, but the performances are what really make it worthwhile. Featuring Christopher Walken, Tom Hanks, Leonardo DiCaprio, and a slew of young actresses that would later become hugely successful themselves, a great story is always better told by actors who truly believe in it. This is yet another film that features the scoring genius of John Williams, who was nominated for an Academy Award for this film. Read less Read more\n\n6. E.T. the Extra-Terrestrial (1982) 91 % 7.9/10 pg 115m Genre Science Fiction, Adventure, Family, Fantasy Stars Henry Thomas, Drew Barrymore, Robert MacNaughton Directed by Steven Spielberg watch on Amazon watch on Amazon Inspired by touching the surface of galactic sci-fi in Close Encounters, Spielberg dug deeper and decided to create the much more personal and family-oriented film: E.T. The Extra-Terrestrial. When young Elliott (Henry Thomas) discovers an alien in his barn, he decides to shelter it from harm and become friends with it. Utilizing the practical effect of puppeteering, Spielberg and his team created a charmingly strange-looking alien that “…only a mother could love.” Hinging on its performances from young Henry Thomas and a very young Drew Barrymore, this film became an instant family classic for generations to come. As usual, John Williams composed the — this time Oscar-winning — score, one that can be recognized by many to this day. Spielberg has always been a pioneer of genre-mixing, but this instant classic put him in the running for creative and heartfelt films that lasted his lifetime. Read less Read more\n\n5. Indiana Jones and the Last Crusade (1989) 65 % 8.2/10 pg-13 127m Genre Adventure, Action Stars Harrison Ford, Sean Connery, Denholm Elliott Directed by Steven Spielberg watch on Amazon watch on Amazon In the final installment to the epic Lucas/Spielberg trilogy, Indiana Jones and the Last Crusade took everything we know and love about the character and fully fleshed it out. Going back to his roots, Dr. Jones discovers his long-lost father (Sean Connery) is alive and well but has been captured by the Nazis. Fearing for the fate of the world and the sacred nature of archaeology, Indiana must once again beat the fascist forces to another biblical and mythical artifact: The Holy Grail. Some dismiss this film as a simple remake of the original, claiming that the plotline too similarly resembles it and simply adds a big-name actor to spice things up. I wholly disagree. I think the addition of his father is a fantastic way to truly discover the character of the seemingly flawless Indiana Jones, showing that he’s got a real soft spot for his father that could affect his work. Besides all that, this is a wonderful finale — no, I’m not counting Crystal Skull — to the lovable character that became legendary. Read less Read more\n\n4. Jurassic Park (1993) 68 % 8.2/10 pg-13 127m Genre Adventure, Science Fiction Stars Sam Neill, Laura Dern, Jeff Goldblum Directed by Steven Spielberg watch on Amazon watch on Amazon Yet another timeless classic on Spielberg’s resume, Jurassic Park is a sci-fi action-adventure quite unlike any other. When a billionaire developer obsessed with dinosaurs creates an island theme park with real dinosaurs, everything seems to be fine until the power goes out and the dinosaurs escape. Beautiful and wondrous as Close Encounters — in a sense — but thrilling and terrifying as Jaws, this prehistoric thriller sits comfortably in the ranks of box office gold. Reminiscent of Jaws and despite having access to it, Spielberg and his team decided to use very little CGI, relying primarily on clay and fiberglass painted models for a cheaper budget and more practical effect. Many who have seen the film still remember the terrifying image of the T-Rex glaring into the jeep window as the rain runs off its shimmering scales, proving that these effects still hold up to this day. Not surprisingly, John Williams also composed this score that made the images so much more powerful. Read less Read more\n\n3. Schindler's List (1993) 94 % 9/10 r 195m Genre Drama, History, War Stars Liam Neeson, Ben Kingsley, Ralph Fiennes Directed by Steven Spielberg watch on Amazon watch on Amazon In our next film on the list, we take the darkest of turns, detailing the strife and desolation of the Jewish people during the Nazi occupation of Poland. The film focuses on an Industrialist (Liam Neeson) who moves to Krakow to pursue a promising career and begins to witness the extermination of the Jewish people in the city, prompting him to shelter his employees who are targets of the Nazi forces. Produced entirely in black and white (save some selective, symbolic red coloring throughout the film), this historic tragedy is emphasized by the absolute hopelessness communicated through cinematography artistry. Based on a true story, Oskar Schindler is said to have saved the lives of 1,200 Jewish people by employing them in his munitions factories. Winner of 7 Oscars including best score (John Williams), Best Director, and Best Picture, Schindler’s List is easily one of Spielberg’s most powerful and historic films of all time. Read less Read more\n\n2. Jaws (1975) 87 % 8.1/10 pg 124m Genre Horror, Thriller, Adventure Stars Roy Scheider, Richard Dreyfuss, Robert Shaw Directed by Steven Spielberg watch on Amazon watch on Amazon The “first summer blockbuster,” and Spielberg’s initial claim to fame, Jaws is a classic horror film that launched Spielberg’s career to new heights of popularity. When a giant shark terrorizes a small beach town, the responsibility falls on a sheriff, a marine biologist, and an old sailor to hunt and kill the vicious beast. Masterfully making use of cinematography, music, and limited technology, this film changed the landscape of filmmaking forever. As largely anticipated films were typically expected to release around Christmas, this film was released deliberately at the beginning of summer (June 20th) when the audience will be vacationing to their beaches. This plan was conceived after production had been delayed by months upon months. Filming on the water, Spielberg would find, is a much greater feat of patience than anyone had imagined, pushing back the expected release date that was originally during the Christmas season. Despite being the first film to ever top $100 million in the box office, Spielberg would later say that “Jaws should never have been made — it was an impossible effort.” Read less Read more\n\n1. Raiders of the Lost Ark (1981) 85 % 8.4/10 pg 115m Genre Adventure, Action Stars Harrison Ford, Karen Allen, Paul Freeman Directed by Steven Spielberg watch on Amazon watch on Amazon The incredible beginning of the enduring classic, Indiana Jones and the Raiders of the Lost Ark is a film of monumental proportions. Archaeologist Indiana Jones (Harrison Ford) has been hired by the U.S. government to find the mythical Ark of the Covenant, attempting to stop Hitler’s supernatural Nazi forces from recovering it first. Teaming up the efforts of incredible artists like writers George Lucas and Lawrence Kasdan, of course, John Williams behind the music, and Spielberg at the helm, Harrison Ford was the cherry on top to fully realize the fearless, whip-toting crusader. Spielberg later said he had “one of the best times of my life on this picture”, getting to work with the stars and creators behind it. As the next film after Close Encounters of the Third Kind, Spielberg had become a well-known and comfortable director in the film world, allowing him to relax a bit and have fun with his productions. Filming on a tighter-than-expected schedule, one of the best things about this film is how much he and Ford went back and forth changing small things about the plot to save time and money. Most famous of which is the scene where Ford (struggling with dysentery) chose to improvise a tactical fight scene by simply shooting the big bastard. Read less Read more\n\nEditors' Recommendations"}], "Leonardo DiCaprio played Frank Abagnale Jr. in the film Catch Me If You Can.": [{"url": "https://www.esquire.com/entertainment/movies/a36338912/catch-me-if-you-can-frank-abagnale-true-story-lie-con/", "page_content": "Though it might not be as famous as any of the Indiana Jones movies or Jurassic Park or Saving Private Ryan, Catch Me if You Can has always quietly been one of Steven Spielberg's greatest films. In fact, Catch Me if You Can is actually ranked as Spielberg's fourth-best directorial effort on Rotten Tomatoes, above any of his other movies I've mentioned here.\n\nLeonardo DiCaprio stars as real life con man Frank Abagnale Jr., who throughout the '60s and '70s cashed more than $2 million in fake checks and successfully posed as a doctor, a lawyer, a college professor, and a pilot for Pan American airlines. According to Abagnale's own story, he began conning at the age of 15 and was hunted throughout his teenage years by the FBI (Tom Hanks plays the fictional agent Carl Hanratty, loosely based on Joseph Shea who was a friend of Abagnale). The film also shows Abagnale escape twice from the FBI—once from a plane as it was on the runway at JFK and again from a detention center in Atlanta.\n\nThe Greatest Hoax on Earth: Catching Truth, While We Can The Greatest Hoax on Earth: Catching Truth, While We Can $3 at Amazon\n\nIt's an incredible story. But a new book from journalist Alan C. Logan says Abagnale's version of things—and the movie's narrative—might be his greatest con.\n\n\n\nUsing public records and interviews, Logan outlines a very different story in The Greatest Hoax on Earth: Catching Truth, While We Can.\n\n\n\n“What really happened was that, dressed as a TWA (Trans World Airlines) pilot, which he only did for a few weeks, [Abagnale] befriended a flight attendant called Paula Parks,” Logan told WHYY podcast The Pulse. “He followed her all over the Eastern Seaboard, identified her work schedule through deceptive means, and essentially stalked the woman.”\n\nThis is far from the sexy, charming, almost Bond-like version of the story we see in Catch Me If You Can.\n\n\n\n“So Abagnale’s narrative that between the ages of 16 and 20, he was on the run, chased all over the United States and even internationally by the FBI. This is completely fictitious,” Logan told The Pulse. “Public records obtained by me show that he was confined for the most part in prison during those years.”\n\nCatch Me If You Can Catch Me If You Can $15 at Amazon\n\nLogan says that Abagnale started inventing the version of the story we see in Catch Me If You Can after he appeared on the 1977 game show To Tell The Truth (there's a recreation of this episode in the film, even). This led to multiple appearances on television, speaking engagements, a best-selling book, and, of course, the Spielberg film.\n\nBut, hey, maybe conning all of us for nearly half a century into believing he was the world's greatest con man is Abagnale's greatest con.\n\n"}, {"url": "https://www.cinemablend.com/news/2561434/what-the-catch-me-if-you-can-cast-is-doing-now", "page_content": "Telling the incredible true story of Frank Abagnale, a teenager who performs several cons worth millions of dollars, 2002's Catch Me If You Can features an all-star cast, including Leonardo DiCaprio, Tom Hanks, and Christopher Walken, and the skilled hand of Steven Spielberg at the helm. It became one of his splashiest successes in the early 21st century, resulting in over $350 million at the box office, widespread acclaim, and two Oscar nominations for Best Supporting Actor for Walken and Best Score for John Williams, respectively.\n\nNow that it's been nearly 20 years since the film's glitzy premiere, what is the high-profile ensemble working on now? Let's take a look and find out!\n\nLeonardo DiCaprio (Frank Abagnale)\n\nAs Frank Abagnale, our smart and sophisticated teenager who becomes an ace con artist, Leonardo DiCaprio gives one of his best performances in Steven Spielberg's Catch Me If You Can. A bonafide A-list movie star, DiCaprio is an Oscar-winning actor for his lead performance in The Revenant. He's also well-known for his work in Titanic, What's Eating Gilbert Grape, The Departed, Gangs of New York, Romeo + Juliet, The Aviator, Inception, Blood Diamond, The Wolf of Wall Street, The Great Gatsby, and Django Unchained, to name only a few titles.\n\nMost recently, Leonardo DiCaprio starred in Quentin Tarantino's Once Upon A Time... In Hollywood. He also made an uncredited appearance in the mini-series, Grant, where he served as an executive producer. Next, DiCaprio is filming a role in Adam McKay's Don't Look Up. Additionally, he's expected to enter production on Martin Scorsese's Killers of the Flower Moon starting in February 2021. He's also set to produce this new Scorsese joint. Furthermore, outside of acting, DiCaprio is a producer on Atari and several more upcoming movies and shows.\n\nTom Hanks (Carl Hanratty)\n\nPlaying the part of Carl Hanratty, a hard-nosed FBI agent tracking Frank Abagnale's unlawful trial, Tom Hanks played the second lead in 2002's Catch Me If You Can. A two-time Oscar-winning actor for Philadelphia and Forrest Gump, Tom Hanks is unquestionably one of the most famous celebrities on the planet. Some of his most notable credits include (but aren't limited to) the Toy Story movies, Apollo 13, Saving Private Ryan, Big, Splash, Captain Phillips, Cast Away, The Green Mile, The Da Vinci Code, Sleepless in Seattle, You Got Mail, A League of Their Own, Turner & Hooch, The Polar Express, and A Beautiful Day in the Neighborhood. He also wrote, directed, produced, and starred in That Thing You Do! and Larry Crowne.\n\nMost recently, Tom Hanks starred in Greyhound, which he also wrote, and News of the World, which he also produced. Additionally, he made a cameo as himself in Amazon Prime's Borat Subsequent Moviefilm. Next, Hanks stars in BIOS. Currently, he's filming a role in Elvis, and he's set to play Geppetto in Robert Zemeckis' Pinocchio.\n\nChristopher Walken (Frank Abagnale Sr.)\n\nIn the role of Frank Abagnale Sr., Frank Abagnale's father, Christopher Walken gave an Oscar-nominated performance in Catch Me If You Can. Having appeared in over 100 movies and TV programs throughout his extensive career, Walken is best known for his Oscar-winning performance in The Deer Hunter. He's also well-known for his work in Pulp Fiction, Annie Hall, A View to a Kill, Batman Returns, The Dead Zone, The Dogs of War, Vendetta, Seven Psychopaths, The Prophecy, The Jungle Book (2016), Antz, Irreplaceable You, Kangaroo Jack, The Stepford Wives (2004), Balls of Fury, Domino, The Rundown, and Blast from the Past. Additionally, Walken was famously in Fatboy Slim's \"Weapon of Choice\" music video.\n\nMost recently, Christopher Walken was seen in The Jesus Rolls, The War with Grandpa, and Wild Mountain Thyme. Next, the actor stars in Percy. He's also set to frontline AppleTV+'s Severance and Amazon/BBC's The Offenders.\n\nMartin Sheen (Roger Strong)\n\nAs Roger Strong, an attorney and Brenda's father, Martin Sheen plays a notable supporting role in 2002's Catch Me If You Can. Most notable, Sheen is known for his starring roles in Badlands, Apocalypse Now, and The West Wing. His other famous film credits include The Subject Was Roses, The Amazing Spider-Man, Gettysburg, The American President, Spawn, Dead Presidents, The Departed, O, Bobby, The California Kid, Hot Shots! Part Deux, and Catch-22 (1970). Additionally, on television, Sheen was seen in Grace and Frankie, Anger Management, Columbo, Mission: Impossible, The Streets of San Francisco, Tales from the Crypt, and Two and a Half Men.\n\nMost recently, Martin Sheen was seen in The Devil Has a Name. The actor also reprised his role as President Josiah Bartlet for A West Wing Special to Benefit When We All Vote. Next, Sheen will appear in Judas and the Black Messiah, which arrives February 2021 in theaters and HBO Max. He also recently filmed a part in 12 Mighty Orphans. Additionally, he'll be seen in the seventh and final season of Netflix's Grace and Frankie later this year.\n\nNathalie Baye (Paula Abagnale)\n\nPlaying the part of Paula Abagnale, Frank's mother, Natalie Baye had a maternal role in Steven Spielberg's Catch Me If You Can. An actress with more than 80 films on her resume, Baye is best known for her work in Tell No One, Every Man for Himself, Strange Affair, La Balance, The Young Lieutenant, Day for Night, The Assistant (2015), The Mouth Agape, The Ant Bully, Laurence Anyways, Queens of the Ring, It's Only the End of the World, Venus Beauty, and An Affair of Love.\n\nMost recently, Nathalie Baye appeared in the dramedy film, My Best Part. She can also be seen in a recent episode of Call My Agent! Next, Baye stars in Haute Couture and Lui.\n\nAmy Adams (Brenda Strong)\n\nIn the role of Brenda Strong, the daughter of Roger who works at the hospital and eventually earns Frank's affection, Amy Adams found one of her first high-profile parts in Steven Spielberg's Catch Me If You Can. Following this early performance, Adams would go on to become a six-time Oscar-nominated actress for her leading and supporting work in Junebug, Doubt, The Fighter, The Master, American Hustle, and Vice. She's also well-known for Enchanted, Arrival, Julie & Julia, Drop Dead Gorgeous, The Muppets, Nocturnal Animals, Night at the Museum: Battle of the Smithsonian, and Talladega Night: The Ballad of Ricky Bobby, as well as Man of Steel, Batman v Superman: Dawn of Justice, Charlie Wilson's War and HBO's Sharp Objects.\n\nMost recently, Amy Adams starred in Netflix's Hillbilly Elegy this fall. Next, she'll frontline Netflix's The Woman in the Window. Adams will also be seen in Zack Snyder's Justice League and Dear Evan Hansen. Her other upcoming titles include Disenchanted and Nightbitch, as well as the upcoming mini-series, King of America.\n\nJames Brolin (Jack Barnes)\n\nAs Jack Barnes, an associate who has an affair with Frank's mother, James Brolin plays a crucial side character in 2002's Catch Me If You Can. A two-time Golden Glob and Emmy-winning actor, Brolin can be seen in The Amityville Horror (1979), Fantastic Voyage, Westworld (1973), The Car, Pee-Wee's Big Adventure, Traffic, The Master of Disguise, Burlesque, The 33, The Goods: Live Hard, Sell Hard, Ted & Venus, Night of the Juggler, Capricon One, The Boston Strangler, and Gable and Lombard. His television credits include Marcus Welby M.D., Hotel, Pensacola: Wings of Gold, Castle, The Reagans, Life in Pieces, Community, Pysch, Law & Order: SVU, Monk, The West Wing, Batman, and Steel Cowboy. Additionally, Brolin also directed and starred in My Brother's War, I'll Be Home For Christmas, and Royal Hearts.\n\nNext, James Brolin will narrate Netflix's upcoming series, Sweet Tooth.\n\nNancy Lenehan (Carol Strong)\n\nPlaying the part of Carol Strong, Brenda's mother, Nancy Lenehan had a notable supporting role in Catch Me If You Can. Outside of this performance, Lenehan's other notable film credits include Smokey and the Bandit II, She's Having a Baby, Stoogemania, Pleasantville, Beauty Shop, A Better Life and Sex Tape. Additionally, on television, the actress can be seen in People of Earth, Grace Under Fire, My Name Is Earl, Worst Week, Veep, Married to the Kellys, Buffy the Vampire Slayer, ER, Dharma & Greg, Gilmore Girls, Everybody Loves Raymond, That '70s Show, Nip/Tuck, The Middle, The Bernie Mac Show, Ally McBeal, The Golden Girls, and ALF, as well as Newhart, Family Ties, Murphy Brown, Mad About You, Boy Meets World, The Practice, Caroline in the City, and Just Shoot Me!\n\nMost recently, Nancy Lenehan appeared in episodes of CBS's Man with a Plan, NBC's Superstore, ABC's Bless This Mess, and FXX's Cake.\n\nJennifer Garner (Cheryl Ann)\n\nAs Cheryl Ann, a model-callgirl who has an interaction with Frank Jr., Jennifer Garner made a cameo in Steven Spielberg's Catch Me If You Can. Only a year before she appeared in this film, Garner headlined ABC's Alias, for which she won a Golden Globe Award. She's also known for her leading role in 13 Going On 30, as well as her work in Daredevil, Elektra, Juno, Valentine's Day, The Odd Life of Timothy Green, Dallas Buyers Club, Alexander and the Terrible, Horrible, No Good, Very Bad Day, The Invention of Lying, Miracles from Heaven, Love Simon, Catch and Release, Mother's Day, Mr. Magoo, and Peppermint.\n\nMost recently, Jennifer Garner appeared in Quibi's Home Movie: The Princess Bride. Next, Garner stars in Netflix's Yes Day, which she also produced. It premieres on March 12th. Currently, she's filming a role in another Netflix movie, The Adam Project. Garner is also signed on to star in AppleTV+'s mini-series, My Glory Was I Had Such Friends. Additionally, she's expected to frontline the musical comedy, Fantasy Camp.\n\nEllen Pompeo (Marci)\n\nPlaying the part of Marci, Ellen Pompeo found one of her earliest roles in Steven Spielberg's Catch Me If You Can. Shortly following this fim's release, Ellen Pompeo's profile rose when she took on the titular role in ABC's medical drama, Grey's Anatomy. She has appeared in over 360 episodes of the long-running program. Her other TV credits include Law & Order, Strangers with Candy, Friends, Repeat After Me, Doc McStuffins, and Get Real. She was also a judge during the fourth season of RuPaul's Drag Race: All Stars.\n\nAdditionally, Ellen Pompeo can be seen in Old School, Daredevil, Art Heist, Life of the Party (2005), Undermind, Coming Soon, In the Weeds, Mambo Cafe, and Moonlight Mile. She also appeared in deleted scenes for Eternal Sunshine of the Spotless Mind. And the actress can be seen in Taylor Swift's \"Bad Blood\" music video. Presently, Pompeo remains at the forefront of Grey's Anatomy. She also recently played Dr. Meredith Grey in an episode of Station 19.\n\nElizabeth Banks (Lucy)\n\nIn the role of Lucy, Elizabeth Banks plays a brief supporting role as a bank teller in 2002's Catch Me If You Can. Most notably, Banks is known for her work in The Hunger Games movies, the Spider-Man trilogy, Wet Hot American Summer, The 40-Year-Old Virgin, The LEGO Movie (and sequel), Power Rangers (2017), Magic Mike XXL, Role Models, Zack and Miri Make a Porno, Slither, Invincible, Love & Mercy, The Next Three Days, W., and the Pitch Perfect movies. On television, Banks received two Emmy nominations for her recurring role in 30 Rock. She also appeared in Scrubs, Modern Family, Wet Hot American Summer: First Day of Camp, and Wet Hot American Summer: Ten Years Later. Additionally, Banks directed Pitch Perfect 2 and wrote and helmed Charlie's Angels (2019).\n\nCurrently, Elizabeth Banks hosts ABC's game show, Press Your Luck. Most recently, Banks was seen in FX's Miss America. Also, she appeared in Modern Family's series finale. Next, Banks is expected to star in Call Jane. Also, she's soon expected to star in and directThe Invisible Woman for Blumhouse.\n\nYou can stream Catch Me If You Can on Netflix here. You can also stream it on Showtime here and on SundanceNow here."}, {"url": "https://www.grunge.com/666535/the-true-story-that-inspired-catch-me-if-you-can/", "page_content": "The movie \"Catch Me If You Can\" tells the story of a teenage con-man, Frank Abagnale Jr. (played by Leonardo DiCaprio), who runs away to escape a chaotic home life. On his journey, this kid manages to impersonate a pilot, a doctor, and a lawyer, get engaged, and bounce millions of dollars in checks before he turns 21. He is pursued by FBI agent Carl Hanratty (Tom Hanks), who is determined to catch Abagnale before he can do more serious damage. The film did quite well at the box office, raking in $352 million, and was rated highly by both critics and audiences, according to Mental Floss.\n\nThe Steven Spielberg-directed film was not some idea that he cooked up for an excellent movie plot. This story was based on the book of the same name, a memoir written by Frank Abagnale Jr. himself. Yes, he is a real person, and he was a real con-man who was busted by the FBI. The real question is, how many of his criminal escapades are true, and how many are embellishments to help sell a movie and more books?\n\nAccording to Slash Film, the answer is somewhere in the middle. Frank Abagnale Jr. is in fact a real person. He did begin his criminal career at the age of 15, cashing fake checks and impersonating different kinds of people."}, {"url": "https://www.buddytv.com/best-leonardo-dicaprio-movies-ranked/", "page_content": "If you’re a movie enthusiast like me, Leonardo DiCaprio is a name that undoubtedly reverberates within your movie-loving soul.\n\nFrom that unforgettable breakout role in “Titanic” to his killer collaborations with the legendary Martin Scorsese, this guy keeps improving with each passing year.\n\nOver three decades, Leo has graced us with iconic characters and performances that have shaped cinema history.\n\nAnd with a cumulative box office figure of over $2.5 billion, his movies have left audiences completely astounded.\n\nThis feat puts him among the top 50 highest-grossing leading actors of all time.\n\nRanking Leonardo DiCaprio movies is a tough task because, let’s face it, most of them are incomparable.\n\nEach film holds a special place solely because he graces it with his presence.\n\nTo get by that challenge, we decided to go with his top 10 highest-rated, as seen on IMDb.\n\nPrepare for the ultimate cinematic treat with the best Leonardo DiCaprio movies.\n\n10 What’s Eating Gilbert Grape (1993)\n\nIMDb: 7.7/10 244K | Popularity: 1234 | Metascore: 73\n\nGenre: Drama\n\nIn the small Midwestern town of Endora, Gilbert Grape is a young man facing a delicate balancing act.\n\nHe cares for his mentally-disabled younger brother, Arnie, and his morbidly obese mother. Amidst these challenging responsibilities, Gilbert yearns for his own happiness.\n\nIn the remarkable film “What’s Eating Gilbert Grape,” Leonardo DiCaprio delivers an Oscar-rated performance. He was nominated for Best Supporting Actor, and this role stands out in Academy history among an illustrious lineup.\n\nAs Arnie Grape, a character with intellectual disabilities, DiCaprio’s portrayal could have easily aged poorly with hindsight. However, his sensitive and sentimental performance remains timeless.\n\n[ Watch on Cinemax ]\n\n9 Titanic (1997)\n\nIMDb: 7.9/10 1.2M | Popularity: 131 | Metascore: 75\n\nGenres: Drama, Romance\n\nIn the epic tale of “Titanic,” a seventeen-year-old aristocrat unexpectedly falls in love with a compassionate but financially challenged artist aboard the magnificent and ill-fated R.M.S. Titanic.\n\nDiCaprio’s portrayal of Jack in this epic tale is nothing short of mesmerizing.\n\n“Titanic” surpassed all predictions, reigning as the highest-grossing movie for an astounding 12 years. The film and the actor seemed to be destined for each other.\n\nThe romance flick launched DiCaprio into the realm of stardom. With his status as Hollywood’s sweetheart, audiences were irresistibly drawn to his captivating portrayal of Jack on the big screen. His charm in the film is simply jaw-dropping.\n\nHowever, it’s not solely about his charm. The chemistry between DiCaprio and Kate Winslet, who portrays the captivating Rose, is undeniable.\n\nTheir portrayal of a love story amidst the backdrop of a tragic disaster feels remarkably authentic and believable, setting “Titanic” up as one of the best Leonardo DiCaprio movies.\n\n[ Watch on Prime Video ]\n\n8 Blood Diamond (2006)\n\nIMDb: 8/10 564K | Popularity: 1728 | Metascore: 64\n\nGenres: Adventure, Drama, Thriller\n\nIn “Blood Diamond,” Leonardo DiCaprio takes on the role of a rugged smuggler named Danny Archer.\n\nArcher, a fisherman, and a syndicate of businessmen engaged in a high-stakes battle for a priceless diamond.\n\nDiCaprio brings this complex character to life on the screen with his signature intensity and magnetic presence. As Archer, he navigates the treacherous world of diamond smuggling amidst the chaos of the Sierra Leone civil war.\n\nDiCaprio’s portrayal showcases his exceptional range and commitment to his craft. No wonder this film stands tall among the best Leonardo DiCaprio movies.\n\n[ Watch on Prime Video ]\n\n7 The Revenant (2015)\n\nIMDb: 8/10 828K | Popularity: 721 | Metascore: 76\n\nGenres: Action, Adventure, Drama\n\nAlejandro G. Inarritu‘s “The Revenant” is a gorgeously filmed yet brutally raw survival adventure.\n\nThe movie explores the harsh realities of human behavior and the untamed natural world. You’ll witness the characters’ relentless struggle to survive in harsh conditions and the extreme measures they take to endure.\n\nBe prepared to be spellbound by Inarritu’s expert narrative, complemented by breathtaking scenery and unparalleled cinematography by Emmanuel Lubezki.\n\nDiCaprio’s presence fills every frame with intensity, earning him his first Oscar and solidifying his exceptional talent.\n\n“The Revenant” is a testament to DiCaprio’s extraordinary abilities, making it a must-watch in his remarkable filmography.\n\n[ Watch on Prime Video ]\n\n6 Catch Me If You Can (2002)\n\nIMDb: 8.1/10 1M | Popularity: 436 | Top 250: #174 | Metascore: 75\n\nGenres: Biography, Crime, Drama\n\nMeet Frank Abagnale Jr, a remarkable young forger who, at the tender age of 21, skillfully impersonates a doctor, lawyer, and pilot.\n\nAs Frank’s audacious exploits catch the attention of relentless FBI agent Carl, a game of cat and mouse ensues.\n\nRelated: 10 Best Tom Hanks Movies, Ranked by Viewers\n\nThis high-stakes chase will keep you on the edge of your seat as Frank revels in the pursuit and Carl becomes consumed by his quest to apprehend this master of deception.\n\nDiCaprio’s undeniable talent, alongside the incredible performances of the legendary Tom Hanks (Carl Hanratty) and the captivating presence of Christopher Walken (Frank Abagnale), is why this is among the best Leonardo DiCaprio movies.\n\n[ Watch on HBO Max ]\n\n5 Shutter Island (2010)\n\nIMDb: 8.2/10 1.4M | Popularity: 215 | Top 250: #142 | Metascore: 63\n\nGenres: Mystery, Thriller\n\nThe 2010 psychological thriller “Shutter Island” takes you on a gripping journey alongside US marshals Teddy Daniels and Chuck Aule.\n\nSent to a remote island asylum to investigate the baffling disappearance of a patient, Teddy finds himself unraveling a shocking truth about the place.\n\nAs you delve into the story, Teddy and Chuck navigate the spooky corridors of the institution, their curiosity piqued by the ominous atmosphere surrounding them.\n\nAmidst the unsettling environment, Teddy’s instincts lead him down a twisted path. And as he encounters enigmatic characters and uncovers disturbing clues, doubts begin to gnaw at him.\n\nRelated: 18 Best Thriller Movies (Ranked by IMDb Votes)\n\nThe remote island setting amplifies the sense of isolation and tension, heightening the suspense with each passing moment.\n\nAs Teddy’s investigation deepens, he discovers that not everything is as it seems.\n\nThe asylum’s doctors and staff harbor their secrets and Teddy suspects they are involved in a sinister plot far beyond his imagination.\n\nMartin Scorsese directs “Shutter Island,” where Leonardo DiCaprio shines with his exceptional performance. As Teddy Daniels, he mesmerizes, holding your attention and making you feel the intensity.\n\nDiCaprio’s remarkable performance and the masterful storytelling in “Shutter Island” make it undeniably one of the best Leonardo DiCaprio movies.\n\n[ Watch on SHOWTIME ]\n\n4 The Wolf of Wall Street (2013)\n\nIMDb: 8.2/10 1.5M | Popularity: 105 | Top 250: #132 | Metascore: 75\n\nGenres: Biography, Comedy, Crime\n\nYet another standout collaboration between DiCaprio and Martin Scorsese.\n\nLeonardo DiCaprio plays Jordan Belfort, a charismatic and ambitious stockbroker craving wealth and extravagant living.\n\nBased on a true story, the movie takes you on a wild ride as Jordan rises to dizzying heights of success on Wall Street.\n\nRelated: 10 Best Biopics of All Time, Ranked by Viewers\n\nWith his relentless drive and persuasive charm, he builds an empire fueled by unscrupulous tactics and a reckless disregard for the law. But, as they say, “The higher you climb, the harder you fall.” Jordan’s empire captures the attention of the authorities, triggering an intense cat-and-mouse game.\n\nThe FBI closes in, forcing Jordan to confront the consequences of his actions and the destructive nature of his insatiable greed.\n\nThrough the lens of one of the best Leonardo DiCaprio movies, you’ll embark on a thrilling journey of excess and the profound impact it leaves behind.\n\n[ Watch on Prime Video ]\n\n3 Django Unchained (2012)\n\nIMDb: 8.4/10 1.6M | Popularity: 292 | Top 250: #56 | Metascore: 81\n\nGenres: Drama, Western\n\nStep into the wild west alongside the clever Django in the 2012 film “Django Unchained.” Played by Jamie Foxx, Django, a freed slave turned bounty hunter, aims to rescue his wife from Candie’s (DiCaprio) clutches.\n\nTogether with Dr. King Schultz, they infiltrate Candyland, posing as buyers. Tensions rise, and Django risks everything to save his wife.\n\nRelated: 10 Best Westerns of All Time, Ranked by Viewers\n\nThis Quentin Tarantino masterpiece showcases DiCaprio’s talent, making it one of his best movies.\n\nBrace yourself for a thrilling adventure, explosive confrontations, and unforgettable performances.\n\n[ Watch on Tubi ]\n\n2 The Departed (2006)\n\nIMDb: 8.5/10 1.4M | Popularity: 171 | Top 250: #40 | Metascore: 85\n\nGenres: Crime, Drama, Thriller\n\nSet in Boston, the story revolves around two men on opposite sides of the law.\n\nYou meet Billy Costigan, a young police officer assigned to infiltrate an Irish-American gang led by the ruthless Frank Costello.\n\nMeanwhile, Colin Sullivan, a rising star within the police force, has secretly become a mole for Costello.\n\nAs the pressure intensifies, both individuals find themselves caught in a treacherous cat-and-mouse contest. Billy must maintain his cover while trying to gather crucial evidence to bring down Costello and his criminal empire.\n\nRelated: 10 Best Crime Movies of All Time, Ranked by Viewers\n\nAt the same time, Colin works tirelessly to protect his double life, always on guard for any signs of suspicion. The lines between loyalty and betrayal blur further when Billy and Colin discover each other’s true identities. As they maneuver through the risky path, their lives connect, and the stakes rise.\n\nLeonardo DiCaprio shines as Billy Costigan, showcasing his versatility and ability to portray complex characters with depth and authenticity.\n\n[ Watch on HBO Max ]\n\n1 Inception (2010)\n\nIMDb: 8.8/10 2.4M | Popularity: 103 | Top 250: #14 | Metascore: 74\n\nGenres: Action, Adventure, Sci-Fi\n\nTop of this ranking is the thought-provoking sci-fi masterpiece “Inception,” focused on the skilled thief Dom Cobb — played by Leonardo DiCaprio.\n\nDom possesses a unique skill – entering people’s dreams and extracting valuable information.\n\nHe’s considered the best in the business, sought after by powerful individuals for his unparalleled expertise. But now, he faces an unprecedented challenge—to perform the daring act of “inception,” planting an idea in someone’s mind.\n\nRelated: 10 Best Action Movies of All Time, Ranked by Viewers\n\nDom brings together a team of experts, each with unique skills, for this daring mission. As they dive into layers of dreams within dreams, the line between reality and illusion blurs.\n\nThey encounter mind-bending challenges, hostile projections, and an enigmatic figure known as Mal, Dom’s deceased wife, who haunts his subconscious.\n\nChristopher Nolan‘s direction in “Inception” transports you through intricate imaginations, offering a visually stunning and exhilarating rollercoaster experience.\n\nJoin Dom and his team as they navigate a world where dreams can be manipulated, realities can be altered, and the fate of their mission—and their sanity—hangs in the balance.\n\nRanking #9 on our best movies of all time list and #4 on our best action movies of all time, “Inception” is a must-watch for any fan of exciting and engaging storytelling.\n\nIt’s an excellent way to draw the curtains on our countdown of the best Leonardo DiCaprio movies.\n\n[ Watch on Netflix ]"}, {"url": "https://www.theguardian.com/film/2003/feb/02/philipfrench", "page_content": "Catch Me If You Can (140 mins, 12A)\n\nDirected by Steven Spielberg; starring Leonardo DiCaprio, Tom Hanks, Christopher Walken, Nathalie Baye\n\nThe con man isn't unknown in European literature and popular culture - there's Thomas Mann's Felix Krull, Confidence Man, for instance, and the hero's father in John le Carré's A Perfect Spy. But from Herman Melville's The Confidence-Man through Huckleberry Finn to The Sting, he's had a peculiar grip on the American imagination. In the US context, he's as much a chameleon as a charlatan, as much a benefactor as a criminal, and is an extreme case of the fluidity of the national character and the freedom to recreate the self.\n\nI was once escorted around town by the head of an American university department in which I was teaching, and wherever we went - a secondhand car lot, a bank, an insurance office - he'd cast off his academic demeanour and take on the colour of his surroundings, becoming a car salesman, a banker, an insurance broker.\n\nSteven Spielberg's Catch Me If You Can is about this phenomenon, and tells in a lighthearted manner the real-life story of Frank Abagnale Jr (Leonardo DiCaprio), who, as a teenager in the Sixties, led the FBI's fraud squad on a merry dance across the continent and to Europe as he adopted a variety of guises - airline pilot, doctor, lawyer, schoolteacher, federal agent - and forged cheques to amass a $2million fortune, only a small amount of which he actually spent. In the end, so we're told, he turned gamekeeper and was released from a long jail sentence to share his knowledge with the FBI fraud squad.\n\nThe movie establishes its style and is located in its period by beginning with animated credit titles in the flat, hard-edged Sixties style of The Pink Panther, showing men in hats pursuing an elusive quarry. This is followed by a segment of the popular Sixties TV quiz show, To Tell the Truth, in which the panellists have to guess who is real and who are the imposters out of three people dressed as airline pilots and claiming to be Frank Abagnale. This is the programme that gave us the catchphrase 'Will the real whatever-he's-called please stand up'.\n\nLike many Spielberg characters, Frank comes from a broken home. His father (Christopher Walken) is a failed businessman in thrall to middle-class values and the American Dream; his mother (Nathalie Baye), a Frenchwoman he met while serving in the army, wants a life her husband can't provide. From this Frank's identity problems derive, as well as his need for money to pay his way and to impress his father.\n\nHis first impersonation comes when he poses as his father's chauffeur to impress a bank, the second when he moves to a new school and turns the tables on a pair of bullies by posing as a supply teacher, a job he holds for a week. More serious impersonations and four years on, the run begins when he skips his home outside New York rather than commit himself to living with either parent. We are always on his side rather than that of his uptight would-be nemesis, FBI special agent Carl Hanratty, a clever, kindly, serious, and deadly dull man played with droll exasperation by Tom Hanks.\n\nOne reason we are sympathetic towards Frank is because he's such an appealing, vulnerable kid. Another is that he only takes money from large corporations and airlines and works hard doing it. No little people are involved and no one is put in danger. As a doctor and a prosecuting attorney, he draws on behaviour and language he has learnt from watching Dr Kildare and Perry Mason, but he keeps clear of doing more than encouraging the interns under him to act with confidence. In this respect, he's unlike a much more extraordinary real-life con man, Ferdinand Demara, played by Tony Curtis in The Great Impostor , who passed himself off as a prison warden, a Trappist monk, and a naval surgeon performing tricky operations at sea during the Korean War.\n\nCatch Me If You Can is overly complicated in its flashback construction and too long for a movie that scarcely digs at all into its protagonist's character. Did he, for instance, suddenly give up his fantasy life and become a responsible citizen as a result of working for the FBI and becoming a family man? There is also the problem that it's difficult to believe that DiCaprio's Frank Abagnale would fool anyone.\n\nBut still, it's amusing and high spirited, the best line coming from his prospective mother-in-law, a leading New Orleans socialite, when she discovers that he's lied about his religious beliefs, his Harvard medical education and his law degree from Berkeley - 'You mean you're not a Lutheran?'"}, {"url": "https://tvtropes.org/pmwiki/pmwiki.php/Film/CatchMeIfYouCan", "page_content": "http://tvtropes.org/pmwiki/pmwiki.php/Film/CatchMeIfYouCan\n\nCatch Me If You Can is a 2002 Steven Spielberg film based on the 1980 memoir of the teenage con artist Frank Abagnale Jr.\n\nFrank Abagnale Jr. is a teenager in 1960s New York whose humdrum life is disturbed when his father goes bankrupt and his parents divorce. Frank, who has already shown a talent for mimicry, embarks on a new life as a teenaged con artist, passing himself off as an airline pilot, a doctor and a lawyer while he's still too young to drink. It's Based on a True Story, and the real Frank Abagnale Jr. was on hand as a consultant and was enthusiastic about its production.\n\nLeonardo DiCaprio stars as Frank Jr., with Tom Hanks as FBI agent Carl Hanratty, who is chasing Frank, and Christopher Walken as Frank Sr. Amy Adams has one of her first big film roles as Brenda, a young volunteer nurse who gets engaged to Frank. A young Elizabeth Banks appears briefly as a bank clerk who's attracted to Frank.\n\nIn 2009, a musical adaptation of the film premiered in Seattle before debuting in Broadway in 2011. Aaron Tveit and Norbert Leo Butz originated the roles of Frank and Carl.\n\nThis film provides examples of:"}, {"url": "https://movies.stackexchange.com/questions/14307/how-does-frank-pass-the-bar-exam", "page_content": "In the 2002 movie Catch Me If You Can starring Leonardo DiCaprio and Tom Hanks, how does DiCaprio's character Frank Abagnale Jr. pass the Bar Exam with only two weeks of study?\n\nWas he that smart, or is this just adaptation to the script?\n\nKnowing this movie is based on a true story, it makes me wonder if this actually happened or if it was made up for the movie.\n\nIn the US, the Bar Exam is arguably one of the hardest tests to pass (second only to the CPA exam, I'd bet). Almost all budding lawyers must study for several years to pass this ambitious test.\n\nSo, is this the true story or is it just film adaptation?"}, {"url": "https://finance.yahoo.com/news/real-life-con-man-played-192610534.html", "page_content": "The real-life con man played by Leonardo DiCaprio in 'Catch Me If You Can' says check fraud is 'a thousand times easier' today\n\ncatch me if you can\n\nThe former con-man portrayed by Leonardo DiCaprio in the 2002 film \"Catch Me If You Can\" says that it's now \"a thousand times easier\" to write fraudulent checks against your bank account than it was during his criminal heyday.\n\nFrank Abagnale Jr., the former convicted scam artist turned FBI fraud-security consultant, told the Wall Street Journal on Thursday that check forging has become a much simpler undertaking in the age of modern technology.\n\n\"Today, one simply sits down, opens a laptop and says, 'Who's my victim today?'\" Abagnale said.\n\nHe went on to walk the WSJ interviewer through the \"simple,\" minute processes of common check fraud, tracing a step-by-step example of a convenience-store check payment:\n\n\"Think about this: You go into a convenience store today and write a check for $9. You have to hand the clerk the check with your name and address, phone number, your bank’s name and address, your account number at your bank, the routing number into your account. That’s your wiring instructions. Your signature that’s on the signature card at your bank. ...\n\nAnyone who would see the face of that check—from the clerk who took it at the counter to the one that made the night deposit—could draft on your bank account tomorrow, would have all the drafting instructions. Or they could go online [and order checks] that look exactly like your checks, but put their name on it and put your account number on it. So every check they write gets debited against your account. It’s so simple to do.\"\n\nAbagnale spent five years in prison in the 1970s after he was arrested for running a series of notorious scams from 1965 until 1970.\n\nHis criminal check fraud enterprise, posing as a credentialed pilot, doctor, and lawyer as a teenager, and eventual career as a security consultant with the FBI (upon release from prison) were the subject of Steven Spielberg's \"Catch Me If You Can.\"\n\nRead the Wall Street Journal interview here.\n\nNOW WATCH: THE RAY DALIO INTERVIEW: The billionaire investor on Bridgewater’s 'radically transparent' culture and how to bet on the future\n\n\n\n\n\nMore From Business Insider\n\n"}], "Tom Hanks played an FBI agent in the film Catch Me If You Can.": [{"url": "https://www.slashfilm.com/1239741/steven-spielberg-explains-how-tom-hanks-cast-himself-in-catch-me-if-you-can/", "page_content": "In Steven Spielberg's slinky caper \"Catch Me if You Can,\" Leonardo DiCaprio plays Frank Abagnale, a teenage con artist who poses as a doctor, a lawyer, and a Pan Am co-pilot while forging checks. DiCaprio is exceptional in the role, displaying the charm, playfulness, and ease that allowed Frank to carry through his impersonations, while also balancing his youthful naivete and vulnerability.\n\nBut \"Catch Me if You Can\" is a cat-and-mouse story, and the role of FBI Agent Carl Hanratty is just as important. In an interview with Roger Ebert, Spielberg explains how Tom Hanks ended up with the role:\n\n\"Tom had read the script as a writing sample and called me and Walter Parkes, the co-producer, and said 'Can I be in this movie? Do you think Steven would let me play the FBI agent? I really know who this guy is.' And then Tom called me and he said, 'Can I kinda horn in here?' And I said, my God, what do you mean horn in? Then he called Leo and said, 'Is it an imposition for me to be this movie which is clearly your film? You're carrying it. Would it be an imposition upon you if I played the FBI agent?' Leo thought that heaven had just come down to earth for him. So in a sense, Tom invited himself into the project in such a humble, beautiful way.\"\n\nIt's hard to picture the film without him."}, {"url": "https://www.historyvshollywood.com/reelfaces/catchmeifyoucan.php", "page_content": "Things that happen in real life are sometimes a hundred times more fascinating than anything a person could make up off the top of his head. - Leonardo DiCaprio\n\nQuestioning the Story:\n\nWas the FBI Agent played by Tom Hanks a real person?\n\nThe real Carl Hanratty is a composite of a number of FBI agents who worked to catch Abagnale, most notably FBI Agent Joseph Shea. Special Agent Shea was the head of the FBI investigative team chasing after Frank and had spent several years looking for him. Agent Joe Shea also acted as his main contact at the Bureau, similar to Hanratty (Tom Hanks) in the movie. For some time, Shea had believed that Frank was an experienced criminal in his mid-thirties, not realizing that his suspect was only a teenager.\n\nDid Frank really escape a VC10 jetliner by removing the toilet and climbing down beneath it, eventually escaping through a hatch onto the tarmac?\n\n\n\nA stewardess poses with a 16-year-old Frank in NYC. A stewardess poses with a 16-year-old Frank in NYC.\n\nWhy did he do it?\n\nOnly Frank Abagnale, Jr. can answer this question, and in an interview he said the following, \"It begins with my parents' divorce and its dramatic effect on me. I ran away and suddenly found myself a teenager alone in the world. I had to grow up very quickly and become very creative in order to survive. But what started out as survival became more and more of a game. I was an opportunist, so when I saw an opening I asked myself, \"Could I get away with that?\" Then there was the satisfaction of actually getting away with it. The more I got away with, the more of a game it became \"a game I knew I would ultimately lose, but a game I was going to have fun playing until I did.\"\n\n\n\n\n\nDoes the Real Frank Abagnale, Jr. have a cameo in the movie?\n\nYes. \"I really didn't want to, but they insisted I do so,\" says Frank. \"They cut all my hair off, and they put me in a cap and a big coat and put me in a night scene playing a French policeman who goes up to arrest Leo in one of the final scenes of the movie.\"\n\n\n\n\n\nLeonardo DiCaprio and Frank Abagnale, Jr. (on the set):\n\nFrank Abagnale, Jr. Interviews and Video:\n\n\"To look at him, you wouldn't think he could steal a postage stamp. But he has an almost unconscious way of engaging you with his eyes, with his energy and with his intelligence.\" - Leonardo DiCaprio\n\nDon't miss the Frank Abagnale, Jr. videos below, including an extensive BBC interview with Frank during which he discusses his real life experiences and his somewhat hard-to-spot cameo in the film. Also, check out the Catch Me If You Can movie trailer and Frank's appearance on the game show To Tell the Truth.\n\nLink-to-Learn More:"}, {"url": "https://www.cinemablend.com/news/2561434/what-the-catch-me-if-you-can-cast-is-doing-now", "page_content": "Telling the incredible true story of Frank Abagnale, a teenager who performs several cons worth millions of dollars, 2002's Catch Me If You Can features an all-star cast, including Leonardo DiCaprio, Tom Hanks, and Christopher Walken, and the skilled hand of Steven Spielberg at the helm. It became one of his splashiest successes in the early 21st century, resulting in over $350 million at the box office, widespread acclaim, and two Oscar nominations for Best Supporting Actor for Walken and Best Score for John Williams, respectively.\n\nNow that it's been nearly 20 years since the film's glitzy premiere, what is the high-profile ensemble working on now? Let's take a look and find out!\n\nLeonardo DiCaprio (Frank Abagnale)\n\nAs Frank Abagnale, our smart and sophisticated teenager who becomes an ace con artist, Leonardo DiCaprio gives one of his best performances in Steven Spielberg's Catch Me If You Can. A bonafide A-list movie star, DiCaprio is an Oscar-winning actor for his lead performance in The Revenant. He's also well-known for his work in Titanic, What's Eating Gilbert Grape, The Departed, Gangs of New York, Romeo + Juliet, The Aviator, Inception, Blood Diamond, The Wolf of Wall Street, The Great Gatsby, and Django Unchained, to name only a few titles.\n\nMost recently, Leonardo DiCaprio starred in Quentin Tarantino's Once Upon A Time... In Hollywood. He also made an uncredited appearance in the mini-series, Grant, where he served as an executive producer. Next, DiCaprio is filming a role in Adam McKay's Don't Look Up. Additionally, he's expected to enter production on Martin Scorsese's Killers of the Flower Moon starting in February 2021. He's also set to produce this new Scorsese joint. Furthermore, outside of acting, DiCaprio is a producer on Atari and several more upcoming movies and shows.\n\nTom Hanks (Carl Hanratty)\n\nPlaying the part of Carl Hanratty, a hard-nosed FBI agent tracking Frank Abagnale's unlawful trial, Tom Hanks played the second lead in 2002's Catch Me If You Can. A two-time Oscar-winning actor for Philadelphia and Forrest Gump, Tom Hanks is unquestionably one of the most famous celebrities on the planet. Some of his most notable credits include (but aren't limited to) the Toy Story movies, Apollo 13, Saving Private Ryan, Big, Splash, Captain Phillips, Cast Away, The Green Mile, The Da Vinci Code, Sleepless in Seattle, You Got Mail, A League of Their Own, Turner & Hooch, The Polar Express, and A Beautiful Day in the Neighborhood. He also wrote, directed, produced, and starred in That Thing You Do! and Larry Crowne.\n\nMost recently, Tom Hanks starred in Greyhound, which he also wrote, and News of the World, which he also produced. Additionally, he made a cameo as himself in Amazon Prime's Borat Subsequent Moviefilm. Next, Hanks stars in BIOS. Currently, he's filming a role in Elvis, and he's set to play Geppetto in Robert Zemeckis' Pinocchio.\n\nChristopher Walken (Frank Abagnale Sr.)\n\nIn the role of Frank Abagnale Sr., Frank Abagnale's father, Christopher Walken gave an Oscar-nominated performance in Catch Me If You Can. Having appeared in over 100 movies and TV programs throughout his extensive career, Walken is best known for his Oscar-winning performance in The Deer Hunter. He's also well-known for his work in Pulp Fiction, Annie Hall, A View to a Kill, Batman Returns, The Dead Zone, The Dogs of War, Vendetta, Seven Psychopaths, The Prophecy, The Jungle Book (2016), Antz, Irreplaceable You, Kangaroo Jack, The Stepford Wives (2004), Balls of Fury, Domino, The Rundown, and Blast from the Past. Additionally, Walken was famously in Fatboy Slim's \"Weapon of Choice\" music video.\n\nMost recently, Christopher Walken was seen in The Jesus Rolls, The War with Grandpa, and Wild Mountain Thyme. Next, the actor stars in Percy. He's also set to frontline AppleTV+'s Severance and Amazon/BBC's The Offenders.\n\nMartin Sheen (Roger Strong)\n\nAs Roger Strong, an attorney and Brenda's father, Martin Sheen plays a notable supporting role in 2002's Catch Me If You Can. Most notable, Sheen is known for his starring roles in Badlands, Apocalypse Now, and The West Wing. His other famous film credits include The Subject Was Roses, The Amazing Spider-Man, Gettysburg, The American President, Spawn, Dead Presidents, The Departed, O, Bobby, The California Kid, Hot Shots! Part Deux, and Catch-22 (1970). Additionally, on television, Sheen was seen in Grace and Frankie, Anger Management, Columbo, Mission: Impossible, The Streets of San Francisco, Tales from the Crypt, and Two and a Half Men.\n\nMost recently, Martin Sheen was seen in The Devil Has a Name. The actor also reprised his role as President Josiah Bartlet for A West Wing Special to Benefit When We All Vote. Next, Sheen will appear in Judas and the Black Messiah, which arrives February 2021 in theaters and HBO Max. He also recently filmed a part in 12 Mighty Orphans. Additionally, he'll be seen in the seventh and final season of Netflix's Grace and Frankie later this year.\n\nNathalie Baye (Paula Abagnale)\n\nPlaying the part of Paula Abagnale, Frank's mother, Natalie Baye had a maternal role in Steven Spielberg's Catch Me If You Can. An actress with more than 80 films on her resume, Baye is best known for her work in Tell No One, Every Man for Himself, Strange Affair, La Balance, The Young Lieutenant, Day for Night, The Assistant (2015), The Mouth Agape, The Ant Bully, Laurence Anyways, Queens of the Ring, It's Only the End of the World, Venus Beauty, and An Affair of Love.\n\nMost recently, Nathalie Baye appeared in the dramedy film, My Best Part. She can also be seen in a recent episode of Call My Agent! Next, Baye stars in Haute Couture and Lui.\n\nAmy Adams (Brenda Strong)\n\nIn the role of Brenda Strong, the daughter of Roger who works at the hospital and eventually earns Frank's affection, Amy Adams found one of her first high-profile parts in Steven Spielberg's Catch Me If You Can. Following this early performance, Adams would go on to become a six-time Oscar-nominated actress for her leading and supporting work in Junebug, Doubt, The Fighter, The Master, American Hustle, and Vice. She's also well-known for Enchanted, Arrival, Julie & Julia, Drop Dead Gorgeous, The Muppets, Nocturnal Animals, Night at the Museum: Battle of the Smithsonian, and Talladega Night: The Ballad of Ricky Bobby, as well as Man of Steel, Batman v Superman: Dawn of Justice, Charlie Wilson's War and HBO's Sharp Objects.\n\nMost recently, Amy Adams starred in Netflix's Hillbilly Elegy this fall. Next, she'll frontline Netflix's The Woman in the Window. Adams will also be seen in Zack Snyder's Justice League and Dear Evan Hansen. Her other upcoming titles include Disenchanted and Nightbitch, as well as the upcoming mini-series, King of America.\n\nJames Brolin (Jack Barnes)\n\nAs Jack Barnes, an associate who has an affair with Frank's mother, James Brolin plays a crucial side character in 2002's Catch Me If You Can. A two-time Golden Glob and Emmy-winning actor, Brolin can be seen in The Amityville Horror (1979), Fantastic Voyage, Westworld (1973), The Car, Pee-Wee's Big Adventure, Traffic, The Master of Disguise, Burlesque, The 33, The Goods: Live Hard, Sell Hard, Ted & Venus, Night of the Juggler, Capricon One, The Boston Strangler, and Gable and Lombard. His television credits include Marcus Welby M.D., Hotel, Pensacola: Wings of Gold, Castle, The Reagans, Life in Pieces, Community, Pysch, Law & Order: SVU, Monk, The West Wing, Batman, and Steel Cowboy. Additionally, Brolin also directed and starred in My Brother's War, I'll Be Home For Christmas, and Royal Hearts.\n\nNext, James Brolin will narrate Netflix's upcoming series, Sweet Tooth.\n\nNancy Lenehan (Carol Strong)\n\nPlaying the part of Carol Strong, Brenda's mother, Nancy Lenehan had a notable supporting role in Catch Me If You Can. Outside of this performance, Lenehan's other notable film credits include Smokey and the Bandit II, She's Having a Baby, Stoogemania, Pleasantville, Beauty Shop, A Better Life and Sex Tape. Additionally, on television, the actress can be seen in People of Earth, Grace Under Fire, My Name Is Earl, Worst Week, Veep, Married to the Kellys, Buffy the Vampire Slayer, ER, Dharma & Greg, Gilmore Girls, Everybody Loves Raymond, That '70s Show, Nip/Tuck, The Middle, The Bernie Mac Show, Ally McBeal, The Golden Girls, and ALF, as well as Newhart, Family Ties, Murphy Brown, Mad About You, Boy Meets World, The Practice, Caroline in the City, and Just Shoot Me!\n\nMost recently, Nancy Lenehan appeared in episodes of CBS's Man with a Plan, NBC's Superstore, ABC's Bless This Mess, and FXX's Cake.\n\nJennifer Garner (Cheryl Ann)\n\nAs Cheryl Ann, a model-callgirl who has an interaction with Frank Jr., Jennifer Garner made a cameo in Steven Spielberg's Catch Me If You Can. Only a year before she appeared in this film, Garner headlined ABC's Alias, for which she won a Golden Globe Award. She's also known for her leading role in 13 Going On 30, as well as her work in Daredevil, Elektra, Juno, Valentine's Day, The Odd Life of Timothy Green, Dallas Buyers Club, Alexander and the Terrible, Horrible, No Good, Very Bad Day, The Invention of Lying, Miracles from Heaven, Love Simon, Catch and Release, Mother's Day, Mr. Magoo, and Peppermint.\n\nMost recently, Jennifer Garner appeared in Quibi's Home Movie: The Princess Bride. Next, Garner stars in Netflix's Yes Day, which she also produced. It premieres on March 12th. Currently, she's filming a role in another Netflix movie, The Adam Project. Garner is also signed on to star in AppleTV+'s mini-series, My Glory Was I Had Such Friends. Additionally, she's expected to frontline the musical comedy, Fantasy Camp.\n\nEllen Pompeo (Marci)\n\nPlaying the part of Marci, Ellen Pompeo found one of her earliest roles in Steven Spielberg's Catch Me If You Can. Shortly following this fim's release, Ellen Pompeo's profile rose when she took on the titular role in ABC's medical drama, Grey's Anatomy. She has appeared in over 360 episodes of the long-running program. Her other TV credits include Law & Order, Strangers with Candy, Friends, Repeat After Me, Doc McStuffins, and Get Real. She was also a judge during the fourth season of RuPaul's Drag Race: All Stars.\n\nAdditionally, Ellen Pompeo can be seen in Old School, Daredevil, Art Heist, Life of the Party (2005), Undermind, Coming Soon, In the Weeds, Mambo Cafe, and Moonlight Mile. She also appeared in deleted scenes for Eternal Sunshine of the Spotless Mind. And the actress can be seen in Taylor Swift's \"Bad Blood\" music video. Presently, Pompeo remains at the forefront of Grey's Anatomy. She also recently played Dr. Meredith Grey in an episode of Station 19.\n\nElizabeth Banks (Lucy)\n\nIn the role of Lucy, Elizabeth Banks plays a brief supporting role as a bank teller in 2002's Catch Me If You Can. Most notably, Banks is known for her work in The Hunger Games movies, the Spider-Man trilogy, Wet Hot American Summer, The 40-Year-Old Virgin, The LEGO Movie (and sequel), Power Rangers (2017), Magic Mike XXL, Role Models, Zack and Miri Make a Porno, Slither, Invincible, Love & Mercy, The Next Three Days, W., and the Pitch Perfect movies. On television, Banks received two Emmy nominations for her recurring role in 30 Rock. She also appeared in Scrubs, Modern Family, Wet Hot American Summer: First Day of Camp, and Wet Hot American Summer: Ten Years Later. Additionally, Banks directed Pitch Perfect 2 and wrote and helmed Charlie's Angels (2019).\n\nCurrently, Elizabeth Banks hosts ABC's game show, Press Your Luck. Most recently, Banks was seen in FX's Miss America. Also, she appeared in Modern Family's series finale. Next, Banks is expected to star in Call Jane. Also, she's soon expected to star in and directThe Invisible Woman for Blumhouse.\n\nYou can stream Catch Me If You Can on Netflix here. You can also stream it on Showtime here and on SundanceNow here."}, {"url": "https://www.slashfilm.com/835609/tom-hanks-catch-me-if-you-can-casting-completely-changed-the-story/", "page_content": "Steven Spielberg after the turn of the 21st Century has a strange reputation. In an era where so many film fans are craving movies with sizable budgets that are made for adults, Spielberg is one of the few directors doing this on a consistent basis. \"Munich,\" \"Lincoln,\" \"Bridge of Spies,\" and \"The Post\" are all the kinds of movies people claim they want, yet when Spielberg does it, they are sometimes thought of as old hat, old fashioned, or \"dad movies.\" Look, just because he's not dealing with aliens and whip-wielding adventurers as often as he used to does not mean these movies are any less exciting or dazzling as those earlier pictures that people worship with VHS boxes clung to their chests. In fact, I would wager my love of the last 25 years of Spielberg is at the same level as the first 25. And no movie embodies my love for this era of Spielberg more than \"Catch Me If You Can.\"\n\nThis con artist film starring Leonardo DiCaprio as real life forger Frank Abagnale Jr. just crackles. Not only is it a rip-roaring good time of a chase movie, but it is also a beautiful, melancholic look about running from your childhood trauma by pretending to be other people. What makes \"Catch Me If You Can\" special is how it juxtaposes the young whippersnapper Abagnale against a pill of an FBI agent in Carl Hanratty, played by the incredible Tom Hanks. This was an unusual part for Hanks to play. First off, it is odd not to see Hanks' name first billed on a poster, especially in this era where he was in smash hit after smash hit. Secondly, he rarely plays someone this humorless, where you can make a joke about how he can't tell a joke. While not an obvious casting choice, you need someone of a similar caliber of star to DiCaprio to make a credible foe.\n\nHowever, in a time where Hanks was being offered every part in Hollywood, he had to do some extra legwork to get \"Catch Me If You Can.\""}, {"url": "https://www.imdb.com/title/tt0264464/reviews", "page_content": "8 /10\n\nWarning: Spoilers\n\nCatch Me If You Can is a pretty interesting movie that is supposedly based on the life of Frank Abagnale, who, before his 19th birthday, successfully performed cons worth millions of dollars. He was allow to pull this off, by posing high income jobs, and forging payroll checks. The movie by Steven Spielberg is really trying hard, not to say based off true events, as the movie use 'inspired by a true story\" in order to avoid controversy similar to other past biographical films, which deviated from history. In my opinion, the movie doesn't deviated from the autobiography of Frank Abagnale too much. The movie stars Leonardo DiCaprio as the teenager Frank Abagnale who after witnessing his parents awful divorce, run away. When he runs out of money, he begins to rely on confidence scams to get by. Soon, Frank's cons grow bolder and he even impersonates an airline pilot, a Georgia doctor, and a Louisiana parish prosecutor. He drew attention by the FBI Bank fraud agency lead by Det. Carl Hanratty (Tom Hanks). Soon enough, it become a game of cat and mouse, with Frank trying everything to try to escape, and Carl trying everything to try to catch him. Set in the 1960s, the movie has this early James Bond type spy genre escapism theme going with it. Even the opening of the film by Olivier Kuntzel & Florence Deygas, looks something out of a 1960s spy film with its one of a kind title sequence. The slender Lowreyesque stamp style animation figures run through environments that symbolize key plot points from the film to the 1960s jazz-era score by John Williams is amazing and memorable. The movie was shot with bright vibrant colors, bringing out the world that no longer exist, built on trust and a firm handshake. There is a few historical anachronisms, but nothing really standing out for too long. The movie is pretty predictable as it gives you the whole story in the opening shot of the film. Approximately 80 percent of the movie is true based on Frank Abagnale Jr's account, but there were some stuff, they didn't mention on the film, the producers change or Frank just make it up. After all, Frank is indeed a consummate liar. Lots of plot holes or scenes never truly explain well. There is one outlandish scene with him looking for female airplane attendant recruits just in the space of one day and another one escaping a jet through the toilet. You have to hold, suspense of disbelief here. There was a stint, not added to the film, where Frank was professor of sociology at a college in Salt Lake City, Utah that was supposedly cut due to time constraints; but the truth is, the college, Brigham Young University, repudiates this claim that he never did teach there. The film, somewhat change it to him pretending to a French teacher in the beginning a local New York school. Another thing is his relationship with his father. In the film, Frank has a strong relationship with his dad. His father love that his son is stealing from the government and business, because they didn't support him when his business went under. Not in the case of real life, as his first victim was indeed his father stealing $3,400 from him in credit card fraud. Also, Abagnale never saw his father after he ran away from home, unlike the film. Other minor changes is that, the movie omitted his two jail attempts to get away from prison and his time in France. It would be nice to see that, both the movie would had been long. One more thing, FBI officer who was chasing Frank was really Joe Shea. Frank Abagnale Jr. used the pseudonym \"Sean O'Reilly\" in his book because Joe Shea was still in the F. B. I. He has since passed away, but the movie still used a new name, Carl Hanratty. I love the relationship between Frank and Carl in this movie. The chemistry in their respective roles is what breathes life into this film. There is a great scene at a motel between the two. The whole act was so risky. Leo play Frank with integrity and accuracy. He got the suave playboy down being bold and stylish. Tom Hanks was great as Carl. Season actor by this time, going toe to toe with a then, still-green, Leo. There is another great scene where both of their character call on Christmas. You can really tell the lack of family in Leo's character making him sympathy giving him a Freudian excuse. As less, he wasn't unlikeable. Catch me if You Can deals with themes of broken homes and troubled childhoods so well. The female characters played by Jennifer Garner, Ellen Pompeo and Elizabeth Banks were alright, but in my opinion, I have to say, Amy Adams as Brenda Strong was the best. Amy Adams as Brenda Strong gave one of the best performance in the film, as the emotional Brenda. I felt sad on what happen to her character. Also check out, the real Frank Abagnale as one of the French police officers toward the end. The music is great. I love the way, they use Frank Sinatra 'come fly with me'. Full of fantasy glam. The movie comes with a good moral message. Overall: Highly Informative and Incredibly Life Changing, Yet Subtly Descriptive and Wildly Entertaining. Worth the watch. So catch it!"}, {"url": "https://www.slashfilm.com/601001/the-fascinating-true-and-not-so-true-story-behind-catch-me-if-you-can/", "page_content": "As we get into the meat of Frank's criminal life, the details become fuzzy. According to Abagnale Jr, the movie only deviates in subtle ways. He argues that there are embellished details and added scenes, but most of his 20s unfolded just as the film presents. However, if you ask experts, journalists, or researchers who've dedicated years to investigating Abagnale's claims, there isn't a lot of evidence to back up the stories that the con man has been recounting for decades. Take, for example, the charming romance at the center of this film.\n\nIn 2020, journalist Alan C. Logan wrote \"The Greatest Hoax on Earth: Catching Truth, While We Can.\" The book debunks many of Abagnale's claims, including the story of his relationship with Paula Parks, the woman who became the basis of Amy Adams' Brenda. Logan spoke directly to Parks, who says that their relationship in the film is not only heavily exaggerated, but blithely mischaracterized. In reality, Parks was a stewardess who met Abagnale while he was posing as a pilot. Though they struck up a friendship, it was quickly derailed when he discovered her work schedule (through deceptive means) and followed her all over the Eastern Seabord.\n\nLogan spoke to WHYY-TV in 2021 and explained that \"Parks didn't know what to do with him. She tried to tell him that she wasn't interested, but he was persistent.\" After essentially stalking her through work, Abagnale showed up at her apartment in New Orleans where she told him that she was leaving to go visit her parents in Baton Rouge. He decided to tag along. After he met her parents, the duo parted ways and that seemed to be the end of it ... until Abagnale returned."}, {"url": "https://www.rogerebert.com/reviews/catch-me-if-you-can-2002", "page_content": "In Steven Spielberg's new film, Abagnale is played by Leonardo DiCaprio as a young man who succeeds at his incredible impersonations by the simple device of never seeming to try very hard. While an airline employee might be suspicious of a very young-looking man who insists he is a pilot, what could be more disarming than a man offered a trip in the jump seat who confesses, \"It's been awhile. Which one is the jump seat?\" DiCaprio, who in recent films such as \"The Beach\" and \"Gangs of New York\" has played dark and troubled characters, is breezy and charming here, playing a boy who discovers what he is good at, and does it. There is a kind of genius flowing in the scene where he turns up for classes at a new school, walks into the classroom to discover that a substitute teacher is expected and, without missing a beat, writes his name on the blackboard, and tells the students to shut up and sit down and tell him what chapter they're on.\n\nIt is probably true that most people will take you at face value until they have reason to do otherwise. I had a friend who had risen to a high level in her organization and was terrified her secret would be discovered: She never attended college. My guess, and it proved accurate, was that nobody would ever think to ask her. It is probably an even better guess that no patient in a hospital would ask to see a doctor's medical school diploma.\n\nThe movie makes some attempt to explain Abagnale's behavior through adolescent trauma. He is raised by loving parents; his father, Frank Sr. (Christopher Walken), brought his French mother, Paula (Nathalie Baye), back from Europe after military service, and Frank Jr.'s childhood is a happy one until Paula cheats on her husband and walks out. Is that why her son was driven to impersonation and fraud? Maybe. Or maybe he would have anyway. Once he discovers how much he can get away with, there is a certain heady exhilaration in how easily he finds status, respect and babes.\n\nThe movie co-stars Tom Hanks as Carl Hanratty, an FBI agent whose mission in life evolves into capturing Abagnale. As the only person who really has a comprehensive overview of the scope and versatility of Abagnale's activities, Hanratty develops--well, not an admiration, but a respect for a natural criminal talent. There is a scene where he actually has Abagnale at gunpoint in a motel room, and the kid, a cool customer and quick thinker, tries impersonating a Secret Service agent who is also on the suspect's tail. Much of the pleasure of the movie comes from its enjoyment of Abagnale's strategies. He doesn't seem to plan his cons very well, but to take advantage of opportunities that fall in his way. At one point, in New Orleans, he finds himself engaged to the daughter (Amy Adams) of the local district attorney (Martin Sheen). At a dinner party with his prospective in-laws, he seems to contradict himself by claiming to be both a doctor and a lawyer, when he doesn't look old enough to be either. When the D.A. presses him for an explanation, there is a kind of genius in his guileless reply: \"I passed the bar in California and practiced for a year before saying, 'Why not try out pediatrics?' \" Uh-huh. And then he makes the mistake of saying he graduated from law school at Berkeley. Turns out the Sheen character did, too, and quizzes him about a legendary professor before adding, \"Does he still go everywhere with that little dog?\" Here is where Abagnale's quickness saves him. Considering the 30-year age difference between himself and the girl's father, he simply observes, \"The dog died.\" Yes, although the professor may well have died, too, and when the D.A. calls his bluff, he responds by being honest (although that is sort of a lie, too)."}, {"url": "https://www.imdb.com/list/ls062096796/", "page_content": "M18 | 172 min | Drama, Mystery, Sci-Fi\n\n55 Metascore\n\nAn exploration of how the actions of individual lives impact one another in the past, present and future, as one soul is shaped from a killer into a hero, and an act of kindness ripples across centuries to inspire a revolution.\n\nDirectors: Tom Tykwer, Lana Wachowski, Lilly Wachowski | Stars: Tom Hanks, Halle Berry, Hugh Grant, Hugo Weaving\n\nVotes: 367,640 | Gross: $27.11M"}, {"url": "https://www.looper.com/384371/the-ending-of-catch-me-if-you-can-explained/", "page_content": "Abagnale is sentenced to 12 years of hard time. While in prison, the FBI offers him a get-out-of-jail-free card, with some strings attached. He has to work for the Financial Crimes Unit, under Hanratty's supervision. Speaking with The Charleston City Paper in 2015, Abagnale described his actual feelings about getting the FBI job. \"When I got the offer [from the FBI], I truly looked at it as, well, here's a way out of prison,\" he reflected, \"I don't know that in my mind I'd decided never to break the law again.\"\n\nIn the movie, Abagnale is overwhelmed by the amount of work given to him and bored by having to do honest work for the first time in his life. He becomes restless after he sees a pilot uniform in a store window, and briefly reverts back to his old habits. Hanratty confronts Abagnale, sharing a personal story that shows he understands the lonely road the younger man has been on all these years. Back in the FBI office, Hanratty asks Frank how he passed the Louisiana bar exam. Abagnale tells him he actually spent weeks studying for it, and that there was no con pulled. Hanratty realizes that Abagnale will do just fine in the real world.\n\nThe real Abagnale eventually took a straight and narrow path, becoming a global authority on bank fraud and forgery, as shown on his website. The skills Abagnale used to scam hundreds of thousands of dollars eventually made him millions. The Hanratty character, meanwhile, was based on real-life FBI Agent Joseph Shea. That familial relationship he built with Abagnale grew into a solid friendship that lasted until Shea's death in 2005."}, {"url": "https://www.imdb.com/list/ls070089441/", "page_content": "M18 | 172 min | Drama, Mystery, Sci-Fi\n\n55 Metascore\n\nAn exploration of how the actions of individual lives impact one another in the past, present and future, as one soul is shaped from a killer into a hero, and an act of kindness ripples across centuries to inspire a revolution.\n\nDirectors: Tom Tykwer, Lana Wachowski, Lilly Wachowski | Stars: Tom Hanks, Halle Berry, Hugh Grant, Hugo Weaving\n\nVotes: 367,640 | Gross: $27.11M"}]}