{"Eleanor Arnason was born in 1942.": [{"url": "https://www.goodreads.com/author/show/108548.Eleanor_Arnason", "page_content": "Eleanor Arnason\n\nBorn\n\nJanuary 01, 1942\n\nGenre\n\nEleanor Atwood Arnason (born 1942) is an American author of science fiction novels and short stories. From 1949 to 1961, Arnason and her parents lived in \"Idea House #2,\" a futuristic dwelling built by the Walker Art Center. Arnason's earliest published story appeared in New Worlds in 1972. Her work often depicts cultural change and conflict, usually from the viewpoint of characters who cannot or will not live by their own societies' rules.\n\nEleanor Atwood Arnason (born 1942) is an American author of science fiction novels and short stories. From 1949 to 1961, Arnason and her parents lived in \"Idea House #2,\" a futuristic dwelling built by the Walker Art Center. Arnason's earliest published story appeared in New Worlds in 1972. Her work often depicts cultural change and conflict, usually from the viewpoint of characters who cannot or will not live by their own societies' rules."}, {"url": "https://www.encyclopedia.com/arts/educational-magazines/arnason-eleanor-1942", "page_content": "Arnason, Eleanor 1942–\n\n(Eleanor Atwood Arnason)\n\nPERSONAL: Born 1942.\n\nCAREER: Writer. Accountant; has also worked as a clerk and warehouse employee.\n\nAWARDS, HONORS: Mythopoeic Fantasy Award (Adult), 1992, and James Tiptree, Jr., Award, both for A Woman of the Iron People; Homer Award for best novelette, 2000; Gaylactic Network Spectrum Award, 2000, for \"Dapple: A Hwarhath Historical Romance\"; Minnesota Book Award, for Ring of Swords.\n\nWRITINGS:\n\nSCIENCE FICTION NOVELS\n\nThe Sword Smith, Condor (New York, NY), 1978.\n\nTo the Resurrection Station, Avon (New York, NY), 1986.\n\nDaughter of the Bear King, Avon (New York, NY), 1987.\n\nA Woman of the Iron People, Morrow (New York, NY), 1991, published in two volumes as In the Light of Sigma Draconis, Avon (New York, NY), 1992, and Changing Women, Avon (New York, NY), 1992.\n\nRing of Swords, Tor (New York, NY), 1993.\n\nOTHER\n\n(Editor, with Terry A. Garey) Time Gum (poetry), 1988.\n\nOrdinary People (short stories), Aqueduct Press (Seattle, WA), 2005.\n\nWork represented in anthologies, including New Worlds Quarterly, edited by Michael Moorcock and Charles Platt, 1973, The Norton Book of Science Fiction, Norton (New York, NY), 1993, Women of Wonder, Vintage Books (New York, NY), 1995, Isaac Asimov's Camelot, Ace Books (New York, NY), 1998, and Isaac Asimov's Valentines, Ace Books (New York, NY), 1999. Author of \"Dapple: A Hwarhath Historical Romance.\" Contributor to periodicals.\n\nSIDELIGHTS: Eleanor Arnason is known as a successful science-fiction writer. In 1978, she published her first novel, the coming-of-age saga The Sword Smith, and readily established herself as a proficient stylist. Arnason followed The Sword Smith with To the Resurrection Station, which concerns romantic entanglements on a space colony. Belinda Smith, the tale's heroine, is a young woman capable of prompting bizarre physical changes in herself and others within range of her powers. Belinda is studying at a colony college when she is abruptly withdrawn from school and informed that a marriage has been arranged between herself and a native. Furthermore, Belinda is informed that she is herself half-native, half-Earthling. Complications ensue when Claude, the native to whom Belinda has been pledged in matrimony, falls in love with Belinda's college roommate, Marianne, who is, in turn, secretly married. After a series of adventures, Belinda and Claude, together with a helpful robot, arrive on Earth only to discover that most humans have been eliminated following a war with genetically engineered rats. More escapades ensue before Belinda, Claude, and the robot manage to escape from Earth and head into space.\n\nArnason next published Daughter of the Bear King, the story of Esperance Olson, a middle-aged Minneapolis homemaker who is electrocuted by her washing machine and consequently finds herself in an alternate world where she possesses magic powers, including the ability to transform herself into a bear. Olson is told by inhabitants of this other world that she actually hails from it too, and that, as daughter of the Bear King, she holds the ability to rid this other world of such creatures as dragons, cockroaches, and snail-chicken hybrids, all of whom threaten to overrun the world in plague-like numbers. Olson somehow manages a return to Minneapolis, only to be pursued by countless gruesome creatures that exert an unpleasant influence on the doings within her community. A reviewer for the Washington Post Book World proclaimed Daughter of the Bear King \"quite simply the most enjoyable fantasy novel I have ever read.\"\n\nA Woman of the Iron People, Arnason's next novel, was described by reviewer Richard Grant, writing in the Washington Post Book World, as \"good old-fashioned science fiction of a certain type,\" which he dubbed \"speculative anthropology.\" This tale, which was also published in two volumes as In the Light of Sigma Draconis and Changing Women, concerns a clash of cultures that commences after a team of eight Earthlings arrives on a faraway planet to study life there. The natives on this planet, although intelligent, are technologically inferior to the Earthlings. Their culture is a relatively primitive one in which natives abstain from sexual activity except during a brief mating period. At other times the native women and children devote themselves to handcrafts and live separate from the males. Complications develop when one of the human observers, Lixia, becomes drawn to Nia, a renegade female native whose conduct sometimes bears greater similarities to males then it does to her own gender. Grant, in his Washington Post Book World appraisal, deemed A Woman of the Iron People \"lively, stimulating, intelligent, subtle and even witty.\"\n\nIn 1993, Arnason produced Ring of Swords, in which she again pursued the notion of clashing cultures. In this novel Earthlings travel to a distant planet and commence peace negotiations with the world's warmongering males, the hwarhaths. Nicolas, the Earthling translator, has forsaken his species and become the homosexual lover of a hwarhath general. Meanwhile, the human biologist Anna Perez has been imprisoned by her fellow Earthlings, who accuse her of espionage. When Anna is rescued by a daring band of hwarhaths, she realizes a significant opportunity for conducting further studies into the native culture. Among her discoveries is that the hwarhaths are actually grateful that the Earthlings have arrived and thus become opponents in a highly anticipated conflict. John Stadek, in his review of Rings of Swords for the Washington Post Book World, affirmed that Arnason \"has a knack for inventing very human aliens.\" He added that he \"enjoyed every page\" of Arnason's novel.\n\nArnason's short-story collection, Ordinary People, contains six stories, a poem, and the transcript of a speech given by the author. The title suggests that while Arnason's alien characters may look strange, they are really just common, everyday people trying to make their living. In one story, structured like a traditional fairy tale, five daughters take their portion of their mother's heritage and seek their way in the world with it. The catch is that the mother's heritage is language, and one daughter is given nouns, another verbs, and so on. In the end, the prepositions, which might seem like the least useful group, turn out to be the greatest treasure. Arnason also revisits the setting of Ring of Swords in a story that tells of two lovers breaking the taboo of heterosexual love. Reviewing the book for Tangent Short Fiction Review, Lois Tilton voiced some disappointment that there was no new work in it, but added: \"What it does provide is a new look at the range of her fiction, and more good reason than ever to wish for more new stories.\"\n\nBIOGRAPHICAL AND CRITICAL SOURCES:\n\nPERIODICALS\n\nAnalog Science Fiction/Science Fact, June, 1987, Tom Easton, review of To the Resurrection Station, pp. 183-184.\n\nLambda Book Report, September-October, 1993, Susanna J. Sturgis, review of Ring of Swords, p. 32.\n\nNew Statesman & Society, January 29, 1988, Colin Greenland, review of Daughter of the Bear King, p. 30.\n\nNew York Times Book Review, July 14, 1991, Gerald Jonas, review of A Woman of the Iron People, p. 27.\n\nWashington Post Book World, September 27, 1987, review of Daughter of the Bear King, p. 10; May 26, 1991, Richard Grant, review of A Woman of the Iron People, p. 6; August 29, 1993, John Stadek, review of Ring of Swords, p. 12.\n\nONLINE\n\nEleanor Arnason's Blog Spot, http://www.eleanorarnason.blogspot.com (December 8, 2006).\n\nIsaac Asimov's Science Fiction Online, http://www.asimovs.com/ (December 8, 2006), brief article about Eleanor Arnason.\n\nStrange Horizons, http://www.strangehorizons.com/ (December 8, 2006), Lyda Morehouse, interview with Eleanor Arnason.\n\nTangent Short Fiction Review, http://www.tangentonline.com/ (June 26, 2005), Lois Tilton, review of Ordinary People."}, {"url": "https://locusmag.com/2016/09/eleanor-arnason-unfolding/", "page_content": "‘‘We have a split in the 20th century between genre fiction, which tends to be about action, and fiction that’s about interpersonal relationships and psychology. At a Chicago convention decades ago, Gene Wolfe said that every time he encounters people who say the most important things happen within their heads, he wants to put them in a small boat on the ocean in the middle of the storm. This connects to my prejudices about mainstream literary fiction.\n\n‘‘I’ve always read science fiction and fantasy and murder mysteries. I was an English major most of the way through college, and I read The Great Gatsby and Dubliners and Portrait of the Artist as a Young Man and some of Proust in French, so I got a reasonable background in mainstream literature. But it didn’t interest me the way that science fiction did. My problem with realism is that a realistic novel about the psychological problems of middle-class people is a story which is very similar to the life I’m leading, and thus is not too interesting. Whereas the minute you throw in a dragon or global warming, it becomes very interesting. Internal thoughts become much less important, and you basically want to deal with the dragon.”\n\n…\n\n‘‘My father’s parents came from Iceland to North America, and I grew up in a house full of books on Norse mythology, the Icelandic sagas, and the novels of the great 20th-century Icelandic writer Halldór Laxness. (I have a copy of his novel Independent People inscribed to my father. Laxness misspelled my father’s name.) I have a thing about Iceland, especially the medieval lit­erature, and I have come to love Icelandic folklore. Hidden Folk, which came out early in 2015, is a collection of stories based on Icelandic folklore and literature.\n\n‘‘Icelanders don’t have princes and princesses – Iceland was too poor for royalty, even in folktales. Instead, there are trolls, elves, ghosts, outlaws, and ministers who study the black arts. Hidden Folk is very much my own version of Icelandic tales. My elves are unpleasant upper-class types. My trolls are poor farmers and workers, barely surviving. My humans are a mixed lot: farmers and farmwives, students of the magical arts, slaves, a writer, a cop. Over the years, I wrote five Icelandic fantasies – six since the collection was published, and I’m work­ing on a seventh.”\n\n…\n\n‘‘Science fiction and fantasy have the appeal of strangeness, and of course science and technology are enormously important in science fiction. SF has been dealing with global warming consistently, while the presidential candidates have barely men­tioned it. There’s no question that it’s happening, and it’s going to be devastating. James Lovelock, who came up with the Gaia theory, has said we’re going to be down to a billion people by the end of the century.\n\n‘‘I read a lot projections of the future, and people never factor in enough. They project a population of nine billion, but they don’t factor in the Four Horsemen of the Apocalypse – famine, war, dis­ease, and death due to climate change. All they’re doing is a projection of where we’ve been. Science fiction, when it’s good, will pick up a whole bunch of these ideas at once. There was a panel at the 2016 Minicon about writing SF in which many things are changing, rather than just one. One of the things that makes me crazy about much hard SF is, you’re in the future with unbelievable physics that nobody now can understand… but everybody has names like Brad and Charles and they’re living the way we live now. That is nuts. Charles Stross’s early novels had more things happening than I could keep track of. They were stunning.”\n\n…\n\n‘‘Writing Ring of Swords was a lot of fun – it’s the fastest I’ve ever written a novel, and the first separate hwarhath story, ‘The Hound of Merin’, was also written at about the same time as the novel. Ring of Swords was going to be the first of a trilogy, and I wrote the second volume, but it was turned down by the publisher. It’s really hard to sell the middle book of a trilogy by itself, so I put it to the side. There were problems with the sequel, and I’m not happy with the way it turned out. (I now have a contract with Aqueduct Press for a revised version of the sequel, so it will finally come out.) I was frustrated with the trilogy, and I had a lot more information about the hwarhath, so I started writing short stories. These turned out to be stories written by hwarhath authors after they en­countered humanity, not only about the hwarhath, but about them thinking about their own culture, and in some cases thinking about humanity. The hwarhath are extremely rigid in many ways, and meeting a species very much like themselves but with different rules for male and female behavior leads the brighter among them to question what is the nature of men and women, and that underlies a lot of the stories.”\n\n…\n\n‘‘I have an alien species I’ve written a few stories about, the Goxhat, which are another attempt to look at social stereotypes or maybe ideas of self. In the early part of their culture there were teams, which would be a bunch of Goxhat hatched out of the same clutch of eggs. Each team thought of itself as ‘I,’ and no individual thought of itself as an individual. They come in four sexes, and a team could be all four sexes or one sex, and it’s all ‘I.’ My story ‘Knapsack Poems’ is about the Goxhat early in their history. As their culture evolved, their sense of ‘I’ got bigger, until the whole species became ‘I.’ They know that they are different bod­ies, but they don’t have a clear sense of themselves as individuals. They’re spacefaring, and they meet other species that don’t have their sense of oneness, so the problem becomes how the Goxhat can think about other species. They meet something that isn’t part of the ‘I’ – and what do they do about a species that is millions of ‘I’s?”\n\nRead the complete interview in the September 2016 issue of Locus Magazine. Interview design by Francesca Myman."}, {"url": "https://prabook.com/web/eleanor.arnason/3740099", "page_content": "Ring of Swords\n\n(Eleanor Arnason's A Woman of the Iron People \"will inevit...)\n\nEleanor Arnason's A Woman of the Iron People \"will inevitably and appropriately be compared to the work of Ursula K. Le Guin,\" said Locus. It won both the Mythopoeic Award and one of the first annual James Tiptree Jr. Awards, and received widespread review attention. Ring of Swords takes place on a larger canvas, the entire civilized galaxy in the 22nd century. For nearly fifty years, humanity has been in conflict with a spacefaring race of warlike humanoid aliens, the only advanced and intelligent race thus far encountered in the exploration of space. Humans hope to avoid interstellar war with this enigmatic race, and have set up the first diplomatic talks with them on an isolated and strategically unimportant planet. Biological researcher Anna Perez has a grant to study the huge, jellyfishlike aliens who live in the seas on this far planet. As the talks begin, she learns that the alien diplomats have a translator, Nicholas Sanders, who to the astonishment of all is the first human turncoat. Anna becomes involved in a plot to kidnap him. So begins a story of deepening conflict, complicated by racial and sexual roles, attitudes toward aggression, and misunderstood customs haunted by the spectre of an unimaginable war, a complex tale of the future that confirms Eleanor Arnason's place among the leading SF writers of the decade.\n\nhttp://www.amazon.com/gp/product/0312855184/?tag=2022091-20\n\n1993"}, {"url": "https://alchetron.com/Eleanor-Arnason", "page_content": "Eleanor Atwood Arnason (born December 28, 1942) is an American author of science fiction novels and short stories.\n\nArnason's earliest published story, \"A Clear Day in the Motor City\", appeared in New Worlds in 1973. Her work often depicts cultural change and conflict, usually from the viewpoint of characters who cannot or will not live by their own societies' rules. This anthropological focus has led many to compare her fiction to that of Ursula K. Le Guin.\n\nArnason won the first James Tiptree, Jr. Award, the Mythopoeic Award (for A Woman of the Iron People), the Spectrum Award (for \"Dapple\") and the HOMer Award (for her novelette Stellar Harvest). Stellar Harvest was also nominated for a Hugo Award in 2000. In 2003, she was nominated for two Nebula Awards, for her novella Potter of Bones and her short story \"Knapsack Poems\". In 2004, she was guest of honor at WisCon. She lives in Minnesota.\n\nBackground\n\nEleanor Arnason is the daughter of Hjorvadur Harvard Arnason, a Canadian-born man of Icelandic descent, who worked as an art historian and became the director of the Walker Art Center in Minneapolis, Minnesota, in 1951, and Elizabeth Hickcox Yard Arnason, a social worker by profession who spent her childhood in a missionary community in western China. Arnason is the niece of the American feminist Molly Yard, and her maternal grandparents were both Methodist missionaries. This Methodist influence would be visible in her works, most notably in Ring of Swords.\n\nFrom 1949 to 1960, Arnason and her parents lived in Walker's \"Idea House #2\", a futuristic dwelling built next to the Walker Art Center. [1] Arnason has said that her experience growing up around avant-garde artists in a futurist house, in addition to the influence of her feminist, socialist mother contributed to her preoccupation with the future, and consequently science fiction. Prior to 1949, Arnason's family moved frequently: from New York City to Chicago; Washington, D.C.; London; Paris; and St. Paul, Minnesota.\n\nShe graduated from Swarthmore College in 1964, with a B.A. in art history, and continued her education in graduate school at the University of Minnesota, until 1967. She spent the next seven years working as an office clerk in Brooklyn and then Detroit. Her time in these blue-collar, racially diverse areas helped to shape her understanding about class consciousness, conflict, and revolution—notions that are reflected in her works. Arnason moved back to the Twin Cities of Minneapolis and St. Paul in 1974 and continued to work in offices, warehouses, a large art museum, and more recently, a series of small nonprofits devoted to history, peace, justice, and art.\n\nSince 1994, she has shifted her literary focus from novels to short fiction. She retired in 2009 and now writes full-time.\n\nPolitics\n\nThe issues that transpire most in Arnason's life and writings encompass feminism, peace, social justice, support for the union movement and a deep belief that racism and all forms of prejudice should be opposed. City Pages labelled Arnason as a political radical.\n\nHaving come of age during Second Wave Feminism, Arnason included gender and sexuality as central themes in her work, notably in her collection of hwarhath stories in which she \"wanted to create a society in which homosexual love was normal and heterosexual love was abnormal, sort of as a thought experiment. And because contemporary Americans have very rigid ideas of what is normal.\" The hwarhath stories also addressed issues of gender roles and reproductive rights.\n\nShe was profoundly affected by the McCarthy period, particularly because of the ways that children were taught to securitize against nuclear annihilation. She became involved in the Student Peace Union and attended demonstrations during the Cuban missile crisis. Ring of Swords, Arnason's hwarwath novel, illustrates peace building after a long war; an endeavor both representative of Arnason's peace beliefs and of the Make love, not war politics of the 1960s.\n\nIn 1963, Arnason went to the March on Washington for Jobs and Freedom with her mother. This had a profound impact that would be reflected in her story Big Brown Mama and Brer Rabbit in which Brer Rabbit transforms into an African-American man in the early 20th century. Arnason has often opted for racially diverse characters, including, but not limited to, a heroine of Chinese descent in A Woman of the Iron People and a Hispanic heroine in Ring of Swords. In addition, her Lydia Duluth stories present a future in which an overwhelming majority of humans have dark brown and black toned skins as the best protection against the radiation of many stars.\n\nArnason had intermittent activist politics outside of her work as an author, working in a campaign office in New York, collecting and transporting supplies for striking coal miners in Kentucky, becoming a local and national official in the National Writers Union and engaging in Democratic Farmer Labor Party precinct politics.\n\nStandalone Novels\n\nTo the Resurrection Station (1986)\n\nDaughter of the Bear King (1987)\n\nWoman of the Iron People series\n\nPart 1 In the Light of Sigma Draconis (1991)\n\nPart 2 Changing Women (1991)\n\nA Woman of the Iron People (1991)\n\nStandalone Short Stories\n\n\"A Clear Day in the Motor City\" (1973)\n\n\"The Warlord of Saturn's Moons\" (1974)\n\n\"Ace 167\" (1974)\n\n\"The House by the Sea\" (1975)\n\n\"The Face on the Barroom Floor\" (1976) with Ruth Berman\n\n\"Going Down\" (1977)\n\n\"A Ceremony of Discontent\" (1981)\n\n\"The Ivory Comb\" (1982)\n\n\"Glam's Story\" (1987)\n\n\"Among the Featherless Bipeds\" (1988)\n\n\"A Brief History of the Order of St. Cyprian the Athlete\" (1992)\n\n\"The Dog's Story\" (1996)\n\n\"The Venetian Method\" (1998)\n\n\"Feeding the Mother: A Hwarhath Religious Anecdote\" (1998)\n\n\"The Grammarian's Five Daughters\" (1999), available online\n\n\"Origin Story\" (2000)\n\n\"Moby Quilt\" (2001)\n\n\"The Lost Mother: A Story Told by the Divers\" (2002)\n\n\"Knapsack Poems\" (2002)\n\n\"The Potter of Bones\" (2002), available online\n\n\"Big Black mama and Tentacle Man\" (2003)\n\n\"Big Ugly Mama and the Zk\" (2003)\n\n\"Big Green Mama Falls in Love\" (2006) in Eidolon I (ed. Jonathan Strahan, Jeremy G. Byrne)\n\n\"The Diner\" (2008)\n\n\"Patrick and Mr. Bear: A True Story\" (2010)\n\n\"Mammoths of the Great Plains\" (2010)\n\n\"My Husband Steinn\" (2011)\n\n\"The Woman Who Fooled Death Five Times\" (2012)\n\n\"Big Red Mama in Time and Morris, Minnesota\" (2013)\n\n\"Big Brown Mama and Brer Rabbit\" (2013)\n\n\"Kormak the Lucky\" (2013)\n\n\"Ruins\" (2015) in Old Venus (anthology)\n\nHwarhath Stories\n\nRing of Swords (1993)\n\n\"The Hound of Merin\" (1993)\n\n\"The Semen Thief\" (1994)\n\n\"The Lovers\" (1994)\n\n\"The Small Black Box of Morality\" (1996)\n\n\"The Gauze Banner\" (1998)\n\n\"Dapple: A Hwarhath Historical Romance\" (1999)\n\n\"The Actors\" (1999)\n\n\"The Garden: A Hwarhath Science Fictional Romance\" (2004)\n\n\"Holmes Sherlock: A Hwarhath Mystery\" (2012) available online\n\nLydia Duluth stories\n\n\"Stellar Harvest\" (1999)\n\n\"The Cloud Man\" (2000)\n\n\"Lifeline\" (2001)\n\nTomb of the Fathers (2010)\n\nCollections\n\nOrdinary People (2005)\n\nMammoths of the Great Plains (2010)\n\nBig Mama Stories (2013)\n\nAnthologies\n\nTime Gum and Other Poems from the Minicon Poetry Readings (1988), with Terry A. Garey\n\nPoems\n\n\"Poem (untitled)\" (1976)\n\n\"The Land of Ordinary People\" (1985)\n\n\"On the Border\" (1986)\n\n\"On Writing\" (1986)\n\n\"There Was an Old Lady ...\" (1987)\n\n\"Clean House Poem\" (1988)\n\n\"Mars Poem\" (1988)\n\n\"Poem Written After I Read an Article Which Argued That Birds Are Descended From Dinosaurs\" (1988)\n\n\"Dragon Poem\" (1989)\n\n\"Amnita and the Giant Stinginess\" (1990)\n\n\"The Glutton: A Goxhat Accounting Chant\" (2001)\n\n\"Song from the Kalevala\" (2003)\n\n\"Colline's Coat\" (2003)\n\n\"On Seeing Bellini's Opera The Capulets and Montagues...\" (2003)"}, {"url": "https://storybundle.com/books/2268", "page_content": "Excerpt\n\nMammoths of the Great Plains\n\nEvery summer my parents sent me to stay with my grandmother in Fort Yates, North Dakota. I took the rocket train from Minneapolis, waving at Mom and Dad on the platform as the train pulled out, then settling comfortably into my coach seat. I loved my par- ents, but I also loved to travel, and I was especially fond of the trip to Fort Yates.\n\nWe glided north along the Mississippi, gaining speed as we left the city and entered the wide ring of suburbs around Minneapolis and St. Paul. Looking out, I saw scrub woods and weedy meadows, dotted with the ruins of McMansions and shopping malls.\n\nThe suburbs had been built on good land, my dad told me, replacing farms, wood lots, lakes and marshes. \"A terrible waste of good soil, which could have fed thousands of people; and the land is not easy to re- claim, given all the asphalt and concrete which has been poured over it. That's why we've left it alone. Let time and nature work on it and soften it up!\"\n\nDad's employer, the Agricultural Recovery Administration, might be ignoring the suburbs. But\n\nthere were people in them. Looking out my window, I saw gardens and tents among the weeds and ruined houses; and there were platforms made of scrap wood along the tracks. The rocket trains didn't stop at the platforms; but local trains did, picking up produce for markets in the city. Now and then I saw an actual per- son, hanging clothes on a line or riding a bicycle bump- ily along a trail.\n\n\"Fools,\" Dad called them and refused to buy their food in the market, though it had passed inspection. I thought the people were romantic: modern pioneers. My grandmother had things to say about pioneers, of course.\n\nNorth of St. Cloud, the forest began, and I went to the bubble car, riding its lift to the second floor and a new seat with a better view. The forest was second or third growth, a mixture of conifers and hardwoods; and there was a terrible problem with deer. They were a problem on farms as well, though not as much as gen-mod weeds and bugs. Market hunters controlled the deer, in so far as they were controlled. Wolves and panthers would do a better job, my father said; but the farmers didn't like them.\n\nTrees flashed by, light green and dark green, brown if they were dying. The conifers were heat-stressed and vulnerable to parasites and disease. In time the for- est would be entirely hardwood. Now and then I saw a gleam of blue: a pond or lake surrounded by forest. Sometimes the train crossed a river.\n\nAround noon we reached the bed of fossil Lake Agassiz, also known as the Red River Valley. The forest ended, and we traveled through farm land, amazingly flat. Trees grew in lines between the fields: windbreaks. They were necessary, given the wind that came off the western plains. The main crops were potatoes and sugar beets. The farmers had to keep changing the varieties they grew as the climate changed, getting hotter. \"We're like the Red Queen in Alice,\" Dad said. \"Running and running in order to remain in one place.\"\n\nThe train stopped at Fargo-Moorhead, then turned due north, going along the Red River to Grand Forks. Then it turned again. I went to the dining car and ate lunch while we raced west across the North Dakota plain. This was wind farm country. Rows of giant wind- mills extended as far as I could see. Between them were fields of sunflowers. In the old days, my dad said, the fields had been dotted with pothole lakes and marshes full of wild birds. Most were gone now, the water dried up and the birds flown. In any case, the train moved so rapidly that I couldn't bird watch, except to look at hawks soaring in the dusty blue sky, too far up to identify.\n\nI got off at Minot and stayed the night with my mother's second cousin Thelma Horn. In the morning Thelma put me on a local train that ran south along the Missouri River. There was only one passenger car, hitched to an engine that hauled boxcars and tankers. The track was not nearly as well maintained as the rock- et train's line. The local rocked slowly along, stopping often. By late morning we were on the Standing Rock Reservation. There were bison on the hillsides, the only livestock that made sense in short grass prairie, my dad said, and hawks in the sky. If I was lucky, I might see pronghorns or a flock of wild turkeys.\n\nBy noon I was at the Fort Yates station. My grandmother waited there, tall and thin and upright, her hair pulled back in a bun and her nose jutting like the nose on the Crazy Horse monument. At home in Minneapolis, I forgot I was part Lakota. Here, looking at my grandmother, I remembered."}, {"url": "https://peoplepill.com/people/eleanor-arnason/", "page_content": "Eleanor Atwood Arnason (born December 28, 1942) is an American author of science fiction novels and short stories.\n\nArnason's earliest published story, \"A Clear Day in the Motor City\", appeared in New Worlds in 1973. Her work often depicts cultural change and conflict, usually from the viewpoint of characters who cannot or will not live by their own societies' rules. This anthropological focus has led many to compare her fiction to that of Ursula K. Le Guin.\n\nArnason won the inaugural James Tiptree Jr. Award in 1991 and the 1992 Mythopoeic Award for A Woman of the Iron People and in 2000 won the Gaylactic Spectrum Award for Best Short Fiction for \"Dapple\" and the HOMer Award for her novelette Stellar Harvest. Stellar Harvest was also nominated for a Hugo Award in 2000. In 2003, she was nominated for two Nebula Awards for her novella Potter of Bones and her short story \"Knapsack Poems\". In 2004, she was guest of honor at Wiscon. She lives in Minnesota.\n\nBackground\n\nEleanor Arnason is the daughter of H. Harvard Arnason, a Canadian-born man of Icelandic descent, who worked as an art historian and became the director of the Walker Art Center in Minneapolis, Minnesota, in 1951, and Elizabeth Hickcox Yard Arnason, a social worker by profession who spent her childhood in a missionary community in western China. Arnason is the niece of the American feminist Molly Yard and her maternal grandparents were both Methodist missionaries. This Methodist influence would be visible in her works, most notably in Ring of Swords.\n\nFrom 1949 to 1960, Arnason and her parents lived in Walker's \"Idea House #2\", a futuristic dwelling built next to the Walker Art Center. [1] Arnason has said that her experience growing up around avant-garde artists in a futurist house, in addition to the influence of her feminist, socialist mother contributed to her preoccupation with the future, and consequently science fiction. Prior to 1949, Arnason's family moved frequently: from New York City to Chicago; Washington, D.C.; London; Paris; and St. Paul, Minnesota.\n\nShe graduated from Swarthmore College in 1964, with a B.A. in art history, and continued her education in graduate school at the University of Minnesota, until 1967. She spent the next seven years working as an office clerk in Brooklyn and then Detroit. Her time in these blue-collar, racially diverse areas helped to shape her understanding about class consciousness, conflict, and revolution—notions that are reflected in her works. Arnason moved back to Minneapolis–Saint Paul in 1974 and continued to work in offices, warehouses, a large art museum, and more recently, a series of small nonprofits devoted to history, peace, justice, and art.\n\nSince 1994, she has shifted her literary focus from novels to short fiction. She retired in 2009 and now writes full-time.\n\nPolitics\n\nThe issues that transpire most in Arnason's life and writings encompass feminism, peace, social justice, support for the union movement and a deep belief that racism and all forms of prejudice should be opposed. City Pages labelled Arnason as a political radical.\n\nHaving come of age during Second-wave feminism, Arnason included gender and sexuality as central themes in her work, notably in her collection of Hwarhath stories, in which she \"wanted to create a society in which homosexual love was normal and heterosexual love was abnormal, sort of as a thought experiment. And because contemporary Americans have very rigid ideas of what is normal.\" The Hwarhath stories also addressed issues of gender roles and reproductive rights.\n\nShe was profoundly affected by the McCarthy period, particularly because of the ways that children were taught to securitize against nuclear annihilation. She became involved in the Student Peace Union and attended demonstrations during the Cuban Missile Crisis. Ring of Swords, Arnason's Hwarhath novel, illustrates peacebuilding after a long war; an endeavor both representative of Arnason's peace beliefs and of the make love, not war politics of the 1960s.\n\nIn 1963, Arnason went to the March on Washington for Jobs and Freedom with her mother. This had a profound impact that would be reflected in her story \"Big Brown Mama and Brer Rabbit\" in which Brer Rabbit transforms into an African-American man in the early 20th century. Arnason has often opted for racially diverse characters, including, but not limited to, a heroine of Chinese descent in A Woman of the Iron People and a Hispanic heroine in Ring of Swords. In addition, her Lydia Duluth stories present a future in which an overwhelming majority of humans have dark brown and black toned skins as the best protection against the radiation of many stars.\n\nArnason had intermittent activist politics outside of her work as an author, working in a campaign office in New York, collecting and transporting supplies for striking coal miners in Kentucky, becoming a local and national official in the National Writers Union and engaging in Minnesota Democratic–Farmer–Labor Party precinct politics.\n\nPublished works\n\nStandalone Novels\n\nThe Sword Smith (1978)\n\n(1978) To the Resurrection Station (1986)\n\n(1986) Daughter of the Bear King (1987)\n\n(1987) Woman of the Iron People series Part 1 In the Light of Sigma Draconis (1991) Part 2 Changing Women (1991) A Woman of the Iron People (1991)\n\n\n\nStandalone Short Stories\n\n\"A Clear Day in the Motor City\" (1973)\n\n\"The Warlord of Saturn's Moons\" (1974)\n\n\"Ace 167\" (1974)\n\n\"The House by the Sea\" (1975)\n\n\"The Face on the Barroom Floor\" (1976) with Ruth Berman\n\n\"Going Down\" (1977)\n\n\"A Ceremony of Discontent\" (1981)\n\n\"The Ivory Comb\" (1982)\n\n\"Glam's Story\" (1987)\n\n\"Among the Featherless Bipeds\" (1988)\n\n\"A Brief History of the Order of St. Cyprian the Athlete\" (1992)\n\n\"The Dog's Story\" (1996)\n\n\"The Venetian Method\" (1998)\n\n\"Feeding the Mother: A Hwarhath Religious Anecdote\" (1998)\n\n\"The Grammarian's Five Daughters\" (1999), available online\n\n\"Origin Story\" (2000)\n\n\"Moby Quilt\" (2001)\n\n\"The Lost Mother: A Story Told by the Divers\" (2002)\n\n\"Knapsack Poems\" (2002)\n\n\"The Potter of Bones\" (2002), available online\n\n\"Big Black mama and Tentacle Man\" (2003)\n\n\"Big Ugly Mama and the Zk\" (2003)\n\n\"Big Green Mama Falls in Love\" (2006) in Eidolon I (ed. Jonathan Strahan, Jeremy G. Byrne)\n\n(ed. Jonathan Strahan, Jeremy G. Byrne) \"The Diner\" (2008)\n\n\"Patrick and Mr. Bear: A True Story\" (2010)\n\n\"Mammoths of the Great Plains\" (2010)\n\n\"My Husband Steinn\" (2011)\n\n\"The Woman Who Fooled Death Five Times\" (2012)\n\n\"Big Red Mama in Time and Morris, Minnesota\" (2013)\n\n\"Big Brown Mama and Brer Rabbit\" (2013)\n\n\"Kormak the Lucky\" (2013)\n\n\"Ruins\" (2015) in Old Venus (anthology)\n\nHwarhath Stories\n\nRing of Swords (1993)\n\n(1993) \"The Hound of Merin\" (1993)\n\n\"The Semen Thief\" (1994)\n\n\"The Lovers\" (1994)\n\n\"The Small Black Box of Morality\" (1996)\n\n\"The Gauze Banner\" (1998)\n\n\"Dapple: A Hwarhath Historical Romance\" (1999)\n\n\"The Actors\" (1999)\n\n\"The Garden: A Hwarhath Science Fictional Romance\" (2004)\n\n\"Holmes Sherlock: A Hwarhath Mystery\" (2012) available online\n\nLydia Duluth stories\n\n\"Stellar Harvest\" (1999)\n\n\"The Cloud Man\" (2000)\n\n\"Lifeline\" (2001)\n\nTomb of the Fathers (2010)\n\nCollections\n\nOrdinary People (2005)\n\n(2005) Mammoths of the Great Plains (2010)\n\n(2010) Big Mama Stories (2013)\n\nAnthologies\n\nTime Gum and Other Poems from the Minicon Poetry Readings (1988), with Terry A. Garey\n\nPoems"}, {"url": "https://buzzlearn.com/eleanor-arnason/", "page_content": "Learn about Eleanor Arnason Net Worth, Biography, Age, Birthday, Height, Early Life, Family, Dating, Partner, Wiki, and Facts.\n\nWho is Eleanor Arnason:\n\nEleanor Arnason is a famous American writer of science fiction novels and short stories. She was born on December 28, 1942 and her birthplace is United States.\n\nOn Buzzlearn.com, Eleanor is listed as a successful Writer who was born in the year of 1942. She is also ranked in the richest person list from United States. Her first name is “Eleanor” and her last name is “Arnason”.\n\nBiography:\n\nBio / Wiki Full Name Eleanor Arnason Occupation Writer Age 80 Date of Birth December 28, 1942 Place of Birth United States Star Sign Capricorn Country United States Gender Female\n\nBirthday, Age & Zodiac Sign:\n\nEleanor Arnason’s birthday is on 28-Dec-1942 and was born on Monday. She is 80 years old. Eleanor sun sign is Capricorn and her birth flower is Narcissus & Holly.\n\nBirthdate 28-Dec Day of Birth Monday Year of Birth 1942 Birth Sign Capricorn Birth Sign Duality Passive Birth Sign Modality & Element Cardinal Earth Opposite Sign Cancer\n\nHeight, Weight & Physical Stats:\n\nBody measurements informations are given below:\n\nHeight N/A Weight N/A Bust N/A Waist N/A Hip N/A Hair Color N/A Eye Color N/A Shoe Size N/A\n\nEarly Life and Family:\n\nFamily Information Parents Name Not known Spouse Name Not known Children Name Unknown Number of Children(s) Not available Partner Name N/A Relative(s) Name N/A\n\nEducation:\n\nEducation N/A Alma mater N/A University N/A College N/A High School N/A School N/A\n\nEleanor Arnason Net Worth:\n\nEleanor Arnason’s net worth or net income is estimated to be $1 million – $3 million dollars. She has made such an amount of wealth from her primary career as a Writer.\n\nNet Worth $1 million – $3 million Annual Salary Under review Source of Income Writer Verification Status of Wealth Not verified\n\nDead or Alive?\n\nAccording to our database, Eleanor Arnason is still alive..\n\nQuick Facts:\n\nHere are some interesting facts about Eleanor Arnason:\n\n* She is originated from United States.\n\n* Her Star sign is Capricorn and zodiac sign element is Earth.\n\n* Her duality is Passive and opposite sun sign is Cancer.\n\nFrequently Asked Questions (FAQs):\n\nWhy is Eleanor Arnason famous? She is famous for being a successful Writer. Where is she from? She is from United States. How tall is she? Her height is not available. How much does she earn? Her estimated earning is $1 million – $3 million. Is she married? Marital status is not available. How many children(s) does she have? Not available.\n\nReference: Wiki and Newspapers."}, {"url": "https://eleanorarnason.com/about/", "page_content": "Please share!\n\nEleanor Arnason was born in Manhattan and grew up in New York, Chicago, London, Paris, Washington DC, Honolulu, St. Paul and Minneapolis. She received a BA in art history from Swarthmore College and did graduate work at the University of Minnesota, before quitting to learn about life outside art museums and institutions of higher learning. She made her first professional sale in 1972 while living in the Detroit inner city. Since then she has published six novels and over forty works of short fiction. Her fourth novel, A Woman of the Iron People (2001), won the James Tiptree Jr. award for gender-bending science fiction and the Mythopoeic Society Award for adult fantasy. Her fifth novel, Ring of Swords (1995), won a Minnesota Book Award. Since 1994 she has devoted herself to short fiction. Her story “Dapple” won the Spectrum Award for GLBT science fiction and was a finalist for the Sturgeon Award. Other stories have been finalists for the World Fantasy, Hugo and Nebula Awards.\n\nShe lives in Minnesota, where she used to make her living as the financial manager for a small arts nonprofit. Now she is retired. Aside from accounting and science fiction, her interests include politics, economics, bird-watching, driving down two-lane country highways and exploring the remains of the Great Lakes industrial belt.\n\nIn spite of all setbacks and adversity, she remains a lifelong fan of ordinary human decency and the international working class."}, {"url": "https://www.bookseriesinorder.com/eleanor-arnason/", "page_content": "Publication Order of Big Mama Books\n\nBig Black Mama and Tentacle Man (2003) Hardcover Paperback Kindle Big Ugly Mama and the Zk (2003) Hardcover Paperback Kindle Big Green Mama Falls in Love (2006) Hardcover Paperback Kindle Big Mama Stories (2013) Hardcover Paperback Kindle Big Brown Mama and Brer Rabbit (2013) Hardcover Paperback Kindle Big Red Mama in Time and Morris, Minnesota (2013) Hardcover Paperback Kindle\n\nChronological Order of Big Mama Books\n\nBig Black Mama and Tentacle Man (2003) Hardcover Paperback Kindle Big Ugly Mama and the Zk (2003) Hardcover Paperback Kindle Big Green Mama Falls in Love (2006) Hardcover Paperback Kindle Big Brown Mama and Brer Rabbit (2013) Hardcover Paperback Kindle Big Red Mama in Time and Morris, Minnesota (2013) Hardcover Paperback Kindle Big Mama Stories (2013) Hardcover Paperback Kindle\n\nPublication Order of Hwarhath Stories Books\n\nThe Hound of Merin (1993) Hardcover Paperback Kindle Ring of Swords (1993) Hardcover Paperback Kindle The Semen Thief (1994) Hardcover Paperback Kindle The Lovers (1994) Hardcover Paperback Kindle The Small Black Box of Morality (1996) Hardcover Paperback Kindle Feeding the Mother: A Hwarhath Religious Anecdote (1998) Hardcover Paperback Kindle The Gauze Banner (1998) Hardcover Paperback Kindle Dapple (1999) Hardcover Paperback Kindle The Actors (1999) Hardcover Paperback Kindle Origin Story (2000) Hardcover Paperback Kindle The Garden (2004) Hardcover Paperback Kindle The Woman Who Fooled Death Five Times (2012) Hardcover Paperback Kindle Holmes Sherlock (2012) Hardcover Paperback Kindle Hwarhath Stories: Transgressive Tales by Aliens (2016) Hardcover Paperback Kindle Some sources say that the standalone, The Potter of Bones, is a part of the Hwarhath Universe. You can find this book under Short Stories / Novellas.\n\nChronological Order of Hwarhath Stories Books\n\nRing of Swords (1993) Hardcover Paperback Kindle The Hound of Merin (1993) Hardcover Paperback Kindle The Semen Thief (1994) Hardcover Paperback Kindle The Lovers (1994) Hardcover Paperback Kindle The Small Black Box of Morality (1996) Hardcover Paperback Kindle The Gauze Banner (1998) Hardcover Paperback Kindle Dapple (1999) Hardcover Paperback Kindle The Actors (1999) Hardcover Paperback Kindle Origin Story (2000) Hardcover Paperback Kindle The Garden (2004) Hardcover Paperback Kindle The Woman Who Fooled Death Five Times (2012) Hardcover Paperback Kindle Holmes Sherlock (2012) Hardcover Paperback Kindle Hwarhath Stories: Transgressive Tales by Aliens (2016) Hardcover Paperback Kindle Feeding the Mother: A Hwarhath Religious Anecdote (1998) Hardcover Paperback Kindle\n\nPublication Order of Isaac Asimov's Anthology Books\n\nIsaac Asimov's Worlds of Science Fiction (By:Isaac Asimov,Tanith Lee,,Gene Wolfe,Barry B. Longyear,John M. Ford,,Alan Dean Foster,,Randall Garrett,,,George Scithers) (1980) Hardcover Paperback Kindle Isaac Asimov's Near Futures and Far (By:Isaac Asimov,Frederik Pohl,,Barry B. Longyear,John M. Ford,Jack Williamson,,John Brunner,,,,,,,Somtow Sucharitkul,,,George Scithers) (1981) Hardcover Paperback Kindle Isaac Asimov's Space of Her Own (By:Connie Willis,Ursula K. Le Guin,Pat Cadigan,Joan D. Vinge,Tanith Lee,Pamela Sargent,,Mary Gentle) (1983) Hardcover Paperback Kindle Isaac Asimov's Fantasy! (By:) (1985) Hardcover Paperback Kindle Isaac Asimov's Fantasy! (By:Connie Willis,George R.R. Martin,Ron Goulart,John Kessel,George Alec Effinger,Robert Thurston,Tanith Lee,Lucius Shepard,,Lillian Carl) (1989) Hardcover Paperback Kindle Isaac Asimov's Aliens (By:Isaac Asimov,Gardner Dozois) (1991) Hardcover Paperback Kindle Isaac Asimov's Robots (By:Isaac Asimov) (1991) Hardcover Paperback Kindle Isaac Asimov's SF-Lite (By:Isaac Asimov,John M. Ford) (1993) Hardcover Paperback Kindle Isaac Asimov's War (By:Isaac Asimov,Gardner Dozois) (1993) Hardcover Paperback Kindle Isaac Asimov's Cyberdreams (By:Isaac Asimov,Gardner Dozois) (1994) Hardcover Paperback Kindle Isaac Asimov's Skin Deep (By:Isaac Asimov,Gardner Dozois) (1995) Hardcover Paperback Kindle Isaac Asimov's Ghosts (By:Isaac Asimov,Terry Bisson) (1995) Hardcover Paperback Kindle Isaac Asimov's Christmas (By:Isaac Asimov,Gardner Dozois) (1997) Hardcover Paperback Kindle Isaac Asimov's Camelot (With: Isaac Asimov,Gardner Dozois) (1998) Hardcover Paperback Kindle Isaac Asimov's Detectives (By:Isaac Asimov,Gardner Dozois) (1998) Hardcover Paperback Kindle Isaac Asimov's Valentines (By:Isaac Asimov,Terry Bisson) (1999) Hardcover Paperback Kindle Isaac Asimov's Werewolves (By:Isaac Asimov,Suzy McKee Charnas,Gardner Dozois) (1999) Hardcover Paperback Kindle Isaac Asimov's Solar System (By:Gardner Dozois) (1999) Hardcover Paperback Kindle Isaac Asimov's Utopias (By:Isaac Asimov,Gardner Dozois) (2000) Hardcover Paperback Kindle Isaac Asimov's Father Day (By:Isaac Asimov,Gardner Dozois) (2001) Hardcover Paperback Kindle Isaac Asimov's Halloween (By:Isaac Asimov) (2001) Hardcover Paperback Kindle\n\nPublication Order of Lydia Duluth Books\n\nStellar Harvest (1999) Hardcover Paperback Kindle The Cloud Man (2000) Hardcover Paperback Kindle Moby Quilt (2001) Hardcover Paperback Kindle Lifeline (2001) Hardcover Paperback Kindle Tomb of the Fathers (2010) Hardcover Paperback Kindle Checkerboard Planet (2016) Hardcover Paperback Kindle Tunnels (2020) Hardcover Paperback Kindle\n\nPublication Order of Outspoken Authors Books\n\nThe Human Front (By:Ken MacLeod) (2001) Hardcover Paperback Kindle The Left Left Behind (With: Terry Bisson) (2009) Hardcover Paperback Kindle Lucky Strike (By:Kim Stanley Robinson) (2009) Hardcover Paperback Kindle The Underbelly (With: Gary Phillips) (2010) Hardcover Paperback Kindle Mammoths of the Great Plains (2010) Hardcover Paperback Kindle The Wild Girls (With: Ursula K. Le Guin) (2011) Hardcover Paperback Kindle Modem Times 2.0 (With: Michael Moorcock) (2011) Hardcover Paperback Kindle The Great Big Beautiful Tomorrow (With: Cory Doctorow) (2011) Hardcover Paperback Kindle Surfing the Gnarl (With: Rudy Rucker) (2012) Hardcover Paperback Kindle Report from Planet Midnight (With: Nalo Hopkinson) (2012) Hardcover Paperback Kindle The Science of Herself (With: Karen Joy Fowler) (2013) Hardcover Paperback Kindle Patty Hearst & The Twinkie Murders: A Tale of Two Trials (With: Paul Krassner) (2013) Hardcover Paperback Kindle New Taboos (By:John Shirley) (2013) Hardcover Paperback Kindle Raising Hell (With: ) (2014) Hardcover Paperback Kindle My Life, My Body (By:Marge Piercy) (2015) Hardcover Paperback Kindle Gypsy (With: ) (2015) Hardcover Paperback Kindle Miracles Ain't What They Used to Be (With: Joe R. Lansdale) (2016) Hardcover Paperback Kindle Fire. (With: Elizabeth Hand) (2017) Hardcover Paperback Kindle Totalitopia (By:John Crowley) (2017) Hardcover Paperback Kindle The Atheist in the Attic (With: Samuel R. Delany) (2018) Hardcover Paperback Kindle Thoreau's Microscope (With: Michael Blumlein) (2018) Hardcover Paperback Kindle The Beatrix Gates (By:Rachel Pollack) (2019) Hardcover Paperback Kindle A City Made of Words (By:Paul Park) (2019) Hardcover Paperback Kindle\n\nPublication Order of Star Trek Adventures Books\n\nwith James Blish, Ruth Berman, Jack C. Haldeman II, Theodore R. Cogswell, J.A. Lawrence, Joe Haldeman, Gordon Eklund, Stephen Goldin, Kathleen Sky, Sondra Marshak, Myrna Culbreath\n\nSpock Must Die! (By:James Blish) (1970) Hardcover Paperback Kindle Star Trek: The New Voyages (With: ,Sondra Marshak,Myrna Culbreath) (1976) Hardcover Paperback Kindle Spock, Messiah! (By:Theodore R. Cogswell) (1976) Hardcover Paperback Kindle The Price of the Phoenix (By:Sondra Marshak,Myrna Culbreath) (1977) Hardcover Paperback Kindle Planet of Judgment (By:Joe Haldeman) (1977) Hardcover Paperback Kindle Star Trek: The New Voyages 2 (By:Sondra Marshak,Myrna Culbreath) (1977) Hardcover Paperback Kindle Mudd's Angels (By:J.A. Lawrence) (1978) Hardcover Paperback Kindle Vulcan! (By:Kathleen Sky) (1978) Hardcover Paperback Kindle The Starless World (By:Gordon Eklund) (1978) Hardcover Paperback Kindle Trek to Madworld (By:Stephen Goldin) (1979) Hardcover Paperback Kindle World Without End (By:Joe Haldeman) (1979) Hardcover Paperback Kindle The Fate of the Phoenix (By:Sondra Marshak,Myrna Culbreath) (1979) Hardcover Paperback Kindle Devil World (By:Gordon Eklund) (1979) Hardcover Paperback Kindle Perry's Planet (By:Jack C. Haldeman II) (1980) Hardcover Paperback Kindle Death's Angel (By:Kathleen Sky) (1981) Hardcover Paperback Kindle\n\nPublication Order of Standalone Novels\n\nThe Sword Smith (1978) Hardcover Paperback Kindle To the Resurrection Station (1986) Hardcover Paperback Kindle Daughter of the Bear King (1987) Hardcover Paperback Kindle A Woman of the Iron People (1991) Hardcover Paperback Kindle\n\nPublication Order of Short Stories/Novellas\n\nA Clear Day in the Motor City (1973) Hardcover Paperback Kindle The Warlords of Saturn's Moons (1974) Hardcover Paperback Kindle Ace 167 (1974) Hardcover Paperback Kindle The House by the Sea (1975) Hardcover Paperback Kindle The Face on the Barroom Floor (With: Ruth Berman) (1976) Hardcover Paperback Kindle Going Down (1977) Hardcover Paperback Kindle A Ceremony of Discontent (1981) Hardcover Paperback Kindle The Ivory Comb (1982) Hardcover Paperback Kindle Glam's Story (1987) Hardcover Paperback Kindle Among the Featherless Bipeds (1988) Hardcover Paperback Kindle A Brief History of the Order of St. Cyprian the Athlete (1992) Hardcover Paperback Kindle The Dog's Story (1996) Hardcover Paperback Kindle The Venetian Method (1998) Hardcover Paperback Kindle The Grammarian's Five Daughters (1999) Hardcover Paperback Kindle The Potter of Bones (2002) Hardcover Paperback Kindle The Lost Mother: A Story Told by the Divers (2002) Hardcover Paperback Kindle Knapsack Poems (2002) Hardcover Paperback Kindle The Diner (2008) Hardcover Paperback Kindle Patrick and Mr. Bear: A True Story (2010) Hardcover Paperback Kindle My Husband Steinn (2011) Hardcover Paperback Kindle Kormak the Lucky (2013) Hardcover Paperback Kindle The Hat Maker of God (2014) Hardcover Paperback Kindle The Scrivener (2014) Hardcover Paperback Kindle The Black School (2014) Hardcover Paperback Kindle The Puffin Hunter (2014) Hardcover Paperback Kindle Telling Stories to the Sky (2014) Hardcover Paperback Kindle Ruins (2015) Hardcover Paperback Kindle Daisy (2017) Hardcover Paperback Kindle Mines (2017) Hardcover Paperback Kindle Loft the Sorcerer (2018) Hardcover Paperback Kindle Laki (2021) Hardcover Paperback Kindle The Graveyard (2021) Hardcover Paperback Kindle Grandmother Troll (2022) Hardcover Paperback Kindle\n\nPublication Order of Short Story Collections\n\nOrdinary People (2005) Hardcover Paperback Kindle The Land of Ordinary People (2005) Hardcover Paperback Kindle Hidden Folk (2014) Hardcover Paperback Kindle\n\nPublication Order of Eleanor Arnason Poems Books\n\nOn Writing (1986) Hardcover Paperback Kindle On the Border (1986) Hardcover Paperback Kindle There Was an Old Lady... (1987) Hardcover Paperback Kindle Clean House Poem (1988) Hardcover Paperback Kindle Mars Poem (1988) Hardcover Paperback Kindle Poem Written After I Read an Article Which Argued That Birds Are Descended From Dinosaurs (1988) Hardcover Paperback Kindle Dragon Poem (1989) Hardcover Paperback Kindle Amnita and the Giant Stinginess (1990) Hardcover Paperback Kindle A Dark Night in November ... (1990) Hardcover Paperback Kindle A Poem to Drive Monsters Away (1990) Hardcover Paperback Kindle Bear Song (1990) Hardcover Paperback Kindle Love Song (1990) Hardcover Paperback Kindle The Glutton: A Goxhat Accounting Chant (2001) Hardcover Paperback Kindle Song from the Kalevala (2003) Hardcover Paperback Kindle Colline\\'s Coat (2003) Hardcover Paperback Kindle On Seeing Bellini\\'s Opera The Capulets and Montagues... (2003) Hardcover Paperback Kindle The Land of Ordinary People (2005) Hardcover Paperback Kindle\n\nPublication Order of Conversation Pieces Books\n\nAlien Bootlegger (By:) (1993) Hardcover Paperback Kindle Counting on Wildflowers (By:) (2005) Hardcover Paperback Kindle Ordinary People (2005) Hardcover Paperback Kindle Candle in a Bottle (By:) (2006) Hardcover Paperback Kindle Absolute Uncertainty (By:Lucy Sussex) (2006) Hardcover Paperback Kindle Knots (By:Wendy Walker) (2006) Hardcover Paperback Kindle Aliens of the Heart (By:) (2007) Hardcover Paperback Kindle Voices from Fairyland (By:Theodora Goss) (2008) Hardcover Paperback Kindle Three Observations and a Dialogue (By:) (2010) Hardcover Paperback Kindle Through the Drowsy Dark (By:Rachel Swirsky) (2010) Hardcover Paperback Kindle Slightly Behind and to the Left (By:) (2010) Hardcover Paperback Kindle With Her Body (By:Nicola Griffith) (2011) Hardcover Paperback Kindle The Red Rose Rages (By:L. Timmel Duchamp) (2011) Hardcover Paperback Kindle The Grand Conversation (By:L. Timmel Duchamp) (2011) Hardcover Paperback Kindle Aliens of the Heart (By:) (2011) Hardcover Paperback Kindle Distances (By:) (2011) Hardcover Paperback Kindle Shotgun Lullabies (By:) (2011) Hardcover Paperback Kindle Of Love and Other Monsters (By:) (2011) Hardcover Paperback Kindle De Secretis Mulierum (By:L. Timmel Duchamp) (2011) Hardcover Paperback Kindle A Brood of Foxes (By:) (2011) Hardcover Paperback Kindle The Adventures of the Faithful Counselor (By:) (2011) Hardcover Paperback Kindle Writing the Other (By:) (2011) Hardcover Paperback Kindle The Bone Spindle (By:) (2011) Hardcover Paperback Kindle Talking Back (By:) (2011) Hardcover Paperback Kindle The Last Letter (By:) (2011) Hardcover Paperback Kindle Making Love in Madrid (By:) (2012) Hardcover Paperback Kindle We Wuz Pushed (By:Lee Mandelo) (2012) Hardcover Paperback Kindle The Traveling Tide (By:) (2012) Hardcover Paperback Kindle The Receptionist (By:) (2012) Hardcover Paperback Kindle Birds and Birthdays (By:) (2012) Hardcover Paperback Kindle Naomi Mitchison (By:) (2012) Hardcover Paperback Kindle The Queen, the Cambion, and Seven Others (By:) (2013) Hardcover Paperback Kindle Spring in Geneva (By:) (2013) Hardcover Paperback Kindle The XY Conspiracy (By:) (2013) Hardcover Paperback Kindle Myths, Metaphors, and Science Fiction (By:Sheila Finch) (2014) Hardcover Paperback Kindle Numa: An Epic Poem with Photo Collages (By:) (2014) Hardcover Paperback Kindle NoFood (By:Sarah Tolmie) (2014) Hardcover Paperback Kindle The Haunted Girl (By:) (2014) Hardcover Paperback Kindle Three Songs for Roxy (By:) (2015) Hardcover Paperback Kindle Ghost Signs (By:) (2015) Hardcover Paperback Kindle The Prince of the Aquamarines (By:) (2015) Hardcover Paperback Kindle Back, Belly, and Side: True Lies and False Tales (By:) (2015) Hardcover Paperback Kindle A Day in Deep Freeze (By:) (2015) Hardcover Paperback Kindle Marginalia to Stone Bird (By:R.B. Lemberg) (2016) Hardcover Paperback Kindle Unpronounceable (By:) (2016) Hardcover Paperback Kindle Sleeping Under the Tree of Life (By:) (2016) Hardcover Paperback Kindle Other Places (By:) (2016) Hardcover Paperback Kindle Monteverde (By:Lawrence Schimel) (2016) Hardcover Paperback Kindle The Adventure of the Incognita Countess (By:) (2017) Hardcover Paperback Kindle Boundaries, Border Crossings, and Reinventing the Future (By:) (2017) Hardcover Paperback Kindle A Field Guide to the Spirits (By:) (2017) Hardcover Paperback Kindle Liberating the Astronauts (By:) (2017) Hardcover Paperback Kindle In Search of Lost Time (By:) (2017) Hardcover Paperback Kindle We, Robots (By:) (2017) Hardcover Paperback Kindle In Search of Lost Time (By:) (2017) Hardcover Paperback Kindle Cosmovore (By:) (2017) Hardcover Paperback Kindle Helen's Story (By:) (2017) Hardcover Paperback Kindle Liminal Spaces (By:) (2018) Hardcover Paperback Kindle Feed Me the Bones of Our Saints (By:) (2018) Hardcover Paperback Kindle If Not Skin (By:) (2018) Hardcover Paperback Kindle Changeling (By:) (2018) Hardcover Paperback Kindle The Adventure of the Dux Bellorum (By:) (2018) Hardcover Paperback Kindle People Change (By:) (2018) Hardcover Paperback Kindle Invocabulary (By:) (2018) Hardcover Paperback Kindle The Green and Growing (By:) (2019) Hardcover Paperback Kindle Everything is Made of Letters (By:) (2019) Hardcover Paperback Kindle Midnight at the Organporium (By:) (2019) Hardcover Paperback Kindle Algorithmic Shapeshifting (By:) (2019) Hardcover Paperback Kindle The Rampant (By:) (2019) Hardcover Paperback Kindle Mary Shelley Makes a Monster (By:) (2019) Hardcover Paperback Kindle Articulation (By:) (2019) Hardcover Paperback Kindle City of a Thousand Feelings (By:) (2020) Hardcover Paperback Kindle The Adventure of the Naked Guide (By:) (2020) Hardcover Paperback Kindle Ancient Songs of Us (By:) (2020) Hardcover Paperback Kindle Sacred Summer (By:) (2020) Hardcover Paperback Kindle Disease (By:Sarah Tolmie) (2020) Hardcover Paperback Kindle Goddess Bandit of the Thousand Arms (By:) (2020) Hardcover Paperback Kindle Resistance and Transformation (By:) (2021) Hardcover Paperback Kindle The Silences of Ararat (By:L. Timmel Duchamp) (2021) Hardcover Paperback Kindle Cabinet of Wrath (By:) (2021) Hardcover Paperback Kindle The Adventure of the Golden Woman (By:) (2021) Hardcover Paperback Kindle Fricatives (By:) (2021) Hardcover Paperback Kindle We’ve Been Here Before (By:) (2022) Hardcover Paperback Kindle Bilabials (By:) (2022) Hardcover Paperback Kindle When Home, No Need to Cry (By:) (2022) Hardcover Paperback Kindle Apollo Weeps (By:) (2023) Hardcover Paperback Kindle To the Woman in the Pink Hat (By:) (2023) Hardcover Paperback Kindle From Voyages Unreturning (By:) (2023) Hardcover Paperback Kindle\n\nPublication Order of Baldemar Books\n\nwith C.C. Finlay\n\nDaisy (2017) Hardcover Paperback Kindle\n\nPublication Order of Anthologies\n\nNew Worlds (1974) Hardcover Paperback Kindle Amazons II (1982) Hardcover Paperback Kindle Time Gum and Other Poems from the Minicon Poetry Readings (1988) Hardcover Paperback Kindle The Norton Book of Science Fiction (1993) Hardcover Paperback Kindle Asimov's Science Fiction, May 1996 (1996) Hardcover Paperback Kindle More Amazing Stories (1998) Hardcover Paperback Kindle Isaac Asimov's Camelot (1998) Hardcover Paperback Kindle Asimov's Science Fiction, April 1999 (1999) Hardcover Paperback Kindle Best of the Rest 2: The Best Unknown Science Fiction and Fantasy of 1998 (1999) Hardcover Paperback Kindle Asimov's Science Fiction Magazine, October/November 2000 (2000) Hardcover Paperback Kindle Tales of the Unanticipated #22 2 (2001) Hardcover Paperback Kindle Tales of the Unanticipated #23 (2002) Hardcover Paperback Kindle The Mammoth Book of Best New SF 15 (2002) Hardcover Paperback Kindle Year's Best SF 8 (2003) Hardcover Paperback Kindle The Mammoth Book of Best New SF 16 (2003) Hardcover Paperback Kindle Tales of the Unanticipated, Number 30: The Anthology of TOTU Ink (2010) Hardcover Paperback Kindle The Year's Best Science Fiction & Fantasy, 2014 (2013) Hardcover Paperback Kindle Aliens: Recent Encounters (2013) Hardcover Paperback Kindle Best New SF 26 (2013) Hardcover Paperback Kindle Lightspeed Magazine, June 2014: Women Destroy Science Fiction! Special Issue (2014) Hardcover Paperback Kindle Old Venus of Stories (2015) Hardcover Paperback Kindle The Year's Best Science Fiction & Fantasy: 2015 (2015) Hardcover Paperback Kindle Lightspeed Magazine, July 2015 (2015) Hardcover Paperback Kindle Sisters of the Revolution: A Feminist Speculative Fiction Anthology (2015) Hardcover Paperback Kindle The Year's Best Science Fiction: Thirty-Third Annual Collection (2016) Hardcover Paperback Kindle The Year's Best Science Fiction: Thirty-Fourth Annual Collection (2017) Hardcover Paperback Kindle Infinity Wars (2017) Hardcover Paperback Kindle The Book of Magic (2018) Hardcover Paperback Kindle Orbit 15 (2022) Hardcover Paperback Kindle Orbit 16 (2022) Hardcover Paperback Kindle Orbit 19 (2022) Hardcover Paperback Kindle\n\nBook links take you to Amazon. As an Amazon Associate I earn money from qualifying purchases.\n\nEleanor Arnason is a published American author of fiction known for her science fiction books and her short stories.\n\nShe was born on December 28, 1942 in Manhattan. She got her career started early when her first published story was featured in New Worlds in 1973. It is titled “A Clear Day in the Motor City”.\n\nThe author grew up in various cities around the world, from Paris to London, Chicago, New York, Washington D.C., St. Paul, Minneapolis, and Honolulu. Today the author resides in Minnesota.\n\nShe attended Swarthmore College where she would graduate with her BA in art history. She went to the University of Minnesota to do grad work before she stopped and dropped out so she could learn more about life outside of colleges and art museums. Amason was residing in the inner city of Detroit when she made her first professional sale.\n\nSince then she has published several of her novels and over forty short stories and short fiction works. Her novel A Woman of the Iron People got her the James Tiptree Jr. Award. It also received the adult fantasy Mythopoeic Society Award. She also won a Minnesota Book Award for her fifth novel, a 1995 release titled Ring of Swords.\n\nThe author made the decision to pay extra attention to her work writing short fiction. A short story by the author called “Dapple” was a finalist for the Sturgeon Award and won the Gaylactic Spectrum Award for LGBT science fiction. She has also written several more works of short fiction that have been finalists for the Hugo Award, the Nebula Award, and the World Fantasy Award. Her novella Potter of Bones earned her the nomination for two Nebula Awards in 2003. Her novella Stellar Harvest won her the HOMer Award.\n\nShe is known for having work that often focuses on conflict and cultural change. This is all from the point of view of characters that choose not to abide by the rules of their society. It is a unique anthropological view that has caused many to compare her works to those of author Ursula K. Le Guin.\n\nThe author was the guest of honor in 2004 at Wiscon.\n\nShe was born to her parents, Elizabeth Hickcox Yard Amason and H. Harvard Amason. Her father was born in Canada and had Icelandic roots. Her father was an art historian and served as the Walker Art Center’s director in Minneapolis, Minnesota. Her mother worked as a social worker and had spent her time growing up in a western Chinese missionary community center.\n\nThe author is also the niece of Molly Yard, a noted American feminist. Both of her grandparents on her mother’s side were missionaries of the Methodist variety. This topic of being Methodist would come into the author’s writing, especially in her novel Ring of Swords.\n\nFor eleven years, the author resided along with her parents in a building next to the Walker Art Center known as Idea House #2, which was designed to be a futuristic dwelling. Many times Eleanor would credit growing up in this house and continually being around avant-garde artists as well as a mother who was a feminist and a socialist to inspiring her to think about the future and then science fiction. Before living here, her family went all over the world.\n\nUpon leaving graduate school, Eleanor worked as an office clerk in the city of Brooklyn and then later Detroit. Spending some time in these places that were so typically blue-collar and had much diversity helped give her an idea about class consciousness and conflict as well as revolution, all which filtered into her writing.\n\nIt was 1974 that she moved back to the Minneapolis and Saint Paul area. She obtained jobs in offices, warehouses, working in an art museum, and later working with different small nonprofits that were devoted to varied topics that included justice, peace, history, and art. Eleanor decided to retire in 2009 and writes on a full time basis now.\n\nHer writing focuses on a variety of topics, from social justice to peace to feminism and even the union movement. She believes that racism and all types of prejudice are wrong and should be opposed. She was called a political radical by City Pages. It was due to her growing up in an age of second wave feminism that helped make her aware of sexuality and gender and this comes through in her work, particularly in her Hwarhath stories, where gender roles and reproductive rights are also included. There she wanted to come up with a society where the tables are turned and homosexual love is considered normal and heterosexual love is seen as abnormal.\n\nThe McCarthy period had a profound impact on her life, especially since kids were taught (often fruitless) methods of what to do when faced with nuclear annihilation. She became part of the Student Peace Union and whilst the Cuban Missile Crisis was going on attended various demonstrations. Her Ring of Swords novel shows building peace after a long war, something that aligns with the author’s peace beliefs.\n\nShe went to the March on Washington for Jobs and Freedom in 1963 along with her mother. This experience and the impact of it would be recorded in “Big Brown Mama and Brer Rabbit” where Brer changes into an African-American man alive in the twentieth century. She has also had diverse characters in many of her stories, including a female Chinese protagonist in A Woman of the Iron People and a female Hispanic protagonist in Ring of Swords. Her stories of Lydia Duluth also have many characters of other races. Although in that story, the darker skin offers up the best defense against radiation from the stars.\n\nShe has been an activist outside of writing and has even worked in New York in a campaign office and moving supplies in Kentucky for striking coal miners. She is also an official member of the National Writers Union.\n\nEleanor Amason is the creator and author of the Hwarhath series. This series got started with Ring of Swords. The series is continued with Hwarhath Stories: Transgressive Tales by Aliens.\n\nIn Ring of Swords, Earth has been dealing with being on the edge of war with an alien race for fifty years. The Hwarhath aliens are a fascinating race. Anna Perez is a biologist that finds out the truth. The aliens have divided up their society by gender, so that the strong and war-ready males do not hurt the women and children.\n\nThe aliens view human beings as being a barbaric race that do not have honor. In their eyes, humans deserve to be eliminated. What will happen? Read this book to find out!\n\nHwarhath Stories: Transgressive Tales by Aliens is the second novel in this series. This is a book that is said to be written by the hwarhath themselves after they have contacted humans.\n\nTheir stories have been collected by humans in the anthropology field and are being displayed for the first time. If you loved Ring of Swords, check out this unique novel for yourself and enjoy every word!"}], "Eleanor Arnason is a science fiction and fantasy writer.": [{"url": "https://www.goodreads.com/author/show/108548.Eleanor_Arnason", "page_content": "Eleanor Arnason\n\nBorn\n\nJanuary 01, 1942\n\nGenre\n\nEleanor Atwood Arnason (born 1942) is an American author of science fiction novels and short stories. From 1949 to 1961, Arnason and her parents lived in \"Idea House #2,\" a futuristic dwelling built by the Walker Art Center. Arnason's earliest published story appeared in New Worlds in 1972. Her work often depicts cultural change and conflict, usually from the viewpoint of characters who cannot or will not live by their own societies' rules.\n\nEleanor Atwood Arnason (born 1942) is an American author of science fiction novels and short stories. From 1949 to 1961, Arnason and her parents lived in \"Idea House #2,\" a futuristic dwelling built by the Walker Art Center. Arnason's earliest published story appeared in New Worlds in 1972. Her work often depicts cultural change and conflict, usually from the viewpoint of characters who cannot or will not live by their own societies' rules."}, {"url": "http://eleanorarnason.com/about/", "page_content": "Please share!\n\nEleanor Arnason was born in Manhattan and grew up in New York, Chicago, London, Paris, Washington DC, Honolulu, St. Paul and Minneapolis. She received a BA in art history from Swarthmore College and did graduate work at the University of Minnesota, before quitting to learn about life outside art museums and institutions of higher learning. She made her first professional sale in 1972 while living in the Detroit inner city. Since then she has published six novels and over forty works of short fiction. Her fourth novel, A Woman of the Iron People (2001), won the James Tiptree Jr. award for gender-bending science fiction and the Mythopoeic Society Award for adult fantasy. Her fifth novel, Ring of Swords (1995), won a Minnesota Book Award. Since 1994 she has devoted herself to short fiction. Her story “Dapple” won the Spectrum Award for GLBT science fiction and was a finalist for the Sturgeon Award. Other stories have been finalists for the World Fantasy, Hugo and Nebula Awards.\n\nShe lives in Minnesota, where she used to make her living as the financial manager for a small arts nonprofit. Now she is retired. Aside from accounting and science fiction, her interests include politics, economics, bird-watching, driving down two-lane country highways and exploring the remains of the Great Lakes industrial belt.\n\nIn spite of all setbacks and adversity, she remains a lifelong fan of ordinary human decency and the international working class."}, {"url": "https://locusmag.com/2016/09/eleanor-arnason-unfolding/", "page_content": "‘‘We have a split in the 20th century between genre fiction, which tends to be about action, and fiction that’s about interpersonal relationships and psychology. At a Chicago convention decades ago, Gene Wolfe said that every time he encounters people who say the most important things happen within their heads, he wants to put them in a small boat on the ocean in the middle of the storm. This connects to my prejudices about mainstream literary fiction.\n\n‘‘I’ve always read science fiction and fantasy and murder mysteries. I was an English major most of the way through college, and I read The Great Gatsby and Dubliners and Portrait of the Artist as a Young Man and some of Proust in French, so I got a reasonable background in mainstream literature. But it didn’t interest me the way that science fiction did. My problem with realism is that a realistic novel about the psychological problems of middle-class people is a story which is very similar to the life I’m leading, and thus is not too interesting. Whereas the minute you throw in a dragon or global warming, it becomes very interesting. Internal thoughts become much less important, and you basically want to deal with the dragon.”\n\n…\n\n‘‘My father’s parents came from Iceland to North America, and I grew up in a house full of books on Norse mythology, the Icelandic sagas, and the novels of the great 20th-century Icelandic writer Halldór Laxness. (I have a copy of his novel Independent People inscribed to my father. Laxness misspelled my father’s name.) I have a thing about Iceland, especially the medieval lit­erature, and I have come to love Icelandic folklore. Hidden Folk, which came out early in 2015, is a collection of stories based on Icelandic folklore and literature.\n\n‘‘Icelanders don’t have princes and princesses – Iceland was too poor for royalty, even in folktales. Instead, there are trolls, elves, ghosts, outlaws, and ministers who study the black arts. Hidden Folk is very much my own version of Icelandic tales. My elves are unpleasant upper-class types. My trolls are poor farmers and workers, barely surviving. My humans are a mixed lot: farmers and farmwives, students of the magical arts, slaves, a writer, a cop. Over the years, I wrote five Icelandic fantasies – six since the collection was published, and I’m work­ing on a seventh.”\n\n…\n\n‘‘Science fiction and fantasy have the appeal of strangeness, and of course science and technology are enormously important in science fiction. SF has been dealing with global warming consistently, while the presidential candidates have barely men­tioned it. There’s no question that it’s happening, and it’s going to be devastating. James Lovelock, who came up with the Gaia theory, has said we’re going to be down to a billion people by the end of the century.\n\n‘‘I read a lot projections of the future, and people never factor in enough. They project a population of nine billion, but they don’t factor in the Four Horsemen of the Apocalypse – famine, war, dis­ease, and death due to climate change. All they’re doing is a projection of where we’ve been. Science fiction, when it’s good, will pick up a whole bunch of these ideas at once. There was a panel at the 2016 Minicon about writing SF in which many things are changing, rather than just one. One of the things that makes me crazy about much hard SF is, you’re in the future with unbelievable physics that nobody now can understand… but everybody has names like Brad and Charles and they’re living the way we live now. That is nuts. Charles Stross’s early novels had more things happening than I could keep track of. They were stunning.”\n\n…\n\n‘‘Writing Ring of Swords was a lot of fun – it’s the fastest I’ve ever written a novel, and the first separate hwarhath story, ‘The Hound of Merin’, was also written at about the same time as the novel. Ring of Swords was going to be the first of a trilogy, and I wrote the second volume, but it was turned down by the publisher. It’s really hard to sell the middle book of a trilogy by itself, so I put it to the side. There were problems with the sequel, and I’m not happy with the way it turned out. (I now have a contract with Aqueduct Press for a revised version of the sequel, so it will finally come out.) I was frustrated with the trilogy, and I had a lot more information about the hwarhath, so I started writing short stories. These turned out to be stories written by hwarhath authors after they en­countered humanity, not only about the hwarhath, but about them thinking about their own culture, and in some cases thinking about humanity. The hwarhath are extremely rigid in many ways, and meeting a species very much like themselves but with different rules for male and female behavior leads the brighter among them to question what is the nature of men and women, and that underlies a lot of the stories.”\n\n…\n\n‘‘I have an alien species I’ve written a few stories about, the Goxhat, which are another attempt to look at social stereotypes or maybe ideas of self. In the early part of their culture there were teams, which would be a bunch of Goxhat hatched out of the same clutch of eggs. Each team thought of itself as ‘I,’ and no individual thought of itself as an individual. They come in four sexes, and a team could be all four sexes or one sex, and it’s all ‘I.’ My story ‘Knapsack Poems’ is about the Goxhat early in their history. As their culture evolved, their sense of ‘I’ got bigger, until the whole species became ‘I.’ They know that they are different bod­ies, but they don’t have a clear sense of themselves as individuals. They’re spacefaring, and they meet other species that don’t have their sense of oneness, so the problem becomes how the Goxhat can think about other species. They meet something that isn’t part of the ‘I’ – and what do they do about a species that is millions of ‘I’s?”\n\nRead the complete interview in the September 2016 issue of Locus Magazine. Interview design by Francesca Myman."}, {"url": "https://www.encyclopedia.com/arts/educational-magazines/arnason-eleanor-1942", "page_content": "Arnason, Eleanor 1942–\n\n(Eleanor Atwood Arnason)\n\nPERSONAL: Born 1942.\n\nCAREER: Writer. Accountant; has also worked as a clerk and warehouse employee.\n\nAWARDS, HONORS: Mythopoeic Fantasy Award (Adult), 1992, and James Tiptree, Jr., Award, both for A Woman of the Iron People; Homer Award for best novelette, 2000; Gaylactic Network Spectrum Award, 2000, for \"Dapple: A Hwarhath Historical Romance\"; Minnesota Book Award, for Ring of Swords.\n\nWRITINGS:\n\nSCIENCE FICTION NOVELS\n\nThe Sword Smith, Condor (New York, NY), 1978.\n\nTo the Resurrection Station, Avon (New York, NY), 1986.\n\nDaughter of the Bear King, Avon (New York, NY), 1987.\n\nA Woman of the Iron People, Morrow (New York, NY), 1991, published in two volumes as In the Light of Sigma Draconis, Avon (New York, NY), 1992, and Changing Women, Avon (New York, NY), 1992.\n\nRing of Swords, Tor (New York, NY), 1993.\n\nOTHER\n\n(Editor, with Terry A. Garey) Time Gum (poetry), 1988.\n\nOrdinary People (short stories), Aqueduct Press (Seattle, WA), 2005.\n\nWork represented in anthologies, including New Worlds Quarterly, edited by Michael Moorcock and Charles Platt, 1973, The Norton Book of Science Fiction, Norton (New York, NY), 1993, Women of Wonder, Vintage Books (New York, NY), 1995, Isaac Asimov's Camelot, Ace Books (New York, NY), 1998, and Isaac Asimov's Valentines, Ace Books (New York, NY), 1999. Author of \"Dapple: A Hwarhath Historical Romance.\" Contributor to periodicals.\n\nSIDELIGHTS: Eleanor Arnason is known as a successful science-fiction writer. In 1978, she published her first novel, the coming-of-age saga The Sword Smith, and readily established herself as a proficient stylist. Arnason followed The Sword Smith with To the Resurrection Station, which concerns romantic entanglements on a space colony. Belinda Smith, the tale's heroine, is a young woman capable of prompting bizarre physical changes in herself and others within range of her powers. Belinda is studying at a colony college when she is abruptly withdrawn from school and informed that a marriage has been arranged between herself and a native. Furthermore, Belinda is informed that she is herself half-native, half-Earthling. Complications ensue when Claude, the native to whom Belinda has been pledged in matrimony, falls in love with Belinda's college roommate, Marianne, who is, in turn, secretly married. After a series of adventures, Belinda and Claude, together with a helpful robot, arrive on Earth only to discover that most humans have been eliminated following a war with genetically engineered rats. More escapades ensue before Belinda, Claude, and the robot manage to escape from Earth and head into space.\n\nArnason next published Daughter of the Bear King, the story of Esperance Olson, a middle-aged Minneapolis homemaker who is electrocuted by her washing machine and consequently finds herself in an alternate world where she possesses magic powers, including the ability to transform herself into a bear. Olson is told by inhabitants of this other world that she actually hails from it too, and that, as daughter of the Bear King, she holds the ability to rid this other world of such creatures as dragons, cockroaches, and snail-chicken hybrids, all of whom threaten to overrun the world in plague-like numbers. Olson somehow manages a return to Minneapolis, only to be pursued by countless gruesome creatures that exert an unpleasant influence on the doings within her community. A reviewer for the Washington Post Book World proclaimed Daughter of the Bear King \"quite simply the most enjoyable fantasy novel I have ever read.\"\n\nA Woman of the Iron People, Arnason's next novel, was described by reviewer Richard Grant, writing in the Washington Post Book World, as \"good old-fashioned science fiction of a certain type,\" which he dubbed \"speculative anthropology.\" This tale, which was also published in two volumes as In the Light of Sigma Draconis and Changing Women, concerns a clash of cultures that commences after a team of eight Earthlings arrives on a faraway planet to study life there. The natives on this planet, although intelligent, are technologically inferior to the Earthlings. Their culture is a relatively primitive one in which natives abstain from sexual activity except during a brief mating period. At other times the native women and children devote themselves to handcrafts and live separate from the males. Complications develop when one of the human observers, Lixia, becomes drawn to Nia, a renegade female native whose conduct sometimes bears greater similarities to males then it does to her own gender. Grant, in his Washington Post Book World appraisal, deemed A Woman of the Iron People \"lively, stimulating, intelligent, subtle and even witty.\"\n\nIn 1993, Arnason produced Ring of Swords, in which she again pursued the notion of clashing cultures. In this novel Earthlings travel to a distant planet and commence peace negotiations with the world's warmongering males, the hwarhaths. Nicolas, the Earthling translator, has forsaken his species and become the homosexual lover of a hwarhath general. Meanwhile, the human biologist Anna Perez has been imprisoned by her fellow Earthlings, who accuse her of espionage. When Anna is rescued by a daring band of hwarhaths, she realizes a significant opportunity for conducting further studies into the native culture. Among her discoveries is that the hwarhaths are actually grateful that the Earthlings have arrived and thus become opponents in a highly anticipated conflict. John Stadek, in his review of Rings of Swords for the Washington Post Book World, affirmed that Arnason \"has a knack for inventing very human aliens.\" He added that he \"enjoyed every page\" of Arnason's novel.\n\nArnason's short-story collection, Ordinary People, contains six stories, a poem, and the transcript of a speech given by the author. The title suggests that while Arnason's alien characters may look strange, they are really just common, everyday people trying to make their living. In one story, structured like a traditional fairy tale, five daughters take their portion of their mother's heritage and seek their way in the world with it. The catch is that the mother's heritage is language, and one daughter is given nouns, another verbs, and so on. In the end, the prepositions, which might seem like the least useful group, turn out to be the greatest treasure. Arnason also revisits the setting of Ring of Swords in a story that tells of two lovers breaking the taboo of heterosexual love. Reviewing the book for Tangent Short Fiction Review, Lois Tilton voiced some disappointment that there was no new work in it, but added: \"What it does provide is a new look at the range of her fiction, and more good reason than ever to wish for more new stories.\"\n\nBIOGRAPHICAL AND CRITICAL SOURCES:\n\nPERIODICALS\n\nAnalog Science Fiction/Science Fact, June, 1987, Tom Easton, review of To the Resurrection Station, pp. 183-184.\n\nLambda Book Report, September-October, 1993, Susanna J. Sturgis, review of Ring of Swords, p. 32.\n\nNew Statesman & Society, January 29, 1988, Colin Greenland, review of Daughter of the Bear King, p. 30.\n\nNew York Times Book Review, July 14, 1991, Gerald Jonas, review of A Woman of the Iron People, p. 27.\n\nWashington Post Book World, September 27, 1987, review of Daughter of the Bear King, p. 10; May 26, 1991, Richard Grant, review of A Woman of the Iron People, p. 6; August 29, 1993, John Stadek, review of Ring of Swords, p. 12.\n\nONLINE\n\nEleanor Arnason's Blog Spot, http://www.eleanorarnason.blogspot.com (December 8, 2006).\n\nIsaac Asimov's Science Fiction Online, http://www.asimovs.com/ (December 8, 2006), brief article about Eleanor Arnason.\n\nStrange Horizons, http://www.strangehorizons.com/ (December 8, 2006), Lyda Morehouse, interview with Eleanor Arnason.\n\nTangent Short Fiction Review, http://www.tangentonline.com/ (June 26, 2005), Lois Tilton, review of Ordinary People."}, {"url": "https://eleanorarnason.com/", "page_content": "Please share!\n\nNOVELS, COLLECTIONS, CHAPBOOKS AND A FEW ANTHOLOGIES AND MAGAZINES\n\nMy old blog entries are here."}, {"url": "https://www.librarything.com/author/arnasoneleanor", "page_content": "Improve this author\n\nCombine/separate works\n\nAuthor division\n\nEleanor Arnason is currently considered a \"single author.\" If one or more works are by a distinct, homonymous authors, go ahead and split the author.\n\nIncludes\n\nEleanor Arnason is composed of 1 name.\n\nCombine with…"}, {"url": "https://clarkesworldmagazine.com/author/eleanor-arnason/", "page_content": "Eleanor Arnason\n\nEleanor Arnason published her first short story in 1974. Since then she has published six novels and 40+ short stories, all science fiction or fantasy. She won the first James Tiptree Jr. Award in 1991, a Minnesota Book Award in 1993 and a Spectrum Award in 2000. In addition, she has been a finalist for the Hugo, Nebula, Sturgeon and Sidewise Awards.\n\n“Checkerboard Planet” is one of a series of stories about location scout Lydia Duluth. One story, a short novel, has been published as Tomb of the Fathers. If all goes well, the other stories will appear in a collection in the not too distant future.\n\nWebsite\n\nEleanor Arnason has the following works available at Clarkesworld:\n\nCheckerboard Planet FICTION by Eleanor Arnason in Issue 123 – December 2016 The system was a type G yellow dwarf with six planets. Four of the planets were gas giants, the innermost so close to its primary that it skimmed the stellar atmosphere. Dark red in color, it had neither moons nor rings. It sped around its sun, inflated by heat to an impressive size and boiling […]"}, {"url": "https://www.librarything.com/author/arnasoneleanor&all=1", "page_content": "Improve this author\n\nCombine/separate works\n\nAuthor division\n\nEleanor Arnason is currently considered a \"single author.\" If one or more works are by a distinct, homonymous authors, go ahead and split the author.\n\nIncludes\n\nEleanor Arnason is composed of 1 name.\n\nCombine with…"}, {"url": "https://www.goodreads.com/book/show/1637351.In_the_Light_of_Sigma_Draconis", "page_content": "A for effort, D for execution?\n\n\n\nI don't remember where the recommendation came from, but I have it in my mind that someone recommended this to me as an example of anthropological science fiction. Sign me up!, I would have thought.\n\n\n\nA group of (one presumes) modern humans are set down on an alien planet, spread apart, so as to observe and interact with the local aliens. Most of the book tells the story of Lixia, one of the humans, and Nia, an alien she meets who is somewhat of an outcast. In this alien society, females live together in villages while males are driven out after puberty, and the two come together only for mating in the spring. There are, naturally, some who rebel against the order of things.\n\n\n\nThe main problem is, without knowing anything about Arnason's background, I'm going to venture that she doesn't actually know much about anthropology. The aliens are, well, not that alien. (In fact, I think one human character remarks on how \"surprisingly\" human they seem; if there's an explanation, it wasn't even hinted at in this book, which is half of a duology.) There's something very conventionally moral about it. One of the reasons Nia is an outcast is that she wanted to live with her mate all the time, rather than mating with random males at the pre-appointed season! GASP! There's an implication that the humans will teach the aliens how to monogamously pair up, and about why rape is wrong. At the same time, the aliens manage to check quite a few Noble Savage boxes -- for example, war is unknown to them, and murder and theft are rare.\n\n\n\nOn top of that, the characters are pretty flat. There's a point where Lixia does something potentially wrong, and she's concerned about the implications for her career. This is expressed by Lixia thinking, more or less, \"I am concerned about the implications for my career.\" I never got a sense that she was upset, afraid, anxious... She's just a flat canvas who performs actions. Nia's personality is \"wishes, without realizing it, to be human.\" Male human Derek's personality is \"Lothario.\"\n\n\n\nSo: the \"science\" was not thought-provoking, and the \"characters\" were not emotion-provoking. Points for an interesting premise, but this is not an interesting book."}, {"url": "https://www.uncannymagazine.com/article/interview-eleanor-arnason/", "page_content": "Eleanor Arnason published her first short story in 1973. Since then, she has published six novels, three short story collections, a couple of chapbooks and some poetry. Her novel A Woman of the Iron People won the James Tiptree Jr. and the Mythopoeic Society Awards; her novel Ring of Swords won a Minnesota Book Award; and her short story “Dapple” won the Spectrum Award. A collection of her Icelandic fantasies came out in 2014. She has since written four more stories about Icelandic ghosts, trolls, elves and ordinary people. This is one. “The Graveyard” is Arnason’s first appearance in Uncanny, a beautifully crafted tale that weaves together folklore and history.\n\nUncanny Magazine: I love the structure of this story—we are reading the account of a narrator who is hearing about the ghosts from a curator, who in turn has heard the story from Atli. Why did you choose this structure?\n\nEleanor Arnason: The story begins with an actual conversation I had with the curator of a historical site in Iceland. She told me about a farmer who didn’t believe in ghosts, but had to deal with them. But there was no end to her story. The curator didn’t tell me what happened to the farmer. So, I rewrote her narrative and added an ending. The layering—the narrator who is told the story by the curator, who is in turn told the story by the farmer—came out of the actual situation.\n\nUncanny Magazine: What was the easiest part of writing this story? What was the most challenging thing?\n\nEleanor Arnason: The easiest part was the beginning, since I had a real (I think) incident. The hard part was finding an ending. I wanted to keep the uncertainty. Were the ghosts real? Did the characters end by believing in ghosts? And I wanted to keep the story pragmatic: the farmer had a problem. How was he going to solve it? What’s more important than believing in the ghosts is finding a way to get rid of them.\n\nUncanny Magazine: “The Graveyard” has a lovely anthropological feel to it, centering on a cultural conflict and weaving together Icelandic folklore and history, which are recurring topics in your work. What other topics or themes do you find yourself drawn to repeatedly?\n\nEleanor Arnason: A lot of my fiction is about social stereotypes and characters who don’t fit into the roles they are assigned by society. I come out of the Second Wave of Feminism, which hit SF in the late 1960s and was very strong through the 1970s. (Theodore Sturgeon said all the good new writers in the 1970s were women, except for James Tiptree Jr.) So I do a lot with gender roles. My characters want to be something they can’t be in their society, because of their gender. Sometimes they succeed in being the people they want to be. Sometimes they don’t manage. But I give them tolerable lives. There is enough suffering in the world.\n\nMy Icelandic stories are different. Not about gender, for the most part. They are about people who get in difficult situations which are often supernatural and struggle to get out of the situations and get on with their lives. Maybe the commonality with the gender stories is the struggle to have one’s own life. Atli has to find a way to calm down the ghosts and to get the Icelandic-American businessman to stop bothering the graveyard. There is nothing epic about this: he’s not like Frodo. He just wants to get on with his life.\n\nMany of my Icelandic stories are about history: the land is built on the past, as my curator says. A lot of my Icelandic characters are trying to come to terms with the past and the folklore of their country: ghosts, trolls, elves. I am not a fan of Icelandic elves, who seem like rich people, indifferent to the suffering of the poor. But I sometimes write about them. I like trolls, which I see as ordinary people, though very large and rock-like, who struggle to get by. Ghosts are past all effort. Though they can complain.\n\nWriting the above I thought of the famous lines by Karl Marx in The Eighteenth Brumaire of Louis Bonaparte: “Men make their own history, but they do not make it as they please; they do not make it under self-selected circumstances, but under circumstances existing already, given and transmitted from the past. The tradition of all dead generations weighs like a nightmare on the brains of the living.” Maybe that’s what my fiction is about: trying to make a decent life in spite the rules of one’s society and the weight of the past.\n\nUncanny Magazine: Do you believe in ghosts?\n\nEleanor Arnason: No, but neither did the farmer. I am not invested in not believing in ghosts. If I meet one, I will believe in it.\n\nUncanny Magazine: You’ve been writing short stories since the 1970s, and have published dozens of short stories and three collections. What draws you to short fiction? Which writers or stories do you consider to be your strongest influences?\n\nEleanor Arnason: I think my natural length is the short story. I especially like long short stories, novelettes. But I write a fair number of classic-length short stories. I’m a slow writer and writing a novel takes forever. So I like the shortness of short fiction, and the fact that—written well—it can have a density and tightness that’s hard to get in a novel. It’s hard to write a flawless novel, though Jane Austen managed in Pride and Prejudice. But you can write a close to flawless short story.\n\nI think Ursula K. Le Guin is an obvious influence on my work. Possibly Jane Austen as well. I have read Austen’s novels over and over. I love her wit and clear-sightedness and extreme skill as a writer. Very obviously medieval Icelandic literature has influenced me, especially the Icelandic family sagas, not only in my Icelandic stories. My brother says he can see the influence of the sagas in everything I write. (I grant that Austen and the sagas are an odd combination. But it’s what I grew up with.)\n\nUncanny Magazine: What are you working on next?\n\nEleanor Arnason: I have just finished another couple of Icelandic stories. Then I will take a break from Iceland. I have a story about a journalist who gets an assignment to interview the ghost of Hugo Chavez, the former president of Venezuela, to find out if he was involved in the 2020 American election. (Some of Trump’s allies say Chavez helped steal the election. Chavez has been dead since 2013, as people keep pointing out.) I’m still tinkering with that one. I think it will be difficult to sell. And I have started a story about Yu the Great, who founded the first Chinese imperial dynasty, assuming he actually existed. What I like about him is he’s credited with taming the floods on the Yellow River. Imperial China was founded by an engineer! Of course, he was a supernatural engineer, helped by a yellow dragon and a gigantic black turtle. He was also, according to the Chinese stories, an exemplary person and devoted to the common people. Not all my stories work out. These last two may or may not.\n\nUncanny Magazine: Thank you for sharing your thoughts with us!\n\n© 2021 Uncanny Magazine"}]}