{"\"Dapple\" won the Nebula Award for Best Novelette in 1991.": [{"url": "http://eleanorarnason.com/about/", "page_content": "Please share!\n\nEleanor Arnason was born in Manhattan and grew up in New York, Chicago, London, Paris, Washington DC, Honolulu, St. Paul and Minneapolis. She received a BA in art history from Swarthmore College and did graduate work at the University of Minnesota, before quitting to learn about life outside art museums and institutions of higher learning. She made her first professional sale in 1972 while living in the Detroit inner city. Since then she has published six novels and over forty works of short fiction. Her fourth novel, A Woman of the Iron People (2001), won the James Tiptree Jr. award for gender-bending science fiction and the Mythopoeic Society Award for adult fantasy. Her fifth novel, Ring of Swords (1995), won a Minnesota Book Award. Since 1994 she has devoted herself to short fiction. Her story “Dapple” won the Spectrum Award for GLBT science fiction and was a finalist for the Sturgeon Award. Other stories have been finalists for the World Fantasy, Hugo and Nebula Awards.\n\nShe lives in Minnesota, where she used to make her living as the financial manager for a small arts nonprofit. Now she is retired. Aside from accounting and science fiction, her interests include politics, economics, bird-watching, driving down two-lane country highways and exploring the remains of the Great Lakes industrial belt.\n\nIn spite of all setbacks and adversity, she remains a lifelong fan of ordinary human decency and the international working class."}, {"url": "https://www.powells.com/awards/nebula-award", "page_content": "2023 Winner of the Nebula Award for Best Novel\n\nby R. F. Kuang\n\nFrom award-winning author R. F. Kuang comes Babel, a thematic response to The Secret History and a tonal retort to Jonathan Strange & Mr. Norrell that grapples with student revolutions, colonial resistance, and the use of language and translation as the dominating tool of the British empire.\n\n\n\nTraduttore, traditore: An act of translation is always an act of betrayal.\n\n\n\n1828. Robin Swift, orphaned by cholera in Canton, is brought to London by the mysterious Professor Lovell. There, he trains for years in Latin, Ancient Greek, and Chinese, all in preparation for the day he'll enroll in Oxford University's prestigious Royal Institute of Translation — also known as Babel.\n\n\n\nBabel is the world's center for translation and, more importantly, magic. Silver working — the art of manifesting the meaning lost in translation using enchanted silver bars — has made the British unparalleled in power, as its knowledge serves the Empire's quest for colonization.\n\n\n\nFor Robin, Oxford is a utopia dedicated to the pursuit of knowledge. But knowledge obeys power, and as a Chinese boy raised in Britain, Robin realizes serving Babel means betraying his motherland. As his studies progress, Robin finds himself caught between Babel and the shadowy Hermes Society, an organization dedicated to stopping imperial expansion. When Britain pursues an unjust war with China over silver and opium, Robin must decide...\n\n\n\nCan powerful institutions be changed from within, or does revolution always require violence?\n\nEach year since 1965 the Nebula Awards honoring science fiction's best novel, novella, novelette, short story, and script have been awarded by the voting members of Science Fiction and Fantasy Writers of America, Inc.\n\nHere we present the winners of the Nebula Awards' best novel category.\n\nEvery year an anthology of the prior year's Nebula Award-winning short fiction is published. Those anthologies can be found here."}, {"url": "https://www.uncannymagazine.com/article/interview-eleanor-arnason/", "page_content": "Eleanor Arnason published her first short story in 1973. Since then, she has published six novels, three short story collections, a couple of chapbooks and some poetry. Her novel A Woman of the Iron People won the James Tiptree Jr. and the Mythopoeic Society Awards; her novel Ring of Swords won a Minnesota Book Award; and her short story “Dapple” won the Spectrum Award. A collection of her Icelandic fantasies came out in 2014. She has since written four more stories about Icelandic ghosts, trolls, elves and ordinary people. This is one. “The Graveyard” is Arnason’s first appearance in Uncanny, a beautifully crafted tale that weaves together folklore and history.\n\nUncanny Magazine: I love the structure of this story—we are reading the account of a narrator who is hearing about the ghosts from a curator, who in turn has heard the story from Atli. Why did you choose this structure?\n\nEleanor Arnason: The story begins with an actual conversation I had with the curator of a historical site in Iceland. She told me about a farmer who didn’t believe in ghosts, but had to deal with them. But there was no end to her story. The curator didn’t tell me what happened to the farmer. So, I rewrote her narrative and added an ending. The layering—the narrator who is told the story by the curator, who is in turn told the story by the farmer—came out of the actual situation.\n\nUncanny Magazine: What was the easiest part of writing this story? What was the most challenging thing?\n\nEleanor Arnason: The easiest part was the beginning, since I had a real (I think) incident. The hard part was finding an ending. I wanted to keep the uncertainty. Were the ghosts real? Did the characters end by believing in ghosts? And I wanted to keep the story pragmatic: the farmer had a problem. How was he going to solve it? What’s more important than believing in the ghosts is finding a way to get rid of them.\n\nUncanny Magazine: “The Graveyard” has a lovely anthropological feel to it, centering on a cultural conflict and weaving together Icelandic folklore and history, which are recurring topics in your work. What other topics or themes do you find yourself drawn to repeatedly?\n\nEleanor Arnason: A lot of my fiction is about social stereotypes and characters who don’t fit into the roles they are assigned by society. I come out of the Second Wave of Feminism, which hit SF in the late 1960s and was very strong through the 1970s. (Theodore Sturgeon said all the good new writers in the 1970s were women, except for James Tiptree Jr.) So I do a lot with gender roles. My characters want to be something they can’t be in their society, because of their gender. Sometimes they succeed in being the people they want to be. Sometimes they don’t manage. But I give them tolerable lives. There is enough suffering in the world.\n\nMy Icelandic stories are different. Not about gender, for the most part. They are about people who get in difficult situations which are often supernatural and struggle to get out of the situations and get on with their lives. Maybe the commonality with the gender stories is the struggle to have one’s own life. Atli has to find a way to calm down the ghosts and to get the Icelandic-American businessman to stop bothering the graveyard. There is nothing epic about this: he’s not like Frodo. He just wants to get on with his life.\n\nMany of my Icelandic stories are about history: the land is built on the past, as my curator says. A lot of my Icelandic characters are trying to come to terms with the past and the folklore of their country: ghosts, trolls, elves. I am not a fan of Icelandic elves, who seem like rich people, indifferent to the suffering of the poor. But I sometimes write about them. I like trolls, which I see as ordinary people, though very large and rock-like, who struggle to get by. Ghosts are past all effort. Though they can complain.\n\nWriting the above I thought of the famous lines by Karl Marx in The Eighteenth Brumaire of Louis Bonaparte: “Men make their own history, but they do not make it as they please; they do not make it under self-selected circumstances, but under circumstances existing already, given and transmitted from the past. The tradition of all dead generations weighs like a nightmare on the brains of the living.” Maybe that’s what my fiction is about: trying to make a decent life in spite the rules of one’s society and the weight of the past.\n\nUncanny Magazine: Do you believe in ghosts?\n\nEleanor Arnason: No, but neither did the farmer. I am not invested in not believing in ghosts. If I meet one, I will believe in it.\n\nUncanny Magazine: You’ve been writing short stories since the 1970s, and have published dozens of short stories and three collections. What draws you to short fiction? Which writers or stories do you consider to be your strongest influences?\n\nEleanor Arnason: I think my natural length is the short story. I especially like long short stories, novelettes. But I write a fair number of classic-length short stories. I’m a slow writer and writing a novel takes forever. So I like the shortness of short fiction, and the fact that—written well—it can have a density and tightness that’s hard to get in a novel. It’s hard to write a flawless novel, though Jane Austen managed in Pride and Prejudice. But you can write a close to flawless short story.\n\nI think Ursula K. Le Guin is an obvious influence on my work. Possibly Jane Austen as well. I have read Austen’s novels over and over. I love her wit and clear-sightedness and extreme skill as a writer. Very obviously medieval Icelandic literature has influenced me, especially the Icelandic family sagas, not only in my Icelandic stories. My brother says he can see the influence of the sagas in everything I write. (I grant that Austen and the sagas are an odd combination. But it’s what I grew up with.)\n\nUncanny Magazine: What are you working on next?\n\nEleanor Arnason: I have just finished another couple of Icelandic stories. Then I will take a break from Iceland. I have a story about a journalist who gets an assignment to interview the ghost of Hugo Chavez, the former president of Venezuela, to find out if he was involved in the 2020 American election. (Some of Trump’s allies say Chavez helped steal the election. Chavez has been dead since 2013, as people keep pointing out.) I’m still tinkering with that one. I think it will be difficult to sell. And I have started a story about Yu the Great, who founded the first Chinese imperial dynasty, assuming he actually existed. What I like about him is he’s credited with taming the floods on the Yellow River. Imperial China was founded by an engineer! Of course, he was a supernatural engineer, helped by a yellow dragon and a gigantic black turtle. He was also, according to the Chinese stories, an exemplary person and devoted to the common people. Not all my stories work out. These last two may or may not.\n\nUncanny Magazine: Thank you for sharing your thoughts with us!\n\n© 2021 Uncanny Magazine"}, {"url": "http://dreamhavenbooks.com/event/elanor/", "page_content": "Calendar When: 2016.05.25 @ 18:30 – 19:45 2016-05-25T18:30:00-05:00 2016-05-25T19:45:00-05:00 Where: DreamHaven Books\n\n2301 E 38th St\n\nMinneapolis, MN 55406\n\nUSA\n\nCost: Free Event Signing\n\nOn Wednesday, May 25, ELEANOR ARNASON reads from her work at 6:30 p.m. Ms. Arnason was born in Manhattan and grew up in New York, Chicago, London, Paris, Washington DC, Honolulu, Saint Paul, and Minneapolis. She received a BA in art history from Swarthmore College and did graduate work at the University of Minnesota, before quitting to learn about life outside art museums and institutions of higher learning. She made her first professional sale in 1972 while living in the Detroit inner city. Since then she has published five novels and over 30 novellas, novelettes, short stories, and experimental short forms. Her fourth novel, A Woman of the Iron People (1991), won the James Tiptree Jr Award for gender-bending science fiction and the Mythopoeic Society Award for adult fantasy. Her fifth novel, Ring of Swords (1995), won a Minnesota Book Award. Since 1994 she has devoted herself to short fiction. Her story “Dapple” won the Spectrum Award for GLBT science fiction and was a finalist for the Sturgeon Award. Other stories have been finalists for the World Fantasy, Hugo, and Nebula Awards. She lives in Minnesota, where for several years she made her living as the financial manager for a small arts nonprofit. Aside from accounting and science fiction, her interests include politics, economics, bird-watching, driving down two-lane country highways, and exploring the remains of the Great Lakes industrial belt.\n\nSpeculations is a co-production of DreamHaven Books and SF MINNESOTA, a multicultural speculative fiction organization that also hosts a midsummer SF convention, DIVERSICON, the 24th edition of which will be held July 29-31, 2016, at the Best Western Plus—Bandana Square, Saint Paul, with Guest of Honor JESSICA AMANDA SALMONSON and Special Guest NAOMI KRITZER."}, {"url": "https://www.abebooks.com/9780974655901/Ordinary-People-Conversation-Pieces-Volume-0974655902/plp", "page_content": "Spanning thirty years, this volume collects six stories, one poem, and a WisCon Guest of Honor speech. In the richly ironic “Warlords of Saturn's Moons,” first published in 1974, a cigar-puffing woman writes space-opera while the drama of real-life inner-city Detroit goes on around her; “The Grammarian's Five Daughters” offers a playful explication of the uses of the parts of speech; “A Ceremony of Discontent” takes a humorous approach to a modern-day feminist problem; and Arnason's wise, earthy tales of Hwarhath serve up new myths explaining the origins of the world and morality (among other things). The work in this collection entertains with its wit, delights with its precision and imagination, and challenges and provokes with its bluntness. Ordinary People offers a small, potent taste of the oeuvre of an important feminist sf author.\n\nReviews\n\n”When I read Arnason, I am charmed, not only by the tales-as-tales but by a voice as unmistakable as that of Heinlein or Vance or Farmer: measured and precise and stealthily funny and full of homely wisdom.”\n\nRussell Letson, Locus\n\n”An Eleanor Arnason story collection is way overdue, and this is a very welcome book. I recommend it highly.”\n\nRich Horton, Locus"}, {"url": "https://www.uncannymagazine.com/authors/page/2/", "page_content": "Laurel Amberdine was raised by cats in the suburbs of Chicago. She’s good at naps, begging for food, and turning ordinary objects into toys. She read a novel a day for over a decade, until she married someone who occasionally wanted to talk to her, putting an end to that streak.\n\nShe currently lives in San Francisco where she works as Assistant Editor at both Locus Magazine and Lightspeed Magazine. She is willing to entertain offers from other magazines that start with “L.”\n\nShe has published poetry and short fiction, but loves novels best of all. Her YA fantasy novel Luminator is forthcoming from Reuts Publishing."}, {"url": "https://www.abebooks.com/9780312855185/Ring-Swords-Arnason-Eleanor-0312855184/plp", "page_content": "Eleanor Arnason's A Woman of the Iron People \"will inevitably and appropriately be compared to the work of Ursula K. Le Guin,\" said Locus. It won both the Mythopoeic Award and one of the first annual James Tiptree Jr. Awards, and received widespread review attention.\n\nRing of Swords takes place on a larger canvas, the entire civilized galaxy in the 22nd century. For nearly fifty years, humanity has been in conflict with a spacefaring race of warlike humanoid aliens, the only advanced and intelligent race thus far encountered in the exploration of space. Humans hope to avoid interstellar war with this enigmatic race, and have set up the first diplomatic talks with them on an isolated and strategically unimportant planet.\n\nBiological researcher Anna Perez has a grant to study the huge, jellyfishlike aliens who live in the seas on this far planet. As the talks begin, she learns that the alien diplomats have a translator, Nicholas Sanders, who to the astonishment of all is the first human turncoat. Anna becomes involved in a plot to kidnap him.\n\nSo begins a story of deepening conflict, complicated by racial and sexual roles, attitudes toward aggression, and misunderstood customs haunted by the spectre of an unimaginable war, a complex tale of the future that confirms Eleanor Arnason's place among the leading SF writers of the decade.\n\n\"synopsis\" may belong to another edition of this title."}, {"url": "https://www.abebooks.com/9780974655901/Ordinary-People-Conversation-Pieces-Arnason-0974655902/plp", "page_content": "Spanning thirty years, this volume collects six stories, one poem, and a WisCon Guest of Honor speech. In the richly ironic “Warlords of Saturn's Moons,” first published in 1974, a cigar-puffing woman writes space-opera while the drama of real-life inner-city Detroit goes on around her; “The Grammarian's Five Daughters” offers a playful explication of the uses of the parts of speech; “A Ceremony of Discontent” takes a humorous approach to a modern-day feminist problem; and Arnason's wise, earthy tales of Hwarhath serve up new myths explaining the origins of the world and morality (among other things). The work in this collection entertains with its wit, delights with its precision and imagination, and challenges and provokes with its bluntness. Ordinary People offers a small, potent taste of the oeuvre of an important feminist sf author.\n\nReviews\n\n”When I read Arnason, I am charmed, not only by the tales-as-tales but by a voice as unmistakable as that of Heinlein or Vance or Farmer: measured and precise and stealthily funny and full of homely wisdom.”\n\nRussell Letson, Locus\n\n”An Eleanor Arnason story collection is way overdue, and this is a very welcome book. I recommend it highly.”\n\nRich Horton, Locus"}]}