{"Eleanor Arnason has been praised for her ability to combine elements of science fiction and fantasy with traditional storytelling.": [{"url": "https://www.goodreads.com/author/show/108548.Eleanor_Arnason", "page_content": "Eleanor Arnason\n\nBorn\n\nJanuary 01, 1942\n\nGenre\n\nEleanor Atwood Arnason (born 1942) is an American author of science fiction novels and short stories. From 1949 to 1961, Arnason and her parents lived in \"Idea House #2,\" a futuristic dwelling built by the Walker Art Center. Arnason's earliest published story appeared in New Worlds in 1972. Her work often depicts cultural change and conflict, usually from the viewpoint of characters who cannot or will not live by their own societies' rules.\n\nEleanor Atwood Arnason (born 1942) is an American author of science fiction novels and short stories. From 1949 to 1961, Arnason and her parents lived in \"Idea House #2,\" a futuristic dwelling built by the Walker Art Center. Arnason's earliest published story appeared in New Worlds in 1972. Her work often depicts cultural change and conflict, usually from the viewpoint of characters who cannot or will not live by their own societies' rules."}, {"url": "https://eleanorarnason.com/about/", "page_content": "Please share!\n\nEleanor Arnason was born in Manhattan and grew up in New York, Chicago, London, Paris, Washington DC, Honolulu, St. Paul and Minneapolis. She received a BA in art history from Swarthmore College and did graduate work at the University of Minnesota, before quitting to learn about life outside art museums and institutions of higher learning. She made her first professional sale in 1972 while living in the Detroit inner city. Since then she has published six novels and over forty works of short fiction. Her fourth novel, A Woman of the Iron People (2001), won the James Tiptree Jr. award for gender-bending science fiction and the Mythopoeic Society Award for adult fantasy. Her fifth novel, Ring of Swords (1995), won a Minnesota Book Award. Since 1994 she has devoted herself to short fiction. Her story “Dapple” won the Spectrum Award for GLBT science fiction and was a finalist for the Sturgeon Award. Other stories have been finalists for the World Fantasy, Hugo and Nebula Awards.\n\nShe lives in Minnesota, where she used to make her living as the financial manager for a small arts nonprofit. Now she is retired. Aside from accounting and science fiction, her interests include politics, economics, bird-watching, driving down two-lane country highways and exploring the remains of the Great Lakes industrial belt.\n\nIn spite of all setbacks and adversity, she remains a lifelong fan of ordinary human decency and the international working class."}, {"url": "https://locusmag.com/2016/09/eleanor-arnason-unfolding/", "page_content": "‘‘We have a split in the 20th century between genre fiction, which tends to be about action, and fiction that’s about interpersonal relationships and psychology. At a Chicago convention decades ago, Gene Wolfe said that every time he encounters people who say the most important things happen within their heads, he wants to put them in a small boat on the ocean in the middle of the storm. This connects to my prejudices about mainstream literary fiction.\n\n‘‘I’ve always read science fiction and fantasy and murder mysteries. I was an English major most of the way through college, and I read The Great Gatsby and Dubliners and Portrait of the Artist as a Young Man and some of Proust in French, so I got a reasonable background in mainstream literature. But it didn’t interest me the way that science fiction did. My problem with realism is that a realistic novel about the psychological problems of middle-class people is a story which is very similar to the life I’m leading, and thus is not too interesting. Whereas the minute you throw in a dragon or global warming, it becomes very interesting. Internal thoughts become much less important, and you basically want to deal with the dragon.”\n\n…\n\n‘‘My father’s parents came from Iceland to North America, and I grew up in a house full of books on Norse mythology, the Icelandic sagas, and the novels of the great 20th-century Icelandic writer Halldór Laxness. (I have a copy of his novel Independent People inscribed to my father. Laxness misspelled my father’s name.) I have a thing about Iceland, especially the medieval lit­erature, and I have come to love Icelandic folklore. Hidden Folk, which came out early in 2015, is a collection of stories based on Icelandic folklore and literature.\n\n‘‘Icelanders don’t have princes and princesses – Iceland was too poor for royalty, even in folktales. Instead, there are trolls, elves, ghosts, outlaws, and ministers who study the black arts. Hidden Folk is very much my own version of Icelandic tales. My elves are unpleasant upper-class types. My trolls are poor farmers and workers, barely surviving. My humans are a mixed lot: farmers and farmwives, students of the magical arts, slaves, a writer, a cop. Over the years, I wrote five Icelandic fantasies – six since the collection was published, and I’m work­ing on a seventh.”\n\n…\n\n‘‘Science fiction and fantasy have the appeal of strangeness, and of course science and technology are enormously important in science fiction. SF has been dealing with global warming consistently, while the presidential candidates have barely men­tioned it. There’s no question that it’s happening, and it’s going to be devastating. James Lovelock, who came up with the Gaia theory, has said we’re going to be down to a billion people by the end of the century.\n\n‘‘I read a lot projections of the future, and people never factor in enough. They project a population of nine billion, but they don’t factor in the Four Horsemen of the Apocalypse – famine, war, dis­ease, and death due to climate change. All they’re doing is a projection of where we’ve been. Science fiction, when it’s good, will pick up a whole bunch of these ideas at once. There was a panel at the 2016 Minicon about writing SF in which many things are changing, rather than just one. One of the things that makes me crazy about much hard SF is, you’re in the future with unbelievable physics that nobody now can understand… but everybody has names like Brad and Charles and they’re living the way we live now. That is nuts. Charles Stross’s early novels had more things happening than I could keep track of. They were stunning.”\n\n…\n\n‘‘Writing Ring of Swords was a lot of fun – it’s the fastest I’ve ever written a novel, and the first separate hwarhath story, ‘The Hound of Merin’, was also written at about the same time as the novel. Ring of Swords was going to be the first of a trilogy, and I wrote the second volume, but it was turned down by the publisher. It’s really hard to sell the middle book of a trilogy by itself, so I put it to the side. There were problems with the sequel, and I’m not happy with the way it turned out. (I now have a contract with Aqueduct Press for a revised version of the sequel, so it will finally come out.) I was frustrated with the trilogy, and I had a lot more information about the hwarhath, so I started writing short stories. These turned out to be stories written by hwarhath authors after they en­countered humanity, not only about the hwarhath, but about them thinking about their own culture, and in some cases thinking about humanity. The hwarhath are extremely rigid in many ways, and meeting a species very much like themselves but with different rules for male and female behavior leads the brighter among them to question what is the nature of men and women, and that underlies a lot of the stories.”\n\n…\n\n‘‘I have an alien species I’ve written a few stories about, the Goxhat, which are another attempt to look at social stereotypes or maybe ideas of self. In the early part of their culture there were teams, which would be a bunch of Goxhat hatched out of the same clutch of eggs. Each team thought of itself as ‘I,’ and no individual thought of itself as an individual. They come in four sexes, and a team could be all four sexes or one sex, and it’s all ‘I.’ My story ‘Knapsack Poems’ is about the Goxhat early in their history. As their culture evolved, their sense of ‘I’ got bigger, until the whole species became ‘I.’ They know that they are different bod­ies, but they don’t have a clear sense of themselves as individuals. They’re spacefaring, and they meet other species that don’t have their sense of oneness, so the problem becomes how the Goxhat can think about other species. They meet something that isn’t part of the ‘I’ – and what do they do about a species that is millions of ‘I’s?”\n\nRead the complete interview in the September 2016 issue of Locus Magazine. Interview design by Francesca Myman."}, {"url": "https://classicsofsciencefiction.com/2019/02/28/the-potter-of-bones-by-eleanor-arnason/", "page_content": "The first story in The Very Best of the Best edited by Gardner Dozois is “The Potter of Bones” by Eleanor Arnason. It originally appeared in Asimov’s Science Fiction from 2002. This story is part of Arnason’s Hwarhath series of tales about a planet of intelligent fur-covered beings where homosexuality is the norm for relationships and heterosexuality is used for procreation. Eleanor Arnason stories explore the themes of art, anthropology, sociology, sexuality, and feminism by creating science fiction stories that feel like folk tales and allegories. The narrator of “The Potter of Bones” is from the planet’s present time, and she is telling stories that come down from early history, that could be closer to myths.\n\nThe heroine of this story is Tulwar Haik. Tulwar is a clan name, so her personal name is Haik. She has become a legendary figure on this alien planet. Haik was a potter who loved finding fossils and is known on her world for developing the theory of evolution. Haik’s story recapitulates Darwin’s discoveries on Earth. “The Potter of Bones” uses a richly drawn fantasy about aliens that sound human but look like furry animals to comment on human society, especially about gender and race.\n\nIs this story science fiction? Eleanor Arnason’s stories often remind me of stories by Ursula K. Le Guin. They’re set on other worlds, which makes them science fiction, but they often feel like folk tales, which makes me think they’re fantasy. Their stories are intensely sociological and often come across as fables for grown-ups.\n\nI am listening to The Very Best of the Best while thinking about the nature of science fiction and how it is written. Being the lead story in a collection of science fiction that claims to be the very best of the best, suggests that Gardner Dozois must have loved “The Potter of Bones” very much. He bought it for Asimov’s when he was the editor there, included it in his annual best-of collections for America and Great Britain and reprints it again here. I had read “The Potter of Bones” when it came out because I like Arnason’s stories about Hwarhath. I found it a compelling read, especially now that I got to listen to it, and thoroughly enjoyed the story, but to be honest, it’s not my kind of science fiction.\n\nHow can “The Potter of Bones” be science fiction that entertained me a great deal and not be my kind of science fiction? And how many kinds of science fiction are there? See, that’s why I want to review the stories in The Very Best of the Best. I’ve listened to the first three stories since yesterday (and two are novellas) and even though each is dazzling in their own way, none of them were my kind of science fiction.\n\nI’ve always wanted to write science fiction. And I’ve tried. I’ve even attended Clarion West Writer’s Workshop, but my stories were never any good. I’m reading and listening to this anthology very closely to study what makes science fiction tick. “The Potter of Bones” stands out for its worldbuilding. Arnason has been writing Hwarhath stories since 1993. They were collected into Hwarhath Stories: Transgressive Tales by Aliens in 2016. I generally disliked science fiction series because my favorite aspect of science fiction is its ideas, so stories that constantly recycle its world-building ideas seem less impressive with each successive story.\n\nHowever, I’m discovering why writers love writing stories in a series. It takes a tremendous mental effort to create new worlds for science fiction. The reason why the Harry Potter stories are the most successful on the planet today is that J. K. Rowling imagined such an incredibly detailed fictional world. Starting from scratch every time you sit down to write a story would give each story a costly overhead. If the writer can assume their readers already understand how the fictional world works they can get down to the storytelling quicker.\n\nReading the stories in The Very Best of the Best perfectly illustrates the importance of world-building to writing science fiction and fantasy. It often explains why stories get rated 5-stars at Rocket Stack Rank. It also tells me that if I want to write science fiction I’ve got to up the information density of my fiction to include an abundance of imagined details. Here’s the opening for “The Potter of Bones”:\n\nThe northeast coast of the Great Southern Continent is hilly and full of inlets. These make good harbors, their waters deep and protected from the wind by steep slopes and grey stone cliffs. Dark forests top the hills. Pebble beaches edge the harbors. There are many little towns. The climate would be tropical, except for a polar current which runs along the coast, bringing fish and rain. The local families prosper through fishing and the rich, semi-tropical forests that grow inland. Blackwood grows there, and iridescent greywood, as well as lovely ornamentals: night-blooming starflower, day-blooming skyflower and the matriarch of trees, crown-of-fire. The first two species are cut for lumber. The last three are gathered as saplings, potted and shipped to distant ports, where affluent families buy them for their courtyards. Nowadays, of course, it’s possible to raise the saplings in glass houses anywhere on the planet. But most folk still prefer trees gathered in their native forests. A plant grows better, if it’s been pollinated naturally by the fabulous flying bugs of the south, watered by the misty coastal rains and dug up by a forester who’s the heir to generations of diggers and potters. The most successful brands have names like “Coastal Rain” and emblems suggesting their authenticity: a forester holding a trowel, a night bug with broad furry wings floating over blossoms.\n\nCan you even count every detail that Arnason thought up as she typed those sentences? And don’t confuse the technical term “world-building” used in science fiction to mean just describing how a fictionalized world works. In the next story in this anthology, Charles Stross describes Earth just a few decades into the future and it is overflowing with strangely different details, each of which had to be imagined by Stross. World-building can include any detail that paints the science fiction or fantasy of a story. Here’s how we learn that Haik got into fossils:\n\nThe young Tulwar, her playmates, found the topic boring. Who could possibly care about shells made of stone? “They don’t shimmer like living shells, and there’s nothing edible in them. Think about living shellfish, Haik! Or fish! Or trees like the ones that support our family!” If her kin could not answer her questions, she’d find answers herself. Haik continued her study. She was helped by the fact that the strata along the northeast coast had not buckled or been folded over. Top was new. Bottom was old. She could trace the history of the region’s life by climbing up. At first, she didn’t realize this. Instead, she got a hammer and began to break out fossils, taking them to one of the town’s many empty houses. There, through trial and error, she learned to clean the fossils and to open them. “Unfolding with a hammer,” she called the process. Nowadays we discourage this kind of ignorant experimentation, especially at important sites. Remember this story takes place in the distant past. There was no one on the planet able to teach Haik; and the fossils she destroyed would have been destroyed by erosion long before the science of paleontology came into existence. She began by collecting shells, laying them out on the tables left behind when the house was abandoned. Imagine her in a shadowy room, light slanting through the shutters. The floor is thick with dust. The paintings on the walls, fish and flowering trees, are peeling. Haik—a thin red adolescent in a tunic—bends over her shells, arranging them. She has discovered one of the great pleasures of intelligent life: organization or (as we call it now) taxonomy. This was not her invention. All people organize information. But most people organize information for which they can see an obvious use: varieties of fish and their habits, for example. Haik had discovered the pleasure of knowledge that has no evident use. Maybe, in the shadows, you should imagine an old woman with white fur, dressed in a roughly woven tunic. Her feet are bare and caked with dirt. She watches Haik with amusement. In time, Haik noticed there was a pattern to where she found her shells. The ones on the cliff tops were familiar. She could find similar or identical shells washed up on the Tulwar beaches. But as she descended, the creatures in the stone became increasingly strange. Also, and this puzzled her, certain strata were full of bones that obviously belonged to land animals. Had the ocean advanced, then retreated, then advanced again? How old were these objects? How much time had passed since they were alive, if they had ever been alive? Some of her senior kin believed they were mineral formations that bore an odd resemblance to the remains of animals. “The world is full of repetition and similarity,” they told Haik, “evidence the Goddess has little interest in originality.”\n\nNow part of this world-building is character development. Notice how Arnason brings in human history to weave her story. Arnason needs to know geology and archeology to sculpt her theme. And taxonomy played a very important part in Darwin’s discovery of evolution.\n\n“The Potter of Bones,” tells several stories about Haik. I won’t quote them all, but Haik has to become a potter. Eventually, she becomes a lover of a traveling actress, Dapple. Haik has children, which Arnason uses to explain mating customs. And Haik grows old. “The Potter of Bones” gathers the legends about Haik and Dapple that the narrator uses to understand their planet’s history, which lets Arnason comment on how we know what we know about our past. “The Potter of Bones” is also about the different forms of communicating history and story.\n\nEleanor Arnason uses her stories about furry aliens to analyze human society. Does that mean a good science fiction writer must also be a philosopher and cultural observer? If I just consider the three stories I’ve read so far in this anthology, then the answer is a definite yes.\n\nI’ve always judged science fiction by the validity of its speculation about future technology or if extrapolated trends will actually unfold. With Arnason and writers like Le Guin, should I wonder if their imagined aliens and alien societies could possibly exist? Ultimately, isn’t the world-building in “The Potter of Bones” more akin to Mission of Gravity by Hal Clement or Dragon’s Egg by Robert L. Forward than to Kim Stanley Robinson’s Mars trilogy?\n\nOr, is Arnason’s world-building more like Tolkien’s Middle Earth, not meant to be speculation at all, but a deeply adult fairy tale? Gardner Dozois calls “The Potter of Bones” science fiction. The story is about geology, fossils, evolution, classification, taxonomy, so there is a lot of science in it. Of course, it could be a fantasy that uses science rather than magic as its unifying theme.\n\nMy kind of science fiction are stories that speculate and extrapolate about the future. There are all kinds of science fiction, and I read all kinds. But the kind I love most is the science fiction that teaches me about the future in the same way history helps me model the past. “The Potter of Bones” is not that kind of science fiction. Of course, it might be science fiction that teaches us about who we are now.\n\nRecommended Reading\n\nJames Wallace Harris, 2/28/19"}, {"url": "https://blog.pmpress.org/authors-artists-comrades/eleanor-arnason/", "page_content": "Eleanor Arnason\n\nEver since her first story was published in the revolutionary New Worlds in 1972, Eleanor Arnason has been acknowledged as the heir to the feminist legacy of Russ and Le Guin. The first winner of the prestigious Tiptree Award, she has been shortlisted for both the Nebula and the Hugo.\n\nMammoths of the Great Plains Mammoths of the Great Plains SKU: 9781604860757\n\nAuthor: Eleanor Arnason\n\nPublisher: PM Press/ Outspoken Authors\n\nISBN: 9781604860757\n\nPublished: 5/2010\n\nFormat: Paperback, ePub, mobi, PDF\n\nPage count: 152\n\nSize: 5 x 7.5\n\nSubjects: Science Fiction $12.00 $8.95 (e-Book)\n\nPraise\n\n“Eleanor Arnason nudges both human and natural history around so gently in this tale that you hardly know you’re not in the world-as-we-know-it until you’re quite at home in a North Dakota where you’ve never been before, listening to your grandmother tell you the world.”\n\n–Ursula K. Le Guin\n\n“Eleanor Arnason’s wise and engaging stories make you question the things you take for granted. How we love, how we fight, how we live.”\n\n–Maureen McHugh, Winner of the James Tiptree Jr. and Hugo Awards\n\n“Arnason doesn’t write about peace, the unreachable stasis. She writes about reconciliation: and art, a process, an intricate and never-ending dance. A literature of reconciliation, a celebration of this other ancient preoccupation of humanity, is a truly exciting development in our genre. It takes feminist SF out of the ghetto, out of the realm of reaction and reproach, into the real world.”\n\n–Gwyenth Jones, Winner of the James Tiptree Jr. and Philip K. Dick Awards\n\n“Arnason…refuses to write within the neat, confining boundaries of genre expectation, and in part because her fearless exploration of difficult political and social issues makes some editors and readers uneasy… Her work exploring gender, and particularly its intersection with politics, stands comparison with that of such better-known writers as Le Guin, Suzy McKee Charnas and Sheri Tepper.”\n\n–Michael D. Levy, Professor of English Literature, University of Wisconsin-Stout\n\nBook Events\n\nCurrent Month june, 2023 No Events\n\nReviews\n\nInterviews\n\nMentions\n\nBlog"}, {"url": "https://www.pmpress.org/index.php?l=product_detail&p=208", "page_content": "When President Thomas Jefferson sent Lewis and Clark to explore the West, he told them to look especially for mammoths. Jefferson had seen bones and tusks of the great beasts in Virginia, and he suspected—he hoped!—that they might still roam the Great Plains. In Eleanor Arnason’s imaginative alternate history, they do: shaggy herds thunder over the grasslands, living symbols of the oncoming struggle between the Native peoples and the European invaders. And in an unforgettable saga that soars from the badlands of the Dakotas to the icy wastes of Siberia, from the Russian Revolution to the AIM protests of the 1960s, Arnason tells of a modern woman’s struggle to use the weapons of DNA science to fulfill the ancient promises of her Lakota heritage.\n\nPLUS: “Writing SF During World War III,” and an Outspoken Interview that takes you straight into the heart and mind of one of today’s edgiest and most uncompromising speculative authors.\n\nPraise:\n\n“Eleanor Arnason nudges both human and natural history around so gently in this tale that you hardly know you're not in the world-as-we-know-it until you're quite at home in a North Dakota where you've never been before, listening to your grandmother tell you the world.”\n\n—Ursula K. Le Guin\n\n“Eleanor Arnason's wise and engaging stories make you question the things you take for granted. How we love, how we fight, how we live.”\n\n—Maureen McHugh, Winner of the James Tiptree Jr. and Hugo Awards\n\n“Arnason doesn’t write about peace, the unreachable stasis. She writes about reconciliation: and art, a process, an intricate and never-ending dance. A literature of reconciliation, a celebration of this other ancient preoccupation of humanity, is a truly exciting development in our genre. It takes feminist SF out of the ghetto, out of the realm of reaction and reproach, into the real world.”\n\n—Gwyenth Jones, Winner of the James Tiptree Jr. and Philip K. Dick Awards\n\n“Arnason…refuses to write within the neat, confining boundaries of genre expectation, and in part because her fearless exploration of difficult political and social issues makes some editors and readers uneasy... Her work exploring gender, and particularly its intersection with politics, stands comparison with that of such better-known writers as Le Guin, Suzy McKee Charnas and Sheri Tepper.”\n\n—Michael D. Levy, Professor of English Literature, University of Wisconsin-Stout\n\nAbout the Author:\n\nEver since her first story was published in the revolutionary New Worlds in 1972, Eleanor Arnason has been acknowledged as the heir to the feminist legacy of Russ and Le Guin. The first winner of the prestigious Tiptree Award, she has been short listed for both the Nebula and the Hugo.\n\nSee and hear author interviews, book reviews, and other news on Eleanor Arnason's page HERE\n\nClick here to download and print a product information sheet."}, {"url": "https://blog.pmpress.org/2019/07/25/eleanor-arnason-a-fresh-new-voice-of-science-fiction/", "page_content": "Mammoths of the Great Plains\n\nBy Nisi Shawl\n\nSeattle Times\n\nJuly 24, 2010\n\n\n\nIn the field of science fiction, small independent presses are willing to take chances when it comes to supporting fresh, original work. Seattle Times science fiction reviewer Nisi Shawl rounds up three: “Redemption in Indigo” by Karen Lord; “Mammoths of the Great Plains” by Eleanor Arnason; and “The Loving Dead” by Amelia Beamer.\n\nThe contest between small independent presses and huge media conglomerates could be won because the little guys are able to take big chances. In science fiction and fantasy, at least, they’re willing and eager to publish minorities and women, and wonderfully fresh debut novels like Karen Lord’s “Redemption in Indigo” (Small Beer Press, 200 pp., $16).\n\nLord is a well-traveled native of Barbados with a University of Toronto science degree. Using a Senegalese folktale the way a composer uses a musical theme — as a basis for variation — she recounts the fantastical adventures of Paama, who escapes her unfortunate marriage only to be placed in unwitting charge of awesome universal powers.\n\nAn enchanted kitchen implement allows Paama to bring the slightest probabilities to pass. At first unconscious of this ability, she rescues a drowning boy and resurrects a plague victim from the dead. Gradually the “undying ones” (known to Paama’s people as “djombi”) teach her how the branching implications of her interference lead to consequences a mere human woman could never foresee. Full of sharp insights and humorous asides (“I know your complaint already. You are saying, how do two grown men begin to see talking spiders after only three glasses of spice spirit?”), “Redemption” extends the Caribbean Island storyteller’s art into the 21st century and hopefully, beyond.\n\nAnother risk-taking enterprise, PM Press’ “Outspoken Authors” series, presents “Mammoths of the Great Plains” (PM Press, 128 pp., $12). But this is not Eleanor Arnason‘s first book. A veteran writer of feminist SF, Arnason here creates an alternate history in which woolly mammoths coexist with Native American tribes well into modern times. Some are captured by the Ringling Brothers Circus, others by zoos. One herd becomes a Glacier National Park tourist attraction; the last few survivors die in the 1950s, along with the last guardians of Indians’ oral history.\n\nLakota biologist Liza Ivanoff follows in her grandmother’s footsteps when she creates a living cloned mammoth from tissues her foremother kept cryogenically preserved. The cloning project is funded by casino monies, and the same monies sponsor murals by an Indian artist. Eventually the idyllic scenes the murals depict become reality: eagles fly over undammed rivers where mammoth herds wade in restored bliss. Pointing up the political message of her fiction, PM Press also includes in this short book an essay by Arnason on the importance of “Writing Science Fiction During World War Three,” and an in-depth interview on her life and activism.\n\nAmelia Beamer’s “The Loving Dead” (Night Shade Books, 240 pp., $14.95) is riskiness of the risqué sort. Trader Joe’s employee Kate encounters her first zombie when she helps her belly-dance instructor fend off the amorous advances of a stranger. Soon the instructor succumbs to zombieism herself — but not before she and Kate make love, excited by pheromones the zombie plague releases at onset.\n\nThis sexually transmitted disease, which also turns its victims’ tongues “the color of well-done burger”and gives them an appetite for living human flesh, soon reduces California’s Bay Area to a shambles. Kate and her housemate Michael take refuge on Alcatraz Island with the help of iPhone apps and Googled research on authentic Haitian zombies. Fast-paced yet thought-provoking fun, “The Loving Dead’s” popularity with both chain and independent bookstores proves that taking chances can pay off.\n\nSeattle author Nisi Shawl is the winner of the 2009 James Tiptree Jr. Literary Award for her short-story collection “Filter House,” published by Seattle-based Aqueduct Press.\n\nBack to Eleanor Arnason’s Author Page"}, {"url": "https://clarkesworldmagazine.com/author/eleanor-arnason/", "page_content": "Eleanor Arnason\n\nEleanor Arnason published her first short story in 1974. Since then she has published six novels and 40+ short stories, all science fiction or fantasy. She won the first James Tiptree Jr. Award in 1991, a Minnesota Book Award in 1993 and a Spectrum Award in 2000. In addition, she has been a finalist for the Hugo, Nebula, Sturgeon and Sidewise Awards.\n\n“Checkerboard Planet” is one of a series of stories about location scout Lydia Duluth. One story, a short novel, has been published as Tomb of the Fathers. If all goes well, the other stories will appear in a collection in the not too distant future.\n\nWebsite\n\nEleanor Arnason has the following works available at Clarkesworld:\n\nCheckerboard Planet FICTION by Eleanor Arnason in Issue 123 – December 2016 The system was a type G yellow dwarf with six planets. Four of the planets were gas giants, the innermost so close to its primary that it skimmed the stellar atmosphere. Dark red in color, it had neither moons nor rings. It sped around its sun, inflated by heat to an impressive size and boiling […]"}, {"url": "https://sf-encyclopedia.com/entry/arnason_eleanor", "page_content": "Arnason, Eleanor\n\nEntry updated 12 September 2022. Tagged: Author.\n\n(1942- ) US author who began to publish sf with \"A Clear Day in the Motor City\" for New Worlds 6: The Science Fiction Quarterly (anth 1973; vt New Worlds #5 1974) edited by Michael Moorcock and Charles Platt. She has since published stories and poems with some regularity; a selection has appeared as Ordinary People (coll 2005). Her first novel, The Sword Smith (1978), is a Fantasy notable for the spare elegance of its narrative, which focuses with modest intensity upon its young protagonist's slow grasp of life's meaning; Daughter of the Bear King (1987) is also fantasy. Arnason's first sf novel, To the Resurrection Station (1986), which is suffused with Gothic imagery, brings a wide range of characters together in contexts which wittily embody Feminist readings of the world. With A Woman of the Iron People (1991; vt 2vols as In the Light of Sigma Draconis 1992 and Changing Women 1992), which won a James Tiptree Jr Award, Arnason came suddenly to wider notice. The long tale is set on a complicated stage: on the planet of Sigma Draconis II, inhabited by an Alien race seemingly in thrall – as is frequently the case in 1980s sf – to the imperatives of a sexually coercive biology (see Sex), a party of Terrans is attempting to come to some understanding of this species. The plot, in true Planetary Romance fashion, takes two humans and two aliens on a trek through the various domains and landscapes of the world, and lessons not unlike those taught in The Sword Smith – though far more complexly put – are imparted with regard to sexual dimorphism, the nature of violence and the intrinsic value of individual persons; and evidence is presented that Homo sapiens may have learned some wisdom from the Disasters which, prior to the novel's timespan, had almost destroyed Earth.\n\nSimilar dilemmas are examined, even more sharply, in the first story in the Hwarhath sequence, Ring of Swords (1993), where an interstellar war between humans and the Alien hwarhath, is at the point of being resolved in mutual understanding, or exploding calamitously. The chaotic ruthlessness of humanity, and the rigid gender separation of the hwarhath, are scrupulously exposed and judged in scenes of very considerable intellectual force; and the outcome – as perceived by some of the most complexly conceived characters in modern sf – is hopeful. Beginning with \"The Hound of Merin\" (in Xanadu, anth 1993 ed Jane Yolen and Martin H Greenberg), Arnason continued the sequence through an array of linked stories, all told from the hwarhath point of view; they have been assembled as Hwarhath Stories: Transgressive Tales by Aliens (coll of linked stories 2016), and complexly represent, especially in novellas like \"Dapple: A Hwarhath Historical Romance\" (September 1999 Asimov's) and \"The Potter of Bones\" (September 2000 Asimov's), an Anthropological perspective on Homo sapiens (in particular) that has over the years proved increasingly intense, evoking a number of comparisons with her older contemporary, Ursula K Le Guin. Such comparisons usefully point to what might be called the methodical brilliance of both authors, whenever a culture is to be examined, and its folk given their space to speak to us. More exuberantly, Big Mama Stories (coll 2013) applies Arnason's characteristic approach to a series of Tall Tales [see The Encyclopedia of Fantasy under links below] set in intergalactic space; Hidden Folk: Icelandic Fantasies (coll 2014), on the other hand, is unified by its focus on the folklore of Iceland. [JC]\n\nEleanor Atwood Arnason\n\nborn New York: 28 December 1942\n\nworks\n\nseries\n\nHwarhath\n\nindividual titles\n\ncollections\n\nlinks\n\nprevious versions of this entry"}, {"url": "https://eleanorarnason.com/", "page_content": "Please share!\n\nNOVELS, COLLECTIONS, CHAPBOOKS AND A FEW ANTHOLOGIES AND MAGAZINES\n\nMy old blog entries are here."}]}