{"Reezal Merican Naina Merican was born on 28 April 1988.": [{"url": "https://politikus.sinarproject.org/persons/reezal-merican-naina-merican", "page_content": "Dato' Sri Reezal Merican bin Naina Merican is a Malaysian politician, and currently serving as Minister of Youth and Sports since 10 March 2020\n\nAlina Cheong is the Private Secretary I to Reezal Merican, Youth and Sports Minister\n\nSpecial Officer to Minister of Youth and Sports, Reezal Merican\n\nSpecial Function Officer to Minister of Youth and Sports, Reezal Merican\n\nSpecial Function Officer to Minister of Youth and Sports, Reezal Merican\n\nSpecial Function Officer to Minister of Youth and Sports, Reezal Merican\n\nPolitical Secretary to Minister of Youth and Sports, Reezal Merican\n\nPress Secretary to Minister of Youths and Sports, Reezal Merican\n\nPrincipal Private Secretary to Minister of Youth and Sports, Reezal Merican\n\nHisham Ahmad Sabri is the Private Secretary II to Reezal Merican, Youth and Sports Minister\n\nProcurement Infrastructure Projects\n\nCited on Issues\n\nSubject has been cited for issues for the following known sources.\n\nThese are sources, and not weighted on strength to make a case for this subject. Please refer to editorial or enforcement guidelines."}, {"url": "https://www.digitalnewsasia.com/business/reezal-merican-appointed-new-matrade-chairman", "page_content": "The appointment is effective immediately\n\nHe previously held leadership positions at three ministries\n\nFormer minister Reezal Merican Naina Merican (pix) has been appointed as the ninth Chairman of the Malaysia External Trade Development Corporation (MATRADE) effective immediately.\n\nReezal Merican once served as the Minister of Housing & Local Government (2021-2022), Minister of Youth and Sports (2020-2021), and Deputy Foreign Minister (2015-2018). Additionally, he chaired Amanah Raya Bhd from 2013 to 2015.\n\nIn a statement, Matrade expressed confidence that his appointment will contribute to the growth and diversification of Malaysia's exports in new and existing global markets.\n\nReezal said, “I am honoured to be given the opportunity to serve as the Chairman of Matrade , with this role, combined with YB Minister of MITI’s leadership, we can better propel Malaysia's trade and export performance to remain excellent and achieve stronger growth.”\n\nMatrade is an agency under MITI and is mandated to execute trade promotion initiatives for the country. Established in 1993 after the enactment of the Matrade Act 1992, it executes two core activities of Exporters Development and Export Promotion.\n\nCurrently, it has six regional offices around Malaysia and 46 global offices ever-ready to assist Malaysian companies through exporters capacity building programmes, trade advisory and financial facilitation, business matching, market intelligence and market access, project negotiations and e-commerce."}, {"url": "https://id.wikipedia.org/wiki/Reezal_Merican_Naina_Merican", "page_content": "bin (b.) atau binti (bt.), jika digunakan, berarti \"putra dari\" atau \"putri dari\". Ini adalah nama Melayu; nama \"Naina Merican\" merupakan patronimik , bukan nama keluarga , dan tokoh ini dipanggil menggunakan nama depannya , \"Reezal Merican\". Kata) atau), jika digunakan, berarti \"putra dari\" atau \"putri dari\".\n\nDato' Sri Reezal Merican bin Naina Merican (Jawi: ريزال ماريکان بن ناينا ماريکان; lahir 29 Juli 1972) adalah seorang politikus asal Malaysia yang pernah menjabat sebagai Menteri Perumahan Rakyat dan Pemerintahan Daerah dari 2021 sampai 2022 dan mantan anggota parlemen untuk daerah pemilihan Kepala Batas sejak Mei 2013 hingga kekalahannya pada Pemilu Legislatif 2022.\n\nSebelum menjadi anggota Parlemen, Reezal bekerja di sektor perbankan.[1] Reezal mengambil alih posisi Abdullah Ahmad Badawi sebagai Ketua UMNO Kepala Batas dan sebagai calon Barisan Nasional (BN) untuk kursi parlemen Kepala Batas.[2] Reezal memenangkan kursi Kepala Batas pada Pemilu Legislatif 2013 setelah berhasil mengalahkan calon dari Partai Islam Se-Malaysia (PAS) dengan selisih suara 4,176 suara.[3] Pada Oktober 2013, ia terpilih menjadi anggota Dewan Tertinggi UMNO.[4] Pada perombakan kabinet pada 29 Juli 2015, ia ditunjuk menjadi Wakil Menteri Luar Negeri oleh mantan Perdana Menteri Najib Razak. Pada Pemilu Legislatif 2018, ia terpilih kembali sebagai anggota parlemen dan kembali menganggotai kabinet di bawah pemerintahan Muhyiddin Yassin dan Ismail Sabri Yaakob.\n\nPada 29 Agustus 2015, Reezal mengisyaratkan warga Malaysia yang berpartisipasi dalam demonstrasi Bersih 4 di luar negeri bahwa Kementerian Luar Negeri akan mengumpulkan informasi mereka untuk tindakan hukum terhadap mereka, bahkan tanpa menyebutkan undang-undang mana yang dilanggar oleh warga negara di luar negeri.[5]\n\nReezal dikabarkan akan menikah dengan istri ketiga, mantan aktris tahun sembilan puluhan Mas Anizan.[6] Setelah istri pertama Ismalina Ismail dan istri kedua Sharifah Norhaslinda yang pernah mengajukan gugatan cerai dengan Reezal namun ditarik kembali.[7]"}, {"url": "https://www.malaymail.com/news/malaysia/2021/04/08/party-polls-only-way-for-umno-to-resolve-issues-says-supreme-council-member/1964923", "page_content": "BUKIT MERTAJAM, April 8 — Umno Supreme Council member Datuk Seri Reezal Merican Naina Merican has urged the party to hold elections as soon as possible to resolve its internal issues.\n\nReezal Merican, who is also Youth and Sports Minister and Kepala Batas MP, said Umno elections should also be expedited as the term for Supreme Council members and division office bearers ends in May.\n\n“If the DAP and other parties can hold party elections without delays, there is no reason why Umno can’t do the same. Party elections must be held as soon as possible as it is the only democratic way (to resolve the party’s issues).\n\n“By holding elections, we will send out the message that we are sticking firm to our promises and oaths,” he told reporters after officiating the 2021 state-level Teachers Day celebrations here today.\n\nOn the audio recording of a conversation purportedly between Umno president Datuk Seri Ahmad Zahid Hamidi and his PKR counterpart Datuk Seri Anwar Ibrahim that went viral recently, Reezal Merican said personally, he felt the recording was very disturbing.\n\n“Personally, it is very disturbing from several aspects such as who is behind it, the conversation itself and the question of authenticity, but I am glad that the president himself has come out to deny any involvement,” he said. — Bernama"}, {"url": "https://www.malaymail.com/news/malaysia/2021/05/03/national-sports-council-ordered-to-probe-claims-of-athletes-being-verbally/1971266", "page_content": "KUALA LUMPUR, May 3 — Youth and Sports Minister Datuk Seri Reezal Merican Naina Merican today ordered the National Sports Council (NSC) to look into allegations of mental abuse after the sibling of a national athlete took to social media to expose the abusive conduct of a Taekwando coach.\n\nReezal Merican was responding to the social media post by Lavinnia Subramaniam yesterday, who alleged that her sister — 23-year-old Dhaassheni Subramaniam — was humiliated in front of the national team by coach Rusfredy Tokan Petrus, who hurled insults at her, including regarding her deceased mother.\n\n“Thank you for the information. I have instructed the director-general of NSC Malaysia to investigate this matter immediately,” Reezal said in a Twitter reply.\n\nYBM @reezal_merican , is this how our national heroes are being treated by MSN ?\n\n\n\nKebajikan atlit negara tidak dijaga dan dihina oleh ketua jurulatih dan tiada tindakan diambil oleh pihak MSN walaupun telah dilapor !\n\n\n\nThe coach was also intoxicated, do help to get attention pls pic.twitter.com/aTCLE4vMuV — Dharshinee Suresh Kumar (@ayeitsdharsh) May 3, 2021\n\nA police report made yesterday by Dhaassheni’s father, Subramaniam Raghavan, was also shared on social media detailing the alleged abuse.\n\nThe report claimed that at 10.30pm on April 28, Rusfredy allegedly convened all Taekwondo athletes at the NSC premises in Bukit Jalil, and spoke harshly to the athletes.\n\n“He then approached my daughter and spoke very harsh words such as ‘my brother died for the nation, but your mother died for nothing’. The coach then told my daughter he would use his ‘cables’ to eliminate my daughter from the national team,” read Subramaniam’s report.\n\nSubramaniam also reported that Rusfredy allegedly smelled of alcohol at the time of the incident.\n\nWhen contacted, Lavinnia said her sister had joined the national Taekwondo team in August last year, and Rusfredy has mentally abused her sister on several occasions since then.\n\n“We don’t even know why he has been doing this to her,” she said.\n\nShe added that their mother passed away in 2017 due to cancer."}, {"url": "https://www.bernama.com/en/general/news_disaster.php?id=2048614", "page_content": "NATIONAL DISASTER\n\n02/02/2022 12:39 PM\n\nNIBONG TEBAL, Feb 2 -- The fire at more than 11 hectares site of the Pulau Burung landfill in Jalan Byram, here, that began on Jan 12, was fully extinguished yesterday. The matter was shared by Housing and Local Government Minister Datuk Seri Reezal Merican Naina Merican in a post on his Facebook page. He said the success was made possible by the strong commitment and cooperation of all parties involved in the fire extinguishing operation.\n\n“Alhamdulillah (praise be to Allah), the mission to put out the fire at the Pulau Burung landfill has been completed. “I would like to thank the #WiraMerah Penang team as well as several other federal and state agencies involved in the operation,” he said. Meanwhile, state Environment and Welfare Committee chairman Phee Boon Poh said the Penang Department of Environment would continue to monitor the area to ensure there were no more hotspots that could trigger a fire at the landfill.\n\n“The department will also monitor the air pollutant index (API) at the Sekolah Jenis Kebangsaan Tamil (SJKT) Ladang Byram station to ensure it is safe for residents in the area to return to their homes,” he said. He said the area recorded moderate API of 73 at 10am, a slight drop from its 7am reading of 74. The landfill fire incident was reported at about 5 pm on Jan 12 and nearby residents were asked to evacuate to a relief centre, while 10 schools in the vicinity were ordered to close."}, {"url": "https://www.benarnews.org/english/news/malaysian/Reezal-05112016182519.html", "page_content": "Malaysian Deputy Foreign Minister Reezal Merican Naina Merican speaks at the United Nations in New York, May 10, 2016.\n\nMalaysia at the U.N. Security Council on Wednesday stressed the need for a collective social media effort to counter the narrative put forward by the Islamic State and other terrorist groups.\n\n“We believe there is a need to encourage more IT [information technology] and media savvy Muslim public figures and scholars to reach out to the youth via the social media to provide a counter narrative, including to clarify the concept of jihad [holy war] that has been twisted to serve the terrorist agenda,” Reezal Merican Naina Merican, the deputy Malaysian foreign minister, told a Security Council forum in New York.\n\n“At times, the promise of heavenly reward and spiritual salvation has led some to become misguided and fall for the terrorist narrative,” he said during the open debate on “Threats to international peace and security caused by terrorist acts: Countering the narratives and ideologies of terrorism.”\n\nDescribing past international efforts to counter terrorism and violent extremism, he said that while they had seen varying degrees of success, “the international community could and must do more.”\n\nRejecting any association of terrorism with any one religion, nationality or ethnic group, he said however that Muslims “should not be in denial.” He emphasized a critical need to address what he called the exploitation of Islam by terrorist groups which had led, he said, to a perceived link between the religion, Muslims and terrorism.\n\n“Peace was the very definition of Islam,” Reezal said, denouncing claims by terrorists that the religion sanctioned acts of barbarity.\n\n“True Muslims did not accept ideologies that espouse hatred, wanton violence and destruction,” he said.\n\nFor those who were marginalized, disenchanted or disenfranchised, an ideology could be a powerful thing, Reezal continued, stressing that countering terrorist narratives meant removing the root causes of marginalization, disenchantment and disenfranchisement, while exposing the “fallacy” of terrorist narratives.\n\nHe said part of Malaysia’s effort to counter the extremist narrative was to engage with religious and community leaders in spreading “accurate” messages about Islam.\n\nInternational framework\n\nThe one-day forum was aimed at providing a platform to discuss and exchange views on an international strategy for countering the narratives and ideologies of terrorist groups, particularly IS, and explore a possible mechanism to coordinate, follow-up and mobilize international action and resources in countering terrorism.\n\nThe Security Council on Wednesday requested its main counter-terrorism subsidiary body to present a proposal by next April for a comprehensive international framework on countering terrorist propaganda.\n\nThe 15-nation council asked its Counter-Terrorism Committee (CTC) to recommend guidelines and good practices to effectively counter the ways that IS, al-Qaeda and other terror groups use their narratives to encourage and recruit others to commit terrorist acts.\n\nThe CTC would work closely with the Counter-Terrorism Committee Executive Directorate (CTED), the Counter-Terrorism Implementation Task Force (CTITF) and other relevant bodies, as well as interested U.N. member states.\n\nThe council noted with concern that IS and other terror groups “craft distorted narratives that are based on the misinterpretation and misrepresentation of religion to justify violence.”\n\nIn his opening remarks at the open debate, U.N. Deputy Secretary-General Jan Eliasson emphasized that terrorist groups were exploiting religious beliefs in order to incite hatred and violence and to divide and polarize societies.\n\n“Terrorists and violent extremists blatantly challenge the values enshrined in the United Nations Charter, the Universal Declaration of Human Rights as well as our shared pursuit of peace, justice and human dignity,” he said.\n\n“Faith in fundamental human rights, in the dignity and worth of the human person, and the primacy of global solidarity represent the greatest force in our hands to counter terrorist narratives and ideologies,” Eliasson said."}, {"url": "https://www.malaymail.com/news/sports/2021/04/03/spectators-allowed-in-stadiums-from-april-6-says-sports-minister/1963592", "page_content": "KUALA LUMPUR, April 3 — Great news for local football fans as Youth and Sports Minister Datuk Seri Reezal Merican Naina Merican has confirmed that spectators will be allowed to watch Malaysia League (M-League) matches at stadiums starting April 6.\n\nThis is after Reezal Merican went to watch the pilot project match for spectator admission to the stadiums, between Johor Darul Ta’zim (JDT) and Melaka United FC, at the Sultan Ibrahim Stadium, Iskandar Puteri, yesterday, according to a statement issued by the Malaysian Football League (MFL) today.\n\nIt said that the monitoring and compliance with the standard operating procedures (SOPs) at the Sultan Ibrahim Stadium has convinced the National Security Council (MKN) to give the green light to the MFL in allowing the re-entry of spectators.\n\n“Thus far, what I can say is that there are no restrictions for spectators to enter (stadiums) for other matches because, based on observations by the MKN, they are satisfied overall.\n\n“I have actually received the approval but if there are other observations by the MKN, perhaps another decision will be made. However, for now, I can say there is no problem,” Reezal Merican was quoted as saying in the statement.\n\nYesterday, 2,000 football fans were allowed to enter the stadium starting at 6 pm, before the doors closed at 8.30 pm. They watched the match by practicing physical distancing throughout.\n\nBased on the SOPs for the CMCO areas, the spectator capacity in stadiums is 10 per cent with a maximum of 2,000 people, while for stadiums in areas placed under the Recovery MCO (RMCO) it is 25 per cent with a maximum of 8,000 people, with strict supervision at all times.\n\nMeanwhile, MFL chief executive officer Datuk Ab Ghani Hassan, who welcomed the positive development, also hoped that the management of other teams would be ready to accept spectators at their respective venues.\n\n“The positive development shown here will hopefully be the beginning, to be followed in other venues in the seventh match of the Super League.\n\n“Through the gazetting (of the pilot project) which allows supporters to enter stadiums from April 1, MFL is fully prepared, and will hold a meeting in the near future with all teams to discuss this matter,” he added.\n\nAll Super League and Premier League matches are still subject to MFL approval, where each team must submit a document on spectator entry permission first, the statement read. — Bernama"}, {"url": "https://wiki.alquds.edu/?query=Reezal_Merican_Naina_Merican", "page_content": "Malaysian politician\n\nNaina Merican is a Reezal Merican. The Arabic-derived word \"bin\" or \"binti\"/\"binte\", if used, means 'son of' or 'daughter of', respectively. In this Malay name , there is no family name . The nameis a patronymic , and the person should be referred to by the given name . The Arabic-derived word \"bin\" or \"binti\"/\"binte\", if used, means 'son of' or 'daughter of', respectively.\n\nReezal Merican bin Naina Merican (Jawi: ريزال ماريکان بن ناينا ماريکان‎;[1] born 29 July 1972) is a Malaysian politician and banker who has served as the 9th Chairman of the Malaysia External Trade Development Corporation (MATRADE) since May 2023.[2] He served as the Minister of Housing and Local Government in the Barisan Nasional (BN) administration under former Prime Minister Ismail Sabri Yaakob from August 2021 to the collapse of the BN administration in November 2022, the Minister of Youth and Sports in the Perikatan Nasional (PN) administration under former Prime Minister Muhyiddin Yassin from March 2020 to the collapse of the PN administration in August 2021 and the Member of Parliament (MP) for Kepala Batas from May 2013 after the retirement of 5th and former Prime Minister Abdullah Ahmad Badawi as the MP from politics to his electoral defeat in November 2022. He is also a member and Division Chief of Kepala Batas of the Supreme Council of the United Malays National Organisation (UMNO), a component party of the BN coalition. He has also served as Chief of the Elections Department of UMNO since March 2023. He is an ethnic Malay of mixed Indian descent.\n\nBefore entering Parliament, Reezal worked in the bank sector.[3] Reezal took over Abdullah as the party's Division Head of Kepala Batas and as the Barisan Nasional (BN) candidate for the parliamentary seat.[4] Reezal won the seat in the 2013 Malaysian general election while defeated a candidate from the Malaysian Islamic Party (PAS) by 4,176 majority of the votes.[5] In October 2013, he was elected to Supreme Council of UMNO, the highest-ranking body of the party.[6] In a Cabinet reshuffle on 28 July 2015, Reezal was handpicked as Deputy Minister of Foreign Affairs by former Prime Minister Najib Razak. Despite winning the majority to defend his seat in his parliamentary constituency, Reezal lost his Cabinet post following the results of the 2018 Malaysian general election.\n\nControversy [ edit ]\n\nOn 29 August 2015, Reezal intimidated Malaysians participating in the Bersih 4 demonstrations abroad that the Foreign Ministry would gather their information for eventual legal action against them, without even citing which law the citizen abroad violated.[7]\n\nFamily [ edit ]\n\nAfter first wife Ismalina Ismail and second wife Sharifah Norhaslinda which once filed for divorce with Reezal but retracted.[8]\n\nElection results [ edit ]\n\nHonours [ edit ]\n\nSee also [ edit ]\n\nReferences [ edit ]\n\n\n\n"}, {"url": "https://www.theborneopost.com/2021/07/08/not-impossible-for-first-time-olympic-athletes-to-garner-success-reezal-merican/", "page_content": "KUALA LUMPUR (July 8): Youth and Sports Minister Datuk Seri Reezal Merican Naina Merican said it is not impossible for the country’s young athletes to make a victorious debut at the Olympic Games in Tokyo, Japan this month.\n\nReezal Merican said history had proven that from the 11 medals won in 17 Olympic appearances of the national contingent so far, four were contributed by athletes in the maiden appearances in the world’s biggest sporting event.\n\nHe said they were the three men’s badminton doubles pairs, Datuk Razif Sidek-Datuk Seri Jalani Sidek in Barcelona 1992 (bronze); Cheah Soon Kit-Yap Kim Hock in Atlanta 1996 (silver) and Goh V Shem-Tan Wee Kiong in Rio 2016 (silver) as well as diving queen Pandelela Rinong in London 2012 (bronze).\n\n“Before this. we saw four national representatives winning medals at the Olympic Games (when competing for the first time) and this means athletes participating in Tokyo soon, could also repeat the earlier successes,” he told a virtual media conference today.\n\nReezal Merican had earlier held an online session with coaches and managers of the national contingent to the Olympic Games today.\n\nA total of 30 athletes have qualified for Tokyo Olympics and among the new faces are Lee Zii Jia (badminton); Aaron Chia-Soh Wooi Yik (badminton); Farah Ann Abdul Hadi (gymnastics); and Muhammad Shah Firdaus Sahrom (cycling).\n\nMeanwhile, Reezal Merican said based on the sharing of information by the national contingent coaches and managers, all athletes are raring to go despite the Covid-19 pandemic which is still affecting the world now.\n\nIn this regard, he again stressed that all athletes including officers and coaches should emphasise on their safety and health apart from complying with all protocols set by Tokyo Olympics organiser to prevent infection as well as being cautious on doping issue.\n\nAt the same time, he said only four team managers from aquatics, badminton, golf and athletics would be going to Tokyo while other sports would be managed by their respective coaches there.\n\n“The Olympic Council of Malaysia secretary-general Datuk Mohd Nazifuddin Najib will be acting as the chief de mission (CDM) in terms of administration in Japan while Datuk Lee Chong Wei would remain as the actual CDM,” he added.\n\nOn Monday, Reezal Merican confirmed that Chong Wei would not be going to Japan on health factor and on doctor’s advice which did not allow him to go oversea but he would be monitoring the performance of athletes virtually throughout championship.\n\nIn this regard, he also announced meeting all athletes on Saturday to track their latest developments followed by a message from the Prime Minister Tan Sri Muhyiddin Yassin on July 13. – Bernama"}], "Reezal Merican Naina Merican is a politician.": [{"url": "https://www.digitalnewsasia.com/business/reezal-merican-appointed-new-matrade-chairman", "page_content": "The appointment is effective immediately\n\nHe previously held leadership positions at three ministries\n\nFormer minister Reezal Merican Naina Merican (pix) has been appointed as the ninth Chairman of the Malaysia External Trade Development Corporation (MATRADE) effective immediately.\n\nReezal Merican once served as the Minister of Housing & Local Government (2021-2022), Minister of Youth and Sports (2020-2021), and Deputy Foreign Minister (2015-2018). Additionally, he chaired Amanah Raya Bhd from 2013 to 2015.\n\nIn a statement, Matrade expressed confidence that his appointment will contribute to the growth and diversification of Malaysia's exports in new and existing global markets.\n\nReezal said, “I am honoured to be given the opportunity to serve as the Chairman of Matrade , with this role, combined with YB Minister of MITI’s leadership, we can better propel Malaysia's trade and export performance to remain excellent and achieve stronger growth.”\n\nMatrade is an agency under MITI and is mandated to execute trade promotion initiatives for the country. Established in 1993 after the enactment of the Matrade Act 1992, it executes two core activities of Exporters Development and Export Promotion.\n\nCurrently, it has six regional offices around Malaysia and 46 global offices ever-ready to assist Malaysian companies through exporters capacity building programmes, trade advisory and financial facilitation, business matching, market intelligence and market access, project negotiations and e-commerce."}, {"url": "https://www.malaymail.com/news/malaysia/2023/05/02/former-minister-reezal-merican-is-new-matrade-chairman/67279", "page_content": "KUALA LUMPUR, May 2 — Former minister Datuk Seri Reezal Merican Naina Merican has been appointed as the ninth chairman of the Malaysia External Trade Development Corporation (Matrade) effective immediately.\n\nReezal Merican has an extensive track record in government service, having served as the Minister of Housing and Local Government (2021-2022), Minister of Youth and Sports (2020-2021), and Deputy Foreign Minister (2015-2018). Additionally, he chaired Amanah Raya Bhd from 2013 to 2015.\n\n“I am honoured to be given the opportunity to serve as the chairman of Matrade. With this role, combined with Minister of Miti’s (Ministry of Investment, Trade and Industry) leadership, we can better propel Malaysia’s trade and export performance to remain excellent and achieve stronger growth,” he said in a statement today.\n\nGiven his extensive experience in international affairs, diplomacy, government administration, and industry relations, he is well-positioned to lead and guide Malaysia’s national trade promotion agenda and facilitate export-oriented investments into the country, Matrade said.\n\nThe agency said his appointment as chairman will contribute to the growth and diversification of Malaysia’s exports in new and existing global markets.\n\nMatrade is an agency under Miti and is mandated to execute trade promotion initiatives for the country. Established in 1993 after the enactment of the Matrade Act 1992, Matrade executes two core activities: exporters development and export promotion.\n\nCurrently, it has six regional offices in Malaysia and 46 global offices ever-ready to assist Malaysian companies through exporters capacity building programmes, trade advisory and financial facilitation, business matching, market intelligence and market access, project negotiations and e-commerce. — Bernama"}, {"url": "https://politikus.sinarproject.org/persons/reezal-merican-naina-merican", "page_content": "Dato' Sri Reezal Merican bin Naina Merican is a Malaysian politician, and currently serving as Minister of Youth and Sports since 10 March 2020\n\nAlina Cheong is the Private Secretary I to Reezal Merican, Youth and Sports Minister\n\nSpecial Officer to Minister of Youth and Sports, Reezal Merican\n\nSpecial Function Officer to Minister of Youth and Sports, Reezal Merican\n\nSpecial Function Officer to Minister of Youth and Sports, Reezal Merican\n\nSpecial Function Officer to Minister of Youth and Sports, Reezal Merican\n\nPolitical Secretary to Minister of Youth and Sports, Reezal Merican\n\nPress Secretary to Minister of Youths and Sports, Reezal Merican\n\nPrincipal Private Secretary to Minister of Youth and Sports, Reezal Merican\n\nHisham Ahmad Sabri is the Private Secretary II to Reezal Merican, Youth and Sports Minister\n\nProcurement Infrastructure Projects\n\nCited on Issues\n\nSubject has been cited for issues for the following known sources.\n\nThese are sources, and not weighted on strength to make a case for this subject. Please refer to editorial or enforcement guidelines."}, {"url": "https://alchetron.com/Reezal-Merican-Naina-Merican", "page_content": "Datuk Seri Reezal Merican bin Naina Merican is a Malaysian politician. He is the Member of the Parliament of Malaysia for the seat of Kepala Batas in the state of Penang. He is also a member of the Supreme Council of the United Malays National Organisation (UMNO), the leading party in Malaysia's ruling Barisan Nasional coalition. He is Malay.\n\nContents\n\nBefore entering Parliament, Reezal worked in the bank sector. When the former Prime Minister Abdullah Badawi retired from politics ahead of the 2013 election, Reezal succeeded him as the division head of UMNO in Kepala Batas and as the Barisan Nasional candidate for the Kepala Batas parliamentary seat. Reezal won the seat at the election, defeating a Pan-Malaysian Islamic Party (PAS) candidate by 4,176 votes. In October 2013, he was one of 25 elected to UMNO's Supreme Council, the body that governs the party.\n\nOn 28 July 2015, in cabinet reshuffle made by the Prime Minister, Datuk Seri Reezal was picked to be the Deputy Minister of Foreign Affairs\n\nOn 29 August 2015, Reezel intimated that the Foreign Ministry would gather information on Malaysians participating in the Bersih 4 demonstrations abroad for eventual legal action against them, without even citing which law the citizen abroad violated.\n\nReezal is rumoured to marry a third wife. After first wife Ismalina Ismail and second wife Sharifah Norhaslinda which once filed for divorce with Reezal but retracted."}, {"url": "https://www.owlapps.net/owlapps_apps/articles?id=44639090&lang=en", "page_content": "Reezal Merican bin Naina Merican (Jawi: ريزال ماريکان بن ناينا ماريکان‎; born 29 July 1972) is a Malaysian politician and banker who has served as the 9th Chairman of the Malaysia External Trade Development Corporation (MATRADE) since May 2023. He served as the Minister of Housing and Local Government in the Barisan Nasional (BN) administration under former Prime Minister Ismail Sabri Yaakob from August 2021 to the collapse of the BN administration in November 2022, the Minister of Youth and Sports in the Perikatan Nasional (PN) administration under former Prime Minister Muhyiddin Yassin from March 2020 to the collapse of the PN administration in August 2021 and the Member of Parliament (MP) for Kepala Batas from May 2013 after the retirement of 5th and former Prime Minister Abdullah Ahmad Badawi as the MP from politics to his electoral defeat in November 2022. He is also a member and Division Chief of Kepala Batas of the Supreme Council of the United Malays National Organisation (UMNO), a component party of the BN coalition. He has also served as Chief of the Elections Department of UMNO since March 2023. He is an ethnic Malay of mixed Indian descent.\n\nBefore entering Parliament, Reezal worked in the bank sector. Reezal took over Abdullah as the party's Division Head of Kepala Batas and as the Barisan Nasional (BN) candidate for the parliamentary seat. Reezal won the seat in the 2013 Malaysian general election while defeated a candidate from the Malaysian Islamic Party (PAS) by 4,176 majority of the votes. In October 2013, he was elected to Supreme Council of UMNO, the highest-ranking body of the party. In a Cabinet reshuffle on 28 July 2015, Reezal was handpicked as Deputy Minister of Foreign Affairs by former Prime Minister Najib Razak. Despite winning the majority to defend his seat in his parliamentary constituency, Reezal lost his Cabinet post following the results of the 2018 Malaysian general election.\n\nControversy\n\nOn 29 August 2015, Reezal intimidated Malaysians participating in the Bersih 4 demonstrations abroad that the Foreign Ministry would gather their information for eventual legal action against them, without even citing which law the citizen abroad violated.\n\nFamily\n\nAfter first wife Ismalina Ismail and second wife Sharifah Norhaslinda which once filed for divorce with Reezal but retracted.\n\nElection results\n\nHonours\n\nPahang : Knight Companion of the Order of the Crown of Pahang (DIMP) – Dato' (2006) Grand Knight of the Order of Sultan Ahmad Shah of Pahang (SSAP) – Dato' Sri (2008)\n\nPahang :\n\nSee also"}, {"url": "https://www.malaymail.com/news/malaysia/2021/11/01/property-rental-minister-admits-discrimination-exists-says-very-awkward-to/2017524", "page_content": "KUALA LUMPUR, Nov 1 — Racial discrimination does exist in Malaysia’s property rental market, Local Government Minister Datuk Seri Reezal Merican Naina Merican acknowledged in Parliament today.\n\nHowever, he said it would be “very awkward” to enact a law that seeks a fair balance between the rights of both landlords and tenants while including the landlord’s preference for certain tenants, even if other countries have clear-cut anti-discrimination legislations.\n\n“The discrimination issue raised by YB, yes it is true, I have listened and seen it myself but at this moment we are still studying in detail in terms of local circumstances.\n\n“There are similar Acts in Australia and even in the United States which prohibits any form of sale advertisements by including one’s preference.\n\n“But in Malaysia, when we talk about discrimination, it comes down to preference. It would be very awkward to have Acts supporting the preference of owners’ rights but we will conduct further studies on the suitability of including the elements raised by YB,” Reezal Merican said during Question Time in the Dewan Rakyat.\n\nHe was replying Bangi MP Ong Kian Ming who wanted to know if the soon-to-be tabled Residential Tenancy Act would address racial discrimination in Malaysia’s property rental market.\n\nReezal Merican said the “real spirit” of the proposed law is to balance the rights of tenants and property owners.\n\nHe said the Residential Tenancy Act is meant to standardise rental agreements and establish a tribunal to resolve disputes between tenants and landlords.\n\n“At this moment, the preparation of residential rental agreements utilises the procedures stipulated under the Contract Act where the agreements are generally non-comprehensive and do not fully protect the interests and rights of tenants and owners of premises,” he said.\n\nHe said the new law is in the final stages of its drafting and is scheduled for tabling in Parliament in July 2022.\n\nReezal Merican explained that the draft of Malaysia’s Residential Tenancy Act is modelled after the Residential Tenancies Act 2010 in New South Wales, Australia.\n\nHe added that similar laws from Germany, the United Kingdom and South Africa were used as comparisons.\n\n“Apart from comprehensive stakeholders’ meetings, a Regulatory Impact Assessment will also be implemented by the Malaysia Productivity Corporation to identify and assess the effects from suggestions gathered towards the drafting of the Bill,” he said.\n\nHe also pointed out that since the relationship between landlords and their tenants fell under the state’s jurisdiction as provided under Article 76(4) of the Federal Constitution, proposals outlined in the Bill is set for tabling in the National Council for Local Government before it is presented to the Attorney General’s Chambers for a final review."}, {"url": "https://en.unionpedia.org/Reezal_Merican_Naina_Merican", "page_content": "Reezal Merican Naina Merican Datuk Seri Reezal Merican bin Naina Merican is a Malaysian politician. [1]\n\n26 relations: Abdullah Ahmad Badawi, Barisan Nasional, Dewan Rakyat, Election Commission of Malaysia, Hamzah Zainudin, Indian people, Kepala Batas (federal constituency), Kepala Batas, Penang, Malay language, Malay race, Malay styles and titles, Malaysiakini, Malaysian general election, 2004, Malaysian general election, 2013, Malaysian general election, 2018, Malaysian Islamic Party, Malaysians, Member of parliament, Ministry of Foreign Affairs (Malaysia), National Trust Party (Malaysia), Pakatan Harapan, Parliament of Malaysia, Penang, The Star (Malaysia), United Malays National Organisation, Utusan Malaysia.\n\nTun Dato' Seri Haji Abdullah bin Haji Ahmad Badawi (Jawi: عبد الله بن حاج احمد بداوي; born 26 November 1939) is a Malaysian politician who served as Prime Minister of Malaysia from 2003 to 2009.\n\nNew!!: Reezal Merican Naina Merican and Abdullah Ahmad Badawi · See more »\n\nThe National Front (Barisan Nasional; abbrev: BN) is a political coalition in Malaysia that was founded in 1973 as a coalition of right-wing and centre parties.\n\nNew!!: Reezal Merican Naina Merican and Barisan Nasional · See more »\n\nThe Dewan Rakyat (Malay for House of Representatives, literally People's Hall) is the lower house of the Parliament of Malaysia, consisting of members elected during elections from federal constituencies drawn by the Election Commission.\n\nNew!!: Reezal Merican Naina Merican and Dewan Rakyat · See more »\n\nThe Election Commission of Malaysia (Suruhanjaya Pilihan Raya Malaysia), abbreviated SPR or EC, is a commission set up for the purpose of ensuring fair and equitable operations in undertaking the Malaysian General Elections.\n\nNew!!: Reezal Merican Naina Merican and Election Commission of Malaysia · See more »\n\nDato' Seri Hamzah bin Zainudin (born 12 March 1957) is a Malaysian politician and is the Member of the Parliament of Malaysia for the Larut constituency in Perak.\n\nNew!!: Reezal Merican Naina Merican and Hamzah Zainudin · See more »\n\nNo description.\n\nNew!!: Reezal Merican Naina Merican and Indian people · See more »\n\nKepala Batas is a federal constituency in Penang, Malaysia, that has been represented in the Dewan Rakyat since 1974.\n\nNew!!: Reezal Merican Naina Merican and Kepala Batas (federal constituency) · See more »\n\nKepala Batas is a town in North Seberang Perai, Penang, Malaysia.\n\nNew!!: Reezal Merican Naina Merican and Kepala Batas, Penang · See more »\n\nMalay (Bahasa Melayu بهاس ملايو) is a major language of the Austronesian family spoken in Brunei, Indonesia, Malaysia and Singapore.\n\nNew!!: Reezal Merican Naina Merican and Malay language · See more »\n\nThe concept of a Malay race was originally proposed by the German physician Johann Friedrich Blumenbach (1752–1840), and classified as a brown race.\n\nNew!!: Reezal Merican Naina Merican and Malay race · See more »\n\nThe Malay language has a complex system of styles, titles and honorifics, which are used extensively in Brunei and Malaysia.\n\nNew!!: Reezal Merican Naina Merican and Malay styles and titles · See more »\n\nMalaysiakini (Meaning in English: \"Malaysia Today\") is an online news portal published in English, Malay, Chinese and Tamil.\n\nNew!!: Reezal Merican Naina Merican and Malaysiakini · See more »\n\nA general election was held on Sunday, 21 March 2004 for members of the 11th Parliament of Malaysia.\n\nNew!!: Reezal Merican Naina Merican and Malaysian general election, 2004 · See more »\n\nGeneral elections were held in Malaysia on Sunday, 5 May 2013 for members of the 13th Parliament.\n\nNew!!: Reezal Merican Naina Merican and Malaysian general election, 2013 · See more »\n\nThe 2018 Malaysian general election (formally the 14th Malaysian general election) was held on 9 May 2018 to elect members to the Dewan Rakyat of the 14th Parliament of Malaysia.\n\nNew!!: Reezal Merican Naina Merican and Malaysian general election, 2018 · See more »\n\nThe Malaysian Islamic Party (PAS; Parti Islam Se-Malaysia; formerly known as Malayan Islamic Party) is an Islamist political party in Malaysia.\n\nNew!!: Reezal Merican Naina Merican and Malaysian Islamic Party · See more »\n\nMalaysians are the people who are identified with the country of Malaysia.\n\nNew!!: Reezal Merican Naina Merican and Malaysians · See more »\n\nA member of parliament (MP) is the representative of the voters to a parliament.\n\nNew!!: Reezal Merican Naina Merican and Member of parliament · See more »\n\nThe Ministry of Foreign Affairs (Kementerian Luar Negeri), abbreviated KLN, is a ministry of the Government of Malaysia that is responsible for foreign affairs, Malaysian diaspora, foreigners in Malaysia, diplomacy, foreign relations, counter terrorism, bilateral affairs, multilateral affairs, ASEAN, international protocol, consular services, maritime affairs, chemical weapons.\n\nNew!!: Reezal Merican Naina Merican and Ministry of Foreign Affairs (Malaysia) · See more »\n\nThe National Trust Party (Amanah; Parti Amanah Negara) is a registered political party in Malaysia advocating political Islam.\n\nNew!!: Reezal Merican Naina Merican and National Trust Party (Malaysia) · See more »\n\nThe Alliance of Hope (Pakatan Harapan; abbrev: PH) is a political coalition in Malaysia.\n\nNew!!: Reezal Merican Naina Merican and Pakatan Harapan · See more »\n\nThe Parliament of Malaysia (Parlimen Malaysia) is the national legislature of Malaysia, based on the Westminster system.\n\nNew!!: Reezal Merican Naina Merican and Parliament of Malaysia · See more »\n\nPenang is a Malaysian state located on the northwest coast of Peninsular Malaysia, by the Malacca Strait.\n\nNew!!: Reezal Merican Naina Merican and Penang · See more »\n\nThe Star is an English-language, tabloid-format newspaper in Malaysia.\n\nNew!!: Reezal Merican Naina Merican and The Star (Malaysia) · See more »\n\nThe United Malays National Organisation (Malay: Pertubuhan Kebangsaan Melayu Bersatu; Jawi: ڤرتوبوهن کبڠساءن ملايو برساتو, abbreviated UMNO or lesser known as PEKEMBAR) is Malaysia's main opposition political party.\n\nNew!!: Reezal Merican Naina Merican and United Malays National Organisation · See more »\n\nUtusan Malaysia (literally The Malaysian Courier) is a Malay-language newspaper published in Malaysia.\n\nNew!!: Reezal Merican Naina Merican and Utusan Malaysia · See more »\n\nReferences\n\n[1] https://en.wikipedia.org/wiki/Reezal_Merican_Naina_Merican"}, {"url": "https://en.unionpedia.org/i/Reezal_Merican_Naina_Merican", "page_content": "Reezal Merican Naina Merican Datuk Seri Reezal Merican bin Naina Merican is a Malaysian politician. [1]\n\n19 relations: Anifah Aman, Bandar Bertam Perdana, Barisan Nasional, Constituencies of Penang, International Islamic University Malaysia, Kepala Batas (federal constituency), List of candidates of the Malaysian general election, 2018, List of Malaysian politicians of Indian descent, Malaysian general election, 2018, Members of the Dewan Rakyat, 13th Malaysian Parliament, Members of the Dewan Rakyat, 14th Malaysian Parliament, Public Accounts Committee (Malaysia), Results of the Malaysian general election, 2013 by parliamentary constituency, Results of the Malaysian general election, 2018 by parliamentary constituency, Seberang Perai, Second Najib cabinet, United Malays National Organisation, United Malays National Organisation leadership election, 2013, United Malays National Organisation leadership election, 2018.\n\nDato' Sri Anifah Bin Haji Aman (born 16 November 1953) is a Malaysian politician who had served as the Minister of Foreign Affairs of Malaysia from 2009 to May 2018.\n\nNew!!: Reezal Merican Naina Merican and Anifah Aman · See more »\n\nBertam Perdana is a new established neighbourhood located in Kepala Batas, North Seberang Perai District, Penang, Malaysia.\n\nNew!!: Reezal Merican Naina Merican and Bandar Bertam Perdana · See more »\n\nThe National Front (Barisan Nasional; abbrev: BN) is a political coalition in Malaysia that was founded in 1973 as a coalition of right-wing and centre parties.\n\nNew!!: Reezal Merican Naina Merican and Barisan Nasional · See more »\n\nConstituencies in Penang are electoral divisions within the Malaysian state of Penang, of which there are two types.\n\nNew!!: Reezal Merican Naina Merican and Constituencies of Penang · See more »\n\nThe International Islamic University Malaysia (Universiti Islam Antarabangsa Malaysia; الجامعة الإسلامية العالمية بماليزيا), also known as IIUM or UIAM, is a public university in Malaysia.\n\nNew!!: Reezal Merican Naina Merican and International Islamic University Malaysia · See more »\n\nKepala Batas is a federal constituency in Penang, Malaysia, that has been represented in the Dewan Rakyat since 1974.\n\nNew!!: Reezal Merican Naina Merican and Kepala Batas (federal constituency) · See more »\n\nThis is the list of candidates for the 2018 Malaysian general election.\n\nNew!!: Reezal Merican Naina Merican and List of candidates of the Malaysian general election, 2018 · See more »\n\nThis is a list of notable Malaysian politicians of Indian origin, including original immigrants who obtained Malaysian citizenship and their Malaysian descendants.\n\nNew!!: Reezal Merican Naina Merican and List of Malaysian politicians of Indian descent · See more »\n\nThe 2018 Malaysian general election (formally the 14th Malaysian general election) was held on 9 May 2018 to elect members to the Dewan Rakyat of the 14th Parliament of Malaysia.\n\nNew!!: Reezal Merican Naina Merican and Malaysian general election, 2018 · See more »\n\nThis is a list of the members of the Dewan Rakyat (House of Representatives) of the 13th Parliament of Malaysia.\n\nNew!!: Reezal Merican Naina Merican and Members of the Dewan Rakyat, 13th Malaysian Parliament · See more »\n\nThis is a list of the members of the Dewan Rakyat (House of Representatives) of the 14th Parliament of Malaysia.\n\nNew!!: Reezal Merican Naina Merican and Members of the Dewan Rakyat, 14th Malaysian Parliament · See more »\n\nThe Public Accounts Committee (PAC, Jawatankuasa Kira-Kira Wang Negara) is a standing committee of the Dewan Rakyat, the lower house of Parliament of Malaysia.\n\nNew!!: Reezal Merican Naina Merican and Public Accounts Committee (Malaysia) · See more »\n\nThese are the election results of the 2013 Malaysian general election by parliamentary constituency.\n\nNew!!: Reezal Merican Naina Merican and Results of the Malaysian general election, 2013 by parliamentary constituency · See more »\n\nThese are the election results of the 2018 Malaysian general election by parliamentary constituency.\n\nNew!!: Reezal Merican Naina Merican and Results of the Malaysian general election, 2018 by parliamentary constituency · See more »\n\nSeberang Perai, also known as Province Wellesley, is a narrow hinterland on the Malay Peninsula opposite Penang Island, which, together with the island, forms the Malaysian state of Penang.\n\nNew!!: Reezal Merican Naina Merican and Seberang Perai · See more »\n\nNajib Razak formed the second Najib cabinet after being invited by Tuanku Abdul Halim Muadzam Shah to begin a new government following the 5 May 2013 general election in Malaysia.\n\nNew!!: Reezal Merican Naina Merican and Second Najib cabinet · See more »\n\nThe United Malays National Organisation (Malay: Pertubuhan Kebangsaan Melayu Bersatu; Jawi: ڤرتوبوهن کبڠساءن ملايو برساتو, abbreviated UMNO or lesser known as PEKEMBAR) is Malaysia's main opposition political party.\n\nNew!!: Reezal Merican Naina Merican and United Malays National Organisation · See more »\n\nA leadership election was held by the United Malays National Organisation (UMNO) party on 19 October 2013.\n\nNew!!: Reezal Merican Naina Merican and United Malays National Organisation leadership election, 2013 · See more »\n\nA leadership election will be held by the United Malays National Organisation (UMNO) party on 30 June 2018.\n\nNew!!: Reezal Merican Naina Merican and United Malays National Organisation leadership election, 2018 · See more »\n\nReferences\n\n[1] https://en.wikipedia.org/wiki/Reezal_Merican_Naina_Merican"}, {"url": "https://peopleai.com/fame/identities/reezal-merican-naina-merican", "page_content": "How old is Reezal Merican Naina Merican? When is Reezal Merican Naina Merican's birthday? Where is Reezal Merican Naina Merican born? Where did Reezal Merican Naina Merican grow up from? What's Reezal Merican Naina Merican's age?\n\nReezal Merican Naina Merican Born: July 29, 1972 (age 50 years), Kepala Batas, Malaysia\n\nIs Reezal Merican Naina Merican married? When did Reezal Merican Naina Merican get married? Who's Reezal Merican Naina Merican's married to? (Who's Reezal Merican Naina Merican's husband / wife)?\n\nReezal Merican Naina Merican Spouse: Sharifah Haslinda (m. 2005)\n\nDoes Reezal Merican Naina Merican have any children? What are the names of Reezal Merican Naina Merican's children? What are the ages of Reezal Merican Naina Merican's children?\n\nReezal Merican Naina Merican Children: Reena Iffatul Camelia Reezal Merican\n\nHow about Reezal Merican Naina Merican's education?\n\nReezal Merican Naina Merican Education: International Islamic University Malaysia, SMKA Al-Mashoor (L)\n\nHow about Reezal Merican Naina Merican's full name?\n\nReezal Merican Naina Merican Full name: Reezal Merican bin Naina Merican\n\nHow about Reezal Merican Naina Merican's party?\n\nReezal Merican Naina Merican Party: Barisan Nasional\n\nHow about Reezal Merican Naina Merican's current position?"}], "Reezal Merican Naina Merican is the Member of Parliament for the constituency of Kuala Nerus.": [{"url": "https://www.malaymail.com/news/malaysia/2023/05/02/former-minister-reezal-merican-is-new-matrade-chairman/67279", "page_content": "KUALA LUMPUR, May 2 — Former minister Datuk Seri Reezal Merican Naina Merican has been appointed as the ninth chairman of the Malaysia External Trade Development Corporation (Matrade) effective immediately.\n\nReezal Merican has an extensive track record in government service, having served as the Minister of Housing and Local Government (2021-2022), Minister of Youth and Sports (2020-2021), and Deputy Foreign Minister (2015-2018). Additionally, he chaired Amanah Raya Bhd from 2013 to 2015.\n\n“I am honoured to be given the opportunity to serve as the chairman of Matrade. With this role, combined with Minister of Miti’s (Ministry of Investment, Trade and Industry) leadership, we can better propel Malaysia’s trade and export performance to remain excellent and achieve stronger growth,” he said in a statement today.\n\nGiven his extensive experience in international affairs, diplomacy, government administration, and industry relations, he is well-positioned to lead and guide Malaysia’s national trade promotion agenda and facilitate export-oriented investments into the country, Matrade said.\n\nThe agency said his appointment as chairman will contribute to the growth and diversification of Malaysia’s exports in new and existing global markets.\n\nMatrade is an agency under Miti and is mandated to execute trade promotion initiatives for the country. Established in 1993 after the enactment of the Matrade Act 1992, Matrade executes two core activities: exporters development and export promotion.\n\nCurrently, it has six regional offices in Malaysia and 46 global offices ever-ready to assist Malaysian companies through exporters capacity building programmes, trade advisory and financial facilitation, business matching, market intelligence and market access, project negotiations and e-commerce. — Bernama"}, {"url": "https://politikus.sinarproject.org/persons/reezal-merican-naina-merican", "page_content": "Dato' Sri Reezal Merican bin Naina Merican is a Malaysian politician, and currently serving as Minister of Youth and Sports since 10 March 2020\n\nAlina Cheong is the Private Secretary I to Reezal Merican, Youth and Sports Minister\n\nSpecial Officer to Minister of Youth and Sports, Reezal Merican\n\nSpecial Function Officer to Minister of Youth and Sports, Reezal Merican\n\nSpecial Function Officer to Minister of Youth and Sports, Reezal Merican\n\nSpecial Function Officer to Minister of Youth and Sports, Reezal Merican\n\nPolitical Secretary to Minister of Youth and Sports, Reezal Merican\n\nPress Secretary to Minister of Youths and Sports, Reezal Merican\n\nPrincipal Private Secretary to Minister of Youth and Sports, Reezal Merican\n\nHisham Ahmad Sabri is the Private Secretary II to Reezal Merican, Youth and Sports Minister\n\nProcurement Infrastructure Projects\n\nCited on Issues\n\nSubject has been cited for issues for the following known sources.\n\nThese are sources, and not weighted on strength to make a case for this subject. Please refer to editorial or enforcement guidelines."}, {"url": "https://www.edgeprop.my/content/1899015/reezal-merican-new-housing-and-local-government-minister", "page_content": "Reezal Merican the new housing and local government minister\n\nKUALA LUMPUR (Aug 27): Datuk Seri Reezal Merican Naina Merican has been appointed as the new housing and local government minister under the new administration of newly-appointed Prime Minister Datuk Seri Ismail Sabri Yaakob.\n\nHe succeeds Datuk Zuraida Kamaruddin who has been the Member of Parliament (MP) of Ampang since 2008.\n\nReezal, who has been the MP for Kepala Batas since May 2013, previously served as the Minister of Youth and Sports in the Perikatan Nasional (PN) administration under former Prime Minister Muhyiddin Yassin from March 2020 to Aug 2021.\n\nHaving worked in the banking sector previously, Reezal took over the party's Division Head of Kepala Batas and became the Barisan Nasional (BN) candidate for the parliamentary seat from the fifth and former Prime Minister Tun Abdullah Ahmad Badawi.\n\nSubsequently, in October 2013, he was elected to the Supreme Council of UMNO, the highest-ranking body of the party.\n\nBack in July 2015 in a Cabinet reshuffle, Reezal was handpicked as Deputy Minister of Foreign Affairs by former Prime Minister Datuk Seri Najib Razak.\n\nGet the latest news @ www.EdgeProp.my\n\nSubscribe to our Telegram channel for the latest stories and updates\n\nClick here for more property stories"}, {"url": "https://www.sinardaily.my/article/190933/malaysia/national/reezal-enters-race-for-vp-post", "page_content": "SHAH ALAM - Umno Supreme Council member Datuk Seri Reezal Merican Naina Merican is set to contest for one of the party's vice presidents posts for the 2023-2026 term.\n\nThe former Kepala Batas member of parliament said the decision was taken to uphold three main visions, namely service, priority and loyalty to the party.\n\n\"I came forward with a clear mission to offer 3K-Service, Capability and Loyalty (Khidmat, Keupayaan dan Kesetiaan),\" he said in a tweet today.\n\nThe vice presidents posts came into focus after the posts of president and deputy were not contested.\n\nReezal will be competing with Higher Education Minister Datuk Seri Mohamed Khaled Nordin, Foreign Minister Datuk Seri Dr Zambry Abd Kadir and Minister in the Prime Minister's Department (Legal and Institutional Reform) Datuk Seri Azalina Othman Said.\n\nFormer Johor Menteri Besar who is also Simpang Renggam member of parliament Datuk Seri Hasni Mohamad, Pahang Menteri Besar Datuk Seri Wan Rosdy Wan Ismail, Federal Territories Umno Liaison Board chairman Datuk Seri Johari Abdul Ghani and Datuk Seri Mahdzir Khalid."}, {"url": "https://wiki.alquds.edu/?query=Reezal_Merican_Naina_Merican", "page_content": "Malaysian politician\n\nNaina Merican is a Reezal Merican. The Arabic-derived word \"bin\" or \"binti\"/\"binte\", if used, means 'son of' or 'daughter of', respectively. In this Malay name , there is no family name . The nameis a patronymic , and the person should be referred to by the given name . The Arabic-derived word \"bin\" or \"binti\"/\"binte\", if used, means 'son of' or 'daughter of', respectively.\n\nReezal Merican bin Naina Merican (Jawi: ريزال ماريکان بن ناينا ماريکان‎;[1] born 29 July 1972) is a Malaysian politician and banker who has served as the 9th Chairman of the Malaysia External Trade Development Corporation (MATRADE) since May 2023.[2] He served as the Minister of Housing and Local Government in the Barisan Nasional (BN) administration under former Prime Minister Ismail Sabri Yaakob from August 2021 to the collapse of the BN administration in November 2022, the Minister of Youth and Sports in the Perikatan Nasional (PN) administration under former Prime Minister Muhyiddin Yassin from March 2020 to the collapse of the PN administration in August 2021 and the Member of Parliament (MP) for Kepala Batas from May 2013 after the retirement of 5th and former Prime Minister Abdullah Ahmad Badawi as the MP from politics to his electoral defeat in November 2022. He is also a member and Division Chief of Kepala Batas of the Supreme Council of the United Malays National Organisation (UMNO), a component party of the BN coalition. He has also served as Chief of the Elections Department of UMNO since March 2023. He is an ethnic Malay of mixed Indian descent.\n\nBefore entering Parliament, Reezal worked in the bank sector.[3] Reezal took over Abdullah as the party's Division Head of Kepala Batas and as the Barisan Nasional (BN) candidate for the parliamentary seat.[4] Reezal won the seat in the 2013 Malaysian general election while defeated a candidate from the Malaysian Islamic Party (PAS) by 4,176 majority of the votes.[5] In October 2013, he was elected to Supreme Council of UMNO, the highest-ranking body of the party.[6] In a Cabinet reshuffle on 28 July 2015, Reezal was handpicked as Deputy Minister of Foreign Affairs by former Prime Minister Najib Razak. Despite winning the majority to defend his seat in his parliamentary constituency, Reezal lost his Cabinet post following the results of the 2018 Malaysian general election.\n\nControversy [ edit ]\n\nOn 29 August 2015, Reezal intimidated Malaysians participating in the Bersih 4 demonstrations abroad that the Foreign Ministry would gather their information for eventual legal action against them, without even citing which law the citizen abroad violated.[7]\n\nFamily [ edit ]\n\nAfter first wife Ismalina Ismail and second wife Sharifah Norhaslinda which once filed for divorce with Reezal but retracted.[8]\n\nElection results [ edit ]\n\nHonours [ edit ]\n\nSee also [ edit ]\n\nReferences [ edit ]\n\n\n\n"}, {"url": "https://www.malaymail.com/news/malaysia/2021/11/01/property-rental-minister-admits-discrimination-exists-says-very-awkward-to/2017524", "page_content": "KUALA LUMPUR, Nov 1 — Racial discrimination does exist in Malaysia’s property rental market, Local Government Minister Datuk Seri Reezal Merican Naina Merican acknowledged in Parliament today.\n\nHowever, he said it would be “very awkward” to enact a law that seeks a fair balance between the rights of both landlords and tenants while including the landlord’s preference for certain tenants, even if other countries have clear-cut anti-discrimination legislations.\n\n“The discrimination issue raised by YB, yes it is true, I have listened and seen it myself but at this moment we are still studying in detail in terms of local circumstances.\n\n“There are similar Acts in Australia and even in the United States which prohibits any form of sale advertisements by including one’s preference.\n\n“But in Malaysia, when we talk about discrimination, it comes down to preference. It would be very awkward to have Acts supporting the preference of owners’ rights but we will conduct further studies on the suitability of including the elements raised by YB,” Reezal Merican said during Question Time in the Dewan Rakyat.\n\nHe was replying Bangi MP Ong Kian Ming who wanted to know if the soon-to-be tabled Residential Tenancy Act would address racial discrimination in Malaysia’s property rental market.\n\nReezal Merican said the “real spirit” of the proposed law is to balance the rights of tenants and property owners.\n\nHe said the Residential Tenancy Act is meant to standardise rental agreements and establish a tribunal to resolve disputes between tenants and landlords.\n\n“At this moment, the preparation of residential rental agreements utilises the procedures stipulated under the Contract Act where the agreements are generally non-comprehensive and do not fully protect the interests and rights of tenants and owners of premises,” he said.\n\nHe said the new law is in the final stages of its drafting and is scheduled for tabling in Parliament in July 2022.\n\nReezal Merican explained that the draft of Malaysia’s Residential Tenancy Act is modelled after the Residential Tenancies Act 2010 in New South Wales, Australia.\n\nHe added that similar laws from Germany, the United Kingdom and South Africa were used as comparisons.\n\n“Apart from comprehensive stakeholders’ meetings, a Regulatory Impact Assessment will also be implemented by the Malaysia Productivity Corporation to identify and assess the effects from suggestions gathered towards the drafting of the Bill,” he said.\n\nHe also pointed out that since the relationship between landlords and their tenants fell under the state’s jurisdiction as provided under Article 76(4) of the Federal Constitution, proposals outlined in the Bill is set for tabling in the National Council for Local Government before it is presented to the Attorney General’s Chambers for a final review."}, {"url": "https://www.malaymail.com/news/malaysia/2021/11/11/reezal-merican-ministry-to-table-amendments-to-housing-development-act-in-q/2020193", "page_content": "KUALA LUMPUR, Nov 11 — The proposed amendments to the Housing Development (Control and Licensing) Act 1966 (Act 118) is expected to be tabled in Parliament in the third quarter of 2022 in an effort to address issues concerning abandoned housing projects and prevent such problems in the future.\n\nHousing and Local Government Minister Datuk Seri Reezal Merican Naina Merican said the move to amend the Act was in line with the country’s housing development direction and the adoption of the Build-Then-Sell (BTS) concept.\n\nHe said among the proposed amendments is the Sales and Purchase Agreement (SPA) payment under Schedule G and H will be more similar to the BTS concept involving an advance payment of 40 per cent, while the remaining amount is to be paid after the buyer receives the vacant possession notice, supported by the Certificate of Completion and Compliance (CCC) from the developer.\n\n“The payment claim by the developer will be deducted five per cent. For example, if the claim is 40 per cent, then the buyer will only have to pay 35 per cent. The remaining amount will be made after the project gets the CCC.\n\n“This is to prevent (the developer) from making claims that do not match the certified work,” he said during the question and answer session at the Dewan Rakyat today.\n\nHe was replying to a question from William Leong Jee Keen (PH-Selayang) who wanted to know whether the government would adopt the BTS 10:90 concept to adress the problem of abandoned housing projects.\n\nUnder the BTS 10:90 concept, buyers are required to make a 10 per cent downpayment of the property’s purchase price while the remaining 90 per cent can be paid when the house is ready.\n\nReezal Merican said with the amendment of the Act, the government is of the view that the adoption of the BTS concept in the country’s real estate industry can be implemented comprehensively after 2023. — Bernama"}, {"url": "https://www.theborneopost.com/2021/09/01/reezal-merican-starts-work-as-housing-and-local-government-minister/", "page_content": "PUTRAJAYA (Sept 1): Newly-minted Housing and Local Government Minister Datuk Seri Reezal Merican Naina Merican today reported for his first day of work at the Housing and Local Government Ministry (KPKT) here.\n\nReezal Merican, along with 29 Cabinet ministers and 37 deputy ministers were sworn in before Yang di-Pertuan Agong Al-Sultan Abdullah Ri’ayatuddin Al-Mustafa Billah Shah at Istana Negara on Monday.\n\nAfter scanning in, Reezal Merican, who was previously the Youth and Sports Minister, will attend the first Cabinet meeting which will be virtually chaired by Prime Minister Datuk Seri Ismail Sabri Yaakob. – Bernama"}, {"url": "https://en.unionpedia.org/Reezal_Merican_Naina_Merican", "page_content": "Reezal Merican Naina Merican Datuk Seri Reezal Merican bin Naina Merican is a Malaysian politician. [1]\n\n26 relations: Abdullah Ahmad Badawi, Barisan Nasional, Dewan Rakyat, Election Commission of Malaysia, Hamzah Zainudin, Indian people, Kepala Batas (federal constituency), Kepala Batas, Penang, Malay language, Malay race, Malay styles and titles, Malaysiakini, Malaysian general election, 2004, Malaysian general election, 2013, Malaysian general election, 2018, Malaysian Islamic Party, Malaysians, Member of parliament, Ministry of Foreign Affairs (Malaysia), National Trust Party (Malaysia), Pakatan Harapan, Parliament of Malaysia, Penang, The Star (Malaysia), United Malays National Organisation, Utusan Malaysia.\n\nTun Dato' Seri Haji Abdullah bin Haji Ahmad Badawi (Jawi: عبد الله بن حاج احمد بداوي; born 26 November 1939) is a Malaysian politician who served as Prime Minister of Malaysia from 2003 to 2009.\n\nNew!!: Reezal Merican Naina Merican and Abdullah Ahmad Badawi · See more »\n\nThe National Front (Barisan Nasional; abbrev: BN) is a political coalition in Malaysia that was founded in 1973 as a coalition of right-wing and centre parties.\n\nNew!!: Reezal Merican Naina Merican and Barisan Nasional · See more »\n\nThe Dewan Rakyat (Malay for House of Representatives, literally People's Hall) is the lower house of the Parliament of Malaysia, consisting of members elected during elections from federal constituencies drawn by the Election Commission.\n\nNew!!: Reezal Merican Naina Merican and Dewan Rakyat · See more »\n\nThe Election Commission of Malaysia (Suruhanjaya Pilihan Raya Malaysia), abbreviated SPR or EC, is a commission set up for the purpose of ensuring fair and equitable operations in undertaking the Malaysian General Elections.\n\nNew!!: Reezal Merican Naina Merican and Election Commission of Malaysia · See more »\n\nDato' Seri Hamzah bin Zainudin (born 12 March 1957) is a Malaysian politician and is the Member of the Parliament of Malaysia for the Larut constituency in Perak.\n\nNew!!: Reezal Merican Naina Merican and Hamzah Zainudin · See more »\n\nNo description.\n\nNew!!: Reezal Merican Naina Merican and Indian people · See more »\n\nKepala Batas is a federal constituency in Penang, Malaysia, that has been represented in the Dewan Rakyat since 1974.\n\nNew!!: Reezal Merican Naina Merican and Kepala Batas (federal constituency) · See more »\n\nKepala Batas is a town in North Seberang Perai, Penang, Malaysia.\n\nNew!!: Reezal Merican Naina Merican and Kepala Batas, Penang · See more »\n\nMalay (Bahasa Melayu بهاس ملايو) is a major language of the Austronesian family spoken in Brunei, Indonesia, Malaysia and Singapore.\n\nNew!!: Reezal Merican Naina Merican and Malay language · See more »\n\nThe concept of a Malay race was originally proposed by the German physician Johann Friedrich Blumenbach (1752–1840), and classified as a brown race.\n\nNew!!: Reezal Merican Naina Merican and Malay race · See more »\n\nThe Malay language has a complex system of styles, titles and honorifics, which are used extensively in Brunei and Malaysia.\n\nNew!!: Reezal Merican Naina Merican and Malay styles and titles · See more »\n\nMalaysiakini (Meaning in English: \"Malaysia Today\") is an online news portal published in English, Malay, Chinese and Tamil.\n\nNew!!: Reezal Merican Naina Merican and Malaysiakini · See more »\n\nA general election was held on Sunday, 21 March 2004 for members of the 11th Parliament of Malaysia.\n\nNew!!: Reezal Merican Naina Merican and Malaysian general election, 2004 · See more »\n\nGeneral elections were held in Malaysia on Sunday, 5 May 2013 for members of the 13th Parliament.\n\nNew!!: Reezal Merican Naina Merican and Malaysian general election, 2013 · See more »\n\nThe 2018 Malaysian general election (formally the 14th Malaysian general election) was held on 9 May 2018 to elect members to the Dewan Rakyat of the 14th Parliament of Malaysia.\n\nNew!!: Reezal Merican Naina Merican and Malaysian general election, 2018 · See more »\n\nThe Malaysian Islamic Party (PAS; Parti Islam Se-Malaysia; formerly known as Malayan Islamic Party) is an Islamist political party in Malaysia.\n\nNew!!: Reezal Merican Naina Merican and Malaysian Islamic Party · See more »\n\nMalaysians are the people who are identified with the country of Malaysia.\n\nNew!!: Reezal Merican Naina Merican and Malaysians · See more »\n\nA member of parliament (MP) is the representative of the voters to a parliament.\n\nNew!!: Reezal Merican Naina Merican and Member of parliament · See more »\n\nThe Ministry of Foreign Affairs (Kementerian Luar Negeri), abbreviated KLN, is a ministry of the Government of Malaysia that is responsible for foreign affairs, Malaysian diaspora, foreigners in Malaysia, diplomacy, foreign relations, counter terrorism, bilateral affairs, multilateral affairs, ASEAN, international protocol, consular services, maritime affairs, chemical weapons.\n\nNew!!: Reezal Merican Naina Merican and Ministry of Foreign Affairs (Malaysia) · See more »\n\nThe National Trust Party (Amanah; Parti Amanah Negara) is a registered political party in Malaysia advocating political Islam.\n\nNew!!: Reezal Merican Naina Merican and National Trust Party (Malaysia) · See more »\n\nThe Alliance of Hope (Pakatan Harapan; abbrev: PH) is a political coalition in Malaysia.\n\nNew!!: Reezal Merican Naina Merican and Pakatan Harapan · See more »\n\nThe Parliament of Malaysia (Parlimen Malaysia) is the national legislature of Malaysia, based on the Westminster system.\n\nNew!!: Reezal Merican Naina Merican and Parliament of Malaysia · See more »\n\nPenang is a Malaysian state located on the northwest coast of Peninsular Malaysia, by the Malacca Strait.\n\nNew!!: Reezal Merican Naina Merican and Penang · See more »\n\nThe Star is an English-language, tabloid-format newspaper in Malaysia.\n\nNew!!: Reezal Merican Naina Merican and The Star (Malaysia) · See more »\n\nThe United Malays National Organisation (Malay: Pertubuhan Kebangsaan Melayu Bersatu; Jawi: ڤرتوبوهن کبڠساءن ملايو برساتو, abbreviated UMNO or lesser known as PEKEMBAR) is Malaysia's main opposition political party.\n\nNew!!: Reezal Merican Naina Merican and United Malays National Organisation · See more »\n\nUtusan Malaysia (literally The Malaysian Courier) is a Malay-language newspaper published in Malaysia.\n\nNew!!: Reezal Merican Naina Merican and Utusan Malaysia · See more »\n\nReferences\n\n[1] https://en.wikipedia.org/wiki/Reezal_Merican_Naina_Merican"}, {"url": "https://www.theborneopost.com/2023/05/02/former-minister-reezal-merican-is-new-matrade-chairman/", "page_content": "KUALA LUMPUR (May 2): Former minister Datuk Seri Reezal Merican Naina Merican has been appointed as the ninth chairman of the Malaysia External Trade Development Corporation (Matrade) effective immediately.\n\nReezal Merican has an extensive track record in government service, having served as the Minister of Housing and Local Government (2021-2022), Minister of Youth and Sports (2020-2021), and Deputy Foreign Minister (2015-2018). Additionally, he chaired Amanah Raya Bhd from 2013 to 2015.\n\n“I am honoured to be given the opportunity to serve as the chairman of Matrade. With this role, combined with Minister of Miti’s (Ministry of Investment, Trade and Industry) leadership, we can better propel Malaysia’s trade and export performance to remain excellent and achieve stronger growth,” he said in a statement today.\n\nGiven his extensive experience in international affairs, diplomacy, government administration, and industry relations, he is well-positioned to lead and guide Malaysia’s national trade promotion agenda and facilitate export-oriented investments into the country, Matrade said.\n\nThe agency said his appointment as chairman will contribute to the growth and diversification of Malaysia’s exports in new and existing global markets.\n\nMatrade is an agency under Miti and is mandated to execute trade promotion initiatives for the country. Established in 1993 after the enactment of the Matrade Act 1992, Matrade executes two core activities: exporters development and export promotion.\n\nCurrently, it has six regional offices in Malaysia and 46 global offices ever-ready to assist Malaysian companies through exporters capacity building programmes, trade advisory and financial facilitation, business matching, market intelligence and market access, project negotiations and e-commerce. — Bernama"}], "Reezal Merican Naina Merican is from the state of Terengganu.": [{"url": "https://politikus.sinarproject.org/persons/reezal-merican-naina-merican", "page_content": "Dato' Sri Reezal Merican bin Naina Merican is a Malaysian politician, and currently serving as Minister of Youth and Sports since 10 March 2020\n\nAlina Cheong is the Private Secretary I to Reezal Merican, Youth and Sports Minister\n\nSpecial Officer to Minister of Youth and Sports, Reezal Merican\n\nSpecial Function Officer to Minister of Youth and Sports, Reezal Merican\n\nSpecial Function Officer to Minister of Youth and Sports, Reezal Merican\n\nSpecial Function Officer to Minister of Youth and Sports, Reezal Merican\n\nPolitical Secretary to Minister of Youth and Sports, Reezal Merican\n\nPress Secretary to Minister of Youths and Sports, Reezal Merican\n\nPrincipal Private Secretary to Minister of Youth and Sports, Reezal Merican\n\nHisham Ahmad Sabri is the Private Secretary II to Reezal Merican, Youth and Sports Minister\n\nProcurement Infrastructure Projects\n\nCited on Issues\n\nSubject has been cited for issues for the following known sources.\n\nThese are sources, and not weighted on strength to make a case for this subject. Please refer to editorial or enforcement guidelines."}, {"url": "https://www.malaymail.com/news/sports/2021/07/18/reezal-merican-hopes-datukship-will-spur-azizulhasni-to-greater-heights-in/1990928", "page_content": "KUALA LUMPUR, July 18 — It is hoped that the Darjah Kebesaran Dato’ Paduka Mahkota Terengganu (DPMT) award, which carries the title Datuk, that was conferred on national track cyclist Mohd Azizulhasni Awang recently will spur him to bring glory to the country.\n\nYouth and Sports Minister Datuk Seri Reezal Merican Naina Merican posted his congratulations to the national track cycling champion on his Facebook page today.\n\n“Congratulations to Dato’ Mohd Azizulhasni Awang, national trek cycling racer, on being awarded the Darjah Kebesaran Dato’ Paduka Mahkota Terengganu Yang Amat Dihormati (D.P.M.T.), which carries the title Dato’.\n\n“May this honour be the catalyst to inspire you to bring glory to our country at the Olympics #Tokyo2020,” he posted.\n\nMohd Azizulhasni, 33, who is also the 2017 keirin world champion, is one of six individuals, including Terengganu state health director Dr Nor Azimi Yunus, to be awarded the title by Sultan of Terengganu Sultan Mizan Zainal Abidin.\n\nMeanwhile, Azizulhasni, who is also known as ‘The Pocket Rocketman’, humbly uploaded a photo containing a Quranic verse from Surah Ar-Rahman after news of his award went viral among the country’s cycling fans.\n\n“So, which of the bounties of your Lord will you deny?” was the verse Azizulhasni chose to post on his Instagram account.\n\nAzizulhasni, who is the country’s main prospect to win Malaysia’s first-ever Olympic gold medal, and Muhammad Shah Firdaus Sahrom are set to take part in the keirin and individual sprint events at the Tokyo Olympics from Aug 4. — Bernama"}, {"url": "https://www.malaymail.com/news/malaysia/2021/11/01/property-rental-minister-admits-discrimination-exists-says-very-awkward-to/2017524", "page_content": "KUALA LUMPUR, Nov 1 — Racial discrimination does exist in Malaysia’s property rental market, Local Government Minister Datuk Seri Reezal Merican Naina Merican acknowledged in Parliament today.\n\nHowever, he said it would be “very awkward” to enact a law that seeks a fair balance between the rights of both landlords and tenants while including the landlord’s preference for certain tenants, even if other countries have clear-cut anti-discrimination legislations.\n\n“The discrimination issue raised by YB, yes it is true, I have listened and seen it myself but at this moment we are still studying in detail in terms of local circumstances.\n\n“There are similar Acts in Australia and even in the United States which prohibits any form of sale advertisements by including one’s preference.\n\n“But in Malaysia, when we talk about discrimination, it comes down to preference. It would be very awkward to have Acts supporting the preference of owners’ rights but we will conduct further studies on the suitability of including the elements raised by YB,” Reezal Merican said during Question Time in the Dewan Rakyat.\n\nHe was replying Bangi MP Ong Kian Ming who wanted to know if the soon-to-be tabled Residential Tenancy Act would address racial discrimination in Malaysia’s property rental market.\n\nReezal Merican said the “real spirit” of the proposed law is to balance the rights of tenants and property owners.\n\nHe said the Residential Tenancy Act is meant to standardise rental agreements and establish a tribunal to resolve disputes between tenants and landlords.\n\n“At this moment, the preparation of residential rental agreements utilises the procedures stipulated under the Contract Act where the agreements are generally non-comprehensive and do not fully protect the interests and rights of tenants and owners of premises,” he said.\n\nHe said the new law is in the final stages of its drafting and is scheduled for tabling in Parliament in July 2022.\n\nReezal Merican explained that the draft of Malaysia’s Residential Tenancy Act is modelled after the Residential Tenancies Act 2010 in New South Wales, Australia.\n\nHe added that similar laws from Germany, the United Kingdom and South Africa were used as comparisons.\n\n“Apart from comprehensive stakeholders’ meetings, a Regulatory Impact Assessment will also be implemented by the Malaysia Productivity Corporation to identify and assess the effects from suggestions gathered towards the drafting of the Bill,” he said.\n\nHe also pointed out that since the relationship between landlords and their tenants fell under the state’s jurisdiction as provided under Article 76(4) of the Federal Constitution, proposals outlined in the Bill is set for tabling in the National Council for Local Government before it is presented to the Attorney General’s Chambers for a final review."}, {"url": "https://selangorjournal.my/2022/04/malaysian-households-lose-rm210-per-month-in-food-waste-disposal-costs/", "page_content": "PUTRAJAYA, April 26 — Households in Malaysia on average lose RM210 per month, or RM2,600 a year, in terms of food waste disposal costs, said Housing and Local Government Minister Datuk Seri Reezal Merican Naina Merican.\n\nHe said the risk of not managing food waste involved the cost of treating food waste spent by each household, which was expected to increase from RM60 to RM150 now to RM160 to RM400 by 2025.\n\nAccording to him, Malaysians produce 38,000 tonnes of solid waste daily, and of that amount, about 17,000 tonnes is food waste, of which an estimated 4,046 tonnes, or 24 per cent, is avoidable food waste.\n\n“Out of the amount of food waste that can be avoided, which is 4,046 tonnes, this amount can feed three million people for three meals a day,” he told reporters after launching the #JomTapau campaign, aimed at encouraging the community to value food and avoid waste, here yesterday.\n\nReezal Merican, in advising against over-preparation of food as well as food wastage, to avoid them ending up in landfills, said that the trend of food waste increases between 15 and 20 per cent during festive season.\n\nHe said food waste affects the environment through the release of carbon dioxide (CO2) gas and the use of water resources, where one tonne of food waste produces 2.5 tonnes of CO2.\n\n“If each individual manages to avoid wasting one kilogramme (kg) of food, as much as 2.5 kg less CO2 is released.\n\n“Meanwhile, from an economic point of view, if each individual manages to avoid one kg of food waste, it will save RM11, where RM100 can be saved in a month for one family,” he said.\n\nOn the #JomTapau campaign, Reezal Merican said that it was one of the approaches to encourage the community to pack surplus food that is still good to take home, to avoid wastage.\n\nThe food appreciation campaign was introduced in 2015, and this year the Solid Waste Management and Public Cleansing Corporation (SWCorp) implemented the campaign by focusing on food premises, such as restaurants, hotels and hawker centres.\n\n— Bernama"}, {"url": "https://www.malaymail.com/news/malaysia/2021/10/22/housing-and-local-government-ministry-number-of-abandoned-housing-projects/2015304", "page_content": "PUTRAJAYA, Oct 22 ― The Housing and Local Government Ministry has clarified that the number of abandoned housing projects provided by its Minister Datuk Seri Reezal Merican Naina Merican in Parliament matches with the number in the Department of National Housing’s record, which is 79 projects.\n\nKPKT in a statement today said the figure involved projects that had been confirmed as abandoned private housing projects.\n\nOn October 22, a news portal claimed that the figure for abandoned housing projects provided by Reezal Merican in Parliament did not tally with the figure listed on the ministry's website.\n\nThe report said Reezal Merican’s reply in Parliament noted that there were 79 abandoned private housing projects as of Sept 30 this year, involving over 17,000 units and 11,000 buyers, as opposed to 198 projects stated on KPKT’s website.\n\nAccording to KPKT, four documents have been uploaded on the website under the heading ‘Abandoned Housing Projects’ namely;\n\nI. Blacklist of Developers of Abandoned Private Housing Projects\n\nII. List of Projects under Planning for Rehabilitation\n\nIII. List of Projects under Rehabilitation\n\nIV. List of Projects under Static Project Category\n\nKPKT said the 79 projects mentioned by Reezal Merican had been divided into categories as in list II, III and IV and they were uncompleted projects as of August 31 this year.\n\nIt said the statement issued by the National House Buyers Association (HBA) quoted in the news portal's report regarding 198 abandoned housing projects referred to list I of 198 blacklisted developers of private housing projects.\n\n“The list of developers involved in abandoned projects will remain on this blacklist for public information purposes,” it added.\n\nThe ministry said the confusion was clarified in the Private Housing Project Committee meeting on Oct 5 which was also attended by HBA representatives, adding that the ministry is currently working to improve the information display on the website to avoid more confusion. ― Bernama"}, {"url": "https://www.malaymail.com/news/malaysia/2023/04/15/reezal-umno-prepared-for-state-elections/64985", "page_content": "KEPALA BATAS, April 15 — Umno is making preparations to face state elections in six states, with its election machinery currently at 80 per cent.\n\nUmno election department chief Datuk Seri Reezal Merican Naina Merican said he had met with all six Umno state liaison committees and the readiness for state elections were at very high levels.\n\nThe Kepala Batas Umno division chief said that Umno and Barisan Nasional’s compatibility with Pakatan Harapan (PH) was well.\n\n“The compatibility between BN and PH forms the core of the Unity Government, both at the federal and state levels, in Pahang, Perak and Melaka, and it will be translated through the upcoming state elections.\n\n“We don’t want the central to say one thing and the state another. So we want to make sure everything works together in the state elections as the voting patterns are now different,” he told reporters after presenting aid to 400 asnaf (Islamic tithe recipients), elderly and orphans here today.\n\nReezal Merican said the formula for the state elections would be the Unity Government’s coalition formula, adding that they all had high hopes to stick together, and this was proven in many things, including Prime Minister Datuk Seri Anwar Ibrahim’s willingness to conduct Isyak and Terawih prayers in Kepala Batas yesterday even with his tight schedule.\n\n“The Penang chief minister and deputy chief minister I also attends our programme, and it’s not a one time thing. This is an early sign of our determination to form an adminstration based on the Unity Government.\n\n“From there, we can see the collaboration developing in such a short time. In 100 to 120 days, till the elections are held, we will be in a state of readiness,” he added. — Bernama"}, {"url": "https://www.edgeprop.my/content/1899015/reezal-merican-new-housing-and-local-government-minister", "page_content": "Reezal Merican the new housing and local government minister\n\nKUALA LUMPUR (Aug 27): Datuk Seri Reezal Merican Naina Merican has been appointed as the new housing and local government minister under the new administration of newly-appointed Prime Minister Datuk Seri Ismail Sabri Yaakob.\n\nHe succeeds Datuk Zuraida Kamaruddin who has been the Member of Parliament (MP) of Ampang since 2008.\n\nReezal, who has been the MP for Kepala Batas since May 2013, previously served as the Minister of Youth and Sports in the Perikatan Nasional (PN) administration under former Prime Minister Muhyiddin Yassin from March 2020 to Aug 2021.\n\nHaving worked in the banking sector previously, Reezal took over the party's Division Head of Kepala Batas and became the Barisan Nasional (BN) candidate for the parliamentary seat from the fifth and former Prime Minister Tun Abdullah Ahmad Badawi.\n\nSubsequently, in October 2013, he was elected to the Supreme Council of UMNO, the highest-ranking body of the party.\n\nBack in July 2015 in a Cabinet reshuffle, Reezal was handpicked as Deputy Minister of Foreign Affairs by former Prime Minister Datuk Seri Najib Razak.\n\nGet the latest news @ www.EdgeProp.my\n\nSubscribe to our Telegram channel for the latest stories and updates\n\nClick here for more property stories"}, {"url": "https://selangorjournal.my/2020/03/ministry-to-bring-home-national-athletes-from-overseas-if-necessary/", "page_content": "KUALA LUMPUR, March 31 — The Youth and Sports Ministry, in cooperation with the Olympic Council of Malaysia (OCM) and national sports associations (NSAs), are ready to bring home national athletes from overseas, if necessary, following the Covid-19 pandemic.\n\nYouth and Sports Minister Datuk Seri Reezal Merican Naina Merican said in a statement that the ministry, OCM and NSAs would monitor the developments and needs of national athletes overseas from time to time.\n\nHe also advised national athletes, including professionals, to register and get in touch with the nearest Malaysian diplomatic missions for the latest developments and news in case of emergency.\n\n“All 48 national athletes overseas, including professionals and those under national associations, are in good shape and safe,” he said.\n\nOf the total, 25 are from the Podium Programme and involved in swimming, cycling, athletics, Muay Thai and golf. The rest, who are not part of the programme, are from fencing, ice hockey, football, surfing, rowing, skating, golf, skateboarding and rugby.\n\nThe 48 athletes are in 13 countries, with 15 in Thailand, the United States (12), Australia (seven), Germany (three), the United Kingdom and Japan (two each) and one each in Canada, Sweden, France, Switzerland, Singapore, Taiwan and Indonesia.\n\nThey are overseas for various reasons, including higher education (16 people), training or competition (15), representing foreign clubs as a professional athlete (nine), permanent residence (seven) and vacation (one).\n\n— Bernama"}, {"url": "https://www.theborneopost.com/2021/07/08/not-impossible-for-first-time-olympic-athletes-to-garner-success-reezal-merican/", "page_content": "KUALA LUMPUR (July 8): Youth and Sports Minister Datuk Seri Reezal Merican Naina Merican said it is not impossible for the country’s young athletes to make a victorious debut at the Olympic Games in Tokyo, Japan this month.\n\nReezal Merican said history had proven that from the 11 medals won in 17 Olympic appearances of the national contingent so far, four were contributed by athletes in the maiden appearances in the world’s biggest sporting event.\n\nHe said they were the three men’s badminton doubles pairs, Datuk Razif Sidek-Datuk Seri Jalani Sidek in Barcelona 1992 (bronze); Cheah Soon Kit-Yap Kim Hock in Atlanta 1996 (silver) and Goh V Shem-Tan Wee Kiong in Rio 2016 (silver) as well as diving queen Pandelela Rinong in London 2012 (bronze).\n\n“Before this. we saw four national representatives winning medals at the Olympic Games (when competing for the first time) and this means athletes participating in Tokyo soon, could also repeat the earlier successes,” he told a virtual media conference today.\n\nReezal Merican had earlier held an online session with coaches and managers of the national contingent to the Olympic Games today.\n\nA total of 30 athletes have qualified for Tokyo Olympics and among the new faces are Lee Zii Jia (badminton); Aaron Chia-Soh Wooi Yik (badminton); Farah Ann Abdul Hadi (gymnastics); and Muhammad Shah Firdaus Sahrom (cycling).\n\nMeanwhile, Reezal Merican said based on the sharing of information by the national contingent coaches and managers, all athletes are raring to go despite the Covid-19 pandemic which is still affecting the world now.\n\nIn this regard, he again stressed that all athletes including officers and coaches should emphasise on their safety and health apart from complying with all protocols set by Tokyo Olympics organiser to prevent infection as well as being cautious on doping issue.\n\nAt the same time, he said only four team managers from aquatics, badminton, golf and athletics would be going to Tokyo while other sports would be managed by their respective coaches there.\n\n“The Olympic Council of Malaysia secretary-general Datuk Mohd Nazifuddin Najib will be acting as the chief de mission (CDM) in terms of administration in Japan while Datuk Lee Chong Wei would remain as the actual CDM,” he added.\n\nOn Monday, Reezal Merican confirmed that Chong Wei would not be going to Japan on health factor and on doctor’s advice which did not allow him to go oversea but he would be monitoring the performance of athletes virtually throughout championship.\n\nIn this regard, he also announced meeting all athletes on Saturday to track their latest developments followed by a message from the Prime Minister Tan Sri Muhyiddin Yassin on July 13. – Bernama"}]}