{"Reezal Merican was born in Kuala Terengganu, Terengganu, Malaysia.": [{"url": "https://www.malaymail.com/news/sports/2021/07/18/reezal-merican-hopes-datukship-will-spur-azizulhasni-to-greater-heights-in/1990928", "page_content": "KUALA LUMPUR, July 18 — It is hoped that the Darjah Kebesaran Dato’ Paduka Mahkota Terengganu (DPMT) award, which carries the title Datuk, that was conferred on national track cyclist Mohd Azizulhasni Awang recently will spur him to bring glory to the country.\n\nYouth and Sports Minister Datuk Seri Reezal Merican Naina Merican posted his congratulations to the national track cycling champion on his Facebook page today.\n\n“Congratulations to Dato’ Mohd Azizulhasni Awang, national trek cycling racer, on being awarded the Darjah Kebesaran Dato’ Paduka Mahkota Terengganu Yang Amat Dihormati (D.P.M.T.), which carries the title Dato’.\n\n“May this honour be the catalyst to inspire you to bring glory to our country at the Olympics #Tokyo2020,” he posted.\n\nMohd Azizulhasni, 33, who is also the 2017 keirin world champion, is one of six individuals, including Terengganu state health director Dr Nor Azimi Yunus, to be awarded the title by Sultan of Terengganu Sultan Mizan Zainal Abidin.\n\nMeanwhile, Azizulhasni, who is also known as ‘The Pocket Rocketman’, humbly uploaded a photo containing a Quranic verse from Surah Ar-Rahman after news of his award went viral among the country’s cycling fans.\n\n“So, which of the bounties of your Lord will you deny?” was the verse Azizulhasni chose to post on his Instagram account.\n\nAzizulhasni, who is the country’s main prospect to win Malaysia’s first-ever Olympic gold medal, and Muhammad Shah Firdaus Sahrom are set to take part in the keirin and individual sprint events at the Tokyo Olympics from Aug 4. — Bernama"}, {"url": "https://www.britannica.com/place/Terengganu", "page_content": "Terengganu, formerly Trengganu, traditional region of northeastern West Malaysia (Malaya), bounded by those of Kelantan (north and northwest) and Pahang (south and southwest). It has a 200-mile- (320-kilometre-) long coastline along the South China Sea (east). Terengganu is mentioned in 1365 as a vassal of the Javanese kingdom of Majapahit. The sultanate of Terengganu, ruled by members of the same family since 1701, was under Thai suzerainty until a treaty in 1909 made it a British protectorate and one of the unfederated Malay states. After World War II it joined the Federation of Malaya (1948).\n\nOne of the least developed regions on the Malay Peninsula, Terengganu consists of a string of coastal settlements, usually at the mouths of the area’s many rivers, the longest of which is the Terengganu. High, forest-clad mountains, in places exceeding 7,000 feet (2,100 m) in height, have deterred inland settlement. Except for a small airstrip at its chief settlement, Kuala Terengganu (formerly Kuala Trengganu), the region is linked only by road and coastal shipping with the rest of the peninsula. For about four months a year, these links were often broken by heavy seas and flooding from the monsoon rains, but construction of a new bridge in the 1970s eliminated that problem.\n\nThe inhabitants are predominantly Muslim Malays engaged in fishing and paddy (rice) farming. Small rubber and coconut plantations are scattered among the paddy fields. The once-productive iron-ore mines near Kuala Dungun were closed in 1970. There is a large oil-palm plantation inland at Jerangau, 36 miles (58 km) south of Kuala Terengganu. Rice, although widely grown, is also imported, usually from Thailand. Terengganu’s exports include iron, rubber, copra, and salted and dried fish."}, {"url": "https://link.springer.com/chapter/10.1007/978-3-030-64961-6_8", "page_content": "Ethnozoology refers to the study of the relationship between humans and animals in their environment. It highly reflects the importance of animals in the life of man (Alves 2012). Historically, various animals have been utilised for many purposes, and have provided significant support to humans in terms of livelihood. For instance, wildlife products that are readily available, such as ivory, bones, antlers and feathers, have been used by humans as tools and ornaments since prehistoric times (Pederson 2004).\n\nIn Peninsular Malaysia, the forest-dependent community belongs to one of the minority groups, which are the indigenous people. The indigenous people (or Orang Asli in Malay) are the earliest inhabitants of Peninsular Malaysia. Some of the sub-tribes have lived in Peninsular Malaysia for at least 25,000 years (Nicholas 2000), and they have been called the “first people” or “original people”. The three major groups of the Orang Asli are the Senoi, Negrito and Proto Malay, and they are made up of 18 sub-ethnic groups (Carey 1976). Each sub-tribe has a distinctive culture , belief, language, tradition and lifestyle. The Negrito consists of the Kintak, Kensiu, Jahai, Medrik, Batek and Lanoh, while the Senoi consists of the Semai, Temiar, Jah Hut, Mah Beri, Che wong and Semoq Beri. The Temuan, Jakun, Semelai, Orang Seletar, Orang Kuala and Orang Kanaq, meanwhile, are Proto Malays.\n\nToday, many Orang Asli communities have been resettled in villages outside of forests. Traditionally, the Orang Asli lived in and around forests in bamboo and rattan huts. They live a nomadic and semi-nomadic life, acquiring various resources in and around their surrounding forests to survive (Kuchikura 1986). Their high dependency on forest resources and products has been widely studied (Ramle et al. 2014), particularly among the Batek communities (Tuck-Po 1998). It appears that poverty is one likely reason for this high dependency. According to a report from the Statistics Department (2010), 1.4% of indigenous people nationwide were classified as poor. In Pahang, 35.2% of the Orang Asli were classified as hardcore poor.\n\nOnly a few studies have documented the use of animals by the Orang Asli in Peninsular Malaysia. At least 12 species are known to be utilised by the Orang Asli for various purposes (Yahaya 2015; Azliza et al. 2012, Howell et al. 2010). In Sarawak, however, up to 52 species of animals have been utilised by the indigenous people for medicinal purposes (Mohd Azlan and Muhammad Faisal 2006). Thus, this survey aims to compile a list of wildlife utilised by the Orang Asli community living near Tasik Kenyir (the largest man-made lake in southeast Asia) in Terengganu. The uses of the wildlife will also be discussed."}, {"url": "https://www.malaymail.com/news/malaysia/2021/11/01/property-rental-minister-admits-discrimination-exists-says-very-awkward-to/2017524", "page_content": "KUALA LUMPUR, Nov 1 — Racial discrimination does exist in Malaysia’s property rental market, Local Government Minister Datuk Seri Reezal Merican Naina Merican acknowledged in Parliament today.\n\nHowever, he said it would be “very awkward” to enact a law that seeks a fair balance between the rights of both landlords and tenants while including the landlord’s preference for certain tenants, even if other countries have clear-cut anti-discrimination legislations.\n\n“The discrimination issue raised by YB, yes it is true, I have listened and seen it myself but at this moment we are still studying in detail in terms of local circumstances.\n\n“There are similar Acts in Australia and even in the United States which prohibits any form of sale advertisements by including one’s preference.\n\n“But in Malaysia, when we talk about discrimination, it comes down to preference. It would be very awkward to have Acts supporting the preference of owners’ rights but we will conduct further studies on the suitability of including the elements raised by YB,” Reezal Merican said during Question Time in the Dewan Rakyat.\n\nHe was replying Bangi MP Ong Kian Ming who wanted to know if the soon-to-be tabled Residential Tenancy Act would address racial discrimination in Malaysia’s property rental market.\n\nReezal Merican said the “real spirit” of the proposed law is to balance the rights of tenants and property owners.\n\nHe said the Residential Tenancy Act is meant to standardise rental agreements and establish a tribunal to resolve disputes between tenants and landlords.\n\n“At this moment, the preparation of residential rental agreements utilises the procedures stipulated under the Contract Act where the agreements are generally non-comprehensive and do not fully protect the interests and rights of tenants and owners of premises,” he said.\n\nHe said the new law is in the final stages of its drafting and is scheduled for tabling in Parliament in July 2022.\n\nReezal Merican explained that the draft of Malaysia’s Residential Tenancy Act is modelled after the Residential Tenancies Act 2010 in New South Wales, Australia.\n\nHe added that similar laws from Germany, the United Kingdom and South Africa were used as comparisons.\n\n“Apart from comprehensive stakeholders’ meetings, a Regulatory Impact Assessment will also be implemented by the Malaysia Productivity Corporation to identify and assess the effects from suggestions gathered towards the drafting of the Bill,” he said.\n\nHe also pointed out that since the relationship between landlords and their tenants fell under the state’s jurisdiction as provided under Article 76(4) of the Federal Constitution, proposals outlined in the Bill is set for tabling in the National Council for Local Government before it is presented to the Attorney General’s Chambers for a final review."}, {"url": "https://www.persee.fr/doc/arch_0044-8613_1991_num_42_1_2750", "page_content": "TAN Chee-Beng\n\nA Note on the Orang Yunnan in Terengganu\n\nThis paper deals with a small group of Chinese Muslims in Terengganu. They are not Chinese converts to Islam, often known as Saudara Baru or « New Relatives » by the Malays W. The group had its origin in a few Chinese Muslims who came from China and settled in Kuala Terengganu, the capital of the Terengganu state in the east coast of Peninsular Malaysia. These Chinese Muslims are unique in a country where fifty-four percent of the population of 13,7 million persons are Malays who are Muslims (2) and thirty-two percent are Chinese who are almost all non-Muslims (3). In fact the population of the Chinese Muslims (mostly converts) in Malaysia numbers less than one percent of the Chinese Population (4).\n\nThe Muslims in China were called Hui Hui or Huimin in contrast to the predominantly non-Muslim Han Chinese (5). However since the 1950's the Communist government had used the term to refer to « the Chinese-speaking Muslims, as opposed to the other Turkic-Altaic Muslim language groups » (6). Islam entered China at first by sea in the seventh century when Arab traders came to the ports of China. Islam was also introduced to China via the Silk Road. By the tenth century, more Muslims from Western and Central Asia went to China by land C7). Today, there are Muslims in different parts of China with concentration in the northwest where the people such as the Uygur, Kazak, Uzbek, etc. still bear Turkic features (8). Those Muslims descended from the Arab traders who went by sea to the port cities lilçe Guangzhou (Canton), Fuzhou, Hangzhou, Quanzhou, and Yangzhou have been much more accul- turated and even biologically assimilated through intermarriage so that physically they are not different form the « Han » Chinese. There are also Huimin in Taiwan comprising Muslims who originated from different parts of mainland China (9). In Burma, the Hui who originated from Yunnan are called « Panthay » while those in Thailand (i.e. Yunnanese Chinese Muslims) are known as « Haw » (10).\n\nAlthough few Chinese Muslims from China came to settle in Southeast Asia, there were some early contacts between them and the people in the Malay archipelago (n). Admiral Zheng He of the Ming dynasty, for example,"}, {"url": "https://diveintomalaysia.com/things-to-do-in-kuala-terengganu/", "page_content": "This article may contain compensated links. Please read the disclaimer for more info\n\nThe east coast of Malaysia is great to explore. However, with all the beautiful tropical islands, it can be easy to forget that there is far more to explore here. Like Kuala Terengganu! There are plenty of things to do in Terengganu, so it’s well worth a visit if you can spare the time.\n\nKuala Terengganu is a city with over 250,000 people located towards the northern end of the east coast and close to the popular island of Redang. Many people that come through here just to go straight to Redang, which is a shame! There are many places to visit in Terengganu, making it worth a stopover even if you can only spend a night.\n\nKuala Terengganu is in a pretty spot centred on a promontory on the South China Sea. It was a fishing village before oil was found here. Now rapid development has lead to a great waterfront area. You’ll also find one of the best Chinatowns in Malaysia. This is also the best place in Terengganu for yummy food! The area is picturesque, with kampong-style stilt houses.\n\nAnd that’s not even mentioning the best aspect of this city – its friendly people. It’s the friendliest place I have been to in Malaysia and that’s saying a lot.\n\nIf you are exploring the east coast of Malaysia, definitely add Kuala Terengganu to your list as there are plenty of interesting places in Terengganu to visit.\n\nBelow, I give you 20 reasons why with our best things to do in Kuala Terengganu. I also help you plan your trip with the best hotels in Kuala Terengganu, how to get there, how to get around and what we thought of our visit here. You can also see where all the best attractions in Kuala Terengganu are located on a handy map!\n\nLet’s start!\n\nTravelling to Malaysia? Click here to download your free Malaysia Trip Planning checklist. We’ll help you get ready for your trip!\n\nHave any questions? Join our Malaysia Travel Planning Facebook group here now! It’s the perfect place to ask any questions and to be inspired.\n\nTop 19 Best Things To Do In Kuala Terengganu, Malaysia [2023]\n\nBelow are our suggestions for what to do in Kuala Terengganu. Note that the state of Terengganu has weekends on a Friday and Saturday. Opening hours to many of the interesting places to visit in Kuala Terengganu, Malaysia are limited or closed on Fridays. So if you only have one day in this city, try to make it a different day.\n\nIt’s also worth noting that when we visited, many attractions we planned to visit were actually closed down so be weary about reading older publications, like Lonely Planet. Everything below was definitely available when we updated this article. Be wary of anything published earlier.\n\nVisit The Tengku Tengah Zaharah Mosque\n\nThe beautiful Tengku Tengah Zaharah Mosque\n\nWhen it comes to what to do in Terengganu, I recommend starting with a visit to the Tengku Tengah Zaharah Mosque. This stunning mosque, known as the Floating Mosque, is on an artificial island surrounded by water about 4.5 kilometres south east of the centre of Kuala Terengganu.\n\nThe mosque is pretty at any time of day, but it’s particularly beautiful at sunset when the traditional white, Moorish design looks spectacular against the setting sun. Definitely, a top place to visit in Terengganu.\n\nExplore Taman Tamadun Islam And The Crystal Mosque\n\nThe Crystal Mosque made of steel, glass and crystal\n\nWhen you visit Kuala Terengganu, definitely take a look at Taman Tamadu Islam – the world’s first Islamic civilisation park. There are two parts to it.\n\nZone A is the first part. It is free. Here you can visit the Crystal Mosque pictured above. Made out of steel and glass, it is quite unique. It is named after the huge crystal chandelier in the main prayer hall.\n\nZone B has an entry fee and is home to a series of miniature models of famous Islamic buildings from around the world such as Mecca’s Haram Mosque and India’s Taj Mahal. They are built to a scale between 1:17 and 1:22. There are also river cruises.\n\nThe mosque is located about 2.5 kilometres from central Kuala Terengganu and there are bus and taxi options. This is one attraction that should be on your list of Terengganu places to visit.\n\nExplore Chinatown\n\nChinatown\n\nAfter the serenity of the mosques, the next best place to visit in Kuala Terengganu is bustling Chinatown. This compact area is centred on Jalan Kampung Cina and is home to heritage buildings, temples and alleys with street art. It’s charming and makes for a lovely walk.\n\nIt’s a fun place for a quick stroll and, below, you will find some Kuala Terengganu things to do while you are there.\n\nFind Some Street Art\n\nStreet Art in Chinatown\n\nMore and more cities in Malaysia seem to be adding some fabulous street art to their alleys and streets and, thankfully, Kuala Terengganu has too!\n\nThe best place in Kuala Terengganu to see street art is in Chinatown. While you’re there check out every alley you see and you’ll find many will have street art. When I tried to find examples I had looked up beforehand, they just weren’t where they were publicised. It’s much easier (and more fun) to just look out for it as you go.\n\nVisit Ho Ann Kiong Temple\n\nHo Ann Kiong Temple\n\nAlso located in Chinatown, the attractive Ho Ann Kiong Temple is another Terengganu place to visit as you wander around.\n\nThis red and gold temple dates back to 1796, although it was rebuilt in both 1801 and 2010 after a fire. It’s smaller than I expected. Make sure you check out the stone carvings inside and outside the temple.\n\nBehind Ho Ann Kiong Temple\n\nAnd when you are finished, walk around the back. There is a cool “wishing tree”.\n\nLearn Chinese Peranakan History At Teck Soon Heritage House\n\nTeck Soon Heritage House\n\nIn a previous life, this Chinatown shophouse was owned by the Teck Soon Trading Company. Now, it is a much more interesting place in Terengganu as it is a history museum focused on Chinese Peranakan culture in this city. Painted beautifully in three shades of blue, even if you don’t want to enter, it’s worth checking out the outside.\n\nEntry is free. However, it is unclear what the opening hours of the museum are now. Still, wander past when you are exploring Kuala Terengganu as it looks great.\n\nShop At The Central Market\n\nCentral Market\n\nAnother one of the things to do Kuala Terengganu offers is the Central Market. This is the place to go for a lively atmosphere, to sample local food and buy fruit.\n\nThere’s also a wide range of batik and locally weaved fabric here. Many stalls are shut on Fridays.\n\nVisit The Zainal Abidin Mosque\n\nZainal Abidin Mosque\n\nFor a mosque closer to the city centre, the Zainal Abidin Mosque is a Kuala Terengganu tourist attraction just a short walk from Chinatown. It’s pretty inside with 9 domes letting light in and pretty latticed windows.\n\nNon-Muslims can enter if dressed appropriately.\n\nCheck Out Istana Maziah\n\nRoyal palace Istana Mazih\n\nNear the Central Market on the side of a hill is the Sultan’s Palace.\n\nYou can’t go inside to visit, but it’s still one of the Kuala Terengganu places to visit – you can check out the outside as you walk past on Jalan Masjid Abidin.\n\nVisit Bukit Puteri\n\nAnother one of the places to go in Terengganu which is located by the Central Market and Istana Maziah is Bukit Puteri. Here, there are a few Kuala Terengganu activities including a 200 metre hill you can walk up to get great views of Kuala Terengganu, the Sungai Terengganu river mouth and out to the South China Sea.\n\nThere are also historical remains here from when the sultan used this area during the civil war as a fort. There are still cannons, a flagpole, large bell and remains of defence walls. You can also find a lighthouse at the top of the hill.\n\nEntry costs RM1. It was closed at the time of publishing so we couldn’t check it out.\n\nWalk Along The Waterfront Area\n\nKuala Terengganu riverfront area\n\nFor your Kuala Terengganu sightseeing list be sure to add the area by the river near Chinatown. There are pretty bridges and walkways and even a huge “I <3 KT” sign.\n\nIt’s a nice place to walk in the evening, and there are some food stalls to fill your belly as well.\n\nExplore Pulau Duyung\n\nPulau Duyung\n\nPulau Duyung is an island in the estuary close to the centre of Kuala Terengganu. It’s quite different from the other options of what to see in Kuala Terengganu as it feels like you go back in time if you walk around the older areas.\n\nIt is just a short taxi, bus or ferry (from behind Central Market but just once a day) from the centre and, unfortunately, modern housing estates are starting to take over the island. However, there are still old wooden houses and it can feel like you are in a smaller village.\n\nYou can walk around and soak up the island as well as visit old boat-building yards where boats are often built using old tools and techniques. Pulau Duyung is certainly another one of the interesting places in Kuala Terengganu to visit.\n\nLearn History At The Muzium Kompleks Negeri Terengganu (Terengganu State Museum)\n\nMuzium Kompleks Negeri Terengganu (or Terengganu State Museum)\n\nThis is a top tourist attraction in Kuala Terengganu, Malaysia if you want to learn more about the history of the area and to see traditional houses. It’s actually the largest museum in Malaysia with 4 interconnected buildings built on stilts and based on ancient Terengganu palace designs!\n\nThe highlight is definitely the buildings themselves and other traditional buildings that are here.\n\nInside, you will find information on natural history including rocks, minerals, flora and fauna found in the state, local textiles, traditional handicrafts, the Terengganu royal family, petroleum, the arrival of Islam into the Terengganu area and the history of human development in Terengganu. There are also old cars, boats and planes to check out. It’s a lot!\n\nThe only shame is that it could be better maintained and put in some type of order so you can get as much as possible from a visit. Still, it’s definitely one of the Kuala Terengganu tourist attractions worth visiting, even just for the buildings alone.\n\nThis tourist attraction in Terengganu is located about 6 kilometres from the city, so you need to bus or take a Grab taxi. Foreigner entry is currently RM15 for adults or RM10 for kids. It’s a fair bit cheaper for Malaysians.\n\nEat Everything At Town City Food Court\n\nTown City Food Court\n\nYummy char kuey teow\n\nThe best place to visit in Terengganu when you start to get hungry is Town City Food Court. Located on the edge of Chinatown, it’s the perfect place to kick back for lunch or dinner. There are some good Chinese food options. There is also a relatively good selection of cold beer and fans to keep things cool.\n\nWhen I first entered, I was overwhelmed by some menus being only in Chinese, but people speak at least some English so don’t let that stop you!\n\nTaste The Great Coffee At Star Anise\n\nStar Anise\n\nOne of the top 10 things to do in Kuala Terengganu is to pop into Kuala Terengganu’s best coffee joint!\n\nOpen from midday to midnight in Chinatown, this is the perfect place to grab a sweet coffee or to take a break between sightseeing for some pie or cheesecake.\n\nRelax at Batu Buruk (Beach)\n\nBatu Buruk\n\nLooking for some beach time with your Kuala Terengganu main attractions? Then head to Batu Buruk.\n\nLocated a short drive away, this is where you will find a long sandy beach with nice water although it’s a better place to picnic than swim. There are also cultural performances sometimes and swings right on the beach!\n\nIt is popular with locals, particularly on weekends, so weekdays can be a better time to visit with the absolute best time to visit being on Friday nights when there is a delicious night market.\n\nWhile Batu Buruk is not the best place at Terengganu if you’re looking for a swim, it’s still well worth a visit to hang out with the locals.\n\nTake A Cruise\n\nKuala Terengganu drawbridge\n\nA great way to explore Kuala Terengganu is from the water, especially if you are short on time.\n\nOn this two hour cruise, you can see many of the things to do in Kuala Terengganu from a different angle and take some great photos.\n\nThis cruise visits the Crystal Mosque, Duyong Island, Sekati Island, the big drawbridge and more. It departs throughout the day so you can choose your perfect time slot.\n\nClick here to see the latest prices and to book.\n\nVisit Redang Island\n\nMy first view of the beach on arrival at Redang Island. It literally took my breath away. This photo does not do it justice!!\n\nRedang Island is the place to go for gorgeous beaches and great snorkelling and diving. Visiting here is a great to intersperse the city attractions of Kuala Terengganu with some amazing natural attractions. It’s one of the prettiest places I have been in Malaysia.\n\nWhile at least an overnight stay is best (read our guide to the best resorts here), it is also possible to day trip to Redang Island. Find our full Redang travel guide here.\n\nYou can also read exactly how to get to Redang from Kuala Terengganu here.\n\nVisit A Fisherman’s Village In Seberang Takir\n\nFound just off the coast of Kuala Terengganu, Seberang Takir is a fisherman’s village which is the best places in Terengganu for visitors to get a glimpse of authentic local culture in the area.\n\nHire a local boat and driver to take you to the village, as you immerse yourself and observe the everyday lives of locals in the village. Visitors here are always welcome.\n\nJust make sure that you’re respectful with the locals because Seberang Takir is a real working village.\n\nKuala Terengganu Itinerary\n\nThe downtown area is home to many of the attractions and activities in Terengganu which are mentioned above. They are all just a short walk from each other.\n\nBelow, I have listed a short circuit you could do on foot to visit all the Terengganu interesting places. You only need a couple of hours to do this.\n\nVisit the Terengganu points of interest in this order to save your legs and see a lot in a short time:\n\nIstana Maziah Zainal Abidin Mosque Bukit Puteri Central Market Walk through Chinatown, looking for street art and while visiting the following attractions. Star Anise Ho Ann Kiong Temple Town City Food Court Waterfront area\n\nTop it off with this river cruise, and you can see a lot of Kuala Terengganu in half a day.\n\nBest Hotels In Kuala Terengganu\n\nA plus about visiting Kuala Terengganu is that there is a range of accommodation and it is all good value.\n\nI recommend staying somewhere central where you can walk to most tourist attractions in Terengganu mentioned above. Make sure you are close to Chinatown and that will tick this box.\n\nThe outside of the Grand Puteri Kuala Terengganu\n\nThe Grand Puteri Hotel is my top choice because it is so centrally located, has great facilities and is incredibly good value.\n\nYou can easily walk to most Kuala Terengganu attractions listed above from here and then cool down in the pool when you are done. There is also a restaurant and a business centre.\n\nThere are a few different room types. We stayed in the cheapest, which is fine – although you do somewhat get what you pay for. There are suites if you want a treat! I was very happy with the price we paid.\n\nClick here to see the latest prices or read our full review here.\n\nBUDGET – Arena Boutique Hotel Review\n\nFor a great priced option, consider the clean, tidy and comfortable Arena Boutique Hotel on the edge of Chinatown. It’s only a budget hotel in terms of price, not what is offered.\n\nThere is a great range of room types of solo travellers, couples and families with bedding for up to five. Rooms come with free wifi, tea and coffee making facilities, flatscreen TV and comfortable bedding. There is also an executive suite with its own living area.\n\nOn-site, you can also find a fitness centre and a restaurant.\n\nClick here to see the latest prices.\n\nFind our full guide to the best hotels in Kuala Terengganu here.\n\nGetting To Kuala Terengganu\n\nKuala Terengganu bus station\n\nKuala Terengganu is easy to reach from anywhere in Malaysia. There is an airport where you can fly direct from Kuala Lumpur or you can catch buses from many points.\n\nYou can find direct buses to Kuala Terengganu from Kuala Lumpur here.\n\nYou can also read our full guide to getting to Kuala Terengganu from Kuala Lumpur here.\n\nAt the time of writing this, direct buses from Singapore to Kuala Terengganu were not running. Your best bet is to get a bus to Johor Bahru and then catch a direct one from there.\n\nClick here for latest timetables and prices from Johor Bahru to Kuala Terengganu.\n\nAn even easier way to get to Kuala Terengganu from all over peninsular Malaysia is to take a private, long-distance taxi.\n\nWe can book one for you with a safe and trustworthy local operator. Click here for the details.\n\nGetting Around Kuala Terengganu\n\nMost things to do in Kuala Terengganu are close together so it’s easy to walk between many of the attractions here.\n\nFor others, there is a good bus system in Kuala Terengganu which should get you to most places of interest in Kuala Terengganu listed above. However, if you have limited time, it’s much easier to use taxis and they are affordable as well.\n\nUse the Grab app (easy to install and get started if you don’t already have it) to get taxis. This works like Uber (in fact, Grab bought Uber in Malaysia) and makes life very easy.\n\nMap Of Attractions In Kuala Terengganu\n\nTo help you plan your itinerary below is a map which shows where all the places to go in Kuala Terengganu are located.\n\nClick the Map to open in Google Maps. You can then access directions to each of the locations discussed in this article.\n\nKuala Terengganu With Kids\n\nI visited Kuala Terengganu with my kids and found it a very easy place to be. Most places to visit Kuala Terengganu are short and sweet which is excellent for kids with short attention spans!\n\nThey also particularly loved the Muzium Kompleks Negeri Terengganu thanks to all the buildings, cars, planes and boats.\n\nThe night market at Batu Buruk is also a winner, particularly if you’re after a Kuala Terengganu night activity.\n\nPlayground behind Town City Food Court\n\nThere is also a playground out the back of the Town City Food Court perfect for a play while you get something to eat. The riverfront area is also good to get rid of some energy. There is another great playground near Shahbandar Jetty.\n\nFinal Words\n\nIt can be easy to skip over Kuala Terengganu on your way elsewhere but don’t! A visit here is an easy way to see a different slice of Malaysia with some low key attractions and great food.\n\nEven if you can only spare a night on your way to Redang Island, it’s worth it! Especially as many of the Kuala Terengganu activities are a short walk from each other meaning you can explore a lot in even just a morning or evening. This city is great for walking around in and people are very friendly and helpful.\n\nDon’t miss it!\n\nClick here to read our guide to the best places to stay in Kuala Terengganu. You can find our full travel guide to Kuala Terengganu here.\n\nHeading to Redang Island afterwards? Find all our Redang Island guides here.\n\nPlanning a trip to Malaysia? Have any questions? Join our Malaysia Travel Planning Facebook group here now! It’s the perfect place to ask any questions and to be inspired!"}, {"url": "https://www.malaymail.com/news/malaysia/2021/05/03/national-sports-council-ordered-to-probe-claims-of-athletes-being-verbally/1971266", "page_content": "KUALA LUMPUR, May 3 — Youth and Sports Minister Datuk Seri Reezal Merican Naina Merican today ordered the National Sports Council (NSC) to look into allegations of mental abuse after the sibling of a national athlete took to social media to expose the abusive conduct of a Taekwando coach.\n\nReezal Merican was responding to the social media post by Lavinnia Subramaniam yesterday, who alleged that her sister — 23-year-old Dhaassheni Subramaniam — was humiliated in front of the national team by coach Rusfredy Tokan Petrus, who hurled insults at her, including regarding her deceased mother.\n\n“Thank you for the information. I have instructed the director-general of NSC Malaysia to investigate this matter immediately,” Reezal said in a Twitter reply.\n\nYBM @reezal_merican , is this how our national heroes are being treated by MSN ?\n\n\n\nKebajikan atlit negara tidak dijaga dan dihina oleh ketua jurulatih dan tiada tindakan diambil oleh pihak MSN walaupun telah dilapor !\n\n\n\nThe coach was also intoxicated, do help to get attention pls pic.twitter.com/aTCLE4vMuV — Dharshinee Suresh Kumar (@ayeitsdharsh) May 3, 2021\n\nA police report made yesterday by Dhaassheni’s father, Subramaniam Raghavan, was also shared on social media detailing the alleged abuse.\n\nThe report claimed that at 10.30pm on April 28, Rusfredy allegedly convened all Taekwondo athletes at the NSC premises in Bukit Jalil, and spoke harshly to the athletes.\n\n“He then approached my daughter and spoke very harsh words such as ‘my brother died for the nation, but your mother died for nothing’. The coach then told my daughter he would use his ‘cables’ to eliminate my daughter from the national team,” read Subramaniam’s report.\n\nSubramaniam also reported that Rusfredy allegedly smelled of alcohol at the time of the incident.\n\nWhen contacted, Lavinnia said her sister had joined the national Taekwondo team in August last year, and Rusfredy has mentally abused her sister on several occasions since then.\n\n“We don’t even know why he has been doing this to her,” she said.\n\nShe added that their mother passed away in 2017 due to cancer."}, {"url": "https://www.straitstimes.com/asia/se-asia/the-peranakans-of-terengganu", "page_content": "KUALA TERENGGANU (Terengganu) - If Penang and Malacca are famed for their Baba and Nonya, Terengganu can lay claim to its own Mek and Awang.\n\nNot many people know that this East Coast state also has a substantial Peranakan Chinese community whose women are called Mek and men Awang.\n\nPeranakan, meaning locally born, refers to migrant communities who have assimilated with the Malays over many generations, often through inter-marriage. The blend of the two has created a distinctly new culture, especially in the kitchen where the merging of flavours has brought out a deliciously fused cuisine. It has also helped fuse ties between the races.\n\nWhether Peranakan or not, the East Coast Chinese community is known to have much closer ties with the Malay community there. And this holds important lessons on how Malaysia's different races can learn from one another and learn to live in harmony.\n\nChinese make up about 10 per cent of the population on the East Coast. They take pride in being part of a melting pot, especially amid Malaysia's current political turmoil wherein the Chinese and Malays are pitted against each other.\n\nThey see themselves as creating a more honest sort of multiracialism, which mixes and blends, yet remaining a distinct part of the whole. \"Our community is small, and we have to mix with the other people. On the West Coast, there is less integration,\" said Mr Teo Ken Bin, who can trace his family tree back nine generations.\n\nIn the East Coast states of Terengganu and Kelantan, some Peranakan Chinese can trace their family tree back 10 generations. \"It's now very much part of our own lifestyle, the way we cook, our dress, and how we eat with our fingers,\" Mr Teo said. The urbanite Chinese of the West Coast are much more segregated from the community around them.\n\nMr Teo, 60, said his family believed their ancestry dated back nine generations based on a tablet on his grandmother's prayer altar. It was a tablet for Kapitan Zhang Zhaorong, an 18th-century Chinese community leader.\n\nThe Teo ancestral home is a 200-year-old house in Kampung Cina, which is essentially a row of old shophouses built over the centuries in various styles from art deco to southern Chinese. Reminiscent of the more famous George Town in Penang, the picturesque street was once mainly settled by the Chinese but now has a more mixed population.\n\nThe Teo house is a hybrid of traditional Malay wooden architecture at the back with a southern Chinese shophouse frontage. Part of the structure has been turned into a small restaurant offering local Peranakan food - Madam Bee's Kitchen - run by Mr Teo's wife, Tan Choo Bee.\n\nShe said their cuisine, while similar to the Malaccan or Penang Peranakan cooking - which fuses the Chinese and Malay food cultures - has a more distinct East Coast flavour. Terengganu Peranakan cooking makes liberal use of the local pungent fish sauce called budu, Malay spices as well as a lot of local seafood.\n\nPopular dishes are the local version of crab cake, ayam pachok which resembles satay with a stronger flavour, fish in spicy tamarind sauce and slow-cooked chicken with palm sugar. Their desserts bear close resemblance to Malay kuih including sekaya pulut (glutinous rice with coconut-egg jam), akor (egg and coconut pancake) and jackfruit tarts.\n\nMr Alex Lee, an energetic tour operator, agrees that the East Coast Chinese are better integrated. An enthusiastic collector of old Malay houses, he has come to appreciate Malay culture and philosophy, and is prone to reciting Malay poetry to illustrate these ideas.\n\nMr Lee, 46, grew up in the small Malay town of Marang, about 20km from the state capital Kuala Terengganu.\n\n\"When you speak the language, you understand the culture better, and you know better how to live together,\" he said. \"The East Coast Chinese understand the Malay culture better.\"\n\nFor him, it began with the floral carvings on his grandfather's shophouses where he had run a backpackers' guesthouse in the 1990s. They were the first things he salvaged when the century-old shophouses were demolished.\n\nFrom there, he began to collect wood carvings and later, entire houses of Terengganu Malay origin. Eventually, he ended up with 29 whole houses, and over 100 partial houses which provide spare parts for restoration work.\n\nIn 2005, he began reassembling them on a piece of seafront land in Setiu, an hour's drive from Kuala Terengganu. These houses fit together like a jigsaw puzzle, and no nails are used. They also do not rot as the hard wood resists moisture and termites.\n\nWith 17 houses now reincarnated in a landscaped garden resembling a palace of old, Mr Lee opened it as the Terrapuri Resort. Each house is now a guest room.\n\nFor him, Terrapuri is a repository of the Malay stories, history, philosophy and heritage of his homeland. As the largest such project in Malaysia, it had cost about RM10 million (S$3.7 million) but he has refused lucrative offers for the houses.\n\nHe said the more he learnt about Malay houses, the more he saw them as a reflection of the Malay philosophy on life.\n\n\"Community values are very important in understanding the architecture and stories,\" said Mr Lee, whose family has been in Terengganu for five generations.\n\nFor instance, he said, floral carvings follow a Malay verse which describes how vines are to be carved - never strangling or pushing the other out of the way. It is a reflection of the Malay philosophy of sharing.\n\nHis obvious love for Malay culture is often what persuades house owners to sell to him; in one case, it took 15 years to clinch the sale. One house had belonged to an influential Islamic teacher, and carvings in Jawi writing depicting an old fable found in the Quran were found on its outer wall. \"There are just so many exciting stories to tell,\" he said.\n\nHaving seen how his appreciation for the Malay culture has brought him closer to the community, Mr Lee has now turned his energies to bringing the two communities closer.\n\nHe hopes to do this through the Peranakan Terengganu festival held in September. Organised by the Terengganu Chinese Chamber of Commerce, it was not just to showcase the Chinese Peranakan culture, but also to get people of all races to mingle.\n\nMr Lee, though, sees a growing gap among the races as the younger generation increasingly finds they have less in common with each other. \"The Malays need to understand the Chinese culture, and the Chinese need to understand the Malay culture,\" he said. \"Here, for generations, it was not just tolerance that we had for each other, but a real blend of cultures.\"\n\nThe Peranakans had played a very important role in nurturing this relationship, he said.\n\ncarolyn.sy@gmail.com\n\nNEXT WEEK: TREK TO THE JUNGLE SCHOOL"}, {"url": "https://www.penang-traveltips.com/malaysia/terengganu/history-of-terengganu.htm", "page_content": "\n\nbbbsheep\n\nhttps://commons.wikimedia.org/wiki/File:Floating_Mosque.jpgbbbsheep\n\nTerengganu Inscription Stone\n\n\n\nMeursault2004\n\nhttps://commons.wikimedia.org/wiki/File:Pr_Trengganu_B.jpgMeursault2004\n\n\n\n\n\nReturn to Discover Terengganu mainpage\n\nAbout this website\n\nThegoes back to ancient times. Being on the east coast of West Malaysia, Terengganu is located along the ancient trade routes. It was mentioned in the chronicles of ancient Chinese merchants and seafarers in the early 6th century A.D.In its earliest state, Terengganu was a principality that practiced a culture combining Hinduism and Buddhism with animistic traditional beliefs. This was a few hundreds of years before the arrival of Islam. According to historial accounts, Terengganu could have been part of the Srivijaya Empire between the 7th to the 13th or 14th century. During that time, it traded extensively with the Majapahit Empire, the Khmer Empire and especially the Chinese.A stone with Arabic inscriptions dating to 1303 attributed Terengganu as the first Malay state to receive Islam. The stone was found in Kuala Berang, the capital of the district of Hulu Terengganu. During the 15th century, Terengganu became a vassal state of Melaka. After the fall of the Malacca Sultanate, Terengganu retained considerable autonomy with the emergence of Riau-Johor Empire.Terengganu emerged as an independent sultanate in 1724. The first Sultan was Tun Zainal Abidin, the younger brother of a former sultan of Johor. Johor exerted a strong influence on Terengganu politics through the 18th century. According to the bookwritten by Raja Ali Haji, Tun Zainal Abidin was in 1708 installed as the Sultan of Terengganu by Daeng Menampuk also known as Raja Tua under the rule of Sultan Sulaiman Badrul Alam Shah.Terengganu became a vassal state of Siam in the 19th century. It sent an annual tribute to the King of Siam in the form of \"bunga mas\" (a gift of flowers fashioned from gold plates). Under Siamese rule, Terengganu prospered, and was largely left alone by the authorities in Bangkok. The Anglo-Siamese Treaty of 1909 transferred the administration of Terengganu to Great Britain. A British advisor was appointed to the sultan in 1919, and Terengganu become one of the Unfederated Malay States. The move was highly unpopular locally, and in 1928 the British used military force to suppress a popular uprising.During World War II, Japan occupied Terengganu and transferred sovereignty over the state back to Siam, along with Kelantan, Kedah, and Perlis. After the defeat of Japan, British control over these Malay states was reestablished. Terengganu became a member of the Federation of Malaya in 1948, and a state of independent Malaya in 1957.Following decades of rule by the Barisan Nasional (National Front) coalition, the Islamic Party of Malaysia (PAS) came to power in the 1999 General Elections, making Terengganu the second state in Malaysia to be ruled by the Islamist party (the first being neighboring Kelantan). However, in the 2004 General Elections, Terengganu was recaptured by the Barisan Nasional.Hello and thanks for reading this page. My name is Timothy and my hobby is in describing places so that I can share the information with the general public. My website has become the go to site for a lot of people including students, teachers, journalists, etc. whenever they seek information on places, particularly those in Malaysia and Singapore. I have been doing this since 5 January 2003, for over twenty years already. You can read about me at Discover Timothy . By now I have compiled information on thousands of places, mostly in Peninsular Malaysia and Singapore, and I continue to add more almost every day. My goal is to describe every street in every town in Malaysia and Singapore."}, {"url": "https://en.wikivoyage.org/wiki/Terengganu", "page_content": "Terengganu (also Trengganu) is a state on the eastern coast of Peninsular Malaysia in Malaysia. The primary attractions of the state are the beautiful tropical Perhentian and Redang Islands.\n\nCities [ edit ]\n\n, the capital and by far the largest city in Terengganu\n\n, a medium-sized town and jumping-off point for Tenggol\n\n, a city neighbouring Pahang\n\n, a fishing village where you can find nice beaches and a clear blue river\n\n, the main port for ferries to the Perhentian Islands\n\n, the port for ferries to Kapas Island\n\n, the port for ferries to Redang\n\n, a small fishing village with cottage industry\n\nSetiu , a small region where you can find nice beaches and flour dipped food\n\nOther destinations [ edit ]\n\nA false clown anemonefish amidst the sea anemones near the Perhentian Islands\n\n, a small island with little accommodation and nice snorkeling.\n\n\n\n, great diving.\n\n, a more expensive version of paradise with creature comforts and more great diving.\n\n, a sea turtle nesting place.\n\n, a gorgeous artificial lake.\n\n\n\n, a very gorgeous beach with a small rock island just a stone's throw from the beach. When the tide recedes, you can walk to the tiny island and play on its beach. It's just 2 km from Kerteh town. Also, lots of fishing villages are around this beach. The scenery is majestic, especially when the sun rises. It's an excellent places for avid photographers.\n\nUnderstand [ edit ]\n\nTerengganu Inscription Stone, Side A\n\nTerengganu is probably the most Malay of all the Malaysian states, with Malays comprising approximately 95% of the population. It is also the Malaysian state where Islam first arrived, as documented by a 1303 C.E. stone inscription that was left at Kuala Berang, the capital of the district of Ulu (upriver) Terengganu; the Terengganu Inscription Stone is now displayed at the Terengganu State Museum in Kuala Terengganu. As a result of the state's history as the first recipient of Islam in Malaysia and the deep faith of most of the overwhelming Muslim majority in the state, its official nickname is Darul Iman — The Abode of Faith in Allah.\n\nTerengganu's economy has benefited from the discovery and subsequent exploitation of offshore oil deposits, which are near the shore and supply some surprisingly beautiful petrochemical plants on land near the coast between Paka and Kerteh. The plants do not produce unpleasant odors and are particularly attractive at night, when they are lit up.\n\nBut in spite of all the development and a greatly increased population relative to decades past, most of Terengganu is still rural, a state of kampungs — Malay villages — with roadside stands, long stretches of coconut palm-studded sandy coastline (though see the \"Stay safe\" section before you decide to swim) and wonderful fresh local produce. So quite apart from the draw of the offshore islands including Perhentian Besar, Perhentian Kecil and Redang, many people from the big cities of the West Coast and Singapore find it relaxing to drive up the coast and spend some time feeling a slower rhythm of life than what they experience back home.\n\nTalk [ edit ]\n\nIt will help you to know some Malay. Some people speak English, but do not expect everyone to be able to.\n\nThe Terengganu dialect varies significantly in pronunciation and somewhat in vocabulary from standard Malay and is closely related to Kelantanese Malay, though it is not as different from standard Malay pronunciation as Kelantanese is. However, unless you are planning on visiting some small villages inland, you are likely to meet only people who speak standard Malay with a fairly standard accent, even if they can also speak dialect among themselves. The northernmost district, Besut, traditionally speaks Kelantanese Malay.\n\nThe largest ethnic minority in the state is the Chinese, with a Chinatown in Kuala Terengganu. Most of the Chinese are fluent in both standard Malay and Terengganu Malay, but also speak Mandarin and various Chinese dialects.\n\nGet in [ edit ]\n\nMost visitors to the Perhentians bypass the bulk of Terengganu and instead transit via Kota Bharu, in the neighbouring state of Kelantan, which offers better connections by air and train and is only one hour away. However, Kuala Terengganu and other locations along the main north-south highway are accessible via long-distance bus from Kuala Lumpur, Penang and various other cities.\n\nBy plane [ edit ]\n\nKuala Terengganu's own Sultan Mahmud Airport (TGG IATA ) has a number of flights daily from Kuala Lumpur and twice daily from Penang, as well as a thrice weekly international flight to Singapore by Firefly. It's a two-hour drive from here to Kuala Besut, the usual jumping-off point for the Perhentian Islands.\n\nThe closest airport to Besut is actually Sultan Ismail Petra Airport (KBR IATA ) at Kota Bharu, Kelantan. Kuantan, Pahang's Sultan Haji Ahmad Shah Airport (KUA IATA ) is the closest to the southernmost reaches of the state.\n\nBy car [ edit ]\n\nThe fastest way to get into Terengganu by car from the neighbouring state of Pahang is via the Lebuhraya Pantai Timur (East Coast Expressway), a toll road which also connects with the Kuala Lumpur-Karak Expressway, enabling fairly speedy access from the West Coast. From Kelantan, it is necessary to take the older though still multi-lane East Coast Highway, which is free.\n\nBy bus [ edit ]\n\nVarious bus companies run long-distance buses from Kuala Lumpur and other Malaysian cities to Kuala Terengganu. Depending on the route, it may be possible for you to get off at any town or village along the way as long as you ask the bus driver in advance.\n\nGet around [ edit ]\n\nBy car [ edit ]\n\nThere is a substantial network of paved roads in the state.\n\nBy bus [ edit ]\n\nThere are many intrastate bus routes. In addition, if you stand by the side of the main coastal highway in a village, you may be able to hail intercity buses if you want to go to Kuala Terengganu or other major cities in the state.\n\nSee [ edit ]\n\nKenyir Lake\n\nMany tourists come to Terengganu to go to islands like the Perhentians to swim and scuba dive, but the coast itself is beautiful and pleasant and dotted with peaceful villages, and Kenyir Lake, a reservoir in Ulu (upriver) Terengganu, provides breathtaking panoramas.\n\nDo [ edit ]\n\nBuy [ edit ]\n\nTerengganu is known for local fabrics like kain songket and kain batik. The Pasir Payang Market (Pasar Besar Kedai Payang) in Kuala Terengganu is the best place to pick up some.\n\nEat [ edit ]\n\nA plate of keropok lekor with dipping sauce\n\nTerengganu's most famous culinary product is keropok lekor, a thick, chewy, hot dog-like sausage entirely unlike the thin crackers called keropok elsewhere in Malaysia. Keropok lekor is made from fish paste and sago palm flour, served cut into finger-size lengths and deep fried, and should always be accompanied by a reddish-brown dipping sauce of tamarind, chili, sugar and vinegar. Sold at roadside stalls in and around the state (Kelantan claims it too), with a particularly impressive assemblage of lekor vendors at the Kelantan-Terengganu border on the way in from Kota Bharu.\n\nAnother traditional thing to eat in Terengganu is ulam, a salad of wild or cultivated leaves that is usually eaten with fiery sambal belacan (shrimp paste with hot pepper). When combined with rice, it is called nasi ulam in Terengganu (in Kelantan, it is called nasi kerabu, and probably more commonly eaten with budu [fish sauce] or tempoyak [fermented durian] than sambal belacan).\n\nMuch good inexpensive food is to be found in coffee houses (kedai kopi) along roadsides in villages, and of course in cities. And do not miss the chance to buy some of Terengganu's delicious fresh fruits in any of the pasar (bazaars) in the cities and larger towns.\n\nNobody seems to be quite sure if it's legal or not, but turtle eggs are widely sold in Terengganu. However, they're a threatened species, and besides, the eggs are slimy and quite salty, so think twice before you indulge.\n\nDrink [ edit ]\n\nAlcohol is generally looked down upon throughout Malay-dominated Terengganu and is served only in Chinese (non-Halal) restaurants. It is possible to buy Malaysian and imported beer by the can at large grocery stores.\n\nNon-alcoholic drinks are widely available, including fresh juices, coconut water (air kelapa), corn drink (air jagung) and the array of packaged drinks sold elsewhere in Malaysia. The widest variety of branded products is available in Kuala Terengganu, but there are drink stalls on the side of any major road.\n\nStay safe [ edit ]\n\nTerengganu is probably one of the safest states of Malaysia in terms of crime, but be careful where you swim. You should assume that all beaches on the coast of Terengganu without lifeguards that are not protected by capes or obviously promoted as places to swim are very dangerous. There is a powerful current that comes down from Thailand, creating a tremendous downward pull very close to the coast that could kill you if you choose to swim on these beaches. The effect of the current is even more powerful during and close to the monsoon season, which may start as early as October and continue until March, with non-stop torrential rains likeliest from late November or early December through late January or early February. However, outside of the monsoon season, there is no reason for you to have any second thoughts about swimming, snorkelling or scuba diving in parts of Terengganu that are popular with swimmers, snorkellers or divers and promoted as such.\n\nRespect [ edit ]\n\nTerengganu is a conservative, Islamic state. You will have a better experience if you respect local mores when you are outside of resort areas where people are used to foreigners dressed in bikinis. It is not necessary or expected for non-Muslim women to wear a headscarf (though it would certainly meet with approval), but both men and women should wear clothing that covers all or at least most of their legs (no short shorts), and women should wear blouses or dresses which cover their torso. Long sleeves are preferable for women, and outfits which show the shoulders or midriff should be avoided: the key is modesty. Tourists dressed in shorts and skimpy tops are really out of place.\n\nGo next [ edit ]\n\nCulturally, Terengganu has a lot in common with its northern neighbour, Kelantan, but the cultural and historical differences between the two states make Kelantan interesting and well worth including in your trip to Terengganu. A bus ride from Kuala Terengganu to Kota Bharu lasts only about three hours.\n\nTo the south and southwest is Pahang, the largest state in Peninsular Malaysia, with more coastline, the larger city of Kuantan, and also the Genting and Cameron Highlands in the western part of the state.\n\nThis region travel guide to Terengganu is an outline and may need more content. It has a template, but there is not enough information present. If there are Cities and Other destinations listed, they may not all be at usable status or there may not be a valid regional structure and a \"Get in\" section describing all of the typical ways to get here. Please plunge forward and help it grow!\n\n\n\n"}]}