{"Reezal Merican Naina Merican was also a member of the Malaysian Bar Council from 2013 to 2014.": [{"url": "https://twentytwo13.my/news/reezal-merican-honoured-to-serve-as-matrade-chairman/", "page_content": "Datuk Seri Reezal Merican Naina Merican has been appointed chairman of the Malaysia External Trade Development Corporation (Matrade).\n\nThe announcement on his appointment was posted in Matrade’s Facebook page this morning.\n\nThe former Housing and Local Government minister said it was an honour to be given the opportunity.\n\n“With this role, and under the leadership of the Investment, Trade and Industry minister (Tengku Datuk Seri Zafrul Abdul Aziz), we can propel Malaysia’s trade and export performances further, and achieve stronger growth,” Reezal told Twentytwo13.\n\nChinese Chamber of Commerce and Industry of Kuala Lumpur and Selangor (KLSCCCI) president, Datuk Ng Yih Pyng, congratulated Reezal on his appointment.\n\n“His vast government and previous ministerial experience will undoubtedly be useful in his new role as Matrade chairman,” said Ng.\n\n“We look forward to working closely with him, especially to ensure Malaysia’s SMEs (small, and medium-sized enterprises) have a greater presence in the international market. This is especially important as we move from the pandemic.”\n\nAs a signatory of several free trade agreements, including the Regional Comprehensive Economic Partnership (RCEP), and the Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP), Ng said there are also a lot of markets for Malaysia to tap into.\n\n“With the prime minister just returning from Beijing, we hope there are more things that we can export to China. We are not just looking at bringing investments from China into Malaysia, but also explore how Malaysian businesses can tap into China’s market,” he added.\n\nAs an agency under MITI, Matrade’s objectives, among others, are to introduce Malaysian companies to foreign importers seeking Malaysian suppliers, and to undertake activities to promote the export of Malaysian goods and services in overseas markets.\n\nReezal, 50, was the former MP for Kepala Batas. He failed to defend his seat in the 15th general election. In March, he was appointed to the Umno Supreme Council.\n\nBefore joining politics, Reezal was with the Malaysian Industrial Bank Berhad, where he managed accounts related to the manufacturing industry, and later served at KFH Ijarah House, a subsidiary of the Kuwait Investment House.\n\nHis political career and experience in government administration began at the age of 27, when he was appointed political secretary to the Women, Family and Community Development minister in 2000.\n\nHe subsequently served as political secretary to former prime minister Tun Abdullah Ahmad Badawi, who was then the prime minister and finance minister, between 2003-2009.\n\nIn 2013, he was appointed Amanah Raya Berhad chairman. He later served as deputy foreign minister between 2015 and 2018.\n\nDuring his tenure as deputy foreign minister, Malaysia assumed the chairmanship of Asean in 2015 and led the formal realisation of the regional economic integration of the 10 Asean member states. This facilitated the free flow of trade and investments in the region with a population of over 600 million people, and with a combined GDP of over US$3 billion.\n\nHe was appointed Youth and Sports minister in 2020, and Housing and Local Government minister in 2021."}, {"url": "https://politikus.sinarproject.org/persons/reezal-merican-naina-merican", "page_content": "Dato' Sri Reezal Merican bin Naina Merican is a Malaysian politician, and currently serving as Minister of Youth and Sports since 10 March 2020\n\nAlina Cheong is the Private Secretary I to Reezal Merican, Youth and Sports Minister\n\nSpecial Officer to Minister of Youth and Sports, Reezal Merican\n\nSpecial Function Officer to Minister of Youth and Sports, Reezal Merican\n\nSpecial Function Officer to Minister of Youth and Sports, Reezal Merican\n\nSpecial Function Officer to Minister of Youth and Sports, Reezal Merican\n\nPolitical Secretary to Minister of Youth and Sports, Reezal Merican\n\nPress Secretary to Minister of Youths and Sports, Reezal Merican\n\nPrincipal Private Secretary to Minister of Youth and Sports, Reezal Merican\n\nHisham Ahmad Sabri is the Private Secretary II to Reezal Merican, Youth and Sports Minister\n\nProcurement Infrastructure Projects\n\nCited on Issues\n\nSubject has been cited for issues for the following known sources.\n\nThese are sources, and not weighted on strength to make a case for this subject. Please refer to editorial or enforcement guidelines."}, {"url": "https://wiki.alquds.edu/?query=Reezal_Merican_Naina_Merican", "page_content": "Malaysian politician\n\nNaina Merican is a Reezal Merican. The Arabic-derived word \"bin\" or \"binti\"/\"binte\", if used, means 'son of' or 'daughter of', respectively. In this Malay name , there is no family name . The nameis a patronymic , and the person should be referred to by the given name . The Arabic-derived word \"bin\" or \"binti\"/\"binte\", if used, means 'son of' or 'daughter of', respectively.\n\nReezal Merican bin Naina Merican (Jawi: ريزال ماريکان بن ناينا ماريکان‎;[1] born 29 July 1972) is a Malaysian politician and banker who has served as the 9th Chairman of the Malaysia External Trade Development Corporation (MATRADE) since May 2023.[2] He served as the Minister of Housing and Local Government in the Barisan Nasional (BN) administration under former Prime Minister Ismail Sabri Yaakob from August 2021 to the collapse of the BN administration in November 2022, the Minister of Youth and Sports in the Perikatan Nasional (PN) administration under former Prime Minister Muhyiddin Yassin from March 2020 to the collapse of the PN administration in August 2021 and the Member of Parliament (MP) for Kepala Batas from May 2013 after the retirement of 5th and former Prime Minister Abdullah Ahmad Badawi as the MP from politics to his electoral defeat in November 2022. He is also a member and Division Chief of Kepala Batas of the Supreme Council of the United Malays National Organisation (UMNO), a component party of the BN coalition. He has also served as Chief of the Elections Department of UMNO since March 2023. He is an ethnic Malay of mixed Indian descent.\n\nBefore entering Parliament, Reezal worked in the bank sector.[3] Reezal took over Abdullah as the party's Division Head of Kepala Batas and as the Barisan Nasional (BN) candidate for the parliamentary seat.[4] Reezal won the seat in the 2013 Malaysian general election while defeated a candidate from the Malaysian Islamic Party (PAS) by 4,176 majority of the votes.[5] In October 2013, he was elected to Supreme Council of UMNO, the highest-ranking body of the party.[6] In a Cabinet reshuffle on 28 July 2015, Reezal was handpicked as Deputy Minister of Foreign Affairs by former Prime Minister Najib Razak. Despite winning the majority to defend his seat in his parliamentary constituency, Reezal lost his Cabinet post following the results of the 2018 Malaysian general election.\n\nControversy [ edit ]\n\nOn 29 August 2015, Reezal intimidated Malaysians participating in the Bersih 4 demonstrations abroad that the Foreign Ministry would gather their information for eventual legal action against them, without even citing which law the citizen abroad violated.[7]\n\nFamily [ edit ]\n\nAfter first wife Ismalina Ismail and second wife Sharifah Norhaslinda which once filed for divorce with Reezal but retracted.[8]\n\nElection results [ edit ]\n\nHonours [ edit ]\n\nSee also [ edit ]\n\nReferences [ edit ]\n\n\n\n"}, {"url": "https://id.wikipedia.org/wiki/Reezal_Merican_Naina_Merican", "page_content": "bin (b.) atau binti (bt.), jika digunakan, berarti \"putra dari\" atau \"putri dari\". Ini adalah nama Melayu; nama \"Naina Merican\" merupakan patronimik , bukan nama keluarga , dan tokoh ini dipanggil menggunakan nama depannya , \"Reezal Merican\". Kata) atau), jika digunakan, berarti \"putra dari\" atau \"putri dari\".\n\nDato' Sri Reezal Merican bin Naina Merican (Jawi: ريزال ماريکان بن ناينا ماريکان; lahir 29 Juli 1972) adalah seorang politikus asal Malaysia yang pernah menjabat sebagai Menteri Perumahan Rakyat dan Pemerintahan Daerah dari 2021 sampai 2022 dan mantan anggota parlemen untuk daerah pemilihan Kepala Batas sejak Mei 2013 hingga kekalahannya pada Pemilu Legislatif 2022.\n\nSebelum menjadi anggota Parlemen, Reezal bekerja di sektor perbankan.[1] Reezal mengambil alih posisi Abdullah Ahmad Badawi sebagai Ketua UMNO Kepala Batas dan sebagai calon Barisan Nasional (BN) untuk kursi parlemen Kepala Batas.[2] Reezal memenangkan kursi Kepala Batas pada Pemilu Legislatif 2013 setelah berhasil mengalahkan calon dari Partai Islam Se-Malaysia (PAS) dengan selisih suara 4,176 suara.[3] Pada Oktober 2013, ia terpilih menjadi anggota Dewan Tertinggi UMNO.[4] Pada perombakan kabinet pada 29 Juli 2015, ia ditunjuk menjadi Wakil Menteri Luar Negeri oleh mantan Perdana Menteri Najib Razak. Pada Pemilu Legislatif 2018, ia terpilih kembali sebagai anggota parlemen dan kembali menganggotai kabinet di bawah pemerintahan Muhyiddin Yassin dan Ismail Sabri Yaakob.\n\nPada 29 Agustus 2015, Reezal mengisyaratkan warga Malaysia yang berpartisipasi dalam demonstrasi Bersih 4 di luar negeri bahwa Kementerian Luar Negeri akan mengumpulkan informasi mereka untuk tindakan hukum terhadap mereka, bahkan tanpa menyebutkan undang-undang mana yang dilanggar oleh warga negara di luar negeri.[5]\n\nReezal dikabarkan akan menikah dengan istri ketiga, mantan aktris tahun sembilan puluhan Mas Anizan.[6] Setelah istri pertama Ismalina Ismail dan istri kedua Sharifah Norhaslinda yang pernah mengajukan gugatan cerai dengan Reezal namun ditarik kembali.[7]"}, {"url": "https://www.owlapps.net/owlapps_apps/articles?id=44639090&lang=en", "page_content": "Reezal Merican bin Naina Merican (Jawi: ريزال ماريکان بن ناينا ماريکان‎; born 29 July 1972) is a Malaysian politician and banker who has served as the 9th Chairman of the Malaysia External Trade Development Corporation (MATRADE) since May 2023. He served as the Minister of Housing and Local Government in the Barisan Nasional (BN) administration under former Prime Minister Ismail Sabri Yaakob from August 2021 to the collapse of the BN administration in November 2022, the Minister of Youth and Sports in the Perikatan Nasional (PN) administration under former Prime Minister Muhyiddin Yassin from March 2020 to the collapse of the PN administration in August 2021 and the Member of Parliament (MP) for Kepala Batas from May 2013 after the retirement of 5th and former Prime Minister Abdullah Ahmad Badawi as the MP from politics to his electoral defeat in November 2022. He is also a member and Division Chief of Kepala Batas of the Supreme Council of the United Malays National Organisation (UMNO), a component party of the BN coalition. He has also served as Chief of the Elections Department of UMNO since March 2023. He is an ethnic Malay of mixed Indian descent.\n\nBefore entering Parliament, Reezal worked in the bank sector. Reezal took over Abdullah as the party's Division Head of Kepala Batas and as the Barisan Nasional (BN) candidate for the parliamentary seat. Reezal won the seat in the 2013 Malaysian general election while defeated a candidate from the Malaysian Islamic Party (PAS) by 4,176 majority of the votes. In October 2013, he was elected to Supreme Council of UMNO, the highest-ranking body of the party. In a Cabinet reshuffle on 28 July 2015, Reezal was handpicked as Deputy Minister of Foreign Affairs by former Prime Minister Najib Razak. Despite winning the majority to defend his seat in his parliamentary constituency, Reezal lost his Cabinet post following the results of the 2018 Malaysian general election.\n\nControversy\n\nOn 29 August 2015, Reezal intimidated Malaysians participating in the Bersih 4 demonstrations abroad that the Foreign Ministry would gather their information for eventual legal action against them, without even citing which law the citizen abroad violated.\n\nFamily\n\nAfter first wife Ismalina Ismail and second wife Sharifah Norhaslinda which once filed for divorce with Reezal but retracted.\n\nElection results\n\nHonours\n\nPahang : Knight Companion of the Order of the Crown of Pahang (DIMP) – Dato' (2006) Grand Knight of the Order of Sultan Ahmad Shah of Pahang (SSAP) – Dato' Sri (2008)\n\nPahang :\n\nSee also\n\nKepala Batas (federal constituency)"}, {"url": "https://www.malaymail.com/news/malaysia/2023/05/02/former-minister-reezal-merican-is-new-matrade-chairman/67279", "page_content": "KUALA LUMPUR, May 2 — Former minister Datuk Seri Reezal Merican Naina Merican has been appointed as the ninth chairman of the Malaysia External Trade Development Corporation (Matrade) effective immediately.\n\nReezal Merican has an extensive track record in government service, having served as the Minister of Housing and Local Government (2021-2022), Minister of Youth and Sports (2020-2021), and Deputy Foreign Minister (2015-2018). Additionally, he chaired Amanah Raya Bhd from 2013 to 2015.\n\n“I am honoured to be given the opportunity to serve as the chairman of Matrade. With this role, combined with Minister of Miti’s (Ministry of Investment, Trade and Industry) leadership, we can better propel Malaysia’s trade and export performance to remain excellent and achieve stronger growth,” he said in a statement today.\n\nGiven his extensive experience in international affairs, diplomacy, government administration, and industry relations, he is well-positioned to lead and guide Malaysia’s national trade promotion agenda and facilitate export-oriented investments into the country, Matrade said.\n\nThe agency said his appointment as chairman will contribute to the growth and diversification of Malaysia’s exports in new and existing global markets.\n\nMatrade is an agency under Miti and is mandated to execute trade promotion initiatives for the country. Established in 1993 after the enactment of the Matrade Act 1992, Matrade executes two core activities: exporters development and export promotion.\n\nCurrently, it has six regional offices in Malaysia and 46 global offices ever-ready to assist Malaysian companies through exporters capacity building programmes, trade advisory and financial facilitation, business matching, market intelligence and market access, project negotiations and e-commerce. — Bernama"}, {"url": "https://www.edgeprop.my/content/1899015/reezal-merican-new-housing-and-local-government-minister", "page_content": "Reezal Merican the new housing and local government minister\n\nKUALA LUMPUR (Aug 27): Datuk Seri Reezal Merican Naina Merican has been appointed as the new housing and local government minister under the new administration of newly-appointed Prime Minister Datuk Seri Ismail Sabri Yaakob.\n\nHe succeeds Datuk Zuraida Kamaruddin who has been the Member of Parliament (MP) of Ampang since 2008.\n\nReezal, who has been the MP for Kepala Batas since May 2013, previously served as the Minister of Youth and Sports in the Perikatan Nasional (PN) administration under former Prime Minister Muhyiddin Yassin from March 2020 to Aug 2021.\n\nHaving worked in the banking sector previously, Reezal took over the party's Division Head of Kepala Batas and became the Barisan Nasional (BN) candidate for the parliamentary seat from the fifth and former Prime Minister Tun Abdullah Ahmad Badawi.\n\nSubsequently, in October 2013, he was elected to the Supreme Council of UMNO, the highest-ranking body of the party.\n\nBack in July 2015 in a Cabinet reshuffle, Reezal was handpicked as Deputy Minister of Foreign Affairs by former Prime Minister Datuk Seri Najib Razak.\n\nGet the latest news @ www.EdgeProp.my\n\nSubscribe to our Telegram channel for the latest stories and updates\n\nClick here for more property stories"}, {"url": "https://www.digitalnewsasia.com/business/reezal-merican-appointed-new-matrade-chairman", "page_content": "The appointment is effective immediately\n\nHe previously held leadership positions at three ministries\n\nFormer minister Reezal Merican Naina Merican (pix) has been appointed as the ninth Chairman of the Malaysia External Trade Development Corporation (MATRADE) effective immediately.\n\nReezal Merican once served as the Minister of Housing & Local Government (2021-2022), Minister of Youth and Sports (2020-2021), and Deputy Foreign Minister (2015-2018). Additionally, he chaired Amanah Raya Bhd from 2013 to 2015.\n\nIn a statement, Matrade expressed confidence that his appointment will contribute to the growth and diversification of Malaysia's exports in new and existing global markets.\n\nReezal said, “I am honoured to be given the opportunity to serve as the Chairman of Matrade , with this role, combined with YB Minister of MITI’s leadership, we can better propel Malaysia's trade and export performance to remain excellent and achieve stronger growth.”\n\nMatrade is an agency under MITI and is mandated to execute trade promotion initiatives for the country. Established in 1993 after the enactment of the Matrade Act 1992, it executes two core activities of Exporters Development and Export Promotion.\n\nCurrently, it has six regional offices around Malaysia and 46 global offices ever-ready to assist Malaysian companies through exporters capacity building programmes, trade advisory and financial facilitation, business matching, market intelligence and market access, project negotiations and e-commerce."}, {"url": "https://www.theborneopost.com/2023/05/02/former-minister-reezal-merican-is-new-matrade-chairman/", "page_content": "KUALA LUMPUR (May 2): Former minister Datuk Seri Reezal Merican Naina Merican has been appointed as the ninth chairman of the Malaysia External Trade Development Corporation (Matrade) effective immediately.\n\nReezal Merican has an extensive track record in government service, having served as the Minister of Housing and Local Government (2021-2022), Minister of Youth and Sports (2020-2021), and Deputy Foreign Minister (2015-2018). Additionally, he chaired Amanah Raya Bhd from 2013 to 2015.\n\n“I am honoured to be given the opportunity to serve as the chairman of Matrade. With this role, combined with Minister of Miti’s (Ministry of Investment, Trade and Industry) leadership, we can better propel Malaysia’s trade and export performance to remain excellent and achieve stronger growth,” he said in a statement today.\n\nGiven his extensive experience in international affairs, diplomacy, government administration, and industry relations, he is well-positioned to lead and guide Malaysia’s national trade promotion agenda and facilitate export-oriented investments into the country, Matrade said.\n\nThe agency said his appointment as chairman will contribute to the growth and diversification of Malaysia’s exports in new and existing global markets.\n\nMatrade is an agency under Miti and is mandated to execute trade promotion initiatives for the country. Established in 1993 after the enactment of the Matrade Act 1992, Matrade executes two core activities: exporters development and export promotion.\n\nCurrently, it has six regional offices in Malaysia and 46 global offices ever-ready to assist Malaysian companies through exporters capacity building programmes, trade advisory and financial facilitation, business matching, market intelligence and market access, project negotiations and e-commerce. — Bernama"}, {"url": "https://en.unionpedia.org/Reezal_Merican_Naina_Merican", "page_content": "Reezal Merican Naina Merican Datuk Seri Reezal Merican bin Naina Merican is a Malaysian politician. [1]\n\n26 relations: Abdullah Ahmad Badawi, Barisan Nasional, Dewan Rakyat, Election Commission of Malaysia, Hamzah Zainudin, Indian people, Kepala Batas (federal constituency), Kepala Batas, Penang, Malay language, Malay race, Malay styles and titles, Malaysiakini, Malaysian general election, 2004, Malaysian general election, 2013, Malaysian general election, 2018, Malaysian Islamic Party, Malaysians, Member of parliament, Ministry of Foreign Affairs (Malaysia), National Trust Party (Malaysia), Pakatan Harapan, Parliament of Malaysia, Penang, The Star (Malaysia), United Malays National Organisation, Utusan Malaysia.\n\nTun Dato' Seri Haji Abdullah bin Haji Ahmad Badawi (Jawi: عبد الله بن حاج احمد بداوي; born 26 November 1939) is a Malaysian politician who served as Prime Minister of Malaysia from 2003 to 2009.\n\nNew!!: Reezal Merican Naina Merican and Abdullah Ahmad Badawi · See more »\n\nThe National Front (Barisan Nasional; abbrev: BN) is a political coalition in Malaysia that was founded in 1973 as a coalition of right-wing and centre parties.\n\nNew!!: Reezal Merican Naina Merican and Barisan Nasional · See more »\n\nThe Dewan Rakyat (Malay for House of Representatives, literally People's Hall) is the lower house of the Parliament of Malaysia, consisting of members elected during elections from federal constituencies drawn by the Election Commission.\n\nNew!!: Reezal Merican Naina Merican and Dewan Rakyat · See more »\n\nThe Election Commission of Malaysia (Suruhanjaya Pilihan Raya Malaysia), abbreviated SPR or EC, is a commission set up for the purpose of ensuring fair and equitable operations in undertaking the Malaysian General Elections.\n\nNew!!: Reezal Merican Naina Merican and Election Commission of Malaysia · See more »\n\nDato' Seri Hamzah bin Zainudin (born 12 March 1957) is a Malaysian politician and is the Member of the Parliament of Malaysia for the Larut constituency in Perak.\n\nNew!!: Reezal Merican Naina Merican and Hamzah Zainudin · See more »\n\nNo description.\n\nNew!!: Reezal Merican Naina Merican and Indian people · See more »\n\nKepala Batas is a federal constituency in Penang, Malaysia, that has been represented in the Dewan Rakyat since 1974.\n\nNew!!: Reezal Merican Naina Merican and Kepala Batas (federal constituency) · See more »\n\nKepala Batas is a town in North Seberang Perai, Penang, Malaysia.\n\nNew!!: Reezal Merican Naina Merican and Kepala Batas, Penang · See more »\n\nMalay (Bahasa Melayu بهاس ملايو) is a major language of the Austronesian family spoken in Brunei, Indonesia, Malaysia and Singapore.\n\nNew!!: Reezal Merican Naina Merican and Malay language · See more »\n\nThe concept of a Malay race was originally proposed by the German physician Johann Friedrich Blumenbach (1752–1840), and classified as a brown race.\n\nNew!!: Reezal Merican Naina Merican and Malay race · See more »\n\nThe Malay language has a complex system of styles, titles and honorifics, which are used extensively in Brunei and Malaysia.\n\nNew!!: Reezal Merican Naina Merican and Malay styles and titles · See more »\n\nMalaysiakini (Meaning in English: \"Malaysia Today\") is an online news portal published in English, Malay, Chinese and Tamil.\n\nNew!!: Reezal Merican Naina Merican and Malaysiakini · See more »\n\nA general election was held on Sunday, 21 March 2004 for members of the 11th Parliament of Malaysia.\n\nNew!!: Reezal Merican Naina Merican and Malaysian general election, 2004 · See more »\n\nGeneral elections were held in Malaysia on Sunday, 5 May 2013 for members of the 13th Parliament.\n\nNew!!: Reezal Merican Naina Merican and Malaysian general election, 2013 · See more »\n\nThe 2018 Malaysian general election (formally the 14th Malaysian general election) was held on 9 May 2018 to elect members to the Dewan Rakyat of the 14th Parliament of Malaysia.\n\nNew!!: Reezal Merican Naina Merican and Malaysian general election, 2018 · See more »\n\nThe Malaysian Islamic Party (PAS; Parti Islam Se-Malaysia; formerly known as Malayan Islamic Party) is an Islamist political party in Malaysia.\n\nNew!!: Reezal Merican Naina Merican and Malaysian Islamic Party · See more »\n\nMalaysians are the people who are identified with the country of Malaysia.\n\nNew!!: Reezal Merican Naina Merican and Malaysians · See more »\n\nA member of parliament (MP) is the representative of the voters to a parliament.\n\nNew!!: Reezal Merican Naina Merican and Member of parliament · See more »\n\nThe Ministry of Foreign Affairs (Kementerian Luar Negeri), abbreviated KLN, is a ministry of the Government of Malaysia that is responsible for foreign affairs, Malaysian diaspora, foreigners in Malaysia, diplomacy, foreign relations, counter terrorism, bilateral affairs, multilateral affairs, ASEAN, international protocol, consular services, maritime affairs, chemical weapons.\n\nNew!!: Reezal Merican Naina Merican and Ministry of Foreign Affairs (Malaysia) · See more »\n\nThe National Trust Party (Amanah; Parti Amanah Negara) is a registered political party in Malaysia advocating political Islam.\n\nNew!!: Reezal Merican Naina Merican and National Trust Party (Malaysia) · See more »\n\nThe Alliance of Hope (Pakatan Harapan; abbrev: PH) is a political coalition in Malaysia.\n\nNew!!: Reezal Merican Naina Merican and Pakatan Harapan · See more »\n\nThe Parliament of Malaysia (Parlimen Malaysia) is the national legislature of Malaysia, based on the Westminster system.\n\nNew!!: Reezal Merican Naina Merican and Parliament of Malaysia · See more »\n\nPenang is a Malaysian state located on the northwest coast of Peninsular Malaysia, by the Malacca Strait.\n\nNew!!: Reezal Merican Naina Merican and Penang · See more »\n\nThe Star is an English-language, tabloid-format newspaper in Malaysia.\n\nNew!!: Reezal Merican Naina Merican and The Star (Malaysia) · See more »\n\nThe United Malays National Organisation (Malay: Pertubuhan Kebangsaan Melayu Bersatu; Jawi: ڤرتوبوهن کبڠساءن ملايو برساتو, abbreviated UMNO or lesser known as PEKEMBAR) is Malaysia's main opposition political party.\n\nNew!!: Reezal Merican Naina Merican and United Malays National Organisation · See more »\n\nUtusan Malaysia (literally The Malaysian Courier) is a Malay-language newspaper published in Malaysia.\n\nNew!!: Reezal Merican Naina Merican and Utusan Malaysia · See more »\n\nReferences\n\n[1] https://en.wikipedia.org/wiki/Reezal_Merican_Naina_Merican"}]}