{"Reezal Merican Naina Merican is a member of the UMNO Supreme Council.": [{"url": "https://www.thestar.com.my/news/nation/2023/02/25/umno-polls-ex-minister-reezal-merican-to-contest-vp-post", "page_content": "KUALA LUMPUR: Former minister and former Kepala Batas MP Datuk Seri Reezal Merican Naina Merican (pic) has thrown his hat into the ring to contest one of the three Umno vice-presidents’ posts.\n\nThe long-time Umno supreme council member filed his papers on Saturday (Feb 25) at the party headquarters at the World Trade Centre, in what is seen as the most crowded party polls.\n\nReezal, who called himself a protege of former prime minister Tun Abdullah Ahmad Badawi, said that if he is elected, it will be to return the voice of moderation to the party.\n\nOther contenders for the VP's posts are incumbents Datuk Seri Mahdzir Khalid and Datuk Seri Mohamed Khaled Nordin.\n\nAlso reported to have filed their papers were Datuk Seri Dr Zambry Abd Kadir, Datuk Seri Johari Abdul Ghani and Datuk Seri Hasni Mohammad.\n\nSpeaking to the media after filing the papers, Reezal said that although running for the VP’s post is seen as a progression of his political career, he decided to do so as the party is in need of “better housekeepers”.\n\n“Let’s keep to the path of moderation.\n\n“I am not going to be overly-confident of winning but I am confident Umno needs people like me who can regain the support from the people. I am someone who believes in not airing our dirty laundry in public.\n\n“Despite me being part of the Umno supreme council, no one can point at me and say that I have ever exposed Umno’s flaws to the public.\n\n“I believe in respecting the party and keeping its honour. If the party is in pain, we as housekeepers must provide the cushioning measures.\n\n“We may have our differences within the party, but we live in the same house. Even when we lost (the Federal Government in 2018), Umno managed to stay intact,” said Reezal.\n\nReezal also called on those who are “excessive” in their campaigning to tone it down as their actions might not only take down individuals, but also give a bad name to the party.\n\n“The party is obviously still very much alive, judging from the crowd that is willing to contest all the posts in Umno both at the grassroots and national level.\n\n“I offer myself as a 24-hour housekeeper of the party and I want those who vote for me to look at my record.\n\n“I have been with the party since I was in my 20s and have stuck with the party through thick and thin for more than two decades, rising through the ranks. This shows that I have climbed the political steps and I offer my services. My record is for all to see.\n\nThe nomination period closes on Feb 26.\n\nUmno is in the midst of its internal elections for the 191 divisions and 22,000 branches, including the divisions that were suspended.\n\nThe party’s new office bearers will be elected from Feb 1 to March 18, but the top two positions of president and deputy president will not be contested this time around.\n\nIn May last year, Umno amended its constitution to allow party polls to be held within six months after the conclusion of the 15th General Election.\n\nUmno had postponed its party elections for 18 months after the 2018/2021 term ended on June 30, 2021, which meant party polls for the 2021/2023 term should have been held before Dec 30 last year. However, the polls were postponed."}, {"url": "https://www.thestar.com.my/news/nation/2023/03/19/umno-polls-tengku-zafrul-isham-jalil-among-25-elected-to-supreme-council", "page_content": "KUALA LUMPUR: Tengku Datuk Seri Zafrul Tengku Abdul Aziz has made his debut to the Umno supreme council.\n\nThe International Trade and Industry Minister secured 167 votes.\n\nTengku Zafrul also won the Kota Raja division chief uncontested.\n\nAnother first time supreme council member is Isham Jalil, the Umno information chief.\n\nAmong those \"missing\" from the list are Datuk Seri Azalina Othman Said, Datuk Seri Reezal Merican Naina Merican and Datuk Seri Hasni Mohammad.\n\nThey all took a chance for the vice-presidency but lost.\n\nThe fight for the 25-seat supreme council saw a crowded race of 95 contestants.\n\nDatuk Seri Shamsul Anuar Nasarah won the election for the supreme council position with the most votes at 178, followed by Datuk Seri Dr Zambry Abd Kadir who secured 175 votes and Datuk Seri Ahmad Maslan (167).\n\nAmong the returning incumbents are Datuk Seri Abdul Rahman Dahlan, Datuk Seri Bung Mokhtar Radin, Datuk Seri Abdul Azeez Rahim and Datuk Jazlan Yaakub.\n\nOnly 187 of Umno's 191 divisions held their meetings on Saturday (March 18).\n\nThe Tanah Merah and Kota Kinabalu divisions had been suspended while the Johor Baru and Beluran divisions had their meetings postponed due to certain issues.\n\nAhmad, who won the Pontian Umno division chief post after unseating former Johor mentri besar Hasni, posted a congratulatory message to the winners of the party polls on Twitter Sunday (March 19).\n\nAhmad, who is Deputy Finance Minister and Umno secretary-general, won the division chief post by a 95-vote majority against Hasni."}, {"url": "https://www.sinardaily.my/article/190933/malaysia/national/reezal-enters-race-for-vp-post", "page_content": "SHAH ALAM - Umno Supreme Council member Datuk Seri Reezal Merican Naina Merican is set to contest for one of the party's vice presidents posts for the 2023-2026 term.\n\nThe former Kepala Batas member of parliament said the decision was taken to uphold three main visions, namely service, priority and loyalty to the party.\n\n\"I came forward with a clear mission to offer 3K-Service, Capability and Loyalty (Khidmat, Keupayaan dan Kesetiaan),\" he said in a tweet today.\n\nThe vice presidents posts came into focus after the posts of president and deputy were not contested.\n\nReezal will be competing with Higher Education Minister Datuk Seri Mohamed Khaled Nordin, Foreign Minister Datuk Seri Dr Zambry Abd Kadir and Minister in the Prime Minister's Department (Legal and Institutional Reform) Datuk Seri Azalina Othman Said.\n\nFormer Johor Menteri Besar who is also Simpang Renggam member of parliament Datuk Seri Hasni Mohamad, Pahang Menteri Besar Datuk Seri Wan Rosdy Wan Ismail, Federal Territories Umno Liaison Board chairman Datuk Seri Johari Abdul Ghani and Datuk Seri Mahdzir Khalid."}, {"url": "https://www.thestar.com.my/news/nation/2023/03/20/umno-voters-decide-against-woman-vp-but-three-in-supreme-council", "page_content": "KUALA LUMPUR: Umno members have chosen not to vote in a woman as a vice-president in party polls that saw Pahang Mentri Besar Datuk Seri Wan Rosdy Wan Ismail sailing to the top in the race for the three coveted spots.\n\nMinister in the Prime Minister’s Department Datuk Seri Azalina Othman Said, the sole woman candidate in the eight-cornered fight for the Umno vice-president race, got 72 votes, putting her in fourth place – not enough to break into the traditionally male-dominated position.\n\nThe unassuming and friendly Wan Rosdy, 64, was a clear favourite, taking the lead right from the start and securing 127 votes from the 187 divisions that held their meetings on Saturday.\n\nHis win, party sources said, was not a surprise as he was a popular figure among the grassroots.\n\n“He also shares good relations with the division heads, most of whom are his contemporaries,” said one source.\n\nThe second spot for the vice-presidency went to Higher Education Minister Datuk Seri Mohamed Khaled Nordin, who got 116 votes.\n\nHe was the one candidate many had predicted would win because he was an incumbent as well as a minister.\n\nMohamed Khaled said Umno’s election process was meant to strengthen the party and not for individuals to show their power or influence.\n\n“At the end of the day, we must not let the results divide us.\n\n“We must quickly close ranks as there is so much work for us to do as an important political party,” he said.\n\nThe third vice-president seat went to Titiwangsa Umno chief and MP Datuk Seri Johari Ghani who secured 110 votes.\n\nOnly 187 of Umno’s 191 divisions held their meetings.\n\nThe Tanah Merah and Kota Kinabalu divisions have been suspended while those in Johor Baru and Beluran had their meetings postponed due to some issues.\n\nKepala Batas Umno chief Datuk Seri Reezal Merican Naina Merican, who lost in the vice-president race, said the newly-elected vice-presidents would help Umno president Datuk Seri Dr Ahmad Zahid Hamidi steer the party through challenging times.\n\n“It is now time for the leadership to lift Umno to the heights expected by its members,” he said in a Facebook post yesterday.\n\nReezal Merican said his defeat also spelt the end of his 10-year tenure as part of the party’s supreme council.\n\nIn the contest for the 25 elected seats in the supreme council, several incumbents returned, including Datuk Seri Shamsul Anuar Nasarah, who got the highest number of votes at 178, and Datuk Seri Zambry Abd Kadir with 175 votes.\n\nIncumbents Datuk Seri Abdul Rahman Dahlan, Datuk Seri Bung Moktar Radin, Datuk Seri Sharkar Shamsudin and Datuk Seri Md Alwi Che Mat also retained their supreme council positions.\n\nThe polls saw Tengku Datuk Seri Zafrul Tengku Abdul Aziz making his debut on the supreme council, having secured 167 votes.\n\nThe International Trade and Industry Minister is also a newly-minted Kota Raja Umno chief, having won the post uncontested.\n\nThis time around, only three women – former Papar MP Datuk Rosnah Rashid Shirlin, Datuk Seri Shahaniza Shamsuddin and Datuk Zahida Zarik Khan – were voted into the supreme council compared to four previously."}, {"url": "https://www.malaymail.com/news/malaysia/2022/10/10/reezal-merican-umno-to-hold-special-supreme-council-meeting-tonight-to-discuss-preparations-for-ge15/32745", "page_content": "KEPALA BATAS, Oct 10 — A special Umno supreme council meeting is scheduled to be held tonight to discuss preparations for the 15th general election (GE15) should it be held soon.\n\nUmno supreme council member, Datuk Seri Reezal Merican Naina Merican said apart from that, the meeting will also discuss matters raised including questions on floods.\n\n“Our (Umno supreme council meeting) will not discuss the dissolution (of Parliament) as the power rests on two persons namely the Prime Minister to seek the consent of the Yang diPertuan Agong, and it depends on both of them.\n\n“I also have no information on whether it has been presented or not ...so I can not jump the gun. Tonight is more on preparation should the general election be held at any moment as well as matters raised including floods,” he told reporters here today.\n\nReezal Merican who is also Kepala Batas MP said when asked to comment on a media report today which said Umno would be holding a special Umno supreme council meeting due to the impending dissolution of Parliament.\n\nEarlier, Reezal Merican who is Housing and Local Government Minister attended a Kepala Batas Parliamentary Constituency Prophet Mohamad’s birthday celebration at Abdullah Fahim Mosque and presented a contribution of RM10,000 each of 37 mosques and RM2,000 to each of the 76 surau in Kepala Batas. — Bernama"}, {"url": "https://mymp.org.my/p/reezal-merican-bin-naina-merican?locale=en", "page_content": "Attendance 19 / 72 Parliament Sessions\n\nQuestion 13 Questions\n\nBill N/A\n\nMotion N/A\n\nCommittee Membership N/A"}, {"url": "https://www.straitstimes.com/asia/se-asia/umno-purge-what-happened-at-the-supreme-council-meeting-before-the-axe-fell", "page_content": "PETALING JAYA – Despite Umno leaders warning Zahid Hamidi that he was not following due process, the president of Malaysia’s oldest political party went ahead and “axed” several leaders at its supreme council meeting on Friday night, said a source.\n\nThe source said five supreme council members objected to Zahid’s decision and only three agreed with him. Describing Friday’s heated moments, the source said Zahid opened the meeting by announcing the sacking of former health minister Khairy Jamaluddin and the list of those suspended from the party.\n\nFormer Selangor Umno state chief and ex-federal minister Noh Omar immediately stood up and asked that he be sacked instead of being suspended for six years, to which Zahid retorted, “If you want that, so be it”, the source added.\n\n“When opened to the floor, Umno vice-president Ismail Sabri Yaakob stood up and argued that any sacking and suspension must be made in accordance with the laws and due process,” said the source.\n\nFormer prime minister Ismail said that those facing punishment must first be given a show cause letter, the right to defend themselves before the disciplinary board, followed by an appeal to the management before the Umno supreme council makes a decision.\n\n“Ismail said suspending and sacking Umno leaders and members without a show cause letter is unfair as they would not be able to defend themselves and they would also not know the reason they were axed,” said the source, adding that the former PM also warned that voters will judge Umno by its actions and this may cause a backlash against the party during elections.\n\nA few other supreme council members, said the source, also stood up to state their disapproval over Zahid’s action as it was not carried out according to the party Constitution. Former housing minister Reezal Merican Naina Merican also spoke against the sacking of Mr Khairy and pleaded with Zahid to show some mercy.\n\n“However, after they spoke, Zahid insisted that he was sticking to what he announced and refused to budge,” added the source.\n\nOn Friday, Umno sacked former youth chief Khairy and supreme council member Noh Omar.\n\nOthers punished included former minister for defence and foreign affairs, Datuk Seri Hishammuddin Hussein, who was suspended for six years.\n\nFormer Umno information chief Shahril Hamdan, former youth exco member Fathul Bari Mat Jahya, former Tebrau division chief Maulizan Bujang and former Jempol MP Salim Shariff were also suspended for six years."}, {"url": "https://www.sinardaily.my/article/190945/malaysia/politics/reezal-merican-hasni-johari-best-choice-for-umno-vice-presidents---kj", "page_content": "SHAH ALAM - Former Umno youth chief Khairy Jamaluddin Abu Bakar describes former Housing and Local Government Minister Datuk Seri Reezal Merican Naina Merican, former Johor Menteri Besar Datuk Ir Hasni Mohammad and Federal Territories Umno liason committee chairman Datuk Seri Johari Abdul Ghani as the best candidates for the vice-president positions in the party.\n\nThe former Health Minister said this amidst a rush of Umno leaders nominating themselves to contest for important positions in the party including three posts for vice-president.\n\nKhairy who was sacked from Umno early last month together with former Umno Selangor Chairman Tan Sri Noh Omar, invited all his supporters and friends in the party to support the nomination of the three leaders.\n\nKhairy's latest statement seems to give an implicit signal to Umno President Datuk Seri Dr Ahmad Zahid Hamidi that there was no easy path for leaders alligned to him to control important party positions.\n\n\"Reezal, Hasni and Johari Ghani are the best choices for Umno vice-president.\n\n\"I hope my friends can support them (at the Umno election this time),\" said Khairy to Sinar Premium on Saturday when asked what are the characteristics of quality found in the three leaders to be appointed as the new Umno vice-presidents.\n\nKhairy said it was better to choose a vice president candidate who has a clear stance and idealism.\n\nThe Umno vice president position is indeed the main focus of more than 3 million party grassroots following the Umno General Assembly (PAU) 2022 which decided the two main positions of the party, namely the President and the Deputy President to not be contested in the party elections this time.\n\nAs of Saturday, a total of eight Umno leaders including two vice president incumbents have confirmed their candidacy for the three posts.\n\nThe two vice-president incumbents who have confirmed their defence of the positions earlier were Higher Education Minister Datuk Seri Mohamed Khaled Nordin and former Rural Development Minister Datuk Seri Mahdzir Khalid.\n\nThis was followed by Johari who is also a member of the Umno Supreme Council, Reezal Merican, Hasni and Barisan Nasional (BN) secretary-general Datuk Seri Dr Zambry Abdul Kadir.\n\nIn addition, Pahang Menteri Besar Datuk Seri Wan Rosdy Wan Ismail caused a surprise when he volunteered to run for the position, however another vice president incumbent, former Prime Minister Datuk Seri Ismail Sabri Yaakob has yet come to a decision.\n\nMinister in the Prime Minister's Department (Law and Institutional Reform) Datuk Seri Azalina Othman Said will run for the party's third highest position when she confirmed that she had sent nomination form at Umno headquarters in Menara Dato Onn on Saturday.\n\nAzalina's decision sees her becoming the only female candidate who is competing for one of the three vice president's posts.\n\nUmno sources informed Sinar Premium that the selection process this time was quite interesting and intense because of a clash between 'cai' supporters of Zahid and the camp that rejected Umno's cooperation with Pakatan Harapan (PH).\n\n\"Reezal Merican, Johari and Hasni are believed to represent 'team B', while Dr Zambry, Khaled, Wan Rosdy and Azalina were understood to have received Ahmad Zahid's blessing to represent 'team A' to compete for the vice-presidents position this time,\" revealed the Umno source.\n\nOn Friday, Umno election committee chairman Tan Sri Shahrir Abdul Samad explained that the nomination process for the party's election at the central level and all divisions was running smoothly and is expected to improve in terms of nominations by the registration deadline on Feb 26.\n\n\"Until yesterday (Thursday), a total of 11,369 candidates have already registered to compete at the central and also division level throughout the country.\n\n\"Of that number, 270 candidates for positions at the central level include members of the Supreme Council, Women's executive committee, Youth as well as Puteri Umno.\n\n\"On average we can see many new faces,\" he told reporters."}, {"url": "https://www.owlapps.net/owlapps_apps/articles?id=44639090&lang=en", "page_content": "Reezal Merican bin Naina Merican (Jawi: ريزال ماريکان بن ناينا ماريکان‎; born 29 July 1972) is a Malaysian politician and banker who has served as the 9th Chairman of the Malaysia External Trade Development Corporation (MATRADE) since May 2023. He served as the Minister of Housing and Local Government in the Barisan Nasional (BN) administration under former Prime Minister Ismail Sabri Yaakob from August 2021 to the collapse of the BN administration in November 2022, the Minister of Youth and Sports in the Perikatan Nasional (PN) administration under former Prime Minister Muhyiddin Yassin from March 2020 to the collapse of the PN administration in August 2021 and the Member of Parliament (MP) for Kepala Batas from May 2013 after the retirement of 5th and former Prime Minister Abdullah Ahmad Badawi as the MP from politics to his electoral defeat in November 2022. He is also a member and Division Chief of Kepala Batas of the Supreme Council of the United Malays National Organisation (UMNO), a component party of the BN coalition. He has also served as Chief of the Elections Department of UMNO since March 2023. He is an ethnic Malay of mixed Indian descent.\n\nBefore entering Parliament, Reezal worked in the bank sector. Reezal took over Abdullah as the party's Division Head of Kepala Batas and as the Barisan Nasional (BN) candidate for the parliamentary seat. Reezal won the seat in the 2013 Malaysian general election while defeated a candidate from the Malaysian Islamic Party (PAS) by 4,176 majority of the votes. In October 2013, he was elected to Supreme Council of UMNO, the highest-ranking body of the party. In a Cabinet reshuffle on 28 July 2015, Reezal was handpicked as Deputy Minister of Foreign Affairs by former Prime Minister Najib Razak. Despite winning the majority to defend his seat in his parliamentary constituency, Reezal lost his Cabinet post following the results of the 2018 Malaysian general election.\n\nControversy\n\nOn 29 August 2015, Reezal intimidated Malaysians participating in the Bersih 4 demonstrations abroad that the Foreign Ministry would gather their information for eventual legal action against them, without even citing which law the citizen abroad violated.\n\nFamily\n\nAfter first wife Ismalina Ismail and second wife Sharifah Norhaslinda which once filed for divorce with Reezal but retracted.\n\nElection results\n\nHonours\n\nPahang : Knight Companion of the Order of the Crown of Pahang (DIMP) – Dato' (2006) Grand Knight of the Order of Sultan Ahmad Shah of Pahang (SSAP) – Dato' Sri (2008)\n\nPahang :\n\nSee also\n\nKepala Batas (federal constituency)\n\nReferences\n\n\n\n"}]}