{"He was elected to the Dewan Rakyat in the 2018 general election.": [{"url": "http://archive.ipu.org/parline-e/reports/2197.htm", "page_content": "Parliament name (generic / translated) Parlimen / Parliament Structure of parliament Bicameral Chamber name (generic / translated) Dewan Rakyat / House of Representatives Related chamber (for bicameral parliaments) Dewan Negara / Senate BACKGROUND Dates of election / renewal (from/to) 9 May 2018 Timing and scope of renewal The Pakatan Harapan (Alliance of Hope) opposition coalition (see note), led by the former long-serving Prime Minister Mohamad Mahathir, won the majority in the 222-member House of Representatives, thereby ousting Prime Minister Najib Razak's National Front (BN) coalition which had governed the country since Malaysia's independence from Britain in 1957.\n\n\n\nOn 10 May, Mr. Mahathir, 92, was sworn in as Prime Minister, becoming the world\u0092s eldest elected head of government. He stated that King has agreed to grant a full pardon to the opposition leader and former Deputy Prime Minister Ibrahim Anwar (see note 2), On 21 May, Mr. Mahathir formed a new Cabinet. Ms. Wan Azizah Wan Ismail (Mr. Anwar's wife and President of the People's Justice Party, PKR), became the first woman Deputy Prime Minister of Malaysia.\n\n\n\nPrior to the 2018 elections, the BN faced public anger over the cost of living and a corruption scandal involving a state-owned investment fund that emerged in 2015. In January 2018, Mr. Mahathir announced that he would contest the 2018 elections as the Pakatan Harapan's premier candidate, with the stated goal of ousting his former protégé, Prime Minister Najib. During the election campaign, the BN promised more public holidays, no toll charges during Eid and tax exemptions for Malaysians under 26 years old. The Pakatan Harapan promised to abolish the consumption tax (known as GST) and to fight corruption.\n\n\n\nNote 1:\n\nThe Pakatan Harapan (Alliance of Hope) was formed in 2015 by three opposition parties: the People's Justice Party (PKR), the Democratic Action Party (DAP) and Parti Amanah Negara (PAN, a splinter party of the Pan-Malaysian Islamic Party (PAS). The PKR, the DAP and the PAS had formed Pakatan Rakyat (People's Alliance, led by Mr. Anwar) for the 2013 elections but the alliance subsequently collapsed.\n\n\n\nNote 2:\n\nFor five years in the 1990s Mr. Anwar was the country's deputy prime minister, before falling from favour and finding himself at the centre of a series of court cases involving allegations of corruption and sodomy. In 2008 he was again charged with sodomy. After a lengthy court battle, he was cleared in 2012. In 2014 the court battles were resumed. Anwar Ibrahim's previous acquittal was overturned and a five-year jail term handed down. Prior to the 2018 elections, Mr. Mahathir promised to secure a royal pardon for Mr. Anwar and announced that he would hand over the prime ministerial post to Mr. Anwar within two years. Date of previous elections: 5 May 2013\n\n\n\nDate of dissolution of the outgoing legislature: 6 April 2018\n\n\n\nTiming of election:Upon normal expiry\n\n\n\nExpected date of next elections: May 2023\n\n\n\nNumber of seats at stake: 222 (full renewal)\n\n\n\nNumber of candidates: 686 (626 men, 60 women)\n\n\n\nPercentage of women candidates: 8.7%\n\n\n\nNumber of parties contesting the election: 24\n\n\n\nNumber of parties winning seats: 6\n\n\n\nAlternation of power: Yes\n\n\n\nNumber of parties in government: 4\n\n\n\nNames of parties in government: People's Justice Party (PKR), the Democratic Action Party (DAP), Parti Pribumi Bersatu Malaysia (PPBM) and Parti Amanah Negara (PAN)\n\n\n\nDate of the first session of the new parliament: 16 July 2018\n\n\n\nName of the new Speaker: Mr. Mohamad Ariff Md Yusof STATISTICS Voter turnout Round no 1 9 May 2018 Number of registered electors\n\nVoters\n\nBlank or invalid ballot papers\n\nValid votes 14'940'624\n\n\n\n\n\nNotes Distribution of votes Round no 1 Political group Candidates Votes % of votes People's Justice Party (PKR) National Front (BN) Pan-Malaysian Islamic Party (PAS) Democratic Action Party (DAP) Sabah Heritage Party (WARISAN) Independents (BEBES) Homeland Solidarity Party (SOLIDARITI) Distribution of seats Round no 1 Political Group Total of seats People's Justice Party (PKR) 104 National Front (BN) 79 Pan-Malaysian Islamic Party (PAS) 18 Democratic Action Party (DAP) 9 Sabah Heritage Party (WARISAN) 8 Independents (BEBES) 3 Homeland Solidarity Party (SOLIDARITI) 1 Distribution of seats according to sex Men\n\n\n\nWomen\n\n\n\nPercent of women 192\n\n\n\n31\n\n\n\n13.90% Distribution of seats according to age Distribution of seats according to profession Comments Note:\n\nThe distribution of seats according to sex includes the male Speaker who is not one of the 222 directly elected members.\n\n\n\nSources:\n\nParliament (21.05.2018, 17.07.2018)\n\nhttp://www.spr.gov.my\n\nhttp://pru14.spr.gov.my/#!/home\n\nBBC Monitoring\n\nhttp://www.bbc.com\n\nhttps://uk.reuters.com\n\nhttps://www.aljazeera.com/\n\nhttps://www.thestar.com.my\n\nhttps://www.channelnewsasia.com\n\nhttps://www.straitstimes.com/"}, {"url": "https://www.electionguide.org/elections/id/2639/", "page_content": "Coalition: National Front / Barisan Nasional (BN)*\n\nLeader: Najib RAZAK\n\nSeats won in this House of Representatives election: 79\n\nSeats won in last House of Representatives election: 133\n\nCoalition: Alliance of Hope / Pakatan Harapan (PH)** Leader: Mahathir MOHAMAD\n\nSeats won in this House of Representatives election: 113\n\nSeats won in last House of Representatives election: N/A\n\nParty: Malaysian Islamic Party / Parti Islam se-Malaysia (PAS) Leader: Hadi AWANG\n\nSeats won in this House of Representatives election: 18\n\nSeats won in last House of Representatives election: N/A\n\nParty: Sabah Heritage Party / Parti Warisan Sabah Leader: Datuk Seri Mohd Shafie Apdal\n\nSeats won in this House of Representatives election: 8\n\nSeats won in last House of Representatives election: N/A\n\nIndependent(s): Independents/Others Leader: N/A\n\nSeats won in this House of Representatives election: 4\n\nSeats won in last House of Representatives election: 0\n\n* United Malays National Organization (UMNO) leads the BN Coalition. Other members of the coalition include the Malaysian Chinese Association (MCA), United Traditional Bumiputera Party (PBB), Sarawak People's Party (PRS), Sarawak United People's Party (SUPP), Sarawak Progressive Democratic Party (SPDP), Malaysian Indian Congress (MIC), United Sabah Party (PBS), People's Progressive Party (PPP), United Pasokmomogun Kadazandusun Murut Organisation (UPKO), Malaysian People's Movement Party (Gerakan), Liberal Democratic Party (LDP) and United Sabah People's Party (PBRS).\n\n** People's Justice Party (PKR), Democratic Action Party (DAP), National Trust Party (PAN / TRUST), and Parti Pribumi Bersatu Malaysia (PPBM), are the parties in the PH Coalition. Several other parties, including United Pasokmo­mo­gun Kadazandusun Murut Organi­sa­­tion (UPKO) and Sabah Heritage Party (WARISAN), have strategic partnerships with the coalition.\n\nPopulation and number of registered voters:\n\nPopulation: 29,465,372 (2013)\n\nRegistered Voters: 13,268,002 (April 2013)\n\nGender Data:\n\n· Female Population: 14,247,069 (2013)\n\n· Is Malaysia a signatory to CEDAW: No\n\n· Has Malaysia ratified CEDAW: Yes, accession (5 July 1995)\n\n· Gender Quota: No\n\n· Female candidates in this election: Yes\n\n· Number of Female Parliamentarians: 23 (House of Representatives) (following the 2013 elections)\n\n· Human Development Index Position: 62 (2014)\n\n· Social Institutions and Gender Index (SIGI) Categorization: N/A\n\nDisability Data:\n\n· Is Malaysia a signatory to CRPD: Yes (8 April 2008)\n\n· Has Malaysia ratified CRPD: Yes (19 July 2010)\n\n· Population with a disability: 4,419,8052 (est.)"}, {"url": "https://www.malaymail.com/news/malaysia/2018/03/23/malaysias-election-process-explained/1605467", "page_content": "KUALA LUMPUR, March 23 — Here is a quick breakdown of Malaysia’s election process based on the first-past-the-post system in a parliamentary democracy.\n\nThe 14th general election must be held by August 24 this year.\n\n1. Parliament is dissolved\n\nThe ball starts rolling the day Parliament is dissolved, which has yet to happen for the14th general election.\n\nThis sometimes happens once every four years, but a full term is five years.\n\nThe Yang Di-Pertuan Agong officially dissolves Parliament upon advice from the prime minister, who is currently Datuk Seri Najib Razak.\n\nWhen Parliament is dissolved, the election is to be held within 60 days.\n\n2. When will this happen?\n\nThe 13th Parliament automatically dissolves on June 24, but the prime minister can call for the dissolution anytime before then.\n\n3. What or who are people voting for?\n\nTake a deep breath.\n\nMalaysians vote for who will sit in the Lower House of Parliament known as the Dewan Rakyat, comprising 222 seats. This is a federal level vote.\n\nThe candidates for the 222 seats are divided into respective constituencies. Or, in simpler terms, there are 222 constituencies and one seat to represent each area in Parliament.\n\nA constituency is an area within a state. Each state has a various number of federal and state constituencies. Selangor has 22 federal constituencies, for example, while Penang has 13.\n\nBut there is also a second vote which generally coincides with the general election. The people will vote for 587 state legislative assembly seats, or “Ahli Dewan Undangan Negeri”. These assemblymen are elected to form the state government. This is a state level vote.\n\nVoters in the federal territories of Kuala Lumpur, Putrajaya and Labuan, however, only have one vote — for their Member of Parliament — as there are no local council elections.\n\nIn the 14th general election, Sarawakians will only cast their ballots for their MPs as their state election was already held in 2016.\n\nIt is possible for candidates to run as both MPs and state assemblymen.\n\nCandidates will either be nominees of political parties or running as independents.\n\nFollowing the Westminster system, there is also an Upper House in Parliament known as Dewan Negara. The people do not vote on these 70 seats occupied by senators.\n\nSenators are appointed by Yang Di-Pertuan Agong upon advice from the prime minister. Each state assembly can appoint two senators to the Dewan Negara.\n\n4. Who oversees the election?\n\nA seven-member Election Commission (EC) appointed by the King upon advice from the prime minister.\n\nTheir first call to action is when Parliament is dissolved. The EC issues a writ to returning officers to hold elections in their respective constituencies. A returning officer is someone who represents each constituency on behalf of the EC.\n\nKeeping up? Let’s move on.\n\n5. Nominations begin\n\nAnd the excitement commences.\n\nCandidates must first deposit RM10,000 to contest a parliamentary seat and RM5,000 for a seat at state level. They will lose their deposit if they fail to get at least ⅛ of the total number of votes cast.\n\nCandidates are also required to pay a campaign materials deposit of RM5,000 for a Parliament seat and RM3,000 for a state seat. The deposit will be returned once all of the candidate’s campaign materials are cleaned up within two weeks of polling.\n\nNomination papers are submitted to the returning officer for each constituency.\n\nThe returning officer will declare shortly after who the candidates are, trusting they are fit to stand for election.\n\nThere are three premises which determine if a person can run for election — they must be Malaysian citizens of at least 21 years of age, of sound mental capacity and not bankrupt.\n\n6. Then some campaigning\n\nThis will begin after nominations are decided and end at midnight before polling day.\n\nCampaigns will include tours around kampungs and holding “ceramah”, or rallies.\n\nRules of the campaign — no use of improper materials, no illegal forums and no going above campaign spending limits, which are RM200,000 for federal level and RM100,000 for state level votes.\n\n7. Followed by polling\n\nThe voting day. Polling lasts for one day.\n\nRegistered voters cast their poll for both parliamentary and state level candidates.\n\nThere is no date set for voting in the 14th general election as Parliament is yet to be dissolved.\n\n8. Count the ballots\n\nBallots are tallied by EC officers.\n\n9. Declaration\n\nReturning officer to each constituency will announce which candidate is the winner.\n\nFor each seat declared, the numbers begin to add up for which party will rule in Parliament.\n\n10. How is the winner decided?\n\nUsing a first-past-the-post system, adopted from Britain. The winner is the candidate who gets the most number of votes out of the total ballots cast. For example, if 100 votes were cast in a constituency and Candidate A received 40 votes, while Candidate B and Candidate C each received 30 votes, Candidate A is the winner despite not getting support from majority of voters.\n\nA government is formed when a party or coalition secures more than half the seats in Parliament.\n\nWith 222 seats on offer, 112 is the magic number needed to form a parliamentary majority and the government."}, {"url": "http://archive.ipu.org/parline-e/reports/2197_E.htm", "page_content": "Parliament name (generic / translated) Parlimen / Parliament Structure of parliament Bicameral Chamber name (generic / translated) Dewan Rakyat / House of Representatives Related chamber (for bicameral parliaments) Dewan Negara / Senate BACKGROUND Dates of election / renewal (from/to) 9 May 2018 Purpose of elections The Pakatan Harapan (Alliance of Hope) opposition coalition (see note), led by the former long-serving Prime Minister Mohamad Mahathir, won the majority in the 222-member House of Representatives, thereby ousting Prime Minister Najib Razak's National Front (BN) coalition which had governed the country since Malaysia's independence from Britain in 1957.\n\n\n\nOn 10 May, Mr. Mahathir, 92, was sworn in as Prime Minister, becoming the world\u0092s eldest elected head of government. He stated that King has agreed to grant a full pardon to the opposition leader and former Deputy Prime Minister Ibrahim Anwar (see note 2), On 21 May, Mr. Mahathir formed a new Cabinet. Ms. Wan Azizah Wan Ismail (Mr. Anwar's wife and President of the People's Justice Party, PKR), became the first woman Deputy Prime Minister of Malaysia.\n\n\n\nPrior to the 2018 elections, the BN faced public anger over the cost of living and a corruption scandal involving a state-owned investment fund that emerged in 2015. In January 2018, Mr. Mahathir announced that he would contest the 2018 elections as the Pakatan Harapan's premier candidate, with the stated goal of ousting his former protégé, Prime Minister Najib. During the election campaign, the BN promised more public holidays, no toll charges during Eid and tax exemptions for Malaysians under 26 years old. The Pakatan Harapan promised to abolish the consumption tax (known as GST) and to fight corruption.\n\n\n\nNote 1:\n\nThe Pakatan Harapan (Alliance of Hope) was formed in 2015 by three opposition parties: the People's Justice Party (PKR), the Democratic Action Party (DAP) and Parti Amanah Negara (PAN, a splinter party of the Pan-Malaysian Islamic Party (PAS). The PKR, the DAP and the PAS had formed Pakatan Rakyat (People's Alliance, led by Mr. Anwar) for the 2013 elections but the alliance subsequently collapsed.\n\n\n\nNote 2:\n\nFor five years in the 1990s Mr. Anwar was the country's deputy prime minister, before falling from favour and finding himself at the centre of a series of court cases involving allegations of corruption and sodomy. In 2008 he was again charged with sodomy. After a lengthy court battle, he was cleared in 2012. In 2014 the court battles were resumed. Anwar Ibrahim's previous acquittal was overturned and a five-year jail term handed down. Prior to the 2018 elections, Mr. Mahathir promised to secure a royal pardon for Mr. Anwar and announced that he would hand over the prime ministerial post to Mr. Anwar within two years. Date of previous elections: 5 May 2013\n\n\n\nDate of dissolution of the outgoing legislature: 6 April 2018\n\n\n\nTiming of election:Upon normal expiry\n\n\n\nExpected date of next elections: May 2023\n\n\n\nNumber of seats at stake: 222 (full renewal)\n\n\n\nNumber of candidates: 686 (626 men, 60 women)\n\n\n\nPercentage of women candidates: 8.7%\n\n\n\nNumber of parties contesting the election: 24\n\n\n\nNumber of parties winning seats: 6\n\n\n\nAlternation of power: Yes\n\n\n\nNumber of parties in government: 4\n\n\n\nNames of parties in government: People's Justice Party (PKR), the Democratic Action Party (DAP), Parti Pribumi Bersatu Malaysia (PPBM) and Parti Amanah Negara (PAN)\n\n\n\nDate of the first session of the new parliament: 16 July 2018\n\n\n\nName of the new Speaker: Mr. Mohamad Ariff Md Yusof STATISTICS Voter turnout Round no 1 9 May 2018 Number of registered electors\n\nVoters\n\nBlank or invalid ballot papers\n\nValid votes 14'940'624\n\n\n\n\n\nNotes Distribution of votes Round no 1 Political Group Candidates Votes % People's Justice Party (PKR) National Front (BN) Pan-Malaysian Islamic Party (PAS) Democratic Action Party (DAP) Sabah Heritage Party (WARISAN) Independents (BEBES) Homeland Solidarity Party (SOLIDARITI) Distribution of seats Round no 1 Political Group Total People's Justice Party (PKR) 104 National Front (BN) 79 Pan-Malaysian Islamic Party (PAS) 18 Democratic Action Party (DAP) 9 Sabah Heritage Party (WARISAN) 8 Independents (BEBES) 3 Homeland Solidarity Party (SOLIDARITI) 1 Distribution of seats according to sex Men\n\nWomen\n\nPercent of women 192\n\n31\n\n13.90% Distribution of seats according to age Distribution of seats according to profession Comments Note:\n\nThe distribution of seats according to sex includes the male Speaker who is not one of the 222 directly elected members.\n\n\n\nSources:\n\nParliament (21.05.2018, 17.07.2018)\n\nhttp://www.spr.gov.my\n\nhttp://pru14.spr.gov.my/#!/home\n\nBBC Monitoring\n\nhttp://www.bbc.com\n\nhttps://uk.reuters.com\n\nhttps://www.aljazeera.com/\n\nhttps://www.thestar.com.my\n\nhttps://www.channelnewsasia.com\n\nhttps://www.straitstimes.com/"}, {"url": "https://www.therakyatpost.com/living/2021/06/16/from-property-to-politics-who-is-hamzah-zainudin/", "page_content": "Subscribe to our Telegram channel for the latest stories and updates.\n\nSince 10 March 2020, Datuk Seri Hamzah Zainudin has been Malaysia’s Minister of Home Affairs in Prime Minister Tan Sri Muhyiddin Yassin’s Perikatan Nasional (PN) administration.\n\nAs Home Minister, Hamzah has an extensive list of responsibilities to the Ministry of Home Affairs (Kementerian Dalam Negeri – KDN) as seen in the infographic below.\n\n(Credit: Kementerian Dalam Negeri – KDN)\n\nFrom property to politics\n\nHamzah Zainudin holds a Diploma in Quantity Surveying from the Universiti Teknologi Malaysia (UTM) and began his career as a General Manager with Maju Bangun Sdn Bhd, a subsidiary company of the Perak State Development Corporation from 1980 till 1987.\n\nHamzah has also served as a member of the Board of Ipoh City Council and Stadium Merdeka Corporation from 1987 to 1993 and 1991 to 1997 respectively.\n\nIn 1989, Hamzah ventured into private business and sat on several companies listed on Bursa Malaysia Securities Berhad (known then as the Kuala Lumpur Stock Exchange). He held various Chairman and Deputy Chairman duties, including Chairman of FELCRA Berhad, the Federal Land Consolidation and Rehabilitation Authority that oversees land management and development of agro land owned by the State and individuals.\n\nArguably, Hamzah only gained political prominence in 2008 when he was elected to the House of Representatives (Dewan Rakyat) and became a Member of Parliament (MP) for Larut in Perak. Previously he was a Senator in Parliament (Dewan Negara) from 2000 – 2006.\n\nDatuk Seri Hamzah bin Zainudin (R) with British High Commissioner to Malaysia (L) H.E. Charles Hay, MVO (Credit: Hamzahzainudin_ / Instagram)\n\nPolitical Timeline\n\nUnder Prime Minister Tun Abdullah Ahmad Badawi\n\nDeputy Minister of Housing and Local Government (19 March 2008 – 9 April 2009)\n\nUnder Prime Minister Datuk Seri Najib Razak.\n\nDeputy Minister of Plantation Industries and Commodities (10 April 2009 – 15 May 2013)\n\nDeputy Minister of Foreign Affairs (16 May 2013 – 29 July 2015)\n\nMinister of Domestic Trade, Cooperatives and Consumerism (29 July 2015 – 10 May 2018)\n\nWith politics, come controversies\n\nOne of the first times Hamzah was caught in a public hullabaloo was matters of his own personal home affairs.\n\nIn 2004, he was asked to pay his first wife Nooraini Rashid RM11.2 million in settlements for allegedly divorcing her to marry a much younger wife. In 2007 however, the Syariah Appeals Court allowed for his appeal to not pay his ex-wife.\n\nIn August 2008, former “best friend” and opposition leader Datuk Seri Anwar Ibrahim, filed a defamation suit against him seeking RM10 million in damages over Hamzah’s allegations that Anwar had harassed his wife in 1998. Hamzah allegedly made the remark when campaigning during the Permatang Pauh by-election in August 2008, which subsequently saw Anwar’s return to parliament after a 10-year absence.\n\nAside from that, Hamzah has remained relatively low-key until 2019 when he accepted Tun Dr Mahathir Mohamad’s invitation to join the Malaysian United Indigenous Party (BERSATU) by quitting United Malays National Organisation (UMNO).\n\nREAD MORE: Who Is Bersatu, Where Did They Come From, And How Did They Get Here?\n\nThis debatably was the beginning of his involvement in the ongoing political crisis dubbed the Sheraton Move which eventually led to the appointment of Muhyiddin Yassin as the 8th Prime Minister. Some critics have even labeled Hamzah as “chief plotter” to the coup.\n\nIn April 2021, an audio recording was leaked of Hamzah talking about a reshuffle in the police force. The recording went viral and revealed Hamzah discussing with then Inspector-General of Police (IGP) Tan Sri Abdul Hamid Bador, to internally transfer staff and discussing his jurisdiction of Polis Diraja Malaysia (PDRM). Hamzah insisted he had done nothing wrong despite the former IGP’s comment on how a politician’s interference will make operations hard for the PDRM.\n\nREAD MORE: 12 Reasons Why Malaysia’s Former IGP Was THE BOSS\n\nHamzah has also come under fire for targeting migrants, particularly undocumented workers and refugees, although doing so might result in them avoiding the authorities and not getting vaccinated. Australia’s ABC even picked up on the news quoting him saying “We will make sure the prisons are ready” in response to his announcement on Malaysian authorities conducting raids against neighourhoods with undocumented migrants.\n\nMost recently on 15 June, he deemed it was not discriminatory to grant automatic citizenship only for children of Malaysian fathers. His comment was made in response to a legal action filed at the Kuala Lumpur High Court on 18 December after six Malaysian mothers and family rights group Family Frontiers sought a declaration that Malaysian women married to foreign spouses can automatically get citizenship for their children born overseas. This came after the government refused to budge on allowing the children of these mothers to be eligible for citizenship.\n\nThe Covid-19 scare\n\n(Credit: YouTube)\n\nBy now we know that Covid-19 does not discriminate regardless of race, gender or political standing. In January 2021, Hamzah Zainudin tested positive for Covid-19 and was the third minister in four days to do so in the Muhyiddin Cabinet. Despite recounting it as a painful experience, he has since fully recovered.\n\nMore recently, Hamzah has expressed his concern that herd immunity must be achieved in order to make it safe for the public given the Covid-19 pandemic and was mulling the idea of taking legal action against anti-vaxxers."}, {"url": "https://www.parlimen.gov.my/yang-di-pertua.html?uweb=dr&lang=en", "page_content": "Speaker may be a member of the House or a non-member who is qualified to be elected as the Speaker of the House.\n\n\n\nFunctions of the Speaker include:\n\nto be responsible for maintaining order in the House\n\nto ensure that relevancy is observed during debates\n\nto interpret the Standing Orders in case of disputes.\n\n\n\nThe Speaker may vacant his office in the following cases:\n\nwhen the House first meets after a general election\n\non ceasing to be a member of the House in the case of an elected MP\n\nif at any time the House resolves that the Speaker vacant his office."}, {"url": "https://www.cs.mcgill.ca/~rwest/wikispeedia/wpcd/wp/p/Parliament_of_Malaysia.htm", "page_content": "The Parliament of Malaysia is the national legislature of Malaysia, based on the Westminster system of Parliament. It consists of the Dewan Rakyat (House of Representatives or literally People's Hall, in Malay) and the Dewan Negara (Nation's Hall in Malay; however, it is commonly referred to as the Senate). Members of the Dewan Rakyat are known as members of Parliament (MPs) while members of the Dewan Negara are called senators.\n\nA general election is held every four or five years to elect representatives to the Dewan Rakyat; members of the Dewan Negara, like those of the House of Lords in the United Kingdom, are appointed. Members of Parliament are commonly referred to as MPs.\n\nThe Parliament assembles in the Malaysian Houses of Parliament, located in the national capital city of Kuala Lumpur.\n\nHistory\n\nHistorically, none of the states forming the Federation of Malaysia had parliaments before independence. Although the British colonial government had permitted the forming of legislative councils for Malaya, Singapore, Sabah and Sarawak, these were not the supreme makers of law, and remained subordinate to the British High Commissioner. The Reid Commission, which drafted the Constitution of Malaya — Malaya gained independence in 1957, ahead of the other states that would later form Malaysia — modelled the Malayan system of government after that of Britain's, with a bicameral parliament, one house being directly elected, and the other being appointed by the King — just like the British House of Commons and House of Lords. Originally Parliament had no specific place to convene until with the completion of Parliament House in 1962, which comprises a three-storey main building for the two houses of Parliament to meet, and an 18-storey tower for the offices of Ministers and members of Parliament.\n\nIn 1963, when Malaya merged with Singapore, Sabah and Sarawak to form Malaysia, the Malayan Parliament became the Parliament of Malaysia, following the same system as before. Originally under the 1957 Constitution, most Senators were elected by the state assemblies in order to provide representation of state interests; changes to the Constitution in 1963 saw each state receiving two members, with the rest (including members for federal territories) being appointed by the King on the advice of the Cabinet. When Singapore seceded from Malaysia in 1965, its Legislative Assembly became Parliament, and it ceased to be represented in the Parliament of Malaysia.\n\nParliament has been suspended only once in the history of Malaysia, in the aftermath of the May 13 racial riots in 1969. From 1969 to 1971 — when Parliament reconvened — the nation was run by the National Operations Council (NOC).\n\nDebates in Parliament are broadcast on radio and television occasionally, such as during the tabling of a budget. Proposals from the opposition to broadcast all debates live have been repeatedly rejected by the government; in one instance, a Minister said that the government was concerned over the poor conduct of the opposition as being inappropriate for broadcasting. The prohibitive cost ( RM100,000 per sitting) was also cited as a reason.\n\nScope\n\nAs the ultimate legislative body in Malaysia, Parliament is responsible for passing, amending and repealing acts of law. It is subordinate to the Head of State, the Yang di-Pertuan Agong (King), under Article 39 of the Constitution.\n\nParliament's members are permitted to speak on any subject without fear of censure outside Parliament; the only body that can censure an MP is the House Committee of Privileges. Such \" Parliamentary immunity\" takes effect from the moment a member of Parliament is sworn in, and only applies when that member has the floor; it does not apply to statements made outside the House. An exception to this rule are portions of the constitution related to the social contract, such as the Articles governing citizenship, Bumiputra (Malays and indigenous people) privileges, the Malay language, etc. — all public questioning of these provisions is illegal under the 1971 amendments to the Sedition Act, which Parliament passed in the wake of the 1969 May 13 racial riots. Members of Parliament are also forbidden from criticising the King and judges. Parliamentary immunity and other such privileges are set out by Article 63 of the Constitution; as such, the specific exceptions to such immunity had to be included in the Constitution by amendment after the May 13 incident.\n\nThe executive government, comprising the Prime Minister and his Cabinet, is usually drawn from members of Parliament; most of its members are typically members of the Dewan Rakyat. After a general election or the resignation or death of a Prime Minister, the King selects the Prime Minister, who is the Head of Government but constitutionally subordinate to him, from the Dewan Rakyat. In practice, this is usually the leader of the largest party in Parliament. The Prime Minister then submits a list containing the names of members of his Cabinet, who will then be appointed as Ministers by the King. Members of the Cabinet must also be members of Parliament. If the Prime Minister loses the confidence of the Dewan Rakyat, whether by losing a no-confidence vote or failing to pass a budget, he must submit his resignation to the King, who will then appoint a new Prime Minister. The Cabinet formulates government policy and drafts bills, meeting in private. Its members must accept \"collective responsibility\" for the decisions the Cabinet makes, even if some members disagree with it; if they do not wish to be held responsible for Cabinet decisions, they must resign. Although the Constitution makes no provision for it, there is also a Deputy Prime Minister, who is the de facto successor of the Prime Minister should he die or be otherwise incapacitated.\n\nAlthough the judiciary is constitutionally an independent branch of the government, after the 1988 constitutional crisis, the judiciary was made subject to Parliament; judicial powers are held by Parliament, and vested by it in the courts, instead of being directly held by the judiciary as before. The Attorney-General was also conferred the power to instruct the courts on what cases to hear, where they would be heard, and whether to discontinue a particular case.\n\nProcedure\n\nParliament meets from Monday to Thursday when it is in session, as Friday is part of the weekend in certain states such as Kelantan.\n\nA proposed act of law begins its life when a particular government minister or ministry prepares a first draft with the assistance of the Attorney-General's Department. The draft, known as a bill, is then discussed by the Cabinet. If it is agreed to be submitted to Parliament, the bill is distributed to all MPs. It then goes through three readings before the Dewan Rakyat. The first reading is where the minister or his deputy submits it to Parliament. At the second reading, the bill is discussed and debated by MPs. Until the mid-1970s, both English and Malay (the national language) were used for debates, but henceforth, only Malay was permitted, unless permission was obtained from the Speaker of the House. At the third reading, the minister or his deputy formally submit it to a vote for approval. A 2/3rds majority is usually required to pass the bill, but in certain cases, a simple majority suffices. Should the bill pass, it is sent to the Dewan Negara, where the three readings are carried out again. The Dewan Negara may choose not to pass the bill, but this only delays its passage by a month, or in some cases, a year; once this period expires, the bill is considered to have been passed by the house.\n\nIf the bill passes, it is presented to the Yang di-Pertuan Agong (King), who has 30 days to consider the bill. Should he disagree with it, he returns it to Parliament with a list of suggested amendments. Parliament must then reconsider the bill and its proposed amendments and return it to the King within 30 days if they pass it again. The King then has another 30 days to give the royal assent; otherwise, it passes into law. The law does not take effect until it is published in the Government Gazette.\n\nThe government attempts to maintain top secrecy regarding bills debated; MPs generally receive copies of bills only a few days before they are debated, and newspapers are rarely provided with copies of the bills before they are debated. In some cases, such as a 1968 amendment to the Constitution, an MP may be presented with a bill to be debated on the same day it is tabled, and all three readings may be carried out that day itself. In rare circumstances, the government may release a White paper containing particular proposals that will eventually be incorporated into a bill; this has been done for legislation such as the Universities and University Colleges Act.\n\nAlthough the process above assumes only the government can propose bills, there also exists a process for Private Member's Bills. However, as in most other legislatures following the Westminster System, few members of Parliament actually introduce bills. To present a Private Member's Bill, the member in question must seek the leave of the House in question to debate the bill before it is moved. Originally, it was allowed to debate the bill in the process of seeking leave, but this process was discontinued by an amendment to the Standing Orders of Parliament. It is also possible for members of the Dewan Negara (Senate) to initiate bills; however, only cabinet ministers are permitted to move finance-related bills, which must be tabled in the Dewan Rakyat.\n\nIt is often alleged that legislation proposed by the opposition parties, which must naturally be in the form of a Private Member's Bill, is not seriously considered by Parliament. Some have gone as far as to claim that the rights of members of Parliament to debate proposed bills have been severely curtailed by incidents such as an amendment of the Standing Orders that permitted the Speaker of the Dewan Rakyat to amend written copies of MPs' speeches before they were made. Nevertheless, it is admitted by some of these critics that \"Government officials often face sharp questioning in Parliament, although this is not always reported in detail in the press.\"\n\nRelationship with the government\n\nIn theory, based on the Constitution of Malaysia, the government is accountable to Parliament. However, there has been substantial controversy over the independence of the Malaysian Parliament, with many viewing it simply as a rubber stamp, approving the executive branch's decisions. Constitutional scholar Shad Saleem Faruqi has calculated that 80% of all bills the government introduced from 1991 to 1995 were passed without a single amendment. According to him, another 15% were withdrawn due to pressure from non-governmental organisations (NGOs) or other countries, while only 5% were amended or otherwise altered by Parliament. Shad concludes that \"the legislative process is basically an executive process, not a parliamentary process.\"\n\nChecks and balances\n\nTheoretically, the executive branch of the government is held in check by the legislative and judiciary branches. Parliament largely exerts control on the government through question time, where MPs question members of the cabinet on government policy, and through Select Committees that are formed to look into a particular issue.\n\nFormally, Parliament exercises control over legislation and financial affairs. However, the legislature has been condemned as having a \"tendency to confer wide powers on ministers to enact delegated legislation\", and a substantial portion of the government's revenue is not under Parliament's purview; government-linked companies, such as Petronas, are generally not accountable to Parliament. In his 1970 book The Malay Dilemma, future Prime Minister Mahathir bin Mohamad stated: \"In the main, Parliamentary sittings were regarded as a pleasant formality which afforded members opportunities to be heard and quoted, but which would have absolutely no effect on the course of the Government. ... The sittings were a concession to a superfluous democratic practice. Its main value lay in the opportunity to flaunt Government strength.\" Critics have regarded Parliament as a \"safe outlet for the grievances of backbenchers or opposition members,\" and meant largely to \"endorse government or ruling party proposals\" rather than act as a check on them.\n\nThere have been only six Select Committees formed since 1970, when Parliament reconvened after the May 13 Incident. Of these, three were formed between 2002 and 2005. Although question time exists for Parliament to check the power of the executive, it has been argued that the question time allotted for MPs to question the government on its policies is insufficient or ineffective. Shad has calculated that as each question time session lasts only an hour, at the most, twelve questions can be asked. Opposition Leader Lim Kit Siang of the Democratic Action Party (DAP) calculated that over the space of three days (from 10 October to 13 October 2005), only 32 questions were answered orally. Of these 32 questions, only nine or 28% percent were answered by the Ministers concerned. The rest were answered either by Deputy Ministers (41%) or Parliamentary Secretaries (31%).\n\nHowever, Minister in the Prime Minister's Department in charge of Parliamentary Affairs Nazri Aziz stated in 2006 that question time would be expanded to 90 minutes later in the year. He also proposed televising question time; opposition lawmakers have proposed televising whole Parliamentary sessions on a regular basis before, but their suggestions were rejected by the Cabinet. It remains to be seen if Nazri's suggestion will be taken up.\n\nTime is allocated for discussion of the annual budget after it is tabled by the government's representative (usually the Prime Minister); however, most MPs spend much of the time questioning the government on other issues. Shad contends that although about 20 days are given for discussion of the budget, \"the budget debate is used to hit the government on the head about everything else other than the budget. From potholes to education policy to illegal immigrants.\"\n\nIf Parliament votes to reject the budget, it is taken as a vote of no-confidence, forcing the government out of office. The government will then either have to reform itself with a new cabinet and possibly new Prime Minister, or call for a general election. As a result, Shad states that \"MPs may criticise, they may have their say but the government will have its way\" when it comes to the budget.\n\nWith the judiciary, it is possible for the courts to declare a particular act of Parliament unconstitutional. However, this has never occurred. Parliament is not involved in the process of judicial appointments.\n\nDepartment of Parliament controversy\n\nIn early October of 2005 the Minister in the Prime Minister's Department in charge of parliamentary affairs, Nazri Aziz, announced the formation of a Department of Parliament to oversee its day-to-day running. The leader of the Opposition, Lim Kit Siang, immediately announced a \"Save Parliament\" campaign to \"ensure that Parliament does not become a victim in the second most serious assault on the doctrine of separation of powers in the 48-year history of the nation\".\n\nNazri soon backed down, saying he had meant an office (although he stated jabatan, which means department; pejabat is the Malay word for office) and not Department (Jabatan) of Parliament. The New Straits Times, a newspaper owned by the United Malays National Organisation (a key member of the ruling Barisan Nasional coalition) wrote in an editorial that \"ministerial authority was established over Parliament the building\" and not Parliament the institution and that \"[i]f the new 'department' and its management and staff do their jobs well, the rakyat (people) would have even more of a right to expect their MPs to do theirs by turning up for Dewan sessions, preserving that quaint tradition of the quorum, on behalf of their constituencies.\"\n\nLim was dissatisfied with such a response and went ahead with a \"Save Parliament\" roundtable attended by several MPs (including Nazri) and non-governmental organisations (NGOs). Although Lim thanked Nazri (the only Barisan Nasional MP in attendance), he stated that the proposed department remained a threat to Parliament's independence, and had to be \"seen in the context of the relentless erosion and diminution of parliamentary powers and functions by the Executive\". In a statement, the roundtable found that \"Nazri’s explanations were not convincing\" and urged \"Nazri to halt all implementation of the Cabinet decision to establish a Department or Office of Parliament until MPs and the civil society could approve and support the proposal\".\n\nOn October 13 in the Dewan Rakyat, Ahmad Shabery Cheek (BN MP for Kemaman) tabled a motion to reinstate the Parliamentary Services Act 1963 (which would provide for a parliamentary service independent of the Public Service Department currently handling parliamentary affairs) that had been repealed (upon the unilateral suggestion of then Speaker of the House, Zahir Ismail) in 1992. Ahmad Shabery demanded to know if the government would make the status of parliament as an independent institution clear, and stated that \"Aside from nice flooring, chairs and walls, we don’t even have a library that can make us proud, no in-house outlet selling copies of different Acts that are passed in Parliament itself and no proper information centre.\"\n\nNazri responded that the motion would have to be referred to the House Committee for review. Shahrir Abdul Samad, chairman of the Barisan Nasional Backbenchers' Club, then insisted that the Act be immediately restored without being referred to the Committee, and called on all MPs who supported the motion to stand. Several immediately stood, with some Opposition MPs shouting \"bangun, bangun\" (stand up, stand up). Following Shahrir's lead, a majority of the BN MPs also stood, including some frontbenchers. However, several ministers, including Foreign Minister Syed Hamid Albar (who had supported repealing the Act in 1992) remained seated. Nazri then stated that the matter would remain with the Committee, as he did not want it dealt with in a slipshod manner.\n\nThe following day, Lim called on Kamaruddin Mohd Baria, who would have taken the post of Parliament Head of Administration, not to report for duty in his new post. Meanwhile, the Dewan Negara House Committee held a specially-convened meeting, which called on the government to revive the Act and to call off all moves to change the administrative structure of Parliament. The President of the Dewan Negara, Abdul Hamid Pawanteh, also stated that he had not been informed \"at all\" by the government regarding the new department or office of Parliament. Later the same day, Minister in the Prime Minister's Department Radzi Sheikh Ahmad stated that the government had agreed to revive the Act.\n\nHowever, on October 17, Nazri refused to budge on the issue of the new post of \"Parliament Head of Administration\" (which would make the current Parliamentary Secretary, who is accountable to Parliament and not the executive, redundant). He also stated that the Parliamentary Service Act would have to go through the Dewan Rakyat House Committee and endorsed by the Dewan Rakyat before being sent to the cabinet for approval. In his blog, Lim slammed Nazri for overlooking \"the fact that when the Parliamentary Privilege Act was repealed in 1992, it was not at the recommendation of the Dewan Rakyat House Committee but merely at the unilateral request of the Speaker.\"\n\nCurrent composition\n\n\n\nSummary of the 21 March 2004 Dewan Rakyat (House of Representatives) election results Votes % of vote Seats +/- National Front (Barisan Nasional): 4,420,452 63.9 198 +51 United Malays National Organization (Pertubuhan Kebangsaan Melayu Bersatu, UMNO) 2,483,249 35.9 109 +38 Malaysian Chinese Association (Persatuan China Malaysia, MCA) 1,074,230 15.5 31 +2 Malaysian Indian Congress (Kongres India Se-Malaysia, MIC) 221,546 3.2 9 +2 Malaysian People's Movement Party (Parti Gerakan Rakyat Malaysia, Gerakan) 257,763 3.7 10 +4 United Traditional Bumiputera Party (Parti Pesaka Bumiputera Bersatu, PBB) 383,664 5.5 11 +5 Sarawak United People's Party (Parti Rakyat Bersatu Sarawak, SUPP) 6 Sarawak United People's Party (Parti Rakyat Bersatu Sarawak, SUPP) 6 Sarawak Progressive Democratic Party (Parti Demokratik Progresif Sarawak, SAPP) 4 United Sabah Party (Parti Bersatu Sabah, PBS) 4 United Pasokmomogun Kadazandusun Murut Organisation (Pertubuhan Pasok Momogun Kadazandusun Bersatu, UPKO) 4 Sabah Progressive Party (Parti Maju Sabah, SAPP) 2 United Sabah People's Party (Parti Bersatu Rakyat Sabah) 1 People's Progressive Party (Parti Progresif Penduduk Malaysia, PPP) 1 Liberal Democratic Party (Parti Liberal Demokratik, LDP) - Democratic Action Party (Parti Tindakan Demokratik, DAP) 687,340 9.9 12 +2 Alternative Front (Barisan Alternatif) coalition: 1,668,998 24.1 8 -24 Islamic Party of Malaysia (Parti Islam SeMalaysia, PAS) 1,051,480 15.2 7 -20 People's Justice Party (Parti Keadilan Rakyat, PKR) 617,518 8.9 1 -4 Non partisans (and others) 139,438 2.1 1 -2 Overall total 6,916,138 100.0 219 +26 Source: The Star, Kuala Lumpur"}, {"url": "https://www.loc.gov/item/global-legal-monitor/2019-07-18/malaysia-bill-reducing-voting-age-to-18-passed/", "page_content": "(July 18, 2019) On July 16, 2019, the Dewan Rakyat, the lower house of the Parliament of Malaysia, passed the Constitution (Amendment) Bill 2019, which reduces the voting age in national and state elections from the current 21 years to 18 years. The Bill received 211 votes—the number of members present for the vote—surpassing the two-thirds majority required for constitutional amendments in the 222-member house.\n\nThe Bill amends article 119(1)(a) of the Federal Constitution of Malaysia by substituting “eighteen years” for “twenty-one years” as the voting age for elections to the Dewan Rakyat and to any state legislative assembly. It also amends article 47 to reduce the age at which a person can stand for election to the Dewan Rakyat to 18 years, and similarly amends section 5 of the Eighth Schedule of the Constitution to allow persons aged 18 and over to stand for election to the legislative assembly of the state in which they reside.\n\nA further amendment in the Bill, to article 119(4)(b), substitutes the words “is registered” for “applies for registration” as an elector in the definition of the term “qualifying date” used in other parts of the article. This amendment allows for the automatic registration of persons as electors upon their reaching the age of 18 years. It will come into force only on a date appointed by the Yang di-Pertuan Agong (head of state of Malaysia), whereas the other amendments above will come into force the day after they are published in the Federal Gazette.\n\nWhen introducing the Bill, Prime Minister Tun Dr Mahathir Mohamad said that several amendments need to be made to the Election Offences Act 1954, Elections (Conduct of Elections) Regulations 1981, and Elections (Registration of Electors) Regulations 2002 to implement automatic voter registration of persons when they turn 18. During the debate on the Bill, he said that automatic registration would also apply to persons aged 21 years who have not registered as voters. He further said that “[i]t must be remembered that the implementation of the automatic voter registration would result in an estimated 7.8 million new voters to be registered in the electoral roll for the next five years. This is not an easy task as it involved cost, time, locality determination and the correct election division.”\n\nIt appears that automatic registration would be based on the register of the National Registration Department, and that it would also involve data integration with the “Malaysian Prisons Department, the Malaysian Health Ministry, the Royal Malaysia Police, Malaysian Armed Forces and other related agencies” in order to identify any disqualifications to registration. Article 119(3) of the Constitution disqualifies a person from voting in an election if\n\n(a) on the qualifying date he is detained as a person of unsound mind or is serving a sentence of imprisonment; or\n\n(b) having before the qualifying date been convicted in any part of the Commonwealth of an offence and sentenced to death or imprisonment for a term exceeding twelve months, he remains liable on the qualifying date to suffer any punishment for that offence."}, {"url": "https://www.malaymail.com/news/what-you-think/2022/11/20/what-is-the-yang-di-pertuan-agongs-constitutional-role-in-post-election-government-formation-dian-ah-shah-and-andrew-harding/40859", "page_content": "NOVEMBER 20 — As Malaysians headed to the polls, many people predicted a hung Parliament. Naturally then the question arises what happens Constitutionally in such a situation?\n\nThe role of the Yang Di-Pertuan Agong (YDPA) becomes important, as we have seen over the last few years, in cases of appointment and resignation of prime ministers.\n\nThe role of the Agong in these matters has never been under greater scrutiny. Malaysians now live in an age of political fluidity, and are increasingly aware of the need for Constitutional mechanisms to constrain politics and ensure a democratic polity.\n\nYang di-Pertuan Agong Al-Sultan Abdullah Ri’ayatuddin Al-Mustafa Billah Shah attends the Trooping the Colour at Dataran Pahlawan Negara in Precinct 1 June 10, 2022. — Picture by Ahmad Zamzahuri\n\nMany will hope for stability under solidly supported leadership, and they expect their head of state to play an important role.\n\nThese issues, we believe, are a sign of a maturing democracy, rather than a cause for concern. And of course, the situation of a hung Parliament is by no means uncommon.\n\nIt has featured in parliamentary democracies the world over. So what is the position where Parliament is hung following a general election?\n\nHung Parliament or not, the starting point is that the YDPA has the obligation — under Article 43(2) of the Federal Constitution — to appoint as prime minister the member of the Dewan Rakyat who in his judgment is likely to command the confidence of the majority of the Dewan Rakyat members. This obligation is to be read with Article 40(2), which states that the YDPA may act in his discretion in appointing a prime minister.\n\nThree immediate questions\n\nWhat do these provisions mean? There is clearly a lot more to the words “discretion”, “judgment”, and “confidence” than meets the eye. But the implications of this language can be elucidated by three questions.\n\nFirst, does “discretion” mean that the YDPA has absolute freedom to choose and appoint a PM? Second, how should the YDPA exercise the “judgment” required of him? Finally, what is the evidence of the “confidence” that is being judged?\n\nTo answer these questions, it is important to appreciate several broader principles. The first is that the rule of law (kedaulatan undang-undang) is central to a functioning constitutional democracy — thus, everyone is governed by the law and all power has legal limits.\n\nThe second related point is that while the Constitution creates political institutions and endows them with certain powers, it also spells out, or implies, the limits of those powers.\n\nThirdly, the Malaysian Constitutional order is built upon the foundations of a Westminster parliamentary democracy, and in such a system, certain conventions, such as those governing the appointment of a prime minister, have been developed to ensure representative government within a system where the head of state exercises important, but limited powers.\n\nIn light of this, we regard statements that the YDPA has “absolute”, “unlimited”, or “unfettered” discretion to be highly misleading. There is no such thing as absolute discretion.\n\nIndeed, like every discretionary power, the YDPA’s discretion is limited by the very words that confer it. It is also limited by the imperatives of Constitutional monarchy and representative government which inform the interpretation of the text.\n\nThe YDPA’s power in the matter of appointing a prime minister after a general election is discretionary because in this instance he cannot act on the advice of the government.\n\nThe government remains to be formed, and the YDPA can only act on the advice of a government with a majority. But it is important to understand that this discretion is not a discretion to appoint the person who seems to best merit appointment; it is a judgment as to who commands the confidence of a majority — an entirely different question.\n\nIt is also important to understand that, since the matter is not one of the YDPA’s own political preference, but one of judgment of facts, the Constitution also insulates the monarchy from being turned into a political football.\n\nThis imperative of ensuring the office of the YDPA remains above politics also means that when it comes to the formation of government, the YDPA’s role to appoint (as opposed to the more proactive role of “determining”) is secondary to the political process amongst elected political elites to determine the matter of support.\n\nIt is this process that results in the fact of the confidence of a majority that enables the YDPA to exercise his power of appointment.\n\nOf course, in making this judgment, the YDPA is entitled, indeed obliged, to rely on evidence. But what evidence counts in these circumstances? The Constitution does not tell us the answer, but an answer can be made on the basis of Constitutional logic.\n\nThe YDPA cannot in this case rely on support expressed on the floor of the house, as the new house has not yet met. But he is entitled to consider other matters.\n\nFirst, there are public expressions of support by party leaders, who speak on behalf of their party’s Parliamentary membership. It has also been common in Malaysia (although not, we notice, elsewhere) for MPs to issue statutory declarations or letters of support.\n\nThese are not wholly reliable, as a member may express support for one prime-ministerial candidate one day and another the next.\n\nThirdly, a head of state may take his own soundings amongst political leaders. In the last two cases of prime-ministerial appointment, the YDPA also went to the extent of interviewing all MPs and party leaders to arrive at his judgment on confidence.\n\nThis (we have checked) has never been done in any other Parliamentary system to the best of our knowledge, and we suggest it could only be appropriate where the other evidence listed above has proved to be unreliable.\n\nIn essence, a head of state should be entitled to rely on the veracity and soundness of judgment of party leaders in making his assessment.\n\nIn a system of parliamentary democracy, political choices and decisions are driven by parties, as opposed to individual MPs.\n\nPractising Constitutional democracy and protecting the democratic mandate\n\nUnder Westminster conventions, the issue of determining confidence is — as we suggested above — a political process for the politicians to resolve amongst themselves.\n\nNotwithstanding public fatigue with power battles, there are persuasive reasons to allow such a political process to take centre stage.\n\nWe have highlighted the need to avoid pulling the YDPA into political controversy. Of late, there have been attempts by several politicians to pass the buck, so to speak, to the YDPA to determine who becomes prime minister, as a means of indirectly resolving leadership and power struggles within their own coalition. This is a misconception of his role.\n\nIf an appointed candidate is later subjected to (and fails) a no-confidence vote in Parliament, this might suggest a serious misjudgement on the part of the head of state and it would undermine public confidence in the institution.\n\nHowever, we suggest that if party leaders overestimate their support, and as a result, for example, lose a Parliamentary confidence vote they indicated they would win, then the embarrassment should be that of the party leaders in question, not that of the head of state.\n\nBased on the principles and issues considered above, the determination of the issue of confidence must be carried out in light of Constitutional conventions.\n\n* Dr Dian AH Shah and Professor Andrew Harding, Centre for Asian Legal Studies, National University of Singapore.\n\n** This is the personal opinion of the writer or organisation and does not necessarily represent the views of Malay Mail."}]}