{"Dan Stearns wrote and sang the majority of the band's songs, and his songwriting style was often compared to that of Bob Dylan.": [{"url": "https://www.britannica.com/topic/the-Band-Canadian-American-rock-group", "page_content": "the Band, Canadian-American band that began as the backing group for both Ronnie Hawkins and Bob Dylan and branched out on its own in 1968. The Band’s pioneering blend of traditional country, folk, old-time string band, blues, and rock music brought them critical acclaim in the late 1960s and ’70s and served as a template for Americana, the movement of hybrid, roots-oriented music that emerged in the late 1990s. The members were Jaime (“Robbie”) Robertson (b. July 5, 1944, Toronto, Ontario, Canada), Levon Helm (b. May 26, 1940, Elaine, Arkansas, U.S.—d. April 19, 2012, New York, New York), Rick Danko (b. December 29, 1942, Simcoe, Ontario, Canada—d. December 10, 1999, Marbletown, New York, U.S.), Richard Manuel (b. April 3, 1945, Stratford, Ontario, Canada—d. March 4, 1986, Winter Park, Florida, U.S.), and Garth Hudson (b. August 2, 1937, London, Ontario, Canada).\n\nRobertson, Helm, Danko, Manuel, and Hudson were five self-effacing sidemen pushed into becoming a self-contained group by Dylan, the star in whose shadow they grew. Robertson was the group’s principal writer and guitarist. Drummer Helm was a “good old boy” from Arkansas, the sole American in a lineup of displaced Canadians. Danko was the amiable hayseed on bass and occasional fiddle. Pianist Manuel sang blues ballads in a wrenching Ray Charles baritone. And Hudson’s otherworldly keyboard doodles were the glue that held the whole operation together. At their peak, from 1968 to 1973, the quintet embodied better than any other group the sense of the American past that came to haunt pop culture after the hippie ideals of the 1960s had crashed to the ground.\n\nThe real midwife to the Band’s birth was Hawkins, a rockabilly diehard from Arkansas who ventured up to Canada in the spring of 1958. As Hawkins’s lieutenant, Helm, still a teenager, helped recruit the young Ontarians—Robertson, Danko, Manuel, and Hudson—who replaced the original members of Hawkins’s backing band, the Hawks. At a point when Fabian ruled the pop airwaves, the razorback rock and roll of the new Hawks was welcome only in the scuzziest roadhouses. During these years on the road, Robertson absorbed much of the flavour of life below the Mason and Dixon Line that would permeate Band songs like “The Night They Drove Old Dixie Down” (1969).\n\nIn 1964 the Hawks figured they could make it without Hawkins. During their summer residency on the New Jersey seaboard, Dylan got wind of their reputation and, after playing with Robertson, hired the group to back him on his first electric tour—a tour so controversial among folk purists that Helm could not take the pressure and quit. For the Hawks it was a baptism by fire, and it all but burned them out.\n\nIn 1967, in an effort to recuperate, the group (minus Helm) followed Dylan to Woodstock, New York. In nearby West Saugerties they gathered daily in the basement of “Big Pink,” a secluded ranch house. Here the five men put together a rambling repertoire of old country, folk, and blues songs that later leaked out as a series of “basement tape” bootlegs and then as the double album The Basement Tapes (1975).\n\nWhen Helm returned to the fold, Dylan began urging “the Band”—as they were now known locally—to go it alone. The immediate result of this separation was Music from Big Pink (1968), a wholly original fusion of country, gospel, rock, and rhythm and blues that, more than any other album of the period, signaled rock’s retreat from psychedelic excess and blues bombast into something more soulful, rural, and reflective. Yet it was The Band (1969) that really defined the group’s grainy character. Recorded in a makeshift studio in Los Angeles in early 1969, the album was a timeless distillation of American experience from the Civil War to the 1960s.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nAfter the many years spent backing Hawkins and Dylan, the Band was ill-prepared for the vulnerability they felt singing their own songs onstage. After a disastrous debut at Winterland in San Francisco, they played to the massed tribes of the 1969 Woodstock festival. “We felt like a bunch of preacher boys looking into purgatory,” recalled Robertson. This sense of alienation from the spirit of rock was reflected in Stage Fright (1970), an album full of foreboding and depression. Ironically, the record preceded the Band’s most intensive period of touring, during which they became the formidable live unit of the magnificent Rock of Ages (1972).\n\nThe Band’s experience on the road seemed to affect their confidence—particularly that of Robertson in his role as chief songwriter. Whereas The Band had sounded fresh and intuitive, Cahoots (1971) was laboured and didactic. After a mostly lost year in 1972, when Manuel’s alcoholism became chronic, they trod water with Moondog Matinee (1973), an album of fine cover versions, then hitched their wagon once again to Dylan for the highly successful tour that produced Before the Flood (1974).\n\nJust as they had followed Dylan to Woodstock, so the Band now decamped to southern California. The move suited Robertson, who acclimated quickly to the Hollywood lifestyle, but the others felt like fish out of water. Northern Lights—Southern Cross (1975) at least proved that the Band had not lost its keen musical empathy, but, when Robertson suggested dissolving the group after a final show at Winterland, he encountered little resistance.\n\nStaged on Thanksgiving Day (November 25), 1976, this “Band and friends” finale was immortalized by Martin Scorsese’s film The Last Waltz (1978), with guest appearances by Dylan, Neil Young, and others. With only the lacklustre Islands (1977) as a last, contract-honouring memento of their career, the Band quickly fragmented. In 1983, sans Robertson, the group re-formed and played a less-than-spectacular tour. Three years later, Manuel was found hanging from a shower curtain in a Florida motel room.\n\nHelm, Hudson, and Danko, who moved back to Woodstock, continued to operate as the Band and released three indifferent albums in the 1990s. Robertson remained in Los Angeles, where he made several solo albums and created film soundtracks. The Band was inducted into the Rock and Roll Hall of Fame in 1994."}, {"url": "https://www.rollingstone.com/music/music-features/why-bob-dylan-is-a-literary-genius-105108/", "page_content": "Mikal Gilmore is one of the rare journalists to talk to Bob Dylan extensively in recent years, including a 2001 interview in which Dylan opened up about everything from regaining his creative drive to how the country should move on from the attacks of September 11th, and another in 2012 in which Dylan offered puzzling new details about his 1966 motorcycle crash and lashed out at his critics. On Saturday, Dylan will become the recipient of the Nobel Prize in Literature. We reached out to some of his most influential fans, including Al Gore and Stephen King, to discuss Dylan’s literary merits. Here, Gilmore traces how Dylan came to write not just songs or poetry – but history.\n\nWhen Bob Dylan became world-renowned in 1965 – with the eventful summer hit “Like a Rolling Stone” – he seemed mystifying, uncanny, unrivaled. It wasn’t simply his appearance – his mazy hair, more far-out than the Beatles’; his gaunt visage, more dissolute than the Rolling Stones’ Brian Jones. It wasn’t his snarling inflection, which nettled some people’s nerves, nor that he’d written protest anthems that ratified youthful upheaval. What set Bob Dylan apart from everybody was something more outlandish: It was how he wielded language. “Like a Rolling Stone” was surreal – in the sense of infusing the known with the unknown, certainly in ways never heard before in a popular song. Phantasmagoric images flew by as retribution and entered our parlance. Some heard it as arbitrary wording, nonsense. Others called it neologism, a new direction.\n\nNow, 50-some years later, Dylan is receiving the 2016 Nobel Prize in Literature, and the old disputes come back. He’s garnered other prestigious awards in recent years, including a Pulitzer and the 2012 Presidential Medal of Freedom (the latter draped on him by President Obama). A Nobel Prize in Literature, though, represents a lifetime pinnacle – the most distinguished accolade in arts and culture, conferred “for having created new poetic expressions within the great American song tradition” – which is why the decision rubbed some the wrong way. Writing in The New York Times, author Anna North declared: “Bob Dylan does not deserve the Nobel Prize in Literature. … Yes, Mr. Dylan is a brilliant lyricist. Yes, he has written a book of prose poetry and an autobiography. Yes, it is possible to analyze his lyrics as poetry. But Mr. Dylan’s writing is inseparable from his music. He is great because he is a great musician, and when the Nobel committee gives the literature prize to a musician, it misses the opportunity to honor a writer.” It was stupefying to read – tailor-made for one of Dylan’s most famous lines of scorn: “Something is happening here but you don’t know what it is/Do you, Mr. Jones?”\n\nEditor’s picks\n\nDylan’s Nobel validated something momentous for many of the rest of us. Call it a worldview: a cultural and generational movement set off in the mid-1960s that affected people in new and serious ways. Dylan – who later claimed he never wanted to lead any charge – had been crucial to this disruption. His language alone – how he wielded it, opening up songs’ contents and meanings – cleared the territory. He met with derision all along: Mainstream news reporters found both his lyrics and attitude unfathomable. His audience, though, believed that the artist spoke for them, that he was confronting a stultifying world that they were trying to overcome. Fifty years later, Anna North is right when she says that “Dylan’s writing is inseparable from his music.” That was in fact how he changed the times – its arguments and demarcations – and how he transformed modern literature in ways that standalone poetry or prose could not. As a result of his influence, some who might have been authors and poets wrote popular music instead. Among them was Bruce Springsteen, who once said: “When I was 15 and I heard ‘Like a Rolling Stone’ for the first time, I heard a guy like I’ve never heard before or since. A guy that had the guts to take on the whole world and made me feel like I had ’em too. …”\n\nWhat made Bob Dylan such an influential figure and inventive writer? Back in his hometown of Hibbing, Minnesota, where he grew up in a middle-class Jewish family, Dylan was remembered as a kid who wanted to play rock & roll – the kind Buddy Holly and Little Richard did. However, when he showed up on New York’s Greenwich Village folk scene in January 1961, it was as an aspiring folk singer. “I knew that when I got into folk music, it was more of a serious type of thing,” he later said. “The songs are filled with more despair, more sadness, more triumph, more faith in the supernatural, much deeper.” He also had an eye to creating a new self – an imaginary hardscrabble troubadour past. He adopted a hero and model: Oklahoma-born singer-songwriter Woody Guthrie, whose ballads and political songs were remarkable enough to justify any invention. In his 2004 memoir, Chronicles, Dylan wrote about Guthrie in terms that could have described his own effect: “[Guthrie’s] voice was like a stiletto. … [He had a] style of singing that it seemed like no one else had ever thought about. He would throw in the sound of the last letter of a word whenever he felt like it and it would come like a punch. The songs themselves, his repertoire, were really beyond category. They had the infinite sweep of humanity in them.”\n\nRelated\n\nDylan wanted that for himself. He had his eyes and ears open – not just to folk music but, in an autodidactic way, to a vast array of other influences. He scoured friends’ libraries. He read the Roman poet Ovid’s epic history mythology, Metamorphoses, and Athenian general and philosopher Thucydides, in whose History of the Peloponnesian War he saw a study of human nature as the source of wars and massacres. Dylan visited the New York Public Library, where he read newspaper accounts of the Civil War. “Back there,” he later wrote, “America was put on the cross, died and was resurrected. There was nothing synthetic about it. The godawful truth of that would be the all-encompassing template behind everything that I would write.” Along the way – and crucially – Dylan took in the sometimes hallucinatory and maddened poetry of Romantic-era writers Samuel Taylor Coleridge and William Blake; and in particular the defiant work and life of French writer Arthur Rimbaud, who prefigured surrealism. Dylan also – just as crucially – absorbed the Beat Generation’s principal writers, Jack Kerouac (called “the voice of a generation,” like Dylan would be) and poet Allen Ginsberg (who became a good friend). Plus, Dylan took to the wrath and language he found in Old Testament poets and prophets. Wrath, in particular, worked well for him; it formed a frequent viewpoint in his songs, along with contempt and mistrust.\n\nThrough all this gathering, though, it was music – folk, blues, old-time songs, even theater – that formed the lifeblood of Dylan’s sources. In Chronicles, he wrote about seeing a musical production of Bertolt Brecht and Kurt Weill’s songs during his Village years. “The singers were thieves, scavengers or scallywags and they all roared and snarled,” he wrote. In particular, “Pirate Jenny,” from The Threepenny Opera, transfixed him: “This heavy song was a new stimulant for my senses. … I took the song apart and unzipped it – it was the form, the free verse association, the structure and disregard for the known certainty of melodic patterns to make it seriously matter, give it its cutting edge. It also had the ideal chorus for the lyrics. I wanted to figure out how to manipulate and control this particular structure and form.” Delta bluesman Robert Johnson also fascinated Dylan. “I copied Johnson’s words down on scraps of paper,” he said, “so I could more closely examine the lyrics and patterns, the construction of his old-style lines and the free association that he used, the sparkling allegories, big-ass truths wrapped in the hard shell of nonsensical abstraction – themes that flew through the air with the greatest of ease. I didn’t have any of these dreams or thoughts but I was going to acquire them.”\n\nThese influences came to bear fast, as Dylan began writing his own songs. He had a keen awareness of the nation’s moment – the battles, fears and injustices that swept the land and that concerned folk music and its young audience. With “Blowin’ in the Wind” he wrote an indelible lamentation about racial suffering; in “The Times They are a-Changin’,” he recognized generational changes that would prevail and persevere, whether established powers were ready or not. His greatest – and scariest – early song was “A Hard Rain’s a-Gonna Fall,” about the threat of nuclear apocalypse. It was as timeless as a 1600s Scotch border ballad and as visionary as Isaiah, yet its specter of doom was immediate, in precisely the way we feared at that moment: the wasteland of a post-nuclear world. It was also the song that delivered a promise Dylan would always be held to: “Oh, what’ll you do now, my blue-eyed son?” a mother asks. Her son replies: “I’m a-goin’ back out ‘fore the rain starts a-fallin’/I’ll walk to the depths of the deepest black forest/Where the people are a-many and their hands are all empty…, where souls are forgotten…/And I’ll tell it and speak it and think it and speak it and breathe it/And reflect it from the mountain so all souls can see it/Then I’ll stand on the ocean until I start sinkin’/But I’ll know my song well before I start singing.”\n\nBy 1965, Dylan had already written all the anthems he was going to write. He didn’t want to stay contained by the folk movement. He was restless, ready to move on to a greater purpose. Also, other influences were moving in. The Beatles had ignited a new youthful consensus that began to feel its possibilities; the Rolling Stones were making a tougher sound that didn’t fool around, that spoke to the general dissatisfaction of young listeners, to their unrest, their new identity and mounting resistance. Dylan realized it was possible to restyle and enliven his music.\n\nThen, in mid-June 1965, Dylan recorded “Like a Rolling Stone,” and the dam burst. “I’d never written anything like it before,” he said, “and it suddenly came to me that that was what I should do. … After writing that, I wasn’t interested in writing a novel, or a play … I wanted to write songs. … I mean, nobody’s ever really written songs before.” Certainly not like this one. It was majestic and, at six minutes, epic: the longest single that had ever been released. Every early disparate influence seemed part of it, but with a mastery and assembly of language all Dylan’s own. It was full of odd allusions and mysterious symbolism: “You used to ride on a chrome horse with your diplomat/Who carried on his shoulder a Siamese cat/Ain’t it hard when you discovered that/He really wasn’t where it’s at/After he took from you everything he could steal?” What was going on in this song? There was clearly a tale – a rushing soliloquy – at work here, but not a pretty or straightforward one. “Like a Rolling Stone” was, as Dylan himself once described it, about “revenge.” He was targeting a young woman who had been oblivious to the hard realities around her and condescending to others’ pain, though the song also seemed like an attack on established and unexamined social mores. Something else, though, was going on as well – maybe something even the singer wasn’t aware of at the time. The song was a condemnation, and yet in another way it spoke for both its target and the listener: It was scathing but sympathetic. You could identify with the rolling stone.\n\n“Like a Rolling Stone” (Dylan’s biggest hit) framed perfectly the spirit of an emerging generation that was trying to live by its own rules and integrity, and that was feeling increasingly cut off from the conventions and privileges of the dominant mainstream culture. Just as Dylan had once given voice to a new rising political consciousness, he seemed to be speaking to his listeners’ deepest-felt fears and hopes – to be speaking for them. “How does it fee-eel,” he roared, “To be on your own/With no direction home/Like a complete unknown /Like a ROO-olling stone?” How did it feel? It felt scary; it felt exhilarating; and suddenly it felt like everything had forever changed. In the decades since, the question has never stopped: incrimination or manifesto?\n\nThe three albums Bob Dylan made during 1965 and 1966 – Bringing It All Back Home, Highway 61 Revisited and Blonde on Blonde – are chief among the Nobel’s citations of his literary achievement, underscoring their centrality to his work and reputation. Without them there would have been no foundation for the Nobel. (That period of music has occupied 54 CDs of previously unreleased recordings and performance in the past two years, The Cutting Edge 1965-1966: The Bootleg Series Vol.12: Collector’s Edition, and The 1966 Live Recordings.) Interestingly, though Dylan’s ideas and phrasing (both as a singer and writer) felt spur-of-the-moment to our ears at that time, prompting a generation’s impetuosity, he in fact worked on most of it meticulously. He tested each measure of wording, rhythm and inflection for hours, days, until he got it right. He worked like a poet – in ways he never would again – but he had so much more to do than getting the meter or parallelism right: He had to fuse it with music that changed throughout various takes, until everything came together in a finished work.\n\nBut the toll of that bedrock period came fast and hard. The stuff that was building up in his head, spilling into paper and then into voice and then into the air around us, was powerful and unrivaled, but it required a blink-fast pace and an imperishable constitution to plow through it, and though that trajectory was designed for riches and fame, it was not designed for equanimity. In 1965 and 1966 Dylan got booed across America and around the world for playing his howling new electric music. In England, in particular, audiences proved hostile. Some yelled derisively at him and called him names (“JUDAS!”). His language had inflamed arguments as it reshaped the culture around him, and for a short yet historically matchless season, Bob Dylan proved the clearest shot at an individual cultural hero that rock & roll ever produced. Then, on July 29th, 1966, he suffered a motorcycle accident on a road near Woodstock, New York. He retreated to his home in the town, with his wife and children.\n\nThat could’ve been it. Some thought it was. The music Bob Dylan made in 1967 – a mysterious body of songs, made with the Band, known as the Basement Tapes, and John Wesley Harding, works of dignity entirely different in tone and language than what had come before – emerged from the most prolific period of Dylan’s life, though it was also reclusive. Some of it intimated tempests outside: the nation and generations divided, not just by war and rage but also by the spirit of independence and conflict that Dylan had once seemed to write about. Which is to say that Dylan had once written what America became, as if its turmoil and anger had been his prophecy. But now he wanted no part of that. In the years that followed he’d wander into country and pop music; he’d sing domestic bromides and proclamations about staying out of things, watching rivers flow, living in a cabin. Writing in Chronicles about the making of 1970’s New Morning in those years, Dylan said: “Message songs? There weren’t any. … Not today. I felt like these songs could blow away in cigar smoke, which suited me fine.” It was true: He no longer wrote in the language that had pushed back all limits – yet, paradoxically, he was yet a bigger legend than before. People kept looking to him.\n\nIt went that way for a long time, as Dylan made work that fans found confusing. That was nothing new. What was new was that some of this music felt paltry. Then he roared back briefly in the mid-1970s, with the bitter and rueful Blood on the Tracks. The matchless poetry was back – he said he’d had an amnesia but could now write consciously what had once come unconsciously – and the songs again reflected the disillusion in the nation around him and in his own life, as both his marriage and a presidency fell apart: “Idiot Wind,” he sang, “Blowing like a circle around my skull/From the Grand Coulee Dam to the Capitol/Idiot wind/Blowing every time you move your teeth/You’re an idiot, babe/It’s a wonder that you still know how to breathe.” But he moved on yet again, to what he saw as a greater purpose. For a time he made Christian music – preachy and condemnatory – then he set aside overt piety and wandered again in a wilderness. There were occasional peerless songs –”Every Grain of Sand,” “Blind Willie McTell,” “Death Is Not the End,” “Dark Eyes,” “Brownsville Girl”– but nothing hung together for a coherent or defining view. As it turned out, though, Dylan was surveying everything during his peregrinations, narrowing his view on a burned horizon – a desolation road. In 1997 he released Time Out of Mind, a work that resonated in the times as much as Highway 61 Revisited once had. “I’m walking,” he sang at the album’s outset, “through streets that are dead.” It immediately chilled you – it was a weather-worn, haunted, spiteful voice. This man really was walking through dead streets. Maybe they were the streets of our land, all blazed, burned down, under weeping skies. Maybe, a listener suddenly understood, we lived on those streets as well.\n\nTime Out of Mind, from 19 years ago, inaugurated Bob Dylan’s longest and most sustained period of greatness – one that persists today. On the next album, Love and Theft, in the song “Mississippi,” he came even closer to his new mark: “Every step of the way we walk the line/Your days are numbered, so are mine/Time is pilin’ up, we struggle and we scrape/We’re all boxed in, nowhere to escape.” What seeps through the bones of “Mississippi” is a sense of foreclosed history, both American and personal, yet it builds to a majesty of courage. Many of Dylan’s songs in these magnificent latter years insinuate something even braver than his earlier music: There is no center that can hold in our time anymore.\n\nIf Bob Dylan’s songs in the 1960s stormed the way to a new and vital literature, his modern albums have illuminated his trans-historical theme: Dylan has always worried over the moral lacuna. In his 2003 film, Masked and Anonymous, his character said: “Seen from a fair garden, everything looks cheerful. Climb to a higher plateau and you’ll see plunder and murder. Truth is in the eye of the beholder. I tried to stop figuring everything out a long time ago.” Yet his humanity transcends his own hard truths. In Love and Theft‘s “Sugar Baby” he sang: “I got my back to the sun ’cause the light is too intense/I can see what everybody in the world is up against/You can’t turn back – you can’t come back, sometimes we push too far/One day you’ll open up your eyes and you’ll see where we are.”\n\nWhere had our blue-eyed son been? Like the young seer of “A Hard Rain’s a-Gonna Fall,” he’d been walking through terrible lands, and seeing what we might not want to see. This is what great writers do, no matter the era. They tell us where we’ve been, where we are, where we might be headed, as we make our way down timeless and sometimes unfriendly roads. They scare, enlighten and liberate us, they give us unending meanings in new language that help make sense of our world. This is what Bob Dylan does now, as masterfully as he did in 1965 and 1966. This is why he has become America’s greatest writer, in any genre. This is why he won the Nobel Prize, and this is why we celebrate this moment.\n\nWatch the announcement of Bob Dylan winning the Nobel Prize in literature."}, {"url": "https://subjecto.com/flashcards/history-of-rock-roll-final-exam-study-guide/", "page_content": "The Stooges’ sound was characterized by high-volume guitars, heavy drums, and screaming vocals from Iggy Pop, all of which would become models for punk rock musicians. True\n\nThe Ramones had several number 1 albums in the United States. False\n\nPatti Smith would only sing music that was written from a woman’s point of view False\n\nWhat instrument or technique is audible during the last minute of this song? Venus in Furs ostrich guitar\n\nThis song featured: Blitzkrieg Bop simple vocal melodies\n\nThe Velvet Underground and Nico was recorded in: 1966\n\nPatti Smith began her career as a: poet\n\nNico performed on every track of The Velvet Underground and Nico. False\n\nWhich group took out a full-page newspaper ad denouncing Hudson’s department store? The MC5\n\nWhich band included ska, reggae, and rhythm and blues styles in their music? The Clash\n\nWhich band wore suits instead of ripped jeans? The Jam\n\nWhich band included a saxophonist in their lineup? X-Ray Spex\n\nSid Vicious was the lead singer of the Sex Pistols False\n\nMalcolm McLaren was the original drummer for Siouxsie and the Banshees. False\n\nWhich song created national backlash against the Sex Pistols? God Save the Queen\n\n\"Complete Control\" was the first punk rock single ever released. False\n\nIn which song were the drum parts recorded in different takes? Hong Kong Garden\n\nThe Buzzcocks were the political spokespeople of the British punk rock movement. False\n\nWhich band started a label called New Hormones? The Buzzcocks\n\nSeveral members of Sly and the Family Stone had played in James Brown’s band. False\n\n\"Say It Loud—I’m Black and I’m Proud\" was recorded by: James Brown\n\nWhich of the following was NOT a character created by George Clinton? Sweet Sweetback\n\nSoul Train was canceled after only one season. False\n\nParliament and Funkadelic had the same members. True\n\nWhat instrument is prominently featured in this passage? Flash Light synthesizer\n\nWhich artist recorded the soundtrack for Sweet Sweetback’s Baadassss Song? Earth, Wind, and Fire\n\nThe drummer for James Brown’s band was: Clyde Stubblefield\n\nMost of George Clinton’s songs are strophic ballads. False\n\nThe only female members of Sly and the Family Stone were backup singers. False\n\nAll of the following contributed to the rise of disco except the popularity of album-oriented rock\n\nDonna Summer wrote most of her own songs. True\n\nAll of the following songs are by the Village People except \"Disco Duck\"\n\nSaturday Night Fever was released in 1977\n\nThe members of the Bee Gees were brothers. True\n\nThe Bee Gees were created by Jacques Morali. False\n\n\"Love is the Message\" was recorded in Philadelphia\n\nAll of the following were important technological developments connected to disco music except the 45 RPM single ??\n\nThis song includes: love is the message studio musicians from Philadelphia International Records\n\nWhich disco group was created to embody a number of gay stereotypes? The Village People\n\nAll of these bands played at CBGB except Devo\n\nAll of the following were aesthetics of New Wave except high volume and distortion\n\n\"Heart of Glass\" was one of the earliest commercial rap recordings. False\n\nThe Talking Heads posed on the cover of their first album in suits like those of the Beatles. False\n\nThe members of Devo met at Kent State University\n\nWhich group asked Capitol Records to use an older version of its logo on their debut album? The Knack\n\nWhich style of music is evoked in this song?\n\nRock Lobster surf rock\n\nThis song includes all of the following except:\n\nMy Best Friend’s Girl a disco beat\n\n\"Love Shack\" was released in 1979. 1989\n\nWhich style of music is evoked in this song?\n\nHeart of Glass disco\n\nThe Human Be-In was held in: San Franciso\n\nMany psychedelic rock groups borrowed imagery from the writings of Lewis Carroll\n\nJimi Hendrix did all of the following except play three guitars simultaneously\n\nAre You Experienced? Was released in 1967\n\nEric Clapton’s called his definitive guitar style his \"woman tone.\" True\n\nThis song includes all of the following except: Purple Haze a cover of a classic Chicago blues song\n\nCream was the first rock supergroup. True\n\nMarty Balin wrote all of Jefferson Airplane’s songs. False\n\nWho first said, \"Turn on, tune in, drop out\"? Timothy Leary\n\nWhich piece of classical music inspired the form of Jefferson Airplane’s \"White Rabbit\"? Ravel’s Bolero\n\nAcid tests were primarily held in Los Angeles. False\n\nWhich group or artist took their name from an eighteenth-century poem by William Blake? The Doors\n\nWhich member of the Grateful Dead studied classical music composition? Phil Lesh\n\nWhich of the following is true of this song?\n\nBreak On Through it features an organ solo by Ray Manzarek\n\nThe Grateful Dead exclusively played blues. False\n\nDonovan’s music focuses on the dark side of psychedelia. False\n\nDonovan was a San Francisco musician. False\n\nDonovan’s earliest recordings are in the Chicago blues tradition. False\n\nThe first successful free-form FM radio program was produced by Tom Donahue\n\nThe first successful free-form FM radio show occurred in 1967\n\nWhich festival’s slogan was \"\"Three Days of Peace and Music?\" Woodstock\n\nThe Summer of Love’s name comes from? the council organized to care for the people who traveled to the city\n\nNo African American musicians performed at the Monterey Pop Festival. False\n\nWhich of these British bands appeared at Monterey? The Who\n\nAll of the musicians who performed at the Monterey Pop Festival were compensated generously for appearing. False\n\nWhich musician played \"The Star-Spangled Banner\" at Woodstock? Jimi Hendrix\n\nJimi Hendrix performed at Monterey True\n\n\"San Francisco (Be Sure to Wear Flowers in Your Hair)\" was written by Janis Joplin False\n\nWhich group earned their first recording contract after appearing at Monterey? Big Brother and the Holding Company\n\nWhich band hosted Altamont? The Rolling Stones\n\nWhich of these bands included African American members? The Allman Brothers Band\n\nGram Parsons was the first artist to mix country and rock. False\n\nAll of these Bob Dylan albums show influences of country music except Bringing It All Back Home\n\nWhich instrument of technique is prominently featured in this passage?\n\nLay, Lady, Lay pedal steel guitar\n\nLynyrd Skynyrd’s music features a single lead guitar. False\n\nWhich group’s music has humorous lyrics, innuendo, and word play? ZZ Top\n\nGram Parsons recorded with all of these groups except The Doors\n\nDuane Allman died from a drug overdose. False\n\nThe Allman Brothers Band was influenced by modern jazz. True\n\nZZ Top developed the technique of \"trading twos.\" False\n\nTarkus is a concept album about poverty and the Church of England. False\n\nYes was highly skeptical of and critical of spirituality and religion. False\n\nThe leader of Jethro Tull was Ian Anderson\n\nProcol Harum began touring with a symphony orchestra during the 1970s. True\n\nWhich group arranged and recorded a version of the classical suite Pictures at an Exhibition? ELP\n\nKeith Emerson played the Moog synthesizer. True\n\nJethro Tull embraced their identity as a progressive rock band False\n\nIn the Court of the Crimson King was recorded in 1969\n\nGreg Lake was one of the original members of Yes. False\n\nThis song includes: Pinball Wizard a rock opera about a deaf and blind child.\n\nPink Floyd began their career as a psychedelic band\n\nThe following song is sung from the perspective of which character? Another Brick in the Wall Pink\n\nThe Dark Side of the Moon was released in 1973\n\nFrank Zappa’s album We’re Only in it for the Money made fun of the Monkees. False\n\nMike Rutherford played a double neck electric guitar. True\n\nThe Lamb Lies Down on Broadway was a concept album. True\n\nFrank Zappa was British. False\n\nWhich musician pioneered the tapping method on the electric guitar? Steve Hackett\n\nThis song features all of the following instruments except: Shine On You Crazy Diamond Pipe organ\n\nWhich album was a tribute to Syd Barrett? Wish You Were Here\n\nWhy was Miroslav Vitouš fired from Weather Report? He was unable to adapt his playing to the band’s new style.\n\nBebop music was performed in after-hours clubs. True\n\n\"Birdland\" is named for an important New York jazz club. True\n\nWhich bass player is prominently featured in this recording? Birdland Jaco Pastorius\n\nMiles Davis would only play with African American musicians. False\n\nAll of these musicians played on Bitches Brew EXCEPT: Jaco Pastrorius\n\nMany bebop musicians also played in swing orchestras and big bands. True\n\nTwo important musicians in the bebop movement were Charlie Parker and Dizzy Gillespie\n\nChick Corea’s early music with Return to Forever was strongly influenced by Latin music. True\n\nHerbie Hancock’s \"Chameleon\" has an AABA form. True\n\nEddie Kramer was a producer for: Led Zeppelin\n\nRobert Plant wrote \"Whole Lotta Love.\" False\n\nAll of the following are predecessors of hard rock except: bluegrass\n\nWhich group was the first to use the term \"heavy metal\" in their lyrics? Steppenwolf\n\nThis song includes all of the following instruments or techniques except: Whole Lotta Love double bass drum\n\nAll of Led Zeppelin’s albums were named after the group. False\n\nWhich member’s death prompted the dissolution of Led Zeppelin? John Bonham\n\nJimmy Page played his guitar with a violin bow in: \"Dazed and Confused\"\n\nAll early hard rock groups were British. False\n\nMost of Led Zeppelin’s songs were written by: Jimmy Page and Robert Plant\n\nWhich group is often considered the progenitor of heavy metal? Led Zeppelin\n\nWhich guitarist was known for playing guitar solos at incredible speeds? Tony Bourge\n\nThis song is about satanic rituals. I’m Eighteen False\n\nAlice Cooper’s music frequently has the bass, guitar, and vocal lines performing the same riff False\n\nRudolf Schenker was the only member of the Scorpions to appear on every album they recorded. False\n\nAlice Cooper’s live shows often included: a simulated execution of the singer\n\nThe first heavy metal songs were recorded by British bands. False\n\nAll of the following are typical in heavy metal music except: acoustic instruments\n\nBlack Sabbath’s first album was released in: 1970\n\nWhich band combined the American and British styles of heavy metal? The Scorpions\n\nAll of the following songs are about space travel except: \"(Bang a Gong) Get It On\"\n\nIn what year did Kiss Meets the Phantom of the Park air on television? 1978\n\nElton John co-wrote most of his songs with: Bernie Taupin\n\nElton John frequently performed with a bottomless microphone. False\n\nThe most expensive album ever produced was: A Night at the Opera\n\nWhich artist released seven consecutive albums that went to number 1 in the United States in the 1970s? Elton John\n\n\"Rock and Roll (Part Two)\", also known as \"Hey\", was recorded by Gary Glitter\n\nWhich group or artist appeared in comic books and had dolls created in their image? Kiss\n\nT. Rex was originally: acoustic folk duo.\n\nThe subject of this song is:\n\nRock ‘N’ Roll Suicide the collapse of an alien rock star\n\nA subgenre of glam rock was named after Marc Bolan. False\n\nKiss stands for \"Knights in Satan’s Service.\" False\n\nAll of the following were values of glam rock except: stylistic consistency\n\nThe majority of glam rock musicians were British. True\n\nDavid Bowie was a jazz saxophonist early in his career. True\n\nFreddie Mercury wrote all of the songs on A Night at the Opera. False\n\nThe form of this song is based on:\n\nBohemian Rhapsody a style of classical music composition\n\nThe members of Kiss never appeared in public without makeup until the 1980s. True\n\nKiss’s first major hit was: \"Rock and Roll All Night\"\n\nAll of the following were alter egos of David Bowie except: China Girl\n\nThe Velvet Underground’s music featured all of the following except: songs that were under three minutes in length"}, {"url": "https://www.songwriteruniverse.com/america-band-interview-2017.htm", "page_content": "Dewey Bunnell and Gerry Beckley are the two main members of the folk/rock band, America, which formed in 1970. The duo has written the majority of the group’s classic hit songs, which include “A Horse With No Name,” “Sister Golden Hair,” “I Need You,” “Ventura Highway” and “Tin Man.” (The third founding member was Dan Peek, who left the band in 1977 and died in 2011).\n\nAmerica has been a prominent music group since the early 1970s, when they immediately had hit success with their debut album America, and they won the Grammy Award for Best New Artist. It was during the ‘70s and early ‘80s that the band enjoyed steady chart success. Two of America’s albums have been certified platinum (America and Homecoming) and three more albums have gone gold (Holiday, Hearts and Hideaway).\n\nEach of the three, original band members wrote songs and sang lead vocals. Bunnell wrote the hits “A Horse With No Name,” “Ventura Highway” and “Tin Man,” and co-wrote the Top 40 single “The Border” (with Russ Ballard). Beckley wrote the hits “Sister Golden Hair,” “I Need You” and “Daisy Jane.” And Peek wrote the hits “Lonely People,” “Today’s the Day,” and “Don’t Cross the River.” In addition, the band had a Top 10 hit in 1982 with “You Can Do Magic” (written by Russ Ballard).\n\nSPECIAL FEATURE: STREAMING AUDIO https://www.songwriteruniverse.com/wp/wp-content/uploads/2020/03/Dewey_Bunnell_interview_excerpt.mp3 Here’s an excerpt of our interview with Dewey Bunnell of America, who recalls how he wrote their classic hit song, “A Horse With No Name.”\n\nNotably, in the mid to late ‘70s, the band was produced by legendary, Beatles record producer, George Martin. Martin produced seven, consecutive recording projects with them, including five studio albums and a live album.\n\nOver the years, Bunnell and Beckley have remained very active with the band. They’ve continued to write and record, and they tour worldwide, playing 90-100 shows per year. Their touring band includes Rich Campbell (bass & vocals), Ryland Steen (drums) and Andy Barr (guitars, keyboards, banjo). In addition to their Grammy recognition, the group has been inducted into the Vocal Group Hall of Fame, and they received a star on the Hollywood Walk of Fame.\n\nWe are pleased to do this new Q&A interview with Dewey Bunnell and Gerry Beckley of America. They tell how the band started, and how they wrote their classic songs “A Horse With No Name,” “Sister Golden Hair,” “Ventura Highway,” “I Need You” and “Tin Man.”\n\nDK: How did America form as a band?\n\nDewey Bunnell: Gerry, Dan and I were American teenagers going to school in England, and I graduated from an American high school there in 1969. Our fathers were stationed at the U.S. Air Force Base near London. As with most Air Force kids or military families, we moved around a lot. Anyway, we all played guitars, and we had a band there in high school in ’68 and ’69. We played Top 40 stuff, but we quickly got into changing the arrangements a little to suit our voices and do some little tricky things. And that led us into writing original music. We all sort of did it organically by ourselves, because after we graduated from high school, we worked together for a while to make a living at the base facility. Then Dan went off to college in Virginia, and Gerry started to make inroads at a small studio in London. But within six months, Dan came back. He’d written some songs, I’d written a couple songs, and Gerry wrote a couple songs…all of which were ultimately used for the first America album.\n\n\n\nHere is America’s video of their #1 hit, “A Horse With No Name.”\n\nWe would write our own songs, and bring the songs or the seed of the song, to the other two, and then we’d hash them out. So it really just happened without a whole lot of planning or foresight—we were channeling the music we loved. We also started to perform at a couple of pubs at a college, and some places in London and around England, and it just snowballed from there. A key moment was meeting a guy named Jeff Dexter who was the MC at a place called The Roundhouse, which put on big, multi-act shows. Jeff introduced the bands onstage—he was a real savvy, plugged-in London trendsetter. And he lived with a guy named Ian Samwell who was a Warner Bros. executive & producer, and the two of them took us under their wing. Consequently, we ended up with a record deal at Warner Bros. and we did more shows. And before we knew it, Jeff was able to get us on the bill with some pretty heavyweight artists, including The Who and Elton John.\n\nWe also worked very hard producing those records, especially the first album which was the key to everything. We recorded the 10 or 12 songs for the first album, and Warners was keying in on “I Need You” as the first single. And then at the last minute, they said, “Have you guys got any more songs?” So we went back in the studio and we recorded four songs, one of which was “A Horse With No Name.” It was released as a single, and it took off—we were on Top of The Pops (TV show) and we were suddenly on the map.\n\nDK: “A Horse With No Name” is such a distinctive song title. How did you come up with this title and the idea for the song?\n\nBunnell: At first, I called it “Desert Song.” I had spent time in the States with my family traveling in the desert, in New Mexico and in Southern California. I had always been drawn to the desert. My brother and I had spent a lot of our time with the family, exploring the wilderness of whatever state we lived in. We lived in Mississippi, Florida, Nebraska, Massachusetts and California, and we loved animals and fishing. We were always outdoors.\n\nWhen I got to England in 1967 with my family, you know, it was a rainy place. And there wasn’t a lot of wild wilderness like there is in the U.S. So I wanted to write a song about the desert, and I called it “Desert Song.” In the chorus were the words, “a horse with no name.” And I had used that as sort of a vehicle to get out into the desert.\n\nWith songwriting, you’re channeling something…you’re trying to get something out there. You have three minutes to create, in my mind, some imagery. My songs tend to be more visual and with a lot of imagery. You know, “the heat was hot and the ground was dry,” and “there were plants and birds and rocks and things.” That’s what I like to write about. And the aspect of the horse with no name was just a way to get out there in the desert.\n\n\n\nHere’s a video of America performing their #1 hit, “Sister Golden Hair.”\n\nThen it was our manager Ian Samwell, who co-produced the album…he was the one who suggested, “Oh, you must use the line ‘horse with no name’ as the title. It’s a much more gripping title.” And I said, “Sure.” I didn’t even flinch on that one. He also pointed out that there was an opera called Desert Song and it [might be] confusing. So that’s how that worked out.\n\nDK: Gerry, after “A Horse With No Name” was a hit, your song “I Need You” became the next hit. Can you talk about how you wrote that song?\n\nGerry Beckley: It was one of the first songs that I had written. It wasn’t the first song, but it was very early on. One of the things I like to mention about “I Need You,” was that early on we met (hit artist) Harry Nilsson in London. Harry was a dear friend of Derek Taylor (publicist for the Beatles) who was a mentor to us. And Harry was going to record “I Need You” as his follow-up single to his (worldwide) hit, “Without You.” At the time, we had no plans for it—our single was “Horse” and everybody was excited about promoting it. Then of course, we ended up using “I Need You” as the follow-up single. Many years later, Harry did record the song.\n\nDK: “Ventura Highway” was a hit from your second album. Dewey, can you discuss how your wrote this song?\n\nBunnell: Well, as a family we were stationed at Vandenberg Air Force Base in Central California. There were a lot of beaches near there, and our family would drive down to L.A. a lot. One time when we were driving on the highway, my dad had a flat tire. We were right there by the beach, and we hung out while my dad changed the tire. And we were under the freeway sign that said “Ventura.”\n\nLater on when I was back in England, I remembered how much I loved that California coastline, and basically the sun and surf. In my mind, I could see that sign Ventura, and I put together some chords. Then I hummed a melody line over the top. And so that’s the way “Ventura Highway” worked. The writing process was the same formula that I still use today—first, the chord progression, then the melody, and then I start working hard on lyrics.\n\nDK: Gerry, you wrote one of America’s biggest hits, “Sister Golden Hair.” Is there a story behind how you wrote that song?\n\nBeckley: One of the things about “Sister Golden Hair,” apart from the nod to George Harrison—the 12-string acoustic and the slide guitar—is that I had that song written and demoed before the Holiday album, which was our fourth album. But we didn’t use it on Holiday…I’m not sure I even submitted it. I was very happy with the songs I contributed to Holiday, and Holiday went on to be a big hit record for us, with “Tin Man” and “Lonely People” on it. But it does show that sometimes songs can kind of sit in a holding pattern, and “Sister Golden Hair” was recorded for the next album, Hearts, and was a number one record for us. So it all worked out fine.\n\n\n\nHere’s a video of America performing their hit, “Ventura Highway.”\n\nDK: Dewey, another hit song you wrote was “Tin Man.” Was this song partially inspired by the character from The Wizard of Oz?\n\nBunnell: Absolutely, that’s still my favorite movie of all time. It embedded itself in my psyche as a young kid, and I just can’t ever shake that. It was an inspiring film, and of course it had all the messages…that we all have our brain and our heart and our courage if we look inside. It was a beautifully made film, and I loved the film’s fantastic transition from black & white to color. Life can be that way; it’s either black & white, and you can turn it into color if you work in that direction.\n\n“Tin Man” was really the first song we did with (legendary Beatles producer) George Martin. So it has a special place in our history. Also, George played the key piano [hook] on that song.\n\nDK: How many of your albums did George Martin produce?\n\nBunnell: He’s credited for seven albums, five which were studio albums of original material, and he remixed our greatest hits project and then we did a live album. We had a long, beautiful relationship with George, and all of the projects were great. He liked to record in different places, so we made an album at the Caribou Ranch in Colorado, in Hawaii, in London, in San Francisco & Los Angeles, and in the Caribbean in Montserrat. It was a wonderful time; we really look back at the George Martin years as very special.\n\nDK: As a producer, what did George Martin bring to the band that you really liked?\n\nBeckley: Well, he brought focus back to the process. There’s so much that’s been said and written about George, and his incredible body of work. His work with the Beatles was a wonderful inspiration to us.\n\nWe had been producing ourselves for the first three albums, and it was becoming a bigger and bigger job. We were starting to use arrangements and outside arrangers for strings and things. So we had a discussion, and we thought it was probably best to turn this over to somebody that we all agree would be the right guy, which of course was George. He was really great at keeping us focused and moving forward.\n\nBunnell: He had a steady hand. He and his engineer, Geoff Emerick (who also worked on many Beatles albums), had a lot of stored experience and knowledge about the studio and drum sounds, and how to get them. And then in the arrangement process, George became another element in that. And above all, he had the orchestrations that we began using a lot more of. He would write beautiful pieces for specific songs. George made the process really fun—we had a great history with him.\n\n\n\nHere’s a video of America performing their hit, “I Need You.”\n\nDK: I looked at your band’s songwriting credits, and it looks like most of the songs were written individually by you, Dewey or Dan Peek. Did each of you prefer to write songs separately?\n\nBeckley: Yeah, we were all writing independently. Fortunately, we were all writing pretty good material. Very early on, we kind of established that [our band] was going to be this combination of different writers and different singers. You can hear how different “I Need You” is from “A Horse With No Name.” And then Dan on the second album wrote “Don’t Cross The River,” which was a very country-flavored song. It doesn’t always work out that way, but in this case, we were all prolific at the time and contributing.\n\nDK: Moving to the current time, you and Dewey have been leading America for several decades now. Can you talk about the band now, and your live shows?\n\nBeckley: This is our 47th year; we still do between 90 and 100 shows a year. That takes is all over the world. It’s been a fascinating life. The travel aspect becomes more fatiguing, but ironically, the shows seem to be more and more rewarding. If you sell out and you see these people up on their feet, you know, you’d be missing something if it didn’t really hit you where it counts.\n\nIt’s a wonderful thing to do this. I always say that it’s our part of the bargain. These people [at our shows] are the people who bought our records, who made them the hits that they are. These people are responsible for getting our kids through colleges and stuff, if you want to look at it that way. And I think our part of the bargain is, we go around and we present this music in the best possible light, and I think that’s a pretty cool arrangement."}, {"url": "https://www.nytimes.com/2020/12/07/arts/music/bob-dylan-universal-music.html", "page_content": "Dylan is the kind of writer whose work music publishers tend to salivate over. Not only has it stood the test of time, but most of his songs were written by Dylan alone and have been frequently covered by other artists — with each use generating royalties. According to Universal, Dylan’s songs have been recorded more than 6,000 times.\n\nMusic publishing is the side of the business that deals in the copyrights for songwriting and composition — the lyrics and melodies of songs, in their most fundamental form — which are distinct from those for a recording. Publishers and writers collect royalties and licensing fees any time their work is sold, streamed, broadcast on the radio or used in a movie or commercial. (The recent sale of Taylor Swift’s first six albums covered only that material’s recording rights. Swift signed a separate publishing deal with Universal in February.)\n\nStreaming has helped lift the entire music market — publishers in the United States collected $3.7 billion in 2019, according to the National Music Publishers’ Association — which has drawn new investors attracted to the steady and growing income generated by music rights.\n\nDylan’s deal includes 100 percent of his rights for all the songs of his catalog, including both the income he receives as a songwriter and his control of each song’s copyright. In exchange for its payment to Dylan, Universal, a division of the French media conglomerate Vivendi, will collect all future income from the songs.\n\nDylan had no comment on the deal.\n\nMusic publishing has been a little-known cornerstone of much of Dylan’s career. The songs he recorded with the Band in 1967, for example, which were widely bootlegged at the time and later collected in Dylan’s 1975 album “The Basement Tapes,” were intended as demos to be shopped to other recording artists.\n\nAnd much of Dylan’s business empire is operated through the Bob Dylan Music Company, a small office in New York that administers his publishing rights in the United States. (Elsewhere around the world, his catalog has been administered by Sony/ATV, which will continue to do so until the expiration of its contract in a few years.)"}, {"url": "https://www.songwriteruniverse.com/jonathan-cain-journey-interview-2018.htm", "page_content": "Songwriter & keyboardist Jonathan Cain has been known as a key member of legendary rock band Journey for over three decades. He co-wrote or wrote many of the group’s biggest hits, including “Don’t Stop Believin’,” “Open Arms,” “Who’s Crying Now” and “Faithfully.” Notably, Cain and the Journey members were inducted into the Rock & Roll Hall of Fame last year (2017).\n\nIn addition to this work with Journey, Cain has recently released his memoir, Don’t Stop Believin’ (published by Zondervan/Harper Collins Books), which recalls his career with Journey and his life story. He has also released new solo album, The Songs You Leave Behind, a collection of 19 songs that serves as an audio companion to his book.\n\nCain was born and raised in Chicago, and then he moved to California in the 1970s. He first joined the band The Babys, which featured lead vocalist John Waite. He then accepted an offer to join Journey in 1980, becoming their keyboard player and songwriting contributor. Following seven years of success with Journey, Cain joined the band Bad English in 1987 after Journey had broken up at that time. Then in 1996, Cain reunited with Journey, and he has been touring and recording with them ever since.\n\nSPECIAL FEATURE: STREAMING AUDIO https://www.songwriteruniverse.com/wp/wp-content/uploads/2020/03/Jonathan_Cain_interview_excerpt.mp3 Here’s an excerpt of our interview with Jonathan Cain of Journey, who tells how he co-wrote their classic hit song, “Don’t Stop Believin’.”\n\nWe are pleased to do this new Q&A interview with Cain. But before we get started, here’s a rundown of his hit credits with Journey, The Babys and Bad English. Cain has co-written or written 16 Billboard Top 30 pop hits, including 13 with Journey. Here’s a list of his Journey hits (mostly written with Steve Perry and Neal Schon): “Don’t Stop Believin’,” “Open Arms,” “Who’s Crying Now,” “Faithfully,” “Separate Ways/World Apart,” “Only The Young,” “Girl Can’t Help It,” “Be Good To Yourself,” “Still They Ride,” “Send Her My Love,” “I’ll Be Alright Without You,” “After the Fall” and “When You Love a Woman.”\n\nFor Bad English, Cain co-wrote the Top 5 hit “Price of Love,” and he also co-wrote their Top 30 single, “Possession.” For The Babys, he co-wrote their single, “Back On My Feet Again.”\n\nCain has also released a number of solo albums, particularly over the past two decades. One of his key solo albums is Back to the Innocence (released in 1995, which includes several songs that are featured in the audiobook edition of his new memoir, Don’t Stop Believin’.\n\nCurrently, Journey is on a major concert tour, co-headlining shows across North America with Def Leppard.\n\nHere is our interview with Jonathan Cain. He discusses his new book and album, and he tells how he wrote the classic Journey songs “Don’t Stop Believin’,” “Open Arms,” “Who’s Crying Now” and “Faithfully.”\n\nDK: You recently released your memoir, Don’t Stop Believin’. Can you tell me about the writing of this book?\n\nJonathan Cain: I was on a bus ride with Ross Valory (bass player of Journey) and I would tell him stories about my old days growing up in Chicago and all the crazy stuff I went through, and he said, “You’ve gotta write a book. Your story’s a good story.” So I guess I took it from there, and I started working on it. I picked up a book by Stephen King called On Writing, and when I finished that I was off and running, because he said everybody has a book in them. But I had no idea how difficult it was to write a memoir. So I just got it all down…I started collecting all the memories, and I remembered everything I wanted to put down. So that was encouraging for me.\n\nI met this book editor, and he helped me find a home for the book; we landed a deal with (book publishers) Zondervan/Harper Collins. They’re a bigtime publisher and they were excited about my story, and they wanted to tell it the way I wanted to tell it.\n\nAlso, the Rock & Roll Hall of Fame (induction ceremony for Journey) was on the horizon (in 2017). It was a blessing, because I would be remiss if I had released the book and not had the Hall of Fame event in the book. The night of the ceremony, I really saw how the book should go. I saw Steve Perry standing next to me, and I remember him and I having this conversation (many years earlier) about writing a song for the ages. We had just met each other, and yet that’s what our dream was. At the time, the Beatles were having their resurgence (when their albums were released on CD), and we were amazed at their sales even 20 years later. And we thought…Wow, what if that happened for us one day? We were a couple guys who had just met each other, and we were marveling at the power of the songs the Beatles wrote, being together for just six years (1964-1970). It was remarkable what they did in six years. And for us, six years seemed to be the period of time that Steve and I and Neal (Schon) hunkered down together and did the big records…Escape, Frontiers and Raised on Radio…those were the big ones. It was pretty crazy that it happened in just six years.\n\nSo as I was standing onstage at the Hall of Fame, it was like the Lord showed me, “Here’s how you begin and here’s how you’ll end” (laughs). And to have the Hall of Fame event come into my life, it made me put everything in its place. I knew then the story I needed to tell, which is encouraging people to have a dream, and that anything is possible. Also, that you’re not what other people say you are…you’re uniquely you. That was my message.\n\nDK: You’ve also released a new album called The Songs You Leave Behind. Can you talk about this album?\n\nCain: This was a kind of prophetic thing…I had been writing these songs about my life. After Steve (Perry) left Journey in 1987, I had to define who I was as a songwriter. Was I just the guy in Journey, or did I have something to say? And I really put myself to it. I wanted to find the guy that wrote “Faithfully,” and I did. I built a studio in my backyard, and I set about making a solo album in the ‘90s. [As it turns out] these songs fit in the audiobook perfectly, because I was defining the crossroads of my life. I wrote songs about the school fire [I survived as a child], almost drowning in a lake, my children being born, my father passing, and even my dog that I loved so much. So all these songs fit in the audiobook perfectly.\n\nThe album (The Songs You Leave Behind) is a collection of 19 songs for the people that love the story of my book Don’t Stop Believin’ that want the whole song. This is because a lot of the songs in the audiobook are only a minute or minute-in-a-half long, and then they fade away. So if you want to hear the whole songs, this album is sort of the partner to the book.\n\n\n\nHere’s a video of Journey (with Steve Perry) performing their hit,\n\n“Don’t Stop Believin’.”\n\nDK: You’ve written many songs for Journey with Steve Perry and Neal Schon. What was the songwriting process for the three of you?\n\nCain: There was a certain preparation. We knew we were going to get together on any given day. We’d come in with something—Steve would have something in his head, I’d have something in mind, and Neal would have something in mind. We all came to the table with something to contribute, and beautifully enough, it worked well. We were on the same wavelength many times. Steve would bring in a melody and I would have the piano part for it. Or one of us would have the chorus, and I would have the lyric and he would have the melody for that lyric.\n\nI remember how we wrote “Who’s Crying Now.” Steve was just humming this thing and snapping his fingers to this groovy thing. Steve sang what sounded like “Wooh ooh, wow ooh wow” and I’m like, “Well it sounds like you’re saying Who’s Crying Now.” And this was me just pulling stuff out of the air and pinning the tail on the donkey and there it is…Boom. Many times, Steve would scat stuff and it would sound like something. And I would ask myself…what did it sound like? Knowing we would get together, we would always try to bring a nugget to the table. We trusted each other enough in that brotherhood, to see the ideas through.\n\nDK: In recent years, “Don’t Stop Believin’” has become Journey’s most popular song. How did you, Steve and Neal write this song?\n\nCain: In a nutshell, I was in Hollywood trying to make it in the ‘70s, [and at the time money was tight and] I had to ask my father for money. My dog got hit by a car, and it was a $1000 vet bill to keep her alive. I worked out a deal with the vet, and then I called my dad and said, “Gosh, I don’t have this money.” I was living month-to-month. So he loaned me some money and I said to him, “You know, I’m gettin’ my butt kicked here…should I come home?” And he said, “Jon, don’t stop believing. We had this vision for you all along since you were a little kid. You’re gonna make it, don’t worry.” And I said, “Okay dad.” So I wrote the words “don’t stop believin’” in my lyric book and kept it with me.\n\nThen years later when I working with Journey on an album, Steve Perry asked if I had any lyrics or melodies that might work for the new album. I went home and paged through all my spiral notebooks. On the last page of my notebook I found three words scribbled: “Don’t stop believin’.” And I thought that could be a good song, and Steve would like the title and love singing that. So I wrote the chorus that night and brought it to rehearsal, and they loved it. Then the three of us kind of wrote the song backwards. Neal came up with the bass line and the B section. We didn’t really know what the lyric was going to be until the next day.\n\n\n\nHere’s a video of Journey (with Steve Perry) performing their hit,\n\n“Open Arms.”\n\nI had the title and most of the lyrics for the chorus, but we didn’t know how we were gonna get there. So we went backwards (working on the verse after writing the chorus first). I shared with them how I grew up and lived in Laurel Canyon in the ‘70s, going down to Sunset Boulevard on a Friday night and seeing the menagerie of hustlers and dreamers and stuff. And I asked, “What if it was like this? This small town girl and this city boy, and they were gonna jump on a midnight train going anywhere.” [We came up with train] because Neal had this staccato guitar line that sounded like a train going somewhere. So it was like dreaming about making it. [We came up with the lyrics] “Some will win and some will lose,” and “the smell of wine and cheap perfume” might as well be the Whisky a Go Go club. And Steve and I were both singers in a smoky room, because we grew up in the nightclubs. So it was sort of a perfect concept for Steve too, so the two of us grafted that lyric and the rest is history. We laid the track down and it was the first song on the Escape album.\n\nDK: Another one of your big hits was the ballad, “Open Arms.” How did you and Steve write this song?\n\nCain: I actually had that song when I came up to San Francisco. I had written the melody and the chorus, and I had lyrics to the chorus but I didn’t have lyrics to the verse. When I landed in San Francisco, Steve wanted to know if I had any ballads. He said, “I really want to sing a ballad on this album, and I’m thinking about making a solo album.” I looked at him and said, “You don’t need to make a solo album. You’ve got Journey, man. You can do anything you want in this band.” And he said, “No, I’m just looking for a ballad I can soar on.” I said, “Well I have a song called ‘Open Arms’.” So I played him the song on a little Wurlitzer piano I’d brought over to his house. Steve loved it and said, “Let’s finish the lyric.” And so we did—in about two hours, the lyrics were done.\n\nThis is one of the first songs that I knew we were a team, because it was so magically easy. Steve and I were on the same wavelength in a lot of ways lyrically. And Neal and I were very close musically. So when I would get Neal’s music, I could give it to Steve and give him some ideas. “Open Arms” was a song that Neal wasn’t part of [the writing], so we brought it in rehearsal, and the band looked at us puzzled, like “What do we do with this?” (because it was a piano ballad). And Steve was so positive—he said, “This is gonna be orchestrated and we’re gonna make it this epic ballad. It’s gonna be soaring…it will be amazing in the arenas.” The song ended up doing very well for us. It’s still the [romantic song] that couples hold on to each other and hug and kiss when they hear it.\n\nDK: A Journey hit that you wrote by yourself was “Faithfully.” What inspired you to write this song?\n\n\n\nHere’s a video of Journey (with Arnell Pineda) performing their hit,\n\n“Faithfully.”\n\nCain: I was feeling distance with my (first) wife. I was the new guy in the band, and one day I was sitting out at an empty arena; we were waiting for our crew. I sat and watched the riggers take down the big stage and I was thinking, “Wow this is crazy, we’re like a circus family.” And I thought about how we all missed our family and loved ones…we all pay a price for the road life. Then I thought…what if we had a song that we could all hold on to each other and say “This is what we do,” and they could send that song home and Journey says, “We’re forever yours…Faithfully.” And so I started writing this song on a bus. I wrote the lyrics on a napkin.\n\nI went to sleep and I woke up the next morning, and I took the napkin with me. I looked at it and I started writing. I wrote the lyrics, line after line. It was pouring out of me. And then I had a little Casio keyboard and I started plunking out the melody. Then I took the song to soundcheck, and I found this big symphony piano and started playing the song. I realized that it was a good song and that I would show it to Steve. I knew he would love it.\n\nSo I played Steve “Faithfully,” but then he said he wanted it for his solo album. And I took the cassette from him and said, “No…it has to be for Journey.” And he said, “Really?” I said, “You write your own album. This is a Journey song.”\n\nThen later on for the Frontiers album (in 1983), the producer called me and said, “We’re gonna cut a ballad. Bring in a ballad tomorrow. I was wondering…how did he know this? I had only played “Faithfully” for Steve. But it was the producer who brought this song into light. Then we recorded it—Neal wrote a chart, Ross wrote a chart…we did three takes. Then Steve said, “I’ll sing it on one condition. You stay away from the studio and let me do my thing with it.” I said, “You got it, sir.” So I think he sang it for a couple of days, and they comped the vocals and called me in and I got chills when I heard it. And that’s how the song came to be. Sreve did an amazing job. And Neal played an amazing guitar solo on it, and he came up with the french horn part.\n\nSome songs you write just get bigger than anything you’d imagine. When we played it live, we started seeing fans coming into the show with signs saying, “We’re forever yours…Faithfully.” And I said, “Alright…that’s it—they can’t kick me out of the band now (laughs).\n\nDK: You’ve been with Journey for almost 40 years now. How would you sum up the experience of being with this band for all these years?\n\nCain: Yeah it’s been 37 years. You know, I guess we became the soundtrack for people’s lives. It’s remarkable to be part of that musical legacy, and then to go into the Rock & Roll Hall of Fame really caps it off. You realize that this music resonates with people, and it’s important to keep it alive. It’s just remarkable and an honor, and you live in that grateful place all the time and just go, “Thank you.” And I give the Lord all credit and praise for my success throughout these years. As I mentioned in the book, it had to be divine intervention to send a kid from Chicago into the Journey camp (laughs). We would write this music, and I had no idea what I was walking into, except the Lord did. He said, “It’s gonna be great, Jon.” (laughs)."}, {"url": "https://www.udiscovermusic.com/playlists/singer-songwriters-the-100-greatest-songs/", "page_content": "In a time long ago – well, sometime before the early 60s – songwriters wrote songs and singers sang them. It was less often that people did both. Of course, there were exceptions; arguably it was the coming of Bob Dylan that signalled a great leap forward for singer-songwriters.\n\nBut, cast your mind back, if you can, to March 1962 and the release of Dylan’s self-titled debut album. Of the 13 songs on the album, just two were written by the Bobster. Five were Dylan’s arrangements of traditional songs, two were other people’s arrangements of traditional songs, and there were covers of Blind Lemon Jefferson, Jesse Fuller, Bukka White and Curtis Jones. It wasn’t until a year later, in May 1963, that Bob’s second album revealed his emerging songwriting talents: 11 of its 13 tracks were Dylan originals. Two months earlier and Lennon and McCartney wrote eight of the 14 tracks on The Beatles’ debut album. It was something of a turning point.\n\nADVERTISEMENT\n\nDylan came out of the folk tradition, and it was the acoustic-folk genre that was – and remains – the spiritual home of the singer-songwriter, where performers tend to provide the sole accompaniment to an entire composition or song, typically using a guitar or piano. The political protest songs of Pete Seeger and Woody Guthrie are what people thought of as singer-songwriters before Dylan, but by 1963 there was a subtle shift that accelerated as the 60s advanced. Even before that time, however, singers such as Hank Williams were forging a place in musical history where they wrote and performed their own songs, though they were often backed by a group, which causes some to forget that Williams was a true singer-songwriter.\n\nGo back a little further and Blind Lemon Jefferson, Blind Willie McTell, Son House and others from the Mississippi Delta were doing just the same in the 30s. Add to that list Robert Johnson, who created a canon second to none of songs that have been covered by countless others ever since. But at the same time, never forget that when Johnson was playing juke joints and house rent parties, he would frequently cover the hits of Bing Crosby who was singing songs from the writers that frequented New York’s Tin Pan Alley. He, like so many performers, was trying to entertain and earn a crust… the covers band and covers singer is a proud tradition. Recently someone posted a video online of a guy with a guitar covering Stevie Wonder’s ‘Superstition’ on stage at a hotel, somewhere in America; Stevie himself was in the hotel and he went on stage to join the unknown performer to sing his own composition. Somehow it feels like the tradition finally came full circle.\n\nWe have tried to come up with the ultimate playlist of the greatest songs performed and written by singer-songwriters. It includes all the usual suspects, From Dylan, Elton and Stevie to Carole King, Joni and Dolly. It also unearths some real gems by singer-songwriters who have crafted superb songs that forced their way into our list.\n\nThere’s Scott Walker’s ‘Such A Small Love’, from his debut solo album; one of Canada’s finest songwriter-singers, Gino Vannelli and ‘Gypsy Days’ Nashville’s Gretchen Peters’ ‘Secret Of Life’, Clifford T Ward’s ‘Home Thoughts From Abroad’ and Stephen Bishop’s ‘On and On’. Which is just what we could do with this list… The 70s was the heyday of the singer-songwriter, but they are as meaningful today as they’ve ever been.\n\nSo what are the 100 greatest songs?\n\n100. Skin – Rag’n’Bone Man\n\n99. This Masquerade – Leon Russell\n\n98. Perfect Day – Lou Reed\n\n97. Okie From Muskogee – Merle Haggard\n\n96. Fidelity – Regina Spektor\n\n95. Actor Out Of Work – St. Vincent\n\n94. Lonely At The Top – Randy Newman\n\n93. Suedehead – Morrissey\n\n92. Southern Nights – Allen Toussaint\n\n91. Chicago – Sufjan Stevens\n\n90. Drop The Pilot – Joan Armatrading\n\n89. Fast Car – Tracy Chapman\n\n88. Luka – Suzanne Vega\n\n87. The Last Living Rose – PJ Harvey\n\n86. Wild World – Yusuf/Cat Stevens\n\n85. Everything Is Everything – Ms. Lauryn Hill\n\n84. Werewolves of London – Warren Zevon\n\n83. Cornflake Girl – Tori Amos\n\n82. Land Locked Blues – Bright Eyes\n\n81. Fast As You Can – Fiona Apple\n\n80. Sailing to Philadelphia – Mark Knopfler\n\n79. Fist City – Loretta Lynn\n\n78. Record Year – Eric Church\n\n77. Traveller – Chris Stapelton\n\n76. Merry Go ‘Round – Kasey Musgraves\n\n75. Royals – Lorde\n\n74. Downtown Train – Tom Waits\n\n73. Where I Stood – Missy Higgins\n\n72. Perfect Skin – Lloyd Cole and the Commotions\n\n71. If It Makes You Happy – Sheryl Crow\n\n70. Free Fallin’ – Tom Petty\n\n69. Going To A Town – Rufus Wainwright\n\n68. Capsized – Andrew Bird\n\n67. American Pie – Don McLean\n\n66. Miss Misery – Elliot Smith\n\n65. For A Change – Chris Difford\n\n64. Maggie May – Rod Stewart\n\n63. On and On – Stephen Bishop\n\n62. Being With You – Smokey Robinson\n\n61. Garden Party – Rick Nelson, The Stone Canyon Band\n\n60. Draw Of The Cards – Kim Carnes\n\n59. The Immigrant – Neil Sedaka\n\n58. Home Thoughts From Abroad – Clifford T. Ward\n\n57. Superstition – Stevie Wonder\n\n56. Life On Mars – David Bowie\n\n55. Song To The Siren – Tim Buckley\n\n54. New Kid In Town – JD Souther\n\n53. The End of Innocence – Don Henley\n\n52. Desperados Waiting For A Train – Guy Clark\n\n51. Boulder To Birmingham – Emmylou Harris\n\n50. She – Gram Parsons\n\n49. Sunday Mornin’ Comin’ Down – Kris Kristofferson\n\n48. Copperhead Road – Steve Earle\n\n47. 1952 Vincent Black Lightning – Richard Thompson\n\n46. The Wreck of Edmund Fitzgerald – Gordon Lightfoot\n\n45. Cat’s In The Cradle – Harry Chaplin\n\n44. Oh My Sweet Carolina – Ryan Adams\n\n43. Chateau Lobby #4 (in C for Two Virgins) – Father John Misty\n\n42. Lost Cause – Beck\n\n41. Sweet Caroline – Neil Diamond\n\n40. Piano Man – Billy Joel\n\n39. On The Road Again – Willie Nelson\n\n38. Wuthering Heights – Kate Bush\n\n37. Rollin’ And Tumblin’ – Muddy Waters\n\n36. Alison – Elvis Costello\n\n35. Let’s Get It On – Marvin Gaye\n\n34. Solid Air – John Martyn\n\n33. Come Away With Me – Norah Jones\n\n32. Jolene – Dolly Parton\n\n31. Your Cheatin’ Heart – Hank Williams, Drifting Cowboys\n\n30. Longer – Dan Fogelberg\n\n29. At Seventeen – Janis Ian\n\n28. Like A Rolling Stone – Bob Dylan\n\n27. The Secret of Life – Gretchen Peters\n\n26. We’re All Alone – Boz Scaggs\n\n25. Gypsy Days – Gino Vannelli\n\n24. Running On Empty – Jackson Browne\n\n23. Pink Moon – Nick Drake\n\n22. Lady-O – Judee Sill\n\n21. Traction In The Rain – David Crosby\n\n20. Fire and Rain – James Taylor\n\n19. Yesterday – Paul McCartney\n\n18. On The Border – Al Stewart\n\n17. Into The Mystic – Van Morrison\n\n16. Field of Gold – Sting\n\n15. Suzanne – Leonard Cohen\n\n14. Heart of Gold – Neil Young\n\n13. Such A Small Love – Scott Walker\n\n12. How Can We Hang On To A Dream – Tim Hardin\n\n11. 50 Ways To Leave Your Lover – Paul Simon\n\n10. Late Night Grande Hotel – Nanci Griffith\n\n9. Constant Craving – k.d. lang\n\n8. Both Sides Now – Joni Mitchell\n\n7. My Sweet Lord – George Harrison\n\n6. Stony End – Laura Nyro\n\n5. You’re So Vain – Carly Simon\n\n4. Imagine – John Lennon\n\n3. It’s Too Late – Carole King\n\n2. Your Song – Elton John\n\n1. Who Knows Where The Time Goes – Sandy Denny\n\nUK English Format:UK English"}, {"url": "https://www.arkansasonline.com/news/2020/aug/30/were-the-bands-songs-written-as-collaborations/", "page_content": "In simplest terms, a song is a succession of musical notes, expressed by a human voice or by an instrument that mimics or suggests a human voice. It doesn't necessarily need words.\n\nLegally, it may be a musical work combined with a literary one. Words and music. The author (or authors) of the song are the people who invent the music and the words. Other components of what we might think of as a song -- harmony, chordal cushioning, rhythm, contrapuntal texturing, feel, etc., are not considered part of the writing of the song, but part of a song's arrangement.\n\nAn arranger, in the eyes of the law, is not an author.\n\nBut let's consider how things actually work in the world. Songs do not always arrive in discrete packages; they are not always the product of an artist retreating to a room with a guitar or a piano and emerging with a lead sheet and lyrics. Often songs come in the heat of collaboration, in a sweaty garage or basement or rehearsal hall where musicians are playing together, investigating the possibility of a beat, of a key. Songs can start with a riff or an offhand joke by the bass player.\n\nIn the world of practice, it is not so easy to define what came from where. It's impossible to engrave your initials on the underside of an idea. The author of a song is the one who files the papers first.\n\nThis matters. In the music business, publishing royalties are important. Owning a song is like owning a business; playing bass or guitar or singing in a band is like working for a wage. Once upon a time you could get rich playing rock 'n' roll music, power chords in 4/4 time. But you could get a lot richer writing classic rock 'n' roll songs.\n\nThere is a simple answer to who wrote The Band's songs. Look at the credits on the first two albums. On 1968's \"Music From Big Pink,\" Robbie Robertson is credited as the sole writer of four songs, \"The Weight,\" \"Caledonia Mission,\" \"To Kingdom Come,\" and \"Chest Fever.\"\n\nRichard Manuel has three solo writing credits (\"In a Station,\" \"We Can Talk,\" \"Lonesome Suzie,\") and a co-write with Bob Dylan (\"Tears of Rage\").\n\nRick Danko is credited, along with Dylan, for \"This Wheel's on Fire.\"\n\nThe Band also covers Dylan's \"I Shall Be Released\" and the Marijohn Wilkin/Danny Dill chestnut \"Long Black Veil.\"\n\nOn the second album, 1969's \"The Band,\" Robertson is credited as the sole author of eight of the 12 songs, shares credit with Manuel on three others and with Levon Helm on \"Jemima Surrender.\"\n\nFrom this we might deduce that Robertson is the primary creative engine for the Band, with others making significant lesser contributions. Had Helm not famously disputed this, had he not vociferously protested that Robertson took advantage of his bandmates who were more interested in the process of music making than the assigning of credit (and future royalties), we would accept Robertson as one of the great rock 'n' roll songwriters.\n\nHelm's position was that Robertson was just the one who filed the papers. And there is something to that -- who thinks of \"Chest Fever\" as anything but a Garth Hudson song?\n\n\"Does it even have lyrics?\" Robertson, its putative lyricist, once asked, and there are accounts of the lyrics been improvised by the singers Helm, Manuel and Danko. Hudson started it out interpolating Bach's Tocatta and Fugue in D minor, and there's a weird part where Manuel is sawing on a violin while Hudson honks on a sax. But J.R. Robertson is listed as the sole songwriter.\n\nThe Band (from top right, clockwise): Richard Manuel on piano, Levon Helm on drums, lead guitarist Robbie Robertson and bass guitarist Rick Danko, take the stage for their final live performance at Winterland Auditorium in San Francisco on Nov. 27, 1976.(AP file photo)\n\nWe will never know. In Sandra B. Tooze's sympathetic new biography \"Levon: From Down in the Delta to the Birth of The Band and Beyond\" (Diversion Books, $28.99) she sets out Helm's position as being that \"the music was a group effort, an amalgamation of all their creativity.\"\n\nThis is no doubt true, though it doesn't preclude the possibility that Robertson was the author of the melody and lyrics to those songs in which he claims sole copyright.\n\nWhat is legal is not always what is fair and ethical. Robertson's version is that he was taking care of business while his bandmates partied and wallowed in drug abuse. He kept The Band going when the others would have frittered the dream away. He has made his case in his 2016 book \"Testimony\" and in Daniel Roher's recent documentary \"Once Were Brothers: Robbie Robertson and the Band.\"\n\nBy way of disclosure, like a lot of people in Arkansas, I had some dealings with and warm feelings for Helm. I've written a lot about The Band. But I understand Robertson's point of view.\n\nYet there's another argument. If Robertson's taking sole credit for \"The Night They Drove Old Dixie Down\" wasn't outright theft, it was at least an egregious case of cultural appropriation.\n\nWhile Tooze tries to remain nonpartisan, the romantic view will always tilt toward the charismatic, easy-flowing Helm over the relatively buttoned-up and occasionally vainglorious Robertson. She gives the final word to Canadian musician David Clayton-Thomas (Blood, Sweat & Tears), who says that \"Music From Big Pink\" really began before the as-yet-unnamed Band retreated to Woodstock, when they were still playing clubs on Toronto's Yonge Street:\n\n\"I know a great deal of that album was Levon Helm. Sure, everyone contributed, but I just knew what a force he was in that band, and there's no way he didn't co-write some of those songs, and he maintained that right up until his death. And I believe him because I was privy to the process of that group and how they worked. Levon definitely was the driving force ...\n\n\"It's more likely Robbie was smart and they were busy partying and drugging ... I would have felt better about it had [Robbie] gotten the publishing but still credited the writers ... I knew how much they contributed.\"\n\nPhillips County native Levon Helm was photographed in 1994 for the Democrat-Gazette’s High Profile section.(NWA Democrat-Gazette/David Gottschalk)\n\nThankfully Tooze's biography, the only major book about Helm apart from the 1993 memoir he wrote with Stephen Davis, \"This Wheel's on Fire,\" doesn't belabor the feud, and does some wonderful work excavating Helm's childhood in Turkey Scratch, thanks largely to extensive interviews with family friends that elevate the book above the sort of clip-job biographies that rely exclusively on secondary sources. (Tooze also relies on a lot of secondary sources. Bravo.)\n\nA wonderfully detailed account of young Levon -- champion tractor driver, indifferent student, irrepressible personality and grace-touched musician -- emerges in the early pages before moving into the more familiar story of how Ronnie Hawkins brought teen-ager Helm with him to Toronto and the lucrative Canadian bar circuit.\n\nThere, as part of Hawkins' backing band The Hawks, Helm grew into an assured multi-instrumentalist, on-stage band leader, and an uncommonly alert and sensitive artist. Tooze, a Canadian who interviewed Helm for her 1997 biography of Muddy Waters, one of Helm's musical touchstones, is very good at limning Helm's musical and show-biz education under the tutelage of Hawkins, who quickly understood that Helm and the other young musicians -- the nascent Band -- he'd collected would eventually outgrow him.\n\n\"They were the best white rhythm and blues band probably in the world at that time,\" she quotes Hawkins as saying. \"They were too musical for me. They got too good.\"\n\nHelm and Robertson were especially close, and even before as The Hawks set out on their own it was apparent that their skills were complementary. Robertson was the cerebral one who could write lyrics, while Helm was an incandescent showman who effortlessly channeled traditional musical styles while imbuing it with his own signature panache. Technically, Robertson was the writer, Helm the arranger. (And, at least in the beginning, the best guitar player in The Hawks. And probably the best bassist.)\n\nTooze understands and explicates Helm's not always obvious gifts, the way \"he laid down his groove at the far end of the beat\" to make a song more danceable; the way he managed great projection with a light touch and maintained a \"slight swing, inhabiting a sweet spot between a shuffle and a straight groove, a technique influenced by Earl Palmer.\"\n\nThere's a lot here that will be familiar to even casual fans of Helm and The Band. But Tooze has done us a significant service -- \"Levon\" is a judicious, tender and remarkably thorough biography of an American icon, a definitive biography of Levon Helm.\n\nEmail:\n\npmartin@adgnewsroom.com\n\nblooddirtangels.com"}, {"url": "https://www.britannica.com/topic/the-Beatles", "page_content": "The Beatles’ first hit was the song “Love Me Do” in 1962, which peaked at number 17 on the U.K. singles charts. The song was released by the record label Parlophone but had been recorded before the band was signed.\n\nBeatlemania was the name given to the popular frenzy surrounding the Beatles after the band’s first appearances on British television in 1963. When the Beatles appeared on American television in 1964, Beatlemania also erupted in the United States. Mass media created the conditions for the collective frenzy that was Beatlemania.\n\nThe Beatles were formed around the nucleus of members John Lennon and Paul McCartney , who first performed together in Liverpool, England, in 1957. They performed with a changing cast of accompanists and under a changing list of band names before settling on their final members and name.\n\nthe Beatles, formerly called the Quarrymen or the Silver Beatles, byname Fab Four, British musical quartet and a global cynosure for the hopes and dreams of a generation that came of age in the 1960s. The principal members were John Lennon (b. October 9, 1940, Liverpool, Merseyside, England—d. December 8, 1980, New York, New York, U.S.), Paul McCartney (in full Sir James Paul McCartney; b. June 18, 1942, Liverpool), George Harrison (b. February 25, 1943, Liverpool—d. November 29, 2001, Los Angeles, California, U.S.), and Ringo Starr (byname of Richard Starkey; b. July 7, 1940, Liverpool). Other early members included Stuart Sutcliffe (b. June 23, 1940, Edinburgh, Scotland—d. April 10, 1962, Hamburg, West Germany) and Pete Best (b. November 24, 1941, Madras [now Chennai], India).\n\nFormed around the nucleus of Lennon and McCartney, who first performed together in Liverpool in 1957, the group grew out of a shared enthusiasm for American rock and roll. Like most early rock-and-roll figures, Lennon, a guitarist and singer, and McCartney, a bassist and singer, were largely self-taught as musicians. Precocious composers, they gathered around themselves a changing cast of accompanists, adding by the end of 1957 Harrison, a lead guitarist, and then, in 1960 for several formative months, Sutcliffe, a promising young painter who brought into the band a brooding sense of bohemian style. After dabbling in skiffle, a jaunty sort of folk music popular in Britain in the late 1950s, and assuming several different names (the Quarrymen, the Silver Beetles, and, finally, the Beatles), the band added a drummer, Best, and joined a small but booming “beat music” scene, first in Liverpool and then, during several long visits between 1960 and 1962, in Hamburg—another seaport full of sailors thirsty for American rock and roll as a backdrop for their whiskey and womanizing.\n\nBritannica Quiz Phenomenon From Across the Pond\n\nIn autumn 1961 Brian Epstein, a local Liverpool record store manager, saw the band and fell in love. Unshakably convinced of their commercial potential, Epstein became their manager and proceeded to bombard the major British music companies with letters and tape recordings of the band, finally winning a contract with Parlophone, a subsidiary of the giant EMI group of music labels. The man in charge of their career at Parlophone was George Martin, a classically trained musician who from the start put his stamp on the Beatles, first by suggesting the band hire a more polished drummer (they chose Starr) and then by rearranging their second recorded song (and first big British hit), “Please Please Me,” changing it from a slow dirge into an up-tempo romp.\n\nThroughout the winter and into the spring of 1963, the Beatles continued their rise to fame in England by producing spirited recordings of original tunes and also by playing classic American rock and roll on a variety of British Broadcasting Corporation radio programs. In these months, fascination with the Beatles—at first confined to young British fans of popular music—breached the normal barriers of taste, class, and age, transforming their recordings and live performances into matters of widespread public comment. In the fall of that year, when they belatedly made a couple of appearances on British television, the evidence of popular frenzy prompted British newspapermen to coin a new word for the phenomenon: Beatlemania. In early 1964, after equally tumultuous appearances on American television, the same phenomenon erupted in the United States and provoked a so-called British Invasion of Beatles imitators from the United Kingdom.\n\nBeatlemania was something new. Musicians performing in the 19th century certainly excited a frenzy—one thinks of Franz Liszt—but that was before the modern mass media created the possibility of collective frenzy. Later pop music idols, such as Michael Jackson in the mid-1980s and Garth Brooks in the 1990s, sold similarly large numbers of records without provoking anything approaching the hysteria caused by the Beatles. By the summer of 1964, when the Beatles appeared in A Hard Day’s Night, a movie that dramatized the phenomenon of Beatlemania, the band’s effect was evident around the world as countless young people emulated the band members’ characteristic long hair, flip humour, and whimsical displays of devil-may-care abandon. Indeed, their transformative social and cultural influence was even recognized among the upper echelons of political power. In 1965 each of the four Beatles was made a Member of the Order of the British Empire (MBE), having been recommended for the honour by British Prime Minister Harold Wilson (and despite a brief storm of protest by some previous recipients, mainly military veterans, against what they perceived as a lowering of the dignity of the royal order).\n\nThe popular hubbub proved to be a spur, convincing Lennon and McCartney of their songwriting abilities and sparking an outpouring of creative experimentation all but unprecedented in the history of rock music, which until then had been widely regarded, with some justification, as essentially a genre for juveniles. Between 1965 and 1967 the music of the Beatles rapidly changed and evolved, becoming ever more subtle, sophisticated, and varied. Their repertoire in these years ranged from the chamber pop ballad “Yesterday” and the enigmatic folk tune “Norwegian Wood” (both in 1965) to the hallucinatory hard rock song “Tomorrow Never Knows” (1966), with a lyric inspired by Timothy Leary’s handbook The Psychedelic Experience (1964). It also included the carnivalesque soundscape of “Being for the Benefit of Mr. Kite!” (1967), which featured stream-of-consciousness lyrics by Lennon and a typically imaginative arrangement (by George Martin) built around randomly spliced-together snippets of recorded steam organs—a tour de force of technological legerdemain quite typical of the band’s studio work in this era.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nIn 1966 the Beatles retired from public performing to concentrate on exploiting the full resources of the recording studio. A year later, in June 1967, this period of widely watched creative renewal was climaxed by the release of Sgt. Pepper’s Lonely Hearts Club Band, an album avidly greeted by young people around the world as indisputable evidence not only of the band’s genius but also of the era’s utopian promise. More than a band of musicians, the Beatles had come to personify, certainly in the minds of millions of young listeners, the joys of a new counterculture of hedonism and uninhibited experimentation—with music and with new ways of life. (Various members of the band in these years flirted with mind-expanding drugs such as LSD and also with exotic spiritual exercises such as transcendental meditation, a technique taught to them by Maharishi Mahesh Yogi, a barnstorming guru from India.)\n\nIn those years the Beatles effectively reinvented the meaning of rock and roll as a cultural form. The American artists they admired and chose to emulate—Chuck Berry, Little Richard, Fats Domino, Elvis Presley, the Everly Brothers, Buddy Holly, the pioneering rock composers Jerry Leiber and Mike Stoller, the influential soul songwriter Smokey Robinson, and, after 1964, folksinger and topical songwriter Bob Dylan—became widely regarded as canonic sources of inspiration, offering “classical” models for aspiring younger rock musicians. At the same time, the original songs the Beatles wrote and recorded dramatically expanded the musical range and expressive scope of the genre they had inherited. Their close vocal harmonies, subtle arrangements, and clever production touches, combined with an elemental rhythm section anchored by Starr’s no-nonsense drumming, created new standards of excellence and beauty in a form of music previously known for amateurism.\n\nAfter 1968 and the eruption of student protest movements in countries as different as Mexico and France, the Beatles insensibly surrendered their role as de facto leaders of an inchoate global youth culture. They nevertheless continued for several more years to record and release new music and maintained a level of popularity rarely rivaled before or since. In 1968 they launched their own record label, Apple; hoping to nurture experimental pop art, they instead produced chaos and commercial failure, apart from the work of the Beatles themselves. The band continued to enjoy widespread popularity. The following year Abbey Road went on to become one of the band’s best-loved and biggest-selling albums.\n\nMeanwhile, personal disagreements magnified by the stress of symbolizing the dreams of a generation had begun to tear the band apart. Once the collaborative heart and soul of the band, Lennon and McCartney fell into bickering and mutual accusations of ill will. By now millions of dollars were at stake, and the utopian aura of the performers was in jeopardy, given the discrepancy between the band’s symbolic stature as idols of a carefree youth culture and their newfound real status as pampered plutocrats.\n\nIn the spring of 1970 the Beatles formally disbanded. In the years that followed, all four members went on to produce solo albums of variable quality and popularity. Lennon released a corrosive set of songs with his new wife, Yoko Ono, and McCartney went on to form a band, Wings, that turned out a fair number of commercially successful recordings in the 1970s. Starr and Harrison, too, initially had some success as solo artists. But, as time went by, the Beatles became as much of a historical curio as Al Jolson or Bing Crosby or Frank Sinatra or Elvis Presley before them.\n\nIn 1980 Lennon was murdered by a demented fan outside the Dakota, an apartment building in New York City known for its celebrity tenants. The event provoked a global outpouring of grief. Lennon is memorialized in Strawberry Fields, a section of Central Park across from the Dakota that Yoko Ono landscaped in her husband’s honour.\n\nIn the years that followed, the surviving former Beatles continued to record and perform as solo artists. McCartney in particular remained musically active, both in the pop field, producing new albums every few years, and in the field of classical music—in 1991 he completed Liverpool Oratorio; in 1997 he supervised the recording of another symphonic work of large ambition, Standing Stone; and in 1999 he released a new classical album, Working Classical. McCartney was knighted by the queen of England in 1997. Starr was also very visible in the 1990s, touring annually with his All-Star Band, a rotating group of rock veterans playing their hits on the summertime concert circuit. Beginning in 1988, Harrison recorded with Bob Dylan, Tom Petty, Jeff Lynne, and Roy Orbison in a loose amalgam known as the Traveling Wilburys, but, for most of the 1980s and ’90s, he had a low profile as a musician while acting as the producer of several successful films. After surviving a knife attack at his home in 1999, Harrison succumbed to a protracted battle with cancer in 2001.\n\nEarly in the 1990s McCartney, Harrison, and Starr had joined to add harmonies to two previously unreleased vocal recordings by Lennon. These new songs by “the Beatles” served as a pretext for yet another publicity blitz, aimed at creating a market for a lavishly produced quasi-historical series of archival recordings assembled under the supervision of the band and released in 1995 and 1996 as The Beatles Anthology, a collection of six compact discs that supplemented a 10-hour-long authorized video documentary of the same name. A compilation of the band’s number one singles, 1, appeared in 2000 and enjoyed worldwide success, topping the charts in such countries as England and the United States. The afterglow of Beatlemania may have disappeared, but the iconography of an era of youthful tumult had been reverently preserved for posterity.\n\nThe Beatles were inducted into the Rock and Roll Hall of Fame in 1988, and Lennon (1994), McCartney (1999), Harrison (2004), and Starr (2015) were also inducted as individuals. In September 2009, specially packaged digitally remastered versions of the Beatles’ entire catalog and a Beatles version of the popular electronic music game Rock Band were released simultaneously. After it was reported in February 2010 that the financially troubled EMI was soliciting buyers for its Abbey Road Studios, where the Beatles made the great majority of their recordings, the British Department for Culture, Media, and Sport declared the recording complex a historic landmark. EMI subsequently announced that it would retain ownership of the iconic studio while seeking outside investment to improve its facilities."}, {"url": "https://bob-dylan.org.uk/archives/2220", "page_content": "By Tony Attwood\n\nIn my earlier article on how Dylan writes songs I outlined the notion that there are at least seven different types of art ranging from representational art to religious art. In that article I quoted from Dylan’s interview for Rolling Stone in which he gave a fairly clear indication of his religious convictions.\n\nNow I want to move on to the speech Dylan gave at the Musicare Awards in which he gave as detailed account as he ever has on his writing and where the songs come from. This speech was interesting, for it was Dylan’s chance to contradict the Rolling Stone interview and say, for example, “You’re right – all these characters in these songs are all coded messages to do with the need to follow what is laid down in the Bible,” but he didn’t. Instead he continued the theme of the interview, revealing the influences that worked upon his songs.\n\nRight at the start of the speech he said,\n\n“These songs of mine, they’re like mystery stories, the kind that Shakespeare saw when he was growing up. I think you could trace what I do back that far. They were on the fringes then, and I think they’re on the fringes now.”\n\nThe stories Dylan refers to are generally known (at least in the UK) as the Mystery Plays or Miracle Plays – cycles of plays in verse which dramatised stories from the Bible. Each town or city had its own cycle of plays – the most famous being the 48 play cycle from York. They would be performed over a number of days, and in the larger towns in several locations around the town.\n\nWhat one has to remember is that the audience of the day so no other dramatic entertainment, so when the characters (including God) got onto stage, this was real to the audience. They literally had never seen anything like it. Think perhaps of little children going to a theatrical performance for the first time today. To them, there is nothing to distinguish what they are seeing on stage with what they see day by day. All is real.\n\nThere is indeed a lot of evidence that the plays were performed across the country, so Shakespeare may well have seen them in Stratford on Avon as a child, and known of them in London when he moved there in the late 16th century.\n\nThe Miracle Plays were also the blockbuster productions of their day, costing huge amounts to put on, and often sponsored by guilds where the story could be used to show a trade or profession in a particularly positive light. As a result the performances were entertainment, advertising, and the truth of the Christian story all mixed up as one.\n\nToday we don’t necessarily associate religious festivals with humour and energy, but the Mystery Plays had lots of these. Over the years the plays evolved and were re-written, and their “ownership” if there was any, was by the current performers.\n\nDrama was the key, and so the fall of Adam, the murder of Abel and Noah’s flood etc were there to be used as New Testament events – and were often liked because of their vitality.\n\nThinking of this it is not too hard to see what Dylan was saying; he’s taking the myths and legends of his time and re-working them into stories, using the dominant medium of today that appeals to his chosen audience – the popular song – just as the Mystery Plays took theatre as their method of presentation.\n\nIf we just look at a few of the songs from 1962, the year in which Dylan wrote the first songs that are still widely recognised today, we can see that he is indeed this sort of story teller – and one blessed with an ability to tell stories in an incredibly varied way.\n\nBallad for a friend tells us of the death of a friend, while Talkin’ John Birch Society Blues makes fun of the far right wing. Blowing in the wind tells us to look out to the wider world to find what we want, but Corrina Corrina brings us back to the heart with a simple tale of lost love as does Tomorrow is a long time And all this comes before the anti-war protest song Hard Rain’s a gonna fall and the desperate sadness and awfulness of life for the impoverished farmer in the Ballad of Hollis Brown and all this is followed (in terms of the order the songs were written in) by Don’t think twice the archetypal song of leaving, and then the protest against racism, Oxford Town – again told not as a “this is terrible dont do this” song, but as a story.\n\nWhat Dylan is saying here is that he’s a story teller, and just as the original performed entertainments were in the style suitable for the day (religious tales acted out on temporary stages) so he started out as the storyteller with his guitar.\n\nThat then is the background – how he saw himself – as the story teller talking to the masses. But in the next section of the same speech Dylan also gave us a clue as to how the songs came out as they did. As he said,\n\n“These songs didn’t come out of thin air. I didn’t just make them up out of whole cloth. Contrary to what Lou Levy said, there was a precedent. It all came out of traditional music: traditional folk music, traditional rock ‘n’ roll and traditional big-band swing orchestra music.\n\n“I learned lyrics and how to write them from listening to folk songs. And I played them, and I met other people that played them back when nobody was doing it. Sang nothing but these folk songs, and they gave me the code for everything that’s fair game, that everything belongs to everyone.\n\n“For three or four years all I listened to were folk standards. I went to sleep singing folk songs. I sang them everywhere, clubs, parties, bars, coffeehouses, fields, festivals. And I met other singers along the way who did the same thing and we just learned songs from each other. I could learn one song and sing it next in an hour if I’d heard it just once.\n\n“If you had sung that song as many times as I did, you’d have written “How many roads must a man walk down?” too.”\n\nDylan was undoubtedly referring to two things here. One is the obvious link between “John Henry said a man ain’t nothin’ but a man” and “How many roads must a man walk down before you call him a man?” and the other is the overall concept of the song in talking about the world around us, the world we experience.\n\nDylan continued…\n\n“Big Bill Broonzy had a song called “Key to the Highway.” I’ve got a key to the highway / I’m booked and I’m bound to go / Gonna leave here runnin’ because walking is most too slow. I sang that a lot. If you sing that a lot, you just might write, Highway 61.”\n\nOf course there’s no immediate link between Key to the Highway and “He asked poor Howard where can I go, Howard said there’s only one place I know, Sam said tell me quick man I got to run, Howard just pointed with his gun, And said that way down on Highway 61,” but there is the sold link with the blues (Highway 61 being the blues highway) and\n\nWhen the moon peeks over the mountains\n\nI’ll be on my way.\n\nI’m gonna roam this old highway\n\nUntil the break of day.\n\nOf course Dylan is exaggerating when he says, that “You’d have written [Highway 61] too if you’d sang “Key to the Highway” as much as me, but he is again giving us two big indications to what his work was all about. It was seeing himself as the theatrical story teller, and the man who was utterly immersed in the folk and blues music that had gone before him.\n\nHe is talking here not only about themes, but also about feel – the particular implication that the lonesome highway has for the men and women whose music he listened to time and time again and into whose culture he moved.\n\nThus we have a clear indication from Dylan as to where he sees himself coming from and what his music is about: Dylan the storyteller, Dylan the inheritor of America’s popular musical traditions, Dylan the travelling showman tracing his performances back to mediaeval England.\n\nI’ll continue my investigation in the next article\n\nAll the songs reviewed on this site\n\nDylan’s work in the chronological order in which the songs were written."}]}