{"After college, Dan Stearns moved to New York City and formed The Lemonheads in 1992.": [{"url": "https://www.nytimes.com/2021/05/15/style/new-york-city-future.html", "page_content": "“It’s a ghost town,” former President Donald J. Trump said of New York City last fall during a presidential debate. “It’s dying, everyone’s leaving New York.”\n\nHe was not the only one who saw all the closed storefronts and empty offices, and wrote it off.\n\n“It’s completely dead,” said the self-help author and provocateur James Altucher in a blog essay called “New York Is Dead Forever … Here’s Why” that was endlessly dissected, and mocked, last summer.\n\n“Businesses are remote and they aren’t returning to the office,” he wrote. “And it’s a death spiral.”\n\nThe notion that New York and other big cities were becoming obsolete was trending everywhere. The basic argument was that there is little need to put up with crazy rents, overpriced restaurants and packed subways in the era of digital nomads."}, {"url": "https://wams.nyhistory.org/growth-and-turmoil/growing-tensions/marsha-p-johnson/", "page_content": "Marsha P. Johnson was born on August 24, 1945, in Elizabeth, New Jersey. She was identified as male at birth. However, young Marsha enjoyed wearing clothing made for girls. After a boy sexually assaulted her, she stopped wearing the clothes she loved and felt most comfortable in. After graduating high school, Marsha moved to New York City with only $15 and a bag of clothes. She began dressing almost exclusively in women’s clothes and adopted the full name Marsha P. Johnson. The “P” stood for “Pay It No Mind.” To her, this was a life motto and a response to questions about her gender. Today, historians and former friends of Marsha describe her as a trans woman. During Marsha’s lifetime, the term transgender was not commonly used. Marsha described herself as a gay person, a transvestite, and a drag queen. She used she/her pronouns. Marsha was part of a growing community of LGBTQ youth who sought acceptance in New York City. But in the 1950s and 1960s, LGBTQ people’s rights were strictly limited. For example, dancing with a person of the same sex as well as cross-dressing were illegal. It was difficult for Marsha to find work. She realized that the fastest way to make money was to “hustle.” This meant working as a sex worker; The work, due to stigmatization of sex workers, was incredibly dangerous. Marsha was often alone with strangers in hotel rooms and cars. Sometimes, the strangers were violent. On multiple occasions, clients pulled guns on Marsha. Once, she was even shot.\n\nMarsha spent most of her life without a permanent home. She slept in hotel rooms, restaurants, and movie theaters. She sometimes lived with friends. Even when she found work waiting tables or performing in drag shows, she still made most of her money as a sex worker. Not long after arriving in New York, 17-year-old Marsha met 11-year-old Sylvia Rivera. Sylvia was a Puerto Rican trans woman who was also new to New York. The two became instant friends. Marsha taught Sylvia how to apply makeup, live on the street, and look out for trouble. She also encouraged Sylvia to love herself and her identity. Marsha enjoyed expressing herself through her appearance. Her lavish outfits were often made from thrift store finds, gifts from friends, and items she found on the street. She also created and wore elaborate crowns of fresh flowers. Marsha’s life dramatically changed when she found herself near the Stonewall Inn in the early hours of June 28, 1969. That night, police officers raided the gay bar. As the officers began to arrest people for violating various discriminatory laws, the patrons of the Stonewall fought back. While there are many conflicting stories about the uprising’s start, it is clear that Marsha was on the front lines. In one account, she started the uprising by throwing a shot glass at a mirror. In another, she climbed a lamppost and dropped a heavy purse onto a police car, shattering the windshield. Young trans women like Marsha were particularly vocal that night because they felt they had nothing to left to lose. Their rage was not just about the police. It was about the oppression and fear they felt every single day.\n\nDarling, I want my gay rights now. I think it’s about time the gay brothers and sisters got their rights . . . especially the women.\n\nThe Stonewall uprising was an awakening for an entire generation of LGBTQ activists. Soon, Marsha was attending rallies, sit-ins, and meetings of the newly formed Gay Liberation Front. She was excited about the work but frustrated at how white gay men and lesbians dominated the conversation. She questioned where transgender people fit in. Transpeople were more likely to be homeless and targeted by police. The movement did not appreciate the extent to which transgender youth needed help and support. In 1970, Sylvia came to Marsha with an idea. She wanted to protect young transpeople living on the street by giving them a home. She asked Marsha to help her create a place where they could feel safe, unite, and fight for their rights. Marsha and Sylvia later formed the Street Transvestite Activist Revolutionaries (STAR). The first STAR House was in the back of an abandoned truck in Greenwich Village. Nearly 24 young people called the truck home. Sylvia and Marsha hustled every night to make sure their new family had breakfast each morning. One morning, they returned to the truck just as it was pulling away with STAR residents sleeping inside. Apparently, the truck was not abandoned after all. As they watched their “kids” jump from a moving truck, Marsha and Sylvia realized they needed a real home. They rented a dilapidated building with no electricity or running water. They fixed up the building and paid rent for nearly eight months. When they could no longer pay, they were evicted. But the impact of STAR had already been felt by many. Even without lodgings, STAR provided a safe haven for people who had never had a place to call home. As the gay liberation movement became increasingly white, middle class, and cisgender, STAR reminded everyone that transgender and gender non-conforming people deserved equal rights too. When the organizers of the gay pride parade tried to ban STAR, they showed up anyway. In 1975, artist Andy Warhol crossed paths with Marsha and photographed her for his Ladies and Gentleman series. When a Warhol screen-print of Marsha went on display in a Greenwich Village store, Marsha took some friends to see it. The store owners called her riffraff and threw her out.\n\nMarsha’s whole life seemed to be a balance between popularity and exclusion. Throughout Greenwich Village, she was known as “Saint Marsha.” Locals admired her ability to truly be herself. Marsha had a reputation for being generous and kind. She gave people clothes and food, even though she had little of her own. Despite her popularity, Marsha also lived a life of poverty and danger. She was arrested over 100 times. She believed no one should hustle or live on the streets, but she knew no other way to survive. In 1990, Marsha contracted AIDS. She spoke publicly about it and told people she hoped they would not be afraid of those who had the disease. On July 6, 1992, Marsha’s body was found floating in the Hudson River. The police officers ruled her death a suicide. Marsha’s friends and acquaintances strongly disagreed. They thought it was more likely that Marsha was a victim of an attack. Trans women, particularly women of color, were regular targets of hate crimes. The LGBTQ community was furious the police did not investigate her death. At Marsha’s funeral, hundreds of people showed up. The church was so full that the crowd spilled into the street. The case involving Marsha’s death remained closed for decades. In 2012, the New York City Police Department finally agreed to re-open it, yet the case still remains unsolved. Since then, Marsha has become an icon of the transgender community. In 2019, New York City announced that a statue of Marsha and Sylvia would be the first monument to honor trans women in the city. In 2020, New York State named a waterfront park in Brooklyn after Marsha.\n\nVocabulary\n\nAIDS: Acronym for Auto Immune Deficiency Disorder. An infectious disease that attacks a person’s immune system and can be difficult to treat.\n\ncisgender: A person who identifies with the sex they were assigned at birth.\n\ncross-dress: To wear clothes typically associated with a different sex and is most commonly used to describe men who wear make-up and women’s clothing.\n\ndrag queen: A performance artist who typically dresses up like a woman for entertainment purposes.\n\ngay: A man attracted to men.\n\nlesbian: A woman attracted to women.\n\nLGBTQ: An acronym that stands for lesbian, gay, bisexual, transgender, and queer and is an umbrella term for the community of people whose gender and sexual identities exist outside of heteronormative expectations.\n\ntrans woman: A person who was assigned male at birth but identifies as a woman.\n\ntransgender: A person who does not identify with the sex they were assigned at birth. A term for all trans men and trans women.\n\ntransvestite: A term to describe people who wear clothes designed for the opposite sex. While it was in use during Marsha’s life, this term is now considered offensive and has been replaced with other terminology, such as transgender. Note: Marsha’s life story includes a large amount of vocabulary that may be unfamiliar to teachers and students. To learn more, check out the vocabulary resource guides from GLAAD: Transgender glossary and LGBTQ glossary."}, {"url": "https://www.popsugar.com/smart-living/how-i-moved-to-new-york-city-after-college-47173845", "page_content": "When I decided to buy a one-way plane ticket and give myself a month to move from California to New York City, there was a general consensus amongst my friends that what I was doing was crazy, but it didn't feel that way to me — and that's why I'm writing this from a cute cafe in Brooklyn. All that my big decision and move required was a few steps of preparation and a willingness to take an adventure. Here is how I did it; hopefully it helps you do the same.\n\n1. Prepare Mentally\n\nIn my experience, this is the most important step. I spontaneously bought the plane ticket that would take me to New York, but I probably thought about the idea of moving there for about three years before getting to that step. At the beginning of my senior year in college, like everyone else, I was thinking about the job market and where I should go. I majored in journalism and creative writing and needed to live somewhere with an ample amount of writing opportunities. Los Angeles crossed my mind since I grew up in the area and have family there, but something was telling me New York would be a better fit. Still, I knew the wish to move to New York wasn't enough. I had to take a few steps before making the move across the country, but the first step was to know exactly that.\n\n2. And Prepare Financially\n\nWhen I first thought about moving to New York, I knew I would need to save a lot of money — a writer living in one of the most expensive cities in America? Whew. So I decided I would go home to California after graduation for the free rent (I was lucky to have that option!) and to get a customer service job that would allow me to save. Even at this point I wasn't completely sure about New York, so I thought this time would also help me figure out how I really felt about it (and see if my parents were into the idea as well).\n\nAfter I worked and saved for about six months at home, I had enough money in my bank account to buy my ticket. The more I romanticized my decision and fantasized about the future, the farther I got from really taking action. There were times when I thought about living my \"I came to New York with one dollar and a dream!\" fantasy, but I was lying to myself. If I wanted to make and survive the move, I would need to line up as many job opportunities as I could.\n\n3. Research the City and What You'll Need to Live There\n\nPreparing for this move reminded me of how I would prepare for the public speaking class I took in high school. I researched . . . a lot! My anxiety flares up when I feel uninformed on the subjects I'm discussing and the decisions I'm making. So in the weeks leading up to buying my ticket, I watched hours of \"How I Moved to New York\" Youtube videos to gather information on rent prices in different neighborhoods. I thought about the weather and how much a legitimate Winter jacket would cost, because I knew my teddy coat was only useful in Southern California. I had no friends or relatives living in the city and I would have to rely on myself, which meant I would survive only if I prepared as much as I possibly could.\n\n4. Just Do It\n\nThe last three steps are what turned this formidable and daunting move into a realistic goal, and once I had everything else in place, it was up to me to take action. I could have done more research and saved more money forever, but I believed in myself, so I just bought the ticket. After I prepared, there was nothing stopping me except for myself.\n\nI've been in New York for a little over a month and I've cried multiple times, but in no way, shape, or form do I regret my decision. I'm proud of myself for handling something like this and tackling such a daunting task. My advice is to trust yourself, even if that means listening to that little voice in your heart saying you are so not ready. Daunting tasks are way less scary when you believe in your intuition and don't let your brain get fogged up with unlikely possibilities."}, {"url": "https://medium.com/the-post-grad-survival-guide/i-regret-moving-to-new-york-city-after-college-4cd3f9e6f54a", "page_content": "I landed on Wall Street — specifically, in a lucrative career of Investment Banking. I hated it. I pulled 100+ hour work weeks. I hardly ever saw my friends. I was crushed beneath multiple mental breakdowns.\n\nHowever, each time I considered quitting I couldn’t stop thinking of my rent, my student loans, or the other hundreds upon thousands of dollars I was expected to spend each month to maintain my livelihood in New York City.\n\nIt’s no secret that New York is among one of the most expensive cities in the United States. According to PayScale, New York’s cost of living is 129% higher than the national average with housing expenses being 369% higher than the national average. But, as the new Wolf of Wall Street, I felt invincible.\n\nThe reality is that I had no idea what I was up against. The immense pressure of the City coupled with the psychological impact took a strong hold of me. The wolf had become a lamb."}, {"url": "https://archive.nytimes.com/dealbook.nytimes.com/2014/07/29/wall-street-bids-farewell-to-alan-greenberg/", "page_content": "Photo\n\nAlan D. Schwartz, the head of Bear Stearns during its final days in 2008, put his arm around Leslie Moonves, the chief of CBS, who stiffened his bottom lip.\n\nOnce the casket had traveled down the aisle, Mr. Schwartz spotted Nelson Peltz, the white-haired activist investor, and saluted him.\n\n“It’s great you’re here,” Mr. Schwartz said. “He would have loved it.”\n\nA selection of Wall Street’s old guard, including many alumni of Bear Stearns, turned up on Tuesday at a temple on Manhattan’s Upper East Side to bid farewell to Alan C. Greenberg, the longtime leader of Bear Stearns and the embodiment of its risk-loving culture, who died on Friday at 86.\n\nThe service began on time at 11 a.m. and lasted just about an hour, honoring the no-nonsense style of Mr. Greenberg, who was known as Ace. The mourners recalled his idiosyncratic business advice, his love of big-game hunting and his magic tricks. A representative of the Society of American Magicians, as is customary, snapped Mr. Greenberg’s magic wand in two.\n\n“What Ernest Hemingway was to the world of 20th century literature, Alan Greenberg was to the world of 20th century finance,” Ronald B. Sobel, the senior rabbi emeritus, told the assembly. “Both were intrigued by bulls — Hemingway by the bulls of Spain and Alan by the bulls of Wall Street.”\n\nBulls and bears alike filled the benches of Temple Emanu-El, a sea of dark and finely tailored suits. Samuel Molinaro Jr., who was the chief financial officer of Bear Stearns when it collapsed under the weight of soured mortgage bets, greeted former colleagues. John A. Paulson, the hedge fund manager who made a fortune during the crisis by betting against mortgages, was also in attendance.\n\nJohn A. Catsimatidis, the billionaire owner of the Gristedes grocery store chain, who last year ran for mayor of New York, called Mr. Greenberg “the last of his kind,” adding that “you could shake hands with Ace, and know you didn’t have to have anything in writing.”\n\nJPMorgan Chase, the bank that bought Bear Stearns in a fire sale, and where Mr. Greenberg kept an office, provided buses from the temple to its headquarters on Park Avenue.\n\n“I think 98 percent of the people who knew him are here,” said Elliot Wolk, 79, a longtime trader at Bear Stearns. “Except probably one.”\n\nHe was referring to James E. Cayne, Mr. Greenberg’s successor at Bear Stearns and his onetime friend. The two went through a messy split as Bear Stearns stumbled, with Mr. Greenberg blaming his former protégé for the firm’s problems.\n\nMr. Schwartz, who took over from Mr. Cayne in early 2008, brushed the feud aside, saying the topic should be avoided.\n\n“When something like Bear happens, there’s always going to be some disagreements,” said Mr. Schwartz, who is now the executive chairman of Guggenheim Partners. “Don’t go there.”\n\nAlan Greenberg’s 2012 interview with Bloomberg Television on the final days of Bear Stearns.]\n\nThe service attracted a number of business titans. (A reporter for BuzzFeed said he spotted Donald Trump arriving late through a side door.) On the lips of many were tales of an earlier era on Wall Street, when investment banks were privately held by their partners.\n\nMr. Schwartz, who joined Bear Stearns in 1976, said Mr. Greenberg offered him a place to stay for a few months when he moved to New York in 1978. E. John Rosenwald Jr., a longtime colleague of Mr. Greenberg’s, recalled in his remarks during the service that the two of them would get rides to work from John H. Gutfreund, who was on his way to becoming the head of Salomon Brothers, and who drove a green convertible.\n\nApart from his magic tricks, Mr. Greenberg was known for his quips. Mr. Rosenwald recalled his friend’s response when people would ask him why he only took vacations in the United States and never in Europe.\n\n“It took my grandparents generations to get out of there,” Mr. Greenberg would say. “Why should I go back?”\n\nWhen Mr. Greenberg would give gifts, he would attach prewritten thank-you notes, his son, Ted, recalled. When his children would run off on some escapade, Mr. Greenberg would advise them to have fun, “but control costs.”\n\nTed Greenberg read from a letter his father had written to his wife, Kathy, with requests for the funeral. Most of the directions — “Temple Emanu-El should be big enough” — were followed.\n\n“I would like to be buried in the simplest casket available,” Mr. Greenberg wrote. “I think spending money on caskets is a waste.”\n\n“If you can’t find one, let me know,” the letter continued. “I will build one in my workshop in the Hamptons.”\n\nOn that point, the family denied Mr. Greenberg’s wish.\n\n“We blew $600 on the casket,” his son said. Referring to a private club in Manhattan, he added, “We’ll try to make it back in the Harmonie Club shiva.”"}, {"url": "https://www.nytimes.com/2020/11/09/realestate/moving-to-new-york-to-start-their-dance-careers.html", "page_content": "“Our general impression was that in our budget everything was really small,” Ms. Passarelli said. “And in the neighborhoods where there were a lot of young people and nightlife, things in our budget were really not great. You either get the neighborhood with a lot going on or you get the apartment.”\n\nOther Brooklyn neighborhoods like Prospect Lefferts Gardens and Bedford-Stuyvesant were more affordable, but still too expensive for them to get sufficient space. And while they didn’t have a pressing need to move by a particular date, at the end of a fruitless four-day push in August they were starting to think that maybe they would have to wait to move to the city, after all.\n\n“We were exhausted and starting to feel like, ‘Is there a point behind this?’” Ms. Passarelli said.\n\nThey were feeling so defeated about their rental prospects after their fourth straight day of apartment hunting that they almost passed, sight unseen, on an apartment that Ms. Chok’s father told them about. It belonged to a family friend in Dyker Heights, a south Brooklyn neighborhood known for its spectacular Christmas displays.\n\nTheir expectations were so low that they didn’t bother to ask what the rent was before getting on the subway to see it that afternoon. When they arrived, however, they were amazed.\n\nCompared with everything else they had seen, it was huge: an entire floor of a two-story house with a very large living room, a recently renovated kitchen and bathroom, ample closet space and two good-sized bedrooms. Perhaps best of all, the rent was the cheapest they had encountered: $1,750 a month, with utilities and Wi-Fi included."}, {"url": "https://fortune.com/education/articles/these-nyu-stern-mba-grads-make-more-than-225k-after-graduation/", "page_content": "These NYU Stern MBA grads make more than $225K after graduation BY Sydney Lake\n\nOne of the world’s financial epicenters—New York City—is also home to a full-time MBA program that Fortune ranks as being seventh-best in the country. So it’s no surprise that graduates from New York University’s Stern School of Business go on to have fruitful careers in finance.\n\nNYU Stern is known for churning out highly employable candidates; in 2021, nearly 96% of its graduates received a job offer within three months of graduation, according to the school’s employment report. The median base salary for NYU Stern grads was $155,000, with an average signing bonus of $35,000.\n\nDespite another year of uncertainty, the school’s most-recent full-time MBA class saw historically high compensation and employment outcomes, Beth Briggs, NYU’s associate dean of career services, wrote in the school’s 2021 employment report. “These outstanding results are built on the strong partnerships we have with our employers and alumni.”\n\nA $190,000 starting salary directly from an MBA program far eclipses the median earnings of a master’s degree recipient—which is just $77,844, according to Northeastern University research. But certain career paths taken by Stern grads last year proved to be even more lucrative.\n\nMoney in investment banking careers\n\nMore than 28% of NYU Stern’s MBA class of 2021 went into investment banking, with grads earning a median base salary of $175,000 plus a signing bonus of almost $52,000. That’s more than $225,000 in earnings directly after earning an MBA degree—and a 10% jump in total compensation from the prior year.\n\nInvestment banks have long recruited from top-ranked MBA programs, and recently there’s been a wave of firms raising salaries for its analysts. This year, investment banks including Goldman Sachs, Bank of America, Citigroup, J.P. Morgan, and Morgan Stanley have either bumped up or promised to raise the starting salaries for analysts.\n\nMBA grads are typically hired at the analyst or associate levels, which have an average base salary of $85,000 to $95,000 and $150,000 to $200,000, respectively, according to research by Mergers & Inquisitions. While NYU Stern shared figures only for base salaries and signing bonuses, investment bankers will typically rake in far more than that amount.\n\nThese finance professionals have the potential to earn stub bonuses (essentially a midyear bonus), an end-of-year cash bonus, a stock-based bonus, and other bonuses. This additional compensation could bump salaries for investment bankers closer to a range of $250,000 to $450,000, according to M&I data.\n\nWhy investment banks shell out for MBA grads\n\nInvestment banks are looking for three things in job candidates, Jeremy Shinewald, founder and president of MbaMission, an MBA admissions and career consulting firm, tells Fortune. Firms seek people who can work hard, have very strong analytical skills, and confer prestige upon the bank to impress investment banking clients. Essentially, these firms are looking for the type of people who graduate from top business school programs.\n\n“They want people who are not just willing to sacrifice their time and their personal lives, but also have such strong analytical capabilities that every single number in a high-density, high-profile deal will be perfect,” he says.\n\nInvestment bankers work long hours—think 16-hour days—and thus give up much of their freedom outside the office. Often, investment deals must be done quickly and confidently, Shinewald says.\n\nThat’s why investment banks are attracted to MBA candidates. Simply put, MBA grads are predisposed to working very, very hard, Shinewald says. Plus, investment banks will pay up for “risk management,” as he puts it.\n\n“You’re trying to make sure that you’re getting the best people who make the fewest mistakes in the most intense, high-pressure situations, which is what the banks get paid for,” Shinewald says. “I think that’s why the banks continue to try to recruit from top schools.”"}, {"url": "https://www.britannica.com/biography/Daniel-Burnham", "page_content": "Returning to Chicago, Burnham became a draftsman for the famed civil engineer and architect William Le Baron Jenney . He wrote to his mother in 1868 that he would become “the greatest architect in the city and country.” Nevertheless, ambitious, young, and restless, he quit his job with Jenney in order to seek his fortune in Nevada, where he tried mining and also ran for the state senate. Unsuccessful in both attempts, he returned to Chicago in 1870 ready to begin an architectural career in earnest .\n\nBurnham and his family moved to Chicago in January 1855. There he attended Snow’s Swedenborgian Academy and later Central High School, where he was remembered for his leadership and artistic ability. In 1863, after he had graduated, his parents sent him to the newly incorporated New-Church Theological School in Waltham, Massachusetts, for further study. He prepared for college with a Swedenborgian tutor, the Reverend Tilly Brown Hayward. Through Hayward, Burnham met the architect and writer W.P.P. Longfellow, who encouraged Burnham’s interest in architecture . When it came time to take his college entrance exams at Harvard and Yale , he failed both because he was “not able to write a word,” as he later recalled. Years later both universities would award him honorary degrees.\n\nBurnham was the sixth of seven children and the youngest son. His parents were members of the Church of the New Jerusalem (now New Church ), or Swedenborgians, a maverick Christian religious sect named for Emanuel Swedenborg , a Swedish scientist and mystic who disagreed with church hierarchy and stressed being of service to others.\n\nBurnham & Root\n\nIn 1872 Burnham joined the office of Carter, Drake & Wight, where he met John Wellborn Root, a talented architect and the office foreman. Burnham, eager to start his own firm, persuaded Root to become his partner a year later. Root was primarily responsible for design while Burnham planned the layout of their building interiors and organized the business. As best friends and professional colleagues, they worked closely together. Of their business relationship, their one-time boss Peter Wight recalled in a 1912 address before the Illinois chapter of the American Institute of Architects:\n\nBurnham had a great faculty of impressing his clients with the firm’s ability to solve any problem that came to it. He would make rapid sketches, which Root afterward elaborated with the greatest care. He inspired confidence in all who came within the range of his positive and powerful personality. Root had the ability to carry to success anything that Burnham offered to do.\n\nBurnham & Root became one of the preeminent firms in the history of American architecture. It was known for its size and wide range of projects.\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now\n\nTheir talent was evident from the start of their partnership. One of their first commissions, a house for the Union Stockyards magnate John B. Sherman in 1874, caught the discerning eye of their contemporary and rival Louis Sullivan, who recalled its fine lines and proportions in his autobiography.\n\nTwo events triggered a period of extraordinary growth in Chicago: the end of the Civil War and the Chicago fire of 1871. Burnham, always thinking big, was quick to recognize the needs of commercial clients. A series of bold solutions to some of the challenges of building higher structures provided examples for others to follow and led Burnham & Root to the forefront of their profession. As an example, for the 10-story Montauk Block (1882–83)—perhaps the first building to be labeled a “skyscraper”—Burnham & Root devised a new kind of foundation footing. This footing, consisting of a broad slab of concrete reinforced with iron rails, allowed the Montauk, and future taller, heavier buildings, to be built in Chicago’s unstable soil. Burnham & Root also extended the typical Chicago construction time frame by continuing to build throughout the winter months. They used a tentlike structure over the site and placed heaters inside. Additionally, the Montauk was noteworthy for its fireproofing system, which employed a hollow tile subfloor and tiles to encase both beams and columns, and was hailed as one of the first truly fireproof buildings. The Montauk Block created a new urban scale for commercial structures, while its form and plain surfaces reflected an aesthetic based on functionality, a hallmark of the new commercial architecture.\n\nAmong their other notable early works are the Rookery (completed 1886), the second Rand McNally Building (completed 1890, demolished 1911), the Monadnock Building (completed 1891), and the Masonic Temple (completed 1892). Finished a year after William Le Baron Jenney’s Home Insurance Building (completed 1885), which was the first building to use structural steel members for partial support, the Rookery used both a masonry load-bearing wall and a skeleton frame (a grid of vertical steel columns and horizontal steel beams) in its construction. But it is the smaller Rand McNally Building that is credited as the first steel-frame building. Burnham & Root’s 16-story Monadnock Building reached the tallest practical height using traditional construction techniques. At 21 stories high, Burnham & Root’s Masonic Temple with its great atrium would be a wonder: the tallest office building in the world in terms of occupied floors. In their 18-year partnership, Burnham and Root built nearly 300 structures—among them railroad stations, warehouses, office buildings, residences, armories, schools, clubs, and churches.\n\nAt a time when architecture was still emerging as a profession, Burnham organized his office for maximum efficiency and created a model for future architectural firms. The firm’s clients were ushered into a handsome paneled office with velvet curtains, a library of architectural drawing books, and a small copy of the Venus de Milo perched on the mantle over the fireplace. The tradesmen with whom they worked were scheduled to meet with the firm only on designated days. The office floorplan, which was published as a model for the profession, even had a gym."}, {"url": "https://www.moving.com/tips/moving-to-new-york-city/", "page_content": "New York City is arguably the most famous city in the world. It is also the largest city in the United States, with a population of roughly 8.8 million. It has the nation’s largest economy, generating a gross metropolitan product (GMP) of almost $1.7 trillion in 2020. According to the World Bank, that’s equivalent to the entire nation of Canada! As a result, jobs and opportunities abound in New York, but the city also has an amazing quality of life with some of the nation’s best museums and entertainment opportunities. We’ve compiled a guide to moving to New York City covering everything from where to live to what to expect, what jobs are available and how to get around the city. Here’s what you need to know about moving to The Big Apple.\n\nWhat is it like living in New York City?\n\nNew York City is unlike any other city in the United States. Life here is fast-paced with endless possibilities. You’ll always find something to do, from attending concerts and theater to enjoying some of the nation’s best restaurants and bars. Despite how urban it is, the city also has 28,000 acres of green space, including Central Park. You can walk or bicycle in the parks, kayak on the Hudson River and even ice skate without leaving the city.\n\nThe city is also incredibly diverse. People from all over the world move to NYC for new opportunities. You’ll hear approximately 800 different languages spoken in its streets and find restaurants and grocery stores representing all the major cuisines in the world.\n\nWho is moving to New York City ?\n\nWe typically think of young dreamer who wants to make it big in the arts, on Broadway or on Wall Street as the most common type of person who moves to New York City, but that’s only a fraction of the people who decide to relocate to the Big Apple. Roughly 40 percent of all people who live in New York (3.3 million) are foreign-born immigrants, according to the city’s Comptroller’s Office.\n\nPlenty of Americans move to New York, too. In its migration report, Apartment List found that the highest percentage of people moving to the city are those from Philadelphia, Miami and Washington D.C. Although the report doesn’t indicate why they are moving, one reason could be for their job. Companies like Sony, Pfizer, Deutsche Bank Americas Holding, Verizon, MetLife and Twenty-First Century Fox rank among the largest employers in the city.\n\nWhat is NYC’s cost of living?\n\nNew York has the highest cost of living in the nation. The cost of living is determined by comparing the cost of living index score in a particular city to the cost of living in other cities. If a city’s index score is higher than 100, then the cost of living is above average. If a city’s index score is lower than 100, then the cost of living is below average.\n\nAccording to AreaVibes, New York has an overall cost of living index of 161, 61 percent higher than the national average of 100. Housing is the biggest factor with an index of 234, but you also pay 48 percent above the national average for groceries, 33 percent more for goods and services, and 32 percent more for transportation.\n\nNumbeo estimates it will cost a family of four $5,035.72 per month to meet its expenses before rent. A single person will need $1,371.06 per month, not including rent. How does that compare to other expensive cities? According to Numbeo, living in New York is 27 percent more expensive than living in Los Angeles before rent. New York is also the only U.S. city to make MSN’s 2021 list of most expensive cities globally, including Singapore, London, Beijing, and Geneva.\n\nWhat jobs are available in New York City?\n\nSince its beginnings, New York City has been the nation’s financial and business epicenter. You’ll find financial jobs on Wall Street and beyond at companies like Morgan Stanley, Citigroup, JP Morgan Chase Co., Moody’s, American Express, MetLife and Deutsche Bank. The Bank of China is the second-largest company in the city, employing more than 300,000 people.\n\nMedia and entertainment are equally big industries. The city is home to Broadway and off-Broadway theaters as well as the Lincoln Center, the Apollo Theater and Madison Square Garden. But New York is also where you’ll find company headquarters for NBCUniversal, Sony Corporation of America, Warner Media, Hearst, Conde Nates, HBO and CBS.\n\nOther industries flourish, too. You can get a job in the fashion industry working at companies like Christian Dior, Triumph Apparel, Aeropostale, Estee Lauder and Ralph Lauren. Or look for a job in the hospitality industry. Sheraton Hotels and Resorts and Four Seasons Hotels and Resorts rank among the city’s largest employers. Looking for a job in the technology industry? IBM employs roughly 350,000 people.\n\nUnfortunately, you won’t be the only one looking for jobs at these companies and the likes of Pfizer, Verizon, Heineken, JetBlue Airways, Loews and Texaco. New York City is one of the most competitive job markets in the nation. This is reflected in its 6.6 percent unemployment rate, significantly higher than the national unemployment rate of 3.9 percent.\n\nIf you are moving to New York to break into a competitive industry like theater, save up enough to cover your expenses for three to six months, at least.\n\nWhat salary can you expect in New York City?\n\nIn 2019, the median household income in New York City was approximately $63,998, according to U.S. census data. This is slightly higher than the national median household income of $62,843.\n\nWhat is the real estate market like in New York City?\n\nReal estate in the Big Apple is 134 percent higher than the national average, according to AreaVibes. Realtor.com indicates the median listing home price in New York City is $859,000, which translates to a median price per square foot of $919. By comparison, the median price per square foot in Austin, Texas, is $320. However, San Francisco puts New York City’s real estate into perspective. In San Francisco, the median listing home price is $1.2 million, and the median price per square foot is $1,000.\n\nBecause it costs so much to buy a home in New York City, many people rent instead. According to ApartmentList.com, the average rent for a studio apartment in NYC is $3,237. A 1-bedroom apartment goes for $3,805, while a 2-bedroom goes for $5,748. In addition, you’ll need a broker to rent an apartment, and brokers typically charge 10 to 15 percent of the annual rent for your apartment. Even so, competition for apartments in the city is fierce.\n\nThere are ways to alleviate high rental costs. First, search for an apartment during the off-seasons of fall and winter, when there may be fewer available apartments, but rent prices are lower. Or you can share the cost of a rental with roommates. Another option is to shop in a different neighborhood. You’ll pay much more for an apartment in Manhattan than in the Bronx, for example.\n\nWhere s hould y ou l ive in NYC ?\n\nNew York City is divided into five boroughs: Manhattan, Brooklyn, Queens, Bronx and Staten Island. Each has its own personality, and within each borough, different neighborhoods will also stand out. Here’s an overview of what to expect.\n\nManhattan: Densely populated and lined with skyscrapers, Manhattan is home to Wall Street, the United Nations and the headquarters of many multinational and national corporations. Considering this, it’s no surprise that rent here is expensive. Some parts of Manhattan are more reasonable than others, so check out the Lower East Side or trendy East Village if you have your heart set on living here.\n\nBrooklyn: The most populous of the boroughs, Brooklyn is nicknamed the “Borough of Homes and Churches.” It was originally its own city, it has its own art scene, and it is where you’ll find Coney Island, one of the oldest amusement parks in the nation.\n\nQueens: In terms of surface area, Queens is the largest. It’s also the most ethnically diverse and, despite its name, is decidedly middle class. Queens is the home of the city’s two international airports, John F. Kennedy International Airport and La Guardia Airport.\n\nBronx: The Bronx is probably the most affordable of all the boroughs. It’s known for Yankee Stadium, Bronx Zoo, New York Botanical Garden and is the birthplace of hip-hop. It’s also home to beautiful historic buildings and homes. Planning to work in Manhattan? Brace yourself for a long commute.\n\nStaten Island: This borough is more suburban than the others and boasts a little more breathing room. It is the least populated of the boroughs but has the third-largest land area. If you decide to move here, though, you’ll have to rely on the Staten Island Ferry since the subway does not operate on the island.\n\nTaxes in New York City\n\nNew York City residents pay federal income tax, state income tax and city income tax. According to your income level, combined income taxes can be more than 50 percent. Top earners will pay 39.6 percent in federal income tax, 8.82 percent in state income tax and 3.876 percent in city income tax. Most people will pay 6.21 percent in state income tax and 3.819 percent in city income tax, though.\n\nSales tax in New York is high. The U.S.’s average combined sales tax (state, county and city) is 6.35 percent. While the state sales tax in New York is 4 percent, you’ll pay a county city tax. In New York City, regardless of which borough you live, you’ll pay an additional 4.875 for a total city sales tax of 8.875 percent.\n\nDo you need a car in NYC?\n\nNo, you don’t need a car to live in New York City. You may be better off without one. Traffic is notoriously bad in NYC, and gas is more expensive. According to Gasbuddy, the average price for a gallon of regular unleaded gas in New York City is $3.75 per gallon. This is higher than the national average, which is $3.53 (when this article was written).\n\nBut gas prices shouldn’t be your only concern. According to Bankrate, the city has some of the highest car insurance rates in the country, with full coverage averaging $2,321. On top of that, you’ll pay for parking. SpotHero estimates NYC residents pay an average of $570 per month in parking expenses. You may pay much more ($700 per month for valet parking on Broadway) or less ($188 per month in Brooklyn).\n\nInstead of driving, many New Yorkers rely on public transportation. The city’s subway operates 24 hours a day, supplemented by a public bus system, commuter rail network and the Staten Island Ferry. Plus, the cost of riding public transportation is reasonable. Individual subway rides cost $2.75 per ride, but you can purchase a 30-day unlimited ride pass for $127. Rides on the Staten Island Ferry are free.\n\nWhen weather permits, some New Yorkers bike their way through the city. Of course, walking is always a good way to get around, t00. You can also take taxis and rideshares.\n\nMore t o c onsider\n\nThere’s always something to do. The city has a full calendar of special events, from the Tribeca Film Festival and the Westminster Kennel Club Dog Show to New York Fashion Week and holiday celebrations late in the year. Don’t miss NYC Restaurant Week or Theater Week if you want to enjoy the city’s best on a budget.\n\nNew York City has four seasons. Winters and falls are usually cold, while summer is hot and humid. Before moving, invest in a winter jacket, boots for snow and slush, and warm clothes.\n\nThe city is home to Fordham University, the Juilliard School, City University of New York (CUNY) schools, Columbia University, Queens College and State University of New York (SUNY) schools.\n\nReady to move to New York ?\n\nFor more information about moving to New York, check out the City Profile Report. Simply enter the zip code or the state and city of your potential move to get a free report with city demographics, real estate information, quality of life factors and more. When looking for moving services, check Moving.com’s extensive network of reputable and reliable movers."}, {"url": "https://www.zhihu.com/question/35280047", "page_content": "更新：贴一篇男神写的转stern攻略，非常详尽。（男神授权转载）\n\n一. 日期与流程\n\nNYU\n\ninternal transfer 每年有一次机会，开始于每一学年的下学期开学，截止于当年的3 月1 日。也就是说，一般在1\n\n月底开学到3 月1 日这期间，有一个月左右的时间来用于申请内部转院。时间看上去很紧，但其实需要准备的东西并不多，仅需要一篇文书，并且申请流程十分简易。下面我们来看一下申请的具体流程：\n\n1. 登录albert，点击 student center 下方的“application\n\ncenter” （图中画圈处）\n\n2. 点击undergraduate\n\napplication for internal transfer 后面的 “Apply”选项\n\n3. 填写现在的学院及专业，以及想要申请的学院和专业\n\n4.\n\n上传一篇文书\n\n完成了以上四步，就完成了全部申请流程了。至于GPA 等其他文件，校方会自动帮你处理，完全无需操心。申请者所需要做的， 仅仅是准备一篇文书以及在 3\n\n月1 日截止日期之前，完成以上申请流程。\n\n二，文书\n\n文书 需要回答以下3 个问题：\n\n1, What has\n\nchanged since your enrollment in your current program that has prompted you\n\nto seek an internal transfer admission?\n\n2, What have\n\nyou been doing to prepare for study in your proposed new school or college\n\nand/or major?\n\n3, Briefly\n\ndescribe how you feel your educational goals can be better achieved in this program of study?\n\n第一个问题是典型的 “Why” essay，回答的时候建议提及你想转院的初衷，关键词是“changed”\n\n。例如可以说你入校之后参与了哪些活动，给了你什么inspiration，让你对未来有了不一样看法之类的经历。\n\n第二个问题则是 “What“ essay，建议谈你在选课和课外活动上做了哪些准备。例如可以说你选了什么课，对你未来在新学院学习如何有帮助，但建议略写，因为dean\n\nof admission 有你选课的相关信息，所以提到就好。重点谈一下你的课外活动，例如想转商学院的同学可以聊一下自己做过的实习，参加过的job\n\nfair，甚至是自己在做的startup。\n\n第三个问题就是所谓的 “How” essay 了，谈一下你转院之后准备做哪些事情。建议展望一下未来，谈谈想选什么课，加入哪些该学院才有的社团之类的话题。文书的篇幅没有限制，建议不要太长，最好控制在2\n\n到3 页左右。如果可以的话，建议在圣诞节的那个假期期间就把文书写好，以免开学后太过匆忙。很遗憾出于隐私的缘故，在这里不方便提供文书范本。\n\n三，CAS（及其他学院）转Stern 经验分享\n\nCAS 转Stern 总体来说难度不是很大，中国学生中转成功的概率估计有50%以上。我个人建议的是，在转院之前先扪心自问一下stern 是否真的适合自己，因为Stern\n\n是非常Professional 导向，想要读研深造的同学建议再多思考一下。\n\nCAS 转Stern 一般有两次机会，大一和大二各有一次。顺利的话，大一下学期就可以转成功，大二一开学就可以在Stern\n\n学习。转Stern 的GPA 理论上没有硬性要求，也有过很低GPA 被录取，4.0 GPA 被拒的历史。但一般上来说，GPA 在3.8 以上的申请者被录取的可能性会较大一些。NYU 的学制中，A 是4.0，A-是3.7，B+是3.3，B 是3.0，例如如果是两个A 两个A-的话，GPA\n\n就是3.85。值得一提的是，如果是大一申请转院的话，那时候校方只看得到大一上学期的成绩，所以同学们一定要最重视上学期的选课，确保自己可以拿到满意的GPA。\n\n此外，转Stern 的另一个关键就是选课一定要非常有目的性。Stern\n\n非常看重申请者在大一一学年所选的课（注意是一学年，不是一学期）。如果选课完全和Stern 无关，纵然GPA 很高，也很难转成功。建议在第一年选的课有以下这几门：\n\n•\n\nintro to microeconomics （CAS 的微观经济入门）；\n\n•\n\n一门数学课例如calculus 1／2/3 中的任何一节，linear algebra，或者math for\n\neconomics I 加上math for economics II （math\n\nfor economic I 和II 都上才能满足stern 毕业的数学要求，但并不意味着需要在转校之前全部上完，只是建议先上）\n\n•\n\nSTAT-UB 103(在stern 学院下面的statistics\n\n分类里可以找到，这门课6 学\n\n分)，或者CAS 的ECON-UA\n\n18 Statistics（4 学分）加上 STAT-UB 3 Regression\n\nForecasting Models（ 2 学分）；\n\n•\n\nPrinciple of Financial accounting (stern 的accounting 课，需要大一下才能\n\n上)；\n\n•\n\nStern 的任意一门core 课，例如intro to\n\nmarketing\n\n以上的几门课都是建议在大一选，但不是必须选，完全可以看自己的情况酌情选取其中几门来上。以我个人为例，我选了intro to\n\nmicroeconomics＋calculus III＋STAT-UB\n\n103＋Principle of Financial accounting。\n\n但值得注意的是大一似乎是必须完成NYU 的写作要求。事实上，我所知道的未完成NYU 写作要求同时转校成功的同学只有一名。\n\nCAS\n\n要求完成一门writing the essay 或者international\n\nwriting workshop I 和II（总共两门），这些最好在第一学年完成。这似乎对需要学Ali\n\n的同学有些不公平，因为Ali 并不被视作NYU 的写作课。这一点我本人也很困惑，似乎Ali 的学生申请转校困难重重。这里我分享一下和朋友讨论之后得出一些猜想，但愿能有所帮助：\n\n1.\n\n如果可以的话，建议需要上一学期Ali 的同学，在上学期上完Ali\n\n之后，下学期直接选writing the essay，这样就可以完成NYU\n\n的写作要求（其实NYU 的writing the essay 只要老师好，甚至可能比international writing workshop 简单）\n\n2.\n\n如果需要上两个学期Ali 的同学，可以尝试大一申请转校，但即使不能成功，也可以在大二的同一时间段再次申请。只需要在这一年间保持比较高的GPA，以及修完我文中所建议的课程就好。建议再多修一门ECON-UA\n\n10/9010 Intermediate Microeconomics，这样可以完全换掉stern\n\n的经济课。\n\n最后祝各位同学在NYU 学习生涯能够一帆风顺，无论是在Stern\n\n还是在其他学院，都能找到适合于自己的平台！\n\n－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－－\n\n大一成功Internal transfer进stern的。\n\n\n\n我原本是NYU Silver School of Social Work的，从internal transfer的角度来说可能还不如lsp，但我还是进了。内部转stern可能没有你想象的那么难，我认识的中国人中有5、6个都转成功了，但至少有2个没转成功。我认识一个学姐，她是大二从lsp internal transfer进stern的。据她说，lsp的advisor会各种阻止你转stern，但你不用理advisor就是了。\n\n－各种deadline：每年3.1截止申请，4.1左右出结果，每年只有3.1这次申请机会。建议答主早一点到学校官网上看好这些ddl，以及各种相关信息，早一点计划一下。\n\n－申请过程：在网上填一个简单的表格，需要写personal statement。\n\n－关于gpa：我gpa3.6，不算高吧\n\n－关于personal statement：很重要，好好写。我gpa不高，应该是那篇ps帮我进了stern。\n\n－关于选课：大一上的时候我还没决定转stern，因此没有选stern的课。但如果你一早决定要转stern的话，建议大一上选一门stern的课\n\n希望能帮到你，祝你好运！"}]}