{"The Lemonheads released their debut album, Hate Your Friends, in 1987.": [{"url": "https://www.wikiwand.com/en/Hate_Your_Friends", "page_content": "1987 studio album by The Lemonheads\n\nDear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about Hate Your Friends?\n\nSummarize this article for a 10 years old"}, {"url": "https://thelemonheadsmusic.bandcamp.com/album/hate-your-friends-deluxe", "page_content": "Digital Album Streaming + Download Includes unlimited streaming via the free Bandcamp app, plus high-quality download in MP3, FLAC and more. Purchasable with gift card Buy Digital Album £10 GBP Send as Gift\n\nCD Compact Disc (CD) + Digital Album Includes unlimited streaming of Hate Your Friends (Deluxe) via the free Bandcamp app, plus high-quality download in MP3, FLAC and more. ships out within 5 days Purchasable with gift card Buy Compact Disc £12 GBP Send as Gift\n\n3 x CD Bundle - 'When The Lemonheads Were Punk' - All Three Reissues Compact Disc (CD) + Digital Album\n\n\n\nWhen The Lemonheads Were Punk. To celebrate the re-issues of the first three Lemonheads records, Hate Your Friends, Creator and Lick, we are offering a special bundle price for all three for a limited time only.\n\n\n\nThe releases feature extra tracks including previously unreleased recordings.\n\n\n\nThe vinyl reissues come on coloured vinyl and include a 'bumper' sticker and a CD featuring the extra material, as well as the album tracks.\n\n\n\n\n\nHate Your Friends (Deluxe)\n\nCD - with 17 extra tracks and sleeve notes by Ben Deily\n\nLP - Original LP pressed on 180gram vinyl with yellow Lemonheads 'Bumper' sticker and CD containing all audio, including 17 extra tracks\n\n\n\n\n\nCreator (Deluxe)\n\nCD - with 11 extra tracks and sleeve notes by John Strohm\n\nLP - Original LP pressed on 180gram vinyl with blue Lemonheads 'Bumper' sticker and CD containing all audio, including 11 extra tracks\n\n\n\n\n\nLick (Deluxe)\n\nCD - with 12 extra tracks\n\nLP - Original LP pressed on 180gram vinyl with pink Lemonheads 'Bumper' sticker and CD containing all audio, including 12 extra tracks\n\n\n\nIncludes unlimited streaming of Hate Your Friends (Deluxe) via the free Bandcamp app, plus high-quality download in MP3, FLAC and more. ... more *We are all out of the coloured vinyl edition, but fear not, we also pressed these up on 180gram black vinyl!When The Lemonheads Were Punk. To celebrate the re-issues of the first three Lemonheads records, Hate Your Friends, Creator and Lick, we are offering a special bundle price for all three for a limited time only.The releases feature extra tracks including previously unreleased recordings.The vinyl reissues come on coloured vinyl and include a ships out within 5 days 2 remaining Purchasable with gift card Buy Compact Disc £30 GBP Send as Gift\n\n\n\nShare / Embed\n\nabout\n\nFire Records have reissued the first three albums by the Lemonheads, Hate Your Friends (1987), Creator (1988) and Lick (1989), featuring copious bonus tracks and many never-before released rarities and live recordings. Together, these seminal albums showcase the band's early punk rock roots-and trace the Lemonheads' transformation towards becoming one of the most successful and influential bands in indie rock.\n\n\n\n\n\nBefore the 90s. Before the internet. Before Nevermind. Back when something called \"independent music\" first began reaching a wider audience, through college radio, word-of-mouth, and that small \"underground\" record store you seem to find in every town...there was a band from Boston called Lemonheads.\n\n\n\nHigh school friends Ben Deily and Evan Dando, Lemonheads' primary songwriters, co-guitarists and co-vocalists, first recorded together on 4-track cassette in the spring of 1985; by the end of the decade they - together with bass player Jesse Peretz, sometimes-guitarist Corey Brennan, and successive drummers Doug Trachten and John P. Strohm - had created a body of recordings which would see them on MTV's fledgling \"120 Minutes,\" beating out the Grateful Dead on college radio charts, and entering the consciousness of a generation of music fans.\n\n\n\nCited as influences by artists as varied as Billie Joe Armstrong and Ryan Adams, these fledgling Lemonheads recordings-part rock, part pop, part unique hybrid of the 80s punk styles beloved by the band members-mark the start of the trajectory that would eventually lead to \"mainstream\" success and stardom for a later version of the band. But they also represent a distinct, never-repeated phase of the band's history: one that is finally receiving the attention it deserves.\n\n\n\n\n\n\n\nThe roots of Hate Your Friends begin with the genesis of the band itself. Dando and Deily first started out as a two-piece ensemble: swapping back and forth between a shared Guild guitar (and a crappy amp) and vocal mic, and pounding a drum kit \"borrowed\" from the high school jazz band. With the addition of Jesse Peretz on bass, the two-man outfit quickly became a power trio.\n\n\n\nWith a handful of original songs, a passionate love for their favourite bands-from Husker-Du, the Replacements, Black Flag and the Germs, to the Saints, Wire and '77 UK punk-and a tiny recording budget, the Lemonheads set about their first studio session within days of their high school graduation in June of 1986.\n\n\n\nDuring that summer, a significant amount of what would become the band's debut album was recorded in Brookline, Massachusetts, with Deily and Dando sharing vocal, guitar and drumming duties. Above and beyond bass, Jesse proved pivotal as the band's manager, booker and tireless promoter-helping arrange for the Lemonheads self-released debut EP, Laughing all the way to the cleaners, later that summer, and shortly thereafter helping establish the relationship with Curtis Casella of TAANG! records that paved the way to full-length LP Hate Your Friends.\n\n\n\nFinally, with the addition of full-time (and fairly short-lived) drummer Doug Trachten, the last songs of Hate Your Friends were recorded in the winter of 1986-7.\n\n\n\nBONUS TRACKS:\n\n\n\nThis Fire Records re-issue features bonus tracks including 12 never-before-released live tracks from a 1987 radio session, rare tracks from the early compilation Crawling From Within, and additional tracks not included on the original release of Hate Your Friends (\"Buried Alive\" and \"Gotta Stop\").\n\ncredits\n\nreleased October 7, 2013\n\nlicense\n\nall rights reserved"}, {"url": "https://louderthanwar.com/the-lemonheads-hate-your-friends-creator-lick-albums-review/", "page_content": "Share This Tweet\n\n\n\n\n\nEmail\n\n\n\nThe Lemonheads: Hate Your Friends, Creator & Lick (Fire Records)\n\nCD/LP/DL\n\nDue Out 7th Oct\n\nFire Records are reissuing the first three albums by Lemonheads. Together, these seminal albums showcase the band’s early punk rock roots and trace the Lemonheads’ transformation towards becoming one of the most successful and influential bands in indie rock.\n\nThis month Fire Records re-issue three early albums by The Lemonheads. Originally released through TAANG! Records in the 80’s but resurrected in 2013 for a very good reason. These albums are surprisingly are as good as any of their later career. They show a fledgling band finding their feet, flexing their songwriting abilities and venting some ‘punk rock’ teenage fury. Still at high school in Boston when they began recording the first of three Lemonheads albums between the years of 1987-1989, Evan Dando and Ben Deily the primary songwriters that began define a band that would go on to be major label, million-sellers in the 90’s.\n\nBasically, these are re-issues of a re-issue, be it on a different label. These albums were given a re-issues back in 1992; All with the same extra tracks, alternative mixes, radio interviews and sessions. Of course, if you don’t already own these albums which not many people do to be honest, at least comparatively to their Atlantic Records releases such as, ‘It’s A Shame About Ray’ and ‘Come On, Feel The Lemonheads’, they are worth buying. They contain more songs from the live radio sessions than the ’92 release, with a welcome additions such as a cover of Charles Manson’s version of the song he wrote for The Beach Boys, ‘Cease To Exist’. Their penchant for quirky cover versions goes back as far as these formative albums, with them covering ‘Amazing Grace’, ‘Plaster Caster’ by Kiss, Their break through single, Susan Vega’s ‘Luka’ & Dando’s version of ‘Home Is Where Your Happy’ by Manson again. In fact their (or Dando’s) obsession with Manson extends itself throughout the their early career. Firstly with another cover of, ‘Clang Bang Clang’ on ‘Lick’, and secondly the many songs that allude to or blatantly sample Manson directly such as, ‘Die Right Now’, ‘Come Back DA’ and my favorite tune on ‘Hate Your Friends’, ‘Sneakyville’. Even continuing on their major label debut, ‘Lovey’ with the beautiful, ‘Ride With Me’, the smokey ‘Lil Seed’ and chaotic ‘Ballerat’.\n\nWhat seems to be evolving over the period of these three albums is the duelling of the songwriters, which in a lot of cases makes for better songs but inversely, the power struggle can also dissolve relationships between its vying band members. Their debut, ‘Hate Your Friends’ is the sound of East coast, teenage punk rock co-existing with their pop influences if only for a few fleeting minutes. Most of the album is made up of fast, overdriven shouty and nihilistic exuberance. Their irreverent cover of Proud Scum’s, ‘Rabbit’ never fails to raise a smile as they scream about wanting to, “share their carrot with you”. The best tracks are the title track, ‘Hate Your Friends’ and the Buzzcocks sounding, ‘Second Chance’ with the radio session versions of the giving a glimpse of their live sound.\n\nTheir follow up album, ‘Creator’ finds them leaning closer to REM than Negative FX. The laconic, ‘Out’ sounds as if Dinosaur Jr had started influencing the East coast sound. Overall it isn’t as vibrant as their debut writing more of a sub-Replacements Indie Pop Punk. The songs seem unfinished and demo-like. Stand out track is the catchy, upbeat Deily penned, ‘Take Her Down’ and the extra radio session versions sound better than some on the album but add little to the underwhelming nature of the album in large.\n\n‘Lick’ on the other hand is where The Lemonheads find their stride and really deliver some great melodic hooks and evocative lyrics. The opening track, ‘Mallo Cup’ is playful and well performed. They squeeze as much melody from it’s chords making it one of their best songs thus far. Their ‘Punkiness’ has definitely been replaced by ‘Rockiness’ on this album making it far more palatable. On ‘7 Powers’ and ‘Ever’, Deily again proves to be on point lyrically creating some very poignant songs but it’s Dando that pulls out the Indie Pop trump card with, ‘Circle Of One’. A jangly slice of what he will become famous for. Again, the radio session versions offer little but the addition of the B sides to the ‘Luka’ EP, ‘Fucked Up’ and ‘I Like To’ are a pleasure because of their superior production.\n\nRecommended if you don’t already own the ’92 re-issue.\n\n~\n\nThe Lemonheads can be found at their website and at their Facebook, Twitter and MySpace pages.\n\nAll words by Philip Allen. More work by Philip can be found in his Louder Than War archive."}, {"url": "https://1year366alb.home.blog/2020/07/05/album-176-the-lemonheads-hate-your-friends/", "page_content": "Released: 1987\n\n1987 Origin: Boston, Massachusetts, USA\n\nBoston, Massachusetts, USA Label: Taang!\n\nTaang! Best Track: Uhhh\n\nI’m working my way through The Lemonheads’ chronology in a topsy-turvy way.\n\nI started with their fifth album, the 1992 classic It’s A Shame About Ray, which remains probably in my top 20 albums of all time. I then discovered its follow-up Come on Feel The Lemonheads, but then went back to 1989 for Lick. Now I suppose I’m moving on to where I should have started with their 1987 debut.\n\nAnd Hate Your Friends is pretty straight-up punk. Clocking in at just 24 minutes, it’s rough and ready, but still pretty melodic. At the time, it might have been referred to as ‘pop-punk’, before certain bands came along later and made ‘pop’ very much the operative word in that phrase.\n\nSome tracks, like ‘Second Chance’, have a Descendents vibe with their bass-heaviness, while the title track, ‘I Don’t Wanna’ and personal favourite ‘Uhhh’ are instantly catchy.\n\nElsewhere, we get a pretty skippable cover of the hymn ‘Amazing Grace’. Evan Dando’s lot have made their name with great rock covers of songs like ‘Mrs. Robinson’ and ‘A Different Drum’, but this isn’t one of their better efforts.\n\nIt seems even die-hard Lemonheads fans seldom rave about this album, but while it doesn’t quite stack up against what came later, it’s not a bad start."}, {"url": "https://www.banquetrecords.com/the-lemonheads/hate-your-friends-%28deluxe%29/FIRELP235?open=menu", "page_content": "You will need to log in or register to be notified\n\nExpected 7th October\n\n\n\nDeluxe reissue of The Lemonheads' 1987 debut album featuring 12 unreleased live tracks from a 1987 radio session, rare tracks from the early compilation Crawling From Within, and extra tracks Buried Alive and Gotta Stop not included on the original release\n\nWith a handful of original songs, a passionate love for their favourite bands and a tiny recording budget, the Lemonheads set about their first studio session within days of their high school graduation in1986. During that summer, a significant amount of what would become the band’s debut album was recorded in Brookline, Massachusetts, with Deily and Dando sharing vocal, guitar and drumming duties. Finally, with the addition of full-time (and fairly short-lived) drummer Doug Trachten, the last songs of Hate Your Friends were recorded in the winter of 1986-7."}, {"url": "https://www.horizonsmusic.co.uk/products/lemonheads-hate-your-friends", "page_content": "Format: LP\n\nCatalogue No.: FIRELP235\n\nBarcode: 0809236123510\n\nRelease Date: 16 Sep 2022\n\nGenre: Indie/Alternative\n\nHate Your Friends is the 1987 debut album by the Lemonheads, one of only three full-length releases to feature the original band line- up of Evan Dando, Ben Deily, and Jesse Peretz. The album showcases a hardcore-punk-to-pop-rock sound and sensibility as playfully fierce as it is surprising…especially to listeners who know the band only from their better-known major label recordings of the 1990s. The roots of Hate Your Friends begin with the genesis of the band itself: when high school friends Ben Deily and Evan Dando—inspired by a shared love of the 70’s absurdist comedy troupe the Firesign Theatre, literature, and punk rock—began playing their own songs together in 1985. Dando and Deily first started out as a two-piece ensemble: swapping back and forth between a shared Guild guitar (and a crappy amp) and vocal mic, and pounding a drum kit “borrowed” from the high school jazz band. With the addition of classmate and friend Jesse Peretz on bass, the two-man outfit quickly became a power trio. With a handful of original songs, a passionate love for their favourite bands—from Husker-Du, the Replacements, Black Flag and the Germs, to the Saints, Wire and ‘77 UK punk—and a tiny recording budget, the Lemonheads set about their first studio session within days of their high school graduation in June of 1986. During that summer, a significant amount of what would become the band’s debut album was recorded in Brookline, Massachusetts, with Deily and Dando sharing vocal, guitar and drumming duties. Above and beyond bass, Jesse proved pivotal as the band’s manager, booker and tireless promoter—helping arrange for the Lemonheads self-released debut EP, Laughing all the way to the cleaners, later that summer, and shortly thereafter helping establish the relationship with Curtis Casella of TAANG! records that paved the way to full-length LP Hate Your Friends. Finally, with the addition of full-time (and fairly short-lived) drummer Doug Trachten, the last songs of Hate Your Friends were recorded in the winter of 1986-7. BONUS TRACKS: This Fire Records re-issue features bonus tracks including 12 never-before-released live tracks from a 1987 radio session, rare tracks from the early compilation Crawling From Within, and additional tracks not included on the original release of Hate Your Friends (“Buried Alive” and “Gotta Stop”).\n\nTracks : 1. I Don't Wanna 2. 394 3. Nothing True 4. Second Chance 5. Sneakyville 6. Amazing Grace 7. Belt 8. Hate Your Friends 9. Don't Tell Yourself It's OK 10. Uhhh 11. Fed Up 12. Rat Velvet 13. Fucked Up. Plus additional download tracks: 14. Mod Lang (From 'Crawling From Within' compilation) 15. Buried Alive 16. Gotta Stop 17. Sad Girl (From 'Crawling From Within' compilation) 18. Belt (1987, Live on WERS) 19. 394 (1987, Live on WERS) 20. Falling (1987, Live on WERS) 21. Don’t Tell Yourself (1987, Live on WERS) 22. Uhhh (1987, Live on WERS) 23. Amazing Grace (1987, Live on WERS) 24. Rat Velvet (1987, Live on WERS) 25. Second Chance (1987, Live on WERS) 26. Sneakyville (1987, Live on WERS) 27. I Like To (1987, Live on WERS) 28. So I Fucked Up (1987, Live on WERS) 29. Sick Of You (1987, Live on WERS) 30. Hate Your Friends (1987, Live on WERS)\n\nMore From This Artist:"}, {"url": "https://consequence.net/2013/07/dusting-em-off-the-lemonheads-its-a-shame-about-ray/", "page_content": "Almost any discussion involving The Lemonheads revolves around the group\u0092s co-founder and leader, Evan Dando. Even in the band\u0092s earliest years when co-founder Ben Deily (guitar and drums) was still around to keep The Lemonheads\u0092 punkier side raging, most of the coverage and critique was Dando-centric. Perhaps it was because most of the songs were his lyrics or because he was the one out front. Or maybe it was as simple as his great looks. Regardless of how the conversation started, in the years following the release of The Lemonheads\u0092 creative peak, 1992\u0092s It\u0092s a Shame About Ray, all anyone really talked about was Dando\u0092s descent into drug abuse.\n\nThe Lemonheads\u0092 first three albums, Hate Your Friends [1987], Creator [1988], and Lick [1988], all on Boston\u0092s Taang! Records and all three featuring Ben Deily, are far more aggressive albums than Dando\u0092s Atlantic and post-Atlantic material. Forming the group during his teens to deal with his anger and frustration, much of which stemmed from his parents\u0092 divorce when he was 11, the music was grittier, a tad less subtle and every once in a while, slightly confrontational. Filtered through early ’80s Boston and informed by the likes of DC\u0092s Minor Threat, the music naturally carried with it a darker, rougher edge but was tempered by a wistfulness rooted in the AM Pop radio of Dando\u0092s childhood.\n\nRelated Video\n\nAcoustic melancholia and country-rock swagger occasionally made appearances, but Deily\u0092s presence in the group always managed to keep Dando\u0092s more sensitive and sentimental side in check. In 1989, prior to the jump to Atlantic Records, that all changed when Deily left the group. The following year, after recruiting David Ryan as the group\u0092s fourth drummer in as many albums, Dando, along with original bassist Jesse Peretz, released Lovey. Including a cover of Gram Parsons\u0092 \u0093Brass Buttons\u0094, Lovey is Dando\u0092s exuberant exploration of jangle pop and Chris Hillman/Gram Parsons-infused country-rock all while maintaining a foot firmly planted in the pop punk sound that filled their earlier endeavors. With Deily gone, Dando\u0092s inner Gram Parsons was set free, both literally and figuratively.\n\nAdvertisement\n\nDespite having free reign within his group and having released his most accomplished album thus far, by the time The Lemonheads hit Australia in late 1990 and finished touring in support of Lovey, Dando was on the verge of being over the whole thing. Suspending the group, so to speak, Dando returned Down Under in October 1991, immediately reconnecting with some of the folks he happened upon while on tour.\n\nWhile in Australia, Dando\u0092s closest companion was Tom Morgan, founding member of Australian group Smudge and Dando\u0092s future songwriting partner. Morgan co-wrote part of Ray with Dando, and it was through him that Dando met many of the people who became inspirations for the songs that would go on to make up It\u0092s a Shame About Ray. People like Alison Galloway, the drummer for Smudge, Morgan\u0092s roommate Nicole, Dando\u0092s titular \u0093Drug Buddy\u0094, and the album\u0092s namesake Ray, a Melbourne club-owner. It was also where he met future Lemonheads\u0092 bassist Nic Dalton, who also penned the Ray track \u0093Kitchen\u0094. Whether it was intended as a means of escape or inspiration, in the end, it turned out to be both. As Dando spent the Australian summer in a drug-laden haze fueled by ecstasy and speed, he managed to write all the songs for what would become his next (and now-classic) album.\n\nReturning stateside armed with a dozen songs, Dando re-teamed with David Ryan and pulled in former Blake Baby and rising indie pop princess (as well as college rock\u0092s most celebrated virgin) Juliana Hatfield for bass duties. Recording and producing the album was the Robb Brothers, a legendary California production team who had worked with the likes of Bowie, Dylan, Steely Dan, and Michael Jackson. With their folk rock roots and doyenesque understanding of music production, the Robbs were the perfect handlers for The Lemonheads\u0092 new material. Working with some of Dando\u0092s most sensitive and endearing lyrics and certainly some of his strongest melodies, the Robbs managed to soften the edges just enough, allowing for Dando\u0092s acoustic side to become fully realized.\n\nAdvertisement\n\nIn June 1992, when It\u0092s a Shame About Ray was released, the music industry was still somewhat in the wake of Nirvana\u0092s Nevermind, released the previous fall. Alt-rock and underground bands such as The Lemonheads, whose highest levels of recognition were in college rock, suddenly found themselves openly welcomed on MTV and commercial radio. For The Lemonheads, a wider audience meant more exposure, and more exposure meant Dando\u0092s face — with glazed eyes, wavy hair, and a slight disconnect that drove the girls ga-ga — was plastered everywhere.\n\nSuch ubiquitous presence also had its downside, fueling vitriolic comments suggesting Dando\u0092s success was more related to his good looks than good hooks. Regardless of his looks, fact is Ray is an album full of great pop songs that sees The Lemonheads sharp, focused, and beautifully executing Dando\u0092s vision. And despite it clocking in at just under a half-hour, the songs were laden with memorable guitar riffs and catchy lyrics that had them repeating in your head long after they had stopped playing.\n\nI bought a copy of It\u0092s a Shame About Ray when it first came out and listened to it quite often over the next few years. I immediately gravitated towards the jangly nature of Dando\u0092s guitar and the seemingly lighthearted lyrics, finding myself often singing the repetitive lyrics of songs like \u0093Confetti\u0094 or \u0093Bit Part\u0094 without any idea of how deep the songs\u0092 (or the entire album for that matter) sentiments truly ran. With 20 years of additional life experience, revisiting It\u0092s a Shame About Ray is not only nostalgic but somewhat therapeutic and altogether more revealing.\n\nAdvertisement\n\nWhen Dando wrote \u0093Confetti\u0094, a song that everyone now knows is about his parents\u0092 divorce, he said, \u0093That song is about the way people go along with a relationship without really caring about it, just to keep the other person happy,\u0094 a sentiment that many children of divorced parents can relate to. For me, not being a child of divorce, my eventual empathy came from either my own experiences or friends in similar, loveless relationships.\n\n\u0093Bit Part\u0094 is a deceivingly lighthearted number that had Dando evoking acting terms such as the song\u0092s title, \u0093cameo\u0094, \u0093stand-in\u0094, and \u0093walk-on\u0094 to represent just how badly he wanted to have any kind of connection, even if it was just on the periphery. At the time, the song\u0092s punch was softened by Hatfield\u0092s beautiful harmonies, echoing Dando\u0092s titular demand, \u0093I want a bit part in your life.\u0094 And though not necessarily noted when it was released, time and experience have revealed the song\u0092s thematic connection to \u0093Confetti\u0094.\n\nTime and experience have also revealed It\u0092s a Shame About Ray to be very much the druggy album, with critic Stephen Deusner going as far as describing it \u0093as much a junkie album as Nevermind.\u0094 Yes, the album was made under the warmth of a pharmaceutical blanket, but that alone doesn\u0092t make it a druggy album. Rumours was fueled by cocaine, but it isn\u0092t a junkie\u0092s album. What makes Ray so is how the songs and the drugs, the stories and the people, are all part of one big, vicious cycle. The failed relationships and resulting emotions fueled the drugs and vice versa.\n\nAdvertisement\n\nSongs like \u0093Rudderless\u0094 with its \u0093ship without a rudder is like a ship without a rudder\u0094 theme can be understood by anyone who has struggled to find or at least stabilize oneself, especially under the antagonizing addiction of drugs, but it could even be applied to someone simply ascending into adulthood. \u0093I\u0092ve never been too good with names, but I remember faces,\u0094 a line sung in the album\u0092s title track, is certainly something that anyone who has ever done more than a piddling of drugs could relate to. With \u0093Alison\u0092s Starting To Happen\u0094, initially about Alison Galloway rolling on ecstasy before evolving into a tune about a girl discovering herself through punk rock, the song\u0092s subversive origins are well-hidden, something that can\u0092t be said about the album\u0092s centerpiece, \u0093My Drug Buddy\u0094.\n\nPerhaps Dando\u0092s most personal and poignant song, \u0093My Drug Buddy\u0094 is a beautifully raw and honest depiction about scoring speed in the suburbs of Sydney as well as the relationship between two users. (The song\u0092s title alone had an impact; one effectively neutered when Atlantic Records forced the title to be changed to simply \u0093Buddy\u0094. Considering Atlantic signed artists like Ray Charles, their concern over the word drug in the song\u0092s title seemed at best quizzical and, at worst, extremely misguided, and thankfully the song\u0092s full-title was restored on later pressings.) Beginning with the call and ending with the two in their particular habit\u0092s embrace is something many can relate to, even if your drug was simply alcohol. For many who have dabbled with drugs (including alcohol), there was probably a buddy or two in your life simply because you shared that common interest. Whether it was slamming suds, pulling tubes, candy-flipping, or bumping lines, without that communal activity, this \u0093drug buddy\u0094 may have been no one at all to you. But because of this shared bond, the \u0093drug buddy\u0094 understood you in ways others may not.\n\nBut a drug buddy isn\u0092t necessarily a good thing to have. Considering that one\u0092s presence alone can be considered something of an enabler, in the end most drug buddies are simply using each other to get closer to their next high. Dando points to that when he sings, \u0093We have to laugh to look at each other, we have to laugh \u0091cause we\u0092re not alone,\u0094 all the while underlying with the heavy realization that most users truly are alone, buddy or not. When he sings, \u0093I\u0092m too much with myself, I want to be someone else,\u0094 quite possibly his most open and honest lyric, not only does Dando create an arc back to why he escaped to Australia in the first place, but he confronts a sentiment many can relate to, drugs or not. With that lyric, any juvenile humor one sought to find in the song\u0092s title or subject matter immediately dissolves, revealing the song to be more confession than confection.\n\nAdvertisement\n\nOn every Lemonheads album, there has been a cover. Whether it was Suzanne Vega\u0092s \u0093Luka\u0094 or the previously mentioned Parsons\u0092 tune, or even \u0093Amazing Grace\u0094, Dando and crew have for one reason or another always opted to throw one or two into the mix. For Ray, Dando chose \u0093Frank Mills\u0094 from the musical Hair, a choice that with the benefit of hindsight is slightly revealing and somewhat prophetic. The lyric \u0093I love him, but he embarrasses me\u0094 may have been an attitude shared by many friends and band mates of Dando, especially in the years following Ray\u0092s release as Dando descended further down the spiral. Its gentle, folky nature and slightly off-kilter delivery was the perfect comedown, and before Atlantic forced the addition of \u0093Mrs. Robinson\u0094 onto later pressings, a wonderful closing statement to the album.\n\nThe follow-up to Ray, 1993’s Come On Feel the Lemonheads, tried to continue mapping much of the territory begun with Lovey and fleshed out with Ray, even including songs like \u0093Being Around\u0094, that continued the sadly lonely theme behind \u0093Bit Part\u0094, though with a dollop of humor. But at the end of the day, the fact is with It\u0092s a Shame About Ray, Dando and his group peaked artistically. And though released only two years into the ’90s, both the album and its title track are among the best releases of the decade (if not beyond), something possibly recognized by Dando himself, as in recent years he\u0092s taken to covering Ray in its entirety (though conveniently leaving \u0093Mrs. Robinson\u0094 off the set list). Yes, with It\u0092s a Shame About Ray, The Lemonheads reached the mountaintop. Unfortunately for them, it was a small peak."}, {"url": "https://www.piccadillyrecords.com/prod/TheLemonheads-HateYourFriends(Deluxe)-FireRecords-92680.html", "page_content": "About this item\n\nHate Your Friends is the 1987 debut album by the Lemonheads, one of only three full-length releases to feature the original band line- up of Evan Dando, Ben Deily, and Jesse Peretz. The album showcases a hardcore-punk-to-pop-rock sound and sensibility as playfully fierce as it is surprising…especially to listeners who know the band only from their better-known major label recordings of the 1990s.\n\n\n\nThe roots of Hate Your Friends begin with the genesis of the band itself: when high school friends Ben Deily and Evan Dando—inspired by a shared love of the 70’s absurdist comedy troupe the Firesign Theatre, literature, and punk rock—began playing their own songs together in 1985. Dando and Deily first started out as a two-piece ensemble: swapping back and forth between a shared Guild guitar (and a crappy amp) and vocal mic, and pounding a drum kit “borrowed” from the high school jazz band. With the addition of classmate and friend Jesse Peretz on bass, the two-man outfit quickly became a power trio. With a handful of original songs, a passionate love for their favourite bands—from Husker-Du, the Replacements, Black Flag and the Germs, to the Saints, Wire and ‘77 UK punk—and a tiny recording budget, the Lemonheads set about their first studio session within days of their high school graduation in June of 1986.\n\n\n\nDuring that summer, a significant amount of what would become the band’s debut album was recorded in Brookline, Massachusetts, with Deily and Dando sharing vocal, guitar and drumming duties. Above and beyond bass, Jesse proved pivotal as the band’s manager, booker and tireless promoter—helping arrange for the Lemonheads self-released debut EP, Laughing all the way to the cleaners, later that summer, and shortly thereafter helping establish the relationship with Curtis Casella of TAANG! records that paved the way to full-length LP Hate Your Friends. Finally, with the addition of full-time (and fairly short-lived) drummer Doug Trachten, the last songs of Hate Your Friends were recorded in the winter of 1986-7.\n\n\n\nBONUS TRACKS: This Fire Records re-issue features bonus tracks including 12 never-before-released live tracks from a 1987 radio session, rare tracks from the early compilation Crawling From Within, and additional tracks not included on the original release of Hate Your Friends (“Buried Alive” and “Gotta Stop”).\n\nTRACK LISTING\n\n1. I Don't Wanna\n\n2. 394\n\n3. Nothing True\n\n4. Second Chance\n\n5. Sneakyville\n\n6. Amazing Grace\n\n7. Belt\n\n8. Hate Your Friends\n\n9. Don't Tell Yourself It's OK\n\n10. Uhhh\n\n11. Fed Up\n\n12. Rat Velvet\n\n13. Fucked Up\n\n14. Mod Lang (From 'Crawling From Within' Compilation)\n\n15. Buried Alive\n\n16. Gotta Stop\n\n17. Sad Girl (From 'Crawling From Within' Compilation)\n\n18. Belt (1987, Live On WERS)\n\n19. 394 (1987, Live On WERS)\n\n20. Falling (1987, Live On WERS)\n\n21. Don’t Tell Yourself (1987, Live On WERS)\n\n22. Uhhh (1987, Live On WERS)\n\n23. Amazing Grace (1987, Live On WERS)\n\n24. Rat Velvet (1987, Live On WERS)\n\n25. Second Chance (1987, Live On WERS)\n\n26. Sneakyville (1987, Live On WERS)\n\n27. I Like To (1987, Live On WERS)\n\n28. So I Fucked Up (1987, Live On WERS)\n\n29. Sick Of You (1987, Live On WERS)\n\n30. Hate Your Friends (1987, Live On WERS)"}, {"url": "https://alchetron.com/Hate-Your-Friends", "page_content": "Hate Your Friends is the debut album of the American alternative rock band The Lemonheads. The album showcases their early punk roots, and is one of only three albums to feature the full original lineup of Evan Dando, Ben Deily, and Jesse Peretz. Under the original arrangements, as evidenced by the first three tracks of the album, as well tracks 11–20, Peretz played bass guitar while Deily and Dando, the two principal songwriters, switched duties as lead vocalist/lead guitarist and drummer. On tracks 4–10, drums are played by Doug Trachten while Deily and Dando share lead vocal and lead guitar duties.\n\nTrack listing\n\nSongs written by band member indicated.\n\n1987 original LP version\n\n\"Don't Wanna\" (Dando) \"3-9-4\" (Deily) \"Nothing True\" (Dando) \"Second Chance\" (Deily) \"Sneakyville\" (Dando) \"Amazing Grace\" (Trad; arr. by Dando, Deily, Peretz) \"Belt\" (Dando) \"Hate Your Friends\" (Dando) \"Don't Tell Yourself\" (Dando) \"Uhhh\" (Deily) \"Fed Up\" (Dando) \"Rat Velvet\" (Dando, Peretz, Deily) \"So I Fucked Up...\" (Deily)\n\n1987 original cassette version\n\n\"Glad I Don't Know\" (Dando) \"I Like to\" (Dando) \"Rabbit\" (Proud Scum cover) \"Don't Wanna\" (Dando) \"3-9-4\" (Deily) \"Nothing True\" (Dando) \"Second Chance\" (Deily) \"Sneakyville\" (Dando) \"Amazing Grace\" (Trad; arr. by Dando, Deily, Peretz) \"Belt\" (Dando) \"Hate Your Friends\" (Dando) \"Don't Tell Yourself\" (Dando) \"Uhhh\" (Deily) \"Fed Up\" (Dando) \"Rat Velvet\" (Dando, Peretz, Deily) \"So I Fucked Up...\" (Deily) \"Ever\" (Deily) \"Sad Girl\" (Dando) \"Buried Alive\" (Deily) \"Gotta Stop\" (Dando)\n\n1992 version\n\n\"Glad I Don't Know\" (Dando) \"I Like to\" (Dando) \"Rabbit\" (Proud Scum cover) \"Don't Wanna\" (Dando) \"3-9-4\" (Deily) \"Nothing True\" (Dando) \"Second Chance\" (Deily) \"Sneakyville\" (Dando) \"Amazing Grace\" (Trad; arr. by Dando, Deily, Peretz) \"Belt\" (Dando) \"Hate Your Friends\" (Dando) \"Don't Tell Yourself\" (Dando) \"Uhhh\" (Deily) \"Fed Up\" (Dando) \"Rat Velvet\" (Dando, Peretz, Deily) \"So I Fucked Up...\" (Deily) \"Ever\" (Deily) \"Sad Girl\" (Dando) \"Buried Alive\" (Deily) \"Gotta Stop\" (Dando)\n\n(1 to 3 and 16 from Laughing All The Way To The Cleaners 1986 EP)\n\nPersonnel\n\nEvan Dando - guitar, vocals, drums on tracks 13 and 16\n\nBen Deily - guitar, vocals, drums on tracks 1–3, 11, 12, 14, 15, and 17–20\n\nJesse Peretz - bass\n\nDoug Trachten - drums on tracks 4–10"}, {"url": "https://www.thelineofbestfit.com/reviews/albums/lemonheads-reissues-hate-your-friends-creator-lick-fire-138328", "page_content": "Devotees of The Lemonheads may well have some knowledge of a time when the band was a Replacements-inspired garage band in which vocalist/guitarist Ben Deily occasionally shared singing and songwriting duties with spike-haired drummer Evan Dando. This was, as Fire records would have it so crassly as the title of the set (including stickers. Yay. Stickers) that collects these three releases, ‘When The Lemonheads Were Punk’. Well, it’s true. They were. And here’s the evidence.\n\nBack in ’87, a year after the release of their debut EP – the scrappy, punch-drunk Laughing All The Way To The Cleaners - the band threw out their debut proper; the brilliantly titled Hate Your Friends, the first in this batch of reissues. It’s frantic, fitfully exciting and has occasional moments of brilliance. The downstroke heavy post-hardcore is as snot-nosed as you’d expect, but Deily’s Bob Mould-inspired melodies on songs like ‘Second Chance’ and the gorgeous ‘Uhhh’ (which also boasts a raw, fiercely heartbroken vocal from him) are a blossoming delight.\n\nThe lowest moments here are the ‘oh, of course’ punk-pop cover of ‘Amazing Grace’ (which must have seemed like a great idea at someone’s keg party) and the fact that Dando is nowhere near being a good songwriter at this stage, despite steering the stumbling, collapsing title track and giving out a gnarled, strangled vocal on the passable ‘Nothing True’. This was a band more intent on playing as fast and hard as they were capable than in the nuances of either songcraft or tunefulness, though there are flecks of imagination here that add a little colour to the heads down black and white tone of the record.\n\nThe extras here are fine. They include a cover of Big Star’s ‘Mod Lang’ that’s not as bad as you’d fear, Dando’s wavering vocal perfectly expressing the song’s naïve desires. There’s also ‘Sad Girl’ which, had it made it on to the album proper, might have been the most melodic thing on it. There’s a set from WERS Radio in ’87 that has the band knocking out songs in breathless fashion, pausing only to ask for pledges toward the publicly funded station. There’s a storming version of The Users’ anthem ‘Sick Of You’, as well as an early take on ‘Falling’ which would end up on follow-up album Creator.\n\nCreator is a ripped-jean stride on from Hate…, and it’s clear from the off that Dando has chanced upon at least a prelude version of the magic musical formula that would eventually serve him so well. ‘Clang Bang Clang’ with its ragged, shimmering chorus and suntanned melody, is a jolt of suburban twilight pop that clashes horribly with the following song ‘Out’, a sloppy fallabout of stoner thrash that foreshadows Dando’s stunned slurring of the more distant future.\n\nWhen it seems Dando is about to run away with the record, Deily drops the glorious proto-emo of ‘Two Weeks In Another Town’, then the wonderful, plaintive ‘Postcard’. Conversely, Dando is guilty not only of a Charles Manson cover but then of murdering Kiss’ ‘Plaster Caster’ too. If he told you at this stage he’d go on to make a neat career sideline in reinterpretations of other people’s songs, you’d pull the Sham 69 patch off his jacket. It’s interesting to note that Deily’s style – sweet, well-observed and boasting power-out minor chord anthemic qualities – could easily be equated with that of Dando’s later collaborator and the writer of many of the ‘modern’ Lemonheads best songs, Tom Morgan.\n\nRegardless, on the extra tracks the band are back at WERS, Dando muttering “Yogi Bear for President” for reasons only known to himself before launching into a set that sounds, frankly, huge. Messier, even than their ’87 session, they absolutely thunder through this. Loud, unhinged and vital, the highlight is a thrashing, spitting ‘Crash Bang Clang’ that can barely stay on it’s feet.\n\nOne would assume that the fanboy draw here is a live version of Blake Babies’ favourite ‘From Here To Burma’, with future Lemonhead and Dando companion Julianna Hatfield on lead vocal. She’s dreadful here, out of tune throughout and a reminder as much as her terrible performance at their two-hander performance at Queen Elizabeth Hall last year, that she can be unutterably awful at times despite her obvious talent.\n\nThough the Lemonheads had split after Creator – tensions between Deilly and Dando rising to breaking point it seems – they pulled themselves back together to tour Europe and create Lick, a patchwork of fresh recordings of old b-sides, covers and a few new songs. For a plate of reheated leftovers this is pretty tasty – opener ‘Mallo Cup’ introduces us to a new Lemonheads – the folk-pop metalheads who’d go on to become one of the more beloved artifacts of the 1990s. It fuzzes and swoons, Dando chugs and croons, stoned romance pouring from the speakers “I never can forget/I ain’t remembered yet/Like mackerel in a net/I forget to forget.” Opening line “Here I am outside your house at 3am/trying to think you out of bed” sets the scene for the teen devotion that was headed Dando’s way, summing up in a line the lunk-headed handsome naivety that would make the indie world fall so hard in love with him. Dando’s ‘A Circle of One’ is also simple, sad and superb.\n\nStrangely ‘Glad I Don’t Know’ re-recorded from the ’86 Laughing All the Way to the Cleaners EP sounds entirely contemporary - a fizzing punk-pop blast, an ice cold coke in the face. Deily’s ‘7 Powers’ has a sweet and sour riff to drop to your knees for, “Don’t ever go / You know I need you so” he pleads in that adorable teenage way. Deily’s best ever Lemonheads song ‘Anyway’ is a powerhouse of luscious melody and a vaulting, heartsick chorus “I loved you so but that was long ago/But it only takes a day, it doesn’t matter anyway”, ‘Sad Girl’ (intended for Hate Your Friends) is another stinging sherbert delight.\n\nPerhaps the key song here is Dando’s notorious cover of Suzanne Vega’s ‘Luka’ – relating to the original in only a tangential way, it shows Dando’s sudden knack for shaping unlikely source material in his own image and creating something entirely other along the way. His interpretation sounds like a party gone wrong, a nursery rhyme warped out of shape, a metallic romp with it’s legs pulled from under it, finally a wail of oppression that matches anything in the staid, glum original.\n\nIn the extras, original versions of the reworked material are a solid inclusion though the Lick versions are uniformly superior, a live take on ‘Mallo Cup’ is a delight – illustrating that Dando’s tendency to mumble lackadaisically through his sets had an earlier onset than his fame. There’s also an amusing interview track that purports to be with Evan Dando but is clearly with a hyper Corey Loog Brennan, who firstly intimates that the band are only interested in aping bands from Minneapolis then goes on to deride Lick as a few b-sides and covers chucked together to create the impression of an album. Well, it’s good to be a realist, but this is by far the finest album in the reissue set, and boasts the most interesting package of extras.\n\nOf course this was the end for the Dando/Deily Lemonheads (until they reconvened in the studio under the fanboy eye of producer Ryan Adams earlier this year) and next, in 1990 we’d have the glorious Lovey and Dando as a nu-hippy heartthrob in waiting. In ’92 they’d release perhaps the most wonderful summer album of all time in the shape of It’s A Shame About Ray, and their legend would be set.\n\nThis collection is undoubtedly an interesting document of the journey Dando was starting out on. But that’s really only half the tale. The rest of the story is about how the now-forgotten Deily was a songwriter of some charm and substance whose talent was subsumed by his former bandmate’s fame. It was an undeserved fate and at least half the reason to pick up these records is to sample his offerings to a nascent punk band that went on, without him, to be a minor cultural phenomenon."}]}