{"In addition to his work with The Lemonheads, Dan Stearns has also released several solo albums and collaborated with other artists.": [{"url": "https://www.museumoflost.com/the-evan-dando-incident/", "page_content": "Evan Dando was a rock star with a well-known drug problem. His 2003 meltdown at a gig in Melbourne became the stuff of local music legend.\n\nEvan Dando was born in Massachusetts in March 1967.\n\nHis parents moved to Boston when he was 10, and he attended the Commonwealth High School on the north shore. A mediocre student, Dando became interested in music and formed his first band with two schoolmates when he was a teenager.\n\nOriginally called 'Whelp!', this group would gradually morph into 'The Lemonheads', taking their name from a popular item of candy.\n\nThe Lemonheads released an EP and three albums on a small label, and regularly played local venues. They did not initially find much success; Dando even left the group for a time, appearing with other bands before taking off on an extended backpacking holiday.\n\nHe eventually made his way to Australia, bumming his way up and down the east coast, surfing and checking out the local music scene.\n\nDuring this period, Dando became friendly with two local musicians; Tom Morgan and Nic Dalton.\n\nMorgan and Dalton, best known locally as part of the band 'Smudge', considered starting a band with Dando, although in the end the three just wrote music together, and hung out.\n\nDando would take these songs with him back to America, when he returned in 1990.\n\nRejoining The Lemonheads, Dando's experience in Australia would form the backbone of what would be the band's breakthrough record.\n\nTheir 1992 album, 'It's a Shame About Ray', was a critical and commercial success, and one of the defining records of the era. The band's jangling guitars, and Dando's bittersweet, melodic voice, perfectly complemented each other on a series of classically styled pop songs.\n\nThe band's fame was assured when they produced an enduringly popular, punk-style cover of the Simon and Garfunkel track 'Mrs Robinson.' Dalton would subsequently join the Lemonheads himself, and serve as one of their guitarists, playing and touring for two years, before returning to Australia.\n\nHandsome, sensitive and laconic, Evan Dando seemed like the quintessential 90s rockstar. He also developed a drug problem; he drank heavily, smoked crack cocaine, and his behaviour was erratic at times.\n\nThe Lemonheads released a follow-up album, 'Car Button Cloth', in 1996 that was well received but less successful. They split up the following year.\n\nWithout the band to focus his energy, Dando's drug and alcohol problems worsened and his behaviour became increasingly unpredictable. Appearing as a solo act, although mostly still playing Lemonheads songs, he sometimes seemed disoriented onstage. On a few occasions, he even just walked off in the middle of a set.\n\nIn 2003, Dando finally faced his drug problems and entered rehab.\n\nThis appeared to be successful, and after his recovery he recorded his first solo album of new material, 'Baby I'm Bored'. The cleaned up, healthier singer would support this album with a world tour.\n\nFor the Australian leg, Dando turned to his old friend and colleague Dalton, asking him to play bass. Dalton agreed, and became part of what appeared to be something of an alt-rock supergroup; alongside Dando and Dalton were former Dinosaur jr drummer George Berz, and You Am I guitarist Davey Lane.\n\nAs part of this tour, two shows were set for Melbourne, in August 2003.\n\nBut it soon became apparent that Dando's new, cleaner lifestyle had not entirely taken hold.\n\nSporting a beard, a trench coat and heavy, lidded eyes, Dando's first show at The Prince was something of a mess. The singer began his set by mocking the venue:\n\n'This place used to rule! Now it sucks. God bless gentrification, right?' - Evan Dando, on stage at The Prince\n\nThings went downhill from there.\n\nClearly intoxicated, Dando mumbled his way through most of the songs, slurring the words incoherently. He appeared completely lost at times, and stood inertly for long stretches, as the band struggled to find its rhythm.\n\n'The gig was a sonic disaster. To call the band under-rehearsed would be kind, and Dando's slacker dude persona is a habit he could afford to lose. With much apology, Dando would blame the shambles on jetlag and food poisoning. Apology was certainly due.' - Michael Dwyer, review in 'The Age'\n\nStanding on the corner of the stage, Dalton plucked at his bass, looking unimpressed. He would leave the band immediately after the show, his participation in the tour over.\n\nAlthough whether he was fired, as originally announced, or left as a protest against Dando's behaviour, was never confirmed. Dalton later commented that he left because he was 'unwell'.\n\nWhatever the explanation, with a second show the following night, Dando was now without a bass player. Whether due to his own laid back nature, or because he was not making clear decisions, he simply decided to forge on without one.\n\nThe second Melbourne gig was set for August 2, 2003 at The Hi Fi Bar on Swanston Street. It would go down as one of the most notorious gigs in the city's long live music history.\n\nThe night started unremarkably: Dando onstage, by himself, singing 'The Outdoor Type'. He appeared in control of himself, his long hair hanging across his face, shirtless under a heavy jacket.\n\nThings became strange as the rest of the band joined him for the next song.\n\nAccompanying the group onstage was an unknown young girl, who promptly joined Dando at the microphone.\n\nTo everyone's amazement, the girl then proceeded to hold up lyric sheets for Dando to sing from. He required help to remember the words to his own famous songs.\n\nLater, at Dando's urging, the girl would even join in on some of them, singing soft back up vocals to the mystification of everyone present.\n\n'What followed was a show that resembled a train wreck. Perhaps hinting at the reason for the onstage disarray, Dando announced a shopping list of drugs that would be available backstage, for 'anyone who has a backstage pass.' For an encore, Dando returned to the stage alone, hopping onto the drums for a wild, messy, solo medley. Some fans cheered, but most were gape mouthed. A lot had already left in disgust. This was a performance that will surely go down as one of the most shambolic ever staged in Melbourne.' - Jo Roberts, review in 'The Age'\n\nAs a remarkable epilogue to the story, the young girl on stage would later find fame herself as the singer Missy Higgins.\n\nHiggins, a Lemonheads fan but then totally unknown, had talked her way into the sound check earlier in the day, in the hope of catching a glimpse of Dando. She and Dando had begun talking, and he had impulsively insisted that she join the band on stage.\n\nDespite the chaos of the Melbourne shows, the group was able to salvage something from the rest of the tour. Dando had gathered himself somewhat by the time they played in Sydney a week later, and the musicians had more time to rehearse, making for a tighter live set.\n\nReviews for the Sydney shows were moderately positive, and the tour continued.\n\nIn subsequent years, Dando has continued an up and down trajectory.\n\nHe has detoxed, and relapsed, a number of times. He still tours regularly, and has been back to Australia for other solo performances. His live presence remains hit and miss; there are good shows and bad, which has almost become part of buying a ticket to watch him perform.\n\nYou never know which Evan Dando will show up.\n\nRecalling his infamous Hi Fi Bar gig in an interview in 2006, Dando simply dismissed the whole thing:\n\n'The only thing I regret now is that everyone remembers it. People keep writing about it, and I can't believe people are still interested in that shit.' - Evan Dando\n\nMore MUSEUM OF LOST"}, {"url": "https://guitar.com/guides/essential-guide/guitar-legends-mark-knopfler-the-guitarist-with-inimitable-touch/", "page_content": "With one of the most recognisable sounds in the history of modern guitar, Mark Knopfler is the sort of player that it’s sometimes best to just sit back and enjoy. You won’t likely to be able to play exactly like him.\n\nWith a career now into its sixth decade, Knopfler has sold over 120 million albums and can still sell-out Madison Square Garden at the age of 70 (2019). Even if his core sound is unmistakeable, he’s played a vast array of top-class new and vintage guitars over the years, which often change from album to album. We’ll try and summarise here…\n\nIn his own words…\n\n“Success I adore. It means I can buy 1959 Gibson Les Pauls and Triumph motorcycles. But I detest fame. It interferes with what you do and has no redeeming features at all.”\n\n“I don’t care how many jazz lessons you’ve taken, I don’t care how many modal dingbats you know. This is all shit! You should have enough reverence for music to make your own education.”\n\n“I was sleeping on the floor in somebody’s apartment. They had a cheap imitation of a Gibson Dove acoustic with unbelievably light strings. It was like playing an electric guitar, but there was a little bit of sound to it. You couldn’t really strum or bash it, so I had to fingerpick. As I was flying around this guitar, I realised I was doing things with my fingers that I could do with a pick and also some other things that I wouldn’t be able to do with a pick. Playing with your fingers has something to do with immediacy and soul…”\n\nKnopfler’s early Gibsons and Fenders….\n\nIt may have seemed odd when Knopfler – for so long associated with Fenders – became a signature Gibson artist in 2016, but he bought his first Gibson circa 1971, when he was 22. He played a second-hand £80 double-cutaway Les Paul Special in early band Café Racers, and it’s also on the Dire Straits début album of 1978.\n\n“We played in pubs in London,” Knopfler later remembered. “I just had this 30-watt amplifier; we used to stick it up on two wooden chairs. I used to play a Gibson Les Paul Special with a pick. [Knopfler later developed his fingers-only style – Ed.] My friend Steve Phillips and I painstakingly stripped it and got it back to its original cherry finish, and it was everything to me. I don’t know whether I slept with it, but it wasn’t far off! So that’s where Gibson started in my life, and that guitar will always have a special place in my heart.”\n\nBut by the time of Dire Straits debuting properly, Knopfler had a 1961/’62 Fender Stratocaster which would became his main guitar of the first four Dire Straits albums… and his early signature sound. He bought his second-hand 1961/’62 Strat around 1977, in a stripped-back condition (the alder body was bare timber). It came with its original Fender pickups, replaced by Knopfler with DiMarzio FS-1. Note that in the 1990s, Knopfler would go back to original Fender pickups.\n\nYou can see this bare wood rosewood board Strat in early DS footage and also a bright red Strat with a rosewood board. But they are the same guitar: Knopfler had his favourite Strat refinished in late ’78 in a colour a lot brighter than Fender’s stock Fiesta Red.\n\nKnopfler also acquired a second red Strat with an all-maple neck. This is thought to be a 1962 (base model) though there are plenty of suggestions bits were added from a Japanese Fender Strat at various times. On occasion, the whole pickup/scratchplate was taken out of the ’61 and put in the ’62. Can’t do that with a vintage Gibson!\n\nOn the first Dire Straits record, Knopfler also played his National Style O, bought off his Newcastle buddy Steve Phillips way before Dire Straits. (Note that Phillips was in The Notting Hillbillies side-project with Knopfler and Brendan Croker from the mid 80s). MK also had an even earlier 1920s tricone National “bought from an old man in Wales”. Very nice vintage guitars but, frankly, they were out of vogue at the time and probably quite affordable.\n\nIt was these two Nationals on all early albums: from the eponymous début’s Water Of Love and Wild West End through the massive breakthrough Romeo And Juliet, from third album Making Movies (1980). And the late 30s National would later become iconic as the cover image of Brothers In Arms (1985).\n\nThe big time = ‘Super Strats’\n\nPreparation for that third Dire Straits album Making Movies (1980) saw brother David Knopfler leave (he wasn’t happy with his brother’s ‘dictatorial’ style) but also brought a found wealth for the band. Knopfler started playing Schecter-made Fender-alikes, both in Strat and Tele formats. A sunburst Schecter ‘Strat’ is featured throughout and there was also a black Tele-style Schecter. The sunburst Schecter has become known as the ‘Dream Machine’ among Knopfler aficionados: it was bought and stolen in 1980, like it was barely there! Naturally, Knopfler replaced it… with Dream Machine II. This was almost identical specs-wise but was more visually unique: it had a birds eye maple neck with no dot markers, plus a ‘tarnished’ metal scratchplate and knobs. This was used live and for fourth album Love Over Gold and some of the epic soloing on the Alchemy live album.\n\nIt’s another guitar gone from Knopfler’s possession, though – he donated it to Eric Clapton’s second Crossroad’s guitar auction in 2004, where it fetched $50,190.\n\nThe main guitar used live in the early 80s though, was a Candy Apple Red Schecter (similar, but for the finish). Knopfler’s use of modern Strat-alikes was perhaps just practical: success had afforded him indulgences that he rarely took on the road, such as an all-original sunburst ’54 Fender he called the ‘Jurassic Strat.’\n\nAlso on Love Over Gold, Knopfler started playing a then-just-launched Gibson Chet Atkins CE nylon string. It’s to the fore on Private Investigations and Love Over Gold itself, and with Mark and Chet by now good friends, they swapped notes. Although highly-praised as electric-classicals, the guitars are no longer made by Gibson… expect to pay £2k upwards for a fine second-hand example.\n\nBrothers in arms and Gibsons\n\nDire Straits’ fifth album, Brothers In Arms saw yet another overhaul in MK’s guitar armoury: looking both back and forward.\n\nKnopfler got back into Gibson Les Pauls in the 80s. He was looking for new tones beyond his single-coil guitars, and bought a Les Paul reissue sunburst, from fabled NYC store owner/luthier/ friend Rudy Pensa. Note that, prior to 1983, Gibson didn’t actually call these Les Pauls ‘Reissues’. Observers claim the serial number – apparently 90006 – points to an ’83 or ’84, but Knopfler himself has referenced one his LPs of that time as a ‘70s’. The intricacies of late 70s-to-early-80s Les Paul “Preissues” is convoluted anyway, as are the serial numbers. Gibson in Kalamazoo made quite a few one-offs for either select dealers (such as Pensa) or intended for the Japanese market.\n\nKnopfler also had Strat-alikes built by Rudy Pensa: and one, forward thinking for the time, was really a guitar controller. Knopfler’s black Pensa had a ton of knobs and was basically custom guitar made to control (when needed) a Synclavier II synth. You possibly wouldn’t associate a traditionalist such as Knopfler with ‘guitar synthesis’, but this gear came into its own on quite a few Dire Straits tracks (So Far Away being the main hit) and his burgeoning soundtrack career (Last Exit To Brooklyn, Local Hero…)\n\nBut back to the Les Paul. It was likely this 80s ‘preissue’ (though not the same one seen at Live Aid 1985 – see later) that brought a new Dire Straits sound to Money For Nothing and also the track Brothers In Arms.\n\nThe much-sought-after Money For Nothing tone can lead to a wormhole. The main route is: It came from Knopfler playing around with a Les Paul and a Dunlop Cry Baby wah pedal. When he found the exact ‘quack’ sound he wanted, he got legendary tech Pete Cornish to build the circuit’s sound into a rack, which was still controllable via a screwdriver-controlled pot.\n\nThe pickups were also rewired by Knopfler’s tech, Ron Eve. In the Haynes Gibson Les Paul Manual, Eve explains, “Mark’s Les Paul is a beauty, even though it’s a reissue. I rewired the pickups so that the central position selector combined them ‘out of phase’. This trick was shown to me by a luthier in London a long time ago, Sam Lee, who did it accidentally on Peter Green’s Les Paul. If you listen closely to the early Fleetwood Mac albums you can hear the type of sound made.”\n\nBut the other route? It’s less complex and gritty. Album engineer/co-producer Neil Dorfsman told Sound on Sound magazine of Money For Nothing, he recalled: “I remember Mark’s Les Paul Junior going through a Laney amp, and that was the sound of Money For Nothing.”\n\nStandard? Junior? Rack? You’ll need Knopfler’s fingers to get it right anyway.\n\nKnopfler’s trusty Schecters, new Pensa-Suhrs, a touch of National (on the The Man’s Too Strong) and old Strats did the heavy lifting on Brothers In Arms. But the Les Paul was clearly gaining favour. Knopfler toured extensively with his main Les Paul Standard, but also treated himself to a Gibson Custom Shop model. His second LP Standard ‘reissue’ was built by Gibson Custom circa ’84 with the one-off serial number 12849: Knopfler was born 12 August 1949. Mark used this guitar on stage during the Brothers In Arms tour and, notably, at Live Aid in July 1985. Knopfler later recalled: “That was a nice guitar, but it was all about fancy-looking tops, you know? I think a lot of English players actually prefer the plain top, which I do.”\n\nThe then-new Pensa-Suhr custom guitars of Knopfler (late 80s onwards) were a way of combining his love of both Fender and Gibson tones. Often luxuriantly topped with quilted maple as of the era, they sometimes had a bucker in the bridge: other times P-90s. The guitars made Rudy Pensa’s name famous worldwide: the Pensa MKI, MKII and MKD are still made and Knopfler still plays them. That said, they were only used in Dire Straits for the band’s final album, On Every Street (1991).\n\nKnopfler’s genuine ‘burst beauties\n\nIf Knopfler said he could “never afford” a genuine ‘58 or ‘59 vintage sunburst Standard in the 80s, he certainly could by the 1990s. So, in 1995 and now as a solo artist, he bought one ’58 and one ’59. “Man, I didn’t realise what I’d been missing all these years!” he told Vintage Guitar.\n\nThe ’58 is his favourite, replicated as the Gibson Custom Mark Knopfler 1958 Les Paul. With reference to the “plain top” he previously remarked about preferring, he says, “My ’58’s kind of a yellowish top, and I really like that – a pale burst. I’m not a big fan of all this over-glossy tiger-stripe thing.” His original Gibson 1958 Les Paul was a go-to guitar for the Golden Heart tour in 1996 and has been played on numerous tracks and albums since – Sailing To Philadelphia, Shangri-La, Kill To Get Crimson, Get Lucky, Privateering et al.\n\nREAD MORE: An oral history of the Gibson Les Paul\n\nHe also has quite a few Gibson ES-330s and ES-335s. He borrowed a 335 for his guesting on Bob Dylan’s Slow Train Coming and later acquired his own ES-330s (vintage ‘58 and ‘60) and ES-335s (‘58, ‘59 and ‘60). His blonde ‘59 ES-335 is another favourite: “On (Sailing to Philadelphia’s) Baloney, that’s a ’59 335 – again with a nice, fat neck – that I got through Rudy (Pensa).”\n\nHe also has some beautiful old big-bodied Gibsons: a 1960 L-5 CES (used on the Notting Hillbillies album), a 1960 ES-175D (Brothers In Arms) and a rare 1953 Super 400 CES (On Every Street, live, and at the Elvis Presley tribute shows with Scotty Moore).\n\nDespite all that, he’s probably still best-known for his Strat tones, and it was inevitable he got his own Fender Mark Knopfler Stratocaster in the 2000s (now discontinued). It’s not particularly flashy, lovely though it is: it has a ‘57-style ash body and a vintage tinted ´62 C-shaped maple neck with rosewood fingerboard. The pickups were three Texas Special single-coil pickups with five-way switching and the colour was dubbed Hot Rod Red. You’ll pay upwards of £2k for a prime-condition used one.\n\nThe closest you’ll get new is perhaps the Fender American Professional Stratocaster in Fiesta Red. That itself is a limited edition.\n\nAmps And effects\n\nIn contrast to his massive haul of vintage guitars, Knopfler’s amps have remained relatively simple. A Fender Vibrolux and a Fender Twin Reverb were the backbone of early albums. Then he had a Mesa/Boogie MkIIB (around 1982) and he later switched to Soldano SL0 100s. Perhaps surprisingly, he’s now started using Kemper Profilers as his stage amps.\n\nLikewise with effects; from 1980, he had Pete Cornish build him a custom rack and we can’t vouch to know exactly what’s in there. But notable FX over the years are a Dan Armstrong Orange Squeezer compressor (early Dire Straits), and a Crowther Hotcake overdrive. Most important is his mastery of using a volume pedal for his inimitable dynamics. He’s tended towards Ernie Ball and Morley models.\n\nEssential listening\n\nWith a huge back catalogue, it’s tough to recommend just a few albums. Dire Straits’ hit singles are really the tip of a mighty iceberg. The eponymous debut (1978) is still a great opening salvo, Making Movies (1980) saw Knopfler writing much more ambitious songs like some kind of Geordie Springsteen, and Love Over Gold (1982) is totally epic: it’s only five songs, with opener Telegraph Road hitting 14 minutes. And, of course, Brothers In Arms was simply ubiquitous – it became the best-selling CD in the UK ever.\n\nWith his more numerous solo albums, it’s just as hard. That said, Sailing To Philadelphia and Privateering are highly recommended. And for songcraft, All The Roadrunning, his duet album with Emmylou Harris, is very fine. In truth, he doesn’t ever make bad records.\n\n﻿\n\nPlaying style\n\nThis is the hard bit, as Knopfler is unique – to his numerous fans, he’s simply the ‘best’ guitarist in the world. He plays fingerstyle nearly all of the time, anchoring his right pinky and fourth finger to the guitar’s top and his thumb usually straight. So he fingerpicks with just three digits.\n\nHis stabbing fills were a signature of early records, alongside a peerless sense of melody. He can play very fast indeed, but he’s became increasingly well-known for his achingly lyrical bluesy licks as well: think of Brothers In Arms (the track) and Telegraph Road. Oh, and he’s actually left-handed as well! He’s a one-off."}, {"url": "https://language.chinadaily.com.cn/trans/2007-10/10/content_6162450.htm", "page_content": "画蛇添足，多此一举\n\n[ 2007-10-10 08:40 ]\n\n还记得小时候看画蛇添足的动画片时，觉得那个人好傻呀，画完没事就歇着呗，干吗非得给蛇添上一双脚呢。其实，长大之后发现，很多时候我们也会犯画蛇添足、多此一举的错误。那么，英语里的“多此一举”怎么说呢？即“gild the lily”。\n\n“Gild the lily”字面意思是“给百合花镀金”。这种表达方式来自戏剧大师莎士比亚。他在历史剧《约翰王》中写道：To gild refined gold, to paint the lily, to throw a perfume on the violet, to smooth the ice, or add another hue unto the rainbow... is wasteful and ridiculous excess.（给金子镀上金箔，给百合涂上颜色，给紫罗兰洒香水，把冰磨光滑，给彩虹添颜色，是多此一举的。）后来，“paint the lily”就演变成了“gild the lily”。\n\n看下面例句：\n\nComment on this would be to gild the lily.（对此发表评说无异于画蛇添足。）\n\n（英语点津 Linda 编辑）"}, {"url": "https://theatreandfilm.olemiss.edu/DanStearns.html", "page_content": "Assistant Professor of Acting\n\n\n\nDan Stearns is Assistant Professor of Acting in the Department of Theatre and Film. In 2009 he received his MFA from the Shakespeare Theatre's Academy for Classical Acting at the George Washington University. He holds two degrees from the University of Chicago where he was also a Lecturer in both Humanities and Theater and Performance Studies, as well as production manager of University Theater. He has extensive experience in theatrical production. In addition to acting on stage and screen Dan has an interest in Russian drama. His translation of Leonid Andreev's He Who Gets Slapped was produced at the University of Victoria, BC, where he was an Orion Fellow in the Arts. While living in Chicago he worked at the Goodman Theatre, Steppenwolf Theatre Company, Chicago Shakespeare Theater, and others; regionally he has worked in Richmond, VA, Iowa City, IA, and East Hampton, NY. His on-camera experience includes television, commercials, industrial film, independent film, and new media. He is a proud member of Actors' Equity Association, SAG-AFTRA, and the Society of American Fight Directors.\n\nAreas of Specialization include acting for stage and screen, Shakespeare, actor training."}, {"url": "https://www.biography.com/musicians/freddie-mercury", "page_content": "(1946-1991)\n\nWho Was Freddie Mercury?\n\nFreddie Mercury was a singer-songwriter and musician whose music reached the top of U.S. and British charts in the 1970s and 1980s. As the frontman of Queen, Mercury was one of the most talented and innovative singers of the rock era. Born Farrokh Bulsara in Tanzania, Mercury studied piano in boarding school in India, then befriended numerous musicians at London's Ealing College of Art. Mercury died of AIDS-related bronchial pneumonia on November 24, 1991, at age 45.\n\nEarly Life\n\nMercury was born Farrokh Bulsara on September 5, 1946, in Zanzibar. Mercury's parents, Bomi and Jer Bulsara, were Parsees, or followers of the Zoroastrian religion whose ancestors came from Persia. After Bomi and Jer married, they moved to Zanzibar, Tanzania, where Bomi worked as a cashier for the British government's High Court. The family lived a fairly affluent life, with a nanny and other domestic workers. Mercury's sister, Kashmira, was born in 1952.\n\nAt the age of 8, Mercury's parents sent him to a boarding school in Bombay (now Mumbai), India, where he studied piano and spent his free time with his aunt and grandparents. It was not long before the charismatic young man joined his first band, the Hectics. In 1963, Mercury returned to Zanzibar.\n\nFollowing a bloody revolution on the islands in 1964, the family fled to London. Mercury attended the Ealing College of Art and befriended a number of musicians.\n\nIn 1969, Mercury joined a group called Ibex as their lead singer. He played with a few other bands before joining forces with his future Queen bandmates.\n\nTeeth and Vocal Range\n\nMercury was born with four extra teeth in the back of his mouth, causing his now-famous bucktooth grin. In fact, his nickname growing up was Bucky.\n\nMercury never got his teeth fixed because he was afraid it would ruin his impressive four-octave vocal range.\n\nQueen\n\nMercury met his future bandmates, drummer Roger Taylor and guitarist Brian May, around the time he moved to London in the 1960s. They met up with bassist John Deacon in 1971. The quartet, which Mercury dubbed Queen, played their first gig together that June.\n\nREAD MORE: Freddie Mercury Was Part of Brian May and Roger Taylor's Entourage Before Forming Queen\n\nIn 1973, Queen released their first album, titled Queen. They quickly followed up with their second album, Queen II, in 1974, which they recorded in over just one month. The album was the first taste of the group's signature harmonies and music styles, including ballads, folk, blues, metal, pop and rock, and included the single \"Seven Seas of Rhye.\"\n\nQueen's music, however, really only caught on with their third record, Sheer Heart Attack, also released in 1974.\n\nWith a sound that has been described as a fusion of hard rock and glam rock, Queen had an even bigger hit the following year with their fourth album, A Night at the Opera (1975).\n\nQueen's popularity continued to soar through the late 70s and early 80s with A Day at the Races (1976), News of the World (1978) and The Game (1980). After The Works (1984), the group's ability to sell albums began to wane, although Queen continued to draw huge crowds as a live act around the world.\n\nIn addition to his talents as a singer and songwriter, Mercury was a skilled showman. He knew how to entertain audiences and how to connect with them. He liked to wear costumes — often featuring skintight spandex — and strutted around the stage, encouraging fans to join in the fun. Artistic in nature, Mercury was also actively involved in designing the art for many of the group's albums.\n\nMercury also lived a lavish lifestyle. He loved champagne and liked to collect art, once spending more than $400,000 on a set of hand-painted china. Always one for a party, Mercury threw himself elaborate celebrations; for one particular birthday, he flew a group of friends to the island of Ibiza. The occasion was marked by fireworks and flamenco dancing.\n\nBy 1989, Mercury largely retreated from public life. He did not promote or tour for Queen's next album, Innuendo (1991), and rumors about possible health problems began to circulate.\n\nBefore his death, Mercury worked in the studio with Queen. These efforts were released in 1995 on Made In Heaven, the group's last album with all the original members. Gone but clearly not forgotten, this collection of Mercury's final performances reached the top of the British charts.\n\nMercury and Queen were recognized for their contributions to American music history when they were inducted into the Rock and Roll Hall of Fame in 2001.\n\nSongs by Freddie Mercury and Queen\n\n'Killer Queen'\n\nQueen's third album, Sheer Heart Attack, featured their first hit, \"Killer Queen,\" a song about a high-class call girl. The 1974 single hit No. 2 on the U.K. charts, and peaked at No. 12 in the U.S. Unlike most of his other music, Mercury wrote the lyrics before the music.\n\n'Bohemian Rhapsody'\n\nMercury wrote the song \"Bohemian Rhapsody,\" a seven-minute rock operetta for the 1975 album, A Night at the Opera. Overdubbing his voice, Mercury showed off his four-octave vocal range on this innovative track. The song hit the top of the charts in Britain and became a Top 10 hit in the United States.\n\n'We Are the Champions' and 'We Will Rock You'\n\nThe 1978 hit \"We Are the Champions,\" off of the album News of the World, became a Top 10 song in the United States and in Britain. It was featured on a single with \"We Will Rock You.\" Both songs have taken on a life of their own as popular anthems played at sporting events.\n\n'Another One Bites the Dust'\n\nAlways exploring new and different sounds, Queen tried their hand at the big music trend of the time with the disco-flavored \"Another One Bites the Dust,\" from their 1980 album The Game.\n\n'Crazy Little Thing Called Love'\n\nAlso on of The Game, Mercury and the rest of the band showed their range as performers with the rockabilly-influenced 1980 hit \"Crazy Little Thing Called Love,\" which Mercury penned.\n\n'Under Pressure' with David Bowie\n\nIn 1981, Queen collaborated with David Bowie to create \"Under Pressure.\" A No. 1 hit in Britain, the song's distinctive bass line was later reportedly used by Vanilla Ice for his 1990 rap hit \"Ice, Ice Baby.\"\n\nREAD MORE: Inside David Bowie and Queen’s 'Tense' Recording Session for \"Under Pressure\"\n\n'Radio Ga Ga'\n\nAlthough Queen's popularity began to wane in the mid-1980s, the group had a minor hit in 1984 with \"Radio Ga Ga.\" Pop musician Lady Gaga took inspiration for her stage name from the song.\n\nSolo Career\n\nIn addition to his work with Queen, Mercury released several solo albums, including 1985's Mr. Bad Guy. He also collaborated with opera singer Montserrat Caballé for 1988's Barcelona.\n\nLive Aid Performance\n\nOne of Queen's most notable performances was in 1985 at the Live Aid charity concert. Simply dressed in a tank top and jeans, Mercury led the crowd through some of the band's greatest hits with great energy and style. He got the thousands of music fans at London's Wembley Stadium to chant along to \"We Will Rock You.\"\n\nFor many who watched the event live or on television, Queen gave one of the top performances of the day-long event, which was organized by singer and activist Bob Geldof and songwriter Midge Ure to raise money for victims of famine in Africa. Inspired by the event, the band wrote the hit \"One Vision.\"\n\nFiancé Mary Austin\n\nOffstage, Mercury was open about his bisexuality, but he kept his relationships private. He was engaged to Mary Austin and had a seven-year relationship with Jim Hutton until his untimely death.\n\nAustin met Mercury in 1969 when she was a 19-year-old music store employee and he was a 24-year-old on the cusp of stardom. They quickly began dating; Mercury wrote the ballad “Love of My Life\" for Austin.\n\nIn 1973 Mercury proposed; the wedding was called off when he revealed to her that he was bisexual. The pair remained close, and Austin tended to Mercury after his AIDS diagnosis. Mercury entrusted most of his estate and his London mansion, Garden Lodge, to Austin, who later married and had two kids.\n\n“All my lovers asked me why they couldn’t replace Mary, but it’s simply impossible,” Mercury said in a 1985 interview. “The only friend I’ve got is Mary, and I don’t want anybody else. To me, she was my common-law wife. To me, it was a marriage. We believe in each other, that’s enough for me.”\n\nREAD MORE: Meet Mary Austin, the Woman Who Stole Freddie Mercury's Heart\n\nBoyfriend Jim Hutton\n\nMercury met Hutton, an Irish hairdresser, in the 1980s at a gay nightclub in London. Mercury offered to buy Hutton a drink; Hutton didn't recognize the superstar and turned him down.\n\nThe pair reconnected a year and a half later at another night club. This time they began dating, and Hutton moved in with Mercury less than a year later. Although Mercury never came out, the couple stayed together until Mercury died of AIDS in 1991.\n\nAfter Mercury's death, Austin reportedly kicked Hutton out of Garden Lodge. Hutton later wrote a book about his relationship with the singer, Mercury and Me. He died of cancer in 2010 at the age of 60.\n\nREAD MORE: The Complicated Nature of Freddie Mercury's Sexuality\n\nDeath\n\nMercury died from AIDS-related bronchial pneumonia at his London mansion on November 24, 1991. He was 45 years old.\n\nThe day before his death, on November 23, 1991, Mercury released a statement: \"I wish to confirm that I have been tested HIV-positive and have AIDS. I felt it correct to keep this information private to date to protect the privacy of those around me. However, the time has come now for my friends and fans around the world to know the truth and I hope that everyone will join with my doctors and all those worldwide in the fight against this terrible disease.\"\n\nLongtime friend and bandmate Roger Taylor provided some insight to Mercury's decision to keep his battle with AIDS private. \"He didn't want to be looked at as an object of pity and curiosity, and he didn't want circling vultures over his head,\" Taylor said, according to a report in Entertainment Weekly. The rock world mourned the loss of one of its most versatile and engaging performers.\n\nTo honor his memory, the Freddie Mercury Tribute: Concert for AIDS Awareness was held in April 1992 at Wembley Stadium. A diverse range of rock acts — from Def Leppard to Elton John — performed to celebrate Mercury and advance the fight against the disease that took his life. That same year, Mercury's mock operatic masterpiece, \"Bohemian Rhapsody,\" appeared in the movie Wayne's World and made a return to the Billboard 100 pop charts, illustrating its timeless appeal.\n\n'Bohemian Rhapsody' Movie\n\nReleased in 2018, the movie Bohemian Rhapsody, starring Mr. Robot's Rami Malek as Mercury, follows the rise of Queen leading up to their legendary Live Aid performance in 1985.\n\nFollowing the movie's release, Queen's music saw a resurgence in popularity decades after their last studio album. The group's song \"Bohemian Rhapsody\" shot from 87th place globally on Spotify the day before the movie's release to 15th one week later, and it hit the Billboard 100 for a third time.\n\nQUICK FACTS\n\nBirth Year: 1946\n\nBirth date: September 5, 1946\n\nBirth City: Zanzibar\n\nBirth Country: Tanzania\n\nGender: Male\n\nBest Known For: Freddie Mercury is best known as one of the rock world's most versatile and engaging performers and for his mock operatic masterpiece, \"Bohemian Rhapsody.\"\n\nIndustries\n\nRock\n\nAstrological Sign: Virgo\n\nSchools\n\nEaling College of Art\n\nNacionalities\n\nTanzanian (Tanzania)\n\nDeath Year: 1991\n\nDeath date: November 24, 1991\n\nDeath City: London, England\n\nDeath Country: United Kingdom\n\nFact Check\n\nWe strive for accuracy and fairness.If you see something that doesn't look right,contact us!\n\nCITATION INFORMATION"}, {"url": "https://www.maveron.com/team/dan-levitan/", "page_content": "“Dan is the Godfather of consumer.” —Tim Brown, Co-CEO of Allbirds\n\nDan is our co-founder, partner, and tireless leader. Since starting the firm with Howard Schultz in 1998 (after helping the Starbucks team accomplish its blockbuster IPO as an investment banker in New York), Dan has been the person behind many of Maveron’s home runs.\n\nBack in the day, Dan climbed mountains. He scaled both Mt. Kilimanjaro and Mt. Rainier, climbing alongside a group of people who encouraged and supported each other to reach their goal. That’s not too bad of an analogy for Dan’s philosophy of working with our portfolio companies.\n\nDan found an unlikely mentor in Duke basketball coach Mike Krzyzewski. It was Krzyzewski who taught Dan the central lesson of Maveron’s consumer-focused success: always ask “Do you love your team?” Dan does— his colleagues, his investors and most of all, his entrepreneurs.\n\nIn addition to his work with Maveron companies, Dan currently serves as a member of the Boards of Trustees of Seattle Children’s Healthcare System and Seattle Children’s Hospital. He also serves on the Investment Advisory Committee for Seattle Children’s which oversees over $2B in AUM. Dan also is chair of Brothers for Life, a charity that helps wounded Israeli combat soldiers.\n\nDan has been recognized by Forbes on its Midas List as one of the industry’s top technology investors. Dan has also been named NASDAQ private company director of the year.\n\nGo-to app: Washington Post\n\nMost impactful brand on your life: Starbucks\n\nLast gift you gave: A kaleidoscope\n\nCompany that didn’t exist 5 years ago that has become essential to your life: Allbirds"}, {"url": "https://www.astrogrowth.com/blog/dan-pena/", "page_content": "Net Worth: $450 Million Age: 75 Born: August 10, 1945 Country of Origin: United States of America Source of Wealth: Entrepreneur Last Updated: 2020\n\nDan Pena is a successful entrepreneur, philanthropist, and motivational speaker. As a high-performance business coach, he has consulted in various industries such as coal, natural gas, and oil. He is famously known for his personal net worth and the net worth that he has helped others create.\n\nOver the years, he has developed the Quantum Leap Advantage from his endeavors in the business world, where he teaches his methods to eager entrepreneurs on how to create wealth.\n\nNet Worth of Dan Pena\n\nToday Dan Pena has a net worth of around $450 million. Pena is referred to as the $50 billion dollar man because that is how much wealth has been created by those he mentors using the Quantum Leap Advantage. With each year, that number is growing to the 1 Trillion dollar mark.\n\nEarly Life of Dan Pena\n\nIn his early life, Pena was not always the driven, high-performing man that he is today.\n\nThe Barrio Bad Boy of East Los Angeles\n\nPena did not come from a family with generational wealth. He was born on August 10th, 1945, in Jacksonville, Florida. His grandparents had migrated from Spain to Mexico. Then his mother and grandmother came to America in the 1940s after crossing the Rio Grande illegally. Later, his family moved to East Los Angeles. He became the first generation Mexican-American in his family. His mother was not a naturalized citizen until she was thirty years old.\n\nPena describes his barrio of East Los Angeles during the 1950s as a rough place with a life full of fighting.\n\nThe RFK Assassination Connection\n\nAs a man who believed in tough love, Dan's father, Manny Pena, was a lieutenant colonel in both WWII and the Korean War. After leaving the military, Manny joined the LAPD in 1947 and served for twenty-eight years where he grew to become a Lieutenant Commander.\n\nAfter retiring from the police force, Manny Pena was recruited by the CIA. As a CIA operative, Manny worked as lead investigator in the Robert F. Kennedy assassination. Many conspiracy theories claim that Manny Pena was responsible for covering up the ballistic's findings from the assassination of RFK. Pena also claims that his father was an assassin for the CIA and responsible for anywhere from nine to thirteen kills. Manny Pena passed away in 1991.\n\nDan Pena School Life\n\nWhile in grade school, Dan stayed in a lot of trouble. In one interview, he describes how he was expelled not only from his school but every school in the district for his unruly conduct with such acts as threatening to kill his teacher in which he attempted by dropping a glass aquarium on them.\n\nDuring his high school years as a young man, Pena had a track record and was notorious for fighting and causing trouble. He was arrested multiple times for drunk driving and alcohol-related charges. Dan's father even told local officers to beat him if he was misbehaving in public. It wasn't until he joined the military that his life would begin to change.\n\nDan Pena's Military Career to Businessman\n\nIn 1966, he volunteered for the draft at the height of the Vietnam War. Pena credits much of his business success to the military and the place where he learned self-discipline and leadership skills.\n\nMr. Peña entered the military as a private and a few years later left as a lieutenant commander. While in the military, he was stationed at Fort Benning in Georgia. As an officer, he spent time in Europe, where he was surrounded by senior military officers and ambassadors.\n\nIt was at this point that Pena experienced a more cultured life and a way of doing things. He knew he wanted the good life. As he was being awarded a medal from a two-star general, according to Pena, the general stated, “You know if you were in the real world, you could probably get rich.” At this moment, his life would change forever and set him on his business journey.\n\nDan Pena and His Early Career\n\nIn 1971 he graduated with honors from San Fernando Valley State College, now known as California State University, Northridge, with a bachelor's degree in Business Administration. After leaving the military, he eventually made it to Wall Street. As he stated in one interview, “I wanted to go where the money was.”\n\nHe began his career at a commercial real estate firm in Los Angeles with a 94.6% closing rate.\n\nFrom there, he became a stockbroker for Payne Webber in the Los Angeles office. In 1972, he was transferred to the New York City office. During a five year period, he was able to double his income from the previous year. In 1977 he left Payne Webber went on to serve as an advisor, financial analyst, and business consultant with the investment banking firm of Bear Stearns in New York City.\n\nAfter starting his career, Pena realized there wasn't much difference between the military world and the business world.\n\nIn 1979, he left Bear Stearns and became the president of Kennedy Industries in Los Angeles that focused on real estate investments, natural resources, and the entertainment industry.\n\nThen in 1980, Dan Pena became the CEO and chairman of JPK Industries, where he held fifty percent ownership. Two years later, Pena would find himself ousted by shareholders.\n\nGreat Western Resources, Inc.\n\nIn July of 1982, Dan Pena founded his own company, Great Western Resources, with only $820, a phone, and a fax machine. With barely enough money, over the course of eight years, though, he grew his initial investment to a $450 million dollar natural resources business that owned several energy companies at a time when the oil business was at its worst.\n\nAfter partnering with Marion Oil in Mobile, Alabama, the joint venture gave Great Western Resources the support they needed to earn $50 million dollars in government fuel contracts.\n\nGreat Western Resources began as an oil drilling exploratory operation. Later it evolved into all aspects of the oil business from pipeline construction to refinery.\n\nAfter taking the natural resource company public on the London Stock Exchange, at the height of its influence, the company was involved in onshore and offshore drilling in addition to twenty-two coal mines.\n\nGreat Western Resources Locations\n\nGRW has locations in South America, Great Britain, and the United States.\n\nHe served as the organization's CEO until he and the Board of Directors had a falling out about a decade later in 1990 during Desert Storm. At the time, the Kuwaiti government-owned 29% of GWR stock. When Saddam Hussein invaded Kuwait, the stock price of Great Western Resources dropped by 75%. Pena was ousted again.\n\nFrom this natural resource company, Dan Pena has gone on to create much wealth. It was only after leaving Great Western Resources with half a billion dollars that Dan began to develop his high-performance, financial coaching program.\n\nDan Pena's Famous Guthrie Castle Estate\n\nSince early adulthood, Pena dreamed of owning a castle. In 1984, a year shy of his 40th birthday, he purchased the 15th-century landmark, Guthrie Castle in Angus Scotland, from the Guthrie family who had owned the property for more than 400 years.\n\nThe grounds consist of 156 acres, a horseshoe-shaped walled garden, and a loch. Also, the castle itself has thirteen bedrooms along with four cottages on the estate grounds. After a year of extensive renovations, he brought the castle back to its former glory with the addition of a golf course that now serves as his primary residence. Since purchasing the castle, the estate has undergone several additional renovations.\n\nGuthrie Castle Scandal\n\nIn the early 2000's he opened Guthrie Castle to the public, where it served a venue for weddings and public functions until 2017 when the wedding planner and coordinator for Guthrie castle was caught embezzling money and scamming brides and grooms by double-booking weddings.\n\nAfter finding out what his employee had done, Mr. Pena generously refunded each couple their money.\n\nGuthrie Castle serves as Pena's primary residence and where he hosts his Quantum Leap Advantage seminars. . It is no longer open to the publish.\n\nFounder of The Guthrie Group\n\nThe Guthrie Group, founded in 1997 and named after his famous home, has locations in Scotland and the Philippines. Pena still serves as Chairman of the Board. Mr. Pena's consultancy firm works with corporate finance clients across the globe.\n\nThe company serves as a facilitator for European financial transactions for buying and selling. They focus primarily on pre-IPO funding.\n\nWhat is the Quantum Leap Advantage?\n\nDan Pena began his career as a high-performance business coach in 1993. As the founder of Quantum Leap Advantage, the QLA methodology is based on his experience in the military and Wall Street. As a high-performance coach, Pena teaches other entrepreneurs wealth creation and how to become a high achiever. Dan provides week-long seminars at Guthrie Castle using his QLA Methodology that takes participants through the foundational steps of being successful.\n\nWorkshops include information about how to raise capital, how to overcome obstacles when pursuing an idea, and the seven necessary steps to achieve “super success.”\n\nQuantum Leap Advantage Graduates\n\nAmong his most successful high-ticket, Quantum Leap Advantage Graduates include Dan Lok and Shawn Casey.\n\nOther successful Quantum Leap Advantage graduates include Klaus Kleinfield. In 2017, Kleinfield closed the largest deal in history, a deal that links Jordan with Egypt known as NEOM. Kleinfield now serves as an advisor to the Saudi Crown Prince.\n\nAs a visionary and leader, the philosophy of Dan and his high-ticket seminars are straightforward: there are no free lunches. Each person must work hard to earn what they get in life. If you have the guts to follow his steps, you can start obtaining the wealth to support your family for multiple generations.\n\nThe consensus of Dan Pena's seminars is positive when reviewing forums, blogs, and websites that discuss QLA Methodology (Quantum Leap Approach). There is no fluff or feel-good stuff to worry about with Dan's workshops. His focus is on growth. You can live a comfortable life and relax, or you can choose to pursue your goals and dreams.\n\nDespite having gone to jail multiple times in his youth, he is living proof that anyone can turn their life around.\n\nYour First 100 Million\n\nPublished in 1999, in his book, Your First 100 Million, it outlines how success is not for the touchy-feely. In the dedication he credits three men for making an impact on his life. He begins with Constantine Gratsos, an associate of shipping icon and business magnate, Aristotle Onassis, and second husband to Jaqueline Kennedy Onassis.\n\nPena states, “He took a liking to me, became my first mentor, and showed me how to swim in the deep, dangerous waters of business.”\n\nThen, he gives credit for his ability to move out of his comfort zone to Jim Newman, after attending one of his seminars in 1978.\n\nHis knowledge of the oil industry is thanks to Jerry Ormand, the legendary Texas oilman. Ormand introduced Pena to the business and how to survive in it.\n\nPena uses his book as a tool for his mentees to understand the origins of his business strategy and how they can apply them to their own business.\n\nWhat are the Necessary Steps to Success Using the QLA?\n\nPena begins the Quantum Leap Advantage by recommending that you read the following:\n\nDr. Spocks Baby and Childcare\n\nThink and Grow Rich-Napolean Hill\n\nRelease Your Brakes- James Newman\n\nYou First Hundred Million (Audio Book)- Dan Pena\n\nThe 50 Million Dollar Man's QLA Book (eBook)- Dan Pena\n\nAs a high-performance coach, Mr. Pena is a firm believer that you need to learn some important lessons if you want to find success. For instance, it starts by getting out of your comfort zone and moving away from conventional wisdom. Your parents are to blame for your lack of self-esteem and ambitions. Therefore, you have to get away from your parents' influence to achieve anything.\n\nFurthermore, a person should begin by developing high-quality relationships and focus on surrounding themselves with high-performance people. From there, he recommends working on developing a sense of high self-esteem and learning how to trust your guts. Moreover, he believes that doubt is not a product of accurate thinking but habitual thinking.\n\nAccording to Pena, you have to practice being successful and begin with a strong foundation. For example, success comes from the way you look and the way you talk.\n\nAdditional Seminars\n\nThe Quantum Leap Advantage also features lessons on how to raise money for your business with the Raising Capital Series. His Deal Making and Acquisitions seminars explain how to buy larger companies using little to none of your own money.\n\nSome of the best advice that Dan Pena gives is to try to make money doing something that you are passionate about after doing good research.\n\nMore information can be found on his web site along with a free Success Test.\n\nThe Snowflake Generation\n\nPena doesn't hold back his opinion about what he calls the snowflake generation. In an interview with the London Real, he is outspoken in his belief that ordinary people today lack the mental toughness and drive to be successful.\n\nHe believes that “snowflakes” are too concerned with what people are going to say about them, overreact to situations and easily triggered.\n\nAs part of his QLA program, he offers The Snowflake Test for free, which is a short series of multiple-choice questions asking about childhood, parents, and how you would react to certain scenarios. It's challenging and the results are a hard pill to swallow if you aren't prepared.\n\nDan Pena on Raising Children\n\nIn addition to his views about “snowflakes,” the billionaire is very vocal about how people should raise their children. According to Pena, children do not do what they are told do; they do what they see their parents do.\n\nTaking into consideration how he was raised, he is adamant that parents teach their children leadership skills. It begins by equating discipline with success and understanding that success requires sacrifice.\n\nDan Pena Quotes\n\n“Find something that you love that can change a billion lives. The odds of you becoming a billion have gone up exponentially or at least made you a bunch of money.”\n\n“Growth only comes from pain.”\n\n“Tough times don't last. Tough people do.”\n\n“Never ever share your doubts.”\n\n“Man's greatest burden is unfulfilled potential.”\n\n“Focus on the few, not the many.”\n\nFor the past years, Dan spends numerous hours traveling around the globe speaking at universities, pro bono and other organizations. For a brief time, he taught a university course at his alma mater. He and his wife are involved in multiple charitable Catholic organizations that focus on missionary work in Sri Lanka and South America.\n\nHe promotes his teachings through a series of YouTube videos, podcasts, and seminars along with his book and social media channels full of robust content of video clips.\n\nHis video, “Ultimate Advice for Students and Young People- How to Succeed in Life,” has over six million views.\n\nDan Peña Awards\n\nThroughout his career, American businessman Dan Pena has been the recipient of many awards:\n\nWho's Who in America\n\nWho's Who in Public Speaking\n\nLatin Business Association Outstanding Business Owner (1981)\n\nNominated for Inc's Entrepreneur of the Year (1989)\n\nUS Presidential Roundtable (1991)\n\nMost Distinguished Alumni California State University, Northridge, School of Business and Economics Commencement Speaker (1991)\n\nAward for Excellence by the Center for Entrepreneurial Management (1994)\n\nChosen TOP TEN Marketing by Entrepreneurs Magazine (1995)\n\n“The Communicator” award (1995 & 1996)\n\n“Telly Award” in (1996 & 1997)\n\nLeaders and Success by Investor's Business Daily (US) in (1997)\n\nChairman of the company chosen as “Entrepreneurial Company of the Year” (1998)\n\nFirst Honorary Member of Onderneuend Nijenrode (1998)\n\nChairman of the Company nominated for European Entrepreneur of the Year (EU) (1999) American International Real Estate Expo and Conference AIREEC “Man of the Year Award” (2008)\n\nAIREEC “Inspirational Leadership Award” (2008)\n\nDan Pena lives with his wife Sally, and they have three children.\n\nFun Fact: Dan Pena has a 13th rib."}, {"url": "https://www.courageouschristianfather.com/who-is-richard-stearns/", "page_content": "Richard Stearns is a prominent author, speaker, and humanitarian who has dedicated his life to advocating for the poor and marginalized around the world. His inspiring work has had a profound impact on the lives of countless individuals, and his message of hope and compassion continues to resonate with people from all walks of life. #RichardStearns\n\nWho is Richard Stearns\n\nPortrait of Richard Stearns, World VIsion US President\n\nStearns was born in 1951 in New York City and grew up in the suburbs of Rochester, New York. He attended Cornell University, where he earned a degree in neurobiology and behavior, and later went on to receive an MBA from the Wharton School at the University of Pennsylvania.\n\nAfter a successful career in corporate America, including stints as CEO of Lenox and Parker Brothers, Stearns felt a calling to use his business acumen and leadership skills to make a positive difference in the world. In 1998, he joined the global Christian humanitarian organization World Vision as president and CEO, and under his leadership, the organization grew significantly, expanding its reach to help millions of people in need around the world.\n\nIn addition to his work at World Vision, Stearns has also authored several books, including “The Hole in Our Gospel,” which became a New York Times bestseller and won the 2010 Christian Book of the Year award. In this book, Stearns shares his personal journey of faith and the experiences that led him to become an advocate for the poor and marginalized, and he challenges readers to take action and make a difference in the world.\n\nStearns’ other books include “Unfinished: Believing Is Only the Beginning,” which explores the idea that faith is not just a set of beliefs, but a call to action to help others, and “The Heart of Mentoring,” which offers practical advice and guidance for building meaningful mentoring relationships.\n\nIn addition to his work with World Vision and his writing, Stearns is also a sought-after speaker and has shared his message of hope and compassion at events and conferences around the world. He has been recognized for his leadership and humanitarian work with numerous awards, including the prestigious Wilberforce Award for his contributions to the fight against global poverty and injustice.\n\nOne interesting fact that many people may not know about Richard Stearns is that before he became a humanitarian and advocate for the poor, he was a successful businessman and CEO of several well-known companies, including Parker Brothers and Lenox. In fact, he was responsible for launching some of the most popular board games of the 1980s, including Trivial Pursuit and Pictionary.\n\nStearns has often shared how his transition from the corporate world to humanitarian work was a result of a personal journey of faith and a growing awareness of the need to make a positive impact on the world. Despite his success in the business world, Stearns felt a calling to use his skills and resources to help those in need and to address issues of poverty and injustice around the world.\n\nThis transition from business to humanitarian work highlights Stearns’ belief in the power of personal transformation and the ability of individuals to make a positive impact on the world. It also demonstrates how his own personal journey of faith and values led him to pursue a different path in life and make a profound difference in the lives of others.\n\nStearns’ impact on the world cannot be overstated. Through his work with World Vision and his inspiring writing and speaking, he has touched the lives of countless individuals and has helped to bring about positive change in some of the most impoverished and marginalized communities on the planet. His message of hope and compassion continues to inspire people from all walks of life to make a difference in the world, and his legacy will continue to live on for generations to come.\n\nSubscribe To Courageous Christian Father!\n\n\n\n\n\nDon’t miss any blog posts! Subscribe today! You can subscribe via WordPress or by entering your email! Thank you!\n\nJoin 1,517 other subscribers\n\nDon’t forget to also share blog posts you love on your favorite social media too! Thank you! Sharing is caring!\n\nFollow on Social Media\n\nBelow are some examples of blog entries from all blogs that I do. (Courageous Christian Father, Steve Sews Stuff and SteveZ DesignZ).\n\n\n\nThank You For Reading!\n\nSearch Search\n\nAbout the Author\n\nSteve Patterson A Christian Blogger that enjoys blogging about the Bible, Theology, God, Jesus Christ, Christian Music, Family, Cats, Odd Holidays, sewing and much more. I have been blogging since 2004, however, I have been blogging on Courageous Christian Father since 2012. I enjoy listening to Christian Music. I am married with 1 daughter, 2 step-sons and a step daughter. See author's posts\n\nLike this: Like Loading..."}, {"url": "https://finance.yahoo.com/news/dan-calugar-announces-angel-flight-163800089.html", "page_content": "Las Vegas, NV, Nov. 03, 2020 (GLOBE NEWSWIRE) -- Investor Dan Calugar details his work with the nonprofit organization Angel Flight West, volunteering to complete multiple flights a month to assist in transporting blood products for the LifeStream organization.\n\n\n\nEvery day, many adults and children face the challenge of coordinating care for serious medical conditions but lack the financial means to do so. Investor Dan Calugar has volunteered with Angel Flight West for 15 years, donating his time to fly more than 200 flights, helping their mission to provide free transportation to those who need it most.\n\n\n\nAngel Flight West was created in 1983 to help families in need by arranging free transportation for their sick loved ones. Over the years, the organization has enlisted over 2,000 volunteer pilots to help complete these missions. Each pilot volunteers their time, aircraft, and experience to help fly patients to treatment facilities and hospitals for non-emergent issues.\n\n\n\nIn addition to medical flights, Angel Flight West also accepts requests for compassion flights for caregivers; specialty camps; relocation for domestic violence survivors; military personnel assistance; blood, organ, and tissue donations; disaster response; and transplant recipients. From those requests, pilots and drivers can sign up to help facilitate the travel from point A to point B.\n\n\n\nVolunteers like Daniel Calugar then introduce themselves to patients and coordinate travel details. Pilots not only provide their time but also donate fuel costs and other associated expenses. And everyone wins. Pilots get to enjoy what they do while donating their time to a great cause, and patients can travel for free to receive the care needed.\n\n\n\nIn October alone, Dan completed five flights for Angel Flight West to benefit the LifeStream organization, transporting blood donations to those in need.\n\n\n\nIt takes a special kind of person to freely give their time and resources to help someone they’ve never met before. In addition to his flight time with Angel Flight West, Dan has also financially supported its operational costs throughout the years. In a conversation with Josh Olson, Executive Director of Angel Flight West, Dan shared, “I feel like I have been given a lot, so it’s my responsibility to give back to others.”\n\n\n\nAbout Dan Calugar\n\n\n\nDaniel Calugar is a versatile and experienced investor with a background in computer science, business, and law. He developed a passion for investing while working as a pension lawyer and leveraged his technical capabilities to write computer programs that helped him identify more profitable investment strategies. When Dan isn't working, he enjoys spending time working out and being with friends and family -- and volunteering with Angel Flight. West.\n\n\n\nContact:\n\n\n\nName: Dan Calugar\n\nEmail: dcalugar@pacelinecapital.com\n\nOrganization: Paceline Capital, LLC\n\nAddress: 1 Hughes Center Drive, Las Vegas, NV 89169\n\nPhone:702 302-3204\n\nhttps://www.dancalugarscholarship.com/\n\n\n\n\n\n"}, {"url": "https://www.britannica.com/biography/T-S-Eliot", "page_content": "T.S. Eliot was an American-English poet, playwright, literary critic, and editor. He is best known as a leader of the Modernist movement in poetry and as the author of such works as The Waste Land (1922) and Four Quartets (1943).\n\nT.S. Eliot attended Smith Academy, St. Louis, and Milton Academy, Massachusetts. He received a B.A. from Harvard in 1909. He spent the year 1910–11 in France at the Sorbonne and then returned to Harvard. By 1916 he had finished a dissertation, but he never took the final oral examination for the Ph.D. degree.\n\nT.S. Eliot , in full Thomas Stearns Eliot , (born September 26, 1888, St. Louis, Missouri , U.S.—died January 4, 1965, London , England), American-English poet, playwright, literary critic, and editor, a leader of the Modernist movement in poetry in such works as The Waste Land (1922) and Four Quartets (1943). Eliot exercised a strong influence on Anglo-American culture from the 1920s until late in the century. His experiments in diction , style, and versification revitalized English poetry, and in a series of critical essays he shattered old orthodoxies and erected new ones. The publication of Four Quartets led to his recognition as the greatest living English poet and man of letters, and in 1948 he was awarded both the Order of Merit and the Nobel Prize for Literature.\n\nHe spent the year 1910–11 in France, attending Henri Bergson ’s lectures in philosophy at the Sorbonne and reading poetry with Alain-Fournier . Eliot’s study of the poetry of Dante , of the English writers John Webster and John Donne , and of the French Symbolist Jules Laforgue helped him to find his own style. From 1911 to 1914 he was back at Harvard, reading Indian philosophy and studying Sanskrit. In 1913 he read Bradley’s Appearance and Reality; by 1916 he had finished, in Europe, a dissertation entitled “Knowledge and Experience in the Philosophy of F.H. Bradley.” But World War I had intervened, and he never returned to Harvard to take the final oral examination for the Ph.D. degree. In 1914 Eliot met and began a close association with the American poet Ezra Pound .\n\nEliot was descended from a distinguished New England family that had relocated to St. Louis, Missouri. His family allowed him the widest education available in his time, with no influence from his father to be “practical” and to go into business. From Smith Academy in St. Louis he went to Milton, in Massachusetts; from Milton he entered Harvard in 1906; he received a B.A. in 1909, after three instead of the usual four years. The men who influenced him at Harvard were George Santayana , the philosopher and poet, and the critic Irving Babbitt . From Babbitt he derived an anti-Romantic attitude that, amplified by his later reading of British philosophers F.H. Bradley and T.E. Hulme , lasted through his life. In the academic year 1909–10 he was an assistant in philosophy at Harvard.\n\nFor a year Eliot taught French and Latin at the Highgate School; in 1917 he began his brief career as a bank clerk in Lloyds Bank Ltd. Meanwhile, he was also a prolific reviewer and essayist in both literary criticism and technical philosophy. In 1919 he published Poems, which contained the poem “Gerontion,” a meditative interior monologue in blank verse ; nothing like this poem had appeared in English.\n\nAlthough Pound had printed privately a small book, A lume spento, as early as 1908, “Prufrock” was the first poem by either of these literary revolutionists to go beyond experiment to achieve perfection. It represented a break with the immediate past as radical as that of Samuel Taylor Coleridge and William Wordsworth in Lyrical Ballads (1798). From the appearance of Eliot’s first volume, Prufrock and Other Observations , in 1917, one may conveniently date the maturity of the 20th-century poetic revolution. The significance of the revolution is still disputed, but the striking similarity to the Romantic revolution of Coleridge and Wordsworth is obvious: Eliot and Pound, like their 18th-century counterparts, set about reforming poetic diction . Whereas Wordsworth thought he was going back to the “real language of men,” Eliot struggled to create new verse rhythms based on the rhythms of contemporary speech. He sought a poetic diction that might be spoken by an educated person, being “neither pedantic nor vulgar.”\n\nEliot was to pursue four careers: editor, dramatist, literary critic, and philosophical poet. He was probably the most erudite poet of his time in the English language . His undergraduate poems were “literary” and conventional. His first important publication, and the first masterpiece of Modernism in English, was “The Love Song of J. Alfred Prufrock” (1915):\n\nThe Waste Land and criticism\n\nWith the publication in 1922 of his poem The Waste Land, Eliot won an international reputation. The Waste Land expresses with great power the disenchantment, disillusionment, and disgust of the period after World War I. In a series of vignettes, loosely linked by the legend of the search for the Grail, it portrays a sterile world of panicky fears and barren lusts, and of human beings waiting for some sign or promise of redemption. The poem’s style is highly complex, erudite, and allusive, and the poet provided notes and references to explain the work’s many quotations and allusions. This scholarly supplement distracted some readers and critics from perceiving the true originality of the poem, which lay rather in its rendering of the universal human predicament of man desiring salvation, and in its manipulation of language, than in its range of literary references. In his earlier poems Eliot had shown himself to be a master of the poetic phrase. The Waste Land showed him to be, in addition, a metrist of great virtuosity, capable of astonishing modulations ranging from the sublime to the conversational.\n\nThe Waste Land consists of five sections and proceeds on a principle of “rhetorical discontinuity” that reflects the fragmented experience of the 20th-century sensibility of the great modern cities of the West. Eliot expresses the hopelessness and confusion of purpose of life in the secularized city, the decay of urbs aeterna (the “eternal city”). This is the ultimate theme of The Waste Land, concretized by the poem’s constant rhetorical shifts and its juxtapositions of contrasting styles. But The Waste Land is not a simple contrast of the heroic past with the degraded present; it is, rather, a timeless simultaneous awareness of moral grandeur and moral evil. The poem’s original manuscript of about 800 lines was cut down to 433 at the suggestion of Ezra Pound. The Waste Land is not Eliot’s greatest poem, though it is his most famous.\n\nEliot said that the poet-critic must write “programmatic criticism”—that is, criticism that expresses the poet’s own interests as a poet, quite different from historical scholarship, which stops at placing the poet in his background. Consciously intended or not, Eliot’s criticism created an atmosphere in which his own poetry could be better understood and appreciated than if it had to appear in a literary milieu dominated by the standards of the preceding age. In the essay “Tradition and the Individual Talent,” appearing in his first critical volume, The Sacred Wood (1920), Eliot asserts that tradition, as used by the poet, is not a mere repetition of the work of the immediate past (“novelty is better than repetition,” he said); rather, it comprises the whole of European literature, from Homer to the present. The poet writing in English may therefore make his own tradition by using materials from any past period, in any language. This point of view is “programmatic” in the sense that it disposes the reader to accept the revolutionary novelty of Eliot’s polyglot quotations and serious parodies of other poets’ styles in The Waste Land.\n\nAlso in The Sacred Wood, “Hamlet and His Problems” sets forth Eliot’s theory of the objective correlative:\n\nThe only way of expressing emotion in the form of art is by finding an “objective correlative”; in other words, a set of objects, a situation, a chain of events which shall be the formula for that particular emotion; such that, when the external facts, which must terminate in sensory experience, are given, the emotion is immediately evoked.\n\nEliot used the phrase “objective correlative” in the context of his own impersonal theory of poetry; it thus had an immense influence toward correcting the vagueness of late Victorian rhetoric by insisting on a correspondence of word and object. Two other essays, first published the year after The Sacred Wood, almost complete the Eliot critical canon: “The Metaphysical Poets” and “Andrew Marvell,” published in Selected Essays, 1917–32 (1932). In these essays he effects a new historical perspective on the hierarchy of English poetry, putting at the top Donne and other Metaphysical poets of the 17th century and lowering poets of the 18th and 19th centuries. Eliot’s second famous phrase appears here—“dissociation of sensibility,” invented to explain the change that came over English poetry after Donne and Andrew Marvell. This change seems to him to consist in a loss of the union of thought and feeling. The phrase has been attacked, yet the historical fact that gave rise to it cannot be denied, and with the poetry of Eliot and Pound it had a strong influence in reviving interest in certain 17th-century poets.\n\nThe first, or programmatic, phase of Eliot’s criticism ended with The Use of Poetry and the Use of Criticism (1933)—his Charles Eliot Norton lectures at Harvard. Shortly before this his interests had broadened into theology and sociology; three short books, or long essays, were the result: Thoughts After Lambeth (1931), The Idea of a Christian Society (1939), and Notes Towards the Definition of Culture (1948). These book-essays, along with his Dante (1929), an indubitable masterpiece, broadened the base of literature into theology and philosophy: whether a work is poetry must be decided by literary standards; whether it is great poetry must be decided by standards higher than the literary.\n\nEliot’s criticism and poetry are so interwoven that it is difficult to discuss them separately. The great essay on Dante appeared two years after Eliot was confirmed in the Church of England (1927); in that year he also became a British subject. The first long poem after his conversion was Ash Wednesday (1930), a religious meditation in a style entirely different from that of any of the earlier poems. Ash Wednesday expresses the pangs and the strain involved in the acceptance of religious belief and religious discipline. This and subsequent poems were written in a more relaxed, musical, and meditative style than his earlier works, in which the dramatic element had been stronger than the lyrical. Ash Wednesday was not well received in an era that held that poetry, though autonomous, is strictly secular in its outlook; it was misinterpreted by some critics as an expression of personal disillusion."}]}