{"Lindsay Crouse won an Obie Award for her performance in the play The Marriage of Bette and Boo in 1985.": [{"url": "https://www.broadwayworld.com/off-broadway/article/Photos-Lindsay-Crouse-Alma-Cuervo-Judith-Ivey-More-Star-in-MORNINGS-AT-SEVEN-Opening-at-Theatre-at-St-Clements-20211022", "page_content": "Morning's At Seven, Paul Osborn's treasured comedy classic, returns to New York this fall for the first time in 20 years featuring an all-star cast including Academy Award nominee and Obie Award winner Lindsay Crouse (The Homecoming), Obie Award winner Alma Cuervo (On Your Feet!, Uncommon Women and Others), two-time Tony Award winner Judith Ivey (Steaming, Hurlyburly, The Heiress), Dan Lauria (Lombardi, A Christmas Story The Musical, TV's \"The Wonder Years\"), Academy Award nominee Patty McCormack (The Bad Seed, Frost/Nixon), two-time Tony nominee Tony Roberts (The Tale of the Allergist's Wife, Annie Hall), Tony Award winner John Rubinstein (Pippin, Children of a Lesser God), Keri Safran (Typhoid Mary at Barrington Stage), and Jonathan Spivey (The Front Page). Directed by Obie Award winner Dan Wackerman (artistic director of The Peccadillo Theater Company), Morning's At Seven is now playing a strictly limited engagement through January 9 at Theatre at St. Clement's, 423 W. 46th Street, NYC). Opening night is November 4.\n\nCheck out photos below!\n\nMorning's At Seven is produced by Julian Schlossberg, Roy Furman, Eric Falkenstein, Sandy Robertson, Suzanne Grant, Anna Czekaj, Alexander \"Sandy\" Marshall, Jody H. Klein and Jamie deRoy, in association with The Peccadillo Theater Company and Woodie King, Jr.'s New Federal Theatre.\n\nThe scenic design is by Harry Feiner; costume design by Barbara A. Bell; lighting design by James E. Lawlor III; and sound design by Quentin Chiappetta. Casting is by McCorkle Casting, Ltd.\n\nThe Associate Director is Elizabeth Van Dyke (Producing Artistic Director of Woodie King, Jr's New Federal Theatre).\n\nSince its premiere, Broadway has seen two stellar revivals of Morning's At Seven. A 1980 production with Nancy Marchand, Maureen O'Sullivan, Elizabeth Wilson and Teressa Wright won the Tony Award for Reproduction of a Play or Musical. Another Tony-nominated Broadway production, presented by Lincoln Center Theatre and directed by Daniel Sullivan in 2002, featured Elizabeth Franz, Julie Hagerty, Buck Henry, Piper Laurie, Christopher Lloyd, Estelle Parsons and Frances Sternhagen.\n\nThroughout its history, Morning's At Seven has been showered with critical praise. Among the countless raves for the play, Ben Brantley of The New York Times hailed \"Morning's At Seven surprises Manhattan theatergoers every time it comes around. It's rare that a Broadway comedy seduces by stealth. The discreet miracle of Mr. Osborn's writing is in the shadows he weaves into the sunniest exchanges.\" In his Variety review, Charles Isherwood wrote \"the play's pleasures are durable ones, and it affords a cast of veterans a chance to display their gifts. Osborn's writing is infused with clear-sighted but sympathetic wisdom.\" Terry Teachout of The Wall Street Journal calls Morning's At Seven \"a great American play that ought to be far better known.\"\n\nPERFORMANCE INFORMATION:\n\nMorning's At Seven will play 12-week engagement through January 9 at Theatre at St. Clements, 423 W. 46th Street, NYC). Opening night is November 4. Performances are Monday, Wednesday, Thursday and Friday at 7PM, and Saturday at 8PM, with matinees Wednesday and Saturday at 2PM, and Sunday at 3PM. Tickets are $44 - $99. Premium seating is available. For tickets and information visit MorningsAt7.com or Telecharge.com, (212) 239-6200."}, {"url": "https://www.bostonglobe.com/2022/04/04/metro/meet-south-kingstown-native-who-won-an-oscar-last-week/", "page_content": "Last Sunday night, her team took home the Documentary Short Subject Oscar for “ The Queen of Basketball, ” a film about Lusia Harris, the only woman ever drafted in the NBA.\n\nLindsay Crouse, who grew up in South Kingstown, is a co-executive producer of The Times’ Op-Docs series, which won a Peabody Award in 2017 for “ 4.1 Miles, ” a short documentary film about a Hellenic Coast Guard captain on the Greek island of Lesbos in charge of saving thousands of migrants crossing the Aegean Sea.\n\nThe only Oscars-related thing anyone wanted to talk about last week was Will Smith slapping Chris Rock, but did you know that a native Rhode Islander helped The New York Times win its first Academy Award?\n\nAdvertisement\n\nI asked Crouse to tell us more about the project and share what Rhode Island-related documentary she’d love to work on.\n\nQ: First, congrats on the big win. Tell us about what made Lusia Harris’s story so appealing to you.\n\nGet Food & Dining in Rhode Island Sign up for news and updates about the best recipes to try, restaurants and bars to check out, and things to do on weekends in Rhode Island. Enter Email Sign Up\n\nCrouse: I’ve spent a long time reporting on women’s sports and trying to cover them in unusual ways, whether it’s exposing the punishments women athletes face for having children or just helping bring excellent women athletes’ profiles before a mainstream audience. There was never really a job on those themes for me to apply to, so I came up with how I wanted to do it myself, doing stories that I hoped would resonate with readers like me (especially because I’m an athlete myself). Lucy Harris’s story fit right into that.\n\nWe produced her story as part of a documentary series I came up with as an experiment with Breakwater Studios about people who were incredibly talented and on the cusp of making history, but were forgotten for any number of reasons – obviously that premise applies to so much of women’s sports. It’s hard to get historical stories, especially in a documentary, to echo in ways that make people think about the world around them right now, but in this case, the resonance with barriers that contemporary female athletes face was clear.\n\nAdvertisement\n\nQ: I feel like every college athlete should be required to study Lusia Harris’s career. Luckily, the award comes at a perfect time because we’re gearing up for what looks to be a really competitive women’s Final Four. What’s something you learned about during the making of the documentary that everyone should know?\n\nCrouse: I don’t think I’d ever heard directly from a woman who was at the center of the revolutionary changes to women’s sports in America that were unfolding 50 years ago, at the dawn of Title IX (which granted women and girls equal opportunities in school sports to those enjoyed by boys and men). It was interesting to learn that Lucy made her women’s team so good that the women’s basketball team at her small Mississippi school flew in planes to their games, while the less competitive men’s team took buses.\n\nYou rarely hear of women’s teams leading the way, or getting resources that reflect their superiority. It contradicts the tired argument that “nobody wants to watch women play.” Of course they do – we just have to tell the stories with the same level of quality we tell stories about men.\n\nQ: Shaq and Steph Curry were executive producers of the documentary. How much were they involved in the day-to-day of the project and what was it like to work with them?\n\nAdvertisement\n\nCrouse: They were incredible promoters of Lucy Harris’s story. I hope what they did for “The Queen of Basketball” can wind up being a model for how male athletes with outstanding platforms — or any powerful men whose power has grown in systems that were optimized for them to succeed — can use their audiences to bring attention to extraordinary, but lesser known, women. Sharing the love lifts everyone up.\n\nQ: You grew up in South Kingstown, went to Harvard, and now have won an Oscar at The New York Times. What’s the Rhode Island-related documentary you’d just love to work on?\n\nCrouse: The Pulitzer prize-winning novelist Jhumpa Lahiri graduated from my high school several years ahead of me; her mother was my teacher’s aide when I was an elementary student at South Road School in Wakefield. I’ve never met Lahiri, but have always admired her, and was surprised there wasn’t more of a shrine to her in my high school – I just remember a small plaque with her name on it in a corner of our library, which I would look at and think, we should be shouting her name from the rooftops! with everything she’s achieved.\n\nHer writing gave me a new lens for thinking about my hometown, for good and bad, as has following some of her family’s experiences in the town when they’ve been in the news. In keeping with the themes of her books, I think that story would make a powerful foundation for a look at the modern American town (and about how they are changing – as well as how they aren’t). I’d love to know more.\n\nAdvertisement\n\nThis story first appeared in Rhode Map, our free newsletter about Rhode Island that also contains information about local events, data about the coronavirus in the state, and more. If you’d like to receive it via e-mail Monday through Friday, you can sign up here.\n\nDan McGowan can be reached at dan.mcgowan@globe.com. Follow him on Twitter at @danmcgowan."}, {"url": "http://awardsandwinners.com/winner/?mid=/m/03tdlh", "page_content": "1984\n\nNominations 1984 » Award Nominated Nominated Work Academy Award for Best Actress in a Supporting Role Places in the Heart\n\nRole: Margaret Lomax"}, {"url": "https://gloucesterstage.com/lifespan/", "page_content": "SAM WEISMANº (Director) worked for ten years as an actor before making the transition to directing. He has earned directorial credits in film, television, and theatre. They include the feature films George of the Jungle (which received a British Academy Award nomination for Best Children’s Movie), The Out-Of-Towners (starring Steve Martin, Goldie Hawn, and John Cleese), Bye-Bye Love, D2: The Mighty Ducks, and Dickie Roberts. He also was Co-Producer of DAD (starring Jack Lemmon, Olympia Dukakis, and Ted Danson). Mr. Weisman has directed or produced over 200 television episodes, for such shows as Family Ties, Moonlighting, L.A. Law, Seventh Heaven (Pilot Episode), The Single Guy, Law And Order, Monk, In Plain Sight, The Bernie Mac Show; and was the Co-Creator of NBC’s The Sing Off, serving as Executive Producer of the show for its entire run. His television work has received three Emmy Nominations, multiple Humanitas Awards, two Golden Globe Nominations, and a Golden Globe Award. He directed and produced the Pilot of the critically acclaimed series, Brooklyn Bridge, which was honored by TV Guide as one of the best television episodes of all time. Mr. Weisman’s theatre work has received much recognition, including multiple Drama-Logue and LA Weekly Awards, and Los Angeles Drama Critics Circle Best Director honors for the West Coast premieres of Harold Pinter’s Betrayal (starring Ian McShane and Penny Fuller) and Simon Gray’s The Common Pursuit (featuring Nathan Lane). Other West Coast theatre credits include James Lapine’s Table Settings, Moliere’s The Misanthrope at USC, and an acclaimed production of Sam Shepard’s Buried Child at South Coast Repertory Theatre. Mr. Weisman was also the director and co-creator of Lies and Legends: The Musical Stories Of Harry Chapin, which premiered in Chicago, and then played Off Broadway at the legendary Village Gate. The show went on to be a major hit in Toronto and Los Angeles, receiving a Los Angeles Drama Critics Circle award for Best Ensemble. Weisman also directed Michael Weller’s A Late Morning (in America) with Ronald Reagan at The Contemporary American Theatre Festival. At Wellfleet Harbor Actors Theatre, he directed Kenneth Lonergan’s Lobby Hero, and the world premiere of John Kolvenbach’s Gizmo Love. A Graduate Of Deerfield Academy And Yale, Mr. Weisman Received An M.F.A. In Acting And Directing From Brandeis University’s Department of Theatre Arts, where he has returned to teach, and to direct productions of Tom Stoppard’s Arcadia, and Shakespeare’s Twelfth Night. Other Boston area work includes teaching and directing at the American Repertory Theatre’s Institute for Advanced Theatre Training, as well as playing Polonius in Commonwealth Shakespeare Company’s Hamlet. He has been elected three times to the East Coast Council of the Directors Guild of America, and is a voting member of the Directors’ Branch of The Academy of Motion Picture Arts and Sciences. Mr. Weisman is thrilled to be working again with Lindsay Crouse and Mickey Solis who he directed in GSC’s production of The Effect. He dedicates his work in this production to his family: his wife, actress and therapist Constance McCashin; their son, Dan (and his wife Lizzie); and their daughter, Margaux (and her husband, Will).\n\nGORDON FARRELL (Playwright) Gordon received an MFA in Playwriting from the Yale School of Drama in 1986. His plays include With More Than Voices (produced off-off Broadway); Navigators, directed by Arthur Sherman at Primary Stages; Alice Again, A Tin Star Over Tombstone, and The Voice of America (Alleyway Theater). Gordon worked as a screenwriter at Universal Pictures, Warner Brothers and MGM, writing for producers as varied as Robert Simonds, Bruce Berman, and the late Norman Twain, with whom he developed several plays, including one based on the life and literary struggles of J.R.R. Tolkien, an adaptation of Richard Russo’s darkly comic novel, Straight Man, and their final collaboration, The Lifespan of a Fact. Teaching in NYU’s Dramatic Writing Department for over 25 years, Gordon’s students include Annie Baker, Lucas Hnath, Christopher Shinn, Jessica Goldberg, Marco Rameriz, Madeleine George, and Chisa Hutchinson, among others. Gordon’s book, The Power of the Playwright’s Vision, was published by Heinemann Press in 2001 and is now a standard playwriting text in the U.S., England, and Canada.\n\nJEREMY KAREKEN (Playwright) Jeremy’s short plays Hot Rod, Big Train, and 80 Cards have been performed around the country and internationally. His awards include the Sewanee Conference’s Dakin Fellowship for Farblondjet, and Guthrie/Playwrights Center’s Two-Headed Challenge for The Sweet Sweet Motherhood. The Hamptons Film Festival Screenwriters Conference selected Kareken and David Murrell for their horror-comedy script about haunted breast implants – THESE!Conquered the Earth! In 2018, PlayPenn shortlisted Jeremy’s new political satire about an illiterate king, The Red Wool. Born and raised in Rochester, NY, and a graduate of the University of Chicago, he has taught at NYU, NYIT, The Actors Studio Drama School, and currently teaches at the Acting Studio – New York. A lifetime member of The Actors Studio, Jeremy occasionally acts and is the researcher for Bravo TV’s “Inside the Actors Studio.”\n\nDAVID MURRELL (Playwright) Theatrical credits include Ductwork (Access Theater, Cleveland Public Theatre), E.T.D., and [Untitled Organic Winery Project]. Screenplays: “Breed Ambassador,” “Chomper,” “The Cold Spot,” “Girl Gets Razor,” “Mission: Uncomfortable,” “A Radio Picture,” “THESE! Conquered the Earth!” (Hamptons Film Festival Screenwriters Conference), and “Walking Kane.” Murrell’s teleplays include: “Dayton Ladies,” “Down River,” and “Space Station Malibu.” David was born and raised on Staten Island and graduated from the University of Chicago. The Lifespan of a Fact is his first Broadway play.\n\nMARCELLA BARBEAU (Lighting Design) is ecstatic to return to Gloucester Stage since last season’s True West (for which she received an IRNE nomination) and this season’s Barefoot in the Park. She recently completed her Master of Fine Arts at Boston University where she designed the lights for Dolores Claiborne and Pelléas et Mélisande with the Opera Institute, Cabaret, Much Ado About Nothing, and Mad Forest. Marcella spent the fall season in the UK and Europe assisting designers at the English National Opera, National Theatre Munich, and National Theatre Mannheim.\n\nGAIL ASTRID BUCKLEY† (Costume Design) is happy to return to GSC! Selected designs at Gloucester Stage include Most Happy Fella, Spring Awakening , Jacques Brel is Alive and Well and Living in Paris, Happy Days, Going to St Ives, The Goat or Who is Sylvia?, and The Norman Conquests. Recent designs include, The Little Foxes and Pacific Overtures for the Lyric Stage; the 11th annual A Christmas Carol at the Hanover Theatre, and assistant costume designer on the movie I Care A Lot starring Rosamund Pike and Peter Dinklage. Gail received two Elliot Norton Awards and two IRNE Awards for Outstanding Costume Design. Gail is a member of United Scenic Artists Local 829.\n\nMADISON COOK-HINES (Assistant Director, Apprentice) just graduated from the University of Rhode Island with a Theatre BFA in Directing and Stage Management. During her senior year, she received a grant to research, write, direct, design, build, manage, and produce Daughters of Lavinia, a puppet-filled play that uses Lavinia from Titus Andronicus to tell the story of Elizabeth Cady Stanton and the Women’s Suffrage Movement. Madison also spent the year as a TA for the Sophomore Acting Class, a job she’ll miss dearly. Her favorite on-stage role (at URI and of all time) was playing the Provost in Measure for Measure. She adores making the most out of the littlest characters. But a close second favorite was performing in The Wolves. Madison is over the moon to be jumping in at Gloucester Stage and can’t wait to learn something different from everyone. She hasn’t had spare time in several years, but if she did, she might go hiking.\n\nLAUREN CORCUER (Props Design) is excitedly returning to Gloucester Stage after her work this season on Barefoot in the Park, Ben Butler and last season on the Agitators. She has worked in the Greater Boston area as prop master, scenic charge, wardrobe tech, and stitcher. She now finds herself in the role of Associate Production Manager at the Lyric Stage Company of Boston. Top prop credits include: Cabaret (Moonbox), No ire Hamlet (CentAstage), Circle Mirror Transformation (Brandeis University), Little Shop of Horrors, and Breath and Imagination (Lyric Stage).\n\nDEWEY DELLAY (Composer/Sound Design) Dewey is happy to be back at where the last show he composed and designed for was The Agitators. Dewey has received an Elliot Norton award for Outstanding Design on The Women, and an IRNE for Best Sound Design on Five By Ten (both Speakeasy Stage Company). Recent local work includes Blue Kettle and Here We Go (Commonwealth Shakespeare Company), which was included in The Boston Globes Top Ten; The Little Foxes (Lyric Stage Company) nominated for an Elliot Norton; and Constellations (Underground Railway Theater) which won an Elliot Norton award. Some of his television composing credits include Emmy nominated National Geographic’s China’s Mystery Mummies, and five seasons of the show Our America with Lisa Ling for the OWN Channel. He is presently composing music for digital children’s books by Live Oak Media.\n\nJ. MICHAEL GRIGGS† (Scenic Design) has previously designed for GSC The Effect, Fences, and Auld lang Syne. He has designed for The Manhattan Theatre Club, Actor’s Shakespeare Project, American Repertory Theater, Milwaukee Repertory Theatre, Trap Door Theatre and many others. He is a member of United Scenic Artists, Local 829.\n\nOLIVIA PALUZZI (Assistant Stage Manager, Apprentice) Olivia is a Massachusetts native who recently graduated from the University of Rhode Island with a BFA in Theatre. She has concentrations in both acting and stage management and has a love for the work that happens on and back stage. Her time at URI was filled with participating in many productions, trying everything from carpentry, stage combat, sound board operating, and acting in vastly different roles. To end her senior year, she was the stage manager for an eight show one act festival and found the process challenging but rewarding. She believes having a passion for both the artistic side and logistic side of theatre keeps her well rounded and helps her see things from different perspectives. She can’t wait to see where this new chapter in life leads her and is looking forward to her time at Gloucester Stage.\n\nMARSHA SMITH (Stage Manager) is very excited to return to Gloucester Stage. She has worked a great deal here over the years on shows like The 39 Steps, Cyrano, Doubt, Widow’s Blind Date, Tender, The Flick, Spring Awakening, and Man in Snow. She has also done many shows at Boston Playwrights Theatre, most recently Laughs in Spanish; and with Actors’ Shakespeare Project, including the rep project last fall of Macbeth and Equivocation. Marsha is a graduate of Emerson College with a degree in Stage Management and lives on her family’s farm in southern New Hampshire.\n\n*Member of Actors’ Equity Association (AEA)\n\nºMember of Stage Directors & Choreographers Society (SDC)\n\n†Represented by United Scenic Artists, Local USA-829 of the IATSE"}, {"url": "https://snaccooperative.org/view/7166685", "page_content": "Lindsay Ann Crouse, born May 12, 1948 in New York to playwright Russell Crouse and Anna Erskine Crouse, is an American actress, dancer and teacher. After graduating with honors from Radcliffe College in 1970, Crouse formed her own dance-theatre company in Cambridge before returning to New York to study under Uta Hagen and Sanford Meisner. Her acting career has spanned all mediums including performances off and on Broadway in modern and classic works, television and film. In 1977 she married playwright David Mamet with whom she had two daughters before their divorce in 1990. Crouse's achievements in acting have garnered recognition with an Obie Award for Reunion, a Daytime Emmy nomination and an Acadamy Award nomination for her supporting work in Places in the Heart.\n\nFrom the description of Lindsay Crouse papers, 1967-1987. (Harvard University). WorldCat record id: 706953711\n\nFrom the guide to the Lindsay Crouse papers, 1967-1987., (Harvard Theatre Collection, Houghton Library, Harvard College Library, Harvard University)"}, {"url": "https://www.rottentomatoes.com/celebrity/lindsay_crouse", "page_content": "Highest Rated: 97% House of Games (1987)\n\nLowest Rated: 18% Bye Bye, Love (1995)\n\nBirthday: May 12, 1948\n\nBirthplace: New York, New York, USA\n\nAn excellent character actress of the 1970s, 80s and 90s, Crouse had established herself as an outstanding off-Broadway actress in such roles as Ophelia opposite William Hurt's \"Hamlet\" and Viola in \"Twelfth Night; she won an Obie in her then-husband David Mamet's \"Reunion\" in 1980. After a strong cameo in \"The Verdict\" (1982), a moving performance as an Ethel Rosenberg-inspired character in \"Daniel\" (1983) and an Oscar-nominated turn in \"Places in the Heart\" (1984), Crouse played a cool, impressive lead in \"House of Games\" (1987), written and directed by Mamet. Her film career picked up in the mid-1990s with turns as Randy Quaid's ex-wife in \"Bye Bye, Love\" (1994), as the boy's mother in \"The Indian in the Cupboard\" (1995) and in support of Charlie Sheen in sci-fi actioner \"The Arrival\" (1996). Crouse also appeared briefly as Marilyn Monroe's acting coach in \"Norma Jean and Marilyn\" (HBO, 1996). She is the daughter of playwright/producer Russel Crouse."}, {"url": "https://www.nytimes.com/1981/01/02/theater/lindsay-crouse-keeps-up-a-family-stage-tradition.html", "page_content": "Lindsay Crouse took a cup of tea to ''the troll who lives upstairs''- her husband, David Mamet, the playwright - and settled back the other day in her old-timey Chelsea apartment to tell the story of her magical childhood. As she spoke, there was the muffled pounding of Mr. Mamet's typewriter, a sound that is part of the texture of her life.\n\nMany of the people Miss Crouse has loved have been involved with writing, the theater, or both. She could have rejected it all, overwhelmed by the surfeit of talent in her household. Instead, she became an actress and married a playwright. Right now she is starring as Viola in the Circle Repertory's lighthearted version of Shakespeare's ''Twelfth Night,'' directed by Mr. Mamet. The critics have hailed her performance as ''outstanding,'' and said she exudes ''charm along with intelligence.''\n\nMiss Crouse's father was Russel Crouse, who wrote, among many plays, ''Life with Father'' and ''Arsenic and Old Lace'' in collaboration with Howard Lindsay, the man after whom she was named. Her mother, Anna, wrote children's books with her father. Her older brother, Timothy, wrote ''The Boys on the Bus,'' a funny, much-admired description of the press corps covering the 1972 Presidential campaign. Her maternal grandfather was John Erskine, the noted English professor who wrote ''The Private Life of Helen of Troy,'' and who headed the Juilliard School of Music for many years. Her father's father was a newspaperman. Family of Busy Typewriters ''In our family, the work ethic was held up as some kind of byword,'' Miss Crouse remembered. ''At any hour, somebody's typewriter was going. If my father had been an actor instead of a playwright, I might have had problems.''\n\nMiss Crouse remembers her growing-up years as golden and romantic, ''part of the way Broadway used to be.'' Celebrities streamed to the family's town house in the East 60's, a home with Victorian antiques and tasseled red draperies. Among the frequent guests were Sherwood Anderson, Eugene O'Neill, Edna Ferber, John Steinbeck, Frederic March (''I remember him well - his noble bearing''), John Mason Brown, Howard Lindsay, Dorothy Stickney, Ethel Merman, Mary Martin and Irving Berlin. They ate and drank and sang and played charades ''in a spirit of fun and affection,'' Miss Crouse said. ''I thought everybody had a life like that. My brother and I were made part of that - introduced to every guest, being asked what we were doing at school. When we weren't asked to join in, we sat at the top of the stairs, just fascinated by all the goings-on.''"}, {"url": "https://link.springer.com/content/pdf/10.1007/978-1-4899-6118-1_2.pdf?pdf=inline%20link", "page_content": "In the midst of a successful stage and film career, Lindsay Crouse asked to be admitted to the beginners’ acting class at The Neighborhood Playhouse. She recalls saying to Sanford Meisner: “I’m coming as an acolyte. I want to find out what acting is ... I’m submitting.” At the time, Crouse was an accomplished actor who had explored techniques of actor training at The Stella Adler Conservatory and The Stanislavsky Institute and, for many years, with Uta Hagen at The HB Studios. Crouse’s decision to devote herself to her artistic development—at a risky and critical juncture in her professional life—is a tribute to her courage, integrity, and commitment. Crouse uses that impressive conviction to immerse herself in the circumstances of a role. For Sidney Lumet’s film The Verdict (1982), Crouse studied with a voice coach for hours to perform the small but crucial part of Caitlin, an Irish character. This scrupulous dedication to truthfulness conforms with Crouse’s ardent beliefs about the ethics of acting. She says an actor shouldn’t “take an average, but... get out there and go as far as [you] can.” Crouse fulfills that credo in performances that radiate with the intense light of her passion and intelligence.\n\nKeywords\n\nTheater Club\n\nIrish Character\n\nElectric Chair\n\nMidlife Crisis\n\nAccomplished Actor\n\nThese keywords were added by machine and not by the authors. This process is experimental and the keywords may be updated as the learning algorithm improves."}, {"url": "https://www.nytco.com/press/the-times-wins-its-first-oscar/", "page_content": "The Op-Doc “The Queen of Basketball” won the 2022 Academy Award in the Documentary Short Subject category. This is the first win for The Times and for Op-Docs, which launched in 2011. Op-Docs, which is part of The Times’s Opinion Video department, has previously been nominated for four other Academy Awards.\n\n“The Queen of Basketball” tells the story of Lusia “Lucy” Harris Stewart, one of women’s basketball’s most accomplished players, who died in January 2022. She was a pioneer in the sport, scoring the first basket in women’s Olympic history and becoming the first and only woman officially drafted by the N.B.A. And while she was one of the first two women inducted into the Basketball Hall of Fame, she has remained largely unknown, even among basketball enthusiasts.\n\nThe documentary, directed by Ben Proudfoot and executive produced by Shaquille O’Neal and Stephen Curry, is part of the Op-Docs series “Almost Famous,” a collection of short films featuring people who nearly made history — and were happy anyway. The Times’s Op-Docs team developed, commissioned and debuted the film. Lindsay Crouse, a co-executive producer for Op-Docs, conceived the series. Regina Sobel and Andrew Blackwell were the supervising editors and Yvonne Ashley Kouadjo was the associate producer. Christine Kecher, senior commissioning editor for Op-Docs, led the campaign. Adam Ellick, who leads Op-Docs and Opinion Video, was the film’s executive producer.\n\n“What an incredible tribute to the tireless work of our Op-Docs and Opinion Video teams,” said Kathleen Kingsbury, Opinion editor. “This Oscar win recognizes The Times’s ambition and vision for what we are capable of across mediums. More than a decade of investment in video and relationship building in the field has led us to today, and I’m so proud to work with people who produced this innovative, visionary and high quality work.”\n\n“Lucy Harris dominated her sport during an era when female athletes lacked notoriety, and a viable platform to succeed at the professional level,” Adam said. “That is why this story showcasing one of greatest college athletes of all time remains so tragically unknown. Yet, Lucy helped pave the way for the stars of today’s W.N.B.A. Our Op-Doc team is so proud to have developed and commissioned this film with the incredibly talented filmmaker Ben Proudfoot. His work not only memorializes Lucy’s legacy, but it will also inspire future generations of female athletes.”\n\n“The Queen of Basketball” premiered at the 2021 Tribeca Film Festival and won Best Documentary Short at the 2021 Palm Springs International ShortFest. It also won Best Documentary Short at the 2021 Critics Choice Documentary Awards. This is the third year in a row Op-Docs received an Oscar nomination: Proudfoot was nominated in 2021 for “A Concerto is a Conversation,” and Laura Nix’s “Walk Run Cha-Cha” was nominated in 2020.\n\nOp-Docs is The Times’s Emmy-winning short documentary film series. Curated from works by both renowned and emerging filmmakers, the collection of more than 350 short films has sparked global conversations, influenced national policies and garnered an array of industry distinctions, including Emmy Awards, Peabody Awards and Oscar nominations. All Op-Docs can be seen at nytimes.com/OpDocs."}, {"url": "https://prabook.com/web/lindsay.crouse/3594299", "page_content": "Lindsay Crouse Edit Profile\n\nactress\n\nLindsay Crouse, American Actress. Recipient Obie award for Reunion, 1980, Theater World award for The Homecoming, 1992. F C.\n\nBackground Crouse, Lindsay was born on May 12, 1948 in New York City. Daughter of Russel and Anna (Erskine) Crouse.\n\nEducation Bachelor, Radcliffe College, 1970.\n\nAchievements Lindsay Crouse has been listed as a notable Actress by Marquis Who's Who."}]}