{"Lindsay Crouse has written and directed several plays and films.": [{"url": "https://www.rottentomatoes.com/celebrity/lindsay_crouse", "page_content": "Highest Rated: 97% House of Games (1987)\n\nLowest Rated: 18% Bye Bye, Love (1995)\n\nBirthday: May 12, 1948\n\nBirthplace: New York, New York, USA\n\nAn excellent character actress of the 1970s, 80s and 90s, Crouse had established herself as an outstanding off-Broadway actress in such roles as Ophelia opposite William Hurt's \"Hamlet\" and Viola in \"Twelfth Night; she won an Obie in her then-husband David Mamet's \"Reunion\" in 1980. After a strong cameo in \"The Verdict\" (1982), a moving performance as an Ethel Rosenberg-inspired character in \"Daniel\" (1983) and an Oscar-nominated turn in \"Places in the Heart\" (1984), Crouse played a cool, impressive lead in \"House of Games\" (1987), written and directed by Mamet. Her film career picked up in the mid-1990s with turns as Randy Quaid's ex-wife in \"Bye Bye, Love\" (1994), as the boy's mother in \"The Indian in the Cupboard\" (1995) and in support of Charlie Sheen in sci-fi actioner \"The Arrival\" (1996). Crouse also appeared briefly as Marilyn Monroe's acting coach in \"Norma Jean and Marilyn\" (HBO, 1996). She is the daughter of playwright/producer Russel Crouse."}, {"url": "https://www.britannica.com/biography/Lindsay-and-Crouse", "page_content": "Lindsay and Crouse, American duo responsible for coauthoring humorous plays and collaborating on theatrical productions. Howard Lindsay (b. March 29, 1889, Waterford, New York, U.S.—d. February 11, 1968, New York, New York) and Russel Crouse (b. February 20, 1893, Findlay, Ohio, U.S.—d. April 3, 1966, New York, New York) were notable both for their continual successes and for the way they complemented each other’s talents.\n\nPrior to meeting Crouse, Lindsay had already gained experience as an actor, director, and playwright, traveling for 42 weeks in the production of Polly of the Circus. Crouse’s early experience was primarily journalistic, although he did write a libretto for The Gang’s All Here (1931), which ran for only two weeks. He also wrote several nostalgic books in the early 1930s about 19th-century America.\n\nWhile trying to salvage a play in 1933, producer Vinton Freedley paired the talents of Lindsay and Crouse. The result was Anything Goes (1934) and a partnership that was to expand and mature over the following years. Their longest-playing drama was a 1939 production based on Clarence Day’s book Life with Father, which ran for 7 1/2 years (3,213 performances) and in which Lindsay played Father opposite his real-life wife, Dorothy Stickney. When Lindsay and Crouse were offered Arsenic and Old Lace in 1940, they tried their hands at theatrical production, and the result was another success. In 1946 the pair won the Pulitzer Prize in drama for State of the Union (1945), which was a satire of American politics. Sections of this play were rewritten every day to correspond to actual events. They also wrote the libretto for the play The Sound of Music (1959).\n\nLindsay and Crouse’s work had a universal appeal, created by a blend of Lindsay’s theatrical knowledge and Crouse’s sharp wit. Together they had a gift for transforming ideas into extremely popular musicals and plays."}, {"url": "https://www.tvguide.com/celebrities/lindsay-crouse/credits/3000540186/", "page_content": "Join or Sign In\n\nSign in to customize your TV listings\n\nContinue with Facebook\n\nContinue with email\n\nBy joining TV Guide, you agree to our Terms of Use and acknowledge the data practices in our Privacy Policy."}, {"url": "https://www.tvinsider.com/people/lindsay-crouse/", "page_content": "Actress\n\nBirth Date: May 12, 1948\n\nAge: 75 years old\n\nBirth Place: New York City, New York\n\nAn excellent character actress of the 1970s, 80s and 90s, Crouse had established herself as an outstanding off-Broadway actress in such roles as Ophelia opposite William Hurt's \"Hamlet\" and Viola in \"Twelfth Night; she won an Obie in her then-husband David Mamet's \"Reunion\" in 1980. After a strong cameo in \"The Verdict\" (1982), a moving performance as an Ethel Rosenberg-inspired character in \"Daniel\" (1983) and an Oscar-nominated turn in \"Places in the Heart\" (1984), Crouse played a cool, impressive lead in \"House of Games\" (1987), written and directed by Mamet. Her film career picked up in the mid-1990s with turns as Randy Quaid's ex-wife in \"Bye Bye, Love\" (1994), as the boy's mother in \"The Indian in the Cupboard\" (1995) and in support of Charlie Sheen in sci-fi actioner \"The Arrival\" (1996). Crouse also appeared briefly as Marilyn Monroe's acting coach in \"Norma Jean and Marilyn\" (HBO, 1996). She is the daughter of playwright/producer Russel Crouse."}, {"url": "https://www.rogerebert.com/cast-and-crew/lindsay-crouse", "page_content": "Scanners\n\nJames Bond (Daniel Craig) in \"Casino Royale.\" With every move he makes, another chance he takes. Odds are...\n\nWhat accounts for the movies' fascination with gambling? That's a question I mull over in a survey of pictures (from \"Gilda\" to \"Barry Lyndon\" to \"Casino\" to \"California Split\" to \"The Cooler\") about the addictive alchemy of luck, chance, fate and skill at MSN Movies. Making a movie is itself a grand gamble. You never know how it's going to turn out, and the results have as much to do with circumstance as they do with talent or craftsmanship. An excerpt from \"High Rollers\": Gambling does not rank among the \"seven deadly sins.\" It doesn't have to. Just about all the capital vices can be found in the psyche of the gambler, and not just in the usual suspects, greed and envy. There's also plenty of room for gluttony (overindulgence, addiction, substance abuse); wrath (rage, vindictiveness); sloth (indifference, jadedness, existential apathy); lust (licentiousness, dissolution); and, the deadliest of all sins: pride (hubris, arrogance, usually expressed in the form of cheating, or a misplaced belief in a dubious \"system\" designed to beat the odds).\n\nThe grandest \"Casino Royale\" -- the ultimate gamble -- is, of course, the game of life itself: a series of cosmic wagers in which the stakes vary wildly from day to day, bet to bet. Some people seem to go \"all in\" all the time, some ante up just enough to get them through each hand they're dealt, and others are perpetual folders who try to opt out of the game entirely in order to avoid risking too much.\n\nBut since the time of Oedipus the central question has always been: How much of the outcome is governed by free will and how much by predestination? The answer depends on the (rigged?) nature of the game you're playing, and whether the winners and losers are predetermined, either by some higher interventionist power (appeased by superstitious rites, such as blowing on dice or disingenuously proclaiming the need for new footwear for one's tot), or by a simple calculation of the odds that invariably favor \"the house.\"\n\nAlthough one can only play the hand one is dealt, a poker or blackjack player retains a small degree of influence over his fate, as some game variables are subject to decision-making based on statistical knowledge and experience. Those who gamble on a roll of the dice or a spin of the wheel, however, rely on pure chance. Or, as it is known in gaming circles, \"luck.\"\n\nThe odds of winning are never better than 50-50 (red or black in roulette), which is why most gambling stories -- and gambling movies -- are either about chance, or about cheating. As in the 1946 classic film noir, \"Gilda,\" with Glenn Ford and Rita Hayworth, these tales are of the men and women who learn to \"make their own luck.\"\n\nThe only way to increase your luck without trickery is with skill -- by learning to read the odds based on the cards that have already been played, or by learning to read the people who play them. In Curtis Hanson's new \"Lucky You,\" hot-headed poker player Huck Cheever (Eric Bana) has to learn how to do both if he wants to woo songstress Billie Offer (Drew Barrymore). As his father, L.C. (Robert Duvall), tells him: \"You've got it backwards, kid. You play cards the way you should live life, and you live life the way you should play cards.\"\n\nThat's the lesson movie gamblers are always trying to learn. Everybody has a \"tell\" -- a little unconscious tic that reveals when they're bluffing. In David Mamet's \"House of Games,\" renowned psychoanalyst Margaret Ford (Lindsay Crouse) thinks she understands human behavior until she is schooled by Mike (Joe Mantegna) in the ways of gamblers and con men who avoid being understood. The big gamble comes down to a matter of pride -- and the skill and intuition to fool the other players.\n\nIn the most recent \"Casino Royale\" film, the hubris of James Bond (Daniel Craig) costs him a high stakes game, and nearly costs him his life. Every scene in the movie involves a bet, a bluff, or a calculated risk. Whether the game is espionage, romance, the stock market, or poker, the rules are basically the same: Outwit, outplay and outlast your opponents....\n\nContinue reading at MSN Movies..."}, {"url": "https://www.imdb.com/title/tt0093223/reviews", "page_content": "7 /10\n\nWarning: Spoilers\n\nSpoilers. In his essay on \"compensation,\" which we would nowadays call \"immanent justice,\" (or maybe \"karma\") Emerson wrote: \"Commit a crime and the earth is made of glass.\" After participating in a theft and murder, Lindsay Crouse returns to her office and the first thing she does is close all the blinds, as if her conscience, indeed the conscience of the whole world, is outside, staring in at her.\n\n\n\nThis is a fairly intelligent movie, especially considering that it's the first outing as director for David Mamet. He handles the camera quite well. Nothing looks stagy. And he knows when to let the shot linger on the door to \"The House of Games\" as it swings very slowly closed after Crouse enters for the first time, and we get to hear the latch click shut behind her. The screen is filled with a huge sturdy doorknob and lock, and a somewhat ragged sign reading simply \"Games.\"\n\n\n\nIt's a story of the long con, meaning a thoroughly planned and time-consuming scenario played for big stakes, like \"The Sting\". The whole plot, involving a dozen people, is orchestrated down to the smallest move and the placement of props by Joe Montegna and the mark is Crouse, although she doesn't discover this until the end, and then only by accident. Yes, some of the dialog sounds as if it's being read from cue cards, but I take this to be deliberate stylization. Crouse and Montegna have shown in other works that they can be as naturalistic as the next performer.\n\n\n\nHere, with Mamet's odd script, they take chances. There is a lot of repetition. Character A says, \"I'm going to take you somewhere.\" B says: \"You're going to take me somewhere.\" This goes on mostly between the two leads. There are many instances, still sounding stylized, of speakers interrupting themselves and beginning a new utterance: \"I can't believe that -- How did all this get started?\" I think rhetoricians call this \"anacoluthia\" but I wouldn't bet on it. When the narrative requires it, the dialog moves along with considerable verve. The script is to movies what Hemingway's prose was to literature as far as stylization goes, and it works here. (It doesn't always work: vide \"Barfly.\")\n\n\n\nThe film gives us a picture of human nature that isn't very pretty. We are all con men, it says. And we are, in a way, although not always illegally. The sociologist Erving Goffman called our everyday con jobs \"impression management.\" Goffman also wrote a fascinating article called \"Cooling Out the Mark,\" a study of how con men quiet the mark down in order to leave him sufficiently satisfied with himself that he doesn't go to the cops or otherwise seek revenge. Montegna does a splendid job of cooling out Crouse: \"You're going to feel a strong need to confess. Don't do it. You had nothing to do with it. It was all an accident. You're completely innocent.\" (This just after he's relieved her of \"eighty large\" and is about to beat it to the airport to skip town.)\n\n\n\nLindsay Crouse, as I say, is the mark, but she's hardly an innocent bystander. She has written a best seller, \"Driven\", about compulsive behavior, but she smokes a lot and steals things and is drawn to the world the con people inhabit. As a psychiatrist, however, she has learned to \"forgive herself\" (how do you do that?) and after shooting her exploiter full of numerous holes, she takes a vacation, comes back, and with tan and a big smile boosts a gold lighter out of the purse of a woman sitting next to her in a restaurant.\n\n\n\nThere is so much unwatchable garbage on the screen these days that when something comes along that doesn't insult your intelligence, like this movie, I feel myself heaving a sigh of relief. Definitely worth watching."}, {"url": "https://hollisarchives.lib.harvard.edu/repositories/24/resources/6429", "page_content": "Part of the Houghton Library Repository\n\nHoughton Library is Harvard College's principal repository for rare books and manuscripts, archives, and more. Houghton Library's collections represent the scope of human experience from ancient Egypt to twenty-first century Cambridge. With strengths primarily in North American and European history, literature, and culture, collections range in media from printed books and handwritten manuscripts to maps, drawings and paintings, prints, posters, photographs, film and audio recordings, and digital media, as well as costumes, theater props, and a wide range of other objects. Houghton Library has historically focused on collecting the written record of European and Eurocentric North American culture, yet it holds a large and diverse number of primary sources valuable for research on the languages, culture and history of indigenous peoples of the Americas, Africa, Asia and Oceania.\n\nHoughton Library’s Reading Room is free and open to all who wish to use the library’s collections."}, {"url": "https://www.nytimes.com/1977/12/22/archives/lindsay-crouse-actress-and-david-mamet-wed.html", "page_content": "Lindsay Crouse, the actress, and David Marnet, the playwright, were married yesterday at the home of the bride's mother, Mrs. Russel Crouse, widow of the playwright. State Supreme Court Justice James J. Leff performed the ceremony.\n\nThe bride has appeared in several plays and the movies “All the President's Men” and “Slap Shot.” Her father and Harold Lindsay collaborated on many Broadway plays, including the long‐running “Life With Father.”\n\nMr. Mamet is the author of the current Off Broadway play “A Life in the Theater” and of “American Buffalo,” which last season won the New York Drama Critics Circle Award for best American play."}, {"url": "https://famousdb.net/lindsay-crouse/", "page_content": "Lindsay Crouse: A Multitalented Personality\n\nWhen we talk about Lindsay Crouse, we talk about a multitalented personality who has excelled in various fields. From being a journalist to an actress and writer, she has made a name for herself in each of these domains. In this blog post, we will explore her personal life, top movies, and today’s career.\n\nJournalism: The Beginning of Lindsay Crouse’s Career\n\nLindsay Crouse began her career as a journalist, working for The Village Voice and The New York Times. She covered a wide range of topics, including politics, sports, and culture. Her writing style was known for being sharp and insightful, and she quickly gained a reputation as one of the most talented journalists of her generation.\n\nDespite her success in journalism, Lindsay always had a passion for acting. She had studied drama at Radcliffe College and had even performed in a few plays. In 1976, she decided to pursue acting full-time and made her debut in the film All the President’s Men.\n\nLindsay Crouse: An Actress with a Diverse Range of Roles\n\nOver the years, Lindsay Crouse has played a diverse range of roles in both film and television. Some of her most notable performances include her role as Dr. Leslie Rosen in the film The Verdict, for which she received an Academy Award nomination, and her role as Kate Miller in the film Slap Shot.\n\nIn addition to her work in film and television, Lindsay has also appeared on stage. She has performed in numerous plays, including House of Blue Leaves and Proof, for which she won a Tony Award.\n\nLindsay Crouse: A Writer with a Unique Voice\n\nIn addition to her work as an actress, Lindsay Crouse is also a talented writer. She has written several plays, including The View From Here and Mr. X, and has also written for The New York Times and The Huffington Post.\n\nHer writing style is known for being honest and thought-provoking. She tackles difficult topics with sensitivity and nuance, and her work has been praised for its unique voice.\n\nLindsay Crouse: Today’s Career and Personal Life\n\nToday, Lindsay Crouse continues to work in both the entertainment industry and as a writer. She has appeared in several recent films, including Spotlight and The Post, and has also written several pieces for The New York Times.\n\nWhen she’s not working, Lindsay enjoys spending time with her family. She has been married to playwright David Mamet since 1991, and the couple has one child together.\n\nConclusion\n\nLindsay Crouse is a multitalented personality who has achieved success in several different fields. From her early days as a journalist to her current work as an actress and writer, she has always been driven by a passion for storytelling. Her unique voice and range of talents continue to make her a force to be reckoned with in the entertainment industry."}, {"url": "https://www.wikiwand.com/en/Lindsay_Crouse", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about Lindsay Crouse?\n\nSummarize this article for a 10 years old"}]}