{"Clay timpani is made from a ceramic material, usually terracotta.": [{"url": "https://www.britannica.com/art/terra-cotta", "page_content": "terra-cotta, (Italian: “baked earth”) literally, any kind of fired clay but, in general usage, a kind of object—e.g., vessel, figure, or structural form—made from fairly coarse, porous clay that when fired assumes a colour ranging from dull ochre to red and usually is left unglazed. Most terra-cotta has been of a utilitarian kind because of its cheapness, versatility, and durability. Limitations in the basic materials often cause a superficial similarity between simply made works as far separated by time and distance as early Greece and the modern cultures of Latin America.\n\nThroughout the ancient world, one of the most common uses of terra-cotta was for building-brick, roof tiles, and sarcophagi, the last often decorated with paintings. Small terra-cotta figures from the Early Bronze Age, as early as 3000 bce, have been found in Greece, and larger objects dating from the 7th century bce have also been found. Greek artists carried the craft to Etruria, whence both Etruscan and Greek sculptors moved to work in Rome. Most Greek terra-cotta statuary, more common than once thought, was used to decorate temples. The modeled Etruscan statues, at times very Greek in style but often with a gayer or fiercer flavour, were admired widely in antiquity. Figures on Etruscan sarcophagi often were of terra-cotta. Few Roman terra-cotta statues have been found.\n\nMore From Britannica South Asian arts: Gupta period: terra-cotta\n\nMolded statuettes 6 to 7 inches (15 to 18 cm) in height are common throughout the ancient world, among them very early primitive figures from Cyprus and painted, glazed human figures from Minoan Crete. The Cypriot figures often comprise groups of dancers or warriors, and the Cretan feature lively poses of women, horsemen, or animals. After the 7th century bce, styles became less hieratic, the subjects more mundane—e.g., a nurse with child, a teacher and pupils, an actor in costume. The Tanagra figurines, found in Tanagra in central Greece (Boeotia), are the best known of this kind. In the Hellenistic period, from the 4th century bce, centres of statuette production moved to Asia Minor and westward, being found throughout the Roman Empire as far as Britain. Styles in the East became more ornate and influenced by Oriental values in design and subject.\n\nArchitectural relief, especially where wood or clay was used for building, used floral or more abstract designs and such figured representations as chariot races or animal or female heads; examples have been found in Asia Minor, Greece, and Etruscanized southern Italy. Votive reliefs also were common, notably those of the local divinities and heroes rendered broadly and smoothly in Tarentum (Taranto), southern Italy, and the small, meticulous reliefs of local cults found at Locris in central Greece. The fine 5th-century reliefs from the island of Melos, in which mythological scenes predominate, decorated chests. Much Roman architecture is decorated with relief themes from mythology, especially of Dionysus and his revellers.\n\nThe use of terra-cotta for all purposes virtually died out between the end of the Roman Empire and the 14th century. In 15th-century Italy and Germany it appeared again, either molded or carved, and in its natural colour as friezes, moldings, or inset medallions decorating buildings. A new use of terra-cotta was in the highly glazed and coloured sculpture introduced in Florence early in the 15th century by the Della Robbia family. The effect, adding a freshness of accent especially to marble and stone, was imitated widely, and the use of terra-cotta, glazed or unglazed, spread throughout Europe. Free sculpture in terra-cotta also was revived in the 15th century by such artists as Donatello, Verrocchio, and especially Guido Mazzoni and Antonio Begarelli working in Modena; often it was painted in natural colours or to imitate marble or bronze.\n\nDuring the following centuries, most terra-cotta figures were executed as preliminary studies, though the works of such 18th-century French artists as Jean-Baptiste Lemoyne and Jean-Antoine Houdon display a personal immediacy of subject that is not transferable to the harder material. In the same period, such pottery centres as Sèvres in France introduced finely wrought small groups with allegorical and mythological themes. Terra-cotta was used both architecturally and for figures during the 19th century, but its modern revival dates from the 20th century, when both potters and architects again became interested in the aesthetic properties of the material."}, {"url": "https://www.bbc.co.uk/bitesize/topics/zgvbkqt/articles/zphthcw", "page_content": "The starting materials are soft and malleable, meaning they can be shaped. Clay is an example of a starting material.\n\nThese soft materials are shaped and then heated to make harder materials which we call ceramics.\n\nThese new hard ceramic materials have a fixed shape and cannot be bent."}, {"url": "https://themainmuseum.org/ceramics/terracotta-vs-clay/", "page_content": "Last Updated on March 29, 2023\n\nTerracotta and clay are often used interchangeably, but they have distinct characteristics that set them apart. Clay is a versatile, natural raw material composed of fine-grained minerals, while terracotta refers specifically to a type of fired clay. Terracotta is known for its distinctive brownish-orange hue and is created by molding and firing earthenware clay at a lower temperature. Although terracotta can be made from various clay types, it is the unique combination of iron-rich earthenware clay and firing process that imparts its signature color and texture. In essence, all terracotta is clay, but not all clay becomes terracotta.\n\nSo, what’s the difference between terracotta and clay? These materials vary in composition, texture, and firing temperature, to name a few. Terracotta, for instance, is a type of clay that’s characterized by its rich, reddish-brown hue, while traditional clay is a more versatile material that comes in a variety of colors and textures.\n\nWhat Is The Difference Between Clay and Terracotta?\n\nClay is a natural occurring material that is used in a number of products. Terracotta is one of the finished products that can be produced by using clay.\n\nTerra-cotta is known for it’s brown orange color and this popular form is produced by using earthenware clay. But terracotta does not only refer to this orange brown type of pottery, terracotta can be made from all types of organic clay. And it is not always the traditional color.\n\nTerracotta is also spelled a number of different ways in different cultures including terra cotta, terra-cotta, and terra cocta. No matter what you call it they are referring to a ceramic derived from an organic clay that is either glazed or unglazed.\n\nWhat Type Of Clay Is Used For Terracotta\n\nBecause terracotta can be produced using any all organic clay, it is produced from earthenware. Earthenware is porous clay that is ideal for forming into vessels and other shapes. Once fired it produces a very durable material.\n\nIs Earthenware and Terra-Cotta The Same Thing?\n\nSimilar to the difference between clay and terracotta, earthenware is a specific type of clay while terracotta is a finished product created by using earthenware. Earthenware is used the world over for producing ceramic products including terracotta objects.\n\nWhere Does The Clay For Terracotta Come From?\n\nTerracotta’s first appearance in the archaeological record is from the pre Columbian and western cultures with the earliest example located in Eastern Europe. That find is estimated to be at least twenty-six thousand years old. These pieces were produced from earthenware. Examples of terracotta from ancient cultures is extensive pointing to the cultural importance of terracotta to human evolution.\n\nIs Terra Cotta Dinnerware Healthy To Use?\n\nProperly fired terracotta is perfectly safe to be used with food. It is safe to be heated in the oven and even in the microwave. They are able to withstand the heat of an open flame and even baking. Terracotta (Cazuelas in South America) are very commonly used in the home for cooking and roasting. Terra cotta is particularly good at retaining heat making them excellent cookware for keeping food warm.\n\nWhat Does Terracotta Look Like?\n\nThe most common form of terra cotta is a brow orange color. Most ancient examples found have been this color and it is still the most popular color today. But color can vary depending on the source of organic clay that is used.\n\nHow Durable Is Terracotta?\n\nOnce fired properly, terra-cotta is extremely strong and durable. Terracotta can last for hundreds of years, and longer. They have naturally occurring bacteria and mold resistance. Modern terracotta is often sealed to increase its durability.\n\nWhat Is Terracotta Used For?\n\nLike many other ceramic pottery, terracotta is used to make everything from dinnerware and cooking vessels to sculptures and flower pots. Terracotta is also used to produce bricks, roofs, and pipes due to their durability and natural mold resistance.\n\nIs Clay Earthenware?\n\nEarthenware is a type of clay. It is used to create ceramic pottery items. Earthenware is usually formed on a pottery wheel and fired in a kiln to harden and set it. Earthenware requires a second firing where it has been glazed between the two firings. The glaze makes the finished project able to hold fluids.\n\nWill Terracotta Dissolve In Water?\n\nTerracotta is waterproof and will not dissolve in water or other fluids. The firing and glazing process makes the porous earthenware water proof. That means terracotta roofs are waterproof as well as all other earthenware products produced through this process.\n\nHow Is Terracotta Produced?\n\nSoft porous organic clay is used to produce terracotta. First a potter forms the clay into the desired shape and then it is fired at very hot temperatures. Once the first firing is done and the piece cools it is glazed and fired a second time.\n\nFor more ceramics guides and tips check out these articles"}, {"url": "https://ruralhandmade.com/blog/a-complete-guide-to-everything-terracotta-and-how-do-you", "page_content": "Diy | Giving\n\nHistory of terracotta\n\n\n\nWhat is Terracotta? The term Terra-cotta comes from the Italian dictionary meaning “Baked-earth,” ceramic Pottery. It is made out of a fairly coarse, porous type of clay that is high in iron oxides. Terracotta clay is easy to sculpt into various products such as vases, kitchen utensils, tile, planters, sculptures, bricks, etc. Once shaped, the dry clay is baked in a kiln or atop combustible material in a pit at a typical firing temperature of around 1,000 °C (1,830 °F), though in historical and archaeological cases, it may be as low as 600 °C (1,112 °F). After the baking part, the glaze has been applied to the product by which it gets its red color, although the actual raw clay can be brown, maroon, green, or red. Such clay can be easily found near the pounds, and generally, when these pounds get dry, the artisan collects this clay.\n\n\n\n\n\nTerracottas history can be traced from the Prehistoric art era; favorite products found in history were The Venus of Dolni Vestonice (c.26,000 BCE), The Thinker of Cernavoda (5000 BCE), and The Chinese Terracotta Army Warriors (246-208 BCE). It has been a great part of Chinese Pottery (from 10,000 BCE), Greek Pottery (from 7,000 BCE), and Mesopotamian and Egyptian arts and sculptures. They were also seen in Minoan art from Crete and Italian Etruscan art.\n\nTypically terracotta was used in making decoration (architecture), sculptures of gods and goddesses, terracotta reliefs, and human figurines. Due to its lightweight nature, it has been extensively used for architectural purposes worldwide.\n\nTypes of clay\n\nBased on its origin, clay can be divided into two categories. The first is our organic clay extracted from natural minerals, and the second is artificial clay made out of polymer.\n\nTypes of organic clays are:-\n\nEarthenware - Clay, which is used for making terracotta. It is found impure in its basic state and then refined to make products out of it. Kaolin - It is a soft white clay known as china clay. The natural state of kaolin is smooth powder consistency, white color, and consists of mineral kaolinite in it. Stoneware - After earthenware, crockery came into frame. It is non-porous, liquid-resistant, and more durable than any other pottery.\n\nHow to make terracotta products\n\n1. Collect the clay\n\n\n\nFrom nearby pounds or moisturized land, clay has been dug out using the hands or spade shovel. It is not compulsory to get the clay in wet form only as this factor changes from place to place and their surroundings. To determine if it is just the soil or clay, you can check its consistency; clay will be smooth in texture and have smaller particles than mud. Dry clay can be restricted by crumbling it or mixing it with some water.\n\n2. Refining the clay for a smooth texture\n\n\n\nSome water is mixed into the clay to give it a fluid consistency. While pouring the water, keep mixing the clay to avoid any big chunks of clay and keep the mixture smooth. As you achieve the liquid surface, it's time to rest or leave the mix to settle down the clay for some hours.\n\nAfter that, to achieve the smoothest consistency of clay, it is refined with the help of a sieve. Keep repeating the process until you get the best result.\n\n\n\n\n\nTo prepare the clay to mold, firstly, it is kneaded with a hammer, legs, or hands to remove the air bubbles from it. Such clay can be stored in plastic bags until you are ready to use it to create something out of it.\n\n3. Throwing process\n\n\n\nNow we will start with the fun part of terracotta product making. This hero of the story will be a potters wheel where all the action will occur. Prepared clay will be placed on the potter's wheel and will start the revolution with the help of a stick to give it a motion. In modern-day solutions, electric pottery wheels are also available in the market, and for some reason, you cannot get any of these to make your DIY pottery wheel at home. With the help of our hands and some good skills, we will start to mold the clay into whatever shape we want to achieve from the clay.\n\nTo achieve a smooth surface, wet cloth is used on the outer shell and gives it texture or other details tools like Sculpting tool, Scraping tool, Cutting tool, Fine Detailing tool, Smoothing tool, Shaping tool & Trimming tool are used. Once the object gets its shape and texture, they are dried out for two to three days in son, or in some cases, they are dried out inside to avoid excess dry out or cracks on the surface of the object.\n\n4. Firing the clay objects\n\n\n\nDried objects are baked in a kiln or atop combustible material in a pit to make them permanent and hard. Such kilns can run on natural or propane gas, wood, coal, and electricity. Some people fire their work in pits in the ground. They layer the pots with hay, seaweed, or other combustibles. The fire burns from top to bottom over a day or two. The chemicals in the grass, or other chemicals added to the fire, are absorbed into the pot and create colors in the clay. But this is not the only factor that affects the color of an object; to get the different colors and properties of terracotta, temperature derives. During this process, some things can get destroyed.\n\n5. Finishing process\n\n\n\nThis step is more of a choice as the terracotta products can be glazed or unglazed according to their final use. To beautify the product, the artist can also paint the object by using some white color and make some good motifs to decorate the product.\n\nHow to make Terracotta products\n\nTypes of terracotta\n\n\n\n\n\n1) Porous terracotta:\n\nTo prepare porous terracotta, sawdust or ground cork is added to the clay before the shaping stage. When the particles of such clay are burned in a kiln, the organic particles burn and leave pores in the particles. Porous terracotta is a fireproof and soundproofing material. It can be easily sawn and nailed with nails, screws, etc. It is lightweight but structurally weak.\n\n\n\n\n\n2) Polished terracotta:\n\nPolished terracotta is also known as fine terracotta or earthenware. To obtain this variety of terracotta, the items are fired at a lower temperature of about 650°C. The first burning is known as biscuits. Items taken to the cake stage are removed from the oven and allowed to cool. They are covered with a glazing compound and fired again in the oven at about 1200°C. Earthenware is available in various colors and indicates the superior quality of the terracotta.\n\n\n\n\n\nWhat are the benefits of making and using products out of terracotta?\n\nIt is a strong and durable product if effectively made and used; it is a good choice even for short-term use. For example, this product can replace disposable cups as it is cheap and recyclable with minimum steps. Eating or drinking in earthenware can be a healthy step towards your health; it also increases the flavour of food without any harm. If we talk about aesthetics, it can be a good choice in the world of plastic everywhere. It will always keep you in touch with the beautiful, comforting environment.\n\nA pretty good amount of color choices are also available in this material. It is cheaper than another ordinary finely stoneware products. Clay is one of the most versatile materials that can be molded into anything our creative minds imagine. It became one of humankind's favorite materials for creating products. It is a fireproof material, which can also be used with RCC work. Terracotta products are light in weight. Thus, it can be easily used anywhere and are easy to install. Terracotta does not get affected by atmospheric agencies, acids, and weathering actions compared to any other stone material.\n\n\n\n\n\nInnovation and evolution in how to use terracotta products\n\n\n\n\n\n\n\nArchitecture - People use terracotta in architecture very creatively since it is lightweight and keeps the surroundings cool. It is a great choice of material in architecture. The complete house can be constructed out of it. With the making of traditional tiles out of terracotta, new tiles are also being built; you can see some innovative tiles designed on Nuvocotto Jaalis . They have positioned clay tiles from mere a functional product to the first choice of creative designers and architects across India and UAE. Some architectures also develop a Biomimicry cooling system to replace the central cooling system. Designed an air cooler made out of clay inspired by beehive structure and customized through advanced computational analysis and modern calibration techniques. Home appliances - A fridge has been made out of terracotta clay. It keeps food 8 degrees cooler than the outside air, but it doesn't need any electricity to run, just some water to use the porous property of clay to make it cool. It is cost-effective, environmentally friendly in all ways, and full-feeling all the requirements simultaneously. Home decor - Plantaires made of terracotta are the best choice for growing plants. Some artists are making very creative vases and planters in the shape of human body parts, giving them a very fresh modern, and artistic touch. To add some earthy tone to home interiors, a terracotta candle tea stand , table toppers , 3D wall paintings (wall relief mural), pen stand, and showpieces are great choices. Terracotta jewelry - Even in the fashion world, terracotta can be used. Artists have been using terracotta to make some very beautiful statement jewelry pieces out of it. Businesses can also try to make terracotta jewelry by giving it a modern look inspired by modern forms and shapes. After the baking part, it can be beautified by using colors and stones. Kitchen utensils and cutlery - After the pandemic, everyone is trying to live a healthy life, and people are more aware of what they are eating, where they are storing their food, in what utensils they are eating. Terracotta pans and cutlery can be a good choice for it. Studies show that storing food and liquid in terracotta utensils makes the food more nutritious. Keeping the drinking water in terracotta pots and bottles keeps it cool and contains minerals. Chillum (Smoking pipes) - People are interested in smoking their tobacco and weed in the best way possible. Terracotta chillums can be a great option. It infuses that earthy flavour into your stuff and makes the experience more lightful. Terracotta chillums , hookah, and pipes can be used.\n\n\n\n\n\nA step towards a better world A eco-friendly world\n\nWe talk every day about how global warming is increasing and how the environmental conditions are getting worse day by day. But, we are just talking; we don't even take a little step towards the betterment of nature. So, start with a little effort. It can be anything: switching a plastic mug with a terracotta mug or keeping your plants in terracotta pots (even they will start to feel more lively to you). Terracotta is the best option for a healthy environment and living style. It comes out of the soil and easily emerges in the ground with some easy steps. The Recycling ratio of terracotta is very high as well as it is a very affordable material to use and make products out of it. Still, many creative milestones can be achieved by creating innovative products out of clay. So, what are you waiting for?\n\n\n\n"}, {"url": "https://thepotterywheel.com/what-is-terracotta-made-of/", "page_content": "25 shares Facebook\n\nTwitter\n\nPinterest 25\n\nAffiliate Disclaimer\n\nThis site contains affiliate links. I may receive a commission from Amazon or other third parties if you make a purchase after clicking on of these links.\n\nI’d always thought that terracotta clay should be fired at low temperatures. Firing basically means baking the clay in a kiln. But I bought some recently and the manufacturer’s spec said it could be fired up to 1181C (2158F). This is much higher than I thought, and it led me to question what I know about terracotta. In particular, I found myself wondering exactly what is terracotta made of? So, I looked into it, and this is what I discovered….\n\nTerracotta refers to either ceramics made from terracotta clay or the clay itself. Terracotta clay has a high iron oxide content. It is this that gives it its distinctive red color. The iron is also partially why terracotta is a low fire clay. It’s also why it is porous when fired.\n\nBut First a Few Distinctions\n\nTerracotta is sometimes written as terra cotta, and also terra-cotta. Almost all the sources I read pointed out that, in Italian, the literal meaning is ‘fired earth’. The Latin origin of the Italian term is Terra Cocta.\n\nThis seems simple enough, however, the term terracotta is used to refer to a few different things. These are:\n\nType of clay body in its unfired state Ceramic items that are made from fired clay A particular red-brown color\n\nTo fully address the question of what terracotta is made of, it’s best to approach each of these uses in order. So, let’s start off with the clay itself, and dive into what this is made of….\n\nWhat is Terracotta Clay Made of?\n\nTerracotta clay is either dug up from the ground and then processed. Or it can be manufactured by combining different raw materials. Formulated clay like this is put together using a specific recipe that I’ll say a bit more about later.\n\nFirstly, let’s take a look at clay that has been mined from the ground. Clay forms underground over many thousands of years. It is a combination of rock that has been worn to sediment by the elements, plus other minerals.\n\nWhen rock is ground away from its source by the wind and rain it sometimes collects at its point of origin. Sediment that collects at its point of origin and turns to clay is called primary clay.\n\nHowever, most rock sediment is moved by water and wind and collects at a different location. On its journey, it picks up impurities and contaminants. This is known as secondary clay. It contrasts with primary clay which is quite pure and uncontaminated.\n\nTerracotta is a Secondary Clay\n\nTerracotta is a good example of a secondary clay because it contains many contaminants and impurities. One of it’s key components is iron oxide. When terracotta is fired, its iron content interacts with the oxygen in the kiln and creates the distinctive red color.\n\nNot all terracotta is red, some are grey or buff-colored when it is unfired. Most terracotta is red-burning, which means that it is red or orange-brown when it’s been fired. However, some fired terracotta has brown or pink hues.\n\nThe iron content doesn’t just have an impact on the color of the clay. It also affects the temperature the clay can tolerate in the kiln.\n\nIron functions as a flux. A flux is an oxide that lowers the temperature at which a mixture of materials will melt. Clay contains glass-forming ingredients like silica. When the clay is fired, these glass formers melt and fill up the spaces between the clay particles.\n\nIt is this process that enables clay to become non-porous once fired. The molten glass cools as the kiln cools, and the pores in the clay remain closed. This process is called vitrification.\n\nSo, a certain amount of melting is valuable when clay is being fired. But all clay has a temperature at which the actual clay body will melt once it has become too hot. This temperature varies between different types of clay.\n\nBecause terracotta contains iron and other fluxing ingredients, it will melt at a lower temperature than stoneware or porcelain.\n\nLet’s take a look at what happens to it when it is fired at temperatures that are too high…\n\nTerracotta is a Low Fire Clay\n\nI have found quite a bit of conflicting information about the maximum temperature to which terracotta should be fired. These differences of opinion cropped up between different books that I read, and in online resources.\n\nFor example, the Potter’s Dictionary, by Hamer and Hamer, states that terracotta is ‘earthenware ceramics both glazed and unglazed’ (p370). And that earthenware is associated with being fired at ‘softer temperatures below 1100c (2012F)’, (p123).\n\nBy contrast, I referred to Ceramics for Gardens and Landscapes by Hessenberg. This book is about outdoor pottery and ceramics. And terracotta clay features quite heavily in the materials used by the potters discussed in the book.\n\nHessenberg cites different potters who fire their terracotta pieces at various temperatures. These temperatures range from 1040C (1904F), to 1170C (2138F).\n\nAlso, as I stated in my introduction, there are suppliers who advertise terracotta clay that fires up to cone 6 . Cone 6 is a mid-fire temperature normally associated with stoneware clay .\n\nIn spite of these differences, I did find some agreement about firing temperatures. For example, Tony Hansen of Digital Fire states that ideally terracotta is fired between cone 04 and 03. This range is from 1070c (1958F) to 1101c (2014F).\n\nIn a discussion on the ceramic arts forum , various potters agreed that terracotta is a low fire clay. In this context low firing means between cone 06 and 04, which is 1011c (852F) to 1070c (1958F).\n\nVitrification\n\nThe process of vitrification described above happens on a spectrum. Some clay becomes more vitrified (non-porous) than others.\n\nOne reason for this is that some clays contain more glass-forming materials than others. Terracotta contains fewer glass-forming materials than other clays. However, it does contain some and will vitrify a bit when fired.\n\nVitrification makes the clay less porous and stronger. When terracotta is fired it can become partially vitrified. However, once it is partially vitrified, if the temperature in the kiln keeps increasing, the clay body will start to suffer.\n\nOverfired terracotta will start to become very dense. This density makes it brittle rather than strong. It also warps, bloats up, and will eventually shatter or melt.\n\nHansen states that adding frit to terracotta can enable it to reach a higher degree of vitrification at lower temperatures. Frit is a kind of ceramic glass that is ground into a fine powder (source).\n\nWhilst terracotta with added frit is less porous, it is still being fired at a lower temperature.\n\nOther Additional Ingredients\n\nPotters and sculptors will also sometimes add different types of sand and grog to terracotta. Grog is clay that has been fired once and ground up into granules.\n\nGrog can add a gritty texture or tooth to clay and can help make it more resistant to frost. This is valuable if the piece being made is an outdoor sculpture or planter.\n\nSometimes ball clay is added to give the terracotta more strength once fired. Because fired terracotta is still quite porous it is also less strong than stoneware and porcelain. Typically, it is 10-12% porous when fired to cone 04 (1070C / 1958F).\n\nAdding ball clay, which has very fine particles, makes clay more plastic and easier to shape. However, the fine particles also sit between the larger clay particles and add strength to the ware.\n\nTerracotta Clay Recipes\n\nAs stated above, terracotta can be dug up from the ground and processed. Or it can be formulated using particular raw materials. The latter method is good for potters who need their clay to have very particular properties.\n\nLinda Arbuckle published a very helpful paper on earthenware clay with a range of recipes for terracotta clay.\n\nSample Recipes\n\nTerry Siebert’s Terracotta Redart 60 Talc 15 AP Green 15 Ball Clay 23 ( source )\n\nSt. John’s Terracotta 04 Redart 50 Goldart 10 AP Green 10 Ball Clay 10 Talc 20 Barium Carbonate 0.5 ( source\n\nOne of the problems that can occur with fired terracotta is that white deposits can form on the pot. These are soluble salts that form a white scum on the surface of the ware. One way to prevent this is to add barium carbonate to the recipe. Hence the addition of barium carbonate to one of the recipes above.\n\nBoth of the recipes above are for clay that is designed to be fired at around cone 1070C / 1958F.\n\nAs you can see, many potters are of the opinion that terracotta is low fire clay. But if that’s the case, why is some clay described by suppliers as being suitable for mid-fire temperatures.\n\nOne possibility is that these clay’s are really closer to being stoneware than earthenware clays. Some stoneware clay has a red terracotta look. In fact, there is a particular clay that is called terracotta stoneware. But on inspection, it’s clay that is described as being ‘terra cotta colored bisque’.\n\nEssentially, terracotta clay is a high iron content earthenware that fires at a lower temperature than stoneware and porcelain. Because of the high iron content, it is most often red-burning, but can also be formulated to fire at other colors. These include brown, pink, yellow, orange, and sometimes cream.\n\nTerracotta Ceramics\n\nThe term terracotta is also used to describe a variety of different ceramic products. I don’t normally quote Wikipedia , but I thought this was quite funny. “Terracotta: a term used for a rather random group of types of objects, rather than being defined by technique”. This seems just about right to me.\n\nOver the centuries, terracotta has been used to make many kinds of items. This range includes figurines, sculptures, architectural structures, tiles, planters and plant pots, and dinner ranges. It has a long history of being used which dates back to the Neolithic era.\n\nTerracotta sculpture by Aime-Jules Dalou , Peasant Woman Nursing a Baby (1873) The V&A Museum . Image by ThePotteryWheel\n\nAs stated above, fired terracotta clay is more porous than stoneware or porcelain. When ceramics are fired to ‘maturity’ it means that they have become as dense and strong as they can be. Mature stoneware and porcelain are impervious to water. By contrast, well-fired terracotta is still absorbent.\n\nMaking ceramics water-tight can be done in a few ways. One option is to coat the ceramics with glaze. Put simply, pottery glaze is finely ground glass particles suspended in water. It does also include other ingredients , let’s keep it simple for now.\n\nGlaze is usually applied to clay that has been fired once and turned into ceramic. The first firing is the bisque fire . The glazed bisque ware is then fired again. During the second firing, the glass in the glaze melts onto the surface of the pottery.\n\nWhen the glaze layer cools it forms a water-tight barrier, that prevents water absorption. Glazing is most often used to make terracotta dinnerware fit for purpose.\n\nSometimes the term terracotta is reserved for unglazed pottery made from terracotta clay. By contrast, glazed terracotta is often referred to as being ‘earthenware’.\n\nAlternative Ways to Seal Terracotta\n\nOf course, not all potters or sculptors want to glaze their terracotta ware. Most planters used to decorate outside space are left unglazed. But does that mean the terracotta is unprotected? Not really. Ceramic artists who make work to be installed outside need to think carefully about how to protect their pottery from the elements .\n\nFrost and freezing temperatures are the biggest threat to outdoor ceramics. This is a concern for potters who use porous clay. When water freezes it expands. If water is absorbed into ceramics and then freezes, it can crack the ware as it expands.\n\nOne way to address this issue is to reduce porosity. This can be done by either adding frit to the clay. As described above, this increases the amount of vitrification that occurs at lower earthenware temperatures.\n\nAlternatively, other ingredients can be added to the clay so that it can tolerate being fired at higher temperatures. Another solution is to apply a sealant to the fired terracotta.\n\nSilicone-based sealants used in the building trade can help. Sealants of this kind are injected into brickwork by builders to make the brick impermeable to water.\n\nApplying a coat to a porous sculpture can have the same effect. Rainwater will ball up and run off the sculpture, rather than being absorbed into the piece.\n\nFinal Thoughts\n\nIn short, terracotta made of clay that has a high iron content, and is fired at earthenware temperatures. The iron content accounts for the fact that it is red burning, meaning it turns red when it’s fired. It also contributes to the fact that it is a low-fire clay. But within this broad account of what goes into making terracotta, there is also lots of variety. There are different recipes, brands, and ways of glazing and firing terracotta."}, {"url": "https://artabys.com/whats-the-difference-between-terracotta-and-clay/", "page_content": "How are Terracotta and Clay different? Clay is a raw material, but terracotta is clay that has been molded and fired. Terracotta items are often composed of any kind of organic clay, but earthenware clay has the brown-orange hue associated with the term. Low-temperature firing produces a porous and permeable surface in terracotta items.\n\nWhat Is The Difference Between Clay And Terracotta?\n\nClay comes in a variety of colors, from white to grey to brown to deep red or orange, whereas terracotta has a unique red and orange tint. Clay is a natural substance containing hydro-aluminum silicate fine particulate matter and other minerals. Terracotta refers to a form of earthenware clay that is easily accessible and which has rich red and orange shades, pottery, or other articles produced with that clay.\n\nWhat is Clay?\n\nClay may have varied colors depending on the soil composition, from white to gray to brown, or orange, and the red-orange color of terracotta. The term clay is a generic phrase used to mean materials for three-dimensional object modeling and creation.\n\nClay can consist of natural components such as minerals, however, varieties of clay can also be constructed of man-made materials such as polymers. The most common varieties of organic clay are earthenware, stoneware, and kaolin.\n\nThere are variable degrees of plasticity in different clay formations. The capacity to stretch or bend is called plasticity. The more plastic a clay, the simpler it is to mold in many forms, i.e. Tone may change in colors from white to gray to brown to deep red or orange depending on the soil composition.\n\nVarious kinds of clay with various characteristics are available. Depending on their characteristics, they have varied purposes. The three common types of pottery are Earthenware, Stoneware, and Porcelain.\n\nClay Versus Terracotta Illustration\n\nEarthenware Clay\n\nEarthenware clay includes iron and other impurities, which allow optimal hardness to be achieved at low temperatures. It’s permeable, extremely plastic, and easy to use. Earthenware is usually formed on a pottery wheel then fired in a kiln to turn it into a glazed ceramic.\n\nEarthenware pots made from clay fired at low temperatures are porous and require heavy layers of glazing to be utilized for water storage. Earthenware clay pots are frequently produced from impure clays that contain rock and sand particles. Clay for earthenware pots is frequently collected from streams where it has settled and produced clay deposits. Temperatures of 1700 to 2100 degrees Fahrenheit are used to burn earthenware clay pots.\n\nStoneware Clay\n\nStoneware clay is generally grayish in its raw form. Usually, it is burned at high temperatures, changing its color to medium gray or brown. The clay is hard, thick, and stone-like after the burning. It is permeable and flexible.\n\nStoneware is a kind of clay that is fired between 2100 and 2300 degrees Fahrenheit at a medium temperature. Stoneware is the most common form of clay used to make tableware and cookware. Stoneware is constructed of strong, durable clay with few impurities, making it less porous than earthenware and hence suitable for storing liquids without leaking.\n\nPorcelain Clay\n\nPorcelain clay is a versatile clay that can make beautiful and fine art home products. Porcelain is burned at a much greater temperature than other clays (up to 2550 degrees Fahrenheit). The material becomes vitrified as a result of the firing. Stoneware is used to make tableware and is fired at temperatures ranging from 2100 to 2300 degrees Fahrenheit.\n\nAnother form of clay is porcelain, which is produced largely of pure kaolin or China clay. Porcelain clay has relatively few impurities and hardens at extremely high temperatures. Porcelain is a tough clay that may be easily shattered. The surface of porcelain becomes smooth and glossy after firing, thus reducing the need for glazing.\n\nClay pots can also be classified by the type of clay used to manufacture them. The distinction between purity and color is straightforward. Porcelain is a form of clay that is approximately 100 percent pure and is used to create high-end china and pots. Red, white, yellow, gray, and black clays can also be used to make pots.\n\nWhat is Terracotta?\n\nTerracotta (Latin terra cotta, terra-cotta pots) is an Italian word meaning ‘baked earth.’ Terracotta means baked earth in Italian. Terracotta is a low fire iron rich porous reddish fired products made in Italy Terracotta refers to the pottery formed of organic clay that is glazed or unglazed inside the kiln of a potter. Archeologists and historical artists refer to artifacts produced without the wheel of a potter as terracotta, such as sculpture or tile. The potter’s objects are known as pottery. Terracotta is also the fired clay color, which contains a significant quantity of iron oxide.\n\nTerracotta may refer to a kind of clay with deep red and orange colors that is easily accessible in which many items made using. Terracotta also refers to pottery and other organic clay products that are baked in a kiln. Some people also characterize any clay product with a reddish-orange tint by using the word terracotta. Terracotta pots are generally dark red, low fire red or yellowish-brown in color, whereas clay pots come in a variety of hues. Clay pots and pottery might be white, black, blue, green, or any other hue, but terracotta is always vivid red. The main difference between clay and terra cotta is color. Clay has a wider spectrum of colors than terracotta. In my opinion this make a big difference between the two clays.\n\nTerracotta clay is a reddish-orange clay that may be found almost anywhere. This color comes from the iron component, which interacts with air to produce various colors such as orange, red, yellow, and even pink. Terracotta is not, therefore, pure clay. Furthermore, terracotta is a porous clay that is easy to deal with. It comes in two varieties: glazed and unglazed. It may also be made waterproof with one layer of glaze. Most notably, terracotta is an earthenware material.\n\nA big advantage of Terracotta especially for potted pants is that Terracotta is very porous. The porosity comes into play due to the fact the earth-based medium allows air in to circulate within a pot. The air movement stimulates root growth and promotes healthy plants which in my opinion is a big advantage for potting plants in Terracotta. Now you know why you see so many Terracotta pots, right?\n\nEarthenware artwork, clay containers, water, and wastewater pipes, roofing tiles, and bricks are all examples of terracotta. Terracotta is either clay-based unglazed or glazed but regardless it very porous after firing. It has a lengthy and illustrious history all throughout the world.\n\nClay Versus Terracotta Summary\n\nClay Versus Terracotta\n\nTerracotta is clay that has been molded and fired. Low-temperature firing produces a porous and permeable surface in terracotta items. Terracotta items are composed of any kind of organic clay, but earthenware clay has the brown-orange hue associated with the term.\n\nCeramic Firing Techniques – Firing is the method for making ceramics that can endure a lot of pressure. Firing takes place in an oxygen-rich environment. When it comes to firing pottery, there are two primary methods. The use of kilns and open firing are the two methods. The crucial step in the ceramic process is firing. It’s the point at which clay transforms from clay to usable ceramic.\n\nClay is a natural substance containing hydro-aluminum silicate fine particulate matter and other minerals. Terracotta refers to a form of earthenware clay that has rich red and orange shades. Clay comes in a variety of colors, from white to grey to brown to deep red or orange.\n\nComparison of Key Differences Between Clay And Terracotta\n\nClay Characteristics\n\n1. Clay Composition\n\nContains particles of hydrous aluminum silicates and other materials.\n\n2. Clay Color\n\nHas many colors ranging from Gray, Brown to Deep Red and Orange.\n\n3. Clay Forms\n\nAvailable in many different forms like earthenware, stoneware, and porcelain.\n\nTerracotta Characteristics\n\n1. Terracotta Composition\n\nAn earthen clay is abundantly available and easily accessible with a heavy iron component. A very porous clay. Terracotta safe for food. did you know Martha Stewart bakes with terracotta? Manufacturers of pottery do not use lead in their clay however, even if trace levels of lead are present, it will not seep into your food unless it is very acidic, such as citrus.\n\nTerracotta tiles made of clay. A non-combustible alternative is terracotta clay tile. For Southwestern, or Spanish-style buildings, it’s a common choice. However, it does require some care for good fire protection, I’m particularly talking about the barrel-shaped tiles. This is due to gaps between the under-layment and the tile sheathing might occur.\n\n2. Terracotta Color\n\nRich Red-Orange color emanating from the high iron content.\n\n3. Terracotta Form\n\nMainly earthenware that cones in glazed or unglazed forms.\n\nDefinitions\n\nGroggy Clay\n\nGrog is ground-up clay that has been fired. Grog is available in a variety of particle sizes, ranging from fine to coarse. It’s used to keep clay bodies from shrinking. Grog in a clay body minimizes shrinkage and makes it less likely for a piece to shatter during drying and fire while hand-building.\n\nGrog, commonly known as firesand or chamotte, is a ceramics raw material. It contains a lot of silica and alumina. It’s usually sold as a powder or chippings, and it’s a key component of Coade stone.\n\nGrog is made up of 40 percent alumina, 30 percent silica, 4 percent maximum iron(III) oxide, and up to 2% calcium oxide and magnesium oxide combined.\n\nIt has a melting point of around 1,780 °C (3,240 °F). It has a boiling point of over 9,000 degrees Celsius (16,230 degrees Fahrenheit). Its maximal water absorption rate is 7%. Thermal conductivity is 0.8 W/(mK) at 100 °C and 1.0 W/(mK) at 1000 °C, with a thermal expansion coefficient of 5.2 mm/m.\n\nGrog is used to give pottery and sculpture a gritty, rustic feel known as “tooth,” as well as to prevent shrinkage and facilitate uniform drying. Cracking, crows feet patterning, and lamination are all prevented as a result of this. The coarse particles allow gases to escape by opening the green clay body. During shaping, grog improves structural strength to hand-built and thrown pottery, but it might reduce fired strength.\n\nThe tighter the clay bonds, the denser and stronger the burnt product. In the dry condition, the strength of grog down to the fineness of that passing through a 100-mesh sieve rises, but it decreases with material passing through a 200-mesh screen.\n\nQin Shi Huang Emperor of China – Terracotta Soldier\n\nOne of the Terracotta Army’s warriors (Terracotta Soldier), mold-made Ancient Chinese terracotta statues of Qin Shi Huang’s army, the first Emperor of China. Qin Shi Huang was the first emperor of a united China and the founder of the Qin dynasty. He was Zheng, King of Qin, from 247 to 221 BC. After the Qin destroyed all of the other Warring States and united all of China in 221 BC, he became China’s first emperor at the age of 38.\n\nTerracotta Soldier – One of the Terracotta Army’s warriors, mold-made Ancient Chinese terracotta statues of Qin Shi Huang’s army the first Emperor of China.\n\nNon-firing Clay\n\nNo Fire Clay (also known as Sunclay or self-hardening clay) is a non-toxic, soft and malleable modelling clay that air dries. It’s not to be confused with Kaolin clay, baked clay, ball clay, modeling clay or polymer clay. It is manufactured from natural components and may be manipulated with water and tools much like genuine clay. The No Fire Clay, like clay, must be manipulated with water to keep it wet. Self-hardening clay, also known as air-dried or non-firing clay, is a direct modeling medium that cures naturally without the need for mold creation or casting.\n\nBone China\n\nBone china is a porcelain kind made from bone ash, feldspathic material, and kaolin. It is described as “clear ware with a transparent body” that contains at least 30% phosphate generated from animal bone and calculated calcium phosphate. Bone china is the most durable of the porcelain or china ceramics, with extremely high mechanical and physical strength as well as chip resistance. It is also recognized for its high levels of whiteness and transparency. Because of its great strength, it may be made with narrower cross-sections than other porcelains. It’s vitrified like stoneware, but the mineral characteristics make it transparent.\n\nPopular Related Articles By Artabys\n\nReferences\n\nDahiya, S., Siwach, P., Panghal, A., & Sindhu, S. (2021). 11 Terracotta Pottery Catastrophe. Entrepreneurship and Big Data: The Digital Revolution, 153. https://books.google.com/books?hl=en&lr=&id=Atk9EAAAQBAJ&oi=fnd&pg=PA153&dq=Terracotta+pottery&ots=8jQ5kA1SeK&sig=RMT_pO4EyOiQ9PlelaXRAz2DXbc#v=onepage&q=Terracotta%20pottery&f=false\n\nMishra, S. P., & Mansuri, A. J. (2016). Problems of Indian red clay pottery (Terracotta) industries and policies for development. International Journal of Advanced Research in Management and Social Sciences, 5(11), 12-29. https://garph.co.uk/IJARMSS/Nov2016/2.pdf\n\nMazzocchin, G. A., Agnoli, F., & Colpo, I. (2003). Investigation of roman age pigments found on pottery fragments. Analytica Chimica Acta, 478(1), 147-161. sciencedirect.com/science/article/abs/pii/S0003267002014769"}, {"url": "https://www.archdaily.com/967605/terracotta-arts-ceramic-cladding-in-museums-and-cultural-centers", "page_content": "Few materials are as timeless, durable and beautiful as terracotta. With a range of inherent properties, terracotta is being specified to redefine building envelopes. Used for its many colors and textures, as well as its flexibility, this ceramic can be constructed as cladding, rain screens and a variety of components. Dating back to the Babylonians, terracotta has been used throughout history, and it continues to be a material selected for diverse building types around the world.\n\n+ 8\n\nBy definition, architectural terracotta refers to a fired mixture of clay and water that can be used in non-structural and structural capacities on the exterior or interior of a building. It was in the late 19th century the version with a ceramic glaze, called glazed architectural terracotta, became more popular. It's still often what's used most in contemporary practice. Today, terracotta is produced in many different shapes and styles to accommodate creative building envelopes and concepts. Each of the following projects reinterpret terracotta and its application in arts and cultural buildings. Together, they represent a snapshot of how the material is being used around the world in different cities, construction markets and climates.\n\nThe Wellin Museum is sited on a corner lot, across the road from the Art History department and across a gracious lawn from the future Theatre and Studio Arts Building. This collection of art buildings around a reconstructed pond, designed with Reed Hilderbrand Associates, created a new arts quad at Hamilton and helped develop visual and pedestrian connections between the two sides of campus. A richly textured, dark terracotta cladding of the central volume reinforces its key role in the program and composition.\n\nThe Municipal Library of Greve in Chianti, designed by mdu architetti, is located in the heart of the Chianti region, in the province of Florence, in Tuscany. The building is located at the entrance of the city in a former industrial area, near the Greve river. The architectural image of the Library can be summarized in two themes: the solidity of the plinth, made of travertine blocks and the lightness of the overhanging terracotta volume. The plinth seems heavy, solid, close, but its interior opens in a wide double-height entrance foyer.\n\nThe Diana Center establishes a new nexus for social, cultural, and intellectual life at Barnard College. From the historic entrance gate at Broadway, the wedge-shaped design frames a clear sightline linking the central campus at Lehman Lawn to the lower level historic core of the campus. Squarely centered in a campus defined by brick and terra cotta, the Diana translates the static opacity of masonry into a contemporary luminous and energy-efficient curtain wall. Within 1,154 panels of varying widths, gradients of color, opacity, and transparency are calibrated to the Diana Center’s diverse programs.\n\nLocated in the heart of Kenyon’s academic campus core, the Gallery Building was designed by GUND as a beacon for the arts. Building materials reinforce the established campus fabric and consist of locally acquired sandstone exterior, used extensively on campus, zinc metal panels, terracotta baguettes, and glass. It was made to be a design that celebrates, expands and complements the existing context.\n\nThe new Liberal Arts Building at the University of Texas at Austin is a multifunctional academic building for the largest college on campus with an annual enrollment of over 15,000 students. With departments previously scattered throughout campus, a new building was designed for the ongoing success of the College. Full-height terracotta panels provide vertical solar shading to adjacent glazing. The terracotta rainscreen relates to historical terracotta used by other campus buildings, with a color that matches the limestone also found throughout campus.\n\nThe John and Mable Ringling Museum of Art is the legacy of circus entrepreneur and art collector John Ringling and his wife, Mable. The Museum—which features both a permanent collection and temporary exhibition galleries—sits on a historic sixty-six acre estate. The addition’s façade is composed of deep-green, glazed terra cotta tiles that address the client’s requirement of a new monumental entrance. The façade relates to the natural environment of the Museum’s extensive landscape, and its color and chiseled profile are reminiscent of the Cà d’Zan mansion’s ceramic detailing.\n\nDedicated to the work of the legendary French fashion designer, the Musée Yves Saint Laurent Marrakech (mYSLm) opened its doors in autumn 2017. The building has been designed by the French architecture firm Studio KO. Built of terracotta, concrete and an earthen colored terrazzo with Moroccan stone fragments, the building blends harmoniously with its surroundings. The terracotta bricks that embellish the facade are made from Moroccan earth and produced by a local supplier. The terrazzo used for the floor and facade is made using a combination of local stone and marble."}, {"url": "https://www.ceramices.com/ceramics/", "page_content": "We are living in the ceramics world, but we didn’t think about it deeply. Who would have thought that something most of us perceived as ‘old-fashioned’ would be something that has formed an integral part of our lives? Every day, you wake up to the buzz of the alarm clock, dash into the bathroom to have a bath, get dressed, and ultimately, drive in your car. Yet, you forget that all these items are made of Ceramics.\n\nCeramics have been around for quite a long time, that we often forget how useful it is and how pervasive it has come to be. The world is now a ceramic-sphere, where a ceramic item aids almost all we do. However, regardless of how essential ceramics are to us, we often know how to define them or explain what they indeed are. It’s apparent that they encompass a lot, but what exactly are ceramics?\n\nWhat is ceramic?\n\nIf we begin to ponder on the concept of ceramics, we could get confused because of how broad the concept is. This is why we often try to define ceramics based on its examples or classification. If we define ceramic based on what it comprises, we would have a simple but insufficient definition because Ceramics itself is extensive.\n\nNonetheless, here is a straightforward definition of ceramics based on what it consists of. Ceramics can be defined as solids that encompass pottery, glasses, porcelain, tiles, bricks, diamonds, cement, and graphite.\n\nFrom a chemical perspective, we can define ceramics as mineral, nonmetallic solid materials that are not acquired from organic, metallic, and carbon compounds. These inorganic and nonmetallic solids usually undergo a series of transformations which include, firing or heating, painting or glazing, and other physical or chemical transformations before the result is obtained.\n\nEtymologically, the word ‘ceramics’ is gotten from the Greek word “Keramikos” meaning “of pottery.” This is the reason why some people regard only pottery plates as ceramic, which is incorrect.\n\nHowever, it is pertinent to note that although pottery materials were only regarded as Ceramics in those days, other chemical or electrical items now have ceramics attached to them. It proves that ceramics’ notion has shifted gradually over the years, and ceramics have developed to be durable and reliable in electrical, regular, or chemical materials that pervade our everyday life.\n\nWhat are Ceramics made of?\n\nCeramics are made of inorganic and nonmetallic solids (nonmetallic compounds). However, the basic component of ceramic is clay. The clay properties in ceramics are what give rise to terracotta, earthenware, porcelain, and stoneware. However, recently, most advanced ceramics are made of carbon, sulfur, metallic elements, and nitrogen.\n\nIn relation to the properties and overall structure of ceramics, this chemical composition gives ceramic its typical crystalline or glassy look and feel. The recent advancement of ceramics has, however, proven to negate some of its earliest believed composition.\n\nFor example, ceramics, which were thought to comprise only inorganic materials or solids, have moved towards an organic path (bone china is an excellent example of a ceramic with organic material or component).\n\nTraditional ceramics usually comprise clay materials, feldspar, quartz, kaolinite, whereas the significant constituents of modern (advanced) ceramics are Silicon dioxide (SiO2), Aluminium Oxide (AI2O3), among others.\n\nCeramic History\n\nThe emergence of ceramics can initially be traced to 28000 BCE, when about a hundred figurines were found in Czechoslovakia near a kiln shaped like a horseshoe. Archeologists have also stated that a statuette called Venus of Dolní Vêstonice was found in this same area.\n\nThis statuette of a nude woman, Venus of Dolní Vêstonice, is regarded as the first ceramic artifact in the world. Also, in this period, the ceramic figurines had some ceremonial importance or significance.\n\nSubsequently, pottery became man’s next invention. The first pottery item or material was found in Eastern Asia years after Venus of Dolní Vêstonice and the other figurines were found. Several pot fragments, whose invention was estimated to be between 18,000 and 17,000 BCE, were found in China; in the Xianrendong cave. With the appearance of Chinese pottery, Japanese and Russians grew interested in pottery, and it spread to the Eastern part of Asia in 14,000 BCE.\n\n9,000 BCE to 1,500 BCE\n\nThe Neolithic epoch experienced a significant increase in the utilization of ceramics because of the sudden shift towards agriculture. In 9,000 BCE, the most common ceramics items made were water pots, bricks, and containers for food. During this era, the use of ceramics spread to Europe and the Middle East.\n\nAlso, during this period, the sun and the dug-out kiln were used in drying or firing the ceramics items. The temperature for firing the ceramic products in the kilns was below 1000°C and the main decorative pattern was geometric or linear.\n\nThe epoch between 7,000 BCE and 5,000 BCE marked the emergence of glass. In 7,000 BCE, people began to make sharp tools with volcanic glasses. Also, in 5,000 BCE, a man called Pliny asserted that the first glass was made by merchants from Phoenicia. However, archaeologists have not found anything that proves Pliny’s assertion.\n\nThe only proof of glass making in the world was traced to 3,500 BCE, where simple glass items like beads were produced in Egypt and Mesopotamia. However, the establishment of glassware factories started around 1,500 BCE in Egypt. Also, another significant invention that happened at about the same time as the discovery of glass items in Egypt, was the invention of the pottery wheel in 3,500 BCE.\n\nThe Common Era\n\nFast forward to the 16th century CE, the use of ceramics has completely spread out to several parts of the world. The industrial revolution during this time led to the invention of refractories. The refractories developed paved a way for the advancement of the ceramic industry. This advancement, however, gave rise to the emergence of more admirable properties of ceramics. For example, it was during this period that Ceramics became known to have a high melting point and low thermal conductivity.\n\nIn 1850, the first porcelain electrical insulator was developed as a result of the creation of the ceramic telegraph insulator. This groundbreaking innovation marked the beginning of the technical ceramics (engineering ceramics) era. After this period, the production and application of ceramics in different aspects of technology became more glaring.\n\nIn the 1960s, yttria-based ceramic was first invented. Some other things were also discovered or invented and spread out within and after this period. These innovations include ceramic high-temperature superconductors, bioglass, nanotechnology, polycrystalline neodymium-yttrium aluminum garnets, hyper-elastic bone, and alumina insulators.\n\nEven with all these developments, the ceramic industry keeps developing, but its origin or history is dated back to the time when figurines and the Venus of Dolní Vêstonice were found in Czechoslovakia.\n\nTypes of Ceramics\n\nThere are several types of ceramics and they are all used to make man’s life better. The following are popular types of ceramics.\n\n● Earthenware\n\nThis is the first ceramic that was produced by man. It dates back to 29,000 BC and was created with a fire pit. Earthenware is made with clay but is not heated as much as porcelain. Thus, it does not have the usual translucent look that porcelain and other glassy ceramics have. Since earthenwares aren’t heated to the point of vitrification, they are opaque and porous.\n\nProperties of Earthenware\n\nThey are usually not expensive.\n\nThey require less time to produce.\n\nThey are usually in brown, red, and orange colors.\n\nTo be watertight, they must be glazed.\n\n● Porcelain\n\nPorcelain is an old type of ceramics that first started in China in the era of the Shang dynasty. This type of ceramic is white and made from kaolin (a clay mineral), which is heated at a very high temperature (1,200-1,400°C) in an oven (kiln). Porcelain is usually translucent and was reputable back then as an expensive item, which only the wealthy could possess. However, porcelain is still used in making exceptional decorative tableware and other expensive items.\n\nProperties of Porcelain\n\nPorcelain meshes up beautifully with glazes.\n\nIt is strong and durable.\n\nIt is usually resistant to heat and chemicals.\n\n● Stoneware\n\nThe stoneware is a ceramic that is heated at a temperature that exceeds the earthenware but is below the porcelain. It is made from stoneware clay and is both nonporous and watertight. This type of ceramic is popularly known to be vitreous or semi-vitreous, and although it shares similar properties with porcelain, it is not as white and as glassy as the former is.\n\nProperties of Stoneware\n\nStoneware is less porous than earthenware.\n\nIt is more opaque than porcelain.\n\nIt is resistant to chemicals.\n\n● Bone China\n\nBone china is a type of porcelain that originated from East London. It was first produced by Thomas Fyre in 1748. This ceramic has bone ash as its main constituent and is often considered the safest tableware. The bone china was produced exclusively in the UK for about 150 years until the mid-twentieth century when Japan decided to venture into the market. However, one of its major distinctions from other ceramics is that it is a negation to the definition of ceramic as “inorganic.”\n\nProperties of Bone China\n\nIt is whiter, more durable, and more translucent than porcelain.\n\nIt is made from bone ash, quartz, kaolin, and feldspar.\n\nIt is chip-resistant.\n\nThe amount of bone ash included determines the quality of bone china.\n\nIt has high mechanical and physical strength.\n\n● Fired Bricks\n\nFired bricks are usually burned in an oven (kiln). They are made from heating inorganic materials, which makes them durable, brittle, and capable of withstanding high temperatures.\n\nProperties of Fired Bricks\n\nThey are chemical resistant.\n\nThey vary in size.\n\nTheir attributes vary depending on the composition and producer.\n\nWater absorption.\n\nThey have compressive strength.\n\n● Titanium Carbide\n\nThis black ceramic is heat resistant and firm; it is a refractory ceramic and is usually used in producing wear-resistant items.\n\nProperties of Titanium Carbide\n\nIt is resistant to wear.\n\nThermal conductivity.\n\n● Glass Ceramics\n\nGlass-ceramics are usually produced through a rigorous procedure of controlled crystallization. The end product is usually desirable and has high mechanical strength.\n\nProperties of Glass Ceramics\n\nIt has high chemical durability.\n\nIt has low thermal expansion.\n\nOther Types of Ceramics\n\n● Carbon.\n\n● Silicon Carbide.\n\n● Silicon.\n\n● Tungsten Carbide.\n\n● Boron Carbide.\n\n● Barium Titanate\n\n● Bioceramic.\n\nUses of Ceramics\n\nCeramics have been useful to man right from the outset. Its usefulness can easily be summarized with how the figurines found in Czechoslovakia, even when they were both new and strange at the same time, were instrumental in certain ceremonial functions. Initially, the glassware factory in Egypt was made to produce glasses for the storage of oils and ointments.\n\nMan has always sought a way to make things better and easier, and obviously, ceramics have helped in doing just that. However, with modernity and civilization, came a more diverse use or function of ceramic items. So, here are some uses of ceramics in the modern world that have helped make things better.\n\n● Ceramics are used in making bricks.\n\n● Ceramics are used in making wristwatches.\n\n● Ceramics are used in making kitchenware.\n\n● Ceramics are used in making cement.\n\n● They have been used over the years to produce camera lenses.\n\n● Ceramics have been used in making dental items e.g the artificial teeth.\n\n● Ceramics are used in making tiles.\n\n● Ceramics are used to produce flower vases and pots.\n\n● Ceramics are used in making electronic devices.\n\n● They are used in producing toilets and sanitary.\n\nCeramic Products\n\nThe widespread use of ceramics in the world has triggered the invention of more ceramic products. There are so many products we use that we don’t or may not even know are made of ceramics. Now, let’s take a quick dive into some of these ceramic products.\n\n● Tiles\n\nTiles have become an inevitable interior and exterior decorative item for everyone. These beautiful flat-surfaced-looking items are made from ceramics, which typically means that their main constituent is clay. They are glazed to give them that enchanting look and they are often unglazed when they are produced for roofing purposes. The forms and structure of tiles are detected by their purpose. This is why tiles are grouped into two types; the common and encaustic tiles.\n\nCommon tiles are the most popular types of tiles we see around. They are simple and used for flooring, roofing, and paving. Conversely, the encaustic tiles are the ones that are mainly produced for decorative purposes. These tiles can be found on the walls of a building. The encaustic tiles are also made from regular clay and more attention is paid to detail; the color, size, design, and overall structure of the tile.\n\n● Stoneware\n\nAll ceramic products that are produced by combining refractory clay, pottery, and stone fall into this category of products. Examples of this product include the Dome-shaped Yixing ware teapot, Wedgwood Jasperware vase, etc. In the making of stoneware ceramic products, the mixture of stone, pottery, and refractory clay is burnt at an extremely high temperature before it is glazed. Stonewares are resistant to atmospheric conditions, water, and chemicals like acid. Most stoneware ceramic products include jars, sewer pipes, toilets, basins, etc.\n\n● Terracotta\n\nRemember the little disk or bear you add to your hardened brown sugar to soften it? That’s terracotta! This absorbent pottery, terracotta, is made of clay and glazed with a ceramic glaze that contains lead glance (galena). They are typically soft and can even be scratched by a knife.\n\nTerracotta as a ceramic product is used in making statues, utensils, other kitchenware, tiles, storage items (e.g., terracotta disk), bricks, and flower pots. They are useful because they possess some unique benefits or advantages: durability, ability to be easily cleaned, mouldability, resistance to atmospheric conditions and acid, inexpensive nature, and availability in a variety of colors.\n\n● Porcelain\n\nAs you have already read in the ceramics section, porcelain is a translucent white and thin ceramic. Over the years, porcelain products have become indispensable. Porcelain is used to make tiles, sinks, plates, statuettes, figurines, porcelain jackets, and dolls.\n\n● Clay\n\nThe principal constituent of every ceramic is clay. It is found in every ceramic product. It is used in the production of several things, including tiles, tiles, bricks, toilets, terracotta, and other types of ceramics (porcelain, stoneware, earthenware, etc.).\n\nExamples of Ceramics\n\nCeramics can be found in every area of our lives. It is not difficult to find a ceramic material because it is an essential part of man’s life and has helped simplify so many tasks and the production of valuable items. Nonetheless, here are some examples of ceramics in our everyday life.\n\n● Toilets\n\n● Brick or Cement Houses\n\n● Flower Vases\n\n● Artificial teeth.\n\n● Computer chips.\n\n● Artificial bones.\n\n● Bathroom tiles\n\n● Floor tiles\n\n● Mugs\n\n● Plates\n\n● Wristwatches\n\n● Mobile phones.\n\n● Alarm clock.\n\n● Cars\n\n● Spaceship\n\n● Cookware\n\n● Statuettes\n\n● Picture frame.\n\n● Light bulb.\n\n● Decorative pottery.\n\n● Concrete tennis court.\n\n● Roof tiles.\n\n● Sport items.\n\nProperties of Ceramics\n\nFrom the properties of different types of ceramics, the main properties of ceramics are deducible. However, here are some other main features of ceramics that distinguish them from other materials.\n\n● They are refractory\n\nCeramics are capable of undergoing different sorts of abuses (firing and others) to get shaped into something beautiful.\n\n● They have high melting points\n\nThis proves that ceramics are heat resistant.\n\n● They are chemical resistant\n\nCeramics are usually chemical resistant because of the ionic bond found in them.\n\n● They are hard\n\nCeramics are usually hard because of all the processes used in producing them. Think of the firing process, which is one reason why ceramics are known to be hard.\n\n● They are usually scratch-proof\n\nCeramics are regarded as scratch-proof or scratch-resistant because they don’t show signs of scratch due to their elasticity in terms of cracking.\n\n● They are durable\n\nCeramics are known to be durable owing to their molecular structure.\n\n● They are brittle\n\nCeramics, regardless of how hard they may be, are prone to shattering. This is why ceramic breaks when it falls to the ground. This brittle tendency is caused by the unevenly distributed pores, which make ceramics lighter and easily broken. The basic law for this is, ‘the bigger the pores, the more prone it is to breaking.’\n\n● Ceramics have high compressive strength.\n\nThey have high compressive strength because of the strong binding in ion and covalent bondings.\n\n● They are wear-resistant\n\nIn ceramics, almost every good attribute is attributed to the bonding; this is also evident here as they are wear-resistant because of the bonding force.\n\n● They have low thermal shock resistance.\n\nThe bindings in ceramics do not constitute free electrons. This is why they have low thermal conductivity.\n\nApplication of Ceramics\n\nCeramics are used in several industries in the world. The most common application of ceramics has been in the area of chemical engineering, electrical engineering, and mechanical engineering. However, apart from these, ceramics have been used in medicine, dentistry, food and chemical enterprises, aerospace, packaging science, mining, and many others. Here is a quick dive into how ceramics have been applied in some of these industries.\n\n● Aerospace Industry\n\nIn the aerospace industry, ceramics have been applied in the making of exhaust and engines. Ceramics that are capable of withstanding high temperatures are also applied in the making of turbine components. They have also been applied in the making of brakes, radiators, compact optical components, and armors for helicopters.\n\n● Medicine\n\nCeramics have been applied in medicine for the production of bone fillers and femoral heads for hip replacement. It has also aided the invention of pacemakers and respirators. In medicine, ceramics are generally applied for bone defects, bone augmentation, and for producing blood pumps.\n\n● Food Industry\n\nCeramics have been instrumental in the production of knives, beverage dispensers, kneading rollers, kitchenware (dishes and utensils), and some conveyor tools. They are applied in the food processing industry because they are food-safe.\n\n● Electrical and Electronics Engineering\n\nAdvanced ceramics helped this particular industry in so many ways. Most of the things we have today were produced as a result of the fascinating application of ceramics in the area of electrical and electronic engineering. Some great innovations include spark plugs, smartphones, capacitors, piezoelectric devices, inductors, magnets, resistors, and so many others.\n\n● Textile Industry\n\nThe application of ceramic items in the textile industry has led to the production of quality thread and fabrics. In the textile industry, oxide ceramic is the true focus.\n\n● Power Engineering\n\nThe application of ceramics in the power engineering industry is owing to the wear-resistant nature of ceramics. In this industry, monolithic ceramic materials are used to ensure that there is a standard power generation, power transport, and power storage.\n\n● Paper Technology\n\nCeramic materials are used in papermaking and processing because they are resistant to abrasion.\n\n● Optics\n\nOwing to ceramics’ translucent look, it has been applied in the photography industry for the production of camera lenses and other lenses.\n\n● Lifestyle and Leisure\n\nThe Venus of Dolní Vêstonice after it was discovered became relevant for ceremonial functions. Also, the invention of ceramics jewelry, wristwatches, cosmetics, and board games shows how ceramics have helped in the area of lifestyle and leisure.\n\n● Military Engineering\n\nCeramics have helped in the making of military ammunition and uniforms.\n\nClassification of ceramics\n\nCeramics can only be classified on the grounds of their overall makeup or composition. They can however be grouped into four categories. So, here is a classification of ceramics based on their structure.\n\n● Non-oxide ceramics\n\nThis class of ceramics is used in making cutting tools, valves, pharmaceuticals, seals, and abrasives because of its ability to withstand wear and corrosion as well as other thermal shock problems. Non-oxide ceramics (SSiC, SiSiC, Si3N4) consist of nitrides, silicides, carbides, borides, as well as other chemical compounds.\n\n● Oxide ceramics\n\nOxide ceramics contain inorganic compounds of some metalloid and metallic elements like zirconia, aluminum, silica, alumina, magnesia, silicate, among others. This class of ceramic is loved for its numerous unique attributes. These features include; high chemical resistance, broad electrical features, and the porosity of the protective coating. Oxide ceramics are used in foundry and metal processing, radiofrequency, and chemical processing, among others.\n\n● Glass-ceramics\n\nMany people consider glass very distinct from ceramics because while ceramics are translucent and sometimes opaque, glass is usually amorphous. However, here comes the combination of these rather distinct solids to provide a unique solid that shares unique features of ceramics and the entire processing method of glass. Glass-ceramics, which was first invented in Corning Glass Works, are polycrystalline because they are produced through a controlled crystallization method.\n\nHowever, glass ceramics are grouped into seven types which include; mica apatite glass-ceramic, Lithium Disilicate glass-ceramic, mica glass-ceramic, apatite-containing glass-ceramic, leucite glass-ceramic, leucite apatite glass-ceramic, and ZrO2-containing glass-ceramic.\n\nThe overall chemical composition of glass-ceramics is the same as glass, only that glasses are 95-98% translucent. Also, the different visual properties of the glass-ceramics and the high impact resistance make it even more appealing.\n\n● Silicate ceramics\n\nSilicate ceramics chiefly comprises silicon and oxygen. They were very instrumental in the making of early electrical technologies. Silicate ceramics are mainly reliant on magnesium silicate or aluminosilicate.\n\nHow do you Make Ceramics?\n\nMaking ceramics is an exciting activity for anyone. You might be thinking of making your ceramic item after reading much about the historical development of ceramics, but may not know just how to go about it. You might also be wondering if you could make ceramics at home. So, here is the interesting thing about ceramics.\n\nOne amazing thing about Ceramics is that you can make them from the comfort of your home as long as you have the required materials. But what happens when you decide to make your pottery work at home and all by yourself? Here is the right way to go about making your handmade ceramic.\n\nRolling and the Pottery Wheel\n\nThe first thing you have to do is take and roll out your clay while ensuring that it is evened out and all chunks are rightly dissolved. It is important to note that reducing or trimming your ceramic is easier than adding to it because it could ruin the shape of your work. Next, ensure that you get the desired height or width that you want. This is solely determined by what you intend to make.\n\nAfter that, you can begin molding it into whatever you intend to make. This can be done by pinching, slabbing, or coiling. Another good way of molding your ceramics can be done through the pottery wheel. But with this method, you will need to understand how the pottery wheel works and know how to use it with the clay you are working with.\n\nIf you are using the pottery wheel, ensure that you place the clay down on the dry wheel. Make sure that the clay is planted to the wheel, and if the clay seems hard, try to add little water while kneading or shaping.\n\nDecorating and Drying\n\nOnce your clay has been molded into your desired result or item, you may decide to decorate it. Your ceramic ware can be decorated with stamps, imprints, pottery tools, and stencils to give it that pop look. After this, you can move to the drying process.\n\nFor this, you can make use of the kiln, or if you don’t have one, you must explore other options, including oven baking or air drying. For oven baking, you have to stick to the instructions as regards pre-heating and drying. You also have to ensure that you place the ceramic on a tray before putting it into the oven, then leave the ceramic in there for the required amount of time. Once you get the ceramic out, check how hard it is. Conversely, if you are air drying, ensure to place your work in a secure place and leave it to dry (this usually takes days or a week to dry).\n\nPainting and Glazing\n\nAfter your ceramic must have dried out, you will have to paint it. There are numerous paints available depending on what type of clay you used or how your ceramicware was dried. If you air dried your ware, it is recommended to utilize acrylic paints.\n\nAlso, here are some other paints available for ceramics; chalk paints and mica powder, acrylic paint, spray paints, ceramic paint, colored markers, colorants, and crayons. Always ensure to get the one that best suits your project (the type of clay you are working with and how your ware was dried).\n\nFinally, you can apply the glaze to your pottery to make it durable and food-safe. This gives it its glassy look, and ultimately, coats your work. It is essential to use sandpaper to get any rough clay out of it before applying the glaze.\n\nAfter that, your work is ready because not all glazes require firing after application. But if you still need to fire or heat your ceramic for the glaze to stay and for the vitreousness to be evident, ensure you set the temperature according to the needs of your ware because when set at an extremely high temperature, the glaze could melt and it would ruin your work.\n\nConversely, when the temperature isn’t high enough, your ware may not dry properly. So, it is important to follow the instructions or requirements regarding your project.\n\nMaterials Needed to Make Ceramics\n\nCeramics are beautiful and very useful in different aspects of our everyday life, so it is only necessary that you develop an interest in them. If you would like to make ceramics a hobby or a new-found profession or business, you will first of all need to know what materials are required for making ceramics. So, for beginners, here are some useful materials that are instrumental to the success of your ceramic project.\n\n● Clay\n\nIn all ceramic-related projects, clay is always the key ‘ingredient’ or material in making ceramics. Now, here comes the tricky part; as a beginner, the type of clay you decide to use for your project goes a long way in determining how the ceramic would turn out.\n\nSo, if you are a newbie in the ceramic business or art, you should opt for stoneware clay as they are smooth, easy to work with, and most importantly, don’t hurt the hands. Nonetheless, when opting for any clay for your ceramic project, always make sure you lookout for the texture, clay type, price, cone size, and color.\n\n● Ceramic glazes\n\nCeramic glazes are basically what you use in painting your ceramic to give it a more beautiful and vitreous feel after it has been fired. The main importance of glazes is that they make ceramics resistant to stain and safe for food.\n\nHowever, as with clay, there are certain things to look out for when buying glazes. There are several types of glazes available, but when purchasing ceramic glazes for your project, ensure to check if they are gloss, transparent, opaque, breaking, or matte. These will determine how your ceramic ware would turn out after it has been fired.\n\n● Pottery wheel\n\nGetting a pottery wheel isn’t compulsory, but it is necessary because it helps you molding your clay evenly. It helps you in ensuring that all sides are equal and all edges are evenly curved. But if you decide to mold and shape your clay with your hands because of how expensive getting a pottery wheel maybe, that is fine. However, if you are making ceramics as a business, you need professionality, which is guaranteed by the pottery wheel.\n\n● Kiln\n\nPurchasing a kiln can be quite expensive. This is highly recommended for everyone who ventures into ceramic making either as a business or hobby. The kiln is used in firing your already molded work to ensure that your work is durable. It also keeps the glaze intact to produce the vitreous look that is typical of every ceramic.\n\n● Potter’s needle\n\nYou need a potter’s needle to carefully trim the top surfaces of your clay while molding or shaping clay on the pottery wheel.\n\n● A Towel\n\nYou need a towel while doing your pottery work to ensure that you wipe your hands when the need arises. It also helps to prevent you from getting stained from the clay.\n\n● A wooden trimming tool\n\nYou need some modeling tools to help you in removing excess clay from your molded work.\n\n● A bamboo brush\n\nBrushes are the major tools used in applying glazes. However, they are also used for decorative purposes. A large soft Sumi or bamboo brush will be fantastic for your ceramic project.\n\n● Apron\n\nAprons are meant to protect you and your clothes from getting clay all over you while throwing.\n\n● Sponge\n\nIn every ceramic or pottery project, you will have to wipe the surfaces of the clay to remove any additional splash of clay from your work.\n\nCeramics FAQs\n\n● Is ceramic stronger than steel?\n\nCeramics are generally stronger than steel. A ceramic wristwatch, for example, is said to be four times stronger than stainless steel.\n\n● Is ceramic breakable?\n\nAlthough ceramics are hard and durable, they are prone to breaking. So, yes, ceramics are breakable, and the unevenly distributed pores cause this in them.\n\n● Is ceramic scratch resistant?\n\nCeramic is scratch-resistant because it always retains its original translucent look. This leaves it always looking new and resistant to scratch unless it falls to the ground and cracks or breaks.\n\n● Why is ceramic so expensive?\n\nCeramics are expensive to acquire (that is why the Ru Guanyao brush washer was sold for $37.7 million), but it all depends on what type of ceramic you want. Also, if you decided to venture into the world of ceramics as a hobbyist, you will have to get prepared to buy a kiln, clay, and other materials. The essential thing to note here is that although the raw materials used in making ceramics are easily affordable, the making process is quite expensive. This is where all the money goes in.\n\n● Is ceramic harder than titanium?\n\nTitanium, one of the strongest metals in the world, is harder than ceramics because ceramics are generally brittle. When a ceramic breaks as a result of its brittle nature, titanium remains hard in its initial state, which makes it harder and more durable than ceramics."}, {"url": "https://www.thesprucecrafts.com/all-about-terracotta-4152002", "page_content": "We're all familiar with terracotta—it's an easily accessible clay that comes in rich colors of red and orange—but what are some of the more distinct qualities that have led it to be so popular widely used over time?\n\nHistory\n\nThe word terracotta originates quite literally from the Italian translation \"baked earth\" and its use across the globe has a prominent place in history (and continues to be vastly used today).\n\nOne of its earliest reference points was in prehistoric art, with some of the oldest pottery of time being found as far back as 24,000 BC. Interestingly, these early pieces were found to be Palaeolithic terracotta figurines, rather than cooking vessels, as you might expect, demonstrating how widely terracotta has been used in the art. Perhaps, terracotta’s most famous use in art was China’s Terracotta Army, which is a magnificent collection of terracotta figures of over 8,000 soldiers and 520 horses. It was found in the First Emperor of China, Emperor Qin Shi Huang’s mausoleum (246 to 208 BCE, but not discovered until 1974 by local Chinese farmers). Terracotta is widely preferred for sculpture, given its thick and malleable texture and eases to be molded. It’s a far easier material to work with than say marble or bronze. Terracotta also has a close link to architecture, most commonly in roof tiles and brickwork, as it’s incredibly durable, beautiful in color and one of the cheapest clays to work with.\n\nIt's also a material with a lowered fire risk in buildings. Terracotta is also very commonly used to make flowerpots and highly decorative dinnerware plates.\n\nProperties\n\nTerracotta is one of the most distinct types of clay you’ll find, given its rich, rust red/orange coloring. The reason for this distinct color is that the iron content in terracotta’s clay body reacts with oxygen and gives it a hue that ranges through reds, oranges, yellows, and even pinks.\n\nThe properties of terracotta are that it’s a porous clay to work with, and it can also be used glazed and unglazed, which adds to its appeal. One coat of glaze is needed to make it waterproof. When terracotta is glazed, bright colors are often favored because they work brilliantly with terracotta’s low-firing temperature (approximately 1100 C/2012 F to 1200 C/2192 F to create a striking contrast with its orange body). These low firing temperatures also mean lower energy costs. In some cases, terracotta has been fired as low as 600 degrees Celsius. Majolica ware can be created with terracotta by bisque-firing the terracotta pieces and painting them with an opaque white glaze and firing them again. Sometimes, nothing more than a clear glaze needs to be used on terracotta to enhance its natural fired color and give it a great shine.\n\nPrimitive pieces of terracotta were just left to harden and bake in the hot sun, while later pieces (before kilns) were fired in the ashes of open fires. Another great property that terracotta has is that it can withstand varied temperature changes with a lower chance of cracking, making it incredibly functional.\n\nWhere to Find It\n\nOne of the biggest reasons that terracotta is so prevalent in history across so many genres is that it can be found anywhere and is known as being the most commonly found clay across every continent. Terracotta is usually not a pure clay and is found mixed with other minerals full of flux and plenty of iron oxide.\n\nFamous Pieces\n\nVisiting China to see the Terracotta Army for any potter is a once-in-a-lifetime experience. Located 23 miles from Xian City, it’s the largest imperial tomb in the country, covers a vast 558 acres and has been granted UNESCO World Heritage Site status.\n\nThe Victoria and Albert Museum in London also has some brilliant examples, including a Pierre Merard bust. Then the Vienna Natural History Museum is home to the reported oldest surviving piece of work in the ceramic world dating back to 26,000 BCE; a figurine called The Venus of Dolni Vestonice, which was found in the Czech Republic.\n\nIn terms of architecture, the Bel Edison Telephone Building in Birmingham is a fantastic grade example of Victorian terracotta."}, {"url": "https://www.ehow.com/info_12036719_process-making-terra-cotta.html", "page_content": "Although known for its distinctive reddish-brown color, terra cotta can be dyed.\n\nTerra cotta, also commonly spelled terracotta, is a building material created from clay. This material has been used in architecture and building for thousands of years. Terra cotta has become widely utilized because when compared to other building materials, it is cheap and easy to to shape; it is essentially just a clay product fired under specific techniques.\n\nAdvertisement\n\nClay\n\nTerra cotta is made from clay. However, different types of terra cotta have different names based on where the product is made. This is partly because clay harvested from the ground in any particular region will have a slightly different makeup than clay found elsewhere. However, wherever the terra cotta is made, the first step is finding suitable clay deposits and harvesting the clay from the ground.\n\nVideo of the Day\n\nRefining\n\nThe raw clay needs to be refined before it is made into terra cotta pots, tiles or other products. This process involves drying the clay and then screening and filtering it to remove impurities that affect the consistency, color and other properties of the clay. Depending on the purity of the clay pit from which the material is removed, raw clay has foreign matter, minerals, rocks and other items that need to be removed during this process.\n\nAdvertisement\n\nMolding\n\nOnce it has been refined, terra cotta clay is often pressed into molds. Roofing tiles, flooring tiles and architectural embellishments are just a few of the mold types that are used for terra cotta in building material applications. The clay is firmly pressed into the mold so that it takes on the shape before firing.\n\nAdvertisement\n\nFiring\n\nOnce the terra cotta has been pressed into the appropriate shape, it needs to be fired in order to cook and harden. Terra cotta falls into the category of low fire clay. This means that you must fire it at a lower temperature than many other clays or it will melt. This can damage the kiln as well as ruin the work. Normally, terra cotta is fired at a temperature between 2,048 and 2,079 degrees Fahrenheit."}], "Clay timpani has a shallow, bowl-like shape.": [{"url": "https://wtt.pauken.org/chapter-3/the-bowl", "page_content": "The function of the bowl in the acoustical performance of timpani has been a subject of contention and a matter of intense debate among scientists and musicians for many years (Rayliegh 1879; Richardson 1929; Kirby 1930; Wood 1962; Taylor 1964; Benade 1976; Rossing et al. 1982), and both musicians and scientists have advanced plausible theories without any real scientific justification (Wood 1962; Taylor 1964).42 The misinformation and misconceptions are still being promulgated by many performers and educators in texts, lexicons and method books today (Taylor 1964; Peters 1993; Leonard 2000; Beck 2013).43 44 45 46\n\nErroneous information about bowl shape and the\n\npath of the sound-wave by English timpanist Henry W. Taylor 43\n\nThere still remains a general belief among many timpanists that the shape of the bowl directs the path of the sound waves affecting the tonal characteristics of the drum. The shape of the bowl contributes to the harmonicity and color of the pitch only with respect to how the geometry of the bowl determines the volume of air the bowl can contain. Numerous scientific studies conducted by Thomas D. Rossing et al., as well as Helmut Fleischer, Hugo Fastl and associates have proven that the actual shape of a timpano bowl is quite unimportant in determining its intrinsic sound. As long as the volume of air enclosed inside of the bowl is kept in the correct range for the diameter and mass of the head, cambered, hemispheric or parabolic shaped bowls, which have the same volume, will have the same effect with respect to how the drum produces its pitch. The correct volume of air for the diameter and tension/mass of the head helps to suppress the inharmonic fundamental (and its associated modes of vibration) allowing the more harmonic (pitch producing) modes to be heard. The volume of air enclosed in the bowl also acts as a restoring force trying to return the head to a stationary position. This enclosed volume of air has resonances of its own that can interact with modes of the vibrating membrane that have similar shapes. The size and shape of the bowl simply determine its volume. This volume of air and the motion of its associate resonant air modes help to fine tune the upper partials.\n\nAnother popular misconception about timpani is that the bowls serve as sound chambers or acoustic air cavity resonating chambers (Helmholtz resonator) like the body of a guitar or violin or a marimba resonator, which resonate or amplify the sound. They do not. Since the volume of air enclosed with in the bowl remains the same over the entire range of the drum, any true acoustic resonance would be limited to only a small range of the instrument; in fact, the frequencies of the various modes of enclosed air are much higher than that of the actual principal tone of the vibrating membrane so any acoustic resonance would affect the higher (less audible) partials only (Rossing).\n\nThe bowl is however, a very important system modifier. The primary function of a timpano bowl is to act as a baffled radiator, separating the top of the head from the bottom of the head so that the radiated energy from the top and bottom surfaces cannot interact and cancel each other. The presence of the bowl turns the drum into a monopole source. Low frequencies from a monopole source radiate well in all directions. The radiation of the low frequency sound energy gives the impression that the bowl is amplifying or resonating the sound, hence the popular misconception that the bowl is resonating the sound of the vibrating head.\n\n\n\nModal radiation pattern mode 2,1 with a baffle 39\n\nIt is true that mechanical resonances from the bowl and frame exist, but they have been shown to not enhance the pitch to any significant degree (Fleischer & Fastl). If they do, it is completely serendipitous. In fact, these unintended hyper-resonances have been shown, more often than not, to actually detract from the sustain of the preferred modes. Be that as it may, one cannot deny the timpanist the pleasure of indulging in the beauty of sound produced by the various and sundry vibrations of his or her own instruments, no matter what they hear vibrating. It all adds to the mystique of the instrument.\n\nThe following chapters investigate popular beliefs and misconceptions about timpani bowls.\n\n<<Previous – Next>>"}, {"url": "https://wtt.pauken.org/chapter-3/the-bowl/sound-radiation", "page_content": "When asked the question, “does the bowl shape contribute to the sound timpani produce?” most timpanists will give you a definitive YES! Bowl shapes and bowl materials are hotly contested issues among timpanists. Entire schools of playing have evolved around bowl shapes and general timpani design. Generations of timpanists have been taught to believe that the bowl shape has a profound influence on the path of the sound-wave on the inside of the drum.\n\nErroneous information about bowl shape and the\n\npath of the sound-wave by English timpanist Henry W. Taylor 43\n\nBut, what are the scientific facts? Recent studies (see Significant Studies) have concluded that the harmonic sound spectra of timpani rely weakly on the shape of the bowl and does so only with respect to how the geometry of the bowl determines the volume of air the bowl can contain.\n\nHowever, there are timpanists that desire a sound that is not based completely on the harmonicity of the pitch the drum can create. They are interested in producing a colored sound that will project and be more percussive or drum like by nature, rather than pitch centered. A sound that will have enough of an edge to be heard in a large orchestra, yet without too much distortion of the pitch. A sound that will actually add some harmonic distortion to the music. Can the bowl shape help achieve this or these desired characteristics due to other factors?\n\nThe primary focus of the significant scientific studies has been on how the bowl contributes to the harmonicity of the preferred modes, and not on the overall envelope of the timpani sound, especially the first few hundred milliseconds of the envelope known as the attack. Timpani have a wide dynamic range and the color varies dramatically depending on the actual amplitude of the sound. Consequently, timpani sound spectra change significantly as dynamic levels vary. Potential vibrations from the bowl and frame can be a desired trait, and an integral part of this color change. They do not contribute constructively to the pitch of the instrument, but they do have the potential to color the sound of the attack portion of the envelope, or when the head is in a steady state of motion at high dB levels. Even when one is in close proximity to the instrument, it is debatable whether this collateral color is actually heard due to its low dB level compared to that of the vibrating head. It should however, not be overlooked when discussing timpani sound.\n\nWhen timpanists talk about “the sound” of the bowl shapes, the aural differences they hear are based on:\n\n1) how the frequencies of the internal air modes (determined by the volume of the internal air mass) interact with the vibrational modes of the head\n\n2) the viscothermal characteristics (viscosity and thermal conduction) of the volume of the air mass enclosed in the bowl\n\n3) the amount of mechanical energy loss through the bowl walls\n\n4) how efficient the bowl is as a thermal conductor\n\n5) potentially, how well the bowl itself is free and able to vibrate (thickness/mass) which is determined by #3\n\nFigure 3r simulates the first ten milliseconds of vibration of mode (1,1) as the pressure inside of the bowl jumps across the nodal boundary. In as much as the bowl itself is vibratory, this can/will set into motion specific resonant frequencies of the bowl, which (if strong enough) will contribute to the spectrum and can have some effect on the color of the sound for up to 500 milliseconds.\n\nFig. 3r\n\nSimulation of pressure jump across boundary during first 10 ms 26\n\nThe motion of the volume of air (subject to air density), which is trapped inside of the bowl can cause the bowl to vibrate to a small degree (<1 dB) producing inharmonic partials. These inharmonic partials can become an integral participant in the color of the attack.Fleischer and Fast The attack transients of an instrument’s sound is crucial in determining its personality or character. Attack transients are essentially patterns of noise, which accompany the spectrum of a sound when it is being initiated. The brain primarily uses the attack transients of the envelope to identify an instrument. The attack transients of timpani spectra can vary widely. The bowl and frame play a subtle, but integral part in determining the attack transients of a timpano’s sound.\n\nBowl vibrations are also transmitted to the frame, which in turn can contribute audible inharmonic partials as well. This added hyper-resonance is also heard when the bowl and frame are vibratory while playing at loud dynamics, e.g., a sustained fortissimo passage or an extended fortissimo roll. Since these partials are inharmonic, and are not generated by the vibrating membrane, they are referred to as collateral color or parasitic pitch. More often than not, this collateral color or parasitic pitch degrades the harmonicity of the pitch producing partials, and shortens the sustain of the preferred modes of vibrating head.\n\nThe significant studies have shown that the sound being emitted from a timpano is a result of the bowl functioning as a baffled radiator, the volume and density of the air contained within the bowl interacting with the vibrations of the head, and not the shape, or the vibrations of the bowl or frame at all. The studies have focused on those partials in the spectrum which provide the instrument’s sound with a sense of harmonicity and not necessarily with the overall sound of the instrument. This concept of overall timpani sound varies from timpanist to timpanist just as the overall sound of timpani varies from drum to drum. None the less, each timpanist has his/her own personal preferences as to what constitutes color in timpani sound.\n\nIn the material contained in the pages below, the concept of timpani sound is based on the harmonicity of a select group of partials in the overall spectrum of audible partials. This select group is referred to as the preferred modes.\n\nPages: 1 2"}, {"url": "https://wtt.pauken.org/chapter-3/the-bowl/bowl-volume", "page_content": "The density/viscothermal characteristics (viscosity, thermal conduction) of the volume of air enclosed within the bowl plays a critical role in the fine-tuning of the spectrum of each note on a timpano. The density/viscothermal characteristics determine how easily this internal air can be displaced by the motion of the vibrating head affecting how it interacts with the various modes of vibration of the head. The density/viscothermal characteristics of the internal air also affects how quickly the bowl volume can be normalized (i.e. equal to that of the external air mass above the head) via expulsion/induction of air through the vent at the bottom of the drum. Bowl material is a factor here as well. See Why Copper?\n\nThis volume of air also has its own modes of vibration, which can interact with the modes of vibration of the head, reinforcing and canceling the various modes. It is in fact the volume of air in the bowl that helps damp the actual fundamental of the drum so that pitch can be discerned by the listener (see Fleisher & Fastl). Too little air volume and it is easy to overplay the drum creating destructive hyper-resonances within the frequency range of the preferred modes.\n\nThe Rogers Accusonic timpani (1970s) were notorious for having this trait. The shallow bowl limited the volume of air that the bowl could contain for the extended range (1 octave) of the drum, limiting the usable dynamic range to somewhere between pianissimo and poco forte. Anything above that and the sound became distorted. In defense of the Rogers Accusonic, they were designed for use in the American elementary and middle school market, not for use with a full sized symphony orchestra.\n\nToo much air and certain notes within the normal range of the drum suffer from a degraded clarity or pitch focus due to the lack of damping of the inharmonic fundamental and the secondary concentric modes, as well as the potential for exacerbated inharmonicity of the higher preferred modes (4,1 5,1, 6,1).\n\nThe four main areas of influence of the volume of air contained within the bowl are:\n\n1) Mitigating the inharmonic fundamental and its associated modes so that the partials of the more harmonic modes can predominate.\n\n2) Reinforcing the partials of the head’s near-harmonic modes with similar resonant air modes inside the bowl.\n\n3) Excessive motion at higher db levels causing the generation of hyper-resonances modifying the natural frequencies of the head adding coloration/distortion to the sound; this brings the stiffness to shear of the membrane into play , which when the drum is played at higher dynamic levels, raises the frequencies of the upper preferred modes.\n\n4) Limiting or enhancing the motion of the concentric air modes, which acts as a restoring force (like a spring) to return the head to a neutral position. This affects head sustain and resonance of the diametric modes.\n\nUnfortunately, when the first two influences are strong, so is influence No. 3, hence the reason that no uniform bowl shape has ever come into vogue.\n\nIf a bowl has too much air volume, there is:\n\n1) Not enough mitigation of the inharmonic partials for certain notes.\n\n2) The potential for causing exacerbated inharmonicity of the higher preferred modes (4,1 5,1, 6,1) at soft dynamic levels (unaffected by the stiffness to shear of the membrane).\n\n3) weakened reinforcement of the near-harmonic partials by the air modes, which result in less clarity, immediacy and harmonicity of the pitch for certain notes.\n\nThe drum may have considerable sustain and resonance, is easy to play, and can be played loudly without significant distortion, but for certain notes within the playing range of the drum, the response and projection of the pitch (i.e., clarity, immediacy and harmonicity) is noticeably diminished at softer dynamics.\n\nIf a bowl has too little air volume:\n\n1) Excessive air movement causes hyper-resonances (the drum is easy to overplay).\n\n2) The clarity of the preferred modes is compromised at loud dynamic levels (affected by the stiffness to shear of the membrane).\n\n3) The drum can have a smaller dynamic voice with limited sustain/resonance.\n\nWith too little air volume, the inharmonic fundamental may be significantly damped and the resonant air modes may interact with those of the head producing better immediacy and harmonicity of the pitch, but at louder dynamic levels (usually anything above forte), the excessive air movement interferes with the natural vibrations of the head adding hyper-resonances (unwanted coloration/distortion) to the sound waves emitted from the top of the head; the result is a drum with less power and a limited dynamic voice.\n\nOne might expect that venting a bowl with a smaller volume would alleviate the excessive air movement, but the vent-hole affects mostly the concentric modes, which have little influence on the pitch producing modes. Too much damping of the concentric modes in turn brings influence No. 4 into play, which can affect the sustain, resonance and feel/response of the head.\n\nAdding to the mix of variables is the fact that ideally, this finite volume of air in the bowl should react the same for each pitch associated with the size and range of the drum, which will also be affected by the size, mass and tension of the head as well as the density/viscothermal characteristics of the surrounding air. Such a Goldilocks Zone cannot not exist with the design of modern variable pitched timpani. Is a design update needed?"}, {"url": "https://hub.yamaha.com/drums/percussion/timpani-bowl-construction/", "page_content": "There are many types of timpani, each with various types of pedals and different types of bowls and bowl materials. Options can be numerous, and needs will vary by the requirements of the ensemble. In this article, we’ll discuss the unique manufacturing process that Yamaha uses when making timpani bowls.\n\nThe Importance of the Timpani Bowl\n\nWhen it comes to the construction of a timpano, the bowl has the greatest impact on sound. The type of material and the shape and thickness of the bowl all play a considerable role. An instrument that is musically consistent from one size to another allows the band director to focus on teaching, and when it is easy to discern pitch, students are better able to learn proper timpani tuning.\n\nChoosing the Bowl Material\n\nThe first step in the bowl manufacturing process is choosing the right material. Yamaha makes five different models of timpani, utilizing two different bowl materials: copper and aluminum. Only high-grade copper (1.5 mm thick) and aluminum (3 mm thick) are used.\n\nAluminum has sonic properties that are very close to copper; it’s also recyclable and is a better alternative to fiberglass, another common bowl material. In addition, aluminum can be repaired if it is damaged, while fiberglass cannot.\n\nCutting and Spinning\n\nNext up is cutting and spinning the material. A special machine takes a large square sheet of copper or aluminum and spins it very slowly to a specific size, depending on the ultimate size of the bowl. It’s important to ensure that density and consistency is maintained as the material is spun into shape.\n\nAn arm connects to the flat sheet and slowly pushes it around a steel mold. These molds vary in size, depending upon the size of the timpano. The spinning process ensures that the metal consistency is even throughout the entire shape of the bowl, so the sound can resonate freely. In addition, the bowls have no seams, which can interrupt and interfere with the sound waves traveling inside.\n\nAnnealing\n\nDuring the spinning process, the bowl must be annealed. This is a heat treatment that alters the physical properties of a material to increase its ductility and reduce its hardness, making it more pliable. This process involves heating a material above its recrystallization temperature, maintaining a suitable temperature for an appropriate amount of time, and then cooling it. Copper needs to be annealed many times in order to reshape it and maintain a constant thickness throughout the bowl. This level of detail leads to greater tuning accuracy and more consistent quality of sound.\n\nSanding, Polishing and Hammering\n\nAfter the bowls are spun, they get a sanding and a polish to clean them up inside and out.\n\nOn YTP-7300 and TP-8300 Series timpani, a hammering process follows. This makes the material denser and gives the timpano a darker tone, helping to hide the fundamental pitch and focusing the third overtone, so it sounds clearly — an important part of the sound of a timpani. Yamaha TP-8300R Series timpani have close to 30,000 hits on each bowl.\n\nDegreasing, Lacquering and Baking\n\nThe bowl is then washed in a four-step degreasing process — a series of four baths to ensure it is clean before the lacquering process. This is important so the finish adheres correctly. The bowl is then set aside to dry for a short period of time.\n\nOnce completely dry, each bowl is given a light coat of clear lacquer. This imparts a shiny exterior finish that will pop visually on any stage.\n\nA large oven is then used to bake each bowl up to 300 degrees. This ensures that the lacquer is completely dry and hardened before moving on to assembly with the frame and timpano head.\n\nFinal Assembly\n\nDuring assembly, the bowl is placed into a frame where it is freely suspended by a suspension ring. This limitation on pressure allows the bowl to resonate to its fullest potential. Just as in brass instruments, a heavy frame promotes more resonance. Yamaha frames are comprised of heavy die-cast aluminum, which minimizes vibration transfer, allowing the timpano to project even more.\n\nLastly, each timpano is put through a final inspection. This is when the drum is tuned to the expected range. The head is adjusted a few times each day to ensure that it’s seated properly, and the pedal is engaged multiple times so that it works smoothly. Every Yamaha timpano is played and thoroughly tested prior to being shipped. This way, it’s ready to go, right out of the box.\n\nThe innovation you find in Yamaha timpani is a combination of skilled craftspeople, high-quality raw materials, and the latest in manufacturing techniques and technology, borne from years of research and development. From the symphony hall to the band room, the football field to the recording studio, there is a set of Yamaha timpani for every application.\n\nAlso check out these related blog articles:\n\nA Brief History of Yamaha Timpani\n\nAnatomy of Timpani\n\nBuying New Timpani? Here’s What You Need to Know\n\nHow to Change Timpani Drum Heads\n\nTimpani Maintenance\n\nCaution! Are You Moving Your Timpani Correctly?\n\nClick here for more information about Yamaha timpani."}, {"url": "https://www.orsymphony.org/learning-community/instruments/percussion/", "page_content": "The percussion family is the largest in the orchestra. Percussion instruments include any instrument that makes a sound when it is hit, shaken, or scraped. It's not easy to be a percussionist because it takes a lot of practice to hit an instrument with the right amount of strength, in the right place and at the right time. Some percussion instruments are tuned and can sound different notes, like the xylophone, timpani or piano, and some are untuned with no definite pitch, like the bass drum, cymbals or castanets. Percussion instruments keep the rhythm, make special sounds and add excitement and color. Unlike most of the other players in the orchestra, a percussionist will usually play many different instruments in one piece of music. The most common percussion instruments in the orchestra include the timpani, xylophone, cymbals, triangle, snare drum, bass drum, tambourine, maracas, gongs, chimes, celesta, and piano.\n\nLearn more about each percussion instrument:\n\nPiano • Other Percussion Instruments\n\nOther instrument families:\n\nStrings • Woodwinds • Brass\n\nPiano\n\nPeople disagree about whether the piano is a percussion or a string instrument. You play it by hitting its 88 black and white keys with your fingers, which suggests it belongs in the percussion family. However, the keys lift hammers inside the piano that strike strings (indeed, the piano has more strings than any other string instrument), which produce its distinctive sound. Which family do you think it belongs to? Wherever it fits in, there's no disputing the fact that the piano has the largest range of any instrument in the orchestra. It is a tuned instrument, and you can play many notes at once using both your hands. Within the orchestra the piano usually supports the harmony, but it has another role as a solo instrument (an instrument that plays by itself), playing both melody and harmony.\n\nOther Percussion Instruments\n\nTimpani\n\nTimpani look like big polished bowls or upside-down teakettles, which is why they're also called kettledrums. They are big copper pots with drumheads made of calfskin or plastic stretched over their tops. Timpani are tuned instruments, which means they can play different notes. The timpanist changes the pitch by stretching or loosening the drumheads, which are attached to a foot pedal. Timpani are a central part of the percussion family because they support rhythm, melody and harmony. Most orchestras have four timpani of different sizes and tuned to different pitches and they are usually played by one musician, who hits the drumheads with felt-tipped mallets or wooden sticks. The timpani player must have a very good ear because he/she usually needs to change the pitches of the drums during performances.\n\nXylophone\n\nThe xylophone originally came from Africa and Asia, but has a Greek name that means \"wood sound.\" The modern xylophone has wooden bars or keys arranged like the keys of the piano, which the player hits with a mallet. You can change the quality of the pitch by using different kinds of mallets (hard or soft), and by hitting the wooden bars in different ways. Attached to the bottom of the wooden bars are metal tubes called resonators, where the sound vibrates. This gives the xylophone its bright bell-like sound.\n\nThere are several other instruments similar to the xylophone, which are also part of the percussion family. They include the marimba, a larger version of a xylophone with wood or plastic resonators attached to the bottom of the wooden keys, which give it a mellower, more rounded sound, and the vibraphone (known as vibes), which has both metal bars and metal resonators, with small rotating disks inside. The disks are attached to a rod, which is turned by an electric motor. When you play a sustained note on the vibes and the motor is running, the disks create vibrato, or a wiggly pitch. In addition, percussionists often play a glockenspiel (pronounced GLOCK-en-shpeel), which is a miniature xylophone with metal bars instead of wood. The percussionist uses hard mallets to play the glockenspiel, which sounds like clear tinkling bells.\n\nCymbals\n\nCymbals are the biggest noisemakers of the orchestra. They are two large metal discs, usually made of spun bronze. Cymbals, which are untuned, come in a range of sizes, from quite small to very large. The larger the cymbal, the lower the sound they make. Cymbals can be used for drama and excitement, to accent the rhythm or create delicate sound effects. You can play the cymbals either by hitting one cymbal against the other, or you can use sticks, mallets or brushes to hit one or both cymbals.\n\nTriangle\n\nYou've probably played a triangle yourself at one time or another. It's a small metal bar that's bent into the shape of a triangle and makes a ringing sound when you hit it. There are many sizes of triangles and each one sounds a different pitch. You play the triangle by holding it on a string and striking it with a metal beater. The size and thickness of the beater can change the sound the triangle makes.\n\nSnare Drum\n\nThe snare drum is a smallish drum made of wood or brass with drumheads made of calfskin or plastic stretched over both ends of a hollow cylinder. It has a set of wire-wrapped strings stretched across the bottom head (the snare), which give the snare drum its unique \"rattling\" sound when the drum is hit. A small switch on the side of the drum allows the player to turn the snare on or off depending on the requirements of the piece. The snare drum is an untuned drum, so it doesn't sound distinct pitches. It is often used in military music and is a central part of any marching band. Snare drums are used to keep the rhythm and make special sounds, such as drumrolls. You play the snare drum by hitting the top with drumsticks, mallets or brushes.\n\nBass Drum\n\nThe bass drum, like the double bass, is the biggest member of the percussion family and therefore makes the lowest sounds. The bass drum is built like a very large snare drum, although without the snare; it is also an untuned instrument. You play the bass drum by hitting either drumhead with sticks that have large soft heads, often covered with sheepskin or felt. It can produce a lot of different sounds from roaring thunder to the softest whispers.\n\nTambourine\n\nHave you played one of these? A tambourine is a small drum with metal jingles set into the edges. Both the drumhead and the jingles are untuned. To play it, you hold it in one hand and tap, shake or hit it, usually against your other hand.\n\nMaracas\n\nMaracas come from Mexico. They are rattles, often made from gourds (a kind of squash), filled with dried seeds, beads or even tiny ball bearings that make them rattle. Maracas can also be made of wood or plastic; the sound they make depends on what they're made of. To play them, you hold them in your hands and shake.\n\nGong\n\nThe gong, also known as the tamtam, is a very large metal plate that hangs suspended from a metal pipe. It looks similar to a cymbal and is also untuned, but is much larger and has a raised center. To play it, you hit the center with a soft mallet. Depending on how hard you hit it, you can make a deafening crash or the softest flicker of sound.\n\nChimes\n\nChimes are metal tubes of different lengths that are hung from a metal frame. When you strike the tubes with a mallet, they sound like the ringing bells of a church. Each chime sounds a different pitch.\n\nCastanets\n\nThese fun wooden instruments come from Spain and are used to punctuate the music with a distinctive clickety-clack. Castanets are made of two pieces of wood tied together. To play them, you hold them with your fingers and click the two pieces of wood together. In the orchestra, castanets are sometimes mounted on a piece of wood, and the percussionist plays them by hitting them with his/her hands.\n\nCelesta\n\nThe celesta looks like a tiny upright piano and sounds a lot like the glockenspiel with its delicate bell-like tone. Celestas usually have a keyboard of 49–65 keys. As with the piano, you make sound on the celesta by pressing down on a key with your finger, which lifts a hammer inside and strikes a metal bar. You can play many notes at once using both your hands."}, {"url": "https://hellomusictheory.com/learn/facts-about-the-timpani/", "page_content": "By Robert Jackson\n\nTimpani are those large semi-spherical drums that look like big shiny bowls or upside-down tea-kettles—which is why they’re also called kettledrums.\n\nA classical percussion section would never be complete without timpani. They’re important both in classical orchestras and musical ensembles, including concert, marching, and even rock and roll bands.\n\nThe sound of timpani can be energetic and thunderous, as well as smooth and velvety, which is why they’re considered extremely versatile.\n\nTo help acquaint you with this fascinating percussive instrument, here are 20 interesting facts about the timpani.\n\n1. The Timpani is a Pitched Percussion Instrument\n\nModern pedal timpani can be instantly tuned through a movable foot pedal to adjust the tension of the head as well as the pitch.\n\nAlthough convenient, that could still pose a challenge during a concert, since it’ll require the timpanist to have a perfect ear to keep the instrument in key with the rest of the ensemble.\n\nTuning a chain timpani, which is much less common nowadays, is even more difficult since they don’t have pedals.\n\nInstead, they have a roller chain and a crank.\n\n2. The Timpani Were Initially Military Drums\n\nArabian Naqqara\n\nTimpani started as military drums.\n\nTheir use dates back to the 13th century when they were introduced to Europe by crusaders who brought similar but much smaller Arabian Naqqara.\n\nBefore timpani came to be a staple instrument in the classical orchestra by the last third of the 18th century, they were used in military ceremonies throughout Europe until the 16th century.\n\nThey were even used during the American Civil war where they were played by musicians on horseback.\n\nIn the late 19th century, modern machine timpani were developed for easier adjustment of drumhead tension.\n\n3. The Timpani Has a Wide Range of Sounds\n\nTimpani produce a wide dynamic range of sounds.\n\nTheir various sounds could best be described as dull, thunderous, rumbling, booming, deep, heavy, powerful, round, mellow, velvety, substantial, resonant, dry, or hollow.\n\nThe timbre of the timpani is affected by what the mallets are made of, where the head is struck, and how hard it’s struck.\n\nThe purest tone is produced from the middle of a timpani drum.\n\n4. Timpani Belong to the Percussion Family\n\nThe percussion family is the largest in the orchestra, and timpani are a central part of it because they support rhythm, add melody and color, and enhance harmony.\n\nThe timpani, along with the xylophone and piano, are percussion instruments that are tuned and can sound different notes.\n\nThe bass drums, cymbals, and castanets are examples of untuned percussion instruments with no definite pitch.\n\n5. Timpani Have a Wide Pitch Range\n\nEach timpano (the singular or timpani) has a tonal range of about an interval of a sixth, with the pitch of the lower note dependant on its size.\n\nIn a four-timpani set, the range of pitch of the four drums can therefore span around 3 octaves!\n\n6. Timpani Are Traditionally Made of Copper\n\nTimpani sets today come in a host of materials, including fiber-reinforced plastic and aluminum.\n\nHowever, the traditional copper remains the best material for the bowl since it keeps the timpani in tune more effectively, and resists temperature changes.\n\nCopper also has properties that allow it to easily stretch and shape, and allows sound to resonate deeply.\n\n7. Animal Skins are Preferred for Timpani Heads\n\nTypically, timpani heads used to cover the bowl are made of calfskin or goatskin.\n\nAlthough costly, professional timpanists prefer these skins for the warmer quality of sound they produce.\n\nHeads are also often made of plastic, which is more durable, more affordable, and less affected by temperature and humidity than animal skin.\n\n8. There Are Two Styles of Timpani Placement\n\nIn German-speaking countries, including Germany and Austria, large timpani are usually placed at the right side of the timpanist with smaller timpani to the left, increasing the pitch from right to left.\n\nInternationally, especially in Japan, the direction of the timpani is reversed so that the pitch increases from left to right, similar to a piano keyboard.\n\n9. Timpanists Are Very Well Paid\n\nTimpanists are some of the highest-earning musicians in the music industry.\n\nTheir role is central in an orchestra, and there are few of them due to the difficulty of the instrument.\n\nOf course, the more skilled and experienced a timpanist is, the higher their earning potential, especially in performing arts companies or professional symphonies.\n\nIn the US, it’s reported that the median salary for a timpanist is just under $50,000 a year with some paid well over $100k a year too!\n\n10. Timpani are Very Expensive Instruments\n\nBuying a quality set of timpani could cost you. Prices vary depending on factors like brand, size, and material.\n\nA timpani set can take up to two years to build and could cost an average of $12,000-$17,000.\n\nThat’s why it’s important to be careful while moving them around to avoid costly damages.\n\n11. Timpani Are Heavy\n\nTimpani are among the largest and heaviest musical instruments.\n\nA single timpani drum can weigh up to 140 lbs…\n\nMultiply that by 4 or 5 for a whole set, and you’ve got a challenge on your hands.\n\nTransporting these drums can be difficult and it’ll give you a good workout.\n\n12. There Are Many Different Styles of Timpani\n\nTimpani come in various shapes and sizes.\n\nThere’s a cambered type with a flat bottom like a pot, and a parabolic type that’s nearly hemispherical.\n\nGenerally, the smaller the drums, the higher the pitches.\n\nThe timbre is also decided by where the drum head is stricken.\n\n13. Different Timpani Mallets Give Different Sounds\n\nThere are different categories of mallets used for striking the timpani, including hard, medium-hard, soft, flannel, and wood.\n\nEach kind is used according to the sheet music to express different sounds.\n\nThey come in various sizes, weights, coverings, and lengths of handles.\n\nThe mallet tip is often made out of felt, flannel, or cork, with a bamboo or wood handle.\n\nFelt ball mallets result in a soft attack, while wood balls produce a sharp attack and greater volume.\n\nMany professional musicians prefer to make their own mallets to customize them according to their needs.\n\n14. There Are Different Grips For The Timpani Mallet\n\nTwo common grips for the timpani mallet are the German grip and the French grip.\n\nIn the German grip, the palm is almost parallel with the drum head with the thumb on the side of the mallet.\n\nIn the French grip, the palm is almost perpendicular with the drum head and the thumb is on top of the mallet.\n\nThe American grip is a combination of both.\n\n15. Timpani Go Into All Kinds of Contemporary Music\n\nMusic created by timpani has a lengthy repertoire; it has invaded many rock and roll bands, as well as pop music.\n\nFrom the Beach Boys, Queen, The Beatles, and Emerson, to Led Zeppelin, timpani have taken pride of place in the 60s-70s pop-rock music.\n\nThey’re also featured in electronic music!\n\nSounds created by the timpani are versatile, and stand out in any music style or genre.\n\n16. Playing the Timpani Can Be Tricky But Fun\n\nPlaying the timpani might seem easy—the rhythms are simple, and you often play only a couple of notes—but in reality, there’s so much technique involved.\n\nYou need a very strong musical ear to successfully tune and play your timpani.\n\nYou also need to know how to maintain your drums and mallets to ensure a longer lifespan for them.\n\nOnce you get the hang of it, playing the timpani is so much fun.\n\n17. Playing the Timpani Requires Sensitivity Over Strength\n\nIt’s often thought that playing a large musical instrument like the timpani requires a lot of physical strength, but that’s not true.\n\nIn fact, a large volume of sound can be given through the drum reverberations, using only a little amount of force.\n\nAll you need is to create vibration as naturally as you can.\n\nIt actually takes a lot of sensitivity to create soft sounds and maintain a steady tempo.\n\n18. The Largest Timpani in the World is in Bali\n\nThe largest timpani in the world is in Bali.\n\nAt 73 inches in tall and 63 inches in diameter, the Moon of Pejeng is an ancient kettledrum that is thought to date back to 300 BC.\n\nIt has a story attached to it too, with a Balinese legend claiming that this drum was one of the wheels of a chariot on which they pulled the moon through sky until it fell to earth.\n\nWrap-Up\n\nAs you can see, a timpanist’s job isn’t an easy one.\n\nWhile playing the timpani isn’t easy at first, it sure is fun when you get the hang of it.\n\nWe hope the 20 facts we’ve shared in this post have inspired you to delve deeper into the world of percussive instruments and enjoy some fascinating timpani solos and ensembles."}, {"url": "https://wtt.pauken.org/hammered-vs-spun", "page_content": "Bowl Shaping: Hammered vs. Spun/Form-molding\n\n\n\nEssential to the art of the traditional artisan timpano bowl is to take multiple pieces of soft rolled sheet copper (usually two pieces – bottom/walls) of the same thickness, connect them together and then work harden/hammer them into a shape that has an overall homogeneous hardness and thickness. This is not an exact science so slight variations do occur, especially in the seams, consequently each bowl will have its own personality and character. The more thick, homogeneous and work-hardened the copper, the more likely it will not take energy away from the vibrating head. This type of bowl also tends to have a high and consistent thermal mass.\n\nIf the hammered copper is thin enough, the separate pieces (including the seams), can have their own patterns of vibrations that can produce resonant frequencies. The result (in as much as the bowl is allowed to vibrate) is a system that can vibrate evenly yet produce a small amount of colorful overtones (<1 dB) adding to the percussive attack (collateral color). This type of bowl, however, does take energy away from the vibrating head and has a low, yet consistent thermal mass. (see Fleisher & Fastl)\n\nAs timpani began to be mass produced the mid-twentieth century spun/form-molded copper bowls (Ludwig, Slingerland, Premiere etc.) generally were made from a single piece of soft copper. The spinning/molding process tended to stretch the copper, which usually resulted in a bowl with a thicker bottom and thinner walls. Bowls made in this fashion do not have as much of a homogeneous thickness, hardness or as consistent a thermal mass. When compared to a traditional artisan timpano bowl, the result is a system that:\n\n1) unevenly absorbs/deflects mechanical energy generated by the displacement of the internal air\n\n2) does not maintain a consistent thermal equilibrium of the internal/external air masses (thermal mass)\n\n3) does not sustain potential colorful vibrations as well\n\nAll of these factors influence the overall production of timpani tone/sound (timbre) to a small extent.\n\nConsequently, the mid-twentieth century, commercially mass-produced spun/form-molded bowl is generally not able to generate as much collateral color, provided it is allowed to do so, or adhere to the preferred physical/thermal characteristics of traditional homogeneous hand-hammered copper timpani bowls. The cosmetic hammering of a traditional spun bowl does not necessarily contribute to a homogeneous thickness or hardness as much as it does on a bowl made from multiple pieces of rolled sheet copper of the same thickness. Cosmetic hammering on the older commercially mass produced spun bowl is more likely to add to the aesthetic value of the instrument, rather than to its acoustic value.\n\nHowever, due to the overwhelming desire for hand-hammered copper bowls (how much of this is media/market generated is curious), some modern timpani manufacturers e.g., Adams, Yamaha and Majestic do have bowl forming processes that purport to maintain a uniform thickness without stretching the copper. These bowls are then uniformly machine hammered to harden them. Adams offers a 1.1 mm hammering on their higher-end bowls. The Majestic Grand Classic timpani are offered with three hammered finishes (coarse, standard or fine). Jaap Ruisch of the Majestic corporation states: “Our hammering is a precise computerized process, which will harden the copper. Because during the process the kettle will fully be supported it will prevent widening the kettle. The finer the hammering, the harder the copper will become and will make sound more open and bright.”52\n\n\n\nMajestic Standard Hammering\n\n\n\n\n\nMajestic Fine Hammering\n\n\n\nAdams Generation II Series Hammering\n\n\n\nYamaha 7300 Series Hammering\n\n\n\nTraditional hand-hammered Ringer bowls\n\nIs a copper bowl an important ingredient in the production of timpani tone? Yes, but not for the reasons most people are led to believe. Contrary to popular timpani culture, energy output from the vibrating bowl (and frame) doesn’t add all that much to the actual sound output of the instrument. In the frequency range of the preferred modes (65 Hz- 520 Hz), at most, it is less than one percent (1%) in terms of actual output level. Most of the SPL energy output (<1dB) from the bowl/frame occurs in the 1K -2K level, which adds a small amount of collateral color to the sound, but it doesn’t support the preferred modes. However, this output should not be completely disregarded because it can help define the overall timbre of the timpani; it just doesn’t influence the actual pitch of the instrument.\n\nOne of the important things that the makeup of the bowl material does influence is the amount of mechanical energy loss through the bowl walls. (Fleisher & Fastl) Whether hand-made and hand-hammered or spun/form molded and machine hammered, the aspects of the bowl that have the most influence on the sound are:\n\n1) the volume of air the bowl contains\n\n2) how the bowl material reacts to the energy created by the displacement of the internal air modes\n\n3) its thermal mass properties\n\n4) how much surface area of the bowl is coupled to the frame, external, and mechanical parts\n\nThese aspects of the bowl affect the resonance and sustain of the vibrating membrane, and can help with the alignment of the partials into more of a harmonic order. It is the vibrating head and the vibrating head only that produces the viable pitch output from timpani. It is questionable whether the finer subtleties of timpani design such as Hammered vs. Spun copper timpani bowls is even noticeable to the general audience or the other musicians in the context of the sound of a full symphony orchestra, but it is certainly a matter of concern to contemporary timpani culture (perhaps market driven hype) as it is debated incessantly."}, {"url": "https://wtt.pauken.org/chapter-3/the-bowl/sound-radiation/2", "page_content": "In speaking of the bowl Benade states:\n\nThe varying degree in perfection in preserving the correct air-to-membrane relationship is what explains the observation by musicians that every drum plays best at one particular frequency in its range of usability. 20\n\nIn 1984, perhaps some hope was given to the timpanists’ belief of “the bowl shaping the sound” with the publication of the paper, Effects of air loading on timpani membrane vibrations by Richard S. Christian, Robert E. Davis, Arnold Tubis, Craig A. Anderson, Ronald I. Mills, and Thomas D. Rossing. This paper dealt with theoretical calculations (Green function method) of timpani modal frequencies and decay times of timpano bowl enclosures with varying volume. Their conclusion:\n\nAlthough the timpani-membrane frequency shifts are more sensitive to total kettle volume then they are to the details of kettle geometry, the specifics of kettle shape may be important for the fine details of the timpani spectrum (e.g., the frequencies and relative strength of the partials other than the f m1 ), for the instrument response times, etc. This may well account for the various preferences timpani players have concerning kettle geometries. 21\n\nIn 1988, Robert Eugene Davis in his Ph.D. dissertation Mathematical modeling of the orchestral timpani, used Green function and boundary integral methods to investigate the effects of air loading and kettle shape on the vibrational spectrum. He mathematically calculated timpani modal frequencies for five different kettle shapes and concluded:\n\nThe timpani spectrum depends weakly on the detailed kettle shape as long as the correct volume of the kettle with regard to the size of the membrane has been met. 22\n\nRossing’s analysis is simple and to the point:\n\nIs kettle shape important in determining timpani sound? No. Careful studies indicate that the shape of the timpani kettle is quite unimportant in determining timpani sound provided that the volume is kept in correct range. 23\n\nOne must bear in mind that Rossing’s definition of timpani sound is based on the harmonicity of the preferred modes and not the overall sound of the timpani, which may include inharmonic partials (collateral color) for the purpose of color and projection.\n\nFleischer and Fastl investigated the influence of bowl vibrations, and bowl shape by using a single 73 cm timpano frame and interchanging three different bowl shapes with different finishes. Their study showed :\n\nIn comparing the determined oscillation frequencies with the results of harmonic frequencies in the audible range of the timpani sound, there is no indication that the bowl actively contributes to the sound radiation. There are no components with the same frequencies of sound as that of the bowl. A constructive interference of sound is therefore excluded. The volume of the air enclosed influences the intervals of the partial tones, to an especially high extent the frequency of the 01 tone. To keep this inharmonic tone inaudible, the kettle should be small. With respect to the intervals of main tone, quint and octave, however, there is an optimum volume. 24\n\nWhy does bowl shape not affect the sound with respect to the near-harmonic partials of the preferred modes? Is there an explanation? Rossing explains.\n\nThese results may surprise some timpanists, since articles in the literature frequently refer to “shaping” the sound by using kettles with hemispherical, parabolic or other shapes. A simple fact that helps explain why kettle shape is unimportant is that the the sound wavelengths are so much larger than the kettle dimensions. (At 140 Hz, for example the wavelength is 2.5 meters, and even at 44o it is about 0.8 m). Thus the mode frequencies of the enclosed air, which depend on kettle volume are virtually unaffected by the shape of the kettle. 25\n\nThe volume of air inside of the bowl effectively fine tunes the partials created by the preferred modes helping to bring them into a near-harmonic relationship. Most modern timpani bowls seem to have the right volume to optimize the harmonicity of the principal partials, but Fleischer and Fastl believe that there is an optimum volume based on the diameter of the head.\n\nTo date, partials other than that of the preferred modes (collateral color) has not been a subject of scientific investigation with respect to exactly what is the overall sound of the timpani spectrum; the complete timpani sound that timpanists hear. More studies in this area are certainly needed.\n\n<<Previous – Next>>\n\nPages: 1 2"}, {"url": "https://www.classicalmusicindy.org/the-quest-for-the-perfect-timpani/", "page_content": "In the early 1980s two enterprising women set out to design and build the perfect timpani. Rebecca Kite and Barbara Allen met when both were graduate students at Indiana University (IU), Bloomington. They believed that they could improve upon timpani and achieve the purest possible sound. “Our goal was to build an instrument that had a better sound and worked better – a timpani that we could be passionate about,” Kite says. Words by Dr. Nick Johnson. Adapted from Classical Music Indy’s NOTE Magazine.\n\nThe Quest for the Perfect Timpani\n\nBy the end of the 1980s, Kite and Allen achieved their goal. It was a long and difficult journey, involving a 100-year-old copper shop in Ohio, a self-designed machine shop in Bloomington, metal workers in Indianapolis, several patents and a remarkable amount of grit and determination.\n\nTo appreciate their story, you have to know a little about timpani. These kettle-drums have been used in Western concert music since the late 1700s by composers like Mozart and Haydn. Beethoven later used timpani to add emphasis and volume at climactic moments in his symphonies, such as in his famous Symphony No. 9. Timpani makers continued to refine the instrument in the 1800s, and the basic design as we know it was standardized in the late 1800s.\n\nAlthough they are imposing, powerful instruments, traditional timpani have musical and practical limitations:\n\nThey can be difficult to tune quickly and accurately.\n\nThe frame limits some of the instrument’s resonance.\n\nThey are difficult to move and expensive to purchase and maintain.\n\nKite and Allen saw an opportunity to fix these issues. Several years after graduate school, Kite worked for IU and was in charge of nearly 60 timpani housed at the music school. This experience made her intimately familiar with the design of the drums. Timpani are essentially copper bowls suspended by a metal frame with a skin or synthetic head stretched tight. What makes them unique is the ability to change pitch by adjusting the tension of the head. Each of these elements presented Kite and Allen with opportunities for improvement.\n\nOne of the first hurdles was designing and building custom copper bowls for the drums. Kite says most timpani sacrifice tone quality by using shallower bowls than is mathematically ideal for sound waves. This limits the purity of tone and resonance.\n\nTo get deeper copper bowls, Kite and Allen had to build them by hand. They traveled to study with a 102-year-old coppersmith in Ohio who had “modernized” his equipment in the 1920s. He told them they were the first women ever to come to his shop, and offered to train the pair if they came back with a pattern for their drums.\n\nThe wizened artisan probably never expected to see them again, but that was before he knew the degree of their determination and ingenuity. “When we were in school, we weren’t even allowed to take shop classes,” Allen says. “But we did take home economics, and drum patterns are remarkably similar to dress patterns.”\n\nThe two returned to the shop a few months later with a pattern for a perfect parabolic drum bowl. Training with the master, they learned how to make their own tools, pound the copper into the proper shape and bind it into a sturdy bowl. Using these skills, the pair then built their own machine shop in Bloomington, custom designed for manufacturing their timpani.\n\nOver the next decade they produced numerous timpani under the name GP Percussion. Orchestras, universities, military bands and professional percussionists all over the United States use the instruments. Kite and Allen, however, are no longer building timpani. Kite is now primarily a marimbist and timpanist, and Allen is a political science professor at Carleton College. Their innovations, however, have inspired numerous drum makers to adopt several of their ideas, although, as Kite puts it, “What we did has not been fully replicated.”\n\nKite and Allen are inspirational to drum makers and young, entrepreneurial musicians alike, especially women in a male-dominated field. “You can get a degree in something, you can be really good at something, and it may take a long time before your particular idea comes about,” Allen says. “The creative spark that pushes you forward is really the important thing in life. And finding those interesting projects, solving those puzzles, that’s the deal. Not getting exactly what you want, the way you thought you were going to get it.”\n\nYou can see a set of timpani designed and built by Kite and Allen on display at the Rhythm! Discover Center in downtown Indianapolis. Also included in the exhibit are original tools, patterns and patents from their tenure as timpani makers."}, {"url": "https://hub.yamaha.com/drums/percussion/anatomy-of-timpani/", "page_content": "Timpani (sometimes known as “kettle drums”) are used in many types of ensembles, including concert bands, marching bands, orchestras and even by some rock bands. They consist of a membrane (a head) stretched over a large bowl traditionally made of copper, and they’re played by striking the head with a specialized drum stick called a mallet. Modern timpani can be tuned quickly and accurately to specific pitches by skilled players using a movable foot pedal.\n\nHere’s an annotated illustration of a typical timpano (“timpani” is plural for a collection of timpano), followed by a description of each part, in alphabetical order:\n\nAuxiliary Brake. This is located under the pedal. When locked, it keeps the timpano from moving.\n\nBase. The mechanisms for tuning are placed under the base of each timpano. The base is heavy in weight to keep each drum balanced and to promote resonance.\n\nBearing Edge. The lip of the timpano bowl is known as the bearing edge. This transfers the energy from the head to the bowl to create a pitch.\n\nBowl. The shape and material of the bowl’s surface help to determine the drum’s timbre. Hemispheric bowls produce brighter tones while parabolic bowls produce darker tones.\n\nCable Band. Attaches the timpano cable to the strut.\n\nHead. These can be made of either animal skin (generally calf heads) or plastic. The two types of heads need to be attached differently (see the instructions that come with the head.) Plastic heads are easier to take care of since they are not as susceptible to changes in humidity and temperature; they’re also generally easier to install.\n\nHead Protector. Protects the head from dust. Always place this on the timpano when the instrument is not in use.\n\nHoop (Counterhoop). The rim that tightens the timpano head.\n\nMain Caster. Casters allow timpani to be moved with ease. They should be locked during performance to prevent the drums from moving from side to side.\n\nPAC (Pedal Adjustment Knob). This mechanism lets you adjust pedal torque (pedal weight) while maintaining pedal balance. Turn the knob counterclockwise (left) to release the lock. To give the pedal a heavier feel, turn the knob clockwise.\n\nPointer Lock Nut. Locks the tuning indicator into place after fine-tuning.\n\nSpring Tension Adjustment Bolt. Adjusting this bolt allows the tension of the pedal to be set to individual preference.\n\nTension Rod. This threaded metal rod is inserted into the lug casing. It can be tightened or loosened to tune the drum to the desired pitch.\n\nTuning Indicator. A scale of measurement used as a visual guide in tuning the pitch of each timpano.\n\nClick here for more information about Yamaha timpani."}]}