{"The head of the Clay timpani is made from a thin sheet of animal skin, usually calfskin.": [{"url": "https://www.britannica.com/art/timpani", "page_content": "timpani, (Italian: “drums”) also spelled tympani, orchestral kettledrums. The name has been applied to large kettledrums since at least the 17th century. The permanent orchestral use of timpani dates from the mid-17th century, early examples being in Matthew Locke’s Psyche (1673) and Jean-Baptiste Lully’s opera Thésée (1675). At first they were mainly confined to expressions of rejoicing or to supporting the brass in loud passages. Two instruments, one tuned to the tonic and the other to the dominant (first and fifth notes of the scale), were normal in 17th- and 18th-century scores. Later, more instruments were used with a variety of tunings. In the 19th century the timpani were used in more varied and expressive ways, a development stimulated in large part by the innovations of Ludwig van Beethoven. The French composer Hector Berlioz, who required 16 kettledrums in his Grand Messe des morts (1837; Requiem), even urged composers to specify which type of hard or soft sticks they wished used.\n\nIn modern timpani the bowl-shaped shell is usually of copper or brass. The membrane, of calfskin or synthetic material, is secured by a metal hoop. Its tension is varied by hand screws fixed to the shell and acting on the hoop, or, more often, by one of several 19th- and 20th-century devices: pedal or hand mechanisms that control the tension by rods connected to the hoop. A hole is pierced at the bottom of the shell to avoid air concussion splitting the head in loud passages. The tone varies according to the texture of the head of the stick and the area of the membrane struck. Occasionally, composers specify using the fingers to set the membrane in vibration.\n\nBritannica Quiz Musical Instruments\n\nThe orchestral kettledrum has a practical compass of five full tones. The compass of a pair of timpani is normally an octave from F below middle C downward; for an orchestral set of three, the tuning ranges are generally c–g, G–d, and E♭–B♭ (g = the G below middle C; E♭ = the second E♭ below). Such composers as Igor Stravinsky and Gustav Mahler have extended this range. The expressive resources of the timpani include reiteration of persistent rhythms, dramatic crescendos, sudden stresses, and atmospheric rolls. Special effects include damped or muffled notes, striking a note with two sticks, pedal glissando (sliding pitch) on a roll, and muting by placing a cloth on the drumhead."}, {"url": "https://hub.yamaha.com/drums/percussion/anatomy-of-timpani/", "page_content": "Timpani (sometimes known as “kettle drums”) are used in many types of ensembles, including concert bands, marching bands, orchestras and even by some rock bands. They consist of a membrane (a head) stretched over a large bowl traditionally made of copper, and they’re played by striking the head with a specialized drum stick called a mallet. Modern timpani can be tuned quickly and accurately to specific pitches by skilled players using a movable foot pedal.\n\nHere’s an annotated illustration of a typical timpano (“timpani” is plural for a collection of timpano), followed by a description of each part, in alphabetical order:\n\nAuxiliary Brake. This is located under the pedal. When locked, it keeps the timpano from moving.\n\nBase. The mechanisms for tuning are placed under the base of each timpano. The base is heavy in weight to keep each drum balanced and to promote resonance.\n\nBearing Edge. The lip of the timpano bowl is known as the bearing edge. This transfers the energy from the head to the bowl to create a pitch.\n\nBowl. The shape and material of the bowl’s surface help to determine the drum’s timbre. Hemispheric bowls produce brighter tones while parabolic bowls produce darker tones.\n\nCable Band. Attaches the timpano cable to the strut.\n\nHead. These can be made of either animal skin (generally calf heads) or plastic. The two types of heads need to be attached differently (see the instructions that come with the head.) Plastic heads are easier to take care of since they are not as susceptible to changes in humidity and temperature; they’re also generally easier to install.\n\nHead Protector. Protects the head from dust. Always place this on the timpano when the instrument is not in use.\n\nHoop (Counterhoop). The rim that tightens the timpano head.\n\nMain Caster. Casters allow timpani to be moved with ease. They should be locked during performance to prevent the drums from moving from side to side.\n\nPAC (Pedal Adjustment Knob). This mechanism lets you adjust pedal torque (pedal weight) while maintaining pedal balance. Turn the knob counterclockwise (left) to release the lock. To give the pedal a heavier feel, turn the knob clockwise.\n\nPointer Lock Nut. Locks the tuning indicator into place after fine-tuning.\n\nSpring Tension Adjustment Bolt. Adjusting this bolt allows the tension of the pedal to be set to individual preference.\n\nTension Rod. This threaded metal rod is inserted into the lug casing. It can be tightened or loosened to tune the drum to the desired pitch.\n\nTuning Indicator. A scale of measurement used as a visual guide in tuning the pitch of each timpano.\n\nClick here for more information about Yamaha timpani."}, {"url": "https://www.yamaha.com/en/musical_instrument_guide/timpani/mechanism/", "page_content": "The Structure of the Timpani\n\nLearning about the names of the timpani's parts\n\nA timpani is made of these kinds of parts Names of the parts of the timpani"}, {"url": "https://www.newworldencyclopedia.org/entry/Timpani", "page_content": "A timpanist in the United States Air Forces in Europe Band.\n\nTimpani (also known colloquially as kettledrums) are musical instruments in the percussion family. A type of drum, they consist of a head, formerly made of animal skin but today usually of synthetic material, stretched over a large bowl commonly made of copper. Unlike most drums, they produce a definite pitch when struck. This feature enables them to play a significant role in symphonic pieces such as Gustav Mahler's Symphony No. 2, Ludwig van Beethoven's Symphony No. 9, and the \"Triumphal Procession\" from Sergei Prokofiev's \"Peter and the Wolf.\"\n\nTimpani evolved from military drums to become a staple of the classical orchestra by the last third of the eighteenth century. Today, they are used in many types of musical ensembles including concert, marching, and even rock bands. They are played by striking the head with a specialized drum stick called a timpani stick or timpani mallet. Modern timpani often feature pedal mechanisms which allow their pitch to be altered during performance.\n\nTimpani is an Italian plural, the singular of which is timpano. However, this is rarely used in informal English speech. A musician who plays the timpani is known as a timpanist. While the word timpani has been widely adopted in the English language, some English speakers refer to them as kettledrums. The German word for timpani is pauken, and the French is timbales. In the Sachs-Hornbostel classification, it is thus considered a membranophone.\n\nConstruction\n\nBasic timpani\n\nTimpani set up in three combinations.\n\nTimpani tuning\n\nThe basic timpano consists of a drumhead stretched across the opening of a bowl typically made of copper or, in less expensive models, fiberglass and sometimes aluminum. The drumhead is affixed to a hoop (also called a fleshhoop), which in turn is held onto the bowl by a counterhoop, which is then held by means of a number of tuning screws called tension rods placed regularly around the circumference. The head's tension can be adjusted by loosening or tightening the rods. Most timpani have six to eight tension rods.\n\nThe shape of the bowl contributes to the tone quality of the drum. For example, hemispheric bowls produce brighter tones while parabolic bowls produce darker tones. Timpani come in a variety of sizes from about 84 centimeters (33 inches) in diameter down to piccolo timpani of 30 centimeters (12 inches) or less. A 33-inch drum can produce the C below the bass clef, and specialty piccolo timpani can play up into the treble clef.\n\nEach individual drum typically has a range of a perfect fifth to an octave. Changing the pitch of a timpano by turning each tension rod individually is a laborious process. In the late nineteenth century, mechanical systems to change the tension of the entire head at once were developed. Any timpano equipped with such a system may be called machine timpani, although this term commonly refers to drums that use a single handle connected to a spider-type tuning mechanism.\n\nPedal timpani\n\nTPedal is on a Dresden timpano. The timpanist must disengage the clutch—seen here on the left of the pedal—to change the pitch of the drum.\n\nBy far the most common type of timpani used today are pedal timpani, which allow the tension of the head to be adjusted using a pedal mechanism. Typically, the pedal is connected to the tension screws via a spider-like system of metal rods.\n\nThere are three types of pedal mechanisms in common use today:\n\nThe ratchet-clutch system uses a ratchet and pawl to hold the pedal in place. The timpanist must first disengage the clutch before using the pedal to tune the drum. When the desired pitch is achieved, the timpanist must then reengage the clutch.\n\nsystem uses a ratchet and pawl to hold the pedal in place. The timpanist must first disengage the clutch before using the pedal to tune the drum. When the desired pitch is achieved, the timpanist must then reengage the clutch. In the balanced action system, a spring or hydraulic cylinder is used to balance the tension on the timpani head so that the pedal will stay in position and the head will stay at pitch. The pedal on a balanced action drum is sometimes called a floating pedal since there is no clutch holding it in place.\n\nsystem, a spring or hydraulic cylinder is used to balance the tension on the timpani head so that the pedal will stay in position and the head will stay at pitch. The pedal on a balanced action drum is sometimes called a since there is no clutch holding it in place. The friction clutch or post and clutch system uses a clutch that moves along a post. Disengaging the clutch frees it from the post, allowing the pedal to move without restraint.\n\nAny pedal drums that are tuned using the spider system can be called Dresden timpani, though the term is most often used for drums whose design is similar to the original pedal timpani built in Dresden. Strictly speaking, a Dresden drum has a pedal that is attached at the player's side. The timpanist can move this pedal with ankle motion. A Berlin-style pedal is attached by means of a long arm to the opposite side of the drum, and the timpanist must use his entire leg to adjust the pitch.\n\nThe drums most professional timpanists use are Dresden timpani, commonly with a ratchet-clutch or friction clutch pedal. Most school bands and orchestras below the university level use cheaper, more durable timpani. The mechanical parts of these timpani are almost completely contained within the frame and bowl of the drum. They may use any of the pedal mechanisms, though the balanced action system is by far the most common, followed by the friction clutch system. Many professionals also use these drums for jobs and outdoor performances because of their durability.\n\nOn chain timpani, a chain links the tension rods so a master handle can be used to turn them all at once.\n\nChain timpani\n\nOn chain timpani, the tension rods are connected by a roller chain much like the one found on a bicycle, though some manufacturers have used other materials, including steel cable. In these systems, all the tension screws can then be tightened or loosened by one handle. Though far less common than pedal timpani, chain drums still have practical uses. For example, professional players may also use exceptionally large or small chain and cable drums for special low or high notes.\n\nOther tuning mechanisms\n\nA rare tuning mechanism allows the pitch of the head to be changed by rotating the drum itself. In the early twentieth century, Hans Schnellar, then timpanist of the Vienna Philharmonic, developed a tuning mechanism in which the bowl is moved via a handle that connects to the base, and the head remains stationary. These drums are referred to as Viennese timpani (Wiener Pauken) or Schnellar timpani. Adams Musical Instruments developed a pedal-operated version of this tuning mechanism in the early twenty-first century.\n\nTimpani heads\n\nLike most drumheads, timpani heads can be found made from two materials: animal skin (typically calfskin or goatskin) and plastic (typically PET film). Plastic heads are durable, weather resistant, and relatively inexpensive. Thus, they are more commonly used than natural skin heads. However, many professional players prefer skin heads because they feel the heads produce a warmer, better quality timbre. Timpani heads are sized based on the size of the head, not the size of the timpani bowl. For example, a 23\" Timpani may require a 25\" timpani head.\n\nSticks and mallets\n\nTimpanists use a variety of timpani sticks since each stick produces a different timbre.\n\nTimpani are typically struck with a special type of drumstick fittingly called a timpani stick or timpani mallet. Timpani sticks are used in pairs. They have two components: a shaft and a head. The shaft is typically made from wood—usually hickory, cherry, birch, persimmon, or maple or bamboo—but may also be made from aluminum or graphite. The head of the stick can be constructed from a number of different materials, though felt wrapped around a wood core is the most common. Other core materials include felt and cork, and other wrap materials include leather. Sticks can also have exposed wood heads. These are used as a special effect and in authentic performances of Baroque music.\n\nTimpanists will change sticks, often many times within the same piece, to suit the nature of the music. However, choice of sticks during a performance is subjective and depends on the timpanist's own preference, or occasionally the wishes of the conductor. Thus, most timpanists own a great number of timpani sticks. The weight of the stick, size of the head, materials used, and the method used to wrap the head all contribute to the timbre the stick produces.\n\nIn the early twentieth century and previously, sticks were often made with whalebone shafts, wood cores, and sponge wraps. Composers of that era often specified sponge-headed sticks. Modern timpanists execute such passages with standard felt mallets.\n\nTimpani in the modern ensemble\n\nA standard set of timpani consists of four drums.\n\nA standard set of timpani consists of four drums: roughly 80 cm (32 in), 75 cm (29 in), 66 cm (26 in), and 61 cm (23 in) in diameter. The range of this set is roughly the D below the bass clef to the top-line bass clef A. The great majority of the orchestral repertoire can be played using these four drums. Adding a 51 cm (20 in) piccolo timpano to the standard set of four extends the range upwards by a few semitones. This is the instrument which Igor Stravinsky specifies for the production of the B below middle C in The Rite of Spring, and from which Maurice Ravel expects the D above that in L'Enfant et les Sortilèges. Leonard Bernstein requires the timpanist to execute both a top-line bass clef A flat and the B flat above it on the same drum in the Overture to Candide.\n\nBeyond this extended set of five, any added drums are nonstandard. Many professional orchestras and timpanists own multiple sets of timpani consisting of both pedal and chain drums allowing them to execute music that cannot be performed correctly using a standard set of four or five drums. However, many schools and ensembles that cannot afford to purchase equipment regularly only have a set of three timpani, consisting of 75 cm (29 in), 66 cm (26 in), and 61 cm (23 in) drums. Its range extends down only to the F below the bass clef.\n\nThe drums are set up in an arc around the performer. Traditionally, North American and French timpanists set their drums up with the lowest drum on the left and the highest on the right, while German and Austrian players set them up the opposite way. Over time, that distinction has blurred: many German and European players have adopted the North American layout and vice versa.\n\nHistory\n\nPre-orchestral use\n\nFrench Republican Guard parade shows horseman with draped timpano\n\nIn the fifteenth century, timpani were used with trumpets as ceremonial instruments in the cavalry.\n\nIn 1188, Cambro-Norman chronicler Gerald of Wales wrote, \"Ireland uses and delights in two instruments only, the harp namely, and the tympanum.\"[1] Arabic nakers, the direct ancestors of most timpani, were brought to thirteenth century Continental Europe by Crusaders and Saracens. These drums, which were small (with a diameter of about 20–22 cm or 8–8½ in) and mounted to the player's belt, were used primarily for military ceremonies. This form of timpani remained in use until the sixteenth century.\n\nIn 1457, a Hungarian legation sent by Ladislaus Posthumus of Bohemia and King Ladislaus V carried larger timpani mounted on horseback to the court of King Charles VII in France. This variety of timpani had been used in the Middle East since the twelfth century. These drums evolved together with trumpets to be the primary instruments of the cavalry. This practice continues to this day in sections of the British Army, and timpani continued to be paired with trumpets when they entered the classical orchestra.\n\nOver the next two centuries, a number of technical improvements were made to timpani. Originally, the head was nailed directly to the shell of the drum. In the fifteenth century, heads began to be attached and tensioned by a counterhoop that was tied directly to the shell. In the early sixteenth century, the bindings were replaced by screws. This allowed timpani to become tunable instruments of definite pitch.\n\nOrchestral use\n\nTimpano now in the Church of St Peter and St Paul in Vilnius, Lithuania dating to c. 1673\n\nJean-Baptiste Lully is the first known composer to have scored for timpani, which he included in the orchestra for his 1675 opera Thésée. Other seventeenth-century composers soon followed suit. Later in the Baroque era, Johann Sebastian Bach wrote a secular cantata titled \"Tönet, ihr Pauken! Erschallet, Trompeten!,\" which translates roughly to \"Sound off, ye timpani! Sound, trumpets!\" The piece starts with a timpani solo, and the chorus and timpani trade the melody back and forth. Bach reworked this movement in part 1 of his Christmas Oratorio.\n\nAlthough by the early nineteenth century, timpani were most commonly found in orchestras, ceremonial trumpet and timpani ensembles still existed.\n\nLudwig van Beethoven revolutionized timpani music in the early nineteenth century. He not only wrote for drums tuned to intervals other than a fourth or fifth, but he gave a prominence to the instrument as an independent voice beyond programmatic use such as in Bach's Tönet, ihr Pauken!. For example, his Violin Concerto (1806) opens with four solo timpani strokes, and the scherzo of his Ninth Symphony (1824) sets the timpani against the orchestra in a sort of call and response.\n\nThe next major innovator was Hector Berlioz. He was the first composer to indicate the exact sticks that should be used – felt-covered, wooden, etc. In several of his works, including Symphonie fantastique (1830), he demanded the use of several timpanists at once.\n\nUntil the late nineteenth century, timpani were hand-tuned; that is, there was a sequence of screws with T-shaped handles, called taps, which altered the tension in the head when turned by players. Thus, tuning was a relatively slow operation, and composers had to allow a reasonable amount of time for players to change notes if they wanted to be sure of a true note. The first pedal timpani originated in Dresden in the 1870s and are called Dresden timpani for this reason. However, since vellum was used for the heads of the drums, automated solutions were difficult to implement since the tension would vary unpredictably across the drum. This could be compensated for by hand-tuning, but not easily by a pedal drum. Mechanisms continued to improve in the early twentieth century.\n\nDespite these problems, composers eagerly exploited the opportunities the new mechanism had to offer. By 1915, Danish composer Carl Nielsen was demanding glissandos on timpani in his Fourth Symphony – impossible on the old hand-tuned drums. However, it took Béla Bartók to more fully realize the flexibility the new mechanism had to offer. Many of his timpani parts require such a range of notes that it would be unthinkable to attempt them without pedal drums.\n\nBalanced action timpani are used in outdoor performances because of their durability.\n\nMost pieces of music of the period from 1700 to 1900 call for one timpanist playing one set of timpani. However, occasionally composers seeking a thicker texture or a greater palette of pitches ask for multiple players to perform on one or many sets of timpani. Gustav Mahler wrote for two timpanists in six of his symphonies. Gustav Holst used two timpanists to achieve the range of notes needed to echo the main theme in \"Jupiter\" from The Planets suite. Using two timpanists is relatively common in late Romantic and twentieth century works for large orchestras.\n\nSeveral concertos have been written for timpani. The eighteenth century composer Johann Fischer wrote a symphony for eight timpani and orchestra, which requires the solo timpanist to play eight drums simultaneously. In 1983, William Kraft, a well regarded American percussionist and composer, composed his Concerto for Timpani and Orchestra, which won second prize in the Kennedy Center Friedheim Awards. Gordon Jacob wrote a concerto for timpani and wind band in 1984. In the year 2000, American composer Philip Glass wrote his Concerto Fantasy for two timpanists and orchestra, which has its two soloists each playing seven timpani.\n\nTimpani outside the orchestra\n\ngrounded with legs extended. This 1976 photograph shows marching timpaniwith legs extended.\n\nIn the 1970s, marching bands and drum and bugle corps, which evolved both from traditional marching bands and concert bands, began to include marching timpani. Each player carried a single drum, which was tuned by a hand crank. Marching timpani were heavy and awkward to play, as the drumhead was almost at the player's chest. Often, during intricate passages, the timpani players would put their drums on the ground by means of extendable legs, and they would be played more like conventional timpani, but with a single player per drum. In the early 1980s, Drum Corps International (DCI), a drum corps governing body, allowed timpani and other percussion instruments to be permanently grounded. This was the beginning of the end for marching timpani: Eventually, standard concert timpani found their way onto the football field as part of the front ensemble, and marching timpani fell out of common usage.\n\nJazz musicians also experimented with timpani. Sun Ra used it occasionally in his Arkestra (played, for example, by percussionist Jim Herndon on the songs \"Reflection in Blue\" and \"El Viktor,\" both recorded in 1957). In 1964, Elvin Jones incorporated timpani into his drum kit on John Coltrane's four-part composition A Love Supreme.\n\nWhen rock and roll bands started seeking to diversify their sound, timpani found their way into the studio. Starting in the 1960s, drummers for high profile rock acts like The Beatles, Led Zeppelin, The Beach Boys, and Queen incorporated timpani into their music. This led to the use of timpani in progressive rock. For example, Emerson, Lake & Palmer recorded a number of rock covers of classical pieces that utilize timpani.\n\nTuning\n\nPrior to playing the instruments, the timpanist must clear the heads by equalizing the tension at each tuning screw. This is done so every spot on the head is tuned to exactly the same pitch. When the head is clear, the timpano will produce a beautiful, in-tune sound. If the head is not clear, the pitch of the drum will rise or fall after the initial impact, and the drum will produce different pitches at different dynamic levels.\n\nTuning gauges visually indicate the position of the pedal so the performer can determine the drum's pitch without listening to it.\n\nIn performance, tuning is typically accomplished with a method called interval tuning. Timpanists who are not blessed with absolute pitch obtain a reference pitch from a tuning fork, pitch pipe, or a note played by another instrument in the course of the performance, then use musical intervals to arrive at the desired note. For example, to tune the timpani to G and C, a timpanist may sound an A with a tuning fork, then sing (or think) a minor third above that A to tune the C, and then sing a perfect fourth below the C to tune the G. Timpanists are required to have a well-developed sense of relative pitch, and must develop techniques to tune undetectably and accurately in the middle of a performance.\n\nSome timpani are equipped with tuning gauges, which provide a visual indication of the drum's pitch. They are physically connected either to the counterhoop, in which case the gauge indicates how far the counterhoop is pushed down, or the pedal, in which case the gauge indicates the position of the pedal. These gauges are accurate when used correctly. However, when the drum is moved, the overall pitch of the head can change, thus the markers on the gauges are not reliable unless they have been adjusted immediately preceding the performance. Gauges are especially useful when performing music that involves fast tuning changes that do not allow the player to listen to the new pitch before playing it. Even when gauges are available, good timpanists will check their intonation by ear before playing.\n\nOccasionally, players use the pedals to retune a drum while playing it. Portamento effects can be achieved by changing the pitch of the drum while it can still be heard. This is commonly called a glissando, though this use of the term is not strictly correct. The most effective glissandos are those from low notes to high notes and those performed during rolls. One of the first composers to call for a timpani glissando was Carl Nielsen in his Symphony No. 4.\n\nPedaling\n\nPedaling refers to changing the pitch of the drum with the pedal; it is an alternate term for tuning. In general, timpanists reserve this term for passages where the performer must change the pitch of a drum in the midst of playing – for example, playing two consecutive notes of different pitches on the same drum. Early twentieth century composers such as Nielsen, Béla Bartók, Samuel Barber, and Richard Strauss took advantage of the freedom pedal timpani afforded, often giving the timpani the bass line.\n\nIntermezzo interrotto movement of This chromatic passage from themovement of Bartók 's Concerto for Orchestra requires the timpanist to use the pedals to play all the pitches. One way of executing this passage is annotated here: The lowest and highest drum stay on F and E-flat, respectively. All pedaling is executed on the middle two drums. Each pedal change is indicated by a colored line: red for the larger and blue for the smaller of the middle drums.\n\nReferences ISBN links support NWE through referral fees\n\nAdler, Samuel. The Study of Orchestration . W. W. Norton & Company, 3rd edition, 2002. ISBN 039397572X\n\n. W. W. Norton & Company, 3rd edition, 2002. ISBN 039397572X Del Mar, Norman. Anatomy of the Orchestra . University of California Press, 1984. ISBN 0520050622\n\n. University of California Press, 1984. ISBN 0520050622 Kennan, Kent. The Technique of Orchestration . Prentice-Hall, Inc., New Jersey, 1970. ISBN 978-0139003165\n\n. Prentice-Hall, Inc., New Jersey, 1970. ISBN 978-0139003165 Montagu, Jeremy. Timpany & Percussion . Yale University Press, 2002. ISBN 0300093373\n\n. Yale University Press, 2002. ISBN 0300093373 Peters, Mitchell. Fundamental Method for Timpani. Alfred Publishing Co., 1993. ISBN 073902051X\n\nAll links retrieved March 12, 2020."}, {"url": "https://hellomusictheory.com/learn/facts-about-the-timpani/", "page_content": "By Robert Jackson\n\nTimpani are those large semi-spherical drums that look like big shiny bowls or upside-down tea-kettles—which is why they’re also called kettledrums.\n\nA classical percussion section would never be complete without timpani. They’re important both in classical orchestras and musical ensembles, including concert, marching, and even rock and roll bands.\n\nThe sound of timpani can be energetic and thunderous, as well as smooth and velvety, which is why they’re considered extremely versatile.\n\nTo help acquaint you with this fascinating percussive instrument, here are 20 interesting facts about the timpani.\n\n1. The Timpani is a Pitched Percussion Instrument\n\nModern pedal timpani can be instantly tuned through a movable foot pedal to adjust the tension of the head as well as the pitch.\n\nAlthough convenient, that could still pose a challenge during a concert, since it’ll require the timpanist to have a perfect ear to keep the instrument in key with the rest of the ensemble.\n\nTuning a chain timpani, which is much less common nowadays, is even more difficult since they don’t have pedals.\n\nInstead, they have a roller chain and a crank.\n\n2. The Timpani Were Initially Military Drums\n\nArabian Naqqara\n\nTimpani started as military drums.\n\nTheir use dates back to the 13th century when they were introduced to Europe by crusaders who brought similar but much smaller Arabian Naqqara.\n\nBefore timpani came to be a staple instrument in the classical orchestra by the last third of the 18th century, they were used in military ceremonies throughout Europe until the 16th century.\n\nThey were even used during the American Civil war where they were played by musicians on horseback.\n\nIn the late 19th century, modern machine timpani were developed for easier adjustment of drumhead tension.\n\n3. The Timpani Has a Wide Range of Sounds\n\nTimpani produce a wide dynamic range of sounds.\n\nTheir various sounds could best be described as dull, thunderous, rumbling, booming, deep, heavy, powerful, round, mellow, velvety, substantial, resonant, dry, or hollow.\n\nThe timbre of the timpani is affected by what the mallets are made of, where the head is struck, and how hard it’s struck.\n\nThe purest tone is produced from the middle of a timpani drum.\n\n4. Timpani Belong to the Percussion Family\n\nThe percussion family is the largest in the orchestra, and timpani are a central part of it because they support rhythm, add melody and color, and enhance harmony.\n\nThe timpani, along with the xylophone and piano, are percussion instruments that are tuned and can sound different notes.\n\nThe bass drums, cymbals, and castanets are examples of untuned percussion instruments with no definite pitch.\n\n5. Timpani Have a Wide Pitch Range\n\nEach timpano (the singular or timpani) has a tonal range of about an interval of a sixth, with the pitch of the lower note dependant on its size.\n\nIn a four-timpani set, the range of pitch of the four drums can therefore span around 3 octaves!\n\n6. Timpani Are Traditionally Made of Copper\n\nTimpani sets today come in a host of materials, including fiber-reinforced plastic and aluminum.\n\nHowever, the traditional copper remains the best material for the bowl since it keeps the timpani in tune more effectively, and resists temperature changes.\n\nCopper also has properties that allow it to easily stretch and shape, and allows sound to resonate deeply.\n\n7. Animal Skins are Preferred for Timpani Heads\n\nTypically, timpani heads used to cover the bowl are made of calfskin or goatskin.\n\nAlthough costly, professional timpanists prefer these skins for the warmer quality of sound they produce.\n\nHeads are also often made of plastic, which is more durable, more affordable, and less affected by temperature and humidity than animal skin.\n\n8. There Are Two Styles of Timpani Placement\n\nIn German-speaking countries, including Germany and Austria, large timpani are usually placed at the right side of the timpanist with smaller timpani to the left, increasing the pitch from right to left.\n\nInternationally, especially in Japan, the direction of the timpani is reversed so that the pitch increases from left to right, similar to a piano keyboard.\n\n9. Timpanists Are Very Well Paid\n\nTimpanists are some of the highest-earning musicians in the music industry.\n\nTheir role is central in an orchestra, and there are few of them due to the difficulty of the instrument.\n\nOf course, the more skilled and experienced a timpanist is, the higher their earning potential, especially in performing arts companies or professional symphonies.\n\nIn the US, it’s reported that the median salary for a timpanist is just under $50,000 a year with some paid well over $100k a year too!\n\n10. Timpani are Very Expensive Instruments\n\nBuying a quality set of timpani could cost you. Prices vary depending on factors like brand, size, and material.\n\nA timpani set can take up to two years to build and could cost an average of $12,000-$17,000.\n\nThat’s why it’s important to be careful while moving them around to avoid costly damages.\n\n11. Timpani Are Heavy\n\nTimpani are among the largest and heaviest musical instruments.\n\nA single timpani drum can weigh up to 140 lbs…\n\nMultiply that by 4 or 5 for a whole set, and you’ve got a challenge on your hands.\n\nTransporting these drums can be difficult and it’ll give you a good workout.\n\n12. There Are Many Different Styles of Timpani\n\nTimpani come in various shapes and sizes.\n\nThere’s a cambered type with a flat bottom like a pot, and a parabolic type that’s nearly hemispherical.\n\nGenerally, the smaller the drums, the higher the pitches.\n\nThe timbre is also decided by where the drum head is stricken.\n\n13. Different Timpani Mallets Give Different Sounds\n\nThere are different categories of mallets used for striking the timpani, including hard, medium-hard, soft, flannel, and wood.\n\nEach kind is used according to the sheet music to express different sounds.\n\nThey come in various sizes, weights, coverings, and lengths of handles.\n\nThe mallet tip is often made out of felt, flannel, or cork, with a bamboo or wood handle.\n\nFelt ball mallets result in a soft attack, while wood balls produce a sharp attack and greater volume.\n\nMany professional musicians prefer to make their own mallets to customize them according to their needs.\n\n14. There Are Different Grips For The Timpani Mallet\n\nTwo common grips for the timpani mallet are the German grip and the French grip.\n\nIn the German grip, the palm is almost parallel with the drum head with the thumb on the side of the mallet.\n\nIn the French grip, the palm is almost perpendicular with the drum head and the thumb is on top of the mallet.\n\nThe American grip is a combination of both.\n\n15. Timpani Go Into All Kinds of Contemporary Music\n\nMusic created by timpani has a lengthy repertoire; it has invaded many rock and roll bands, as well as pop music.\n\nFrom the Beach Boys, Queen, The Beatles, and Emerson, to Led Zeppelin, timpani have taken pride of place in the 60s-70s pop-rock music.\n\nThey’re also featured in electronic music!\n\nSounds created by the timpani are versatile, and stand out in any music style or genre.\n\n16. Playing the Timpani Can Be Tricky But Fun\n\nPlaying the timpani might seem easy—the rhythms are simple, and you often play only a couple of notes—but in reality, there’s so much technique involved.\n\nYou need a very strong musical ear to successfully tune and play your timpani.\n\nYou also need to know how to maintain your drums and mallets to ensure a longer lifespan for them.\n\nOnce you get the hang of it, playing the timpani is so much fun.\n\n17. Playing the Timpani Requires Sensitivity Over Strength\n\nIt’s often thought that playing a large musical instrument like the timpani requires a lot of physical strength, but that’s not true.\n\nIn fact, a large volume of sound can be given through the drum reverberations, using only a little amount of force.\n\nAll you need is to create vibration as naturally as you can.\n\nIt actually takes a lot of sensitivity to create soft sounds and maintain a steady tempo.\n\n18. The Largest Timpani in the World is in Bali\n\nThe largest timpani in the world is in Bali.\n\nAt 73 inches in tall and 63 inches in diameter, the Moon of Pejeng is an ancient kettledrum that is thought to date back to 300 BC.\n\nIt has a story attached to it too, with a Balinese legend claiming that this drum was one of the wheels of a chariot on which they pulled the moon through sky until it fell to earth.\n\nWrap-Up\n\nAs you can see, a timpanist’s job isn’t an easy one.\n\nWhile playing the timpani isn’t easy at first, it sure is fun when you get the hang of it.\n\nWe hope the 20 facts we’ve shared in this post have inspired you to delve deeper into the world of percussive instruments and enjoy some fascinating timpani solos and ensembles."}, {"url": "https://www.yamaha.com/en/musical_instrument_guide/timpani/manufacturing/", "page_content": "Once the kettle has been formed, it is annealed again, and the form is stabilized by releasing the force pressing upon it to return it to its previous shape. When the shell is heated, it reacts with the oxygen in the air, creating an oxidation layer, and causing a mottled color on the surface. However, this mottling can be cleanly removed by polishing. The shell is then buffed to create a smooth surface.\n\nPolishing the inside\n\nThe outside is polished while changing the sandpaper\n\nNow, it is time for polishing. When a timpani is played, the air inside the kettle vibrates as well. Polishing the inside of the kettle to make it smooth gives the timpani a crisp sound with sharp attack.\n\nThe kettle is hung up on a chain and cleaned\n\nNext, the kettle is cleaned. A jig is attached to the hole in the round bottom of the kettle, and the kettle is hung and dipped into a vat of water for washing. Air inside is let out as the kettle is quickly moved up and down to wash it.\n\nAfter this, any moisture on the surface is wiped off, and the kettle is hung up to dry in the air. Once dry, it is coated, using a clear coat in a dust-proof environment. At last our shiny new kettle is complete!"}, {"url": "https://simple.wikipedia.org/wiki/Timpani", "page_content": "Timpani (sometimes called kettle drums) are drums that are made out of large bowls that are usually made of copper shaped by craftsmen, which after being tuned, have a skin-like material stretched over the top. This material used to be a type of vellum or treated skin, but modern drums use a synthetic material. This top section is known as the \"drumhead\". Timpani is an Italian word. It is also a plural of the word timpano. However timpano is rarely used in informal English. More often, a timpano is referred to as a drum, a timpani, or simply a timp. Someone who plays a timpani is called a \"timpanist\".\n\nDifference from other drums [ change | change source ]\n\nTimpani are different from other drums because they are tuned to certain musical notes. A timpanist will often describe the drum as being \"in voice\" (or out of voice, as the case may be) when it is correctly tuned. To play it, it is hit with a special drumstick or \"timpani mallet\". Other drums that are used in orchestras and bands make a sound rather than a note, and are not tuned. A player normally sits with a group of two, three or four timpani around him, which is why the name timpani is in the plural.\n\nBrief history [ change | change source ]\n\nTimpani were originally used in official bands. They can still be seen in the bands of the modern official as in the Household Cavalry of Queen Elizabeth II of the United Kingdom, in which the \"kettle drums\" (as they are called) are carried by large drumhorses. (See picture below) In the 1700s timpani became popular in orchestral music, and can be heard in the music of Handel, Beethoven and other 19th century composers wrote music that needed the timpani. Nowadays all large orchestras have timpani, and some bands that play popular music use them as well.\n\nDifferent ways timpani can be made [ change | change source ]\n\nA basic timpano timpani.\n\nThe drumhead [ change | change source ]\n\nA timpani drumhead, also called a timpani head, can be made out of two different things. Some are made out of animal skin, like calfskin or goatskin. Other ones can be made out of thick plastic. Because plastic heads are hard to break and do not cost as much as animal skin heads, they are used more often than animal skin heads. However, a lot of professional players prefer skin heads because they think that skin heads make a better sound when they are hit. The drumhead is stretched over the bowl of the timpani and held on by screws for tuning the timpani.\n\nA chain timpani.\n\nTuning the timpani [ change | change source ]\n\nThe screws that hold and tune the drumhead are called \"tension rods\". To tune the timpani, the \"tension rods\" can all be tightened or loosened. The timpani makes a higher sound if the tension rods are made tighter, and a lower sound if they are loosened. There are usually around seven tension rods on the timpani.[1]\n\nMachine timpani [ change | change source ]\n\nTuning a timpani by turning every tension rod by itself can be very hard, so some timpani makers invented different ways to change the drum's pitch more quickly.[2]\n\nChain timpani [ change | change source ]\n\nIn a chain timpani, the tension rods are all attached to a chain. This chain is hooked up to a lever, and when a player moves the lever back and forth, it tightens and loosens all the screws at the same time to change the pitch of the drum.[1]\n\nratchet clutch system. A pedal on a pedal timpani with asystem.\n\nPedal timpani [ change | change source ]\n\nA pedal timpani is a timpani that uses a pedal to change its pitch. It is the kind of timpani that is used the most today. A player can push on the pedal to make the timpani play higher notes, or let the pedal come back up to play lower notes.[1] There are three different kinds of pedal timpani:\n\nIn a ratchet clutch system a player must pull back a lever called a clutch to release the pedal. Once the pedal is in the spot where the player wants it, they must push the clutch forward with their foot again to lock it in place.\n\nsystem a player must pull back a lever called a to release the pedal. Once the pedal is in the spot where the player wants it, they must push the clutch forward with their foot again to lock it in place. A balanced action system uses a spring that is attached to the pedal, which keeps the pedal in one spot until it is moved by a player. Since the pedal is not held in one spot by a clutch in a balanced action system, some people call it a floating pedal because it looks like the pedal is not held on by anything and is floating.\n\nuses a spring that is attached to the pedal, which keeps the pedal in one spot until it is moved by a player. Since the pedal is not held in one spot by a clutch in a balanced action system, some people call it a because it looks like the pedal is not held on by anything and is floating. In a friction clutch system, the pedal is held in one spot by a clutch, and the clutch is attached to a pole. When a player releases the clutch, the pole moves up and down as the pedal is pushed up and down.\n\nTimpani mallets [ change | change source ]\n\nA set of timpani mallets.\n\nTimpani are played with a special kind of drumstick called timpani mallets. A player uses two mallets at a time when they play the drum. The two parts of the mallet are called the shaft and the head. The head is the part of the mallet that is shaped like a circle, and is the part that hits the timpani, and the shaft is the wooden part of the mallet that is held by a timpanist. A timpani mallet's head can be made out of many things, but is usually made out of a wood sphere that is covered with felt or a thin cloth. The shaft of the mallet is usually made out of wood, like hickory, cherry, or bamboo, but can also be made out of metal, like aluminum. Some timpani mallets do not have a felt head, and just have a wooden one. These mallets are sometimes used in classical and baroque music.[3][4]\n\nIn the beginning of the 20th century, some mallets had shafts made out of whale bones and heads made out of sponges.[5]\n\nWith a pedal timpani, a player can produce different sound effects using the pedals. Performing glissando on timpani demands switching the pedals. Glissando is generated by pressing the pedal during the vertebra. Furthermore it is possible to play glissando at any volume level up or down. For example, Alexander Rahbari, an outstanding Iranian-Austrian composer used glissando effect produced by switching timpani pedals in the opening of his piece, Persian Mysticism Around G, where the player moves from Bb up to C and then rolling down to G(see the timpani part on right below).[6]\n\nRelated pages [ change | change source ]\n\nOther websites [ change | change source ]"}, {"url": "https://phamoxmusic.com/timpani-drum/", "page_content": "The Timpani Drum\n\nThe timpani drum is another musical instrument from the percussion family. It is made of vibrating skin on top of a kettle-shaped shell.\n\nA timpani is essentially a drum and a member of the membranophone family of instruments with a defined pitch. You play the timpani drum by striking the drum head with a mallet.\n\nThe timpani drum is popularly known as orchestral kettledrums and by other names like temple drums, timp-toms, or timps.\n\nIn the same sense, it is called timpano for a single drum and is known as pauken in German. The French called it timbales, and the Spanish called it timbals.\n\nThe word timpani actually evolved from Italy, which was the largest cultural center of that era. As a result, all the people who went to Italy for their studies developed the habit of calling the drums timpani.\n\nThis trend of calling the timpani drum “timpani” broadly continued until about 1600. Afterward, it became popular in the classical era. However, it is commonly called a kettle drum in English.\n\nThe drum has been part of the orchestra since the middle of the 17th century. Besides, timpani is often used in different forms of ensembles like marching bands, concert bands, rock bands, and many others.\n\nBrief History And Origin Of The Timpani Drum\n\nKlassischewienerpauken™ – Classical Viennese Timpani (source)\n\nThe timpani is a very old instrument and its origin can be traced back to ancient times. The ancient people Hebrews, Greeks, Egyptians, and others were known to have used percussion instruments much the same as the timpani.\n\nHistorically, the first use of this heavy percussion instrument was registered in ceremonies that have to do with religion by Hebrews. Also, there is a frame drum called tympanon in ancient Greek. Tympanon has a loud rumbling sound like today’s timpani. This was said to be the source of the word timpani we have today.\n\nThe Early Timpani Drum\n\nThe timpani was introduced to Europe in the 13th century during the series of religious wars between Crusaders and Saracens in the medieval period around 1095 and 1271.\n\nIn particular, the early timpani of the 13th century was of Saracenic origin and was known as ‘Nakers’ (naqqâra in Arabic). Nakers were generally pairs of kettledrums of the same size with a diameter of about 20 to 22centimeter.\n\nThey were not big as much and utilized the ahead tension technique that includes tightening ropes and sometimes with snares. Typically, they were different in size and general body structure compared to the modern timpani.\n\nThe Nakers\n\nThe Nakers drum\n\nThe body of nakers also known as draped kettledrums was like a bowl and made from materials like clay, wood, or metal. Nakers were normally attached to the waist of the player with the aid of straps and played with a pair of short wooden sticks.\n\nThe nakers eventually became the official symbol for the aristocracy and were used during musical entertainment. Furthermore, the nakers and the direct forebears of most timpani were also in use for encouragement in the tournament.\n\nThese nakers from Arab countries are normally played in military contexts. And they were also played to intensify the sounds of chaos in the battle. It is majorly known as the instrument that cavalry typically mounted at the back of a horse and played. This tradition of mounting them on the horse is peculiar to the Muslims, Ottoman Turks, Mongols.\n\nTimpani Drum in Europe\n\nHessische Barockpauken™ (Hessian Baroque Timpani) dating from approximately 1700 (Source)\n\nIn the 15th Century, the true kettle drums and ancestors of the orchestral timpani started to show up and later spread throughout Western Europe. In particular, it was a model for the King Ladislas V of Hungary to travel with the accompanied of the largest kettle drums known at that time.\n\nHowever, the kettle drum made a wave in Western Europe in 1457 when King Ladislaus V of Hungary sent a legation to the court of Charles VII in France. The legation he sent rode on horses with a large kettledrum mounted on their back to Charles’s court. Their kind of kettledrum has been in use since the 12th century in the Middle East.\n\nTimpani Drum in Britain\n\nMounted band of the Household Cavalry\n\nThe German aristocracy later adopted the drum from Hungary. And eventually, the kettle drum made its way into Britain at the request of King Henry VIII. The kettledrum actually evolved together with the trumpets to eventually become the typical instruments of the cavalry.\n\nIn fact, this practice of horse-mounted timpani continues till today in the British cavalry band. In addition, several military organizations in Europe started using kettledrum also known as timpani in the 15th century.\n\nIt was still during the 15th century that the kettledrum passed through a lot of technical improvements. Part of the improvement was the way the skin for the drum’s head is tension.\n\nIn detail, the bracing or nailing approach used to stretch the skin across the drum shell was replaced. They used the skins lapped on by a hoop approach instead.\n\nReconstruction of Timpani Drum in Europe\n\nTimpani also known as Kettle drum crafted by Antonio Stradivari\n\nPhoto: DEA Picture Library/De Agostini/Getty Images\n\nSome years after the appearance of timpani in Europe, the drum experienced a series of reconstructions. At the start of the 16th century, the German began the usage of screws to tension the skin of the kettle drum that normally stretched over a hoop.\n\nAgain, the method of screw-tensioning mechanism was developed around 1812 by the Munich court timpanist Gerhard Kramer. The mechanism connected all the screws to one particular screw called the master screw.\n\nTherefore, the skin tension and pitch of the drum could be changed by means of one handle or pedal. This method greatly transformed the skin tension and also the instrument pitch.\n\nAs a result, the kettledrums became tunable percussion instruments of definite pitch. And this screw-tension tuning mechanism continued extensively till the latter 19th century.\n\nTimpani Drum In Industrial Revolution Era\n\nThe Industrial Revolution in Europe and the United States empowered the new approach used in the construction of the kettledrums. It also established new materials used for the construction of the drum\n\nSpecifically, the new machine and pedal tuning mechanisms were established. The pedal tuning mechanisms were invented in Dresden, eastern German by C. Pittrich in the 1870s and are presently the standard for orchestral kettledrum. Thereafter, in the middle of the 20th century, the plastic heads were brought in by Remo.\n\nTimpani in European Military Court Festivities\n\nBy the 16th century, the kettledrum, also known as timpani, had been popular in European military regiments and in court festivities and dances. In truth, the kettledrum with the trumpets simply added much colour to the different ceremonials that have to do with the monarchy.\n\nTimpani Drum Adoption In Orchestra\n\nIn the 17th century, the popularity of the instrument kept growing in Europe. Subsequently, the drums found their way to the orchestra together with oboe, horn, and trumpet. By this time, they have developed to become a more robust instrument that need not be mounted on the horseback again.\n\nMoreover, by the following half of the 18th century, the timpani has been in a firm position as part of the orchestra instruments. As a matter of fact, timpani continued to be part of the orchestra instruments till today. Consequently, in every Western orchestra, the European timpani is always there.\n\nConstruction of The Timpani Drum\n\nThere are different ways of constructing timpani but the mode of their sound production is the same. For instance, the construction of Vienna timpani is not the same as ‘standard’ pedal timpani. However, the mode of their sound production remains the same.\n\nTimpani is known as a drum that produces pitched sounds. The mode of its construction is not like a normal drum. It is known that most drums have top and bottom skin for the vibration. Or sometimes a hollow body with an open bottom and covered head.\n\nThe timpani is designed and constructed to produce vibrations at integral heterogeneous frequencies. This mode of vibrations projects a pitched sound from the timpani. This is achieved by covering a large copper bowl with a unique bottom shape with a stretched skin.\n\nAlso, the shape of the timpani’s bowl or kettle is specially shaped to contribute to the drum’s timbre. For instance, it comes in a parabolic shape when a darker tone is required. On the other hand, it can be hemispheric when a brighter tone is desired.\n\nThe Timpani Drum Bowl\n\nSpecifically, copper is used for the timpani bowl because it is efficient in regulating its external and internal temperature. Other materials like aluminum and fiberglass are used to produce the instrument bowl. But they are not efficient in their internal and external temperature regulation as copper.\n\nThe Timpani Drum Head\n\nThe stretched skin is known as the drum-head or timpani head. The drum-heads are made traditionally from animal hide. Typically, goatskin or calfskin are used for the timpani head. However, modern timpani heads are made from different synthetic materials. Depending on how the timpani is used, it is necessary to change the head every one to two years.\n\nCounter Hoop And The Tension Rods\n\nThe skin is first attached to a ring metal called a hoop to make a flesh hoop. The flesh hoop is then attached to the bowl head by a counter hoop. The counter hoop is used to hold the flesh hoop firm on the bowl or kettle with the help of tension rods.\n\nThe tension rods are several tuning screws at a regular interval around the upper part of the drum bowl. According to the size of the timpani, the tension rods can be six or up to eight in number.\n\nThe tension on the stretched skin is adjusted by adjusting the tension rods. The rod is tightening to increase the tension and loosening to decrease the tension.\n\nThe Pedal\n\nThe construction of standard timpani made use of the pedal mechanism. The pedal is the mechanical part of the timpani and is very unique. The pedal is used to change the tension of the skin or drum-head with a leg.\n\nNormally, the construction of the pedal in standard timpani made use of the spider. The spider is an assembly of metal rods that connect the pedal to the tension rods. The diagram above shows the spider inside the bottom of the Yamaha pedal timpani.\n\nThe pedal made it very easy to adjust the tension of the counter hoop attached to the drum-head. By moving the pedal with your foot, the tension on the drum-head changes as well as the pitch of the drum.\n\nTo increase the tension of the drum-head, just press the pedal down. This movement will pull the counter hoop down and the tension on the drum-head will increase as well as the pitch of the drum. Release the pedal to lower the tension on the drum-head as well as the pitch of the drum.\n\nPlaying Of Timpani Drum\n\nHåkon Kartvedt playing timpani Concerto with Bergen Philharmonic Orchestra\n\nPlaying Timpani required a lot of tough techniques and mastery. However, the player or the timpanist basically plays the instrument by striking the drum head with a mallet.\n\nTo play the instrument, the drums should be arranged properly in order to form the timpani console. This is done by arranging the drums in an arc form around the timpanist. The drum can be set up serially with the highest-pitched drum on the left and the lowest-pitched drum on the right.\n\nThis method is commonly used by Greek, Austrian, and German timpanists. Notwithstanding, the drum can be set in reverse order to have the highest-pitched on the right and lowest-pitched on the left. This is the traditional method of French, British, and American timpanists.\n\nMallet for playing the drum\n\nMallet is a special beater used for playing timpani. It has a soft head attached to a slim shaft and is also known as the timpani stick. The mallet shaft is made of hardwood, bamboo, synthetic material like carbon fiber or fiberglass, sometimes aluminum.\n\nA rounded head of the mallet is normally covered in felt. Notwithstanding, other materials like leather, cork, and compressed felt are sometimes used. And it comes in two basic types which are the cartwheel mallet and the ball stick mallet.\n\nFurthermore, the type of material used for the mallet’s head has a significant effect on the quality of sound produced. For instance, the mallet covered with harder felt produced sound quality that is totally different when soft felt is used.\n\nThis is one of the reasons timpanists change the mallet during the performance to match the style in the piece of the music.\n\nGrips in playing the drums\n\nTimpani French Grrip\n\nThe grips are the way mallets used to play the instrument are held. This aspect of playing the drum influenced the lift and other aspects of paying.\n\nTypically, German and French grips are the most common grips used to lay the instrument. The third and not common grip is the American grip which is the hybrid of both German and French grips.\n\nUsing the German rip means you position the palms parallel to the drum head. The German grip is very similar to the matched grip used in snare drum playing. This grip seems to be heavy and booming because of the physical inclination to play a down stroke from that mallet position.\n\nAnd with the French grip, your palms face each other while your fingers basically move the mallet shaft. Also, the thumb will face up with this grip. The French grip can serve as a possible choice to the German grip in order to produce a lighter sound. It has a very different way of using a wrist when compared to the German grip.\n\nSound Production Techniques In Timpani\n\nDallas Symphony Orchestra principal timpanist Brian Jones, doing his thing. Photo by: Tracy Martin\n\nThis method of producing musical sound from the instrument is very easy. However, it takes good technique to produce a quality sound which is very essential in playing the instrument. For instance, the ability to strike the right playing spot on the timpani is very important.\n\nAnother method used to produce quality sound on timpani is proper stroke. This is also part of striking the drum but with a tossing motion and a natural bounce back. The method is actually a key concept to achieve a quality note.\n\nThe best notes are produced on well-tuned timpani by combining the proper stroke with a correct striking point on the drum-head. A good stroke is essential for proper articulation of the notes. Because a good stroke will draw the sound from the drum-head for proper articulation.\n\nThe two techniques can be achieved by either German grip also known as a matched grip or French grip. Besides the right beating spot and stroking the other techniques used to produce quality sound in timpani are tuning and muffling.\n\nStriking The Drum\n\nGood sound quality can be achieved in timpani by striking the correct spot on the drum. This is paramount because the place at which the mallet strikes the drumhead has an effect on the quality of sound played.\n\nThe best spot used by the player is around 10cm (4 inches) from the drum’s edge. When the instrument is correctly struck at the right spot, it produces a well resonated and round sound peculiar to the drum.\n\nMoreover, applying a proper stroke with a good tossing motion and a natural rebound is the key concept to achieve a quality tone. On the other hand, playing towards the edge of the drum will affect the quality of the tone. This is possible without tuning the instrument or switching the mallets.\n\nALSO READ: What You Need To Know About The Cello\n\nIn addition, striking the drum on the spot closer to the edge creates a sound with thinner quality. Also, striking the drum at a spot closer to the center lessens the drum sound sustainability.\n\nSome music scores can have a ‘tr’ marked for players to trill or roll the drum. The trill is performed with the mallet a few distances apart in order to create a more sustained sound. And at the same time varying the speed of the stroke on the instrument.\n\nThe speed of the trill stroke is influenced by the pitch of the drum pitch. The higher-pitched drum receives a quicker stroke compared to the lower-pitched drum.\n\nAnd to achieve a better staccato sound, players strike the drum closer to the center of the drum. They also adjust the speed of the stroke to achieve a more staccato sound.\n\nTuning The Sound\n\nThe timpanist is required to tune the drum before the performance. This aspect of timpani is very important because the instrument can only be used for performance when it is well-tuned. Therefore, to play timpani, you must be able to tune the instrument.\n\nThe first thing in tuning the drum is to clear the heads of the drum. This means that every spot on the edge of the drum must be equal in tension and known pitch. This is necessary to prevent the drum from producing dissimilar pitches at different dynamic levels.\n\nMoreover, the timpanist should know the pitch the drum is turning to. The pitch needs to be established before the tuner can definitely match it. Thereafter, the proper drum is chosen for the established pitch. Then the pedal is adjusted to a position a bit lower than where the established pitch should be.\n\nThereafter, the drum is tested by using the finger to tap it lightly and consistently adjust the pedal. When the current pitch on the drum matches the established pitch, the tuner will stop adjusting the pedal.\n\nMarkus Rhoten, the New York Philharmonic Principal Timpanist, shows how to properly tune the timpani in the video.\n\nThe Tuning Drum Gauge\n\nTimpani with the tuning gauge specifies the pitch with a visual indicator. This gauge is attached to the counter hoop and pedal mechanics and is accurate when used correctly.\n\nBut it may not be accurate if the drums are really disturbed. For example, transporting them to a distant place. The atmospheric condition can also affect the pitch of the drums as well. In particular, the temperature and humidity of the room can change the pitch of the drum and affect the gauge.\n\nThe tuning gauge is very useful for fast tuning during the performance. But the timpanist needs a technique to tune the drum accurately during the performance without making its sound known to others. First and foremost, he needs a relative pitch skill to get the job done perfectly.\n\nPedaling and Portamento\n\nThe two terms are used when timpani’s pedal is used to change the pitch of the drum during a performance. Pedaling is basically the usage of the pedal to change the pitch and also means tuning.\n\nGenerally, pedaling means changing of the pitch during the performance. The timpani pedaling etude here shows how player will change the pedal to adjust the tone of the instrument.\n\nOn the other hand, portamento is a performance style that asks you to slide the pitch from one note to the other. This effect of portamento can be heard during the performance. It is very similar to glissando.\n\nMuffling Technique\n\nThis is a technique used in playing timpani for stopping a ringing drum. Muffling is also known as damping and means to stop the ringing drum when it strikes. Muffling is an important technique to master in playing the timpani.\n\nThe muffling can be done by the freehand or the same hand that struck the drum. It is a good idea to do the muffling with the freehand. But it’s a best practice to use the same hand that strikes the drum to do the muffling. Learning how to do muffling both ways is required.\n\nIn the process of muffling the drum, the player’s fifth, fourth, and third fingers spread out under the stick. And the upper part of the fingers will land on the drum-head. This will completely stop the drum from ringing or diminish it.\n\nAlso, the drum can be dampened as silently as possible by dropping the fingers on the drum-head from a position only somewhat above it.\n\nTimpani Drum In Music Performance\n\nTimpani is often played in groups and four sets of timpani are commonly used in most orchestras. These four sets are typically in different sizes, also tuned to different pitches, and usually played by one person known as a timpanist.\n\nActually, four sets of timpani are peculiar to the romantic and modern works while in the Classical period the standard is one pair. Timpani is normally played by striking the drum-head with a specially designed timpani mallet or timpani stick.\n\nFor orchestra performance, the music notes for timpani are normally written in a staff notation just like that of a piano. And the notes are written on the bass clef of the staff notation.\n\nAt Phamox Music, we go all out for exactness and honesty. For this purpose, if by any means you found any possible glitch, be it factual, editorial, or something that we need to update, kindly contact us.\n\nIf you find the information provided in this post, Timpani Drum, interesting and helpful, kindly share it with someone you know that might need it.\n\nShare"}, {"url": "https://infogalactic.com/info/Timpani", "page_content": "From Infogalactic: the planetary knowledge core\n\n\"Kettledrum\" redirects here. For the racehorse, see Kettledrum (horse) . For the informal afternoon tea gathering, see tea party\n\nTimpani (;[2] Italian pronunciation: [ˈtimpani]), or kettledrums (also informally called timps),[2] are musical instruments in the percussion family. A type of drum, they consist of a skin called a head stretched over a large bowl traditionally made of copper. They are played by striking the head with a specialized drum stick called a timpani stick or timpani mallet. Timpani evolved from military drums to become a staple of the classical orchestra by the last third of the 18th century. Today, they are used in many types of musical ensembles, including concert bands, marching bands, orchestras, and even in some rock.\n\nTimpani is an Italian plural, the singular of which is timpano. However, in informal English speech a single instrument is rarely called a timpano: several are more typically referred to collectively as kettledrums, timpani, temple drums, or simply timps. They are also often incorrectly termed timpanis. A musician who plays the timpani is a timpanist.\n\nEtymology and alternative spellings\n\nFirst attested in English in the late 19th century, the Italian word timpani derives from the Latin tympanum (pl. tympana), which is the latinisation of the Greek word τύμπανον (tumpanon, pl. tumpana), \"a hand drum\",[3] which in turn derives from the verb τύπτω (tuptō), meaning \"to strike, to hit\".[4] Alternative spellings with y in place of either or both is—tympani, tympany, or timpany—are occasionally encountered in older English texts. Although the word timpani has been widely adopted in the English language, some English speakers choose to use the word kettledrums.[5] The German word for timpani is Pauken; the French and Spanish is timbales. The Ashanti pair of talking drums are known as atumpan.\n\nThe tympanum is defined in the Etymologiae of St. Isidore of Seville:\n\nTympanum est pellis vel corium ligno ex una parte extentum. Est enim pars media symphoniae in similitudinem cribri. Tympanum autem dictum quod medium est. Unde, et margaritum medium tympanum dicitur, et ipsum ut symphonia ad virgulam percutitur.\n\nThe tympanum is [an instrument made of] skin or hide stretched over a hollow wooden vessel which extends out. It is said by the symphonias to resemble a sieve, but has also been likened to half a pearl. It is struck with a wand [stick], beating time for the symphonia.\n\nThe reference comparing the tympanum to half a pearl is borrowed from Pliny the Elder.[6]\n\nConstruction\n\nThey are usually put together by hand in the southern region of France, and at one time were tightened together by horses tugging from each side of the drum by the bolts. The Industrial Revolution made that construction style obsolete and paved the way for more modern building methods.\n\nBasic timpani\n\nThe basic timpani drum consists of a drumhead stretched across the opening of a bowl typically made of copper[7] or, in less expensive models, fiberglass and sometimes aluminum. In the Sachs–Hornbostel classification, the timpani are thus considered membranophones. The drumhead is affixed to a hoop (also called a fleshhoop),[5] which in turn is held onto the bowl by a counterhoop,[5] which is then held by means of a number of tuning screws called tension rods placed regularly around the circumference. The head's tension can be adjusted by loosening or tightening the rods. Most timpani have six to eight tension rods.[7]\n\nThe shape of the bowl contributes to the quality of the drum. For example, hemispheric bowls produce brighter tones while parabolic bowls produce darker tones.[8] Another factor that affects the timbre of the drum is the quality of the bowl's surface. Copper bowls may have a smooth, machined surface or a rough surface with many small dents hammered into it.\n\nTimpani come in a variety of sizes from about 84 centimeters (33 inches) in diameter down to piccoli timpani of 30 centimeters (12 inches) or less.[5] A 33-inch drum can produce the C below the bass clef, and specialty piccoli timpani can play up into the treble clef. In Darius Milhaud's 1923 ballet score La création du monde, the timpanist must play the F sharp at the bottom of the treble clef.\n\nEach individual drum typically has a range of a perfect fifth.[5]\n\nMachine timpani\n\nChanging the pitch of a timpani by turning each tension rod individually is a laborious process. In the late 19th century, mechanical systems to change the tension of the entire head at once were developed. Any timpani equipped with such a system may be considered machine timpani, although this term commonly refers to drums that use a single handle connected to a spider-type tuning mechanism.[7]\n\nPedal timpani\n\nBy far, the most common type of timpani used today is the pedal timpani, which allows the tension of the head to be adjusted using a pedal mechanism. Typically, the pedal is connected to the tension screws via an assembly of either cast metal or metal rods called the spider.\n\nDresden timpano – the clutch (seen here on the left) must be disengaged to change the pitch of the drum. A pedal on atimpano – the clutch (seen here on the left) must be disengaged to change the pitch of the drum.\n\nThe inside, bottom of a Yamaha pedal timpani, showing the mechanical tension-adjusting system\n\nThere are three types of pedal mechanisms in common use today:\n\nThe ratchet clutch system uses a ratchet and pawl to hold the pedal in place. The timpanist must first disengage the clutch before using the pedal to tune the drum. When the desired pitch is achieved, the timpanist must then reengage the clutch. Because the ratchet engages in only a fixed set of positions, the timpanist must fine tune the drum by means of a fine tuning handle.\n\nsystem uses a ratchet and pawl to hold the pedal in place. The timpanist must first disengage the clutch before using the pedal to tune the drum. When the desired pitch is achieved, the timpanist must then reengage the clutch. Because the ratchet engages in only a fixed set of positions, the timpanist must fine tune the drum by means of a fine tuning handle. In the balanced action system, a spring or hydraulic cylinder is used to balance the tension on the timpani head so that the pedal will stay in position and the head will stay at pitch. The pedal on a balanced action drum is sometimes called a floating pedal since there is no clutch holding it in place.\n\nsystem, a spring or hydraulic cylinder is used to balance the tension on the timpani head so that the pedal will stay in position and the head will stay at pitch. The pedal on a balanced action drum is sometimes called a since there is no clutch holding it in place. The friction clutch or post and clutch system uses a clutch that moves along a post. Disengaging the clutch frees it from the post, allowing the pedal to move without restraint.\n\nProfessional level drums use either the ratchet or friction system and have copper bowls. These drums can have one of two styles of pedals. The Dresden pedal is attached to the drum at the side nearest the player, and is operated by ankle motion. A Berlin-style pedal is attached by means of a long arm to the opposite side of the drum, and the timpanist must use his entire leg to adjust the pitch. In addition to a pedal, high-end instruments have a hand-operated fine tuner, which allows the timpanist to make minute pitch adjustments. The pedal is on either the left or right side of the drum depending on where it is set up.\n\nMost school bands and orchestras below a university level use less expensive, more durable timpani with either copper, fiberglass, or aluminum bowls. The mechanical parts of these instruments are almost completely contained within the frame and bowl of the drum. They may use any of the pedal mechanisms, though the balanced action system is by far the most common, followed by the friction clutch system. Many professionals also use these drums for outdoor performances due to their durability and lighter weight. The pedal is in the center of the drum itself.\n\nChain timpani\n\nOn chain timpani, a chain links the tension rods so a master handle can be used to turn them all at once.\n\nOn chain timpani, the tension rods are connected by a roller chain much like the one found on a bicycle, though some manufacturers have used other materials, including steel cable. In these systems, all the tension screws can then be tightened or loosened by one handle. Though far less common than pedal timpani, chain and cable drums still have practical uses. Occasionally, a player is forced to place a drum behind other items so that he cannot reach it with his foot. Professional players may also use exceptionally large or small chain and cable drums for special low or high notes.\n\nOther tuning mechanisms\n\nA rare tuning mechanism allows the pitch of the head to be changed by rotating the drum itself. A similar system is used on rototoms. Jenco, a company better known for mallet percussion, made timpani tuned in this fashion.\n\nIn the early 20th century, Hans Schnellar, the timpanist of the Vienna Philharmonic, developed a tuning mechanism in which the bowl is moved via a handle that connects to the base, and the head remains stationary. These drums are referred to as Viennese timpani (Wiener Pauken) or Schnellar timpani.[9] Adams Musical Instruments developed a pedal-operated version of this tuning mechanism in the early 21st century.\n\nTimpani heads\n\nLike most drumheads, timpani heads can be made from two materials: animal skin (typically calfskin or goatskin)[5] and plastic (typically PET film). Plastic heads are durable, weather resistant, and relatively inexpensive. Thus, they are more commonly used than natural skin heads. However, many professional players prefer skin heads because they produce a warmer quality timbre. Timpani heads are sized based on the size of the head, not the size of the timpani bowl. For example, a 23\" drum may require a 25\" head. This 2\" size difference has been standardized by most timpani manufactures since 1978.[10]\n\nSticks and mallets\n\nTimpanists use a variety of timpani sticks since each stick produces a different timbre\n\nTimpani are typically struck with a special type of drum stick fittingly called a timpani stick or timpani mallet. Timpani sticks are used in pairs. They have two components: a shaft and a head. The shaft is typically made from hardwood or bamboo but may also be made from aluminum or carbon fiber. The head of the stick can be constructed from a number of different materials, though felt wrapped around a wood core is the most common. Other core materials include compressed felt, cork, and leather, and other wrap materials include chamois. Unwrapped sticks with heads of wood, felt, flannel, and leather are also common.[5] Wood sticks are used as a special effect—specifically requested by composers as early as the Romantic era—and in authentic performances of Baroque music.\n\nAlthough not usually stated in the score, timpanists will change sticks—the same piece—to suit the nature of the music. However, the choice of stick during a performance is entirely subjective and depends on the timpanist's own preference and occasionally the wishes of the conductor. Thus, most timpanists own a great number of mallets.[5] The weight of the stick, the size and latent surface area of the head, the materials used for the shaft, core, and wrap, and the method used to wrap the head all contribute to the timbre the stick produces.[11]\n\nIn the early 20th century and before, sticks were often made with whalebone shafts, wood cores, and sponge wraps. Composers of that era often specified sponge-headed sticks. Modern timpanists execute such passages with standard felt mallets.\n\nPopular grips\n\nThe two most common grips in playing the timpani are the German and French grips. In the German grip, the palm of the hand should be parallel to the drum head and the thumb should be on the side of the stick. In the French grip, the palm of the hand should be close to perpendicular with drum head and the thumb should be on top of the stick. In both of these styles, as with most percussion grips, the fulcrum consists of the contact between the thumb and middle finger. The index finger is used as a guide and to help lift the stick off of the drum.[12] The American grip is a hybrid of these two grips. Another known grip is known as the Amsterdam Grip, made famous by the Royal Concertgebouw Orchestra, which is similar to the Hinger grip, except the stick is cradled on the lower knuckle of the index finger.\n\nIn the modern ensemble\n\nA standard set of timpani consists of four drums.\n\nA set of timpani\n\nA standard set of timpani (sometimes called a console) consists of four drums: roughly 32 inches (81 cm), 29 inches (74 cm), 26 inches (66 cm), and 23 inches (58 cm) in diameter.[13] The range of this set is roughly the D below the bass clef to the top-line bass clef A. A great majority of the orchestral repertoire can be played using these four drums. However, contemporary composers have written for extended ranges. Igor Stravinsky specifically writes for a piccolo timpano in The Rite of Spring, tuned to the B below middle C. A piccolo drum is typically 20 inches (51 cm) in diameter and can reach pitches up to middle C.\n\nBeyond this extended set of five instruments, any added drums are nonstandard. (Luigi Nono's Al gran sole carico d'amore requires as many as eleven drums, with actual melodies played on them in octaves by two players.) Many professional orchestras and timpanists own more than just one set of timpani, allowing them to execute music that cannot be more accurately performed using a standard set of four or five drums and music that requires more than one set of timpani.\n\nMany schools and ensembles unable to afford purchase of this equipment regularly rely on a set of two or three timpani, sometimes referred to as \"the orchestral three\".[5] It consists of 29-inch (74 cm), 26-inch (66 cm), and 23-inch (58 cm) drums. Its range extends down only to the F below the bass clef.\n\nThe drums are set up in an arc around the performer. Traditionally, North American, British, and French timpanists set their drums up with the lowest drum on the left and the highest on the right (commonly called the American system), while German, Austrian, and Greek players set them up in the reverse order, as to resemble a drum set or upright bass. (the German system).[5] This distinction is not strict, as many North American players use the German setup and vice versa.\n\nTimpanists\n\nBalanced action timpani are often used in outdoor performances because of their durability.\n\nThroughout their education, timpanists are trained as percussionists, and they learn to play all instruments of the percussion family along with timpani. However, when appointed to a principal timpani chair in a professional ensemble, a timpanist is not normally required to play any other instruments. In his book Anatomy of the Orchestra, Norman Del Mar writes that the timpanist is \"king of his own province\", and that \"a good timpanist really does set the standard of the whole orchestra.\" A qualified member of the percussion section sometimes doubles as associate timpanist, performing in repertoire requiring multiple timpanists and filling in for the principal timpanist when required.\n\nAmong the professionals who have been highly regarded for their virtuosity and impact on the development of the timpani in the 20th century are Saul Goodman, Hans Schnellar, Fred Hinger, and Cloyd Duff.[14][15][16]\n\nBurleske 220px Burleske begins with the main theme played on the timpani. Richard Strauss 'sbegins with the main theme played on the timpani. Problems playing this file? See media help.\n\nTimpani concertos\n\nA few concertos have been written for timpani. The 18th-century composer Johann Fischer wrote a symphony for eight timpani and orchestra, which requires the solo timpanist to play eight drums simultaneously. Rough contemporaries Georg Druschetzky and Johann Melchior Molter also wrote pieces for timpani and orchestra.\n\nThroughout the 19th century and much of the 20th, there were few new timpani concertos. In 1983, William Kraft, principal timpanist of the Los Angeles Philharmonic, composed his Concerto for Timpani and Orchestra, which won second prize in the Kennedy Center Friedheim Awards. There have been other timpani concertos, notably, Philip Glass, considered one of the most influential composers of the late 20th century,[17] wrote a double concerto at the behest of soloist Jonathan Haas titled Concerto Fantasy for Two Timpanists and Orchestra, which features its soloists playing nine drums apiece. [18]\n\nPerformance techniques\n\nStriking the drum\n\nFor general playing, a timpanist will beat the head approximately 4 inches in from the edge.[13] Beating at this spot produces the round, resonant sound commonly associated with timpani. A timpani roll (most commonly signaled in a score by tr) is executed by rapidly striking the drum, alternating between left and right sticks, extending the duration of the sound as required and allowing increases or decreases in volume. Anton Bruckner's 7th Symphony requires a continuous roll on a single drum for over two-and-a-half minutes. In general, timpanists do not use multiple bounce rolls like those played on the snare drum, as the soft nature of timpani sticks causes the rebound of the stick to be reduced, causing multiple bounce rolls to sound muffled.[5]\n\nThe tone quality of the drum can be altered without switching sticks or adjusting the tuning of the drum. For example, by playing closer to the edge of the head, the sound becomes thinner.[5] A more staccato sound can be produced by changing the velocity of the stroke or playing closer to the center of the head. There are many more variations in technique a timpanist uses during the course of playing to produce subtle timbral differences.\n\nTuning\n\nPrior to playing the instruments, the timpanist must clear the heads by equalizing the tension at each tuning screw. This is done so every spot on the head is tuned to exactly the same pitch. When the head is clear, the timpani will produce a beautiful, in-tune sound. If the head is not clear, the pitch of the drum will rise or fall after the initial impact, and the drum will produce different pitches at different dynamic levels. Timpanists are required to have a well-developed sense of relative pitch, and must develop techniques to tune undetectably and accurately in the middle of a performance. Tuning is often tested with a light tap from a single finger, which produces a near-silent note that nonetheless matches the tune of the drum when struck with a mallet.\n\nSome timpani are equipped with tuning gauges, which provide a visual indication of the drum's pitch. They are physically connected either to the counterhoop, in which case the gauge indicates how far the counterhoop is pushed down, or the pedal, in which case the gauge indicates the position of the pedal. These gauges are accurate when used correctly. However, when the instrument is disturbed in some fashion (transported, for example), the overall pitch of the head can change, thus the markers on the gauges may not remain reliable unless they have been adjusted immediately preceding the performance. The pitch of the head can also be changed by room temperature and humidity. This effect also occurs due to changes in weather, especially if an outside performance is to take place. Gauges are especially useful when performing music that involves fast tuning changes that do not allow the player to listen to the new pitch before playing it. Even when gauges are available, good timpanists will check their intonation by ear before playing.\n\nOccasionally, players use the pedals to retune a drum while playing it. Portamento effects can be achieved by changing the pitch of the drum while it can still be heard. This is commonly called a glissando, though this use of the term is not strictly correct. The most effective glissandos are those from low notes to high notes and those performed during rolls. One of the first composers to call for a timpani glissando was Carl Nielsen, who used two sets of timpani, both playing glissandos at the same time, in his Symphony No. 4 (\"The Inextinguishable\").\n\nPedaling refers to changing the pitch of the drum with the pedal; it is an alternate term for tuning. In general, timpanists reserve this term for passages where the performer must change the pitch of a drum in the midst of playing – for example, playing two consecutive notes of different pitches on the same drum. Early 20th-century composers such as Nielsen, Béla Bartók, Samuel Barber, and Richard Strauss took advantage of the freedom pedal timpani afforded, often giving the timpani the bass line.\n\nIntermezzo interrotto movement of This chromatic passage from themovement of Bartók 's Concerto for Orchestra requires the timpanist to use the pedals to play all the pitches. One way of executing this passage is annotated here: The lowest and highest drum stay on F and E-flat, respectively. All pedaling is executed on the middle two drums. Each pedal change is indicated by a colored line: red for the larger and blue for the smaller of the middle drums.\n\nMuffling\n\nSince timpani have a long sustain, muffling or dampening is an inherent part of playing timpani. Often, timpanists will muffle notes so they only sound for the length indicated by the composer. However, early drums did not resonate nearly as long as modern timpani, so composers often wrote a note when the timpanist was to hit the drum without concern of sustain. Today, timpanists must use their ear and the score of the piece to determine the actual length the note should sound.\n\nThe typical method of muffling is to place the pads of the fingers against the head while holding onto the timpani stick with the thumb and index finger. Timpanists are required to develop techniques to stop all vibration of the drumhead without making any sound from the contact of their fingers.[13]\n\nMuffling is often referred to as muting, which can also refer to playing the drums with mutes on them (see below).\n\nExtended techniques\n\nIt is typical for only one timpano to be struck at a time, but occasionally composers will ask for two notes to be struck at once. This is called a double stop, a term borrowed from the string instrument vocabulary. Ludwig van Beethoven uses this effect in the slow movement of his Ninth Symphony, as do Johannes Brahms in the second movement of his German Requiem and Aaron Copland in El Salón México.\n\nSome modern composers occasionally require more than two notes at once. In this case, a timpanist can hold two sticks in one hand much like a marimba performer would, or more than one timpanist can be employed. In his Overture to Benvenuto Cellini, for example, Hector Berlioz realizes fully voiced chords from the timpani section by requiring three timpanists and assigning one drum to each. He goes as far as ten timpanists playing three- and four-part chords on sixteen drums in his Requiem, although with the introduction of pedal tuning, this number can be reduced.\n\nModern composers will often specify the beating spot to alter the sound of the drum. When the timpani are struck directly in the center of the head, the drums have a sound that is almost completely devoid of tone and resonance. George Gershwin uses this effect in An American in Paris. Struck close to the edge, timpani produce a very thin, hollow sound. This effect is used by composers such as Bartók, Bernstein, and Kodály.\n\nA variation of this is to strike the head while two fingers of one hand lightly press and release spots near the center. The head will then vibrate at a harmonic, much like the similar effect on a string instrument.\n\nResonance can cause drums not in use to vibrate, causing a more quiet sound to be produced. Timpanists must normally avoid this effect, called sympathetic resonance, but composers have exploited it in solo pieces such as Elliot Carter's Eight Pieces for Four Timpani. Resonance is reduced by damping or muting the drums, and in some cases composers will specify that timpani be played con sordino (with mute) or coperti (covered), both of which indicate that mutes—typically small pieces of felt or leather—should be placed on the head.\n\nComposers will sometimes specify that the timpani should be struck with implements other than timpani sticks. It is common in timpani etudes and solos for performers to play with their hands or fingers. Philip Glass's \"Concerto Fantasy\" utilizes this technique during a timpani cadenza. Also, Michael Daugherty's \"Raise The Roof\" calls for this technique to be used for a certain passage. Leonard Bernstein calls for maracas on timpani in both the \"Jeremiah\" Symphony and Symphonic Dances from West Side Story. Edward Elgar attempts to use the timpani to imitate the engine of an ocean liner in his \"Enigma\" Variations by requesting the timpanist play a soft roll with snare drum sticks. However, snare drum sticks tend to produce too loud a sound, and since this work's premiere, the passage in question has been performed by striking the timpani with coins. Benjamin Britten asks for the timpanist to use drum sticks in his War Requiem to evoke the sound of a field drum.\n\nRobert W. Smith's Songs of Sailor and Sea calls for a \"whale sound\" on the timpani. This is achieved by moistening the thumb and rubbing it from the edge to the center of the drumhead. Amongst other techniques used primarily in solo work, such as John Beck's Sonata for Timpani, is striking the copper bowls. Timpanists tend to be reluctant to strike the bowls at loud dynamic levels or with hard sticks, since copper can be dented easily due to its soft nature.\n\nOn some occasions a composer may ask for a metal object, commonly an upside-down cymbal, to be placed upon the drumhead and then struck or rolled while executing a glissando on the drum. Joseph Schwantner used this technique in From A Dark Millennium. Carl Orff asks for cymbals resting on the drumhead while the drum is struck in his later works. Additionally, Michael Daugherty, in his concerto \"Raise The Roof,\" utilizes this technique.\n\nHistory\n\nPre-orchestral history\n\nIt has been said that the first recorded use of early Tympanum was in \"ancient times when it is known that they were used in religious ceremonies by Hebrews.\"[13]\n\nThe Moon of Pejeng, also known as the Pejeng Moon,[19] in Bali, the largest single-cast bronze kettle drum in the world,[20] is more than two thousand years old.[21] The Moon of Pejeng is \"the largest known relic from Southeast Asia's Bronze Age period. According to Balinese legend, the Pejeng Moon was a wheel of the chariot that pulled the real moon through the night sky. One night, as the chariot was passing over Pejeng, the wheel detached and fell to earth, landing in a tree, where it glowed nearly as brightly as the real moon. This light disturbed a thief who, annoyed, climbed the tree and urinated on it; the thief paid for his sacrilege with his life. The moon eventually cooled and has been preserved as a sacred relic by the local villagers.[22] The drum is in the Pura Penataran Asih temple.\"[23]\n\nIn 1188, Cambro-Norman chronicler Gerald of Wales wrote, \"Ireland uses and delights in two instruments only, the harp namely, and the tympanum.\"[24]\n\nArabian nakers, the direct ancestors of most timpani, were brought to 13th-century Continental Europe by Crusaders and Saracens.[7] These drums, which were small (with a diameter of about 20–22 cm or 8–8½ in) and mounted to the player's belt, were used primarily for military ceremonies. This form of timpani remained in use until the 16th century.\n\nIn 1457, a Hungarian legation sent by King Ladislaus V carried larger timpani mounted on horseback to the court of King Charles VII in France. This variety of timpani had been used in the Middle East since the 12th century. These drums evolved together with trumpets to be the primary instruments of the cavalry. This practice continues to this day in sections of the British Army, and timpani continued to be paired with trumpets when they entered the classical orchestra.\n\nOver the next two centuries, a number of technical improvements were made to timpani. Originally, the head was nailed directly to the shell of the drum. In the 15th century, heads began to be attached and tensioned by a counterhoop that was tied directly to the shell. In the early 16th century, the bindings were replaced by screws. This allowed timpani to become tunable instruments of definite pitch.[5]\n\nTimpani in the orchestra\n\nJean-Baptiste Lully is the first known composer to have scored for timpani, which he included in the orchestra for his 1675 opera Thésée. (Earlier uses were likely, but poorly documented.) Other 17th-century composers soon followed suit.\n\nLater in the Baroque era, Johann Sebastian Bach wrote a secular cantata titled \"Tönet, ihr Pauken! Erschallet, Trompeten!\", which translates roughly to \"Sound off, ye timpani! Sound, trumpets!\" Naturally, the timpani are placed at the forefront: the piece starts with a timpani solo and the chorus and timpani trade the melody back and forth. Bach reworked this movement in part 1 of the Christmas Oratorio.\n\nAlthough by the early 19th century, timpani were most commonly found in orchestras, ceremonial trumpet and timpani ensembles still existed.\n\nLudwig van Beethoven revolutionized timpani music in the early 19th century. He not only wrote for drums tuned to intervals other than a fourth or fifth, but he gave a prominence to the instrument as an independent voice beyond programmatic use (as in Bach's \"Tönet, ihr Pauken!\"). For example, his Violin Concerto (1806) opens with four solo timpani strokes, and the scherzo of his Ninth Symphony (1824) sets the timpani against the orchestra in a sort of call and response.[25]\n\nThe next major innovator was Hector Berlioz. He was the first composer to indicate the exact sticks that should be used – \"felt-covered\", \"wooden\", etc. In several of his works, including Symphonie fantastique (1830), and his Requiem (1837), he demanded the use of several timpanists at once.[13]\n\nUntil the late 19th century, timpani were hand-tuned; that is, there was a sequence of screws with T-shaped handles, called taps, which altered the tension in the head when turned by players. Thus, tuning was a relatively slow operation, and composers had to allow a reasonable amount of time for players to change notes if they were called to tune in the middle of a work. The first 'machine' timpani, with a single tuning handle, was developed in 1812.[26] The first pedal timpani originated in Dresden in the 1870s and are called Dresden timpani for this reason.[7] However, since vellum was used for the heads of the drums, automated solutions were difficult to implement since the tension would vary unpredictably across the drum. This could be compensated for by hand-tuning, but not easily by a pedal drum. Mechanisms continued to improve in the early 20th century.\n\nDespite these problems, composers eagerly exploited the opportunities the new mechanism had to offer. By 1915, Carl Nielsen was demanding glissandos on timpani in his Fourth Symphony—impossible on the old hand-tuned drums. However, it took Béla Bartók to more fully realize the flexibility the new mechanism had to offer. Many of his timpani parts require such a range of notes that it would be unthinkable to attempt them without pedal drums.\n\nIn the 17th and 18th centuries, timpani were almost always tuned with the dominant note of the piece on the low drum and the tonic on the high drum – a perfect fourth apart. Until the early 19th century the dominant (the note of the large drum) was written as G and the tonic (the note of the small drum) was written as C no matter what the actual key of the work was, and whether it was major or minor, with the actual pitches indicated at the top of the score (for example, Timpani in D–A for a work in D major or D minor).[7] This notation style however was not universal: Bach, Mozart, and Schubert (in his early works) used it, but their respective contemporaries Handel, Haydn, and Beethoven wrote for the timpani at concert pitch.[27] Today, even though they're written at concert pitch, timpani parts continue to be most often[28] but not always[29] written with no key signature, no matter what key the work is in: accidentals are written in the staff, both in the timpanist's part and the conductor's score.\n\nTimpani outside the orchestra\n\ngrounded with legs extended. This 1976 photograph shows marching timpaniwith legs extended.\n\nLater, timpani were adopted into other classical music ensembles such as concert bands. In the 1970s, marching bands and drum and bugle corps, which evolved both from traditional marching bands and concert bands, began to include marching timpani. Unlike concert timpani, marching versions had fiberglass shells to make them light enough to carry. Each player carried a single drum, which was tuned by a hand crank. Often, during intricate passages, the timpani players would put their drums on the ground by means of extendable legs, and performed more like conventional timpani, yet with a single player per drum. In the late 1970s and early 1980s, marching arts-based organizations' allowance for timpani and other percussion instruments to be permanently grounded became mainstream. This was the beginning of the end for marching timpani: Eventually, standard concert timpani found their way onto the football field as part of the front ensemble, and marching timpani fell out of common usage.\n\nTimpani are still used by the Mounted Bands of the Household Division of the British Army.[30]\n\nAs rock and roll bands started seeking to diversify their sound, timpani found their way into the studio. In 1959 Leiber and Stoller made the innovative use of timpani in their production of the Drifters' recording, \"There Goes My Baby.\" Starting in the 1960s, drummers for high-profile rock acts like The Beatles, Led Zeppelin, The Beach Boys, and Queen incorporated timpani into their music. This led to the use of timpani in progressive rock. Emerson, Lake & Palmer recorded a number of rock covers of classical pieces that utilize timpani. More recently, the rock band Muse has incorporated timpani into some of their classically based songs, most notably in Exogenesis: Symphony, Part I (Overture).\n\nJazz musicians also experimented with timpani. Sun Ra used it occasionally in his Arkestra (played, for example, by percussionist Jim Herndon on the songs \"Reflection in Blue\" and \"El Viktor,\" both recorded in 1957). In 1964, Elvin Jones incorporated timpani into his drum kit on John Coltrane's four-part composition A Love Supreme.\n\nJonathan Haas is one of the few timpanists who markets himself as a soloist. Haas, who began his career as a solo timpanist in 1980, is notable for performing music from many genres including jazz, rock, and classical. He released an album with a rather unconventional jazz band called Johnny H. and the Prisoners of Swing. Glass's Concerto Fantasy, commissioned by Haas, put two soloists in front of the orchestra, an atypical placement for the instruments.[18] Haas also commissioned Susman's Floating Falling for timpani and cello.[31]\n\nList of selected works for timpani\n\nJoão Victor Bota Labirinto for 5 timpani\n\n\n\nAlexander Tcherepnin Sonatina for Timpani\n\n\n\nWerner Thärichen Concerto for Timpani and Orchestra Op34\n\n\n\nGeorg Druschetzky Concerto for Six Timpani Partita in C\n\n\n\nChristoph Graupner Symphony for 2 Horns, 2 Violins, Viola, and Timpani\n\n\n\nGordon Jacob Concerto for Wind Band, Timpani, and Orchestra\n\n\n\nMauricio Kagel Konzertstück for timpani and orchestra\n\n\n\nWilliam Kraft Concerto for Timpani and Orchestra\n\n\n\nJohann Melchior Molter Symphony No. 99\n\n\n\nFrançois-André Danican Philidor March for Two Pairs of Kettledrums\n\n\n\nNey Rosauro Concerto for Timpani and Orchestra\n\n\n\nWilliam Susman Floating Falling for Timpani and Cello\n\n\n\nJörg Widmann Con brio for Orchestra (and Timpani Soloist)\n\n\n\nLuigi Morleo Concertante per i bambini del mondo (for Timpani and Piano)\n\n\n\nMarko Ruždjak Kurenti for Double bass and Timpani (1994)\n\n\n\nJohn Psathas Planet Damnation (2012)\n\n\n\nSee also\n\nReferences"}, {"url": "http://www.madehow.com/Volume-4/Drum.html", "page_content": "Drum\n\nBackground\n\nA drum is a musical instrument which produces sound by the vibration of a stretched membrane. The membrane, which is known as the head, covers one or both ends of a hollow body known as the shell. Instruments that produce sound by means of a vibrating membrane are also known as membranophones. Drums are part of the larger category of musical devices known as percussion instruments. Percussion instruments other than membranophones are known as idiophones. Idiophones, such as bells and cymbals, produce sound by the vibration of the instrument itself rather than by an attached membrane.\n\nDrums exist in a wide variety of shapes and sizes. The two basic shapes for shells are bowls and tubes. The most familiar bowlshaped drums in Western music are kettledrums, also known as timpani. Tubular drums may be taller than they are wide, such as conga drums, or shorter than they are wide. Short drums, also known as shallow drums, are the most common tubular drums used in Western music. Shallow drums include snare drums, tenor drums, and bass drums. If a tubular drum is so shallow that the shell does not resonate, it is known as a frame drum. The most familiar type of frame drum is the tambourine.\n\nDrums are usually played by being struck. Some drums, such as bongo drums, are designed to be played by striking them directly with the hand. In modern Western music, most drums are designed to be played by being struck with various devices known as beaters. The most familiar beaters are wooden sticks, generally used to play smaller drums such as snare drums, and padded wooden mallets, used to play larger drums such as bass drums. Sometimes drums are struck with wire brushes or other types of beaters to produce a different sound.\n\nSome drums, particularly in non-Western cultures, are played in ways other than being struck. Rattle drums contain pellets within the shell or knotted cords attached to the head and are played by being shaken. Friction drums are played by being rubbed. Some membranophones have the vibrating membrane set into motion by sound waves coming from a human voice or from another musical instrument. These devices are known as mirlitons. The most familiar mirliton is the kazoo.\n\nDrums are either tunable, so that they produce a particular note, or nontunable. Most drums in Western music are nontunable. The only commonly used tunable drums in Western music are timpani. Idiophones, which exist in an even greater variety than membranophones, may also be tunable, such as a xylophone, or nontunable, such as a rattle.\n\nHistory\n\nPercussion instruments have been used since prehistoric times. The earliest drums consisted of fish or reptile skin stretched over hollow tree trunks and were struck with the hands. Somewhat later the skins of wild or domesticated mammals were used to make larger drums which were struck with sticks. Besides tree trunks, skins were also stretched over pits dug into the ground to make large drums or over openings in pots or gourds to make small drums.\n\nFrame drums were used by the ancient civilizations of the Middle East about 5,000 years ago. They were later adapted by the ancient Greeks and Romans. The Romans also used tubular drums with skins stretched over both ends of a hollow shell. After the fall of Rome, drums were not commonly used in Western Europe, although they continued to be used by the Arabs. The Crusades brought Europeans in contact with the Arab culture. From the Arabs, Europeans adapted the tambourine (a small frame drum), the naker (a small kettledrum), and the tabor (a small tubular drum). The tabor was often used with a snare, which consisted of thin cords of animal gut stretched across one of the heads in order to produce a rattling sound. The snared tabor is the ancestor of the modern snare drum.\n\nLarge kettledrums, long used in the Middle East, were introduced to Western Europe in the fifteenth century. These instruments consisted of calfskin stretched over large copper cauldrons and were used for military and ceremonial purposes. They were first used in orchestras in the late seventeenth century.\n\nThe bass drum, a large tubular drum, was rare in Europe until the late eighteenth century. The snare drum and the tenor drum (a somewhat larger version of the snare drum, but without the snare) were used primarily for military purposes until the nineteenth century.\n\nTimpani became an important part of orchestral music during the nineteenth century. During the 1880s, devices were developed which allowed timpani players to change the pitch of the instrument quickly, allowing them to play more complex melodies.\n\nAn important development in drum manufacturing occurred in the 1950s when drum makers began to experiment with using plastic instead of animal skin to make heads. Although some drummers, particularly timpani players, preferred the sound of heads made with animal skins, plastic heads soon almost completely replaced traditional heads. A few individual drum makers still make heads from animal skins for musicians who prefer this type of product.\n\nDuring the twentieth century, percussion instruments of all kinds became important in both orchestral music and in popular music. A modern drum set used by popular musicians such as jazz and rock drummers often consists of a bass drum struck with a mallet operated by a foot pedal, a snare drum, a series of tubular drums of various sizes, and a set of cymbals.\n\nRaw Materials\n\nUntil the late 1950s, the head of a drum was almost always made of animal skin. Modern heads are now almost always made of plastic. Usually some form of polyester is used. Polyesters are plastics in which numerous small molecules are linked together into a long chain using a chemical bond known as an ester group. The most common form of polyester used in the drum industry is known as polyethylene terephthalate, available under trade names such as Mylar. Polyethylene terephthalate has the advantage of being strong and resistant to moisture, heat, sunlight, and many chemicals. Polyethylene terephthalate is made from the chemical compounds ethylene glycol and terephthalic acid. These substances are derived from petroleum\n\nThe shell of a drum is usually made of wood. Commonly used woods include maple, birch, and poplar. Some drums have a shell made of metal. Commonly used metals include steel, aluminum, brass, and bronze. Sometimes synthetic materials are used to make shells. These materials are usually strong, hard plastics.\n\nThe various hardware components that hold the drum together are usually made of steel. Sometimes other metals such as brass or aluminum are used. In some cases, these components are made of wood or strong plastic.\n\nOptional attachments such as stands to hold the drum in front of the drummer are usually made of steel or aluminum. Straps to hold the drum in place while marching in a band are generally made from leather, plastic, or cloth. The snare of a snare drum consists of thin strands of various materials such as steel, aluminum, plastic, or animal gut.\n\nThe Manufacturing\n\nProcess\n\nMaking the hardware components\n\n1 Metal hardware components are made using precision metalworking equipment\n\nMaking the head\n\n2 Polyethylene terephthalate is made by combining terephthalic acid (or a derivative such as dimethyl terephthalate) with ethylene glycol. These chemicals are subjected to heat to produce hot, liquid plastic. The liquid is cooled on a large metal roller to form a solid, then stretched between smaller metal rollers to produce a thin film. Various additives may be included to produce films in many colors, which may be either transparent or opaque.\n\n3 The polyethylene terephthalate film is shipped to the drum manufacturer on large rolls. Circles of the proper sizes to make drum heads are cut from the film using precision cutting tools.\n\n4 The edge of the plastic circle is softened by a heating element and allowed to cool to form a collar around the circumference. A steel ring is placed within the collar and an aluminum ring is placed outside the collar. The ring is then closed on a rolling machine to produce a tubular, secure circle of metal, which serves to keep the plastic skin taut. The completed head is stored until needed for assembly.\n\nMaking the shell\n\n5 Metal shells are made using a variety of methods including casting (pouring molten metal into a mold in the shape of the shell) and machining (shaping the metal with various metalworking machines such as drills and lathes). Plastic shells may be made using injection molding.\n\n6 Most shells are made of wood. Wooden shells are made from large, thin panels of wood known as veneer. Veneer is cut from lumber with large saws and shipped from the lumber company to the drum manufacturer.\n\n7 Veneer is cut to the proper size to make the shell by a computer-controlled saw. The cut pieces of veneer are sorted by size and stored under controlled temperature and humidity until needed.\n\n8 Pieces of cut veneer of the proper sizes are moved through a glue press. This device applies glue to the veneer as it passes\n\n9 A variety of methods exist to apply pressure to the glued layers of veneer within the mold. A bag within the mold may be inflated to apply pressure. Water or oil may also be used to apply pressure. The glue may be allowed to dry slowly on its own or an electrical current may be applied to dry the glue quickly.\n\n10 The shell is removed from the mold. It is then cut with a rapidly rotating blade to produce a 45° angle on its edge. In other words, the layers of veneer are cut at slightly different heights, with the innermost layer being the shortest and the outermost layer being the tallest. This sloping edge will allow the head to fit in place.\n\n11 The shell is sanded with high power sanders to produce a smooth surface. It is then either stained or covered with a sheet of shiny, decorative plastic in various colors and patterns. If it is stained, it is rotated while wood stain of various colors is sprayed on it. The stain is then dried quickly with ultraviolet light. A clear, shiny topcoat is then applied and dried in a similar way.\n\nAssembling the drum\n\n12 Precision drills are used to drill holes in the shell to allow the hardware components to be attached. Lugs, which hold the head in place, are screwed into the shell. Long, thin metal rods known as tension rods pass through the aluminum ring surrounding the head and into the lugs. The degree of tension on the head can be controlled by using a drum key, which tightens or loosens the tension rods.\n\n13 For a snare drum, a small amount of one edge of the shell is cut away to allow the snare to fit in place so that it touches one of the heads. The snare is attached in such a way that it can either be held tight, producing the snared sound, or held loose, producing the unsnared sound.\n\nPackaging and shipping\n\n14 The drum is placed in a plastic bag. It is then placed in a cardboard box containing pieces of expanded polystyrene foam, a firm, light plastic that prevents the drum from moving during shipping. The boxes are then shipped to musicians, music stores, orchestras, marching bands, and other consumers.\n\nQuality Control\n\nThe most important factor in the quality control of drum manufacturing is the size and shape of the various components. The wooden veneer must be cut to the precise size to allow several layers to fit together to form a cylinder. The plastic head and the metal rings that hold it in place must fit together properly. The lugs and other hard-ware components must be positioned correctly in exact holes drilled in the proper places in the shell.\n\nThe external appearance of the drum is important to drummers. Each drum is visually inspected to ensure that the wood stain or decorative plastic wrapping is free from defects.\n\nThe Future\n\nDuring the 1980s, it seemed that electronic drum machines (flat panels that produce a synthesized sound when struck) might replace traditional drums in popular music. It soon became obvious that drummers preferred playing traditional drums. In the future, small electronic devices may be attached to drums to allow the sound to be manipulated in new ways while allowing the drummer to enjoy the experience of playing traditional drums.\n\nWhere to Learn More Books Bonfoey, Mark P. Percussion Repair and Maintenance. Belwin Mills, 1986. Holland, James. Percussion. Schirmer Books, 1978. Percussion Anthology. The Instrumentalist Company, 1988."}], "The head of the Clay timpani is held in place by a metal hoop.": [{"url": "https://hub.yamaha.com/drums/percussion/anatomy-of-timpani/", "page_content": "Timpani (sometimes known as “kettle drums”) are used in many types of ensembles, including concert bands, marching bands, orchestras and even by some rock bands. They consist of a membrane (a head) stretched over a large bowl traditionally made of copper, and they’re played by striking the head with a specialized drum stick called a mallet. Modern timpani can be tuned quickly and accurately to specific pitches by skilled players using a movable foot pedal.\n\nHere’s an annotated illustration of a typical timpano (“timpani” is plural for a collection of timpano), followed by a description of each part, in alphabetical order:\n\nAuxiliary Brake. This is located under the pedal. When locked, it keeps the timpano from moving.\n\nBase. The mechanisms for tuning are placed under the base of each timpano. The base is heavy in weight to keep each drum balanced and to promote resonance.\n\nBearing Edge. The lip of the timpano bowl is known as the bearing edge. This transfers the energy from the head to the bowl to create a pitch.\n\nBowl. The shape and material of the bowl’s surface help to determine the drum’s timbre. Hemispheric bowls produce brighter tones while parabolic bowls produce darker tones.\n\nCable Band. Attaches the timpano cable to the strut.\n\nHead. These can be made of either animal skin (generally calf heads) or plastic. The two types of heads need to be attached differently (see the instructions that come with the head.) Plastic heads are easier to take care of since they are not as susceptible to changes in humidity and temperature; they’re also generally easier to install.\n\nHead Protector. Protects the head from dust. Always place this on the timpano when the instrument is not in use.\n\nHoop (Counterhoop). The rim that tightens the timpano head.\n\nMain Caster. Casters allow timpani to be moved with ease. They should be locked during performance to prevent the drums from moving from side to side.\n\nPAC (Pedal Adjustment Knob). This mechanism lets you adjust pedal torque (pedal weight) while maintaining pedal balance. Turn the knob counterclockwise (left) to release the lock. To give the pedal a heavier feel, turn the knob clockwise.\n\nPointer Lock Nut. Locks the tuning indicator into place after fine-tuning.\n\nSpring Tension Adjustment Bolt. Adjusting this bolt allows the tension of the pedal to be set to individual preference.\n\nTension Rod. This threaded metal rod is inserted into the lug casing. It can be tightened or loosened to tune the drum to the desired pitch.\n\nTuning Indicator. A scale of measurement used as a visual guide in tuning the pitch of each timpano.\n\nClick here for more information about Yamaha timpani."}, {"url": "https://www.britannica.com/art/timpani", "page_content": "timpani, (Italian: “drums”) also spelled tympani, orchestral kettledrums. The name has been applied to large kettledrums since at least the 17th century. The permanent orchestral use of timpani dates from the mid-17th century, early examples being in Matthew Locke’s Psyche (1673) and Jean-Baptiste Lully’s opera Thésée (1675). At first they were mainly confined to expressions of rejoicing or to supporting the brass in loud passages. Two instruments, one tuned to the tonic and the other to the dominant (first and fifth notes of the scale), were normal in 17th- and 18th-century scores. Later, more instruments were used with a variety of tunings. In the 19th century the timpani were used in more varied and expressive ways, a development stimulated in large part by the innovations of Ludwig van Beethoven. The French composer Hector Berlioz, who required 16 kettledrums in his Grand Messe des morts (1837; Requiem), even urged composers to specify which type of hard or soft sticks they wished used.\n\nIn modern timpani the bowl-shaped shell is usually of copper or brass. The membrane, of calfskin or synthetic material, is secured by a metal hoop. Its tension is varied by hand screws fixed to the shell and acting on the hoop, or, more often, by one of several 19th- and 20th-century devices: pedal or hand mechanisms that control the tension by rods connected to the hoop. A hole is pierced at the bottom of the shell to avoid air concussion splitting the head in loud passages. The tone varies according to the texture of the head of the stick and the area of the membrane struck. Occasionally, composers specify using the fingers to set the membrane in vibration.\n\nBritannica Quiz Musical Instruments\n\nThe orchestral kettledrum has a practical compass of five full tones. The compass of a pair of timpani is normally an octave from F below middle C downward; for an orchestral set of three, the tuning ranges are generally c–g, G–d, and E♭–B♭ (g = the G below middle C; E♭ = the second E♭ below). Such composers as Igor Stravinsky and Gustav Mahler have extended this range. The expressive resources of the timpani include reiteration of persistent rhythms, dramatic crescendos, sudden stresses, and atmospheric rolls. Special effects include damped or muffled notes, striking a note with two sticks, pedal glissando (sliding pitch) on a roll, and muting by placing a cloth on the drumhead."}, {"url": "https://www.yamaha.com/en/musical_instrument_guide/timpani/mechanism/mechanism002.html", "page_content": "Timpani create a sense of pitch because they are constructed differently from ordinary drums. Drums use two heads, one on the top and one on the bottom. When the top head is struck, the vibration is transmitted to the bottom head through the air inside the drum. The heads influence each other, which makes it easy for the heads overall to vibrate strongly (see left side of figure). This vibration is what gives drums their strong sound of attack.\n\n\n\nConversely, in timpani the vibration when the head is struck interferes with the vibration of the air inside the kettle. As a result, vibrations in the head overall are less likely to occur, with multiple vibrations that alternately vibrate up and down occurring on the head (see right side of figure). Timpani kettles are designed so that these vibrations occur at integral multiple frequencies, which adds a sense of pitch to the sound of the timpani. Each has a different structure so that they can take on different roles."}, {"url": "https://www.yamaha.com/en/musical_instrument_guide/timpani/play/play003.html", "page_content": "The timpani is not struck in the center of the head, but rather close to the rim and towards the player. The wave node runs across the entire head from the center in a straight line, and the vibration's antinode is located at the rim.\n\nStriking the lower area *Cannot playback in the browser you are currently using. Striking the center *Cannot playback in the browser you are currently using. Striking the right *Cannot playback in the browser you are currently using.\n\nAlthough the pitch of the sound will not change when the head is struck in different places, different harmonics will be produced, which changes timbre. Striking the head about one-third of the radius from the hoop will produce a full tone with orderly vibrations. When the center of the head is struck, the harmonic tones will ring out clearer than the fundamental tone, but without the sustained bass that is associated with the timpani."}, {"url": "https://courses.lumenlearning.com/suny-musicappreciationtheory/chapter/percussion/", "page_content": "Introduction\n\nA percussion instrument is a musical instrument that is sounded by being struck or scraped by a beater (including attached or enclosed beaters or rattles); struck, scraped or rubbed by hand; or struck against another similar instrument. The percussion family is believed to include the oldest musical instruments, following the human voice.\n\nThe percussion section of an orchestra most commonly contains instruments such as timpani, snare drum, bass drum, cymbals, triangle and tambourine. However, the section can also contain non-percussive instruments, such as whistles and sirens, or a blown conch shell. On the other hand, keyboard instruments, such as the celesta, are not normally part of the percussion section, but keyboard percussion instruments such as the glockenspiel and xylophone (which do not have piano keyboards) are included.\n\nPercussion instruments are most commonly divided into two categories: pitched percussion instruments, which produce notes with an identifiable pitch, and unpitched percussion instruments, which produce notes or sounds without an identifiable pitch.\n\nPercussion is commonly referred to as “the backbone” or “the heartbeat” of a musical ensemble, often working in close collaboration with bass instruments, when present. In jazz and other popular music ensembles, the pianist, bassist, drummer and sometimes the guitarist are referred to as the rhythm section. Most classical pieces written for full orchestra since the time of Haydn and Mozart are orchestrated to place emphasis on the strings, woodwinds, and brass. However, often at least one pair of timpani is included, though they rarely play continuously. Rather, they serve to provide additional accents when needed. In the eighteenth and nineteenth centuries, other percussion instruments (like the triangle or cymbals) have been used, again generally sparingly. The use of percussion instruments became more frequent in the twentieth-century classical music.\n\nTimpani\n\nTimpani, or kettledrums, are musical instruments in the percussion family. A type of drum, they consist of a skin called a head stretched over a large bowl traditionally made of copper. They are played by striking the head with a specialized drum stick called a timpani stick or timpani mallet. Timpani evolved from military drums to become a staple of the classical orchestra by the last third of the eighteenth century. Today, they are used in many types of musical ensembles, including concert bands, marching bands, orchestras, and even in some rock.\n\nThe basic timpani drum consists of a drumhead stretched across the opening of a bowl typically made of copper or, in less expensive models, fiberglass and sometimes aluminum. In the Sachs–Hornbostel classification, the timpani are thus considered membranophones. The drumhead is affixed to a hoop (also called a fleshhoop), which in turn is held onto the bowl by a counterhoop,which is then held by means of a number of tuning screws called tension rods placed regularly around the circumference. The head’s tension can be adjusted by loosening or tightening the rods. Most timpani have six to eight tension rods.\n\nThe shape of the bowl contributes to the quality of the drum. For example, hemispheric bowls produce brighter tones while parabolic bowls produce darker tones. Another factor that affects the timbre of the drum is the quality of the bowl’s surface. Copper bowls may have a smooth, machined surface or a rough surface with many small dents hammered into it.\n\nTimpani come in a variety of sizes from about 84 centimeters (33 inches) in diameter down to piccoli timpani of 30 centimeters (12 inches) or less. A 33-inch drum can produce the C below the bass clef, and specialty piccoli timpani can play up into the treble clef. In Darius Milhaud’s 1923 ballet score La création du monde, the timpanist must play the F sharp at the bottom of the treble clef. Each individual drum typically has a range of a perfect fifth.\n\nListen: Timpani Please listen to the timpani’s role in Carmina Burana, Part 1, as played by the Raleigh Symphony Orchestra.\n\nBass Drum\n\nBass drums are percussion instruments which vary in size and are used in several musical genres. Three major types of bass drums are as follows:\n\nThe type usually seen or heard in orchestral, ensemble or concert band music is the orchestral, or concert bass drum (in Italian: gran cassa, gran tamburo). It is the largest drum of the orchestra.\n\nThe kick drum, struck with a beater attached to a pedal, usually seen on drum kits.\n\nThe pitched bass drum, generally used in marching bands and drum corps. This is tuned to a specific pitch and is usually played in a set of three to six drums.\n\nA bass drum is typically cylindrical with the diameter much greater than the height. There is normally a struck head at both ends of the cylinder. The heads may be made of calf skin or plastic. There is normally a means of adjusting the tension either by threaded taps or by strings. Bass drums are built in a variety of sizes, but size has little to do with the volume produced by the drum. The size chosen being based on convenience and aesthetics.\n\nListen: Bass Drum In the following video, Kristen Shiner McGuire gives an introduction to the concert bass drum.\n\nSnare Drum\n\nThe snare drum or side drum is a ubiquitous percussion instrument known for its cylindrical shape and powerful, staccato sound. Snare drums are often used in orchestras, concert bands, marching bands, parades, drum lines, drum corps, and more. The snare is also one of the central pieces in a trap set, a collection of percussion instruments designed to be played by a seated drummer, which is used in many popular genres of music. Snare drums are typically played with drum sticks, although there are other options for a completely different sound, such as the brush.\n\nThe snare drum originated from the Tabor drum, which was originally used to accompany the flute. It has evolved into more modern versions including the kit snare, marching snare, and the piccolo snare. Each type presents a different dimension and style of percussion. The snare drum that someone might see in a concert is typically used with a backbeat style to create rhythm. In marching bands it can do the same technique but it is mostly used for a front beat.\n\nIn comparison with the marching snare, the kit snare is typically smaller in length between the two heads, while the piccolo is the smallest of the three. The snare drum is known for its loud crack when a person strikes it with a drum stick or mallet. The depth of the sound varies from snare to snare because of the different techniques and construction qualities of the drum. Some of these qualities include tightness of the head, dimensions, and brand.\n\nThe snare drum is constructed of two heads—both typically made of plastic—along with a rattle of metal wires on the bottom head called the snares. The wires can also be placed on the top, just like on the Tarol Snare. The top head is typically called the batter head because that is where the drummer strikes it, while the bottom head is called the snare head because that is where the snares are located. Tension of the drum heads is held constant through the tension rods. The ability to tighten them provides an opportunity to differ the sound of the hit. The strainer is a lever that releases and tightens the snare. If the strainer is relaxed, the sound of the snare is more like that of a tom because the snares are not present. The rim is the metal ring around the batter head, which can be used for a variety of things, although it is notably used to sound a piercing rimshot with the drumstick.\n\nListen: Snare Drum The following video gives an overview of playing the snare drum.\n\nCymbals\n\nCymbals consist of thin, normally round plates of various alloys. The majority of cymbals are of indefinite pitch, although small disc-shaped cymbals based on ancient designs sound a definite note. Cymbals are used in many ensembles ranging from the orchestra, percussion ensembles, jazz bands, heavy metal bands, and marching groups. Drum kits usually incorporate at least a crash, ride or crash/ride, and a pair of hi-hat cymbals.\n\nThe anatomy of the cymbal plays a large part in the sound it creates. A hole is drilled in the center of the cymbal and it is used to either mount the cymbal on a stand or straps (for hand playing). The bell, dome, or cup is the raised section immediately surrounding the hole. The bell produces a higher “pinging” pitch than the rest of the cymbal. The bow is the rest of the surface surrounding the bell. The bow is sometimes described in two areas: the ride and crash area. The ride area is the thicker section closer to the bell while the crash area is the thinner tapering section near the edge. The edge or rim is the immediate circumference of the cymbal.\n\nCymbals are measured by their diameter often in inches or centimeters. The size of the cymbal affects its sound, larger cymbals usually being louder and having longer sustain. The weight describes how thick the cymbal is. Cymbal weights are important to the sound they produce and how they play. Heavier cymbals have a louder volume, more cut, and better stick articulation (when using drum sticks). Thin cymbals have a fuller sound, lower pitch, and faster response.\n\nThe profile of the cymbal is the vertical distance of the bow from the bottom of the bell to the cymbal edge (higher profile cymbals are more bowl shaped). The profile affects the pitch of the cymbal: higher profile cymbals have higher pitch."}, {"url": "https://simple.wikipedia.org/wiki/Timpani", "page_content": "Timpani (sometimes called kettle drums) are drums that are made out of large bowls that are usually made of copper shaped by craftsmen, which after being tuned, have a skin-like material stretched over the top. This material used to be a type of vellum or treated skin, but modern drums use a synthetic material. This top section is known as the \"drumhead\". Timpani is an Italian word. It is also a plural of the word timpano. However timpano is rarely used in informal English. More often, a timpano is referred to as a drum, a timpani, or simply a timp. Someone who plays a timpani is called a \"timpanist\".\n\nDifference from other drums [ change | change source ]\n\nTimpani are different from other drums because they are tuned to certain musical notes. A timpanist will often describe the drum as being \"in voice\" (or out of voice, as the case may be) when it is correctly tuned. To play it, it is hit with a special drumstick or \"timpani mallet\". Other drums that are used in orchestras and bands make a sound rather than a note, and are not tuned. A player normally sits with a group of two, three or four timpani around him, which is why the name timpani is in the plural.\n\nBrief history [ change | change source ]\n\nTimpani were originally used in official bands. They can still be seen in the bands of the modern official as in the Household Cavalry of Queen Elizabeth II of the United Kingdom, in which the \"kettle drums\" (as they are called) are carried by large drumhorses. (See picture below) In the 1700s timpani became popular in orchestral music, and can be heard in the music of Handel, Beethoven and other 19th century composers wrote music that needed the timpani. Nowadays all large orchestras have timpani, and some bands that play popular music use them as well.\n\nDifferent ways timpani can be made [ change | change source ]\n\nA basic timpano timpani.\n\nThe drumhead [ change | change source ]\n\nA timpani drumhead, also called a timpani head, can be made out of two different things. Some are made out of animal skin, like calfskin or goatskin. Other ones can be made out of thick plastic. Because plastic heads are hard to break and do not cost as much as animal skin heads, they are used more often than animal skin heads. However, a lot of professional players prefer skin heads because they think that skin heads make a better sound when they are hit. The drumhead is stretched over the bowl of the timpani and held on by screws for tuning the timpani.\n\nA chain timpani.\n\nTuning the timpani [ change | change source ]\n\nThe screws that hold and tune the drumhead are called \"tension rods\". To tune the timpani, the \"tension rods\" can all be tightened or loosened. The timpani makes a higher sound if the tension rods are made tighter, and a lower sound if they are loosened. There are usually around seven tension rods on the timpani.[1]\n\nMachine timpani [ change | change source ]\n\nTuning a timpani by turning every tension rod by itself can be very hard, so some timpani makers invented different ways to change the drum's pitch more quickly.[2]\n\nChain timpani [ change | change source ]\n\nIn a chain timpani, the tension rods are all attached to a chain. This chain is hooked up to a lever, and when a player moves the lever back and forth, it tightens and loosens all the screws at the same time to change the pitch of the drum.[1]\n\nratchet clutch system. A pedal on a pedal timpani with asystem.\n\nPedal timpani [ change | change source ]\n\nA pedal timpani is a timpani that uses a pedal to change its pitch. It is the kind of timpani that is used the most today. A player can push on the pedal to make the timpani play higher notes, or let the pedal come back up to play lower notes.[1] There are three different kinds of pedal timpani:\n\nIn a ratchet clutch system a player must pull back a lever called a clutch to release the pedal. Once the pedal is in the spot where the player wants it, they must push the clutch forward with their foot again to lock it in place.\n\nsystem a player must pull back a lever called a to release the pedal. Once the pedal is in the spot where the player wants it, they must push the clutch forward with their foot again to lock it in place. A balanced action system uses a spring that is attached to the pedal, which keeps the pedal in one spot until it is moved by a player. Since the pedal is not held in one spot by a clutch in a balanced action system, some people call it a floating pedal because it looks like the pedal is not held on by anything and is floating.\n\nuses a spring that is attached to the pedal, which keeps the pedal in one spot until it is moved by a player. Since the pedal is not held in one spot by a clutch in a balanced action system, some people call it a because it looks like the pedal is not held on by anything and is floating. In a friction clutch system, the pedal is held in one spot by a clutch, and the clutch is attached to a pole. When a player releases the clutch, the pole moves up and down as the pedal is pushed up and down.\n\nTimpani mallets [ change | change source ]\n\nA set of timpani mallets.\n\nTimpani are played with a special kind of drumstick called timpani mallets. A player uses two mallets at a time when they play the drum. The two parts of the mallet are called the shaft and the head. The head is the part of the mallet that is shaped like a circle, and is the part that hits the timpani, and the shaft is the wooden part of the mallet that is held by a timpanist. A timpani mallet's head can be made out of many things, but is usually made out of a wood sphere that is covered with felt or a thin cloth. The shaft of the mallet is usually made out of wood, like hickory, cherry, or bamboo, but can also be made out of metal, like aluminum. Some timpani mallets do not have a felt head, and just have a wooden one. These mallets are sometimes used in classical and baroque music.[3][4]\n\nIn the beginning of the 20th century, some mallets had shafts made out of whale bones and heads made out of sponges.[5]\n\nWith a pedal timpani, a player can produce different sound effects using the pedals. Performing glissando on timpani demands switching the pedals. Glissando is generated by pressing the pedal during the vertebra. Furthermore it is possible to play glissando at any volume level up or down. For example, Alexander Rahbari, an outstanding Iranian-Austrian composer used glissando effect produced by switching timpani pedals in the opening of his piece, Persian Mysticism Around G, where the player moves from Bb up to C and then rolling down to G(see the timpani part on right below).[6]\n\nRelated pages [ change | change source ]\n\nOther websites [ change | change source ]"}, {"url": "https://zhuanlan.zhihu.com/p/41869448", "page_content": "我可不喜欢什么事情都清楚地知道结局，有条不紊的逐次达标，那也太乏味了。多一分远见，就少一分刺激。如果我知道下一步，每一步会碰到什么，产生什么后果，我立刻就没兴趣活了。\n\n——王朔《一半像火焰，一半像海水》\n\n王朔不是纯粹的文人，所以也容易被快餐文化包围的我们所熟知。王朔是混迹电影圈的大咖，是徐静蕾的前男友之一。他的多数文学作品都已被拍成电影，比如中篇小说《动物凶猛》改编成《阳光灿烂的日子》，使姜文从青年演员蜕变为中国大陆最有天分与国际影响力的导演。1994年改编自王朔的《过把瘾就死》，让主演王志文和江珊从此家喻户晓。由王朔策划制作的50集电视连续剧《渴望》，创造了中国电视剧发展史收视率最高的记录。与冯小刚导演合作的《非诚勿扰2》及《私人订制》也同样收获金满钵满的荣誉......但扎根在影视产业也并不影响他文学作品的产量，只是对于他的文学作品评价褒贬不一，戏称他的作品为“痞子文学”。而我恰不是棱角分明有原则的人，无褒无贬，于我而言文学的意义永远都是探索新知，去经历我们未曾经历的故事，去慢慢参透事物变化的规律，去感知我们无法遇到的人性，去理解和包容一切世间差异。\n\n《一半是火焰，一半是海水》主要收录4篇中长篇小说：《一半是火焰、一半是海水》、《永失我爱》、《无人喝彩》、《过把瘾就死》。四篇小说均描述的是爱情，是人生的不同阶段，也是不同人的不同故事，也许我们总能对号入座，在里面找到自己的影子。王朔的文学朴素又真实，他的文字像一把刀，句句剜心，凝练且妖艳。\n\n《一半是海水，一半是火焰》的男主张明是位流里流气的社会渣滓，他组织卖淫团伙再假装警察敲诈勒索客人。但却意外有个美好的开头，遇见单纯又热烈的女大学生吴迪。张明经历世事变迁早已对人生灰心丧气，自然不会相信爱情里的柔情蜜意。所以只是用惯用伎俩暧昧起吴迪。\n\n青春花季的女孩谁不是以为这美好的世界怎么会存在欺骗，事实掺杂想象就变成了最美好的爱情，谁愿意清醒呢？谁不以为自己最独特理应得到爱神眷顾呢？不对等的经历让两个人置身两种爱情境遇，一个像海水冷若冰霜，一个像火焰炽热浓烈。女孩得不到纯粹的爱情便开始自甘堕落，用最惯用的报复伎俩让爱人产生内疚之情，她还不知道正确爱人的方式啊。就这样吴迪最终割腕自杀，张明也得到法律制裁锒铛入狱，上辑以此结局。\n\n下辑中张明因在狱中表现良好且患肝病而得到假释，他出行小岛途中遇到女孩胡亦，胡亦像极了吴迪，吴迪之死亦让张明明白人世间爱憎，他爱上了胡亦，只是这次张明变成了火焰，另一半是海水。人生如戏，试图在这出戏中挣扎都是徒劳，你未曾给过也终究要偿还给别人。\n\n第二篇《永失我爱》有点韩剧风格，剧情老套让你看到最后也不敢相信是结局，但同样的结局不同人来写就会是不同的感动。王朔对于人物心理的描写还是细腻而不油腻的，仔细咂摸着是出其不意的味道。此篇不剧透，留着你自己慢慢细味。\n\n第三篇《无人喝彩》是描写人到中年的婚姻，这也是我读书笔记做的最多的一篇。仿佛我已与那个不顾不念爱来爱去的年纪遥遥相望了，那些无始无终的爱情也能懂得了，也深谙人类脆弱不禁诱惑的劣根性，对诸多情愫也能在感性中抽离出些许理性，也该慢慢试着理解成年人口中禁锢的婚姻了。\n\n篇中男主是个中年仍未得志转而沉迷游戏的大叔。女主角肖科平是个小提手，是位不与世俗同流合污的清高艺术家。感叹的是，不管你在社会中扮演什么样的角色，是哪一种性格特征，回归家庭本真都是同样的琐碎，让日子面目全非。你想保持对外人礼貌有加温文尔雅，却偏偏不能自持的唠唠叨叨，你想保持对外人无关痛痒的温柔鼓励，却偏变成变本加厉的语言暴力，恐不能把对方伤害到最深而输掉一局，原形毕露成了一个平凡的男人和一个平凡的女人。从前的爱情已经被忘记了，让人以现在糟糕的样子无法想象到你们曾经也浪漫过，也承诺过，也答应对方不离不弃过。什么能经的起时间的推敲呢，单纯的爱情恐怕不能吧，是相互的包容吧。\n\n第四篇《过把瘾就死》是讲述一个敏感多疑的女主杜梅在婚姻中落得一败涂地，在选择婚姻的时候男主并没有觉得是深爱女主的，只是时机偶然或者阴差阳错，或者是芸芸众生眼中所谓的合适，再加上敏感的催化，进入婚姻后两人争吵不断又不停化解，可是争吵本身就像王朔说的那样“它像童话中两个贪心的人挖地下的财宝，结果挖了一个骸骨，虽然迅速埋上了，甚至在上面种了树，栽了花，但两个人都清楚地知道底下埋的是什么。看见树，看见花，想的却是地下的那具骸骨”。我们假装相敬如宾，却不知这已是最大的生分。爱情是一回事，在婚姻里过得幸福又需要多少智慧呢？\n\n人性复杂又无迹可寻，你我唯有竭力保持本真，努力爱着也接受着。\n\n愿你不辜负每一份热情，也不讨好每一份冷漠。\n\n\n\n\n\n\n\n\n\n欢迎关注公众号：因往晓之"}, {"url": "https://www.yamaha.com/en/musical_instrument_guide/timpani/mechanism/", "page_content": "The Structure of the Timpani\n\nLearning about the names of the timpani's parts\n\nA timpani is made of these kinds of parts Names of the parts of the timpani"}, {"url": "https://wiki.kidzsearch.com/wiki/Timpani", "page_content": "Timpani (sometimes called kettle drums) are drums that are made out of large bowls that are usually made of copper shaped by craftsmen, which after being tuned, have a skin-like material stretched over the top. This material used to be a type of vellum or treated skin, but modern drums use a synthetic material. This top section is known as the \"drumhead\". Timpani is an Italian word. It is also a plural of the word timpano. However timpano is rarely used in informal English. More often, a timpano is referred to as a drum, a timpani, or simply a timp. Someone who plays a timpani is called a \"timpanist\".\n\nDifference from other drums\n\nTimpani are different from other drums because they are tuned to certain musical notes. A timpanist will often describe the drum as being \"in voice\" (or out of voice, as the case may be) when it is correctly tuned. To play it, it is hit with a special drumstick or \"timpani mallet\". Other drums that are used in orchestras and bands make a sound rather than a note, and are not tuned. A player normally sits with a group of two, three or four timpani around him, which is why the name timpani is in the plural.\n\nBrief history\n\nTimpani were originally used in official bands. They can still be seen in the bands of the modern official as in the Household Cavalry of Queen Elizabeth II of the United Kingdom, in which the \"kettle drums\" (as they are called) are carried by large drumhorses. (See picture below) In the 1700s timpani became popular in orchestral music, and can be heard in the music of Handel, Beethoven and other 19th century composers wrote music that needed the timpani. Nowadays all large orchestras have timpani, and some bands that play popular music use them as well.\n\nDifferent ways timpani can be made\n\nA basic timpano timpani.\n\nThe drumhead\n\nA timpani drumhead, also called a timpani head, can be made out of two different things. Some are made out of animal skin, like calfskin or goatskin. Other ones can be made out of thick plastic. Because plastic heads are hard to break and do not cost as much as animal skin heads, they are used more often than animal skin heads. However, a lot of professional players prefer skin heads because they think that skin heads make a better sound when they are hit. The drumhead is stretched over the bowl of the timpani and held on by screws for tuning the timpani.\n\nA chain timpani.\n\nTuning the timpani\n\nThe screws that hold and tune the drumhead are called \"tension rods\". To tune the timpani, the \"tension rods\" can all be tightened or loosened. The timpani makes a higher sound if the tension rods are made tighter, and a lower sound if they are loosened. There are usually around seven tension rods on the timpani.[1]\n\nMachine timpani\n\nTuning a timpani by turning every tension rod by itself can be very hard, so some timpani makers invented different ways to change the drum's pitch more quickly.[2]\n\nChain timpani\n\nIn a chain timpani, the tension rods are all attached to a chain. This chain is hooked up to a lever, and when a player moves the lever back and forth, it tightens and loosens all the screws at the same time to change the pitch of the drum.[1]\n\nratchet clutch system. A pedal on a pedal timpani with asystem.\n\nPedal timpani\n\nA pedal timpani is a timpani that uses a pedal to change its pitch. It is the kind of timpani that is used the most today. A player can push on the pedal to make the timpani play higher notes, or let the pedal come back up to play lower notes.[1] There are three different kinds of pedal timpani:\n\nIn a ratchet clutch system a player must pull back a lever called a clutch to release the pedal. Once the pedal is in the spot where the player wants it, they must push the clutch forward with their foot again to lock it in place.\n\nsystem a player must pull back a lever called a to release the pedal. Once the pedal is in the spot where the player wants it, they must push the clutch forward with their foot again to lock it in place. A balanced action system uses a spring that is attached to the pedal, which keeps the pedal in one spot until it is moved by a player. Since the pedal is not held in one spot by a clutch in a balanced action system, some people call it a floating pedal because it looks like the pedal is not held on by anything and is floating.\n\nuses a spring that is attached to the pedal, which keeps the pedal in one spot until it is moved by a player. Since the pedal is not held in one spot by a clutch in a balanced action system, some people call it a because it looks like the pedal is not held on by anything and is floating. In a friction clutch system, the pedal is held in one spot by a clutch, and the clutch is attached to a pole. When a player releases the clutch, the pole moves up and down as the pedal is pushed up and down.\n\nTimpani mallets\n\nA set of timpani mallets.\n\nTimpani are played with a special kind of drumstick called timpani mallets. A player uses two mallets at a time when they play the drum. The two parts of the mallet are called the shaft and the head. The head is the part of the mallet that is shaped like a circle, and is the part that hits the timpani, and the shaft is the wooden part of the mallet that is held by a timpanist. A timpani mallet's head can be made out of many things, but is usually made out of a wood sphere that is covered with felt or a thin cloth. The shaft of the mallet is usually made out of wood, like hickory, cherry, or bamboo, but can also be made out of metal, like aluminum. Some timpani mallets do not have a felt head, and just have a wooden one. These mallets are sometimes used in classical and baroque music.[3][4]\n\nIn the beginning of the 20th century, some mallets had shafts made out of whale bones and heads made out of sponges.[5]\n\nTechniques\n\nWith a pedal timpani, a player can produce different sound effects using the pedals. Performing glissando on timpani demands switching the pedals. Glissando is generated by pressing the pedal during the vertebra. Furthermore it is possible to play glissando at any volume level up or down. For example, Alexander Rahbari, an outstanding Iranian-Austrian composer used glissando effect produced by switching timpani pedals in the opening of his piece, Persian Mysticism Around G, where the player moves from Bb up to C and then rolling down to G(see the timpani part on right below).[6]\n\nRelated pages\n\nReferences\n\nOther websites"}, {"url": "https://www.britannica.com/art/kettledrum", "page_content": "kettledrum, percussion instrument in which a membrane is stretched over a hemispheric or similar-shaped shell and held taut, usually by a hoop with rope lacings, adjusting screws, or various mechanical devices; in some varieties the lacings may pierce the skin directly or the membrane may be tied on with a thong. When struck by sticks or, less commonly, by the hands, the membrane produces a sound of identifiable pitch. The form of the sound wave is not completely known, nor are the acoustic roles of the shell’s shape and the volume of air it encloses.\n\nThe kettledrum apparently originated in the Middle East, but its age is not known with certainty. It is speculated that its precursors were primitive pot drums formed by holding or fastening a skin over a clay pot. Arabic writings from the 10th century ad mention varieties of large and small kettledrums, and the Persian reliefs at Ṭāq-e Bostān (c. ad 600) show a small, shallow version sometimes called a bowl drum. The earliest known pictures of large, deep kettledrums date from 12th-century Mesopotamia. The early flat-bottomed varieties developed into the now typical egg-shaped and hemispherical types; and metal, as well as clay, shells were used.\n\nBritannica Quiz Musical Instruments\n\nKettledrums spread with Islamic culture through Africa, Central and South Asia, and Europe. In these areas they are often associated with trumpets as symbols of royal power and status. They are usually played in pairs, with the two drums tuned to different pitches. Large kettledrums may be paired on horses, elephants, and camels in military regiments (including European cavalry and artillery) and civil ceremonies. Smaller instruments may appear in chamber music (e.g., the Indian tabla) and dance accompaniments.\n\nSmall paired kettledrums called naqqāra reached Europe by the 13th century via the Crusades and became known as nakers. In the mid-15th century the large paired kettledrums of the Ottoman Turks were taken to Europe, principally by way of Hungary and Germany. By the 16th century, screws were placed around the circumference of copper shells to control tensioning and tuning of the calfskin heads. By that time trumpet and kettledrum players were established in most important noble households, and players of both instruments belonged to the same exclusive guild.\n\nNo written kettledrum music survives from the 16th century, because the technique and repertory were learned by oral tradition and were kept secret. An early example of trumpet and kettledrum music occurs at the beginning of Monteverdi’s opera Orfeo (1607).\n\nDuring the 17th and 18th centuries kettledrumming developed into an elaborate and ostentatious ceremonial art that used complicated drum patterns based on the multiple tonguing technique of trumpeters. Kettledrums entered the orchestra in the mid-17th century; orchestral kettledrums are commonly called timpani (q.v.)."}]}