{"The sound of the Clay timpani is produced by striking the head with a mallet.": [{"url": "https://www.yamaha.com/en/musical_instrument_guide/timpani/play/play003.html", "page_content": "The timpani is not struck in the center of the head, but rather close to the rim and towards the player. The wave node runs across the entire head from the center in a straight line, and the vibration's antinode is located at the rim.\n\nStriking the lower area *Cannot playback in the browser you are currently using. Striking the center *Cannot playback in the browser you are currently using. Striking the right *Cannot playback in the browser you are currently using.\n\nAlthough the pitch of the sound will not change when the head is struck in different places, different harmonics will be produced, which changes timbre. Striking the head about one-third of the radius from the hoop will produce a full tone with orderly vibrations. When the center of the head is struck, the harmonic tones will ring out clearer than the fundamental tone, but without the sustained bass that is associated with the timpani."}, {"url": "https://study.com/learn/lesson/timpani-instrument-overview-family.html", "page_content": "Video Transcript\n\nTimpani\n\nBoom! Boom! Boom-Boom Ba Boom-Boom! Thus begins the theme song to the old George of the Jungle cartoons. Similar sounds are heard after the iconic brass chords in the theme song from 2001: A Space Odyssey. What instrument makes that very distinct sound? And where did it come from? When did it start being used as an instrument in the orchestra? These questions and more will be answered in this lesson.\n\nThe distinct booming sound comes from drums called timpani, also known as kettledrums, whose name comes from the Italian word timpano, which is also where we get the word tympanum, or ear drum. The eardrum is a stretched membrane that vibrates when struck by sound waves. Timpani have a membrane called a drum head that's stretched over a frame, and it vibrates when it is struck by a stick called a mallet. That is what makes the big booming sound we know and love.\n\nHistory of Timpani\n\nMany military organizations in Europe began using timpani in the 15th century, and by the 17th century, timpani had found their way into the orchestra. Timpani were traditionally made of copper, but are now often made of fiberglass. The drum head, which was traditionally made of calfskin, is now often made of plastic. At first, only two timpani were used in the orchestra, but now the standard number is four.\n\nTimpani can be tuned to different pitches by tightening or loosening the drum head. The tighter the drum head, the higher the pitch. Originally, this tuning was done manually by tightening screws on top of the drum. This made re-tuning the timpani during a piece of music very difficult. Because of this, the player only played two notes, much like the opening to the George of the Jungle theme song. Modern timpani, however, have a foot pedal that allows the player to tune the timpani quickly and play many pitches, often re-tuning several times in one piece of music.\n\nPlaying the Timpani\n\nTimpani are measured in size by the diameter of the drum head. The bigger the timpani, the lower the sound. The timpani are placed in a semi-circle around the timpani player, or timpanist, with the lowest timpani to the player's left, just like the lowest notes of the piano are on the left. The standard sizes of timpani in use today are the 32-inch, the 29-inch, the 26-inch, and the 23-inch timpani. If a fifth is used, it is generally a smaller and higher pitched 20-inch timpani.\n\nTimpani music is written in the bass clef, and the notes each timpani is capable of playing are called its range. Composers have to be careful when writing parts for the timpani, because if two pitches are to be played on the same timpani, there has to be time in between to tune."}, {"url": "https://hellomusictheory.com/learn/facts-about-the-timpani/", "page_content": "By Robert Jackson\n\nTimpani are those large semi-spherical drums that look like big shiny bowls or upside-down tea-kettles—which is why they’re also called kettledrums.\n\nA classical percussion section would never be complete without timpani. They’re important both in classical orchestras and musical ensembles, including concert, marching, and even rock and roll bands.\n\nThe sound of timpani can be energetic and thunderous, as well as smooth and velvety, which is why they’re considered extremely versatile.\n\nTo help acquaint you with this fascinating percussive instrument, here are 20 interesting facts about the timpani.\n\n1. The Timpani is a Pitched Percussion Instrument\n\nModern pedal timpani can be instantly tuned through a movable foot pedal to adjust the tension of the head as well as the pitch.\n\nAlthough convenient, that could still pose a challenge during a concert, since it’ll require the timpanist to have a perfect ear to keep the instrument in key with the rest of the ensemble.\n\nTuning a chain timpani, which is much less common nowadays, is even more difficult since they don’t have pedals.\n\nInstead, they have a roller chain and a crank.\n\n2. The Timpani Were Initially Military Drums\n\nArabian Naqqara\n\nTimpani started as military drums.\n\nTheir use dates back to the 13th century when they were introduced to Europe by crusaders who brought similar but much smaller Arabian Naqqara.\n\nBefore timpani came to be a staple instrument in the classical orchestra by the last third of the 18th century, they were used in military ceremonies throughout Europe until the 16th century.\n\nThey were even used during the American Civil war where they were played by musicians on horseback.\n\nIn the late 19th century, modern machine timpani were developed for easier adjustment of drumhead tension.\n\n3. The Timpani Has a Wide Range of Sounds\n\nTimpani produce a wide dynamic range of sounds.\n\nTheir various sounds could best be described as dull, thunderous, rumbling, booming, deep, heavy, powerful, round, mellow, velvety, substantial, resonant, dry, or hollow.\n\nThe timbre of the timpani is affected by what the mallets are made of, where the head is struck, and how hard it’s struck.\n\nThe purest tone is produced from the middle of a timpani drum.\n\n4. Timpani Belong to the Percussion Family\n\nThe percussion family is the largest in the orchestra, and timpani are a central part of it because they support rhythm, add melody and color, and enhance harmony.\n\nThe timpani, along with the xylophone and piano, are percussion instruments that are tuned and can sound different notes.\n\nThe bass drums, cymbals, and castanets are examples of untuned percussion instruments with no definite pitch.\n\n5. Timpani Have a Wide Pitch Range\n\nEach timpano (the singular or timpani) has a tonal range of about an interval of a sixth, with the pitch of the lower note dependant on its size.\n\nIn a four-timpani set, the range of pitch of the four drums can therefore span around 3 octaves!\n\n6. Timpani Are Traditionally Made of Copper\n\nTimpani sets today come in a host of materials, including fiber-reinforced plastic and aluminum.\n\nHowever, the traditional copper remains the best material for the bowl since it keeps the timpani in tune more effectively, and resists temperature changes.\n\nCopper also has properties that allow it to easily stretch and shape, and allows sound to resonate deeply.\n\n7. Animal Skins are Preferred for Timpani Heads\n\nTypically, timpani heads used to cover the bowl are made of calfskin or goatskin.\n\nAlthough costly, professional timpanists prefer these skins for the warmer quality of sound they produce.\n\nHeads are also often made of plastic, which is more durable, more affordable, and less affected by temperature and humidity than animal skin.\n\n8. There Are Two Styles of Timpani Placement\n\nIn German-speaking countries, including Germany and Austria, large timpani are usually placed at the right side of the timpanist with smaller timpani to the left, increasing the pitch from right to left.\n\nInternationally, especially in Japan, the direction of the timpani is reversed so that the pitch increases from left to right, similar to a piano keyboard.\n\n9. Timpanists Are Very Well Paid\n\nTimpanists are some of the highest-earning musicians in the music industry.\n\nTheir role is central in an orchestra, and there are few of them due to the difficulty of the instrument.\n\nOf course, the more skilled and experienced a timpanist is, the higher their earning potential, especially in performing arts companies or professional symphonies.\n\nIn the US, it’s reported that the median salary for a timpanist is just under $50,000 a year with some paid well over $100k a year too!\n\n10. Timpani are Very Expensive Instruments\n\nBuying a quality set of timpani could cost you. Prices vary depending on factors like brand, size, and material.\n\nA timpani set can take up to two years to build and could cost an average of $12,000-$17,000.\n\nThat’s why it’s important to be careful while moving them around to avoid costly damages.\n\n11. Timpani Are Heavy\n\nTimpani are among the largest and heaviest musical instruments.\n\nA single timpani drum can weigh up to 140 lbs…\n\nMultiply that by 4 or 5 for a whole set, and you’ve got a challenge on your hands.\n\nTransporting these drums can be difficult and it’ll give you a good workout.\n\n12. There Are Many Different Styles of Timpani\n\nTimpani come in various shapes and sizes.\n\nThere’s a cambered type with a flat bottom like a pot, and a parabolic type that’s nearly hemispherical.\n\nGenerally, the smaller the drums, the higher the pitches.\n\nThe timbre is also decided by where the drum head is stricken.\n\n13. Different Timpani Mallets Give Different Sounds\n\nThere are different categories of mallets used for striking the timpani, including hard, medium-hard, soft, flannel, and wood.\n\nEach kind is used according to the sheet music to express different sounds.\n\nThey come in various sizes, weights, coverings, and lengths of handles.\n\nThe mallet tip is often made out of felt, flannel, or cork, with a bamboo or wood handle.\n\nFelt ball mallets result in a soft attack, while wood balls produce a sharp attack and greater volume.\n\nMany professional musicians prefer to make their own mallets to customize them according to their needs.\n\n14. There Are Different Grips For The Timpani Mallet\n\nTwo common grips for the timpani mallet are the German grip and the French grip.\n\nIn the German grip, the palm is almost parallel with the drum head with the thumb on the side of the mallet.\n\nIn the French grip, the palm is almost perpendicular with the drum head and the thumb is on top of the mallet.\n\nThe American grip is a combination of both.\n\n15. Timpani Go Into All Kinds of Contemporary Music\n\nMusic created by timpani has a lengthy repertoire; it has invaded many rock and roll bands, as well as pop music.\n\nFrom the Beach Boys, Queen, The Beatles, and Emerson, to Led Zeppelin, timpani have taken pride of place in the 60s-70s pop-rock music.\n\nThey’re also featured in electronic music!\n\nSounds created by the timpani are versatile, and stand out in any music style or genre.\n\n16. Playing the Timpani Can Be Tricky But Fun\n\nPlaying the timpani might seem easy—the rhythms are simple, and you often play only a couple of notes—but in reality, there’s so much technique involved.\n\nYou need a very strong musical ear to successfully tune and play your timpani.\n\nYou also need to know how to maintain your drums and mallets to ensure a longer lifespan for them.\n\nOnce you get the hang of it, playing the timpani is so much fun.\n\n17. Playing the Timpani Requires Sensitivity Over Strength\n\nIt’s often thought that playing a large musical instrument like the timpani requires a lot of physical strength, but that’s not true.\n\nIn fact, a large volume of sound can be given through the drum reverberations, using only a little amount of force.\n\nAll you need is to create vibration as naturally as you can.\n\nIt actually takes a lot of sensitivity to create soft sounds and maintain a steady tempo.\n\n18. The Largest Timpani in the World is in Bali\n\nThe largest timpani in the world is in Bali.\n\nAt 73 inches in tall and 63 inches in diameter, the Moon of Pejeng is an ancient kettledrum that is thought to date back to 300 BC.\n\nIt has a story attached to it too, with a Balinese legend claiming that this drum was one of the wheels of a chariot on which they pulled the moon through sky until it fell to earth.\n\nWrap-Up\n\nAs you can see, a timpanist’s job isn’t an easy one.\n\nWhile playing the timpani isn’t easy at first, it sure is fun when you get the hang of it.\n\nWe hope the 20 facts we’ve shared in this post have inspired you to delve deeper into the world of percussive instruments and enjoy some fascinating timpani solos and ensembles."}, {"url": "https://www.britannica.com/art/timpani", "page_content": "timpani, (Italian: “drums”) also spelled tympani, orchestral kettledrums. The name has been applied to large kettledrums since at least the 17th century. The permanent orchestral use of timpani dates from the mid-17th century, early examples being in Matthew Locke’s Psyche (1673) and Jean-Baptiste Lully’s opera Thésée (1675). At first they were mainly confined to expressions of rejoicing or to supporting the brass in loud passages. Two instruments, one tuned to the tonic and the other to the dominant (first and fifth notes of the scale), were normal in 17th- and 18th-century scores. Later, more instruments were used with a variety of tunings. In the 19th century the timpani were used in more varied and expressive ways, a development stimulated in large part by the innovations of Ludwig van Beethoven. The French composer Hector Berlioz, who required 16 kettledrums in his Grand Messe des morts (1837; Requiem), even urged composers to specify which type of hard or soft sticks they wished used.\n\nIn modern timpani the bowl-shaped shell is usually of copper or brass. The membrane, of calfskin or synthetic material, is secured by a metal hoop. Its tension is varied by hand screws fixed to the shell and acting on the hoop, or, more often, by one of several 19th- and 20th-century devices: pedal or hand mechanisms that control the tension by rods connected to the hoop. A hole is pierced at the bottom of the shell to avoid air concussion splitting the head in loud passages. The tone varies according to the texture of the head of the stick and the area of the membrane struck. Occasionally, composers specify using the fingers to set the membrane in vibration.\n\nBritannica Quiz Musical Instruments\n\nThe orchestral kettledrum has a practical compass of five full tones. The compass of a pair of timpani is normally an octave from F below middle C downward; for an orchestral set of three, the tuning ranges are generally c–g, G–d, and E♭–B♭ (g = the G below middle C; E♭ = the second E♭ below). Such composers as Igor Stravinsky and Gustav Mahler have extended this range. The expressive resources of the timpani include reiteration of persistent rhythms, dramatic crescendos, sudden stresses, and atmospheric rolls. Special effects include damped or muffled notes, striking a note with two sticks, pedal glissando (sliding pitch) on a roll, and muting by placing a cloth on the drumhead."}, {"url": "https://www.vsl.info/en/academy/percussion/timpani", "page_content": "Timpani\n\nBrief description Name : Timpani, Kettledrums\n\n: Timpani, Kettledrums Spelling German: Pauken Italian: timpani French: timbales\n\nClassification : Percussion instrument, membranophone, skin-covered instrument with definite pitch\n\n: Percussion instrument, membranophone, skin-covered instrument with definite pitch Bowl : Copper, brass\n\n: Copper, brass Diameter : From 52 cm (piccolo kettledrum) to 76 cm (bass kettledrum)\n\n: From 52 cm (piccolo kettledrum) to 76 cm (bass kettledrum) Height : Approx. 80 cm\n\n: Approx. 80 cm Wall thickness : 0.5 mm\n\n: 0.5 mm Skin (vellum) : Calf, goat or donkey skin. Plastic\n\n: Calf, goat or donkey skin. Plastic Skin thickness : 0.12 - 0.17 mm\n\n: 0.12 - 0.17 mm Mallets: Handle, head, covering The kettledrum, or timpani, an established member of the symphony orchestra since the 17th century, is the percussion instrument with the longest tradition. It is the loudest of all orchestra instruments and as such requires tremendous precision of the timpanist. Great sensitivity is also necessary to get the pitch right: timpani are the only membranophones in the orchestra with definite pitch and the timpanist needs extremely sensitive hearing to find the correct pitch. The volume and pitch of the timpani are far more heavily influenced by the prevailing atmospheric conditions (temperature and humidity) than other instruments. It is for this reason that the performance of the timpani part in the orchestra is generally only entrusted to trained timpanists. The difference between timpanists and the percussionists who play the other percussion instruments lies in the intensity of the timpanist's tasks; this makes it essential that the instruments are played by a specialist. The timpani are therefore always played by a timpanist; “normal” percussionists are very rarely permitted to indulge. In Romantic and modern works four timpani are usual. In the Classical period one pair was standard.\n\nHistory\n\nEarly timpani in Europe\n\nThe first timpani were brought to southern and western Europe in the 13th century by Crusaders and Saracens, from where they spread quickly to the north. These instruments (known in Arabic as naqqâra) were pairs of kettledrums about 20-22 cm in diameter. These small drums (draped kettledrums) remained in use until the 16th century. They were attached to the player' s belt and beaten with a pair of sticks. Draped kettledrums were played primarily in military contexts, for example triumphal marches and processions. Later on they found their way into ensembles and appeared at court festivities and dances.\n\nIn the middle of the 15th century a second wave of kettledrums spread across Europe from the east of the continent. These instruments were the larger timpani.\n\nIn 1457 a legation sent by King Ladislaus of Hungary set off for the court of Charles VII in France. Their horses carried large kettledrums. Instruments of this size had never been seen in Europe before. These loud and booming drums had been played in royal bands in the Middle East since the 12th century, and in Europe they soon advanced together with the trumpets to become the quintessential instrument of the cavalry and a symbol of courtly life and knighthood.\n\n\n\nA pair of kettledrums\n\nDuring the 15th century a number of technical improvements were made to the kettledrum, including a change in the way the vellums were tensioned, the old method of bracing or nailing being gradually replaced by skins lapped on by a hoop. At the beginning of the 16th century kettledrums in German-speaking countries began to be equipped with screws to tension the vellum, which was stretched over a hoop.\n\nThe term timpani and the French word timbales are derived from the Greek word tympanon (Latin: tympanum) which referred to a drum with a skin.\n\nThe power of timpani and trumpets\n\nKettledrums and trumpets came to be used as signaling instruments by the cavalry of the aristocracy, while the serfs and footmen were equipped with side drums and fifes. Kettledrums and trumpets were therefore held in much higher regard as instruments of royalty and the nobility than those of the \"ordinary folk\". Although the invention of gunpowder meant that the kettledrums (and trumpets) lost their role of signalers in battle they nevertheless remained symbols of horsemanship and continued to be the object of further development as art instruments. A form of courtly art emerged which gave rise to playing techniques of extreme virtuosity.\n\nIn keeping with this image, kettledrums came to symbolize the power of monarchs and princes. In 1542, for instance, Henry VIII ordered the purchase of Viennese kettledrums for his court, which were to be played on horseback. Kettledrummers and trumpeters formed their own guilds which enjoyed royal privileges. In 1528 Emperor Charles V granted the Company of Court and Field Trumpeters, which had merged with the Court and Field Kettledrummers, the status of an imperial guild. The kettledrummers, who were obliged to perform other tasks for the prince beside the playing of music and were directly subject to his jurisdiction, were jealous guardians of the secrets of their playing and improvisation techniques, the so-called Schlagmanieren, details of which they passed on only to their successors within the guild. In this way the Kettledrummers' and Trumpeters' Guild, which from time to time found itself facing competition from the Waits' Guild, managed to retain a certain monopoly.\n\nKettledrummers were equal in rank to officers and were dressed in the same way as knights. For many years the granting to a town of the right to keep city trumpeters and kettledrummers was regarded as a privilege.\n\nDuring the course of the 16th century kettledrums were not only played at festivities but began to be used in church music in company with the organ and choirs, especially for trumpet and kettledrum flourishes as a ceremonial glorification in masses. In addition, kettledrums and trumpets appeared more and more frequently as consorts in ballet and stage music (intermedia or interludes), in which they symbolized warlike moods and aristocratic power in keeping with their character. Ensembles consisting of kettledrums and trumpets only remained in existence into the Baroque period. It was not until later, when the power of the guilds was slowly waning, that the kettledrum was accepted as a fully-fledged member of the orchestra.\n\nIn his 1675 opera Thérèse, Jean Baptiste Lully became the first composer to use the kettledrum as an orchestral instrument in the modern sense.\n\nThe guilds disbanded between 1810 and 1831. Up to that point it had been customary to play many extra notes (embellishments) that were not actually in the score; these embellishments were part of the Schlagmanieren. It was not until the 19th century that composers began to gain full control of the timpani and took greater interest in the instrument's playing techniques.\n\nScrews, machines and pedals\n\nThe earliest method of changing a kettledrum's tuning was bracing, but in the 16th century tensioning screws were introduced. The vellum was stretched over an iron hoop with eyes; the shell was also equipped with eyes. The corresponding eyes of the hoop and the shell were screwed together with about ten iron screws which altered the skin tension and therefore also the pitch. This tuning mechanism remained widespread into the 19th century. The problem with this method was twofold: on the one hand it was difficult to place the tension evenly on all parts of the vellum, which is vital for the production of a pure tone. On the other hand it took a long time to retune hand-tuned kettledrums. The advantage of the hand-tuned kettledrum was its lightness, which made it easier to transport.\n\nIn about 1812 the Munich court timpanist Gerhard Kramer designed a mechanism that attached all the screws to a master screw so that the skin tension could be altered by means of a single handle or pedal. The machine drum, which made rapid tuning possible, had arrived. Rotary-tuned machine timpani were also developed which were retuned by giving the bowl a turn. The disadvantage of this method was that the spot on the vellum which must be struck to achieve the best sound (beating spot) changed its position.\n\nThe pedal drum was invented in the 1870s by C. Pittrich in Dresden and is now the standard orchestral kettledrum. By operating a pedal, energy is transferred along drawbars, which run up the shell either on the inside or the outside, to the hoop over which the vellum is stretched and alter its tension. A tuning gauge gives a rough indication of the compass and a handle is used for fine-tuning. Since the beginning of the 19th century rapid retuning during playing has been required by composers more and more often. This demand was a result of chromaticization, which began at the turn of the 19th century, and was one that the new pedal drums could meet with ease.\n\nA peaceable role as an orchestral instrument\n\nThe kettledrum established itself in the orchestra during the 17th century (representational music, church music, opera). As a result its mechanical development was dictated increasingly by the need for rapid and accurate retuning.\n\nIn the Baroque era and Classical period it was usual to use hard mallets, sticks with covered heads being used only for tremolo playing. In the works of Purcell, Bach, Handel and their contemporaries the two kettledrums retained the tuning given at the beginning for the duration of the entire work. In the 18th century the bowls had a diameter of between 41 and 62 cm for the smaller drum and 43 and 65 cm for the larger. The difference in size between the pair was relatively small, a ratio of about 4:3, which remains unchanged today.\n\nBeethoven (1770-1827) was the first composer to expand the role of the timpani in the orchestra, which he did in two ways: on the one hand he used tuning intervals other than the fourths or fifths (tonic and dominant) which had hitherto been usual; examples of this are the minor sixth A-F in his 7th symphony and the octave Fs in his 8th and 9th symphonies. On the other hand he entrusted the timpani with rhythmic and thematic tasks (in his violin concerto and his 5th piano concerto). Like his “classical” colleagues, Beethoven scored the timpani parts with great precision and unobtrusiveness. Kettledrum rolls are used mainly in the build-up to a climax, solo passages are rare and produce remarkable effects.\n\nThe brilliant orchestrator Hector Berlioz (1803-1869) not only revolutionized the art of instrumentation; he was also a pioneer of new roles for percussion instruments. He was the first composer to include instructions in the score about the type of mallet to be used. This gave him great influence over the overall sound, because there is an enormous difference between striking the drum with a stick the head of which is covered by sponge, felt or leather or with one that is made of wood. This precise style of notation was adopted by later composers. In his requiem Grande Messe des Morts, which requires an orchestra of enormous size, Berlioz scored no less than sixteen timpani for ten players (six of whom played a pair, while the other four played one each); in his Symphonie Fantastique four timpanists are required.\n\nIn the course of the 19th century the earlier tasks of the timpani (emphasizing the rhythm, marking the tonic and dominant) changed and it was given new ones in addition.\n\nIn the early 20th century Béla Bartók (1881-1945) was one of those primarily responsible for extending the role of percussion instruments in the symphony orchestra and in chamber music. In particular he increased the timpani's range of playing techniques, requiring them to perform bass lines at a fast tempo (Concerto for Orchestra, 1944) and pedal glissandos (Music for Strings, Percussion, and Celesta, 1937).\n\nTimpani sizes\n\nTimpani and their diameters\n\nD bass kettledrum : 76 cm\n\n: 76 cm F kettledrum : 73,5 cm (29 in.)\n\n: 73,5 cm (29 in.) A kettledrum (or G, large kettledrum) : 66-71 cm (26 in.)\n\n: 66-71 cm (26 in.) D kettledrum (or C, small kettledrum) : 58,5-64 cm (23 in.)\n\n: 58,5-64 cm (23 in.) E kettledrum : 53 cm (21 in.)\n\n: 53 cm (21 in.) A kettledrum (piccolo kettledrum): 52 cm\n\nConstruction\n\nBowl\n\nThe largest part of the kettledrum is the bowl, or pan, which is made of sheet copper. Its shape ranges from hemispherical to funnel-shaped, depending on the period it dates from, its size and the acoustic demands made on it - large kettledrums have a deeper bowl. The bowl is the resonator.\n\nThe open top of the bowl is covered by calf or goat skin stretched across a counterhoop. The counterhoop is joined to the bowl by a pull ring; the skin tension can be altered by means of a screw mechanism which presses the pull ring against the vellum. On the underside of the shell there is a small aperture; this does not serve to project the sound but to maintain even air pressure inside the bowl. A closed bowl would hinder the free vibration of the vellum after it had been struck.\n\nThe bowl is mounted on an iron stand which rests on a heavy metal base. The iron bars do not touch the bowl so as not to damp its vibrations.\n\nVellum\n\nThe most sensitive part of the timpani is the vellum, an evenly-surfaced calf skin which has been smoothed during production with a scraper or pumice-stone. To attain a pure tone it is vital that the skin tension is absolutely even over its entire surface. In addition, the vellum is very sensitive to changes in temperature and humidity; during a concert or an opera the instrument's tuning must be checked several times because the change in temperature and humidity caused by the audience quickly affects the vellum and therefore the pitch. A high level of humidity slackens the vellum. Since the middle of the 20th century plastic skins have also been used, and these have the advantage of being impervious to changes in the atmospheric conditions.\n\nTuning pedal\n\nModern timpani are tuned with a tuning pedal which operates the pull rings by way of rods on the outside (and occasionally on the inside) of the shell. Activating the pedal increases the tension of the vellum, which raises the pitch. In this way a kettledrum's pitch can be altered by as much as a sixth. The purest tone is produced in the middle of the compass. A tuning gauge with a scale of pitches is mounted on the rim and is used as a rough check on the tuning. For fine-tuning, which is done with a handle, the so-called fine-tuning handle, the timpanist must rely on his own exceptionally sensitive sense of hearing.\n\nMallets\n\nTimpanists use a variety of sticks, or mallets, which have different head sizes, coverings, weights and handle lengths. Each particular mallet produces a different sound. Mallets can be divided into roughly five categories:\n\nMallets with a wood or cork head which is covered by felt of varying thickness. These heads result in hard, medium hard and soft mallets. In addition, special wood mallets and flannel sticks are used. Wood mallets, which were widespread in the Baroque era, are nowadays regarded as a separate category.\n\n\n\nTimpani mallets, from soft to hard.\n\nHandle:\n\nAsh, tonkin, ebony, cherrywood, beech\n\nLength:\n\n30-35 cm (felt head)\n\n30-32 cm (flannel head)\n\nHead:\n\nWood (hard), cork (soft), flannel, hard felt\n\n2.5-4.5 cm (felt head)\n\n2.5-5 cm (flannel head)\n\nCovering:\n\nSoft felt of various hardness, leather\n\nNotation\n\nModern-day notation\n\nNon-transposing, always in bass clef.\n\nDetailed and precise notation of the dynamic behavior of the timpani part is recommended due to the instrument's enormous dynamic range. It must also always be borne in mind that the timpani can drown out other instruments.\n\nSince the middle of the 19th century instructions as to the type of mallet to be used have become increasingly common in scores. In the 20th century changes of mallet began to be precisely indicated by individual symbols. This system applies not only to the timpani but to all the other percussion instruments as well.\n\nHistorical notation\n\nUntil about 1800 timpani were transposing instruments. The notes were notated in bass clef as C and G with no accidentals, regardless of the key the piece was in. At the beginning of the score the actual sounded notes of the timpani were written: timpani in C and G, Bb and F, D and A.\n\nThis made sense for as long as the timpani only played the tonic and the dominant; it was also the reason for which the large kettledrum was also called the G drum while the small one was known as the C drum. When other notes began to be demanded - from Beethoven - composers began notating the actual pitch.\n\nRange\n\nA kettledrum has a range of about a sixth.\n\nA timpani group composed of several instruments covers approximately three octaves.\n\nThe purest tone is produced in the middle of a kettledrum's compass. Very high notes sound too strained and too thin, very low notes sound too “woolly” and weak. For this reason timpanists allocate the pitches demanded in the score to the available drums in such a way that the pitch each drum plays is in the middle of its compass.\n\nD kettledrum (bass kettledrum: 75-80 cm): C2, D2 - H2, C3\n\n(bass kettledrum: 75-80 cm): C2, D2 - H2, C3 G kettledrum (large kettledrum: 65-70cm): E2, F2 - D3, E3\n\n(large kettledrum: 65-70cm): E2, F2 - D3, E3 C kettledrum (small kettledrum: 60-65cm): Ab2, Bb2 - G3, Ab3\n\n(small kettledrum: 60-65cm): Ab2, Bb2 - G3, Ab3 F kettledrum (high kettledrum: 55-60 cm): C3 - G#3\n\n(high kettledrum: 55-60 cm): C3 - G#3 A kettledrum (high kettledrum: 50-60 cm): C3, D3 - Bb3, C#4\n\n(high kettledrum: 50-60 cm): C3, D3 - Bb3, C#4 B kettledrum (45-50 cm): G3 - C4\n\nThe range of historical (baroque, classical) timpani was limited solely to the octave F2 to F3.\n\nThis meant that certain keys could not be played in the instruments' usual tuning - low drum = dominant, high drum = tonic. In such instances the usual tuning was reversed: low drum = tonic, high drum = dominant (e.g. A major).\n\nSound production\n\nGerman layout\n\nPair of timpani\n\nThe drums are placed in front of the timpanist, the higher one (small bowl, C or D drum) on his left, the lower (large bowl, G or A drum) on his right.\n\n4 timpani\n\nThe same principle applies as to the pair: the highest drum (smallest bowl) is placed on the extreme left, the lowest on the extreme right. The timpani form a semicircle in front of the musician.\n\nThis arrangement does not correspond to the sequence of notes on the piano.\n\nAmerican layout\n\nPair of timpani\n\nThe drums are placed in front of the timpanist, the lower one (large bowl, G or A drum) on his left, the higher (small bowl, C or D drum) on his right.\n\n4 timpani\n\nThe same principle applies as to the pair: the lowest drum (largest bowl) is placed on the extreme left, the highest on the extreme right. The timpani form a semicircle in front of the musician.\n\nThis arrangement corresponds to the sequence of notes on the piano.\n\nThe use of timpani in the modern-day orchestra is dependent on the work being performed: either the classic pair is used or four timpani. In works from the Romantic literature it has become standard to use four timpani.\n\nA timpanist can play a set of six or seven drums at the most. This is not usual, however, and is only asked for in 20th century solo works (and then very rarely).\n\nDrumming techniques\n\nThe drumstick rebounds after every beat. This bounce is exploited for rapid repetitions and rolls.\n\nThe “striking spot” is the mysterious part of the skin that produces the purest tone. It is a hand-width from the rim. Strokes on the middle of the skin (“second striking spot”) do not produce a clear pitch; they sound like a drum and are only asked for in more modern music.\n\nThe marked resonance is generally damped with the fingertips.\n\nModern tuning techniques\n\nIn contemporary orchestras pedal timpani are used. Rapid retuning is possible by means of a gauged pedal, the pitches are shown as a scale on the tuning gauge on the upper rim of the shell. The range, i.e. the relation between the used scale of pitches and the tuning, must be set with the fine-tuner before playing.\n\nOn a pedal drum roughly half an octave can be played as a scale (maximum range: a major sixth). Up to a tempo of quarter note = 150 a new step of the scale can be played every quarter note. Scales or parts of scales are played on one kettledrum - the sound is more consistent. The wider the interval the longer it takes to retune.\n\nDuring a performance timpanists must retune unobtrusively in the background; this is done while the timpani are pausing (usually, (-;).\n\nHistorical tuning techniques\n\nThe traditional hand-tuned kettledrums, a few of which could still be found in orchestras in the 1950s, were tuned with six or eight screws which all had to be turned the same distance. This was relatively time-consuming and the timpanist needed at least eight bars' rest for it. Fortunately for the timpanists, works of the Classical era hardly ever required retuning during a piece. When from the Romantic period onward this began to be demanded the machine drum and later the pedal drum were invented, which made it possible to retune fairly quickly. In addition, the number of timpani used in the orchestra increased from two to three from the middle of the 19th century.\n\nPlaying Techniques\n\nSingle stroke\n\nRapid scales are not usual due to the marked resonance.\n\nLegend of sticks\n\nTimpani sticks:\n\nsoft medium hard wooden\n\nCoperto\n\nIn the past the vellum was covered by a piece of flannel and struck. Nowadays a piece of felt is placed on the skin. This reduces resonance and produces a dry tone.\n\nLegend of sticks\n\nTimpani sticks:\n\nsoft medium hard wooden\n\nSecco\n\nDry-sounding single stroke, immediately damped.\n\nLegend of sticks\n\nTimpani sticks:\n\nsoft medium hard wooden\n\nWith the hand\n\nThe head is beaten by the fingers.\n\nRepetitions\n\nHand to hand strokes.\n\nLegend of sticks\n\nTimpani sticks:\n\nsoft medium hard wooden\n\nAlternating striking spot\n\nThe head is struck alternately on the striking spot and in the middle or near the rim.\n\nCross beat\n\nThe right hand crosses the left, or vice versa: either right over left or left over right. Nowadays this technique is only used if it cannot be avoided\n\nDouble cross beat\n\nHistorical technique: both hands cross alternately, right over left and left over right. This old technique was used primarily for show and is no longer usual.\n\nGrace notes\n\nOne or more lightly struck auxiliary notes before the principal note. The grace notes can either have the same pitch as the principal note or a different one. If they have a different pitch they are played on a different kettledrum from the principal note.\n\nLegend of sticks\n\nTimpani sticks:\n\nsoft medium hard wooden\n\nMultiple strokes\n\nSimultaneous strokes with two sticks on one or two timpani. It is even possible to play single strokes on four timpani with four sticks - two in each hand.\n\nTwo sticks in unison on one drum\n\nTo achieve striking fortissimo effects the vellum is struck with both sticks simultaneously. Strokes with both sticks in unison are used to achieve a higher dynamic level (e.g. in Gustav Mahler).\n\nParadiddle\n\nEven length stroke, the same pitch being struck once or twice on two timpani in succession. Effective American drumming technique.\n\nRolls\n\nNowadays notated as a tremolo at one pitch (= two sticks on one kettledrum) or one after the other or as a chord consisting of two pitches. Either as sixteenths (measured) or thirty-seconds (unmeasured). Before the 20th century the roll was indicated by the trill sign. Timpani rolls can last some considerable time (e.g. in Beethoven).\n\nLegend of sticks\n\nTimpani sticks:\n\nsoft medium hard wooden\n\nRolls with dynamics\n\nRolls with changing dynamics.\n\nLegend of sticks\n\nTimpani sticks:\n\nsoft medium hard wooden\n\nDouble roll\n\nA roll performed by one player on two timpani.\n\nTransition roll\n\nThe roll moves as smoothly as possible from one kettledrum to the next; no break should be discernible.\n\nCut-off stroke\n\nThe stroke that ends a roll. It is usually sharply accented and often sounds together with the final note of an orchestral piece, for which reason its resonance must be damped with the hand.\n\nResonance glissando\n\nThe glissando effect is achieved by operating the pedal shortly after the note has been struck, in other words, while the note is still ringing. This glissando is very effective rising, but rather weak falling. This is a solo effect, as it is barely audible in tutti passages. It can only be played on pedal drums.\n\nLegend of sticks\n\nTimpani sticks:\n\nsoft medium hard wooden\n\nGlissando roll\n\nThe glissando effect is achieved by operating the pedal during the roll. It is possible at any volume and both upward and downward. Glissando can only be played on pedal drums.\n\nLegend of sticks\n\nTimpani sticks:\n\nsoft medium hard wooden\n\nSound characteristics\n\nDull, thunderous, booming, deep, heavy, powerful, mellow, velvety, substantial, resonant, round, rumbling, dead, dry, hollow.\n\nDue to its great dynamic range the timpani part must be precisely planned and regulated and carefully balanced with its partner instruments. This exactitude must be reflected in the notation. Although when played piano and mezzoforte timpani allow other instruments to the fore, it is very easy for them to drown them out in forte and fortissimo passages.\n\nBasically the timpani sound is composed of two elements, the attack and the resonance. The resonance of a mf tone lasts about 4-5 seconds on the large drum and 3-4 seconds on the small one.\n\nThe timbre is determined by three factors: what the mallets are made of, where the head is struck and how hard the head is struck.\n\nHow the mallets influence the sound\n\nA mallet with a small head stimulates the higher harmonics (which are inharmonic on timpani): the sound is brighter and more incisive. Wood drumsticks produce the same effect.\n\nA mallet with a broad head stimulates the deeper harmonics: the pitch appears more definite (the first six partials are relatively harmonic), and the timbre becomes darker.\n\nIn funeral music muffled mallets are used.\n\nThe sound produced from different parts of the vellum\n\nIdeally the vellum should be struck at a point a hand-width from the rim. This guarantees that the pitch remains clearly defined even in low tunings in which the pitch otherwise tends to lose clarity.\n\nIn general, the number of higher (inharmonic) partials decreases toward the middle the vellum, while striking the head on the rim stimulates them. The closer to the middle the vellum is struck the less definite the pitch becomes. If struck in the middle, the timpani sound like a drum.\n\nSound combinations\n\nPlayed in unison and in unison with additional octave doubling with the bass instruments of the other instrument groups (bassoon, bass clarinet, cello, double-bass, bass trombone and bass tuba) the timpani produce a fairly homogeneous blend. A blend between the timpani and the rest of the orchestra is created.\n\nIf the timpani double an octave on their own (above or below, without any other instrument) their sound becomes more individual.\n\nTimpani + brass instruments\n\nTimpani + trumpets\n\nTimpani and trumpets form a pairing rooted in history; the significance of their sound and symbolism lies in the tonal development of magnificence: the timpani form a powerful base upon which stirring trumpet fanfares resound. There is no tonal blend between the two instruments, their sounds complement each other to marvelous effect. In pieces from the Classical period the timpani's tonic-dominant foundation is doubled by the trumpets one and two octaves higher - often in climaxes - so that a solid pillar of sound over three octaves results.\n\nTimpani + horns\n\nThe horn - the orchestral instrument that blends with all the instrument groups in the orchestra better than any other instrument - plays the typical cadences in pieces from the Classical period along with the timpani and the trumpets. The horns play the notes of the tonic and dominant triads in parallel thirds and sixths - about an octave higher than the timpani, while the timpani play the root notes which are usually doubled in two octaves by the trumpets.\n\nThe horns can also double the timpani in unison, in which case the first horns play in unison with the timpani, while the second horns play an octave higher. This results in an excellent blend.\n\nIf the horns play an octave above the timpani without playing in unison the higher voice is the principal voice and the lower voice (timpani) reinforces its sound.\n\nTimpani + trombones\n\nOften play in unison. Timpani rolls played piano which are doubled by long trombone notes played in unison are very effective.\n\nTimpani + tuba\n\nSome parts of the tuba's timbre are absorbed by the sound of the timpani. The tuba often plays an octave below the timpani. The effect of this is dark and powerful.\n\nTimpani + woodwinds\n\nAll the sound combinations with the woodwinds develop best in piano passages.\n\nTimpani + flutes, oboes\n\nThe sounds of these instruments are very distinct from one another.\n\nTimpani + bass clarinet\n\nProduce a melancholy effect played in unison. Part of the bass clarinet's timbre is swallowed by the timpani.\n\nTimpani + bassoon, contrabassoon\n\nThe bassoon often plays in unison with the timpani, the contrabassoon an octave lower. The mellow overall sound that results is rich in overtones and develops best when played piano.\n\nTimpani + strings\n\nThe strings' tremolo chords, played over a foundation of timpani rolls, are tremendously dramatic and one of this combination's most thrilling effects. String tremolos coupled with timpani rolls are well suited for dynamic shifts - crescendo and decrescendo.\n\nThe timpani roll together with a bowed tremolo played fortissimo provides a vibrant mass of sound in tutti passages.\n\nTimpani + cello\n\nOften play in unison. Both single strokes and tremolos together with the cellos are a common sound combination. The necessary resonance is provided by the double-basses an octave lower.\n\nTimpani + double-bass\n\nThe double-basses complement the timpani an octave below them; the timpani are the principal voice. Usually the cello also plays in unison with the timpani at the same time. The double-basses' pizzicato an octave below gives the timpani additional resonance.\n\nTimpani + harp\n\nPlayed pianissimo or piano and in unison these instruments produce a good effect. Timpani, harps and pizzicato strings lend each other additional resonance.\n\nRepertoire (selection)\n\nSolo timpani\n\nElliott Carter Recitative and Improvisation (1966)\n\n\n\nChamber and ensemble music\n\nBéla Bartók : Sonata for 2 pianos and percussion (1938)\n\n:\n\nConcertos for timpani and orchestra\n\nFrancis Poulenc Concerto for organ, strings, and timpani (1939)\n\nWerner Thärichen Concerto for timpani and orchestra (1954)\n\n\n\nOrchestral timpani"}, {"url": "https://en.audiolexic.org/wiki/Timpani", "page_content": "From AudioLexic\n\nTimpani are musical instruments in the percussion family. A type of drum, they consist of a skin called a head stretched over a large bowl commonly made of copper. They are played by striking the head with a specialized drum stick called a timpani stick or timpani mallet. Unlike most drums, they produce a definite pitch when struck. Timpani evolved from military drums to become a staple of the classical orchestra in the 17th century. Today, they are used in many types of musical ensembles including concert, marching, and even rock bands.\n\nTimpani is an Italian plural, the singular of which is timpano. However, this is rarely used in informal English speech as a timpano is typically referred to as a drum, a timpani, or simply a timp. Alternative spellings with y in place of either or both is – tympani, tympany, or timpany – are occasionally encountered in older English texts. This substitution is taken from the Latin word tympanum, from which the Italian word descends. A musician who plays the timpani is known as a timpanist. While the word timpani has been widely adopted in the English language, some English speakers choose to use the native word kettledrums. The German word for timpani is Pauken, and the French is timbales.\n\nedit] The instrument\n\nedit] The basic timpano\n\nThe basic timpano consists of a drumhead stretched across the opening of a bowl typically made of copper or, in less expensive models, fiberglass and sometimes aluminum. (By one system of classification, it is thus considered a membranophone.) The drumhead is affixed to a hoop (also called a fleshhoop), which in turn is held onto the bowl by a counterhoop, which is then held by means of a number of tuning screws called tension rods placed regularly around the circumference. The head's tension can be adjusted by loosening or tightening the rods. Most timpani have six to eight tension rods.\n\nThe shape of the bowl contributes to the tone quality of the drum. For example, hemispheric bowls produce brighter tones while parabolic bowls produce darker tones. Another factor that affects the timbre of the drum is the quality of the bowl's surface. Copper bowls may have a smooth, machined surface or a rough surface with many small dents hammered into it.\n\nTimpani come in a variety of sizes from about 84 centimeters (33 inches) in diameter down to piccolo timpani of 30 centimeters (12 inches) or less. A 33-inch drum can produce the C below the bass clef, and speciality piccolo timpani can play up into the treble clef. In Darius Milhaud's 1923 ballet score La création du monde, the timpanist must play the F sharp at the bottom of the treble clef.\n\nEach individual drum typically has a range of a perfect fifth to an octave.\n\nedit] Machine timpani\n\nChanging the pitch of a timpano by turning each tension rod individually is a laborious process. In the late 19th century, mechanical systems to change the tension of the entire head at once were developed. Any timpani equipped with such a system may be called machine timpani, although this term commonly refers to drums that use a single handle connected to a spider-type tuning mechanism.\n\n\n\n\n\nedit] Pedal timpani\n\nBy far the most common type of timpani used today are pedal timpani, which allow the tension of the head to be adjusted using a pedal mechanism. Typically, the pedal is connected to the tension screws via a spider-like system of metal rods.\n\nThere are three types of pedal mechanisms in common use today:\n\nThe ratchet-clutch system uses a ratchet and pawl to hold the pedal in place. The timpanist must first disengage the clutch before using the pedal to tune the drum. When the desired pitch is achieved, the timpanist must then reengage the clutch.\n\nsystem uses a ratchet and pawl to hold the pedal in place. The timpanist must first disengage the clutch before using the pedal to tune the drum. When the desired pitch is achieved, the timpanist must then reengage the clutch. In the balanced action system, a spring or hydraulic cylinder is used to balance the tension on the timpani head so that the pedal will stay in position and the head will stay at pitch. The pedal on a balanced action drum is sometimes called a floating pedal since there is no clutch holding it in place.\n\nsystem, a spring or hydraulic cylinder is used to balance the tension on the timpani head so that the pedal will stay in position and the head will stay at pitch. The pedal on a balanced action drum is sometimes called a since there is no clutch holding it in place. The friction clutch or post and clutch system uses a clutch that moves along a post. Disengaging the clutch frees it from the post, allowing the pedal to move without restraint.\n\nAny pedal drums that are tuned using the spider system can be called Dresden timpani, though the term is most often used for drums whose design is similar to the original pedal timpani built in Dresden (see below). Strictly speaking, a Dresden drum has a pedal that is attached at the player's side. The timpanist can move this pedal with ankle motion. A Berlin-style pedal is attached by means of a long arm to the opposite side of the drum, and the timpanist must use his entire leg to adjust the pitch.\n\nThe drums most professional timpanists use are Dresden timpani, commonly with a ratchet-clutch or friction clutch pedal. Most school bands and orchestras below the university level use cheaper, more durable timpani. The mechanical parts of these timpani are almost completely contained within the frame and bowl of the drum. They may use any of the pedal mechanisms, though the balanced action system is by far the most common, followed by the friction clutch system. Many professionals also use these drums for gigs and outdoor performances because of their durability.\n\nedit] Chain timpani\n\nOn chain timpani, the tension rods are connected by a roller chain much like the one found on a bicycle, though some manufacturers have used other materials, including steel cable. In these systems, all the tension screws can then be tightened or loosened by one handle. Though far less common than pedal timpani, chain and cable drums still have practical uses. Occasionally, a player is forced to place a drum behind other items so that he cannot reach it with his foot. Professional players may also use exceptionally large or small chain and cable drums for special low or high notes.\n\nedit] Other tuning mechanisms\n\nA rare tuning mechanism allows the pitch of the head to be changed by rotating the drum itself. A similar system is used on rototoms. Jenco, a company better known for mallet percussion, made timpani tuned in this fashion.\n\nIn the early 20th century, Hans Schnellar, then timpanist of the Vienna Philhamonic, developed a tuning mechanism in which the bowl is moved via a handle that connects to the base, and the head remains stationary. These drums are referred to as Viennese timpani (Wiener Pauken) or Schnellar timpani. Adams Musical Instruments developed a pedal-operated version of this tuning mechanism in the early 21st century.\n\nedit] Timpani heads\n\nLike most drumheads, timpani heads can be found made from two materials: animal skin (typically calfskin or goatskin) and plastic (typically PET film). Plastic heads are durable, weather resistant, and relatively inexpensive. Thus, they are more commonly used than natural skin heads. However, many professional players prefer skin heads because they feel the heads produce a warmer, better quality timbre.\n\nedit] Timpani sticks\n\nTimpani are typically struck with a special type of drumstick fittingly called a timpani stick or timpani mallet. Timpani sticks are used in pairs. They have two components: a shaft and a head. The shaft is typically made from wood – usually hickory, cherry, birch, persimmon, or maple – or bamboo, but may also be made from aluminum or graphite. The head of the stick can be constructed from a number of different materials, though felt wrapped around a wood core is the most common. Other core materials include felt and cork, and other wrap materials include leather. Sticks can also have exposed wood heads. These are used as a special effect and in authentic performances of Baroque music.\n\nAlthough it is not commonly written in the music, timpanists will change sticks – often many times within the same piece – to suit the nature of the music. However, choice of stick during performance is entirely subjective and depends on the timpanist's own preference, and occasionally, the wishes of the conductor. Thus, most timpanists own a great number of timpani sticks. The weight of the stick, the size of the head, the materials used for the shaft, core, and wrap, and the method used to wrap the head all contribute to the timbre the stick produces.\n\nIn the early 20th century and before, sticks were often made with whalebone shafts, wood cores, and sponge wraps. Composers of that era often specified sponge-headed sticks. Modern timpanists execute such passages with standard felt mallets.\n\nedit] Timpani in the modern ensemble\n\nedit] A set of timpani\n\nA standard set of timpani consists of four drums: roughly 80 cm (32 in), 75 cm (29 in), 66 cm (26 in), and 61 cm (23 in) in diameter. The range of this set is roughly the D below the bass clef to the top-line bass clef A. A great majority of the orchestral repertoire can be played using these four drums. However, Leonard Bernstein requires the timpanist to execute both a top-line bass clef A flat and the B flat above it on the same drum in the Overture to Candide. Adding a 51 cm (20 in) 'piccolo timpano' to the standard set of four extends the range upwards by a few semitones. This is the instrument which Stravinsky specifies for the production of the B below middle C in The Rite of Spring -- and from which Ravel even expects a high D in L'Enfant et les Sortilèges. Walter Piston points out that \"these small drums, even if available, certainly lack the characteristic resonance and sonority of timpani\".\n\nBeyond this extended set of five, any added drums are nonstandard. Many professional orchestras and timpanists own multiple sets of timpani consisting of both pedal and chain drums allowing them to execute music that cannot be performed correctly using a standard set of four or five drums.\n\nMany schools and ensembles that cannot afford to purchase equipment regularly only have a set of three timpani. This was the standard set until the second half of the 20th century. It consists of 75 cm (29 in), 66 cm (26 in), and 61 cm (23 in) drums. Its range extends down only to the F below bass clef.\n\nThe drums are set up in an arc or horseshoe around the performer. Traditionally, North American timpanists set their drums up with the lowest drum on the left and the highest on the right, and German and Austrian players set them up the opposite way. Over time, that distinction has blurred: German and European players have adopted the North American layout and vice versa.\n\nedit] Timpanists\n\nThroughout their education, timpanists are trained as percussionists, and they learn to play all instruments of the percussion family along with timpani. However, when a timpanist is appointed to a position in a professional orchestra or concert band, he is not required to play any other percussion instruments. In his book Anatomy of the Orchestra, Norman Del Mar writes that the timpanist is \"king of his own province\", and that \"a good timpanist really does set the standard of the whole orchestra.\"\n\nMost pieces of music call for one timpanist playing one set of timpani. However, occasionally composers seeking a thicker texture or a greater palette of pitches ask for multiple players to perform on one or many sets of timpani. Gustav Mahler writes for two timpanists in six of his symphonies. Gustav Holst uses two timpanists to achieve the range of notes needed to echo the main theme in \"Jupiter\" from The Planets suite. Using two timpanists is relatively common in late Romantic and 20th century works for large orchestras, although the early Romantic composer Hector Berlioz took multiple timpanists to the extreme in his 1837 Requiem, which calls for eight pairs of timpani played by ten timpanists.\n\nedit] Timpani concertos\n\nAlthough such compositions are not common, a few concertos have been written for timpani. The 18th century composer Johann Fischer wrote a symphony for eight timpani and orchestra, which requires the solo timpanist to play eight drums simultaneously. In 1983, William Kraft, a well regarded American percussionist and composer, composed his Concerto for Timpani and Orchestra, which won second prize in the Kennedy Center Friedheim Awards. In the year 2000, American composer Philip Glass wrote his Concerto Fantasy for two timpanists and orchestra, which has its two soloists each playing seven timpani.\n\nedit] Performance techniques\n\nedit] Striking the drum\n\nFor general playing, a timpanist will beat the head approximately 4 inches in from the edge. Beating at this spot produces the round, resonant sound commonly associated with timpani.\n\nA timpani roll is executed simply by rapidly striking the drum, alternating between left and right sticks. In general, timpanists do not use multiple stroke rolls like those played on the snare drum.\n\nThe tone quality of the drum can be altered without switching sticks or adjusting the tuning of the drum. For example, by playing closer to the edge of the head, the sound becomes thinner. A more staccato sound can be produced by beating the drum with the heads of the sticks as close together as possible. When playing rolls, the sticks may be placed farther apart to cause as much of the head as possible to vibrate. There are many more variations in technique a timpanist uses during the course of playing to produce subtle timbral differences.\n\nOccasionally, composers will ask the timpanist to strike the drum at specific spots. Béla Bartók writes a passage \"to be played at the edge of the head\" in his Violin Concerto.\n\nedit] Tuning\n\nPrior to playing the instruments, the timpanist must clear the heads by equalizing the tension at each tuning screw. This is done so every spot on the head is tuned to exactly the same pitch. When the head is clear, the timpano will produce a beautiful, in-tune sound. If the head is not clear, the pitch of the drum will rise or fall after the initial impact, and the drum will produce different pitches at different dynamic levels.\n\n\n\nIn performance, tuning is typically accomplished with a method called interval tuning. Timpanists who are not blessed with absolute pitch obtain a reference pitch from a tuning fork, pitch pipe, or even a note played by another instrument in the course of the performance, then use musical intervals to arrive at the desired note. For example, to tune the timpani to G and C, a timpanist may sound an A with a tuning fork, then sing (or think) a minor third above that A to tune the C, and then sing a perfect fourth below the C to tune the G. Timpanists are required to have a very well developed sense of relative pitch.\n\nSome timpani are equipped with tuning gauges, which provide a visual indication of the drum's pitch. They are physically connected either to the counterhoop, in which case the gauge indicates how far the counterhoop is pushed down, or the pedal, in which case the gauge indicates the position of the pedal. These gauges can be useful. However, every time the drum is moved, the overall pitch of the head changes, thus the pitches must be re-marked on the gauges before every performance. Gauges are especially useful when performing music that involves fast tuning changes that do not allow the player to listen to the new pitch before playing it. Many good timpanists prefer to tune by ear and will rely on gauges only if absolutely necessary.\n\nTimpanists are commonly required to tune in the middle of a piece of music; thus, all timpanists must develop techniques to tune undetectably and accurately in the midst of other music.\n\nOccasionally, players use the pedals to retune a drum while playing it. Portamento effects can be achieved by changing the pitch of the drum while it can still be heard. This is commonly called a glissando, though this use of the term is not strictly correct. The most effective glissandos are those from low notes to high notes and those performed during rolls. One of the first composers to call for a timpani glissando was Carl Nielsen, who used two sets of timpani, both playing glissandi at the same time, in his Symphony No. 4 (\"The Inextinguishable\").\n\n\n\nPedaling refers to changing the pitch of the drum with the pedal; it is an alternate term for tuning. In general, timpanists reserve this term for passages where the performer must change the pitch of a drum in the midst of playing – for example, playing two consecutive notes of different pitches on the same drum. In Samuel Barber's Medea's Meditation and Dance of Vengeance, the timpanist must play A♯–B–C♯–D in consecutive sixteenth notes. There is no way to place this passage across a common set of four drums, thus the timpanist must use the pedal to change the notes while playing. Nocturne, by Benjamin Britten, contains a longer chromatic passage using the same technique.\n\nedit] Muffling\n\nMuffling or damping is an implicit part of playing timpani. Often, timpanists will muffle notes so they only sound for the length indicated by the composer. However, early drums did not resonate nearly as long as modern timpani, so composers often just wrote a note when the timpanist was to hit the drum without worrying about the sustain. Today, timpanists must use their ear and the score of the piece to determine the actual length the note should sound.\n\nThe typical method of muffling is to place the pads of the fingers against the head while holding onto the timpani stick with the thumb and index finger. Timpanists are required to develop techniques to stop all vibration of the drumhead without making any sound from the contact of their fingers.\n\nMuffling is often referred to as muting, which can also refer to playing the drums with mutes on them (see below).\n\nedit] Extended techniques\n\nedit] History\n\nedit] Pre-orchestral history\n\nArabic nakers, the direct ancestors of timpani, were brought to 13th century Europe by Crusaders and Saracens. These drums, which were small (with a diameter of about 20–22 cm or 8–8½ in) and mounted to the player's belt, were used primarily for military ceremonies. This form of timpani remained in use until the 16th century.\n\nIn 1457, a Hungarian legation sent by King Ladislaus V carried larger timpani mounted on horseback to the court of King Charles VII in France. This variety of timpani had been used in the Middle East since the 12th century. These drums evolved together with trumpets to be the primary instruments of the cavalry. This practice continues to this day in sections of the British Army, and timpani continued to be paired with trumpets when they entered the classical orchestra.\n\nOver the next two centuries, a number of technical improvements were made to timpani. Originally, the head was nailed directly to the shell of the drum. In the 15th century, heads began to be attached and tensioned by a counterhoop that was tied directly to the shell. In the early 16th century, the bindings were replaced by screws. This allowed timpani to become tunable instruments of definite pitch.\n\nedit] Timpani in the orchestra\n\nJean-Baptiste Lully is the first known composer to score for timpani, which he included in the orchestra for his 1675 opera Thésée. Other 17th century composers soon followed suit. In music of this time, timpani are almost always tuned with the tonic note of the piece on the high drum and the dominant on the low drum – a perfect fourth apart. Interestingly, timpani are often treated as transposing instruments in the music of this period: the notes were written as C and G with the actual pitches indicated at the top of the score (for example, Timpani in A–D).\n\nLater in the Baroque era, Johann Sebastian Bach wrote a secular cantata titled \"Tönet, ihr Pauken! Erschallet, Trompeten!\", which translates roughly to \"Sound off, ye timpani! Sound, trumpets!\" Naturally, the timpani are placed at the forefront: the piece starts with a timpani solo and the chorus and timpani trade the melody back and forth. Bach used this material later in Christmas Oratorio (Jauchzet, frohlocket!).\n\n\n\nLudwig van Beethoven revolutionized timpani music in the early 19th century. He not only wrote for drums tuned to intervals other than a fourth or fifth, but he gave a prominence to the instrument as an independent voice beyond programmatic use as in \"Tönet, ihr Pauken!\". For example, his Violin Concerto (1806) opens with five timpani strokes, and the scherzo of his Ninth Symphony (1824) pitches the timpani against the orchestra in a sort of call and response.\n\nThe next major innovator was Hector Berlioz. He was the first composer to indicate the exact sticks that should be used – felt-covered, wooden, etc. In several of his works, including Symphonie fantastique (1830), he demanded the use of several timpanists at once.\n\nUntil the late 19th century, timpani were hand-tuned; that is, there was a sequence of screws with T-shaped handles, called taps, which altered the tension in the head when turned by players. Thus, tuning was a relatively slow operation, and composers had to allow a reasonable amount of time for players to change notes if they wanted to be sure of a true note. The first pedal timpani originated in Dresden in the 1870s and are called Dresden timpani for this reason. However, since vellum was used for the heads of the drums, automated solutions were difficult to implement since the tension would vary unpredictably across the drum. This could be compensated for by hand-tuning, but not easily by a pedal drum. Mechanisms continued to improve in the early 20th century.\n\nDespite these problems, composers eagerly exploited the opportunities the new mechanism had to offer. By 1915, Carl Nielsen was demanding glissandos on timpani in his Fourth Symphony – impossible on the old hand-tuned drums. However, it took Béla Bartók to more fully realize the flexibility the new mechanism had to offer. Many of his timpani parts require such a range of notes that it would be unthinkable to attempt them without pedal drums.\n\nedit] Timpani outside the orchestra\n\nLater, timpani were adopted into other classical music ensembles such as concert bands. In the 1970s, marching bands and drum and bugle corps, which evolved both from traditional marching bands and concert bands, began to include marching timpani. Each player carried a single drum, which was tuned by a hand crank. Marching timpani were heavy and awkward to play, as the drumhead was almost at the player's chest. Often, during intricate passages, the timpani players would put their drums on the ground by means of extendable legs, and they would be played more like conventional timpani, but with a single player per drum. In the early 1980s, Drum Corps International (DCI), a drum corps governing body, allowed timpani and other percussion instruments to be permanently grounded. This was the beginning of the end for marching timpani: Eventually, standard concert timpani found their way onto the football field as part of the front ensemble, and marching timpani fell out of common usage.\n\n\n\n\n\nAs rock and roll bands started seeking to diversify their sound, timpani found their way into the studio. Starting in the 1960s, drummers for high profile rock acts like The Beatles, Led Zeppelin, The Beach Boys, and Queen incorporated timpani into their music. Butch Trucks of The Allman Brothers Band usually uses a timpani set during live concerts; the timpani are especially featured in the opening of the song \"Mountain Jam.\"\n\nJazz musicians also experimented with timpani. Sun Ra used it occasionally in his Arkestra (played, for example, by percussionist Jim Herndon on the songs \"Reflection in Blue\" and \"El Viktor,\" both recorded in 1957). In 1964, Elvin Jones incorporated timpani into his drum kit on John Coltrane's four-part composition A Love Supreme.\n\nJonathan Haas is one of the few timpanists who markets himself as a soloist. Haas, who began his career as a solo timpanist in 1980, is notable for performing music from many genres including jazz, rock, and classical. In fact, he released an album with a rather unconventional jazz band called Johnny H. and the Prisoners of Swing.\n\nIn RIO/Avant-prog music, Moe! Staiano plays timpani for the band Sleepytime Gorilla Museum. The timpani sounds support very well the eerie and loud atmosphere of their avant-gardist music.\n\nedit] References\n\nedit] External links"}, {"url": "https://www.soundonsound.com/techniques/practical-percussion-synthesis-timpani", "page_content": "Building on the theory of what makes up the sound of timpani, this month's Synth Secrets reveals how to synthesize realistic kettle drums using a Korg MS20 and a Yamaha DX7.\n\nLast month, I spent the whole of Synth Secrets introducing the various families of percussion instruments, and conducting a detailed analysis of one small sub-class of these: the pitched membranophones. This month, having primed you with all the theory of kettle drums (or timpani), I'll investigate a number of ways to translate what you have learned into practical synthesis.\n\nI'll start with last month's Figure 11, reproduced here as Figure 1. This is a simplified and idealised spectrogram of the sound of a single kettle drum being struck once.\n\nSpectrograms are very useful because, although drawn in two dimensions, they represent all three dimensions of sound: time, frequency, and loudness. OK, it's easy to see the time and frequency axes, but where is the loudness information? Well, in my diagram it's represented by the brightness of the red at any given point on the chart. I'll give you an example: the point marked '1' in Figure 2 represents a sound of frequency 150Hz, measured 0.1 seconds after the start of the spectrogram, with an intensity of around 95 percent of maximum amplitude. Likewise, the point marked '2' represents a component of frequency 750Hz, 0.3 seconds after the start of the spectrogram, with an intensity of about 35 percent. Of course, it's highly unlikely that all the components of the sound would start at the same amplitude, but I'll address that issue later.\n\nNow that you understand what Figure 1 is telling you, you should be able to 'see' how a single strike of the kettle drum sounds. You should also be able to hypothesise that the sound produced by striking the drum three times (thus re-energising the sound on each occasion) will look like Figure 3.\n\nThese spectrograms give a strong clue about how to model the sound of timpani. As you can see, Figure 3 depicts five strong partials in the sound, plus a wash of frequencies that decay more quickly than those partials.\n\nI don't know about you, but Figure 3 screams 'additive synthesis' to me. I first introduced this in part 14 of this series (see SOS June 2000), at the end of which I drew the block diagram shown in Figure 4. This architecture may look complex, but it's not. Starting from the left, there's a single trigger which, in the real world, will be provided by a keyboard. This trigger initiates the action of six contour generators. Four of these control the gain of Amplifiers 1 to 4, which pass the outputs from Oscillators 1 to 4. The other two control the cutoff frequency of a filter and the gain of an amplifier that, in turn, determine the tone and loudness of the contribution of a noise generator.\n\nLet's now choose the frequencies and waveforms for the oscillators. This is simple: you know from last month that the relative frequencies of the first four radial modes are as shown in Table 1, so, if you know the frequency of the principal 1,1 mode, you can calculate the frequencies of the others.\n\nTable 1 Table 1: The most important partials of a real kettle drum. MODE FREQUENCY relative to principal of Timpani 1,1 1.00 2,1 1.50 3,1 1.98 4,1 2.44\n\nMeasurements of real timpani show that the principal frequency of a large kettle drum is higher than you might expect. In these days of super-deep analogue thumps and almost subsonic bass, a kettle drum has a (not particularly deep) principal frequency of around 150Hz. This is all you need to work out the frequencies of the first four modes (they're shown in Table 2). Furthermore, because I'm talking about individual modes of vibration, the waveforms are sine waves.\n\nTable 2 Table 2: The frequencies of the first four kettle drum partials. MODE FREQUENCY relative to principal of Timpani FREQUENCY in Hz 1,1 1.00 150 2,1 1.50 225 3,1 1.98 297 4,1 2.44 366\n\nNow let's consider contour generators 1 to 4. Looking at the spectrogram, it's clear that each should generate a simple Attack/Decay/Release contour with Attack = 0, and equal Decay/Release rates (ensuring that each contour completes its decay whether you hold the key or release it before each note is concluded). However, it's also clear that the four contours should have different values for the Decay/Release.\n\nFigure 5 above shows idealised decay times for the first nine modes, of which the ones in red are the quasi-harmonic partials. Now, I happen to know (because I drew the diagram) that the relative decay/release times for the first four quasi-harmonic partials are approximately 45 percent, 73 percent, 91 percent, and 84 percent respectively. You might think that this is all the information you need before defining the precise contour for each mode, but before you can determine these, you need to know the relative amplitudes of each. For that, I refer you back to another of last month's diagrams, reproduced here as Figure 6.\n\nThis diagram suggests that amplitude ratios of approximately 5:4:3:1 would be appropriate for the first four modes. Knowing this, you can set your four contour generators as shown in Figures 7(a) to (d).\n\nNow that you've defined the components supplying the pitched part of the sound, you need to define the burst of noise at its start.\n\nHere's an admission: last month I was lazy. Instead of drawing myriad little lines of low amplitude to represent all the enharmonic modes generated when you hit a kettle drum, I used my graphics package to draw something similar: a burst of white noise. But that's not what you get when you strike a membrane. You get myriad enharmonic partials. So what can you do to emulate this correctly? The solution is surprisingly simple. You can use a ring modulator (a form of amplitude modulation, 'AM') or frequency modulation, 'FM'.\n\nLet's consider ring modulation, simply because this is the means most likely to lie at your disposal. If you cast your mind back to part 11 of this series (see (see SOS March 2000), you'll remember that this is a special case of Amplitude Modulation. As such, it uses two signals (which I'll call '1' and '2'), and produces side-bands according to the complex equation shown below, where w1 is the frequency of signal 1, w2 is the frequency of signal 2, a1 is the amplitude of signal 1, and a2 is the amplitude of signal 2.\n\nIf the modulator and carrier signals are merely sine waves (which, remember, have no harmonics), the result is not very useful; it's simply the carrier, plus two signals of frequency (w1 + w2) and (w1 - w2). However, if you set both the modulator and the carrier to be harmonically rich sawtooth waves, the result is two complete harmonic series that interact according to that complex equation.\n\nLet me demonstrate the consequences of this by calculating a matrix that shows the 50 partials generated by the interaction of just the first five harmonics of each waveform (see Table 3).\n\nTable 3 Table 3: The first 25 partials generated by amplitude modulation of two signals with frequencies 100Hz and 87Hz. FREQUENCIES OF FIRST FIVE 100HZ CARRIER HARMONICS 100 200 300 400 500 FREQUENCIES 87 w 1 +w 2 187 287 387 487 587 OF FIRST w 1 -w 2 13 113 213 313 413 FIVE 87HZ 174 w 1 +w 2 274 374 474 574 674 MODULATOR w 1 -w 2 74 26 126 226 326 HARMONICS 261 w 1 +w 2 361 461 561 661 761 w 1 -w 2 161 61 39 139 239 348 w 1 +w 2 448 548 648 748 848 w 1 -w 2 248 148 48 52 152 435 w 1 +w 2 535 635 735 835 935 w 1 -w 2 335 235 135 35 65\n\nIf I show Table 3 as a chart of frequencies (as in Figure 8, below), you can see that the results are far from harmonic, with many clumps and clusters of partials. All this, and I only calculated the outputs generated by the first five harmonics in each signal. Given that, within the audible 20kHz audio spectrum, there are 230 harmonics of an 87Hz signal, and 200 harmonics of a 100Hz signal, there will be 46,000 partials in the modulated signal. Notwithstanding the tiny amplitudes of most of them, that should do the trick!\n\nThere's just one problem with this result. You should know from last month's discussion that a kettle drum produces just one partial below the principal, but my — albeit arbitrary — choice of 100Hz and 87Hz has generated about a dozen components below 150Hz. Increasing the frequencies of the signals feeding the ring modulator does not alleviate this, so I will place an high-pass filter in the signal path to remove the offending low frequencies (as shown in Figure 9, above). Now you have only to make the Decay/Release of this contour generator suitably short, and you have the desired burst of closely spaced, enharmonic modes that decay quickly after the membrane is struck.\n\nAt this point, I should make it clear that the partials generated by ring modulation do not lie at the correct frequencies for a kettle drum. Nonetheless, the effect should be sufficient for your purposes.\n\nIt's now time to consider the strength with which the drum's membrane is struck. As explained last month, this affects only the loudness of the sound, so you can emulate this by adding a VCA at the end of the signal chain, perhaps controlling its gain using keyboard velocity (see Figure 10).\n\nFinally, the pitch of the sound must be controlled. You could use the keyboard to 'play' the sound in conventional semitones, but real timpani do not work this way. I therefore propose to use the pitch-bend wheel or a CV pedal to span a range of pitches (say, plus or minus a fifth) and restrict my playing to just one or two notes on the keyboard itself (see Figure 11).\n\nYou're now in a position to construct an analogue timpani synth, as shown in Figure 12. The eagle-eyed among you might notice that I've omitted the complex EQ bank that would follow the final amplifier to model the sound dispersion pattern of the real instrument, but I hope you'll forgive me that — it'll help to keep the graphics department at Sound On Sound on my side.\n\nIf Figure 12 looks complex, it isn't as bad as you might fear. The 'radial mode' generator comprises 12 modules, but these are just four sets of an oscillator/amplifier/contour generator setup. Likewise, the 'circular mode' generator, pitch controls and final gain are simply Figures 9, 10 and 11 incorporated into the patch.\n\nUnfortunately, most of us do not have access to the powerful modular analogue synth needed to create the patch in Figure 12 (above). So, in a moment, I'll demonstrate how a simple and relatively cheap analogue synth can give you a surprisingly accurate imitation of the kettle drum. However, tens of thousands of us have an ideal synth for creating the patch. You may not realise it... but if you own a DX7 or any other six-operator FM synth, you're in business.\n\nLook at algorithm 31 on a DX7... it's the same as Figure 13. Now, remembering that each operator on a DX7 is a sine-wave oscillator with an associated pitch envelope generator, amplitude envelope generator, and amplifier, it's clear that you can use Operators 1 to 4 as the 'radial mode' generators in Figure 12. Indeed, so suiTable is the DX7 that you can type the 1.00:1.50:1.99:2.44 frequency ratios directly into the algorithm.\n\nSimilarly, Operators 5 and 6 are equivalent to the 'circular mode' generator in Figure 12. OK, so the DX7 algorithm uses FM to generate its enharmonic frequencies, whereas the analogue patch used a ring modulator, but the effect is much the same. Indeed, FM produces even more components with no harmonic relation to the pitched part of the sound, and is arguably even more suiTable than ring modulation.\n\nUsing my DX1, I created an approximation to the patch in Figure 12 in a little under five minutes. Even in its rough form, it was remarkably usable.\n\nI then loaded Yamaha's own DX7 timpani patch. Ooh... this uses algorithm 16, has just one carrier, and sounds far better than my first attempt. The difference appears to lie in the realism of the initial part of thesound so, if you want to program the best possible imitation, you'll need to analyse the short-lived enharmonic components more accurately. Unfortunately (or fortunately, depending upon your fondness for higher maths) a more detailed model of the sound is beyond the scope of Synth Secrets.\n\nSo let's now return to the analogue domain and see if it's possible to simplify the patch while still retaining the essence of the desired sound.\n\nFigure 14 shows in simplified form the control panel of that most popular of vintage synths, the Korg MS20. Normally associated with the squeaks and squeals of modern dance music, this is an under-rated synth for careful, imitative synthesis. The reason for this generally lies in its rather lacklustre 12dB-per-octave filters, which are not ideal for powerful sounds such as brass. Nevertheless, the filters need not always be a limitation, as you will see.\n\nSince the MS20 has just two oscillators, and neither of these produces a sine wave, you can't create the pitched part of Figure 12 as drawn. Nor can the MS20 produce slightly detuned partials. So you must compromise... you need to choose a waveform with just a few strong harmonics, and filter off the rest of them. You can do this by choosing the triangle wave for Oscillator 1, ignoring Oscillator 2, and reducing the low-pass filter cutoff frequency (see Figure 15).\n\nHowever, you can do better. If you refer back to Figure 6, you'll see that the relative amplitudes of the first three partials are only slightly different. So you can use the MS20's twin filters to sculpt the '1/n2' amplitude relationship of the triangle wave (shown in Figure 16) into something far more akin to the desired shape (see Figure 17). Notice in particular how this removes the fundamental of the triangle wave, and ensures that the first four partials have the required 1:1.5:2:2.5 relationship seen in Table 1, rather than 1:2:3:4, as would be the case if the fundamental survived filtering.\n\nYou can improve this even further by adding resonance (or 'peak' in Korg-speak) to the filters' cutoff frequencies, further enhancing the contributions from the partials contained in the narrow band of frequencies between the two cutoff frequencies.\n\nBut what of the non-pitched partials in the kettle drum sound? You can use Oscillator 2 to provide these if you select the Ring Modulator option and the lowest footage, and then detune the oscillator so that it produces a suitably clangorous tone (I find that something in the region of +2 works quite well). You can then mix a little of this with Oscillator 1 to create the desired timbre.\n\nYou now create a simple Attack/Decay/ Release envelope using EG2 to shape the amplitude of the note. Remember to set the decay and release times to be equal, so that the sound decays consistently whether you release the key or not. Finally, feed a little of the CV from EG2 to the low-pass filter cutoff frequency. This makes the sound brighter at the start, and reduces the brightness as the volume decays. This is correct: remember that the higher partials in Figures 1, 2 and 3 decayed more rapidly than some of the lower ones, so applying the EG to the low-pass filter overcomes the lack of independent VCAs. The resulting patch appears in Figure 18.\n\nThe patch in Figure 18 is very sensitive to tiny changes in certain parameters — particularly the VCO2 pitch and the filter settings — but once set correctly, it can give the impression of a kettle drum. Nonetheless, it's not particularly satisfying. Indeed, considering the care with which I've followed the theory, it's remarkable just how unconvincing it is. I suspect that this is due to the limitations of the MS20's ring modulator, which gives no control over the input signals, so let's cast theory to the wind and see whether another method can produce more convincing results.\n\nIf you study Figure 19, you'll see that my next patch (which is Korg's 'factory' timpani patch) uses a pulse wave as its starting point, and that the ring modulator is not detuned. This makes the basic timbre much less clangorous than the patch in Figure 18. Other parts of Figure 19 are more familiar: both filters again have resonance, further emphasising the second, third and fourth harmonics, and EG2 again affects the low-pass filter cutoff frequency.\n\nHowever, if you play this part of the patch alone, you'll find that it sounds nothing like a kettle drum... it's just a simple bass sound, and not a very good one, at that. But now have a look at the semi-modular patch matrix provided by the MS20, shown on the right-hand side of the diagram.\n\nLook closely, and you'll see that the noise generator is feeding pink noise to the input of the External Signal Processor. This type of noise is already deficient in high frequencies, and the high-pass filter in the ESP is removing the low frequencies, so the result is a narrow band of noise. Furthermore, at the settings shown, the input of the ESP is distorting, so the result is a very 'rough' timbre. This is then directed to the input of the MS20's main filters, where it is even further narrowed and emphasised by the overlapping resonant filters.\n\nThe result is a band of highly tuned, somewhat distorted noise that takes the place of the ring-modulated sound in Figure 12, and does so very effectively. Indeed, it sounds remarkably similar to the unpitched sound produced by the kettle drum. If you now add back the pitched partials from the oscillators, the result is extraordinarily life-like, with the sound from the oscillators providing the characteristic 'ringing' of the kettle shell as the sound decays.\n\nHaving got this far, you could go on to patch the CV Wheel to the oscillator pitches (as suggested in Figure 12) and develop a number of small performance enhancements. However, lack of space precludes me from doing so here, and this is something that you'll just have to try for yourself.\n\nIf you look back to the start of this article, you'll see that I've gone full circle. Having admitted that, in Figure 1, the 'noise' representation of the enharmonic modes is the result of my laziness, it turns out that using a noise generator is indeed a highly satisfactory way to model a kettle drum. But why stop there...?\n\nAs I discussed last month, timpani are far from the only pitched membranophones so, if you own an MS20, you should consider using these ideas to create a wide range of pitched drum sounds. This is simply done: take the patches in Figures 18 and 19, and experiment with the pitches, filter settings and envelope times. You should easily create other pitched percussion sounds. However, you must take care not to stray too far from the initial settings; do so, and the character of your sounds will change into something else entirely.\n\nOf course, you can try all of this on other synthesizers, but among low-cost instruments, the MS20 is particularly suiTable because it offers a powerful combination of pitched oscillators, a ring modulator, a noise source, and four filters. Consequently, you won't get the same quality of results from the Minimoog, ARP Axxe or Roland SH101 that I used so successfully for brass patches a few months ago.\n\nSo there you have it... proof that the MS20 is good for far more than dancefloor bleeps and bloops. Give it a try!"}, {"url": "http://tegrity.columbiabasin.edu/classes/MUS115RP/Percussion_Pitched_12/Percussion_Pitched_12_print.html", "page_content": "Percussion Instruments\n\nDefinite Pitched Sounds\n\nOverview of Percussion Instruments\n\nThe possibilities of percussion sounds, I believe, have never been fully realized.\n\nCharles Ives (1874-1954)\n\nPercussion instruments emphasize the rhythm of a composition and assist in building dramatic effects and climaxes in the music. A percussionist must be adept at playing many different percussion devices. Within a single composition, a composer might require a player to perform on three or four different instruments. Though they occur in a vast array of shapes, sizes, and timbres, all the percussion instruments are either struck or shaken. Sound is produced by striking a metal or wooden surface or a stretched membrane. Percussion instruments are classified into two groups: those that make a definite pitch and those that have an indefinite pitch. The instruments that do not make a definite pitch are used primarily to reinforce the rhythm or produce a special effect. The pitched instruments are adaptable and play melodies like the instruments in other orchestral families. Each instrument requires the correct touch and playing technique to produce the desired effect. Percussionist do not play all the time and often must count many measures of rest before an entrance.\n\nPlace in the Orchestra\n\nThe percussion instruments are located in a group near the upper left hand corner of the stage. Because of the varying number of instruments and players, the exact number of each instrument varies according to the concert program. There can be anywhere from three to six percussionists in addition to the timpanist.\n\nInstruments A\n\nB\n\nC\n\nD\n\nE\n\nF\n\nG\n\nDiscovering the Orchestra: Percussion\n\nThe following video is the first in a series that presents the symphony orchestra through each of its instrument families -- strings, brass, woodwind, and percussion. The host of the video, Paul Anthony McRae, discusses each instrument, including its history, tone production and size-pitch relationship. Following this discussion, a principal member of the Royal Philharmonic Orchestra plays an excerpt from the orchestral literature. Each instrument segment ends with an ensemble performance by the entire family of instruments.\n\nIntroduction to Percussion Instruments\n\nDefinite Pitch Percussion\n\nWith a tone or sound definite pitch it is possible to discern the frequency of the fundamental. Sounds with definite pitch have harmonic frequencies that correspond to standard pitches such as concert A 440 and others in that fit within major and minor scale patterns. Pitched percussion includes all of the instruments of tuned bars that are struck by a mallet. These include the xylophone, glockenspiels, marimbas, and vibraphones. The timpani is also a tuned percussion instrument, and when operated with a pedal mechanism can play a scale or glissando. Other tuned percussion instruments include the piano and celeste.\n\nMallet Instruments\n\nXylophone The xylophone has a definite pitch and is played by striking the wooden bars with a mallet. One or more tones can be played simultaneously. The instrument consists of a series of tuned horizontal bars of rosewood placed on a frame. The back side of the bars are concaved to produce the exact pitch. The result is a dry, wooden tone with little or no sustained resonance. Glockenspiel The glockenspiel resembles the xylophone, but has steel bars instead of wooden bars. Thirty steel bars are arranged in two rows from high to low pitches, resembling a piano keyboard. The sound produced is silvery, bell-like tone. Marimba The marimba is a large type of xylophone, consisting of a series of hardwood bars on the top of tubular metal resonators. The bars are struck will mallets of felt or rubber, producing a warm, metal sound that has a more sustained tone than that of the xylophone. Vibraphone The vibraphone consists of tuned metal bars on two axles. Under each bar there is a metal tube, in the upper end of which is a fan activated by a motor. The rotating fan produces the vibrato effect which gives the instrument its name. A lower sound is achieved when the motor is off. the long sustain of the bars is controlled by the action of a damper pedal, similar to that of a piano. Full muffling is done with a hand or stick.\n\nSource: Avery, Michael. (2003). Sibelius Instruments (Version 1.0) [Computer software]. London: Sibelius Software Ltd.\n\nIncantation - Bowls and Bells\n\nTibetan singing bowls, Chinese bells, maracas, and marimbas are feature in the the percussion work \"Incantation,\" composed by Navin Chettri and performed by Navin and music students from the University of Idaho.\n\nIncantation by Navin Chettri\n\nOther Mallet Instruments\n\nCelesta Invented in 1886, the celesta resembles a small upright piano. The tone is light and silvery, without much sustain. The name celesta is derived from the French celestial, meaning \"heavenly.\" The mallets, which are controlled by a keyboard, strike steel tuning forks set in a soundbox. The sound of the celeste is amplified by means of a sounding board at the back of the instrument. The celesta can play only a small range of soft dynamics. Chimes The chimes (or tubular bells) are a single instrument consisting of metal tubes vertically suspended in a frame in a keyboard layout. They are struck with one or two mallets at the top. A pedal controls the damping of the sound, producing a muffled \"clank.\" Chime mallets have rawhide ends, and produce a mellow sound. Xylophone sticks, bell mallets and plastic sticks produce a clanging tone, while vibraphone and marimba sticks produce more delicate tones. Chimes are often used in the orchestra to represent church bells or the chime of a grandfather clock. Tam Tam The tam tam is a large circular metal disk, made of a bronze allow, ranging in sizes from 18 inches to 40 inches. It has a raised dome in the center, which enables the gong to vibrate at a definite pitch. It is hung vertically. Striking the tam tam in the center produces a definite pitch; striking the tam tam away from the center produces an indefinite pitch. The sound of a tam tam builds in a long crescendo and decays in a longer decrescendo. Even with hard strokes, it can take as long as two or three seconds for the tam tam to reach full volume, and at least 15 to 30 seconds for the gong's sound to taper off to silence. Different mallets create a variety of effects.\n\nSource: Avery, Michael. (2003). Sibelius Instruments (Version 1.0) [Computer software]. London: Sibelius Software Ltd.\n\nTimpani (Kettle Drums)\n\nThe timpani look like al large copper bowl on a pedal. Around the rim of the head is a ring that regulates the tension of the covering or head. The tighter the head, the higher the pitch. The head of the timpani is struck with a mallet made from a flexible cane handle and the striking head is covered with soft piano felt. The instrument is tuned by either a series of hand-turned knobs around the sides of the head or by a pedal mechanism. The pedal mechanism is attached by rods to the tuning head and allows the player to adjust the tension of the head quickly and accurately, thereby altering the pitch. The tone can also be varied by striking the head in different places, with the dead center producing a dark sound with less ring. The tone may also be muffled by placing a cloth on the drum head. The dynamic range of timpani is from barely audible pianissimo to a thundering fortissimo. With the pedal tuning mechanism, scales and glissandos are possible by pressing the pedal.\n\nSource: Avery, Michael. (2003). Sibelius Instruments (Version 1.0) [Computer software]. London: Sibelius Software Ltd.\n\nTimpani in Also sprach Zarathustra\n\nYou will probably recognize the theme of this piece call \"Also sprach Zarathustra,\" which was composed by Richard Strauss in 1896. The Zarathustra theme was used in the film version of Stanley Kubrick's 2001: A Space Odyssey. The timpani part is one of the most famous in the orchestral literature. The conductor Sir Georg Solti conducts the Chicago Symphony Orchestra.\n\nAlso sprach Zarathustra (1896)\n\nIdentifying Pitched Instruments\n\nExcerpts A B C D E F G\n\nListening Exercise 1\n\nPlay the following percussion excerpts to see if you can identify the correct instrument. Before making your determination, listen to hear whether the instrument produces a pitched or indefinite-pitched sound.\n\nListening Exercise 2\n\nPlay the following percussion excerpts to see if you can identify the correct instrument. Before making your determination, listen to hear whether the instrument produces a pitched or indefinite-pitched sound."}, {"url": "https://courses.lumenlearning.com/suny-musicappreciationtheory/chapter/percussion/", "page_content": "Introduction\n\nA percussion instrument is a musical instrument that is sounded by being struck or scraped by a beater (including attached or enclosed beaters or rattles); struck, scraped or rubbed by hand; or struck against another similar instrument. The percussion family is believed to include the oldest musical instruments, following the human voice.\n\nThe percussion section of an orchestra most commonly contains instruments such as timpani, snare drum, bass drum, cymbals, triangle and tambourine. However, the section can also contain non-percussive instruments, such as whistles and sirens, or a blown conch shell. On the other hand, keyboard instruments, such as the celesta, are not normally part of the percussion section, but keyboard percussion instruments such as the glockenspiel and xylophone (which do not have piano keyboards) are included.\n\nPercussion instruments are most commonly divided into two categories: pitched percussion instruments, which produce notes with an identifiable pitch, and unpitched percussion instruments, which produce notes or sounds without an identifiable pitch.\n\nPercussion is commonly referred to as “the backbone” or “the heartbeat” of a musical ensemble, often working in close collaboration with bass instruments, when present. In jazz and other popular music ensembles, the pianist, bassist, drummer and sometimes the guitarist are referred to as the rhythm section. Most classical pieces written for full orchestra since the time of Haydn and Mozart are orchestrated to place emphasis on the strings, woodwinds, and brass. However, often at least one pair of timpani is included, though they rarely play continuously. Rather, they serve to provide additional accents when needed. In the eighteenth and nineteenth centuries, other percussion instruments (like the triangle or cymbals) have been used, again generally sparingly. The use of percussion instruments became more frequent in the twentieth-century classical music.\n\nTimpani\n\nTimpani, or kettledrums, are musical instruments in the percussion family. A type of drum, they consist of a skin called a head stretched over a large bowl traditionally made of copper. They are played by striking the head with a specialized drum stick called a timpani stick or timpani mallet. Timpani evolved from military drums to become a staple of the classical orchestra by the last third of the eighteenth century. Today, they are used in many types of musical ensembles, including concert bands, marching bands, orchestras, and even in some rock.\n\nThe basic timpani drum consists of a drumhead stretched across the opening of a bowl typically made of copper or, in less expensive models, fiberglass and sometimes aluminum. In the Sachs–Hornbostel classification, the timpani are thus considered membranophones. The drumhead is affixed to a hoop (also called a fleshhoop), which in turn is held onto the bowl by a counterhoop,which is then held by means of a number of tuning screws called tension rods placed regularly around the circumference. The head’s tension can be adjusted by loosening or tightening the rods. Most timpani have six to eight tension rods.\n\nThe shape of the bowl contributes to the quality of the drum. For example, hemispheric bowls produce brighter tones while parabolic bowls produce darker tones. Another factor that affects the timbre of the drum is the quality of the bowl’s surface. Copper bowls may have a smooth, machined surface or a rough surface with many small dents hammered into it.\n\nTimpani come in a variety of sizes from about 84 centimeters (33 inches) in diameter down to piccoli timpani of 30 centimeters (12 inches) or less. A 33-inch drum can produce the C below the bass clef, and specialty piccoli timpani can play up into the treble clef. In Darius Milhaud’s 1923 ballet score La création du monde, the timpanist must play the F sharp at the bottom of the treble clef. Each individual drum typically has a range of a perfect fifth.\n\nListen: Timpani Please listen to the timpani’s role in Carmina Burana, Part 1, as played by the Raleigh Symphony Orchestra.\n\nBass Drum\n\nBass drums are percussion instruments which vary in size and are used in several musical genres. Three major types of bass drums are as follows:\n\nThe type usually seen or heard in orchestral, ensemble or concert band music is the orchestral, or concert bass drum (in Italian: gran cassa, gran tamburo). It is the largest drum of the orchestra.\n\nThe kick drum, struck with a beater attached to a pedal, usually seen on drum kits.\n\nThe pitched bass drum, generally used in marching bands and drum corps. This is tuned to a specific pitch and is usually played in a set of three to six drums.\n\nA bass drum is typically cylindrical with the diameter much greater than the height. There is normally a struck head at both ends of the cylinder. The heads may be made of calf skin or plastic. There is normally a means of adjusting the tension either by threaded taps or by strings. Bass drums are built in a variety of sizes, but size has little to do with the volume produced by the drum. The size chosen being based on convenience and aesthetics.\n\nListen: Bass Drum In the following video, Kristen Shiner McGuire gives an introduction to the concert bass drum.\n\nSnare Drum\n\nThe snare drum or side drum is a ubiquitous percussion instrument known for its cylindrical shape and powerful, staccato sound. Snare drums are often used in orchestras, concert bands, marching bands, parades, drum lines, drum corps, and more. The snare is also one of the central pieces in a trap set, a collection of percussion instruments designed to be played by a seated drummer, which is used in many popular genres of music. Snare drums are typically played with drum sticks, although there are other options for a completely different sound, such as the brush.\n\nThe snare drum originated from the Tabor drum, which was originally used to accompany the flute. It has evolved into more modern versions including the kit snare, marching snare, and the piccolo snare. Each type presents a different dimension and style of percussion. The snare drum that someone might see in a concert is typically used with a backbeat style to create rhythm. In marching bands it can do the same technique but it is mostly used for a front beat.\n\nIn comparison with the marching snare, the kit snare is typically smaller in length between the two heads, while the piccolo is the smallest of the three. The snare drum is known for its loud crack when a person strikes it with a drum stick or mallet. The depth of the sound varies from snare to snare because of the different techniques and construction qualities of the drum. Some of these qualities include tightness of the head, dimensions, and brand.\n\nThe snare drum is constructed of two heads—both typically made of plastic—along with a rattle of metal wires on the bottom head called the snares. The wires can also be placed on the top, just like on the Tarol Snare. The top head is typically called the batter head because that is where the drummer strikes it, while the bottom head is called the snare head because that is where the snares are located. Tension of the drum heads is held constant through the tension rods. The ability to tighten them provides an opportunity to differ the sound of the hit. The strainer is a lever that releases and tightens the snare. If the strainer is relaxed, the sound of the snare is more like that of a tom because the snares are not present. The rim is the metal ring around the batter head, which can be used for a variety of things, although it is notably used to sound a piercing rimshot with the drumstick.\n\nListen: Snare Drum The following video gives an overview of playing the snare drum.\n\nCymbals\n\nCymbals consist of thin, normally round plates of various alloys. The majority of cymbals are of indefinite pitch, although small disc-shaped cymbals based on ancient designs sound a definite note. Cymbals are used in many ensembles ranging from the orchestra, percussion ensembles, jazz bands, heavy metal bands, and marching groups. Drum kits usually incorporate at least a crash, ride or crash/ride, and a pair of hi-hat cymbals.\n\nThe anatomy of the cymbal plays a large part in the sound it creates. A hole is drilled in the center of the cymbal and it is used to either mount the cymbal on a stand or straps (for hand playing). The bell, dome, or cup is the raised section immediately surrounding the hole. The bell produces a higher “pinging” pitch than the rest of the cymbal. The bow is the rest of the surface surrounding the bell. The bow is sometimes described in two areas: the ride and crash area. The ride area is the thicker section closer to the bell while the crash area is the thinner tapering section near the edge. The edge or rim is the immediate circumference of the cymbal.\n\nCymbals are measured by their diameter often in inches or centimeters. The size of the cymbal affects its sound, larger cymbals usually being louder and having longer sustain. The weight describes how thick the cymbal is. Cymbal weights are important to the sound they produce and how they play. Heavier cymbals have a louder volume, more cut, and better stick articulation (when using drum sticks). Thin cymbals have a fuller sound, lower pitch, and faster response.\n\nThe profile of the cymbal is the vertical distance of the bow from the bottom of the bell to the cymbal edge (higher profile cymbals are more bowl shaped). The profile affects the pitch of the cymbal: higher profile cymbals have higher pitch."}, {"url": "https://link.springer.com/chapter/10.1007/978-3-030-98650-6_5", "page_content": "2.1 Structural Parts of the Timpani\n\nA timpani is composed of the following sub-ensembles: the head, the bowl and the tuning pedal (Fig. 5.1). The timpani are designed to play in D, F, A, D. E (Table 5.1). Each instrument has a range of a perfect fifth or seven semitones. In a symphony orchestra, as noted by Blades (1974) who cited Kirby (1930) … “for those who desire to produce really artistic results, there is only one solution; more than three drums must be used. Five will be required, measuring in diameter 30, 28, 25 24 and 22 inches respectively…”. During performance the casters should be locked to prevent the instrument moving.\n\nFig. 5.1 Structural part of a timpani. Legend: a exploded view (https://hub.yamaha.com/wp-content/uploads/2019/04/Timpani-Anatomy-body-image-1024x697.jpg accessed 24 June 2020; b a pedal on a Dresden timpani https://upload.wikimedia.org/wikipedia/commons/e/eb/Dresden_pedal.jpg accessed 23 June 2020; c tension adjusting system of a Yamaha spider for timpani (https://upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Timpani%2C_Yamaha_pedal_timpani.jpg/1024px-Timpani%2C_Yamaha_pedal_timpani.jpg. Accessed 23 June 2020) Full size image\n\nTable 5.1 Types of timpani (data from Vienna Library) and corresponding frequencies for equal temperated scale, A4 = 440 Hz, speed of sound 345 m/s Full size table\n\nThe head which is a membrane also called the vellum, or sometime the skin, is stretched by a rim, the counter hoop. The membrane is the most sensitive part of the timpani. The tension of the membrane is the key factor for production of a pure tone of the timpani. The tension must be even over the entire surface of the membrane. The tension of the membrane can be modified with a screw mechanism. The counter hoop is joined to the bowl by a pull ring. The head is fastened to a hoop. The hoop is held onto the kettle by a counter hoop, which is held in place by 6 or 8 tuning screws placed evenly spaced around the circumference.\n\nThe size of the velum is based on the size of the head and is about 5 cm bigger. For example, for a head of 58 cm diameter, the membrane is 64 cm in diameter. The characteristics of a vellum made of mylar are: the thickness h = 1.9 × 10−4 m, radius 0.328 m; density = 1380 kg/m3; E = 3.5 × 109 N/m2, σ = 0.262 kg/m2 (Rossing and Fletcher 1995).\n\nThe shell of the timpani, called the bowl or the kettle, is a resonator and is the largest sub-ensemble of the timpani. The lip of the shell, the bearing edge, transfers the energy from the membrane and the head to the bowl for creating a pitch\n\nThe shape of the bowl has varied over time, from hemispherical to parabolic. Large timpani have a deep bowl. On the underside of the shell there is a small circular aperture to maintain even air pressure inside the bowl. The bowl is fixed on an iron stand which is put over a heavy metallic base.\n\nThe shape (depth and contour) of the kettle is the subject of divergent opinions from coppersmiths and acousticians, over more than a century. Adolphe Sax was the first to propose a timpani without a kettle, called also a “shell-less” kettledrum, mentioning that only the quality of the membrane, its attachment and its size are important for the tone quality (Blades 1974).\n\nThe volume of the kettle is important in determining the sounds of the timpani. “the main role of the kettle is that of a baffle to acoustically separate the top and the bottom side of the membrane. This increases the radiation efficiency which decreases the decay time, especially in the modes of lower frequency” (Rossing 2001, 2000). The shape of the kettle as explained by Benade (1976) is not important in determining timpani sound, provided the volume is kept in the “correct range”, and this is because the sound wavelengths are so much larger than the kettle dimensions (at 440 Hz, the wavelength is about 0.8 m). From a physical point of view the mode frequencies of the enclosed air in the kettle, which depend on the kettle volume, are not affected by the shape of the kettle. However, many timpanists, based on their musical experience, are convinced that the shape of the kettle is important in determining the sound of the timpani. This opinion was firstly contested by Adolphe Sax. Blades (1974) noted “whilst the pitch of the drum is governed by the tension on the drumhead and the diameter of the bowl, the quality of tone depends on the condition of the membrane, the correctness in tensioning and the shape and depth of the “kettle”. Opinion is fairly unanimous that the bowl of the kettledrum magnifies certain of the overtones in the harmonic series, rendering the note musical (copper, brass, fibre glass and wood shells, hemispherical or nearly so, produce similar results). Blades (op. cit.) added the “tonal differences are compensated by the performer, who will adjust the striking position to suit the depth of bowl, i.e. reasonably close to the rim in the deeper bowl and a little nearer the centre if the bowl is shallower”.\n\nThe tuning mechanism for timpani has been subjected to continuous improvement. It is important to remember that contemporaneous timpani are excellently engineered and the changing of pitch is quite effortless. Timpani equipped with a tuning device are also called “machine timpani”. The tuning device changes the pitch of the timpani by changing the tension of the membrane. Contemporaneous instruments are equipped with a handle connected spider—type tuning mechanism.\n\nMachine drums are of three main types: pedal operated, those with rotating bowls and those with a single master screw. In all these cases the whole counter hoop is lowered or raised in a single operation.\n\nThe Dresden mechanism is probably the oldest with the original sawtooth clutch engaged by a side action lever which locks the pedal in any position. The mechanism gives swift and silent tuning. In Dresden models the mechanism leading from the drum head to the foot pedal is placed on the outside of the kettle, which is suspended in a cradle. Ludwig in USA introduced the balanced action pedal mechanism, where spring pressure controls the foot positioning in place of a ratchet and clutch.\n\nThe tuning pedal (Fig. 5.2) operates the pull rings with a level mechanism, on the outside of the shell. There are three types of pedal mechanisms:\n\nFig. 5.2 Transmissibility of a simple harmonic oscillation. (https://www.newport.com/t/fundamentals-of-vibration accessed 26 June 2020). a Undamped system for a simple harmonic oscillator. b Damped system for various values of damping coefficient ζ. Note for light damping, the quality factor Q = 1/2 ζ and gives a measure of modal damping. ω o- is the resonance frequency of the system; ω is the frequency of the system Full size image\n\nratchet clutch mechanism with a ratchet and paw; the ratchet engages in a fixed set of positions\n\nbalanced action mechanism of a spring or a hydraulic cylinder\n\nfriction clutch mechanism which allows the pedal to move freely.\n\nDresden type pedals and Berliner type pedals are the most popular for professional timpanists. The Dresden type pedal is operated by ankle motion. The clutch (Fig. 5.2a, seen on the left) must be disengaged to change the pitch of the timpani. The Berliner type pedal is mechanically more complex and is operated by leg motion to adjust the pitch.\n\nActivating the pedal increases the tension in the membrane, which implicitly raises the pitch. A rough check of tuning can be done with a tuning gauge, having a scale of pitches. The fine tuning is done with a handle and relies on the sensitivity of the timpanist.\n\n2.2 Materials for the Timpani\n\nThe membrane is made of an animal skin (calf skin, goat skin) or of a synthetic material, a polyester—under the trade name mylar. The membrane made of an animal skin is very sensitive to variations in air temperature and humidity. High humidity slackens the membrane made of animal skin, while a rather dry atmosphere such as is found in concert halls which are centrally heated, tends to shrink the vellum. Therefore, a heating or moistening carry unit fitted inside the bowl was invented to regulate the local air conditions (Blades 1974).\n\nBecause the atmospheric and mechanical contingencies of the membrane are subject to inconsistency it was interesting to study these effects simultaneously. For the case of a little drum, 20 cm in diameter, the traditional Indonesian Kompang with goat skin, is easier to handle (Table 5.2). The relative humidity was between 50 and 90% and the initial tension was 80 N on the goat skin. After 48 h of exposure to various air relative humidities, the tension decreased by 17% and the frequency significantly decreased by about 24%.\n\nTable 5.2 Effect of the air relative humidity on the frequency and on the tension of the membrane of a traditional Indonesian instrument called the Kompang, diameter 20 cm, goat skin, density 553 kg/m3 (Siswanto et al. 2018) Full size table\n\nHowever, many professional timpanists prefer skin heads. The argument is that they produce a “warmer” timbre. The great European orchestras -Wiener and Berliner Philarmoniker, Concertgebouw Amsterdam, are equipped with timpani having membranes made of calf skin. Since about 1950 a polyester material called mylar has been used for the membranes of percussion instruments. This is resistant to moisture variations, heat, sunlight, etc., and less expensive than the calf skin.\n\nThe bowl for prestigious instruments, is commonly made of metallic sheets of copper by hammering. Copper is preferred because of its efficient regulation of internal and external temperatures. For less expensive instruments the bowl can be made of aluminium or fiberglass, by moulding. The fiberglass bowl was successful mainly because of its durability and decrease in weight.\n\nMetal hardware components that hold the timpani together are usually made of steel. Sometimes other metals such as brass or aluminium are used. In some cases, these components are made of strong plastic.\n\n2.3 Technological Aspects of Manufacturing of the Kettle\n\nWe have seen that the kettle is the most voluminous sub-ensemble of the timpani. Some kettles could be produced by stamping, some by spinning, or some by both processes. The stamping machine has a pattern in it that is transferred to the material being “stamped”. Hence for a kettle it might be stamped from a sheet of copper as shown in the images attached in the following pages.\n\nAlternatively spinning would be a process where the material to be shaped is spun around an axis while pressure is applied to it to bend the material into the desired shape. So, for a kettle a circular sheet of copper could be spun around its centre while some tool applies a force to the surface of the copper sheet to bend it into shape. Clearly spinning produces a symmetric shape about the axis it is spun about whereas stamping can produce any shape. Spinning is capable of forming diameters ranging from 3 mm to 10 m and thicknesses from 0.4 mm to 25 mm (Jeswiet and Hagan 2003). Spinning can be automated with the use of computers, numerical control and numerical control programs. The benefits of this technology make it highly attractive for the production of kettles. A drawback is related to the achievement of the appropriate hardness of the kettle wall after cold deformation. While the hardness is important for tunability, another property that has not been considered is the effect of this process on material damping. Material damping can be expressed by several parameters such as the transmissibility, the quality factor or by internal friction. We know also that the transmissibility of a simple harmonic undamped system is strongly different from a damped system as illustrated in Fig. 5.3. Of course, in the case of a damped or undamped kettle the response is much more complex.\n\nFig. 5.3 Manufacturing the kettle. Legend—data from Yamaha. Legend: a cutting the round plate (https://www.yamaha.com/en/musical_instrument_guide/common/images/timpani/manufacturing_p01_01.jpg; b drilling a hole in the centre of the plate https://www.yamaha.com/en/musical_instrument_guide/common/images/timpani/manufacturing_p01_00.jpg; c setting the plate onto a stamping machine (https://www.yamaha.com/en/musical_instrument_guide/common/images/timpani/manufacturing_p01_02.jpg; d initial phase of the spinning of the plate https://www.yamaha.com/en/musical_instrument_guide/common/images/timpani/manufacturing_p01_03.jpg; e annealed plate to avoid wrinkles and cracks https://www.yamaha.com/en/musical_instrument_guide/common/images/timpani/manufacturing_p01_04.jpg; f the kettle nearly completed, https://www.yamaha.com/en/musical_instrument_guide/common/images/timpani/manufacturing_p01_05.jpg Full size image\n\nIt might be that a kettle is produced by initially stamping and then is spun to achieve its final shape, although the spinning would only be used if a symmetric shape is wanted; not for an oval shape unless some complicated mechanism is used to bend the material differing amounts depending on the position during the spin.\n\nSome technological aspects of the manufacturing of a kettle are illustrated in Figs. 5.3, 5.4 and 5.5. The manufacturing of the kettle requires the following operation for making the bowl: cutting a circular plate, boring a hole in the centre of the circular plate, setting the plate onto the machine, annealing to avoid wrinkles and cracks and profiling the kettle. In the images attached the process shown for the kettle looks more like a spinning process where the tool to bend the copper sheet would seem to spin while pressing onto the template of the kettle shape.\n\nFig. 5.4 Finishing the kettle. Legend a Hammering the kettle by hand https://www.yamaha.com/en/musical_instrument_guide/common/images/timpani/manufacturing_p01_10.jpg; b the hammer https://www.yamaha.com/en/musical_instrument_guide/common/images/timpani/manufacturing_p01_11.jpg; c polishing inside https://www.yamaha.com/en/musical_instrument_guide/common/images/timpani/manufacturing_p01_06.jpg; d polishing outside https://www.yamaha.com/en/musical_instrument_guide/common/images/timpani/manufacturing_p01_07.jpg; e final cleaning https://www.yamaha.com/en/musical_instrument_guide/common/images/timpani/manufacturing_p01_08.jpg; h coated kettle in the storage Full size image\n\nFig. 5.5 Assembling the kettle drum. Legend a Adjusting the tension rod angles https://www.yamaha.com/en/musical_instrument_guide/common/images/timpani/manufacturing_p01_12.jpg; b tension adjusting mechanism https://upload.wikimedia.org/wikipedia/commons/a/aa/Timpani%2C_Yamaha_pedal_timpani.jpg; c the black rods are tension rods https://www.yamaha.com/en/musical_instrument_guide/common/images/timpani/manufacturing_p01_13.jpg; d the silver rod in the centre is the tuning bolt https://www.yamaha.com/en/musical_instrument_guide/common/images/timpani/manufacturing_p01_14.jpg; e tightening the head with a ball under the pedal when the wire is attached to the shaft https://www.yamaha.com/en/musical_instrument_guide/common/images/timpani/manufacturing_p01_15.jpg; f tuning https://www.yamaha.com/en/musical_instrument_guide/common/images/timpani/manufacturing_p01_16.jpg Full size image\n\nFig. 5.6 Effect of hammering on the microstructure of a sheet of copper. Legend a macroscopic view of a hammered surface https://www.coppersmithcreations.com/wp-content/uploads/2016/11/collette-copper-freestanding-tub-double-wall-swatch.jpg; b microstructure of etched copper is viewed at 200 X magnificationhttps://www.clemex.com/wp-content/uploads/2018/09/535-1.jpg; c microstructure as cast; d as cast and cold hammered; e annealed/recrystallized; f annealed and cold hammered (https://www.tf.unikiel.de/matwis/amat/iss/kap_a/illustr/ia_1_5.html Full size image\n\nThe next series of operations for finishing the kettles are: the hammering of the external surface of the kettle, polishing the internal and external surface of the kettle, cleaning the kettle, protecting the surface with a thin layer of varnish, and storage of the coated kettle.\n\nAssembling the timpani starts with adjusting the tension rod angles, followed by adjusting the tension in the spider, tightening the head with a ball under the pedal when the wire is attached to the shaft, fixing the velum and tuning the timpani with a frequency meter.\n\nFor prestigious instruments, hammering is done by hand. For mass production instruments pneumatic hammering is preferred, which requires much skill and careful control of the hammer movement and of the impact force to achieve the appropriate depth, without splitting the surface of the kettle. The hammer could be attached to a controlled industrial robotic arm, and in this way eliminates dependency on a skilled operator.\n\nThe hammering generates plastic deformations (observed on the surface of the kettle as” shallow dents”) and residual stresses. The hammering determines their redistribution and a modification of the microstructure of the metal. This can have consequences on the acoustical properties of the bowl. Timpanists always expressed their preference for hand hammering and they claimed an influence of this technique on the acoustical quality of the timpani.\n\nThe effects of hammering on the microstructure of a sheet of copper are illustrated in Fig. 5.6. Cast copper has a clear dendritic structure. Cold hammering produces a distorted dendritic structure with twins and a dark area with dislocations. Annealed and recrystalized copper has big grains with relatively straight boundaries, a few twins and precipitates on the boundaries. On annealed and then cold -deformed copper, there are wobbly grains with many twins and “dark” areas and dislocations.\n\nDamping phenomena, in the case of the kettle of the timpani, as a vibrating system, have been studied thoroughly by Fleischer (1988). There are two types of damping, namely material damping and structural damping, as in any vibrating system (Nashif et al. 1985). Structural damping usually comes firstly from sound radiation and the conversion of this to heat and secondly comes from the joints, the attachments, etc., and includes interfacial micro slipping, air pumping, and rattling of loose joints.\n\nMaterial damping also referred to as internal friction has been attributed to several mechanisms which are inherent to the material (Adams 1972). Data on material damping for the kettle are given in Table 5.3. Brass containing only a few percent of Pb has significantly higher damping properties than alloys which are otherwise identical in composition and hardness, because of plastic deformation of the globules of lead.\n\nTable 5.3 Mechanical parameters of some materials for snare drum (data from Blanter et al. 2007 and Haynes 2014) Full size table\n\nAnother problem is connected to the cold deformation of the sheet of metal for the kettle. It was established in the literature (Zener 1938; Bert 1973; Marin 1962; Bloss and Rao 2002) that the internal friction in metals is expected to increase with cold forming. Zener (1940) assumed that the increase in internal friction was a consequence of the residual stresses produced by inhomogeneous cold working and by dislocations at grain boundaries. Additionally, plastic deformation at normal room temperature causes a decrease in the elastic Young’s modulus, an increase in material damping, and a subsequent rapid recovery. This effect is known as the Kӧster effect (Norwick 1958).\n\nMaterial selection for kettles is a challenging step in the manufacturing of timpani. Ashby (2005) suggested several criteria for their mechanical design based on among other things the mechanical properties of materials such as Young modulus and loss factor for expressing the internal friction capacity of materials.\n\nThe metals described in the previous table, selected for the manufacturing of kettles were chosen because of their excellence. They offer exceptional corrosion resistance, provide a light weight, and can be hard coated and coloured with an anodizing process. However, the alternative of using these metal alloys for kettle making requires changes to the traditional production process.\n\nThe kettle surface can be coated with several layers of varnish to provide protection against corrosion and improve surface hardness. These protection layers inevitably contribute to an increase in the system damping. Surface treatments are to have them chrome plated, spray painted or bake painted. Manipulation of the vibration system loss factor would be mainly through the manipulation of the thickness of the coating layers."}]}