{"Yaakov Israel Ifargan began his career in the Israeli business world in the early 1970s.": [{"url": "https://www.npr.org/2012/07/30/157593242/in-israel-rabbis-rank-among-the-rich-and-famous", "page_content": "In Israel, Rabbis Rank Among The Rich And Famous\n\nEnlarge this image toggle caption Tsafrir Abayov/AP Tsafrir Abayov/AP\n\nOver the past year, Israelis have taken to the streets to protest the country's high cost of living. They've also directed their anger at a small group of business moguls who have used their close ties to government officials to gain control of large chunks of the Israeli economy.\n\nNow, the Israeli edition of Forbes magazine has shed light on a surprising category of Israelis who have quietly also climbed to the top rung of society: multimillionaire rabbis.\n\nRabbi Yaacov Israel Ifargan is one of them. Earlier this month, 1,000 major supporters from across the country flocked to Netivot, a blue-collar town in Israel's southern desert, for an annual gala event honoring their spiritual guru.\n\nRabbis' Riches Here is the estimated wealth of Israel's top 10 richest rabbis, according to the Israeli edition of Forbes magazine. 1. Rabbi Pinchas Abuhatzeira: $335 million 2. Rabbi David Chai Abuhatzeira: $194 million 3. Rabbi Yaacov Ariyeh Alter: $90 million 4. Rabbi Yisaschar Dov Rokach: $46 million 5. Rabbi Nir Ben Artzi: $26 million 6. Rabbi Yaacov Israel Ifargan: $23 million 7. Rabbi Yoshiyahu Yosef Pinto: $19 million 8. Rabbi Baruch Abuhatzeira: $13 million 9. Rabbi Reuven Albaz: $10 million 10. Rabbi Yoram Aberjil: $9 million Note: The exchange rate used is 1 NIS= 0.2581 USD\n\nThe emcee gave Ifargan a rock star's welcome. Later, one by one, guests came up to the dais to sing the rabbi's praises, each speaker more important than the last.\n\nThe chief rabbi of the Israeli army said a few words. So did government ministers. Prime Minister Benjamin Netanyahu sent his blessings in a video address.\n\nThere were advertising executives in the crowd, top businessmen, even a supermodel. Ifargan is no less of a star.\n\n\"The rabbi has abilities that people don't understand, something that we cannot grasp, doesn't make sense to everyday person,\" said Ifargan's aide, Amos Elad. \"You know, he can see someone and he can see right through him. That's why they call him, the nickname is, the 'X-ray' rabbi.\"\n\nDonations In Exchange For Insight\n\n\n\nOver the past two decades, the X-ray rabbi has cultivated a celebrity following among Israel's wealthiest business people. They seek the rabbi's advice about their health and their personal lives, and, some say, their stock options. Politicians and army generals also turn to the rabbi.\n\nNone of them are particularly religious. So why do they do it?\n\n\"Israel is in a chronic state of emergency,\" says anthropologist Yoram Bilu. \"There are so many questions which cannot be answered. Should we attack Iran or should we not? You know, no one knows the answer, no one knows the future. It's entirely fluid. You know, going to an oracle, I think, it's not a far-fetched solution. Throw a dice.\"\n\nIn times of uncertainty, Ifargan offers certainty. In exchange, his followers offer him generous sums of money. Forbes in Israel ranks him the country's sixth-richest rabbi with an estimated worth of $23 million. He's one of a few hundred self-styled Jewish mystics in Israel.\n\nEnlarge this image toggle caption Daniel Estrin for NPR Daniel Estrin for NPR\n\nThe tradition began in Morocco. The Baba Sali, a revered Moroccan kabbala master, moved to Israel in the 1960s. When he died, his descendants built their own rabbinic franchises — and began turning a profit.\n\nThe Baba Sali's grandson, Rabbi Elazar Abuhatzeira, became the wealthiest of them all. He had many followers in Israel, but also one dogged pursuer: investigative journalist Yossi Bar-Moha. In the late 1990s, Bar-Moha began publishing exposes claiming the rabbi was forcing his followers to pay enormous sums for his blessings.\n\nBar-Moha proudly flips through notes from a police investigation into Abuhatzeira. At one point, the journalist confronted the rabbi himself.\n\n\"I told him, in your bank account you have 600 million shekels. Where are you going to take it, to the grave?\" Bar-Moha says.\n\nFollowing The Money Trail\n\nLast year, Abuhatzeira was stabbed to death by one of his followers, who was upset the rabbi's blessings hadn't helped him. The dead rabbi's son, Pinchas, inherited his father's wealth. Forbes crowns Pinchas Abuhatzeira Israel's richest rabbi, with an estimated wealth of $335 million.\n\nIsraeli tax authorities are now investigating some of Israel's high-flying rabbis for tax fraud.\n\nRabbis say they use their funds to help the needy. At the recent gala for the X-ray rabbi, his aide said Ifargan's franchise is above board.\n\nJust before the evening came to an end, Ifargan issued a few words to his followers. He said many people worry about national security and worry about the economy. But one thing is clear: The power of belief will make you secure.\n\nThen, shortly after midnight, his bodyguards ducked him into a black Mercedes-Benz, and he was gone."}, {"url": "https://finance.yahoo.com/news/israels-richest-rabbis-become-savvy-140820792.html", "page_content": "In a Sunday July 1, 2012 photo, Rabbi Yaakov Israel Ifargan, right, known as the 'X-Ray' rabbi for the belief he has the ability to diagnose patients by eyesight only, sits next to businessman Nochi Dankner, left, at the annual gathering of the rabbi's followers and supporters in the town of Netivot, southern Israel. Over the past few decades, Ifargan and dozens of other rabbis have carefully positioned themselves at the fulcrum of Israeli power and influence. (AP Photo/Tsafrir Abayov)\n\nNETIVOT, Israel (AP) -- One summer night, on the outskirts of a sleepy desert town, a who's who of Israel's elite gathered for an annual feast to honor a rabbi whose gaze is said to pierce the soul.\n\nHe's Rabbi Yaacov Israel Ifargan. But he is better known as, simply, the X-ray.\n\nOver the past few decades, he and dozens of other rabbis have carefully positioned themselves at the fulcrum of Israeli power and influence. They have attracted throngs of adherents — most notably some of the country's top business moguls, who pay top shekel for an audience with their rabbi to solicit blessings and discuss business matters.\n\nThese magnates have helped fuel the rise of a rabbinic aristocracy whose members have channeled the donations they receive into multi-million-dollar empires. After gaining experience dishing out advice to Israeli tycoons, the rabbis have become shrewd businessmen themselves, managing hefty investments in stocks and real estate at home and abroad — with much of their earnings allegedly kept far from the watchful eyes of Israeli tax collectors.\n\nTheir chief critic calls them swindlers and frauds, and some fellow rabbis are critical of their practices.\n\nThe Israeli edition of Forbes magazine published a first-of-its-kind ranking last month of Israel's 13 richest rabbis. In the number one spot was 36-year-old Rabbi Pinchas Abuhatzeira from Beersheba, a blue-collar southern desert city, whose wealth is estimated at $335 million. The X-ray rabbi placed sixth, with an estimated net worth of $23 million.\n\n\"Every single shekel brings about true peace,\" announced the X-ray rabbi's half brother, Rabbi Hayim Amram Ifargan, from the dais at the recent gathering, in a gentle nudge to the crowd of VIPs to continue their support.\n\nHe, too, is a part of the Ifargan family franchise. His spiritual adherents call him \"The MRI.\" In the women's section behind a laced divider sat \"The Arbitrator\" or \"The CT,\" Ifargan's millionaire sister Bruria Zvuluni, a go-to spiritual counselor who claims to have mediated feuds between Israeli crime kingpins. Though she is not a rabbi, she made it to the bottom of Forbes' list.\n\nCozying up at Ifargan's long table were lawmakers, one of Israel's top lawyers, and two of Israel's wealthiest businessmen: Menahem Gurevitch, chairman of a leading Israeli insurance company, and billionaire Nochi Dankner, head of Israel's largest holding company and a close confidant of Ifargan for the last 14 years. The Israeli army's chief rabbi and a top police commander were there, and Prime Minister Benjamin Netanyahu sent his blessings in a recorded video message.\n\nRabbis who make fortunes for themselves and encourage others to make money with their blessings draw the wrath of some fellow Jewish clerics.\n\n\"It's disappointing when religion descends to this,\" said Rabbi Donniel Hartman, president of the Shalom Hartman institute, a modern Orthodox Jewish learning center in Jerusalem. \"It's not some channel of divine power for personal wealth accumulation. That's small religion.\"\n\nMost rabbis in Israel are not raking in millions. They are instead salaried government employees, assigned by Israel's official rabbinate to perform religious rites for the Jewish public such as marriages and burials, or to enforce Jewish dietary laws in restaurants and hotels.\n\nThey are nowhere near the level of the high-flying spiritual gurus like the X-ray.\n\nSuch gurus set up public office hours in their homes to receive Israelis on all rungs of the social ladder, as long as they come with cash. In exchange, adherents receive amulets and little pieces of paper containing the rabbi's personalized blessing. The most successful rabbis have founded charitable institutions and small religious seminaries, which act as conduits for the incoming cash flow.\n\nMenachem Friedman, an expert on Orthodox Judaism and professor emeritus at Bar Ilan University, says religious Jewish businessmen since the 19th century have solicited rabbis' blessings for cash to ensure their success — though today the sums have reached unprecedented amounts.\n\n\"If the market is dangerous and shaky, the millionaires who benefit from that market have less confidence. They need these rabbis to give them that security,\" Friedman said.\n\nThe country's richest rabbinic dynasty is the Abuhatzeira family, scions of the revered Baba Sali who left Morocco for Israel in 1963, gaining a following among Israel's large Moroccan and Middle Eastern Jewish immigrant population. The Baba Sali died in 1984, but his portrait — a shriveled face wrapped in a white shawl — still graces the walls of Israeli homes, businesses and falafel stands.\n\nHis grandson, Rabbi Elazar Abuhatzeira, became the richest of them all, building himself a three-story villa said to include an events hall, deluxe guest rooms for important donors and an underground tunnel allowing him safe passage to his synagogue and office across the street, according to journalist Yossi Bar-Moha, who says he obtained the house plans from the Beersheba municipality.\n\nBar-Moha published a series of exposes in Israeli dailies accusing the rabbi of cheating his followers into believing he had no money in the bank, and violently threatening some to pay up.\n\nThe Israeli police's national fraud squad opened an investigation in the late 1990s, discovering $125 million in his personal account. He reportedly reached a settlement with Israel's tax authorities to pay a fraction of what he owed them.\n\nLast year, a desperate adherent whose donations to the rabbi hadn't improved his lot stabbed Rabbi Abuhatzeira to death. His son, Rabbi Pinchas Abuhatzeira, inherited his wealth and his spot at the top of Israel's affluent rabbinic aristocracy.\n\n\"These rabbis are charlatans, swindlers and cheaters. They have no real knowledge. And people eat it up,\" said reporter Bar-Moha, who heads Tel Aviv's journalists' association.\n\nAn Israeli tax official, speaking anonymously because of the issue's sensitivity, said in the past two years tax authorities have approached some 20 religious figures, requesting earnings reports. Some rabbis have been investigated for tax fraud. No convictions are known, but some have reportedly reached settlements with Israeli tax authorities.\n\nReached for comment, advisers of some of the rabbis profiled by Forbes either would not comment on the income estimates, or said they were wrong but would not provide other figures. A spokesman for Rabbi Ifargan said his charitable institutions and received donations are above board.\n\nAt the end of the feast, adherents followed Rabbi Ifargan up a hill to pray at the hulking stone pyramid that houses his father's grave. Ifargan emerged from the tomb surrounded by paparazzi, bodyguards and a host of followers shouting out requests for the rabbi to pray for their health and for their children to find a good match.\n\nWhen an Associated Press reporter asked the rabbi the secret to his success, Ifargan stopped. The 46-year-old rabbi with a pointed jet-black beard and brimmed hat fixed his gaze for a few moments, cocked his head up toward the heavens and shrugged.\n\nThen his bodyguards whisked him into a black Mercedes-Benz, and they sped off."}, {"url": "https://infogalactic.com/info/Yaakov_Israel_Ifargan", "page_content": "From Infogalactic: the planetary knowledge core\n\nYaakov Israel Ifargan (יעקב ישראל איפרגן, born 1966), also known as the X-ray (Hebrew: ha-Rentgen), is an Israeli Kabbalist rabbi and spiritual adviser who operates in Netivot, a town in southern Israel. He is known among his followers for his supposed healing and prognostic powers. Ifargan's admirers includes a mix of low income Mizrahi Jewish people from southern Israel, as well as high profile Israeli politicians, businessmen and celebrities. Ifargan also has a following among a group of Breslov Hasidim.[1][2]\n\nIfargan is the son of Shalom Ifargan (Baba Shalom), and he transformed his fathers tomb in Netivot into an ultramodern, pyramid shaped mausoleum, where he conducts an annual gala event, and holds his midnight Tikkun (reparation) ceremonies.[3][4]\n\nFile:JacobIfarganAmulet.png Advertisement for a Kabbalistic amulet, with the Rabbi's handwritten endorsement and signature (in Hebrew).\n\nIfargan provides blessings and business advice to some of Israel’s most prominent businessmen and politicians for a fee, and adherents believe he has the ability to diagnose patients by eyesight only. Others claim he is a charlatan who has grown into a multimillionaire from selling amulets and from other illicit businesses.[5]\n\nHe is one of the wealthiest rabbis in Israel, with an estimated net worth of $23 million as of 2012.[6][7][8] One of the foremost followers of the Rabbi is Nochi Dankner, a leading Israeli businessman, who's donated hundreds of thousands of Israeli shekels to the Rabbi's causes.[2]\n\nA 2001 report by the daily Yedioth Ahronoth, claimed that most of the sums donated are not made known to the Israeli tax authorities,[9] although this is denied by Ifargan.\n\nBiography\n\nIfargan was born in 1966, in Netivot, a town in southern Israel, as the ninth and youngest child of Shalom and Esther Ifargan. In his childhood, he was no different than other children of his age, and did not exhibit unusual personality traits. Like most other residents of the town, the Ifargan family was a low-class family who originally came from Tiznit, Morocco.[10]\n\nIfargan did not undergo formal rabbinic ordination.[11] He studied in a religious Yeshiva, but dropped out at the age of 17. He spent a year studying mysticism in seclusion, in the forests of northern Israel. Then, at the age of 18 he was enlisted to the Israeli army, and served for three years as required by law. When his father died in 1995, Ifargan began spreading legends on the mystical powers of his father, which he claimed had healing powers and predicted the future. He started performing spiritual activities out of his parent's house, as well as the gravesite estate that he purchased for his father, outside of the Netivot cemetery. Ifargan started claiming that he possessed prophetic powers, by which he can see the future as well as diagnose the health problems of people. A diverse community of miracle-seeking admirers began to form around the young mystic, then 30 years old. His followers were impressed with his supposed abilities, dubbing him \"The X-ray\".[10]\n\nIn 2008, Ifergan's \"Netivot Shalom\" list won four seats in the Netivot city council elections.[12]\n\nIn 2010, Netivot's city comptroller, Shimon Alon, a confidant of a rival Netivot kabbalist, Baba Baruch, was arrested for allegedly paying a young woman to seduce Ifargan and photograph him in intimate positions, with the aim of tarnishing his image.[13]\n\nIfargan is also a rival of Netivot rabbi Yoram Abergel. In 2013, Abergel ase well as the Israeli crime boss Shalom Domrani was arrested for threatening Ifargan to support Mayor Yehiel Zohar in the Netivot municipal elections. Abergel’s supporters lobbied for the reelection of Mayor Yehiel Zohar, while Ifergan supported the challenger, Eyal Mesika.[14]\n\nIfergan's aides publish \"Inyan Ba'ir\", a Netivot local newspaper, to get across the rabbi's messages and strengthen his public profile.[15]\n\nTikkun ceremonies\n\nIfargan erected a large, truncated pyramid shaped mausoleum for his father at the top of a hill, entirely covered in white marble. In this location he performs ceremonies, and most importantly, the Tikkun (reparation). The ceremonies are always opened by David Zarfati, Ifargan's master of ceremonies, who instructs the participants, who sing and clap their hands, while loud music is played. Ifargan throws thousands of candles into a bonfire, creating massive flames. Sometimes Ifargan places his hands in the fire but is not burned. Ifargan says that this is a Kabbalistic ceremony. In reality the ceremony is unique in form, and differs significantly from the traditional Kabbalistic Tikkun, which does not include a bonfire. The ceremony is preceded by prayer services and a collection of donations.[10]\n\nCriticism\n\nThe use of religion to gain profit, by Ifargan and other rabbis, drew criticism by other Jewish clerics, such as Rabbi Donniel Hartman, president of the Shalom Hartman Institute, who said \"It's disappointing when religion descends to this... It's not some channel of divine power for personal wealth accumulation. That's small religion.\"[7] Ifargan wears modern Haredi dress.[9] By doing so, Dr. Anat Feldman of the Achva Academic College, says he creates an image that he is part of the rabbinic establishment, thus gaining additional public legitimacy.[10] However, some Haredi leaders including Rabbi Ovadia Yosef and Rabbi Chaim Kanievsky have denounced Ifergan’s magical practices.[16] The rabbis accused Ifergan of paganism and called him a \"fiend\", further threatening that that anyone associated with Ifergan would have no part in the next world. In 2009, a reconciliation meeting took place between Ifargan and some prominent Ashkenazi rabbis, including Aharon Leib Steinman, Haim Kanyevsky, Nissim Karelitz and Michel Yehuda Lefkowitz .[17]\n\nSee also"}, {"url": "https://peoplepill.com/people/yaakov-israel-ifargan/", "page_content": "Yaakov Israel Ifargan (יעקב ישראל איפרגן, born 1966), also known as the X-ray (Hebrew: ha-Rentgen), is an Israeli Kabbalist rabbi and spiritual adviser who operates in Netivot, a town in southern Israel. He is known among his followers for his supposed healing and prognostic powers. Ifargan's admirers includes a mix of low income Mizrahi Jewish people from southern Israel, as well as high profile Israeli politicians, businessmen and celebrities. Ifargan also has a following among a group of Breslov Hasidim.\n\nIfargan is the son of Shalom Ifargan (Baba Shalom), and he transformed his fathers tomb in Netivot into an ultramodern, pyramid shaped mausoleum, where he conducts an annual gala event, and holds his midnight Tikkun (reparation) ceremonies.\n\nIfargan provides blessings and business advice to some of Israel’s most prominent businessmen and politicians for a fee, and adherents believe he has the ability to diagnose patients by eyesight only. Others claim he is a charlatan who has grown into a multimillionaire from selling amulets and from other illicit businesses.\n\nHe is one of the wealthiest rabbis in Israel, with an estimated net worth of $23 million as of 2012. One of the foremost followers of the Rabbi is Nochi Dankner, a leading Israeli businessman, who's donated hundreds of thousands of Israeli shekels to the Rabbi's causes.\n\nA 2001 report by the daily Yedioth Ahronoth, claimed that most of the sums donated are not made known to the Israeli tax authorities, although this is denied by Ifargan.\n\nBiography\n\nIfargan was born in 1966, in Netivot, a town in southern Israel, as the ninth and youngest child of Shalom and Esther Ifargan. In his childhood, he was no different than other children of his age, and did not exhibit unusual personality traits. Like most other residents of the town, the Ifargan family was a lower-class family who originally came from Tiznit, Morocco.\n\nIfargan did not undergo formal rabbinic ordination. He studied in a religious Yeshiva, but dropped out at the age of 17. He spent a year studying mysticism in seclusion, in the forests of northern Israel. Then, at the age of 18 he was enlisted to the Israeli army, and served for three years as required by law. When his father died in 1995, Ifargan began spreading legends on the mystical powers of his father, which he claimed had healing powers and predicted the future. He started performing spiritual activities out of his parents’ house, as well as the gravesite estate that he purchased for his father, outside of the Netivot cemetery. Ifargan started claiming that he possessed prophetic powers, by which he can see the future as well as diagnose the health problems of people. A diverse community of miracle-seeking admirers began to form around the young mystic, then 30 years old. His followers were impressed with his supposed abilities, dubbing him \"The X-ray\".\n\nIn 2008, Ifergan's \"Netivot Shalom\" list won four seats in the Netivot city council elections.\n\nIn 2010, Netivot's city comptroller, Shimon Alon, a confidant of a rival Netivot kabbalist, Baba Baruch, was arrested for allegedly paying a young woman to seduce Ifargan and photograph him in intimate positions, with the aim of tarnishing his image.\n\nIfargan is also a rival of Netivot rabbi Yoram Abergel. In 2013, Abergel as well as the Israeli crime boss Shalom Domrani was arrested for threatening Ifargan to support Mayor Yehiel Zohar in the Netivot municipal elections. Abergel’s supporters lobbied for the reelection of Mayor Yehiel Zohar, while Ifergan supported the challenger, Eyal Mesika.\n\nIfergan's aides publish \"Inyan Ba'ir\", a Netivot local newspaper, to get across the rabbi's messages and strengthen his public profile.\n\nTikkun ceremonies\n\nIfargan erected a large, truncated pyramid shaped mausoleum for his father at the top of a hill, entirely covered in white marble. In this location he performs ceremonies, and most importantly, the Tikkun (reparation). The ceremonies are always opened by David Zarfati, Ifargan's master of ceremonies, who instructs the participants, who sing and clap their hands, while loud music is played. Ifargan throws thousands of candles into a bonfire, creating massive flames. Sometimes Ifargan places his hands in the fire but is not burned. Ifargan says that this is a Kabbalistic ceremony. In reality the ceremony is unique in form, and differs significantly from the traditional Kabbalistic Tikkun, which does not include a bonfire. The ceremony is preceded by prayer services and a collection of donations.\n\nCriticism\n\nThe use of religion to gain profit, by Ifargan and other rabbis, drew criticism by other Jewish clerics, such as Rabbi Donniel Hartman, president of the Shalom Hartman Institute, who said \"It's disappointing when religion descends to this... It's not some channel of divine power for personal wealth accumulation. That's small religion.\" Ifargan wears modern Haredi dress. By doing so, Dr. Anat Feldman of the Achva Academic College, says he creates an image that he is part of the rabbinic establishment, thus gaining additional public legitimacy. However, some Haredi leaders including Rabbi Ovadia Yosef and Rabbi Chaim Kanievsky have denounced Ifergan’s magical practices. The rabbis accused Ifergan of paganism and called him a \"fiend\", further threatening that anyone associated with Ifergan would have no part in the next world. In 2009, a reconciliation meeting took place between Ifargan and some prominent Ashkenazi rabbis, including Aharon Leib Steinman, Haim Kanyevsky, Nissim Karelitz and Michel Yehuda Lefkowitz ."}, {"url": "https://www.jpost.com/Special-Content/Four-Israeli-Entrepreneurs-and-Their-Ground-breaking-Start-ups-585439", "page_content": "Israel is the home of the start-up. It boasts more Nasdaq-listed firms than all but two other countries – the US and China – and has more venture capital than any other nation.\n\nIsrael-based businesses are operating at the cutting edge of their respective sectors – and contributing huge amounts to the global economy. For example, brands like Waze, Viber and Mobileye all began life as Israeli start-ups.\n\nWith start-ups so integral to Israel’s business landscape, let’s take a look at five of the country’s key business leaders who built brands that became billion-dollar giants.\n\nAvi and Aaron Shaked\n\nBrothers Avi and Aaron were born in Netanya and both studied at Ben Gurion University, although neither were initially set to pursue careers in enterprise as you might expect – given that they went on to build the hugely successful 888 Holdings. Avi studied Chemical Engineering and Aaron was studying to be a dentist. It was at a dental conference in Monte Carlo where, among the bright lights and hubbub of the casino, Aaron came up with the idea for an online casino that would change their lives and revolutionize the remote gambling sector.\n\nThe Shaked brothers launched Casino-on-Net in 1997 and became one of the first online casinos available worldwide. Rather than just offering one type of game, Casino-on-Net aimed to bring the whole casino experience into players’ living rooms, with a variety of playable options. It was soon followed by their second venture, Reef Club Casino.\n\nIn 2005 the brothers decided to float the company on the London Stock Market and only three years later it achieved FTSE 250 status. 888 Holdings has launched several brands that have become some of the most recognized online gambling operators in the world – including 888 Casino and 888 Poker.\n\nAlong the way, 888 Holdings have acquired a number of other notable brands including Globalcom, which enabled them to branch out into the bingo market with Wink Bingo. The company’s most recent acquisition was sealed in February 2019, when they bought out Costa Bingo, Slot Crazy and Fantastic Spins for a combined £18 million – tightening its grip on the steadily growing online bingo sector.\n\nThe Shaked brothers decided to take a backseat in 2006 and went their separate ways with new ventures. Avi ventured into politics and, although ultimately unsuccessful in running for Parliament, he remains a hugely influential figure. He also moved into the food industry, involving his son Eyal in his new business ventures in China, where the pair have opened 130 cafés.\n\nAaron became a philanthropist, primarily investing in community development to build new homes schools in underprivileged areas across Israel.\n\nAdam Neumann\n\n\n\nBorn in Tel Aviv, Adam Neumann divided his early years between Israel and America, spending time in both Indianapolis and New York, where he eventually settled after attending Baruch College. In Israel, Neumann grew up partly in a kibbutz, an experience that helped shape his world view and influenced the community element of WeWork – the company he went on to found.\n\n“As a teenager and as a child, it was the most unbelievable place to grow up. I was with my friends from morning till night. We ate in the same dining hall, we drove to the same school, and then we all did our homework together, or we didn’t do our homework together. It was awesome,” he said. “So yes, community is definitely a difference, but I think the real difference is intention and meaning behind what we do.”\n\nAfter beginning several ventures which didn’t get off the ground, Neumann struck gold in 2010 when he started WeWork. The company’s business model was creating and leasing communal work-spaces with high-caliber amenities and wellness and innovation at their center. The business was a huge hit, expanding first through the US and then across the globe into London, Tel Aviv and Shanghai, with more cities soon following suit. Now with 10 locations in Neumann’s home country of Israel, including the latest in Tel Aviv and Jerusalem , WeWork is continuing to provide modern work-spaces that encourage the formation of new startups.\n\nNever one to be complacent, Neumann has been busy investing in other companies – including recently cannabis firm InterCure – hoping to continue inspiring new business and ideas.\n\nTeddy Sagi\n\n\n\nAnother Tel Aviv-born businessman, Teddy Sagi made his mark on the international tech scene before the age of 30. His business, Playtech, became the world leader in online gaming software, leasing designs and software to companies worldwide. Eager to grow his company quickly, Sagi listed Playtech on the London AIM before transferring it to the LSE in 2012 where it excelled as a publicly owned firm.\n\nSagi began focusing on other financial interests from around 2016, and in two years he’d sold off his remaining shares in Playtech. The billionaire has since bought major shares in Market Tech, a real estate venture holding property in a number of urban centers throughout Europe and the Middle East. One of Market Tech’s biggest holdings is Camden Market – London’s fourth-largest attraction with 100,000 people visiting every weekend.\n\n\n\nSagi has also set up LABS in the co-working space sector, and has a controlling share in cyber security giant KAPE. He is currently worth almost $4 billion dollars\n\nAvishai Abrahami\n\n\n\nSerial entrepreneur Avishai Abrahami is an experienced start-up founder best known as the man behind Wix.com – the do-it-yourself website hosting service.\n\nIn the early 1990s, Abrahami’s first job was in crack cyber-security team – known as Unit 8200 – in the Israeli military. His mission? To hack into the computers of two hostile nations. While it may seem like a pretty huge task for a guy barely out of high school, Abrahami excelled in the role – breaking into the two target machines and sapping their data. To achieve this he also had to overcome the challenge of accessing the enormous amount of computing power needed for the job.\n\nAfter leaving Unit 8200, Abrahami’s career took a different tack. He co-founded Wix.com in 2006, and by 2010 the company had 3.5 million users. This grew to 8.5 million by 2011 – by 2014, more than 34 million users had signed up to the Wix platform. Abrahami took Wix public In 2013 – on the same day he sold 500,000 of his shares.\n\n\n\nMost recently, Abrahami served as Director of SodaStream International.\n\nSummary\n\n\n\nWhile many Westerners see Israel as a developing nation, in reality it’s a hub for entrepreneurs. There are so many successful tech firms starting out here – and surely it is a question of when, rather than if, the next one will come along to take the world by storm."}, {"url": "https://joebidenbio.com/yaakov-israel-ifargan/", "page_content": "Age, Biography and Wiki\n\nYaakov Israel Ifargan was born on 4 December, 1966 in Netivot, Israel. Discover Yaakov Israel Ifargan’s Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 54 years old?\n\nPopular As N/A Occupation N/A Age 54 years old Zodiac Sign Sagittarius Born 4 December 1966 Birthday 4 December Birthplace Netivot, Israel Nationality\n\nWe recommend you to check the complete list of Famous People born on 4 December.\n\nHe is a member of famous with the age 54 years old group.\n\nYaakov Israel Ifargan Height, Weight & Measurements\n\nAt 54 years old, Yaakov Israel Ifargan height not available right now. We will update Yaakov Israel Ifargan’s Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nHe is currently single. He is not dating anyone. We don’t have much information about He’s past relationship and any previous engaged. According to our Database, He has no children.\n\nFamily Parents Shalom Ifargan Wife Not Available Sibling Not Available Children Not Available\n\nYaakov Israel Ifargan Net Worth\n\nHe net worth has been growing significantly in 2018-19. So, how much is Yaakov Israel Ifargan worth at the age of 54 years old? Yaakov Israel Ifargan’s income source is mostly from being a successful . He is from . We have estimated Yaakov Israel Ifargan’s net worth, money, salary, income, and assets.\n\nNet Worth in 2020 $1 Million – $5 Million Salary in 2019 Under Review Net Worth in 2019 Pending Salary in 2019 Under Review House Not Available Cars Not Available Source of Income\n\nYaakov Israel Ifargan Social Network\n\nTimeline of Yaakov Israel Ifargan"}, {"url": "https://www.middleeasteye.net/news/yaakov-fauci-israeli-settler-new-york-sheikh-jarrah", "page_content": "\"If I don't steal it, someone else is going to steal it.\"\n\nThose were the words of Yaakov Fauci, an Israeli settler squatting inside the Kurd family's home in Sheikh Jarrah, in response to Mona el-Kurd, a Palestinian writer and a resident of the East Jerusalem neighbourhood.\n\nThe video has since gone viral and became one of the catalysts for global attention on the imminent eviction of six Palestinian families from Sheikh Jarrah who are to be replaced by Israeli settlers.\n\nThe forcible evictions prompted protests, which were brutally cracked down on by Israeli authorities, who subsequently attacked Palestinian worshippers at the al-Aqsa Mosque.\n\nStay informed with MEE's newsletters Sign up to get the latest alerts, insights and analysis, starting with Turkey Unpacked\n\nA brutal escalation of violence followed, in which Israeli airstrikes on Gaza killed at least 243 Palestinians, including 66 children. Rockets fired from the besieged Palestinian enclave killed 12 people in Israel. In the occupied West Bank and East Jerusalem, 29 Palestinians were killed.\n\nA ceasefire has now been agreed upon between Israel and Hamas, but the illegal occupation continues in East Jerusalem and the West Bank. Palestinians from Sheikh Jarrah still await a delayed verdict on their appeal against forced eviction.\n\nSome people on social media have described \"Jacob from Long Island\" as a blessing to the Palestinian cause, exposing clearly to the world how Palestinians' homes are being taken over by Israeli settlers.\n\nBut who is Fauci, and what are his views? Middle East Eye takes a look at his Facebook page, first reported by Ted Bey on Twitter, which reveals support for Donald Trump, Covid and anti-vax conspiracy theories, and extreme statements against Palestinians.\n\nPalestinian eviction 'necessarily evil'\n\nIn his most recent Facebook posts, Fauci celebrated the attention he has garnered over the past month.\n\nHe updated his cover photo on 10 May to a cartoon of Nabil el-Kurd, Mona's father, kicking him out of Sheikh Jarrah. The cartoon was adapted from a photo taken by Middle East Eye with the 70-year-old Palestinian resident next to the writing “we will not leave”.\n\nA cartoon of Fauci being kicked out of Sheikh Jarrah by 70-year-old Palestinian resident Nabil el-Kurd (Screengrab/Facebook)\n\nOne of Fauci's friends joked that he should show the image to Kurd and recreate it, to which he replied \"there are too many shabab [youth] around him all the time\".\n\nIn another recent post, he photoshopped the \"woman yelling at a cat\" meme format over his face and Mona el-Kurd's, in an attempt to present himself as merely a helpless victim being shouted down by an angry woman.\n\nSince the viral video Fauci has doubled down on his belief that he should live in the Kurd family's home.\n\nFauci mocks Mona el-Kurd following viral video (Screengrab/Facebook)\n\n\"The right I have [to live there] is that the owner of the house wants me to live here and he wants there to be Jews living in this house,\" he said during an interview with VICE. \"I got chosen, for whatever reason, it ended up being me.\"\n\n\"Not too many people want to live here and it's important to live here and it's important to… make sure that this neighbourhood is not lost in any future peace deal.\"\n\nFauci, who was born in Long Island, New York, has lived in part of the Kurd's house for over a decade, after being recruited by Nahalat Shimon International, a US-based settler organisation seeking to change the demographics of East Jerusalem.\n\nHe said that his position was \"not to keep Palestinians out\" but \"to keep Jews in it\". He described the forcible evictions as \"necessarily evil\".\n\n\"[Palestinians] are not coming back into here, so whether I am here, whether I am not here, whether it's me, whether it's someone else, whether it's a monkey, whether it's a giraffe, they’re not coming back into this house ever.\"\n\n\"If I leave, I will be replaced immediately, and I venture to think that whoever comes here is not going to be as easy going as I am\".\n\nTrump support and Covid conspiracy\n\nTwo of Fauci's Facebook profile pictures suggest he is a supporter of former US President Donald Trump.\n\nIn one picture, the American-born Israeli wore a 'Make America Great' hat. In another, he uploaded a picture of a man with a temporary tattoo with Trump's name on his forehead and a US flag in his hand.\n\n\"I fear it may be 'too late' for America. It was a nice run. Even Rome fell eventually,\" he commented under one of the pictures, reacting to President Joe Biden's victory.\n\nSeveral of Fauci's posts over the past year promote scepticism and conspiracy theories regarding Covid-19 and the vaccine.\n\nLast year, he posted an image of the Covid-19 virus photoshopped over the golden calf - a reference to a religious story in which the Israelites worshipped an idol after the long absence of Moses in the mountains. The post appeared to suggest that Israelis today were seemingly deifying the disease.\n\nFauci posts a controversial image comparing Covid-19 to a religious story dating back to the time of Moses (Screengrab/Facebook)\n\nIn another controversial post, he updated his profile picture to include a yellow badge, similar to the one Jews were forced to wear by Nazi authorities between 1939 and 1945 during the Holocaust. The picture reflected what he perceived to be the consequences of the vaccine.\n\nOne of his friends commented asking whether the badge was \"a step too far\".\n\nFauci compares Covid-19 vaccine to a yellow badge (Screengrab/Facebook)\n\n\"Not at all, if anything it's toned down. The last time they made certain people wear ‘badges’ no one dreamed what was to come either. It’s really better we nipped it in the bud this time,\" Fauci responded.\n\nAnother friend said that he showed the post to his mother, who had survived the Holocaust, and she was \"disgusted\" by it.\n\n\"You'd think a Shoah [Holocaust] survivor would be screaming bloody murder about forced medical experiments on the population. Who needs [Nazi physician who did deadly experiments on prisoners] Dr Mengele, when we do it to ourselves,\" Fauci replied.\n\nLater in February, he updated his cover photo to an anti-vax banner describing the Covid-19 passport as \"apartheid\".\n\nDespite his anti-vax sentiments, in April, Fauci updated his profile picture to signal that he had been inoculated.\n\n\"After a lot of careful thought, research, and massive internal soul searching with the help of my therapist, I finally decided to bite the bullet and get the shot,\" he said. \"I realised that my objections were not coming from a holy place and I was just being defiant and non-conformist.\"\n\nMEE reached out to Fauci for comment on his controversial views, but he did not respond by the time of publication.\n\nStorming Al-Aqsa\n\nIn several videos and profile pictures, the Israeli settler is seen outside the Al-Aqsa Mosque.\n\nIn August 2019, he posted a live video of himself with a group of Israeli Jews, flanked by Israeli police, in the courtyard of the Muslim holy site, with the caption \"afternoon ascent to the Temple Mount\".\n\nIn the background of the video, Palestinian protesters chant in opposition to the provocation.\n\n\"Can you hear the Arabs screaming in the background? Our peace partners, our cousins. If only the Jewish people knew the power of Jewish prayer on the Temple Mount, as much as the Arabs did, we would long ago have a temple built,\" Fauci says in the video.\n\nFauci takes a selfie outside Al-Aqsa in Jerusalem (Screengrab/Facebook)\n\nIsraeli settlers regularly enter the Al-Aqsa Mosque, and often illicitly perform prayers on the site, where they believe the Second Jewish Temple once stood.\n\nActivists have repeatedly sought to build support for an increased Jewish presence at the site, despite a longstanding joint guardianship agreement between Israel and Jordan, which retains control over Christian and Muslim holy sites in Jerusalem.\n\nAl-Aqsa Mosque was Islam's first Qibla, the direction towards which Muslims must turn to pray, before that was changed to Mecca, in what is now Saudi Arabia.\n\nPalestinians fear settler tours inside the Al-Aqsa compound may begin to normalise Israeli claims to the area, and further extinguish Palestinians' aspirations for full rights and a state of their own, with occupied East Jerusalem as its capital.\n\nIn one of Fauci's pictures outside Al-Aqsa, in which the Dome of the Rock can be seen, one of his friends's commented \"Please do not show anymore pics of that gold capped pimple\".\n\n\"Hopefully it will be gone soon,\" Fauci replied.\n\nInciting violence\n\nThe settler has made several controversial comments concerning the Israeli bombing of Gaza in 2014, which killed more than 2,200 Palestinians - mostly civilians.\n\nIn a post in June 2014, Fauci said that he would not be \"hoping in vain that the Israeli government will finally come to its senses and carpet bomb our enemies into oblivion\", and that he would not be calling for a \"Jewish Spring\" to rise up and \"settle the score against those who have been trying to destroy us for as long as we have existed\".\n\nHe said he wouldn’t be doing so \"not because I don’t believe it is right, fair or just\" but because of the fear of police arresting him for \"expressing what every sane person on planet earth is thinking\".\n\nFauci during Palestinian protests against his occupation of the Kurd house in 2011 (AFP/Ahmad Gharabli)\n\nFauci described himself as a \"coward\" who knew what needed to be done, but was not willing to pay the \"personal price\".\n\nIn a separate post, he said that he preferred the \"nuke and pave approach\" in Gaza, but knew it would not happen so offered a plan B.\n\nThe backup plan included cutting off water, electricity, and fuel supplies to Gaza, and that if Palestinians didn’t like it, they could “move to Sudan or Eritrea”.\n\n\"I would ideally say to go and DESTROY all of their infrastructure, but the human rights weenies will be up in arms,\" he said.\n\nIn a July 2014 post, he decried Israel for not \"effectively bomb[ing]\" Gaza and going on the offensive further.\n\n\"We think we are being merciful, we think we are morally superior, but the truth is we are acting in the most cruel and immoral way possible against our OWN brothers and sisters\".\n\nIn a Facebook note from November 2009, Fauci made clear that he would not denounce Yaakov Teitel, an American-born Israeli nationalist settler who was convicted of the killing of two Palestinians.\n\nFauci's post, dated before Teitel's conviction in 2012, stated: \"Even if he did do everything he is accused of… I refuse to throw him to the dogs in order to save face and find favour in the eyes of the world\".\n\n\"Arabs are the enemy. Missionaries are the enemy, and while I might not personally choose to utilise such methods to combat them or encourage others to do so, I certainly will NOT NOT NOT condemn anyone that does.\"\n\nElsewhere, in two of Fauci's profile pictures, he wears a keffiyeh around his head in an attempt to mock Palestinians and link them to terrorism.\n\n\"You always thought I was a terrorist,\" he commented under one of the pictures. \"I'm trying to score one of those ‘burqa babes’ from Beit Shemesh,\" he added.\n\nFauci is also the owner of a dangerous dog named Shiksa (a derogatory term used by some Jews to refer to non-Jewish people), which he unleashes on Palestinians as a purported form of protection.\n\nKahanist sentiments\n\nIn one profile picture, Fauci poses next to two topless men, stating: \"I am proud that I am confident enough in my (hetero)sexuality to post this.\"\n\n\"This is an attempt at humour, I did NOT catch teh [sic] ghey,\" he adds, in a derogatory remark.\n\nThe New York-born settler also shared content from Rabbi Meir Kahane, the former Israeli Knesset member and founder of the extremist Kach party.\n\nFauci shares a quote by Rabbi Meir Kahane (Screengrab/Facebook)\n\nHe shared a 1972 article by Kahane in which the rabbi denounces the modern-day way of celebrating the festival of Hanukah as “un-Jewish”.\n\nFauci also shared and lauded a Kahane quote which stated \"Better a strong Israel hated by the world than an Auschwitz loved by it\".\n\nKahane was born into an Orthodox Jewish family in New York in 1932 and believed in a homogeneously Jewish state run according to the Torah.\n\nHe called for the complete expulsion of Palestinians by force from their lands, and the annexation of the occupied West Bank.\n\nKahane's followers believe that the West Bank - occupied by Israel since 1967 in contravention of international law - and the eastern slopes of Jordan are part of the biblical kingdoms of Judea and Samaria.\n\nThe US State Department put Kach and Kahane Chai, two factions that emerged from Kahane’s original Kach party, on its list of foreign terrorist organisations following the 1994 massacre of 29 Palestinians at the Ibrahimi Mosque by one of its adherents.\n\nNow, Kahane's followers of the Religious Zionism bloc have won six seats in the parliament and were endorsed by Prime Minister Benjamin Netanyahu in a bid to weaken his opposition and form a national coalition government."}, {"url": "https://www.nytimes.com/2020/11/07/world/middleeast/israel-dubai-entrepreneurs.html", "page_content": "DUBAI — For years, Israeli entrepreneurs slipped in and out of the United Arab Emirates incognito, traveling on second passports or doing business through third parties.\n\nSo when more than two dozen Israeli high-tech executives turned up in Dubai recently, it was hard to miss them. Chatting away in Hebrew, they traipsed across the marbled expanses of the Dubai Mall and up to the V.I.P. observation deck atop the iconic Burj Khalifa, the world’s tallest building.\n\nIt had been less than six weeks since the Emirates and Bahrain, another Gulf Arab country, signed agreements to normalize relations with Israel and open up embassies. But this high-profile delegation of Israeli innovators was making a conspicuous entrance even before direct flights and other formal protocols had been established.\n\nTheir visit was an early outgrowth of a courtship between two sides that have been adversaries — at least publicly — for decades. But the speed with which the once-covert relationship burst into the open surprised even veteran insiders: The rancor of more than seven decades of Arab-Israeli conflict seemed to melt away in a matter of days."}, {"url": "https://www.cnbc.com/2020/07/14/israel-fights-coronavirus-early-progress-stalled-by-early-reopening.html", "page_content": "People walk in the West Bank settlement of Beitar Illit on July 8, 2020, after authorities reimposed lockdown restrictions to fight a spike in coronavirus infections. Menahem Kahana | AFP | Getty Images\n\nCNBC is looking at how countries around the world have tackled Covid-19. By talking to a wide range of experts, as well as everyday citizens, we're taking stock of what's gone well — and what hasn't. So far, there have been more than 10 million cases worldwide of Covid-19 and more than 500,000 people have died. The United States has reported more than 3 million cases and more than 130,000 deaths, the most of any country. Israel, the second country in our series, has confirmed more than 33,000 cases and more than 300 deaths. SEE ALSO: How Canada is fighting Covid-19: ramping up PPE production, travel ban from the U.S., and Bonnie Henry How Taiwan beat the coronavirus\n\nWhat has been going well\n\n\"The first wave\" Many of experts have separated Israel's response into two buckets: February to May, and May to now. Some are calling it the first and second wave of the virus. By mid-April, the country of 8.8 million was ready to declare that it had succeeded in the fight against Covid-19, and had begun reopening schools, bars and restaurants. Prime Minister Benjamin Netanyahu noted in press conferences at the time that the country had done an admirable job \"in safeguarding life and blocking the outbreak of the pandemic\" with its aggressive response. The mood in Israel was highly optimistic. But that wasn't the end of the story. The country is now seeing a fiftyfold increase in new cases and is starting to shut down pubs, pools and gyms once again. The government is now wondering whether Israel reopened too soon. Still, a lot went right in Israel in the first phase of the pandemic that other countries can learn from. One of the major reasons that Israel was largely able to fend off Covid-19 over the spring and early summer, they say, is that politicians deferred to public health experts to formulate a plan — and they stuck to it. There were early lockdowns across the country, and a decision to bar all flights from China in late January. \"A month ago, I remember jokingly saying to a friend in another country 'warm regards from the other side of the curve,\" said Yonatan Adiri, founder and CEO of Healthy.io, an Israel-based health-tech company. \"But it didn't last.\" Health IT Israel's health system provides universal coverage to citizens and permanent residents. And Israelis choose from four competing nonprofit health insurers that provide a benefits package. The country also collects medical information in a centralized manner, and the four insurers use the same technology. That made it easier for Israel's public health officials to conduct bio-surveillance and contact those at risk than it was in some other countries, like the U.S., where medical information is scattered across health systems. \"We created a predictive model for those likely to suffer from the virus and in early March, we sent SMS messages and followed up with personal phone calls from physicians to everyone at risk for the higher tier of Covid-19 complications,\" said Dr. Ran Balicer, a public health physician and director of health policy planning at Clalit, the largest of the HMOs. \"We told them that if they felt ill, they should call us and we would sort them out through telemedicine and home care as best we could.\" Balicer said that his company also sent daily questionnaires to members to collect responses about symptoms, which helped them create a \"geographic early warning sign.\" This kind of information is also relevant to help public health departments direct more testing and other resources where it's needed most. When it comes to bio-informatics and data science, most of the experts agreed that Israel is among the best in the world.\n\nWhat's been pretty good so far\n\nCulture of experimentation Israel is often referred to as a \"start-up nation\" for a reason. The country is known for its entrepreneurial ethos, and that same culture of experimentation has shone through during the Covid-19 crisis, experts say. \"This is the start-up nation so it's a lot of trial and error,\" said Dr. Yair Schindel, a managing partner for the Israeli health and life sciences venture fund aMoon and a member of the health ministry task force on the virus.\n\nProfessor Yair Ein-Eli takes part in a demonstration of a reusable face mask that his research team says can disinfect itself and kill the coronavirus, Haifa, northern Israel. Amir Cohen | Reuters\n\n\"We are trying things on a weekly basis,\" he said. \"And figuring out a way to live with this virus without shutting down the economy completely.\" Schindel said that the government is recommending that people in certain regions quarantine — \"sometimes it's a city, sometimes a neighborhood\" — and there's also a theory about using \"capsules\" to separate people into groups that can more closely congregate together at work and at schools. As it faces rising numbers of Covid-19 cases, he notes that there's been a willingness to try out various strategies to keep cases under control and curb rising levels of unemployment. Serology studies Schindel said that 100,000 citizens are taking a serological test, which is a blood test that looks for signs of a previous Covid-19 infection, to help officials better understand how the virus has spread across the population. This will help Israel figure out how to manage the next phase of the pandemic and determine if it has sufficient capacity within the health care system to treat an influx of Covid-19 cases. Still, there are many unknowns, including whether a positive result for Covid-19 confers immunity down the line when the person recovers.\n\nWhat's been disappointing so far\n\nVictim of its own early success? When the economy shut down at the start of the pandemic, many business owners suffered. One of them was Matthew Krieger, who runs a public relations firm called GKPR. Despite taking a hit, Krieger supported the measures to restrict access to public spaces because he felt that it was more important that the country take steps to save lives.\n\nA customer has his temperature taken at the entrance to a Tel Aviv restaurant in early June 2020 after some Israeli businesses reopened following the easing of coronavirus restrictions. Amir Cohen | Reuters\n\nBut he notes that some of his fellow residents now feel the response was too harsh, because there were so few cases of Covid-19 — until recently. \"It was an aggressive response, but it was the right response,\" said Krieger, who notes that he's been disappointed to see such a rapid reopening of the economy — and subsequent outbreak. Now, he said, he's nervous to go out in public and especially into large crowds. He feels that the public health measures should have been more thoughtfully rolled back to keep people safe. Contact tracing Israel was early to adopt contact tracing, a method to inform people who may have been in close contact with a Covid-19 carrier, to self-isolate. But the system has had its kinks. In recent weeks, thousands of Israelis got alerts on their cellphones that they must quarantine after an exposure. But as NPR reports, many people who received the message were at home, rather than in a place they could have bumped into someone with the virus. Needless to say, health officials got flooded with confused phone calls. Now, the country is evaluating whether it needs to hire more people to conduct the epidemiological investigations. There have also been privacy concerns with the country's approach to contact tracing. The Shin Bet security agency was given emergency powers in March to trace Covid-19 cases using the phone locations of those infected. But Israel's Supreme Court expressed concerns in late April that this kind of move could lead to a \"slippery slope\" of using \"extraordinary and harmful tools against citizens.\" Experts across public health largely believe that digital contact tracing, which involves using smartphones, is yet to be proven as a method to contain viruses. So for now, many civil rights groups are wondering whether the trade-off to citizens' privacy was worth it. The resurgence In recent weeks, Israel has seen a reemergence of the virus — and experts have a range of theories for that. One factor, according to Adiri, is politics. When the pandemic hit, Israel was dealing with the fallout of inconclusive elections that resulted in no majority in the country's parliament, making it impossible for a government to be formed. After a third election on May 17, the country finally appointed Benjamin Netanyahu and Benny Gantz to share power, with Netanyahu serving as prime minister for 18 months, then followed by Gantz. The two rivals announced they would set aside their differences to help the country through the Covid-19 crisis, but critics note that the government has swelled with new appointees at a time of record unemployment. \"This time around, we have a government in place so the civil servants and public health experts now have to interact with a lot of political incentives around them,\" said Adiri. Other experts suggest the country reopened too quickly, and did not heed the advice of public health experts. One top official, Siegal Sadetzki, resigned earlier this month in response, and posted a multipage letter on Facebook explaining her reasons. Many believe, including Sadetzki, that Israel moved too quickly from a total lockdown to removing restrictions, without a carefully constructed plan of phases. Now the country has moved to reimpose some of the restrictions that were lifted in May, but it may be too late, some experts believe. The country is now reporting around 1,100 daily infections, nearly double the peak in the spring. \"The tough part in the initial crisis we did really well,\" said Adiri. \"But the routine part when it comes to managing it and living with it, we're still not there.\" Everyone agreed, however, that it's too soon to determine how Israel is managing this current outbreak and whether it will rise to the challenge. \"It's difficult to talk about the events right now because they are still underway,\" said Balicer. \"I think the jury is still out, but overall I'd say that there has been a good amount of solidarity and all segments of society have come together to fight this.\"\n\nHow Israel scores overall: 7.5/10"}, {"url": "https://www.wbur.org/news/2017/12/18/israeli-cybersecurity-boston", "page_content": "When Lior Div, a veteran of the Israeli military intelligence Unit 8200, co-founded Cybereason in 2012, he quickly realized he needed to expand beyond his country's borders.\n\n\"If you want to build a meaningful company (and) not just build a company and sell it, you need to move to somewhere. Tel Aviv is not enough,\" said Div.\n\nAnd, like most cybersecurity CEOs in Israel, Div saw America as the promised land.\n\n\"Fifty percent of the market in cybersecurity is in the U.S.,\" he said. \"It's pure numbers, this is the biggest market.\"\n\nBut until recently, when most techies in Israel thought of the United States, Div says they only considered one option — Silicon Valley.\n\nDespite the California temptation, he opted for Boston, which, at the time, he said seemed \"weird\" to people back home in Tel Aviv.\n\n\"'Why did you move to Boston and not to Silicon Valley?' — We heard that question back in the day a lot,\" Div said when we met in his office on the 21st floor of the old Hancock tower with panoramic views of Boston.\n\nBut the trend is changing.\n\nA Formula That Draws Companies To Boston\n\nIn recent years, more than a dozen Israeli cybersecurity companies have made Massachusetts their home away from home, according to the Israeli Consulate General in Boston. They include Tufin, Morphisec, and Hexadite (recently acquired by Microsoft), to name a few. They're drawn to the city for three main factors: the proximity to customers; the local tech talent; and geography.\n\n\"When you do the math, it's the proximity to Israel, the time differences - it makes a huge difference,\" said Div. \"If you want to have an R&D center in Tel Aviv, the times that the team can work together become critical, and the east coast is much more lucrative versus the west coast.\"\n\nIsraeli-founded businesses in Massachusetts generated over $9 billion in revenue in 2015, according to a report from the New England-Israel Business Council. And the fastest growing sector (surpassing life sciences and IT) is cybersecurity, according to the report's lead author, David Goodtree.\n\n\"(Cyber) companies that have Israeli founders and a Boston leg ... have returned five and a half billion dollars of acquisition value to investors,\" Goodtree said.\n\nHe says the relationship dates back to the founding of RSA Security at MIT in the early 1980s, which was co-founded by Israeli Adi Shamir and essentially \"commercialized cryptography.\" (RSA was eventually acquired by Hopkinton-based Dell EMC which maintains an Israeli R&D facility to this day.)\n\n\"Israel is no doubt the epicenter of global cyber activity today,\" said Yehuda Yaakov, the Israeli Consul General to New England, after a cyber meeting at Harvard Business School this fall.\n\nCybersecurity: Israel's 'Next Frontier For Defense'\n\nOne major reason for Israel's strength is the military, which has played an outsized role in the development of the cybersecurity industry and created a conveyor belt of talent.\n\n\"There is a unique situation in Israel in that everyone is required to serve in the military,\" said Michael Coden, head of the cybersecurity division of BCG Platinion, the high-tech group within the Boston Consulting Group. \"And ... they come out of the military with some really good cybersecurity training.\"\n\nThe Israeli government has long seen cyber as the next frontier for defense vital to national security - akin to land, sea or air warfare.\n\nIn the U.S., cybersecurity experts might join a three-letter government agency as a career (think CIA, NSA, or DOD). But because of the mandatory military service in Israel, young entrepreneurs learn technical skills in the army, but then leave after a few years and might launch a startup. There's a natural cycle of cybersecurity experts in the private sector.\n\n\"You have the R&D activities going on in the military (and) you have the policies being pushed by the government,\" said Yaakov. \"This feeds into the business world and the academic world.\"\n\nTo this day - Israel remains a leader in the industry because of both its military and its history (frankly, it's just been doing this work longer than most other countries). And in fact, Israeli companies, despite moving operations, sales and marketing etc. to Boston often maintain much of their R&D in Israel.\n\nBut the reason they go abroad is financial necessity — it's a matter of trying to monetize cybersecurity, according to Coden at BCG. Israel is home to roughly 8.5 million people.\n\n\"They have no choice but to export,\" said Coden, referring to the country's population.\n\nAn International Bridge That Fuels Growth\n\nIt's inevitable - Israeli cybersecurity startups will seek an overseas outpost. And when they do, Massachusetts business leaders and politicians are hoping entrepreneurs look to the Boston area. Both former Governor Deval Patrick and current Governor Charlie Baker led delegations to Israel - reaching out to the cybersecurity industry.\n\n\"Part of the reason we went to Israel was they were 20 years ahead of everybody else in terms of thinking of cybersecurity as a core strategy,\" Baker said in a September speech to announce a new cyber center within the Mass Tech Collaborative, a quasi-public agency.\n\nJeff Fagnan, founder of the venture capital firm Accomplice in Cambridge, said he's been investing in cyber before it was \"mainstream\" and \"hip.\"\n\nHe agrees that Israeli-founded companies have played a major role in Boston's cyber growth. And he says part of the attraction for Israeli firms is the homegrown talent and the DNA of the local workforce.\n\nHe says that's partly why even domestic companies like Carbon Black and Rapid7 have chosen to headquarter in the region.\n\n\"If you look at where New England's been strong: machine learning, data science, networking, big computing ... that's the kind of thing you need if you're going to build cybersecurity,\" said Fagnan.\n\nAnd increasingly there's a symbiotic relationship between digital health, a priority in the local tech ecosystem, and cybersecurity.\n\nBut that's all recent history.\n\n\"When it came down to choosing between New York and Boston, we very much chose (Boston) because of the talent, and the proximity to so many universities,\" said Udi Mokady, CEO of Cyberark. (Asma Khalid/WBUR)\n\nBlazing The Trail To Massachusetts\n\nUdi Mokady, the CEO of CyberArk, was one of the early cybersecurity settlers in the Boston area.\n\n\"We started in April of '99 in Israel (and) I moved here with a suitcase in the late summer of 2000,\" Mokady said in his Newton office.\n\nMokady considers himself one of the founders, leading the \"trend of cybersecurity companies selecting Boston.\" And the CyberArk lobby is flanked with two symbolic flags — the blue and white Star of David and the stars and stripes of the United States.\n\n\"We figured out the biggest adoption for security would first come financial services firms, and that very much lent itself to the East Coast,\" Mokady said.\n\nHe knew he had to be on the East Coast to be close to customers. But he wasn't sure where.\n\n\"When it came down to choosing between New York and Boston, we very much chose (Boston) because of the talent, and the proximity to so many universities,\" Mokady said.\n\nCyberArk remains an Israeli business; it went public on the NASDAQ as an Israeli corporation, and like other Israeli-founded cybersecurity companies, most of its R&D remains in Israel, but Boston is its North American headquarters.\n\nMokady insists though that he wants his employees to feel as if they're working for a global company because as he points out - they're fighting global problems.\n\nBut not everyone would agree. Cybersecurity is often seen through a domestic national security lens (the Moscow-based cybersecurity firm Kaspersky Lab, which has an office in Woburn, has been accused of cooperating with Russian security services).\n\nBut Mokady dismisses those concerns in the context of Israel. He says Israeli companies, like his, have built credibility and gained a level of trust with customers because of their success. And among its customers are more than 50 percent of Fortune 100 corporations.\n\n\"I always say Swiss watches from Switzerland, information security from Israel,\" Mokady said.\n\nAnd Div agrees - customers want to see results, and if they can prove results, they'll grow. Two years ago, his company Cybereason had about 30 employees in Boston; now - it's up to about 140. The startup has roughly 200 customers and over $100 million investment from the Japanese firm SoftBank.\n\n\"Today, nobody's asking us - 'Why (did) you move to Boston?' It's almost obvious that Boston - this is the place that you can move if you want to be closer to the market,\" said Div."}]}