{"Yaakov Israel Ifargan is a member of the World Economic Forum.": [{"url": "https://www.weforum.org/communities/forum-members", "page_content": "The Forum Members community represents outstanding firms from around the globe that are among the world’s top innovators, market shapers, disruptors, including niche market leaders and regional champions.\n\nThey are businesses of established influence that continue to help growing economies thrive, contribute to societal prosperity and are transforming into global leaders in their industries and regions. Together, they form one of the Forum’s key pillars of global business and address urgent issues, explore emerging trends and help facilitate the Forum’s mission of improving the state of the world.\n\nForum Members are mid-sized global enterprises that have been selectively sought by the World Economic Forum for their innovative business models, market influence, industry disruption, regional impact, corporate citizenship and visionary leadership.\n\nForum Members play a major role in global economic prosperity. They are among the top job creators and are essential to a healthy regional and global business ecosystem. Their experience as emerging regional and global industry players and their ambition and capacity to build sustainable global businesses make Forum Members ideal ambassadors for public-private cooperation and multistakeholder efforts.\n\nTogether with the World Economic Forum community of Institutional Members, Forum Members are a key group of business stakeholders that engage in public-private cooperation with academics, government and civil society to improve the state of the world.\n\nAs of January 2016, the community of Forum Members comprises more than 390 firms from over 60 countries. Membership is by invitation only and a result of a diligent review of selection criteria. Typical Forum Members exceed their industry standards in a variety of metrics, are interested in their role as a global citizen and have a track record of outstanding leadership, setting the bar for business best practices.\n\nForum Members of the World Economic Forum benefit from:\n\nA Multistakeholder Community\n\nForum Members represent a core pillar of the Forum’s multistakeholder community that has been developed to combine the spirit of entrepreneurship with the need for social responsibility to address global and regional challenges.\n\nInteraction\n\nThe global Chairs and Chief Executives of Institutional Member Companies are invited to participate in:\n\nThe Annual Meeting of the New Champions held in the People’s Republic of China, a unique gathering of the next generation of global leaders, emerging regions, competitive cities, Social Entrepreneurs, Young Scientists and Technology Pioneers from around the world.\n\nRegional Meetings in key regions of the world, that complement the experience of the Annual Meeting of New Champions by bringing the regional dimensions to the forefront.\n\nAnnual Workshop with the Technology Pioneers, focusing on new technologies and their opportunities as well as their impact on the global enterprise landscape.\n\nForum Members are fully integrated into the World Economic Forum vision for improving the state of the world and have the opportunity to contribute to the Forum’s Regional, Industry and Global Challenge initiatives and projects along with the community of Institutional Members.\n\nIn addition to face-to-face meetings, Forum Members have access to TopLink, the World Economic Forum’s platform for sharing ideas and engaging in top-level conversations before, during and after yearly events. Forum Members enjoy exclusive year-long access to this web and mobile platform and to the content, videos, insights and and reports available there. There, they can interact virtually with other executives and communities to exchange ideas and insights.\n\nInsight and Knowledge Exchange\n\nForum Members have year-round and around the clock access to the Forum’s expert networks from public office, faith communities, not-for profit organizations and academia. Forum Global Agenda Councils and virtual sessions offer multiple opportunities to share and exchange strategic insight on today’s most pressing issues.\n\nImpact\n\nForum Members contribute to the Forum’s mission by actively participating in Regional Meetings, helping foster solutions for Global Challenges, and adding to Industry expertise. They create impact through engagement in the Forum’s industry projects, such as Digital Transformation, New Vision for Education and the Global Strategic Infrastructure Initiative and through their corporate global citizenship practices, by contributing to initiatives such as the Partnering Against Corruption Initiative (PACI) and Narrowing the Gender Gap.\n\nTerms and Conditions of Membership"}, {"url": "https://www.wikiwand.com/en/Yaakov_Israel_Ifergan", "page_content": "Yaakov Israel Ifargan (יעקב ישראל איפרגן, born 1966), also known as the X-ray (Hebrew: ha-Rentgen), is an Israeli Kabbalist rabbi and spiritual adviser who operates in Netivot, a town in southern Israel. He is known among his followers for his supposed healing and prognostic powers. Ifargan's admirers includes a mix of low income Mizrahi Jewish people from southern Israel, as well as high profile Israeli politicians, businessmen and celebrities. Ifargan also has a following among a group of Breslov Hasidim.[1][2]\n\nQuick facts: Yaakov Israel Ifargan \"The X-ray\", Personal,... ▼\n\nIfargan is the son of Shalom Ifargan (Baba Shalom), and he transformed his fathers tomb in Netivot into an ultramodern, pyramid shaped mausoleum, where he conducts an annual gala event, and holds his midnight Tikkun (reparation) ceremonies.[3][4]\n\nIfargan provides blessings and business advice to some of Israel’s most prominent businessmen and politicians for a fee, and adherents believe he has the ability to diagnose patients by eyesight only. Others claim he is a charlatan who has grown into a multimillionaire from selling amulets and from other illicit businesses.[5]\n\nHe is one of the wealthiest rabbis in Israel, with an estimated net worth of $23 million as of 2012.[6][7][8] One of the foremost followers of the Rabbi is Nochi Dankner, a leading Israeli businessman, who's donated hundreds of thousands of Israeli shekels to the Rabbi's causes.[2]\n\nA 2001 report by the daily Yedioth Ahronoth, claimed that most of the sums donated are not made known to the Israeli tax authorities,[9] although this is denied by Ifargan."}, {"url": "https://qz.com/1787763/the-list-of-delegates-to-the-2020-world-economic-forum-in-davos", "page_content": "From Goldman Sachs bankers to United Nations bureaucrats, delegates have descended on Davos, Switzerland, for the 2020 annual meeting of the World Economic Forum (WEF).\n\nThe conference, now in its 50th year, is a perennial draw for the world’s most powerful people to discuss the most pressing issues facing the global economy—or at least make them feel like that’s what they’re doing.\n\nAdvertisement\n\nThe WEF has publicized the attendees to varying degrees in recent years. At times it has kept the list private, released it in full, or released it while excluding certain groups of people.\n\nThis year, the WEF publicly released its list without names of participants and cited the European data-privacy law known as GDPR as the reason for doing so. That list included person-by-person demographic information, not linked to any identifiable information. A separate list with names is provided to press in attendance; it includes instructions not to release the names of attendees.\n\nThe information about this year’s attendees was submitted to us anonymously through our Secure Drop portal. By name, it matched the 2,784-person list made available to journalists. However, the information we received contains more detail on attendees than Quartz has ever seen and reveals, in ways never before disclosed, how the WEF catalogs and categorizes the world’s powerful people.\n\nWe’ve included two parts of that rubric here, the 1-to-7 categorization of each delegate based on title and affiliation, and a short description of what type of position they currently hold. The World Economic Forum declined to comment on the list or the purpose of the categorization."}, {"url": "https://www.aljazeera.com/news/2023/1/16/who-is-and-who-is-not-attending-the-world-economic", "page_content": "Some 2,700 leaders from 130 countries, including 52 heads of state and government, will be attending the annual meeting in Davos.\n\nThe World Economic Forum’s (WEF) Annual Meeting 2023 will take place from January 16 to 20 in Davos, Switzerland.\n\nThe event brings together leaders from government, business and civil society to address the state of the world and discuss priorities for the year ahead.\n\nEstablished in 1971 by the German economist Klaus Schwab, the meeting was originally known as the European Management Forum, until a name change in 1987.\n\nThe theme this year is “Cooperation in a Fragmented World”.\n\nWho is – and who is not – attending?\n\nAccording to the organisers, more than 2,700 leaders from 130 countries, including 52 heads of state and government, will be attending the event in the alpine resort town.\n\nGerman Chancellor Olaf Scholz is the only G7 leader scheduled to attend the event. On Sunday, South African President Cyril Ramaphosa’s spokesperson announced that the leader would not be attending the event due to an ongoing energy crisis in the country.\n\nEurope:\n\nAlain Berset – president of the Swiss Confederation 2023 and Federal Councillor of Home Affairs\n\npresident of the Swiss Confederation 2023 and Federal Councillor of Home Affairs Alexander De Croo – prime minister of Belgium\n\nprime minister of Belgium Andrzej Duda – president of Poland\n\npresident of Poland Christine Lagarde – president of the European Central Bank\n\npresident of the European Central Bank Sanna Marin – prime minister of Finland\n\nprime minister of Finland Roberta Metsola – president of the European Parliament\n\npresident of the European Parliament Kyriakos Mitsotakis – prime minister of Greece\n\nprime minister of Greece Mark Rutte – prime minister of the Netherlands\n\nprime minister of the Netherlands Pedro Sánchez – prime minister of Spain\n\nprime minister of Spain Maia Sandu – president of the Republic of Moldova\n\npresident of the Republic of Moldova Olaf Scholz – federal chancellor of Germany\n\nfederal chancellor of Germany Leo Varadkar – taoiseach of Ireland\n\ntaoiseach of Ireland Ursula von der Leyen – president of the European Commission\n\npresident of the European Commission Aleksandar Vučić – president of Serbia\n\nAmericas:\n\nChrystia Freeland – deputy prime minister and minister of finance of Canada\n\ndeputy prime minister and minister of finance of Canada Avril Haines – US director of national intelligence\n\nUS director of national intelligence John F Kerry – special US presidential envoy for climate\n\nspecial US presidential envoy for climate Katherine Tai – US trade representative\n\nUS trade representative Gustavo Francisco Petro Urrego – president of Colombia\n\npresident of Colombia Martin J. Walsh – US secretary of labour\n\nAfrica:\n\nAziz Akhannouch – head of government of Morocco\n\nhead of government of Morocco Najla Bouden – prime minister of Tunisia\n\nprime minister of Tunisia Samia SuluhuHassan – president of Tanzania\n\npresident of Tanzania Félix Tshisekedi – president of the Democratic Republic of the Congo\n\nAsia:\n\nIlham Aliyev – president of Azerbaijan\n\npresident of Azerbaijan Ferdinand Marcos, Jr – president of the Philippines\n\npresident of the Philippines Yoon Suk-yeol – president of South Korea\n\nInternational:"}, {"url": "https://peoplepill.com/people/yaakov-israel-ifargan/", "page_content": "Yaakov Israel Ifargan (יעקב ישראל איפרגן, born 1966), also known as the X-ray (Hebrew: ha-Rentgen), is an Israeli Kabbalist rabbi and spiritual adviser who operates in Netivot, a town in southern Israel. He is known among his followers for his supposed healing and prognostic powers. Ifargan's admirers includes a mix of low income Mizrahi Jewish people from southern Israel, as well as high profile Israeli politicians, businessmen and celebrities. Ifargan also has a following among a group of Breslov Hasidim.\n\nIfargan is the son of Shalom Ifargan (Baba Shalom), and he transformed his fathers tomb in Netivot into an ultramodern, pyramid shaped mausoleum, where he conducts an annual gala event, and holds his midnight Tikkun (reparation) ceremonies.\n\nIfargan provides blessings and business advice to some of Israel’s most prominent businessmen and politicians for a fee, and adherents believe he has the ability to diagnose patients by eyesight only. Others claim he is a charlatan who has grown into a multimillionaire from selling amulets and from other illicit businesses.\n\nHe is one of the wealthiest rabbis in Israel, with an estimated net worth of $23 million as of 2012. One of the foremost followers of the Rabbi is Nochi Dankner, a leading Israeli businessman, who's donated hundreds of thousands of Israeli shekels to the Rabbi's causes.\n\nA 2001 report by the daily Yedioth Ahronoth, claimed that most of the sums donated are not made known to the Israeli tax authorities, although this is denied by Ifargan.\n\nBiography\n\nIfargan was born in 1966, in Netivot, a town in southern Israel, as the ninth and youngest child of Shalom and Esther Ifargan. In his childhood, he was no different than other children of his age, and did not exhibit unusual personality traits. Like most other residents of the town, the Ifargan family was a lower-class family who originally came from Tiznit, Morocco.\n\nIfargan did not undergo formal rabbinic ordination. He studied in a religious Yeshiva, but dropped out at the age of 17. He spent a year studying mysticism in seclusion, in the forests of northern Israel. Then, at the age of 18 he was enlisted to the Israeli army, and served for three years as required by law. When his father died in 1995, Ifargan began spreading legends on the mystical powers of his father, which he claimed had healing powers and predicted the future. He started performing spiritual activities out of his parents’ house, as well as the gravesite estate that he purchased for his father, outside of the Netivot cemetery. Ifargan started claiming that he possessed prophetic powers, by which he can see the future as well as diagnose the health problems of people. A diverse community of miracle-seeking admirers began to form around the young mystic, then 30 years old. His followers were impressed with his supposed abilities, dubbing him \"The X-ray\".\n\nIn 2008, Ifergan's \"Netivot Shalom\" list won four seats in the Netivot city council elections.\n\nIn 2010, Netivot's city comptroller, Shimon Alon, a confidant of a rival Netivot kabbalist, Baba Baruch, was arrested for allegedly paying a young woman to seduce Ifargan and photograph him in intimate positions, with the aim of tarnishing his image.\n\nIfargan is also a rival of Netivot rabbi Yoram Abergel. In 2013, Abergel as well as the Israeli crime boss Shalom Domrani was arrested for threatening Ifargan to support Mayor Yehiel Zohar in the Netivot municipal elections. Abergel’s supporters lobbied for the reelection of Mayor Yehiel Zohar, while Ifergan supported the challenger, Eyal Mesika.\n\nIfergan's aides publish \"Inyan Ba'ir\", a Netivot local newspaper, to get across the rabbi's messages and strengthen his public profile.\n\nTikkun ceremonies\n\nIfargan erected a large, truncated pyramid shaped mausoleum for his father at the top of a hill, entirely covered in white marble. In this location he performs ceremonies, and most importantly, the Tikkun (reparation). The ceremonies are always opened by David Zarfati, Ifargan's master of ceremonies, who instructs the participants, who sing and clap their hands, while loud music is played. Ifargan throws thousands of candles into a bonfire, creating massive flames. Sometimes Ifargan places his hands in the fire but is not burned. Ifargan says that this is a Kabbalistic ceremony. In reality the ceremony is unique in form, and differs significantly from the traditional Kabbalistic Tikkun, which does not include a bonfire. The ceremony is preceded by prayer services and a collection of donations.\n\nCriticism\n\nThe use of religion to gain profit, by Ifargan and other rabbis, drew criticism by other Jewish clerics, such as Rabbi Donniel Hartman, president of the Shalom Hartman Institute, who said \"It's disappointing when religion descends to this... It's not some channel of divine power for personal wealth accumulation. That's small religion.\" Ifargan wears modern Haredi dress. By doing so, Dr. Anat Feldman of the Achva Academic College, says he creates an image that he is part of the rabbinic establishment, thus gaining additional public legitimacy. However, some Haredi leaders including Rabbi Ovadia Yosef and Rabbi Chaim Kanievsky have denounced Ifergan’s magical practices. The rabbis accused Ifergan of paganism and called him a \"fiend\", further threatening that anyone associated with Ifergan would have no part in the next world. In 2009, a reconciliation meeting took place between Ifargan and some prominent Ashkenazi rabbis, including Aharon Leib Steinman, Haim Kanyevsky, Nissim Karelitz and Michel Yehuda Lefkowitz ."}, {"url": "https://www.deseret.com/2012/7/13/20423879/israel-s-richest-rabbis-become-savvy-businessmen", "page_content": "NETIVOT, Israel — One summer night, on the outskirts of a sleepy desert town, a who's who of Israel's elite gathered for an annual feast to honor a rabbi whose gaze is said to pierce the soul.\n\nHe's Rabbi Yaacov Israel Ifargan. But he is better known as, simply, the X-ray.\n\nOver the past few decades, he and dozens of other rabbis have carefully positioned themselves at the fulcrum of Israeli power and influence. They have attracted throngs of adherents — most notably some of the country's top business moguls, who pay top shekel for an audience with their rabbi to solicit blessings and discuss business matters.\n\nThese magnates have helped fuel the rise of a rabbinic aristocracy whose members have channeled the donations they receive into multi-million-dollar empires. After gaining experience dishing out advice to Israeli tycoons, the rabbis have become shrewd businessmen themselves, managing hefty investments in stocks and real estate at home and abroad — with much of their earnings allegedly kept far from the watchful eyes of Israeli tax collectors.\n\nTheir chief critic calls then swindlers and frauds, and some fellow rabbis are critical of their practices.\n\nThe Israeli edition of Forbes magazine published a first-of-its-kind ranking last month of Israel's 13 richest rabbis. In the number one spot was 36-year-old Rabbi Pinchas Abuhatzeira from Beersheba, a blue-collar southern desert city, whose wealth is estimated at $335 million. The X-ray rabbi placed sixth, with an estimated net worth of $23 million.\n\n\"Every single shekel brings about true peace,\" announced the X-ray rabbi's half-brother, Rabbi Hayim Amram Ifargan, from the dais at the recent gathering, in a gentle nudge to the crowd of VIPs to continue their support.\n\nHe, too, is a part of the Ifargan family franchise. His spiritual adherents call him \"The MRI.\" In the women's section behind a laced divider sat \"The Arbitrator\" or \"The CT,\" Ifargan's millionaire sister Bruria Zvuluni, a go-to spiritual counselor who claims to have mediated feuds between Israeli crime kingpins. Though she is not a rabbi, she made it to the bottom of Forbes' list.\n\nCozying up at Ifargan's long table were lawmakers, one of Israel's top lawyers, and two of Israel's wealthiest businessmen: Menahem Gurevitch, chairman of a leading Israeli insurance company, and billionaire Nochi Dankner, head of Israel's largest holding company and a close confidant of Ifargan for the last 14 years. The Israeli army's chief rabbi and a top police commander were there, and Prime Minister Benjamin Netanyahu sent his blessings in a recorded video message.\n\nRabbis who make fortunes for themselves and encourage others to make money with their blessings draw the wrath of some fellow Jewish clerics.\n\n\"It's disappointing when religion descends to this,\" said Rabbi Donniel Hartman, president of the Shalom Hartman institute, a modern Orthodox Jewish learning center in Jerusalem. \"It's not some channel of divine power for personal wealth accumulation. That's small religion.\"\n\nMost rabbis in Israel are not raking in millions. They are instead salaried government employees, assigned by Israel's official rabbinate to perform religious rites for the Jewish public such as marriages and burials, or to enforce Jewish dietary laws in restaurants and hotels.\n\nThey are nowhere near the level of the high-flying spiritual gurus like the X-ray.\n\nSuch gurus set up public office hours in their homes to receive Israelis on all rungs of the social ladder, as long as they come with cash. In exchange, adherents receive amulets and little pieces of paper containing the rabbi's personalized blessing. The most successful rabbis have founded charitable institutions and small religious seminaries, which act as conduits for the incoming cash flow.\n\nMenachem Friedman, an expert on Orthodox Judaism and professor emeritus at Bar Ilan University, says religious Jewish businessmen since the 19th century have solicited rabbis' blessings for cash to ensure their success — though today the sums have reached unprecedented amounts.\n\n\"If the market is dangerous and shaky, the millionaires who benefit from that market have less confidence. They need these rabbis to give them that security,\" Friedman said.\n\nThe country's richest rabbinic dynasty is the Abuhatzeira family, scions of the revered Baba Sali who left Morocco for Israel in 1963, gaining a following among Israel's large Moroccan and Middle Eastern Jewish immigrant population. The Baba Sali died in 1984, but his portrait — a shriveled face wrapped in a white shawl — still graces the walls of Israeli homes, businesses and falafel stands.\n\nHis grandson, Rabbi Elazar Abuhatzeira, became the richest of them all, building himself a three-story villa said to include an events hall, deluxe guest rooms for important donors and an underground tunnel allowing him safe passage to his synagogue and office across the street, according to journalist Yossi Bar-Moha, who says he obtained the house plans from the Beersheba municipality.\n\nBar-Moha published a series of exposes in Israeli dailies accusing the rabbi of cheating his followers into believing he had no money in the bank, and violently threatening some to pay up.\n\nThe Israeli police's national fraud squad opened an investigation in the late 1990s, discovering $125 million in his personal account. He reportedly reached a settlement with Israel's tax authorities to pay a fraction of what he owed them.\n\nLast year, a desperate adherent whose donations to the rabbi hadn't improved his lot stabbed Rabbi Abuhatzeira to death. His son, Rabbi Pinchas Abuhatzeira, inherited his wealth and his spot at the top of Israel's affluent rabbinic aristocracy.\n\n\"These rabbis are charlatans, swindlers and cheaters. They have no real knowledge. And people eat it up,\" said reporter Bar-Moha, who heads Tel Aviv's journalists' association.\n\nAn Israeli tax official, speaking anonymously because of the issue's sensitivity, said in the past two years tax authorities have approached some 20 religious figures, requesting earnings reports. Some rabbis have been investigated for tax fraud. No convictions are known, but some have reportedly reached settlements with Israeli tax authorities.\n\nReached for comment, advisers of some of the rabbis profiled by Forbes either would not comment on the income estimates, or said they were wrong but would not provide other figures. A spokesman for Rabbi Ifargan said his charitable institutions and received donations are above board.\n\nAt the end of the feast, adherents followed Rabbi Ifargan up a hill to pray at the hulking stone pyramid that houses his father's grave. Ifargan emerged from the tomb surrounded by paparazzi, bodyguards and a host of followers shouting out requests for the rabbi to pray for their health and for their children to find a good match.\n\nWhen an Associated Press reporter asked the rabbi the secret to his success, Ifargan stopped. The 46-year-old rabbi with a pointed jet-black beard and brimmed hat fixed his gaze for a few moments, cocked his head up toward the heavens and shrugged.\n\nThen his bodyguards whisked him into a black Mercedes-Benz, and they sped off.\n\n"}, {"url": "https://www.weforum.org/press/2019/08/world-economic-forum-appoints-new-members-to-board-of-trustees", "page_content": "Adrian Monck, Managing Director, Head of Public Engagement, Tel. +41 (0)79 615 1671; adrian.monck@weforum.org\n\nLaurence D. Fink and Feike Sybesma join the World Economic Forum Board of Trustees\n\nThe Board of Trustees serves as the guardian of the World Economic Forum’s mission and values\n\nFor more information on the World Economic Forum, see www.weforum.org\n\nGeneva, Switzerland, 22 August 2019 – Laurence D. Fink, Chairman and Chief Executive Officer of BlackRock, and Feike Sybesma, Chief Executive Officer and Chairman of the Managing Board for Royal DSM, will join the Board of Trustees of the World Economic Forum. Both have a track record of thought leadership and long-term success in business that will strengthen the Forum’s platform for public-private cooperation.\n\nLaurence D. Fink co-founded BlackRock Inc. in 1988 and serves as its Chairman and Chief Executive Officer. In addition, he serves as a member of the Board of Trustees of New York University (NYU) and is Co-Chairman of the NYU Langone Medical Center Board of Trustees. He also serves on the boards of the Museum of Modern Art and the Council on Foreign Relations, among other positions. Fink earned an MBA with a concentration in real estate from the University of California, Los Angeles (UCLA) in 1976 and a BA in political science from UCLA in 1974. He is well known for writing an annual letter to CEOs calling on business leaders to focus on sustainable, long-term value. He is a member of the Forum’s International Business Council.\n\n\n\nFeike Sybesma has served as Chief Executive Officer and Chairman of the Managing Board at Royal DSM since 2007. He is also a Member of the Supervisory Board for De Nederlandsche Bank (central bank of the Netherlands) and a Climate Leader for World Bank Group, among other positions. He studied medical biology at the University of Utrecht and business administration at Erasmus University. He is also Non-Executive Board Member at Unilever (PLC & NV). He has actively called on boards of directors and global leaders to take action to combat climate change. He is a member of the Forum’s International Business Council.\n\n“The World Economic Forum, as the International Organization for Public-Private Cooperation, is delighted to welcome Larry Fink and Feike Sybesma to its Board of Trustees, further enhancing our ability to deliver positive, transformative solutions to our most critical global, regional and industry challenges,” said Klaus Schwab, Founder and Executive Chairman of the World Economic Forum.\n\nAs of 22 August 2019, the members of the Board of Trustees of the World Economic Forum are:\n\nMukesh AMBANI, Chairman and Managing Director, Reliance Industries, India\n\nMarc BENIOFF, Chairman and Chief Executive Officer, Salesforce, USA\n\nPeter BRABECK-LETMATHE*, Vice-Chairman, Board of Trustees, World Economic Forum; Chairman of the Board, Nestlé SA, Switzerland\n\nMark CARNEY, Chairman, Financial Stability Board; Governor of the Bank of England\n\nLaurence D. FINK, Chairman and Chief Executive Officer, BlackRock, Inc.\n\nChrystia FREELAND, Minister of Foreign Affairs of Canada\n\nOrit GADIESH**, Chairman, Bain & Company, USA\n\nFabiola GIANOTTI, Director-General, European Organization for Nuclear Research (CERN), Geneva\n\nAl GORE, Vice-President of the United States (1993-2001); Chairman and Co-Founder, Generation Investment Management, USA\n\nHerman GREF, Chairman of the Board and Chief Executive Officer, Sberbank, Russian Federation\n\nAngel GURRÍA, Secretary-General, Organisation for Economic Co-operation and Development (OECD), Paris\n\nAndré HOFFMANN, Vice-Chairman, Roche Holding Ltd., Switzerland\n\nChristine LAGARDE, Managing Director, International Monetary Fund (IMF), Washington DC\n\nUrsula von der LEYEN, President-elect, European Commission, Brussels\n\nJack MA, Executive Chairman, Alibaba Group, People’s Republic of China\n\nYo-Yo MA, Cellist\n\nPeter MAURER, President, International Committee of the Red Cross (ICRC), Switzerland\n\nMin ZHU*, Deputy Managing Director, International Monetary Fund (2011-2016)\n\nLuis MORENO**, President, Inter-American Development Bank, Washington DC\n\nH.M. Queen Rania AL ABDULLAH of the Hashemite Kingdom of Jordan\n\nL. Rafael REIF, President, Massachusetts Institute of Technology (MIT), USA\n\nDavid M. RUBENSTEIN, Co-Founder and Co-Executive Chairman, Carlyle Group, USA\n\nKlaus SCHWAB*, Chairman of the Board of Trustees, World Economic Forum\n\nTharman SHANMUGARATNAM, Senior Minister and Coordinating Minister for Social Policies of Singapore\n\nJim Hagemann SNABE, Member of the Board, SAP AG, Siemens AG, Allianz SE, Germany\n\nFeike SYBESMA, Chief Executive Officer and Chairman of the Managing Board, Royal DSM\n\nHeizo TAKENAKA**, Minister of State for Economic and Fiscal Policy of Japan (2002-2006)\n\n*Member of the Governing Board\n\n**Member of the Audit & Risk Committee\n\nNotes to editors\n\nView Forum photos at http://wef.ch/pix\n\nRead the Forum Agenda at http://wef.ch/agenda\n\nBecome a fan of the Forum on Facebook at http://wef.ch/facebook\n\nWatch Forum videos at http://wef.ch/video\n\nFollow the Forum on Twitter via @wef and @davos\n\nFollow the Forum on Instagram at http://wef.ch/instagram\n\nFollow the Forum on LinkedIn at http://wef.ch/linkedin\n\nLearn about the Forum’s impact on http://wef.ch/impact\n\nSubscribe to Forum news releases at http://wef.ch/news\n\nThe World Economic Forum, committed to improving the state of the world, is the International Organization for Public-Private Cooperation. The Forum engages the foremost political, business and other leaders of society to shape global, regional and industry agendas. (www.weforum.org)\n\nFollow us on Twitter, Facebook and LinkedIn"}, {"url": "https://alchetron.com/Yaakov-Israel-Ifargan", "page_content": "Yaakov Israel Ifargan (יעקב ישראל איפרגן, born 1966), also known as the X-ray (Hebrew: ha-Rentgen), is an Israeli Kabbalist rabbi and spiritual adviser who operates in Netivot, a town in southern Israel. He is known among his followers for his supposed healing and prognostic powers. Ifargan's admirers includes a mix of low income Mizrahi Jewish people from southern Israel, as well as high profile Israeli politicians, businessmen and celebrities. Ifargan also has a following among a group of Breslov Hasidim.\n\nContents\n\nIfargan is the son of Shalom Ifargan (Baba Shalom), and he transformed his fathers tomb in Netivot into an ultramodern, pyramid shaped mausoleum, where he conducts an annual gala event, and holds his midnight Tikkun (reparation) ceremonies.\n\nIfargan provides blessings and business advice to some of Israel’s most prominent businessmen and politicians for a fee, and adherents believe he has the ability to diagnose patients by eyesight only. Others claim he is a charlatan who has grown into a multimillionaire from selling amulets and from other illicit businesses.\n\nHe is one of the wealthiest rabbis in Israel, with an estimated net worth of $23 million as of 2012. One of the foremost followers of the Rabbi is Nochi Dankner, a leading Israeli businessman, who's donated hundreds of thousands of Israeli shekels to the Rabbi's causes.\n\nA 2001 report by the daily Yedioth Ahronoth, claimed that most of the sums donated are not made known to the Israeli tax authorities, although this is denied by Ifargan."}, {"url": "https://finance.yahoo.com/news/israels-richest-rabbis-become-savvy-140820792.html", "page_content": "In a Sunday July 1, 2012 photo, Rabbi Yaakov Israel Ifargan, right, known as the 'X-Ray' rabbi for the belief he has the ability to diagnose patients by eyesight only, sits next to businessman Nochi Dankner, left, at the annual gathering of the rabbi's followers and supporters in the town of Netivot, southern Israel. Over the past few decades, Ifargan and dozens of other rabbis have carefully positioned themselves at the fulcrum of Israeli power and influence. (AP Photo/Tsafrir Abayov)\n\nNETIVOT, Israel (AP) -- One summer night, on the outskirts of a sleepy desert town, a who's who of Israel's elite gathered for an annual feast to honor a rabbi whose gaze is said to pierce the soul.\n\nHe's Rabbi Yaacov Israel Ifargan. But he is better known as, simply, the X-ray.\n\nOver the past few decades, he and dozens of other rabbis have carefully positioned themselves at the fulcrum of Israeli power and influence. They have attracted throngs of adherents — most notably some of the country's top business moguls, who pay top shekel for an audience with their rabbi to solicit blessings and discuss business matters.\n\nThese magnates have helped fuel the rise of a rabbinic aristocracy whose members have channeled the donations they receive into multi-million-dollar empires. After gaining experience dishing out advice to Israeli tycoons, the rabbis have become shrewd businessmen themselves, managing hefty investments in stocks and real estate at home and abroad — with much of their earnings allegedly kept far from the watchful eyes of Israeli tax collectors.\n\nTheir chief critic calls them swindlers and frauds, and some fellow rabbis are critical of their practices.\n\nThe Israeli edition of Forbes magazine published a first-of-its-kind ranking last month of Israel's 13 richest rabbis. In the number one spot was 36-year-old Rabbi Pinchas Abuhatzeira from Beersheba, a blue-collar southern desert city, whose wealth is estimated at $335 million. The X-ray rabbi placed sixth, with an estimated net worth of $23 million.\n\n\"Every single shekel brings about true peace,\" announced the X-ray rabbi's half brother, Rabbi Hayim Amram Ifargan, from the dais at the recent gathering, in a gentle nudge to the crowd of VIPs to continue their support.\n\nHe, too, is a part of the Ifargan family franchise. His spiritual adherents call him \"The MRI.\" In the women's section behind a laced divider sat \"The Arbitrator\" or \"The CT,\" Ifargan's millionaire sister Bruria Zvuluni, a go-to spiritual counselor who claims to have mediated feuds between Israeli crime kingpins. Though she is not a rabbi, she made it to the bottom of Forbes' list.\n\nCozying up at Ifargan's long table were lawmakers, one of Israel's top lawyers, and two of Israel's wealthiest businessmen: Menahem Gurevitch, chairman of a leading Israeli insurance company, and billionaire Nochi Dankner, head of Israel's largest holding company and a close confidant of Ifargan for the last 14 years. The Israeli army's chief rabbi and a top police commander were there, and Prime Minister Benjamin Netanyahu sent his blessings in a recorded video message.\n\nRabbis who make fortunes for themselves and encourage others to make money with their blessings draw the wrath of some fellow Jewish clerics.\n\n\"It's disappointing when religion descends to this,\" said Rabbi Donniel Hartman, president of the Shalom Hartman institute, a modern Orthodox Jewish learning center in Jerusalem. \"It's not some channel of divine power for personal wealth accumulation. That's small religion.\"\n\nMost rabbis in Israel are not raking in millions. They are instead salaried government employees, assigned by Israel's official rabbinate to perform religious rites for the Jewish public such as marriages and burials, or to enforce Jewish dietary laws in restaurants and hotels.\n\nThey are nowhere near the level of the high-flying spiritual gurus like the X-ray.\n\nSuch gurus set up public office hours in their homes to receive Israelis on all rungs of the social ladder, as long as they come with cash. In exchange, adherents receive amulets and little pieces of paper containing the rabbi's personalized blessing. The most successful rabbis have founded charitable institutions and small religious seminaries, which act as conduits for the incoming cash flow.\n\nMenachem Friedman, an expert on Orthodox Judaism and professor emeritus at Bar Ilan University, says religious Jewish businessmen since the 19th century have solicited rabbis' blessings for cash to ensure their success — though today the sums have reached unprecedented amounts.\n\n\"If the market is dangerous and shaky, the millionaires who benefit from that market have less confidence. They need these rabbis to give them that security,\" Friedman said.\n\nThe country's richest rabbinic dynasty is the Abuhatzeira family, scions of the revered Baba Sali who left Morocco for Israel in 1963, gaining a following among Israel's large Moroccan and Middle Eastern Jewish immigrant population. The Baba Sali died in 1984, but his portrait — a shriveled face wrapped in a white shawl — still graces the walls of Israeli homes, businesses and falafel stands.\n\nHis grandson, Rabbi Elazar Abuhatzeira, became the richest of them all, building himself a three-story villa said to include an events hall, deluxe guest rooms for important donors and an underground tunnel allowing him safe passage to his synagogue and office across the street, according to journalist Yossi Bar-Moha, who says he obtained the house plans from the Beersheba municipality.\n\nBar-Moha published a series of exposes in Israeli dailies accusing the rabbi of cheating his followers into believing he had no money in the bank, and violently threatening some to pay up.\n\nThe Israeli police's national fraud squad opened an investigation in the late 1990s, discovering $125 million in his personal account. He reportedly reached a settlement with Israel's tax authorities to pay a fraction of what he owed them.\n\nLast year, a desperate adherent whose donations to the rabbi hadn't improved his lot stabbed Rabbi Abuhatzeira to death. His son, Rabbi Pinchas Abuhatzeira, inherited his wealth and his spot at the top of Israel's affluent rabbinic aristocracy.\n\n\"These rabbis are charlatans, swindlers and cheaters. They have no real knowledge. And people eat it up,\" said reporter Bar-Moha, who heads Tel Aviv's journalists' association.\n\nAn Israeli tax official, speaking anonymously because of the issue's sensitivity, said in the past two years tax authorities have approached some 20 religious figures, requesting earnings reports. Some rabbis have been investigated for tax fraud. No convictions are known, but some have reportedly reached settlements with Israeli tax authorities.\n\nReached for comment, advisers of some of the rabbis profiled by Forbes either would not comment on the income estimates, or said they were wrong but would not provide other figures. A spokesman for Rabbi Ifargan said his charitable institutions and received donations are above board.\n\nAt the end of the feast, adherents followed Rabbi Ifargan up a hill to pray at the hulking stone pyramid that houses his father's grave. Ifargan emerged from the tomb surrounded by paparazzi, bodyguards and a host of followers shouting out requests for the rabbi to pray for their health and for their children to find a good match.\n\nWhen an Associated Press reporter asked the rabbi the secret to his success, Ifargan stopped. The 46-year-old rabbi with a pointed jet-black beard and brimmed hat fixed his gaze for a few moments, cocked his head up toward the heavens and shrugged.\n\nThen his bodyguards whisked him into a black Mercedes-Benz, and they sped off."}, {"url": "https://www.weforum.org/reports/annual-report-2021-2022/in-full/centres", "page_content": "Contents Preface Centres - • Centre for Regional and Global Cooperation - • Centre for Industry Transformation - • Centre for Nature and Climate - • Centre for the New Economy and Society - • Centre for the Fourth Industrial Revolution Core Functions Offices Foundations Leadership and Governance Consolidated Financial Statements Measuring Stakeholder Capitalism: Metrics and Disclosures\n\nCentres\n\nContents Preface Centres - • Centre for Regional and Global Cooperation - • Centre for Industry Transformation - • Centre for Nature and Climate - • Centre for the New Economy and Society - • Centre for the Fourth Industrial Revolution Core Functions Offices Foundations Leadership and Governance Consolidated Financial Statements Measuring Stakeholder Capitalism: Metrics and Disclosures\n\n• Centre for Regional and Global Cooperation\n\n| Børge Brende, President of the Managing Board\n\n\n\n“The Centre for Regional and Global Cooperation is at the heart of the World Economic Forum’s work, convening leaders to deliver cooperative approaches that solve critical global challenges.” —Børge Brende, President of the Managing Board\n\nGlobal context\n\nThe war in Ukraine and growing geopolitical turbulence have lent new urgency to the Forum’s mission of advancing multistakeholder and multilateral cooperation. As the rules-based global system faces the most significant challenge in the post-war era, it is incumbent on actors to work with a common purpose to strengthen the underlying mechanisms of regional and global collaboration while addressing immediate and long-standing priorities.\n\nEngagement\n\nHousing nine regional and community teams alongside the Platform for Shaping the Future of Trade and Investment, the Centre facilitates impact-oriented dialogue and builds communities of purpose.\n\nImpact\n\nThrough this work, the Centre generates actionable insights and delivers collaborative efforts that help stakeholders not just navigate but also shape today’s uncertain environment.\n\nDelivering impact through purpose driven dialogue\n\nIn March 2022, the Centre convened a CEO Dialogue: Responding to the Geopolitical Crisis in Europe that brought together over 100 CEOs as well as leading experts to identify steps business can take to address the humanitarian crisis in Ukraine and geopolitical challenges in Europe. The Centre also hosted a special Agenda Dialogue: The Humanitarian Crisis in Ukraine and Its Global Impacts to offer audiences ways to assist refugees and displaced persons.\n\nThe Centre assembled the Breaking the Impasse community, which now counts more than 200 Israeli and Palestinian business leaders working together to advocate for a two-state solution. In October 2021, members of the group met with Hady Amr, US Deputy Assistant Secretary of State for Israel-Palestinian Affairs, to discuss how they could advance dialogue on a solution. In February 2022, members met with Ruth Porat, Senior Vice-President and Chief Financial Officer of Google, after which the company pledged $10 million in support of the Palestinian technology ecosystem.\n\nThe Centre continued to serve as a platform for strengthening economic growth and stability in the Western Balkans. Leaders from business and government met at the World Economic Forum Annual Meeting 2022 for a Diplomacy Dialogue on the Western Balkans to identify steps to boost the region’s resilience and secure ties with key partners at a time of heightened geopolitical risk.\n\nA critical foundation of the Centre’s work are its Country Strategy Dialogues – private conversations between business leaders and top government officials, including heads of state and government. These sessions serve as a crucial tool for identifying the measures needed to attract investment opportunity, build competitiveness and accelerate growth. Dialogues were held this year with leadership from China, Colombia, the European Commission, Indonesia, Nigeria, Saudi Arabia, Spain, the United States and Viet Nam.\n\nThe Centre also convenes Global and Regional Action Groups, each comprised of approximately 50 to 70 leaders from business and government, which meet quarterly to explore and present strategies for strengthening cooperative structures and advancing shared priorities. Their activities this year include:\n\n– The Global Action Group identified options for advancing cooperative efforts within a more competitive geopolitical context. Members presented insights during The Davos Agenda in January 2022, focusing on pathways towards building a more equitable and sustainable global economy.\n\n– The Regional Action Group for Africa focused on advancing economic and energy priorities on the continent, releasing white papers on “Attracting Investment and Accelerating Fourth Industrial Revolution Adoption in Africa” and on “Financing the Future of Energy”.\n\n– The Regional Action Group for ASEAN supported priority areas for the implementation of the ASEAN Comprehensive Recovery Framework. With the historic signing of the Regional Comprehensive Economic Partnership and strides made towards enhancing regional cooperation on the digital economy, the group contributed to finding ways to strengthen supply chain resilience and expand digital collaboration across ASEAN.\n\n– The Regional Action Group for Europe and Eurasia examined paths towards long-term competitiveness in the region. Members of the CEO Action Group for the European Green Deal continued to deliver concrete results to tackle carbon emissions through tailored lighthouse projects, such as the EU Carbon + Farming Coalition.\n\n– The Regional Action Group for Latin America convened members to chart effective responses to the COVID-19 pandemic and joint actions for rebuilding and recovery efforts.\n\n– The Regional Action Group for the Middle East and North Africa facilitated peer exchanges on energy, the Fourth Industrial Revolution and sustainable investment strategies.\n\n– The Regional Action Group for South Asia convened regional leaders and global experts for action oriented discussions on South Asia’s economic outlook and to develop a collaborative roadmap for the region’s green transition.\n\n“The Annual Meeting in Davos is all about crafting a better future together.” —Ursula von der Leyen, President of the European Commission\n\nDelivering impact through insight\n\nThe Centre delivers public-facing special addresses and dialogues as well as reports and analytical content that elevate public discourse on the most crucial issues facing the world today. In January 2022, The Davos Agenda featured special addresses and remarks by 13 heads of state or representatives. A virtual dialogue was held also with the presidents of Colombia, Costa Rica, Ecuador, Guatemala and Peru, and the President of the InterAmerican Development Bank.\n\nIn July 2021, the Global Future Councils on Geopolitics and on the Korean Peninsula partnered with Chatham House to convene a dialogue on shaping sustainable security on the peninsula.\n\nIn collaboration with Kearney and Observer Research Foundation, the Centre prepared “Mission 2070: A Green New Deal for a Net Zero India”, a sectoral multistakeholder roadmap for India to accelerate decarbonization, and laid foundations for the upcoming India CEO Climate Action Leaders group.\n\n“If we strengthen our collaboration on this critical issue while staying true to our values of equity, inclusivity and science, we’ll lead our world towards a clean energy future.” —John Kerry, US Special Presidential Envoy for Climate\n\nBased on a joint survey with Sea Ltd of close to 90,000 respondents in ASEAN, the Forum published the ASEAN Digital Generation Report: Pathway to ASEAN’s Inclusive Digital Transformation and Recovery, examining the impact of the pandemic in ASEAN countries and exploring the benefits, remaining challenges and outlook for inclusive digitalization.\n\nThe first in an insight report series, the Lighthouse Action on Social Justice through Stakeholder Inclusion publication featured nine corporate engagement case studies that show ways businesses are advancing social justice and equity.\n\nIn step with pending EU corporate human rights due diligence legislation, the Global Future Council on Human Rights launched a set of resources to guide business leaders and corporate boards on how to protect human rights and learn from affected stakeholders.\n\nDelivering trade and investment impact\n\nThe Platform for Shaping the Future of Trade and Investment brings together a community of over 100 leading global companies with trade and investment officials to address the challenges and opportunities for resilient, sustainable and inclusive trade. Through a programme of over 50 gatherings, members of the community used the platform to advance the following four priorities.\n\n– Promoting open and stable commerce\n\nThe community delivered a call to action signed by 30 CEOs and chairpersons from five continents urging world leaders to re-engage on trade reform, because an underlying cause of trade tensions remains differences among governments on how international rules should guide state intervention in economies at different stages of development. It published a white paper entitled “Industrial Policy and International Competition” on the spillovers of industrial policy that lays out priority areas for action across subsidies, state-ownership, government procurement, trade remedies and investment screening.\n\n– Supporting sustainable and equitable value chains\n\nMembers of the community drafted a paper that presented a revised approach to “International Trade and Economic Justice”. Recognizing that women have been disproportionately affected by the economic impact of the pandemic, the platform also served to present an analysis on how trade can support a more gender-equal recovery. Additionally, in support of a new global intergovernmental process on sustainable trade that was launched in December, a white paper was released in partnership with Clifford Chance on “Delivering a Climate Trade Agenda: Industry Insights” on how trade can be more supportive of climate action.\n\n– Facilitating the flow of goods, services and investment\n\nA central focus of the platform remained helping to facilitate growth by making trade and investment simpler and easier. The Global Alliance for Trade Facilitation has 32 country projects that are completed or under way. Half of the projects are in Africa and all mainstream gender and SME priorities based on newly developed best practices. Through the Global Investment Policy and Practice initiative, concrete investment facilitation reforms were delivered in five countries with deep private-sector involvement, and substantial input was provided towards a 100-country plurilateral agreement on investment facilitation for development. The goal of a World Investment for Development Alliance was established with leading international organizations and a funded effort was launched to ameliorate digital foreign direct investment.\n\n– Growing cross-border digital business\n\nTo shape global and regional data-flow governance dialogues, the platform released white papers on “Digital Trade in Services and Taxation” and “Digital Currency Governance”. It also launched a partnership with the World Trade Organization that focuses on the impact of emerging technologies on trade policy.\n\nAdvancing the humanitarian agenda\n\nAt the World Economic Forum Annual Meeting 2022, the Forum launched a Resilience Consortium, a high-level leadership effort to develop a common resilience framework and coordinated resilience agenda by January 2023. The Forum’s Humanitarian Agenda brought key stakeholders from governments, civil society, international organizations and corporates as well as investors together to discuss expanding solutions that strengthen the self-reliance and resilience of the most vulnerable communities.\n\nWith support from the IKEA Foundation, the Humanitarian and Resilience Investing Initiative expanded its efforts to catalyse private capital in fragile markets and strengthen organizational capacity to unlock new sources of financing. The Global Future Council on the New Agenda for Fragility and Resilience published guidelines for complementary action in fragile contexts to showcase how public and private actors can work in concert to better meet the needs of communities in crisis.\n\nIn addition, the Centre worked to bring 281 public figures to the World Economic Forum Annual Meeting 2022 in Davos-Klosters, 44 of whom were heads of state and government. Over the course of the year, the Centre convened 16 Regional and Global Action Group meetings and nine Country Strategy Dialogues, while hosting eight Global Future Councils. Over 120 civil society organizations directly partnered with the Forum.\n\nRaising climate ambition\n\nTo help raise global climate action and ambition, the Forum partnered with the United Kingdom’s COP26 Unit in the lead up to the climate conference and helped launch the First Movers Coalition at COP26 with US President Joe Biden and Special Presidential Envoy for Climate John Kerry. The coalition is jump-starting demand for clean technologies in supply chains.\n\nAs the Middle East prepares to host the next two Conferences of the Parties in Egypt and the UAE, the Forum announced a partnership with Egypt to support its efforts around COP27 and is preparing to enter a similar partnership with the UAE. The Forum will help facilitate public-private dialogue and will rally the private sector to contribute effectively to these two events.\n\nContents Preface Centres - • Centre for Regional and Global Cooperation - • Centre for Industry Transformation - • Centre for Nature and Climate - • Centre for the New Economy and Society - • Centre for the Fourth Industrial Revolution Core Functions Offices Foundations Leadership and Governance Consolidated Financial Statements Measuring Stakeholder Capitalism: Metrics and Disclosures\n\n• Centre for Industry Transformation\n\n| Jeremy Jurgens, Managing Director\n\nThe Centre for Industry Transformation helps leaders navigate competing priorities and pressures to deliver on both growth and the transition to more sustainable, inclusive and equitable societies. Its platforms drive value and impact through three pillars:\n\n– Insight: Actionable foresight, analysis and real-time perspectives to inform decision-making\n\n– Interaction: Collaboration between the most relevant peers outside their traditional networks\n\n– Impact: Catalytic support to galvanize diverse leaders and action towards shared goals\n\nIn the past year, the platforms have welcomed additional Partners, seen deeper engagement and responded to a greater number of requests for collaboration than in previous years.\n\nGlobal context\n\nThe waves of COVID-19 pandemic resurgence and response have accelerated digital transformation and technology adoption, caused widespread supply chain blockages, increased ESG expectations, and transformed many sectors through new workplace planning and talent management.\n\nThese challenges and others notwithstanding, industry leaders also have unprecedented opportunities. Businesses are the most trusted institutions in society and, for those that can address changing behaviours, demand is growing. Employees and consumers are increasingly motivated by purpose rather than prestige and are willing to emotionally invest in the businesses they believe in.\n\nThe rapid adoption of such technologies as artificial intelligence and machine learning, 5G networks, cloud computing, the internet of things and edge computing offers the potential for new revenue streams. This in turn can lead to improved environmental, social and governance outcomes. At the same time, biotech, space, quantum technologies and the metaverse are all increasingly being integrated into real world applications for the benefit of society and consumer markets.\n\nIn this context, industry leaders can and are building businesses that are agile, resilient, tech enabled, people-centric and planet-friendly to deliver strong returns and play a material role in addressing global challenges. To help them achieve their goals, leaders can tap into new networks to build partnerships with companies outside their traditional siloes, collaborate with civil society representatives and experts, and develop sustained, trusted relationships with policy-makers.\n\nEngagement\n\nThe Centre engages 1,200 of the world’s largest and most innovative companies in efforts to shape the future of industry ecosystems. Each of the 10 Industry Transformation Platforms incorporates the most relevant businesses, innovators and policymakers to address systems-level challenges and opportunities. Industry-specific CEO communities remain at the heart of each platform.\n\nIn 2021-2022, the Centre developed three key areas:\n\n– Streamlined and strengthened the value proposition and product offerings for innovative and high-growth companies\n\n– Initiated a revision of the Centres for the Fourth Industrial Revolution Network to facilitate greater interaction between national policy and innovation ecosystems with key industries\n\n– Replicated the successful CEO communities, with the creation of nine cross-industry C-level title (CxO) communities that immediately became popular with Partners, such as the Chief Digital Officer and the Chief Operating, Supply Chain and Procurement Officer communities\n\nImpact\n\nThroughout the Centre’s activities, three clear themes emerged as core to the industry transformation agenda in all sectors: people, planet and technology for good. The main achievements of the last year include:\n\nIndustry transformations that deliver for people\n\n– The Davos Alzheimer’s Collaborative brings new cooperative energy and global vision to the fight against Alzheimer’s disease. Launched in 2021, the Collaborative made progress in bringing together a cohort of 1 million people living with Alzheimer’s, linking a network of 90 clinical trial sites as part of a global, trial-ready system for developing and testing new therapies, and investing to boost health-system preparedness through innovative solutions.\n\n– UNICEF and members of the World Economic Forum Supply Chain & Transport Industry Action Group developed a charter to support the inclusive and safe distribution of COVID-19 vaccines, which contributed to the delivery by UNICEF-COVAX of more than 1 billion vaccines to vulnerable communities primarily in low- and middle-income countries.\n\n– The New Frontiers of Nutrition initiative partnered with over 40 organizations to markedly improve the availability, access and consumer adoption of nutritious choices in order to strengthen the physical and mental health of individuals. Guided by research in behavioural science, the community placed the awareness of good nutrition higher on the global agenda and identified market-led innovation pathways to cement nutrition as a cornerstone of human resilience.\n\n– The EDISON Alliance aims to ensure that every person can affordably participate in the digital economy, focusing on financial inclusion, health and education. The alliance launched the “Guidebook to Digital Inclusion Bond Financing” and the 1 Billion Lives Challenge to bring new services to 1 billion people through commercially sustainable partnerships by 2025. Commitments, with investments and programmes to support them, reached the halfway mark in just nine months.\n\n– A first-of-its-kind Audience Representation Index developed in collaboration with Accenture, Ipsos and Nielsen provided a benchmark for how well consumers see themselves represented in film and TV, gaming, news and magazines, and sport. The World Economic Forum Power of Media Taskforce on Diversity, Equity and Inclusion, with its mission to improve measurement, accountability and transparency, continued to collaborate with the industry to strengthen the index framework and explore opportunities to improve diversity and representation in each media sector.\n\n\n\nIndustry transformations that deliver for the planet\n\n– The Stakeholder Capitalism Metrics aim for consistent and comparable disclosure on environmental, social and governance (ESG) factors. More than 160 global Forum Partner companies have committed to ESG disclosure, with over 60 having done so, backed by the skills and competencies of a community of 300 ESG practitioners. (See the “Stakeholder Capitalism Metrics” box.) The initiative catalysed the establishment of the International Sustainability Standards Board, mandated to create global standards with the endorsement of over 40 governments and jurisdictions.\n\n– The Clean Skies for Tomorrow Coalition amplified collaboration in the aviation industry. Established by eight founding champions, the coalition engaged over 200 organizations in the aviation, energy and finance sectors as well as corporate travellers to promote a net-zero pathway for the industry.\n\n– The Low-Carbon Emitting Technologies (LCET) initiative, comprised of major chemical-sector companies, established the industry’s first CEO-led coalition for the transformation to a net-zero and circular future. By establishing a project development company, the LCET initiative moved to the critical implementation stage, focusing on technological innovation in conjunction with industry partnerships in order to promote the collaborative implementation of low-carbon technologies.\n\n– The Transitioning Industrial Clusters towards Net Zero initiative was launched at COP26 in Glasgow in November 2021, in collaboration with Accenture and the Electric Power Research Institute. This global movement seeks to accelerate the transformation of over 100 industrial clusters globally needed for net-zero emissions, while delivering on jobs, industrial competitiveness and economic growth. Four global clusters from the United Kingdom, Spain and Australia joined the initiative with a total emission reduction commitment equivalent to the emissions of Denmark (approximately 30 million metric tonnes of carbon dioxide equivalent).\n\n“By working together, we will continue to provide the vital social and economic benefits of long-haul air travel, while delivering a low-carbon future and preserving our planet for generations to come.” —Shai Weiss, Chief Executive Officer, Virgin Atlantic Airways\n\n– With only 2% of plastic packaging effectively recycled, the Consumers Beyond Waste initiative is driving a systemic shift from single-use items to a reuse model that eliminates plastic waste and reduces carbon emissions. The project helped to accelerate new reuse solutions at the country level by engaging such innovators as Loop and Algramo. As such, reuse solutions in the food, personal and home care categories progressed in Chile, France, Indonesia, Japan and the United States, among others, in partnership with leading industry retailers and manufacturers.\n\n– Financing the Transition to a Net Zero Future engaged more than 50 financial institutions to develop financing blueprints and a set of policy recommendations for breakthrough decarbonization technologies to enable the net-zero transition of the steel, aviation and shipping industries.\n\nSource: GETTY/WILLIAM TAUFIC\n\nIndustry transformations through technology\n\n– Through the Technology, Innovation and Systemic Risk project, over 100 financial services firms and public-sector leaders collaborated on research that identified short- and long-term risks stemming from the increased use of technology in financial services. The initiative also outlined plausible mitigation strategies.\n\n– A total of 120 senior cybersecurity leaders contributed insights to the flagship Global Cybersecurity Outlook 2022 report that seeks to advance the debate on cyber-risk and to continue elevating cybersecurity from a technical topic to a strategic imperative. The report reached over 150,000 readers and was featured in over 230 international media outlets.\n\n– The Partnership against Cybercrime strives to amplify public-private cooperation to combat cybercrime and overcome the existing barriers to cooperation. The community launched the Cybercrime Atlas initiative, a joint effort by leading experts to map the cybercrime landscape to inform decision-makers and support collaborative efforts to disrupt cybercrime.\n\n– The Digital Transformation for Long-term Growth initiative convenes over 120 organizations from a multitude of sectors for peer knowledge exchange and collaboration on pre-competitive transformation frameworks. In addition to bimonthly exchanges, it established the Chief Digital Officer community.\n\n– The global deployment of the Smart Industry Readiness Index (SIRI), an assessment and benchmarking tool for digital maturity in manufacturing, was accelerated and expanded. It was originally launched and piloted in Singapore, with approximately 600 companies from 30 countries undertaking the assessment. A new independent and not-for-profit organization, the International Centre for Industrial Transformation, was established to further scale the Index’s adoption at the global level.\n\n– The Forum established a new global Centre for Urban Transformation and the Urban Transformation Summit to advance public-private collaboration and collective action in cities across the globe. The inaugural Summit in December 2021 brought together more than 350 mayors, business executives, community leaders and experts in urban development from 38 countries in North America, South America, Europe, Africa, Asia and Australia.\n\nThe increased Partner focus on impact-oriented activities resulted in greater concentration on high-impact, multi-sector collaborations. Every platform now hosts at least one flagship initiative and most operate across multiple Forum communities, creating greater overall alignment and coherence. A priority for the year ahead will be to further strengthen the strategic alignment in order to meet community-driven needs and agendas within a shared, flexible framework.\n\nIn parallel, constituents’ increased appetite for peer exchange in the face of rapid change both strengthened the core peer communities and led to the establishment of new CxO communities. The Centre will continue to invest in them as core vehicles for value exchange and as a means to increase the breadth of relationships with Partners.\n\nStakeholder Capitalism Metrics\n\nInternational Business Council\n\nThe International Business Council (IBC) is a group of 120 leading CEOs from international companies who are champions of the principles of stakeholder capitalism. Chaired by Brian Moynihan, Chairman and Chief Executive Officer of Bank of America, the IBC brings global and cross-industry CEOs together to exchange views on good corporate practice, to prioritize and drive action on key and timely global issues, and to align their corporate values and strategies to serve society better.\n\nStakeholder Capitalism Metrics\n\nOne exemplary effort is the Stakeholder Capitalism Metrics that were disseminated by the World Economic Forum in 2019 to align corporate values and strategies with the UN Sustainable Development Goals. Faced with a proliferation of voluntary standards of measurement that limited the ability of companies, investors and stakeholders to keep firms accountable for their vision and match them with their actions, the IBC created and promoted the adoption of a set of common Stakeholder Capitalism Metrics that allow the consistent and comparable measurement of the effects of a business on its wider group of stakeholders.\n\nThe metrics were identified in conjunction with the main professional services firms – Deloitte, EY, KPMG and PwC – and led to collaboration with the world’s most prominent international standard setter for financial accounting to develop common, international standards on environmental, social and governance (ESG) issues.\n\nTo date, over 160 global companies from the Forum’s partnership community have committed to embedding the Stakeholder Capitalism Metrics into their reporting materials. This constitutes a strong signal by an international group of prominent issuers for the need to advocate for the global alignment and convergence of ESG reporting systems in capital markets. Over 60 companies published their annual reporting materials incorporating the Stakeholder Capitalism Metrics in the past year. The Forum itself is one such organization. Its performance on ESG-related aspects is published in this Annual Report.\n\nCommunity of ESG Practitioners\n\nTo build capacity and skills and raise the bar in the ever-evolving area of ESG reporting, the Forum created a global community of over 300 ESG practitioners representing the companies committed to regularly taking part in peer exchange, reviewing best practices, and engaging in collective dialogue with international and jurisdictional regulators and standard setters.\n\nMobilizing a community of companies that voluntarily report on their ESG performance through a set of common metrics is a step towards the convergence, simplification and standardization of the sustainability reporting ecosystem. The group represents an influential constituency that has engaged with policy-makers, financial market regulatory authorities and international standard setters to get a consensus on forming a body that would oversee the development of international standards for all capital markets.\n\nThe future: International Standards for Sustainability\n\nBuilding on the momentum of this initiative, and in recognition of the systemic relevance of the Forum’s private-sector coalition, the project team participated as a member of the Technical Readiness Working Group of the International Financial Reporting Standards Foundation, which laid the basis for the establishment of the International Sustainability Standards Board (ISSB), whose mandate is to create international standards for sustainability disclosures.\n\nLaunched in November 2021 at COP26 and endorsed by over 40 governments and jurisdictions, the ISSB will continue to cooperate with the Forum and its private-sector coalition as it develops international sustainability disclosure standards for all financial markets. In addition to supporting the ISSB in its mission, the Forum and its platforms enable the coalition to hold a regular dialogue with the US Securities and Exchange Commission, the European Financial Reporting Advisory Group, and other regulators and standard setters to test and contribute to shaping upcoming regulations on mandatory sustainability reporting to promote a harmonized approach among jurisdictions.\n\nContents Preface Centres - • Centre for Regional and Global Cooperation - • Centre for Industry Transformation - • Centre for Nature and Climate - • Centre for the New Economy and Society - • Centre for the Fourth Industrial Revolution Core Functions Offices Foundations Leadership and Governance Consolidated Financial Statements Measuring Stakeholder Capitalism: Metrics and Disclosures\n\n• Centre for Nature and Climate\n\n| Gim Huay Neo, Managing Director\n\nThe Centre for Nature and Climate seeks to safeguard the global commons, by driving climate action, developing a nature positive economy, regenerating food, water and ocean systems as well as improving resource management and preventing pollution.\n\nThe Centre develops multistakeholder partnerships to accelerate action and scale solutions, and supports policy for a net-zero and nature positive transformation. It provides a trusted and vibrant platform to progress towards the UN 2030 Agenda for Sustainable Development.\n\nThe Centre adopts a three-pronged approach across industry and geographies:\n\n– Building awareness and thought leadership\n\n– Creating connections and catalysing change\n\n– Incubating public-private initiatives and scaling innovation\n\nGlobal context\n\nThe global commons are under severe strain, with systems at serious risks of collapse, threatening societies, economies and the planet. The latest Intergovernmental Panel on Climate Change report (February 2022) states that global warming is likely to reach 1.5° C between 2030 and 2052, at its current rate of increase. This will displace millions of people, impact food and water security, disrupt supply chains, cripple the global economy, and threaten the health and livelihoods of people globally.\n\nEnvironmental risks continued to dominate this year’s Global Risks Report 2022, with climate action failure, extreme weather events, biodiversity loss and ecosystem collapse as the top risks identified for the immediate and long term. The World Economic Forum’s New Nature Economy Report states that $44 trillion of economic value generation – over half the world’s total GDP – is dependent on nature, calling for an immediate reverse in nature loss by adopting sustainable practices.\n\nThe need for action and global cooperation is more urgent than ever before. But crisis can be turned into opportunity; it is possible to forge a sense of collective purpose, build trust and understanding, and promote global partnerships for a more sustainable, inclusive and resilient world that will serve current and all future generations well.\n\nEveryone must act now, act fast and act at scale to fast track adaptation and transition in energy use, resource management as well as food, water and ocean systems. Investments in climate solutions would yield massive opportunities, and a nature-positive transition could generate up to $10.1 trillion in annual business value and create 395 million jobs by 2030.\n\nEngagement\n\nThe Centre for Nature and Climate builds communities and connects corporate CEOs, heads of state, thought leaders, academics, public figures, cultural leaders and technology disruptors to champion and co-create action-based partnerships, to unify, amplify and scale its work across sectors and geographies.\n\nOur engagement network includes over 190 Partner companies across 20 industry sectors operating in 13 regions, more than 70 government collaborators from around the world and a portfolio of over 50 international and philanthropic organizations that share our objectives and purpose. The Centre also maintains long-standing partnerships with international organizations and intergovernmental processes, such as the COP26 Presidency and the United Nations General Assembly.\n\nThe Centre’s agenda is focused on five interconnected themes:\n\n– Accelerating climate action for net zero\n\n– Fast-tracking towards a nature-positive economy\n\n– Regenerating food, ocean and water systems\n\n– Advancing resource circularity\n\n– Enabling market mechanisms through innovative finance and technology\n\nTo help guide and steward the climate and nature agenda, the Centre convenes multiple high-level global leadership groupings, including the Alliance of CEO Climate Leaders, the Champions for Nature community, the Food Stewardship Board and the Friends of Ocean Action network. These Partners meet regularly to shape the strategy and direction of the agenda, share best practices and exchange ideas, and actively support activities through policy advocacy and corporate action, for example by collaborating with the UK Presidency and the United Nations Framework Convention on Climate Change (UNFCCC) on COP26.\n\nSimilar partnerships exist at the regional levels to translate global ambition into local action. These include Coalitions for the Amazon Bioeconomy to catalyse forest restoration, and National Plastic Action Partnerships (NPAP) to combat plastic pollution. Through these arrangements, the Centre supports local capability building and ownership, and pilots ideas and solutions that can be scaled and sustained as catalytic forces for change.\n\n“In building the Climate Action Platform’s drumbeat to Glasgow, the Mission Possible Partnership (MPP) drove the conversation of net-zero ambition into action. The MPP is a critical step towards delivering real, tangible commitments to sectoral action in the net-zero industry transition.” —Nigel Topping, UK High-Level Climate Action Champion, COP26 Climate Champions\n\nImpact\n\nThanks to the continuous support and commitment of a network of Partners, donors, experts and other key communities, 2021-2022 was another high-impact year, with COP26 as a major catalytic milestone for raising ambition and driving progress for climate action.\n\nHighlighted activities and achievements include:\n\nAccelerating climate action for net-zero\n\nThis was a pivotal year for accelerating and scaling action on the climate. At COP26, the Forum partnered closely with the UK Presidency, the UNFCCC HighLevel Champions and other key partners to mobilize action across its communities and networks. What stood out was an unprecedented mobilization of business, citizens, academia and many others to push for bolder outcomes, and to take ownership for action. The UN’s Race to Zero Campaign, which the Forum supported, grew to over 5,000 businesses, 67 regions, over 440 financial institutions, over 1,000 educational institutions and more, all committed to halving emissions between 2020 and 2030. The full COP26 highlights were published. Some high points include:\n\n– The Alliance of CEO Climate Leaders is now the largest CEO-led climate alliance globally. It grew its membership by 40%, comprising 119 CEOs in 27 countries and representing 9 million employees. The chief executives signed an open letter to world leaders in the lead-up to the G7 and COP26 in support of “bold and courageous commitments, policies and actions”.\n\n– Over 35 global businesses launched the First Movers Coalition, a partnership between the World Economic Forum and the office of the US Special Presidential Envoy for Climate John Kerry. The coalition aggregates the purchasing commitments of members as a demand driver for innovative technologies needed to decarbonize “hard-to-abate” sectors, representing more than a third of global carbon emissions, and are essential to achieving net-zero by 2050. Membership grew to over 50 at the World Economic Forum Annual Meeting 2022.\n\n– The Mission Possible Partnership (MPP) continued to grow and advance its work to accelerate the net-zero transition in seven hard-to-abate sectors, including the launch of its first industry-backed and open-source decarbonization Sector Transition Strategies for aviation, shipping and steel. The MPP aunched a critical set of industry roadmaps and continued to collaborate with the High-Level Champions team.\n\n– The Alliance for Clean Air was launched at COP26 with 10 founding members: Accenture, Bloomberg, Biogen, Google, GoTo, IKEA, Maersk, Mahindra Group, Siemens and Wipro. Together, they tackle the issue of air pollution from a corporate perspective.\n\nFast-tracking towards a nature-positive economy\n\nThe Nature Action Agenda released two reports this year:\n\n– The New Nature Economy Report Part 3 series, Seizing Business Opportunities in China’s Transition Towards a Nature-positive Economy, highlights that a nature-positive economy in China could generate 88 million resilient jobs by 2030.\n\n– The BiodiverCities by 2030: Transforming Cities’ Relationship with Nature report articulates a vision for the cities of the future that places nature at the heart of decision-making and infrastructure investments.\n\nThe Tropical Forest Alliance co-chaired the multistakeholder task force for the Forest, Agriculture and Commodity Trade dialogue, which culminated in a joint roadmap and statement by 28 countries at COP26 to reduce commodity-driven deforestation. The alliance also brought together 12 of the world’s biggest agricultural trading and processing companies to issue a joint statement committing to a sectoral roadmap by COP27 for enhancing supply chain actions consistent with a 1.5° C pathway.\n\nThe Innovative Finance for the Amazon, Cerrado and Chaco initiative brought eight major financial institutions and agribusiness companies together that committed $3 billion to soy and cattle production that is free of deforestation and land conversion in South America.\n\n1t.org (Trillion Trees initiative) continued to mobilize private-sector ambition and engagement for forests, bringing the total to 33 global and 44 US corporate pledges committed to conserving and restoring 5.7 billion trees. It also catalysed forest restoration in priority regions by supporting Coalitions for the Amazon Bioeconomy and the Great Green Wall in the Sahel, and engaging in partnerships in India and China. A landmark commitment was made by China at the World Economic Forum Annual Meeting 2022 to conserve and plant 70 billion trees (supported by new 1t.org China Action).\n\n100 Million Farmers was recognized as one of the Breakthrough Agendas for Agriculture and Innovation by 40 world leaders.\n\nThe Natural Climate Solutions Alliance, convened jointly by the World Economic Forum and the World Business Council for Sustainable Development, launched the Natural Climate Solutions Investment Accelerator to mobilize private-sector investment in these solutions, with the aim of removing 1 gigaton of CO2e per year by 2025.\n\nRegenerating food, ocean and water systems\n\nAs part of the UN Food Systems Summit in September 2021, the Forum chaired the Innovation Lever of Change, convening a diverse community of nearly 80 public-, private-and social-sector organizations to promote the adoption of a wider, more holistic view of innovation.\n\nThe Food Action Alliance identified the EU and four priority country partners, namely India, Colombia, Kenya and Viet Nam, to develop Food Innovation Hubs, under the support of the Government of the Netherlands, through public-private collaboration.\n\nWith Friends of Ocean Action, new ocean initiatives this year ranged from the Blue Food Partnership, a unique platform that is catalysing science-based actions towards healthy and sustainable aquatic food value chains, to the Ocean 100 Dialogues, a science-business platform enabling business leaders in the ocean economy to deliver cross-industry action to accelerate sustainable ocean stewardship.\n\nThe 2030 Water Resources Group, hosted at the World Bank, is the most mature and successful public-private-civil society partnership on water to date. It reached over 1,000 partners across 14 countries/ states. As an example of its impact, the Accelerator project on strengthening agriculture value chains in India is supporting livelihoods and water security across 8,000 hectares, affecting 10,000 families, conserving an estimated 80 billion litres of water and mobilizing $16 million of investment.\n\nThe 50L Home Coalition, pushing the norms of domestic urban water use to address the nexus of water security and energy through its thoughtleadership products, gained new global partners and advanced city pilot options in China, Europe and the US for 2022.\n\nIn the context of COVID-19, the Hand Hygiene Market Accelerator, in collaboration with UNICEF, accelerated the flow of critical hand hygiene products to vulnerable locations and people.\n\nA new collaboration with HCL and UpLink was launched at the World Economic Forum Annual Meeting 2022, with $15 million of funding for entrepreneurs who can drive innovation to tackle freshwater crisis.\n\nAdvancing resource circularity\n\nScale360° and the Forum Circular Economy initiative expanded its reach from two countries to 20 in 2021, applying its systemic approach to circular innovation and collaboration to cities, regions and countries around the world. It also launched the Circular Economy for the Net-Zero Industry Transition initiative, partnering with hard-to-abate materials sectors.\n\nThe Global Plastic Action Partnership (GPAP) extended its national partnerships to Maharashtra state, India, Nigeria and Pakistan, while the existing Viet Nam partnership was the lead collaborator in the government’s new law on environmental protection, using the GPAP’s roadmap to inform a national climate policy. The Reuse Portal, a global one-stop-shop to enable collective action for reuse, was co-developed and launched by the GPAP, the WWF and the UN Environment Programme, and the GPAP was instrumental in enabling partners in the plastics value chain to agree on cohesive next steps for a plastic pollution treaty at the United Nations Environment Assembly (UNEA-5.2).\n\n“As we work together to seek solutions to our growing global plastic waste problem, the Global Plastic Action Partnership is effectively uniting stakeholders worldwide by creating a framework that drives change by supporting the types of financing and innovations that are needed to reduce plastic pollution in the environment and in our communities.” —Audrey Choi, Chief Sustainability Officer, Morgan Stanley\n\nEnabling market mechanisms through innovative finance and technology\n\nEnabling market mechanisms through innovative finance and technology To encourage private-sector capital investment in emerging markets, the Sustainable Development Investment Partnership (SDIP) developed solutions to reduce perceived and actual risks across financial and non-financial dimensions through the launch of white paper “Reshaping Risk Mitigation: The Impact of Non-financial Levers”. In Saint Lucia, it created a Country Financing Roadmap to align capital behind development priorities to support a renewable energy pipeline of $80 million, and $12 million in investments for workforce reskilling.\n\nThe SDIP also launched the “Principles for Financing a Just and Urgent Energy Transition”, helping to generate alignment between financial institutions and civil society on accountability standards for the design of energy transition financing arrangements.\n\nUpLink, the open innovation platform of the World Economic Forum, has been at the forefront of an entrepreneur revolution, to support positive systemic change for people and the planet. To inspire and uplift entrepreneurs who will pave the way to a net-zero, nature-positive future, UpLink launched 14 innovation challenges, focusing on nature and climate, sourcing innovations from all over the world and selecting a total of 138 new Top Innovators with highly promising solutions. In an effort to scale their work, UpLink is building around them a collaborative ecosystem of investors, experts and partners, and has been dedicated to facilitating visibility, event access and connection opportunities that can unlock their potential. The Impact Report 2021-2022 highlights how the UpLink platform enables these innovations, and showcases the individual and collective impact of Top Innovators – this collective impact is self-declared data which is reported as measured, verified and/or estimated. Over 2021-2022, Top Innovators protected or actively managed over 10 million hectares of natural habitat, restored more than 812,000 hectares, enabled the protection of over 3,000 species or returned them to their original habitats, reduced or prevented more than 2.8 million metric tonnes of greenhouse gas emissions, and removed over 895,000 tonnes of waste pollution from terrestrial and aquatic habitats. In addition, Top Innovators focused on nature-based solutions reported the mobilization of $129 million in funding, which will support their expansion.\n\nTo conclude, the activities of the Centre for Nature and Climate were made possible with the joint commitment and active support of Forum Partners and many other stakeholders. Despite the COVID pandemic, the Centre hosted more than 90 events convening over 3,000 stakeholders and key champions. Additionally, the Centre launched 53 publications that provided insights and recommendations to support leaders in their strategy and action plans.\n\nThe Centre benefited from the contributions of four Hoffmann Fellows and nine Project/Platform Fellows seconded from Partners who worked on the Centre’s climate, circular economy, food, nature-based solutions, ocean, sustainable financing and technology agendas, alongside Forum staff. The Centre also partnered with 35 funders who provided CHF 24.5 million in direct funding for 15 initiatives. These additional funds enabled the Centre to increase and accelerate efforts to generate new insights, convene more meetings and events, and drive more action-based partnerships within regions and countries, as well as to catalyse innovation and test solutions towards environmental challenges. The source of funds was diverse, with 55% via governments, 33% via philanthropic organizations, 7% via academia, 4% via business and 1% via civil society/non-governmental organizations.\n\nContents Preface Centres - • Centre for Regional and Global Cooperation - • Centre for Industry Transformation - • Centre for Nature and Climate - • Centre for the New Economy and Society - • Centre for the Fourth Industrial Revolution Core Functions Offices Foundations Leadership and Governance Consolidated Financial Statements Measuring Stakeholder Capitalism: Metrics and Disclosures\n\n• Centre for the New Economy and Society\n\n| Saadia Zahidi, Managing Director\n\nThe Centre for the New Economy and Society aims to shape prosperous, resilient and equitable economies and societies that create opportunity for all. It provides leaders with an integrated platform to understand socioeconomic trends and to shape a better future.\n\nThe Centre and its Partners create insights, action frameworks and multistakeholder initiatives in five interconnected thematic areas:\n\n– Economic growth, revival and transformation\n\n– Work, wages and job creation\n\n– Education, skills and learning\n\n– Diversity, equity, inclusion and social justice\n\n– Global risks\n\nThis work now impacts the lives and livelihoods of millions of people globally, and one of the World Economic Forum’s ambitions is to reach more governments, businesses and individuals with tangible opportunities.\n\nGlobal context\n\nThe past two years saw economies, workplaces and communities ravaged by a global pandemic. That has been followed by the shock of war – a violent conflict and humanitarian catastrophe. Both global shocks have negatively affected the ability of economies to grow and improve living standards and have increased social polarization within countries, disrupted jobs and education, increased the cost of living and, without action, will leave long-lasting repercussions for poverty and inequality within and between countries.\n\nThe Centre’s work is ever more vital and to achieve impact, it leverages a plurality of methods to suit the complexity of the present. The approach is underpinned by key insight products, such as reports on gender, jobs and social mobility, as well as data tools to support evidence-based decision-making, keeping a focus on facts over ideology. The Centre develops action frameworks, such as Country Accelerators, that serve as a bridge between global best-in-class ideas and tangible implementation and action in countries and sectors. In addition, the Centre’s leadership alliances and consortia maintain strong links between the public, private and civil society sectors and between diverse countries and industries, proactively combatting silos over the course of the crises.\n\nThese impact methods support a growing coalition of leaders and their organizations in their efforts to keep a strong focus on the economic recovery and the urgent human capital investments and market innovations so crucial to future resilience.\n\nEngagement\n\nThe Centre’s strategic direction is guided by an Advisory Board, comprised of nearly 30 leaders from business, government and civil society. The board met four times in 2021-2022, focusing its guidance specifically on the economic recovery, building a new inclusive, resilient and sustainable growth agenda, embedding inclusion into the new economy, recovering losses in jobs and education, and leveraging the full power of the Centre to invest in human capital development.\n\n“The work of the Centre for the New Economy and Society has never been more important. Global challenges like the climate emergency, mounting inequality and the war in Ukraine and all of its implications make it increasingly clear that economic and social progress need to be recoupled to create a more sustainable, equitable and just world. We’re delighted to be collaborating with the World Economic Forum to help enable that goal.” —Robert Moritz, Global Chairman, PwC\n\nFive of the Forum’s C-suite communities expanded their engagement, namely the Chief Economists, Chief Human Resources Officers (CHRO), Chief Learning Officers, Chief Diversity and Inclusion Officers and Chief Risk Officers from nearly 400 organizations. These groups continued to serve as peer learning communities for leaders grappling with similar challenges and to co-create new insights and action frameworks for the public good.\n\nDuring the year, the Centre hosted several Global Future Councils, expert communities composed of over 100 leading thinkers and practitioners, to guide planning towards 2025 in six key areas: economic growth and recovery; fiscal and monetary policy; work, wages and job creation; education and skills; equity and social justice; and frontier risks. Their work is consolidated in the “Building Back Broader” white paper, a guide to driving greater quality growth and expanding opportunity for all in the economies of tomorrow.\n\nIn 2021-2022, nearly 30 new businesses joined as core Partners of the Centre for the New Economy and Society, bringing the total to over 150, indicating the increasing relevance of the socio-economic agenda to the business community. More broadly, across the Centre’s various insight partnerships, action initiatives and leadership alliances and consortia, over 400 businesses were involved, covering a plurality of sectors.\n\nNearly 30 governments engaged with the Centre through its Country Accelerators model, aimed at fostering innovation, skills, education, jobs and gender parity nationally. During the year, eight new governments joined the Global Accelerator Model with the launch of Accelerators in Cambodia (focusing on skills), Kazakhstan (focusing on gender), South Africa (focusing on education), Bangladesh (focusing on education), Japan (focusing on gender), Mexico (focusing on gender), Saudi Arabia (focusing on innovation) and the United Arab Emirates (focusing on the markets and jobs of tomorrow). In addition, the Government of Finland joined as a trusted Knowledge Partner for education.\n\nOver 30 international organizations, civil society organizations, labour unions and university partners also formed part of the sphere of core engagement with the Centre to shape action and policy change on today’s most critical socio-economic issues.\n\nPhilanthropic organizations partner with the Centre and generously provide funding to support crucial work. In 2021-2022, five new funding agreements were signed and/or extended for education, skills, social mobility, and racial and social justice, allowing staff dedicated to specific projects to be hired and supporting the overall advancement of the Centre’s agenda.\n\nSource: REUTERS/FLAVIO LO SCALZO\n\nImpact\n\nThe triple disruption of the pandemic’s aftermath, geopolitical change and technological acceleration formed the backdrop to the Centre’s work in 2021-2022, which aimed to address both short- and long-term responses. Select examples of the Centre’s work over the year follow:\n\nRaising awareness and vigilance around new and emerging risks\n\nThe 17th edition of The Global Risks Report helped accelerate the identification of global risks so business, government, civil society and individuals gain a greater understanding of short-, mid- and long-term global risks, leading to active support for sustainable risk mitigation strategies. The report indicates that environmental risks have the potential to yield the most damage to people and the planet, followed by societal challenges, such as livelihood crises. “Debt crises” and “geo-economic confrontations” also appear in the top 10 risks by severity over the next 10 years.\n\nDefining “good work” and identifying the jobs of tomorrow\n\nLaunched at the Jobs Reset Summit in June 2021, the Good Work Alliance is a global, cross-industry initiative to leverage the individual and collective power of companies towards building a healthy, resilient and equitable future of work. It embeds relevant definitions and standards of what constitutes “good work” across in-person, hybrid and virtual work as well as specific goals that companies commit to pursuing as part of their talent practices. The alliance aims to cover both employees and contingent workers. In May 2022, it launched the Good Work Framework to develop metrics and reporting guidelines for companies wishing to make progress towards a good job economy. The framework has thus far been piloted by 13 organizations globally, representing 1.2 million employees and their related supply chains.\n\nIn parallel, the Centre’s white paper, “Jobs of Tomorrow: The Triple Returns of Social Jobs in the Economic Recovery”, found that investing in education, health and care jobs can yield a triple dividend: boosting economic activity, expanding employment opportunities and generating social mobility. New modelling of the US economy suggests that every dollar invested would generate more than a twofold return: investing $1.3 trillion in the social jobs of tomorrow could unlock $3.1 trillion in GDP returns and create 11 million jobs by 2030.\n\nDuring the World Economic Forum Annual Meeting 2022, the CHRO community mobilized the Refugee Employment and Employability Initiative. The initiative tested its work in Europe to support Ukrainian refugees and created the basis for system-wide global support from employers to refugees that extends across conflict contexts.\n\nAdditionally, the Jobs Consortium, a leading group of CEOs and ministers championing productive employment, growth in the jobs of tomorrow, new standards in the workplace and better wages for all in the economic recovery, was launched at the Annual Meeting 2022.\n\nSource: GETTY/TOMMASO ALTAMURA/EYEEM\n\n“The World Economic Forum Centre for the New Economy and Society has been leading a vital impact-based engagement model to help achieve green, gender-blind and economically inclusive societies. The active engagement and cooperation between governments, the business sector, civil society and international organizations have allowed a deeper understanding of the evolving global issues and enabled the creation of a practical toolkit for job creation and reskilling. The Centre has been a successful platform for working together and restoring trust at a time of unprecedented global transformational change.” —Rania Al-Mashat, Minister of International Cooperation of Egypt\n\nMobilizing a reskilling revolution\n\nThe Reskilling Revolution initiative aims to provide better education, skills and economic opportunities to 1 billion people by 2030. Over 250 businesses, along with over 20 governments and international organizations as well as leading academic experts, were involved over the last year. By its second anniversary at The Davos Agenda in 2022, the initiative had reached 102 million people with new skills, and the Reskilling Revolution Champions had agreed on the initiative’s 2022-2024 strategy. Among its projects, the Closing the Skills Gap Accelerators model was adopted by 11 countries and the Closing the Education Gap Accelerators model was launched at the Sustainable Development Impact Summit 2021 in September, with South Africa as the founding accelerator and Bangladesh joining during the World Economic Forum Annual Meeting 2022.\n\nMonitoring the global gender gap and accelerating gender parity\n\nThe Global Gender Gap Report 2022 highlights both progress towards and backsliding on gender parity within and across countries. The time to closing the global gender gap stood at 136 years in 2021, a one-generation loss compared to 100 years in 2020, due to lost employment in the sectors hardest hit by workforce reductions, the disproportionate burden of care, and the unbalanced pipelines of male and female talent in growing sectors. The report is a widely used reference point for business, civil society, media and policy-makers, including in the Closing the Gender Gap Accelerators, a public-private collaboration model to address economic gender parity, already adopted in 12 economies. In 2021-2022, Ecuador, Kazakhstan, Japan and Mexico adopted the model.\n\nMobilizing business leadership for racial justice\n\nThe Partnering for Racial Justice in Business initiative is a global coalition of organizations and C-suite leaders committed to leveraging their individual and collective power to build equitable and just workplaces for professionals with under-represented racial and ethnic identities. More than 60 leading multinational businesses are operationalizing and coordinating commitments to eradicate racism in the workplace and set new global standards for racial equity in business. They worked together and with public-sector leaders during the year to advocate for inclusive policy change.\n\nEmbedding equity and inclusion in the workplace\n\nLaunched in March 2022, the Global Parity Alliance is a cross-industry group of companies taking action to accelerate diversity, equity and inclusion (DE&I) in the workplace and beyond. The alliance seeks to drive better and faster DE&I outcomes, by sharing proven best practices and practical insights on creating equitable work opportunities, promoting supplier diversity and launching inclusive products and services. This year, the alliance worked to share identified DE&I lighthouses publicly and support their widespread adoption.\n\nContents Preface Centres - • Centre for Regional and Global Cooperation - • Centre for Industry Transformation - • Centre for Nature and Climate - • Centre for the New Economy and Society - • Centre for the Fourth Industrial Revolution Core Functions Offices Foundations Leadership and Governance Consolidated Financial Statements Measuring Stakeholder Capitalism: Metrics and Disclosures\n\n• Centre for the Fourth Industrial Revolution\n\n| Jeremy Jurgens, Managing Director\n\nThe Centre for the Fourth Industrial Revolution helps leaders anticipate, understand and shape the trajectory of technological change for human-centred outcomes. The Centre develops strategies, frameworks and toolkits for technology governance and digital transformation across 30 initiatives led by 250 stakeholders, in policy areas ranging from ethical artificial intelligence (AI) to autonomous drones. It pilots and iterates its solutions in a fast-growing network of 15 national and subnational Centres.\n\nWith a combined staff of 200 technology and policy experts in economies representing 40% of global GDP and 30% of the world population, the Fourth Industrial Revolution Network is well positioned to form the trust and accumulate the expertise required to create solutions that are flexible enough to answer local needs and standardized enough to foster connectivity and interoperability.\n\nGlobal Context\n\nEmerging technologies, from AI to bioengineering and quantum computing, promise smart solutions to the world’s most pressing problems, but their exponential nature often overwhelms existing institutions and organizations, leaving societies exposed to poorly understood risks and deprived of unprecedented opportunities.\n\nIn the wake of escalating geopolitical conflicts, a climate crisis that seems out of control and a global economy rattled by the aftershocks of a historic pandemic, adopting shared principles and safeguards for the use of exponential technologies and their implementation is more important, yet also more complex, than ever before.\n\nAn example is quantum computing, one of the most important and rapidly advancing emerging technologies today. Promising dramatically better and faster solutions to complex challenges such as climate change, the technology is likely to disrupt industries, markets and geostrategic capabilities. Quantum computing could be used, for example, to create more efficient battery structures or to reorganize food systems to make them less resource intensive.\n\nAs outlined in Quantum Computing Governance Principles, a report of the Centre for the Fourth Industrial Revolution’s Platform for Shaping the Future of Technology Governance: Artificial Intelligence and Machine Learning, the coherent, cohesive, productive and beneficial use of quantum computing is thus of growing industry and public concern. The report sets the agenda for an ongoing stakeholder discourse between technologists and industrial, political and societal leaders, facilitated by the Centre.\n\nThe rapid spread of decarbonization commitments is defining another technology trend, accelerating progress in areas from energy and transportation to food production. Technologies like self-fertilizing synthetic crops, identified by the World Economic Forum as one of the top 10 emerging technologies of 2021 in a report by that same name, hold the promise of greater efficiency and sustainability but their broader ecosystem implications are poorly understood.\n\nQuantum computing and synthetic biology are two new domains in which the Centre started expanding its expertise in the past year. The Centre expects more growth in these area in the near future through impact initiatives and new centres as well as through the support of newly signed Global Innovators and Technology Pioneers, the Centre’s communities of startups and scale-ups at the forefront of technological and business model innovation.\n\n“At NTT, we believe in using technology for good. We also believe that technology should be deployed within the proper ethical and regulatory guidelines to truly be effective. We highly value the World Economic Forum and its Centre for the Fourth Industrial Revolution as a key resource for the public-private collaboration that is necessary to address topics of policy, governance and trust.” —Devin Yaung, Senior Vice-President, Group Enterprise IoT Products and Services, Nippon Telegraph and Telephone (NTT)\n\nEngagement\n\nThe Centre for the Fourth Industrial Revolution engages over 250 industry leaders, public figures and representatives from academia, civil society and international organizations in its three Platforms: Artificial Intelligence and Machine Learning, Blockchain and Digital Assets, and Data Policy.\n\nSource: GETTY/YUICHIRO CHINO\n\nIn addition, the Centre works directly with governments at the national and subnational level through its network of 15 Centres for the Fourth Industrial Revolution. Staff is composed of 200 technology and policy experts, including over 50 Fellows from government, business and academia who are an integral part of the network and play a key role in designing concepts and frameworks as well as advancing real-world applications.\n\nThe Centres for the Fourth Industrial Revolution in Azerbaijan, Brazil, Colombia, Israel, Kazakhstan, Norway, Rwanda, Saudi Arabia, Serbia, South Africa, Turkey and the United Arab Emirates are co-hosted and co-financed by national public and/or private entities. The Centres in India and Japan are co-hosted by the World Economic Forum and their respective governments. The San Francisco Centre is a Forum entity and serves as a catalyst, curator and coordinator for the overall network.\n\nAll Centres serve as:\n\n– Trusted spaces for public-private cooperation, dedicated to exercising foresight, breaking silos and co-designing solutions for sectoral and industry transformation\n\n– Mission-driven “do-tanks”, equipped with the mandate, stakeholder communities and technical capabilities to rapidly prototype, iterate and scale-up solutions\n\n– Champions for inclusivity and sustainability, pursuing a human-centric approach to technology adoption to promote shared prosperity within planetary boundaries\n\nThe Centre for the Fourth Industrial Revolution systematically identifies and engages game-changing start-up and scale-up companies. Its Global Innovators community comprises 150 privately owned growth-stage (Series B+) start-ups, and its Technology Pioneers community accepts 100 select early-stage start-ups every year.\n\nThe 2022 cohort of Technology Pioneers included a significant increase in the number of companies focused on climate change, with activities in such areas as energy storage, hydrogen, alternative proteins and smart buildings. It also included healthcare companies active in women’s health, value-based healthcare, mental health and tele-health as well as start-ups at the forefront of tools and platforms in the metaverse ecosystem.\n\nSource: GETTY/WESTEND61\n\nImpact\n\nThe Centre for the Fourth Industrial Revolution drives impact by building trust, creating insight and encouraging policy innovation and experimentation. It champions multistakeholder collaboration locally, nationally and globally.\n\nHighlighted achievements of the past year include:\n\n– Three new Centres, in Azerbaijan, Kazakhstan and Serbia, were added to the network, for a total number of 15 in advanced and emerging economies, representing 40% of global GDP and 30% of the global population.\n\n– The Centre for the Fourth Industrial Revolution expanded its local presence and impact to reach more than 50 cities through the launch and growth of the G20 Global Smart Cities Alliance’s regional networks in Latin America and Asia and the establishment of new urban test beds for local entrepreneurship in eight of the world’s fastest growing cities.\n\n– The Global Innovators community grew to over 150 privately owned growth-stage (Series B+) start-ups with a valuation of more than $30 million.\n\nCreating innovative policy strategy and frameworks\n\n– To develop Turkey’s AI sector, the Centre for the Fourth Industrial Revolution Turkey helped advance the country’s first strategic AI plan, with guidance and insights from the existing National AI Strategy peer network.\n\n– The Digital Currency Governance Consortium launched a first-of-its-kind global resource for central bank digital currencies and stablecoins, co-created by over 85 organizations and nearly 200 individual members.\n\n“This law provides the necessary foundation to transform Rwanda into a data-empowered society, by ensuring all critical stakeholders, starting with government institutions, are attaining the gold standard in personal data protection and privacy.” —Paula Ingabire, Minister of Information Communication Technology and Innovation of Rwanda\n\nSource: GETTY/YOSHIKAZU TSUNO\n\n– As part of the Data for Common Purpose Initiative, the Centre for the Fourth Industrial Revolution Japan led the development of new governance models for data marketplace service providers, and the Centre for the Fourth Industrial Revolution Colombia prototyped a framework to strengthen trust, consent, valuation and the sharing of data in a data marketplace in the energy sector.\n\n– The Global Coalition for Digital Safety continued its work to tackle harmful content and conduct online. The coalition brought together senior members of governments from Australia, Belgium, Singapore and the United Kingdom with Amazon, Google, Meta and Microsoft, among other companies.\n\nAccelerating sectorial transformation\n\n– The Small and Medium Sized Enterprises Futures Network lowered barriers to the adoption of the industrial internet of things among these enterprises. Piloted in Brazil, the initiative was scaled across Colombia, Saudi Arabia, South Africa and Turkey.\n\n– Working with the Telangana State Government in India and the Centre for the Fourth Industrial Revolution India, the Platform for Shaping the Future of Technology Governance: Data Policy established a consent-based and data-sharing framework that helps Indian farmers build more efficient supply chains, increase crop yields and improve the effectiveness of markets.\n\n– Following the publication of a paper entitled “Artificial Intelligence for Agriculture Innovation” in March 2021, the Centre for the Fourth Industrial Revolution India launched the Enabling Fourth Industrial Revolution Technologies for the Transformation of Agriculture initiative to help solve agriculture’s three biggest challenges: inclusivity, sustainability and efficiency.\n\n– HUB Ocean helped reduce CO2 emissions from shipping through the development of the Ocean Data Platform. The Shipping Emissions Tracking system helped Partners find the most suitable vessel for the transportation of freight.\n\nPromoting responsible technology-driven solutions\n\n– With support from the Platform for Shaping the Future of Technology Governance: Data Policy, the Centre for the Fourth Industrial Revolution Rwanda led the development of a new law on the protection of personal data and privacy with the Rwandan Government. The Centre continued to support the National Cyber Security Authority of Rwanda to implement the law.\n\n– Based on recommendations and guidance from the Centre for the Fourth Industrial Revolution Japan, the Japanese Government adopted agile governance as one of the five principles of government digital transformation.\n\n– The Centre for the Fourth Industrial Revolution Israel participated as a key coordinator and developer of the regulatory sandbox in Israel’s National Drone Initiative. Three of eight demonstrations were completed, including the transport of COVID-19 lab samples. The Centre will continue to help formulate aerospace regulatory policies pertaining to the responsible use of drones.\n\nScaling technology-driven solutions for global challenges\n\n– The Responsible Limits on Facial Recognition Technology framework, led by the Shaping the Future of Technology Governance: Artificial Intelligence and Machine Learning Platform, was adopted by Interpol and mandated in its 190 member countries. The framework continued to be piloted by countries on five continents."}]}