{"Ha Jung-woo rose to fame with his leading role in The Chaser.": [{"url": "https://www.nytimes.com/2009/12/30/movies/30chaser.html", "page_content": "True to its title, “The Chaser” includes several hot pursuits. Forsaking cars and motorcycles, they involve men running up and down the steep, labyrinthine streets and alleys of the Mangwon neighborhood in western Seoul. When the quarry \u0097 a frog-eyed serial killer whose preferred tools are a hammer and chisel \u0097 is finally brought to ground, his exhausted pursuers beat him more from irritation than any desire to see justice done.\n\nThe sweaty low-tech action and the emphasis on urban topography link the film, the feature debut of the director Na Hong-jin, to modern South Korean classics like Lee Myung-se’s propulsive cop drama “Nowhere to Hide,” and Bong Joon-ho’s river-monster thriller “The Host.” Mr. Na isn’t operating at that high a level, at least not yet. But with “The Chaser” he’s trying to chart a similar course between the poles of art-house pomposity and empty style that characterize so much of Korean moviemaking.\n\nThe result may be particularly appealing to American audiences: while many of his compatriots look to France (for cryptic game playing) and Japan (for glossy horror and violence), Mr. Na has his eye on Hollywood. “The Chaser” evokes both film noir, in its conflicted hero and its moody shots of nighttime Seoul, and America’s most influential 21st-century cultural export, the television police procedural, in its straightforward storytelling.\n\nStraightforward by Korean standards, anyway. Mr. Na and his co-screenwriters, Hong Wan-chon and Lee Shin-ho, mostly do without the mind-bending flashbacks, digressions and after-the-fact explanations that can make Korean thrillers seem fatally artificial to Western viewers. But their story does turn on several fairly astounding coincidences, the last abruptly shifting what had been a high-octane crime drama into a tragic key and dissipating much of the tension."}, {"url": "https://www.rottentomatoes.com/celebrity/ha_jeong_u_2", "page_content": "Highest Rated: 100% Tunnel (2016)\n\nLowest Rated: 43% The Berlin File (2013)\n\nBirthday: Mar 11, 1978\n\nBirthplace: Seoul, South Korea\n\nHa Jung-woo was an actor who had a successful Hollywood career. Jung-woo began his acting career with roles in such films as \"The Unforgiven\" (2005), \"Gumiho Gajok\" (2006) and \"Breath\" (2007). He also appeared in \"Time\" (2007), \"Forever the Moment\" (2008) with Moon So-ri and the David L McInnis drama \"Never Forever\" (2008). His film career continued throughout the early 2000s in productions like \"The Moonlight of Seoul\" (2008), \"Ulhakgyo ET\" (2008) and \"You Don't Even Know\" (2009). He also appeared in \"Boat\" (2009). Film continued to be his passion as he played roles in \"The Yellow Sea\" (2011), \"Nameless Gangster: Rules Of The Time\" (2012) and \"Love Fiction\" (2012). He also appeared in \"577 Project\" (2012) and \"The Berlin File\" (2013). Most recently, Jung-woo acted in \"Heosamgwan Maehyeolgi\" (2015)."}, {"url": "https://zapzee.net/2020/04/22/ha-jung-woo-played-a-big-role-in-catching-the-hackers-will-he-be-able-to-make-up-for-his-image/", "page_content": "Ha Jung Woo, who was involved in many issues from being hacked to being suspected of using propofol, has taken a new turn.\n\nActor Ha Jung Woo has suffered a number of bad news recently. He was criticized for being a prolific actor where he always played a similar character and acted in the same way. In February, The Closet, produced and starred by Ha Jung Woo, failed to reach a break-even point and attracted only 1.2 million viewers. Of course it suffered from the aftermath of COVID-19, but the prevailing opinion is that the film is much less than expected.\n\nOn top of that, he was caught up in a controversy over his private life. When the hacking of celebrities’ phones got surfaced, Ha Jung Woo was named as one of the victims. Despite the fact that he was a victim of a crime, he was suspected of having a fatal problem in his private life as he was threatened to pay several hundreds of thousands of dollars. To make matters worse, the public seemed to have turned their backs on him when he was reported to have habitually used propofol, a sedative drug.\n\nHowever, on April 20, negative public opinion about the actor took a drastic turn when Dispatch unveiled the conversation between Ha Jung Woo and the hacker. One of the hackers revealed that he had obtained information by hacking into Ha Jung Woo’s phone and stated that he would dispose of all the data if he pays 1.5 billion KRW (approx. 1,216,290 USD). In response, Ha Jung Woo persistently continued messaging with the hacker after reporting to the police, giving the police the time to investigate further.\n\nIn the process, he toyed with the hacker using his unique sly manner. He continued sitcom-like conversation, like “Let’s talk slowly. 1.3 billion isn’t a dog’s name. You know I gotta sell both my pear and radish fields. Or I’ll give you the pear field, so why don’t you sell it,” “I got such goosebumps that I am living like a goose,” and “Change your profile picture.”\n\nAs a result, the police secured the crucial IP address and arrested two hackers.\n\nPublic opinion seems to have turned around to some extent as the witty conversation that played a great tole in catching the criminals has been released. However, there are still doubts about his alleged propofol usages. Some even raise suspicions that Ha Jung Woo may be trying to “change the subject” by revealing the conversation with the hackers\n\nCurrently, a separate investigation is undergoing regarding the actor’s propofol case. According to the agency, no schedule has been set Ha Jung Woo’s summons to the prosecution yet.\n\nSource (1, 2)"}, {"url": "https://peoplepill.com/people/ha-jung-woo/", "page_content": "Ha Jung-woo (born Kim Sung-hoon on March 11, 1978) is a South Korean actor and film director. Ha studied theater at Chung-Ang University, and after several years of minor and supporting parts, he was cast in his first starring role in the low-budget indie The Unforgiven (2005), directed by his friend Yoon Jong-bin. This was followed by Kim Ki-duk's Time (2006), and Never Forever (2007) with Vera Farmiga. But his breakthrough role to stardom was in Na Hong-jin's serial killer film The Chaser (2008). Known to attract both critical acclaim and commercial success, Ha quickly became the most in-demand leading actor of his generation in Korean cinema, showcasing his versatility in road movie My Dear Enemy (2008), sports film Take Off (2009), crime drama The Yellow Sea (2010), gangster saga Nameless Gangster: Rules of the Time (2012), romantic comedy Love Fiction (2012), spy thriller The Berlin File (2013), and action thriller The Terror Live (2013). He made his directorial debut through the comedy film Fasten Your Seatbelt (2013), followed by Chronicle of a Blood Merchant (2015).\n\nEarly life\n\nBorn as Kim Sung-hoon, Ha Jung-woo came from an acting family. His father Kim Yong-gun is a well-known veteran actor who has appeared in many movies and television series, while his younger brother Kim Young-hoon (stage name: Cha Hyun-woo) is an aspiring actor. Ha has said that since he was 4 or 5 years old, he has always dreamed of becoming an actor like his father. Before entering college, Ha studied at a private acting institute and at one point had actor Lee Beom-soo as his instructor. He then enrolled at Chung-Ang University as a theater major, where he acted on the stage.\n\nIn 1998, Ha began his military service, working in the Armed Forces Public Relations Department. He put his acting experience to good use during this time, appearing in 10 promotional films for the military.\n\nCareer\n\nHa made his acting debut in the 2002 SBS sitcom Honest Living and his feature film debut in the 2003 film Madeleine. For the next few years, Ha's acting career was relatively low-key, appearing in several supporting roles, but not receiving a lot of attention. Things started to change in 2005. He signed with talent agency SidusHQ and on their recommendation adopted the stage name \"Ha Jung-woo.\" Ha would also appear in his first starring role in the indie film The Unforgiven - a blistering critique of the physical and psychological violence within military ranks. He then appeared in controversial arthouse director Kim Ki-duk's Time and Breath, which brought more notice to his acting talents in Korea and overseas. During this time, his portrayal of a cool-headed prosecutor who is romantically involved with a feisty police officer played by Go Hyun-jung in the popular MBC drama series H.I.T attracted more female fans. He also starred in the American indie film Never Forever opposite Vera Farmiga, which garnered praise from the film festival circuit.\n\nHa's breakout came in the 2008 film The Chaser, in which he played a character loosely based on serial killer Yoo Young-chul. The movie became a huge hit at the Korean box office, raking in over 5 million ticket sales, while also garnering high praise from critics and numerous awards from local award-giving bodies. Ha's portrayal of a psychopath, coupled with his performance as a charming scoundrel in My Dear Enemy that same year, showcased his versatility and elevated his status as one of the most sought-after actors in the Korean film industry. Since The Chaser, Ha has worked virtually non-stop for the next several years, taking on diverse but compelling roles in The Moonlight of Seoul, Boat, and Take Off. Take Off, based on the Korean national ski jumping team, became one of the biggest box office hits of 2009.\n\nAmerican director Martin Scorsese, rumored to be attached to a Hollywood remake of The Chaser, has complimented Ha as having as much potential as his The Departed stars Leonardo DiCaprio and Matt Damon.\n\nHa reunited with his The Chaser director Na Hong-jin and costar Kim Yoon-seok in Na's sophomore feature The Yellow Sea, which netted Ha Best Actor trophies from the Asian Film Awards, Baeksang Arts Awards and the Korean Association of Film Critics.\n\nHa said the legal thriller The Client evoked his early days of theater, and the director praised Ha for his \"moments of true brilliance and genius\" during the production.\n\nIn early 2012, Samsung Electronics produced an ambitious PPL-frequent-film project featuring Galaxy Note, their latest Tablet hybrid mobile. Titled as Cine Note, the giant project comprises three shorts by directors Kang Hyeong-cheol, Jang Hoon and E J-yong. Ha played the leading role for all the three of the films, while celebrated musician Lee Seung-chul produced music using the device, and noted webtoon artists Son Jae-ho and Lee Gwang-soo created the film’s animated content.\n\nNameless Gangster: Rules of the Time was Ha's third collaboration with longtime friend director Yoon Jong-bin, also starring acclaimed veteran actor Choi Min-sik. This was followed shortly by the unconventional romantic comedy Love Fiction opposite Gong Hyo-jin. Both were box office hits.\n\nAfter wrapping Love Fiction, Ha along with Gong and 14 other actors went on a cross-country walking trip from Seoul to Haenam, South Jeolla Province. Their journey was chronicled in the documentary 577 Project, denoting the total distance covered in kilometers. Ha was in charge of three aspects of the production including planning, acting and casting. He said he did it to thank fans for their support after he won back-to-back Best Actor awards at the 2010 and 2011 Baeksang Arts Awards.\n\nIn Ryoo Seung-wan's The Berlin File, Ha starred as a North Korean agent in Berlin who is betrayed and cut loose in the midst of a financial espionage intrigue. Together with his wife (a translator at the embassy played by Jun Ji-hyun), they try to escape being purged, with Ryoo Seung-bum and Han Suk-kyu playing North and South Korean operatives on their trail.\n\nHe appeared in 90% of the action thriller The Terror Live, playing a news anchor with an exclusive, live broadcast on a terrorist attack.\n\nHa then made his directorial debut with Rollercoaster (released internationally as Fasten Your Seatbelt), based on his own screenplay about the comic interactions between the cabin crew and passengers (including an arrogant Hallyu star played by Jung Kyung-ho) of a flight from Tokyo to Gimpo International Airport which becomes in danger of crashing when the plane hits a major storm.\n\nWorking with Yoon Jong-bin again, Ha played a Joseon era butcher-turned-outlaw in the period action film Kundo: Age of the Rampant.\n\nIn 2015, Ha directed, wrote and starred in Chronicle of a Blood Merchant, a film adaptation of Chinese author Yu Hua's 1995 novel. He then appeared in one of the biggest domestic hits of the year, Choi Dong-hoon's Assassination about resistance fighters given orders to kill a Japanese army commander in the colonial era.\n\nHa has been cast in several upcoming films: a biopic on Andre Kim, Korea's first male fashion designer (Ha previously worked with director Son Young-sung on The Client); Park Chan-wook's The Handmaiden, an adaptation of the Sarah Waters novel Fingersmith also set during 1930s Korea; and Kim Yong-hwa's With God, an adaptation of the same-titled webtoon about a court in the afterlife where the deceased undergo multiple trials for 49 days (Kim also directed Take Off).\n\nOther activities\n\nHa Jung-woo is also an artist. Though it began as a hobby in his university days, Ha began painting in earnest in 2007. His paintings, all done in a hybrid of Pop art and Expressionist styles, have been displayed in several solo art exhibitions. Critics have said his paintings, with their strong colors and interesting composition are reminiscent of those by American artist Jean-Michel Basquiat. \"Life as an actor is like living through an invisible war. Paintings soothe me and make me rational. It is too extravagant to say that painting is my hobby; it is rather a way for me to survive as an actor,\" said Ha.\n\nIn 2011 he published a compilation of essays titled Ha Jung-woo, Good Feeling. Besides his musings on life, Ha also wrote his thoughts on famous artists such as Pablo Picasso. The book also included about 60 of his own drawings.\n\nPersonal life\n\nHa dated fashion model Gu Eun-ae from August 2008 to January 2012.\n\nFilmography\n\nFilm\n\nAs actor\n\nYear Korean Title English Title Role Production Company 2003 마들렌 Madeleine Joon-ho Cinema Service 2004 슈퍼스타 감사용 Superstar Mr. Gam Kim Yoo-weol CJ Entertainment 2005 잠복근무 She's on Duty Detective Jo Showbox 용서받지 못한 자 The Unforgiven Yoo Tae-jeong Chungeorahm 2006 시간 Time Ji-woo Happinet Pictures Korea 구미호 가족 The Fox Family Son fox MK Pictures 2007 두번째 사랑 Never Forever Kim Ji-ha Prime Entertainment\n\nArts Alliance 숨 Breath Yeon's husband Sponge Entertainment 2008 우리 생애 최고의 순간 Forever the Moment Blind date man Sidus FNH 추격자 The Chaser Je Yeong-min Showbox 비스티 보이즈 Beastie Boys Jae-hyun Lotte Entertainment 울학교 이티 Our School's E.T. Handsome doctor SK Telecom 멋진 하루 My Dear Enemy Jo Byung-woon Lotte Entertainment 2009 잘 알지도 못하면서 Like You Know It All Sculptor / Cheon-soo's neighbor Sponge Entertainment 보트 Boat Hyung-gu 국가대표 Take Off Cha Heon-tae / Bob Showbox 2010 평행이론 Parallel Life Jang Soo-young CJ Entertainment 황해 The Yellow Sea Gu-nam Showbox 2011 사랑한다, 사랑하지 않는다 Come Rain, Come Shine Other man Next Entertainment World 의뢰인 The Client Kang Sung-hee Showbox 2012 범죄와의 전쟁 Nameless Gangster: Rules of the Time Choi Hyung-bae 러브 픽션 Love Fiction Goo Joo-wol / Detective Ma Dong-wook Next Entertainment World 577 프로젝트 577 Project Himself Filament Pictures 2013 뒷담화: 감독이 미쳤어요 Behind the Camera Himself 베를린 The Berlin File Pyo Jong-seong CJ Entertainment 더 테러 라이브 The Terror Live Yoon Young-hwa Lotte Entertainment 2014 군도: 민란의 시대 Kundo: Age of the Rampant Dolmuchi / Dolchi Showbox 2015 허삼관 Chronicle of a Blood Merchant Heo Sam-gwan Next Entertainment World 암살 Assassination Hawaii Pistol Showbox 2016 아가씨 The Handmaiden Count Fuijiwara CJ Entertainment 터널 The Tunnel Jung-soo Showbox 2017 신과 함께 With God - Part 1 Gang-rim Lotte Entertainment 1987 1987 CJ Entertainment 앙드레 김 Andre Kim André Kim 베를린 2 The Berlin File 2 Pyo Jong-seong CJ Entertainment\n\nAs director/screenwriter\n\nChronicle of a Blood Merchant (2015)\n\n(2015) Fasten Your Seatbelt (2013)\n\nTelevision series\n\nYear Korean Title English Title Role Network Notes 2002 똑바로 살아라 Honest Living Ha Jung-woo SBS 2003-2004 무인시대 Age of Warriors Lee Ji-gwang KBS 2005 프라하의 연인 Lovers in Prague Ahn Dong-nam SBS 2007 히트 H.I.T Kim Jae-yoon MBC 2016 안투라지 Entourage Himself (ep.1) tvN cameo\n\nMusic video\n\n\"Betrayal\" (Big Mama, 2007)\n\nTheater\n\nOthello (2003)\n\n(2003) Waiting for Godot (2002)\n\n(2002) The Glass Menagerie (2002)\n\n(2002) The Good Doctor (2001)\n\n(2001) Carmen (2001)\n\n(2001) Be Strong, Geum-soon! (2000)\n\nDiscography\n\n\"Alaska\" (Romantic Chimpanzee feat. Ha Jung-woo - Love Fiction OST, 2012)\n\nBook\n\nHa Jung-woo, Good Feeling (essays, 2011)\n\nAwards and nominations"}, {"url": "https://kbizoom.com/actor-jung-tae-woos-son-handsome-appearance-that-resembles-bts-jin/", "page_content": "Actor Jung Tae-woo revealed the face of his handsome first son Ha-joon, who is said to look like BTS’s Jin.\n\nJung Tae-woo and Jang In-hee made their first appearance on KBS2’s “Mr. House Husband Season 2” broadcast on June 25th. The couple revealed their daily lives, starting by introducing that they have been married for 13 years.\n\nJang In-hee said, “I have been flying for 17 years and raising my two sons at the same time. I’m a working mom who can work, take care of my children, and do the housework.”\n\nSoon after, Jung Tae-woo’s two sons Ha-joon and Ha-rin showed up. Inheriting the good genes from their beautiful mother and father, the two boys caught the eyes of netizens at first glance.\n\nKim Ji-hye, who was watching the VCR in the studio, praised the visuals of the first son Ha-joon, saying, “He looks like BTS’s Jin”.\n\nMany viewers who watched the broadcast also agreed with Kim Ji-hye’s comment. They pointed out the biggest resemblance was that Jin and Ha-joon both have deer-like eyes and thick lower lip.\n\nJung Tae-woo and Jang In-hee have been revealing their sons’ daily life through their personal Instagram. In a released photo, Ha-joon showed off his handsome appearance as Jin’s lookalike.\n\nInternet users responded enthusiastically to Ha-joon’s pictures, saying “He really looks like Jin”, “He has the visual of an idol”, “He’s just a baby but already boasts such a handsome appearance”, etc.\n\nMeanwhile, Jung Tae-woo married his wife Jang In-hee, a flight attendant who is 1 year older than him, in 2009 and has two sons.\n\nSource: insight"}, {"url": "https://www.koreatimes.co.kr/www/art/2020/02/689_246227.html", "page_content": "Actor Ha Jung-woo, left, poses with Cristina Giachi, center, deputy mayor of Florence, after winning honorary citizenship, at an award ceremony held in the Italian city, Thursday. / Yonhap\n\n\n\nBy Yoon Ja-young\n\n\n\nActor and film director Ha Jung-woo has been presented with honorary citizenship of Florence, Italy.\n\n\n\nThe capital city of Italy's Tuscany, which was the center of the Renaissance, bestowed Ha with the \"Chiavi della Citta\" award, which is translated as \"the keys of the city.\" Florence has been offering the award to artists with notable achievements. The list of awardees so far includes world-renowned artists such as the late Italian tenor Luciano Pavarotti. Ha is the second Korean to win the award, following film director Park Chan-wook.\n\n\n\nThe city acknowledged his contribution to the film industry as one of Korea's leading actors and film directors.\n\n\n\n\"Through his 15-year career, Ha redefined the concept of talent and versatility, courageously engaging in ever-changing roles and offering leadership in the contemporary Korean cinema,\" said Cristina Giachi, deputy mayor of Florence. She also noted that Ha has many fans in Italy.\n\n\n\n\"It is my first time in Italy and I am truly honored to receive this award,\" Ha said at the ceremony.\n\n\n\n\"As soon as I arrived, I went to the Uffizi Gallery, and I was impressed by all the beauty I found there,\" he said, adding that he hopes to depict what he has seen in Florence in a film when he returns to Seoul.\n\n\n\nHa was born in 1978, the eldest son of veteran actor Kim Yong-gun. He debuted with the stage name Ha Jung-woo, not to rely on his father's fame. His younger brother is also an actor.\n\n\n\nHe majored in theater at Chung-Ang University in Seoul, and spent most of his 20s on stage. He has appeared in around 30 films so far, including \"Along with the Gods: The Two Worlds.\"\n\n\n\nHa is also known for his talent in painting, holding a number of exhibitions.\n\n"}, {"url": "https://www.soompi.com/article/367103wpp/lee-jang-woo-cast-for-human-casino", "page_content": "The virtual husband of T-ara‘s Eunjung has landed himself a a leading role in an upcoming KBS drama special called “Human Casino.”\n\nThe drama also features cameos by 2PM‘s Wooyoung and miss A‘s Suzy and revolves around a gang of gamblers that put real human lives on the table. Lee Jang Woo will be joining the cast as the role of a vet that’s out to save his fiancee, whose life is threatened by being captured by the gang.\n\nLee Jang Woo rose to fame through his drama, “Smile Donghae,” and has since then taken on everything the industry has to offer: CF deals, music video appearances, and variety shows. He’s said to be the #1 actor that producers hope to snag, and snag they did, as in addition to “Human Casino,” he is the third wheel to Chun Jung Myung and Park Min Young in the upcoming “Man of Honor.”\n\nNetizens commented, “I’ll be seeing him on TV every day now!” “The rookie award of the year is his!” and “I’m looking forward to both of his dramas!”\n\n“Human Casino” will air at 11:25 PM KST on September 25."}, {"url": "http://www.hangulcelluloid.com/hajungwoointerview.html", "page_content": "The following group interview took place at BAFTA in London, on December 18th 2013, prior to the Korean Cultural Centre UK special screening of 'The Terror Live' and Q&A with actor Ha Jung-woo:\n\nInterview:\n\nHangul Celluloid: Throughout your career, you have balanced acting in hard-hitting narrative-led movies such as ‘The Berlin File’ with roles in far gentler character-driven films like ‘My Dear Enemy’. How do you go about preparing for a specific role and do your preparations differ between films that are largely story-based and those that are essentially character studies?\n\n\n\nHa Jung-woo: Basically, I am full of curiosity and I am very interested in people. In fact, I love people. I normally get my first ideas about a specific character I am to play from screenwriters but in Korea most directors are also screenwriters so I always ask directors lots of questions like “How did this character start out” or “How did you begin to develop this character”. Essentially, I do a lot of research about a character whether it is for a story-led film or a character study and that’s how I build the way in which I will play the role. For example, the character I played in ‘My Dear Enemy’ was actually modelled on the director’s friend and so I was able to learn a great deal about him by asking the director. I read lots of novels, too, and that also helps to build up characters, in general. For each role I play, I endeavour to take on the persona of a real-life person to make the character more believable. If you take the example of ‘The Chaser’, you probably know that the character I played was a real person in Korea, the film was based on a real story, and so I looked into the police investigations of the case and how the main investigator had written descriptions of that person in his reports and how he had detailed that person’s reactions to questions so that when the police interrogated the suspect in the film I could make my reactions as true-to-life as possible.\n\n\n\n\n\nSumGyeoJin Gem: ‘Fasten Your Seatbelt’ was your directorial debut. Why did you decide to move into directing and what were the challenges you faced directing the film?\n\n\n\nHa Jung-woo: Being a director has always been part of my plan. It’s not a new idea, I always intended to direct as well as act. I love working around films and yes, of course, I began my career as solely an actor but my plan for the future is to be both an actor and director. As far as the challenges of directing ‘Fasten Your Seatbelt’ are concerned, as I am an actor and I know how acting works I probably expected too much from the actors involved and perhaps my aim wad too high. ‘The Terror Live’ – the film that is screening tonight – was filmed right after I finished directing ‘Fasten Your Seatbelt’ and because of that I was able to understand the director to a far greater degree – having been a director myself, I was able to communicate a lot better with the director of ‘The Terror Live’. Communication is, of course, very important in day-to-day life but it’s even more so in film.\n\n\n\n\n\neasternKicks: I’d like to ask you about Ryoo Seung-wan’s ‘The Berlin File’ which I think was really your first much more straightforward action film; in terms of stunts and particularly the martial arts sequences. How did you find the training for the film and was the chance of doing some of that work what attracted you to the role?\n\n\n\nHa Jung-woo: I’ve always very much liked director Ryoo Seung-wan’s action films and we always had a plan to work together on a film. However, we were unsure of what project that would be until ‘The Berlin File’ came up, and that was the film we ultimately ended up working on together. In my opinion, I would say ‘The Berlin File’ is a drama rather than an action film, but there we go, and for the action scenes I just did what I was told by the fight choreographer. I did a bit of action before but as an agent doing martial arts ‘The Berlin File’ was the first time so I guess because I felt I had no real experience I went to train at ‘stunt school’ and practiced rally hard; basically starting from learning how to punch properly.\n\n\n\n\n\nMini Mini Movies: You’ve mentioned acting and directing. I believe you have a film coming up called ‘Chronicle of a Blood Merchant’, based on a Chinese novel, in which you act and direct at the same time. I wondered how that came about. Was it something you were a fan of or did someone else approach you?\n\n\n\nHa Jung-woo: Because it’s a very interesting, funny story is the main reason I chose to work on ‘Chronicle of a Blood Merchant’. About two years ago, I received a novel from a production company and the CEO of the production company is actually a friend of the writer. Initially I was offered a job as an actor in the production. The story, as I’ve said, was really interesting but I felt I was too young to play the character so at that time I refused. Two years later, the same CEO came to see me on the set of ‘The Terror Live’ and said there was no time to waste as the publication rights were close to running out, but I still refused because I’m in my 30s [Ha Jung-woo laughs] and I told him if the rights could be extended to when I turn 40 then I would be interested. Just a couple of days later, he came back and said he had asked the writer if he could wait but he was unable to as the film would soon be made in China, anyway. The CEO said how much he loved the story and how he really wanted to see the film made in Korea and he agreed that he would be happy as long as it was done by 2014. So, shooting will go ahead next May. As I said, up to that point I was only going to be an actor in the film but after I accepted the role we met up to discuss who would be the director. Around the same time, I was editing ‘Fasten Your Seatbelt’ and there were some good rumours going round the editing room and shortly after that I heard that I had been chosen as the director, too. That was a proposal that really made my heart leap and so I accepted the offer.\n\n\n\n\n\nKorean Class Massive: Do any of the roles you play affect you outside of shooting? In ‘The Chaser’, for example, you play a very sadistic character. Is it difficult to switch off once shooting ends for the day?\n\n\n\nHa Jung-woo: I don’t find it hard to switch off because when one role is close to completion I’m always thinking of the next role to move on to. I try very hard not to bring what happens on set into my home and I make a real effort to separate my work and home life. I guess that’s why I find it fairly easy to switch off from a specific character.\n\n\n\n\n\nOriental Nightmares: You appeared in two of director Kim Ki-duk’s films, ‘Breath’ and ‘Time’. I wondered what it was like working with director Kim as he seems to be quite hard on his actors to get the performance he wants out of them?\n\n\n\nHa Jung-woo: I know it’s rumoured that he’s quite hard on actors but he wasn’t like that at all when we worked together, and for me it was an absolute honour to have the chance to work with him. When you shoot a film, normally you met up to read the script together and that’s how you first met and get to know the character you’re going to play, etc. But with Kim Ki-duk there was no reading of the script for ‘Time’, and I don’t know if he always does this or if it was just the case for this film, but he said the acting and building of the character was basically down to me, in a very trusting way. Eight years ago, I was quite a ‘newbie’ and I didn’t have that much experience at the time, but the whole shoot was so comfortable I was really amazed that director Kim let me to decide on the character and the way to act. It was all done very comfortably and pleasurably as if I was working with my friends, unlike the rumour [Ha Jung-woo laughs]. When we worked on our second film together, ‘Breath’, it felt like we didn’t talk about the film; we just talked about other things, really.\n\n\n\n\n\nAsian Global Impact: You seem to be a multi-talented actor and director in the vein of James Franco; an American, he too acts, directs, he writes and he also paints. I know that you do painting as well, and I actually went to one of your exhibitions three years ago. What is it about painting that you enjoy? Do you feel it allows you to express something different to that of your films?\n\n\n\nHa Jung-woo: When I graduated from university, I was practically unemployed. Obviously, I went for auditions but I had no tomorrow or certain future and it seemed just a continual repeat of mundane life. As such, I really wanted to do something creative and one day I just went to an art shop and bought a sketch book and paints and began painting. I found that while painting I was able to get rid of those worries about my future and it largely became both my life and my hobby. Once I began to get acting roles, my career moved up but still at times as an actor I’ve felt quite isolated and my painting has served as a way to get rid of that feeling and discharge that emotion. On the set, I’m forced to be logical and the director but I can feel quite emotional when I come home sometimes, whether I feel I did a good job of acting or not, and I guess when I see the end result of my painting it refreshes my mind and alleviates that stress. I guess my painting is my emotional diary.\n\n\n\n\n\nKoreaffinity: I’ve been wondering why directors like Na Hong-jin and Ryoo Seung-wan are always choosing you to run in films. What do you think directors see in you that makes them cast you in such roles; your characters often escaping from one place to another?\n\n\n\nHa Jung-woo: Maybe because I was born in the year of the horse [Ha Jung-woo laughs]. Na Hong-jin and Ryoo Seung-wan, after ‘The Chaser’ etc, recommended me to other directors saying “You’ve got to make him run, and your film will definitely be successful” [Ha Jung-woo laughs, again].\n\n\n\n\n\nAsian Global Impact: If I could just add to that, you also have a lot of eating scenes. Is that a special skill, too?\n\n\n\nHa Jung-woo: I always make sure they bring out hot food that you can actually eat, rather than just looking nice. In ‘Yellow Sea’, as you likely remember, there were many eating scenes; eating potatoes and hot dogs and they were really, really hot too – almost too hot to eat – and that really helped to make it more real and made expression easier. In Korea, there are many captured clips from films of me eating, with many of them online, and when I go to a restaurant with my friends there will always be one or two people filming me eating [Ha Jun-woo laughs]. So, it’s really difficult for me to eat out in public. These days, when I see people in certain postures or making specific gestures, I know that they’re trying to film me.\n\n\n\n\n\nCine_Asie: You come from a family of actors: Your father was a famous TV actor and your brother has started appearing in more and more television dramas, as well. When you started your career you acted in a TV series and you have since moved away into acting in films and have also added directing to your career. Earlier in the year, we met director Ryoo Seung-wan who has worked with his brother and as your brother is an actor, so far mostly in TV, are you considering working with him in film?\n\n\n\nHa Jung-woo: Once I get more experience as a director then I should be able to cast my brother in a film. I think to shoot a film together as a family, rather than just being in a film as an actor, would be a good experience and something to remember.\n\n\n\n\n\nSumGyeoJin Gem: Tonight, there will be a screening of ‘The Terror Live’. How did you prepare yourself to be in character Young-hwa’s shoes as a news announcer in a very tight space; two locations within a news room?\n\n\n\nHa Jung-woo: I don’t think the small space matters that much. It’s more about how the audience will see the film without feeling bored – because a newsroom is essentially a boring space. We talked a great deal about how to ensure the audience wouldn’t feel bored in the space; different camera work, different cuts, and the use of multi-camera shots. The film comprises of 21 chapters and each chapter lasts for between five and ten minutes and we wanted to have a ‘live’ feel to it almost like a theatre. So, we shot non-stop for each chapter. The director had prepared for the film for five years and had prepared in such depth that he had shots from other films that he used and combined within the construct of the script and he showed me the demo film he had made. I think that in itself shows how much preparation he undertook.\n\n\n\n\n\nHangul Celluloid: On a much more general subject, I have spoken to a lot of actors and directors who have talked about the difficulties faced by smaller independent film productions as a result of Korean film studios’ continued focus on large budget blockbusters. As you are both an actor and a director, what are your thoughts on that issue?\n\n\n\nHa Jung-woo: I think the actual number of smaller film productions has increased in recent years because it’s now so much easier to film in numerous ways; even with a mobile phone, as has been done on more than one occasion in Korea. So, even though there is indeed still ongoing pressure from large Korean film companies and studios for films that are either large budget blockbusters or almost certain money makers, I believe that the passion of those people who truly love films will enable small and independent films to continue to exist and even flourish.\n\n\n\n\n\neasternKicks: I wanted to ask you about EJ Yong’s film-within-a-film ‘Behind the Camera’, which you star in: Working with all those big name stars over what I believe was a tight two-day shooting schedule, what was it like working with a director who wasn’t on set or even in the same country, for that matter?\n\n\n\nHa Jung-woo: It was amazing [Ha Jung-woo laughs]. To make it worse, I was working with EJ Yong on a different short film at the same time. So, in ‘Behind the camera’ I had a very small part and in the other short film I was the main actor. Director EJ Yong had a very clever idea to produce the film and we accomplished it through online chatting. I actually had another camera and I thought it was filming me, but it turned out it was just filming the background. In relation to the previous question about independent productions, because of directors like EJ Yong I don’t think low budget films will disappear.\n\n\n\n\n\nMini Mini Movies: You mentioned working with EJ Yong on another film and you have worked with other directors more than once, like Lee Yoon-ki, Kim Ki-duk, and Na Hong-jin. Is there one director you would still like to work with a second time, in the future?\n\n\n\nHa Jung-woo: Of course. I have talked about doing another film with director Kim Byung-woo, but we haven’t decided on anything specific at this point. I feel very blessed and lucky to have met such good directors throughout my career and having good people around me has regularly made me want to work with a director on more than one film.\n\n\n\n\n\nKorean Class Massive: ‘Fasten Your Seatbelt’ premiered at this year’s Busan International Film Festival. How did it feel to have your directorial debut premiere at such a prestigious film festival?\n\n\n\nHa Jung-woo: I went to the Busan Film Festival in 2005 with ‘The Unforgiven’ as an actor and then this year I was invited to go as a director. So, it felt really great and the festival itself felt very different going in as a director and I felt much closer to it.\n\n\n\n\n\nOriental Nightmares: A number of Korean actors and directors have tried to make or appear in films in the US. You appeared in a US/South Korean film by Gina Kim [Never Forever] but would you choose to appear in or direct a film in the US?\n\n\n\nHa Jung-woo: I do have plans to, and I’d also like to but I can’t really say much about that specifically, at the moment.\n\n\n\n\n\nAsian Global Impact: Could you tell us a little bit about your next project ‘Kundo’ which I believe is a historical film? Is it more difficult or more fun to play in an historical film rather than a modern role?\n\n\n\nHa Jung-woo: It’s not fun at all. In the summer, Korea was very hot and I had to wear long trousers and big boots - layers and layers of clothing - and I had a shaved head and I had to have a beard and wear burnt make-up. So, it was incredibly difficult. There were also many horse-riding scenes and because it was so hot, the horses wouldn’t listen or do what they were told. Nothing was easy at any given time during shooting. People might think that having a shaved head would be cool, but I spent so long in the sun that at night I could even feel the heat coming up again. So, I was able to learn quite a lot about solar energy [Ha Jung-woo laughs].\n\n\n\n\n\nKoreaffinity: Prior to ‘Project 577’ you made a promise to the Korean people that resulted in a beautiful documentary about Korea. Do you feel you freed your spirit and do you think the rest of the actors hate you now? [In 2010, Ha Jung-woo won an award at the PaekSang Arts Awards and promised he would walk across Korea if he won the award again… He won the award the subsequent year and convinced some acting friends to go with him on his 577km journey to fulfil that promise].\n\n\n\nHa Jung-woo: After that incident, I’ve never talked about anything like that again but through that three week cross-country walking trip I learnt a lot and realised that parts of Korea I didn’t know about are really beautiful. I was lucky that Korea is small [Ha Jung-woo laughs].\n\n\n\n\n\nSumGyeoJin Gem: You have been in a number of action films, The Chaser, ‘Yellow Sea, ‘The Berlin File’, and normally no stunt men are used and you have to do the action scenes yourself. How do you endure the pain until the director says “Ok, that’s the perfect shot”?\n\n\n\nHa Jung-woo: I didn’t do all the action and fighting scenes myself. There is a ‘double’ who looks exactly like me from the back. So, it wasn’t all me.\n\n\n\n\n\nHangul Celluloid: You are almost instantly recognisable in the majority of your roles but in 2006 you played a far less recognisable part in ‘The Fox Family’. What specific difficulties were there in working in a musical fantasy as opposed to a straightforward action film or drama and what attracted you to the role?\n\n\n\nHa Jung-woo: When I received the script, I was very much reminded of Tim Burton’s work and I tried to get the feel for the character from his films. That’s also what attracted me to the part and though I’m not sure how audiences felt about the role I played it was Burton’s work that I based my performance on. As far as the musical aspect of the film and the dancing sequences are concerned, because I began my career as a theatre actor I didn’t find any real difficulty in performing as I was required to.\n\n\n\n\n\neasternKicks: You’ve been lucky to never have been typecast – you’ve played in a variety of roles from romantic lead to spy to serial killer. I wondered what sort of roles you like playing most and is there anything you’d like to try that you haven’t yet?\n\n\n\nHa Jung-woo: My dream role would be Hamlet on stage because I did theatre studies and being Hamlet to any theatre actor is a blessing and an honour. I was actually offered a job in 2009 but as I was so busy making ‘Yellow Sea’ I wasn’t able to do it, but hopefully before I get too old I’ll get the opportunity to play Hamlet. Choi Min-sik, who I believe was here in England recently, played Hamlet in 1999 and ten years later to celebrate the role I was offered the part, but as I said I was at that time too busy to accept.\n\n\n\n\n\nMini Mini Movies: We talked about the directing of ‘Fasten Your Seatbelt’ but as far as the writing is concerned did you have some collaboration?\n\n\n\nHa Jung-woo: Obviously I got ideas from the actors and actresses involved when we were reading the script but the film was actually based on a real story, experienced by Ryoo Seung-beom.\n\n\n\n\n\nKorean Class Massive: What has been the most physically demanding role you’ve had to date?\n\n\n\nHa Jung-woo: Without question, ‘Kundo’ was by far the most physically demanding as a result of the heat alone. In that film I was using a very knife while the other actor was using a long sword and I was worried that I might actually get cut or injured. Whenever I talk about physically demanding roles, ‘Kundo’ will always be the one I mention. Before that film, I would probably have said ‘Yellow Sea’ because the shooting was for 11 months and also took place in suburban China.\n\n\n\n\n\nOriental Nightmares: Who are the directors and actors who have inspired you throughout your career?\n\n\n\nHa Jung-woo: There are many: Martin Scorsese, Woody Allen, Tim Burton, Al Pacino, Marlon Brando, Robert Downey Jr, even perhaps James Franco [Ha Jung-woo laughs]\n\n\n\n\n\nSumGyeoJin Gem: Choi Min-sik is going to star in Luc Besson’s ‘Lucy’ with Scarlett Johansson. Are you interested in working with foreign directors and cast members in order to extend your work in terms of different cultures’ film productions?\n\n\n\nHa Jung-woo: I am open to the idea. In fact, I had a call from South Africa at one point but I thought it was too far to go. Hopefully at some point in the future a suitable opportunity will arise.\n\nOn behalf of everyone involved, I'd sincerely like to thank the Korean Cultural Centre UK for allowing us all to interview actor Ha Jung-woo at such length. Also, many thanks to Sinae Hong for her superb interpreting throughout the interview.\n\n\n\n\n\n\n\n"}, {"url": "https://koreajoongangdaily.joins.com/2015/10/21/etc/Ha-Jungwoo-to-star-in-With-God-movie/3010579.html", "page_content": "\n\n\n\nHa Jung-woo to star in ‘With God’ movie\n\nHa Jung-woo, one of the most prolific actors in the Korean film scene, has signed on to appear in a new film, “With God,” according to Fantagio, the 37-year-old actor’s agency.In the much-anticipated film based on the popular web cartoon series of the same name, Ha will play the role of a man who is escorted to the afterworld after his death and spends 49 days there with other deceased people to await multiple trials.The actor has played supporting roles in numerous films and drama series since his 1998 debut, but the 2008 hit film “The Chaser” brought him fame and popularity. In the film, Ha plays the role of a serial killer.Since then, Ha has been keeping his schedule full.Over the past three years, he has appeared in six films, including “Assassination” (2015) and “Kundo: Age of Rampant” (2014), and also directed and starred in “Chronicle of a Blood Merchant” (2015).Apart from “With God,” Ha also signed on to three other films: “Agasshi,” “Tunnel” and “Andre Kim.”Meanwhile, director Kim Yong-hwa of “Mr. Go” (2013) and “Take Off” (2009) will take the helm of “With God.” Both Kim and Ha worked together on “Take Off.”By Sung So-young"}, {"url": "https://seoulspace.com/the-greatest-korean-actors-of-all-time-updated/", "page_content": "How do you rank the greatest Korean Actors of all time? This is impossible to do unless you set up some guidelines. Performances come in various types based on the genre and the era they occurred. Judging a great comedic performance next to a great dramatic one is difficult. In addition, actors today have much more freedom to push the boundaries than in Korean films in the past. With the success of Parasite and the demand for more Korean film recommendations, many Korean films are getting a look from the global audience for the first time.\n\nHere are our guidelines to do the Top 10 Greatest Korean Actors correctly.\n\nThe number of awards won for their acting\n\nThe number of memorable characters played\n\nHow many films have they done? Experience matters.\n\nCan they play a range of characters?\n\nReviews from critics\n\nWe have also done an article on the Greatest Korean Actresses of all time which you should check out.\n\nSong Kang-ho\n\nIf Choi Min Sik brings explosive passion to a role, Song Kang-ho is like a professional surgeon. Every mannerism, line delivery, and facial expression feels calculated to the tee. He can express so much while showing very little emotion. Best of all, he seems to be getting better with age. His recent work in Parasite might be his best work to date. Song Kang-ho’s career has spanned three decades.\n\nFor the last decade, there has been a debate in the Korean film industry on who is the best actor, Choi Min Sik or Song Kang-ho. I would argue that Song Kang-ho has passed Choi due to his performance in Parasite. In addition, Song Kang-ho can unexpectedly be funny when a role calls for it and completely transform himself into the characters he plays. Don’t believe me? Watch Memories of Murder and The Host. Choi, on the other hand, tends to play the same character usually.\n\nChoi Min Sik\n\nWhen discussing Choi Min Sik’s career, two words come to mind, explosive and intense. Choi Min Sik is phenomenal. You always feel that this man loves the craft of acting and being able to perform. His performance in Old Boy is all you need to watch to see how great an actor Choi Min Sik is. However, Choi Min Sik seems to play the same intense and worn-down character. Yet, Choi Min Sik has proven he takes a particular character and plays it better than anyone in Korean cinema. He has been at the top of all lists for Korean actors for many decades and is still strong today. Check him out in one of the best Korean horror movies of all time, I Saw the Devil.\n\nMake sure to see the Korean version and not the Korean remake by Spike Lee.\n\nLee Jung-jae\n\nLee Jung-jae is one of the most successful actors in South Korea. Many global audiences first saw him in the Netflix hit Squid Game; however, Lee Jung-jae has been acting since 1994. He has starred in various film genres, from romance to comedies to action. There is no role he can’t play. His role in Squid Game earned him the Gallup Korea’s Film Actor of the Year, and he was nominated for the 2022 Golden Globes for Best Actor in a TV drama.\n\nAhn Sung Ki\n\nIt is difficult summing up how large of an impact Ahn Sung Ki has had on Korean Cinema. His rise to stardom came in the 80s and continues to flourish today. What makes Ahn Sung Ki such a draw is his ability to combine raw intensity that makes his performances feel feal and emotional. His roles in the 80s are perhaps his best work, where he won 5 Baeksang Arts Awards. He has set a gold standard for actors in Korea and is one of the most respected actors working today. He has appeared in over 140 films over 60 years.\n\nLee Byung Hun\n\nWhile many in the United States might know Lee Byung Hun from G.I. Joe: Rise of Cobra as Storm Shadow. He is one of the most famous and best looking Korean actors today. In addition, he has gotten critical acclaim for his roles in JSA, The Good, The Bad, the Weird, and Inside Men. He became the first Korean actor to present an Oscar at the Academy Awards and was one of the first Korean actors to imprint his hands and foot at Grauman’s Chinese Theatre. Lee Byung Hun has developed a reputation in Korea as an actor with a fierce dedication to commercial and critical film roles.\n\nSol Kyung-gu\n\nSol Kyung-gu is an actor that is known for playing both comedic roles and dramatic roles very well. Everyone in Korea knew he was a top-quality actor, but it took some time before he got the recognition he deserved. He was great in the romantic comedy I Wish I Had a Wife in 2001. As well as the war drama Silmido. He got a lot of respect from the acting community in Korea for his role in Rikidozan, where he gained over 40 pounds and did most of his lines in Japanese. Sol Kyung-gu continues to give great performances, such as in Man to Men, The Merciless, and Memoir of a Murderer.\n\nHwang Jung-min\n\nHwang Jung-min started acting in 2001 and has made at least two films yearly. One of the best movies by Hwang Jung-min is Ode to My Father, where he brought a lot of heart to the film. Most might know him from his role in The Wailing, one of the scariest Korean films of all time. He played one of the creepiest characters in Korean cinema.\n\nJeong Jae-yeong\n\nJeong Jae-yeong is an old-school Korean actor known for his roles in Silmido, Welcome to Dongmakgol, and On the Beach at Night Alone. He is not active as he used to be, and he will be lucky if he does a film a year. However, when he does, he is constantly recognized for his great work. He has won many awards and is known for his ability to play various roles.\n\nHa Jung-woo\n\nHere is a Korean actor rising the ranks and should be in the top 5 when his career is all said and done. Ha Jung-woo is not only an actor but also a director, screenwriter, and producer. He pretty much does it all. Ha Jung-woo is considered one of the highest-grossing actors in South Korea. He came to fame from his magnificent performance in The Chaser in 2008. You compare that to his performance in the sports film Take Off, and you can see just how good his range is. Check out Ha Jung-woo in one of the top Korean films of all time, The Handmaiden.\n\nKim Yoon-Seok\n\nOne of the most respected Korean actors around, Kim Yoon-Seok has a background in the theater, where he perfected his acting craft on stage. His breakout role came in Tazza: The High Rollers in 2006 and The Chaser in 2008. One of the most underrated performances of all time was Kim Yoon-Seok’s performance in Running Turtle in 2009. One of his most successful films was the heist movie called The Thieves, which became the 6th highest-grossing Korean film of all time."}], "Ha Jung-woo won Best Actor at the Grand Bell Awards and Blue Dragon Film Awards for The Chaser.": [{"url": "https://korean-binge.com/2022/12/10/grand-bell-awards-2022-full-list-of-winners/", "page_content": "The Grand Bell Awards also known as Daejong Film Awards has announced the winners for this year’s ceremony, an annual event presented by The Motion Pictures Association of Korea for excellence in film and considered prestige as the oldest continuous film awards held in South Korea.\n\nThis 58th ceremony was held at the New Millennium Hall, Konkuk University in Seoul on December 9th. Here are the winners:\n\nBest Film: Decision To Leave\n\nNominees:\n\nDecision to Leave\n\nHunt\n\nKingmaker\n\nHansan: Rising Dragon\n\nBroker\n\nBest Director: Byun Sung-hyun in Kingmaker\n\nNominees:\n\nPark Chan-wook in Decision to Leave\n\nByun Sung-hyun in Kingmaker\n\nKim Han-min in Hansan: Rising Dragon\n\nShin Su-won in Hommage\n\nHong Sang-soo in In Front of Your Face\n\nBest Actor: Park Hae-il in Decision To Leave\n\nNominees:\n\nPark Hae-il in Decision to Leave\n\nSol Kyung-gu in Kingmaker\n\nSong Kang-ho in Broker\n\nJung Woo-sung in Hunt\n\nLee Byung-hun in Emergency Declaration\n\nRyu Seung-ryong in Life Is Beautiful\n\nBest Actress: Yum Jung-ah in Life Is Beautiful\n\nNominees:\n\nTang Wei in Decision to Leave\n\nYum Jung-ah in Life Is Beautiful\n\nLee Hye-young in In Front of Your Face\n\nLee Jung-eun in Hommage\n\nPark So-dam in Special Delivery\n\nBest Supporting Actor: Byun Yo-han in Hansan: Rising Dragon\n\nNominees:\n\nPark Ji-hwan in The Roundup\n\nJo Woo-jin in Kingmaker\n\nByun Yo-han in Hansan: Rising Dragon\n\nSon Suk-ku in The Roundup\n\nYim Si-wan in Emergency Declaration\n\nKim Hee-won in Perhaps Love\n\nBest Supporting Actress: Im Yoonah in Confidential Assignment 2: International\n\nNominees:\n\nIm Yoonah in Confidential Assignment 2: International\n\nOh Na-ra in Perhaps Love\n\nJeon Hye-jin in Hunt\n\nKim Hyang-gi in Hansan: Rising Dragon\n\nGong Min-jeung in Nothing Serious\n\nBest New Actor: Mu Jin-sung in Perhaps Love\n\nNominees:\n\nMu Jin-sung in Perhaps Love\n\nKim Dong-hwi in In Our Prime\n\nTang Jun-sang in Hommage\n\nLee Hong-nae in Hot Blooded\n\nOng Seong-wu in Life Is Beautiful\n\nBest New Actress: Kim Hye-yoon in The Girl On A Bulldozer\n\nNominees:\n\nKim Hye-yoon in The Girl on a Bulldozer\n\nShin Si-ah in The Witch: Part 2. The Other One\n\nLee Ji-eun in Broker\n\nJo Yun-seo in In Our Prime\n\nPark Se-wan in 6/45\n\nGo Yoon-jung in Hunt\n\nBest New Director: Park Yi-woong in The Girl On A Bulldozer\n\nNominees:\n\nJo Eun-ji in Perhaps Love\n\nLee Sang-yong in The Roundup\n\nLee Jung-jae in Hunt\n\nNamkoong Sun in Ten Months\n\nLee Ran-hee in A Leave\n\nPark Yi-woong in The Girl on a Bulldozer\n\nBest Screenplay: Park Chan-wook & Jeong Seo-kyeong in Decision To Leave\n\nNominees:\n\nPark Chan-wook & Jeong Seo-kyeong in Decision to Leave\n\nLee Jung-jae & Jo Seung-Hee in Hunt\n\nKim Han-min & Yun Hong-gi in Hansan: Rising Dragon\n\nByun Sung-Hyun & Kim Min-soo in Kingmaker\n\nPark Gyu-tae in 6/45\n\nBest Cinematography: Ju Seong-rim in The Roundup\n\nNominees:\n\nKim Ji-yong in Decision to Leave\n\nLee Mo-gae in Hunt\n\nKim Tae-seong in Hansan: Rising Dragon\n\nLee Mo-gae & Park Jong-Chul in Emergency Declaration\n\nJu Seong-rim in The Roundup\n\nBest Film Editing: Kim Seon-min in The Roundup\n\nNominees:\n\nKim Sang-beom in Decision to Leave\n\nKim Sang-beom in Hunt\n\nLee Kang-hee & Ahn Hyun-gun im Hansan: Rising Dragon\n\nKim Woo-hyun & Lee Kang-il in Emergency Declaration\n\nKim Seon-min in The Roundup\n\nShin Min-kyung in Alien+Human Part 1\n\nBest Art Direction: Ryu Seong-hee & Lee Ha-jun in Alien+Human Part 1\n\nNominees:\n\nRyu Seong-hee in Decision to Leave\n\nPark Il-hyun in Hunt\n\nPark Gyu-bin in Hansan: Rising Dragon\n\nLee Mok-won in Emergency Declaration\n\nHan Ah-reumivn Kingmaker\n\nRyu Seong-hee & Lee Ha-jun in Alien+Human Part 1\n\nBest Lighting: Lee Seong-hwan in Hunt\n\nNominees:\n\nShin Sang-yeol in Decision to Leave\n\nLee Seong-hwan in Hunt\n\nKim Gyeong-seok in Hansan: Rising Dragon\n\nLee Seong-hwan in Emergency Declaration\n\nLee Gil-gyu in Kingmaker\n\nBest Costume Design: Kwon Yoo-jin in Hansan: Rising Dragon\n\nNominees:\n\nKwak Jeong-ae in Decision to Leave\n\nJo Sang-kyung & Choi Yun-seon in Hunt\n\nKwon Yoo-jin in Hansan: Rising Dragon\n\nKwon Yoo-jin & Lee Ae-ran in The Pirates: The Last Royal Treasure\n\nJo Sang-kyung in Alien+Human Part 1\n\nJo Hee-ran in Kingmaker\n\nChoi Se-yeon in Life Is Beautiful\n\nBest Music: Kim Joon-seok in Life Is Beautiful\n\nNominees:\n\nJo Yeong-wook in Decision to Leave\n\nKim Joon-seok in Life Is Beautiful\n\nJo Yeong-wook in Hunt\n\nLee Byung-woo & Jung Ji-hoon in Emergency Declaration\n\nJang Young-gyu in Alien+Human Part 1\n\nMowg in The Witch: Part 2. The Other One\n\nBest Visual Effects: Je Gal-seung in Alien+Human Part 1\n\nNominees:\n\nLee Seong-min in The Pirates: The Last Royal Treasure\n\nJung Seong-jin in Hansan: Rising Dragon\n\nHong Jung-ho in Emergency Declaration\n\nJe Gal-seung in Alien+Human Part 1\n\nJo Young-seok & Jang Min-jae inThe Witch: Part 2. The Other One\n\nDocumentary Award: Lee Il-ha in I Am More\n\nNominees:\n\nLee Hyung-rae & Kim Jung-young in Sewing Sisters\n\nOh Se-yeon in Fanatic\n\nKim Oh-an in The Man Who Paints Water Drops\n\nLee Il-ha in I Am More\n\nByun Gyu-ri in Coming to You\n\nDaejong’s Expected Award: Shin Su-won in Hommage\n\nNominees:\n\nLee Eun & Shin Jae-myung in Chun Tae-il\n\nAhn Jae-hoon in The Shaman Sorceress\n\nKim Su-jeong in Semantic Error: The Movie\n\nKim Dong-ryeong & Park Kyung-tae in The Pregnant Tree And The Goblin\n\nLee Ran-hee in A Leave\n\nShin Su-won in Hommage\n\nSeries Film Director Award: Lee Joo-young in Anna\n\nNew Wave Award\n\nOng Seong-wu in Life Is Beautiful\n\nPark Jae-chan in Semantic Error: The Movie\n\nPark Se-wan in 6/45\n\nJo Yun-seo in In Our Prime\n\nPeople’s Choice Award\n\nOh Na-ra in Perhaps Love\n\nPark Ji-hwan in The Roundup\n\nLifetime Achievement Award: Ahn Sung-ki\n\nCongratulations to all the winners!\n\nSource: Grand Bell Awards | Dispatch Korea\n\nAdvertisement"}, {"url": "https://www.sportskeeda.com/pop-culture/news-58th-grand-bell-awards-2022-complete-list-winners", "page_content": "Organized by the Motion Pictures Association of Korea, the 58th Grand Bell Awards, popularly known as the Daejong Film Awards, were held on December 9 at the Konkuk University New Miliennium Hall. The award ceremony was hosted by Kim Tae-hoon and Kang Na-yeon.\n\nOver 253 films that were released between October 1, 2021, and September 30, 2022, were considered for the award ceremony.\n\nThe films Decision to Leave and The Outlaws 2 each swept away three awards in different categories. Decision to Leave won awards for Best Film, Best Screenplay, and Best Actor. The Best Actor and Best Actress Award went to Park Hae ll and Yeom Jung-ah respectively, albeit for their performances in different movies.\n\nDecision to Leave, Life is Beautiful, and The Outlaws 2 emerged with highest wins in the 58th Grand Bell Awards\n\nThe prestigious 58th Grand Bell Awards were broadcast live on ENA, YouTube, and Twitter. Check out the list of winners below:\n\nBest Film: Decision to Leave\n\nBest Director: Byun Sung-hyun from Kingmaker\n\nBest Actress: Yeom Jung-ah from Life is Beautiful\n\nBest Actor: Park Hae ll from Decision to Leave\n\nBest Supporting Actress: Girls Generation YoonA from Confidential Assignment 2: International.\n\nBest Supporting Actor: Byun Yo-han from Hansan: Rising Dragon\n\nBest New Actor: Moo Jin-sung from Perhaps Love\n\nBest New Actress: Kim Hye-yoon from The Girl on a Bulldozer\n\nBest New Director: Park Yi-woong from The Girl on a Bulldozer\n\nAchievement Award: Ahn Sung-ki\n\nBest Screenplay: Park Chan-wook and Jung Seo-kyung from Decision to Leave\n\nNew Wave Award in the Actress Category: Park Se-wan from 6/45 and Jo Yoon-seo from In Our Prime\n\nNew Wave Award in Actor Category: Ong Seong-wu from Life is Beautiful and Park Jae-chan from Semantic Error: The Movie\n\nBest Music: Kim Joon-seok from Life is Beautiful\n\nBest Art Direction: Ryu Sung-hee and Lee Ha-joon from Alienoid\n\nBest Cinematography: Joo Sung-rim from The Outlaws 2\n\nBest Visual Effects: Je Gal-seung from Alienoid\n\nPeople’s Award in the Actress Category: Oh Na-ra from Perhaps Love\n\nPeople’s Award in Actor’s Category: Park Ji-hwan from The Outlaws 2\n\nBest Lighting: Lee Sung-hwan from Hunt\n\nBest Costumers: Kwon Yoo-jin and Im Seung-hee from Hansan: Rising Dragon\n\nBest Editing: Kim Seon-min from The Outlaws 2\n\nDocumentary Award: Director Lee ll-ha from I Am More\n\nSeries Film Director: Director Lee Joo-young from Anna-The Director’s Cut\n\nDaejong’s Expected Award: Director Shin Soo-won from Hommage\n\nThis year’s Lifetime Achievement Award was awarded to veteran actor Ahn Sung-ki for his valuable contribution to the industry. The actor, who was earlier reported to have been diagnosed with cancer, gave his acceptance speech via video and informed his fans that his health has improved significantly.\n\nFans are delighted as their favorite artists snag awards\n\nThe 58th Grand Bell Awards saw many artists being celebrated and recognized for their outstanding performances and contributions to the industry, including YoonA, Jae Chan, Park Hae ll, and many others. Fans were ecstatic and happy for their favorite idols and spoke of their achievements on Twitter.\n\nMystarmyangel @mystarmyangel\n\n\n\n#YoonA #윤아 #임윤아 221209 YoonA won the 58th Grand Bell Awards best supporting actress award with #ConfidentialAssignment2 221209 YoonA won the 58th Grand Bell Awards best supporting actress award with #ConfidentialAssignment2!👏👏👏#YoonA #윤아 #임윤아 https://t.co/Io2eNGe11I\n\nTouché by Tae Ri @taeri_yeosin\n\nBest Art Awards (Ryu Seong Hee, Lee Ha Jun)\n\nBest Visual Effect (Je Gal Seung) Congratulation for #Alienoid team victory at 58th Grand Bell Awards for winning :Best Art Awards (Ryu Seong Hee, Lee Ha Jun)Best Visual Effect (Je Gal Seung) Congratulation for #Alienoid team victory at 58th Grand Bell Awards for winning :Best Art Awards (Ryu Seong Hee, Lee Ha Jun) Best Visual Effect (Je Gal Seung) https://t.co/vPDEyOI7Uu\n\nOne emotional fan tweeted:\n\n“Actor Ong Seongwu as center with veteran & talented actors and actress at the 58th Grand Bell Awards.”\n\nAnother Kim Hye-yoon fan tweeted an interesting fact:\n\n“7 years ago hyeyoon was a new student at Konkuk University, and today she won best new actress award at the 58th grand bell awards on Konkuk university congratulations hyeyoon.”\n\ncha @tteokgalbis\n\n7 years ago hyeyoon was a new student on konkuk university and today she won best new actress award at the 58th grand bell awards on konkuk university 🥺 congratulations hyeyoon 7 years ago hyeyoon was a new student on konkuk university and today she won best new actress award at the 58th grand bell awards on konkuk university 🥺 congratulations hyeyoon 💕https://t.co/WwUxJNf43H\n\nThe Grand Bell Awards have been held every year since 1962 to recognize and honor deserving talents in the film industry. It is one of the most prestigious film awards in South Korea.\n\nPoll : 0 votes"}, {"url": "https://www.soompi.com/article/1557938wpp/winners-of-the-58th-grand-bell-awards", "page_content": "The winners of the 58th Grand Bell Awards have been announced!\n\nThe Grand Bell Awards, also known as the Daejong Film Awards, is organized by The Motion Pictures Association of Korea. On December 9, the 58th annual ceremony was held at the Konkuk University New Millennium Hall with Kim Tae Hoon and Kang Na Yeon serving as MCs. This year’s event considered 253 films that were released between October 1, 2021 and September 31, 2022.\n\n“Decision to Leave” and “The Outlaws 2” (“The Roundup”) each took home three awards, with the former project winning Best Film, Best Actor, and Best Screenplay. Although unable to attend the event due to filming in Los Angeles, “Decision to Leave” director Park Chan Wook shared, “This feels like receiving a big present at the end of the year.”\n\nHe continued, “Since this is the first Grand Bell awards for the first time in awhile after returning to normalcy, this is an honor and will remain as an unforgettable, precious memory. More than anyone, I’m reminded of the faces of actors Park Hae Il and Tang Wei, and I miss all the other actors and staff members [of ‘Decision to Leave’]. I want to spend this honor with them and once I return home after safely finishing this project, I’ll create a space where we can all meet together. Thank you to the judges and the many people who have loved ‘Decision to Leave.'”\n\nThis year’s Lifetime Achievement Award was given to Ahn Sung Ki, who revealed earlier this year that he was battling cancer. The actor gave his acceptance speech through a video and personally shared that his health has improved greatly.\n\nCheck out the full list of winners below!\n\nBest Film: “Decision to Leave”\n\nBest Director: Byun Sung Hyun (“Kingmaker”)\n\nBest Actress: Yum Jung Ah (“Life is Beautiful”)\n\nBest Actor: Park Hae Il (“Decision to Leave”)\n\nBest Supporting Actress: Girls’ Generation’s YoonA (“Confidential Assignment 2: International”)\n\nBest Supporting Actor: Byun Yo Han (“Hansan: Rising Dragon”)\n\nBest New Actress: Kim Hye Yoon (“The Girl on a Bulldozer”)\n\nBest New Actor: Moo Jin Sung (“Perhaps Love”)\n\nBest New Director: Park Yi Woong (“The Girl on a Bulldozer”)\n\nAchievement Award: Ahn Sung Ki\n\nBest Screenplay: Park Chan Wook, Jung Seo Kyung (“Decision to Leave”)\n\nNew Wave Award (Actress): Park Se Wan (“6/45”), Jo Yoon Seo (“In Our Prime”)\n\nNew Wave Award (Actor): Ong Seong Wu (“Life is Beautiful”), Park Jae Chan (“Semantic Error: The Movie”)\n\nBest Music: Kim Joon Seok (“Life is Beautiful”)\n\nBest Art Direction: Ryu Sung Hee, Lee Ha Joon (“Alienoid”)\n\nBest Cinematography: Joo Sung Rim (“The Outlaws 2”)\n\nBest Visual Effects: Je Gal Seung (“Alienoid”)\n\nPeople’s Award (Actress): Oh Na Ra (“Perhaps Love”)\n\nPeople’s Award (Actor): Park Ji Hwan (“The Outlaws 2”)\n\nBest Lighting: Lee Sung Hwan (“Hunt”)\n\nBest Costumes: Kwon Yoo Jin, Im Seung Hee (“Hansan: Rising Dragon”)\n\nBest Editing: Kim Sun Min (“The Outlaws 2”)\n\nDocumentary Award: Director Lee Il Ha (“I Am More”)\n\nSeries Film Director: Director Lee Joo Young (“Anna – Director’s Cut”)\n\nDaejong’s Expected Award: Director Shin Soo Won (“Hommage”)\n\nCongratulations to all the winners!\n\nStart watching “Semantic Error: The Movie” below!\n\nWatch Now\n\nSource (1)"}, {"url": "https://www.kpoppost.com/58th-grand-bell-awards-winners/", "page_content": "One of the prestigious awards for filmmakers and films in South Korea, the annual Grand Bell Awards or Daejong International Film Awards, has announced the 58th Grand Bell Awards winners in 2022. Find the complete list below.\n\nThe 58th Grand Bell Awards Winners in 2022\n\n58th Grand Bell Awards 2022.\n\nOn December 9, the Motion Pictures Association of Korea held the 58th Grand Bell Awards or Daejong International Film Awards for excellence in the film industry in South Korea. This year’s Grand Bell Awards took place at New Millennium Hall, Konkuk University, Seoul, and hosted by Kang Na Yeon and Kim Tae Hoon.\n\nThe nominations were films that were released started from October 1, 2021, to September 31, 2022. Meanwhile, the nominees were announced on October 12, 2022.\n\nThe Lifetime Achievement Award was given to veteran actor Ahn Sung Ki this year. Meanwhile, Park Chan Wook’s “Decision to Leave” took home the event’s major awards for the Best Film award, Best Actor, and Best Screenplay.\n\nThe 58th Grand Bell Awards Nominees and Winners\n\nHere are the 58th Grand Bell Awards nominees and winners:\n\nLifetime Achievement Award\n\nAward Winner: Ahn Sung Ki\n\nBest Film\n\nAward Winner: “Decision to Leave”\n\nNominees:\n\n“Broker”\n\n“Decision to Leave”\n\n“Hansan: Rising Dragon”\n\n“Hunt”\n\n“Kingmaker”\n\nBest Director\n\nAward Winner: Byun Sung Hyun (“Kingmaker”)\n\nNominees:\n\nByun Sung Hyun (“Kingmaker”)\n\nKim Han Min (“Hansan: Rising Dragon”)\n\nHong Sang Soo (“In Front of Your Face”)\n\nPark Chan Wook (“Decision to Leave”)\n\nShin Su Won (“Hommage”)\n\nBest Actor\n\nAward Winner: Park Hae Il (“Decision to Leave”)\n\nNominees:\n\nJung Woo Sung (“Hunt” as Kim Jung Do)\n\nLee Byung Hun (“Emergency Declaration” as Park Jae Hyuk)\n\nSol Kyung Gu (“Kingmaker” as Kim Woon Beom)\n\nSong Kang Ho (“Broker” as Sang Hyeon”)\n\nRyu Seung Ryong (“Life Is Beautiful” as Kang Jin Bong)\n\nPark Hae Il (“Decision to Leave” as Hae)\n\nBest Actress\n\nAward Winner: Yum Jung Ah (“Life is Beautiful” as Oh Se Yeon)\n\nNominees:\n\nLee Hye Young (“In Front of Your Face” as Sang Ok)\n\nLee Jung Eun (“Hommage” as Ji Wan)\n\nPark So Dam (“Special Delivery” as Eun Ha)\n\nTang Wei (“Decision to Leave” as Seo Rae)\n\nYum Jung Ah (“Life Is Beautiful” as Oh Se Yeon)\n\nBest Supporting Actor\n\nAward Winner: Byun Yo Han (“Hansan: Rising Dragon”)\n\nNominees:\n\nByun Yo Han (“Hansan: Rising Dragon” as Wakisaka)\n\nJo Woo-jin (“Kingmaker” as Director Lee)\n\nIm Si Wan (“Emergency Declaration” as Ryu Jin Seok)\n\nKim Hee Won (“Perhaps Love” as Soon Mo)\n\nPark Ji Hwan (“The Roundup” as Jang I Soo)\n\nSon Suk Ku (“The Roundup” as Kang Hae Sang)\n\nBest Supporting Actress\n\nAward Winner: Im Yoon Ah (“Confidential Assignment 2: International” as Park Min Young)\n\nNominees:\n\nGong Min Jeung (“Nothing Serious” as Seon Bin)\n\nIm Yoon Ah (“Confidential Assignment 2: International” as Park Min Young)\n\nJeon Hye Jin (“Hunt” as Bang Joo Kyung)\n\nKim Hyang Gi (“Hansan: Rising Dragon” as Jeong Bo Reum)\n\nLim Ji Yeon (“Spiritwalker” as Moon Jin Ah)\n\nOh Na Ra (“Perhaps Love” as Mi Ae)\n\nBest New Actor\n\nAward Winner: Moo Jin Sung (“Perhaps Love”)\n\nNominees:\n\nMu Jin Sung (“Perhaps Love” as Yoo Jin)\n\nKim Dong Hwi (“In Our Prime” as Han Ji Woo)\n\nTang Jun Sang (“Hommage” as Ji Wan’s Son)\n\nLee Hong Nae (“Hot Blooded” as Ah Mi)\n\nOng Seong Wu (“Life Is Beautiful” as Jung Woo)\n\nBest New Actress\n\nAward Winner: Kim Hye Yoon (“The Girl on a Bulldozer”)\n\nNominees:\n\nGo Yoon Jung (“Hunt” as Jo Yoo Jeong)\n\nJo Yun Seo (“In Our Prime” as Park Bo Ram)\n\nKim Hye Yoon (“The Girl on a Bulldozer” as Goo Hye-young)\n\nLee Ji Eun (“Broker” as So Young)\n\nPark Se Wan (“6/45” as Ri Yeon Hee)\n\nShin Si Ah (“The Witch: Part 2. The Other One” as “Ark1 Datum point”)\n\nBest New Director\n\nAward Winner: Park Yi Woong (“The Girl on a Bulldozer”)\n\nNominees:\n\nJo Eun Ji (“Perhaps Love”)\n\nLee Jung-jae (“Hunt”)\n\nLee Sang Yong (“The Roundup”)\n\nLee Ran-hee (“A Leave”)\n\nPark Yi Woong (“The Girl on a Bulldozer”)\n\nNamkoong Sun (“Ten Months”)\n\nBest Screenplay\n\nAward Winner: Park Chan Wook, Jung Seo Kyung (“Decision to Leave”)\n\nNominees:\n\nByun Sung Hyun, Kim Min Soo (“Kingmaker”)\n\nKim Han Min, Yun Hong Gi (“Hansan: Rising Dragon”)\n\nLee Jung Jae, Jo Seung Hee (“Hunt”)\n\nPark Chan Wook, Jeong Seo Kyeong (“Decision to Leave”)\n\nPark Gyu Tae (“6/45”)\n\nBest Music\n\nAward Winner: Kim Joon Seok (“Life is Beautiful”)\n\nNominees:\n\nJang Young Gyu (“Alienoid – Alien + Human Part 1”)\n\nJo Yeong-wook (“Decision to Leave”)\n\nJo Yeong-wook (“Hunt”)\n\nKim Joon-seok (“Life Is Beautiful”)\n\nLee Byung-woo, Jung Ji-hoon (“Emergency Declaration”)\n\nMowg (“The Witch: Part 2. The Other One”)\n\nBest Art Direction\n\nAward Winner: Ryu Sung Hee, Lee Ha Joon (“Alienoid – Alien + Human Part 1”)\n\nNominees:\n\nRyu Seong Hee, Lee Ha Jun (“Alienoid – Alien + Human Part 1”)\n\nRyu Seong Hee (“Decision to Leave”)\n\nPark Il hyun (“Hunt”)\n\nPark Gyu Bin (“Hansan: Rising Dragon”)\n\nLee Mok Won (“Emergency Declaration”)\n\nHan Ah Reum (“Kingmaker”)\n\nBest Cinematography\n\nAward Winner: Ju Sung Rim (“The Roundup”)\n\nNominees:\n\nJu Sung Rim (“The Roundup”)\n\nKim Ji Yong (“Decision to Leave”)\n\nKim Tae Seong (“Hansan: Rising Dragon”)\n\nLee Mo Gae (“Hunt”)\n\nLee Mo Gae, Park Jong Chul (“Emergency Declaration”)\n\nBest Visual Effects\n\nAward Winner: Je Gal Seung (“Alienoid – Alien + Human Part 1”)\n\nNominees:\n\nJe Gal Seung (“Alienoid – Alien + Human Part 1”)\n\nJung Seong Jin (“Hansan: Rising Dragon”)\n\nJo Young Seok, Jang Min Jae (“The Witch: Part 2. The Other One”)\n\nLee Seong Min (“The Pirates: The Last Royal Treasure”)\n\nHong Jung Ho (“Emergency Declaration”)\n\nPeople’s Award\n\nAward Winner:\n\nActress Oh Na Ra (“Perhaps Love”)\n\nActor Park Ji Hwan (“The Roundup”)\n\nNew Wave Award\n\nAward Winner (Actress):\n\nPark Se Wan (“6/45”)\n\nJo Yoon Seo (“In Our Prime”)\n\nAward Winner (Actor):\n\nOng Seong Wu (“Life is Beautiful”)\n\nPark Jae Chan (“Semantic Error: The Movie”)\n\nBest Lighting\n\nAward Winner: Lee Sung Hwan (“Hunt”)\n\nNominees:\n\nLee Gil Gyu (“Kingmaker”)\n\nLee Sung Hwan (“Hunt”)\n\nLee Sung Hwan (“Emergency Declaration”)\n\nKim Gyeong Seok (“Hansan: Rising Dragon”)\n\nShin Sang Yeol (“Decision to Leave”)\n\nBest Costumes\n\nAward Winner: Kwon Yoo Jin, Im Seung Hee (“Hansan: Rising Dragon”)\n\nNominees:\n\nJo Sang-kyung – (“Alienoid – Alien + Human Part 1”)\n\nJo Hee Ran (“Kingmaker”)\n\nJo Sang Kyung, Choi Yun Seon (“Hunt”)\n\nKwon Yoo Jin, Lim Seung Hee (“Hansan: Rising Dragon”)\n\nKwak Jeong Ae (“Decision to Leave”)\n\nKwon Yoo-jin, Lee Ae Ran (“The Pirates: The Last Royal Treasure”)\n\nChoi Se Yeon (“Life Is Beautiful”)\n\nBest Editing\n\nAward Winner: Kim Sun Min (“The Roundup”)\n\nNominees:\n\nKim Sun Min (“The Roundup”)\n\nKim Sang Beom (“Decision to Leave”)\n\nKim Sang Beom (“Hunt”)\n\nKim Woo-hyun, Lee Kang Il (“Emergency Declaration”)\n\nLee Kang-hee, Ahn Hyun Gun (“Hansan: Rising Dragon”)\n\nShin Min Kyung (“Alienoid – Alien + Human Part 1”)\n\nDocumentary Award\n\nAward Winner: Lee Il Ha (“I Am More”)\n\nNominees:\n\nLee Il Ha (“I Am More”)\n\nLee Hyung Rae, Kim Jung Young (“Sewing Sisters”)\n\nOh Se Yeon (“Fanatic”)\n\nKim Oh An (“The Man Who Paints Water Drops”)\n\nByun Gyu Ri (“ Coming to You”)\n\nSeries Film Director\n\nAward Winner: Director Lee Joo Young (“Anna” – Director’s Cut)\n\nDaejong’s Expected Award\n\nAward Winner: Director Shin Su Won (“Hommage”)\n\nNominees:\n\nShin Su Won (“Hommage”)\n\nLee Eun, Shin Jae Myung (“Chun Tae Il”)\n\nAhn Jae Hoon (“The Shaman Sorceress”)\n\nKim Su Jeong (“Semantic Error: The Movie”)\n\nKim Dong Ryeong, Park Kyung Tae (“The Pregnant Tree And The Goblin”)\n\nLee Ran Hee (“A Leave”)\n\nCongratulations to all the winners!\n\nFollow Kpoppost on Instagram, Twitter, Telegram Channel, and Facebook for Korean entertainment news!\n\nSee more winners in Korean film awards this year:\n\nSource: 1, 2"}, {"url": "https://www.soompi.com/article/1404451wpp/winners-of-56th-grand-bell-awards", "page_content": "The 56th Grand Bell Awards celebrated the year’s best in film!\n\nThe ceremony (also known as the Daejong Film Awards) is organized by The Motion Pictures Association of Korea. This year’s event was planned for February but was initially postponed due to the COVID-19 pandemic.\n\nThe 56th Grand Bell Awards were held on June 3 at the Grand Walkerhill Seoul hotel, with Lee Hwi Jae and Han Hye Jin acting as MCs. Due to precautions surrounding COVID-19, the event was held without an audience.\n\nThe international sensation “Parasite” grabbed five awards at the ceremony, including Best Film, Best Director, and Best Supporting Actress for Lee Jung Eun. The Best Actor and Best Actress awards went to Lee Byung Hun and Jung Yu Mi.\n\nCheck out the full list of winners below!\n\nBest Film: “Parasite”\n\nBest Director: Bong Joon Ho (“Parasite”)\n\nBest Actor: Lee Byung Hun (“Ashfall”)\n\nBest Actress: Jung Yu Mi (“Kim Ji Young: Born 1982”)\n\nBest Supporting Actor: Jin Seon Kyu (“Extreme Job”)\n\nBest Supporting Actress: Lee Jung Eun (“Parasite”)\n\nBest New Actor: Jung Hae In (“Tune In for Love”)\n\nBest New Actress: Jeon Yeo Bin (“After My Death”)\n\nBest New Director: Kim Bo Ra (“House of Hummingbird”)\n\nBest Planning: Kim Mi Hye, Mo Sung Jin (“Extreme Job”)\n\nBest Screenplay: Han Jin Won, Bong Joon Ho (“Parasite”)\n\nBest Cinematography: Kim Young Ho (“The Battle: Roar to Victory”)\n\nBest Lighting: Jeon Young Suk (“Svaha: The Sixth Finger”)\n\nTechnical Award: Jin Jong Hyun (Visual effects, “Ashfall”)\n\nBest Editing: Lee Kang Hee (“Exit”)\n\nBest Music: Jung Jae Il (“Parasite”)\n\nBest Costumes: Lee Jin Hee (“The Great Battle”)\n\nBest Art Direction: Seo Seong Kyeong (“Svaha: The Sixth Finger”)\n\nAchievement Award: Shin Young Kyun\n\nCongratulations to all the winners!\n\nSource (1)"}, {"url": "https://www.koreaboo.com/lists/winners-56th-grand-bell-awards/", "page_content": "On June 3, the 56th Grand Bell Awards (Daejong Film Awards) was held at Grand Walkerhill Seoul Hotel with hosts Han Hye Jin and Lee Hwi Jae.\n\nThis ceremony is hosted by The Motion Pictures Association of Korea and was held without an audience due to the COVID-19 pandemic.\n\nMany talented celebrities showed up to the red carpet to celebrate and support the winners for this ceremony.\n\nGlobal sensation “Parasite” once again proved its popularity by taking home five awards.\n\nThe Best Actor and Best Actress Awards were given to Lee Byung Hun and Jung Yu Mi.\n\nBest Film: “Parasite”\n\nBest Director: Bong Joon Ho (“Parasite”)\n\nBest Actor: Lee Byung Hun (“Ashfall”)\n\n\n\nBest Actress: Jung Yu Mi (“Kim Ji Young: Born 1982”)\n\n\n\nBest Supporting Actor: Jin Seon Kyu (“Extreme Job”)\n\nBest Supporting Actress: Lee Jung Eun (“Parasite”)\n\n\n\nBest New Actor: Jung Hae In (“Tune In for Love”)\n\n\n\nBest New Actress: Jeon Yeo Bin (“After My Death”)\n\nBest New Director: Kim Bo Ra (“House of Hummingbird”)\n\n\n\nBest Planning: Kim Mi Hye, Mo Sung Jin (“Extreme Job”)\n\nBest Screenplay: Han Jin Won, Bong Joon Ho (“Parasite”)\n\nBest Cinematography: Kim Young Ho (“The Battle: Roar to Victory”)\n\nBest Lighting: Jeon Young Suk (“Svaha: The Sixth Finger”)\n\nTechnical Award: Jin Jong Hyun (Visual effects, “Ashfall”)\n\nBest Editing: Lee Kang Hee (“Exit”)\n\nBest Music: Jung Jae Il (“Parasite”)\n\nBest Costumes: Lee Jin Hee (“The Great Battle”)\n\nBest Art Direction: Seo Seong Kyeong (“Svaha: The Sixth Finger”)\n\nAchievement Award: Shin Young Kyun\n\nSpecial music performances were also held this night by Park Bom, Ock Joo Hyun, Paul Kim, 3YE and more.\n\nTake a look at the celebrities on the red carpet below! Congrats to all the winners!"}, {"url": "https://www.koreaboo.com/news/winners-list-58th-grand-bell-awards/", "page_content": "Some took home multiple wins.\n\nThe 58th Grand Bell Awards (also known as Daejong International Film Awards) was held in Seoul on December 9, 2022. Here are all the winners!\n\nBest Film\n\nDecision to Leave\n\nBest Director\n\nByun Sung Hyun for Kingmaker\n\nBest Actor\n\nPark Hae Il as Hae Jun in Decision to Leave\n\nBest Actress\n\nYum Jung Ah, who played Oh Se Yeon in Life Is Beautiful\n\nBest Supporting Actor\n\nByun Yo Han as Wakisaka in Hansan: Rising Dragon\n\nBest Supporting Actress\n\nGirls’ Generation’s Yoona (also known as Im Yoon Ah) as Park Min Young in Confidential Assignment 2: International\n\nBest New Actor\n\nMu Jin Sung as Yoo Jin in Perhaps Love\n\nBest New Actress\n\nKim Hye Yoon in The Girl on a Bulldozer as Goo Hye Young\n\nBest New Director\n\nPark Yi Woong for The Girl on a Bulldozer\n\nNew Wave Award\n\nDKZ‘s Jaechan (also known as Park Jae Chan) for Semantic Error: The Movie\n\nOng Seong Wu for Life Is Beautiful\n\nPark Se Wan for 6/45\n\nJo Yun Seo for In Our Prime\n\nPeople’s Choice Award\n\nOh Na Ra for Perhaps Love\n\nPark Ji Hwan for The Roundup\n\nLifetime Achievement Award\n\nAhn Sung Ki\n\nPark Chan Wook and Jeong Seo Kyeong won “Best Screenplay” for Decision to Leave. “Best Cinematography” was awarded to Ju Seong Rim for The Roundup, “Best Film Editing” went to Kim Seon Min for The Roundup, and “Best Art Direction” went to Ryu Seong Hee and Lee Ha Jun for Alien+Human Part 1. Lee Seong Hwan won “Best Lighting” for Hunt, while Kwon Yoo Jin and Lim Seung Hee took home “Best Costume Design” for Hansan: Rising Dragon.\n\nKim Joon Seok won “Best Music” for Life Is Beautiful, Je Gal Seung won “Best Visual Effects” for Alien+Human Part 1, and the “Documentary Award” went to Lee Il Ha for I Am More.\n\n“Daejong’s Expected Award” went to Shin Su Won for Hommage, and “Series Film Director Award” was awarded to Lee Joo Young for Anna.\n\nFor more, check out these stunning looks from the red carpet."}, {"url": "https://www.soompi.com/article/789715wpp/none-of-9-best-actor-and-actress-nominees-for-grand-bell-awards-to-attend-ceremony", "page_content": "This year’s Grand Bell Awards, which celebrates the best of the best in Korean film, will unfortunately not be attended by any of the nominees in two of its most major categories.\n\nAll the Best Actor nominees have had to decline their invitation to the ceremony. The list of this year’s nominees includes Yoo Ah In with his two nominations for “Veteran” and “Sado” (also known as “The Throne”), Ha Jung Woo for “Assassination,” Hwang Jung Min for “Ode to My Father,” and Son Hyun Joo for “The Chronicles of Evil.”\n\nIt’s been reported that Yoo Ah In is unable to attend due to his shooting schedule for the SBS drama “Six Flying Dragons.” Ha Jung Woo won’t be able to be there because he is currently overseas, Hwang Jung Min can’t take part because of conflicts with his schedule, and Son Hyun Joo’s reps have stated he won’t be attending either.\n\nAccording to Newsen, all five nominees for Best Actress will also not be attending the ceremony. The nominees are Kim Yoon Jin for “Ode to My Father,” Jun Ji Hyun for “Assassination,” Kim Hye Soo for “Coin Locker Girl,” Uhm Jung Hwa for “Wonderful Nightmare” (also known as “Miss Wife”), and Han Hyo Joo for “The Beauty Inside.”\n\nJun Ji Hyun will not be at the ceremony because she is currently not attending any events while she is on pregnancy leave. Kim Yoon Jin won’t be able to participate as she is in the United States filming the fourth season of the show “Mistresses,” while Kim Hye Soo, Uhm Jung Hwa, and Han Hyo Joo all have scheduling conflicts.\n\nOne source points out to Newsen, “Although award ceremonies look on the outside as though they are held for just a short time over a few hours on one day, actresses require a long process of preparation in order to participate.”\n\nThis is a particularly difficult situation for the Grand Bell Awards, as they previously announced that they will not give awards to any winners who do not attend the ceremony. Now, in light of the fact that their Best Actor and Actress nominees won’t be able to participate, they have stated that they will discuss the matter again. However, as of the day before the awards show, there has been no official statement made about how they will deal with this situation.\n\nWhat do you think the Grand Bell Awards should do?\n\nSource (1) (2)"}, {"url": "https://www.allkpop.com/article/2021/02/the-winners-from-the-41st-blue-dragon-awards-2020", "page_content": "On February 9th, the winners of the '41st Blue Dragon Awards 2020' were announced at the award event at was held at the Incheon Yeongjong Paradise City. The award show was originally scheduled to be held on December 11, 2020, but was postponed by two months due to the pandemic.\n\nThe nominees for this year's Best Picture were 'Moving On,' 'The Man Standing Next,' 'Voice of Silence,' 'Moonlit Winter,' and 'Kim Ji-Young: Born 1982.'\n\n\n\nThe nominees for the Director's Category included director Yang Woo Suk of 'Steel Rain 2: Summit,' director Woo Min Ho of 'The Man Standing Next,' director Lim Dae Hyung of 'Moonlit Winter,' and director Hong Won Chan of 'Deliver Us from Evil.'\n\n\n\nActors Jung Woo Sung, Lee Jung Jae, Yoo Ah In, Lee Byung Hun, and Hwang Jung Min were nominated for the Best Actor Award. The Best Actress nominees included actress Kim Hee Ae, Ra Mi Ran, Shin Min Ah, Jeon Do Yeon, and Jung Yoo Mi.\n\n\n\nThe nominees for the Male Rookie of the Year Awards were Woo Do Hwan, Yoo Tae Oh, Lee Bong Geun, Lee Hak Ju, and Hong Kyung, while actresses Kang Mal Geum, Kim So Hye, Shin Hyun Bin, Shin Hye Sun, and Lee Joo Young were named as nominees for Female Rookie of the Year Award.\n\n\n\nThe '41st Blue Dragon Awards 2020' was broadcast through SBS and Naver TV, including the red carpet event and the main awards event.\n\n\n\n\n\nBelow is the list of winners of the 41st Blue Dragon Film Awards:\n\n\n\n▶Best Picture Award = 'The Man Standing Next'\n\n\n\n▶ Director's Award = Lim Dae Hyung ('Moonlit Winter')\n\n\n\n▶ Best Actor = Yoo Ah In ('Voice of Silence')\n\n\n\n▶ Best Actress = Ra Mi Ran ('Honest Candidate')\n\n\n\n▶ Best Supporting Actor = Park Jung Min ( 'Deliver Us from Evil')\n\n\n\n▶ Best Supporting Actress = Lee Som ('Samjin Company English Class')\n\n\n\n▶ Rookie Director Award = Hong Ui Jeong ('Voice of Silence')\n\n\n\n▶ Male Rookie of the Year = Yoo Tae Oh ('Vertigo')\n\n\n\n▶ Female Rookie of the Year = Kang Mal Geum ('Lucky Chan-Sil')\n\n\n\n▶ Original Screenplay Award = Lim Dae Hyung ('Moonlit Winter')\n\n\n\n▶ Chung Hae-Won Popular Star Award = Yoo Ah In, Jung Yoo Mi\n\n\n\n▶ Chung Hae-Won Short Film Awards = Na Yeon, Cho Min Jae ('The Thread')"}, {"url": "https://www.soompi.com/article/792485wpp/winners-of-the-36th-blue-dragon-film-awards", "page_content": "The 36th Blue Dragon Film Awards took place on November 26 at the Grand Peace Palace in Seoul Kyung Hee University. It was emceed by actors Kim Hye Soo and Yoo Joon Sang.\n\nThe Best Picture Award went to the movie “Assassination.” Yoo Ah In took the Best Actor Award with his role in “Sado” and Best Actress Award went to Lee Jung Hyun for her role in “Alice in Earnestland” (also known as “Alice in Faithful Land”). The movie “Sado” received the most number of awards of the evening with Yoo Ah In (Best Actor), Jun Hye Jin (Best Supporting Actress), Best Cinematography, and Best Original Score.\n\n“Assassination” took three awards for Best Picture, Best Costume Design, and Best Technical Achievement. “Ode to My Father” also took three awards for Best Supporting Actor (Oh Dal Soo), Most Viewed Award, and Best Art Direction.\n\nActor Choi Woo Shik of “Set Me Free” took the Best New Actor Award and actress Lee Yoo Young took home the Best New Actress Award for “The Treacherous.” Choi Woo Shik grabbed much attention by winning the award alongside the director of “Set Me Free” Kim Tae Yong who was awarded Best New Director Award. Lee Yoo Young also gained much attention since she won the New Actress Award at the Grand Bell Awards for her work in “Late Spring.”\n\nThe Best Supporting Actor Award went to Oh Dal Soo of “Ode to My Father.” He commented, “My legs are shaking so much. I need some help. I’ve never received such a great award before.” Actress Jun Hye Jin won the Best Supporting Actress for her role in “Sado.” She cracked everyone up when she said, “Honey (actor Lee Sun Gyun), I’ll be home late.”\n\nThe Best Actor Award went to Yoo Ah In who showed humility saying, “I’m more embarrassed than happy.” He displayed great camaraderie when he shared an embrace with Song Kang Ho whom he worked with in “Sado.”\n\nThe Best Actress Award went to Lee Jung Hyun for her work in “Alice in Ernestland.” This is her first time receiving an award in 19 years since her work in “A Petal.” She teared up saying, “I’m so thankful. I didn’t expect this at all since the movie was a small production.”\n\nOther notable awards went to Park Seo Joon, Park Bo Young, Lee Min Ho, and AOA’s Seolhyun for Most Popular Star Award.\n\nThe Blue Dragon Film Awards came into existence in 1963 for the purpose of contributing to the movie industry by enhancing quality of Korean films.\n\nHere is the complete list of award recipients of the night:\n\nBest Picture: “Assassination” (Caper Films)\n\nBest Director: Ryu Seung Wan (“Veteran”)\n\nBest Actor: Yoo Ah In (“Sado”)\n\nBest Actress: Lee Jung Hyun (“Alice in Earnestland”)\n\nBest Supporting Actor: Oh Dal Soo (“Ode to My Father”)\n\nBest Supporting Actress: Jeon Hye Jin (“Sado”)\n\nBest New Actor: Choi Woo Shik (“Set Me Free”)\n\nBest New Actress: Lee You Young (“The Treacherous”)\n\nBest New Director: Kim Tae Yong (“Set Me Free”)\n\nMost Viewed Movie: “Ode to My Father”\n\nBest Cinematography: Kim Tae Kyung, Hong Seung Chul (“Sado”)\n\nBest Original Score: Bang Joon Suk (“Sado”)\n\nBest Costume Design: Jo Sang Kyung, Son Na Ri (“Assassination”)\n\nBest Art Direction: Ryu Sung Hee (“Ode to My Father”)\n\nBest Technical Achievement: Jo Sang Kyung, Son Na Ri (“Assassination”)\n\nBest Screenplay: Kim Sung Jae, Son Ah Ram (“The Unfair”)\n\nBest Film Editing: Yang Jin Mo (“Beauty Inside”)\n\nMost Popular Stars: Lee Min Ho, Park Bo Young, Park Seo Joon, Seolhyun\n\nBest Short Film: Yoo Jae Hyun (“Chool Sa”)\n\nCheck out the clip of Yoo Ah In receiving the Best Actor Award.\n\nSource (1) (2) (3)"}]}