{"Ha Jung-woo also won Best Actor at the Asian Film Awards for The Yellow Sea.": [{"url": "https://koreajoongangdaily.joins.com/news/article/article.aspx?aid=2986613", "page_content": "\n\n\n\nHa Jung-woo wins in Osaka\n\nHa Jung-woo’s debut film, “Fasten Your Seatbelt” (2013), won an award for the most promising talent at the ninth Osaka Asian Film Festival.Ha is more famous for his acting, but he wrote and directed “Fasten Your Seatbelt,” the story of a Korean pop star, played by Jung Kyung-ho, who faces an imminent plane crash when a terrible storm wells up on a trans-Pacific flight full of unusual characters.The film won much critical acclaim when it premiered at the 18th Busan International Film Festival last October, and then made 1.9 billion won ($1.8 million) in theaters when it was released in November.The 36-year-old Ha is reportedly working on his next project as a director and an actor, “Chronicle of a Blood Merchant.” Actress Ha Ji-won is rumored to be joining the cast, too.At the Osaka festival, the Best Picture award went to the 2013 film “Shift,” by Filipino director Siege Ledesma.By Kim Hee-eun, contributing writer"}, {"url": "https://www.koreanfilm.or.kr/eng/news/news.jsp?seq=2964&mode=VIEW", "page_content": "FASTEN YOUR SEATBELT Awarded in Japan\n\nThe Osaka Asian Film Festival concluded its 8th edition over the weekend. Three Korean films were screened at the festival, with one of them returning with an award. HA Jung-woo received the Most Promising Talent Award for his directorial debut Fasten Your Seatbelt. Osaka’s top prize this year went to the Filipino film Shift from Siege LEDESMA. The other Korean films in Osaka in 2014 were the romantic comedy Sunshine Love and the gangster sequel Friend: The Great Legacy.\n\nFasten Your Seatbelt, a mile high comedy about a film star’s rocky flight back to Korea, is the feature debut of HA Jung-woo, one of Korea’s top stars, who has appeared in The Yellow Sea (2010) and The Berlin File among others. The film debuted at the Busan International Film Festival last October and went on domestic release shortly thereafter.\n\nHA, who will next be seen in YOON Jong-bin’s period action film Kundo: Age of the Rampant, will soon begin production on his sophomore directing project Chronicle of a Blood Merchant. HA will also star in the film, which is based on a Chinese novel by YU Hua, along with co-star HA Ji-won."}, {"url": "https://wiki.d-addicts.com/Ha_Jung_Woo", "page_content": "Please enable JavaScript to pass antispam protection!\n\nHere are the instructions how to enable JavaScript in your web browser http://www.enable-javascript.com.\n\nAntispam by CleanTalk."}, {"url": "https://www.hancinema.net/ha-jung-woo-and-tang-wei-win-the-best-actor-and-actress-35206.html", "page_content": "Published on 2011/11/11 | Source\n\nActor Ha Jung-woo and Tang Wei are being awarded the Best Actor and Actress at the Yeong Pyeong Awards chosen by movie critics.\n\nAdvertisement\n\nThe Yeong Pyeong Awards hosted by the Korean Film Reviewer Association, was held on the 11th at the Press Center International Confernece Hall in Seoul.\n\nThis year, \"The Front Line\" has been awarded for The Best Film, The Best Director and The Best Rookie Actor.\n\nHa Jung-woo from \"The Yellow Sea\" is being awarded the Best Actor and Tang Wei from \"Late Autumn - 2010\" is being awarded the Best Actress. Chung Chang-hwa from \"The Deadly Five Fingers\" is being awarded the Contribution Award for having added to the development of the Korean movie industry.\n\nIn addition, \"Leafie, A Hen Into The Wild\" producer Sim Jae-myeong and chairman of Myeong Films is being awarded the Special Award. The Korean Film Reviewer Association has chosen the top 10 Korean movies this year in an open conference judging.\n\nThe Yeong Pyeong Awards categorizes into Best Product, Contribution, Acting (4 Parts), Filming, Music, Technique and International Reviewers' Union, Rookies and more of 15 total categories. The event will be hosted by Ahn Sung-ki and Kang Yoo-jeong.\n\nAwards\n\n▲Best Picture Award : '\"The Front Line\"'\n\n▲Award for contribution to the Korean movie industry.: director Chung Chang-hwa\n\n▲Best Director Award : Jang Hoon (\"The Front Line\")\n\n▲Best Actor Award : Ha Jung-woo (\"The Yellow Sea\")\n\n▲Best Actress Award : Tang Wei (\"Late Autumn - 2010\")\n\n▲Best Writer Award : Park Sang-yeon (\"The Front Line\")\n\n▲Best Cinematography Award : Kim Tae-sung-I, Park Jong-chul (\"Arrow, The Ultimate Weapon\")\n\n▲Best Technology Award : Han Yeong-woo (\"Arrow, The Ultimate Weapon\", Visual effects)\n\n▲Best Music Award : Jo Seong-woo, Choi Yong-lak (\"Late Autumn - 2010\")\n\n▲Best Rookie Director Award : Park Jung-bum (\"The Journals of Musan\")\n\n▲Best Rookie Actor Award : Lee Je-hoon (\"The Front Line\")\n\n▲Best Rookie Actress Award : Yoo Da-in (\"Re-encounter\")\n\n▲Special Award : Shim Jae-myung, Myung Film representative (\"Leafie, A Hen Into The Wild\")\n\n▲International Film Critics Award : \"Poongsan\"\n\n▲Best Rookie Critic Award : Yoon Seong-eun"}, {"url": "https://peoplepill.com/people/ha-jung-woo/", "page_content": "Ha Jung-woo (born Kim Sung-hoon on March 11, 1978) is a South Korean actor and film director. Ha studied theater at Chung-Ang University, and after several years of minor and supporting parts, he was cast in his first starring role in the low-budget indie The Unforgiven (2005), directed by his friend Yoon Jong-bin. This was followed by Kim Ki-duk's Time (2006), and Never Forever (2007) with Vera Farmiga. But his breakthrough role to stardom was in Na Hong-jin's serial killer film The Chaser (2008). Known to attract both critical acclaim and commercial success, Ha quickly became the most in-demand leading actor of his generation in Korean cinema, showcasing his versatility in road movie My Dear Enemy (2008), sports film Take Off (2009), crime drama The Yellow Sea (2010), gangster saga Nameless Gangster: Rules of the Time (2012), romantic comedy Love Fiction (2012), spy thriller The Berlin File (2013), and action thriller The Terror Live (2013). He made his directorial debut through the comedy film Fasten Your Seatbelt (2013), followed by Chronicle of a Blood Merchant (2015).\n\nEarly life\n\nBorn as Kim Sung-hoon, Ha Jung-woo came from an acting family. His father Kim Yong-gun is a well-known veteran actor who has appeared in many movies and television series, while his younger brother Kim Young-hoon (stage name: Cha Hyun-woo) is an aspiring actor. Ha has said that since he was 4 or 5 years old, he has always dreamed of becoming an actor like his father. Before entering college, Ha studied at a private acting institute and at one point had actor Lee Beom-soo as his instructor. He then enrolled at Chung-Ang University as a theater major, where he acted on the stage.\n\nIn 1998, Ha began his military service, working in the Armed Forces Public Relations Department. He put his acting experience to good use during this time, appearing in 10 promotional films for the military.\n\nCareer\n\nHa made his acting debut in the 2002 SBS sitcom Honest Living and his feature film debut in the 2003 film Madeleine. For the next few years, Ha's acting career was relatively low-key, appearing in several supporting roles, but not receiving a lot of attention. Things started to change in 2005. He signed with talent agency SidusHQ and on their recommendation adopted the stage name \"Ha Jung-woo.\" Ha would also appear in his first starring role in the indie film The Unforgiven - a blistering critique of the physical and psychological violence within military ranks. He then appeared in controversial arthouse director Kim Ki-duk's Time and Breath, which brought more notice to his acting talents in Korea and overseas. During this time, his portrayal of a cool-headed prosecutor who is romantically involved with a feisty police officer played by Go Hyun-jung in the popular MBC drama series H.I.T attracted more female fans. He also starred in the American indie film Never Forever opposite Vera Farmiga, which garnered praise from the film festival circuit.\n\nHa's breakout came in the 2008 film The Chaser, in which he played a character loosely based on serial killer Yoo Young-chul. The movie became a huge hit at the Korean box office, raking in over 5 million ticket sales, while also garnering high praise from critics and numerous awards from local award-giving bodies. Ha's portrayal of a psychopath, coupled with his performance as a charming scoundrel in My Dear Enemy that same year, showcased his versatility and elevated his status as one of the most sought-after actors in the Korean film industry. Since The Chaser, Ha has worked virtually non-stop for the next several years, taking on diverse but compelling roles in The Moonlight of Seoul, Boat, and Take Off. Take Off, based on the Korean national ski jumping team, became one of the biggest box office hits of 2009.\n\nAmerican director Martin Scorsese, rumored to be attached to a Hollywood remake of The Chaser, has complimented Ha as having as much potential as his The Departed stars Leonardo DiCaprio and Matt Damon.\n\nHa reunited with his The Chaser director Na Hong-jin and costar Kim Yoon-seok in Na's sophomore feature The Yellow Sea, which netted Ha Best Actor trophies from the Asian Film Awards, Baeksang Arts Awards and the Korean Association of Film Critics.\n\nHa said the legal thriller The Client evoked his early days of theater, and the director praised Ha for his \"moments of true brilliance and genius\" during the production.\n\nIn early 2012, Samsung Electronics produced an ambitious PPL-frequent-film project featuring Galaxy Note, their latest Tablet hybrid mobile. Titled as Cine Note, the giant project comprises three shorts by directors Kang Hyeong-cheol, Jang Hoon and E J-yong. Ha played the leading role for all the three of the films, while celebrated musician Lee Seung-chul produced music using the device, and noted webtoon artists Son Jae-ho and Lee Gwang-soo created the film’s animated content.\n\nNameless Gangster: Rules of the Time was Ha's third collaboration with longtime friend director Yoon Jong-bin, also starring acclaimed veteran actor Choi Min-sik. This was followed shortly by the unconventional romantic comedy Love Fiction opposite Gong Hyo-jin. Both were box office hits.\n\nAfter wrapping Love Fiction, Ha along with Gong and 14 other actors went on a cross-country walking trip from Seoul to Haenam, South Jeolla Province. Their journey was chronicled in the documentary 577 Project, denoting the total distance covered in kilometers. Ha was in charge of three aspects of the production including planning, acting and casting. He said he did it to thank fans for their support after he won back-to-back Best Actor awards at the 2010 and 2011 Baeksang Arts Awards.\n\nIn Ryoo Seung-wan's The Berlin File, Ha starred as a North Korean agent in Berlin who is betrayed and cut loose in the midst of a financial espionage intrigue. Together with his wife (a translator at the embassy played by Jun Ji-hyun), they try to escape being purged, with Ryoo Seung-bum and Han Suk-kyu playing North and South Korean operatives on their trail.\n\nHe appeared in 90% of the action thriller The Terror Live, playing a news anchor with an exclusive, live broadcast on a terrorist attack.\n\nHa then made his directorial debut with Rollercoaster (released internationally as Fasten Your Seatbelt), based on his own screenplay about the comic interactions between the cabin crew and passengers (including an arrogant Hallyu star played by Jung Kyung-ho) of a flight from Tokyo to Gimpo International Airport which becomes in danger of crashing when the plane hits a major storm.\n\nWorking with Yoon Jong-bin again, Ha played a Joseon era butcher-turned-outlaw in the period action film Kundo: Age of the Rampant.\n\nIn 2015, Ha directed, wrote and starred in Chronicle of a Blood Merchant, a film adaptation of Chinese author Yu Hua's 1995 novel. He then appeared in one of the biggest domestic hits of the year, Choi Dong-hoon's Assassination about resistance fighters given orders to kill a Japanese army commander in the colonial era.\n\nHa has been cast in several upcoming films: a biopic on Andre Kim, Korea's first male fashion designer (Ha previously worked with director Son Young-sung on The Client); Park Chan-wook's The Handmaiden, an adaptation of the Sarah Waters novel Fingersmith also set during 1930s Korea; and Kim Yong-hwa's With God, an adaptation of the same-titled webtoon about a court in the afterlife where the deceased undergo multiple trials for 49 days (Kim also directed Take Off).\n\nOther activities\n\nHa Jung-woo is also an artist. Though it began as a hobby in his university days, Ha began painting in earnest in 2007. His paintings, all done in a hybrid of Pop art and Expressionist styles, have been displayed in several solo art exhibitions. Critics have said his paintings, with their strong colors and interesting composition are reminiscent of those by American artist Jean-Michel Basquiat. \"Life as an actor is like living through an invisible war. Paintings soothe me and make me rational. It is too extravagant to say that painting is my hobby; it is rather a way for me to survive as an actor,\" said Ha.\n\nIn 2011 he published a compilation of essays titled Ha Jung-woo, Good Feeling. Besides his musings on life, Ha also wrote his thoughts on famous artists such as Pablo Picasso. The book also included about 60 of his own drawings.\n\nPersonal life\n\nHa dated fashion model Gu Eun-ae from August 2008 to January 2012.\n\nFilmography\n\nFilm\n\nAs actor\n\nYear Korean Title English Title Role Production Company 2003 마들렌 Madeleine Joon-ho Cinema Service 2004 슈퍼스타 감사용 Superstar Mr. Gam Kim Yoo-weol CJ Entertainment 2005 잠복근무 She's on Duty Detective Jo Showbox 용서받지 못한 자 The Unforgiven Yoo Tae-jeong Chungeorahm 2006 시간 Time Ji-woo Happinet Pictures Korea 구미호 가족 The Fox Family Son fox MK Pictures 2007 두번째 사랑 Never Forever Kim Ji-ha Prime Entertainment\n\nArts Alliance 숨 Breath Yeon's husband Sponge Entertainment 2008 우리 생애 최고의 순간 Forever the Moment Blind date man Sidus FNH 추격자 The Chaser Je Yeong-min Showbox 비스티 보이즈 Beastie Boys Jae-hyun Lotte Entertainment 울학교 이티 Our School's E.T. Handsome doctor SK Telecom 멋진 하루 My Dear Enemy Jo Byung-woon Lotte Entertainment 2009 잘 알지도 못하면서 Like You Know It All Sculptor / Cheon-soo's neighbor Sponge Entertainment 보트 Boat Hyung-gu 국가대표 Take Off Cha Heon-tae / Bob Showbox 2010 평행이론 Parallel Life Jang Soo-young CJ Entertainment 황해 The Yellow Sea Gu-nam Showbox 2011 사랑한다, 사랑하지 않는다 Come Rain, Come Shine Other man Next Entertainment World 의뢰인 The Client Kang Sung-hee Showbox 2012 범죄와의 전쟁 Nameless Gangster: Rules of the Time Choi Hyung-bae 러브 픽션 Love Fiction Goo Joo-wol / Detective Ma Dong-wook Next Entertainment World 577 프로젝트 577 Project Himself Filament Pictures 2013 뒷담화: 감독이 미쳤어요 Behind the Camera Himself 베를린 The Berlin File Pyo Jong-seong CJ Entertainment 더 테러 라이브 The Terror Live Yoon Young-hwa Lotte Entertainment 2014 군도: 민란의 시대 Kundo: Age of the Rampant Dolmuchi / Dolchi Showbox 2015 허삼관 Chronicle of a Blood Merchant Heo Sam-gwan Next Entertainment World 암살 Assassination Hawaii Pistol Showbox 2016 아가씨 The Handmaiden Count Fuijiwara CJ Entertainment 터널 The Tunnel Jung-soo Showbox 2017 신과 함께 With God - Part 1 Gang-rim Lotte Entertainment 1987 1987 CJ Entertainment 앙드레 김 Andre Kim André Kim 베를린 2 The Berlin File 2 Pyo Jong-seong CJ Entertainment\n\nAs director/screenwriter\n\nChronicle of a Blood Merchant (2015)\n\n(2015) Fasten Your Seatbelt (2013)\n\nTelevision series\n\nYear Korean Title English Title Role Network Notes 2002 똑바로 살아라 Honest Living Ha Jung-woo SBS 2003-2004 무인시대 Age of Warriors Lee Ji-gwang KBS 2005 프라하의 연인 Lovers in Prague Ahn Dong-nam SBS 2007 히트 H.I.T Kim Jae-yoon MBC 2016 안투라지 Entourage Himself (ep.1) tvN cameo\n\nMusic video\n\n\"Betrayal\" (Big Mama, 2007)\n\nTheater\n\nOthello (2003)\n\n(2003) Waiting for Godot (2002)\n\n(2002) The Glass Menagerie (2002)\n\n(2002) The Good Doctor (2001)\n\n(2001) Carmen (2001)\n\n(2001) Be Strong, Geum-soon! (2000)\n\nDiscography\n\n\"Alaska\" (Romantic Chimpanzee feat. Ha Jung-woo - Love Fiction OST, 2012)\n\nBook\n\nHa Jung-woo, Good Feeling (essays, 2011)\n\nAwards and nominations"}, {"url": "https://www.rottentomatoes.com/celebrity/ha_jeong_u_2", "page_content": "Highest Rated: 100% Tunnel (2016)\n\nLowest Rated: 43% The Berlin File (2013)\n\nBirthday: Mar 11, 1978\n\nBirthplace: Seoul, South Korea\n\nHa Jung-woo was an actor who had a successful Hollywood career. Jung-woo began his acting career with roles in such films as \"The Unforgiven\" (2005), \"Gumiho Gajok\" (2006) and \"Breath\" (2007). He also appeared in \"Time\" (2007), \"Forever the Moment\" (2008) with Moon So-ri and the David L McInnis drama \"Never Forever\" (2008). His film career continued throughout the early 2000s in productions like \"The Moonlight of Seoul\" (2008), \"Ulhakgyo ET\" (2008) and \"You Don't Even Know\" (2009). He also appeared in \"Boat\" (2009). Film continued to be his passion as he played roles in \"The Yellow Sea\" (2011), \"Nameless Gangster: Rules Of The Time\" (2012) and \"Love Fiction\" (2012). He also appeared in \"577 Project\" (2012) and \"The Berlin File\" (2013). Most recently, Jung-woo acted in \"Heosamgwan Maehyeolgi\" (2015)."}, {"url": "https://www.soompi.com/article/1270675wpp/winners-2018-asia-artist-awards", "page_content": "The 2018 Asia Artist Awards recognized some of the biggest stars in Korea’s entertainment industry!\n\nThe ceremony was held on the evening of November 28 in Seoul, with awards honoring the work of both actors and musicians in the past year.\n\nThe Daesangs (grand prizes) of the night went to BTS and Lee Byung Hun. BTS won five awards in total, while Lee Byung Hun and IU both took home four trophies.\n\nCheck out the full list of winners below!\n\nMusic Category\n\nStarPay Popularity Award: BTS\n\nFocus Award: D-CRUNCH, W24\n\nRising Star: fromis_9, SF9\n\nNew Wave Award: KARD, WJSN (Cosmic Girls), gugudan\n\nFavorite Award: Chungha\n\nHistory of Songs Award: Se7en\n\nKorean Tourism Appreciation Award: BTS\n\nBest Performance Director: Son Sung Deuk\n\nBest Producer: Pdogg\n\nChoice Award: SNUPER\n\nAsia Hot-tist Award: Wanna One\n\nFabulous Award: BTS, TWICE\n\nArtist of the Year: Zico, Wanna One, iKON, TWICE, SEVENTEEN, MONSTA X, MAMAMOO, GOT7, NU’EST W, Sunmi, BTS\n\nRookie Award: IZ*ONE, Stray Kids, (G)I-DLE, The Boyz\n\nBest Icon: MONSTA X, MOMOLAND\n\nAsia Brilliant Award: AOA\n\nBest Music: NU’EST W, MAMAMOO, Sunmi\n\nBest Popular: GOT7\n\nBest Musician: Zico, iKON\n\nBest Artist: TWICE, Wanna One, SEVENTEEN\n\nDaesang: BTS\n\nActing Category\n\nStarPay Popularity Award: IU, EXO’s Sehun\n\nFocus Award: Kim Yong Ji, Jin Joo Hyung, Shin Hyun Soo\n\nRising Star Award: ASTRO’s Cha Eun Woo, Jung In Sun\n\nNew Wave Award: AOA’s Seolhyun\n\nFavorite Award: Sung Hoon\n\nBest Creator: Won Dong Yeon\n\nChoice Award: Jasper Liu, Kwak Si Yang, B1A4’s Jinyoung\n\nAsia Hot-tist Award: IU\n\nKorean Tourism Appreciation Award: Lee Byung Hun\n\nAsia Eco Creator: Park Hae Jin\n\nFabulous Award: Lee Byung Hun, Ha Jung Woo\n\nArtist of the Year: Lee Sung Kyung, 2PM’s Junho, Ryu Jun Yeol, Jung Hae In, IU, Lee Seung Gi, Joo Ji Hoon, Yoo Yeon Seok, Ha Jung Woo, Lee Byung Hun\n\nRookie Award: Kim Da Mi, Jang Ki Yong\n\nBest Icon: Choi Tae Joon, INFINITE’s L\n\nAsia Brilliant Award: SHINee’s Minho, Lee Da Hee\n\nAsia Trend: Jung Hae In, YoonA\n\nAsia Celebrity: Suzy\n\nBest Emotive: Jung Hae In, Junho, Lee Sung Kyung\n\nBest Popular: Ryu Jun Yeol, Lee Seung Gi\n\nBest Actor: Joo Ji Hoon, Yoo Yeon Seok, IU\n\nBest Artist: Ha Jung Woo\n\nDaesang: Lee Byung Hun\n\nCongratulations to all the winners!\n\nSource (1) (2)\n\nUpdate: This article has been edited to correct the name of the Asia Trend award."}, {"url": "https://www.imdb.com/filmosearch/?sort=year&role=nm1978402", "page_content": "120 min | Comedy\n\n6.0 Rate this 1 2 3 4 5 6 7 8 9 10 6 / 10 X\n\nFor years Seong-gun has been an under-performing gym teacher. Reorganization at the school puts his job in jeopardy. He vows to get a learning permit in English, despite not knowing the language at all.\n\nDirector: K.C. Park | Stars: Sung-Hyun Baek, Park Bo-young, Kim Byeong-Ok, Moon Chae-Won\n\nVotes: 180"}, {"url": "https://wiki.d-addicts.com/Ha_Jung_Woo", "page_content": "Please enable JavaScript to pass antispam protection!\n\nHere are the instructions how to enable JavaScript in your web browser http://www.enable-javascript.com.\n\nAntispam by CleanTalk."}, {"url": "https://www.rottentomatoes.com/celebrity/ha_jeong_u_2", "page_content": "Highest Rated: 100% Tunnel (2016)\n\nLowest Rated: 43% The Berlin File (2013)\n\nBirthday: Mar 11, 1978\n\nBirthplace: Seoul, South Korea\n\nHa Jung-woo was an actor who had a successful Hollywood career. Jung-woo began his acting career with roles in such films as \"The Unforgiven\" (2005), \"Gumiho Gajok\" (2006) and \"Breath\" (2007). He also appeared in \"Time\" (2007), \"Forever the Moment\" (2008) with Moon So-ri and the David L McInnis drama \"Never Forever\" (2008). His film career continued throughout the early 2000s in productions like \"The Moonlight of Seoul\" (2008), \"Ulhakgyo ET\" (2008) and \"You Don't Even Know\" (2009). He also appeared in \"Boat\" (2009). Film continued to be his passion as he played roles in \"The Yellow Sea\" (2011), \"Nameless Gangster: Rules Of The Time\" (2012) and \"Love Fiction\" (2012). He also appeared in \"577 Project\" (2012) and \"The Berlin File\" (2013). Most recently, Jung-woo acted in \"Heosamgwan Maehyeolgi\" (2015)."}]}