{"Charles Lee was born on October 28, 1975.": [{"url": "https://www.battlefields.org/learn/biographies/charles-lee", "page_content": "At the outbreak of the American Revolution, Charles Lee resigned his post in the British Royal Army to join the colonists in their patriotic cause. To Lee’s chagrin, George Washington surpassed the British born officer as Congress’s choice for Commander of the Continental Army. Although Lee was widely recognized for his adroit military capabilities, after only a few years into the war, his reputation would be tarnished entirely.\n\nCharles Lee was born on January 26, 1731 in Cheshire, England. As a boy, he was enrolled in military school and later served in the French and Indian War as a Lieutenant. While in America, Lee married a Mohawk woman and was subsequently adopted into the Mohawk tribe. Due to Lee’s erratic temperament, the Native Americans referred to him as “Boiling Water.”\n\nIn 1773, Lee returned to the colonies to establish a more permanent residence in Virginia. When hostilities between Britain and the American colonies erupted in 1775, all hope for reconciliation was extinguished and the two sides plunged into war. As second in command of the Continental Army, Lee was appointed head of the Southern Department. His resentment for Washington as Commander-in-Chief, however, would continue to surface throughout the war.\n\nThe Major General garnered substantial praise and admiration for his defense of Charleston in 1776. Though the victory was largely accomplished by the judgement of others, Lee was credited with the win and dubbed a hero. In the following months, Lee joined Washington in New York where the “hero of Charleston” began badmouthing his superior in written correspondences. Longing for Washington’s job and exploiting the colonists’ recent defeats in New York, Lee penned a Congressman, “Had I the powers, I could do you much good.” The Major’s efforts to undermine General Washington were disrupted when in December of 1776 he was captured by the British. As second in command, Lee was a notable prize for the enemy and his release would only come in 1778 after a British loss at Saratoga.\n\nIn May of 1778, Lee had returned to the Continental Army in time for the Battle of Monmouth. The decisive battle took place on June 28 as the Patriots pursued the British into New Jersey. Lee was ordered to lead the troops into battle and what followed proved disastrous for the general. As the British began to flank Lee’s men, the commander prematurely issued a retreat. Witnessing this, Washington confronted Lee on the battlefield and the two commanders exchanged heated words. Charged with disobeying orders and insubordination, Lee was relieved of his command and court-martialed. Congress decided to remove Lee for one year during which the ex-general proceeded to speak out against Washington.\n\nIndeed, Lee’s sharp tongue created new enemies determined to defend Washington’s honor. In 1778, John Laurens challenged Lee to a duel and shot him in the side, wounding but not killing the officer. In 1780, Lee formally resigned from the Continental Army and retired to Philadelphia. It was there that Lee died in 1782."}, {"url": "https://mybirthday.ninja/?m=October&d=28&y=1975&go=Go", "page_content": "Your Birthday Gift: Click the free ninja poster above to save the high quality version. Everyday you visit this page a new design will be generated. Feel free to use it on your social media accounts or give it to someone who will appreciate knowing what their birthday means. It’s a simple gift to give. Bookmark this page for future reference or share this page.\n\nOctober 28, 1975 Birthday Facts\n\nHere are some snazzy birthday facts about 28 th of October 1975 that no one tells you about. Don’t wait a minute longer and jump in using the content links below. Average read time of 11 minutes. Enjoy!\n\nWhat day was my birthday Oct 28, 1975?\n\nOctober 28, 1975 was a Tuesday and it was the 301 st day of the year 1975. It was the 43 rd Tuesday of that year. The next time you can reuse your old 1975 calendar will be in 2025. Both calendars will be exactly the same! This is assuming you are not interested in the dates for Easter and other irregular holidays that are based on a lunisolar calendar.\n\nWhat day is October 28 this year?\n\nThe day of the week of your birthday this year is Saturday. Next year it will be Monday and two years from now it will be Tuesday. You can check the calendars below if you’re planning what to do on your birthday.\n\nOctober 2023 Sun Mon Tue Wed Thu Fri Sat 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31\n\nOctober 2024 Sun Mon Tue Wed Thu Fri Sat 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31\n\nOctober 2025 Sun Mon Tue Wed Thu Fri Sat 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31\n\nHow many days until my next birthday?\n\nThere are 141 days left before your next birthday. You will be 48 years old when that day comes. There have been 17,391 days from the day you were born up to today. If you’ve been sleeping 8 hours daily since birth, then you have slept a total of 5,797 days or 15.87 years. You spent 33% of your life sleeping. Since night and day always follow each other, there were precisely 589 full moons after you were born up to this day. How many of them did you see? The next full moon that you can see will be on July 3 at 11:39:00 GMT – Monday.\n\nFun stat: Your first one billion seconds (1,000,000,000) happened sometime on July 6, 2007.\n\nHow old are you in dog years?\n\nIf a dog named Robot - a Pointer breed, was born on the same date as you then it will be 231 dog years old today. A dog’s first human year is equal to 15 dog years. Dogs age differently depending on breed and size. When you reach the age of 6 Robot will be 42 dog years old. From that point forward a medium-sized dog like Robot will age 4.5 dog years for every human year.\n\nWanna share this info in social media? Make sure to take a screenshot first. Dog name and breed are randomly generated. Try reloading this page to see a new pet name and a different breed.\n\nHey! How’s your lovelife today? Get a free love reading with the most frank answers. Start to seize love opportunities in your life! Try it today and improve your lovelife. Did I mention it’s F-R-E-E? (Sponsored link; 18+ only)\n\nWhich celebrity shares my birthday?\n\nYou might be happy to know that the following celebrities share your birthday. The list was randomly chosen and arranged in chronological order.\n\n1913 Douglas Seale\n\n1940 Susan Harris\n\n1953 Desmond Child\n\n1958 William Reid\n\n1970 Greg Eagles\n\n1977 Lauren Woodland\n\n1979 Natina Reed\n\n1982 Matt Smith\n\n1988 Nanao\n\n1997 Eden Taylor-Draper\n\nView the complete list of October 28 celebrity birthdays.\n\nHey! How’s your lovelife today? Just for fun! Try your love match score with anyone. Even officemates, schoolmates, or find out the score for your parents and relatives. Don’t limit yourself – you can also pair yourself with any celebrity. It’s a FREE report. Nothing to buy!\n\nWho are the famous October 28 birthdays?\n\nHere’s a short list of famous people in history who were born on Oct 28.\n\n1881 Bruno Söderström, Swedish pole vaulter (d. 1969)\n\n1917 Jack Soo, American actor and singer (d. 1979)\n\n1922 Butch van Breda Kolff, American basketball player and coach (d. 2007)\n\n1935 Alan Clarke, English director and screenwriter (d. 1990)\n\n1938 David Dimbleby, English journalist\n\n1939 Jane Alexander, American actress and producer\n\n1942 Abdelkader Fréha, Algerian footballer (d. 2012)\n\n1955 Ronnie Bass, American football player and sportscaster\n\n1982 Hironori Saruta, Japanese footballer\n\n1997 Sierra McCormick, American actress\n\nView the complete list of October 28 famous birthdays.\n\nWhat no one tells you about your first name’s personality. Are there magical powers hidden in your given name? Every moniker has an undeniable character and personality. Check out Laverne’s personality and get smart about names today. (Sponsored links)\n\nWhat happened on my birthday – Oct 28 th ?\n\nThese were the events that made history that coincide with your birthday.\n\n456 The Visigoths brutally sack the Suebi’s capital of Braga (Portugal), and the town’s churches are burnt to the ground.\n\n969 Byzantine general Michael Bourtzes seizes one of Antioch’s main wall towers, which he defends against repeated attacks for three days until the reinforcements led by the stratopedarches Peter arrive and secure the city for the Byzantines.\n\n1492 Christopher Columbus discovered Cuba on his first voyage to the New World.\n\n1775 American Revolutionary War: A British proclamation forbids residents from leaving Boston.\n\n1776 American Revolutionary War: Battle of White Plains: British Army forces arrive at White Plains, attack and capture Chatterton Hill from the Americans.\n\n1864 American Civil War: The Battle of Fair Oaks & Darbytown Road (also known as the Second Battle of Fair Oaks) ends: Union forces under General Ulysses S. Grant withdraw from Fair Oaks, Virginia, after failing to breach the Confederate defenses around Richmond, Virginia.\n\n1918 A new Polish government in Western Galicia is established.\n\n1949 An Air France Lockheed Constellation crashes in the Azores killing all people on board, including the French former middleweight world champion boxer Marcel Cerdan and French violinist Ginette Neveu\n\n1971 Britain launches the satellite Prospero into low Earth orbit atop a Black Arrow carrier rocket from Launch Area 5B at Woomera, South Australia, the only British satellite to date launched by a British rocket.\n\n1990 The Georgian Soviet Socialist Republic holds the first multiparty legislature election in the country’s history.\n\nView the complete list of October 28 historical events.\n\nCurious about this Earthly Delight? This is a party item you can activate and send to your friends when you play the free game Jump Birthday Party. It’s a fun and easy-to-play mobile game for all ages. Get free 1,000 gold coins when you download today!\n\nWhat does my birthday October 28, 1975 mean?\n\nYour birthday numbers 10, 28, and 1975 reveal that your Life Path number is 6. It represents justice, nurturing and responsibility. You possess great compassion and seek to be of service to others.\n\nThe following celebrities also have the same life path number: Swoosie Kurtz, Buddy Williams, Hwangbo, D'banj, Mika Nakashima, Corneille, George Nader, Anthony Q. Farrell, Nihal Yalçın, Hirini Melbourne.\n\nWhat is the birthday horoscope for Oct 28, 1975?\n\nThe Western zodiac or sun sign of a person born on October 28 is Scorpio ♏ (The Scorpion) – a fixed sign with Water as Western element. The ruling planet is Pluto – the planet of transformation. According to the ancient art of Chinese astrology (or Eastern zodiac), Rabbit is the mythical animal and Wood is the Eastern element of a person born on October 28, 1975.\n\nWhat is the birthstone for October 28?\n\nOpal is the modern birthstone for the month of October while Jasper is the mystical birth stone (based on Tibetan origin). The zodiac gemstone for Scorpio is beryl. Lastly, the birthday stone for the day of the week ‘Tuesday’ is ruby.\n\nFun fact: The birth flower for 28 th October 1975 is Cosmos for constancy.\n\nWhat is the Birthday Compatibility for Oct 28, 1975?\n\nWhen it comes to love and relationship, you are most compatible with a person born on August 10, 1948. You have a Birthday Compatibility score of +139. Imagine being in love with your soul mate. On the negative side, you are most incompatible with a person born on January 25, 1989. Your score is -163. You’ll be like a cat and a dog on a love-hate relationship. Arf-arf, I want to bite you. Meow-meow, stay away from me!\n\nOct 28 th Birthday Wish\n\nDid someone send you this link? Here’s a birthday wish just for you! Don’t forget to thank the kind soul who sent you this ninja page.\n\nTIP: Click the image above if you want to save the high quality version for posting to social media like Facebook, Twitter, or Pinterest. You can also get a new random wish if you want to (the page will reload).\n\nWhat is a good birthday trivia for October 28?\n\nIn a room of 23 people there’s a 50% chance of two individuals having the same birthday (month and day only and not a leap year). The chance increases to 99.9% if there are 70 people in the room. You need at least 253 people in the room if you want someone to have the same birthday as you with 50% probability. This is called the birthday paradox or birthday problem. Try it out on your classroom, office, or sports team and confirm how many people share the same birthday.\n\nFun stat: The world population in the year of your birth is 4,089,083,233. (U.S. Census Bureau)\n\nWhat was the number one song on my birthday?\n\nThe number-one hit song in the U.S. at the day of your birth was Island Girl by Elton John as compiled by Billboard Hot 100 (November 1, 1975). Ask your parents if they know this popular song.\n\nIsland Girl\n\nElton John\n\nRock of the Westies\n\nWhat were you in your past life?\n\nI do not know how you feel about this, but you were a female ♀ in your last earthly incarnation. You were born somewhere around the territory of Sumatra approximately on 375. Your profession was artist, magician, fortune teller.\n\nYour brief psychological profile in that past life: Natural talent of psychologist, you knew how to use the opportunities. Cold-blooded and calm in any situation.\n\nLessons that your last past life brought to present: The timid, lonely and self-confident people are everywhere, and your problem – to overcome these tendencies in yourself and then to help other people.\n\nCan you remember who you were?\n\nHow many babies were born on October 28, 1975?\n\nBase on the data published by the United Nations Population Division, an estimated 121,558,022 babies were born throughout the world in the year 1975. The estimated number of babies born on 28 th October 1975 is 333,036. That’s equivalent to 231 babies every minute. Try to imagine if all of them are crying at the same time.\n\nWhat is the popular baby name on 28 Oct 1975?\n\nIn the United States, the most popular baby name is Jennifer. This name was given to 58,185 baby girls. For the boys it’s Michael. This name was recorded 68,454 times in the year 1975. Any chance you are Jennifer or Michael? (Source: ssa.gov)\n\nNews headline for Florida Man October 28\n\nWhat’s your bizarre Florida Man story? The #FloridaManChallenge is breaking the Internet and social media. Some crazy men, women, or creatures from the Sunshine State are making headlines every day of the year including your birthday. Try this fun exercise. Pick your search engine of choice and type in “florida man October 28” and see what kind of wild news headline you will get. This viral craze started in 2013 and gets resurrected now and then. The latest was from Tumblr and found its way to Twitter. As they say, the rest is history.\n\nRoman Numerals for October 28, 1975\n\nYour birthday in Roman numerals using DD.MM.YYYY notation is:\n\nXXVIII.X.MCMLXXV\n\nOctober 28, 1975 Birthday Facts Summary\n\nHere’s a quick list of all the fun birthday facts about October 28, 1975. Celebrities, famous birthdays, historical events, and past life were excluded.\n\nDay index: 301 st day of 1975\n\n301 day of 1975 Day of week: Tuesday\n\nTuesday Day of week birthstone: Ruby\n\nRuby Week index: 43 rd Tuesday of 1975\n\n43 Tuesday of 1975 Next same calendar year: 2025\n\n2025 Day of week this year: Saturday\n\nSaturday Day of week next year: Monday\n\nMonday Day of week in 2025: Tuesday\n\nTuesday Days until next birthday: 141 days\n\n141 days Age on next birthday: 48 years old\n\n48 years old Days since birth: 17,391 days\n\n17,391 days Days spent sleeping: 5,797 days\n\n5,797 days Years spent sleeping: 15.87 years\n\n15.87 years Part of life spent sleeping: 33%\n\n33% Full moons since birth: 589\n\n589 Next full moon: July 3 at 11:39:00 GMT – Monday\n\nJuly 3 at 11:39:00 GMT – Monday First one billion seconds: Sometime on July 6, 2007\n\nSometime on July 6, 2007 Age in dog years: 231 dog years old using a Pointer breed\n\n231 dog years old using a Pointer breed Life path number and meaning: 6 – It represents justice, nurturing and responsibility. You possess great compassion and seek to be of service to others.\n\n6 – It represents justice, nurturing and responsibility. You possess great compassion and seek to be of service to others. Western zodiac sign: Scorpio ♏ (The Scorpion)\n\nScorpio (The Scorpion) Western zodiac element: Water\n\nWater Western zodiac sign quality: Fixed\n\nFixed Western zodiac ruling planet: Pluto – the planet of transformation\n\nPluto – the planet of transformation Western zodiac gemstone: Beryl\n\nBeryl Eastern zodiac animal: Rabbit\n\nRabbit Eastern zodiac element: Wood\n\nWood Modern birthstone: Opal\n\nOpal Mystical birthstone: Jasper (based on Tibetan origin)\n\nJasper (based on Tibetan origin) Birth flower: Cosmos for constancy\n\nCosmos for constancy Best compatible birthday: August 10, 1948 (+139)\n\nAugust 10, 1948 (+139) Worst compatible birthday: January 25, 1989 (-163)\n\nJanuary 25, 1989 (-163) 1975 world population: 4,089,083,233\n\n4,089,083,233 Number one song: Island Girl by Elton John (November 1, 1975)\n\nIsland Girl by Elton John (November 1, 1975) Babies born in 1975: 121,558,022\n\n121,558,022 Babies born in 1975 every day: 333,036\n\n333,036 Babies born in 1975 every minute: 231\n\n231 Popular girl’s name: Jennifer – 58,185 babies\n\nJennifer – 58,185 babies Popular boy’s name: Michael – 68,454 babies\n\nMichael – 68,454 babies Roman numerals: XXVIII.X.MCMLXXV\n\nTry another birth date of someone you know or try the birthday of these celebrities: April 12, 1966 – Nils-Olav Johansen, Norwegian guitarist and singer (Farmers Market); July 17, 1958 – Wong Kar-wai, Chinese director, producer, and screenwriter; October 28, 1987 – Frank Ocean, American singer-songwriter (Odd Future).\n\nDon’t forget to share the info with your friends, loved ones, or social media followers. Who knows, they might appreciate and thank you for it.\n\nWord count: 2,116"}, {"url": "https://www.mountvernon.org/library/digitalhistory/digital-encyclopedia/article/charles-lee/", "page_content": "A former British Army officer, Charles Lee retired from that service shortly before he joined the American rebellion. At certain points he is believed to have sought to supplant George Washington and take command of the Continental Army. Lee and Washington came into direct confrontation during the Battle of Monmouth on June 28, 1778. Lee's conduct during the battle and the subsequent exchange with Washington eventually led to his permanent dismissal from the Continental Army.\n\nCharles Lee was born in Cheshire, England the son of British Army General John Lee and Isabella Buxbury. Educated in Switzerland, Lee became fluent in several languages. He joined the British army in 1744. After serving in a number of European armies, including those of Russia, Poland, and Portugal, he took up permanent residence in America and joined the Continental Army in 1775. Lee was commissioned second major general in the force, following only George Washington in seniority.\n\nLee was widely respected in the colonies for his military reputation, and his military advice and direction were sought after in a number of locations in the first years of the conflict. He served on the siege lines outside of Boston and aided in the development of the defenses of Newport, Rhode Island. Afterwards he began the defenses of New York, and was reassigned to the southern department where his most significant contribution came in the defense of Charleston, S.C. against a British assault in 1776.\n\nThese actions led to Lee achieving a fairly high reputation. Lee was captured by the British in 1776 following the fall of New York City. Exchanged in a prisoner swap in 1778, Lee returned to the Continental Army and was a staunch critic of the reforms of the Baron von Steuben. There is some speculation that Lee abandoned the American cause while a prisoner in New York, as he wrote several notes to William Howe on the best manner to defeat the Americans. This was unknown to the American camp at the time of his return and Lee was reinstated at his previous rank.\n\nLee returned to the field and led the advanced guard at the Battle of Monmouth on June 28, 1778. Lee's attack was disorganized and the ensuing confusion resulted in the retreat of the American advance guard. When confronted by Washington on his reason for the withdrawal, the two men exchanged words. Lee was brought up on charges of insubordination and removed from command in the army for one year. In the aftermath, he became embroiled in several affairs of honor and often criticized the Continental Congress for enforcing the sentence on him. These actions led to his permanent dismissal from the Continental Army in January of 1780. He died in Philadelphia in 1782.\n\nJames McIntyre\n\nAssistant Professor of History\n\nMoraine Valley Community College\n\nBibliography:\n\nAlden, John R. General Charles Lee: Traitor or Patriot?. Baton Rouge: Louisiana University Press, 1951.\n\nShy, John \"Charles Lee: The Soldier as Radical.\" George Washington’s Generals and Opponents: Their Exploits and Leadership. New York: De Capo Press, reprint 1994, 22-53."}, {"url": "https://www.thoughtco.com/major-general-charles-lee-2360612", "page_content": "Major General Charles Lee (February 6, 1732–October 2, 1782) was a controversial commander who served during the American Revolution (1775–1783). A British Army veteran, he offered his services to the Continental Congress and was given a commission. Lee's prickly demeanor and substantial ego brought him into frequent conflict with General George Washington. He was relieved of his command during the Battle of Monmouth Court House and was later dismissed from the Continental Army by Congress.\n\nEarly Life\n\nBorn February 6, 1732, in Cheshire, England, Lee was the son of Major General John Lee and his wife Isabella Bunbury. Sent to school in Switzerland at an early age, he was taught a variety of languages and received a basic military education. Returning to Britain at age 14, Lee attended the King Edward VI School in Bury St. Edmonds before his father purchased him an ensign's commission in the British Army.\n\nServing in his father's regiment, the 55th Foot (later 44th Foot), Lee spent time in Ireland before purchasing a lieutenant's commission in 1751. With the beginning of the French and Indian War, the regiment was ordered to North America. Arriving in 1755, Lee took part Major General Edward Braddock's disastrous campaign which ended at the Battle of the Monongahela on July 9.\n\nFrench and Indian War\n\nOrdered to the Mohawk Valley in New York, Lee became friendly with the local Mohawks and was adopted by the tribe. Given the name Ounewaterika or \"Boiling Water,\" he was permitted to marry the daughter of one of the chiefs. In 1756, Lee purchased a promotion to captain and a year later took part in the failed expedition against the French fortress of Louisbourg.\n\nReturning to New York, Lee's regiment became part of Major General James Abercrombie's advance against Fort Carillon in 1758. That July, he was badly wounded during the bloody repulse at the Battle of Carillon. Recovering, Lee took part in Brigadier General John Prideaux's successful 1759 campaign to capture Fort Niagara before joining the British advance on Montreal the following year.\n\nInterwar Years\n\nWith the conquest of Canada complete, Lee was transferred to the 103rd Foot and promoted to major. In this role, he served in Portugal and played a key part in Colonel John Burgoyne's triumph at the Battle of Vila Velha on October 5, 1762. The fighting saw Lee's men recapture the town and win a lopsided victory that inflicted around 250 killed and captured on the Spanish while only sustaining only 11 casualties.\n\nWith the end of the war in 1763, Lee's regiment was disbanded and he was placed on half-pay. Seeking employment, he traveled to Poland two years later and became an aide-de-camp to King Stanislaus (II) Poniatowski. Made a major general in the Polish service, he later returned to Britain in 1767. Still unable to obtain a position in the British Army, Lee resumed his post in Poland in 1769 and took part in the Russo-Turkish War (1778–1764). While abroad, he lost two fingers in a duel.\n\nTo America\n\nInvalided back to Britain in 1770, Lee continued to petition for a post in the British service. Though promoted to lieutenant colonel, no permanent position was available. Frustrated, Lee decided to return to North America and settled in western Virginia in 1773. There he purchased a large estate near lands owned by his friend Horatio Gates.\n\nQuickly impressing key individuals in the colony, such as Richard Henry Lee, he became sympathetic to the Patriot cause. As hostilities with Britain looked increasingly likely, Lee advised that an army should be formed. With the Battles of Lexington and Concord and subsequent beginning of the American Revolution in April 1775, Lee immediately offered his services to the Continental Congress in Philadelphia.\n\nJoining the American Revolution\n\nBased on his prior military exploits, Lee fully expected to be made the commander-in-chief of the new Continental Army. Though Congress was pleased to have an officer with Lee's experience join the cause, it was put off by his slovenly appearance, desire to be paid, and frequent use of obscene language. The post instead was given to another Virginian, General George Washington. Lee was commissioned as the Army's second-most senior major general behind Artemis Ward. Despite being listed third in the Army's hierarchy, Lee was effectively second, as the aging Ward had little ambition beyond overseeing the ongoing Siege of Boston.\n\nCharleston\n\nImmediately resentful of Washington, Lee traveled north to Boston with his commander in July 1775. Taking part in the siege, his gruff personal behavior was tolerated by other officers due to his prior military accomplishments. With the arrival of the new year, Lee was ordered to Connecticut to raise forces for the defense of New York City. Shortly thereafter, Congress appointed him to command the Northern, and later Canadian, Department. Though selected for these posts, Lee never served in them because on March 1, Congress directed him to take over the Southern Department at Charleston, South Carolina. Reaching the city on June 2, Lee was quickly faced with the arrival of a British invasion force led by Major General Henry Clinton and Commodore Peter Parker.\n\nAs the British prepared to land, Lee worked to fortify the city and support Colonel William Moultrie's garrison at Fort Sullivan. Doubtful that Moultrie could hold, Lee recommended that he fall back to the city. This was refused and the fort's garrison turned back the British at the Battle of Sullivan's Island on June 28. In September, Lee received orders to rejoin Washington's army at New York. As a nod to Lee's return, Washington changed the name of Fort Constitution, on the bluffs overlooking the Hudson River, to Fort Lee. Reaching New York, Lee arrived in time for the Battle of White Plains.\n\nIssues with Washington\n\nIn the wake of the American defeat, Washington entrusted Lee with a large portion of the Army and tasked him with first holding Castle Hill and then Peekskill. With the collapse of the American position around New York after the losses of Fort Washington and Fort Lee, Washington began retreating across New Jersey. As the retreat began, he ordered Lee to join him with his troops. As the autumn had progressed, Lee's relationship with his superior had continued to degrade and he began sending intensely critical letters regarding Washington's performance to Congress. Though one of these was accidentally read by Washington, the American commander, more disappointed than angered, did not take action.\n\nCapture\n\nMoving at a slow pace, Lee brought his men south into New Jersey. On December 12, his column encamped south of Morristown. Rather than remain with his men, Lee and his staff took quarters at White's Tavern several miles from the American camp. The next morning, Lee's guard was surprised by a British patrol led by Lieutenant Colonel William Harcourt and including Banastre Tarleton. After a brief exchange, Lee and his men were captured.\n\nThough Washington attempted to exchange several Hessian officers taken at Trenton for Lee, the British refused. Held as a deserter due to his previous British service, Lee wrote and submitted a plan for defeating the Americans to General Sir William Howe. An act of treason, the plan was not made public until 1857. With the American victory at Saratoga, Lee's treatment improved and he was finally exchanged for Major General Richard Prescott on May 8, 1778.\n\nBattle of Monmouth\n\nStill popular with Congress and parts of the Army, Lee rejoined Washington at Valley Forge on May 20, 1778. The following month, British forces under Clinton began evacuating Philadelphia and moving north to New York. Assessing the situation, Washington desired to pursue and attack the British. Lee strenuously objected to this plan as he felt the new alliance with France precluded the need to fight unless victory was certain. Overruling Lee, Washington and the army crossed to New Jersey and closed with the British. On June 28, Washington ordered Lee to take a force of 5,000 men forward to attack the enemy's rearguard.\n\nAt around 8 a.m., Lee's column met the British rearguard under Lieutenant General Lord Charles Cornwallis just north of Monmouth Court House. Rather than commence a coordinated attack, Lee committed his troops piecemeal and rapidly lost control of the situation. After a few hours of fighting, the British moved to flank Lee's line. Seeing this, Lee ordered a general retreat after offering little resistance. Falling back, he and his men encountered Washington, who was advancing with the rest of the Army.\n\nAppalled by the situation, Washington sought out Lee and demanded to know what had happened. After receiving no satisfactory answer, he rebuked Lee in one of the few instances where he swore publicly. Replying with inappropriate language, Lee was immediately relieved of his command. Riding forward, Washington was able to rescue American fortunes during the remainder of the Battle of Monmouth Court House.\n\nLater Career and Life\n\nMoving to the rear, Lee promptly wrote two highly insubordinate letters to Washington and demanded a court-martial to clear his name. Obliging, Washington had a court-martial convened at New Brunswick, New Jersey on July 1. Proceeding under the guidance of Major General Lord Stirling, the hearings concluded on August 9. Three days later, the board returned and found Lee guilty of disobeying orders in the face of the enemy, misbehavior, and disrespecting the commander-in-chief. In the wake of the verdict, Washington forwarded it to Congress for action.\n\nOn December 5, Congress voted to sanction Lee by relieving him from command for one year. Forced from the field, Lee began working to overturn the verdict and openly attacked Washington. These actions cost him what little popularity he had remaining. In response to his assault on Washington, Lee was challenged to several duels. In December 1778, Colonel John Laurens, one of Washington's aides, wounded him in the side during a duel. This injury prevented Lee from following through on a challenge from Major General Anthony Wayne.\n\nReturning to Virginia in 1779, he learned that Congress intended to dismiss him from the service. In response, he wrote a scathing letter that resulted in his formal dismissal from the Continental Army on January 10, 1780.\n\nDeath\n\nLee moved to Philadelphia in the same month as his dismissal, January 1780. He resided in the city until taking ill and dying on October 2, 1782. Though unpopular, his funeral was attended by much of Congress and several foreign dignitaries. Lee was buried at Christ Episcopal Church and Churchyard in Philadelphia."}, {"url": "https://takemeback.to/28-October-1975", "page_content": "Old Newspapers from October 28, 1975\n\nBrowse US newspapers from October 28, 1975\n\nDiscover UK newspaper headlines from October 28, 1975\n\nOld Magazines from October 28, 1975\n\nBrowse your vintage magazines from October 28, 1975\n\nLooking for other vintage memories?\n\nLook at our old newspapers and magazines page\n\nSee also\n\nWhat happened on October 28 in history? Find out the list of October 28th major events\n\nWhat was 1975 famous for? Discover everything about 1975"}, {"url": "https://www.ancientfaces.com/person/charles-lee-birth-1952-death-2006/83113731", "page_content": "Refresh this page to see various historical events that occurred during Charles' lifetime.\n\nIn 1952, in the year that Charles Lee was born, on February 6th, George VI of England died from a coronary thrombosis and complications due to lung cancer. His eldest daughter, age 25, immediately ascended the throne as Elizabeth II and her coronation was on June 2 1953.\n\nIn 1968, Charles was 16 years old when on January 31st, the North Vietnamese launched the Tet Offensive, a turning point in the Vietnam War. 70,000 North Vietnamese and Viet Cong forces swarmed into South Vietnam. The South Vietnamese and US troops held off the offensive but it was such fierce fighting that the U.S. public began to turn against the war.\n\nIn 1978, Charles was 26 years old when on July 25th, Louise Brown, the first \"test-tube baby\", was born at Oldham Hospital in London. Louise was conceived through IVF (in vitro fertilization), a controversial and experimental procedure at the time.\n\nIn 1982, by the time he was 30 years old, on June 30th, time ran out on the Equal Rights Amendment (ERA). The Amendment had only received 35 of the necessary 38 state ratifications. First sent to the states in 1972, the Amendment stated that \"Equality of rights under the law shall not be denied or abridged by the United States or by any State on account of sex\".\n\nIn 1991, by the time he was 39 years old, on January 16th, Allied forces began the first phase of Operation Desert Storm. Saddam Hussein's forces had previously invaded the sovereign state of Kuwait and the focus of the operation was to remove his Iraqi troops from Kuwait. On February 24th, the ground war began. Within 100 hours, American ground troops declared Kuwait liberated."}, {"url": "https://www.ancientfaces.com/person/charles-lee-birth-1907-death-1967/42412674", "page_content": "Refresh this page to see various historical events that occurred during Charles' lifetime.\n\nIn 1907, in the year that Charles Lee was born, the Monongah coal mining disaster occurred on December 6th, happening at the Fairmont Coal Company’s No. 6 and No. 8 mines.. Over 361 miners were killed. Because there was no breathing apparatus at the time to help rescuers, recovery efforts were greatly hampered. It is considered the worst mining disaster in American history and led to government oversight in mining practices.\n\nIn 1913, by the time he was just 6 years old, the Philippine–American War ended for good in June. While the official end of the war was in 1902, fighting continued for several years. An estimated 200,000 to 250,000 total Filipino civilians died and although the U.S. viewed its role as a colonial presence as one of preparing the Philippines for independence, American colonization drastically changed the character off the culture. The Catholic Church was no longer the state religion and English became the primary language of the government.\n\nIn 1928, by the time he was 21 years old, aviatrix Amelia Earhart, age 31, became the first woman to fly solo across North America and back in August. In June, she had been part of a 3 man crew that flew the Atlantic Ocean but since she had no instrument training, she couldn't fly the plane - she kept the flight log. The North American flight became one of her many \"firsts\" as a female pilot.\n\nIn 1936, at the age of 29 years old, Charles was alive when on November 3rd, President Franklin Delano Roosevelt was reelected to a second term. He ran against Republican Governor Alf Landon (Kansas), defeating Landon in the popular vote by 60.8% to 36.5%. Vermont and Maine were the only two states in which Landon won. John Nance Garner IV became the Vice-President in this election.\n\nIn 1967, in the year of Charles Lee's passing, on October 2nd, Thurgood Marshall was sworn in as the first black US Supreme Court justice. Marshall was the great-grandson of a slave and graduated first in his class at Howard University Law School. His nomination to the Supreme Court was approved by the Senate, 69 to 11."}, {"url": "https://prabook.com/web/charles_c.lee/3439940", "page_content": "Charles C. Lee Edit Profile\n\nphysicist\n\nCharles C. Lee, American Physicist. Achievements include patents for Laser Diode Printer; for Laser Scanning Apparatus using a Fan Style Grating Plate; patent pending for Infrared Sensitization of Photoconductor, ink jet printing sheet, ink jet supply system.\n\nBackground Lee, Charles C. was born on October 8, 1940 in Szechwan, China. Came to the United States, 1965.\n\nEducation Bachelor of Science in Physics, Peking U., Beijing, 1964; Master of Science in Solid State Physics, Purdue University, 1968; Doctor of Philosophy in Solid State Physics, Purdue University, 1974.\n\nCareer Senior scientist central research laboratory, 3M Company, St. Paul, 1974-1978; research specialist physics and material laboratory, 3M Company, St. Paul, 1978-1982; senior research specialist engineering systems division, 3M Company, St. Paul, 1982-1988; division scientist engineering document systems, 3M Company, St. Paul, 1988-1993; division scientist commercial graphics, 3M Company, St. Paul, since 1993. Technical auditor 3M Company.\n\nAchievements Charles C. Lee has been listed as a noteworthy Physicist by Marquis Who's Who.\n\nMembership President Chinese American Association Minnesota, Minneapolis, 1982. Treasurer Citizen for Bachelor of Science Woo in Minnesota, Minneapolis, 1988. Organizer Music Festival, St. Paul, Minneapolis, 1990.\n\n\n\nChair Friends of Esther Lee Yao in Minnesota, 1991. Member Society Photo-Optical Instrumentation Engineers, Society Information Display, Society for Imaging Science and Technology, Association Information and Image Management."}, {"url": "https://www.encyclopedia.com/people/history/us-history-biographies/charles-lee", "page_content": "Charles Lee\n\nBritish-born General Charles Lee (1731-1782) joined the forces of George Washington's Continental Army in 1775. His capture by British troops a year later and his retreat during the Battle of Monmouth, which led to a court-martial and removal from the army, prompted historians to question both his military ability and his allegiance to his adopted country.\n\nOne of the most puzzling and ambiguous characters in American military history, Charles Lee served as third in command in the Continental Army during the American Revolution. Captured only a year into the war while staying at a New Jersey tavern and imprisoned for 18 months, he later compromised an attack by General George Washington's army by retreating during the Battle of Monmouth in 1778. Haunted by growing disapproval due to his outspoken criticism of Washington, Lee was court-martialed and subsequently suspended from the army.\n\nNo Fixed Allegiance\n\nOf Irish heritage, Lee was born in Dernhall, Cheshire, England, on January 25, 1731. His father, a former colonel in the British Army, encouraged his son's interest in the military and enrolled Lee in a Swiss military school in 1744. An ensign from the age of 14, Lee was sent to the American colonies during the French and Indian War and in 1755 served in British General Edward Braddock's 44th Regiment. This regiment contained several officers who would go on to shape history, among them George Washington, Horatio Gates, and Thomas Gage. Unlike his colleagues, Lee flouted convention with his unkempt appearance and his coarse demeanor, although he was known to quote from Latin scholars when the occasion suited him. Known for his bouts of drunkenness and vulgar language, Lee was rarely seen without his train of dogs. He said dogs, unlike men, were faithful. In 1756, while in northern New York, he was adopted into a Mohawk tribe, entered what he considered a non-binding union with the daughter of Seneca tribal leader White Thunder, and was given the name Ounewaterika, or \"Boiling Water,\" referring to his quickness to anger.\n\nHis life with the Mohawks was brief. In July 1758 Lee was back under British command and serving in the 44th Regiment under General Abercromby during the unsuccessful British attack on Fort Ticonderoga. Wounded during battle, he was sent to Long Island to recover. He disagreed with his surgeon on proper treatment of his wounds and whipped the doctor, who later tried to kill him. Lee's brash, impetuous nature frequently got him into trouble.\n\nIn 1759, Lee and the 44th Regiment fought French forces at Fort Niagara. He served under General Amherst during the siege and capture of Montreal on September 8, 1760. Spending the winter in England, he was promoted to the rank of major in the 103rd Regiment. On August 10, 1761, he became a major in the 103rd Regiment of the British Army. The following spring, he was a lieutenant colonel when he accompanied an expeditionary force to Portugal under Major General John Burgoyne.\n\nWith Great Britain once again at peace, Lee saw no future as an officer on half-pay in the British Army. Lee traveled to Warsaw in March 1765 and gained the confidence of Poland's King Stanislaus. However, a trip to Turkey caused him to rethink this career move. After becoming snowbound in the Balkans and then surviving a deadly earthquake in Constantinople in May 1776, Lee returned to the relative safety of England. He spent the next two years penning sarcastic essays critical of the British crown and lived off his gambling winnings. When civil war broke out in Poland he returned to aid King Stanislaus and was commissioned a general in the Polish army. During a campaign in Turkey in late 1769 Lee became ill and was sent to the Mediterranean to recover. During 1771 he alternated between England and France, but he was discontented with the political situation in both nations.\n\nJoined American Cause\n\nExcited by the growing spirit of the Enlightenment, Lee desired to fight on behalf of liberty, and he enlisted in the cause of the American patriots after returning to the American colonies in 1773. Making a home in current-day West Virginia, he attacked efforts at reconciliation between colonists and the British crown in the pamphlet Strictures on a Pamphlet, entitled \"A Friendly address to All Reasonable Americans.\" His enthusiastic support of the colonial cause gained him the admiration of Richard Henry Lee, Patrick Henry, and Samuel and John Adams. His military experience made him a valuable asset to the newly formed Continental Army. In December 1774, Lee traveled to Mount Vernon and Washington's side. After war broke out in 1775, he renounced his commission in the British Army. Artemas Ward was named first major general and Lee became second major general in Washington's Continental Army, a commission Lee accepted on June 17, 1775.\n\nA month later, Lee accompanied Washington to Cambridge, Massachusetts, and fought during the siege of Boston under General Ward. The following March, the Continental Congress ordered Lee south to fight British troops in Virginia and North Carolina as head of the army's Southern department. On June 4, 1776, Lee arrived in Charleston and assumed command of the South Carolina troops, making his headquarters in nearby Williamsburg. Unenthusiastic about the post, he anticipated a retreat. Colonel William Moultrie had other ideas, and repulsed the British naval force from his position at Fort Sullivan on Sullivan's Island. While Lee and Moultrie both received commendations for their actions, Moultrie was considered primarily responsible for the victory.\n\nCaptured by the British\n\nIn September 1776, after the British withdrawal from the southern colonies, Lee was ordered to return to the main army, now stationed in New York and New Jersey. He expressed reluctance to rejoin Washington after learning that threatening maneuvers by British General Howe had forced a colonial retreat. He believed he would be more effective and gain more notoriety as head of a \"rogue\" unit that engaged the British using guerilla tactics. However, Lee eventually followed orders and headed into New Jersey. On December 12, 1776, he took quarter at White's Tavern in Basking Ridge, two miles from where his 4,000-member detachment encamped, and the following day sent a terse letter to General Horatio Gates, referring to Washington by noting that \"a certain great man is most damnably deficient. He has thrown me into a situation where I have my choice of difficulties.\"\n\nCamped less than four miles away, British troops led by Lieutenant General Cornwallis discovered Lee's whereabouts. Soon after writing his letter to Gates, Lee was captured by Colonel Harcourt. General Lee was \"hurried off in triumph,\" Continental Army Captain James Wilkinson later recalled in his memoirs, \"bareheaded, in his slippers and blanket coat, his collar open, and his shirt very much soiled from several days' use.\"\n\nLee was taken to New York and imprisoned. An order to return him to England for trial as a deserter was rescinded by British General Howe, who knew of Lee's resignation. Washington attempted to secure Lee's release through a prisoner exchange, but he had no captives of similar rank with which to bargain, and Lee remained in British custody for almost 18 months. During this time Lee appears to have wavered in his allegiance to his adopted country. In 1858 a document titled \"Mr. Lee's Plan, 29th March 1777\" was discovered; it advised Howe on a way to defeat the Continental Army. While some historians have argued that Lee's plan was an attempt to mislead the British commander, in the light of his later activities his loyalty remains in question.\n\nAfter Burgoyne's defeat at the Battle of Saratoga, Lee was exchanged for recently captured Major General Richard Prescott and released in April 1778. After a quick trip to Congress to complain about his lack of promotion during his capture, Lee traveled to Valley Forge and by late May had rejoined his command.\n\nThe Battle of Monmouth\n\nThroughout his involvement in the Revolutionary War, Lee earned a reputation as a loose cannon, a recalcitrant officer resentful of taking orders from Washington, whom he believed to be of lesser ability. His actions in June 1778 during the Monmouth campaign cemented this reputation and led to the end of his military career.\n\nWashington was determined to attack the British during their retreat from Philadelphia to New York, and he overtook General Henry Clinton and his 11,000 British regulars near New Freehold, New Jersey, near Monmouth Court House. The Battle of Monmouth provided Washington with the chance for a much-needed victory. While generals Nathanael Greene, Wayne, and the Marquis de Lafayette urged a full assault, Lee argued against such an approach. Put in command of the main flank supporting the advance force led by General Wayne, he was suddenly confronted by more soldiers than he had anticipated. Informed by a scout of an area to his rear that would be easily defended, Lee began to retreat, forcing Wayne to fall back. Washington quickly reformed the regiments of Greene, Stirling, and Wayne into a second formation that successfully stalled the British until dark, while General von Steuben assumed command of Lee's forces.\n\nWashington's words to Lee on the battlefield were not recorded, but they were severe enough that Lee immediately demanded an apology. Two days later he sent the commander-in-chief a critical letter that angered Washington. Further correspondence between the two men resulted in Lee's request for a court of inquiry so that he could prove his case. On July 4 Lee's court martial began, with General Stirling presiding, and on August 12 he was found guilty of disrespect to his commanding officer, disobedience, and leading a disorderly and unauthorized retreat. His punishment, one year's suspension, was eventually sanctioned by Congress on January 10, 1780, although colonial leaders expressed regret at the loss of a commanding officer during wartime. As Eric Ethier reported in American History, when Lee heard the decision of Congress to approve his suspension, he pointed to one of his dogs and said, \"Oh, that I was that animal, that I might not call man my brother.\"\n\nLee sent repeated letters to congressmen, members of the military, and the press attacking the character of Washington and complaining of mistreatment by the Continental Congress. After reading Lee's defamatory \"Vindication,\" published in the Pennsylvania Packet on December 3, 1778, Colonel John Laurens challenged Lee to a duel over his slanderous remarks about Washington's character. In the duel, Lee was wounded and could not fight a second duel requested by General Wayne.\n\nIn July 1779 Lee returned to his home in Virginia, remaining there for two years before moving to Philadelphia. He died of pneumonia in a tavern on October 2, 1782. Up to the time of his death he continued to express animosity toward Washington as a \"puffed up charlatan.\" In Lee's last will and testament he asked that he not be buried in a churchyard. \"I have kept so much bad company when living,\" he wrote, \"that I do not choose to continue it when dead.\" Despite these wishes, Lee was buried at the cemetery at Christ Church, Philadelphia. Though he had been unpopular only months before, his funeral was attended by Washington, members of the Continental Congress and the assembly of Pennsylvania, the minister of France, and other officers of distinction.\n\nBooks\n\nCommager, Henry Steele, and Richard B. Morris, editors, The Spirit of 'Seventy-Six: The Story of the American Revolution as Told by Participants, Bonanza, 1983.\n\nDictionary of American Biography, American Council of Learned Societies, 1928-1936.\n\nLangguth, A. J., Patriots: The Men Who Started the American Revolution, Simon & Schuster, 1988.\n\nSparks, Jared, Lives of Charles Lee and Joseph Reed, Little, Brown, 1846.\n\nStryker, William Scudder, The Battle of Monmouth, Houghton, 1896.\n\nWilkinson, James, Memoirs of My Own Times, A. Small, 1816.\n\nPeriodicals\n\nAmerican History, October 1999. □"}, {"url": "https://www.celebsagewiki.com/charles-lee-scientist", "page_content": "Age, Biography and Wiki\n\nCharles Lee was born on 1 April, 1969 in Seoul, South Korea. Discover Charles Lee's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 54 years old?\n\nPopular As N/A Occupation N/A Age 54 years old Zodiac Sign Aries Born 1 April 1969 Birthday 1 April Birthplace Seoul, South Korea Nationality Canada\n\nWe recommend you to check the complete list of Famous People born on 1 April. He is a member of famous with the age 54 years old group.\n\nCharles Lee Height, Weight & Measurements\n\nAt 54 years old, Charles Lee height not available right now. We will update Charles Lee's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nHe is currently single. He is not dating anyone. We don't have much information about He's past relationship and any previous engaged. According to our Database, He has no children.\n\nFamily Parents Not Available Wife Not Available Sibling Not Available Children Not Available\n\nCharles Lee Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Charles Lee worth at the age of 54 years old? Charles Lee’s income source is mostly from being a successful . He is from Canada. We have estimated Charles Lee's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income\n\nCharles Lee Social Network"}], "Charles Lee is an American former professional basketball player.": [{"url": "https://www.wikiwand.com/en/Charles_Lee_(basketball)", "page_content": "Charles Lee (born November 11, 1984) is an American former professional basketball player and associate head coach for the Milwaukee Bucks of the National Basketball Association (NBA). A 6'3\" guard from Bucknell University, he spent most of his professional career in Israel and Europe. Lee is married to his college sweetheart Lindsey. She also played basketball at Bucknell.\n\nAmerican basketball player and coach\n\nQuick facts: Milwaukee Bucks, Position, League, Personal i... ▼\n\nThe 2006 Patriot League Player of the Year, Lee helped guide Bucknell to two straight Patriot League Championships and two straight NCAA tournament second-round appearances. In four seasons with the Bison, he earned First Team All-Patriot League honors twice (2004, 2005) and Second Team All-Patriot League honors once (2003). He finished his career at Bucknell with 1,147 career points (11.0 ppg), 568 rebounds (5.5 rpg) and 167 steals (1.61 spg).[1]\n\nLee enrolled at Bucknell a year before the school started offering athletic scholarships, and never received anything more than partial financial aid.[2] The New York Times called him \"[one of] college basketball's best nonscholarship players\".[3] At Bucknell, Lee majored in business.[2]\n\nAfter graduating in 2006, Lee played with the San Antonio Spurs during the NBA's summer league and pre-season, but he did not make the regular season roster. He has since played for Hapoel Gilboa/Afula in Israel,[1][4] Verviers-Pepinster in Belgium and MEG Goettingen and Artland Dragons in Germany.[5]\n\nOn June 25, 2012, Bucknell announced that Lee was returning to his alma mater as an assistant men's basketball coach."}, {"url": "https://www.celebsagewiki.com/charles-lee-basketball", "page_content": "Age, Biography and Wiki\n\nCharles Lee was born on 11 November, 1984 in American. Discover Charles Lee's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 38 years old?\n\nPopular As N/A Occupation N/A Age 38 years old Zodiac Sign Scorpio Born 11 November 1984 Birthday 11 November Birthplace N/A Nationality American\n\nWe recommend you to check the complete list of Famous People born on 11 November. He is a member of famous with the age 38 years old group.\n\nCharles Lee Height, Weight & Measurements\n\nAt 38 years old, Charles Lee height not available right now. We will update Charles Lee's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nHe is currently single. He is not dating anyone. We don't have much information about He's past relationship and any previous engaged. According to our Database, He has no children.\n\nFamily Parents Not Available Wife Not Available Sibling Not Available Children Not Available\n\nCharles Lee Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Charles Lee worth at the age of 38 years old? Charles Lee’s income source is mostly from being a successful . He is from American. We have estimated Charles Lee's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income\n\nCharles Lee Social Network\n\nInstagram Linkedin Twitter Charles Lee Twitter Facebook Wikipedia Charles Lee Wikipedia Imdb\n\nTimeline"}, {"url": "https://nba.nbcsports.com/2022/06/11/bucks-make-charles-lee-associate-head-coach-in-effort-to-keep-key-assistant/", "page_content": "MIAMI — Erik Spoelstra, Michael Malone, and their staffs have been pouring over film and losing sleep, trying to come up with adjustments. Minor tweaks that can give their team even a little edge.\n\nBut four games into a series, there are not a lot of secrets left. Everyone knows what is coming. It is often more about execution and effort over adjustments.\n\n“I think it’s a little bit of both,” the Heat’s Haywood Highsmith said. “It’s definitely some things we can adjust on, and then it’s also about a little bit more effort and just doing more. You always need more, always can do more… we definitely have to make some adjustments on both ends of the floor, but you know, we’ll figure it out.”\n\nThe Heat need to figure it out before Game 4 on Friday night, because they can’t afford to go down 3-1 to the Nuggets in this series. Game 4 is as close as it gets to must-win for Jimmy Butler and the Heat.\n\nHere are two things worth watching in Game 4, plus some betting advice from Vaughn Dalzell of NBC Sports Edge.\n\n1) Miami has to slow the Jokic/Murray two-man game. Somehow.\n\nDenver’s defense has been impressive in these Finals, holding Miami to a 111.1 offensive rating through three games (for comparison, that is 7.2 below their offensive rating against Boston).\n\nPart of the reason is that Nikola Jokić can be a better rim protector and defensive player than people give him credit for. Another key is Malone has been able to lean hard into more defensive-based lineups because the two-man game of Jamal Murray and Jokić has been all the offense the Nuggets need.\n\nThe Murray/Jokic pick-and-roll has been a masterclass in this series — the Nuggets have a 126 offensive rating this series when running that play. In Game 3, the Denver stars ran 32 pick-and-rolls, and those plays were the foundation of each of them getting a 30-point triple-double (the first teammates to have a 30+ point triple-double in any NBA game).\n\nNikola Jokic and Jamal Murray are the first pair of teammates with triple-doubles in Finals history! Jokic: 32 PTS, 21 REB, 10 AST\n\nMurray: 34 PTS, 10 REB, 10 AST DEN/MIA Game 4: Friday, 8:30pm/et on ABC pic.twitter.com/0hLcPvv0zN — NBA (@NBA) June 8, 2023\n\n“I mean, the Murray/Jokic two-man game is a pretty hard action to stop,” Haywood Highsmith said. “But we got great defensive players, got some of the great two-way players in this game, Jimmy [Butler] and Bam [Adebayo], so we’re gonna figure it out. We got a lot of different bodies we can throw at Murray as well.”\n\nMiami may need to sell out to stop Jokić and Murray and force any other Nugget to beat them. The Heat did blitz the pick-and-roll more in the fourth quarter of Game 3, but that led to Christian Braun cuts to the basket and Denver buckets. Miami may have to live with some of that, they have to keep Murray in particular in check (it feels like Jokić will get his no matter what).\n\n“Whatever you do, you just can’t do it all the time,” Spoelstra said of defending the Nuggets duo. “There’s no absolutes when you get to this level. It’s the highest level of competition. You’re getting the highest level of execution. Understanding what they’re trying to get to, and we try to get them out of their comfort zones as much as possible.\n\n“The first half, they really got to that two-man action quite a bit. They were getting a lot of traction, so they didn’t need to go to any other part of their playbook.”\n\nMiami needs to see the rest of that playbook.\n\n2) Miami has to make shots, rebound, set defense\n\nThe best way for Miami to limit the Jokic/Murray action and the Denver offense in general is to slow the game down. Make them go against a set defense every time down. That didn’t happen enough in Game 3 — Denver was free-flowing on offense when Miami needs the game played in the mud.\n\nFor the Heat to change that dynamic two key things need to happen.\n\nFirst, Miami has to make shots. It’s simplistic but it’s true. Denver isn’t going to run if they are taking the ball out of the net.\n\nThat starts with 3-pointers, because as has been noted everywhere the Heat are 6-1 when they shoot 45% or better from 3 this postseason (including Game 2 against the Nuggets), and unreasonably hot shooting has sustained their run to the Finals. The Heat starters were 5-of-19 (26.3%) from beyond the arc in Game 3, which is simply not good enough — Max Strus, Gabe Vincent and the rest of the role players must step up and knock down shots. However, the bigger concern in Game 3 was the Heat shooting 38.2% within eight feet of the basket. The Nuggets’ size is clearly bothering the Heat. Jimmy Butler needs to get downhill and then make the shots, Bam Adebayo has to get the floater to fall, and the Heat need to attack and get to the free throw line.\n\nSecond, the Heat can’t let the Nuggets win the rebounding battle by 25. Denver’s size advantage has played out in this series in many ways (including how they contested 3s in Game 3), but it is most clearly on the glass. Miami is getting one shot and they’re done, but the Nuggets grabbed the offensive rebound on 36.1% of their missed shots in Game 3, and if you give them that many second chances you will pay.\n\nIt will take gang rebounding and effort, but the Heat must be stronger on the glass.\n\n3) Vaughn Dalzell’s betting recommendations\n\nOver/Under: The total continues to drop from game-by-game starting at 219.5 then going from 216.5 to 214.5 and now 210.5 for Game 4. Denver and Miami have struggled with consistency when it comes to scoring, Miami a little more than Denver. The Nuggets are shooting 51% to Miami’s 41% from the field and averaging 10 more free-throw attempts per game. The pace and tempo of this series has barely changed through three games and if it wasn’t for Miami’s 38-point fourth quarter in Game 2, the Under would be 3-0 in this NBA Finals. I will keep riding the Under.\n\nPlayer Props: In this series there have been four players worth betting overs; Jamal Murray, Nikola Jokic, Jimmy Butler and Bam Adebayo. On the other hand, there have been some very good fade prospects for unders such as Kevin Love, Max Strus, Caleb Martin, Michael Porter Jr. and Kentavious Caldwell-Pope, who are all shooting 31% or worse from the field. When betting player props in the NBA Finals, keep it simple stupid (KISS).\n\n(Check out more from Dalzell and the team at NBC Sports Edge.)"}, {"url": "https://theathletic.com/3171605/2022/03/09/nba-40-under-40-milwaukee-bucks-assistant-coach-charles-lee-is-ready-to-run-his-own-team/", "page_content": "This past offseason, Charles Lee emerged as one of the most interesting head-coaching candidates for the various openings around the league. He was tied to a handful of jobs, including as a strong candidate in New Orleans and as a finalist in Washington. It was the latest sign that Lee is ready to take the next step in his career.\n\nAdvertisement\n\nLee, 37, is in his eighth season in the NBA and all eight have been spent on the bench alongside Mike Budenholzer, first in Atlanta and now in Milwaukee where Budenholzer is the Bucks head coach, and the franchise is the reigning NBA champion. A former Patriot League Player of the Year at Bucknell, Lee played in Europe after college, before moving into coaching.\n\nIt seems as if Lee will get his chance to run his own team at some point, if last year’s hiring cycle was an indication. He took some time recently to speak with The Athletic for its 40 under 40 series. He discussed what he’s learned from Budenholzer, his approach as a coach, what he’s taken from working with Giannis Antetokounmpo and what he took from coming so close last offseason.\n\nYou’ve worked with Mike in two stops now. How much have you pulled from him? What is your approach as a coach dealing with NBA players?\n\nI would say I’ve drawn a lot from Coach Bud. I’ve been blessed to have worked for a guy who was Coach of the Year. Who’s won championships, even outside of Milwaukee, but as an assistant, obviously, in San Antonio. And then the other assistant coaches that he’s had on staff, I’ve gotten to draw and pull from Taylor Jenkins, who’s crushing it in Memphis. And Darvin Ham and Neven Spahija and Kenny Atkinson. It’s been a special group to kind of draw a lot of different thoughts and ideas from, but I would say what I’ve learned over the years, there are so many variables that go on in a day-to-day process, and throughout a season, and the thing that I keep falling back on is just like controlling what you can control. The schedule’s tough and injuries happen and all this stuff, but can we just be focused and obsessed with just controlling what we can control, which is our preparation on a daily basis, our effort levels, and then our mental makeup?\n\nAdvertisement\n\nI’m a big ‘power of positivity’ guy. Yeah, there’s some adversity, there’s some, quote-unquote, failures or losses, but how are we going to respond to that and how do we just develop this thicker skin to be able to deal with these adverse situations? Then controlling what you can control kind of flows into my coaching philosophy. Daily improvement — how can we make sure that we’re just making everyday matter? Whether it’s on the court, we’re going to improve, with our skill set, whether it’s in the weight room getting stronger, whether it’s the diet part of our nutrition, just to help our body to be able to recover. Have you just be obsessed again, like daily improvement and not getting bored with the day-to-day improvements. The second part, again, competitiveness. I think that if you can compete at a high level physically, but also the mental side of it as well, you’re going to put yourself in a good position to win a lot of games. And then the third part of my philosophy is just togetherness. How can we come together as a team? How can I as the head coach, or even as an assistant coach, build relationships where I’m earning their trust? Where they will let me coach them, they will allow me to help impart some wisdom to them as basketball players? And also just admit, because I want to see the best for them. And I think that once players feel that there’s a connection and a real genuine relationship, it makes them want to play a little bit harder for you.\n\nWhat have you learned from working with Giannis and coaching Giannis when it comes to coaching star players and getting them to trust you?\n\nBeing honest. Not beating around the bush. Understanding the game and doing your homework and watching the film and going back and forth, but then just finding opportunities to hit him on things that are just honest. Like, not always, ‘Hey, you’re the best. You know, you’re doing this great,’ No, he wants to be coached. All the players from Giannis down to our 15th guys — Lindell Wigginton and Jevon Carter or Jordan Nwora, whoever it is, they just want you to be honest with them and upfront. I think that when you outline clear expectations for players, they respect that more than anything else.\n\nSo what was last year like, winning the title? What, what was that like for you personally?\n\nMy talking about kind of controlling what you could control, there’s so much hard work that goes into a season and every year we all have this goal, obviously, of trying to compete or win a championship, and we’ve fallen short in previous years, and we’ve had some great seasons. Staying patient but continuing to trust your hard work, that it’s gonna pay off. And then last year, we finally hit the pinnacle, which is kind of what you’ve been working for. It felt really good because we’ve been kind of to the top of the mountain or really close to the top the mountain of getting to the finals. Last year, we finally get there, and it just felt great to see it and all the hard work that we had put in, all the daily improvement, all the adversity that we had kind of gone through and come together, we had grown.\n\nAfter that, it seemed like you were interviewing with several teams for a head coaching job. It looked like, at least according to reports, that you were close in New Orleans. What did you take away from the interview process and what do you have your eyes on now when it comes to being a head coach one day?\n\nAdvertisement\n\nDefinitely learned how to accept rejection. In all seriousness, number one, it was just an honor to be in these conversations. To be so young but to know that my hard work is paying off, I’m just kind of staying focused on just being the best assistant coach that I can possibly be at a place and not worry too much about this self-promotion or doing anything extra. Just really working hard and diving into whatever responsibilities the team needs. Then I would say, on top of it, just accepting feedback and understanding. ‘What am I going to have to do to grow so that one day I can be in the seat of being a head coach for one of these organizations?’ There are only 30 of them and it was kind of tough to keep hearing no. But after self-reflection, you take the feedback, and now it’s just my responsibility to keep trying to grow in those areas that they think that I can show some improvement in.\n\n(Photo of Charles Lee: Jim Poorten / NBAE via Getty Images)"}, {"url": "https://playersbio.com/david-lee/", "page_content": "David Lee is an American-born former professional basketball player who played for around twelve seasons in the NBA. He played for five different clubs until his retirement in 2017, winning an NBA ring once with the Golden State Warriors.\n\nLee had started his NBA journey with the New York Knicks in 2005. He stayed with the Knicks for five seasons before moving to the other clubs.\n\nOverviewing his professional career, one can consider his NBA campaign a huge success. Alongside winning the championship title, the NBA selected him for the All-Star Game twice in 2010 and 2013.\n\nAn adept athlete Lee very well knew that perfection did not exist but instead believed that one should always strive towards achieving it. This attitude always allowed room for improving his game, and so in the end, he came out as one of the best.\n\nAlthough he faltered while transitioning from college to league, he soon caught the momentum and kept delivering well until the end.\n\nHowever, repeated injuries during his last years in the NBA hampered his career.\n\nNevertheless, David remained one of the promising all-rounders who played in the NBA for most of his career. Besides basketball, Lee also made various cameo appearances in tv shows such as NBC’s Celebrity Apprentice, Lipstick Jungle, etc.\n\nNow, let’s discover more about his life and times in detail in the article below. But before that, here are some quick facts about Lee.\n\nQuick Facts\n\nFull Name David Lee Date of Birth April 29, 1983 Birth Place St. Louis, Missouri, the USA Nick Name White Chris Webber “WCW” Religion Christianity Nationality American Zodiac Sign Libra Age 40 years old Height 2.06 m (6 feet 9 inches) Weight 245 lb (111 kg) Hair Color Light brown Eye Color Blue Build Athletic Father’s Name Gary Lee Mother’s Name Susan Lee Siblings Not available Food Habit Non-vegetarian Education John Burroughs School (Ladue, Missouri)\n\nChaminade College Prep School (Creve Coeur, Missouri)\n\nUniversity of Florida (Gainesville, Florida) Marital Status Married Sexual Orientation Straight Wife’s name Caroline Wozniacki Kids One (Olivia Lee) Profession Basketball player NBA Draft 2005 / Round: 1 / 30th pick overall Position Power forward / Center League National Basketball Association (NBA) Active Years (2005 – 2017) Net Worth $40 – $65 million Currently Plays For None/ Retired Jersey Numbers 42, 10 Social Media Instagram, Twitter Merch Basketball Trading Card Last Update June 2023\n\nDavid Lee | Early Life, Family & Education\n\nOn April 29, 1983, David Lee was born in St. Louis, Missouri, United States. He is the son of Gary (Father) and Susan Lee (Mother).\n\nLee started his education at a local school nearby his house in St. Louis, where he was an academically gifted kid. Born in a wealthy family, he did not feel short of anything while growing up.\n\nHis grandfather, Desmond Lee, was a retired World War II veteran who had established a big company named Lee-Rowan Company which had a net worth of millions. So, his family had a good influence in the city he resided.\n\nDespite his busy schedule, Desmond spent considerable time with his grandkid. He used to tell him war stories and other stuff such as business, hard work, and dedication.\n\nAs he was born with the silver spoon, people in St. Missouri believed that David would take over his family’s business. However, he had a passion of his own.\n\nHis father, Gary, was an assistant coach at the Chaminade College Prep School besides being a businessman. Moreover, his grandfather was an athlete during his college years at Washington University.\n\nSo, maybe because of their influence, he grew fond of basketball and soon became proficient. His coach at the school often doubted that he would not pursue such a career seeing his family background.\n\nBut, Lee did not want to live off his privilege and carried on with his studies and sports to shape his life. After graduating from the Chaminade prep in 2001, he enrolled in the University of Florida for higher education.\n\nDavid Lee | Basketball Career\n\nHigh School Career\n\nDavid Lee played high school basketball for the Chaminade Preparatory High School in Missouri. He had already gained considerable experience by playing basketball at the John Burroughs School and the St. Louis Eagles AAU team.\n\nHis high school coach Kelvin Lee initially doubted his skills, but David proved to be a good power forward since his freshman season. His tall frame helped him dominate his opponents and score high points.\n\nHowever, Lee’s performance on the rear end of the court was far superior to his teammates during his school years. Moreover, he was ambidextrous, which often came in handy while making quick passes.\n\nFor his performance in senior season, David got an opportunity to play in the McDonald’s All-American Game and was named to the first-team Parade All-American in 2001. Similarly, he won the Slam Dunk competition that same year.\n\nClick here to read about the American-born retired professional basketball player John Lucas II who now coaches the Houston Rockets athletes!\n\nCollege Career\n\nDavid began receiving scholarship offers from different universities such as Florida, Duke, Kentucky, Illinois, etc., when he was in senior year of his high school. At last, he decided to go to the University of Florida and committed verbally on September 1, 2000.\n\nThe Gators’ head coach Billy Donovan immediately recognized his talent and remarked that he was one of very few freshers to have elite-level rebounding skills.\n\nHe finished the first season with 7.0 points and 4.7 rebounds per game. However, his performance kept getting better one season after another, and just like Donovan said, he was the leading rebounder in his senior season.\n\nLee averaged 13.6 points and 9.0 rebounds per game in his last college season. He led the Gators to the 2005 SEC Basketball Tournament, their first-ever SEC championship win.\n\nProfessional Career\n\nThe New York Knicks selected Lee as the 2005 NBA draft’s first-round 30th pick. The Knicks were at their low times during the years they chose Lee, and every player on the team had great challenges ahead.\n\nAt first, the Knicks relied on Channing Frye above Lee, but they later had to give Lee more chances as Frye retreated to rest due to injury.\n\nContrary to the expectation, Lee performed poorly in all sides of the game except rebounding. He finished his first-ever NBA season with an average of 5.1 points and 4.5 rebounds per game.\n\nHowever, his performance in the next four seasons with the Knicks set him up for a fantastic career in the NBA. Even though he missed many games in the second season, his games did not degrade even a bit.\n\nHe averaged 20.2 points and 11.7 rebounds per game and secured a place in the NBA All-Star Game in the 2009-10 season. After that season, the Knicks traded him to the Golden State Warriors, with whom he signed a new contract on July 9, 2010.\n\nHowever, he consistently missed many matches due to frequent injuries. Even though he missed half of the season with the Warriors in the 2014-15 season, he won the NBA championship in 2015.\n\nDavid Lee played two more NBA seasons after transferring from the Golden State Warriors. After his injuries worsened, he announced his retirement on November 19, 2017. He was with the San Antonio Spurs when he retired.\n\nAwards & Achievements\n\nSome of his awards and achievements include:\n\nNBA champion (2015)\n\nAll-NBA Third Team (2013)\n\nMcDonald’s All-American (2001)\n\nNBA All-Star (2010, 2013)\n\nMr. Show-Me Basketball (2001)\n\nFirst-team Parade All-American (2001)\n\nSecond-team All-SEC (2004, 2005)\n\nNet Worth\n\nOne of the highest-paid athletes of his time, David lee has a net worth ranging from $40 million to $65 million.\n\nAlthough he was born into a millionaire family, he created his own life earning millions from his basketball career. After the New York Knicks picked him in the 2005 draft, they paid him around $860k for his rookie season.\n\nLee continued playing for the Knicks in the next few seasons with improved gameplay, due to which they increased his salary up to $7 million by the end of his time with them. He collected around $11 million playing for the Knicks until 2010.\n\nSecondly, he played for the Golden State Warriors from the 2010-11 season to 2015, from which he made most of his earnings playing in the NBA. He earned around $52 million from his games with the Warriors.\n\nIn addition, he made some more amount playing for other clubs such as Boston Celtics, Dallas Mavericks, and San Antonio Spurs.\n\nHe collected around $95 million from his overall NBA career. You can find out more about his salary details on hoopshype.com.\n\nDavid Lee | Wife & Kids\n\nDavid Lee is married to the Danish former professional tennis player, Caroline Wozniacki. Lee met her in 2015 at a dinner party in the United States where their mutual friend had introduced them to each other.\n\nSince both Lee and Wozniacki were massive stars, they knew each other very well, however not personally. After that, they remained in touch and soon became good friends.\n\nIn 2015, Wozniacki was getting out of a hangover from her previous relationship with North Irish golfer Rory Mcllroy when Lee came into her life at just the right time and provided her firm support.\n\nIn 2017, on Valentine’s Day, she announced that she was in a relationship with Lee through her social media handles to her fans. Eventually, after dating for around two years, they got engaged in 2017 and married on June 16, 2019.\n\nThey went to Tuscany, Italy, for their wedding, where various well-known personalities such as Jesse Palmer, Harrison Barnes, etc., were invited. Carolina’s friends, including tennis players Serena Williams, Angelique Kerber, etc., were her bridesmaids.\n\nWozniacki is considered one of the best tennis players of the modern times who ranks fifth in all-time best prize money winners. She had remained on top in the world ranking for about 71 weeks in the early 2010s.\n\nHowever, now that both husband and wife have retired from their playing career, they live comfortably with their daughter in their Fisher Island residence. Their daughter, Olivia, was born on June 11, 2021.\n\nAge, Weight & Height\n\nAs of 2023, David Lee is 40 years old.\n\nHe stands 2.06 meters (6 feet 9 inches) tall and weighs around 245 lb (111 kg) about his physical stats.\n\nEnes Kanter is a Swiss-born American athlete who has made a net worth of nearly $55 million playing regularly for around eleven years in the NBA. Read his story!\n\nSocial Media Presence\n\nInstagram: @davidlee\n\nTwitter: @Dlee042\n\nInteresting Facts\n\nDavid Lee was naturally a left-hander, but he learned to play with his right hand after injuring his left arm during his sophomore season in high school.\n\nHe was initially interested in tennis and played it eagerly until he was twelve.\n\nLee’s grandfather, Desmond, whom he called “Desi,” was a renowned philanthropist who had contributed money worth $70 million for various causes before his death at age 92.\n\nFrequently Asked Questions\n\nWas David Lee good at basketball?\n\nYes, David Lee was pretty good at playing basketball. He was particularly good at rebounding, but he was also an excellent scorer in the prime of his career.\n\nHe retired from his playing career in 2017, averaging 13.5 points and 8.8 rebounds per game throughout his overall NBA career.\n\nDid David Lee play volleyball?\n\nNo, David Lee did not play volleyball. He mostly enjoyed playing tennis besides basketball. However, another player named David Cameron Lee, also known as David Lee, plays professional volleyball for the Indian volleyball League club, Calicut Heroes."}, {"url": "https://simple.wikipedia.org/wiki/Charles_Barkley", "page_content": "Charles Wade Barkley (born February 20, 1963) is an American former professional basketball player. Nicknamed \"Sir Charles\" for his aggressive and outspoken behavior, and \"The Round Mound of Rebound\" for his unusual build and talent as a player, Barkley established himself as one of the National Basketball Association's (NBA) most dominating power forwards.\n\nFor a power forward, Barkley had an extremely versatile offensive game. He was not considered a great player at the defensive end. He is referred to as Chuck Barkley by many of his friends.\n\nBarkley had many nicknames over the course of his college and pro career, making him one of the basketball players, and persons, with the most nicknames. Some of the other nicknames include \"The Chuckster\" and \"The Chuck Wagon\". Barkley is regarded as one of the best rebounders in the history of the game.\n\nMany people view him as the greatest player who did not win an NBA championship during his career, although others argue for players such as Karl Malone, John Stockton and Patrick Ewing. Often considered the best power forward in the league (NBA), people did not agree with his totalitarian views. He is an analyst on the television show Inside the NBA. The program features host Ernie Johnson with analysts Kenny Smith and Shaquille O'Neal.\n\nOther websites [ change | change source ]\n\n\n\n\n\n\n\n"}, {"url": "https://www.webofbio.com/charles-barkley/", "page_content": "Who is Charles Barkley?\n\nBorn on February 20, 1963, Charles is an American retired professional basketball player who is an analyst on Inside the NBA. Although his real name is Charles Wade Barkley, he is known by the nicknames “Sir Charles”, “Chuck”, and “the Round Mound of Rebound”.\n\nFurthermore, Barkley was an 11-time member of the All-NBA Team, 11-time NBA All-Star, and the 1993 NBA Most Valuable Player (MVP). In addition to this, he was recognized as one of the 50 Greatest Players in NBA History during the NBA’s 50th anniversary. Charles Barkley got his first official signature shoe: The Air Force Max CB, a super heavy shoe built like a tank.\n\nAbout Info Full Name Charles Wade Barkley Profession Former Basketball Player Popular For Basketball player\n\nBirthday and Zodiac\n\nAge (As of 2022) 59 years old Date of Birth February 20, 1963 Zodiac Sign Pisces Birth Place Leeds, Alabama Nationality American Ethnicity Black\n\nEducation\n\nSchool/University Leeds High School, Auburn University\n\nPhysical Stats\n\nHeight 6 feet 6 inches Eye Color Dark Brown Weight 114 kg\n\nNet Worth\n\nEstimated net Worth $50 million\n\nFamily and Relationship\n\nFather Frank Barkley Mother Charcey Glenn Wife Maureen Blumhardt Children Christiana Siblings John Glenn Barkley and Darryl Barkley\n\nSocial media\n\nSocial Media Instagram\n\nCharles Barkley Biography TimeLine\n\nCharles Barkley is a retired American professional basketball player and current television personality. He was born on February 20, 1963, in Leeds, Alabama. Barkley was a standout player at Auburn University before being drafted by the Philadelphia 76ers in 1984. He went on to have a successful 16-year career in the NBA, playing for the 76ers, Phoenix Suns, and Houston Rockets. After retiring from basketball, Barkley became a popular television commentator known for his colourful personality and candid opinions.\n\nFebruary 20, 1963: Charles Barkley is born in Leeds, Alabama.\n\nCharles Barkley is born in Leeds, Alabama. 1981-1984: Barkley plays basketball at Auburn University.\n\nBarkley plays basketball at Auburn University. June 19, 1984: Barkley is drafted by the Philadelphia 76ers as the fifth overall pick in the NBA draft.\n\nBarkley is drafted by the Philadelphia 76ers as the fifth overall pick in the NBA draft. 1986-1992: Barkley is named an NBA All-Star six times while playing for the 76ers.\n\nBarkley is named an NBA All-Star six times while playing for the 76ers. July 1992: Barkley is traded to the Phoenix Suns.\n\nBarkley is traded to the Phoenix Suns. 1993: Barkley leads the Suns to the NBA Finals but loses to the Chicago Bulls.\n\nBarkley leads the Suns to the NBA Finals but loses to the Chicago Bulls. 1996: Barkley wins the NBA MVP award.\n\nBarkley wins the NBA MVP award. 1997: Barkley is traded to the Houston Rockets.\n\nBarkley is traded to the Houston Rockets. 1998-2000: Barkley plays for the Rockets before retiring from basketball.\n\nBarkley plays for the Rockets before retiring from basketball. 2000: Barkley begins working as a television commentator for TNT.\n\nBarkley begins working as a television commentator for TNT. 2006: Barkley is inducted into the Naismith Memorial Basketball Hall of Fame.\n\nBarkley is inducted into the Naismith Memorial Basketball Hall of Fame. 2016: Barkley receives the Curt Gowdy Media Award from the Naismith Memorial Basketball Hall of Fame for his work as a television commentator.\n\nBarkley receives the Curt Gowdy Media Award from the Naismith Memorial Basketball Hall of Fame for his work as a television commentator. 2021: Barkley announces that he has received the COVID-19 vaccine.\n\nCharles Barkley’s career in basketball spanned 16 years, during which he was known for his tenacity on the court and outspoken personality off the court. Following his retirement, Barkley transitioned into a career as a television commentator, where he continued to make headlines for his candid opinions and sense of humour. Despite occasionally stirring up controversy with his remarks, Barkley remains a beloved figure in basketball and beyond.\n\nEarly Life and Childhood\n\nCharles Barkley came into this world on February 20, 1963, in Leeds, Alabama, as the child of Charcey Glenn and Frank Barkley. Furthermore, he grew up with his two brothers, John Glenn Barkley and Darryl Barkley. From a young age, he was very interested in basketball, so he started his career as a basketball player as an adult. Talking about his educational qualifications, he attended Leeds High School.\n\nProfessional Life\n\nCharles Barkley joined Auburn University in 1981 and became a part of Auburn’s basketball program, the Auburn Tigers. In three years, it had an average of 14.8 points. Furthermore, he played in the NCAA Tournament for the first time, scoring 23 points in 1984.\n\nInstead of playing the senior season for Auburn, Charles made himself available for the 1984 NBA draft. Eventually, he was the fifth pick in the first round by the Philadelphia 76ers. During the first season of his professional basketball career, Barkley played 82 games, started 60, and scored average points of 14.0 per game. During the 1985-86 season, Barkley’s skills improved drastically under the guardianship of Malone. Due to his outstanding performance, he earned a spot in the All-NBA Second Team.\n\nIn the 1986-87 season, the 76ers traded Malone to the Washington Bullets, so Barkley stepped in as the team’s de facto leader. In addition, Charles played 68 matches scoring 23.0 points and 14.6 rebounds per game in his third season with the 76ers.\n\nBarkley played for the 76ers until the 1991-92 season, as he was traded to the Phoenix Suns in exchange for Tim Perry, Jeff Hornacek, and Andrew Lang. Due to his excellent leadership, the team went to the NBA finals but lost to Michael Jordan’s Chicago Bulls. Barkley was honoured with the Most Valuable Player accolade for his superb performance in 1993.\n\nUnfortunately, Charles suffered a ruptured left quadriceps match against the 76ers on December 8, 1999. Due to this injury, he retired from his basketball career. However, to play the last game of his career, he appeared in a home game against the Vancouver Grizzlies on April 19, 2000. We can find detailed stats of his game throughout his career on Wikipedia and several other online sites. Moreover, it is revealed that Barkley will appear as a shark on a reality show named “Shark Tank”. Not to mention, Charles Barkley also appeared as a guest in an episode of a presentation titled “Suit”. Although he has earned many achievements throughout his career, he has never won any championship rings.\n\nPersonal Life\n\nTalking about his personal life, Charles Barkley is a married man who tied the knot with Maureen Blum Hardt in 1989. The beautiful couple was blessed with a daughter, Christiana, the same year.\n\nOn March 26, 1991, during the match against the New Jersey Nets, an audience member started to hiss at him with racial slurs. So, Barkley lost his temper and tried to spit on the person, but it landed on a little girl. Due to this incident, he was suspended without pay for a game and fined $10,000. After that, Barkley apologized to the girl and her parents, often sending them tickets to the fun.\n\nHeight, Weight, and Body Measurements\n\nAs for his body measurements, he stands at the height of 1.98 meters in feet, equal to 6 feet 6 inches and weighs around 114 kg. He is an athlete, so he regularly exercises and workouts to maintain his fit and healthy body.\n\nNet Worth and social media\n\nCharles is a former professional basketball player and has earned a decent amount of money throughout his career. According to some trusted online sources, Charles has amassed a considerable net worth of $50 million, with which he lives a lavish life.\n\nCharles is only available on Instagram under the username @officialcharlesbarkley, with over 5k followers.\n\nTrivia\n\nMoreover, it is revealed that Barkley will appear as a shark on a reality show named “Shark Tank”.\n\nAlthough he has earned many achievements throughout his career, he has never won any championship rings.\n\nCharles has amassed a considerable net worth of $50 million, with which he lives a lavish life.\n\nCharles Barkley came into this world on February 20, 1963, in Leeds, Alabama, as the child of Charcey Glenn and Frank Barkley.\n\nNot to mention, Charles Barkley also appeared as a guest in an episode titled “Suit”.\n\nCharles Barkley got his first official signature shoe: The Air Force Max CB, a super heavy shoe built like a tank.\n\nFrequently Asked Questions"}, {"url": "https://www.jsonline.com/story/sports/nba/bucks/2022/08/30/milwaukee-bucks-coach-charles-lee-part-unbelievable-experience-nbas-basketball-without-borders-camp/7938617001/", "page_content": "Charles Lee sat down to eat lunch on Saturday, which is normal under most circumstances.\n\nThis time, however, the pyramids of Giza served as a backdrop.\n\n“Just…remarkable that I’m able to experience this,” the Milwaukee Bucks coach said over the phone from Egypt on Tuesday.\n\nLee arrived in Africa on Aug. 27 to tour the pyramids and Sphinx in advance of the NBA’s Basketball Without Borders camp in Cairo with a host of coaches and players, including an event-record five head coaches in Golden State’s Steve Kerr, Portland’s Chauncey Billups, Washington’s Wes Unseld Jr., Minnesota’s Chris Finch and New Orleans’ Willie Green.\n\nIt is the 18th installment of the program and something Lee had wanted to do for some time.\n\n“I’ve always wanted to be part of this initiative and event because of what it does just for our game and what it’s doing for kids in Africa and giving them the resources and the experience to get some quality coaching, some quality game reps and some quality teaching in a four-day period,” he said. “This whole thing has just been an unbelievable experience for me to be a part of.”\n\nAside from coaching star power, a handful of players are participating such as former Bucks rookie of the year Malcolm Brogdon. Lee said some of the players have never traveled outside of their home areas, which he said has created a unique atmosphere from most camps.\n\nMore:A Christmas Day game vs. the Boston Celtics and a star-powered opening night matchup highlight the Bucks' 2022-23 schedule\n\nMore:Milwaukee Bucks preseason schedule released, highlighted by two games in Abu Dhabi\n\n“This thing is like,” he paused to try and collect the words before laughing, “they come in every day excited, high-fiving, looking forward to just getting more and more teaching and attention.\n\n“The thing that stands out for me is that this is a once-in-a-lifetime opportunity for these top basketball players between the ages of 15 and 17 in Africa to get some exposure, to get some experience, to travel the continent and to have their dream of playing in the NBA kind of start here at this camp because they think this is the exposure, the experience they need to all of a sudden take their game to another level. For me, I haven’t been a part of an outreach program that is quite on this level.”\n\nThe camp drew the top 64 male and female athletes from the continent of Africa, with 14 players from NBA Academy Africa and six from the NBA Academy Africa Women’s Program. The NBA said 41 Basketball Without Borders camp alumni were on opening night rosters last season.\n\nWhen he returns to Milwaukee and the Bucks resume formal work with the start of training camp at the end of September, Lee will be bringing more than photos and stories back from the offseason – he has a new title as associate head coach.\n\nThe 37-year-old was promoted when Darvin Ham accepted the head coaching job of the Los Angeles Lakers. Lee has signed a multi-year contract to remain with the Bucks under head coach Mike Budenholzer. Like Ham, Lee had been interviewed for head coaching vacancies the last few seasons.\n\n“It’s been an exciting offseason knowing that I’m going to be coming back to an organization that’s a championship-caliber organization with people that I respect highly,” Lee said. “And the fact that I compete with these players, with this coaching staff, it’s been an exciting summer. I’m really happy for Darvin but I’m also looking forward to the opportunity to continue to grow as a coach.”\n\nThe 2022-23 season will be Lee’s fifth in Milwaukee and ninth overall with Budenholzer.\n\n“The most important thing is that no matter what the title is, I’ve been doing a lot of the responsibilities,” Lee said. “I have to continue to be me, continue to just work really hard and continue to just be the same person I’ve been and help continue to teach and send the same message that coach ‘Bud’ is delivering on a day-to-day basis. I’m a loyal, faithful servant to the team and that’s all I gotta do. You’re preparing yourself for this for a while so nothing changed that much.”"}, {"url": "https://www.britannica.com/biography/Charles-Barkley", "page_content": "Charles Barkley is an American professional basketball player and television personality. He was named one of the 50 greatest players in NBA history in 1996. He became the fourth player to amass 20,000 points, 10,000 rebounds, and 4,000 assists over his 16-year NBA career.\n\nCharles Barkley, in full Charles Wade Barkley, bynames Sir Charles and the Round Mound of Rebound, (born February 20, 1963, Leeds, Alabama, U.S.), American professional basketball player and television personality whose larger-than-life character made him one of the most popular figures in National Basketball Association (NBA) history. Over the course of his 16-year NBA career, he became the fourth player to amass 20,000 points, 10,000 rebounds, and 4,000 assists.\n\nBarkley was a nondescript high school basketball player until a 6-inch (15-cm) growth spurt helped him become one of the better players in Alabama during his senior year and earn a scholarship to Auburn University. He was an all-conference selection in each of his three seasons at Auburn, and in 1984 he was chosen by the Philadelphia 76ers with the fifth overall pick of the NBA draft. Listed at 6 feet 6 inches (1.98 metres) tall but by most accounts about 2 inches (5 cm) shorter, Barkley was very undersized for a forward, but his great leaping ability and his skill at establishing position around the basket using his considerable strength quickly made him one of the elite rebounders in the game. He made the first of 11 consecutive All-Star Game appearances in 1987, but the 76ers’ success as a team was limited. With the exception of a run to the Eastern Conference finals during his rookie season (on a team led by future Hall of Famers Julius Erving and Moses Malone), Barkley and the 76ers never advanced farther than the second round of the play-offs during his eight seasons in Philadelphia. His inability to get the 76ers a championship led some to question whether he should be considered a truly elite player. Coupling this with Barkley’s outspokenness, which made him unpopular with the team’s front office, the team decided to trade him to the Phoenix Suns in 1992.\n\nBritannica Quiz NBA Postseason 2021 Quiz\n\nAfter helping the Suns post the NBA’s best record in his first season with the team, Barkley won the league’s Most Valuable Player award. In the following postseason he led the Suns to the NBA finals, a six-game loss to the Chicago Bulls. That season was the highlight of Barkley’s tenure in Phoenix, and in 1996 he was traded to the Houston Rockets. He again had an immediate positive impact on a franchise, as the Rockets reached the conference finals in the 1996–97 season. However, Barkley failed to win his long-sought championship in Houston, and he retired in 2000.\n\nBarkley was a member of two U.S. men’s basketball teams that won Olympic gold medals (1992, 1996). He was named one of the 50 greatest players in NBA history in 1996, and he was inducted into the Naismith Memorial Basketball Hall of Fame in 2006.\n\nBarkley’s postretirement fame arguably surpassed that of his playing days. Always a popular pitchman, he continued to appear in commercials for a wide variety of products after he last stepped off a court. But he was best-known as a commentator on an award-winning NBA studio show on the Turner Network Television cable channel and as a frequent talk show guest. Beginning with his years as a player, Barkley was never shy about expressing his opinions—often with a large dose of humour—which helped him create a persona that transcended the basketball world."}, {"url": "https://www.biography.com/athletes/michael-jordan", "page_content": "1963–present\n\nWho Is Michael Jordan?\n\nMichael Jordan is a former professional basketball player, American Olympic athlete, businessperson, and actor. Considered one of the best basketball players ever, he dominated the sport from the mid-1980s to the late 1990s. Jordan led the Chicago Bulls to six NBA championships and earned the league’s MVP Award five times. With five regular-season MVPs and three All-Star MVPs, Jordan became the most decorated player in the NBA.\n\nQuick Facts\n\nFULL NAME: Michael Jeffrey Jordan\n\nBORN: February 17, 1963\n\nBIRTHPLACE: Brooklyn, New York\n\nSPOUSES: Juanita Vanoy (1989–2006), Yvette Prieto (2013–present)\n\nCHILDREN: Jeffrey, Marcus, Jasmine, Ysabel, and Victoria\n\nASTROLOGICAL SIGN: Aquarius\n\nEarly Life and Family\n\nMichael Jeffrey Jordan was born on February 17, 1963, in Brooklyn, New York. His mother, Deloris, was a bank teller who has since written several books. His father, James, was a maintenance worker turned manager at General Electric. Jordan, the fourth child of Deloris and James, has four siblings: James Jr. (known as Ronnie), Deloris, Larry, and Roslyn.\n\nRelated Story The Best Books About Michael Jordan\n\nGrowing up in Wilmington, North Carolina, Jordan developed a competitive edge at an early age. It was James who introduced his son Michael to baseball and built a basketball court in their backyard. Michael idolized his brother Larry, and the two would often play one-on-one into the night. Michael wanted to win every game he played.\n\n\n\nJordan attended Laney High School in Wilmington. He was notably assigned to the school’s junior varsity basketball team as a sophomore—he was still under 6 feet tall then—before developing into one of the country’s top recruits.\n\nDuring a basketball camp in the summer of 1980, Jordan grabbed the attention of legendary University of North Carolina at Chapel Hill head coach Dean Smith and his staff. He signed his letter of intent with the school in 1981.\n\n\n\nplay icon The triangle icon that indicates to play\n\nCollege Career\n\nJordan enrolled at North Carolina in 1981 and soon became an important member of the university’s basketball team. UNC won the NCAA Division I championship in 1982, with Jordan scoring the final basket needed to defeat Georgetown University. He was also singled out as the NCAA College Player of the Year in 1983 and in 1984.\n\nJordan left college after his junior year to join the NBA in 1984. In 1986, Jordan finished his bachelor’s degree in geography as he continued to play basketball professionally.\n\nProfessional Basketball Career\n\nMichael Jordan plays for the Chicago Bulls during the 1997 NBA playoffs. Getty Images\n\nThe 6-foot-6 Jordan began his professional basketball career when he was drafted by the Chicago Bulls in 1984. He was the third overall pick, behind Hakeem Olajuwon, who was selected first by the Houston Rockets, and Sam Bowie, taken by the Portland Trail Blazers; the draft also featured legendary players John Stockton and Charles Barkley.\n\nJordan soon proved himself on the court. He helped the Bulls make the playoffs and scored an average of 28.2 points per game that season. For his efforts, Jordan received the NBA Rookie of the Year Award and was selected for the All-Star Game.\n\nAlthough his second season was marred by injury, he broke new ground on the court during the 1986-87 season. He became the first player since Wilt Chamberlain to score more than 3,000 points in a single season. By the late 1980s, the Chicago Bulls were quickly becoming a force to be reckoned with, and Jordan was an instrumental part of the team’s success.\n\nThe Bulls made it to the Eastern Conference Finals in 1990 and won their first NBA championship the following year by defeating the Los Angeles Lakers. Jordan was well known by then for his superior athleticism on the court and for his leadership abilities.\n\nIn 1992, the Chicago Bulls beat the Portland Trail Blazers to win their second NBA championship. The team took their third championship the following year, dominating in the basketball world.\n\nFollowing the 1993 death of his father and a short stint in minor league baseball, Jordan returned to the basketball court and the Bulls in March 1995. He came back even stronger the following year, averaging 30.4 points per game to lead the Bulls to a then-record 72 regular-season wins before they defeated the Seattle SuperSonics for the NBA championship.\n\nChicago nearly matched the previous year’s record with 69 wins in 1996-97, a season that ended with a Game 6 win over the Utah Jazz in the NBA Finals. The two teams faced each other again for the championship in 1998, with Jordan sinking the winning shot in Game 6 to claim his sixth and final title. In addition to those six rings, Jordan won each of his five league MVP awards with Chicago.\n\nAfter his second retirement from basketball in 1999, Jordan joined the Washington Wizards in 2000 as a part owner and as president of basketball operations. In the fall of 2001, Jordan relinquished these roles to return to the court once more. He played for the Wizards for his final two NBA seasons.\n\nJordan’s Jersey Numbers\n\nJordan is most famous for donning No. 23 during the majority of his career. He once said the number was a reference to brother Larry, as it was roughly half of his elder sibling’s high school number 45.\n\nJordan did wear 45 upon his 1995 return to the NBA because 23 was the number his late father knew him by, and he wanted a new beginning. That lasted only a couple months before Jordan switched back to 23 during the 1995 playoffs.\n\nJordan famously wore No. 12 for one game on February 14, 1990, because his jersey had been stolen. The Bulls didn’t have a backup and tried to locate a 23 jersey in the stands that would fit Jordan but couldn’t. The temporary change didn’t affect his performance, as Jordan scored 49 points in a loss to the Orlando Magic.\n\nOlympics\n\nDuring the summer of 1984, Jordan made his first appearance at the Olympic Games as a member of the U.S. Olympic basketball team. The team of college amateurs won the gold at the games that year, which were held in Los Angeles.\n\nJordan later helped the American team bring home the gold medal at the 1992 Olympic Games, held in Barcelona, Spain. The U.S. squad featured professional players for the first time that year, including Larry Bird, Magic Johnson, and Jordan, and became known as the “Dream Team.”\n\nRelated Story How NBA Legends Led the Dream Team to Olympic Gold\n\nAwards and Honors\n\nIn 1988, Jordan received his first MVP Award from the NBA, an honor he would earn four more times, in 1991, 1992, 1996, and 1998.\n\nIn April 2009, Jordan received one of basketball’s greatest honors: He was inducted into the Naismith Memorial Basketball Hall of Fame. Attending the induction ceremony was a bittersweet affair for Jordan because being at the event meant “your basketball career is completely over,” he explained.\n\nIn 2016, Jordan was presented with the Presidential Medal of Freedom by President Barack Obama.\n\nStats\n\nHere is a rundown of Jordan’s NBA career averages and totals, according to Basketball Reference:\n\nCareer Averages\n\nMinutes: 38.3\n\nField Goal Percentage: 0.497\n\n3-Point Field Goal Percentage: 0.327\n\nFree Throw Percentage: 0.835\n\nOffensive Rebounds Per Game: 1.6\n\nDefensive Rebounds Per Game: 4.7\n\nAssists Per Game: 5.3\n\nSteals Per Game: 2.3\n\nBlocks Per Game: 0.8\n\nTurnovers Per Game: 2.7\n\nPersonal Fouls Per Game: 2.6\n\nPoints Per Game: 30.1\n\nCareer Totals\n\nGames: 1,072\n\nGames Started: 1,039\n\nMinutes: 41,011\n\nField Goals Made: 12,192 of 24,537 attempts\n\n3-Point Field Goals Made: 581 of 1,778 attempts\n\nFree Throws Made: 7,327 of 8,772 attempts\n\nOffensive Rebounds: 1,668\n\nDefensive Rebounds: 5,004\n\nTotal Rebounds: 6,672\n\nAssists: 5,633\n\nSteals: 2,514\n\nBlocks: 893\n\nTurnovers: 2,924\n\nPersonal Fouls: 2,783\n\nPoints: 32,292\n\nRetirements from Basketball\n\nJordan retired from the sport three times over the span of his 19-year professional career. He first stepped away on October 6, 1993, at age 30 to pursue a career in baseball following the death of his father. In July of that year, James was murdered when two teenagers shot him in his car in an apparent robbery as he was driving from Charlotte to Wilmington, North Carolina. He was missing for 23 days until his body was found in a swamp in McColl, South Carolina. The teens were later tried and convicted of the crime and received life sentences for first-degree murder.\n\nJordan retired from the Bulls again on January 13, 1999, at age 35 before eventually returning to the court with the Wizards. He finally hung up his jersey for good at age 40 on April 16, 2003.\n\nBaseball\n\nMichael Jordan plays baseball for the Birmingham Barons in August 1994. Getty Images\n\nIn a move that shocked many, after the end of the 1992-93 basketball season, Jordan announced his retirement from basketball to pursue baseball. For one year in 1994, Jordan played for the Birmingham Barons, a minor league affiliate of the Chicago White Sox, as an outfielder.\n\nThis decision came shortly following the murder of Jordan’s father, who always wanted him to play baseball. He had last played baseball as a high school senior in 1981.\n\n“You tell me I can’t do something, and I’m going to do it,” Jordan said.\n\nDuring his short career in baseball, which many fans considered a whim, Jordan had a rather dismal .202 batting average. However, many of the people who worked with him at the time an extremely dedicated player with potential.\n\n“He had it all: ability, aptitude, work ethic. He was always so respectful of what we were doing and considerate of his teammates. Granted, he had a lot to learn,” former Barons manager . “I do think with another 1,000 at-bats, he would’ve made it. But there’s something else that people miss about that season. Baseball wasn’t the only thing he picked up. I truly believe that he rediscovered himself, his joy for competition. We made him want to play basketball again.”\n\nAfter his season with the Barons, Jordan went to the Arizona Fall League to play for the Scottsdale Scorpions. After hitting .252 and naming himself the team’s “worst player,” he returned to the NBA in March 1995 with a two-word press release: “I’m back.”\n\nJordan’s Business Ventures\n\nOutside of his career in basketball, Jordan has been involved in a number of profitable business and commercial ventures, including a longtime partnership with Nike. Jordan signed his first deal with Nike in 1984. The company launched its signature Air Jordan basketball sneakers in 1985. In its initial contract, Nike gave Jordan a generous 25 percent in royalties.\n\nThe Air Jordan quickly proved very popular, and it continues to be a best-seller for the apparel maker more than 30 years later. The collaboration mints money for Nike and Jordan, with Nike reporting nearly $2.9 billion in revenue for the Air Jordan line in 2018.\n\nThe story of Jordan’s partnership with Nike is the subject of the 2023 biographical drama Air, which stars Ben Affleck as Nike founder Phil Knight and Matt Damon as marketing executive Sonny Vaccaro.\n\nOver the years, Jordan has signed a number of other endorsement deals with brands like Hanes, Upper Deck, Gatorade, Coca-Cola, McDonald’s, Chevrolet, and Wheaties. The Gatorade partnership featured a memorable ad campaign encouraging kids and adults to “Be Like Mike.”\n\nIn 1998, Jordan launched into the restaurant business as the owner of Michael Jordan’s The Steak House N.Y.C. Designed to reflect Jordan’s tastes and style, this typical steakhouse seated 150 and 60 at the bar, occupying 7,000 square feet in Grand Central Terminal, before closing in late 2018.\n\nAs of April 2023, there are four Michael Jordan’s Steak House locations: in Chicago; in Oak Brook, Illinois; at the Mohegan Sun casino in Uncasville, Connecticut; and at the Ilani Casino in Ridgefield, Washington.\n\nPart Owner of the Charlotte Hornets\n\nIn 2006, Jordan bought a share of the Charlotte Hornets (formerly known as the Bobcats) and joined the team’s executive ranks as its managing member of basketball operations. In 2010, he became the majority owner of the Charlotte Hornets and serves as the team’s chairman.\n\nImproving the team’s less-than-stellar record seemed to be Jordan’s priority. In November 2012, he told ESPN: “I don’t anticipate getting out of this business. My competitive nature is I want to succeed. It’s always been said that when I can’t find a way to do anything, I will find a way to do it.” While the Hornets’ on-court record wasn’t hugely successful—they failed to make the playoffs six straight seasons from 2016 through 2022—the organization has grown from a $175 million valuation in 2006 to $1.7 billion as of October 2022.\n\nIn March 2023, that Jordan was in talks to sell his majority stake in the franchise to a group led by two NBA minority owners. If completed, Jordan is expected to maintain a minority stake in the team.\n\nJordan’s NASCAR Team\n\nMichael Jordan watches a 2021 NASCAR event in Pennsylvania from his 23XI Racing team’s pit box. Getty Images\n\nIn 2020, Jordan partnered with NASCAR driver Denny Hamlin to form the 23XI Racing team. The name is a reference to Jordan’s basketball number and Hamlin’s No. 11 race car.\n\nJordan is a longtime NASCAR fan and grew up watching legends of the sport like Richard Petty, Cale Yarborough, and Dale Earnhardt. Hamlin is a Jordan brand athlete and fan of the Charlotte Hornets, so the two were friends before the NASCAR partnership.\n\nThe team debuted in the 2001 Daytona 500 with Bubba Wallace driving the No. 23 car. Wallace picked up the team’s first NASCAR Cup victory later that season on October 4 at Talladega Superspeedway in Alabama.\n\nThe team expanded to two cars for the 2022 season, with former champion Kurt Busch driving the No. 45 car. Busch and Wallace each won a race at Kansas Speedway that year. Tyler Reddick replaced Busch in the 45 for the 2023 season and quickly gave the team a fourth race win at Circuit of the Americas.\n\nNet Worth\n\nForbes listed Jordan’s net worth at $2 billion as of April 3, 2023. According to Sportico, he is the highest paid athlete of all time.\n\nCharity\n\nFrom 2001 through 2014, Jordan hosted an annual charity golf event known as the Michael Jordan Celebrity Invitational, with proceeds benefiting foundations including Make-A-Wish, Cats Care, the James R. Jordan Foundation, Keep Memory Alive, and Opportunity Village.\n\nThe four-day tournament and celebration attracted celebrity participants, including Wayne Gretzky, Michael Phelps, Chevy Chase, Samuel L. Jackson, and Mark Wahlberg.\n\nIn 2023, Jordan made a $10 million donation to the Make-A-Wish Foundation—the largest by an individual in its history—in honor of his 60th birthday.\n\nWives and Children\n\nIn 1989, Jordan married Juanita Vanoy. The couple had three children together: Jeffrey, Marcus, and Jasmine. After 17 years of marriage, they divorced in December 2006.\n\nOn April 27, 2013, Jordan married 35-year-old Cuban American model Yvette Prieto in Palm Beach, Florida. Tiger Woods, Spike Lee, and Patrick Ewing, among other celebrities, reportedly attended the wedding ceremony. The couple welcomed twin daughters, Victoria and Ysabel, in February 2014.\n\nJordan and Juanita’s two sons, Jeffrey and Marcus, both played basketball in college and had dreams of making it to the NBA.\n\nJeffrey joined the basketball team at the University of Illinois in 2007. Both Jordan and his ex-wife, Juanita, supported their son and tried to help him deal with playing in the shadow of an NBA legend. “The thing that we have tried to tell Jeff is that you set your own expectations. By no means in this world can you ever live up to someone else’s expectations of who you are,” Jordan said during an appearance on the Today show.\n\nJeffrey played for the University of Illinois for three seasons, from 2007 to 2010. He then played for the University of South Florida for one season, from 2011 to 2012, before retiring from basketball. He later entered a management training program at Nike.\n\nJordan’s younger son, Marcus, played basketball for the UCF Knights, for three seasons from 2009 to 2012. He went on to open a basketball shoe and apparel store in Florida. “They wanted to be like their dad. What boy doesn’t? But they both got to a point where they said, ‘We’re not going to the NBA,’” Juanita said in 2013.\n\nMichael Jordan in Pop Culture\n\nMichael Jordan in Space Jam Everett\n\nJordan made a big splash as the lead actor in the 1996 movie Space Jam. The film mixed live action and animation and paired Jordan with Looney Tunes legends Bugs Bunny and Daffy Duck on screen. Jordan did not appear in the 2021 sequel Space Jam: A New Legacy, which features LeBron James.\n\nJordan and the 1997-98 Bulls were the subject of the 2020 documentary The Last Dance, co-produced by Netflix and ESPN Films. ESPN aired the 10-part series after the COVID-19 pandemic halted the 2019-20 NBA season, and it became a must-watch for basketball fans. Along with featuring archival footage of Jordan and interviews with teammates and opponents, The Last Dance explored the tension between the Bulls front office and its peerless superstar over his final triumphant year with the team.\n\nJordan has also appeared on the cover of the popular NBA 2K video game franchise four times, including as recently as 2022.\n\nA photograph of Jordan in tears during his 2009 induction into the Hall of Fame turned into a popular internet meme called “Crying Jordan,” in which Jordan’s teary face is superimposed on pictures of other people suffering mishaps.\n\nQuotes\n\nYou have to expect things of yourself before you can do them.\n\nBy no means in this world can you ever live up someone else’s expectations of who you are.\n\nMy competitive nature is I want to succeed. It’s always been said that when I can’t find a way to do anything, I will find a way to do it.\n\nI’ve reached the pinnacle of my career. I just feel that I don’t have anything else to prove.\n\nI can accept failure. Everyone fails at something. But I can’t accept not trying.\n\nLimits, like fear, is often an illusion.\n\n[A]t the end of the day, the team’s got to go out and play. I think the players win the championship, and the organization has something to do with it, don’t get me wrong. But don’t try to put the organization above the players.\n\nThe game of basketball has been everything to me. My place of refuge, place I’ve always gone where I needed comfort and peace. It’s been the site of intense pain and the most intense feelings of joy and satisfaction. It’s a relationship that has evolved over time, given me the greatest respect and love for the game.\n\nI try to be a role model for Black kids, white kids, yellow kids, green kids.\n\nEnjoy every minute of life. Never second-guess life.\n\nI always thought I would be a professional athlete. I always loved sports. I knew one thing I didn’t want was a job. Me and working were never best friends. I enjoyed playing.\n\nFact Check: We strive for accuracy and fairness. If you see something that doesn't look right, contact us!"}]}