{"Stereophonics have been nominated for five Brit Awards.": [{"url": "https://www.billboard.com/music/awards/2021-brit-award-nominees-full-list-9549017/#!", "page_content": "For the first time in the history of the Brit Awards, female solo artists account for four of the five albums nominated for album of the year (branded Mastercard album).\n\nArlo Parks, Celeste, Dua Lipa and Jessie Ware are vying for the award, along with one male contender, J Hus. The nominations were announced on Wednesday (March 31).\n\nDua Lipa’s nominated album, Future Nostalgia, was also Grammy-nominated for album of the year, though it lost to Taylor Swift’s Folklore.\n\nLipa received three Brit nods this year, which put her in a five-way tie for the lead, along with the aforementioned Arlo Parks and Celeste; a male dance artist, Joel Corry, and a hip-hop group, Young T & Bugsey. Lipa is the only artist nominated for both the top album and single award.\n\nLipa could be headed for her second win for British single. She is nominated this year with “Physical.” She won two years ago for “One Kiss,” a collab with Calvin Harris. If she wins, she’ll join Adele as the only female artist to win twice in the category.\n\nAnother of this year’s nominees, Harry Styles, could also be headed for his second win in the category. He is nominated for “Watermelon Sugar.” As part of One Direction, he won in 2012 for “What Makes You Beautiful.” If he wins, he would join Robbie Williams as the only artists to win both solo and with a group. Williams won the award three times on his own and three times with Take That.\n\nCeleste, who won the Brits’ rising star award last year, is nominated for an Oscar for best original song for co-writing “Hear My Voice” from The Trial of the Chicago 7 with composer Daniel Pemberton. The Oscars will be presented April 25.\n\nRelated Griff Wins Brit Award for Rising Star Over Buzzy Finalist Rina Sawayama\n\nSeveral of this year’s nominees have won in those categories in the past. Foo Fighters, nominated for international group, are four-time winners in that category. The 1975, nominated for British group, are two-time winners in that category. Lipa, nominated for female solo artist, won in that category in 2018.\n\nThree of the nominees for international female artist have won previously in that category — Billie Eilish last year, Ariana Grande in 2019 and Swift in 2015. Bruce Springsteen is the only one of this year’s nominees for international male artist who has won previously in that category (in 1986).\n\nThe Brits reinstated the award for international group after a one-year lapse — BTS’ popularity might have had something to do with that — but tabled the category of British producer of the year this year.\n\nThe Brits are set to air on May 11, nearly 15 months after the last show, which was held on Feb. 18, 2020. It was one of the last major awards shows to air before COVID-19 shut down award shows and most other public gatherings for more than a year.\n\nComedian, actor and writer Jack Whitehall will host the show for the fourth year in a row. That equals James Corden’s four-year stint as host from 2011-14. Current plans are for the show to be held at the O2 Arena in London. Lipa and Griff are the first artists confirmed to perform on the show.\n\nThe eligibility period for this year’s Brit Awards was Dec. 13, 2019 to March 11, 2021.\n\nThe nominations were announced by Griff and BBC Radio 1’s Nick Grimshaw. They were announced across all @BRITs official social platforms (YouTube, Facebook, Twitter and Instagram).\n\nThe Brits have just 10 categories, one of which they already announced (Griff as the winner of the fan-voted rising star award). By contrast, the Grammys have had 84 categories the past five years.\n\nThe Brits have separate male and female categories for British solo artists and international [defined as non-British] solo artists. By contrast, the Grammys did away with gendered categories as part of a major 2011 category overhaul.\n\nAnd the Brits’ eligibility year ended March 11, just two months before the May 11 show. By contrast, the Grammys’ eligibility year ended on Aug. 31, 2019, more than six months before their March 14 show.\n\nThere are at least three other differences between the Brits and the Grammys. The nominees for British single with Mastercard are the top 10 singles from the eligibility period based on chart-eligible sales success. (Academy voter will determine the winner.) Grammy nominees are not based on charts. Also, six of these Brit awards have corporate sponsors. The Grammys have never sold naming rights. Finally, the Brits don’t count featured credits towards artists’ awards tallies; the Grammys do.\n\nRelated The 8 Best Moments From the 2020 Brit Awards\n\nSee the complete list of Brit Award nominees below.\n\nBritish Single with Mastercard (Supported by Capital FM)\n\n220 Kid & Gracey, “Don’t Need Love”\n\nAitch & AJ Tracey featuring Tay Keith, “Rain”\n\nDua Lipa, “Physical”\n\nHarry Styles, “Watermelon Sugar”\n\nHeadie One featuring AJ Tracey & Stormzy, “Ain’t It Different”\n\nJ Corry featuring Mnek, “Head and Heart”\n\nNathan Dawe featuring KSI, “Lighter”\n\nRegard & Raye, “Secrets”\n\nSimba featuring DTG, “Rover”\n\nYoung T & Bugsey featuring Heady One, “Don’t Rush”\n\nMastercard Album\n\nArlo Parks, Collapsed in Sunbeams\n\nCeleste, Not Your Muse\n\nDua Lipa, Future Nostalgia\n\nJ Hus, Big Conspiracy\n\nJessie Ware, What’s Your Pleasure\n\nFemale Solo Artist – in association with Amazon Music\n\nArlo Parks\n\nCeleste\n\nDua Lipa\n\nJessie Ware\n\nLianne LaHavas\n\nMale Solo Artist – in association with Amazon Music\n\nAJ Tracey\n\nHeadie One\n\nJ Hus\n\nJoel Corry\n\nYungblud\n\nBritish Group\n\nBicep\n\nBiffy Clyro\n\nLittle Mix\n\nThe 1975\n\nYoung T & Bugsey\n\nBRITs Rising Star supported by Radio 1 (fan-voted)\n\nGriff (winner)\n\nPa Salieu\n\nRina Sawayama\n\nBreakthrough Artist in association with TikTok\n\nArlo Parks\n\nBicep\n\nCeleste\n\nJoel Corry\n\nYoung T & Bugsey\n\nInternational Female Solo Artist\n\nAriana Grande\n\nBillie Eilish\n\nCardi B\n\nMiley Cyrus\n\nTaylor Swift\n\nInternational Male Solo Artist\n\nBruce Springsteen\n\nBurna Boy\n\nChildish Gambino\n\nTame Impala\n\nThe Weeknd\n\nInternational Group\n\nBTS\n\nFontaines D.C.\n\nFoo Fighters\n\nHaim\n\nRun the Jewels"}, {"url": "https://www.theguardian.com/music/2023/jan/12/brit-awards-2023-wet-leg-and-harry-styles-lead-male-dominated-nominations", "page_content": "A year after the Brit awards abandoned the gendered categories, the nominations for the replacement artist of the year prize are entirely male, comprising Central Cee, Stormzy, Fred Again, George Ezra and Harry Styles.\n\nThe awards ceremony, run by the British Phonographic Industry (BPI) did away with the best British male and best female awards in 2022 following criticism that the non-binary pop star Sam Smith would not be eligible for either prize despite their massive commercial success.\n\nThis year, Smith received a nomination for song of the year for Unholy – their collaboration with German pop star Kim Petras – and pop/R&B act, one of the genre categories first introduced in 2022, which will be decided via a public vote on TikTok from 19 January.\n\nStyles joins first-time nominees Wet Leg in leading the nominations for this year’s Brit awards with four nods apiece. The breakout Isle of Wight indie duo and the ubiquitous pop icon and former One Direction member will go head to head in the category for album of the year, joined by fellow multiple nominees the 1975, Stormzy and producer Fred Again.\n\nWet Leg had not yet released their debut album at the time of the 2022 Brit awards: their self-titled effort, released on the independent label Domino, was hailed by the Guardian as “a collection of 90s and 00s-era indie that is by turns dreamy, lush, hooky and thunderous, and layered with lyrics saturated with millennial disaffection, anxiety and overwhelm”. They have been nominated for five awards at this year’s Grammys, which takes place a week prior to the Brit awards.\n\nWomen-led acts made up 33% of the overall nominations. Following Wet Leg, the only other female artists to receive multiple nods are producer Eliza Rose, whose collaboration with Interplanetary Criminal, Baddest of Them All, was a smash hit in summer 2022, and saw her nominated for song of the year and best dance act; rock duo Nova Twins, nominated for group of the year and best alternative/rock act, and songwriter Cat Burns, nominated for song of the year and best pop/R&B act.\n\nEliza Rose and Interplanetary Criminal: BOTA – video\n\nLast year, Little Simz won the best new artist prize, despite having released her debut album six years prior; however, she only became eligible for the award after her 2021 album Sometimes I Might Be Introvert became her first to place in the UK albums chart, reaching No 4. This year, the rapper Kojey Radical appears in a similar position: he has been active since 2014, but his 2022 album Reasons to Smile was his first chart placing, reaching No 11.\n\nThe best new artist category is also notable for the inclusion of British-Japanese pop star Rina Sawayama. In 2020, she highlighted that she would be ineligible for the Brit awards and the Mercury prize, both run by the British Phonographic Industry (BPI): born in Japan and raised in the UK since the age of four, she does not hold a British passport but has indefinite leave to remain. In February 2021, the BPI changed the rules to stipulate that artists who have been permanently resident in the UK for five years will qualify for British categories. Sawayama was previously nominated for the 2021 Rising Star award.\n\nThere are first-time nominations for Wet Leg, Nova Twins, Bad Boy Chiller Crew, Eliza Rose, LF System, Kim Petras, Blackpink, Fireboy DML, Gayle, Jack Harlow, Lost Frequencies and Bonobo.\n\nIn the international categories, Beyoncé, Lizzo and Taylor Swift lead the pack with two nominations apiece.\n\nOther noteworthy nominations include Bradford bassline collective Bad Boy Chiller Crew, up for group of the year – and liable to add some welcome chaos to the live broadcast – Eurovision star Sam Ryder for best new artist, and Ed Sheeran and Elton John’s 2021 festive hit, Merry Christmas, for best song.\n\nBritish girl band Flo were previously announced as winners of the Rising Star award. The prizes for producer and songwriter of the year will be announced at a later date.\n\nThis year’s Brit awards will be presented by comedian Mo Gilligan and take place live at the London O2 Arena on 11 February. Wet Leg and Sam Smith, performing alongside Kim Petras, are the first live acts to be confirmed.\n\nBrit award nominations 2023\n\nMastercard album of the year\n\nThe 1975 – Being Funny in a Foreign Language\n\nWet Leg – Wet Leg\n\nHarry Styles – Harry’s House\n\nStormzy – This Is What I Mean\n\nFred Again – Actual Life 3\n\nArtist of the year\n\nCentral Cee\n\nFred Again\n\nGeorge Ezra\n\nHarry Styles\n\nStormzy\n\nCentral Cee: Let Go – video\n\nGroup of the year\n\nThe 1975\n\nArctic Monkeys\n\nBad Boy Chiller Crew\n\nNova Twins\n\nWet Leg\n\nBest new artist\n\nKojey Radical\n\nMimi Webb\n\nRina Sawayama\n\nSam Ryder\n\nWet Leg\n\nSong of the year with Mastercard\n\nAitch/Ashanti – Baby\n\nCat Burns – Go\n\nDave – Starlight\n\nEd Sheeran and Elton John – Merry Christmas\n\nEliza Rose/Interplanetary Criminal – BOTA\n\nGeorge Ezra – Green Green Grass\n\nHarry Styles – As It Was\n\nLewis Capaldi – Forget Me\n\nLF System – Afraid to Feel\n\nSam Smith and Kim Petras – Unholy\n\nInternational artist of the year\n\nBeyoncé\n\nBurna Boy\n\nKendrick Lamar\n\nLizzo\n\nTaylor Swift\n\nInternational group of the year\n\nBlackpink\n\nDrake and 21 Savage\n\nFirst Aid Kit\n\nFontaines DC\n\nGabriels\n\nInternational song of the year\n\nBeyoncé – Break My Soul\n\nDavid Guetta and Bebe Rexha – I’m Good\n\nFireboy DML and Ed Sheeran – Peru\n\nCarolina Gaitán, Mauro Castillo, Adassa, Rhenzy Feliz, Diane Guerrero and Stephanie Beatriz – We Don’t Talk About Bruno\n\nGayle – ABCDEFU\n\nJack Harlow – First Class\n\nLizzo – About Damn Time\n\nLost Frequencies/Calum Scott – Where Are You Now\n\nOneRepublic – I Ain’t Worried\n\nTaylor Swift – Anti-Hero\n\nJack Harlow: First Class – video\n\nAlternative/rock act\n\nThe 1975\n\nArctic Monkeys\n\nNova Twins\n\nTom Grennan\n\nWet Leg\n\nHip-hop, grime and rap act\n\nAitch\n\nCentral Cee\n\nDave\n\nLoyle Carner\n\nStormzy\n\nDance act\n\nBecky Hill\n\nBonobo\n\nCalvin Harris\n\nEliza Rose\n\nFred Again\n\nPop/R&B act\n\nCat Burns\n\nCharli XCX\n\nDua Lipa\n\nSam Smith\n\nHarry Styles"}, {"url": "https://www.radiox.co.uk/global-awards/stereophonics-honoured-global-special-award/", "page_content": "Stereophonics honoured with Global Special Award\n\namie Morrison, Adam Zindani, Kelly Jones and Richard Jones of Stereophonics during The Global Awards 2020. Picture: Dave J Hogan/Getty Images\n\nThe Welsh band were give a very special accolade at The Global Awards 2020... with tributes from celebrity fans including Sir Tom Jones.\n\nStereophonics have been honoured with the Global Special Award in recognition of their remarkable career which spans over 25 years and their contribution to music and entertainment.\n\nThe band - comprising frontman Kelly Jones, Richard Jones, Adam Zindani and Jamie Morrison - were given the accolade at The Global Awards 2020 with Very.co.uk, which took place at London's Eventim Apollo Hammersmith tonight (5 March). The band also closed the show with a 20 minute set that featured their hits Dakota, C'est La Vie, Bust This Town and Maybe Tomorrow.\n\nIn a special video, stars such as Sir Tom Jones and James Dean Bradfield from Manic Street Preachers paid tribute to the band's incredible career. Sir Tom said: \"\"All the best boys, congratulations. I remember when you were opening for someone else, but let's not get into that. You're from Cwmaman, I'm from Pontypridd. Big town, Pontypridd.\"\n\nIt was the second award for the Welsh band, who also walked home with Best Indie, beating off stiff competition from Sam Fender, The 1975, Twenty One Pilots and Florence + The Machine.\n\nStereophonics in 2018: Adam Zindani, Rchard Jones, Kelly Jones and Jamie Morrison. Picture: Andrew Whitton/Press\n\nHosted by Capital Breakfast’s Roman Kemp, Smooth Radio’s Kate Garraway and Classic FM and Smooth presenter Myleene Klass, The Global Awards celebrates the stars of music, news and entertainment across a wide range of genres.\n\nNow in its third year, the prestigious event brought together all Global’s radio stations including Capital, Heart, Smooth, Classic FM, LBC, Radio X, Capital XTRA and Gold with award categories reflecting the music, programmes, podcasts and news aired on Global’s radio stations and the Global Player app.\n\nThe glittering show featured spectacular live performances from some of the world’s biggest artists – Camila Cabello, Ellie Goulding, Tones And I, Aitch, Aled Jones & Russell Watson and was rounded off with a set by the heroes of the evening, Stereophonics.\n\nWhen Kelly Jones first started writing songs about his hometown of Cwmaman in Wales in the early 90s, he probably didn’t think his band Stereophonics would end up being one of the most successful British acts of the next few decades.\n\nThe trio of Kelly, Richard Jones (no relation) and the much-missed Stuart Cable tried to make it under the name Tragic Love Company, but it was as Stereophonics that they became the first band to be signed to the new label V2.\n\nStuart Cable, Kelly Jones and Richard Jones in Cwmaman In Wales 1997. Picture: Martyn Goodacre/Getty Images\n\nStereophonics burst onto the scene with the single Local Boy In The Photograph, a moving tale of life in South Wales, and the accompanying debut album, Word Gets Around, made the Top 10 in the summer of 1997.\n\nStereophonics - Local Boy In The Photograph\n\nA triple platinum seller, the LP would spawn the hits A Thousand Trees, More Life In A Tramp's Vest and Traffic.\n\nThe trio quickly established themselves as one of the key post-Britpop artists, headlining a huge show at Cardiff Castle in June 1998. Their second album Performance And Cocktails hitting the top of the album charts on its release in March 1999.\n\nIt was the first of five consecutive number 1 albums for Stereophonics - they also made the top with Keep the Village Alive in 2015 and Kind in 2019.\n\n2005's Language. Sex. Violence. Other? gave the world Stereophonics' first number one single: Dakota, a wistful, passionate tune that brought the Phonics to the US airwaves and beyond and went Platinum in the UK.\n\nStereophonics - Dakota (Official Video)\n\nStereophonics have gone on to have ten Top 10 singles, have sold over ten million albums across the world and have headlined Reading & Leeds, V, Isle Of Wight and Glastonbury festivals among many others.\n\n\n\nThey have won the BRIT Award for Best British Breakthrough Act and the Nordoff Robbins Silver Clef Icon Award.\n\nNow, Kelly, Richard, Adam Zindani and Jamie Morrison see in the 2020s with their eleventh studio album, Kind, a huge UK tour and festival appearances across Europe.\n\nThey are one of British rock's most respected, hard-working and loved bands with a back catalogue full of incredible songs like Just Looking, Maybe Tomorrow, Indian Summer and I Want To Get Lost In You."}, {"url": "http://awardsandwinners.com/winner/?mid=/m/015_8p", "page_content": "Awards by Stereophonics\n\nCheck all the awards nominated and won by Stereophonics.\n\n2014\n\nNominations 2014 » Award Nominated Nominated Work World Music Award for World’s Best Album Graffiti on the Train\n\n\n\n2005\n\nNominations 2005 » Award Nominated Nominated Work Kerrang! Award for Best British Band\n\nMTV Europe Music Award for Best UK & Ireland Act\n\n\n\n2004\n\nNominations 2004 » Award Nominated Nominated Work Brit Award for British Rock Act\n\n\n\n2003\n\nNominations 2003 » Award Nominated Nominated Work Kerrang! Award for Best British Band\n\nNME Awards for Worst Band\n\n\n\n2002\n\nNominations 2002 » Award Nominated Nominated Work Brit Award for British Group\n\n\n\n2000\n\nKerrang! Award for Best British Band Nominations 2000 » Award Nominated Nominated Work Kerrang! Award for Best British Band\n\nBrit Award for British Group\n\nBrit Award for British Album of the Year Performance and Cocktails\n\n\n\n1999\n\nKerrang! Award for Best British Band Kerrang! Award for Best Album Honored for : Performance and Cocktails Nominations 1999 » Award Nominated Nominated Work Kerrang! Award for Best Album Performance and Cocktails\n\nKerrang! Award for Best British Band\n\n"}, {"url": "https://planetradio.co.uk/absolute-radio/music/news/stereophonics-career/", "page_content": "Stereophonics through the years: A look back at the band\n\nHere's how they hit the big time\n\nAuthor: Emma Dodds Published 4th Feb 2023\n\n\n\nStereophonics are one of the most enduring indie rock bands of the 90s, releasing a plethora of hits in their heyday as well as their most recent album 'Oochya!' in March 2022. The Welsh band, currently made up of Kelly Jones, Richard Jones, Jamie Morrison and Adam Zindani, are hit the road later in 2022 in support of their new album.\n\nBut how did Stereophonics get famous? And how did they get their band name? We've taken a trip down memory lane to pull out the band's biggest moments right here.\n\nStereophonics: How did they get famous?\n\n1992: The band is born Kelly and Stuart lived on the same street in Cwmaman, Wales, and began jamming together as teenagers, recording a demo under the name Zephyr. After going their separate ways, Kelly and Stuart reunited a few years later, bringing in Richard Jones as bass guitarist - and thus, the line-up was complete.\n\n\n\n\n\nIn 1992, the trio - then known as Tragic Love Company - began to write together, performing in working men's clubs before landing a gig at the Borderline Club in London. They were spotted by producers Marshall Bird and Steve Bush, and recorded demo 'A Thousand Trees'.\n\n1992 - 1996: Career beginnings and name change Promoter Wayne Coleman organised gigs in South Wales after hearing their demo, and whilst he loved the music - he hated the band name, and said they wouldn't play if they kept it. He then spotted a gramophone manufacturer called Falcon Stereophonic, and the band became The Stereophonics.\n\n\n\n\n\nThey played the Coliseum Theatre in nearby Aberdare with Catatonia, and were approached by John brand afterwards who immediately became their manager. Just two months later, they were the first artists to sign to label V2, dropping 'The' from the band name.\n\n1997: Debut album and BRIT Award The band's debut album 'Word Gets Around' was released in August 1997, spawning singles 'A Thousand Trees', 'Local Boy in the Photograph' and 'Traffic' to name but a few. In 1998, they won the Best New Group BRIT Award, and released 'The Bartender and the Thief' - the first single from their follow-up, 'Performance and Cocktails', which in turn was released in March 1999.\n\n\n\n\n\nThe band played to 50,000 people at the Morfa Stadium in Swansea that year, and also collaborated with Welsh legend Tom Jones on a cover of 'Mama Told Me Not To Come'. They toured Europe, Australia and America in 1999, and performed at Cardiff Castle - later released on DVD.\n\n2001: 'Have A Nice Day' After headlining Reading and Leeds in 2000, third album 'Just Enough Education to Perform' was released in 2001, featuring two of their most famous songs: 'Have a Nice Day' and a cover of 'Handbags and Gladrags', which was included in the re-release in 2002. The band performed a two-day festival, 'A Day at the Races', at Donington Park and Cardiff's Millennium Stadium to promote the album, and also headlined Glastonbury Festival in 2002, as well as V Festival.\n\n\n\n\n\nThe band put out their fourth album 'You Gotta Go There to Come Back' in 2003, spawning singles 'Maybe Tomorrow', 'Madame Helga' and 'Since I Told You It's Over'. This was the last album to feature drummer Stuart Cable, who was let go from the band in September 2003. They also had their first headline slot at the Isle of Wight Festival in 2004, which they returned to in 2009.\n\n2005: A new line-up Stereophonics released their fifth album 'Language. Sex. Violence. Other?' in 2005, the first to feature new drummer, Javier Weyler. The album's single 'Dakota' became their first UK Number 1, and they performed that year at Live 8 in Hyde Park, London.\n\n\n\n\n\nKelly pictured here performing at the Isle of Wight Festival in 2009.\n\n2007: Kelly goes it alone Kelly also released his first solo album, 'Only the Names Have Been Changed', in 2007. He explained how it came about, \"We were recording the sixth Stereophonics album... And in-between takes I started doing these songs off the cuff. Three or four tracks in I realised that this could actually be something... Strange how it's always little things that makes big things happen.\"\n\n\n\n\n\nKelly is pictured performing at a session for Absolute Radio in 2009.\n\n2007 - 2010: ‘Pull The Pin’ 'Pull the Pin' was released in October 2007, spawning single 'It Means Nothing' which was written about the London 7/7 attack. Kelly told The Guardian it was \"about the feeling of unease in the city and people realising what was important in their lives.\"\n\n\n\n\n\nThey performed at the 2010 Olympic and Paralympic Winter Games in Vancouver, and released seventh album 'Keep Calm and Carry On', playing a UK tour throughout 2010 to promote it.\n\n\n\n\n\nThe band are pictured here at a session for Absolute Radio in 2009.\n\n2010: Stuart Cable's death Sadly, former member Stuart Cable passed away in June 2010, and Kelly decided to take a break from writing and releasing albums every two years.\n\n\n\n\n\nThe band released song 'Before Anyone Knew Our Name' in 2017 in memory of Stuart. Kelly said of the song, \"I think, you know, Stuart left the band and we were still friends for seven years. And then he passed away tragically, and of course people have opinions about what happened and all this sort of stuff. We kept it very private because we were like brothers.\"\n\n2009: Isle of Wight Festival We met the band backstage at the Isle of Wight Festival in 2009, where they kindly signed a guitar for us. It's still up on the wall.\n\n2011: New music and another personnel change The band announced on Facebook in 2011 that they were back in the studio, but in 2012 announced that Javier had left the group. Jamie Morrison of The Noisettes replaced him, and they released eighth album 'Graffiti on the Train' in March 2013.\n\n\n\n\n\nPictured here performing at Hyde Park in 2012 at the Olympics Opening Ceremony concert.\n\n2012: Isle of Wight Festival Our presenter Sarah Champion caught up with Kelly backstage at the Isle of Wight festival 2012 and the pair chatted away in our camper van. As you do.\n\n2015: 'Keep the Village Alive' Stereophonics impressively released a ninth album in September 2015, entitled 'Keep the Village Alive' which topped the UK Albums Chart. It contained singles 'C'est la Vie' and 'I Wanna Get Lost with You'. They also performed a set for us at the Dingwalls venue in Camden (pictured).\n\n2016: Backstage at the Isle of Wight Festival We had a chat with the band backstage at the Isle of Wight Festival in 2016 - but there was a slight mishap when guitarist Adam Zindani fell through the deck chair...\n\n2016: Backstage at Isle of Wight Festival take two Thankfully, we were able to get Adam a different chair and complete the interview... Oops!\n\n2017: 'Scream Above the Sounds' The band made their 10th album in 2017, releasing 'Scream Above the Sounds' in October. This realised Kelly's dream that they would put out their 10th studio album in the 20th anniversary year of their debut, instead of releasing a Greatest Hits album.\n\n\n\n\n\nPictured here performing at the Isle of Wight Festival in 2016.\n\n2019: 'Kind' But they didn't stop there, getting straight back in the studio to record their eleventh album, 'Kind', which was released in October 2019 and reached Number 1 in the UK. They also embarked on their tour to promote the album, kicking off in Liverpool on 18th January and concluding in Cardiff on 15th March.\n\n2020: Kelly Jones 'Don’t Let The Devil Take Another Day' 2020 saw frontman Kelly Jones release his album 'Don't Let The Devil Take Another Day'. The work contained 21 reworked tracks from throughout the Stereophonics' career, and even had its own documentary! The 90-minute feature tells the heartfelt story of the Stereophonics frontman/songwriter, following his personal uphill battle as he rediscovered his voice.\n\n2022: Stereophonics release 12th album 'Oochya!' and UK tour On 6th September 2021, Stereophonics announced that their 12th studio album will be titled 'Oochya!', and released it on Friday 4th March 2022! They later went on a huge tour to support the album's release throughout March and April.\n\n2023: Far From Saints Kelly teamed up with Austin's Patty Lynn and Dwight Baker to create new band Far From Saints, who released their debut single 'Let's Turn This Back Around' in January 2023. They're planning to release their album later this year and also preparing to tour the new music.\n\n\n\nNOW WATCH: Kelly Jones – Don’t Let The Devil Take Another Day (Documentary Teaser)\n\nYou can hear Stereophonics on the Absolute Radio playlist.\n\nNow read:\n\nStereophonics: All your questions answered\n\nThe changing sound of Arctic Monkeys' albums through the years\n\nFeeder: A guide to the anthemic indie-rockers\n\nHow to listen to Absolute Radio:\n\nListen to Absolute Radio on DAB nationwide, on our free app, by hitting that play button on the bottom of your screen, via your smart speaker (“Play Absolute Radio”) and on Freeview, Sky, and Virgin Media TV."}, {"url": "https://www.shropshirestar.com/entertainment/2022/02/22/its-like-starting-all-over-again--stereophonics-kelly-jones-on-getting-back-to-work/", "page_content": "Stereophonics 2021\n\nGigs were axed, tour plans postponed and the cycle of album-tour-album-tour that had been normal throughout his adult life was brutally curtailed.\n\nCovid put the music industry out of business – or, as good as – as we were told to stay home, not mix and definitely not stand shoulder-to-shoulder with 10,000 other like-minded souls as we sang anthemic tunes at the top of our voices.\n\nAnd now we’ve got a pass. Live is back and Stereophonics can get back to business. There’s a new album, Oochya!, due on March 4 while an arena tour this spring will work its way to Birmingham’s Resorts World Arena on April 2. Stadium dates will follow when the band play Cardiff’s Principality Stadium for two nights in June. 60,000 will flock to see them each night and the God of Welsh music, Tom Jones, will be their support. It sure feels good to be back.\n\nThe signs are good. Stereophonics’ new single Forever, the third instalment from Oochya, is a magnificent slice of radio-friendly pop-rock, the type of tune that made us fall in love with the band when their debut, Word Gets Around, dropped 25 years ago. Ten million record sales followed.\n\nForever followed the previously released Hanging On Your Hinges and Do Ya Feel My Love?, which received widespread national radio support added to A-lists across all key networks, and has now received over two million streams across all platforms.\n\nForever reminds us why Stereophonics have been one of the cornerstones of British music for a quarter of a century. It oozes with glistening guitar and sweeping vocal melodies, paired with romantic storytelling. A reflective track that evokes freedom and the open road, the bridge builds to a euphoric chorus where frontman Kelly Jones is heard bellowing “I wish I could fly away forever, I wish I could take away the pain from you and release you”. Letting go is felt in the heights of his singing, as much as it is when Kelly puts pen to paper.\n\nKelly says: “‘Forever’ is about escapism. It’s about longing for a freedom for someone and taking away the pain they’re going through, it’s about taking a bullet for them. It’s about wanting to free the ones you love of pain, but we can’t – life’s pain is where we find growth. So the song has a lot wrapped up in it. People are feeling a lot of that these days.”\n\nOochya! calls upon certain tones, feelings and themes that’ll resonate with fans young and old alike. Kelly Jones explains: “It’s quite an emotional record. At times it’s very nostalgic. The whole album is melodic. You put it on and it’s one of those albums you don’t really want to turn off because it keeps going onto different styles and the songs hold your attention. It shows a lot of styles of the band.”\n\nWith Oochya!, Kelly Jones continues to cement his place amongst the great British songwriters. Having now achieved seven UK Number 1 albums, 10 Top 10 albums, 23 Platinum Sales Awards, 8.5 million albums sold in the UK alone, five BRIT Award nominations and one BRIT Award win, Stereophonics stand as undeniable giants of British music.\n\nJones is pleased with the reaction to his new work. “I had the lyrics for Forever for quite a long time, years back, but it didn’t fit on anything until now. I don’t think of songs as being old or new, some carry over to the next project depending on how they do or don’t fit in. It’s dressed up in a very poetic way. It came out really well.”\n\nOochya! is a more diverse and eclectic collection of songs that we might previously have expected. Lockdown gave Jones the opportunity to explore the band in a new way.\n\n“The record is a collection of lots of different styles of music. There are songs written recently, some songs didn’t find a home, some songs were begun and not completed. They take people through rock’n’roll stuff, there’s darker stuff, there’s soul stuff. There’s a lot of different sides of what the band is capable of. It wasn’t intended to be an album. I booked a session and we recorded the guts of it in seven days. We had a good time because we hadn’t seen each other for a long time. I brought it back to work on it with the guy I’d worked with on Performance and Cocktails.”\n\nOochya! wasn’t the only new arrival during lockdown. Jones also welcomed his fourth child. A notable family man, who gives his kids as-normal-as-possible an upbringing, he was delighted to become a father again.\n\n“I had my fourth child in the lockdown. So most of our time was with the kids. I have kids from 17 downwards. They’ve all got things to do like college and GCSEs so lockdown was all about that, really.\n\n“Lockdown is weird because singing itself was a huge release. I wasn’t doing it. It became quite a strange thing for a year. It was the first time we stopped. Physically we stopped. It was the first time in 25 years I wasn’t going from town to town or country to country. I learned a lot about myself and did a lot of work on myself.”\n\nThere were other projects, including the remarkable and heartfelt documentary, Don’t Let The Devil Take Another Day. The film told the human story of one of Britain’s most-loved artists who, when confronted with a revelation that had threatened to undermine his career and future music making, rediscovers his distinctive voice and experiences a remarkable 2019.\n\nThe episode was transformative. Jones had, after all, been singing on stage since the age of 12. From the working men’s clubs of the Welsh valleys, to headlining Glastonbury with his band Stereophonics, to 20 years of sold-out arena tours, he had released more than 150 songs, across 11 albums, and counted such heroes as Bob Dylan and David Bowie as fans of his music.\n\nA personal uphill battle that remained secret from the public, however, Kelly’s recovery was recorded for that film, providing a triumph over adversity and offering hope in unprecedented times. A beautifully authentic, life-affirming and inspiring story, it was Jones at his best.\n\n“That project came around when I was looking at solo shows. I’ve always had an interest in doing some solo shows where I can be in an environment and communicate better with the audience. I wanted to get down and deliver those songs in a very different way and tell a few anecdotes in between and bring them back up in the storytelling. You had to be completely fully present, it’s like climbing a mountain face. If you lost your concentration for a minute, you’d mess it up. You couldn’t go into autopilot on any level. There were 20 shows and it was amazing working with different musicians.\n\n“It was out of my comfort zone. We did six shows with Just Enough Education To Perform, where we talked about it. I could feel my guts going and I was getting tight. You feel like you’re not doing something you are familiar with. I think that’s a good sign. Going forward, I want to do something different. My passion for the band won’t go away, though, both things are important.”\n\nJones has enjoyed a remarkable career and is happy to be back. His hunger and passion are undiminished by the past two years.\n\n“We’ve been very fortunate. We’ve had lots of great moments. All our idols who we brought records from, they took us on the road, from the Stones to U2 and the Chilli Peppers. We were really lucky to be able to have five minutes with those people and let them tell us a story, or to just be in the same room as them. To watch the Stones warm up before a show is ridiculous. It never gets normal. I still feel like that kid in a pub, playing covers. You learn a lot. You learn from being around them.”\n\nThere will be more albums after this one and Jones doesn’t rule out eventually releasing his own solo work – something that fans would welcome.\n\n“I’ve never written a studio album for myself but the solo tour and releasing the live record was received really well. So going forward I have another record coming out at some point this year, with two of the guys from that tour – The Wind And The Wave – I’ve made an album with them, that’s Country and Americana. I think they’ll start releasing some of those songs. I’ve got some ideas for things I write on the piano. I feel there’s some stuff outside the ’Phonics camp.”\n\nFor now, he’s thrilled that the pandemic is passing and there’s a new album to promote and a tour to look forward to. The connection with fans never becomes tiresome.\n\n“I like getting back to the band. That’s what makes it special. It’s been a great response to the new album. It feels like starting fresh all over again.\n\n“The album is a mixture. It’s got some beautiful songs. There’s some great rock’n’roll songs. There’s dark stuff. It’s like a greatest hits that people haven’t heard.\n\n“The tour will be great. We’re doing the stage designs now and using some of the pop art stuff that we’ve got on the cover. We’re going to do some new songs from the album then there’ll be all the big hits. Twenty-five years back then felt like a long time. But it’s gone by very, very fast. We just wanted a catalogue that stood the test of time.”"}, {"url": "https://www.radiox.co.uk/news/brit-awards/can-you-believe-these-bands-never-won-brit-award/", "page_content": "Can You Believe These Bands Have Never Won A BRIT Award?\n\nWell, not yet, anyway. These 10 legendary acts haven’t been honoured at the annual celebration of British music - for shame! Sort it out! Etc!\n\nThe Smiths\n\nIf there was any band that were the polar opposite of what the BRIT Awards represented in the 80s, it was the ‘Miffs. The epitome of indie, they split before a major label got its hooks into them. Not that time hasn’t mellowed Morrissey’s stance: in 2015, he wrote: “The BRIT Awards have come to define what is neither talent nor star, having paid no attention to what is true. Therefore, not having accepted a Brit Award indicates classical value for any artist who takes their music seriously”. Ouch.\n\nBiffy Clyro\n\nThe Scottish trio were nominated in 2011 for Best British Group losing out to - get this - Take That! Luckily, they have been put forward in the same category in 2017. ‘MON THE BIFF. You can do it this year!\n\nThe Stone Roses\n\nThe legendary Mancs were nominated for Best British Breakthrough Group in 1990, but sadly lost out to Lisa “Been Around The World And I-I-I I Can’t Find My Baby” Stansfield. They were up for Best British Group in 1991, but were pipped at the post by The Cure (although, to be fair, neither group had a studio album out in 1990).\n\nThe Clash\n\nStill an active unit when the awards started up in earnest in 1982, but Joe Strummer’s mantlepiece remained unsullied by a BRITs trophy.\n\nSex Pistols\n\nA lifetime achievement award for the punk pioneers was “discussed” in 2006, but nothing has turned up since.\n\nSuede\n\nBrett Anderson and his colleagues appeared at the 1993 ceremony to perform Animal Nitrate in an attempt to champion new music. But a proper award has not been forthcoming. Anderson has since said: \"I've never felt more out of place then that time we played at the BRITs. It was so ridiculously corporate.\"\n\nThe Rolling Stones\n\nCan you believe that Mick, Keef, Ronnie and Charlie haven’t been given an Lifetime Achievement Award? Come on, BRIT boffins, sort it out!\n\nPrimal Scream\n\nNominated for Best British Rock Act in 2004, but were beaten by The Darkness. Noel Gallagher has called this state of affairs “a disgrace”.\n\nPulp\n\nNominated FOUR times in 1996 (for album, group, single and video), but went home empty handed. After Jarvis Cocker’s antics at the end of the show, where he waved his bum at the crowd during Michael Jackon’s performance, we don’t think they’ll be asked back.\n\nRadiohead\n\nThe band have been nominated SIXTEEN TIMES for an award and have yet to win a single one. Could 2017 see them finally walk off with Best British Group. COME ONNNNNNN…."}, {"url": "https://www.leicestermercury.co.uk/whats-on/whats-on-news/stereophonics-announce-leicester-gig-part-6111615", "page_content": "We have more newsletters\n\nSomething went wrong, please try again later.\n\nInvalid email Something went wrong, please try again later.\n\nSubscribe today to get the latest headlines straight to your inbox with our free email updates\n\nThere's great news for fans of Stereophonics as the Welsh rockers have announced a Leicester gig.\n\nIt is one of a small number of intimate UK shows in November and December, which will celebrate the 20th anniversary of their multi-platinum acclaimed album ‘Just Enough Education to Perform’.\n\nStereophonics will be performing J.E.E.P. in its entirety plus brand new music.\n\nRead about more Leicestershire events here\n\nThe Leicester gig will take place at De Montfort Hall on Friday, November 26. Tickets for the shows will go on sale this Friday, October 29 at 9am.\n\nReleased in 2001, J.E.E.P. was the third studio album released by Stereophonics and spawned three top-ten singles in the form of ‘Mr Writer’, ‘Have a Nice Day’ and ‘Handbags and Gladrags’.\n\nSince its release in 2001, J.E.E.P. spent five weeks at number one, achieved six times platinum status in the UK and cemented Kelly Jones’ place as one of the great British songwriters.\n\nThe band have now achieved seven number one albums, 10 top 10 albums, 23 Platinum Sales Awards, more than 8.5 million albums sold in the UK alone, five BRIT nominations and one BRIT Award win.\n\nAs they celebrate 25 years as one of the UK’s most enduring and loved bands, next year Stereophonics will also release new album ‘Oochya!’ on March 4.\n\nThe band recently released the first single ‘Hanging On Your Hinges’ from the new album.\n\nFollowing the J.E.E.P. anniversary dates, Stereophonics will also be headlining two Cardiff Principality Stadium shows in December and embarking on a nationwide arena tour in spring 2022.\n\nJust Enough Education to Perform live shows are as follows:\n\nFri 26 Nov 21 Leicester De Montfort Hall\n\nSat 27 Nov 21 Llandudno Venue Cymru\n\nMon 29 Nov 21 Portsmouth Guildhall\n\nTue 30 Nov 21 Cambridge Corn Exchange\n\nFri 03 Dec 21 Dundee Caird Hall\n\nSat 04 Dec 21 Edinburgh Usher Hall\n\nMon 06 Dec 21 London O2 Shepherds Bush Empire\n\nTickets will be available, from 9am Friday, from Stereophonics' website."}, {"url": "https://www.theguardian.com/music/2020/jan/11/brit-award-nominations-2020-dave-lewis-capaldi", "page_content": "The British music industry’s focus on the male solo artist at the expense of female musicians has been thrown into sharp relief by the nominations for the 2020 Brit awards, in which only one British woman – and no groups featuring women – was nominated across 25 slots in mixed-gender categories.\n\nPop singer Mabel was nominated for best new artist and best song for Don’t Call Me Up – but the nine other song nominees and four other new artist nominees are solo British males. (US stars Miley Cyrus and Normani make guest appearances in the song category.)\n\nAll five of the nominees for the top prize, best British album, are solo male artists: Stormzy, Michael Kiwanuka, Lewis Capaldi, Dave and Harry Styles. Of the 198 albums on the longlist for best British album – drawn up from chart successes and record label submissions – which are then voted on by the Brits Academy of music industry figures to create the shortlist, only 36 were by women or female-fronted acts.\n\nThe Brits’ recognition of musicians of colour is vastly improved following the “BritsSoWhite” criticisms of recent years. More than half of the best album and British male and female nominees are non-white, partly due to the good health of British rap and R&B music this year, but also due to the increased diversity of the Brits Academy in a 2016 shakeup that brought in 700 new members. Those changes also made the gender split of voters almost equal, but the skewed gender balance in this year’s nominations will raise questions about how female British talent is being nurtured.\n\nBest album and best British male nominee … Harry Styles. Photograph: Isabel Infantes/PA\n\nNominees for best British group – long a bastion for male artists – were also all men: Coldplay, Foals, Bring Me the Horizon, Bastille and the rap duo D-Block Europe. None of those artists received any other nominations, and it’s only the second time in Brits history that no group has been nominated for album of the year, the first time being in 2018.\n\nSouth London rapper Dave, and Scottish singer-songwriter Lewis Capaldi were the most nominated artists, with four each – best album, British male, new artist and song. Each of them had a very successful 2019. Dave won the Mercury prize for his album, Psychodrama, a candid, often bleak exploration of race, poverty, family and mental strife, which topped the UK charts. “What an honour, and what a way to end the most incredible year. I’m very grateful,” he said. His song nomination was for Location, featuring Burna Boy, the Nigerian artist who also picks up a nomination in the best international male category alongside Bruce Springsteen, Dermot Kennedy, Post Malone and Tyler, the Creator.\n\nCapaldi topped the charts on both sides of the Atlantic with his power ballad Someone You Loved, nominated in the song category, which was the biggest-selling song of 2019 in the UK (accounting for streams and downloads). His album, Divinely Uninspired to a Hellish Extent, was also the UK’s biggest selling album.\n\nBest international female solo artist nominee … Ariana Grande. Photograph: Chris Pizzello/Invision\n\nChasing them with three nominations each are Mabel, the daughter of Neneh Cherry who had two Top 10 hits in 2019, and Stormzy, who will be much fancied after a blockbuster year in which he headlined Glastonbury and topped the singles chart three times. The Croydon-raised rapper will be hoping to add a second album of the year award, having previously won in 2018. Harry Styles continues a strong post-One Direction career with two nominations – best album and best British male – with soul singer Michael Kiwanuka also receiving two in the same categories.\n\nThe best British female category is split between chart-friendly pop – Mabel, balladeer Freya Ridings and R&B star Mahalia – and the more experimental artists Charli XCX and FKA twigs. “It’s really surreal to be nominated for 3 awards this year,” Mabel said. “Third year in a row to be nominated so fingers crossed it’s the 3rd time lucky and I can take one home this year.”\n\nArtists who may feel snubbed include Taylor Swift, left out of the international female artist running in favour of Ariana Grande, Billie Eilish, Camila Cabello, Lana Del Rey and Lizzo, and Ed Sheeran, who despite releasing a new album in 2019 earned only one nomination, for his No 1 song with Justin Bieber, I Don’t Care.\n\nLiam Gallagher, Rita Ora, Mumford and Sons, the Chemical Brothers, Rod Stewart, the Who, Muse and Emeli Sandé are among the eligible major British artists who didn’t receive any nominations.\n\nAwards for best video and best international group have been removed for 2020. Producer of the year will be announced ahead of the awards ceremony; the rising star award for hotly tipped new talent has already been awarded, to soul singer Celeste.\n\nThe Brit awards, now in their 40th year, take place at London’s O2 Arena on 18 February, and will be screened live on ITV. Comedian Jack Whitehall returns as host for the third year running.\n\nThe 2020 Brit award nominees in full\n\nGroup of the year\n\nColdplay\n\nFoals\n\nBring Me the Horizon\n\nD-Block Europe\n\nBastille\n\nFemale solo artist nominee … Charli XCX. Photograph: Katja Ogrin/Redferns\n\nFemale solo artist\n\nMabel\n\nFreya Ridings\n\nFKA twigs\n\nCharli XCX\n\nMahalia\n\nMale solo artist\n\nHarry Styles\n\nLewis Capaldi\n\nDave\n\nMichael Kiwanuka\n\nStormzy\n\nNew artist\n\nAitch\n\nLewis Capaldi\n\nDave\n\nMabel\n\nSam Fender\n\nNominated in three categories … Stormzy. Photograph: Ian West/PA\n\nSong\n\nEd Sheeran and Justin Bieber – I Don’t Care\n\nMabel – Don’t Call Me Up\n\nCalvin Harris and Rag’N’Bone Man – Giant\n\nDave ft Burna Boy – Location\n\nMark Ronson ft Miley Cyrus – Nothing Breaks Like a Heart\n\nAJ Tracey – Ladbroke Grove\n\nLewis Capaldi – Someone You Loved\n\nTom Walker – Just You and I\n\nSam Smith and Normani – Dancing With a Stranger\n\nStormzy – Vossi Bop\n\nInternational female solo artist\n\nAriana Grande\n\nBillie Eilish\n\nCamila Cabello\n\nLana Del Rey\n\nLizzo\n\nInternational male solo artist\n\nBruce Springsteen\n\nBurna Boy\n\nTyler, the Creator\n\nDermot Kennedy\n\nPost Malone\n\nAlbum of the year\n\nStormzy – Heavy Is the Head\n\nMichael Kiwanuka – Kiwanuka\n\nLewis Capaldi – Divinely Uninspired to a Hellish Extent\n\nDave – Psychodrama\n\nHarry Styles – Fine Line"}, {"url": "https://www.hotpress.com/culture/stereophonics-to-play-fairview-park-this-july-with-support-from-moncrieff-22899758", "page_content": "Tickets €49.90 on sale this Friday at 10am from Ticketmaster.ie and stereophonics.com/tour.\n\nFollowing their sold-out UK arena tour, Stereophonics have announced their return to Ireland this summer with an outdoor show at Fairview Park.\n\nThe forthcoming Dublin gig will take place on Friday 1st July 2022, with rising Waterford indie-pop star Moncrieff (Chris Breheny) acting as support.\n\nJanuary single 'Warm' marked Moncrieff's first release since signing to German label Energie Musik. The single is taken from the alternative artist's upcoming EP - scheduled for release this Spring. Moncrieff moved to London to pursue his music career at just 19. Two years ago, he unveiled his EP The Early Hurts and gained the attention of none other than Elton John, who gave him a shout out on his radio show. The songwriting legend was especially taken with Moncrieff's track 'Symptoms', which was picked by BBC Radio 1 following substantial airplay.\n\nWelsh outfit Stereophonics join a stellar line-up of gigs at the venue this summer, including Olivia Rodrigo, Phoebe Bridgers, Greta Van Fleet, Mabel & Inhaler.\n\nThe band’s acclaimed new album Oochya! is out now, securing the rockers' eighth number one in their 25th year as an outfit.\n\nAdvertisement\n\nThe Welsh rock band secured the top spot with their 12th album by outselling their closest competition by 2:1, according to Official Charts Company.\n\nAccepting their number one album award lead singer Jones told OfficialCharts.com: “Thank you very much, the eighth Official Charts Number 1 on the 25th year.\n\n“There’s lots of people involved in the Stereophonics team, but we’re just four of them. Thank you very much to everybody, all the fans that’ve been with the band for a long time, and all the new ones.”\n\nThis success places them among global superstars such as Taylor Swift, Oasis and R.E.M., who have also achieved eight number one albums in their career.\n\nThe band, consisting of Kelly Jones, Richard Jones, Adam Zindani and Jamie Morrison, signed their record deal in 1996.\n\nKelly Jones says: “The album title (‘Oochya!’) was always a saying me and the band used in the studio to mean “let’s have it”, a blast of energy and optimism and that’s what we wanted to get across with ‘Hinges’.”\n\nAs Stereophonics celebrate 25 years as one of the UK’s most enduring and loved bands, with Oochya! Kelly Jones continues to cement his place amongst the great British songwriters.\n\nAdvertisement\n\nHaving now achieved eight number 1 albums, 10 top 10 albums, 23 Platinum Sales Awards, 8.5 million albums sold in the UK alone, five BRIT nominations and one BRIT Award win, Stereophonics stand as undeniable giants of British music.\n\nListen to Oochya! below:"}], "Stereophonics won Best British Group in 2002 at the Brit Awards.": [{"url": "http://awardsandwinners.com/category/brit-awards/2002/", "page_content": "2002 BRIT Awards Brit Award for British Male Solo Artist Robbie Williams Nominations » Nominee Nominated Work Robbie Williams\n\nAphex Twin\n\nCraig David\n\nElton John\n\nIan Brown\n\nBrit Award for British Female Solo Artist Dido Nominations » Nominee Nominated Work Dido\n\nGeri Halliwell\n\nPJ Harvey\n\nSade Adu\n\nSophie Ellis-Bextor\n\nBrit Award for British Group Travis Nominations » Nominee Nominated Work Travis\n\nGorillaz\n\nJamiroquai\n\nRadiohead\n\nStereophonics\n\nBrit Award for British Breakthrough Act Blue Nominations » Nominee Nominated Work Blue\n\nGorillaz\n\nZero 7\n\nMis-Teeq\n\nSo Solid Crew\n\nBrit Award for British Album of the Year Dido Honored for : No Angel Nominations » Nominee Nominated Work Dido No Angel\n\nCraig David Born to Do It\n\nGorillaz Gorillaz\n\nRadiohead Kid A\n\nTravis The Invisible Band\n\nBrit Award for International Male Solo Artist Shaggy Nominations » Nominee Nominated Work Shaggy\n\nBob Dylan\n\nDr. Dre\n\nRyan Adams\n\nWyclef Jean\n\nBrit Award for International Female Solo Artist Kylie Minogue Nominations » Nominee Nominated Work Kylie Minogue\n\nAlicia Keys\n\nAnastacia\n\nBjörk\n\nNelly Furtado\n\nBrit Award for British Single S Club Honored for : Don't Stop Movin' Nominations » Nominee Nominated Work S Club Don't Stop Movin'\n\nGeri Halliwell It's Raining Men\n\nHear'Say Pure and Simple\n\nRobbie Williams Eternity / The Road To Mandalay\n\nAtomic Kitten Whole Again\n\nBrit Award for International Breakthrough Act The Strokes Nominations » Nominee Nominated Work The Strokes\n\nAnastacia\n\nThe Avalanches\n\nLinkin Park\n\nNelly Furtado\n\nBrit Award for Outstanding Contribution to Music Sting Brit Award for International Album Kylie Minogue Honored for : Fever Nominations » Nominee Nominated Work Kylie Minogue Fever\n\nAlicia Keys Songs in A minor\n\nDaft Punk Discovery\n\nDestiny's Child Survivor\n\nThe Strokes Is This It\n\nBrit Award for International Group Destiny's Child Nominations » Nominee Nominated Work Daft Punk\n\nLimp Bizkit\n\nR.E.M.\n\nThe Strokes\n\nDestiny's Child\n\nBrit Award for Pop Act Westlife Nominations » Nominee Nominated Work Westlife\n\nBlue\n\nHear'Say\n\nKylie Minogue\n\nS Club\n\nBrit Award for British Dance Act Basement Jaxx Nominations » Nominee Nominated Work Basement Jaxx\n\nGorillaz\n\nCraig David\n\nFatboy Slim\n\nFaithless\n\nBrit Award for British Video So Solid Crew Honored for : 21 Seconds Nominations » Nominee Nominated Work So Solid Crew 21 Seconds\n\nFatboy Slim Weapon of Choice\n\nBasement Jaxx Where's Your Head At?\n\nDido Thank You\n\nTravis Sing\n\n"}, {"url": "http://awardsandwinners.com/winner/?mid=/m/015_8p", "page_content": "Awards by Stereophonics\n\nCheck all the awards nominated and won by Stereophonics.\n\n2014\n\nNominations 2014 » Award Nominated Nominated Work World Music Award for World’s Best Album Graffiti on the Train\n\n\n\n2005\n\nNominations 2005 » Award Nominated Nominated Work Kerrang! Award for Best British Band\n\nMTV Europe Music Award for Best UK & Ireland Act\n\n\n\n2004\n\nNominations 2004 » Award Nominated Nominated Work Brit Award for British Rock Act\n\n\n\n2003\n\nNominations 2003 » Award Nominated Nominated Work Kerrang! Award for Best British Band\n\nNME Awards for Worst Band\n\n\n\n2002\n\nNominations 2002 » Award Nominated Nominated Work Brit Award for British Group\n\n\n\n2000\n\nKerrang! Award for Best British Band Nominations 2000 » Award Nominated Nominated Work Kerrang! Award for Best British Band\n\nBrit Award for British Group\n\nBrit Award for British Album of the Year Performance and Cocktails\n\n\n\n1999\n\nKerrang! Award for Best British Band Kerrang! Award for Best Album Honored for : Performance and Cocktails Nominations 1999 » Award Nominated Nominated Work Kerrang! Award for Best Album Performance and Cocktails\n\nKerrang! Award for Best British Band\n\n"}, {"url": "https://www.huffingtonpost.co.uk/entry/brit-awards-2002-20-years-ago-kylie-minogue_uk_61fbdff1e4b02136b6f11bf5", "page_content": "Celebrating the pop culture moments from the turn of the 2000s\n\nEvery year when the Brit Awards roll around we find ourselves getting all nostalgic for past ceremonies – and the event from 20 years ago was a particular stand-out.\n\nIn 2002, the Brits gave us some classic performances from top UK talent, some real A-list wins and a smorgasbord of some of the most blatantly early-noughties fashion you’re ever likely to clap eyes on.\n\nAdvertisement\n\nAnd that’s without even going into the top moment of the night, delivered by a certain Ms Minogue when she defined “making an entrance” with a Brits performance we’re still talking about two decades later.\n\nHere are just some of the highlights from the 2002 Brits...\n\nAs with all good awards shows, let’s start with the red carpet, where “jeans and a nice top” was apparently the look du jour\n\nDave Benett via Getty Images\n\nAt least according to Anna Friel and Beverley Knight anyway\n\nDave Benett via Getty Images\n\nAdvertisement\n\nOh and Michelle Heaton... who, for some reason, was apparently there with Richard Branson\n\nDave Benett via Getty Images\n\nNothing has ever screamed ’2002′ quite like Davina McCall’s ensemble for the night\n\nDave Hogan via Getty Images\n\nAlthough maybe Heidi Klum came close\n\nDave Benett via Getty Images\n\nNominee Sophie Ellis-Bextor gave us this polka dot moment\n\nJMEnternational via Getty Images\n\nAnd Dane Bowers dug out his best tie for the occasion\n\nRichard Young/Shutterstock\n\nAdvertisement\n\nLulu to served us this fringed number\n\nDave Hogan via Getty Images\n\nAnd we kind of don’t have words for this Anastacia outfit\n\nRichard Young/Shutterstock\n\nMeanwhile, Johnny Vegas was seemingly enjoying his night out\n\nJon Furniss via Getty Images\n\nCan we just take a moment to appreciate this Dannii Minogue outfit?\n\nAnthony Harvey via Getty Images\n\nOh, and her less famous sister Kylie was also there\n\nJon Furniss via Getty Images\n\nAdvertisement\n\nJokes aside, Kylie’s Brits performance of Can’t Get You Out Of My Head was not just one of the most memorable of the night, but of all time\n\nLet it never be said that Kylie doesn’t know how to make an entrance – her performance began with her being ejected from an oversized CD player (which now feels so retro it kind of hurts)\n\nJMEnternational via Getty Images\n\nThe night definitely belonged to Kylie, who won two awards including International Female and International Album for Fever\n\nJMEnternational via Getty Images\n\nThis matched her with Dido, who won Best British Female and the biggest award of the night, Best British Album\n\nJMEnternational via Getty Images\n\nDido also performed on the night, which as you can imagine, was a thrill–a-minute situation\n\nWe have to give a shout-out to the hosts for the evening, Zoë Ball and Frank Skinner. Here they are looking very serious (in front of a CD wall, no less)\n\nITV/Shutterstock\n\nAnd here’s Frank Skinner in a Union Jack vest looking somewhat less serious\n\nBrian Rasic via Getty Images\n\nAmong the other performers at the 2002 Brits were Jay Kay of Jamiroquai and Anastacia giving the Brits another of those “did that really happen” duets?\n\nDave Hogan via Getty Images\n\nAnd speaking of wild Brits duets... Shaggy and Ali-G, anyone?\n\nAdvertisement\n\nIncidentally, Shaggy picked up Best International Male that year, ahead of Bob Dylan and Dr Dre\n\nJMEnternational via Getty Images\n\nSo Solid Crew – yep, all of them – performed 21 Seconds\n\nJMEnternational via Getty Images\n\nAnd won Best British Video for the same song\n\nJMEnternational via Getty Images\n\nWe have to have a moment to appreciate Mis-Teeq, who somehow never won a Brit, but did a brilliant performance that year\n\nBrian Rasic via Getty Images\n\nAdvertisement\n\nWestlife won Best British Pop Act despite not being British (non-Brit Kylie Minogue was also in the running)\n\nDave Hogan via Getty Images\n\nBlue beat the likes of Elbow, Gorillaz and Mis-Teeq to scoop Best British Breakthrough\n\nJMEnternational via Getty Images\n\nRobbie Williams won Best British Male for the third time in a row – and had a very special message for Will Young\n\nAdvertisement\n\nSting won Outstanding Contribution to Music, presented to him by – you guessed it – Kylie Minogue\n\nDave Hogan via Getty Images\n\nHe ended the night with a medley of his hits which, for some reason, ended in him taking his top off and swigging from a mug of tea\n\nDave Hogan via Getty Images"}, {"url": "https://www.theguardian.com/news/datablog/2013/feb/21/brit-award-winners-list", "page_content": "It's been a great year for Emeli Sandé what with a bestselling album and highly praised performances at the Olympic opening and closing ceremonies. Last night the Scottish singer came up trumps again at the Brit awards with two major wins - best female solo singer and best album.\n\nSandé's debut album Our Version Of Events became the most popular album of 2012, selling 1.4m copies. Alexandra Topping writes today:\n\nThe Scottish singer, whose debut album Our Version of Events overtook Adele's 21 to become the bestselling album of 2012 in September, accepted awards for British album of the year and best female solo artist. A year ago, she was presciently named rising star at the Brits in the critics' choice awards. With only the Beatles spending more consecutive weeks in the charts, Sandé has been the standout success story of the year, with her brand of turbo-powered soul and R&B filling the airwaves and propping up album sales in the UK.\n\nWinning best single for the James Bond theme Skyfall, Adele accepted her award via video from Los Angeles where the singer is busy rehearsing for a performance at the upcoming Oscars ceremony on Sunday. Mumford and Sons won best British group and Coldplay were named best live act.\n\nBeating Rita Ora, Ben Howard was a surprise winner of the best British breakthrough act, the singer also took home an award for best British male solo artist.\n\nAnd it wouldn't be the Brits without an appearance from a teen pop sensation - One Direction were awarded a Brit for global success (for international sales in 2012) which as Alexis Petridis points out:\n\neven the most devoted opponent of their Simon Cowell-assisted brand of pop would have a hard time arguing that they aren't a global success, given that they've sold about 22m records worldwide.\n\nThere were also international honours at last night's ceremony. Lana Del Ray received a Brit for best international female solo artist, The Black Keys received best international group and Frank Ocean won best international male solo artist.\n\nThe critics' choice award, last year handed to Sandé herself, went to Tom Odell this year. The table below shows Brit award winners since 1977, what can you do with this data?\n\nEvery Brit award winner listed Click heading to sort table. Download this data Year Category Winner 2013 British Male Solo Artist Ben Howard 2013 British Female Solo Artist Emeli Sandé 2013 British Breakthrough Act Ben Howard 2013 British Group Mumford & Sons 2013 British Single Adele ‘Skyfall’ 2013 British producer Paul Epworth 2013 Mastercard British Album Of The Year Emeli Sandé ‘Our Version Of Events’ 2013 International Male Solo Artist Frank Ocean 2013 International Female Solo Artist Lana Del Rey 2013 International Group The Black Keys 2013 BRITs Global Success Award One Direction 2013 Special Recognition Award War Child 2013 Critics' Choice Tom Odell 2012 British Male Solo Artist Ed Sheeran 2012 British Female Solo Artist Adele 2012 British Breakthrough Act Ed Sheeran 2012 British Group Coldplay 2012 British Single One Direction/What Makes You Beautiful 2012 British producer Ethan Johns 2012 Mastercard British Album Of The Year Adele/21 2012 International Male Solo Artist Bruno Mars 2012 International Female Solo Artist Rihanna 2012 International Group Foo Fighters 2012 International Breakthrough Act Lana Del Rey 2012 Outstanding Contribution To Music Award Blur 2012 Critics' Choice Emeli Sande 2011 Best British Male Solo Artist Plan B 2011 Best British Female Solo Artist Laura Marling 2011 Best British Group Take That 2011 Best British Album Mumford and Sons/\"Sigh No More\" 2011 Best British Single Tinie Tempah/\"Pass Out\" 2011 British Breakthrough Act Tinie Tempah 2011 Best International Male Solo Artist Cee Lo Green 2011 Best International Female Solo Artist Rihanna 2011 Best International Group Arcade Fire 2011 Best International Album Arcade Fire/\"The Suburbs\" 2011 International Breakthrough Act Justin Bieber 2011 Critic's Choice Jessie J 2011 Best Producer Markus Dravs 2010 Best British Male Solo Artist Dizzee Rascal 2010 Best British Female Solo Artist Lily Allen 2010 Best British Group Kasabian 2010 Best British Album Florence And The Machine/\"Lungs\" 2010 Best British Single JLS/\"Beat Again\" 2010 British Breakthrough Act JLS 2010 Best International Male Solo Artist Jay-Z 2010 Best International Female Solo Artist Lady Gaga 2010 Best International Album Lady Gaga/\"The Fame\" 2010 British Producer Paul Epworth 2010 International Breakthrough Act Lady Gaga 2010 Outstanding Contribution To Music Robbie Williams 2010 Critic's Choice Ellie Goulding 2009 Best British Male Solo Artist Paul Weller 2009 Best British Female Solo Artist Duffy 2009 Best British Group Elbow 2009 Best British Album Duffy/\"Rockferry\" 2009 Best British Single Girls Aloud/\"The Promise\" 2009 Best British Live Act Iron Maiden 2009 British Breakthrough Act Duffy 2009 Best International Male Solo Artist Kanye West 2009 Best International Female Solo Artist Katy Perry 2009 Best International Album Kings of Leon/\"Only By The Night\" 2009 British Producer Bernard Butler 2009 Best International Group Kings of Leon 2009 Outstanding Contribution To Music Pet Shop Boys 2009 Critic's Choice Florence and the Machine 2008 Best British Male Solo Artist Mark Ronson 2008 Best British Female Solo Artist Kate Nash 2008 Best British Group Arctic Monkeys 2008 Best British Album Arctic Monkeys/\"Favourite Worst Nightmare\" 2008 Best British Single Take That/\"Shine\" 2008 Best British Live Act Take That 2008 British Breakthrough Act Mika 2008 Best International Male Solo Artist Kanye West 2008 Best International Female Solo Artist Kylie Minogue 2008 Best International Album Foo Fighters/\"Echoes, Silence, Patience & Grace\" 2008 Best International Group Foo Fighters 2008 Outstanding Contribution To Music Sir Paul McCartney 2008 Critic's Choice Adele 2007 Best British Male Solo Artist James Morrison 2007 Best British Female Solo Artist Amy Winehouse 2007 Best British Group Arctic Monkeys 2007 Best British Album Arctic Monkeys/\"Whatever People Say I Am, That's What I'm Not\" 2007 Best British Single Take That/\"Patience\" 2007 Best British Live Act Muse 2007 British Breakthrough Act The Fratellis 2007 Best International Male Solo Artist Justin Timberlake 2007 Best International Female Solo Artist Nelly Furtado 2007 Best International Album The Killers/\"Sam's Town\" 2007 Best International Group The Killers 2007 International Breakthrough Act Orson 2007 Outstanding Contribution To Music Oasis 2006 Best British Male Solo Artist James Blunt 2006 Best British Female Solo Artist KT Tunstall 2006 Best British Group Kaiser Chiefs 2006 Best British Album Coldplay/\"X&Y\"\" 2006 Best British Single Coldplay/\"Speed Of Sound\" 2006 Best British Rock Act Kaiser Chiefs 2006 Best British Urban Act Lemar 2006 Best British Live Act Kaiser Chiefs 2006 British Breakthrough Artist Arctic Monkeys 2006 Best Pop Act James Blunt 2006 Best International Male Solo Artist Kanye West 2006 Best International Female Solo Artist Madonna 2006 Best International Album Green Day/\"American Idiot\" 2006 Best International Group Green Day 2006 International Breakthrough Artist Jack Johnson 2006 Outstanding Contribution To Music Paul Weller 2005 Best British Male Solo Artist The Streets 2005 Best British Female Solo Artist Joss Stone 2005 Best British Group Franz Ferdinand 2005 Best British Album Keane/\"Hopes And Fears\" 2005 Best British Single Will Young/\"Your Game\" 2005 Best British Rock Act Franz Ferdinand 2005 Best British Urban Act Joss Stone 2005 Best British Live Act Muse 2005 British Breakthrough Artist Keane 2005 Best Pop Act McFly 2005 Best International Male Solo Artist Eminem 2005 Best International Female Solo Artist Gwen Stefan 2005 Best International Album Scissor Sisters/\"Scissor Sisters\" 2005 Best International Group Scissor Sisters 2005 International Breakthrough Artist Scissor Sisters 2005 Brits 25th Anniversary Best Song Award Robbie Williams/\"Angels\" 2004 Best British Male Solo Artist Daniel Bedingfield 2004 Best British Female Solo Artist Dido 2004 Best British Group Darkness 2004 Best British Album Darkness/\"Permission To Land\" 2004 Best British Single Dido/\"White Flag\" 2004 Best British Rock Act Darkness 2004 Best British Urban Act Lemar 2004 Best British Dance Act Basement Jaxx 2004 British Breakthrough Artist Busted 2004 Best Pop Act Busted 2004 Best International Male Solo Artist Justin Timberlake 2004 Best International Female Solo Artist Beyonce 2004 Best International Album Justin Timberlake/\"Justified\" 2004 Best International Group White Stripes 2004 International Breakthrough Artist 50 Cent 2004 Outstanding Contribution To Music Duran Duran 2003 Best British Male Solo Artist Robbie Williams 2003 Best British Female Solo Artist Ms Dynamite 2003 Best British Group Coldplay 2003 Best British Album Coldplay/\"A Rush Of Blood To The Head\" 2003 Best British Urban Act Ms Dynamite 2003 Best British Dance Act Sugababes 2003 British Breakthrough Artist Will Young 2003 Best International Male Eminem 2003 Best International Female Pink 2003 Best International Group Red Hot Chili Peppers 2003 International Breakthrough Artist Norah Jones 2003 Best International Album Eminem/\"The Eminem Show\" 2003 Best British Video n/a 2003 Best British Single Liberty X/\"Just A Little'\" 2003 Best Pop Act Blue 2003 Outstanding Contribution Tom Jones 2002 Best British Male Solo Artist Robbie Williams 2002 Best British Female Solo Artist Dido 2002 Best British Group Travis 2002 Best British Album Dido/\"No Angel\" 2002 Best British Dance Act Basement Jaxx 2002 Best British Newcomer Blue 2002 Best International Male Shaggy 2002 Best International Female Kylie Minogue 2002 Best International Group Destiny's Child 2002 Best International Newcomer The Strokes 2002 Best International Album Kylie Minogue/\"Fever\" 2002 Best British Video So Solid Crew/\"21 Seconds\" 2002 Best British Single S Club 7/\"Don't Stop Movin'\" 2002 Best Pop Act Westlife 2002 Outstanding Contribution Sting 2001 Best British Male Solo Artist Robbie Williams 2001 Best British Female Solo Artist Sonique 2001 Best British Group Coldplay 2001 Best British Album Coldplay/\"Parachutes\" 2001 Best British Dance Act Fat Boy Slim 2001 Best British Newcomer A1 2001 Best International Male Eminem 2001 Best International Female Madonna 2001 Best International Group U2 2001 Best International Newcomer Kelis 2001 Best Soundtrack American Beauty 2001 Best British Video Robbie Williams/\"Rock DJ\" 2001 Best British Single Robbie Williams/\"Rock DJ\" 2001 Best Pop Act Westlife 2001 Outstanding Contribution U2 2000 Best British Male Solo Artist Tom Jones 2000 Best British Female Solo Artist Beth Orton 2000 Best British Group Travis 2000 Best British Album Travis/\"The Man Who\" 2000 Best British Dance Act The Chemical Brothers 2000 Best British Newcomer S Club 7 2000 Best International Male Beck 2000 Best International Female Macy Gray 2000 Best International Group TLC 2000 Best International Newcomer Macy Gray 2000 Best Soundtrack Notting Hill 2000 Best British Video Robbie Williams/\"She's The One\" 2000 Best British Single Robbie Williams/\"She's The One\" 2000 Best Pop Act Five 2000 Outstanding Contribution Spice Girls 1999 Best British Male Solo Artist Robbie Williams 1999 Best British Female Solo Artist Des'ree 1999 Best British Group Manic Street Preachers 1999 Best British Album Manic Street Preachers/\"This Is My Truth Tell Me Yours\" 1999 Best British Dance Act Fat Boy Slim 1999 Best British Newcomer Belle & Sebastian 1999 Best International Male Beck 1999 Best International Female Natalie Imbruglia 1999 Best International Group The Corrs 1999 Best International Newcomer Natalie Imbruglia 1999 Best Soundtrack Titanic 1999 Best British Video Robbie Williams/\"Millennium\" 1999 Best British Single Robbie Williams/\"Angels\" 1999 Best Pop Act n/a 1999 Outstanding Contribution Eurythmics 1998 Best British Male Solo Artist Finley Quaye 1998 Best British Female Solo Artist Shola Ama 1998 Best British Group The Verve 1998 Best British Album The Verve/\"Urban Hymns\" 1998 Best British Dance Act Prodigy 1998 Best British Newcomer Stereophonics 1998 Best International Male Jon Bon Jovi 1998 Best International Female Bjork 1998 Best International Group U2 1998 Best International Newcomer Eels 1998 Best Soundtrack The Full Monty 1998 Best British Video All Saints/\"Never Ever\" 1998 Best British Single All Saints/\"Never Ever\" 1998 Best Pop Act n/a 1998 Outstanding Contribution Fleetwood Mac 1997 Best British Male Solo Artist George Michael 1997 Best British Female Solo Artist Gabrielle 1997 Best British Group Manic Street Preachers 1997 Best British Album Manic Street Preachers/\"Everything Must Go\" 1997 Best British Dance Act Prodigy 1997 Best British Newcomer Kula Shaker 1997 Best International Male Beck 1997 Best International Female Sheryl Crow 1997 Best International Group Fugees 1997 Best International Newcomer Robert Miles 1997 Best Soundtrack Train Spotting 1997 Best British Video Spice Girls/\"Say You'll Be There\" 1997 Best British Single Spice Girls/\"Wannabe\" 1997 Best Pop Act n/a 1997 Outstanding Contribution Bee Gees 1996 Best British Male Solo Artist Paul Weller 1996 Best British Female Solo Artist Annie Lennox 1996 Best British Group Oasis 1996 Best British Album Oasis/\"(What's The Story) Morning Glory?\" 1996 Best British Dance Act Massive Attack 1996 Best British Newcomer Supergrass 1996 Best International Male The Artist 1996 Best International Female Bjork 1996 Best International Group Bon Jovi 1996 Best International Newcomer Alanis Morissette 1996 Best Soundtrack Batman Forever 1996 Best British Video Oasis/\"Wonderwall\" 1996 Best British Single Take That/\"Back for Good\" 1996 Best Pop Act n/a 1996 Outstanding Contribution David Bowie 1995 Best British Male Solo Artist Paul Weller 1995 Best British Female Solo Artist Eddie Reader 1995 Best British Group Blur 1995 Best British Album Blur/\"Parklife\" 1995 Best British Dance Act M People 1995 Best British Newcomer Oasis 1995 Best International Male The Artist 1995 Best International Female KD Lang 1995 Best International Group REM 1995 Best International Newcomer Lisa Loeb 1995 Best Soundtrack Pulp Fiction 1995 Best British Video Blur/\"Parklife\" 1995 Best British Single Blur/\"Parklife\" 1995 Best Pop Act n/a 1995 Outstanding Contribution Elton John 1994 Best British Male Solo Artist Sting 1994 Best British Female Solo Artist Dina Carroll 1994 Best British Group Stereo MC's 1994 Best British Album Stereo MC's/\"Connected\" 1994 Best British Dance Act M People 1994 Best British Newcomer Gabrielle 1994 Best International Male Lenny Kravitz 1994 Best International Female Bjork 1994 Best International Group Crowded House 1994 Best International Newcomer Bjork 1994 Best Soundtrack The Bodyguard 1994 Best British Video Take That/\"Pray\" 1994 Best British Single Take That/\"Pray\" 1994 Best Pop Act n/a 1994 Outstanding Contribution Van Morrison 1993 Best British Male Solo Artist Mick Hucknall 1993 Best British Female Solo Artist Annie Lennox 1993 Best British Group Simply Red 1993 Best British Album Annie Lennox/\"Diva\" 1993 Best British Dance Act n/a 1993 Best British Newcomer Tasmin Archer 1993 Best International Male n/a 1993 Best International Female n/a 1993 Best International Group REM 1993 Best International Newcomer Nirvana 1993 Best Soundtrack Wayne's World 1993 Best British Video Shakespear's Sister/\"Stay\" 1993 Best British Single Take That/\"Could it be Magic\" 1993 Best Pop Act n/a 1993 Outstanding Contribution Rod Stewart 1992 Best British Male Solo Artist Seal 1992 Best British Female Solo Artist Lisa Stansfield 1992 Best British Group The KLF/Simply Red (Joint Winners) 1992 Best British Album Seal/\"Seal\" 1992 Best British Dance Act n/a 1992 Best British Newcomer Beverley Craven 1992 Best International Male n/a 1992 Best International Female n/a 1992 Best International Group U2 1992 Best International Newcomer PM Dawn 1992 Best Soundtrack The Commitments 1992 Best British Video Seal/\"Killer\" 1992 Best British Single Queen/\"These Are The Best Days Of Our Lives\" 1992 Best Pop Act n/a 1992 Outstanding Contribution Freddie Mercury 1991 Best British Male Solo Artist Elton John 1991 Best British Female Solo Artist Lisa Stansfield 1991 Best British Group The Cure 1991 Best British Album George Michael/\"Listen Without Predudice Vol.1\" 1991 Best British Dance Act n/a 1991 Best British Newcomer Betty Boo 1991 Best International Male Michael Hutchence 1991 Best International Female Sinead O'Connor 1991 Best International Group INXS 1991 Best International Newcomer MC Hammer 1991 Best Soundtrack Twin Peaks 1991 Best British Video The Beautiful South/\"A Little Time\" 1991 Best British Single Depeche Mode 1991 Best Pop Act n/a 1991 Outstanding Contribution Status Quo 1990 Best British Male Solo Artist Phil Collins 1990 Best British Female Solo Artist Annie Lennox 1990 Best British Group Fine Young Cannibals 1990 Best British Album Fine Young Cannibals/\"The Raw And The Cooked\" 1990 Best British Dance Act n/a 1990 Best British Newcomer Lisa Stansfield 1990 Best International Male n/a 1990 Best International Female n/a 1990 Best International Group U2 1990 Best International Newcomer Neneh Cherry 1990 Best Soundtrack Batman 1990 Best British Video Best Music Video: The Cure/\"Lullaby\" 1990 Best British Single Phil Collins/\"Another Day In Parasdise\" 1990 Best Pop Act n/a 1990 Outstanding Contribution Queen 1989 Best British Male Solo Artist Phil Collins 1989 Best British Female Solo Artist Annie Lennox 1989 Best British Group Erasure 1989 Best British Album Fairground Attraction/\"First Of A Million Kisses\" 1989 Best British Dance Act n/a 1989 Best British Newcomer Bros 1989 Best International Male Michael Jackson 1989 Best International Female Tracey Chapman 1989 Best International Group U2 1989 Best International Newcomer Tracey Chapman 1989 Best Soundtrack Buster 1989 Best British Video Best Music Video: Michael Jackson/\"Smooth Criminal\" 1989 Best British Single Fairground Attraction/\"Perfect\" 1989 Best Pop Act n/a 1989 Outstanding Contribution Cliff Richard 1988 Best British Male Solo Artist George Michael 1988 Best British Female Solo Artist Alison Moyet 1988 Best British Group Pet Shop Boys 1988 Best British Album Sting/\"Nothing Like The Sun\" 1988 Best British Dance Act n/a 1988 Best British Newcomer Wet Wet Wet 1988 Best International Male n/a 1988 Best International Female n/a 1988 Best International Group U2 1988 Best International Newcomer Terence Trent D'Arby 1988 Best Soundtrack Phantom Of The Opera 1988 Best British Video Best Music Video: New Order/\"True Faith\" 1988 Best British Single Rick Astley/\"Never Gonna Give You Up\" 1988 Best Pop Act n/a 1988 Outstanding Contribution The Who 1987 Best British Male Solo Artist Peter Gabriel 1987 Best British Female Solo Artist Kate Bush 1987 Best British Group Five Star 1987 Best British Album Dire Straits/\"Brothers In Arms\" 1987 Best British Dance Act n/a 1987 Best British Newcomer The Housemartins 1987 Best International Male n/a 1987 Best International Female n/a 1987 Best International Group The Bangles 1987 Best International Newcomer n/a 1987 Best Soundtrack Top Gun 1987 Best British Video Peter Gabriel/\"Sledgehammer\" 1987 Best British Single Pet Shop Boys/\"West End Girls\" 1987 Best Pop Act n/a 1987 Outstanding Contribution Eric Clapton 1986 Best British Male Solo Artist Phil Collins 1986 Best British Female Solo Artist Annie Lennox 1986 Best British Group Dire Straits 1986 Best British Album n/a 1986 Best British Dance Act n/a 1986 Best British Newcomer n/a 1986 Best International Male n/a 1986 Best International Female n/a 1986 Best International Group Huey Lewis & The News 1986 Best International Newcomer n/a 1986 Best Soundtrack n/a 1986 Best British Video n/a 1986 Best British Single Tears For Fears/\"Everybody Wants To Rule The World\" 1986 Best Pop Act n/a 1986 Outstanding Contribution Wham & Elton John 1985 Best British Male Solo Artist Paul Young 1985 Best British Female Solo Artist Alison Moyet 1985 Best British Group Wham 1985 Best British Album Sade/\"Diamond Life\" 1985 Best British Dance Act n/a 1985 Best British Newcomer n/a 1985 Best International Male n/a 1985 Best International Female n/a 1985 Best International Group n/a 1985 Best International Newcomer n/a 1985 Best Soundtrack Purple Rain 1985 Best British Video n/a 1985 Best British Single Frankie Goes To Hollywood/\"Relax\" 1985 Best Pop Act n/a 1985 Outstanding Contribution The Police 1984 Best British Male Solo Artist David Bowie 1984 Best British Female Solo Artist Annie Lennox 1984 Best British Group Culture Club 1984 Best British Album n/a 1984 Best British Dance Act n/a 1984 Best British Newcomer Paul Young 1984 Best International Male n/a 1984 Best International Female n/a 1984 Best International Group n/a 1984 Best International Newcomer n/a 1984 Best Soundtrack n/a 1984 Best British Video n/a 1984 Best British Single Best Selling Single: Culture Club/\"Karma Chameleon\" 1984 Best Pop Act n/a 1984 Outstanding Contribution George Martin 1983 Best British Male Solo Artist Paul McCartney 1983 Best British Female Solo Artist Kim Wilde 1983 Best British Group Dire Straits 1983 Best British Album Best Selling Album: Barbara Sreisand/\"Love Songs\" 1983 Best British Dance Act n/a 1983 Best British Newcomer Culture Club 1983 Best International Male n/a 1983 Best International Female n/a 1983 Best International Group n/a 1983 Best International Newcomer n/a 1983 Best Soundtrack n/a 1983 Best British Video n/a 1983 Best British Single Best Selling Single: Dexy's Midnight Runners/\"Come On Eileen\" 1983 Best Pop Act n/a 1983 Outstanding Contribution The Beatles 1982 Best British Male Solo Artist Cliff Richard 1982 Best British Female Solo Artist Randy Crawford 1982 Best British Group The Police 1982 Best British Album Best Selling Album: Adam & The Ants/\"Kings Of The Wild Frontier\" 1982 Best British Dance Act n/a 1982 Best British Newcomer The Human League 1982 Best International Male n/a 1982 Best International Female n/a 1982 Best International Group n/a 1982 Best International Newcomer n/a 1982 Best Soundtrack n/a 1982 Best British Video n/a 1982 Best British Single n/a 1982 Best Pop Act n/a 1982 Outstanding Contribution John Lennon 1977 Best British Male Solo Artist Cliff Richard 1977 Best British Female Solo Artist Shirley Bassey 1977 Best British Group The Beatles 1977 Best British Album The Beatles/\"Sgt Pepper's Loneley Heart Club Band\" 1977 Best British Dance Act n/a 1977 Best British Newcomer Julie Covington 1977 Best International Male n/a 1977 Best International Female n/a 1977 Best International Group n/a 1977 Best International Newcomer n/a 1977 Best Soundtrack n/a 1977 Best British Video n/a 1977 Best British Single Queen/\"Bohemian Rhapsody\" 1977 Best Pop Act n/a 1977 Outstanding Contribution L.G. Wood/The Beatles (Joint Winners)\n\n• DATA: download the full spreadsheet\n\n• SOURCE: Brit Awards\n\nNEW! Buy our book\n\n• Facts are Sacred: the power of data (on Kindle)\n\nMore open data\n\nData journalism and data visualisations from the Guardian\n\nWorld government data\n\n• Search the world's government data with our gateway\n\nDevelopment and aid data\n\n• Search the world's global development data with our gateway\n\nCan you do something with this data?\n\n• Flickr Please post your visualisations and mash-ups on our Flickr group\n\n• Contact us at data@guardian.co.uk\n\n• Get the A-Z of data\n\n• More at the Datastore directory\n\n• Follow us on Twitter\n\n• Like us on Facebook"}, {"url": "https://hellomusictheory.com/learn/famous-british-rock-bands-of-the-2000s/", "page_content": "By Dan Farrant\n\nSince the British Invasion, British rock music has influenced the music industry around the world, blending, mutating, and creating new rock subgenres for fans to enjoy.\n\nAlmost every year, rock bands from the UK emerge. In fact, there has been no shortage of British rock bands, even fast-forward several decades and into the 2000s—some with unforgettable hits, others with not-so-memorable ones, but always there was something new.\n\nBut who were those that were most influential and literally rocked the airwaves with their sound? Read on to learn about 11 of the greatest and most famous British Rock Bands of the 2000s.\n\n1. Coldplay\n\nOur first British rock band, Coldplay, emerged on the music scene in 1997. They played mainly small gigs before signing with Parlophone. Soon after, the group released their first album, Parachutes, which won them a Grammy award and an award for Best British Album of the Year 2001.\n\nTheir second album, A Rush of Blood to the Head, released in 2002, is considered one of the greatest records of all time, Rock and Roll Hall of Fame even has it on their 200 Definitive Albums list.\n\nColdplay has since sold over 100 million albums and is widely known as one of the best and most influential indie rock groups of the 21st century.\n\n2. Arctic Monkeys\n\nConsisting initially of Alex Turner, Jamie Cook, Nick O’Malley, and Matt Helders, Arctic Monkeys started in a garage in 2002 and began recording demos shortly after.\n\nFor their demo album Beneath the Boardwalk, they recorded 18 songs. These were burned on blank CDs and distributed to fans outside their concerts. This kind of promotion helped gain them a following after fans began file-sharing their songs.\n\nAfter releasing their first official album, Whatever People Say I Am, That’s What I’m Not, in 2006, it quickly rose to the top of the UK charts and became one the fastest-selling indie rock albums by a British artist.\n\n3. Muse\n\nHailing from Devon, Muse began making their mark on the rock music scene in 1998 when they began playing gigs all around London. The following year, they released their debut album and started to gain popularity.\n\nThroughout the 2000s, Muse produced three chart-topping albums—Absolution, Black Holes and Revelations, and The Resistance. These debuted their unique take on alternative rock music.\n\nLead singer and multi-instrumentalist Matt Bellamy enjoyed experimenting with instruments and sounds, and this experimentation won the band several awards over the decades, including two Grammys, Brit awards, and several MTV music awards.\n\n4. Radiohead\n\nFormed in 1985, Radiohead was already a popular band name in the UK by the time the 2000s rolled in. However, it wasn’t until their third album, OK Computer, in 1997 that the band gained international fame. This would help push them to even greater heights in the next decade.\n\nFrom 2000 to 2007, Radiohead released four albums—Kid A, Amnesiac, Hail to the Thief, and In Rainbows. Each ranked #1 in the UK charts, and all won the band Grammy Awards. Some even landed a place in Rolling Stone‘s 500 Greatest Albums of All Time list.\n\nRadiohead has not stopped there, however. They’ve continued to sell charting singles and albums worldwide even until now.\n\n5. Stereophonics\n\nFormed in 1992 in a small village in Wales, Stereophonics rapidly topped the UK charts with the release of their debut album. However, mainstream success did not come until near the end of the ’90s.\n\nFrom then on, the band constantly hit #1 on the charts with their albums, like 2001’s Just Enough Education to Perform, and 2003’s You Gotta Go There to Come Back. Some of their singles also reached the top five, with “Dakota” ranking at the top in 2005.\n\nStereophonics also spent most of the 2000s touring Europe with other big names like Blur and Oasis, which helped push them further up the popularity ladder.\n\n6. Kaiser Chiefs\n\nAn indie band from Leeds, Kaiser Chiefs, had a rough start to their journey into stardom. The band began creating music under the name Parva. After several failed attempts to sign a record deal and the loss of their label, the band decided to change their name to Kaiser Chiefs.\n\nIn 2004, they began performing live across the UK, and Kaiser Chiefs quickly became best known for their live performances and hit songs like “Ruby.” By 2007, the band was playing sold-out shows of 30,000 audiences.\n\nKaiser Chiefs are still active today and has recently released a single, “How 2 Dance,” in 2022.\n\n7. Kasabian\n\nAnother one of Britain’s well-known live performers is the band Kasabian. They were first known as Saracuse, but after signing with BMG, they changed their name to what they’re currently named.\n\nSince Kasabian’s first album release in 2004, the band has been playing shows and putting out continuous hit records. They’ve won several awards, mostly for their live performances.\n\nKasabian continues to rock stages all across Europe today. They receive many reviews calling them the best live performance in the UK and have made a name for themselves as a must-see act.\n\n8. Blur\n\nOur next British band, Blur, was formed in the late 1980s. During the ’90s, they had chart-topping albums. However, they struggled to keep their fanbase growing. Each album released differed from the last in an attempt to find the right sound for the band.\n\nDuring the 2000s, Blur released only one album. “Think Tank” was dropped in 2003, and the group’s popularity increased more as they began experimenting with sound again. The album featured Blur’s most unique sound, which was a mix of soft electronica with some classic rock sound.\n\nThe band then went on a hiatus as members went on to pursue personal plans. Then in 2009, Blur reunited for a concert and decided to tour again.\n\n9. Keane\n\nFrom East Sussex, alternative rock band Keane came onto the rock scene already at #1 with their first album, Hopes and Fears, in 2004. This album rapidly topped the charts, receiving the title of one of the best rock albums of all time.\n\nTheir second album, Under the Iron Sea, was equally as successful, earning the band a spot in Britain’s best next to bands like the Beatles, Oasis, and Radiohead.\n\nIn 2009, Keane became the first band to ever perform live in 3D on their world tour. In 2013, the band decided to split for some time to work on solo projects and didn’t reunite until 2019.\n\n10. Manic Street Preachers\n\nIn 1986, a group of friends started playing music together and named themselves Manic Street Preachers. By the time the 2000s came in, they had already released five studio albums, with one at the top of the UK charts.\n\nThey had already attracted a large following throughout the UK for their wild lifestyles and media coverage. In the 2000s, Manic Street Preachers continued to ride their wave of success.\n\nThough the albums dropped during that decade were not chart-toppers, they were all within the top 15, and their singles were in the top 20s, with 2000’s “The Masses Against the Classes” their top hit.\n\nManic Street Preachers are still touring today, and they have made a name for themselves as one of the best bands to come out of Wales.\n\n11. The Verve\n\nAn influencing alternative rock band in the ’90s, The Verve began having internal conflicts and disbanded in 1999. However, the band reunited with its original lineup in 2007 and released the album Forth.\n\nFans were ecstatic. The reunion brought The Verve almost immediately to the #1 spot on the UK charts, and their 2007 tour announcement sold out within minutes.\n\nThe excitement of this get-together was short-lived, though. In 2009, The Verve decided to disband for the third time as many of the members pursued solo careers.\n\nSumming Up Our List Of 2000s British Rock Bands\n\nAnd there you have it, dear readers, the best rock bands from the UK during the 2000s. If you’ve listened to any of their music, you would know why they have been considered influential.\n\nEach of their music styles and techniques are unique, but they all stem from one genre loved by many: rock music.\n\nWe hope you enjoyed our list. As mentioned, there were so many popular British rock bands during the 2000s, so we might have missed a few. Let us know who, and we’ll add them!"}, {"url": "https://www.radiox.co.uk/global-awards/stereophonics-honoured-global-special-award/", "page_content": "Stereophonics honoured with Global Special Award\n\namie Morrison, Adam Zindani, Kelly Jones and Richard Jones of Stereophonics during The Global Awards 2020. Picture: Dave J Hogan/Getty Images\n\nThe Welsh band were give a very special accolade at The Global Awards 2020... with tributes from celebrity fans including Sir Tom Jones.\n\nStereophonics have been honoured with the Global Special Award in recognition of their remarkable career which spans over 25 years and their contribution to music and entertainment.\n\nThe band - comprising frontman Kelly Jones, Richard Jones, Adam Zindani and Jamie Morrison - were given the accolade at The Global Awards 2020 with Very.co.uk, which took place at London's Eventim Apollo Hammersmith tonight (5 March). The band also closed the show with a 20 minute set that featured their hits Dakota, C'est La Vie, Bust This Town and Maybe Tomorrow.\n\nIn a special video, stars such as Sir Tom Jones and James Dean Bradfield from Manic Street Preachers paid tribute to the band's incredible career. Sir Tom said: \"\"All the best boys, congratulations. I remember when you were opening for someone else, but let's not get into that. You're from Cwmaman, I'm from Pontypridd. Big town, Pontypridd.\"\n\nIt was the second award for the Welsh band, who also walked home with Best Indie, beating off stiff competition from Sam Fender, The 1975, Twenty One Pilots and Florence + The Machine.\n\nStereophonics in 2018: Adam Zindani, Rchard Jones, Kelly Jones and Jamie Morrison. Picture: Andrew Whitton/Press\n\nHosted by Capital Breakfast’s Roman Kemp, Smooth Radio’s Kate Garraway and Classic FM and Smooth presenter Myleene Klass, The Global Awards celebrates the stars of music, news and entertainment across a wide range of genres.\n\nNow in its third year, the prestigious event brought together all Global’s radio stations including Capital, Heart, Smooth, Classic FM, LBC, Radio X, Capital XTRA and Gold with award categories reflecting the music, programmes, podcasts and news aired on Global’s radio stations and the Global Player app.\n\nThe glittering show featured spectacular live performances from some of the world’s biggest artists – Camila Cabello, Ellie Goulding, Tones And I, Aitch, Aled Jones & Russell Watson and was rounded off with a set by the heroes of the evening, Stereophonics.\n\nWhen Kelly Jones first started writing songs about his hometown of Cwmaman in Wales in the early 90s, he probably didn’t think his band Stereophonics would end up being one of the most successful British acts of the next few decades.\n\nThe trio of Kelly, Richard Jones (no relation) and the much-missed Stuart Cable tried to make it under the name Tragic Love Company, but it was as Stereophonics that they became the first band to be signed to the new label V2.\n\nStuart Cable, Kelly Jones and Richard Jones in Cwmaman In Wales 1997. Picture: Martyn Goodacre/Getty Images\n\nStereophonics burst onto the scene with the single Local Boy In The Photograph, a moving tale of life in South Wales, and the accompanying debut album, Word Gets Around, made the Top 10 in the summer of 1997.\n\nStereophonics - Local Boy In The Photograph\n\nA triple platinum seller, the LP would spawn the hits A Thousand Trees, More Life In A Tramp's Vest and Traffic.\n\nThe trio quickly established themselves as one of the key post-Britpop artists, headlining a huge show at Cardiff Castle in June 1998. Their second album Performance And Cocktails hitting the top of the album charts on its release in March 1999.\n\nIt was the first of five consecutive number 1 albums for Stereophonics - they also made the top with Keep the Village Alive in 2015 and Kind in 2019.\n\n2005's Language. Sex. Violence. Other? gave the world Stereophonics' first number one single: Dakota, a wistful, passionate tune that brought the Phonics to the US airwaves and beyond and went Platinum in the UK.\n\nStereophonics - Dakota (Official Video)\n\nStereophonics have gone on to have ten Top 10 singles, have sold over ten million albums across the world and have headlined Reading & Leeds, V, Isle Of Wight and Glastonbury festivals among many others.\n\n\n\nThey have won the BRIT Award for Best British Breakthrough Act and the Nordoff Robbins Silver Clef Icon Award.\n\nNow, Kelly, Richard, Adam Zindani and Jamie Morrison see in the 2020s with their eleventh studio album, Kind, a huge UK tour and festival appearances across Europe.\n\nThey are one of British rock's most respected, hard-working and loved bands with a back catalogue full of incredible songs like Just Looking, Maybe Tomorrow, Indian Summer and I Want To Get Lost In You."}, {"url": "https://www.musewiki.org/Brit_Awards", "page_content": "2008\n\nBritish Live Act\n\nThe nominees were chosen by a panel of experts.[1] The winner was chosen by listeners of BBC Radio 2.[1]\n\nMuse were nominated.[2] Also nominated: Arctic Monkeys, Kaiser Chiefs, Klaxons, Take That.[1]Take That won.[1]\n\n2007\n\nBest Album\n\nBlack Holes and Revelations was nominated.[3] Also nominated: Back to Black (Amy Winehhouse), Whatever People Say I Am, That's What I'm Not (Arctic Monkeys), Alright Still (Lily Allen) and Eyes Open (Snow Patrol). Arctic Monkeys won.[4]\n\nBest British Group\n\nMuse were nominated.[5] Also nominated: Kasabian, Arctic Monkeys, Razorlight and Snow Patrol. Arctic Monkeys won.[6]\n\nBest Live Act\n\nMuse won.[7] Also nominated: Kasabian, Guillemots, George Michael and Robbie Williams.[8]\n\n2005\n\nBest Live Act\n\nMuse won the award, with Chris and Dom accepting it. Matt was on holiday with his girlfriend.\n\n2004\n\nBest Rock Act\n\nMuse were nominated. Also nominated: Stereophonics, Feeder, Primal Scream, Darkness.[9] The Darkness Won.[10]\n\n2001\n\nBritish Newcomer\n\nMuse were nominated. Also nominated: Coldplay, Death In Vegas, Toploader, Badly Drawn Boy.[11]\n\nReferences\n\n\n\nGo back to awards"}, {"url": "https://www.theguardian.com/news/datablog/2011/feb/16/brit-awards-2011-all-winners-take-that", "page_content": "Take That that stole the show at the Brit awards last night winning Best British group and clocking up a total of eight awards since the Brits started.\n\nOld Brit favourites finally triumphed to win the best British group award after three previous nominations since the groups debut 21 years ago.\n\nThis was the Brit Awards first time at the O2 and was set to coincide with what new Brits chairman promoted as a shakeup of the old, predictable ceremony with one which placed more emphasis on musical merit than in earlier years.\n\nOut of the four nominations which saw Tinie Tempah riding a sea of publicity before the show, he came away with two: British breakthrough act and British single for Pass Out.\n\nMumford & Sons took home the most coveted award of the night, the best British album, for their debut release Sigh No More.\n\nPlan B with his acclaimed No 1 album, The Defamation Of Strickland Banks, bagged best British male solo artist whilst Jessie J walked away with the critic's choice award for act most likely to break through next year.\n\nThe night's mixed bag of results gave Laura Marling best British solo female artist and best British album for Mumford and Sons in a nod to the folk/pop sounds on the rise in the industry.\n\nArcade Fire received two Brits for best international group and best international album alongside the slightly less critically acclaimed and more commercially happy Justin Bieber, for international breakthrough act.\n\nIn recent years our vivid memories recall some interesting collaborative performances - Dizzee and Florence and also Jacko and Jarvis Cocker jump to mind. But let us not forget the winners of the shiny awards - the\n\nDatablog has drawn together a list of all the winners since 1977 from the Brits own archive minus some of the irregular discretionary awards.\n\nNote the inclusion and removal of some awards as they alternate from year to year. The outstanding contribution to music award was moved to the scrap heap this year. The table shows this is one of many categories. The urban/rock/pop act awards were gradually phased out in 2007, American Beauty was the last film to receive best soundtrack and the last selection for best British video was in 2002, when So Solid Crew won for their video 21 seconds.\n\nThe present Brits may be a stripped back version of its former self, but it notably adheres to a pattern which tends to see artists who win British or International album also picking up the Brit for other categories such as best male, female or group.\n\nGive us your opinion on this and past year winners. Can you see anything interesting in the data?\n\nData summary\n\nBrit Award Winners from 2000-2011 Click heading to sort. Download this data Year Category Winner 2011 Best British Male Solo Artist Plan B 2011 Best British Female Solo Artist Laura Marling 2011 Best British Group Take That 2011 Best British Album Mumford and Sons - \"Sigh No More\" 2011 Best British Single Tinie Tempah - \"Pass Out\" 2011 British Breakthrough Act Tinie Tempah 2011 Best International Male Solo Artist Cee Lo Green 2011 Best International Female Solo Artist Rihanna 2011 Best International Group Arcade Fire 2011 Best International Album Arcade Fire - \"The Suburbs\" 2011 International Breakthrough Act Justin Bieber 2011 Critic's Choice Jessie J 2011 Best Producer Markus Dravs 2010 Best British Male Solo Artist Dizzee Rascal 2010 Best British Female Solo Artist Lily Allen 2010 Best British Group Kasabian 2010 Best British Album Florence And The Machine - \"Lungs\" 2010 Best British Single JLS - \"Beat Again\" 2010 British Breakthrough Act JLS 2010 Best International Male Solo Artist Jay-Z 2010 Best International Female Solo Artist Lady Gaga 2010 Best International Album Lady Gaga - \"The Fame\" 2010 British Producer Paul Epworth 2010 International Breakthrough Act Lady Gaga 2010 Outstanding Contribution To Music Robbie Williams 2010 Critic's Choice Ellie Goulding 2009 Best British Male Solo Artist Paul Weller 2009 Best British Female Solo Artist Duffy 2009 Best British Group Elbow 2009 Best British Album Duffy - \"Rockferry\" 2009 Best British Single Girls Aloud - \"The Promise\" 2009 Best British Live Act Iron Maiden 2009 British Breakthrough Act Duffy 2009 Best International Male Solo Artist Kanye West 2009 Best International Female Solo Artist Katy Perry 2009 Best International Album Kings of Leon - \"Only By The Night\" 2009 British Producer Bernard Butler 2009 Best International Group Kings of Leon 2009 Outstanding Contribution To Music Pet Shop Boys 2009 Critic's Choice Florence and the Machine 2008 Best British Male Solo Artist Mark Ronson 2008 Best British Female Solo Artist Kate Nash 2008 Best British Group Arctic Monkeys 2008 Best British Album Arctic Monkeys - \"Favourite Worst Nightmare\" 2008 Best British Single Take That - \"Shine\" 2008 Best British Live Act Take That 2008 British Breakthrough Act Mika 2008 Best International Male Solo Artist Kanye West 2008 Best International Female Solo Artist Kylie Minogue 2008 Best International Album Foo Fighters - \"Echoes, Silence, Patience & Grace\" 2008 Best International Group Foo Fighters 2008 Outstanding Contribution To Music Sir Paul McCartney 2008 Critic's Choice Adele 2007 Best British Male Solo Artist James Morrison 2007 Best British Female Solo Artist Amy Winehouse 2007 Best British Group Arctic Monkeys 2007 Best British Album Arctic Monkeys - \"Whatever People Say I Am, That's What I'm Not\" 2007 Best British Single Take That - \"Patience\" 2007 Best British Live Act Muse 2007 British Breakthrough Act The Fratellis 2007 Best International Male Solo Artist Justin Timberlake 2007 Best International Female Solo Artist Nelly Furtado 2007 Best International Album The Killers - \"Sam's Town\" 2007 Best International Group The Killers 2007 International Breakthrough Act Orson 2007 Outstanding Contribution To Music Oasis 2006 Best British Male Solo Artist James Blunt 2006 Best British Female Solo Artist KT Tunstall 2006 Best British Group Kaiser Chiefs 2006 Best British Album Coldplay - \"X&Y\"\" 2006 Best British Single Coldplay - \"Speed Of Sound\" 2006 Best British Rock Act Kaiser Chiefs 2006 Best British Urban Act Lemar 2006 Best British Live Act Kaiser Chiefs 2006 British Breakthrough Artist Arctic Monkeys 2006 Best Pop Act James Blunt 2006 Best International Male Solo Artist Kanye West 2006 Best International Female Solo Artist Madonna 2006 Best International Album Green Day - \"American Idiot\" 2006 Best International Group Green Day 2006 International Breakthrough Artist Jack Johnson 2006 Outstanding Contribution To Music Paul Weller 2005 Best British Male Solo Artist The Streets 2005 Best British Female Solo Artist Joss Stone 2005 Best British Group Franz Ferdinand 2005 Best British Album Keane - \"Hopes And Fears\" 2005 Best British Single Will Young - \"Your Game\" 2005 Best British Rock Act Franz Ferdinand 2005 Best British Urban Act Joss Stone 2005 Best British Live Act Muse 2005 British Breakthrough Artist Keane 2005 Best Pop Act McFly 2005 Best International Male Solo Artist Eminem 2005 Best International Female Solo Artist Gwen Stefan 2005 Best International Album Scissor Sisters - \"Scissor Sisters\" 2005 Best International Group Scissor Sisters 2005 International Breakthrough Artist Scissor Sisters 2005 Brits 25th Anniversary Best Song Award Robbie Williams - \"Angels\" 2004 Best British Male Solo Artist Daniel Bedingfield 2004 Best British Female Solo Artist Dido 2004 Best British Group Darkness 2004 Best British Album Darkness - \"Permission To Land\" 2004 Best British Single Dido - \"White Flag\" 2004 Best British Rock Act Darkness 2004 Best British Urban Act Lemar 2004 Best British Dance Act Basement Jaxx 2004 British Breakthrough Artist Busted 2004 Best Pop Act Busted 2004 Best International Male Solo Artist Justin Timberlake 2004 Best International Female Solo Artist Beyonce 2004 Best International Album Justin Timberlake - \"Justified\" 2004 Best International Group White Stripes 2004 International Breakthrough Artist 50 Cent 2004 Outstanding Contribution To Music Duran Duran 2003 Best British Male Solo Artist Robbie Williams 2003 Best British Female Solo Artist Ms Dynamite 2003 Best British Group Coldplay 2003 Best British Album Coldplay - \"A Rush Of Blood To The Head\" 2003 Best British Urban Act Ms Dynamite 2003 Best British Dance Act Sugababes 2003 British Breakthrough Artist Will Young 2003 Best International Male Eminem 2003 Best International Female Pink 2003 Best International Group Red Hot Chili Peppers 2003 International Breakthrough Artist Norah Jones 2003 Best International Album Eminem - \"The Eminem Show\" 2003 Best British Video n/a 2003 Best British Single Liberty X - \"Just A Little'\" 2003 Best Pop Act Blue 2003 Outstanding Contribution Tom Jones 2002 Best British Male Solo Artist Robbie Williams 2002 Best British Female Solo Artist Dido 2002 Best British Group Travis 2002 Best British Album Dido - \"No Angel\" 2002 Best British Dance Act Basement Jaxx 2002 Best British Newcomer Blue 2002 Best International Male Shaggy 2002 Best International Female Kylie Minogue 2002 Best International Group Destiny's Child 2002 Best International Newcomer The Strokes 2002 Best International Album Kylie Minogue - \"Fever\" 2002 Best British Video So Solid Crew - \"21 Seconds\" 2002 Best British Single S Club 7 - \"Don't Stop Movin'\" 2002 Best Pop Act Westlife 2002 Outstanding Contribution Sting 2001 Best British Male Solo Artist Robbie Williams 2001 Best British Female Solo Artist Sonique 2001 Best British Group Coldplay 2001 Best British Album Coldplay - \"Parachutes\" 2001 Best British Dance Act Fat Boy Slim 2001 Best British Newcomer A1 2001 Best International Male Eminem 2001 Best International Female Madonna 2001 Best International Group U2 2001 Best International Newcomer Kelis 2001 Best Soundtrack American Beauty 2001 Best British Video Robbie Williams - \"Rock DJ\" 2001 Best British Single Robbie Williams - \"Rock DJ\" 2001 Best Pop Act Westlife 2001 Outstanding Contribution U2 2000 Best British Male Solo Artist Tom Jones 2000 Best British Female Solo Artist Beth Orton 2000 Best British Group Travis 2000 Best British Album Travis - \"The Man Who\" 2000 Best British Dance Act The Chemical Brothers 2000 Best British Newcomer S Club 7 2000 Best International Male Beck 2000 Best International Female Macy Gray 2000 Best International Group TLC 2000 Best International Newcomer Macy Gray 2000 Best Soundtrack Notting Hill 2000 Best British Video Robbie Williams - \"She's The One\" 2000 Best British Single Robbie Williams - \"She's The One\" 2000 Best Pop Act Five 2000 Outstanding Contribution Spice Girls\n\n• DATA: download the full spreadsheet\n\nMore data\n\nData journalism and data visualisations from the Guardian\n\nWorld government data\n\n• Search the world's government data with our gateway\n\nDevelopment and aid data\n\n• Search the world's global development data with our gateway\n\nCan you do something with this data?\n\n• Flickr Please post your visualisations and mash-ups on our Flickr group\n\n• Contact us at data@guardian.co.uk\n\n• Get the A-Z of data\n\n• More at the Datastore directory\n\n• Follow us on Twitter"}, {"url": "https://www.theguardian.com/news/datablog/2012/feb/22/brit-awards-winners-list-2012", "page_content": "It was Adele's year. The artist heads the Brit Awards winners' list for 2012, with 21 selling a copy every seven seconds - and has just won a clutch of Grammys too. Someone Like You has now been seen more than 85m times on YouTube and sales of 21 are already at 17m and expected to top 20m.\n\nThe awards have been going since 1977, when the Best British solo act was Shirley Bassey and the Beatles when a prize for Sergeant Pepper's Lonely Hearts Club Band - already a decade old then. Now the prize is the major award for British music acts, competing only with the Mercury Award for best album. So, how does the 2012 winner's list compare?\n\nSinger-songwriter Ed Sheeran shared the honours – also winning two awards, for best British male solo act and best breakthrough act.\n\nSearch for winners by year\n\nBest British single, voted for by the public, was won by One Direction for What Makes You Beautiful. Rihanna – who performed on the night – took home best international female award and singer-songwriter Bruno Mars was named best international male solo artist.\n\nLana Del Rey was international breakthrough act, after the huge success of her single Video Games.\n\nOlder groups also succeeded. The Foo Fighters were named best international band while Coldplay took home the prize for best British group. And Blur won the award for outstanding contribution.\n\nThe awards have changed a lot since 1977. In that year, there were only seven categories - now there are 13. Each awards reflects the industry of the time, at least recently. Last year, the winners were Take That and Mumford and Sons; in 2005 it was Joss Stone, the Scissor Sisters and Robbie Williams. Some of the older awards appear to be a little more, er, mainstream: in 2000, Tom Jones won Best British Male Solo Artist.\n\nThe full data is below. What can you do with it?\n\nData summary\n\nEvery Brit award winner listed Click heading to sort table. Download this data Year Category Winner 2012 British Male Solo Artist Ed Sheeran 2012 British Female Solo Artist Adele 2012 British Breakthrough Act Ed Sheeran 2012 British Group Coldplay 2012 British Single One Direction/What Makes You Beautiful 2012 British producer Ethan Johns 2012 Mastercard British Album Of The Year Adele/21 2012 International Male Solo Artist Bruno Mars 2012 International Female Solo Artist Rihanna 2012 International Group Foo Fighters 2012 International Breakthrough Act Lana Del Rey 2012 Outstanding Contribution To Music Award Blur 2012 Critics' Choice Emeli Sande 2011 Best British Male Solo Artist Plan B 2011 Best British Female Solo Artist Laura Marling 2011 Best British Group Take That 2011 Best British Album Mumford and Sons/\"Sigh No More\" 2011 Best British Single Tinie Tempah/\"Pass Out\" 2011 British Breakthrough Act Tinie Tempah 2011 Best International Male Solo Artist Cee Lo Green 2011 Best International Female Solo Artist Rihanna 2011 Best International Group Arcade Fire 2011 Best International Album Arcade Fire/\"The Suburbs\" 2011 International Breakthrough Act Justin Bieber 2011 Critic's Choice Jessie J 2011 Best Producer Markus Dravs 2010 Best British Male Solo Artist Dizzee Rascal 2010 Best British Female Solo Artist Lily Allen 2010 Best British Group Kasabian 2010 Best British Album Florence And The Machine/\"Lungs\" 2010 Best British Single JLS/\"Beat Again\" 2010 British Breakthrough Act JLS 2010 Best International Male Solo Artist Jay-Z 2010 Best International Female Solo Artist Lady Gaga 2010 Best International Album Lady Gaga/\"The Fame\" 2010 British Producer Paul Epworth 2010 International Breakthrough Act Lady Gaga 2010 Outstanding Contribution To Music Robbie Williams 2010 Critic's Choice Ellie Goulding 2009 Best British Male Solo Artist Paul Weller 2009 Best British Female Solo Artist Duffy 2009 Best British Group Elbow 2009 Best British Album Duffy/\"Rockferry\" 2009 Best British Single Girls Aloud/\"The Promise\" 2009 Best British Live Act Iron Maiden 2009 British Breakthrough Act Duffy 2009 Best International Male Solo Artist Kanye West 2009 Best International Female Solo Artist Katy Perry 2009 Best International Album Kings of Leon/\"Only By The Night\" 2009 British Producer Bernard Butler 2009 Best International Group Kings of Leon 2009 Outstanding Contribution To Music Pet Shop Boys 2009 Critic's Choice Florence and the Machine 2008 Best British Male Solo Artist Mark Ronson 2008 Best British Female Solo Artist Kate Nash 2008 Best British Group Arctic Monkeys 2008 Best British Album Arctic Monkeys/\"Favourite Worst Nightmare\" 2008 Best British Single Take That/\"Shine\" 2008 Best British Live Act Take That 2008 British Breakthrough Act Mika 2008 Best International Male Solo Artist Kanye West 2008 Best International Female Solo Artist Kylie Minogue 2008 Best International Album Foo Fighters/\"Echoes, Silence, Patience & Grace\" 2008 Best International Group Foo Fighters 2008 Outstanding Contribution To Music Sir Paul McCartney 2008 Critic's Choice Adele 2007 Best British Male Solo Artist James Morrison 2007 Best British Female Solo Artist Amy Winehouse 2007 Best British Group Arctic Monkeys 2007 Best British Album Arctic Monkeys/\"Whatever People Say I Am, That's What I'm Not\" 2007 Best British Single Take That/\"Patience\" 2007 Best British Live Act Muse 2007 British Breakthrough Act The Fratellis 2007 Best International Male Solo Artist Justin Timberlake 2007 Best International Female Solo Artist Nelly Furtado 2007 Best International Album The Killers/\"Sam's Town\" 2007 Best International Group The Killers 2007 International Breakthrough Act Orson 2007 Outstanding Contribution To Music Oasis 2006 Best British Male Solo Artist James Blunt 2006 Best British Female Solo Artist KT Tunstall 2006 Best British Group Kaiser Chiefs 2006 Best British Album Coldplay/\"X&Y\"\" 2006 Best British Single Coldplay/\"Speed Of Sound\" 2006 Best British Rock Act Kaiser Chiefs 2006 Best British Urban Act Lemar 2006 Best British Live Act Kaiser Chiefs 2006 British Breakthrough Artist Arctic Monkeys 2006 Best Pop Act James Blunt 2006 Best International Male Solo Artist Kanye West 2006 Best International Female Solo Artist Madonna 2006 Best International Album Green Day/\"American Idiot\" 2006 Best International Group Green Day 2006 International Breakthrough Artist Jack Johnson 2006 Outstanding Contribution To Music Paul Weller 2005 Best British Male Solo Artist The Streets 2005 Best British Female Solo Artist Joss Stone 2005 Best British Group Franz Ferdinand 2005 Best British Album Keane/\"Hopes And Fears\" 2005 Best British Single Will Young/\"Your Game\" 2005 Best British Rock Act Franz Ferdinand 2005 Best British Urban Act Joss Stone 2005 Best British Live Act Muse 2005 British Breakthrough Artist Keane 2005 Best Pop Act McFly 2005 Best International Male Solo Artist Eminem 2005 Best International Female Solo Artist Gwen Stefan 2005 Best International Album Scissor Sisters/\"Scissor Sisters\" 2005 Best International Group Scissor Sisters 2005 International Breakthrough Artist Scissor Sisters 2005 Brits 25th Anniversary Best Song Award Robbie Williams/\"Angels\" 2004 Best British Male Solo Artist Daniel Bedingfield 2004 Best British Female Solo Artist Dido 2004 Best British Group Darkness 2004 Best British Album Darkness/\"Permission To Land\" 2004 Best British Single Dido/\"White Flag\" 2004 Best British Rock Act Darkness 2004 Best British Urban Act Lemar 2004 Best British Dance Act Basement Jaxx 2004 British Breakthrough Artist Busted 2004 Best Pop Act Busted 2004 Best International Male Solo Artist Justin Timberlake 2004 Best International Female Solo Artist Beyonce 2004 Best International Album Justin Timberlake/\"Justified\" 2004 Best International Group White Stripes 2004 International Breakthrough Artist 50 Cent 2004 Outstanding Contribution To Music Duran Duran 2003 Best British Male Solo Artist Robbie Williams 2003 Best British Female Solo Artist Ms Dynamite 2003 Best British Group Coldplay 2003 Best British Album Coldplay/\"A Rush Of Blood To The Head\" 2003 Best British Urban Act Ms Dynamite 2003 Best British Dance Act Sugababes 2003 British Breakthrough Artist Will Young 2003 Best International Male Eminem 2003 Best International Female Pink 2003 Best International Group Red Hot Chili Peppers 2003 International Breakthrough Artist Norah Jones 2003 Best International Album Eminem/\"The Eminem Show\" 2003 Best British Video n/a 2003 Best British Single Liberty X/\"Just A Little'\" 2003 Best Pop Act Blue 2003 Outstanding Contribution Tom Jones 2002 Best British Male Solo Artist Robbie Williams 2002 Best British Female Solo Artist Dido 2002 Best British Group Travis 2002 Best British Album Dido/\"No Angel\" 2002 Best British Dance Act Basement Jaxx 2002 Best British Newcomer Blue 2002 Best International Male Shaggy 2002 Best International Female Kylie Minogue 2002 Best International Group Destiny's Child 2002 Best International Newcomer The Strokes 2002 Best International Album Kylie Minogue/\"Fever\" 2002 Best British Video So Solid Crew/\"21 Seconds\" 2002 Best British Single S Club 7/\"Don't Stop Movin'\" 2002 Best Pop Act Westlife 2002 Outstanding Contribution Sting 2001 Best British Male Solo Artist Robbie Williams 2001 Best British Female Solo Artist Sonique 2001 Best British Group Coldplay 2001 Best British Album Coldplay/\"Parachutes\" 2001 Best British Dance Act Fat Boy Slim 2001 Best British Newcomer A1 2001 Best International Male Eminem 2001 Best International Female Madonna 2001 Best International Group U2 2001 Best International Newcomer Kelis 2001 Best Soundtrack American Beauty 2001 Best British Video Robbie Williams/\"Rock DJ\" 2001 Best British Single Robbie Williams/\"Rock DJ\" 2001 Best Pop Act Westlife 2001 Outstanding Contribution U2 2000 Best British Male Solo Artist Tom Jones 2000 Best British Female Solo Artist Beth Orton 2000 Best British Group Travis 2000 Best British Album Travis/\"The Man Who\" 2000 Best British Dance Act The Chemical Brothers 2000 Best British Newcomer S Club 7 2000 Best International Male Beck 2000 Best International Female Macy Gray 2000 Best International Group TLC 2000 Best International Newcomer Macy Gray 2000 Best Soundtrack Notting Hill 2000 Best British Video Robbie Williams/\"She's The One\" 2000 Best British Single Robbie Williams/\"She's The One\" 2000 Best Pop Act Five 2000 Outstanding Contribution Spice Girls 1999 Best British Male Solo Artist Robbie Williams 1999 Best British Female Solo Artist Des'ree 1999 Best British Group Manic Street Preachers 1999 Best British Album Manic Street Preachers/\"This Is My Truth Tell Me Yours\" 1999 Best British Dance Act Fat Boy Slim 1999 Best British Newcomer Belle & Sebastian 1999 Best International Male Beck 1999 Best International Female Natalie Imbruglia 1999 Best International Group The Corrs 1999 Best International Newcomer Natalie Imbruglia 1999 Best Soundtrack Titanic 1999 Best British Video Robbie Williams/\"Millennium\" 1999 Best British Single Robbie Williams/\"Angels\" 1999 Best Pop Act n/a 1999 Outstanding Contribution Eurythmics 1998 Best British Male Solo Artist Finley Quaye 1998 Best British Female Solo Artist Shola Ama 1998 Best British Group The Verve 1998 Best British Album The Verve/\"Urban Hymns\" 1998 Best British Dance Act Prodigy 1998 Best British Newcomer Stereophonics 1998 Best International Male Jon Bon Jovi 1998 Best International Female Bjork 1998 Best International Group U2 1998 Best International Newcomer Eels 1998 Best Soundtrack The Full Monty 1998 Best British Video All Saints/\"Never Ever\" 1998 Best British Single All Saints/\"Never Ever\" 1998 Best Pop Act n/a 1998 Outstanding Contribution Fleetwood Mac 1997 Best British Male Solo Artist George Michael 1997 Best British Female Solo Artist Gabrielle 1997 Best British Group Manic Street Preachers 1997 Best British Album Manic Street Preachers/\"Everything Must Go\" 1997 Best British Dance Act Prodigy 1997 Best British Newcomer Kula Shaker 1997 Best International Male Beck 1997 Best International Female Sheryl Crow 1997 Best International Group Fugees 1997 Best International Newcomer Robert Miles 1997 Best Soundtrack Train Spotting 1997 Best British Video Spice Girls/\"Say You'll Be There\" 1997 Best British Single Spice Girls/\"Wannabe\" 1997 Best Pop Act n/a 1997 Outstanding Contribution Bee Gees 1996 Best British Male Solo Artist Paul Weller 1996 Best British Female Solo Artist Annie Lennox 1996 Best British Group Oasis 1996 Best British Album Oasis/\"(What's The Story) Morning Glory?\" 1996 Best British Dance Act Massive Attack 1996 Best British Newcomer Supergrass 1996 Best International Male The Artist 1996 Best International Female Bjork 1996 Best International Group Bon Jovi 1996 Best International Newcomer Alanis Morissette 1996 Best Soundtrack Batman Forever 1996 Best British Video Oasis/\"Wonderwall\" 1996 Best British Single Take That/\"Back for Good\" 1996 Best Pop Act n/a 1996 Outstanding Contribution David Bowie 1995 Best British Male Solo Artist Paul Weller 1995 Best British Female Solo Artist Eddie Reader 1995 Best British Group Blur 1995 Best British Album Blur/\"Parklife\" 1995 Best British Dance Act M People 1995 Best British Newcomer Oasis 1995 Best International Male The Artist 1995 Best International Female KD Lang 1995 Best International Group REM 1995 Best International Newcomer Lisa Loeb 1995 Best Soundtrack Pulp Fiction 1995 Best British Video Blur/\"Parklife\" 1995 Best British Single Blur/\"Parklife\" 1995 Best Pop Act n/a 1995 Outstanding Contribution Elton John 1994 Best British Male Solo Artist Sting 1994 Best British Female Solo Artist Dina Carroll 1994 Best British Group Stereo MC's 1994 Best British Album Stereo MC's/\"Connected\" 1994 Best British Dance Act M People 1994 Best British Newcomer Gabrielle 1994 Best International Male Lenny Kravitz 1994 Best International Female Bjork 1994 Best International Group Crowded House 1994 Best International Newcomer Bjork 1994 Best Soundtrack The Bodyguard 1994 Best British Video Take That/\"Pray\" 1994 Best British Single Take That/\"Pray\" 1994 Best Pop Act n/a 1994 Outstanding Contribution Van Morrison 1993 Best British Male Solo Artist Mick Hucknall 1993 Best British Female Solo Artist Annie Lennox 1993 Best British Group Simply Red 1993 Best British Album Annie Lennox/\"Diva\" 1993 Best British Dance Act n/a 1993 Best British Newcomer Tasmin Archer 1993 Best International Male n/a 1993 Best International Female n/a 1993 Best International Group REM 1993 Best International Newcomer Nirvana 1993 Best Soundtrack Wayne's World 1993 Best British Video Shakespear's Sister/\"Stay\" 1993 Best British Single Take That/\"Could it be Magic\" 1993 Best Pop Act n/a 1993 Outstanding Contribution Rod Stewart 1992 Best British Male Solo Artist Seal 1992 Best British Female Solo Artist Lisa Stansfield 1992 Best British Group The KLF/Simply Red (Joint Winners) 1992 Best British Album Seal/\"Seal\" 1992 Best British Dance Act n/a 1992 Best British Newcomer Beverley Craven 1992 Best International Male n/a 1992 Best International Female n/a 1992 Best International Group U2 1992 Best International Newcomer PM Dawn 1992 Best Soundtrack The Commitments 1992 Best British Video Seal/\"Killer\" 1992 Best British Single Queen/\"These Are The Best Days Of Our Lives\" 1992 Best Pop Act n/a 1992 Outstanding Contribution Freddie Mercury 1991 Best British Male Solo Artist Elton John 1991 Best British Female Solo Artist Lisa Stansfield 1991 Best British Group The Cure 1991 Best British Album George Michael/\"Listen Without Predudice Vol.1\" 1991 Best British Dance Act n/a 1991 Best British Newcomer Betty Boo 1991 Best International Male Michael Hutchence 1991 Best International Female Sinead O'Connor 1991 Best International Group INXS 1991 Best International Newcomer MC Hammer 1991 Best Soundtrack Twin Peaks 1991 Best British Video The Beautiful South/\"A Little Time\" 1991 Best British Single Depeche Mode 1991 Best Pop Act n/a 1991 Outstanding Contribution Status Quo 1990 Best British Male Solo Artist Phil Collins 1990 Best British Female Solo Artist Annie Lennox 1990 Best British Group Fine Young Cannibals 1990 Best British Album Fine Young Cannibals/\"The Raw And The Cooked\" 1990 Best British Dance Act n/a 1990 Best British Newcomer Lisa Stansfield 1990 Best International Male n/a 1990 Best International Female n/a 1990 Best International Group U2 1990 Best International Newcomer Neneh Cherry 1990 Best Soundtrack Batman 1990 Best British Video Best Music Video: The Cure/\"Lullaby\" 1990 Best British Single Phil Collins/\"Another Day In Parasdise\" 1990 Best Pop Act n/a 1990 Outstanding Contribution Queen 1989 Best British Male Solo Artist Phil Collins 1989 Best British Female Solo Artist Annie Lennox 1989 Best British Group Erasure 1989 Best British Album Fairground Attraction/\"First Of A Million Kisses\" 1989 Best British Dance Act n/a 1989 Best British Newcomer Bros 1989 Best International Male Michael Jackson 1989 Best International Female Tracey Chapman 1989 Best International Group U2 1989 Best International Newcomer Tracey Chapman 1989 Best Soundtrack Buster 1989 Best British Video Best Music Video: Michael Jackson/\"Smooth Criminal\" 1989 Best British Single Fairground Attraction/\"Perfect\" 1989 Best Pop Act n/a 1989 Outstanding Contribution Cliff Richard 1988 Best British Male Solo Artist George Michael 1988 Best British Female Solo Artist Alison Moyet 1988 Best British Group Pet Shop Boys 1988 Best British Album Sting/\"Nothing Like The Sun\" 1988 Best British Dance Act n/a 1988 Best British Newcomer Wet Wet Wet 1988 Best International Male n/a 1988 Best International Female n/a 1988 Best International Group U2 1988 Best International Newcomer Terence Trent D'Arby 1988 Best Soundtrack Phantom Of The Opera 1988 Best British Video Best Music Video: New Order/\"True Faith\" 1988 Best British Single Rick Astley/\"Never Gonna Give You Up\" 1988 Best Pop Act n/a 1988 Outstanding Contribution The Who 1987 Best British Male Solo Artist Peter Gabriel 1987 Best British Female Solo Artist Kate Bush 1987 Best British Group Five Star 1987 Best British Album Dire Straits/\"Brothers In Arms\" 1987 Best British Dance Act n/a 1987 Best British Newcomer The Housemartins 1987 Best International Male n/a 1987 Best International Female n/a 1987 Best International Group The Bangles 1987 Best International Newcomer n/a 1987 Best Soundtrack Top Gun 1987 Best British Video Peter Gabriel/\"Sledgehammer\" 1987 Best British Single Pet Shop Boys/\"West End Girls\" 1987 Best Pop Act n/a 1987 Outstanding Contribution Eric Clapton 1986 Best British Male Solo Artist Phil Collins 1986 Best British Female Solo Artist Annie Lennox 1986 Best British Group Dire Straits 1986 Best British Album n/a 1986 Best British Dance Act n/a 1986 Best British Newcomer n/a 1986 Best International Male n/a 1986 Best International Female n/a 1986 Best International Group Huey Lewis & The News 1986 Best International Newcomer n/a 1986 Best Soundtrack n/a 1986 Best British Video n/a 1986 Best British Single Tears For Fears/\"Everybody Wants To Rule The World\" 1986 Best Pop Act n/a 1986 Outstanding Contribution Wham & Elton John 1985 Best British Male Solo Artist Paul Young 1985 Best British Female Solo Artist Alison Moyet 1985 Best British Group Wham 1985 Best British Album Sade/\"Diamond Life\" 1985 Best British Dance Act n/a 1985 Best British Newcomer n/a 1985 Best International Male n/a 1985 Best International Female n/a 1985 Best International Group n/a 1985 Best International Newcomer n/a 1985 Best Soundtrack Purple Rain 1985 Best British Video n/a 1985 Best British Single Frankie Goes To Hollywood/\"Relax\" 1985 Best Pop Act n/a 1985 Outstanding Contribution The Police 1984 Best British Male Solo Artist David Bowie 1984 Best British Female Solo Artist Annie Lennox 1984 Best British Group Culture Club 1984 Best British Album n/a 1984 Best British Dance Act n/a 1984 Best British Newcomer Paul Young 1984 Best International Male n/a 1984 Best International Female n/a 1984 Best International Group n/a 1984 Best International Newcomer n/a 1984 Best Soundtrack n/a 1984 Best British Video n/a 1984 Best British Single Best Selling Single: Culture Club/\"Karma Chameleon\" 1984 Best Pop Act n/a 1984 Outstanding Contribution George Martin 1983 Best British Male Solo Artist Paul McCartney 1983 Best British Female Solo Artist Kim Wilde 1983 Best British Group Dire Straits 1983 Best British Album Best Selling Album: Barbara Sreisand/\"Love Songs\" 1983 Best British Dance Act n/a 1983 Best British Newcomer Culture Club 1983 Best International Male n/a 1983 Best International Female n/a 1983 Best International Group n/a 1983 Best International Newcomer n/a 1983 Best Soundtrack n/a 1983 Best British Video n/a 1983 Best British Single Best Selling Single: Dexy's Midnight Runners/\"Come On Eileen\" 1983 Best Pop Act n/a 1983 Outstanding Contribution The Beatles 1982 Best British Male Solo Artist Cliff Richard 1982 Best British Female Solo Artist Randy Crawford 1982 Best British Group The Police 1982 Best British Album Best Selling Album: Adam & The Ants/\"Kings Of The Wild Frontier\" 1982 Best British Dance Act n/a 1982 Best British Newcomer The Human League 1982 Best International Male n/a 1982 Best International Female n/a 1982 Best International Group n/a 1982 Best International Newcomer n/a 1982 Best Soundtrack n/a 1982 Best British Video n/a 1982 Best British Single n/a 1982 Best Pop Act n/a 1982 Outstanding Contribution John Lennon 1977 Best British Male Solo Artist Cliff Richard 1977 Best British Female Solo Artist Shirley Bassey 1977 Best British Group The Beatles 1977 Best British Album The Beatles/\"Sgt Pepper's Loneley Heart Club Band\" 1977 Best British Dance Act n/a 1977 Best British Newcomer Julie Covington 1977 Best International Male n/a 1977 Best International Female n/a 1977 Best International Group n/a 1977 Best International Newcomer n/a 1977 Best Soundtrack n/a 1977 Best British Video n/a 1977 Best British Single Queen/\"Bohemian Rhapsody\" 1977 Best Pop Act n/a 1977 Outstanding Contribution L.G. Wood/The Beatles (Joint Winners)\n\n• DATA: download the full spreadsheet\n\nMore open data\n\nData journalism and data visualisations from the Guardian\n\nWorld government data\n\n• Search the world's government data with our gateway\n\nDevelopment and aid data\n\n• Search the world's global development data with our gateway\n\nCan you do something with this data?\n\n• Flickr Please post your visualisations and mash-ups on our Flickr group\n\n• Contact us at data@guardian.co.uk\n\n• Get the A-Z of data\n\n• More at the Datastore directory\n\n• Follow us on Twitter\n\n• Like us on Facebook"}, {"url": "https://www.wikiwand.com/en/British_Single_of_the_Year", "page_content": "The BRIT Awards (often simply called the BRITs) are the British Phonographic Industry's annual popular music awards. The name was originally a shortened form of \"British\", \"Britain\", or \"Britannia\" (in the early days the awards were sponsored by Britannia Music Club), but subsequently became a backronym for British Record Industry Trusts Show.[2] In addition, an equivalent awards ceremony for classical music, called the Classic BRIT Awards, is held in May. The awards were first held in 1977 and originated as an annual event in 1982 under the auspices of the British record industry's trade association, the BPI. In 1989, they were renamed The BRIT Awards.[3] Mastercard has been the long-term sponsor of the event.[4]\n\nBritish popular music awards\n\nExterior of the O 2 Arena in London (host venue since 2011) for the 2020 Brit Awards\n\nThe highest profile music awards ceremony in the UK, the BRIT Awards have featured some of the most notable events in British popular culture, such as the final public appearance of Freddie Mercury, the Jarvis Cocker protest against Michael Jackson, the height of a high-profile feud between Oasis and fellow Britpop band Blur, the Union Jack dress worn by Geri Halliwell of the Spice Girls, and a Chumbawamba member throwing a bucket of iced water over then-Deputy Prime Minister John Prescott.[5][6][7][8] These moments took place in the 1990s when the ceremony had a reputation for being “a little shambolic, unpredictable and, at times, anarchic” with a criticism it has lost its edge since then and “evolved into a more polished, sanitised affair.”[9]\n\nThe BRIT Awards were broadcast live until 1989, when Samantha Fox and Mick Fleetwood hosted a widely criticised show in which little went as rehearsed.[10] From 1990 to 2006, the event was recorded and broadcast the following night. From 2007, The BRIT Awards reverted to a live broadcast on British television, on 14 February on ITV.[10] That year, comedian Russell Brand was the host and three awards were dropped from the ceremony: British Rock Act, British Urban Act and British Pop Act.[10] For the last time, on 16 February 2010, Earls Court in London was the venue for The BRITs. The BRIT Awards were held at the O 2 Arena in London for the first time in 2011.[11]\n\nThe BRIT Award statuette given to the winners features Britannia, the female personification of Britain. Since 2011, the statuette has been regularly redesigned by well known British artists, architects, and designers including Vivienne Westwood,[12] Damien Hirst,[13] Tracey Emin,[14] Peter Blake,[15] Zaha Hadid,[16] Anish Kapoor,[17] David Adjaye,[18] Yinka Ilori and Es Devlin,[19] Pam Hogg,[20] and Oluola Slawn.[21] In 1992, KLF opened the show and invited extreme metal band Extreme Noise Terror on stage, complete with flame-throwers, and fired machine gun blanks over the crowd. The group sent a dead sheep to the aftershow party, and later buried their BRIT Award statuette at Stonehenge signifying their abhorrence of the music industry.[9] Robbie Williams holds the record for the most BRIT Awards, 13 as a solo artist and another five as part of Take That.[22] Girl group Little Mix made history at the Brit Awards 2021, when they became the first female group to receive the award for Best Group at the ceremony after 43 years since it was first introduced.[23]"}]}