{"Stereophonics have won two Ivor Novello Awards for songwriting.": [{"url": "https://ivorsacademy.com/news/winners-of-the-ivors-2023-announced/", "page_content": "The Ivors Academy has announced this year's winners, celebrating the very best in songwriting and composing for screen.\n\nThe Ivors Academy has announced the winners of this year’s Ivor Novello Awards with Amazon Music at Grosvenor House, London, on Thursday 18th May.\n\nIn the 68th year of The Ivors, 30 songwriters and composers collected Ivor Novello Awards across 14 categories in recognition of outstanding achievements in songwriting and composing for screen.\n\nThis year’s Songwriter of the Year Award with Amazon Music went to Wet Leg’s Rhian Teasdale and Hester Chambers. Wet Leg’s debut album took the music industry by storm on its release last year, topping the charts and spawning the hit singles ‘Wet Dream’ and ‘Chaise Longue’. The Ivors judges described Teasdale and Chambers’ writing as fresh, unapologetic and direct, with surprising melodies that demand attention.\n\nBest Contemporary Song went to Raye, 070 Shake and Mike Sabath for ‘Escapism’ – which Raye performed live at the awards ceremony. Described by the judges as daring, brave and empowering songwriting, the track found huge success after going viral on TikTok, marking Raye’s first ever number one single in the UK, where it was also certified platinum.\n\nIn recognition of the massive impact her musical vision has made on her fellow songwriters, hyper-pop trailblazer Charli XCX is awarded the Visionary Award with Amazon Music.\n\nHarry Styles, Kid Harpoon and Tyler Johnson, together win PRS for Music Most Performed Work for their collaboration on the UK’s biggest song of 2022, ‘As It Was’. This marks the third Ivor Novello Award each for the fruitful partnership of Harry Styles and Kid Harpoon, who won both PRS for Music Most Performed Work for ‘Adore You’ and Songwriter of the Year in 2021.\n\nWith over 40 million records sold worldwide, the Special International Award celebrates the outstanding career and influence of Blondie’s Debbie Harry and Chris Stein. Emerging from the New York new wave scene in the mid-seventies, the group have written a huge number of celebrated songs throughout their illustrious career and remain one of the world’s most influential bands.\n\nBest Album goes to 11 by SAULT, written by Dean “Inflo” Josiah Cover, Jamar McNaughton, Cleopatra Nikolic and Jack Peñate. Drawing from Afrobeat and blues influences, 11 was one of five critically acclaimed albums released for free simultaneously by SAULT in November 2022. Dean “Inflo” Josiah Cover’s win marks the significant achievement of his fourth Ivor Novello Award.\n\nBest Song Musically and Lyrically goes to ‘King’ by Florence + the Machine, written by Florence Welch and Jack Antonoff. Considered a standout from the group’s last album, Dance Fever, the song discusses Welch’s conflict in choosing between her career and starting a family as well as gender expectations for women in society.\n\nKAMILLE’s impressive body of work was recognised with the Outstanding Song Collection award. KAMILLE has built a career as one of Britain’s most successful songwriters, working with artists such as Mabel, The Saturdays, Dua Lipa and, most famously, Little Mix, for whom she wrote over 30 songs including the number one hits ‘Black Magic’ and ‘Shout Out To My Ex’. On top of her songwriting achievements, she has also launched a career as an artist in her own right.\n\nThe PRS for Music Icon Award goes to Tim Booth, Saul Davies, Jim Glennie, Larry Gott and Mark Hunter for James. From their original breakthrough in the ‘Madchester’ scene of the early nineties, James have become an enduring gem of British music, selling over 25 million albums over their 39-year career.\n\nThe Rising Star Award with Amazon Music has been awarded to singer-songwriter Victoria Canal, who counts legendary names in Chris Martin and Jon Hopkins amongst her admirers and mentors. She is the fourth consecutive female songwriter to pick up the award since it was introduced in 2020, with The Ivors judges complementing her powerful songwriting and compelling sound.\n\nSting received the Fellowship of The Ivors Academy, the highest honour the Academy bestows. With over 100 million albums sold throughout his career from his combined work with The Police and as a solo artist, Sting is one of Britain’s most successful, accomplished, and pioneering songwriters. Among his countless accolades, he has won seven Ivor Novellos, including the prestigious Lifetime Achievement Award in 2002. He joins an illustrious list of Fellows that includes Sir Paul McCartney, Kate Bush CBE and Joan Armatrading MBE.\n\nHannah Peel won Best Television Soundtrack for her work on The Midwich Cuckoos. Hannah’s innovative approach and electronic sensibilities saw her using analogue synthesisers, tape manipulations, drones and woodwind in an imaginative and otherworldly way.\n\nJohn Powell wins Best Original Film Score for Don’t Worry Darling, a film which featured fellow Ivor Novello winner Harry Styles in an acting role. Directed by Olivia Wilde, the film yearns for romance despite its dark overtones, with a compelling and subversive score that marks John Powell’s fifth Ivor Novello Award.\n\nThe award for Best Original Video Game Score goes to Gareth Coker, Grant Kirkhope and Yoko Shimomura for Mario + Rabbids Sparks of Hope. Each composer is renowned for their work including Nintendo classics such as Donkey Kong 64 and Super Mario RPG.\n\nTom Gray, Chair of The Ivors Academy, said “On behalf of The Ivors Academy of songwriters and composers I wholeheartedly congratulate all of our winners. When we choose to reward one of our number, when we recognise and validate their work, we are saying that as an Ivor Novello award winner, you represent the very best of us.”\n\nFor the first time in years, the awards show featured live performances from Sting, who delighted attendees with a rendition of the classic ‘Message In A Bottle’, Raye, who performed her chart-topping hit ‘Escapism’ and Matilda Mann, who unveiled a stunning cover of ‘Heart of Glass’ in honour of two of the honourees – Debbie Harry and Chris Stein.\n\nTitle sponsor and collaborator Amazon Music scaled up The Ivors’ reach with the first ever livestream from the event. Presented by +44 Podcast hosts Zeze Millz and Sideman, as well as radio DJ Zach Sang, the livestream featured live coverage direct from The Ivors red carpet, plus the award show performances, and backstage interviews with the winners.\n\nIn a special edition of The Zach Sang Show, Amazon Music Breakthrough UK: Artist to Watch 2023, Henry Moodie, performed his songs ‘pick up the phone’ and ‘drunk text’, as well as a cover of the classic ‘Every Breath You Take’, originally penned by this year’s Fellow of The Ivors Academy, Sting, for The Police.\n\nFinally, Matilda Mann, Henry Moodie and Kurt Vile will today each release new Amazon Original tracks tributing three of the 2023 Ivor Novello winners. Matilda Mann covers Blondie’s “Heart of Glass,” which she performed during the awards, Henry Moodie covers Sting’s “Every Breath You Take” which he performed during the Amazon Music livestream, and Kurt Vile covers Charli XCX’s “Constant Repeat.”\n\nIn addition to these special Amazon Original tracks tributing three of the 2023 Ivor Novello winners, Amazon Music listeners can access hundreds of Amazon Originals, featuring both emerging and established artists across numerous genres, available to stream only on Amazon Music.\n\nThe 2023 winners:\n\nAcademy Fellowship\n\nSting\n\nBest Album\n\n11\n\nwritten by Dean “Inflo” Josiah Cover, Jamar McNaughton, Cleopatra Nikolic and Jack Peñate\n\nperformed by SAULT\n\npublished in the UK by Copyright Control and Sentric Music\n\nBest Contemporary Song\n\nEscapism\n\nwritten by 070 Shake, Raye and Mike Sabath\n\nperformed by Raye and 070 Shake\n\npublished in the UK by Sony Music Publishing and Warner Chappell Music\n\nBest Original Film Score\n\nDon’t Worry Darling\n\nComposed by John Powell\n\npublished in the UK by Universal Music Publishing\n\nBest Original Video Game Score\n\nMario + Rabbids Sparks of Hope\n\nComposed by Gareth Coker, Grant Kirkhope and Yoko Shimomura\n\nBest Song Musically and Lyrically\n\nKing\n\nwritten by Jack Antonoff and Florence Welch\n\nperformed by Florence + The Machine\n\npublished in the UK by Ducky Donath Music-Sony Music Publishing and Universal Music Publishing\n\nBest Television Soundtrack\n\nThe Midwich Cuckoos\n\nComposed by Hannah Peel\n\npublished in the UK by SATV Publishing\n\nOutstanding Song Collection\n\nKamille\n\nPRS for Music Icon Award\n\nTim Booth, Saul Davies, Jim Glennie, Larry Gott and Mark Hunter for James\n\nPRS for Music Most Performed Work\n\nAs It Was\n\nwritten by Kid Harpoon,Tyler Johnson and Harry Styles\n\nperformed by Harry Styles\n\npublished in the UK by Universal Music Publishing and Pulse Songs-Concord Music Publishing\n\nRising Star Award with Amazon Music\n\nVictoria Canal\n\nSongwriter of the Year with Amazon Music\n\nRhian Teasdale and Hester Chambers\n\nSpecial International Award\n\nDebbie Harry and Chris Stein\n\nVisionary Award with Amazon Music\n\nCharli XCX"}, {"url": "https://ivorsacademy.com/news/winners-of-the-ivors-2022-announced/", "page_content": "The Ivors Academy has announced this year's winners, celebrating the very best in songwriting and composing for screen.\n\nThe Ivors Academy has announced the winners of this year’s Ivor Novello Awards at Grosvenor House, London, on Thursday 19th May.\n\nRecognised as a pinnacle of creative musical achievement since they were first presented in 1956, winning an Ivor Novello Award holds a special place in music, as they are judged by award-winning songwriters and composers from The Ivors Academy.\n\nIn the 67th year of The Ivors, 21 songwriters and composers collected Ivor Novello Awards across 14 categories, in recognition of outstanding achievements in songwriting and composing for screen.\n\nThis year’s Songwriter of the Year accolade has been awarded to rapper Dave. Having dropped the surprise Top 10 single Titanium in 2021, Dave’s second album We’re All Alone In This Together then hit number one in the UK. It spawned three simultaneous Top 10 singles – Clash, featuring Stormzy, Verdansk and In The Fire.\n\nDave’s 2021 wasn’t just restricted to his own superlative work however – as part of his ongoing collaboration with Fredo, he co-wrote the huge tracks, Back To Basics and Money Talks. This is Dave’s fourth Ivor Novello Award, having previously won Best Contemporary Song three times for Question Time in 2018, Black in 2020 and Children of the Internet last year.\n\nWith a catalogue of over 140 songs and more than 80 million record sales, the Special International Award with Apple Music celebrates the global impact and songwriting achievements of Columbian superstar Shakira.\n\nEd Sheeran, Fred again.. and Johnny McDaid, together win PRS for Music Most Performed Work for their collaboration on the UK’s biggest song of 2021, Bad Habits. This is Ed Sheeran’s fifth Ivor Novello Award, having won this category in 2018, along with Johnny McDaid for Shape of You, Best Song Musically and Lyrically back in 2012 for The A Team and Songwriter of the Year twice. It is songwriter and producer Fred again..’s first Ivor Novello Award.\n\nPrevious nominee Sam Fender has taken home his first Ivor Novello Award after winning Best Song Musically and Lyrically, for his hit Seventeen Going Under. The song chronicles Fender’s life at the age of 17 and the challenges he and his mother faced.\n\nBest Contemporary Song went to Dean ‘Inflo’ Josiah Cover and Little Simz for I Love You, I Hate You. A searingly honest, poignant and powerful address to Little Simz’ father from the album Sometimes I Might Be Introvert. This win follows the pair’s success in 2020 when they collected an Ivor Novello Award for the album Grey Area.\n\nThe Rising Star Award with Apple Music has been awarded to singer-songwriter Naomi Kimpenu, whose debut EP Prelude was released last year. The stunning four-track collection is described by The Ivors Academy as, “the ideal calling card, serving notice of what her perfectly poised vocals and sincere songwriting can do.” She is the third consecutive female songwriter to pick up the award since its inception in 2020.\n\nPink Noise, performed and written by Laura Mvula with Dann Hume, wins Best Album. Pink Noise is described as an album borne out of both intense struggles, positive realisations, and an exploration of personal and professional breakups.\n\nDaniel Blumberg wins Best Original Film Score for his work on The World To Come, seeing him receive his first Ivor Novello Award. Set against the backdrop of the mid-19th century American East Coast frontier, the film had its world premiere at the 77th Venice International Film Festival, where it won the Queer Lion award for best LGBTQI+ themed film at the festival, before it was released last year.\n\nComposer Arthur Sharpe has won Best Television Soundtrack for his work on Sky Atlantic’s black comedy drama, Landscapers, based on a true-story and starring Emmy, Golden Globe and Academy Award winner Olivia Coleman.\n\nThe award for Best Original Video Game Score goes to Richard Jacques for Marvel’s Guardians of the Galaxy. Richard’s previous work includes critically acclaimed orchestral scores for blockbuster franchises such as James Bond 007: Blood Stone, Sonic the Hedgehog and Starship Troopers.\n\nPeter Gabriel received Fellowship of The Ivors Academy in recognition of his outstanding contributions as a musician, innovator, humanitarian and songwriter. Fellowship is the highest honour the Academy bestows, recognising excellence and impact in the art and craft of music creation. Peter has previously won Ivor Novello Awards for Don’t Give Up in 1987, for his Outstanding Contribution to British Music as a founding member of Genesis in 1983 and was recognised with a Lifetime Achievement award in 2007.\n\nThe PRS for Music Icon Award recognises two of rock’s most inspiring, influential, and identifiable songwriters – The Cure’s Robert Smith and Simon Gallup. They are true cultural icons who have changed the face of popular music across the last four decades as songwriters for The Cure.\n\nPaul Heaton has been awarded Outstanding Song Collection for his work with The Housemartins through to The Beautiful South and his current collaboration with Jacqui Abbott. He has shown an exceptional talent at observing, and challenging society with a pop sensibility that has resulted in eighteen UK Top 10 albums and a place as one of this country’s finest songwriters.\n\nIn recognition of the influence of the unique sound world of Scottish band Cocteau Twins, The Ivors Academy also celebrated the creative genius of songwriters Elizabeth Fraser, Robin Guthrie and Simon Raymonde with the Visionary Award.\n\nAlso announced at the ceremony was the retirement of long-time ceremony host Paul Gambaccini. Paul hosted his first Ivor Novello Award ceremony in 1988 and has presented the awards every year since, only missing 2020 when the winners were announced online. In recognition of this, Academy Fellow Joan Armatrading presented him with a unique statuette to acknowledge his contribution to the awards. The Academy also announced that the new host for The Ivors in 2023 is Lauren Laverne.\n\nAt the ceremony last year’s Songwriter of the Year Jamie Hartman and multi award-winning producer and musician Paul Epworth gave their backing to TheWRD from The Ivors Academy, a recently launched pre-degree diploma in creative entrepreneurship. TheWRD is designed to help open access to the creative industries by bringing together music industry leaders, expert educators and deep learning AI to provide new opportunities for students aged 19 plus to start a career in the music industry or go onto further study.\n\nShaznay Lewis, Ivor Novello Award winner and judge for The Ivors, said, “I’m absolutely thrilled for this year’s winners, who have joined an ever-expanding list of legendary songwriters and screen composers. It is a privilege to experience such an immensely powerful, emotive and eclectic range of music. Huge congratulations to everyone who took home awards, and every single songwriter and composer nominated.”\n\nThe 2022 winners are:\n\nAcademy Fellowship\n\nPeter Gabriel\n\nBest Album\n\nPink Noise\n\nwritten by Dann Hume and Laura Mvula\n\nperformed by Laura Mvula\n\npublished in the UK by Sony Music Publishing and Universal Music Publishing\n\nBest Contemporary Song\n\n\n\nI Love You, I Hate You\n\nwritten by Dean ‘Inflo’ Josiah Cover and Little Simz\n\nperformed by Little Simz\n\npublished in the UK by Universal Music Publishing\n\nBest Original Film Score\n\n\n\nThe World To Come\n\nComposed by Daniel Blumberg\n\npublished in the UK by Wise Music Group\n\nBest Original Video Game Score\n\n\n\nMarvel’s Guardians of the Galaxy\n\nComposed by Richard Jacques\n\nBest Song Musically and Lyrically\n\nSeventeen Going Under\n\nWritten and performed by Sam Fender\n\npublished in the UK by Kobalt Music Publishing\n\n\n\nBest Television Soundtrack\n\nLandscapers\n\nComposed by Arthur Sharpe\n\npublished in the UK by BDi Music Ltd obo Sister Pictures Ltd and SATV Publishing\n\nOutstanding Song Collection\n\nPaul Heaton\n\nPRS for Music Most Performed Work\n\n\n\nBad Habits\n\nwritten by Fred again.., Johnny McDaid and Ed Sheeran\n\nperformed by Ed Sheeran\n\npublished in the UK by Promised Land Music-Universal Music Publishing, Sony Music Publishing and Ed Sheeran Ltd-Sony Music Publishing\n\nPRS for Music Icon Award\n\nRobert Smith and Simon Gallup\n\nRising Star Award with Apple Music\n\nNaomi Kimpenu\n\nSongwriter of the Year\n\nDave\n\nSpecial International Award with Apple Music\n\nShakira\n\nVisionary Award\n\nElizabeth Fraser, Robin Guthrie and Simon Raymonde\n\n@IvorsAcademy #TheIvors\n\nThe Ivors on Apple Music"}, {"url": "https://ivorsacademy.com/news/the-ivors-with-apple-music-2021-winners-announced/", "page_content": "The Ivors Academy has announced the winners at this year's ceremony, celebrating the very best in songwriting and screen composition.\n\nRecognised as a pinnacle of creative musical achievement since they were first presented in 1956, Ivor Novello Awards have a special place in the music community as they are judged and awarded by songwriters and composers to their peers.\n\nThis year, 70% of the twenty-six songwriters and composers recognised with an Ivor are picking up an award for the first time.\n\nThe winners\n\nAdore You, performed and written by Harry Styles with Amy Allen, Tyler Johnson and Kid Harpoon wins the PRS for Music Most Performed Work of 2020. It is the first Ivor win for Harry Styles and all the writers on the track. Adore You was the second single from Harry Styles’ Grammy nominated and UK double platinum selling album Fine Line.\n\nLianne La Havas’ self-titled album wins the Ivor Novello Award for Best Album, written with Matthew Hales. A stunning concept album, its song cycle depicts the stages of a relationship from early romance to its end. This is their first Ivor, having both been first been nominated in 2013 for Lianne La Havas’ debut album, Is Your Love Big Enough?\n\nBest Song Musically and Lyrically goes to Obongjayar and Barney Lister in their first Ivor win for God’s Own Children, from the EP Which Way Is Forward?, which Obongjayar describes as “a project about love, family, self-empowerment and self-belief.”\n\nChildren of the Internet by Dave and Fraser T Smith wins Best Contemporary Song. In one of the most successful contemporary songwriting collaborations, it is their third Ivor Novello Award win in four years. Performed by Future Utopia, featuring Dave and Es Devlin, the track explores the impact of social media and hyper-connectivity, especially on younger generations.\n\nCeleste and Jamie Hartman receive the Ivor for Songwriter of the Year for their incredible body of work in 2020 including Stop this Flame, I Can See the Change, Little Runaway, Love is Back and A Little Love for the John Lewis Christmas advert.\n\nThe second Rising Star Award with Apple Music has been awarded to 20-year-old Bristol born artist Willow Kayne whose work spans hip hop, punk and electronica, and draws creative inspiration from fashion and graphic design. All Rising Star Award nominees receive a year-long mentorship from a well-known Academy member and leaders from Apple Music, Willow has been paired with music legend Nile Rodgers.\n\nComposer Blanck Mass wins his first Ivor for Best Original Film Score for the BAFTA nominated Irish crime drama Calm with Horses, directed by Nick Rowland in his feature debut and written by Joseph Murtagh.\n\nBest Original Video Game Score goes to Gareth Coker for Ori and the Will of the Wisps. Developed by the collective organisation Moon Studios and published Xbox Games Studios, it is the sequel to the acclaimed action-platform Ori and the Blind Forest.\n\nThe soundtrack for sci-fi spectacular Devs composed by Geoff Barrow, Ben Salisbury, and The Insects wins Best Television Soundtrack. Created, written, and directed by Alex Garland, Devs premiered in the UK on BBC Two in April 2020 and explores themes of free-will, determinism, grief, love and immortality.\n\nJon Bon Jovi and Richie Sambora collect the Special International Award with Apple Music for a musical partnership that spanned 30 years and fuelled one of the biggest bands in the world, producing global anthems such as Wanted Dead or Alive, You Give Love a Bad Name and the gigantic US No.1 Livin’ On A Prayer.\n\nRoland Orzabal and Curt Smith are honoured with the Ivor for Outstanding Song Collection for their incredible songwriting partnership that produced era-defining Tears for Fears albums including The Hurting, Songs from the Big Chair and The Seeds of Love, as well as critically acclaimed, innovative hit singles: Mad World, Shout, Everybody Wants to Rule the World and Sowing the Seeds of Love.\n\nAlison Goldfrapp and Will Gregory are recognised with The Ivors Inspiration Award for their work as the duo Goldfrapp, which formed in 1999. Giants of electronic music, they have been inspired by everything from glam rock to organic folk music, while their seven albums have produced acclaimed music that has entranced a nation and filled many dancefloors.\n\nMark-Anthony Turnage is recognised with The Ivors Classical Music Award for his unique and experimental approach to composition. The composer – who had his breakthrough moment with his first opera, 1988’s Greek – draws on influences spanning jazz, Led Zeppelin and Beyoncé. His work has been performed at the BBC Proms, Sadler’s Wells, the Royal Ballet and the Royal Opera. He has written pieces based on everything from the outbreak of World War I with his 2013 orchestral work Passchendaele to the tragic life and death of model, actor, celebrity Anna Nicole Smith, his 2011 opera Anna Nicole.\n\nShaznay Lewis, Ivor Novello Award winner and Chair of The Ivors Awards Committee at The Ivors Academy, said, “I’m amazed by the impressive range of talent who have joined the UK’s roll call of songwriting greats by winning an Ivor Novello Award. Each one brings joy to so many and creates the soundtrack to our lives. As well as being astounded by their achievements, I would like to thank every winner and nominee for creating the most wonderful and era-defining music.”\n\nThe winners in full\n\nBest Album\n\nLianne La Havas\n\nWritten by Matthew Hales and Lianne La Havas\n\nPerformed by Lianne La Havas\n\nPublished in the UK by Universal Music Publishing and Warner Chappell Music\n\nBest Contemporary Song\n\nChildren of the Internet\n\nWritten by Dave and Fraser T Smith\n\nPerformed by Future Utopia feat. Dave and Es Devlin\n\nPublished in the UK by Warner Chappell Music and Kobalt Music Publishing\n\nBest Original Film Score\n\nCalm with Horses\n\nComposed by Blanck Mass\n\nPublished in the UK by BMG UK\n\nBest Original Video Game Score\n\nOri and the Will of the Wisps\n\nComposed by Gareth Coker\n\nBest Song Musically and Lyrically\n\nGod’s Own Children\n\nWritten by Barney Lister and Obongjayar\n\nPerformed by Obongjayar\n\nPublished in the UK by Promised Land Music-Universal Music Publishing and Beggars Music\n\nBest Television Soundtrack\n\nDevs\n\nComposed by Geoff Barrow, Ben Salisbury, The Insects\n\nPublished in the UK by Sony Music Publishing\n\nOutstanding Song Collection\n\nRoland Orzabal and Curt Smith\n\nPRS for Music Most Performed Work\n\nAdore You\n\nWritten by Amy Allen, Tyler Johnson, Kid Harpoon and Harry Styles\n\nPerformed by Harry Styles\n\nPublished in the UK by Artist Publishing Group West-Kobalt Music Publishing, Concord Music Publishing, Universal Music Publishing\n\nRising Star Award with Apple Music\n\nWillow Kayne\n\nSongwriter of the Year\n\nCeleste and Jamie Hartman\n\nSpecial International Award with Apple Music\n\nJon Bon Jovi and Richie Sambora\n\nThe Ivors Classical Music Award\n\nMark-Anthony Turnage\n\nThe Ivors Inspiration Award\n\nAlison Goldfrapp and Will Gregory"}, {"url": "https://ivorsacademy.com/news/the-ivors-2020-winners-announced/", "page_content": "The Ivors Academy has announced the winners of The Ivors with Apple Music, celebrating the very best songwriting and screen composition of 2019.\n\nRecognised as a pinnacle of achievement since they were first presented in 1956, an Ivor Novello Award celebrates exceptional craft in music creation and is particularly important to the music industry as it represents peer recognition.\n\nThis is the 65th year Ivor Novello Awards have been presented at The Ivors, the ceremony dedicated to honouring songwriting and screen composition. Originally taking place in May, the presentation of awards was postponed to September due to Covid 19. The winners were announced exclusively on The Matt Wilkinson Show on Apple Music 1 Radio.\n\nListen again to the winners being announced and explore the winning songs and scores on Apple Music.\n\nThe winners\n\n\n\n‘Grey Area’, written by Little Simz and Inflo, won the Ivor Novello Award for Best Album. This is Little Simz’ first Ivor Novello Award and the second for Inflo, who previously won in 2017 for co-writing Michael Kiwanuka’s ‘Black Man in a White World’.\n\nThe award for Best Contemporary Song was presented to Dave and Fraser T Smith for ‘Black’. Their second Ivor in as many years, the judges described the work as “important, eloquent and a song that not only empowers, but is borderless in its musicality”.\n\nBobby Krlic collected his first Ivor for Best Original Film Score for the score to ‘Midsommar’, hailed by the judges as an “outstanding incidental score that is an inseparable part of the uncompromising vision of the film”.\n\nPresented for only the fifth time, the Ivor Novello Award for Best Original Video Game Score was awarded to Simon Poole for ‘Draugen’. A first-person psychological ‘Fjord Noir’ mystery set in Norway, the judges described the video game’s score as “flawless and beautifully evocative”.\n\nJamie Cullum collected his first Ivor for ‘Age of Anxiety’ in the Best Song Musically and Lyrically category, with the judges describing the song as “beautifully emotive, with an exceptionally crafted melody”.\n\nThe award for the Best Television Soundtrack was awarded to Labrinth for his soundtrack to ‘Euphoria’, HBO’s teen drama starring Zendaya about a group of high school students navigating love and friendship. It is Labrinth’s first win for scoring screen music and second Ivor, having previously won for co-writing Tinie Tempah’s ‘Pass Out’.\n\n‘Giant’, performed and written by Calvin Harris and Rag ‘n’ Bone Man, with co-writing by Jamie Hartman and Troy Miller, was awarded the PRS for Music Most Performed Work of 2019. Tackling topics such as addiction and redemption, it is the first Ivor win for Rag ‘n’ Bone Man, Jamie Hartman and Troy Miller and the second for Calvin Harris.\n\nSongwriter and artist Mysie won the first Rising Star Award with Apple Music. Created to honour young talent who demonstrate exceptional potential, the award includes a new mentoring scheme from Apple Music where all five nominees receive a year-long mentorship from a well-established Academy member.\n\nThe Ivor Novello Award for Songwriter of the Year has been presented since 1974 and recognises a writer whose creativity has made an identifiable impact on the award year. This year’s recipient is songwriter Steve Mac, who co-wrote some of 2019’s stand out hits including Mabel’s ‘Don’t Call Me Up’ and ‘Mad Love’, ‘South Of The Border’ by Ed Sheeran featuring Camila Cabello and Cardi B, Westlife’s ‘Hello My Love’ and ‘Better Man’ and ‘Harder’ by Jax Jones and Bebe Rexha.\n\nAn Academy Fellowship, the highest honour that The Ivors Academy bestows, recognises excellence and impact in the art and craft of music creation. This year has seen it awarded to Joan Armatrading MBE, in recognition of her peerless and enduring achievements in music. This is only the nineteenth Fellowship that the Academy has awarded in its 76-year history, as Joan Armatrading joins a roster of songwriting greats including Annie Lennox OBE, Sir Paul McCartney and Sir Elton John.\n\nAnnie Lennox OBE, who was made a Fellow of the Academy in 2015, said “Joan Armatrading was born to create beautiful music, as she has done so consistently over the decades of her life, as an outstanding singer songwriter, recording artist and performer. With her definitive voice and unique guitar playing style, her songs are masterful classics. She is a legendary British artist who thoroughly deserves to be recognised and honoured with an Ivors Academy Fellowship. I’m thrilled to know that she will soon be part of this incredible association.”\n\nJoan Armatrading’s four decades of superlative music-making has seen her release 21 albums, receive three Grammy nominations and become the first female British artist to debut at number 1 in the Billboard Blues chart.\n\nCrispin Hunt, Chair of The Ivors Academy said “The Ivors 2020 is a stunning rollcall of songwriting and screen composing talent. I would like to congratulate every winner and nominee on their incredible achievements. The UK produces some of the most dynamic, creative and successful music creators in the world working across games, TV, film and recorded music. Their talent is the reason that the music we all love exists. Each Ivor Novello Award is unique as it is presented to music creators by music creators on behalf of the Academy and is an expression of our admiration.”\n\nThe winners in full\n\nBest Album\n\nGrey Area\n\nWritten by Inflo and Little Simz\n\nPerformed by Little Simz\n\nPublished in the UK by Universal Music Publishing\n\nBest Contemporary Song\n\nBlack\n\nWritten by Dave and Fraser T Smith\n\nPerformed by Dave\n\nPublished in the UK by Warner Chappell Music and Kobalt Music Publishing\n\nBest Original Film Score\n\nMidsommar\n\nComposed by Bobby Krlic\n\nPublished in the UK by A24 Music – Kobalt Music Publishing\n\nBest Original Video Game Score\n\nDraugen\n\nComposed by Simon Poole\n\nBest Song Musically and Lyrically\n\nAge of Anxiety\n\nWritten and performed by Jamie Cullum\n\nPublished in the UK by Sentric Music Ltd\n\nBest Television Soundtrack\n\nEuphoria\n\nComposed by Labrinth\n\nPublished in the UK by Universal Music Publishing\n\nPRS for Music Most Performed Work\n\nGiant\n\nWritten by Calvin Harris, Jamie Hartman, Rag ‘n’ Bone Man and Troy Miller\n\nPerformed by Calvin Harris and Rag ‘n’ Bone Man\n\nPublished in the UK by EMI Music Publishing, Reservoir Reverb Music, Warner Chappell Music and Bucks Music Group\n\nRising Star Award with Apple Music\n\nPresented to Mysie\n\nSongwriter of the Year\n\nPresented to Steve Mac\n\nAcademy Fellowship\n\nPresented to Joan Armatrading MBE"}, {"url": "https://www.theguardian.com/music/2021/sep/21/harry-styles-lianne-la-havas-dave-and-fraser-t-smith-win-ivor-awards", "page_content": "Harry Styles, Lianne La Havas, Dave and Fraser T Smith are the big winners at this year’s Ivor Novello awards, which celebrate Britain’s best songwriters and composers.\n\nIn their third Ivor Novello win in four years, Dave and Fraser T Smith were awarded best contemporary song for Children of the Internet. The song is performed by Future Utopia – Veteran producer Smith’s new project – and features Dave and Es Devlin. The track explores the impact of social media and hyper-connectivity, particularly on younger generations.\n\nSmith, who has built a reputation as UK hip-hop’s go-to producer – also working with the likes of Kano, Ghetts and Stormzy – appeared on the Brit Awards stage last year alongside Dave for a performance of Black.\n\nFraser T Smith with the best contemporary song trophy he won with Dave at the Ivor Novello Awards on 21 September. Photograph: David Fisher/Rex/Shutterstock\n\nStyles picked up his first Ivor for Adore You, the second single from his Grammy-nominated and UK double platinum-selling album Fine Line. The track, written with Amy Allen, Tyler Johnson and Kid Harpoon, peaked at no 7 and spent a total of 40 weeks in the official singles chart. It triumphed in the PRS for music most performed work category. The award is drawn from performance data collated by royalties organisation PRS for Music.\n\nHarry Styles performs on NBC’s Today show at Rockefeller Plaza in New York in February last year. Photograph: Charles Sykes/Invision/AP\n\nLianne La Havas’ self-titled third album won in the best album category. Written with Matthew Hales, the concept album depicts the stages of a relationship from early romance to its end. It is the pair’s first Ivor, having both been first nominated in 2013 for Lianne La Havas’ debut, Is Your Love Big Enough? An Observer review gave the album four stars, calling it “purposeful, tender and bold”.\n\nThe award for best song musically and lyrically went to Obongjayar and Barney Lister for God’s Own Children, from the EP Which Way is Forward?, which Obongjayar has described as “a project about love, family, self-empowerment and self-belief”.\n\nCeleste and Jamie Hartman received the Ivor for songwriter of the year for a body of work in 2020 that included Stop this Flame, I Can See the Change, and A Little Love for the John Lewis Christmas advert. The rising star award with Apple Music went to 20-year-old Bristol-born artist Willow Kayne, whose work spans hip-hop, punk and electronica. All rising star award nominees receive a year-long mentorship from an Ivors Academy member and leaders from Apple music. Nile Rodgers, who will be mentoring Kayne, called her a “genuine star in the making”.\n\nMeanwhile, composer Blanck Mass won best original film score for the Bafta-nominated Irish crime drama Calm with Horses; Geoff Barrow, Ben Salisbury and The Insects won best television soundtrack for sci-fi thriller Devs; and Gareth Coker won best original video game score for Ori and the Will of the Wisps.\n\nJon Bon Jovi and Richie Sambora collected the special international award with Apple Music for a 30-year musical partnership, Roland Orzabal and Curt Smith won outstanding song collection, and Alison Goldfrapp and Will Gregory were recognised with the Ivors inspiration award for their work as the duo Goldfrapp.\n\nMark-Anthony Turnage, whose work has been performed at the BBC Proms, Sadler’s Wells, the Royal Ballet and the Royal Opera, won the classical music award.\n\nThe Ivors Academy announced the winners on Tuesday. All but two of the categories (PRS for music most performed work and songwriter of the year) was judged by individual panels of songwriters and composers.\n\nThis year, 70% of the 26 songwriters and composers recognised with an Ivor picked up an award for the first time. Others nominated who missed out on gongs included AJ Tracey, Laura Marling and Mahalia. Screen nominations recognised original music from Noughts + Crosses, a Suitable Boy and The Trial of the Chicago 7.\n\nShaznay Lewis, Ivor award winner and chair of the Ivors awards committee, said each winner “brings joy to so many and creates the soundtrack to our lives. As well as being astounded by their achievements, I would like to thank every winner and nominee for creating the most wonderful and era-defining music.”"}, {"url": "https://headlinermagazine.net/the-ivors-2021-full-winners-list.html", "page_content": "The Ivors Academy has announced the winners at The Ivors with Apple Music 2021, recognising outstanding songwriting and screen composition.\n\nRecognised as a pinnacle of creative musical achievement since they were first presented in 1956, the Ivor Novello Awards have a special place in the music community as they are judged and awarded by songwriters and composers to their peers.\n\nThis year, 70% of the 26 songwriters and composers recognised with an Ivor are picking up an award for the first time.\n\nAdore You, performed and written by Harry Styles with Amy Allen, Tyler Johnson and Kid Harpoon won the PRS for Music Most Performed Work of 2020 - the first Ivor win for Styles and all the writers on the track.\n\nLianne La Havas’ self-titled album won the Ivor Novello Award for Best Album, written with Matthew Hales. This is also their first Ivor, having both been first nominated in 2013 for La Havas’ debut album, Is Your Love Big Enough?\n\nBest Song Musically and Lyrically went to Obongjayar and Barney Lister in their first Ivor win for God’s Own Children from the EP Which Way Is Forward?, which Obongjayar describes as “a project about love, family, self-empowerment and self-belief”.\n\nChildren of the Internet by Dave and Fraser T Smith won Best Contemporary Song. In one of the most successful contemporary songwriting collaborations, it is their third Ivor Novello Award win in four years.\n\nSpeaking to Headliner at the ceremony about what the Ivors means to him, Smith commented: “An awards ceremony like this, that has so much history and credibility, that honours songwriters, and is not on TV, or about hype or about throwing money at something to make it a success, really resonates with me.\"\n\nSmith also discusses his working processes during the pandemic and his work with rising star Mysie.\n\n\"I've been working with Mysie through the Apple mentorship programme,\" he said. \"So we were talking and now we’re creating; we’ve made two EPs together. So, it’s been a really fertile time for me creatively. I moved out to the country which was a real blessing. The closer you are to nature, the closer you are to creativity.\"\n\nCeleste and Jamie Hartman received the Ivor for Songwriter of the Year for their body of work in 2020 including Stop this Flame, I Can See the Change, Little Runaway, Love is Back and A Little Love for the John Lewis Christmas advert.\n\nThe second Rising Star Award with Apple Music was awarded to 20-year-old Bristol born artist Willow Kayne, whose work spans hip hop, punk and electronica, and draws creative inspiration from fashion and graphic design.\n\nAll Rising Star Award nominees receive a year-long mentorship from a well-known Academy member and leaders from Apple Music. Willow has been paired with Nile Rodgers.\n\n“Willow has a fresh and exciting sound and the energy and determination to match it,” said Rodgers. “She’s a genuine star in the making and I can’t wait to support her on her musical journey.”\n\nComposer Blanck Mass won his first Ivor for Best Original Film Score for the BAFTA nominated Irish crime drama Calm with Horses, directed by Nick Rowland in his feature debut and written by Joseph Murtagh.\n\nBest Original Video Game Score went to Gareth Coker for Ori and the Will of the Wisps.\n\nThe soundtrack for sci-fi spectacular Devs composed by Geoff Barrow, Ben Salisbury, and The Insects won Best Television Soundtrack.\n\nJon Bon Jovi and Richie Sambora collected the Special International Award with Apple Music for a musical partnership that spanned 30 years and fuelled one of the biggest bands in the world, producing global anthems such as Wanted Dead or Alive, You Give Love a Bad Name and Livin’ On A Prayer.\n\nRoland Orzabal and Curt Smith were honoured with the Ivor for Outstanding Song Collection for their songwriting partnership that produced era-defining Tears for Fears albums including The Hurting, Songs from the Big Chair and The Seeds of Love, as well as critically acclaimed, innovative hit singles: Mad World, Shout, Everybody Wants to Rule the World and Sowing the Seeds of Love.\n\nAlison Goldfrapp and Will Gregory were recognised with The Ivors Inspiration Award for their work as the duo Goldfrapp, which formed in 1999.\n\nMark-Anthony Turnage was recognised with The Ivors Classical Music Award for his unique and experimental approach to composition.\n\nShaznay Lewis, Ivor Novello Award winner and Chair of The Ivors Awards Committee at The Ivors Academy, said: “I’m amazed by the impressive range of talent who have joined the UK’s roll call of songwriting greats by winning an Ivor Novello Award.\n\n\"Each one brings joy to so many and creates the soundtrack to our lives. As well as being astounded by their achievements, I would like to thank every winner and nominee for creating the most wonderful and era-defining music.”"}, {"url": "https://www.billboard.com/music/awards/2019-ivor-novello-awards-winners-list-8513011/#!", "page_content": "The 1975 won two of the most prestigious prizes at the 2019 Ivor Novello songwriting awards: songwriters of the year for their album, A Brief Inquiry Into Online Relationships and best contemporary song for “Love It If We Made It.” The 64th awards that celebrate excellence in British and Irish songwriting and composing for songs, albums, TV, film and video game scores released in 2018, with organizers praising The 1975’s efforts as “a bold, inspirational and original statement, bringing together an awareness of contemporary issues without resorting to cliché.”\n\nExplore See latest videos, charts and news Mariah Carey The 1975 See latest videos, charts and news\n\nThe event also included a PRS for Music special international award for Mariah Carey, acknowledging her as an “extraordinary talent, an impactful songwriter and one of the biggest-selling artists of all time” in recognition of her 18 U.S. No. 1 singles.\n\nSpeaking of the songwriters award for The 1975, the Academy said, “All at once daring, vulnerable and recklessly honest, The 1975’s songwriting on A Brief Inquiry into Online Relationships stands out as a vivid picture of modernity. These songs are a quintessential snapshot of the emotional complexities of life in the here and now, but with all the hallmarks of a body of work that will stand the test of time.”\n\nThe Academy presented awards to 29 individual songwriters and composers in 14 categories, with 83% of them first-time winners. See a list of other winners below:\n\nIvors inspiration award: Wiley\n\nBest song musically and lyrically: Ben Howard, “Nica Libres at Dusk”\n\nOutstanding song collection: Dido\n\nMusic most performed work: Julian Bunetta, Dan Caplen, Macklemore, John Ryan and Jamie Scott for “These Days,” performed by Rudimental ft Jess Glynne, Macklemore and Dan Caplen\n\nJazz award: Django Bates\n\nBest album: Idles, Joy As An Act of Resistance\n\nInternational achievement: Deep Purple Mark II — Ritchie Blackmore, Ian Gillan, Roger Glover, Jon Lord (posthumous) and Ian Paice\n\nOutstanding contribution to British music: Richard Ashcroft\n\nBest original video game score: Robin Beanland, “Sea of Thieves”\n\nBest television soundtrack: Requiem, composed by Natasha Kahn and Dominik Sherrer\n\nBest original film score: Phantom Thread by Jonny Greenwood\n\nClick here to see the full list of winners and accolades."}, {"url": "https://www.theguardian.com/music/2022/may/19/dave-crowned-songwriter-of-the-year-at-ivor-novello-awards", "page_content": "Dave has been crowned songwriter of the year and Sam Fender has picked up his first prize at this year’s Ivor Novello awards, which celebrate Britain’s best songwriters and composers.\n\nWinning his fourth Ivor in five years, Dave was commended for his second album We’re All Alone in This Together, which topped UK charts and spawned three simultaneous top 10 singles – Clash (featuring Stormzy), Verdansk and In the Fire.\n\nAs part of his continuing collaboration with Fredo, the rapper also co-wrote the hugely successful tracks Back to Basics and Money Talks, the Ivors Academy said. Following a Brit award win for best hip-hop/grime/rap act earlier this year, Dave dedicated his award to “the rappers that have suffered for years and years, and broken down so many barriers in this industry that I’m in right now”.\n\nFender took home his first Ivor after winning best song musically and lyrically for the track Seventeen Going Under, which chronicles his life at the age of 17 and the challenges he and his mother faced. The North Shields singer-songwriter recently sold out his “biggest gig to date” at Finsbury Park in London, following in the footsteps of Arctic Monkeys, Queens of the Stone Age, Pulp and Liam Gallagher.\n\nEd Sheeran, Fred Again and Johnny McDaid won in the most performed work category for their collaboration on the UK’s biggest song of 2021, Bad Habits. It is Sheeran’s fifth Ivor, after he won in the same category in 2019 alongside McDaid for Shape of You.\n\nWith a catalogue of more than 140 songs and more than 80m record sales, a special international award celebrated the global impact and songwriting achievements of the Colombian superstar Shakira.\n\nThe award for best contemporary song went to Dean “Inflo” Josiah Cover and Little Simz for I Love You, I Hate you, a powerful address to Little Simz’s father from the album Sometimes I Might Be Introvert. Inflo was nominated for four awards this year, more than any other person.\n\nIn total, 21 songwriters and composers collected Ivor Novello awards across 14 categories at a ceremony at London’s Grosvenor House on Thursday.\n\nLaura Mvula won the award for best album for Pink Noise, which she wrote with Dann Hume. “Sometimes it was hard to imagine getting to the finish line, so to know that it has made some impact in such strange times is really exciting for me,” Mvula has told the Guardian.\n\nBreakout talent Naomi Kimpenu became the third consecutive female songwriter to win the rising star award for her debut EP Prelude. The four-track collection was described as “the ideal calling card, serving notice of what her perfectly poised vocals and sincere songwriting can do”.\n\nMeanwhile, the “icon” award recognised “two of rock’s most inspiring, influential, and identifiable songwriters”: the Cure’s Robert Smith and Simon Gallup.\n\nPeter Gabriel received the fellowship of the Ivors Academy in recognition of his outstanding contributions as a musician, innovator, humanitarian and songwriter.\n\nDaniel Blumberg won the award for best original film score for his work on The World to Come, Arthur Sharpe won best television soundtrack for his work on Sky Atlantic’s Landscapers, and Richard Jacques won best original video game score for Marvel’s Guardians of the Galaxy.\n\nPaul Heaton was awarded outstanding song collection, while the songwriters Elizabeth Fraser, Robin Guthrie and Simon Raymonde won the visionary award for their band Cocteau Twins.\n\nShaznay Lewis, Ivor award winner and chair of the Ivors awards committee, said she was “absolutely thrilled” for this year’s winners. “It is a privilege to experience such an immensely powerful, emotive and eclectic range of music. Huge congratulations to everyone who took home awards, and every single songwriter and composer nominated,” she said.\n\nThe Ivors Academy recently launched TheWRD, a pre-degree diploma in creative entrepreneurship designed to help open access to the creative industries. It was also announced that Lauren Laverne would take over as host from Paul Gambaccini, who retires after hosting the ceremony since 1988."}, {"url": "https://ivorsacademy.com/news/the-ivors-academy-announce-nominations-for-the-ivors-2020/", "page_content": "The Ivors Academy has announced the nominations for The Ivors with Apple Music for 2020, across seven categories for songs, albums, film, television and video game scores.\n\nRecognised as a pinnacle of achievement since they were first presented in 1956, The Ivors Academy presents Ivor Novello Awards at The Ivors with Apple Music to celebrate exceptional craft in songwriting and screen composition.\n\nThe nominations recognise works written by British and Irish songwriters and composers that were released in the UK in 2019. The Academy held a public call for entries earlier in the year and judging across all categories took place before lockdown restrictions were imposed.\n\nNow in their 65th year, an Ivor Novello Award is particularly important to the music industry as it represents peer recognition. Each category is judged by a separate panel exclusively populated by music creators, except for PRS for Music Most Performed Work, which is based on performance data from PRS for Music. Over 40 award winning songwriters and composers were involved as judges, including past Ivor winners and nominees.\n\nThe nominations celebrate works that reflect on personal themes of loss, love, identity and mental health as well as original composition to enhance the narratives of award-winning dramas, powerful documentaries and immersive video games.\n\nIn the Best Album category, Nick Cave & The Bad Seeds’ ‘Ghosteen’ – written by Nick Cave and Warren Ellis – completes the hat-trick for album nominations of the trilogy ‘Push The Sky Away’ (which won in 2014) and ‘Skeleton Tree’. Also nominated are Little Simz and Inflo for ‘Grey Area’ and spoken word poet Kate Tempest and Dan Carey for ‘The Book of Traps and Lessons’, with both Little Simz and Kate Tempest receiving Ivor nominations for the first time.\n\nIn Best Contemporary Song, ‘Black’, the powerful lead single from Dave’s debut album ‘Psychodrama’, is his and Fraser T Smith’s second time nominated in the category together, having won in 2018 for ‘Question Time’. The nod for ‘Firesmoke’ is a second 2020 nomination for Kate Tempest and co-writer Dan Carey and ‘Must Be’ is a first-time nomination for J Hus and JAE5.\n\nThe Best Original Film Score category includes first-time nominees Nainita Desai and Bobby Krlic (also known as The Haxan Cloak) alongside previous winner Mica Levi, who won in 2018 for the Jackie Kennedy biopic ‘Jackie’. The scores nominated are for films as varied as a documentary following a mother’s struggle during the uprising in Aleppo, Syria in ‘For Sama’, to folk horror ‘Midsommar’ and Spanish-language thriller ‘Monos’, about a group of teenage guerrilla soldiers.\n\nIn Best Original Video Game Score, David Garcia Diaz’s nomination for ‘Arise: A Simple Story’ – which sees players relive the bittersweet journey of two people’s lives – follows his 2018 nomination for ‘Hellblade: Senua’s Sacrifice’. Also recognised are first-time nominees Simon Poole for ‘Draugen’ – a psychological ‘Fjord Noir’ mystery set in Norway, and Dorian Behner, John Broomhall and Will Morton for ‘Lost Ember’ – where players explore the remains of a fallen world through the eyes of different animals.\n\nBest Song Musically and Lyrically sees a first time nomination for Jamie Cullum for ‘Age of Anxiety’ and Sam Fender for ‘Dead Boys’, from his debut album. Stormzy’s nomination for ‘Crown’ follows his 2018 Best Album win for ‘Gang Signs & Prayer’, accompanied by co-writers Jimmy Napes – who has two Ivor Novello Awards to his name for ‘Rather Be’ in 2015 – and first time nominee MJ Cole.\n\nThe Best Television Soundtrack includes nominations for Labrinth’s soundtrack to ‘Euphoria’, HBO’s teen drama starring Zendaya about a group of high school students navigating love and friendship; the score for the third series of popular Netflix series ‘The Crown’, composed by five-time Ivor Novello Award winner Martin Phipps; and BBC Two’s documentary reconstruction ‘Rise of the Nazis’, which delves into how Hitler’s dictatorship took control of Germany, by first time nominee Tom Hodge.\n\nThis year’s nominations for PRS for Music Most Performed Work celebrate the songwriters of three smash-hit songs from 2019 – Sam Smith’s ‘Dancing with a Stranger’, co-written with Mikkel Eriksen, Tor Erik Hermansen and Jimmy Napes; Calvin Harris, Jamie Hartman, Rag ‘n’ Bone Man and Troy Miller for ‘Giant’; and Lewis Capaldi, Jamie N Commons and Jamie Hartman for ‘Hold Me While You Wait’.\n\nCrispin Hunt, Chair of The Ivors Academy said:\n\n“Our judges have recognised extraordinary works that reflect on all aspects of the human experience and demonstrate the power and importance of music, in all its forms. Everything begins with the creativity of the songwriter or composer, and this is the building block on which our industry rests. That is why these awards are so important because they celebrate this craft and talent. It is also fantastic to see nearly half of those recognised today nominated for an Ivor Novello Award for the very first time. Congratulations to everyone.”\n\nThe Ivors 2020 Nominations are:\n\nBest Album\n\nGhosteen – Written by Nick Cave and Warren Ellis\n\nPerformed by Nick Cave and the Bad Seeds. Published in the UK by Kobalt Music Publishing.\n\nGrey Area – Written by Inflo and Little Simz\n\nPerformed by Little Simz. Published in the UK by Universal Music Publishing.\n\nThe Book of Traps and Lessons – Written by Dan Carey and Kate Tempest\n\nPerformed by Kate Tempest. Published in the UK by Warner Chappell Music and Domino Publishing Company.\n\nBest Contemporary Song\n\nBlack – Written by Dave and Fraser T Smith\n\nPerformed by Dave. Published in the UK by Warner Chappell Music and Kobalt Music Publishing.\n\nFiresmoke – Written by Dan Carey and Kate Tempest\n\nPerformed by Kate Tempest. Published in the UK by Warner Chappell Music and Domino Publishing Company.\n\nMust Be – Written by JAE5 and J Hus\n\nPerformed by J Hus. Published in the UK by Black Butter Music Publishing – Kobalt Music Publishing and Warner Chappell Music.\n\nBest Original Film Score\n\nFor Sama – Composed by Nainita Desai\n\nPublished in the UK by Manners McDade Music Publishing.\n\nMidsommar – Composed by Bobby Krlic\n\nPublished in the UK by Kobalt Music Publishing.\n\nMonos – Composed by Mica Levi\n\nPublished in the UK by Beggars Music.\n\nBest Original Video Game Score\n\nArise: A Simple Story – Composed by David Garcia Diaz\n\nDraugen – Composed by Simon Poole\n\nLost Ember – Composed by Dorian Behner, John Broomhall and Will Morton\n\nBest Song Musically and Lyrically\n\nAge of Anxiety- Written and performed by Jamie Cullum\n\nPublished in the UK by Sentric Music Ltd.\n\nCrown – Written by MJ Cole, Jimmy Napes and Stormzy\n\nPerformed by Stormzy. Published in the UK by Warner Chappell Music and Downtown Music Publishing.\n\nDead Boys – Written and performed by Sam Fender\n\nPublished in the UK by Kobalt Music Publishing.\n\nBest Television Soundtrack\n\nEuphoria – Composed by Labrinth\n\nPublished in the UK by Universal Music Publishing.\n\nRise of the Nazis – Composed by Tom Hodge\n\nPublished in the UK by BBC Studios Distribution Limited obo 72 Films Limited – Universal Music Publishing and Leland Originals Publishing – Decca Publishing.\n\nThe Crown (Series 3) – Composed by Martin Phipps\n\nPublished in the UK by Du Vinage Publishing and Sony/ATV Music Publishing.\n\nPRS for Music Most Performed Work\n\nDancing with a Stranger – Written by Mikkel Eriksen, Tor Erik Hermansen, Jimmy Napes and Sam Smith\n\nPerformed by Sam Smith and Normani. Published in the UK by EMI Music Publishing, Downtown Music Publishing, Stellar Songs – EMI Music Publishing and Naughty Words – Sony/ATV Music Publishing.\n\nGiant – Written by Calvin Harris, Jamie Hartman, Rag ‘n’ Bone Man and Troy Miller\n\nPerformed by Calvin Harris and Rag ‘n’ Bone Man. Published in the UK by EMI Music Publishing, Reservoir Reverb Music, Warner Chappell Music and Bucks Music Group.\n\nHold Me While You Wait – Written by Lewis Capaldi, Jamie N Commons and Jamie Hartman\n\nPerformed by Lewis Capaldi. Published in the UK by BMG Rights Management, Universal Music Publishing and Reservoir Reverb Music.\n\nPreviously announced are the nominees for the new Rising Star Award with Apple Music: Amahla, Carmel Smickersgill, Griff, lullahush and Mysie.\n\nRecipients of Songwriter of the Year 2019 and the Academy Fellowship will be announced along with winners across all nominated categories on Apple Music’s Beats 1 Radio from 11am on the Matt Wilkinson Show on Wednesday 2 September 2020."}, {"url": "https://www.prsformusic.com/press/2020/prs-for-music-celebrates-global-songwriters-and-composers-in-support-of-wouldhavebeentheivors", "page_content": "PRS for Music, the organisation that represents the rights of over 145,500 songwriters, composers and music publishers in the UK and worldwide is today supporting The Ivors Academy’s #WouldHaveBeenTheIvors campaign, by looking back at the glittering list of songwriting royalty who have won PRS for Music-supported Ivor Novello Award categories over the past three decades.\n\nCritically acclaimed songwriters and composers from Stephen Sondheim to Lionel Richie, to Kate Bush, Madonna and Ed Sheeran have all won Ivor Novello Awards, the highest accolade in songwriting and screen composition. The only prize to be judged exclusively by fellow music creators and presented by The Ivors Academy, the awards are the pinnacle in the careers of many in the songwriting and composing field.\n\nBetween 1991 and 2019, PRS for Music contributed to and supported three prestigious Ivor Novello Award categories, the PRS for Music award for: Most Performed Work; Outstanding Contribution to British Music; and Special International Award.\n\nAndy Bell and Vince Clarke won the first PRS for Music Most Performed Work Award for Erasure classic, Blue Savannah, released in 1990. While Kenney Jones, Ronnie Lane, Steve Marriott and Ian McLagan were the first to take home the PRS for Music Outstanding Contribution to British Music award as The Small Faces in 1996, and Hal David won the inaugural Special International Award in 1999.\n\nGary Barlow is the only songwriter to have won three PRS for Music-supported Ivor Novello awards, spanning three decades, for his widely celebrated work with Take That. He has received the Most Performed Work award twice, for Back for Good in 1996 and Shine in 2008, and he received the Outstanding Contribution to British Music Award in 2012 alongside his Take That band mates Robbie Williams, Mark Owen, Howard Donald and Jason Orange.\n\nOther songwriters and composers who have won the PRS for Music Most Performed Work Award more than once include Cathy Dennis for her work on Kylie Minogue’s Can’t Get You Out of My Head in 2002 and Britney Spears’ Toxic in 2005, William Orbit for his work on Madonna’s Beautiful Stranger in 2000 and All Saints’ Pure Shores in 2001, and Fred Fairbrass, Richard Fairbrass and Robert Manzoli for the Right Said Fred hits I’m Too Sexy in 1992 and Deeply Dippy in 1993.\n\nRobbie Williams is the only songwriter to have won awards both as a solo artist and as part of a group, winning the PRS for Music Most Performed Work Award (1998) for Angels in 1999 and the PRS for Music Outstanding Contribution to British Music in 2012 with Take That.\n\nThe PRS for Music Special International Award is the only Ivor Novello Award independently presented to an international writer, recognising those whose work has left an indelible mark on British music. Winners have included Stevie Wonder (2001), Brian Wilson (2003), Quincy Jones (2007), Diane Warren (2008), Nile Rodgers (2014), Mariah Carey (2019) and the legendary Bill Withers (2017), who sadly passed away in April this year."}]}