{"Stereophonics are a Welsh rock band that formed in 1992 in the village of Cwmaman in Cynon Valley, Wales.": [{"url": "https://www.bbc.co.uk/wales/music/sites/stereophonics/pages/biography.shtml", "page_content": "Formed in 1992, schoolmates Kelly Jones, Richard Jones and Stuart Cable practised their art in performances at the working men's clubs of South Wales, as covers band Tragic Love Company.\n\nWe do something right for the people on the street. The people at the cool magazines don't understand why the people on the street like us, and we don't understand either. I don't think any band understands why somebody likes you. It's impossible.\n\nFrontman Kelly Jones had aspirations beyond karaoke, though. A budding scriptwriter, his muse was his hometown, sleepy Cwmaman - and it was the village's dark underbelly that inspired the songs that would make up the band's earliest recordings: poignant narratives about the despair and celebration of small-town life.\n\nIn November 1996 V2 Records released the band's debut single, Looks Like Chaplin/More Life In A Tramp's Vest. Early comparisons likened the band to late-period Manic Street Preachers, but there was a quality to Jones' raw, soulful vocals that suggested far more than bandwagon jumping.\n\nOver the next 12 months, a flurry of singles heralded Stereophonics' debut album Word Gets Around. It was an impressive work: Local Boy In The Photograph poignantly dealt with young suicide, while Traffic found Kelly Jones' sharp observational eye roving over the minutiae of day-to-day life.\n\nIt was the band's intense work ethic that truly broke them: 1997 saw the band play over 100 live dates, rocketing the album into the Top 10. The year was capped with a Brit award for Best New Band.\n\nIf the humble tales of Word Gets Around made Stereophonics the toast of Wales, 1999's Performance And Cocktails would make them household names. The album's first single, the rollicking The Bartender And The Thief charted impressively, hitting number three in the UK chart. And while the album itself was an inferior follow-up to Word Gets Around, it was a greater commercial success.\n\nThe first of Stereophonics' genuinely huge dates - a 50,000 capacity show at Morfa stadium in Swansea - sold out before any support bands had been added to the bill. The show itself was blighted by an ugly war of words. In a show of enthusiastic patriotism, the band played a song written for the rugby international entitled As Long As We Beat The English. But a sackload of letters sent to NME by English fans accused the band's flag-waving show of bordering on fascism.\n\nAmid the furore, the band remained tight-lipped, but the exchange soured the relationship between Stereophonics and the music press.\n\nExhausted, the band took a much-deserved hiatus throughout 2000, although Mama Told Me Not To Come - which found Kelly manfully trying to outbellow Tom Jones on the Welsh renaissance man's cover of the Randy Newman original - hit number four in March. The band's return proved that their runctions with the rock press had clearly hit a raw nerve, however.\n\nThe first single to be taken from Stereophonics' third studio album was Mr Writer - a spiteful retort to music journalists. Dour and plodding, it stalled at a disappointing number five. Thankfully, the album itself - Just Enough Education To Perform - was an artistic return to form. Tellingly, Kelly Jones debuted many of the songs in an intimate solo acoustic tour in late 2000: stripped-down songs like Step On My Old Size Nines found Stereophonics losing some of their bombastic edge and embracing a subtle brand of songwriting that evoked old rockers like Neil Young.\n\nSure enough, a cover of Handbags And Gladrags - written by former Manfred Mann songwriter Mike D'Abo, and popularised by Rod Stewart in the 1970s - that rocketed Stereophonics back up the charts in the December of 2001, prompting V2 to re-release the album with the cover as a bonus track.\n\nIn January 2002, Stuart Cable dropped out of a Japanese tour citing family reasons, prompting rumours of a split. But they pulled back, and the Kelly Jones-produced fourth album, You Gotta Go There To Come Back, was released in June 2003. It was a hard-rocking, whiskey-swilling return to form for the band.\n\nHowever, on 25 September it was announced that Stuart Cable had been sacked from the band due to commitment issues. Apparently Cable only heard of the news once it became public. According to BBC News, the drummer was informed by journalists contacting him.\n\nHe later placed the matter in the hands of his lawyers, adding: \"I'm a founder member of the Stereophonics and I would like to stress that I did not leave nor ever had any intention of leaving the band. I am, and have always been, a fully committed member of the Stereophonics and am very upset that Kelly seems to be saying I was not committed to the band.\"\n\nKelly Jones' statement, on the band's website, said: \"Me and Stuart started a band when I was 12. Emotionally to me this is heartbreaking. I love him like a brother, but commitment wise there have been issues since Just Enough Education To Perform.\n\n\"We've tried resolving them but things stayed the same. Myself and Richard miss Stuart already, a band is like a gang and a lot of time he simply wasn't there, although it was our fault to allow this situation to develop in the first place.\n\n\"No one will be replacing Stuart as a band member, Stuart is irreplaceable, but Steve Gorman will continue to sit in on drums for the upcoming shows. No one member of the band is bigger than our songs. It's a rock and roll band and the upcoming shows will be rocking.\"\n\nTrue to his word, Kelly came back in style. The band recruited new drummer Javier Weyler to the fold, and scored their first UK number one single in March 2005 with the release of Dakota. It was followed by the band's fourth album, Language. Sex. Violence. Other?, widely heralded as a musical return to form.\n\nIn 2006 the band released the Live From Dakota album, followed the next year by their next studio album, Pull The Pin.\n\nIn 2008 the greatest hits package, Decade In The Sun, was released, again proving a chart smash. The forthcoming studio album, Keep Calm And Carry On, is scheduled for release on 16 November 2009, accompanied by a gig at Cardiff Castle, 11 years after their coming of age at the same venue."}, {"url": "https://genius.com/artists/Stereophonics", "page_content": "About Stereophonics\n\nStereophonics are a Welsh rock band that formed in 1992 in the village of Cwmaman in Cynon Valley. The band consists of Kelly Jones (lead vocals and guitar), Richard Jones (bass guitar and backing vocals), Adam Zindani (guitar and backing vocals) and Jamie Morrison (drums). The group previously included drummer Stuart Cable, who was sacked in 2003 replaced by Javier Weyler who also left in 2012. Stereophonics have released ten studio albums, including six UK number one albums and one number one single, 2005’s Dakota“. A successful compilation album, Decade in the Sun, was released in November 2008 and charted at number two in the United Kingdom.\n\nDescribed as “classic UK rock delivered with whiskey vocals,” the band have a sound akin to the genres of alternative rock and “British traditional rock”. Stereophonics' debut album, Word Gets Around, was released in August 1997 and charted at number six in the UK, aided by some successful singles. However, the band would not properly break the mainstream until the release of Performance and Cocktails in 1999 and have since achieved a total of ten top-ten singles. Having sold around 10 million copies worldwide, Stereophonics are one of the most successful Welsh rock acts. Upon the release of Pull the Pin (2007), they became the eighth group in chart history to achieve five consecutive UK number one albums."}, {"url": "https://www.last.fm/music/Stereophonics/+wiki", "page_content": "Stereophonics is a Welsh rock band formed in 1992 in the village of Cwmaman in the Cynon Valley, Wales. The band consists of Kelly Jones (lead vocals, lead guitar, keyboards), Richard Jones (bass guitar, harmonica, backing vocals), Adam Zindani (rhythm guitar, backing vocals), Jamie Morrison (drums, percussion) and touring member Tony Kirkham (keyboards). The group previously included Stuart Cable (1992–2003) and then Javier Weyler (2004–2012) on drums. Stereophonics have released twelve studio albums, including eight UK number one albums. A successful compilation album, Decade in the Sun, was released in November 2008 and charted at number two on the UK Album Chart.\n\nDescribed as \"classic UK rock delivered with whiskey vocals\", the band have been summarised as possessing a sound akin to the genres of alternative rock and \"British traditional rock\". Stereophonics' debut album, Word Gets Around, was released in August 1997 and charted at number six in the UK, aided by the singles \"Local Boy in the Photograph\", \"More Life in a Tramps Vest\" and \"A Thousand Trees\". The band reached mainstream success with the release of Performance and Cocktails (and its promotional singles \"The Bartender and the Thief\", \"Just Looking\" and \"Pick a Part That's New\") in 1999 and have achieved a total of ten top-ten singles as well as one number one: \"Dakota\" (2005). Having sold around 10 million copies worldwide by 2016, Stereophonics are one of the most successful Welsh rock acts. Upon their release of Pull the Pin, they achieved five consecutive UK number one albums.\n\nThe band have also been praised for their live performances, which have landed them headlining slots at many of the UK and Ireland's most high-profile music festivals, including Reading and Leeds in 2000, Glastonbury in 2002, V Festival in 2002, the Isle of Wight in 2004 and 2009, Oxegen in 2010, Tramlines Festival and TRNSMT in 2018, and Latitude in 2019. The band is part of the Cardiff music scene.\n\nFull Wikipedia article: https://en.wikipedia.org/wiki/Stereophonics\n\nStudio albums\n\nWord Gets Around (1997)\n\nPerformance and Cocktails (1999)\n\nJust Enough Education to Perform (2001)\n\nYou Gotta Go There to Come Back (2003)\n\nLanguage. Sex. Violence. Other? (2005)\n\nPull the Pin (2007)\n\nKeep Calm and Carry On (2009)\n\nGraffiti on the Train (2013)\n\nKeep the Village Alive (2015)\n\nScream Above the Sounds (2017)\n\nKind (2019)\n\nOochya! (2022)"}, {"url": "https://www.udiscovermusic.com/artist/stereophonics/", "page_content": "Photo: Sandy Caspers/Redferns\n\nOne of the most consistently successful Welsh rock’n’roll acts ever, Stereophonics have a stellar CV which, to date, includes six chart-topping studio albums and 2008’s well-received Decade In The Sun: Best Of Stereophonics: an extensive, platinum-selling 2-CD career anthology which remained in the UK Top 100 for a staggering 165 weeks.\n\nOverviews of the band’s career often suggest they arrived fully formed and ready to conquer with their 1997 debut Word Gets Around, but, in reality, Stereophonics endured a decade of setbacks and potentially soul-destroying dues-paying before they finally emerged as contenders. Indeed, their roots are actually traceable back to the mid-80s, when the band’s guitar and vocal frontman Kelly Jones and original drummer Stuart Cable recorded an initial demo in their first band, Zephyr.\n\nDuring their formative years, Jones and Cable lived on the same street in the small town of Cwmaman in Mid-Glamorgan, and, while Zephyr soon blew away into history, the pair eventually joined forces for a second time. Their new project suffered from the inevitable round of personnel reshuffles because Jones and Cable initially wanted to enlist a second guitarist, yet, after another Jones was drafted in – Kelly’s friend Richard Jones, who brought his reliably hard-driving bass-playing with him – the group decided to remain a trio.\n\nADVERTISEMENT\n\nIn rock’s tried and tested fashion, the band began working the local club circuit under the name Tragic Love Company, in 1992. After a lot of slogging, they secured a support slot to the long-forgotten Smalltown Heroes, at London’s small but well-respected Borderline Club (off the Tottenham Court Road), where they met a suitably impressed production team, Marshall Bird and Steve Bush.\n\nOverseen by Bird and Bush, the band demoed one of Kelly Jones’ self-penned songs, ‘A Thousand Trees’, and changed their name to The Stereophonics; reputedly after Cable had seen the manufacturer name “Falcon Stereophonic” on a hi-fi system. The band’s demo helped secured them further local gigs and also bagged them a manager, John Brand, who first saw the group perform supporting another up-and-coming Welsh act, Catatonia, at Aberdare’s Coliseum Theatre in March 1996. With Brand handling management, record companies began taking an interest and, later in 1996, the band – now known simply as Stereophonics – became the first artists to sign to Virgin Records’ new offshoot label, V2 (now part of Universal Music UK).\n\nThe band’s initial rise to prominence was timed to perfection. With Britpop holding sway and a group of exciting, if relatively disparate young Welsh acts such as Super Furry Animals, 60 Ft Dolls and the aforementioned Catatonia scooping column inches in the rock weeklies, Stereophonics’ raw, but melodic guitar pop chimed with the times. Their debut LP, Word Gets Around (released in August 1997), shot to No.6 in the UK Top 40.\n\nLargely well-received by the critics, the LP was stuffed with Kelly Jones’ observational, human-interest story songs, many of which centred upon the vagaries of life in Stereophonics’ home town, Cwmaman. One of the LP’s quintet of 45s, the edgy ‘More Life In A Tramp’s Vest’ was a rumination on life as seen through the eyes of a supermarket bag boy, while the band’s first Top 30 hit, ‘A Thousand Trees’, relayed the story of a highly respected athletics coach falling from grace after an unfortunate sexual encounter with one of his students. Arguably the record’s most memorable track, however, was the atypically poised ballad ‘Traffic’ (also a Top 20 hit), which showed that Stereophonics had more to offer than punchy, arena-ready anthems.\n\nStereophonics toured extensively after their debut was released, receiving a Brit Award for Best New Group in February 1998, the same week their re-released 45, ‘Local Boy In The Photograph’, became their biggest hit to date, charting at No.14 in the UK.\n\nWord Gets Around went gold in the UK and Stereophonics were on a roll. Their second LP, Performance And Cocktails, was released in March 1999 and drastically exceeded commercial expectations, selling 120,000 copies in its first week and going straight to No.1 in the UK charts. Again produced by Bird and Bush, the album eventually went on to sell over 2.5 million copies, gaining multi-platinum status and yielding three consecutive British Top 5 hits courtesy of ‘The Bartender & The Thief’, ‘Just Looking’ and the infectiously poppy ‘Pick A Part That’s New’.\n\nStereophonics were rarely off the road as 1998 turned into ’99, touring widely in Europe, Australia and the US. Their schedule included a couple of triumphant homecoming gigs: shows at Cardiff Castle (12 June 1998) and Swansea’s Morfa Stadium, in ’99 (the latter before an audience of 50,000 people) were both filmed and recorded for separate DVD releases.\n\nThe band seemed unstoppable around the time the world ushered in the new millennium, releasing their third LP, Just Enough Education To Perform, in April 2001. Again topping the UK charts, the record was another phenomenal success, becoming the fourth best-selling British album of 2001 and going on to achieve multi-platinum sales in the UK, double-platinum sales in mainland Europe, and even sneaking on to the US Billboard 200 at No.188.\n\nThe album also spawned three Top 10 UK hits in the vitriol-tinged, anti-critic paean ‘Mr Writer’, the breezy ‘Have A Nice Day’ and the band’s emotive cover of the Mike d’Abo-penned ‘Handbags & Gladrags’, which Rod Stewart previously recorded for his 1969 LP, An Old Raincoat Won’t Ever Let You Down. Stylistically, the record was Stereophonics’ most mature outing to date, with elements of blues-rock (‘Watch Them Fly Sundays’) and gospel (‘Vegas Two Times’) infiltrating the raw, instantly recognisable indie-rock sound they’d patented on Word Gets Around and Performance And Cocktails.\n\nStereophonics enjoyed further multi-platinum success with 2003’s Kelly Jones-produced You Gotta Go There To Come Back (their third consecutive LP to top the UK charts), though it would be their last record to feature original drummer Stuart Cable, who had begun to forge a parallel media career which involved him presenting a TV show named Cable TV.\n\nNew drummer Javier Weyler was announced as Cable’s replacement, and Stereophonics played a successful world tour during 2003 and ’04, which featured a celebratory Christmas show at Cardiff’s Millennium Stadium and a well-received appearance at the Manchester Move Festival in July 2004. Weyler consequently made his debut on Stereophonics’ fifth LP, Language. Sex Violence. Other?, which was released in March 2005. Though notably more urgent and abrasive than the laid-back blues-influenced rock dominating You Gotta Go There To Come Back, the album nonetheless put up an impressive critical showing, with trailer single ‘Dakota’ topping the UK charts and the album following suit, selling 100,000 copies in its first week of release. The record also attracted praise from the critics, most of whom dug the band’s rekindled aggression and the brashness displayed by the LP’s best cuts, such as ‘Girl’ and the crunching ‘Doorman’.\n\nOn 2 July 2005, Stereophonics appeared at the globally televised Live 8 concert in Hyde Park, and, the following year, issued their first officially sanctioned live LP, Live From Dakota: a two-disc compilation capturing some of the highlights from their 2005 world tour. They returned to action in 2007 with a new studio LP, Pull The Pin: a slick, accomplished outing which again topped the UK charts and went gold. Arguably the LP’s stand-out moment, the first single ‘It Means Nothing’, related to the notorious 7/7 terrorist attacks in London. Despite the song’s hard-hitting subject matter, it climbed to No.12 in the UK charts.\n\nFeaturing two brand new tracks, ‘You’re My Star’ and ‘My Own Worst Enemy’, the band’s 40-track, platinum-selling career anthology Decade In The Sun: Best Of Stereophonics followed in 2008 before they re-entered the fray with November 2009’s Keep Calm And Carry On, their first record to feature recently recruited second guitarist Adam Zindani. The album stalled at No.11 on the UK charts, but it again went gold and spawned two well-received singles, ‘Innocent’ and ‘Could You Be The One?’. Drafted in to co-produce with Kelly Jones, Arctic Monkeys’ producer Jim Abbiss removed some of the gloss of Pull The Pin, but the stripped-down approach suited many of the album’s best tracks, including the lithe ‘She’s Alright’ and the spirited ‘I Got Your Number’.\n\nOn 5 June 2010, Stereophonics played the first-ever gig at the Cardiff City Stadium, with support from Doves and unsigned South Wales band 4th Street Traffic. Advertised as ‘Summer In The City’, the event attracted a sold-out audience of 30,000 people, though the band’s euphoria was dampened somewhat by the sudden death of their old friend and former drummer Stuart Cable, only two days later.\n\nStereophonics were back working on their next album during 2011, though before it was released, Jamie Morrison (ex-Noisettes) had replaced Javier Weyler on drums. Recorded primarily at ICP Studios in Brussels, the long-awaited album – Graffiti On The Train – finally arrived in March 2013, peaking at No.3 on the UK chart and selling an impressive 300,000 copies. The LP’s exhilarating second single, ‘Indian Summer’, reacquainted the band with the UK Top 30 singles chart, and the album itself attracted a brace of highly positive reviews, with critics lauding the record’s diversity and the quality of tracks, such as the orchestrally inclined titular song and the country/soul flavoured ‘Been Caught Cheating’.\n\nAnother worldwide promotional trek followed after the release of Graffiti On The Train but, by February 2014, Stereophonics were already ensconced in the studio working on new material. Released through their own Stylus label, the seemingly inexhaustible Welsh band’s ninth album, Keeping The Village Alive, was released in September 2015 and immediately shot to No.1 in the UK, as well as climbing to an impressive No.17 on the US Billboard Heatseekers Album Chart. Another highly confident return, its 10 tracks threw a few intriguing curveballs, including the baroque-flavoured ‘Sunny’ and the sinewy, disco-inflected ‘Fight Or Flight’, but mostly it was highly credible business as usual, with soaring anthems such as ‘C’est La Vie’ and ‘Sing Little Sister’ showing exactly why Stereophonics will inevitably continue to connect on the world stage.\n\nWords: Tim Peacock\n\nUK English Format:UK English"}, {"url": "https://planetradio.co.uk/absolute-radio/music/news/stereophonics/", "page_content": "Stereophonics: All your questions answered\n\nThey've achieved a huge amount in three decades together\n\nAuthor: Emma Dodds Published 5th Feb 2023\n\n\n\nWith over 30 years under their belt, not to mention eight Number 1 albums and 11 Top 10 singles, it's no wonder that Stereophonics are one of the biggest bands to ever come out of the UK.\n\nAfter the wrap of their huge 2022 arena tour, we thought it only proper to take a look back at the band's biggest moments throughout their hugely-impressive career. Find out about the Stereophonics right here...\n\nWho are Stereophonics?\n\nStarting off as a trio made up of Kelly Jones - who announced a solo album back in October 2020 - Richard Jones and Stuart Cable, the band has transformed over the years with various personnel changes. Richard and Kelly remain, now joined by Adam Zindani on rhythm guitar and Jamie Morrison on drums, with Tony Kirkham as a touring member.\n\nWhen did Stereophonics form?\n\nA teenaged Kelly Jones and Richard Jones began jamming together in around 1989, but the band officially started performing together in 1992.\n\nStereophonics: Who is in the band?\n\nKelly Jones and Richard Jones started the band, and are still in it today. Despite various line-up changes, they've stayed together. Kelly sings main vocals and guitar, and Richard plays bass guitar. Original drummer Stuart Cable was part of the group from the start until he left in 2003; he sadly passed away in 2010.\n\nJavier Weyler took over as drummer in 2004 until 2012, when he was replaced by former The Noisettes drummer Jamie Morrison. Adam Zindani joined as rhythm guitarist in 2007, and Tony Kirkham has been a touring member on the keyboard since 1999.\n\nWhere are Stereophonics from?\n\nThe band originated in the village of Cwmaman in the Cynon Valley in South Wales.\n\nHow did Stereophonics get their band name?\n\nThe band were originally called Tragic Love Company, which was taken from each members' favourite band - the Tragically Hip, Mother Love Bone and Bad Company. However, promoter Wayne Coleman convinced them to change it in 1992, telling the band they would not perform under the current name.\n\nHe then spotted a gramophone made by Falcon Stereophonic, and told Kelly about it, who - along with the rest of the band - agreed to change the name to The Stereophonics. When they signed their first record deal with V2 in 1996, they dropped 'The' to simply become Stereophonics.\n\nStereophonics: Their career so far\n\n1992: The band is born Kelly and Stuart lived on the same street in Cwmaman, Wales, and began jamming together as teenagers, recording a demo under the name Zephyr. After going their separate ways, Kelly and Stuart reunited a few years later, bringing in Richard Jones as bass guitarist - and thus, the line-up was complete.\n\n\n\n\n\nIn 1992, the trio - then known as Tragic Love Company - began to write together, performing in working men's clubs before landing a gig at the Borderline Club in London. They were spotted by producers Marshall Bird and Steve Bush, and recorded demo 'A Thousand Trees'.\n\n1992 - 1996: Career beginnings and name change Promoter Wayne Coleman organised gigs in South Wales after hearing their demo, and whilst he loved the music - he hated the band name, and said they wouldn't play if they kept it. He then spotted a gramophone manufacturer called Falcon Stereophonic, and the band became The Stereophonics.\n\n\n\n\n\nThey played the Coliseum Theatre in nearby Aberdare with Catatonia, and were approached by John brand afterwards who immediately became their manager. Just two months later, they were the first artists to sign to label V2, dropping 'The' from the band name.\n\n1997: Debut album and BRIT Award The band's debut album 'Word Gets Around' was released in August 1997, spawning singles 'A Thousand Trees', 'Local Boy in the Photograph' and 'Traffic' to name but a few. In 1998, they won the Best New Group BRIT Award, and released 'The Bartender and the Thief' - the first single from their follow-up, 'Performance and Cocktails', which in turn was released in March 1999.\n\n\n\n\n\nThe band played to 50,000 people at the Morfa Stadium in Swansea that year, and also collaborated with Welsh legend Tom Jones on a cover of 'Mama Told Me Not To Come'. They toured Europe, Australia and America in 1999, and performed at Cardiff Castle - later released on DVD.\n\n2001: 'Have A Nice Day' After headlining Reading and Leeds in 2000, third album 'Just Enough Education to Perform' was released in 2001, featuring two of their most famous songs: 'Have a Nice Day' and a cover of 'Handbags and Gladrags', which was included in the re-release in 2002. The band performed a two-day festival, 'A Day at the Races', at Donington Park and Cardiff's Millennium Stadium to promote the album, and also headlined Glastonbury Festival in 2002, as well as V Festival.\n\n\n\n\n\nThe band put out their fourth album 'You Gotta Go There to Come Back' in 2003, spawning singles 'Maybe Tomorrow', 'Madame Helga' and 'Since I Told You It's Over'. This was the last album to feature drummer Stuart Cable, who was let go from the band in September 2003. They also had their first headline slot at the Isle of Wight Festival in 2004, which they returned to in 2009.\n\n2005: A new line-up Stereophonics released their fifth album 'Language. Sex. Violence. Other?' in 2005, the first to feature new drummer, Javier Weyler. The album's single 'Dakota' became their first UK Number 1, and they performed that year at Live 8 in Hyde Park, London.\n\n\n\n\n\nKelly pictured here performing at the Isle of Wight Festival in 2009.\n\n2007: Kelly goes it alone Kelly also released his first solo album, 'Only the Names Have Been Changed', in 2007. He explained how it came about, \"We were recording the sixth Stereophonics album... And in-between takes I started doing these songs off the cuff. Three or four tracks in I realised that this could actually be something... Strange how it's always little things that makes big things happen.\"\n\n\n\n\n\nKelly is pictured performing at a session for Absolute Radio in 2009.\n\n2007 - 2010: ‘Pull The Pin’ 'Pull the Pin' was released in October 2007, spawning single 'It Means Nothing' which was written about the London 7/7 attack. Kelly told The Guardian it was \"about the feeling of unease in the city and people realising what was important in their lives.\"\n\n\n\n\n\nThey performed at the 2010 Olympic and Paralympic Winter Games in Vancouver, and released seventh album 'Keep Calm and Carry On', playing a UK tour throughout 2010 to promote it.\n\n\n\n\n\nThe band are pictured here at a session for Absolute Radio in 2009.\n\n2010: Stuart Cable's death Sadly, former member Stuart Cable passed away in June 2010, and Kelly decided to take a break from writing and releasing albums every two years.\n\n\n\n\n\nThe band released song 'Before Anyone Knew Our Name' in 2017 in memory of Stuart. Kelly said of the song, \"I think, you know, Stuart left the band and we were still friends for seven years. And then he passed away tragically, and of course people have opinions about what happened and all this sort of stuff. We kept it very private because we were like brothers.\"\n\n2009: Isle of Wight Festival We met the band backstage at the Isle of Wight Festival in 2009, where they kindly signed a guitar for us. It's still up on the wall.\n\n2011: New music and another personnel change The band announced on Facebook in 2011 that they were back in the studio, but in 2012 announced that Javier had left the group. Jamie Morrison of The Noisettes replaced him, and they released eighth album 'Graffiti on the Train' in March 2013.\n\n\n\n\n\nPictured here performing at Hyde Park in 2012 at the Olympics Opening Ceremony concert.\n\n2012: Isle of Wight Festival Our presenter Sarah Champion caught up with Kelly backstage at the Isle of Wight festival 2012 and the pair chatted away in our camper van. As you do.\n\n2015: 'Keep the Village Alive' Stereophonics impressively released a ninth album in September 2015, entitled 'Keep the Village Alive' which topped the UK Albums Chart. It contained singles 'C'est la Vie' and 'I Wanna Get Lost with You'. They also performed a set for us at the Dingwalls venue in Camden (pictured).\n\n2016: Backstage at the Isle of Wight Festival We had a chat with the band backstage at the Isle of Wight Festival in 2016 - but there was a slight mishap when guitarist Adam Zindani fell through the deck chair...\n\n2016: Backstage at Isle of Wight Festival take two Thankfully, we were able to get Adam a different chair and complete the interview... Oops!\n\n2017: 'Scream Above the Sounds' The band made their 10th album in 2017, releasing 'Scream Above the Sounds' in October. This realised Kelly's dream that they would put out their 10th studio album in the 20th anniversary year of their debut, instead of releasing a Greatest Hits album.\n\n\n\n\n\nPictured here performing at the Isle of Wight Festival in 2016.\n\n2019: 'Kind' But they didn't stop there, getting straight back in the studio to record their eleventh album, 'Kind', which was released in October 2019 and reached Number 1 in the UK. They also embarked on their tour to promote the album, kicking off in Liverpool on 18th January and concluding in Cardiff on 15th March.\n\n2020: Kelly Jones 'Don’t Let The Devil Take Another Day' 2020 saw frontman Kelly Jones release his album 'Don't Let The Devil Take Another Day'. The work contained 21 reworked tracks from throughout the Stereophonics' career, and even had its own documentary! The 90-minute feature tells the heartfelt story of the Stereophonics frontman/songwriter, following his personal uphill battle as he rediscovered his voice.\n\n2022: Stereophonics release 12th album 'Oochya!' and UK tour On 6th September 2021, Stereophonics announced that their 12th studio album will be titled 'Oochya!', and released it on Friday 4th March 2022! They later went on a huge tour to support the album's release throughout March and April.\n\n2023: Far From Saints Kelly teamed up with Austin's Patty Lynn and Dwight Baker to create new band Far From Saints, who released their debut single 'Let's Turn This Back Around' in January 2023. They're planning to release their album later this year and also preparing to tour the new music.\n\n\n\nWhat is Far From Saints?\n\nFar From Saints is lead singer Kelly Jones' new band with Austin’s Patty Lynn and Dwight Baker (aka The Wind and The Wave). According to the band's publicist, they first started jamming together when Patty and Dwight performed as the support acts to Kelly's solo UK tour in 2019.\n\n\"The three found themselves jamming and co-writing songs in backstage hallways, dressing rooms, soundchecks and hotels,\" a press release explains. \"Each songwriter subconsciously merging their influences to nourish the alchemy between two formidable singers.\"\n\nAfter releasing their debut single 'Let’s Turn This Back Around' in January 2023, the trio are preparing to put out an album in the summer of 2023 and tour the record.\n\nDavid Bowie inspired Stereophonics’ biggest hit ‘Dakota’\n\nSpeaking on stage at The O2 in London during Stereophonics’ February/March 2020 UK arena tour, Kelly Jones said David Bowie inspired him to write the smash hit ‘Dakota’. Stereophonics supported David Bowie on his 2003/2004 North American tour and struck up an immediate friendship.\n\nExplaining that Bowie often watched their soundchecks, Kelly said: \"David Bowie would be watching, so we didn’t want to waste too much of his time. So, we’d play a song for maybe 45 seconds, and then another song for like a minute, and then maybe another song for a minute, and then maybe 30 seconds of a song.\n\nHe continued: \"Then I would walk off the stage and I would walk towards the dressing room, and (Bowie) would put his arm on my shoulder and he would walk with me and say, 'You know, if you extended a few of those songs, you might be f---ing onto something'. So, I wrote this song, this is called ‘Dakota’.\"\n\nWATCH: Kelly Jones on the history of Stereophonics\n\nWhen was Stereophonics' latest album released?\n\nStereophonics' 12th studio album, 'Oochya!', was released on Friday 4th March 2022. Find out more about the album.\n\nThe band's 11th album 'Kind' was released in October 2019, hitting the top spot in the charts and has even been certified Silver in the UK. In December 2020, Kelly Jones released a solo album entitled 'Don’t Let The Devil Take Another Day'.\n\nAre Stereophonics on tour?\n\nNot at the moment. In early September 2021, Stereophonics announced a Spring 2022 UK arena tour, as well as a massive Welsh stadium show in support of their 12th studio album ‘Oochya!’.\n\nAbsolute Radio presents Stereophonics Live\n\nThe band kindly headlined a special gig just for us in February 2020 at Absolute Radio presents Stereophonics Live at the O2 Forum Kentish Town, London. Watch some of the performance below.\n\nNOW WATCH: Stereophonics at Dingwalls (Live For Absolute Radio)\n\nHear loads of Stereophonics' greatest hits every day on Absolute Radio and Absolute Radio 90s.\n\nNow read:\n\nStereophonics reveal how David Bowie inspired 'Dakota'\n\nStereophonics frontman Kelly Jones announces new solo album\n\n34 of your favourite artists: Then and now\n\nHow to listen to Absolute Radio:\n\nListen to Absolute Radio on DAB nationwide, on our free app, by hitting that play button on the bottom of your screen, via your smart speaker (“Play Absolute Radio”) and on Freeview, Sky, and Virgin Media TV."}, {"url": "https://www.radioswisspop.ch/en/music-database/band/626846371a2cd749c007700984782f15308a6/biography", "page_content": "Stereophonics are a Welsh rock band that formed in 1992 in the village of Cwmaman in the Cynon Valley. The band consists of Kelly Jones (lead vocals, lead guitar, keyboards), Richard Jones (bass guitar, piano, backing vocals), Adam Zindani (rhythm guitar, backing vocals), Jamie Morrison (drums, percussion) and touring member Tony Kirkham (keyboards). The group previously included Stuart Cable (1992–2003) and then Javier Weyler (2004–2012) on drums. Stereophonics have released ten studio albums, including six UK number one albums. Their latest album is Scream Above the Sounds (2017). A successful compilation album, Decade in the Sun, was released in November 2008 and charted at number two in the United Kingdom.\n\nDescribed as \"classic UK rock delivered with whiskey vocals\"[8], the band have been summarised as possessing a sound akin to the genres of alternative rock and \"British traditional rock\".[9] Stereophonics' debut album, Word Gets Around, was released in August 1997 and charted at number six in the UK, aided by the singles \"Local Boy in the Photograph\", \"More Life in a Tramps Vest\" and \"A Thousand Trees\". The band reached mainstream success with the release of Performance and Cocktails (and its promotional singles \"The Bartender and the Thief\", \"Just Looking\" and \"Pick a Part That's New\") in 1999 and have achieved a total of ten top-ten singles as well as one number one: \"Dakota\" (2005). Having sold around 10 million copies worldwide,[10][11] Stereophonics are one of the most successful Welsh rock acts. Upon their release of Pull the Pin, they became the eighth group to achieve five consecutive UK number one albums (after the Beatles, Led Zeppelin, ABBA, Genesis, Oasis, Blur and U2).\n\nThe band have also been praised for their live performances, which have landed them headlining slots at many of the UK and Ireland's most high-profile music festivals, including Reading and Leeds in 2000, Glastonbury in 2002, V festival in 2002, the Isle of Wight in 2004 and 2009, and Oxegen in 2010. The band is part of the Cardiff music scene.\n\nHistory\n\nFormation and early years (1986–1991)\n\nKelly Jones and Stuart Cable lived on the same street[12] in the Welsh village of Cwmaman.[13] Jones heard Cable played drums so asked if he wanted to jam together.[14] After some time practising in Jones' dad's garage, Nicholas Geek joined in on guitar. Later,[b] Jones invited Paul Rosser and Chris Davies to play on bass guitar and keyboards, respectively.[15] Cable recalls he was the one who suggested that Jones be the singer, as his dad was a singer back in the sixties who supported Roy Orbison.[15] In 1986 the band recorded a demo under the name \"Zephyr\". When Jones went on holiday the band played a gig without him, which resulted in Jones leaving the band and Jones and Cable going their separate ways.[12] Jones, Rosser and Davies formed their own R&B band called \"Silent Runner\" while Cable joined a glam-rock band named \"King Catwalk\" on drums.[16]\n\nA few years later,[b] Cable got sacked from the band and a few weeks after that when on a bus, he waved to Jones who was standing at a bus stop and waved back.[17] It was the first contact they had since Zephyr had broken up. Two weeks later, Jones and Cable started speaking again in the Ivy Bush.[18] They agreed to give the band another go but Cable only wanted to play their own songs, to which Jones agreed.[18] The duo invited Mark Everett to play for them on bass guitar and Jones then started writing his own songs.[19]\n\nEverett went on holiday for two weeks but Jones and Cable wanted to continue rehearsing, so Jones invited long-time friend Richard Jones to fill in for Everett.[19] Stunned by Richard's appearance and bass playing, Cable convinced Kelly to keep him instead of Everett.[19] The band decided they needed another member to play lead guitar. Simon Collier was the first guitarist brought in, but didn't stay in the band; he did, however, become Kelly's guitar technician.[20] The band tried hiring two other guitarists, another Richard Jones and Glenn Hyde.[21] Neither stayed for long. Hyde did however play harmonica on \"Rooftop\" for the band's 2001 album Just Enough Education to Perform.[21] After Hyde left, the band stuck as a three-piece act.[21]\n\nName change and V2 Records (1992–1996)\n\nKelly, Richard and Cable began writing and performing music in working men's clubs together in 1992 as a band known as \"Tragic Love Company\", a name inspired by their favourite bands (the Tragically Hip, Mother Love Bone and Bad Company).[22] After Tragic Love Company supported Smalltown Heroes in the Borderline Club, London, they met Marshall Bird and Steve Bush who were interested in producing for the band. The band agreed and recorded a demo for \"A Thousand Trees\".[23]\n\nWayne Coleman organised a series of concerts throughout South Wales, he was sent a demo from the band. Wayne liked it a lot but hated the band name and told them they wouldn't be performing unless they changed it.[24] After Cable read the manufacturer name of a gramophone, \"Falcon Stereophonic\", he told Kelly and the band agreed to change their name to \"the Stereophonics\".[25] In March 1996, the band played a gig at their local Coliseum Theatre, Aberdare with Catatonia and the Pocket Devils.[25] When the band finished their slot, John Brand approached them and he became their manager.[26] Brand managed to get over 35 record companies in the UK interested in signing the Stereophonics.[27] In May 1996, they signed with V2,[28] the first artists to be signed to newly formed record label.[29] Upon signing, they dropped \"the\" from their name and simply became \"Stereophonics\".\n\nDebut album and ascent to fame (1997–2000)\n\nIn August 1997, the band released their first studio album, Word Gets Around, which reached number six in the UK charts, from which five singles were released. Afterwards, the band embarked on a successful world tour.\n\nIn February 1998, the band received a BRIT Award for Best New Group. In the same week, the band re-released the single \"Local Boy in the Photograph\", which in turn reached number fourteen in the UK Singles Chart. The band's debut album, Word Gets Around, also went gold in the UK.\n\nIn November 1998, \"The Bartender and the Thief\" (the first single from the album Performance and Cocktails) was released, eventually reaching number three on the UK charts. \"Just Looking\" was released next and reached number four in March 1999. In that same month, the album was released, entering at number one and going platinum within three weeks. Later that year, the band played in front of 50,000 people at Morfa Stadium in Swansea. The concert was filmed and released on DVD the following year. They also collaborated with Tom Jones on a cover of the Randy Newman song \"Mama Told Me Not To Come\", for the Tom Jones album Reload.\n\nThroughout 1998 and 1999, the band toured in Europe, Australia and the US. On 12 June 1998, Stereophonics played to over 10,000 spectators in the grounds of Cardiff Castle in Wales. Footage of the concert was released on VHS and DVD, titled Live at Cardiff Castle.\n\nMainstream success (2001–2004)\n\nThe band released their third album, Just Enough Education to Perform, in April 2001. The album included the track \"Mr. Writer\", which includes lyrics that criticise a critic who the band believe gave them a negative review. The album also contained one of the band's most famous tracks, \"Have a Nice Day\", which reached number five in the UK charts. To promote the new album, Just Enough Education to Perform, the Stereophonics played a two-day festival, which was called A Day at the Races. This event was held in Donington Park on the first day and at Cardiff's Millennium Stadium on the second. The concerts were supported by Ash, Black Crowes and the Crocketts, with Proud Mary playing Donington only. Over 200,000 separate tickets were sold for the weekend festival. The performance was released on a DVD in 2002.\n\n2003 saw the release of their fourth album, titled You Gotta Go There to Come Back. In September 2003, drummer Stuart Cable was sacked. According to reports, it was because of his lack of commitment to the band. Cable, at the time, presented a TV show called \"Cable TV\" and felt that the band would never improve. Because of this, he missed several rehearsals and live concerts. He was eventually replaced by Javier Weyler.[30] Steve Gorman, from the Black Crowes, stood in for Cable during the band's live performances until Weyler was appointed. When asked about Cable leaving the band in a 2010 interview with Rip It Up magazine, Kelly Jones admitted to the difficulty of the situation.[31]\n\nTowards the end of the year, Stereophonics did a sold-out tour of the UK, ending with a Christmas show at the Millennium Stadium, Cardiff, supported by Feeder, Ocean Colour Scene and Adam Masterson. The show was closed with a live version of \"Merry Xmas Everybody\", originally recorded by Slade. The group took a break after their 2003–2004 world tour, which included a set at the Manchester Move Festival in July 2004.\n\nDrummer change and Stuart Cable's death (2005–2010)\n\nTheir fifth studio album, Language. Sex. Violence. Other? was released in March 2005. It marked their first recording with new drummer Javier Weyler. The band achieved their first number one hit in the UK singles charts with the album's first single, \"Dakota\". The second single from the album was \"Superman\". However, that song did not repeat the success of \"Dakota\", peaking at number thirteen. After \"Superman\" came \"Devil\", featuring a controversial video and reaching number eleven in the charts. The album was nominated for a Pop Factory award at the end of the year, losing out to Feeder's Pushing the Senses.\n\nOn 2 July 2005, the group appeared at the Live 8 concert in Hyde Park, London, playing to their biggest audience yet. The band were also scheduled to support Oasis for a number of dates across Europe, in early 2006, but pulled out due to family commitments. 2006 also saw the release of Stereophonics' first live album, Live from Dakota. The album is a two-disc compilation, featuring twenty tracks spanning all five of the band's albums and capturing the best of their 2005 world tour. Rather than being a recording of a single show, the tour was recorded every night and the band picked out the best version of each song individually. The album also features a track titled \"Jayne\", later released as part of Kelly Jones' solo album, Only the Names Have Been Changed.\n\nPull the Pin was released in the UK on 15 October 2007, along with a download-only taster; \"Bank Holiday Monday\". The track was also available for free to people who pre-ordered tickets for the band's concerts in 2007. The album was written and recorded by November 2006 but held back for release until late 2007.[32] \"It Means Nothing\" was the first single of the album, released in September before the LP was released a week later on 15 October. The album contains twelve songs and reached number one in the UK's official album chart. The next single, \"My Friends\", reached number thirty-two in the UK charts, their poorest chart performance since \"More Life in a Tramps Vest\" from their debut album.\n\nOn 20 May 2007, at Radio 1's Big Weekend in Preston, the band were joined on stage by Casino frontman Adam Zindani. Zindani continued to tour with the band for the remainder of the Pull the Pin tour, playing lead guitar and backing vocals. He has been credited for writing and performing on two of the band's new tracks, \"You're My Star\" and \"My Own Worst Enemy\". On \"You're My Star\", he sings backing vocals and plays lead guitar, whereas on \"My Own Worst Enemy\" he only plays lead guitar. In November 2008, Stereophonics released their first greatest hits compilation, Decade in the Sun.\n\nOn 8 December 2009, the Vancouver Organizing Committee for the 2010 Olympic and Paralympic Winter Games announced the line up for performers for the nightly Victory Ceremonies.[33] These ceremonies included 30 minutes of entertainment from the evening's host province/territory, 30 minutes of medal presentations, and a one-hour performance by a musical talent. Stereophonics performed their song \"I Got Your Number\" at this event on 20 February - Yukon Night. The band's seventh album, titled Keep Calm and Carry On, was released on 16 November 2009. They decided on this name after seeing a poster in the White Horse pub in Richmond where they spent a lot of time whilst recording the album.[34] The album's debut single was \"Innocent\".[35] The second single from the album, \"Could You Be the One?\", was released on 15 February 2010. The band embarked on a seven-date tour to support the new album in March 2010 playing at Aberdeen, Newcastle, Glasgow, Nottingham, Birmingham, Manchester, Sheffield and London.[34] with support from Glasgow band Hip Parade.\n\nOn 5 June 2010, Stereophonics played the first-ever gig at the Cardiff City Stadium with support from unsigned South Wales band 4th Street Traffic, followed by Kids in Glass Houses and Doves. The concert, known as \"Summer in the City\", was played to a sold-out audience of 30,000. Two days later, original drummer Stuart Cable was found dead in his home in Aberdare having choked on his own vomit after binge drinking.[36] After the Keep Calm and Carry On Tour concluded, and their contract with Universal at an end, Kelly Jones wanted to change the way the band works and so decided to take a break from writing and recording an album every two years.[37]\n\nGraffiti on the Train, Keep the Village Alive and Scream Above the Sounds (2011–present)\n\nOn 3 March 2011, Stereophonics announced on their Facebook page that they were working on new music in the studio.[38] In July 2012 it was announced that Weyler and the band had parted company. The announcement was made on the band's Facebook page, though no reason was given for his departure.[39] It was announced on 24 September 2012 that Jamie Morrison, former drummer for Noisettes, had replaced Weyler in the band.[40] On 8 October 2012, Stereophonics released the video to a track titled \"Violins and Tambourines\" from the upcoming album.[41] On 4 November, the first single from the new album, \"In a Moment\", was released as a free download from the band's website.[42] On the same day, NME.com reported that the album would be titled Graffiti on the Train.[43] The album was released on 4 March 2013.[44] Second single preceding the album, \"Indian Summer\" was released in January 2013; by 10 March it had peaked at number 30 in the UK, making it their group's first UK top-40 single since 2007. A third single, the album's title track, was released on 13 May.[45]\n\nIn late September 2014, it was announced via their Twitter page that a new album has been mixed and that it should be released in 2015.[46] On 21 March 2015, Stereophonics performed in Bristol and in London's Royal Albert Hall and debuted 3 new songs \"C'est La Vie\", \"I Wanna Get Lost With You\" and \"Song for the Summer\" which are to be on their 9th album Keep the Village Alive with the release date of 11 September. \"C'est la Vie\" was released as the first single of the album. [47] In September 2015 the band appeared on BBC Two's Later... with Jools Holland.[48] During the Keep the Summer Alive Tour, Kelly Jones announced he would like to release the band's tenth studio album \"before next summer\" to commemorate the 20th anniversary of Word Gets Around, rather than release a compilation album.[49][50]\n\nOn 27 July 2017 the band announced Scream Above the Sounds as the title for the album and will be released on 27 October 2017. It became available to pre-order on the same day. The band released \"All In One Night\" on the same day as the lead single from it. On 4 September 2017 \"Caught By The Wind\" was released as the second single from the album followed by \"What's All The Fuss About?\" as the third single on 4 December 2017. They will embark on a tour in 2018\n\nOther projects\n\nOn 9 October 2007, a retrospective DVD was released in the United States, Rewind: The First 10 Years. The DVD is a double disc with a runtime of nearly four hours. Much of this footage was recorded around the time that the You Gotta Go There to Come Back album was being recorded. This is because a similar band history DVD was listed for release shortly after that album but was never released, due to the departure of Stuart Cable. This explains Jones' hairstyle (circa 2003/2004) in the interview footage and the appearance of Stuart and the rest of the band freely talking about their togetherness and solidarity as the original three members. The original footage was updated by adding further footage to the end, bringing it up to date with the band's fifth album. Stuart does not appear on any of the extra footage. Availability coincides with the US re-release of the Language.Sex.Violence.Other? DVD, and the worldwide digital debut of their latest studio album, Pull the Pin.\n\nIn 2007, Jones released a solo album, titled Only the Names Have Been Changed, while recording the band's sixth studio album, Pull the Pin. The album contains ten tracks (all named after women) and features minimal instrumentation. The album also includes the song \"Jayne\", a previously unreleased Stereophonics track featured on the live album Live from Dakota and the Rewind DVD.\n\nStereophonics also performed the original opening theme tune for the TV series Long Way Round. The song's lyrics were slightly altered for the follow-up series, Long Way Down.\n\nPersonnel\n\nCurrent members Kelly Jones – lead vocals, lead guitar, keyboards, piano (1992–present)\n\nRichard Jones – bass, piano, backing vocals (1992–present)\n\nAdam Zindani – rhythm guitar, backing vocals (2007–present)\n\nJamie Morrison – drums (2012–present) Former members Stuart Cable – drums, percussion (1992–2003; died 2010)\n\nJavier Weyler – drums, percussion, backing vocals (2004–2012) Current touring musicians Tony Kirkham – keyboards, piano, harmonica, backing vocals (1999–present) Former touring musicians Scott James – guitar, backing vocals (2001–2004)\n\nAileen McLaughlin – backing vocals (2002–2003)\n\nAnna Ross – backing vocals (2002–2003)\n\nSteve Gorman – drums, percussion (2003–2004; member of the Black Crowes)\n\nSam Yapp – drums, percussion (2012; member of Casino)\n\nTimeline\n\nDiscography\n\nWord Gets Around (1997)\n\n(1997) Performance and Cocktails (1999)\n\n(1999) Just Enough Education to Perform (2001)\n\n(2001) You Gotta Go There to Come Back (2003)\n\n(2003) Language. Sex. Violence. Other? (2005)\n\n(2005) Pull the Pin (2007)\n\n(2007) Keep Calm and Carry On (2009)\n\n(2009) Graffiti on the Train (2013)\n\n(2013) Keep the Village Alive (2015)\n\n(2015) Scream Above the Sounds (2017)\n\nAwards and nominations\n\nReferences\n\nNotes\n\n^ Graffiti on the Train's liner notes and the back of \"We Share the Same Sun\" vinyl cover.[4][5] It is also listed under \"associated labels\" on Ignition Records' website.[6] Stylus Records is under exclusive licence to Ignition Records Ltd and Parlophone . This is stated inliner notes and the back of \"We Share the Same Sun\" vinyl cover.It is also listed under \"associated labels\" on Ignition Records' website. a b Exact dates aren't given in Demons and Cocktails.\n\nFootnotes\n\nBibliography\n\nStuart Cable (2009). Marks, Howard, ed. Demons and Cocktails. London: John Blake Publishing Ltd. ISBN 978-1-84454-726-5."}, {"url": "https://whatculture.com/music/10-best-stereophonics-songs", "page_content": "Formed in 1992 in the Welsh village of Cwmaman, the Stereophonics are one of the most talented and recognisable bands to come out of Wales.\n\nFronted by Kelly Jones since their formation, the group have been steadily producing albums since 1997's Word Gets Around, with ten albums of a unique-sounding alternative rock currently to their name. The current lineup of Kelly Jones, Adam Zindani, Richard Jones (no relation) and Jamie Morrison still sound just as strong as ever, creating music that few other bands and groups have been able to effectively replicate.\n\nWith Jones' \"whisky\" vocals giving the group a trademark sound, the band have had a litany of instantly recognisable and memorable singles over their 22-year career, with their most recent effort, 2017's Scream Above the Sounds, still demonstrating the musical ability that launched their careers in the first place.\n\nWith the band's eleventh album soon to be released, now is as good a time as any to delve into their discography..."}, {"url": "https://www.eirewave.co.uk/music/artists/stereophonics", "page_content": "Stereophonics are a Welsh rock band formed in 1992 in the village of Cwmaman in the Cynon Valley, Wales. The band consists of Kelly Jones, Richard Jones, Adam Zindani, Jamie Morrison and touring member Tony Kirkham (keyboards). The group previously included Stuart Cable (1992–2003) and then Javier Weyler (2004–2012) on drums. Stereophonics have released twelve studio albums, including eight UK number one albums. A successful compilation album, Decade in the Sun, was released in November 2008 and charted at number two on the UK Album Chart.History Formation and early years (1986–1991) Kelly Jones and Stuart Cable lived on the same street in the Welsh village of Cwmaman. J...\n\nHistory\n\nStereophonics are a Welsh rock band formed in 1992 in the village of Cwmaman in the Cynon Valley, Wales. The band consists of Kelly Jones, Richard Jones, Adam Zindani, Jamie Morrison and touring member Tony Kirkham (keyboards). The group previously included Stuart Cable (1992–2003) and then Javier Weyler (2004–2012) on drums. Stereophonics have released twelve studio albums, including eight UK number one albums. A successful compilation album, Decade in the Sun, was released in November 2008 and charted at number two on the UK Album Chart.\n\nFormation and early years (1986–1991)\n\nKelly Jones and Stuart Cable lived on the same street in the Welsh village of Cwmaman. Jones heard Cable played drums so asked if he wanted to jam together. After some time practising in Jones' dad's garage, Nicholas Geake joined in on guitar. Later,[lower-alpha 2] Jones invited Paul Rosser and Chris Davies to play on bass guitar and keyboards, respectively. Cable recalls he was the one who suggested that Jones be the singer, as his dad was a singer back in the sixties who supported Roy Orbison. In 1986 the band recorded a demo under the name \"Zephyr\". When Jones went on holiday the band played a gig without him, which resulted in Jones leaving the band and Jones and Cable going their separate ways. Jones, Rosser and Davies formed their own R&B band called \"Silent Runner\" while Cable joined a glam-rock band named \"King Catwalk\" on drums.\n\nA few years later,[lower-alpha 2] Cable got sacked from the band and after a few weeks after that when on a bus, he waved to Jones who was standing at a bus stop and waved back. It was the first contact they had since Zephyr had broken up. Two weeks later, Jones and Cable started speaking again in the Ivy Bush. They agreed to give the band another go but Cable only wanted to play their own songs, to which Jones agreed. The duo invited Mark Everett to play for them on bass guitar and Jones then started writing his own songs.\n\nEverett went on holiday for two weeks but Jones and Cable wanted to continue rehearsing, so Jones invited long-time friend Richard Jones to fill in for Everett. Stunned by Richard's appearance and bass playing, Cable convinced Kelly to keep him instead of Everett. The band decided they needed another member to play lead guitar. Simon Collier was the first guitarist brought in, but didn't stay in the band; he did, however, become Kelly's guitar technician. The band tried hiring two other guitarists, another Richard Jones and Glenn Hyde. Neither stayed for long. Hyde did however play harmonica on \"Rooftop\" for the band's 2001 album Just Enough Education to Perform. After Hyde left, the band stuck as a three-piece act.\n\nMainstream success (2001–2004)\n\nThe band released their third album, Just Enough Education to Perform, in April 2001. The album included the track \"Mr. Writer\", which includes lyrics that criticise a critic who the band believe gave them a negative review. The album also contained one of the band's most famous tracks, \"Have a Nice Day\", which reached number five in the UK charts. To promote the new album, Just Enough Education to Perform, the Stereophonics played a two-day festival, which was called A Day at the Races. This event was held in Donington Park on the first day and at Cardiff's Millennium Stadium on the second. The concerts were supported by Ash, Black Crowes and the Crocketts, with Proud Mary playing Donington only. Over 200,000 separate tickets were sold for the weekend festival. The performance was released on a DVD in 2002.\n\n2003 saw the release of their fourth album, titled You Gotta Go There to Come Back. The album contained one of the band's most popular songs, Maybe Tomorrow. In September 2003, drummer Stuart Cable was sacked. According to reports, it was because of his lack of commitment to the band. Cable, at the time, presented a TV show called \"Cable TV\" and felt that the band would never improve. Because of this, he missed several rehearsals and live concerts. He was eventually replaced by Javier Weyler. Steve Gorman, from the Black Crowes, stood in for Cable during the band's live performances until Weyler was appointed. When asked about Cable leaving the band in a 2010 interview with Rip It Up magazine, Kelly Jones acknowledged the difficulty of the situation.\n\nTowards the end of the year, Stereophonics did a sold-out tour of the UK, ending with a Christmas show at the Millennium Stadium, Cardiff, supported by Feeder, Ocean Colour Scene and Adam Masterson. The show was closed with a live version of \"Merry Xmas Everybody\", originally recorded by Slade. The group took a break after their 2003–2004 world tour, which included a set at the Manchester Move Festival in July 2004.\n\nDrummer change and Stuart Cable's death (2005–2010)\n\nStereophonics performing in Hamburg, 13 September 2007\n\nTheir fifth studio album, Language. Sex. Violence. Other? was released in March 2005. It marked their first recording with new drummer Javier Weyler. The band achieved their first number one hit in the UK singles charts with the album's first single, \"Dakota\". The second single from the album was \"Superman\". However, that song did not repeat the success of \"Dakota\", peaking at number thirteen. After \"Superman\" came \"Devil\", featuring a controversial video and reaching number eleven in the charts. The album was nominated for a Pop Factory award at the end of the year, losing out to Feeder's Pushing the Senses.\n\nOn 2 July 2005, the group appeared at the Live 8 concert in Hyde Park, London, playing to their biggest audience yet. The band were also scheduled to support Oasis for a number of dates across Europe, in early 2006, but pulled out due to family commitments. 2006 also saw the release of Stereophonics' first live album, Live from Dakota. The album is a two-disc compilation, featuring twenty tracks spanning all five of the band's albums and capturing the best of their 2005 world tour. Rather than being a recording of a single show, the tour was recorded every night and the band picked out the best version of each song individually. The album also features a track titled \"Jayne\", later released as part of Kelly Jones' solo album, Only the Names Have Been Changed.\n\nPull the Pin was released in the UK on 15 October 2007, along with a download-only taster; \"Bank Holiday Monday\". The track was also available for free to people who pre-ordered tickets for the band's concerts in 2007. The album was written and recorded by November 2006 but held back for release until late 2007. \"It Means Nothing\" was the first single of the album, released in September before the LP was released a week later on 15 October. The album contains twelve songs and reached number one in the UK's official album chart. The next single, \"My Friends\", reached number thirty-two in the UK charts, their poorest chart performance since \"More Life in a Tramps Vest\" from their debut album.\n\nOn 20 May 2007, at Radio 1's Big Weekend in Preston, the band were joined on stage by Casino frontman Adam Zindani. Zindani continued to tour with the band for the remainder of the Pull the Pin tour, playing lead guitar and backing vocals. He has been credited for writing and performing on two of the band's new tracks, \"You're My Star\" and \"My Own Worst Enemy\". On \"You're My Star\", he sings backing vocals and plays lead guitar, whereas on \"My Own Worst Enemy\" he only plays lead guitar. In November 2008, Stereophonics released their first greatest hits compilation, Decade in the Sun.\n\nOn 8 December 2009, the Vancouver Organizing Committee for the 2010 Olympic and Paralympic Winter Games announced the line up for performers for the nightly Victory Ceremonies. These ceremonies included 30 minutes of entertainment from the evening's host province/territory, 30 minutes of medal presentations, and a one-hour performance by a musical talent. Stereophonics performed their song \"I Got Your Number\" at this event on 20 February – Yukon Night. The band's seventh album, titled Keep Calm and Carry On, was released on 16 November 2009. They decided on this name after seeing a poster in the White Horse pub in Richmond where they spent a lot of time whilst recording the album. The album's debut single was \"Innocent\". The second single from the album, \"Could You Be the One?\", was released on 15 February 2010. The band embarked on a seven-date tour to support the new album in March 2010 playing at Aberdeen, Newcastle, Glasgow, Nottingham, Birmingham, Manchester, Sheffield and London. with support from Glasgow band Hip Parade.\n\nOn 5 June 2010, Stereophonics played the first-ever gig at the Cardiff City Stadium with support from unsigned South Wales band 4th Street Traffic, followed by Kids in Glass Houses and Doves. The concert, known as \"Summer in the City\", was played to a sold-out audience of 30,000. Two days later, original drummer Stuart Cable was found dead in his home in Aberdare having choked on his own vomit after binge drinking. After the Keep Calm and Carry On Tour concluded, and their contract with Universal at an end, Kelly Jones wanted to change the way the band worked and so decided to take a break from writing and recording an album every two years.\n\nGraffiti on the Train, Keep the Village Alive and Scream Above the Sounds (2011–2018)\n\nOn 3 March 2011, Stereophonics announced on their Facebook page that they were working on new music in the studio. [non-primary source needed] In July 2012 it was announced that Weyler and the band had parted company. The announcement was made on the band's Facebook page, though no reason was given for his departure. It was announced on 24 September 2012 that Jamie Morrison, former drummer for Noisettes, had replaced Weyler in the band. [non-primary source needed] On 8 October 2012, Stereophonics released the video to a track titled \"Violins and Tambourines\" from the upcoming album. On 4 November, the first single from the new album, \"In a Moment\", was released as a free download from the band's website. On the same day, NME.com reported that the album would be titled Graffiti on the Train. The album was released on 4 March 2013. Second single preceding the album, \"Indian Summer\" was released in January 2013; by 10 March it had peaked at number 30 in the UK, making it their group's first UK top-40 single since 2007. A third single, the album's title track, was released on 13 May.\n\nIn late September 2014, it was announced via their Twitter page that a new album has been mixed and that it should be released in 2015. On 21 March 2015, Stereophonics performed in Bristol and in London's Royal Albert Hall and debuted 3 new songs \"C'est La Vie\", \"I Wanna Get Lost With You\" and \"Song for the Summer\" which are to be on their 9th album Keep the Village Alive with the release date of 11 September. \"C'est la Vie\" was released as the first single of the album. In September 2015 the band appeared on BBC Two's Later... with Jools Holland. During the Keep the Summer Alive Tour, Kelly Jones announced he would like to release the band's tenth studio album \"before next summer\" to commemorate the 20th anniversary of Word Gets Around, rather than release a compilation album.\n\nOn 27 July 2017 the band announced Scream Above the Sounds as the title for the album and will be released on 27 October 2017. It became available to pre-order on the same day. The album was released under the new distribution label \"Parlophone\", as the band parted ways with the old label V2. The band released \"All In One Night\" on the same day as the lead single from it. On 4 September 2017 \"Caught By The Wind\" was released as the second single from the album followed by \"Before Anyone Knew Our Name\" as the third single on 20 October 2017.They released the album's fourth and final single, \"What's All the Fuss About?\" on 4 December 2017. They embarked on the Scream Above The Sounds tour in 2018.\n\nKind. and Oochya! (2019–present)\n\nIn January 2019, Stereophonics announced two shows as part of Forest Live, the summer concert series promoted by the Forestry Commission: 13 June at Westonbirt Arboretum, near Tetbury, Gloucestershire and 23 June at Thetford Forest, near Brandon, Suffolk. Kind. became their seventh number-one album later that year.\n\nOriginally intending to release another greatest hits album, he band announced their twelfth album, Oochya! on 6 September 2021. It became their eighth number-one album, putting them level with Oasis, R.E.M. and Taylor Swift for the most UK number-one albums ever.\n\nOn 18 June 2022, the second of the band's two concerts at the Principality Stadium in Cardiff, was broadcast live on BBC One Wales and BBC Two, with special guest Sir Tom Jones.\n\nOther projects\n\nOn 9 October 2007, a retrospective DVD was released in the United States, Rewind: The First 10 Years. The DVD is a double disc with a runtime of nearly four hours. Much of this footage was recorded around the time that the You Gotta Go There to Come Back album was being recorded. This is because a similar band history DVD was listed for release shortly after that album but was never released, due to the departure of Stuart Cable. This explains Jones' hairstyle (circa 2003/2004) in the interview footage and the appearance of Stuart and the rest of the band freely talking about their togetherness and solidarity as the original three members. The original footage was updated by adding further footage to the end, bringing it up to date with the band's fifth album. Stuart does not appear on any of the extra footage. Availability coincides with the US re-release of the Language.Sex.Violence.Other? DVD, and the worldwide digital debut of their latest studio album, Pull the Pin.\n\nIn 2007, Jones released a solo album, titled Only the Names Have Been Changed, while recording the band's sixth studio album, Pull the Pin. The album contains ten tracks (all named after women) and features minimal instrumentation. The album also includes the song \"Jayne\", a previously unreleased Stereophonics track featured on the live album Live from Dakota and the Rewind DVD.\n\nStereophonics also performed the original opening theme tune for the TV series Long Way Round. The song's lyrics were slightly altered for the follow-up series, Long Way Down and Long Way Up.\n\nPersonnel\n\nCurrent members Kelly Jones – lead vocals, guitar, keyboards, piano (1992–present)\n\nRichard Jones – bass guitar, harmonica, backing vocals (1992–present)\n\nAdam Zindani – guitar, backing vocals (2007–present)\n\nJamie Morrison – drums, percussion (2012–present) Current touring musicians Tony Kirkham – keyboards, piano, harmonica, acoustic guitar, backing vocals (1999–present)\n\nGavin Fitzjohn - saxophone, guitar (2018–present) Former members Stuart Cable – drums, percussion (1992–2003; died 2010)\n\nJavier Weyler – drums, percussion, backing vocals (2004–2012) Former touring musicians Scott James – guitar, backing vocals (2001–2004)\n\nAileen McLaughlin – backing vocals (2002–2003)\n\nAnna Ross – backing vocals (2002–2003)\n\nSteve Gorman – drums, percussion (2003–2004)\n\nSam Yapp – drums, percussion (2012)\n\nTimeline\n\nSource : Wikipedia"}, {"url": "https://dbpedia.org/page/Stereophonics", "page_content": "Stereophonics és un grup de rock format per tres membres: Kelly Jones, Richard Jones i Javier Weyker. En Kelly i en Richard van créixer a Cwamaman, una ciutat al sud de Gal·les, on van començar, juntament amb l'antic bateria Stuart Cable. El primer nom que va adoptar la banda va ser Tragic Love Company, inspirats pels noms dels seus grups preferits (Tragically Hip, Mother Love Bone i Bad Company). El nom actual es va adoptar a partir de la marca del radiocasset de l'àvia de Stuart Cable. (ca)\n\nStereophonics je velšská rocková skupina, založená v roce 1992 ve vesnici na jihu Walesu. Původní sestavu skupiny tvořili zpěvák a kytarista Kelly Jones, baskytarista a bubeník Stuart Cable. Po celou dobu existence skupiny ve skupině zůstali pouze dva původní členové: Kelly Jones a Richard Jones (přes stejné příjmení nejsou příbuzní). Cable byl v roce 2004 nahrazen , kterého roku 2012 nahradil . Roku 2007 se ke skupině přidal kytarista . Své první studiové album nazvané Word Gets Around skupina vydala v roce 1997 a do roku 2019 jich vydala dalších deset. (cs)\n\nΟι Stereophonics είναι Ουαλικό ροκ συγκρότημα με εναλλακτικό ροκ και μπριτ ποπ ήχο, που δημιουργήθηκε το 1992. Έχουν κυκλοφορήσει επτά στούντιο άλμπουμ, πέντε εκ των οποίων έφτασαν στην κορυφή των Βρετανικών τσαρτς. Το 2005, το τραγούδι τους Dakota, έφτασε στην πρώτη θέση των σινγκλς στη Βρετανία. (el)\n\nDie Stereophonics sind eine walisische Rockband. Sie wurde 2005 durch den Song Dakota international bekannt. (de)\n\nStereophonics es una banda galesa de rock alternativo formada en 1992 en . En sus comienzos el grupo se hacía llamar \"Tragic Love Company\", nombre inspirado en tres de sus grupos favoritos: , Mother Love Bone y Bad Company. Más tarde, inspirados en un gramófono de la abuela de Stuart, cambiaron el nombre por el actual. La agrupación ha gozado de bastante éxito a través de los años. Hasta la fecha han vendido alrededor de 40 millones de discos en el mundo Stereophonics fue una de las primeras bandas en firmar por la discográfica de Richard Branson, , en agosto de 1996. Algunas de sus canciones más famosas son \"Dakota\", \"Maybe Tomorrow\" y \"Have a nice day\".​ El grupo tiene un total de 114 canciones publicadas. Son descritos a menudo como una banda de \"Rock británico puro\", sin embargo, a través de los años han desarrollado un sonido híbrido entre los subgéneros de Rock alternativo, Indie rock, Britpop y \"Rock tradicional británico\". El álbum debut de Stereophonics, Word Gets Around\", fue lanzado en agosto de 1997 y alcanzó el número seis en las listas del Reino Unido, potenciados por los singles \"Local Boy in the Photograph\", \"More Life in a Tramps Vest\" y \"A Thousand Trees\".Sumado a eso la banda también logró atención y un gran éxito con el lanzamiento de Performance and Cocktails\" y sus respectivos singles promocionales \"The Bartender and the Thief\" y \"Just Looking\" en 1999. Hasta la fecha la banda ha logrado un total de quince singles entre los diez primeros de las listas Británicas, así como un número uno, con su canción Dakota de 2005, perteneciente a su álbum Language. Sex. Violence. Other?el cual es el álbum más exitoso de la banda, con ventas estimadas en alrededor de 20 millones de copias en todo el mundo.Asimismo \"Stereophonics\" ha sido considerado uno de los grupos musicales galeses más exitosos de la historia. Después de su lanzamiento de Pull the Pin , se convirtieron en el octavo grupo en lograr el reconocimiento de posicionar cinco álbumes consecutivos como número uno en el Reino Unido, antes de ellos, lo habían logrado bandas como The Beatles, Led Zeppelin, ABBA, Génesis, Oasis, Pink Floyd y U2. La banda también ha sido elogiada y aclamada por el alto nivel de sus presentaciones en vivo junto con su energía en sus shows, las cuales los han llevado a marcar presencia en muchos de los festivales de música más importantes del Reino Unido, Irlanda y el resto de Europa, tales festivales como el Reading and Leeds Festival en el año 2000, Glastonbury en 2002, el Isla de Wight en 2004 y 2009, Oxegen en 2010 y Tramlines Festival Sheffield. (es)\n\nStereophonics est un groupe de rock britannique, originaire de Cwmaman, au Pays de Galles. Formé en 1992, il est mené par Kelly Jones (chant, guitare, textes), et composé de Richard Jones (basse), Adam Zindani (guitare, chœurs) et Jamie Morrison (batterie). Décrit comme « rock britannique classique accompagné d'un chant whiskey », le groupe est axé dans les genres rock alternatif et « rock traditionnel britannique ». Le premier album de Stereophonics, Word Gets Around, est publié en août 1997 et atteint la sixième place des classements britanniques, aidé par les singles Local Boy in the Photograph, More Life in a Tramps Vest et A Thousand Trees. Le groupe atteint le succès avec Performance and Cocktails (et ses singles promotionnels The Bartender and the Thief, Just Looking et Pick a Part That's New) en 1999, et compte désormais dix singles classés au top 10, ainsi qu'une chanson classée première, Dakota (en 2005). Stereophonics a vendu plus de dix millions d'exemplaires dans le monde. (fr)\n\nStereophonics merupakan sebuah grup musik asal Wales yang didirikan pada tahun 1992. Anggotanya berjumlah 4 orang yaitu , , dan . Album pertamanya ialah Word Gets Around dirilis tahun 1997. (in)\n\nStereophonics are a Welsh rock band formed in 1992 in the village of Cwmaman in the Cynon Valley, Wales. The band consists of Kelly Jones (lead vocals, lead guitar, keyboards), Richard Jones (bass guitar, harmonica, backing vocals), Adam Zindani (rhythm guitar, backing vocals), Jamie Morrison (drums, percussion) and touring member Tony Kirkham (keyboards). The group previously included Stuart Cable (1992–2003) and then Javier Weyler (2004–2012) on drums. Stereophonics have released twelve studio albums, including eight UK number one albums. A successful compilation album, Decade in the Sun, was released in November 2008 and charted at number two on the UK Album Chart. Described as \"classic UK rock delivered with whiskey vocals\", the band have been summarised as possessing a sound akin to the genres of alternative rock and \"British traditional rock\". Stereophonics' debut album, Word Gets Around, was released in August 1997 and charted at number six in the UK, aided by the singles \"Local Boy in the Photograph\", \"More Life in a Tramps Vest\" and \"A Thousand Trees\". The band reached mainstream success with the release of Performance and Cocktails (and its promotional singles \"The Bartender and the Thief\", \"Just Looking\" and \"Pick a Part That's New\") in 1999 and have achieved a total of ten top-ten singles as well as one number one: \"Dakota\" (2005). Having sold around 10 million copies worldwide by 2016, Stereophonics are one of the most successful Welsh rock acts. Upon their release of Pull the Pin, they achieved five consecutive UK number one albums. The band have also been praised for their live performances, which have landed them headlining slots at many of the UK and Ireland's most high-profile music festivals, including Reading and Leeds in 2000, Glastonbury in 2002, V Festival in 2002, the Isle of Wight in 2004 and 2009, Oxegen in 2010, Tramlines Festival and TRNSMT in 2018, and Latitude in 2019. The band is part of the Cardiff music scene. (en)\n\nStereophonics is een rockband afkomstig uit de Zuid-Welshe plaats Cwmaman. De band bestaat uit Kelly Jones, Richard Jones, Adam Zindani en Jamie Morrison. Stereophonics wordt gezien als een van de beste Britse livebands. (nl)\n\nGli Stereophonics sono un gruppo musicale rock britannico, costituitosi in Galles nel 1992, tra i massimi esponenti della seconda ondata del Britpop. Associabile alla scena alternative rock, il gruppo è formato da Kelly Jones, chitarra solista e voce, , basso e seconda voce, Adam Zindani, chitarra e seconda voce, e Jamie Morrison, batteria. Nei tour alla band si aggrega il tastierista Tony Kirkham. Il nucleo originario del gruppo comprendeva i due Jones, non uniti da legami di parentela, e Stuart Cable alla batteria. Nel 2003 Cable fu rimpiazzato da Javier Weyler, rimasto nella band sino al 2012. Gli Stereophonics hanno pubblicato dieci album in studio e hanno piazzato cinque di questi consecutivamente al primo posto della classifica britannica degli album. Nel novembre 2008 hanno pubblicato la raccolta Decade in the Sun: The Best of Stereophonics, giunta alla posizione numero due nella classifica di vendita nel Regno Unito. Debuttarono nel 1997 con l'album Word Gets Around, che conquistò la sesta piazza nelle classifiche britanniche, trainata da singoli quali Local Boy in the Photograph, More Life in a Tramps Vest e A Thousand Trees. Il successo vero giunse nel 1999 con Performance and Cocktails, da cui furono estratti come singoli The Bartender and the Thief, Just Looking e Pick a Part That's New. Vantano un totale di dieci singoli entrati nella top ten e un singolo giunto al primo posto della Official Singles Chart, Dakota, uscito nel 2005. Con oltre 10 milioni di copie vendute sono una delle band gallesi di maggiore successo di tutti i tempi. Con Pull the Pin sono diventati l'ottavo gruppo capace di piazzare cinque album consecutivi in testa alla classifica di vendita nel Regno Unito, dopo Beatles, Led Zeppelin, ABBA, Genesis, Oasis, Blur e U2. La band è presenza fissa dei principali festival musicali che si tengono in Regno Unito e in Irlanda. Ha preso parte al Festival di Reading e Leeds nel 2000, al Festival di Glastonbury nel 2002, al V Festival nel 2002 e nel 2015, all'Isle of Wight Festival nel 2004 e nel 2009, all'Oxegen Festival nel 2010, al T in the Park nel 2015, al TRNSMT nel 2018. (it)\n\n스테레오포닉스(Stereophonics)는 1991년 웨일스 사이넌 밸리의 쿰브란에서 결성된 얼터너티브 록 밴드이다. 현재는 보컬리스트이자 기타리스트인 켈리 존스, 베이시스트이자 백보컬을 맡고 있는 리차드 존스, 드러머인 그리고 기타리스트이자 백보컬인 로 구성되어 있으며 키보드는 세션 멤버인 토니 커크엄이 담당하고 있다. 스테레오포닉스는 8장의 정규 앨범을 발매했으며 그 중 5장은 영국 음반 차트 1위를 기록했다. 2008년 11월에는 컴필레이션 앨범인 Decade in the Sun을 발매하는데 이 또한 영국 음반 차트 2위를 기록했다. 2013년 3월, 스테레오포닉스는 그들 자신의 레이블인 Stylus Records에서 8번째 정규 앨범인 Graffiti on the Train을 발매하며 영국 음반 차트 3위를 차지한다. 2010년 7월 스테레오포닉스는 펜타포트 락 페스티벌에서 데뷔 후 첫 내한 공연을 가졌으며 2013년 안산 밸리 락 페스티벌에서 두 번째 내한 공연을 가졌다. (ko)\n\nステレオフォニックス (英語: Stereophonics) は、ウェールズのロックバンド。 1999年のセカンドアルバム『パフォーマンス・アンド・カクテルズ』から6作目の『プル・ザ・ピン』まで5作連続で全英1位を獲得するなど、セールス面で2000年代を代表するイギリスのロックバンド。地元ウェールズでは城を使ったライブを行うなど英国圏ではスタジアム級の動員を誇る。 (ja)\n\nStereophonics – walijski zespół rockowy założony w 1992 roku. (pl)\n\nStereophonics é uma banda britânica de Rock Alternativo criada em 1992, composta originalmente por Kelly Jones (vocal, guitarra, piano); Richard Jones (baixo); Stuart Cable (bateria). Originada em Cwmaman, País de Gales, a banda faz parte do cenário britpop. Lançaram dez álbuns de estúdio, seis dos quais lideraram a UK Albums Chart. O álbum mais recente da banda é o Scream Above The Sounds lançado em outubro de 2017. Atualmente a banda é formada por Kelly Jones (vocal, guitarra e piano), Richard Jones (baixo), Adam Zindani (Guitarra e backing vocals) e Jaime Morrison (Bateria). (pt)\n\nStereophonics — британская рок-группа, основанная в 1992 году в городе Кумаман (Cwmaman), Уэльс. За 30 лет существования выпустила 11 студийных альбомов, суммарный тираж которых превышает 10 млн. (ru)\n\nStereophonics är ett rockband från Wales, Storbritannien, som bildades 1992 i byn nära Aberdare i Wales. Bandmedlemmarna är för närvarande Kelly Jones på sång och gitarr, Richard Jones på bas, Javier Weyler på trummor och Adam Zindani på gitarr. Tony Kirkham (keyboard) spelar med bandet på turnéer. Bandet har släppt tio album som sålts i mer än 9 miljoner exemplar världen över. De storsäljande singlarna Maybe Tomorrow och Have a Nice Day är bandets största hits. Bandet var ursprungligen ett coverband och hette då Tragic Love Company, en blandning av namnen på tre av deras favoritband (The Tragically Hip, Mother Love Bone och Bad Company). De bytte sedan namn till \"Stereophonics\", som var namnet på tillverkaren av en skivspelare som tillhörde Stuart Cables far. I maj 1996 blev Stereophonics det första bandet som skrev på för det nystartade skivbolaget V2 Records. Deras första album Word Gets Around släpptes i augusti 1997 och blev en stor succé i Storbritannien, (sv)\n\n立體音響樂隊（英語：Stereophonics） 是英國威爾士的一個搖滾樂樂隊，于1999年在威爾士的Cwmaman組建。目前樂隊由Kelly Jones（主唱和吉他手），Richard Jones（貝斯手）, Jamie Morrison（鼓手），Adam Zindani（吉他手）和巡回演唱時成員Tony Kirkham（鍵盤手）組成。樂隊已經發行了12張錄音室專輯，其中有五張都獲得了英國專輯排行榜的榜首。他們的第七張Keep Calm and Carry On在2009年11月發行，不過沒能進入英國專輯榜前十位。 (zh)\n\nStereophonics — британський рок-гурт, заснований у 1992 році в містечку Кумаман у долині Кінон, Уельс. Нині до складу гурту входять: Келлі Джонс (вокал і гітара), Річард Джонс (бас-гітара, бек-вокал), Адам Зіндані (гітара, бек-вокал), Джеймі Моррісон (барабани) та член турне гурту Тоні Кіркхем (клавішні). Спочатку група влючала Стюарта Кейбла (1992—2003) і Хав'єра Вейлера (2004—2012) за барабанами. Stereophonics випустили вісім студійних альбомів, і є одним із восьми гуртів, які очолили чарти із п'ятьма послідовними альбомами, після The Beatles, Led Zeppelin, ABBA, Genesis, Oasis, Blur і U2). Їхній останній альбом 2015 року. Keep The Village Alive. Успішно скомпільований альбом був випущений у листопаді 2008-го та посів другу позицію в британському чарті. Охарактеризовані як «класичний британський рок зі жвавим вокалом», гурт підсумували як той, у котрого переважає звук, подібний до жанрів альтернативного року та «британського традиційного року». Дебютний альбом Stereophonics, , був випущений у серпні 1997-го та посів шосту позицію в чартах Британії завдяки синглам », » та ». Гурт досяг головного успіху з релізом (і його головними синглами », » і ») в 1999-му та загалом їхні десять синглів досягали топ-десятки синглів, а також першої позиції: » 2005-го. Продавши близько 10 мільйонів копій по всьому світові, Stereophonics стали найбільш успішними валлійськими рок-виконавцями. Гурт також хвалять за їхні живі виступи, що дозволяє їм опинятися в заголовках багатьох британських та ірландських найбільш визначних музичних фестивалях, включно з Редінг і Лідс у 2000-му, Гластонбері в 2002-му, у 2002-му, у 2004-му та 2009-му, й у 2010-му. Гурт є частиною музичної сцени Кардіффа. (uk)"}, {"url": "https://www.bbc.co.uk/events/evp3v2/acts/aqq4rz", "page_content": "Stereophonics are a Welsh rock band formed in 1992 in the village of Cwmaman in the Cynon Valley, Wales. The band consists of Kelly Jones (lead vocals, lead guitar, keyboards), Richard Jones (no relation) (bass guitar, harmonica, backing vocals), Adam Zindani (rhythm guitar, backing vocals), Jamie Morrison (drums, percussion) and touring member Tony Kirkham (keyboards). The group previously included Stuart Cable (1992–2003) and then Javier Weyler (2004–2012) on drums. Stereophonics have released twelve studio albums, including eight UK number one albums. A successful compilation album, Decade in the Sun, was released in November 2008 and charted at number two on the UK Album Chart.\n\n\n\nDescribed as \"classic UK rock delivered with whiskey vocals\", the band have been summarised as possessing a sound akin to the genres of alternative rock and \"British traditional rock\". Stereophonics' debut album, Word Gets Around, was released in August 1997 and charted at number six in the UK, aided by the singles \"Local Boy in the Photograph\", \"More Life in a Tramps Vest\" and \"A Thousand Trees\". The band reached mainstream success with the release of Performance and Cocktails (and its promotional singles \"The Bartender and the Thief\", \"Just Looking\" and \"Pick a Part That's New\") in 1999 and have achieved a total of ten top-ten singles as well as one number one: \"Dakota\" (2005). Having sold around 10 million copies worldwide by 2016, Stereophonics are one of the most successful Welsh rock acts. Upon their release of Pull the Pin, they achieved five consecutive UK number one albums."}]}