{"Don R. Swanson was the founding director of the Graduate School of Library and Information Science from 1975 to 1985.": [{"url": "https://news.uchicago.edu/story/don-r-swanson-information-science-pioneer-1924-2012", "page_content": "Don R. Swanson believed laboratories weren't the only source of new scientific discoveries. Swanson, a specialist in the relationship between natural and computer languages, thought electronic databases also held the key to medical knowledge.\n\nA trailblazing information scientist, Swanson died Nov. 18 at age 88.\n\nConcerned that excessive specialization could inhibit scientific creativity, Swanson pioneered the field of literature-based discovery, which uses existing research to create new knowledge. The three-term dean of the University’s Graduate Library School and professor emeritus in the Humanities Division believed that unearthing unseen links between two distinct areas of study could yield new discoveries—what he called “undiscovered public knowledge.”\n\nIn 2000, Swanson received the ASIST Award of Merit, the highest honor from the American Society for Information Science & Technology, for his work.\n\nArrowsmith: ‘An intellectual adventure’\n\nSwanson famously tested his theory of undiscovered public knowledge with a 1986 paper in which he made a provocative connection between dietary fish oil and Raynaud’s disease, a circulatory disorder.\n\nIn a search of the Medline database, which houses millions of scientific journal abstracts, Swanson found a common thread in research on Raynaud's disease and dietary fish oil. His hunting turned up numerous articles that described high blood viscosity in patients with Raynaud’s disease; in a separate search, he found a body of research that showed dietary fish oil could reduce blood viscosity.\n\nThe implication of bringing these two literatures together was powerful: could fish oil, Swanson wondered, be used to treat Raynaud’s disease?\n\nA clinical trial three years later validated the use of fish oil for patients with Raynaud’s disease. Swanson later hypothesized a connection between migraine headaches and magnesium deficiency that was also subsequently supported by clinical research.\n\nSpurred on by these findings, Swanson and Neil Smalheiser of the University of Illinois at Chicago developed Arrowsmith, a piece of software that assists investigators in identifying connections between two sets of Medline articles.\n\nArrowsmith (named after the 1925 Sinclair Lewis novel) was aimed at building a “systematic, computational” method to find possible links among articles, Smalheiser said. “The computer was not supposed to generate discoveries, but it was supposed to identify and put together these potential assertions.”\n\nThe Arrowsmith model proved influential, and the approach Swanson and Smalheiser developed has been adapted to study the correlations of genes with diseases and find possible new uses for medications.\n\nDespite the impact of Swanson and Smalheiser's work on Arrowsmith, “We never saw it as anything other than an intellectual adventure,” Smalheiser said.\n\n‘Experiments with information’ not salamanders\n\n“Don was doing science, without dissecting a salamander,” said Mark Olsen, assistant director of the American and French Research on the Treasury of the French Language (ARTFL) project, a major digital humanities project that was influenced by Swanson’s work. “He was doing experiments with information.”\n\nSwanson began his career studying physics as an undergraduate at the California Institute of Technology. He received his MA in physics from Rice University in 1947 and his PhD, also in physics, from the University of California, Berkeley, in 1952.\n\nEven in their early days, computers were a source of fascination for Swanson. “I think he was always dazzled by the idea of the computer,” said his wife, Patricia Swanson.\n\nSwanson worked as a computer systems analyst at Hughes Research & Development and research scientist at Ramo-Wooldridge Corp. & TRW, Inc., before he joined the UChicago faculty in 1963 as dean of the Graduate Library School (which closed in 1990). Swanson's background as a physical scientist set him apart from the seven previous deans of the school, who represented a variety of other disciplines.\n\nAt the GLS, Swanson initially focused on computer-aided information retrieval, an entirely new area of study at the time.\n\n“At the time Don began working on it, people simply couldn’t imagine that you could retrieve information with a computer,” said his colleague Abe Bookstein, professor emeritus in the Humanities. “In a field that was very qualitative, Don was instrumental in introducing quantitative formal techniques.”\n\nHe was also a rigorous and encouraging teacher, according to his former GLS student Charles Blair, who remembered Swanson for his “very clean, organized and methodical approach to his subject.”\n\nSwanson happily lent his expertise to colleagues around the University. In the early days of the ARTFL project, Prof. Robert Morrissey came to Swanson for advice on how to handle organization of the massive new database. “He told me, ‘What this project needs is a little sunshine and water,” remembered Morrissey, the Benjamin Franklin Professor of French Literature and director of ARTFL. “He was very generous with his time.”\n\nThat generosity was not unusual for Swanson, according to Smalheiser—Swanson went “out of his way to be nice and encouraging,” Smalheiser said.\n\nSwanson’s quiet manner belied a mischievous sense of humor that led him to write satiric articles, for example, “New Horizons in Psychoanalysis: Treatment of Necrosistic Personality Disorders,” in Perspectives in Biology and Medicine (1986).\n\nNot only intellectually witty but also physically fit, Swanson was an avid runner who completed a half-marathon at the age of 80.\n\nBut his work was by far his greatest passion, according to Patricia Swanson. “He was always trying to do something better,” she said.\n\nIn addition to his wife, Swanson is survived by his son, Richard B. Swanson; and his daughter, Judith A. Swanson, PhD’87. Another son, Douglas A. Swanson, died in 2004.\n\nIn lieu of flowers, donations in Swanson’s honor may be made to the University of Chicago Library, the Nature Conservancy or the Heritage Foundation."}, {"url": "http://manu47.magtech.com.cn/Jwk3_jdis/EN/10.1515/jdis-2017-0019", "page_content": "Rediscovering Don Swanson: The Past, Present and Future of Literature-based Discovery\n\nNeil R. Smalheiser\n\nJournal of Data and Information Science ›› 2017, Vol. 2 ›› Issue (4) : 43-64."}, {"url": "https://blog.sciencenet.cn/blog-1557-8018.html", "page_content": "Abstract\n\nWith the rapid development of science and technology, specialties are split into subspecialties further and there are poor communications across specialties. Information developed in one area of research may be of value in another without anyone becoming aware of the fact, so there should be many implicit undiscovered connections of interest which can not be retrieved by conventional computer-aided literature search. Don R. Swanson, professor of information science at the University of Chicago, solved this problem.\n\nHe developed an information method called non-interactive literature-based discovery and designed Arrowsmith, which is an interactive software and search strategies. This paper introduces the background\n\n, concept and application of Swanson’s information method in detail and the reviews of American information scientists on Swanson’s\n\nmethod and explains the author’s opinion. At last, the paper discusses the methodlogical enlightenment and significance of Swanson’s achievements in information science. Swanson is opening up a new way of doing information science."}, {"url": "https://handwiki.org/wiki/Biography:Don_R._Swanson", "page_content": "Don R. Swanson (October 10, 1924 – November 18, 2012) was an American information scientist, most known for his work in literature-based discovery in the biomedical domain. His particular method has been used as a model for further work, and is often referred to as Swanson linking. He was an investigator in the Arrowsmith System project,[1] which seeks to determine meaningful links between Medline articles to identify previously undiscovered public knowledge. He had been professor emeritus of the University of Chicago since 1996, and remained active in a post-retirement appointment until his health began to decline in 2009.\n\nSwanson received his B.S. in Physics at Caltech, Pasadena, California in 1945, followed by an M.A at Rice Institute, Houston, Texas, two years later, and then a PhD in Theoretical Physics from the University of California at Berkeley in 1952. He worked as a physicist at various laboratories until 1963, when he was made a professor and served as dean of the Graduate School of Library Science at the University of Chicago until 1972 and again from 1977–79 and 1987-89.\n\nIn 2000, he was awarded the ASIST Award of Merit, the highest honor of the society, for his \"lifetime achievements in research and scholarship.\" [2]\n\nReferences\n\nWorks\n\n1986a : \"Undiscovered public knowledge.\" Library Quarterly 56(2): 103-118.\n\n: \"Undiscovered public knowledge.\" 56(2): 103-118. 1986b : \"Fish oil, Raynaud's syndrome, and undiscovered public knowledge.\" Perspectives in Biology and Medicine 30(1): 7-18.\n\n: \"Fish oil, Raynaud's syndrome, and undiscovered public knowledge.\" 30(1): 7-18. 1987 : \"Two medical literatures that are logically but not bibliographically connected.\" Journal of the American Society of Information Science 38(4): 228-233.\n\n: \"Two medical literatures that are logically but not bibliographically connected.\" 38(4): 228-233. 1988 : \"Migraine and magnesium: Eleven neglected connections.\" Perspectives in Biology and Medicine 31(4): 526-557.\n\n: \"Migraine and magnesium: Eleven neglected connections.\" 31(4): 526-557. 1989a : \"Online search for logically-related noninteractive medical literature: A systematic trial-and-error strategy.\" Journal of the American Society of Information Science 40: 356-358.\n\n: \"Online search for logically-related noninteractive medical literature: A systematic trial-and-error strategy.\" 40: 356-358. 1989b : \"A second example of mutually-isolated medical literatures related by implicit, unnoticed connections.\" Journal of the American Society of Information Science 40: 432-435.\n\n: \"A second example of mutually-isolated medical literatures related by implicit, unnoticed connections.\" 40: 432-435. 1990a : \"Somatomedin C and arginine: Implicit connections between mutually-isolated literatures,\" Perspectives in Biology and Medicine 33 (1990): 157-186.\n\n: \"Somatomedin C and arginine: Implicit connections between mutually-isolated literatures,\" 33 (1990): 157-186. 1990b : \"Medical literature as a potential source of new knowledge.\" bulletin of the Medical Library Association 78(1) 29-37.\n\n: \"Medical literature as a potential source of new knowledge.\" 78(1) 29-37. 1990c : \"Integrative mechanisms in the growth of knowledge: A legacy of Manfred Kochen.\" Information Processing & Management 26(1): 9-16.\n\n: \"Integrative mechanisms in the growth of knowledge: A legacy of Manfred Kochen.\" 26(1): 9-16. 1990d : \"The absence of co-citation as a clue to undiscovered causal connections.\" In: C. L. Brogman, ed. Scholarly Communication and Bibliometrics . 129-137. Sage Publ., Newbury Park, CA.\n\n: \"The absence of co-citation as a clue to undiscovered causal connections.\" In: C. L. Brogman, ed. . 129-137. Sage Publ., Newbury Park, CA. 1991 : \"Complementary structures in disjoint science literatures.\" In: A. Bookstein, et al., eds., SIGIR91 Proceedings of the Fourteenth Annual International ACM/SIGIR Conference on Research and Development in Information Retrieval . Chicago, Oct. 13-16, 1991. New York: ACM. pp. 280–9. ACM\n\n: \"Complementary structures in disjoint science literatures.\" In: A. Bookstein, et al., eds., . Chicago, Oct. 13-16, 1991. New York: ACM. pp. 280–9. ACM 1993 : \"Intervening in the life cycles of scientific knowledge,\" Library Trends 41(4): 606-631.\n\n: \"Intervening in the life cycles of scientific knowledge,\" 41(4): 606-631. 1996 : \"Undiscovered public knowledge: A ten-year update.\" In: Data Mining: Integration & Application (KDD-96 Proceedings, AAAI) 295-298. (with Neil R. Smalheiser)\n\nhttp://www.aaai.org/Papers/KDD/1996/KDD96-051.pdf\n\n: \"Undiscovered public knowledge: A ten-year update.\" In: (KDD-96 Proceedings, AAAI) 295-298. (with Neil R. Smalheiser) http://www.aaai.org/Papers/KDD/1996/KDD96-051.pdf 1997 : \"An interactive system for finding complementary literatures: a stimulus to scientific discovery,\" Artificial Intelligence , (91)2: 183-203. (with Neil R. Smalheiser) ACM\n\n: \"An interactive system for finding complementary literatures: a stimulus to scientific discovery,\" , (91)2: 183-203. (with Neil R. Smalheiser) ACM 1999 : \"Implicit text linkages between Medline records: Using Arrowsmith as an aid to scientific discovery.\" Library Trends 48(l): 48-59. (with Neil R. Smalheiser)\n\n: \"Implicit text linkages between Medline records: Using Arrowsmith as an aid to scientific discovery.\" 48(l): 48-59. (with Neil R. Smalheiser) 2001 : \"Information discovery from complementary literatures: categorizing viruses as potential weapons.\" Journal of the American Society for Information Science and Technology 52(10): 797-812. (with Neil R. Smalheiser and A. Bookstein) ACM\n\n: \"Information discovery from complementary literatures: categorizing viruses as potential weapons.\" 52(10): 797-812. (with Neil R. Smalheiser and A. Bookstein) ACM 2006: \"Ranking indirect connections in literature-based discovery: The role of medical subject headings.\" Journal of the American Society for Information Science and Technology 57(11):1427-39. (with Neil R. Smalheiser and Vetle I. Torvik) ACM\n\nhttps://web.archive.org/web/20100326164704/http://kiwi.uchicago.edu/JA2434.pdf\n\nNotes\n\n\n\n\n\n\n\n\n\n"}, {"url": "https://dl.acm.org/profile/81100070976/publications", "page_content": "Automatic normalization of author names is not exact. Hence it is clear that manual intervention based on human knowledge is required to perfect algorithmic results. ACM is meeting this challenge, continuing to work to improve the automated merges by tweaking the weighting of the evidence in light of experience.\n\nThe more conservative the merging algorithms, the more bits of evidence are required before a merge is made, resulting in greater precision but lower recall of works for a given Author Profile. Many bibliographic records have only author initials. Many names lack affiliations. With very common family names, typical in Asia, more liberal algorithms result in mistaken merges.\n\nACM will expand this edit facility to accommodate more types of data and facilitate ease of community participation with appropriate safeguards. In particular, authors or members of the community will be able to indicate works in their profile that do not belong there and merge others that do belong but are currently missing.\n\nA direct search interface for Author Profiles will be built.\n\nAn institutional view of works emerging from their faculty and researchers will be provided along with a relevant set of metrics.\n\nIt is possible, too, that the Author Profile page may evolve to allow interested authors to upload unpublished professional materials to an area available for search and free educational use, but distinct from the ACM Digital Library proper. It is hard to predict what shape such an area for user-generated content may take, but it carries interesting potential for input from the community."}, {"url": "https://doaj.org/article/b17c585f0fe546e6bb0ad5d101af289b", "page_content": "Abstract\n\nRead online\n\nThe late Don R. Swanson was well appreciated during his lifetime as Dean of the Graduate Library School at University of Chicago, as winner of the American Society for Information Science Award of Merit for 2000, and as author of many seminal articles. In this informal essay, I will give my personal perspective on Don’s contributions to science, and outline some current and future directions in literature-based discovery that are rooted in concepts that he developed.\n\nKeywords"}, {"url": "https://wiki2.org/en/Don_R._Swanson", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nAmerican computer scientist (1924–2012)\n\nDon R. Swanson (October 10, 1924 – November 18, 2012) was an American information scientist, most known for his work in literature-based discovery in the biomedical domain. His particular method has been used as a model for further work, and is often referred to as Swanson linking. He was an investigator in the Arrowsmith System project,[1] which seeks to determine meaningful links between Medline articles to identify previously undiscovered public knowledge. He had been professor emeritus of the University of Chicago since 1996, and remained active in a post-retirement appointment until his health began to decline in 2009.\n\nSwanson received his B.S. in Physics at Caltech, Pasadena, California in 1945, followed by an M.A at Rice Institute, Houston, Texas, two years later, and then a PhD in Theoretical Physics from the University of California at Berkeley in 1952. He worked as a physicist at various laboratories until 1963, when he was made a professor and served as dean of the Graduate School of Library Science at the University of Chicago until 1972 and again from 1977 to 1979 and 1987 to 1989.\n\nIn 2000, he was awarded the ASIST Award of Merit, the highest honor of the society, for his \"lifetime achievements in research and scholarship.\"[2]\n\nYouTube Encyclopedic\n\n1 / 2 Views: 1 538 012 3 565 593\n\nNick Offerman Answers Woodworking Questions From Twitter | Tech Support | WIRED\n\nThe basics on a Speed square Transcription\n\nReferences\n\nWorks\n\n1986a : \"Undiscovered public knowledge.\" Library Quarterly 56(2): 103–118.\n\n: \"Undiscovered public knowledge.\" 56(2): 103–118. 1986b : \"Fish oil, Raynaud's syndrome, and undiscovered public knowledge.\" Perspectives in Biology and Medicine 30(1): 7–18.\n\n: \"Fish oil, Raynaud's syndrome, and undiscovered public knowledge.\" 30(1): 7–18. 1987 : \"Two medical literatures that are logically but not bibliographically connected.\" Journal of the American Society of Information Science 38(4): 228–233.\n\n: \"Two medical literatures that are logically but not bibliographically connected.\" 38(4): 228–233. 1988 : \"Migraine and magnesium: Eleven neglected connections.\" Perspectives in Biology and Medicine 31(4): 526–557.\n\n: \"Migraine and magnesium: Eleven neglected connections.\" 31(4): 526–557. 1989a : \"Online search for logically-related noninteractive medical literature: A systematic trial-and-error strategy.\" Journal of the American Society of Information Science 40: 356–358.\n\n: \"Online search for logically-related noninteractive medical literature: A systematic trial-and-error strategy.\" 40: 356–358. 1989b : \"A second example of mutually-isolated medical literatures related by implicit, unnoticed connections.\" Journal of the American Society of Information Science 40: 432–435.\n\n: \"A second example of mutually-isolated medical literatures related by implicit, unnoticed connections.\" 40: 432–435. 1990a : \"Somatomedin C and arginine: Implicit connections between mutually-isolated literatures,\" Perspectives in Biology and Medicine 33 (1990): 157–186.\n\n: \"Somatomedin C and arginine: Implicit connections between mutually-isolated literatures,\" 33 (1990): 157–186. 1990b : \"Medical literature as a potential source of new knowledge.\" bulletin of the Medical Library Association 78(1) 29–37.\n\n: \"Medical literature as a potential source of new knowledge.\" 78(1) 29–37. 1990c : \"Integrative mechanisms in the growth of knowledge: A legacy of Manfred Kochen.\" Information Processing & Management 26(1): 9–16.\n\n: \"Integrative mechanisms in the growth of knowledge: A legacy of Manfred Kochen.\" 26(1): 9–16. 1990d : \"The absence of co-citation as a clue to undiscovered causal connections.\" In: C. L. Brogman, ed. Scholarly Communication and Bibliometrics . 129–137. Sage Publ., Newbury Park, CA.\n\n: \"The absence of co-citation as a clue to undiscovered causal connections.\" In: C. L. Brogman, ed. . 129–137. Sage Publ., Newbury Park, CA. 1991 : \"Complementary structures in disjoint science literatures.\" In: A. Bookstein, et al., eds., SIGIR91 Proceedings of the Fourteenth Annual International ACM/SIGIR Conference on Research and Development in Information Retrieval . Chicago, Oct. 13–16, 1991. New York: ACM. pp. 280–9. ACM\n\n: \"Complementary structures in disjoint science literatures.\" In: A. Bookstein, et al., eds., . Chicago, Oct. 13–16, 1991. New York: ACM. pp. 280–9. ACM 1993 : \"Intervening in the life cycles of scientific knowledge,\" Library Trends 41(4): 606–631.\n\n: \"Intervening in the life cycles of scientific knowledge,\" 41(4): 606–631. 1996 : \"Undiscovered public knowledge: A ten-year update.\" In: Data Mining: Integration & Application (KDD-96 Proceedings, AAAI) 295–298. (with Neil R. Smalheiser)\n\nhttp://www.aaai.org/Papers/KDD/1996/KDD96-051.pdf\n\n: \"Undiscovered public knowledge: A ten-year update.\" In: (KDD-96 Proceedings, AAAI) 295–298. (with Neil R. Smalheiser) http://www.aaai.org/Papers/KDD/1996/KDD96-051.pdf 1997 : \"An interactive system for finding complementary literatures: a stimulus to scientific discovery,\" Artificial Intelligence , (91)2: 183–203. (with Neil R. Smalheiser) ACM\n\n: \"An interactive system for finding complementary literatures: a stimulus to scientific discovery,\" , (91)2: 183–203. (with Neil R. Smalheiser) ACM 1999 : \"Implicit text linkages between Medline records: Using Arrowsmith as an aid to scientific discovery.\" Library Trends 48(l): 48–59. (with Neil R. Smalheiser)\n\n: \"Implicit text linkages between Medline records: Using Arrowsmith as an aid to scientific discovery.\" 48(l): 48–59. (with Neil R. Smalheiser) 2001 : \"Information discovery from complementary literatures: categorizing viruses as potential weapons.\" Journal of the American Society for Information Science and Technology 52(10): 797–812. (with Neil R. Smalheiser and A. Bookstein) ACM\n\n: \"Information discovery from complementary literatures: categorizing viruses as potential weapons.\" 52(10): 797–812. (with Neil R. Smalheiser and A. Bookstein) ACM 2006: \"Ranking indirect connections in literature-based discovery: The role of medical subject headings.\" Journal of the American Society for Information Science and Technology 57(11):1427–39. (with Neil R. Smalheiser and Vetle I. Torvik) ACM\n\nhttps://web.archive.org/web/20100326164704/http://kiwi.uchicago.edu/JA2434.pdf\n\nNotes"}, {"url": "https://grad.uw.edu/about-the-graduate-school/graduate-school-leadership/", "page_content": "Graduate School Leadership\n\nClose Menu\n\nRead a Q&A with Dean Williamson-Lott on her vision for the Graduate School, her scholarship on higher education, and what she does for fun.\n\nJoy Williamson-Lott\n\nDean of the Graduate School\n\nJoy Williamson-Lott is a professor and previously an associate dean in the College of Education, an accomplished scholar and researcher in the field of American higher education, and a committed advocate for equity and diversity in higher education. She is the author of several books examining black higher educational history and the black freedom struggle, including her most recent book, “Jim Crow Campus: Higher Education and the Struggle for a New Southern Social Order.” Her teaching focuses on education as a moral endeavor, the shifting definition of “proper education” and “liberation” for different social groups, and the educational histories of people of color.\n\nDr. Williamson-Lott was awarded the UW’s Distinguished Teaching Award in 2010 and received the Mildred Garcia Award for Early Career Exemplary Scholarship from the Association for the Study of Higher Education, among numerous awards and recognitions.\n\nMore about Dr. Williamson-Lott\n\n“I am excited to work with colleagues across our three campuses to ensure that our graduate students, professional students and postdoctoral fellows get the most out of their Husky Experience, and that they are well prepared to act as global citizens and leaders who enrich society and use rigorous research to devise solutions to today’s pressing problems,” Williamson-Lott said. Williamson-Lott earned her bachelor’s degree in psychology and speech communications, and her master’s degree and doctorate in the history of American Education from the University of Illinois at Urbana-Champaign. Prior to joining the UW faculty in 2007, she served on the faculty at the Stanford University School of Education. G-1 Communications | Box 353770 | Seattle 98195-3770\n\ngraddean@uw.edu\n\nDavid Canfield-Budde\n\nAssistant Dean for Academic Affairs and Planning\n\nDavid Canfield-Budde provides advocacy and oversight for the Graduate School’s interdisciplinary programs as well as leadership and academic policy development for the Office of Academic Affairs and Planning. Focused on engagement with the interdisciplinary program chairs, directors and staff, he brings a deep understanding of the institution to the table to advise, support, and advocate for interdisciplinary education in the Graduate School. He has served in this capacity since 2015; prior to that, he supported the Associate Dean for Academic Affairs & Planning in academic program review, new graduate program proposals, and graduate academic policies. In his current position, he continues to engage in graduate policy development through close work with the Graduate School Council, and he supervises staff directing the academic program review process.\n\nDr. Canfield-Budde is also Affiliate Assistant Professor in the Department of Germanics. His current academic interest focuses on divided Germany 1945-1989, a topic he explores with undergraduate students as part of a regular summer study abroad course in Berlin, Germany.\n\n315 Loew Hall | Box 352191 | Seattle 98195-2191\n\n206.685.6664\n\ndacan@uw.edu\n\nKima Cargill\n\nAssociate Dean for Academic Affairs and Planning\n\nKima Cargill oversees academic affairs and planning for the Graduate School. In this capacity she chairs the Graduate School Council and works closely with an excellent staff and faculty colleagues on all three campuses to conduct academic program reviews, and work with academic units to develop new graduate degrees and certificates. She is also co-chair of the Graduate School Policy Committee\n\nDr. Cargill is Professor of Psychology in the School of Interdisciplinary Arts & Sciences at the UW Tacoma campus. She joined the UW faculty in 2002 after receiving her bachelor’s degree in Philosophy and Government from the University of Texas at Austin, and her master’s and doctoral degrees in Psychology at the University of Texas at Austin. Her research focuses on food and consumer culture. She is the author of numerous articles and books, including The Psychology of Overeating: Food and the Culture of Consumerism.\n\n305 Loew Hall | Box 352191 | Seattle 98195-2191\n\n206.685.0662\n\nkcargill@uw.edu\n\nRalina Joseph\n\nRead the announcement of Associate Dean Joseph’s appointment.\n\nAssociate Dean for Equity & Justice in Graduate Programs\n\nRalina Joseph is a professor of Communication and adjunct professor of American Ethnic Studies and Gender, Women, and Sexuality Studies.\n\nDr. Joseph is the founding and acting director of the Center for Communication, Difference, and Equity. For the 2019-20 academic year, she was in residence at the Northwest African American Museum as a Mellon/ACLS Scholars & Society Fellow, where she brought her “Interrupting Privilege” course and expanded it for the general public. Her second book, Postracial Resistance: Black Women, Media Culture, and the Uses of Strategic Ambiguity, was the winner of the International Communication Association’s 2019 Outstanding Book of the Year Award.\n\nDr. Joseph was recently profiled in UW Magazine, explaining how the concept of “radical listening” is a way to amplify and learn from often-unheard voices around issues of race and injustice.\n\n313 Loew Hall | Box 353770 | Seattle 98195-2191\n\n206.616.9365\n\nrljoseph@uw.edu\n\nBill Mahoney\n\nAssociate Dean for Student and Postdoctoral Affairs\n\nDr. Bill Mahoney, Ph.D. has a long-standing interest in professional development, focusing on graduate students, postdoctoral fellows, and junior faculty at UW. As Associate Dean, he provides leadership to both the Office of Graduate Student Affairs and the Office of Postdoctoral Affairs to support inclusive learning environments across the UW educational ecosystem. He leads efforts related to graduate student and postdoctoral fellow recruitment and support, holistic mentorship, and career exploration and guidance.\n\nDr. Mahoney is an Associate Professor of Pathology in the School of Medicine. He came to UW as a postdoctoral fellow in 2004 and has followed the academic tract to Associate Professor in the Department of Pathology. After establishing his independent lab in cardiovascular development & regeneration, Dr. Mahoney transitioned to focusing on mentoring graduate students by co-directing the interdepartmental Molecular Medicine and Mechanisms of Disease (M3D) Ph.D. program. This led to a more holistic attention to professional development towards careers in STEM by working with URM pipeline programs and by co-directing the Office of Postdoctoral Affairs (OPA) in the UW Graduate School.\n\n302 Loew Hall | Box 353770 | Seattle 98195-2191\n\n206.616.7116\n\nwmahoney@uw.edu"}, {"url": "https://static.hlt.bme.hu/semantics/external/pages/inform%C3%A1ci%C3%B3-visszakeres%C3%A9s/en.wikipedia.org/wiki/Don_Swanson.html", "page_content": "Don R. Swanson (October 10, 1924 – November 18, 2012) was an American information scientist, most known for his work in literature-based discovery in the biomedical domain. His particular method has been used as a model for further work, and is often referred to as Swanson linking. He was an investigator in the Arrowsmith System project,[1] which seeks to determine meaningful links between Medline articles to identify previously undiscovered public knowledge. He had been professor emeritus of the University of Chicago since 1996, and remained active in a post-retirement appointment until his health began to decline in 2009.\n\nSwanson received his B.S. in Physics at Caltech, Pasadena, California in 1945, followed by an M.A at Rice Institute, Houston, Texas, two years later, and then a PhD in Theoretical Physics from the University of California at Berkeley in 1952. He worked as a physicist at various laboratories until 1963, when he was made a professor and served as dean of the Graduate School of Library Science at the University of Chicago until 1972 and again from 1977–79 and 1987-89.\n\nIn 2000, he was awarded the ASIST Award of Merit, the highest honor of the society, for his \"lifetime achievements in research and scholarship.\" [2]\n\nReferences [ edit ]\n\nWorks\n\n1986a : \"Undiscovered public knowledge.\" Library Quarterly 56(2): 103-118.\n\n: \"Undiscovered public knowledge.\" 56(2): 103-118. 1986b : \"Fish oil, Raynaud's syndrome, and undiscovered public knowledge.\" Perspectives in Biology and Medicine 30(1): 7-18.\n\n: \"Fish oil, Raynaud's syndrome, and undiscovered public knowledge.\" 30(1): 7-18. 1987 : \"Two medical literatures that are logically but not bibliographically connected.\" Journal of the American Society of Information Science 38(4): 228-233.\n\n: \"Two medical literatures that are logically but not bibliographically connected.\" 38(4): 228-233. 1988 : \"Migraine and magnesium: Eleven neglected connections.\" Perspectives in Biology and Medicine 31(4): 526-557.\n\n: \"Migraine and magnesium: Eleven neglected connections.\" 31(4): 526-557. 1989a : \"Online search for logically-related noninteractive medical literature: A systematic trial-and-error strategy.\" Journal of the American Society of Information Science 40: 356-358.\n\n: \"Online search for logically-related noninteractive medical literature: A systematic trial-and-error strategy.\" 40: 356-358. 1989b : \"A second example of mutually-isolated medical literatures related by implicit, unnoticed connections.\" Journal of the American Society of Information Science 40: 432-435.\n\n: \"A second example of mutually-isolated medical literatures related by implicit, unnoticed connections.\" 40: 432-435. 1990a : \"Somatomedin C and arginine: Implicit connections between mutually-isolated literatures,\" Perspectives in Biology and Medicine 33 (1990): 157-186.\n\n: \"Somatomedin C and arginine: Implicit connections between mutually-isolated literatures,\" 33 (1990): 157-186. 1990b : \"Medical literature as a potential source of new knowledge.\" bulletin of the Medical Library Association 78(1) 29-37.\n\n: \"Medical literature as a potential source of new knowledge.\" 78(1) 29-37. 1990c : \"Integrative mechanisms in the growth of knowledge: A legacy of Manfred Kochen.\" Information Processing & Management 26(1): 9-16.\n\n: \"Integrative mechanisms in the growth of knowledge: A legacy of Manfred Kochen.\" 26(1): 9-16. 1990d : \"The absence of co-citation as a clue to undiscovered causal connections.\" In: C. L. Brogman, ed. Scholarly Communication and Bibliometrics . 129-137. Sage Publ., Newbury Park, CA.\n\n: \"The absence of co-citation as a clue to undiscovered causal connections.\" In: C. L. Brogman, ed. . 129-137. Sage Publ., Newbury Park, CA. 1991 : \"Complementary structures in disjoint science literatures.\" In: A. Bookstein, et al., eds., SIGIR91 Proceedings of the Fourteenth Annual International ACM/SIGIR Conference on Research and Development in Information Retrieval . Chicago, Oct. 13-16, 1991. New York: ACM. pp. 280–9. ACM\n\n: \"Complementary structures in disjoint science literatures.\" In: A. Bookstein, et al., eds., . Chicago, Oct. 13-16, 1991. New York: ACM. pp. 280–9. ACM 1993 : \"Intervening in the life cycles of scientific knowledge,\" Library Trends 41(4): 606-631.\n\n: \"Intervening in the life cycles of scientific knowledge,\" 41(4): 606-631. 1996 : \"Undiscovered public knowledge: A ten-year update.\" In: Data Mining: Integration & Application (KDD-96 Proceedings, AAAI) 295-298. (with Neil R. Smalheiser)\n\nhttp://www.aaai.org/Papers/KDD/1996/KDD96-051.pdf\n\n: \"Undiscovered public knowledge: A ten-year update.\" In: (KDD-96 Proceedings, AAAI) 295-298. (with Neil R. Smalheiser) http://www.aaai.org/Papers/KDD/1996/KDD96-051.pdf 1997 : \"An interactive system for finding complementary literatures: a stimulus to scientific discovery,\" Artificial Intelligence , (91)2: 183-203. (with Neil R. Smalheiser) ACM\n\n: \"An interactive system for finding complementary literatures: a stimulus to scientific discovery,\" , (91)2: 183-203. (with Neil R. Smalheiser) ACM 1999 : \"Implicit text linkages between Medline records: Using Arrowsmith as an aid to scientific discovery.\" Library Trends 48(l): 48-59. (with Neil R. Smalheiser)\n\n: \"Implicit text linkages between Medline records: Using Arrowsmith as an aid to scientific discovery.\" 48(l): 48-59. (with Neil R. Smalheiser) 2001 : \"Information discovery from complementary literatures: categorizing viruses as potential weapons.\" Journal of the American Society for Information Science and Technology 52(10): 797-812. (with Neil R. Smalheiser and A. Bookstein) ACM\n\n: \"Information discovery from complementary literatures: categorizing viruses as potential weapons.\" 52(10): 797-812. (with Neil R. Smalheiser and A. Bookstein) ACM 2006: \"Ranking indirect connections in literature-based discovery: The role of medical subject headings.\" Journal of the American Society for Information Science and Technology 57(11):1427-39. (with Neil R. Smalheiser and Vetle I. Torvik) ACM\n\nhttps://web.archive.org/web/20100326164704/http://kiwi.uchicago.edu/JA2434.pdf"}, {"url": "https://blogs.scientificamerican.com/guest-blog/data-visualization-how-data-and-its-graphic-translation-might-help-humans-to-trudge-the-digital-road-to-new-scientific-discovery/", "page_content": "Robert Simpson, A Post-Doctoral Researcher at the University of Oxford, commutes to work using the buses provided by the school. Imagining commuters on the bus, one might envision a collection of individuals reading the paper, drinking coffee, writing in planners, or simply chatting up the person next to them. Recently, Simpson has been using his commute to chart out word occurrences to a matrix visualization from astronomy journals on his laptop. Some people bus to the beat of a different drum.\n\nHe is creating the matrices according to the nature of work that Don R. Swanson did at the University of Chicago in the late 80's. Swanson, an Information Scientist, discovered connections between Raynaud's Disease and Fish Oil through something called Literature Based Discovery. The literature all came from MEDLINE. Raynaud's causes numbness in the extremities (fingers, toes, etc.) of the body because of blood vessel narrowing. Thanks to Swanson, Fish oil was found to be of relief to Raynaud's patients where previously the relationship had gone unnoticed. No one had ever combined the literatures from MEDLINE that stated the benefits of Fish Oil as far as blood vessel narrowing in connection with Raynaud's. Put another way, if there are many papers that mention the term Raynaud's aligned with certain features and terms of the disease, and there are many papers that name those same features and terms in relation to Fish Oil, chances are better that Raynaud's and Fish Oil might have an interesting relationship.\n\n“In the present article I demonstrate something similar for the pair of literatures on migraine and magnesium (another discovery by Swanson). The goal of this work is not simply to find unnoticed connections but to develop a systematic approach to the process of hunting for them.” Swanson states in an article he published on the subject. “As in the preceding case, one begins with a disease for which neither cause nor cure is known. The problem is to find, within the literature, indirect evidence that an unknown cure might already exist. The literatures on fish oil and magnesium, respectively, were not fortuitous choices; they were the survivors of a process of elimination.”\n\nRobert Simpson is taking Swanson's process a step further and putting Literature Based Discovery into a visual computer matrix that plots out the relationship between terms in Astronomy journals, mostly from the abstracts available online. Below is one such Matrix, it is from Simpson's blog, Orbiting Frog:\n\nWhen asked where this idea had come from, the mild-mannered Simpson had this to say,\n\n“I run a conference series called .Astronomy where we have a hack day with the geek elite of astronomy. My pal, local conference organizer, Sarah Kendrew, suggested we try to create a hypothesis generator for astronomy - based on the BrainSCANr project from neuroscience. Although we hacked on it a bit on that day, I became far more interested afterward. I found myself playing about with a big database of terms and papers and just having fun. I realized that doing hypothesis generation with the data would require a decent bit of visualization of correlations between pairs of words. You'd need to start with looking at what pairs appear together and then move on to pairs that both correlate with a third word (I haven't done this yet). The word matrices are a great way to instantly see the patterns, and d3.js (software) - which was suggested by our visualization experts Noah Iliinsky and Julie Steele at .Astronomy - includes lots of examples with matrices.”\n\nBrilliant! Building a hypothesis generator sounds like a sea change that could open up doors in science that no one has even considered. Imagine all of the possibilities! Imagine isolating many papers based on a subject and having all of the relationships that have never been recognized between them staring back at you in a handy matrix. What an amazing idea! But, what are the drawbacks? Well, the structuring of the Data itself.\n\nEnter the wizards of Computer Science and Visual Analytics.\n\nJeffrey Heer is an Assistant Professor at The Computer Science Department of Stanford University, he said this about visualizing text groups,\n\n“Text is among our most abundant types of data. However, text is difficult to visualize directly. How does one \"plot\" a sentence or set of words other than to print them? In practice, text visualization requires both modeling (creating statistical models of the content of text collections) and then visualizing the structure and content of those models.”\n\nHeer has been involved with some amazing work that has resulted in success and successful failure. At Stanford, Heer's group found significant flaws in the way that textually derived data was modeled when the visualization of a group of data they were working with was analyzed.\n\n“Probably the most relevant work from our group is on visualizing the shifting similarities among academic dicsiplines over time, based on an analysis of the text of PHD dissertations. We were visualizing the results of a chain of models, including text modeling and dimensionality reduction. These models can sometimes give rise to misleading results, which we then spotted in the visualization. This result led us to consider how visualizations must do more than just turn data into images -- it is vital that visualizations support interactive exploration and verification, so that one can not only uncover new hypotheses but begin the process of assessing their credibility. Another result of this work is that the insights gained from the visualizations enabled us to design better machine learning methods, such that our mathematical models of textual similarity better matched the judgments of human experts.”\n\n“Statistics alone are dangerous and they hide a lot.” Says Ben Shneiderman, a professor of computer science and a founding director of the Human-Computer Interaction Lab at University Of Maryland. Shneiderman created the widely used “Treemaps” a compact visual display of tree structures that work by “...splitting the screen into rectangles in alternating horizontal and vertical directions as you traverse down the levels.” His work also contributed to the commercial success of Spotfire, a popular visual data analysis company.\n\nShneiderman was profiled in Scientific American by Tim Beardsley in the March 1999 issue about his opposition to anthropomorphizing the interactive qualities of computer programs. “The purpose of computing is insight, not numbers, Shneiderman likes to reiterate, and likewise the purpose of visualization is insight, not pictures. What people want in their interactions with computers, he argues, is a feeling of mastery. That comes from interfaces that are controllable, consistent and predictable.”\n\nContextualizing, and/or structuring, the data before it is put into a helpful display, seems to be where humans need to have more involvement. If you showed someone who you just met a new gold ring you had acquired, one complete with a nice clear stone attached and automatically expected tears and acclaim from that person, it would seem odd. But if you had instead first told them it was because the person of your dreams had just proposed to you and that they had a house in Bermuda, the visual of the ring would provide useful in attaining squeals, tears, and hugs from your new friend. It is the same with visual analytics, if there is no structure for the information, it goes out without a context and ultimately might lead to a misunderstanding or misrepresentation: Why are you showing me your jewelry, are you bragging or being vain?\n\nThis goes right along with any conversation about how to figure out efficient ways to structure data so that the visual analytics will work properly in displaying the relationships of the data.\n\nShneiderman added the example below of an error that he saw in the data structure from a client that came to his lab. He also highlights using the visualizations as an error finding program:\n\n“I was working with a group that was analyzing emergency room admissions. They had 6400 admissions one month and they were looking at the age of the men and the women, those who were admitted and those who were discharged, etc. They were happily running their statistics and coming up with numbers and statistically significant differences, etc. In 10 minutes, once I put the data through some of the tools we have, there turned out to be 8 patients who were 999 years old! They had no idea! So that throws things off terribly. A lot of people in the statistics or data mining world don't take a look at the data to be able to detect these things.”\n\nRecently, Shneiderman and Heer co-authored a paper on the importance of control panels to help users (scientists, teachers, students, etc) to navigate through a visual display. The paper goes through different methods of displaying legends, navigation boxes, or widgets, etc., to help users navigate to what they want.\n\n“Overview first, zoom and filter, then details-on-demand” Shneiderman has famously stated about how to display and work through a graph. It is a commentary on what to do with a sound visualization, it lays out a clear path for looking at the data once we can find out out an efficient way to structure the data.\n\nSo, if the data could be properly structured and fed into compelling, but strict, visualizations, we could have this amazingly useful tool that gives scientific insight at a glance (what Simpson was shooting for), new hypotheses in science purely from emergency room admissions programs, or medical journals, or even grocery store cash registers. Is Robert Simpson's matrix intriguing because the data is already structured from scholarly articles? It seems that way because he is using a system put together by a successful innovator. Don R. Swanson, someone without a medical degree, furthered Medical Science purely because he compared contextualized data in a different and efficient way. This was without a colorful visualization. Visualizations have been promoted in science long before Simpson, by people like the inventor of the term 'software', Princeton statistician John Tukey. But, there are still many complications with the process as compiled above. Why are Simpson's efforts important?\n\nSimpson is the smart “kid” with a question here: What is a simple way that I can display data, with contemporary resources, that can streamline and augment the scientific process? Heer serves as a realist, telling us how complicated these efforts might become. Shneiderman serves as a philosopher and craftsman, figuring out a human's role in the act of transitioning data to the screen and then offering responsible ways to do it.\n\nAll in all, we start with a basic question: How do scientists use a computer's ability to attain and process massive amounts of data to provide them with hypotheses that they might never be able to notice with their brains? The answer might well be at the core of Computer Science and Visual Analytics, but it is a dangerous concept that needs some healthy parenting so as not to evolve into a faulty idea generator that will ultimately bring scientists back to square one, with heaps of useless data.\n\nOne last question I had was for Stanford's Jeffrey Heer in reference to his analysis of PhD Dissertations that is linked above:\n\nQ: “Do you ever think, once (in the future) the kinks are worked out with data visualizations and someone can maybe easily rule out spurious results, this process will be available to the general public as a community effort towards Science? (ie: maybe a site where people can go and insert their own data sets to generate testable hypothesis)”\n\nA: “First let me clarify something just to be safe... the data visualizations in my earlier anecdote were not responsible for the spurious results. Instead, the underlying models were the culprit and the visualization played a valuable role in helping reveal the problematic data. This issue is unlikely to evaporate -- a single data set can often be analyzed using a variety of algorithms or models, some of which may not be appropriate (the model may make assumptions about the data that are not true). Visualization can play a useful role in helping us understand our data prior to modeling (to help generate hypotheses and assess if modeling assumptions hold) and understanding the results of our models (as in my earlier anecdote).\n\nNow on to your question -- there have already been a number of efforts to enable the type of \"citizen science\" you describe. Even prior to the internet, \"amateurs\" played an important role in astronomy (by observing new stars, etc). Also, websites like IBM's Many Eyes or Google's Fusion Tables allow people to upload data sets, visualize them, and share them. While I haven't seen such a public site dedicated to generating testable hypotheses, you might be interested in this recent work we did using paid crowd workers to help generate explanatory hypotheses for public-interest data sets.\n\nHowever, the more common practice is to engage \"citizen scientists\" in data collection efforts, while the \"professional scientists\" then analyze that data. Of course, it is important to provide transparency in this process and recognize where lay people can contribute valuable insights. Here's one example of putting this idea into practice by engaging with a community to monitor local air quality.”\n\nOne thing about these wizards of Visual Analytics, they are thorough."}]}