{"Roy Beggs Jr. is a member of the Orange Order.": [{"url": "https://www.wikiwand.com/en/Roy_Beggs", "page_content": "John Robert Beggs (born 20 February 1936), commonly known as Roy Beggs, is an Ulster Unionist Party (UUP) politician.\n\nNorthern Irish UUP politician\n\nQuick facts: Roy Beggs, Member of Parliament for East Antr... ▼\n\nBeggs was educated at Ballyclare High School, followed by Stranmillis College, to study teacher training.[1] After his training Beggs became a teacher at Larne High School and had risen to be deputy principal before leaving the profession upon his election to the Westminster Parliament.[1]\n\nHe first entered politics in 1973 as a councillor for Larne Borough Council.[1] for the Democratic Unionist Party.[2] He was suspended from the party in 1981 after taking part in a council visit to Dún Laoghaire–Rathdown County Council local authority in the South.[3] he moved to the Ulster Unionist Party and was re-elected in 1981 as a 'loyalist'.[2] He joined the UUP in 1982 and has retained his council seat to date, serving several terms as Mayor of Larne from 1978 until 1983.[4] In 1982 he was elected to the Northern Ireland Assembly representing North Antrim.[1]\n\nIn 1983 he was selected for the new East Antrim in the 1983 general election.[4] With most expecting the DUP to win the seat,[5] he became the new MP in the surprise result. He held the position until the 2005 general election when he was defeated by Sammy Wilson of the DUP.[6] He was UUP Education Spokesman from 1986 up to and including his last few years in Parliament when he also served as Deputy Leader and Chief Whip of the Ulster Unionist Parliamentary Party.[1]\n\nBeggs was known as one of the more hard-line members of the UUP, being vociferous in his Euroscepticism and his suspicions about the Belfast Agreement - initially involving himself in Union First (a group within the Ulster Unionist Party opposed to the Agreement), although in his final two years in Parliament he appeared publicly supportive of the Agreement and of leader David Trimble. A renowned opponent of \"progressive\" teaching methods and a supporter of maintaining Northern Ireland's grammar schools, he attacked proposals to abolish academic selection in post-primary education in Northern Ireland.\n\nBeggs was also a strong supporter of the Orange Order during their stand-off over Drumcree Church and in 1995 took part in a blockade of the port of Larne as part of a show of solidarity. Beggs was charged with Public Order offences for his involvement and was fined £1,350. In March 2001, he apologised in the House of Commons for failing to register a local business interest.[3]\n\nHe lives in Larne and operates a farm and owns a landfill site. He is also the Chairman of the North Eastern Education and Library Board, as well as continuing his council work. He has four children. His son, Roy Beggs Jr was a member of the Northern Ireland Assembly from 1998 until losing his seat in the 2022 Northern Ireland Assembly election.[7]"}, {"url": "https://www.biographies.net/biography/roy-beggs%2C-jr./m/02yr8j", "page_content": "Who is Roy Beggs, Jr.?\n\nRoy Beggs, Jr., MLA is a Northern Ireland Unionist politician, and the son of the politician Roy Beggs. He was born in Glenoe, where he still resides. He is also a Presbyterian.\n\nHe is currently an Ulster Unionist member of the Northern Ireland Assembly for East Antrim, which his father formerly represented in the Westminster Parliament. He served as a local councillor on Carrickfergus Borough Council from 2001 to 2011. During this period he had been elected as Chairman of the District Policing Partnership and Vice-chairman of the Local Strategic Partnership and of the Community Safety Partnership.\n\nIn 2011 Roy Beggs was elected as a Deputy Speaker of the Northern Ireland Assembly. He serves as a member of the Assembly’s Health Committee and on the Assembly and Executive Review Committee. He has served as a member of the Finance Committee, Deputy Chairman of the Agriculture Committee, and as Deputy Chairman of the Public Accounts Committee at Stormont.\n\nBeggs is known for his tireless constituency work amongst the Protestants in East Antrim and has links with many organisations in the area. He is the Ulster Unionist Party spokesperson on Health, Social Services and Public Safety."}, {"url": "https://acearchive.org/roy-beggs-jr", "page_content": "Roy Beggs Jr, born on 3rd July 1962, is a member of the Ulster Unionist Party (UUP) and a former Member of the Northern Ireland Assembly (MLA) for East Antrim. His father, Roy Beggs, was also a politician, having served as the UUP Member of Parliament (MP) for East Antrim from 1983 to 2005. Beggs Jr served as a local councillor on Carrickfergus Borough Council from 2001 to 2011, during which time he held various positions of responsibility, including Chairman of the District Policing Partnership and Vice-Chairman of the Local Strategic Partnership and of the Community Safety Partnership.\n\nIn 2011, Beggs was elected as Deputy Speaker of the Northern Ireland Assembly, a role he held until 2016. During his time in the Assembly, he served as a member of various committees, including the Social Development Committee, Public Accounts Committee, Health Committee, Environment Committee, Finance Committee, and Agriculture Committee. He is also the UUP spokesperson on Social Development.\n\nBeggs is known for his actions in 2003, when he successfully lobbied Aer Lingus to remove Irish rebel music from their in-flight entertainment. Beggs had complained of the \"blatant promotion of militant, armed republicanism\" on a music channel during a flight from Dublin to Boston. He likened the situation to \"the speeches of Osama Bin Laden being played on a trans-Atlantic Arabian airline.\" Aer Lingus removed the material from their flights immediately, stating that it should never have been on board in the first place.\n\nThroughout his career, Beggs has been known for his commitment to public safety and community development. He has been a strong advocate for increasing funding for mental health services, improving road safety, and promoting economic development in Northern Ireland. He has also been a vocal opponent of political violence and sectarianism, and has worked tirelessly to build bridges between different communities in the region.\n\nOverall, Roy Beggs Jr is a well-respected politician with a long track record of public service. His dedication to the people of East Antrim and Northern Ireland as a whole has earned him the admiration of his constituents and colleagues alike. As he moves on from his role as an MLA, his legacy will continue to be felt throughout the region for many years to come.\n\nElection results\n\nRoy Beggs Jr, a seasoned politician and long-standing member of the Northern Ireland Assembly, suffered a shock defeat in the 2022 election at the hands of the Alliance Party of Northern Ireland. This brought to an end his uninterrupted run of electoral successes since 1998.\n\nBeggs Jr had been a force to be reckoned with in the political landscape, having won the popular vote in two separate elections, and had been a key player in the Unionist cause for decades. However, his failure to secure re-election in 2022 has left many wondering where it all went wrong.\n\nDespite starting strong with a 16.1% share of the vote in 1998, Beggs Jr's popularity dwindled over time, with just 10.2% of the vote in 2007. While he had always been a prominent figure in Unionist politics, it seems that his appeal may have waned in recent years.\n\nThe Northern Ireland Assembly is a notoriously volatile arena, with the political landscape shifting rapidly over time. Beggs Jr may have fallen foul of this instability, finding himself out of step with the changing attitudes of the electorate.\n\nOr perhaps it was simply a case of the Alliance Party capitalizing on a moment of weakness, seizing the opportunity to make their mark on the political landscape. Whatever the case, Beggs Jr's defeat is a timely reminder that no one can take electoral success for granted.\n\nIn the cutthroat world of politics, it's important to remain vigilant and adaptable, constantly reassessing one's position and staying on top of the latest trends and developments. Beggs Jr's defeat may be a bitter pill to swallow, but it serves as a valuable lesson for politicians everywhere.\n\nAs for the Alliance Party, they can take heart in their triumph, but they must not rest on their laurels. The political landscape is ever-changing, and they will need to remain vigilant if they hope to maintain their newfound dominance. One thing is certain, the Northern Ireland Assembly will remain a hotly contested arena for many years to come."}, {"url": "https://www.irishnews.com/news/northernirelandnews/2022/05/06/news/assembly-stalwarts-roy-beggs-and-peter-weir-lose-seats-2663430/", "page_content": "The UUP Roy Beggs lost his seat in East Antrim\n\nFor the first time since East Antrim was created as a constituency in 1983, there will nobody from the Beggs family representing the area at either Stormont or Westminster.\n\nUlster Unionist Roy Beggs Jr, a former Stormont deputy speaker and party stalwart, was eliminated early in the voting process for the constituency, which covers the coastal towns of Carrickfergus and Larne.\n\nMr Beggs had been his party's longest serving MLA, having held the seat since 1998.\n\nThe Beggs association with the area is longstanding, with Roy Beggs Sr having been the first MP when electoral boundaries were redrawn to form the constituency area in the early 1980s.\n\nMr Beggs polled only 3,549 first preference votes, well behind the 6,195 for his party colleague John Stewart.\n\nMr Beggs was eliminated on the second count and left the count centre at Ulster University in Jordanstown early.\n\nHis fortunes mirrored those of his party, which has suffered a disappointing election, gaining just over 11% of first preference votes.\n\nHe was not the only high-profile candidate to fall, with former education minister Peter Weir being eliminated in Strangford.\n\nMr Weir had been an MLA since 1998 when the Assembly was first created following the Good Friday Agreement.\n\nThe DUP previously held three seats in the constituency and was always likely to struggle to hold them all, with Mr Weir the casualty.\n\nWith counting continuing late on Friday, the possibility remained that other high-profile politicians could potentially lose their seats, with UUP leader Doug Beattie in Upper Bann, SDLP deputy leader Nichola Mallon in north Belfast and Green Party NI leader Clare Bailey all under pressure."}, {"url": "https://wiki2.org/en/Roy_Beggs_Jr", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nThis article is about the junior Roy Beggs Jr. For his father Roy Beggs, see Roy Beggs\n\nRoy Beggs Jr (born 3 July 1962) is an Ulster Unionist Party (UUP) politician, who was a Member of the Northern Ireland Assembly (MLA) for East Antrim from 1998 until March 2022. Beggs is the son of the politician Roy Beggs, who was the UUP Member of Parliament (MP) for East Antrim from 1983 to 2005.[1]\n\nHe served as a local councillor on Carrickfergus Borough Council from 2001 to 2011. During this period he had been elected as Chairman of the District Policing Partnership and vice-chairman of the Local Strategic Partnership and of the Community Safety Partnership.[2]\n\nIn 2011 Beggs was elected as a Deputy Speaker of the Northern Ireland Assembly. He served as a member of the Assembly's Social Development Committee, Public Accounts Committee, Health Committee, Environment Committee, Finance Committee, Deputy Chairman of the Agriculture Committee and Regional Development Committee. He is the Ulster Unionist Party spokesperson on Social Development.\n\nIn 2003, Beggs succeeded in having Irish rebel music removed from the in-flight entertainment of Aer Lingus airplanes. He complained of the \"blatant promotion of militant, armed republicanism\" on a music channel during a flight from Dublin to Boston after seeing that Derek Warfield had a radio channel dedicated to his music. Beggs, it was the same as \"the speeches of Osama Bin Laden being played on a trans-Atlantic Arabian airline.\"[3]\n\nAer Lingus removed the material from their flights stating: \"It is something that should not have been on board and we removed it immediately we became aware of it.\"[4]\n\nHe lost his seat in the 2022 Northern Ireland Assembly election.[5]\n\nYouTube Encyclopedic\n\n1 / 1 Views: 4 441\n\nDivision I Winter 2020 Virtual Commencement Transcription\n\nElection results\n\nRoy Beggs MLA - Carrickfergus constituency office\n\nBeggs Jr had successfully contested every election to the Northern Ireland Assembly from 1998 until he lost his seat to the Alliance Party in 2022. In 1998 Beggs Jr polled 16.1% of the popular vote; 16.7% in 2003; and 10.2% in 2007. Beggs Jr topped the poll in 1998 and 2003 and the UUP returned two candidates.[6]\n\nReferences"}, {"url": "https://peoplepill.com/people/roy-beggs-jr/", "page_content": "Roy Beggs Jr MLA (born 3 July 1962) is a Northern Ireland Unionist politician, and the son of the politician Roy Beggs. He was born in Larne, and lives in Glenoe. He is also a Presbyterian.\n\nHe is currently an Ulster Unionist member of the Northern Ireland Assembly for East Antrim, which his father formerly represented in the Westminster Parliament. He served as a local councillor on Carrickfergus Borough Council from 2001 to 2011. During this period he had been elected as Chairman of the District Policing Partnership and Vice-chairman of the Local Strategic Partnership and of the Community Safety Partnership.\n\nIn 2011 Beggs was elected as a Deputy Speaker of the Northern Ireland Assembly. He serves as a member of the Assembly’s Social Development Committee and the Public Accounts Committee. He has served as a member of the Health Committee, Environment Committee, Finance Committee, Deputy Chairman of the Agriculture Committee and Regional Development Committee. He is the Ulster Unionist Party spokesperson on Social Development.\n\nIn 2003, Beggs succeeded in having Irish rebel music removed from the in-flight entertainment of Aer Lingus airplanes. He complained of the \"blatant promotion of opposing points of view\" on a music channel during a flight from Dublin to Boston after seeing that Derek Warfield had a radio channel dedicated to his music. Beggs, it was the same as \"the speeches of Osama Bin Laden being played on a trans-Atlantic Arabian airline.\"\n\nAer Lingus removed the material from their flights stating: \"It is something that should not have been on board and we removed it immediately we became aware of it.\"\n\nElection results\n\nBeggs Jr has successfully contested every election for the Northern Ireland Assembly since 1998. In 1998 Beggs Jr polled 16.1% of the popular vote; 16.7% in 2003; and 10.2% in 2007. Beggs Jr topped the poll in 1998 and 2003 and the UUP returned two candidates."}, {"url": "https://alchetron.com/Roy-Beggs,-Jr", "page_content": "Roy Beggs Jr MLA (born 3 July 1962) is a Northern Ireland Unionist politician, and the son of the politician Roy Beggs. He was born in Larne, and lives in Glenoe. He is also a Presbyterian.\n\nHe is currently an Ulster Unionist member of the Northern Ireland Assembly for East Antrim, which his father formerly represented in the Westminster Parliament. He served as a local councillor on Carrickfergus Borough Council from 2001 to 2011. During this period he had been elected as Chairman of the District Policing Partnership and Vice-chairman of the Local Strategic Partnership and of the Community Safety Partnership.\n\nIn 2011 Beggs was elected as a Deputy Speaker of the Northern Ireland Assembly. He serves as a member of the Assembly’s Social Development Committee and the Public Accounts Committee. He has served as a member of the Health Committee, Environment Committee, Finance Committee, Deputy Chairman of the Agriculture Committee and Regional Development Committee. He is the Ulster Unionist Party spokesperson on Social Development.\n\nIn 2003, Beggs succeeded in having Irish rebel music removed from the in-flight entertainment of Aer Lingus airplanes. He complained of the \"blatant promotion of opposing points of view\" on a music channel during a flight from Dublin to Boston after seeing that Derek Warfield had a radio channel dedicated to his music. Beggs, it was the same as \"the speeches of Osama Bin Laden being played on a trans-Atlantic Arabian airline.\"\n\nAer Lingus removed the material from their flights stating: \"It is something that should not have been on board and we removed it immediately we became aware of it.\""}, {"url": "https://peoplepill.com/people/roy-beggs/", "page_content": "John Robert Beggs (born 20 February 1936), commonly known as Roy Beggs, is a Northern Ireland politician.\n\nBeggs was educated at Ballyclare High School, followed by Stranmillis College, to study teacher training. After his training Beggs became a teacher at Larne High School and had risen to be deputy principal before leaving the profession upon his election to the Westminster Parliament.\n\nHe first entered politics in 1973 as a councillor for Larne Borough Council. for the Democratic Unionist Party. He was suspended from the party in 1981 after taking part in a council visit to Dún Laoghaire-Rathdown County Council local authority in the South. he moved to the Ulster Unionist Party and was re-elected in 1981 as a 'loyalist'. He joined the UUP in 1982 and has retained his council seat to date, serving several terms as Mayor of Larne from 1978 until 1983. In 1982 he was elected to the Northern Ireland Assembly representing North Antrim.\n\nIn 1983 he was selected for the new East Antrim in the 1983 general election. With most expecting the DUP to win the seat, he became the new MP in the surprise result. He held the position until the 2005 general election when he was defeated by Sammy Wilson of the DUP. He was UUP Education Spokesman from 1986 up to and including his last few years in Parliament when he also served as Deputy Leader and Chief Whip of the Ulster Unionist Parliamentary Party.\n\nBeggs was known as one of the more hard-line members of the UUP, being vociferous in his Euroscepticism and his suspicions about the Belfast Agreement - initially involving himself in Union First (a group within the Ulster Unionist Party opposed to the Agreement), although in his final two years in Parliament he appeared publicly supportive of the Agreement and of leader David Trimble. A renowned opponent of \"progressive\" teaching methods and supporter of corporal punishment in schools he was closely associated with the pro-3Rs Campaign for Real Education and the Freedom Association, as well as his support for the History Curriculum Association's unsuccessful attempts to secure the inclusion of key events, personalities and developments of British History into the school history curriculum and have pupils assessed on their ability to acquire facts and knowledge rather than empathise from a range of psychological perspectives. A strong supporter of maintaining Northern Ireland's grammar schools, he attacked proposals to abolish academic selection in post-primary education in Northern Ireland, whilst also opposing the introduction of tuition fees for university students claiming that the latter discouraged many from entering higher education.\n\nBeggs was also a strong supporter of the Orange Order during their stand-off over Drumcree Church and in 1995 took part in a blockade of the port of Larne as part of a show of solidarity. Beggs was charged with Public Order offences for his involvement and was fined £1,350. In March 2001, he apologised in the House of Commons for failing to register a local business interest.\n\nHe lives in Larne and operates a farm and owns a landfill site. He is also the Chairman of the North Eastern Education and Library Board, as well as continuing his council work. He has four children. His son, Roy Jr. is a member of the Northern Ireland Assembly."}, {"url": "https://wiki2.org/en/Roy_Beggs", "page_content": "This article is about the Northern Ireland politician. For his son, also a politician, see Roy Beggs Jr.\n\nJohn Robert Beggs (born 20 February 1936), commonly known as Roy Beggs, is an Ulster Unionist Party (UUP) politician.\n\nBeggs was educated at Ballyclare High School, followed by Stranmillis College, to study teacher training.[1] After his training Beggs became a teacher at Larne High School and had risen to be deputy principal before leaving the profession upon his election to the Westminster Parliament.[1]\n\nHe first entered politics in 1973 as a councillor for Larne Borough Council.[1] for the Democratic Unionist Party.[2] He was suspended from the party in 1981 after taking part in a council visit to Dún Laoghaire–Rathdown County Council local authority in the South.[3] he moved to the Ulster Unionist Party and was re-elected in 1981 as a 'loyalist'.[2] He joined the UUP in 1982 and has retained his council seat to date, serving several terms as Mayor of Larne from 1978 until 1983.[4] In 1982 he was elected to the Northern Ireland Assembly representing North Antrim.[1]\n\nIn 1983 he was selected for the new East Antrim in the 1983 general election.[4] With most expecting the DUP to win the seat,[5] he became the new MP in the surprise result. He held the position until the 2005 general election when he was defeated by Sammy Wilson of the DUP.[6] He was UUP Education Spokesman from 1986 up to and including his last few years in Parliament when he also served as Deputy Leader and Chief Whip of the Ulster Unionist Parliamentary Party.[1]\n\nBeggs was known as one of the more hard-line members of the UUP, being vociferous in his Euroscepticism and his suspicions about the Belfast Agreement - initially involving himself in Union First (a group within the Ulster Unionist Party opposed to the Agreement), although in his final two years in Parliament he appeared publicly supportive of the Agreement and of leader David Trimble. A renowned opponent of \"progressive\" teaching methods and a supporter of maintaining Northern Ireland's grammar schools, he attacked proposals to abolish academic selection in post-primary education in Northern Ireland.\n\nBeggs was also a strong supporter of the Orange Order during their stand-off over Drumcree Church and in 1995 took part in a blockade of the port of Larne as part of a show of solidarity. Beggs was charged with Public Order offences for his involvement and was fined £1,350. In March 2001, he apologised in the House of Commons for failing to register a local business interest.[3]\n\nHe lives in Larne and operates a farm and owns a landfill site. He is also the Chairman of the North Eastern Education and Library Board, as well as continuing his council work. He has four children. His son, Roy Beggs Jr was a member of the Northern Ireland Assembly from 1998 until losing his seat in the 2022 Northern Ireland Assembly election.[7]\n\nReferences"}, {"url": "https://prabook.com/web/roy.beggs/941555", "page_content": "Roy BEGGS\n\nMember of Parliament\n\nFebruary 20, 1936 Ballyclare, County Antrim, United Kingdom\n\nForeign the Democratic Unionist Party. he moved to the Ulster Unionist Party and was re-elected in 1981 as a \"loyalist\". He joined the UUP in 1982 and has retained his council seat to date, serving several terms as Mayor of Larne from 1978 until 1983. In 1982 he was elected to the Northern Ireland Assembly representing North Antrim. In 1983 he was selected for the new East Antrim in the 1983 general election. He held the position until the 2005 general election when he was defeated by Sammy Wilson of the Democratic Unionist Party. He was UUP Education Spokesman from 1986 up to and including his last few years in Parliament when he also served as Deputy Leader and Chief Whip of the Ulster Unionist Parliamentary Party. A strong supporter of maintaining Northern Ireland\"s grammar schools, he attacked proposals to abolish academic selection in post-primary education in Northern Ireland, whilst also opposing the introduction of tuition fees for university students claiming that the latter discouraged many from entering higher education. Beggs was also a strong supporter of the Orange Order during their stand-off over Drumcree Church and in 1995 took part in a blockade of the port of Larne as part of a show of solidarity. Beggs was charged with Public Order offences for his involvement and was fined £1,350. In March 2001, he apologised in the House of Commons for failing to register a local business interest. He still lives in Larne and operates a farm and owns a landfill site. He is also the Chairman of the North Eastern Education and Library Board, as well as continuing his council work."}], "Roy Beggs Jr. was a former Grand Master of the County Antrim Grand Orange Lodge.": [{"url": "https://www.irishnews.com/news/northernirelandnews/2022/05/07/news/end-of-the-beggs-dynasty-in-east-antrim-2663204/", "page_content": "DUP former Economy Minister Gordon Lyons pictured at the Assembly elections count at Jordanstown. Picture by Stephen Davison\n\nIT was the end of the Beggs dynasty in East Antrim as an Ulster Unionist veteran lost his seat at the Assembly.\n\nIn a major blow to the UUP, Roy Beggs became one of the first big names to fail to regain their seat at Stormont.\n\nThe veteran politician was eliminated in stage two of the count early yesterday evening after receiving just 3,549 votes. He benefited from only 85 transfers from the Green Party's Mark Bailey and the SDLP's Siobhán McAlister, after they were eliminated in the first count.\n\nA long-standing member of the party, Mr Beggs was first elected to the Assembly in 1998 and had followed in the footsteps of his father Roy Beggs senior, who served as East Antrim MP for more than 20 years.\n\nHe was described as an \"incredible asset to the party\", with UUP leader Doug Beattie saying it was a \"loss\".\n\nBut fortune was on the side of Mr Beggs' running mate John Stewart, who took the first seat in the constituency after he was elected on the third count.\n\nHe said while he was delighted to be elected, he was disappointed that his UUP colleague had lost his seat.\n\nThe DUP's Gordon Lyons had earlier topped the poll in the constituency. The economy minister secured 6,256 first preference votes, while his party colleague David Hilditch received 5,662 votes.\n\nConsidered a unionist stronghold, in the 2017 Assembly election, the DUP and UUP both won two seats while the Alliance took a fifth.\n\nAlliance candidate Stewart Dickson received 5,059 with his party colleague Danny Donnelly on 4,224.\n\nThe TUV's Norman Boyd secured 3,661 first preference votes, while the constituency's only female candidate, the SDLP's Ms McAlister, had 1,200 votes and Mr Bailey of the Green Party receiving 754 votes."}, {"url": "https://www.orangeheritage.co.uk/early-years", "page_content": "HISTORY OF ORANGEISM\n\nThe Orange Institution: The Early Years\n\nThe Loyal Orange Institution was founded after the Battle of the Diamond on September 21, 1795. The \"skirmish\" was between the Roman Catholic Defenders and the Protestants of the area. When it ended the Protestants formed a circle, joined hands and declared their brotherhood in loyalty to the Crown, the country and the Reformed religion.\n\n\n\nThe first shots at the Diamond were fired by the Defenders on Monday September 21, 1795. The \"armies\" faced each other across the valley, the Protestants on Cranagill Hill and the Roman Catholics on Faughart Hill. The Protestants routed their enemies without suffering any casualties. The Defenders who were killed have been estimated at figures between 16 and 50. An eye witness put the number at 30. It had been the intention of the Roman Catholics to drive the Protestants out of the country.\n\n\n\nThe authorities kept a low profile, apparently satisfied to leave the combatants to it. The local commander, Captain John Gifford, of the Royal Dublin Militia, stationed at Portadown was to be accorded a pivotal place in the founding of the Institution.\n\n\n\nGifford was present in Sloan's Inn at Loughgall when the Orange Order was founded.\n\n\n\nPresent at the first meetings of the Orangemen were James Wilson, of the Dyan; Thomas Sinclair, of Derryscallop; and James Sloan, the Loughgall inn-keeper at whose house they were held. Sloan was evidently regarded as the first leader.\n\n\n\nAt the beginning the membership was of the labouring and artisan classes. Only a few of the gentry joined among them Viscount Northland, of Dungannon. The small number of professional men were represented by Joseph Atkinson; the Rev. George Maunsell, Curate of Drumcree in 1781-1804, the Rev. George Marshall, Rector of Dromore, Co. Tyrone; Captain Clarke, Summer Island; Mr. Brownlow, Lurgan, and Major Waring, of Waringstown. The Verners, of Church Hill, also became members.\n\n\n\nThe Institution grew so rapidly that district and county lodges were formed.\n\n\n\nThe several counties had their own rules and soon the need was recognised that there should be uniformity of practice and with this in mind a delegates' meeting was held on July 12, 1796 at Portadown when the idea of a Grand Lodge was also mooted.\n\n\n\nWolsey Atkinson, of Portadown, was appointed secretary and requested to issue printed lodge warrants. These had been issued previously by James Sloan on poor quality paper and hand-written.\n\n\n\nThe first Orange parades were held on July 12, 1796 at Portadown, Lurgan and Waringstown. By 1798 large parades were held at Belfast, Lisburn and Lurgan where the General Officer Commanding in Ulster, Lieutenant-General Lake, inspected the parade.\n\n\n\nIn the Rebellion of 1798, the Orangemen were on the side of the Crown and had much to do with the defeat of the United Irishmen. After the quashing of the Rebellion the English Government with William Pitt the Younger, as Prime Minister, decided to unite the London and Dublin governments. The decision was deeply resented by most Orangemen, though the Grand Master, Thomas Verner, was in favour of the plan.\n\n\n\nGrand Lodge issued statements in December, 1798 and January, 1799 advising Orangemen \"strictly to abstain from expressing any opinion pro or con upon the question of a legislative union between this country and Great Britain, because such expressions of opinion, and such discussion in lodges would only lead to disunion.\"\n\n\n\nThe Act of Union was passed on August 1, 1800 and became law on January 1, 1801. With the Union a reality there were no more loyal supporters of it than the Orangemen.\n\n\n\nThe campaign of Daniel O'Connell for Roman Catholic emancipation was to be made a divisive factor in British politics for the next 20 years. In 1823 O'Connell formed a poltical/religious organisation \"The Catholic Association\".\n\n\n\nThe Grand Master, the Right Hon. George Ogle (1801-1818), - Thomas Verner had resigned in 1801 - and other Orange M.P.s had the constant task of defending the Institution against the attacks at Westminster by parliamentarians who favoured O'Connell and his cause.\n\n\n\nThey had the sympathy of Robert Peel and those members of the Government who recognised the need for an organised body of loyalists in Ireland which would provide recruits for the yeomanry which had the task of keeping the peace in the country, and discouraging rebellion and internecine strife.\n\n\n\nWith the rebellion at an end the lodges were to be less fighting societies, and more political and fraternal clubs. They needed some sort of 'ideas' to hold them together, and Duigenen and Musgrave were men of ideas.\n\n\n\nPatrick Duigenen was Grand Secretary of the Grand Lodge of Ireland and Sir Richard Musgrave, the historian of the \"98\", was Grand Treasurer. These two men were to prove able apologists for the Order, and to them must be credited consequential developments in Orange Institution thinking and practice.\n\n\n\nIn March, 1823, the Co. Armagh Grand Lodge issued this statement: \"We feel not less surprised than grieved that Orange associations should be accused of illegal interference in the state, or branded as an intolerant and persecuting faction.......Where in this land have the laws been so well enforced and so cheerfully obeyed as in those districts where the Orange association has more power and influence?......and we call on them to show in all the outrages and rebellious insults which have disgraced the very name of Ireland, where had the true Orangeman been found who were not ranged on the side of these laws?\"\n\n\n\nWhen Sir Robert Peel became Chief Secretary for Ireland the Orangemen had someone who was anxious to be fair to them. The O'Connellites recognising this as partiality to the Protestants called him \"Orange Peel.\" The Orangemen needed his protection, for in the two years of his secretaryship the attacks on the Orange movement were many and furious.\n\n\n\nFrom 1815, the Institution had been seriously affected, by internal disputes. Many of them were about lodge ritual and the attempts to form higher orders. It was to stay in the doldrums until an Orange Order revival was brought about by the agragrian troubles of the 1820s; the resurgence of the O'Connell movement and a new vice-regal administration with questionable aims in so far as Orangeism was concerned.\n\n\n\nIn January 1820 the Orange central leadership was strengthened by having the Grand Lodge meet twice a year in February and August, and a committee was appointed to take care of the affairs of the Institution between meetings.\n\n\n\nThe Unlawful Oath Act of July 1823, though it was aimed at the Ribbonmen, affected Orangemen, too.\n\n\n\nBy March, 1824 in an attempt to meet the requirements of the Act the Grand Lodge commissioned the production of a new constitution and rules which would be legally acceptable to Parliament in every particular.\n\n\n\nLater it prohibited demonstrations on the 12th July and in so doing seriously endangered its authority over the Private Lodges.\n\n\n\nIn spite of the risk James Verner appealed to all Orangemen \"To act in the most strict conformity with an order which tends so strongly to shew how much the members of the Orange Association are willing to sacrifice to the feelings and even prejudices of their fellow subjects and how desirous they are that no excuses should be left for ascribing any of the disorders that afflict Ireland to their conduct of example\".\n\n\n\nHistorians say that while \"Complete conformity to these instructions was not obtained ....... on the whole they were obeyed\".\n\n\n\nIn 1824 the Government was faced with O'Connell's Catholic Association and its threat to take over the country.\n\n\n\nTo meet the challenge the Government passed the Unlawful Societies Act in 1825 outlawing certain named organisations. The Roman Catholic lobby at Westminster insisted that the Orange Institution must be included in that proscription and it dissolved itself on March 18, 1825.\n\n\n\nThe final meeting of Grand Lodge was held in Dublin with Colonel Pratt in the chair. A statement drawn up and addressed to all lodges said: \"At no period was the Institution in a more flourishing condition, or more highly respectable in the number added to its ranks. Notwithstanding which, the Parliament of the United Kingdom have considered it necessary that all political societies should be dissolved. Of course, our society is included. It therefore becomes our duty to inform you that any lodge meetings after this date commits a breach of the law.\"\n\n\n\nWhile that was the attitude of the leaders their exhortation fell on deaf ears. The lodges continued regardless.\n\n\n\nOn the reorganisation of the Institution, within the law, His Royal Highness Ernest Augustus, fifth son of George III, became Grand Master of England in 1827.\n\n\n\nThe Institution had been revived when the Act of 1825 lapsed. At a Dublin meeting on September 15, 1828 Cumberland was elected Grand Master of Ireland (when he resigned the office and membership of the Order its connection with royalty ceased).\n\n\n\nThe O'Connell campaign against the Union caused Protestants to fear for the future of their country. They turned in large numbers to the Institution for leadership and protection in their determination to maintain the Union.\n\n\n\nWhen the question of the right of Orangemen to march in procession was asked many felt that the leaders were far removed from the rank and file in their thinking. It was contended that the leaders were only concerned with the Constitution, Repeal and the situation of the Established Church. The determination of the Orangemen to have their processions and demonstrations took no thought of the effects of these on Westminster and their enemies there and elsewhere. The issue was again debated in Westminster in 1836 and the Whig Government, dependent on the support of O'Connell and the Radicals, decided to move against the Institution.\n\n\n\nThe judgement was delivered by King William IV, on February 25, 1836 when he said he would be \"pleased to take such measures as may be seen to be advisable for the effectual discouragement of Orange lodges and generally of all political societies, excluding persons of a different religious faith, using secret signs and symbols, and acting by means of associated branches.\"\n\n\n\nOn February 26, the Home Secretary received an assurance from Cumberland that he would \"take immediate steps to dissolve the Loyal Orange Institution in Great Britain.\" The promise was kept and officially the Institution was dissolved again in England and Ireland.\n\n\n\nThe Northern Irish refused even to think of dissolution. Grand Lodge might agree to it, but it had no power to dissolve the Order. Many lodges acted as they had done after 1825. They just carried on as before.\n\n\n\nThe Armagh County Grand Lodge resolved on June 13, 1836: \"That the business of the Institution in this country be entrusted, as in the early days, to Grand Lodge of the same until the Grand Lodge of Ireland resumes its function.\"\n\n\n\nThe Grand Lodge was reconstructed on November 15, 1837 in Dublin with Lord Roden as Grand Master. In the struggle for the Union a Grand Lodge of Ulster was formed in February 12, 1844, with the aim of giving \"mutual support and defence in these perilous times.\"\n\n\n\nIn 1845, the Party Processions' Act having expired, the Orangemen were openly demonstrating in many places. The Grand Lodge was reconstructed again on August 3, this time at the Town Hall, Enniskillen, and the Earl of Enniskillen was elected Grand Master.\n\n\n\nThe Roman Catholic Ribbonmen were most active in the spring of 1848. They killed a few people and attacked the Orange procession at Dolly's Brae. The aftermath of that affair was the dismissal of Lord Roden and William Beers, the Co. Down Grand Master and his brother Francis from the Commission of the Peace.\n\n\n\nFollowing the fracas at Dolly's Brae the 1850 Party Procession Act was introduced - it was aimed at preventing Orange and Green organisations from marching on their special days - William Johnston of Ballykilbeg organised a demonstration against it on July 12, 1867.\n\n\n\nHe led Orangemen in procession from Newtownards to Bangor. Altogether 100 lodges walked in the parade with 40,000 people as participants and spectators. While Johnston and a hundred others were named for prosecution only he and a few others were charged and he only went to prison.\n\n\n\nThe others had pleaded guilty and were fined. Johnston refused bail set at £500 for himself and two other sureties of £500 each.\n\n\n\nJohnston served a few days short of two months being released on April 27, 1868. Ten thousand people were at the prison gate that day to greet him and there were bands and party tunes. Bonfires were lit on many of the hills in Ulster that night. What William Johnston had done on the Twelfth 1867 was distasteful to Grand Lodge but he was unconcerned for he had the evidence that the membership were behind him. When the Act was repealed Orange processions were resumed everywhere in the country.\n\n\n\nThe first international Orange Conference was held in the Belfast Orange Hall on July 18, 1866, \"in response to the suggestion from Canada where Orangeism was now very strong, and where they say Bro. Sir John Macdonald got the notion of the Confederation of Canada from the organisation of the Grand Lodge of British America, the Orangemen of the world came together then to provide a means of consultation in the new Imperial Grand Orange Council.\""}, {"url": "https://www.belfasttelegraph.co.uk/news/obituaries/tributes-to-orange-orders-roy-kells-who-was-respected-businessman/38944974.html", "page_content": "Obituary\n\nRoy Kells, who died in hospital on Sunday, was a well-known businessman in Fermanagh .\n\nHe was also a leading figure in the Orange Order and was in his 80s.\n\nPaying tribute, the DUP leader Arlene Foster said: \"In his professional life Roy Kells made a huge contribution across Northern Ireland, but he remained most definitely a Lisnaskea man through and through.\n\n\"Through some extremely difficult times, Roy not only sustained the business, but oversaw its expansion within Co Fermanagh and across Northern Ireland, and it is now one of Northern Ireland's best-known family firms. Roy's faith, his family, and his dedication to serving the public have been the hallmarks of his life.\n\n\"It is notable that so many of the staff who work across the SD Kells stores have been there for many years. Their dedication to the company was only matched by Roy's dedication and care for them. My thoughts today are with the Kells family and all those who will miss Roy the most.\"\n\nThe SD Kells firm was founded by his parents who retired in 1964, and Roy Kells built up a drapery and furnishing business all over Northern Ireland.\n\nThe company has outlets including those in Enniskillen, Omagh, Lurgan, Lisnaskea, Banbridge, Larne, Belfast, Irvinestown, Newtownards and Portadown.\n\nIn 2013, Mr Kells received the Lifetime Achievement Award in the Fermanagh Business Awards. He described the award as \"an utter surprise and most unexpected\", and attributed it to the staff and company directors.\n\nRoy Kells built up the company in times of great challenges during the Troubles, and he served in the UDR, where he rose to the rank of Lieutenant-Colonel. In 1981 he narrowly escaped death when a gunman fired at him through a shop window.\n\nThe late Mr Kells made a significant contribution to the Orange Order, in many different ways. He was a member of Fawney Heroes LOL329 in Lisnaskea, and he held the position of County Grand Master of the Grand Orange Lodge of Ireland from 1999-2003. He was Deputy Grand Master of the Grand Lodge of Ireland from 2003-2004.\n\nHe was recognised for his long commitment to the institution by receiving The Lifetime Achievement Award at the annual Orange Community Awards in 2018. Grand Master Edward Stevenson, who presented the award, said that it was given in recognition of Mr Kells' \"entrepreneurial prowess as well as his contribution to the provision of employment and the local community generally\".\n\nIn the mid-90s many nationalists boycotted SD Kells stores at the height of the Drumcree parade dispute, and in 1998, the car used to transport the Omagh bomb was left outside one of the shops.\n\nPaying tribute yesterday the Reverend Mervyn Gibson, Secretary of the Grand Lodge of Ireland, said: \"Roy Kells was the leading Fermanagh Orangeman of his generation. He served his country and he was a leading Northern Ireland businessman.\n\n\"He always had time to talk and to offer advice. He will be a great loss to his family and to the Orange institution.\"\n\nIn another tribute an Orange spokesman said: \"Roy Kells was highly influential and well-respected by senior officers and by brethren alike, and he can be rightly described as a lifelong Orangeman, having joined the institution as a young man.\"\n\nMr Kells is survived by his wife Shirley, adult children David, Ian, Andrew and Catherine, and the wider family.\n\nThe funeral takes place today at 2pm in Holy Trinity Parish Church, Lisnaskea."}, {"url": "https://www.celebsagewiki.com/roy-beggs-jr", "page_content": "Age, Biography and Wiki\n\nRoy Beggs Jr was born on 3 July, 1962. Discover Roy Beggs Jr's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 60 years old?\n\nPopular As N/A Occupation N/A Age 60 years old Zodiac Sign Cancer Born 3 July 1962 Birthday 3 July Birthplace N/A Nationality\n\nWe recommend you to check the complete list of Famous People born on 3 July. He is a member of famous with the age 60 years old group.\n\nRoy Beggs Jr Height, Weight & Measurements\n\nAt 60 years old, Roy Beggs Jr height not available right now. We will update Roy Beggs Jr's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is Roy Beggs Jr's Wife?\n\nHis wife is Sandra Beggs\n\nFamily Parents Not Available Wife Sandra Beggs Sibling Not Available Children 3\n\nRoy Beggs Jr Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Roy Beggs Jr worth at the age of 60 years old? Roy Beggs Jr’s income source is mostly from being a successful . He is from . We have estimated Roy Beggs Jr's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income\n\nRoy Beggs Jr Social Network\n\nInstagram Linkedin Twitter Facebook Wikipedia Roy Beggs Jr Wikipedia Imdb\n\nTimeline"}, {"url": "http://www.citygrandlodge.com/461_history.html", "page_content": "BRO SCOTT GOLIGHER LOL 461\n\n\n\n\n\nSince the above photo was taken the Bro. Scott Goligher Memorial Orange Hall has been demolished to make way for a road widening scheme. Currently the Lodge meets in the nearby Norris Memorial Hall at Fawney in Londonderry. Since the above photo was taken the Bro. Scott Goligher Memorial Orange Hall has been demolished to make way for a road widening scheme. Currently the Lodge meets in the nearby Norris Memorial Hall at Fawney in Londonderry.\n\nThat scriptural quotation, \"The first shall be last and the last shall be first\" Mark chapter 10 verse 31 could certainly apply to the Orangemen of the Bro. Scott Goligher Memorial Orange Lodge, one of the oldest warrants under the jurisdiction of the City of Londonderry Grand Orange Lodge but the last of local lodges to be formed.The Lodge Warrant was first issued in 1798, three years after the Battle of the Diamond in 1795, and was itself the year of the United Irishmen rebellion. It was operating in the Newtownstewart District of Co. Tyrone, James Eakins was Worshipful Master. In the Grand Lodge register of 1825/29 the warrant is still in Newtownstewart District with James Robb as W.M.The 1856 register of warrants advises that the Lodge is now meeting in Omagh District, but no further information is given. In 1875 24 Brethren were returned and Andrew Hutchinson was W.M. The county Tyrone Grand Lodge report of 1886 indicates Joseph Hill as W.M. the address being Gortmore, Omagh and 11 Brethren of the Rolls. In 1892 the Lodge attended the 12th July in Omagh and Joseph Hill was still W.M.After the half-yearly meeting of the Grand Orange Lodge of Ireland held in Dublin Orange Hall on Wednesday 5th December 1894 the County Tyrone Grand Lodge handed in Warrant No. 461 for cancellation, which was duly approved.The Warrant next found its way to the City of Londonderry Grand Lodge working under Cumber Claudy No. 2 District having been renamed Tunduff and with Bro. James Simpson's being named on the Warrant. Little is known about the Tunduff Lodge except that it ceased to function during the 1940'sIn the minutes of the City of Londonderry L.O.L. No. 5 District dated 25th October 1950 there was a request from eight Brethren to form a new Lodge. Title to be \"Smythe Memorial, Ardmore\". Permission was also sought for the new Lodge to join No. 5 District. It was reported to the District that there was a dormant Warrant being held by Cumber Claudy District. This Warrant no. 461 would now be sought for the new lodge.The eight brethren who made the request were as follows: -Bro. Wm. Molloy L.O.L. 816 Bro. Robert Bogle L.O.L. 1927Bro. John W. Adams L.O.L. 2048 Bro. George McCurdy L.O.L. 1164Bro. Thomas Patterson L.O.L. 2048 Bro. Robert Orr L.O.L. 858Bro. John Neely L.O.L. 1060 Bro. Albert W. Leiction L.O.L. 816It was also recorded that a pipe band had also been formed earlier by some of the same brethren.On the 11th April 1951 the City of Londonderry Grand Secretary Bro. Robert Graham handed over to No. 5 District Warrant No. 461 and on Monday 14th May 1951 there was a special meeting of No. 5 District in Ardmore of the Purpose of Electing and Installing the Officers and handing over to the new W. M. the Warrant.The first Officers of the Smythe Memorial Lodge were as follows:W. M. Bro. Wm. Molloy 1st Comm. Bro. John AdamsD. M. Bro. Robt. McElhinney 2nd Comm. Bro. T. PattersonChap. Bro. Robt. Dunn 3rd Comm. Bro. A. CraigSec. Bro. Jas. Norris 4th Comm. Bro. Wm. KeeTreas. Bro. Robt. Bogie 19 members on the roll.It is interesting to note that Bro. Thomas Patterson P.M. a founding member is still active in the Lodge, participating occasionally as a Lecturer during the initiation of candidates.A large number of brethren attended this inaugural meeting. They included Bro. F McIntyre, Grand Master City of Londonderry Grand Orange Lodge, Bro. R. Graham, City Grand Secretary, Bro. J.S. Manning, City Grand Treasurer, and Bro. R. Robinson, Treasurer Cumber Claudy District.Bro. L. Dundas, District Secretary of No. 5 District handed over a new Minute and Roll Book & Bro. Richard Buchanan presented an inscribed Bible. The City of Londonderry No. 5 District at a cost of 12/6 also provided the first Lodge seal from the Derry Standard.Prior to the 12th July 1952, No. 5 District decided to have L.O.L. 461 included on the District Bannerette and the first 12th attended by the Lodge was in Portrush in 1952. We also held our first Sunday service to Glendermott Presbyterian Church on the 25th May 1952.During January 1972 the Lodge suffered a sad blow with the death of a dedicated and much admired member Bro. Scott Goligher. It was proposed and passed during the April 1972 meeting to rename the Lodge the Brother Scott Goligher Memorial Loyal Orange lodge. This was only after it had been discussed with his relatives.The Lodge met in numerous locations over the last number of years including Colonel Smythe's Hut, Ardmore, The Churchill Hall, Milltown, Glendermott Presbyterian Church Session room's but June 1974 saw the Lodge purchase the Faughan Bridge National School for £400 from Glendermott Presbyterian Church. On the 3rd May 1975 the Rt. Wor. Bro. Rev. W. Martin Smyth B.A., B.D., M.P., Grand Master of the Grand Orange Lodge of Ireland in front of a large gathering of Orangemen & woman, bandsmen and supporters Officially Dedicated and opened the Brother Scott Goligher Memorial Orange Hall.The first banner obtained by the Smythe memorial Lodge was a `Flag`, which belong to the old Tunduff LOL 461 Lodge. The brethren had it renamed and converted to a banner of the first 12th parade. Since then the Lodge has had a total of 5 banners and as part of our 50th birthday celebrations we unfurled a new banner.As part of our 50th Anniversary Celebrations in 2001 the members of the Lodge decided to Strike a Lodge Jewel. 50 Jewels were commissioned purchased mainly by members of the lodge, with a few going to collectors of Orange Memorabilia. The jewel incorporates the City of Londonderry's Coat of Arms within an Orange Five Pointed Star and two scrolls with the Lodges Name and Number. The ribbon is Orange with two Derry Crimson Stripes.\n\nQuality Membership\n\nSince L.O.L. 461's formation there has been a high degree of representation on the District Lodge and three members have been installed as Worshipful District Masters they were Bro. David Lynch 1966 to 1970, Bro.TM Craig 1978 to 1979 and Bro.James Hetherington 1994 to 1999, Bros. James Hetherington, William Wray and David Allen have all served as City of Londonderry Grand Orange Lodge Officers, Bro. Allen also had the opportunity to attend the Imperial Orange Council of the World meeting in New Zealand in 1994.\n\n\n\nWorshipful Master’s Roll\n\nWor. Bro. W. Molloy 1951 – 1954 Wor. Bro. J. Galbraith 1984 – 1986\n\nWor. Bro. R. McElhinney 1954 – 1956 Wor. Bro. J. Hetherington 1986 – 1988\n\nWor. Bro. D. Lynch 1956 – 1961 Wor. Bro. T. Hamilton 1988 - 1992\n\nWor. Bro. T. Patterson 1961 – 1965 Wor. Bro. W. Haire 1992 - 1994\n\nWor. Bro. I. Gillispie 1965 – 1967 Wor. Bro. J. Porter 1994 – 1996\n\nWor. Bro. J. Curry 1967 – 1968 Wor. Bro. D.C.S. Allen 1996 - 1998\n\nWor. Bro. J. Curley 1968 – 1973 Wor. Bro. R. Lynch 1998 - 2000\n\nWor. Bro. W. McKeegan 1973 – 1977 Wor. Bro. R. McClintock 2000 - 2002\n\nWor. Bro. N. Simpson 1977 – 1980 Wor. Bro. W.T. Wray 2002\n\nWor. Bro. T.M. Craig 1980 – 1984\n\n\n\n"}, {"url": "https://belfastchildis.com/2016/07/07/the-orange-order-whats-it-all-about/", "page_content": "Welcome to the Grand Orange Lodge\n\nWe are a Protestant fraternity with members throughout the world. Autonomous Grand Lodges are found in Scotland, England, the United States of America, West Africa, Canada, Australia and New Zealand. Our name comes from William III, Prince of Orange, and is kept because his victory over despotic power laid the foundation for the evolution of Constitutional Democracy in the British Isles. Support for William of Orange in the British Isles led to the formation of Orange Societies to commemorate his victory at the Battle of the Boyne in July 1690, but the largest and longest lasting groups were the Boyne Societies in Ireland. In 1795, following the culmination of attacks on Protestants in County Armagh at the Battle of the Diamond , in which Protestants routed those who had attacked them and attempted to burn properties, it was decided to form an organisation which would protect Protestants. This body, drawing on existing Orange Clubs in the neighbourhood, was named the Loyal Orange Institution. In modern times the Loyal Orange Institution continues to function, with thousands of members in Ireland many others across the world. Today defending Protestantism is not so literal as it was in 1795, but it requires us to take a stand for truth in an age of secularism and in order to defend our culture and traditions. The Grand Orange Lodge of Ireland was established in 1798. We hope you will learn more about us and the Orange tradition through this website. See The Grand Orange Lodge of Ireland\n\nThe Sons of William Loyal Orange Lodge 209\n\nHistory & Background\n\nOrange Order\n\nThe Loyal Orange Institution, more commonly known as the Orange Order, is a Protestant fraternal organisation based primarily in Northern Ireland. It also has a significant presence in the Scottish Lowlands and lodges throughout the Commonwealth and United States.\n\nThe Orange Order was founded in County Armagh in 1795, during a period of Protestant-Catholic sectarian conflict, as a Masonic-style brotherhood sworn to maintain the Protestant Ascendancy. It is headed by the Grand Orange Lodge of Ireland, which was established in 1798. Its name is a tribute to the Dutch-born Protestant king William of Orange, who defeated the army of Catholic king James II at the Battle of the Boyne (1690). Its members wear orange sashes and are referred to as Orangemen. The Order is best known for its yearly marches, the biggest of which are held on or around 12 July (‘The Twelfth‘).\n\nRoyal Coat of Arms of the United Kingdom of Great Britain and Northern Ireland\n\nPolitically, the Orange Order is a conservative British unionist organisation with links to Ulster loyalism. It campaigned against Scottish independence in 2014. The Order sees itself as defending Protestant civil and religious liberties, whilst critics accuse the Order of being sectarian, triumphalist and supremacist.\n\nIt has also been criticised for associating with loyalist paramilitary groups. As a Protestant society, it does not accept non-Protestants as members unless they convert and adhere to the principles of Orangeism, nor does it accept Protestants married to Catholics. Orange marches through mainly Catholic and nationalist neighbourhoods in Northern Ireland are controversial and have often led to violence.\n\nHistory\n\nWilliam III (“William of Orange”) King of England, Scotland and Ireland, Stadtholder of the Netherlands. The Siege of Derry 18th April 28th July 1689\n\nThe Orange Institution commemorates the civil and religious privileges conferred on Protestants by William of Orange, the Dutch prince who became King of England, Scotland, and Ireland in the Glorious Revolution of 1688. In particular, the Institution remembers the victories of William III and his forces in Ireland in the early 1690s, especially the Battle of the Boyne.\n\nFormation and early years\n\nSince the 1690s commemorations—state-sponsored and those held by the lower classes—had been held throughout Ireland celebrating key dates in the Williamite War such as the Battle of the Boyne, Siege of Derry and the Siege of Cork. These followed a tradition started in Elizabethan England of celebrating key events in the Protestant calendar. By the 1740s there were organisations holding parades in Dublin such as the Boyne Club and the Protestant Society, both seen as forerunners to the Orange Order.\n\nArmagh disturbances\n\nThroughout the 1780s, sectarian tension had been building in County Armagh, largely due to the relaxation of the Penal Law. Here the number of Protestants and Catholics (in what was then Ireland’s most populous county) were of roughly equal number, and competition between them to rent patches of land near markets was fierce. Drunken brawls between rival gangs had by 1786 become openly sectarian. These gangs eventually reorganised as the Protestant Peep o’ Day Boys and the Catholic Defenders, with the next decade in County Armagh marked by fierce sectarian conflict between both groups, which escalated and spread into neighbouring counties.\n\nBattle of the Diamond\n\n200th Anniversary Battle of the Diamond Parade 1995\n\nIn September 1795, at a crossroads known as “The Diamond” near Loughgall, Defenders and Peep o’ Day Boys gathered to fight each other. This initial stand-off ended without battle when the priest that accompanied the Defenders persuaded them to seek a truce, after a group called the “Bleary Boys” came from County Down to reinforce the Peep o’ Day Boys. When a contingent of Defenders from County Tyrone arrived on 21 September, however, they were “determined to fight”. The Peep o’ Day Boys quickly regrouped and opened fire on the Defenders. According to William Blacker, the battle was short and the Defenders suffered “not less than thirty” deaths.\n\nAfter the battle had ended, the Peep o’ Days marched into Loughgall, and in the house of James Sloan they founded the Orange Order, which was to be a Protestant defence association made up of lodges. The principal pledge of these lodges was to defend “the King and his heirs so long as he or they support the Protestant Ascendancy“. At the start the Orange Order was a “parallel organisation” to the Defenders in that it was a secret oath-bound society that used passwords and signs.\n\nOne of the very few landed gentry that joined the Orange Order at the outset, William Blacker, was unhappy with some of the outcomes of the Battle of the Diamond. He says that a determination was expressed to “driving from this quarter of the county the entire of its Roman Catholic population”, with notices posted warning them “to Hell or Connaught”. Other people were warned by notices not to inform on local Orangemen or “I will Blow your Soul to the Low hils of Hell And Burn the House you are in”. Within two months, 7,000 Catholics had been driven out of County Armagh.\n\nAccording to Lord Gosford, the governor of Armagh:\n\nIt is no secret that a persecution is now raging in this country… the only crime is… profession of the Roman Catholic faith. Lawless banditti have constituted themselves judges… and the sentence they have denounced… is nothing less than a confiscation of all property, and an immediate banishment.\n\nA former Grand Master of the Order, also called William Blacker, and a former County Grand Master of Belfast, Robert Hugh Wallace have questioned this statement, saying whoever the Governor believed were the “lawless banditti”, they could not have been Orangemen as there were no lodges in existence at the time of his speech.\n\nAccording to historian Jim Smyth:\n\nLater apologists rather implausibly deny any connection between the Peep-o’-Day Boys and the first Orangemen or, even less plausibly, between the Orangemen and the mass wrecking of Catholic cottages in Armagh in the months following ‘the Diamond’ – all of them, however, acknowledge the movement’s lower class origins.\n\nThe Order’s three main founders were James Wilson (founder of the Orange Boys), Daniel Winter and James Sloan. The first Orange lodge was established in nearby Dyan, and its first grand master was James Sloan of Loughgall. Its first ever marches were to celebrate the Battle of the Boyne and they took place on 12 July 1796 in Portadown, Lurgan and Waringstown.\n\nThe United Irishmen rebellion\n\nFlag of the United Irishmen.\n\nThe Society of United Irishmen was formed by liberal Presbyterians and Anglicans in Belfast in 1791. It sought reform of the Irish Parliament, Catholic Emancipation and the repeal of the Penal Laws. By the time the Orange Order was formed, the United Irishmen had become a revolutionary group advocating an independent Irish republic that would “Unite Catholic, Protestant and Dissenter”. United Irishmen activity was on the rise, and the government hoped to thwart it by backing the Orange Order from 1796 onward.\n\nIrish nationalist historians Thomas A. Jackson and John Mitchel argued that the government’s goal was to hinder the United Irishmen by fomenting sectarianism, thereby creating disunity and disorder under pretence of “passion for the Protestant religion”. Mitchel wrote that the government invented and spread “fearful rumours of intended massacres of all the Protestant people by the Catholics”.\n\nHistorian Richard R Madden wrote that “efforts were made to infuse into the mind of the Protestant feelings of distrust to his Catholic fellow-countrymen”. Thomas Knox, British military commander in Ulster, wrote in August 1796 that :\n\n“As for the Orangemen, we have rather a difficult card to play…we must to a certain degree uphold them, for with all their licentiousness, on them we must rely for the preservation of our lives and properties should critical times occur”.\n\nThe United Irishmen saw the Defenders as potential allies, and between 1794 and 1796 they formed a coalition. The United Irishmen, despite seeing the Defenders as “ignorant and poverty-stricken houghers and rick-burners” would claim in 1798 that they were indebted to the Armagh disturbances as the Orangemen had scattered politicised Catholics throughout the country and encouraged Defender recruitment, creating a proto-army for the United Irishmen to utilise.\n\nThe United Irishmen launched a rebellion in 1798. In Ulster, most of the United Irish commanders and many of the rebels were Protestant. Orangemen were recruited into the yeomanry to help fight the rebellion and “proved an invaluable addition to government forces”.\n\nNo attempt was made to disarm Orangemen outside the yeomanry, because they were seen as by far the lesser threat. It was also claimed that if an attempt had been made then “the whole of Ulster would be as bad as Antrim and Down”, where the United Irishmen rebellion was at its strongest. However, sectarian massacres by the Defenders in County Wexford “did much to dampen” the rebellion in Ulster.\n\nThe Scullabogue Barn massacre saw over 100 non-combatant (mostly Protestant) men, women, and children imprisoned in a barn which was then set alight, with the Catholic rebels ensuring none escaped, not even a child who it is claimed managed to break out only for a rebel to kill with his pike. In the trials that followed the massacres, evidence was recorded of anti-Orange sentiments being expressed by the rebels at Scullabogue. Partly as a result of this atrocity, the Orange Order quickly grew and large numbers of gentry with experience gained in the yeomanry came into the movement.\n\nThe homeland and birthplace of the Defenders was mid-Ulster and here they failed to participate in the rebellion, having been cowed into submission and surrounded by their Protestant neighbours who had been armed by the government. The sectarian attacks on them were so severe that Grand Masters of the Orange Order convened to find ways of reducing them.\n\nAccording to Ruth Dudley Edwards and two former Grand Masters, Orangemen were among the first to contribute to repair funds for Catholic property damaged in the rebellion.\n\nOne major outcome of the United Irishmen rebellion was the 1800 Act of Union that merged the Irish Parliament with that of Westminster, creating the United Kingdom of Great Britain and Ireland. Many Catholics supported the Act, but the Orange Order saw it as a threat to the “Protestant constitution” and 36 lodges in counties Armagh and Monaghan alone passed declarations opposing the Union.\n\nSuppression\n\nDolly’s Brae, site of the “Battle of Dolly’s Brae” (1849) between Orangemen and Catholic Ribbonmen\n\nIn the early nineteenth century, Orangemen were heavily involved in violent conflict with an Irish Catholic secret society called the Ribbonmen. One instance, publicised in a 7 October 1816 edition of the Boston Commercial Gazette, included the murder of a Catholic priest and several members of the congregation of Dumreilly parish in County Cavan on 25 May 1816. According to the article,\n\n“A number of Orangemen with arms rushed into the church and fired upon the congregation”.\n\nOn 19 July 1823 the Unlawful Oaths Bill was passed, banning all oath-bound societies in Ireland. This included the Orange Order, which had to be dissolved and reconstituted. In 1825 a bill banning unlawful associations – largely directed at Daniel O’Connell and his Catholic Association, compelled the Orangemen once more to dissolve their association. When Westminster finally granted Catholic Emancipation in 1829, Roman Catholics were free to take seats as MPs (and take up various other positions of influence and power from which they had been excluded) and play a part in framing the laws of the land. The likelihood of Irish Catholic members holding the balance of power in the Westminster Parliament further increased the alarm of Orangemen in Ireland, as O’Connell’s ‘Repeal’ movement aimed to bring about the restoration of a separate Irish Parliament in Dublin, which would have a Catholic majority, thereby ending to the Protestant Ascendancy.\n\nFrom this moment on, the Orange Order re-emerged in a new and even more militant form.\n\nThe Order supported a plot in 1836 by Ernest Augustus, Duke of Cumberland and Imperial Grand Master of the Orange Order, to take the throne in place of Victoria; once the plot was revealed the House of Commons called upon King William IV to disband the Order. Under pressure from Joseph Hume, William Molesworth and Lord John Russell, the King indicated measures would have to be taken and the Duke of Cumberland was forced to dissolve the Orange lodges.\n\nIn 1845 the ban was again lifted, but the notorious Battle of Dolly’s Brae between Orangemen and Ribbonmen in 1849 led to a ban on Orange marches which remained in place for several decades. This was eventually lifted after a campaign of disobedience led by William Johnston of Ballykilbeg.\n\nRevival\n\nBy the late 19th century, the Order was in decline. However, its fortunes were revived in the 1880s after its embrace by the landlords in opposition to both the Irish Land League and later Home Rule. The Order was heavily involved in opposition to Gladstone‘s first Irish Home Rule Bill 1886, and was instrumental in the formation of the Ulster Unionist Party (UUP). Protestant opposition to Irish self-government under Roman Catholic influence was intense, especially in the Protestant-dominated province of Ulster.\n\nIn the first decade of the twentieth century, the Order suffered a split when Thomas Sloan left the organisation to set up the Independent Orange Order. Sloan had been suspended after running against the official unionist candidate on a pro-Belfast Protestant Association platform in the Belfast South by-election, 1902.\n\nRole in the partition of Ireland\n\nAn Orange banner showing the signing of the Ulster Covenant\n\nIn 1912 the Third Home Rule Bill was introduced in the British House of Commons. However, its introduction would be delayed until 1914. The Orange Order, along with the British Conservative Party and unionists in general, were inflexible in opposing the Bill.\n\nThe Order helped to organise the 1912 Ulster Covenant – a pledge to oppose Home Rule which was signed by up to 500,000 people. In 1911 some Orangemen began to arm themselves and train as militias. In 1913 the Ulster Unionist Council decided to bring these groups under central control, creating the Ulster Volunteer Force, an Ulster-wide militia dedicated to resisting Home Rule. There was a strong overlap between Orange Lodges and UVF units.\n\nA large shipment of rifles was imported from Germany to arm them in April 1914, in what became known as the Larne gun-running.\n\nHowever, the crisis was interrupted by the outbreak of the World War I in August 1914, which caused the Home Rule Bill to be suspended for the duration of the war. Many Orangemen served in the war with the 36th (Ulster) Division, suffering heavy losses, and commemorations of their sacrifice are still an important element of Orange ceremonies.\n\nThe Fourth Home Rule Act was passed as the Government of Ireland Act 1920; the six northeastern counties of Ulster became Northern Ireland and the other twenty-six counties became Southern Ireland. This self-governing entity within the United Kingdom was confirmed in its status under the terms of the Anglo-Irish Treaty of 1921, and in its borders by the Boundary Commission agreement of 1925. Southern Ireland became first the Irish Free State in 1922 and then in 1949 a Republic.\n\nSince 1921\n\nOrangeman James Craig, the first Prime Minister of Northern Ireland\n\nThe Orange Order had a central place in the new state of Northern Ireland. From 1921 to 1969, every Prime Minister of Northern Ireland was an Orangeman and member of the Ulster Unionist Party (UUP); all but three Cabinet Ministers were Orangemen; all but one unionist Senators were Orangemen; and 87 of the 95 MPs who did not become Cabinet Ministers were Orangemen.\n\nJames Craig, the first Prime Minister of Northern Ireland, maintained always that Ulster was in effect Protestant and the symbol of its ruling forces was the Orange Order. In 1932, Prime Minister Craig maintained that “ours is a Protestant government and I am an Orangeman”. This was in response to a speech the year before by Eamonn de Valera in the Irish Free State claiming that Ireland was a “Catholic nation” in a debate about protests against Protestant woman Letitia Dunbar-Harrison being appointed as County Librarian in County Mayo.\n\nTwo years later he stated: “I have always said that I am an Orangeman first and a politician and a member of this parliament afterwards…All I boast is that we have a Protestant Parliament and a Protestant State“.\n\nAt its peak in 1965, the Order’s membership was around 70,000, which meant that roughly 1 in 5 adult Ulster Protestant males were members.Since 1965, it has lost a third of its membership, especially in Belfast and Derry. The Order’s political influence suffered greatly after the unionist-controlled government of Northern Ireland was abolished in 1973.\n\nIn 2012, it was stated that estimated membership of the Orange Order was around 34,000.\n\nAfter the outbreak of “the Troubles” in 1969, the Grand Orange Lodge of Ireland encouraged Orangemen to join the Northern Ireland security forces, especially the Royal Ulster Constabulary (RUC) and the British Army’s Ulster Defence Regiment (UDR). The response from Orangemen was strong. Over 300 Orangemen were killed during the conflict, the vast majority of them members of the security forces.\n\nSome Orangemen also joined loyalist paramilitary groups. During the conflict, the Order had a fractious relationship with loyalist paramilitary groups, the Democratic Unionist Party (DUP), the Independent Orange Order and the Free Presbyterian Church. The Order urged its members not to join these organisations, and it is only recently that some of these intra-unionist breaches have been healed.\n\nDrumcree dispute\n\nDrumcree Riots & Background\n\nDrumcree Church near Portadown\n\nAn anti-Orange Order flag\n\nThe Drumcree dispute is perhaps the most well-known episode involving the Order since 1921. On the Sunday before 12 July each year, Orangemen in Portadown would traditionally march to-and-from Drumcree Church. Originally, most of the route was farmland, but is now the densely populated Catholic part of town.\n\nThe residents have sought to re-route the march away from this area, seeing it as “triumphalist” and “supremacist“\n\nThere have been intermittent violent clashes during the march since the 19th century. The onset of the Troubles led to the dispute intensifying in the 1970s and 1980s. At this time, the most contentious part of the march was the outward leg along Obins Street.\n\nAfter serious violence two years in a row, the march was banned from Obins Street in 1986. The focus then shifted to the return leg along Garvaghy Road.\n\nEach July from 1995 to 2000, the dispute drew worldwide attention as it sparked protests and violence throughout Northern Ireland, prompted a massive police/army operation, and threatened to derail the peace process.\n\nThe situation in Portadown was likened to a “war zone” and a “siege”. During this time, supporters of the Orangemen killed at least six Catholic civilians. In 1995 and 1996, residents succeeded in stopping the march. This led to a standoff at Drumcree between the security forces and thousands of loyalists. Following a wave of loyalist violence, the march was allowed through. In 1997, security forces locked down the Catholic area and forced the march through, citing loyalist threats.\n\nThis sparked widespread protests and violence by Irish nationalists. From 1998 onward the march was banned from Garvaghy Road and the Catholic area was sealed-off with large barricades. For a few years, there was an annual major standoff at Drumcree and widespread loyalist violence. Since 2001, things have been relatively calm, but the Order still campaigns for the right to march on Garvaghy Road. The dispute led to a short-lived boycott of businesses owned by Orangemen and their supporters elsewhere in the region, as well as to a marked decrease in the Order’s membership.\n\nMembership rates\n\nMembership of the Order was historically lower in areas where Protestants are in the majority, and vice versa. In County Fermanagh, where the Catholic and Protestant populations are close to parity, membership in 1971 was three times as high as in the more Protestant counties of Antrim and Down, where it was just over 10% of adult Protestant males.\n\nOther factors that are associated with high rates of membership are levels of unemployment that more closely match Catholic levels, and low levels of support for the Democratic Unionist Party among unionists.\n\nBeliefs and activities\n\nOrange Order poster depicting historical and religious symbols\n\nProtestantism\n\nThe basis of the modern Orange Order is the promotion and propagation of “biblical Protestantism” and the principles of the Reformation. As such the Order only accepts those who confess a belief in a Protestant religion. As well as Catholics, non-Credal and non-Trinitarian Christians are also banned. This includes members of The Church of Jesus Christ of Latter-day Saints (Mormons), Unitarians, Orthodox Christians, and some branches of Quakers.\n\nPrevious rules specifically forbade Roman Catholics and their close relatives from joining but modern rules now use the wording “non-reformed faith”.\n\nConverts to Protestantism can join by appealing to Grand Lodge.\n\nMasonic influenc\n\nSome evangelical groups have claimed that the Orange Order is still influenced by freemasonry. Many Masonic traditions survive, such as the organisation of the Order into lodges. The Order has a similar system of degrees through which new members advance. These degrees are interactive plays with references to the Bible. There is particular concern over the ritualism of higher degrees such as the Royal Arch Purple and the Royal Black Institutions.\n\nSabbatarianism\n\nThe Order considers important the Fourth Commandment, and that it forbids Christians to work, or engage in non-religious activity generally, on Sundays. When the Twelfth of July falls on a Sunday the parades traditionally held on that date are held the next day instead. In March 2002, the Order threatened “to take every action necessary, regardless of the consequences” to prevent the Ballymena Show being held on a Sunday.\n\nThe County Antrim Agricultural Association complied with the Order’s wishes.\n\nPolitics\n\nThe Orange Order is strongly linked to British unionism. This is a political ideology that supports the continued unity of the United Kingdom. Unionism is thus opposed to, for example, the unification of Ireland and Scottish independence.\n\nAn Orange Hall in Ballinrees bedecked with Union Flags\n\nAn anti-Orange Order sign in Rasharkin\n\nThe Order, from its very inception, was an overtly political organisation.[67] In 1905, when the Ulster Unionist Council (UUC) was formed, the Orange Order was entitled to send delegates to its meetings. The UUC was the decision-making body of the Ulster Unionist Party (UUP). Between 1922 and 1972, the UUP was consistently the largest party in the Northern Ireland Parliament, and all Prime Ministers of Northern Ireland and the vast majority of senior UUP figures were members of the Order. Due to its close links with the UUP, the Orange Order was able to exert great influence.\n\nThe Order was the force behind the UUP no-confidence votes in reformist Prime Ministers O’Neill (1969), Chichester-Clark (1969–71) and Faulkner (1972–74). At the outbreak of The Troubles in 1969, the Order encouraged its members to join the Northern Ireland security forces. The Democratic Unionist Party (DUP) attracted the most seats in an election for the first time in 2003. DUP leader Ian Paisley had been clashing with the Order since 1951, when the Order banned members of Paisley’s Free Presbyterian Church from acting as Orange chaplains and later, from the 1970s, when it openly endorsed the UUP against the DUP.\n\nRecently, however, Orangemen have begun voting for the DUP in large numbers due to their opposition to the Good Friday Agreement. Relations between the DUP and Order have healed greatly since 2001, and there are now a number of high-profile Orangemen who are DUP MPs and strategists.\n\nIn December 2009, the Orange Order held secret talks with Northern Ireland’s two main unionist parties, the DUP and UUP. The main goal of these talks was to foster greater unity between the two parties, in the run-up to the May 2010 general election. Sinn Féin’s Alex Maskey said that the talks exposed the Order as a “very political organisation”. Shortly after the election, Grand Master Robert Saulters called for a “single unionist party” to maintain the union. He said that the Order has members “who represent all the many shades of unionism” and warned, “we will continue to dilute the union if we fight and bicker among ourselves”.\n\nIn the October 2010 issue of The Orange Standard, Grand Master Robert Saulters referred to ‘dissident’ Irish republican paramilitaries as the “Roman Catholic IRA“. SDLP MLA John Dallat asked Justice Minister David Ford to find if Saulters had broken the hate speech laws. He said:\n\n“Linking the Catholic community or indeed any community to terror groups is inciting weak-minded people to hatred, and surely history tells us what that has led to in the past”.\n\nIn a 2011 survey of 1,500 Orangemen throughout Northern Ireland, over 60% believed that “most Catholics are IRA sympathizers”.\n\nIn 2015, the Grand Orange Lodge of Ireland made a submission to the Northern Ireland Department of Arts, Culture and Leisure opposing the introduction of an Irish Language Bill. In its submission, the Lodge stated that it respected “Irish as one of the indigenous languages of the British Isles”. However, the Lodge argued an Irish Language Act would promote inequality because it would be “directed towards a section of the Roman Catholic community”.\n\nOrangemen parading in Bangor on 12 July 2010\n\nParades\n\nParades are a big part of the Order’s activities. Most Orange lodges hold a yearly parade from their Orange hall to a local church. The denomination of the church is quite often rotated, depending on local demographics.\n\nThe highlights of the Orange year are the parades leading up to the celebrations on the Twelfth of July. The Twelfth, however, remains in places a deeply divisive issue, not least because of the alleged triumphalism, anti-Catholicism and anti-Irish nationalism of the Orange Order. In recent years, most Orange parades have passed peacefully.\n\nAll but a handful of the Orange Order parades, at so called “interface areas” where the two communities live next to each other, are peaceful. The locations used for the annual Twelfth parades are located throughout the six counties of Northern Ireland with County Down having the most venues with thirty three.Counties Armagh and Fermanangh having a smaller population both have twelve host venues.\n\nSome smaller villages such as Cushendall, Rostrevor, Crossmaglen and Draperstown are not marched in at all and areas with a sizeable population like Coalisland and Dungiven have never been the host for a major Twelfth parade.\n\nThe Grand Lodge of Ireland does not recognise the Parades Commission, which it sees as having been founded to target Protestant parades, as Protestants parade at ten times the rate of Catholics. Grand Lodge is, however, divided on the issue of working with the Parades Commission. 40% of Grand Lodge delegates oppose official policy while 60% are in favour. Most of those opposed to Grand Lodge policy are from areas facing parade restrictions like Portadown District, Bellaghy, Derry City and Lower Ormeau.\n\nIn a 2011 survey of Orangemen throughout Northern Ireland, 58% said they should be allowed to march through Irish nationalist and Catholic areas with no restrictions; 20% said they should negotiate with residents first.\n\nOrange halls\n\nRasharkin Orange hall daubed with republican graffiti\n\nClifton Street Orange Hall in Belfast, which has a protective cage. The statue on the roof is the only one of King William III of England on any Orange hall in Ireland\n\nMonthly meetings are held in Orange halls. Orange halls on both sides of the Irish border often function as community halls for Protestants and sometimes those of other faiths, although this was more common in the past . The halls often host community groups such as credit unions, local marching bands, Ulster-Scots and other cultural groups as well as religious missions and unionist political parties.\n\nOf the approximately 700 Orange halls in Ireland, 282 have been targeted by arsonists since the beginning of the Troubles in 1968. Paul Butler, a prominent member of Sinn Féin, has said the arson is a “campaign against properties belonging to the Orange Order and other loyal institutions” by nationalists.\n\nOn one occasion a member of Sinn Féin’s youth wing was hospitalised after falling off the roof of an Orange hall. In a number of cases halls have been badly damaged or completely destroyed by arson, while others have been damaged by paint bombings, graffiti and other vandalism.\n\nThe Order claims that there is considerable evidence of an organised campaign of sectarian vandalism by Irish republicans. Grand Secretary Drew Nelson claims that a statistical analysis shows that this campaign began in the last years of the 1980s and continues to the present.\n\nHistoriography\n\nOne of the Orange Order’s activities is teaching members and the general public about William of Orange and associated subjects. Both the Grand Lodge and various individual lodges have published numerous booklets about William and the Battle of the Boyne, often aiming to show that they have continued relevance, and sometimes comparing the actions of William’s adversary James II with those of the Northern Ireland Office. Furthermore, historical articles are often published in the Order’s newspaper the Orange Standard and the Twelfth souvenir booklet. While William is the most frequent subject, other topics have included the Battle of the Somme (particularly the 36th (Ulster) Division‘s role in it), Saint Patrick (who the Order argues was not Roman Catholic), and the Protestant Reformation.\n\nThere are at least two Orange Lodges in Northern Ireland which they claim represent the heritage and religious ethos of Saint Patrick. The best known is the Cross of Saint Patrick LOL (Loyal Orange lodge) 688, instituted in 1968 for the purpose of (re)claiming Saint Patrick. The lodge has had several well known members, including Rev Robert Bradford MP who was the lodge chaplain who himself was killed by the Provisional IRA, the late Ernest Baird.\n\nToday Nelson McCausland MLA and Gordon Lucy, Director of the Ulster Society are the more prominent members within the lodge membership. In the 1970s there was also a Belfast lodge called Oidhreacht Éireann (Ireland’s Heritage) LOL 1303, which argued that the Irish language and Gaelic culture were not the exclusive property of Catholics or republicans.\n\nWilliam was supported by the Pope in his campaigns against James’ backer Louis XIV of France, and this fact is sometimes left out of Orange histories.\n\nOccasionally the Order and the more fundamentalist Independent Order publishes historical arguments based more on religion than on history. British Israelism, which claims that the British people are descended from the Israelites and that Queen Elizabeth II is a direct descendant of the Biblical King David, has from time to time been advanced in Orange publications.\n\nWar commemoration\n\nThiepval Memorial Lodge parade in remembrance of the Battle of the Somme. See Thiepval Memorial\n\nThe Order has been prominent in commemorating Ulster’s war dead, particularly Orangemen and particularly those who died in the Battle of the Somme (1916) during World War I. There are many parades on and around 1 July in commemoration of the Somme, although the war memorial aspect is more obvious in some parades than others. There are several memorial lodges, and a number of banners which depict the Battle of the Somme, war memorials, or other commemorative images. In the grounds of the Ulster Tower Thiepval, which commemorates the men of the Ulster Division who died in the Battle of the Somme, a smaller monument pays homage to the Orangemen who died in the war.[93]\n\nRelationship with loyalist paramilitaries\n\nOrangemen carrying a banner of killed UVF member and Orangeman Brian Robinson in 2003\n\nThe Orange Order has been criticized for associating with loyalist paramilitary groups such as the UVF and UDA, which are classified as terrorist organizations. However, it has publicly condemned terrorism and paramilitary violence. Some bands that appear at Orange marches openly display support for loyalist paramilitary groups, such as by carrying paramilitary flags or sporting paramilitary names and emblems.\n\nFor example, prominent loyalist John Gregg was a member of Cloughfern Young Conquerors band, while Coleraine-based Freeman Memorial band was named after a UVF member who was killed by his own bomb. It has also been claimed that paramilitary groups approach certain bands asking the band to carry a flag of their organization with financial assistance sometimes offered for doing so.\n\nA number of prominent loyalist militants were members of the Orange Order at the same time. This includes Gusty Spence, Robert Bates, Davy Payne, David Ervine, John Bingham, George Seawright, Richard Jameson, Billy McCaughey, Robert McConnel and Ernie Elliott.\n\nThe banner of Old Boyne Island Heroes Orange lodge bears the names of John Bingham and Shankill Butcher Robert Bates, who were both members. Another Shankill Butcher, UDR soldier Eddie McIlwaine, was pictured taking part in an Orange march in 2003 with a bannerette of killed UVF member Brian Robinson (who himself was an Orangeman). McIlwaine was also pictured acting as a steward at a 2014 Orange march. An Orange Order spokesman refused to condemn McIlwaine’s membership of the Order.\n\nOn 12 July 1972, at least fifty masked and uniformed members of the Ulster Defence Association (UDA) escorted an Orange march into the Catholic area of Portadown, saluting the Orangemen as they passed. That year, Orangemen formed a paramilitary group called the Orange Volunteers. This group “bombed a pub in Belfast in 1973 but otherwise did little illegal other than collect the considerable bodies of arms found in Belfast Orange Halls”.\n\nPortadown Orangemen allowed known militants such as George Seawright to take part in a 6 July 1986 march, contrary to a prior agreement. Seawright was a unionist politician and UVF member who had publicly proposed burning Catholics in ovens. As the march entered the town’s Catholic district, the RUC seized Seawright and other known militants. The Orangemen attacked the officers with stones and other missiles.\n\nWhen a July 1992 Orange march passed the scene of the Sean Graham bookmakers’ shooting—in which the UDA killed five Catholic civilians—Orangemen shouted pro-UDA slogans and held aloft five fingers as a taunt to residents. Journalists Henry McDonald and Jim Cusack said images of Orangemen “gloating over the massacre” were beamed around the world and were a public relations disaster for the Order. Patrick Mayhew, then Secretary of State for Northern Ireland, said the marchers “would have disgraced a tribe of cannibals”. The incident led to a more concerted effort by residents to have the marches banned from the area.\n\nIn 2007, a banner commemorating UDA member Joe Bratty appeared at an Orange march. Bratty was said to have orchestrated the massacre.\n\nOrange lodges in Britain have also been accused of links with loyalist paramilitaries. In the early years of The Troubles, the Order’s Grand Secretary in Scotland toured Orange lodges for volunteers to “go to Ulster to fight”. Thousands are believed to have volunteered although only a small number travelled to Ulster.\n\nDuring the 1970s an Orangeman—Roddy MacDonald—was the UDA’s ‘commander’ in Scotland. In 1976, senior Scottish Orangemen tried to expel him after he admitted on television that he was a UDA leader and had smuggled weapons to Northern Ireland. However, his expulsion was blocked by 300 Orangemen at a special disciplinary hearing. His successor as Scottish UDA commander, James Hamilton, was also an Orangeman. Many Scottish Orangemen were also convicted for loyalist paramilitary activity, and some Orange meetings were used to raise funds for loyalist prisoners’ welfare groups.\n\nIn 2006, three Liverpool Orangemen were jailed for possession of weapons and UVF membership. Local MP Louise Ellman called for them to be expelled from the Orde.\n\nStoneyford Orange Hall in County Antrim\n\nDuring the Drumcree standoffs, loyalist militants publicly supported the Orangemen and launched waves of violence across NI in protest at the Orange march being blocked. They smuggled homemade weaponry to Drumcree, apparently unhindered by the Orangemen, and attacked police lines. Members of the UDA/UFF appeared at Drumcree with banners supporting the Orangemen. Portadown Orange Lodge said it could not stop such people from gathering, but added that it welcomed any support.\n\nLoyalist Volunteer Force (LVF) leader Billy Wright was frequently seen at Drumcree in the company of Harold Gracey, head of Portadown Orange Lodge. Gracey later attended a rally in support of Wright and refused to condemn the loyalist violence linked to the standoff.\n\nSee Billy Wright\n\nIn the late 1990s, Stoneyford Orange Hall was reported to be a focal point for the Orange Volunteers. Following a police raid on the hall, two Orangemen were convicted for possession of “documents likely to be of use to terrorists”, an automatic rifle, and membership of the Orange Volunteers.\n\nTheir Orange lodge refused to expel them.\n\nAn Orangeman and DUP election candidate with links to the Real UFF in Antrim was jailed in 2013 for his part in a sectarian attack on a Polish family. He was expelled from the Order.\n\nThe Grand Orange Lodge of Ireland has issued several statements condemning violence and paramilitarism. Answering accusations of paramilitary links by Sinn Féin in 2011, an Orange spokesman said: “The Orange Order has consistently condemned all terrorist violence”.\n\nIn 2008, Armagh Orangemen condemned the flying of paramilitary flags. Denis Watson, the then secretary of the Grand Lodge of Ireland, has publicly called for anyone convicted of terrorist offences to be thrown out. Addressing a 12 July demonstration in 2000, Orangeman and Democratic Unionist politician Jeffrey Donaldson said\n\n“It is essential that the Orange Order does not allow the paramilitaries to infiltrate its parades or hijack legitimate protests as a means of flaunting their aggression and engaging in displays of naked intimidation …\n\nThe Orange Order stands for higher ideals than this and must at every opportunity condemn the illegal activities of the paramilitaries and of all those who engage in acts of violence”. Eric Kaufmann, in his book The New Unionism, writes: “The Orange Order actually took a firm stand against violence and paramilitarism throughout the Troubles. This opposition was rooted in the large contingent of Protestant clergymen who are built into the power structure of the Order. Young Orangemen were urged to join the RUC (police) or UDR (local security forces) and to stay away from paramilitaries”\n\nRequirements for entry “An Orangeman should have a sincere love and veneration for his Heavenly Father, a humble and steadfast faith in Jesus Christ, the Saviour of mankind, believing in Him as the only Mediator between God and man. He should cultivate truth and justice, brotherly kindness and charity, devotion and piety, concord and unity, and obedience to the laws; his deportment should be gentle and compassionate, kind and courteous; he should seek the society of the virtuous, and avoid that of the evil; he should honour and diligently study the Holy Scriptures, and make them the rule of his faith and practice; he should love, uphold, and defend the Protestant religion, and sincerely desire and endeavour to propagate its doctrines and precepts; he should strenuously oppose the fatal errors and doctrines of the Church of Rome and other Non-Reformed faiths, and scrupulously avoid countenancing (by his presence or otherwise) any act or ceremony of Roman Catholic or other non-Reformed Worship; he should, by all lawful means, resist the ascendancy, encroachments, and the extension of their power, ever abstaining from all uncharitable words, actions, or sentiments towards all those who do not practice the Reformed and Christian Faith; he should remember to keep holy the Sabbath Day, and attend the public worship of God, and diligently train up his offspring, and all under his control, in the fear of God, and in the Protestant faith; he should never take the name of God in vain, but abstain from all cursing and profane language, and use every opportunity of discouraging those, and all other sinful practices, in others; his conduct should be guided by wisdom and prudence, and marked by honesty, temperance, and sobriety, the glory of God and the welfare of man, the honour of his Sovereign, and the good of his country, should be the motives of his actions.”.\n\nMost jurisdictions require both the spouse and parents of potential applicants to be Protestant, although the Grand Lodge can be appealed to make exceptions for converts. Members have been expelled for attending Roman Catholic religious ceremonies. In the period from 1964 to 2002, 11% of those expelled from the order were expelled for their presence at a Roman Catholic religious event such as a baptism, service or funeral.\n\nThis is based on Reformed Christian theology, which teaches that the Roman Catholic Mass is idolatry, a view promulgated by Protestant Reformers such as Martin Luther.\n\nThe Order takes as its basis the Open Bible and historical Reformed documents such as the Presbyterian Westminster Confession, Anglican 39 Articles and other Protestant creeds.All prospective members must affirm their Reformed Christian Faith prior to membership.\n\nThe Laws and Constitutions of the Loyal Orange Institution of Scotland of 1986 state, “No ex-Roman Catholic will be admitted into the Institution unless he is a Communicant in a Protestant Church for a reasonable period.” Likewise, the “Constitution, Laws and Ordinances of the Loyal Orange Institution of Ireland” (1967) state, “No person who at any time has been a Roman Catholic … shall be admitted into the Institution, except after permission given by a vote of seventy five per cent of the members present founded on testimonials of good character …” In the 19th century, Rev. Mortimer O’Sullivan, a converted Roman Catholic, was a Grand Chaplain of the Orange Order in Ireland. In the 1950s, Scotland also had a former Roman Catholic as a Grand Chaplain, the Rev. William McDermott.\n\nStructure\n\nThe Orange Institution in Ireland has the structure of a pyramid. At its base are about 1400 private lodges; every Orangeman belongs to a private lodge. Each private lodge sends six representatives to the district lodge, of which there are 126. Depending on size, each district lodge sends seven to thirteen representatives to the county lodge, of which there are 12. Each of these sends representatives to the Grand Orange Lodge of Ireland, which heads the Orange Order.\n\nThe Grand Lodge of Ireland has 373 members. As a result, much of the real power in the Order resides in the Central Committee of the Grand Lodge, which is made up of three members from each of the six counties of Northern Ireland (Down, Antrim, Armagh, Londonderry, Tyrone and Fermanagh) as well as the two other County Lodges in Northern Ireland, the City of Belfast Grand Lodge and the City of Derry Grand Orange Lodge, two each from the remaining Ulster counties (Cavan, Donegal and Monaghan), one from Leitrim, and 19 others. There are other committees of the Grand Lodge, including rules revision, finance, and education.\n\nDespite this hierarchy, private lodges are basically autonomous as long as they generally obey the rules of the Institution. Breaking these can lead to suspension of the lodge’s warrant – essentially the dissolution of the lodge – by the Grand Lodge, but this rarely occurs. Private lodges may disobey policies laid down by senior lodges without consequence. For example, several lodges have failed to expel members convicted of murder despite a rule stating that anyone convicted of a serious crime should be expelled, and Portadown lodges have negotiated with the Parades Commission in defiance of Grand Lodge policy that the Commission should not be acknowledged.\n\nPrivate lodges wishing to change Orange Order rules or policy can submit a resolution to their district lodge, which may submit it upwards until it eventually reaches the Grand Lodge.\n\nAll Lodge meetings commence with the reading of the Bible and prayers that non-practising Protestants, Roman Catholics and people of other faiths and none, ‘may become wise unto salvation’ (which is direct quote from 2 Timothy 3:15 in the Bible).\n\nRelated organisations\n\nAn Orangewoman marching in an Orange Order parade in Glasgow.\n\nAssociation of Loyal Orangewomen of Ireland\n\nA distinct women’s organisation grew up out of the Orange Order. Called the Association of Loyal Orangewomen of Ireland, this organisation was revived in December 1911 having been dormant since the late 1880s. They have risen in prominence in recent years, largely due to protests in Drumcree. The women’s order is parallel to the male order, and participates in its parades as much as the males apart from ‘all male’ parades and ‘all ladies’ parades respectively. The contribution of women to the Orange Order is recognised in the song “Ladies Orange Lodges O!”.\n\nIndependent Orange Institution\n\nThe Independent Orange Institution was formed in 1903 by Thomas Sloane, who opposed the main Order’s domination by Unionist Party politicians and the upper classes. The Independent Order originally had radical tendencies, especially in the area of labour relations, but this soon faded. In the 1950s and 60s the Independents focussed primarily on religious issues, especially the maintenance of Sunday as a holy day. With the outbreak of the Troubles, Ian Paisley began regularly speaking at Independent meetings, although he was never a member.\n\nAs a result, the Independent Institution has become associated with Paisley and the Free Presbyterian Church of Ulster and Democratic Unionist Party. Recently the relationship between the two Orange Institutions has improved, with joint church services being held. Some people believe that this will ultimately result in a healing of the split which led to the Independent Orange Institution breaking away from the mainstream Order. Like the main Order, the Independent Institution parades and holds meetings on the Twelfth of July. It is based mainly in County Antrim.\n\nRoyal Black Institution\n\nThe Royal Black Institution was formed out of the Orange Order two years after the founding of the parent body. Although it is a separate organisation, one of the requirements for membership in the Royal Black is membership of the Orange Order and to be no less than 17 years old. The membership is exclusively male and the Royal Black Chapter is generally considered to be more religious and respectable in its proceedings than the Orange Order.\n\nApprentice Boys of Derry\n\nApprentice Boys Of Derry Relief Of Derry Parade 2013\n\nThe Apprentice Boys of Derry exist for their acts during the siege of Derry from James II. Although they have no formal connection with the Orange Order, the two societies have overlapping membership.\n\nThroughout the world\n\nThe Orange Order was brought to other parts of the English-speaking world by Ulster Protestant migrants and missionaries. Grand Lodges have been set up in Scotland, England, Wales, Canada, Australia, New Zealand, the United States, and West Africa. However, the Grand Lodges of Ireland and Scotland have always been the largest by far. The Imperial Grand Orange Council is made up of representatives from all of these various Grand Lodges. It has the power to arbitrate in disputes between Grand Lodges, and in internal disputes when invited.\n\nFamous Orangemen have included Dr Thomas Barnardo, who joined the Order in Dublin; Mackenzie Bowell, who was Grandmaster of the Orange Order of British North America before becoming the Prime Minister of Canada; William Massey, who was Prime Minister of New Zealand; Harry Ferguson, inventor of the Ferguson tractor; and Earl Alexander, the Second World War general. Mohawk chief Dr Oronhyatekha, an Oxford scholar, was also a membe\n\nRepublic of Ireland\n\nAn Orange Hall In Monaghan\n\nThe Grand Orange Lodge of Ireland represents lodges in both Northern Ireland and the Republic of Ireland, where Orangeism remains particularly strong in border counties such as Donegal, Cavan and Monaghan. Before the partition of Ireland the Order’s headquarters were in Dublin, which at one stage had more than 300 private lodges. After partition the Order declined rapidly in the Republic of Ireland. The last 12 July parade in Dublin took place in 1937. The last Orange parade in the Republic of Ireland is at Rossnowlagh, County Donegal, an event which has been largely free from trouble and controversy.\n\nIt is held on the Saturday before the Twelfth as the day is not a holiday in the Republic of Ireland. There are still Orange lodges in nine counties of the Republic of Ireland – counties Cavan, Cork, Donegal, Dublin, Laois, Leitrim, Louth, Monaghan and Wicklow, but most either do not parade or travel to other areas to do so.\n\nIn 2005, controversy was generated when the organisers of Cork’s St Patrick’s Day parade invited representatives of the Orange Order to parade in the celebrations, part of the year-long celebration of Cork’s position of European Capital of Culture. The Order accepted the invitation and was to parade with their wives and children alongside Chinese, Filipino and African community groups in an event designed to recognise and celebrate cultural diversity. Subsequently, after consultation with the Garda Síochána, the Order’s grand secretary, Drew Nelson, said both his organisation and the parade organisers were disappointed that the Order would not be attending the festivities. He added that he welcomed the invitation and hoped the Order would be able to participate in the event next year.\n\nA Church of Ireland clergyman, Rev. David Armstrong, spoke out against the invitation.\n\nIn February 2008 it was announced that the Orange Order was to be granted nearly €250,000 from the Department of Community, Rural and Gaeltacht Affairs. The grant is intended to provide support for members in border areas and fund the repair of Orange halls, many of which have been subjected to vandalism.\n\nScotland\n\nOrange parade in Glasgow (1 June 2003) The Glasgow orange walk 2016\n\nThe Scottish branch of the Orange Order is the largest outside Ireland. The vast majority of Scotland’s lodges are found in the Lowlands, especially the west Central Lowlands (Glasgow, Ayrshire, Renfrewshire, Lanarkshire).\n\nScotland’s first Orange lodges were founded in 1798 by soldiers returning home from Ireland, where they had helped suppress an Irish republican rebellion. The Scottish branch grew swiftly in the early 1800s, when there was an influx of working-class Ulster Protestant immigrants into the Scottish Lowlands. Many of these immigrants saw themselves as returning to the land of their forefathers .\n\nSee Plantation of Ulster\n\nAs such, the Scottish branch has always had strong links with Northern Ireland, and tends to be largest wherever there are most descendants of Irish Protestants. In 1881, three-quarters of its lodge masters were born in Ireland and, when compared to Canada, the Scottish branch has been both smaller (no more than two percent of adult male Protestants in west central Scotland have ever been members) and had more of an Ulster link.\n\nScottish Orangeism was associated with the Tory party. The Order’s political influence crested between the World Wars, but was effectively nil thereafter as the Tory party began to move away from Protestant politics.\n\nAfter the onset of the Troubles, many Scottish Orangemen began giving support to loyalist militant groups in Northern Ireland, such as the Ulster Defence Association (UDA) and Ulster Volunteer Force (UVF). Although the Grand Lodge publicly denounced paramilitary groups, many Scottish Orangemen were convicted of involvement in loyalist paramilitary activity and Orange meetings were used to raise funds for loyalist prisoners’ welfare groups.\n\nThe Grand Orange Lodge of Scotland has long been opposed to Scottish independence. In 2007, 12,000 Orangemen and women marched along Edinburgh‘s Royal Mile to celebrate the 300th anniversary of the Act of Union. It registered as an official participant in the 2014 independence referendum and formed an anti-independence campaign group called British Together.\n\nIn 2004 former Scottish Orangeman Adam Ingram, then Armed Forces Minister, sued George Galloway for stating in his book I’m Not the Only One that Ingram had “played the flute in a sectarian, anti-Catholic, Protestant-supremacist Orange Order band”. Judge Lord Kingarth ruled that the phrase was ‘fair comment‘ on the Orange Order and that Ingram had been a member, although he had not played the flute.\n\nEngland and Wales\n\nAn Orange Order parade in Hyde Park, London, June 2007 Manchester Orange Order at Scarborough Parade 2010\n\nThe Orange Order reached England in 1807, spread by soldiers returning to the Manchester area from service in Ireland. Since then, the English branch of the Order has generally supported the Conservative and Unionist Party.\n\nLiverpool Loyal Orange Lodge – 2015 Whit Monday\n\nThe Orange Order in England is strongest in Liverpool including Toxteth and Garston. Its presence in Liverpool dates to at least 1819, when the first parade was held to mark the anniversary of the Battle of the Boyne, on 12 July. The Order was an important component in the founding of the Liverpool Protestant Party in 1909, keeping an association until the party’s demise in 1974.\n\nThe Orange Order in Liverpool holds its annual Twelfth parade in Southport, a seaside town north of Liverpool. The Institution also holds a Junior parade there on Whit Monday. The Black Institution holds its Southport parade on the first Saturday in August. The parades in Southport have attracted controversy in recent times, with criticism of the disruption that from the closure of main roads.\n\nOther parades are held in Liverpool on the Sunday prior to the Twelfth and on the Sunday after. These parades along with St George’s day; Reformation Sunday and Remembrance Sunday go to and from church. Other parades are held by individual Districts of the Province – in all approximately 30 parades a year.\n\nCymru LOL 1922 was the only Orange lodge in Wales. A new Lodge in Cardiff opened on 17 March 2012, the first new Orange Lodge to be opened there for over 90 years.\n\nCanada\n\nAn Orange parade in Toronto (1860s) Canadian Orange Order: Toronto Orange Parade 2012\n\nFounded by Ogle Gowan, in Brockville Ontario, the Orange Order played an important role in the history of Canada, where it was established in 1830. Most early members were from Ireland, but later many English, Scots, Italians and other Protestant Europeans joined the Order, as well as Mohawk Native Americans. Toronto was the epicentre of Canadian Orangeism: most mayors were Orange until the 1950s, and Toronto Orangemen battled against Ottawa-driven initiatives like bilingualism and Catholic immigration. The Toronto lodge has held an annual Orange parade since 1821, claiming it to be the longest running consecutive parade on the North American continent.\n\nA Brief History: The Orange Order in Canada\n\nA third of the Ontario legislature was Orange in 1920, but in Newfoundland, the proportion has been as high as 50% at times. Indeed, between 1920 and 1960, 35% of adult male Protestant Newfoundlanders were Orangemen, as compared with just 20% in Northern Ireland and 5%–10% in Ontario in the same period.\n\nIn addition to Newfoundland and Ontario, the Orange Order played an important role in the frontier regions of Quebec, including the Gatineau–Pontiac, Quebec region. The region’s earliest Protestant settlement occurred when fifteen families from County Tipperary settled in the valley in Carleton County after 181\n\nThese families spread across the valley, settling towns near Shawville, Quebec.[173] Despite these early Protestant migrants, it was only during the early 1820s that a larger wave of Irish migrants, many of them Protestants, came to the Ottawa valley region. Orangism developed throughout the region’s Protestant communities, including Bristol, Lachute– Brownsburg, Shawville and Quyon\n\nAfter further Protestant settlement throughout the 1830s and 40s, the Pontiac region’s Orange Lodges developed into the largest rural contingent of Orangism in the Province.[ The Orange Lodges were seen as community cultural centres, as they hosted numerous dances, events, parades, and even the teaching of step dancing Orange Parades still occur in the Pontiac-Gatineau- Ottawa Valley area; however, not every community hosts a parade. Now one larger parade is hosted by a different town every year\n\nUnited States\n\nA picture of the Orange Order headquarters in New York City during the 1871 riot American Orange Lodge The Twelfth – Magherafelt 2006\n\nParticipation in the Orange Institution was not as large in the United States as it was in Canada. In the early nineteenth century, the post-Revolutionary republican spirit of the new United States attracted exiled Protestant United Irishman such as Wolfe Tone and others Most Protestant Irish immigrants in the first several decades of the century were those who held to the republicanism of the 1790s, and who were unable to accept Orangeism. Loyalists and Orangemen made up a minority of Irish Protestant immigrants during this period.\n\nAmerica offered a new beginning, and “…most descendents of the Ulster Presbyterians of the eighteenth century and even many new Protestant Irish immigrants turned their backs on all associations with Ireland and melted into the American Protestant mainstream.”\n\nThe first “Orange riot” on record was in 1824, in Abingdon, New York, resulting from a 12 July march. Several Orangemen were arrested and found guilty of inciting the riot. According to the State prosecutor in the court record, “the Orange celebration was until then unknown in the country”. The immigrants involved were admonished: “In the United States the oppressed of all nations find an asylum, and all that is asked in return is that they become law-abiding citizens. Orangemen, Ribbonmen, and United Irishmen are alike unknown. They are all entitled to protection by the laws of the countr\n\nMost of the Irish loyalist emigration was bound for Upper Canada and the Canadian Maritime provinces, where Orange lodges were able to flourish under the British flag.\n\nBy 1870, when there were about 930 Orange lodges in the Canadian province of Ontario, there were only 43 in the entire eastern United States. These few American lodges were founded by newly arriving Protestant Irish immigrants in coastal cities such as Philadelphia and New York. These ventures were short-lived and of limited political and social impact, although there were specific instances of violence involving Orangemen between Catholic and Protestant Irish immigrants, such as the Orange Riots in New York City in 1824, 1870 and 1871.\n\nThe Orange riots of 1870 and 1871 killed nearly 70 people, and were fought out between Irish Protestant and Catholic immigrants. After this the activities of the Orange Order were banned for a time, the Order dissolved, and most members joined Masonic lodges. After 1871, there were no more riots between Irish Catholics and Protestants.\n\nIn 1923 the Loyal Orange Institution of the United States of America had 32,862 members in 256 lodges. The office of the “Supreme Grand Secretary” was at 229 Rhode Island Avenue, Washington, D.C.. There was apparently a split in the group in the early 1920s.\n\nQualifications for membership were restrictive. According to their “Declaration of Principles”: “No person who ever was or is a Roman Catholic, or who shall educate, or cause to be educated, his children or any children in his charge, in any Roman Catholic school, convent, nunnery or monastery, shall ever be admitted to membership.”\n\nThe Institution maintained a home for sick and aged members\n\nThere are currently two Orange Lodges in New York City, one in Manhattan and the other in the Bronx.\n\nThe Ulster-Scots LOL 1690 was established in Torrance, California in 1998 It was the first new lodge to be instituted in the US for more than 20 years.\n\nAustralia\n\nGrand Orange Lodge of Australia @ Donegal 2009\n\nThe first Orange Institution Warrant (No. 1780) arrived in Australia with the ship Lady Nugent in 1835. It was sewn in the tunic of Private Andrew Alexander of the 50th Regiment. The 50th was mainly Irish; many of its members were Orangemen belonging to the Regimental lodge and they had secretly decided to retain their lodge warrant when they had been ordered to surrender all military warrants, believing that the order would eventually be rescinded and that the warrant would be useful in Austral\n\nThere are five state Grand Lodges in Australia which sit under the warrant of the Grand Lodge of Australia, the overall governing body for the institution in Australia.\n\nNew Zealand\n\nFormer Orange hall in Auckland, New Zealand. Now a church.\n\nNew Zealand’s first Orange lodge was founded in Auckland in 1842, only two years after the country became part of the British Empire, by James Carlton Hill of County Wicklow. The lodge initially had problems finding a place to meet, as several landlords were threatened by Irish Catholic immigrants for hosting it.\n\nThe arrival of large numbers of British troops to fight the New Zealand land wars of the 1860s provided a boost for New Zealand Orangeism, and in 1867 a North Island Grand Lodge was formed. A decade later a South Island Grand Lodge was formed, and the two merged in 1908.\n\nFrom the 1870s the Order was involved in local and general elections, although Rory Sweetman argues that ‘the longed-for Protestant block vote ultimately proved unobtainable’. Processions seem to have been unusual before the late 1870s: the Auckland lodges did not march until 1877 and in most places Orangemen celebrated the Twelfth and 5 November with dinners and concerts. The emergence of Orange parades in New Zealand was probably due to a Catholic revival movement which took place around this time. Although some parades resulted in rioting, Sweetman argues that the Order and its right to march were broadly supported by most New Zealanders, although many felt uneasy about the emergence of sectarianism in the colony.\n\nFrom 1912 to 1925 New Zealand’s most famous Orangeman, William Massey, was Prime Minister. During World War I Massey co-led a coalition government with Irish Catholic Joseph Ward. Historian Geoffrey W. Rice maintains that Bill Massey’s Orange sympathies were assumed rather than demonstrated.\n\nTe Ara: The Encyclopaedia of New Zealand argues that New Zealand Orangeism, along with other Protestant and anti-Catholic organisations, faded from the 1920s.The Order has certainly declined in visibility since that decade, although in 1994 it was still strong enough to host the Imperial Orange Council for its biennial meeting. However parades have ceased, and most New Zealanders are probably unaware of the Order’s existence in their country. The New Zealand Order is unusual in having mixed-gender lodges, and at one point had a female Grand Master.\n\nWest Africa\n\nGhana\n\nThe Orange Order in Ghana was founded by Ulster-Scots missionaries some time during the early twentieth century, and is currently supported by the Institute of Ulster Scots Studies . Its rituals mirror those of the Orange Order in Ulster, though it does not place restrictions on membership for those who have Roman Catholic family members. The Orange Order in Ghana appears to be growing, largely based with the growing democracy there.\n\nNigeria\n\nThe first Orange Lodge in Nigeria was the Lagos Fine Blues LOL 801, which was first listed in 1907 in the returns of Woolwhich District 64 to the Grand Orange Lodge of England. Altogether there were three male lodges and one female lodge. They all appear to have died out some time in the 1960s, due to political unrest. Conversely the Ghana lodges increased greatly in popularity with the return of democracy.\n\nTogo\n\nIn 1915 John Amate Atayi, a member of the Lagos Fine Blues LOL 801 moved to Lome, Togo, for work. Here he founded the Lome Defenders of the Truth LOL 867, under warrant of the Grand Orange Lodge of England. In 1916 a second lodge, Paline Heroes LOL No 884 was constituted.\n\n‘Diamond Dan’\n\nAs part of the re-branding of Orangeism to encourage younger people into a largely ageing membership, and as part of the planned rebranding of the July marches into an ‘Orangefest’, the ‘superhero’ Diamond Dan was created – named after one of its founding members, ‘Diamond’ Dan Winter – Diamond referring to the Institution’s formation at the Diamond, Loughgall, in 1795.\n\nInitially unveiled with a competition for children to name their new mascot in November 2007 (it was nicknamed ‘Sash Gordon‘ by several parts of the British media); at the official unveiling of the character’s name in February 2008, Orange Order education officer David Scott said Diamond Dan was meant to represent the true values of the Order: “…the kind of person who offers his seat on a crowded bus to an elderly lady unless, of course, she is catholic, Irish or vaguely human. He won’t drop litter and he will be keen on recycling”. There were plans for a range of Diamond Dan merchandise designed to appeal to children.\n\nThere was however, uproar when it was revealed in the middle of the ‘Marching Season’ that Diamond Dan was a repaint of illustrator Dan Bailey‘s well-known “Super Guy” character (often used by British computer magazines), and taken without his permission, leading to the character being lampooned as “Bootleg Billy”.\n\nOrange Man Funny Video Clip\n\nList of members\n\nGrand Masters [ e\n\nGrand Masters, of the Grand Orange Lodge of Ireland:[207]\n\nLinks\n\nGRAND LODGES\n\n\n\nGrand Orange Lodge of Ireland\n\nGrand Orange Lodge of Canada\n\nGrand Orange Lodge of England\n\nGrand Orange Lodge of Scotland\n\nLoyal Orange Institution of America\n\nOther lodges\n\n36th (Ulster) Division Memorial L.O.L. 1914\n\n36th Ulster Division L.O.L. 977\n\nBoyne Obelisk L.O.L. 1690\n\nDublin and Wicklow District L.O.L.\n\nPlymouth District L.O.L. 64\n\nSomme Memorial L.O.L. 842\n\nRising Son’s of William (Queen’s University) L.O.L. 1845\n\nRoyal York L.O.L 145\n\nOther sites of Interest\n\n\n\nBBC Northern Ireland – Williamite History\n\nBoyne Foundation\n\nRoyal Black Institution\n\nThe Associated Clubs of the Apprentice Boys of Derry\n\nDan Winter’s Cottage\n\nThe Somme Association\n\nThe Somme Association\n\nUlster – The “Northern Ireland” Question Explained"}, {"url": "https://www.irishnews.com/news/northernirelandnews/2022/03/16/news/former-county-grand-master-of-the-orange-lodge-george-chittick-has-died-2615497/", "page_content": "George Chittick speaking in 2014 at a protest on the Woodvale Road. Picture by Pacemaker Press\n\nA FORMER county grand master of the Orange Order and stalwart of the Twaddell Avenue camp protest has died.\n\nGeorge Chittick was last night described as a \"gentleman\" as tributes were paid following his death on Monday.\n\nMr Chittick, who was originally from the loyalist Sandy Row area of Belfast, was county grand master from 2013 to 2018.\n\nHe was at the helm during a turbulent time for the institution, particularly during the stand-off at Twaddell Avenue in north Belfast.\n\nLoyalist protesters manned the camp for almost three years after the Parades Commission prevented Orangemen from passing Ardoyne along a stretch of Crumlin Road as they returned from the 2013 Twelfth demonstrations.\n\nThe Grand Orange Lodge of Ireland last night said its \"thoughts and prayers\" were with the family of Mr Chittick, who had \"passed away after a long battle with illness\". Other tributes posted on social media described him as \"an absolute example of a true and loyal Orangeman\" and a \"gentleman\".\n\nLinfield Football Club also paid tribute to Mr Chittick, who was a lifelong supporter.\n\n\"George was a well-known figure at Windsor Park and further afield and in recent years he lived in the Erinvale area of south Belfast,\" the club said.\n\n\"His roots lay in the Roden Street area close to Windsor Park and he was great friends with another major character from the area - the late Frankie Taylor, the Linfield director who sadly passed away several years ago.\"\n\nA service of thanksgiving is due to take place at Lowe Memorial Church on Monday at noon followed by committal at Roselawn Crematorium at 1.20pm. He is survived by his children Darren and Pamela and wider family circle."}, {"url": "https://www.goli.org.uk/ourpeople", "page_content": "Grand Lodge Officers and Staff\n\nGrand Lodge Officers\n\nThe Senior Management Team is responsible for the day-to-day operation of the Grand Orange Lodge of Ireland and Staff.\n\nElected Annually by the Membership, the Grand Master, Deputy Grand Master, Grand Treasurer and Grand Secretary come from a variety of backgrounds and broad geographic spread.\n\n​\n\nTwo Assistant Grand Masters are appointed every three years by the sitting Grand Master and assist the Grand Master in his role, including representing him at functions and events."}, {"url": "https://www.nytimes.com/2008/06/16/us/16land.html", "page_content": "WELLSBURG, W.Va.\n\nOn the first and third Monday of every month \u0097 except in summer months when only one Monday will do \u0097 in an old building on a downtown street wanting for bustle, the Ancient, Free and Accepted Masons of Wellsburg Lodge No. 2 meet. Members only, and only men.\n\nTheirs is not to be confused with other fraternal organizations on other quiet streets. The Loyal Order of Moose Lodge No. 1564, say, whose ham loaf and D.J. nights and fish fry and karaoke nights might be of concern to the local rescue squad. No, the fun-loving Moose should never be confused with the secret-loving Masons.\n\nFor more than 20 years, among the most faithful Masons here in Wellsburg was Frank J. Haas: administrative law judge, active Presbyterian, Mensa member, single. He would come down the hill from his house, walk through the lodge’s doors and instantly become Past Master of Lodge No. 2, Past Grand Master of Masons of the State of West Virginia, Brother Haas.\n\nBut at a Monday night meeting several months ago, Brother Haas was summoned to the center of the room in this, his mother lodge. In front of men he has known all his life, including his father, he was expelled; given the “Masonic Death Sentence.”"}, {"url": "https://www.ugle.org.uk/about-us/ugle-governance", "page_content": "STEVEN VARLEY Close\n\nSteven Varley was born in Derby in 1953 and educated at Denstone College and Liverpool University where he read Law.\n\nHe married in 1988 and has two grown-up children.\n\nOn graduating, and qualifying as a solicitor, he practiced in Derby and Nottingham, initially in all aspects of criminal law including legal aid then specialising in professional misconduct, regulatory and disciplinary work eventually becoming senior partner of his firm. He retired in 2018.\n\nSteven was a Governor and Chair of Governors for the Denstone College Preparatory School for many years and is a Fellow of the Woodard Corporation. In his spare time, he rowed and played senior rugby for Derby, New Brighton, Nottingham, and the combined county sides of Notts, Lincs and Derbys (Three Counties). He still retains a keen interest in rugby, is a Vice President of Derby Rugby Club and heavily involved with the Derby Bucks Mixed Ability Rugby Squad.\n\nHe was initiated into the St Werburga Lodge No 4147 in Derby on 30th December 1983 by his father who had also been initiated into the Lodge by his father. Steven’s grandfather was the fourth initiate into St Werburga Lodge in the first year of its existence. In 2021, Steven had the great privilege of presiding over the Lodge’s delayed Centenary.\n\nIn 2015 Steven was appointed Provincial Grand Master for Derbyshire. He was appointed to the Board of General Purposes by the Grand Master in September 2020 and is also a member of the Membership Working Party, the GMCCC Working Party and chairs the Pathway Working Party.\n\nBoth before and during his tenure as PGM, he has been an active supporter and advocate for the needs of disadvantaged and disabled children, men and women and carers. This is an interest and commitment close to his heart.\n\nHe was appointed as an Assistant Grand Master in 2023.\n\nWhat is your most memorable experience in Freemasonry?\n\nOn the night of my initiation hearing my father’s voice and then, when I was able to look around, realising how many members of the rugby club, my old school and the rowing club were present.\n\nDescribe Freemasonry in three words\n\nFun, friendship, stability.\n\nWho are your three dream dinner party guests?\n\nTina Turner – I love her singing and at 70+, she is still going strong; Lord Denning, who I have always admired as a lawyer since my university days and finally, Colin ‘Pinetree’ Meads who was just a great New Zealand rugby player."}]}