{"Carter Henry Harrison Sr. was assassinated by a disgruntled office seeker in 1893.": [{"url": "https://www.history.com/news/7-things-you-may-not-know-about-the-1893-chicago-worlds-fair", "page_content": "1. Chicago had to beat out a number of other cities to get the fair.\n\nIn the late 1880s, Chicago, St. Louis, New York and Washington, D.C. all submitted bids to host the 1893 fair, but the race was soon narrowed to New York and Chicago. Big Apple financial titans including Cornelius Vanderbilt, William Waldorf Astor and J. P. Morgan pledged to raise $15 million to cover the city’s expenses, with Chicago’s mercantile and meatpacking millionaires Marshall Field, Philip Armour and Gustavus Swift following suit. But when Lyman Gage, president of one of the largest banks in the Midwest, arranged for millions more in financing, momentum swung Chicago’s way and the U.S. Congress, which was in charge of the selection, awarded the city the exposition.\n\n2. Unbeknownst to festival-goers, there was a mass murderer in their midst.\n\nChicago was home to a serial killer during the fair. For several years before and during the exposition, Herman Mudgett, aka H.H. Holmes, was busily luring victims (including a number of fairgoers) to a three-story, block-long building, later known as the “Murder” Castle, where they were tortured, mutilated and killed. Although Holmes’ heinous crimes weren’t discovered until after the fair ended, it’s believed that he was responsible for dozens of deaths in Chicago, and may have killed as many as 200 people nationwide before his murderous spree ended with his 1894 arrest. Holmes quickly became a celebrity, and was paid more than $200,000 in today’s money to pen accounts of his crimes for the Hearst newspaper chain.\n\n3. Another murder also made headlines.\n\nOn October 28, just two days before the exposition was set to close, Chicago’s recently re-elected mayor, Carter Harrison Sr., was shot and killed by a disgruntled—and deranged—office seeker, Patrick Eugene Prendergast, who believed he was owed a political appointment by the mayor. With the city in shock, the fair’s organizers quickly decided to cancel the lavish closing ceremony in favor of a public memorial to the city’s popular slain leader.\n\n4. The fair produced a number of firsts.\n\nAmong the well-loved commercial products that made their debut at the Chicago World’s Fair were Cream of Wheat, Juicy Fruit gum and Pabst Blue Ribbon beer. Technological products that would soon find their way into homes nationwide, such as the dishwasher and fluorescent light bulbs, had early prototype versions on display in Chicago as well.\n\nThe U.S. government also got in on the act, issuing the country’s first postcards and commemorative stamps and two new commemorative coins: a quarter and half dollar. The half dollar featured Christopher Columbus, in whose honor the fair had been staged, while the quarter depicted Queen Isabella of Spain, who had funded Columbus’ voyages—making it the first U.S. coin to honor a woman.\n\n5. A Ferris wheel saved the fair from financial ruin.\n\nDespite the money raised by private investors and the U.S. government,, squabbling amongst the organizers and numerous construction delays resulted in a huge budget deficit. Another costly mistake was the refusal to allow showman William “Buffalo Bill” Cody and his troupe of sharpshooters, cowboys and Native American performers to appear at the fair. A disgruntled Cody brought his Wild West extravaganza to Chicago anyway, setting up shop right outside the fairgrounds and siphoning off visitors.\n\nThe fair’s precarious finances received a boost in June 1893 with the long-awaited debut of a new invention from Pittsburgh-based bridge builder and steel magnate George Washington Gale Ferris Jr. Intended to rival the highlight of the 1889 fair in Paris (the Eiffel Tower), Ferris’ 264-foot-tall wheel was an engineering marvel. It could fit 2,160 people at a time, and cost 50 cents to ride—twice the price of a ticket to the fair itself. The world’s first Ferris wheel proved so popular it was moved to Chicago’s North Side, where it remained in operation for 10 years before it was sold to the organizers of the 1904 World’s Fair in St. Louis, Missouri.\n\n6. It was the first exposition to have national pavilions.\n\nNearly 50 foreign countries and 43 states and territories were represented in Chicago. American pavilions touted the country’s diverse history, food and culture with exhibits like Virginia’s replica of George Washington’s Mount Vernon estate, a century-old palm tree from California, a massive stained glass display by Louis Comfort Tiffany and a full-service Creole restaurant from Louisiana. Philadelphia even sent the Liberty Bell, as well as two replicas: one in rolled oats and one made of oranges. Not to be outdone, Norway sailed a full-sized replica of a Viking ship across the ocean for the fair, and German industrial giant Krupp spent the equivalent of more than $25 million in today’s money to mount a massive artillery display including a number of weapons that would later be used in World War I.\n\n7. The Chicago World’s Fair played a key role in the creation of the City Beautiful movement.\n\nAt the core of the fair was an area that quickly became known as the White City for its buildings with white stucco siding and its streets illuminated by electric lights. Buildings and monuments by Charles McKim, Daniel Burnham, Augusts Saint-Gaudens and Richard Morris Hunt, along with lush landscaping by Frederick Law Olmsted, the designer of New York’s Central Park, left a lasting impression on municipal planners looking for a way to bring open spaces and grand public buildings into crowded cities. Chicago itself was one of the first cities to adopt aspects of the new City Beautiful movement. Dozens of other cities across the country followed its lead, most notably Washington, D.C., where by 1902, plans were in place for a redesign of the city center that would result in the creation of the National Mall."}, {"url": "https://simple.wikipedia.org/wiki/Carter_Harrison,_Sr.", "page_content": "Carter Henry Harrison, Sr. (February 15, 1825 – October 28, 1893) was an American politician who was mayor of Chicago from 1879 until 1887; he was elected to a fifth term in 1893 but was assassinated before completing his term.\n\nHe previously served two terms in the United States House of Representatives. Harrison was the first cousin twice removed of President William Henry Harrison. He is also related to President Benjamin Harrison. His son, Carter Harrison, Jr. would later become Mayor of Chicago.\n\nHarrison was born on February 15, 1825 in Fayette County, Kentucky.[1] He studied at Yale University. He was married two times and secretly engaged to another before his death. Harrison died on October 28, 1893 after being shot and killed in his home in Chicago, Illinois, aged 68.\n\n\n\n"}, {"url": "https://www.findagrave.com/memorial/8704/Carter-Henry-Harrison", "page_content": "There is a problem with your email/password.\n\nWe’ve updated the security on the site. Please reset your password.\n\nYour account has been locked for 30 minutes due to too many failed sign in attempts. Please contact Find a Grave at [email protected] if you need help resetting your password.\n\nThis account has been disabled. If you have questions, please contact [email protected]\n\nEmail not found\n\nPlease complete the captcha to let us know you are a real person.\n\nFound more than one record for entered Email\n\nThere is a problem with your email/password.\n\nYou need to confirm this account before you can sign in. Resend Activation Email\n\nWe have sent you an activation email\n\nPlease enter your email to sign in.\n\nPlease enter your password to sign in.\n\nPlease enter your email and password to sign in.\n\nThere is a problem with your email/password.\n\nA system error has occurred. Please try again later.\n\nA password reset email has been sent to EmailID. If you don't see an email, please check your spam folder.\n\nWe encountered an unknown problem. Please wait a few minutes and try again. If the problem persists contact Find a Grave."}, {"url": "https://chicagology.com/notorious-chicago/harrisonmurder/", "page_content": "Notorious Chicago | 1893 Fair Gallery\n\n“Genius is but audacity, and the audacity of Chicago has chosen a star. It has looked upward to it and knows nothing that it fears to attempt and thus far has found nothing that it cannot accomplish.”—Mayor Carter H. Harrison, October 28, 1893\n\nNew York Times, October 29, 1893\n\n\n\nThe Assassin’s Life Saved by the Prompt Action of Pollce In Getting Him Away Before the Excited Crowd Around Mayor Harrison’s Residence Recognized Him—Several Shots Fired by the Assassin at His Victim. Who Was Taken Completely by Surprise—The Mayor’s Last Day on Earth Passed at the World’s Fair Entertaining the Mayors of Other Cities—The Dead Man Was to Have Been Married to a Louisiana Lady Next Week—His Life Ends Almost Simultaneously with the Exposition Which He DId So Much to Aid—Witnesses of the Brutal Murder, and No Inmate of the House but a Waiting Maid Saw the Assassin—Mr. Harrison’s Career as Editor and PolIticIan.\n\nCHICAGO, Oct. 28.-Carler Henry Harrison, Mayor of Chicago, was shot at his residence, 231 Ashland Boulevard. at 8:07 o’clock to-night. and died at 8:47 o’clock.\n\nHis murderer was a disappointed office-seeker named Eugene Patrick Prendergast, who obtained admittance to the Mayor’s home in the guise of a visitor.\n\nThe assassin gave himself up at the Desplaine Street Police Station half an hour later, and was taken in charge by the police and spirited away to some unknown place to prevent any possible attempt by a mob to lynch him.\n\nMayor Harrison had been at the fair during the day to attend. the celebration of American Cities. He returned to his residence at 5 o’clook very weary. the exercises at the Fair Grounds having taxed his energies to their utmost. Dinner was served at 6 o’clook, and after the repast the Mayor retired to the back parlor and lay down on a couch. with the remark that he would take a rest, but that he was to be awakened if any person called or any message was received for him. He fell into a\n\npeaceful sleep.\n\nSoon after 8 o’clock the door bell rang, and the maidservant answered it. She found at the door a small-sized, weazen-faced. smooth-shaven man. who asked if the Mayor was at home. In reply to the maid’s interrogatory, he gave his name as Prendergast. As the name was a familiar one to the maid. she admitted the man to the hall way and closed the door. She then went to the rear parlor where the Mayor was sleeping and awoke him. He did not at once enter the hall where Prendergast was waiting, and the maid had returned to tne servants’ quarters in the basement of the house before the tralledy occurred.\n\nCarter H. Harrison residence\n\n231 Ashland Boulevard\n\nThe house is an old-fashioned double brick, with a hall through the centre, on either side of which various rooms open. From the direction taken by the maidservant when she announced him, Prendergast, who was waiting in the hall, knew in which of the rooms the Mayor was. He apparently grew impatient at the delay, and before the Mayor appeared he had started toward the rear of the hall, intending, in all probability. to enter the room, but just as he was approaching the door the Mayor appeared through the doorway.\n\nPrendergast then delibera.tely placed a large-sized revolver close to the Mayor’s body and fired. The shot struck the Mayor in the abdomen, and. he reeled and fell backward, catching at the side of the doorway as he fell. As he was falling the assassin fired a second time, the bullet striking the Mayor just above the ear. The murderer surveyed his work for an instant, and then fired a tnird time at the prostrate body of his victim. The shot this time struok Mr. Harrison in the left hand.\n\nThe three sbots were all fired as quickly as it was possible with the heavy thirty-eight-calibre revolver which Prendergast had in his hand, and before the other peopie in the house could get to the Mayor’s assistance his murderer turned and fled through the hall out the door, down the long walk between the lawns to the gate and out on Ashland Avenue.\n\nAs he ran down the walk to the street, the gardener who had been aroused by the shooting. ran around the side of the house and tried to overtake him. Prendergast saw his danger from this source, and as he ran fired a shot over his shoulder at his pursuer. It went wide of its mark. but it was effective in keeping the gardener at a distance. The murderer was able to make his escape into the darkness.\n\n–\n\nHe ran away at this time in order to avoid being killed by those who were attracted by the shooting. for half an hour later he gave himself up at the Desplaines Street Police Station.\n\nSergt, Frank McDonald was just receiving over the telephone the news of the Mayor’s death. when he was interrupted by the exclamation,\n\nI am the man who did the shooting!\n\nSergt. McDonald started at the appearance of the man. but he qniokly asked bim to stop inside the railing. The man did so. He was trembling with excitement, but to all appearances, except for the agitation, was perfectly sane. He repeated the remark that he had made on entering the station, to those who quickly gathered about him, he said:\n\nI killed Mayor Harrison!\n\n\n\nI worked hard for him during his campaign for the Mayor, and he promised to make me Corporation Counsel He was elected. but he failed to keep his promise, and I have shot him because he didn’t do as he said he would.\n\nPrendergast still carried in his hand the revolver with which he shot the Mayor. It was taken from him by Sergt. McDonald. He appeared to be about twenty-five years old, about 5 feet 7 inches in height, and of slight build.\n\nThe police officers at the station were afraid that as soon as the cause of the Mayor’s death became generally known a mob would collect to avenge him. Prendergast was therefore not placed in a cell at the Desplaines Street Station, but in charge of four policemen was taken in a carriage to another part of the city and locked up to await the judicial inqUirY into his rash act.\n\nThere were no eye witnesses of the brutal, cold-blooded murder. In the house at the time were Preston Harrison, the Mayor’s youngest son; Sophie Harrison. his daughter; the butler, and three maid servants. Preston Harrison and his sister were in the upper part of the house. The servants were all below stairs, the maid who answered the bell being the only person of those in the house ut the time who caught sight of the murderer. Preston Harrisou was the first to reach the side of his father.\n\n\n\nOn his way down stairs Preston Harrison rang the police call twice. The shots made him aware that some desperate deed had been oonsUlnmated. but he did not know as he called the police that he was summoning them to look for the murderer of his own father. He was overcome by horror and grief, but he immediately went up stairs. where he met his sister Sophie, who was preparing to descend, and gently forced her back to her room, where, with as much care as .was possible, he told her of the awful fate of her father.\n\nW. J. Chalmers of 234 Ashland Boulevard. who was standing at the door of his house, directly opposite the Mayor’s residence, heard the shooting. and calling to his wife that there was trouble over the way, he quickly ran across the street in time to Eee the assassin make his escape. He entered the house and met Preston Harrison just as the young man advanced to the doorway in which the prostrate form of the Mayor lay.\n\nLife was rapidly ebbing away. Blood was flowing freely from the three wounds in the Mayor’s body, and the carpet beneath him was saturated with it. The two men picked Mr. Harrison up and carried him to the couch from which he had arisen to meet his murderer.\n\nMr. Harrison said:\n\nI am shot. Preston, and cannot live. Where is Annie?\n\nMr. Harrison hastily left his father’s side and rushed out upon the street in pursuit= of the assassin. In the meantime Mr. and Mrs. W. J. Chalmers. who live across the street, had started for the Harrison residence, as they had heard the shooting. They saw a man running up Ashland avenue and met tho son Preston in pursuit. Young Mr. Harrison stopped long enough to inform his neighbors of the terrible affair and then started in pursuit of the murderer. Mr. and Mrs. Chalmers hastily entered the house, Mr. Chalmers at once making a pillow of his oyercoat which he placed nnder Mr. Harrison’s head.\n\n“I have been shot and oannot live,” said tbe Mayor, as he gasped for breath.\n\n“You won’t die.” said Mr. Chalmers.\n\n“You have only been shot in the abdomen.”\n\n“No, I have beeu shot in the heart and I know I cannot live.” was the reply.\n\nThose were the last words of Mayor Harrison.\n\nNeighbors gathered about the doorway in great numbers. Only a few of these were admitted to tho house. Thoae within were anxiously waiting the appearance of one other woman, who in a short time was to have become the bride of the man who was at that moment in the throes of death.\n\nMiss Howard hat! been here for several days. She was to have been married to Mayor Harrison Nov. 7 at Biloxi, .Miss., her home. When in this city sho has always visited at the Mayor’s house, and. the two became very much attached to each other. The attachment ripened into love, and early this Summer the engagement was announced. Extensive arrangements were under way for a splendid wedding. A special train was to have borne the party to Biloxi. and fetes were prepared there for their entertainment. Miss Howard came here at this time to finish the preparation of her trousseau. She was to have returned to Biloxi early next week. As usual. she visited at the Mayor’s house, which is presided over by Mrs. Carter H. Harrison, Jr. Miss Howard left tho house after dinner in company with Mr. Carter H. Harrison, Jr. They returned together, but Miss Howard was the first to enter the house. She did so between the files of sympathetic neighbors who had gathered about the house.\n\n\n\nThe unusual crowd and the serious faces of the people in it prepared the two women for some dreadful catastrophe. But up to the time they entered the doorway they had no hint of the real trouble. It would have taken a very callous person to have breathed the story of the crime into their ears at such a time. It was left for the members of the family to break the news. Miss Howard and Mrs. Harrison were met by Preston Harrison at the door, and guided up stairs out of reach of those who had gathered 1n the house. There they were informod of what had taken place. Miss Howard’s grief was pitiable, and Mrs. Harrison fainted away.\n\nNeither Miss Sophie Harrison. Miss Howard, Mrs. Carter Harrison, Jr., nor Carter H. Harrison, Jr., saw Mr. Harrison alive after dinner. Carter H. Harrison. Jr. was down town, and did not return home until the news of his father’s death reached him through the rumors which speedily went flying over the city. Miss Howard and Mrs. Harr1son did not reach the house until after Mayor Harrison had passed away.\n\nThere was the greatest oxcitement all over the city when the news of the murder was bruited about. It raged most hotly in the throng which filled the grounds about the Mayor’s house. This nearly resulted in the lynching of an innocent man. R. Earle Smith, a young wan living at 359 Ashland Avenue. was passing the Mayor’s house just as Prendergast paased in. He noticed Pendergast, and wondered if the man were a politician or somebody who was helping the Mayor in his preparations for his approaching wedding. Just after Mr. Smith had passed the house, he heard two shots, and he felt at once that= the man whom he had seen enter the Mayor’s residence was responsible. He quickly made up his mind to lie in wait for him. and catch him as he came out.\n\nWith this end in view, Smith entered a clump of lilac bushes which adorn the grounds in front of the house on eaeh side of the path leading up to the door. When Prendergast appeared at the door, after killing Mayor Harrison, and ran down the path, Smith sprang from the buahes and attempted to grapple with him.\n\nPrendergast eluded his grasp and, jumping over the fence, ran down Ashland Avenue toward Adams Street. Smith ran after him and followed him as the murderer turned down Adams Street. Smith says that just as be tUrned the corner of Adams Street two more shots were fired in the house. and he turned back, as it seemed impossible for him to cat.ch Prendergast, to see what new trouble was brewing in the ill fated mansion. As he turned into the grounds on his return,. the butler pointed a revolver at him and commanded him to surrender\n\n\n\nSmith tried to explain who he was, but the butler cried out:\n\nHere is the murderer!\n\nThose who ran up took up the cry, and in an instant Smith was surrounded by an angry mob, which, in addition to handling him roughly. threatened him with lynching.\n\nThe police patrol walton which came up in response to Preston Harrison’s call brought several policllmen, one of whom arrested Mr. Smith in spite of his vehement statement that he was only trying to catch the murderer. The policeman finally led\n\nMr. Smith to tho house, where he was readily identified as a neighbor, and his\n\nrelease. of course, followed.\n\nWhen Prendergast was removed from the Desplaines 8treet Police Station he was conveyed in a carriage to the Central Police Station in the City Hall. Here he was taken in charge by Inspector Shea, who at once proceeded to catechise him as to the incidents leading up to the crime.\n\nPrendergast said that he made up his mind to kill the Mayor yesterday. He went out on Milwaukee Avenue and purchased a second-hand revolver at a pawn shop for $5. The revolver was a five-shooter. At 8 o’clock, as nearly as he could remember, he went to the Mayor’s house and rang the bell.\n\n\n\nHow many shots did you fire?\n\n\n\nI fired three shots. That was enough. There was another in the gun.”\n\n\n\nWhat is your full name?\n\n\n\nPatrick Eugene Joseph Prendergast. My mother is a good, innocent woman. She lives over at 609 Jane Streut, west of Seymour. We used to live at 357 Ohio Street.\n\n\n\nDid you ever go to school?\n\n\n\nYes. I’m a good Catholic. I studied at St. Patrick’s School. I know a good many big men. Now, there is Archbishop— —, I forgot his name.\n\n\n\nWhat happened there?” asked the Inspector.\n\n\n\nI told the girl who came to the door that I wanted to see the Mayor. She asked me for my name and I gave it to her, and told her I had particular business with the Mayor.\n\n\n\nWhat happened then?\n\n\n\nWhy the girl went in and told Mr. Harrison that I wanted to see him.\n\n\n\nAnd then?\n\n\n\nI shot him. I didn’t say a word to the Mayor, nor he to me. I shot him and I was justified in doing it.\n\n\n\nBut what did you have against the Mayor?\n\n\n\nI made up my mind to shoot him, and I had some difficulty in doing it. The Mayor failed to fulfill his promise to me to elevate the tracks!\n\n\n\nWhat happened when the Mayor came to the door?\n\n\n\nI don’t remember exactly. I came out and ran away. Men chased me. I jumped on a street car and rode down to Desplaines Street Station. I walked in to the Sergeant’s desk and said, ‘I have killed the Mayor.’\n\n\n\nWho are your relatives?\n\n\n\nI’ve got one brother John. He’s a clerk in the Post Office. My mother and I used to live at 357 Ohio Street.\n\n\n\nWhere do you work?\n\n\n\nI work as a distributor for The Morning Inter Ocean and Evening Post. I am employed by the city circulators of these these papers. J. H. Johnson is the circulator of the Inter Ocean.\n\n\n\nHow old are you?\n\n\n\nWhy, I’m twenty-five. I think I was justified in shooting the Mayor. If I get a fair trial before a fair jury I’ll be acquitted.\n\n\n\nHave you ever studied law?\n\n\n\nNo, I have never studied or practiced. I just put that pistol in my pocket and went over and shot the Mayor.\n\nAt frequent intervals the prisoner squirmed unoasily in his chair and refused for a moment to proeeed. He is a smooth-faced, hollow-cheeked, weak-looking young man, the most prominent feature of his face being a protruding under lip. His whole appearance indicated a depraved and vicious mind. His nose is sharp and crooked, and his hair cut short, sparsely covers his misshapen head.\n\nThe Mayor took a prominent part in the endeavor to provide employment for the unemployed during the exceedingly dull season of last Summer. He did everything in his power to advance the work on municipal improvements in order that the laborers out of work might be provided with employment cleaning the streets, constructing sewers, and laying gas and water mains. At the meetings of the Commmitte of Two Hundred, whioh was appointed by him to take charge of the entire matter of furnishing food and employment for the unemployed, he was found to be alive to the interests of the poor people of the city, fertile in suggestion, and solicitous that the work of relief and of furnishing employment might be begun without delay. Many of the suggestions which were adopted by the committee with such success were made by him.\n\nThe social duties of the Mayor in connection with the World’s Fair duting the entire Summer have been many and exacting, but through them all he carried himself with a dignity and frankness of spirit and action which won him the respect of Chicago’s guests from abroad and the approval of her citizens. One of the first of these was the reception of and entertainmcnt for some days of the Duke of Veragua and his suite. At public functions as well as in the privacy of his own beautiful home on Ashland Boulevard. Mayor Harrison did his share to make the visit of the descendant of Columbus at the World’s Fair a pleasant one.\n\nOn another notable occasion the Mayor also did the honors as the head of a great city in a wav Which left no cause for complaint. This was on the occasion of the reception and entertainment of the= Spanish Infanta. Mayor Harrison’s gallantry was given full expression on all of the public and private functions at which he appeared as the representative of the city which was entertaining the Princess. In connection with the receptions of prominent people and special days at the World’s Fair, Mayor Harrison was called upon to make some forty speeches, and was always in the best of humor, and his speeches were uniformly well received, though they were often criticized.\n\nIllustrations of Assassination of Chicago’s Mayor Harrison from Harper’s Weekly November 11, 1893, From Sketches by Charles Mente and T. Dart Walker.\n\nIllustrations of Mayor Harrison’s Funerals Mayor Harrison from Chicago Tribune November 2, 1893.\n\n\n\n\n\nExcerpted from Chicago Tribune July 14, 1894\n\n\n\nPatrick Eugene Prendergast has paid the penalty of his life for the murder of Carter Henry Harrison. At 11:48 o’clock yesterday morning the trap of the gallows fell from beneath his trembling feet and the rope put an end to his wretched life. He made no speech. He did not speak a word from the time the death march started from the room where he had passed his last night on earth, save for a whispered sentence to the black robed priest who stood beside him on the scaffold. Aside from the trembling of his limbs and the deep breaths which ended in gasps there was no sign from him to show he feared the end.\n\nHis death must have been without pain, as his neck was broken by the fall of six feet and there was not a perceptible movement after the trap was sprung. A jury of physicians occupied two benches just in front of the gallows. When the trap fell County Physician Fortner, who headed the jury, stood beside the shrouded body to determine when life had become extinct. There was a wait of five minutes when the other physicians were called to aid in the examination. His pulse continued to beat for almost ten minutes, then the last flutter ceased and Prendergast was pronounced dead. Another five minutes was passed and then the rope’s end was loosened, the body lowered into a waiting coffin, and all was over. The law had taken its course.\n\nPrendergast Verdict\n\nDecember 29, 1893\n\nPrendergast’s brother appealed the sentence, saying that Eugene was insane. The attorney for the appeal was not-yet-famous Clarence Darrow. It was Darrow’s first murder case–and the only one he ever lost to the executioner. The appeal was denied, and Eugene Prendergast was hanged on July 13, 1894.\n\nFour years after Harrison’s murder, his son–also named Carter Harrison–became mayor of Chicago. Like his father, the younger Harrison would be elected to the office five times.\n\nNOTE:\n\nThe two times that Chicago held a world’s fair, both times the mayor was shot and killed.\n\nAlmost forty years later, in an attempt to kill President-elect Franklin D. Roosevelt, Chicago Mayor, Anton Cermak was shot and killed during a yachting event in Miami, on February 21, 1933, just a few months before the opening of the Century of Progress World’s Fair. The mayor died on March 5th and the murderer, Giuseppi Zangara, was electrocuted on March 20."}, {"url": "https://www.geni.com/people/Carter-Henry-Harrison-III/6000000020320319036", "page_content": "About Carter Henry Harrison III\n\n•GRAD: 1845 Yale College •Event: Elected BET 1879 AND 1887 Mayor of Chicago, IL •Event: Elected BET 1875 AND 1879 U.S. House of Representatives from Illinois •Event: Elected 1893 Mayor of Chicago, IL\n\nhttp://en.wikipedia.org/wiki/Carter_Harrison,_Sr.\n\nCarter Henry Harrison, Sr. (February 15, 1825 – October 28, 1893) was an American politician who served as mayor of Chicago, Illinois from 1879 until 1887; he was subsequently elected to a fifth term in 1893 but was assassinated before completing his term. He previously served two terms in the United States House of Representatives. Harrison was the first cousin twice removed of President William Henry Harrison.\n\nBorn near Lexington, Kentucky to Carter Henry Harrison II and Caroline Russell, he was only a few months old when his father died. He was educated by private tutors, and was graduated from Yale College in 1845 as a member of Scroll and Key. Following graduation, he traveled and studied in Europe from 1851 to 1853 before entering Transylvania College in Lexington, where he earned a law degree in 1855. He was admitted to the bar in 1855 and commenced practice in Chicago; Harrison came to Chicago because he saw it as a land of opportunity.\n\nHarrison ran an unsuccessful campaign in 1872 for election to the Forty-third Congress. Beginning in 1874, he served as a member of the board of commissioners of Cook County. He was elected as a Democrat to the Forty-fourth and Forty-fifth Congresses, and delegate to the 1880 and 1884 Democratic National Conventions.\n\nA Summer's Outing\n\nIn 1890, Harrison and his daughter took a vacation trip from Chicago to Yellowstone National Park and Alaska. His letters from the trip were first published in the Chicago Tribune and later compiled into the book (1891): A Summer's Outing and The Old Man's Story.\n\nAssassination\n\nThe night of the Haymarket Riot in 1886, Harrison walked unmolested through the crowd of anarchists and advised the police to leave the demonstrators alone. The riot was sparked by a bomb, reportedly thrown at police by anarchists. After leaving office, Harrison was owner and editor of the Chicago Times from 1891 to 1893. He was re-elected in 1893, in time for the World's Columbian Exposition. His desire was to show the world the true Chicago, and he appointed 1st Ward Alderman \"Bathhouse\" John Coughlin to sit on the reception committee. On October 28, 1893, two days before the close of the Exposition, Harrison was murdered in his home by Patrick Eugene Prendergast, a disgruntled office seeker. Harrison was buried in Chicago's Graceland Cemetery. Prendergast was hanged on July 13, 1894. Harrison was Chicago's first five-time elected mayor; eventually his son, Carter Harrison, Jr., was also elected mayor five times.\n\nHarrison's career and assassination are closely connected with the World's Columbian Exposition, and are discussed at some length as a subplot to the two main stories (about the fair and serial killer H. H. Holmes) in The Devil in the White City. The celebration of the close of the Exposition was cancelled in lieu of a large public memorial service for Harrison."}, {"url": "https://www.wikitree.com/wiki/Harrison-7632", "page_content": "Carter Henry Harrison Sr.\n\n15 Feb 1825 in Fayette County, Kentucky, United States Bornin\n\nAncestors\n\n[sibling(s) unknown]\n\nSophonisba (Preston) Harrison Husband of— married 12 Apr 1855 in Henderson County, Kentucky\n\nMargaret (Stearns) Harrison Husband of— married after 1877 [location unknown]\n\nDescendants\n\n28 Oct 1893 at age 68 in Chicago, Illinois, United States Diedin\n\nProfile last modified 19 Feb 2022 | Created 19 Aug 2015\n\nThis page has been accessed 1,179 times.\n\nPreceded by\n\n28th Mayor\n\nMonroe Heath\n\n\n\n\n\n\n\n32nd Mayor\n\nHempstead Washburne Carter H. Harrison\n\n\n\n29th Mayor\n\nof Chicago, Illinois\n\n1879-1887\n\n\n\n\n\n\n\n33rd Mayor\n\nof Chicago, Illinois\n\n1893\n\n\n\nSucceeded by\n\n30th Mayor\n\nJohn A. Roche\n\n\n\n\n\n\n\n34th Mayor\n\nGeorge B. Swift\n\nBiography\n\nCarter Harrison Sr. is Notable.\n\nUS House of Representatives 1875-1879; 29th Mayor of Chicago, 1879-1887; 33rd Mayor of Chicago, 1893. Assassinated during the World's Columbian Exposition by Patrick Eugene Prendergast. 1C 2R of William Henry Harrison\n\nIn 1891, Harrison published A Summer's Outing, a collection of letters originally published in the Chicago Tribune. They were written on the trip he took with his daughter across the country to Yellowstone National Park and Alaska.[1]\n\nSources\n\n↑ Wikipedia contributors, \"Carter Harrison Sr.,\" Wikipedia, The Free Encyclopedia, https://en.wikipedia.org/w/index.php?title=Carter_Harrison_Sr.&oldid=906907940 (accessed November 17, 2019).\n\n[1] The Cabells and Their Kin: A Memorial Volume of History, Biography, and Genealogy Alexander Brown January 1, 1895 Houghton, Mifflin & Company: Parents, Birth, Death, Child, Wives, page 519, 521"}, {"url": "https://alchetron.com/Carter-Harrison-Sr.", "page_content": "Carter Henry Harrison Sr. (February 15, 1825 – October 28, 1893) was an American politician who served as mayor of Chicago, Illinois, from 1879 until 1887; he was subsequently elected to a fifth term in 1893 but was assassinated before completing his term. He previously served two terms in the United States House of Representatives. Harrison was the first cousin twice removed of President William Henry Harrison.\n\nContents\n\nBorn near Lexington, Kentucky, to Carter Henry Harrison II and Caroline Russell, he was only a few months old when his father died. He was educated by private tutors, and was graduated from Yale College in 1845 as a member of Scroll and Key. Following graduation, he traveled and studied in Europe from 1851 to 1853 before entering Transylvania College in Lexington, where he earned a law degree in 1855. He was admitted to the bar in 1855 and commenced practice in Chicago; Harrison came to Chicago because he saw it as a land of opportunity.\n\nHarrison ran an unsuccessful campaign in 1872 for election to the Forty-third Congress. Beginning in 1874, he served as a member of the board of commissioners of Cook County. He was elected as a Democrat to the Forty-fourth and Forty-fifth Congresses, and delegate to the 1880 and 1884 Democratic National Conventions.\n\nHarrison married Margarette (or Margaret) E. Stearns in 1882, following the death of his first wife in 1876. She was the daughter of Chicago pioneer Marcus C. Stearns."}, {"url": "https://flickriver.com/photos/chicagocrimescenes/14260920423/", "page_content": "login to see more photos!\n\nFlickriver needs JavaScript to work properly. Please enable JavaScript in your browser.\n\nSmall button: preview:\n\nLarge button: preview:\n\nDynamic badge: Use Flickriver Badge Creator to create a badge linking to any Flickriver view\n\nexample:\n\nTo link to this page, Copy and Paste the following HTML code:"}, {"url": "https://www.nytimes.com/1893/10/29/archives/assassinated-carter-h-harrison-mayor-of-chicago-killed-murderer-in.html", "page_content": "ASSASSINATED; Carter H. Harrison, Mayor of Chicago, Killed. MURDERER IN CUSTODY A Disappointed Office Seeker's Terrible Revenge. NO WORD OF WARNING. The Mayor Dies in Less Than an Hour. The Assassin's Life Saved by the Prompt Action of Police in Getting Him Away Before the Excited Crowd Around Mayor Harrison's Residence Recognized Him -- Several Shots Fired by the Assassin at His Victim, Who Was Taken Completely by Surprise -- The Mayor's Last Day on Earth Passed at the World's Fair Entertaining the Mayors of Other Cities -- The Dead Man Was to Have Been Married to a Louisiana Lady Next Week -- His Life Ends Almost Simultaneously with the Exposition Which He Did So Much to Aid -- No Witnesses of the Brutal Murder, and No Inmate of the House but a Waiting Maid Saw the Assassin -- Mr. Harrison's Career as Editor and Politician.\n\nhttps://www.nytimes.com/1893/10/29/archives/assassinated-carter-h-harrison-mayor-of-chicago-killed-murderer-in.html Give this article\n\n\n\n"}, {"url": "https://florencekelley.northwestern.edu/legal/mayors/harrisonsr/", "page_content": "Carter Henry Harrison Senior, who served five terms and eight years as Mayor of Chicago until he was assassinated in 1893, came from a family which was, steeped in American history and political involvement dating back to 1635, when the patriarch of the Harrison family was Clerk of the Virginia Council. Carter Henry Harrison’s great grandmother Susannah Randolph was a descendant of Pocahontas. What is remarkable, however, is that in Carter Henry Harrison’s family line one finds a signator of the Declaration of Independence, and two U.S. Presidents. Carter Henry Harrison’s great uncle, Benjamin Harrison not only signed the Declaration of Independence, but also introduced a resolution of independence to congress. One of Benjamin Harrison’s sons, William Henry Harrison went on to become President of the United States in 1841, and President Harrison’s great grandson Benjamin Harrison became President of the United States in 1889.\n\nWhile Carter Henry Harrison Senior’s father’s side was noted for its politicians, his mother’s side was distinguished for its soldiers. Carter Henry Harrison Senior’s mother was Caroline Evalind, whose father, grandfather, and great grandfather were all notable soldiers in their time. Her great grandfather was an officer in the English Army, her grandfather was General William Russell famous for fighting the Indian Wars, and her father Colonel Russell, a cavalry captain, is credited for leading the attack in the Revolutionary War Battle, King’s Mountain.\n\nCarter Henry Harrison Senior was born February 15th, 1825 to Carter Henry Harrison II and Caroline Evalind. Although, Carter Henry Harrison Senior is known as “senior,” he is technically the III in his family to bear the name. He grew up in Elk Hill, Kentucky in a log cabin. His father died, shortly after his birth, and his mother schooled him until he was 15. At this time, he went to Lexington to study under Dr. Lewis Marshall who was the brother of Supreme Court Justice Thomas Marshall. In 1845 he began attending Yale, and after graduating at age 20, studied law at Transylvania University in Lexington, Kentucky. After one year of law school, however, he decided to return home to live the life of a farmer on his family’s plantation. In 1851, Harrison traveled Europe for two years where he began to develop an affinity for urban life. When he returned to the states he finished his law degree and graduated in 1853. The same year he married Sophonisba Preston and moved first to St. Louis and then finally to Chicago.\n\nAlthough Harrison intended to open a law office, he became involved in buying and selling real estate. However, a financial storm in 1857 affected him terribly and Harrison spent the next ten years trying to get on his feet financially. During this time, five of his children died in infancy.\n\nIn an attempt to move away from real-estate, Harrison made an unsuccessful attempt at running for the lower house of the State legislature, but it was not until the great Chicago Fire in 1871 that the catalyst for Harrison’s life as politician would emerge. Harrison’s support for the “fire proof ticket,” a ticket composed of both Democratic and Republican nominations for city offices, gained him a nomination and election as County Commissioner. After serving a three-year term as County Commissioner, Harrison decided to run again for congress. He was narrowly elected as the Democratic Representative for 44th National Congress, in March of 1875. Harrison quickly developed a reputation as a skilled orator, and was re-elected for a second term. During his re-election campaign his wife died suddenly of illness and Harrison immersed himself in his work. He served in congress until the end of his second term in 1878, and chose not to seek a third term. Harrison would lament later in life that he never fully enjoyed the life of a congressman. Harrison did not abandon statesmanship all together; in fact, he barely missed a beat. In the spring of 1879, Harrison was elected to be the mayor of Chicago.\n\nHarrison was elected to the office of mayor five times, serving from 1879-1887 and then again in 1893.. The time that Harrison served in office was a time of expansion and development for Chicago. When Harrison arrived in Chicago in 1855 the public revenue for taxation was slightly over $200,000; by the time of his death this number exceeded $15,000,000. Harrison was known, however, as a champion of people’s rights. With railroads being built from one end of Chicago to the other, Harrison continually fought for workers’ rights against the railroad companies that tried to usurp them. Harrison’s commitment to the public is epitomized by his role in the Haymarket Riot. The night of March 4th, 1886 an unknown person threw a bomb at police officers during a workers’ strike organized by local socialist party members. Harrison was quick to speak out against anti-socialist language in the media, not only saying that socialists did not sympathize with the bomb throwers, but also asserting that socialists represented the “workers, thinkers, and writers” of the United States.\n\nHarrison made an unsuccessful bid for Governor of Illinois in 1884, and was only narrowly re-elected to his 4th term as mayor; he stepped down at the end of that term. Harrison decided he wanted to get back in public life, however, and ran for the mayorship unsuccessfully in 1891. Not to be easily dissuaded, however, he ran again, and was re-elected in 1893 in time to host the World’s Columbian Exposition in Chicago. His term, however, was cut short by assassination. Two days before the World Fair opened, on October 28th, 1893, failed politician Patrick Eugene Prendergast killed Carter Henry Harrison in Harrison’s home. Earlier that day Harrison had announced in a speech “I intend to live for more than half a century! And at the end of that half century London will tremble lest Chicago shall surpass her.” Carter Henry Harrison Senior was the first Chicago Mayor to serve five terms; the next Mayor of Chicago to serve as long a term, was his son Carter Henry Harrison II.\n\nNext: Johnny Powers\n\nSources:\n\nAbbot, Willis John. Carter Henry Harrison: A Memoir. New York: Dodd, Mead & Company, 1895. Kantowicz, Edward R. “Carter H. Harrison II: The Politics of Balance.” Ed. Paul M. Green and Melvin G. Holli. The Mayors: The Chicago Political Tradition. Carbondale: Southern Illinois University Press, 2005."}]}