{"Carter Henry Harrison Sr. was born in Lexington, Kentucky.": [{"url": "https://www.biographies.net/biography/carter-harrison%2C-sr./m/0b183", "page_content": "Who was Carter Harrison, Sr.?\n\nCarter Henry Harrison, Sr. was an American politician who served as mayor of Chicago, Illinois from 1879 until 1887; he was subsequently elected to a fifth term in 1893 but was assassinated before completing his term. He previously served two terms in the United States House of Representatives. Harrison was the first cousin twice removed of President William Henry Harrison.\n\nBorn near Lexington, Kentucky to Carter Henry Harrison II and Caroline Russell, he was only a few months old when his father died. He was educated by private tutors, and was graduated from Yale College in 1845 as a member of Scroll and Key. Following graduation, he traveled and studied in Europe from 1851 to 1853 before entering Transylvania College in Lexington, where he earned a law degree in 1855. He was admitted to the bar in 1855 and commenced practice in Chicago; Harrison came to Chicago because he saw it as a land of opportunity.\n\nHarrison ran an unsuccessful campaign in 1872 for election to the Forty-third Congress. Beginning in 1874, he served as a member of the board of commissioners of Cook County."}, {"url": "https://www.wikitree.com/wiki/Harrison-1108", "page_content": "Is Carter your ancestor? Please Login to collaborate or comment the profile manager, ask our community of genealogists a question.\n\nDNA Connections\n\nIt may be possible to confirm family relationships with Carter by comparing test results with other carriers of his Y-chromosome or his mother's mitochondrial DNA . However, there are no known yDNA or mtDNA test-takers in his direct paternal or maternal line. It is likely that these autosomal DNA test-takers will share some percentage of DNA with Carter:\n\nHave you taken a DNA test? If so, login to add it. If not, see our friends at Ancestry DNA."}, {"url": "https://www.findagrave.com/memorial/8704/Carter-Henry-Harrison", "page_content": "There is a problem with your email/password.\n\nWe’ve updated the security on the site. Please reset your password.\n\nYour account has been locked for 30 minutes due to too many failed sign in attempts. Please contact Find a Grave at [email protected] if you need help resetting your password.\n\nThis account has been disabled. If you have questions, please contact [email protected]\n\nEmail not found\n\nPlease complete the captcha to let us know you are a real person.\n\nFound more than one record for entered Email\n\nThere is a problem with your email/password.\n\nYou need to confirm this account before you can sign in. Resend Activation Email\n\nWe have sent you an activation email\n\nPlease enter your email to sign in.\n\nPlease enter your password to sign in.\n\nPlease enter your email and password to sign in.\n\nThere is a problem with your email/password.\n\nA system error has occurred. Please try again later.\n\nA password reset email has been sent to EmailID. If you don't see an email, please check your spam folder.\n\nWe encountered an unknown problem. Please wait a few minutes and try again. If the problem persists contact Find a Grave."}, {"url": "https://history.house.gov/People/Listing/H/HARRISON,-Carter-Henry-(H000267)/", "page_content": "Abraham Lincoln Presidential Library\n\nSpringfield, IL\n\nPapers: 1861, 1 item. A letter from Harrison to an unidentified recipient written on June 24, 1861. In the letter, Harrison makes arrangements for repaying a financial obligation.\n\nUniversity of Chicago Library\n\nChicago, IL\n\nPapers: Butler-Gunsaulus collection, 1527-1915, 3.25 linear feet.. An April 18, 1893 letter from Harrison to Edward B. Butler thanking him for a complimentary ticket to attend the World's Columbian Exposition.\n\nUniversity of Kentucky\n\nSpecial Collections and Digital Programs\n\nLexington, KY\n\nPapers: In the Jeffrey family papers, 1818-1903, 1.35 cubic feet. Subjects covered include Harrison.\n\nWisconsin Historical Society\n\nArchives Division\n\nMadison, WI"}, {"url": "http://famousamericans.net/carterhenryharrison/", "page_content": "Appleton's Cyclopedia of American Biography, edited by James Grant Wilson, John Fiske and Stanley L. Klos. Six volumes, New York: D. Appleton and Company, 1887-1889 and 1999. Virtualology.com warns that these 19th Century biographies contain errors and bias. We rely on volunteers to edit the historic biographies on a continual basis. If you would like to edit this biography please submit a rewritten biography in text form . If acceptable, the new biography will be published above the 19th Century Appleton's Cyclopedia Biography citing the volunteer editor\n\nVirtual American Biographies\n\nOver 30,000 personalities with thousands of 19th Century illustrations, signatures, and exceptional life stories. Virtualology.com welcomes editing and additions to the biographies. To become this site's editor or a contributor Click Here or e-mail Virtualology here.\n\nCarter Henry Harrison\n\nHARRISON, Carter Henry, politician, born in Fayette county, Kentucky, 15 February, 1825. He was graduated at Yale in 1845, read law, engaged in farming, travelled for two years in foreign countries, and, after receiving his degree from Transylvania law school, Lexington, Kentucky, settled in Chicago, where he engaged in real estate operations. After the great fire of 1871 he served as county commissioner for three years. After returning from a second European journey, in 1874, he was elected to congress, as a Democrat, by so close a vote that his competitor, who had defeated him in the preceding election, gave notice of contest. He was reelected, and when his second term was ended, in 1879, was chosen mayor of Chicago, in which office he was continued for four biennial terms.\n\nEdited Appletons Encyclopedia, Copyright © 2001 Virtualology TM\n\nStart your search on Carter Henry Harrison.\n\n\n\nUnauthorized Site: This site and its contents are not affiliated, connected, associated with or authorized by the individual, family, friends, or trademarked entities utilizing any part or the subject's entire name. Any official or affiliated sites that are related to this subject will be hyper linked below upon submission and Evisum, Inc. review."}, {"url": "https://en-academic.com/dic.nsf/enwiki/25381", "page_content": "Infobox_Congressman\n\nname = Carter Harrison, Sr.\n\n\n\n\n\nheight = 250px\n\nbirth_date = birth date|1825|02|15\n\nbirth_place = Lexington, Kentucky\n\ndeath_date = death date and age|1893|10|28|1825|02|15\n\ndeath_place = Chicago , Illinois\n\nresidence = Chicago , Illinois\n\nstate = Illinois\n\ndistrict = 2nd\n\nterm_start = 1875\n\nterm_end = 1879\n\npredecessor = Jasper D. Ward\n\nsuccessor = George R. Davis\n\noffice2 = Mayor of Chicago\n\norder2 = 29th\n\nterm_start2 = 1879\n\nterm_end2 = 1887\n\npredecessor2 = Monroe Heath\n\nsuccessor2 = John A. Roche\n\noffice3 = Mayor of Chicago\n\norder3 = 33rd\n\nterm_start3 = 1893\n\nterm_end3 = 1893 (assassinated in office)\n\npredecessor3 = Hempstead Washburne\n\nsuccessor3 = George Bell Swift\n\nparty = Democratic\n\nreligion =\n\nspouse = Margaret Sterans, Sophonisba Grayson Preston\n\nchildren = William , Caroline Dudley, Carter Henry, Hebe Grayson, Randolf, Harry Grayson, William Preston, Gracie, Edith\n\nwebsite =\n\nCarter Henry Harrison, Sr. ( February 15 1825 – October 28 1893 ) was an American politician who served as mayor of Chicago, Illinois from 1879 until 1887; he was subsequently elected to a fifth term in 1893 but was assassinated before completing his term. He previously served two terms in the United States House of Representatives . Harrison was the first cousin twice removed of President William Henry Harrison .\n\nBorn near Lexington, Kentucky to Carter Henry Harrison II and Caroline Russell, [ cite book | last = Johnson | first = Claudius O. | authorlink = Claudius O. Johnson | title = Carter Henry Harrison I: Political Leader | publisher = University of Chicago Press | date = 1928 | pages = 7 ] he was only a couple of months old when his father died. He was educated by private tutors, and was graduated from Yale College in 1845 as a member of Scroll and Key . Following graduation, he traveled and studied in Europe from 1851 to 1853 before entering Transylvania College in Lexington, where he earned a law degree in 1855. He was admitted to the bar in 1855 and commenced practice in Chicago; Harrison came to Chicago because he saw it as a land of opportunity.\n\nHarrison ran an unsuccessful campaign in 1872 for election to the Forty-third Congress. Beginning in 1874, he served as a member of the board of commissioners of Cook County. He was elected as a Democrat to the Forty-fourth and Forty-fifth Congresses ( March 4 1880 and 1884.\n\nA Summer's Outing\n\nIn 1890, Harrison and his daughter took a vacation trip from Chicago to Yellowstone National Park and Alaska . His letters from the trip were first published in the \" Chicago Tribune \" and later compiled into the book (1891): \"A Summer's Outling and The Old Man's Story.\" [ cite book |last=Harrison |first=Carter H. |title=A Summer's Outing and An Old Man's Story |publisher=Dibble Publishing |location=Chicago |year 1891 ]\n\nAssassination\n\nThe night of the Haymarket Riot in 1886, Harrison walked unmolested through the crowd of anarchists and advised the police to leave the demonstrators alone. The riot was sparked by a bomb, reportedly thrown at police by anarchists. After leaving office, Harrison was owner and editor of the \"Chicago Times\" from 1891 to 1893. He was re-elected in 1893, in time for the World's Columbian Exposition . His desire was to show the world the true Chicago, and he appointed 1st Ward Alderman \"Bathhouse\" John Coughlin to sit on the reception committee. On October 28 1893 , three days before the close of the Exposition, Harrison was murdered in his home by Patrick Eugene Prendergast , a disgruntled and apparently mentally ill office seeker. Harrison was buried in Chicago's Graceland Cemetery . Prendergast was hanged on July 13 1894 . Harrison was Chicago's first five-time elected mayor; eventually his son, Carter Harrison, Jr. , was also elected mayor five times.\n\nHarrison's career and assassination are closely connected with the World's Columbian Exposition, and are discussed at some length as a subplot to the two main stories (about the fair and serial killer H. H. Holmes ) in \"The Devil in the White City\". His death came two days before the scheduled close of the fair, whose celebration was cancelled in lieu of a large public memorial service for Harrison.\n\nee also\n\n* List of assassinated American politicians\n\n*\" The Devil in the White City \", a narrative history of the 1893 Exposition, intertwined with a subplot about one of America's earliest known serial killers.\n\nReferences\n\n* cite book\n\nlast = Abbott | first = W.J.\n\ntitle = Carter Henry Harrison: A Memoir\n\nlocation = New York\n\nyear = 1895\n\n* cite book\n\nlast = Johnson | first = Claudius\n\ntitle = Carter Henry Harrison I: Political Leader\n\npublisher = University of Chicago Press\n\nlocation = Chicago\n\nyear = 1928\n\nExternal links"}, {"url": "https://www.findagrave.com/memorial/188649559/carter-henry-harrison", "page_content": "There is a problem with your email/password.\n\nWe’ve updated the security on the site. Please reset your password.\n\nYour account has been locked for 30 minutes due to too many failed sign in attempts. Please contact Find a Grave at [email protected] if you need help resetting your password.\n\nThis account has been disabled. If you have questions, please contact [email protected]\n\nEmail not found\n\nPlease complete the captcha to let us know you are a real person.\n\nFound more than one record for entered Email\n\nThere is a problem with your email/password.\n\nYou need to confirm this account before you can sign in. Resend Activation Email\n\nWe have sent you an activation email\n\nPlease enter your email to sign in.\n\nPlease enter your password to sign in.\n\nPlease enter your email and password to sign in.\n\nThere is a problem with your email/password.\n\nA system error has occurred. Please try again later.\n\nA password reset email has been sent to EmailID. If you don't see an email, please check your spam folder.\n\nWe encountered an unknown problem. Please wait a few minutes and try again. If the problem persists contact Find a Grave."}, {"url": "https://www.wikitree.com/wiki/Harrison-7632", "page_content": "Carter Henry Harrison Sr.\n\n15 Feb 1825 in Fayette County, Kentucky, United States Bornin\n\nAncestors\n\n[sibling(s) unknown]\n\nSophonisba (Preston) Harrison Husband of— married 12 Apr 1855 in Henderson County, Kentucky\n\nMargaret (Stearns) Harrison Husband of— married after 1877 [location unknown]\n\nDescendants\n\n28 Oct 1893 at age 68 in Chicago, Illinois, United States Diedin\n\nProfile last modified 19 Feb 2022 | Created 19 Aug 2015\n\nThis page has been accessed 1,176 times.\n\nPreceded by\n\n28th Mayor\n\nMonroe Heath\n\n\n\n\n\n\n\n32nd Mayor\n\nHempstead Washburne Carter H. Harrison\n\n\n\n29th Mayor\n\nof Chicago, Illinois\n\n1879-1887\n\n\n\n\n\n\n\n33rd Mayor\n\nof Chicago, Illinois\n\n1893\n\n\n\nSucceeded by\n\n30th Mayor\n\nJohn A. Roche\n\n\n\n\n\n\n\n34th Mayor\n\nGeorge B. Swift\n\nBiography\n\nCarter Harrison Sr. is Notable.\n\nUS House of Representatives 1875-1879; 29th Mayor of Chicago, 1879-1887; 33rd Mayor of Chicago, 1893. Assassinated during the World's Columbian Exposition by Patrick Eugene Prendergast. 1C 2R of William Henry Harrison\n\nIn 1891, Harrison published A Summer's Outing, a collection of letters originally published in the Chicago Tribune. They were written on the trip he took with his daughter across the country to Yellowstone National Park and Alaska.[1]\n\nSources\n\n↑ Wikipedia contributors, \"Carter Harrison Sr.,\" Wikipedia, The Free Encyclopedia, https://en.wikipedia.org/w/index.php?title=Carter_Harrison_Sr.&oldid=906907940 (accessed November 17, 2019).\n\n[1] The Cabells and Their Kin: A Memorial Volume of History, Biography, and Genealogy Alexander Brown January 1, 1895 Houghton, Mifflin & Company: Parents, Birth, Death, Child, Wives, page 519, 521"}, {"url": "https://en.geneastar.org/genealogy/harrisonc", "page_content": "Born near Lexington, Kentucky to Carter Henry Harrison II and Caroline Russell, he was only a few months old when his father died. He was educated by private tutors, and was graduated from Yale College in 1845 as a member of Scroll and Key. Following graduation, he traveled and studied in Europe from 1851 to 1853 before entering Transylvania College in Lexington, where he earned a law degree in 1855. He was admitted to the bar in 1855 and commenced practice in Chicago; Harrison came to Chicago because he saw it as a land of opportunity.\n\n\n\n\n\n\n\nHarrison ran an unsuccessful campaign in 1872 for election to the Forty-third Congress. Beginning in 1874, he served as a member of the board of commissioners of Cook County. He was elected as a Democrat to the Forty-fourth and Forty-fifth Congresses, and delegate to the 1880 and 1884 Democratic National Conventions.\n\n\n\n\n\n..."}, {"url": "https://www.geni.com/people/Carter-Henry-Harrison-III/6000000020320319036", "page_content": "About Carter Henry Harrison III\n\n•GRAD: 1845 Yale College •Event: Elected BET 1879 AND 1887 Mayor of Chicago, IL •Event: Elected BET 1875 AND 1879 U.S. House of Representatives from Illinois •Event: Elected 1893 Mayor of Chicago, IL\n\nhttp://en.wikipedia.org/wiki/Carter_Harrison,_Sr.\n\nCarter Henry Harrison, Sr. (February 15, 1825 – October 28, 1893) was an American politician who served as mayor of Chicago, Illinois from 1879 until 1887; he was subsequently elected to a fifth term in 1893 but was assassinated before completing his term. He previously served two terms in the United States House of Representatives. Harrison was the first cousin twice removed of President William Henry Harrison.\n\nBorn near Lexington, Kentucky to Carter Henry Harrison II and Caroline Russell, he was only a few months old when his father died. He was educated by private tutors, and was graduated from Yale College in 1845 as a member of Scroll and Key. Following graduation, he traveled and studied in Europe from 1851 to 1853 before entering Transylvania College in Lexington, where he earned a law degree in 1855. He was admitted to the bar in 1855 and commenced practice in Chicago; Harrison came to Chicago because he saw it as a land of opportunity.\n\nHarrison ran an unsuccessful campaign in 1872 for election to the Forty-third Congress. Beginning in 1874, he served as a member of the board of commissioners of Cook County. He was elected as a Democrat to the Forty-fourth and Forty-fifth Congresses, and delegate to the 1880 and 1884 Democratic National Conventions.\n\nA Summer's Outing\n\nIn 1890, Harrison and his daughter took a vacation trip from Chicago to Yellowstone National Park and Alaska. His letters from the trip were first published in the Chicago Tribune and later compiled into the book (1891): A Summer's Outing and The Old Man's Story.\n\nAssassination\n\nThe night of the Haymarket Riot in 1886, Harrison walked unmolested through the crowd of anarchists and advised the police to leave the demonstrators alone. The riot was sparked by a bomb, reportedly thrown at police by anarchists. After leaving office, Harrison was owner and editor of the Chicago Times from 1891 to 1893. He was re-elected in 1893, in time for the World's Columbian Exposition. His desire was to show the world the true Chicago, and he appointed 1st Ward Alderman \"Bathhouse\" John Coughlin to sit on the reception committee. On October 28, 1893, two days before the close of the Exposition, Harrison was murdered in his home by Patrick Eugene Prendergast, a disgruntled office seeker. Harrison was buried in Chicago's Graceland Cemetery. Prendergast was hanged on July 13, 1894. Harrison was Chicago's first five-time elected mayor; eventually his son, Carter Harrison, Jr., was also elected mayor five times.\n\nHarrison's career and assassination are closely connected with the World's Columbian Exposition, and are discussed at some length as a subplot to the two main stories (about the fair and serial killer H. H. Holmes) in The Devil in the White City. The celebration of the close of the Exposition was cancelled in lieu of a large public memorial service for Harrison."}], "Carter Henry Harrison Sr. moved to Chicago in 1853.": [{"url": "https://www.pbs.org/wgbh/amex/chicago/peopleevents/p_harrison.html", "page_content": "Carter Harrison, Chicago Historical Society\n\nCarter Harrison was born in a log cabin in Kentucky in 1825. After attending Yale College and finishing law school, his disgust with the institution of slavery motivated him to move north, to Illinois. In Chicago, he made his money in real estate.\n\nHarrison was first elected as mayor in 1879 and ran the city with a... personal touch, much like aldermen \"Bathhouse\" John Coughlin, or Edward F. (\"Foxey Ed\") Cullerton did. \"Bathhouse\" Coughlin, for example, was accused of having a profitable interest in the liquor store that supplied all the brotherls in the red light district of his ward.\n\nIn Chicago, the electorate expected a certain amount of corruption. \"Foxey Ed\" once ran on the idea that it was \"better [to] send back the man who has stolen enough already than to send in... a new man.\" On election day, some aldermen would give free drinks to anyone passing through (or passed out) in his district, in exchange for a vote. Still, when times were tough, the same aldermen were handing out free lunches to anyone who needed one, every day of the year.\n\nIn the late nineteenth century, many people believed the Republican party to be patronizing and moralistic, and the Democrats more concerned with protecting \"individual liberties.\" Or, as one local pol put it: \"A Republican is a man who wants you to go t'church every Sunday. A Democrat says if a man wants to have a glass of beer he can have it.\" Harrison was a Democrat who let people have more than beer. \"This is a free town,\" he declared, and let the brothels and gambling parlors operate openly in the neighborhood called the Levee. By concentrating all the vice into one district, he checked its spread, and police patrols made sure that the businesses were fair and did not cheat their customers.\n\nHarrison supported and encouraged neighborhood ethnic saloons, local institutions that might function as meetinghouses, post offices and welfare offices in one. The saloon licenses also provided 12% of the city's revenue and paid for the electrical lines, streetcars, sewer pipes, fire and police stations that Harrison built. He was the first mayor to cater to the various ethnic groups in his city. On St. Patrick's Day he wore his finest green. Germans heard about his friendship with Bismarck. With Scandinavians he claimed a Viking heritage, and among blacks he recalled being raised by a \"colored mammy.\" He welcomed everyone to Chicago and did not try to acculturate them into Anglo-American society, the way Charles Hutchinson or Jane Addams did.\n\nEveryone who wanted a word with the mayor could come to his open morning office hours, and he would address their problems. He was a friend of organized labor, and gave health and factory inspector jobs to union leaders. Harrison was known to restrain police from breaking up strikes and supported the eight-hour workday. Because the mayor supported their cause, organizers of the national May Day general strike of 1886 focused on Chicago. Events escalated over the following days and violence broke out at Haymarket Square after the mayor left a rally there. After Haymarket, Harrison's leniency was cited disapprovingly as encouragement to the revolutionaries. He was voted out of office at the end of his fourth term.\n\nThen, as the World's Columbian Exposition was in preparation, Harrison made his comeback. He wanted to be mayor of Chicago for the most important event in its history. In his inaugural speech of 1893, he said:\n\n\"When years ago I stood before you, aldermen of Chicago, and took the oath which fitted me for this high office, Chicago had less than half a million population; to-day it is the sixth city on the face of the globe, the second in America in population, and the first city on earth in pluck, energy, and determination. Standing thus, I feel deep anxiety lest I may not fulfill the expectation of the vast majority of my fellow citizens who have honored me.\"\n\nThe fair was so successful that Harrison tried to keep it open for another season so that millions more people could come visit Chicago. In addition, he hoped the continued employment and infusion of tourist dollars would cushion Chicago from the looming economic depression. Two nights before the end of the fair, Patrick Eugene Joseph Prendergast, a lunatic demanding a city job, entered Harrison's home and shot him dead.\n\nA funeral procession of tens of thousands of Chicagoans followed Harrison's casket to Graceland Cemetery. Half a million stood in the street to watch as uniformed police officers and firemen, postal carriers and city clerks paraded by. Irish, German, Scandinavian, Polish and Italian communities all had representatives who marched. Union leaders mourned, as did the wealthy business elite who were Harrison's poker buddies."}, {"url": "https://bioguideretro.congress.gov/Home/MemberDetails?memIndex=H000267", "page_content": "Abraham Lincoln Presidential Library\n\nSpringfield, IL\n\nPapers:\n\n1861, 1 item.\n\nA letter from Harrison to an unidentified recipient written on June 24, 1861. In the letter, Harrison makes arrangements for repaying a financial obligation.\n\nUniversity of Chicago Library\n\nChicago, IL\n\nPapers:\n\nButler-Gunsaulus collection, 1527-1915, 3.25 linear feet..\n\nAn April 18, 1893 letter from Harrison to Edward B. Butler thanking him for a complimentary ticket to attend the World's Columbian Exposition.\n\nUniversity of Kentucky\n\nSpecial Collections and Digital Programs\n\nLexington, KY\n\nPapers:\n\nIn the Jeffrey family papers, 1818-1903, 1.35 cubic feet.\n\nSubjects covered include Harrison.\n\nWisconsin Historical Society\n\nArchives Division\n\nMadison, WI\n\nPapers:\n\nIn the Harrison and Russell family genealogical notes, 1884, 0.1 cubic foot."}, {"url": "https://florencekelley.northwestern.edu/legal/mayors/harrisonsr/", "page_content": "Carter Henry Harrison Senior, who served five terms and eight years as Mayor of Chicago until he was assassinated in 1893, came from a family which was, steeped in American history and political involvement dating back to 1635, when the patriarch of the Harrison family was Clerk of the Virginia Council. Carter Henry Harrison’s great grandmother Susannah Randolph was a descendant of Pocahontas. What is remarkable, however, is that in Carter Henry Harrison’s family line one finds a signator of the Declaration of Independence, and two U.S. Presidents. Carter Henry Harrison’s great uncle, Benjamin Harrison not only signed the Declaration of Independence, but also introduced a resolution of independence to congress. One of Benjamin Harrison’s sons, William Henry Harrison went on to become President of the United States in 1841, and President Harrison’s great grandson Benjamin Harrison became President of the United States in 1889.\n\nWhile Carter Henry Harrison Senior’s father’s side was noted for its politicians, his mother’s side was distinguished for its soldiers. Carter Henry Harrison Senior’s mother was Caroline Evalind, whose father, grandfather, and great grandfather were all notable soldiers in their time. Her great grandfather was an officer in the English Army, her grandfather was General William Russell famous for fighting the Indian Wars, and her father Colonel Russell, a cavalry captain, is credited for leading the attack in the Revolutionary War Battle, King’s Mountain.\n\nCarter Henry Harrison Senior was born February 15th, 1825 to Carter Henry Harrison II and Caroline Evalind. Although, Carter Henry Harrison Senior is known as “senior,” he is technically the III in his family to bear the name. He grew up in Elk Hill, Kentucky in a log cabin. His father died, shortly after his birth, and his mother schooled him until he was 15. At this time, he went to Lexington to study under Dr. Lewis Marshall who was the brother of Supreme Court Justice Thomas Marshall. In 1845 he began attending Yale, and after graduating at age 20, studied law at Transylvania University in Lexington, Kentucky. After one year of law school, however, he decided to return home to live the life of a farmer on his family’s plantation. In 1851, Harrison traveled Europe for two years where he began to develop an affinity for urban life. When he returned to the states he finished his law degree and graduated in 1853. The same year he married Sophonisba Preston and moved first to St. Louis and then finally to Chicago.\n\nAlthough Harrison intended to open a law office, he became involved in buying and selling real estate. However, a financial storm in 1857 affected him terribly and Harrison spent the next ten years trying to get on his feet financially. During this time, five of his children died in infancy.\n\nIn an attempt to move away from real-estate, Harrison made an unsuccessful attempt at running for the lower house of the State legislature, but it was not until the great Chicago Fire in 1871 that the catalyst for Harrison’s life as politician would emerge. Harrison’s support for the “fire proof ticket,” a ticket composed of both Democratic and Republican nominations for city offices, gained him a nomination and election as County Commissioner. After serving a three-year term as County Commissioner, Harrison decided to run again for congress. He was narrowly elected as the Democratic Representative for 44th National Congress, in March of 1875. Harrison quickly developed a reputation as a skilled orator, and was re-elected for a second term. During his re-election campaign his wife died suddenly of illness and Harrison immersed himself in his work. He served in congress until the end of his second term in 1878, and chose not to seek a third term. Harrison would lament later in life that he never fully enjoyed the life of a congressman. Harrison did not abandon statesmanship all together; in fact, he barely missed a beat. In the spring of 1879, Harrison was elected to be the mayor of Chicago.\n\nHarrison was elected to the office of mayor five times, serving from 1879-1887 and then again in 1893.. The time that Harrison served in office was a time of expansion and development for Chicago. When Harrison arrived in Chicago in 1855 the public revenue for taxation was slightly over $200,000; by the time of his death this number exceeded $15,000,000. Harrison was known, however, as a champion of people’s rights. With railroads being built from one end of Chicago to the other, Harrison continually fought for workers’ rights against the railroad companies that tried to usurp them. Harrison’s commitment to the public is epitomized by his role in the Haymarket Riot. The night of March 4th, 1886 an unknown person threw a bomb at police officers during a workers’ strike organized by local socialist party members. Harrison was quick to speak out against anti-socialist language in the media, not only saying that socialists did not sympathize with the bomb throwers, but also asserting that socialists represented the “workers, thinkers, and writers” of the United States.\n\nHarrison made an unsuccessful bid for Governor of Illinois in 1884, and was only narrowly re-elected to his 4th term as mayor; he stepped down at the end of that term. Harrison decided he wanted to get back in public life, however, and ran for the mayorship unsuccessfully in 1891. Not to be easily dissuaded, however, he ran again, and was re-elected in 1893 in time to host the World’s Columbian Exposition in Chicago. His term, however, was cut short by assassination. Two days before the World Fair opened, on October 28th, 1893, failed politician Patrick Eugene Prendergast killed Carter Henry Harrison in Harrison’s home. Earlier that day Harrison had announced in a speech “I intend to live for more than half a century! And at the end of that half century London will tremble lest Chicago shall surpass her.” Carter Henry Harrison Senior was the first Chicago Mayor to serve five terms; the next Mayor of Chicago to serve as long a term, was his son Carter Henry Harrison II.\n\nNext: Johnny Powers\n\nSources:\n\nAbbot, Willis John. Carter Henry Harrison: A Memoir. New York: Dodd, Mead & Company, 1895. Kantowicz, Edward R. “Carter H. Harrison II: The Politics of Balance.” Ed. Paul M. Green and Melvin G. Holli. The Mayors: The Chicago Political Tradition. Carbondale: Southern Illinois University Press, 2005."}, {"url": "https://explore.chicagocollections.org/ead/newberry/72/6t0h14w/", "page_content": "Carter Henry Harrison IV (\"Harrison\"), like his father, Carter Henry Harrison III, was a five term Democratic mayor of Chicago. Harrison served his first four terms around the turn of the twentieth century (1897-1905), with his final term running from 1911 until 1915. Harrison was also Collector of Internal Revenue for the Chicago area during the 1930s and early 1940s.\n\nHarrison's father moved to Chicago in 1855 from Kentucky, shortly after his graduation from Transylvania University (now the University of Kentucky) Law School, and marriage to Sophonisba Preston, Harrison's mother. Upon his arrival in Chicago, Harrison's father invested his money in real estate, and then hung out his shingle as a lawyer and real estate agent. Harrison was born a few years later, on April 23, 1860. In 1873, Harrison's mother was advised to travel to Europe for her health, and Harrison and the rest of the family accompanied her and traveled throughout Germany, Austria, and Switzerland that spring and summer. Harrison's father then returned to Chicago in the fall to tend to his real estate business, but Harrison remained in Germany with his mother and attended school at the Altenberg Gymnasium.\n\nIn 1874, Harrison's father was elected to the U.S. House of Representatives, and despite spending much of 1875 in Europe with his family, he was re-elected to Congress in 1876. During this time, Harrison continued his studies at Altenberg, but after his mother died in the fall of 1876 he returned to Chicago.\n\nUpon his return to Chicago, Harrison entered St. Ignatius College (now Loyola University), which was then located near the family's home on Ashland Avenue between Jackson and Van Buren Streets. Harrison graduated from St. Ignatius in 1881, second in a class of two, and then attended Yale University Law School, from which he received a Bachelor of Laws degree in 1883. After law school, Harrison came back to Chicago and practiced law until 1891 when he and his brother, William Preston Harrison, took over the operation of the Chicago Times, which their father had recently purchased.\n\nAfter completing his second term in Congress, Harrison's father was elected mayor of Chicago and served four consecutive two-year terms, from April 1879 to April 1887. He then took a break from politics, including an eighteen month trip around the world, before being once again elected mayor in 1893. Six months after taking office, however, on the final day of the World Columbian Exposition, Harrison's father was assassinated in his home by Patrick Prendergast on October 28, 1893.\n\nIn 1894, Harrison's family sold the Chicago Times, and Harrison focused his energies on his real estate investments until he followed in his father's footsteps and successfully ran for mayor in 1897. Harrison served as mayor from 1897 until 1905, and again from 1911 to 1915. During his first term as mayor Harrison was best known for his bitter, but ultimately victorious, fight against Charles T. Yerkes, the traction railroad baron, who sought a fifty year streetcar concession from the city that Harrison felt was unfair. The traction interests had significant aldermanic support, allegedly obtained through bribery and improper means, and were prepared for Harrison's veto of the proposed ordinance, which they expected to be able to overcome. Harrison, however, went further and took the fight directly to the people, urging them to challenge their aldermen on the issue. Although this move angered some in the Chicago Democratic Party who felt that Harrison had overstepped his bounds, it made Harrison popular with the people, who re-elected him to a second two-year term in 1899.\n\nThe Yerkes battle cemented Harrison's reputation as a man of integrity and one who was not afraid to ruffle a few feathers in order to do what he thought was right. Harrison was re-elected again in 1901 and 1903, but declined to run in 1905, when he was succeeded as mayor by Edward F. Dunne, another Democrat. In 1907, the mayoral term was extended from two years to four and Dunne lost his re-election bid to Republican F. A. Busse. Harrison then re-entered the political scene for the 1911 election, in which he defeated Dunne in the Democratic primary, and Republican Charles E. Merriam, a professor at the University of Chicago, in the general election. During what would prove to be his final term as mayor, Harrison was persuaded that the best way to handle prostitution and gambling was to try to eliminate these practices altogether, instead of treating them as necessary evils and attempting to segregate such vices to particular sections of the city where they could be contained and informally regulated by the police, as Chicago had done for many years. This change in tactics led Harrison to a direct confrontation with long-time allies John J. (\"Bathhouse John\") Coughlin and Michael (\"Hinky-Dink\") Kenna, the aldermen of Chicago's notorious First Ward, which served as the city's main red-light district. Harrison eventually succeeded in shutting down most of Chicago's houses of prostitution and gambling dens, including the infamous Everleigh Club, but these achievements came at a cost. Without Coughlin and Kenna's political support (which, ironically, had been critical years earlier when he stood up against Charles Yerkes), Harrison lost the Democratic nomination to Robert M. Sweitzer in 1915 and moved to the sidelines of Chicago politics, although he remained active in the Democratic Party at the national level throughout the remainder of his life.\n\nWhen America entered World War I, Harrison desperately wanted to participate, but was too old to serve in the military. He lobbied heavily for an appointment to a meaningful position that would allow him to, if not see action, at least be able to \"hear the big guns.\" Eventually, Harrison was made a Captain in the American Red Cross and stationed in Toul, France, a few miles behind the front lines, where he worked to help make life more comfortable for the American troops stationed and recovering at the several field hospitals located there.\n\nFollowing the war, Harrison spent most of the 1920s traveling. He took multiple trips around the world, along with shorter excursions to Europe and Africa. By the early 1930s, however, reversals in the stock market had diminished his personal fortune and Harrison decided to return to work, even though he was now over seventy years old. Relying on his political connections, Harrison was appointed Collector of Internal Revenue for the Northern District of Illinois by President Franklin D. Roosevelt in 1933. It was thought that this would be a relatively short-term position, but Harrison ended up holding the post until the end of 1944, when he finally retired from public service for good at the age of 84.\n\nHarrison was a both an outdoorsman and a scholarly patron of the arts. He loved hunting and fishing, and throughout his life went on numerous expeditions into the wilderness in search of big game or the perfect trout stream, including hunting and fishing trips to the Sierra Nevada Mountains, India, Indochina, and Africa. In 1940, when he was eighty years old, Harrison and his long-time friend Oscar Mayer (the Chicago meat-packer), each bagged a 150 pound buck on their annual hunting trip to northern Michigan. Harrison also had somewhat of a reputation as a trencherman, and favored a \"Kentucky Nightcap\" of bourbon before retiring for the day. At the same time, however, Harrison was an avid art collector and regular at the Chicago symphony and opera. Before his death, he donated his substantial art collection to the Art Institute of Chicago, including works by Paul Gauguin, Childe Hassam, Mary Cassatt, Claude Monet, and Toulouse-Lautrec. In recognition of his support, the Art Institute ultimately named Harrison a Benefactor and Governing Life-Member of the museum. According to his daughter, Harrison's \"light-reading\" usually consisted of poetry or the ancient Greek classics, and he read a chapter of the Bible each night throughout his life in fulfillment of a boyhood promise to his mother.\n\nHarrison died on Christmas Day, 1953, at the age of ninety-three. On New Year's Eve of that same year, the Chicago City Council passed a resolution recognizing his accomplishments as mayor, Collector of Internal Revenue, world traveller, and patron of the arts. The resolution stated, in part, that \"from such men as Carter H. Harrison, men of integrity, vision, high civic ideals and unswerving zeal, we shall take example.\" Harrison led a life full of accomplishments and achievements, and appeared to have no regrets. The only disappointment that seemed to stick with him was the failure of his son, Carter H. Harrison V, to have a son that could carry on the family name. Much to Harrison's chagrin, it was his daughter, Edith Harrison Manierre, who bore him two grandsons, while his son gave him four granddaughters."}, {"url": "https://www.geni.com/people/Carter-Henry-Harrison-III/6000000020320319036", "page_content": "About Carter Henry Harrison III\n\n•GRAD: 1845 Yale College •Event: Elected BET 1879 AND 1887 Mayor of Chicago, IL •Event: Elected BET 1875 AND 1879 U.S. House of Representatives from Illinois •Event: Elected 1893 Mayor of Chicago, IL\n\nhttp://en.wikipedia.org/wiki/Carter_Harrison,_Sr.\n\nCarter Henry Harrison, Sr. (February 15, 1825 – October 28, 1893) was an American politician who served as mayor of Chicago, Illinois from 1879 until 1887; he was subsequently elected to a fifth term in 1893 but was assassinated before completing his term. He previously served two terms in the United States House of Representatives. Harrison was the first cousin twice removed of President William Henry Harrison.\n\nBorn near Lexington, Kentucky to Carter Henry Harrison II and Caroline Russell, he was only a few months old when his father died. He was educated by private tutors, and was graduated from Yale College in 1845 as a member of Scroll and Key. Following graduation, he traveled and studied in Europe from 1851 to 1853 before entering Transylvania College in Lexington, where he earned a law degree in 1855. He was admitted to the bar in 1855 and commenced practice in Chicago; Harrison came to Chicago because he saw it as a land of opportunity.\n\nHarrison ran an unsuccessful campaign in 1872 for election to the Forty-third Congress. Beginning in 1874, he served as a member of the board of commissioners of Cook County. He was elected as a Democrat to the Forty-fourth and Forty-fifth Congresses, and delegate to the 1880 and 1884 Democratic National Conventions.\n\nA Summer's Outing\n\nIn 1890, Harrison and his daughter took a vacation trip from Chicago to Yellowstone National Park and Alaska. His letters from the trip were first published in the Chicago Tribune and later compiled into the book (1891): A Summer's Outing and The Old Man's Story.\n\nAssassination\n\nThe night of the Haymarket Riot in 1886, Harrison walked unmolested through the crowd of anarchists and advised the police to leave the demonstrators alone. The riot was sparked by a bomb, reportedly thrown at police by anarchists. After leaving office, Harrison was owner and editor of the Chicago Times from 1891 to 1893. He was re-elected in 1893, in time for the World's Columbian Exposition. His desire was to show the world the true Chicago, and he appointed 1st Ward Alderman \"Bathhouse\" John Coughlin to sit on the reception committee. On October 28, 1893, two days before the close of the Exposition, Harrison was murdered in his home by Patrick Eugene Prendergast, a disgruntled office seeker. Harrison was buried in Chicago's Graceland Cemetery. Prendergast was hanged on July 13, 1894. Harrison was Chicago's first five-time elected mayor; eventually his son, Carter Harrison, Jr., was also elected mayor five times.\n\nHarrison's career and assassination are closely connected with the World's Columbian Exposition, and are discussed at some length as a subplot to the two main stories (about the fair and serial killer H. H. Holmes) in The Devil in the White City. The celebration of the close of the Exposition was cancelled in lieu of a large public memorial service for Harrison."}, {"url": "https://florencekelley.northwestern.edu/legal/mayors/harrisonjr/", "page_content": "Carter H. Harrison II was the 30th mayor of Chicago, in office from 1897-1905 and then again from 1911-1915. His father, Carter H. Harrison, also served as mayor of Chicago from 1879-1887. Harrison senior was re-elected 1893 for a fifth term, but was assassinated in his home by a failed politician named Patrick Eugene Prendergast on October 28th, 1893. Earlier that day Harrison Senior had announced in a speech “I intend to live for more than half a century! And at the end of that half century London will tremble lest Chicago shall surpass her.”\n\nAlthough the Daley family, (Richard Joseph Daley and Richard Michael Daley) are today noted for their domination of the Chicago political scene, the same can be said for the Harrison family in the late 19th and early 20th century. Both Carter H. Harrison Jr. and senior were elected to five terms in office accounting for 10 of 17 mayoral elections from 1879 until the outbreak of World War I. Carter H. Harrison Jr. greatly respected his father and resembled him in appearance and political policy.\n\nCarter Harrison Jr. was born on April 23, 1860 in Chicago. In 1873 Harrison’s mother, who never took a liking to the Chicago lifestyle, took Harrison Jr. and his brother and sister to Germany. Harrison Jr. stayed in Germany with his brother and sister until his mother’s death in 1876. Upon returning to Chicago, Harrison Jr. enrolled in a Catholic prep school where he received his high school and graduate educations. After graduating, Harrison Jr. chose to attend Yale Law School, the same place his father received his law degree.\n\nAfter Harrison Jr. graduated law school in 1883, he passed his time in Chicago working as a poet, and a journalist under the pseudonym Cecil H. Harcourt. During this time, Harrison developed a great respect for his father, and decided to carry on his legacy and run for the mayor of Chicago. Like his father Harrison appealed to the working class, but his elite upbringing also appealed to the Chicago’s affluent community. He ran on a platform of progressive civic reform which was well received by the City’s population, and in 1897 he was elected the 30th mayor of Chicago.\n\nThe largest controversy Harrison faced in his administration was known as the “Traction Wars,” traction referring to electric streetcar companies. In 1858 the Chicago City Council gave corporate rights to private streetcar companies to carry passengers on Chicago streets for profit. The original contract gave rights for twenty-five years, but in 1865 private companies received a ninety-nine year contract from a corrupt Illinois state legislature. A man named Charles Tyson Yerkes owned most of the streetcars in the city by the time that Harrison Jr. became mayor of Chicago. Yerkes was known to have a number of politicians in his pocket, one of them being state senator named John Humphrey. Humphrey introduced a series of legislation in 1896 which would expand private streetcar rights in Chicago by fifty years. The bills also only mandated minimal compensation from the streetcar companies to the city. Harrison Jr. took an ardent stance against the Humphrey bills and over the next decade fought any franchise expansion. Although Humphrey did very little in leading the fight against the streetcar companies, his visible stance on the issue earned him public approval.\n\nLike his father, Harrison Jr. was an ardent Democrat and believed morality should not be a part of politics. In regards to gambling, prohibition, prostitution and other vices, Harrison adopted a “live and let live” policy. However, the political opposition to vice which surrounded the 1911 mayoral election forced Harrison to use Chicago Police to close several brothels in the city. Ironically, coming down hard on prostitution is what Harrison is most remembered for in Chicago. At the end of his fifth term, Harrison was physically weary from the strain of politics, and after being defeated in the 1915 Democratic primary, he officially retired from politics.\n\nNext: Carter Harrison"}, {"url": "https://www.wikitree.com/wiki/Harrison-7632", "page_content": "Carter Henry Harrison Sr.\n\n15 Feb 1825 in Fayette County, Kentucky, United States Bornin\n\nAncestors\n\n[sibling(s) unknown]\n\nSophonisba (Preston) Harrison Husband of— married 12 Apr 1855 in Henderson County, Kentucky\n\nMargaret (Stearns) Harrison Husband of— married after 1877 [location unknown]\n\nDescendants\n\n28 Oct 1893 at age 68 in Chicago, Illinois, United States Diedin\n\nProfile last modified 19 Feb 2022 | Created 19 Aug 2015\n\nThis page has been accessed 1,177 times.\n\nPreceded by\n\n28th Mayor\n\nMonroe Heath\n\n\n\n\n\n\n\n32nd Mayor\n\nHempstead Washburne Carter H. Harrison\n\n\n\n29th Mayor\n\nof Chicago, Illinois\n\n1879-1887\n\n\n\n\n\n\n\n33rd Mayor\n\nof Chicago, Illinois\n\n1893\n\n\n\nSucceeded by\n\n30th Mayor\n\nJohn A. Roche\n\n\n\n\n\n\n\n34th Mayor\n\nGeorge B. Swift\n\nBiography\n\nCarter Harrison Sr. is Notable.\n\nUS House of Representatives 1875-1879; 29th Mayor of Chicago, 1879-1887; 33rd Mayor of Chicago, 1893. Assassinated during the World's Columbian Exposition by Patrick Eugene Prendergast. 1C 2R of William Henry Harrison\n\nIn 1891, Harrison published A Summer's Outing, a collection of letters originally published in the Chicago Tribune. They were written on the trip he took with his daughter across the country to Yellowstone National Park and Alaska.[1]\n\nSources\n\n↑ Wikipedia contributors, \"Carter Harrison Sr.,\" Wikipedia, The Free Encyclopedia, https://en.wikipedia.org/w/index.php?title=Carter_Harrison_Sr.&oldid=906907940 (accessed November 17, 2019).\n\n[1] The Cabells and Their Kin: A Memorial Volume of History, Biography, and Genealogy Alexander Brown January 1, 1895 Houghton, Mifflin & Company: Parents, Birth, Death, Child, Wives, page 519, 521"}, {"url": "https://www.infoplease.com/biographies/government-politics/carter-henry-harrison-il", "page_content": "HARRISON Carter Henry , a Representative from Illinois; born near Lexington, Fayette County, Ky., February 15, 1825; educated by private tutors; was graduated from Yale College in 1845; traveled and studied in Europe 1851-1853; was graduated from the law department of Transylvania College, Lexington, Ky., in 1855; was admitted to the bar in 1855 and commenced practice in Chicago, Ill.; also engaged in the real estate business; unsuccessful candidate in 1872 for election to the Forty-third Congress; member of the board of commissioners of Cook County 1874-1876; elected as a Democrat to the Forty-fourth and Forty-fifth Congresses (March 4, 1875-March 3, 1879); was not a candidate for renomination in 1878; mayor of Chicago 1879-1887 and declined a renomination; unsuccessful candidate for Governor of Illinois in 1884; delegate to the Democratic National Conventions in 1880 and 1884; owner and editor of the Chicago Times 1891-1893; again elected mayor of Chicago in 1893 and served until his death in Chicago by assassination October 28, 1893; interment in Graceland Cemetery, Chicago, Ill.\n\nBibliography\n\nHarrison, Carter Henry. Stormy Years: The Autobiography of Carter H. Harrison, Five Times Mayor of Chicago. Indianapolis: Bobbs-Merrill Co., 1935; Johnson, Claudius Osborne. Carter Henry Harrison I, Political Leader. Chicago: University of Chicago Press, 1928.\n\nSource: Biographical Directory of the United States Congress, 1771-Present"}, {"url": "https://freepages.rootsweb.com/~harrisonrep/genealogy/harrbios/carterharr3IL.htm", "page_content": "Carter Harrison III (1825-1893) Biography\n\nCarter Harrison III (1825-1893)\n\nFayette Co., KY; Chicago, IL\n\nSurnames Mentioned: HARRISON OWSLEY RANDOLPH RUSSELL\n\nHe was the son of Carter Henry Harrison II and Caroline Russell. Caroline was the daughter of Col. William Russell. His father died soon after his birth in May of 1825. Carter received a classical education, graduating from Yale in 1845 and a law degree from Transylvania in 1855.\n\nAt first he tried his hand at farming, but when he moved to Chicago in 1855, Carter became a very lucrative landowner and a very prosperous real estate operator.\n\nHe built a very large house on was known as Reuben Street. Later when Hey Rube became a popular term of ridicule and the residents of the street were called Rubes, the residents had the streets name changed to Ashland Avenue. The houses were spacious and the grounds the size of country side farms.\n\nCarter had a very bush beard and was described as follows: \"The squire of the avenue was Mayor Carter H. Harrison who kept his big black bay mare named Kate in a stable near his house and liked to ride up and down the street in the manner of a plantation owner looking over his acreage\". He described himself \"unable to study out a problem or scheme sitting at his desk but did his best thinking at full gallop upon his flying steed\"..\n\nAmong his closest friends were several former Kentuckians HH. Honre, Potter Palmer, John E. Owsley and F, H. Winston who were also all in real estate. His friends shared his optimism and considered him \"whole-souled and honorable\". And even though his political emenies condemned him it was also said he had a host of friends who had little in common with him socially but who \"had the utmost confidence in him and who would divide with him their last crust bread\". To quote from his journals he wrote \"There were my good neighbors and true friends from all over the city . One by one they walked accrossed the polished plate and bent upon me a kindly look. Friends of every nationality, Teuton and Hibernian, Frenchman and Norseman, Bohemian and Dane, Italian and Swede, Christain and Jew, rich and poor, Ah! How I wish I could bid yon pale moon bear to them my own picture, looking as I feel, brimful of good will and running over with kindly fellowship. To one and all I drink in a cup as full as yon sea, a cup brimming over with affection.\"\n\nCarter's second wife who he married April 12, 1855 was his cousin Sophonisba Grayson Preston, the daughter of William Preston and Hebe Carter Grayson and 7th great granddaughter of Pocahontas. She was born October 27, 1833 and died in September 1876. She bore him ten children six which died in infancy (see below).\n\nFrom Carter Harrison's IV (his son) autobiography, The Stormy Years, we are given the following glimpses into life at the Harrison home. He speaks of dinner his father and John Owsley hosted given in the parlor of Carter's home which the boys were not even allowed to festivities of although they could hear the lusty singing of Good Old Yale, Drink Her Down!, Excelsior and other classics. \"It was a small but joyous gathering of the Chicago Yale Club given to song, horseplay and wassail; there was a huge punchbowl into which my father had poured pitcher after pitcher of Bourbon whisky drawn from the barrell in his cellar\".\n\nCarter Harrison III first became mayor of Chicago April 1, 1879 when he defeated Abner M. Wright (Republican) & Ernst Schmidt (Socialist Labor). His second term was begun April 5, 1881 by Defeating John M. Clark (Republican), Timothy O'Meara (Independent) & George Schilling (Socialist Labor) . On April 3,1883 he defeated Eugene Cary (Republican) and began his third term. His fourth term followed April 7, 1885 when he defeated Sidney Smith (Republican) & William Bush (Prohibition).\n\nIn 1887 after being defeated he left on a tour of the world. When he returned he once again pursued politics and April 7, 1893 he was again elected mayor, Defeated Samuel W. Allerton (Republican), Dewitt C. Cregier (Un. Citizen) & Henry Ehrenpreis (socialist Labor). But this term was cut short. On October 23, 1893 during the Chicago World's Fair he was assassinated at his home.\n\nWillie born 1856 died in infancy\n\nCaroline Dudley born 3/28/1857\n\nCarter Henry born 4/23/1860 died 12/25/1953\n\nHebe Grayson born 1862 died in infancy\n\nChild unnamed born 1864 died in infancy\n\nRandolf born 1866 died in infancy\n\nHarry Grayson born 1868 died in infancy\n\nWilliam Preston born 4/12/1869\n\nGracie born 1871 died in infancy\n\nEdith born 12/17/1873\n\nCarter Harrison Sr terms as Mayor of Chicago:\n\nElected:\n\n1st term: April 1, 1879 Defeated Abner M. Wright (Republican) & Ernst Schmidt (Socialist Labor)\n\n2nd term: April 5, 1881 Defeated John M. Clark (Republican), Timothy O'Meara (Independent) & George Schilling (Socialist Labor)\n\n3rd term: April 3,1883 Defeated Eugene Cary (Republican)\n\n4th term: April 7, 1885 Defeated Sidney Smith (Republican) & William Bush (Prohibition)\n\n5th term: April 17, 1893 Defeated Samuel W. Allerton (Republican), Dewitt C. Cregier (Un. Citizen) & Henry Ehrenpreis (socialist Labor)\n\n1st term: April 28, 1879\n\n2nd term: May 9, 1881\n\n3rd term: May 14, 1883\n\n4th term: June 8, 1885\n\n5th term: April 17, 1893\n\n1st term: 1879-1881\n\n2nd term: 1881-1883\n\n3rd term: 1883-1885\n\n4th term: 1885-1887\n\n5th term: 1893\n\nSource:\n\nThe Stormy Years (autobiography of Carter Harrison Jr.), and the Biography of Carter Harrison I, and assorted notes of Edna B Owsley (his granddaughter).\n\n\n\nSubmitted by Milancie Adams. Visit her website Keeping the Chain Unbroken: Owsley and Hill Family History Website for additional info on this family. Note - be sure to go to her home page and follow some of the other Harrison links in her family as well.\n\nReturn to Index of Harrison Biographies\n\nThe Harrison Genealogy Repository http://freepages.genealogy.rootsweb.com/~harrisonrep"}, {"url": "https://www.findagrave.com/memorial/7114389/carter-henry-harrison", "page_content": "There is a problem with your email/password.\n\nWe’ve updated the security on the site. Please reset your password.\n\nYour account has been locked for 30 minutes due to too many failed sign in attempts. Please contact Find a Grave at [email protected] if you need help resetting your password.\n\nThis account has been disabled. If you have questions, please contact [email protected]\n\nEmail not found\n\nPlease complete the captcha to let us know you are a real person.\n\nFound more than one record for entered Email\n\nThere is a problem with your email/password.\n\nYou need to confirm this account before you can sign in. Resend Activation Email\n\nWe have sent you an activation email\n\nPlease enter your email to sign in.\n\nPlease enter your password to sign in.\n\nPlease enter your email and password to sign in.\n\nThere is a problem with your email/password.\n\nA system error has occurred. Please try again later.\n\nA password reset email has been sent to EmailID. If you don't see an email, please check your spam folder.\n\nWe encountered an unknown problem. Please wait a few minutes and try again. If the problem persists contact Find a Grave."}]}