{"During his tenure, Carter Henry Harrison Sr. was a strong advocate for labor unions and was instrumental in the passage of the Eight-Hour Law in 1885.": [{"url": "https://simple.wikipedia.org/wiki/Carter_Harrison,_Sr.", "page_content": "Carter Henry Harrison, Sr. (February 15, 1825 – October 28, 1893) was an American politician who was mayor of Chicago from 1879 until 1887; he was elected to a fifth term in 1893 but was assassinated before completing his term.\n\nHe previously served two terms in the United States House of Representatives. Harrison was the first cousin twice removed of President William Henry Harrison. He is also related to President Benjamin Harrison. His son, Carter Harrison, Jr. would later become Mayor of Chicago.\n\nHarrison was born on February 15, 1825 in Fayette County, Kentucky.[1] He studied at Yale University. He was married two times and secretly engaged to another before his death. Harrison died on October 28, 1893 after being shot and killed in his home in Chicago, Illinois, aged 68.\n\n\n\n"}, {"url": "https://florencekelley.northwestern.edu/legal/mayors/harrisonsr/", "page_content": "Carter Henry Harrison Senior, who served five terms and eight years as Mayor of Chicago until he was assassinated in 1893, came from a family which was, steeped in American history and political involvement dating back to 1635, when the patriarch of the Harrison family was Clerk of the Virginia Council. Carter Henry Harrison’s great grandmother Susannah Randolph was a descendant of Pocahontas. What is remarkable, however, is that in Carter Henry Harrison’s family line one finds a signator of the Declaration of Independence, and two U.S. Presidents. Carter Henry Harrison’s great uncle, Benjamin Harrison not only signed the Declaration of Independence, but also introduced a resolution of independence to congress. One of Benjamin Harrison’s sons, William Henry Harrison went on to become President of the United States in 1841, and President Harrison’s great grandson Benjamin Harrison became President of the United States in 1889.\n\nWhile Carter Henry Harrison Senior’s father’s side was noted for its politicians, his mother’s side was distinguished for its soldiers. Carter Henry Harrison Senior’s mother was Caroline Evalind, whose father, grandfather, and great grandfather were all notable soldiers in their time. Her great grandfather was an officer in the English Army, her grandfather was General William Russell famous for fighting the Indian Wars, and her father Colonel Russell, a cavalry captain, is credited for leading the attack in the Revolutionary War Battle, King’s Mountain.\n\nCarter Henry Harrison Senior was born February 15th, 1825 to Carter Henry Harrison II and Caroline Evalind. Although, Carter Henry Harrison Senior is known as “senior,” he is technically the III in his family to bear the name. He grew up in Elk Hill, Kentucky in a log cabin. His father died, shortly after his birth, and his mother schooled him until he was 15. At this time, he went to Lexington to study under Dr. Lewis Marshall who was the brother of Supreme Court Justice Thomas Marshall. In 1845 he began attending Yale, and after graduating at age 20, studied law at Transylvania University in Lexington, Kentucky. After one year of law school, however, he decided to return home to live the life of a farmer on his family’s plantation. In 1851, Harrison traveled Europe for two years where he began to develop an affinity for urban life. When he returned to the states he finished his law degree and graduated in 1853. The same year he married Sophonisba Preston and moved first to St. Louis and then finally to Chicago.\n\nAlthough Harrison intended to open a law office, he became involved in buying and selling real estate. However, a financial storm in 1857 affected him terribly and Harrison spent the next ten years trying to get on his feet financially. During this time, five of his children died in infancy.\n\nIn an attempt to move away from real-estate, Harrison made an unsuccessful attempt at running for the lower house of the State legislature, but it was not until the great Chicago Fire in 1871 that the catalyst for Harrison’s life as politician would emerge. Harrison’s support for the “fire proof ticket,” a ticket composed of both Democratic and Republican nominations for city offices, gained him a nomination and election as County Commissioner. After serving a three-year term as County Commissioner, Harrison decided to run again for congress. He was narrowly elected as the Democratic Representative for 44th National Congress, in March of 1875. Harrison quickly developed a reputation as a skilled orator, and was re-elected for a second term. During his re-election campaign his wife died suddenly of illness and Harrison immersed himself in his work. He served in congress until the end of his second term in 1878, and chose not to seek a third term. Harrison would lament later in life that he never fully enjoyed the life of a congressman. Harrison did not abandon statesmanship all together; in fact, he barely missed a beat. In the spring of 1879, Harrison was elected to be the mayor of Chicago.\n\nHarrison was elected to the office of mayor five times, serving from 1879-1887 and then again in 1893.. The time that Harrison served in office was a time of expansion and development for Chicago. When Harrison arrived in Chicago in 1855 the public revenue for taxation was slightly over $200,000; by the time of his death this number exceeded $15,000,000. Harrison was known, however, as a champion of people’s rights. With railroads being built from one end of Chicago to the other, Harrison continually fought for workers’ rights against the railroad companies that tried to usurp them. Harrison’s commitment to the public is epitomized by his role in the Haymarket Riot. The night of March 4th, 1886 an unknown person threw a bomb at police officers during a workers’ strike organized by local socialist party members. Harrison was quick to speak out against anti-socialist language in the media, not only saying that socialists did not sympathize with the bomb throwers, but also asserting that socialists represented the “workers, thinkers, and writers” of the United States.\n\nHarrison made an unsuccessful bid for Governor of Illinois in 1884, and was only narrowly re-elected to his 4th term as mayor; he stepped down at the end of that term. Harrison decided he wanted to get back in public life, however, and ran for the mayorship unsuccessfully in 1891. Not to be easily dissuaded, however, he ran again, and was re-elected in 1893 in time to host the World’s Columbian Exposition in Chicago. His term, however, was cut short by assassination. Two days before the World Fair opened, on October 28th, 1893, failed politician Patrick Eugene Prendergast killed Carter Henry Harrison in Harrison’s home. Earlier that day Harrison had announced in a speech “I intend to live for more than half a century! And at the end of that half century London will tremble lest Chicago shall surpass her.” Carter Henry Harrison Senior was the first Chicago Mayor to serve five terms; the next Mayor of Chicago to serve as long a term, was his son Carter Henry Harrison II.\n\nNext: Johnny Powers\n\nSources:\n\nAbbot, Willis John. Carter Henry Harrison: A Memoir. New York: Dodd, Mead & Company, 1895. Kantowicz, Edward R. “Carter H. Harrison II: The Politics of Balance.” Ed. Paul M. Green and Melvin G. Holli. The Mayors: The Chicago Political Tradition. Carbondale: Southern Illinois University Press, 2005."}, {"url": "https://www.chicagotribune.com/news/ct-xpm-1988-10-09-8802060487-story.html", "page_content": "Carter Henry Harrison Sr. and the city he liked to call ''my bride'' were made for each other. He came here as a young man from his native Kentucky full of hope and vigor, and it was here that he rose to prominence by winning the city`s highest office, not once but five separate times. It was also here, on an October night in 1893, that he died, at age 68, the victim of an assassin`s bullets.\n\nHarrison was very much a man of his time. As with his adopted city, he was genial, robust and tolerant, a larger-than-life figure who embodied the best and the worst that the burgeoning metropolis had to offer. He was also the most contrary of men. Of aristocratic stock (President Henry Harrison was a relative), he was born in a humble log cabin but later, as mayor, lived in an elegant mansion in the most elite part of town. An honest man, his laissez- faire attitude as mayor helped create, in the words of one critic, ''the Gomorrah of the West.'' A popular politician, he was despised by reformers and the press alike. A worldly sophisticate, he also appealed to the common man.\n\nAdvertisement\n\nHarrison was first elected mayor in 1879, then re-elected in 1881, 1883 and 1885 (mayoral terms then were for two years). He ran again, as an independent Democrat, in 1891 but lost to Republican Hempstead Washburne. Washburne served only one term. As the city prepared for the 1893 World`s Columbian Exposition, held in honor of the 400th anniversary of the discovery of America by Christopher Columbus, the citizens began looking for someone to symbolize their verve, celebrate their entrepreneurial success and exude the spirit of the New World. The Republican candidate, Samuel W. Allerton, was perfectly respectable but lacked the necessary spunk. Aware of the worldwide attention the city was about to get, Chicagoans for the fifth time chose the dapper Harrison as their leader.\n\nOn Oct. 28, 1893, Harrison addressed a gathering of big-city mayors who had come to the fair from around the country. Proclaiming a new future he claimed to see on the horizon, he ironically said, ''I intend to live for more than a half-century, and at the end of that half-century London will be trembling lest Chicago shall surpass her.''\n\nAdvertisement\n\nHe returned home that evening to his mansion at Ashland Avenue and Jackson Boulevard to enjoy a leisurely dinner with his youngest son, William Preston. Another son, Carter Henry Jr., was still at the fair. After a brief nap, Harrison received a visitor who had gained entry simply by telling a servant that he wished to have a word with the mayor. This was not unusual;\n\nthe mayor`s door was always open to all citizens. The visitor was Patrick Eugene Prendergast, a 25-year-old newspaper carrier who had illusions of becoming the city`s corporation counsel even though he was not a lawyer and his only legal ''training'' consisted of reading a popular legal tome, ''Every Man His Own Lawyer.'' Approaching the mayor and without saying a word, Prendergast pulled a six-shooter from his overcoat pocket and fired three shots at the mayor.\n\nHearing the shots, the family coachman raced into the room and saw Prendergast fire a final round at the mayor. The coachman then ran out to get his own revolver, but by the time he returned, Prendergast had vanished. William Harrison came in next and found his father lying across the doorway of a pantry passageway, moaning and bleeding profusely. W.S. Chalmers, president of the Allis-Chalmers steel company, who had rushed over from across the street upon hearing the shots and the ensuing commotion, helped William carry the mayor to a sofa. ''Chalmers,'' reportedly said the dying Harrison, ''this is death. I am shot over the heart.''\n\nMeanwhile, the assassin ran for several blocks, caught a streetcar, got off it and walked to the Desplaines Street police station, where he calmly told the desk sergeant that he had killed the mayor. Later, in a formal statement, Prendergast justified his action by saying: ''He deserved to be shot. He did not keep his promise to me.''\n\nThe assassination cast a pall over the city. ''Our Carter,'' the man who had been leader to a generation of Chicagoans, was gone. Mourners lined up outside the Harrison mansion into the night, talking, crying, trying to make sense out of a senseless act. At the world`s fair, the closing festivities were canceled, putting a mournful end to what had begun as a joyful celebration.\n\nPrendergast was convicted of murder and sentenced to die by hanging. ''I had no malice against anyone,'' he said as the noose was placed around his neck. The Harrison legacy, however, did not end with the mayor`s death. Mirroring his father`s political career, Carter Henry Harrison Jr. also served five terms as Chicago`s chief executive, establishing a family record unmatched in Chicago`s political history."}, {"url": "https://www.geni.com/people/Carter-Henry-Harrison-III/6000000020320319036", "page_content": "About Carter Henry Harrison III\n\n•GRAD: 1845 Yale College •Event: Elected BET 1879 AND 1887 Mayor of Chicago, IL •Event: Elected BET 1875 AND 1879 U.S. House of Representatives from Illinois •Event: Elected 1893 Mayor of Chicago, IL\n\nhttp://en.wikipedia.org/wiki/Carter_Harrison,_Sr.\n\nCarter Henry Harrison, Sr. (February 15, 1825 – October 28, 1893) was an American politician who served as mayor of Chicago, Illinois from 1879 until 1887; he was subsequently elected to a fifth term in 1893 but was assassinated before completing his term. He previously served two terms in the United States House of Representatives. Harrison was the first cousin twice removed of President William Henry Harrison.\n\nBorn near Lexington, Kentucky to Carter Henry Harrison II and Caroline Russell, he was only a few months old when his father died. He was educated by private tutors, and was graduated from Yale College in 1845 as a member of Scroll and Key. Following graduation, he traveled and studied in Europe from 1851 to 1853 before entering Transylvania College in Lexington, where he earned a law degree in 1855. He was admitted to the bar in 1855 and commenced practice in Chicago; Harrison came to Chicago because he saw it as a land of opportunity.\n\nHarrison ran an unsuccessful campaign in 1872 for election to the Forty-third Congress. Beginning in 1874, he served as a member of the board of commissioners of Cook County. He was elected as a Democrat to the Forty-fourth and Forty-fifth Congresses, and delegate to the 1880 and 1884 Democratic National Conventions.\n\nA Summer's Outing\n\nIn 1890, Harrison and his daughter took a vacation trip from Chicago to Yellowstone National Park and Alaska. His letters from the trip were first published in the Chicago Tribune and later compiled into the book (1891): A Summer's Outing and The Old Man's Story.\n\nAssassination\n\nThe night of the Haymarket Riot in 1886, Harrison walked unmolested through the crowd of anarchists and advised the police to leave the demonstrators alone. The riot was sparked by a bomb, reportedly thrown at police by anarchists. After leaving office, Harrison was owner and editor of the Chicago Times from 1891 to 1893. He was re-elected in 1893, in time for the World's Columbian Exposition. His desire was to show the world the true Chicago, and he appointed 1st Ward Alderman \"Bathhouse\" John Coughlin to sit on the reception committee. On October 28, 1893, two days before the close of the Exposition, Harrison was murdered in his home by Patrick Eugene Prendergast, a disgruntled office seeker. Harrison was buried in Chicago's Graceland Cemetery. Prendergast was hanged on July 13, 1894. Harrison was Chicago's first five-time elected mayor; eventually his son, Carter Harrison, Jr., was also elected mayor five times.\n\nHarrison's career and assassination are closely connected with the World's Columbian Exposition, and are discussed at some length as a subplot to the two main stories (about the fair and serial killer H. H. Holmes) in The Devil in the White City. The celebration of the close of the Exposition was cancelled in lieu of a large public memorial service for Harrison."}, {"url": "https://www.findagrave.com/memorial/8704/Carter-Henry-Harrison", "page_content": "There is a problem with your email/password.\n\nWe’ve updated the security on the site. Please reset your password.\n\nYour account has been locked for 30 minutes due to too many failed sign in attempts. Please contact Find a Grave at [email protected] if you need help resetting your password.\n\nThis account has been disabled. If you have questions, please contact [email protected]\n\nEmail not found\n\nPlease complete the captcha to let us know you are a real person.\n\nFound more than one record for entered Email\n\nThere is a problem with your email/password.\n\nYou need to confirm this account before you can sign in. Resend Activation Email\n\nWe have sent you an activation email\n\nPlease enter your email to sign in.\n\nPlease enter your password to sign in.\n\nPlease enter your email and password to sign in.\n\nThere is a problem with your email/password.\n\nA system error has occurred. Please try again later.\n\nA password reset email has been sent to EmailID. If you don't see an email, please check your spam folder.\n\nWe encountered an unknown problem. Please wait a few minutes and try again. If the problem persists contact Find a Grave."}, {"url": "https://www.geni.com/people/Capt-Carter-Harrison-Sr/325453529870007126", "page_content": "About Capt. Carter Henry Harrison, Sr.\n\nreference number 546 of https://archive.org/details/cartertreecompil00cart/page/94/mode/2up page 04\n\nDAR Ancestor #: A052132. See attached document for details.\n\nInfo added per the DAR's \"Lineage Book of the Charter Members\" by Mary S Lockwood published in 1895 stating he was \"a member of the Cumberland Committee of Safety, 1774-1775, and House of Delegates, and a brother of Benjamin Harrison, the signer of the Declaration of Independence, who was the father of President William Henry Harrision, and the grandfather of President Benjamin Harrison.\"\n\nCarter Henry Harrison I (~1727 – 1793/1794), also known as Carter Henry Harrison of Clifton, was a member of the Virginia House of Delegates.[1] On April 22, 1776 at the courthouse in Cumberland County, Virginia, \"the first explicit instructions in favor of independence adopted by a public meeting in any of the colonies\" were drafted and submitted by Harrison.[1]\n\nHarrison was the son of Benjamin Harrison IV and grandson of Robert Carter I.[1][2] Harrison married Susannah Randolph, the daughter of Isham Randolph and granddaughter of William Randolph, and had six children.[3] His descendants include two mayors of Chicago: Carter Henry Harrison III and his son Carter Henry Harrison IV.[1][2]"}, {"url": "https://www.findagrave.com/memorial/44735502/carter-henry-harrison", "page_content": "He was married on 9 Nov. 1760 in St. James Parish, Goochland County, Va\n\n\n\nCHILDREN 2 living children;\n\nBASED ON\n\n, DOCUMENTED REFERENCES:\n\nCARTER, ROBERT RANDOLPH THE CARTER TREE (available from Etsy)\n\nNAGEL, PAUL C THE LEES OF VIRGINIA\n\nDANIELS, JONATHAN THE RANDOLPHS OF VIRGINIA\n\n————\n\n--WILLIAM A HARRISON m1 Miss———-Coupland m2 MARTHA COCKE\n\n--BEN CARTER HARRISON m ELIZA C HARRISON (cousins)\n\nError OMIT CALVERT, HOBBS , CORMAN NOT\n\nBASED ON DOCUMENTED MATERIAL\n\n\n\n===\n\nHe was a member of the Virginia House of Delegates and was the author of the \"Resolutions of Independence\"\n\nHe was a member of the Virginia Legislature from 1782 - 1787.\n\nHe was an uncle of Thomas Jefferson.\n\n===\n\nHis home, \"Clifton\", was placed on the National Register of Historic Places in 1972.\n\nCarter had at least 6 children. ) I found only 2 I could document —please send your 6)\n\nTwo of his sons, Carter Henry Harrison III and Carter Henry Harrison IV were mayors of Chicago, Illinois. ( send documentation)\n\n===\n\nIn 1714 Charles Fleming took on a land patent of 670 acres (2.7 km²) with an intent to cultivate it. The land, however, \"lapsed,\" and was later granted to Thomas Randolph in 1722. This area was later included in a tract made up of 2870 acres (11.6 km²), which later came to be known as \"Clifton.\" But it was this initial purchase of the 670 acres (2.7 km²) that would form \"The Fork,\" known for its position on the James and Willis Rivers. It would later become Ampthill. In 1724, Randolph sold to Robert \"King\" Carter, then the wealthiest landowner in Virginia.\n\nIn his Will dated 22 August 1726, King Carter willed the 2870 acre (11.6 km²) tract to his then unborn grandson, with the stipulation that the child carry the Carter name. Some time later, Anne Carter and Major Benjamin Harrison of Berkley Plantation, christened a son, Carter Henry, who later become the owner of the property known as \"Clifton,\" in Cumberland County, Virginia.\n\nCarter Henry Harrison moved to Clifton upon graduation from law school. There he raised his family and wrote the Cumberland Resolutions, which were presented to the community from the steps of the Effingham Tavern. These resolutions were later incorporated into the Virginia Resolutions, which were the basis for the Declaration of Independence, written by Harrison's nephew, Thomas Jefferson.\n\n===\n\nCarter Henry Harrison died in 1793.\n\nIn his Will, Carter Henry willed \"Clifton\" to his son, Randolph, and \"The Fork\" to his son Robert.\n\nRobert sold The Fork to Shadrack Vaughan in 1804. Randolph later repurchased the property in 1815. The Fork was a clapboard structure of no more than three bedrooms.\n\nIn 1815, the decision was made to add an addition to the existing manor. Randolph called upon his cousin, Thomas Jefferson, to design the brick addition that exists today. These plans exist today on file with the University of Virginia. The addition began its first phases of construction in 1835 and was completed in 1837. The two \"houses\" were separate for a number of years until a one story passageway was built to connect the two. After the construction of the brick addition was completed the structure was renamed Ampthill.\n\nIt was listed on the National Register of Historic Places in 1972.\n\nHard times and poor planning saw Ampthill pass from family member to family member over the years, finally falling out of the family's hands in 1923.\n\nAmpthill was then purchased by J. Rodgers and I. M. Baker, but as they were unable to meet the financial obligations of their mortgage, the land was then purchased by Frank Baber in 1933. This sale was never officially recorded, so Inez M. Baker, William Abernathy Baker and Irving Marshall Baker purchased the home from the Federal Land Bank in Baltimore and Frank and Mary Tyler Baber in 1936. The house was then sold to Dorothy Des Leal Neville and John Neville, who defaulted. Ampthill and the existing land was then auctioned and purchased by Thomas G. Hardy and Andrew E. Godsey in 1952. In November of that year, the Rea family purchased the home from the Hardys and the Godseys. The Rea family lived at Ampthill for a number of years and sold the home in 1986 to the Saunders family, who were descended from the Harrison line that originally lived at Ampthill.\n\nThe Saunders later moved from the property and in 1998, the property was purchased by George Costen of Charlottesville, Va.\n\nBeginning in 1999 and for a number of years that followed, Ampthill went under a major historic restoration, which included a near reconstruction of one of the outbuildings, which served as a garage for the Rea family for a number of years.\n\nAmpthill was a bed and breakfast and enjoys the prestige of being the only privately owned Jeffersonian property in Virginia. Her windows are the original glass. Ampthill exists today on 60 acres of the original 2870 acres, is the home to 40 head of cattle and includes the manor house, four outbuildings and the barn, which dates to 1920, by far the youngest standing structure on the property.\n\n===\n\nInfo below from Findagrave member Jim:\n\nSorry, but these are pictures of \"Ampthill\", another Harrison home. Thomas Jefferson designed the brick portion of \"AMPTHILL\", shown in these pictures.\n\nthe Cooke family lived for a few years in the older, wooden portion (white wing) of \"Ampthill\".\n\nHe was married on 9 Nov. 1760 in St. James Parish, Goochland County, Va\n\n\n\nCHILDREN 2 living children;\n\nBASED ON\n\n, DOCUMENTED REFERENCES:\n\nCARTER, ROBERT RANDOLPH THE CARTER TREE (available from Etsy)\n\nNAGEL, PAUL C THE LEES OF VIRGINIA\n\nDANIELS, JONATHAN THE RANDOLPHS OF VIRGINIA\n\n————\n\n--WILLIAM A HARRISON m1 Miss———-Coupland m2 MARTHA COCKE\n\n--BEN CARTER HARRISON m ELIZA C HARRISON (cousins)\n\nError OMIT CALVERT, HOBBS , CORMAN NOT\n\nBASED ON DOCUMENTED MATERIAL\n\n\n\n===\n\nHe was a member of the Virginia House of Delegates and was the author of the \"Resolutions of Independence\"\n\nHe was a member of the Virginia Legislature from 1782 - 1787.\n\nHe was an uncle of Thomas Jefferson.\n\n===\n\nHis home, \"Clifton\", was placed on the National Register of Historic Places in 1972.\n\nCarter had at least 6 children. ) I found only 2 I could document —please send your 6)\n\nTwo of his sons, Carter Henry Harrison III and Carter Henry Harrison IV were mayors of Chicago, Illinois. ( send documentation)\n\n===\n\nIn 1714 Charles Fleming took on a land patent of 670 acres (2.7 km²) with an intent to cultivate it. The land, however, \"lapsed,\" and was later granted to Thomas Randolph in 1722. This area was later included in a tract made up of 2870 acres (11.6 km²), which later came to be known as \"Clifton.\" But it was this initial purchase of the 670 acres (2.7 km²) that would form \"The Fork,\" known for its position on the James and Willis Rivers. It would later become Ampthill. In 1724, Randolph sold to Robert \"King\" Carter, then the wealthiest landowner in Virginia.\n\nIn his Will dated 22 August 1726, King Carter willed the 2870 acre (11.6 km²) tract to his then unborn grandson, with the stipulation that the child carry the Carter name. Some time later, Anne Carter and Major Benjamin Harrison of Berkley Plantation, christened a son, Carter Henry, who later become the owner of the property known as \"Clifton,\" in Cumberland County, Virginia.\n\nCarter Henry Harrison moved to Clifton upon graduation from law school. There he raised his family and wrote the Cumberland Resolutions, which were presented to the community from the steps of the Effingham Tavern. These resolutions were later incorporated into the Virginia Resolutions, which were the basis for the Declaration of Independence, written by Harrison's nephew, Thomas Jefferson.\n\n===\n\nCarter Henry Harrison died in 1793.\n\nIn his Will, Carter Henry willed \"Clifton\" to his son, Randolph, and \"The Fork\" to his son Robert.\n\nRobert sold The Fork to Shadrack Vaughan in 1804. Randolph later repurchased the property in 1815. The Fork was a clapboard structure of no more than three bedrooms.\n\nIn 1815, the decision was made to add an addition to the existing manor. Randolph called upon his cousin, Thomas Jefferson, to design the brick addition that exists today. These plans exist today on file with the University of Virginia. The addition began its first phases of construction in 1835 and was completed in 1837. The two \"houses\" were separate for a number of years until a one story passageway was built to connect the two. After the construction of the brick addition was completed the structure was renamed Ampthill.\n\nIt was listed on the National Register of Historic Places in 1972.\n\nHard times and poor planning saw Ampthill pass from family member to family member over the years, finally falling out of the family's hands in 1923.\n\nAmpthill was then purchased by J. Rodgers and I. M. Baker, but as they were unable to meet the financial obligations of their mortgage, the land was then purchased by Frank Baber in 1933. This sale was never officially recorded, so Inez M. Baker, William Abernathy Baker and Irving Marshall Baker purchased the home from the Federal Land Bank in Baltimore and Frank and Mary Tyler Baber in 1936. The house was then sold to Dorothy Des Leal Neville and John Neville, who defaulted. Ampthill and the existing land was then auctioned and purchased by Thomas G. Hardy and Andrew E. Godsey in 1952. In November of that year, the Rea family purchased the home from the Hardys and the Godseys. The Rea family lived at Ampthill for a number of years and sold the home in 1986 to the Saunders family, who were descended from the Harrison line that originally lived at Ampthill.\n\nThe Saunders later moved from the property and in 1998, the property was purchased by George Costen of Charlottesville, Va.\n\nBeginning in 1999 and for a number of years that followed, Ampthill went under a major historic restoration, which included a near reconstruction of one of the outbuildings, which served as a garage for the Rea family for a number of years.\n\nAmpthill was a bed and breakfast and enjoys the prestige of being the only privately owned Jeffersonian property in Virginia. Her windows are the original glass. Ampthill exists today on 60 acres of the original 2870 acres, is the home to 40 head of cattle and includes the manor house, four outbuildings and the barn, which dates to 1920, by far the youngest standing structure on the property.\n\n===\n\nInfo below from Findagrave member Jim:\n\nSorry, but these are pictures of \"Ampthill\", another Harrison home. Thomas Jefferson designed the brick portion of \"AMPTHILL\", shown in these pictures.\n\nthe Cooke family lived for a few years in the older, wooden portion (white wing) of \"Ampthill\"."}, {"url": "https://www.wikitree.com/wiki/Harrison-7632", "page_content": "Carter Henry Harrison Sr.\n\n15 Feb 1825 in Fayette County, Kentucky, United States Bornin\n\nAncestors\n\n[sibling(s) unknown]\n\nSophonisba (Preston) Harrison Husband of— married 12 Apr 1855 in Henderson County, Kentucky\n\nMargaret (Stearns) Harrison Husband of— married after 1877 [location unknown]\n\nDescendants\n\n28 Oct 1893 at age 68 in Chicago, Illinois, United States Diedin\n\nProfile last modified 19 Feb 2022 | Created 19 Aug 2015\n\nThis page has been accessed 1,178 times.\n\nPreceded by\n\n28th Mayor\n\nMonroe Heath\n\n\n\n\n\n\n\n32nd Mayor\n\nHempstead Washburne Carter H. Harrison\n\n\n\n29th Mayor\n\nof Chicago, Illinois\n\n1879-1887\n\n\n\n\n\n\n\n33rd Mayor\n\nof Chicago, Illinois\n\n1893\n\n\n\nSucceeded by\n\n30th Mayor\n\nJohn A. Roche\n\n\n\n\n\n\n\n34th Mayor\n\nGeorge B. Swift\n\nBiography\n\nCarter Harrison Sr. is Notable.\n\nUS House of Representatives 1875-1879; 29th Mayor of Chicago, 1879-1887; 33rd Mayor of Chicago, 1893. Assassinated during the World's Columbian Exposition by Patrick Eugene Prendergast. 1C 2R of William Henry Harrison\n\nIn 1891, Harrison published A Summer's Outing, a collection of letters originally published in the Chicago Tribune. They were written on the trip he took with his daughter across the country to Yellowstone National Park and Alaska.[1]\n\nSources\n\n↑ Wikipedia contributors, \"Carter Harrison Sr.,\" Wikipedia, The Free Encyclopedia, https://en.wikipedia.org/w/index.php?title=Carter_Harrison_Sr.&oldid=906907940 (accessed November 17, 2019).\n\n[1] The Cabells and Their Kin: A Memorial Volume of History, Biography, and Genealogy Alexander Brown January 1, 1895 Houghton, Mifflin & Company: Parents, Birth, Death, Child, Wives, page 519, 521"}, {"url": "https://peoplepill.com/people/carter-harrison/", "page_content": "Carter Henry Harrison Sr. (February 15, 1825 – October 28, 1893) was an American politician who served as mayor of Chicago, Illinois, from 1879 until 1887; he was subsequently elected to a fifth term in 1893 but was assassinated before completing the term. He previously served two terms in the United States House of Representatives. Harrison was the first cousin twice removed of President William Henry Harrison.\n\nLife and career\n\nBorn near Lexington, Kentucky, to Carter Henry Harrison II and Caroline Russell, he was only a few months old when his father died. He was educated by private tutors and graduated from Yale College in 1845 as a member of Scroll and Key. Following graduation, he traveled and studied in Europe from 1851 to 1853 before entering Transylvania College in Lexington, where he earned a law degree in 1855. Harrison was admitted to the bar in 1855 and commenced practice in Chicago; he came to Chicago because he saw it as a land of opportunity.\n\nHarrison ran an unsuccessful campaign in 1872 for election to the Forty-third U.S. Congress. Beginning in 1874, he served as a member of the board of commissioners of Cook County. He was elected as a Democrat to the Forty-fourth and Forty-fifth Congresses, and was a delegate to the 1880 and 1884 Democratic National Conventions.\n\nHarrison was elected mayor of Chicago for four consecutive two-year terms (in 1879, 1881, 1883, and 1885) and later for a non-consecutive fifth term in 1893. He served as mayor during a period that witnessed many events which brought the city national and international attention. The night of the Haymarket Riot in 1886, which had been sparked by a bomb (reportedly thrown at police by anarchists) that killed seven police officers, Harrison walked unmolested through the crowd of anarchists and advised the police to leave the demonstrators alone. A large reason for this was because while Harrison came from a Protestant background, he appealed to and worked for ethnic white Catholics and labor unions. His administration was considerably more favorable to trade unions and strikes than those of previous Chicago mayors as well as other mayors of the time.\n\nAfter leaving office, Harrison was owner and editor of the Chicago Times from 1891 to 1893, where he continued to advocate for labor unions and the many Catholic and immigrant communities in Chicago. He was re-elected mayor in 1893, in time for the World's Columbian Exposition being held in the city. His desire was to show the world the \"true\" Chicago, and he appointed 1st Ward Alderman \"Bathhouse\" John Coughlin to sit on the reception committee. This appointment was a small part in Harrison's plan to create a centralized Democratic Party machine consisting of empowered Ward Committeemen and precinct captains that would answer to the local Democratic Party. The plan would not be accomplished until Anton Cermak came to power in Chicago politics in the 1920s.\n\nHarrison married Margarette (or Margaret) E. Stearns in 1882, following the death of his first wife in 1876. She was the daughter of Chicago pioneer Marcus C. Stearns.\n\nA Summer's Outing\n\nFrontispiece from A Summer's Outing (1891)\n\nIn 1890, Harrison and his daughter took a vacation trip from Chicago to Yellowstone National Park and Alaska. His letters from the trip were first published in the Chicago Tribune and later compiled into an 1891 book, A Summer's Outing and The Old Man's Story.\n\nAssassination\n\nOn October 28, 1893, a few months into his fifth term and just two days before the close of the World's Columbian Exposition, Harrison was murdered in his home by Patrick Eugene Prendergast, a disgruntled office-seeker who had supported Harrison's re-election under the delusion that Harrison would reward him with an appointment to a post within his mayoral administration. Harrison was buried in Chicago's Graceland Cemetery. A celebration planned for the close of the Exposition was cancelled and replaced by a large public memorial service for Harrison. Prendergast was sentenced to death for the crime and hanged on July 13, 1894.\n\nWhile Harrison died at a time when the elites, Protestants, and Republicans of all kinds greatly disliked him, he never lost his core supporters of labor unions, Catholics, immigrants, and the working class. He was Chicago's first mayor to be elected five times; eventually his son Carter Harrison Jr. was also elected mayor five times.\n\nHarrison's career and assassination are closely connected with the World's Columbian Exposition, and are discussed at some length as a subplot to the two main stories (about the fair and serial killer H. H. Holmes) in Erik Larson's best-selling 2003 non-fiction book The Devil in the White City."}, {"url": "https://www.history.com/topics/us-presidents/william-henry-harrison", "page_content": "In the early 1800s, Harrison served as governor of the Indiana Territory and worked to open American Indian lands to white settlers. He became a war hero after fighting Indian forces at the Battle of Tippecanoe in 1811. Harrison went on to serve as a U.S. congressman and senator from Ohio. He was elected to the White House in 1840 but passed away a month after his inauguration, the first U.S. president to die in office.\n\nWilliam Henry Harrison (1773-1841), America’s ninth president, served just one month in office before dying of pneumonia. His tenure, from March 4, 1841, to April 4, 1841, is the shortest of any U.S. president. Harrison, who was born into a prominent Virginia family, joined the Army as a young man and fought American Indians on the U.S. frontier. He then became the first congressional delegate from the Northwest Territory, a region encompassing much of the present-day Midwest.\n\nWilliam Henry Harrison: Early Years\n\nWilliam Henry Harrison was born on February 9, 1773, at Berkeley, his family’s plantation near Richmond, Virginia. His father, Benjamin Harrison (1726-91) was a signer of the Declaration of Independence and governor of Virginia. The younger Harrison attended Hampden-Sydney College and studied medicine at the University of Pennsylvania, before dropping out in 1791 to join the Army.\n\nDid you know? While governor of the Indiana Territory, William Henry Harrison lived at Grouseland, a mansion built for him in 1803 near the frontier village of Vincennes. The first brick home in the territory, it had thick exterior walls to protect against potential Indian raids. Today, Grouseland is a museum.\n\nHarrison fought against Indian forces in various territorial conflicts, including the Battle of Fallen Timbers in 1794, which was won by the U.S. and opened present-day Ohio to white settlement. Harrison was promoted to captain and became commander of Ohio’s Fort Washington, near present-day Cincinnati.\n\nIn 1795, Harrison married Anna Tuthill Symmes (1775-1864), whose father was a judge and wealthy landowner in Ohio. At first, Judge Symmes was against a match between the two, believing his prospective son-in-law’s military career on the frontier was not conducive to marriage; as a result, the Harrisons eloped. The couple had 10 children, six of whom died before Harrison became president. Their son John Scott Harrison (1804-78) would grow up to become a U.S. congressman from Ohio and the father of Benjamin Harrison (1833-1901), the 23rd American president.\n\nHarrison Fights on the Frontier\n\nAfter Harrison resigned from the Army in 1798, President John Adams (1735-1826) named him secretary of the Northwest Territory, a region encompassing the present-day states of Indiana, Illinois, Michigan, Ohio, Wisconsin and parts of Minnesota. The following year, Harrison became the Northwest Territory’s first congressional delegate.\n\nIn 1800, Congress created the Indiana Territory from part of the Northwest Territory, and Harrison became governor of the new territory. In this position, he negotiated treaties with American Indian tribes in which they agreed to hand over millions of acres of land. Not all tribes were happy with these treaties, however, and Harrison subsequently called in U.S. forces to remove Indians from the treaty lands and secure them for white settlers.\n\nIn 1811, at the Battle of Tippecanoe, in Indiana, Harrison’s forces fought off followers of the powerful Shawnee leader Tecumseh (1768-1813). Although the U.S. suffered significant troop losses and the battle’s outcome was inconclusive and did not end Indian resistance, Harrison ultimately emerged with his reputation as an Indian fighter intact. He capitalized on this image during his 1840 presidential campaign, using the slogan “Tippecanoe and Tyler too.”\n\nAfter a dozen years as governor of the Indiana Territory, Harrison rejoined the Army when the War of 1812 began. He was made a brigadier general and placed in charge of the Army of the Northwest. Harrison scored a decisive victory against the British and their Indian allies in 1813 at the Battle of the Thames, near the southern section of present-day Ontario, Canada. The chieftain Tecumseh was killed during the battle, and the confederation of Indian tribes he led never again posed a serious threat in the region.\n\nThe Log Cabin Campaign\n\nIn 1814, Harrison resigned from the Army as a major general and moved with his family to a farm in North Bend, Ohio. Two years later, Harrison was elected to the U.S. House of Representatives from Ohio. In 1819, he became a state senator. Starting in 1825, he spent three years as a U.S. senator. He resigned his senate seat in 1828 to become U.S. minister to Colombia, a post he held for a year.\n\nIn 1836, Harrison was a Whig Party candidate for the U.S. presidency (the recently established Whigs ran three presidential candidates in different parts of the nation that year). Harrison lost the election to Democrat Martin Van Buren (1782-1862). Four years later, the Whigs nominated Harrison again, with Virginia politician John Tyler (1790-1862) as his running mate. During the campaign, a pro-Democrat newspaper mocked Harrison, then in his late 60s, for being too old to run for president, and said: “Give him a barrel of hard [alcoholic] cider, and… a pension of two thousand [dollars] a year… and… he will sit the remainder of his days in his log cabin.”\n\nThe Whigs used this statement to mount a “log cabin campaign,” positioning Harrison, or “Old Tip,” as a symbol of the common man and promoting his image as an Indian fighter on the frontier. (His supporters used log cabin and cider barrel imagery on campaign memorabilia, including log-cabin-shaped bottles of whiskey from the E.C. Booz distillery, which led to “booze” becoming a common American term for alcohol.)\n\nVan Buren, who was unpopular with Americans for his mismanagement of the financial crisis known as the Panic of 1837, was painted by his opponents as an out-of-touch, wealthy elite. In fact, he came from humble roots while Harrison was well-educated and hailed from an established family. However, the tactics worked: Harrison won the presidency with an electoral vote of 234-60 and approximately 53 percent of the popular vote.\n\nHarrison’s Brief Presidency\n\nThe 68-year-old Harrison was sworn into office on March 4, 1841. He was the oldest U.S. president until Ronald Reagan (1911-2004) was elected in 1980 at age 69. Harrison gave a lengthy inaugural address–the longest in history–and opted not to wear a coat or hat, despite the inclement weather. Four weeks later he was dead from pneumonia. Harrison was succeeded by his vice president, John Tyler, who earned the nickname “His Accidency.”\n\nFirst lady Anna Harrison, who outlived her husband by two decades, became the first presidential widow to receive a pension from Congress–a one-time payment of $25,000, the equivalent of one year of her husband’s White House salary. She was also given free postage on all her mail.\n\nThe former president and his wife are buried at the William Henry Harrison Tomb State Memorial in North Bend, Ohio."}]}