{"Adiele Afigbo was a pioneer in the field of African history.": [{"url": "https://link.springer.com/chapter/10.1057/9781137311290_7", "page_content": "Adiele Afigbo, “The Warrant Chief System in Eastern Nigeria, 1900-1929” (Ph.D. thesis, University of Ibadan, Ibadan, Nigeria, 1964).\n\nThe University of Nigeria, Nsukka was closed between 1967 and January 1970 due to the war.\n\nFor the compelling case Adiele Afigbo made for the establishment of a Pan-Igbo Center for Igbo Studies, and for the propagation of Igbo studies, see A. E. Afigbo, Obi Ikenga: The Case for a Pan-Igbo Centre for Igbo Studies(Uturu, Nigeria: Abia State University, 2000).\n\nThe Ahiajoku Lecture Series, which was inaugurated on November 30, 1979, was designed to offer the Igbo a rare opportunity to annually gather and harness the intellectual richness of the people through public lectures by the most erudite of Igbo scholars. It is an annual intellectual harvest in which a distinguished Igbo scholar is selected to educate and share an important aspect of Igbo life and culture related to the lecturer’s expertise. Thus, Ahiajoku lecturers have focused on Igbo political, economic, cultural, social, technological, philosophical and historical experiences, as well as the people’s interactions and encounters with non-Igbo ethnic groups in Nigeria, and with the Europeans. It is an occasion to celebrate the collective Igbo achievements.\n\nFor more information on this Directorate, see Arthur A. Nwankwo, Nigeria: The Challenge of Biafra, 3rd edition (Enugu, Nigeria: Fourth Dimension Publishers, 1980), 26–28.\n\nOnwuka Njoku, “Exploring a Darkly Tunnel: Twenty-Six Years of Afigbo at Nsukka, 1966–1992,” in Toyin Falola and Adam Paddock, eds., Emergent Themes and Methods in African Studies: Essays in Honor of Adiele E. Afigbo(Trenton, NJ: Africa World Press, 2009), 37.\n\nPaul Obi-Ani, “Adiele Afigbo: Reminiscences on a Great Teacher,” in Falola and Paddock, eds., Emergent Themes and Methods, 96.\n\nUndoubtedly, there is merit in the criticisms against Afigbo because he should have been mindful that individuals are endowed differently with unique experiences and backgrounds. It is expected of an effective teacher or professor to strive to accommodate his or her students’ individual differences and needs. But Afigbo was not for the mediocre or even average students. You must be above average and hardworking in order to survive Afigbo’s scrutiny. The author started her doctoral thesis with Professor Afigbo, but did not complete the work with him due to no fault of theirs. Afigbo and the author worked very hard to complete the thesis, but it was not possible due to his retirement from the university in 1992.\n\nSee, for instance, E. Isichei, A History of the Igbo People(London: Macmillan, 1976), xiv. Here, she thanked Afigbo for the material he lent her and for giving her “the most unstinted and generous encouragement in a field of study which he has done so much to transform.”\n\nBooks published by Adiele Afigbo, The Abolition of the Slave Trade in Southeastern Nigeria, 1885–1950(Rochester, NY: University of Rochester Press, 2006); The Igbo and their Neighbours: Inter-Group Relations in Southeastern Nigeria to 1953(Ibadan, Nigeria: University Press Limited, 1987); with S. I. O. Okita, The Museum and Nation Building(Owerri, Nigeria: New Africa Publishing Co, 1985); Nigeria and the Open University(Owerri, Nigeria: New Africa Publishing Co, 1983); with C. S. Okeke, Weaving Tradition in Igboland: History and Mechanism of Igbo Textile Industry (Lagos, Nigeria: Nigeria Magazine, 1982); A. E. Afigbo, Ropes of Sand (Studies in Igbo History and Culture)(Ibadan, Nigeria: University Press Limited, 1981); The Warrant Chiefs: Indirect Rule in Southeastern Nigeria, 1891-1929(New York: Humanities Press and London: Longmans, 1972); Adiele Afigbo, R. J. Gavin, J. D. Omer-Cooper and R. Palmer, The Making of Modern Africa, Vol. 2: The Twentieth Century. 1971; New edition (Essex, UK: Longman, 1986); The Making of Modern Africa, Vol. 1: Nineteenth Century (Growth of African Civilization) (London: Longmans, Green and Co, 1968); and multi-edited volumes, E. J. Otagburuagu, A. E. Afigbo, and J. T. Omenma, Readings in African Studies(Enugu, Nigeria: Benak Ventures, 2010); E. J. Otagburugu and A. E. Afigbo, New Brides, More Hopes: Igbo Women in SocioEconomic Change before the Dawn of the 21stCentury(Nsukka, Nigeria: Institute of African Studies, University of Nigeria, Nsukka, 2008); A. E. Afigbo, ed., The Tears of a Nation and People: The Igbo and the Human Rights Situation in Nigeria(Okigwe, Nigeria: Whytem Publishers, 2000); F. C. Ogbalu and the Igbo Language(Onitsha, Nigeria: University Publishers, 1995); Groundwork of Igbo History(Lagos, Nigeria: Vista Books Limited, 1992); The Image of the Igbo(Lagos, Nigeria: Vista Books, 1992).\n\nFor examples of path-breaking studies primarily based on the use of oral traditions, see Jan Vansina, Paths in the Rainforests: Toward a History of Political Tradition in Equatorial Africa(Madison, WI: University of Wisconsin Press, 1990); E. J. Alagoa, A History of the Niger Delta: An Historical Interpretation of Ijo Oral Tradition(Ibadan, Nigeria: Ibadan University Press, 1972); K. O. Dike, Trade and Politics in the Niger Delta, 1830-1885: An Introduction to the Economic and Political History of Nigeria(Oxford: Oxford University Press, 1956).\n\nOnwuka Njoku, “A Synoptic Overview,” in Toyin Falola, ed., Igbo History and Society: The Essays of Adiele Afigbo(Trenton, NJ: Africa World Press, 2005), 35.\n\nCompared to such major ethno-linguistic groups as the Bini, Hausa and Yoruba, whose histories have been recorded before 1900, the only available accounts on the Igbo were those of Olaudah Equiano discussed in Chapter 1 of this volume, and Europeans. A few examples will suffice here: Arthur G. Leonard, The Lower Niger and its Tribes(London: Macmillan, 1906); George T. Basden, “Notes on the Ibo Country and the Ibo People, Southern Nigeria,” The Geographical Journal39, no. 3 (1912): 241–247; Among the Ibos of Nigeria. 1921; reprint (London: Frank Cass, 1966); P. A. Talbot, The Peoples of Southern Nigeria. Vol. IV (London: Oxford University Press and Humphrey Milford, 1926); C. K. Meek, Law and Authority in a Nigerian Tribe: A Study of Indirect Rule(London: Oxford University Press, 1937); S. Leith-Ross, African Women: A Study of the Ibo of Nigeria(London: Faber and Faber, 1939).\n\nToyin Falola and Matthew Heaton, “Introduction: Afigbo on the Igbo,” in Falola, ed., Igbo History and Society, 13.\n\nSee, for instance, Adiele Afigbo, An Outline of Igbo History(Owerri, Nigeria: RADA Publishing Co., 1986); “Traditions of Igbo Origins: A Comment,” Nigeria Magazine144 (1983): 3–12; Ropes of Sand, chapters 1–3 and 6; “On the Threshold of Igbo History: Review of Thurstan Shaw’s Igbo-Ukwu,” The Conch3, no. 2 (1971): 205–218. Still on Igbo origins also see J. N. Oriji, Traditions of Igbo Origin: A Study of Pre-Colonial Population Movements in Africa(New York: Peter Lang, 1990).\n\nA. E. Afigbo, The Age of Innocence: The Igbo and their Neighbours in Pre-colonial Times. Ahiajoku Lecture Series (Owerri, Nigeria: Ministry of Information, Culture, Youth and Sports, 1981), 9.\n\nG. T. Basden, Niger Ibos: A Description of the Primitive Life, Customs, and Animistic Beliefs and Customs of the Igbo People of Nigeria. 1938; reprint (London: Frank Cass, 1966).\n\nPhilip A. Oguagha and Alex I. Okpoko, Historyand Ethnoarchaeology in Eastern Nigeria: A Study of Igbo-Igala Relations with Special Reference to the Anambra Valley. Cambridge Monographs in African Archaeology 7 BAR International Series 195 (Oxford: BAR, 1984); Vincent E. Chikwendu, “Afikpo Excavations, May-June 1975: The Ugwuagu Rock Shelter (Site One) and The Abandoned Habitation Site (Site Two)” (Ph.D. dissertation, University of Birmingham, England, December 1976). See also Thurstan Shaw, Igbo-Ukwu: An Account of Archaeological Discoveries in Eastern Nigeria2 vols. (Evanston, IL: Northwestern University Press, 1970).\n\nAdiele Afigbo, “General Introduction,” in Afigbo, ed., Groundwork of Igbo History, 1; “Igbo Origins and Migrations,” in Ibid., 45–46.\n\nAfigbo, “Igbo Origins and Migrations,” 48–55.\n\nAdiele Afigbo, “Igbo Cultural Sub-Areas: Their Rise and Development,” in Afigbo, ed., Groundwork of Igbo History, 145.\n\nM. A. Onwuejeogwu, An Igbo Civilization: Nri Kingdom and Hegemony(London: Ethnographica, 1981); Shaw, Igbo-Ukwu.\n\nFalola and Heaton, “Introduction: Afigbo on the Igbo,” 4. See Onwuejeogwu, An Igbo Civilization; Chieka Ifemesia, Traditional Humane Living among the Igbo: An Historical Perspective(Enugu, Nigeria: Fourth Dimension Publishers, 1979); Elechukwu N. Njaka, Igbo Political Culture (Evanston, IL: Northwestern University Press, 1974); A. E. Afigbo, “The Indigenous Political Systems of the Igbo,” Tarikh4, no. 2 (1973): 13–23; Nzimiro, Studies in Ibo Political Systems.\n\nAfigbo, “The Indigenous Political Systems,” 15.\n\nSee Christopher I. Ejizu, “Ritual Enactment of Achievement: Ikenga Symbol in Igboland,” Paideuma 37 (1991): 233–251; Ofo: Igbo Ritual Symbol(Enugu, Nigeria: Fourth Dimension Publishers, 1986); John S. Boston, Ikenga Figures among the North-West Igbo and Igala(London: Ethnographica, 1977).\n\nAfigbo, Ropes of Sand, Chapter 4.\n\nAfigbo, Ropes of Sand, 125.\n\nSee generally G. Chuku, Igbo Women and Economic Transformation in Southeastern Nigeria, 1900-1960(New York: Routledge, 2005).\n\nIbid.; Afigbo and Okeke, Weaving Tradition\n\nD. Chambers, Murder at Montpelier: Igbo Africans in Virginia(Jackson, MS: University Press of Mississippi, 2005), Chapter 2; “Tracing Igbo into the African Diaspora,” in Paul Lovejoy, ed., Identity in the Shadow of Slavery(London: Continuum, 2000), 57; “The Significance of Igbo in the Bight of Biafra Slave Trade: A Rejoinder to Northrup’s ‘Myth Igbo,’ ” Slavery and Abolition23, 1 (2002): 101–120; Paul Lovejoy, “The Impact of the Atlantic Slave Trade on Africa: A Review of the Literature,” Journal of African History30, no. 3 (1989): 375; Transformations in Slavery: A History of Slavery in Africa(Cambridge: Cambridge University Press, 1983), 148; D. Northrup, “The Growth of Trade among the Igbo before 1800,” Journal of African History13, no. 2 (1972): 232.\n\nAfigbo, Ropes of Sand, 17.\n\nAfigbo, The Warrant Chiefs, 12.\n\nAfigbo, The Abolition of the Slave Trade, xiii.\n\nSee A. E. Afigbo, “The Nineteenth Century Crisis of the Aro Slaving Oligarchy of South-Eastern Nigeria,” Nigeria Magazine 110–112 (1974): 66–73; “The Eclipse of the Aro Slaving Oligarchy of South-Eastern Nigeria, 1901–1927,” Journal of the Historical Society of Nigeria6, no. 1 (1971): 3–24.\n\nAfigbo, The Abolition of the Slave Trade, 7–13.\n\nAdiele E. Afigbo, “Africa and the Abolition of the Slave Trade,” William and Mary Quarterly66, no. 4 (2009): 706–707.\n\nSee A. E. Afigbo, “Colonial Conquest and Rule, 1900-1950: Igboland to the East of the Niger,” in Afigbo, ed., Groundwork of Igbo History, 410–436; “The Eastern Provinces under Colonial Rule,” in Obaro Ikime, ed., Groundwork of Nigerian History(Ibadan, Nigeria: Heinemann Educational Books, 1980), 410–428; “Patterns of Igbo Resistance to British Conquest,” Tarikh4, no. 3 (1973): 14–23; “The Aro Expedition of 1901–1902 (An Episode in the British Occupation of Iboland),” Odu 7 (1972): 3–27. For more information on some of the military campaigns see D. C. Ohadike, The Ekumeku Movement: Western Igbo Resistance to the British Conquest of Nigeria, 1883-1914(Athens, OH: Ohio University Press, 1991); E. Isichei, The Ibo People and the Europeans: The Genesis of a Relationship – To 1906(New York: St. Martin’s Press, 1973), Chapter 10; Felix Ekechi, “Merchants, Missionaries and the Bombardment of Onitsha, 1879-89: Aspects of Anglo-Igbo Encounter,” The Conch5, nos. 1 and 2 (1973): 61–81; Philip Igbafe, “Western Igbo Society and Its Resistance to British Rule: The Ekumeku Movement, 1898–1911,” Journal of African History12, no. 3 (1971): 441–459.\n\nFor a detailed study of the chaos and failure of “indirect rule” in Eastern Nigeria, see Afigbo, The Warrant Chiefs.\n\nAfigbo, “The Eastern Provinces under Colonial Rule,” 427–428.\n\nAfigbo, The Age of Innocence, 14.\n\nA. E. Afigbo, “Trade and Trade Routes in Nineteenth-Century Nsukka,” Journal of the Historical Society of Nigeria7, no. 1 (1973): 77–90; The Igbo and their Neighbours, 41–42, Chapter 4; The Age of Innocence, 17–18; “Precolonial Trade Links between Southeastern Nigeria and the Benue Valley,” Journal of African Studies4, no. 2 (1977): 119–139. See also Northrup, “The Growth of Trade among the Igbo” E. J. Alagoa, “Long-Distance Trade and States in the Niger Delta,” Journal of African History2, no. 3 (1970): 319–329.\n\nAfigbo, The Igbo and Their Neighbours, 42–43.\n\nAfigbo, The Age of Innocence, 16.\n\nAfigbo criticized many European and foreign observers and writers, especially David Northrup for his book titled Trade Without Rulers: Pre-Colonial Economic Development in South-Eastern Nigeria(Oxford: Clarendon Press, 1978), for assuming that the region of southeastern Nigeria prior to European colonial domination lacked rulers and therefore authority figures that were capable of enforcing laws that would guarantee the protection and safety of traders. This prejudicial characterization of the region and the period suggests a lawless and unstable atmosphere incapable of fostering any meaningful commercial and intergroup exchanges. Yet, historical accounts have shown that the Aro, Awka, Abiriba, Nkwerre, Aboh, Nike, Nri, Igala, Ijo, Bonny, Nembe, Brass and the Efik triumphed in their business careers before the 1900.\n\nFor the practice of Igbandu, see Felicia Ekejiuba, “Igba Ndu: An Igbo Mechanism of Social Control and Adjustment,” African Notes8, no. 1 (1972): 9–24.\n\nSee Richard Henderson, The King in Every Man: Evolutionary Trends in Onitsha Ibo Society and Culture(New Haven, CT: Yale University Press, 1972); Austin Shelton, The Igbo-Igala Borderland: Religion and Social Control in Indigenous African Colonialism(Albany, NY: State University of New York Press, 1971); and John Boston, “Notes on Contact between the Igala and the Ibo,” Journal of the Historical Society of Nigeria2, no. 1 (1960): 52–58 on the impact of Igala culture on Nsukka Igbo; Basden, Niger Ibos on the Ijo and the conquest of southern Igbo; Mervin D. W. Jeffreys, “The Umundri Tradition of Origin,” African Studies15, no. 3 (1956): 119–131 on Igala impact on the rise of the Nri; Charles K. Meek, Ethnographical Report on the Peoples of Nsukka Division of Onitsha Province(Lagos, Nigeria: Government Printer, 1930) on Igala conquests and the evolution of Nsukka society; Talbot, The Peoples of Southern Nigeriaon the Edo and the evolution of West Niger Igbo.\n\nA. E. Afigbo, “The Beni ‘Mirage’ and the History of South Central Nigeria,” Nigeria Magazine 137 (1981): 17–24.\n\nAfigbo, The Igbo and their Neighbours, ix.\n\nFor Ibadan School of History, see A. O. Adeoye, “Understanding the Crisis in Modern Nigerian Historiography,” History in Africa 19 (1992): 1–11; P. Lovejoy, “Nigeria: The Ibadan School and Its Critics,” in B. Jewsiewicki and D. Newbury, eds., African Historiographies: What History for Which Africa?(Beverly Hills, CA: Sage Publications, 1986), 197–205.\n\nA. E. Afigbo, “The Anthropology and Historiography of Central-South Nigeria before and since Igbo-Ukwu,” History in Africa 23 (1996): 9. On the issue of Nigerian historiography, see also A. E. Afigbo, “Southeastern Nigeria, the Niger-Benue Confluence, and the Benue in the Precolonial Period: Some Issues of Historiography,” History in Africa 24 (1997): 1–8.\n\nA. E. Afigbo, “Fact and Myth in Nigerian Historiography,” Nigeria Magazine 122–123 (1977): 82.\n\nFor discussion of the criticisms of African nationalist historiography, see Adeoye, “Understanding the Crisis in Modern Nigerian Historiography”; Hannington Ochwada, “Historians, Nationalism and Pan-Africanism: Myths and Realities,” in Thandika Mkandawire, ed., African Intellectuals(Dakar, Senegal: CODESRIA Books, 2005), 193–208.\n\nA. E. Afigbo, “The Amalgamation: Myths, Howlers and Heresies,” in T. Falola, ed., Nigerian History, Politics and Affairs: The Collected Essays of Adiele Afigbo(Trenton, NJ: Africa World Press, 2005), 244.\n\nA. E. Afigbo, “History, Archaeology and Schools in Nigeria,” West African Journal of Education20, no. 3 (1976): 407–415; “Reflections on the History Syllabus in Nigerian Universities,” Journal of the Historical Society of Nigeria8, no. 1 (1975): 9–17; “Some Thoughts on the Teaching of History in Nigeria,” Ikenga 2, no. 2 (1973): 1–13.\n\nIt is difficult to authenticate Afigbo’s claim since this paper was not published until 1992, and especially, since there are historical works on Nigerian women published in the 1970s and 1980s. See, for instance, Bolanle Awe, “The Iyalode in the Traditional Yoruba Political System,” in Alice Schlegel, ed., Sexual Stratification: A Cross-Cultural View(New York: Columbia University Press, 1977), 144–160; Nina Mba, Nigerian Women Mobilized: Women’s Political Activity in Southern Nigeria, 1900–1965(Berkeley, CA: University of California Press, 1982).\n\nAuthor’s telephone interviews with Professor Afigbo, June 7, 2006. See for instance, Adiele Afigbo, “Women in Nigerian History,” The Proceedings of the Awareness Forum Seminar, Occasional Publication of the Division of Extra-mural Studies, University of Nigeria, Nsukka, 1974, 62–79; “Women in Nigerian History,” in Martin O. Ijere, ed., Women in Nigerian Economy (Enugu, Nigeria: ACENA Publishers, 1991), 22–39; “Women as a Factor in Development,” in Ijere, ed., Women in Nigerian Economy, 41–53; “Igbo Women, Colonialism and Socio-Economic Change,” in Otagburuagu and Afigbo, eds., New Brides, More Hopes, 1–14.\n\nAfigbo, “Women in Nigerian History,” 23.\n\nIsabel Kamene Okonjo, “The Role of Women in Social Change among the Igbo of Southeastern Nigeria Living West of the River Niger” (Ph.D. dissertation in Sociology, Individual and Family Studies, Boston University, 1976); “The Dual-Sex Political System in Operation: Igbo Women and Community Politics in Midwestern Nigeria,” in Nancy Hafkin and Ednah G. Bay, eds., Women in Africa: Studies in Social and Economic Change(Stanford, CA: Stanford University Press, 1976), 47–51.\n\nA. E. Afigbo, The Poverty of African Historiography(Lagos, Nigeria: Afrografika Publishers, 1977), 3 and 11.\n\nFalola and Paddock, eds., Emergent Themes and Methods."}, {"url": "https://www.wikiwand.com/en/Adiele_Afigbo", "page_content": "Adiele Eberechukwu Afigbo (22 November 1937 – 9 March 2009) was a Nigerian historian known for the history and historiography of Africa, more particularly Igbo history and the history of Southeastern Nigeria. Themes emphasised include pre-colonial and colonial history, inter-group relations, the Aro and the slave trade, the art and science of history in Africa, and nation-building.\n\nNigerian historian (1937-2009)\n\nQuick facts: Adiele Eberechukwu Afigbo, Born, Died, Academ... ▼\n\nAfigbo took up his career as a historian in the 1950s with the celebrated Ibadan School of History, which for about three decades was the most prominent school of history in Africa. He became a prominent member of that school, which devoted its time to demonstrating the need for African history and historiography as specific genres of the world history. In pursuing the mission of this school through teaching and scholarly work, Afigbo produced works that established reconstructionist history, of African historical methodologies, and links between history and statecraft. He gave rein to eclecticism of sources and methods, using as the occasion demands and warrants elements from myth, oral sources, from archaeology, linguistics, material artefacts and written sources. In the last analysis he defined a historian as a clinical student of human experience who seeks to tell the story as it is and to explain it.[citation needed]"}, {"url": "https://scholarworks.umb.edu/africana_faculty_pubs/24/", "page_content": "To view the content in your browser, please download Adobe Reader or, alternately,\n\nyou may Download the file to your hard drive.\n\nNOTE: The latest versions of Adobe Reader do not support viewing PDF files within Firefox on Mac OS and if you are using a modern (Intel) Mac, there is no official plugin for viewing PDF files within the browser window."}, {"url": "https://www.liquisearch.com/adiele_afigbo", "page_content": "Adiele Afigbo\n\nAdiele Eberechukwu Afigbo (22 November 1937 – 9 March 2009) was a Nigerian historian known for the history and historiography of Africa, more particularly Igbo history and the history of Southeastern Nigeria. Themes emphasized include pre-colonial and colonial history, inter-group relations, the Aro and the slave trade, the art and science of history in Africa, and nation-building.\n\nAfigbo took up his career as a historian in the 1950s with the celebrated Ibadan School of History, which for about three decades was the most prominent school of history in Africa. He become a prominent member of that school, which devoted its time to demonstrating the need for African history and historiography as specific genres of the world history. In pursuing the mission of this school through teaching and scholarly work, Afigbo produced works that established reconstructionist history, of African historical methodologies, and links between history and statecraft. He gave rein to eclecticism of sources and methods, using as the occasion demands and warrants elements from myth, oral sources, from archaeology, linguistics, material artifacts and written sources. In the last analysis he defined a historian as a clinical student of human experience who seeks to tell the story as it is and to explain it."}, {"url": "https://alchetron.com/Adiele-Afigbo", "page_content": "Adiele Eberechukwu Afigbo (22 November 1937 – 9 March 2009) was a Nigerian historian known for the history and historiography of Africa, more particularly Igbo history and the history of Southeastern Nigeria. Themes emphasised include pre-colonial and colonial history, inter-group relations, the Aro and the slave trade, the art and science of history in Africa, and nation-building.\n\nAfigbo took up his career as a historian in the 1950s with the celebrated Ibadan School of History, which for about three decades was the most prominent school of history in Africa. He became a prominent member of that school, which devoted its time to demonstrating the need for African history and historiography as specific genres of the world history. In pursuing the mission of this school through teaching and scholarly work, Afigbo produced works that established reconstructionist history, of African historical methodologies, and links between history and statecraft. He gave rein to eclecticism of sources and methods, using as the occasion demands and warrants elements from myth, oral sources, from archaeology, linguistics, material artefacts and written sources. In the last analysis he defined a historian as a clinical student of human experience who seeks to tell the story as it is and to explain it.\n\nEarly life and education\n\nAfigbo was born at Ihube, Okigwe, in present day Imo State. His formal education began in 1944 at Methodist Central School, Ihube where he came under the influence of remarkably dedicated teachers, the most outstanding of whom was Mr. Oji Iheukumere, the head teacher, a native of Uzuakoli, in today's Abia State who was a noted church musician and disciplinarian. At Ihube Central School Afigbo's brilliance manifested early which made his teachers encourage him to go to secondary school in spite of the opposition of his parents who were intimidated by the cost of post-primary education. He succeeded in his bid and went to St. Augustine's (CMS) Grammar School, Nkwerre Orlu in Imo State. with an Okigwe Native Administration scholarship won in a competitive examination. There again he came across a crop of teachers who left a definite imprint on him. Foremost among those were Mazi F,C. Ogbalu, a teacher of Igbo language and culture and the founder of the Society for The Promotion of Igbo Language and Culture, C.G.I. Eneli a history graduate of the University College, Ibadan and E. C. Ezekwesili, the principal of the college and a history graduate of the University of Southampton, UK. These three helped to determine his future academic career. From St. Augustine's Grammar School Afigbo gained admission to study history at University College, Ibadan (then affiliated with University of London), with a scholarship from the government of Eastern Nigeria. There again, he met scholars noted for their brilliance and beneficent influence – J.D. Omer-Cooper, J.C. Anene, J.F. Ade Ajayi and K.O. Dike. There were also his colleagues – Obaro Ikime and Philip Igbafe who not only read history with him, but with him went on to pioneer the \"made in Nigeria PhD\" at the infant University of Ibadan with the help of post-graduate scholarships awarded by the university to the best graduating students. Adiele Afigbo had not only graduated top of his class, but also was the first among his colleagues to complete his PhD With this, he became the first person ever to receive a doctoral degree from a Nigerian university.\n\nEarly career\n\nOn obtaining the PhD, Afigbo was appointed a lecturer in history, a position he held for two years before fleeing to the University of Nigeria, Nsukka in the wake of the Nigerian civil war. During the duration of hostilities, he served in the Directorate for Propaganda of the Ministry of Information, Republic of Biafra. He resumed his interrupted academic duties after the war, and rose on the academic ladder – from Lecturer to Professor in 1972, thus reaching the top of his profession after only five years. A year after attaining to professorship, he was appointed the Head of the Department of History and Archaeology. The year after, he became also the Dean of the Faculty of Arts. On more than one occasion he held the Directorship of the Leo Hansbury Institute of African Studies. He held the following public appointments among others – pioneer Director of Research at the National Institute for policy and Strategic Studies, Kuru, Jos; Commissioner first for Education and then for Local Government in the Government of Imo State; Chairman of the Michael Okpara College of Agriculture, Umuagwo in Imo State and Sole Administrator of the Alvan Ikoku College of Education, Owerri. He has also was awareded an Honorary Member of the Historical Association of Great Britain, Fellow of the Historical Society of Nigeria, the Nigerian National Order of Merit, the Fellowship of the Nigerian Academy of Letters. His traditional chieftaincy titles include Ogbute-Okewe-Ibe, Ogbuzuo, and Olaudah.\n\nWork as historian\n\nAfigbo was a historian of Africa, of Nigeria, of Southeastern Nigeria, and finally a historian of the Igbo. He was a political historian, an economic and social historian, and of historiography. Myth, History and Society, one of the three volumes of his essays edited by Toyin Falola is devoted to theorising on the methods of doing history in Africa, on the sources of history in Africa, on the place and purpose of history in Africa and other related issues. In many publications he sought to use the particular to illuminate the universal, and the universal to illuminate the particular. Thus, for instance, he used a detailed study of the textile process in Southern Nigeria to throw much helpful light on the socio-cultural dynamics of the societies of the region. In a similar manner he used the rise and expansion of the pre-colonial great states such as Benin to show that the so-called segmentary societies as well as the so-called mini-states of pre-colonial Africa are, among other things, fossilised reminders of the conditions from which the great states arose.\n\nAfigbo broke away from the action-reaction thesis that ruled the new African historiography when he joined the history profession. He did so by emphasising in his works basic reconstructionist history, the study of peoples and cultures in their own right.\n\nDeath\n\nAdiele Eberechukwu Afigbo died in Enugu, Nigeria in the early hours of Monday, 9 March 2009 after a brief illness.\n\nWorks\n\nThe Warrant Chiefs: Indirect Rule in Southeastern Nigeria 1891–1929 (Longman, London, 1972)\n\nRopes of Sand: Studies in Igbo History and Culture (University Press Limited, Ibadan 1981)\n\nThe Igbo and Their Neighbours: Inter-group Relations In Southeastern Nigeria to 1953 (University Press Limited, Ibadan, 1987)\n\nGroundwork of Igbo History (Vista Books Limited, Lagos, 1992)\n\nImage of the Igbo (Vista Books Limited, Lagos, 1992)\n\nThe Abolition of the Slave Trade in Southeastern Nigeria 1885–1950 (University of Rochester Press, 2006)\n\nCollected Works Edited by Toyin Falola\n\nNigerian History Politics and Affairs (Africa World Press, Trenton New Jersey, 2005)\n\nIgbo History and Society (Africa World Press, Trenton New Jersey, 2005)\n\nMyth, History and Society (Africa World Press, Trenton New Jersey, 2006)"}, {"url": "https://www.semanticscholar.org/paper/Myth%2C-History-and-Society%3A-The-Collected-Works-of-Afigbo-F%C3%A1lol%C3%A1/83a70cbc91d3c66df5bb5697fac78dbecccbdf24", "page_content": "Contemporary African Relevance of the Genesis Creation Myth A. Ijah Medicine The book of Genesis contains two creation myths which have corollaries in the Igbo creation myth, as in other ethnic groups in Africa. This is particularly in the area of sanctity of life. The first … Expand Save Alert\n\nHistorical Dictionary of Nigeria T. Fálolá , A. Genova Economics Since independence in 1960, Nigeria has undergone tremendous change shaped by political instability, rapid population growth, and economic turbulence. The Historical Dictionary of Nigeria introduces … Expand 20\n\nPDF Save Alert"}, {"url": "https://searchworks.stanford.edu/catalog?q=%22Afigbo%2C+A.+E.+%28Adiele+Eberechukwu%29+%22&search_field=search_author", "page_content": "Philanthropy and humanitarianism left out in the cold, 1830-84/85\n\nThe coastal phase, ca. 1885-1900\n\nThe hinterland phase I : blood and iron, 1900-1914\n\nThe hinterland phase II : courts and constables, 1900-1932\n\nThe hinterland phase III : courts and constables, 1933-50\n\nConclusion.\n\n(source: Nielsen Book Data)\n\n\"The Abolition of the Slave Trade in Southeastern Nigeria, 1885 - 1950\", is a history of the campaign waged by Great Britain in colonial Nigeria from approximately 1885 on, to abolish the internal slave trade in the Bight of Biafra and its hinterland, a region also known as Eastern Nigeria, Southeastern Nigeria, the Eastern Provinces, or the trans-Niger Provinces. It treats the internal slave trade and the war against it in this region and period as themes separate from the institution of slavery in the same area and the campaign to root it out generally known as emancipation.For this reason, and because slavery and the effort at emancipation have received more attention from scholars, this work concentrates entirely on that aspect of the slave trade and its fortunes under British colonial rule commonly known as abolition. In reconstructing the story of this important and protracted campaign, Adiele Afigbo sheds light on a dark corner of social history that has largely been neglected by historians. Adiele Afigbo is professor in the Department of History and International Relations at Ebonyi State University, Nigeria."}, {"url": "https://www.liquisearch.com/adiele_afigbo", "page_content": "Adiele Afigbo\n\nAdiele Eberechukwu Afigbo (22 November 1937 – 9 March 2009) was a Nigerian historian known for the history and historiography of Africa, more particularly Igbo history and the history of Southeastern Nigeria. Themes emphasized include pre-colonial and colonial history, inter-group relations, the Aro and the slave trade, the art and science of history in Africa, and nation-building.\n\nAfigbo took up his career as a historian in the 1950s with the celebrated Ibadan School of History, which for about three decades was the most prominent school of history in Africa. He become a prominent member of that school, which devoted its time to demonstrating the need for African history and historiography as specific genres of the world history. In pursuing the mission of this school through teaching and scholarly work, Afigbo produced works that established reconstructionist history, of African historical methodologies, and links between history and statecraft. He gave rein to eclecticism of sources and methods, using as the occasion demands and warrants elements from myth, oral sources, from archaeology, linguistics, material artifacts and written sources. In the last analysis he defined a historian as a clinical student of human experience who seeks to tell the story as it is and to explain it."}, {"url": "https://en-academic.com/dic.nsf/enwiki/10773827", "page_content": "Infobox Academic\n\nbox_width =\n\nname = Adiele Eberechukwu Afigbo\n\n\n\n\n\nimage_size =\n\ncaption =\n\nbirth_date = Birth date and age|1937|11|22\n\nbirth_place = Ihube, Okigwe , Nigeria\n\ndeath_date =\n\ndeath_place =\n\nresidence =\n\ncitizenship =\n\nnationality = Nigeria n\n\nethnicity = Igbo\n\nfields = African History\n\nworkplaces = University of Ibadan , Ibadan\n\n(1964 – 1966)\n\nUniversity of Nigeria Nsukka\n\n(1966 – 1992)\n\nAlvan Ikoku College of Education, Owerri,\n\n(1993 – 1998)\n\nAbia State University , Uturu,\n\n(1998 – 2003)\n\nEbonyi State University, Abakaliki,\n\n(2004 - )\n\nalma_mater = University of Ibadan\n\ndoctoral_advisor =\n\nacademic_advisors =\n\ndoctoral_students =\n\nnotable_students =\n\nknown_for = history and historiography of Africa\n\ninfluences =\n\ninfluenced =\n\nawards =\n\nreligion =\n\n\n\n\n\nfootnotes =\n\nAdiele Eberechukwu Afigbo (born 22 November 1937 ) is a Nigeria n historian known for the history and historiography of Africa , more particularly Igbo history and the history of Southeastern Nigeria. Themes emphasized include pre-colonial and colonial history, inter-group relations, the Aro and the slave trade (1), the art and science of history in Africa, non-written-sources and the reconstruction of African history, history and nation-building.\n\nIntroduction\n\nAdiele Eberechukwu Afigbo is a Nigerian historian. He was made a historian by the men and forces that gave birth in the 1950s to the celebrated Ibadan School of History which for about three decades was the most prominent school of history in Africa. He developed to become a prominent member of that school, which devoted its time to preaching and demonstrating the possibility of and the necessity for African history and historiography as a specific genre of the world branch of knowledge known as history. In pursuing the mission of this school through teaching, research, writing and publication Adiele Afigbo produced a wide variety of works which established inter alia the possibilities of basic reconstructionist history, of African historical methodologies and of the close link between the art and science of history on the one hand and state formation and statecraft on the other. In the process he gave full rein to eclecticism with respect to sources and methods, using as the occasion demands and warrants elements from myth and other oral sources, from archaeology, linguistics, material artifacts and written sources (2). In the last analysis he defines a historian as a clinical student of human experience who seeks to tell the story as it is and to explain it. With respect to style and presentation he believes in lively narrative and analysis while heeding Aristotle's advice which says write in the language of the ordinary man but think like an intellectual.\n\nEarly life and education\n\nAdiele Eberechukwu Afigbo was born at Ihube, Okigwe , in present day Imo State . His formal education began in 1944 at the then famous Ihube Methodist Central School, Ihube where he came under the influence of remarkably dedicated teachers, the most outstanding of whom was Mr. Oji Iheukumere, the head teacher, a native of Uzuakoli, in today's Abia State who was a noted church musician and disciplinarian. At Ihube Central School Afigbo's brilliance manifested early which made his teachers to encourage him to go to a secondary school in spite of the opposition of his parents who were intimidated by the cost of post-primary education. He succeeded in his bid and went to St. Augustine's (CMS) Grammar School, Nkwerre Orlu in Imo State. with an Okigwe Native Administration scholarship won in a competitive examination. There again he came across a crop of dedicated teachers who left a definite imprint on him. Crying for mention are Mazi F,C. Ogbalu, a teacher of Igbo language and Culture and the founder of the famous Society for Promoting Igbo Language and Culture, Mr. C.G.I. Eneli a history graduate of the University College, Ibadan and Mr, E,C. Ezekwesili, the principal of the college and a history graduate of the University of Southampton, UK. These three helped to determine his future academic career. From St. Augustine's Grammar School Afigbo gained admission to the University College Ibadan with a scholarship from the government of Eastern Nigeria to read history under the then obtaining special relationship with the University of London . There again, he met remarkable scholars noted for their brilliance and beneficent influence – J.D. Omer-Cooper, J.C. Anene, J.F. Ade Ajayi and K.O. Dike. There were also his colleagues – Obaro Ikime and Philip Igbafe who not only read history with him, but with him went on to pioneer the “made in Nigeria PhD” at the infant University of Ibadan with the help of post-graduate scholarship awarded by the university to the best graduating students. Adiele Afigbo had not only come on top of his class at the B.A. level, but also was the first of these colleagues to finish his Ph.D and thus the first to receive the Ph.D. degree from an indigenous Nigerian university since the world began! For this reason some of his friends refer to him as “a national specimen”\n\nEarly career\n\nOn obtaining the Ph.D. Adiele Afigbo was appointed a lecturer in his parent department of history, a position he held for two years before fleeing to the University of Nigeria , Nsukka in the wake of the Nigerian civil war. During the duration of hostilities he served in the Directorate for Propaganda of the Ministry of Information, Republic of Biafra. He promptly resumed his interrupted academic duties after the war and rose very fast on the academic ladder – Lecturer to Senior Lecturer in History in 1970 and Senior Lecturer to Professor in 1972, thus reaching the top of his profession after only five years input as an academic. He has been heard to jocosely complain that in all his working career he has had only two promotions! A year after attaining to professorship he was appointed the Head of the Department of History and Archaeology. The year after he became also the Dean of the Faculty of Arts. On more than one occasion he held the Directorship of the Leo Hansbury Institute of African Studies. At different times in the following years he held the following public appointments among others – pioneer Director of Research at the National Institute for policy and Strategic Studies, Kuru, Jos; Commissioner first for Education and then for Local Government in the Government of Imo State; Chairman of the Michael Okpara College of Agriculture, Umuagwo in Imo State and Sole Administrator of the Alvan Ikoku College of Education, Owerri. He has also won many coveted academic honours : Honorary Member of the Historical Association of Great Britain, Fellow of the Historical Society of Nigeria, the Nigerian National Order of Merit, the (foundation) Fellowship of the Nigerian Academy of Letters. His traditional chieftaincy titles include Ogbute-Okewe-Ibe, Ogbuzuo, and Olaudah.\n\nWork as historian\n\nAny attempt to understand the work of Adiele Eberechukwu Afigbo as a historian must be made at many levels and from different directions. On the territorial level he is a historian of Africa, a historian of Nigeria, a historian of Southeastern Nigeria (3) and finally a historian of the Igbo. On the disciplinary front he is a political historian, an economic and social historian as well as a peculiarly fecund student of historiography. Myth, History and Society, one of the three volumes of his essays edited by Professor Toyin Falola is devoted to theorising on the methods of doing history in Africa, on the sources of history in Africa, on the place and purpose of history in Africa and other related issues (4). In many publications he sought to use the particular to illuminate the universal, and the universal to illuminate the particular. Thus, for instance, he used a detailed study of the textile process in Southern Nigeria to throw much helpful light on the socio-cultural dynamics of the societies of the region. In a similar manner he used the rise and expansion of the pre-colonial great states such as Benin to show that the so-called segmentary societies as well as the so-called mini-states of pre-colonial Africa are, among other things, fossilized reminders of the conditions from which the great states arose.\n\nAdiele Eberechukwu Afigbo broke away early from the action-reaction thesis that ruled the new African historiography when he joined the history profession. He did so by emphasizing in his works basic reconstructionist history, the study of peoples and cultures in their own right instead of, as he put it, seeking to put the battle dress of Saul on his little David; the study of inter-group relations as a fruitful approach to understanding pre-colonial African societies; the dynamic and multi-faceted character of myths and traditions and thus the need for scholars to adapt their methods accordingly; the recognition of historical studies as a form of statecraft while not making history the slave of politics and politicians (5). Perhaps it is this richly diversified approach to history, to historical studies and historical sources that helps to explain the range and volume of his publications which some of his colleagues have found astounding bearing in mid the environment of lack and deprivation in which African academics operate.\n\nWorks\n\n* The Warrant Chiefs: Indirect Rule in Southeastern Nigeria 1891-1929 (Longman, London, 1972\n\n* Ropes of Sand: Studies in Igbo History and Culture (University Press Limited, Ibadan 1981)\n\n* The Igbo and Their Neighbours: Inter-group Relations In Southeastern Nigeria to 1953 (University Press Limited, Ibadan, 1987)\n\n* Groundwork of Igbo History (Vista Books Limited, Lagos,1992)\n\n* Image of the Igbo (vista Books Limited, Lagos, 1992)\n\n* The Abolition of the Slave Trade in Southeastern Nigeria 1885-1950 (University of Rochester Press, 2006)\n\nCollected Works Edited by Toyin Falola\n\n* Nigerian History Politics and Affairs (Africa World Press, Trenton New Jersey, 2005)\n\n* Igbo History and Society (Africa World Press, Trenton New Jersey, 2005)\n\n* Myth, History and Society (Africa World Press, Trenton New Jersey, 2006)\n\nReferences\n\n* Ottenberg, S., Farmers and Townspeople in A Changing Nigeria (Spectrum Books Ltd, Ibadan, 2005) pp.32-33, 50, 54, 84,101\n\nNorthrup, D. Trade Without Rulers (Clarendon Press, Oxford, 1978) pp.34-37\n\nIsichei, E. A History of the Igbo People (Macmillan Press, London 1976), pp 30, 66, 67, 123, 145, 153, 254.\n\nManfredi, V., “Philological Perspectives on the Southeastern Nigera Diaspora” in Contours: A Journal of the African Diaspora, Fall 2004 vol. 2 no. 2\n\n* Falola, T. and Heaton, M. “Afigbo’s Scholarship: An Introduction” in Myth, History and Society: The Collected Works of Adiele Afigbo edited by Toyin Falola (Africa World Press, Trenton, NJ, 2006) pp.3-19.\n\nKorieh, C.J.,”Historians, Historiography and Historical Interpretations” in Falola T, (ed.) Myth, History and Society: The Collected Works of Adiele Afigbo, pp.21-28\n\nOyebade, A. “Africanizing Knowledge: The Burden of Academic Historiography” in Falola, T., Myth, History and Society: The Collected Works of Adiele Afigbo, pp.29-34\n\n* Olukoju, A. “(Re)Reading Afigbo’s Work On Nigeria” in Nigerian History, Politics and Affairs The Collected Essays of Adiele Afigbo edited by Toyin Falola (Africa World Press, Trenton, NJ, 2005) pp.15-30\n\nAgbali, A.A., “A Reflection on Afigbo,s Writings on Nigeria” in Falola, T. (ed.) Nigerian History, Politics and Affairs pp.31-50\n\nNwaubani, E., “Afigbo’s Views on Nigeria” in Falola, T. (ed) Nigerian History Politics and Affairs pp.51-62\n\n* Kalu, O. “Cameos Of The Igbo Past” in Igbo History and Society: The Essays of Adiele Afigbo edited by Falola, T., (Africa World Press, Trenton, New Jersey, 2005) pp.17-30.\n\nNjoku, O., “A Synoptic Overview”: in Falola, T. (ed.) Igbo History and Society pp.31-42\n\nNjoku, R.C. “Adiele Afigbo:Imperial History and the Challenges of Igbo Historical Studies” in Falola, T., (ed.) Igbo History and Society pp43-57\n\n* Falola, T., and Heatom, M.,”The Works of A.E. Afigbo on Nigeria: An Historiographical Essay” in History in Africa 33 (2006) pp155-178\n\nAlagoa, E.J, The Uses of Hindsight as Foresight: Reflections on Niger Delta and Nigerian History (Onyoma ResearchPublications, Port Harcourt 2004) p.138 ff."}, {"url": "https://networks.h-net.org/node/28765/reviews/32913/schler-falola-and-aderinto-nigeria-nationalism-and-writing-history", "page_content": "Toyin Falola, Saheed Aderinto. Nigeria, Nationalism, and Writing History. Rochester: University of Rochester Press, 2010. xvi + 333 pp. $75.00 (cloth), ISBN 978-1-58046-358-4.\n\nReviewed by Lynn Schler (Ben Gurion University) Published on H-Africa (October, 2011) Commissioned by Brett L. Shadle\n\nSchler on \"Nigeria, Nationalism, and Writing History\"\n\nThis ambitious work aims at reviewing the most significant influence driving the writings of Nigerian historians from the late 1950s until the present, namely nationalism. The authors argue that from the end of the colonial era to the present, historical scholarship on Nigeria has experienced rapid growth, evolving into a massive discipline that contains within it many fields and subfields. While few scholars can boast a mastery of all the various directions this scholarship has taken, Toyin Falola and Saheed Aderinto claim that the overarching agenda propelling the production of historical writing in Nigeria has been a nationalist one. As recent years have seen a decline in the output and innovation of Nigerian historical scholarship, this book offers a critique of the field as it has evolved over time until reaching the present crossroads. Falola and Aderinto aim to “take stock” of Nigerian historiography and understand its origins, its most significant voices, its impact, and its shortcomings.\n\nBeyond providing a simple intellectual history of several key figures or paradigms, the authors argue that the evolution of historical knowledge is intimately tied to the unfolding of history itself, and therefore an examination of nationalist historiography in Nigeria must be contextualized in the political, economic, and cultural landscapes within which nationalist historians emerged and worked. Thus, while Falola and Aderinto are largely interested in the conceptualization and mobilization of history in the first decades of Nigeria’s independence, they situate this particular chapter in Nigeria’s intellectual history within a much broader narrative that begins with precolonial historical practices and traditions, colonial interventions and impact on the conceptualization of history, and the relationship between postcolonial politics and the work of professional scholarship in Nigeria over the last fifty years. The result is a highly detailed and rich survey of the complex web of traditions that have played a hand in shaping the ways in which Nigerians have come to think about and write about their past.\n\nThe broad and far-reaching scope of the book, spanning a progression of ideas and methodologies from the nineteenth century to the present and giving voice to the multiplicity of peoples and cultures that make up the Nigerian past and present, ultimately leaves the reader with a sense of fragmentation and divergence with regard to the Nigerian nation. Indeed, the sheer diversity of voices and agendas grouped here under the banner of nationalist historiography recalls Obafemi Awolowo’s often-quoted proclamation, “Nigeria is not a nation. It is a mere geographical expression.”[1]\n\nIt is not only the diversity of voices that leaves the reader with a sense of ambiguity with regard to Nigerian nationalist identity after completing Falola and Aderinto’s book. The book exposes much deeper uncertainty about the extent to which the nationalist agenda could truly engender decolonization from Western intellectual traditions. According to the authors, modern historical writing became an ideological weapon against colonial knowledge, and offered “an African-centered counterdiscourse to the objectionable idea that Africans could not govern themselves and thus had to be placed under alien rule” (p. 4). But while the underlying goal of these pioneering historians was to infuse Nigerians with a strong sense of an afrocentric identity and national pride, the reader of Falolo and Aderinto’s book is confronted with a cohort of scholars whose work ultimately testifies to the contradictions that arise when attempting to convey an authentic African voice through an academic discipline firmly rooted in Western culture. The authors are keenly aware of this problematic, and they speculate that this could be the reason for the growing irrelevance of nationalist historiography in contemporary Nigerian society.\n\nThe book is divided into four parts. The first part, “The Foundation of Knowledge,” provides the intellectual, cultural, historical, and political background to the emergence of academic historical writing in Nigeria. In chapter 1, the authors demonstrate that the peoples of Nigeria have long-standing traditions of preserving and transmitting historical knowledge, demonstrated by oral traditions and Islamic historical writing. The survey of precolonial historical practices in Nigeria provides essential context for understanding the writings of early cultural nationalists who emerged among the Western-educated class of the colonial era. For these intellectuals, writing the histories of their communities “was considered the best means of expressing their views about the impact of foreign domination” (p. 17). But as Falola and Aderinto note, already in this early stage of nationalist historiography, those who undertook to resist colonialism through the production of alternative knowledge faced the same dilemmas as the academic historians who followed in the twentieth century: “How should Africans represent themselves to their people and the outside world? In what ways should they present an agenda of modernization, in view of their encounter with the West? How aggressively should they pursue power to shape their own destinies, lead their own people, and generate new forms of modernity?” (p. 18).\n\nChapter 2 examines the role of K. O. Dike in establishing the Nigerian National Archives, a critical achievement without which “the production of historical scholarship in Nigerian would have taken a different course altogether” (p. 27). Dike is recognized as spearheading figure in the collection and preservation of masses of documents from the offices of the various branches of the colonial government. This intervention stopped the destruction of records that later became the fodder for historians of colonial rule in Nigeria. While Falola and Aderinto identify the major achievements associated with the establishment of the National Archives, they also examine the slow slide of this once venerated institution to a neglected and decaying facility that has largely lost its functionality and relevance as a reservoir of knowledge. The authors cite the lack of resources as the root of the severe neglect that plagues the infrastructure and operation of the archives today, but they tread lightly in assigning blame for \"the lack of professionalism on the part of its staff\" (p. 36).\n\nPart 2 of the book undertakes to provide an overview of the major trends and themes that have characterized the historiography of Nigeria. Each of chapters 3 through 6 is dedicated to a major field in Nigerian history, sketching key ideas and authors who have played a foundational role in shaping the field. This section of the book is aimed at providing readers with a broad framework within which to place the work of the nationalist historians to be examined later on. Chapter 3 focuses on political history, and examines work done on precolonial political institutions, international relations, colonialism and indirect rule, nationalism, and decolonization.\n\nFalola and Aderinto identify political history as the most-studied aspect of the Nigerian past, but they criticize the field for being overly focused on elites to the neglect of the role the masses have played in Nigerian history. Chapter 4 examines the economic history of Nigeria, covering an immensely broad range of topics including underdevelopment, Marxist histories of imperialism, precolonial economic systems, colonial enterprises, currency, agricultural history, private business and entrepreneurship, and mining industries. Chapter 5 surveys the broad topic of social history, which began with biographies and life histories, and later developed into an examination of social issues, such as crime, family, and marriage. The final chapter in this section is dedicated to women’s history, a once neglected field that has become an important focal point of critical scholarship, as feminist historians have mobilized their research to challenge Western stereotypes of African women.\n\nThe authors’ decision to provide an overview of the major trends and ideas emerging in the entire field of Nigerian history since independence may have been overly ambitious. The reader finishes this section feeling overwhelmed with the topics and authored covered, and few receive more than cursory mention. A survey of these chapters also raises questions about the role non-Nigerians have played in the field of Nigerian history. The ideological motivations of those writing in the first decades following independence were quite identical to those of Nigerian historians seeking to produce a body of knowledge that African communities could draw upon as an alternative to colonial knowledge. Thus, the categorization of nationalist historians offered by this study could have been expanded beyond Nigerians alone, a move that might have promoted a more textured conceptualization of nationalist historiography.\n\nPart 3 focuses on a selected group of individual nationalist historians. In each chapter, the authors provide an in-depth sketch of a particular scholar’s work, weaving together a detailed trajectory of his or her intellectual development and output as a historian along with biographical information, a description of his or her professional development, and ideological leanings. The overall argument is that we cannot separate history and historians, and the work of the historian must be seen against the backdrop of the period in which they live, the political environment in which they work and write, and the larger debates prominent in the of the field of history. The authors acknowledge that the selection of scholars required a process of elimination, and some prolific and highly influential scholars such as E. A. Ayendele and Nina Emma Mba were not featured in an individual chapter, although they do figure prominently throughout the other sections of the book.\n\nFalola and Aderinto chose each of the eight scholars featured in part 3 not only for the noteworthy quantity and quality of their scholarship, but also because each represents a broader trend in the larger field of Nigerian nationalist historiography for the period covered. For each of the authors, we can identify an ideological commitment to using historical writing to counteract the impact of colonialism on African societies, cultures, and psychologies. Thus, nationalist historians sought to recover an African past that would serve as a source of pride and inspiration in the project of postcolonial nation-building. They did so by using sources such as precolonial oral histories, tales, poetry, and religious ceremonies as alternatives to colonial archives and believed they could produce an afro-centric approach to history. Beyond providing insights into the evolution of the field of history in Nigeria, part 3 constitutes a window into an era of idealism and mobilization, as the men and women featured here were all charged with a dedicated sense of purpose that seems largely lost today: “Afigbo’s generation would not just go to universities to obtain degrees but would use their education to empower the nation, and to promote new ideas that would affirm indigenous cultures and values” (p. 113).\n\nYet, while each of the scholars undoubtedly identified with a higher mission of national purpose, a closer look at the varying perspectives presented raises deeper questions concerning the multiple and perhaps contradictory ways in which the nation of Nigeria has been conceptualized and defined. Thus, at the same time the book recovers an idealism that once characterized an era, it also highlights the ambiguities and fragmentation of Nigerian national identification. For many of the scholars studied, the contribution to nationalist history is made through the lens of their own ethnic group. Chapter 7 is dedicated to Adiele Afigbo, the “doyen of Igbo studies” who wrote extensively on the history of the Igbo from an insider’s perspective. The next three chapters deal with Yoruba scholars, all of whom made substantial contributions to the study of Yoruba history. F. Ade Ajayi researched nineteenth-century warfare and the demise of the Old Oyo Empire. J. A. Atanda, a scholar of Yoruba “to the core,” also searched for explanations for the fall of the Oyo Empire, focusing on the impact of the Fulani jihadist intervention. Bolanle Awe is noted for her contribution to the study of the military history of Ibadan and Ekiti. The only northerner in the book, Yusufu Bala Usman, also began his career focusing on his region of birth, writing extensively on Hausaland and the Sokoto Caliphate. While Bala Usman is largely credited for his activist criticism of Western capitalism and its impact on the underclass, Falola and Aderinto critique his defense of the poor as sometimes limited to northern populations.\n\nThe life histories of the scholars also resonate with the postcolonial history of intergroup conflicts. While the scholarship of Obara Ikime, the subject of chapter 11, advocated for national unity and an end to ethnic tensions, Falola and Aderinto speculate that Ikime’s own professional biography may have been influenced by ongoing divisionary tendencies in Nigerian society: “Did he write the way he did because he was a minority from the southwest?… In federal Nigeria, minority elements, including scholars among them, express their sense of being marginalized by the dominant ethnic groups” (p. 170). As in the case of Ikime, the biography of G. O. Olunsanya, reviewed in chapter 12, also reflects the impact of ethnic conflicts on an academic career. Olunsanya was forced to leave his post at Ahmadu Bello University in 1966 in the wake of violence and discrimination against southerners. The work of Tekena N. Tamuno seems to break this mold, as his approach toward political and administrative history is described by the authors as “Pan-Nigeriana.” As Falola and Aderinto note, “Unlike his colleagues who celebrate their own majority ethnicities and defend them, Tamuno opens his lens to all groups and peoples in Nigeria” (p. 199).\n\nIt would be wrong to portray all of the nationalist historians examined here as purely ethnic partisans, and each of the scholars examined in this study made important contributions to historical knowledge beyond that of their own ethnic identification. For example, Bolanle Awe is most noted for her leadership role in promoting women and gender studies in Nigeria, and Ajayi’s achievements in the field of mission history also moved beyond a purely Yoruba focus. But it is not only the research agendas and biographies of the scholars examined here that leave the reader questioning the role played by nationalist historians in nation-building in Nigeria. The work of Falola and Aderinto concludes with an acknowledgement of the inherent contradictions imbedded in nationalist historiography, as scholars sought to construct a counterdiscourse to Western knowledge “within the framework of how the Western academy defined research and university education” (p. 226). As the authors write, these historians “never fully worked out how European ideas and values could be avoided and how indigenous knowledge could be carefully integrated into the larger body of academic writing” (p. 113). The work of nationalist historians ultimately failed in their goal of inspiring the Nigerian masses, few of whom identified with “the various essays and books being offered presumably on their behalf” (p. 237). These incongruities resulted in a crisis of relevance, as Ajayi himself declared, “Of all the branches of African Studies, African history is the most useless of all its disciplines. Its failure to relate research to the practical problems of Africa is phenomenal” (p. 237).\n\nIn a concluding chapter, Falola and Aderinto suggest that historians offer Nigerians with a more usable history by focusing on topics that can shed light on pressing national priorities: science, technology, industrialization, and the environment. By casting a wider net when formulating a research agenda, it is hoped that historians can play a more decisive role in advancing development and prosperity in Nigeria. At the same time, it is possible to recuperate the work and aspirations of the nationalist historians as an expression of truly Nigerian traditions of cultural syncretism and adaptation rather than casting their strategies as irrelevant or inauthentic. The lives and work of these historians occupied the kind of cultural border zones that have deep roots in the Nigerian past and present. Indeed, the historical record shows that African societies and identities have long been characterized by hybridity, flexibility, and multiculturalism. Falola and Aderinto’s work on the lives and works of these nationalist historians constitutes another chapter in the long history of cultural innovation in Nigeria, as African intellectuals continue to seek out and exploit new opportunities for empowering and enriching their communities.\n\nNote\n\n[1]. Obafemi Awolowo, Path To Nigerian Freedom (London: Faber & Faber, 1977), 47-48.\n\nPrintable Version: http://www.h-net.org/reviews/showpdf.php?id=32734\n\nCitation: Lynn Schler. Review of Falola, Toyin; Aderinto, Saheed, Nigeria, Nationalism, and Writing History. H-Africa, H-Net Reviews. October, 2011. URL: http://www.h-net.org/reviews/showrev.php?id=32734\n\nThis work is licensed under a Creative Commons Attribution-Noncommercial-No Derivative Works 3.0 United States License"}], "Adiele Afigbo was known for his work on the history of the Igbo people of Nigeria.": [{"url": "https://www.wikiwand.com/en/Adiele_Afigbo", "page_content": "Adiele Eberechukwu Afigbo (22 November 1937 – 9 March 2009) was a Nigerian historian known for the history and historiography of Africa, more particularly Igbo history and the history of Southeastern Nigeria. Themes emphasised include pre-colonial and colonial history, inter-group relations, the Aro and the slave trade, the art and science of history in Africa, and nation-building.\n\nNigerian historian (1937-2009)\n\nQuick facts: Adiele Eberechukwu Afigbo, Born, Died, Academ... ▼\n\nAfigbo took up his career as a historian in the 1950s with the celebrated Ibadan School of History, which for about three decades was the most prominent school of history in Africa. He became a prominent member of that school, which devoted its time to demonstrating the need for African history and historiography as specific genres of the world history. In pursuing the mission of this school through teaching and scholarly work, Afigbo produced works that established reconstructionist history, of African historical methodologies, and links between history and statecraft. He gave rein to eclecticism of sources and methods, using as the occasion demands and warrants elements from myth, oral sources, from archaeology, linguistics, material artefacts and written sources. In the last analysis he defined a historian as a clinical student of human experience who seeks to tell the story as it is and to explain it.[citation needed]"}, {"url": "https://link.springer.com/chapter/10.1057/9781137311290_7", "page_content": "Adiele Afigbo, “The Warrant Chief System in Eastern Nigeria, 1900-1929” (Ph.D. thesis, University of Ibadan, Ibadan, Nigeria, 1964).\n\nThe University of Nigeria, Nsukka was closed between 1967 and January 1970 due to the war.\n\nFor the compelling case Adiele Afigbo made for the establishment of a Pan-Igbo Center for Igbo Studies, and for the propagation of Igbo studies, see A. E. Afigbo, Obi Ikenga: The Case for a Pan-Igbo Centre for Igbo Studies(Uturu, Nigeria: Abia State University, 2000).\n\nThe Ahiajoku Lecture Series, which was inaugurated on November 30, 1979, was designed to offer the Igbo a rare opportunity to annually gather and harness the intellectual richness of the people through public lectures by the most erudite of Igbo scholars. It is an annual intellectual harvest in which a distinguished Igbo scholar is selected to educate and share an important aspect of Igbo life and culture related to the lecturer’s expertise. Thus, Ahiajoku lecturers have focused on Igbo political, economic, cultural, social, technological, philosophical and historical experiences, as well as the people’s interactions and encounters with non-Igbo ethnic groups in Nigeria, and with the Europeans. It is an occasion to celebrate the collective Igbo achievements.\n\nFor more information on this Directorate, see Arthur A. Nwankwo, Nigeria: The Challenge of Biafra, 3rd edition (Enugu, Nigeria: Fourth Dimension Publishers, 1980), 26–28.\n\nOnwuka Njoku, “Exploring a Darkly Tunnel: Twenty-Six Years of Afigbo at Nsukka, 1966–1992,” in Toyin Falola and Adam Paddock, eds., Emergent Themes and Methods in African Studies: Essays in Honor of Adiele E. Afigbo(Trenton, NJ: Africa World Press, 2009), 37.\n\nPaul Obi-Ani, “Adiele Afigbo: Reminiscences on a Great Teacher,” in Falola and Paddock, eds., Emergent Themes and Methods, 96.\n\nUndoubtedly, there is merit in the criticisms against Afigbo because he should have been mindful that individuals are endowed differently with unique experiences and backgrounds. It is expected of an effective teacher or professor to strive to accommodate his or her students’ individual differences and needs. But Afigbo was not for the mediocre or even average students. You must be above average and hardworking in order to survive Afigbo’s scrutiny. The author started her doctoral thesis with Professor Afigbo, but did not complete the work with him due to no fault of theirs. Afigbo and the author worked very hard to complete the thesis, but it was not possible due to his retirement from the university in 1992.\n\nSee, for instance, E. Isichei, A History of the Igbo People(London: Macmillan, 1976), xiv. Here, she thanked Afigbo for the material he lent her and for giving her “the most unstinted and generous encouragement in a field of study which he has done so much to transform.”\n\nBooks published by Adiele Afigbo, The Abolition of the Slave Trade in Southeastern Nigeria, 1885–1950(Rochester, NY: University of Rochester Press, 2006); The Igbo and their Neighbours: Inter-Group Relations in Southeastern Nigeria to 1953(Ibadan, Nigeria: University Press Limited, 1987); with S. I. O. Okita, The Museum and Nation Building(Owerri, Nigeria: New Africa Publishing Co, 1985); Nigeria and the Open University(Owerri, Nigeria: New Africa Publishing Co, 1983); with C. S. Okeke, Weaving Tradition in Igboland: History and Mechanism of Igbo Textile Industry (Lagos, Nigeria: Nigeria Magazine, 1982); A. E. Afigbo, Ropes of Sand (Studies in Igbo History and Culture)(Ibadan, Nigeria: University Press Limited, 1981); The Warrant Chiefs: Indirect Rule in Southeastern Nigeria, 1891-1929(New York: Humanities Press and London: Longmans, 1972); Adiele Afigbo, R. J. Gavin, J. D. Omer-Cooper and R. Palmer, The Making of Modern Africa, Vol. 2: The Twentieth Century. 1971; New edition (Essex, UK: Longman, 1986); The Making of Modern Africa, Vol. 1: Nineteenth Century (Growth of African Civilization) (London: Longmans, Green and Co, 1968); and multi-edited volumes, E. J. Otagburuagu, A. E. Afigbo, and J. T. Omenma, Readings in African Studies(Enugu, Nigeria: Benak Ventures, 2010); E. J. Otagburugu and A. E. Afigbo, New Brides, More Hopes: Igbo Women in SocioEconomic Change before the Dawn of the 21stCentury(Nsukka, Nigeria: Institute of African Studies, University of Nigeria, Nsukka, 2008); A. E. Afigbo, ed., The Tears of a Nation and People: The Igbo and the Human Rights Situation in Nigeria(Okigwe, Nigeria: Whytem Publishers, 2000); F. C. Ogbalu and the Igbo Language(Onitsha, Nigeria: University Publishers, 1995); Groundwork of Igbo History(Lagos, Nigeria: Vista Books Limited, 1992); The Image of the Igbo(Lagos, Nigeria: Vista Books, 1992).\n\nFor examples of path-breaking studies primarily based on the use of oral traditions, see Jan Vansina, Paths in the Rainforests: Toward a History of Political Tradition in Equatorial Africa(Madison, WI: University of Wisconsin Press, 1990); E. J. Alagoa, A History of the Niger Delta: An Historical Interpretation of Ijo Oral Tradition(Ibadan, Nigeria: Ibadan University Press, 1972); K. O. Dike, Trade and Politics in the Niger Delta, 1830-1885: An Introduction to the Economic and Political History of Nigeria(Oxford: Oxford University Press, 1956).\n\nOnwuka Njoku, “A Synoptic Overview,” in Toyin Falola, ed., Igbo History and Society: The Essays of Adiele Afigbo(Trenton, NJ: Africa World Press, 2005), 35.\n\nCompared to such major ethno-linguistic groups as the Bini, Hausa and Yoruba, whose histories have been recorded before 1900, the only available accounts on the Igbo were those of Olaudah Equiano discussed in Chapter 1 of this volume, and Europeans. A few examples will suffice here: Arthur G. Leonard, The Lower Niger and its Tribes(London: Macmillan, 1906); George T. Basden, “Notes on the Ibo Country and the Ibo People, Southern Nigeria,” The Geographical Journal39, no. 3 (1912): 241–247; Among the Ibos of Nigeria. 1921; reprint (London: Frank Cass, 1966); P. A. Talbot, The Peoples of Southern Nigeria. Vol. IV (London: Oxford University Press and Humphrey Milford, 1926); C. K. Meek, Law and Authority in a Nigerian Tribe: A Study of Indirect Rule(London: Oxford University Press, 1937); S. Leith-Ross, African Women: A Study of the Ibo of Nigeria(London: Faber and Faber, 1939).\n\nToyin Falola and Matthew Heaton, “Introduction: Afigbo on the Igbo,” in Falola, ed., Igbo History and Society, 13.\n\nSee, for instance, Adiele Afigbo, An Outline of Igbo History(Owerri, Nigeria: RADA Publishing Co., 1986); “Traditions of Igbo Origins: A Comment,” Nigeria Magazine144 (1983): 3–12; Ropes of Sand, chapters 1–3 and 6; “On the Threshold of Igbo History: Review of Thurstan Shaw’s Igbo-Ukwu,” The Conch3, no. 2 (1971): 205–218. Still on Igbo origins also see J. N. Oriji, Traditions of Igbo Origin: A Study of Pre-Colonial Population Movements in Africa(New York: Peter Lang, 1990).\n\nA. E. Afigbo, The Age of Innocence: The Igbo and their Neighbours in Pre-colonial Times. Ahiajoku Lecture Series (Owerri, Nigeria: Ministry of Information, Culture, Youth and Sports, 1981), 9.\n\nG. T. Basden, Niger Ibos: A Description of the Primitive Life, Customs, and Animistic Beliefs and Customs of the Igbo People of Nigeria. 1938; reprint (London: Frank Cass, 1966).\n\nPhilip A. Oguagha and Alex I. Okpoko, Historyand Ethnoarchaeology in Eastern Nigeria: A Study of Igbo-Igala Relations with Special Reference to the Anambra Valley. Cambridge Monographs in African Archaeology 7 BAR International Series 195 (Oxford: BAR, 1984); Vincent E. Chikwendu, “Afikpo Excavations, May-June 1975: The Ugwuagu Rock Shelter (Site One) and The Abandoned Habitation Site (Site Two)” (Ph.D. dissertation, University of Birmingham, England, December 1976). See also Thurstan Shaw, Igbo-Ukwu: An Account of Archaeological Discoveries in Eastern Nigeria2 vols. (Evanston, IL: Northwestern University Press, 1970).\n\nAdiele Afigbo, “General Introduction,” in Afigbo, ed., Groundwork of Igbo History, 1; “Igbo Origins and Migrations,” in Ibid., 45–46.\n\nAfigbo, “Igbo Origins and Migrations,” 48–55.\n\nAdiele Afigbo, “Igbo Cultural Sub-Areas: Their Rise and Development,” in Afigbo, ed., Groundwork of Igbo History, 145.\n\nM. A. Onwuejeogwu, An Igbo Civilization: Nri Kingdom and Hegemony(London: Ethnographica, 1981); Shaw, Igbo-Ukwu.\n\nFalola and Heaton, “Introduction: Afigbo on the Igbo,” 4. See Onwuejeogwu, An Igbo Civilization; Chieka Ifemesia, Traditional Humane Living among the Igbo: An Historical Perspective(Enugu, Nigeria: Fourth Dimension Publishers, 1979); Elechukwu N. Njaka, Igbo Political Culture (Evanston, IL: Northwestern University Press, 1974); A. E. Afigbo, “The Indigenous Political Systems of the Igbo,” Tarikh4, no. 2 (1973): 13–23; Nzimiro, Studies in Ibo Political Systems.\n\nAfigbo, “The Indigenous Political Systems,” 15.\n\nSee Christopher I. Ejizu, “Ritual Enactment of Achievement: Ikenga Symbol in Igboland,” Paideuma 37 (1991): 233–251; Ofo: Igbo Ritual Symbol(Enugu, Nigeria: Fourth Dimension Publishers, 1986); John S. Boston, Ikenga Figures among the North-West Igbo and Igala(London: Ethnographica, 1977).\n\nAfigbo, Ropes of Sand, Chapter 4.\n\nAfigbo, Ropes of Sand, 125.\n\nSee generally G. Chuku, Igbo Women and Economic Transformation in Southeastern Nigeria, 1900-1960(New York: Routledge, 2005).\n\nIbid.; Afigbo and Okeke, Weaving Tradition\n\nD. Chambers, Murder at Montpelier: Igbo Africans in Virginia(Jackson, MS: University Press of Mississippi, 2005), Chapter 2; “Tracing Igbo into the African Diaspora,” in Paul Lovejoy, ed., Identity in the Shadow of Slavery(London: Continuum, 2000), 57; “The Significance of Igbo in the Bight of Biafra Slave Trade: A Rejoinder to Northrup’s ‘Myth Igbo,’ ” Slavery and Abolition23, 1 (2002): 101–120; Paul Lovejoy, “The Impact of the Atlantic Slave Trade on Africa: A Review of the Literature,” Journal of African History30, no. 3 (1989): 375; Transformations in Slavery: A History of Slavery in Africa(Cambridge: Cambridge University Press, 1983), 148; D. Northrup, “The Growth of Trade among the Igbo before 1800,” Journal of African History13, no. 2 (1972): 232.\n\nAfigbo, Ropes of Sand, 17.\n\nAfigbo, The Warrant Chiefs, 12.\n\nAfigbo, The Abolition of the Slave Trade, xiii.\n\nSee A. E. Afigbo, “The Nineteenth Century Crisis of the Aro Slaving Oligarchy of South-Eastern Nigeria,” Nigeria Magazine 110–112 (1974): 66–73; “The Eclipse of the Aro Slaving Oligarchy of South-Eastern Nigeria, 1901–1927,” Journal of the Historical Society of Nigeria6, no. 1 (1971): 3–24.\n\nAfigbo, The Abolition of the Slave Trade, 7–13.\n\nAdiele E. Afigbo, “Africa and the Abolition of the Slave Trade,” William and Mary Quarterly66, no. 4 (2009): 706–707.\n\nSee A. E. Afigbo, “Colonial Conquest and Rule, 1900-1950: Igboland to the East of the Niger,” in Afigbo, ed., Groundwork of Igbo History, 410–436; “The Eastern Provinces under Colonial Rule,” in Obaro Ikime, ed., Groundwork of Nigerian History(Ibadan, Nigeria: Heinemann Educational Books, 1980), 410–428; “Patterns of Igbo Resistance to British Conquest,” Tarikh4, no. 3 (1973): 14–23; “The Aro Expedition of 1901–1902 (An Episode in the British Occupation of Iboland),” Odu 7 (1972): 3–27. For more information on some of the military campaigns see D. C. Ohadike, The Ekumeku Movement: Western Igbo Resistance to the British Conquest of Nigeria, 1883-1914(Athens, OH: Ohio University Press, 1991); E. Isichei, The Ibo People and the Europeans: The Genesis of a Relationship – To 1906(New York: St. Martin’s Press, 1973), Chapter 10; Felix Ekechi, “Merchants, Missionaries and the Bombardment of Onitsha, 1879-89: Aspects of Anglo-Igbo Encounter,” The Conch5, nos. 1 and 2 (1973): 61–81; Philip Igbafe, “Western Igbo Society and Its Resistance to British Rule: The Ekumeku Movement, 1898–1911,” Journal of African History12, no. 3 (1971): 441–459.\n\nFor a detailed study of the chaos and failure of “indirect rule” in Eastern Nigeria, see Afigbo, The Warrant Chiefs.\n\nAfigbo, “The Eastern Provinces under Colonial Rule,” 427–428.\n\nAfigbo, The Age of Innocence, 14.\n\nA. E. Afigbo, “Trade and Trade Routes in Nineteenth-Century Nsukka,” Journal of the Historical Society of Nigeria7, no. 1 (1973): 77–90; The Igbo and their Neighbours, 41–42, Chapter 4; The Age of Innocence, 17–18; “Precolonial Trade Links between Southeastern Nigeria and the Benue Valley,” Journal of African Studies4, no. 2 (1977): 119–139. See also Northrup, “The Growth of Trade among the Igbo” E. J. Alagoa, “Long-Distance Trade and States in the Niger Delta,” Journal of African History2, no. 3 (1970): 319–329.\n\nAfigbo, The Igbo and Their Neighbours, 42–43.\n\nAfigbo, The Age of Innocence, 16.\n\nAfigbo criticized many European and foreign observers and writers, especially David Northrup for his book titled Trade Without Rulers: Pre-Colonial Economic Development in South-Eastern Nigeria(Oxford: Clarendon Press, 1978), for assuming that the region of southeastern Nigeria prior to European colonial domination lacked rulers and therefore authority figures that were capable of enforcing laws that would guarantee the protection and safety of traders. This prejudicial characterization of the region and the period suggests a lawless and unstable atmosphere incapable of fostering any meaningful commercial and intergroup exchanges. Yet, historical accounts have shown that the Aro, Awka, Abiriba, Nkwerre, Aboh, Nike, Nri, Igala, Ijo, Bonny, Nembe, Brass and the Efik triumphed in their business careers before the 1900.\n\nFor the practice of Igbandu, see Felicia Ekejiuba, “Igba Ndu: An Igbo Mechanism of Social Control and Adjustment,” African Notes8, no. 1 (1972): 9–24.\n\nSee Richard Henderson, The King in Every Man: Evolutionary Trends in Onitsha Ibo Society and Culture(New Haven, CT: Yale University Press, 1972); Austin Shelton, The Igbo-Igala Borderland: Religion and Social Control in Indigenous African Colonialism(Albany, NY: State University of New York Press, 1971); and John Boston, “Notes on Contact between the Igala and the Ibo,” Journal of the Historical Society of Nigeria2, no. 1 (1960): 52–58 on the impact of Igala culture on Nsukka Igbo; Basden, Niger Ibos on the Ijo and the conquest of southern Igbo; Mervin D. W. Jeffreys, “The Umundri Tradition of Origin,” African Studies15, no. 3 (1956): 119–131 on Igala impact on the rise of the Nri; Charles K. Meek, Ethnographical Report on the Peoples of Nsukka Division of Onitsha Province(Lagos, Nigeria: Government Printer, 1930) on Igala conquests and the evolution of Nsukka society; Talbot, The Peoples of Southern Nigeriaon the Edo and the evolution of West Niger Igbo.\n\nA. E. Afigbo, “The Beni ‘Mirage’ and the History of South Central Nigeria,” Nigeria Magazine 137 (1981): 17–24.\n\nAfigbo, The Igbo and their Neighbours, ix.\n\nFor Ibadan School of History, see A. O. Adeoye, “Understanding the Crisis in Modern Nigerian Historiography,” History in Africa 19 (1992): 1–11; P. Lovejoy, “Nigeria: The Ibadan School and Its Critics,” in B. Jewsiewicki and D. Newbury, eds., African Historiographies: What History for Which Africa?(Beverly Hills, CA: Sage Publications, 1986), 197–205.\n\nA. E. Afigbo, “The Anthropology and Historiography of Central-South Nigeria before and since Igbo-Ukwu,” History in Africa 23 (1996): 9. On the issue of Nigerian historiography, see also A. E. Afigbo, “Southeastern Nigeria, the Niger-Benue Confluence, and the Benue in the Precolonial Period: Some Issues of Historiography,” History in Africa 24 (1997): 1–8.\n\nA. E. Afigbo, “Fact and Myth in Nigerian Historiography,” Nigeria Magazine 122–123 (1977): 82.\n\nFor discussion of the criticisms of African nationalist historiography, see Adeoye, “Understanding the Crisis in Modern Nigerian Historiography”; Hannington Ochwada, “Historians, Nationalism and Pan-Africanism: Myths and Realities,” in Thandika Mkandawire, ed., African Intellectuals(Dakar, Senegal: CODESRIA Books, 2005), 193–208.\n\nA. E. Afigbo, “The Amalgamation: Myths, Howlers and Heresies,” in T. Falola, ed., Nigerian History, Politics and Affairs: The Collected Essays of Adiele Afigbo(Trenton, NJ: Africa World Press, 2005), 244.\n\nA. E. Afigbo, “History, Archaeology and Schools in Nigeria,” West African Journal of Education20, no. 3 (1976): 407–415; “Reflections on the History Syllabus in Nigerian Universities,” Journal of the Historical Society of Nigeria8, no. 1 (1975): 9–17; “Some Thoughts on the Teaching of History in Nigeria,” Ikenga 2, no. 2 (1973): 1–13.\n\nIt is difficult to authenticate Afigbo’s claim since this paper was not published until 1992, and especially, since there are historical works on Nigerian women published in the 1970s and 1980s. See, for instance, Bolanle Awe, “The Iyalode in the Traditional Yoruba Political System,” in Alice Schlegel, ed., Sexual Stratification: A Cross-Cultural View(New York: Columbia University Press, 1977), 144–160; Nina Mba, Nigerian Women Mobilized: Women’s Political Activity in Southern Nigeria, 1900–1965(Berkeley, CA: University of California Press, 1982).\n\nAuthor’s telephone interviews with Professor Afigbo, June 7, 2006. See for instance, Adiele Afigbo, “Women in Nigerian History,” The Proceedings of the Awareness Forum Seminar, Occasional Publication of the Division of Extra-mural Studies, University of Nigeria, Nsukka, 1974, 62–79; “Women in Nigerian History,” in Martin O. Ijere, ed., Women in Nigerian Economy (Enugu, Nigeria: ACENA Publishers, 1991), 22–39; “Women as a Factor in Development,” in Ijere, ed., Women in Nigerian Economy, 41–53; “Igbo Women, Colonialism and Socio-Economic Change,” in Otagburuagu and Afigbo, eds., New Brides, More Hopes, 1–14.\n\nAfigbo, “Women in Nigerian History,” 23.\n\nIsabel Kamene Okonjo, “The Role of Women in Social Change among the Igbo of Southeastern Nigeria Living West of the River Niger” (Ph.D. dissertation in Sociology, Individual and Family Studies, Boston University, 1976); “The Dual-Sex Political System in Operation: Igbo Women and Community Politics in Midwestern Nigeria,” in Nancy Hafkin and Ednah G. Bay, eds., Women in Africa: Studies in Social and Economic Change(Stanford, CA: Stanford University Press, 1976), 47–51.\n\nA. E. Afigbo, The Poverty of African Historiography(Lagos, Nigeria: Afrografika Publishers, 1977), 3 and 11.\n\nFalola and Paddock, eds., Emergent Themes and Methods."}, {"url": "https://wiki2.org/en/Adiele_Afigbo", "page_content": "Nigerian historian (1937-2009)\n\nAdiele Eberechukwu Afigbo (22 November 1937 – 9 March 2009) was a Nigerian historian known for the history and historiography of Africa, more particularly Igbo history and the history of Southeastern Nigeria. Themes emphasised include pre-colonial and colonial history, inter-group relations, the Aro and the slave trade, the art and science of history in Africa, and nation-building.\n\nAfigbo took up his career as a historian in the 1950s with the celebrated Ibadan School of History, which for about three decades was the most prominent school of history in Africa. He became a prominent member of that school, which devoted its time to demonstrating the need for African history and historiography as specific genres of the world history. In pursuing the mission of this school through teaching and scholarly work, Afigbo produced works that established reconstructionist history, of African historical methodologies, and links between history and statecraft. He gave rein to eclecticism of sources and methods, using as the occasion demands and warrants elements from myth, oral sources, from archaeology, linguistics, material artefacts and written sources. In the last analysis he defined a historian as a clinical student of human experience who seeks to tell the story as it is and to explain it.[citation needed]\n\nYouTube Encyclopedic\n\n1 / 3 Views: 454 2 357 1 336\n\nIbo Gender Roles: School Project\n\nOne Tribe, One Style: A Text With an Agenda\n\nUniversity of Ibadan Transcription\n\nEarly life and education\n\nAfigbo was born at Ihube, Okigwe, in present-day Imo State. His formal education began in 1944 at Methodist Central School, Ihube where he came under the influence of remarkably dedicated teachers, the most outstanding of whom was Mr. Oji Iheukumere, the head teacher, a native of Uzuakoli, in today's Abia State who was a noted church musician and disciplinarian. At Ihube Central School Afigbo's brilliance manifested early which made his teachers encourage him to go to secondary school in spite of the opposition of his parents who were intimidated by the cost of post-primary education. He succeeded in his bid and went to St. Augustine's (CMS) Grammar School, Nkwerre Orlu in Imo State.[citation needed] with an Okigwe Native Administration scholarship won in a competitive examination. There again he came across a crop of teachers who left a definite imprint on him. Foremost among those were Mazi F. C. Ogbalu, a teacher of Igbo language and culture and the founder of the Society for Promoting Igbo Language and Culture, C.G.I. Eneli a history graduate of the University College, Ibadan and E. C. Ezekwesili, the principal of the college and a history graduate of the University of Southampton, UK. These three helped to determine his future academic career. From St. Augustine's Grammar School Afigbo gained admission to study history at University College, Ibadan (then affiliated with University of London), with a scholarship from the government of Eastern Nigeria. There again, he met scholars noted for their brilliance and beneficent influence – J.D. Omer-Cooper, J.C. Anene, J.F. Ade Ajayi and Kenneth Onwuka Dike. There were also his colleagues – Obaro Ikime and Philip Igbafe who not only read history with him, but with him went on to pioneer the \"made in Nigeria PhD\" at the infant University of Ibadan with the help of post-graduate scholarships awarded by the university to the best graduating students.[citation needed] Adiele Afigbo had not only graduated top of his class, but also was the first among his colleagues to complete his PhD With this, he became the first person ever to receive a doctoral degree from a Nigerian university.[1]\n\nEarly career\n\nOn obtaining the PhD, Afigbo was appointed a lecturer in history, a position he held for two years before fleeing to the University of Nigeria, Nsukka in the wake of the Nigerian civil war. During the duration of hostilities, he served in the Directorate for Propaganda of the Ministry of Information, Republic of Biafra. He resumed his interrupted academic duties after the war, and rose on the academic ladder – from Lecturer to Professor in 1972, thus reaching the top of his profession after only five years. A year after attaining to professorship, he was appointed the Head of the Department of History and Archaeology. The year after, he became also the Dean of the Faculty of Arts. On more than one occasion he held the Directorship of the Leo Hansbury Institute of African Studies. He held the following public appointments among others – pioneer Director of Research at the National Institute for policy and Strategic Studies, Kuru, Jos; Commissioner first for Education and then for Local Government in the Government of Imo State; Chairman of the Michael Okpara College of Agriculture, Umuagwo in Imo State and Sole Administrator of the Alvan Ikoku College of Education, Owerri.[citation needed] He has also was awarded an Honorary Member of the Historical Association of Great Britain, Fellow of the Historical Society of Nigeria, the Nigerian National Order of Merit, the Fellowship of the Nigerian Academy of Letters. His traditional chieftaincy titles include Ogbute-Okewe-Ibe, Ogbuzuo, and Olaudah.\n\nWork as historian\n\nAfigbo was a historian of Africa, of Nigeria, of Southeastern Nigeria, and finally a historian of the Igbo. He was a political historian, an economic and social historian, and of historiography. Myth, History and Society, one of the three volumes of his essays edited by Toyin Falola is devoted to theorising on the methods of doing history in Africa, on the sources of history in Africa, on the place and purpose of history in Africa and other related issues. In many publications he sought to use the particular to illuminate the universal, and the universal to illuminate the particular. Thus, for instance, he used a detailed study of the textile process in Southern Nigeria to throw much helpful light on the socio-cultural dynamics of the societies of the region. In a similar manner he used the rise and expansion of the pre-colonial great states such as Benin to show that the so-called segmentary societies as well as the so-called mini-states of pre-colonial Africa are, among other things, fossilised reminders of the conditions from which the great states arose.[citation needed]\n\nAfigbo broke away from the action-reaction thesis that ruled the new African historiography when he joined the history profession. He did so by emphasising in his works basic reconstructionist history, the study of peoples and cultures in their own right.\n\nDeath\n\nAdiele Eberechukwu Afigbo died in Enugu, Nigeria in the early hours of Monday, 9 March 2009 after a brief illness.[2]\n\nWorks\n\nThe Warrant Chiefs: Indirect Rule in Southeastern Nigeria 1891–1929 (Longman, London, 1972)\n\n1891–1929 (Longman, London, 1972) Ropes of Sand: Studies in Igbo History and Culture (University Press Limited, Ibadan 1981)\n\n(University Press Limited, Ibadan 1981) The Igbo and Their Neighbours: Inter-group Relations In Southeastern Nigeria to 1953 (University Press Limited, Ibadan, 1987)\n\n(University Press Limited, Ibadan, 1987) Groundwork of Igbo History (Vista Books Limited, Lagos, 1992)\n\n(Vista Books Limited, Lagos, 1992) Image of the Igbo (Vista Books Limited, Lagos, 1992)\n\n(Vista Books Limited, Lagos, 1992) The Abolition of the Slave Trade in Southeastern Nigeria 1885–1950 (University of Rochester Press, 2006)\n\nCollected Works Edited by Toyin Falola\n\nNigerian History Politics and Affairs (Africa World Press, Trenton New Jersey, 2005)\n\n(Africa World Press, Trenton New Jersey, 2005) Igbo History and Society (Africa World Press, Trenton New Jersey, 2005)\n\n(Africa World Press, Trenton New Jersey, 2005) Myth, History and Society (Africa World Press, Trenton New Jersey, 2006)\n\nReferences\n\nBibliography\n\nOttenberg, S., Farmers and Townspeople in A Changing Nigeria (Spectrum Books Ltd, Ibadan, 2005) pp. 32–33, 50, 54, 84,101\n\nNorthrup, D. Trade Without Rulers (Clarendon Press, Oxford, 1978) pp. 34–37\n\nIsichei, E. A History of the Igbo People (Macmillan Press, London 1976), pp 30, 66, 67, 123, 145, 153, 254.\n\nManfredi, V., \"Philological Perspectives on the Southeastern Nigeria Diaspora\" in Contours: A Journal of the African Diaspora, Fall 2004 vol. 2 no. 2\n\nNorthrup, D. Trade Without Rulers (Clarendon Press, Oxford, 1978) pp. 34–37 Isichei, E. A History of the Igbo People (Macmillan Press, London 1976), pp 30, 66, 67, 123, 145, 153, 254. Manfredi, V., \"Philological Perspectives on the Southeastern Nigeria Diaspora\" in Contours: A Journal of the African Diaspora, Fall 2004 vol. 2 no. 2 Falola, T. and Heaton, M. “Afigbo’s Scholarship: An Introduction” in Myth, History and Society: The Collected Works of Adiele Afigbo edited by Toyin Falola (Africa World Press, Trenton, NJ, 2006) pp. 3–19.\n\nKorieh, C.J.,”Historians, Historiography and Historical Interpretations” in Falola T, (ed.) Myth, History and Society: The Collected Works of Adiele Afigbo, pp. 21–28\n\nOyebade, A. “Africanizing Knowledge: The Burden of Academic Historiography” in Falola, T., Myth, History and Society: The Collected Works of Adiele Afigbo, pp. 29–34\n\nKorieh, C.J.,”Historians, Historiography and Historical Interpretations” in Falola T, (ed.) Myth, History and Society: The Collected Works of Adiele Afigbo, pp. 21–28 Oyebade, A. “Africanizing Knowledge: The Burden of Academic Historiography” in Falola, T., Myth, History and Society: The Collected Works of Adiele Afigbo, pp. 29–34 Olukoju, A. “(Re)Reading Afigbo’s Work On Nigeria” in Nigerian History, Politics and Affairs The Collected Essays of Adiele Afigbo edited by Toyin Falola (Africa World Press, Trenton, NJ, 2005) pp. 15–30\n\nAgbali, A.A., “A Reflection on Afigbo,s Writings on Nigeria” in Falola, T. (ed.) Nigerian History, Politics and Affairs pp. 31–50\n\nNwaubani, E., “Afigbo’s Views on Nigeria” in Falola, T. (ed) Nigerian History Politics and Affairs pp. 51–62\n\nAgbali, A.A., “A Reflection on Afigbo,s Writings on Nigeria” in Falola, T. (ed.) Nigerian History, Politics and Affairs pp. 31–50 Nwaubani, E., “Afigbo’s Views on Nigeria” in Falola, T. (ed) Nigerian History Politics and Affairs pp. 51–62 Kalu, O. “Cameos Of The Igbo Past” in Igbo History and Society: The Essays of Adiele Afigbo edited by Falola, T., (Africa World Press, Trenton, New Jersey, 2005) pp. 17–30.\n\nNjoku, O., “A Synoptic Overview”: in Falola, T. (ed.) Igbo History and Society pp. 31–42\n\nNjoku, R.C. “Adiele Afigbo:Imperial History and the Challenges of Igbo Historical Studies” in Falola, T., (ed.) Igbo History and Society pp43–57\n\nNjoku, O., “A Synoptic Overview”: in Falola, T. (ed.) Igbo History and Society pp. 31–42 Njoku, R.C. “Adiele Afigbo:Imperial History and the Challenges of Igbo Historical Studies” in Falola, T., (ed.) Igbo History and Society pp43–57 Falola, T., and Heatom, M.,”The Works of A.E. Afigbo on Nigeria: An Historiographical Essay” in History in Africa 33 (2006) pp155–178\n\nAlagoa, E.J, The Uses of Hindsight as Foresight: Reflections on Niger Delta and Nigerian History (Onyoma ResearchPublications, Port Harcourt 2004) p. 138 ff.\n\nAlagoa, E.J, The Uses of Hindsight as Foresight: Reflections on Niger Delta and Nigerian History (Onyoma ResearchPublications, Port Harcourt 2004) p. 138 ff. Falola, T."}, {"url": "https://scholarworks.umb.edu/africana_faculty_pubs/24/", "page_content": "To view the content in your browser, please download Adobe Reader or, alternately,\n\nyou may Download the file to your hard drive.\n\nNOTE: The latest versions of Adobe Reader do not support viewing PDF files within Firefox on Mac OS and if you are using a modern (Intel) Mac, there is no official plugin for viewing PDF files within the browser window."}, {"url": "https://www.semanticscholar.org/paper/Myth%2C-History-and-Society%3A-The-Collected-Works-of-Afigbo-F%C3%A1lol%C3%A1/83a70cbc91d3c66df5bb5697fac78dbecccbdf24", "page_content": "Contemporary African Relevance of the Genesis Creation Myth A. Ijah Medicine The book of Genesis contains two creation myths which have corollaries in the Igbo creation myth, as in other ethnic groups in Africa. This is particularly in the area of sanctity of life. The first … Expand Save Alert\n\nHistorical Dictionary of Nigeria T. Fálolá , A. Genova Economics Since independence in 1960, Nigeria has undergone tremendous change shaped by political instability, rapid population growth, and economic turbulence. The Historical Dictionary of Nigeria introduces … Expand 20\n\nPDF Save Alert"}, {"url": "https://www.deepdyve.com/lp/oxford-university-press/igbo-history-and-society-the-essays-of-adiele-afigbo-edited-by-toyin-Sw1hanDOYF", "page_content": "System error. Please try again!\n\nThanks for helping us catch any problems with articles on DeepDyve. We'll do our best to fix them.\n\nHow was the reading experience on this article? Check all that apply - Please note that only the first page is available if you have not selected a reading option after clicking \"Read Article\".\n\nThe text was blurry Page doesn't load Other:"}, {"url": "https://link.springer.com/chapter/10.1057/9780230116689_5", "page_content": "For the genesis of the Aro and their trade network during the second half of the seventeenth century, see Felicia Ekejiuba, “The Aro Trade System in the 19th Century,” Ikenga: International Journal of African Studies, 1.1 (1972), 11–26, and Ukwu (1967), 651.\n\nSee also Kenneth Dike and Felicia Ekejiuba, The Aros of South-eastern Nigeria, 1650–1980: A Study of Socio-economic Formation and Transformation in Nigeria (Ibadan: Ibadan University Press Ltd., 1990).\n\nFor example, Adiele Afigbo, “Trade and Trade Routes in Nineteenth Century Nsukka,” in Toyin Falola (ed.), Igbo History and Culture: The Essays of Adiele Afigbo (Trenton: African World Press Inc. 2005), 533–67. Afigbo noted that Nuskka people and their Northern Igala and Idoma neighbors had traded with each other for many centuries before the genesis of the Aro trade network. For the pre-Aro trade in Ngwa area see Oriji (1982), 523–48, and (1983), 311–28, and for Igboland, see Ukwu (1967), 647–62. It is noteworthy that during the Aro trade network, many Igbo people versed in long-distance trade sold their slaves directly to the riverain traders on the Lower Imo and Niger Rivers. For example, Jaja of Opobo was sold to an Akwete trader by an Amaigbo man who had kidnapped him, before the former resold him to a Bonny middleman. Many Ngwa, Asa, Ndoki, Owerri, and other communities located near the riverain towns also traded directly with coastal middlemen.\n\nSimon Ottenberg, Farmers and Townspeople in a Changing Nigeria: Abakaliki during Colonial Times (1905–1960) (Ibadan: Spectrum Books, 2005), 27.\n\nJames Roark, Michael Johnson et al., The American Promise: A History of the United States Vol.1: to1877 (Boston: Bedford Books, 1998), 102–108.\n\nPhilip Curtin, The Tropical Atlantic in the Age of the Slave Trade (Washington D.C.: American Historical Association, 1991), 30.\n\nDavid Eltis and David Richardson, “West Africa and the Transatlantic Slave Trade: New Evidence of Long-Run Trends” in David Eltis and David Richardson (eds.), Routes to Slavery: Direction, Ethnicity and Mortality (London: Frank Cass, 1997), 21.\n\nDouglas Chambers, “My Own Nation: Igbo Exiles in Diaspora,” in Eltis and Richardson, op. cit., 75. For a statistical study of the Virginian slave exports from Africa see Walter Michinton, Celia King and Peter Waite, Virginia Slave-Trade Statistics 1698–1775 (Richmond: Virginia State Library, 1984). The problem of determining slaves of Igbo origin is difficult to resolve since European slave traders generically applied the concept “Igbo” to slaves they exported from the Bight of Biafra, even though the slaves might belong to the Ijo, Ibibio, Igala, and other ethnic nationalities. As an illustration, during the nineteenth century, those who were labeled Igbo slaves, constituting about 5 percent–25 percent of the total slave exports, were Nupe, Kankanda, and Hausa peoples. David Eltis and David Richardson, “The Numbers Game and Routes to Slavery,” in Eltis and Richardson op. cit., 11, have rightly noted that the “concept of ethnicity [during the slave trade], was more pliable than has sometimes been assumed.” Scholars therefore disagree on their estimates of Igbo slave exports. For example, Inikori, Lovejoy, and Chambers have given different estimates of the total number of Igbo slaves exported during the Trans-Atlantic slave trade—33.30 percent, 60 percent, and 80 percent respectively.\n\nSee Joseph Inikori, “The Sources of Supply for the Atlantic Slave Exports from the Bight of Benin and the Bight of Bonny (Biafra),” Sierge Daget (ed.), De la Traite a l’Esclavage: Acts du Colloque International sur la Traite des Noirs, 3 vols. (Nantes, 1988), II, 355. Northrup (1978), 60–62 and Chambers (1997), 75. Earlier estimates by Philip Curtin, who introduced in 1969 the quantitative method in studying the slave trade, have been revised by many scholars.\n\nFor Curtin’s work see Philip Curtin, The Atlantic Slave Trade: A Census (Madison: University of Wisconsin Press, 1969).\n\nFor some of the revisions of his estimates see David Eltis and David Richardson, “The Numbers Game and Slavery” in Eltis and Richardson (1997), 1–15,\n\nPaul Lovejoy, “The Volume of the Atlantic Slave Trade: A Synthesis,” Journal of African History, 23 (1982), 478–81\n\nand Joseph Inikori, “Measuring the Atlantic Slave Trade: A Rejoinder,” Journal of African History, XVII.4 (1976), 607–27.\n\nSome historians, like M.A. Gomez, Exchanging our Country Marks: The Transformation of African Identities in the Colonial and Antebellum South (Chapel Hill: University of North Carolina Press, 1998), 100–08, are critical of the quantitative method, arguing that it desensitizes the monumental moral and psychological issues raised by the slave trade. They have called for a return to the biographical studies of slaves that portray their historical experiences, such as those of O. Equiano, Fredrick Douglass and others.\n\nSee Chapter 4, and Victor Uchendu, “Slaves and Slavery in Igboland,” in S. Miers and I. Kopytoff (eds.), Slavery in Africa: Historical and Anthropological Perspectives (Madison: Wisconsin University Press, 1977), 121–32. Uchendu also noted that domestic slaves existed in Igboland during the nineteenth century.\n\nRhea Mandulo, “Georgia on my Mind,” Essence, March 1993, 144 and147, and L.B. Goodheart, R.D. Brown et al. Slavery in American Society (Lexington: D. C. Heath, 1993), 50.\n\nJoseph Inikori, “The Import of Firearms to West Africa, 1750–1807: A Quantitative Analysis,” Journal of African History, xviii.3 (1977), 344–48.\n\nGwilym Jones, “Olaudah Equiano of the Niger Ibo,” in Philip Curtin (ed.), Africa Remembered (Madison: University of Wisconsin Press, 1967), 65–66.\n\nKingsley Ozurumba Mbadiwe, British and Axis in Africa (New York: Wendel Malliet and Company, 1942), 40.\n\nSimon Ottenberg, “Ibo Oracles and Intergroup Relations” Southwestern Journal of Anthropology, XIX.3 (1958), 304.\n\nMajor A.G. Leonard, “Notes of a Journey to Bende,” Journal of the Manchester Geographical Society, 14 (1898), 197.\n\nJones (1963), 96, Stevenson (1968), 199 and Thomas Hutchinson, Ten Years Wanderings among the Ethiopians (London: Hurst and Blackett, 1861), 172.\n\nAbner Cohen, “Cultural Strategies in the Organization of Trading Diasporas,” C. Meillasoux (ed.), The Development of Indigenous Trade and Markets in West Africa, (London: Oxford University Press, 1971), 267.\n\nN. Uka, “A Note on the Abam Wariors of Igboland,” Ikenga: International Journal of African Studies, 1.2 (1972), 78.\n\nFor the Abam invasions of Igbere see E. Ukaegbu, History of Igbere (Aba: Span Publshing Company, 1972), 13 and Oriji (2003), 126.\n\nW. Horton, “The Ohu System of Slavery in a Northern Igbo Village-Group,” Africa, 24 (1954), 311–18.\n\nJohn Alutu, Nnewi History (Enugu: Fourth Dimension Publishers, 1985), 5.\n\nJohn Oriji, “Ethical Ideals of Peace and the Concept of War in Igbo Society” in Toyin Falola and R. Law (eds.), Warfare and Diplomacy in Pre-Colonial Nigeria (Madison: African Studies Program, University of Wisconsin, 1992), 176–84, and (2003), 125.\n\nMbadiwe (1942), 37–38. J. Akuma-Kalu Njoku, “Igbo Slaves and the Transformation of the Niger Delta” in Korieh and Kolapo (2007), 146, shared a similar view although he was primarily concerned with the roles of the Aro oracle and Abam warriors.\n\nMartin Klein, “The Slave Trade and Decentralized Societies,” Journal of African History, 42 (2001), 63.\n\nPaul Lovejoy and David Richardson, “The Business of Slaving: Pawnship in Western Africa, c. 1600–1800,” Journal of African History, 42 (2001), 67–89. Their work deals largely with some of the coastal mega states of West Africa, although it is helpful in making some inferences about pawnship in the hinterland region.\n\nKoelle’s estimates were derived from Northrup (1978), 80. For Koelle’s work, see S.W. Koelle, Polyglotta Africa (London: Church Mission, 1854). The northern zone of the Biafran hinterland stretches from the Benue valley to the Cameroon grassland, while the southern zone encompasses Igboland, the Ibibio and Cross River areas, and coastal Cameroons.\n\nClaude Meillassoux (ed.), The Development of Indigenous Trade and Markets in West Africa, (London: Oxford University Press, 1971), 54–55."}, {"url": "https://searchworks.stanford.edu/catalog?q=%22Afigbo%2C+A.+E.+%28Adiele+Eberechukwu%29+%22&search_field=search_author", "page_content": "Philanthropy and humanitarianism left out in the cold, 1830-84/85\n\nThe coastal phase, ca. 1885-1900\n\nThe hinterland phase I : blood and iron, 1900-1914\n\nThe hinterland phase II : courts and constables, 1900-1932\n\nThe hinterland phase III : courts and constables, 1933-50\n\nConclusion.\n\n(source: Nielsen Book Data)\n\n\"The Abolition of the Slave Trade in Southeastern Nigeria, 1885 - 1950\", is a history of the campaign waged by Great Britain in colonial Nigeria from approximately 1885 on, to abolish the internal slave trade in the Bight of Biafra and its hinterland, a region also known as Eastern Nigeria, Southeastern Nigeria, the Eastern Provinces, or the trans-Niger Provinces. It treats the internal slave trade and the war against it in this region and period as themes separate from the institution of slavery in the same area and the campaign to root it out generally known as emancipation.For this reason, and because slavery and the effort at emancipation have received more attention from scholars, this work concentrates entirely on that aspect of the slave trade and its fortunes under British colonial rule commonly known as abolition. In reconstructing the story of this important and protracted campaign, Adiele Afigbo sheds light on a dark corner of social history that has largely been neglected by historians. Adiele Afigbo is professor in the Department of History and International Relations at Ebonyi State University, Nigeria."}, {"url": "https://en-academic.com/dic.nsf/enwiki/10773827", "page_content": "Infobox Academic\n\nbox_width =\n\nname = Adiele Eberechukwu Afigbo\n\n\n\n\n\nimage_size =\n\ncaption =\n\nbirth_date = Birth date and age|1937|11|22\n\nbirth_place = Ihube, Okigwe , Nigeria\n\ndeath_date =\n\ndeath_place =\n\nresidence =\n\ncitizenship =\n\nnationality = Nigeria n\n\nethnicity = Igbo\n\nfields = African History\n\nworkplaces = University of Ibadan , Ibadan\n\n(1964 – 1966)\n\nUniversity of Nigeria Nsukka\n\n(1966 – 1992)\n\nAlvan Ikoku College of Education, Owerri,\n\n(1993 – 1998)\n\nAbia State University , Uturu,\n\n(1998 – 2003)\n\nEbonyi State University, Abakaliki,\n\n(2004 - )\n\nalma_mater = University of Ibadan\n\ndoctoral_advisor =\n\nacademic_advisors =\n\ndoctoral_students =\n\nnotable_students =\n\nknown_for = history and historiography of Africa\n\ninfluences =\n\ninfluenced =\n\nawards =\n\nreligion =\n\n\n\n\n\nfootnotes =\n\nAdiele Eberechukwu Afigbo (born 22 November 1937 ) is a Nigeria n historian known for the history and historiography of Africa , more particularly Igbo history and the history of Southeastern Nigeria. Themes emphasized include pre-colonial and colonial history, inter-group relations, the Aro and the slave trade (1), the art and science of history in Africa, non-written-sources and the reconstruction of African history, history and nation-building.\n\nIntroduction\n\nAdiele Eberechukwu Afigbo is a Nigerian historian. He was made a historian by the men and forces that gave birth in the 1950s to the celebrated Ibadan School of History which for about three decades was the most prominent school of history in Africa. He developed to become a prominent member of that school, which devoted its time to preaching and demonstrating the possibility of and the necessity for African history and historiography as a specific genre of the world branch of knowledge known as history. In pursuing the mission of this school through teaching, research, writing and publication Adiele Afigbo produced a wide variety of works which established inter alia the possibilities of basic reconstructionist history, of African historical methodologies and of the close link between the art and science of history on the one hand and state formation and statecraft on the other. In the process he gave full rein to eclecticism with respect to sources and methods, using as the occasion demands and warrants elements from myth and other oral sources, from archaeology, linguistics, material artifacts and written sources (2). In the last analysis he defines a historian as a clinical student of human experience who seeks to tell the story as it is and to explain it. With respect to style and presentation he believes in lively narrative and analysis while heeding Aristotle's advice which says write in the language of the ordinary man but think like an intellectual.\n\nEarly life and education\n\nAdiele Eberechukwu Afigbo was born at Ihube, Okigwe , in present day Imo State . His formal education began in 1944 at the then famous Ihube Methodist Central School, Ihube where he came under the influence of remarkably dedicated teachers, the most outstanding of whom was Mr. Oji Iheukumere, the head teacher, a native of Uzuakoli, in today's Abia State who was a noted church musician and disciplinarian. At Ihube Central School Afigbo's brilliance manifested early which made his teachers to encourage him to go to a secondary school in spite of the opposition of his parents who were intimidated by the cost of post-primary education. He succeeded in his bid and went to St. Augustine's (CMS) Grammar School, Nkwerre Orlu in Imo State. with an Okigwe Native Administration scholarship won in a competitive examination. There again he came across a crop of dedicated teachers who left a definite imprint on him. Crying for mention are Mazi F,C. Ogbalu, a teacher of Igbo language and Culture and the founder of the famous Society for Promoting Igbo Language and Culture, Mr. C.G.I. Eneli a history graduate of the University College, Ibadan and Mr, E,C. Ezekwesili, the principal of the college and a history graduate of the University of Southampton, UK. These three helped to determine his future academic career. From St. Augustine's Grammar School Afigbo gained admission to the University College Ibadan with a scholarship from the government of Eastern Nigeria to read history under the then obtaining special relationship with the University of London . There again, he met remarkable scholars noted for their brilliance and beneficent influence – J.D. Omer-Cooper, J.C. Anene, J.F. Ade Ajayi and K.O. Dike. There were also his colleagues – Obaro Ikime and Philip Igbafe who not only read history with him, but with him went on to pioneer the “made in Nigeria PhD” at the infant University of Ibadan with the help of post-graduate scholarship awarded by the university to the best graduating students. Adiele Afigbo had not only come on top of his class at the B.A. level, but also was the first of these colleagues to finish his Ph.D and thus the first to receive the Ph.D. degree from an indigenous Nigerian university since the world began! For this reason some of his friends refer to him as “a national specimen”\n\nEarly career\n\nOn obtaining the Ph.D. Adiele Afigbo was appointed a lecturer in his parent department of history, a position he held for two years before fleeing to the University of Nigeria , Nsukka in the wake of the Nigerian civil war. During the duration of hostilities he served in the Directorate for Propaganda of the Ministry of Information, Republic of Biafra. He promptly resumed his interrupted academic duties after the war and rose very fast on the academic ladder – Lecturer to Senior Lecturer in History in 1970 and Senior Lecturer to Professor in 1972, thus reaching the top of his profession after only five years input as an academic. He has been heard to jocosely complain that in all his working career he has had only two promotions! A year after attaining to professorship he was appointed the Head of the Department of History and Archaeology. The year after he became also the Dean of the Faculty of Arts. On more than one occasion he held the Directorship of the Leo Hansbury Institute of African Studies. At different times in the following years he held the following public appointments among others – pioneer Director of Research at the National Institute for policy and Strategic Studies, Kuru, Jos; Commissioner first for Education and then for Local Government in the Government of Imo State; Chairman of the Michael Okpara College of Agriculture, Umuagwo in Imo State and Sole Administrator of the Alvan Ikoku College of Education, Owerri. He has also won many coveted academic honours : Honorary Member of the Historical Association of Great Britain, Fellow of the Historical Society of Nigeria, the Nigerian National Order of Merit, the (foundation) Fellowship of the Nigerian Academy of Letters. His traditional chieftaincy titles include Ogbute-Okewe-Ibe, Ogbuzuo, and Olaudah.\n\nWork as historian\n\nAny attempt to understand the work of Adiele Eberechukwu Afigbo as a historian must be made at many levels and from different directions. On the territorial level he is a historian of Africa, a historian of Nigeria, a historian of Southeastern Nigeria (3) and finally a historian of the Igbo. On the disciplinary front he is a political historian, an economic and social historian as well as a peculiarly fecund student of historiography. Myth, History and Society, one of the three volumes of his essays edited by Professor Toyin Falola is devoted to theorising on the methods of doing history in Africa, on the sources of history in Africa, on the place and purpose of history in Africa and other related issues (4). In many publications he sought to use the particular to illuminate the universal, and the universal to illuminate the particular. Thus, for instance, he used a detailed study of the textile process in Southern Nigeria to throw much helpful light on the socio-cultural dynamics of the societies of the region. In a similar manner he used the rise and expansion of the pre-colonial great states such as Benin to show that the so-called segmentary societies as well as the so-called mini-states of pre-colonial Africa are, among other things, fossilized reminders of the conditions from which the great states arose.\n\nAdiele Eberechukwu Afigbo broke away early from the action-reaction thesis that ruled the new African historiography when he joined the history profession. He did so by emphasizing in his works basic reconstructionist history, the study of peoples and cultures in their own right instead of, as he put it, seeking to put the battle dress of Saul on his little David; the study of inter-group relations as a fruitful approach to understanding pre-colonial African societies; the dynamic and multi-faceted character of myths and traditions and thus the need for scholars to adapt their methods accordingly; the recognition of historical studies as a form of statecraft while not making history the slave of politics and politicians (5). Perhaps it is this richly diversified approach to history, to historical studies and historical sources that helps to explain the range and volume of his publications which some of his colleagues have found astounding bearing in mid the environment of lack and deprivation in which African academics operate.\n\nWorks\n\n* The Warrant Chiefs: Indirect Rule in Southeastern Nigeria 1891-1929 (Longman, London, 1972\n\n* Ropes of Sand: Studies in Igbo History and Culture (University Press Limited, Ibadan 1981)\n\n* The Igbo and Their Neighbours: Inter-group Relations In Southeastern Nigeria to 1953 (University Press Limited, Ibadan, 1987)\n\n* Groundwork of Igbo History (Vista Books Limited, Lagos,1992)\n\n* Image of the Igbo (vista Books Limited, Lagos, 1992)\n\n* The Abolition of the Slave Trade in Southeastern Nigeria 1885-1950 (University of Rochester Press, 2006)\n\nCollected Works Edited by Toyin Falola\n\n* Nigerian History Politics and Affairs (Africa World Press, Trenton New Jersey, 2005)\n\n* Igbo History and Society (Africa World Press, Trenton New Jersey, 2005)\n\n* Myth, History and Society (Africa World Press, Trenton New Jersey, 2006)\n\nReferences\n\n* Ottenberg, S., Farmers and Townspeople in A Changing Nigeria (Spectrum Books Ltd, Ibadan, 2005) pp.32-33, 50, 54, 84,101\n\nNorthrup, D. Trade Without Rulers (Clarendon Press, Oxford, 1978) pp.34-37\n\nIsichei, E. A History of the Igbo People (Macmillan Press, London 1976), pp 30, 66, 67, 123, 145, 153, 254.\n\nManfredi, V., “Philological Perspectives on the Southeastern Nigera Diaspora” in Contours: A Journal of the African Diaspora, Fall 2004 vol. 2 no. 2\n\n* Falola, T. and Heaton, M. “Afigbo’s Scholarship: An Introduction” in Myth, History and Society: The Collected Works of Adiele Afigbo edited by Toyin Falola (Africa World Press, Trenton, NJ, 2006) pp.3-19.\n\nKorieh, C.J.,”Historians, Historiography and Historical Interpretations” in Falola T, (ed.) Myth, History and Society: The Collected Works of Adiele Afigbo, pp.21-28\n\nOyebade, A. “Africanizing Knowledge: The Burden of Academic Historiography” in Falola, T., Myth, History and Society: The Collected Works of Adiele Afigbo, pp.29-34\n\n* Olukoju, A. “(Re)Reading Afigbo’s Work On Nigeria” in Nigerian History, Politics and Affairs The Collected Essays of Adiele Afigbo edited by Toyin Falola (Africa World Press, Trenton, NJ, 2005) pp.15-30\n\nAgbali, A.A., “A Reflection on Afigbo,s Writings on Nigeria” in Falola, T. (ed.) Nigerian History, Politics and Affairs pp.31-50\n\nNwaubani, E., “Afigbo’s Views on Nigeria” in Falola, T. (ed) Nigerian History Politics and Affairs pp.51-62\n\n* Kalu, O. “Cameos Of The Igbo Past” in Igbo History and Society: The Essays of Adiele Afigbo edited by Falola, T., (Africa World Press, Trenton, New Jersey, 2005) pp.17-30.\n\nNjoku, O., “A Synoptic Overview”: in Falola, T. (ed.) Igbo History and Society pp.31-42\n\nNjoku, R.C. “Adiele Afigbo:Imperial History and the Challenges of Igbo Historical Studies” in Falola, T., (ed.) Igbo History and Society pp43-57\n\n* Falola, T., and Heatom, M.,”The Works of A.E. Afigbo on Nigeria: An Historiographical Essay” in History in Africa 33 (2006) pp155-178\n\nAlagoa, E.J, The Uses of Hindsight as Foresight: Reflections on Niger Delta and Nigerian History (Onyoma ResearchPublications, Port Harcourt 2004) p.138 ff."}, {"url": "http://ahiajoku.igbonet.com/1985/", "page_content": "The Igbos in the Context of Modern Government and Politics in Nigeria :\n\nA Call for Self-Examination and Self-Correction\n\nby\n\nProf. Ben O. Nwabueze\n\nN.N.M.A., S.A.N., LL.M., LL.D. (Lond.)\n\nỌha na eze, ekene m ụnụ,\n\nI would like to begin by expressing my profound thanks to the Government of Imo State and the Planning Committee of Ahiajoku Lectures for the singular honour of the invitation to deliver the 1985 lecture. I wish also to apologize to them and to everybody for the disappointment in my inability to deliver the lecture two years ago owing to ill-health. I had sworn not to allow another disappointment this year even if I have to be carried here on a stretcher!\n\nMy original choice of a topic for this lecture had a distinctly legal leaning, but I felt that a topic with a more immediate bearing on issues and problems in modern Igbo history might have more abiding interest and utility. I have therefore chosen to speak to you today on the position of the Igbos in the modern government and politics in Nigeria . And the message of my address is a call for self-examination and self-correction. The topic has the virtue that it makes a connected series with the first and third Ahiajoku Lectures. It is concerned indeed with what Adiele Afigbo calls in the third lecture \"The Age of Innocence\u0094. It seeks to examine the reasons and manifestations of this vehemence against the Igbos by their neighbours.\n\nIncorporation of the Igbos in a larger Nigerian State\n\nFor the communities comprised in the geographical area now known as Nigeria , the establishment over them of a common government is perhaps the most momentous single event in their history. It is particularly so for the Igbos who until then had never experienced any political organization larger than the village-group or clan. No doubt, there had existed among the Igbos some common identity based on a common language and common cultural patterns, but they were never organized as one political entity or nation. The Nris or Arọs may have wielded some authority over a considerable part of Igboland, but their authority, such as it was, was purely spiritual, not political. In matters of government, each village-group or clan existed and functioned as an autonomous entity, in no way subject to control by its neighbours. Now they have been brought together, with other peoples, in one vast State, with a common system of government and laws.\n\nThe incorporation of the various distinct communities in one common government implies benefits as well as obligations for their people: the benefit of protection, peace and ordered existence, increased trade and economic activity and the benefits of modernity generally; the obligation of allegiance, the duty of the inhabitants to be loyal and faithful to the Nigerian State and to obey its law. It has also brought in its wake profound changes in the social, cultural and religious conditions of the component communities.\n\nFor the Igbos, it has meant that, as Adiele Afigbo points out in his Ahiajoku Lecture in 1981, they have the rest of Nigeria as their neighbours. It is the position of the Igbos in the context of the new relationships so created \u0096 relations to the Nigerian State and with other Nigerian peoples \u0096 that this lecture is concerned to discuss.\n\nHow the Igbos are Organized in Nigeria\n\nThe core of the Igbos is located in two states of the Nigerian Federation \u0096 Anambra and Imo. In these two states dwell some ten million people who give the Igbos their distinctive character and culture. But the boundaries of Igboland extend beyond Anambra and Imo States to Kwale and Agbor in Bendel State , to Port Harcourt in Rivers State and to some border communities in Benue State .\n\nThe state boundaries in Nigeria have been largely manipulated. After the 1914 amalgamation of Southern and Northern Nigeria , the boundary of Northern Nigeria was in 1918 extended south-eastwards to include a good part of the territory that previously lay in the Eastern Province of Southern Nigeria. This has rightly been described as \u0093one of the greatest acts of gerrymandering in history.\u0094 And by the boundary adjustment exercises of recent years, the mineral-rich areas in Imo State have been excised therefrom and merged to other states.\n\nOutside their traditional habitats in Anambra and Imo States and parts of Rivers, Bendel and Benue States , the Igbos are now scattered over the whole length and breadth of Nigeria where they have settled in quite large numbers in pursuit of gainful occupation in trade and commerce, industry, agriculture and the public service. The total Igbo population throughout the country is unknown but may be put at roughly fifteen million.\n\nWith only two states as against five each for the Yorubas and Hausa/Fulanis, the distribution of states in the Nigerian Federation is clearly unbalanced against the Igbos, given that the population of the three groups is roughly comparable. (The demand for a third Igbo State was rejected during the 1976 states creation exercise.) The effect of this imbalance is particularly unwholesome since a state, rather than a recognized social grouping, such as the tribe, is now used as the unit for the application of the federal character principle in top civil service appointments, appointment of ministers, revenue allocation, representation in the Senate, and in the distribution of various kinds of government amenities. A situation in which the Igbos have two shares as against five each for the Hausa/Fulanis and Yorubas cannot make for harmony in the country, nor can it nurture in the Igbos the feeling that they belong and have equal rights with the others. This anomaly needs to be corrected. As Dr. Obi Wali said in the Constituent Assembly in 1978, the creation of states has ceased to be solely a response to minority problem, and has become \u0093a means of the majority groups trying to adjust again in order to square up.\u0094\n\nThe use of the state rather than the ethnic group as the unit for the application of the federal character principle in the distribution of government benefits is of course a distortion of its underlying objective. The tribes are the groups for whom participation and protection against domination are sought to be provided through the federal character principle. States are not part of our indigenous social organization, but rather artificial political creation. Moreover, distribution according to states in no way reflects the numerical strengths of the four social groups \u0096 Hausa/Fulanis, Yorubas, Igbos and the Minorities. It is either the Igbos are given at least two more states or the application of the federal character principle is based on the ethnic group and not on the state.\n\nIt is as well to note that some of the Igbo border communities in Benue State as well as those in and around Port Harcourt now strenuously disclaim their Igbo identity. The disclaimer is manifested in practical terms by the latter changing the names of their villages by prefixing them with an \u0093R\u0094, so that Ụmụokoro becomes Rụmụokoro, Umuigbo becomes Rụmụigbo, Ụmụmasi becomes Rụmụmasi, Ụmụkoroshe becomes Rụmụkoroshe, and so on. The intention is to make them not look or sound like Igbo names.\n\nThe politics of modern Nigeria had produced a pan-Igbo organization \u0096 the Igbo State Union. In the heady days of nascent ethnic nationalism, the birth of the Igbo State Union was a logical development. It had its counterpart in the Yoruba State Union (there were also other pan- Yoruba organizations like Egbe Omo Oduduwa and Egbe Omo Yoruba), Ibibio State Union, Idoma Tribal Union, Igbirra Tribal Union, Ijaw Progressive Union and Bornu State Union. All of these have, lamentably, suffered demise in 1966 along with the First Nigerian Republic . A decree of the Federal Military Government (FMG) in 1966 has dissolved and proscribed them specifically by name. Altogether twenty-six named tribal or cultural unions were so dissolved and proscribed.\n\nA new pan-Igbo organization, by the name of Ohaneze, formed after the 1979 restoration, was high jacked by the politicians of the Second Republic , and thereby prevented from serving as a pan-Igbo platform. It too is now also proscribed by a 1984 Decree of the Federal Military Government which, without specifically mentioning particular tribal or cultural associations by name, as did the 1966 Decree, dissolves \u0093all movements and organizations (howsoever known or designated) established for the creation of more states or local governments in Nigeria or for boundary adjustments or otherwise meant to promote ethnic differences or likely to destroy or disrupt the unity of the Federal Republic of Nigeria.\n\nThe method of the 1984 Decree is rather insidious. Whereas the 1966 Decree left no doubt as to the identity of the associations affected, under the 1984 Decree dissolution hangs over practically every tribal or cultural association of which it could be said by any one, however ill-motivated, that it is \"meant to promote ethnic differences or likely to destroy or disrupt the unity of the Federal Republic of Nigeria.\u0094 With the risk of imprisonment for not less than five years, a tribal or cultural association can continue to function only at its peril.\n\nI believe that tribal or cultural associations fulfill a useful societal role. They are not really a danger to the unity of the country. On the contrary, they do provide strong support for the Nigerian unity. They may have exerted pressures on government on behalf of their respective groups, but such pressures would be there and have indeed continued without the tribal unions. It seems rather ironical that the military rulers who proscribed tribal unions for their role in sponsoring and promoting ethnic interests and conflicts in the political days should, without: the prompting of the tribal unions, have fallen easy victims to the pressures of the very same ethnic interests. We should certainly eschew tribalism, but we cannot abolish the tribe any more than we can abolish our individual existence. \u0093Any idea,'\" writes Arthur Lewis, \u0093that one can make different peoples into a nation by suppressing the religious or tribal or regional or other affiliations to which they themselves attach the highest political significance is simply a non-starter. National loyalty cannot immediately supplant tribal loyalty; it has to be built on top of tribal loyalty by creating a system in which all the tribes feel that there is room for self-expression.\"\n\nThe Igbos are among the most adversely affected by the proscriptions. The tribal unions of some of the other groups have continued to function, not openly, of course. The Igbos cannot take such chances without running the risk of being branded as subversives. There is a Leader of the Yorubas publicly so styled and acknowledged. The Hausa/Fulanis acknowledge the leadership and authority of the Sultan of Sokoto, at any rate in matters of religion, but religion happens indisputably to be the most critical single factor in Nigerian government and politics. The Igbos have no leader of any kind, religious or otherwise. They are left to drift without proper direction and guidance. Chinua Achebe is right when he says that \u0093the real problem with the Igbo since Independence is precisely the absence of the kind of central leadership which their competitors presume for them. This lack has left them open to self-seeking, opportunistic leaders who offered them no help at all in coping with a new Nigeria in which individual progress would no longer depend on the rules set by a fairly impartial colonial umpire.\u0094 We need a Leader of the Igbos, preferably a non-politician, to direct and guide our people in the context of the government and politics of contemporary Nigeria .\n\nWhy the Igbos are feared, resented and hated in Nigeria\n\nIt is indeed remarkable that some Igbo communities have repudiated their Igbo identity. I know of no other group in Nigeria so repudiated by some of' its members. What this indicates is that being Igbo carries in Nigeria a certain stigma, even disability. It behooves the Igbos to reflect deeply on why this is so. We must admit to ourselves that, as a people, we excite fear, resentment and hatred in other Nigerians. In a multi-ethnic society such as Nigeria is, that is a terrible position for any of its groups to be in.\n\nSo intense indeed is the fear, resentment and hatred of the Igbos in Nigeria that no Igboman, however good his credentials, not even Zik, the widely acknowledged father of Nigerian nationalism, can today expect to command nationwide acceptance as a leader in the government and politics of the country. His every action and utterance will be misunderstood and misrepresented. He will be hounded from pillar to post, until he is got rid of, which will be sooner than later. In present-day Nigeria , no Igboman can last as head of the federal government. That was the fate of General Ironsi, the first military head of the federal government, although he was personally responsible to a large extent for his own undoing.\n\nThe question, then, is: Why are the Igbos feared, resented and hated in Nigeria ? I think the basic explanation is that the establishment of the Nigerian State with its power politics and its competitive economic system, has brought out the best and the worst in the Igbo, and exposed the other peoples of Nigeria to it. The best in the Igbo character excites fear in others while the worst in him excites resentment and hatred. And he is endowed by nature with rather liberal measure of both. His best is singularly good, his worst singularly bad.\n\nPerhaps the most outstanding quality of the Igbo is his innate receptivity to new ideas and adaptability to change which, under the stimulus of Christianity and western education imported into Nigeria by the modern government, readily triggered in him an obsessive desire for self-improvement and modernity through education. Western education was the stepping stone to employment and political power. It opened a whole new vista of opportunities for the acquisition of wealth in commerce and industry. The Igbos were quick in grasping the value of western education. The drive for education thus became the driving force in the Igbo society. A whole community would team up to build a community school and finance its courses, to institute a scholarship scheme for its sons and daughters, and even to establish a secondary school or college. A parent would slave and deny himself all comforts in life in order to send his child to school; his ambition was to make good in his child what he himself lacked. He might be a peasant farmer, a poor illiterate or semi-literate carpenter or blacksmith, but his dream was to live to see his son become a clerk or even a lawyer, doctor or engineer. And once successfully trained, the child accepted it as a family obligation to train his brothers and sisters. (All this co-operative effort and sense of family obligation have now virtually been sup-planted by excessive individualism and self-centeredness.)\n\nBy this \u0093fantastic burst of energy\u0094, the Igbos were able, in the twenty years between 1930 and 1950, to challenge the lead which the Yorubas had enjoyed in the field of education by reason of being the first to come under western modernizing influence, and to threaten to neutralize the dominance which this had given them in the public service, commercial firms and in business. Igbos had become a menace to the Yorubas, and a danger to the other Nigerians, exciting in all the fear of domination.\n\nNext to the Igboman\u0092s zeal for self-improvement and modernity through education comes his economic individualism and his spirit of enterprise and competition which have found ample expression and encouragement in the individualistic and libertarian ethos of the modern government. His individualism is apparently a product of his social and political system in which the village-group was the largest political unit, and in which within the village-group authority was diffused among the heads of the numerous families, lineages and villages. The society was an egalitarian one in which everyone counted equally and was entitled to a say in public affairs. The Igbo was therefore very little inhibited by authority or by any stratification of society based on birth. \u0093Unlike the Hausa/Fulani\u0094, writes Chinua Achebe, \u0093he was unhindered by a wary religion and unlike the Yoruba, unhampered by traditional hierarchies. This kind of creature, fearing no God nor man, was custom-made to grasp the opportunities, such as they were, of the white man\u0092s dispensation.\u0094 They saw therefore in the larger Nigerian community a welcome outlet for their spirit of enterprise and adventure. Taking advantage of the free mobility of people, the free enterprise system and the peace and security afforded by the modern government, they moved out of their \u0093forest home\u0094, and soon established themselves in various kinds of business a]l over the country \u0096 shops, hotels, garages, market stalls and even schools and hospitals.\n\nTheir competitive energy being such as only few, if any, other groups in the country can match, they soon \u0093virtually seized the floor\u0094 from the people among whom they settled, buying them out of their lands and shops, and again exciting in them fear of domination. Only few other groups in Nigeria can really compete with the Igbos on equal terms, and be able to stand their ground. The rival competitor finds himself often enough forced to the rear or to the side; such indeed is the competitive drive and resourcefulness of the Igbos. \u0093 Lagos women sell their wares in the gutters: the UPGA Igbos sell in shops\u0094 \u0096 so runs a caption under photographs showing prosperous Igbo shops in Lagos in 1964. Competing with Igbos on equal terms is indeed like fighting a battle in which one is doomed from the start to lose!\n\nIn their enterprising spirit and aggressive individualism, the Igbos may appear to be exploitative, grasping and greedy, but these are attributes which characterize all aggressively enterprising people everywhere. They are not therefore proper grounds on which resentment can justifiably be nursed against the Igbos by other Nigerians. Fear may be justifiable, but certainly not resentment. Resentment based on these grounds simply tantamounts to envy and jealousy. I believe also the Igbos are democratic and fair-minded people, always prepared more than any other group to concede to others the right to share equitably in what belongs to all. Accusation of nepotism often leveled against them seems to me therefore unjustified.\n\nHowever, his success in education and trade has inclined the Igbo toward a \u0093noisy exhibitionism\u0094, over-assertiveness, over-confident and too-know air, an over-weening pride and to a patronizing and condescending attitude towards the less successful communities among whom he settled. The latter are despised and mocked to their face for not being as successful. For all this I think the Igbos are justifiably resented.\n\nBut this is only a manifestation of a more basic strand in the Igbo character \u0096 his lack of diplomatic sense in dealing with others. In his relationship with others, especially people in authority, the Igbo is incapable of displaying anything of the fawning obsequiousness of the Yoruba or the submissive humility of the Hausa/Fulani, which is all part of the techniques of social diplomacy that has enabled them to get along so well in Nigeria. This lack of diplomacy in the social relations of the Igbo may often appear to others as a mark of disrespect and discourtesy. In so far as this may be considered a defect, I confess to being a typical Igbo, for I am quite incapable of fawning on any one, however highly placed, even as a matter of social diplomacy.\n\nThe social relations of the Igbos are characterized further by a certain amount of thoughtlessness and lack of tact. That seems clearly to be exemplified in the rather idiotic killings during the first coup in January, 1966. An undertaking, nobly nationalistic in conception, was thus needlessly given a tribal colouration on account of the fact that, with one exception, all the people, civilian and military, killed in the course of it were non-Ibos. It should have occurred to a more thoughtful group of people that in a military coup led almost entirely by Igbo officers, killing involving only non-Igbos would be open to this kind of interpretation. In any case, most of the killings, especially those of the military personnel, were both unnecessary and senseless.\n\nI am not sure whether the killings could be explained simply in terms of thoughtlessness. I think they also suggest something, of a headstrong disposition. Was it mere thoughtlessness that propelled us into rebellion knowing, as we did, that the inevitable outcome would be war for which we were thoroughly ill-prepared? It must be something more than thoughtlessness that made us insist on fighting the war over every inch of Igboland, instead of negotiating an honourable termination of it at an appropriate time earlier. I think that rebellion and continuation of the war in those circumstances betray both thoughtlessness and a headstrong disposition.\n\nThe Igbos are undeniably a headstrong people, stubborn and violently self-willed. \u0093A certain stubbornness seems to be built into our psyche; an instinctive preference to break when perhaps it is possible only to bend.\" This headstrong disposition is well depicted in Chinua Achebe's Things Fall Apart when the principal character, Okonkwo, in true Igbo character, \u0093took his matchet oft its sheath, chopped off the court messenger\u0092s head and walked home, proud that he had acted like a man but disillusioned to know that his people had allowed the other messengers to escape.\u0094 But, as Mike Echeruo remarked in his brilliant Ahiajoku Lecture in 1979, the headstrong disposition in Igbo character is both a source of strength and of disaster. Rebeliion and the civil war are the worst disaster it has brought to the Igbos.\n\nAgain we read from Elizabeth Isichei's A History of the Igbo People, that resistance to colonialism was fiercest and longest in Igboland. It took the British \u0093over twenty years of constant military action\u0094 to subdue the Igbos. With only capguns, Dane guns, machetes and the occasional rifle, they flung themselves, heedless, against the British, heavily armed with rifles, machine guns and unlimited supplies of ammunition and were slaughtered in their thousands. In this, they were mindless of the simple truth that discretion is the better part of valour.\n\nAs late as 1905 when the British had smashed almost every resistance to their colonial penetration, the Ezza of Abakiliki were reported to have told an emissary of the colonial government that they \u0093recognized no superior authority except the Heavens above and the Earth beneath\u0094, and that between these two awe-inspiring super human potentates they constituted a third force. What a defiant spirit, but it also betrayed a certain pig-headedness and self-delusion.\n\nThe worst in the Igbo seems perhaps to be his lack of political sense, his tendency to look at issues in Nigerian government and politics in a purely idealistic context and to apply to them purely idealistic solutions often based on acquired book knowledge but without sufficient regard to the realities of the Nigerian situation. Politics being simply the art of the possible, the Igbos may truly be described as poor actors, utterly devoid of a political sense. With their background of a diffused traditional political system, they have no traditional familiarity with the techniques and tactics which the government and politics of a large and complex political community like Nigeria calls for.\n\nThe Igbo political naivete is perhaps best exemplified by Ironsi\u0092s abolition of the federal system in favour of a unitary system in the belief that that offered a short cut to Nigerian unity. In the circum-stances of Nigeria at the time, it was naive of him to have thought that unity could be secured through a unitary system imposed by military fiat. His solution was much too idealistic. It ignored the reality that a country the size of Nigeria and comprising a wide diversity of tribes separated by fundamental differences of language, culture and out-look, can live together at peace only under a framework in which its component units are allowed to manage their own internal affairs. It ought reasonably to have been foreseen that a unitary scheme would arouse the age-old fear of Igbo domination, as it in fact did among the Hausa/Fulanis.\n\nWe all know the cost to the Igbos of the thoughtlessness of the killings in the January, 1966 coup and of Ironsi\u0092s unitary scheme. It was in order to settle scores with the Igbos for th6se killings and to counter the threat of Igbo domination implicit in the unitary scheme that thousands of Igbos resident in the North were massacred in May, July and September, 1966. The massacres were certainly too genocidal in their extent and too savage in their methods to have been warranted by the provocation, but we did give some occasion for it.\n\nThere is so much in the present political situation in the country that makes it necessary that the Igbos should be extremely circumspect and cautious so as not to become scapegoats for whatever might go wrong, and thereby invite yet another massacre on themselves. Those Igbos in sensitive or critical public positions should carefully weigh their actions and utterances in the light of this. It is perhaps wiser for them not to express themselves too soon on explosive public issues.\n\nIgbo propensity for self-hate, self-destruction and intra-group discord\n\nThe Igbo society is really a plural one comprising various sub-groups between whom there is little common identity beyond that based on a common language and broad cultural patterns. There is, for example, the division between the riverine Igbos and the upland Igbos (Olu and Igbo) and, in Anambra State , between Anambra North and Anambra South. The sub-groups are marked apart from each there by differences of dialect, customs, political organization, occupation and outlook. The division between the riverine and upland Igbos is that between \u0093slave-dealing, kingdom \u0096 associated peoples\u0094 and \u0093slave-providing, kingship lacking populations.\u0094 \u0093The Olu, with their well-watered farms and protein rich diet\u0094, writes Elizabeth Isichei, \u0093despised the Igbo for their food and water shortages, and their role as slave suppliers.\" \u0093The people of Owerri felt superior, as warriors, to the neighbouring Isu, who were Traders. The smiths of Agulu-Umana looked down on the neighbouring Oheke who did not share their skills. The people of Arochukwu called themselves the children of God.\u0094 Even within the sub-group, the sense of attachment grew \u0093weaker as the unit grew larger \u0096 the family, the lineage, the village, the village group\u0094, the clan and so on.\n\nThe relations between the members of a village or village-group, and between one village-group or clan and another are marked by social discord. They are always disputing over one issue or the other \u0096 land, water, ceremonial rites, traditional offices and titles, etc. None is prepared to accept the leadership or authority of the other. Everyone is king unto himself. The quarrels are embittered by the poverty of the traditional Igbo society.\n\nThe Igbos thus come to the politics of modern Nigeria with some inbred propensity for intra-group quarrelsomeness. Within the group, unless you are able to get them all in one political party, partisan politics of the modern Nigerian state is, in the tradition of that of the traditional community, approached in the spirit of a feud, which is fought with vehemence, with no quarters given on either side.\n\nAnd so we find, as l think everybody acknowledges, that the political feud of the Second Republic was more vehement and bitter in Imo and Anambra than in any other state. Igbos in different political camps were at each other's throats, with frequent clashes between their organized armed gangs which left in their trail considerable casualties in human lives and property. There was in particular the sad case of the Igbo Governor of Anambra State locked in hateful political feud with the Igbo Vice-President of the country, also from the same state. And when the Second Republic was eventually overthrown by the military, every Igbo turned informer against his brother, writing endless petitions to the authorities.\n\nThe Igbo capacity for self-destruction was again well demonstrated in what has been referred to as the \u0093saboteur mania\", which had seriously undermined the ability of their new state of Biafra in prosecuting the civil war. Almost every person of consequence in the society came under suspicion and harassment as a saboteur by the Biafran public, ever \u0093vigilant\u0094, and ever ready to discover evidence of sabotage in every act, document and every utterance. A commander who lost a battle for whatever reason, which often had to do with inadequate resources in men and ammunition, was branded a saboteur and harassed. Even the Biafran Inspector-General of Police was so branded, and his son was nearly killed at school by his mates for being the son of his father. In his admirable book, No place to Hide, Bernard Odogwu has provided us with a telling account of how close the Biafran state came to destroying itself on account of this saboteur mania. \u0093The onus\u0094, he writes, \u0093was more or less on anyone to prove that he was no saboteur and there were no exceptions, as most vigilante groups, notably the Civil Defense, took to the streets in their searches for saboteurs. It was with that kind of confusion and chaos reigning supreme that Enugu fell into the federal hands.\u0094 All this is somewhat reminiscent of the \u0093massed administration\u0094 of the traditional Igbo society which is, in a loose sense, rather akin to mob rule.\n\nThe Igbo propensity for intra-group discord has been further aggravated by the modern government in two other respects. At the time of the advent of the modern government in Igboland, slaves and their descendants formed a large element of the societies of most Igbo communities. They even outnumbered (and still do) the free-borns in some of the riverine communities, notably those in Ogbaru district where I come from. This had resulted from the stoppage of export trade in slaves from the 1830s (the last slave ship left the Delta in 1854) which meant that, since the internal trade did not thereby cease, the slaves had then to be absorbed within the communities. In the result \u0093slaves became cheaper, and their number increased vastly.\" They were accumulated \u0093partly as a status symbol.\"\n\nAs a result of the large increase in the number of slaves, the societies of the affected communities had become polarized. For, slaves were without any legal rights whatever, being the absolute property of their masters and as such subject to their power of control and disposition. They were subjected to oppressive disabilities and debasing treatment, like being used for sacrifices or for the burial rites of titled masters, the denial of the right to become the head of a family or village, the right to take titles or to intermarry with free-borns. They acquiesced in the system, although slave revolts did erupt from time to time. Over a period of time, the slaves and their descendants began to be assimilated into the lineage structure of the communities. The assimilation proceeded upon a social fiction where-by slaves and their descendants were regarded as having originated from the same ancestral stock as the free-borns, so that terms implying kinship, such as \u0093brother\u0094 and \u0093sister\u0094, were used between them and the free-borns. But the disabilities remained in actual social life. There was thus in the system the seed of social discord which eventually germinated and grew under the stimulus of certain measures of the modern government implementing its democratic ethos of freedom and equality.\n\nThere was, first, the proclamation of 1901 which abolished slave dealing in all its various forms. Another proclamation of the same year, as amended in 1912, enabled a salve to buy his freedom. And in 1916, the status of slavery itself was finally abolished. (The Slavery Act of 1833 enacted by British Parliament applied only in the colony of Lagos, but not in the rest of the country which was a protectorate). In Eastern Nigeria, the Abolition of Osu System Law, 1956 completed the process of emancipation by abolishing, not only the status of slavery or osu, but also all their attendant disabilities, and by making it an offence for any one to enforce against any person any disability based on his previous status as a slave or osu.\n\nSlaves and their descendants were naturally encouraged by these measures to challenge the privileged position of the free-borns, and to demand to be admitted to the kingship of the village-group or clan and the headship of families or villages, to the wealth title societies and to the other rights and privileges previously denied to them. Where their demands were not conceded, as was the case in many of the communities, they organized separate kingships, head-ships, title societies, festivals and other traditional ceremonial rites for themselves. Many Igbo communities have thus become thoroughly dichotomized into two antagonistic groups feuding among themselves over practically every issue. Social and economic development in the communities has inevitably suffered, as the energy and resources that would otherwise have been channeled into development projects are wasted on feuds.\n\nFeuds over chieftainships instituted by the modern governments are yet another factor that has exacerbated social discord in Igboland. The modern government\u0092s conception of authority as something requiring, subject to checks and balances, to be more or less concentrated in a single person, as opposed to the diffused or \u0093massed\u0094 character it assumed in Igbo traditional society, led the British colonial government in Nigeria to appoint so-called \"warrant chiefs\" to assist the colonial district officer in superintending the affairs of the village communities of Igboland. Those so appointed were, for the most part, upstarts, people smart or bold enough to come forward to meet the white colonial district officer. They quickly established a regime of incredible corruption, rapacity and oppression, which created widespread resentment among the people, culminating in the famed Women\u0092s Riot of 1929, which at last forced the colonial government to abolish the system, and to recognize in its place the traditional system of administration by family, lineage and village heads and other elders.\n\nThe conflict of authority created by the warrant chief system between the government-appointed chiefs and the traditional authorities was rekindled in 1950 when the government of Eastern Nigeria established a new system of local government based on elected councils empowered by law to conduct the affairs of local government in the various local communities. Since the people still identified the source of legitimate authority in the lineage, village and clan heads, the new elected councils found themselves more or less obstructed in asserting their statutory authority against that of the traditional authorities. In the ensuing conflict, not much development could take place. Instead, the councilors devoted themselves to corrupt enrichment just like the warrant chiefs before them. The conciliar system had again to be abandoned, and was replaced with a system of direct administration by the state government through its own civil servants, the so-called system of deve1opment administration, which in turn was abolished under the Local Government Reforms of 1976.\n\nChieftainship continued to be a thorn in the flesh of the government of Eastern Nigeria which eventually yielded to pressure for conformance with the practice in the two other Regions of the Federation. Following the report of an inquiry on the position, status and influence of chiefs and natural rulers in the Eastern Region, a law was passed in 1959 empowering the government to grant recognition as a chief to persons selected in a manner prescribed by the law. Chiefs so recognized were classified as either first or second chiefs. (The 1959 laws have since been replaced by new ones.)\n\nThus was unleashed on Igboland the struggle for recognition as a chief. Rival contenders or rather pretenders to chieftainships which either never existed before or originated in the discredited warrant chief system, or which have been in abeyance for more than half a century mushroomed overnight, splitting the communities into feuding factions. Few, if any, communities in Igboland have been spared the embittering social discord of chieftaincy feuds. And even after the contest was supposed to have been resolved by the government recognition of one of the contenders, the losing factions have remained unreconciled, so that the feuds have continued almost unabated.\n\nChinua Achebe\u0092s remarks on the present situation regarding chieftainship in Igboland seem to me most apt and worthy of our attention:\n\n\u0093The bankrupt state of Igbo leadership\u0094, he says, \u0093is best illustrated in the alacrity with which they have jettisoned their traditional republicanism in favour of mushroom kingships. From having no kings in their recent past the Igbo swung round to set an all-time record of four hundred \u0093kings\u0094 in Imo and four hundred in Anambra! And most of them are traders in their stalls by day and monarchs at night; city dwellers five days a week and traditional village rulers on Saturdays and Sundays! They adopt \u0093traditional\" robes from every land, including, I am told, the ceremonial regalia of the Lord Mayor of London !\u0094\n\nThe Igbos in rebellion against Nigeria\n\nIt is an irony of history that the Igbos who had been the most ardent champions of Nigerian unity should also be the people to sponsor secession. Until 1966, Nigerian unity had indeed been an article of faith with them. As Stanley Diamond has rightly remarked, \u0093the Ibos had nurtured the idea of common citizenship with all people among whom they lived. To inquire into the precise identity of an Ibo was to insult his sense of fraternity with other Africans in Nigeria , Being an Ibo was a private affair, perhaps a source of pride; but the public image was Nigerian.\u0094\n\nDr. Nnamdi Azikiwe, an Igbo, is acknowledged by the generality of Nigerians as the founder of Nigerian nationalism. His able lieutenants were of course drawn from all over Nigeria, but the most outstanding among them included many Igbos \u0096 Mazi Mbonu Ojike, Dr K. O. Mbadiwe, Dr. Nwafor Orizu, Mokwugo Okoye, Osita Agwuna, Dr. M. I. Okpara, Ikenna Nzimiro, to mention only a few.\n\nWhy then, did the Igbos turn round to sponsor secession? The explanation seems to be that secession was forced upon them by a combination of tragic events. The planned massacre in 1966 of thousands of Igbos resident in the North, the unwillingness or inability of the federal government to protect them and their properties against such acts of wanton destruction, the constant state of fear and insecurity in which they had to live, the possibility that the pogrom might be re-enacted following the cyclic pattern it had taken in May, July and September, 1966, the consequent mass exodus of Igbos (numbering some one to two millions) from the rest of Nigeria back to the safety of their homes in Eastern Nigeria, the failure to keep faith over the agreement reached among the military leaders at Aburi, Ghana on the form of association for Nigeria \u0096 these and other acts of oppression combined to produce in the Igbos a feeling that they were no longer wanted in the Federation. Federalism in government is the aggregation of different communities for the purpose of pooling together their resources, human, economic, etc., for the common benefit of all. Of these resources, the human is the most important. Once, therefore, the human element has been torn apart, the Federation is like a disembodied object. While a desire for the exclusive control of the oil wealth located in Eastern Nigeria might have been an operative factor in the secession, the masses who demonstrated, demanding secession, were moved by the bitter emotion of their relatives killed or maimed in the North, and by the agonizing spectacle of the wretched condition of those who managed to escape the slaughter to return home.\n\nIt is generally conceded both by political theorists and constitutional lawyers that a people may be morally justified in resisting by force a government which has persistently abandoned its responsibility to protect them or to cater for their material well-being. This view of the matter is predicated upon the rationalization that since the purpose of government is the protection and well-being of the people, a government which has become destructive or careless of that purpose forfeits its claim to the allegiance of the people. Discussing the question whether a constitution, by virtue of being the supreme law, is binding morally upon all citizens in all circumstances, Sir Kenneth Wheare, the celebrated English constitutional lawyer, has said:\n\n\u0093There are circumstances in which it is morally right to rebel, to refuse to obey the Constitution, to upset it. A Constitution may be the foundation of law and order in a community, but mere law and order is not enough. It must be good law and good order. It is conceivable surely that a minority may be right in saying that it lives under a Constitution which established bad government and that, if all else is tried and fails, rebellion is right. No doubt it is difficult to say just when rebellion is right and how much rebellion is right, but that it may be legitimate is surely true.\u0094\n\nThe right of the people to throw off their allegiance to an oppressive government or one that fails to protect them is nowhere mere eloquently stated or more forcibly asserted than in the American Declaration of Independence of July 4, 1776 . \u0093When\u0094, declared the American revolutionaries, \u0093a long train of abuses and usurpations, pursuing invariably the same object, evinces a design to reduce them (i.e., the people) under absolute Despotism, it is their right, it is their duty, to throw off such Government, and to provide new Guards for their future society.\u0094\n\nWe must hasten to emphasize that the legitimacy of rebellion in appropriate circumstances is only a moral one. It cannot justify rebellion as a matter of law. To concede that it can, would involve the absurd proposition that the constitution can legalize its own destruction by force, that there can be resistance to government under the authority of government itself, and that the law sanctions violent opposition to itself.\n\nConsequence of rebellion for the Igbos\n\nThe primary consequence of rebellion for the Igbos is that, with its eventual failure after a thirty-month civil war, they have, like a conquered people which of course they are, been reduced almost to the status of second-class citizens in their own country. That is the bitter truth of the present position of the Igbos in Nigeria today.\n\nOne must, however, acknowledge the magnanimity of' the Federal Military Government towards the Igbos after the civil war, as manifested in the grant of general amnesty, the guarantee of personal safety and security for property, and of the right to reside and work anywhere in Nigeria, the re-absorption of public servants and the restoration of properties and businesses abandoned in other parts of the country. The amnesty has been honoured to the letter, as no prosecutions for the rebellion have ever taken place against any one. Never before in history has an armed conflict, fought with so much brutality and unbridled vituperation, ended with no reprisals, no trials and no shootings. When one reflects upon the history of reconstruction in the United States after the civil war in 1865, one cannot but be impressed by the magnanimity displayed by General Gowon and his government towards the rebellious Igbos.\n\nDespite all this magnanimity, however, it seems that, fifteen years after the end of the civil war, the Igbos are still begrudged equality of treatment along with the other tribes. Or how else explain the imbalance in the distribution of states with the consequent discrimination in matters of public appointments, revenue allocation, the distribution of federal government investments, financial aids and other amenities? How explain the neglect of Anambra a and Imo States in the siting of industries, both publicly and privately owned, a neglect that has left the economy of the two states much mote depressed than that of any other state in the Federation? How in particular explain the non-inclusion of even a single Igbo in the original membership of the Supreme Military Council (SMC) announced at the advent of the Buhari military administration on December 21, 1983 , apart from the Igbo civilian Attorney-General? (The omission was subsequently made good by the appointment of one Igbo military member but only after it had been taken up in the foreign press.) It is not an excuse that there are not enough Igbo military officers of sufficient seniority to have been so appointed. The Supreme Military Council was not a council for the government of the armed forces. It was a council for the government of the country.\n\nFurthermore, there were two measures of the military government which constituted a sad blot on its otherwise singular magnanimity. One is the abandoned property saga in Port Harcourt , Rivers State , where for a ridiculously low price, bearing no relation whatever to the value of the properties concerned, the Igbos were divested of hundreds of so-called abandoned properties, in favour of the indigenes of the state who claimed to have \u0093captured\u0094 them as war booty. The initial \u0093capture\" was subsequently legalized by a formal transfer to the captors under instruments of \u0093sale\u0094 executed, without the consent of the real owners, by Federal Military Government-appointed Abandoned Properties Implementation Committee.\n\nAnd by the Abandoned Properties Decree, 1979, every such sale or disposition \u0093shall be deemed to have been lawful and properly made and any instrument issued by the Committee which purports to convey any estate or interest in land shall be deemed to have been validly issued and shall have effect according to its tenor or intendment.\" The sale operates to vest in the \"purchaser\" the abandoned property in question \"free of all encumbrances.\" The registrar of lands is directed, upon presentation to him of the instrument of sale duly signed by or on behalf of the Committee, to expunge from the register the name of the registered owner and to substitute therefor that of the \u0093purchaser\u0094. Failure by any one to comply with these stipulations is made a criminal offence punishable by imprisonment for one year without the option of a fine. Finally, members of the Committee and any one acting on its behalf are indemnified of all liability in respect of the sale of an abandoned property or of anything else done by them in compliance with the directives of the FMG on the matter, and no suit shall lie at the instance of any person aggrieved by any such action, notwithstanding that such action is a violation of a light guaranteed by the Constitution. The military government's handling of the abandoned property issue is a rather distasteful chapter in the history of Nigeria .\n\nThe other measure was that enacted by the Banking Obligation (Eastern States) Decree, 1970 which, while giving full effect to withdrawals, refused to recognize deposits made into hank accounts within the former Eastern Region after the date of secession. By the Decree, a bank's repayment obligation was limited to the deposit balance as at 30 May, 1967 (the date of secession) less the aggregate of withdrawals between 31 May, 1967 and January 12, 1970 , all deposits made between those dates being completely disregarded. Thus, a withdrawal from an existing account of, say N 5,000 on 31 May, 1967 counted against the customer, but a payment-in of the same amount on the same day was disregarded. Needless to say, an account newly opened after 30 May, 1967 created no obligation whatever against the bank in favour of the customer.\n\nIt seems blatantly illogical to recognize withdrawals and refuse to give a customer credit for payments-in. There is no rational basis for so discriminating between them. The illogicality exposes the punitive design of the Decree. The basis of obligation, as between the bank and the customer, should have been whether withdrawals or payments-in were made in lawful Nigerian currency. The Nigerian currency had remained in use as the only legal tender in Biafra after secession. The existing currency was, however, changed and its use prohibited as from 31 December, 1967 , although there was an allowance of nineteen days within which the old notes had to be returned to the Central Bank in exchange for new notes. Also prohibited as from the same date was the use of the Biafran currency issued in January, 1968 in consequence of the change of currency by Nigeria .\n\nThe cut-off date for the legal effectiveness of withdrawals equally as of payments-in should therefore have been 30 December, 1967 . Deposit balances as at 30 May, 1967 should not be affected by withdrawals or payments-in made in Biafran rebel currency after its issue in January, 1968. It was a manifest contradiction to make binding on a customer withdrawals made in an illegal and worthless rebel currency from a deposit account which originated before 30 May, 1967 and which remained in credit up to 30 December, 1967. The rebel currency being illegal could not be valid and binding for purposes of withdrawals unless deposits made in it also bound the bank.\n\nThe punitive design of the Decree is also exposed by the fact that the non-recognition of payments-in made before 31 December, 1967 operated only to limit a bank\u0092s obligation to its customers. The bank had still to account for them to the Federal Military Government. It was required, after repaying the amounts allowed by the Decree, to pay over to the Federal Military Government for use in post-war reconstruction the residue of money which would other-wise have been due to its customers in the former Eastern Region.\n\nThe Decree, unquestionably punitive though it was meant to be, has to be viewed in the light of whether it is harsher than what was necessary to punish secession and to deter its future occurrence. It seems more crushing and ruinous in its effect than the secessionists perhaps deserved. So ruinous was its effect indeed that many Igbos never recovered financially from it, some even dying of heartbreak.\n\nLessons of the civil war\n\nThe rebellion of the Igbos and the ensuing civil war to crush it have an important lesson for the country. It is this \u0096 that a country composed of disparate social groups should not so conduct its affairs as to disaffect large sections of the community to the point where they are no longer willing to be part of the system or to have their affairs regulated under it. In particular, the headship of the federal government should be allowed to move round. It must be borne in mind that, under the presidential system of the Second Republic , the President, as head of government, was not just primus inter pares. He was, to all intents and purposes, the executive government. So is the Head of the Federal Military Government in the military administration. Indeed, not only the executive authority of the government but its legislative authority as well is reposed in the President under the military regime. It becomes imperative therefore that the headship of the government should not be monopolized by one group in the country.\n\nThe federal character principle enshrined in the 1979 Constitution is predicated upon the view of Nigeria as a house on four pillars, the four pillars being the Hausa/Fulanis, Igbos, Yorubas and the Minorities, and that the edifice will begin to wobble and its stability imperiled if the headship of the federal government is not made to move round these four groups. Nigerian unity demands an acceptance and commitment by all to the principle of rotation, i.e., that ordinarily no two persons from the same group should hold the headship of the federal government in succession. Unless the federal character principle is applied in order to rotate the headship of the federal government among the four groups, its application at the lower levels will not be effective to secure national unity. The danger of disintegration and of demands for a confederal arrangement will continue to stare us in the face.\n\nThe civil war underscores, in the second place, the overriding relevance and importance of justice in the administration of the government of any human society. Justice, it has been aptly said, is the \u0093bond of society\u0094, the \u0093cornerstone of human togetherness.\u0094 Implying as it does an acceptance by all of \u0093each other\u0092s existence, respect for each other\u0092s rights, and rendering to one another his or her dues\u0094, justice is the condition in which the individual can feel able to \"identify with society, feel at one with it, and accept its rulings.\u0094 An unjust society cannot maintain its unity and cohesion because it cannot arouse in its members a strong enough feeling of loyalty and allegiance. Injustice not only alienates the individual's loyalty, what is worse, it also arouses him to intense indignation and disaffection. It is a denial of the individual\u0092s worth as a human person, a manifestation by society of an uncaring attitude towards him. An individual or group denied recognition by society cannot but feel alienated and disaffected.\n\nThirdly, it serves to emphasize the point that the conduct of public affairs should not be allowed to be unduly conditioned by the leaders\u0092 selfish ambition for power or by a propensity for an easy resort to violence for the settlement of disputed issues. The civil war would have been avoided but selfishness, intransigence and lack of good faith and of an accommodating spirit on the part of the military leaders on both sides of the dispute. I hold the view that the war was needlessly forced upon the country by these leaders.\n\nWith the reintegration of the Igbos into Nigeria through the federal victory in the civil war, the territorial integrity of the country has been preserved, yet the sad experiences of the war, the incalculable Josses in human lives and property, and the bitter feelings generated on both sides of the conflict have considerably weakened the bonds of unity. It is gratifying that, in his National Day Broadcast on October 1, 1985, President Babangida should have affirmed his government\u0092s determination to \"leave behind us the legacy of bitterness\u0094, and \u0093the negation of our sense of justice.\u0094 Yet it might be expected that the bitter memories of the civil war and the desire to penalize the Igbos for it would take still more time to wear themselves off completely.\n\nConclusion\n\nThis lecture is designed as a kind of self-examination with a view to self-correction. It is a call on the Igbos to re-examine themselves, and to try to correct some of the defects and shortcomings in their character and manner of behaviour, particularly as they affect their relations with other Nigerians. The Igbos need Nigeria just as Nigeria needs them. They need Nigeria for the wider scope it affords for the Igboman\u0092s boundless industry, resourcefulness and competitive energy. They need it for the better conceptualization and perhaps realization of their vision of Africa and the world. The Igbos perceive themselves as citizens of the world, and are imbued with a sense of fraternity with all other Africans. There is need therefore for us to rethink our tactics for co-existing with other Nigerians. There is need in particular to abandon the inclination to despise or look down on others not as successful or clever as our-selves. We must \u0093learn less abrasiveness, more shrewdness and tact and a willingness to grant the validity of less boisterous values.\u0094\n\nIn the context of Nigeria , the Igbos cannot afford to act in the same headstrong way as was exhibited by Okonkwo in Chinua Achebe\u0092s novel, Things Fall Apart. The civil war should be a lesson to us, and we must strive hard to imbibe its lesson, namely, that undue stubbornness, temerity and impetuosity are not the mark of a wise and mature people.\n\nOur sense of common identity as Igbos is too fragile, and must be strengthened. Igbos must learn to restrain the propensity for intra-group feuds. It is a tragedy of Igbo historical development in Nigeria that, in their pursuit of excessive individualism and self-centredness, the Igbos have lost the co-operative spirit and the sense of obligation to the family, village and clan which characterized them during the period 1930-50 and enabled them to achieve an almost revolutionary breakthrough in the educational field. That spirit needs to be revived.\n\nThe creation of executive chieftainships in Igboland is probably not a bad thing in itself. For the lack of them has had an unsalutory effect on the Igbo character by predisposing him towards unbridled individualism and lack of due respect in his attitude towards authority. By the creation of executive chieftainships, a start may now be made in the evolution amongst us of the traditions of respect, obedience and submissiveness demanded by the institution. But the propensity to feud over chieftaincy titles and the desire to invent ridiculous-looking dresses for the office must be restrained. The significance of the office lies, not so much in the flamboyance of the regalia, as in the authority it bestows on the holder to enable him to shape the character, behaviour and lives of his people. Form and ceremony are, of course, important in the life of a people. I am a firm believer in ceremony. For it is, in Mike Echeruo\u0092s words, \u0093at the very heart of culture.\u0094 Yet it must not be allowed to become so absurdly elaborate and expensive, as the ofala of many of the new Igbo kings tends to be.\n\nFinally, the immense complexities of life in Nigeria demand a Leader to guide and direct the Igbos.\n\nỌha na eze, ekene m ụnụ.\n\n\n\n\n\nFOREWORD\n\nSince Professor M. J. C. Echeruo, in 1979, eloquently discussed the question of Igbo identity, very rewarding statements have been made on Igbo civilization in the areas of history, agriculture, science and Igbo cosmology.\n\nIn the 1985 Ahiajoku Lecture held on Friday, Afo, 29th November, at the Multi-Purpose Hall, Owerri, Professor Ben O. Nwabueze, Senior Advocate of Nigeria, made another great stride in his lecture titled \u0093The Igbos in the Context of Modern Government and Politics in Nigeria: A call for Self-Examination and Self-Correction\u0094. Like the legal luminary he is, the Professor delivered his lecture with great eloquence and analytical skill, letting the Igbos understand and face the socio-political reality of their peculiar situation in Nigeria .\n\nProfessor Nwabueze examines the new relationships of Igbo people both with the Nigerian state and with other Nigerian peoples; and unequivocally states that despite obvious capabilities of the Igboman, his shortcomings in diplomacy, thoughtfulness, tact and political sense, coupled with some heedlessness and truculent self-will, have earned him resentment by other Nigerians. He has also raised the question as to whether the degree of resentment is justified. On the whole, however, his lecture seeks to caution his kinsmen to make necessary readjustments for a meaningful accommodation in their environment.\n\nOne could say that this lecture is the first climax in the series of Ahiajoku Lectures, as it brings to a head the findings of previous lectures. Some may find it controversia1, and many may find it edifying, but all will certainly find it exciting.\n\nMy ministry is very grateful to Professor Ben O. Nwabueze, S.A.N., for this wonderful lecture which is not only thought-provoking but also very enlightening.\n\nDr. Linus U. Akunnakwe\n\nCommissioner for Information, Culture Youth and Sports\n\nImo State\n\nA CITATION ON 1985 AHIAJOKU LECTURE by\n\nInnocent Diala Nwoga\n\nChairman, 1985 Ahiajoku Lecture Planning Committee\n\nWe return today to continue our search for an answer to the great question of our time. Over the years, since we have endeavoured as a people to run our own affairs, it has gradually become clear that we are not at one with the milieu in which we have had to operate. As one institution after another has turned to clay in our hands, and as the volatility of life becomes insupportable, the need has manifested itself for us to begin an inquiry into the requirements of our circumstance. And so, we find that to come to terms with ourselves, we must struggle through the thick fog of foreign influence and battle for order from the chaos which has been generated in our world by its violent collision with the 20th century.\n\nAs we look through the years and through the volume of research findings which have been aired in this hall, we recall that the proposal to start an Ahiajoku Lecture at first conjured, for many, the dreaded spectre of a retreat to \u0093heathen\u0094 worship. To some others, there was the fear that the stage was being set for ethnic jingoism.\n\nBut when Professor M. J. C. Echeruo delivered the Ahiajoku maiden Lecture in 1979, he did not put on the cassock of a fetish priest or the eagle feathers of a tribal warrior, but the robe of a distinguished scholar. Under his considerable volume of scholarship and superb craftsmanship, the Ahiajoku Lecture project came to life. His subject, \u0093A Matter of Identity\u0094, at once defined and analyzed the objectives of this seemingly strange proposal of the Imo State Government.\n\nIn 1980, Professor B. N. Okigbo took us on a fascinating tour of discovery whose richness amply matched the luxuriance of our bushes, thickets and jungles, the mysteries of whose wealth he explored.\n\nThe third Ahiajoku Lecturer, Professor A. E. Afigbo, in 1981 invaded the dark reaches of Igbo history and emerged with a picture of a period when co-existence between the Igbos and their neighbours was characterized by healthy social and commercial intercourse and a near-idyllic blurring of boundaries which had its roots in a simple life, long before the harsh symbols of politics and the dominance of tribal and ethnic consciousness in its current virulent form. He spoke of the \u0093age of innocence\u0094.\n\nIn apparent agreement with the saying that one does not watch a masquerade from one spot, A. O. Anya, our distinguished Professor of Zoology, continued the search in 1982, this time from the scientific viewpoint. In a powerfully erudite survey that spanned the subjects of geography, zoology, archaeology and history, and, in a startling reach, casting as far back as 20,000 years, he brought back quite forcefully a message of the changing times and the injunction that only by developing a new consciousness of the nature of the world around us, as distinct from wearing western blinkers, would we develop the capability to mediate change in a meaningful way.\n\nIn 1983, the god of Ahiajoku Lecture was not sufficiently appeased and, so, there was no harvest. However, the Ministry of Information, Culture, Youth and Sports quickly performed the ritual of purification to appease the gods. I understand that the holocaust was cow-size instead of the usual chicken.\n\nNo wonder then that last year, as we sat spellbound, Professor D. I. Nwoga, the renowned Igbo scholar, delivered to us a prodigious harvest. In a copiously researched study, he took us on an intimate journey through the Igbo world view and ethos. A full and successful life is one that aims at Nka na Nzere, the attainment of mature old age, and the achievement of status and fullness of dignity.\n\nAt this point, may I recognize in our midst, the distinguished presence of Professors Echeruo, Okigbo, Afigbo, Anya and Nwoga, our past Ahiajoku lecturers.\n\nToday at the age of seven, we are here for the 1985 Ahiajoku harvest. Our masquerade is the renowned jurist, Professor B. O. Nwabueze, Senior Advocate of Nigeria . His subject is: The Igbos in the Context of Modern Government and Politics in Nigeria : A Call for Self-Examination and Self-Corrections. There is, in this subject, the sound of movement which will necessarily advance the position of this festival from the great researched analytical works of the past to consequential practical prescription for an intelligent immersion of the Igboman in his contemporary environment. In other words, how, knowing what we know, do we cope with our virtues and turn our weaknesses into strength? How do we employ the 1essons of the past to cope successfully with the varied and complex problems of today?\n\nI shall now cease this diversion and clear the stage for our flutist, Professor U. U. Uche, to usher in the great actor of today.\n\nCITATION ON PROFESSOR B. O. NWABUEZE, S.A.N.\n\n1985 AHIAJOKU LECTURER\n\nby\n\nProfessor U. U. Uche\n\nIt is with a lively sense of elation that I respond to the call to do a citation on Professor B. O. Nwabueze in this 1985 Ahiajoku Lecture.\n\nI will rather not disclose for how long I have known Ben Nwabueze for fear of bullying the younger members of this distinguished audience. Suffice it to say that our familiarity spans several decades, though it started by remote control during the turbulent mid-sixties under the then Vice-Chancellorship of the badly mourned Professor Eni Njoku, then of the University of Lagos . Mention of the late Professor Njoku leaves one feeling sad and deprived.\n\nNo poor words of mine can add a cubit to the stature of the said Professor Eni Njoku who, though dead, is still and will ever be remembered whenever and wherever Igbo culture, identity and scholarship are nurtured. He was to many of us not only a mentor of inexhaustible wisdom but a friend of inexhaustible kindness. I should therefore be excused the digression, if today with piety, with reverence and with no little trepidation, I am specially conscious of his immortality.\n\nLet me return to Professor Nwabueze and here in spite of my earlier stated elation at accepting the assignment to do the citation, l do have profound problems of knowing how and where to begin and even more so where to stop.\n\nYou see, my reading of the earlier lectures in these series has revealed that all the lecturers have hitherto been active university people commonly referred to as practicing academicians or, more naively, intellectuals. Let me quickly state here that the choice of Professor B. O. Nwabueze for the 1985 lecture is not in any way or any sense a departure from that respected and honoured tradition. Although with tongue in cheek, some may refer to him as a university deserter (which description hardly applies to me), yet Ben\u0092s career, his writings and achievements have done both scholarship and the legal profession proud. He is such a pearl that any university would pay any price lo acquire and keep. Alas. how can any university compete with a giant bank?\n\nAfter a star student career studded with several scholarships on academic merit at the London School of Economics and Politicai Science (that den of academic radicals of Harold Laski Stamp) University of London , Ben Nwabueze became one of the foundation lecturers of the newly-founded Faculty of Law of the University of Lagos . Having abandoned a Ph.D. programme and a Commonwealth Law Scholarship to accept the appointment as lecturer, Nwabueze rose to the challenge of the job by researching into and publishing his very first book \u0096 The Machinery of Justice in Nigeria, which to this day is a classic for every law student in any Nigerian university.\n\nNo one who has not read his The Machinery of Justice in Nigeria can fully appreciate and none who has read it can sincerely deny his depth of scholarship, his concern for detail, his elegant prose and his humour. The book was published in 1963, hotly followed in 1964 by his Constitutional Law of the Nigerian Republic, a detailed and critical analysis of the Independence and Republican Constitution of Nigeria. This second publication was another insight into Ben\u0092s encyclopedic knowledge.\n\nEven the war years (1967-1970) saw Ben labouring in-between air raids and taking cover in bunkers on his Nigerian Land 4aw later published by Nwamife Publishers in 1973. I understand that he clutched tenaciously on to the manuscripts as he ran from location to location, my own idea of a devoted scholar.\n\nAgain in 1973, he brought out his Constitutionalism in the Emergent States. This was followed in 1975 by Presidentialism in Commonwealth Africa, and in 1977 by his Judicialism in Commonwealth Africa . The sheer prolixity and courage of the output is worthy of salute.\n\nIs it any wonder that in 1978, the University of' Loudon awarded him the unique degree of Doctor of Laws by examination as distinct from those awarded Honoris Causa. The award was based on the three latest publications mentioned above. It is significant that Professor Nwabueze is the second Nigerian, indeed African, to be accorded this academic honour by the University of London , the first being Dr. T. O. Elias, now of the World Court at the Hague .\n\nBen\u0092s three \u0093isms\u0094, as the latest three publications have come to be called, placed him in a category all his own as one of the leading constitutional lawyers both nationally and internationally. But his pen is still very much charged, indeed somewhat overcharged, because in 1982, he brought out his Presidential Constitution of Nigeria and again sti11 in l982, his Constitutional History of Nigeria .\n\nYou will, I hope, forgive me for describing him at the launching of his latest book in July, 1983, Federalism in Nigeria under the Presidential Constitution, as an academic human factory. Let me warn you all that at that launching, Ben threatened to inflict three more books on us all in the next few years, the first of the series for publication by Longman\u0092s Publishers will by now have been handed in for printing.\n\nHaving mentioned some of his several works, I will spare this distinguished audience the rather endless catalogue of his academic articles, conference papers and public lectures.\n\nAs if to atone for his long periods in the study poring over volumes in spite of a charming wife and warm-hearted children, Ben, in his latest book did admit that they have continued to put up with good humour, the long spells of silence and irritability which had become a constant feature of his life. Who would envy their lot?\n\nYou will by now have got some idea of the kind of lecturer whose citation I have been asked to attempt.\n\nProfessor Nwabueze has not only been an author, writing behind a silent desk in the tradition of William Blackstone and Kent of the English and American legal systems respectively. He has indeed occupied and performed in many roles both in Nigeria and beyond.\n\nHis public appointments include: Member, Constitutional Committee for Nigeria in 1966; Member, Constitution Drafting Committee for Zambia, 1973; Member, Constitution Drafting Committee for Nigeria and Chairman, Sub-Committee on Fundamental Objectives and Directive Principles of State Policy, 1975 \u0096 1976; Member, Constituent Assembly for Nigeria, 1977; Member, United Nations Study Group on Constitutional Processes for Namibia, 1977; Member, Organizing Committee for the Sixth Commonwealth Law Conference held in Lagos in 1980 and Chairman, Papers Committee of the same conference. Need one continue?\n\nOh, yes. Executive Committee Member, World Peace through Law. Is it then any surprise that in 1978, he was made Senior Advocate of Nigeria (SAN) \u0096 a unique honour reserved for the very best of the legal profession. In l980, he received the National Merit Award from former President Shehu Shagari and in 1983, he was made an Honorary Fellow of the Nigerian Institute of Advanced Legal Studies. The man seems to attract honours like a magnet.\n\nEven at the risk of converting this citation into a mini-lecture, let me say that Professor Nwabueze\u0092s citation as an academician can never be complete without a brief, howbeit with nostalgia, of his academic appointments. Apart from a brief period at the London-Holborn Law College , he started off as a lecturer and later senior lecturer at the University of Lagos . He later functioned as the Dean, Faculty of Law, University of Nigeria, Nsukka; Dean, Faculty of Law, University of Zambia; Director, Law Practice Institute of Zambia (the Zambian equivalent of our own Law School in Lagos). He has also held several visiting professorships and functioned as external examiner in several universities all over Africa and beyond.\n\nProfessor Nwabueze is a sound Igbo son from Atani in Ogbaru Local Government Area of Anambra State. Ha has ploughed and fertilized vast academic fields, he has sown varied academic seeds and has reaped rich academic harvest. The members of the Planning Committee of the Ahiajoku Lectures could not have made a better choice for the topic: \u0093The Igbos in the Context of Modern Government and Politics in Nigeria : A Call for Self-Examination and Self-Corrections\u0094 for us to share in Ben Nwabueze's rich harvest today.\n\nLadies and Gentlemen,\n\nBehold Professor B. O. Nwabueze."}]}