{"Adiele Afigbo pursued a Master of Arts degree in History at the University of London in 1967.": [{"url": "https://www.wikiwand.com/en/Adiele_Afigbo", "page_content": "Adiele Eberechukwu Afigbo (22 November 1937 – 9 March 2009) was a Nigerian historian known for the history and historiography of Africa, more particularly Igbo history and the history of Southeastern Nigeria. Themes emphasised include pre-colonial and colonial history, inter-group relations, the Aro and the slave trade, the art and science of history in Africa, and nation-building.\n\nNigerian historian (1937-2009)\n\nQuick facts: Adiele Eberechukwu Afigbo, Born, Died, Academ... ▼\n\nAfigbo took up his career as a historian in the 1950s with the celebrated Ibadan School of History, which for about three decades was the most prominent school of history in Africa. He became a prominent member of that school, which devoted its time to demonstrating the need for African history and historiography as specific genres of the world history. In pursuing the mission of this school through teaching and scholarly work, Afigbo produced works that established reconstructionist history, of African historical methodologies, and links between history and statecraft. He gave rein to eclecticism of sources and methods, using as the occasion demands and warrants elements from myth, oral sources, from archaeology, linguistics, material artefacts and written sources. In the last analysis he defined a historian as a clinical student of human experience who seeks to tell the story as it is and to explain it.[citation needed]"}, {"url": "https://link.springer.com/chapter/10.1057/9781137311290_7", "page_content": "Adiele Afigbo, “The Warrant Chief System in Eastern Nigeria, 1900-1929” (Ph.D. thesis, University of Ibadan, Ibadan, Nigeria, 1964).\n\nThe University of Nigeria, Nsukka was closed between 1967 and January 1970 due to the war.\n\nFor the compelling case Adiele Afigbo made for the establishment of a Pan-Igbo Center for Igbo Studies, and for the propagation of Igbo studies, see A. E. Afigbo, Obi Ikenga: The Case for a Pan-Igbo Centre for Igbo Studies(Uturu, Nigeria: Abia State University, 2000).\n\nThe Ahiajoku Lecture Series, which was inaugurated on November 30, 1979, was designed to offer the Igbo a rare opportunity to annually gather and harness the intellectual richness of the people through public lectures by the most erudite of Igbo scholars. It is an annual intellectual harvest in which a distinguished Igbo scholar is selected to educate and share an important aspect of Igbo life and culture related to the lecturer’s expertise. Thus, Ahiajoku lecturers have focused on Igbo political, economic, cultural, social, technological, philosophical and historical experiences, as well as the people’s interactions and encounters with non-Igbo ethnic groups in Nigeria, and with the Europeans. It is an occasion to celebrate the collective Igbo achievements.\n\nFor more information on this Directorate, see Arthur A. Nwankwo, Nigeria: The Challenge of Biafra, 3rd edition (Enugu, Nigeria: Fourth Dimension Publishers, 1980), 26–28.\n\nOnwuka Njoku, “Exploring a Darkly Tunnel: Twenty-Six Years of Afigbo at Nsukka, 1966–1992,” in Toyin Falola and Adam Paddock, eds., Emergent Themes and Methods in African Studies: Essays in Honor of Adiele E. Afigbo(Trenton, NJ: Africa World Press, 2009), 37.\n\nPaul Obi-Ani, “Adiele Afigbo: Reminiscences on a Great Teacher,” in Falola and Paddock, eds., Emergent Themes and Methods, 96.\n\nUndoubtedly, there is merit in the criticisms against Afigbo because he should have been mindful that individuals are endowed differently with unique experiences and backgrounds. It is expected of an effective teacher or professor to strive to accommodate his or her students’ individual differences and needs. But Afigbo was not for the mediocre or even average students. You must be above average and hardworking in order to survive Afigbo’s scrutiny. The author started her doctoral thesis with Professor Afigbo, but did not complete the work with him due to no fault of theirs. Afigbo and the author worked very hard to complete the thesis, but it was not possible due to his retirement from the university in 1992.\n\nSee, for instance, E. Isichei, A History of the Igbo People(London: Macmillan, 1976), xiv. Here, she thanked Afigbo for the material he lent her and for giving her “the most unstinted and generous encouragement in a field of study which he has done so much to transform.”\n\nBooks published by Adiele Afigbo, The Abolition of the Slave Trade in Southeastern Nigeria, 1885–1950(Rochester, NY: University of Rochester Press, 2006); The Igbo and their Neighbours: Inter-Group Relations in Southeastern Nigeria to 1953(Ibadan, Nigeria: University Press Limited, 1987); with S. I. O. Okita, The Museum and Nation Building(Owerri, Nigeria: New Africa Publishing Co, 1985); Nigeria and the Open University(Owerri, Nigeria: New Africa Publishing Co, 1983); with C. S. Okeke, Weaving Tradition in Igboland: History and Mechanism of Igbo Textile Industry (Lagos, Nigeria: Nigeria Magazine, 1982); A. E. Afigbo, Ropes of Sand (Studies in Igbo History and Culture)(Ibadan, Nigeria: University Press Limited, 1981); The Warrant Chiefs: Indirect Rule in Southeastern Nigeria, 1891-1929(New York: Humanities Press and London: Longmans, 1972); Adiele Afigbo, R. J. Gavin, J. D. Omer-Cooper and R. Palmer, The Making of Modern Africa, Vol. 2: The Twentieth Century. 1971; New edition (Essex, UK: Longman, 1986); The Making of Modern Africa, Vol. 1: Nineteenth Century (Growth of African Civilization) (London: Longmans, Green and Co, 1968); and multi-edited volumes, E. J. Otagburuagu, A. E. Afigbo, and J. T. Omenma, Readings in African Studies(Enugu, Nigeria: Benak Ventures, 2010); E. J. Otagburugu and A. E. Afigbo, New Brides, More Hopes: Igbo Women in SocioEconomic Change before the Dawn of the 21stCentury(Nsukka, Nigeria: Institute of African Studies, University of Nigeria, Nsukka, 2008); A. E. Afigbo, ed., The Tears of a Nation and People: The Igbo and the Human Rights Situation in Nigeria(Okigwe, Nigeria: Whytem Publishers, 2000); F. C. Ogbalu and the Igbo Language(Onitsha, Nigeria: University Publishers, 1995); Groundwork of Igbo History(Lagos, Nigeria: Vista Books Limited, 1992); The Image of the Igbo(Lagos, Nigeria: Vista Books, 1992).\n\nFor examples of path-breaking studies primarily based on the use of oral traditions, see Jan Vansina, Paths in the Rainforests: Toward a History of Political Tradition in Equatorial Africa(Madison, WI: University of Wisconsin Press, 1990); E. J. Alagoa, A History of the Niger Delta: An Historical Interpretation of Ijo Oral Tradition(Ibadan, Nigeria: Ibadan University Press, 1972); K. O. Dike, Trade and Politics in the Niger Delta, 1830-1885: An Introduction to the Economic and Political History of Nigeria(Oxford: Oxford University Press, 1956).\n\nOnwuka Njoku, “A Synoptic Overview,” in Toyin Falola, ed., Igbo History and Society: The Essays of Adiele Afigbo(Trenton, NJ: Africa World Press, 2005), 35.\n\nCompared to such major ethno-linguistic groups as the Bini, Hausa and Yoruba, whose histories have been recorded before 1900, the only available accounts on the Igbo were those of Olaudah Equiano discussed in Chapter 1 of this volume, and Europeans. A few examples will suffice here: Arthur G. Leonard, The Lower Niger and its Tribes(London: Macmillan, 1906); George T. Basden, “Notes on the Ibo Country and the Ibo People, Southern Nigeria,” The Geographical Journal39, no. 3 (1912): 241–247; Among the Ibos of Nigeria. 1921; reprint (London: Frank Cass, 1966); P. A. Talbot, The Peoples of Southern Nigeria. Vol. IV (London: Oxford University Press and Humphrey Milford, 1926); C. K. Meek, Law and Authority in a Nigerian Tribe: A Study of Indirect Rule(London: Oxford University Press, 1937); S. Leith-Ross, African Women: A Study of the Ibo of Nigeria(London: Faber and Faber, 1939).\n\nToyin Falola and Matthew Heaton, “Introduction: Afigbo on the Igbo,” in Falola, ed., Igbo History and Society, 13.\n\nSee, for instance, Adiele Afigbo, An Outline of Igbo History(Owerri, Nigeria: RADA Publishing Co., 1986); “Traditions of Igbo Origins: A Comment,” Nigeria Magazine144 (1983): 3–12; Ropes of Sand, chapters 1–3 and 6; “On the Threshold of Igbo History: Review of Thurstan Shaw’s Igbo-Ukwu,” The Conch3, no. 2 (1971): 205–218. Still on Igbo origins also see J. N. Oriji, Traditions of Igbo Origin: A Study of Pre-Colonial Population Movements in Africa(New York: Peter Lang, 1990).\n\nA. E. Afigbo, The Age of Innocence: The Igbo and their Neighbours in Pre-colonial Times. Ahiajoku Lecture Series (Owerri, Nigeria: Ministry of Information, Culture, Youth and Sports, 1981), 9.\n\nG. T. Basden, Niger Ibos: A Description of the Primitive Life, Customs, and Animistic Beliefs and Customs of the Igbo People of Nigeria. 1938; reprint (London: Frank Cass, 1966).\n\nPhilip A. Oguagha and Alex I. Okpoko, Historyand Ethnoarchaeology in Eastern Nigeria: A Study of Igbo-Igala Relations with Special Reference to the Anambra Valley. Cambridge Monographs in African Archaeology 7 BAR International Series 195 (Oxford: BAR, 1984); Vincent E. Chikwendu, “Afikpo Excavations, May-June 1975: The Ugwuagu Rock Shelter (Site One) and The Abandoned Habitation Site (Site Two)” (Ph.D. dissertation, University of Birmingham, England, December 1976). See also Thurstan Shaw, Igbo-Ukwu: An Account of Archaeological Discoveries in Eastern Nigeria2 vols. (Evanston, IL: Northwestern University Press, 1970).\n\nAdiele Afigbo, “General Introduction,” in Afigbo, ed., Groundwork of Igbo History, 1; “Igbo Origins and Migrations,” in Ibid., 45–46.\n\nAfigbo, “Igbo Origins and Migrations,” 48–55.\n\nAdiele Afigbo, “Igbo Cultural Sub-Areas: Their Rise and Development,” in Afigbo, ed., Groundwork of Igbo History, 145.\n\nM. A. Onwuejeogwu, An Igbo Civilization: Nri Kingdom and Hegemony(London: Ethnographica, 1981); Shaw, Igbo-Ukwu.\n\nFalola and Heaton, “Introduction: Afigbo on the Igbo,” 4. See Onwuejeogwu, An Igbo Civilization; Chieka Ifemesia, Traditional Humane Living among the Igbo: An Historical Perspective(Enugu, Nigeria: Fourth Dimension Publishers, 1979); Elechukwu N. Njaka, Igbo Political Culture (Evanston, IL: Northwestern University Press, 1974); A. E. Afigbo, “The Indigenous Political Systems of the Igbo,” Tarikh4, no. 2 (1973): 13–23; Nzimiro, Studies in Ibo Political Systems.\n\nAfigbo, “The Indigenous Political Systems,” 15.\n\nSee Christopher I. Ejizu, “Ritual Enactment of Achievement: Ikenga Symbol in Igboland,” Paideuma 37 (1991): 233–251; Ofo: Igbo Ritual Symbol(Enugu, Nigeria: Fourth Dimension Publishers, 1986); John S. Boston, Ikenga Figures among the North-West Igbo and Igala(London: Ethnographica, 1977).\n\nAfigbo, Ropes of Sand, Chapter 4.\n\nAfigbo, Ropes of Sand, 125.\n\nSee generally G. Chuku, Igbo Women and Economic Transformation in Southeastern Nigeria, 1900-1960(New York: Routledge, 2005).\n\nIbid.; Afigbo and Okeke, Weaving Tradition\n\nD. Chambers, Murder at Montpelier: Igbo Africans in Virginia(Jackson, MS: University Press of Mississippi, 2005), Chapter 2; “Tracing Igbo into the African Diaspora,” in Paul Lovejoy, ed., Identity in the Shadow of Slavery(London: Continuum, 2000), 57; “The Significance of Igbo in the Bight of Biafra Slave Trade: A Rejoinder to Northrup’s ‘Myth Igbo,’ ” Slavery and Abolition23, 1 (2002): 101–120; Paul Lovejoy, “The Impact of the Atlantic Slave Trade on Africa: A Review of the Literature,” Journal of African History30, no. 3 (1989): 375; Transformations in Slavery: A History of Slavery in Africa(Cambridge: Cambridge University Press, 1983), 148; D. Northrup, “The Growth of Trade among the Igbo before 1800,” Journal of African History13, no. 2 (1972): 232.\n\nAfigbo, Ropes of Sand, 17.\n\nAfigbo, The Warrant Chiefs, 12.\n\nAfigbo, The Abolition of the Slave Trade, xiii.\n\nSee A. E. Afigbo, “The Nineteenth Century Crisis of the Aro Slaving Oligarchy of South-Eastern Nigeria,” Nigeria Magazine 110–112 (1974): 66–73; “The Eclipse of the Aro Slaving Oligarchy of South-Eastern Nigeria, 1901–1927,” Journal of the Historical Society of Nigeria6, no. 1 (1971): 3–24.\n\nAfigbo, The Abolition of the Slave Trade, 7–13.\n\nAdiele E. Afigbo, “Africa and the Abolition of the Slave Trade,” William and Mary Quarterly66, no. 4 (2009): 706–707.\n\nSee A. E. Afigbo, “Colonial Conquest and Rule, 1900-1950: Igboland to the East of the Niger,” in Afigbo, ed., Groundwork of Igbo History, 410–436; “The Eastern Provinces under Colonial Rule,” in Obaro Ikime, ed., Groundwork of Nigerian History(Ibadan, Nigeria: Heinemann Educational Books, 1980), 410–428; “Patterns of Igbo Resistance to British Conquest,” Tarikh4, no. 3 (1973): 14–23; “The Aro Expedition of 1901–1902 (An Episode in the British Occupation of Iboland),” Odu 7 (1972): 3–27. For more information on some of the military campaigns see D. C. Ohadike, The Ekumeku Movement: Western Igbo Resistance to the British Conquest of Nigeria, 1883-1914(Athens, OH: Ohio University Press, 1991); E. Isichei, The Ibo People and the Europeans: The Genesis of a Relationship – To 1906(New York: St. Martin’s Press, 1973), Chapter 10; Felix Ekechi, “Merchants, Missionaries and the Bombardment of Onitsha, 1879-89: Aspects of Anglo-Igbo Encounter,” The Conch5, nos. 1 and 2 (1973): 61–81; Philip Igbafe, “Western Igbo Society and Its Resistance to British Rule: The Ekumeku Movement, 1898–1911,” Journal of African History12, no. 3 (1971): 441–459.\n\nFor a detailed study of the chaos and failure of “indirect rule” in Eastern Nigeria, see Afigbo, The Warrant Chiefs.\n\nAfigbo, “The Eastern Provinces under Colonial Rule,” 427–428.\n\nAfigbo, The Age of Innocence, 14.\n\nA. E. Afigbo, “Trade and Trade Routes in Nineteenth-Century Nsukka,” Journal of the Historical Society of Nigeria7, no. 1 (1973): 77–90; The Igbo and their Neighbours, 41–42, Chapter 4; The Age of Innocence, 17–18; “Precolonial Trade Links between Southeastern Nigeria and the Benue Valley,” Journal of African Studies4, no. 2 (1977): 119–139. See also Northrup, “The Growth of Trade among the Igbo” E. J. Alagoa, “Long-Distance Trade and States in the Niger Delta,” Journal of African History2, no. 3 (1970): 319–329.\n\nAfigbo, The Igbo and Their Neighbours, 42–43.\n\nAfigbo, The Age of Innocence, 16.\n\nAfigbo criticized many European and foreign observers and writers, especially David Northrup for his book titled Trade Without Rulers: Pre-Colonial Economic Development in South-Eastern Nigeria(Oxford: Clarendon Press, 1978), for assuming that the region of southeastern Nigeria prior to European colonial domination lacked rulers and therefore authority figures that were capable of enforcing laws that would guarantee the protection and safety of traders. This prejudicial characterization of the region and the period suggests a lawless and unstable atmosphere incapable of fostering any meaningful commercial and intergroup exchanges. Yet, historical accounts have shown that the Aro, Awka, Abiriba, Nkwerre, Aboh, Nike, Nri, Igala, Ijo, Bonny, Nembe, Brass and the Efik triumphed in their business careers before the 1900.\n\nFor the practice of Igbandu, see Felicia Ekejiuba, “Igba Ndu: An Igbo Mechanism of Social Control and Adjustment,” African Notes8, no. 1 (1972): 9–24.\n\nSee Richard Henderson, The King in Every Man: Evolutionary Trends in Onitsha Ibo Society and Culture(New Haven, CT: Yale University Press, 1972); Austin Shelton, The Igbo-Igala Borderland: Religion and Social Control in Indigenous African Colonialism(Albany, NY: State University of New York Press, 1971); and John Boston, “Notes on Contact between the Igala and the Ibo,” Journal of the Historical Society of Nigeria2, no. 1 (1960): 52–58 on the impact of Igala culture on Nsukka Igbo; Basden, Niger Ibos on the Ijo and the conquest of southern Igbo; Mervin D. W. Jeffreys, “The Umundri Tradition of Origin,” African Studies15, no. 3 (1956): 119–131 on Igala impact on the rise of the Nri; Charles K. Meek, Ethnographical Report on the Peoples of Nsukka Division of Onitsha Province(Lagos, Nigeria: Government Printer, 1930) on Igala conquests and the evolution of Nsukka society; Talbot, The Peoples of Southern Nigeriaon the Edo and the evolution of West Niger Igbo.\n\nA. E. Afigbo, “The Beni ‘Mirage’ and the History of South Central Nigeria,” Nigeria Magazine 137 (1981): 17–24.\n\nAfigbo, The Igbo and their Neighbours, ix.\n\nFor Ibadan School of History, see A. O. Adeoye, “Understanding the Crisis in Modern Nigerian Historiography,” History in Africa 19 (1992): 1–11; P. Lovejoy, “Nigeria: The Ibadan School and Its Critics,” in B. Jewsiewicki and D. Newbury, eds., African Historiographies: What History for Which Africa?(Beverly Hills, CA: Sage Publications, 1986), 197–205.\n\nA. E. Afigbo, “The Anthropology and Historiography of Central-South Nigeria before and since Igbo-Ukwu,” History in Africa 23 (1996): 9. On the issue of Nigerian historiography, see also A. E. Afigbo, “Southeastern Nigeria, the Niger-Benue Confluence, and the Benue in the Precolonial Period: Some Issues of Historiography,” History in Africa 24 (1997): 1–8.\n\nA. E. Afigbo, “Fact and Myth in Nigerian Historiography,” Nigeria Magazine 122–123 (1977): 82.\n\nFor discussion of the criticisms of African nationalist historiography, see Adeoye, “Understanding the Crisis in Modern Nigerian Historiography”; Hannington Ochwada, “Historians, Nationalism and Pan-Africanism: Myths and Realities,” in Thandika Mkandawire, ed., African Intellectuals(Dakar, Senegal: CODESRIA Books, 2005), 193–208.\n\nA. E. Afigbo, “The Amalgamation: Myths, Howlers and Heresies,” in T. Falola, ed., Nigerian History, Politics and Affairs: The Collected Essays of Adiele Afigbo(Trenton, NJ: Africa World Press, 2005), 244.\n\nA. E. Afigbo, “History, Archaeology and Schools in Nigeria,” West African Journal of Education20, no. 3 (1976): 407–415; “Reflections on the History Syllabus in Nigerian Universities,” Journal of the Historical Society of Nigeria8, no. 1 (1975): 9–17; “Some Thoughts on the Teaching of History in Nigeria,” Ikenga 2, no. 2 (1973): 1–13.\n\nIt is difficult to authenticate Afigbo’s claim since this paper was not published until 1992, and especially, since there are historical works on Nigerian women published in the 1970s and 1980s. See, for instance, Bolanle Awe, “The Iyalode in the Traditional Yoruba Political System,” in Alice Schlegel, ed., Sexual Stratification: A Cross-Cultural View(New York: Columbia University Press, 1977), 144–160; Nina Mba, Nigerian Women Mobilized: Women’s Political Activity in Southern Nigeria, 1900–1965(Berkeley, CA: University of California Press, 1982).\n\nAuthor’s telephone interviews with Professor Afigbo, June 7, 2006. See for instance, Adiele Afigbo, “Women in Nigerian History,” The Proceedings of the Awareness Forum Seminar, Occasional Publication of the Division of Extra-mural Studies, University of Nigeria, Nsukka, 1974, 62–79; “Women in Nigerian History,” in Martin O. Ijere, ed., Women in Nigerian Economy (Enugu, Nigeria: ACENA Publishers, 1991), 22–39; “Women as a Factor in Development,” in Ijere, ed., Women in Nigerian Economy, 41–53; “Igbo Women, Colonialism and Socio-Economic Change,” in Otagburuagu and Afigbo, eds., New Brides, More Hopes, 1–14.\n\nAfigbo, “Women in Nigerian History,” 23.\n\nIsabel Kamene Okonjo, “The Role of Women in Social Change among the Igbo of Southeastern Nigeria Living West of the River Niger” (Ph.D. dissertation in Sociology, Individual and Family Studies, Boston University, 1976); “The Dual-Sex Political System in Operation: Igbo Women and Community Politics in Midwestern Nigeria,” in Nancy Hafkin and Ednah G. Bay, eds., Women in Africa: Studies in Social and Economic Change(Stanford, CA: Stanford University Press, 1976), 47–51.\n\nA. E. Afigbo, The Poverty of African Historiography(Lagos, Nigeria: Afrografika Publishers, 1977), 3 and 11.\n\nFalola and Paddock, eds., Emergent Themes and Methods."}, {"url": "https://www.liquisearch.com/adiele_afigbo", "page_content": "Adiele Afigbo\n\nAdiele Eberechukwu Afigbo (22 November 1937 – 9 March 2009) was a Nigerian historian known for the history and historiography of Africa, more particularly Igbo history and the history of Southeastern Nigeria. Themes emphasized include pre-colonial and colonial history, inter-group relations, the Aro and the slave trade, the art and science of history in Africa, and nation-building.\n\nAfigbo took up his career as a historian in the 1950s with the celebrated Ibadan School of History, which for about three decades was the most prominent school of history in Africa. He become a prominent member of that school, which devoted its time to demonstrating the need for African history and historiography as specific genres of the world history. In pursuing the mission of this school through teaching and scholarly work, Afigbo produced works that established reconstructionist history, of African historical methodologies, and links between history and statecraft. He gave rein to eclecticism of sources and methods, using as the occasion demands and warrants elements from myth, oral sources, from archaeology, linguistics, material artifacts and written sources. In the last analysis he defined a historian as a clinical student of human experience who seeks to tell the story as it is and to explain it."}, {"url": "https://www.liquisearch.com/adiele_afigbo/early_life_and_education", "page_content": "“The shift from the perception of the child as innocent to the perception of the child as competent has greatly increased the demands on contemporary children for maturity, for participating in competitive sports, for early academic achievement, and for protecting themselves against adults who might do them harm. While children might be able to cope with any one of those demands taken singly, taken together they often exceed children\u0092s adaptive capacity.”\n\n—David Elkind (20th century)\n\n“I have lifted the veil. I have created life, wrested the secret of life from life. Now do you understand? From the lives of those who have gone before, I have created life.”\n\n—Edward T. Lowe, and Frank Strayer. Dr. von Niemann (Lionel Atwill)\n\n“It is not every man who can be a Christian, even in a very moderate sense, whatever education you give him. It is a matter of constitution and temperament, after all. He may have to be born again many times. I have known many a man who pretended to be a Christian, in whom it was ridiculous, for he had no genius for it. It is not every man who can be a free man, even.”\n\n—Henry David Thoreau (1817\u00961862)"}, {"url": "https://wiki2.org/en/Adiele_Afigbo", "page_content": "Nigerian historian (1937-2009)\n\nAdiele Eberechukwu Afigbo (22 November 1937 – 9 March 2009) was a Nigerian historian known for the history and historiography of Africa, more particularly Igbo history and the history of Southeastern Nigeria. Themes emphasised include pre-colonial and colonial history, inter-group relations, the Aro and the slave trade, the art and science of history in Africa, and nation-building.\n\nAfigbo took up his career as a historian in the 1950s with the celebrated Ibadan School of History, which for about three decades was the most prominent school of history in Africa. He became a prominent member of that school, which devoted its time to demonstrating the need for African history and historiography as specific genres of the world history. In pursuing the mission of this school through teaching and scholarly work, Afigbo produced works that established reconstructionist history, of African historical methodologies, and links between history and statecraft. He gave rein to eclecticism of sources and methods, using as the occasion demands and warrants elements from myth, oral sources, from archaeology, linguistics, material artefacts and written sources. In the last analysis he defined a historian as a clinical student of human experience who seeks to tell the story as it is and to explain it.[citation needed]\n\nYouTube Encyclopedic\n\n1 / 3 Views: 454 2 357 1 336\n\nIbo Gender Roles: School Project\n\nOne Tribe, One Style: A Text With an Agenda\n\nUniversity of Ibadan Transcription\n\nEarly life and education\n\nAfigbo was born at Ihube, Okigwe, in present-day Imo State. His formal education began in 1944 at Methodist Central School, Ihube where he came under the influence of remarkably dedicated teachers, the most outstanding of whom was Mr. Oji Iheukumere, the head teacher, a native of Uzuakoli, in today's Abia State who was a noted church musician and disciplinarian. At Ihube Central School Afigbo's brilliance manifested early which made his teachers encourage him to go to secondary school in spite of the opposition of his parents who were intimidated by the cost of post-primary education. He succeeded in his bid and went to St. Augustine's (CMS) Grammar School, Nkwerre Orlu in Imo State.[citation needed] with an Okigwe Native Administration scholarship won in a competitive examination. There again he came across a crop of teachers who left a definite imprint on him. Foremost among those were Mazi F. C. Ogbalu, a teacher of Igbo language and culture and the founder of the Society for Promoting Igbo Language and Culture, C.G.I. Eneli a history graduate of the University College, Ibadan and E. C. Ezekwesili, the principal of the college and a history graduate of the University of Southampton, UK. These three helped to determine his future academic career. From St. Augustine's Grammar School Afigbo gained admission to study history at University College, Ibadan (then affiliated with University of London), with a scholarship from the government of Eastern Nigeria. There again, he met scholars noted for their brilliance and beneficent influence – J.D. Omer-Cooper, J.C. Anene, J.F. Ade Ajayi and Kenneth Onwuka Dike. There were also his colleagues – Obaro Ikime and Philip Igbafe who not only read history with him, but with him went on to pioneer the \"made in Nigeria PhD\" at the infant University of Ibadan with the help of post-graduate scholarships awarded by the university to the best graduating students.[citation needed] Adiele Afigbo had not only graduated top of his class, but also was the first among his colleagues to complete his PhD With this, he became the first person ever to receive a doctoral degree from a Nigerian university.[1]\n\nEarly career\n\nOn obtaining the PhD, Afigbo was appointed a lecturer in history, a position he held for two years before fleeing to the University of Nigeria, Nsukka in the wake of the Nigerian civil war. During the duration of hostilities, he served in the Directorate for Propaganda of the Ministry of Information, Republic of Biafra. He resumed his interrupted academic duties after the war, and rose on the academic ladder – from Lecturer to Professor in 1972, thus reaching the top of his profession after only five years. A year after attaining to professorship, he was appointed the Head of the Department of History and Archaeology. The year after, he became also the Dean of the Faculty of Arts. On more than one occasion he held the Directorship of the Leo Hansbury Institute of African Studies. He held the following public appointments among others – pioneer Director of Research at the National Institute for policy and Strategic Studies, Kuru, Jos; Commissioner first for Education and then for Local Government in the Government of Imo State; Chairman of the Michael Okpara College of Agriculture, Umuagwo in Imo State and Sole Administrator of the Alvan Ikoku College of Education, Owerri.[citation needed] He has also was awarded an Honorary Member of the Historical Association of Great Britain, Fellow of the Historical Society of Nigeria, the Nigerian National Order of Merit, the Fellowship of the Nigerian Academy of Letters. His traditional chieftaincy titles include Ogbute-Okewe-Ibe, Ogbuzuo, and Olaudah.\n\nWork as historian\n\nAfigbo was a historian of Africa, of Nigeria, of Southeastern Nigeria, and finally a historian of the Igbo. He was a political historian, an economic and social historian, and of historiography. Myth, History and Society, one of the three volumes of his essays edited by Toyin Falola is devoted to theorising on the methods of doing history in Africa, on the sources of history in Africa, on the place and purpose of history in Africa and other related issues. In many publications he sought to use the particular to illuminate the universal, and the universal to illuminate the particular. Thus, for instance, he used a detailed study of the textile process in Southern Nigeria to throw much helpful light on the socio-cultural dynamics of the societies of the region. In a similar manner he used the rise and expansion of the pre-colonial great states such as Benin to show that the so-called segmentary societies as well as the so-called mini-states of pre-colonial Africa are, among other things, fossilised reminders of the conditions from which the great states arose.[citation needed]\n\nAfigbo broke away from the action-reaction thesis that ruled the new African historiography when he joined the history profession. He did so by emphasising in his works basic reconstructionist history, the study of peoples and cultures in their own right.\n\nDeath\n\nAdiele Eberechukwu Afigbo died in Enugu, Nigeria in the early hours of Monday, 9 March 2009 after a brief illness.[2]\n\nWorks\n\nThe Warrant Chiefs: Indirect Rule in Southeastern Nigeria 1891–1929 (Longman, London, 1972)\n\n1891–1929 (Longman, London, 1972) Ropes of Sand: Studies in Igbo History and Culture (University Press Limited, Ibadan 1981)\n\n(University Press Limited, Ibadan 1981) The Igbo and Their Neighbours: Inter-group Relations In Southeastern Nigeria to 1953 (University Press Limited, Ibadan, 1987)\n\n(University Press Limited, Ibadan, 1987) Groundwork of Igbo History (Vista Books Limited, Lagos, 1992)\n\n(Vista Books Limited, Lagos, 1992) Image of the Igbo (Vista Books Limited, Lagos, 1992)\n\n(Vista Books Limited, Lagos, 1992) The Abolition of the Slave Trade in Southeastern Nigeria 1885–1950 (University of Rochester Press, 2006)\n\nCollected Works Edited by Toyin Falola\n\nNigerian History Politics and Affairs (Africa World Press, Trenton New Jersey, 2005)\n\n(Africa World Press, Trenton New Jersey, 2005) Igbo History and Society (Africa World Press, Trenton New Jersey, 2005)\n\n(Africa World Press, Trenton New Jersey, 2005) Myth, History and Society (Africa World Press, Trenton New Jersey, 2006)\n\nReferences\n\nBibliography\n\nOttenberg, S., Farmers and Townspeople in A Changing Nigeria (Spectrum Books Ltd, Ibadan, 2005) pp. 32–33, 50, 54, 84,101\n\nNorthrup, D. Trade Without Rulers (Clarendon Press, Oxford, 1978) pp. 34–37\n\nIsichei, E. A History of the Igbo People (Macmillan Press, London 1976), pp 30, 66, 67, 123, 145, 153, 254.\n\nManfredi, V., \"Philological Perspectives on the Southeastern Nigeria Diaspora\" in Contours: A Journal of the African Diaspora, Fall 2004 vol. 2 no. 2\n\nNorthrup, D. Trade Without Rulers (Clarendon Press, Oxford, 1978) pp. 34–37 Isichei, E. A History of the Igbo People (Macmillan Press, London 1976), pp 30, 66, 67, 123, 145, 153, 254. Manfredi, V., \"Philological Perspectives on the Southeastern Nigeria Diaspora\" in Contours: A Journal of the African Diaspora, Fall 2004 vol. 2 no. 2 Falola, T. and Heaton, M. “Afigbo’s Scholarship: An Introduction” in Myth, History and Society: The Collected Works of Adiele Afigbo edited by Toyin Falola (Africa World Press, Trenton, NJ, 2006) pp. 3–19.\n\nKorieh, C.J.,”Historians, Historiography and Historical Interpretations” in Falola T, (ed.) Myth, History and Society: The Collected Works of Adiele Afigbo, pp. 21–28\n\nOyebade, A. “Africanizing Knowledge: The Burden of Academic Historiography” in Falola, T., Myth, History and Society: The Collected Works of Adiele Afigbo, pp. 29–34\n\nKorieh, C.J.,”Historians, Historiography and Historical Interpretations” in Falola T, (ed.) Myth, History and Society: The Collected Works of Adiele Afigbo, pp. 21–28 Oyebade, A. “Africanizing Knowledge: The Burden of Academic Historiography” in Falola, T., Myth, History and Society: The Collected Works of Adiele Afigbo, pp. 29–34 Olukoju, A. “(Re)Reading Afigbo’s Work On Nigeria” in Nigerian History, Politics and Affairs The Collected Essays of Adiele Afigbo edited by Toyin Falola (Africa World Press, Trenton, NJ, 2005) pp. 15–30\n\nAgbali, A.A., “A Reflection on Afigbo,s Writings on Nigeria” in Falola, T. (ed.) Nigerian History, Politics and Affairs pp. 31–50\n\nNwaubani, E., “Afigbo’s Views on Nigeria” in Falola, T. (ed) Nigerian History Politics and Affairs pp. 51–62\n\nAgbali, A.A., “A Reflection on Afigbo,s Writings on Nigeria” in Falola, T. (ed.) Nigerian History, Politics and Affairs pp. 31–50 Nwaubani, E., “Afigbo’s Views on Nigeria” in Falola, T. (ed) Nigerian History Politics and Affairs pp. 51–62 Kalu, O. “Cameos Of The Igbo Past” in Igbo History and Society: The Essays of Adiele Afigbo edited by Falola, T., (Africa World Press, Trenton, New Jersey, 2005) pp. 17–30.\n\nNjoku, O., “A Synoptic Overview”: in Falola, T. (ed.) Igbo History and Society pp. 31–42\n\nNjoku, R.C. “Adiele Afigbo:Imperial History and the Challenges of Igbo Historical Studies” in Falola, T., (ed.) Igbo History and Society pp43–57\n\nNjoku, O., “A Synoptic Overview”: in Falola, T. (ed.) Igbo History and Society pp. 31–42 Njoku, R.C. “Adiele Afigbo:Imperial History and the Challenges of Igbo Historical Studies” in Falola, T., (ed.) Igbo History and Society pp43–57 Falola, T., and Heatom, M.,”The Works of A.E. Afigbo on Nigeria: An Historiographical Essay” in History in Africa 33 (2006) pp155–178\n\nAlagoa, E.J, The Uses of Hindsight as Foresight: Reflections on Niger Delta and Nigerian History (Onyoma ResearchPublications, Port Harcourt 2004) p. 138 ff.\n\nAlagoa, E.J, The Uses of Hindsight as Foresight: Reflections on Niger Delta and Nigerian History (Onyoma ResearchPublications, Port Harcourt 2004) p. 138 ff. Falola, T."}, {"url": "https://scholarworks.umb.edu/africana_faculty_pubs/24/", "page_content": "To view the content in your browser, please download Adobe Reader or, alternately,\n\nyou may Download the file to your hard drive.\n\nNOTE: The latest versions of Adobe Reader do not support viewing PDF files within Firefox on Mac OS and if you are using a modern (Intel) Mac, there is no official plugin for viewing PDF files within the browser window."}, {"url": "https://www.worldcat.org/title/Igbo-history-and-society-:-the-essays-of-Adiele-Afigbo/oclc/62233575", "page_content": "MAP OF IGBOLAND xi\n\nPART A: COMMENTARIES\n\nINTRODUCTION: AFIGBO ON THE IGBO 1 (16)\n\nToyin Falola and Matthew Heaton\n\nCAMEOS OF THE IGBO PAST 17 (14)\n\nOgbu Kalu\n\nA SYNOPTIC OVERVIEW 31 (12)\n\nOnwuk Njoku\n\nADIELE E. AFIGBO: IMPERIAL HISTORY AND THE CHALLENGES OF IGBO HISTORICAL STUDIES 43 (14)\n\nRaphael Chijioke Njoku\n\nPART B: THE ESSAYS\n\nCHAPTER 1 TOWARDS A HISTORY OF THE IGBO-SPEAKING PEOPLES OF NIGERIA 57 (14)\n\nCHAPTER 2 PROLEGOMENA TO THE STUDY OF THE CULTURE HISTORY OF THE IGBO-SPEAKING PEOPLES 71 (20)\n\nCHAPTER 3 OUR ESSENTIAL HISTORY AND US 91 (16)\n\nCHAPTER 4 AN OUTLINE OF IGBO HISTORY 107 (18)\n\nCHAPTER 5 TRADITIONS OF IGBO ORIGINS: A COMMENT 125 (12)\n\nCHAPTER 6 IGBO GENESIS 137 (18)\n\nCHAPTER 7 THE INDIGENOUS POLITICAL SYSTEMS OF THE IGBO 155 (12)\n\nCHAPTER 8 IGBO LAND BEFORE 1800 167 (18)\n\nCHAPTER 9 IGBO EXPERIENCE: A PROLEGOMENON 185 (24)\n\nCHAPTER 10 IGBO POLITICAL LEADERSHIP: PAST, PRESENT AND FUTURE 209 (14)\n\nCHAPTER 11 A HISTORY OF IGBO TRADITIONAL TEXTILE INDUSTRY 223 (36)\n\nCHAPTER 12 SOME ASPECTS OF THE HISTORY OF OZO AMONG THE IGBO OF NIGERIA 259 (16)\n\nCHAPTER 13 THE AGE OF INNOCENCE: THE IGBO AND THEIR NEIGHBOURS IN PRE-COLONIAL TIMES 275 (22)\n\nCHAPTER 14 RELIGION AND ECONOMIC ENTERPRISE IN TRADITIONAL IGBO SOCIETY 297 (10)\n\nCHAPTER 15 TOWARDS A STUDY OF WEAPONRY IN PRE-COLONIAL IGBOLAND 307 (14)\n\nCHAPTER 16 THE ARO EXPEDITION OF 1901-1902 321 (20)\n\nAn episode in the British Occupation of Iboland\n\nCHAPTER 17 PATTERNS OF IGBO RESISTANCE TO BRITISH CONQUEST 341 (10)\n\nCHAPTER 18 THE CALABAR MISSION AND THE ARO EXPEDITION OF 1901-1902 351 (12)\n\nCHAPTER 19 THE IGBO UNDER BRITISH RULE: ASPECTS OF THE HUMAN DIMENSION 363 (10)\n\nCHAPTER 20 THE PANGS OF SOCIAL ADJUSTMENT: EMANCIPATION AMONG THE NKANU IGBO, 1907-1924 373 (16)\n\nCHAPTER 21 CHIEF IGWEGBE ODUM: THE OMENUKO OF HISTORY 389 (14)\n\nCHAPTER 22 SOME ASPECTS OF RURAL DEVELOPMENT IN IGBOLAND 403 (10)\n\nCHAPTER 23 TIME AND ITS MEASUREMENT IN IGBO CULTURE 413 (12)\n\nCHAPTER 24 THE IDEA OF IGBO NATIONALITY AND ITS ENEMIES 425 (22)\n\nCHAPTER 25 IKENGA: THE STATE OF OUR KNOWLEDGE 447 (12)\n\nCHAPTER 26 THE DIALOGUE OF CIVILIZATIONS: ASPECTS OF IGBO WISDOM KNOWLEDGE 459 (10)\n\nCHAPTER 27 IGBO INTEREST IN NIGERIA: THE PRELUDE 469 (8)\n\nCHAPTER 28 IGBO ENWE EZE: BEYOND ONWUMECHILI AND ONWUEJEOGWU 477 (18)\n\nCHAPTER 29 OBI IKENGA: THE CASE FORA PAN-IGBO CENTRE FOR IGBO STUDIES 495 (28)\n\nCHAPTER 30 IGBO YOUTH AND THE CHALLENGE OF LEADERSHIP 523 (10)\n\nCHAPTER 31 TRADE AND TRADE ROUTES IN NINETEENTH CENTURY NSUKKA 533 (16)\n\nCHAPTER 32 RELIGION IN NSUKKA: A HISTORICAL PROLEGOMENON 549 (10)\n\nCHAPTER 33 NSUKKA ZONE: CULTURE, HISTORY AND DEVELOPMENT 559 (10)\n\nCHAPTER 34 DEVELOPMENT IN OKIGWE:AN ETHNO-HISTORICAL PERSPECTIVE 569 (8)\n\nCHAPTER 35 CULTURE AND DEVELOPMENT IN OKIGWE SENATORIAL DISTRICT: FROM \"NEED\" TO \"HOW\" 577 (8)\n\nCHAPTER 36 THE PLACE OF AMAIGBO IN IGBO TRADITIONS OF ORIGIN AND MIGRATION 585 (6)\n\nCHAPTER 37 THE ANGLICAN DIOCESE OF OWERRI: THE CONTEXT OF THE EARLY YEARS AND OTHER ISSUES 591 (14)\n\nCHAPTER 38 THE IGBONESS OF ASABA OR A MATTER OF IDENTITY 605 (8)\n\nCHAPTER 39 THE NDOKI FROM EARLIEST TIMES TO 1901: AN INTRODUCTORY SURVEY 613 (8)"}, {"url": "https://scholarworks.umb.edu/africana_faculty_pubs/24/", "page_content": "To view the content in your browser, please download Adobe Reader or, alternately,\n\nyou may Download the file to your hard drive.\n\nNOTE: The latest versions of Adobe Reader do not support viewing PDF files within Firefox on Mac OS and if you are using a modern (Intel) Mac, there is no official plugin for viewing PDF files within the browser window."}, {"url": "https://english.stackexchange.com/questions/49722/did-i-get-or-take-my-degree-from-or-in-the-university-of-somewhere", "page_content": "Firstly, a master's degree is not proper and therefore does not require capitalization, but personally I've seen several highly professional institutions spell it both ways.\n\nSeeing as how all three of those sentences are grammatically sound, it's more a question of etiquette or regional custom. Like Peter Shor was saying, it's not wrong to say that you took your master's degree in somewhere but you may have to use caution repeating prepositions.\n\ne.g. I took my master's degree in astrophysics in the University of Somewhere\n\nUsing in twice is potentially awkward in situations where you may need to elaborate on your area of study.\n\nTo answer your question, all of those examples are grammatically strong and should get the message across appropriately anywhere you go.\n\nOn an editorial note, however, there are some ways to bypass this dilemma by opting for more colorful words:\n\nI (received, earned, attained) a master's degree after (studying in/at, attending, graduating from) the University of Somewhere.\n\nPlay it right and you'll sound like a Nobel Laureate, but all of your sentences will work well; none of them is really noticeably better, even on paper."}, {"url": "https://www.stjohns.edu/academics/programs/history-master-arts", "page_content": "Earn a master's degree in History at St. John's University in New York City!\n\nIn the Master of Arts (M.A.) program in History at St. John’s, you will enjoy seminar-style classes that build a broad knowledge of history’s main currents, along with the opportunity to specialize in an area of concentration. You will gain proficiency in research, written and oral communication, decision making, and critical thinking.\n\nTo fulfill requirements for the degree, you will complete a minimum of 33 credits in graduate history courses with at least 18 credits focusing in one of the following areas of concentration:\n\nUnited States History\n\nEuropean History\n\nWorld History\n\nGender History\n\nYou will also complete six credits in a minor concentration, along with HIS 401 (Modern Historical Research) and HIS 402 (Historiography).\n\nDepartment Faculty\n\nPlease see a list of our History faculty.\n\nDepartment Contact\n\nPhilip Misevich, Ph.D.\n\nAssociate Professor and Graduate Coordinator\n\n718-990-5238\n\n[email protected]"}]}