{"During Brian Petrovek's tenure, the Pirates won the AHL's Calder Cup championship in 2014.": [{"url": "https://ahlhalloffame.com/calder-cup", "page_content": "The coveted Calder Cup has been a motivational force for American Hockey League teams throughout the League’s 86-year history. It is one of our sport’s greatest challenges and ultimate honors to hoist the Calder Cup in victory.\n\nThe trophy is named for Frank Calder, who served as the National Hockey League’s first President from 1917 to 1943. During the 1920’s, Mr. Calder was instrumental in guiding hockey into the mainstream of America’s major cities including Boston, New York, Detroit and Chicago, while helping in the formation of the American League.\n\nThe Calder Cup trophy itself was actually first awarded in 1938 to the Providence Reds for winning the second International-American Hockey League championship. (In 1996, George Parsons of the Syracuse Stars was presented the Calder Cup in a ceremony at the Onondaga County War Memorial, as it is believed the Stars never received a trophy for their 1937 championship.)\n\nIn 2001, the trophy’s base was changed to include two tiers of plaques, which feature the rosters of each of the last 20 Calder Cup champions; the plaques from all previous champions are on display in the Hockey Hall of Fame in Toronto. The entire Calder Cup trophy now stands 24 inches tall and weighs 25 pounds. The bowl, made of sterling silver, is 12 inches high and eight inches in diameter. The hardwood base is made of Brazilian mahogany.\n\nA total of 33 different cities have had their AHL member club win the Calder Cup, led by Hershey with 11 and Cleveland with 10. Springfield (seven), Rochester (six), Providence (five), Chicago (three) and Grand Rapids (two) are the other active cities with more than one title.\n\nTwenty-nine members of the Hockey Hall of Fame have won the Calder Cup in their careers, including Johnny Bower, Terry Sawchuk, Emile Francis, Gerry Cheevers, Al Arbour, Andy Bathgate, Larry Robinson, Doug Harvey, Patrick Roy and Fred Shero.\n\nNot only have great players won the Calder Cup, but outstanding coaches have also hoisted the AHL’s championship trophy. Hall of Famer Fred “Bun” Cook holds the distinction of winning seven Calder Cups in his career; no other AHL head coach has ever won more than three. Current NHL head coaches with Calder Cup titles on their resumes include Barry Trotz (Portland, 1994), John Tortorella (Rochester, 1996), Peter Laviolette (Providence, 1999), Todd McLellan (Houston, 2003), Bruce Boudreau (Hershey, 2006), Jon Cooper (Norfolk, 2012), Jared Bednar (Lake Erie, 2016) and Sheldon Keefe (Toronto, 2018).\n\nMore than 100 players and coaches have won both the Calder Cup and Stanley Cup in their careers, including Ace Bailey, Brian Engblom, Dick Gamble, Butch Goring, Adam Graves, Peter Mahovlich, Kirk Maltby, Ab McDonald, Patrick Sharp, Fred Shero, Brian Skrudland, Jeff Carter, Braden Holtby, John Carlson, and 2021 Stanley Cup winners Tyler Johnson, Alex Killorn and Ondrej Palat.\n\nTwo-time Calder Cup champion Darren Haydar is the AHL’s all-time leader in playoff goals (63) and points (143), and three-time winner Bryan Helmer has played in more Calder Cup Playoff games (159) than anyone else. Marcel Paille’s 49 playoff victories are the most ever by a goaltender, and Bill McDougall set single-season records that may never be broken when he tallied 26 goals, 26 assists and 52 points during the 1993 postseason with the Cape Breton Oilers.\n\nFour men share the honor of having won the most Calder Cups during their playing careers: Bob Solinger, Les Duff, Fred Glover and Mike Busniuk each skated to five titles.\n\nCalder Cup-winning teams have impacted significantly on the success of their NHL parent clubs. On three occasions an AHL club and its NHL affiliate won their league championships in the same year: In 1976 and 1977, the Montreal Canadiens won the Stanley Cup while their AHL affiliate, the Nova Scotia Voyageurs, won the Calder Cup, and in 1995, the Stanley Cup champion New Jersey Devils saw their AHL affiliate, the Albany River Rats, win a title as well. In 2008, the Wilkes-Barre/Scranton Penguins and their parent club in Pittsburgh both reached their respective league Finals, and in 2019, the Charlotte Checkers won the Calder Cup while the Carolina Hurricanes reached the NHL’s Eastern Conference Final.\n\nOnly one team in 86 years has been able to win the Calder Cup in three consecutive seasons: the Springfield Indians, under the leadership of AHL and Hockey Hall of Famers Eddie Shore and Jack Butterfield, skated to Calder Cup championships in 1960, 1961 and 1962."}, {"url": "https://www.amerks.com/news/detail/a-look-back-at-the-1996-calder-cup-25-years-later", "page_content": "A LOOK BACK AT THE 1996 CALDER CUP 26 YEARS LATER\n\nThe Rochester Americans are just a few weeks removed from what proved to be a historic 66th season in the American Hockey League, a year that culminated with one of the team's most impressive playoff runs in nearly two decades. So, it’s only fitting that today marks the 26th anniversary of perhaps the most historic moment in team history.\n\nThe date was June 13, 1996 and the city of Rochester was in jovial celebration of the Amerks’ sixth Calder Cup championship following their thrilling 2-1 win over the Portland Pirates in dramatic Game 7 fashion in front of a standing room only crowd at the downtown War Memorial.\n\nIt was a postseason to remember for the Amerks, who were 11-1 through the first three rounds of the playoffs, including back-to-back sweeps over the Adirondack Red Wings and Cornwall Aces before knocking off the Syracuse Crunch in five games. After overcoming a rather slow start through the first half of the 1995-96 regular season, Rochester, sparked by the dramatically improved goaltending of Steve Shields, came to form midseason and finished the campaign in third place in the American Hockey League’s Central Division. All in all, it was certainly a historic season for the Amerks and one that former captain Dane Jackson will never forget either.\n\n“Game 7…,” recalls Jackson, the Amerks captain that year who summed up the best moment of his professional career in two simple words. “Winning such a tight game and the celebration with guys you go to war with and guys that sacrifice a lot that are truly team guys.”\n\nWATCH: FIRST PERIOD OF GAME 7\n\n\n\n“I don’t know if a lot of people really remember, but we were not a very good team at Christmastime, “added Jackson, who took his rightful place in the Amerks Hall of Fame during the 2012-13 season. “We had a lot of good players, but we were one of the lowest teams in the league actually at that point. We had some tough meetings as a group and we all got together. To be a part of that team and see when guys put in that much effort and all the blood, sweat and tears and to come out with a championship is something I’ll never forget. It was a great part of my life and really built a lot of who I am today.”\n\nAfter the Amerks assembled a 2-0 series lead over the Pirates with a pair of home wins, the series shifted back to Portland, where the Pirates responded with a pair of home victories of their own to knot the best-of-seven-game series at two apiece. Rochester regained the series lead after Scott Nichol’s Game 5 overtime winner 4:13 into the extra session proved to be the breaking point, but a 5-1 Portland triumph in Game 6 would again even the series and set the stage for a Game 7, winner-takes-all showdown in Rochester.\n\nWATCH: NICHOL'S OVERTIME GAME-WINNER IN GAME 5\n\n\n\n“My favorite memory was winning the Calder Cup in ’96,” said Nichol, who now serves as assistant general manager of the Nashville Predators. “Playing in the middle of June, wearing shorts to the rink and looking up in the stands and seeing everyone dressed the same way was special. I think we were the last team to be playing in any league and we ended up winning in Game 7. For my career, you learn a lot from those Game 7’s, and you learn how to win in big games, and it carried on throughout my career.”\n\nExactly 26 years ago today, with the contest tied at 1-1 early in the third period, Amerks forward Brian Holzinger broke the deadlock as he converted on his own rebound from the left face-off dot to put the Amerks on top 2-1 in what proved to be the game-winning goal.\n\nPortland goaltender Ron Tugnutt immediately left his crease to dispute the goal with referee Blaine Angus ruling that he was interfered with on the play, but Tugnutt was quickly overruled, and as they say, the rest is history.\n\nRochester then played shutdown mode for the remaining 17:26 before a massive celebration took place on the War Memorial ice, where fans and players alike shared in the moment that is still viewed by many as one of the best in franchise history.\n\n\n\n“It’s the first time in my life I’ve ever been a champion and it’s just an unbelievable feeling,” said Dixon Ward, who scored Rochester’s first goal in the second period en route to being named the MVP in the playoffs. “It was a great game and they played so hard, but our guys were so ready to play. This is something I will remember the rest of my life.”\n\n“Getting to Game 7 was actually a blessing since our hiccup was Game 6 when we got blown out,” added Nichol. “It made us refocus, dig in and play like we have been throughout the playoffs. Game 7 was closer on the scoreboard than on the ice. We were totally in control, especially in the third period.”\n\nWATCH: SECOND PERIOD OF GAME 7\n\n\n\nWhat is even more impressive about the win was Rochester’s defense, anchored by veteran blueliners Doug Houda, Terry Hollinger and Dean Melanson, held the Pirates to just a single shot in the third period on its way to outshooting Portland 37-14 in the contest. That alone proved to be the difference maker for the Amerks, who finished the Calder Cup Finals with a 3-1 record at home and outscored the Pirates 24-22 throughout the seven-game series as Rochester captured its first Calder Cup on home ice in 31 years since the Joe Crozier-led Amerks of 1965. That Amerks lineup also boasted six future Hall of Famers in the likes of Jackson (Class of 2013), Houda (Class of 2011), Scott Metcalfe (Class of 2006), the late Craig Charron (Class of 2008) and veteran forward Dan Frawley (Class of 2003), who returned from retirement and went onto play two more years in Rochester before hanging up his skates for good following the 1997-98 season. Nichol would join the prestigious club in 2017.\n\n“I was really emotional after we won it,” said Metcalfe, the former Amerks enforcer and fan favorite after Game 7. “I’ve never won a championship before and to do it with this great bunch of guys makes it even more special. We had to battle for everything, and we had our chances, but we were able to get the job done and that just shows the character of our team. We held them to 14 shots and one in the third period. That says a lot about our team,” said Metcalfe, who ranks first in franchise history with 1,424 career penalty minutes.\n\nDespite going on to play two more seasons with the Amerks, the 1996 championship would be the last for Frawley, who was among the 11 players to appear in all 19 playoff contests that spring. But when he officially reentered retirement for good following the 1997-98 season, not even the 273 NHL games he spent with Chicago and Pittsburgh would be what he remember most about his career.\n\n“To finally win the Calder Cup on my third trip to the Finals was special along with my mother and sister being there to watch the game. Our team was certainly not expected to be there that day with the way most of our season went, but by the time spring started we were playing great hockey and it just seemed to steamroll from there. There were so many strong teams in the history of the Rochester Americans and to be a part of one that won the Calder Cup remains a highlight of my career.”\n\nWATCH: THIRD PERIOD OF GAME 7\n\n\n\nDuring the regular season, Charron, in just his first season with the Amerks, would go on to produce his most offensive season in his career, collecting a team and career-high 43 goals and 95 points in 72 games en route to earning team MVP and Scoring Champion honors. He also contributed 17 points on seven goals and 10 assists in 19 playoff appearances, finishing only second in postseason scoring to Ward, who would be later named the recipient of the Jack A. Butterfield Trophy as playoff MVP after leading the Amerks with 35 points (11+24).\n\nHeadlining the team’s rookie class was newcomer Rumun Ndur, who despite putting up just 14 points (2+12) during the regular season, quickly established himself as a dominant, stay-at-home defenseman. By season’s end, the then 20-year-old led the team with 306 penalty minutes, the most by an Amerks rookie since Rob Ray’s record-setting 446 penalty minutes during the 1988-89 campaign.\n\nNdur went onto to spend two more seasons in Rochester before beginning an NHL career that featured stints for the Buffalo Sabres, the New York Rangers at Atlanta Thrashers. The journeyman also had stops in the IHL, UHL and EIHL, but he admitted that nothing in his career would ever amount to winning the Calder Cup with the Amerks in 1996, especially in his first pro year.\n\n“I remember a lot about that day,” recalled Ndur, who has been coaching a AAA team outside of London, Ontario ever since his retirement as a player following the 2009-10 season. “Barrie Moore and I were sitting around our hotel room because our rental leases had expired and we had nowhere else to stay for the Cup run. We were talking about how we were going to be the last hockey game in North America that day since we just watched the (Colorado) Avalanche win the Stanley Cup a couple nights before. I remember having a great pre-game nap and going through the whole pre-game like it was just another game. Obviously we got the right result that night and as a first-year pro it was incredible that we were in that position. I couldn't believe how close we were as a team! One of the greatest feelings of my life was lifting Calder for a lap after the win and hearing the crowd go nuts! Pretty much everything after that was a blur.”\n\nAs one career was just beginning, another, sadly, was ending. Jody Gage, who in 11 seasons became the face of the franchise while capturing the hearts of all Rochesterians, was limited to just 16 games that season due to a knee injury that would soon be the main reason from his transition as player into the front office. Gage was forced into retirement midseason and quickly took the reigns as the team’s assistant general manager, a role that would suit him well in the years that followed.\n\n“It was a bittersweet, but an unbelievable year all the same for me,” said Gage, who also won Calder Cups with the Amerks in 1987 as well as one with the Adirondack Red Wings in 1981. “It was my final year as a player, but it allowed me to transition to the front office and have success there. The beginning of the year was tough, but winning it at the end was a great conclusion of my playing career.”\n\nDubbed “Mr. Amerk” during his 11-year career in Rochester, Gage finished as the Amerks’ all-time leader in goals, assists, points and games played. He holds the Amerks’ record for game-winning goals in one season (9, 1987-88) and goals/points by a right wing in one season (60/104, 1987-88). Gage is one of just three players to record 500 career AHL goals and 1,000 career AHL points, and his 17 AHL seasons tie him for third in league history. Some of his other AHL accolades include the 1987-88 AHL MVP award and a berth on the First Team All-Star squad. He also earned AHL First Team All-Star honors following the 1985-86 and 1990-91 seasons, a place on the AHL's All-Time Team in 1992 -- as chosen by the media -- and selection as the U.S. Team Captain for the AHL All-Star Game in 1995. Gage also holds AHL records for the two fastest short-handed goals in one game (8 seconds, 3/25/89), the most 40+ goal seasons (7), and the most playoff goals (51) in AHL history.\n\nIn 1999, he was inducted into the Amerks Hall of Fame. On March 19, 1999, Gage and Dick Gamble had their No. 9 retired, joining Norm “Red” Armstrong as the only players in team history to receive that honor.\n\nGage received one of the highest honors of his career in 2006, as he was inducted into the inaugural class of the AHL Hall of Fame. He joined legends Johnny Bower, Jack Butterfield, Fred Glover, Willie Marshall, Frank Mathers and Eddie Shore.\n\nThe celebration continued through the summer months, but nothing compared to the merriment in the days ahead as crowds gathered and lined the streets for the victory parade through downtown Rochester. The masses packed in at City Hall, where over hundreds of loyal fans witnessed then Mayor Bill Johnson present the Amerks with the key to the city and proclaim June 13 to forever be a day of remembrance and celebration in Rochester sports history.\n\n“A lot of years I put in with the Amerks,” recalled Metcalfe. “That was my third Finals and to finally win it was something that nobody could take away from a young man. Winning was everything. To finally win one was very, very big.”\n\nWATCH: RECAPPING THE 1996 CALDER CUP VICTORY\n\n\n\n“Anytime you win a championship and go through the long, grinding season it forges a bond with your teammates,” said Nichol, who took the Amerks to one more Finals appearance in 2000 before embarking on a 662-game NHL career that featured stops in Buffalo, Calgary, Chicago, Nashville, San Jose and St. Louis. “It was a tough and a bit of a roller coaster season. We didn't have a great regular season record, but we had a great mix of rookies, veterans, skill guys to role players and Torts (head coach John Tortorella) made all those players accountable. That season game me some lifelong memories and friends. I can't believe it's been 20 years!”\n\nBoxscore\n\nRochester Americans 2, Portland Pirates 1\n\nGame 7, 1996 Calder Cup Finals\n\nJune 13, 1996\n\nRochester War Memorial\n\nScoring:\n\nPortland: 1-0-0—1\n\nRochester: 0-1-1—2\n\n1st Period:\n\nPOR Goal – Norm Batherson 4:08 (Richard Zednik)\n\nPenalties – POR Andrew Brunette 7:30 (hooking), ROC Dan Frawley 7:30 (roughing), ROC Doug Houda 7:36 (hooking), POR 16:42 Stewart Malgunas (interference)\n\n\n\n2nd Period:\n\nROC Goal (PP) – Dixon Ward 11:07 (Brian Holzinger)\n\nPenalties – POR Richard Zednik 4:49 (hooking), POR Brad Layzell 10:17 (holding), POR Brad Layzell 12:23 (tripping)\n\n3rd Period:\n\nROC Goal – Brian Holzinger 2:34 (Dixon Ward, Dean Melanson)\n\n\n\nShots:\n\nPortland: 7-6-1—14\n\nRochester: 9-13-15—37\n\n\n\nGoaltending:\n\nPortland: Ron Tugnutt (L - 37 shots, 35 saves)\n\nRochester: Steve Shields (W - 14 shots, 13 saves)\n\n\n\nPower Play:\n\nPortland: 0-for-1\n\nRochester: 1-for-4\n\n\n\nAttendance: 7,502\n\nThree Stars:\n\n1. ROC – Brian Holzinger\n\n2. ROC – Dixon Ward\n\n3. POR – Ron Tugnutt\n\n\n\nOfficials:\n\nReferee – Blaine Angus\n\nLinesmen – Dan Murphy & Mike Smith\n\n\n\n1995-96 Rochester Americans: Coach John Tortorella, Curtis Brown, Craig Charron, Jason Cirone, Rob Conn, David Cooper, Scott Feasby, Dan Frawley, Terry Hollinger, Brian Holzinger, Doug Houda, Dane Jackson, Steve Junker, Sergei Klimentiev, Jamie Leach, Dean Melanson, Scott Metcalfe, Barrie Moore, Rumun Ndur, Scott Nichol, Wayne Primeau, Vaclav Varada, Dixon Ward (Playoff MVP), Bob Westerby, Shayne Wright, John Blue (G), Steve Shields (G)"}, {"url": "https://theahl.com/story-of-the-calder-cup", "page_content": "Photo: Jonathan Daniel/Getty Images\n\nThe coveted Calder Cup has been a motivational force for American Hockey League teams throughout the League’s 84-year history. It is one of our sport’s greatest challenges and ultimate honors to hoist the Calder Cup in victory.\n\nThe trophy is named for Frank Calder, who served as the National Hockey League’s first President from 1917 to 1943. During the 1920’s, Mr. Calder was instrumental in guiding hockey into the mainstream of America’s major cities including Boston, New York, Detroit and Chicago, while helping in the formation of the American League.\n\nThe Calder Cup trophy itself was actually first awarded in 1938 to the Providence Reds for winning the second International-American Hockey League championship. (In 1996, George Parsons of the Syracuse Stars was presented the Calder Cup in a ceremony at the Onondaga County War Memorial, as it is believed the Stars never received a trophy for their 1937 championship.)\n\nIn 2001, the trophy’s base was changed to include two tiers of plaques, which feature the rosters of each of the last 20 Calder Cup champions; the plaques from all previous champions are on display in the Hockey Hall of Fame in Toronto. The entire Calder Cup trophy now stands 24 inches tall and weighs 25 pounds. The bowl, made of sterling silver, is 12 inches high and eight inches in diameter. The hardwood base is made of Brazilian mahogany.\n\nA total of 33 different cities have had their AHL member club win the Calder Cup, led by Hershey with 11 and Cleveland with 10. Springfield (seven), Rochester (six), Providence (five), Chicago (two) and Grand Rapids (two) are the other active cities with more than one title.\n\nTwenty-nine members of the Hockey Hall of Fame have won the Calder Cup in their careers, including Johnny Bower, Terry Sawchuk, Emile Francis, Gerry Cheevers, Al Arbour, Andy Bathgate, Larry Robinson, Doug Harvey, Patrick Roy and Fred Shero.\n\nNot only have great players won the Calder Cup, but outstanding coaches have also hoisted the AHL’s championship trophy. Hall of Famer Fred “Bun” Cook holds the distinction of winning seven Calder Cups in his career; no other AHL head coach has ever won more than three. Current NHL head coaches with Calder Cup titles on their resumes include Barry Trotz (Portland, 1994), John Tortorella (Rochester, 1996), Peter Laviolette (Providence, 1999), Todd McLellan (Houston, 2003), Jon Cooper (Norfolk, 2012), Jeff Blashill (Grand Rapids, 2013), Jared Bednar (Lake Erie, 2016) and Sheldon Keefe (Toronto, 2018).\n\nMore than 100 players and coaches have won both the Calder Cup and Stanley Cup in their careers, including Ace Bailey, Brian Engblom, Dick Gamble, Butch Goring, Adam Graves, Peter Mahovlich, Kirk Maltby, Ab McDonald, Patrick Sharp, Fred Shero, Brian Skrudland, Jeff Carter, Braden Holtby, John Carlson, and 2020 Stanley Cup winners Tyler Johnson, Alex Killorn and Ondrej Palat.\n\nTwo-time Calder Cup champion Darren Haydar is the AHL’s all-time leader in playoff goals (63) and points (143), and three-time winner Bryan Helmer has played in more Calder Cup Playoff games (159) than anyone else. Marcel Paille’s 49 playoff victories are the most ever by a goaltender, and Bill McDougall set single-season records that may never be broken when he tallied 26 goals, 26 assists and 52 points during the 1993 postseason with the Cape Breton Oilers.\n\nFour men share the honor of having won the most Calder Cups during their playing careers: Bob Solinger, Les Duff, Fred Glover and Mike Busniuk each skated to five titles.\n\nCalder Cup-winning teams have impacted significantly on the success of their NHL parent clubs. On three occasions an AHL club and its NHL affiliate won their league championships in the same year: In 1976 and 1977, the Montreal Canadiens won the Stanley Cup while their AHL affiliate, the Nova Scotia Voyageurs, won the Calder Cup, and in 1995, the Stanley Cup champion New Jersey Devils saw their AHL affiliate, the Albany River Rats, win a title as well. In 2008, the Wilkes-Barre/Scranton Penguins and their parent club in Pittsburgh both reached their respective league Finals, and in 2019, the Charlotte Checkers won the Calder Cup while the Carolina Hurricanes reached the NHL’s Eastern Conference Final.\n\nOnly one team in 84 years has been able to win the Calder Cup in three consecutive seasons: the Springfield Indians, under the leadership of AHL and Hockey Hall of Famers Eddie Shore and Jack Butterfield, skated to Calder Cup championships in 1960, 1961 and 1962."}, {"url": "https://www.nhl.com/sabres/news/portland-pirates-become-new-ahl-affiliate-for-buffalo-sabres/c-438037", "page_content": "\n\nLink: Portland Pirates\n\nLink: Pirates E-News\n\nLink: American Hockey League\n\nVideo: Press Conference\n\n\n\n\n\n\n\n\n\n\n\n\n\n“This is an exciting day for fans of hockey throughout our state to partner with an eastern US city with one of the richest histories in professional hockey dating back to the turn of the century. From an initial meeting with Larry and Darcy last fall and our follow-up with Chief Operating Officer Dan DiPofi, we knew this would be a great fit for our fans and our business, one that we expect will bring exciting, championship caliber performances on the ice for years to come, along with a deeply rooted commitment to our community off the ice as well. Today’s announcement represents another important building block in our growth and commitment to professional hockey in Maine,” said Petrovek and Bullard in a joint statement.\n\n\n\nBefore teaming up with the Pirates, the Sabres were affiliated with the Rochester Americans for 29 seasons, the longest such partnership in professional hockey between an NHL team and its AHL affiliate. During that span, Rochester had a record of 1,137-932-238-13 in 2,320 regular season games (.593 winning percentage) and made the playoffs 24 out of the 29 seasons. The team won its Division title eight times, advanced to the Calder Cup Finals six times, winning the Calder Cup three of those years in 1983, 1987 and 1996. A number of current Sabres players, including Thomas Vanek, Derek Roy,\n\n\n\n“We are excited to begin our AHL affiliation with the Portland Pirates and the city of Portland,” said Buffalo Sabres Managing Partner Larry Quinn. “I am looking forward to working with Lyman Bullard, Brian Petrovek and Brian Williams, and the entire Pirates organization. I have been impressed with their professionalism from day one and am excited to build our new relationship both personally and professionally.”\n\n\n\n“There is a rich history of professional hockey in Portland and we hope to add to that winning tradition,” said Sabres General Manager Darcy Regier. “During our tenure with our previous AHL affiliation, our franchise model was to draft and to develop young prospects and build our success from a core group within. With our current roster of players like Jason Pominville,\n\n\n\nThe NHL officially came to Buffalo on Dec. 2, 1969, as part of a two-team expansion, when the league awarded Seymour and Northrup Knox the franchise that would soon be named “Sabres.” They chose center Gilbert Perreault as their first draft pick in 1970, after being awarded the number one selection. He, along with wingers Rene Robert and Rick Martin, became known as “The French Connection” and led the Sabres to the Stanley Cup Finals in 1975, only five seasons after the team’s inception. The team had continued success and made the playoffs for the next ten seasons, five of which where under Hall of Fame coach Scotty Bowman (‘79-‘80, ‘81-‘85). The team experienced great success again in the mid-90s, going through a number of changes in the 1996-97 season. Founder Seymour H. Knox passed away in the spring of 1996 just as the Sabres donned new uniform colors and moved from the storied Memorial Auditorium into the new HSBC Arena where they went on to capture the Northeast Division title. Lindy Ruff, a former Sabres defenseman and left wing, was named head coach at the beginning of the next season and led the team to the Eastern Conference Finals. The team’s success carried over to the 1998-1999 season when the Sabres made the Stanley Cup Finals where they lost to the Dallas Stars in six games.\n\n\n\nTom Golisano brought stability and a renewed excitement to the team when he purchased it in March, 2003. Following the NHL lockout, the Sabres returned to exceed all expectations by recording 52 wins and reaching the Eastern Conference Finals, earning Ruff a Jack Adams Trophy for Coach of the Year. The next season proved to be even better, as the Sabres won a franchise-record 53 games and earned the President’s Trophy in front of 41 sell-out crowds in the regular season. They also sold out the nine home playoff games on their way to the Conference Finals, making it the first time since 1979-80 that every game was played in front of a sold-out crowd. This success on and off the ice earned the organization a nomination for “Professional Sports Team of the Year” from the Sports Business Journal and Sports Business Daily.\n\n\n\nBuffalo becomes the third NHL affiliate in Pirates history. During its five-year affiliation with the Washington Capitals (2000-2005), the Pirates compiled a .535 regular-season winning percentage and made the playoffs three out of the five seasons. During their three-year affiliation with the Anaheim Ducks (2005-2008), the Pirates compiled a .563 regular-season winning percentage and made two Calder Cup playoff appearances, losing in Game 7 of the Eastern Conference Finals in both the 2005-06 and 2007-08 seasons. During that time, the Pirates averaged close to 5,000 fans per game and attendance grew by over 15 percent. With their NHL affiliate closer geographically, Portland hopes that its fans will invest in the success of the Sabres and the rivalry between the Boston/Providence Bruins will intensify. Pirates fans will be able to watch the Sabres play divisional opponent Boston six times during the NHL’s regular season, giving fans a closer look at their new NHL affiliate.\n\n\n\nThe new long-term agreement between the Pirates and the Buffalo Sabres guarantees professional hockey in the city of Portland through 2011. Since the Maine Mariners inaugural season in 1977, over 1,000 games have been played in front of over 3 million fans at the American Hockey League level. The AHL is the top development league for the National Hockey League and will be celebrating its 73rd season of play next season. Dating back to the days of the Maine Mariners, the American Hockey League has now played hockey in Portland for over 30 years. Only five other teams (Hershey, Rochester, Providence, Springfield and Cleveland) have had an American Hockey League franchise in their city longer than Portland. The Cumberland County Civic Center, the Pirates’ home, has hosted four Calder Cup Champions in 1978, 1979, 1984 and 1994 and the 2003 Dodge AHL All-Star Classic, one of the most successful in league history. “This is an exciting day for fans of hockey throughout our state to partner with an eastern US city with one of the richest histories in professional hockey dating back to the turn of the century. From an initial meeting with Larry and Darcy last fall and our follow-up with Chief Operating Officer Dan DiPofi, we knew this would be a great fit for our fans and our business, one that we expect will bring exciting, championship caliber performances on the ice for years to come, along with a deeply rooted commitment to our community off the ice as well. Today’s announcement represents another important building block in our growth and commitment to professional hockey in Maine,” said Petrovek and Bullard in a joint statement.Before teaming up with the Pirates, the Sabres were affiliated with the Rochester Americans for 29 seasons, the longest such partnership in professional hockey between an NHL team and its AHL affiliate. During that span, Rochester had a record of 1,137-932-238-13 in 2,320 regular season games (.593 winning percentage) and made the playoffs 24 out of the 29 seasons. The team won its Division title eight times, advanced to the Calder Cup Finals six times, winning the Calder Cup three of those years in 1983, 1987 and 1996. A number of current Sabres players, including Ryan Miller Jason Pominville , and Paul Gaustad, helped Rochester to its best season record in team history when they earned 112 points during the 2004-2005 season.“We are excited to begin our AHL affiliation with the Portland Pirates and the city of Portland,” said Buffalo Sabres Managing Partner Larry Quinn. “I am looking forward to working with Lyman Bullard, Brian Petrovek and Brian Williams, and the entire Pirates organization. I have been impressed with their professionalism from day one and am excited to build our new relationship both personally and professionally.”“There is a rich history of professional hockey in Portland and we hope to add to that winning tradition,” said Sabres General Manager Darcy Regier. “During our tenure with our previous AHL affiliation, our franchise model was to draft and to develop young prospects and build our success from a core group within. With our current roster of players like Ryan Miller Derek Roy and Thomas Vanek , we have been able to develop our system with positive results. It’s critical for the survival and success of the Buffalo Sabres franchise to continue to add quality, young players that can develop within our system and grow as professionals.”The NHL officially came to Buffalo on Dec. 2, 1969, as part of a two-team expansion, when the league awarded Seymour and Northrup Knox the franchise that would soon be named “Sabres.” They chose center Gilbert Perreault as their first draft pick in 1970, after being awarded the number one selection. He, along with wingers Rene Robert and Rick Martin, became known as “The French Connection” and led the Sabres to the Stanley Cup Finals in 1975, only five seasons after the team’s inception. The team had continued success and made the playoffs for the next ten seasons, five of which where under Hall of Fame coach Scotty Bowman (‘79-‘80, ‘81-‘85). The team experienced great success again in the mid-90s, going through a number of changes in the 1996-97 season. Founder Seymour H. Knox passed away in the spring of 1996 just as the Sabres donned new uniform colors and moved from the storied Memorial Auditorium into the new HSBC Arena where they went on to capture the Northeast Division title. Lindy Ruff, a former Sabres defenseman and left wing, was named head coach at the beginning of the next season and led the team to the Eastern Conference Finals. The team’s success carried over to the 1998-1999 season when the Sabres made the Stanley Cup Finals where they lost to the Dallas Stars in six games.Tom Golisano brought stability and a renewed excitement to the team when he purchased it in March, 2003. Following the NHL lockout, the Sabres returned to exceed all expectations by recording 52 wins and reaching the Eastern Conference Finals, earning Ruff a Jack Adams Trophy for Coach of the Year. The next season proved to be even better, as the Sabres won a franchise-record 53 games and earned the President’s Trophy in front of 41 sell-out crowds in the regular season. They also sold out the nine home playoff games on their way to the Conference Finals, making it the first time since 1979-80 that every game was played in front of a sold-out crowd. This success on and off the ice earned the organization a nomination for “Professional Sports Team of the Year” from the Sports Business Journal and Sports Business Daily.Buffalo becomes the third NHL affiliate in Pirates history. During its five-year affiliation with the Washington Capitals (2000-2005), the Pirates compiled a .535 regular-season winning percentage and made the playoffs three out of the five seasons. During their three-year affiliation with the Anaheim Ducks (2005-2008), the Pirates compiled a .563 regular-season winning percentage and made two Calder Cup playoff appearances, losing in Game 7 of the Eastern Conference Finals in both the 2005-06 and 2007-08 seasons. During that time, the Pirates averaged close to 5,000 fans per game and attendance grew by over 15 percent. With their NHL affiliate closer geographically, Portland hopes that its fans will invest in the success of the Sabres and the rivalry between the Boston/Providence Bruins will intensify. Pirates fans will be able to watch the Sabres play divisional opponent Boston six times during the NHL’s regular season, giving fans a closer look at their new NHL affiliate.The new long-term agreement between the Pirates and the Buffalo Sabres guarantees professional hockey in the city of Portland through 2011. Since the Maine Mariners inaugural season in 1977, over 1,000 games have been played in front of over 3 million fans at the American Hockey League level. The AHL is the top development league for the National Hockey League and will be celebrating its 73rd season of play next season. Dating back to the days of the Maine Mariners, the American Hockey League has now played hockey in Portland for over 30 years. Only five other teams (Hershey, Rochester, Providence, Springfield and Cleveland) have had an American Hockey League franchise in their city longer than Portland. The Cumberland County Civic Center, the Pirates’ home, has hosted four Calder Cup Champions in 1978, 1979, 1984 and 1994 and the 2003 Dodge AHL All-Star Classic, one of the most successful in league history. View More View Less × Share this!!\n\nLink: Pirates E-News\n\nLink: American Hockey League\n\nVideo: Press Conference\n\n\n\n\n\n\n\n\n\n\n\n\n\n“This is an exciting day for fans of hockey throughout our state to partner with an eastern US city with one of the richest histories in professional hockey dating back to the turn of the century. From an initial meeting with Larry and Darcy last fall and our follow-up with Chief Operating Officer Dan DiPofi, we knew this would be a great fit for our fans and our business, one that we expect will bring exciting, championship caliber performances on the ice for years to come, along with a deeply rooted commitment to our community off the ice as well. Today’s announcement represents another important building block in our growth and commitment to professional hockey in Maine,” said Petrovek and Bullard in a joint statement.\n\n\n\nBefore teaming up with the Pirates, the Sabres were affiliated with the Rochester Americans for 29 seasons, the longest such partnership in professional hockey between an NHL team and its AHL affiliate. During that span, Rochester had a record of 1,137-932-238-13 in 2,320 regular season games (.593 winning percentage) and made the playoffs 24 out of the 29 seasons. The team won its Division title eight times, advanced to the Calder Cup Finals six times, winning the Calder Cup three of those years in 1983, 1987 and 1996. A number of current Sabres players, including Thomas Vanek, Derek Roy,\n\n\n\n“We are excited to begin our AHL affiliation with the Portland Pirates and the city of Portland,” said Buffalo Sabres Managing Partner Larry Quinn. “I am looking forward to working with Lyman Bullard, Brian Petrovek and Brian Williams, and the entire Pirates organization. I have been impressed with their professionalism from day one and am excited to build our new relationship both personally and professionally.”\n\n\n\n“There is a rich history of professional hockey in Portland and we hope to add to that winning tradition,” said Sabres General Manager Darcy Regier. “During our tenure with our previous AHL affiliation, our franchise model was to draft and to develop young prospects and build our success from a core group within. With our current roster of players like Jason Pominville,\n\n\n\nThe NHL officially came to Buffalo on Dec. 2, 1969, as part of a two-team expansion, when the league awarded Seymour and Northrup Knox the franchise that would soon be named “Sabres.” They chose center Gilbert Perreault as their first draft pick in 1970, after being awarded the number one selection. He, along with wingers Rene Robert and Rick Martin, became known as “The French Connection” and led the Sabres to the Stanley Cup Finals in 1975, only five seasons after the team’s inception. The team had continued success and made the playoffs for the next ten seasons, five of which where under Hall of Fame coach Scotty Bowman (‘79-‘80, ‘81-‘85). The team experienced great success again in the mid-90s, going through a number of changes in the 1996-97 season. Founder Seymour H. Knox passed away in the spring of 1996 just as the Sabres donned new uniform colors and moved from the storied Memorial Auditorium into the new HSBC Arena where they went on to capture the Northeast Division title. Lindy Ruff, a former Sabres defenseman and left wing, was named head coach at the beginning of the next season and led the team to the Eastern Conference Finals. The team’s success carried over to the 1998-1999 season when the Sabres made the Stanley Cup Finals where they lost to the Dallas Stars in six games.\n\n\n\nTom Golisano brought stability and a renewed excitement to the team when he purchased it in March, 2003. Following the NHL lockout, the Sabres returned to exceed all expectations by recording 52 wins and reaching the Eastern Conference Finals, earning Ruff a Jack Adams Trophy for Coach of the Year. The next season proved to be even better, as the Sabres won a franchise-record 53 games and earned the President’s Trophy in front of 41 sell-out crowds in the regular season. They also sold out the nine home playoff games on their way to the Conference Finals, making it the first time since 1979-80 that every game was played in front of a sold-out crowd. This success on and off the ice earned the organization a nomination for “Professional Sports Team of the Year” from the Sports Business Journal and Sports Business Daily.\n\n\n\nBuffalo becomes the third NHL affiliate in Pirates history. During its five-year affiliation with the Washington Capitals (2000-2005), the Pirates compiled a .535 regular-season winning percentage and made the playoffs three out of the five seasons. During their three-year affiliation with the Anaheim Ducks (2005-2008), the Pirates compiled a .563 regular-season winning percentage and made two Calder Cup playoff appearances, losing in Game 7 of the Eastern Conference Finals in both the 2005-06 and 2007-08 seasons. During that time, the Pirates averaged close to 5,000 fans per game and attendance grew by over 15 percent. With their NHL affiliate closer geographically, Portland hopes that its fans will invest in the success of the Sabres and the rivalry between the Boston/Providence Bruins will intensify. Pirates fans will be able to watch the Sabres play divisional opponent Boston six times during the NHL’s regular season, giving fans a closer look at their new NHL affiliate.\n\n\n\nThe new long-term agreement between the Pirates and the Buffalo Sabres guarantees professional hockey in the city of Portland through 2011. Since the Maine Mariners inaugural season in 1977, over 1,000 games have been played in front of over 3 million fans at the American Hockey League level. The AHL is the top development league for the National Hockey League and will be celebrating its 73rd season of play next season. Dating back to the days of the Maine Mariners, the American Hockey League has now played hockey in Portland for over 30 years. Only five other teams (Hershey, Rochester, Providence, Springfield and Cleveland) have had an American Hockey League franchise in their city longer than Portland. The Cumberland County Civic Center, the Pirates’ home, has hosted four Calder Cup Champions in 1978, 1979, 1984 and 1994 and the 2003 Dodge AHL All-Star Classic, one of the most successful in league history. “This is an exciting day for fans of hockey throughout our state to partner with an eastern US city with one of the richest histories in professional hockey dating back to the turn of the century. From an initial meeting with Larry and Darcy last fall and our follow-up with Chief Operating Officer Dan DiPofi, we knew this would be a great fit for our fans and our business, one that we expect will bring exciting, championship caliber performances on the ice for years to come, along with a deeply rooted commitment to our community off the ice as well. Today’s announcement represents another important building block in our growth and commitment to professional hockey in Maine,” said Petrovek and Bullard in a joint statement.Before teaming up with the Pirates, the Sabres were affiliated with the Rochester Americans for 29 seasons, the longest such partnership in professional hockey between an NHL team and its AHL affiliate. During that span, Rochester had a record of 1,137-932-238-13 in 2,320 regular season games (.593 winning percentage) and made the playoffs 24 out of the 29 seasons. The team won its Division title eight times, advanced to the Calder Cup Finals six times, winning the Calder Cup three of those years in 1983, 1987 and 1996. A number of current Sabres players, including Ryan Miller Jason Pominville , and Paul Gaustad, helped Rochester to its best season record in team history when they earned 112 points during the 2004-2005 season.“We are excited to begin our AHL affiliation with the Portland Pirates and the city of Portland,” said Buffalo Sabres Managing Partner Larry Quinn. “I am looking forward to working with Lyman Bullard, Brian Petrovek and Brian Williams, and the entire Pirates organization. I have been impressed with their professionalism from day one and am excited to build our new relationship both personally and professionally.”“There is a rich history of professional hockey in Portland and we hope to add to that winning tradition,” said Sabres General Manager Darcy Regier. “During our tenure with our previous AHL affiliation, our franchise model was to draft and to develop young prospects and build our success from a core group within. With our current roster of players like Ryan Miller Derek Roy and Thomas Vanek , we have been able to develop our system with positive results. It’s critical for the survival and success of the Buffalo Sabres franchise to continue to add quality, young players that can develop within our system and grow as professionals.”The NHL officially came to Buffalo on Dec. 2, 1969, as part of a two-team expansion, when the league awarded Seymour and Northrup Knox the franchise that would soon be named “Sabres.” They chose center Gilbert Perreault as their first draft pick in 1970, after being awarded the number one selection. He, along with wingers Rene Robert and Rick Martin, became known as “The French Connection” and led the Sabres to the Stanley Cup Finals in 1975, only five seasons after the team’s inception. The team had continued success and made the playoffs for the next ten seasons, five of which where under Hall of Fame coach Scotty Bowman (‘79-‘80, ‘81-‘85). The team experienced great success again in the mid-90s, going through a number of changes in the 1996-97 season. Founder Seymour H. Knox passed away in the spring of 1996 just as the Sabres donned new uniform colors and moved from the storied Memorial Auditorium into the new HSBC Arena where they went on to capture the Northeast Division title. Lindy Ruff, a former Sabres defenseman and left wing, was named head coach at the beginning of the next season and led the team to the Eastern Conference Finals. The team’s success carried over to the 1998-1999 season when the Sabres made the Stanley Cup Finals where they lost to the Dallas Stars in six games.Tom Golisano brought stability and a renewed excitement to the team when he purchased it in March, 2003. Following the NHL lockout, the Sabres returned to exceed all expectations by recording 52 wins and reaching the Eastern Conference Finals, earning Ruff a Jack Adams Trophy for Coach of the Year. The next season proved to be even better, as the Sabres won a franchise-record 53 games and earned the President’s Trophy in front of 41 sell-out crowds in the regular season. They also sold out the nine home playoff games on their way to the Conference Finals, making it the first time since 1979-80 that every game was played in front of a sold-out crowd. This success on and off the ice earned the organization a nomination for “Professional Sports Team of the Year” from the Sports Business Journal and Sports Business Daily.Buffalo becomes the third NHL affiliate in Pirates history. During its five-year affiliation with the Washington Capitals (2000-2005), the Pirates compiled a .535 regular-season winning percentage and made the playoffs three out of the five seasons. During their three-year affiliation with the Anaheim Ducks (2005-2008), the Pirates compiled a .563 regular-season winning percentage and made two Calder Cup playoff appearances, losing in Game 7 of the Eastern Conference Finals in both the 2005-06 and 2007-08 seasons. During that time, the Pirates averaged close to 5,000 fans per game and attendance grew by over 15 percent. With their NHL affiliate closer geographically, Portland hopes that its fans will invest in the success of the Sabres and the rivalry between the Boston/Providence Bruins will intensify. Pirates fans will be able to watch the Sabres play divisional opponent Boston six times during the NHL’s regular season, giving fans a closer look at their new NHL affiliate.The new long-term agreement between the Pirates and the Buffalo Sabres guarantees professional hockey in the city of Portland through 2011. Since the Maine Mariners inaugural season in 1977, over 1,000 games have been played in front of over 3 million fans at the American Hockey League level. The AHL is the top development league for the National Hockey League and will be celebrating its 73rd season of play next season. Dating back to the days of the Maine Mariners, the American Hockey League has now played hockey in Portland for over 30 years. Only five other teams (Hershey, Rochester, Providence, Springfield and Cleveland) have had an American Hockey League franchise in their city longer than Portland. The Cumberland County Civic Center, the Pirates’ home, has hosted four Calder Cup Champions in 1978, 1979, 1984 and 1994 and the 2003 Dodge AHL All-Star Classic, one of the most successful in league history. View More View Less × Share this!! Link: American Hockey League\n\nVideo: Press Conference\n\n\n\n\n\n\n\n\n\n\n\n\n\n“This is an exciting day for fans of hockey throughout our state to partner with an eastern US city with one of the richest histories in professional hockey dating back to the turn of the century. From an initial meeting with Larry and Darcy last fall and our follow-up with Chief Operating Officer Dan DiPofi, we knew this would be a great fit for our fans and our business, one that we expect will bring exciting, championship caliber performances on the ice for years to come, along with a deeply rooted commitment to our community off the ice as well. Today’s announcement represents another important building block in our growth and commitment to professional hockey in Maine,” said Petrovek and Bullard in a joint statement.\n\n\n\nBefore teaming up with the Pirates, the Sabres were affiliated with the Rochester Americans for 29 seasons, the longest such partnership in professional hockey between an NHL team and its AHL affiliate. During that span, Rochester had a record of 1,137-932-238-13 in 2,320 regular season games (.593 winning percentage) and made the playoffs 24 out of the 29 seasons. The team won its Division title eight times, advanced to the Calder Cup Finals six times, winning the Calder Cup three of those years in 1983, 1987 and 1996. A number of current Sabres players, including Thomas Vanek, Derek Roy,\n\n\n\n“We are excited to begin our AHL affiliation with the Portland Pirates and the city of Portland,” said Buffalo Sabres Managing Partner Larry Quinn. “I am looking forward to working with Lyman Bullard, Brian Petrovek and Brian Williams, and the entire Pirates organization. I have been impressed with their professionalism from day one and am excited to build our new relationship both personally and professionally.”\n\n\n\n“There is a rich history of professional hockey in Portland and we hope to add to that winning tradition,” said Sabres General Manager Darcy Regier. “During our tenure with our previous AHL affiliation, our franchise model was to draft and to develop young prospects and build our success from a core group within. With our current roster of players like Jason Pominville,\n\n\n\nThe NHL officially came to Buffalo on Dec. 2, 1969, as part of a two-team expansion, when the league awarded Seymour and Northrup Knox the franchise that would soon be named “Sabres.” They chose center Gilbert Perreault as their first draft pick in 1970, after being awarded the number one selection. He, along with wingers Rene Robert and Rick Martin, became known as “The French Connection” and led the Sabres to the Stanley Cup Finals in 1975, only five seasons after the team’s inception. The team had continued success and made the playoffs for the next ten seasons, five of which where under Hall of Fame coach Scotty Bowman (‘79-‘80, ‘81-‘85). The team experienced great success again in the mid-90s, going through a number of changes in the 1996-97 season. Founder Seymour H. Knox passed away in the spring of 1996 just as the Sabres donned new uniform colors and moved from the storied Memorial Auditorium into the new HSBC Arena where they went on to capture the Northeast Division title. Lindy Ruff, a former Sabres defenseman and left wing, was named head coach at the beginning of the next season and led the team to the Eastern Conference Finals. The team’s success carried over to the 1998-1999 season when the Sabres made the Stanley Cup Finals where they lost to the Dallas Stars in six games.\n\n\n\nTom Golisano brought stability and a renewed excitement to the team when he purchased it in March, 2003. Following the NHL lockout, the Sabres returned to exceed all expectations by recording 52 wins and reaching the Eastern Conference Finals, earning Ruff a Jack Adams Trophy for Coach of the Year. The next season proved to be even better, as the Sabres won a franchise-record 53 games and earned the President’s Trophy in front of 41 sell-out crowds in the regular season. They also sold out the nine home playoff games on their way to the Conference Finals, making it the first time since 1979-80 that every game was played in front of a sold-out crowd. This success on and off the ice earned the organization a nomination for “Professional Sports Team of the Year” from the Sports Business Journal and Sports Business Daily.\n\n\n\nBuffalo becomes the third NHL affiliate in Pirates history. During its five-year affiliation with the Washington Capitals (2000-2005), the Pirates compiled a .535 regular-season winning percentage and made the playoffs three out of the five seasons. During their three-year affiliation with the Anaheim Ducks (2005-2008), the Pirates compiled a .563 regular-season winning percentage and made two Calder Cup playoff appearances, losing in Game 7 of the Eastern Conference Finals in both the 2005-06 and 2007-08 seasons. During that time, the Pirates averaged close to 5,000 fans per game and attendance grew by over 15 percent. With their NHL affiliate closer geographically, Portland hopes that its fans will invest in the success of the Sabres and the rivalry between the Boston/Providence Bruins will intensify. Pirates fans will be able to watch the Sabres play divisional opponent Boston six times during the NHL’s regular season, giving fans a closer look at their new NHL affiliate.\n\n\n\nThe new long-term agreement between the Pirates and the Buffalo Sabres guarantees professional hockey in the city of Portland through 2011. Since the Maine Mariners inaugural season in 1977, over 1,000 games have been played in front of over 3 million fans at the American Hockey League level. The AHL is the top development league for the National Hockey League and will be celebrating its 73rd season of play next season. Dating back to the days of the Maine Mariners, the American Hockey League has now played hockey in Portland for over 30 years. Only five other teams (Hershey, Rochester, Providence, Springfield and Cleveland) have had an American Hockey League franchise in their city longer than Portland. The Cumberland County Civic Center, the Pirates’ home, has hosted four Calder Cup Champions in 1978, 1979, 1984 and 1994 and the 2003 Dodge AHL All-Star Classic, one of the most successful in league history. “This is an exciting day for fans of hockey throughout our state to partner with an eastern US city with one of the richest histories in professional hockey dating back to the turn of the century. From an initial meeting with Larry and Darcy last fall and our follow-up with Chief Operating Officer Dan DiPofi, we knew this would be a great fit for our fans and our business, one that we expect will bring exciting, championship caliber performances on the ice for years to come, along with a deeply rooted commitment to our community off the ice as well. Today’s announcement represents another important building block in our growth and commitment to professional hockey in Maine,” said Petrovek and Bullard in a joint statement.Before teaming up with the Pirates, the Sabres were affiliated with the Rochester Americans for 29 seasons, the longest such partnership in professional hockey between an NHL team and its AHL affiliate. During that span, Rochester had a record of 1,137-932-238-13 in 2,320 regular season games (.593 winning percentage) and made the playoffs 24 out of the 29 seasons. The team won its Division title eight times, advanced to the Calder Cup Finals six times, winning the Calder Cup three of those years in 1983, 1987 and 1996. A number of current Sabres players, including Ryan Miller Jason Pominville , and Paul Gaustad, helped Rochester to its best season record in team history when they earned 112 points during the 2004-2005 season.“We are excited to begin our AHL affiliation with the Portland Pirates and the city of Portland,” said Buffalo Sabres Managing Partner Larry Quinn. “I am looking forward to working with Lyman Bullard, Brian Petrovek and Brian Williams, and the entire Pirates organization. I have been impressed with their professionalism from day one and am excited to build our new relationship both personally and professionally.”“There is a rich history of professional hockey in Portland and we hope to add to that winning tradition,” said Sabres General Manager Darcy Regier. “During our tenure with our previous AHL affiliation, our franchise model was to draft and to develop young prospects and build our success from a core group within. With our current roster of players like Ryan Miller Derek Roy and Thomas Vanek , we have been able to develop our system with positive results. It’s critical for the survival and success of the Buffalo Sabres franchise to continue to add quality, young players that can develop within our system and grow as professionals.”The NHL officially came to Buffalo on Dec. 2, 1969, as part of a two-team expansion, when the league awarded Seymour and Northrup Knox the franchise that would soon be named “Sabres.” They chose center Gilbert Perreault as their first draft pick in 1970, after being awarded the number one selection. He, along with wingers Rene Robert and Rick Martin, became known as “The French Connection” and led the Sabres to the Stanley Cup Finals in 1975, only five seasons after the team’s inception. The team had continued success and made the playoffs for the next ten seasons, five of which where under Hall of Fame coach Scotty Bowman (‘79-‘80, ‘81-‘85). The team experienced great success again in the mid-90s, going through a number of changes in the 1996-97 season. Founder Seymour H. Knox passed away in the spring of 1996 just as the Sabres donned new uniform colors and moved from the storied Memorial Auditorium into the new HSBC Arena where they went on to capture the Northeast Division title. Lindy Ruff, a former Sabres defenseman and left wing, was named head coach at the beginning of the next season and led the team to the Eastern Conference Finals. The team’s success carried over to the 1998-1999 season when the Sabres made the Stanley Cup Finals where they lost to the Dallas Stars in six games.Tom Golisano brought stability and a renewed excitement to the team when he purchased it in March, 2003. Following the NHL lockout, the Sabres returned to exceed all expectations by recording 52 wins and reaching the Eastern Conference Finals, earning Ruff a Jack Adams Trophy for Coach of the Year. The next season proved to be even better, as the Sabres won a franchise-record 53 games and earned the President’s Trophy in front of 41 sell-out crowds in the regular season. They also sold out the nine home playoff games on their way to the Conference Finals, making it the first time since 1979-80 that every game was played in front of a sold-out crowd. This success on and off the ice earned the organization a nomination for “Professional Sports Team of the Year” from the Sports Business Journal and Sports Business Daily.Buffalo becomes the third NHL affiliate in Pirates history. During its five-year affiliation with the Washington Capitals (2000-2005), the Pirates compiled a .535 regular-season winning percentage and made the playoffs three out of the five seasons. During their three-year affiliation with the Anaheim Ducks (2005-2008), the Pirates compiled a .563 regular-season winning percentage and made two Calder Cup playoff appearances, losing in Game 7 of the Eastern Conference Finals in both the 2005-06 and 2007-08 seasons. During that time, the Pirates averaged close to 5,000 fans per game and attendance grew by over 15 percent. With their NHL affiliate closer geographically, Portland hopes that its fans will invest in the success of the Sabres and the rivalry between the Boston/Providence Bruins will intensify. Pirates fans will be able to watch the Sabres play divisional opponent Boston six times during the NHL’s regular season, giving fans a closer look at their new NHL affiliate.The new long-term agreement between the Pirates and the Buffalo Sabres guarantees professional hockey in the city of Portland through 2011. Since the Maine Mariners inaugural season in 1977, over 1,000 games have been played in front of over 3 million fans at the American Hockey League level. The AHL is the top development league for the National Hockey League and will be celebrating its 73rd season of play next season. Dating back to the days of the Maine Mariners, the American Hockey League has now played hockey in Portland for over 30 years. Only five other teams (Hershey, Rochester, Providence, Springfield and Cleveland) have had an American Hockey League franchise in their city longer than Portland. The Cumberland County Civic Center, the Pirates’ home, has hosted four Calder Cup Champions in 1978, 1979, 1984 and 1994 and the 2003 Dodge AHL All-Star Classic, one of the most successful in league history. View More View Less × Share this!!\n\nVideo: Press Conference\n\n\n\n\n\n\n\n\n\n\n\n\n\n“This is an exciting day for fans of hockey throughout our state to partner with an eastern US city with one of the richest histories in professional hockey dating back to the turn of the century. From an initial meeting with Larry and Darcy last fall and our follow-up with Chief Operating Officer Dan DiPofi, we knew this would be a great fit for our fans and our business, one that we expect will bring exciting, championship caliber performances on the ice for years to come, along with a deeply rooted commitment to our community off the ice as well. Today’s announcement represents another important building block in our growth and commitment to professional hockey in Maine,” said Petrovek and Bullard in a joint statement.\n\n\n\nBefore teaming up with the Pirates, the Sabres were affiliated with the Rochester Americans for 29 seasons, the longest such partnership in professional hockey between an NHL team and its AHL affiliate. During that span, Rochester had a record of 1,137-932-238-13 in 2,320 regular season games (.593 winning percentage) and made the playoffs 24 out of the 29 seasons. The team won its Division title eight times, advanced to the Calder Cup Finals six times, winning the Calder Cup three of those years in 1983, 1987 and 1996. A number of current Sabres players, including Thomas Vanek, Derek Roy,\n\n\n\n“We are excited to begin our AHL affiliation with the Portland Pirates and the city of Portland,” said Buffalo Sabres Managing Partner Larry Quinn. “I am looking forward to working with Lyman Bullard, Brian Petrovek and Brian Williams, and the entire Pirates organization. I have been impressed with their professionalism from day one and am excited to build our new relationship both personally and professionally.”\n\n\n\n“There is a rich history of professional hockey in Portland and we hope to add to that winning tradition,” said Sabres General Manager Darcy Regier. “During our tenure with our previous AHL affiliation, our franchise model was to draft and to develop young prospects and build our success from a core group within. With our current roster of players like Jason Pominville,\n\n\n\nThe NHL officially came to Buffalo on Dec. 2, 1969, as part of a two-team expansion, when the league awarded Seymour and Northrup Knox the franchise that would soon be named “Sabres.” They chose center Gilbert Perreault as their first draft pick in 1970, after being awarded the number one selection. He, along with wingers Rene Robert and Rick Martin, became known as “The French Connection” and led the Sabres to the Stanley Cup Finals in 1975, only five seasons after the team’s inception. The team had continued success and made the playoffs for the next ten seasons, five of which where under Hall of Fame coach Scotty Bowman (‘79-‘80, ‘81-‘85). The team experienced great success again in the mid-90s, going through a number of changes in the 1996-97 season. Founder Seymour H. Knox passed away in the spring of 1996 just as the Sabres donned new uniform colors and moved from the storied Memorial Auditorium into the new HSBC Arena where they went on to capture the Northeast Division title. Lindy Ruff, a former Sabres defenseman and left wing, was named head coach at the beginning of the next season and led the team to the Eastern Conference Finals. The team’s success carried over to the 1998-1999 season when the Sabres made the Stanley Cup Finals where they lost to the Dallas Stars in six games.\n\n\n\nTom Golisano brought stability and a renewed excitement to the team when he purchased it in March, 2003. Following the NHL lockout, the Sabres returned to exceed all expectations by recording 52 wins and reaching the Eastern Conference Finals, earning Ruff a Jack Adams Trophy for Coach of the Year. The next season proved to be even better, as the Sabres won a franchise-record 53 games and earned the President’s Trophy in front of 41 sell-out crowds in the regular season. They also sold out the nine home playoff games on their way to the Conference Finals, making it the first time since 1979-80 that every game was played in front of a sold-out crowd. This success on and off the ice earned the organization a nomination for “Professional Sports Team of the Year” from the Sports Business Journal and Sports Business Daily.\n\n\n\nBuffalo becomes the third NHL affiliate in Pirates history. During its five-year affiliation with the Washington Capitals (2000-2005), the Pirates compiled a .535 regular-season winning percentage and made the playoffs three out of the five seasons. During their three-year affiliation with the Anaheim Ducks (2005-2008), the Pirates compiled a .563 regular-season winning percentage and made two Calder Cup playoff appearances, losing in Game 7 of the Eastern Conference Finals in both the 2005-06 and 2007-08 seasons. During that time, the Pirates averaged close to 5,000 fans per game and attendance grew by over 15 percent. With their NHL affiliate closer geographically, Portland hopes that its fans will invest in the success of the Sabres and the rivalry between the Boston/Providence Bruins will intensify. Pirates fans will be able to watch the Sabres play divisional opponent Boston six times during the NHL’s regular season, giving fans a closer look at their new NHL affiliate.\n\n\n\nThe new long-term agreement between the Pirates and the Buffalo Sabres guarantees professional hockey in the city of Portland through 2011. Since the Maine Mariners inaugural season in 1977, over 1,000 games have been played in front of over 3 million fans at the American Hockey League level. The AHL is the top development league for the National Hockey League and will be celebrating its 73rd season of play next season. Dating back to the days of the Maine Mariners, the American Hockey League has now played hockey in Portland for over 30 years. Only five other teams (Hershey, Rochester, Providence, Springfield and Cleveland) have had an American Hockey League franchise in their city longer than Portland. The Cumberland County Civic Center, the Pirates’ home, has hosted four Calder Cup Champions in 1978, 1979, 1984 and 1994 and the 2003 Dodge AHL All-Star Classic, one of the most successful in league history. “This is an exciting day for fans of hockey throughout our state to partner with an eastern US city with one of the richest histories in professional hockey dating back to the turn of the century. From an initial meeting with Larry and Darcy last fall and our follow-up with Chief Operating Officer Dan DiPofi, we knew this would be a great fit for our fans and our business, one that we expect will bring exciting, championship caliber performances on the ice for years to come, along with a deeply rooted commitment to our community off the ice as well. Today’s announcement represents another important building block in our growth and commitment to professional hockey in Maine,” said Petrovek and Bullard in a joint statement.Before teaming up with the Pirates, the Sabres were affiliated with the Rochester Americans for 29 seasons, the longest such partnership in professional hockey between an NHL team and its AHL affiliate. During that span, Rochester had a record of 1,137-932-238-13 in 2,320 regular season games (.593 winning percentage) and made the playoffs 24 out of the 29 seasons. The team won its Division title eight times, advanced to the Calder Cup Finals six times, winning the Calder Cup three of those years in 1983, 1987 and 1996. A number of current Sabres players, including Ryan Miller Jason Pominville , and Paul Gaustad, helped Rochester to its best season record in team history when they earned 112 points during the 2004-2005 season.“We are excited to begin our AHL affiliation with the Portland Pirates and the city of Portland,” said Buffalo Sabres Managing Partner Larry Quinn. “I am looking forward to working with Lyman Bullard, Brian Petrovek and Brian Williams, and the entire Pirates organization. I have been impressed with their professionalism from day one and am excited to build our new relationship both personally and professionally.”“There is a rich history of professional hockey in Portland and we hope to add to that winning tradition,” said Sabres General Manager Darcy Regier. “During our tenure with our previous AHL affiliation, our franchise model was to draft and to develop young prospects and build our success from a core group within. With our current roster of players like Ryan Miller Derek Roy and Thomas Vanek , we have been able to develop our system with positive results. It’s critical for the survival and success of the Buffalo Sabres franchise to continue to add quality, young players that can develop within our system and grow as professionals.”The NHL officially came to Buffalo on Dec. 2, 1969, as part of a two-team expansion, when the league awarded Seymour and Northrup Knox the franchise that would soon be named “Sabres.” They chose center Gilbert Perreault as their first draft pick in 1970, after being awarded the number one selection. He, along with wingers Rene Robert and Rick Martin, became known as “The French Connection” and led the Sabres to the Stanley Cup Finals in 1975, only five seasons after the team’s inception. The team had continued success and made the playoffs for the next ten seasons, five of which where under Hall of Fame coach Scotty Bowman (‘79-‘80, ‘81-‘85). The team experienced great success again in the mid-90s, going through a number of changes in the 1996-97 season. Founder Seymour H. Knox passed away in the spring of 1996 just as the Sabres donned new uniform colors and moved from the storied Memorial Auditorium into the new HSBC Arena where they went on to capture the Northeast Division title. Lindy Ruff, a former Sabres defenseman and left wing, was named head coach at the beginning of the next season and led the team to the Eastern Conference Finals. The team’s success carried over to the 1998-1999 season when the Sabres made the Stanley Cup Finals where they lost to the Dallas Stars in six games.Tom Golisano brought stability and a renewed excitement to the team when he purchased it in March, 2003. Following the NHL lockout, the Sabres returned to exceed all expectations by recording 52 wins and reaching the Eastern Conference Finals, earning Ruff a Jack Adams Trophy for Coach of the Year. The next season proved to be even better, as the Sabres won a franchise-record 53 games and earned the President’s Trophy in front of 41 sell-out crowds in the regular season. They also sold out the nine home playoff games on their way to the Conference Finals, making it the first time since 1979-80 that every game was played in front of a sold-out crowd. This success on and off the ice earned the organization a nomination for “Professional Sports Team of the Year” from the Sports Business Journal and Sports Business Daily.Buffalo becomes the third NHL affiliate in Pirates history. During its five-year affiliation with the Washington Capitals (2000-2005), the Pirates compiled a .535 regular-season winning percentage and made the playoffs three out of the five seasons. During their three-year affiliation with the Anaheim Ducks (2005-2008), the Pirates compiled a .563 regular-season winning percentage and made two Calder Cup playoff appearances, losing in Game 7 of the Eastern Conference Finals in both the 2005-06 and 2007-08 seasons. During that time, the Pirates averaged close to 5,000 fans per game and attendance grew by over 15 percent. With their NHL affiliate closer geographically, Portland hopes that its fans will invest in the success of the Sabres and the rivalry between the Boston/Providence Bruins will intensify. Pirates fans will be able to watch the Sabres play divisional opponent Boston six times during the NHL’s regular season, giving fans a closer look at their new NHL affiliate.The new long-term agreement between the Pirates and the Buffalo Sabres guarantees professional hockey in the city of Portland through 2011. Since the Maine Mariners inaugural season in 1977, over 1,000 games have been played in front of over 3 million fans at the American Hockey League level. The AHL is the top development league for the National Hockey League and will be celebrating its 73rd season of play next season. Dating back to the days of the Maine Mariners, the American Hockey League has now played hockey in Portland for over 30 years. Only five other teams (Hershey, Rochester, Providence, Springfield and Cleveland) have had an American Hockey League franchise in their city longer than Portland. The Cumberland County Civic Center, the Pirates’ home, has hosted four Calder Cup Champions in 1978, 1979, 1984 and 1994 and the 2003 Dodge AHL All-Star Classic, one of the most successful in league history. View More View Less × Share this!!\n\n"}, {"url": "https://www.pressherald.com/2014/04/28/petrovek__portland_pirates_part_ways_/", "page_content": "Brian Petrovek, chief executive officer of the Portland Pirates for nearly 14 years, has left the franchise after a tumultuous season that saw the American Hockey League affiliate temporarily move its home games from Portland to Lewiston and finish last in the league in both attendance and performance.\n\nThe Pirates announced Petrovek’s resignation Monday afternoon.\n\nAdditional Photos Departing CEO Brian Petrovek is praised for attracting the AHL all-star game to Portland and for his civic work. 2013 Press Herald File/John Ewing Related Headlines Portland Pirates general manager leaving for Calgary, source says\n\n“Where the Pirates are now, and as we set ourselves up for an exciting future, a lot of thanks have to go to Brian and all the work he did over the past 14 years,” said Brad Church, a former left winger for the Pirates who took over as chief operating officer during a management shakeup in late February.\n\nPetrovek, 59, was part of an ownership group led by Boston lawyer Lyman Bullard that purchased the Pirates in 2000. Bullard remained the majority owner until this winter, when Ron Cain increased his stake in the team and, shortly thereafter, took over CEO duties from Petrovek, who remained president of business development.\n\nChurch said he believes Petrovek retains his ownership stake. “Although I’m not an owner,” Church said, “so I don’t know for sure.”\n\nCalls to Petrovek, Cain and Bullard were not returned.\n\nAdvertisement\n\nBut in a prepared statement, Petrovek said, “My decision allows Ron to steer the ship on his own course and begin a new journey for the brand and our fans and sponsors as the team prepares for the 2014-15 season.”\n\nIn a statement, Cain thanked Petrovek for his service.\n\n“Brian is at the top of his game,” Cain said. “Our loss will be another’s gain.”\n\nCain lauded Petrovek’s success in attracting the AHL all-star game to Portland in 2003 and 2010 and his involvement in civic and charitable organizations. Petrovek has served on the boards of Maine Medical Center, the United Way of Greater Portland and Portland’s Downtown District.\n\nPetrovek was also the face and voice of the team’s difficult and extended lease negotiations with trustees of the Cumberland County Civic Center in 2003, 2010 and 2013. “We’ll give it three more years,” he said after grudgingly signing a 2003 agreement. “We will not play in the building three years from now unless it has been renovated or the economic terms are different.”\n\nIn 2010, Petrovek flirted with moving the franchise to Albany, N.Y., before agreeing to a two-year extension. After voters approved a $33 million bond in 2011 to renovate the civic center, its trustees reached an agreement with the Pirates on a one-year lease with an eye toward a longer-term deal.\n\nAdvertisement\n\nSuch a deal, which seemed to be imminent in April 2013, fell apart in August. In September, the team filed a lawsuit and then announced that its entire 38-game home schedule would be played at the Androscoggin Bank Colisee in Lewiston.\n\n“With any sports team, there’s a certain amount of friction around the guy who’s the face of the organization,” said Chris Hall, CEO of the Portland Regional Chamber of Commerce. “Certainly, the last year and a half has been difficult, but people should reflect on all the good years and the contributions. The city of Portland is well known as a great minor-league sports town. Well, one of the reasons is because of people like Brian Petrovek.”\n\nThe first few months in Lewiston included three sellouts and an average attendance of more than 2,600 fans. The Pirates won a franchise-low 10 “home” games. They ended the season with a 10-game losing streak and an average attendance of 2,185 – the only one of 30 AHL franchises below 3,000.\n\nA new five-year lease with the civic center was announced in February, after Cain became majority owner and the Pirates dropped their lawsuit against the county-owned facility.\n\n“Ron, Lyman and I started talking more definitively about the opportunity and need for change as the ink dried on a new long-term lease with the civic center and the completion of the renovation project,” Petrovek said in his statement.\n\nNeal Pratt, chairman of the civic center’s board of trustees, said he and Petrovek often disagreed, but their relations were never disagreeable.\n\nAdvertisement\n\n“Brian was always a zealous advocate for the team and a tireless promoter of the Pirates brand,” Pratt said. “He tried to do what was best for his team and his business and I respect that and wish him well.”\n\nPratt said the list of Petrovek’s charitable efforts is impressive.\n\n“He has done a lot of volunteer work for the community,” Pratt said, “and I think he should be recognized for that.”\n\nIn March 2013, Petrovek pleaded guilty to operating under the influence as part of a deal to avoid jail time after he crashed his Jeep Wrangler into the concrete barrier on Spring Street in Portland. His blood-alcohol content was measured at three times the legal limit for driving.\n\n“What his legacy will be, I don’t know,” said Church. “My hope is that people look at the big picture and recognize all the good that has come with his leadership of the organization.”\n\nIn another, unrelated change, the Pirates lost their general manager Monday when Brad Treliving, former assistant GM of their parent NHL club, the Phoenix Coyotes, was hired as GM of the NHL’s Calgary Flames.\n\nGlenn Jordan can be contacted at 791-6425 or at:\n\n[email protected]\n\nTwitter: GlennJordanPPH"}, {"url": "https://thehockeywriters.com/1999-providence-bruins-one-the-ahls-best-teams-ever/", "page_content": "Many long time Providence Bruins fans have a feeling they have not had in years. The 2012-13 American Hockey League (AHL) Playoffs start tonight, April 26th, with the team coming off of a regular season in which they were awarded the Macgregor Kilpatrick Trophy for garnering the most points in the league (50-21-5, 105 points). Consequently, they are viewed as one of the front runners for the Calder Cup this spring; all of this following the 2011-2012 season, in which they did not even make the playoffs.\n\nIf this sounds somewhat familiar, it should. The 1998-99 P-Bruins won the regular season title and ultimately the Calder Cup, following a year in which they had the worst record in the entire AHL. Although Providence has had numerous deep post season runs since 1999 and were regular season champions in 2008, no team has yet to live up to the standard and expectations left by the 1999 squad. With Calder Cup fever starting to crank up in Rhode Island and southeast Massachusetts, now is a better time than ever to reflect on that Calder Cup run.\n\nRebuilding Providence\n\nComing off of the 1997-98 season where the Providence Bruins unexpectedly stumbled to a 19-49-7 (50 pts) record, landing them in last place in the entire league, the team needed to make changes. The Bruins organization was in the middle of one of it’s worst periods in team history since the early 1960’s. Fans were restless and while Boston would continue to disappoint, some pivotal moves were made to revamp Providence for their upcoming season.\n\nOn July 9th, 1998 head coach Tom McVie, an individual with years of coaching experience in the National Hockey League (NHL), World Hockey Association, AHL, and Central Hockey League was fired. Assistant coach, Rod Langway, a long time veteran NHL defenseman, was relieved from coaching duties as well. Only six days later, former Providence Bruins defenseman, captain, and player-assistant coach, Peter Laviolette was hired as the new head coach.\n\nLaviolette, who only had year of head coaching experience at this point, albeit quite a successful one with the ECHL Wheeling Nailers, also had a reputation of being a strong leader as a player. This was exemplified by the fact that he was named team captain of the International Hockey League’s (IHL) 1988-89 Colorado Rangers, the AHL’s 1991-92 Binghamton Rangers, and the 1994 US Olympic team.\n\nThen Boston Bruins general manager Harry Sinden likely made the move to replace McVie with Laviolette, because of the energy he could bring as a young coach trying to make a name for himself on a larger stage than the ECHL. McVie moved to a scouting role in the organization, which he continues to hold to this day.\n\nRoster Overhaul\n\nSignificant changes were made to the forward lines and defensive pairings through a myriad of transactions with other teams and promotions to Boston. The only portion of the team that remained the same was the goaltending duo of starter John Grahame and back up Jim Carey, who was later traded to the St. Louis Blues organization near the end of the season.\n\nThe few skaters returning from the previous season were centermen Randy Robitaille and Joel Prpic, wingers Antti Laaksonen, Aaron Downey, and Jay Henderson. Both Robitaille and Laaksonen would play much larger roles for Providence in the upcoming season for the team. Defensemen Elias Abrahamsson and Mattias Timander were the only returning defensemen from the previous season. Timander permanently left for Boston halfway through the season and Abrahamsson played in only 4 games the playoffs.\n\nLandon Wilson and Cameron Mann, two players who are very familiar to late 90s Bruins fans, were promoted to Boston for a majority of the 1998-99 season. They returned to Providence after Boston was eliminated from the NHL playoffs, to enhance the team’s offense during the Calder Cup run.\n\nNew to the team were centers Andre Savage, fresh out of college from Michigan Tech, and Marquis Mathieu who played under tutelage of Peter Laviolette for the Wheeling Nailers in 1997-98. Winger Jeremy Brown played for the Nailers the previous season as well until being traded to Providence at the very end of the year, making him essentially a new player as well. Eric Nikalus, new from the IHL’s Orlando Solar Bears, joined the new core of forwards.\n\nWinger Peter Ferraro was traded to the Bruins organization from the Hartford Wolfpack, but he played a majority of the 98-99 season in Boston, until joining Providence for the playoff run.\n\nThe most significant alteration to Providence was their defense core, in which the top six were completely replaced with minor league and NHL veterans. Puck moving defensemen Brandon Smith of the Adirondack Red Wings, 10 year minor league veterans Terry Virtue and Steve Bancroft, and veteran New York Islanders defenseman Dennis Vaske joined the team. Jonathan Aitken, a young defenseman fresh out of Major Junior hockey joined the team as well.\n\nThe Providence Bruins Journey to the 1999 Calder Cup\n\nGame by game regular season results:\n\nA majority of their 16 regulation losses came within the first couple months of the season, which makes sense, considering the huge turnover in coaching and player personnel. Even so, as this team was developing it’s chemistry, they still achieved a 16-10-1-2 record by December 18th, 1998.\n\nIt was on December 23rd, 1998 that the team found another level of excellence where they started an impressive 32-3-2-1 run. The P-Bruins outscored opponents 156 to 93 in that span.\n\nBelow is a highlight of the Providence Bruins incredible ability to win games during that stretch, despite being down 3 goals in the third period.\n\nGame Highlights versus Hartford Wolfpack 2/28/1999:\n\nRandy Robitaille and Andre Savage led the team’s offense with (28 goals, 74 assists) and (27 goals, 42 assists) respectively. Brandon Smith (+36) and Terry Virtue (+34) led the defense with a combination of shut down play in the defensive zone and with their knack of injecting offense in to the game with fast puck transition.\n\nNear the end of the season, the Providence Bruins acquired defenseman Jason McBain from the IHL’s Las Vegas Thunder, center John Spoltore from the ECHL’s Louisiana IceGators, and signed winger Steven King. These transactions would turn out to be important acquisitions as both Spoltore and King eventually scored key goals during the playoffs.\n\nBy the end of the regular season, the Providence Bruins set an AHL record for their record of 56 wins, 16 losses, 4 ties, and 4 overtime losses. The scored 110 more goals and allowed 78 fewer goals against from the previous season.\n\n1999 Calder Cup Playoffs\n\nProvidence’s first round opponent in a best of five series was the Worcester IceCats. The Bruins won the series with relative ease winning game one 4-1 and game two 3-1 at home. Worcester fought off the sweep with a 5-3 win in game three, but Providence ultimately took the series with a 6-3 win in game four.\n\nIn the second round, the P-Bruins faced the Hartford Wolfpack. Although this series was a sweep, it did not feel like one. Game one ended 5-4 in double overtime from a Spoltore goal. He went on to score the game winner in the next two games that ended 5-3 and 5-4 in overtime. Game four was a tight checking affair that ended as a 2-1 victory.\n\nThe Providence Bruins then faced the Fredericton Canadiens in the eastern conference finals. The Bruins appeared to be well on their way to sweeping after winning the first two games 6-3, and the third game 5-3 as the away team. Fredericton proceeded to win the next two games 4-1 and 4-0 with great goaltending from Jose Theodore. Just as the series appeared to be swinging back in the Canadiens direction, Providence returned home and won 6-1.\n\nThe Calder Cup final presented the Bruins with the challenge of defeating the Rochester Americans. Providence won the first two games at home, 4-2 and 6-0. Game three went on to become a very memorable point in the series and the entire playoff run. The game went in to overtime tied 2-2 and eventually ended up reaching the third overtime:\n\nOne might say that Steven King frightened the crowd with his goal in triple overtime.\n\nRochester managed to avoid the sweep, by winning game four 4-2.\n\nGame 5 brought the series back to a sold out Providence Civic Center:\n\n(Although the video is rather unclear, it captures the energy from that night, which rivals that of an NHL rink.)\n\nThe Providence Bruins won the Calder Cup with a convincing 5-1 rout of Rochester. Randy Robitaille won the Les Cunningham Award as the most valuable player (MPV) for the overall season, Peter Ferraro won the Jack A. Butterfield Trophy as the MVP of the playoffs, and Peter Laviolette won the Louis A.R. Pieri Memorial Award, for coach of the year.\n\nThe Calder Cup Championship Banner Ceremony:\n\nDuring this memorable playoff run, many die hard Boston Bruins fans embraced this team as their #1. Some hoped it was a sign of the Bruins organization’s growing depth and as a sign of good things to come in Boston. Although this was not the case, this team was certainly a launching point for Peter Laviolette’s NHL coaching career and for numerous players who went on to take depth roles for numerous NHL teams.\n\nThis team is still fondly remembered and held in high esteem by long time Providence Bruins season ticket holders and hardcore fans. The comparisons run rampant between the sudden regular season success of the 2013 team and 1999 team. As of this writing, only the hockey gods know whether or not the 2013 Providence Bruins will follow through with a memorable second act in this year’s Calder Cup playoffs."}, {"url": "https://www.bilibili.com/read/cv7849743/", "page_content": "答案：41（A），42（F），43（G），44（C），45（F）\n\n解析：\n\n41题：题干中出现Petrarch，回原文定位：\n\n第一次出现（第三段）：In 1337, Petrarch began work on his rambling writing De Viris Illustribus–On Famous Men, highlighting the virtus (or virtue) of classical heroes. 在1337年，彼特拉克开始断断续续撰写《名人传》，在书中，他突出表现了那些名垂青史的英雄们的美德。\n\n第二次出现（第三段）：Petrarch celebrated their greatness in conquering fortune and rising to the top. 他称颂英雄们在掌控自己命运、奋斗到社会顶层的过程中所展现的伟大之处。\n\n对比所有选项，只有A选项的含义可以与之对应：突出名垂青史的英雄们的美德\n\n42题：题干中出现Niccolo Machiavelli，回原文对应\n\n第三段：This was the biographical tradition which Niccolo Machiavelli turned on its head. In The Prince, he championed cunning, ruthlessness, and boldness, rather than virtue, mercy and justice, as the skills of successful leaders. 而尼可洛•马基雅维利则彻底改变了这一传记写作的传统。在《君主论》中，他认为狡猾、残忍、富有冒险精神——而不是美德、怜悯与公平公正之心——才是一位成功领袖应有的能力\n\n对比所有选项，只有F选项的含义与之对应：认为美德并不是成功领导者的必备素质\n\n43题：题干中出现Samuel Smiles，回到原文定位\n\n第四段：By contrast, the Victorian author Samuel Smiles wrote Self-Help as a catalogue of the worthy lives of engineers, industrialists and explorers. 相反，维多利亚时期作家塞缪尔•斯迈尔斯撰写的《自助论》一书，则记录了工程师，实业家和探险家的卓越人生。\n\n对比所有选项，只有G选项含义与之对应：描述工程师，实业家和探险家的卓越人生\n\n44题：题干中出现Thomas Carlyle，回到原文定位\n\n第一次出现（第一段）：“Universal history, the history of what man has accomplished in this world, is at bottom the History of the Great Men who have worked here,” wrote the Victorian sage Thomas Carlyle. 维多利亚时期圣贤托马斯•卡莱尔写道：“世界史，即人类在世界上取得的成就，实际上是解除人士在世界上取得成就的历史”。\n\n第二次出现（第五段）：This was all a bit bourgeois for Thomas Carlyle, who focused his biographies on the truly heroic lives of Martin Luther, Oliver Cromwell and Napoleon Bonaparte. These epochal figures represented lives hard to imitate, but to be acknowledged as possessing higher authority than mere mortals. 这对于托马斯•卡莱尔而言有些保守，他的传记描写的是马丁•路德、奥利弗•克伦威尔以及拿破仑•波拿巴的英雄人生。这些划时代的人物有着不可复制的人生经历，但他们被公认拥有高于常人的权力。\n\n第三次出现（最后一段）：In place of Thomas Carlyle, Britain nurtured Christopher Hill, EP Thompson and Eric Hobsbawm. 在托马斯•卡莱尔看来，英国孕育了克里斯托弗•希尔、EP•汤普森和埃里克•霍布斯鲍姆\n\n对比所有选项，只有C选项和第二次出现时候的内容对应：集中描写划时代人物的不可复制的人生\n\n45题：题干中出现Marx and Engels，回归文章定位\n\n第六段：“The history of all hitherto existing society is the history of class struggle,” wrote Marx and Engels in The Communist Manifesto. For them, history did nothing, it possessed no immense wealth nor waged battles: “It is man, real, living man who does all that.” And history should be the story of the masses and their record of struggle. 马克思和恩格斯在《共产党宣言》中写道：“迄今为止现存所有社会的历史都是阶级斗争的历史。”他们认为，历史本身什么都没有做，它既没拥有巨大的财富，也没有发动过战争：“是人类，真实的，活生生的人类做了这一切。”历史应该是人民大众的故事，是他们的奋斗史。\n\n对比所有选项，只有F选项含义与之对应：held that history should be the story of the masses and their record of struggle. 认为历史应该是人民大众的故事和他们的奋斗史。\n\n\n\n"}, {"url": "https://www.wbspenguins.com/blog/everything-you-need-to-know-about-the-calder-cup/", "page_content": "While there’s plenty of excitement to be found at any AHL game you attend during the regular season, playoffs can be an especially exciting time for any fan, regardless of whether or not their time is in it. Playoff championships attract a huge amount of attention, and in the AHL, teams compete to win the coveted Calder Cup. The Wilkes-Barre Scranton Penguins have made it to the Calder Cup three times, with the first being in the 2000-01 season, the team’s second season.\n\nMaybe you’ve had the chance to watch us play in the Calder Cup, but some may not be that familiar with the championship game. Here’s everything you should know about the Calder Cup.\n\nHow Long Has the Calder Cup Been Around?\n\nThe Calder Cup, like the AHL, precedes the WBS Penguins by a few decades. The first winners of the Calder Cup were the Syracuse Stars in 1937 during the AHL’s first season. However, the actual Calder Cup was not presented to the winning team until the following year when the Providence Reds beat the Syracuse Stars. According to the AHL, the current Calder Cup, made of a sterling silver base and mahogany base, is 24 inches tall and weighs 25 pounds. Plaques on the base of the Calder Cup list the former 20 winners, and as new plaques are added, old ones are put on display at the Hockey Hall of Fame.\n\nThe Calder Cup has been presented every year since its first in 1937, with the exception of the 2019-20 and 2020-21 seasons due to the COVID-19 pandemic. Because of this, the Charlotte Checkers are the most recent Calder Cup champions after the 2019 win of 4-1 over the Chicago Wolves.\n\nFrank Calder\n\nThe Calder Cup was named in honor of Frank Calder, the first president of the NHL and the last president of its predecessor, the National Hockey Association (NHA). Calder maintained his position as president until he passed away in 1943. This is also not the only award to be named in Calder’s honor – the Calder Memorial Trophy has been awarded to the NHL Rookie of the Year since the 1936-37 season. He has been inducted into the Hockey Hall of Fame and Canada’s Sports Hall of Fame.\n\nCalder Cup Record Holders\n\nThere are a few teams that hold different records related to the Calder Cup. The team that has won the most Calder Cup championships are the Hershey Bears, with a total of 11 wins. The Hershey Bears have also made it to the finals more than any other team, attending 23 times. Other noteworthy teams include those who have won the Calder Cup the same year their NHL team won the Stanley Cup. This includes the Nova Scotia Voyageurs, who have won the playoffs with the NHL affiliate twice, and the Albany River Rats. In 2008, the WBS Penguins made it to the finals for the Calder Cup, while Pittsburgh Penguins fell to the Detroit Red Wings in the Stanley Cup finals.\n\nThe Jack A. Butterfield Trophy\n\nIn addition to the Calder Cup, another award related to the playoffs is also awarded. The Jack A. Butterfield Trophy is awarded to the most valuable player in the playoffs and is named after the late AHL president Jack Butterfield, who served the longest tenure of any AHL executive. In most cases, the recipient of the Jack A. Butterfield Trophy plays for the winning team, but this isn’t a requirement. So far, the only player to receive the Jack A. Butterfield Trophy is Tim Tookey, who played for the Hershey Bears during the 1985-86 season, when they lost to the Adirondack Red Wings.\n\nFollow Along with the Penguins for the Rest of the Season\n\nWhile looking forward to the playoffs can be exciting, there’s still plenty of time left in the regular season to come out and support your favorite team. Get your tickets to see the WBS Penguins play before the season is over!"}, {"url": "https://www.pressherald.com/2011/06/28/portland-pirates-timeline_2011-06-28/", "page_content": "May 22, 1992: After 15 years, the Maine Mariners leave Portland to become the Providence Bruins.\n\nMarch 26, 1993: The Portland Pirates are born as owner Tom Ebright brings the Baltimore Skipjacks to Maine and signs a three-year lease with the Cumberland County Civic Center. They are affiliated with the Washington Capitals.\n\nAdditional Photos Barry Trotz was the Pirates’ first coach and led the team to the 1994 Calder Cup in its first season. In 1997, Trotz left to coach the NHL’s Nashville Predators. He’s still coaching in Nashville. 1996 Press Herald file Joyce and Tom Ebright, the owners who moved the Baltimore Skipjacks to Portland and renamed them the Pirates, share the 1994 Calder Cup with the new club’s fans during the AHL championship parade on Congress Street. 1994 Press Herald file Kevin Dineen came aboard as coach in 2005, when the Ducks replaced the Capitals as the Pirates’ NHL affiliate. Dineen left June 1 to become head coach of the NHL’s Florida Panthers. 2008 Press Herald file Related Headlines Portland Pirates sail under a new flag\n\nOct. 8, 1993: Pirates beat Providence 6-3 in inaugural game.\n\nMay 30, 1994: Pirates win the AHL’s Calder Cup championship in their first season, beating Moncton 4-1 in the sixth game of the best-of-seven series. Goalie Olaf Kolzig is named MVP.\n\nJune 13, 1996: Pirates lose 2-1 to Rochester in Game 7 of the Calder Cup finals, after having the worst record in the league in mid-January.\n\nJuly 14, 1997: Tom Ebright dies of a heart attack in a Pennsylvania hospital while awaiting a heart transplant. His widow, Joyce Ebright, becomes majority owner.\n\nAdvertisement\n\nAug. 7, 1997: Coach Barry Trotz leaves the Pirates to join the expansion Nashville Predators of the NHL. Trotz remains as the only head coach the Predators have ever had.\n\nSept. 24, 1998: The Capitals announce they are sharing their affiliation in Portland with the Chicago Blackhawks. The resulting season (23-50-7) is the worst in Pirates’ six-year history and the dual affiliation ends after one year.\n\nNov. 9, 1998: After two failed sales to local businessmen, David Fisher, his brother Richard and Chester E. Homer, a Kennebunkport businessman, buy out Joyce Ebright’s 65 percent share of the Pirates to become new team owners. Fisher had been the team’s minority owner.\n\nSept. 7, 2000: Lyman Bullard, a Boston sports attorney, and Brian Petrovek, a former U.S. Hockey executive, are announced as the new owners of the Pirates. The sale becomes official on Oct. 20.\n\nFeb. 3, 2003: The Civic Center hosts the AHL All-Star Classic, a game won by Canada 10-7 over PlanetUSA but most remembered for its silence. One hour before the game was to begin, the mixer and the amplifier in the building’s sound system malfunctioned. All sound was lost until 2:58 remained in the second period, when the system was repaired.\n\nApril 27, 2005: The Capitals announce they are ending their 12-year affiliation agreement with Portland to move their minor leaguers to Hershey, Pa.\n\nAdvertisement\n\nMay 23, 2005: The Pirates sign a five-year affiliation agreement with the Anaheim Ducks.\n\nJuly 18, 2005: Kevin Dineen is announced as the sixth head coach in Pirates’ history.\n\nMay 30, 2006: The Pirates lose 5-4 in overtime to Hershey in Game 7 of the Eastern Conference finals. It is the first time Portland had advanced past the second round of the playoffs since 1996.\n\nMay 24, 2008: Another playoff heartbreak as former Pirate Tim Brent scores with 30 seconds left to lift Wilkes-Barre/Scranton past Portland 3-2 in Game 7 of the Eastern Conference finals.\n\nJune 3, 2008: The Ducks end their affiliation with the Pirates, moving their minor leaguers to Des Moines, Iowa.\n\nJune 10, 2008: The Buffalo Sabres become the Pirates’ new NHL affiliate, signing a three-year affiliation agreement, with a club option for two more years.\n\nAdvertisement\n\nJan. 19, 2010: The second AHL All-Star Classic is held in Portland without a hitch. Canada again wins 10-9 in a shootout over PlanetUSA.\n\nMarch 11, 2010: Petrovek, who is weighing an offer to move the Pirates to Albany, N.Y., announces a long-term extension of the team’s affiliation with Buffalo.\n\nMarch 17, 2010: Civic Center trustees approve a two-year lease extension with the Pirates.\n\nJune 1, 2011: Kevin Dineen is hired as head coach of the Florida Panthers.\n\nJune 24, 2011: The Sabres end their affiliation with the Pirates, moving their minor leaguers to Rochester, N.Y.\n\nJune 27, 2011: The Pirates announce a new affiliation with the Phoenix Coyotes."}, {"url": "https://mainehockeyjournal.bdnblogs.com/2016/05/11/portland-pirates/echl-coming-to-portland/", "page_content": "Could the Portland Pirates rise from the ashes and make a return to the Cross Insurance Arena?\n\nThat’s the plan according to various media sources as former Pirates’ Chief Operating Officer Brad Church, who has formed a partnership with the team’s original general manager Godfrey Wood to bring an ECHL franchise to Portland for the 2017-18 season.\n\nWood, who is currently executive director of Habitat for Humanity of Greater Portland, was the Pirates’ first general manager, joining the late Tom Ebright in bringing hockey back to Portland.\n\nEbright, an investment banker from Maryland and owner of the Baltimore Skipjacks, relocated his hockey team to Portland after a one-year absence following the Maine Mariners departure to Providence, Rhode Island in 1992.\n\nThe Pirates would spend 23 seasons in Portland as an American Hockey League franchise before being sold to a group of investors that plan to move the team to Springfield, Massachusetts for the 2016-17 season.\n\nAttendance for the Pirates had been on the rebound since returning to Portland for the 2014-15 season after a one-year hiatus to Lewiston due to renovations to the CIA and a lease dispute with county trustees.\n\nThe team averaged 3,363 this past season, up from 2,963 during 2014-15.\n\nWhile announce attendance fluctuated, mainly to due to comp tickets distributed by previous ownership, the team’s actual gate attendance, people who are actually in attendance, showed that since the Pirates relocated to Portland in 1993, they’ve averaged 3,600 fans per game.\n\nOnly during the first two seasons in Portland did actual gate attendance reach over 5,000 fans per game and only once since 1997 had the team’s gate attendance eclipsed over 4,000 fans per game.\n\nCumberland County taxpayers approved a $34 million renovation bond in 2011 to improve the concourse, add more bathrooms as well as improve locker rooms and backstage amenities. The project was completed in 2014, but following the 2012-13 season, the team’s lease expired and both sides got into a long protracted dispute. The result was the Pirates suing the trustees for breach of contract, forcing the team to play the entire 2013-14 season at the Androscoggin Bank Colisee in Lewiston.\n\nCain became majority owner in Dec. 2013 and worked out a new five-year lease agreement with the trustees less than a month later. Former managing owner/CEO Brian Petrovek, now President of the ECHL Adirondack Thunder, was replaced by Church, who was named Chief Operating Officer.\n\nThe Pirates recently completed the second year of the five-year lease agreement as Cain approached the trustees a few weeks ago about making changes to the lease agreement as an attempt to reduce operating cost. There were discussions about the Panthers purchasing the Pirates in order to keep them in Portland, but no deal could be reached.\n\nThe departure of the Pirates, including the $100,000 exit fee, left many questions about future of the CIA including Portland’s mayor Ethan Strimling.\n\nThe Pirates move to Springfield was paved by the Springfield Falcons, who were sold last month to the NHL’s Arizona Coyotes with the intent on relocating the team to Tucson, AZ for next season.\n\nThe AHL Board of Governors met on Tuesday to give conditional approval to the sale and relocation. The board also reviewed the sale of the Pirates and a vote on the sale and relocation is expected in the next two weeks.\n\nThe Pirates won its only Calder Cup championship during the team’s first season in Portland. The excitement of that season culminated with an estimated 15,000 people gathering in Portland for a ticker tape parade.\n\nChurch spent six seasons as a player for the Pirates (1996-2002) and was inducted into the Pirates’ Hall of Fame in 2012.\n\nThe new team would retain the Pirates name, and incorporate aspects of the original and current logo include mascot’s Salty Pete and Crackers.\n\nThe ECHL, formerly known as the East Coast Hockey League until it absorbed several teams from West Coast Hockey League in 2003, has 28 teams spanning from New Hampshire to Alaska and Florida to Idaho.\n\nThe league, which is one level below the AHL, plays a 72-game regular season schedule beginning in late October and ending in April. The playoffs last through the month of May.\n\nTeams in the ECHL do not have a direct affiliation with NHL teams compared to the AHL where the Pirates were affiliated with the Florida Panthers. An ECHL franchise typically will receive five or six players from an NHL club, allowing for more control over its roster by signing unrestricted free agents.\n\nIt’s cheaper to operate an ECHL franchise compared to the AHL. Unlike the AHL, there is no affiliation fee in the ECHL, and they have limits on roster size and operate under a strict salary cap.\n\nTravel is also compared to this past season after losing Manchester, Worcester, and Glens Falls as part of the new AHL Pacific Division. Last season, five AHL teams relocated from the northeast to California as western-based NHL clubs moved their affiliates closer to home.\n\nManchester recently completed its first season in the ECHL, while Worcester is slated begin in the fall of 2017.\n\nLower operating cost should help drive attendance as they plan to reduce ticket prices and include pricing options for children and seniors.\n\nBefore the puck can even drop in Oct. 2017. The new ownership group still need to apply for an expansion franchise or purchase an existing franchise that will be relocated to Portland. The group also need to reach a lease agreement with the trustees."}]}