{"Brian Petrovek was born in Boston, Massachusetts.": [{"url": "https://www.eliteprospects.com/player/264128/brian-petrovek", "page_content": "Edit Mode\n\nGo Premium to enter Edit Mode\n\nTake control of your EliteProspects profile! Sign up for EP Premium and verify your profile to access these benefits.\n\n- Ability to add additional data to your career profile: Videos, Images, Social Media, Referrals, Fitness Testing Results and much more!\n\n- Improve your search rank\n\n- Connect directly with players, coaches, teams, scouts and agents (optional)\n\n- Premium Design on your profile page (optional)\n\n- EP Contact Book listing of your profile (optional)\n\n- Verification Badge on your profile\n\nSign up for premium"}, {"url": "https://peoplepill.com/people/brian-petrovek/", "page_content": "Brian Petrovek (born March 24, 1955) is an American former ice hockey goaltender and hockey executive. He was selected by the Los Angeles Kings in the 10th round (172nd overall) of the 1975 NHL Amateur Draft, and was also drafted by the Edmonton Oilers in the 11th round (143rd overall) of the 1975 WHA Amateur Draft.\n\nPetrovek attended Harvard University, where he played NCAA Division I hockey with the Harvard Crimson of the ECAC Hockey conference. As a goaltender, following his standout 1974-75 sophomore season, Petrovek was named to both the All-Ivy League First Team and the NCAA (East) First All-American Team. In his senior year Petrovek was named to the 1976-77 All-Ivy League First Team, and was also selected as the Most Valuable Player of the 1977 Beanpot. In 1998, Petrovek was inducted into the Harvard University Athletic Hall of Fame.\n\nFrom 1989 to 1993, Petrovek worked as Vice President of Marketing for the New Jersey Devils of the National Hockey League. In June 1993, he joined the national staff of USA Hockey, and in 1998 he was elevated to the position of Executive Director. While with USA Hockey, Petrovek served as Team Leader for the United States men's national ice hockey team at the 1996 World Cup of Hockey, 1997 Men's World Ice Hockey Championships, and the 1998 Winter Olympics.\n\nFrom 2000 until April 2014, Petrovek served as the managing owner for the Portland Pirates of the American Hockey League (AHL). On March 22, 2013, Petrovek accepted a plea deal for operating under the influence after driving his Jeep into a divider while intoxicated over three times the legal limit.\n\nOn May 16, 2014, Petrovek was named the president of the Adirondack Flames of the AHL by the Calgary Flames. He stayed in Glens Falls, New York, when the Calgary Flames moved their AHL franchise to Stockton, California, in 2015 and took the same position with their ECHL team, the Adirondack Thunder. In 2017, Petrovek became the president of the Stockton Heat of the AHL, a position he held until he was fired in February 2020.\n\nAwards and achievements"}, {"url": "https://www.celebsagewiki.com/brian-petrovek", "page_content": "Age, Biography and Wiki\n\nBrian Petrovek was born on 24 March, 1955 in Norwood, Massachusetts, United States. Discover Brian Petrovek's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 68 years old?\n\nPopular As N/A Occupation N/A Age 68 years old Zodiac Sign Aries Born 24 March 1955 Birthday 24 March Birthplace Norwood, Massachusetts, United States Nationality United States\n\nWe recommend you to check the complete list of Famous People born on 24 March. He is a member of famous with the age 68 years old group.\n\nBrian Petrovek Height, Weight & Measurements\n\nAt 68 years old, Brian Petrovek height is 1.73 m and Weight 73 kg.\n\nPhysical Status Height 1.73 m Weight 73 kg Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nHe is currently single. He is not dating anyone. We don't have much information about He's past relationship and any previous engaged. According to our Database, He has no children.\n\nFamily Parents Not Available Wife Not Available Sibling Not Available Children Not Available\n\nBrian Petrovek Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Brian Petrovek worth at the age of 68 years old? Brian Petrovek’s income source is mostly from being a successful . He is from United States. We have estimated Brian Petrovek's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income\n\nBrian Petrovek Social Network\n\nInstagram Linkedin Twitter Brian Petrovek Twitter Facebook Wikipedia Brian Petrovek Wikipedia Imdb\n\nTimeline"}, {"url": "https://tidesmartradio.com/brian-petrovek/", "page_content": "Show Information Show: 108\n\nAir date: Saturday, April 19\n\nGuest: Brian Petrovek\n\nHost: Steve Woods (Stevoe)\n\nStudio Contributor Debi Davis\n\nExecutive Producer: Shannon Maguire\n\nFormer CEO of the Portland Pirates Brian Petrovek grew up in the Greater Boston area. He received both his bachelor’s and master’s degrees from Harvard University, where he earned All-America honors as a goaltender and was twice named to the All-Ivy League First Team (1974-75, 1976-77). In 1977, he was named the “Most Valuable Player of the Beanpot”, one of college hockey’s most prestigious tournaments. In October 1998, he was inducted into the Harvard University Athletic Hall of Fame. Steveo and Petrovek talked about how old they were when they both started playing hockey.\n\nPetrovek, who played youth hockey in the greater Boston area, was one of four goaltenders invited to the final U.S. Olympic Team Trials Camp in 1976. He was drafted by both the Los Angeles Kings of the National Hockey League and the Edmonton Oilers of the World Hockey Association in 1975.\n\nPetrovek joined as a Managing Owner and CEO of Portland Pirates LLC during the summer of 2000. Petrovek came to the Pirates after working the previous seven years with USA Hockey, Inc. and The USA Hockey Foundation in Colorado Springs, Colorado.\n\nAs Managing Owner and CEO, Petrovek oversaw the short and long term needs of the business, represents the franchise as an alternate governor at the League level, and participates regularly as a member of various league committees. He took the lead role in developing the Pirates’ winning bids for the 2003 Dodge AHL All-Star Classic and the 2010 Time Warner Cable AHL All-Star Classic joining Rochester, Hershey and Providence as the only cities to host more than one AHL All-Star event in the league’s history. Petrovek told Stevoe that he feels fortunate to have stayed in athletics after playing hockey for Harvard.\n\nLocally, Petrovek has served as Board Chair of the United Way of Greater Portland (2007-2009), was a member of the United Way’s Annual Campaign Cabinet since 2001-2010, and Chaired the 2004 United Way Annual Campaign. Petrovek is also a founding member of the Board of Directors of the Maine Sports Foundation. Petrovek is also an Adjunct faculty member at the University of Southern Maine, teaching in the university’s Sports Management degree program."}, {"url": "https://happyhappybirthday.net/en/age/brian-petrovek-person_egleseey", "page_content": "Brian Petrovek\n\nAmerican ice hockey goaltender – Brian Petrovek was born in Norwood (town and census-designated place in Norfolk County, Massachusetts, United States) on March 24th, 1955 and is 68 years old today.\n\nAge How old is Brian Petrovek? 68 Brian Petrovek is 68 years old.\n\nBiographical data\n\nBrian Petrovek\n\nBirthday When was Brian Petrovek born? Brian Petrovek was born on March 24th, 1955.\n\nPlace of Birth Where was Brian Petrovek born? Norwood (town and census-designated place in Norfolk County, Massachusetts, United States).\n\n♈ ♈ Zodiac What is the zodiac sign of Brian Petrovek? Brian Petrovek was born in the zodiac sign Aries (The Ram)."}, {"url": "https://www.eliteprospects.com/staff/14872/brian-petrovek", "page_content": "Go Premium to enter Edit Mode\n\nTake control of your EliteProspects profile! Sign up for EP Premium and verify your profile to access these benefits.\n\n- Ability to add additional data to your career profile: Videos, Images, Social Media, Referrals, Fitness Testing Results and much more!\n\n- Improve your search rank\n\n- Connect directly with players, coaches, teams, scouts and agents (optional)\n\n- Premium Design on your profile page (optional)\n\n- EP Contact Book listing of your profile (optional)\n\n- Verification Badge on your profile\n\nSign up for premium"}, {"url": "https://prabook.com/web/brian.petrovek/2478774", "page_content": "Brian Petrovek\n\nhockey player\n\nMarch 24, 1955\n\nHe was selected by the Los Angeles Kings in the 10th round (172nd overall) of the 1975 National Hockey League Amateur Draft, and was also drafted by the Edmonton Oilers in the 11th round (143rd overall) of the 1975 WHA Amateur Draft. Petrovek is currently the president of the Adirondack Flames of the American Hockey League (AHL). As a goaltender, following his standout 1974-1975 sophomore season, Petrovek was named to both the All-Ivy League First Team and the National Collegiate Athletic Association (East) First All-American Team. In his senior year Petrovek was named to the 1976-1977 All-Ivy League First Team, and was also selected as the Most Valuable Player of the 1977 Beanpot. In 1998, Petrovek was inducted into the Harvard University Athletic Hall of Fame. From 1989 to 1993, Petrovek worked as Vice President of Marketing for the New Jersey Devils of the National Hockey League. In June 1993, he joined the national staff of United States of America Hockey, and in 1998 he was elevated to the position of Executive Director. While with United States of America Hockey, Petrovek served as Team Leader for the United States men\"s national ice hockey team at the 1996 World Cup of Hockey, 1997 Men\"s World Ice Hockey Championships, and the 1998 Winter Olympics. From 2000 until April 2014, Petrovek served as the managing owner for the Portland Pirates of the AHL. On May 16, 2014, Petrovek was named the president of the Adirondack Flames of the AHL."}, {"url": "https://popularbio.com/brian-petrovek/", "page_content": "Updated On April 30, 2023\n\nBrian Petrovek estimated Net Worth, Biography, Age, Height, Dating, Relationship Records, Salary, Income, Cars, Lifestyles & many more details have been updated below. Let’s check, How Rich is Brian Petrovek in 2019-2020? Scroll below and check more detailed information about Current Net worth as well as Monthly/Year Salary, Expense, Income Reports!\n\nBiography\n\nBrian Petrovek was born in Norwood on March 24, 1955.\n\nOn Popular Bio, He is one of the successful Ice Hockey Player. He has ranked on the list of those famous people who were born on March 24, 1955. He is one of the Richest Ice Hockey Player who was born in the United States. He also has a position among the list of Most popular Ice Hockey players. Brian Petrovek is 1 of the famous people in our database with the age of 64 years old.\n\nShort Profile First Name Brian Last Name Petrovek Profession Ice Hockey Player Age 64 years old Birth Sign Aries Birth Date March 24, 1955 Birth Place Norwood Country United States\n\nBrian Petrovek Net Worth\n\nBrian Petrovek estimated Net Worth, Salary, Income, Cars, Lifestyles & many more details have been updated below. Let’s check, How Rich is Brian Petrovek in 2019-2020?\n\nAccording to Wikipedia, Forbes, IMDb & Various Online resources, famous Ice Hockey Player Brian Petrovek’s net worth is $1-5 Million at the age of 64 years old. He earned the money being a professional Ice Hockey Player. He is from the United States.\n\nBrian Petrovek’s Net Worth:\n\n$1-5 Million\n\nEstimated Net Worth in 2020 $1-$3million Previous Year’s Net Worth (2019) Under Review Annual Salary Under Review. Income Source Primary Income source Ice Hockey Player (profession). Net Worth Verification Status Not Verified\n\nAge, Height & Body Measurements\n\nBrian Petrovek currently ages 64 years old. Brian Petrovek’s height Unknown & weight Not Available right. Full body measurements, dress & shoe size will be updated soon.\n\nWho is Brian Petrovek Dating?\n\nBrian Petrovek keeps his personal and love life private. Check back often as we will continue to update this page with new relationship details. Let’s take a look at Brian Petrovek past relationships, ex-girlfriends, and previous hookups. Brian Petrovek prefers not to tell the details of marital status & divorce.\n\nDating is to describe a stage in a person’s life when he or she is actively pursuing romantic relationships with different people. If two unmarried celebrities are seen in public together, they are often described as “dating” which means they were seen in public together, and it is not clear whether they are merely friends, exploring a more intimate relationship, or are romantically involved.\n\nFacts About Brian Petrovek"}, {"url": "https://hockeydraftcentral.com/1975/75172.html", "page_content": "1975 NHL DRAFT PICK Brian Petrovek Selected in 10th round\n\nNo. 172 overall by Los Angeles Kings\n\nBorn March 24, 1955 Position: Goaltender\n\nHeight: 5-8 Weight: 160\n\nBEFORE THE DRAFT Last Team: Harvard (ECAC)\n\nBirthplace: Norwood, Massachusetts (USA)\n\nHometown: Norwood, Massachusetts PRE-DRAFT STATISTICS Year Team League GP W-L-T GAA SO SV% 1974-75 Harvard ECAC 23 n/a 2.85 1 n/a PRE-DRAFT AWARDS AND HONORS\n\nNCAA East All-America First Team: 1974-75 (Harvard)\n\nECAC All-Star First Team: 1974-75 (Harvard)\n\nIvy League All-Star First Team: 1974-75 (Harvard)\n\nECAC Goals-Against Average Leader: 1974-75 (Harvard) (2.85) NHL CAREER Never played in NHL. NHL AWARDS AND HONORS\n\nManagement Career: Named New Jersey vice president of marketing prior to 1989-90 season and remained in that position until June 1993. NON-NHL CAREER Post-Draft Teams: Harvard (ECAC) NON-NHL AWARDS AND HONORS\n\nOlympics: 1998 (5-8 place) (as team leader)\n\nWorld Championships: 1997 (sixth place) (as team leader)\n\nWorld Cup of Hockey: 1996 (first place) (as team leader)\n\nIvy League All-Star First Team: 1976-77 (Harvard)\n\nHarvard Tudor Cup (MVP): 1976-77\n\nHarvard Weiland Award (Dedication): 1975-76\n\nBeanpot MVP: 1977 (Harvard)\n\nBeanpot Eberly Award (Top Goaltender): 1977 (Harvard)\n\nWHA Draft Pick: 1975 (by Edmonton, No. 143 overall in Round 11)\n\nCoaching Career: Served as Harvard (ECAC) graduate assistant and goalie coach from 1978 to 1980.\n\nManagement Career: Named ECAC assistant commissioner prior to 1979-80 season and held position through 1981-82 season. ... Named Utica (AHL) executive director prior to 1987-88 season and held position through 1988-89 season. ... Joined USA Hockey's national staff in Colorado Springs, Colo., in June 1993 and was in organization until Oct. 20, 2000. Was USA Hockey's assistant executive director in charge of marketing, sponsorship, licensing, public relations, the National Team Development Program, USA Hockey InLine and the USA Hockey Foundation. ... Became Portland (AHL) co-owner, president and chief executive officer on Oct. 20, 2000. Dropped role of president on Sept. 3, 2002, and remained CEO into 2002-03 season.\n\nEducation: Received bachelor's degree with honors in history from Harvard in 1977 and master's in education from Harvard in 1980.\n\nMiscellaneous: Was among the final cuts from 1976 U.S. Olympic team. ... Was associate director of the Harvard College Fund in 1979. ... Went into advertising business after stint at ECAC and worked as account manager from 1982 to 1987. ... Was executive director of Berkshire Hockey School in Easthampton, Mass., from 1980 to 1987.\n\nPersonal: Full name is Brian S. Petrovek.\n\nVisit the new\n\nHockey Draft Central HockeyDraftCentral.com is in the middle of rebuilding. You are looking at a page that is not yet updated but is still part of the old site. Check out the new look.\n\n• New Home Page\n\nSearch this site with:\n\n\n\nSNAPSHOT '75 Total Selected: 217 Forwards: 126 Defense: 65 Goaltenders: 26 Major Junior: 135 College Players: 61 Canadian: 162 Euro-Canadian: 3 USA Citizens: 46 U.S.-Born: 45 European: 6 Reached NHL: 87 Won Stanley Cup: 8 Hall of Fame: 0 All-Star Game: 6 Year-end All-Star: 3 Olympians: 11 Picks Traded: 21\n\nAbout This Site\n\n"}, {"url": "https://www.nytimes.com/1984/09/16/style/brian-petrovek-is-married-to-sara-leblond-banker.html", "page_content": "Sara LeBlond, a daughter of Mr. and Mrs. Richard K. LeBlond 2d of New Canaan, Conn., was married there yesterday to Brian Petrovek, a son of Mr. and Mrs. August Petrovek Jr. of West Hyannis Port, Mass. Msgr.\n\nFrancis X. McGuire performed the ceremony at St. Aloysius Roman Catholic Church.\n\nThe bride, an account representative in the international division of the Bank of Boston, and Mr. Petrovek both graduated from the Hotchkiss School and Harvard University. Her father is vice chairman of the Chemical Bank in New York.\n\nMr. Petrovek is an account executive with Cosmopulos, Crowley & Daly, an advertising agency in Boston. His father is an engineer for the New England Telephone Company in Boston."}], "Brian Petrovek earned a degree in economics from Harvard University.": [{"url": "https://tidesmartradio.com/brian-petrovek/", "page_content": "Show Information Show: 108\n\nAir date: Saturday, April 19\n\nGuest: Brian Petrovek\n\nHost: Steve Woods (Stevoe)\n\nStudio Contributor Debi Davis\n\nExecutive Producer: Shannon Maguire\n\nFormer CEO of the Portland Pirates Brian Petrovek grew up in the Greater Boston area. He received both his bachelor’s and master’s degrees from Harvard University, where he earned All-America honors as a goaltender and was twice named to the All-Ivy League First Team (1974-75, 1976-77). In 1977, he was named the “Most Valuable Player of the Beanpot”, one of college hockey’s most prestigious tournaments. In October 1998, he was inducted into the Harvard University Athletic Hall of Fame. Steveo and Petrovek talked about how old they were when they both started playing hockey.\n\nPetrovek, who played youth hockey in the greater Boston area, was one of four goaltenders invited to the final U.S. Olympic Team Trials Camp in 1976. He was drafted by both the Los Angeles Kings of the National Hockey League and the Edmonton Oilers of the World Hockey Association in 1975.\n\nPetrovek joined as a Managing Owner and CEO of Portland Pirates LLC during the summer of 2000. Petrovek came to the Pirates after working the previous seven years with USA Hockey, Inc. and The USA Hockey Foundation in Colorado Springs, Colorado.\n\nAs Managing Owner and CEO, Petrovek oversaw the short and long term needs of the business, represents the franchise as an alternate governor at the League level, and participates regularly as a member of various league committees. He took the lead role in developing the Pirates’ winning bids for the 2003 Dodge AHL All-Star Classic and the 2010 Time Warner Cable AHL All-Star Classic joining Rochester, Hershey and Providence as the only cities to host more than one AHL All-Star event in the league’s history. Petrovek told Stevoe that he feels fortunate to have stayed in athletics after playing hockey for Harvard.\n\nLocally, Petrovek has served as Board Chair of the United Way of Greater Portland (2007-2009), was a member of the United Way’s Annual Campaign Cabinet since 2001-2010, and Chaired the 2004 United Way Annual Campaign. Petrovek is also a founding member of the Board of Directors of the Maine Sports Foundation. Petrovek is also an Adjunct faculty member at the University of Southern Maine, teaching in the university’s Sports Management degree program."}, {"url": "https://www.coloradoeagles.com/news/detail/petrovek-named-president-alternate-governor-of-colorado-eagles", "page_content": "Petrovek Named President, Alternate Governor of Colorado Eagles\n\nWINDSOR, CO. – The Colorado Eagles, proud AHL affiliate of the Colorado Avalanche, have announced that Brian Petrovek has been hired to serve as president and alternate governor of the Colorado Eagles. Petrovek most recently served as CEO and alternate governor for the AHL’s Stockton Heat from 2017 to 2020. In addition, he has previously led the American Hockey League’s Adirondack Flames (2014-15), Portland Pirates (2000-14) and Utica Devils (1987-90), as well as serving as team president of the ECHL’s Adirondack Thunder (2015-17). Petrovek’s professional experience also includes hosting three league All-Star Classics, including the AHL All-Star Game in Portland, Maine in both 2003 and 2010, and the ECHL All-Star Classic in Glens Falls, New York in 2017.\n\n\"I could not be more excited to accept this position with the Colorado Eagles,” said Petrovek. “This organization is one of the most accomplished in the world of minor-professional sports, and I am excited to help grow the Eagles to even greater heights. We have a dynamic group in the front office, world-class ownership, a premiere affiliation with the Colorado Avalanche, and a fanbase that is second to none. That combination made this an opportunity that is among the most exciting of my career.\"\n\nPetrovek’s resume also boasts a senior management position with the NHL’s New Jersey Devils, where he served as the Vice President of Marketing for four seasons under Lou Lamoriello (1989-1993). After six years with the Devils’ organization, Petrovek accepted a position with USA Hockey, where he worked for seven years as deputy executive director (1993-2000) and as executive director of the USA Hockey Foundation during his final two years (1990 -2000) in Colorado Springs. Petrovek served as Team Leader for Team USA at the 1996 World Cup of Hockey and for the United States Men’s Team at the 1998 Olympic Winter Games in Nagano, Japan. Petrovek worked with Team USA during its championship run at the 1996 World Cup of Hockey and was inducted into the US Hockey Hall of Fame with the team in 2016.\n\n“We are absolutely thrilled to be able to bring in an individual who is as accomplished in the worlds of both hockey and business as Brian,” said Eagles owner, CEO and governor Martin Lind. “The wealth of experience that he brings to the table will help us achieve the lofty goals that we have set for this team and this region for the years and decades to come.”\n\nPetrovek was an All-American goaltender at Harvard before being selected by the NHL’s Los Angeles Kings and the WHA’s Edmonton Oilers in 1975. He was inducted into the Harvard University Athletics Hall of Fame in 1998.\n\nPetrovek has built a long history of community service and leadership, most recently spending the past year as president and CEO of United Way of York County in Kennebunk, Maine. He also served on the boards of the United Way of Greater Portland and United Way of San Joaquin County."}, {"url": "https://economics.harvard.edu/", "page_content": "Each year the Economics Department awards prizes to graduating economics thesis writers. The Seymour E. and Ruth B. Harris Prize and the Allyn A. Young Prize are awarded to students who have produced outstanding theses. The John H. Williams Prize is awarded to the honors senior graduating with the best overall record in economics.\n\nLucas Woodley was awarded the Harris Prize for his thesis, “Estimating the Impact of the Inflation Reduction Act on Used and New Vehicle Markets: Combining Theory and Fieldwork” advised...\n\nabout Congratulations to the Graduating Seniors and Prize Winners in Economics"}, {"url": "https://economics.harvard.edu/phd-program", "page_content": "The Ph.D. Program in the Department of Economics at Harvard is addressed to students of high promise who wish to prepare themselves in teaching and research in academia or for responsible positions in government, research organizations, or business enterprises. Students are expected to devote themselves full-time to their programs of study.\n\nThe program prepares students for productive and stimulating careers as economists. Courses and seminars offered by the department foster an intellectually active and stimulating environment. Each week, the department sponsors more than 15 different seminars on such topics as environmental economics, economic growth and development, monetary and fiscal policy, international economics, industrial organization, law and economics, behavioral economics, labor economics, and economic history. Top scholars from both domestic and international communities are often invited speakers at the seminars.\n\n\n\nThe Harvard community outside of the department functions as a strong and diverse resource. Students in the department are free to pursue research interests with scholars throughout the University. Faculty of the Harvard Law School, Kennedy School of Government, and Harvard Business School, for example, are available to students for consultation, instruction, and research guidance. As a member of the Harvard community, students in the department can register for courses in the various schools and have access to the enormous library resources available through the University. There are over 90 separate library units at Harvard, with the total collections of books and pamphlets numbering over 13 million.\n\n\n\nBoth the department and the wider University draw some of the brightest students from around the world, which makes for a student body that is culturally diverse and likely unequaled in the range of intellectual interests of its members. These factors combine to add an important dimension to the educational process. Students are able to learn from one another, collaborate on research projects and publications, and form bonds that are not broken by distance once the degree is completed and professional responsibilities lead them in different directions."}, {"url": "https://zhuanlan.zhihu.com/p/348094499", "page_content": "北京大学公开课 ———— 投资银行学\n\n\n\n\n\n“中国的市场必将是全球最大的资本市场”\n\n—————冯科\n\n\n\n\n\n企业产权制度：\n\n业主制（所有权和经营权统一，既是老板也是员工） 合伙制（两人以上共同拥有企业，） 公司制（所有权和经营权分离）\n\n\n\n\n\n\n\n\n\n认识当前中国资本市场\n\n救市导致市场化程度减弱（15年股灾，证监会用证券保证金去救市）\n\n影响资本市场的关键是信心\n\n贸易战影响信心 （政治博弈， 意识形态的对抗）\n\n资本，技术，劳动力的交换\n\n美国经济的内部失衡\n\n中国经济的内部失衡\n\n中美各自的政治经济失衡\n\n结果：共识减少，争端增加，影响市场\n\n中国经济的内部失衡\n\n四大陷阱与五大失衡：\n\n四大陷阱：\n\n中等收入陷阱 （特征：经济过度依赖出口， 技术进步主要靠进口 ，环境污染，大量消耗资源，社会不平等，高度腐败） 金德伯格陷阱 （原本维持世界秩序的国家不愿维持，新出现想维持秩序的国家又不肯）（美国退出联合国，气候协议，伊朗协议） 修昔底德陷阱 （传统优势国家与新崛起的国家之间的对抗）（例如德国的崛起爆发的两次世界大战） 塔西佗陷阱 （人民群众对党和政府的不信任）（例如群众觉得政府做什么都有内幕与交易）\n\n五大失衡：\n\n经济增长不能带来充分就业（技术进步导致就业率降低） 固定投资增长过快而有效需求不足（财富的不均匀和固定资产与消费之间的关系）（富人的不消费，穷人没钱消费） 统计局的CPI指数与人民群众感受到的不一致 低价工业化和高价城市化的矛盾（比如 生产的工业产品价格越来越低，房间越来越高） 民营机构“资金荒”，金融机构“资产荒”\n\n\n\n\n\n一二线城市搁不下我们的肉身\n\n三四线城市搁不下我们的灵魂\n\n\n\n\n\n\n\n\n\n企业经营分为资产经营和资本运营。\n\n\n\n\n\n3.19 看完了31/60的课程\n\n对于企业上市前准备有了初步的了解，很好的课程，生动诙谐。\n\n\n\n\n\n3.22看完了40/60\n\n逐渐明白上市对国家的帮助，一个国家上市且规范的企业越多，国家才更有希望。\n\n优点一：为国家财政贡献巨大。\n\n首先是对于税务的严查，如冯科老师所说中国有很大一部分企业的利润并不是利润，是偷税漏税后的余额。\n\n优点二：企业有责任义务被全民监督。\n\n既然拿了投资者的钱，规范行为一定是必须的。相比于相对自由度高的企业来说，对于全民来说是件好事。\n\n优点三：有助于企业发展。\n\n上市的本质是好的企业有些好的项目，但资金投入可能巨大，贷款不到或者不希望贷款，增发一部分股份让股民来选择性投资它。有钱一起赚。（虽说是初心，毕竟牢记使命的人很少，企业如此，股民如此，群众亦如此）"}, {"url": "https://www.recordnet.com/story/sports/nhl/2020/02/28/brian-petrovek-out-as-ceo/1614495007/", "page_content": "Scott Linesburgh\n\nslinesburgh@recordnet.com\n\nSTOCKTON — Brian Petrovek is out as chief executive officer of the Stockton Heat after three years with the American Hockey League franchise.\n\nThe Calgary Flames, the Heat’s parent organization, released a statement Friday, stating Petrovek was no longer with the team as of Thursday. Petrovek was heavily involved in negotiations between the Flames and the city of Stockton for a long-term lease to remain at Stockton Arena.\n\nThe Heat have been in town for five seasons and recently agreed to an extension through the 2020-21 season.\n\nThe Flames did not state the exact reason for the decision, nor who would be handling the lease negotiations going forward. A replacement for Petrovek has not been named, and major franchise decisions will be handled through the main office in Calgary for now, officials said.\n\nThe Flames statement read: “Effective (Thursday), Brian Petrovek is no longer serving as CEO of the Stockton Heat. Calgary Sports and Entertainment Corporation, the parent of the Stockton Heat and the Calgary Flames, would like to wish Brian the best in his future endeavors and will continue in good faith discussions to complete a long-term agreement to keep the Heat in Stockton beyond the 2020-21 season.”\n\nPetrovek, reached by phone on Friday afternoon, declined comment.\n\nThe 64-year-old is a Harvard graduate and played goaltender for its hockey team. He was announced as the CEO of the Heat on March 1, 2017, replacing Dave Piecuch. This was the fourth time he ran an AHL franchise.\n\nPetrovek spent 14 years as the managing owner and CEO of the AHL’s Portland Pirates and spent time with the Utica Devils (1987) and Adirondack Flames (2014-15) before they moved to Stockton to become the Heat.\n\nHe was running the Adirondack Thunder of the ECHL until the Flames sold it in 2017 and was transferred to Stockton.\n\nPetrovek’s final year with the Heat was dominated by the contract situation.\n\nThe Heat had a five-year contract and the option for a second five-year deal when it arrived in 2015. Before this season, the team announced it would not to pick up the option but that both sides were open to a one-year extension, which was announced on Feb. 19.\n\nThe Heat is seeking a contract that includes upgrades to the practice facility at Oak Park Ice Arena and to Stockton Arena.\n\nContact reporter Scott Linesburgh at (209) 546-8282 or slinesburgh@recordnet.com. Follow him on Twitter @ScottLinesburgh."}, {"url": "https://economics.harvard.edu/admissions", "page_content": "The department of Economics at Harvard University is committed to seeking out and mentoring scholars who wish to pursue a rigorous and rewarding career in economic research. Our graduates are trailblazers in their fields and contribute to a diverse alumni community in both the academic and non-academic sectors. We invite you to learn more about the PhD program in Economics. Have questions about applying? Please thoroughly check the GSAS admission website before emailing us at: econadmissions@fas.harvard.edu.\n\nApply to Economics @Harvard\n\nApplication Requirements\n\nCompleted online application form (Must be completed by December 1st)\n\nResume\n\nStatement of Purpose\n\nTranscripts for all college/university degrees and courses\n\nSelf-reported transcripts are accepted for both all programs at the application stage. Applicants must upload copies of his/her transcripts to the online application system. Hard copy transcripts will only be required if admitted to a program, prior to enrollment.\n\nSelf-reported transcripts are accepted for both all programs at the application stage. Applicants must upload copies of his/her transcripts to the online application system. Hard copy transcripts will only be required if admitted to a program, prior to enrollment. Current GRE scores (not required for the 2022 application cycle)\n\nTOEFL or IELTS scores (non-native English speakers see details below)\n\nThree letters of recommendation (at least one from an academic source). Recommendation letters must be submitted online through the online application system.\n\n$105 application fee via credit card\n\nWriting sample (at least 15 pages in length)\n\nGRE Scores\n\nFor the 2022 application cycle, GRE scores are Not Required.\n\nAll applicants are required to take the General Test of the Graduate Record Examination (GRE). Test scores are valid for five years (scores must be from no earlier than September 1, 2017 for fall 2022 admission). Applicants are, however, advised to take the exam no later than mid-November. There is no minimum test score requirement. A department code is not required for score submission.\n\nInstitution Codes for PhD Programs\n\nGRE: 3451\n\nFinancial Aid\n\nAll admitted students are awarded a financial package which includes tuition, single-person health insurance, living stipend for the first two years, teaching and research assistant stipends and a completion fellowship in the final year of the program.\n\nInternational Applications\n\nAdequate command of spoken and written English is required for admission. Applicants whose native language is other than English and who do not hold a Bachelor's degree or its equivalent from an institution at which English is the language of instruction must submit TOEFL or IELTS scores.\n\nTOEFL/IELTS scores are valid for two years. (scores must be from no earlier than September 1, 2020 for fall 2022 admission). The committee prefers scores of at least 100 on the internet-based test.\n\nInstitution Codes for Toefl score reports\n\nPhD programs: 3451\n\nReapplicants\n\nApplicants who applied last year are considered reapplicants. Those reapplying must submit a completely new application. The new application must include all required documents to be provided by the applicant - we will not re-use material previously submitted. These materials include an updated statement of purpose, transcripts, test score reports, updated letters of recommendation, the application fee, and any other supporting materials\n\nPlease note, Harvard University will accept no more than three applications from any one individual over the course of his/her lifetime.\n\nApplying to more than one Program\n\nHarvard has several PhD programs that may also be of interest to students considering applying to the PhD program in economics. These include Business Economics, Political Economy and Government, Public Policy, and Health Policy. Many students in these programs have considerable overlap in their coursework with courses offered to PhD students in economics. Many also have dissertation committees that include faculty members of the economics department. Please refer to the Graduate School of Arts and Sciences for applicable program deadlines. (Deadlines have already passed for some programs this year but not for others.)\n\n\n\nWe encourage those with interest in any of those programs to also apply to those programs. The economics department will make admissions decisions independently, so application to or admission to other programs will not adversely affect admissions decisions within the Economics department. If you opt to apply, please note, the Graduate School will not accept more than three applications from any individual during the course of his or her academic career.\n\nApplication Assistance and Mentoring Program\n\nMany students interested in an economics PhD experience disparate degrees of support in the application process. The Application Assistance and Mentoring Program (AAMP) aims to mitigate these gaps by helping students from underrepresented groups connect with a graduate student mentor in MIT or Harvard’s PhD economics programs. These mentors can provide:\n\n• Advice on graduate school and fellowship applications, including questions about the application process and feedback on application materials.\n\n• Information about economics research, life as a PhD student or in an academic career, for students who are deciding whether a PhD in economics is the right choice for them.\n\nThe AAMP aims to increase the pipeline of diverse talent in economics PhD programs and welcomes participation from all groups underrepresented in economics, including but not limited to: Black, Hispanic-Latinx, Native American, low-income, and LGBTQ+ students, women, students with disabilities, and students who are the first in their families to go to college. The AAMP welcomes participation among students at various stages of their economics studies, including undergraduates and college graduates. The AAMP is open to students who are curious about the academic economics experience and interested in figuring out if it’s right for them.\n\nInterested participants should fill out the application linked below. We will accept applications until August 5, 2022. Mentorship will begin over the summer and continue through Fall 2022. Mentees who prefer to meet for a single “coffee chat” may indicate their preference on the form. We will do our best to match all interested applicants with a mentor; however, demand may exceed the availability of mentors.\n\nPlease note that the MIT / Harvard Economics AAMP is a volunteer-based, student-run program. This program is not considered part of the admissions process for the Economics PhD at MIT or Harvard, nor will any student's participation in the AAMP be considered by the Graduate Admissions Committee at either school.\n\nPlease direct any questions to harvard.econ.aamp@gmail.com. To join the program, please click the link below to fill out the form.\n\nApplication Assistance and Mentoring Program Form"}, {"url": "https://zhuanlan.zhihu.com/p/53802773", "page_content": "温馨提示：本文共计约15000字，全文阅读可能耗时约1h，因而不适合阅读，下附目录供快速查阅。\n\n温馨提示2：本文撰于2018年末，部分内容可能已显陈旧。\n\n比较友好×的版本参见我的个人博客\n\n这篇文章部分参考了以下书目：\n\n【其实还有科学哲学（\n\n摘要：能源物理化学和能源材料化学是能源化学中基础性、原理性和前沿性的研究领域，理论化学在能源材料的研究领域具有潜在的应用价值。本文分析了能源化学中的表界面问题以及能源化学过程中的重要理论问题等关键问题，和能源材料化学中的重要理论研究问题，结合我国煤炭为主，新能源逐步发展壮大的能源总体环境，提出了要逐步引导技术储备的产生和人才力量的支持，发挥日趋重要的理论研究在产业发展中的重要作用，并适时整合相关企业和研究机构在市场需求和技术储备的发展，保障产业和研究的对接，促进研究和产业发展的良性互动的发展展望。\n\n关键字：能源; 理论化学; 基础技术; 应用\n\n\n\n\n\n目录\n\n1 引言\n\n2 能源物理化学的关键问题\n\n2.1 能源物理化学中的表界面问题和相关研究\n\n2.1.1 经典的表界面研究和其局限\n\n2.1.2 能源（材料）表界面的基本物理化学特性的研究\n\n2.1.3 能源材料表界面结构调控修饰\n\n2.1.4 适用于微纳尺度表界面体系和相关物理化学过程的新理论和新方法的发展\n\n2.2 能源化学过程中的理论问题\n\n2.2.1 均相热化学反应机理的理论研究\n\n2.2.2 多相催化理论研究进展\n\n2.2.3 光催化反应的理论研究\n\n2.2.4 煤转化过程的理论研究\n\n2.2.5 燃烧反应机理\n\n3 能源材料化学的理论研究\n\n3.1 材料制备中的关键技术和原理\n\n3.2 能源材料研究的理论研究\n\n3.2.1 材料模拟的问题核心\n\n3.2.2 复合材料表界面的理论模拟\n\n3.2.3 催化材料\n\n3.3 理论计算指导材料制备和研发\n\n4 中国的能源市场和研究领域\n\n4.1 我国能源结构和市场情况\n\n4.1.1 能源生产和消费情况\n\n4.1.2 煤炭利用技术\n\n4.1.3 可再生能源利用和新型电网技术\n\n4.1.4 面向未来的基础性技术\n\n4.2 我国能源基础技术理论研究领域现状\n\n4.3 前景和展望\n\n5 结论\n\n\n\n\n\n引言\n\n能源化学是能源学科和化学、化工甚至经济学、管理学等多学科交叉形成的一门新兴的关键科学。能源化学的研究主要目的在于提高能源利用效率和实现能源结构多元化，进而解决能源问题。中国科学院和国家自然科学基金委编著的《中国学科发展战略·能源化学》[1]将能源化学领域依据能源资源的不同和对能源体系和过程的支撑作用分为碳基能源化学、电能能源化学、太阳能能源化学、热能能源化学及能源物理化学、能源材料化学以及能源化学系统工程等多个三级学科。\n\n其中能源物理化学和能源材料化学是能源化学中基础性、原理性和前沿性的研究领域。能源物理化学和能源材料化学的研究自然是实现能源系统工程中许多技术性要求的重点，也是各类能源形式的基础原理所在。能源问题的解决仰赖于能源体系（包括能源系统工程和能源器件）的高效构建，其中包含的复杂的能源过程同样是取决于能源材料的开发、制备以及其功效的合理发挥。\n\n理论化学在能源材料的研究领域具有潜在的应用价值，在2011年出版，中国科学院和国家自然科学基金委所编的《未来10年中国学科发展战略·化学》[2]中，业已指出了能源和资源的清洁转化和高效利用应当将理论、实验和计算相结合，通过分子调控和优化系统集成形成新一代资源高效转化和环境友好的新理论、新方法、新技术。该书业已指出了“功能导向设计、合成、理论和方法”、“化学反应动态学理论与实验技术”、“面向复杂体系、以从结构到性能预测为导向的计算方法的发展与应用”等一系列涉及如催化机制、界面作用、材料结构性质计算预测等能源化学和能源材料领域关键问题的重点研究方向。我国在这一领域的研究成果尚属起步[1]，本文结合我国研究现状和实际需求，整理归纳了能源化学理论研究相关领域比较前沿的研究内容。\n\n能源物理化学的关键问题\n\n能源物理化学是能源化学中的一个重要组成部分，构成了整个能源科学领域所有应用、规划设计和前沿研究的基础。能源物理化学着眼于能源过程中的物理化学变化，针对能源科学关心的诸多理论问题进行研究和理论发展。\n\n能源物理化学中由于涉及很多的界面反应，因此能源物理化学中，表界面问题是一个重要的研究方向，同时，能源材料本身的功能性结构、纳米结构能源材料、半导体材料、复合纳米材料甚至是传统储能材料在能源化学过程中的过程理论问题同样是能源物理化学领域的重要理论课题。\n\n能源物理化学中的表界面问题和相关研究\n\n在物理化学中，涉及表界面的重要概念和理论有：表面张力、毛细现象、吉布斯界面模型、表面偶极、界面双电层理论、空间电荷层理论、表面润湿、范德瓦尔斯理论等。[1]表面化学相关研究领域业已有近十位获得诺贝尔奖的科学家。\n\n这些基础研究对于理解能源物理化学过程具有重要意义，并且随着能源科学和相关学科的发展，所涉领域的研究也呈现着新的发展趋势和特点。\n\n经典的表界面研究和其局限\n\n经典的界面模型一般讨论两“相”的共存边界，表面相是体系性质连续变化的一个过渡区域。同时，经典的相界面模型有吉布斯（Gibbs）相界面和古根海姆（Guggenheim）相界面模型两种（如图 2.1.1），这两种模型都是为了简化对于界面处物质不均匀分布的处理。\n\n图 2.1.1 吉布斯（Gibbs）相界面模型(a)和古根海姆（Guggenheim）相界面模型(b)：吉布斯相界面模型中没有“相界面层”，物质性质变化是突跃的；而古根海姆相界面模型中存在一个过渡区域。\n\n\n\n\n\n同时，表面化学中的三大公式[3]，即用于研究毛细现象的Young-Laplace方程式(2.1.1)、讨论表面曲率和蒸汽压关系的Kelvin公式(2.1.2)和讨论二元体系表面张力随组分浓度变化的Gibbs公式(2.1.3)：\n\n(2.1.1)\n\n(2.1.2)\n\n(2.1.3)\n\n其亦是建立在连续介质的宏观体系热力学角度的描述。\n\n此外，在界面双电层理论，不论是Helmhollz平板双电层理论或是Gouy-Chapman扩散双电层理论，抑或是考虑了离子半径修正的Stern双电层模型，其对于表界面电化学性质的理论阐述均是基于统计热力学或宏观统计规律的延拓，其在表面化学刚刚发展起来的一段时期，可以很好的解释表面物理化学的稳态过程，对于学界理解表面科学和相关应用研究的科学发展形成了相当重要的理论基础。[3]\n\n随着能源科学应用向着快速、大量和非稳态过程研究的进展，经典的理论已经不能解释精细化的、动态的、存在弛豫的、快速变化的很多前沿研究成果。同时，经典的表面物理化学研究对于动态过程，特别是如吸附、表面物种的迁移等的研究，更多的在于简单的单分子和表面的相互作用，相关的理论和实验手段还有很大的需求和发展空间。\n\n能源（材料）表界面的基本物理化学特性的研究\n\n当下，能源科学中，对于表界面物理化学的前沿研究主要缘于对于新型能源材料的开发需求，如纳米晶的自组装到从分子到材料表界面构建的过程，用于针对性构建具有特定要求的表界面结构，这类研究的跨度远远超过经典理论的解释范畴。\n\n微尺度表面的热力学和动力学性质研究\n\n能源材料的表面由于其存在的物质和能量交换，其原子层级的微尺度表面性质对于实际应用研究具有十分重要的意义。如Dongsheng Li等关于氧化铁纳米颗粒表面在溶液中的生长控制的取向因素的研究[4]，通过高分辨透射电镜指出了分子簇在纳米颗粒表面的取向附着和后续的相互作用与生长机制。Na Tian等亦通过方波电位进行形貌控制[5]实现了高指数面和高电氧化活性的四面体、六面体铂纳米晶的合成，并讨论了其微观机制和催化应用效果。\n\n事实上，对于不同的微尺度表面结构的热力学和动力学性质研究非常广泛，同时也有多尺度模拟和贴合实际应用条件的模拟研究，不过总的来说。这类研究的系统性仍有待进一步提高，这仰赖于计算能力、理论方法和研究技术的进一步发展。\n\n环境介质如气体吸附、液体环境、异质结的影响和电子态的调变作用\n\n为了实现对于具有特定要求的表界面的生成，需要研究从原子团簇性质、连续相物理化学性质到团簇和连续相界面相互作用、复合材料的实际反应性能表现以致于复合材料的反应动力学模拟等。目前由于理论计算能力的限制，研究中更多的会着眼于某一个关键过程的理论研究和对于全过程的各种因素的实验研究。\n\n如Vojislav R. Stamenkovic等[6]通过对比Pt3Ni(111)与Pt(111)表面的催化活性，利用表面敏感探针和DFT计算研究其在氧化还原反应中的结构敏感性、原子组成偏析分布和合金化对于表面化学性质的影响。他们的研究证实了表面电子结构性质特别是d-带态密度的结构敏感性。另外，J. A. Rodriguez等[7]研究了Au(111)表面上生长的CeOx和TiOx纳米颗粒在水煤气变换反应（water-gas shift reaction, WGS）中的不同活性，并研究了其反应机制。Qiang Fu等研究了限制在纳米尺寸基质中的配位不饱和亚铁（coordinatively unsaturated ferrous, CUF）位点，并通过表面测量技术和DFT计算证实了其在非均相催化反应中，有氧原子出现的反应机制。\n\n传统领域的物理化学研究主要是基于刚球模型和宏观周期性体系，这些理论无法满足解释纳米尺度和动态变化特征的能源化学过程的需要。[1]同时，当前的能源科学研究中对于表界面问题的阐述正处于单一维度到多维度、静态到动态、模型体系到功能器件过渡的时期。[1]当前对于理论计算模拟的需求进一步增加，同时也对于系统性的理论模型和研究技术提出了更高的要求，因而适应新的能源科学研究的理论和研究方法的开拓就成为了能源物理化学进展的关键问题，并将影响到未来能源科学应用的发展，具有举足轻重的地位。\n\n能源材料表界面结构调控修饰\n\n能源材料与其他材料的一大不同就在于其表面具有特殊的纳米级功能化修饰组织，同时由于能源材料在实际应用中更多的进行多个不同组件结构的组合使用，材料会和反应介质接触，产生新的物理化学特征，因而要考虑和环境介质的相互作用。\n\n在材料表界面结构修饰中，尤为重要的是在固体表面上进行纳米结构的生长、表面的合金化和表面的纳米化等，如铝合金表面的纳米晶化与其生物相容性的研究[8]、非晶态金属合金生成时的纳米晶化机制[9]等。这类研究均指出了材料表面结构调控修饰的重要微观机制原理，在能源科学的研究中，具有重要的基础理论意义。\n\n适用于微纳尺度表界面体系和相关物理化学过程的新理论和新方法的发展\n\n为了能够更充分地研究非平衡转化、表界面体系的多尺度方法和电子激发与动力学衰减过程等能源科学领域越发关心的问题[1]，在传统的理论研究和计算化学研究的基础上，发展包含时间、温度、压力等能源科学关心的环境参数的新的理论研究方法[1]和简便易行有效的新模型也是未来的研究重点。\n\n能源化学过程中的理论问题\n\n均相热化学反应机理的理论研究\n\n研究范式\n\n传统的反应机理研究中主要是以物理化学实验手段推测反应相关物种在反应过程中产生的中间体或过渡态等，并讨论电子效应、立体效应、取代基效应、溶剂化效应等对于反应的动力学、热力学、决速步骤、立体或区域选择性的影响。常采用动力学测定、中间体捕捉和同位素方法等，近年来又发展出了原位检测和实时光谱分析等方法。\n\n通常情况下，基于理论和计算化学确立反应机理的正确过程如图 2.2.1所示。\n\n图 2.2.1 基于理论与计算化学确定正确反应机理的过程[10]\n\n\n\n\n\n正如《中国学科发展战略 理论与计算化学》[10]书中指出的，传统的反应机理研究中，存在着无法给出多步反应的完整势能面、无法给出高活性反应中间体的结构信息、无法明确各种选择性与反应途径能量及过渡态结构间的关系、无法判断多种可能反应途径中能量合理的反应途径以及可能无法用实验解释无法实现或未实际发生的反应途径等问题。\n\n研究现状和相关进展\n\n在反应机理研究中，尤为重要的是考虑到所有可能反应路径中，各个势能面的误差控制，因而对于计算化学的精度提出了更高的要求。由于在较大分子体系的模拟中，色散矫正具有重要的影响[11]，因而以此为代表的含色散矫正的DFT-D方法[12]获得了广泛应用，未来应有更多的更精确的计算方法被发展出来用于复杂体系的研究。\n\n在溶剂模型的处理中，目前广泛使用的是极化连续介质模型（polarizable continuum model, PCM），其以溶剂的介电常数作为一个重要参数进行处理[13]，相应地也忽视了对于溶剂酸性、碱性、极化性等参数的考量，Claire S. Adjiman等[14]通过多个参数的拟合，实现了对于溶剂反应的更准确地描述和反应的优化。\n\n前景\n\n对于能源化学，由于大量的化学反应的存在，如能从理论上理解包括均相催化、含能物种的变化、溶剂对于实际使用的影响的具体细节，对于能源科学的研究可以提供相应的理论依据，并可以进一步协助需要调控相关反应性质和解决副反应问题等的实际应用研究。\n\n考虑到计算化学在反应机理的研究中业已取得相当的重要进展，如能实现对于应用尺度下能源化学问题的解决，并将理论与实验良好的结合，则将有力地推动化学理论、应用化学和化学工程等向依托规律设计和按需研究的方向发展。\n\n多相催化理论研究进展\n\n在能源科学中，有包括但不限于催化氢化、催化裂解、催化重整、水煤气生成、光敏化电池等的应用了多相催化技术，并对于催化剂的研发有着越发重视的需求。\n\n结构-性质关系\n\n一般认为在多相催化中，催化剂发生作用是依赖于其界面处的活性位，而这些活性位在理论上通过对于负载金属纳米粒子被近似为静态的多晶颗粒并含有晶面、边角、台阶和纽结等多种表面结构，并可以对这些具有特点的表面结构进行独立的研究。研究可以从实验研究和理论模拟两个角度认识纳米粒子的催化活性，不过在模型中，表面原子组成、排列方式、配位数等原子结构特征都会影响到特定催化反应的活性和选择性，而且对于不同反应机理，其影响有较大差别。\n\n结构和性质关系的研究中，研究最广泛的是过渡金属，包括讨论费米能级处的态密度对于催化活性的影响、d带中心理论、几何结构敏感性反应、催化剂形貌等。同时通过理论计算，帮助了从原子尺度上了解多相催化中催化位点的电子性质、几何性质对于催化反应中分子活化过程的理解。\n\n催化剂设计的理论依据\n\n多相催化中的BEP关系(Brønsted-Evans-Polanyi relation)就是通过大量的DFT理论计算，分析一系列催化基元反应获得证实的[15]，其是一种热力学判据，表明物种的吸附能和反应活化能间存在着线性关系。同时BEP关系反映出表面反应过度态结构与反应终态非常接近，过渡态能量由反应终态能量决定的定量规律。[16]\n\n应用BEP关系，可以进行如合成氨的催化剂的筛选[17]、乙烯加氢反应的催化剂筛选[18]等，值得注意的是，在这些工作中，所进行的筛选工作是先于实验的预测，这正是未来的能源类催化材料所期待的一种研究模式。将DFT理论计算得到的数据和微观动力学模型良好的结合，可以使研究应用材料的工作更加具有系统性和实际意义。另外，基于此类数据分析工作的大数据平台和化学信息学也有一定进展，将在3.3节介绍。\n\n固液界面催化的理论方法\n\n常见的固液界面会存在界面双电层，经典力学在处理固液界面时，采用点电荷和球形模型模拟溶液一侧[19]，采用硬球和软球模型模拟固体界面[20]；同时也有正则蒙特卡洛（canonical Monte Carlo）[21]、Wertheim-Lovett-Mou-Buff(WLMB)积分方程[22]、修正的泊松-玻尔兹曼方程（modified Poisson-Boltzmann）[23]和分子动力学（molecular dynamics）[24]等，都可以用于研究和描述固液界面的动态结构和双电层结构等。\n\n光催化反应的理论研究\n\n在能源科学中，光催化反应出现在光分解水制氢、二氧化碳转换等技术中，目前光催化反应主要使用金属配合物和以二氧化钛为主的半导体作为催化剂。\n\n光催化过程中所涉及的材料激发态性质是传统的Kohn-Sham方程本征值所不能描述的，而且也是对于交换关联作用进行了近似的DFT有极大误差的部分，一般采用Hubbard参数U[25]进行处理，不过也存在争议，而在LDA交换能中引入Hartree-Fock交换成分构建的杂化泛函可以改善计算结果，不过结果也依赖于HF成分的多少。此外，格林函数的GW近似方法[26]及其多体微扰理论可以较好地实现光催化过程中材料能级性质的计算，不过其往往存在非自恰和计算量过大的问题，限制了在比较大的体系上的应用。\n\n在实际的光催化理论研究中，往往采用分子动力学和蒙特卡洛研究催化材料表面的结构和界面作用特征，然后以DFT计算复合体系的电子结构特征和几何特征，最后通过多体微扰理论格林函数方法得到体系的光学性质和光生载流子产生分布图象，可以良好的描述光子-电子、电子-电子和电子-声子相互作用。[10]\n\n煤转化过程的理论研究\n\n在煤化工催化过程中，CO的高效转化和利用是核心，通常采用Fe、Co、Ru作为费托合成（Fischer-Tropsch synthesis, FTS）的主要催化剂。[27]其中Fe基催化剂由于价廉易得tngshi 有较高的水煤气变换反应活性而成为了广泛使用的催化剂。\n\n费托合成的机理\n\n图 2.2.2 复杂费托合成示意图[1]\n\n\n\n\n\n第一种机理是表面碳化物机理[28-30]，即反应物CO与H2均是以解离吸附存在于催化剂表面，反应生成CH2进而结合或互相插入实现碳链延长、链终止获得烷烃或烯烃，不过这一机理不能解释含氧化合物的生成。同时有烯醇机理[31]，这一机理中CO是分子态吸附，并与解离吸附的H原子结合生成HCOH，进而聚合脱水或继续加氢脱水等，其以加氢链终止得到烷烃或烯烃，烯醇机理可以较好地解释反应中含氧产物的生成，但尚无确凿证据证实这这个机理的部分细节。此外还有CO插入机理[32]，是由CO插入到M-H键中形成醛，进而加氢得到CH3，由CO继续插入到M-C键中实现链增长，这一机理的存在需要更多证据的支持。一般认为在真实的反应中，以上机理应当同时存在，如在Fe5C2(001)表面，碳化物机理和插入机理是共存的[33]。\n\n煤转化的催化剂理论设计构想\n\n对于煤转化反应有很多的催化剂理论设计研究工作，并且大都可以基于DFT进行计算[34-37]研究特定的催化剂和反应条件的实际效果，提出了很多具有实际意义的模型，成熟的反应机理研究模式已经建立，并可以解决应用中遇到的部分实际问题。不过需要指出的是，由于这类转化涉及到的反应体系和计算方法的限制，有很多的研究存在系统性缺陷，阻碍了实验-理论的对比参照，这也是DFT研究的传统问题。如想实现系统化的煤转化催化剂设计，基于现有的大量实验数据和理论计算结论，整合实现实验和理论研究的相互印证不仅具有理论价值，并且由于工业的一定需求，也具有其他研究不具备的经济可行性。另外，建立作用机理和理论计算的数据系统和数据库，形成标准化的计算和理论分析，将极大的帮助当前理论研究和催化剂设计筛选的有序研究，可参照3.3节的部分内容。\n\n燃烧反应机理\n\n燃烧过程作为能源科学的一个传统课题，从微观机理到宏观燃烧热流的研究对于包括航天航空工业在内的很多重要尖端工业技术领域有着重要意义，燃烧反应的机理作为燃烧理论的基础，相关研究可以视为一切研究的基石和未来研究的突破口，限于燃烧反应的复杂性和计算能力、模型适用性的限制和进来相关理论计算领域的进步，燃烧过程的理论研究有着新的潜力。\n\n燃烧过程的基元反应研究\n\n传统上，燃烧过程的模拟需要使用半经验计算的热力学和动力学数据，然后通过几类烃物种的替代燃料代替实际燃料，结合动力学实验数据验证反应类型和机理分级结构构建的替代燃料组分的详细机理。\n\n燃烧模拟中所使用的热力学参数不仅是模拟的关键参数，同时关系到反应速率的准确性，即是通过热力学平衡计算得到逆反应动力学参数。常用的热力学数据库或手册有Ruscic提出的基于主动热化学表[38]（active thermochemical tables, ATcT）的数据库、CRC化学物理手册、NIST热力学数据库等。同时也有使用高精度从头计算方法构建小分子燃烧的精确的热力学数据库[39]可以作为基准数据应用到机理研究中。\n\n而动力学计算，即主要是速率常数的计算，都依赖于势能面的计算，而势能面的计算中，精度，特别是多参考态的反应的计算是计算的难点，同时速率常数的计算还受到配分函数的谐振子近似的误差，特别是在高温条件下非谐振效应的影响以及低温时隧道效应的影响。[1]\n\n在复杂燃烧反应的机理研究中，即替代燃料组分的详细机理过程这方面的研究中，通常希望计算机程序自动生成完整的基元反应和中间物种，如可用于550~2200K条件下的烷烃、烯烃、环烷烃、醚、醇和酯的EXGAS程序[40]。\n\n燃烧反应的分子模拟\n\n由于燃烧反应模拟中所涉及到的分子体系的复杂性，量子化学计算尚不能得到可靠而完整的反应体系势能面，因而能够快速有效处理较大体系的分子力场方法成为了燃烧反应分子模拟的重要方法。其中ReaxFF力场[41, 42]通过计算由键长、键角、二面角、共轭、库伦、范德华和矫正项为参数的复杂函数得到原子间相互作用，可以实现周期表中一半以上的元素的通用反映立场参数，用于高温（3000K以上）条件下燃料在纳秒级时间内点火的模拟，尚不能实现真实条件（约1200K）下毫秒级时间尺度的模拟。随着计算技术和数据精度的进一步发展，燃烧反应的研究有可能最先实现实时应用层级的模拟和实验-理论有序结合。\n\n能源材料化学的理论研究\n\n能源材料化学的研究主要涉及能源材料的合成、制备和其高效利用。《中国学科发展战略·能源化学》[1]一书从新材料制备的角度，提出重点发展的研究方向包括功能介孔材料的制备、金属纳米结构的制备、二维半导体材料的制备、复合纳米结构的制备；本节关注材料结构和性质的关系，主要基于材料领域从理论模拟到指导实验的方法，综合叙述能源材料化学中的相关理论和原理的研究进展。\n\n材料制备中的关键技术和原理\n\n在材料制备中，特别是涉及到能源化学物理过程的催化表界面过程中，有大量基于结构和机理导向的纳米结构催化剂的设计。同时因为可再生能源的发展，大量基于新的原理的催化剂仍在不断地被设计出来。[43]\n\n在用于前沿催化过程的纳米界面设计工程领域，Zhi-cheng Zhang等[44]总结出了金属-氧化物界面合成中的尺寸影响、支撑类型、分布、多金属连续层等的影响，以及金属核壳结构、异质结构催化剂，和金属-碳化物/硫化物/氮化物复合催化剂等的合成与应用，并分析了在纳米碳管等限制性空间架构中金属的催化作用和合成明确分界物质界面的方法。可以确信的是，在催化材料的研究中，不同材料和相的界面间的相互作用对于催化过程有着重要的影响。这种影响包括电子传递、异质结生成和活性位点等。\n\n能源材料研究的理论研究\n\n材料模拟的问题核心\n\n《中国学科发展战略: 理论与计算化学》一书中，总结了材料科学对理论计算化学的挑战[10]，包括了复杂体系结构预测、材料功能定量且可靠的微观机制、材料生长的微观机理与动态演化三大问题。\n\n复杂体系结构预测的核心在于多维势能面的准确分析，基于量子化学和统计力学，已经发展出了拓扑模拟、数据挖掘、随机取样、模拟退火、遗传算法等一系列高自由度体系分析的方法，其核心都在于加速取样以减少因为过多的单点能计算引起的耗时。而对于复合材料、界面体系、介孔材料和分子自组装体系，因为其非共价相互作用、缺少结构周期性的困难，尚不能应用结构搜寻方法减少预测时间。\n\n而功能材料预测的微观理论领域，在材料对于力、热、光、电、磁等外场的响应中，材料电子结构的模拟，特别是激发态、散射/弛豫等的演化和响应正是材料性能预测的主要手段。具体到应用上，这方面有有机分子电致发光效率的提升、钙钛矿太阳能电池能量转换效率的提升和低热导高电导的热电材料的设计等。\n\n在材料微观生长机理和动态演化领域，由于模拟手段无法涵盖整个生长过程，因而基于第一性原理计算的模拟方法很难实现对于材料生长反应过程的完整预测，因而需要的是自洽的多尺度耦合理论方法，以合适、合理的模型研究材料生长过程，并获得完整的基于第一性原理的精准描述，进而结合数据挖掘和控制优化等方法实现对于生长方案的理论设计。\n\n复合材料表界面的理论模拟\n\n表界面分子及分子聚集体的电子结构\n\n在表界面电子结构的计算中，主要使用簇模型(cluster model)和周期性表面模型(slab model)处理。如研究原子氢在簇模型石墨表面上的吸附[45]使用了近似的晕苯（C24H12）作为替代石墨（0001）面的模型，类似的近似对于其他体系也适用，不过存在误差，并且因为忽略了除了簇原子以外的作用，会产生局部固体电子结构的定域化，无法获得准确的周期性性质。\n\n而周期性表面模型可以用于如α-Al2O3的（0001）面的性质计算表征[46]及Pd（111）表面上C、N、O原子的结合状态的研究和其上的水分解反应[47]。不过这种模型没有充分考虑材料表面的缺陷、皱褶、相对滑移的存在。\n\n此外，表界面处的电荷分布和极化作用的理论描述，对于如有机太阳能电池等的有机分子高度无序界面的描述也有进一步发展的需求。\n\n表界面分子组装、多孔材料的模拟\n\n自组装作为包括成膜材料、功能分子、胶体、陶瓷等在内的分子工程技术的一个重要构建基础，理论计算模拟可以使研究人员在构建自组装体系时减少盲目探索，更多地进行结构和性能关系的理解。而自组装体系中理论计算研究的难点在于精准描述分子间作用力并良好的处理溶剂的影响，并要综合考虑动力学稳定性的动态过程。对此，通常使用粗粒化模型进行简化，减少其作用中心以实现更广的采样计算，具体的方法模型有如MARTINI粗粒化力场方法[48]、反向玻尔兹曼方法[49]、多尺度粗粒化方法[50]等。\n\n催化材料\n\n在催化材料化学性质研究中，通常着眼于在催化材料的活性中心处，底物分子和活性中心的电子结构和性质计算，目前广泛采用密度泛函理论研究相关的热力学和动力学性质。不过由于材料研究的复杂性以及计算能力的限制，在新的材料研究理论和计算方法的研究中仍有进一步发展的空间。[10]\n\n总体上，根据技术原理和应用范围的不同，材料研究的计算方法可以分为基于材料数据信息系统的预测、基于计算材料学理论的模拟方法两大块。前者是基于实验或模拟研究的大量数据生成的数据库，通过专家系统等人工智能技术进行数据挖掘等预测，其依赖于大量的数据积累。而后者在材料的不同尺度上又有着不同的计算方法。\n\n在计算材料学中，根据研究对象的尺度大小，可以分为纳米尺度（纳观尺度）、微观至介观尺度、介观至宏观尺度等。其中在纳观尺度和微观尺度更注重对于材料化学性质的研究。如在纳观尺度上，常用第一性原理计算方法（包括Hartree-Fock自洽场方法和密度泛函理论方法），特别是密度泛函理论处理研究涉及过渡金属的材料电子结构和性质关系，但其对于计算能力的要求较高；而基于经验模型的分子动力学方法常用于处理至多数万至数亿个原子在纳秒量级上的动态变化过程。[51]由于能源物理化学过程涉及更多的在微观到介观尺度的变化，因而结合经典力场、粗粒化模型和连续介电等模型的多尺度计算方法和计算谱学方法的发展，更有实际的重要性。[1]\n\n另外，在材料工程科学研究中，常见的理论计算方法包括Monte Carlo法、分子动力学方法、元胞自动机方法和有限元方法，主要研究着眼于材料在不同尺度下的力学、机械性能等。[52]本节虽然着重讨论了能源材料的化学性质的研究方法，但如果要使能源材料理论研究能在实际工业应用中发挥作用，就需要更多地考虑材料工程科学方面的计算方法，充分考虑材料应用时的宏观实际物理和化学条件，特别是化工生产中涉及机械作用的工况。\n\n理论计算指导材料制备和研发\n\n按照《未来10年中国学科发展战略·材料科学》的描述[53]，材料科学按照学科特点可以分为材料设计与计算模拟、材料制备与加工、材料结构与相变、材料结构—性能关系和使役行为四个领域。材料计算与计算模拟指的是从20世纪90年代开始的，从相变设计、微力学设计、纳米设计、量子设计等不同层次的材料设计。而且在材料科学的四个领域中，计算模拟的手段都各有侧重，将共同助力材料研究的深入探索与研发。\n\n在《未来10年中国学科发展战略·材料科学》[53]中，指出了从“材料成分、结构与性能”、“制备加工过程与工艺设计计算模拟和设计”到“材料使役行为的计算模拟与寿命计算预计”的计算材料学研究发展态势，同时指出了我国发展计算材料学需要着重发展高效多层次高精度第一性原理计算方法、交叉功能材料的计算探索仿真和新型有机功能材料模拟和计算设计、材料成形加工的多尺度计算模拟仿真、复杂使役条件下材料损伤演化和寿命预测以及材料数据库与知识库等优先支持的研究方向。\n\n需要指出，在世界范围内，使用计算机等信息科学工具进行材料研究已经是比较普遍或者说十分具有前景的，比如用于材料性能计算的分布式大数据分析平台pymatgen[54]等。\n\n中国的能源市场和研究领域\n\n在2007年，中国占世界20%的人口，而消费了世界16.8%的能源，并创造了世界19.8%的GDP总量，而中国的目前人均能源消费和人均GDP仍低于世界平均水平，并处于高度依赖能源的发展阶段。中国同时也面临着来自于多方的的能源资源威胁论：一些国家对中国的国际能源活动横加阻拦，国内也有一些学者妄自菲薄，认为中国是一个能源极度浪费的国家，认为应当通过节衣缩食解决能源问题。好在已经有不少能源著作开始用科学的态度正视中国的能源问题，客观评估未来能源趋势。[55]我国的能源结构主要呈现着结构依赖煤炭，新能源蓬勃发展，清洁能源份额逐步扩大等特点。\n\n我国能源结构和市场情况\n\n能源生产和消费情况\n\n能源生产\n\n2016年，我国能源生产总量为346000吨标准煤，其中原油和原煤比重继续下降，天然气、一次电力和其他能源比重继续上升。（见图 4.1.1）而根据国家统计局的数据，2017年中国能源消费总量为449000万吨标准煤。我国的能源供给仍然需要大量进口。\n\n我国煤炭资源储量丰富，然而煤炭资源分布不均、地质赋存条件复杂、煤炭的科学合理的生产能力受到多种因素制约，《中国能源中长期（2030、2050）发展战略研究》指出[56]，考虑安全生产、水资源和生态保护等硬约束时，我国可能形成的安全高效的科学产能最多在29亿吨左右，考虑运输制约时将不到25亿吨，如果只考虑安全和机械化约束则可能达到35亿吨左右，其亦指出建议合理产能控制在30亿吨煤炭之内，远期以25亿吨为好。而对于我国可采石油资源量，比较有把握的估计为150亿吨，并还有油页岩油、油砂油等非常规石油资源。[56]然而我国的石油产量难以大幅度提高，主流意见是以低于2.3亿吨为佳，并应略低于此值。由于我国的石油资源赋存条件较差，开发生产成本普遍偏高，因而在现有国际油价较高水平下我国的石油开发生产尚有充分的投资条件，然而若国际油价回落，我国的石油产量将受到较大挑战。我国的天然气资源和石油资源大致相当，而我国今后的天然气产能还可以继续提高，并且具有较好的价格竞争力。[56]在水电、核电等领域，重要的制约因素是环境影响的验证研究和价值判断，风电和太阳能发电领域的输电调度费用是成本中可以进一步降低的部分，充分的政策支持可以推动这些领域的发展。而在生物质能和其他可再生能源的开发供应中，由于受到多种条件制约，不确定性较大，一般作为远期的可能替代能源进行研究储备。\n\n\n\n\n\n图 4.1.1 我国能源生产结构（截至2016年，数据来源：国家统计局《中国统计年鉴2017》）\n\n\n\n\n\n在能源生产领域，由于生态环境的诉求，未来中国的能源结构将更多的朝着环保、清洁、低碳化发展，煤炭和石油消费占比将逐渐降低，但短期内煤炭作为中国主题能源的地位难以发生重大转变，因而要更多地发展煤炭情节开发利用技术，如煤直接液化、煤间接液化和清洁煤技术领域等。对于我国尤为重要的是技术落后、资金投入不足、政策支撑保证等的解决。[57]其中技术领域除了基于现有生产条件的进一步优化改良，还有开发新的生产条件工艺，这就与能源物理化学的研究密切相关，并具有长远的社会和经济效益。\n\n能源消费\n\n\n\n\n\n图 4.1.2 我国能源消费结构（截至2016年，数据来源：国家统计局《中国统计年鉴2017》）\n\n\n\n\n\n2011年出版的《中国能源中长期（2030、2050）发展战略研究：综合卷》[56]指出，我国要想保持长期的经济发展，必须解决相关领域的重大协调问题，特别是能源消费模式。该书给出了能源消费总量还将明显增加、需要用创新的观念和实践探索开拓新的能源消费模式、转变发展方式将十分急迫、我国基本国情决定了必须提高能效四个重要判断。\n\n未来，我国的能源经济还将随着城镇化的进一步推进，人民生活水平的提高，在居民生活建筑用能、交通运输用能等方面呈现快速增长，同时我国高耗能工业的增速将不断放缓，水泥、钢铁和有色金属等都将在2020年前后达到峰值，纯碱、烧碱、乙烯等化工原材料将在2030年前出现峰值，同时鉴于节能技术和管理的发展，我国的工业能源消费有可能实现趋零增长。\n\n小结\n\n由我国的能源结构可以看出，我国的能源结构业已逐步开始变化，清洁能源比重不断上升，原油的煤炭的需求稳定，其在总的能源结构中占比减少。同时应当指出，我国的社会经济运行体制决定了，我国的能源产业发展应当更多地考虑到整个系统运行的鲁棒性控制，而不同于欧美国家更倾向于在新型能源方面的“开源”，我国的能源产业发展更多的应是在已有的能源结构上，对于现有能源来源进一步优化和结构调整，提高能源的利用效率，即“碳效率”。\n\n而在我国能源战略[58]中，为了深入推进能源革命、推动能源生产利用方式变革、优化能源供给结构、提高能源利用效率、建设清洁低碳安全高效的现代能源体系和维护国家安全，需要利用新技术和对已有技术的继续改善以推动能源结构优化升级，同时统筹能源网络建设、推进能源和信息领域新技术融合并与交通通信等基础设施网络建设统筹发展并建成能源互联网。“十三五”规划在能源技术和基础研究方面，提到了智能电力系统、煤炭清洁高效利用、可再生能源（风电、光伏）、核电、非常规油气、能源输送通道、能源储备设施、能源关键技术装备等能源发展重大工程。下节从不同角度作简单介绍，并考虑理论计算的作用，稍作分析，希望可以作为未来产业发展的参考。\n\n煤炭利用技术\n\n超临界水煤气化作为煤炭清洁利用的重要技术，其在我国的煤炭清洁利用中具有重要意义，而超临界水煤气化过程由于其可以解决包括环保、分离和联合发电等一系列问题而具有广泛的应用前景[59]，特别是西安交通大学动力工程多相流国家重点实验室主持的“煤炭超临界水气化制氢和H2O/CO2混合工质热力发电多联产基础研究”项目[60]，为这方面技术的应用转化提供了示范。\n\n整体煤气化联合循环（integrated gasification combined cycle, IGCC）技术，是实现煤电厂碳减排和污染处理的一项重要应用，柳康等的研究[61]依托于华能（天津）265MW级整体煤气化联合循环发电系统（IGCC）示范电站，针对IGCC技术中的低温耐硫变换系统、低温耐硫变换系统、PDS法硫回收系统进行了理论分析和系统工艺建模，并指出当产品为液态 CO2时，CO2捕集能耗为4.30GJ/t CO2，液态CO2成本约为341元/吨，当氢气增值为0.8元/m3（标况下）时，装置即可盈利。\n\nIGCC和超临界技术是在我国煤炭清洁利用工业技术中重要的两个技术，其着眼于实际应用进行的技术研发和理论分析等，对于我国煤炭能源利用效率的提升具有重要意义。以上引述的实例中，并没有体现到基于传统意义上的计算化学的应用。但应当指出，我国当前的技术结构并不支持从微观到应用生产这种大规模的技术应用研究，不过上述研究中的确存在有应用基本的计算化学研究成果的内容，如在其理论分析中就应用到了可由燃烧和多相反应热力学计算的平衡信息，进而建立完整的物料和能量平衡模型等。\n\n尽管基于宏观的工艺生产处理对于目前的市场和技术需求业已足够，不过未来如果要实现对于煤炭的更精细化利用、或是对于化工生产过程中某些关键催化技术或材料的改进研究仍需要通盘考虑从理论计算到工业级应用的联合。\n\n可再生能源利用和新型电网技术\n\n太阳能发电技术\n\n高效晶硅太阳能电池发展的瓶颈在于其光衰的提高，光衰主要源于直拉单晶硅中少数载流子寿命的降低，在硼掺杂的直拉单晶硅中，这种少子寿命随时间的衰减现象更为明显，其与氧的一种亚稳缺陷密切相关，掺镓单晶硅技术是解决光衰并避免单晶利用不足的重要基础。[62]在薄膜太阳能电池的研究中，严辉等[63]通过银掺杂的铜锌锡硫薄膜太阳能电池吸收层实现了对于薄膜的瞬态光电流密度与稳态光电流密度的提高。太阳能电池硅片的等离子增强化学气相沉积法（PECVD）是太阳能电池片生产中的一种重要成膜方法，如东方日升新能源股份有限公司[64]和应用材料公司（美）[65]的相关专利技术分别用于SiN膜和P、B掺杂Si镀膜的生产应用。而以上应用技术研究中更多的是实验研究，可以发现其均有运用理论化学计算数据进一步细化研究的潜力。\n\n生物质液体燃料制取和利用技术\n\n由水蒸气重整生物油制取的生物油合成气，用费托合成法直接合成洁净液体生物油燃料的研究[66]指出，在300℃，1.5MPa的典型反应条件下可以实现36%的碳转化率和44%的C5+选择性，其研究中使用了MgO负载的C12A7-O-催化剂。而在生物油的转化中，浙江大学清洁能源利用国家重点实验室使用超临界技术、烘培预处理、相关锅炉研究开发和秸秆CFB项目建设进行的生物油制取高品位液体燃料技术和燃烧发电[67]对于我国生物质资源的开发利用具有重要的示范意义，与此相关的环境影响亦有一定研究[68]。上述实例中，涉及部分催化剂和前述章节中的燃烧反应基础理论，可以进一步与相关研究整合加强通用性的技术建设和系统化理论的形成。\n\n面向未来的基础性技术\n\n新型可再生能源转化概念和技术\n\n本节简述我国研究人员关于微藻热解和天然气水合物开发二例。微藻与传统的纤维素生物质相区别的，其进行热解制备液体燃料甚至可以通过生物技术控制培养条件提高脂类含量以实现高的产率和高品质的热解油。[69]而通过如水热、醇解、热解、氢化热解等不同反应条件的选择，也可以获得不同组成和产量的热解油。[70]在天然气水合物开发中，我国基于能源安全的考虑，进行了可燃冰开采的技术尝试和攻关，勘探技术和测试分析技术业已比较成熟，但全世界范围内可燃冰开采仍不具备经济价值[71, 72]，不过这一领域的研究起步较晚，值得注意的是其中有用于开采模拟和风险控制的计算模拟软件系统，尽管这种软件系统并非是化学理论软件，不过应当注意到其表明当前技术研究对于模拟软件重要地位的判断。\n\n基础科学\n\n除去基于量子化学原理和化学信息学的统计分析技术理论，如要保障这些基于信息科学的技术高效运行和服务于经济社会发展，就需要发展超算、分子设计理论和应用程序和相应的信息处理计算理论的体系建设。尽管如此，需要指出，本文立足于化石能源、新能源等可用于提供能量，但并不抵触其作为化工原料的重要用途，而且事实上，将包括化石能源在内的能源物质用作化工原料更符合其利用价值，纯粹的能源应当是包括光伏、热电等产生的电能，以及期待在未来出现技术突破的核聚变技术。\n\n我国能源基础技术理论研究领域现状[1]\n\n我国能源产业的发展仰赖于由国家能源局设立的一系列国家能源研发（实验）中心，涵盖了核电、风电、高效发电、输电、煤炭清洁转化与利用、能源勘探与开发、设备材料以及能源装备等能源重点行业和领域，也有跨学科、单位的协作大平台如大连洁净能源国家实验室、中科院广州能源研究所、中科院青岛生物能源与过程研究所、中科院北京纳米能源与系统研究所等。根据国家能源局2018年预算[73]，在科学技术支出中，即科技重大项目中的支出为70464.03万元。而我国的能源化学教育方面和国际通行一样，均缺乏系统性的人才培养体系，没有能源化学专业化的人才培养。同时我国的能源化学技术转移和产业化更多的以技术供给方驱动为主，如专利权人的知识产权许可和技术合作开发，而不同于美国、欧洲和日本的委托研发和合作开发模式，一定程度上存在技术人员追求技术先进性而忽视技术产业化的问题。\n\n前景和展望\n\n在“既要金山银山又要绿水青山”的环境友好型社会发展的需求下，我国的能源结构和能源化学也许要充分考虑国际贸易中的碳减排压力和提高“碳生产率”，以提高我国在走向贸易大国过程中的国际竞争力。研究[74]指出我国提高碳生产率的关键在于制造业的规模经济化、技术创新、行业升级、能源结构优化和差异化的推进不同行业的政策发展。\n\n值得注意的是，在能源科学的技术研究中，大量企业在市场需求和技术进步的推动力下，所需进行的理论研究需求十分活跃，我国正处于经济结构调整和产业结构升级的关键时期，结合中国制造2025计划、创新驱动国家战略的背景，期望更多的政策和技术管理工作能注重于将高校和研究机构中的创新创造潜力，特别是理论研究力量整合起来，专注于某些特定方向的实际前景应用，打通从理论到实际技术发展的研究工作和应用有机循环，形成类似于以产业养研究的良性发展，保持这类研究成果转化中研究人员和应用技术转化人员的合理比例和良性互动，并依托于市场导向和政策前景及时推进技术改革，保障技术储备和促进经济转型，实现良好的社会效益。\n\n另外，需要指出的是，要想实现能源科学领域的技术革新和产业升级，着实不是某个工程行业或高等教育行业通过鼓励技术研发就可以实现的，要实现整个国家的能源技术升级和可持续发展，要全面地鼓励科技创新、增加教育投入这类基础设施的建设，根本上要解决的是我国经济发展对于低成本人力资源、环境和能源资源的依赖而转向技术和科技附加值增长，这就更加需要着力发展理论研究和提高基础学科水平，实现技术储备和研究人员、技术人员的持续发展。\n\n结论\n\n本文浅述了和能源化学理论研究有关的关键理论、技术和应用进展，结合我国能源形势和研究、政策、产业发展现状，以及展望新的形势下我国能源科学和能源产业发展的趋势和动向，指出我国能源科学的持续健康发展需要整体政策设计的考量，要综合科技、教育、政策和基础设施建设等多方面的努力。结合能源化学理论研究的基础意义和我国能源技术的发展需求，指出要逐步引导技术储备的产生和人才力量的支持，发挥日趋重要的理论研究在产业发展中的重要作用，并适时整合相关企业和研究机构在市场需求和技术储备的发展，保障产业和研究的对接，促进研究和产业发展的良性互动。最后需要指出的是，我国对于比较接近纯粹的理论计算的需求看似尚不迫切，但这种基于基础理论的研究，特别是系统化的理论体系和生产应用对接机制的建立，在整个世界的科学体系中尚是初露矛头，仍需要相当长时间的研究努力，在信息科学、计算机科学、物理学、管理学甚至传播学的研究中都有其问题存在，一旦有所突破，将极大地促进社会生产力的发展进步和相关的环保、服务产业和信息资源产业的综合发展。\n\n\n\n\n\n\n\n\n\n参考文献\n\n\n\n\n\n[1] 国家自然科学基金委员会, 中国科学院. 中国学科发展战略·能源化学[M]. 北京: 科学出版社, 2018.\n\n[2] 国家自然科学基金委员会, 中国科学院. 未来10年中国学科发展战略·化学[M]. 北京: 科学出版社, 2011.\n\n[3] 王中平, 孙振平, 金明. 表面物理化学[M]. 上海: 同济大学出版社, 2015.\n\n[4] LI D, NIELSEN M H, LEE J R, et al. Direction-specific interactions control crystal growth by oriented attachment[J]. Science, 2012, 336(6084): 1014-1018.\n\n[5] TIAN N, ZHOU Z Y, SUN S G, et al. Synthesis of tetrahexahedral platinum nanocrystals with high-index facets and high electro-oxidation activity[J]. Science, 2007, 316(5825): 732-735.\n\n[6] STAMENKOVIC V R, FOWLER B, MUN B S, et al. Improved oxygen reduction activity on Pt3Ni(111) via increased surface site availability[J]. Science, 2007, 315(5811): 493-497.\n\n[7] RODRIGUEZ J A, MA S, LIU P, et al. Activity of CeOx and TiOx nanoparticles grown on Au(111) in the water-gas shift reaction[J]. Science, 2007, 318(5857): 1757-1760.\n\n[8] HUO W T, LIN X, YU S, et al. Corrosion behavior and cytocompatibility of nano-grained AZ31 Mg alloy[J]. 2019, 54(5): 4409-4422.\n\n[9] KIM J-J, CHOI Y, SURESH S, et al. Nanocrystallization During Nanoindentation of a Bulk Amorphous Metal Alloy at Room Temperature[J]. 2002, 295(5555): 654-657.\n\n[10] 国家自然科学基金委员会, 中国科学院. 中国学科发展战略: 理论与计算化学[M]. 科学出版社, 2016.\n\n[11] SCHWABE T, GRIMME S. Theoretical Thermodynamics for Large Molecules: Walking the Thin Line between Accuracy and Computational Cost[J]. Acc Chem Res, 2008, 41(4): 569-579.\n\n[12] GOERIGK L, GRIMME S. A thorough benchmark of density functional methods for general main group thermochemistry, kinetics, and noncovalent interactions[J]. Physical Chemistry Chemical Physics, 2011, 13(14): 6670-6688.\n\n[13] CRAMER C J, TRUHLAR D G. Implicit Solvation Models: Equilibria, Structure, Spectra, and Dynamics[J]. Chem Rev, 1999, 99(8): 2161-2200.\n\n[14] STRUEBING H, GANASE Z, KARAMERTZANIS P G, et al. Computer-aided molecular design of solvents for accelerated reaction kinetics[J]. Nat Chem, 2013, 5: 952.\n\n[15] BLIGAARD T, NøRSKOV J K, DAHL S, et al. The Brønsted–Evans–Polanyi relation and the volcano curve in heterogeneous catalysis[J]. Journal Of Catalysis, 2004, 224(1): 206-217.\n\n[16] MICHAELIDES A, LIU Z P, ZHANG C J, et al. Identification of General Linear Relationships between Activation Energies and Enthalpy Changes for Dissociation Reactions at Surfaces[J]. J Am Chem Soc, 2003, 125(13): 3704-3705.\n\n[17] JACOBSEN C J H, DAHL S, CLAUSEN B S, et al. Catalyst Design by Interpolation in the Periodic Table: Bimetallic Ammonia Synthesis Catalysts[J]. J Am Chem Soc, 2001, 123(34): 8404-8405.\n\n[18] STUDT F, ABILD-PEDERSEN F, BLIGAARD T, et al. Identification of Non-Precious Metal Alloy Catalysts for Selective Hydrogenation of Acetylene[J]. 2008, 320(5881): 1320-1322.\n\n[19] SKOPLYAK O, BARTEAU M A, CHEN J G. Reforming of Oxygenates for H2 Production: Correlating Reactivity of Ethylene Glycol and Ethanol on Pt(111) and Ni/Pt(111) with Surface d-Band Center[J]. The Journal of Physical Chemistry B, 2006, 110(4): 1686-1694.\n\n[20] CIOBîCǍ I M, FRECHARD F, VAN SANTEN R A, et al. A DFT Study of Transition States for C−H Activation on the Ru(0001) Surface[J]. The Journal of Physical Chemistry B, 2000, 104(14): 3364-3369.\n\n[21] LIU Z-P, HU P. General Rules for Predicting Where a Catalytic Reaction Should Occur on Metal Surfaces: A Density Functional Theory Study of C−H and C−O Bond Breaking/Making on Flat, Stepped, and Kinked Metal Surfaces[J]. J Am Chem Soc, 2003, 125(7): 1958-1967.\n\n[22] VAN SANTEN R A. Complementary Structure Sensitive and Insensitive Catalytic Relationships[J]. Acc Chem Res, 2009, 42(1): 57-66.\n\n[23] SHETTY S, JANSEN A P J, VAN SANTEN R A. CO Dissociation on the Ru(112̅1) Surface[J]. The Journal of Physical Chemistry C, 2008, 112(36): 14027-14033.\n\n[24] MAVRIKAKIS M, BäUMER M, FREUND H-J, et al. Structure Sensitivity of CO Dissociation on Rh Surfaces[J]. 2002, 81(3): 153-156.\n\n[25] ANISIMOV V I, ZAANEN J, ANDERSEN O K. Band theory and Mott insulators: Hubbard U instead of Stoner I[J]. Physical Review B, 1991, 44(3): 943-954.\n\n[26] ARYASETIAWAN F, GUNNARSSON O. The GW method[J]. Reports on Progress in Physics, 1998, 61(3): 237.\n\n[27] SCHULZ H. Short history and present trends of Fischer–Tropsch synthesis[J]. Applied Catalysis A: General, 1999, 186(1): 3-12.\n\n[28] GEERLINGS J J C, WILSON J H, KRAMER G J, et al. Fischer–Tropsch technology — from active site to commercial process[J]. Applied Catalysis A: General, 1999, 186(1): 27-40.\n\n[29] BRADY R C, PETTIT R. Mechanism of the Fischer-Tropsch reaction. The chain propagation step[J]. J Am Chem Soc, 1981, 103(5): 1287-1289.\n\n[30] BILOEN P, HELLE J N, VAN DEN BERG F G A, et al. On the activity of Fischer-Tropsch and methanation catalysts: A study utilizing isotopic transients[J]. Journal Of Catalysis, 1983, 81(2): 450-463.\n\n[31] KUMMER J, PODGURSKI H, SPENCER W, et al. Mechanism Studies of the Fischer—Tropsch Synthesis. The Addition of Radioactive Alcohol[J]. 1951, 73(2): 564-569.\n\n[32] PICHLER V H, SCHULZ H J C I T. Neuere Erkenntnisse auf dem Gebiet der Synthese von Kohlenwasserstoffen aus CO und H2[J]. 1970, 42(18): 1162-1174.\n\n[33] CAO D-B, LI Y-W, WANG J, et al. Chain growth mechanism of Fischer–Tropsch synthesis on Fe5C2(001)[J]. Journal of Molecular Catalysis A: Chemical, 2011, 346(1): 55-69.\n\n[34] RIEDMüLLER B, CIOBı̂CĂ I M, PAPAGEORGOPOULOS D C, et al. CO adsorption on hydrogen saturated Ru(0001)[J]. 2001, 115(11): 5244-5251.\n\n[35] LOVELESS B T, BUDA C, NEUROCK M, et al. CO Chemisorption and Dissociation at High Coverages during CO Hydrogenation on Ru Catalysts[J]. J Am Chem Soc, 2013, 135(16): 6107-6121.\n\n[36] CIOBICA I M, KLEYN A W, VAN SANTEN R A. Adsorption and Coadsorption of CO and H on Ruthenium Surfaces[J]. The Journal of Physical Chemistry B, 2003, 107(1): 164-172.\n\n[37] CHEN Y-H, CAO D-B, JUN Y, et al. Density functional theory study of CO adsorption on the Fe (1 1 1) surface[J]. 2004, 400(1-3): 35-41.\n\n[38] RUSCIC B, PINZON R E, VON LASZEWSKI G, et al. Active Thermochemical Tables: thermochemistry for the 21st century[C]// Active Thermochemical Tables: thermochemistry for the 21st century. Journal of Physics: Conference Series. IOP Publishing,16: 561.\n\n[39] GOLDSMITH C F, MAGOON G R, GREEN W H J T J O P C A. Database of small molecule thermochemistry for combustion[J]. 2012, 116(36): 9033-9057.\n\n[40] CôME G, WARTH V, GLAUDE P, et al. Computer-aided design of gas-phase oxidation mechanisms—application to the modeling of n-heptane and iso-octane oxidation[C]// Computer-aided design of gas-phase oxidation mechanisms—application to the modeling of n-heptane and iso-octane oxidation. Symposium (International) on Combustion. Elsevier,26: 755-762.\n\n[41] VAN DUIN A C, DASGUPTA S, LORANT F, et al. ReaxFF: a reactive force field for hydrocarbons[J]. 2001, 105(41): 9396-9409.\n\n[42] CHENOWETH K, VAN DUIN A C, GODDARD W A J T J O P C A. ReaxFF reactive force field for molecular dynamics simulations of hydrocarbon oxidation[J]. 2008, 112(5): 1040-1053.\n\n[43] GONG J, LUQUE R. Catalysis for production of renewable energy[J]. Chem Soc Rev, 2014, 43(22): 7466-7468.\n\n[44] ZHANG Z C, XU B, WANG X. Engineering nanointerfaces for nanocatalysis[J]. Chem Soc Rev, 2014, 43(22): 7870-7886.\n\n[45] JELOAICA L, SIDIS V. DFT investigation of the adsorption of atomic hydrogen on a cluster-model graphite surface[J]. Chemical Physics Letters, 1999, 300(1): 157-162.\n\n[46] PISANI C, CAUSà M, DOVESI R, et al. Hartree-fock ab-initio characterization of ionic crystal surfaces with a slab model. The (0001) face of α-Al2O3[J]. Progress in Surface Science, 1987, 25(1): 119-137.\n\n[47] CAO Y, CHEN Z-X. Slab model studies of water adsorption and decomposition on clean and X- (X = C, N and O) contaminated Pd(111) surfaces[J]. Physical Chemistry Chemical Physics, 2007, 9(6): 739-746.\n\n[48] MARRINK S J, DE VRIES A H, MARK A E. Coarse Grained Model for Semiquantitative Lipid Simulations[J]. The Journal of Physical Chemistry B, 2004, 108(2): 750-760.\n\n[49] REITH D, PüTZ M, MüLLER-PLATHE F. Deriving effective mesoscale potentials from atomistic simulations[J]. 2003, 24(13): 1624-1636.\n\n[50] IZVEKOV S, VIOLI A, VOTH G A. Systematic Coarse-Graining of Nanoparticle Interactions in Molecular Dynamics Simulation[J]. The Journal of Physical Chemistry B, 2005, 109(36): 17019-17024.\n\n[51] 侯怀宇, 张新平. 材料科学与工程中的计算机应用[M]. 国防工业出版社: 北京, 2015.\n\n[52] 李莉, 王香. 计算材料学[M]. 哈尔滨: 哈尔滨工业大学出版社, 2017.\n\n[53] 国家自然科学基金委员会, 中国科学院. 未来10年中国学科发展战略·材料科学[M]. 北京: 科学出版社, 2012.\n\n[54] ONG S P, RICHARDS W D, JAIN A, et al. Python Materials Genomics (pymatgen): A robust, open-source python library for materials analysis[J]. Computational Materials Science, 2013, 68: 314-319.\n\n[55] 王安建, 王高尚, 陈其慎, 等. 能源与国家经济发展[M]. 北京: 地质出版社, 2008.\n\n[56] 中国能源中长期发展战略研究组. 中国能源中长期（2030、2050）发展战略研究：综合卷[M]. 科学出版社, 2011.\n\n[57] 崔民选, 王军生, 陈义和. 中国能源发展报告.2015[M]. 北京: 社会科学文献出版社, 2015.\n\n[58] 全国人民代表大会. 中华人民共和国国民经济和社会发展第十三个五年规划纲要[EB/OL] [2018.12.08]. http://www.xinhuanet.com//politics/2016lh/2016-03/17/c_1118366322.htm.\n\n[59] 陈哲文. 超临界水煤气化方法及发电系统集成[D]. 中国科学院大学(中国科学院工程热物理研究所), 2018.\n\n[60] 郭烈锦, 赵亮, 吕友军, 等. 煤炭超临界水气化制氢发电多联产技术[J]. 工程热物理学报, 2017, 38(03): 678-679.\n\n[61] 柳康, 许世森, 李广宇, 等. 基于整体煤气化联合循环的燃烧前CO_2捕集工艺及系统分析[J]. 化工进展, 2018, 37(12): 4897-4907.\n\n[62] 杨淑云, 李宁, 丰云恺, 等. 高效晶硅太阳电池的发展与抑制光衰的研究进展 [J]. 硅酸盐通报, 2013, 32(12): 2533-2537.\n\n[63] 李桐, 张林睿, 杨炎翰, 等. 铜锌锡硫薄膜太阳能电池吸收层的银掺杂 [J]. 材料工程, 2018, (12): 95-100.\n\n[64] 葛竖坚, 翟贝贝, 魏晓波, 等. 太阳能电池硅片的等离子增强化学气相沉积法, CN106282965A [P/OL]. 2017-01-04].\n\n[65] S·盛, L·张, Z·袁, 等. 制造硅异质结太阳能电池的方法与设备, CN107142460A [P/OL]. 2017-09-08].\n\n[66] 袁丽霞, 王兆祥, 董婷, 等. 生物质制取氢气和生物油液体燃料(英文) [J]. 中国科学技术大学学报, 2008, (06): 668-673.\n\n[67] 骆仲泱. 生物质制取高品位液体燃料及燃烧发电[C]// 生物质制取高品位液体燃料及燃烧发电. 2014中国（国际）生物质能源与生物质利用高峰论坛（BBS 2014）, 勤哲文化传播（上海）有限公司, 中国上海. 30.\n\n[68] 瞿婷婷, 肖军, 沈来宏. 生物质制取高品位液体燃料的生命周期评价[J]. 太阳能学报, 2014, 35(09): 1700-1707.\n\n[69] 常春, 孙培勤, 孙绍晖, 等. 我国生物质能源现代化应用前景展望(二)——生物质制备液体燃料的转化途径[J]. 中外能源, 2014, 19(07): 16-24.\n\n[70] 王兵, 段培高. 微藻热化学转化制备液体燃料[C]// 微藻热化学转化制备液体燃料. 河南省化学会2014年学术年会, 河南省化学会, 中国河南郑州. 1.\n\n[71] 唐志远, 胡云亭, 郭清正, 等. 天然气水合物勘探开发新技术进展 [J]. 地球物理学进展, 2015, 30(02): 805-816.\n\n[72] 李丽松, 苗琦. 天然气水合物勘探开发技术发展综述 [J]. 天然气与石油, 2014, 32(01): 67-71+11-12.\n\n[73] 国家能源局. 国家能源局部门预算[EB/OL] [2018-04]. http://zfxxgk.nea.gov.cn/auto80/201804/P020180413544574953616.pdf.\n\n[74] 李小平, 杨翔, 谢振, et al. 低碳约束下的国际贸易发展新论[M]. 北京: 中国环境出版社, 2017."}, {"url": "https://courses.graduateshotline.com/economics/harvard-economics.html", "page_content": "Last Updated: April 24, 2021\n\nStudying Economics at Harvard\n\nUndergraduate Course\n\nCourse Requirements for Concentrators in Economics\n\nMathematics\n\nPrinciples of Microeconomics and Macroeconomics\n\nStat 100, Stat 104, Stat 109, Stat 110, Applied Math, Math 154, or Ec 20\n\nIntermediate Micro and Macro Theory\n\nSophomore Tutorial\n\nEconometrics\n\nAdditional Requirements to Receive Honors\n\nThesis Track which includes Math 1b along with multivariable calculus, two semester of Ec 985, senior thesis and the honors exam\n\nAdvanced Course Track which includes Math 1b and multivariable calculus, two ec courses with one of them including a writing requirement and another including an intermediate theory, and an honors exam.\n\nUndergraduate Application Requirements\n\n$75 or a fee waiver\n\nSAT or ACT writing test scores\n\nTwo SAT Subject Tests scores\n\nHigh school report and transcript\n\nReports from two teachers\n\nMid-year and a final-year school report\n\nOpportunities after Graduation\n\nBusiness\n\nGovernment\n\nSocial Service\n\nTeaching\n\nCharitable Work\n\nFinance\n\nConsulting\n\nLaw\n\nM.A in Economics\n\nProfessional Degrees\n\nPh.D. Program\n\nPost-Graduate Course/PhD Application Requirements\n\nOnline application form that has been completed\n\nResume\n\nStatement of Purpose\n\nTranscripts from all colleges/universities student has studied in.\n\nGRE scores\n\nThree recommendation letters\n\nAn application fee of $105 paid through a credit card\n\nWriting sample\n\nGeneral Oral Examination\n\nEligibility Requirements for Ph.D. in Economics\n\nHave beyond basic knowledge about the principles in Economics.\n\nDemonstrate research-based skills or have worked as a research assistant in which case they have to submit a letter from the supervisor indicating their research-based knowledge.\n\nHave knowledge in basic mathematics including calculus and linear algebra.\n\ninclude a writing sample of at least 15 pages in length\n\nExpectations from Ph.D Students\n\ntake a written examination in economic theory\n\nmeet course requirements in distribution and quantitative methods\n\npresent a research paper in the second year\n\nappear for an oral examination in any two specialized fields\n\npresent a seminar on the research subject\n\nprepare a doctoral dissertation\n\nFinancial Assistance Offered\n\nEmployment Opportunities\n\n\n\n\n\nThe undergraduate and graduate programs of the Department of Economics at Harvard University have been designed for students showing high promise in teaching and research. Admissions are limited, and students are offered ample sources for counseling and advice. The Department of Economics has made it easier for research students to understand the department more by dividing them according to different fields. The different fields in the department are Behavioral Economics, Industrial Organization, Political Economy, Economic Development, International Economics, Public Economics, Econometrics, Theory, Labor Economics, Financial Economics, Macroeconomics, and Economic History.The Economics department of Harvard University has an advising team comprising two lecturers, one concentration advisor, and a graduate student to guide aspirants in understanding their educational requirements. Students are walked through the best course options and on timing the study of various subjects.Graduate students gain the benefit of choosing the right job (ranging from working at NGOs to traveling the world!) and completing a postdoctoral degree, stepping into important research programs at government organizations and business enterprises.Students are allowed to take Economics as their main concentration or as an elective in their undergraduate program. Usually, around 200-250 students will be there per class who concentrate on only economics and they are referred to as concentrators. They can also choose to complete the additional requirements for Honors.High school students - both U.S. and international candidates - are required to submit the Universal College Application and Harvard College Questions and Writing Supplement for the Common Application. They also need to submit:Transfer applicants need to submit the above mentioned along with the Common/Universal College Transfer Application, College/Registrar's report, College transcript, and two recommendation letters from college instructors.Students are given multiple options to choose from after their graduation. They can either choose to pursue higher studies and in the recent years, most of the students opt for jobs in various fields likeStudents who opt for higher studies choose fields likeTaking a Ph.D. in Economics from Harvard opens up opportunities for students to take up careers in fields like teaching and for applying for positions in the government, research organizations, or even business enterprises. The program offers students at least 15 seminars a week comprising of speakers from both domestic and international communities which allows the students to specialize in these said fields.People applying to Harvard can apply for more than one program since the university offers Ph.D. programs in Business Economics, Political Economy and Government, Public Policy, and Health Policy. Students who are selected for these programs will be able to stay in close contact with the economics department since most of their courses overlap.Harvard University offers only a full-time Ph.D. program and expects students to devote their every minute to study. Graduates with strong training in economics and mathematics are selected from institutions with English as the language of instruction. Students proficient in real analysis, probability, differential equations, and statistics gain an edge.Students should submitStudents have 13 subjects to choose from for the one-hour General Oral Examination that is a two-term study. However, they can dedicate more terms to this study. After passing this examination, students are required to participate in a working seminar or informal lunchtime seminar and must present a dissertation within one year.Students who are planning to apply for the Ph.D. program in Economics mustOnce admitted to the Ph.D course, students are required to:Thefor the first two years for this program is aroundand yet, Harvard has a record of 100% debt-free graduates. Nearly 70% of its students receive some form of financial aid with about 20% of student families paying nothing. This is because Harvard offers need-based scholarships. The students who are enrolled for courses are given a financial package that includes support for tuition and their health insurance. The students are also given a living stipend for the first two years along with teaching and research assistant stipends. They also receive a completion fellowship while in their final year of the program.Students can receive the Dissertation Completion Fellowship in their final year of study. Apart from the popular scholarships, the GSAS also provides other research fellowships to students applying for scholarships. Faculty members also offer research positions that are important to the program which helps students acquaint themselves with the professors and also eventually help them receive a salary after their second year.Harvard has a job cell with career counselors to help its graduates land the most suitable jobs. Surveys show that an average Harvard graduate earns $60,000. But salaries vary dramatically across industries. Consulting is the most popular, with about 72% of graduates drawing salaries between $70,000 and $90,000. Those opting for the financial sector have salaries crossing $110,000. Those who take to teaching earn in the $30,000 to $50,000 bracket in the first year out of university."}, {"url": "https://www.harvard.edu/about/history/nobel-laureates/economic-sciences/", "page_content": "2001\n\n“For analyses of markets with asymmetric information.”\n\nA. Michael Spence won for economic theories based on his Harvard doctoral thesis. Markets with asymmetric information happen when people on one side have much better information than those on the other: for instance, borrowers who know more about their repayment prospects than lenders, or Nobel Prize committee members who know who the winners are before anyone else does.\n\nWhen Spence chose his dissertation topic, he did it out of personal interest, not because he was trying to win prizes. In a 1984 interview with The New York Times, Spence said, “I can’t imagine people making decisions [about what to study] on the basis of how much something would contribute to their winning a Nobel Prize or a John Bates Clark Medal (which Spence won in 1981). A large amount of winning such prizes is randomness. To win a Nobel you have to be a certified genius, which I am not, or lucky, which I have been. But you can’t bet on it, so it doesn’t enter into the decision-making. You spend so much time doing this, that if you don’t enjoy what you are doing, it just wouldn’t work.”\n\nIn addition to holding a number of professorial appointments at Harvard, Spence served as dean of Harvard’s Faculty of Arts and Sciences from 1984 to 1990. He is also a former dean at Stanford University, where he is currently the Philip H. Knight Professor Emeritus. Spence shared the Nobel Prize with George A. Akerlof and Joseph E. Stiglitz."}]}