{"In 1993, Brian Petrovek was named the general manager of the Providence Bruins, the Bruins' AHL affiliate.": [{"url": "https://tidesmartradio.com/brian-petrovek/", "page_content": "Show Information Show: 108\n\nAir date: Saturday, April 19\n\nGuest: Brian Petrovek\n\nHost: Steve Woods (Stevoe)\n\nStudio Contributor Debi Davis\n\nExecutive Producer: Shannon Maguire\n\nFormer CEO of the Portland Pirates Brian Petrovek grew up in the Greater Boston area. He received both his bachelor’s and master’s degrees from Harvard University, where he earned All-America honors as a goaltender and was twice named to the All-Ivy League First Team (1974-75, 1976-77). In 1977, he was named the “Most Valuable Player of the Beanpot”, one of college hockey’s most prestigious tournaments. In October 1998, he was inducted into the Harvard University Athletic Hall of Fame. Steveo and Petrovek talked about how old they were when they both started playing hockey.\n\nPetrovek, who played youth hockey in the greater Boston area, was one of four goaltenders invited to the final U.S. Olympic Team Trials Camp in 1976. He was drafted by both the Los Angeles Kings of the National Hockey League and the Edmonton Oilers of the World Hockey Association in 1975.\n\nPetrovek joined as a Managing Owner and CEO of Portland Pirates LLC during the summer of 2000. Petrovek came to the Pirates after working the previous seven years with USA Hockey, Inc. and The USA Hockey Foundation in Colorado Springs, Colorado.\n\nAs Managing Owner and CEO, Petrovek oversaw the short and long term needs of the business, represents the franchise as an alternate governor at the League level, and participates regularly as a member of various league committees. He took the lead role in developing the Pirates’ winning bids for the 2003 Dodge AHL All-Star Classic and the 2010 Time Warner Cable AHL All-Star Classic joining Rochester, Hershey and Providence as the only cities to host more than one AHL All-Star event in the league’s history. Petrovek told Stevoe that he feels fortunate to have stayed in athletics after playing hockey for Harvard.\n\nLocally, Petrovek has served as Board Chair of the United Way of Greater Portland (2007-2009), was a member of the United Way’s Annual Campaign Cabinet since 2001-2010, and Chaired the 2004 United Way Annual Campaign. Petrovek is also a founding member of the Board of Directors of the Maine Sports Foundation. Petrovek is also an Adjunct faculty member at the University of Southern Maine, teaching in the university’s Sports Management degree program."}, {"url": "https://www.eliteprospects.com/player/264128/brian-petrovek", "page_content": "Edit Mode\n\nGo Premium to enter Edit Mode\n\nTake control of your EliteProspects profile! Sign up for EP Premium and verify your profile to access these benefits.\n\n- Ability to add additional data to your career profile: Videos, Images, Social Media, Referrals, Fitness Testing Results and much more!\n\n- Improve your search rank\n\n- Connect directly with players, coaches, teams, scouts and agents (optional)\n\n- Premium Design on your profile page (optional)\n\n- EP Contact Book listing of your profile (optional)\n\n- Verification Badge on your profile\n\nSign up for premium"}, {"url": "https://www.coloradoeagles.com/team/hockey-operations-staff", "page_content": "Kevin McDonald enters his first season as the General Manager of the Eagles, while also serving in his first year as Assistant General Manager for the NHL's Colorado Avalanche.\n\nMcDonald was the recipient of the 2022 Thomas Ebright Memorial Award, which is annually presented for outstanding career contributions to the American Hockey League. He served as the General Manager of the Blues' American Hockey League affiliate beginning in 2018 and in that role, was also a pro scout for St. Lous. With his guidance and input in the team personnel decisions, McDonald played an important role in the Blues capturing the 2019 Stanley Cup Championship.\n\nThe Lawrence, Massachusetts, native joined the Blues organization prior to the 2001-02 season as a professional scout and was promoted to Director of Professional Scouting within two seasons, taking on the role in 2003. McDonald took on the role of General Manager of the Blues' former AHL affiliate, peoria Rivermen, in June 2005 before being named an Assistant General Manager for St. Louis in May 2009.\n\nMcDonald began his career in professional hockey in 1988 as a member of the New York Rangers' communications department. Following the Rangers' Stanley Cup Championship run i 1993-94, he moved into the Rangers' hockey operations and worked as an assistant to Rangers General Manager Neil Smith during the lockout shortened 1994-95 season.\n\nMcDonald resides in North Andover, Massachusetts, where he lives with his wife Lauren, his two children Sean and Kayleigh, and his three step-children Joseph, Jenna and Daniel."}, {"url": "https://www.nhl.com/sabres/news/portland-pirates-become-new-ahl-affiliate-for-buffalo-sabres/c-438037", "page_content": "\n\nLink: Portland Pirates\n\nLink: Pirates E-News\n\nLink: American Hockey League\n\nVideo: Press Conference\n\n\n\n\n\n\n\n\n\n\n\n\n\n“This is an exciting day for fans of hockey throughout our state to partner with an eastern US city with one of the richest histories in professional hockey dating back to the turn of the century. From an initial meeting with Larry and Darcy last fall and our follow-up with Chief Operating Officer Dan DiPofi, we knew this would be a great fit for our fans and our business, one that we expect will bring exciting, championship caliber performances on the ice for years to come, along with a deeply rooted commitment to our community off the ice as well. Today’s announcement represents another important building block in our growth and commitment to professional hockey in Maine,” said Petrovek and Bullard in a joint statement.\n\n\n\nBefore teaming up with the Pirates, the Sabres were affiliated with the Rochester Americans for 29 seasons, the longest such partnership in professional hockey between an NHL team and its AHL affiliate. During that span, Rochester had a record of 1,137-932-238-13 in 2,320 regular season games (.593 winning percentage) and made the playoffs 24 out of the 29 seasons. The team won its Division title eight times, advanced to the Calder Cup Finals six times, winning the Calder Cup three of those years in 1983, 1987 and 1996. A number of current Sabres players, including Thomas Vanek, Derek Roy,\n\n\n\n“We are excited to begin our AHL affiliation with the Portland Pirates and the city of Portland,” said Buffalo Sabres Managing Partner Larry Quinn. “I am looking forward to working with Lyman Bullard, Brian Petrovek and Brian Williams, and the entire Pirates organization. I have been impressed with their professionalism from day one and am excited to build our new relationship both personally and professionally.”\n\n\n\n“There is a rich history of professional hockey in Portland and we hope to add to that winning tradition,” said Sabres General Manager Darcy Regier. “During our tenure with our previous AHL affiliation, our franchise model was to draft and to develop young prospects and build our success from a core group within. With our current roster of players like Jason Pominville,\n\n\n\nThe NHL officially came to Buffalo on Dec. 2, 1969, as part of a two-team expansion, when the league awarded Seymour and Northrup Knox the franchise that would soon be named “Sabres.” They chose center Gilbert Perreault as their first draft pick in 1970, after being awarded the number one selection. He, along with wingers Rene Robert and Rick Martin, became known as “The French Connection” and led the Sabres to the Stanley Cup Finals in 1975, only five seasons after the team’s inception. The team had continued success and made the playoffs for the next ten seasons, five of which where under Hall of Fame coach Scotty Bowman (‘79-‘80, ‘81-‘85). The team experienced great success again in the mid-90s, going through a number of changes in the 1996-97 season. Founder Seymour H. Knox passed away in the spring of 1996 just as the Sabres donned new uniform colors and moved from the storied Memorial Auditorium into the new HSBC Arena where they went on to capture the Northeast Division title. Lindy Ruff, a former Sabres defenseman and left wing, was named head coach at the beginning of the next season and led the team to the Eastern Conference Finals. The team’s success carried over to the 1998-1999 season when the Sabres made the Stanley Cup Finals where they lost to the Dallas Stars in six games.\n\n\n\nTom Golisano brought stability and a renewed excitement to the team when he purchased it in March, 2003. Following the NHL lockout, the Sabres returned to exceed all expectations by recording 52 wins and reaching the Eastern Conference Finals, earning Ruff a Jack Adams Trophy for Coach of the Year. The next season proved to be even better, as the Sabres won a franchise-record 53 games and earned the President’s Trophy in front of 41 sell-out crowds in the regular season. They also sold out the nine home playoff games on their way to the Conference Finals, making it the first time since 1979-80 that every game was played in front of a sold-out crowd. This success on and off the ice earned the organization a nomination for “Professional Sports Team of the Year” from the Sports Business Journal and Sports Business Daily.\n\n\n\nBuffalo becomes the third NHL affiliate in Pirates history. During its five-year affiliation with the Washington Capitals (2000-2005), the Pirates compiled a .535 regular-season winning percentage and made the playoffs three out of the five seasons. During their three-year affiliation with the Anaheim Ducks (2005-2008), the Pirates compiled a .563 regular-season winning percentage and made two Calder Cup playoff appearances, losing in Game 7 of the Eastern Conference Finals in both the 2005-06 and 2007-08 seasons. During that time, the Pirates averaged close to 5,000 fans per game and attendance grew by over 15 percent. With their NHL affiliate closer geographically, Portland hopes that its fans will invest in the success of the Sabres and the rivalry between the Boston/Providence Bruins will intensify. Pirates fans will be able to watch the Sabres play divisional opponent Boston six times during the NHL’s regular season, giving fans a closer look at their new NHL affiliate.\n\n\n\nThe new long-term agreement between the Pirates and the Buffalo Sabres guarantees professional hockey in the city of Portland through 2011. Since the Maine Mariners inaugural season in 1977, over 1,000 games have been played in front of over 3 million fans at the American Hockey League level. The AHL is the top development league for the National Hockey League and will be celebrating its 73rd season of play next season. Dating back to the days of the Maine Mariners, the American Hockey League has now played hockey in Portland for over 30 years. Only five other teams (Hershey, Rochester, Providence, Springfield and Cleveland) have had an American Hockey League franchise in their city longer than Portland. The Cumberland County Civic Center, the Pirates’ home, has hosted four Calder Cup Champions in 1978, 1979, 1984 and 1994 and the 2003 Dodge AHL All-Star Classic, one of the most successful in league history. “This is an exciting day for fans of hockey throughout our state to partner with an eastern US city with one of the richest histories in professional hockey dating back to the turn of the century. From an initial meeting with Larry and Darcy last fall and our follow-up with Chief Operating Officer Dan DiPofi, we knew this would be a great fit for our fans and our business, one that we expect will bring exciting, championship caliber performances on the ice for years to come, along with a deeply rooted commitment to our community off the ice as well. Today’s announcement represents another important building block in our growth and commitment to professional hockey in Maine,” said Petrovek and Bullard in a joint statement.Before teaming up with the Pirates, the Sabres were affiliated with the Rochester Americans for 29 seasons, the longest such partnership in professional hockey between an NHL team and its AHL affiliate. During that span, Rochester had a record of 1,137-932-238-13 in 2,320 regular season games (.593 winning percentage) and made the playoffs 24 out of the 29 seasons. The team won its Division title eight times, advanced to the Calder Cup Finals six times, winning the Calder Cup three of those years in 1983, 1987 and 1996. A number of current Sabres players, including Ryan Miller Jason Pominville , and Paul Gaustad, helped Rochester to its best season record in team history when they earned 112 points during the 2004-2005 season.“We are excited to begin our AHL affiliation with the Portland Pirates and the city of Portland,” said Buffalo Sabres Managing Partner Larry Quinn. “I am looking forward to working with Lyman Bullard, Brian Petrovek and Brian Williams, and the entire Pirates organization. I have been impressed with their professionalism from day one and am excited to build our new relationship both personally and professionally.”“There is a rich history of professional hockey in Portland and we hope to add to that winning tradition,” said Sabres General Manager Darcy Regier. “During our tenure with our previous AHL affiliation, our franchise model was to draft and to develop young prospects and build our success from a core group within. With our current roster of players like Ryan Miller Derek Roy and Thomas Vanek , we have been able to develop our system with positive results. It’s critical for the survival and success of the Buffalo Sabres franchise to continue to add quality, young players that can develop within our system and grow as professionals.”The NHL officially came to Buffalo on Dec. 2, 1969, as part of a two-team expansion, when the league awarded Seymour and Northrup Knox the franchise that would soon be named “Sabres.” They chose center Gilbert Perreault as their first draft pick in 1970, after being awarded the number one selection. He, along with wingers Rene Robert and Rick Martin, became known as “The French Connection” and led the Sabres to the Stanley Cup Finals in 1975, only five seasons after the team’s inception. The team had continued success and made the playoffs for the next ten seasons, five of which where under Hall of Fame coach Scotty Bowman (‘79-‘80, ‘81-‘85). The team experienced great success again in the mid-90s, going through a number of changes in the 1996-97 season. Founder Seymour H. Knox passed away in the spring of 1996 just as the Sabres donned new uniform colors and moved from the storied Memorial Auditorium into the new HSBC Arena where they went on to capture the Northeast Division title. Lindy Ruff, a former Sabres defenseman and left wing, was named head coach at the beginning of the next season and led the team to the Eastern Conference Finals. The team’s success carried over to the 1998-1999 season when the Sabres made the Stanley Cup Finals where they lost to the Dallas Stars in six games.Tom Golisano brought stability and a renewed excitement to the team when he purchased it in March, 2003. Following the NHL lockout, the Sabres returned to exceed all expectations by recording 52 wins and reaching the Eastern Conference Finals, earning Ruff a Jack Adams Trophy for Coach of the Year. The next season proved to be even better, as the Sabres won a franchise-record 53 games and earned the President’s Trophy in front of 41 sell-out crowds in the regular season. They also sold out the nine home playoff games on their way to the Conference Finals, making it the first time since 1979-80 that every game was played in front of a sold-out crowd. This success on and off the ice earned the organization a nomination for “Professional Sports Team of the Year” from the Sports Business Journal and Sports Business Daily.Buffalo becomes the third NHL affiliate in Pirates history. During its five-year affiliation with the Washington Capitals (2000-2005), the Pirates compiled a .535 regular-season winning percentage and made the playoffs three out of the five seasons. During their three-year affiliation with the Anaheim Ducks (2005-2008), the Pirates compiled a .563 regular-season winning percentage and made two Calder Cup playoff appearances, losing in Game 7 of the Eastern Conference Finals in both the 2005-06 and 2007-08 seasons. During that time, the Pirates averaged close to 5,000 fans per game and attendance grew by over 15 percent. With their NHL affiliate closer geographically, Portland hopes that its fans will invest in the success of the Sabres and the rivalry between the Boston/Providence Bruins will intensify. Pirates fans will be able to watch the Sabres play divisional opponent Boston six times during the NHL’s regular season, giving fans a closer look at their new NHL affiliate.The new long-term agreement between the Pirates and the Buffalo Sabres guarantees professional hockey in the city of Portland through 2011. Since the Maine Mariners inaugural season in 1977, over 1,000 games have been played in front of over 3 million fans at the American Hockey League level. The AHL is the top development league for the National Hockey League and will be celebrating its 73rd season of play next season. Dating back to the days of the Maine Mariners, the American Hockey League has now played hockey in Portland for over 30 years. Only five other teams (Hershey, Rochester, Providence, Springfield and Cleveland) have had an American Hockey League franchise in their city longer than Portland. The Cumberland County Civic Center, the Pirates’ home, has hosted four Calder Cup Champions in 1978, 1979, 1984 and 1994 and the 2003 Dodge AHL All-Star Classic, one of the most successful in league history. View More View Less × Share this!!\n\nLink: Pirates E-News\n\nLink: American Hockey League\n\nVideo: Press Conference\n\n\n\n\n\n\n\n\n\n\n\n\n\n“This is an exciting day for fans of hockey throughout our state to partner with an eastern US city with one of the richest histories in professional hockey dating back to the turn of the century. From an initial meeting with Larry and Darcy last fall and our follow-up with Chief Operating Officer Dan DiPofi, we knew this would be a great fit for our fans and our business, one that we expect will bring exciting, championship caliber performances on the ice for years to come, along with a deeply rooted commitment to our community off the ice as well. Today’s announcement represents another important building block in our growth and commitment to professional hockey in Maine,” said Petrovek and Bullard in a joint statement.\n\n\n\nBefore teaming up with the Pirates, the Sabres were affiliated with the Rochester Americans for 29 seasons, the longest such partnership in professional hockey between an NHL team and its AHL affiliate. During that span, Rochester had a record of 1,137-932-238-13 in 2,320 regular season games (.593 winning percentage) and made the playoffs 24 out of the 29 seasons. The team won its Division title eight times, advanced to the Calder Cup Finals six times, winning the Calder Cup three of those years in 1983, 1987 and 1996. A number of current Sabres players, including Thomas Vanek, Derek Roy,\n\n\n\n“We are excited to begin our AHL affiliation with the Portland Pirates and the city of Portland,” said Buffalo Sabres Managing Partner Larry Quinn. “I am looking forward to working with Lyman Bullard, Brian Petrovek and Brian Williams, and the entire Pirates organization. I have been impressed with their professionalism from day one and am excited to build our new relationship both personally and professionally.”\n\n\n\n“There is a rich history of professional hockey in Portland and we hope to add to that winning tradition,” said Sabres General Manager Darcy Regier. “During our tenure with our previous AHL affiliation, our franchise model was to draft and to develop young prospects and build our success from a core group within. With our current roster of players like Jason Pominville,\n\n\n\nThe NHL officially came to Buffalo on Dec. 2, 1969, as part of a two-team expansion, when the league awarded Seymour and Northrup Knox the franchise that would soon be named “Sabres.” They chose center Gilbert Perreault as their first draft pick in 1970, after being awarded the number one selection. He, along with wingers Rene Robert and Rick Martin, became known as “The French Connection” and led the Sabres to the Stanley Cup Finals in 1975, only five seasons after the team’s inception. The team had continued success and made the playoffs for the next ten seasons, five of which where under Hall of Fame coach Scotty Bowman (‘79-‘80, ‘81-‘85). The team experienced great success again in the mid-90s, going through a number of changes in the 1996-97 season. Founder Seymour H. Knox passed away in the spring of 1996 just as the Sabres donned new uniform colors and moved from the storied Memorial Auditorium into the new HSBC Arena where they went on to capture the Northeast Division title. Lindy Ruff, a former Sabres defenseman and left wing, was named head coach at the beginning of the next season and led the team to the Eastern Conference Finals. The team’s success carried over to the 1998-1999 season when the Sabres made the Stanley Cup Finals where they lost to the Dallas Stars in six games.\n\n\n\nTom Golisano brought stability and a renewed excitement to the team when he purchased it in March, 2003. Following the NHL lockout, the Sabres returned to exceed all expectations by recording 52 wins and reaching the Eastern Conference Finals, earning Ruff a Jack Adams Trophy for Coach of the Year. The next season proved to be even better, as the Sabres won a franchise-record 53 games and earned the President’s Trophy in front of 41 sell-out crowds in the regular season. They also sold out the nine home playoff games on their way to the Conference Finals, making it the first time since 1979-80 that every game was played in front of a sold-out crowd. This success on and off the ice earned the organization a nomination for “Professional Sports Team of the Year” from the Sports Business Journal and Sports Business Daily.\n\n\n\nBuffalo becomes the third NHL affiliate in Pirates history. During its five-year affiliation with the Washington Capitals (2000-2005), the Pirates compiled a .535 regular-season winning percentage and made the playoffs three out of the five seasons. During their three-year affiliation with the Anaheim Ducks (2005-2008), the Pirates compiled a .563 regular-season winning percentage and made two Calder Cup playoff appearances, losing in Game 7 of the Eastern Conference Finals in both the 2005-06 and 2007-08 seasons. During that time, the Pirates averaged close to 5,000 fans per game and attendance grew by over 15 percent. With their NHL affiliate closer geographically, Portland hopes that its fans will invest in the success of the Sabres and the rivalry between the Boston/Providence Bruins will intensify. Pirates fans will be able to watch the Sabres play divisional opponent Boston six times during the NHL’s regular season, giving fans a closer look at their new NHL affiliate.\n\n\n\nThe new long-term agreement between the Pirates and the Buffalo Sabres guarantees professional hockey in the city of Portland through 2011. Since the Maine Mariners inaugural season in 1977, over 1,000 games have been played in front of over 3 million fans at the American Hockey League level. The AHL is the top development league for the National Hockey League and will be celebrating its 73rd season of play next season. Dating back to the days of the Maine Mariners, the American Hockey League has now played hockey in Portland for over 30 years. Only five other teams (Hershey, Rochester, Providence, Springfield and Cleveland) have had an American Hockey League franchise in their city longer than Portland. The Cumberland County Civic Center, the Pirates’ home, has hosted four Calder Cup Champions in 1978, 1979, 1984 and 1994 and the 2003 Dodge AHL All-Star Classic, one of the most successful in league history. “This is an exciting day for fans of hockey throughout our state to partner with an eastern US city with one of the richest histories in professional hockey dating back to the turn of the century. From an initial meeting with Larry and Darcy last fall and our follow-up with Chief Operating Officer Dan DiPofi, we knew this would be a great fit for our fans and our business, one that we expect will bring exciting, championship caliber performances on the ice for years to come, along with a deeply rooted commitment to our community off the ice as well. Today’s announcement represents another important building block in our growth and commitment to professional hockey in Maine,” said Petrovek and Bullard in a joint statement.Before teaming up with the Pirates, the Sabres were affiliated with the Rochester Americans for 29 seasons, the longest such partnership in professional hockey between an NHL team and its AHL affiliate. During that span, Rochester had a record of 1,137-932-238-13 in 2,320 regular season games (.593 winning percentage) and made the playoffs 24 out of the 29 seasons. The team won its Division title eight times, advanced to the Calder Cup Finals six times, winning the Calder Cup three of those years in 1983, 1987 and 1996. A number of current Sabres players, including Ryan Miller Jason Pominville , and Paul Gaustad, helped Rochester to its best season record in team history when they earned 112 points during the 2004-2005 season.“We are excited to begin our AHL affiliation with the Portland Pirates and the city of Portland,” said Buffalo Sabres Managing Partner Larry Quinn. “I am looking forward to working with Lyman Bullard, Brian Petrovek and Brian Williams, and the entire Pirates organization. I have been impressed with their professionalism from day one and am excited to build our new relationship both personally and professionally.”“There is a rich history of professional hockey in Portland and we hope to add to that winning tradition,” said Sabres General Manager Darcy Regier. “During our tenure with our previous AHL affiliation, our franchise model was to draft and to develop young prospects and build our success from a core group within. With our current roster of players like Ryan Miller Derek Roy and Thomas Vanek , we have been able to develop our system with positive results. It’s critical for the survival and success of the Buffalo Sabres franchise to continue to add quality, young players that can develop within our system and grow as professionals.”The NHL officially came to Buffalo on Dec. 2, 1969, as part of a two-team expansion, when the league awarded Seymour and Northrup Knox the franchise that would soon be named “Sabres.” They chose center Gilbert Perreault as their first draft pick in 1970, after being awarded the number one selection. He, along with wingers Rene Robert and Rick Martin, became known as “The French Connection” and led the Sabres to the Stanley Cup Finals in 1975, only five seasons after the team’s inception. The team had continued success and made the playoffs for the next ten seasons, five of which where under Hall of Fame coach Scotty Bowman (‘79-‘80, ‘81-‘85). The team experienced great success again in the mid-90s, going through a number of changes in the 1996-97 season. Founder Seymour H. Knox passed away in the spring of 1996 just as the Sabres donned new uniform colors and moved from the storied Memorial Auditorium into the new HSBC Arena where they went on to capture the Northeast Division title. Lindy Ruff, a former Sabres defenseman and left wing, was named head coach at the beginning of the next season and led the team to the Eastern Conference Finals. The team’s success carried over to the 1998-1999 season when the Sabres made the Stanley Cup Finals where they lost to the Dallas Stars in six games.Tom Golisano brought stability and a renewed excitement to the team when he purchased it in March, 2003. Following the NHL lockout, the Sabres returned to exceed all expectations by recording 52 wins and reaching the Eastern Conference Finals, earning Ruff a Jack Adams Trophy for Coach of the Year. The next season proved to be even better, as the Sabres won a franchise-record 53 games and earned the President’s Trophy in front of 41 sell-out crowds in the regular season. They also sold out the nine home playoff games on their way to the Conference Finals, making it the first time since 1979-80 that every game was played in front of a sold-out crowd. This success on and off the ice earned the organization a nomination for “Professional Sports Team of the Year” from the Sports Business Journal and Sports Business Daily.Buffalo becomes the third NHL affiliate in Pirates history. During its five-year affiliation with the Washington Capitals (2000-2005), the Pirates compiled a .535 regular-season winning percentage and made the playoffs three out of the five seasons. During their three-year affiliation with the Anaheim Ducks (2005-2008), the Pirates compiled a .563 regular-season winning percentage and made two Calder Cup playoff appearances, losing in Game 7 of the Eastern Conference Finals in both the 2005-06 and 2007-08 seasons. During that time, the Pirates averaged close to 5,000 fans per game and attendance grew by over 15 percent. With their NHL affiliate closer geographically, Portland hopes that its fans will invest in the success of the Sabres and the rivalry between the Boston/Providence Bruins will intensify. Pirates fans will be able to watch the Sabres play divisional opponent Boston six times during the NHL’s regular season, giving fans a closer look at their new NHL affiliate.The new long-term agreement between the Pirates and the Buffalo Sabres guarantees professional hockey in the city of Portland through 2011. Since the Maine Mariners inaugural season in 1977, over 1,000 games have been played in front of over 3 million fans at the American Hockey League level. The AHL is the top development league for the National Hockey League and will be celebrating its 73rd season of play next season. Dating back to the days of the Maine Mariners, the American Hockey League has now played hockey in Portland for over 30 years. Only five other teams (Hershey, Rochester, Providence, Springfield and Cleveland) have had an American Hockey League franchise in their city longer than Portland. The Cumberland County Civic Center, the Pirates’ home, has hosted four Calder Cup Champions in 1978, 1979, 1984 and 1994 and the 2003 Dodge AHL All-Star Classic, one of the most successful in league history. View More View Less × Share this!! Link: American Hockey League\n\nVideo: Press Conference\n\n\n\n\n\n\n\n\n\n\n\n\n\n“This is an exciting day for fans of hockey throughout our state to partner with an eastern US city with one of the richest histories in professional hockey dating back to the turn of the century. From an initial meeting with Larry and Darcy last fall and our follow-up with Chief Operating Officer Dan DiPofi, we knew this would be a great fit for our fans and our business, one that we expect will bring exciting, championship caliber performances on the ice for years to come, along with a deeply rooted commitment to our community off the ice as well. Today’s announcement represents another important building block in our growth and commitment to professional hockey in Maine,” said Petrovek and Bullard in a joint statement.\n\n\n\nBefore teaming up with the Pirates, the Sabres were affiliated with the Rochester Americans for 29 seasons, the longest such partnership in professional hockey between an NHL team and its AHL affiliate. During that span, Rochester had a record of 1,137-932-238-13 in 2,320 regular season games (.593 winning percentage) and made the playoffs 24 out of the 29 seasons. The team won its Division title eight times, advanced to the Calder Cup Finals six times, winning the Calder Cup three of those years in 1983, 1987 and 1996. A number of current Sabres players, including Thomas Vanek, Derek Roy,\n\n\n\n“We are excited to begin our AHL affiliation with the Portland Pirates and the city of Portland,” said Buffalo Sabres Managing Partner Larry Quinn. “I am looking forward to working with Lyman Bullard, Brian Petrovek and Brian Williams, and the entire Pirates organization. I have been impressed with their professionalism from day one and am excited to build our new relationship both personally and professionally.”\n\n\n\n“There is a rich history of professional hockey in Portland and we hope to add to that winning tradition,” said Sabres General Manager Darcy Regier. “During our tenure with our previous AHL affiliation, our franchise model was to draft and to develop young prospects and build our success from a core group within. With our current roster of players like Jason Pominville,\n\n\n\nThe NHL officially came to Buffalo on Dec. 2, 1969, as part of a two-team expansion, when the league awarded Seymour and Northrup Knox the franchise that would soon be named “Sabres.” They chose center Gilbert Perreault as their first draft pick in 1970, after being awarded the number one selection. He, along with wingers Rene Robert and Rick Martin, became known as “The French Connection” and led the Sabres to the Stanley Cup Finals in 1975, only five seasons after the team’s inception. The team had continued success and made the playoffs for the next ten seasons, five of which where under Hall of Fame coach Scotty Bowman (‘79-‘80, ‘81-‘85). The team experienced great success again in the mid-90s, going through a number of changes in the 1996-97 season. Founder Seymour H. Knox passed away in the spring of 1996 just as the Sabres donned new uniform colors and moved from the storied Memorial Auditorium into the new HSBC Arena where they went on to capture the Northeast Division title. Lindy Ruff, a former Sabres defenseman and left wing, was named head coach at the beginning of the next season and led the team to the Eastern Conference Finals. The team’s success carried over to the 1998-1999 season when the Sabres made the Stanley Cup Finals where they lost to the Dallas Stars in six games.\n\n\n\nTom Golisano brought stability and a renewed excitement to the team when he purchased it in March, 2003. Following the NHL lockout, the Sabres returned to exceed all expectations by recording 52 wins and reaching the Eastern Conference Finals, earning Ruff a Jack Adams Trophy for Coach of the Year. The next season proved to be even better, as the Sabres won a franchise-record 53 games and earned the President’s Trophy in front of 41 sell-out crowds in the regular season. They also sold out the nine home playoff games on their way to the Conference Finals, making it the first time since 1979-80 that every game was played in front of a sold-out crowd. This success on and off the ice earned the organization a nomination for “Professional Sports Team of the Year” from the Sports Business Journal and Sports Business Daily.\n\n\n\nBuffalo becomes the third NHL affiliate in Pirates history. During its five-year affiliation with the Washington Capitals (2000-2005), the Pirates compiled a .535 regular-season winning percentage and made the playoffs three out of the five seasons. During their three-year affiliation with the Anaheim Ducks (2005-2008), the Pirates compiled a .563 regular-season winning percentage and made two Calder Cup playoff appearances, losing in Game 7 of the Eastern Conference Finals in both the 2005-06 and 2007-08 seasons. During that time, the Pirates averaged close to 5,000 fans per game and attendance grew by over 15 percent. With their NHL affiliate closer geographically, Portland hopes that its fans will invest in the success of the Sabres and the rivalry between the Boston/Providence Bruins will intensify. Pirates fans will be able to watch the Sabres play divisional opponent Boston six times during the NHL’s regular season, giving fans a closer look at their new NHL affiliate.\n\n\n\nThe new long-term agreement between the Pirates and the Buffalo Sabres guarantees professional hockey in the city of Portland through 2011. Since the Maine Mariners inaugural season in 1977, over 1,000 games have been played in front of over 3 million fans at the American Hockey League level. The AHL is the top development league for the National Hockey League and will be celebrating its 73rd season of play next season. Dating back to the days of the Maine Mariners, the American Hockey League has now played hockey in Portland for over 30 years. Only five other teams (Hershey, Rochester, Providence, Springfield and Cleveland) have had an American Hockey League franchise in their city longer than Portland. The Cumberland County Civic Center, the Pirates’ home, has hosted four Calder Cup Champions in 1978, 1979, 1984 and 1994 and the 2003 Dodge AHL All-Star Classic, one of the most successful in league history. “This is an exciting day for fans of hockey throughout our state to partner with an eastern US city with one of the richest histories in professional hockey dating back to the turn of the century. From an initial meeting with Larry and Darcy last fall and our follow-up with Chief Operating Officer Dan DiPofi, we knew this would be a great fit for our fans and our business, one that we expect will bring exciting, championship caliber performances on the ice for years to come, along with a deeply rooted commitment to our community off the ice as well. Today’s announcement represents another important building block in our growth and commitment to professional hockey in Maine,” said Petrovek and Bullard in a joint statement.Before teaming up with the Pirates, the Sabres were affiliated with the Rochester Americans for 29 seasons, the longest such partnership in professional hockey between an NHL team and its AHL affiliate. During that span, Rochester had a record of 1,137-932-238-13 in 2,320 regular season games (.593 winning percentage) and made the playoffs 24 out of the 29 seasons. The team won its Division title eight times, advanced to the Calder Cup Finals six times, winning the Calder Cup three of those years in 1983, 1987 and 1996. A number of current Sabres players, including Ryan Miller Jason Pominville , and Paul Gaustad, helped Rochester to its best season record in team history when they earned 112 points during the 2004-2005 season.“We are excited to begin our AHL affiliation with the Portland Pirates and the city of Portland,” said Buffalo Sabres Managing Partner Larry Quinn. “I am looking forward to working with Lyman Bullard, Brian Petrovek and Brian Williams, and the entire Pirates organization. I have been impressed with their professionalism from day one and am excited to build our new relationship both personally and professionally.”“There is a rich history of professional hockey in Portland and we hope to add to that winning tradition,” said Sabres General Manager Darcy Regier. “During our tenure with our previous AHL affiliation, our franchise model was to draft and to develop young prospects and build our success from a core group within. With our current roster of players like Ryan Miller Derek Roy and Thomas Vanek , we have been able to develop our system with positive results. It’s critical for the survival and success of the Buffalo Sabres franchise to continue to add quality, young players that can develop within our system and grow as professionals.”The NHL officially came to Buffalo on Dec. 2, 1969, as part of a two-team expansion, when the league awarded Seymour and Northrup Knox the franchise that would soon be named “Sabres.” They chose center Gilbert Perreault as their first draft pick in 1970, after being awarded the number one selection. He, along with wingers Rene Robert and Rick Martin, became known as “The French Connection” and led the Sabres to the Stanley Cup Finals in 1975, only five seasons after the team’s inception. The team had continued success and made the playoffs for the next ten seasons, five of which where under Hall of Fame coach Scotty Bowman (‘79-‘80, ‘81-‘85). The team experienced great success again in the mid-90s, going through a number of changes in the 1996-97 season. Founder Seymour H. Knox passed away in the spring of 1996 just as the Sabres donned new uniform colors and moved from the storied Memorial Auditorium into the new HSBC Arena where they went on to capture the Northeast Division title. Lindy Ruff, a former Sabres defenseman and left wing, was named head coach at the beginning of the next season and led the team to the Eastern Conference Finals. The team’s success carried over to the 1998-1999 season when the Sabres made the Stanley Cup Finals where they lost to the Dallas Stars in six games.Tom Golisano brought stability and a renewed excitement to the team when he purchased it in March, 2003. Following the NHL lockout, the Sabres returned to exceed all expectations by recording 52 wins and reaching the Eastern Conference Finals, earning Ruff a Jack Adams Trophy for Coach of the Year. The next season proved to be even better, as the Sabres won a franchise-record 53 games and earned the President’s Trophy in front of 41 sell-out crowds in the regular season. They also sold out the nine home playoff games on their way to the Conference Finals, making it the first time since 1979-80 that every game was played in front of a sold-out crowd. This success on and off the ice earned the organization a nomination for “Professional Sports Team of the Year” from the Sports Business Journal and Sports Business Daily.Buffalo becomes the third NHL affiliate in Pirates history. During its five-year affiliation with the Washington Capitals (2000-2005), the Pirates compiled a .535 regular-season winning percentage and made the playoffs three out of the five seasons. During their three-year affiliation with the Anaheim Ducks (2005-2008), the Pirates compiled a .563 regular-season winning percentage and made two Calder Cup playoff appearances, losing in Game 7 of the Eastern Conference Finals in both the 2005-06 and 2007-08 seasons. During that time, the Pirates averaged close to 5,000 fans per game and attendance grew by over 15 percent. With their NHL affiliate closer geographically, Portland hopes that its fans will invest in the success of the Sabres and the rivalry between the Boston/Providence Bruins will intensify. Pirates fans will be able to watch the Sabres play divisional opponent Boston six times during the NHL’s regular season, giving fans a closer look at their new NHL affiliate.The new long-term agreement between the Pirates and the Buffalo Sabres guarantees professional hockey in the city of Portland through 2011. Since the Maine Mariners inaugural season in 1977, over 1,000 games have been played in front of over 3 million fans at the American Hockey League level. The AHL is the top development league for the National Hockey League and will be celebrating its 73rd season of play next season. Dating back to the days of the Maine Mariners, the American Hockey League has now played hockey in Portland for over 30 years. Only five other teams (Hershey, Rochester, Providence, Springfield and Cleveland) have had an American Hockey League franchise in their city longer than Portland. The Cumberland County Civic Center, the Pirates’ home, has hosted four Calder Cup Champions in 1978, 1979, 1984 and 1994 and the 2003 Dodge AHL All-Star Classic, one of the most successful in league history. View More View Less × Share this!!\n\nVideo: Press Conference\n\n\n\n\n\n\n\n\n\n\n\n\n\n“This is an exciting day for fans of hockey throughout our state to partner with an eastern US city with one of the richest histories in professional hockey dating back to the turn of the century. From an initial meeting with Larry and Darcy last fall and our follow-up with Chief Operating Officer Dan DiPofi, we knew this would be a great fit for our fans and our business, one that we expect will bring exciting, championship caliber performances on the ice for years to come, along with a deeply rooted commitment to our community off the ice as well. Today’s announcement represents another important building block in our growth and commitment to professional hockey in Maine,” said Petrovek and Bullard in a joint statement.\n\n\n\nBefore teaming up with the Pirates, the Sabres were affiliated with the Rochester Americans for 29 seasons, the longest such partnership in professional hockey between an NHL team and its AHL affiliate. During that span, Rochester had a record of 1,137-932-238-13 in 2,320 regular season games (.593 winning percentage) and made the playoffs 24 out of the 29 seasons. The team won its Division title eight times, advanced to the Calder Cup Finals six times, winning the Calder Cup three of those years in 1983, 1987 and 1996. A number of current Sabres players, including Thomas Vanek, Derek Roy,\n\n\n\n“We are excited to begin our AHL affiliation with the Portland Pirates and the city of Portland,” said Buffalo Sabres Managing Partner Larry Quinn. “I am looking forward to working with Lyman Bullard, Brian Petrovek and Brian Williams, and the entire Pirates organization. I have been impressed with their professionalism from day one and am excited to build our new relationship both personally and professionally.”\n\n\n\n“There is a rich history of professional hockey in Portland and we hope to add to that winning tradition,” said Sabres General Manager Darcy Regier. “During our tenure with our previous AHL affiliation, our franchise model was to draft and to develop young prospects and build our success from a core group within. With our current roster of players like Jason Pominville,\n\n\n\nThe NHL officially came to Buffalo on Dec. 2, 1969, as part of a two-team expansion, when the league awarded Seymour and Northrup Knox the franchise that would soon be named “Sabres.” They chose center Gilbert Perreault as their first draft pick in 1970, after being awarded the number one selection. He, along with wingers Rene Robert and Rick Martin, became known as “The French Connection” and led the Sabres to the Stanley Cup Finals in 1975, only five seasons after the team’s inception. The team had continued success and made the playoffs for the next ten seasons, five of which where under Hall of Fame coach Scotty Bowman (‘79-‘80, ‘81-‘85). The team experienced great success again in the mid-90s, going through a number of changes in the 1996-97 season. Founder Seymour H. Knox passed away in the spring of 1996 just as the Sabres donned new uniform colors and moved from the storied Memorial Auditorium into the new HSBC Arena where they went on to capture the Northeast Division title. Lindy Ruff, a former Sabres defenseman and left wing, was named head coach at the beginning of the next season and led the team to the Eastern Conference Finals. The team’s success carried over to the 1998-1999 season when the Sabres made the Stanley Cup Finals where they lost to the Dallas Stars in six games.\n\n\n\nTom Golisano brought stability and a renewed excitement to the team when he purchased it in March, 2003. Following the NHL lockout, the Sabres returned to exceed all expectations by recording 52 wins and reaching the Eastern Conference Finals, earning Ruff a Jack Adams Trophy for Coach of the Year. The next season proved to be even better, as the Sabres won a franchise-record 53 games and earned the President’s Trophy in front of 41 sell-out crowds in the regular season. They also sold out the nine home playoff games on their way to the Conference Finals, making it the first time since 1979-80 that every game was played in front of a sold-out crowd. This success on and off the ice earned the organization a nomination for “Professional Sports Team of the Year” from the Sports Business Journal and Sports Business Daily.\n\n\n\nBuffalo becomes the third NHL affiliate in Pirates history. During its five-year affiliation with the Washington Capitals (2000-2005), the Pirates compiled a .535 regular-season winning percentage and made the playoffs three out of the five seasons. During their three-year affiliation with the Anaheim Ducks (2005-2008), the Pirates compiled a .563 regular-season winning percentage and made two Calder Cup playoff appearances, losing in Game 7 of the Eastern Conference Finals in both the 2005-06 and 2007-08 seasons. During that time, the Pirates averaged close to 5,000 fans per game and attendance grew by over 15 percent. With their NHL affiliate closer geographically, Portland hopes that its fans will invest in the success of the Sabres and the rivalry between the Boston/Providence Bruins will intensify. Pirates fans will be able to watch the Sabres play divisional opponent Boston six times during the NHL’s regular season, giving fans a closer look at their new NHL affiliate.\n\n\n\nThe new long-term agreement between the Pirates and the Buffalo Sabres guarantees professional hockey in the city of Portland through 2011. Since the Maine Mariners inaugural season in 1977, over 1,000 games have been played in front of over 3 million fans at the American Hockey League level. The AHL is the top development league for the National Hockey League and will be celebrating its 73rd season of play next season. Dating back to the days of the Maine Mariners, the American Hockey League has now played hockey in Portland for over 30 years. Only five other teams (Hershey, Rochester, Providence, Springfield and Cleveland) have had an American Hockey League franchise in their city longer than Portland. The Cumberland County Civic Center, the Pirates’ home, has hosted four Calder Cup Champions in 1978, 1979, 1984 and 1994 and the 2003 Dodge AHL All-Star Classic, one of the most successful in league history. “This is an exciting day for fans of hockey throughout our state to partner with an eastern US city with one of the richest histories in professional hockey dating back to the turn of the century. From an initial meeting with Larry and Darcy last fall and our follow-up with Chief Operating Officer Dan DiPofi, we knew this would be a great fit for our fans and our business, one that we expect will bring exciting, championship caliber performances on the ice for years to come, along with a deeply rooted commitment to our community off the ice as well. Today’s announcement represents another important building block in our growth and commitment to professional hockey in Maine,” said Petrovek and Bullard in a joint statement.Before teaming up with the Pirates, the Sabres were affiliated with the Rochester Americans for 29 seasons, the longest such partnership in professional hockey between an NHL team and its AHL affiliate. During that span, Rochester had a record of 1,137-932-238-13 in 2,320 regular season games (.593 winning percentage) and made the playoffs 24 out of the 29 seasons. The team won its Division title eight times, advanced to the Calder Cup Finals six times, winning the Calder Cup three of those years in 1983, 1987 and 1996. A number of current Sabres players, including Ryan Miller Jason Pominville , and Paul Gaustad, helped Rochester to its best season record in team history when they earned 112 points during the 2004-2005 season.“We are excited to begin our AHL affiliation with the Portland Pirates and the city of Portland,” said Buffalo Sabres Managing Partner Larry Quinn. “I am looking forward to working with Lyman Bullard, Brian Petrovek and Brian Williams, and the entire Pirates organization. I have been impressed with their professionalism from day one and am excited to build our new relationship both personally and professionally.”“There is a rich history of professional hockey in Portland and we hope to add to that winning tradition,” said Sabres General Manager Darcy Regier. “During our tenure with our previous AHL affiliation, our franchise model was to draft and to develop young prospects and build our success from a core group within. With our current roster of players like Ryan Miller Derek Roy and Thomas Vanek , we have been able to develop our system with positive results. It’s critical for the survival and success of the Buffalo Sabres franchise to continue to add quality, young players that can develop within our system and grow as professionals.”The NHL officially came to Buffalo on Dec. 2, 1969, as part of a two-team expansion, when the league awarded Seymour and Northrup Knox the franchise that would soon be named “Sabres.” They chose center Gilbert Perreault as their first draft pick in 1970, after being awarded the number one selection. He, along with wingers Rene Robert and Rick Martin, became known as “The French Connection” and led the Sabres to the Stanley Cup Finals in 1975, only five seasons after the team’s inception. The team had continued success and made the playoffs for the next ten seasons, five of which where under Hall of Fame coach Scotty Bowman (‘79-‘80, ‘81-‘85). The team experienced great success again in the mid-90s, going through a number of changes in the 1996-97 season. Founder Seymour H. Knox passed away in the spring of 1996 just as the Sabres donned new uniform colors and moved from the storied Memorial Auditorium into the new HSBC Arena where they went on to capture the Northeast Division title. Lindy Ruff, a former Sabres defenseman and left wing, was named head coach at the beginning of the next season and led the team to the Eastern Conference Finals. The team’s success carried over to the 1998-1999 season when the Sabres made the Stanley Cup Finals where they lost to the Dallas Stars in six games.Tom Golisano brought stability and a renewed excitement to the team when he purchased it in March, 2003. Following the NHL lockout, the Sabres returned to exceed all expectations by recording 52 wins and reaching the Eastern Conference Finals, earning Ruff a Jack Adams Trophy for Coach of the Year. The next season proved to be even better, as the Sabres won a franchise-record 53 games and earned the President’s Trophy in front of 41 sell-out crowds in the regular season. They also sold out the nine home playoff games on their way to the Conference Finals, making it the first time since 1979-80 that every game was played in front of a sold-out crowd. This success on and off the ice earned the organization a nomination for “Professional Sports Team of the Year” from the Sports Business Journal and Sports Business Daily.Buffalo becomes the third NHL affiliate in Pirates history. During its five-year affiliation with the Washington Capitals (2000-2005), the Pirates compiled a .535 regular-season winning percentage and made the playoffs three out of the five seasons. During their three-year affiliation with the Anaheim Ducks (2005-2008), the Pirates compiled a .563 regular-season winning percentage and made two Calder Cup playoff appearances, losing in Game 7 of the Eastern Conference Finals in both the 2005-06 and 2007-08 seasons. During that time, the Pirates averaged close to 5,000 fans per game and attendance grew by over 15 percent. With their NHL affiliate closer geographically, Portland hopes that its fans will invest in the success of the Sabres and the rivalry between the Boston/Providence Bruins will intensify. Pirates fans will be able to watch the Sabres play divisional opponent Boston six times during the NHL’s regular season, giving fans a closer look at their new NHL affiliate.The new long-term agreement between the Pirates and the Buffalo Sabres guarantees professional hockey in the city of Portland through 2011. Since the Maine Mariners inaugural season in 1977, over 1,000 games have been played in front of over 3 million fans at the American Hockey League level. The AHL is the top development league for the National Hockey League and will be celebrating its 73rd season of play next season. Dating back to the days of the Maine Mariners, the American Hockey League has now played hockey in Portland for over 30 years. Only five other teams (Hershey, Rochester, Providence, Springfield and Cleveland) have had an American Hockey League franchise in their city longer than Portland. The Cumberland County Civic Center, the Pirates’ home, has hosted four Calder Cup Champions in 1978, 1979, 1984 and 1994 and the 2003 Dodge AHL All-Star Classic, one of the most successful in league history. View More View Less × Share this!!\n\n"}, {"url": "https://www.pressherald.com/2014/04/28/petrovek__portland_pirates_part_ways_/", "page_content": "Brian Petrovek, chief executive officer of the Portland Pirates for nearly 14 years, has left the franchise after a tumultuous season that saw the American Hockey League affiliate temporarily move its home games from Portland to Lewiston and finish last in the league in both attendance and performance.\n\nThe Pirates announced Petrovek’s resignation Monday afternoon.\n\nAdditional Photos Departing CEO Brian Petrovek is praised for attracting the AHL all-star game to Portland and for his civic work. 2013 Press Herald File/John Ewing Related Headlines Portland Pirates general manager leaving for Calgary, source says\n\n“Where the Pirates are now, and as we set ourselves up for an exciting future, a lot of thanks have to go to Brian and all the work he did over the past 14 years,” said Brad Church, a former left winger for the Pirates who took over as chief operating officer during a management shakeup in late February.\n\nPetrovek, 59, was part of an ownership group led by Boston lawyer Lyman Bullard that purchased the Pirates in 2000. Bullard remained the majority owner until this winter, when Ron Cain increased his stake in the team and, shortly thereafter, took over CEO duties from Petrovek, who remained president of business development.\n\nChurch said he believes Petrovek retains his ownership stake. “Although I’m not an owner,” Church said, “so I don’t know for sure.”\n\nCalls to Petrovek, Cain and Bullard were not returned.\n\nAdvertisement\n\nBut in a prepared statement, Petrovek said, “My decision allows Ron to steer the ship on his own course and begin a new journey for the brand and our fans and sponsors as the team prepares for the 2014-15 season.”\n\nIn a statement, Cain thanked Petrovek for his service.\n\n“Brian is at the top of his game,” Cain said. “Our loss will be another’s gain.”\n\nCain lauded Petrovek’s success in attracting the AHL all-star game to Portland in 2003 and 2010 and his involvement in civic and charitable organizations. Petrovek has served on the boards of Maine Medical Center, the United Way of Greater Portland and Portland’s Downtown District.\n\nPetrovek was also the face and voice of the team’s difficult and extended lease negotiations with trustees of the Cumberland County Civic Center in 2003, 2010 and 2013. “We’ll give it three more years,” he said after grudgingly signing a 2003 agreement. “We will not play in the building three years from now unless it has been renovated or the economic terms are different.”\n\nIn 2010, Petrovek flirted with moving the franchise to Albany, N.Y., before agreeing to a two-year extension. After voters approved a $33 million bond in 2011 to renovate the civic center, its trustees reached an agreement with the Pirates on a one-year lease with an eye toward a longer-term deal.\n\nAdvertisement\n\nSuch a deal, which seemed to be imminent in April 2013, fell apart in August. In September, the team filed a lawsuit and then announced that its entire 38-game home schedule would be played at the Androscoggin Bank Colisee in Lewiston.\n\n“With any sports team, there’s a certain amount of friction around the guy who’s the face of the organization,” said Chris Hall, CEO of the Portland Regional Chamber of Commerce. “Certainly, the last year and a half has been difficult, but people should reflect on all the good years and the contributions. The city of Portland is well known as a great minor-league sports town. Well, one of the reasons is because of people like Brian Petrovek.”\n\nThe first few months in Lewiston included three sellouts and an average attendance of more than 2,600 fans. The Pirates won a franchise-low 10 “home” games. They ended the season with a 10-game losing streak and an average attendance of 2,185 – the only one of 30 AHL franchises below 3,000.\n\nA new five-year lease with the civic center was announced in February, after Cain became majority owner and the Pirates dropped their lawsuit against the county-owned facility.\n\n“Ron, Lyman and I started talking more definitively about the opportunity and need for change as the ink dried on a new long-term lease with the civic center and the completion of the renovation project,” Petrovek said in his statement.\n\nNeal Pratt, chairman of the civic center’s board of trustees, said he and Petrovek often disagreed, but their relations were never disagreeable.\n\nAdvertisement\n\n“Brian was always a zealous advocate for the team and a tireless promoter of the Pirates brand,” Pratt said. “He tried to do what was best for his team and his business and I respect that and wish him well.”\n\nPratt said the list of Petrovek’s charitable efforts is impressive.\n\n“He has done a lot of volunteer work for the community,” Pratt said, “and I think he should be recognized for that.”\n\nIn March 2013, Petrovek pleaded guilty to operating under the influence as part of a deal to avoid jail time after he crashed his Jeep Wrangler into the concrete barrier on Spring Street in Portland. His blood-alcohol content was measured at three times the legal limit for driving.\n\n“What his legacy will be, I don’t know,” said Church. “My hope is that people look at the big picture and recognize all the good that has come with his leadership of the organization.”\n\nIn another, unrelated change, the Pirates lost their general manager Monday when Brad Treliving, former assistant GM of their parent NHL club, the Phoenix Coyotes, was hired as GM of the NHL’s Calgary Flames.\n\nGlenn Jordan can be contacted at 791-6425 or at:\n\n[email protected]\n\nTwitter: GlennJordanPPH"}, {"url": "https://www.thecrimson.com/article/1975/1/9/petro-confidence-in-crimson-crease-pwhy/", "page_content": "Why? Why would you ever want to be a hockey goalie? A chuckle, and then a shake of the head. A friend and teammate rallies to his aid, \"He can't skate--that's why he's the goalie.\"\n\nAnother laugh and then Brian Petrovek, Harvard goaltender and Eastern college hockey's top netminder, assumes a more serious manner.\n\n\"I grew up in a hockey family in a hockey town (Norwood, Mass.) with a brother who just happened to be a goalie,\" he said. \"It was just natural for me to follow him. I started out as a goalie, and believe me--I wouldn't want to be anything else.\"\n\nPetrovek arrived at Harvard through the grace of an unlikely character, former B.U. head coach Jack Kelly. He had originally gone to Hotchkiss at the suggestion of Kelly, a close family friend.\n\nWhen Kelly graduated into the big leagues as the coach of the New England Whalers, he suggested that Brian shoot for Harvard rather than B.U. Needless to stay, Petro scored.\n\nAs goaltender for the Yardling squad last year, Petrovek was frustrated. Although the squad posted a strong 14-4 record, he didn't find the competition keen enough to sharpen his play.\n\nPetrovek spent last summer working at a hockey camp. When he returned this fall he was determined to take over the starting goalie position, a position many felt kept the Crimson from winning the national championship last spring.\n\nPetro exudes this determination and confidence when he talks about Harvard's chances this season.\n\n\"I think we should win it all this year and I'm going to be sure that I'm not the reason that Harvard isn't the national champion come March,\" he said.\n\nPetrovek is a low-keyed individual. The heckling and antics of rowdy fans and the rough emotional intensity of the game do not faze him. He writes it all off as being part of the game.\n\nAdvertisement\n\nHe says he feels that the collegiate rule imposing a game's suspension for fighting promotes a lot of cheap shots.\n\nIf the rule was eliminated, a player could let out his frustration in fight rather than resorting to the potentially more damaging buttends and slashes that are now found in the game.\n\n\"A Physical Game\"\n\n\"Hockey's a physical game, and it seems artificial to have such a rule. The NHL has successfully contained fighting in that league, and I feel college hockey could do so also.\"\n\nIt's hard for Petrovek to divorce his hockey life from his role as a student. He's majoring in history mostly from an interest cultivated from travel as a hockey player.\n\nPetro's career interests don't take him far from the rink either. He would like to have a shot at the pros, but right now his concentration is centered on this Friday's showdown with Ivy league challenger Cornell.\n\nPetrovek is as concerned with the Ivy title as with the Nationals: \"Cornell will be the biggest game of the year for us. The squad is very league-minded.\"\n\nPetro continued, \"I'll go through my preparation very carefully. I'm very superstitious. Thursday night I'll go walking through the Yard and then up by Radcliffe. A goalie's lonely job, and I have to get prepared individually.\n\n\"Friday morning I'll have breakfast at Pewter Pot and then walk my particular route to the training meal. And my black turtleneck, I almost forgot. I don't think I'd play without it.\"\n\nUnless Cornell can successfully sabotage one black turtleneck, the Big Red will see a lot of their scoring drives turned away by number 26. And despite it all, reminds a friend, \"He still can't skate.\""}, {"url": "https://www.coloradoeagles.com/news/detail/petrovek-named-president-alternate-governor-of-colorado-eagles", "page_content": "Petrovek Named President, Alternate Governor of Colorado Eagles\n\nWINDSOR, CO. – The Colorado Eagles, proud AHL affiliate of the Colorado Avalanche, have announced that Brian Petrovek has been hired to serve as president and alternate governor of the Colorado Eagles. Petrovek most recently served as CEO and alternate governor for the AHL’s Stockton Heat from 2017 to 2020. In addition, he has previously led the American Hockey League’s Adirondack Flames (2014-15), Portland Pirates (2000-14) and Utica Devils (1987-90), as well as serving as team president of the ECHL’s Adirondack Thunder (2015-17). Petrovek’s professional experience also includes hosting three league All-Star Classics, including the AHL All-Star Game in Portland, Maine in both 2003 and 2010, and the ECHL All-Star Classic in Glens Falls, New York in 2017.\n\n\"I could not be more excited to accept this position with the Colorado Eagles,” said Petrovek. “This organization is one of the most accomplished in the world of minor-professional sports, and I am excited to help grow the Eagles to even greater heights. We have a dynamic group in the front office, world-class ownership, a premiere affiliation with the Colorado Avalanche, and a fanbase that is second to none. That combination made this an opportunity that is among the most exciting of my career.\"\n\nPetrovek’s resume also boasts a senior management position with the NHL’s New Jersey Devils, where he served as the Vice President of Marketing for four seasons under Lou Lamoriello (1989-1993). After six years with the Devils’ organization, Petrovek accepted a position with USA Hockey, where he worked for seven years as deputy executive director (1993-2000) and as executive director of the USA Hockey Foundation during his final two years (1990 -2000) in Colorado Springs. Petrovek served as Team Leader for Team USA at the 1996 World Cup of Hockey and for the United States Men’s Team at the 1998 Olympic Winter Games in Nagano, Japan. Petrovek worked with Team USA during its championship run at the 1996 World Cup of Hockey and was inducted into the US Hockey Hall of Fame with the team in 2016.\n\n“We are absolutely thrilled to be able to bring in an individual who is as accomplished in the worlds of both hockey and business as Brian,” said Eagles owner, CEO and governor Martin Lind. “The wealth of experience that he brings to the table will help us achieve the lofty goals that we have set for this team and this region for the years and decades to come.”\n\nPetrovek was an All-American goaltender at Harvard before being selected by the NHL’s Los Angeles Kings and the WHA’s Edmonton Oilers in 1975. He was inducted into the Harvard University Athletics Hall of Fame in 1998.\n\nPetrovek has built a long history of community service and leadership, most recently spending the past year as president and CEO of United Way of York County in Kennebunk, Maine. He also served on the boards of the United Way of Greater Portland and United Way of San Joaquin County."}, {"url": "https://dev.thecrimson.com/article/1988/4/21/those-greatest-of-challenges-psometimes-harvard/", "page_content": "Sometimes, Harvard sports teams look for that ultimate challenge which will not count in their conference standings. But such a challenge usually comes with a price--defeat.\n\nSometimes the challenge will come from outside national boundaries. The Harvard women's lacrosse team hosted a squad from South Australia earlier this week. Playing on a rainy Monday, the Crimson fell, 22-3.\n\nBut other times, the challenge will come from the good ol' U.S. of A.\n\nRemember when freshman goaltender Mike Francis had his first collegiate game last November against Team USA? He underwent a \"baptism by vulcanized rubber,\" as puck after puck went hurtling towards the Harvard goal.\n\nMembers of the Harvard women's water polo team may not soon forget the challenge they faced at last year's Eastern Tournament. They faced--and fell to--Sports Fest, an all-star team which representea the east in last year's National Sports Festival.\n\nThought Harvard has suffered devastating blowouts in past games which have not counted in the standings, there have been some Harvard teams which have risen to the challenge. And overcame.\n\nBrian Petrovek '77 threw a legendary 32-save effort against Team USA in the Boston Garden on November 23, 1975.\n\n\"It was nice for us to do,\" Petrovek, now the general manager of the AHL's Utica Devils, recalled, \"though I think we caught them [Team USA] early in the year.\"\n\nBut the real story behind the Crimson's 5-2 upset was the fact that Pertovek had a chance to go to Innsbruck but it was not in the cards. He missed the final cut.\n\nLast weekend all attention was focused on two shells racing on the Charles. One boat contained the Radcliffe lightweight fours with coxswain. The other contained members of the U.S. national team, stroking for the Boston Rowing Club.\n\nAdvertisement\n\n\"We've raced against them before and hadn't even come close to beating them,\" said coxswain Katia Rorer. \"We had the objective of having a good race.\"\n\nBy the time the race was over, the Radcliffe boat had overcome its challenge.\n\nBy nine seconds.\n\n\"Officially, it didn't mean a thing to anyone,\" said senior Sarah Allums. \"But unofficially, it meant just everything to us.\"\n\nIndeed, it was probably the biggest win ever for this Radcliffe fivesome, which consists of Rorer. Allums. Jennifer Honig, Hye-Jin Lim and stroke Jillian Buriak.\n\nAnd like Brian Petrovek before them, these rowers will take memories of their triumph with them--about how they overcame that greatest of challenges."}, {"url": "https://www.thecrimson.com/article/1975/3/10/bu-demolishes-harvard-icemen-7-3-pboston/", "page_content": "Boston University laid to rest all questions about which is the best college hockey team in the East with a crushing. 7-3, triumph over Harvard Saturday night to capture its second straight Eastern College Athletic Conference title.\n\nThe Terriers simply outclassed the Crimson in every aspect of the game. Harvard did not play poorly, as it had in the Beanpot final, but B.U. brought a superior brand of hockey to the ice.\n\nBoth teams opened the game cautiously yet the Crimson maintained a slight territorial advantage for the first half of the first period. Even though Harvard kept the puck in the Terrier end, the Crimson was unable is mount any good scoring threats on B.U. goalie Brian Durocher.\n\nThe Terriers' duo of Rick Meagher, the tournament's most valuable player, and Mike Eruzione got B.U. rolling. Meaghey scored tow goals within 23 seconds. On the first tally. Eruzione made a perfect pass to Meagher, who rammed it past Brian Petrovek from 15 feet out.\n\nFor his second goal. Meagher picked up a loose puck that had eluded a Harvard defenseman at the Crimson blue line and waltzed in alone on Petrovek. Meagher scored on the breakaway in textbook fashions, decoying Petro out of his skates, and lifted his team to a lightning quick 2-0 advantage.\n\nBoth goals came when the Crimson defensive tandem of Larry Pratelli and Todd Nieland was on the ice. In this respect, the game was a repeat of the 7-2 Harvard loss I the Beanpot-final, as the swift Terrier forwards were once again too much for the two to handle.\n\nThird Score\n\nThe third B.U. score of the first period, however, at 18 seconds left in the stanza, propelled the Terriers to a lead too great for the Crimson to surmount.\n\nHarvard was having difficulty working the puck out from behind the Crimson net, way onto the stick of Terrier Buddy Powers, who was all alone five feet out. He promptly backhanded around Petrovek for the tally.\n\nFor the rest of the night the contest was a game of cat and mouse. Three times Harvard came within two goals--3-1, 4-2, 5,3--but each time the Terriers surged back to restore their three-goal cushion.\n\nAdvertisement\n\nThe only thing Crimson fans could be happy about was the remarkable efficiency of the power play unit which accounted for all three goals. The Harvard power play had been batting at a lowly, 290 clip for the season, but against B.U. it was awesome, despite the absence of Jimmy Thomas on the left point. Thomas missed the game with a head injury he incurred against Cornell the night before.\n\nPerfect Shot\n\nHarvard took more shots than usual, instead of working the puck around for the perfect shot--and the strategy paid off three time. Each Crimson tally came on a rebound or a tip-in off an errant shot from far out.\n\nJim McMahon picked up two of the power play goals--first at 4:58 of the second period on a rebound of a Steve Dagdigian shot. Mac collected his second goal at 14:55, by knocking down an Eddie Rossi shot from the point and putting past Durocher from close in.\n\nDagdigian got the final Crimson score of the night, at 17:51 of the second frame gathering the rebound from another Ross point shot which Durocher had left lying in his crease.\n\nSandwiched in between the Crimson tallies were two goals by Terry Meagher Rick's older brother, that kept the Crimson at bay.\n\nB.U. put the icing on the cake on a tip in from Mike Eruzione during a five-on three power play at 6:29 of the third period.\n\nThe Terriers Ken Kuzyk added insult in injury with another tally at 15:51, and school was out for Harvard.\n\nB.U. goalie Durocher played a solid game for the Terriers, stopping 32 Crimson shots, some of which were stingers. Harvard's Petrovek, in the other net, endured perhaps his most dismal game of the season. Petro earned 19 saves, and although he was not at fault on any of the B.U. scores, he did not play up to the caliber of the top goaltender in the East.\n\nIt was the B.U. defensive corps that was the difference in the match, however. When Harvard was not on its power play, the Crimson offense was impotent. The loss of Thomas was not felt on the power play. But it was sorely suffered by linemates Leigh Hogan and Teddy Thorndike Coach Bill Cleary used Phelps Swift and Billy Hozack in an effort to get the line moving, but these substitutions were to no avail.\n\nAdvertisement\n\nRandy Roth, Dave Gauthier and Kevin Burke played solid two-way hockey, and appeared to make up the most effective Crimson line on the ice with some tenacious forecheking--but forechecking did not make the big play.\n\nThe big guns for B.U. were Eruzione and Meagher. Both forwards are only sophomores and are the second and third leading scorers on the B.U. squad.\n\nMeagher, the most dynamic player on the Terrier squad, showed that he is capable of scoring each time he touches the puck. Eruzione, though not as flashy or as smooth a skater as Meagher, is the hustler, always digging and never letting up.\n\nAs expected, both teams played a fast skating, clean game. Unlike the previous nigh against Cornell, there was no cheap stuff between the two squads. Each team had a healthy respect for the other, as though there was an unwritten agreement between the players to avoid needless rough stuff in the corners and around the net.\n\n\"A lot of players on each team know each other personally,\" said Harvard's Dave Gauthier. \"You could call our games with them grudge matches, but we're not out to really hurt each other of give cheap shots. We want to go out and play a good hard game and may the better team win.\"\n\nAll is all it wasn't pleasant way, either for the players or for the largely inebriated Crimson fans, to end a highly-successful Eastern season, Next week brings the National Collegiate Athletic Association tournament to St. Louis, Mo, and another Harvard Crack at regaining its honor against B.U."}, {"url": "https://api.thecrimson.com/article/1981/2/10/most-valuable-wade-lau-pand-then/", "page_content": "And then there was Wade Lau.\n\nThere was Boston College forward Robin Monleon with a flashy wrist shot at the nine-minute mark of the opening period. There were the last minute rushes by Eagles Billy O'Dwyer, Mark Switaj, Bobby Hehir and Gary Sampson at the crazy close of the second period. There was Switaj's sneaky flip-shot off a screen just into the third stanza. There was Eagle defenseman Mark Murphy's slapshot from the left point nine minutes into the third. There was Hehir 50 seconds later sweeping in on the Harvard net. There was the puck that landed on the back of the net at the ten-minute mark that led to a premature Eagle celebration. There was B.C. blueliner Jim Chisholm's vicious slapshot at 12:10. There were others, lost in the pages of an overflowing notebook and post-game ecstacy.\n\nAnd then, there was Wade Lau.\n\nWade Lau making pad saves, and stick saves and glove saves. Wade Lau challenging the Eagle forwards like he never challenged opposing forwards in his life. Wade Lau sliding and diving and sprawling Wade Lau culminating his revival from an almost season-long slump at exactly the right time. Wade Lau doing everything he had to do and more.\n\nThe Crimson netminder turned away 15 Boston College shots last night at the Boston Garden, leading his icemates to a stick-breaking, rafter-shaking, ice-melting, give-me-a-hug 2-0 victory, for the Crimson's first Beanpot win since 1977.\n\nAdvertisement\n\nFor his efforts, which included a Beanpot record-breaking save percentage, the first shutout in a Beanpot championship since 1967, and only two goals allowed in the tournament (after facing two of the most powerful offenses in the land), Lau was named the tournament's outstanding goaltender and MVP.\n\nBrian Petrovek was the last Harvard goaltender to garner the double honors, in 1977. It's no coincidence that Harvard last won the Beanpot that same year. There was Petrovek, and now there is Lau.\n\n\"This was Wade's shining moment,\" defenseman Mark Fusco, who had more than a few shining moments in the tourney, said. \"This is the first time he's really shown what Wade Lau can do. We couldn't have won it without him.\"\n\n\"What can I say?\" Crimson coach Billy Cleary said. \"Wade is now playing the hockey that I knew and that he knew he could play. He was just super.\"\n\nAnd what can Wade Lau, the recipient of all the hugs, of all the handshakes, the man with the Golden glove on one hand and the magic wand in the other, say? Was this the biggest thrill of his life?\n\n\"No doubt about it,\" the lanky goaltender grinned in a locker room full of cameras and pens and screaming teammates. \"No doubt about it at all.\"\n\nLast night at the Boston Garden, there was a Crimson revelation. And, at the crest of it all, there was Wade Lau."}]}