{"Brian Petrovek is the former president and CEO of the Portland Pirates, a professional ice hockey team in the American Hockey League (AHL).": [{"url": "https://www.pressherald.com/2020/06/04/united-way-of-york-county-announces-new-president/", "page_content": "Brian Petrovek has been hired as the new president and CEO of the United Way of York County.\n\nPetrovek most recently served as CEO/alternate governor for the Calgary Sports and Entertainment Corp. affiliate Stockton Heat in Stockton, California, and prior to that was CEO of the Adirondack Flames in Glen Falls, New York. Petrovek was managing owner of the Portland Pirates from 2000 to 2014.\n\nPetrovek brings a wealth of United Way volunteer experience to the position, having served as a board member at the United Way of San Joaquin County in Stockton, California, Tri-County United Way in Glen Falls, New York, and United Way of Greater Portland.\n\nPetrovek served as the initial president of 211 Maine when it was launched in 2006.\n\n“I’m grateful to the Selection Committee and Board of Directors for the opportunity, under the United Way brand, to collaborate and work with staff, stakeholders, agency partners, community leaders, donors, and volunteers throughout York County, and the State of Maine, to create solutions that will make our local community a better place to live, work and play, particularly during these unprecedented and challenging times.”\n\nPetrovek will begin on July 1.\n\nAdvertisement\n\nThe announcement comes after an extensive nationwide search conducted by Starboard Leadership Consulting following President & CEO Barb Wentworth’s decision to retire in July. Wentworth has worked at UWYC in various roles for more than 30 years, the last six years as the organization’s leader.\n\n“I have been privileged to meet and work with so many amazing staff, nonprofit and business leaders and employees and caring community members over the years. Together we have provided support and resources to thousands of our neighbors in need,” Wentworth said. “With Brian’s leadership, United Way of York County will continue its good work moving forward.”\n\nEstablished in 1986, United Way of York County was born of the merger of two smaller United Ways. Since then, UWYC has focused on the most important issues facing our community. Its community-influenced strategic plan is currently focused on ensuring the best start for children birth to age 8, helping youth develop leadership skills and community connections through service, and supporting a safety net of services that\n\nmeet basic needs, including improving nutritional outcomes for children and seniors.\n\nSend questions/comments to the editors.\n\n« Previous\n\nNext »\n\nfiled under:"}, {"url": "https://www.eliteprospects.com/staff/14872/brian-petrovek", "page_content": "Go Premium to enter Edit Mode\n\nTake control of your EliteProspects profile! Sign up for EP Premium and verify your profile to access these benefits.\n\n- Ability to add additional data to your career profile: Videos, Images, Social Media, Referrals, Fitness Testing Results and much more!\n\n- Improve your search rank\n\n- Connect directly with players, coaches, teams, scouts and agents (optional)\n\n- Premium Design on your profile page (optional)\n\n- EP Contact Book listing of your profile (optional)\n\n- Verification Badge on your profile\n\nSign up for premium"}, {"url": "https://tidesmartradio.com/brian-petrovek/", "page_content": "Show Information Show: 108\n\nAir date: Saturday, April 19\n\nGuest: Brian Petrovek\n\nHost: Steve Woods (Stevoe)\n\nStudio Contributor Debi Davis\n\nExecutive Producer: Shannon Maguire\n\nFormer CEO of the Portland Pirates Brian Petrovek grew up in the Greater Boston area. He received both his bachelor’s and master’s degrees from Harvard University, where he earned All-America honors as a goaltender and was twice named to the All-Ivy League First Team (1974-75, 1976-77). In 1977, he was named the “Most Valuable Player of the Beanpot”, one of college hockey’s most prestigious tournaments. In October 1998, he was inducted into the Harvard University Athletic Hall of Fame. Steveo and Petrovek talked about how old they were when they both started playing hockey.\n\nPetrovek, who played youth hockey in the greater Boston area, was one of four goaltenders invited to the final U.S. Olympic Team Trials Camp in 1976. He was drafted by both the Los Angeles Kings of the National Hockey League and the Edmonton Oilers of the World Hockey Association in 1975.\n\nPetrovek joined as a Managing Owner and CEO of Portland Pirates LLC during the summer of 2000. Petrovek came to the Pirates after working the previous seven years with USA Hockey, Inc. and The USA Hockey Foundation in Colorado Springs, Colorado.\n\nAs Managing Owner and CEO, Petrovek oversaw the short and long term needs of the business, represents the franchise as an alternate governor at the League level, and participates regularly as a member of various league committees. He took the lead role in developing the Pirates’ winning bids for the 2003 Dodge AHL All-Star Classic and the 2010 Time Warner Cable AHL All-Star Classic joining Rochester, Hershey and Providence as the only cities to host more than one AHL All-Star event in the league’s history. Petrovek told Stevoe that he feels fortunate to have stayed in athletics after playing hockey for Harvard.\n\nLocally, Petrovek has served as Board Chair of the United Way of Greater Portland (2007-2009), was a member of the United Way’s Annual Campaign Cabinet since 2001-2010, and Chaired the 2004 United Way Annual Campaign. Petrovek is also a founding member of the Board of Directors of the Maine Sports Foundation. Petrovek is also an Adjunct faculty member at the University of Southern Maine, teaching in the university’s Sports Management degree program."}, {"url": "https://www.wmtw.com/article/portland-pirates-brian-petrovek-resigns/2002264", "page_content": "The Portland Pirates announced on Monday that Brian Petrovek has resigned from the organization.Petrovek served as the team's CEO for 14 years before Ron Cain became the team's majority owner late last year.Petrovek then became the team's president of business development.He was at the center of the dispute between the team and the Cumberland County Civic Center over a new lease agreement last fall.The Pirates played this past season at the Lewiston Colisee, but a new deal was reached to bring the team back to Portland next season.\"Ron (Cain), Lyman (Bullard) and I started talking more definitively about the opportunity and need for change as the ink dried on a new long term lease with the Civic Center and the completion of the renovation project,\" Petrovek said in a statement on the team's website.\"My decision allows Ron to steer the ship on his own course and begin a new journey for the brand and our fans and sponsors as the team prepares for the 2014-15 season and a much welcomed return to their longtime home, the newly renovated Cumberland County Civic Center and to a community where the franchise has a longstanding history and tradition,\" Petrovek added.Pirates Chief Operating Officer Brad Church said the decision for Petrovek to step down was a collective one once a long-term contract with the civic center was in place.Church said he did not know if Petrovek would sell his shares in the team.Click here to read the entire statement from the team.\n\nThe Portland Pirates announced on Monday that Brian Petrovek has resigned from the organization.\n\nPetrovek served as the team's CEO for 14 years before Ron Cain became the team's majority owner late last year.\n\nAdvertisement\n\nPetrovek then became the team's president of business development.\n\nHe was at the center of the dispute between the team and the Cumberland County Civic Center over a new lease agreement last fall.\n\nThe Pirates played this past season at the Lewiston Colisee, but a new deal was reached to bring the team back to Portland next season.\n\n\"Ron (Cain), Lyman (Bullard) and I started talking more definitively about the opportunity and need for change as the ink dried on a new long term lease with the Civic Center and the completion of the renovation project,\" Petrovek said in a statement on the team's website.\n\n\"My decision allows Ron to steer the ship on his own course and begin a new journey for the brand and our fans and sponsors as the team prepares for the 2014-15 season and a much welcomed return to their longtime home, the newly renovated Cumberland County Civic Center and to a community where the franchise has a longstanding history and tradition,\" Petrovek added.\n\nPirates Chief Operating Officer Brad Church said the decision for Petrovek to step down was a collective one once a long-term contract with the civic center was in place.\n\nChurch said he did not know if Petrovek would sell his shares in the team.\n\nClick here to read the entire statement from the team."}, {"url": "https://www.oursportscentral.com/services/releases/portland-pirates-announce-resignation-of-brian-petrovek/n-4778685", "page_content": "Portland Pirates Announce Resignation of Brian Petrovek\n\nApril 28, 2014 - American Hockey League (AHL) - Portland Pirates News Release\n\n\n\n\n\n\n\nPortland, ME - Portland Pirates Managing Partner/CEO Ron Cain and Governor Lyman Bullard announced today that the organization has accepted the resignation of Brian Petrovek, currently President, Business Development, who served as the company's CEO for the past fourteen years.\n\nAs Managing Owner/CEO for the past fourteen seasons, Petrovek oversaw the short and long term needs of the business, represented the franchise as an alternate governor at the League level, and participated regularly as a member of various league committees. He took the lead role in developing the Pirates' winning bids for the 2003 Dodge AHL All-Star Classic and the 2010 Time Warner Cable AHL All-Star Classic joining Rochester, Hershey and Providence as the only cities to host more than one AHL All-Star event in the league's history.\n\nLocally, Petrovek served as Board Chair of the United Way of Greater Portland (2007-2009), on the City Manager's Business Advisory Council, and was a MaineHealth and Gorham Savings Bank Corporator. In 2012, Petrovek served on the City of Portland's Task Force on the Homeless and the Portland School Committee's Transition Committee for the new Superintendent of Schools.\n\nPetrovek served as President of 211 Maine, Inc. from 2003 through 2007 and also served on the Boards of Maine Medical Center, the Portland Regional and Community Chambers, Portland's Downtown District and is currently President of the Cumberland Club. He served as the President of Portland's Downtown District from 2009 to 2011. Petrovek chaired the Boy Scout Pine Tree Council's Annual Campaign in 2007, and served as Honorary Chair of the Children's Museum of Maine's 2008 Annual Campaign.\n\nPetrovek was inducted into the Junior Achievement of Maine Business Hall of Fame in 2008, an honor given to the state's most distinguished businessmen and women for their outstanding contributions to free enterprise and the promise of a better, stronger society. He also received the 2008 Henri A. Benoit Award for Leadership in the Private Sector from the Portland Regional Chamber, not only for his successful stewardship of the Pirates organization, but also for his extraordinary contribution to the greater Portland community, and was awarded the Bert Andrews Award in 2010 by the United Way of Greater Portland, the organization's highest award.\n\n\"Ron, Lyman and I started talking more definitively about the opportunity and need for change as the ink dried on a new long term lease with the Civic Center and the completion of the renovation project,\" said Petrovek, \"My decision allows Ron to steer the ship on his own course and begin a new journey for the brand and our fans and sponsors as the team prepares for the 2014-15 season and a much welcomed return to their longtime home, the newly renovated Cumberland County Civic Center and to a community where the franchise has a longstanding history and tradition. The team and business is now well situated to turn the corner and I'm honored to have played a part in that process for so many years. The best days of Portland Pirates hockey are ahead and I look forward to experiencing that now as a fan. I have been actively considering various executive management and entrepreneurial opportunities, both locally and nationally. I've been privileged to shepherd the Pirates for much longer than I had ever planned or imagined. My family and I have so much for which to be thankful, and on behalf of the team, I am grateful to so many people in the community and want to thank each of them for their support and generosity.\"\n\n\"Brian is at the top of his game - our loss will be another's gain,\" said Cain. \"What Brian and his family have contributed to the business over the past fourteen years, from hosting two AHL All Star Classics, securing successful relationships with NHL affiliates during times when the team's future was uncertain, to his tireless efforts during the Civic Center's successful bond renovation campaign, let alone all the work he and his wife have done locally serving on a myriad of civic, community and charitable boards, has been second to none and will be missed.\"\n\n• Discuss this story on the American Hockey League message board...\n\n\n\n\n\nAmerican Hockey League Stories from April 28, 2014\n\nThe opinions expressed in this release are those of the organization issuing it, and do not necessarily reflect the thoughts or opinions of OurSports Central or its staff."}, {"url": "https://www.pressherald.com/2014/04/28/petrovek__portland_pirates_part_ways_/", "page_content": "Brian Petrovek, chief executive officer of the Portland Pirates for nearly 14 years, has left the franchise after a tumultuous season that saw the American Hockey League affiliate temporarily move its home games from Portland to Lewiston and finish last in the league in both attendance and performance.\n\nThe Pirates announced Petrovek’s resignation Monday afternoon.\n\nAdditional Photos Departing CEO Brian Petrovek is praised for attracting the AHL all-star game to Portland and for his civic work. 2013 Press Herald File/John Ewing Related Headlines Portland Pirates general manager leaving for Calgary, source says\n\n“Where the Pirates are now, and as we set ourselves up for an exciting future, a lot of thanks have to go to Brian and all the work he did over the past 14 years,” said Brad Church, a former left winger for the Pirates who took over as chief operating officer during a management shakeup in late February.\n\nPetrovek, 59, was part of an ownership group led by Boston lawyer Lyman Bullard that purchased the Pirates in 2000. Bullard remained the majority owner until this winter, when Ron Cain increased his stake in the team and, shortly thereafter, took over CEO duties from Petrovek, who remained president of business development.\n\nChurch said he believes Petrovek retains his ownership stake. “Although I’m not an owner,” Church said, “so I don’t know for sure.”\n\nCalls to Petrovek, Cain and Bullard were not returned.\n\nAdvertisement\n\nBut in a prepared statement, Petrovek said, “My decision allows Ron to steer the ship on his own course and begin a new journey for the brand and our fans and sponsors as the team prepares for the 2014-15 season.”\n\nIn a statement, Cain thanked Petrovek for his service.\n\n“Brian is at the top of his game,” Cain said. “Our loss will be another’s gain.”\n\nCain lauded Petrovek’s success in attracting the AHL all-star game to Portland in 2003 and 2010 and his involvement in civic and charitable organizations. Petrovek has served on the boards of Maine Medical Center, the United Way of Greater Portland and Portland’s Downtown District.\n\nPetrovek was also the face and voice of the team’s difficult and extended lease negotiations with trustees of the Cumberland County Civic Center in 2003, 2010 and 2013. “We’ll give it three more years,” he said after grudgingly signing a 2003 agreement. “We will not play in the building three years from now unless it has been renovated or the economic terms are different.”\n\nIn 2010, Petrovek flirted with moving the franchise to Albany, N.Y., before agreeing to a two-year extension. After voters approved a $33 million bond in 2011 to renovate the civic center, its trustees reached an agreement with the Pirates on a one-year lease with an eye toward a longer-term deal.\n\nAdvertisement\n\nSuch a deal, which seemed to be imminent in April 2013, fell apart in August. In September, the team filed a lawsuit and then announced that its entire 38-game home schedule would be played at the Androscoggin Bank Colisee in Lewiston.\n\n“With any sports team, there’s a certain amount of friction around the guy who’s the face of the organization,” said Chris Hall, CEO of the Portland Regional Chamber of Commerce. “Certainly, the last year and a half has been difficult, but people should reflect on all the good years and the contributions. The city of Portland is well known as a great minor-league sports town. Well, one of the reasons is because of people like Brian Petrovek.”\n\nThe first few months in Lewiston included three sellouts and an average attendance of more than 2,600 fans. The Pirates won a franchise-low 10 “home” games. They ended the season with a 10-game losing streak and an average attendance of 2,185 – the only one of 30 AHL franchises below 3,000.\n\nA new five-year lease with the civic center was announced in February, after Cain became majority owner and the Pirates dropped their lawsuit against the county-owned facility.\n\n“Ron, Lyman and I started talking more definitively about the opportunity and need for change as the ink dried on a new long-term lease with the civic center and the completion of the renovation project,” Petrovek said in his statement.\n\nNeal Pratt, chairman of the civic center’s board of trustees, said he and Petrovek often disagreed, but their relations were never disagreeable.\n\nAdvertisement\n\n“Brian was always a zealous advocate for the team and a tireless promoter of the Pirates brand,” Pratt said. “He tried to do what was best for his team and his business and I respect that and wish him well.”\n\nPratt said the list of Petrovek’s charitable efforts is impressive.\n\n“He has done a lot of volunteer work for the community,” Pratt said, “and I think he should be recognized for that.”\n\nIn March 2013, Petrovek pleaded guilty to operating under the influence as part of a deal to avoid jail time after he crashed his Jeep Wrangler into the concrete barrier on Spring Street in Portland. His blood-alcohol content was measured at three times the legal limit for driving.\n\n“What his legacy will be, I don’t know,” said Church. “My hope is that people look at the big picture and recognize all the good that has come with his leadership of the organization.”\n\nIn another, unrelated change, the Pirates lost their general manager Monday when Brad Treliving, former assistant GM of their parent NHL club, the Phoenix Coyotes, was hired as GM of the NHL’s Calgary Flames.\n\nGlenn Jordan can be contacted at 791-6425 or at:\n\n[email protected]\n\nTwitter: GlennJordanPPH"}, {"url": "https://corubberhockey.com/hockey-business-guru-petrovek-bringing-wealth-of-experience-to-ahls-eagles-as-new-president/", "page_content": "The AHL’s Colorado Eagles announced this week that Brian Petrovek has been hired to serve as president and alternate governor of the team.\n\nPetrovek most recently served as CEO and alternate governor for the AHL’s Stockton Heat from 2017-20. In addition, he has previously led the AHL’s Adirondack Flames (2014-15), Portland Pirates (2000-14) and Utica Devils (1987-90), as well as serving as team president of the ECHL’s Adirondack Thunder (2015-17).\n\nIn addition, his professional experience also includes hosting three league All-Star Classics, including the AHL All-Star Game in Portland, Maine in both 2003 and 2010, and the ECHL All-Star Classic in Glens Falls, N.Y., in 2017.\n\n“I could not be more excited to accept this position with the Colorado Eagles,” said Petrovek. “This organization is one of the most accomplished in the world of minor-professional sports, and I am excited to help grow the Eagles to even greater heights. We have a dynamic group in the front office, world-class ownership, a premiere affiliation with the Colorado Avalanche, and a fanbase that is second to none. That combination made this an opportunity that is among the most exciting of my career.”\n\nPetrovek’s resume also boasts a senior management position with the NHL’s New Jersey Devils, where he served as the VP of marketing for four seasons under Lou Lamoriello (1989-93).\n\nAfter six years with the Devils’ organization, Petrovek accepted a position with USA Hockey, where he worked for seven years as deputy executive director (1993-2000) and as executive director of the USA Hockey Foundation during his final two years (1999-2000) in Colorado Springs. Petrovek served as team leader for Team USA at the 1996 World Cup of Hockey and for the United States men’s team at the 1998 Olympic Winter Games in Nagano, Japan. Petrovek worked with Team USA during its championship run at the 1996 World Cup of Hockey and was inducted into the US Hockey Hall of Fame with the team in 2016.\n\n“We are absolutely thrilled to be able to bring in an individual who is as accomplished in the worlds of both hockey and business as Brian,” said Eagles owner, CEO and governor Martin Lind. “The wealth of experience that he brings to the table will help us achieve the lofty goals that we have set for this team and this region for the years and decades to come.”\n\nPetrovek was an All-American goaltender at Harvard before being selected by the NHL’s Los Angeles Kings and the WHA’s Edmonton Oilers in 1975 drafts. He was inducted into the Harvard University Athletics Hall of Fame in 1998.\n\nMost recently, Petrovek spent the past year as president and CEO of United Way of York County in Kennebunk, Maine. He also served on the boards of the United Way of Greater Portland and United Way of San Joaquin County.\n\nPhoto/Stockton Heat\n\n(June 3, 2021)"}, {"url": "https://www.bangordailynews.com/2014/04/28/sports/portland-pirates-managing-owner-brian-petrovek-resigns-after-14-seasons-as-teams-ceo/", "page_content": "PORTLAND, Maine — Brian Petrovek, the managing owner and CEO of the Portland Pirates for the last 14 seasons, resigned Monday, Pirates managing partner and CEO Ron Cain and team governor Lyman Bullard announced in a news release.\n\nThe move follows a season in which the American Hockey League affiliate of the NHL’s Phoenix Coyotes had to play its home games in Lewiston instead of Portland because of a lease dispute with the Cumberland County Civic Center, which was settled in February.\n\nThe team went on to end the season with an 11-game winless streak and finished last in the league, a first in the franchise’s 20-year history.\n\nPetrovek oversaw the short- and long-term needs of the business, represented the franchise as an alternate governor at the league level, and participated regularly as a member of league committees. He took a lead role in developing the Pirates’ winning bids for the 2003 Dodge AHL All-Star Classic and the 2010 Time Warner Cable AHL All-Star Classic, joining Rochester, Hershey and Providence as the only cities to host more than one AHL All-Star event in the league’s history, according to the release.\n\n“Ron, Lyman and I started talking more definitively about the opportunity and need for change as the ink dried on a new long term lease with the Civic Center and the completion of the renovation project,” Petrovek said in the release. “My decision allows Ron to steer the ship on his own course and begin a new journey for the brand and our fans and sponsors as the team prepares for the 2014-15 season and a much welcomed return to their longtime home, the newly renovated Cumberland County Civic Center and to a community where the franchise has a longstanding history and tradition.”\n\nPetrovek added that the team and business is now well situated to turn the corner and that he was honored to have played a part in that process.\n\n“The best days of Portland Pirates hockey are ahead and I look forward to experiencing that now as a fan,” he said. “I have been actively considering various executive management and entrepreneurial opportunities, both locally and nationally. I’ve been privileged to shepherd the Pirates for much longer than I had ever planned or imagined.”\n\nCain said that Petrovek is at the top of his game and that the Pirates’ loss will be another’s gain.\n\n“What Brian and his family have contributed to the business over the past fourteen years, from hosting two AHL All Star Classics, securing successful relationships with NHL affiliates during times when the team’s future was uncertain, to his tireless efforts during the Civic Center’s successful bond renovation campaign, let alone all the work he and his wife have done locally serving on a myriad of civic, community and charitable boards, has been second to none and will be missed,” Cain said in the release.\n\nIn Portland, Petrovek served as board chairman of the United Way of Greater Portland (2007-2009), on the City Manager’s Business Advisory Council, and was a MaineHealth and Gorham Savings Bank corporator. In 2012, Petrovek served on the city of Portland’s Task Force on the Homeless and the Portland School Committee’s Transition Committee for the new superintendent of schools.\n\nPetrovek was inducted into the Junior Achievement of Maine Business Hall of Fame in 2008, an honor given to the state’s most distinguished businessmen and women for their outstanding contributions to free enterprise and the promise of a better, stronger society."}, {"url": "https://www.eliteprospects.com/player/264128/brian-petrovek", "page_content": "Edit Mode\n\nGo Premium to enter Edit Mode\n\nTake control of your EliteProspects profile! Sign up for EP Premium and verify your profile to access these benefits.\n\n- Ability to add additional data to your career profile: Videos, Images, Social Media, Referrals, Fitness Testing Results and much more!\n\n- Improve your search rank\n\n- Connect directly with players, coaches, teams, scouts and agents (optional)\n\n- Premium Design on your profile page (optional)\n\n- EP Contact Book listing of your profile (optional)\n\n- Verification Badge on your profile\n\nSign up for premium"}, {"url": "https://www.oursportscentral.com/services/releases/portland-pirates-announce-management-restructuring/n-4744918", "page_content": "Portland Pirates Announce Management Restructuring\n\nFebruary 27, 2014 - American Hockey League (AHL) - Portland Pirates News Release\n\n\n\n\n\n\n\nPortland, Maine - The Portland Pirates today announced a restructuring of their management team effective immediately.\n\nPortland Pirates majority owner Ron Cain will assume the position of Managing Partner/CEO of the Portland Pirates while current CEO Brian Petrovek becomes President, Business Development and continue in his role as AHL Alternate Governor. Joining Cain and Petrovek will be Portland Pirates Hall of Famer and current Vice President of LEGACY Global Sports, Brad Church, who will become the Portland Pirates' Chief Operating Officer and AHL Alternate Governor. Lyman Bullard will remain the Pirates' Chairman and AHL Governor.\n\nUnder the new corporate structure, all revenue generation and new business development of the Portland Pirates will be managed by Brian Petrovek including commercial rights/sponsorship sales, ticket sales, events, and broadcast properties. Sponsorship sales and servicing will be managed in partnership with Shamrock Sports and Entertainment.\n\nBrad Church will manage the Portland Pirates' day to day activities, including oversight of the Pirates communications, administration, merchandise, and finance departments as well as hockey operations and team services. Church's role will include oversight of the Pirates' community relations, game day presentation, and brand management and serve as the \"face\" of Pirates hockey throughout the community.\n\n\"This management reorganization represents an important step in the company's renewed focus on strengthening relationships with customers, growing revenues across the board, and in retooling our brand locally with our fans\", said Ron Cain, Majority Owner and Managing Partner/CEO of the Pirates. Cain became majority owner of the Pirates on December 10th, 2013 and spearheaded a new five year lease with the Cumberland County Civic Center. Cain added: \"Expanding our executive team with the addition of Brad Church, a former Pirates captain and Hall of Famer, is an expression of the commitment I made to the business and to the community when I recently became majority owner. Brian, Brad and I are looking forward to working closely together and beginning a new era of Portland Pirates Hockey throughout the region.\"\n\nSeason tickets for the 2014-15 season are now on sale as the Pirates return to the Cumberland County Civic Center! Choose the 5 on the Fly, Salty's 16, or Captain's Full Plan, all with great benefits! For more information on season ticket plans, visit portlandpirates.com/tickets/season or call 207-828-4665.\n\n• Discuss this story on the American Hockey League message board...\n\n\n\n\n\nAmerican Hockey League Stories from February 27, 2014\n\nThe opinions expressed in this release are those of the organization issuing it, and do not necessarily reflect the thoughts or opinions of OurSports Central or its staff."}]}