{"John Cushnahan was a member of the Progressive Democrats from 1985 to 2007.": [{"url": "https://www.wikiwand.com/en/John_Cushnahan", "page_content": "John Walls Cushnahan (born 23 July 1948) is a former politician in both Northern Ireland and the Republic of Ireland who served as leader of the Alliance Party of Northern Ireland and then as a Member of the European Parliament for Fine Gael.\n\nIrish politician\n\nQuick facts: John Cushnahan, Leader of the Alliance Party ... ▼\n\nCushnahan was educated at St Mary's Christian Brothers Grammar School and Queen's University, Belfast and worked as a teacher before going into politics. He worked as General Secretary of the Alliance Party from 1974 until 1982 and was a member of Belfast City Council between 1977 and 1985.\n\nIn 1982 he was elected to the Prior Assembly for North Down and two years later he became the new leader of Alliance, succeeding Oliver Napier. During his tenure as leader he sought to strengthen the party's links with the British Liberal Party. The Anglo Irish Agreement was signed during this period and Cushnahan faced the difficult position of giving Alliance support to it and facing the united opposition of the Unionist parties. However, when the Assembly was dissolved in 1986, Cushnahan found it financially difficult to remain in politics and so stood down as leader in 1987 to be succeeded by John Alderdice.\n\nTwo years later Cushnahan made a surprise political comeback when he moved to the Republic of Ireland and stood as a Fine Gael candidate in the 1989 election to the European Parliament, winning a seat in the Munster constituency. He was an MEP for fifteen years before retiring at the 2004 elections.[1]\n\nCushnahan now serves as a board member of the peace and reconciliation charity Co-operation Ireland.[2]"}, {"url": "https://www.calendarz.com/on-this-day/july/23/john-cushnahan", "page_content": "Birth\n\nJul, 23\n\nJohn Cushnahan\n\nJohn Cushnahan, Northern Irish educator and politician\n\nJohn Walls Cushnahan (born 23 July 1948) is a former politician in both Northern Ireland and the Republic of Ireland who served as leader of the Alliance Party of Northern Ireland and then as a Member of the European Parliament for Fine Gael.\n\n\n\nCushnahan was educated at St Mary's Christian Brothers Grammar School and Queen's University, Belfast and worked as a teacher before going into politics. He worked as General Secretary of the Alliance Party from 1974 until 1982 and was a member of Belfast City Council between 1977 and 1985.\n\n\n\nIn 1982 he was elected to the Prior Assembly for North Down and two years later he became the new leader of Alliance, succeeding Oliver Napier. During his tenure as leader he sought to strengthen the party's links with the British Liberal Party. The Anglo Irish Agreement was signed during this period and Cushnahan faced the difficult position of giving Alliance support to it and facing the united opposition of the Unionist parties. However, when the Assembly was dissolved in 1986, Cushnahan found it financially difficult to remain in politics and so stood down as leader in 1987 to be succeeded by John Alderdice.\n\n\n\nTwo years later Cushnahan made a surprise political comeback when he moved to the Republic of Ireland and stood as a Fine Gael candidate in the 1989 election to the European Parliament, winning a seat in the Munster constituency. He was an MEP for fifteen years before retiring at the 2004 elections.Cushnahan now serves as a board member of the peace and reconciliation charity Co-operation Ireland."}, {"url": "https://seamusdubhghaill.com/2018/07/23/birth-of-former-politician-john-cushnahan/", "page_content": "John Walls Cushnahan, former politician in both Northern Ireland and the Republic of Ireland, is born in Belfast, Northern Ireland on July 23, 1948. He serves as leader of the Alliance Party of Northern Ireland and then as a Member of the European Parliament for Fine Gael.\n\nCushnahan is educated at St. Mary’s Christian Brothers Grammar School and Queen’s University, Belfast and works as a teacher before going into politics. He works as General Secretary of the Alliance Party from 1974 until 1982 and is a member of Belfast City Council between 1977 and 1985.\n\nIn 1982 Cushnahan is elected to the Prior Assembly for North Down and two years later he becomes the new leader of Alliance, succeeding Oliver Napier. During his tenure as leader he seeks to strengthen the party’s links with the British Liberal Party. The Anglo Irish Agreement is signed during this period and Cushnahan faces the difficult position of giving Alliance support to it and facing the united opposition of the Unionist parties. However, when the Assembly is dissolved in 1986, Cushnahan finds it financially difficult to remain in politics and so stands down as leader in 1987 to be succeeded by John Alderdice.\n\nTwo years later Cushnahan makes a surprise political comeback when he moves to the Republic of Ireland and stands as a Fine Gael candidate in the 1989 election to the European Parliament, winning a seat in the Munster constituency. He is an MEP for fifteen years before retiring at the 2004 elections.\n\nCushnahan now serves as a board member of the peace and reconciliation charity Co-operation Ireland.\n\nAdvertisement\n\nShare this: Twitter\n\nFacebook\n\n"}, {"url": "https://irishelectionliterature.com/tag/john-cushnahan/", "page_content": "From the 1989 General Election a small flyer for Fine Gael North Kerry candidate Jimmy Deenihan “The People’s Champion”. Deenihan is the holder of 5 All Ireland Medals and 7 Munster medals. In this 1989 Election Deenihan polled 8,692 votes and was elected on the first count.\n\nThe European Elections took place on the same day hence the request to vote for Fine Gael Munster candidates John Cushnahan and Tom Raftery.\n\n\n\n(more…)"}, {"url": "https://wiki2.org/en/John_Cushnahan", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nIrish politician\n\nJohn Walls Cushnahan (born 23 July 1948) is a former politician in both Northern Ireland and the Republic of Ireland who served as leader of the Alliance Party of Northern Ireland and then as a Member of the European Parliament for Fine Gael.\n\nCushnahan was educated at St Mary's Christian Brothers Grammar School and Queen's University, Belfast and worked as a teacher before going into politics. He worked as General Secretary of the Alliance Party from 1974 until 1982 and was a member of Belfast City Council between 1977 and 1985.\n\nIn 1982 he was elected to the Prior Assembly for North Down and two years later he became the new leader of Alliance, succeeding Oliver Napier. During his tenure as leader he sought to strengthen the party's links with the British Liberal Party. The Anglo Irish Agreement was signed during this period and Cushnahan faced the difficult position of giving Alliance support to it and facing the united opposition of the Unionist parties. However, when the Assembly was dissolved in 1986, Cushnahan found it financially difficult to remain in politics and so stood down as leader in 1987 to be succeeded by John Alderdice.\n\nTwo years later Cushnahan made a surprise political comeback when he moved to the Republic of Ireland and stood as a Fine Gael candidate in the 1989 election to the European Parliament, winning a seat in the Munster constituency. He was an MEP for fifteen years before retiring at the 2004 elections.[1]\n\nCushnahan now serves as a board member of the peace and reconciliation charity Co-operation Ireland.[2]\n\nReferences"}, {"url": "https://www.irishnews.com/news/republicofirelandnews/2021/07/22/news/des-o-malley-founder-of-progressive-democrats-was-a-man-of-total-integrity--2395188/", "page_content": "Taoiseach Micheál Martin. File picture by Julien Behal Photography, Press Association\n\nFOUNDER of the Progressive Democrats, Des O'Malley, was committed to \"making Ireland a better place\", the Taoiseach has said following the former Irish government minister's death at the age of 82.\n\nMr O'Malley was a major figure in Irish public life for more than 30 years.\n\nOriginally a member of Fianna Fáil, he held several ministerial posts over his political career.\n\nKnown for taking a hard line against the IRA, he was appointed Fianna Fáil's justice minister during the Arms Crisis of 1970 - just two years after he was elected for Limerick East in a 1968 by-election.\n\nThe arms crisis scandal saw Fianna Fáil's Charles Haughey and Neil Blaney dismissed as cabinet ministers for alleged involvement in a conspiracy to smuggle arms to the IRA at the start of the Troubles.\n\nMr O'Malley later established the non-jury Special Criminal Court and introduced the Offences Against the State Act.\n\nHe told the Late Late Show in October 2014 that he had been threatened by the IRA several times.\n\n\"I was told by the guards that I couldn't stay in the same place in Dublin for more than a week, so I used to have move around all the time,\" he said.\n\nHis career in Fianna Fáil effectively ended in 1985 when he refused to vote against a Fine Gael–Labour Party government bill to allow the selling of condoms, despite Mr Haughey ordering party deputies to do so.\n\nFianna Fáil charged him with \"conduct unbecoming\" and expelled him from the party.\n\nHe later set up the Progressive Democrats along with several co-founders including Mary Harney.\n\nMr O'Malley stood down as leader in 1993 and retired from politics in 2002.\n\nTaoiseach Micheál Martin said Mr O'Malley had been a hugely influential figure.\n\n\"As Minister for Justice he dedicated himself to facing down an illegitimate campaign of violence that directly targeted the institutions of the State,\" he said.\n\n\"As Minister for Industry and Commerce at different times he led that Department in attracting critical investment in our country and helped to develop new industries.\n\n\"It was a record of real achievement of which he was rightly proud.\"\n\nMr Martin said Mr O'Malley's establishment of the Progressive Democrats had \"helped set a new course for Irish politics\".\n\n\"His was a life of courage and consequence,\" he said.\n\n\"He loved his country and was fearless in challenging those who used violence to undermine it.\"\n\nMs Harney, who succeeded Mr O'Malley as leader of the Progressive Democrats, said he was \"a great friend and mentor\".\n\n\"He spoke the truth and matched it with his actions,\" she said.\n\n\"At a very troubled time in our country, his bravery was rare. He was the finest public servant I have had the privilege to know.\n\n\"May he rest in peace with his beloved wife, Pat.\"\n\nJohn Cushnahan, a former leader of the Alliance Party and an ex-Fine Gael MEP, said Mr O'Malley \"displayed total integrity, courage, and a great sense of public service\".\n\n\"He was extremely courageous and uncompromising in his opposition to the IRA campaign and his actions undoubtedly prevented the Northern Ireland troubles from being worse than they were,\" he said.\n\n\"His many contributions to political life in the Republic of Ireland on social and economic policy also laid the basis for the modern European country that we have now become.\n\n\"Generations of people on both sides of the border will forever be in his debt.\""}, {"url": "https://prabook.com/web/john_wall.cushnahan/942638", "page_content": "John Wall Cushnahan Edit Profile\n\nMember of the European Parliament\n\nJohn Walls Cushnahan is a former politician in both Northern Ireland and the Republic of Ireland who served as leader of the Alliance Party of Northern Ireland and then as a Member of the European Parliament for Fine Gael.\n\nBackground CUSHNAHAN, John Wall was born on July 23, 1948.\n\nEducation Queen’s University, Belfast. Spoken languages: English.\n\nCareer In 1982 he was elected to the Prior Assembly for North Down and two years later he became the new leader of Alliance, succeeding Oliver Napier. The Anglo Irish Agreement was signed during this period and Cushnahan faced the difficult position of giving Alliance support to it and facing the united opposition of the Unionist parties. However, when the Assembly was dissolved in 1986, Cushnahan found it financially difficult to remain in politics and so stood down as leader in 1987 to be succeeded by John Alderdice.\n\n\n\nHe was an Member of the European Parliament for fifteen years before retiring at the 2004 elections.\n\nPolitics Cushnahan was educated at Street Mary\"s Christian Brothers Grammar School and Queen\"s University, Belfast and worked as a teacher before going into politics. During his tenure as leader he sought to strengthen the party\"s links with the British Liberal Party. Two years later Cushnahan made a surprise political comeback when he moved to the Republic of Ireland and stood as a Fine Gael candidate in the 1989 election to the European Parliament, winning a seat in the Munster constituency."}, {"url": "https://en-academic.com/dic.nsf/enwiki/1700035", "page_content": "John Walls Cushnahan (born 23 July 1948) is a former politician in both Northern Ireland and the Republic of Ireland who served as leader of the Alliance Party of Northern Ireland and then as a Member of the European Parliament for Fine Gael .\n\nCushnahan was educated at St Mary's Christian Brothers Grammar School and Queen's University, Belfast and worked as a teacher before going into politics. He worked as General Secretary of the Alliance Party from 1974 until 1982 and was a member of Belfast City Council between 1977 and 1985.\n\nIn 1982 he was elected to the Prior Assembly for North Down and two years later he became the new leader of Alliance, succeeding Oliver Napier . During his tenure as leader he sought to strengthen the party's links with the British Liberal Party. The Anglo Irish Agreement was signed during this period and Cushnahan faced the difficult position of giving Alliance support to it and facing the united opposition of the Unionist parties. However when the Assembly was dissolved in 1986 Cushnahan found it financially difficult to remain in politics and so stood down as leader in 1987 to be succeeded by John Alderdice .\n\nTwo years later Cushnahan made a surprise political comeback when he moved to the Republic of Ireland and stood as a Fine Gael candidate in the 1989 election to the European Parliament , winning a seat in the Munster constituency. He was an MEP for fifteen years before retiring at the 2004 elections. [ http://www.irishobserver.com/free13.htm ]"}, {"url": "https://www.echolive.ie/corknews/arid-40342025.html", "page_content": "THE late Des O’Malley was an inspirational political leader who transformed Irish politics.\n\nThat is according to former Progressive Democrats party chairman John Minihan, who paid tribute to Mr O’Malley after his death was announced this morning.\n\nMr O’Malley was 82. He served as a member of Fianna Fáil before founding the Progressive Democrats in 1985. He was a TD from 1968 to 2002.\n\nMr Minihan, who is a former Senator, said: “Des was an inspirational leader in Irish politics. He transformed Irish politics. He was a man of huge political ability, moral courage and determination in doing what was right for the people of this country.”\n\nHe continued: “He was certainly of the most influence that made me and other people like me take responsibility and become involved in politics in this country. That was a testament to the huge following he had both on a personal basis and across the political divide.”\n\nMáirín Quill, who was a founding member of the Progressive Democrats after membership of Fianna Fáil, kept in touch with Mr O'Malley up until recent weeks.\n\nShe recalled: \"Ireland has lost one of its brightest and bravest and most remarkable politicians of my generation. He should be remembered as an outstanding politician with a great brain who brought the country into modern times. He was interested in industry and commerce, and in bringing industry into Ireland. It took courage on his part to found the Progressive Democrats.\"\n\nShe added: \"The Progressive Democrats were a force of Irish politics and stood for decency and public service, not for self service.\"\n\nShe said he was elected in 1968 in a by-election following his uncle Donogh O'Malley's death and said the country owes much to both Des and Donogh.\n\nAnd she said: \"Right up to the end, Des stood for decency and defended what was good in life.\"\n\nThe Taoiseach, Mícheál Martin, paid tribute to him on Twitter. He said: \"I was deeply saddened to hear of the death of Des O’Malley. His was a life of courage and consequence. He loved his country and was fearless in challenging those who used violence to undermine it. We remember him at Government meeting today and my thoughts are with his family.\"\n\nThe Tánaiste, Leo Varadkar, tweeted: “He broke the mould of Irish politics and left a lasting and positive legacy.”\n\nThe Minister for Justice, Heather Humphreys, said in a statement: \"I would like to offer my condolences to the family, friends and former colleagues of Des O'Malley. Aged just 31, Des O'Malley was appointed Minister for Justice at one of the most difficult and threatening times in the State’s history. Des, his late wife Pat and their family endured great risk including threats from those who sought to undermine the authority of this State but Des never wavered in his duty and commitment to preserving our State and the safety and security of all its people.\"\n\nShe added: \"The steadfast service Des O’Malley gave to our State will never be forgotten by all those who cherish law and order. He was a republican in the truest sense of the word, one who broke the mould of Irish politics and helped modernise our society and our economy. May he rest in peace.\"\n\nMr O’Malley was appointed Minister for Justice during the Arms Crisis of 1970. He was a vocal opponent of Charles Haughey, who expelled him from Fianna Fail in 1984. He then went on to establish the Progressive Democrats a year later.\n\nFour years later, he led his party into a coalition with Fianna Fáil.\n\nHe stepped down from the leadership of the Progressive Democrats in 1993."}, {"url": "https://everything.explained.today/%5C/John_Cushnahan/", "page_content": "John Cushnahan Explained\n\nJohn Walls Cushnahan (born 23 July 1948) is a former politician in both Northern Ireland and the Republic of Ireland who served as leader of the Alliance Party of Northern Ireland and then as a Member of the European Parliament for Fine Gael.\n\nCushnahan was educated at St Mary's Christian Brothers Grammar School and Queen's University, Belfast and worked as a teacher before going into politics. He worked as General Secretary of the Alliance Party from 1974 until 1982 and was a member of Belfast City Council between 1977 and 1985.\n\nIn 1982 he was elected to the Prior Assembly for North Down and two years later he became the new leader of Alliance, succeeding Oliver Napier. During his tenure as leader he sought to strengthen the party's links with the British Liberal Party. The Anglo Irish Agreement was signed during this period and Cushnahan faced the difficult position of giving Alliance support to it and facing the united opposition of the Unionist parties. However, when the Assembly was dissolved in 1986, Cushnahan found it financially difficult to remain in politics and so stood down as leader in 1987 to be succeeded by John Alderdice.\n\nTwo years later Cushnahan made a surprise political comeback when he moved to the Republic of Ireland and stood as a Fine Gael candidate in the 1989 election to the European Parliament, winning a seat in the Munster constituency. He was an MEP for fifteen years before retiring at the 2004 elections.[1]\n\nCushnahan now serves as a board member of the peace and reconciliation charity Co-operation Ireland.[2]\n\nNotes and References"}]}