{"John Cushnahan was elected to the European Parliament in 1989.": [{"url": "https://www.wikiwand.com/en/John_Cushnahan", "page_content": "John Walls Cushnahan (born 23 July 1948) is a former politician in both Northern Ireland and the Republic of Ireland who served as leader of the Alliance Party of Northern Ireland and then as a Member of the European Parliament for Fine Gael.\n\nIrish politician\n\nQuick facts: John Cushnahan, Leader of the Alliance Party ... ▼\n\nCushnahan was educated at St Mary's Christian Brothers Grammar School and Queen's University, Belfast and worked as a teacher before going into politics. He worked as General Secretary of the Alliance Party from 1974 until 1982 and was a member of Belfast City Council between 1977 and 1985.\n\nIn 1982 he was elected to the Prior Assembly for North Down and two years later he became the new leader of Alliance, succeeding Oliver Napier. During his tenure as leader he sought to strengthen the party's links with the British Liberal Party. The Anglo Irish Agreement was signed during this period and Cushnahan faced the difficult position of giving Alliance support to it and facing the united opposition of the Unionist parties. However, when the Assembly was dissolved in 1986, Cushnahan found it financially difficult to remain in politics and so stood down as leader in 1987 to be succeeded by John Alderdice.\n\nTwo years later Cushnahan made a surprise political comeback when he moved to the Republic of Ireland and stood as a Fine Gael candidate in the 1989 election to the European Parliament, winning a seat in the Munster constituency. He was an MEP for fifteen years before retiring at the 2004 elections.[1]\n\nCushnahan now serves as a board member of the peace and reconciliation charity Co-operation Ireland.[2]"}, {"url": "https://cain.ulster.ac.uk/biography/Cushnahan_John_1998.html", "page_content": "Brief Biography: John Cushnahan was born in Belfast and later graduated from Queen's University Belfast with a degree in Education before going to work as teacher. He joined the Alliance Party of Northern Ireland (APNI) in the early 1970s and went on to act as its general secretary (1974-82). In addition he was to represent the party on Belfast City Council (1977-85) and in October 1982 was elected to the Northern Ireland Assembly for the constituency of North Down (1982-86). Then in 1984 Cushnahan succeeded Oliver Napier as leader of the APNI (1984-87) and in this role attempted to strengthen his party's ties with the British Liberals. The biggest test of his leadership however came with the 1985 Anglo-Irish Agreement (AIA) and he went on to ensure that the APNI largely supported its implementation. Frustrated with the lack of any immediate indication of devolved powers being returned to Northern Ireland, he then decided to resign as party leader in 1987. In 1989, after having moved to the Republic of Ireland, Cushnahan joined Fine Gael (FG) and succeeded in being elected in 1989 as a Member of the European Parliament (MEP) for the constituency of Munster (1989-2004). He announced early in 2004 his intention to stand down as an MEP.\n\n\n\n"}, {"url": "https://www.caths.cam.ac.uk/future-island-of-ireland/john-cushnahan", "page_content": "Northern Ireland needs a version update\n\nJohn Cushnahan has held public office on both sides of the Irish border, as an MLA, leader of the Alliance Party (1984-7) and a Fine Gael MEP from 1989-2004. He talks to the IoI team about changing the Good Friday Agreement and designing the framework for a future border poll. What is missing or outdated in the Agreement? How can we make Stormont work? What more is needed for post-Troubles reconciliation? And how can a border poll avoid the pitfalls of Brexit?\n\nScroll on to discover\n\nExecutive summary\n\nAbout the speaker\n\nWatch the conversation\n\nWhat was said?\n\nExecutive summary\n\nCushnahan commends the Good Friday Agreement as a “historic achievement”. We are “indebted to its architects”. However, “complacency then set in” shortly after ratification, and we began to “deceive ourselves about what was happening”. It instituted no bill of rights, no major process of post-conflict reconciliation, and “totally insufficient progress” on integration in housing and education. Its largest failure is the “inability to deliver stable political isntitutions”.The GFA should not be discarded, but needs reviewing and “corrective decisions” to “implement what was intended in 1998”.\n\nThe power-sharing system established by the 2006 St Andrew's Agreement, in which the largest party in the Assembly takes the First Minister role, and the largest party from the other tradition takes the Deputy First Ministership, has led voters to coalesce around the largest party from their community. This has produced centrifugal tendencies in Northern Irish politics, benefiting Sinn Féin and the DUP at the expense of the political centre, and failing to produce working executives. Cushnahan proposes replacing this system with governing coalitions of parties, requiring two thirds of the Assembly’s backing, “cross-community support” and sharing of first ministers.\n\nThere is still no “equality of respect” for the nationalist and unionist traditions, and “supporters of the violent campaigns of republican and loyalist terrorist organisations continue to glorify their actions, and continue to inflict suffering and pain on the families of their victims, denying them closure”. He calls for public apologies from those who perpetrated and supported paramilitary violence, greater efforts on integrated housing and education, action plans to remove peace walls (the “greatest misnomer”, actually entrenching division), and more reciprocal, mutual respect, criticising for instance Sinn Féin’s veto of a monument to commemorate the Northern Ireland Centenary at Stormont.\n\nIn the case of a border poll, Cushnahan wants to avoid the pitfalls of Brexit, where voters had minimal information on the realistic options and consequences after a Leave victory. He calls for the British and Irish governments to fund a multi-university research project, to explore in detail the options for Irish unification. This work should examine different state models for a united Ireland – a “unitary, federal or confederal” state – as well as possible “legislative and structural changes”, options for protecting minority rights, “government culture and citizenship”, and how contingencies such as Scottish independence would affect unification. This research would provide “detailed analysis”, without recommending a particular course of action. The ultimate decision would lie with the electorate, but they should be as well informed as possible.\n\nAbout the speaker\n\nJohn Cushnahan is a former student Civil Rights activist and General Secretary of the Alliance Party (1974-82) when he was the party’s only full-time politician. John was a Councillor for North Belfast 1977-85 and in 1982, was elected as Member of the Northern Ireland Assembly for the staunchly unionist constituency of North Down. John was appointed Chairman of the Assembly Education Committee and was Alliance Party Chief Whip (1982-4 ) and party leader 1984-7. When the Unionist parties used the Assembly's procedures to oppose the Anglo-Irish Agreement, in December 1985, John called on the British Government to dissolve the Assembly. This terminated his income as a full-time politician. Despite this, he led the Alliance Party into the June 1987 Westminster Election where the party doubled its share of the vote from 5-10% (this tally was not exceeded until 2019). He retired as Alliance Leader in September 1987. In 1989, he was invited by Fine Gael to contest the European Parliament (EP) election in the strongly nationalist Munster constituency. After being re-elected twice, he retired in 2004. During this period, John was elected Vice President of the EP Regional Policy and Foreign Affairs Committees and was EP rapporteur on Interreg, Hong Kong, Sri Lanka, Pakistan and Kashmir. John was also appointed by the EU Council as Head of Mission to lead multi-national and multi-disciplinary teams in South Asia on five occasions, the objective of which was to strengthen Democracy and Human Rights in the region.\n\nWatch the conversation\n\nWhat was said?\n\nThe Good Friday Agreement was a “historic achievement”, says John Cushnahan, but it has fallen far short of its aspirations. After the Agreement was ratified, “complacency then set in”, and we began to “deceive ourselves about what was happening”. Cushnahan paints a bleak picture of the peace process and democracy’s success in post-conflict Northern Ireland. There is no bill of rights, no “equality of respect” for the Unionist and Nationalist traditions, and “totally insufficient progress” on integration in education and housing. The “supporters of the violent campaigns of Republican and Loyalist terrorist organisations continue to glorify their actions, and continue to inflict suffering and pain on the families of their victims, denying them closure”. The biggest failure for Cushnahan, however, is the “inability to deliver stable political institutions”. He notes how the Stormont Executive has collapsed at least six times since 1999 (nine according some academics), and hasn’t sat for ten out of twenty two years since power-sharing was installed. But Cushnahan is still convinced and determined that the Good Friday Agreement can be amended to finally meet aspirations.\n\nJohn Cushnahan was born in 1948 to a working-class Catholic family in the lower Falls, Belfast. He was involved in student civil rights activism before entering elected politics. He became General Secretary of the Alliance Party in 1974, at the time the party’s only full time employee, and sat on the Belfast City Council from 1977-85. He served as Alliance Party leader from 1984-7, a difficult period in which Alliance backed the Anglo-Irish Agreement against concerted Unionist opposition. When Unionists blocked the Agreement, which would give the Irish Republic a consultative role in governing Northern Ireland, Cushnahan called on the British Government to prorogue Stormont. Stormont was dissolved in 1986, and Cushnahan soon after resigned his position in Alliance and moved to the Republic. Joining Fine Gael, he served as a member of the European Parliament from 1989-2004. Barry Colfer commends him for having “done more than most to build bridges North-South and East-West in British and Irish politics”. Long retired from elected office, Cushnahan is still deeply engaged with politics, brimming with analysis and suggestions.\n\n“I don’t think that we should just discard the Good Friday Agreement”, Cushnahan says. We should “review it, see where it’s defective and make corrective decisions”. He particularly wants revisions to the power-sharing system established by Good Friday and the subsequent St Andrew's Agreement (2006), in which the largest party in the Assembly takes the First Minister role, and the largest party from the other tradition takes the Deputy First Ministership. Cushnahan argues that this system has led voters to coalesce around the largest party from their community – Sinn Féin and the DUP. These centrifugal tendencies have weakened the political centre in Northern Ireland – the UUP, Alliance and SDLP – and have failed to produce working executives. Cushnahan proposes replacing this system with governing coalitions of parties, requiring two thirds of the Assembly’s backing, “cross-community support” and sharing of the first minister roles.\n\nCushnahan also wants greater efforts towards reconciliation, to meet the unfulfilled aspirations of Good Friday. Audience member, former Alliance Chairman, Phillip McGarry, asks whether Sinn Féin’s “unapologetic” defence of IRA violence serves to “undermine” reconciliation, while Fergal McCarthy enquires about possible policies for reconciliation? Cushnahan offers some solutions. He calls for a roadmap to remove the “peace walls” in cities such as Belfast – they are the “greatest misnomer”, and only entrench segregation. He also calls for greater efforts at integrating education and housing. With regards to housing, he suggests removing all paramilitary murals as a productive first step. Cushnahan is scathing about all attempts to defend paramilitary violence. “How can anyone expect reconciliation in Northern Ireland when paramilitaries on both sides continue to glorify their actions?” They should publicly apologise and commit to peaceful, democratic methods in future. Apologies would “give some comfort to the 3000 families whose relatives were slaughtered in the Troubles. And that would be an important psychological first step.”\n\nCushnahan also addresses the framework for a border poll. Noting the ambiguities of the Good Friday Agreement and the subsequent Northern Ireland Act of 1998 on how a poll should be initiated, Cushnahan argues that two thirds of Assembly votes should be required to schedule one. If a poll is scheduled, Cushnahan is determined to avoid the pitfalls of the Brexit referendum, where voters had minimal information on the realistic consequences of a Leave vote. He criticises Sinn Féin’s campaigns for reunification as “sloganizing” and insubstantial, and draws parallels between the party and Boris Johnson’s Tories – both are “cynically exploiting narrow nationalisms for electoral advantage”.\n\nCushnahan wants voters to be as informed as possible before a border poll, and calls for the British and Irish governments to fund multi-university research projects with “detailed analysis of the options” for Irish unification. This research, “coordinated under a single organisational umbrella”, would explore diverse aspects of unification. It would cover potential state models (unitary, federal and confederal), “legislative and structural changes”, options for protecting minority rights, government and citizenship in a united Ireland, and the effects of “possible shocks” such as Scottish independence. Publishing this research should “inform the public and encourage a constructive and ongoing debate well in advance of any border poll”.\n\nHowever, Cushnahan doesn’t believe that there’s “any possibility in the near future of an all-Ireland settlement.” So, in the meantime, we have to try and make Stormont work. “If we can’t unite Northern Ireland, how the hell can we unite Ireland?\" A question which will inevitably be asked again in this series and as the political fallout from Brexit continues to animate these islands."}, {"url": "https://en-academic.com/dic.nsf/enwiki/1700035", "page_content": "John Walls Cushnahan (born 23 July 1948) is a former politician in both Northern Ireland and the Republic of Ireland who served as leader of the Alliance Party of Northern Ireland and then as a Member of the European Parliament for Fine Gael .\n\nCushnahan was educated at St Mary's Christian Brothers Grammar School and Queen's University, Belfast and worked as a teacher before going into politics. He worked as General Secretary of the Alliance Party from 1974 until 1982 and was a member of Belfast City Council between 1977 and 1985.\n\nIn 1982 he was elected to the Prior Assembly for North Down and two years later he became the new leader of Alliance, succeeding Oliver Napier . During his tenure as leader he sought to strengthen the party's links with the British Liberal Party. The Anglo Irish Agreement was signed during this period and Cushnahan faced the difficult position of giving Alliance support to it and facing the united opposition of the Unionist parties. However when the Assembly was dissolved in 1986 Cushnahan found it financially difficult to remain in politics and so stood down as leader in 1987 to be succeeded by John Alderdice .\n\nTwo years later Cushnahan made a surprise political comeback when he moved to the Republic of Ireland and stood as a Fine Gael candidate in the 1989 election to the European Parliament , winning a seat in the Munster constituency. He was an MEP for fifteen years before retiring at the 2004 elections. [ http://www.irishobserver.com/free13.htm ]"}, {"url": "https://prabook.com/web/john_wall.cushnahan/942638", "page_content": "John Wall Cushnahan Edit Profile\n\nMember of the European Parliament\n\nJohn Walls Cushnahan is a former politician in both Northern Ireland and the Republic of Ireland who served as leader of the Alliance Party of Northern Ireland and then as a Member of the European Parliament for Fine Gael.\n\nBackground CUSHNAHAN, John Wall was born on July 23, 1948.\n\nEducation Queen’s University, Belfast. Spoken languages: English.\n\nCareer In 1982 he was elected to the Prior Assembly for North Down and two years later he became the new leader of Alliance, succeeding Oliver Napier. The Anglo Irish Agreement was signed during this period and Cushnahan faced the difficult position of giving Alliance support to it and facing the united opposition of the Unionist parties. However, when the Assembly was dissolved in 1986, Cushnahan found it financially difficult to remain in politics and so stood down as leader in 1987 to be succeeded by John Alderdice.\n\n\n\nHe was an Member of the European Parliament for fifteen years before retiring at the 2004 elections.\n\nPolitics Cushnahan was educated at Street Mary\"s Christian Brothers Grammar School and Queen\"s University, Belfast and worked as a teacher before going into politics. During his tenure as leader he sought to strengthen the party\"s links with the British Liberal Party. Two years later Cushnahan made a surprise political comeback when he moved to the Republic of Ireland and stood as a Fine Gael candidate in the 1989 election to the European Parliament, winning a seat in the Munster constituency."}, {"url": "https://uca.edu/politicalscience/dadm-project/asiapacific-region/ceylonsri-lanka-1948-present/", "page_content": "Pre-Crisis Phase (February 4, 1948-August 11, 1953): Ceylon formally achieved its independence from Britain and became a member of the Commonwealth of Nations (CON) on February 4, 1948. The Sri Lanka Freedom Party (SLFP) was established by Don Stephen Bandaranaike in 1951. Prime Minister Don Stephen Senanayake died in an accident on March 22, 1952, and Dudley Senanayake formed a government as prime minister on March 26, 1952. Parliamentary elections were held on May 24-31, 1952, and the United National Party (UNP) won 66 out of 101 seats in the House of Representatives. Dudley Senanayake of the UNP was re-appointed as prime minister on June 2, 1952.\n\nCrisis Phase (August 12, 1953-May 1, 1963): The government declared a state-of-emergency on August 12, 1953. Twenty-one individuals were killed in political violence in August 1953. Communists established a popular front in opposition to the government on November 7, 1953. Parliamentary elections were held on April 5-10, 1956, and the People’s United Front (Mahajana Eksath Peramuna – MEP) coalition won 56 out of 101 seats in the House of Representatives. Solomon Bandaranaike of the MEP coalition and SLFP formed a government as prime minister on April 12, 1956. Government police and demonstrators clashed in Bogawantalawa on April 2, 1958, resulting in the deaths of two individuals. Four individuals were killed in political violence in Vavuniya on May 22, 1958, and the government declared a state-of-emergency on May 27, 1958. Some 160 individuals were killed in political violence in Colombo and other cities between May 26 and June 26, 1958, and some 11,500 individuals were internally-displaced. The government lifted the state-of-emergency on March 13, 1959. Prime Minister Bandaranaike formed a new government, consisting of members of the SLFP, on June 9, 1959. Prime Minister Bandaranaike was assassinated on September 25, 1959, and Wijeyananda Dahanayake formed a government as prime minister on September 26, 1959. The government imposed a state-of-emergency on September 26, 1959. Governor-General Oliver Goonetilleke dissolved parliament on December 5, 1959. Parliamentary elections were held on March 19, 1960, and the UNP won 50 out of 151 seats in the House of Representatives. The SLFP won 46 seats in the House of Representatives. Prime Minister Dahanayake resigned on March 20, 1960, and Dudley Senanayake formed a government as prime minister on April 9-16, 1960. The government of Prime Minister Senanayake lost a vote of no-confidence in the House of Representatives on April 22, 1960, and Governor-General Goonetilleke dissolved the parliament on April 23, 1960. Parliamentary elections were held on July 20, 1960, and the SLFP won 75 out of 151 seats in the House of Representatives. The UNP won 30 seats in the House of Representatives. Prime Minister Senanayake resigned on July 21, 1960, and Sirimavo Bandaranaike of the SLFP formed a government on July 23, 1960. The government declared Sinhalese as the country’s official language on January 20, 1961. Ethnic-Tamils launched a civil disobedience campaign in the northern and eastern provinces on April 14, 1961, and the government proclaimed a state-of-emergency in the northern and eastern provinces on April 17, 1961. The government announced the discovery of a plot to overthrow the government on January 28-29, 1962, resulting in the arrest of some 30 military observers. The government lifted the state-of-emergency on May 1, 1963. Some 500 individuals were killed during the crisis.\n\nPost-Crisis Phase (May 2, 1963-January 7, 1966): The government lost a vote of no-confidence on December 3, 1964, and the parliament was dissolved on December 17, 1964. Parliamentary elections were held on March 22, 1965, and the UNP won 66 out of 156 seats in the House of Representatives. Dudley Senanayake of the UNP formed a government as prime minister on March 27, 1965. The SLFP won 41 seats in the House of Representatives. Government police and demonstrators clashed in Colombo on January 8, 1966, resulting in the death of one individual.\n\nCrisis Phase (January 8, 1966-December 7, 1966): The government proclaimed a state-of-emergency on January 8, 1966. The government lifted the state-of-emergency on December 7, 1966.\n\nPost-Crisis Phase (December 8, 1966-March 7, 1971): The People’s Liberation Front (Janatha Vimukthi Peramuna – JVP), a left-wing Sinhalese movement, was established in opposition to the government in 1967. Rohana Wijeweera, leader of the JVP, was arrested and detained in May 1970. Parliamentary elections were held on May 27, 1970, and the SLFP won 90 out of 151 seats in the House of Representatives. The UNP won 19 seats in the House of Representatives. Prime Minister Senanayake resigned on May 28, 1970, and Sirimavo Bandaranaike of the SLFP formed a coalition government as prime minister on May 29, 1970. Government police and demonstrators clashed in Dedigama on May 29, 1970, resulting in the death of one government policemen. Rohana Wijeweera was released from detention in July 1970.\n\nCrisis Phase (March 8, 1971-April 4, 1971): Members of the Mao Youth Front (MYF) led by Loku Athula attacked the US embassy in Colombo on March 8, 1971, resulting in the death of one government policeman. Five individuals were killed in an explosion in Dadigama on March 10, 1971. Rohana Wijeweera and 450 members of JVP were arrested on March 13, 1971. Prime Minister Bandaranaike declared a state-of-emergency on March 16, 1971. Some 100 individuals were killed during the crisis.\n\nConflict Phase (April 5, 1971-June 9, 1971): JVP rebels attacked the government police station in Wellawaya on April 5, 1971, resulting in the deaths of two government policemen. Government troops clashed with JVP rebels in Kegalle district on April 8, 1971, resulting in the deaths of some 30 individuals. Government troops attacked JVP rebels near Maho on April 11, 1971, resulting in the deaths of some 20 rebels. The US provided military assistance to the government beginning on April 13, 1971. Ceylon accused North Korea of providing military assistance to the JVP, and ordered North Korean diplomats out of the country on April 16, 1971. The Soviet Union provided the government with military assistance (helicopters, military aircraft, pilots, 63 military technicians) beginning on April 20, 1971. India provided military assistance (six helicopters and 150 military personnel) to the government. Pakistan provided military assistance (two helicopters) to the government of Ceylon, and Britain provided military assistance (six helicopters, weapons, and ammunition) to the government. Egypt and Yugoslavia also provided military assistance to the government. The government announced the end of the rebellion on June 9, 1971. Some 15,000 JVP rebels were arrested and detained by the government. Some 1,200 individuals, including 60 government security personnel, were killed during the conflict.\n\nPost-Conflict Phase (June 10, 1971-August 31, 1978): The Constituent Assembly approved a new constitution on January 3, 1972, and the Republic of Sri Lanka was proclaimed on May 22, 1972. William Gopallawa was inaugurated as president on May 22, 1972. The People’s Liberation Front (Janatha Vimukthi Peramuna – JVP) was banned, and Rohana Wijeweera was sentenced to life imprisonment in 1974. The government lifted the state-of-emergency, and the JVP was legalized as a political party on February 15, 1977. Parliamentary elections were held on July 21, 1977, and the United National Party (UNP) won 139 out of 168 seats in the National State Assembly. The Sri Lanka Freedom Party (SLFP) won eight seats in the National State Assembly. Nine individuals were killed in election-related violence. Junius Richard Jayewardene of the UNP formed a government as prime minister on July 23, 1977. Some 34 individuals were killed in political violence on July 22-25, 1977. Some 125 individuals were killed in political violence on August 15-31, 1977. The National State Assembly approved an amendment to the constitution on October 4, 1977, which replaced the parliamentary system with a presidential system. Rohana Wijeweera was released from prison on November 2, 1977. Prime Minister Jayewardene assumed the presidency on February 4, 1978, and appointed Ranasinghe Premadasa as prime minister on February 6, 1978. The National State Assembly approved a new constitution on August 16, 1978, and the constitution went into effect on August 31, 1978. The National State Assembly was replaced by the Parliament of Sri Lanka. Some 250 individuals were killed in political violence between June 1971 and August 1978.\n\nPost-Crisis Phase (September 1, 1978-August 16, 1981):\n\nCrisis Phase (August 17, 1981-July 27, 1987): The government declared a state-of-emergency on August 17, 1981, and lifted the state-of-emergency on January 16, 1982. On July 30, 1982, the government declared a one-month state-of-emergency following the deaths of two individuals in ethnic violence in Galle. President Jayewardene was re-elected to a second six-year term with 53 percent of the vote on October 20, 1982, and he was inaugurated on February 4, 1983. The government declared a state-of-emergency on October 20, 1982, and lifted the state-of-emergency on January 20, 1983. The government declared a state-of-emergency on May 18, 1983. The government banned the Communist Party of Sri Lanka (CPSL) in July 1983, but lifted the ban in October 1983. Some 500 individuals were killed during the crisis.\n\nConflict Phase (July 28, 1987-November 30, 1989): Sinhalese nationalists demonstrated against the government on July 28-29, 1987, resulting in the deaths of some 40 individuals. JVP rebels bombed the parliament building in Colombo on August 18, 1987. Ranasinghe Premadasa was elected president with 50 percent of the vote on December 19, 1988, and he was inaugurated as president on January 2, 1989. President Jayawardene dissolved the parliament on December 20, 1988. The government lifted the state-of-emergency on January 11, 1989. Legislative elections were held on February 15, 1989, and the UNP won 125 out of 225 seats in the parliament. The SLFP won 67 seats in the parliament. Some 1,000 individuals were killed in election-related violence. The JVP called for a boycott of the legislative elections. President Premadasa appointed Dingiri Banda Wijetunge as prime minister on March 3, 1989. The government and JVP agreed to end political violence on April 12, 1989, but the parties resumed violence on April 18, 1989. The government declared a state-of-emergency on June 20, 1989. JVP rebels unsuccessfully attempted to assassinate President Premadasa in Colombo on August 25, 1989. The government unilaterally declared a three-day ceasefire with JVP rebels on September 27, 1989. Rohana Wijeweera, leader of the JVP, was killed by government troops on November 13, 1989. Some 25,000 individuals were killed during the conflict.\n\nPost-Conflict Phase (December 1, 1989-September 4, 1994): Prime Minister Wijetunge resigned on March 28, 1990, but he formed a new government as prime minister on March 30, 1990. President Premadasa was assassinated in Colombo on May 1, 1993 (23 other individuals were also killed in the bombing), and Prime Minister Wijetunge became acting-president on May 2, 1993. President Wijetunge dissolved parliament on June 24, 1994. Legislative elections were held on August 16, 1994, and the People’s Alliance (Bahejana Nidahas Pakshaya – BNP), which was a coalition of the SLFP and several other political parties, won 105 out of 225 seats in the parliament. The UNP won 94 seats in the parliament. Nineteen individuals were killed in election-related violence. Chandrika Kumaratunga of the BNP formed a government as prime minister on August 19, 1994. The government lifted the state-of-emergency on September 4, 1994. Some 100 individuals were killed in political violence between December 1989 and September 1994.\n\nPost-Crisis Phase (September 5, 1994-August 3, 1998): Chandrika Kumaratunga of the BNP was elected president with 62 percent of the vote on November 9, 1994, and she was inaugurated as president on November 12, 1994. President Kumaratunga appointed Sirimavo Bandaranaike as prime minister on November 14, 1994. Local elections were held on March 21, 1997, and the BNP won 194 out of 238 seats on local councils.\n\nCrisis Phase (August 4, 1998-September 8, 2011): The government declared a nationwide state-of-emergency on August 4, 1998. President Kumaratunga was re-elected with 51 percent of the vote on December 21, 1999. Thirty-three individuals were killed in election-related violence. Legislative elections were held on October 10, 2000, and the BNP won 107 out of 225 seats in the parliament. The UNP won 89 seats in the parliament. The Commonwealth of Nations (CoN) sent five observers to monitor the legislative elections from October 3-13, 2000. The European Union (EU) sent six long-term observers and 70 short-term observers from 14 countries headed by John Cushnahan of Ireland to monitor the legislative elections from September 19 to October 12, 2000. Some 70 individuals were killed in election-related violence. Some 100 individuals were killed in political violence between September 1994 and July 2001. The state-of-emergency, which was declared in August 1998, lapsed on July 4, 2001. President Kumaratyngga suspended the parliament for two months on July 10, 2001. President Kumaratunga dissolved the parliament on October 10, 2001, and called for new legislative elections. Three individuals were killed in political violence in Colombo on October 29, 2001. Parliamentary elections were held on December 5, 2001, and the UNP won 109 out of 225 seats in the parliament. The BNP won 77 seats in the parliament, and the JVP won 16 seats in the parliament. The European Union (EU) sent six election experts, 12 long-term observers, and 30 short-term observers headed by John Cushnahan of Ireland to monitor the parliamentary elections from November 10 to December 10, 2001. Some 61 individuals were killed in election-related violence. Ranil Wickremesinghe of the UNP formed a government as prime minister on December 9, 2001. President Kumaratunga fired three members of the prime minister’s cabinet and suspended parliament on November 4, 2003. President Kumaratunga declared a state-of-emergency on November 5, 2003, but lifted the state-of-emergency on November 6, 2003. President Kumaratunga dissolved parliament on February 7, 2004. Parliamentary elections were held on April 2, 2004, and President Kumaratunga’s United People’s Freedom Alliance (UPFA) won 105 out of 225 seats in the parliament. The UNP won 82 seats in the parliament. The Commonwealth of Nations (CoN) sent 14 observers led by Margaret Reid of Australia to monitor the parliamentary elections from March 25 to April 2, 2004. Japan sent observers to monitor the parliamentary elections. The European Union (EU) sent seven election experts, 20 long-term observers, and 73 short-term observers headed by John Cushnahan of Ireland to monitor the parliamentary elections from March 7 to May 2, 2004. The parliament convened on April 23, 2004, and Mahinda Rajapaksa of the UPFA was elected as prime minister by the parliament. Foreign Minister Lakshman Kadirgamar was assassinated, and President Kumaratunga declared a state-of-emergency on August 12, 2005. Mahinda Rajapakse was elected president with 50 percent of the vote on November 17, 2005, and he was inaugurated as president on November 19, 2005. The EU sent seven election experts, 22 long-term observers, and 44 short-term observers headed by John Cushnahan of Ireland to monitor the presidential election from October 23 to December 4, 2005. The Commonwealth of Nations (CoN) sent six observers and three staff personnel to monitor the presidential election from November 9 to November 23, 2005. President Rajapakse appointed Ratnasiri Wickremanayake as prime minister on November 21, 2005. One individual was killed in election-related violence near the town of Hungama on January 12, 2010, and two individuals were killed in election-related violence in Waryiapola and Kurunegala on January 18, 2010. Presidential elections were held on January 26, 2010, and President Rajapakse of the UPFA was re-elected with 57 percent of the vote. The Association of Asian Election Authorities (AAEA) sent 41 observers from 14 countries headed by Wei-Ta Pan of Taiwan to monitor the presidential elections from January 20-29, 2010. The Commonwealth of Nations (CoN) sent five observers headed by K. D. Knight from Jamaica to monitor the presidential elections beginning on January 19, 2010 (a final election report was issued on February 15, 2010). Two individuals were killed in a grenade attack on a Buddhist temple in the town on Gampola on January 27, 2010. On February 8, 2010, General Sarath Fonseka, who was runner-up in the recent presidential election, was arrested by government police and charged with corruption. On February 9, 2010, President Rajapaksa dissolved the parliament and called for new elections. Legislative elections were held on April 8 and April 20, 2010, and the United People’s Freedom Alliance (UPFA) won 144 out of 225 seats in the parliament. The United National Front (UNF) won 60 seats in the parliament. President Rajapaksa appointed D. M. Jayaratne as prime minister on April 21, 2010. President Rajapaksa was sworn in for a second six-year term on November 19, 2010. The government lifted the state of emergency on September 8, 2011.\n\nPost-Crisis Phase (September 9, 2011-present): Local elections were held on October 8, 2011. India sent six election observers to monitor the local elections from October 5 to October 9, 2011. Three individuals were killed in election-related violence on October 8, 2011. General Sarath Fonseka, who was runner-up in the 2010 presidential election, was released from prison on May 21, 2012.\n\n[Sources: Associated Press (AP), December 21, 1999, December 22, 1999, February 7, 2004; Banks and Muller, 1998, 861-868; British Broadcasting Corporation (BBC), October 29, 2001, December 9, 2001, November 4, 2003, November 5, 2003, April 4, 2004, October 28, 2005, November 21, 2005, January 12, 2010, January 18, 2010, January 27, 2010, February 8, 2010, February 9, 2010, April 9, 2010, April 21, 2010, November 19, 2010, August 25, 2011, October 8, 2011, May 21, 2012; Christian Science Monitoring (CSM), October 13, 2000; Clodfelter, 1992, 1104; Commonwealth of Nations (CoN) press release, October 3, 2000, October 11, 2000, March 24, 2004, January 15, 2010, February 15, 2010; Degenhardt, 1988, 348-351; European Union (EU) report, October 10, 2000, December 5, 2001; Facts on File, March 21-27, 1952, June 6-12, 1952, August 14-20, 1953, November 20-26, 1953, April 4-10, 1956, April 11-17, 1956, April 3-9, 1958, June 5-11, 1958, October 9-15, 1958, September 24-30, 1959, March 30-April 5, 1961, June 1-7, 1961, February 1-7, 1962, May 28-June 3, 1970, March 18-24, 1971, April 8-14, 1971, April 15-21, 1971, April 29-May 5, 1971, May 6-12, 1971, February 26, 1977, July 30, 1977, August 27, 1977, September 3, 1977, July 12, 2001, December 13, 2001; Jessup, 1998, 688-689; Keesing’s Record of World Events, February 7-14, 1948, August 30-September 6, 1958, April 11-18, 1959, June 27-July 4, 1959, October 3-10, 1959, December 26, 1959-January 2, 1960, April 9-16, 1960, May 14-21, 1960, August 6-13, 1960, February 13-20, 1965, April 17-24, 1965, February 5-12, 1966, January 1-7, 1967, April 9-15, 1970, June 27-July 4, 1970, May 22-29, 1971, August 21-28, 1971, June 10-17, 1972, October 7, 1977, May 19, 1978, January 26, 1979, August 6, 1982, April 1983, August 1987, January 1989, February 1989, June 1989, September 1989, November 1989, March 1990, May 1993, June 1994, August 1994, November 1994, August 1998, December 1999; Langer, 1972, 1318-1319; New York Times (NYT), November 17, 2005, January 28, 2010, February 9, 2010, April 8, 2010, May 21, 2012; O’Ballance, 1989; Reuters, December 20, 1999, December 22, 1999, September 29, 2000, October 11, 2000, October 12, 2000, December 4, 2001, December 5, 2001, December 6, 2001, December 7, 2001, December 9, 2001, November 5, 2003, January 26, 2010, January 27, 2010, April 8, 2010, April 9, 2010; South Asia Monitor (SAM), January 1, 2002; Xinhua News Agency, March 18, 2004.]\n\nSelected Bibliography\n\nArasaratnam, S. 1972. “The Ceylon Insurrection of April 1971: Some Causes and Consequences.” Pacific Affairs 45 (Fall):\n\n356-371.\n\nDe Silva, K. M. 1981. A History of Sri Lanka. Delhi: Oxford University Press.\n\nKearney, Robert N. and Janice Jiggins. 1975. “The Ceylon Insurrection of 1971.” Journal of Contemporary and\n\nComparative Politics 13 (March): 40-64."}, {"url": "https://everything.explained.today/%5C/John_Cushnahan/", "page_content": "John Cushnahan Explained\n\nJohn Walls Cushnahan (born 23 July 1948) is a former politician in both Northern Ireland and the Republic of Ireland who served as leader of the Alliance Party of Northern Ireland and then as a Member of the European Parliament for Fine Gael.\n\nCushnahan was educated at St Mary's Christian Brothers Grammar School and Queen's University, Belfast and worked as a teacher before going into politics. He worked as General Secretary of the Alliance Party from 1974 until 1982 and was a member of Belfast City Council between 1977 and 1985.\n\nIn 1982 he was elected to the Prior Assembly for North Down and two years later he became the new leader of Alliance, succeeding Oliver Napier. During his tenure as leader he sought to strengthen the party's links with the British Liberal Party. The Anglo Irish Agreement was signed during this period and Cushnahan faced the difficult position of giving Alliance support to it and facing the united opposition of the Unionist parties. However, when the Assembly was dissolved in 1986, Cushnahan found it financially difficult to remain in politics and so stood down as leader in 1987 to be succeeded by John Alderdice.\n\nTwo years later Cushnahan made a surprise political comeback when he moved to the Republic of Ireland and stood as a Fine Gael candidate in the 1989 election to the European Parliament, winning a seat in the Munster constituency. He was an MEP for fifteen years before retiring at the 2004 elections.[1]\n\nCushnahan now serves as a board member of the peace and reconciliation charity Co-operation Ireland.[2]\n\nNotes and References"}, {"url": "https://www.calendarz.com/on-this-day/july/23/john-cushnahan", "page_content": "Birth\n\nJul, 23\n\nJohn Cushnahan\n\nJohn Cushnahan, Northern Irish educator and politician\n\nJohn Walls Cushnahan (born 23 July 1948) is a former politician in both Northern Ireland and the Republic of Ireland who served as leader of the Alliance Party of Northern Ireland and then as a Member of the European Parliament for Fine Gael.\n\n\n\nCushnahan was educated at St Mary's Christian Brothers Grammar School and Queen's University, Belfast and worked as a teacher before going into politics. He worked as General Secretary of the Alliance Party from 1974 until 1982 and was a member of Belfast City Council between 1977 and 1985.\n\n\n\nIn 1982 he was elected to the Prior Assembly for North Down and two years later he became the new leader of Alliance, succeeding Oliver Napier. During his tenure as leader he sought to strengthen the party's links with the British Liberal Party. The Anglo Irish Agreement was signed during this period and Cushnahan faced the difficult position of giving Alliance support to it and facing the united opposition of the Unionist parties. However, when the Assembly was dissolved in 1986, Cushnahan found it financially difficult to remain in politics and so stood down as leader in 1987 to be succeeded by John Alderdice.\n\n\n\nTwo years later Cushnahan made a surprise political comeback when he moved to the Republic of Ireland and stood as a Fine Gael candidate in the 1989 election to the European Parliament, winning a seat in the Munster constituency. He was an MEP for fifteen years before retiring at the 2004 elections.Cushnahan now serves as a board member of the peace and reconciliation charity Co-operation Ireland."}]}