{"John Cushnahan was born on 28 April 1945.": [{"url": "https://www.ancestry.com/genealogy/records/john-cushnahan-24-23px7kw", "page_content": "This database contains family trees submitted to Ancestry by users who have indicated that their tree can be viewed by all Ancestry subscribers.These trees can change over time as users edit, remove, or otherwise modify the data in their trees. You can contact the owner of the tree to get more information.\n\nPrivate Member Trees\n\nThis database contains family trees submitted to Ancestry by users who have indicated that their tree can only be viewed by Ancestry members to whom they have granted permission to see their tree.These trees can change over time as users edit, remove, or otherwise modify the data in their trees. If you would like to view one of these trees in its entirety, you can contact the owner of the tree to request permission to see the tree."}, {"url": "https://seamusdubhghaill.com/2018/07/23/birth-of-former-politician-john-cushnahan/", "page_content": "John Walls Cushnahan, former politician in both Northern Ireland and the Republic of Ireland, is born in Belfast, Northern Ireland on July 23, 1948. He serves as leader of the Alliance Party of Northern Ireland and then as a Member of the European Parliament for Fine Gael.\n\nCushnahan is educated at St. Mary’s Christian Brothers Grammar School and Queen’s University, Belfast and works as a teacher before going into politics. He works as General Secretary of the Alliance Party from 1974 until 1982 and is a member of Belfast City Council between 1977 and 1985.\n\nIn 1982 Cushnahan is elected to the Prior Assembly for North Down and two years later he becomes the new leader of Alliance, succeeding Oliver Napier. During his tenure as leader he seeks to strengthen the party’s links with the British Liberal Party. The Anglo Irish Agreement is signed during this period and Cushnahan faces the difficult position of giving Alliance support to it and facing the united opposition of the Unionist parties. However, when the Assembly is dissolved in 1986, Cushnahan finds it financially difficult to remain in politics and so stands down as leader in 1987 to be succeeded by John Alderdice.\n\nTwo years later Cushnahan makes a surprise political comeback when he moves to the Republic of Ireland and stands as a Fine Gael candidate in the 1989 election to the European Parliament, winning a seat in the Munster constituency. He is an MEP for fifteen years before retiring at the 2004 elections.\n\nCushnahan now serves as a board member of the peace and reconciliation charity Co-operation Ireland.\n\nAdvertisement\n\nShare this: Twitter\n\nFacebook\n\n"}, {"url": "https://www.ancestry.com/genealogy/records/john-cushnahan-24-2t5lgqn", "page_content": "This database contains family trees submitted to Ancestry by users who have indicated that their tree can be viewed by all Ancestry subscribers.These trees can change over time as users edit, remove, or otherwise modify the data in their trees. You can contact the owner of the tree to get more information.\n\nPrivate Member Trees\n\nThis database contains family trees submitted to Ancestry by users who have indicated that their tree can only be viewed by Ancestry members to whom they have granted permission to see their tree.These trees can change over time as users edit, remove, or otherwise modify the data in their trees. If you would like to view one of these trees in its entirety, you can contact the owner of the tree to request permission to see the tree."}, {"url": "https://www.ancientfaces.com/person/john-cushnahan-birth-1956-death-1976-australia/146209305", "page_content": "Refresh this page to see various historical events that occurred during John's lifetime.\n\nIn 1956, in the year that John Cushnahan was born, on May 20th, the U.S. tested the first hydrogen bomb dropped from a plane over Bikini Atoll. Previously, hydrogen bombs had only been tested on the ground. The Atomic Age moved forward.\n\nIn 1960, when he was merely 4 years old, on September 26th, the first televised debate for a Presidential campaign in the United States - Kennedy vs Nixon - was held. Seventy million people watched the debate on TV. The debate pre-empted the very popular Andy Griffith Show.\n\nIn 1962, he was merely 6 years old when on October 1st, African-American James H. Meredith, escorted by federal marshals, registered at the University of Mississippi - becoming the first African-American student admitted to the segregated college. He had been inspired by President Kennedy's inaugural address to apply for admission.\n\nIn 1976, in the year of John Cushnahan's passing, The United States celebrated the Bicentennial of the adoption of the Declaration of Independence. It was a year long celebration, with the biggest events taking place on July 4th."}, {"url": "https://www.wikiwand.com/en/John_Cushnahan", "page_content": "John Walls Cushnahan (born 23 July 1948) is a former politician in both Northern Ireland and the Republic of Ireland who served as leader of the Alliance Party of Northern Ireland and then as a Member of the European Parliament for Fine Gael.\n\nIrish politician\n\nQuick facts: John Cushnahan, Leader of the Alliance Party ... ▼\n\nCushnahan was educated at St Mary's Christian Brothers Grammar School and Queen's University, Belfast and worked as a teacher before going into politics. He worked as General Secretary of the Alliance Party from 1974 until 1982 and was a member of Belfast City Council between 1977 and 1985.\n\nIn 1982 he was elected to the Prior Assembly for North Down and two years later he became the new leader of Alliance, succeeding Oliver Napier. During his tenure as leader he sought to strengthen the party's links with the British Liberal Party. The Anglo Irish Agreement was signed during this period and Cushnahan faced the difficult position of giving Alliance support to it and facing the united opposition of the Unionist parties. However, when the Assembly was dissolved in 1986, Cushnahan found it financially difficult to remain in politics and so stood down as leader in 1987 to be succeeded by John Alderdice.\n\nTwo years later Cushnahan made a surprise political comeback when he moved to the Republic of Ireland and stood as a Fine Gael candidate in the 1989 election to the European Parliament, winning a seat in the Munster constituency. He was an MEP for fifteen years before retiring at the 2004 elections.[1]\n\nCushnahan now serves as a board member of the peace and reconciliation charity Co-operation Ireland.[2]"}, {"url": "https://www.onthisday.com/date/1945/april/28", "page_content": "About April 28, 1945\n\nDay of the Week: Saturday\n\nHow Long Ago? 78 years, 1 month and 12 days\n\nLeap Year: No"}, {"url": "https://www.calendarz.com/on-this-day/july/23/john-cushnahan", "page_content": "Birth\n\nJul, 23\n\nJohn Cushnahan\n\nJohn Cushnahan, Northern Irish educator and politician\n\nJohn Walls Cushnahan (born 23 July 1948) is a former politician in both Northern Ireland and the Republic of Ireland who served as leader of the Alliance Party of Northern Ireland and then as a Member of the European Parliament for Fine Gael.\n\n\n\nCushnahan was educated at St Mary's Christian Brothers Grammar School and Queen's University, Belfast and worked as a teacher before going into politics. He worked as General Secretary of the Alliance Party from 1974 until 1982 and was a member of Belfast City Council between 1977 and 1985.\n\n\n\nIn 1982 he was elected to the Prior Assembly for North Down and two years later he became the new leader of Alliance, succeeding Oliver Napier. During his tenure as leader he sought to strengthen the party's links with the British Liberal Party. The Anglo Irish Agreement was signed during this period and Cushnahan faced the difficult position of giving Alliance support to it and facing the united opposition of the Unionist parties. However, when the Assembly was dissolved in 1986, Cushnahan found it financially difficult to remain in politics and so stood down as leader in 1987 to be succeeded by John Alderdice.\n\n\n\nTwo years later Cushnahan made a surprise political comeback when he moved to the Republic of Ireland and stood as a Fine Gael candidate in the 1989 election to the European Parliament, winning a seat in the Munster constituency. He was an MEP for fifteen years before retiring at the 2004 elections.Cushnahan now serves as a board member of the peace and reconciliation charity Co-operation Ireland."}, {"url": "https://www.ancestry.com/genealogy/records/john-cushnahan-24-ftnqnr", "page_content": "This database contains family trees submitted to Ancestry by users who have indicated that their tree can be viewed by all Ancestry subscribers.These trees can change over time as users edit, remove, or otherwise modify the data in their trees. You can contact the owner of the tree to get more information.\n\nPrivate Member Trees\n\nThis database contains family trees submitted to Ancestry by users who have indicated that their tree can only be viewed by Ancestry members to whom they have granted permission to see their tree.These trees can change over time as users edit, remove, or otherwise modify the data in their trees. If you would like to view one of these trees in its entirety, you can contact the owner of the tree to request permission to see the tree."}, {"url": "https://www.ancestry.com/genealogy/records/john-cushnahan-24-rzglxh", "page_content": "This database contains family trees submitted to Ancestry by users who have indicated that their tree can be viewed by all Ancestry subscribers.These trees can change over time as users edit, remove, or otherwise modify the data in their trees. You can contact the owner of the tree to get more information.\n\nPrivate Member Trees\n\nThis database contains family trees submitted to Ancestry by users who have indicated that their tree can only be viewed by Ancestry members to whom they have granted permission to see their tree.These trees can change over time as users edit, remove, or otherwise modify the data in their trees. If you would like to view one of these trees in its entirety, you can contact the owner of the tree to request permission to see the tree."}, {"url": "https://www.ancestry.com/genealogy/records/john-cushnahan-24-36s08yp", "page_content": "This database contains family trees submitted to Ancestry by users who have indicated that their tree can be viewed by all Ancestry subscribers.These trees can change over time as users edit, remove, or otherwise modify the data in their trees. You can contact the owner of the tree to get more information.\n\nPrivate Member Trees\n\nThis database contains family trees submitted to Ancestry by users who have indicated that their tree can only be viewed by Ancestry members to whom they have granted permission to see their tree.These trees can change over time as users edit, remove, or otherwise modify the data in their trees. If you would like to view one of these trees in its entirety, you can contact the owner of the tree to request permission to see the tree."}], "John Cushnahan is an Irish politician.": [{"url": "https://www.wikiwand.com/en/John_Cushnahan", "page_content": "John Walls Cushnahan (born 23 July 1948) is a former politician in both Northern Ireland and the Republic of Ireland who served as leader of the Alliance Party of Northern Ireland and then as a Member of the European Parliament for Fine Gael.\n\nIrish politician\n\nQuick facts: John Cushnahan, Leader of the Alliance Party ... ▼\n\nCushnahan was educated at St Mary's Christian Brothers Grammar School and Queen's University, Belfast and worked as a teacher before going into politics. He worked as General Secretary of the Alliance Party from 1974 until 1982 and was a member of Belfast City Council between 1977 and 1985.\n\nIn 1982 he was elected to the Prior Assembly for North Down and two years later he became the new leader of Alliance, succeeding Oliver Napier. During his tenure as leader he sought to strengthen the party's links with the British Liberal Party. The Anglo Irish Agreement was signed during this period and Cushnahan faced the difficult position of giving Alliance support to it and facing the united opposition of the Unionist parties. However, when the Assembly was dissolved in 1986, Cushnahan found it financially difficult to remain in politics and so stood down as leader in 1987 to be succeeded by John Alderdice.\n\nTwo years later Cushnahan made a surprise political comeback when he moved to the Republic of Ireland and stood as a Fine Gael candidate in the 1989 election to the European Parliament, winning a seat in the Munster constituency. He was an MEP for fifteen years before retiring at the 2004 elections.[1]\n\nCushnahan now serves as a board member of the peace and reconciliation charity Co-operation Ireland.[2]"}, {"url": "https://www.irishnews.com/news/northernirelandnews/2022/03/01/news/former-alliance-leader-john-cushnahan-calls-for-universities-to-spearhead-border-poll-preparations-2601472/", "page_content": "John Cushnahan said preparations for border poll needed to begin immediately. Picture by Rui Vieira/PA Wire\n\nA FORMER leader of the Alliance Party believes preparation for a border poll should begin immediately, with academics in Ireland and Britain taking the lead.\n\nJohn Cushnahan, who led Alliance for three years up to 1987 before becoming a Fine Gael MEP, said it was important to learn from the \"mistake\" of the Brexit referendum and its \"disastrous consequences\" for Ireland and Anglo-Irish relations.\n\nHe was speaking last night at the University of Cambridge, where he addressed the topic of 'Revisiting the Good Friday Agreement and the conditions necessary for holding a border poll'.\n\nMr Cushnahan said that the 2016 EU referendum was \"preceded by little or no attempt to inform the electorate about the real issues\".\n\n\"Therefore, prior to any border poll taking place, we must ensure that the electorates in both parts of Ireland are fully informed beforehand, and I don’t mean on the eve of the poll itself – the process of educating them should take place now,\" he said.\n\nThe one-time civil rights activist said the campaign for a referendum on Irish unity had been largely led by Sinn Féin and its supporters.\n\n\"Regrettably it has consisted mainly of sloganising but has offered no detail, or substance or how it can be achieved. Furthermore, the fact they have shown little respect for the unionist tradition or British identity is totally counterproductive,\" he said.\n\n\"This is all the more worrying when, if as the opinion polls are predicting that after the next elections in both parts of Ireland, Sinn Féin will be the largest political party on the island of Ireland.\"\n\nThe former Alliance leader said the Sinn Féin's new-found status would \"place on them an important responsibility to unequivocally prove that they will actually support the principle that the unionist tradition will be treated respectfully and equally in any future al Ireland arrangement\".\n\n\"However, my fear is that Sinn Féin are merely replicating the Boris Johnson campaign on Brexit where both are cynically exploiting narrow nationalisms for electoral advantage,\" he said.\n\nMr Cushnahan said the debate about Irish unity needed to be \"inclusive and informed\", a role he believes would be best fulfilled by the academic community.\n\nHe said the British and Irish governments should fund an inter-university project involving institutions in the north, the Republic and Britain.\n\n\"Their task should be to provide a detailed analysis of the options without coming to conclusions about any particular one of them,\" he said.\n\nThe former MEP said the research should examine various political/institutional/constitutional options, including a consideration of the current constitutional structure with proposals to strengthen all -Ireland co-operation in education, health and the economy.\n\nHowever, he said the main area of consideration should be an all-Ireland constitutional arrangement, where governance options such as a unitary state, federal state, confederal state should be discussed, alongside proposals on funding for areas like pensions and defence.\n\nHe also advocates the \"continued monitoring of further possible shocks\" such as Scottish independence.\n\n\"All of these actions would be intended to inform the public and encourage a constructive and ongoing debate well in advance of any border poll that might take place,\" Mr Cushnahan said."}, {"url": "https://www.irishtimes.com/opinion/john-cushnahan-brexit-will-not-bring-irish-unity-now-dup-hold-sway-in-westminster-1.3115570", "page_content": "Twelve months ago, the then British Prime Minister David Cameron held a referendum on Britain's continuing membership of the EU. The poll was unnecessary and the decision to proceed with it had more to do with serving the interests of his own political party rather than the national interest. However, the result was not as he expected. The decision to leave the EU sent shock waves throughout the EU. However, the chain of events that had been set in motion and the threats that they posed were most acutely felt in both parts of Ireland. There was universal concern that not only would there be serious negative economic consequences but the continued implementation of the peace process could be derailed.\n\nThankfully the response of all major political parties throughout Ireland had been to work together to minimise the dangers and considerable progress was being made.\n\nUnfortunately, the current Conservative Prime Minister Theresa May was to repeat the mistake of her predecessor. She called an unnecessary general election. The motivation, once again, was for narrow party-political interests and once again the outcome was unexpected. New political uncertainties have been added to the mix just as the Brexit negotiations were about to commence between Britain and the EU.\n\nConcerns were further exacerbated by the outcome of the election of Northern Ireland's 18 MP's. The pro-Brexit DUP won 10 seats, an Independent Unionist (who is pro EU) took a seat and Sinn Fein won seven. Because Sinn Fein have affirmed that they are continuing with their policy of abstentionism, this means that there will not be a single non-unionist Northern Ireland MP present during any of the Westminster discussions on the Brexit negotiations. Furthermore, the prospect of an agreed alliance between the DUP and Theresa May to support a pro Brexit minority Conservative government adds a new twist to the situation.\n\nREAD MORE\n\nIt therefore came as no surprise that Fianna Fail leader, Micheal Martin and others called on Sinn Fein to end their policy of abstentionism and take their seats in the Westminster Parliament because \"Brexit is the single greatest issue facing our generation.\" Ending a policy of abstentionism was not something that was new to Sinn Fein. Its decision to end abstentionism for the Dail was made in 1986. Similarly, its abstentionist policy towards participation in Stormont (which after all is a British political institution) ended in the 1990's. Micheal Martin's request to Sinn Fen to accept its responsibilities and act in the national interest was therefore sensible and reasonable.\n\nIn contrast, the reaction of Sinn Fein Deputy Leader Mary Lou Mc Donald was both alarming and revealing. In her rejection of Martin's proposal, she said \"we are entering the endgame of partition which is spurred on by the logic of Irish unity in the wake of Brexit.\" This was in keeping with the reaction of her leader Gerry Adams whose reaction to the Northern Ireland Election results was that \"a referendum on Irish unity is now inevitable because of a dramatic shift among Northern Ireland voters.\"\n\nSuch statements are deliberately mischievous and provocative and are not confirmed by any objective analysis of the outcome of this general election. They merely confirm that Sinn Fein is in the process of abandoning devolution in favour of exclusively pursuing Irish unity as its primary objective. However, there are many reasons why there is little prospect of a border poll/ referendum taking place in the foreseeable future.\n\nFirstly, since the 2017 March Assembly election there has been no dramatic shift in support for nationalist parties. In fact, the gap between the two unionist parties and the two nationalist parties has widened in favour of unionism. In March 2017 that gap was 1.2%. In June 2017, it was 5.2% and if you were to add the vote for North Down MP, Lady Hermon, the gap would be 7.2%. Furthermore, Unionists won 11 seats, Nationalists only won 7 seats.\n\nThe reason for the increase in the overall unionist vote was, in my view, a direct response to the triumphalism of Gerry Adams after the 2017 Assembly election when he claimed that \"the perpetual unionist majority was ended.\" This guaranteed increased unionist participation in the voting process would not be as low again. Based on the actual statistics and not Mr. Adams false claim of a \"dramatic shift of voters\" a divisive border poll would most certainly confirm the constitutional status quo.\n\nSecondly, the Westminster election results in Scotland has (in the view of all political commentators and analysts in that country) ensured that there is little or no prospect of a second referendum on Scottish independence taking place. This therefore has clear consequences for the prospect of a border poll taking place in Northern Ireland.\n\nThirdly, if there is an agreement between the DUP and Theresa May on supporting a minority government led by her it is safe to assume that the DUP will seek assurances that a border poll will not be held.\n\nFor the reasons outlined above it is clear that in the wake of the recent British General Election, Brexit will not lead to Irish unity. What is not so clear is what impact the current political uncertainty that now exists at Westminster will have on Irish interests north and south.\n\nThe priority therefore is to ensure that putting Northern Ireland’s case is not simply left in the hands of the DUP alone who are pro Brexit. It must be an inclusive project involving all shades of political opinion in Northern Ireland and because of Sinn Fein abstentionism that can only be achieved by the restoration of a Power Sharing Executive working together to make the case for Northern Ireland as the Brexit negotiations get under way.\n\nAll possible pressure should be exerted on Sinn Fein by the other parties in the Dail to concentrate on this instead of chasing the political moonbeam of imminent Irish unity.\n\nJohn Cushnahan is a former leader of the Alliance Party of Northern Ireland and was a Fine Gael MEP"}, {"url": "https://www.irishexaminer.com/opinion/commentanalysis/arid-40789602.html", "page_content": "AWARE that the 30th anniversary of the Teebane Massacre would occur this week, I emailed all the usual news outlets. In my email, I drew their attention to the forthcoming anniversary, providing them with a link to the details of it — in which the IRA attempted to murder 14 Protestant workers 16 miles from Omagh.\n\nThis was a naked sectarian act. Eight of them died in the bombing of their vehicle, and the remainder suffered horrific injuries.\n\nOn this Sunday and Monday, the event of 30 years ago was given widespread coverage in the daily newspapers in the North, and the BBC and UTV. Here, I only saw two reports of the anniversary of the Teebane slaughter, and the Examiner was the only paper to contact me directly and asked me to write an opinion piece on the subject, which you are now reading.\n\nMy purpose in sending the email was hoping to encourage them to report on this atrocity, because I have become increasingly frustrated and annoyed at the imbalance in the coverage of the atrocities that occurred during the Northern Ireland Troubles.\n\nMy perception is that there appears to be a concentration in the Irish media primarily on atrocities that involved collusion between loyalist paramilitary organisations and a small number of corrupt members of Northern Ireland’s security forces, and also on the British Parachute Regiment who murdered innocents, particularly Catholics in Ballymurphy and on Bloody Sunday in Derry, but not only there.\n\nLet me state unequivocally that I totally support the exposure of proven instances of collusion and murder by the security forces and the prosecution of those responsible.\n\nAtrocities analysis\n\nHowever, my perception is that the media in this part of Ireland in recent times rarely broadcasts documentaries or publishes analytical articles detailing the scale and sectarian nature of IRA atrocities that happened during the Troubles, particularly when the Provisional IRA was responsible for the murders of 52% of the 3,523 victims that were killed.\n\nFive other republican terrorist groups were responsible for another 7%; 1,020 (20%) were attributed to loyalist paramilitary groups; 368 (10%) to security forces (and many of these were killed in firefights between the security forces and either loyalist or republican terrorists).\n\nWhen these figures are analysed further, it emerges that victims consisted of 1,855 civilians; 1,123 members of the security forces; 394 members of republican terrorist groups, and 151 members of loyalist paramilitary groups.\n\nI pose this question to our media; if you were to analyse the recent publication and broadcasting of the major and controversial incidents of the Troubles, would you not agree that it does not accurately reflect where the true responsibility lies for the suffering and heartbreak and pain that was callously inflicted on the families of the victims?\n\nI am not claiming that there is any bias or deliberate misleading by journalists here.\n\nAs a leading politician in the North during the worst of the Troubles, I worked very closely with Belfast- and Dublin-based journalists of RTÉ, the Irish Times, the Irish Independent, the Irish Press and the Examiner. The quality, integrity, and courage of their reporting was beyond reproach.\n\nI would say the same about their successors in their present-day reporting of Northern Ireland matters. A particular example of this is the recently retired northern editor of RTÉ, Tommie Gorman.\n\nHowever, I still maintain my main point — the recent reporting of those\n\nresponsible for violence in the North prior to the Good Friday Agreement is unbalanced\n\nMaybe part of the problem is that too many of our journalists (and voters) are too young to remember what happened in the northeastern part of our country in the years between 1970 and 2000.\n\nBut no matter what the reason, I hope that my comments will provide cause for reflection, not least of all because, in my opinion, there are significant consequences that flow from the current imbalance. I know my view on this is shared by many people, not only across the political divide here in the Republic, but also across the traditional divide in Northern Ireland itself.\n\nI believe it influences young people in the Republic of Ireland to believe that the IRA campaign was justified. It feeds the Sinn Féin narrative, and encourages them to continue to glorify and excuse the murders that the IRA committed; and to continue to refuse to offer any apologies for what happened and therefore prolong the suffering and pain which continues to be experienced by the families whose fathers, mothers, brothers, and sisters they callously murdered.\n\nJohn Cushnahan is a former leader of the Alliance Party and a former Fine Gael MEP"}, {"url": "https://www.calendarz.com/on-this-day/july/23/john-cushnahan", "page_content": "Birth\n\nJul, 23\n\nJohn Cushnahan\n\nJohn Cushnahan, Northern Irish educator and politician\n\nJohn Walls Cushnahan (born 23 July 1948) is a former politician in both Northern Ireland and the Republic of Ireland who served as leader of the Alliance Party of Northern Ireland and then as a Member of the European Parliament for Fine Gael.\n\n\n\nCushnahan was educated at St Mary's Christian Brothers Grammar School and Queen's University, Belfast and worked as a teacher before going into politics. He worked as General Secretary of the Alliance Party from 1974 until 1982 and was a member of Belfast City Council between 1977 and 1985.\n\n\n\nIn 1982 he was elected to the Prior Assembly for North Down and two years later he became the new leader of Alliance, succeeding Oliver Napier. During his tenure as leader he sought to strengthen the party's links with the British Liberal Party. The Anglo Irish Agreement was signed during this period and Cushnahan faced the difficult position of giving Alliance support to it and facing the united opposition of the Unionist parties. However, when the Assembly was dissolved in 1986, Cushnahan found it financially difficult to remain in politics and so stood down as leader in 1987 to be succeeded by John Alderdice.\n\n\n\nTwo years later Cushnahan made a surprise political comeback when he moved to the Republic of Ireland and stood as a Fine Gael candidate in the 1989 election to the European Parliament, winning a seat in the Munster constituency. He was an MEP for fifteen years before retiring at the 2004 elections.Cushnahan now serves as a board member of the peace and reconciliation charity Co-operation Ireland."}, {"url": "https://discovery.nationalarchives.gov.uk/details/c/F58566", "page_content": "This website uses cookies\n\nWe place some essential cookies on your device to make this website work.\n\n\n\nWe'd like to use additional cookies to remember your settings and understand how you use our services.\n\n\n\nThis information will help us make improvements to the website."}, {"url": "https://seamusdubhghaill.com/2018/07/23/birth-of-former-politician-john-cushnahan/", "page_content": "John Walls Cushnahan, former politician in both Northern Ireland and the Republic of Ireland, is born in Belfast, Northern Ireland on July 23, 1948. He serves as leader of the Alliance Party of Northern Ireland and then as a Member of the European Parliament for Fine Gael.\n\nCushnahan is educated at St. Mary’s Christian Brothers Grammar School and Queen’s University, Belfast and works as a teacher before going into politics. He works as General Secretary of the Alliance Party from 1974 until 1982 and is a member of Belfast City Council between 1977 and 1985.\n\nIn 1982 Cushnahan is elected to the Prior Assembly for North Down and two years later he becomes the new leader of Alliance, succeeding Oliver Napier. During his tenure as leader he seeks to strengthen the party’s links with the British Liberal Party. The Anglo Irish Agreement is signed during this period and Cushnahan faces the difficult position of giving Alliance support to it and facing the united opposition of the Unionist parties. However, when the Assembly is dissolved in 1986, Cushnahan finds it financially difficult to remain in politics and so stands down as leader in 1987 to be succeeded by John Alderdice.\n\nTwo years later Cushnahan makes a surprise political comeback when he moves to the Republic of Ireland and stands as a Fine Gael candidate in the 1989 election to the European Parliament, winning a seat in the Munster constituency. He is an MEP for fifteen years before retiring at the 2004 elections.\n\nCushnahan now serves as a board member of the peace and reconciliation charity Co-operation Ireland.\n\nAdvertisement\n\nShare this: Twitter\n\nFacebook\n\n"}, {"url": "https://www.irishtimes.com/opinion/john-cushnahan-a-united-ireland-remains-wishful-thinking-1.3008394", "page_content": "Voters in Northern Ireland discuss Irish unity and the Assembly election.\n\nThe voters of Northern Ireland have spoken once again. The election was precipitated by Sinn Féin’s decision to collapse the powersharing institutions because of the perceived political arrogance of its partner in government, the DUP.\n\nFurthermore, concerns about the possible fallout from Brexit for the Northern Ireland economy provided an additional background issue to the electoral contest.\n\nSome political figures and commentators have concluded that the results show that there has been a seismic shift in the political landscape that heralds the death knell of unionism and has therefore brought the prospect of a united Ireland closer.\n\nHowever, such wishful thinking is not borne out by an objective analysis of the results.\n\nREAD MORE\n\nThe vote obtained by unionists (DUP, UUP, TUV, PUP, Conservatives, and Claire Sugden) totalled 45.2 per cent, while the vote obtained by nationalists (Sinn Féin and SDLP) totalled 39.8 per cent.\n\nThe remaining 15 per cent was shared by the Alliance Party, People Before Profit, the Green Party and others.\n\nFurthermore, it is generally accepted by political commentators that while nationalist voters turned out in strength, unionist voters did not.\n\nConsequently, the actual size of the unionist vote was not accurately reflected in these figures.\n\nIn relation to this latter point, I believe that this will not be repeated on the next occasion that Northern Ireland goes to the polls.\n\nThe triumphalism displayed by Gerry Adams in his statement that “the perpetual unionist majority” has been “demolished” will galvanise unionism and result in increased unionist participation in future elections.\n\nBut even if we set this point aside and assume that the voting patterns that obtained in this election were to be repeated in a Border poll, as sought by Sinn Féin and its fellow travellers, the final figures would nonetheless fall far short of a majority supporting a united Ireland.\n\nOpinion polls\n\nOpinion polls on this issue in Northern Ireland over the years have consistently shown that while Protestants overwhelmingly support the current constitutional status quo, Catholics are more divided on the issue.\n\nA recent poll conducted after Brexit showed that although overall support for reunification had increased from 17 to 22 per cent, only 43 per cent of Catholics indicated that they would support a united Ireland as an option at this time.\n\nSome political commentators have concluded that the current Sinn Féin strategy is now placing more emphasis on pursuing Irish unity than on re-establishing power-sharing devolution structures.\n\nIf this is true, I would like to remind Sinn Féin that voters in the Republic of Ireland would also simultaneously have to indicate endorsement of a united Ireland for it to become a realistic option.\n\nThis being so, I would like the Sinn Féin parliamentary party in Dáil Eireann to spell out in detail how the Republic’s taxpayers are going to fund the €8-€10 billion annually that some experts have stated would be required to absorb Northern Ireland.\n\nHow many hospital beds do they think we should close? How many proposed social housing units for the homeless should we remove from our building programme? What cuts should we apply to our social welfare benefits to fund it? What revenue should we raise from water charges? What increases should there be to our taxes? And so on.\n\nThese are legitimate questions. Even if a united Ireland were to happen in the wake of Brexit, there would still be a huge financial shortfall.\n\nAlthough Northern Ireland’s farmers would be better off in a united Ireland because they would be guaranteed the continuation of Common Agricultural Policy (CAP) payments, they would still, like their southern counterparts, face significant problems selling their produce into a non-EU United Kingdom market.\n\nAnd it is reasonable to conclude that taxpayers in the Republic would be unable to fund Northern Ireland’s education, health and social welfare budgets in a post-Brexit united Ireland, given the likely impact of Brexit on our own economy.\n\nHarsh realities\n\nThese are the harsh realities that must be faced. Therefore, what are the real conclusions that we need to draw in relation to the outcome of the recent election in the North?\n\nFor me, the obvious conclusion that we must face, even though it is thoroughly depressing, is that almost 20 years after the Belfast Agreement the electoral results show that Northern Ireland is as divided as ever.\n\nAlthough the two extremes have shared power or, should I say, carved up power between them, no real attempt has been made to end the deeply embedded fear and mistrust that exists between the North’s divided communities.\n\nNo real effort has been made to bring forward policies of reconciliation to change this.\n\nIn conclusion, I would say to Sinn Féin: the recent election that you caused shows that Northern Ireland is entirely disunited.\n\nTherefore, instead of simply stating platitudes about principles that are not reflected in your corresponding actions, you should use your considerable electoral strength and abilities in concert with your fellow northern parties and give priority to uniting Northern Ireland itself by agreeing to create powersharing institutions that respect both traditions equally.\n\nJohn Cushnahan is a former leader of the Alliance Party of Northern Ireland and was a Fine Gael MEP"}, {"url": "https://www.caths.cam.ac.uk/future-island-of-ireland/john-cushnahan", "page_content": "Northern Ireland needs a version update\n\nJohn Cushnahan has held public office on both sides of the Irish border, as an MLA, leader of the Alliance Party (1984-7) and a Fine Gael MEP from 1989-2004. He talks to the IoI team about changing the Good Friday Agreement and designing the framework for a future border poll. What is missing or outdated in the Agreement? How can we make Stormont work? What more is needed for post-Troubles reconciliation? And how can a border poll avoid the pitfalls of Brexit?\n\nScroll on to discover\n\nExecutive summary\n\nAbout the speaker\n\nWatch the conversation\n\nWhat was said?\n\nExecutive summary\n\nCushnahan commends the Good Friday Agreement as a “historic achievement”. We are “indebted to its architects”. However, “complacency then set in” shortly after ratification, and we began to “deceive ourselves about what was happening”. It instituted no bill of rights, no major process of post-conflict reconciliation, and “totally insufficient progress” on integration in housing and education. Its largest failure is the “inability to deliver stable political isntitutions”.The GFA should not be discarded, but needs reviewing and “corrective decisions” to “implement what was intended in 1998”.\n\nThe power-sharing system established by the 2006 St Andrew's Agreement, in which the largest party in the Assembly takes the First Minister role, and the largest party from the other tradition takes the Deputy First Ministership, has led voters to coalesce around the largest party from their community. This has produced centrifugal tendencies in Northern Irish politics, benefiting Sinn Féin and the DUP at the expense of the political centre, and failing to produce working executives. Cushnahan proposes replacing this system with governing coalitions of parties, requiring two thirds of the Assembly’s backing, “cross-community support” and sharing of first ministers.\n\nThere is still no “equality of respect” for the nationalist and unionist traditions, and “supporters of the violent campaigns of republican and loyalist terrorist organisations continue to glorify their actions, and continue to inflict suffering and pain on the families of their victims, denying them closure”. He calls for public apologies from those who perpetrated and supported paramilitary violence, greater efforts on integrated housing and education, action plans to remove peace walls (the “greatest misnomer”, actually entrenching division), and more reciprocal, mutual respect, criticising for instance Sinn Féin’s veto of a monument to commemorate the Northern Ireland Centenary at Stormont.\n\nIn the case of a border poll, Cushnahan wants to avoid the pitfalls of Brexit, where voters had minimal information on the realistic options and consequences after a Leave victory. He calls for the British and Irish governments to fund a multi-university research project, to explore in detail the options for Irish unification. This work should examine different state models for a united Ireland – a “unitary, federal or confederal” state – as well as possible “legislative and structural changes”, options for protecting minority rights, “government culture and citizenship”, and how contingencies such as Scottish independence would affect unification. This research would provide “detailed analysis”, without recommending a particular course of action. The ultimate decision would lie with the electorate, but they should be as well informed as possible.\n\nAbout the speaker\n\nJohn Cushnahan is a former student Civil Rights activist and General Secretary of the Alliance Party (1974-82) when he was the party’s only full-time politician. John was a Councillor for North Belfast 1977-85 and in 1982, was elected as Member of the Northern Ireland Assembly for the staunchly unionist constituency of North Down. John was appointed Chairman of the Assembly Education Committee and was Alliance Party Chief Whip (1982-4 ) and party leader 1984-7. When the Unionist parties used the Assembly's procedures to oppose the Anglo-Irish Agreement, in December 1985, John called on the British Government to dissolve the Assembly. This terminated his income as a full-time politician. Despite this, he led the Alliance Party into the June 1987 Westminster Election where the party doubled its share of the vote from 5-10% (this tally was not exceeded until 2019). He retired as Alliance Leader in September 1987. In 1989, he was invited by Fine Gael to contest the European Parliament (EP) election in the strongly nationalist Munster constituency. After being re-elected twice, he retired in 2004. During this period, John was elected Vice President of the EP Regional Policy and Foreign Affairs Committees and was EP rapporteur on Interreg, Hong Kong, Sri Lanka, Pakistan and Kashmir. John was also appointed by the EU Council as Head of Mission to lead multi-national and multi-disciplinary teams in South Asia on five occasions, the objective of which was to strengthen Democracy and Human Rights in the region.\n\nWatch the conversation\n\nWhat was said?\n\nThe Good Friday Agreement was a “historic achievement”, says John Cushnahan, but it has fallen far short of its aspirations. After the Agreement was ratified, “complacency then set in”, and we began to “deceive ourselves about what was happening”. Cushnahan paints a bleak picture of the peace process and democracy’s success in post-conflict Northern Ireland. There is no bill of rights, no “equality of respect” for the Unionist and Nationalist traditions, and “totally insufficient progress” on integration in education and housing. The “supporters of the violent campaigns of Republican and Loyalist terrorist organisations continue to glorify their actions, and continue to inflict suffering and pain on the families of their victims, denying them closure”. The biggest failure for Cushnahan, however, is the “inability to deliver stable political institutions”. He notes how the Stormont Executive has collapsed at least six times since 1999 (nine according some academics), and hasn’t sat for ten out of twenty two years since power-sharing was installed. But Cushnahan is still convinced and determined that the Good Friday Agreement can be amended to finally meet aspirations.\n\nJohn Cushnahan was born in 1948 to a working-class Catholic family in the lower Falls, Belfast. He was involved in student civil rights activism before entering elected politics. He became General Secretary of the Alliance Party in 1974, at the time the party’s only full time employee, and sat on the Belfast City Council from 1977-85. He served as Alliance Party leader from 1984-7, a difficult period in which Alliance backed the Anglo-Irish Agreement against concerted Unionist opposition. When Unionists blocked the Agreement, which would give the Irish Republic a consultative role in governing Northern Ireland, Cushnahan called on the British Government to prorogue Stormont. Stormont was dissolved in 1986, and Cushnahan soon after resigned his position in Alliance and moved to the Republic. Joining Fine Gael, he served as a member of the European Parliament from 1989-2004. Barry Colfer commends him for having “done more than most to build bridges North-South and East-West in British and Irish politics”. Long retired from elected office, Cushnahan is still deeply engaged with politics, brimming with analysis and suggestions.\n\n“I don’t think that we should just discard the Good Friday Agreement”, Cushnahan says. We should “review it, see where it’s defective and make corrective decisions”. He particularly wants revisions to the power-sharing system established by Good Friday and the subsequent St Andrew's Agreement (2006), in which the largest party in the Assembly takes the First Minister role, and the largest party from the other tradition takes the Deputy First Ministership. Cushnahan argues that this system has led voters to coalesce around the largest party from their community – Sinn Féin and the DUP. These centrifugal tendencies have weakened the political centre in Northern Ireland – the UUP, Alliance and SDLP – and have failed to produce working executives. Cushnahan proposes replacing this system with governing coalitions of parties, requiring two thirds of the Assembly’s backing, “cross-community support” and sharing of the first minister roles.\n\nCushnahan also wants greater efforts towards reconciliation, to meet the unfulfilled aspirations of Good Friday. Audience member, former Alliance Chairman, Phillip McGarry, asks whether Sinn Féin’s “unapologetic” defence of IRA violence serves to “undermine” reconciliation, while Fergal McCarthy enquires about possible policies for reconciliation? Cushnahan offers some solutions. He calls for a roadmap to remove the “peace walls” in cities such as Belfast – they are the “greatest misnomer”, and only entrench segregation. He also calls for greater efforts at integrating education and housing. With regards to housing, he suggests removing all paramilitary murals as a productive first step. Cushnahan is scathing about all attempts to defend paramilitary violence. “How can anyone expect reconciliation in Northern Ireland when paramilitaries on both sides continue to glorify their actions?” They should publicly apologise and commit to peaceful, democratic methods in future. Apologies would “give some comfort to the 3000 families whose relatives were slaughtered in the Troubles. And that would be an important psychological first step.”\n\nCushnahan also addresses the framework for a border poll. Noting the ambiguities of the Good Friday Agreement and the subsequent Northern Ireland Act of 1998 on how a poll should be initiated, Cushnahan argues that two thirds of Assembly votes should be required to schedule one. If a poll is scheduled, Cushnahan is determined to avoid the pitfalls of the Brexit referendum, where voters had minimal information on the realistic consequences of a Leave vote. He criticises Sinn Féin’s campaigns for reunification as “sloganizing” and insubstantial, and draws parallels between the party and Boris Johnson’s Tories – both are “cynically exploiting narrow nationalisms for electoral advantage”.\n\nCushnahan wants voters to be as informed as possible before a border poll, and calls for the British and Irish governments to fund multi-university research projects with “detailed analysis of the options” for Irish unification. This research, “coordinated under a single organisational umbrella”, would explore diverse aspects of unification. It would cover potential state models (unitary, federal and confederal), “legislative and structural changes”, options for protecting minority rights, government and citizenship in a united Ireland, and the effects of “possible shocks” such as Scottish independence. Publishing this research should “inform the public and encourage a constructive and ongoing debate well in advance of any border poll”.\n\nHowever, Cushnahan doesn’t believe that there’s “any possibility in the near future of an all-Ireland settlement.” So, in the meantime, we have to try and make Stormont work. “If we can’t unite Northern Ireland, how the hell can we unite Ireland?\" A question which will inevitably be asked again in this series and as the political fallout from Brexit continues to animate these islands."}, {"url": "https://cain.ulster.ac.uk/biography/Cushnahan_John_1998.html", "page_content": "Brief Biography: John Cushnahan was born in Belfast and later graduated from Queen's University Belfast with a degree in Education before going to work as teacher. He joined the Alliance Party of Northern Ireland (APNI) in the early 1970s and went on to act as its general secretary (1974-82). In addition he was to represent the party on Belfast City Council (1977-85) and in October 1982 was elected to the Northern Ireland Assembly for the constituency of North Down (1982-86). Then in 1984 Cushnahan succeeded Oliver Napier as leader of the APNI (1984-87) and in this role attempted to strengthen his party's ties with the British Liberals. The biggest test of his leadership however came with the 1985 Anglo-Irish Agreement (AIA) and he went on to ensure that the APNI largely supported its implementation. Frustrated with the lack of any immediate indication of devolved powers being returned to Northern Ireland, he then decided to resign as party leader in 1987. In 1989, after having moved to the Republic of Ireland, Cushnahan joined Fine Gael (FG) and succeeded in being elected in 1989 as a Member of the European Parliament (MEP) for the constituency of Munster (1989-2004). He announced early in 2004 his intention to stand down as an MEP.\n\n\n\n"}], "John Cushnahan was a former Member of the European Parliament (MEP) for the Dublin constituency.": [{"url": "https://en-academic.com/dic.nsf/enwiki/1700035", "page_content": "John Walls Cushnahan (born 23 July 1948) is a former politician in both Northern Ireland and the Republic of Ireland who served as leader of the Alliance Party of Northern Ireland and then as a Member of the European Parliament for Fine Gael .\n\nCushnahan was educated at St Mary's Christian Brothers Grammar School and Queen's University, Belfast and worked as a teacher before going into politics. He worked as General Secretary of the Alliance Party from 1974 until 1982 and was a member of Belfast City Council between 1977 and 1985.\n\nIn 1982 he was elected to the Prior Assembly for North Down and two years later he became the new leader of Alliance, succeeding Oliver Napier . During his tenure as leader he sought to strengthen the party's links with the British Liberal Party. The Anglo Irish Agreement was signed during this period and Cushnahan faced the difficult position of giving Alliance support to it and facing the united opposition of the Unionist parties. However when the Assembly was dissolved in 1986 Cushnahan found it financially difficult to remain in politics and so stood down as leader in 1987 to be succeeded by John Alderdice .\n\nTwo years later Cushnahan made a surprise political comeback when he moved to the Republic of Ireland and stood as a Fine Gael candidate in the 1989 election to the European Parliament , winning a seat in the Munster constituency. He was an MEP for fifteen years before retiring at the 2004 elections. [ http://www.irishobserver.com/free13.htm ]"}, {"url": "https://www.irishnews.com/news/northernirelandnews/2022/03/01/news/former-alliance-leader-john-cushnahan-calls-for-universities-to-spearhead-border-poll-preparations-2601472/", "page_content": "John Cushnahan said preparations for border poll needed to begin immediately. Picture by Rui Vieira/PA Wire\n\nA FORMER leader of the Alliance Party believes preparation for a border poll should begin immediately, with academics in Ireland and Britain taking the lead.\n\nJohn Cushnahan, who led Alliance for three years up to 1987 before becoming a Fine Gael MEP, said it was important to learn from the \"mistake\" of the Brexit referendum and its \"disastrous consequences\" for Ireland and Anglo-Irish relations.\n\nHe was speaking last night at the University of Cambridge, where he addressed the topic of 'Revisiting the Good Friday Agreement and the conditions necessary for holding a border poll'.\n\nMr Cushnahan said that the 2016 EU referendum was \"preceded by little or no attempt to inform the electorate about the real issues\".\n\n\"Therefore, prior to any border poll taking place, we must ensure that the electorates in both parts of Ireland are fully informed beforehand, and I don’t mean on the eve of the poll itself – the process of educating them should take place now,\" he said.\n\nThe one-time civil rights activist said the campaign for a referendum on Irish unity had been largely led by Sinn Féin and its supporters.\n\n\"Regrettably it has consisted mainly of sloganising but has offered no detail, or substance or how it can be achieved. Furthermore, the fact they have shown little respect for the unionist tradition or British identity is totally counterproductive,\" he said.\n\n\"This is all the more worrying when, if as the opinion polls are predicting that after the next elections in both parts of Ireland, Sinn Féin will be the largest political party on the island of Ireland.\"\n\nThe former Alliance leader said the Sinn Féin's new-found status would \"place on them an important responsibility to unequivocally prove that they will actually support the principle that the unionist tradition will be treated respectfully and equally in any future al Ireland arrangement\".\n\n\"However, my fear is that Sinn Féin are merely replicating the Boris Johnson campaign on Brexit where both are cynically exploiting narrow nationalisms for electoral advantage,\" he said.\n\nMr Cushnahan said the debate about Irish unity needed to be \"inclusive and informed\", a role he believes would be best fulfilled by the academic community.\n\nHe said the British and Irish governments should fund an inter-university project involving institutions in the north, the Republic and Britain.\n\n\"Their task should be to provide a detailed analysis of the options without coming to conclusions about any particular one of them,\" he said.\n\nThe former MEP said the research should examine various political/institutional/constitutional options, including a consideration of the current constitutional structure with proposals to strengthen all -Ireland co-operation in education, health and the economy.\n\nHowever, he said the main area of consideration should be an all-Ireland constitutional arrangement, where governance options such as a unitary state, federal state, confederal state should be discussed, alongside proposals on funding for areas like pensions and defence.\n\nHe also advocates the \"continued monitoring of further possible shocks\" such as Scottish independence.\n\n\"All of these actions would be intended to inform the public and encourage a constructive and ongoing debate well in advance of any border poll that might take place,\" Mr Cushnahan said."}, {"url": "https://prabook.com/web/john_wall.cushnahan/942638", "page_content": "John Wall Cushnahan Edit Profile\n\nMember of the European Parliament\n\nJohn Walls Cushnahan is a former politician in both Northern Ireland and the Republic of Ireland who served as leader of the Alliance Party of Northern Ireland and then as a Member of the European Parliament for Fine Gael.\n\nBackground CUSHNAHAN, John Wall was born on July 23, 1948.\n\nEducation Queen’s University, Belfast. Spoken languages: English.\n\nCareer In 1982 he was elected to the Prior Assembly for North Down and two years later he became the new leader of Alliance, succeeding Oliver Napier. The Anglo Irish Agreement was signed during this period and Cushnahan faced the difficult position of giving Alliance support to it and facing the united opposition of the Unionist parties. However, when the Assembly was dissolved in 1986, Cushnahan found it financially difficult to remain in politics and so stood down as leader in 1987 to be succeeded by John Alderdice.\n\n\n\nHe was an Member of the European Parliament for fifteen years before retiring at the 2004 elections.\n\nPolitics Cushnahan was educated at Street Mary\"s Christian Brothers Grammar School and Queen\"s University, Belfast and worked as a teacher before going into politics. During his tenure as leader he sought to strengthen the party\"s links with the British Liberal Party. Two years later Cushnahan made a surprise political comeback when he moved to the Republic of Ireland and stood as a Fine Gael candidate in the 1989 election to the European Parliament, winning a seat in the Munster constituency."}, {"url": "https://alchetron.com/John-Cushnahan", "page_content": "John Walls Cushnahan (born 23 July 1948) is a former politician in both Northern Ireland and the Republic of Ireland who served as leader of the Alliance Party of Northern Ireland and then as a Member of the European Parliament for Fine Gael.\n\nCushnahan was educated at St Mary's Christian Brothers Grammar School and Queen's University, Belfast and worked as a teacher before going into politics. He worked as General Secretary of the Alliance Party from 1974 until 1982 and was a member of Belfast City Council between 1977 and 1985.\n\nIn 1982 he was elected to the Prior Assembly for North Down and two years later he became the new leader of Alliance, succeeding Oliver Napier. During his tenure as leader he sought to strengthen the party's links with the British Liberal Party. The Anglo Irish Agreement was signed during this period and Cushnahan faced the difficult position of giving Alliance support to it and facing the united opposition of the Unionist parties. However, when the Assembly was dissolved in 1986, Cushnahan found it financially difficult to remain in politics and so stood down as leader in 1987 to be succeeded by John Alderdice.\n\nTwo years later Cushnahan made a surprise political comeback when he moved to the Republic of Ireland and stood as a Fine Gael candidate in the 1989 election to the European Parliament, winning a seat in the Munster constituency. He was an MEP for fifteen years before retiring at the 2004 elections.\n\nCushnahan now serves as a board member of the peace and reconciliation charity Co-operation Ireland."}, {"url": "https://seamusdubhghaill.com/2018/07/23/birth-of-former-politician-john-cushnahan/", "page_content": "John Walls Cushnahan, former politician in both Northern Ireland and the Republic of Ireland, is born in Belfast, Northern Ireland on July 23, 1948. He serves as leader of the Alliance Party of Northern Ireland and then as a Member of the European Parliament for Fine Gael.\n\nCushnahan is educated at St. Mary’s Christian Brothers Grammar School and Queen’s University, Belfast and works as a teacher before going into politics. He works as General Secretary of the Alliance Party from 1974 until 1982 and is a member of Belfast City Council between 1977 and 1985.\n\nIn 1982 Cushnahan is elected to the Prior Assembly for North Down and two years later he becomes the new leader of Alliance, succeeding Oliver Napier. During his tenure as leader he seeks to strengthen the party’s links with the British Liberal Party. The Anglo Irish Agreement is signed during this period and Cushnahan faces the difficult position of giving Alliance support to it and facing the united opposition of the Unionist parties. However, when the Assembly is dissolved in 1986, Cushnahan finds it financially difficult to remain in politics and so stands down as leader in 1987 to be succeeded by John Alderdice.\n\nTwo years later Cushnahan makes a surprise political comeback when he moves to the Republic of Ireland and stands as a Fine Gael candidate in the 1989 election to the European Parliament, winning a seat in the Munster constituency. He is an MEP for fifteen years before retiring at the 2004 elections.\n\nCushnahan now serves as a board member of the peace and reconciliation charity Co-operation Ireland.\n\nAdvertisement\n\nShare this: Twitter\n\nFacebook\n\n"}, {"url": "https://www.europarl.europa.eu/ireland/en/your-meps/irish-meps-1999-2004", "page_content": "Irish MEPs: 1999-2004\n\nIn 1999 Ireland elected 15 MEPs to the European Parliament representing 4 constituencies:\n\nDublin, Leinster, Munster and Connacht-Ulster\n\nDUBLIN CONSTITUENCY\n\nNiall Andrews\n\nNiall Andrews\n\nEuropean Group: UEN\n\nIrish Party: Fianna Fáil\n\n\n\nConstituency: Dublin\n\nNiall Andrews profile page\n\nMary Banotti\n\nMary Banotti\n\nEuropean Group: EPP-ED\n\nIrish Party: Fine Gael\n\n\n\nConstituency: Dublin\n\nMary Banotti profile page\n\nProinsias De Rossa\n\nProinsias De Rossa\n\nEuropean Party: S&D\n\nIrish Party: Labour\n\n\n\nConstituency: Dublin\n\nProinsias De Rossa profile page\n\nPatricia McKenna\n\nPatricia McKenna\n\nEuropean Group: Green Group\n\nIrish Party: Green Party\n\n\n\nConstituency: Dublin\n\nPatricia McKenna profile page\n\nLEINSTER CONSTITUENCY\n\nNuala Ahern\n\nNuala Ahern\n\nEuropean Group: Green Group\n\nIrish Party: Green Party\n\n\n\nConstituency: Leinster\n\nNuala Ahern profile page\n\nAvril Doyle\n\nAvril Doyle\n\nEuropean Group: EPP-ED\n\nIrish Party: Fine Gael\n\n\n\nConstituency: Leinster\n\nAvril Doyle profile page\n\nJim Fitzsimons\n\nJim Fitzsimons\n\nEuropean Group: UEN\n\nIrish Party: Fianna Fáil\n\n\n\nConstituency: Leinster\n\nJim Fitzsimons profile page\n\nLiam Hyland\n\nLiam Hyland\n\nEuropean Group: UEN\n\nIrish Party: Fianna Fáil\n\n\n\nConstituency: Leinster\n\nLiam Hyland profile page\n\nMUNSTER CONSTITUENCY\n\nGerard Collins\n\nGerard Collins\n\nEuropean Group: UEN\n\nIrish Party: Fianna Fáil\n\n\n\nConstituency: Munster\n\nGerard Collins profile page\n\nBrian Crowley\n\nBrian Crowley\n\nEuropean Party: UEN\n\nIrish Party: Fianna Fáil\n\n\n\nConstituency: Munster\n\nBrian Crowley profile page\n\nPat Cox\n\nPat Cox\n\nPresident of the European Parliament, 2002-2004\n\n\n\nEuropean Group: European Liberal, Democrat and Reform Party\n\nIrish Party: Independent (formerly Progressive Democrats)\n\n\n\nConstituency: Munster\n\nPat Cox profile page\n\nJohn Cushnahan\n\nJohn Cushnahan\n\nEuropean Group: EPP-ED\n\nIrish Party: Fine Gael\n\n\n\nConstituency: Munster\n\nJohn Cushnahan profile page\n\nCONNACHT-ULSTER CONSTITUENCY\n\nPat the Cope Gallagher\n\nPat the Cope Gallagher\n\nEuropean Party: UEN\n\nIrish Party: Fianna Fáil\n\n\n\nConstituency: Connacht-Ulster\n\nreplaced by Sean Ó Neachtain in 2002\n\nPat the Cope Gallagher profile page\n\n.\n\nSean Ó Neachtain *\n\nSean Ó Neachtain\n\n* replaced Pat the Cope Gallagher in 2002\n\nSean Ó Neachtain profile page\n\nJoe McCartin\n\nJoe McCartin\n\nEuropean Group: EPP-ED\n\nIrish Party: Fine Gael\n\n\n\nConstituency:Connacht Ulster\n\nJoe McCartin profile page\n\nDana Rosemary Scallon\n\nDana Rosemary Scallon\n\nEuropean Group: EPP-ED\n\nIrish Party: Independent\n\n\n\nConstituency: Connacht Ulster\n\nDana Rosemary Scallon profile page"}, {"url": "https://www.calendarz.com/on-this-day/july/23/john-cushnahan", "page_content": "Birth\n\nJul, 23\n\nJohn Cushnahan\n\nJohn Cushnahan, Northern Irish educator and politician\n\nJohn Walls Cushnahan (born 23 July 1948) is a former politician in both Northern Ireland and the Republic of Ireland who served as leader of the Alliance Party of Northern Ireland and then as a Member of the European Parliament for Fine Gael.\n\n\n\nCushnahan was educated at St Mary's Christian Brothers Grammar School and Queen's University, Belfast and worked as a teacher before going into politics. He worked as General Secretary of the Alliance Party from 1974 until 1982 and was a member of Belfast City Council between 1977 and 1985.\n\n\n\nIn 1982 he was elected to the Prior Assembly for North Down and two years later he became the new leader of Alliance, succeeding Oliver Napier. During his tenure as leader he sought to strengthen the party's links with the British Liberal Party. The Anglo Irish Agreement was signed during this period and Cushnahan faced the difficult position of giving Alliance support to it and facing the united opposition of the Unionist parties. However, when the Assembly was dissolved in 1986, Cushnahan found it financially difficult to remain in politics and so stood down as leader in 1987 to be succeeded by John Alderdice.\n\n\n\nTwo years later Cushnahan made a surprise political comeback when he moved to the Republic of Ireland and stood as a Fine Gael candidate in the 1989 election to the European Parliament, winning a seat in the Munster constituency. He was an MEP for fifteen years before retiring at the 2004 elections.Cushnahan now serves as a board member of the peace and reconciliation charity Co-operation Ireland."}, {"url": "https://www.wikiwand.com/ro/John_Cushnahan", "page_content": "[[ Mumhan (constituency of the European Parliament)| ​ ]]\n\nFifth European Parliament\n\n[[ Mumhan (constituency of the European Parliament)| ​ ]]\n\n[[ Mumhan (constituency of the European Parliament)| ​ ]]\n\nThird European Parliament\n\nLeader of the Alliance Party of Northern Ireland\n\nMember of the 1982–1986 Northern Ireland Assembly\n\nLegislatură"}, {"url": "https://www.caths.cam.ac.uk/future-island-of-ireland/john-cushnahan", "page_content": "Northern Ireland needs a version update\n\nJohn Cushnahan has held public office on both sides of the Irish border, as an MLA, leader of the Alliance Party (1984-7) and a Fine Gael MEP from 1989-2004. He talks to the IoI team about changing the Good Friday Agreement and designing the framework for a future border poll. What is missing or outdated in the Agreement? How can we make Stormont work? What more is needed for post-Troubles reconciliation? And how can a border poll avoid the pitfalls of Brexit?\n\nScroll on to discover\n\nExecutive summary\n\nAbout the speaker\n\nWatch the conversation\n\nWhat was said?\n\nExecutive summary\n\nCushnahan commends the Good Friday Agreement as a “historic achievement”. We are “indebted to its architects”. However, “complacency then set in” shortly after ratification, and we began to “deceive ourselves about what was happening”. It instituted no bill of rights, no major process of post-conflict reconciliation, and “totally insufficient progress” on integration in housing and education. Its largest failure is the “inability to deliver stable political isntitutions”.The GFA should not be discarded, but needs reviewing and “corrective decisions” to “implement what was intended in 1998”.\n\nThe power-sharing system established by the 2006 St Andrew's Agreement, in which the largest party in the Assembly takes the First Minister role, and the largest party from the other tradition takes the Deputy First Ministership, has led voters to coalesce around the largest party from their community. This has produced centrifugal tendencies in Northern Irish politics, benefiting Sinn Féin and the DUP at the expense of the political centre, and failing to produce working executives. Cushnahan proposes replacing this system with governing coalitions of parties, requiring two thirds of the Assembly’s backing, “cross-community support” and sharing of first ministers.\n\nThere is still no “equality of respect” for the nationalist and unionist traditions, and “supporters of the violent campaigns of republican and loyalist terrorist organisations continue to glorify their actions, and continue to inflict suffering and pain on the families of their victims, denying them closure”. He calls for public apologies from those who perpetrated and supported paramilitary violence, greater efforts on integrated housing and education, action plans to remove peace walls (the “greatest misnomer”, actually entrenching division), and more reciprocal, mutual respect, criticising for instance Sinn Féin’s veto of a monument to commemorate the Northern Ireland Centenary at Stormont.\n\nIn the case of a border poll, Cushnahan wants to avoid the pitfalls of Brexit, where voters had minimal information on the realistic options and consequences after a Leave victory. He calls for the British and Irish governments to fund a multi-university research project, to explore in detail the options for Irish unification. This work should examine different state models for a united Ireland – a “unitary, federal or confederal” state – as well as possible “legislative and structural changes”, options for protecting minority rights, “government culture and citizenship”, and how contingencies such as Scottish independence would affect unification. This research would provide “detailed analysis”, without recommending a particular course of action. The ultimate decision would lie with the electorate, but they should be as well informed as possible.\n\nAbout the speaker\n\nJohn Cushnahan is a former student Civil Rights activist and General Secretary of the Alliance Party (1974-82) when he was the party’s only full-time politician. John was a Councillor for North Belfast 1977-85 and in 1982, was elected as Member of the Northern Ireland Assembly for the staunchly unionist constituency of North Down. John was appointed Chairman of the Assembly Education Committee and was Alliance Party Chief Whip (1982-4 ) and party leader 1984-7. When the Unionist parties used the Assembly's procedures to oppose the Anglo-Irish Agreement, in December 1985, John called on the British Government to dissolve the Assembly. This terminated his income as a full-time politician. Despite this, he led the Alliance Party into the June 1987 Westminster Election where the party doubled its share of the vote from 5-10% (this tally was not exceeded until 2019). He retired as Alliance Leader in September 1987. In 1989, he was invited by Fine Gael to contest the European Parliament (EP) election in the strongly nationalist Munster constituency. After being re-elected twice, he retired in 2004. During this period, John was elected Vice President of the EP Regional Policy and Foreign Affairs Committees and was EP rapporteur on Interreg, Hong Kong, Sri Lanka, Pakistan and Kashmir. John was also appointed by the EU Council as Head of Mission to lead multi-national and multi-disciplinary teams in South Asia on five occasions, the objective of which was to strengthen Democracy and Human Rights in the region.\n\nWatch the conversation\n\nWhat was said?\n\nThe Good Friday Agreement was a “historic achievement”, says John Cushnahan, but it has fallen far short of its aspirations. After the Agreement was ratified, “complacency then set in”, and we began to “deceive ourselves about what was happening”. Cushnahan paints a bleak picture of the peace process and democracy’s success in post-conflict Northern Ireland. There is no bill of rights, no “equality of respect” for the Unionist and Nationalist traditions, and “totally insufficient progress” on integration in education and housing. The “supporters of the violent campaigns of Republican and Loyalist terrorist organisations continue to glorify their actions, and continue to inflict suffering and pain on the families of their victims, denying them closure”. The biggest failure for Cushnahan, however, is the “inability to deliver stable political institutions”. He notes how the Stormont Executive has collapsed at least six times since 1999 (nine according some academics), and hasn’t sat for ten out of twenty two years since power-sharing was installed. But Cushnahan is still convinced and determined that the Good Friday Agreement can be amended to finally meet aspirations.\n\nJohn Cushnahan was born in 1948 to a working-class Catholic family in the lower Falls, Belfast. He was involved in student civil rights activism before entering elected politics. He became General Secretary of the Alliance Party in 1974, at the time the party’s only full time employee, and sat on the Belfast City Council from 1977-85. He served as Alliance Party leader from 1984-7, a difficult period in which Alliance backed the Anglo-Irish Agreement against concerted Unionist opposition. When Unionists blocked the Agreement, which would give the Irish Republic a consultative role in governing Northern Ireland, Cushnahan called on the British Government to prorogue Stormont. Stormont was dissolved in 1986, and Cushnahan soon after resigned his position in Alliance and moved to the Republic. Joining Fine Gael, he served as a member of the European Parliament from 1989-2004. Barry Colfer commends him for having “done more than most to build bridges North-South and East-West in British and Irish politics”. Long retired from elected office, Cushnahan is still deeply engaged with politics, brimming with analysis and suggestions.\n\n“I don’t think that we should just discard the Good Friday Agreement”, Cushnahan says. We should “review it, see where it’s defective and make corrective decisions”. He particularly wants revisions to the power-sharing system established by Good Friday and the subsequent St Andrew's Agreement (2006), in which the largest party in the Assembly takes the First Minister role, and the largest party from the other tradition takes the Deputy First Ministership. Cushnahan argues that this system has led voters to coalesce around the largest party from their community – Sinn Féin and the DUP. These centrifugal tendencies have weakened the political centre in Northern Ireland – the UUP, Alliance and SDLP – and have failed to produce working executives. Cushnahan proposes replacing this system with governing coalitions of parties, requiring two thirds of the Assembly’s backing, “cross-community support” and sharing of the first minister roles.\n\nCushnahan also wants greater efforts towards reconciliation, to meet the unfulfilled aspirations of Good Friday. Audience member, former Alliance Chairman, Phillip McGarry, asks whether Sinn Féin’s “unapologetic” defence of IRA violence serves to “undermine” reconciliation, while Fergal McCarthy enquires about possible policies for reconciliation? Cushnahan offers some solutions. He calls for a roadmap to remove the “peace walls” in cities such as Belfast – they are the “greatest misnomer”, and only entrench segregation. He also calls for greater efforts at integrating education and housing. With regards to housing, he suggests removing all paramilitary murals as a productive first step. Cushnahan is scathing about all attempts to defend paramilitary violence. “How can anyone expect reconciliation in Northern Ireland when paramilitaries on both sides continue to glorify their actions?” They should publicly apologise and commit to peaceful, democratic methods in future. Apologies would “give some comfort to the 3000 families whose relatives were slaughtered in the Troubles. And that would be an important psychological first step.”\n\nCushnahan also addresses the framework for a border poll. Noting the ambiguities of the Good Friday Agreement and the subsequent Northern Ireland Act of 1998 on how a poll should be initiated, Cushnahan argues that two thirds of Assembly votes should be required to schedule one. If a poll is scheduled, Cushnahan is determined to avoid the pitfalls of the Brexit referendum, where voters had minimal information on the realistic consequences of a Leave vote. He criticises Sinn Féin’s campaigns for reunification as “sloganizing” and insubstantial, and draws parallels between the party and Boris Johnson’s Tories – both are “cynically exploiting narrow nationalisms for electoral advantage”.\n\nCushnahan wants voters to be as informed as possible before a border poll, and calls for the British and Irish governments to fund multi-university research projects with “detailed analysis of the options” for Irish unification. This research, “coordinated under a single organisational umbrella”, would explore diverse aspects of unification. It would cover potential state models (unitary, federal and confederal), “legislative and structural changes”, options for protecting minority rights, government and citizenship in a united Ireland, and the effects of “possible shocks” such as Scottish independence. Publishing this research should “inform the public and encourage a constructive and ongoing debate well in advance of any border poll”.\n\nHowever, Cushnahan doesn’t believe that there’s “any possibility in the near future of an all-Ireland settlement.” So, in the meantime, we have to try and make Stormont work. “If we can’t unite Northern Ireland, how the hell can we unite Ireland?\" A question which will inevitably be asked again in this series and as the political fallout from Brexit continues to animate these islands."}]}