{"After The Rascals' breakup in 1972, Ron Meagher pursued a solo career, releasing two albums in the 1970s.": [{"url": "https://www.latimes.com/archives/la-xpm-1988-08-18-ca-835-story.html", "page_content": "Times Staff Writer\n\n“Good Lovin’ ” is one of the hits that is likely to please nostalgic fans the most when a reformed version of the Rascals plays Southern California starting this weekend.\n\nBut there is no good lovin,’ and little good will, between the two principal Rascals, Felix Cavaliere and Eddie Brigati.\n\nFrom 1965 to 1970, Cavaliere and Brigati were the partners who keyed the Rascals’ success. Cavaliere wrote the music and Brigati supplied the lyrics for such hits as “Groovin,’ ” “How Can I Be Sure” and the transcendent “People Got to Be Free.” (“Good Lovin’,” the band’s first No. 1 hit, was a remake of a song by the Olympics.)\n\nAdvertisement\n\nCavaliere usually took the vocal leads in a husky, impassioned voice patterned after Ray Charles. Brigati sang lead on some of the hits, but his airier voice was usually part of the Rascals’ rich harmony blend.\n\nCavaliere, 45, is back on the road in a Rascals reunion tour that includes Dino Danelli and Gene Cornish, the band’s original drummer and guitarist. They wind up a two-month national tour playing Friday at the California Theatre in San Diego, Sunday at the Celebrity Theatre in Anaheim and Tuesday at the Universal Amphitheatre. Brigati, 42, remains in New Jersey.\n\nIn separate phone interviews, the two former partners laid out their grievances: Cavaliere depicted Brigati as a man who inexplicably resigned from the Rascals in 1970 and has since resisted promoters’ efforts to put the former band members together for a reunion tour. Brigati cast Cavaliere as an opportunist who turned a band that had been organized as an equal collective into his own vehicle.\n\n“I went personally to his home and asked him to come,” Cavaliere said. “I fulfilled my obligation as a friend. You can only ask someone for so long. From a business viewpoint, we don’t need him.”\n\nBrigati said he never received a formal touring proposal from Cavaliere and the promoters behind the Rascals reunion. He said he would be interested in rejoining his old band mates only if the group were to record and not just be an oldies touring outfit, and with an assurance that the members would be on an equal footing.\n\nOtherwise, he said, he is content to continue a low-key musical career that includes songwriting and occasional live shows with his older brother, David, who sang harmony on most Rascals’ hits.\n\n“I am at least an equal share member in the Rascals legacy,” Brigati said. “Felix has an attitude that we’re his sidemen. Twenty years later, I can’t be his sideman.”\n\nCavaliere said he took a leadership role out of necessity.\n\n“I was hoping (Brigati) would grow into a person who took on more of the work,” he said. “That didn’t happen, and I felt I was doing more than I was getting credit for as an equal partner.\n\n“I’d have to have a psychologist tell me what happened to him, to be part of a successful group and then retreat from the world.”\n\nBrigati said frustration over the band’s business arrangements led him to quit the Rascals in 1970. His only output since then has been one obscure album released with his brother in the mid-’70s.\n\nThe Rascals broke up in 1972 after failing to approach their earlier success. Cavaliere continued as a solo performer until 1980, then dropped out of sight.\n\n“I decided there are ways to make a living in the music industry without having to feel the pain,” Cavaliere said. He resurfaced last year with a band that played a mix of Rascals songs and new material.\n\nWhen the current tour is over, Cavaliere said, he’ll settle in Nashville and try to blend into the city’s musical community as a songwriter and producer.\n\n“I still want to do new music. To earn a living being a Rascal is not what I want to do.”\n\nAs for the possibility of future Rascals reunions, Cavaliere said: “It can be brought back for another special occasion. For argument’s sake, let’s say Eddie wanted to join us next year. That’s a reason to go out.”\n\nThe question is whether such a rapprochement is possible.\n\n“The person I want to see come back would also be a person that’s changed in many other ways,” Cavaliere said. “I know he still sings and still sounds great. We get reports. (The Brigati brothers) will always sound good. They had natural ability. But you also have to have desire and ambition.”\n\nDespite what Brigati sees as Cavaliere’s “concerted effort to discredit us” during past negotiations for a Rascals reunion, he says he hasn’t closed the door.\n\n“We must go beyond it,” he said. “I’m alive, you don’t give up.” For now, there is still a gulf of resentment between former friends who, at their creative peak, shared an apartment while turning out hit songs.\n\n“It’s not a good thing to feel after all we’ve accomplished,” Brigati said."}, {"url": "https://performerlife.com/what-happened-to-outkast/", "page_content": "Performer Life is supported by its readers. If you buy something with our links, we may earn a commission.\n\nKnown for being a major force in the revolutionizing of hip-hop music, the duo, OutKast remains one of the most respected hip-hop groups to emerge from not just Atlanta, Georgia, but also from the United States.\n\nThe rap duo was made up of rappers, André “3000” Benjamin (who was formerly known as Dré) and Antwan “Big Boi” Patton.\n\nTogether, they achieved critical and commercial success from the mid-1990s to the early 2000s. They helped popularize Southern hip-hop.\n\nWith a unique and gritty sound that synergized funk, gospel, rock, ragtime, rave, and every other style and idiom, OutKast revolutionized the 1990s hip-hop and cemented their names on both the sands of time and the hearts of hip-hop lovers.\n\nUndoubtedly, the duo was on top of their game and were known for doing what other rappers at the time could never imagine.\n\nOutKast normalized the use of live instrumentation in hip-hop music. Their sounds were not just “funky,” it was also real.\n\nThe recurring question of what happened to the duo OutKast has a simple answer, which is that OutKast broke up in the year 2006. For some reason, they seized to exist as a duo.\n\nMaybe they outgrew each other or maybe not. In this article, we will look further into why they broke up.\n\nWhat happened to Outkast?\n\nOutKast was an American hip-hop duo formed in 1992 in East Point, Georgia, consisting of André 3000 and Big Boi.\n\nThey released their debut album “Southernplayalisticadillacmuzik” in 1994, which received critical acclaim and helped to establish them as one of the most innovative and influential hip-hop acts of the 1990s and 2000s.\n\nHowever, in 2007, the duo announced an indefinite hiatus, and they have not released any new music as OutKast since then.\n\nThere are several reasons why OutKast split up, although the exact details of their breakup are not entirely clear. One of the main reasons cited by both André 3000 and Big Boi is “creative differences.”\n\nIn an interview with Billboard in 2014, André 3000 said, “As we started getting older and going in different directions, I think we just naturally started to evolve into different artists.” Big Boi has also spoken about how their different musical interests led them to pursue solo projects.\n\nIn an interview with NPR in 2017, he said, “I’m just a little bit more aggressive with the music. André likes to take his time and paint pictures.” Another factor in OutKast’s breakup was reportedly tension between André 3000 and Big Boi.\n\nIn a 2019 interview with Rick Rubin, André 3000 said that he and Big Boi “were brothers, but there were times that we were at odds.”\n\nHe also spoke about how he felt trapped by OutKast’s success and wanted to explore different musical genres and styles.\n\nDespite their split, both André 3000 and Big Boi have continued to have successful careers in music. André 3000 has collaborated with a wide range of artists, including Frank Ocean, Kanye West, and Travis Scott.\n\nHe has also pursued acting, appearing in films such as “Four Brothers” and “High Life.” Big Boi has released several solo albums and has collaborated with artists such as Sleepy Brown and Phantogram.\n\nAndré 3000 Talks Outkast, Acting and More on The Breakfast Club:\n\nWhy did Outkast break up?\n\nOutKast’s breakup was due to a combination of factors, including creative differences, personal tensions, and a desire to pursue individual artistic paths.\n\nCreative differences played a significant role in the duo’s split. In interviews, both André 3000 and Big Boi have spoken about how their different musical interests and approaches led them to pursue solo projects.\n\nAndré 3000 has said that they “naturally started to evolve into different artists,” while Big Boi has described himself as “more aggressive with the music” than André.\n\nThis divergence in musical direction led to a creative stalemate that eventually culminated in their hiatus.\n\nPersonal tensions may have also contributed to OutKast’s breakup. In a 2019 interview with Rick Rubin, André 3000 revealed that he and Big Boi “were brothers, but there were times that we were at odds.”\n\nThe intense creative process, combined with the pressures of fame and fortune, may have taken a toll on their relationship.\n\nLastly, André 3000’s desire to explore different musical genres and styles may have been a significant factor in their split.\n\nIn an interview with The Fader, he said that he felt trapped by OutKast’s success and wanted to break out of the box that they had created for themselves.\n\nThis desire to pursue individual artistic paths led to André 3000 collaborating with a wide range of artists and pursuing acting, while Big Boi released several solo albums and collaborated with other musicians.\n\nAbout Andre 3000 – Brief Bio\n\nAndré 3000, whose real name is André Lauren Benjamin, is an American rapper, singer, songwriter, actor, and producer. He was born on May 27, 1975, in Atlanta, Georgia.\n\nHe is best known as one half of the hip-hop duo OutKast, which he formed with his high school friend, Big Boi. André 3000 is known for his unique rapping style, eclectic fashion sense, and diverse musical influences.\n\nAndré 3000 began his music career in the early 1990s with OutKast, releasing their debut album, “Southernplayalisticadillacmuzik,” in 1994.\n\nThe album was a critical and commercial success, earning the duo widespread recognition in the hip-hop world.\n\nOver the next decade, OutKast released several more critically acclaimed albums, including “ATLiens” and “Aquemini.”\n\nIn addition to his work with OutKast, André 3000 has collaborated with a wide range of artists, including Beyoncé, Frank Ocean, and Gorillaz.\n\nHe has also pursued a solo career, releasing a number of singles and contributing to soundtracks for films such as “The Great Gatsby” and “The Love Below.”\n\nAndré 3000 has also made a name for himself in the world of acting, appearing in films such as “Four Brothers” and “Jimi: All Is by My Side.” He has also been involved in fashion and design, launching his own clothing line in 2008.\n\nAndré 3000 on the Future of OutKast and His Next Album | GQ –\n\nWhat Happened to Andre 3000?\n\nAndré 3000 has had a successful solo career since OutKast’s hiatus in 2007. He has released several singles and contributed to numerous soundtracks, showcasing his versatility as a musician and artist.\n\nIn 2003, André 3000 released “The Love Below,” a solo album that was also part of OutKast’s double album “Speakerboxxx/The Love Below.”\n\nThe album featured André 3000 singing more than rapping, and it showcased his interest in funk, jazz, and soul music.\n\nThe album was a critical and commercial success, earning several Grammy awards and spawning hit singles like “Hey Ya!” and “Roses.”\n\nSince then, André 3000 has continued to collaborate with other musicians and work on various solo projects. In 2018, he released a solo track titled “Me&My (To Bury Your Parents),” which he described as a tribute to his late parents.\n\nIn addition to music, André 3000 has also pursued an acting career, appearing in films such as “Be Cool” and “Semi-Pro.” He received critical acclaim for his portrayal of Jimi Hendrix in the 2013 biopic “Jimi: All is by My Side.”\n\nAs far as we know, André 3000 is still alive and well. There have been no reports of his passing or any health issues.\n\nWhile he has largely kept a low profile in recent years, he remains an influential and respected figure in the music and entertainment industry.\n\nAbout Big Boi – Brief Bio\n\nBig Boi, whose real name is Antwan André Patton, is an American rapper, songwriter, actor, and record producer. He was born on February 1, 1975, in Savannah, Georgia.\n\nHe is best known as one-half of the hip-hop duo OutKast, which he formed with André 3000 in the early 1990s. Big Boi is known for his distinctive Southern rap style, which blends funk, soul, and other musical influences.\n\nWith OutKast, Big Boi released several critically acclaimed albums, including “Southernplayalisticadillacmuzik,” “ATLiens,” and “Aquemini.”\n\nThe duo was known for their innovative approach to hip-hop, incorporating live instrumentation and unconventional song structures.\n\nIn addition to his work with OutKast, Big Boi has also released several solo albums, including “Sir Lucious Left Foot: The Son of Chico Dusty” and “Vicious Lies and Dangerous Rumors.”\n\nHis solo work has showcased his versatility as an artist, incorporating elements of rock, funk, and electronic music.\n\nBig Boi has also collaborated with a wide range of musicians, including Missy Elliott, Janelle Monáe, and Killer Mike. He has received several awards and nominations for his work, including multiple Grammy awards.\n\nOutside of music, Big Boi has also pursued an acting career, appearing in films like “ATL” and “Superfly.”\n\nHe has also been involved in various philanthropic efforts, including supporting music education in schools and working with organizations that provide resources to underprivileged communities.\n\nBig Boi Talks OutKast, Dungeon Family, and More | ComplexCon(versations) –\n\nWhat Happened to Big Boi?\n\nAfter OutKast went on hiatus in 2007, Big Boi pursued a successful solo career. In 2010, he released his debut solo album, “Sir Lucious Left Foot: The Son of Chico Dusty,” which was critically acclaimed and commercially successful.\n\nThe album showcased Big Boi’s skills as a rapper and his ability to blend different musical styles, including funk, rock, and electronic music.\n\nSince then, Big Boi has continued to release solo albums, including “Vicious Lies and Dangerous Rumors” in 2012 and “Boomiverse” in 2017.\n\nHe has also collaborated with a range of artists, including Phantogram, Killer Mike, and Run the Jewels.\n\nIn addition to his music career, Big Boi has also been involved in various acting projects, including guest appearances on TV shows like “The Quad” and “American Crime Story.”\n\nHe has also been involved in several philanthropic efforts, including supporting music education in schools and working with organizations that provide resources to underprivileged communities.\n\nAs far as we know, Big Boi is still alive and well. There have been no reports of his passing or any health issues.\n\nHe continues to be an influential and respected figure in the music industry, known for his creativity, talent, and dedication to his craft.\n\nWhat is the current state of OutKast?\n\nAs of now, OutKast remains on hiatus, and there has been no official statement from the group regarding their future plans or any potential reunion.\n\nHowever, despite their hiatus, both André 3000 and Big Boi have remained active in the music industry.\n\nAndré 3000 continues to work on various music projects, including collaborations with artists like James Blake and Kid Cudi.\n\nWhile he has not released a full-length album since OutKast’s 2006 album “Idlewild,” he has been featured on several tracks and has expressed a desire to continue creating music.\n\nSimilarly, Big Boi has continued to release solo albums and collaborate with other artists. In recent years, he has worked with artists like Phantogram and Run the Jewels and has released several successful solo projects.\n\nDespite the lack of any official statement from the group, fans continue to hold out hope for a potential OutKast reunion or new music from the duo.\n\nWhile there is no way to know for sure what the future holds for OutKast, both André 3000 and Big Boi remain active and influential figures in the music industry, and their impact on hip-hop and popular music is undeniable.\n\nFans React to OutKast’s Indefinite Hiatus –\n\nConclusion\n\nIn conclusion, OutKast is one of the most iconic and influential hip-hop groups of all time, known for their innovative approach to music and their unique blend of Southern rap, funk, and other musical genres.\n\nDespite going on hiatus in 2007, both André 3000 and Big Boi have remained active in the music industry, with successful solo careers and collaborations with other artists.\n\nWhile the future of OutKast remains uncertain, their legacy as pioneers of hip-hop and influential musicians continue to be felt today.\n\nTheir impact on popular music and culture is undeniable, and their music continues to be celebrated and appreciated by fans around the world.\n\nWhether or not OutKast ever reunites or releases new music, their contributions to the world of music will continue to be celebrated and remembered for generations to come."}, {"url": "https://nysmusic.com/2022/05/25/felix-cavaliere-shares-his-story-in-memoir-of-a-rascal/", "page_content": "There’s a very good argument to be made that Felix Cavaliere may be one of the most underrated songwriters, singers and instrumentalists to emerge during the Sixties. The latest evidence for this comes in his long overdue autobiography, Felix Cavaliere: Memoir of A Rascal.\n\n©1967 Paul McCartney / Photographer Linda McCartney\n\nAs founder, principal songwriter and lead singer of The Rascals, Felix was the force behind nine of the greatest Top 20 hits of the mid-1960s. The roster includes the #1s “Good Lovin’,”“Groovin’” and “People Gotta Be Free” and the still-ubiquitous “A Beautiful Morning,” a #3 hit in 1968 that remains one of the most licensed tracks in movies, television and breakfast cereal adverts! As the first white act signed to the R&B-centric Atlantic Records, Felix was in the thick of the drive for civil rights. His band refused to play concerts that didn’t feature a black act on the bill and crafted the aforementioned “People Gotta Be Free” and “Ray of Hope,” two anthems of the civil rights and anti-war movements. Like his friend Beatle George, Felix’s work and life were forever changed by his encounter and lifelong commitment to a guru, Swami Satchidananda. And while Cavaliere’s forceful, Ray Charles-influenced vocals are often namechecked in “Best Of” lists, his massive chops as an instrumentalist on the Hammond Organ and as an arranger/producer are largely overlooked.\n\nCavaliere’s story begins in Pelham, New York. He was the son of two Italian-American professionals, a dentist dad and pharmacist mom, who wanted him to become a doctor. While his family was solidly middle class, there was still prejudice towards them in their suburban hometown, something that would forever inform his advocacy for equal rights. His love of music began early, with eight years of thrice-weekly lessons absorbing Bach, Beethoven and Chopin. With the death of his mother when he was 13, Cavaliere changed course and channeled his grief and full energies into music. He combined his love of the classics with his new-found passion for Boogie Woogie, Fats Domino and, especially, Ray Charles, who would prove his most profound vocal and instrumental influence.\n\nIn high school, Felix would join his first band, an integrated vocal group called The Swingin’ Six. He would also commence his habit of scrounging in record shops to find obscure tunes for his band to cover. This is something that would lead to his first smash hit with The Young Rascals, The Olympics’ tune “Good Lovin’.” His musical aspirations really solidified while at Syracuse University when he founded the band Felix and The Escorts. His combo would compete for gigs at frat parties with another led by a “beatnik” classmate, Lou Reed. While playing a summer gig at a resort in the Catskills, Cavaliere would meet Joey Dee, leader of the Starliters of “Peppermint Twist” fame. Dee would soon ask him to join his band on a tour of Germany where the opening act was the pre-fame Fab Four.\n\nShortly after his return and a continued stint with the Starliters, 20-year-old Cavaliere ventured to create his own band. His began by enlisting “rockabilly crazy” Canadian guitarist Gene Cornish, whom he had played with in the Starliters. He then found his “cocky” co-songwriter and co-lead vocalist Eddie Brigati at the Choo Club in Garfield. The band was completed with the stick-twirling Dino Danelli, who Cavaliere found playing at the Metropole Jazz Club in Times Square.\n\nThe band’s big break came when they were discovered while playing a summer residency at The Barge in the Hamptons by Sid Bernstein, the man who brought The Beatles to Shea Stadium. Unlike many managers of the era, Bernstein and his partner Walter Hyman proved to be both fair and savvy. They set the young musicians up with their own publishing company, pension plans and also a contract with Atlantic Records, one that gave them free unlimited studio time and full creative control, right down to album cover art. It also gave them access to superlative session musicians like bassists Chuck Rainey and Ron Carter and saxman King Curtis, engineering by the renowned Tom Dowd on the world’s first 8-track recorder and the arranging talents of the peerless Arif Mardin, the man behind a boatload of classics from Aretha Franklin and Roberta Flack to The Bee Gees and Nora Jones.\n\nAs for their band name, Felix believes it was suggested by TV kiddie show host Soupy Sales when they went to see him to pitch themselves as his backing band. Drummer Danelli asserts he came up with it after watching The Little Rascals on TV. Either way, they at first got tagged The Young Rascals by Atlantic to avoid confusion with another very different act, The Harmonica Rascals.\n\nFelix and his band’s ascent was supersonic –“six months from rehearsing in my parent’s basement to the top of the charts with ‘Good Lovin’” according to Cavaliere. Luckily for us, he devotes a good deal of the book to the writing and recording of his classic hits, many composed with Brigati.\n\nFelix would generally come up with the titles, choruses and music and leave the verses to Brigati. Atlantic only began to have confidence in their writing with the Cavaliere-penned “(I’ve Been) Lonely Too Long,” a Top 20 from their second album, 1967’s Collections. With his recollection of “A Beautiful Morning,” Felix discusses how it was inspired by and written in Hawaii, a locale that had a special reverence for his band. According to Felix, the #1s “Groovin’” and “People Gotta Be Free” almost weren’t released. The first because of its overtly laid back Latin feel and lack of drums. This track, which spent five weeks at the top of the Top 40, was only released after the powerful DJ, Murray the K, made an appeal to label A&R chieftain Jerry Wexler. At first “People Gotta Be Free” was thought to be too controversial for release during the turbulent summer of 1968, but it was eventually issued and raced to the top of the charts.\n\nCavaliere notes The Beatles and Sgt. Pepper as influence on albums like their psychedelic Once Upon A Dream and the double-disc Freedom Suite. But at the height of their popularity, there was a mutiny in the ranks when an exhausted Cavaliere headed to Mexico for a couple of months of R&R. In his words, he went there to chill and protest the war and paying taxes to fund it. The rest of the band went into the studio to record an album without him; something that proved a dismal failure.\n\nhttps://www.youtube.com/watch?v=h9Bl-x_2wzM&t=139s\n\nIn his memoir, Cavaliere shares many interesting anecdotes about life on the road and The Rascals’ many TV performances, especially the grueling six-day rehearsals for each of their performances on The Ed Sullivan Show. Due to Brigati and Cornish’s fear of flying, the band largely drove from gig to gig, with Felix behind the wheel. He talks about weird gigs playing a bullfighting ring in Puerto Rico, co-headlining the Fillmore West with a “very unpleasant” Van Morrison, taking the stage at Shea Stadium in 1971 and his many tours to Hawaii, where he would bring along his whole family and guru. He talks of his admiration for other Italian-American stars before him, Dion and Frankie Valli, and his contemporary NYC-born hitmaker, John Sebastian of the Lovin’ Spoonful. He also recalls Jimi Hendrix, whom he knew from his own time with Joey Dee and the Starliters and his efforts to try and get the guitarist away from drugs.\n\nA pivotal point in his life and art came with his meeting Swami Satchidananda through Steve Paul, owner of the famous Scene Club. Before becoming a guru, Satchidananda was a businessman who ran a company that made cars that ran on wood! After the death of his wife, Swami took to the path, something which Cavaliere did eagerly himself by becoming a vegetarian and practicing Hatha Yoga and meditation daily. His guru would give Felix the name “Paalitha,” for protector, and tell him that “Music and bringing joy from it was his karma.” Felix’s Swami would go on to open the Woodstock Festival, found a large teaching ashram called Yogaville and number among his devotees Carole King, Jeff Goldblum, model Lauren Hutton and other boldfaced names.\n\nCavaliere spends a good deal of time speaking about discrimination and his lifelong efforts to counter it. He recalls how his parents were not allowed to join the country club in Pelham due to their Italian heritage and how one of his high school classmates, Michael Schwerner, was among the three volunteers killed while registering black voters in Mississippi in 1964. He estimates he and his bandmates lost millions by having in their concert contracts the necessity of having black acts on the bill.\n\nCavaliere goes on to discuss the breakup of the band and their move from Atlantic to Columbia Records, where they made two ambitious albums in an increasing jazzy/gospel vein, Peaceful World and The Island of Real, collections whose stature has only grown with the passage of time. According to Cavaliere, Atlantic wanted to resign but only Felix as a solo artist. But he wanted to keep the band together, hence the move to Columbia. He also bemoans the premature decision by the band to sell its publishing.\n\nFelix describes his post-Rascal years with pride, from his first stint as producer for Laura Nyro to his underrated solo albums and his duo disc with Stax guitar/songwriting legend Steve Cropper. He also waxes poetic about his love of Nashville, his home for several decades and its vibrant music scene, and also the fun of touring with Ringo Starr’s All-Star band. And, like any good Italian boy, he talks with deep love about the sacrifices and support of his parents and his love for partners and daughters.\n\nIf it wasn’t for The Rascals, Steve Van Zandt may never have gotten his role as Silvio Dante in The Sopranos. His humorous induction speech for the band at the 1997 Rock and Roll Hall of Fame Ceremony is what caught the imagination of series creator David Chase. Cavaliere laments that The Rascals: Once Upon A Dream, the multimedia show/concert event Van Zandt created for the band, had such a limited Broadway run and in a subsequent tour. He also expresses regret that the band itself cannot quite get it together for a proper reunion/farewell tour.\n\nCavaliere is presently on a nationwide tour with Legends Live alongside Micky Dolenz of The Monkees. Visit his website to order the book and tickets for the tour. www.felixcavalieremusic.com"}, {"url": "https://www.discogs.com/artist/32501-Richard-James-Burgess", "page_content": "Real Name:\n\nRichard James Burgess\n\nProfile:\n\nRichard James Burgess (born 29 June 1949) is an English musician, singer, songwriter, record producer, composer, author, manager, marketer and inventor.\n\nBurgess's music career spans more than 40 years. He came to prominence in the early 1980s as co-founder and co-lead singer of the synthpop band Landscape, which released a top 10 hit in 1981 with the single \"Einstein a Go-Go\". Burgess is one of the main composers of Landscape's music, and made major lyrical contributions to the band's songs. After the band's break-up, he pursued a brief, moderately successful solo career releasing one mini-album, Richard James Burgess in 1984.\n\nHe launched his career as a producer with Spandau Ballet's debut UK hit \"To Cut a Long Story Short\", the first commercial success for the hitherto underground New Romantic movement.\n\nBurgess currently serves as the CEO of A2IM: American Association of Independent Music.\n\nRichard Burgess was born in London, England, and his family emigrated to Christchurch, New Zealand in 1959. He showed an early interest in music, especially drums, and bought his first drum set at the age of 14. As a drummer, he gained experience in local bands including Fred Henry, Orange, Easy Street, The Lordships and Barry Saunders. Burgess also showed an early interest in recording production, buying a portable Tandberg tape recorder when he was sixteen to make amateur recordings.\n\n\n\nBurgess studied electronics at college before turning to studies in music. In 1972, he left New Zealand to attend Berklee College of Music in Boston, and in 1973 moved to London to study at the Guildhall School of Music and Drama. He holds a PhD in musicology from the University of Glamorgan (now the University of South Wales)."}, {"url": "https://www.pastemagazine.com/music/paul-mccartney/reassessing-paul-mccartneys-solo-career-successful", "page_content": "The release of more new music by Paul McCartney again puts his solo work into the spotlight, nearly a half century after the breakup of the Beatles. The conventional wisdom is that McCartney’s AM-radio-centric solo career is disappointing and even embarrassing in comparison to his seminal work with the Fab Four. But there’s also a compelling case that it can be fairly categorized as the crowning achievement of the greatest artistic career of our time.\n\nMcCartney did not do his solo legacy any favors by providing detractors with ammo by saying in a recent interview that Wings was a “terrible” band. They weren’t, unless, of course, you’re comparing them to the Beatles.\n\nBut his former partner is largely to blame for framing the perception of McCartney’s solo career right from the start. In his scathing 1971 song “How Do You Sleep?” John Lennon sings:\n\n“A pretty face may last a year or two\n\nBut pretty soon they’ll see what you can do\n\nThe sound you make is muzak to my ears\n\nYou must have learned something in all those years”\n\nLennon later said he regretted that broadside, arguing (rather unconvincingly) that the song was really about himself. But the die was cast. McCartney was merely a pop creature and not a true artist.\n\nThe cruelty of Lennon’s insult (or, perhaps, its genius) is that it turned McCartney’s strength as a songwriter—his gift for dramatic yet infectious melody—into artistic baggage. This jujitsu made McCartney’s historic pace of piling up No. 1 hits into an ever-expanding indictment of his rock bonafides. Lennon could win the battle for Beatles supremacy without really having to lift a finger, which he actually did not do at all for the back-half of the 1970s while McCartney dominated the charts.\n\nBut commercial success is actually an important measure of artistic achievement. No one sets out to make unpopular art. So let’s dispense with the insanity of counting broad appeal as a black mark against Sir Paul.\n\nYes, artistic credibility beyond the popularity of your work is, of course, important, too. Can any of McCartney’s solo work can stand alongside the work of the Beatles? Given that the Beatles set a bar higher than any band, just reaching it even intermittently is an irrefutable measure of excellence.\n\nAnd finally there is the matter of time — how long was McCartney at or near the top of his powers. Was his peak relatively short given he hasn’t had a hit for over 30 years? If McCartney can check all these boxes affirmatively, there’s can be no doubt his solo career counts as a smash.\n\nCommercial Success\n\nMcCartney’s popularity as a solo artist is matched by only a handful of artists in rock history. He topped the charts post-Beatles nine times, a mark surpassed by just 10 artists, including the Beatles. Among solo artists that can be classified as rock, McCartney’s total of No. 1 songs is surpassed by just Elvis Presley (18) and Stevie Wonder, whose 10 include “That’s What Friends Are For.” That charity effort for AIDS research also counts as a chart topper for Elton John, who otherwise has one less No. 1 hit than McCartney. And McCartney also has 23 top 10 hits, comparable to the totals compiled by Wonder (28) and John (27).\n\nSo McCartney followed up his time in the biggest commercial musical act in history with basically the solo career of Elton John or Stevie Wonder.\n\n“To think of all the hits and amazing music that he has achieved since, with that amount of pressure on him constantly, is truly amazing,” says musician/producer Ben Rowling. “Expectations were exceptionally high. At the time, the public thought that John had gone mad shacking up with Yoko and therefore were expecting crazy stuff from him, and George was always thought of as a sideman who only had a couple of tunes per album. The public was unaware that George had been stockpiling fantastic songs. This left Paul, the showman, with the unenviable task of basically carrying on the Beatles sound and legacy, which was a no-win situation.”\n\nArtistic Success\n\nMcCartney’s solo career is most identified with AM radio during a time when rock’s coolness was quantified by its presence on FM, a format that he and the Beatles helped create.\n\n“Paul’s solo career is defined by his crowd-pleasing: it’s what he is good at and where his heart lies,” notes Robert Rodriguez, Beatles author and host of the Something About The Beatles podcast. “The guy who wanted to innovate during the 1960s evaporated in a haze of weed by the ’70s.”\n\nSeptember’s Egypt Station will be McCartney’s 25th solo album. He has been relentless, in stark contrast to both Lennon and Harrison before their deaths. Not only did Lennon not release anything between 1975 and 1980 (an unheard of amount of time for the era) but Harrison did not release an album in the 14 years preceding his 2001 death.\n\nYet it’s fair to say that McCartney has just one widely recognized album that can stand with the Beatles—Band on the Run.\n\n“Artistically, (that’s his) one pretty great album,” says rock critic and journalist Bill Wyman, who notes the absence of other major works compared to Elton John and Wonder. “He didn’t engage to explain the albums or put how he was feeling into words. He just did what he wanted to do. So it’s admirable in that sense. I don’t think it’s predictable at all, save for the Venus and Mars/Speed of Sound period.”\n\nSays Rodriguez, “Band on the Run and Tug of War are the most universally regarded highlights of Paul’s solo career. Runners up would include Venus and Mars, McCartney I, Flowers in the Dirt and Flaming Pie. Again, if you are a McCartney fan, these are solid releases.” But, Rodriguez says, none are comparable to The Beatles.\n\n“My personal favorite is Ram—his second and, in a way, the natural successor to Abbey Road. In terms of musical invention, stylistic diversity and as a showcase for Paul’s skills as a writer, arranger, producer, singer and musician, it’s hard to see where this one can be bested.”\n\nThat’s the other point about Paul solo—he took it quite literally initially by becoming a one-man band.\n\nCould a best-of McCartney stand beside his Beatles work? A McCartney top 10 irrespective of what was released as a single could look something like this:\n\nMaybe I’m Amazed\n\nJet\n\nJunk\n\nAnother Day\n\nBand On the Run\n\nComing Up\n\nNineteen Hundred and Eighty-Five\n\nLet Me Roll It\n\nLive And Let Die\n\nSilly Love Songs\n\n“How many songs in the 1970s did McCartney do that were as good as ‘Hey Jude’ or ‘Let It Be’ or ‘Get Back,’ much less ‘Penny Lane’ or ‘Lady Madonna’? None!,” argues Wyman. “But despite all that he was still probably the biggest act of the 1970s. Ha!”\n\nOther critics, it should be noted, count “Maybe I’m Amazed” is one of the best songs McCartney ever wrote, including McCartney, who said he wanted to be remembered for it.\n\nTime\n\nSharp readers will notice that none of the songs listed as McCartney’s best were released after 1980’s “Coming Up,” which reportedly inspired Lennon to record music again. There have been some gems more recently but there’s no denying the many misses, too.\n\nYet the arc of the careers of Wonder and Elton John are very similar. And that’s no surprise. “The expectation for anybody to sustain pushing the paradigm of rock’n’roll in their 30s like they had in their 20s is virtually unheard of and unreasonable,” notes Rodriguez, whose Beatles books include Solo In The 70s: John, Paul, George, Ringo 1970-1980.\n\nTime is the arch nemesis of all musicians. Mental prowess begins to decline age 27, according to recent research. While there is a belief that creativity peaks later, at age 42, rock musicians were not specifically studied. If you look at Rolling Stone magazine’s consensus top 10 rock albums of all time, the average age of the main creators upon release was 26 and just one artist — Marvin Gaye — was over 30 (he was 32 when What’s Going On was released).\n\nAnd note the reason of later peak creative development in literature and more classical forms of music is believed to be related to the amount of study and practice required before one can begin to innovate. But McCartney was a pioneer and thus blossomed at a very young age. So he’s more like Albert Einstein in science, who had his “miracle year” of 1905 at age 26—perhaps because he had the field to himself. So McCartney had less genius left to mine as he aged. Yet he carried his peak into at least his late 30s. Wonder in comparison was 28 when the last of a similar list of his top songs was released.\n\nVerdict\n\nCommercial success is a gigantic win for McCartney. And like the inner-circle Hall of Fame baseball player, he maintained his artistic peak for much longer than could reasonably be expected, a fact obscured by his many subsequent releases (most of which have their moments up to and including his latest single).\n\nThe only controversial measure of McCartney’s solo greatness is artistic success, almost hopelesly subjective. Viewing McCartney so seriously cuts against his gift of bringing as much joy as possible into the world through his music. He expressed this most movingly in the coda to his first career, “And in the end, the love you take is equal to the love you make.” A long-ago review of “Silly Love Songs” sums this up best and with it McCartney himself: “An exemplary piece of pop production and a pure pleasure.” If that isn’t artistic success, what is it?"}, {"url": "https://www.britannica.com/biography/Rod-Stewart", "page_content": "Rod Stewart, in full Roderick David Stewart, (born January 10, 1945, London, England), British singer and songwriter whose soulful, raspy voice graced rock and pop hits beginning in the late 1960s. Stewart became an international star following the extraordinary commercial success of his landmark album Every Picture Tells a Story (1971).\n\nAlthough best known as a solo artist, Stewart achieved his first exposure and success as a member of several popular groups. After taking an early interest in folk music and rhythm and blues, he was a member of two relatively obscure London-based bands (Steampacket and Shotgun Express) in the mid-1960s before teaming with the influential guitarist Jeff Beck and future Rolling Stone Ron Wood in the Jeff Beck Group. Stewart’s collaboration with Beck ended in 1969 when, after two albums, he was persuaded by Wood (who had been fired by Beck) to join the Faces. Formerly the Small Faces, the band—also comprising Ronnie Lane, Ian McLagan, and Kenney Jones—played bluesy rock that appealed to Stewart’s long-standing interest in rhythm and blues. During the early 1970s the raucous Faces were among Britain’s most popular live performers, and their album A Nod’s as Good as a Wink…to a Blind Horse (1971) remains highly regarded. Nonetheless, Stewart, determined not to be constrained by the group format, pursued a parallel solo career during his tenure with the Faces (1969–75).\n\nBritannica Quiz Pop Culture Quiz\n\nReleased in 1969, his first solo album, An Old Raincoat Won’t Ever Let You Down (also released as The Rod Stewart Album), was commercially disappointing, but its mixture of original and cover songs would prove to be a successful formula for Stewart. Gasoline Alley (1970) sold better and was well received by critics, but it hardly suggested what would happen in 1971. Every Picture Tells a Story charted at number one in Britain and the United States simultaneously; the single “Maggie May” repeated the feat; and Rolling Stone magazine named Stewart “rock star of the year.” His next album, Never a Dull Moment (1972), and its single “You Wear It Well” were also hits, as Stewart’s solo work eclipsed his efforts with the Faces. Among other subsequent hits were “Tonight’s the Night (Gonna Be Alright)” and Stewart’s version of Cat Stevens’s “The First Cut Is the Deepest,” both from the album A Night on the Town (1976); however, the critical success that Stewart had enjoyed was fast approaching an end.\n\nFor the next two decades, the hits continued to come—the disco-inflected “Do Ya Think I’m Sexy” (1978), for instance, topped charts in multiple countries—but much of Stewart’s output was dismissed as uninspired. His cover of the 1985 Tom Waits song “Downtown Train” (1989) was the high point of a midcareer period generally considered inconsistent. For a time in the early 21st century, Stewart abandoned songwriting and focused solely on interpreting others’ work. Beginning in 2002 he released several collections of traditional-pop standards, as well as album-length takes on rock and soul classics, that received mixed reviews but found a wide audience. For Stardust…: The Great American Songbook Volume III (2004), Stewart received his first Grammy Award. He returned to writing his own material for Time (2013), a smoothly diverse set of songs that found him in a nostalgic mood, and the appealing yet uneven Another Country (2015). His 30th studio album, Blood Red Roses (2018), yielded the minor hit song “Didn’t I.” He later released You’re in My Heart: Rod Stewart with the Royal Philharmonic Orchestra (2019).\n\nStewart was inducted into the Rock and Roll Hall of Fame as a solo artist in 1994 and as a member of the Faces in 2012. He was made Commander of the Order of the British Empire (CBE) in 2007. An autobiography, Rod, was published in 2012."}, {"url": "https://www.udiscovermusic.com/artist/no-doubt/", "page_content": "Photo: Patrick Ford/Redferns\n\nEnduring ska-popsters No Doubt have regularly shaken hands with success over the past 20 years. Fronted by the high-profile Gwen Stefani (ranked at No.13 on VHI’s “100 Greatest Women In Music” list in 2012), they have assembled a truly astonishing CV that includes multiple Grammy Awards and 1995’s diamond-selling LP, Tragic Kingdom, while Tom Daly, the then-mayor of their hometown of Anaheim, California, even gave them the key to the city in 2002.\n\nHaving sold over 30 million albums and counting, No Doubt have enjoyed a stratospheric career and they remain a going concern; their most recent studio LP, 2012’s Push And Shove, peaked at No.3 on North America’s Billboard 200. However, they had to fight hard to gain a foothold on the career ladder and they initially lived through a decade of blood, sweat and tears before they gained promotion into rock’s premier league.\n\nNo Doubt will forever be associated with their glamorous, ultra-photogenic vocalist Gwen Stefani, yet it was her keyboard-playing elder brother Eric who originally started the band during the mid-80s. Influenced primarily by bands such as Madness, The Beat and The Specials, who released music through Jerry Dammers’ influential 2-Tone imprint on the cusp of that same decade, Eric assembled a band keen to work up their own brand of bouncy, ska-inflected party music.\n\nADVERTISEMENT\n\nIn time-honoured tradition, the fledgeling band rehearsed in the Stefanis’ parents’ garage, their initial line-up also including vocalist John Spence, bassist Chris Leal and guitarist Jerry McMahon. By 1986, Eric had also drafted in his kid sister Gwen (who, at this stage, was just 17 and still attending nearby Fullerton College) and, by 1987, bassist Tony Kanal joined after attending one of the band’s early gigs.\n\nThe band barely survived an early tragedy when John Spence committed suicide a few days before No Doubt were scheduled to play a showcase gig for industry employees at Los Angeles’ renowned Roxy Theatre in December 1987. Though devastated, the band vowed to continue, with the core of their “classic” line-up eventually falling into place by 1989, after the Stefanis and Kanal recruited guitarist Tom Dumont and drummer Adrian Young.\n\nNo Doubt built their reputation the old-fashioned way: gigging relentlessly in and around LA where they frequently turned in high-octane sets at venues such as The Whisky-A-Go-Go, Fender’s Grand Ballroom and The Roxy, where they could often be found propping up bills for luminaries such as Fishbone and fellow SoCal ska-popsters The Untouchables. Thanks to Gwen Stefani’s increasingly alluring stage presence and the band’s energetic set of hooky, ska-flavoured punk-pop songs, record companies began to take note and, in 1990, No Doubt landed a multi-album deal with the newly created Interscope imprint.\n\nThough they’d pulled off a coup signing with the upwardly mobile and highly respected label, mainstream success initially eluded No Doubt. Their self-titled debut LP was released in 1992, but while it sold a decent 30,000 copies, it appeared at a time when grunge was still in vogue and the industry was reeling from the shockwaves emanating from Seattle. No Doubt’s bright, horn-laden ska-pop was anathema at a time when bands such as Nirvana and Pearl Jam were shifting serious units; they doggedly toured the US in support of their self-titled debut, No Doubt struggled to attract a sizeable audience outside of their Southern Californian stomping ground.\n\nFurther problems loomed when the band were paired with producer Matthew Wilder for their second LP. Wilder had a track record – he’d enjoyed a US Top 5 hit with the infectious ‘Break My Stride’ in 1984 – but Eric Stefani, especially, was unhappy about relinquishing control to an outside producer and Interscope thus sublicensed the release of the band’s second LP to the small Trauma imprint.\n\nAgainst the tide, however, No Doubt’s second LP, the punkier and markedly more aggressive The Beacon Street Collection, performed well in the marketplace, eventually chalking up sales of around 100,000. Heartened by the album’s reception, Interscope financed No Doubt’s make or break third LP, Tragic Kingdom. The creation of this pivotal record came at a price for the band, as Eric Stefani – who had been withdrawing from No Doubt since the making of The Beacon Street Collection – left the group and began working as an animator for the hit TV series The Simpsons.\n\nThis blow aside, however, Tragic Kingdom catapulted No Doubt into rock’s big league. Still arguably their finest achievement, it was a wondrous collection of hooky, Blondie-esque pop spiced up by the band’s hallmark, 2-Tone-esque ska inflections, and its appeal went right across the board. With help from its infectious first single ‘Just A Girl’ (which climbed to No.23 on the US Billboard chart), the LP went supernova. The world tour surrounding the album’s release eventually stretched over two years and, after the LP’s arguable stand-out track, the classy ballad ‘Don’t Speak’, went to No.1 in America and stayed there for 16 weeks, Tragic Kingdom sold over 10 million copies in the US alone.\n\nThe album eventually went on to exceed even the most optimistic record company executive’s hopes and dreams, notching up a massive 16 million sales worldwide and gaining a diamond certification in North America. A slew of industry awards followed, with the band receiving nominations for Best New Artist and Best Rock Album at the 1997 Grammy Awards, while No Doubt’s earlier catalogue also took off (their previously neglected debut LP had racked up sales of over 250,000 copies by 1999).\n\nPerhaps understandably a little dazzled by such astronomical success, No Doubt embarked on a series of protracted sessions for the follow-up to Tragic Kingdom. When their fourth album was finally released, in April 2000, it struggled to replicate the success of its illustrious predecessor.\n\nNot that Return Of Saturn was inferior by any stretch of the imagination, though it was darker in hue and also featured a clutch of down-tempo ballads. It did, however, also include a couple of striking singles in the flamenco-flecked ‘Ex-Girlfriend’ and the understated, but powerful ‘Simple Kind Of Life’, which peaked at No.38 on the US Billboard 100. Return Of Saturn also charted highly in North America, where it peaked at No.2 on the Billboard 200 and sold 1.5 million copies, earning a platinum certification. The album’s performance was perhaps modest compared with Tragic Kingdom, but it made a strong showing internationally, climbing into the Top 40 in 12 additional territories.\n\nNo Doubt’s profile remained high in the new millennium and they quickly bounced back with 2001’s Rock Steady: a confident, upbeat affair recorded primarily in Jamaica. Influenced by dub and Jamaican dancehall styles, the LP yielded two Grammy-winning singles, ‘Hey Baby’ (which featured Bounty Killer) and ‘Underneath It All’, which included contributions from the first lady of dancehall, Lady Saw. A star-studded affair, Rock Steady also featured input from both crack Jamaican rhythm section Sly Dunbar and Robbie Shakespeare, while the legendary Prince co-wrote, produced and performed on one of the album’s stand-out tracks, ‘Waiting Room’.\n\nRock Steady spawned four hit singles, with both the funky, electro-enhanced ‘Hella Good’ and Thompson Twins-esque synth-pop ballad ‘Running’ following ‘Hey Baby’ and ‘Underneath It All’ into the US Billboard Hot 100. Critically, the album was well received and it won back some of the ground the band lost with Return Of Saturn, eventually selling over 3 million copies worldwide and earning No Doubt a double-platinum certification in North America and a gold disc in the UK.\n\nWith the band’s star again in the ascendant, Interscope capitalised, releasing the self-explanatory The Singles 1992-2003 in November 2003. As the title suggests, it was an entertaining hit-stuffed anthology, featuring all No Doubt’s chart smashes plus one freshly recorded track, an emotive cover of Talk Talk’s 1984 hit ‘It’s My Life’. Another solid commercial success, the record again earned Gwen Stefani and co double-platinum certifications in both North America and Canada.\n\nNo Doubt went on an indefinite hiatus after an enthusiastically received North American tour with blink-182 in the early summer of 2004. Gwen Stefani then launched her highly successful solo career, releasing two multi-platinum-selling albums Love.Angel.Music.Baby and The Sweet Escape, which won critical plaudits galore and ensured she remained in the limelight from 2004-07.\n\nTom Dumont, Tony Kanal and Adrian Young, meanwhile, all remained busy while No Doubt remained on ice. Dumont released a downloadable LP, The Living Album, with his alt.rock side project, Invincible Overlord; Young played with the reformed Bow Wow Wow on their 2004 tour and Kanal collaborated with Pink, co-producing and co-writing two tracks on her 2008 LP Funhouse. He also found the time to reconnect with Gwen Stefani, co-writing the stately ballad ‘4 In The Morning’ for her second solo LP, The Sweet Escape.\n\nAn all-new No Doubt LP was rumoured to be in the works from 2008 on, and the band played their first North American tour in five years during 2009, bringing along special guests including Bedouin Soundclash, Katy Perry and Panic! At The Disco. Interscope then released an updated singles compilation, Icon, in 2010, before the band’s comeback LP, Push And Shove, finally landed in 2012. A highly credible comeback, Push And Shove was greeted with mixed reviews, but it remains one of the band’s most satisfying collections, its ebullient contents veering from the Jamaican patois-imbued titular song to infectious, new wave-style tunes (‘Gravity’; ‘Undercover’) and the tongue-in-cheek, synth-driven ‘Looking Hot’, wherein the 40-something Stefani ponders how much longer she can get away with sporting skin-tight clothes.\n\nThough a far cry from the diamond-selling Tragic Kingdom, Push And Shove also reacquainted the band with the upper echelons of the North American charts, peaking at No.3 on the US Billboard 200 upon its release in September 2012. Spurred on by the US Top 40 success of its trailer single, the Caribbean-flavoured ‘Settle Down’, it sold an impressive 115,000 copies during its first week of release in North America and also climbed to No.16 on the UK Top 40.\n\nGwen Stefani recently released a critically acclaimed new solo single, ‘Used To Love You’, through Interscope, and fans are already waiting patiently for her third solo LP, which is reputedly liable to arrive in 2016. At the time of writing, this activity is likely to take precedence over a new album from No Doubt, but rapturously received contemporary shows at 2015 festivals such as Napa Valley’s Bottlerock and Chicago’s Riot Fest & Carnival have made it abundantly clear that this exuberant Californian ska-pop quartet are far from taking the chequered flag as yet.\n\nWords: Tim Peacock"}, {"url": "https://www.insider.com/musicians-with-the-longest-careers-2020-6", "page_content": "Tony Bennett signed his first record deal 70 years ago.\n\nTony Bennett. Dimitrios Kambouris/Getty Images for NARAS\n\nIn 1949, Pearl Bailey asked a struggling musician, Joe Bari, to open a show for her in New York City. During that opening, he got the attention of some notables and signed a record deal the following year. During that time, he changed his name to Tony Bennett.\n\nIn 1951, his first hit single was \"Because of You.\" As he transitioned into jazz music, Bennett released his most popular song in 1962, \"I Left My Heart in San Francisco,\" which earned him his first Grammy Award.\n\nBennett struggled to find a place for himself in the '60s and '70s as younger people became interested in rock music. But he jumped back on the scene in the '80s and '90s, creating albums like \"The Art of Excellence\" and \"Perfectly Frank.\"\n\nLater in life, Bennett became successful at producing albums made up entirely of duets with other famous artists. Most notably, he created a successful album with Lady Gaga called \"Cheek to Cheek\" in 2014, earning him another Grammy Award. He continues making duet albums today."}, {"url": "https://www.bbc.co.uk/programmes/articles/2Rkfd89pCW34QdPKL8wg6Ps/20-albums-that-define-1992", "page_content": "Forming in Essex, The Prodigy burst onto the scene in the early 90s and changed the direction of electronic music forever. Their acclaimed debut Experience was the brainchild of Liam Howlett, his flair for constructing energetic rave tracks across the record made for an immersive, exhilarating listening experience which redefined dance music and was central in bringing rave culture into the mainstream. Peaking at No.12 in the UK Albums Chart, the album went onto achieve platinum status in the UK. If you want to be transported to the early 90s rave scene, this is the record to listen to - perfectly capturing the energy and spirit of the time.\n\nLiam Howlett tells 6 Music about Experience: \"I was so submerged in the rave culture from 1990 leading up to this first album and that sound was just in me. To me, that whole album is like a snapshot of the sound of that period and what we were about at the time. It's a more 1992 sound, you can tell by the speed of the tunes, everything started to get faster from 1991 to 92.\"\n\n30 years on, the group are one of the most successful electronic groups of all time, spawning countless hits and earning titles such as 'the premiere dance act for the alternative masses' and 'the Godfathers of Rave'."}, {"url": "https://www.aarp.org/entertainment/music/info-2019/musicians-who-performed-at-woodstock.html", "page_content": "Hulton Deutsch/Redferns/Getty Images\n\n\"I hope I die before I get old,” The Who bellowed in teen anthem “My Generation” on day three of the massive gathering Aug. 15-18 in Bethel, N.Y.\n\nDrummer Keith Moon did just that. A drug overdose ended his life at 32 in 1978. And bassist John Entwistle died of a heart attack at 57 in 2002.\n\nWhile the British band's trail is littered with farewell tours, reunions inevitably followed. Singer Roger Daltrey, 75, and guitarist Pete Townshend, 74, continue to carry The Who banner, with their “Moving On!” tour booked through October and their first album since 2006 due later this year."}]}