{"Bill Tobin has also been credited with helping to develop the careers of many NFL players, including Hall of Fam.": [{"url": "https://www.espn.com/nfl/story/_/id/6106117", "page_content": "LAKE FOREST, Ill. -- When the fifth round of the 1983 NFL draft rolled around, George Halas pushed his chair back and went to lunch, taking his general manager Jim Finks, his son-in-law Ed McCaskey and Finks' assistant Bill McGrane along with him.\n\nThe Bears traded their fifth-, sixth- and seventh-round picks away that year, so it was a natural break for the team's braintrust. But the Bears' scouting department, which consisted of pro scout Bill Tobin and college scout Jim Parmer, remained in the old Halas Hall war room monitoring the draft as one name on the board, or in this case wall, stared back at them.\n\nSuper Bowl XX MVP Richard Dent was a four-time All-Pro selection. Jonathan Daniel/Getty Images\n\nTobin placed a second-round grade on a scrawny defensive end from Tennessee State named Richard Dent, which didn't mean he thought Dent would or even should be drafted then. But it did mean that was what he thought of his ability.\n\n\"When they came back from lunch,\" Tobin recalled, \"Finks walks over to the wall and says, 'Hey Toby, your second-round grade is still here. Think we should take him now?'\n\n\"I said, 'Hell yes, we should.' I was shocked he was still there.\"\n\nThe Bears' eighth-round steal was elected this week to the Pro Football Hall of Fame, just one more notch on the belt for Tobin, who, in addition to drafting Walter Payton and scouting every member of the Bears' '85 Super Bowl champs, has the distinction of drafting two of the six players in the 2011 Hall of Fame class in Dent and Marshall Faulk, whom he chose as GM of the Indianapolis Colts.\n\nBut it was the underweight kid Tobin fell in love with in the fall of 1982 who made him feel like \"a proud papa\" this week.\n\nLugging his projector and a bottle of whiskey as a gift for Dent's coach, Tobin remembers it was cold and so muddy that October that they had scattered straw on the field at Tennessee State to improve the footing.\n\nIt didn't seem to affect Dent.\n\n\"The first sentence in my report,\" said Tobin, reading from the original, \"is 'This kid has to get a zero for quickness.' \"\n\nZero, it should be pointed out, is the best score a player can get.\n\n\"One is really special,\" Tobin said. \"I wrote, 'He is extremely quick off the ball, one of the fastest I have ever scouted.' \"\n\nWhen Tobin returned to Nashville to get more film that December -- \"Yeah, the technology wasn't quite what it is today,\" he said with a laugh -- Dent had a cast on his arm due to a complete dislocation of his wrist that required surgery. \"But they turned him loose against Chatanooga,\" said Tobin, who read some more from his report.\n\n\" 'He played one-armed, and he was still very effective,' \" he wrote. \" 'He is one of the quickest you will see upfield, and he has a mean streak in him. He will really wrap up the quarterback when he gets to him.' \"\n\nIf Tobin gets a kick out of looking back at his dead-on evaluation, it can't compare to the pride he had in seeing Dent grow. Literally."}, {"url": "https://profootballtalk.nbcsports.com/2021/04/24/happy-anniversary-bill-tobin-and-mel-kiper/", "page_content": "Getty Images\n\nMultiple Twitter accounts have noted this morning the 27th anniversary of the time when the coverage of the NFL draft sounded a lot like a pro wrestling pre-match interview.\n\nAdam Schefter of ESPN supplied the short version. The excellent @BackAftaThis account dusted off a longer cut.\n\nIt was 1994. The Colts moved up to No. 4 from No. 7. Many believed they made the jump to get quarterback Trent Dilfer. They instead selected linebacker Trev Alberts.\n\nLong-time NFL draft expert Mel Kiper didn’t like the move. And (contrary to the modern draft-coverage etiquette that is far more grounded in selling oft-implausible hope to all fans of all teams) he said so.\n\n“I think it’s a typical Colt move,” Kiper explained. “I mean, here’s a team that needed a franchise quarterback. To pass up a Trent Dilfer when all you have is Jim Harbaugh. Give me a break. That’s why the Colts are picking second every year in the draft, not battling for the Super Bowl like other clubs in the National Football League.”\n\nCut to Indianapolis. ESPN’s Chris Mortensen welcomed Colts G.M. Bill Tobin to the spot where Tobin will be interviewed with a huge smile and this line: “I knew you’d have one surprise for us today.”\n\nTobin, foreshadowing his on-air rant, didn’t reciprocate the joviality. “Not a surprise to us,” Tobin said, triggering an immediate and dramatic change to Mort’s demeanor and words.\n\n“No, that’s great,” Mort said. “I mean, no that’s what I mean. I’m not . . . I’m not . . . Hey.”\n\nThen came the on-the-record question and answer. Mort asked for Tobin’s response to the criticism about not taking a quarterback.\n\n“Well, you know, we got a guy up there — who in the hell is Mel Kiper anyway?” Tobin said. “I mean, here’s a guy that criticizes everybody, whoever they take. He’s got the answers to who you should take and who you shouldn’t take. In my knowledge of him, he’s never, ever put on a jock strap. He’s never been a coach. He’s never been a scout. He’s never been an administrator. And all of a sudden he’s an expert. He’s in our papers two days ago telling us who we have to take. We don’t have to take anybody that Mel Kiper says we have to take. Mel Kiper has no more credentials to do what he’s doing than my neighbor, and my neighbor’s a postman and he doesn’t even have season tickets to the NFL.”\n\nIt’s unknown whether Tobin’s postman ever became a draft expert, or purchased season tickets.\n\nIn the short term, Tobin got the last laugh. Sort of. Dilfer, despite winning a right-place, right-time Super Bowl with the Ravens six years later, never became a great quarterback. (Then again, the 1994 draft had no great quarterbacks. Gus Frerotte was the best of the bunch; even better were Kurt Warner and Jeff Garcia, both of whom went undrafted.)\n\nMeanwhile, Harbaugh nearly led Tobin’s Colts to the Super Bowl a year later. They had the Steelers on the ropes at Three Rivers Stadium before Pittsburgh took a late lead. Harbaugh then nearly connected on what would have been a game-winning Hail Mary.\n\nIn the long haul, Kiper won. The Colts fired Tobin after the 1996 season, and he’d never serve as a G.M. again. Kiper continues to persevere through highs and lows and ups and down and swings and misses.\n\nIndeed, my one enduring memory of Kiper has nothing to do with the draft. In May 2001, when Kiper was hosting a weekend show on ESPN Radio, he made the case for one of the NFL’s teams becoming the first franchise to lose every contest in a 16-game season.\n\nThat team was the New England Patriots. They’d go on to win their first of six Super Bowls that same year.\n\nAt times like this, I still wonder what Tobin’s postman thought the 2001 Patriots would do."}, {"url": "https://www.doc88.com/p-5445272579855.html", "page_content": "图案背景\n\n纯色背景\n\nBill Tobin has been a professional in Plastics f"}, {"url": "https://www.chicagotribune.com/news/ct-xpm-1991-11-06-9104100031-story.html", "page_content": "A little more than half the season has been played, yet nominees for the Bears` Most Valuable Player award are trickling in.\n\nJim Harbaugh? Steve McMichael? Neal Anderson? Richard Dent? William Perry? Mike Singletary?\n\nAdvertisement\n\nCouldn`t go wrong with any of those selections.\n\nBut the most influential member of the Bears` organization, it seems, hasn`t played a down this season.\n\nAdvertisement\n\nHe`s player personnel director Bill Tobin, whose overall record of evaluating talent corresponds directly with the Bears` on-field championship performances the last decade.\n\nTobin has been a part of the Bears` personnel staff since 1975 and has been in charge since 1984.\n\n''He is the Most Valuable Player in this organization,'' said Harbaugh after Sunday`s 20-10 victory over the Lions that improved the Bears` record to a NFC Central Division-leading 7-2.\n\n''It is a credit to Bill Tobin that he has been able to maintain the talent level on this team, compared to the teams like Green Bay, Tampa Bay and Detroit, especially,'' said Harbaugh. ''Those guys have been drafting in the first 10 picks for the last decade. He has been able to scrounge talent out of the late rounds. He has done as good a job as anybody in this organization, as far as players, coaches or anybody.''\n\nIn his more than 17 years in the organization, Tobin has seen all 19 of the club`s top draft picks become productive players. And 13 are still in the NFL.\n\n''We work at it, I promise you that. We`re not in the Bahamas with our feet up,'' said Tobin.\n\nHis staff includes assistant Rod Graves and regional scouts Charley Mackey, Jim Parmer, Jeff Shiver and Gary Smith. Ken Geiger handles scouting of NFL opponents and overseeing league player transactions.\n\n''If you get the right kind of people doing the selecting, they will select the right kind of people,'' said Tobin of the Bears` draft success.\n\nAdvertisement\n\nHe also should be credited for recommending his brother, Vince, for the defensive coordinator`s job when Buddy Ryan departed to be the Philadelphia Eagles` head coach in 1986.\n\nNine of the Bears` first-rounders have made it to the Pro Bowl. Overall, 14 Bear picks and two free agents since `80 have made the Pro Bowl.\n\n''To me, that has been the key for us to stay on top,'' said Harbaugh.\n\n''A lot of times the talent he gets in the late part of the first rounds are better than the guys in the first part of the rounds.\n\n''Look at Neal Anderson (picked 27th on the first round in 1986) and Brad Muster (23rd on the first round in 1988). . . . I think my year (1987) he did a good job of drafting.''\n\nHarbaugh was taken 26th on the first round out of Michigan.\n\nAdvertisement\n\nIn 1987, the Lions drafted defensive end Reggie Rogers, the Packers took running back Brent Fullwood, the Vikings grabbed back D.J. Dozier and the Bucs selected quarterback Vinny Testaverde in the first round.\n\n''It was the worst all-time draft, and Tobin was able to get a couple of players out of there,'' said Harbaugh.\n\nAmong the other picks by the Bears in 1987 were defensive ends Sean Smith, Steve Bryan and Will Johnson. ''Ron Morris and I are the only ones on our team from that year,'' said Harbaugh.\n\nThe Bears have won their division six out of the last seven years, largely because Tobin and his staff have beaten the Packers (his former employer), Tampa Bay, Detroit and Minnesota at the draft-even though those teams generally pick much higher than the Bears on each round.\n\nConsider the Bears` first-round picks over the last 13 years:\n\nStan Thomas, Mark Carrier, Trace Armstrong, Donnell Woolford, Wendell Davis, Brad Muster, Harbaugh, Anderson, Perry, Wilber Marshall, Willie Gault, Jim Covert, Jim McMahon, Keith Van Horne, Otis Wilson, Al Harris and Dan Hampton.\n\nAdvertisement\n\nNow, consider the Packers` first-rounders in that span: Vinnie Clark, Darrell Thompson, Tony Bennett, Tony Mandarich, Sterling Sharpe, Fullwood, Kenneth Davis, Ken Ruettgers, Alphonso Carreker, Tim Lewis, Ron Hallstrom, Rich Campbell, George Cumby, Bruce Clark and Eddie Lee Ivery.\n\nCredit Mike Ditka and the rest of the coaching staff for extracting the most production out of their talent-because division foe Minnesota also has selected superb athletes in the likes of Chris Doleman, Randall McDaniel, Keith Millard and Joey Browner. But the results have not been there on the field for them.\n\nThe jury still is out on much of the `91 rookie crop, including Bears first-rounder Thomas, rushed into a starting role because of the season-ending back injury to Covert.\n\nThomas signed a few days after the draft and didn`t miss a beat in mini-camp or the regular summer training camp. Injuries to his knee, shoulder and now his ankle have exacerbated the learning process.\n\nVeteran backup John Wojciechowski, an undrafted free agent in 1986 out of Michigan State, will start Monday night against the Vikings.\n\nLast year, Tobin became a NFL pioneer by working out the parameters of a contract for Carrier on draft day. Carrier went on to become NFL Defensive Rookie of the Year with a league-high and club-record 10 interceptions.\n\nAdvertisement\n\nTobin`s draft success in the early rounds tells only part of his story. Consider:\n\n- The selection of Pro Bowler Dent on the eighth round out of Tennessee State in 1983.\n\n- The signing of undrafted free agent Jay Hilgenberg, now a five-time Pro Bowl center, in 1981.\n\n- The drafting of Pro Bowl guard Mark Bortz on the eighth round in 1983. He had been a defensive lineman at Iowa.\n\n- The drafting of safety Shaun Gayle out of Ohio State in the 10th round as the 271st player selected in 1984.\n\n- The signing of free-agent McMichael, who was cut by New England after being drafted in the third round in 1980.\n\nAdvertisement\n\nAdditionally, future Hall-of-Fame linebacker Mike Singletary was a second-round pick in 1981. This year`s leading sacker, John Roper, was also a second-round choice out of Texas A&M in 1989. Ron Rivera, who leads current Bear linebackers in career interceptions with nine, was a second-round pick in 1984. Jim Morrissey was a steal on the 11th round in 1985.\n\nBut Tobin realizes he can`t rest on his past. It is up to this year`s rookie crop of Thomas, Chris Zorich, Chris Gardocki, Anthony Morgan, James Williams, Michael Stonebreaker, Darren Lewis, John Hardy, Stacy Long, Eric Wright, Paul Justin and Eric Ihnat to continue the legacy."}, {"url": "https://www.boisestate.edu/extendedstudies/blog/2022/01/24/community-impact-program-transforming-the-lives-of-students-and-building-idaho-communities/", "page_content": "In 2020, university president Marlene Tromp announced the launch of the Community Impact Program (CIP), which aims to increase educational attainment rates in rural and/or geographically isolated regions of the state, support local employer and workforce needs, and establish Boise State as an essential part of each community. The first three hub communities to participate in the program are the West Central Mountains, Mountain Home, and the Western Treasure Valley.\n\nCIP focuses on modularized learning and a certificate-first approach – allowing students to achieve milestones along their path to a degree.\n\nThe initial CIP cohort in the fall of 2020 exceeded expectations, and current students are already trailblazing paths to their goals with the support of Boise State University and their local communities.\n\nStudents are changing the course of their future\n\nThe Community Impact Program (CIP) is giving students the skills to change the trajectory of their future as well as make a lasting legacy in their communities.\n\n“Community Impact Programs not only allowed me to develop the community I live in but gave me an opportunity to find direction,” shared Cierra Webb, a Mountain Home CIP student. “I was really, really excited to join, and it gave me a direction to go with my degree, which I really appreciate.”\n\n“Community Impact Programs not only allowed me to develop the community I live in but gave me an opportunity to find direction.”\n\n– Cierra Webb, Mountain Home CIP student\n\nWebb also expressed how her education will help her remain in her community while contributing to local growth.\n\n“Something that I would really want to do is to stay here in town and help it grow and develop into something more,” Webb said.\n\nMcCall CIP student Sarah Housbrouck said the program’s greatest benefit came from working closely with those who understand Idaho communities.\n\n“I really appreciated the ability in a rural setting to be able to earn college credits and make an impact within my community,” said Housbrouck. “Doing things with people from this area who understand nuances, political and cultural aspects that someone from a more urban setting may not acknowledge or fully grasp.”\n\nLike Aleah Nelson from Payette, other students enjoyed how the program provided a robust experience.\n\n“I liked CIP right from the start; CIP gives you a whole new energy and a new perspective,” said Nelson. “It is so impactful as a student, as a leader, in your job, and your family. I feel like it ties all of my world together.”\n\nConnecting students to Boise State and one another\n\nBringing CIP to local communities helps students create meaningful connections with the university. The intentional design of the program ensures that students build relationships with their instructors and fellow students.\n\n“CIP created a new atmosphere and connection as a student, not just to our cohort but helping me feel like a Boise State student – not just this ‘online somewhere,’” said Nelson.\n\n“CIP created a new atmosphere and connection as a student, not just to our cohort but helping me feel like a Boise State student – not just this ‘online somewhere.’”\n\n– Aleah Nelson, Payette CIP student\n\nBoise State leadership, faculty, academic advisors, staff and community leaders collaborate to support program students and help them feel connected to the university.\n\n“It’s really cool that CIP reached out to the communities out here like Parma, Payette, Fruitland and the rest of this area,” said Payette student Noe Gonzalez. “They are including us and making us feel like we are a part of Boise State. Especially being an online student, it really made me feel like I am a student at Boise State.”\n\nFor others, it’s not the connection with the university that makes the difference — it’s the connections made with fellow students.\n\n“The piece that ultimately sold me on the program is that it is a cohort of people from your community,” said Housbrouck.\n\nThe combination of university connections and relationships built within cohorts aims to give students the skills to be well connected, innovative leaders within their communities.\n\nStudent support driving an impact\n\nThe unique atmosphere created by CIP is built on the foundation of student support. CIP faculty and staff take pride in watching students accomplish their goals while impacting their community.\n\nBefore entering the program, students receive personalized assistance throughout the admission and enrollment process to ensure a stress-free experience. Students work with staff to build an education plan to reach their goals during the program.\n\n“The faculty’s support is super important to me,” said Mountain Home CIP student Meghan Rickelman. “It’s nice to know that they’re invested in my success.”\n\nBeyond faculty and classroom support, CIP students have access to program staff and advisors to help navigate financial barriers and access other resources to aid student success. CIP staff also helps expedite resolutions to any real-time student issues within the university to help students receive the support they need while balancing their life and coursework.\n\n“The enhanced and specialized support from staff and faculty allows students to concentrate on what is most important – life responsibilities,” said Brian O’Rorke, Boise State CIP Outreach Coordinator. “Students discontinue their education due to financial, time management, or course content difficulties. This program and its faculty and staff support are designed around alleviating those pressure points. This allows for a healthy life balance during the student’s education.”\n\nBeyond alleviating pressure points and providing resources, O’Rorke shared how powerful it is for CIP faculty and staff to see already the impact students are making:\n\n“Watching the relationships that our students are building with each other and community leaders is extremely exciting. They all care about identifying issues within their community and working together to find solutions to those issues,” said O’Rorke. “They put community first, and that community organizing is a powerful thing, as far as improving local quality of life.”\n\nBy building the CIP program around local communities, students receive support from one another, their community, and Boise State, giving them the tools they need to achieve their goals and help their community thrive.\n\nLearn more about CIP\n\nFor more information about the Community Impact Programs and to join our team of community members supporting this effort: https://www.boisestate.edu/ruraleducation/"}, {"url": "https://www.wikiwand.com/en/Bill_Tobin_(American_football)", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about Bill Tobin (American football)?\n\nSummarize this article for a 10 years old"}, {"url": "https://www.baseball-reference.com/players/t/tobinbi01.shtml", "page_content": "Frequently Asked Questions\n\nWhen was Bill Tobin born?\n\nBill Tobin was born on October 10, 1854.\n\nWhere was Bill Tobin born?\n\nBill Tobin was born in Hartford, CT.\n\nHow many seasons did Bill Tobin play?\n\nBill Tobin played 1 season.\n\nIs Bill Tobin in the Hall of Fame?\n\nBill Tobin has not been elected into the Hall of Fame.\n\nWhat position did Bill Tobin play?\n\nBill Tobin was a First Baseman.\n\nHow many hits did Bill Tobin have?\n\nBill Tobin had 24 hits over his career.\n\nHow many home runs did Bill Tobin have?\n\nBill Tobin had home runs over his career.\n\nWhat was Bill Tobin's average?\n\nBill Tobin had a .158 average over his career.\n\nHow many teams has Bill Tobin played for?\n\nBill Tobin played for 2 teams; the Troy Trojans and Worcester Ruby Legs.\n\nWhen did Bill Tobin retire?\n\nBill Tobin last played in 1880."}, {"url": "https://www.pro-football-reference.com/players/T/TobiBi00.htm", "page_content": "Frequently Asked Questions\n\nHow old is Bill Tobin?\n\nBill Tobin is 82 years old.\n\nWhen was Bill Tobin born?\n\nBill Tobin was born on February 16, 1941.\n\nWhere was Bill Tobin born?\n\nBill Tobin was born in Burlington Junction, MO.\n\nHow tall is Bill Tobin?\n\nBill Tobin is 5-11 (180 cm) tall.\n\nHow much did Bill Tobin weigh when playing?\n\nBill Tobin weighed 210 lbs (95 kg) when playing.\n\nIs Bill Tobin in the Hall of Fame?\n\nBill Tobin has not been elected into the Hall of Fame.\n\nHow many games did Bill Tobin play?\n\nBill Tobin played 10 games over his career.\n\nHow many receiving yards did Bill Tobin have?\n\nBill Tobin had 271 receiving yards over his career.\n\nWhen did Bill Tobin retire?\n\nBill Tobin last played in 1963."}]}