{"In 1994, Bill Tobin joined the Indianapolis Colts as Vice President of Player Personnel.": [{"url": "https://www.chicagotribune.com/news/ct-xpm-1994-01-08-9401080108-story.html", "page_content": "Bill Tobin joined the Indianapolis Colts as vice president and director of football operations Friday in a surprise move that changes the role of General Manager Jim Irsay.\n\nTobin, former vice president of player personnel with the Bears, was hired by Colts owner Robert Irsay, who told his son and Tobin, \"Go run the club.\"\n\nAdvertisement\n\n\"I am what it says,\" Tobin said. \"I'm responsible for coaches, players, the draft, trainers, equipment guys. I will consult and work closely with Jim and get the approval of Mr. Irsay. He wants my football experience and success.\"\n\nSo will Tobin trade quarterback Jeff George to the Bears for Jim Harbaugh?\n\nAdvertisement\n\n\"What else are the Bears going to throw in?\" Tobin asked with a laugh.\n\nTobin was never an avid backer of George, first player selected in the 1990 draft, so George's future in Indianapolis is in question. George skipped most of training camp in a dispute he never publicly clarified. He was said to be fed up with what he perceived as unfair criticism in his hometown.\n\nTobin said he was going to review personnel with coach Ted Marchibroda before he talks about anyone, including George.\n\nSince the Colts finished 28th in the league in defense, Tobin's brother Vince could soon rekindle the family reunion they had with the Bears from 1986-92, when the Bears' defense finished 1st, 2nd, 2nd, 25th, 6th, 4th and 17th.\n\n\"We've got some changes to make,\" Bill Tobin admitted when asked about Vince.\n\nThe Colts' defensive coordinator is former Northwestern coach Rick Venturi.\n\nThe Tobin hiring was one of two shakeups in the NFL Friday. The New York Jets fired coach Bruce Coslet and promoted defensive coordinator Pete Carroll after Coslet refused to hire an offensive coordinator. Coslet spent four years without a winning season. After making the playoffs in 1991 as an 8-8 wild card, the Jets suffered through 4-12 and 8-8 seasons.\n\nTobin praised former Bears General Manager Jim Finks as his role model in structuring a team. He compared his situation in Indianapolis to the 1974 hiring of Finks by the Bears, who were a father-son operation. In that case, however, Finks was hired by son Mugs Halas, not father George. Mugs gave up his authority.\n\nAdvertisement\n\nJim Irsay will keep his title as vice president and general manager. Tobin said Jim Irsay, assistant GM Bob Terpenning and general counsel Michael Chernoff would remain responsible for signing players and fitting them under the salary cap.\n\nThe Colts had the third-highest payroll in the league last season, according to NFL Players Association figures. At $40.2 million, they are more than $6 million over next year's projected cap of $34 million.\n\n\"I'm here to tell them who to spend the money on,\" Tobin said. \"That's my area of expertise.\"\n\nSince the Colts finished fifth in the AFC East, they will avoid a game against the Bears next season and play a fifth-place schedule instead. The Colts have the second pick in the April 24 draft. The Bears never picked that high during Tobin's 18 years in Chicago."}, {"url": "https://www.colts.com/news/colts-season-in-review-1994-10256717", "page_content": "\"My philosophy is to control the ball, and I believe you win with defense,\" he said. \"When you go back to the great teams, the ones that sustained for any length of time, it was because of their defenses. I think you have to have a tough, aggressive, physical team.\"\n\nTobin's years with the Bears included the 15-1 team in 1985 that went on to win the Super Bowl, establishing its credentials as one of the most dominant squads in league history. In Tobin's final nine years in Chicago, the Bears reached the playoffs seven times. In his tenure, all 20 of his draft picks were productive players with nine earning Pro Bowl nominations.\n\nTobin immediately set about re-shaping the Colts.\n\nIn March, he traded Jeff George to Atlanta. The homegrown quarterback had started 49 games the previous four seasons since being drafted first overall in 1990, but held out for more than a month heading into 1993, disrupting the team and contributing to a 4-12 season.\n\n\"I think this is best for all concerned,\" said Tobin. \"It's best for the Colts, and it's best for Jeff George. And I think it's best for the Falcons that he go there.\"\n\nSoon thereafter he signed Jim Harbaugh away from the Bears to compete for the starting quarterback job.\n\n\"Jim is a guy who has been exposed to playoff situations, championship situations, winning situations,\" Tobin said. \"He's a leader, he's a winner and he's in the prime of his career.\"\n\nTobin also signed prominent free agents including defensive end Tony Bennett, safety David Tate and wide receiver Floyd Turner.\n\nIn April, Tobin engineered a memorable draft that produced a future Hall of Fame running back in second overall pick Marshall Faulk. Seven of the eight picks finished the season on the roster, including linebacker Trev Alberts, offensive linemen Eric Mahlum and Jason Mathews, tight end Bradford Banta and running back Lamont Warren.\n\nThe draft also produced a moment that would forever mark Tobin's years with the Colts. When he opted to take Nebraska linebacker Alberts with the fifth pick rather than quarterback Trent Dilfer, Tobin was roundly criticized by ESPN draft analyst Mel Kiper Jr. Tobin defended the choice, and the exchange remains a memorable draft moment.\n\nWith head coach Ted Marchibroda's steady hand, a roster infused with young talent and Tobin's leadership from the top, the Colts laid the foundation for a remarkable future.\n\nRECAPPING THE 1994 SEASON\n\nMost memorable games: Considering Buffalo entered the season with four consecutive Super Bowl appearances, the Colts were not the only team to struggle with the Bills, but their difficulties had become acute. But they exorcised that demon by sweeping the Bills for the first time since 1980, playing a major role in ending the playoff run of their AFC East rivals. The biggest verdict came on October 16 in Buffalo, where the Colts had been outscored, 193-55, in their previous six trips. But Harbaugh completed 18-of-22 passes and directed two long touchdown drives as Indianapolis pulled a 27-17 shocker. Harbaugh's completion percentage (.818) was the second-highest in team history at the time. He guided a 17-play, 98-yard drive in the second quarter, completing all seven of his attempts including the capper, a 6-yard toss to Floyd Turner. The march consumed 10:25. In the third quarter he guided a 15-play, 79-yard drive capped by a 10-yard toss to Kerry Cash. That drive consumed 8:27. Sean Dawkins had six receptions for 105 yards. In the final game of the season, the Colts completed the sweep, 10-9, in the RCA Dome when Buffalo kicker Steve Christie – who had missed two field goal attempts all season to that point – missed two, including a 46-yarder that bounced off the upright as time expired. The victory gave the Colts a .500 season (8-8).\n\n* *\n\nBest seasonal performance: Faulk was a sensation right away, filling his trophy case with a prolific rookie season. He rushed for 1,282 yards (third-most in club history) and 11 touchdowns. He caught 52 passes for 522 yards and another score. His 1,804 total yards ranked second in club history and accounted for 40.9 percent of the team's output. He was the first player in NFL history to be named both the Offensive Rookie of the Year and Pro Bowl MVP, rushing for a record 180 yards in the game, while posting the first 1,000-yard season ever for a Colts rookie. He showed his Hall of Fame talent in the opening game, rushing for 143 yards and three touchdowns in a 45-21 victory over Houston, the first of his four 100-yard rushing games. He also topped 100 against Tampa Bay (104), the Jets (110) and Seattle (129). Faulk had 127 yards receiving against Washington, including an 85-yard touchdown.\n\n* *\n\nOther individual highlights: Harbaugh started nine games and posted a quarterback rating of 85.8, setting a club record by connecting on 61.9 percent of his passes. … Linebacker Jeff Herrod led the team in tackles for the fifth time in six seasons with a career-high 200 (94 solo). … Bennett produced nine sacks and forced two fumbles. … Ray Buchanan started the season at free safety but shifted to left cornerback for the final six games and totaled eight interceptions, returning three for touchdowns and totaling 221 return yards, the second-best seasonal mark in team history. … Dawkins led the team in receiving yards (742) while Turner tied Faulk for the lead in receptions (52). Dawkins, Turner and Faulk produced then only the fourth seasonal trio of 50 seasonal receivers in Colts history. … Center Kirk Lowdermilk and tackle Will Wolford anchored an offensive line that allowed just 28 sacks while paving the way for the number four rushing offense in the NFL.\n\nTurning point: The Colts carried a 2-4 record into their October 16 matchup in Buffalo, which had been a difficult venue for the Indianapolis team. But with the Bills' defense focused on Faulk, limiting the dynamic rookie to a modest 64 yards on 26 attempts, Harbaugh took over and directed the 27-17 victory gave the revamped Indianapolis franchise a huge boost of confidence. It was the club's first non-strike win in Buffalo since 1980. The Colts finished with six wins in their final 10 games. Buffalo, on the other hand, was 4-2 entering that game and wound up losing seven of its final 10. \"It's a great victory for us because it puts us right back in the thick of things,\" said Marchibroda. \"Like I've said all year, we haven't played our best football. This was our best game, and it came at the right time.\""}, {"url": "https://www.chicagotribune.com/news/ct-xpm-1994-01-13-9401130311-story.html", "page_content": "The brothers Tobin were reunited again Wednesday when Vince Tobin was hired as defensive coordinator of the Indianapolis Colts five days after Bill Tobin was named the club's director of football operations.\n\nVince, former Bears defensive coordinator, takes over the 28th-ranked defense in the league from Rick Venturi, fired Monday along with three members of the defensive staff.\n\nAdvertisement\n\n\"Up. You go up,\" Vince said.\n\nBill Tobin announced the firings and said head coach Ted Marchibroda would hire the replacements with Tobin's review. Vince Tobin said he spent five hours with Marchibroda on Tuesday before Marchibroda offered him the job.\n\nAdvertisement\n\nVince said he spent five more hours Wednesday studying personnel and is getting along well with Colts offensive coordinator Nick Nicolau.\n\n\"We haven't had any fights yet,\" Tobin said with a laugh.\n\nWith the Bears from 1986-92 as the successor to Buddy Ryan, Tobin's defenses finished 1st, 2nd, 2nd, 25th, 6th, 4th, and 17th in the NFL. Ryan's defenses the previous eight years finished 12th, 6th, 10th, 19th, 16th, 8th, 1st, and 1st.\n\n\"Vince is a decisive individual and not afraid to commit himself and that is what we were looking for,\" Marchibroda said. \"The thing that attracted us the most was the success he has had in the past.\"\n\nThe Colts also must replace defensive coaches Francis Peay, Jay Robertson and George Catavalos, plus receivers coach Dwain Painter. Other ex-Bear coaches with ties to the Tobins include Vic Rapp, Hank Kuhlmann and current Cardinals assistant Jim Johnson.\n\n\"Ted has definite ideas what he wants to do and there are some people I know I would like to see here,\" Vince said.\n\nTobin, 50, takes over a defense that includes the first two picks of the 1992 draft-Steve Emtman and Quentin Coryatt. But both have been hampered by injury and Emtman underwent further knee surgery last Friday.\n\n\"The original prognosis is he would be out all of next year. Now they're saying they hope he'll be back part of next year,\" Tobin said.\n\nAdvertisement\n\nTobin coached the 4-3 defense with the Bears, but was a 3-4 coach in the United States Football League because the personnel suited it.\n\n\"I'll have to make my decision of what we play based on the other people more than (Emtman),\" Tobin said.\n\nTobin spent his year away from the NFL studying video at Mike Ditka's home, where the former Bears head coach has a tape machine. Tobin also helped coach his son Ryan's eighth-grade team in Libertyville.\n\n\"We finished first in defense,\" Tobin said."}, {"url": "https://www.indystar.com/story/sports/nfl/colts/2019/04/24/mel-kiper-look-back-1994-nfl-draft-feud-colts-gm-bill-tobin/3563539002/", "page_content": "Who in the hell is Mel Kiper?\n\nIt's been 25 years since former Indianapolis Colts general manager Bill Tobin uttered the famous phrase during a live-TV feud with NFL Draft analyst Mel Kiper Jr.\n\nTheir back-and-forth became one of the most memorable and bizarre moments in draft history.\n\nWe know now that Kiper is a one of the premier draft analysts on television, a lover of pumpkin pie, hair products and all things Baltimore.\n\nIn 1994, Kiper was an unknown draft analyst, and Indy's GM did not seem fond of his predictions.\n\nThe drama centered around what the Colts should do with their two first round picks. The Colts owned the No. 2 overall pick and acquired the No. 7 overall pick after trading starting quarterback Jeff George to the Atlanta Falcons.\n\nWith George out of the picture and only Jim Harbaugh left on the roster, Kiper believed the Colts should draft a quarterback, either Heath Shuler or Trent Dilfer.\n\nTobin had other plans. He selected future Hall of Famer Marshall Faulk with the team's first first-round pick. Kiper offered light criticism of the selection, saying the Colts needed to address their hole at quarterback.\n\nThree picks later, with Shuler off the board, Indianapolis traded up to the No. 5 pick. Everyone thought Indy was targeting Dilfer. Instead the Colts selected Nebraska linebacker Trev Alberts with the pick, eliciting a furious response from Kiper.\n\n\"I think it was a typical Colts move,\" Kiper said to host Chris Berman. \"The Colts needed a quarterback. To pass up a Trent Dilfer when all you have is Jim Harbaugh — give me a break. That's why the Colts are picking second every year in the draft and not battling for the Super Bowl like other clubs in the National Football League.\"\n\nWhen ESPN reporter Chris Mortensen asked Tobin for his response to criticism during a post-draft interview, the Colts GM came ready to fire back.\n\n\"Who in the hell is Mel Kiper anyway?\" asks Tobin. \"Here's a guy that criticizes everybody, whoever they take. He's got the answers to who you should take and who you shouldn't take. And my knowledge of him: he's never ever put on a jock strap, he's never been a coach, he's never been a scout, he's been an administrator and all of a sudden he's an expert.\"\n\nThe whole time Tobin is ranting, Kiper is off screen, listening to Tobin insult him.\n\n\"We don't have to take anyone Mel Kiper says we have to take,\" Tobin continues. \"Mel Kiper has no more credentials to do what he's doing than my neighbor, and my neighbor's a postman, and he doesn't even have season tickets to the NFL.\"\n\nTobin seemed genuinely upset by Kiper's criticism, but the ESPN executives loved the attention the rant brought to the draft.\n\nTo his credit, Tobin's selection of Faulk was a productive one. Faulk played five seasons in the Indy before being traded to the St. Louis Rams for picks that became linebacker Mike Peterson and defensive end Brad Scioli.\n\nPassing on Dilfer for Alberts was not a smart decision. Alberts notched just one sack in three years with Indy before retiring due to injury.\n\nDilfer went one pick later to the Tampa Buccaneers. He had an up-and-down career with the before winning a Super Bowl with the Baltimore Ravens in 2000.\n\nTobin was fired by the Colts in 1997 after a 3-13 season.\n\nKiper is in his 35th season with ESPN.\n\nFollow IndyStar sports producer Akeem Glaspie on Twitter at @THEAkeemGlaspie."}, {"url": "https://mutigers.com/honors/hall-of-fame/bill-tobin/91", "page_content": "Thanks for visiting !\n\nThe use of software that blocks ads hinders our ability to serve you the content you came here to enjoy.\n\nWe ask that you consider turning off your ad blocker so we can deliver you the best experience possible while you are here.\n\nThank you for your support!"}, {"url": "https://www.indystar.com/story/sports/nfl/colts/2014/03/17/timeline-jim-irasy-through-the-years/6522179/", "page_content": "Star report\n\nJim Irsay through the years:\n\nJune 13, 1959: Born in Lincolnwood, Ill.\n\n1972: Jim's father, Robert Irsay, buys the Los Angeles Rams for $16 million, then trades them for the Baltimore Colts and $3 million in cash.\n\n1977: Jim graduates from Loyola Academy in Wilmette, Ill.\n\nAug. 2, 1980: Marries high school sweetheart Meg Coyle.\n\n1982: Graduates from Southern Methodist University with broadcast journalism degree; joins the Colts, working in the ticket office and public relations.\n\nMarch 28, 1984: Colts move to Indianapolis in the middle of the night.\n\nApril 26, 1984: Bob Irsay names Jim general manager.\n\nOct. 31, 1987: Jim engineers a trade for star running back Eric Dickerson, one of the franchise's most significant moves ever. The trade sends linebacker Cornelius Bennett to Buffalo, where he becomes a star.\n\n1987: Colts win the AFC East Division with a 9-6 record and make their first playoff appearance since moving to Indianapolis, losing 38-21 to Cleveland.\n\n1991: Colts' worst season ends with 1-15 record.\n\nJan. 7, 1994: Bob Irsay hires Bill Tobin as vice president and director of football operations, elevating him over Jim.\n\nNov. 29, 1995: Bob Irsay suffers a stroke. Jim assumes control of franchise's day-to-day operations.\n\nJan. 14, 1996: Colts lose AFC Championship game — and a trip to the Super Bowl — when last-second Hail Mary pass falls incomplete in game against Pittsburgh Steelers.\n\nJan. 14, 1997: Bob Irsay dies, leaving ownership of the team in a legal dispute between Jim and Bob's second wife, Nancy Irsay.\n\nDec. 5, 1997: Jim and Nancy Irsay reach an agreement that gives Jim sole ownership of the Colts. At 37, he is the youngest owner in the NFL. Nancy gets a reported financial settlement near $12 million and Robert Irsay's 38-acre estate in Carmel.\n\nDec. 22, 1997: Irsay hires Bill Polian as Colts president and head of football operations.\n\nJan. 13, 1998: Irsay and the city of Indianapolis agree on a renegotiated lease for the RCA Dome, providing the team at least $8 million a year in dome-generated revenues and assuring the city the franchise will stay at least 10 years.\n\nApril 1998: Colts choose quarterback Peyton Manning with the first overall pick in the 1998 NFL draft.\n\n1998-99: Colts go 13-3 and win AFC East but lose to Tennessee Titans in the playoffs.\n\nMay 22, 2001: Irsay pays $2.43 million for the original manuscript of Jack Kerouac's \"On The Road.\"\n\nAug. 20, 2001: Meg Irsay files for legal separation from Jim, then withdraws the request.\n\nJan. 22, 2002: Colts hire Tony Dungy as head coach, just days after he was let go by the Tampa Bay Buccaneers.\n\nApril 25, 2002: With neighbors voicing complaints, Irsay gives up his effort to fly his $6 million helicopter from the helipad at his Carmel estate.\n\nSept. 8, 2002: An ESPN report rekindles speculation that the Colts will move to Los Angeles. Irsay denies the report and says the Colts are committed to Indianapolis until at least 2003, but it sets off a flurry of debate over the Colts' future. Mayor Bart Peterson says the city may be forced to make annual payments to the Colts of more than $10 million to keep the team.\n\nSept. 17, 2002: Meg Irsay renews her request for legal separation.\n\nOctober 2002: Irsay and the city say they will begin negotiations to keep the team in Indianapolis.\n\nNovember 2002: Irsay confirms he sought treatment for an addiction to prescription pain medication. Irsay said he sought professional help at a nationally recognized facility outside of Indiana.\n\nNovember 2002: Dr. W. Gregory Chernoff, a prominent plastic surgeon who provided prescription painkillers for Irsay, surrenders his federal permit to prescribe narcotic drugs. The DEA was investigating possible prescription drug fraud involving local doctors, patients and pharmacies.\n\nNovember 2002: The owner of Nora Apothecary gives federal investigators records showing he filled 120 prescriptions over about a one-year period — including the painkiller OxyContin — for Colts owner Jim Irsay.\n\nFeb. 4, 2007: Indianapolis Colts defeat the Chicago Bears in Super Bowl XLI at Dolphins Stadium in Miami, Fla.\n\nJune 2008: Irsay is inducted into the Indiana Football Hall of Fame.\n\nAug. 24, 2008: First game is held at Lucas Oil Stadium.\n\nJanuary 2009: Dungy retires after the 2008 season. Jim Caldwell, associate head coach, succeeds Dungy as coach.\n\nJanuary 2012: Irsay fires Colts vice chairman Bill Polian and his son, Chris, after they preside over a 2-14 record, the team's worst record in two decades. Caldwell is fired days later. Irsay hires Ryan Grigson from Philadelphia as general manager and Chuck Pagano, Ravens defensive coordinator.\n\nFebruary 2012: Irsay is inducted into Junior Achievement of Central Indiana's Business Hall of Fame.\n\nMarch 2012: Irsay cuts Manning, and the two give an emotional press conference. Irsay said: \"There will be no other Peyton Manning.\"\n\nApril 2012: The Colts select Andrew Luck with the No. 1 overall pick.\n\nOct. 2012: Pagano is diagnosed with leukemia. A week later, Irsay delivered the game ball from the Colts 30-27 victory over Green Bay to Pagano at the hospital. \"I'll never forget the look on his face when we walked in with the game ball,\" Irsay said. \"We'll all treasure this moment forever.\"\n\n2012: The Colts rebound from a 2-14 season to finish 11-5 and make the playoffs.\n\nNovember 2013: Meg Irsay files for divorce to end her 33-year marriage to Irsay.\n\n2013: The Colts finish with a 11-5 record and win the AFC South title. After falling behind 38-10 in the third quarter, Luck leads the team to a 45-44 victory over the Kansas City Chiefs in the first round of the playoffs.\n\nMarch 16, 2014: Irsay is arrested in Carmel, Ind., on four preliminary felony counts of possession of a controlled substance and two misdemeanor counts of operating a vehicle while intoxicated and operating a vehicle with a controlled substance in the body. Police said they found him in possession of prescription drugs after pulling him over for erratic driving.\n\nMay 20, 2014: Irsay joins former Colts star Jeff Saturday and others in Atlanta for a NFL owners' meeting where the 2018 Super Bowl bids are made. Minnesota's Twin Cities emerged the winner in a vote of owners, beating out Indianapolis and New Orleans.\n\nMay 23, 2014: The Hamilton County prosecutor formally charges Irsay with only the misdemeanor counts.\n\nJune 5, 2014: A Hamilton County court suspended Irsay's driver's license for one year, starting May 27, for refusing a blood test after his March 16 arrest.\n\nSource: The Star archives"}, {"url": "https://www.indystar.com/story/sports/nfl/colts/2016/01/21/1995-indianapolis-colts-jim-harbaugh-aaron-bailey-afc-championship-game-ted-marchibroda/78291676/", "page_content": "Manny Randhawa\n\nManny.Randhawa@indystar.com\n\n“It doesn’t seem like it’s been 20 years. It was the funnest year of playing football of my life.”\n\nJim Harbaugh remembers it like it was yesterday.\n\n“What happened was amazing,” he says. “Throughout the course of the season for all of us, we became a real team.”\n\nThat team was the 1995 Indianapolis Colts. The franchise was entering its 12th season in Indianapolis after relocating from Baltimore, and the direction in which it was headed was uncertain.\n\nThe Colts, beginning their fourth year under coach Ted Marchibroda, were coming off an 8-8 season, preceded by a 4-12 campaign. The franchise’s only playoff appearance since moving to Indianapolis had been in the strike-shortened 1987 season and ended with a loss to the Cleveland Browns in the first round.\n\nBut 1995 would be a special year for the Colts and the city of Indianapolis, a season filled with stirring comebacks and an improbable playoff run that would include one of the greatest AFC Championship games.\n\nPeyton Manning, deservedly, gets much of the credit for establishing football in Indianapolis. But the city's passion for football began in 1995.\n\n“I think we were the jump-start to an organization headed in the right direction,” says Zack Crockett, then a rookie fullback. “And then from all the negative things we heard about the team leaving Baltimore and all that, this was something to wash all that away and have a fresh beginning.”\n\nTraining camp\n\nThe Colts had several questions to answer entering training camp in August 1995, not the least of which was who would be the starting quarterback.\n\nIndianapolis had traded a future first-round draft pick to the Tampa Bay Buccaneers for Craig Erickson that offseason, casting doubt on whether the 31-year-old Harbaugh – who had started nine games for the Colts in 1994 – would be the No. 1 quarterback again. Despite his 61.9 percent completion rate and 85.8 passer rating in ’94, Indianapolis was 4-5 with Harbaugh starting.\n\nHarbaugh had come to the Colts after seven seasons with the Bears, the team that drafted him in the first round (26th overall) out of Michigan in 1987 while Bill Tobin – Colts general manager in 1995 – was director of player personnel for Chicago. Harbaugh led Chicago to a division title and a wild-card berth before a disastrous ’92 season (5-11) and mediocre ’93 campaign (7-9) led Chicago to waive him.\n\n“You don’t see that anymore,\" Crockett said of having a high-quality backup quarterback. \"To watch that in training camp, those two guys compete, it was unreal.”\n\nWithout a clear-cut leader on offense and with a team that had vacillated between mediocrity and moderate success, the Colts were undefined as a unit.\n\nThey would find that identity, in part, behind an offense that was undergoing a schematic transformation under new offensive coordinator Lindy Infante.\n\n“(Infante) was just enhancing your football IQ,\" receiver Aaron Bailey says. \"The receivers were responsible for making the correct read with the quarterback. We had to know the defensive front, just everything. We had to know different kinds of routes depending on what kind of blitz they came at us with; one route could morph into two other routes. It was kind of cool in a way.”\n\nWhen the Colts broke camp, Marchibroda had settled on Erickson as the starting quarterback. But Marchibroda’s decision would soon be tested.\n\nEarly-season momentum\n\nThe Colts lost their season opener to the Bengals in the RCA Dome, 24-21 in overtime. Erickson was 19-of-31 for 196 yards, a touchdown and three interceptions. He was replaced in the fourth quarter by Harbaugh, who led a game-tying drive to force overtime.\n\nIn Week 2, Erickson was again the starter. But with Indianapolis down to the Jets 24-3 in the third quarter, Marchibroda again turned to Harbaugh. After the Colts recovered a fumble for a touchdown, Harbaugh tossed two touchdown passes to bring Indianapolis all the way back, forcing another overtime. Harbaugh led a game-winning drive that ended in a Mike Cofer 52-yard field goal for a 27-24 win.\n\nMarchibroda made Harbaugh the starting quarterback.\n\n“I think it’s another life lesson there,” Harbaugh says. “It’s better to be prepared and your opportunity does not come than to not be prepared and have your opportunity come.”\n\nThe Colts lost in Week 3 at Buffalo i20-14 and after a bye week beat the Rams at home 21-18. Then came a game those Colts squad remember as a key marker in their development as a team capable of big things.\n\n“Yeah, that was Oct. 8, 1995,” Bailey says. “I remember because that was my first NFL touchdown.”\n\nTrailing the Dolphins 24-3 at halftime in Miami, Harbaugh worked his comeback magic again, throwing three touchdown passes – the final one a 21-yard strike to Bailey – to pull Indianapolis even late in the fourth quarter. In overtime again, Harbaugh led a 57-yard drive that ended in a 27-yard Cary Blanchard field goal.\n\n“Certainly the Miami game,” Harbaugh says when thinking back on the key moments of that season. “We were gaining confidence as players in ourselves and everybody’s abilities. Week after week it’s a new guy that’s shining and winning us the game.”\n\nThat day at Joe Robbie Stadium, Harbaugh heard himself called “Captain Comeback,” a nickname previously given to Hall of Fame quarterback Roger Staubach.\n\n“I liked it,” he says with a chuckle. “Wouldn’t you? Wouldn’t anybody? Who wouldn’t?”\n\nThe Miami win was followed by a stunning 18-17 victory over the defending Super Bowl champion San Francisco 49ers in Indianapolis.\n\n“A lot of people use (the word) ‘culture,’ but the attitude, everybody was team-first,” says Harbaugh. “From the front office, together with the coaches, together with the ownership, together with the players, the equipment staff, the training staff, I mean it felt like we were family.”\n\nThe 64-year-old Marchibroda was in his fourth decade of coaching in the NFL, and he knew how to get the most out of his players.\n\n“Coach Marchibroda was like a calming effect over the team,” Bailey says. “He was always cool. He was a great motivator, a great listener, a great teacher.”\n\nInfante’s offensive schemes were working with Harbaugh, a scrambling quarterback who could improvise on the go.\n\n“He was an offensive genius,” says Harbaugh. “Week after week, you could count on seven wide-open throws a game, just the way he was scheming it – 15 yards-plus kind of completions. It was artful.”\n\nThings were coming together defensively as well under coordinator Vince Tobin. In the victory over San Francisco, the Colts held an offense led by reigning league Most Valuable Player Steve Young to 269 yards.\n\nMidseason adversity\n\nThe Colts hit a rough stretch after the win over San Francisco, losing three of their next four games. But Harbaugh got the Colts rolling again with wins over the Patriots and Dolphins.\n\nIn Week 13, Harbaugh outdueled Dan Marino. Harbaugh threw for 180 yards and three touchdowns, one to second-year running back Marshall Faulk, who had 133 all-purpose yards. The Colts built a 24-0 lead and held off a late Miami charge for a 36-28 win.\n\nThe next week, Harbaugh was sacked six times by the Carolina Panthers and sustained a knee injury that forced him out of the game in the third quarter. Indianapolis lost 13-10, but of more concern was Harbaugh’s condition – he would need arthroscopic surgery and it was uncertain how long he would be out of action.\n\nErickson would reprise his starter role in Week 15 and help lift Indianapolis to a road victory over the Jaguars. Bailey was the catalyst, taking the game’s opening kickoff and returning it 95 yards for a touchdown, then scoring on a 14-yard touchdown reception to put Indianapolis up 14-0. The Colts held off Jacksonville for a 41-31 victory that pushed their record to 8-6.\n\nHarbaugh was back for the following week’s game against San Diego after having surgery to remove damaged cartilage from his right knee.\n\n“Jim was getting knocked out and he’s staggering on the field almost like in a boxing match,” says Crockett. “When you see a guy that lays it on the line like Jim did, you as a player, you have no excuse. None. You just go out and say: ‘I’m gonna give my all just like he did.’ ”\n\nEntering Week 16, the Colts were in position to clinch a playoff berth for the first time in eight years and the second time since moving to Indianapolis in 1984, but they lost 27-24 to San Diego. The Colts would go into the final game of the regular season with a postseason berth in the balance.\n\nIn a nationally televised Sunday night game at the RCA Dome, the Colts intercepted New England quarterback Drew Bledsoe three times, and 157 all-purpose yards from backup running back Lamont Warren resulted in a 10-7 Colts win, securing a wild-card berth.\n\nHarbaugh, in his ninth pro season, earned his first Pro Bowl selection and was named Comeback Player of the Year. He led the NFL with a 100.7 passer rating while throwing 17 touchdown passes and a league-low five interceptions. His three fourth-quarter comeback wins also led the league.\n\nNothing to lose\n\nIn the playoffs, the Colts would face the team they played just 14 days earlier: the San Diego Chargers.\n\n“Going into San Diego, we were double-digit underdogs,” Harbaugh recalls (it was actually 5½ points, according to pro-football-reference.com). “We felt like we had nothing to lose, but yet, we’re gonna win.”\n\nFaulk – selected for the Pro Bowl after rushing for 1,078 yards and 11 touchdowns – left the game after his first carry – a 16-yard gain. He had re-injured his left knee, suffering from loose cartilage. With Faulk and starting fullback Roosevelt Potts out with injuries, it was up to Warren and Crockett to carry the rushing load.\n\nCrockett had only one NFL rushing attempt for no gain to that point.\n\n“During pregame warm-ups, the general manager, Bill Tobin, came to me,” says Crockett, “and we talk to this day about this – he tapped me on my shoulder and said, ‘We need you today.’”\n\nBy the end of the game, Crockett had rushed for 147 yards and two touchdowns on 13 carries.\n\nIn the fourth quarter, with Indianapolis clinging to a 21-20 lead, Crockett broke the Colts’ all-time playoff record for longest rushing play, eclipsing Tom Matte’s 58-yard run in the 1969 Super Bowl. Crockett’s 66-yard run for his second touchdown would be enough for the Colts to advance to the divisional round.\n\n“Once I got past (Chargers linebacker) Junior (Seau) after the cutback, I saw daylight and I knew no one was gonna catch me with the speed that I had,” Crockett says.\n\nThe moment encapsulated what the Colts had been doing all season: relying on someone new every week to come up with a big play.\n\n“You couldn’t ask for a better stage than that as a rookie, having a lot of snaps behind a Hall of Famer like Marshall Faulk in practice,” says Crockett. “And yeah, I only had one carry during the season, but look at who I was behind. I was over-prepared for that game.”\n\nThe Indianapolis defense was also key, intercepting Stan Humphries four times, two by free safety Jason Belser. The Colts went on to win 35-20 for the franchise’s first playoff victory since 1971. It set up a matchup with Super Bowl favorite Kansas City.\n\nKids in a candy store\n\nThe Kansas City Chiefs owned the best record in the NFL (13-3) and the league’s top-ranked defense. They also hadn’t lost at home.\n\n“(Everybody was) talking about Kansas City and who they were gonna play (in the next round),” says Bailey. “Of course they looked past us.”\n\n“No, I really don’t think we were looking past them,” says Greg Manusky, a linebacker on that '95 Chiefs squad and formerly the Colts' defensive coordinator. “We were giddied up and really excited to play the Colts. It wasn’t like we were looking at who we were gonna play in the next game.”\n\nSunday, Jan. 7, 1996 was a frigid day in Kansas City. The temperature at kickoff was zero with a wind chill of 15 below. The field turf, particularly on the sidelines, was hard as ice. For a team that played its home games in a domed stadium, it didn’t bode well for Indianapolis.\n\n“It was so cold, you wanted something to warm you up, so you took hot apple cider to the field,” Crockett says. “It was frozen by the time you got to the middle of the field. Guys like me from Florida, we’re like, ‘OK, we’re gonna be tough.’ I had no sleeves on with the Vaseline on the arms and then the shade came over the field by halftime. I literally almost froze to death.”\n\nFacing the league’s No. 1 rushing offense, the Colts defense proved to be the difference. Chiefs running back Marcus Allen rushed for 94 yards but did not get into the end zone, and Kansas City quarterback Steve Bono was intercepted three times.\n\nWith the weather conditions, Harbaugh wasn’t very effective through the air – completing 12-of-27 passes for 112 yards — but he managed 48 yards on the ground, keeping drives alive when Kansas City’s defense flushed him out of the pocket.\n\n“We called it plastering – you’ve gotta plaster on the back end and that’s what we had to do that day with Harbaugh,” Manusky says. “And I think he found a couple openings. With the conditions that we had and even though we had Neil Smith, Derek Thomas and Dan Saleaumua, we just didn’t have an opportunity to get to him.”\n\nA 7-7 contest at halftime, a Blanchard field goal in the third quarter would decide it. The Chiefs' Lin Elliott missed three field goals, including a 42-yarder that would have tied the score late in the fourth quarter.\n\n“They had a last-second field goal try and they end up missing it, and I remember nudging one of my best friends to this day, (wide receiver) Bobby Olive, and we went crazy,” says Bailey. “We were like little kids in a candy store, running and jumping around, hugging each other.”\n\n“You were just like, ‘When is this fairy tale gonna be over?’ ” Crockett says.\n\nNext up would be the Pittsburgh Steelers for the right to play in the Super Bowl. But first, a homecoming.\n\nA football city is born\n\n“I moved here from Chicago in ’93 and we’d go to Colts games because there were tickets everywhere,” says Kent Sterling, assistant program director of Indianapolis radio station WIBC in 1996. “And when there was a touchdown and you’d stand up and cheer for the Colts, you’d have a lady two rows behind you yelling at you to sit down. That’s kind of the way this place was.”\n\nAfter the Colts upset the Chiefs in Kansas City, the team was welcomed home by a crush of fans at the Indianapolis airport.\n\nWhile many became aware of Indianapolis as a football town after Peyton Manning became the Colts’ quarterback in 1998 and the team became a perennial playoff contender, Bailey says it began before that.\n\n“You’ve gotta think about it. Indianapolis was a basketball city,” Bailey says. “You fast-forward to right now: It’s kind of split. It was flattering to see that 12th man – that’s when they were born, that ’95 season.\"\n\n“When people lined up with banners and signs, we felt like rock stars coming back home that day,” says Crockett. “Everyone knew who you were. Imagine if we had social media like we have now; it would’ve been unreal.”\n\n‘We’re the hot team’\n\nThe Steelers were on a mission to reach the Super Bowl after coming up 3 yards short the season prior against the Chargers, and the Colts were coming in riding a wave of underdog momentum.\n\n“(Marchibroda’s message was:) ‘Everyone’s counting us out. We believe,’ ” Bailey remembers. “‘The guys here in this locker room believe. The people in Indianapolis believe. You play for them. You play for your brothers here in this locker room. We’re the hot team.’”\n\nA Neil O’Donnell touchdown pass to Kordell Stewart with 13 seconds left in the second quarter gave Pittsburgh a 10-6 lead going into halftime. Television replays showed Stewart stepped out of bounds and came back into the end zone to make the catch, but the penalty wasn't called.\n\nAfter the teams traded field goals, Harbaugh, beginning at the Colts’ 30-yard line early in the fourth quarter, threw three straight completions followed by a 47-yard touchdown pass to Floyd Turner to put Indianapolis ahead with 8:46 remaining in the game. With the Colts up 16-13, the Three Rivers Stadium crowd was stunned.\n\n“It was definitely an emotional roller coaster, from your heart racing to your heart pounding when you’re kinda worried, to you’re excited,” says Bailey.\n\nIndianapolis had a third-and-1 at its own 31 with 3:57 to go. A first down would keep alive a drive that could eat enough clock to seal a trip to the Super Bowl. But blitzing Steelers cornerback Willie Williams swept in from the right side and grabbed Warren’s ankle to bring him down short of a first down.\n\n“If he wouldn’t have gotten an ankle tackle right there, man … the game was over,” Crockett says. “Game was over.”\n\nThe Colts were forced to punt. On the third play of the next Pittsburgh drive, O’Donnell threw a short pass intended for wide receiver Ernie Mills that Quentin Coryatt almost intercepted.\n\n“(Coryatt) started running and at the last second, this guy comes in and punches the ball out of his arm,” remembers Bailey.\n\nFollowing another incomplete pass, it was fourth-and-3. A stop here, and the Colts would have the football, 2 minutes away from Super Bowl XXX.\n\nBut O’Donnell completed a pass over the middle to Andre Hastings for 9 yards.\n\nThe next play was a 37-yard completion to Mills to the 1, and running back Bam Morris took it in from there to give Pittsburgh a 20-16 lead with 1:34 to play.\n\nThe Colts began their final drive of the game at their own 16. With 88 seconds to go 84 yards, “Captain Comeback” went to work.\n\n“It was just all in the moment,” Harbaugh says. “And you just trusted your teammates and had great confidence that they would make the appropriate play, finish their assignment, do their job.”\n\nHarbaugh was forced out of the pocket on first down and threw the ball away.\n\nEighty-two seconds left.\n\nOn second down, Harbaugh completed a 7-yard pass to Warren to the 23.\n\nSeventy-four seconds.\n\nOn third-and-3, Harbaugh completed an 18-yard pass over the middle to Turner to the 41.\n\nSixty-six seconds.\n\nHarbaugh couldn’t find an open receiver on the next play, and ran for 8 yards.\n\nTimeout with 39 seconds left.\n\nOn second down, Harbaugh threw over the middle for Turner again, but it went in and out of the hands of Steelers defensive back Chris Oldham. Harbaugh was slow getting up after taking a shot from Pittsburgh defensive end Brentson Buckner.\n\nBleeding from his right hand, Harbaugh threw his next pass incomplete for Warren, bringing up fourth-and-2.\n\nTwenty-eight seconds.\n\nHarbaugh found wide receiver Sean Dawkins, who went out of bounds at the Pittsburgh 38 for a first down.\n\nTwenty-one seconds.\n\nHarbaugh was immediately pressured by the Steelers’ pass rush on the next play and scrambled to the 29. With no timeouts, he hurried everyone to the line of scrimmage and spiked the ball to stop the clock.\n\nFive seconds. One shot at the end zone. One shot at the Super Bowl.\n\nEverything in slow motion\n\nThe Colts ran the Hail Mary during Friday practices each week.\n\n“There was nothing that I could remember (in the huddle) that was any different than: Here’s the play, and you trust that everybody’s going to do what they’re supposed to do,” Harbaugh says. “Without even thinking that they wouldn’t. Just trust and knowing that they would.”\n\n“We’d been in close games most of the season,” says Bailey. “So it was just like business as usual; we’re gonna go down here, we’re gonna make a play and we’re gonna score.”\n\nAs Harbaugh walked up to the line of scrimmage, he had only one thing on his mind.\n\n“I just kept telling myself: 'Hit a spot, hit a spot 5 yards deep in the end zone and don’t throw it out of the end zone,' ” Harbaugh recalls. “Whatever you do, don’t throw it out of the end zone.”\n\nAs he jogged out to the right side as part of a triple-right formation for the Colts, Bailey was talking to himself, too.\n\n“Brian Stablein, he was on my side; it was Brian, Floyd Turner and myself,” Bailey says. “Brian was always the tip guy because with his vertical he could jump up and tip the ball in the air or just jump up and catch the ball.\n\n“And Floyd and I were the ones that were gonna catch the tip. I distinctly remember running down and thinking, 'I’ve gotta get down here, I’ve gotta get down here, I’ve gotta get down here and get into position.' ”\n\nHarbaugh took the snap, dropped back, paused, and lofted the ball into the air.\n\n“I turn around and I see the ball coming,” says Bailey. “And it’s coming right to me. And your whole thought process is: I hope we can keep it inbounds. And as the ball was coming down, we started jostling for position.\n\n“So I’m feeling guys tugging on my arms, I’m feeling guys trying to pull me down. I’m feeling guys grabbing the back of my jersey. You’re shaking yourself loose through all this stuff, and then all at once, you jump up.”\n\nThe ball was tipped and juggled between Bailey and multiple Steelers defenders. When Bailey fell to the ground, NBC television commentator Phil Simms yelled out: \"He caught it! He caught it!”\n\nBailey stood up and with the football in his left hand, raised both hands in the air.\n\n“We were always taught: Make the ref make a decision,” Bailey says. “You go up, you put the ball in the air. The ref says no, he saw it. And that was the end of the game.”\n\nThe referees ruled the ball had hit the ground. It was all over. The Steelers were going to the Super Bowl.\n\n“I thought it was a catch,” says Crockett. “I immediately just thought, 'I’m going to the Super Bowl!' ”\n\nHarbaugh, from his vantage point, saw the officials signal incomplete pass and looked up at the stadium’s big screen for a replay.\n\n“The first angle, (I thought) 'Oh, it looked like he caught it,' ” says Harbaugh. “The second one: 'Oh, he looked like he caught it.' The third one: 'Aaah, it probably hit the ground.' ”\n\n“All this is going on in my head – this is happening in real time, but I’m seeing everything in slow motion,” Bailey says. “Of course, they’ll show it on TV in super-slow motion – ‘Oh, the ball’s on his stomach!’\n\n“It’s like catching a speeding bullet. It was tucked in between my arm – half the ball’s on my arm and half the ball is on the ground. It’s almost like you’re in a dream. You’re trying to grab something, but you just can’t get it.”\n\nHarbaugh watched a replay of the telecast the following week. Bailey didn’t.\n\nHarbaugh would reach the Super Bowl, but not as a player. Eighteen years after that Hail Mary, he coached the 49ers to the 2013 Super Bowl, losing 34-31 to the Baltimore Ravens.\n\n“Even that day,” Harbaugh says of the 1995 AFC Championship Game, “you’re walking off the field going, ‘There will be other days.’ As a player, it turned out that was the only one. That was as close as we got. Would’ve liked to, and didn’t. Facts are stubborn things. And that’s a fact.”\n\nLegacy\n\nIn February 1996, Marchibroda’s contract was not renewed and Infante was named the new head coach. The Colts went 9-7 and returned to the playoffs, losing to the Steelers in the wild-card game. In 1997, with several key members of the ’95 team now gone, Indianapolis started the season 0-10 and finished 3-13.\n\nThat result gave the Colts the No. 1 selection in the 1998 NFL draft, with which they picked Tennessee quarterback Peyton Manning.\n\nManning would lead the franchise to 11 playoff appearances and a Super Bowl title in 13 seasons, making the Colts a perennial power in the AFC.\n\nColts owner Jim Irsay fired Tobin after the 1997 season, bringing in Bill Polian as president. But while the Colts lost 13 of their last 21 games on his watch, Tobin was the architect of a team that was inches away from reaching the Super Bowl in 1996.\n\n“If you really studied it, the job Bill Tobin did, putting that team together, and it wasn’t just, ‘Here are a bunch of high draft picks,’ ” says Harbaugh. “There were high draft picks that were good, and there were guys like myself who were off the scrap heap. Just every piece on the board was like a chess piece. How about putting that roster together and it worked for what not too many years before was a 4-12 team?”\n\nHarbaugh would spend the 1998 season with the Ravens, reunited with Marchibroda, who was now coaching Baltimore. Harbaugh finished out his playing career with the Chargers in 1999 and 2000.\n\n“Everybody’s football career comes to an end,” Harbaugh says. “I mean, very few guys play their best football right up to their very last day and then retire. I take pride that I was replaced by Peyton Manning. That’s pretty darn good. How does it get better than that?”\n\nHarbaugh and Bailey will forever be linked with the final play of the 1995 AFC Championship Game.\n\n“Being back in Ann Arbor now (coaching Michigan football), there are a lot of people that know Aaron Bailey (who grew up in Ann Arbor),” Harbaugh says. “It comes up a lot.”\n\nBut both remember that season more for what was than what could have been.\n\n“It was a heck of a time,” says Harbaugh. “It was a rare thing. And it was great to be a part of it.”\n\nFollow IndyStar reporter Manny Randhawa on Twitter: @MannyRsports.\n\n1995 Indianapolis Colts Schedule"}, {"url": "https://www.chicagotribune.com/news/ct-xpm-1996-01-11-9601110073-story.html", "page_content": "INDIANAPOLIS — If Bill Tobin has turned around the Indianapolis Colts three years after leaving the Bears, it raises the question of whether Chicago made a mistake in turning away its player-personnel director when Dave Wannstedt was hired in 1993.\n\nTobin has more power as Colts vice president and director of football operations than the Bears ever gave him. Now he is one victory from the Super Bowl and universal acclaim as one of the NFL's shrewdest architects.\n\nAdvertisement\n\nShould the Colts' joy ride continue Sunday with a victory at Pittsburgh in the AFC championship game, more questions will be asked about whether Tobin as general manager and Wannstedt as coach couldn't have been a harmonious and winning arrangement at Halas Hall.\n\nPerhaps Wannstedt would have spurned the Bears in that case, since he didn't accept a New York Giants job offer that would have left personnel decisions in the hands of General Manager George Young. Dan Reeves is now chafing under that yoke.\n\nAdvertisement\n\nBut in the two years of drafts since Tobin and the Bears parted, his selections have shown a more immediate dividend than Wannstedt's. For while Wannstedt doesn't own the GM title, he nonetheless is the final word in any personnel judgments and is responsible for acting on his scouting staff's recommendations.\n\nTobin and Wannstedt would have disagreed, however, from the start.\n\nTobin wouldn't have drafted Curtis Conway with the Bears' first pick in April 1993. His wide receiver choice would have been O.J. McDuffie, who made 62 catches for 819 yards and eight touchdowns with Miami this season, as well as a 24.5-yard kick-return average.\n\n\"We had McDuffie rated higher than Conway and, if I was going to be there, we needed a good player right away and not any spoiled guy from L.A.,\" Tobin said Wednesday. Conway, who led the Bears with 12 touchdown catches in 1995, \"may be a great player, but he was not my best wide receiver.\"\n\nTobin was a lame-duck player-personnel director at the time. Coach Mike Ditka had been fired after a 5-11 record in 1992, and Tobin was in the Halas Hall draft room in 1993 mainly as a traffic cop, overseeing the grading of the draftees with Bear scouts. He didn't have an ounce of influence in final decisions in his last official act as a Bear.\n\nA second disagreement would have come over Jim Harbaugh, the quarterback the Bears waived in March 1994. Harbaugh happens to be leading the Colts onward and upward.\n\nTobin's 1994 draft, in contrast to Wannstedt's, had staying power. Seven of his first eight picks finished the season on the Colts' active roster.\n\nThe Bears, on the other hand, took offensive tackle Marcus Spears in the second round in 1994, and defensive lineman Pat Riley and punter-kicker Todd Sauerbrun in Round 2 of 1995. Spears and Riley basically didn't play this season, when the Bears went 9-7 and missed the playoffs. Sauerbrun was a spectacular dud.\n\nAdvertisement\n\nTobin refuses to assess the Bears' drafts the last two years, feeling it's not his place. He prefers to talk about his top two draft picks in 1994: running back Marshall Faulk (now out with a knee injury) and Trev Alberts, a key to the Colts' shifting defense from a 4-3 to a 3-4 with his ability to play linebacker or end. Alberts doesn't start, but has been involved in 68 percent of the total plays.\n\nRookie defensive tackle Ellis Johnson, Tobin's first-round pick in 1995, remains a work in progress, but he started in place of an ill Tony Siragusa in Sunday's victory in Kansas City. Ex-Illini tight end Ken Dilger, Tobin's second pick from 1995, was the Colts' third-leading receiver this season with 635 yards, and his four receiving touchdowns tied for the team lead.\n\nCompare the impact of Faulk on the Colts and that of defensive end John Thierry, the Bears' first-rounder in 1994, on Chicago, and Tobin wins the comparison hands down at this point. Compare Dilger with Sauerbrun and Riley, and the same applies.\n\n\"Next season Thierry can be the Conway of 1995,\" Wannstedt contends, believing that with time, Thierry will mature on the line the way Conway did this season as a big-play receiver.\n\nOthers can argue the Bears would be better off with Tobin still working at Halas Hall, still offering his learned and diversified opinion of college talent. Tobin thinks the separation was needed.\n\n\"It was time to leave when I left,\" he said. \"I had 18 good years in Chicago. But my contract was being overriden by what (Bears President Mike McCaskey) promised Dave. The philosophy was changing and went against my principles, what I believed to be true.\"\n\nAdvertisement\n\nTobin didn't just bring in talent in Indy.\n\n\"We found some players here they didn't know they had. Tony McCoy was sitting on the bench. They had Ray Buchanan at corner, and David Tate wasn't here. Stephen Grant was just a name. Quentin Coryatt was playing out of position.\n\n\"We signed selective free agents. We gave Tony Bennett a lot of money, but he's everything we thought he was. Harbaugh was adrift, and after I traded Jeff George I signed him. Harbaugh's a winner and a leader.\"\n\nTobin thinks delegating authority is the key principle to success.\n\n\"Just leave people alone and, if you listen to them, some of your decisions are easy. You'll have problems if you try to make their decisions for them.\"\n\nThe Bears decided they could stop listening to Tobin in 1993. In two of the three years since, they haven't been to the playoffs."}, {"url": "https://www.sun-sentinel.com/news/fl-xpm-1994-03-25-9403241133-story.html", "page_content": "Four years ago quarterback Jeff George was living his dream.\n\nHometown boy comes back to Indianapolis, first pick in the NFL draft, to rescue the woebegone Colts from oblivion.\n\nThey’re still calling 911 after Indy finished fifth in the AFC East in 1993. But George won’t be offering any more help.\n\nHe was traded Thursday to the Atlanta Falcons for firstand third-round draft picks this year and a second-rounder in 1996.\n\nAfter four largely unproductive years and nearly $13 million in salary and bonuses, he was swept out by the Colts new vice president, Bill Tobin.\n\nIt was one of several significant player deals announced Thursday. More could be on the way next week, according to club officials and agents.\n\n— San Diego, up against the salary cap and unable to afford transition player wide receiver Anthony Miller, declined to match a four-year, $10.4 million offer from Denver and instead traded a fourth-round pick for Dolphins receiver Tony Martin.\n\n— San Francisco, its vulnerability at inside linebacker exposed in the NFC championship game by Dallas, signed unrestricted free agent Gary Plummer of the Chargers. The price tag: $1.8 million over two years.\n\n— Eric Hill, a five-year starter at inside linebacker for the Arizona Cardinals, agreed to terms with the club. As a designated transition player, Hill will make at least $2.5 million this season, six times the $410,000 he was paid for playing in 13 games last year.\n\nFrom the day Tobin joined the Colts in January, he made it no secret he wasn’t enamored with George, his 1993 holdout or his shaky relationship with fellow players.\n\n“All of his signs to us were that he wanted to be traded,” said Tobin. “We granted his wish.”\n\nThe deal gives the Colts the No. 2 and No. 7 picks in the draft, but Tobin wouldn’t say if he was going to select one of the top two college quarterbacks – Trent Dilfer of Fresno State or Heath Shuler of Tennessee.\n\nThe trade leaves two quarterbacks on the Colts roster – Don Majkowski and Jack Trudeau. It’s a good bet Tobin is not going into 1994 with either penciled in as his starter.\n\nHe is believed to be interested in Jim Harbaugh, whom he drafted in 1987 as vice president of the Chicago Bears.\n\nHarbaugh was released by Chicago for failing to produce a winner. The Bears replaced him with Erik Kramer, formerly of Detroit.\n\nGeorge was 14-25 as a starter with 41 touchdowns and 46 interceptions. Like another quarterback who was a No. 1 pick, Vinny Testaverde, he never matched his draft status.\n\nBut George rejected any comparisons with Testaverde. “I had success in Indianapolis,” he contended.\n\nIn Atlanta, he’ll be tutored personally by new head coach June Jones, who has raised the level of play of two other Falcons’ quarterbacks – Chris Miller and Bobby Hebert.\n\nFalcons Vice President Ken Herock said he had extensive discussions with former Colts front office employees to gather information about George’s emotional problems.\n\nHe pronounced himself satisfied and went on to say that Jones would make George into a Pro Bowl quarterback.\n\n“A lot of guys have talent but can never take it to another level. Jeff can,” said Jones.\n\nGeorge said he was greatly relieved to be leaving his hometown. “I think since I stepped foot in Indianapolis after the draft – I can’t put my finger on it – but I’ve never been accepted. Maybe the city got tired of hearing about Jeff George. Maybe I wore out my welcome. I did the best I could.”\n\nHe has two years left on his contract and the trade produces $1.5 million of additional cap money for the hamstrung Colts.\n\nThe big loser is Hebert, who won’t be recovered from elbow surgery until approximately June 1. He probably will be traded or released.\n\nMiller thrills Denver\n\nSan Diego had been expected all week to match for Miller, but was forced into a strictly financial decision because of the cap. “We thought we had only a 30 percent chance of getting him,” said Denver owner Pat Bowlen.\n\nHe was the Broncos’ second choice after the Raiders matched Denver’s offer for transition receiver Tim Brown.\n\n“John [Elway) is going to love having a deep threat,” said Bowlen. Miller is the fastest receiver in a Broncos uniform since the days of Rick Upchurch.\n\nScramble for Bono\n\nSan Francisco’s attention now turns to backup quarterback Steve Bono, who is coveted by several teams, including Kansas City, Washington and Minnesota.\n\nSources said the 49ers will offer Bono ($1.5 million in 1994) a restructured contract with guaranteed bonuses on the back end of the deal in order to keep him and make room on the cap.\n\nBut the Chiefs want him as a part-time starter with his good friend, Joe Montana, in an interesting new quarterbacking concept.\n\nIf Bono balks at a restructured deal, he’s probably gone. The 49ers can’t afford his paycheck.\n\nAccording to one source, Kansas City wants to design a schedule in which Montana takes off six to eight weeks, thereby lessening his chances of injury, and use Bono in the other starts.\n\n“I think this would be acceptable to Joe only if it’s Steve Bono. They are that close and it won’t be another Steve Young situation.”"}, {"url": "https://www.upi.com/Archives/1997/12/22/Infante-Tobin-fired-by-Colts/4204882766800/", "page_content": "INDIANAPOLIS, Dec. 22 -- In what could be a very busy period of coaches' firings, the Indianapolis Colts made the first move today (Monday) by announcing the expected firing of coach Lindy Infante. The Colts' league-worst 3-13 season, capped by Sunday's 39-28 loss to the Minnesota Vikings, also cost Bill Tobin his job as vice president and director of football operations.' 'We gave it a good run,' says Infante, 'but this season wasn't meant to be.' The Colts were able to split their last six games, including wins over Green Bay and Miami, but Infante's fate may have been sealed fate by the team's horrendous 0-10 start. In his two seasons, Infante had a record of 12-20. The 57-year-old Infante got off to a good start during his first season on the job in 1996, when the Colts began the season 4-0, ended at 9-7 and gained a wild-card berth. They were beaten by the Pittsburgh Steelers in the playoffs, 42-14. Infante also served as the Colts' offensive coordinator in 1995, and was head coach of the Green Bay Packers from 1988-91. At Green Bay, where he went 24-40, he was named the Coach of the Year after leading the Packers to a 10-6 mark in 1989. The 56 year-old Tobin has spent the last three seasons with Indianapolis. He was responsible for the signings of free agents like Jim Harbaugh, Tony Bennett, Jay Leeuwenburg and Cary Blanchard, and oversaw the selections of running back Marshall Faulk, tight end Ken Dilger and wide receiver Marvin Harrison in the draft.\n\nAdvertisement\n\nMost of them helped Indianapolis reach the AFC title game in 1995. 'I have no regrets other than I didn't get a chance to see this through,' Tobin said. Before coming to Indianapolis, Tobin spent the previous 18 seasons with the Chicago Bears and was a big part of the Bears' Super Bowl winning team in 1985."}]}