{"Bill Tobin was promoted to General Manager of the Phoenix Cardinals in 1989 and held that position until 1993.": [{"url": "https://wikimili.com/en/Bill_Tobin_(American_football)", "page_content": "Nathan D. Clements is a former American football cornerback in the National Football League (NFL). He played college football for Ohio State. He was drafted by the Buffalo Bills 21st overall in the 2001 NFL Draft, and also played for the San Francisco 49ers and Cincinnati Bengals.\n\nFrank Michael Reich III. is an American football coach and former quarterback who is the head coach for the Carolina Panthers of the National Football League (NFL). He played college football at Maryland and was selected by the Bills in the third round of the 1985 NFL Draft. Reich spent most of his career backing up Jim Kelly, although he achieved recognition when he led the Bills to the NFL's largest postseason comeback during the 1992–93 NFL playoffs.\n\nThe 1992 NFL season was the 73rd regular season of the National Football League (NFL). Due to the damage caused by Hurricane Andrew, the New England Patriots at Miami Dolphins game that was scheduled for September 6 at Joe Robbie Stadium was rescheduled to October 18. Both teams originally had that weekend off. This marked the first time since the 1966 NFL season and the AFL seasons of 1966 and 1967 that there were byes in week 1.\n\nMichael Allen Doss is an American former football safety who played in the National Football League (NFL) for six seasons. He played college football for Ohio State University, earned consensus All-American honors, and was a member of the 2002 national championship team. He was drafted in the second round of the 2003 NFL Draft by the Indianapolis Colts, with whom he played four seasons with, including during the team's 2006 Super Bowl season. Doss then spent one season with the Minnesota Vikings and Cincinnati Bengals each before retiring.\n\nVincent Michael Tobin is an American football coach and former college player who was the head coach of the Arizona Cardinals of the National Football League (NFL). During his four decades of coaching, he served as defensive coordinator for college, NFL, and Canadian Football League (CFL) teams.\n\nTheodore Joseph Marchibroda was an American football quarterback and head coach in the National Football League (NFL). He spent his four years as an active player with the Pittsburgh Steelers and Chicago Cardinals (1957). He was later head coach of the Colts in two different cities and decades, first in Baltimore during the 1970s and then Indianapolis during the 1990s. Upon joining the Baltimore Ravens in a similar capacity in 1996, he became the only individual to serve as head coach with both of Baltimore's NFL teams. His career coaching record was 87–98–1 (.470) and 2–4 in the playoffs.\n\nThe 1994 NFL draft was the procedure by which National Football League teams selected amateur college football players. It is officially known as the NFL Annual Player Selection Meeting. The draft was held April 24–25, 1994, at the Marriott Marquis in New York City, New York. The league also held a supplemental draft after the regular draft and before the regular season. This was the first draft in which the rounds were reduced to seven in total.\n\nTroy McHenry Walters is an American football coach and former player who is the wide receivers coach for the Cincinnati Bengals of the National Football League (NFL). Walters played as a wide receiver and punt returner in the National Football League (NFL) for eight seasons. Walters played college football for Stanford University, was a consensus All-American and was recognized as the most outstanding college wide receiver in the country by winning the Biletnikoff Award. He was selected in the fifth round of the 2000 NFL Draft by the Minnesota Vikings, and also played for the Indianapolis Colts, Arizona Cardinals and Detroit Lions of the NFL.\n\nPaul Donald Justin is a former American football quarterback primarily for the Indianapolis Colts of the National Football League (NFL). He was drafted by the Chicago Bears in the 7th round of the 1991 NFL Draft. He played college football for Arizona State. He had brief stints with the Cincinnati Bengals and St. Louis Rams. Prior to his time in the NFL, he was the starting quarterback for the Arizona Rattlers of the Arena Football League (AFL) and the Frankfurt Galaxy of the World League of American Football (WLAF).\n\nJohn William Standeford is a former American football wide receiver. He played college football at Purdue, and signed with the Washington Redskins as an undrafted free agent in 2004. He also played for the Indianapolis Colts, Detroit Lions, Florida Tuskers, Cincinnati Bengals, and Virginia Destroyers. As a member of the Colts, Standeford won Super Bowl XLI, defeating the Chicago Bears.\n\nJamaal Anderson is a former American football defensive end. He was drafted by the Atlanta Falcons eighth overall in the 2007 NFL Draft. He played college football at Arkansas.\n\nHard Knocks is a reality sports documentary television series produced by NFL Films and HBO. The show was first broadcast in 2001, and the current 2022 season is the 17th and 18th. Each season, it follows a National Football League (NFL) team through its training camp and covers the team's preparation for the upcoming football season. Starting with the 2021 season there will be an in season version of Hard Knocks following a different team than the training camp version.\n\nChase Allen Coffman is a former American football tight end. He played college football for the University of Missouri, earned consensus All-American honors, and was recognized as the best college tight end in the country. He was chosen by the Cincinnati Bengals in the third round of the 2009 NFL Draft.\n\nDaniel \"Boom\" Herron is a former American football running back. Herron played football at Warren G. Harding High School in Warren, Ohio, and later Ohio State University. He was drafted in the sixth round of the 2012 NFL draft by the Cincinnati Bengals, and also played for the Indianapolis Colts and Buffalo Bills.\n\nThe Indianapolis Colts are a professional American football team based in Indianapolis, Indiana. They play in the South Division of the American Football Conference (AFC) in the National Football League (NFL). The organization began play in 1953 as the Baltimore Colts with the team located in Baltimore, Maryland; it relocated to Indianapolis following the 1983 season.\n\nWalter Mendenhall is a former American football running back. He played college football at Illinois from 2005 to 2007 before transferring to Illinois State University where he played in 2008. He was signed by the Philadelphia Eagles as an undrafted free agent in 2009 and has also been a member of the Indianapolis Colts, Buffalo Bills and Cincinnati Bengals. He is the brother of former Arizona Cardinals running back Rashard Mendenhall.\n\nTaylor Jonathan Yates is a former American football quarterback and coach who is the wide receivers coach for the Atlanta Falcons of the National Football League (NFL). He played college football at North Carolina and was drafted by the Houston Texans in the fifth round of the 2011 NFL Draft. He has also played for the Atlanta Falcons, Miami Dolphins, and Buffalo Bills.\n\nDuke Tobin is the Director of Player Personnel for the Cincinnati Bengals of the National Football League (NFL). He played in the Arena Football League for the Orlando Predators in 1994 and Memphis Pharaohs in 1995. He played college football at Illinois & Colorado.\n\nMalik Hooker is an American football safety for the Dallas Cowboys of the National Football League (NFL). He played college football at Ohio State and was drafted by the Indianapolis Colts with the 15th overall pick in the 2017 NFL Draft. While at Ohio State, Hooker was named a unanimous All-American in 2016 and won the 2015 CFP national championship."}, {"url": "https://www.azcentral.com/story/sports/nfl/cardinals/2018/02/12/arizona-cardinals-general-manager-steve-keim-contract-extension/330084002/", "page_content": "The Cardinals announced they have signed General Manager Steve Keim to a contract extension that will keep him with the team through 2022.\n\nKeim’s extension comes a month after the team signed new head coach Steve Wilks to a four-year contract with a team option for a fifth year. Keim, who had one year remaining on his current deal, plus a team option for another season after that, is now under contract for essentially the same number of years as Wilks.\n\nThe Cardinals have gone 49-30-1 with two playoff appearances during Keim’s five seasons as GM. Only four of his NFL counterparts have won more regular-season games than Keim during that span – New England’s Bill Belichick, Seattle’s John Schneider, Pittsburgh’s Kevin Colbert and Denver’s John Elway.\n\n“Steve’s performance and accomplishments as Cardinals GM speak for themselves,” Cardinals President Michael Bidwill said in a statement. “His role in the team’s success over the last five seasons is undeniable. This new contract ensures that he will continue to shape our success going forward and we are thrilled about that.”\n\nKeim's track record with the Cardinals\n\nKeim was named the 2014 Sporting News NFL Executive of the Year and earned NFL Executive of the Year honors from Pro Football Talk in back-to-back seasons (2013-14).\n\nThe teams put together by Keim during his tenure as GM have been some of the most successful in franchise history. In 2014, the Cardinals tied the franchise record for wins in a season (11) before setting a new mark the following year in 2015 with 13 wins and its first-ever postseason bye.\n\nKeim joined the franchise as a college scout in 1999. In 2006, he was promoted to Director of College Scouting and two years later, was elevated to Director of Player Personnel. In 2013, he was promoted to General Manager when the team hired Bruce Arians as head coach.\n\nThis is Keim’s second contract extension since becoming GM, as he also signed a four-year extension with a team option back on Feb. 23, 2015.\n\nAfter the Cardinals dropped to 6-8 this past season, thus assuring themselves of a non-winning season, Keim apologized to fans and promised things will be different in 2018.\n\n“I apologize to our fans and everybody in our organization,” Keim said during his weekly radio appearance on Arizona Sports 98.7 FM. “Moving forward, we have a lot of work to do. It’s going to be a busy offseason. … I promise the product on the field in 2018 will finish much stronger.”\n\nCardinals still need a quarterback\n\nOne of Keim's biggest tasks remains identifying and acquiring a new starting quarterback for the team. The Cardinals have no quarterbacks on their roster signed for next season.\n\nKeim has missed on some draft picks, but he also engineered trades that brought Palmer and outside linebacker Chandler Jones to Arizona and has been successful at addressing weaknesses during a season.\n\nThe team spent millions on upgrades to its training facility and University of Phoenix Stadium, and at Keim’s urging five years ago, Bidwill agreed to substantially expand the team’s pro scouting department.\n\n“Five years ago we started with no head coach and no quarterback,” Keim said last month, “and I feel like that ended up pretty good. I think that’s the way we need to approach this this time around.”\n\nRoster move\n\nThe Cardinals on Monday signed free agent cornerback Lou Young to a one-year contract. Young, 6-1, 205, played in six games for the Panthers in 2016 after entering the NFL with the Broncos in 2014 as an undrafted rookie out of Georgia Tech.\n\nHe spent his rookie season on the practice squads of the Broncos, Ravens, Jaguars and Panthers before splitting the 2015 season between Carolina’s active roster and the practice squad. He spent the 2017 preseason with the Redskins until being released on Aug. 3.\n\nYoung, 26, played in 49 games while at Georgia Tech, finishing his career with 134 tackles, four interceptions, 12 passes defensed, one forced fumble and one fumble recovery.\n\nCARDINALS NEWS:Bickley: Cardinals' broken offense in good hands with Mike McCoy\n\nCARDINALS 2018 SCHEDULE:Broncos, Raiders, Bears at home; Packers, Vikings on road"}, {"url": "https://www.mlb.com/cardinals/team/front-office/michael-girsch", "page_content": "Vice President & General Manager\n\nMichael Girsch was promoted to Vice President and General Manager on June 30, 2017, becoming the 13th General Manager in franchise history. His contract as General Manager runs through the 2025 season, and he is responsible for handling the day-to-day work of the team, including coordinating the efforts of the team’s baseball development group, contract negotiations, player evaluations and player transactions.\n\nPrior to his appointment as GM, Girsch served as Assistant General Manager for seven seasons after being appointed to that position in January 2011.\n\nFrom 2008-11, he served as the Director of Baseball Development, a newly created department focused on supporting Baseball Operations via internet applications, analytical models and decision support tools. Girsch joined the Cardinals in 2006, starting his career with a two year stint as the Coordinator of Amateur Scouting.\n\nBefore joining the Cardinals, Girsch, earned a Bachelor of Science in Mathematics from the University of Notre Dame and an MBA from the University of Chicago Booth School of Business.\n\nHe and his wife, Kelly, reside in Webster Groves with their four children, twins Addison and Eleanor, Claire and Tommy."}, {"url": "https://prabook.com/web/bill.tobin/2469423", "page_content": "Bill Tobin\n\ngridiron football player\n\nFebruary 16, 1941\n\nHe would later become the general manager of the Chicago Bears and Indianapolis Colts. He also was director of player personnel for the Detroit Lions in 2001. During his time with the Indianapolis Colts he drafted Hall of Famer Marshall Faulk and future Hall of Famer Marvin Harrison. He also drafted Ken Dilger, Tarik Glenn and Adam Meadows, who would be cornerstones of the Colts offensive line. He drafted Ray Buchanan and Ashley Ambrose who came to be tremendous players in the league and eventually started for the Falcons in the Super Bowl. lieutenant could be argued that Bill Tobin laid the foundation for the Peyton Manning era because of quality players he drafted. Tobin was replaced as Colts general manager in 1997 by Bill Polian. Tobin is the brother of former NFL coach Vince Tobin. Tobin is currently working as a scout for the Cincinnati Bengals. While general manager of the Indianapolis Colts, Tobin gained some notoriety during the television broadcast of the 1994 NFL Draft after being criticized by Entertainment and Sports Programming Network analyst Mel Kiper for picking Nebraska linebacker Trev Alberts with the fifth pick in the draft, instead of Fresno State quarterback Trent Dilfer. While being interviewed by Entertainment and Sports Programming Network later in the broadcast, Tobin famously said \"Who the hell is Mel Kiper?!\" Tobin later called a press conference where he ranted about Kiper for several minutes, stating that Kiper had been biased against the Colts ever since they moved from Baltimore, Kiper\"s home."}, {"url": "https://www.chicagotribune.com/news/ct-xpm-1994-01-08-9401080108-story.html", "page_content": "Bill Tobin joined the Indianapolis Colts as vice president and director of football operations Friday in a surprise move that changes the role of General Manager Jim Irsay.\n\nTobin, former vice president of player personnel with the Bears, was hired by Colts owner Robert Irsay, who told his son and Tobin, \"Go run the club.\"\n\nAdvertisement\n\n\"I am what it says,\" Tobin said. \"I'm responsible for coaches, players, the draft, trainers, equipment guys. I will consult and work closely with Jim and get the approval of Mr. Irsay. He wants my football experience and success.\"\n\nSo will Tobin trade quarterback Jeff George to the Bears for Jim Harbaugh?\n\nAdvertisement\n\n\"What else are the Bears going to throw in?\" Tobin asked with a laugh.\n\nTobin was never an avid backer of George, first player selected in the 1990 draft, so George's future in Indianapolis is in question. George skipped most of training camp in a dispute he never publicly clarified. He was said to be fed up with what he perceived as unfair criticism in his hometown.\n\nTobin said he was going to review personnel with coach Ted Marchibroda before he talks about anyone, including George.\n\nSince the Colts finished 28th in the league in defense, Tobin's brother Vince could soon rekindle the family reunion they had with the Bears from 1986-92, when the Bears' defense finished 1st, 2nd, 2nd, 25th, 6th, 4th and 17th.\n\n\"We've got some changes to make,\" Bill Tobin admitted when asked about Vince.\n\nThe Colts' defensive coordinator is former Northwestern coach Rick Venturi.\n\nThe Tobin hiring was one of two shakeups in the NFL Friday. The New York Jets fired coach Bruce Coslet and promoted defensive coordinator Pete Carroll after Coslet refused to hire an offensive coordinator. Coslet spent four years without a winning season. After making the playoffs in 1991 as an 8-8 wild card, the Jets suffered through 4-12 and 8-8 seasons.\n\nTobin praised former Bears General Manager Jim Finks as his role model in structuring a team. He compared his situation in Indianapolis to the 1974 hiring of Finks by the Bears, who were a father-son operation. In that case, however, Finks was hired by son Mugs Halas, not father George. Mugs gave up his authority.\n\nAdvertisement\n\nJim Irsay will keep his title as vice president and general manager. Tobin said Jim Irsay, assistant GM Bob Terpenning and general counsel Michael Chernoff would remain responsible for signing players and fitting them under the salary cap.\n\nThe Colts had the third-highest payroll in the league last season, according to NFL Players Association figures. At $40.2 million, they are more than $6 million over next year's projected cap of $34 million.\n\n\"I'm here to tell them who to spend the money on,\" Tobin said. \"That's my area of expertise.\"\n\nSince the Colts finished fifth in the AFC East, they will avoid a game against the Bears next season and play a fifth-place schedule instead. The Colts have the second pick in the April 24 draft. The Bears never picked that high during Tobin's 18 years in Chicago."}, {"url": "https://www.espn.com/nfl/story/_/id/35254121/cardinals-gm-steve-keim-taking-health-related-leave-absence", "page_content": "Arizona Cardinals general manager Steve Keim is taking a leave of absence for health-related reasons, the team announced Wednesday.\n\nVice president of player personnel Quentin Harris and vice president of pro personnel Adrian Wilson will handle Keim's duties on an interim basis.\n\nThe team said it will have no further comment \"out of respect for privacy -- which is required by law.\"\n\nKeim, 50, has been the Cardinals' general manager since 2013 and signed an extension with the team in March that runs through the 2027 season.\n\nIn 2018, he was suspended for five weeks and fined $200,000 by the team after pleading guilty to extreme DUI.\n\nKeim joined the Cardinals in 1999 as a college scout and was promoted to general manager in 2013. He's received three extensions since: February 2015, February 2018 and the one in March.\n\nHis leave of absence is the latest event in a chaotic 2022 for the Cardinals.\n\nIt started with an offseason focused on quarterback Kyler Murray: from the scrubbing of Cardinals content on his Instagram account; to an open letter his agent, Erik Burkhardt, released explaining that he sent a detailed contract proposal to the Cardinals; to Murray finally receiving a mega extension; to the revelation that an independent study clause had been included in that deal requiring him to study four extra hours a week on his own; to the removal of the clause four days after it was publicized.\n\nIn May, star receiver DeAndre Hopkins was suspended six games for violating the NFL's performance-enhancing drug policy.\n\nIn August, the Cardinals suspended then running backs coach James Saxon after a May incident in which he was charged with domestic assault came to light.\n\nIn November, Arizona fired offensive line coach Sean Kugler for allegedly inappropriately touching a woman in Mexico City.\n\nAll that, coupled with injuries to four of the Cardinals' five starting offensive linemen, a season-ending injury to tight end Zach Ertz and injuries to wide receiver Rondale Moore, Marquise Brown and James Conner have contributed to a roller-coaster type of season in Arizona.\n\nThe Cardinals are currently 4-9 after Monday night's 27-13 loss to the New England Patriots. In that game, Murray suffered a season-ending torn ACL.\n\nInformation from ESPN's Josh Weinfuss was used in this report."}, {"url": "https://www.wikizero.com/m/Vince_Tobin", "page_content": "American gridiron football player and coach (born 1943)\n\nAmerican football player\n\nVincent Michael Tobin (born September 29, 1943) is an American football coach and former college player who was the head coach of the Arizona Cardinals of the National Football League (NFL). During his four decades of coaching, he served as defensive coordinator for college, NFL, and Canadian Football League (CFL) teams.\n\nEarly life [ edit ]\n\nVincent and his brother Bill Tobin both were born on a farm near Burlington Junction, Missouri. Their father Ed Tobin was basketball captain at the Conception Junction, Missouri high school. The brothers both attended Maryville High School which is 16 miles from Burlington Junction but the family thought their sports prospects would be much better in the much bigger school and they commuted each day to the school.[1] The brothers who are two years apart in age played on the football teams at the same time both in Maryville and at the University of Missouri football team.\n\nCollege coaching career [ edit ]\n\nTobin was a defensive back at the University of Missouri and entered the coaching ranks as a graduate assistant with the team in 1965. He was Missouri's defensive coordinator from 1971 to 1976.\n\nPre-NFL coaching [ edit ]\n\nHe was the defensive coordinator for the BC Lions of the CFL and for the Philadelphia / Baltimore Stars of the USFL.\n\nNFL coaching [ edit ]\n\nChicago Bears [ edit ]\n\nHis first coaching job in the National Football League was as the defensive coordinator for the Chicago Bears in 1986, one year following their legendary 1985 Super Bowl winning season. Tobin filled the role left by legendary defensive coordinator Buddy Ryan, who had left the team to become the head coach of the Philadelphia Eagles. While the Bears' defensive unit ranked among the league's highest during his tenure, they never achieved the same dominance as they did in 1985, the team's only playoff wins coming over Ryan's Eagles in 1988's Fog Bowl and in 1991 against New Orleans. Following the 1992 firing of head coach Mike Ditka, Tobin was released with the rest of the Bears coaching staff.\n\nIndianapolis Colts [ edit ]\n\nTobin was hired in 1994 to be the defensive coordinator of the Indianapolis Colts by his brother Bill Tobin, the team's acting general manager. He left the team following the 1995 season.\n\nArizona Cardinals [ edit ]\n\nHe was the head coach of the Cardinals in 1996 and succeeded Buddy Ryan again. His one winning season and playoff berth as a head coach came in 1998 where the club posted a 9-7 record. He then coached the Cardinals to their first playoff win in 50 years during the 1998 season by defeating the 3rd-seeded Dallas Cowboys. The team lost the next week to the 1st-seeded Minnesota Vikings. After 7 games of the 2000 season, Tobin was fired after posting a 2–5 record. His record in Arizona was 28–43, with a 1–1 postseason record.\n\nDetroit Lions [ edit ]\n\nIn 2001 Tobin was hired as the defensive coordinator for the Detroit Lions, where the club posted a 2–14 record. He was fired after 1 season.\n\nHead coaching record [ edit ]\n\nTeam Year Regular Season Post Season Won Lost Ties Win % Finish Won Lost Win % Result ARI 1996 7 9 0 .438 4th in NFC East - - - ARI 1997 4 12 0 .250 5th in NFC East - - - ARI 1998 9 7 0 .563 2nd in NFC East 1 1 .500 Won Wild Card Round vs. DAL, Lost Divisional Round vs. MIN ARI 1999 6 10 0 .375 4th in NFC East - - - - ARI 2000 2 5 0 .286 5th in NFC East - - - (fired) ARI Total 28 43 0 .394 1 1 Total 28 43 0 .394 1 1\n\nPersonal life [ edit ]\n\nVince Tobin's brother is Bill Tobin. Bill was the general manager of the Chicago Bears and the Indianapolis Colts. Vince served as Colts defensive coordinator while Bill was general manager."}, {"url": "https://www.wikizero.com/www//Bill_Tobin_(American_football)", "page_content": "American football player and executive (born 1941)\n\nAmerican football player\n\nBill Tobin (born February 16, 1941) is a former professional American football player who is currently a personnel executive for the Cincinnati Bengals of the National Football League (NFL). Tobin played running back for one season for the Houston Oilers. He would later become the general manager of the Chicago Bears and Indianapolis Colts along with the director of player personnel for the Detroit Lions in 2001.\n\nEarly life and education [ edit ]\n\nBill and his brother Vince Tobin both were born on a farm near Burlington Junction, Missouri. Their father Ed Tobin was a basketball captain at the Conception Junction, Missouri high school. The brothers both attended Maryville High School which is 16 miles from Burlington Junction but the family thought their sports prospects would be much better in the much bigger school (they commuted to the school).[1] The brothers who are two years apart in age played on the football teams at the same time both in Maryville and at the University of Missouri football team. Bill played on the 1959 Maryville basketball team that was undefeated until losing the State Class M title game.[2]\n\nTobin attended the University of Missouri, where he played in the Tigers′ backfield next to quarterback Jim Johnson.\n\nCareer [ edit ]\n\nDuring his time with the Indianapolis Colts, he drafted future Hall of Famers Marshall Faulk and Marvin Harrison. He also drafted Ken Dilger, Tarik Glenn, and Adam Meadows, who would be cornerstones of the Colts offensive line. He also built a team in Indianapolis with Jim Harbaugh, who in 1995 led the NFL in passing and had a very successful run in the 1995 NFL playoffs, including the first playoff win for the Colts since Super Bowl V, a span of thirty years. He drafted Ray Buchanan and Ashley Ambrose, who later started for the Falcons in the Super Bowl.\n\nTobin was replaced as Colts general manager in 1997 by Bill Polian. Tobin is the brother of former NFL coach Vince Tobin.\n\nTobin was recently working as a scout for the Cincinnati Bengals.\n\nMel Kiper incident [ edit ]\n\nWhile general manager of the Indianapolis Colts, Tobin gained some notoriety during the television broadcast of the 1994 NFL Draft after being criticized by ESPN analyst Mel Kiper Jr. for picking Nebraska linebacker Trev Alberts with the fifth pick in the draft, instead of Fresno State quarterback Trent Dilfer.\n\nWhile being interviewed by ESPN later in the broadcast, Tobin famously said \"Who in the hell is Mel Kiper anyway?!\"[3] Tobin later called a press conference where he ranted about Kiper for several minutes, stating that Kiper had been biased against the Colts ever since they moved from Baltimore, Kiper's home.[4]"}, {"url": "https://www.wikiwand.com/en/Bill_Tobin_(American_football)", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about Bill Tobin (American football)?\n\nSummarize this article for a 10 years old"}, {"url": "https://www.baseball-reference.com/players/t/tobinbi01.shtml", "page_content": "Frequently Asked Questions\n\nWhen was Bill Tobin born?\n\nBill Tobin was born on October 10, 1854.\n\nWhere was Bill Tobin born?\n\nBill Tobin was born in Hartford, CT.\n\nHow many seasons did Bill Tobin play?\n\nBill Tobin played 1 season.\n\nIs Bill Tobin in the Hall of Fame?\n\nBill Tobin has not been elected into the Hall of Fame.\n\nWhat position did Bill Tobin play?\n\nBill Tobin was a First Baseman.\n\nHow many hits did Bill Tobin have?\n\nBill Tobin had 24 hits over his career.\n\nHow many home runs did Bill Tobin have?\n\nBill Tobin had home runs over his career.\n\nWhat was Bill Tobin's average?\n\nBill Tobin had a .158 average over his career.\n\nHow many teams has Bill Tobin played for?\n\nBill Tobin played for 2 teams; the Troy Trojans and Worcester Ruby Legs.\n\nWhen did Bill Tobin retire?\n\nBill Tobin last played in 1880."}]}