{"Bill Tobin was promoted to Director of Player Personnel in 1979 and held that position until 1987.": [{"url": "https://www.upi.com/Archives/1983/12/19/Bill-Tobin-director-of-the-Chicago-Bears-pro-scouting/9755440658000/", "page_content": "LAKE FOREST, Ill. -- Bill Tobin, director of the Chicago Bears' pro scouting since 1975, Monday was named the club's director of player personnel by team President Michael McCaskey.\n\nThe selection of Tobin, 42, completes the organizational structure McCaskey began when he took over as the head of the team founded by his grandfather, George Halas.\n\nAdvertisement\n\nTobin will report directly to McCaskey and will be on an equal organizational level with General Manager Jerry Vainisi and Coach Mike Ditka.\n\nTobin said his first responsibility would be to hire two additional scouts in preparation for the upcoming collegiate draft. However, Tobin said he wasn't critical of previous Bears' drafts.\n\n'I think we have had good drafts in the past but I can see ways we can have better drafts,' said Tobin, a star running back for the University of Missouri from 1959 to 1962. 'I plan to work very closely with Mike Ditka, Jerry Vainisi and Michael McCaskey.'\n\nTobin, who began his pro career with Houston in 1963 before going to the Canadian League, said he had turned down four offers from the USFL for 'jobs with more elaborate titles' than the one he has now with the Bears.\n\nAdvertisement\n\n'But I wanted to be in the NFL with the Chicago Bears,' Tobin said.\n\nTobin added he anticipated the Bears would have to scout USFL games this spring for talent, adding he doesn't foresee a promising future for the rival league.\n\n'I think the NFL is doing a more aggressive selling job,' said Tobin, a native of Burlington Junction, Mo. 'I think there are some players who signed early that regret their decision ... I think we will look at the USFL games for the way they are going. They may not be around in a year or two.'\n\nMcCaskey said selecting a player personnel director was not modeled after any other team's organizational chart although he conceded it might be construed to be along the lines of the Dallas Cowboys.\n\n'I will make the final decision regarding draft choices and trades,' McCaskey added.\n\nDitka said his top priority for the upcoming draft would be defense, specifically defensive linemen.\n\n'We will want to get the best player available,' Ditka said. 'We didn't know this year that Dan (Hampton) would go down with injuries. I'd also like to see us look at a linebacker.'\n\nTobin said he didn't anticipate any disagreements with Ditka about whom to select in the draft, adding that McCaskey would have the ultimate say.\n\nAdvertisement\n\nTobin came to the Bears from the Green Bay Packers, where he was pro scouting director since 1972.\n\nIn a related matter, McCaskey said the club would evaluate moving to a new practice field away from Lake Forest, where the club experienced difficulty getting practice time because of inclement weather this past season.\n\nHe said he had visited facilities in Green Bay and Minnesota and estimated it would cost at least $500,000 to build an indoor facility to allow the team to practice during bad weather."}, {"url": "https://wikimili.com/en/Bill_Tobin_(American_football)", "page_content": "Nathan D. Clements is a former American football cornerback in the National Football League (NFL). He played college football for Ohio State. He was drafted by the Buffalo Bills 21st overall in the 2001 NFL Draft, and also played for the San Francisco 49ers and Cincinnati Bengals.\n\nFrank Michael Reich III. is an American football coach and former quarterback who is the head coach for the Carolina Panthers of the National Football League (NFL). He played college football at Maryland and was selected by the Bills in the third round of the 1985 NFL Draft. Reich spent most of his career backing up Jim Kelly, although he achieved recognition when he led the Bills to the NFL's largest postseason comeback during the 1992–93 NFL playoffs.\n\nThe 1992 NFL season was the 73rd regular season of the National Football League (NFL). Due to the damage caused by Hurricane Andrew, the New England Patriots at Miami Dolphins game that was scheduled for September 6 at Joe Robbie Stadium was rescheduled to October 18. Both teams originally had that weekend off. This marked the first time since the 1966 NFL season and the AFL seasons of 1966 and 1967 that there were byes in week 1.\n\nMichael Allen Doss is an American former football safety who played in the National Football League (NFL) for six seasons. He played college football for Ohio State University, earned consensus All-American honors, and was a member of the 2002 national championship team. He was drafted in the second round of the 2003 NFL Draft by the Indianapolis Colts, with whom he played four seasons with, including during the team's 2006 Super Bowl season. Doss then spent one season with the Minnesota Vikings and Cincinnati Bengals each before retiring.\n\nVincent Michael Tobin is an American football coach and former college player who was the head coach of the Arizona Cardinals of the National Football League (NFL). During his four decades of coaching, he served as defensive coordinator for college, NFL, and Canadian Football League (CFL) teams.\n\nTheodore Joseph Marchibroda was an American football quarterback and head coach in the National Football League (NFL). He spent his four years as an active player with the Pittsburgh Steelers and Chicago Cardinals (1957). He was later head coach of the Colts in two different cities and decades, first in Baltimore during the 1970s and then Indianapolis during the 1990s. Upon joining the Baltimore Ravens in a similar capacity in 1996, he became the only individual to serve as head coach with both of Baltimore's NFL teams. His career coaching record was 87–98–1 (.470) and 2–4 in the playoffs.\n\nThe 1994 NFL draft was the procedure by which National Football League teams selected amateur college football players. It is officially known as the NFL Annual Player Selection Meeting. The draft was held April 24–25, 1994, at the Marriott Marquis in New York City, New York. The league also held a supplemental draft after the regular draft and before the regular season. This was the first draft in which the rounds were reduced to seven in total.\n\nTroy McHenry Walters is an American football coach and former player who is the wide receivers coach for the Cincinnati Bengals of the National Football League (NFL). Walters played as a wide receiver and punt returner in the National Football League (NFL) for eight seasons. Walters played college football for Stanford University, was a consensus All-American and was recognized as the most outstanding college wide receiver in the country by winning the Biletnikoff Award. He was selected in the fifth round of the 2000 NFL Draft by the Minnesota Vikings, and also played for the Indianapolis Colts, Arizona Cardinals and Detroit Lions of the NFL.\n\nPaul Donald Justin is a former American football quarterback primarily for the Indianapolis Colts of the National Football League (NFL). He was drafted by the Chicago Bears in the 7th round of the 1991 NFL Draft. He played college football for Arizona State. He had brief stints with the Cincinnati Bengals and St. Louis Rams. Prior to his time in the NFL, he was the starting quarterback for the Arizona Rattlers of the Arena Football League (AFL) and the Frankfurt Galaxy of the World League of American Football (WLAF).\n\nJohn William Standeford is a former American football wide receiver. He played college football at Purdue, and signed with the Washington Redskins as an undrafted free agent in 2004. He also played for the Indianapolis Colts, Detroit Lions, Florida Tuskers, Cincinnati Bengals, and Virginia Destroyers. As a member of the Colts, Standeford won Super Bowl XLI, defeating the Chicago Bears.\n\nJamaal Anderson is a former American football defensive end. He was drafted by the Atlanta Falcons eighth overall in the 2007 NFL Draft. He played college football at Arkansas.\n\nHard Knocks is a reality sports documentary television series produced by NFL Films and HBO. The show was first broadcast in 2001, and the current 2022 season is the 17th and 18th. Each season, it follows a National Football League (NFL) team through its training camp and covers the team's preparation for the upcoming football season. Starting with the 2021 season there will be an in season version of Hard Knocks following a different team than the training camp version.\n\nChase Allen Coffman is a former American football tight end. He played college football for the University of Missouri, earned consensus All-American honors, and was recognized as the best college tight end in the country. He was chosen by the Cincinnati Bengals in the third round of the 2009 NFL Draft.\n\nDaniel \"Boom\" Herron is a former American football running back. Herron played football at Warren G. Harding High School in Warren, Ohio, and later Ohio State University. He was drafted in the sixth round of the 2012 NFL draft by the Cincinnati Bengals, and also played for the Indianapolis Colts and Buffalo Bills.\n\nThe Indianapolis Colts are a professional American football team based in Indianapolis, Indiana. They play in the South Division of the American Football Conference (AFC) in the National Football League (NFL). The organization began play in 1953 as the Baltimore Colts with the team located in Baltimore, Maryland; it relocated to Indianapolis following the 1983 season.\n\nWalter Mendenhall is a former American football running back. He played college football at Illinois from 2005 to 2007 before transferring to Illinois State University where he played in 2008. He was signed by the Philadelphia Eagles as an undrafted free agent in 2009 and has also been a member of the Indianapolis Colts, Buffalo Bills and Cincinnati Bengals. He is the brother of former Arizona Cardinals running back Rashard Mendenhall.\n\nTaylor Jonathan Yates is a former American football quarterback and coach who is the wide receivers coach for the Atlanta Falcons of the National Football League (NFL). He played college football at North Carolina and was drafted by the Houston Texans in the fifth round of the 2011 NFL Draft. He has also played for the Atlanta Falcons, Miami Dolphins, and Buffalo Bills.\n\nDuke Tobin is the Director of Player Personnel for the Cincinnati Bengals of the National Football League (NFL). He played in the Arena Football League for the Orlando Predators in 1994 and Memphis Pharaohs in 1995. He played college football at Illinois & Colorado.\n\nMalik Hooker is an American football safety for the Dallas Cowboys of the National Football League (NFL). He played college football at Ohio State and was drafted by the Indianapolis Colts with the 15th overall pick in the 2017 NFL Draft. While at Ohio State, Hooker was named a unanimous All-American in 2016 and won the 2015 CFP national championship."}, {"url": "https://www.wikiwand.com/en/Bill_Tobin_(American_football)", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about Bill Tobin (American football)?\n\nSummarize this article for a 10 years old"}, {"url": "https://wiki2.org/en/Bill_Tobin_(American_football)", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nAmerican football player and executive (born 1941)\n\nAmerican football player\n\nBill Tobin (born February 16, 1941) is a former professional American football player who is currently a personnel executive for the Cincinnati Bengals of the National Football League (NFL). Tobin played running back for one season for the Houston Oilers. He would later become the general manager of the Chicago Bears and Indianapolis Colts along with the director of player personnel for the Detroit Lions in 2001.\n\nYouTube Encyclopedic\n\n1 / 3 Views: 2 909 935 139 375 275 401\n\nMel Kiper And The Crazy Feud That Changed the TV Draft Forever | NFL 1994 Draft Story\n\nBill Tobin vs Mel Kiper - 1994 Part 2\n\nFrank Caliendo impersonates Mel Kiper Jr. in NFL draft parody (2013) | ESPN Archive Transcription\n\nEarly life and education\n\nBill and his brother Vince Tobin both were born on a farm near Burlington Junction, Missouri. Their father Ed Tobin was a basketball captain at the Conception Junction, Missouri high school. The brothers both attended Maryville High School which is 16 miles from Burlington Junction but the family thought their sports prospects would be much better in the much bigger school (they commuted to the school).[1] The brothers who are two years apart in age played on the football teams at the same time both in Maryville and at the University of Missouri football team. Bill played on the 1959 Maryville basketball team that was undefeated until losing the State Class M title game.[2]\n\nTobin attended the University of Missouri, where he played in the Tigers′ backfield next to quarterback Jim Johnson.\n\nCareer\n\nDuring his time with the Indianapolis Colts, he drafted future Hall of Famers Marshall Faulk and Marvin Harrison. He also drafted Ken Dilger, Tarik Glenn, and Adam Meadows, who would be cornerstones of the Colts offensive line. He also built a team in Indianapolis with Jim Harbaugh, who in 1995 led the NFL in passing and had a very successful run in the 1995 NFL playoffs, including the first playoff win for the Colts since Super Bowl V, a span of thirty years. He drafted Ray Buchanan and Ashley Ambrose, who later started for the Falcons in the Super Bowl.\n\nTobin was replaced as Colts general manager in 1997 by Bill Polian. Tobin is the brother of former NFL coach Vince Tobin.\n\nTobin was recently working as a scout for the Cincinnati Bengals.\n\nMel Kiper incident\n\nWhile general manager of the Indianapolis Colts, Tobin gained some notoriety during the television broadcast of the 1994 NFL Draft after being criticized by ESPN analyst Mel Kiper Jr. for picking Nebraska linebacker Trev Alberts with the fifth pick in the draft, instead of Fresno State quarterback Trent Dilfer.\n\nWhile being interviewed by ESPN later in the broadcast, Tobin famously said \"Who in the hell is Mel Kiper anyway?!\"[3] Tobin later called a press conference where he ranted about Kiper for several minutes, stating that Kiper had been biased against the Colts ever since they moved from Baltimore, Kiper's home.[4]\n\nReferences"}, {"url": "https://alchetron.com/Bill-Tobin-(American-football)", "page_content": "Bill Tobin (born February 16, 1941) is a former professional American football player who played running back for one season for the Houston Oilers. He would later become the general manager of the Chicago Bears and Indianapolis Colts. He also was director of player personnel for the Detroit Lions in 2001.\n\nTobin attended the University of Missouri, where he played in the Tigers′ backfield next to quarterback Jim Johnson.\n\nDuring his time with the Indianapolis Colts he drafted Hall of Famer Marshall Faulk and future Hall of Famer Marvin Harrison. He also drafted Ken Dilger, Tarik Glenn, and Adam Meadows, who would be cornerstones of the Colts offensive line. He also built a team in Indianapolis with Jim Harbaugh, who in 1995 led the NFL in passing and had a very successful run in the 1995 NFL playoffs, including the first playoff win for the Colts since Super Bowl V, a span of thirty years. He drafted Ray Buchanan and Ashley Ambrose, who later started for the Falcons in the Super Bowl.\n\nTobin was replaced as Colts general manager in 1997 by Bill Polian. Tobin is the brother of former NFL coach Vince Tobin.\n\nTobin was recently working as a scout for the Cincinnati Bengals."}, {"url": "https://www.liquisearch.com/bill_tobin_american_football", "page_content": "Bill Tobin (American Football)\n\nBill Tobin (born February 16, 1941) is a former professional American football player who played running back for one season for the Houston Oilers. He would later become the general manager of the Chicago Bears and Indianapolis Colts. He also was director of player personnel for the Detroit Lions in 2001.\n\nTobin attended the University of Missouri, where he played in the Tigers′ backfield next to quarterback Jim Johnson.\n\nDuring his time with the Indianapolis Colts he drafted Hall of Famer Marshall Faulk and future Hall of Famer Marvin Harrison. He also drafted Ken Dilger, Tarik Glenn and Adam Meadows, who would be cornerstones of the Colts offensive line. He also built a team in Indianapolis with Jim Harbaugh, who in 1995 led the NFL in passing and had a very successful run in the 1995 NFL playoffs, including the first playoff win for the Colts since Super Bowl V, a span of thirty years. He drafted Ray Buchanan and Ashley Ambrose who came to be tremendous players in the league and eventually started for the Falcons in the Super Bowl. It could be argued that Bill Tobin laid the foundation for the Peyton Manning era because of quality players he drafted.\n\nTobin was replaced as Colts general manager in 1997 by Bill Polian. Tobin is the brother of former NFL coach Vince Tobin."}, {"url": "https://mutigers.com/honors/hall-of-fame/bill-tobin/91/kiosk", "page_content": "Thanks for visiting !\n\nThe use of software that blocks ads hinders our ability to serve you the content you came here to enjoy.\n\nWe ask that you consider turning off your ad blocker so we can deliver you the best experience possible while you are here.\n\nThank you for your support!"}, {"url": "https://mutigers.com/honors/hall-of-fame/bill-tobin/91", "page_content": "Thanks for visiting !\n\nThe use of software that blocks ads hinders our ability to serve you the content you came here to enjoy.\n\nWe ask that you consider turning off your ad blocker so we can deliver you the best experience possible while you are here.\n\nThank you for your support!"}, {"url": "https://apnews.com/6301dbe0378d6bf9747c2537637929bf", "page_content": "CINCINNATI (AP) _ The Cincinnati Bengals hired longtime NFL player personnel executive Bill Tobin as a scouting consultant, a sign that new coach Marvin Lewis will get some help in evaluating talent.\n\n``This gives us an experienced person at a critical point in our scouting process,″ Lewis said Monday.\n\nBengals owner Mike Brown has been criticized for having one of the NFL’s smallest scouting staffs, forcing his coaches to assume much of the duty for scouting college players.\n\nTobin joins John Cooper, former Ohio State coach, as a scouting consultant. He will attend workouts this spring of top-rated prospects and will also travel in the fall.\n\n``He has exceptional NFL experience and has put together championship teams,″ Brown said.\n\nTobin has served as a player personnel executive for the Chicago Bears, Indianapolis Colts and Detroit Lions. He was involved in drafting running backs Walter Payton and Marshall Faulk, wide receiver Marvin Harrison, tight end Ken Dilger and quarterbacks Jim Harbaugh and Joey Harrington.\n\nTobin is the father of Duke Tobin, the Bengals’ director of player personnel."}, {"url": "https://museum.phideltatheta.org/famous/bill-tobin/", "page_content": "Bill Tobin is a former professional American football player who played running back for one season for the Houston Oilers. He would later become the general manager of the Chicago Bears and Indianapolis Colts. Tobin also was director of player personnel for the Detroit Lions in 2001.\n\nTobin attended the University of Missouri, where he played in the Tiger backfield next to quarterback Jim Johnson.\n\nDuring his time with the Indianapolis Colts, Tobin drafted Hall of Famer Marshall Faulk and future Hall of Famer Marvin Harrison. He also drafted Ken Dilger, Tarik Glenn, and Adam Meadows, who would be cornerstones of the Colts offensive line. He also built a team in Indianapolis with Jim Harbaugh, who in 1995 led the NFL in passing and had a very successful run in the 1995 NFL playoffs, including the first playoff win for the Colts since Super Bowl V, a span of thirty years. He drafted Ray Buchanan and Ashley Ambrose who later started for the Falcons in the Super Bowl."}]}