{"Bill Tobin has been credited with helping to build the Bears and Colts teams that won Super Bowls.": [{"url": "https://www.sportsmockery.com/chicago-bears/son-of-former-chicago-bears-exec-has-brilliant-way-to-draft-qbs/", "page_content": "Here’s an interesting question for Chicago Bears fans. Does anybody remember the name Bill Tobin? If not, here’s a refresher. He was a scout and eventual personnel director for the franchise from the 1970s through to the early 1990s. He was essentially the right-hand man of late GM Jim Finks and had a major influence in building the great Bears team that won the Super Bowl in 1985. Eventually, he took over GM duties in 1987 and helped to keep the team competitive through 1991 before finally departing in 1993.\n\n\n\n\n\nOne thing about Tobin that is so often forgotten is he might’ve been one of the best talent evaluators the Bears ever had when it came to the quarterback position. He helped them draft Jim McMahon in 1982 and Jim Harbaugh in 1987. He also is noted for having pushed hard for the Bears to grab Joe Montana in 1979 before getting overruled by Finks. The guy knew what quarterbacks were supposed to look like.\n\nWhy bring this up now? Mainly because those lessons he learned have continued to work well to this day through his son Duke Tobin. The man who has run the personnel department for the Cincinnati Bengals for the past several years. Like his father, he’s enjoyed his fair share of success at drafting quarterbacks. It turns out his methods are pretty unique and quite brilliant.\n\nChicago Bears can learn a lot from Tobin’s methods\n\nTobin was a big part of the Bengals getting Carson Palmer in 2003, but his biggest success story has to be the selection of Andy Dalton in 2011. Cincinnati picked the TCU product in the 2nd round and had the conviction that he would be their starter immediately. Why? It turns out according to Albert Breer of Sports Illustrated that they were blown away by a test he’d passed from them.\n\nCincinnati had arranged for on-campus workouts with all the top quarterback prospects and asked that the prospects take care of the logistics—everything from finding receivers eligible to run routes, booking time at a suitable facility and making sure everything could go off without a hitch. Really, the players had to do everything but bring the balls to the field—the Bengals would bring their own—which created an interesting test for each of them. “We show up to TCU and, honest to God, everybody from the entire organization at TCU is there, the place is packed,” Tobin said. “That’s how much [Dalton] meant to them. It was an amazing feeling—like holy cow. And he was in charge of everything.”\n\nSuch a fascinating approach that makes plenty of sense. It tests not only the quarterback’s ability to mentally prepare for something but also how strong a connection he can build with teammates. Dalton proved despite his physical limitations he had the brainpower and competitive fire to succeed in the NFL, which he has.\n\nPerhaps GM Ryan Pace should employ similar such tactics in the future rather than just arranging dinner reservations."}, {"url": "https://profootballtalk.nbcsports.com/2021/04/25/heres-an-interesting-p-s-to-the-bill-tobin-mel-kiper-feud/", "page_content": "Getty Images\n\nThe 27th anniversary landed on Saturday of the memorable moment between former Colts G.M. Bill Tobin and longtime ESPN draft expert Mel Kiper. Roughly a week before that, the player Kiper believed the Colts should have taken shared with Ryen Russillo a story that, if true, makes the entire Tobin-Kiper kerfuffle moot.\n\nQuarterback Trent Dilfer told Russillo that the Colts didn’t draft Dilfer because his agent, Mike Sullivan, had informed the Colts that Dilfer would not sign a contract with Indianapolis.\n\n“I didn’t go to the Colts because my agent told them I would sit out the year and I would then be the Panthers’ first pick in their first year,” Dilfer said. “So that was the whole Mel Kiper, General Manager argument on ESPN that gets shown every year. They couldn’t pick me at five instead of Trev Alberts because we said I wouldn’t play. So I always try to defend the Colts that way. And I regret it because I could have played with Marshall [Faulk] for a long time.”\n\nIt’s unclear how long Dilfer would have played with Faulk. First, Faulk spent only five years with the Colts, before being traded to the Rams. Second, Dilfer may not have been the quarterback for very long in Indianapolis. In Tampa, he threw 17 touchdown passes against 43 interceptions during his first three seasons. This means that the Colts still may have been in position to take Peyton Manning four years after the Dilfer draft, even if the Colts had taken Dilfer.\n\nDilfer, who later threatened to sit out the 1994 season and re-enter the draft in a contract squabble with the Buccaneers, explained that his agent didn’t believe the Colts were a viable destination for Dilfer.\n\n“There’s a lot of history between agents and GMs,” Dilfer said. “There’s a lot of opinions on the direction franchises are gonna go, and you kind of have to trust them. . . . He was convinced that the Colts were going nowhere, that this was a bad situation to be in, even with Marshall Faulk gonna be there it wasn’t enough. He was convinced that that was a bad spot, and convinced me and my family that that would not be the best spot for us and that Tampa would be better one pick later.”\n\nOf course, there’s no guarantee that Dilfer actually would have sat out a full season and re-entered the draft. It’s rare that players make this threat before the draft, and it’s even more rare that they act upon it. Also, maybe the Colts wouldn’t have taken Dilfer regardless of his vow to boycott the team.\n\nThe Tobin-Kiper fight almost didn’t happen for an entirely different reason. Dilfer told Russillo that, as of the night before the draft, Washington had decided to take Dilfer, not Heath Shuler, with the third overall selection.\n\nThe next morning, someone (it wasn’t Dan Snyder; he hadn’t bought the team yet) decided to take Shuler instead. Dilfer said that the surprise caused his wife, who was looking for houses in the Washington area, to start crying. Other family members scrambled to ensure that TV cameras wouldn’t see her reaction to the announcement that Shuler was the pick at No. 3.\n\nBut for that unexpected, last-minute decision by Washington, TV cameras never would have captured Kiper’s reaction to the Colts not taking Dilfer, and the even better reaction by Tobin to Kiper’s comments. So, basically, we’ve finally found a good reason for Washington’s decision to draft Heath Shuler."}, {"url": "https://www.chicagotribune.com/news/ct-xpm-1996-01-11-9601110073-story.html", "page_content": "INDIANAPOLIS — If Bill Tobin has turned around the Indianapolis Colts three years after leaving the Bears, it raises the question of whether Chicago made a mistake in turning away its player-personnel director when Dave Wannstedt was hired in 1993.\n\nTobin has more power as Colts vice president and director of football operations than the Bears ever gave him. Now he is one victory from the Super Bowl and universal acclaim as one of the NFL's shrewdest architects.\n\nAdvertisement\n\nShould the Colts' joy ride continue Sunday with a victory at Pittsburgh in the AFC championship game, more questions will be asked about whether Tobin as general manager and Wannstedt as coach couldn't have been a harmonious and winning arrangement at Halas Hall.\n\nPerhaps Wannstedt would have spurned the Bears in that case, since he didn't accept a New York Giants job offer that would have left personnel decisions in the hands of General Manager George Young. Dan Reeves is now chafing under that yoke.\n\nAdvertisement\n\nBut in the two years of drafts since Tobin and the Bears parted, his selections have shown a more immediate dividend than Wannstedt's. For while Wannstedt doesn't own the GM title, he nonetheless is the final word in any personnel judgments and is responsible for acting on his scouting staff's recommendations.\n\nTobin and Wannstedt would have disagreed, however, from the start.\n\nTobin wouldn't have drafted Curtis Conway with the Bears' first pick in April 1993. His wide receiver choice would have been O.J. McDuffie, who made 62 catches for 819 yards and eight touchdowns with Miami this season, as well as a 24.5-yard kick-return average.\n\n\"We had McDuffie rated higher than Conway and, if I was going to be there, we needed a good player right away and not any spoiled guy from L.A.,\" Tobin said Wednesday. Conway, who led the Bears with 12 touchdown catches in 1995, \"may be a great player, but he was not my best wide receiver.\"\n\nTobin was a lame-duck player-personnel director at the time. Coach Mike Ditka had been fired after a 5-11 record in 1992, and Tobin was in the Halas Hall draft room in 1993 mainly as a traffic cop, overseeing the grading of the draftees with Bear scouts. He didn't have an ounce of influence in final decisions in his last official act as a Bear.\n\nA second disagreement would have come over Jim Harbaugh, the quarterback the Bears waived in March 1994. Harbaugh happens to be leading the Colts onward and upward.\n\nTobin's 1994 draft, in contrast to Wannstedt's, had staying power. Seven of his first eight picks finished the season on the Colts' active roster.\n\nThe Bears, on the other hand, took offensive tackle Marcus Spears in the second round in 1994, and defensive lineman Pat Riley and punter-kicker Todd Sauerbrun in Round 2 of 1995. Spears and Riley basically didn't play this season, when the Bears went 9-7 and missed the playoffs. Sauerbrun was a spectacular dud.\n\nAdvertisement\n\nTobin refuses to assess the Bears' drafts the last two years, feeling it's not his place. He prefers to talk about his top two draft picks in 1994: running back Marshall Faulk (now out with a knee injury) and Trev Alberts, a key to the Colts' shifting defense from a 4-3 to a 3-4 with his ability to play linebacker or end. Alberts doesn't start, but has been involved in 68 percent of the total plays.\n\nRookie defensive tackle Ellis Johnson, Tobin's first-round pick in 1995, remains a work in progress, but he started in place of an ill Tony Siragusa in Sunday's victory in Kansas City. Ex-Illini tight end Ken Dilger, Tobin's second pick from 1995, was the Colts' third-leading receiver this season with 635 yards, and his four receiving touchdowns tied for the team lead.\n\nCompare the impact of Faulk on the Colts and that of defensive end John Thierry, the Bears' first-rounder in 1994, on Chicago, and Tobin wins the comparison hands down at this point. Compare Dilger with Sauerbrun and Riley, and the same applies.\n\n\"Next season Thierry can be the Conway of 1995,\" Wannstedt contends, believing that with time, Thierry will mature on the line the way Conway did this season as a big-play receiver.\n\nOthers can argue the Bears would be better off with Tobin still working at Halas Hall, still offering his learned and diversified opinion of college talent. Tobin thinks the separation was needed.\n\n\"It was time to leave when I left,\" he said. \"I had 18 good years in Chicago. But my contract was being overriden by what (Bears President Mike McCaskey) promised Dave. The philosophy was changing and went against my principles, what I believed to be true.\"\n\nAdvertisement\n\nTobin didn't just bring in talent in Indy.\n\n\"We found some players here they didn't know they had. Tony McCoy was sitting on the bench. They had Ray Buchanan at corner, and David Tate wasn't here. Stephen Grant was just a name. Quentin Coryatt was playing out of position.\n\n\"We signed selective free agents. We gave Tony Bennett a lot of money, but he's everything we thought he was. Harbaugh was adrift, and after I traded Jeff George I signed him. Harbaugh's a winner and a leader.\"\n\nTobin thinks delegating authority is the key principle to success.\n\n\"Just leave people alone and, if you listen to them, some of your decisions are easy. You'll have problems if you try to make their decisions for them.\"\n\nThe Bears decided they could stop listening to Tobin in 1993. In two of the three years since, they haven't been to the playoffs."}, {"url": "https://bleacherreport.com/articles/2424954-the-one-that-got-away-nfl-execs-tell-the-tales-of-their-biggest-draft-misses", "page_content": "B/R via AP Images\n\nAs Bill Tobin prepared to leave his suburban Chicago home shortly before sunup on May 4, 1979, his wife Dusene asked him who he thought the Bears would draft that day. They were thinking about defensive lineman Dan Hampton and linebacker Al Harris in the first round, he told her. And he was certain who the Bears would select in Round 3. That would be Notre Dame quarterback Joe Montana.\n\nIn all of the team's preparatory discussions, the only possibility the Bears considered in the third round was Montana. They had given themselves Montana in every mock draft they had prepared in the month leading up to the event. Tobin, in fact, said he had Montana rated as a first-round talent, and the Bears' inside connections with the Notre Dame coaching staff had given them a good feel for everything Montana could become.\n\nIn the draft room that day were team founder George Halas, general manager Jim Finks, treasurer Jerry Vainisi, assistant to the GM Bill McGrane, head coach Neill Armstrong and top scouts Jim Parmer and Tobin. After the Dolphins chose tight end Ronnie Lee with the ninth pick in the third round, several in the room exhaled. The Bears were up and Montana was available. Tobin's heart began to race. Vainisi said he stood and removed a magnet with Montana's name on it from the bullpen area of the team's draft board. He placed it under the Bears' picks.\n\nAnd then Finks, clearly in command, spoke up. \"Put him back in the bullpen,\" Finks said, according to Vainisi. Finks then expressed concern about a crowded quarterback depth chart. The Bears had Bob Avellini as their starter, and he was being pushed by Mike Phipps. Vince Evans had been showing great ability in practices. Why, Finks asked, should we muddy the waters with another quarterback? And then Finks started talking about how he was uncomfortable with the running backs behind Walter Payton.\n\nBy now the Bears were deep into the allotted time on the draft clock. As the seconds wound down, Finks announced the Bears would take Willie McClendon from Georgia, the highest-rated running back remaining on the Bears' board.\n\n\"I was stunned,\" Vainisi said.\n\n\"Bill Tobin almost had apoplexy,\" McGrane said. \"He was beside himself, sick he didn't get Montana.\"\n\nLENNY IGNELZI/Associated Press\n\nMcClendon lasted four years in the NFL and never rushed for more than 160 yards in a season. If the Bears had chosen Montana, and Montana had become Montana in Chicago, they could have ruled the 1980s with dominance on both sides of the ball. They almost certainly would not have lost to the 49ers in the NFC Championship Games following the 1984 and 1988 seasons. And the Bears' 1979 draft class, with Hampton and Montana, would have been remembered as one of the most transcendent in history.\n\nFinks, who died in 1994, is classified as a great general manager by all who knew him or studied what he did. But like everyone who ever drafted, Finks made regrettable decisions.\n\nEvery drafter has a story about \"the one that got away.\"\n\nTobin has another story about one that got away, but this story has been buried in the \"Who the hell is Mel Kiper?\" story.\n\nThe Colts came into the 1994 draft with the second and seventh overall picks, the latter of which they had acquired from the Falcons for quarterback Jeff George. Tobin, recently named Indianapolis' director of football operations, had just begun a rebuild and was ready to put his mark on the team. With the second overall selection, he chose running back Marshall Faulk. He moved up from the seventh pick to the fifth and took outside linebacker Trev Alberts.\n\nThis did not sit very well with ESPN draft expert Kiper, who strongly believed the Colts should have taken a quarterback. The Redskins chose Heath Shuler with the third pick, and the Bucs took Trent Dilfer with the sixth. When Kiper criticized Tobin for selecting Alberts instead of Dilfer, Tobin went off on the now-famous \"Who the hell is Mel Kiper?\" rant.\n\nWhat few people know is Tobin's initial target in a trade-up was neither Alberts nor a quarterback. In Tobin's estimation, neither Shuler nor Dilfer were worth taking so high. That's why he had signed free-agent quarterback Jim Harbaugh prior to the draft. The player Tobin really wanted with his second pick in the first round was outside linebacker Willie McGinest.\n\n\"I was talking with New England [which had No. 4], trying to trade up to take McGinest,\" Tobin said. \"I called the Redskins [No. 3] too. Alberts was my fallback. Alberts didn't turn out the way we hoped, but Faulk is in the Hall of Fame and Harbaugh was the AFC Player of the Year the following year and is in the Colts' Ring of Honor. If we had been able to get McGinest on top of that, it would have been something.\"\n\nELISE AMENDOLA/Associated Press\n\nMcGinest became a linchpin of three Super Bowl winners in New England and a player who regularly tormented the Colts. Alberts wound up with four career sacks—12 fewer than McGinest had in postseason games alone. If McGinest had been a Colt instead of a Patriot, the fragile balance of power may have shifted in the AFC.\n\nMcGinest is not the only outstanding pass-rusher who qualifies as one that got away. In fact, there is one pass-rusher who is identified as the one that got away from at least three teams. The Bears had the fourth pick in the 2005 draft, the Redskins had the ninth and the Lions had the 10th. All of them could have used a pass-rusher—someone like DeMarcus Ware.\n\nAfter ranking 32nd in offense in the NFL the previous season, the Bears felt they needed to focus on that side of the ball. They selected running back Cedric Benson, who topped out at 674 yards in three years with Chicago and eventually was cut after off-field problems.\n\n\"In that draft, we dismissed defensive players, in particular DeMarcus Ware, because we felt we needed to bring some juice to the offense,\" former Bears general manager Jerry Angelo said. \"We were fixed on that. If we had been more open-minded and stayed true to who we were, we would have taken Ware. He would have had a much greater impact on our team, because we had Thomas Jones at running back.\n\n\"Ware would have played into the strength of who we were. We should have spent more time looking at him because we would have seen how special he was.\"\n\nThe Redskins, meanwhile, were focused on another need: cornerback. They picked Carlos Rogers ahead of Ware, and then had to deal with Ware twice a year for nine years after the Cowboys made him the 11th selection of the first round. Eleven of Ware's 127 career sacks have come against the Redskins.\n\nLM Otero/Associated Press\n\n\"We liked Ware, but we needed corners badly,\" said Vinny Cerrato, who was the Redskins' vice president of football operations at the time. \"Ware was kind of a project out of Troy. We had Carlos rated high too. He made a Pro Bowl, and if he could have caught the football, he would have made three or four Pro Bowls. He dropped a lot of interceptions.\"\n\nFormer Lions CEO Matt Millen was desperate for a home run pick in 2005, and then a high, hanging curveball came his way. He had Ware rated as the best pass-rusher in the draft and the fourth- or fifth-best player at any position. So Millen's eyes got big when Ware slipped to his pick, 10th overall.\n\n\"The draft fell perfect for us,\" Millen said. \"Lo and behold, there he is. We needed a pass-rusher bad. DeMarcus was the guy I targeted. I couldn't believe it. I turned and said, 'Get DeMarcus on the phone.'\"\n\nAt that point, a conversation started in the Lions' draft room. Millen recalls offensive coordinator Ted Tollner pushing to take wide receiver Mike Williams. Then head coach Steve Mariucci got on board. \"I said, 'OK, if you think he's going to make that big a difference, we'll do it,'\" Millen said. \"But as soon as I did it, it didn't feel right.\"\n\nThe Lions had used first-round picks in the previous two drafts on wide receivers Charles Rogers and Roy Williams, so most of the draft audience was stunned by the move—especially because questions had been raised about Mike Williams' conditioning, commitment and play speed.\n\nMillen's son Matthew, who was in the draft room, famously punched his father after the selection. Matt understands why. \"All those talks should have been taken care of already,\" Millen said. \"I allowed it to happen, and I caved like a freaking idiot. It was nobody's fault but my own. It still bugs me.\"\n\nThe Lions were right about Ware and wrong about Williams. Dead wrong. Millen said most of the money from Williams' rookie contract came back to the Lions in fines.\n\n\"You name it, he did it,\" Millen said. \"He didn't show up for meetings. He was late. He skipped things. He was overweight. He just didn't get it.\"\n\nThe Millen Lions never recovered from his \"one that got away.\" Jimmy Johnson's Cowboys, on the other hand, recovered quite gracefully from his.\n\nThese days, Johnson has become quite the fisherman down in the Florida Keys. If he chose, he could talk all day about ones that got away. But Johnson prefers to talk about the ones he got on the boat. Always has. Those aren't always the best stories, though.\n\nTwenty-five years ago, Johnson was an unproven head coach of the Cowboys with a maverick style. Even though Johnson had the 21st pick in the draft, he was still trying to acquire the player he rated as the best at any position: linebacker Junior Seau.\n\nKeith Srakocic/Associated Press\n\n\"I really, really wanted him,\" Johnson said. \"I'm sure I made phone calls to the first four or five teams before he was picked. I couldn't get a deal done. But I thought he was a great, great player.\"\n\nThe Cowboys already had young Troy Aikman and Michael Irvin on offense. And Johnson thought they were set at running back after signing a Plan B free agent from Cleveland that offseason: Keith \"End Zone\" Jones.\n\n\"I thought he was going to be our guy,\" Johnson said. So Johnson was intent on adding a defensive player.\n\nAs it turned out, all of the defensive players Johnson liked were taken well before the Cowboys' pick. Johnson was looking at taking running back Rodney Hampton with the 21st pick. But there was another running back he liked more—so much more that he had him rated as the fourth overall player in the draft. Johnson was able to arrange a deal with the Steelers to move up four spots. That's where he chose Emmitt Smith.\n\n\"End Zone\" Jones blew out a lumbar disc before the season began and never played a down for the Cowboys. Smith went on to a Hall of Fame career and helped the Cowboys win a trio of Super Bowls.\n\nFor Bill Parcells, the one that got away came in the 1984 supplemental USFL draft. The Bucs chose quarterback Steve Young first, and then the Oilers selected running back Mike Rozier. With the third pick, Parcells' Giants chose a player who would have a Hall of Fame career. But they passed up a player who could have given them a dynasty.\n\nParcells recalls the team was drawn to offensive tackle Gary Zimmerman because the Giants needed offensive linemen, and their defense already was strong with promising outside linebacker Lawrence Taylor. So the late, great general manager George Young chose Zimmerman—ahead of defensive lineman Reggie White.\n\nJERRY REDFERN/Associated Press\n\n\"I was not in charge of the draft, but it was not a big argument,\" Parcells said. \"We had them rated closely.\"\n\nAs it turned out, Zimmerman did not want to play for the Giants, so the team traded him to the Vikings for a pair of second-round picks they later would use to select defensive back Mark Collins and safety Greg Lasker.\n\nOne pick after the Giants, the Eagles, of all teams, chose White.\n\n\"The first game that year, we played Philadelphia,\" Parcells said. \"I think he got two sacks. He was playing defensive tackle, and he wasn't playing every down yet. I remember telling my coaches, 'We're going to have to deal with this guy for a long time.' It was pretty obvious right away. Looking back on it, had we chosen Reggie, I think our defense, which was pretty dominant as it was, would have been really exceptionally strong for a good length of time.\n\n\"The combination of Reggie White and Lawrence Taylor would have been something special.\"\n\nAnd they would have been playing in game plans designed by Bill Belichick.\n\nThe Packers also could have put together a duo for the ages—a quarterback-wide receiver duo. The one that got away from Ron Wolf was Randy Moss.\n\nWolf will be inducted into the Pro Football Hall of Fame this August, and he is regarded as one of the best talent evaluators in NFL history. As Wolf prepared for the 1998 draft, he recognized Moss' unique ability. But the Packers general manager never seriously considered Moss because of his checkered past.\n\n\"In Green Bay, Wisconsin, if your player runs a traffic light, that is the lead story on the 6 o'clock news,\" Wolf said. \"So we were very, very careful about the people we brought in. I didn't do my due diligence on him like I should have. It was a bad job on my part.\"\n\nWith the 19th selection in the first round, the Packers chose defensive end Vonnie Holliday, who had a 15-year career but never became an elite player. Two picks later, the Vikings selected Moss.\n\nIn his 14-year career, Moss had more receiving yards (1,320) and more touchdowns (14) against the Packers than any other team. So by the time Moss \"mooned\" Packers fans at Lambeau Field during a playoff game in 2005, Wolf had already seen more of the wide receiver than he ever cared to.\n\nWinslow Townson/Associated Press\n\nMoss, one of the most productive and dynamic wide receivers ever, almost certainly would have had an even more prolific career if he had been paired with gunslinger Brett Favre, a kindred football spirit.\n\n\"Favre and Moss would have really been something,\" Wolf said. \"Moss demonstrated he was a quality, quality player. To my knowledge, never had any [major] problems. That's one I'd like to do over.\"\n\nMany teams probably would like a do-over when it comes to Russell Wilson—none more than the Eagles.\n\nJoe Banner, who was the Eagles president in 2012, recalls Philadelphia having a first-round grade on Wilson, but the team believed he would be available when they were scheduled to make a selection with the 25th pick in the third round. They used second-round picks on linebacker Mychal Kendricks and defensive end Vinny Curry.\n\n\"Considering what Russell has turned out to be and how high we had him graded, we should have used one of those picks on him and not outsmarted ourselves,\" Banner said. \"Howie [Roseman] and Andy [Reid] had so much enthusiasm for him. We thought if he were 6'3\", he'd be the first pick in the draft with no debate. We were all invested and excited. We thought he was going to be our quarterback of the future.\"\n\nIt would have been interesting to see the reaction of Eagles fans if their team had drafted a 5'11\" quarterback.\n\n\"I wasn't really worried about his height,\" said Reid, who has a history of strong quarterback evaluation. \"I thought he could function. He didn't look small behind the biggest line in the country at Wisconsin. He was a big Drew Brees fan and fit his game after his. He had natural leadership ability and was smart—those are two good qualities. He won you over with his attitude and desire to be great.\"\n\nMichael Perez/Associated Press\n\nAs fate would have it, the Seahawks chose Wilson with the 12th pick in the third round. Thirteen picks later, the Eagles chose quarterback Nick Foles.\n\nThe man who drafted Wilson, Seahawks general manager John Schneider, once worked down the hall from Reid in Green Bay. They shared thoughts and watched tape together when the Packers were drafting quarterbacks like Mark Brunell. So it is not a surprise that they were of like mind on Wilson.\n\nThe most interesting part of the story might be that both Wilson and Foles could have been Eagles. Back in Green Bay when Reid worked with Wolf, he came to appreciate the value of stockpiling the quarterback position.\n\n\"If we could have, we would have taken Russell in the third round and Nick in the fourth,\" said Reid, now head coach of the Chiefs. \"It would have been great competition.\"\n\nMaybe Reid still would be coaching the Eagles. Maybe the Seahawks never would have played in a Super Bowl. Maybe Wilson would have become an NFL MVP in Chip Kelly's offense.\n\nInstead, he's one of the ones that got away. One of the missed opportunities that changed the course of NFL history.\n\nDan Pompei covers the NFL for Bleacher Report."}, {"url": "https://profootballtalk.nbcsports.com/2021/04/24/happy-anniversary-bill-tobin-and-mel-kiper/", "page_content": "Getty Images\n\nMultiple Twitter accounts have noted this morning the 27th anniversary of the time when the coverage of the NFL draft sounded a lot like a pro wrestling pre-match interview.\n\nAdam Schefter of ESPN supplied the short version. The excellent @BackAftaThis account dusted off a longer cut.\n\nIt was 1994. The Colts moved up to No. 4 from No. 7. Many believed they made the jump to get quarterback Trent Dilfer. They instead selected linebacker Trev Alberts.\n\nLong-time NFL draft expert Mel Kiper didn’t like the move. And (contrary to the modern draft-coverage etiquette that is far more grounded in selling oft-implausible hope to all fans of all teams) he said so.\n\n“I think it’s a typical Colt move,” Kiper explained. “I mean, here’s a team that needed a franchise quarterback. To pass up a Trent Dilfer when all you have is Jim Harbaugh. Give me a break. That’s why the Colts are picking second every year in the draft, not battling for the Super Bowl like other clubs in the National Football League.”\n\nCut to Indianapolis. ESPN’s Chris Mortensen welcomed Colts G.M. Bill Tobin to the spot where Tobin will be interviewed with a huge smile and this line: “I knew you’d have one surprise for us today.”\n\nTobin, foreshadowing his on-air rant, didn’t reciprocate the joviality. “Not a surprise to us,” Tobin said, triggering an immediate and dramatic change to Mort’s demeanor and words.\n\n“No, that’s great,” Mort said. “I mean, no that’s what I mean. I’m not . . . I’m not . . . Hey.”\n\nThen came the on-the-record question and answer. Mort asked for Tobin’s response to the criticism about not taking a quarterback.\n\n“Well, you know, we got a guy up there — who in the hell is Mel Kiper anyway?” Tobin said. “I mean, here’s a guy that criticizes everybody, whoever they take. He’s got the answers to who you should take and who you shouldn’t take. In my knowledge of him, he’s never, ever put on a jock strap. He’s never been a coach. He’s never been a scout. He’s never been an administrator. And all of a sudden he’s an expert. He’s in our papers two days ago telling us who we have to take. We don’t have to take anybody that Mel Kiper says we have to take. Mel Kiper has no more credentials to do what he’s doing than my neighbor, and my neighbor’s a postman and he doesn’t even have season tickets to the NFL.”\n\nIt’s unknown whether Tobin’s postman ever became a draft expert, or purchased season tickets.\n\nIn the short term, Tobin got the last laugh. Sort of. Dilfer, despite winning a right-place, right-time Super Bowl with the Ravens six years later, never became a great quarterback. (Then again, the 1994 draft had no great quarterbacks. Gus Frerotte was the best of the bunch; even better were Kurt Warner and Jeff Garcia, both of whom went undrafted.)\n\nMeanwhile, Harbaugh nearly led Tobin’s Colts to the Super Bowl a year later. They had the Steelers on the ropes at Three Rivers Stadium before Pittsburgh took a late lead. Harbaugh then nearly connected on what would have been a game-winning Hail Mary.\n\nIn the long haul, Kiper won. The Colts fired Tobin after the 1996 season, and he’d never serve as a G.M. again. Kiper continues to persevere through highs and lows and ups and down and swings and misses.\n\nIndeed, my one enduring memory of Kiper has nothing to do with the draft. In May 2001, when Kiper was hosting a weekend show on ESPN Radio, he made the case for one of the NFL’s teams becoming the first franchise to lose every contest in a 16-game season.\n\nThat team was the New England Patriots. They’d go on to win their first of six Super Bowls that same year.\n\nAt times like this, I still wonder what Tobin’s postman thought the 2001 Patriots would do."}, {"url": "https://www.chicagotribune.com/news/ct-xpm-1991-11-06-9104100031-story.html", "page_content": "A little more than half the season has been played, yet nominees for the Bears` Most Valuable Player award are trickling in.\n\nJim Harbaugh? Steve McMichael? Neal Anderson? Richard Dent? William Perry? Mike Singletary?\n\nAdvertisement\n\nCouldn`t go wrong with any of those selections.\n\nBut the most influential member of the Bears` organization, it seems, hasn`t played a down this season.\n\nAdvertisement\n\nHe`s player personnel director Bill Tobin, whose overall record of evaluating talent corresponds directly with the Bears` on-field championship performances the last decade.\n\nTobin has been a part of the Bears` personnel staff since 1975 and has been in charge since 1984.\n\n''He is the Most Valuable Player in this organization,'' said Harbaugh after Sunday`s 20-10 victory over the Lions that improved the Bears` record to a NFC Central Division-leading 7-2.\n\n''It is a credit to Bill Tobin that he has been able to maintain the talent level on this team, compared to the teams like Green Bay, Tampa Bay and Detroit, especially,'' said Harbaugh. ''Those guys have been drafting in the first 10 picks for the last decade. He has been able to scrounge talent out of the late rounds. He has done as good a job as anybody in this organization, as far as players, coaches or anybody.''\n\nIn his more than 17 years in the organization, Tobin has seen all 19 of the club`s top draft picks become productive players. And 13 are still in the NFL.\n\n''We work at it, I promise you that. We`re not in the Bahamas with our feet up,'' said Tobin.\n\nHis staff includes assistant Rod Graves and regional scouts Charley Mackey, Jim Parmer, Jeff Shiver and Gary Smith. Ken Geiger handles scouting of NFL opponents and overseeing league player transactions.\n\n''If you get the right kind of people doing the selecting, they will select the right kind of people,'' said Tobin of the Bears` draft success.\n\nAdvertisement\n\nHe also should be credited for recommending his brother, Vince, for the defensive coordinator`s job when Buddy Ryan departed to be the Philadelphia Eagles` head coach in 1986.\n\nNine of the Bears` first-rounders have made it to the Pro Bowl. Overall, 14 Bear picks and two free agents since `80 have made the Pro Bowl.\n\n''To me, that has been the key for us to stay on top,'' said Harbaugh.\n\n''A lot of times the talent he gets in the late part of the first rounds are better than the guys in the first part of the rounds.\n\n''Look at Neal Anderson (picked 27th on the first round in 1986) and Brad Muster (23rd on the first round in 1988). . . . I think my year (1987) he did a good job of drafting.''\n\nHarbaugh was taken 26th on the first round out of Michigan.\n\nAdvertisement\n\nIn 1987, the Lions drafted defensive end Reggie Rogers, the Packers took running back Brent Fullwood, the Vikings grabbed back D.J. Dozier and the Bucs selected quarterback Vinny Testaverde in the first round.\n\n''It was the worst all-time draft, and Tobin was able to get a couple of players out of there,'' said Harbaugh.\n\nAmong the other picks by the Bears in 1987 were defensive ends Sean Smith, Steve Bryan and Will Johnson. ''Ron Morris and I are the only ones on our team from that year,'' said Harbaugh.\n\nThe Bears have won their division six out of the last seven years, largely because Tobin and his staff have beaten the Packers (his former employer), Tampa Bay, Detroit and Minnesota at the draft-even though those teams generally pick much higher than the Bears on each round.\n\nConsider the Bears` first-round picks over the last 13 years:\n\nStan Thomas, Mark Carrier, Trace Armstrong, Donnell Woolford, Wendell Davis, Brad Muster, Harbaugh, Anderson, Perry, Wilber Marshall, Willie Gault, Jim Covert, Jim McMahon, Keith Van Horne, Otis Wilson, Al Harris and Dan Hampton.\n\nAdvertisement\n\nNow, consider the Packers` first-rounders in that span: Vinnie Clark, Darrell Thompson, Tony Bennett, Tony Mandarich, Sterling Sharpe, Fullwood, Kenneth Davis, Ken Ruettgers, Alphonso Carreker, Tim Lewis, Ron Hallstrom, Rich Campbell, George Cumby, Bruce Clark and Eddie Lee Ivery.\n\nCredit Mike Ditka and the rest of the coaching staff for extracting the most production out of their talent-because division foe Minnesota also has selected superb athletes in the likes of Chris Doleman, Randall McDaniel, Keith Millard and Joey Browner. But the results have not been there on the field for them.\n\nThe jury still is out on much of the `91 rookie crop, including Bears first-rounder Thomas, rushed into a starting role because of the season-ending back injury to Covert.\n\nThomas signed a few days after the draft and didn`t miss a beat in mini-camp or the regular summer training camp. Injuries to his knee, shoulder and now his ankle have exacerbated the learning process.\n\nVeteran backup John Wojciechowski, an undrafted free agent in 1986 out of Michigan State, will start Monday night against the Vikings.\n\nLast year, Tobin became a NFL pioneer by working out the parameters of a contract for Carrier on draft day. Carrier went on to become NFL Defensive Rookie of the Year with a league-high and club-record 10 interceptions.\n\nAdvertisement\n\nTobin`s draft success in the early rounds tells only part of his story. Consider:\n\n- The selection of Pro Bowler Dent on the eighth round out of Tennessee State in 1983.\n\n- The signing of undrafted free agent Jay Hilgenberg, now a five-time Pro Bowl center, in 1981.\n\n- The drafting of Pro Bowl guard Mark Bortz on the eighth round in 1983. He had been a defensive lineman at Iowa.\n\n- The drafting of safety Shaun Gayle out of Ohio State in the 10th round as the 271st player selected in 1984.\n\n- The signing of free-agent McMichael, who was cut by New England after being drafted in the third round in 1980.\n\nAdvertisement\n\nAdditionally, future Hall-of-Fame linebacker Mike Singletary was a second-round pick in 1981. This year`s leading sacker, John Roper, was also a second-round choice out of Texas A&M in 1989. Ron Rivera, who leads current Bear linebackers in career interceptions with nine, was a second-round pick in 1984. Jim Morrissey was a steal on the 11th round in 1985.\n\nBut Tobin realizes he can`t rest on his past. It is up to this year`s rookie crop of Thomas, Chris Zorich, Chris Gardocki, Anthony Morgan, James Williams, Michael Stonebreaker, Darren Lewis, John Hardy, Stacy Long, Eric Wright, Paul Justin and Eric Ihnat to continue the legacy."}, {"url": "https://www.upi.com/Archives/1983/12/19/Bill-Tobin-director-of-the-Chicago-Bears-pro-scouting/9755440658000/", "page_content": "LAKE FOREST, Ill. -- Bill Tobin, director of the Chicago Bears' pro scouting since 1975, Monday was named the club's director of player personnel by team President Michael McCaskey.\n\nThe selection of Tobin, 42, completes the organizational structure McCaskey began when he took over as the head of the team founded by his grandfather, George Halas.\n\nAdvertisement\n\nTobin will report directly to McCaskey and will be on an equal organizational level with General Manager Jerry Vainisi and Coach Mike Ditka.\n\nTobin said his first responsibility would be to hire two additional scouts in preparation for the upcoming collegiate draft. However, Tobin said he wasn't critical of previous Bears' drafts.\n\n'I think we have had good drafts in the past but I can see ways we can have better drafts,' said Tobin, a star running back for the University of Missouri from 1959 to 1962. 'I plan to work very closely with Mike Ditka, Jerry Vainisi and Michael McCaskey.'\n\nTobin, who began his pro career with Houston in 1963 before going to the Canadian League, said he had turned down four offers from the USFL for 'jobs with more elaborate titles' than the one he has now with the Bears.\n\nAdvertisement\n\n'But I wanted to be in the NFL with the Chicago Bears,' Tobin said.\n\nTobin added he anticipated the Bears would have to scout USFL games this spring for talent, adding he doesn't foresee a promising future for the rival league.\n\n'I think the NFL is doing a more aggressive selling job,' said Tobin, a native of Burlington Junction, Mo. 'I think there are some players who signed early that regret their decision ... I think we will look at the USFL games for the way they are going. They may not be around in a year or two.'\n\nMcCaskey said selecting a player personnel director was not modeled after any other team's organizational chart although he conceded it might be construed to be along the lines of the Dallas Cowboys.\n\n'I will make the final decision regarding draft choices and trades,' McCaskey added.\n\nDitka said his top priority for the upcoming draft would be defense, specifically defensive linemen.\n\n'We will want to get the best player available,' Ditka said. 'We didn't know this year that Dan (Hampton) would go down with injuries. I'd also like to see us look at a linebacker.'\n\nTobin said he didn't anticipate any disagreements with Ditka about whom to select in the draft, adding that McCaskey would have the ultimate say.\n\nAdvertisement\n\nTobin came to the Bears from the Green Bay Packers, where he was pro scouting director since 1972.\n\nIn a related matter, McCaskey said the club would evaluate moving to a new practice field away from Lake Forest, where the club experienced difficulty getting practice time because of inclement weather this past season.\n\nHe said he had visited facilities in Green Bay and Minnesota and estimated it would cost at least $500,000 to build an indoor facility to allow the team to practice during bad weather."}, {"url": "https://www.wikiwand.com/en/Bill_Tobin_(American_football)", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about Bill Tobin (American football)?\n\nSummarize this article for a 10 years old"}, {"url": "https://www.chicagotribune.com/news/ct-xpm-2001-05-06-0105060216-story.html", "page_content": "The most qualified people to take over the Bears' football operations aren't necessarily the ones whose names pop up on early lists.\n\nGeorge Halas was 87 years old when he hired Mike Ditka to coach the only Bears team to get to a Super Bowl, so Marv Levy is a spring chicken at 75. With four Super Bowls in a row as coach of the Buffalo Bills working with two outstanding general managers, Levy would know exactly how to get the Bears back on track. He already lives in Chicago, so the Bears wouldn't have to pay moving expenses. The Bears also would have to give Levy the first weekend of August off so he can be inducted into the Hall of Fame.\n\nAdvertisement\n\n\"Director of football operations? Would it be appealing? Yes, particularly in Chicago. I'd have to say that,\" Levy said. \"It's intriguing.\"\n\nLevy called his years with general managers Bill Polian and John Butler \"a magnificent working relationship.\"\n\nAdvertisement\n\nHe would bring instant respect and knowledge to the Bears.\n\nThey did it: Two available men have done what the Bears have in mind--run all aspects of football operations from salary caps to coaching caps.\n\nBill Tobin is so obvious he has been overlooked. After three years on the sidelines since running the Indianapolis Colts, Tobin is back with the Detroit Lions as their personnel chief and organized the draft for new head honcho Matt Millen.\n\nHis record as a talent evaluator puts Tobin among the elite in NFL history, starting with scouting John Brockington for the Green Bay Packers to discovering Richard Dent for the Bears to drafting Marshall Faulk for the Colts.\n\nHe spent 19 years with the Bears before resigning after coach Dave Wannstedt wanted more input. It's more than coincidence that Tobin's 1993 exit coincides with the Bears' rapid decline in personnel decisions. As late as last season there were still as many Bears No. 1 draft choices playing in the NFL who were selected on Tobin's watch--Jim Harbaugh, Trace Armstrong, Mark Carrier, Alonzo Spellman, Curtis Conway--than were selected in the two subsequent regimes--John Thierry, Walt Harris, Curtis Enis, Cade McNown, Brian Urlacher.\n\nBill Kuharich ran the New Orleans Saints and hired Ditka to coach. Kuharich assembled the entire offensive line, most of the defense and made the blockbuster trade for Ricky Williams that helped the Saints get into the playoffs last year after Ditka and Kuharich were fired.\n\nKuharich is now director of pro personnel for the Kansas City Chiefs under general manager Carl Peterson.\n\nOne of the primary contributions Tobin and Kuharich made for the two teams that fired them was to get their salary-cap situations under control, laying a fiscally responsible foundation for playoff success.\n\nAdvertisement\n\nThere are not many candidates for the Bears' job who have experience doing what President Ted Phillips has in mind. One, Tennessee Titans vice president-general manager Floyd Reese, has been mentioned because he has lost authority between President Jeff Diamond and coach Jeff Fisher.\n\nThe Titans run an exemplary, community-minded, media-friendly organization, wildly popular in their new stadium, already the toughest outdoor venue for a visiting team. But Reese is under contract and could cost the Bears a draft choice, something Phillips claims is a \"highly doubtful\" proposition. The job would be seen as a lateral move. According to Diamond, the Titans intend to extend Reese's contract and have no desire to see him leave.\n\nModrak watch: In just three years, Philadelphia director of football operations Tom Modrak has helped build the Eagles from 3-13 to the playoffs. Despite the title, he is not in charge of the head coach and has little to say on salary-cap matters because owner Jeffrey Lurie and chief operating officer Joe Banner are heavily involved in day-to-day operations.\n\nDespite the Eagles' success, they have made no move to extend Modrak's contract and in fact may fire him because he has a one-month window in May that allows him an out and allows the club to get rid of him.\n\nModrak was the second choice of Wannstedt after Tom Donahoe when the Bears hired Mark Hatley. Donahoe, now Buffalo's general manager, and Modrak were working for the Pittsburgh Steelers.\n\nYoung top guns: Winning programs produce winning resumes.\n\nAdvertisement\n\nSince Phil Savage, 35, became director of college scouting for the Baltimore Ravens in 1996, the Ravens have drafted four Pro Bowl players: Jonathan Ogden, Ray Lewis, Jermaine Lewis and Peter Boulware, plus Super Bowl starters Jamie Sharper, Kim Herring, Jeff Mitchell, Duane Starks and Chris McAlister.\n\nJohn Schneider, 30, is director of player personnel for the Seattle Seahawks under Mike Holmgren. He worked for three years as director of pro personnel for the Chiefs under Peterson and five years as assistant director of pro personnel for the Packers under Ron Wolf.\n\nTed Sundquist, 39, became director of college scouting for the Denver Broncos in 1996 after working with former Bears assistant coach Jerry Frei and the late Jack Elway under coach Mike Shanahan. Like Wolf, Sundquist is a former military intelligence officer, perfect training for NFL scouting.\n\nThe Broncos have drafted John Mobley, Trevor Pryce, Eric Brown, Brian Griese, Al Wilson, Olandis Gary, Deltha O'Neal and Mike Anderson and have won two Super Bowls since 1996.\n\nTimes change: David Terrell will be only the third wide receiver to play for the Bears after being the team's first pick in the draft. The last one was Curtis Conway in 1993. The first one was Jim Dooley in 1952.\n\n\"I read it in the paper the next day,\" Dooley said. \"They didn't even call me up. I called up Halas and told him I appreciated him drafting me and maybe I could come up and we could talk about a signing bonus. He said: `Kid, your bonus is being selected by the Chicago Bears.'\""}, {"url": "https://www.chicagotribune.com/news/ct-xpm-1994-01-08-9401080108-story.html", "page_content": "Bill Tobin joined the Indianapolis Colts as vice president and director of football operations Friday in a surprise move that changes the role of General Manager Jim Irsay.\n\nTobin, former vice president of player personnel with the Bears, was hired by Colts owner Robert Irsay, who told his son and Tobin, \"Go run the club.\"\n\nAdvertisement\n\n\"I am what it says,\" Tobin said. \"I'm responsible for coaches, players, the draft, trainers, equipment guys. I will consult and work closely with Jim and get the approval of Mr. Irsay. He wants my football experience and success.\"\n\nSo will Tobin trade quarterback Jeff George to the Bears for Jim Harbaugh?\n\nAdvertisement\n\n\"What else are the Bears going to throw in?\" Tobin asked with a laugh.\n\nTobin was never an avid backer of George, first player selected in the 1990 draft, so George's future in Indianapolis is in question. George skipped most of training camp in a dispute he never publicly clarified. He was said to be fed up with what he perceived as unfair criticism in his hometown.\n\nTobin said he was going to review personnel with coach Ted Marchibroda before he talks about anyone, including George.\n\nSince the Colts finished 28th in the league in defense, Tobin's brother Vince could soon rekindle the family reunion they had with the Bears from 1986-92, when the Bears' defense finished 1st, 2nd, 2nd, 25th, 6th, 4th and 17th.\n\n\"We've got some changes to make,\" Bill Tobin admitted when asked about Vince.\n\nThe Colts' defensive coordinator is former Northwestern coach Rick Venturi.\n\nThe Tobin hiring was one of two shakeups in the NFL Friday. The New York Jets fired coach Bruce Coslet and promoted defensive coordinator Pete Carroll after Coslet refused to hire an offensive coordinator. Coslet spent four years without a winning season. After making the playoffs in 1991 as an 8-8 wild card, the Jets suffered through 4-12 and 8-8 seasons.\n\nTobin praised former Bears General Manager Jim Finks as his role model in structuring a team. He compared his situation in Indianapolis to the 1974 hiring of Finks by the Bears, who were a father-son operation. In that case, however, Finks was hired by son Mugs Halas, not father George. Mugs gave up his authority.\n\nAdvertisement\n\nJim Irsay will keep his title as vice president and general manager. Tobin said Jim Irsay, assistant GM Bob Terpenning and general counsel Michael Chernoff would remain responsible for signing players and fitting them under the salary cap.\n\nThe Colts had the third-highest payroll in the league last season, according to NFL Players Association figures. At $40.2 million, they are more than $6 million over next year's projected cap of $34 million.\n\n\"I'm here to tell them who to spend the money on,\" Tobin said. \"That's my area of expertise.\"\n\nSince the Colts finished fifth in the AFC East, they will avoid a game against the Bears next season and play a fifth-place schedule instead. The Colts have the second pick in the April 24 draft. The Bears never picked that high during Tobin's 18 years in Chicago."}]}