{"Bill Tobin has held that position ever since.": [{"url": "https://www.espn.com/nfl/story/_/id/6106117", "page_content": "LAKE FOREST, Ill. -- When the fifth round of the 1983 NFL draft rolled around, George Halas pushed his chair back and went to lunch, taking his general manager Jim Finks, his son-in-law Ed McCaskey and Finks' assistant Bill McGrane along with him.\n\nThe Bears traded their fifth-, sixth- and seventh-round picks away that year, so it was a natural break for the team's braintrust. But the Bears' scouting department, which consisted of pro scout Bill Tobin and college scout Jim Parmer, remained in the old Halas Hall war room monitoring the draft as one name on the board, or in this case wall, stared back at them.\n\nSuper Bowl XX MVP Richard Dent was a four-time All-Pro selection. Jonathan Daniel/Getty Images\n\nTobin placed a second-round grade on a scrawny defensive end from Tennessee State named Richard Dent, which didn't mean he thought Dent would or even should be drafted then. But it did mean that was what he thought of his ability.\n\n\"When they came back from lunch,\" Tobin recalled, \"Finks walks over to the wall and says, 'Hey Toby, your second-round grade is still here. Think we should take him now?'\n\n\"I said, 'Hell yes, we should.' I was shocked he was still there.\"\n\nThe Bears' eighth-round steal was elected this week to the Pro Football Hall of Fame, just one more notch on the belt for Tobin, who, in addition to drafting Walter Payton and scouting every member of the Bears' '85 Super Bowl champs, has the distinction of drafting two of the six players in the 2011 Hall of Fame class in Dent and Marshall Faulk, whom he chose as GM of the Indianapolis Colts.\n\nBut it was the underweight kid Tobin fell in love with in the fall of 1982 who made him feel like \"a proud papa\" this week.\n\nLugging his projector and a bottle of whiskey as a gift for Dent's coach, Tobin remembers it was cold and so muddy that October that they had scattered straw on the field at Tennessee State to improve the footing.\n\nIt didn't seem to affect Dent.\n\n\"The first sentence in my report,\" said Tobin, reading from the original, \"is 'This kid has to get a zero for quickness.' \"\n\nZero, it should be pointed out, is the best score a player can get.\n\n\"One is really special,\" Tobin said. \"I wrote, 'He is extremely quick off the ball, one of the fastest I have ever scouted.' \"\n\nWhen Tobin returned to Nashville to get more film that December -- \"Yeah, the technology wasn't quite what it is today,\" he said with a laugh -- Dent had a cast on his arm due to a complete dislocation of his wrist that required surgery. \"But they turned him loose against Chatanooga,\" said Tobin, who read some more from his report.\n\n\" 'He played one-armed, and he was still very effective,' \" he wrote. \" 'He is one of the quickest you will see upfield, and he has a mean streak in him. He will really wrap up the quarterback when he gets to him.' \"\n\nIf Tobin gets a kick out of looking back at his dead-on evaluation, it can't compare to the pride he had in seeing Dent grow. Literally."}, {"url": "https://profootballtalk.nbcsports.com/2021/04/24/happy-anniversary-bill-tobin-and-mel-kiper/", "page_content": "Getty Images\n\nMultiple Twitter accounts have noted this morning the 27th anniversary of the time when the coverage of the NFL draft sounded a lot like a pro wrestling pre-match interview.\n\nAdam Schefter of ESPN supplied the short version. The excellent @BackAftaThis account dusted off a longer cut.\n\nIt was 1994. The Colts moved up to No. 4 from No. 7. Many believed they made the jump to get quarterback Trent Dilfer. They instead selected linebacker Trev Alberts.\n\nLong-time NFL draft expert Mel Kiper didn’t like the move. And (contrary to the modern draft-coverage etiquette that is far more grounded in selling oft-implausible hope to all fans of all teams) he said so.\n\n“I think it’s a typical Colt move,” Kiper explained. “I mean, here’s a team that needed a franchise quarterback. To pass up a Trent Dilfer when all you have is Jim Harbaugh. Give me a break. That’s why the Colts are picking second every year in the draft, not battling for the Super Bowl like other clubs in the National Football League.”\n\nCut to Indianapolis. ESPN’s Chris Mortensen welcomed Colts G.M. Bill Tobin to the spot where Tobin will be interviewed with a huge smile and this line: “I knew you’d have one surprise for us today.”\n\nTobin, foreshadowing his on-air rant, didn’t reciprocate the joviality. “Not a surprise to us,” Tobin said, triggering an immediate and dramatic change to Mort’s demeanor and words.\n\n“No, that’s great,” Mort said. “I mean, no that’s what I mean. I’m not . . . I’m not . . . Hey.”\n\nThen came the on-the-record question and answer. Mort asked for Tobin’s response to the criticism about not taking a quarterback.\n\n“Well, you know, we got a guy up there — who in the hell is Mel Kiper anyway?” Tobin said. “I mean, here’s a guy that criticizes everybody, whoever they take. He’s got the answers to who you should take and who you shouldn’t take. In my knowledge of him, he’s never, ever put on a jock strap. He’s never been a coach. He’s never been a scout. He’s never been an administrator. And all of a sudden he’s an expert. He’s in our papers two days ago telling us who we have to take. We don’t have to take anybody that Mel Kiper says we have to take. Mel Kiper has no more credentials to do what he’s doing than my neighbor, and my neighbor’s a postman and he doesn’t even have season tickets to the NFL.”\n\nIt’s unknown whether Tobin’s postman ever became a draft expert, or purchased season tickets.\n\nIn the short term, Tobin got the last laugh. Sort of. Dilfer, despite winning a right-place, right-time Super Bowl with the Ravens six years later, never became a great quarterback. (Then again, the 1994 draft had no great quarterbacks. Gus Frerotte was the best of the bunch; even better were Kurt Warner and Jeff Garcia, both of whom went undrafted.)\n\nMeanwhile, Harbaugh nearly led Tobin’s Colts to the Super Bowl a year later. They had the Steelers on the ropes at Three Rivers Stadium before Pittsburgh took a late lead. Harbaugh then nearly connected on what would have been a game-winning Hail Mary.\n\nIn the long haul, Kiper won. The Colts fired Tobin after the 1996 season, and he’d never serve as a G.M. again. Kiper continues to persevere through highs and lows and ups and down and swings and misses.\n\nIndeed, my one enduring memory of Kiper has nothing to do with the draft. In May 2001, when Kiper was hosting a weekend show on ESPN Radio, he made the case for one of the NFL’s teams becoming the first franchise to lose every contest in a 16-game season.\n\nThat team was the New England Patriots. They’d go on to win their first of six Super Bowls that same year.\n\nAt times like this, I still wonder what Tobin’s postman thought the 2001 Patriots would do."}, {"url": "https://profootballtalk.nbcsports.com/2021/04/25/heres-an-interesting-p-s-to-the-bill-tobin-mel-kiper-feud/", "page_content": "Getty Images\n\nThe 27th anniversary landed on Saturday of the memorable moment between former Colts G.M. Bill Tobin and longtime ESPN draft expert Mel Kiper. Roughly a week before that, the player Kiper believed the Colts should have taken shared with Ryen Russillo a story that, if true, makes the entire Tobin-Kiper kerfuffle moot.\n\nQuarterback Trent Dilfer told Russillo that the Colts didn’t draft Dilfer because his agent, Mike Sullivan, had informed the Colts that Dilfer would not sign a contract with Indianapolis.\n\n“I didn’t go to the Colts because my agent told them I would sit out the year and I would then be the Panthers’ first pick in their first year,” Dilfer said. “So that was the whole Mel Kiper, General Manager argument on ESPN that gets shown every year. They couldn’t pick me at five instead of Trev Alberts because we said I wouldn’t play. So I always try to defend the Colts that way. And I regret it because I could have played with Marshall [Faulk] for a long time.”\n\nIt’s unclear how long Dilfer would have played with Faulk. First, Faulk spent only five years with the Colts, before being traded to the Rams. Second, Dilfer may not have been the quarterback for very long in Indianapolis. In Tampa, he threw 17 touchdown passes against 43 interceptions during his first three seasons. This means that the Colts still may have been in position to take Peyton Manning four years after the Dilfer draft, even if the Colts had taken Dilfer.\n\nDilfer, who later threatened to sit out the 1994 season and re-enter the draft in a contract squabble with the Buccaneers, explained that his agent didn’t believe the Colts were a viable destination for Dilfer.\n\n“There’s a lot of history between agents and GMs,” Dilfer said. “There’s a lot of opinions on the direction franchises are gonna go, and you kind of have to trust them. . . . He was convinced that the Colts were going nowhere, that this was a bad situation to be in, even with Marshall Faulk gonna be there it wasn’t enough. He was convinced that that was a bad spot, and convinced me and my family that that would not be the best spot for us and that Tampa would be better one pick later.”\n\nOf course, there’s no guarantee that Dilfer actually would have sat out a full season and re-entered the draft. It’s rare that players make this threat before the draft, and it’s even more rare that they act upon it. Also, maybe the Colts wouldn’t have taken Dilfer regardless of his vow to boycott the team.\n\nThe Tobin-Kiper fight almost didn’t happen for an entirely different reason. Dilfer told Russillo that, as of the night before the draft, Washington had decided to take Dilfer, not Heath Shuler, with the third overall selection.\n\nThe next morning, someone (it wasn’t Dan Snyder; he hadn’t bought the team yet) decided to take Shuler instead. Dilfer said that the surprise caused his wife, who was looking for houses in the Washington area, to start crying. Other family members scrambled to ensure that TV cameras wouldn’t see her reaction to the announcement that Shuler was the pick at No. 3.\n\nBut for that unexpected, last-minute decision by Washington, TV cameras never would have captured Kiper’s reaction to the Colts not taking Dilfer, and the even better reaction by Tobin to Kiper’s comments. So, basically, we’ve finally found a good reason for Washington’s decision to draft Heath Shuler."}, {"url": "https://wikimili.com/en/Bill_Tobin_(American_football)", "page_content": "Nathan D. Clements is a former American football cornerback in the National Football League (NFL). He played college football for Ohio State. He was drafted by the Buffalo Bills 21st overall in the 2001 NFL Draft, and also played for the San Francisco 49ers and Cincinnati Bengals.\n\nFrank Michael Reich III. is an American football coach and former quarterback who is the head coach for the Carolina Panthers of the National Football League (NFL). He played college football at Maryland and was selected by the Bills in the third round of the 1985 NFL Draft. Reich spent most of his career backing up Jim Kelly, although he achieved recognition when he led the Bills to the NFL's largest postseason comeback during the 1992–93 NFL playoffs.\n\nThe 1992 NFL season was the 73rd regular season of the National Football League (NFL). Due to the damage caused by Hurricane Andrew, the New England Patriots at Miami Dolphins game that was scheduled for September 6 at Joe Robbie Stadium was rescheduled to October 18. Both teams originally had that weekend off. This marked the first time since the 1966 NFL season and the AFL seasons of 1966 and 1967 that there were byes in week 1.\n\nMichael Allen Doss is an American former football safety who played in the National Football League (NFL) for six seasons. He played college football for Ohio State University, earned consensus All-American honors, and was a member of the 2002 national championship team. He was drafted in the second round of the 2003 NFL Draft by the Indianapolis Colts, with whom he played four seasons with, including during the team's 2006 Super Bowl season. Doss then spent one season with the Minnesota Vikings and Cincinnati Bengals each before retiring.\n\nVincent Michael Tobin is an American football coach and former college player who was the head coach of the Arizona Cardinals of the National Football League (NFL). During his four decades of coaching, he served as defensive coordinator for college, NFL, and Canadian Football League (CFL) teams.\n\nTheodore Joseph Marchibroda was an American football quarterback and head coach in the National Football League (NFL). He spent his four years as an active player with the Pittsburgh Steelers and Chicago Cardinals (1957). He was later head coach of the Colts in two different cities and decades, first in Baltimore during the 1970s and then Indianapolis during the 1990s. Upon joining the Baltimore Ravens in a similar capacity in 1996, he became the only individual to serve as head coach with both of Baltimore's NFL teams. His career coaching record was 87–98–1 (.470) and 2–4 in the playoffs.\n\nThe 1994 NFL draft was the procedure by which National Football League teams selected amateur college football players. It is officially known as the NFL Annual Player Selection Meeting. The draft was held April 24–25, 1994, at the Marriott Marquis in New York City, New York. The league also held a supplemental draft after the regular draft and before the regular season. This was the first draft in which the rounds were reduced to seven in total.\n\nTroy McHenry Walters is an American football coach and former player who is the wide receivers coach for the Cincinnati Bengals of the National Football League (NFL). Walters played as a wide receiver and punt returner in the National Football League (NFL) for eight seasons. Walters played college football for Stanford University, was a consensus All-American and was recognized as the most outstanding college wide receiver in the country by winning the Biletnikoff Award. He was selected in the fifth round of the 2000 NFL Draft by the Minnesota Vikings, and also played for the Indianapolis Colts, Arizona Cardinals and Detroit Lions of the NFL.\n\nPaul Donald Justin is a former American football quarterback primarily for the Indianapolis Colts of the National Football League (NFL). He was drafted by the Chicago Bears in the 7th round of the 1991 NFL Draft. He played college football for Arizona State. He had brief stints with the Cincinnati Bengals and St. Louis Rams. Prior to his time in the NFL, he was the starting quarterback for the Arizona Rattlers of the Arena Football League (AFL) and the Frankfurt Galaxy of the World League of American Football (WLAF).\n\nJohn William Standeford is a former American football wide receiver. He played college football at Purdue, and signed with the Washington Redskins as an undrafted free agent in 2004. He also played for the Indianapolis Colts, Detroit Lions, Florida Tuskers, Cincinnati Bengals, and Virginia Destroyers. As a member of the Colts, Standeford won Super Bowl XLI, defeating the Chicago Bears.\n\nJamaal Anderson is a former American football defensive end. He was drafted by the Atlanta Falcons eighth overall in the 2007 NFL Draft. He played college football at Arkansas.\n\nHard Knocks is a reality sports documentary television series produced by NFL Films and HBO. The show was first broadcast in 2001, and the current 2022 season is the 17th and 18th. Each season, it follows a National Football League (NFL) team through its training camp and covers the team's preparation for the upcoming football season. Starting with the 2021 season there will be an in season version of Hard Knocks following a different team than the training camp version.\n\nChase Allen Coffman is a former American football tight end. He played college football for the University of Missouri, earned consensus All-American honors, and was recognized as the best college tight end in the country. He was chosen by the Cincinnati Bengals in the third round of the 2009 NFL Draft.\n\nDaniel \"Boom\" Herron is a former American football running back. Herron played football at Warren G. Harding High School in Warren, Ohio, and later Ohio State University. He was drafted in the sixth round of the 2012 NFL draft by the Cincinnati Bengals, and also played for the Indianapolis Colts and Buffalo Bills.\n\nThe Indianapolis Colts are a professional American football team based in Indianapolis, Indiana. They play in the South Division of the American Football Conference (AFC) in the National Football League (NFL). The organization began play in 1953 as the Baltimore Colts with the team located in Baltimore, Maryland; it relocated to Indianapolis following the 1983 season.\n\nWalter Mendenhall is a former American football running back. He played college football at Illinois from 2005 to 2007 before transferring to Illinois State University where he played in 2008. He was signed by the Philadelphia Eagles as an undrafted free agent in 2009 and has also been a member of the Indianapolis Colts, Buffalo Bills and Cincinnati Bengals. He is the brother of former Arizona Cardinals running back Rashard Mendenhall.\n\nTaylor Jonathan Yates is a former American football quarterback and coach who is the wide receivers coach for the Atlanta Falcons of the National Football League (NFL). He played college football at North Carolina and was drafted by the Houston Texans in the fifth round of the 2011 NFL Draft. He has also played for the Atlanta Falcons, Miami Dolphins, and Buffalo Bills.\n\nDuke Tobin is the Director of Player Personnel for the Cincinnati Bengals of the National Football League (NFL). He played in the Arena Football League for the Orlando Predators in 1994 and Memphis Pharaohs in 1995. He played college football at Illinois & Colorado.\n\nMalik Hooker is an American football safety for the Dallas Cowboys of the National Football League (NFL). He played college football at Ohio State and was drafted by the Indianapolis Colts with the 15th overall pick in the 2017 NFL Draft. While at Ohio State, Hooker was named a unanimous All-American in 2016 and won the 2015 CFP national championship."}, {"url": "https://www.baseball-reference.com/players/t/tobinbi01.shtml", "page_content": "Frequently Asked Questions\n\nWhen was Bill Tobin born?\n\nBill Tobin was born on October 10, 1854.\n\nWhere was Bill Tobin born?\n\nBill Tobin was born in Hartford, CT.\n\nHow many seasons did Bill Tobin play?\n\nBill Tobin played 1 season.\n\nIs Bill Tobin in the Hall of Fame?\n\nBill Tobin has not been elected into the Hall of Fame.\n\nWhat position did Bill Tobin play?\n\nBill Tobin was a First Baseman.\n\nHow many hits did Bill Tobin have?\n\nBill Tobin had 24 hits over his career.\n\nHow many home runs did Bill Tobin have?\n\nBill Tobin had home runs over his career.\n\nWhat was Bill Tobin's average?\n\nBill Tobin had a .158 average over his career.\n\nHow many teams has Bill Tobin played for?\n\nBill Tobin played for 2 teams; the Troy Trojans and Worcester Ruby Legs.\n\nWhen did Bill Tobin retire?\n\nBill Tobin last played in 1880."}, {"url": "https://www.pro-football-reference.com/players/T/TobiBi00.htm", "page_content": "Frequently Asked Questions\n\nHow old is Bill Tobin?\n\nBill Tobin is 82 years old.\n\nWhen was Bill Tobin born?\n\nBill Tobin was born on February 16, 1941.\n\nWhere was Bill Tobin born?\n\nBill Tobin was born in Burlington Junction, MO.\n\nHow tall is Bill Tobin?\n\nBill Tobin is 5-11 (180 cm) tall.\n\nHow much did Bill Tobin weigh when playing?\n\nBill Tobin weighed 210 lbs (95 kg) when playing.\n\nIs Bill Tobin in the Hall of Fame?\n\nBill Tobin has not been elected into the Hall of Fame.\n\nHow many games did Bill Tobin play?\n\nBill Tobin played 10 games over his career.\n\nHow many receiving yards did Bill Tobin have?\n\nBill Tobin had 271 receiving yards over his career.\n\nWhen did Bill Tobin retire?\n\nBill Tobin last played in 1963."}, {"url": "https://alchetron.com/Bill-Tobin-(American-football)", "page_content": "Bill Tobin (born February 16, 1941) is a former professional American football player who played running back for one season for the Houston Oilers. He would later become the general manager of the Chicago Bears and Indianapolis Colts. He also was director of player personnel for the Detroit Lions in 2001.\n\nTobin attended the University of Missouri, where he played in the Tigers′ backfield next to quarterback Jim Johnson.\n\nDuring his time with the Indianapolis Colts he drafted Hall of Famer Marshall Faulk and future Hall of Famer Marvin Harrison. He also drafted Ken Dilger, Tarik Glenn, and Adam Meadows, who would be cornerstones of the Colts offensive line. He also built a team in Indianapolis with Jim Harbaugh, who in 1995 led the NFL in passing and had a very successful run in the 1995 NFL playoffs, including the first playoff win for the Colts since Super Bowl V, a span of thirty years. He drafted Ray Buchanan and Ashley Ambrose, who later started for the Falcons in the Super Bowl.\n\nTobin was replaced as Colts general manager in 1997 by Bill Polian. Tobin is the brother of former NFL coach Vince Tobin.\n\nTobin was recently working as a scout for the Cincinnati Bengals."}, {"url": "https://www.espn.com/blog/cincinnati-bengals/post/_/id/20949/bengals-personnel-chief-duke-tobin-to-stay-in-cincinnati", "page_content": "CINCINNATI -- The news comes as little surprise, but it's important news nonetheless for the Cincinnati Bengals.\n\nAccording to ESPN NFL Insider Adam Schefter, Bengals director of player personnel Duke Tobin will remain in his role in Cincinnati despite receiving overtures from other teams this week.\n\nBoth the Detroit Lions and Tennessee Titans requested permission to interview Tobin for general manager openings they have, but league sources have told Schefter that Tobin and the Bengals have committed to each other for the long-term. He isn't leaving anytime soon.\n\nTobin, the son of current Bengals scout and former Colts GM Bill Tobin, has been with the Bengals since 1999. His role is Cincinnati's equivalent of a GM position, although the team doesn't formally have that title. It has been since 2011 that Tobin and head coach Marvin Lewis have had greater roles in the decisions to draft and sign players. One could argue the tandem has created one of the league's most stable franchises from a talent and personnel standpoint.\n\nThe Bengals have made it to the playoffs every year since 2011. On Saturday, they host the Pittsburgh Steelers in the AFC wild-card round."}, {"url": "https://oig.justice.gov/sites/default/files/archive/special/9704a/20sbtobi.htm", "page_content": "SECTION H12: TOBIN ALLEGATIONS\n\nI. Introduction\n\nThis section discusses certain issues that William Tobin, a metallurgist now working in the Materials Analysis Unit (MAU), has brought to the attention of the OIG. Tobin has identified cases in which he believes other examiners, primarily in the Explosives Unit (EU), have incorrectly conducted or reported metals-related examinations. He also contends that SA Michael Malone, a former examiner in the Hairs and Fibers Unit (HFU), testified inaccurately and outside his expertise in a 1985 hearing related to the impeachment of United States District Judge Alcee Hastings.\n\nTo investigate these matters, we interviewed Tobin and several others, including: Dennis Aiken, Roger Avery, Alan Baron, John Doar, Michael Ennis, Christopher Fiedler, Bruce Hall, Michael Hahn, Congressman Alcee Hastings, John Hicks, Michael Malone, AUSA Frederick Martin, Thomas Mohnal, Kenneth Nimmich, Robert Sibert, Alan Robillard, J. Thomas Thurman, and Chief Judge Gerald Tjoflat of the United States Court of Appeals for the Eleventh Circuit. We also reviewed pertinent documents from the Alcee Hastings case and other cases.\n\nBased on our investigation, we conclude that the Laboratory would benefit from a clear delineation of responsibilities between units with respect to metals-related examinations, better communication among examiners in this area, and recognition that differences among examiners should be resolved on a scientific basis. We also conclude that the EU should take steps to assure that its examiners properly conduct and report their examinations of wires or other metals-related evidence.\n\nIn the Alcee Hastings case, we find that Michael Malone falsely testified that he had himself performed a tensile test on a purse strap and also testified inaccurately and outside his expertise concerning the test results. The misstatements concerning the test results, Tobin acknowledged, did not affect the conclusion that the strap had been partially cut. After Tobin raised concerns about Malone ' s testimony in 1989, then-SAS Chief Kenneth Nimmich failed to assure that the serious allegations of examiner misconduct were appropriately investigated and addressed.\n\nII. The Reporting of Metals-Related Examinations\n\nTobin identified one general area and two specific cases in which he thought metals-related examinations had been incorrectly performed or reported: (1) in reports prepared by EU examiners regarding the gauge of wire; (2) in a report in the La Familia case indicating that holes had been drilled into metal pipes; and (3) a suggestion in the Mauchlin case that a handgun barrel was made from Swedish steel. We address each of these matters in turn.\n\nA. Improper Wire Gauging\n\nTobin contends that EU examiners have themselves conducted certain examinations that would be better performed by qualified metallurgists and in some instances the EU examiners have reported their examinations incorrectly. He specifically identified the measurement of wire gauge as an example. To illustrate his point, Tobin noted that in an August 1995 report issued by EU examiner Thomas Mohnal in the UNABOM case, the following dictation appears:\n\nPresent within the submitted specimens are the following lengths of wire: White insulated, single conductor, multi-strand copper wire containing 26 strands of 30 - gauge (AWG) copper wire.\n\nIn Tobin ' s view, this report incorrectly states the gauge of the wire because it describes the gauge of individual strands of a multi-strand wire. Tobin observed that, consistent with industry standards, a multi-strand wire should be gauged based on the total cross-sectional area of its separate strands. Because the report did not describe the wire in this way, Tobin voiced concern that field agents or other readers might misinterpret the report as indicating that 30-gauge wire was found in the examined specimens.\n\nAfter the August 1995 report was issued, Tobin met with EU Chief J. Thomas Thurman and acting MAU Chief Christopher Fiedler to discuss Tobin ' s concerns about how the EU was measuring and reporting the gauge of wire. During the meeting, Thurman agreed that Tobin would instruct EU examiners how properly to gauge wire and to conduct certain other metals-related examinations. In September 1996, however, the EU still had not obtained this training. Tobin advised the OIG that Thurman had not yet asked Tobin to provide it. Thurman told the OIG that he had told Tobin he would set up the training whenever Tobin wanted to do it; Thurman further said he was not concerned that the EU was perhaps misgauging wire.\n\nWith respect to the wire gauging issue, we draw several conclusions. The measurement of wire gauge is, in our view, something that appropriately-trained EU examiners can perform themselves without involving a metallurgist. Thurman as the EU chief should have taken more seriously Tobin ' s concern that EU examiners were not measuring or reporting the wire gauge in accord with industry standards. Where a multi-strand wire is involved, its gauge should be measured and reported based on the total cross-sectional area of its strands. Of course, following the industry standard for describing the wire would not preclude an examiner, as in the quoted report from the UNABOM case, from also supplying additional information describing the size and other characteristics of individual strands.\n\nB. The La Familia Case\n\nIn the La Familia case, Tobin, who worked on the case, thought that the EU and the Firearms and Toolmarks Unit (FTU) in 1996 reported the results of metals-related examinations in a misleading or incorrect manner. After he reviewed a report containing certain statements with which he disagreed, Tobin prepared dictation describing his own opinions without first talking to explosives examiner Thomas Mohnal, who was the principal examiner (PE). Tobin ' s action led to further controversy because Mohnal and EU Chief Thurman accused Tobin of improperly attempting to discredit the EU and FTU. We conclude that the Laboratory personnel, including Tobin, should have communicated better among themselves and focused on the pertinent scientific knowledge in attempting to resolve any differences.\n\nThe Laboratory was asked in this case to determine if certain evidence met the definition of an explosive device or was used in the construction of pipe bombs. The submitted evidence included a pipe nipple with two end caps, collectively identified as Q1; another pipe nipple with an end cap and an end plug, collectively identified as K1; and a drill and drill bit. Each of the pipe nipples had a hole in the center of the pipe shaft.\n\nAs the PE, Thomas Mohnal sent the evidence to Tobin to determine if there were metal filings on the drill bit that matched the pipe. Mohnal also sent the evidence to the FTU to determine if the holes had been drilled with the bit. On February 9, 1996, Mohnal issued a partial report. Because Tobin had not completed his dictation, this report stated that [t]he Metallurgy examinations are continuing and you will be advised of the results of these examinations upon their completion.\n\nIn the February 9 report under the heading Pipe Nipple/End Caps, Mohnal described specimens Q1 and K1. The report stated that Q1 was a 6-inch length of black-coated steel pipe having a nominal pipe size diameter of 3/4 inch. Mohnal noted that a hole measuring approximately 0.118 inches in diameter had been drilled in approximately the center of the pipe nipple. He also noted that the pipe nipple had the word MEXICO stamped in manufacturer ' s lettering, that two nominal size 3/4 inch steel end caps were present, and that one of the caps was stamped on the top with the words 3.4 Q CHINA in manufacturer ' s lettering. Describing specimen K1, the report noted that the diameter of the pipe was the same as Q1, that the stamped lettering on the pipe also bore the word MEXICO, and that the end cap from K1 was found to be the same nominal size as the end caps from Q1 and had the lettering 3.4 Q CHINA.\n\nIn a separate section, the February 9 report also described the results of toolmark examinations performed in the FTU:\n\nThe threaded pipes represented in specimens Q1 and K1 bear toolmarks (holes) typical of those produced by a drilling-type action. Although these holes are approximately the same size in diameter as the K4 drill bit, they bear no microscopic characteristics of value for comparison purposes. Therefore, no associations based on toolmarks, could be made between the K4 drill bit and the Q1 and K1 threaded pipes.\n\nShortly after the February 9 report was issued, Tobin sent Mohnal dictation reporting that no material consistent with specimens Q1 and K1 was found on the K4 drill and drill bit. Tobin says he only subsequently saw the February 9 report, and he then read Mohnal ' s description of the pipes but not the section describing the results of the toolmark examinations. Tobin concluded that the report incorrectly suggested that the pipes in specimens Q1 and K1 were identical and also incorrectly used the term nominal pipe size in describing the evidence, because nominal pipe size indicates that the pipe wall meets certain American Iron and Steel Institute (AISI) standards. Tobin also was concerned by the statement that holes had been drilled in the pipe nipples, because he had not found characteristics indicating the holes were drilled.\n\nWithout first discussing his concerns with Mohnal, Tobin recalled his earlier dictation and prepared new dictation dated February 13, 1996. That dictation stated:\n\nMetallurgical examinations and comparisons of the Q1 and K1 pipe nipples revealed similarities as to the country of origin stampings . . . material class, and ostensible size (3/4 inch). However, the Q1 nipple is 3/4 inch AISI NPS (American Iron and Steel Institute, Nominal Pipe Size), but the K1 nipple would fail to comply with the AISI 3.4 inch NPS standard. . . . Differences as to hardness and fabrication techniques, in addition to the slight but significant size difference, between the nipples of specimens Q1 and K1 were detected pursuant to the metallurgical examinations. The nipples, although apparently manufactured in Mexico, were concluded to have been formed by different fabrication operations. . . . No material consistent with specimens Q1 and K1 was detected adhering to the K4 drill or drill bit. Although the approximate centers of the Q1 and K1 nipples do not exhibit characteristics of being drilled, the K4 drill bit (7/64 ) is of the proper size to have been used for pilot holes.\n\nWhen he received Tobin ' s February 13, 1996, dictation, Mohnal said he was immediately angered by the fact that Tobin had issued the findings without consulting him. Mohnal said that he thought that Tobin was deliberately attempting to embarrass the EU and FTU and to hurt the case. In Mohnal ' s view, Tobin had been asked to answer a very limited question and he had done so by his dictation stating that no material consistent with specimens Q1 and K1 was detected adhering to the K4 drill and drill bit. Mohnal also stated that his February 9, 1996, report was not intended to compare the K1 and Q1 specimens to determine if they were identical, as that was not a pertinent issue, and the language in the Pipe nipple/end cap section was meant to be merely descriptive.\n\nAfter Mohnal ' s unit chief, J. Thomas Thurman, learned that Tobin had prepared the revised dictation, Thurman also concluded that Tobin had improperly commented on matters he had not been asked to address. Thurman told the OIG that he did not take issue with Tobin raising issues, but Thurman thought it was improper for Tobin to issue the revised dictation without even talking to the other examiners involved.\n\nSometime after February 13, 1996, Tobin met with his acting unit chief, Christopher Fiedler, and Thurman to further discuss the dictation. As a result of this meeting, Tobin issued yet another revised dictation with additional language stating that the metallurgical differences would not likely be detected by other than a metallurgist or other individual knowledgeable of pipe fabrication techniques, and they do not alter the efficacy of the apparent intended product. Tobin told the OIG he agreed to this language to appease the EU. Thurman said that while he still thought Tobin should not have issued his February 13 dictation and it should have been withdrawn, Thurman agreed to the compromise dictation because Mohnal said he could live with it.\n\nAfter preparing his February 13 dictation, Tobin realized that it also conflicted with the toolmark conclusions described in the February 9, 1996, report. Those conclusions, which were based on the work of examiner Michael Ennis, stated that the pipes in Q1 and K1\n\nbear toolmarks (holes) typical of those produced by a drilling-type action.\n\nTobin approached Ennis to attempt to reach agreement on further revised language. Tobin met with Ennis and then prepared a dictation dated February 27, 1996, which stated: The holes in the approximate centers of Q1 and K1 do not exhibit characteristics indicative of drilling as a final metallurgical operation and they are similar as to technique of formation and apparent RMS (root mean square) profile. The K4 drill bit (7/64\n\n) is of the proper size to have been used for drilling pilot holes in both nipples. No material consistent with the Q1 and K1 nipples was detected adhering to the bit. Although Tobin and Ennis agreed on Tobin\n\n'\n\ns revised dictation, they evidently misunderstood each other as to its implications for the conclusions Ennis earlier had reached. Ennis told the OIG that he understood that Tobin had examined only the top of the holes in the pipes, while Ennis had examined the inside of the holes and observed characteristics such as spiraling that he thought were indicative of drilling. Ennis said this allowed him to reconcile his earlier dictation with Tobin\n\n'\n\ns February 27 dictation. Tobin told us his February 27 dictation on its face contradicted the dictation Ennis had prepared and that he did not think that spiraling was significant with regard to whether the holes had been drilled. Tobin told the OIG that he had probably not told Ennis these things because Tobin did not want to embarrass him. After Tobin and Ennis met, there was a separate meeting among EU Chief Thurman, FTU Chief Sibert, and Bruce Hall, who by then was serving as the MAU chief. Hall concluded from this meeting that Tobin should have discussed his concerns with the FTU and the EU examiners before issuing his February 13, 1996, dictation. Hall also thought that Tobin had acted out of frustration after concluding that Mohnal and Ennis had incorrectly performed examinations that should have been done by a metallurgist. Hall observed that the problem reflected a lack of communication that could have been avoided if the units had collaborated. In addition, Hall recalled suggesting that a metallurgist provide training to EU examiners to try to improve communication, but this idea apparently was not implemented. The La Familia investigation resulted in the trial of defendant Charles Nunez in federal court in Springfield, Massachusetts in July 1996. Nunez was convicted on charges related to the unlawful possession of pipe bombs. Thomas Mohnal testified at the trial that a particular device was a pipe bomb, and Steven Burmeister testified about the Laboratory\n\n'\n\ns identification of certain powder. Neither Ennis nor Tobin testified at the trial. We have several conclusions concerning the La Familia case. When Tobin saw what he thought were incorrect or misleading statements in the February 9, 1996, report, he was correct to raise the issue. He should, however, have talked with Mohnal before issuing his own February 13 dictation. As a general matter, we think that examiners should first discuss issues informally among themselves if there appears to be a difference of opinion in interpreting data or reporting conclusions. Had Tobin attempted such informal communication here, it might have avoided both much of the controversy and the need for Tobin to further revise his dictation. We find unpersuasive Tobin\n\n'\n\ns explanation that he prepared his dictation as he did because he knew from past experience that Mohnal would ignore his concerns. We also find that Tobin and Ennis did not take appropriate steps to resolve their differences concerning whether the evidence indicated that holes had been drilled in the pipe nipples. Although Tobin and Ennis agreed to a further revision of Tobin\n\n'\n\ns dictation, Tobin did not think the evidence showed characteristics of drilling. Ennis in contrast thought he and Tobin had agreed their conclusions could be reconciled. That Ennis and Tobin talked about their differences was laudable. They should, however, have addressed more directly the bases for and the possible inconsistencies in their respective conclusions. If they were unable themselves to reach agreement based on the data and analyses performed, they should have involved their unit chiefs further. Both Thurman and Mohnal seemed to be concerned more about Tobin\n\n'\n\ns motives or manner in issuing the February 13 dictation than about the merits of the points he raised. As a unit chief, Thurman should have assured that any differences of opinion among the examiners were resolved on a scientific basis. Rather than do so, Thurman appeared to be chiefly concerned with defending the report issued by EU examiner Mohnal and attempting to persuade others that Tobin\n\n'\n\ns February 13 dictation should be withdrawn. More generally, we think the La Familia case and the issue concerning the measurement of wire gauge show that the Laboratory would benefit from a clear delineation of the respective responsibilities of its metallurgists and other examiners in conducting metals-related examinations. Based on our interview of SAS Chief Randall Murch, we understand that the Laboratory will attempt to develop guidelines in this area. We also understand that the Laboratory intends to establish a\n\nScience Resolution Board\n\nwhich will serve as a forum for the airing of disagreements over scientific issues. Such a board could serve a useful purpose, but we would hope that issues like those presented in the La Familia case could generally be resolved by direct, informal discussions among the examiners involved. C. The Peter Mauchlin Case Tobin has expressed concerns that in this case, in which he conducted metallurgical examinations, the prosecutor and the case agent were incorrectly told that a gun barrel was made from\n\nSwedish steel.\n\nAlthough the case agent recalls hearing something about\n\nhigh quality Swedish\n\nor\n\nstainless\n\nsteel, we did not identify anyone in the Laboratory who reported incorrect information in this regard. According to Tobin, he met with AUSA Frederick Martin before the trial to discuss Tobin\n\n'\n\ns anticipated testimony. Tobin recalls that Martin asked him several questions about the nature and origin of metal in a particular gun barrel. Tobin responded that he did not know. When Martin asked why he did not know the answers, Tobin recalls explaining that he had not been asked to examine the gun barrel. Tobin says that Martin then asked what indicated that the gun barrel was made from Swedish steel and said that they had been looking all over for Swedish steel. Subsequently, Tobin concluded that a remark he had made to EU examiner Thomas Mohnal may have been incorrectly communicated to the case agent. Tobin recalled that before the trial, Mohnal had approached him\n\nwaving\n\nsome evidence and said\n\nwhat is this stuff? I don\n\n'\n\nt want a complete exam. Look, I just want your opinion what it is.\n\nTobin said he told Mohnal that he would first need to hold the evidence. According to Tobin, Mohnal replied,\n\nWell, look, I just want to know what to put in my notes just for an inventory kind of thing.\n\nTobin stated that Mohnal continued to push him for an answer and Tobin responded,\n\nTom, for all I know, it\n\n'\n\ns high quality Swedish steel. I don\n\n'\n\nt know.\n\nTobin speculated that as result of this comment, the case agent was mistakenly told the barrel was Swedish steel. AUSA Martin did not recall a conversation about Swedish steel in his pretrial interview with Tobin. Martin said that the case agent, Michael Hahn, was present at the interview and mentioned that the metal used was high-quality, but Martin did not recall Hahn saying it was Swedish. Hahn told the OIG that he recalled something about high quality Swedish or stainless steel, although Hahn could not remember how he received this information. J. Thomas Thurman was the PE on this case. Thurman told the OIG that the submitting agency had not asked for an analysis of the gun barrel and he did not otherwise see any need for Tobin to analyze it. Both Thurman and Mohnal denied ever telling anyone that the gun barrel was Swedish steel. We could not identify the source of the information regarding Swedish steel that case agent Michael Hahn seems to recall. III. Alcee Hastings Matter Tobin alleges that, in 1985, former Hairs and Fibers Unit (HFU) examiner Michael Malone testified falsely and outside his expertise before a judicial committee that was investigating misconduct by Alcee Hastings, who then was a United States District Judge for the Southern District of Florida. As set forth below, we conclude that Malone falsely testified that he had himself performed a tensile test on a purse strap and he also testified outside his expertise and inaccurately concerning the test results. These misstatements, Tobin acknowledged, did not affect the conclusion that the strap had been partially cut. We also find that after Tobin raised concerns about Malone\n\n'\n\ns testimony in 1989, then-SAS Chief Kenneth Nimmich failed to assure that the serious allegations of examiner misconduct were appropriately investigated and addressed. In 1989, Hastings was impeached and removed from his judicial office based on his involvement in a bribery scheme and related misconduct. Our investigation focused on Tobin\n\n'\n\ns allegations concerning Malone\n\n'\n\ns testimony; we did not otherwise review or evaluate actions by the FBI or others related to the impeachment of Hastings. A. The Background to the Investigating Committee Proceedings To place Malone\n\n'\n\ns 1985 testimony into context, it is necessary to briefly summarize the events leading to the charges that Hastings had been involved in a bribery scheme. As a federal judge, Hastings had presided over the trial of Frank Romano and Thomas Romano, who were convicted in Miami in December 1980 on twenty-one counts of racketeering. In May 1981, Hastings ordered the forfeiture of $1.2 million of the Romanos\n\n'\n\nproperty; in July 1981, he sentenced each of the Romanos to a three-year prison term. In late July 1981, a person named William Dredge told federal prosecutors in Miami that he had been directed by William Borders, a Washington, D.C. attorney and long-time friend of Hastings, to solicit a $150,000 bribe from the Romanos in exchange for their sentences being reduced to probation. Dredge was a former client of Borders, had a criminal record, and was then facing federal criminal charges himself. After corroborating certain statements made by Dredge, the Government decided to enlist his cooperation. On September 12, 1981, Dredge introduced Borders to a retired FBI agent named Paul Rico who was posing as Frank Romano. Borders told Rico that in exchange for $150,000 an order would be signed returning a\n\nsubstantial amount\n\nof the property and the Romanos would receive mitigated jail sentences. To demonstrate his influence with Hastings, Borders also told Rico that the judge would appear at a time and place selected by Borders and Rico. They agreed that Hastings would appear at the dining room of the Fontainebleau Hotel in Miami at 8:00 p.m. on September 16, 1981. Borders and Rico also agreed to meet again on September 19, 1981, for an\n\nup front\n\npayment on the bribery deal. On the evening of September 12 and the morning of September 13, 1981, Borders and Hastings were together in Washington, D.C. Shortly before 8:00 p.m. on September 16, 1981, Hastings and a female companion entered the dining room of the Fontainebleau Hotel, where they ate dinner. On September 19, 1981, Rico paid Borders $25,000 as\n\nup front\n\nmoney. On October 2, 1981, Rico contacted Borders asking about the status of the forfeiture order. In a telephone conversation on October 5, 1981, Borders told Rico\n\nthe matter\n\nhad\n\nbeen taken care of\n\nand that the order would be mailed out that day or the next. Less than one hour later, Hastings telephoned Borders. During their brief conversation, Hastings said,\n\nI\n\n'\n\nve drafted those, ah, ah, letters for Hemp. . . .\n\nBorders later said,\n\nI talked to him and he wrote some things down for me.\n\nHastings said he understood, and Borders stated,\n\nAnd then I was supposed to go back and get some more things.\n\nHastings told Borders,\n\nI\n\n'\n\nll send the stuff off to Columbia in the morning.\n\nThe next day, Hastings issued an order reversing in part his original $1.2 million forfeiture order and returning over $845,000 in property to the Romanos. On October 7, Borders told Rico that the order had been issued the previous day. Rico agreed to meet Borders in Washington on October 9 for the final payoff. That same evening, a testimonial dinner was to be held in Washington to honor Borders, a past president of the National Bar Association. On Thursday, October 8, Hastings called Borders and told him he would arrive in Washington the next morning. On the morning of October 9, Borders picked Hastings up at the airport and took him to a hotel, where they had adjacent rooms; shortly thereafter Hastings went with Borders to the latter\n\n'\n\ns law office. While at his office, Borders returned a call from Rico; Rico told Borders he had\n\nbrought all the necessary papers\n\nand they agreed to meet at once at Rico\n\n'\n\ns hotel. Borders went by himself to Rico\n\n'\n\ns hotel. Hastings left Borders\n\n'\n\noffice, made a few stops, and then returned to his own hotel. Borders met Rico at his hotel and told him to\n\nget it\n\nbecause he wanted to\n\ntake a ride.\n\nRico got into Borders\n\n'\n\ncar and placed a bag containing $125,000 between them. FBI agents stopped and arrested Borders when he started to drive out of the hotel parking lot. That afternoon, Hastings learned that the FBI wanted to interview him and that Borders had been arrested. Rather than contacting the FBI in Washington, Hastings made an unplanned and hurried departure for Miami, where he was interviewed by FBI agents later that evening. Hastings denied any involvement with Borders in a bribery scheme. On December 19, 1981, Hastings and Borders were indicted on federal charges of conspiracy and obstruction of justice. Borders was also charged with two counts of interstate travel with the intent to commit bribery. The proceedings against Borders were transferred to the Northern District of Georgia, where a jury convicted him on all counts in March 1982. The Court of Appeals for the Eleventh Circuit affirmed the conviction in December 1982. Hastings was tried in Miami in January 1983. He testified that he did not participate in the bribery scheme and had been taken advantage of by Borders. On February 4, 1983, the jury acquitted Hastings. In March 1983, two district court judges filed a complaint with the Judicial Council of the Eleventh Circuit against Hastings based on his involvement in the bribery related to the Romano case and certain other conduct. To investigate the complaint, on March 29, 1983, Chief Judge John Godbold of the Eleventh Circuit appointed a committee consisting of himself, Circuit Judges Frank Johnson and Gerald Tjoflat, and District Judges Sam Pointer, Jr. and William O\n\n'\n\nKelley (the\n\nInvestigating Committee\n\n). The chief counsel for the Investigating Committee was John Doar, an attorney then in private practice who had formerly served both as Special Counsel for the Committee of the Judiciary of the House of Representatives in its investigation regarding the impeachment of former president Richard Nixon and as an Assistant Attorney General for the Civil Rights Division of the Department of Justice. Hastings objected to the Investigating Committee\n\n'\n\ns jurisdiction and did not thereafter participate in the proceedings either directly or through his counsel. Over the course of three years, the Investigating Committee conducted an extensive investigation that included not only a review of the records of the proceedings in the Romano, Borders, and Hastings cases, but also consideration of numerous documents and witness testimony, including evidence that had not been introduced at Hastings\n\n'\n\ntrial of various contacts between Borders and Hastings between February 1981 and September 1981. Between May 1985 and July 1986, the Investigating Committee took sworn testimony on seven different occasions. The Committee heard testimony from more than 110 witnesses and received approximately 2800 exhibits. In a report completed in August 1986, the Investigating Committee stated that there was clear and convincing evidence that Hastings had sought to conceal his participation in the bribery scheme with Borders and to explain away evidence connecting him to the scheme and that he had pursued these objectives by presenting fabricated documents and false testimony in his criminal trial. The Investigating Committee unanimously recommended that the Judicial Council determine that Hastings had engaged in conduct that might constitute one or more grounds for impeachment by: (1) conspiring with Borders to receive a bribe for an official judicial act and, (2) giving false testimony and obstructing justice in connection with his criminal trial in an effort to conceal the conspiracy. B. Malone\n\n'\n\ns Testimony before the Investigating Committee In his criminal trial, Hastings had offered a leather purse with a broken strap as an exhibit. Hastings testified that the reason he had accompanied Borders to his law office on October 9, 1981, was to locate a luggage shop to have the purse repaired. As part of the investigation by the Investigating Committee, the purse was submitted to the FBI Laboratory in 1985 for examination, including an analysis of the nature of the break in the strap. Within the Laboratory, the case was assigned to SA Michael Malone, an examiner who had worked in the HFU since 1974. Malone remained in the HFU until 1994, when he transferred out of the Laboratory as part of a general reassignment of FBI agents from FBI Headquarters to the field offices. Malone examined the purse visually and found two things that he thought suggested the strap had been deliberately broken. An eyelet on one end of the purse was recognizably distorted, while an eyelet on the other end was not. Malone posited that if the purse had been accidentally snagged on something, then both eyelets would have been equally distorted. Malone also found that the break in the strap did not appear to be accidental. If the break had been accidental, Malone thought the strap would have been torn completely across its width with a jagged-edge tear. Malone found, however, that the strap had been cut across three quarters of its width, leaving a straight edge, and the remainder of the strap had been torn, leaving a jagged edge. Malone also attempted manually to break the strap in an undamaged area but could not do so. According to Malone, when he found he could not manually break the strap, he took it to Tobin so it could be examined with a tensile tester, a device that measures the tensile force necessary to break an object. Sometime between September 26 and 30, 1981, Tobin ran the tensile test and the strap broke at 29.5 pounds of force. Malone told the OIG that he did not know what this number meant and that he did not ask Tobin to explain it because he assumed they both would be called to testify at any hearing. Malone issued a report dated September 30, 1985. Tobin issued handwritten AE dictation dated October 2, 1985, which stated: Examinations of the buckle holes in the strap of Q1 purse revealed that a relatively large amount of force(s) had been applied to one end of the strap and a relatively small amount of force(s) had been applied to the opposite end of the strap. This non-uniform distribution of forces is not consistent with\n\nsnagging\n\nor other accidental force application. Each of the two remaining portions of broken strap was subjected to tensile loading (\n\npulling\n\n) to failure. The strap sections failed at 29.5 lbs. and 29.0 lbs. Malone\n\n'\n\ns September 30, 1985, report includes language nearly identical to the first two sentences in Tobin\n\n'\n\ns October 2, 1985, dictation. The September 30, 1985, report does not, however, refer to the strap sections failing at 29.5 pounds and 29.0 pounds or otherwise refer to the tensile test. From our investigation, we could not determine why Malone did not refer to these matters in his September 30, 1985, report. On October 2, 1985, Malone testified before the Investigating Committee. Malone told the OIG that he met with Doar to discuss his testimony that same day. Malone maintains that he then told Doar that he did not conduct the tensile test, but that Tobin had done so. Malone told the OIG that Doar said,\n\nDamn, I forgot to subpoena Tobin.\n\nMalone says Doar asked him if he could read Tobin\n\n'\n\ns results into the record and Malone agreed to do so. Malone thinks he may have then had Tobin\n\n'\n\ns handwritten October 2, 1985, dictation, and says that Doar must have had something in writing regarding the tensile test because Doar knew about the 29.5 pound figure. Malone says Doar also told him that the judges would probably have questions about the test and asked if Malone could handle the questions. Malone says he told Doar he was not an expert in the\n\nforce test\n\nbut that he would try to answer the questions. Doar disputes Malone\n\n'\n\ns recollection about the discussions before the testimony. Handwritten notes that Doar prepared on October 1, 1985, show that he met with Malone the day before Malone testified. Among other things, these notes also indicate that Malone then told Doar that the strap broke at 29.9 pounds of\n\ntensile strength.\n\nThe notes do not refer to Tobin. Doar insists that Malone did not tell him that Tobin performed the tensile test or even worked on the case, and Doar says he did not receive anything in writing from the FBI related to the tensile test before Malone testified on October 2, 1985. Doar denies ever telling Malone that he forgot to subpoena Tobin. On this point, Doar notes that he did not subpoena FBI witnesses for the proceedings, but instead requested their appearance by letter. Moreover, the Investigating Committee did not strictly observe the rules of evidence, and Doar told the OIG that if he had known that Tobin had conducted the tests, Doar would have had Malone read the relevant report into the record. Doar also says he would not have presented certain testimony by Malone if the latter had told him Tobin had done the test. At the hearing before the Investigating Committee, Malone testified about the examination of the purse and the tensile test results. Malone testified that he microscopically examined the original separation in the purse strap. He told the Committee: After examining the separation, I concluded that most of the separation wasn\n\n'\n\nt a tear at all, it was a cut, and this was very, very apparent. With regard to the tensile test, Malone stated: [W]e kind of had to jury rig it to get it to hold it, in other words, to make some adaptions. But after a while of kind of fiddling around with it, we were able to make the machine hold it in such a way that we could do the test. Malone then described the results of the test: When we broke the strap, we recorded the amount of force to break the strap. It was 29.9 pounds of pulling force. It was the exact same reading for both straps. Doar then asked Malone,\n\nAnd did you actually, yourself, conduct this test?\n\nMalone answered,\n\nYes, I did.\n\nMalone\n\n'\n\ns testimony that the strap broke at 29.9 pounds used the same figure that appears in Doar\n\n'\n\ns notes from his meeting with Malone the previous day. The dictation prepared by Tobin, however, referred to 29.5 and 29.0 pounds. Before the Committee, Malone generally talked about the strap breaking at 29.9 pounds. The judges on the Investigating Committee questioned Malone further about the meaning of the 29.9 pound figure. Malone responded,\n\nWell, it means, number one, it\n\n'\n\ns a lot more than an average person could exert. . . .\n\nJudge Tjoflat asked,\n\nIf you are going to take the strap and hang it from something, that means you would put 29.9 pounds on the bottom and the gravity would cause it to break? Is that what you mean?\n\nMalone responded: I think it\n\n'\n\ns a little more than that. You are getting out of my area of expertise now as far as exactly what that figure means. I am a person who does microscopic examinations, and I had to use the machine in order to break it, and I recorded this figure. The first thing I did from my own practical thing was try and break it myself. I couldn\n\n'\n\nt even -- Judge Godbold then stated,\n\nI understand your testimony that you couldn\n\n'\n\nt break it, yourself. What I am trying to figure out is what 29.9 tells us apart from your inability to break it manually.\n\nMalone answered,\n\nOther than saying how many pounds it took to break the strap, it\n\n'\n\ns a meaningless figure.\n\nJudge Godbold later returned to the issue by asking,\n\nNow, as to whether the machine at 29.5 is pulling harder than you were able to pull manually, I take it you can\n\n'\n\nt answer that.\n\nMalone responded,\n\nThat\n\n'\n\ns correct.\n\nThe judge then asked,\n\n[D]o you have an opinion as to whether the machine was pulling with greater force than you were able to pull manually, bearing in mind that the machine broke two pieces of the strap and that you could not break the strap.\n\nMalone answered,\n\nYes. In my opinion, it was pulling much harder than myself.\n\nAfter Malone testified before the Investigating Committee, Doar on October 5, 1985, wrote to the FBI liaison officer on the case, Dennis Aiken, asking the FBI to conduct further investigation to determine the static force required to break the strap on the purse. Doar\n\n'\n\ns letter stated,\n\nWe understand that the strap was inserted in a device which exerts pressure on two sides of the strap and that the machine measured 29.5 pounds when the strap parted. Please relate this number so that its significance can be appreciated.\n\nDoar also requested photographs of the two ends of the strap where the initial separation occurred. As a result of Doar\n\n'\n\ns request, Tobin prepared a report dated November 7, 1985, which further explained the 29.5 pound figure. The report stated that\n\n[i]t was concluded that a force of approximately 7 pounds had been exerted to break the strap after it had been partially cut.\n\nThe report also stated that\n\n29\n\n2\n\npounds is not difficult for an individual of\n\naverage\n\n'\n\nbuild to achieve by\n\npulling\n\n'\n\n; a force of 7 pounds is very easily exerted. In fact, a force up to the actual weight of an individual can readily be exerted.\n\nWhen Tobin prepared this report, he did not know what Malone\n\n'\n\ns testimony had been concerning the pulling force needed to break the strap. On November 20, 1985, Doar received a copy of the November 7, 1985, report. This report does not state that Tobin conducted the tensile test or prepared the report, although the initials\n\nRU\n\nappear on the report and these initials were the Laboratory\n\n'\n\ns code for Tobin. Doar says that he did not know Tobin had done the tensile test until he was interviewed by the OIG during our investigation. Neither Malone\n\n'\n\ns September 30, 1985, report nor Tobin\n\n'\n\ns November 7, 1985, report was offered as an exhibit in the proceedings before the Investigating Committee. The Committee did receive the purse, the strap, and certain photographs related to the examination of the purse as exhibits. Malone testified again before the Investigating Committee on April 8, 1986. He then told the Committee that the purse strap had been subjected to a slow, steady pulling force on the tensile tester and had broken when it reached approximately 29.5 pounds of pulling force. Malone also testified that when the purse was first received in the Laboratory, he had microscopically examined the two broken ends of the strap and concluded that they had previously been joined together in one piece. Consistent with his earlier testimony, Malone again testified that the strap had been both partially cut in two and torn. The Investigating Committee described its investigation and conclusions in a 1986 report to the Judicial Council for the Eleventh Circuit. The report is in three volumes: the first two describe the investigation and summarize the evidence received by the Committee, while the third presents the Committee\n\n'\n\ns analysis of the evidence and findings. With regard to Malone, the report states in volume 2: Agent Malone testified that his microscopic examination of the strap revealed that most of the separation\n\nwasn\n\n'\n\nt a tear at all, it was a cut, and this was very, very apparent.\n\nHe based this on his original examination of the severed ends of the strap and his examination of subsequent test breaks. The Investigative Committee\n\n'\n\ns report does not otherwise refer to the tensile test. Volume 3 of the report discusses the Committee\n\n'\n\ns analysis of the evidence on various issues. That discussion, which spans forty pages of the report, does not explicitly refer to Malone\n\n'\n\ns testimony, but does observe that Hastings\n\n'\n\ntestimony concerning a purse was\n\ntroublesome because the strap which Judge Hastings claimed he tried to have repaired was not torn, worn, or broken; it was cut.\n\nBased on its nearly three-year investigation, the Investigating Committee concluded that: The evidence, considered in its totality, clearly and convincingly establishes that Judge Hastings was engaged in a plan designed to obtain a payment of money from defendants facing jail sentences imposed in his court by promising that with the payment they would receive lenient non-jail sentences. The report identifies thirty-two separate factual findings supporting this conclusion. In addition to finding that Hastings and Borders had agreed on the bribery scheme, the Investigating Committee identified fifteen points on which Hastings had presented false testimony at his criminal trial and found that he had introduced three fabricated documents as evidence. These findings do not refer to the purse, the purse strap, Malone, or the tensile test. C. Tobin\n\n'\n\ns 1989 Complaints about Malone\n\n'\n\ns Testimony In September 1986, the Judicial Council of the Eleventh Circuit accepted and approved the Investigating Committee\n\n'\n\ns report and concluded that Hastings had engaged in misconduct that might constitute grounds for impeachment. The Judicial Council made a certification to this effect to the Judicial Conference of the United States, which in March 1987 certified to the House of Representatives its concurrence in the Council\n\n'\n\ns determination that impeachment might be warranted. After the House returned articles of impeachment, the Senate in October 1989 voted to remove Hastings from his judicial office. Attorney Alan Baron served as impeachment counsel for the House of Representatives and as prosecuting counsel for the Senate in connection with the Hastings impeachment. Baron told the OIG that he did not offer testimony by Malone in the impeachment proceedings before the House or the Senate, that he thought Malone\n\n'\n\ns testimony before the Investigating Committee was confusing, and that the evidence concerning the purse was peripheral. Malone\n\n'\n\ns testimony before the Investigating Committee and the Laboratory reports dated September 30, 1985, and November 7, 1985, were not made exhibits in the proceedings before the House or the Senate. The articles of impeachment returned by the House of Representatives and the accompanying report of the House Committee on the Judiciary do not refer to the purse, the purse strap, Malone, or the tensile test. During the impeachment proceedings, Tobin and Malone, along with certain other potential FBI witnesses, were told by the FBI Office of Congressional Affairs to\n\nstand by\n\nshould their testimony be needed. Neither Tobin nor Malone ultimately testified before Congress. In preparing for possible testimony, however, Tobin in August 1989 reviewed Malone\n\n'\n\ns 1985 testimony before the Investigating Committee. Tobin says this was the first time he had seen Malone\n\n'\n\ns testimony. Tobin recalls that upon reviewing Malone\n\n'\n\ns testimony, he immediately contacted Kenneth Nimmich, then the chief of the SAS, to discuss problems Tobin saw in the testimony. Tobin says that, in a brief conversation, he indicated to Nimmich that there was a\n\npotential serious problem\n\nthat could be very embarrassing to the FBI regarding\n\nevidence manipulation\n\nand some\n\nvery inappropriate presentation of the data.\n\nHe further recalls telling Nimmich that Malone had testified inappropriately and inaccurately, and says he also described Malone\n\n'\n\ns testimony as\n\nmisrepresented\n\nand\n\nfalse.\n\nNimmich, Tobin states, asked Tobin to provide a document detailing Tobin\n\n'\n\ns exceptions to Malone\n\n'\n\ns testimony. Tobin says that within several days of his meeting with Nimmich, he prepared a memorandum describing his concerns about Malone\n\n'\n\ns testimony. The memorandum, which is addressed to Nimmich and not dated, states: [A]n audience was requested with you late in the day of August 3, 1989, wherein you requested the specific details of my objections, my exceptions to SA Malone\n\n'\n\ns testimony and technical analysis as to the effect of the testimony. Attached hereto are the requested exceptions and analysis, as well as two photographs of test breaks. Tobin\n\n'\n\ns memorandum details serious concerns about Malone\n\n'\n\ns testimony. According to Tobin, he first gave the memorandum to his unit chief, Roger Aaron. Aaron recalls discussing the concerns with Tobin, and Aaron wrote on the memorandum,\n\nSad to say, you are right on every point. This has to be done.\n\nTobin says that after he talked with Aaron, he placed a copy of the memorandum in an envelope and either delivered it to Nimmich in person or placed it in Nimmich\n\n'\n\ns in-box. Neither Tobin nor Aaron recalls hearing anything more about the matter after Tobin prepared his memorandum. Tobin also says he did not at the time discuss his concerns with anyone other than Nimmich and Aaron. In his memorandum, Tobin criticized Malone for testifying that he had done the tensile test and other things, such as taking photographs, labeling evidence, and making test tears, that Tobin had in fact done. Tobin also took issue with Malone\n\n'\n\ns testifying that it had been necessary to\n\njury rig\n\nthe test device. Tobin wrote,\n\nThe equipment was designed for any solid material of suitable configuration. The testing was in conformance with the Frye and\n\ngenerally accepted guidelines\n\n'\n\nrules, contrary to the manner in which the testimony was presented.\n\n(emphasis in original). Tobin also found areas where Malone misused metallurgical terms or was inaccurate. Tobin\n\n'\n\ns more serious allegations centered on Malone\n\n'\n\ns testimony that the force needed to break the strap was\n\na lot more than the average person could exert.\n\nTobin wrote that this testimony was in\n\n[d]irect contradiction to laboratory (AE) findings supported by data. Presents apparently and potentially exculpatory information as incriminating.\n\nHe also stated that Malone\n\n'\n\ns testimony that the 29.5 figure was\n\nmeaningless\n\nis\n\nnot true.\n\nWith regard to how the tear was created during the test, Tobin wrote that Malone\n\n'\n\ns testimony was a\n\n[c]ompletely fabricated failure propagation assessment.\n\nTobin complained that Malone\n\n'\n\ns testimony about the test breaks\n\nsuppresses apparent exculpatory material behavior and presents test specimens as incriminating data.\n\nTobin ended his memorandum, however, by stating that\n\n[o]verall, the exceptions to the testimony of SA Malone do not affect the technical assessment that the purse strap has been cut.\n\nThe Laboratory apparently did not further investigate the serious allegations made by Tobin about Malone\n\n'\n\ns testimony. Malone told the OIG that sometime after Hastings was impeached, Nimmich stopped him briefly in a hallway and said that Tobin had made an allegation against him. Nimmich, according to Malone, said that he had looked into the allegation and had concluded that\n\nthere was nothing to it.\n\nMalone said that before the OIG investigation, he was never questioned by anyone about his testimony before the Investigating Committee or Tobin\n\n'\n\ns allegations, and he did not confront Tobin about the allegations. When Nimmich reviewed Tobin\n\n'\n\ns memorandum during the OIG investigation, he said he did not recall ever seeing it before, the allegations it described, or discussing the matter with Tobin. Although Nimmich did not deny that Tobin might have raised these matters with him, he said that if he had received Tobin\n\n'\n\ns memorandum, he would have himself sent a memorandum to the Laboratory\n\n'\n\ns Director and asked Malone to respond to the allegations. If it appeared Malone had acted inappropriately, Nimmich said he would have referred the matter to the FBI OPR. Upon checking his calendar, Nimmich found references to two meetings on August 3, 1989, regarding the Hastings case. The first notes a meeting at 8:00 a.m. with Tobin, Malone, and another person who appears to have been Daniel Dzwilewski, who then worked in the FBI\n\n'\n\ns Office of Congressional Affairs and who coordinated the appearance of witnesses before Congress for the impeachment proceedings. The second reference is for 4:00 p.m. and simply notes:\n\nAaron - Tobin - re Hastings Case.\n\nThrough our investigation, we could not confirm that Nimmich met with the persons indicated on his August 3, 1989, calendar. Nimmich does not recall any such meetings. Dzwilewski says that it is conceivable that he met with Nimmich, Tobin, and Malone, but he does not recall doing so. Both Tobin and Malone say that they did not ever meet together with Nimmich regarding the Hastings case. Aaron said he did not have a substantive conversation with Nimmich regarding Tobin\n\n'\n\ns allegations, and Tobin says he did not inform Nimmich about Aaron\n\n'\n\ns views on the matter. D. Analysis Based on our investigation, we conclude that Malone, in his 1985 testimony before the Investigating Committee, falsely testified that he had himself performed the tensile test and that he testified outside his expertise and inaccurately concerning the test results. The OIG questioned Malone about Tobin\n\n'\n\ns allegations and, to his credit, Malone agreed with many points that Tobin had raised. Malone maintained, however, that he was justified in giving certain testimony because he was offering his own personal opinions rather than expert opinions. This is not a persuasive rationale for the presentation of inaccurate testimony by a Laboratory examiner. Before the Investigating Committee, Malone testified falsely when he responded\n\nyes\n\nto the question,\n\ndid you actually, yourself, conduct this test?\n\nIn his OIG interview, Malone admitted he was\n\ntechnically wrong\n\nin his response but noted he had been\n\nright there\n\nwhen the test was conducted. Malone\n\n'\n\ns presence when the test was performed does not justify his inaccurate response to the question whether he actually conducted the test. Malone\n\n'\n\ns testimony that he conducted the test is particularly egregious, because he proceeded to inaccurately describe how the test was performed and the significance of its results. Malone, as noted above, testified that 29.9 pounds of force is\n\na lot more than the average person could exert.\n\nIn an interview with the OIG, Malone said this statement was his own\n\nlayman\n\n'\n\ns opinion\n\nbased upon the fact that he was not able to break the strap manually. Malone was testifying outside his expertise and evidently did not understand the meaning of the 29.9 pound figure. He incorrectly told the Investigating Committee that\n\n[s]ince nobody in our unit or our lab had ever done a test like this, and I have never heard of any studies being published, it\n\n'\n\ns almost a meaningless figure other than it\n\n'\n\ns a lot more than an average person could exert.\n\nHe later admitted that the questions were\n\ngetting outside of [his] area of expertise,\n\nbut he proceeded to again say that 29.9 pounds was\n\na meaningless figure.\n\nMalone\n\n'\n\ns testimony on this issue was inaccurate and unacceptable. Tobin in his 1989 memorandum noted that Malone\n\n'\n\ns testimony was contradicted by the findings in Tobin\n\n'\n\ns November 7, 1985, report. This report was not completed until nearly one month after Malone testified before the Investigating Committee in October 1985, and we did not find evidence establishing that Malone knew the information in the report when he then testified. Thus, we do not find that Malone knowingly or deliberately testified in contradiction to Tobin\n\n'\n\ns conclusions as described in the November 7, 1985, report. Moreover, Malone\n\n'\n\ns testifying that he actually conducted the test, combined with other facts, causes us to believe Malone is incorrect in now claiming that he told Doar in 1985 that Tobin had conducted the test. As noted above, Doar states that Malone did not tell him, and he did not otherwise know, that Tobin had done the work. Doar\n\n'\n\ns notes of his meeting with Malone do not refer to Tobin, and the questions Doar asked during Malone\n\n'\n\ns testimony suggest Doar thought Malone conducted the test. Malone\n\n'\n\ns statement to the OIG that Doar said in 1985 he had forgot to subpoena Tobin is not credible. We conclude that Doar did not know during the Investigating Committee proceedings that Malone had not performed the tensile test. Recognizing that we are reviewing events that occurred more than ten years ago, and given the record now before us, we are not able to find that Malone engaged in intentional misconduct by failing in 1985 to tell Doar that Tobin had performed the test or by inaccurately describing to the OIG his conversations with Doar before Malone testified. Malone also testified inaccurately about other matters outside his expertise. For instance, regarding the break in the purse strap, Malone testified before the Investigating Committee that he\n\nobserved that it\n\n'\n\ns not a sudden break like you would have with a metal. When a metal breaks, bam, it\n\n'\n\ns gone, it\n\n'\n\ns broken, it\n\n'\n\ns instantaneous.\n\nTobin noted that the statements about metals were\n\n[i]ncorrect. In fact, designers and users abhor sudden breaks because of the potential for catastrophic loss of life. Designers, therefore, attempt to insure gradual failures so that it is not instantaneous.\n\nMalone acknowledged to the OIG that he might have been wrong on this point, but said that he was conveying his own personal opinion that metal breaks suddenly. The testimony that Malone gave before the Investigating Committee cannot be excused by his explanation that he was offering his\n\npersonal opinion\n\nbased on his own experience or subjective beliefs. Laboratory examiners generally are proffered as witnesses because they have expertise and can offer opinions based on their scientific examination of evidence. The questions that Doar asked Malone suggest that Doar thought that Malone had conducted the test and was competent to explain the results. By failing to tell Doar that Tobin had performed the tests, Malone not only misled the special counsel but may also have caused him to forgo the testimony of another expert who was appropriately qualified to answer certain questions raised by the Committee about the tensile test. In testifying before the Investigating Committee, Malone should have candidly stated that he did not perform the tensile test and could not explain the significance of its results. The transcript instead suggests that when Malone was asked questions outside his expertise about the tensile test, he resorted to fabrication rather than admitting he did not know the answer. After reviewing Malone\n\n'\n\ns testimony, Tobin observed, and we agree, that\n\nit appears that someone\n\n'\n\ns under pressure to be specific and can\n\n'\n\nt because he doesn\n\n'\n\nt have any personal knowledge of the actual physical phenomena that are occurring, and therefore, seems to make up, based upon very limited amount of information, a sequence of events that just flat didn\n\n'\n\nt occur.\n\nWe recognize that the inaccuracies in Malone\n\n'\n\ns testimony do not appear to have had any effect on the Investigating Committee\n\n'\n\ns ultimate findings and recommendation. Tobin himself acknowledged in his 1989 memorandum that his complaints about Malone\n\n'\n\ns testimony did not affect the technical assessment that the strap had been cut. Moreover, the thirty-two factual findings supporting the Investigating Committee\n\n'\n\ns conclusion do not refer to Malone, the tensile test, or the purse. Both John Doar, the counsel for the Investigating Committee, and Chief Judge Gerald Tjoflat, who served on the Committee, told the OIG that Malone\n\n'\n\ns testimony did not influence the Committee\n\n'\n\ns findings. Although these facts indicate that Malone\n\n'\n\ns misstatements did not affect the outcome of the Investigating Committee proceedings, they do not in our view excuse Malone\n\n'\n\ns conduct. We cannot understand the Laboratory\n\n'\n\ns failure to further investigate the allegations that Tobin made regarding Malone\n\n'\n\ns testimony. We could not confirm that Nimmich in fact reviewed Tobin\n\n'\n\ns 1989 memorandum, but we are persuaded that Tobin expressed his concerns orally to Nimmich. Tobin says he did so, and, as noted above, Malone recalls that Nimmich told him that Tobin had made an allegation and that Nimmich had determined there was\n\nnothing to it.\n\nAaron also recalls Tobin telling him in 1989 that he had met with Nimmich, expressed his concerns about Malone\n\n'\n\ns testimony, and that Nimmich had asked Tobin to put his complaints in writing. Such a direction, Aaron noted, was an indication the matter was serious. Given the serious nature of Tobin\n\n'\n\ns allegations, Nimmich should have taken steps to assure that they were adequately investigated, even if for some reason Nimmich did not ever receive Tobin\n\n'\n\ns memorandum. If Nimmich did in fact conclude the allegations were unfounded, he did so without adequate justification. Nimmich should have assured in 1989 that Malone and Tobin were interviewed, that the matter was otherwise appropriately investigated, and that the resolution was documented. Such an investigation could have resulted in appropriate administrative discipline and conceivably a referral for investigation for possible criminal misconduct. Nimmich acknowledged to the OIG that Malone\n\n'\n\ns claiming to have performed tests he had not conducted should, at the least, have resulted in a reprimand. We did not find any evidence that Tobin\n\n'\n\ns allegations were appropriately investigated or resolved by anyone in FBI management. The concerns raised by Tobin in 1989 also evidently were not then communicated to Congress or otherwise outside the FBI. Alan Baron told the OIG that he did not know until recently that Tobin had made any allegations about Malone\n\n'\n\ns 1985 testimony. Similarly, Hastings and Terence Anderson, an attorney who has represented Hastings since 1981 and who represented him in the impeachment proceedings, said that they first learned through media reports in February 1997 that Tobin had criticized Malone\n\n'\n\ns testimony. Tobin states that in 1989, he discussed his concerns only with Nimmich and Aaron. He also recalls that he told Aaron he would deal directly with Nimmich and he asked Aaron not to get involved in the matter himself. Tobin further says that Aaron returned to him the copy of the undated memorandum that Aaron reviewed, and Tobin says that he did not give the memorandum to anyone other than Nimmich until years later. Finally, Tobin says that when he prepared the memorandum, he intended to defer to Nimmich if the latter thought it did not warrant additional action. Aaron did not approach Nimmich to discuss the matter, and says that while he may have mentioned the matter to Malone\n\n'\n\ns unit chief, he does not specifically recall doing so. Alan Robillard, who was the chief of Malone\n\n'\n\ns unit in August 1989, says he only recently learned from news accounts that Tobin had made allegations concerning Malone\n\n'\n\ns testimony related to the Hastings proceedings. John Hicks, who became Laboratory Director in August 1989, says he did not know of Tobin\n\n'\n\ns allegations regarding Malone. Bernardo Perez, who served as Deputy Assistant Director in the Laboratory from May 1989 through March 1991, does not recall being aware of these allegations and says that if this matter had been brought to his attention, he would have sent a memorandum to the FBI OPR and to FBI legal counsel. Daniel Dzwilewski, who coordinated the appearance of FBI witnesses in the congressional impeachment proceedings, told the OIG that he did not know of Tobin\n\n'\n\ns criticisms of Malone\n\n'\n\ns testimony until he was advised in March 1997 that he would be interviewed as part of the OIG investigation. Given these facts, and Nimmich\n\n'\n\ns claim that he does not recall this matter at all, we are unable to conclude that there was a deliberate or concerted effort within the FBI to conceal Tobin\n\n'\n\ns allegations about Malone\n\n'\n\ns testimony. IV. Conclusion We conclude that the Laboratory would benefit from a clear delineation of responsibilities between units with respect to metals-related examinations, better communication among examiners in this area, and recognition that differences among examiners should be resolved on a scientific basis. We also conclude that the EU should take steps to assure that its examiners properly conduct and report their examinations of wires or other metals-related evidence. With regard to both the issue of the EU\n\n'\n\ns measurement of wire gauge and the controversy over the examination of holes in pipes in the La Familia case, we think EU Chief J. Thomas Thurman should have focused more on assuring that EU examiners were reporting the results of examinations in an appropriate manner. William Tobin displayed poor judgment by failing to discuss his concerns in the La Familia case with the principal examiner before Tobin issued his revised dictation. We also think that Tobin and FTU examiner Michael Ennis should have taken further steps, with involvement by their unit chiefs if necessary, to attempt to resolve the apparent differences in their conclusions about the holes found in the pipes. Because they did not reconcile their opinions on a scientific basis, Tobin and Ennis might have contradicted each other if they had testified about the results of their examinations. In the Alcee Hastings case, we find that Michael Malone testified falsely and outside his expertise in discussing tensile tests performed by the Laboratory. Moreover, after Tobin raised concerns about Malone\n\n'\n\ns testimony in 1989, then-SAS Chief Kenneth Nimmich failed to assure that the serious allegations of examiner misconduct were appropriately investigated and addressed. In reviewing Tobin\n\n'\n\ns allegations, we also identified ways in which the policies or the practices of the Laboratory could be improved: (1) Laboratory management must assure that disputes about methodology or the interpretation of data -- such as those illustrated by the wire gauge issue or the examinations in the La Familia case -- are resolved professionally based on the pertinent scientific knowledge and that the resolution is communicated to those involved. (2) There also appears to be a need, which the Laboratory seems to recognize, for clearer delineation of the respective roles of different units in the area of metallurgy and for improved communication between units. Defining the roles more clearly and improving communication should help to assure that the Laboratory\n\n'\n\ns conclusions are reasonably supportable and properly reported, and should also reduce unnecessary conflict between units. (3) The Laboratory should adopt guidelines for examiner testimony that, among other things, direct examiners to be accurate and to remain within their expertise in testifying. The Laboratory might also benefit from procedures aimed at identifying which examiner or other representative of the Laboratory is best able to testify on particular issues. The Laboratory also should implement an effective program for monitoring the testimony of its examiners. Such guidelines and procedures would have helped to avoid problems like those evidenced by Malone\n\n'\n\ns testimony in the Hastings matter. (4) Laboratory management must assure that concerns about the quality of the Laboratory\n\n'\n\ns work, such as those raised by Malone\n\n'"}, {"url": "https://www.chicagotribune.com/news/ct-xpm-1996-01-11-9601110073-story.html", "page_content": "INDIANAPOLIS — If Bill Tobin has turned around the Indianapolis Colts three years after leaving the Bears, it raises the question of whether Chicago made a mistake in turning away its player-personnel director when Dave Wannstedt was hired in 1993.\n\nTobin has more power as Colts vice president and director of football operations than the Bears ever gave him. Now he is one victory from the Super Bowl and universal acclaim as one of the NFL's shrewdest architects.\n\nAdvertisement\n\nShould the Colts' joy ride continue Sunday with a victory at Pittsburgh in the AFC championship game, more questions will be asked about whether Tobin as general manager and Wannstedt as coach couldn't have been a harmonious and winning arrangement at Halas Hall.\n\nPerhaps Wannstedt would have spurned the Bears in that case, since he didn't accept a New York Giants job offer that would have left personnel decisions in the hands of General Manager George Young. Dan Reeves is now chafing under that yoke.\n\nAdvertisement\n\nBut in the two years of drafts since Tobin and the Bears parted, his selections have shown a more immediate dividend than Wannstedt's. For while Wannstedt doesn't own the GM title, he nonetheless is the final word in any personnel judgments and is responsible for acting on his scouting staff's recommendations.\n\nTobin and Wannstedt would have disagreed, however, from the start.\n\nTobin wouldn't have drafted Curtis Conway with the Bears' first pick in April 1993. His wide receiver choice would have been O.J. McDuffie, who made 62 catches for 819 yards and eight touchdowns with Miami this season, as well as a 24.5-yard kick-return average.\n\n\"We had McDuffie rated higher than Conway and, if I was going to be there, we needed a good player right away and not any spoiled guy from L.A.,\" Tobin said Wednesday. Conway, who led the Bears with 12 touchdown catches in 1995, \"may be a great player, but he was not my best wide receiver.\"\n\nTobin was a lame-duck player-personnel director at the time. Coach Mike Ditka had been fired after a 5-11 record in 1992, and Tobin was in the Halas Hall draft room in 1993 mainly as a traffic cop, overseeing the grading of the draftees with Bear scouts. He didn't have an ounce of influence in final decisions in his last official act as a Bear.\n\nA second disagreement would have come over Jim Harbaugh, the quarterback the Bears waived in March 1994. Harbaugh happens to be leading the Colts onward and upward.\n\nTobin's 1994 draft, in contrast to Wannstedt's, had staying power. Seven of his first eight picks finished the season on the Colts' active roster.\n\nThe Bears, on the other hand, took offensive tackle Marcus Spears in the second round in 1994, and defensive lineman Pat Riley and punter-kicker Todd Sauerbrun in Round 2 of 1995. Spears and Riley basically didn't play this season, when the Bears went 9-7 and missed the playoffs. Sauerbrun was a spectacular dud.\n\nAdvertisement\n\nTobin refuses to assess the Bears' drafts the last two years, feeling it's not his place. He prefers to talk about his top two draft picks in 1994: running back Marshall Faulk (now out with a knee injury) and Trev Alberts, a key to the Colts' shifting defense from a 4-3 to a 3-4 with his ability to play linebacker or end. Alberts doesn't start, but has been involved in 68 percent of the total plays.\n\nRookie defensive tackle Ellis Johnson, Tobin's first-round pick in 1995, remains a work in progress, but he started in place of an ill Tony Siragusa in Sunday's victory in Kansas City. Ex-Illini tight end Ken Dilger, Tobin's second pick from 1995, was the Colts' third-leading receiver this season with 635 yards, and his four receiving touchdowns tied for the team lead.\n\nCompare the impact of Faulk on the Colts and that of defensive end John Thierry, the Bears' first-rounder in 1994, on Chicago, and Tobin wins the comparison hands down at this point. Compare Dilger with Sauerbrun and Riley, and the same applies.\n\n\"Next season Thierry can be the Conway of 1995,\" Wannstedt contends, believing that with time, Thierry will mature on the line the way Conway did this season as a big-play receiver.\n\nOthers can argue the Bears would be better off with Tobin still working at Halas Hall, still offering his learned and diversified opinion of college talent. Tobin thinks the separation was needed.\n\n\"It was time to leave when I left,\" he said. \"I had 18 good years in Chicago. But my contract was being overriden by what (Bears President Mike McCaskey) promised Dave. The philosophy was changing and went against my principles, what I believed to be true.\"\n\nAdvertisement\n\nTobin didn't just bring in talent in Indy.\n\n\"We found some players here they didn't know they had. Tony McCoy was sitting on the bench. They had Ray Buchanan at corner, and David Tate wasn't here. Stephen Grant was just a name. Quentin Coryatt was playing out of position.\n\n\"We signed selective free agents. We gave Tony Bennett a lot of money, but he's everything we thought he was. Harbaugh was adrift, and after I traded Jeff George I signed him. Harbaugh's a winner and a leader.\"\n\nTobin thinks delegating authority is the key principle to success.\n\n\"Just leave people alone and, if you listen to them, some of your decisions are easy. You'll have problems if you try to make their decisions for them.\"\n\nThe Bears decided they could stop listening to Tobin in 1993. In two of the three years since, they haven't been to the playoffs."}]}