{"Bill Tobin (born October 28, 1945) is an American football executive who has served in various capacities in the National Football League (NFL).": [{"url": "https://www.wikiwand.com/en/Bill_Tobin_(American_football)", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about Bill Tobin (American football)?\n\nSummarize this article for a 10 years old"}, {"url": "https://wikimili.com/en/Bill_Tobin_(American_football)", "page_content": "Nathan D. Clements is a former American football cornerback in the National Football League (NFL). He played college football for Ohio State. He was drafted by the Buffalo Bills 21st overall in the 2001 NFL Draft, and also played for the San Francisco 49ers and Cincinnati Bengals.\n\nFrank Michael Reich III. is an American football coach and former quarterback who is the head coach for the Carolina Panthers of the National Football League (NFL). He played college football at Maryland and was selected by the Bills in the third round of the 1985 NFL Draft. Reich spent most of his career backing up Jim Kelly, although he achieved recognition when he led the Bills to the NFL's largest postseason comeback during the 1992–93 NFL playoffs.\n\nThe 1992 NFL season was the 73rd regular season of the National Football League (NFL). Due to the damage caused by Hurricane Andrew, the New England Patriots at Miami Dolphins game that was scheduled for September 6 at Joe Robbie Stadium was rescheduled to October 18. Both teams originally had that weekend off. This marked the first time since the 1966 NFL season and the AFL seasons of 1966 and 1967 that there were byes in week 1.\n\nMichael Allen Doss is an American former football safety who played in the National Football League (NFL) for six seasons. He played college football for Ohio State University, earned consensus All-American honors, and was a member of the 2002 national championship team. He was drafted in the second round of the 2003 NFL Draft by the Indianapolis Colts, with whom he played four seasons with, including during the team's 2006 Super Bowl season. Doss then spent one season with the Minnesota Vikings and Cincinnati Bengals each before retiring.\n\nVincent Michael Tobin is an American football coach and former college player who was the head coach of the Arizona Cardinals of the National Football League (NFL). During his four decades of coaching, he served as defensive coordinator for college, NFL, and Canadian Football League (CFL) teams.\n\nTheodore Joseph Marchibroda was an American football quarterback and head coach in the National Football League (NFL). He spent his four years as an active player with the Pittsburgh Steelers and Chicago Cardinals (1957). He was later head coach of the Colts in two different cities and decades, first in Baltimore during the 1970s and then Indianapolis during the 1990s. Upon joining the Baltimore Ravens in a similar capacity in 1996, he became the only individual to serve as head coach with both of Baltimore's NFL teams. His career coaching record was 87–98–1 (.470) and 2–4 in the playoffs.\n\nThe 1994 NFL draft was the procedure by which National Football League teams selected amateur college football players. It is officially known as the NFL Annual Player Selection Meeting. The draft was held April 24–25, 1994, at the Marriott Marquis in New York City, New York. The league also held a supplemental draft after the regular draft and before the regular season. This was the first draft in which the rounds were reduced to seven in total.\n\nTroy McHenry Walters is an American football coach and former player who is the wide receivers coach for the Cincinnati Bengals of the National Football League (NFL). Walters played as a wide receiver and punt returner in the National Football League (NFL) for eight seasons. Walters played college football for Stanford University, was a consensus All-American and was recognized as the most outstanding college wide receiver in the country by winning the Biletnikoff Award. He was selected in the fifth round of the 2000 NFL Draft by the Minnesota Vikings, and also played for the Indianapolis Colts, Arizona Cardinals and Detroit Lions of the NFL.\n\nPaul Donald Justin is a former American football quarterback primarily for the Indianapolis Colts of the National Football League (NFL). He was drafted by the Chicago Bears in the 7th round of the 1991 NFL Draft. He played college football for Arizona State. He had brief stints with the Cincinnati Bengals and St. Louis Rams. Prior to his time in the NFL, he was the starting quarterback for the Arizona Rattlers of the Arena Football League (AFL) and the Frankfurt Galaxy of the World League of American Football (WLAF).\n\nJohn William Standeford is a former American football wide receiver. He played college football at Purdue, and signed with the Washington Redskins as an undrafted free agent in 2004. He also played for the Indianapolis Colts, Detroit Lions, Florida Tuskers, Cincinnati Bengals, and Virginia Destroyers. As a member of the Colts, Standeford won Super Bowl XLI, defeating the Chicago Bears.\n\nJamaal Anderson is a former American football defensive end. He was drafted by the Atlanta Falcons eighth overall in the 2007 NFL Draft. He played college football at Arkansas.\n\nHard Knocks is a reality sports documentary television series produced by NFL Films and HBO. The show was first broadcast in 2001, and the current 2022 season is the 17th and 18th. Each season, it follows a National Football League (NFL) team through its training camp and covers the team's preparation for the upcoming football season. Starting with the 2021 season there will be an in season version of Hard Knocks following a different team than the training camp version.\n\nChase Allen Coffman is a former American football tight end. He played college football for the University of Missouri, earned consensus All-American honors, and was recognized as the best college tight end in the country. He was chosen by the Cincinnati Bengals in the third round of the 2009 NFL Draft.\n\nDaniel \"Boom\" Herron is a former American football running back. Herron played football at Warren G. Harding High School in Warren, Ohio, and later Ohio State University. He was drafted in the sixth round of the 2012 NFL draft by the Cincinnati Bengals, and also played for the Indianapolis Colts and Buffalo Bills.\n\nThe Indianapolis Colts are a professional American football team based in Indianapolis, Indiana. They play in the South Division of the American Football Conference (AFC) in the National Football League (NFL). The organization began play in 1953 as the Baltimore Colts with the team located in Baltimore, Maryland; it relocated to Indianapolis following the 1983 season.\n\nWalter Mendenhall is a former American football running back. He played college football at Illinois from 2005 to 2007 before transferring to Illinois State University where he played in 2008. He was signed by the Philadelphia Eagles as an undrafted free agent in 2009 and has also been a member of the Indianapolis Colts, Buffalo Bills and Cincinnati Bengals. He is the brother of former Arizona Cardinals running back Rashard Mendenhall.\n\nTaylor Jonathan Yates is a former American football quarterback and coach who is the wide receivers coach for the Atlanta Falcons of the National Football League (NFL). He played college football at North Carolina and was drafted by the Houston Texans in the fifth round of the 2011 NFL Draft. He has also played for the Atlanta Falcons, Miami Dolphins, and Buffalo Bills.\n\nDuke Tobin is the Director of Player Personnel for the Cincinnati Bengals of the National Football League (NFL). He played in the Arena Football League for the Orlando Predators in 1994 and Memphis Pharaohs in 1995. He played college football at Illinois & Colorado.\n\nMalik Hooker is an American football safety for the Dallas Cowboys of the National Football League (NFL). He played college football at Ohio State and was drafted by the Indianapolis Colts with the 15th overall pick in the 2017 NFL Draft. While at Ohio State, Hooker was named a unanimous All-American in 2016 and won the 2015 CFP national championship."}, {"url": "https://hyperlinked.wiki/wiki.php?slug=Bill_Tobin_(American_football)", "page_content": "American football player and executive (born 1941)\n\nAmerican football player\n\nBill Tobin (born February 16, 1941) is a former professional American football player who is currently a personnel executive for the Cincinnati Bengals of the National Football League (NFL). Tobin played running back for one season for the Houston Oilers. He would later become the general manager of the Chicago Bears and Indianapolis Colts along with the director of player personnel for the Detroit Lions in 2001.\n\nEarly life and education [ edit ]\n\nBill and his brother Vince Tobin both were born on a farm near Burlington Junction, Missouri. Their father Ed Tobin was a basketball captain at the Conception Junction, Missouri high school. The brothers both attended Maryville High School which is 16 miles from Burlington Junction but the family thought their sports prospects would be much better in the much bigger school (they commuted to the school).[1] The brothers who are two years apart in age played on the football teams at the same time both in Maryville and at the University of Missouri football team. Bill played on the 1959 Maryville basketball team that was undefeated until losing the State Class M title game.[2]\n\nTobin attended the University of Missouri, where he played in the Tigers′ backfield next to quarterback Jim Johnson.\n\nCareer [ edit ]\n\nDuring his time with the Indianapolis Colts, he drafted future Hall of Famers Marshall Faulk and Marvin Harrison. He also drafted Ken Dilger, Tarik Glenn, and Adam Meadows, who would be cornerstones of the Colts offensive line. He also built a team in Indianapolis with Jim Harbaugh, who in 1995 led the NFL in passing and had a very successful run in the 1995 NFL playoffs, including the first playoff win for the Colts since Super Bowl V, a span of thirty years. He drafted Ray Buchanan and Ashley Ambrose, who later started for the Falcons in the Super Bowl.\n\nTobin was replaced as Colts general manager in 1997 by Bill Polian. Tobin is the brother of former NFL coach Vince Tobin.\n\nTobin was recently working as a scout for the Cincinnati Bengals.\n\nMel Kiper incident [ edit ]\n\nWhile general manager of the Indianapolis Colts, Tobin gained some notoriety during the television broadcast of the 1994 NFL Draft after being criticized by ESPN analyst Mel Kiper Jr. for picking Nebraska linebacker Trev Alberts with the fifth pick in the draft, instead of Fresno State quarterback Trent Dilfer.\n\nWhile being interviewed by ESPN later in the broadcast, Tobin famously said \"Who in the hell is Mel Kiper anyway?!\"[3] Tobin later called a press conference where he ranted about Kiper for several minutes, stating that Kiper had been biased against the Colts ever since they moved from Baltimore, Kiper's home.[4]"}, {"url": "https://www.webot.org/info/en/?search=Bill_Tobin_(American_football)", "page_content": "American football player and executive (born 1941)\n\nAmerican football player\n\nBill Tobin (born February 16, 1941) is a former professional American football player who is currently a personnel executive for the Cincinnati Bengals of the National Football League (NFL). Tobin played running back for one season for the Houston Oilers. He would later become the general manager of the Chicago Bears and Indianapolis Colts along with the director of player personnel for the Detroit Lions in 2001.\n\nEarly life and education\n\nBill and his brother Vince Tobin both were born on a farm near Burlington Junction, Missouri. Their father Ed Tobin was a basketball captain at the Conception Junction, Missouri high school. The brothers both attended Maryville High School which is 16 miles from Burlington Junction but the family thought their sports prospects would be much better in the much bigger school (they commuted to the school). [1] The brothers who are two years apart in age played on the football teams at the same time both in Maryville and at the University of Missouri football team. Bill played on the 1959 Maryville basketball team that was undefeated until losing the State Class M title game. [2]\n\nTobin attended the University of Missouri, where he played in the Tigers′ backfield next to quarterback Jim Johnson.\n\nCareer\n\nDuring his time with the Indianapolis Colts, he drafted future Hall of Famers Marshall Faulk and Marvin Harrison. He also drafted Ken Dilger, Tarik Glenn, and Adam Meadows, who would be cornerstones of the Colts offensive line. He also built a team in Indianapolis with Jim Harbaugh, who in 1995 led the NFL in passing and had a very successful run in the 1995 NFL playoffs, including the first playoff win for the Colts since Super Bowl V, a span of thirty years. He drafted Ray Buchanan and Ashley Ambrose, who later started for the Falcons in the Super Bowl.\n\nTobin was replaced as Colts general manager in 1997 by Bill Polian. Tobin is the brother of former NFL coach Vince Tobin.\n\nTobin was recently working as a scout for the Cincinnati Bengals.\n\nMel Kiper incident\n\nWhile general manager of the Indianapolis Colts, Tobin gained some notoriety during the television broadcast of the 1994 NFL Draft after being criticized by ESPN analyst Mel Kiper Jr. for picking Nebraska linebacker Trev Alberts with the fifth pick in the draft, instead of Fresno State quarterback Trent Dilfer.\n\nWhile being interviewed by ESPN later in the broadcast, Tobin famously said \"Who in the hell is Mel Kiper anyway?!\" [3] Tobin later called a press conference where he ranted about Kiper for several minutes, stating that Kiper had been biased against the Colts ever since they moved from Baltimore, Kiper's home. [4]"}, {"url": "https://wiki2.org/en/Bill_Tobin_(American_football)", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nAmerican football player and executive (born 1941)\n\nAmerican football player\n\nBill Tobin (born February 16, 1941) is a former professional American football player who is currently a personnel executive for the Cincinnati Bengals of the National Football League (NFL). Tobin played running back for one season for the Houston Oilers. He would later become the general manager of the Chicago Bears and Indianapolis Colts along with the director of player personnel for the Detroit Lions in 2001.\n\nYouTube Encyclopedic\n\n1 / 3 Views: 2 909 935 139 375 275 401\n\nMel Kiper And The Crazy Feud That Changed the TV Draft Forever | NFL 1994 Draft Story\n\nBill Tobin vs Mel Kiper - 1994 Part 2\n\nFrank Caliendo impersonates Mel Kiper Jr. in NFL draft parody (2013) | ESPN Archive Transcription\n\nEarly life and education\n\nBill and his brother Vince Tobin both were born on a farm near Burlington Junction, Missouri. Their father Ed Tobin was a basketball captain at the Conception Junction, Missouri high school. The brothers both attended Maryville High School which is 16 miles from Burlington Junction but the family thought their sports prospects would be much better in the much bigger school (they commuted to the school).[1] The brothers who are two years apart in age played on the football teams at the same time both in Maryville and at the University of Missouri football team. Bill played on the 1959 Maryville basketball team that was undefeated until losing the State Class M title game.[2]\n\nTobin attended the University of Missouri, where he played in the Tigers′ backfield next to quarterback Jim Johnson.\n\nCareer\n\nDuring his time with the Indianapolis Colts, he drafted future Hall of Famers Marshall Faulk and Marvin Harrison. He also drafted Ken Dilger, Tarik Glenn, and Adam Meadows, who would be cornerstones of the Colts offensive line. He also built a team in Indianapolis with Jim Harbaugh, who in 1995 led the NFL in passing and had a very successful run in the 1995 NFL playoffs, including the first playoff win for the Colts since Super Bowl V, a span of thirty years. He drafted Ray Buchanan and Ashley Ambrose, who later started for the Falcons in the Super Bowl.\n\nTobin was replaced as Colts general manager in 1997 by Bill Polian. Tobin is the brother of former NFL coach Vince Tobin.\n\nTobin was recently working as a scout for the Cincinnati Bengals.\n\nMel Kiper incident\n\nWhile general manager of the Indianapolis Colts, Tobin gained some notoriety during the television broadcast of the 1994 NFL Draft after being criticized by ESPN analyst Mel Kiper Jr. for picking Nebraska linebacker Trev Alberts with the fifth pick in the draft, instead of Fresno State quarterback Trent Dilfer.\n\nWhile being interviewed by ESPN later in the broadcast, Tobin famously said \"Who in the hell is Mel Kiper anyway?!\"[3] Tobin later called a press conference where he ranted about Kiper for several minutes, stating that Kiper had been biased against the Colts ever since they moved from Baltimore, Kiper's home.[4]\n\nReferences"}, {"url": "https://peoplepill.com/people/bill-tobin-1/", "page_content": "Bill Tobin (born February 16, 1941) is a former professional American football player who played running back for one season for the Houston Oilers. He would later become the general manager of the Chicago Bears and Indianapolis Colts. He also was director of player personnel for the Detroit Lions in 2001.\n\nTobin attended the University of Missouri, where he played in the Tigers′ backfield next to quarterback Jim Johnson.\n\nDuring his time with the Indianapolis Colts he drafted Hall of Famer Marshall Faulk and future Hall of Famer Marvin Harrison. He also drafted Ken Dilger, Tarik Glenn and Adam Meadows, who would be cornerstones of the Colts offensive line. He also built a team in Indianapolis with Jim Harbaugh, who in 1995 led the NFL in passing and had a very successful run in the 1995 NFL playoffs, including the first playoff win for the Colts since Super Bowl V, a span of thirty years. He drafted Ray Buchanan and Ashley Ambrose who later started for the Falcons in the Super Bowl.\n\nTobin was replaced as Colts general manager in 1997 by Bill Polian. Tobin is the brother of former NFL coach Vince Tobin.\n\nTobin was recently working as a scout for the Cincinnati Bengals.\n\nMel Kiper incident\n\nWhile general manager of the Indianapolis Colts, Tobin gained some notoriety during the television broadcast of the 1994 NFL Draft after being criticized by ESPN analyst Mel Kiper for picking Nebraska linebacker Trev Alberts with the fifth pick in the draft, instead of Fresno State quarterback Trent Dilfer.\n\nWhile being interviewed by ESPN later in the broadcast, Tobin famously said \"Who the hell is Mel Kiper?!\" Tobin later called a press conference where he ranted about Kiper for several minutes, stating that Kiper had been biased against the Colts ever since they moved from Baltimore, Kiper's home."}, {"url": "https://peopleai.com/fame/identities/bill-tobin-american-football", "page_content": "How old is Bill Tobin (American football)? When is Bill Tobin (American football)'s birthday? Where is Bill Tobin (American football) born? Where did Bill Tobin (American football) grow up from? What's Bill Tobin (American football)'s age?\n\nBill Tobin (American football) Born: February 16, 1941 (age 82years), Burlington Junction, Missouri, United States\n\nHow about Bill Tobin (American football)'s sibling?\n\nBill Tobin (American football) Sibling: Vince Tobin\n\nHow tall is Bill Tobin (American football) in meters or centimeters?\n\nBill Tobin (American football) Height: 1.8m\n\nIs Duke Tobin related to Bill Tobin?\n\nAfter his playing career, he joined the Cincinnati Bengals front office. His father Bill Tobin and uncle Vince Tobin have both had numerous jobs with the NFL.\n\nWho is the Bengals GM?\n\nCincinnati Bengals de-factor general manager Duke Tobin emerges looking great in a fresh ranking of general managers around the NFL. While the Bengals haven't officially given out the title despite national outcry about it, Tobin stands in the role and gets the spot on leaguewide rankings for the team.\n\nHow long has Duke Tobin been with Bengals?\n\nDuke Tobin is a football coach in the National Football League (NFL) and has been the general manager for the Cincinnati Bengals since 2022."}, {"url": "https://www.wikizero.com/www//Bill_Tobin_(American_football)", "page_content": "American football player and executive (born 1941)\n\nAmerican football player\n\nBill Tobin (born February 16, 1941) is a former professional American football player who is currently a personnel executive for the Cincinnati Bengals of the National Football League (NFL). Tobin played running back for one season for the Houston Oilers. He would later become the general manager of the Chicago Bears and Indianapolis Colts along with the director of player personnel for the Detroit Lions in 2001.\n\nEarly life and education [ edit ]\n\nBill and his brother Vince Tobin both were born on a farm near Burlington Junction, Missouri. Their father Ed Tobin was a basketball captain at the Conception Junction, Missouri high school. The brothers both attended Maryville High School which is 16 miles from Burlington Junction but the family thought their sports prospects would be much better in the much bigger school (they commuted to the school).[1] The brothers who are two years apart in age played on the football teams at the same time both in Maryville and at the University of Missouri football team. Bill played on the 1959 Maryville basketball team that was undefeated until losing the State Class M title game.[2]\n\nTobin attended the University of Missouri, where he played in the Tigers′ backfield next to quarterback Jim Johnson.\n\nCareer [ edit ]\n\nDuring his time with the Indianapolis Colts, he drafted future Hall of Famers Marshall Faulk and Marvin Harrison. He also drafted Ken Dilger, Tarik Glenn, and Adam Meadows, who would be cornerstones of the Colts offensive line. He also built a team in Indianapolis with Jim Harbaugh, who in 1995 led the NFL in passing and had a very successful run in the 1995 NFL playoffs, including the first playoff win for the Colts since Super Bowl V, a span of thirty years. He drafted Ray Buchanan and Ashley Ambrose, who later started for the Falcons in the Super Bowl.\n\nTobin was replaced as Colts general manager in 1997 by Bill Polian. Tobin is the brother of former NFL coach Vince Tobin.\n\nTobin was recently working as a scout for the Cincinnati Bengals.\n\nMel Kiper incident [ edit ]\n\nWhile general manager of the Indianapolis Colts, Tobin gained some notoriety during the television broadcast of the 1994 NFL Draft after being criticized by ESPN analyst Mel Kiper Jr. for picking Nebraska linebacker Trev Alberts with the fifth pick in the draft, instead of Fresno State quarterback Trent Dilfer.\n\nWhile being interviewed by ESPN later in the broadcast, Tobin famously said \"Who in the hell is Mel Kiper anyway?!\"[3] Tobin later called a press conference where he ranted about Kiper for several minutes, stating that Kiper had been biased against the Colts ever since they moved from Baltimore, Kiper's home.[4]"}, {"url": "https://www.pro-football-reference.com/players/T/TobiBi00.htm", "page_content": "Frequently Asked Questions\n\nHow old is Bill Tobin?\n\nBill Tobin is 82 years old.\n\nWhen was Bill Tobin born?\n\nBill Tobin was born on February 16, 1941.\n\nWhere was Bill Tobin born?\n\nBill Tobin was born in Burlington Junction, MO.\n\nHow tall is Bill Tobin?\n\nBill Tobin is 5-11 (180 cm) tall.\n\nHow much did Bill Tobin weigh when playing?\n\nBill Tobin weighed 210 lbs (95 kg) when playing.\n\nIs Bill Tobin in the Hall of Fame?\n\nBill Tobin has not been elected into the Hall of Fame.\n\nHow many games did Bill Tobin play?\n\nBill Tobin played 10 games over his career.\n\nHow many receiving yards did Bill Tobin have?\n\nBill Tobin had 271 receiving yards over his career.\n\nWhen did Bill Tobin retire?\n\nBill Tobin last played in 1963."}, {"url": "https://en.unionpedia.org/Bill_Tobin_(American_football)", "page_content": "Bill Tobin (American football) Bill Tobin (born February 16, 1941) is a former professional American football player who played running back for one season for the Houston Oilers. [1]\n\n40 relations: Adam Meadows, American football, Ashley Ambrose, Bill Polian, Burlington Junction, Missouri, Chicago Bears, Conception Junction, Missouri, Detroit Lions, Edmonton Eskimos, ESPN, Fresno State Bulldogs football, Fullback (gridiron football), History of the Houston Oilers, Indianapolis, Indianapolis Colts, Jim Harbaugh, Jim Johnson (American football), Ken Dilger, Linebacker, Lineman (gridiron football), List of Missouri state high school boys basketball championships, Marshall Faulk, Marvin Harrison, Maryville High School (Missouri), Mel Kiper Jr., Missouri Tigers football, Nebraska Cornhuskers football, Offensive backfield, Quarterback, Ray Buchanan, Reception (gridiron football), Running back, Super Bowl V, Tarik Glenn, Touchdown, Trent Dilfer, Trev Alberts, University of Missouri, Vince Tobin, 1994 NFL Draft.\n\nJonathan Adam Meadows (born January 25, 1974) is a former American football player.\n\nNew!!: Bill Tobin (American football) and Adam Meadows · See more »\n\nAmerican football, referred to as football in the United States and Canada and also known as gridiron, is a team sport played by two teams of eleven players on a rectangular field with goalposts at each end.\n\nNew!!: Bill Tobin (American football) and American football · See more »\n\nAshley Avery Ambrose (born September 17, 1970 in New Orleans, Louisiana) is a former professional American football cornerback for several NFL teams during the 1990s and early 2000s who is currently the corner backs coach for the Colorado Buffaloes football team.\n\nNew!!: Bill Tobin (American football) and Ashley Ambrose · See more »\n\nWilliam Patrick Polian, Jr. (born December 8, 1942) is an NFL analyst for ESPN and former American football executive.\n\nNew!!: Bill Tobin (American football) and Bill Polian · See more »\n\nBurlington Junction is a city in Nodaway County, Missouri, United States.\n\nNew!!: Bill Tobin (American football) and Burlington Junction, Missouri · See more »\n\nThe Chicago Bears are a professional American football team based in Chicago, Illinois.\n\nNew!!: Bill Tobin (American football) and Chicago Bears · See more »\n\nConception Junction is a city in Nodaway County, Missouri, United States, near the Platte River.\n\nNew!!: Bill Tobin (American football) and Conception Junction, Missouri · See more »\n\nThe Detroit Lions are a professional American football team based in Detroit, Michigan.\n\nNew!!: Bill Tobin (American football) and Detroit Lions · See more »\n\nThe Edmonton Eskimos are a professional Canadian football team based in Edmonton, Alberta, competing in the West Division of the Canadian Football League (CFL).\n\nNew!!: Bill Tobin (American football) and Edmonton Eskimos · See more »\n\nESPN (originally an acronym for Entertainment and Sports Programming Network) is a U.S.-based global cable and satellite sports television channel owned by ESPN Inc., a joint venture owned by The Walt Disney Company (80%) and Hearst Communications (20%).\n\nNew!!: Bill Tobin (American football) and ESPN · See more »\n\nThe Fresno State Bulldogs football team represents California State University, Fresno in NCAA Division I FBS college football as a member of the Mountain West Conference.\n\nNew!!: Bill Tobin (American football) and Fresno State Bulldogs football · See more »\n\nA fullback (FB) is a position in the offensive backfield in American and Canadian football, and is one of the two running back positions along with the halfback.\n\nNew!!: Bill Tobin (American football) and Fullback (gridiron football) · See more »\n\nThe professional American football team now known as the Tennessee Titans previously played in Houston, Texas as the Houston Oilers from 1960 to 1996.\n\nNew!!: Bill Tobin (American football) and History of the Houston Oilers · See more »\n\nIndianapolis is the capital and most populous city of the U.S. state of Indiana and the seat of Marion County.\n\nNew!!: Bill Tobin (American football) and Indianapolis · See more »\n\nThe Indianapolis Colts are an American football team based in Indianapolis, Indiana.\n\nNew!!: Bill Tobin (American football) and Indianapolis Colts · See more »\n\nJames Joseph Harbaugh (born December 23, 1963) is the head football coach of the University of Michigan Wolverines and is a former quarterback.\n\nNew!!: Bill Tobin (American football) and Jim Harbaugh · See more »\n\nJim Johnson (May 26, 1941July 28, 2009) was an American football coach, formerly serving as defensive coordinator with the Philadelphia Eagles.\n\nNew!!: Bill Tobin (American football) and Jim Johnson (American football) · See more »\n\nKenneth Ray Dilger (born February 2, 1971) is a retired professional American football player.\n\nNew!!: Bill Tobin (American football) and Ken Dilger · See more »\n\nA linebacker (LB or backer) is a playing position in American football and Canadian football.\n\nNew!!: Bill Tobin (American football) and Linebacker · See more »\n\nIn gridiron football, a lineman is a player who specializes in play at the line of scrimmage.\n\nNew!!: Bill Tobin (American football) and Lineman (gridiron football) · See more »\n\nBelow is a list of Missouri state high school boys basketball championships sanctioned by the Missouri State High School Activities Association since the organization began holding the tournaments in 1968.\n\nNew!!: Bill Tobin (American football) and List of Missouri state high school boys basketball championships · See more »\n\nMarshall William Faulk (born February 26, 1973) is a former American football player who was a running back in the National Football League (NFL) for twelve seasons.\n\nNew!!: Bill Tobin (American football) and Marshall Faulk · See more »\n\nMarvin Daniel Harrison (born August 25, 1972) is a former American football wide receiver in the National Football League (NFL).\n\nNew!!: Bill Tobin (American football) and Marvin Harrison · See more »\n\nMaryville High School is the public high school for Maryville, Missouri.\n\nNew!!: Bill Tobin (American football) and Maryville High School (Missouri) · See more »\n\nMelvin Adam \"Mel\" Kiper Jr. (born July 25, 1960) is an American football analyst for ESPN.\n\nNew!!: Bill Tobin (American football) and Mel Kiper Jr. · See more »\n\nThe Missouri Tigers football program represents the University of Missouri in college football and competes in the Football Bowl Subdivision (FBS) of the National Collegiate Athletic Association (NCAA).\n\nNew!!: Bill Tobin (American football) and Missouri Tigers football · See more »\n\nThe Nebraska Cornhuskers football team represents the University of Nebraska–Lincoln.\n\nNew!!: Bill Tobin (American football) and Nebraska Cornhuskers football · See more »\n\nThe offensive backfield is the area of an American football field behind the line of scrimmage.\n\nNew!!: Bill Tobin (American football) and Offensive backfield · See more »\n\nA quarterback (commonly abbreviated \"QB\") is a position in American and Canadian football.\n\nNew!!: Bill Tobin (American football) and Quarterback · See more »\n\nRaymond Louis Buchanan (born September 29, 1971) is a former American football player in the NFL.\n\nNew!!: Bill Tobin (American football) and Ray Buchanan · See more »\n\nIn American football and Canadian football, a reception is part of a play in which a forward pass from behind the line of scrimmage is received (caught) by a player in bounds, who, after the catch, proceeds to either score a touchdown or be downed.\n\nNew!!: Bill Tobin (American football) and Reception (gridiron football) · See more »\n\nA running back (RB) is an American and Canadian football position, a member of the offensive backfield.\n\nNew!!: Bill Tobin (American football) and Running back · See more »\n\nSuper Bowl V, the fifth edition of the Super Bowl and first modern-era National Football League (NFL) championship game, was an American football game between the American Football Conference (AFC) champion Baltimore Colts and the National Football Conference (NFC) champion Dallas Cowboys to decide the NFL champion for the 1970 season.\n\nNew!!: Bill Tobin (American football) and Super Bowl V · See more »\n\nTarik Glenn (born May 25, 1976) is a former American football offensive tackle.\n\nNew!!: Bill Tobin (American football) and Tarik Glenn · See more »\n\nA touchdown is a means of scoring in both American and Canadian football.\n\nNew!!: Bill Tobin (American football) and Touchdown · See more »\n\nTrent Farris Dilfer (born March 13, 1972) is a former American football quarterback and analyst who played 13 seasons in the National Football League (NFL).\n\nNew!!: Bill Tobin (American football) and Trent Dilfer · See more »\n\nTrev Kendall AlbertsJim Offner,, Waterloo Cedar Falls Courier, February 6, 2013, accessed July 8, 2013.\n\nNew!!: Bill Tobin (American football) and Trev Alberts · See more »\n\nThe University of Missouri (also, Mizzou, or MU) is a public, land-grant research university in Columbia, Missouri.\n\nNew!!: Bill Tobin (American football) and University of Missouri · See more »\n\nVincent Michael Tobin (born September 29, 1943) is an American football coach and former college player who was the head coach of the Arizona Cardinals of the National Football League (NFL).\n\nNew!!: Bill Tobin (American football) and Vince Tobin · See more »\n\nThe 1994 NFL draft was the procedure by which National Football League teams selected amateur college football players.\n\nNew!!: Bill Tobin (American football) and 1994 NFL Draft · See more »\n\nReferences\n\n[1] https://en.wikipedia.org/wiki/Bill_Tobin_(American_football)"}]}