{"William Luther Pierce III was a member of the National Socialist White People's Party.": [{"url": "https://www.theguardian.com/world/2021/mar/31/william-luther-pierce-white-supremacist-son-kelvin-pierce", "page_content": "From an exposed bluff in Mill Point, West Virginia, Kelvin Pierce surveyed the remote place where his father chose to live and die. In a sense, he knew why. Kelvin is an avid outdoorsman, and even on a stark February day, with snow blanketing the earth and bitter wind whistling through the trees, he was moved by Appalachia’s subtle splendor. He understood why a man might settle there.\n\n“I love West Virginia,” Kelvin had said earlier, on the four-and-a-half-hour drive from his home just outside Washington. “It’s absolutely my favorite place on the planet.”\n\nIt’s also full of sorrow.\n\nWhen Pierce’s father bought 346 acres in Mill Point, and relocated there permanently in 1985, he left his family behind. He started building a compound where a new kind of family – men and women of like mind – could live off the land and be free of outside influences. He moved into a rambling trailer home, where he lived with a series of wives who weren’t Pierce’s mother. He had divorced her, declaring the split “necessary in order for me to have the peace of mind I need to do most effectively what I must do with my life”.\n\nNothing was more important to Kelvin’s father than white supremacy. The abandonment and the hate – the abandonment for hate – is what Kelvin has spent the better part of his life struggling to understand.\n\nTo family and friends, his dad was Bill. To everyone else, he was William Luther Pierce III, one of America’s most prominent white nationalists.\n\nA physics professor turned neo-Nazi, William Pierce led a hate group called the National Alliance and a business empire that, at the time of his death from cancer in 2002, raked in $1m a year. He published books and magazines, hosted a radio program, and owned a music label, all of which promoted white supremacy. His work galvanized violent gangs, such as the Order and the Aryan Republican Army. Most infamously, it inspired the architect of the Oklahoma City bombing – Timothy McVeigh designed the attack based in part on Pierce’s 1978 novel The Turner Diaries.\n\nReportedly called “the bible of the racist right” by the FBI, The Turner Diaries is a fantasy about white militants overthrowing the US government as part of a bloody race war. A 2016 report found that the book had been tied to at least 200 murders, committed in 40 terrorist attacks and hate crimes. This year, during the 6 January coup attempt, there were echoes of the novel’s core ideas in insurrectionists’ calls to kill members of Congress, and in a gallows erected near the Capitol.\n\nWilliam Pierce raised Kelvin to hate Jews, Black people, immigrants – anyone who wasn’t white. Now 60, Kelvin has long rejected his father’s ideology, but only recently has he reached the point where he’s ready to talk about his upbringing, and how his story illuminates the toxic currents roiling America. “If I can help one other person that felt the way I used to feel, to feel better and to make different choices, then that’s what I want to do,” Kelvin said. “And I think I can help more than one person.”\n\nWhen he was little, Kelvin would sneak into his dad’s home office in northern Virginia to look at the bust of Adolf Hitler and the glass paperweight in the shape of a swastika that sat on the desk. Kelvin didn’t know what the items meant, and William Pierce wasn’t interested in explaining. He rarely spent time with Kelvin and his twin brother, Erik, preferring to fraternize with George Lincoln Rockwell, the leader of the American Nazi party, or to lock himself away writing articles decrying Jewish power and interracial marriage.\n\nKelvin’s strongest memories of his dad involve abuse. Any disobedience or perception of bad behavior led to beatings with whatever was at hand: a belt, a wire hanger, a two-by-four. The violence left Kelvin with bruises and a deep well of self-loathing.\n\nHis mom, Patty, didn’t approve of the cruelty, but she didn’t do much to intervene. She took a similar approach to her husband’s extremism, which he’d nurtured since at least the early 1960s. A math professor and the family breadwinner, because her husband had given up his own academic career to become an ideologue of hate, Patty did all of William Pierce’s accounting and typing. Kelvin said his mom was “absolutely terrified” when her husband started a firearms business – not because he advertised his stock as “Negro control equipment” necessary for “the coming race war”, but because it prompted newspapers to publish articles about him. Patty worried that someone might come to the house and hurt her family.\n\nFamily photos from the archive of Kelvin Pierce. Photograph: Johnathon Kelso/The Guardian\n\nWhen her sons told her that neighborhood kids made fun of them by calling them Nazis, she lamented that “it’s a terrible world” and “people are awful”. She didn’t answer when Kelvin asked her what a Nazi was, and she didn’t tell her boys that their father was to blame for what was happening to them.\n\nAs a teenager, Kelvin was a bigot because he didn’t know any other way to be. He also hoped it would impress his dad. In high school, he gave a presentation on Hitler’s virtues and used the N-word to talk about Black classmates. By the time he went to college, he was “a mobile advertisement” for his father’s beliefs.\n\n“It made me feel superior to be part of the white race,” Kelvin later wrote. “Yet deep, deep down, something didn’t quite feel right about it either.”\n\nHe began to change when he transferred from a small Christian college to Virginia Tech. He roomed with a young man from South America who was “thoughtful, caring and very intelligent” – all things that Kelvin’s father insisted people who weren’t white couldn’t be. He took classes with students who saw the world very differently than he did. When Ronald Reagan was elected president and many of his liberal peers were visibly upset – including his roommate, who drew a dagger and drops of blood on a photo of Reagan – he wanted to understand why. He started paying attention to politics and watching the evening news, which his dad had always said was worthless because Jews controlled the media. Kelvin wondered if everything he’d been taught was wrong.\n\nHe met a fellow student named Susan when they were both engineering interns with the navy one summer. Kelvin thought she was beautiful, but while his racism was rapidly dissipating, his shame – the feeling that his dad had abused him for a reason, that he deserved it – was not. He couldn’t imagine making the first move, but Susan could. “You know, if you were to ask me out, I would say yes,” she announced one day.\n\nThey were married in 1986. William Pierce came to the wedding. His gift to the bride and groom was a box of 9mm ammunition. “To keep the wolves away from your door!” his note read. Kelvin didn’t even own a gun.\n\nBy then, William Pierce had divorced Patty, decamped to Mill Point, and curtailed contact with his sons. Kelvin only confronted his dad once, asking why he’d chosen white supremacy over everything else in his life. “It was the only responsible thing I could do,” his father replied.\n\nFor her part, Susan didn’t think that William Pierce’s worldview mattered. “Thank goodness that’s a dying thought process,” she recalled thinking – an assumption she now sees as optimistic, or perhaps naive. It was also hard for her to fathom the extent of the abuse Kelvin suffered.\n\n“You know, he hit me every day,” he told her once.\n\n“Every day?” she replied, incredulous.\n\nSusan had grown up in a home where, as she put it, “We were always hugging each other, and we always said, ‘I love you.’”\n\nShe and Kelvin had kids only because they agreed to adopt them. “I was just terrified of furthering my genes,” Kelvin said. “I was so messed up and so damaged as a human being that I couldn’t fathom the idea of trying to make another human being.” Their daughters, Mariame and Marieka, are from the country of Georgia. Kelvin vowed to love them like he’d never been loved. He coached their softball teams and took them on camping trips.\n\nKelvin with his daughter Marieka. Photograph: Johnathon Kelso/The Guardian\n\nWilliam Pierce never met his granddaughters. For seven years prior to his death, he didn’t reply to the letters and photos documenting their childhood that Kelvin sent him. Despite everything, Kelvin kept reaching out. His anger at how he’d been raised collided with yearning for paternal approval. When he first heard of the connection between The Turner Diaries and the Oklahoma City bombing, his kneejerk reaction was a perverse kind of pride that his dad was in the news. He was ashamed his mind went there, but at a loss for how to stop it.\n\nKelvin was battling his demons without armor or weapons. He was also doing it alone. “You’re a mystery to me,” Susan would tell him sometimes. “I don’t understand why you won’t tell me how you’re really feeling.”\n\nIn July 2002, his uncle called to tell him that his father was dead. Kelvin hadn’t even known he was sick. He surprised himself by crying, then realized what he was really mourning: he had to let go of the futile hope that his father might one day love him. He went to West Virginia for the memorial service, where neo-Nazis offered their condolences and said Kelvin must have admired his father very much.\n\nHow little they know, he thought.\n\nHe looked like his dad – tall and lanky, with mournful eyes, a long, square jaw, and prominent ears. He shared William Pierce’s introspection and his dislike of being told what to do. But the similarities ended there.\n\nAfter the service, he began to feel something new: he was sad for his father and the life he’d led. It could have been different. But again and again, William Pierce had made the wrong choices, leaving heartache and hate in his wake.\n\nKelvin wanted to start making better choices of his own.\n\nTo Mariame Pierce, her dad’s bookshelf told the story. When she was little, it held volumes about Kelvin’s hobbies – mountain climbing, for instance. Over time, new titles appeared, ones about self-discovery and philosophy, written by Eckhart Tolle and Deepak Chopra. While she was growing up, her dad was changing too. “He became more present and thoughtful, more conscious and intentional,” said Mariame, now 25.\n\nKelvin had embarked on a “healing” journey, as he describes it. He read, reflected and prayed. He worked with a counselor to process his childhood trauma, including his father’s belief system. He and Susan, who already ran a successful construction business together, started a charitable foundation to support orphanages in Georgia. When he posted pictures from visits to his daughters’ native country, friends remarked that he looked uncharacteristically happy. “To make a child feel like at least somebody in the world loves them, it’s the most amazing thing in the world,” Kelvin said.\n\nHe told his life story publicly for the first time at his local Rotary Club. He described how, in his youth, he’d fantasized about traveling to Washington with a gun and opening fire on Black people. His teenage dreams now repulsed him. Afterward, audience members came up to thank him. Some of them were crying.\n\nThe more he talked about his experiences, the more people told Kelvin he should write a book. It took a seismic national event for him to decide they were right.\n\nOn 12 August 2017, the Unite the Right rally in Charlottesville, Virginia, turned deadly. Watching the events unfold, “I was immediately transported back to my childhood,” Kelvin said. “The hatefulness of their energy and what they were saying, the way they were saying it, especially ‘You will not replace us’ – it was just like being an eight- or nine-year-old kid, when my dad took me to an American Nazi party picnic.”\n\nHe started writing what would become Sins of My Father, which he self-published in February 2020. In addition to telling Kelvin’s personal story the book, written with Carole Donoghue, draws on private letters and other archival documents that reveal how perceived grievances, personal disappointment, and twisted self-regard led William Pierce to dedicate his life to white supremacy.\n\nThough it’s impossible to pinpoint the exact moment when his father’s beliefs began to curdle – stories of radicalization are never so precise – Kelvin finds seeds of discontent in the years when William Pierce was a new husband, a new father and newly endowed with his physics doctorate. “I think Dad was becoming angry and resentful and was suddenly frightened of the future and the heaviness of it all,” Kelvin writes. “He hated the idea of working for someone else. He never wanted to have to answer to anyone else, even his wife.”\n\nThis period in William Pierce’s life coincided with the rise of progressive identity politics – the acceleration of the civil rights movement, for instance, and the dawn of second-wave feminism. He wanted to be a man who mattered, a man people listened to. White nationalism allowed him to be that. His life became one long ideological devolution, nourished by the power and attention he accrued evangelizing about hate.\n\nKelvin Pierce photographed at his home in Vienna. Photograph: Johnathon Kelso/The Guardian\n\nIf the story sounds familiar, it is. America is still plagued by the forces of rightwing radicalization. Sins of My Father draws parallels between William Pierce and Donald Trump, who “emboldened white supremacists and mass-shooters by his words and deeds,” as Kelvin writes. “In many ways, Trump has succeeded where Dad failed. He has taken hate and discrimination mainstream.”\n\nOther evidence of his father’s enduring impact hit closer to home. After Marieka Pierce enrolled in a police academy in Virginia, one day in class, her instructors showed the room a picture of her grandfather, describing him as an example of a homegrown extremist. “My hand went up,” Marieka later told her mom.\n\nThe instructors were stunned to hear about the family connection. William Pierce was a staple in their curriculum about hate crimes; they’d been teaching recruits about him for as long as they could remember. They asked to meet Kelvin to get a fuller picture of the man who, in obituaries, was remembered as “a cold and calculating racist” and “the godfather of hate in this country.”\n\nDonny MacMullen has his own take on William Pierce: he thinks Kelvin’s father was a great man.\n\nMacMullen, who is in his 30s, with reddish brown hair, a full beard, and striking blue eyes, moved to Mill Point from Massachusetts a few years ago to help preserve Pierce’s legacy. Today, he’s the caretaker of the National Alliance compound, which amounts to a few scattered buildings and the rocky sprawls of land between them.\n\nThe place is in a state of disrepair, and people rarely visit, but there are reminders of the community Kelvin’s dad was trying to build before he died: an AV facility stocked with equipment that was first-rate in the early aughts; a library that once housed several thousand volumes; stacks of slickly produced magazines promoting racism; a meeting house where William Pierce presided over annual National Alliance conferences. Today, even as Pierce’s ideas continue to find adherents, the organization he started is a shade of its former self.\n\nMacMullen was happy to welcome Kelvin to the compound in February. Indeed, members of the National Alliance had long made clear that William Pierce’s son could visit anytime. For more than 15 years after his father’s death, however, Kelvin stayed away. He wasn’t ready to make peace with it, because he wasn’t at peace with himself.\n\nIt was a steep drive up switchbacks to the heart of the compound, where MacMullen was waiting, wearing a knit cap with a swastika stitched to the front. When Kelvin asked him about the symbol, MacMullen laughed. It just represents love for the white race, he insisted. Kelvin pointed out that it was associated with hate and genocide, and MacMullen shifted gears. If you love something deeply, he said, then you have to hate anything that threatens it.\n\nDonny MacMullen’s office at the West Virginia compound. Photograph: Johnathon Kelso/The Guardian\n\nThis was another way of expressing the sentiment of a meme MacMullen once posted on his Facebook page: “I’m white but that doesn’t mean I’m racist … I will put my boot in your ass, my knife to your throat, and your body in the dirt if you f**k with me and mine.”\n\nKelvin and MacMullen walked for a while on the property, just the two of them. If it was painful to talk with a man who revered his father – who saw virtue in a racist who beat him every day of his childhood – Kelvin didn’t let it show. They talked about their divergent beliefs, and neither man was interested in budging.\n\n“We’ll just have to agree to disagree,” MacMullen said at one point.\n\nWhen Kelvin recounted the conversation to his best friend, Gil Jullien, who’d come on the trip as moral support, Jullien was furious. “Oh, that’s bullshit!” he said. “I don’t agree to disagree!”\n\nJullien was speaking from experience. He was troubled that a close childhood friend had become a vociferous Trump supporter, the sort who regularly posts racist and sexist content on Facebook. Once, when the two men were at a high school reunion talking politics, Jullien’s friend had told him they’d have to agree to disagree. Jullien wasn’t having it. “In my opinion, he’s ruining our country, and I’m not,” he later explained.\n\nKelvin shares Jullien’s moral compass. “Aggression and hate and violence are the epitome of cowardice,” he said. But he doesn’t want to feel antagonism or resentment toward anyone, not even white nationalists.\n\nHe prefers to listen and question, not to confront; to offer the possibility of connection rather than writing people off. His approach might not be for everyone, but for Kelvin it’s vital. If he could be redeemed, why not someone like MacMullen?\n\n“I’m putting myself out there for people that want help and want change,” Kelvin said.\n\nBefore Kelvin left the compound, MacMullen gave him a copy of a book – a tome, really, at more than 1,000 pages. Written in 1978 by William Gayley Simpson, a white nationalist who ran in the same circles as William Pierce, Which Way Western Man? bemoans the supposed decline of white civilization, the rise of feminism and multiculturalism, and the alleged chokehold liberal orthodoxy has on modern society – it’s a collection of white supremacy’s greatest hits.\n\nMacMullen said the text meant a lot to him. Back home in Virginia, in the spirit of listening and questioning, Kelvin cracked the book and read the first 50 or so pages. “It kind of boils down to, do you live your life stuck in the rat race, within society’s norms, or do you break out from that and try to live a more authentic life, doing what you want to do, what you feel is right versus what society says is right?” he said.\n\nThe language struck a chord. He heard echoes of his own transformation, of setting a new course for himself. Whereas Kelvin chose a path defined by hope and inclusivity, people who admire his father have let bigotry be their guide. Still, in their journeys’ common origin, Kelvin saw promise – the possibility of trying again, and getting it right this time.\n\n“It’s not as insurmountable a task to start a recovery process as some people think. It does take discipline, but it actually works,” he said. “I’m living proof of that, right?”\n\nThe trailer where William Luther Pierce once lived lies in disrepair at the National Alliance compound. Photograph: Johnathon Kelso/The Guardian\n\nThe last time Kelvin saw his father, he jumped off a mountain.\n\nKelvin had started hang-gliding in his 20s, and during his first visit to the compound in West Virginia – the only one he took while William Pierce was alive – his dad had suggested he glide off one of the property’s peaks. No way, Kelvin told him. There weren’t open areas below where he could land. At best he’d come away injured; at worst he could die.\n\nA few years later, in 1995, Kelvin traveled to Spruce Knob, the highest point in West Virginia, for a series of flights over the Labor Day weekend. He invited his dad to come watch him. He didn’t expect him to show, but as Kelvin was untying his glider from its rack on his truck, he heard a familiar voice.\n\n“You need a hand with that?” his father asked.\n\n“You actually came,” Kelvin replied.\n\nWith his father’s help, Kelvin made quick work of maneuvering his 80lb glider to the launch site. Before them was a pleated vista, gentle peaks and valleys thick with late-summer green. Kelvin suited up and pointed to the landing field where his father could meet him. “Clear!” he yelled, before taking a few running steps and leaving the earth.\n\nThe flight was perfect. A swell of wind – a lift, as hang-gliders say – allowed Kelvin to pilot much higher than he’d planned, rendering his dad a dot on the ground. He stayed in the sky for an hour. The view was majestic: forests and farms and fields stretching beneath him.\n\nHe touched down with ease in a wide field. As he was packing up his gear, he heard the familiar voice again: “Wow, Kelvin, that was absolutely amazing.”\n\nIt was the first time in his life that Kelvin knew for certain he’d impressed his father.\n\nThey stood in the landing field talking for a bit longer. Then father and son said their goodbyes and went their separate ways: William Pierce to what Kelvin called “his life of hate at the compound”; he to new chapters of his existence. Some, such as parenthood, would be joyous. Wrestling with his past would be torment. But just like he navigated the wind high above the mountains, Kelvin would steer himself to a place where he could land, safe and whole, and invite others to join him, if only they too have the courage to leap.\n\nKelvin Pierce at a park nearby his home in Virginia. Photograph: Johnathon Kelso/The Guardian\n\nSeyward Darby is the editor-in-chief of the Atavist Magazine and the author of Sisters in Hate: American Women on the Front Lines of White Nationalism. Johnathon Kelso is an editorial photographer working on long-form projects related to history and race in the American south"}, {"url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/william-pierce", "page_content": "Pierce was the movement's fiercest anti-Semitic ideologue and he built the Alliance into a money-making machine through its hate music business, Resistance Records. Pierce was also the author of the race war novel The Turner Diaries. The book has been called \"the bible of the racist right,\" is known to have drawn many into the movement, and was a key inspiration for Timothy McVeigh's 1995 Oklahoma City bombing.\n\nIn His Own Words\n\n\"After the sickness of ‘multiculturalism,' which is destroying America, Britain, and every other Aryan nation in which it is being promoted, has been swept away, we must again have a racially clean area of the earth for the further development of our people. … We will not be deterred by the difficulty or temporary unpleasantness involved, because we realize that it is absolutely necessary for our racial survival.\"\n\n— \"What is the National Alliance?\", National Alliance website, undated\n\n\"[T]he Alliance has no interest at all in the so-called movement. We're not interested in uniting with the movement, and we're not interested in competing with the movement for members. If anything, we should be grateful that the movement is out there to soak up a lot of the freaks and weaklings who otherwise might find their way into the Alliance and make problems for us. In this regard, I was sorry to note Aryan Nations and the [World] Church of the Creator have, for all practical purposes, died in the last few weeks. I hope one or two replacement groups spring up to draw away from us the defectives.\"\n\n— Pierce's final speech, National Alliance leadership conference, April 2002\n\n\"If the protagonist learns something or comes to believe in something, if he changes his ideas, the reader tends to do the same thing, he changes too. So what you have is a powerful teaching tool, a persuasive tool.\"\n\n— Pierce, quoted in a biography of him called Fame of a Dead Man's Deeds, on the power of narrative\n\nBackground\n\nWilliam Luther Pierce's bigoted attitudes toward people of color were inculcated at an early age. He was born in Atlanta into an Old South aristocracy that included his mother and her ancestors. His great-grandfather, he has said, was governor of Alabama and attorney general of the Confederacy during the Civil War. According to a fawning biography of Pierce by University of Vermont Professor Robert Griffin, Fame of a Dead Man's Deeds: An Up-Close Portrait of White Nationalist William Pierce, he grew up in a Southern household during segregation with older relatives who treated a black servant like a virtual slave.\n\nPierce graduated from Houston's Rice University in 1955 with a bachelor's degree in physics. He worked at the Los Alamos National Laboratory before attending graduate school, first at Caltech and then at the University of Colorado at Boulder, where he earned his Ph.D. in physics in 1962. He taught physics as an assistant professor at Oregon State University from 1962 to 1965. It was during that time that Pierce became concerned by the threat to the white race that he believed was posed by the civil rights and anti-Vietnam War movements, and he joined the John Birch Society, a right-wing group that once accused President Eisenhower, among many others, of being a communist.\n\nThe John Birch Society, which generally rejected anti-Semitism, turned out to be too namby-pamby for Pierce. In 1966, he quit a job as a senior research scientist at a Connecticut aerospace firm to join George Lincoln Rockwell's American Nazi Party (1959-67). Upon buying a printing press, Pierce become editor of the party's National Socialist World. After Rockwell was assassinated the following year, Pierce continued to work with the remnants of the group, which by then was renamed the National Socialist White People's Party. In 1968, Pierce became an official of Youth for Wallace, an organization supporting Alabama segregationist and former Gov. George Wallace's bid for the presidency. Willis Carto, already one of America's leading anti-Semitic activists, also joined the Wallace group and in 1970 he and Pierce reconfigured Youth for Wallace into the National Youth Alliance (NYA). But the two men had a major falling out, and each claimed to be the new group's leader. In 1971, Carto accused Pierce of stealing a mailing list belonging to Carto's anti-Semitic Liberty Lobby organization. Pierce had written to those on the mailing list, attacking the Liberty Lobby's leaders, including Carto. Eventually, Pierce won control of the NYA, which was limited to people under age 30 and focused on activities on college and university campuses.\n\nIn 1974, Pierce dropped the age limit and reorganized the NYA as the National Alliance (NA), which he would lead until his death in 2002. The NA, which aimed to be a vanguard party capable of leading the \"lemmings\" comprising the white masses to revolutionary victory, adopted the slogans \"Free Men Are Not Equal\" and \"Equal Men Are Not Free.\" Effectively a Leninist in terms of tactics, Pierce was not interested in winning his battle through electoral successes. He wanted his vanguard to lead the white masses to power, something that could only come after a period of ethnic cleansing that Pierce referred to as a \"temporary unpleasantness,\" the seizure of state power and creation of all-white nations.\n\nThe text that made Pierce famous, however, was his novel of race war, The Turner Diaries, published in 1978 under the pseudonym Andrew MacDonald after first being serialized in the NA publication Attack! The NA boasted that the book was a \"Blueprint,\" a \"Handbook for White Victory.\" Pierce told his seminal story through two years of diary entries by his white supremacist hero, Earl Turner. Turner carries out orders for the Organization, an underground group struggling against the System — an anti-white, anti-gun U.S. government that continually puts more restrictions on its citizens. Using \"detonators, timers, igniters and other gadgets\" built by Turner, the Organization spawns vicious warfare between blacks, Jews and whites as it takes over the country, city by city. The violence is unforgettably vivid. Turner describes slicing the throat of a Jewish shop owner \"from ear to ear,\" murdering a Washington Post editor with two shotgun blasts, and watching starving blacks barbecue and eat white children. By the novel's end, Turner is working for an elite survivalist group called the Order and plotting a suicide mission — flying a crop-duster plane strapped with a warhead into the Pentagon, the System's last remaining military stronghold. \"Two-thirds of the troops around the Pentagon are n------,\" Turner writes in his journal, \"which should greatly enhance my chances of getting through.\"\n\nPierce's novel has inspired many a terrorist. In 1983, the NA's Pacific Northwest leader, Robert Mathews, joined with three other Alliance members and, later, some 20 other people, to create The Order, a white supremacist terrorist group. Based on the group portrayed in The Turner Diaries, Mathews' gang ultimately robbed some $4 million from armored cars. Declaring \"War in '84,\" members of The Order murdered a well-known Jewish talk show host, Alan Berg, in Denver. (The first person on their hit list was Southern Poverty Law Center co-founder Morris Dees. They abandoned that attempt due to high levels of security.) Later that year, Mathews was killed in a shootout with the FBI. Pierce hailed his martyred acolyte, saying Mathews \"took us from name-calling to bloodletting.\"\n\nIn 1995, Timothy McVeigh, aided by Army pals Terry Nichols and Michael Fortier, blew up the Oklahoma City federal building, killing 168 people, including 19 children. The day before, according to officials, McVeigh called an NA recorded message line seven times. When McVeigh was arrested, police found excerpts from The Turner Diaries in his car. After the attack, which was patterned on a similar bombing depicted in The Turner Diaries, Pierce predicted, or maybe hoped, that resentment of Jews, minorities and others would lead to terrorism \"on a scale the world has never seen before.\" In 1998, before three white men in Texas beat and dragged James Byrd Jr. to death behind a pickup truck, one of the men, John King, reportedly announced, \"We're starting The Turner Diaries early.\" There are many other cases, as well, where killers were said to be inspired by the novel.\n\nIn 1989, Pierce's publishing arm, National Vanguard Books, printed his second novel, Hunter, depicting the assassination of interracial couples, Jews and politicians. The book was dedicated to Joseph Paul Franklin, convicted of the sniper murders of at least two black men. That same year, on the 100th anniversary of Adolf Hitler's birth, Pierce editorialized that the Nazi leader was \"the greatest man of our era.\" In 1991, Pierce began broadcasting a shortwave radio program, \"American Dissident Voices,\" that was heard worldwide. Within months, it was carried by several AM stations.\n\nIn 1984, after several years in the Arlington, Va., area, Pierce paid $95,000 in cash for a 346-acre tract of land atop a small mountain in West Virginia, where he set up what would become the NA's permanent compound. He would build several structures on the land, including a building for his Cosmotheist Church, which housed the bogus religion conjured up by Pierce primarily as an unsuccessful tax dodge. It was from this compound that Pierce ran an empire that ultimately included sales of books, cassettes, music, and racist paraphernalia. The group created a system of monthly dues and produced a monthly update for its members, the National Alliance Bulletin. At its peak, around the time of Pierce's death in 2002, the NA had more than 1,400 dues-paying members.\n\nThe NA also served as a launching pad for many white supremacist terrorists. Besides the Order members, in 1996 officials arrested NA member Todd Vanbiber in Florida after a pipe bomb he was building exploded in his face. After Vanbiber was sentenced for federal firearms violations, other NA confederates testified that the Vanbiber gang had robbed three banks and donated at least $2,000 to Pierce. A week before the first anniversary of the Oklahoma City bombing, Larry Shoemake opened fire on a black neighborhood in Jackson, Miss., killing one person and wounding seven others. Relatives said he was inspired by Pierce's writings.\n\nIn 1999, Pierce made an important business investment, buying white power music label Resistance Records for some $250,000. The deal gave Pierce control of the label's CD catalogue, inventory, mailing list and publishing arm. In the next few years, Resistance came to dominate the white power music scene and also became the biggest moneymaker in the NA empire. Pierce added to that empire in 2000, after \"national socialist black metal\" musician and convicted German murderer Hendrik Möbus took up residence at the NA headquarters. Möbus' music label, Cymophane, was then transferred to Pierce's control. Three months after arriving at the compound, Möbus was arrested on an international arrest warrant issued in Germany. Pierce spearheaded a campaign to free Möbus and raised money to pay for his legal fees. Ultimately, however, Möbus was deported and jailed in Germany.\n\nIn 2001, in a major break with the past, the NA began to hold rallies and engage in other public activities like leafleting. Organized by Deputy Membership Coordinator Billy Roper, NA members joined, for the first time, with other white supremacists in front of the Israeli Embassy to protest Jewish influence in the U.S.\n\nAccording to Fame of a Dead Man's Deeds, Pierce married five times. His first wife was Patricia Jones, whom he met while at the California Institute of Technology. They were married in 1957 and had twins sons, Kelvin and Erik, born in 1962. The marriage ended in divorce in 1982. Pierce was remarried that same year to Elizabeth Prostel, who worked for the NA. The marriage ended in 1985, when Pierce moved his headquarters to West Virginia. In Fame of a Dead Man's Deeds, Pierce talks of preferring immigrant women from Eastern Europe. He married Hungarian Olga Skerlecz in 1986, a marriage that lasted until 1990, when she left Pierce and West Virginia \"for greener pastures in California.\" Pierce then wed a woman named Zsuzsannah, also Hungarian, in early 1991. They met through an ad that Pierce placed in a Hungarian women's magazine. Zsuzsannah left him for Florida in mid-1996. His last marriage, which lasted until his death, was with another Eastern European woman whom he married in 1997. He was sharp and condescending toward his last wife, identified only with the pseudonym Irena in Fame, when he was not ignoring her. Irena was miserable living with the savior of the white race.\n\nIn 2002, Pierce made his last public speech at one of the NA's secretive \"leadership conferences\" that were held twice a year at the West Virginia compound. Held on April 20, Hitler's birthday, Pierce emphasized the need to continue building a professional organization while rejecting alliances with other hate groups, whom he derisively mocked. For the 10 days before his unforeseen death from kidney failure and cancer on July 23, 2002, Pierce instructed his subordinates, and worked feverishly to try to assure the survival of the NA. Pierce died an old-fashioned death, appropriate for a man who conceived of himself in decidedly old-fashioned terms — as a lord among serfs, an elite leader uniquely capable of leading \"his people\" to victory over Jews, \"race traitors,\" and a whole host of other enemies.\n\nPierce's 2002 death came at a critical moment for the NA. A quarter-century after birthing the group, Pierce had finally remade his outfit into a remarkably professional organization. Much of the previous two years had been spent building up a talented staff, learning how to run a profitable business, and intensifying recruiting and propaganda. Just before his death, the NA was bringing in more than $1 million a year, had a paid national staff of 17 full-time officials, and was better known than at any time in its history. Pierce's voice, broadcast via his \"American Dissident Voices\" Internet show, was being heard in Europe and the U.S. In just five days in June 2002, NA members in 20 states distributed 70,000 leaflets.\n\nSix days after Pierce's death, a committee of his key staffers announced that the NA had selected a new leader. Erich Gliebe, the hard-edged former boxer who fought professionally as \"The Aryan Barbarian,\" would be the new chairman, although all agreed that no one could replace Pierce, who was memorialized as \"Our Eternal Chairman,\" comparable to Hitler himself. But Pierce's condescending and harsh words during his final speech doomed the group. His comments that other hate groups were filled with \"freaks and weaklings,\" something first disclosed by the Intelligence Report, seriously undermined the group by driving away its customer base. Within a few months, infighting broke out among the leadership, and splits started to occur. By 2009, the NA had lost nearly all of its members, falling from a high of more than 1,400 to fewer than than 100, Resistance was losing money, and Gliebe was living in the basement of his mother's Cleveland-area home."}, {"url": "https://encyclopedia.pub/entry/36175", "page_content": "internal conflict white supremacist anti-communist\n\n1. Introduction\n\nWilliam Luther Pierce III (September 11, 1933 – July 23, 2002) was an American white supremacist, author, and political activist.[1][2] He was one of the most influential ideologues of the white nationalist movement for some 30 years before his death. A physicist by profession, he was also an author under the pseudonym Andrew Macdonald of the novels The Turner Diaries and Hunter. Pierce founded the National Alliance, a major white nationalist organization, which he led for almost thirty years.\n\nBorn in Atlanta, Georgia, to a Presbyterian family of Scots-Irish and English, Pierce was a descendant of Thomas H. Watts, the Governor of Alabama and Attorney General of the Confederate States of America during the American Civil War. As a child, Pierce did well academically, graduating from high school in 1952. He received a baccalaureate in physics from Rice University in 1955, earned a doctorate from University of Colorado at Boulder in 1962, and became an assistant professor of physics at the Oregon State University in 1962, where he joined the anti-communist John Birch Society. In 1965 he left his tenure at Oregon State University and became a senior researcher for the aerospace manufacturer Pratt & Whitney in Connecticut. In 1966 Pierce moved to the Washington, D.C. area and became an associate of George Lincoln Rockwell, who was assassinated in 1967, after which Pierce became co-leader of the National Youth Alliance, which split in 1974, with Pierce founding the National Alliance.\n\nIn 1978, Pierce wrote, under the pseudonym \"Andrew Macdonald\", the novel The Turner Diaries, which depicts a violent revolution in the United States, followed by world war, and the extermination of non-white races. In 1984, he wrote another novel, Hunter, portraying the actions of a lone-wolf white supremacist assassin. In 1985, Pierce relocated the headquarters of the National Alliance to Hillsboro, West Virginia, where he founded the Cosmotheist Community Church to receive tax exemption for his organization. Pierce spent the rest of his life in West Virginia hosting a weekly shortwave radio show, American Dissident Voices, publishing the internal newsletter National Alliance Bulletin (formerly called Action), and overseeing his publications, National Vanguard magazine (originally titled Attack!), Free Speech and Resistance, as well as books published by his publishing firm National Vanguard Books, Inc. and music produced by his record company, Resistance Records.\n\nIn 2002, Pierce died of cancer. At the time, the National Alliance was bringing in more than $1 million a year, with more than 1,500 members and a paid national staff of 17 full-time officials, and was better known than at any time in its history, after which it entered a period of internal conflict and decline.\n\n2. Life and Career\n\n2.1. Early Life and Education\n\nWilliam Pierce at a young age, in a high school military academy uniform. https://handwiki.org/wiki/index.php?curid=1307868\n\nWilliam Luther Pierce III was born on September 11, 1933, to a Presbyterian[3][4][5] family of English and Scotch-Irish descent in Atlanta, Georgia, the son of William Luther Pierce Jr. and Marguerite Farrell. Pierce's younger brother, Sanders, an engineer, was born in 1936, and later assisted Pierce in his political activities.[6] His father was born in Christiansburg, Virginia in 1892. His mother was born in Richland, Georgia in 1910, with her family being part of the aristocracy of the Old South, descendants of Thomas H. Watts, the Governor of Alabama and Attorney General of the Confederate States of America.[7] After the American Civil War, the family lived a working-class existence.[8] Pierce's father once served as a government representative on ocean-going cargo ships and sent reports back to Washington, D.C.;[9] he later became manager of an insurance agency but was killed in a car accident in 1942.[10] After the elder Pierce's death, the family moved to Montgomery, Alabama and then to Dallas, Texas.[11]\n\nPierce performed well academically in school, skipping one grade. His last two years in high school were spent in a military academy.[12] As a teenager his hobbies and interests were model rockets, chemistry, radios, electronics, and reading science fiction.[9] His first aspiration was to become an astronaut.[13]\n\nAfter finishing military school in 1951, Pierce worked briefly in an oil field as a roustabout. He was injured when a four-inch (10 cm) pipe fell on his hand, and he spent the rest of that summer working as a shoe salesman.[14] Pierce earned a scholarship to attend Rice University in Houston, Texas. He graduated from Rice in 1955 with a baccalaureate in physics.[15][16] He worked at the Los Alamos National Laboratory before attending graduate school, first at Caltech and then the University of Colorado in Boulder, Colorado, where he earned his doctorate in 1962.[15] He taught physics as an assistant professor at Oregon State University from 1962 to 1965.[17]\n\n2.2. Early Political Activities\n\nHis tenure as assistant professor at Oregon State University (1962–1965) coincided with the rise of two social movements, the Civil Rights Movement and the Anti-Vietnam War movement, which he regarded as Jewish-led, communist-inspired, and a threat to European Americans. He was briefly a member of the anti-communist John Birch Society in 1962,[18] but eventually resigned. In 1965, in order to finance his political ambitions, Pierce left his tenure at Oregon State University and relocated to North Haven, Connecticut, to work as a senior researcher at the Advanced Materials Research and Development Laboratory of aerospace manufacturer Pratt & Whitney.[11] In 1966, moved to the Washington, D.C. and became an associate of George Lincoln Rockwell, founder of the American Nazi Party. During this time he was the editor of the party's ideological journal, National Socialist World. When Rockwell was murdered in 1967, Pierce became one of the leading members of the National Socialist White People's Party, the successor to the ANP.\n\nAccording to the American neo-Nazi James Mason, during the first National Socialist World Congress in 1969, when a delegate asked what should be done with \"White race traitors\", Pierce formed with his hand a pistol being fired, rousing the audience to its feet.[19]\n\nIn 1968, Pierce left the NSWPP and joined Youth for Wallace, an organization supporting former Governor of Alabama George Wallace's bid for the presidency.[16] In 1970, along with Willis Carto, he reconfigured Youth for Wallace into the National Youth Alliance. By 1971, Pierce and Carto were openly feuding. Ongoing disagreements caused the NYA to split, and by 1974 Pierce's wing became known as the National Alliance.[15] Among the founding members of the board of the National Alliance was professor of classics at the University of Illinois Revilo P. Oliver, who was to have major impact of Pierce's life both as an adviser and friend.[20]\n\n2.3. National Alliance\n\nThe National Alliance was organized in 1974. Pierce intended the organization to be a political vanguard that would ultimately bring about a white nationalist overthrow of the United States Federal Government. Pierce spent the rest of his life living in West Virginia, where he hosted a weekly radio show, American Dissident Voices,[21] the internal newsletter National Alliance Bulletin (formerly called Action), and oversaw his publications, National Vanguard magazine (originally titled Attack!), Free Speech and Resistance, as well as books published by his publishing firm National Vanguard Books, Inc. (many of which promoted Holocaust denial) and his record company, Resistance Records. On the topic of the Holocaust, he believed that the number of deaths has been exaggerated, and that many of the details had been fabricated.[22]\n\nIn 1978, claiming that the National Alliance was an educational organization, Pierce applied for, and was denied, tax exemption by the Internal Revenue Service.[15] Pierce appealed, but an appellate court upheld the I.R.S. decision.[15] Around the same time, he was interviewed by Herbert Poinsett on Race and Reason, a public-access television cable TV talk show.[23]\n\nAn anti-zionist, he attempted during the Yom Kippur War to force McDonnell-Douglas into canceling military contracts that sent armaments to Israel, by buying shares of the company's stock and putting forward the motion at the national shareholder's meeting. The company rejected the motion and continued supplying Israel with weapons. Some of Pierce's later speeches on American Dissident Voices concerning the Arab–Israeli conflict were reprinted in Muslim publications and on websites, including that of the Lebanese Shia Islamist group Hezbollah.[24]\n\nIn 1985, Pierce moved his operations from Arlington, Virginia, to a 346-acre (1.40 km2) location in Mill Point, West Virginia that he paid for with $95,000 in cash.[15] Here, he founded the Cosmotheist Community Church, in what may have been a last-ditch effort to avoid paying taxes.[15] In 1986, the church applied again, this time successfully, for federal, state, and local tax exemptions, however lost its state tax exemption for all but 60 (out of nearly 400) acres, which had to be exclusively used for religious purposes.[25] The other 286 acres (1.16 km2) were used for both the National Alliance headquarters and the National Vanguard Books business and warehouse, and were denied tax exemption.\n\nIn 1990, the documentary series Different Drummer produced a portrait of Pierce, which was aired on PBS.[26] He later participated twice on a public-access television cable TV live talk show hosted by Ron Doggett, \"Race and Reality,\" aired from Richmond, Virginia.[27][28]\n\nOn May 19, 1996, Pierce made a rare personal appearance in the mainstream media, on 60 Minutes,[29][30] during which Pierce was asked by Mike Wallace if he approved of the Oklahoma City bombing, and he replied \"No. No, I don't. I've said that over and over again, that I do not approve of the Oklahoma City bombing because the United States is not yet in a revolutionary situation\".[29] Pierce was frequently described as a neo-Nazi,[15][16][24][31][31][32][33][34] although he personally rejected this label.[29] When confronted with the issue by Mike Wallace on 60 minutes, Pierce described the term as a \"slander\", while stating:\n\nI admire many things that Hitler wrote, many of the programs and policies that he instituted in Germany, but we do not blindly copy anyone else's policies or programs. We've formulated our own program in view of the situation that we face here in America today.[29]\n\nIn 1998, Pierce also appeared on a documentary produced by the Discovery Channel about white nationalism in the United States.[35] As the leader of the National Alliance, Pierce established contacts with other nationalist groups in Europe, including the National Democratic Party of Germany and the Greek party Golden Dawn.[15] Pierce's other recruiting efforts included a 51-minute[24] informational video titled America is a Changing Country,[36] and forming an anti-globalization group – the Anti-Globalization Action Network – to protest at the G8 summit in Canada in June 2002.[24]\n\nPierce's last public speech was made in Cleveland, Ohio, on April 28, 2002.[37] On July 23, 2002, he died of cancer. At the time, the National Alliance was bringing in more than $1 million a year, with more than 1,500 members, a paid national staff of 17 full-time officials, and was better known than at any time in its history, after which it entered a period of internal conflict and decline.\n\nAfter his death, the British National Party published an article in remembrance of him.[38]\n\nBefore Pierce died, he allowed Robert S. Griffin, a tenured professor of education at the University of Vermont, to live with him for a month, with the result being the self-published work The Fame of a Dead Man's Deeds (2001).[39] The book's title was taken from Pierce's favourite quote, an Old Norse proverb from the Hávamál in the Poetic Edda:[40]\n\nDeyr fé, deyja frændr, deyr sjálfr et sama; ek veit einn, at aldri deyr: dómr um dauðan hvern. Cattle die, kinsmen die you yourself die; I know one thing which never dies: the judgment of a dead man's life.[41]\n\n3. Novels\n\n3.1. The Turner Diaries\n\nPierce gained national public attention following the Oklahoma City bombing, as Timothy McVeigh was alleged to have been influenced by The Turner Diaries (1978), the novel written by Pierce under the pseudonym Andrew Macdonald.[15] The book is a graphically violent depiction of a future race war in the United States, which includes a detailed description of the \"Day of the Rope\" mass hangings of many \"race traitors\" (especially Jews, gay people, and those in interracial marriages or relationships) in the public streets of Los Angeles, followed by the systematic ethnic cleansing of the city, and eventually the entire world. This violence and killing is called \"terrible yet absolutely necessary\". The story is told through the perspective of Earl Turner, an active member of the white revolutionary underground The Organization, led by the secret inner circe known as The Order (a reorganized SS).\n\nThe part most relevant to the McVeigh case is in an early chapter, when the book's main character is placed in charge of bombing the FBI headquarters.[15] Some have pointed out similarities between the bombing in the book and the actual bombing in Oklahoma City that damaged the Alfred P. Murrah Federal Building and killed 168 people on April 19, 1995. When McVeigh was arrested later that day, pages from the book were found in his car, with several phrases highlighted, including \"But the real value of all of our attacks today lies in the psychological impact, not in the immediate casualties\" and \"We can still find them and kill them.\"[42][43]\n\nThe Turner Diaries also inspired a group of white revolutionary nationalists in the early 1980s who called themselves the Silent Brotherhood, or sometimes simply The Order.[15] The Order were an offshoot of the Aryan Nations. They were tired of being merely \"armchair revolutionaries\". The Order was connected to numerous crimes, including counterfeiting and bank robbery, and supposedly gave money to the Alliance.[15] The Order's leader, Robert Jay Mathews, died in a stand-off with police and federal agents on Whidbey Island, Washington (state) , when police fired flares into his hideout, igniting a fire. Other Order members, most notably the late David Lane, were all captured and sent to federal prisons, where they still continue to voice their support for white nationalist ideals. In 1996 Pierce sold the rights to The Turner Diaries to the Jewish publisher Lyle Stuart.[44]\n\n3.2. Hunter\n\nIn 1989, again under the Andrew Macdonald pen name, William Pierce published another novel, Hunter, which tells the story of a man named Oscar Yeager, a veteran of the Vietnam War and an F-4 Phantom pilot who assassinates interracial couples and liberal journalists, politicians and bureaucrats in the D.C. area. In interviews, Pierce called Hunter more realistic, and described his rationale for writing it as taking the reader through \"...an educational process\".\n\n4. Religion\n\nAlthough raised as a Presbyterian,[3] Pierce became an atheist as a teenager.[4][5] In the 1970s, however, Pierce created the religious philosophy of cosmotheism, based on a mixture of German romanticism, the Darwinian concept of natural selection, and Pierce's interpretation of George Bernard Shaw's play, Man and Superman. The Anti-Defamation League and the Southern Poverty Law Center assert that Pierce created cosmotheism in order to acquire tax-exempt status for the National Alliance after he had failed to do so earlier, and the SPLC refers to it as a \"bogus religion\".[15][16]\n\nIn effect, cosmotheism is a form of panentheism, asserting that \"all is within God and God is within all.\" It considers the nature of consciousness to be mutable and destined to evolve, via biological eugenics, towards a complete 'universal consciousness,' or godhood. The word cosmos means an orderly and harmonious universe. The purpose of cosmotheism, therefore, is the upwards-striving of biological life to ever higher forms of being.\n\nIn his speech \"Our Cause\", Pierce said:\n\nAll we require is that you share with us a commitment to the simple, but great, truth which I have explained to you here, that you understand that you are a part of the whole, which is the creator, that you understand that your purpose, the purpose of mankind and the purpose of every other part of creation, is the creator's purpose, that this purpose is the never-ending ascent of the path of creation, the path of life symbolized by our life rune, that you understand that this path leads ever upward toward the creator's self-realization, and that the destiny of those who follow this path is godhood.\n\nPierce described his form of panentheism as being based on \"[t]he idea of an evolutionary universe ... with an evolution toward ever higher and higher states of self-consciousness,\" and his political ideas were centered on racial purity and eugenics as the means of advancing the white race first towards a super race and then towards personal godhood. In his view, the white race represented the pinnacle of human evolution thus far and therefore it should be kept genetically separate from all other races, through racial segregation.\n\nPierce believed in a hierarchical society governed by what he saw as the essential principles of nature, and the survival of the fittest. He advocated white separatism, as, in his view, white people should remain separated from other races and establish a meritocracy. He thought that extensive programs of \"racial cleansing\" (mass expulsion) and eugenics, both in Europe and North America, would be necessary to achieve this socio-political program.\n\n5. Family\n\nPicture of Dr. William Pierce at an official National Alliance meeting in 1999, in Hillsboro, West Virginia. https://handwiki.org/wiki/index.php?curid=1136386\n\nPierce married five times. His first marriage was to Patricia Jones, a mathematician whom he met while attending California Institute of Technology. They were married in 1957, and had twin sons, Kelvin and Erik, born in 1960. Kelvin is an aerospace engineer, while Erik is a computer scientist.[6] The marriage ended in divorce in 1982.[45] Pierce remarried that same year to Elizabeth Prostel, whom he met in the National Alliance office in Arlington, Virginia. The marriage ended in 1985, at which time Pierce moved his headquarters to Southern West Virginia.[15] In 1986, Pierce married Hungarian Olga Skerlecz, a relative of Iván Skerlecz, Governor of Croatia-Slavonia, and the marriage lasted until 1990. Olga moved to California after their divorce.[45] Pierce then married another Hungarian woman named Zsuzsannah in early 1991. They met through an advertisement that Pierce placed in a Hungarian women's magazine aimed at arranging international marriages. Zsuzsannah moved to Florida after their divorce in the summer of 1996. His final marriage, which lasted until his death, was to another Hungarian woman, Irena, whom he married in 1997.[4]\n\n6. Works\n\nThe following works were published under the pseudonym \"Andrew MacDonald\":\n\nThe Turner Diaries\n\nHunter\n\nIn 1993, Pierce wrote the script of the comic book New World Order Comix #1: The Saga of White Will which was illustrated by Daniel \"Rip\" Roush and coloured by William White Williams.[46]"}, {"url": "https://abcnews.go.com/US/life-hater-dire-warning-white-power-leaders-son/story?id=73431332", "page_content": "With hate on the rise, the self-admitted ex-racist says it's time to speak out.\n\nDriving through a recent morning rain in the mountains of West Virginia, 60-year-old Kelvin Pierce grew nervous as he approached a gate in the middle of a mud-caked dirt road.\n\nHe had been there before, but that was nearly 20 years ago, when the compound beyond the gate headquartered what the FBI considered one of the most prolific and powerful white supremacist groups in America, the National Alliance – an organization led by his own father, Dr. William Luther Pierce.\n\n“To be honest, I have an awful lot of stuff going through my mind as I think about going up to this property,” Pierce confessed to an ABC News team, which accompanied him on the trip.\n\nHis father had purchased the sprawling 350-acre property in 1985, hoping that many Americans would “flock” to his “whites-only enclave,” and that the property would help kickstart the “cleansing of America, as he saw it,” according to Pierce. From Pierce's perspective, William Luther Pierce and his followers had two goals: to turn all of America into a \"white-only homeland,\" and to violently overthrow the U.S. government in the name of white nationalism.\n\nThough Pierce’s father died in 2002 and the National Alliance’s position in the white power movement has since faded, the hatred and bigotry behind it all have not. In fact, counterterrorism officials warn that, after years of decline, hate groups are once again proliferating inside the United States – an unnerving reality mirrored by what Pierce saw that rainy morning on the West Virginia compound.\n\n“It sat derelict for years, but now they have people working on the property, and they're kind of trying to bring it back to life,” Pierce said.\n\nWhen Pierce first negotiated for permission to tour the property, the new head of the National Alliance, Will Williams, even told Pierce: “Everybody thought we were down and out. But we're back. … We are definitely back,” Pierce recalled Williams saying.\n\nIn this Aug. 24, 2004, file photo, National Alliance members march on the yard of the Capitol Building along side other racists groups, like skinheads and klansmen during a protest in Washington, DC. David S. Holloway/Getty Images, FILE\n\nPierce is now racing to stop what he called the “illness” of hatred from spreading even more. That’s why he brought ABC News with him to West Virginia, opening up about his own racist past, the personal demons that fueled his hate, and the struggle he endured to defeat them.\n\n“There's hope that is engendered by a story like [mine],” he said. “If I could overcome that hatred, and that depression, and that feeling of unworthiness, then maybe somebody else could too.”\n\nBorn into bigotry\n\nPierce was raised to be a bigot.\n\nLike so many other American children, when he was young he often dreamed of visiting the nation’s capital – but his dreams were far different than those of most kids.\n\n“I remember fantasizing about going into Washington, D.C., standing on a street corner holding a machine gun, and mowing down Black people with that machine gun,” Pierce told ABC News in his first TV interview. “I used to actually fantasize about doing that.”\n\nWhen Pierce was nine, his father implemented a new rule for playtime at the community swimming pool: “If a Black person came and got into the pool, we had to leave,” Pierce said.\n\nIn high school, his father barred him from playing team sports because, Pierce remembers his father telling him, “You have to shower with Blacks” – “And he didn’t use the word ‘Blacks.’\"\n\nWhen Pierce was in college, his father published the novel “The Turner Diaries,” which experts describe as the white power movement’s “bible” with its depictions of a violent campaign against the U.S. government and a global race war that leads to the eradication of Jews, Black people and other non-whites.\n\nIn this Dec. 18, 2006, file photo, a copy of \"The Turner Diaries\" written Dr. William Luther Pierce under the pseudonym Andrew Macdonald sits on a shelve at the McClintic Library in Marlinton, W.Va. Jeff Gentner/AP, FILE\n\n“They were direct reflections of fantasies that he had, about actions that he wished he could carry out himself,” Pierce said of the stories in the book.\n\nThen, when Pierce was in his 20s, his father purchased the West Virginia property, which helped cement the elder Pierce as one of the most influential white supremacists in modern history.\n\nIn this Jan. 4, 2000, file photo, William Pierce, founder of the White Power group, National Alliance, is shown in Hillsboro, W.V. Michael Williamson/The Washington Post via Getty Images, FILE\n\nEven Timothy McVeigh, the nation’s most ruthless domestic terrorist, was a follower.\n\nBefore authorities caught up with McVeigh in 1995 for bombing the federal building in Oklahoma City, McVeigh called the National Alliance three times “to see if they had any safe havens,” McVeigh said in rarely-heard audiotapes obtained by ABC News.\n\nAnd when authorities arrested him, they found highlighted excerpts of “The Turner Diaries” in his car. He had bought the book “in bulk,” he said.\n\nPierce said he’s sure his father “absolutely” approved of the Oklahoma City bombing, which killed 168 people – including 19 children in a daycare center – and injured nearly 700 others.\n\nFire personnel gather at the base of the nine-story Alfred P. Murrah Federal building April 20, 1995, in Oklahoma City, Okla., prior to a walk-through of the area by media covering the April 19, 1995, fatal car bombing. AFP via Getty Images, FILE\n\n“He would say that, you know, ‘These are unfortunate results of what needs to happen for us to accomplish our goals,’” according to Pierce.\n\nWho 'planted that seed' of extremism\n\nEven today, Pierce said he isn’t quite sure who first “planted that seed” of extremist ideology in his father.\n\n“But once that seed was planted, he made a decision to germinate that seed, to nourish that seed and to grow that hatred,” Pierce said.\n\nWhat Pierce does know is that his father was a “very intelligent man” with a PhD in physics, who became somewhat lost professionally – that’s when his father began voraciously consuming racist literature and books such as Adolf Hitler’s “Mein Kampf,” Pierce said during hours of interviews.\n\nIn this Jan. 4, 2000, file photo, William Pierce, founder of the White Power group, National Alliance, shown in Hillsboro, W.V. Michael Williamson/The Washington Post via Getty Images, FILE\n\nThat’s also when his father stopped paying attention to his children – unless he was angrily beating them for some perceived infraction, Pierce said.\n\n“The only thing that was important to him was furthering his cause, and to bring about the revolution that he desperately hoped was going to happen,” Pierce said.\n\n‘My life as a hater’\n\nDespite how his father treated him – or precisely because of it – Pierce couldn’t help but feel drawn to his father’s racist ideologies.\n\n“I believed a lot of the stuff that [my dad] taught me,” Pierce recalled. “I wanted him to acknowledge me. I wanted him to be proud of me. I wanted him to love me.”\n\nPierce recounted how in one high school history class, he wrote a paper “on the virtues of Adolf Hitler.”\n\n“It was my futile effort to try to impress him,” according to Pierce, noting that he subsequently “spent a good portion of my life as a hater.”\n\nLooking back on his life, Pierce now believes that he began questioning his own racist beliefs even as far back as college.\n\nKelvin Pierce, 60, looks onto the property that his father bought in 1985 and turned into a white-only compound for the National Alliance. ABC News\n\nFor the first time, as a student at Virginia Tech in Blacksburg, Va., he was “starting to experience people from all over the world … people from every kind of race and religion that you can think of,” he said.\n\nBut it would take him another two decades to really dig into what had driven him to so much hate.\n\nHe said he had been feeling depressed – even worthless – for “a long, long time,” so around 2004 he sought help: “Therapy. Counseling. Spiritual studies. A lot of reading.”\n\n“And that's when I started this journey of challenging my thoughts and adopting a more spiritual worldview, and look at human beings,” he said. \"I learned that I did not need to attach myself and my self worth to all of the fearful and hateful thoughts … That I could choose different thoughts. That I could reach out for better feeling thoughts.”\n\nThose who spread hate “ultimately, deep down, whether they consciously recognize it or not, don't feel good about themselves,” he added.\n\nAccording to Pierce, hate is like a drug: “You take a drug to feel better, but you end up feeling worse in the long run.”\n\nNow what helps Pierce feel better is his work as a contractor and time with his wife and two children.\n\n‘A pivotal moment’\n\nIn the years after Barack Obama was elected the nation’s first Black president, Pierce “got lulled into the belief” that racism in America “was getting better,\" he said.\n\nBut, according to Pierce, that belief \"changed dramatically during the 2016 election cycle,” when he heard the inflammatory rhetoric that was being used by at least one major-party nominee for president.\n\nIn this Aug. 12, 2017, file photo, white nationalists, neo-Nazis and members of the \"alt-right\" clash with counter-protesters as they enter Emancipation Park during the \"Unite the Right\" rally in Charlottesville, Va. Chip Somodevilla/Getty Images, FILE\n\nAnd then, in August 2017, there was what Pierce described as “a pivotal moment for me,” when white supremacists from across the country gathered in Charlottesville, Va., in a violent rally that showcased how widespread ethnic and racial hatred had become in modern America.\n\n“Watching those people march, and carrying those torches, and singing … that, ‘You will not replace us,’ that immediately transported me back to my childhood, and to my father, and to everything that he believed in and everything that he was trying to accomplish,” Pierce said.\n\nOne woman was killed during clashes at the rally, and President Donald Trump’s subsequent claim days later that there were “very fine people on both sides” of the rally alarmed Pierce.\n\nBy “using division as a tool to gain and to hold onto power,” the Trump administration is “now making outward expressions of hatred in our country unassailable,” according to Pierce. Trump has denied such accusations, insisting his rhetoric only \"brings people together.\"\n\nBut for Pierce it's clear \"a monster that went into hibernation,\" as he put it, \"has come out of hibernation.”\n\nThat is why Pierce is now speaking out.\n\n“I was like, ‘Okay, if there is some thing I can do to counter this, then I have to do it,” he said. “There is no time better than right now to speak up and let other people know that if there's any chance, any part of their fiber, that doesn't like the way they're feeling, doesn't like being in hatred, [they can] chart a path in a different direction.”\n\nPresident Donald Trump speaks in the Oval Office at the White House, Sept. 17, 2020, in Washington. Alex Brandon/AP, FILE\n\n'Our enemies are rabid'\n\nOn that rainy morning on a West Virginia hilltop, the different path Pierce charted was evident as he walked around his father's former compound: He caught glimpses of his father's book, symbols of hate in windows, and the large National Alliance logo fastened to the front of the property's religious center decades ago.\n\nAccording to the Southern Poverty Law Center, the National Alliance is now one of nearly 70 hate groups operating inside the United States.\n\n“We in the National Alliance believe that our race is worth preserving,” Williams, the group’s chairman, told ABC News, even as he claimed the group no longer wants America to become a whites-only country and that it rejects violence.\n\n“[W]e, as racial separatists, simply advocate geographic separation of the races by whatever means it takes. Many whites will choose to continue living in a multi-racial society. That's all right.\"\n\nAsked whether their efforts could spark violence, Williams said: \"Hopefully not. We would like peaceful separation.\"\n\n\"But it's not going to be peaceful,\" he warned. \"Our enemies are rabid.\"\n\nPierce said the current state of the white power movement means there has been \"a pretty massive swing of the pendulum in the wrong direction.\"\n\nHe still strongly believes, however, that \"the pendulum is going to swing back in the other direction.\"\n\n\"Have a little hope,\" he said.\n\nABC News' Megan Christie, Alexandra Myers and Emily Ruchalski contributed to this report."}, {"url": "https://handwiki.org/wiki/Biography:William_Luther_Pierce", "page_content": "William Luther Pierce III (September 11, 1933 – July 23, 2002) was an American white supremacist, author, and political activist.[3][4] He was one of the most influential ideologues of the white nationalist movement for some 30 years before his death. A physicist by profession, he was also an author under the pseudonym Andrew Macdonald of the novels The Turner Diaries and Hunter. Pierce founded the National Alliance, a major white nationalist organization, which he led for almost thirty years.\n\nBorn in Atlanta, Georgia, to a Presbyterian family of Scots-Irish and English, Pierce was a descendant of Thomas H. Watts, the Governor of Alabama and Attorney General of the Confederate States of America during the American Civil War. As a child, Pierce did well academically, graduating from high school in 1952. He received a baccalaureate in physics from Rice University in 1955, earned a doctorate from University of Colorado at Boulder in 1962, and became an assistant professor of physics at the Oregon State University in 1962, where he joined the anti-communist John Birch Society. In 1965 he left his tenure at Oregon State University and became a senior researcher for the aerospace manufacturer Pratt & Whitney in Connecticut. In 1966 Pierce moved to the Washington, D.C. area and became an associate of George Lincoln Rockwell, who was assassinated in 1967, after which Pierce became co-leader of the National Youth Alliance, which split in 1974, with Pierce founding the National Alliance.\n\nIn 1978, Pierce wrote, under the pseudonym \"Andrew Macdonald\", the novel The Turner Diaries, which depicts a violent revolution in the United States, followed by world war, and the extermination of non-white races. In 1984, he wrote another novel, Hunter, portraying the actions of a lone-wolf white supremacist assassin. In 1985, Pierce relocated the headquarters of the National Alliance to Hillsboro, West Virginia, where he founded the Cosmotheist Community Church to receive tax exemption for his organization. Pierce spent the rest of his life in West Virginia hosting a weekly shortwave radio show, American Dissident Voices, publishing the internal newsletter National Alliance Bulletin (formerly called Action), and overseeing his publications, National Vanguard magazine (originally titled Attack!), Free Speech and Resistance, as well as books published by his publishing firm National Vanguard Books, Inc. and music produced by his record company, Resistance Records.\n\nIn 2002, Pierce died of cancer. At the time, the National Alliance was bringing in more than $1 million a year, with more than 1,500 members and a paid national staff of 17 full-time officials, and was better known than at any time in its history, after which it entered a period of internal conflict and decline.\n\nLife and career\n\nEarly life and education\n\nWilliam Pierce at a young age, in a high school military academy uniform.\n\nWilliam Luther Pierce III was born on September 11, 1933, to a Presbyterian[5][6][7] family of English and Scotch-Irish descent in Atlanta, Georgia, the son of William Luther Pierce Jr. and Marguerite Farrell. Pierce's younger brother, Sanders, an engineer, was born in 1936, and later assisted Pierce in his political activities.[8] His father was born in Christiansburg, Virginia in 1892. His mother was born in Richland, Georgia in 1910, with her family being part of the aristocracy of the Old South, descendants of Thomas H. Watts, the Governor of Alabama and Attorney General of the Confederate States of America.[9] After the American Civil War, the family lived a working-class existence.[10] Pierce's father once served as a government representative on ocean-going cargo ships and sent reports back to Washington, D.C.;[11] he later became manager of an insurance agency but was killed in a car accident in 1942.[12] After the elder Pierce's death, the family moved to Montgomery, Alabama and then to Dallas, Texas.[13]\n\nPierce performed well academically in school, skipping one grade. His last two years in high school were spent in a military academy.[14] As a teenager his hobbies and interests were model rockets, chemistry, radios, electronics, and reading science fiction.[11] His first aspiration was to become an astronaut.[15]\n\nAfter finishing military school in 1951, Pierce worked briefly in an oil field as a roustabout. He was injured when a four-inch (10 cm) pipe fell on his hand, and he spent the rest of that summer working as a shoe salesman.[16] Pierce earned a scholarship to attend Rice University in Houston, Texas. He graduated from Rice in 1955 with a baccalaureate in physics.[17][18] He worked at the Los Alamos National Laboratory before attending graduate school, first at Caltech and then the University of Colorado in Boulder, Colorado, where he earned his doctorate in 1962.[17] He taught physics as an assistant professor at Oregon State University from 1962 to 1965.[19]\n\nEarly political activities\n\nHis tenure as assistant professor at Oregon State University (1962–1965) coincided with the rise of two social movements, the Civil Rights Movement and the Anti-Vietnam War movement, which he regarded as Jewish-led, communist-inspired, and a threat to European Americans. He was briefly a member of the anti-communist John Birch Society in 1962,[20] but eventually resigned. In 1965, in order to finance his political ambitions, Pierce left his tenure at Oregon State University and relocated to North Haven, Connecticut, to work as a senior researcher at the Advanced Materials Research and Development Laboratory of aerospace manufacturer Pratt & Whitney.[13] In 1966, moved to the Washington, D.C. and became an associate of George Lincoln Rockwell, founder of the American Nazi Party. During this time he was the editor of the party's ideological journal, National Socialist World. When Rockwell was murdered in 1967, Pierce became one of the leading members of the National Socialist White People's Party, the successor to the ANP.\n\nAccording to the American neo-Nazi James Mason, during the first National Socialist World Congress in 1969, when a delegate asked what should be done with \"White race traitors\", Pierce formed with his hand a pistol being fired, rousing the audience to its feet.[21]\n\nIn 1968, Pierce left the NSWPP and joined Youth for Wallace, an organization supporting former Governor of Alabama George Wallace's bid for the presidency.[18] In 1970, along with Willis Carto, he reconfigured Youth for Wallace into the National Youth Alliance. By 1971, Pierce and Carto were openly feuding. Ongoing disagreements caused the NYA to split, and by 1974 Pierce's wing became known as the National Alliance.[17] Among the founding members of the board of the National Alliance was professor of classics at the University of Illinois Revilo P. Oliver, who was to have major impact of Pierce's life both as an adviser and friend.[22]\n\nNational Alliance\n\nThe National Alliance was organized in 1974. Pierce intended the organization to be a political vanguard that would ultimately bring about a white nationalist overthrow of the United States Federal Government. Pierce spent the rest of his life living in West Virginia, where he hosted a weekly radio show, American Dissident Voices,[23] the internal newsletter National Alliance Bulletin (formerly called Action), and oversaw his publications, National Vanguard magazine (originally titled Attack!), Free Speech and Resistance, as well as books published by his publishing firm National Vanguard Books, Inc. (many of which promoted Holocaust denial) and his record company, Resistance Records. On the topic of the Holocaust, he believed that the number of deaths has been exaggerated, and that many of the details had been fabricated.[24]\n\nIn 1978, claiming that the National Alliance was an educational organization, Pierce applied for, and was denied, tax exemption by the Internal Revenue Service.[17] Pierce appealed, but an appellate court upheld the I.R.S. decision.[17] Around the same time, he was interviewed by Herbert Poinsett on Race and Reason, a public-access television cable TV talk show.[25]\n\nAn anti-zionist, he attempted during the Yom Kippur War to force McDonnell-Douglas into canceling military contracts that sent armaments to Israel, by buying shares of the company's stock and putting forward the motion at the national shareholder's meeting. The company rejected the motion and continued supplying Israel with weapons. Some of Pierce's later speeches on American Dissident Voices concerning the Arab–Israeli conflict were reprinted in Muslim publications and on websites, including that of the Lebanese Shia Islamist group Hezbollah.[26]\n\nIn 1985, Pierce moved his operations from Arlington, Virginia, to a 346-acre (1.40 km2) location in Mill Point, West Virginia that he paid for with $95,000 in cash.[17] Here, he founded the Cosmotheist Community Church, in what may have been a last-ditch effort to avoid paying taxes.[17] In 1986, the church applied again, this time successfully, for federal, state, and local tax exemptions, however lost its state tax exemption for all but 60 (out of nearly 400) acres, which had to be exclusively used for religious purposes.[27] The other 286 acres (1.16 km2) were used for both the National Alliance headquarters and the National Vanguard Books business and warehouse, and were denied tax exemption.\n\nIn 1990, the documentary series Different Drummer produced a portrait of Pierce, which was aired on PBS.[28] He later participated twice on a public-access television cable TV live talk show hosted by Ron Doggett, \"Race and Reality,\" aired from Richmond, Virginia.[29][30]\n\nOn May 19, 1996, Pierce made a rare personal appearance in the mainstream media, on 60 Minutes,[31][32] during which Pierce was asked by Mike Wallace if he approved of the Oklahoma City bombing, and he replied \"No. No, I don't. I've said that over and over again, that I do not approve of the Oklahoma City bombing because the United States is not yet in a revolutionary situation\".[31] Pierce was frequently described as a neo-Nazi,[17][18][26][33][33][34][35][36] although he personally rejected this label.[31] When confronted with the issue by Mike Wallace on 60 minutes, Pierce described the term as a \"slander\", while stating:\n\nI admire many things that Hitler wrote, many of the programs and policies that he instituted in Germany, but we do not blindly copy anyone else's policies or programs. We've formulated our own program in view of the situation that we face here in America today.[31]\n\nIn 1998, Pierce also appeared on a documentary produced by the Discovery Channel about white nationalism in the United States.[37] As the leader of the National Alliance, Pierce established contacts with other nationalist groups in Europe, including the National Democratic Party of Germany and the Greek party Golden Dawn.[17] Pierce's other recruiting efforts included a 51-minute[26] informational video titled America is a Changing Country,[38] and forming an anti-globalization group – the Anti-Globalization Action Network – to protest at the G8 summit in Canada in June 2002.[26]\n\nPierce's last public speech was made in Cleveland, Ohio, on April 28, 2002.[39] On July 23, 2002, he died of cancer. At the time, the National Alliance was bringing in more than $1 million a year, with more than 1,500 members, a paid national staff of 17 full-time officials, and was better known than at any time in its history, after which it entered a period of internal conflict and decline.\n\nAfter his death, the British National Party published an article in remembrance of him.[40]\n\nBefore Pierce died, he allowed Robert S. Griffin, a tenured professor of education at the University of Vermont, to live with him for a month, with the result being the self-published work The Fame of a Dead Man's Deeds (2001).[41] The book's title was taken from Pierce's favourite quote, an Old Norse proverb from the Hávamál in the Poetic Edda:[42]\n\nDeyr fé, deyja frændr, deyr sjálfr et sama; ek veit einn, at aldri deyr: dómr um dauðan hvern. Cattle die, kinsmen die you yourself die; I know one thing which never dies: the judgment of a dead man's life.[43]\n\nNovels\n\nThe Turner Diaries\n\nPierce gained national public attention following the Oklahoma City bombing, as Timothy McVeigh was alleged to have been influenced by The Turner Diaries (1978), the novel written by Pierce under the pseudonym Andrew Macdonald.[17] The book is a graphically violent depiction of a future race war in the United States, which includes a detailed description of the \"Day of the Rope\" mass hangings of many \"race traitors\" (especially Jews, gay people, and those in interracial marriages or relationships) in the public streets of Los Angeles, followed by the systematic ethnic cleansing of the city, and eventually the entire world. This violence and killing is called \"terrible yet absolutely necessary\". The story is told through the perspective of Earl Turner, an active member of the white revolutionary underground The Organization, led by the secret inner circe known as The Order (a reorganized SS).\n\nThe part most relevant to the McVeigh case is in an early chapter, when the book's main character is placed in charge of bombing the FBI headquarters.[17] Some have pointed out similarities between the bombing in the book and the actual bombing in Oklahoma City that damaged the Alfred P. Murrah Federal Building and killed 168 people on April 19, 1995. When McVeigh was arrested later that day, pages from the book were found in his car, with several phrases highlighted, including \"But the real value of all of our attacks today lies in the psychological impact, not in the immediate casualties\" and \"We can still find them and kill them.\"[44][45]\n\nThe Turner Diaries also inspired a group of white revolutionary nationalists in the early 1980s who called themselves the Silent Brotherhood, or sometimes simply The Order.[17] The Order were an offshoot of the Aryan Nations. They were tired of being merely \"armchair revolutionaries\". The Order was connected to numerous crimes, including counterfeiting and bank robbery, and supposedly gave money to the Alliance.[17] The Order's leader, Robert Jay Mathews, died in a stand-off with police and federal agents on Whidbey Island, Washington (state) , when police fired flares into his hideout, igniting a fire. Other Order members, most notably the late David Lane, were all captured and sent to federal prisons, where they still continue to voice their support for white nationalist ideals. In 1996 Pierce sold the rights to The Turner Diaries to the Jewish publisher Lyle Stuart.[46]\n\nHunter\n\nIn 1989, again under the Andrew Macdonald pen name, William Pierce published another novel, Hunter, which tells the story of a man named Oscar Yeager, a veteran of the Vietnam War and an F-4 Phantom pilot who assassinates interracial couples and liberal journalists, politicians and bureaucrats in the D.C. area. In interviews, Pierce called Hunter more realistic, and described his rationale for writing it as taking the reader through \"...an educational process\".\n\nReligion\n\nAlthough raised as a Presbyterian,[5] Pierce became an atheist as a teenager.[6][7] In the 1970s, however, Pierce created the religious philosophy of cosmotheism, based on a mixture of German romanticism, the Darwinian concept of natural selection, and Pierce's interpretation of George Bernard Shaw's play, Man and Superman. The Anti-Defamation League and the Southern Poverty Law Center assert that Pierce created cosmotheism in order to acquire tax-exempt status for the National Alliance after he had failed to do so earlier, and the SPLC refers to it as a \"bogus religion\".[17][18]\n\nIn effect, cosmotheism is a form of panentheism, asserting that \"all is within God and God is within all.\" It considers the nature of consciousness to be mutable and destined to evolve, via biological eugenics, towards a complete 'universal consciousness,' or godhood. The word cosmos means an orderly and harmonious universe. The purpose of cosmotheism, therefore, is the upwards-striving of biological life to ever higher forms of being.\n\nIn his speech \"Our Cause\", Pierce said:\n\nAll we require is that you share with us a commitment to the simple, but great, truth which I have explained to you here, that you understand that you are a part of the whole, which is the creator, that you understand that your purpose, the purpose of mankind and the purpose of every other part of creation, is the creator's purpose, that this purpose is the never-ending ascent of the path of creation, the path of life symbolized by our life rune, that you understand that this path leads ever upward toward the creator's self-realization, and that the destiny of those who follow this path is godhood.\n\nPierce described his form of panentheism as being based on \"[t]he idea of an evolutionary universe ... with an evolution toward ever higher and higher states of self-consciousness,\" and his political ideas were centered on racial purity and eugenics as the means of advancing the white race first towards a super race and then towards personal godhood. In his view, the white race represented the pinnacle of human evolution thus far and therefore it should be kept genetically separate from all other races, through racial segregation.\n\nPierce believed in a hierarchical society governed by what he saw as the essential principles of nature, and the survival of the fittest. He advocated white separatism, as, in his view, white people should remain separated from other races and establish a meritocracy. He thought that extensive programs of \"racial cleansing\" (mass expulsion) and eugenics, both in Europe and North America, would be necessary to achieve this socio-political program.\n\nFamily\n\nPicture of Dr. William Pierce at an official National Alliance meeting in 1999, in Hillsboro, West Virginia.\n\nPierce married five times. His first marriage was to Patricia Jones, a mathematician whom he met while attending California Institute of Technology. They were married in 1957, and had twin sons, Kelvin and Erik, born in 1960. Kelvin is an aerospace engineer, while Erik is a computer scientist.[8] The marriage ended in divorce in 1982.[47] Pierce remarried that same year to Elizabeth Prostel, whom he met in the National Alliance office in Arlington, Virginia. The marriage ended in 1985, at which time Pierce moved his headquarters to Southern West Virginia.[17] In 1986, Pierce married Hungarian Olga Skerlecz, a relative of Iván Skerlecz, Governor of Croatia-Slavonia, and the marriage lasted until 1990. Olga moved to California after their divorce.[47] Pierce then married another Hungarian woman named Zsuzsannah in early 1991. They met through an advertisement that Pierce placed in a Hungarian women's magazine aimed at arranging international marriages. Zsuzsannah moved to Florida after their divorce in the summer of 1996. His final marriage, which lasted until his death, was to another Hungarian woman, Irena, whom he married in 1997.[6]\n\nWorks\n\nThe following works were published under the pseudonym \"Andrew MacDonald\":\n\nThe Turner Diaries\n\nHunter\n\nIn 1993, Pierce wrote the script of the comic book New World Order Comix #1: The Saga of White Will which was illustrated by Daniel \"Rip\" Roush and coloured by William White Williams.[48]\n\nSee also\n\nAsa Earl Carter, a white supremacist who also wrote novels, under the pseudonym Forrest Carter.\n\nReferences\n\nNotes\n\nBibliography\n\nFurther reading\n\nContemporary Voices of White Nationalism in America. Cambridge University Press. 0-521-81673-4. Swain, Carol M.; Russ Nieli (March 24, 2003).. Cambridge University Press. ISBN\n\n\n\n\n\n\n\n\n\n"}, {"url": "https://en.metapedia.org/wiki/National_Socialist_White_People%27s_Party_(1967-1983)", "page_content": "The National Socialist White People’s Party (NSWPP) was founded on January 1, 1967 by George Lincoln Rockwell. The group was the successor to Rockwell’s American Nazi Party (ANP). Later that year (August 25) Rockwell was assassinated by former party member John Patler; the party continued under the leadership of Matt Koehl. In November 1982 Koehl announced a change the direction of the NSWPP and formed New Order a quasi-religious group that revered Adolf Hitler.\n\nIn keeping with the new direction, Rockwell adopted the slogan “White Power” replacing “Sieg Heil” as a rallying cry. The new strategy would be to capitalize on growing support in the wake of successful rallies in Chicago and to focus the organization’s commitment to a universal white nationalism as opposed to Nordic or Anglo-Saxon provincialism. An internal party newsletter, the National Socialist Bulletin, was started to convey and help direct these new efforts.\n\nOn June 9-11, 1967, the party held its national conference in Arlington aimed at reorganizing its leadership and “charting a new course of professionalism.” In July, 1967, The ANP party publication The Stormtrooper magazine was replaced by a newspaper titled White Power. Some within the NSWPP opposed this new ideological direction.\n\nOne of their new outreach techniques was the establishment of a White Power Message telephone recording line. Their Ideological Officer Dr. William Pierce would write and record the messages. From FBI files a few of these messages have been preserved.[1] [2]\n\nThe party’s youth branch was the National Socialist Youth Movement.\n\nThe party was dissolved on January 1, 1983 and reorganized as the New Order.[3]\n\nNotes"}, {"url": "https://www.findagrave.com/memorial/66027922/william-luther-pierce", "page_content": "There is a problem with your email/password.\n\nWe’ve updated the security on the site. Please reset your password.\n\nYour account has been locked for 30 minutes due to too many failed sign in attempts. Please contact Find a Grave at [email protected] if you need help resetting your password.\n\nThis account has been disabled. If you have questions, please contact [email protected]\n\nEmail not found\n\nPlease complete the captcha to let us know you are a real person.\n\nFound more than one record for entered Email\n\nThere is a problem with your email/password.\n\nYou need to confirm this account before you can sign in. Resend Activation Email\n\nWe have sent you an activation email\n\nPlease enter your email to sign in.\n\nPlease enter your password to sign in.\n\nPlease enter your email and password to sign in.\n\nThere is a problem with your email/password.\n\nA system error has occurred. Please try again later.\n\nA password reset email has been sent to EmailID. If you don't see an email, please check your spam folder.\n\nWe encountered an unknown problem. Please wait a few minutes and try again. If the problem persists contact Find a Grave."}, {"url": "http://heretical.com/miscella/hbarrett.html", "page_content": "I arrived at the National Socialist White People’s Party on Hitler’s Birthday, April 20, 1968. Party member Robert Homan was the first person I met that evening, and he made an extremely good impression. As welcoming as he was, it was still a peculiar experience to be received in the highly professional environment that the party offered at that time, being a two story office building that had once been a dental office.\n\nAnd it wasn’t just any day that one met a “duty officer” in brownshirt uniform. Each one taking his shift routinely wore a German automatic pistol in both the reception area and the mail room. The reception area had a couch and chair, leaflet rack, and a books for sale rack. One wall was decorated with a swastika flag, and another had unusually large framed photos of Hitler and George Lincoln Rockwell. Within a day or so Homan also invited me to see what was left of the old headquarters up on Hatemonger Hill.\n\nA partial demolition had occurred up there since the assassination, so there was little to see, but he soon asked to be left alone for a few minutes to meditate. He had earlier told me of meeting Rockwell in Seattle, and was now standing on a collapsed wooden wall. This was part of a huge pile of debris that had once been Rockwell’s mansion, which had once stood a few yards further south of us. Down the hill and across the street, I was then shown the Laundromat parking lot where Rockwell had been assassinated, and it was difficult to accept that anything so unusual had ever happened there.\n\nWhen Homan and I returned to the headquarters at 2507 North Franklin Road, “Captain” Chris Vidnjevich joined the conversation and it soon got around to John Patler (originally Patsalos), the convicted assassin. Chris soon took me over to complete the tour by showing me Patler’s apartment.\n\nPatler had been convicted by this time, of course, but remarkably he was temporarily out on bail already. As I had never met Patler, and was still a greenhorn at that time to the party’s harassment campaign against him, I was merely asked to be visible and stand alongside Chris as an observer.\n\nChris then mounted the front left fender of his own vehicle – just as he had done on the roof of Rockwell’s hearse outside Culpeper National Cemetery – and he yelled at the top of his lungs at the unseen Patler. And it certainly amazed me that Patler had returned to Arlington so soon, living just blocks from the new headquarters.\n\nMonths later, at a much more ordinary gathering at a party member’s apartment for a chess game, I was introduced to Eric Wenberg, an activist from Australia. He was the fellow who had leaped at Patler during the trial and screamed: “Patler, you filthy swine! You assassin!”\n\nIt had taken six cops to subdue Wenberg, and even in handcuffs he had continued to yell: You filthy assassin! Long live the American Nazi Party! Long live Matt Koehl! What was most intriguing about Wenberg in this more relaxed setting was how he made such a modest and civilized impression because of his looks, education, and clothing. He was a valued adherent by any standard.\n\nPrior to the internal split that was to follow in 1970, I was an official supporter sharing an apartment with Dr. Pierce’s secretary, Earl, first at the building the party had temporarily occupied after the Rockwell assassination, then elsewhere. I also got along quite well with Robert Lloyd, the party’s number two person; especially after having served as his armed bodyguard during an extensive tour of television and radio stations across the Northwest states. We also visited units and supporters throughout that area.\n\nCommander Koehl had asked Lieutenant Lloyd, when we reached the Chicago portion of the tour, to confer with Frank Collin the Chicago leader and ask him to step down. The officers at party headquarters now believed that they were in possession of overwhelming evidence that he was racially Jewish, and they hoped to deal with it quietly and privately.\n\nWhile leaving one of the television studios, our host’s representative asked if we would like to meet Black Panther leader Fred Hampton, who was waiting for his own turn to come on camera. Our beautiful guide seemed to relish the peculiarity of this social opportunity, and we both assented to the invitation.\n\nHampton rose from his seat and we shook hands after the introduction. He made an extremely good impression on me, and apparently many others saw a worthy warrior in him, so I was saddened when he was eventually murdered in his bed during a controversial ambush by Chicago police.\n\nWhen we returned to Arlington, after having survived a wheel nearly falling off the car along the road because of mysteriously loosened lug nuts, I was offered the opportunity to become one of the few formal party members. It seemed a natural progression, as I had already participated in nearly every wild punch-up party officials had asked us to instigate with anti-war demonstrators, while they now adopted a new custom of often staying hidden and directing from a position of safety.\n\nThere were also two incidents that caused me to lose faith in the NSWPP’s program; the first being a nasty attack we made against an anti-war meeting at the Quaker Church, and the second was an attack against a young man – without any connection to politics – because he had long hair. I soon realized that I was opposed to the war myself, but that the party’s conservative tendencies were supporting the establishment’s war.\n\nLloyd consulted with Pierce and Koehl, and as the rank and file had already assumed I had become a member, some registered their surprise when I turned this invitation down. I was beginning to realize that I was too ideologically different from the NSWPP; it tended to be more predictably conservative than a synthesis of contradictory social currents. The party increasingly seemed like an impotent cult as well, a parody of another time and place despite all the efforts to find a more modern image.\n\nI declined their invitation just shortly before the Koehl/Pierce dispute – or what Pierce’s secretary, Earl, so appropriately dubbed “The Big Split” – but remained active as an official supporter. That was fortuitous for the recording of radical political history, as I soon witnessed the riveting events that two recently published histories on the party barely touched upon.\n\nWhen Koehl and his security chief Chris Vidnjevich pre-planned putting Pierce out, they decided to begin by undermining those who might support him. Chris decided to criticize Earl’s routine office work, hoping he would quietly submit and quit his job first. The way this plan unrolled, however, was to disappoint and frustrate them.\n\nEarl didn’t realize this unexpected criticism was part of a larger game, and as he felt there was actually nothing wrong with his work, he soon went upstairs to complain to Commander Koehl about Chris’ “peculiar behavior.” This visit to Koehl effectively obstructed them, as Earl reminded Koehl of his unblemished loyalty and long service to him.\n\nAnd Koehl was indeed someone who put an emphasis on the “leadership principle.” Chris, however, didn’t give up, and on a following day attempted to just physically push Earl right out the front door, as if he had the authority to fire an unwanted employee.\n\nNow that Earl felt “morally supported by Koehl,” he was just as determined and struggled to physically resist Chris. During the wrestling match that ensued, Chris ended up with his own back to the door, then was hurled through the glass panel in it. The front door at 2507 North Franklin Road had swung into its completely closed position. (They routinely posted 24 hour security, so the glass just didn’t matter until that moment.)\n\nDespite all this, Chris suffered no noticeable injury, as he had gone through backwards and managed to catch his fall by stepping through. Remarkably, Earl still managed to hold onto his position as duty officer at the public reception office, but the incident with Chris prompted Koehl to reposition him to the party’s bookstore a few blocks down the street. Koehl and Chris decided to resort to a second plan, and meanwhile, someone began circulating word that Earl was insane.\n\nPart of this was due to a previous incident, where two members of the area’s most feared motorcycle gang, the Pagans, entered the party’s public reception office to test the metal of the staff members. Around that time the Pagans were involved in an incident where they had killed a member of the Hell’s Angels, sealed his body in an oil can, then dropped it off a bridge. As fate would have it, Earl was the duty officer on the day they came over. He also knew their reputation.\n\nAnd when the boldest of the two outlaws picked up a 50 cent White Power pin, and openly made known his intention to leave without paying, Earl withdrew his Walther P-38 from its holster and chambered a round. Then he took aim at his potential target while both bad boys stared in disbelief. Eventually they lost heart and departed. Years later I had an opportunity to know Earl much better, and I came to realize that he was capable of pulling that trigger to save face.\n\nAlthough Chris was Koehl’s security chief, he actually wasn’t a full time and much underpaid activist on staff, like Earl (who often had no money to even eat), so the excitement about he and Earl also clashing simply died down until the night of the “surprise party” for Pierce.\n\nOn that evening, Earl telephoned me from the George Lincoln Rockwell book shop. He informed me that Koehl had just convened an emergency meeting in his office, which was located on the street side of the second floor of the NSWPP (Pierce and Lloyd also had offices on that floor).\n\nKoehl had summoned every warm body he could find, including official supporters who were rarely invited up there. It began as a show of strength, then Koehl and Chris used it as a kangaroo court to drive Pierce out of the party. As I was on the ‘do not invite’ list, I heard from others later that the atmosphere was quite nasty, as the charges against Pierce were shouted at him. When he replied to the accusations, this increased to a physically intimidating level, and he was there by himself.\n\nMostly, of course, it was centered on Pierce being an advocate for the more aggressive style of activism that he’s still known for today, and the way he didn’t take a leader too seriously if that person enjoyed wearing foreign looking uniforms. Then Pierce went home to work on a written reply to be distributed to party members and supporters all over the world. The locks were changed soon after he departed.\n\nKoehl had scheduled that surprise meeting to coincide with the most obvious Pierce supporters being excluded; including Robert Lloyd being out of town on business, and Pierce’s personal secretary Earl routinely manning the George Lincoln Rockwell book shop. (Earl had been to all previous member meetings.)\n\nKoehl had also sent someone to ask me to go alone on a one man demonstration. I was to be asked to handcuff myself to the White House fence and spend a night in the DC jail, which was populated nearly 100% by Black inmates.\n\nStunts of that nature were more associated with Rockwell’s vaudeville style. It was out of character that Koehl would ask such a thing, and I would have noticed even if his request reached me in time. Koehl’s messenger, however, failed to connect up with me before the surprise party was sprung on Pierce, so I remained a risk factor for being associated with Earl and Lloyd.\n\nWhen I arrived at the book shop and heard the details about the surprise meeting to force Pierce out, it was soon followed by Bill Kirstein (a former organizer from California) rushing in. He was a bit out of breath, and looked as if he was ready to pounce on someone, but he had only come from headquarters to seize the day’s cash receipts from the shop for Koehl.\n\nI had come to realize that the party’s activities were far off the track of practical politics, but I hadn’t anticipated this rift between Pierce and Koehl. Before we could close the door after Kirstein, however, about six more party people arrived, including member Robert Homan. He was casually bearing a shotgun, and perhaps others were armed as well, but all they did was recite what they had seen at the meeting.\n\nTo use Otto Skorzany’s way of expressing it, they were still too shocked by the events to influence them. At that time few knew there even was going to be a bigger split – with more personnel than Pierce leaving, but Earl and I at this point had decided to cast our lot with Pierce – and likely Lloyd – come what may.\n\nAfter almost an hour of this casual but excited gathering going on in the store, Earl and I shooed them out of there. We emphasized that the excitement was over, it seemed that way, but we wanted to take firmer possession of the shop.\n\nWe locked the shop up for Earl, and it was to remain in his control until Lloyd returned those few days later. We soon knew Pierce had telephoned Lloyd from his own home and established that he too might bail out.\n\nAs tragic as it was to see so many comrades fall out, and let me assure you it was emotionally difficult sometimes, we still had a good chuckle about how the highly organized plotters from HQ had thought of the day’s receipts while we seized the book shop.\n\nThe following day Pierce returned to the book shop, about three blocks down from the headquarters. Earl was already armed and keeping the shop secure, so Pierce asked me now to assist further by taking possession of Lloyd’s house, which was located directly across the street from the headquarters. And the party ran a printing press in its basement.\n\nAlthough Pierce had spoken on the telephone with Lloyd and knew he was supportive of his plight, Koehl wasn’t as sure which way Lloyd would go in this falling out, so I accompanied Pierce to Lloyd’s house before that cat was out of the bag. Until the split, party members routinely went across the street to Lloyd’s house to run the printing press in the basement, so they had other keys.\n\nAs Pierce was the only one armed, he personally searched the house and basement himself, then came back to report that he saw about three party members in the basement working away as if all was still right with the world. Pierce suggested that I send them on their way, in as casual a manner as possible, and inform them that I was taking armed possession of the house.\n\nPierce then loaned me his own revolver for that purpose, a .38 with an extremely unusual light aluminum frame, and he went about his business elsewhere. I had only borrowed this gun on one other occasion, when I needed to qualify at a shooting range to gain NRA certification for security work.\n\nNext to me at the range that day was the man who in 1963 had driven the hearse carrying Kennedy’s coffin (the one with the handle broken off). After seeing my score he sensed that the weapon was making a difference, so I let him qualify for his own with it as well.\n\nAfter entering the basement of Lloyd’s house from the back, I informed the party workers that they were done for the day and that I was securing the area. As they went about the business of cleaning up, I spoke to a party member that Koehl had recently detailed to work alongside Lloyd hoping to keep tabs of his loyalties.\n\nThis particular party member was a former paratrooper who had served in Vietnam, and he shared an active passion for firearms with Lloyd, but he was not armed when I spoke to him. He was also the person who had been delegated to pass the message to me about Koehl “needing me to go on a suicide mission,” as we jokingly referred to some things. But it was too late for that message now.\n\nI was a bit more direct with him, explaining that there would be a physical risk to anyone who decided to force their way in later. It’s not that I was looking for trouble, but I sensed that a little early aggressiveness could save me from having to deal with any more Koehl supporters than necessary.\n\nThen I asked this man to take a message across the street to party headquarters, along with my refusal to take any further orders from Koehl about the suicide mission: “Just inform them that I have secured the house, and if anyone breaks in I will have no choice but to shoot.”\n\nThis party member then smiled nervously and said “You’re kidding.” Then he asked if I had a firearm to accomplish the purpose. Even so, it didn’t take much more convincing, as he was already feeling like a Judas for having spied on Lloyd; so he just acknowledged how the tension was rising and promised to deliver the message.\n\nHaving secured the basement, and then the upstairs of the house, I soon realized that it would be unsafe to wander too far from the front room areas. Chris had already been through the house with an entourage of mostly non-member loyalists (and they had also searched any living accommodations shared with other comrades, including mine).\n\nThe raiders had been into Lloyd’s office looking for any paperwork that might reveal what he, Pierce, or anyone else was communicating. Paperwork of that nature did not exist, so these unnecessary searches were especially chilling. The diary pages of Lloyd’s beautiful and sensitive wife were also examined thoroughly, but they revealed nothing more than her spiritual contemplations.\n\nThe atmosphere remained tense throughout my stay, although I was visited by people who were secretly sympathetic to Pierce, and there were little incidents such as these:\n\nParty supporter Eugene climbed over the fence during the night, after being asked to give a report on what I was doing, but as I kept the lights off and he suspected a gun might be pointed in his direction, he soon climbed right back out.\n\nDuring the daytime a supporter of the party’s youth organization crossed the street and pleaded to join up with me. What he had to say only stirred my suspicions, and so being unable to determine his motives I sent him away.\n\nThe next morning Chris Vidnjevich attempted to enter the house at the front door, using the lockout key, so I slammed the inner door with as much force as I had in me to simulate a gun shot. In response, he leaped off the steps and chambered a round into his automatic, but fortunately he stayed away.\n\nSoon I began answering telephone calls, as Pierce had instructed me to, on the extension to the main party telephone inside Lloyd’s house. People such as Joe Tommasi, the California leader in El Monte, were calling the party headquarters on routine business and discovering what was going on.\n\nOccasionally Chris Vidjevich would come on the line from either Koehl’s office or the duty officer’s area downstairs as I fielded these calls, threatening my life. But as it was necessary to tell our side of the story, I continued to take calls and educate members at every opportunity.\n\nLate that night party supporter Richard Bierderman, accompanied by someone else, threw a large rock at the front door. After I opened the door to admonish them about that, I found that they weren’t interested in carrying this any further. Soon I went back to sleep.\n\nWeeks earlier Biederman and I had narrowly won a street fight with four men in Georgetown, and celebrated together at the local pizza parlor, so the entire situation was especially twisted.\n\nEventually Lloyd returned home and thanked me for taking care of his property (this included his unusually large gun collection; the gun Patler had used to kill Rockwell in 1967; and Commander Rockwell’s entire wardrobe).\n\nLloyd also asked one last favor: that I would remain until he used an ax to break into his own second floor office across the street at the headquarters. Party supporter Eugene was on guard there now, positioned by Koehl or Chris who were nowhere in sight, and he was refusing normal access to Lloyd.\n\nKoehl had gone home, Chris I presume had gone to his day job, and Eugene really wasn’t apprised of what was what; for although Lloyd’s political position was indeed undetermined (though suspected of being close to Pierce) he was still legally on the corporation as much as Pierce and Koehl. And Koehl had hoped to win Lloyd over to opposing Pierce as well.\n\nLloyd soon chopped his way through the door, which was an act remarkably similar to what Jack Nicolson did in a movie released years later called The Shining , but O’Neil did not shoot him and gave up control of the offices.\n\nOnce Lloyd was in the office, as O’Neil told me years later in San Francisco, Lloyd got on the telephone and loudly demanded that Koehl explain how he could have taken this idiotic action without consulting him.\n\nIt was an especially animated conversation, and during the course of it Lloyd punctuated some point or other by punching his fist right through the plaster wall inside Koehl’s office. I don’t know which wall, but I always visualized that it was the one which had a very long black and white photograph of the Nuremberg Rally on it.\n\nLloyd then returned back across the street, informed me that all was returning to normal – or our equivalent of it – and he drove me home. As we pulled away duty officer Parsons stood in the doorway and stared our way.\n\nHe had been around a long time and seemed pretty tired of the internal disputes himself. I was certainly happy to be away from all the excitement of the previous two days, as I still had on the same clothes throughout this and wasn’t totally rested either.\n\nAdditional conversations between Koehl, Pierce, and Lloyd in the following days eventually led to a truce of sorts. And during that period Lloyd went about his normal business between there, his home, appearing in court against Patler (who had since sued about alleged telephone harassment while out on bond for a time) and the George Lincoln Rockwell book shop.\n\nLloyd owned most of the stock at the book store anyway, but the three leaders shared total ownership of the “party” itself. One day during this transition period Lloyd came in from one of those court appearances about Patler, and as I noticed he was working away quite undisturbed for someone who had just lost a lawsuit, I commented on how it surprised me. And Lloyd said something like: “I have to make money if I’m going pay money.”\n\nThe truce allowed time for less heated negotiations to be conducted between the three NSWPP corporation heads, and Koehl was still hoping to keep Lloyd. And whenever Pierce was back in the area he naturally spent most of his time visiting the book shop.\n\nAlthough Pierce usually retained social distance from most people during the past, as he was now standing alongside the only three local people loyal solely to him, he loosened up a bit. As we were all closer now, each time Pierce came in we enjoyed talking with him in this more informal atmosphere of genuine camaraderie that developed during conflict.\n\nOn one such occasion he had with him a copy of Carlton Coon’s 1939 classic The Races of Europe , which he had received by mail order. And he spoke of how Coon had written it as a kind of second volume to complement William Ripley’s book of the same name. I enjoyed going through Pierce’s copy of his especially rare book, and we all chatted about the photo charts.\n\nIt seemed easy to find the basic racial description for anyone in the party, and Pierce chuckled when I pointed out someone who looked a lot like Koehl. And taking the book up into his own hands for a closer inspection, he said: “Some people have a natural eye for this, Mr. Barrett, and you’re one of them, as Koehl does indeed come from a Romanian background.” Pierce could actually be a lot of fun when he wanted to be.\n\nEventually, as I mentioned before, Pierce issued a thick memo that he called his prospectus for the future. The full title escapes me, but it detailed out the direction that he thought the movement should develop.\n\nIt was also soon resolved that Pierce would move on voluntarily, even though he could have stayed, for he would have found it too suffocating to remain under the now more assertive Koehl, who had issued his own memo about obeying “the leadership principle.”\n\nWhen Pierce issued his rather long but especially impressive internal memo, he discussed it among the loyalists at the book shop, but it was also mailed out to the entire party membership by resorting to an emergency back-up copy of the NSWPP mailing list.\n\nPierce detailed his own version of the dispute and included an update on how the surprise meeting caused him to post the two guards – but without using our names. As I don’t know if Earl is still in politics, I have intentionally left his name off this account.\n\nThat seems especially prudent following the notoriety of The Turner Diaries , which was very loosely based on his name (but certainly not his life or beliefs).\n\nThere was nothing in Pierce’s memo that would be considered a major revelation today, though perhaps it was couched in more diplomatic terms in 1970. Pierce’s ideological emphasis was on revolution and Koehl’s emphasis on founding a National Socialist religion. The concepts in Pierce’s prospectus, mostly for internal use at that time, match up very well with his present public program.\n\nAs for the shop, it remained closed once Pierce and Lloyd announced their intentions to move to offices in Washington DC’s Georgetown. And although Koehl’s people sometimes hung around outside to observe our movements, occasionally complaining about a sign posted in the window now that said “Shoot Looters,” they offered no major obstructions.\n\nThe George Lincoln Rockwell book shop also occasionally attracted opponents, some drunk, some sober, day or night. On one particular night someone came while the shop was unmanned and hurled a brick through the window. As it was a glass window, Lloyd replaced it with a plastic one. A few nights later, while Lloyd was standing within, he saw a young man hurl a second brick. When it bounced off harmlessly, nearly hitting its thrower on the rebound, Lloyd just roared.\n\nEventually all the stock was moved from that shop and it became the basis of Western Destiny books which was located on the floor below Pierce’s first office in Washington, DC for the National Youth Alliance. Lloyd and I, along with his wife Katherine, comprised the new corporation, and its logo was a sailing ship on a storm tossed sea.\n\nA few days after the prospectus was issued Pierce made more formal arrangements with Koehl and Chris, about when he would remove his belongings from his office at the NSWPP headquarters. And after discovering how, for many reasons, no one else was available to move furniture with Pierce, he and I hauled it all out ourselves. Koehl and Chris were present when we came, but they were quite civil.\n\nWe four rebels had one last meeting in Earl’s apartment before we all eventually left Arlington for good during the coming weeks. At some point during that meeting Pierce assumed a kind of pensive expression, and then said something like this: “I’ll make a prediction: Koehl will eventually turn the party into a religion, it will wind down slowly, then eventually nothing more will be heard of him.”\n\nIt was a rather unique experience to see Pierce assume this pose, as a kind of Aryan Nostradamus. And theatrical or not, in the end that’s exactly what happened. Of course, Koehl probably made his position just as clear to many others.\n\nThat young party supporter that I had turned away from Lloyd’s house eventually turned up at the book shop, and after making every effort to befriend Earl, became a temporary roommate of his while I was out of state. Eventually it was discovered that he was another spy for Chris, so the lock was changed at the apartment and his personal possessions were donated to the Salvation Army.\n\nAn incident came up in the new book shop as well, which is worth relating. Two aggressive and desperate looking young Black men came into the book shop one day, which had even less of the Nazi cult look than the GLR shop did, and so they began examining the book titles – but only at the back of the store. We had the distinct feeling we were about to be held up, and so I took a position in the exit stairway to get a bead on them while Earl remained at the counter.\n\nThe most stocky one seemed especially intrigued by a tome by the German existentialist thinker Martin Heidegger, On Being and Time . Some sources say that Heidegger is probably fully understood by about three people in the entire world. But not realizing that, the nearest Black man said: “How much is dis book bout being awn time?” I nearly gave my location away in the stairway upon hearing that one, but eventually they left.\n\nWhile on the way out the pair seemed to notice we wouldn’t go down too easily, so they didn’t bother returning. Pierce seemed to revel in the details of every bizarre incident, as he was working on some mysterious novel called The Turner Diaries . When I read the book, however, which was many years later, only a few details seemed like familiar elements.\n\nFor a time I served as Pierce’s first street activist, even breaking my knuckle and another hand bone in a fight against left-wing demonstrators outside the Capitol Building on one occasion. That night Pierce picked me up at the hospital, as I had just gotten the hand set, and he went to work right away doing a story on it for the bulletin.\n\nEarl also continued with Pierce for a time, mostly carrying out the kind of internal duties as before. But eventually he tired of this and quit, so I turned to helping him co-found a mail order business called White Legion Books, again based on the previous shops.\n\nIn the coming months I encountered Chris working as an engineer in the courtyard of the Watergate Apartments, and we merely shook hands and agreed that it wasn’t necessary to have future problems linger. Years later I also exchanged letters with Koehl, but we just skipped over any uncomfortable subjects.\n\nWestern Destiny Books eventually closed down, as Lloyd finally decided to withdraw from radical politics, just as he had retired from the action back when he was Rockwell’s favorite stormtrooper.\n\nEventually I gave my portion of White Legion Books to Earl. He did more to develop it anyway, and soon renamed it Bibliophile Legion Books. Earl also published some very nice books about some of the lessor known formations of the SS, and associated with Willis Carto for a time. I defined myself as a “cultural Legionnaire” rather than an uncritical National Socialist, and so I moved on.\n\nYears later, as I kept my ears open for such things, I heard that Richard Bierderman had been killed while fighting for the Rhodesian military (a mine had blown up the truck he was riding in), and Joe Tommasi had been gunned down in Los Angeles by another party member during his own local split.\n\nAs Joe had once stayed at my apartment during the NSWPP congress, and I knew him to be an especially decent person (despite all the excitement about him helping Richard Nixon’s dirty tricks people before the Watergate scandal), it was particularly sad news. I also sensed, though it would be difficult to be certain, that these were long delayed ripple effects from the Big Split.\n\nHopefully my story will forewarn others who may embrace the serious ideological error of NS cultism."}, {"url": "https://pantheon.world/profile/person/William_Luther_Pierce/", "page_content": "William Luther Pierce\n\nWilliam Luther Pierce III (September 11, 1933 – July 23, 2002) was an American neo-Nazi, white supremacist, and far-right political activist. For more than 30 years, he was one of the highest-profile individuals of the white nationalist movement. A physicist by profession, he was author of the novels The Turner Diaries and Hunter under the pen name Andrew Macdonald . Read more on Wikipedia\n\nSince 2007, the English Wikipedia page of William Luther Pierce has received more than 1,629,397 page views. His biography is available in 21 different languages on Wikipedia (up from 20 in 2019) . William Luther Pierce is the 430th most popular social activist (down from 339th in 2019), the 6,578th most popular biography from United States (down from 4,930th in 2019) and the 62nd most popular American Social Activist."}, {"url": "https://infogalactic.com/info/William_Luther_Pierce", "page_content": "From Infogalactic: the planetary knowledge core\n\nWilliam Luther Pierce III (September 11, 1933 – July 23, 2002) was an American National Socialist. He was one of the most influential ideologues of the white nationalist movement for some 30 years before his death. A physicist by profession, he was also an author under the pseudonym Andrew Macdonald of the novels The Turner Diaries and Hunter. Pierce founded the National Alliance, a major white nationalist organization, which he led for almost thirty years.\n\nBorn in Atlanta, Georgia, to a Presbyterian family of Scots-Irish and English descent, Pierce was descended from the aristocracy of the Old South, descendant of Thomas H. Watts, the Governor of Alabama and Attorney General of the Confederate States of America during the American Civil War. As a child, Pierce did well academically, graduating from high school in 1952. He received a baccalaureate in physics from Rice University in 1955, earned a doctorate from University of Colorado at Boulder in 1962, and became an assistant professor of physics at the Oregon State University in 1962, where he joined the anti-communist John Birch Society. In 1965 he left his tenure at Oregon State University and became a senior researcher for the aerospace manufacturer Pratt & Whitney in Connecticut. In 1966 Pierce moved to the Washington, D.C. area and became an associate of George Lincoln Rockwell, who was assassinated in 1967, after which Pierce became co-leader of the National Youth Alliance, which split in 1974, with Pierce founding the National Alliance.\n\nPierce intended the National Alliance to be a political vanguard that would ultimately bring about a white nationalist revolution in the United States. In 1978, Pierce wrote, under the pseudonym \"Andrew Macdonald\", the novel The Turner Diaries, which depicts a violent revolution in the United States which leads to the overthrow of the Federal government of the United States. In 1984, he wrote another novel, Hunter, portraying the actions of a Vietnam veteran McDonnell Douglas F-4 Phantom II pilot and Washington, D.C.-area United States Department of Defense consultant who embarks on a plan to assassinate interracial couples and liberal American journalists, politicians and bureaucrats in the D.C. area. In 1985, Pierce relocated the headquarters of the National Alliance to Hillsboro, West Virginia, where he founded the Cosmotheist Community Church to receive tax exemption for his organization. Pierce spent the rest of his life in West Virginia hosting a weekly shortwave radio show, American Dissident Voices, publishing the internal newsletter National Alliance Bulletin (formerly called Action), and overseeing his publications, National Vanguard Magazine (originally titled Attack!), Free Speech and Resistance, as well as books published by his publishing firm National Vanguard Books, Inc. and music produced by his record company, Resistance Records.\n\nIn 2002, Pierce died of cancer. At the time, the National Alliance was bringing in more than $1 million a year, with more than 1,500 members and a paid national staff of 17 full-time officials, and was better known than at any time in its history, after which it entered a period of internal conflict and decline. However, in more recent years, it has seen a major resurgence, as part of an anti-establishment reactionary movement against an ongoing cultural revolution otherwise described as the \"Great Awokening\", and Pierce, despite having died in 2002, has become an increasingly popular icon as part of what has been described as the counterculture of the 2010s and 2020s.\n\nBiography\n\nEarly life and education\n\nWilliam Pierce at a young age, in a high school military academy uniform.\n\nWilliam Luther Pierce III was born on September 11, 1933, to a Presbyterian[3][4][5] family of English and Scotch-Irish descent in Atlanta, Georgia, the son of William Luther Pierce Jr. and Marguerite Farrell. Pierce's younger brother, Sanders, an engineer, was born in 1936, and later assisted Pierce in his political activities.[6] His father was born in Christiansburg, Virginia in 1892. His mother was born in Richland, Georgia in 1910, with her family being part of the aristocracy of the Old South, descendants of Thomas H. Watts, the Governor of Alabama and Attorney General of the Confederate States of America.[7] After the American Civil War, the family lived a working-class existence.[8] Pierce's father once served as a government representative on ocean-going cargo ships and sent reports back to Washington, D.C.;[9] he later became manager of an insurance agency but was killed in a car accident in 1942.[10] After the elder Pierce's death, the family moved to Montgomery, Alabama and then to Dallas, Texas.[11]\n\nPierce performed well academically in school, skipping one grade. His last two years in high school were spent in a military academy.[12] As a teenager his hobbies and interests were model rockets, chemistry, radios, electronics, and reading science fiction.[9] His first aspiration was to become an astronaut.[13]\n\nAfter finishing military school in 1951, Pierce worked briefly in an oil field as a roustabout. He was injured when a four-inch (10 cm) pipe fell on his hand, and he spent the rest of that summer working as a shoe salesman.[14] Pierce earned a scholarship to attend Rice University in Houston, Texas. He graduated from Rice in 1955 with a baccalaureate in physics.[15][16] He worked at the Los Alamos National Laboratory before attending graduate school, first at Caltech and then the University of Colorado in Boulder, Colorado, where he earned his doctorate in 1962.[15] He taught physics as an assistant professor at Oregon State University from 1962 to 1965.[17]\n\nEarly political activities\n\nHis tenure as assistant professor at Oregon State University (1962–1965) coincided with the rise of two social movements, the Civil Rights Movement and the Anti-Vietnam War movement, which he regarded as Jewish-led, communist-inspired, and a threat to European Americans. He was briefly a member of the anti-communist John Birch Society in 1962,[18] but eventually resigned. In 1965, in order to finance his political ambitions, Pierce left his tenure at Oregon State University and relocated to North Haven, Connecticut, to work as a senior researcher at the Advanced Materials Research and Development Laboratory of aerospace manufacturer Pratt & Whitney.[11] In 1966, moved to the Washington, D.C. and became an associate of George Lincoln Rockwell, founder of the American Nazi Party. During this time he was the editor of the party's ideological journal, National Socialist World. When Rockwell was assassinated in 1967, Pierce became one of the leading members of the National Socialist White People's Party, the successor to the ANP. In 1968, Pierce left the NSWPP and joined Youth for Wallace, an organization supporting former Governor of Alabama George Wallace's bid for the presidency.[16] In 1970, along with Willis Carto, he reconfigured Youth for Wallace into the National Youth Alliance. By 1971, Pierce and Carto were openly feuding. Ongoing disagreements caused the NYA to split, and by 1974 Pierce's wing became known as the National Alliance.[15] Among the founding members of the board of the National Alliance was professor of classics at the University of Illinois Revilo P. Oliver, who was to have major impact of Pierce's life both as an adviser and friend.[19]\n\nNational Alliance\n\nThe National Alliance was organized in 1974. Pierce intended the organization to be a political vanguard that would ultimately bring about a White nationalist overthrow of the United States Federal Government. Pierce spent the rest of his life living in West Virginia, where he hosted a weekly radio show, American Dissident Voices,[20] the internal newsletter National Alliance Bulletin (formerly called Action), and oversaw his publications, National Vanguard Magazine (originally titled Attack!), Free Speech and Resistance, as well as books published by his publishing firm National Vanguard Books, Inc. and his record company, Resistance Records. Pierce was a Holocaust revisionist who believed many of the details had been fabricated.\n\nIn 1978, claiming that the National Alliance was an educational organization, Pierce applied for, and was denied, tax exemption by the Internal Revenue Service.[15] Pierce appealed, but an appellate court upheld the I.R.S. decision.[15] Around the same time, he was interviewed by Herbert Poinsett on Race and Reason, a public-access television cable TV talk show.[21]\n\nAn anti-Zionist, he attempted during the Yom Kippur War to force McDonnell-Douglas into canceling military contracts that sent armaments to Israel, by buying shares of the company's stock and putting forward the motion at the national shareholder's meeting. The company rejected the motion and continued supplying Israel with weapons. Some of Pierce's later speeches on American Dissident Voices concerning the Arab-Israeli conflict were reprinted in Muslim publications and on websites, including that of the Lebanese Shia Islamist group Hezbollah.[22]\n\nIn 1985, Pierce moved his operations from Arlington, Virginia, to a 346-acre (1.40 km2) location in Mill Point, West Virginia that he paid for with $95,000 in cash.[15] Here, he founded the Cosmotheist Community Church, in what may have been a last-ditch effort to avoid paying taxes.[15] In 1986, the church applied again, this time successfully, for federal, state, and local tax exemptions, however lost its state tax exemption for all but 60 (out of nearly 400) acres, which had to be exclusively used for religious purposes.[23] The other 286 acres (1.16 km2) were used for both the National Alliance headquarters and the National Vanguard Books business and warehouse, and were denied tax exemption.\n\nIn 1990, the documentary series Different Drummer produced a portrait of Pierce, which was aired on PBS.[24] He later participated twice on a public-access television cable TV live talk show hosted by Ron Doggett, \"Race and Reality,\" aired from Richmond, Virginia.[25][26] On May 19, 1996, Pierce made a rare personal appearance in the mainstream media, on 60 Minutes,[27][28] during which Pierce was asked by Mike Wallace if he approved of the Oklahoma City bombing, and he replied \"No. No, I don't. I've said that over and over again, that I do not approve of the Oklahoma City bombing because the United States is not yet in a revolutionary situation\".[27] Pierce was frequently described as a Neo-Nazi,[15][16][22][29][29][30][31][32] although he personally rejected this label.[27] When confronted with issue by Mike Wallace on 60 minutes, Pierce described the term as a \"slander\", while stating \"I admire many things that Hitler wrote, many of the programs and policies that he instituted in Germany, but we do not blindly copy anyone else's policies or programs. We've formulated our own program in view of the situation that we face here in America today.\"[27] In 1998, Pierce also appeared on a documentary produced by the Discovery Channel about white nationalism in the United States.[33] As the leader of the National Alliance, Pierce established contacts with other Nationalist groups in Europe, including the National Democratic Party of Germany and the Greek party Golden Dawn.[15] Pierce's other recruiting efforts included a 51-minute[22] informational video titled America is a Changing Country,[34] and forming an anti-globalization group – the Anti-Globalization Action Network – to protest at the G8 summit in Canada in June 2002.[22]\n\nPierce's last public speech was made in Cleveland, Ohio, on April 28, 2002.[35] On July 23, 2002, he died of cancer. At the time, the National Alliance was bringing in more than $1 million a year, with more than 1,500 members, a paid national staff of 17 full-time officials, and was better known than at any time in its history, after which it entered a period of internal conflict and decline.\n\nAfter his death, the British National Party published an article in remembrance of him.[36]\n\nBefore Pierce died, he allowed Robert S. Griffin, a tenured professor of education at the University of Vermont, to live with him for a month, with the result being the self-published work The Fame of a Dead Man's Deeds (2001).[37] The book's title was taken from Pierce's favourite quote, an Old Norse proverb from the Hávamál in the Poetic Edda:[38]\n\nDeyr fé, deyja frændr, deyr sjálfr et sama; ek veit einn, at aldri deyr: dómr um dauðan hvern. Cattle die, kinsmen die you yourself die; I know one thing which never dies: the judgment of a dead man's life.[39]\n\nNovels\n\nThe Turner Diaries\n\nPierce gained national public attention following the Oklahoma City bombing, as Timothy McVeigh was alleged to have been influenced by The Turner Diaries (1978), the novel written by Pierce under the pseudonym Andrew Macdonald.[15] The book is a graphically violent depiction of a future race war in the United States, which includes a detailed description of the mass hangings- \"the Day of the Rope\"- of many \"race traitors\" (especially Jews, gay people, and those in interracial marriages or relationships) in the public streets of Los Angeles, followed by the systematic ethnic cleansing of the entire city. This violence and killing is called \"Terrible yet Absolutely Necessary\". The story is told through the perspective of Earl Turner, an active member of the white revolutionary underground The Organization.\n\nThe part most relevant to the McVeigh case is in an early chapter, when the book's main character is placed in charge of bombing the FBI headquarters.[15] Some have pointed out similarities between the bombing in the book and the actual bombing in Oklahoma City that damaged the Alfred P. Murrah Federal Building and killed 168 people on April 19, 1995. When McVeigh was arrested later that day, pages from the book were found in his car, with several phrases highlighted, including \"But the real value of all of our attacks today lies in the psychological impact, not in the immediate casualties\" and \"We can still find them and kill them.\"[40][41]\n\nThe Turner Diaries also inspired a group of white revolutionary nationalists in the early 1980s who called themselves the Silent Brotherhood, or sometimes simply The Order.[15] The Order were an offshoot of the Aryan Nations. They were tired of being merely \"armchair revolutionaries\". The Order was connected to numerous crimes, including counterfeiting and bank robbery, and supposedly gave money to the Alliance.[15] The Order's leader, Robert Jay Mathews, died in a stand-off with police and federal agents on Whidbey Island, Washington, when police fired flares into his hideout, igniting a fire. Other Order members, most notably the late David Lane, were all captured and sent to federal prisons, where they still continue to voice their support for white nationalist ideals.\n\nIn 1996 Pierce sold the rights to The Turner Diaries to the Jewish publisher Lyle Stuart.[42]\n\nHunter\n\nIn 1989, again under the Andrew Macdonald pen name, William Pierce published another novel, Hunter, which tells the story of a man named Oscar Yeager, a veteran of the Vietnam War and an F-4 Phantom pilot who assassinates interracial couples and liberal journalists, politicians and bureaucrats in the D.C. area.\n\nIn interviews, Pierce called Hunter more realistic, and described his rationale for writing it as taking the reader through \"...an educational process\".\n\nReligion\n\nAlthough raised as a Presbyterian,[3] Pierce became an atheist as a teenager.[4][5] In the 1970s, however, Pierce created the religious philosophy of 'Cosmotheism', based on a mixture of German romanticism, the Darwinian concept of natural selection, and Pierce's interpretation of George Bernard Shaw's play, Man and Superman. The Anti-Defamation League and the Southern Poverty Law Center assert that Pierce created Cosmotheism in order to acquire tax-exempt status for the National Alliance after he'd failed to do so earlier and the SPLC refers to it as a \"bogus religion\".[15][16]\n\nIn effect, Cosmotheism is a form of panentheism, asserting that \"all is within God and God is within all.\" It considers the nature of consciousness to be mutable and destined to evolve, via biological eugenics, towards a complete 'universal consciousness,' or godhood. The word 'Cosmos' means an orderly and harmonious universe. The purpose of Cosmotheism, therefore, is the upwards-striving of biological life to ever higher forms of being.\n\nIn his speech \"Our Cause\", Pierce said:\n\n<templatestyles src=\"Template:Blockquote/styles.css\" />\n\nAll we require is that you share with us a commitment to the simple, but great, truth which I have explained to you here, that you understand that you are a part of the whole, which is the creator, that you understand that your purpose, the purpose of mankind and the purpose of every other part of creation, is the creator's purpose, that this purpose is the never-ending ascent of the path of creation, the path of life symbolized by our life rune, that you understand that this path leads ever upward toward the creator's self-realization, and that the destiny of those who follow this path is godhood.\n\nPierce described his form of panentheism as being based on \"[t]he idea of an evolutionary universe ... with an evolution toward ever higher and higher states of self-consciousness,\" and his political ideas were centered on racial purity and eugenics as the means of advancing the white race first towards a super race and then towards personal godhood. In his view, the white race represented the pinnacle of human evolution thus far and therefore it should be kept genetically separate from all other races.\n\nPierce believed in a hierarchical society governed by what he saw as the essential principles of nature, the survival of the fittest. In his view, white people should remain separated from other races and establish a meritocracy. He thought that extensive programs of \"racial cleansing\" (mass expulsion) and eugenics, both in Europe and North America, would be necessary to achieve this socio-political program.\n\nFamily\n\nPicture of Dr. William Pierce at an official National Alliance meeting in 1999, in Hillsboro , West Virginia.\n\nPierce married five times. His first marriage was to Patricia Jones, a mathematician whom he met while attending California Institute of Technology. They were married in 1957, and had twin sons, Kelvin and Erik, born in 1960. Kelvin is an aerospace engineer, while Erik is a computer scientist.[6] The marriage ended in divorce in 1982.[43] Pierce remarried that same year to Elizabeth Prostel, whom he met in the National Alliance office in Arlington, Virginia. The marriage ended in 1985, at which time Pierce moved his headquarters to Southern West Virginia.[15] In the headquarters, Pierce acquired a Siamese cat, Hadley, which stayed with him until his death.[44] In 1986, Pierce married Hungarian Olga Skerlecz, a relative of Iván Skerlecz, Governor of Croatia-Slavonia, and the marriage lasted until 1990. Olga moved to California after their divorce.[43] Pierce then married another Hungarian woman named Zsuzsannah in early 1991. They met through an advertisement that Pierce placed in a Hungarian women's magazine aimed at arranging international marriages. Zsuzsannah moved to Florida after their divorce in the summer of 1996. His final marriage, which lasted until his death, was to another Hungarian woman, Irena, whom he married in 1997.[4]\n\nBibliography\n\nThe following works were published under the pseudonym \"Andrew MacDonald\":\n\nIn 1993, Pierce wrote the script of the comic book New World Order Comix #1: The Saga of White Will which was illustrated by Daniel \"Rip\" Roush and coloured by William White Williams.[45]\n\nSee also\n\nAsa Earl Carter, a white supremacist who also wrote novels but under the pseudonym Forrest Carter.\n\nNotes\n\nSources\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nLua error in package.lua at line 80: module 'strict' not found.\n\nFurther reading"}], "William Luther Pierce III was a member of the American Nazi Party.": [{"url": "https://www.theguardian.com/world/2021/mar/31/william-luther-pierce-white-supremacist-son-kelvin-pierce", "page_content": "From an exposed bluff in Mill Point, West Virginia, Kelvin Pierce surveyed the remote place where his father chose to live and die. In a sense, he knew why. Kelvin is an avid outdoorsman, and even on a stark February day, with snow blanketing the earth and bitter wind whistling through the trees, he was moved by Appalachia’s subtle splendor. He understood why a man might settle there.\n\n“I love West Virginia,” Kelvin had said earlier, on the four-and-a-half-hour drive from his home just outside Washington. “It’s absolutely my favorite place on the planet.”\n\nIt’s also full of sorrow.\n\nWhen Pierce’s father bought 346 acres in Mill Point, and relocated there permanently in 1985, he left his family behind. He started building a compound where a new kind of family – men and women of like mind – could live off the land and be free of outside influences. He moved into a rambling trailer home, where he lived with a series of wives who weren’t Pierce’s mother. He had divorced her, declaring the split “necessary in order for me to have the peace of mind I need to do most effectively what I must do with my life”.\n\nNothing was more important to Kelvin’s father than white supremacy. The abandonment and the hate – the abandonment for hate – is what Kelvin has spent the better part of his life struggling to understand.\n\nTo family and friends, his dad was Bill. To everyone else, he was William Luther Pierce III, one of America’s most prominent white nationalists.\n\nA physics professor turned neo-Nazi, William Pierce led a hate group called the National Alliance and a business empire that, at the time of his death from cancer in 2002, raked in $1m a year. He published books and magazines, hosted a radio program, and owned a music label, all of which promoted white supremacy. His work galvanized violent gangs, such as the Order and the Aryan Republican Army. Most infamously, it inspired the architect of the Oklahoma City bombing – Timothy McVeigh designed the attack based in part on Pierce’s 1978 novel The Turner Diaries.\n\nReportedly called “the bible of the racist right” by the FBI, The Turner Diaries is a fantasy about white militants overthrowing the US government as part of a bloody race war. A 2016 report found that the book had been tied to at least 200 murders, committed in 40 terrorist attacks and hate crimes. This year, during the 6 January coup attempt, there were echoes of the novel’s core ideas in insurrectionists’ calls to kill members of Congress, and in a gallows erected near the Capitol.\n\nWilliam Pierce raised Kelvin to hate Jews, Black people, immigrants – anyone who wasn’t white. Now 60, Kelvin has long rejected his father’s ideology, but only recently has he reached the point where he’s ready to talk about his upbringing, and how his story illuminates the toxic currents roiling America. “If I can help one other person that felt the way I used to feel, to feel better and to make different choices, then that’s what I want to do,” Kelvin said. “And I think I can help more than one person.”\n\nWhen he was little, Kelvin would sneak into his dad’s home office in northern Virginia to look at the bust of Adolf Hitler and the glass paperweight in the shape of a swastika that sat on the desk. Kelvin didn’t know what the items meant, and William Pierce wasn’t interested in explaining. He rarely spent time with Kelvin and his twin brother, Erik, preferring to fraternize with George Lincoln Rockwell, the leader of the American Nazi party, or to lock himself away writing articles decrying Jewish power and interracial marriage.\n\nKelvin’s strongest memories of his dad involve abuse. Any disobedience or perception of bad behavior led to beatings with whatever was at hand: a belt, a wire hanger, a two-by-four. The violence left Kelvin with bruises and a deep well of self-loathing.\n\nHis mom, Patty, didn’t approve of the cruelty, but she didn’t do much to intervene. She took a similar approach to her husband’s extremism, which he’d nurtured since at least the early 1960s. A math professor and the family breadwinner, because her husband had given up his own academic career to become an ideologue of hate, Patty did all of William Pierce’s accounting and typing. Kelvin said his mom was “absolutely terrified” when her husband started a firearms business – not because he advertised his stock as “Negro control equipment” necessary for “the coming race war”, but because it prompted newspapers to publish articles about him. Patty worried that someone might come to the house and hurt her family.\n\nFamily photos from the archive of Kelvin Pierce. Photograph: Johnathon Kelso/The Guardian\n\nWhen her sons told her that neighborhood kids made fun of them by calling them Nazis, she lamented that “it’s a terrible world” and “people are awful”. She didn’t answer when Kelvin asked her what a Nazi was, and she didn’t tell her boys that their father was to blame for what was happening to them.\n\nAs a teenager, Kelvin was a bigot because he didn’t know any other way to be. He also hoped it would impress his dad. In high school, he gave a presentation on Hitler’s virtues and used the N-word to talk about Black classmates. By the time he went to college, he was “a mobile advertisement” for his father’s beliefs.\n\n“It made me feel superior to be part of the white race,” Kelvin later wrote. “Yet deep, deep down, something didn’t quite feel right about it either.”\n\nHe began to change when he transferred from a small Christian college to Virginia Tech. He roomed with a young man from South America who was “thoughtful, caring and very intelligent” – all things that Kelvin’s father insisted people who weren’t white couldn’t be. He took classes with students who saw the world very differently than he did. When Ronald Reagan was elected president and many of his liberal peers were visibly upset – including his roommate, who drew a dagger and drops of blood on a photo of Reagan – he wanted to understand why. He started paying attention to politics and watching the evening news, which his dad had always said was worthless because Jews controlled the media. Kelvin wondered if everything he’d been taught was wrong.\n\nHe met a fellow student named Susan when they were both engineering interns with the navy one summer. Kelvin thought she was beautiful, but while his racism was rapidly dissipating, his shame – the feeling that his dad had abused him for a reason, that he deserved it – was not. He couldn’t imagine making the first move, but Susan could. “You know, if you were to ask me out, I would say yes,” she announced one day.\n\nThey were married in 1986. William Pierce came to the wedding. His gift to the bride and groom was a box of 9mm ammunition. “To keep the wolves away from your door!” his note read. Kelvin didn’t even own a gun.\n\nBy then, William Pierce had divorced Patty, decamped to Mill Point, and curtailed contact with his sons. Kelvin only confronted his dad once, asking why he’d chosen white supremacy over everything else in his life. “It was the only responsible thing I could do,” his father replied.\n\nFor her part, Susan didn’t think that William Pierce’s worldview mattered. “Thank goodness that’s a dying thought process,” she recalled thinking – an assumption she now sees as optimistic, or perhaps naive. It was also hard for her to fathom the extent of the abuse Kelvin suffered.\n\n“You know, he hit me every day,” he told her once.\n\n“Every day?” she replied, incredulous.\n\nSusan had grown up in a home where, as she put it, “We were always hugging each other, and we always said, ‘I love you.’”\n\nShe and Kelvin had kids only because they agreed to adopt them. “I was just terrified of furthering my genes,” Kelvin said. “I was so messed up and so damaged as a human being that I couldn’t fathom the idea of trying to make another human being.” Their daughters, Mariame and Marieka, are from the country of Georgia. Kelvin vowed to love them like he’d never been loved. He coached their softball teams and took them on camping trips.\n\nKelvin with his daughter Marieka. Photograph: Johnathon Kelso/The Guardian\n\nWilliam Pierce never met his granddaughters. For seven years prior to his death, he didn’t reply to the letters and photos documenting their childhood that Kelvin sent him. Despite everything, Kelvin kept reaching out. His anger at how he’d been raised collided with yearning for paternal approval. When he first heard of the connection between The Turner Diaries and the Oklahoma City bombing, his kneejerk reaction was a perverse kind of pride that his dad was in the news. He was ashamed his mind went there, but at a loss for how to stop it.\n\nKelvin was battling his demons without armor or weapons. He was also doing it alone. “You’re a mystery to me,” Susan would tell him sometimes. “I don’t understand why you won’t tell me how you’re really feeling.”\n\nIn July 2002, his uncle called to tell him that his father was dead. Kelvin hadn’t even known he was sick. He surprised himself by crying, then realized what he was really mourning: he had to let go of the futile hope that his father might one day love him. He went to West Virginia for the memorial service, where neo-Nazis offered their condolences and said Kelvin must have admired his father very much.\n\nHow little they know, he thought.\n\nHe looked like his dad – tall and lanky, with mournful eyes, a long, square jaw, and prominent ears. He shared William Pierce’s introspection and his dislike of being told what to do. But the similarities ended there.\n\nAfter the service, he began to feel something new: he was sad for his father and the life he’d led. It could have been different. But again and again, William Pierce had made the wrong choices, leaving heartache and hate in his wake.\n\nKelvin wanted to start making better choices of his own.\n\nTo Mariame Pierce, her dad’s bookshelf told the story. When she was little, it held volumes about Kelvin’s hobbies – mountain climbing, for instance. Over time, new titles appeared, ones about self-discovery and philosophy, written by Eckhart Tolle and Deepak Chopra. While she was growing up, her dad was changing too. “He became more present and thoughtful, more conscious and intentional,” said Mariame, now 25.\n\nKelvin had embarked on a “healing” journey, as he describes it. He read, reflected and prayed. He worked with a counselor to process his childhood trauma, including his father’s belief system. He and Susan, who already ran a successful construction business together, started a charitable foundation to support orphanages in Georgia. When he posted pictures from visits to his daughters’ native country, friends remarked that he looked uncharacteristically happy. “To make a child feel like at least somebody in the world loves them, it’s the most amazing thing in the world,” Kelvin said.\n\nHe told his life story publicly for the first time at his local Rotary Club. He described how, in his youth, he’d fantasized about traveling to Washington with a gun and opening fire on Black people. His teenage dreams now repulsed him. Afterward, audience members came up to thank him. Some of them were crying.\n\nThe more he talked about his experiences, the more people told Kelvin he should write a book. It took a seismic national event for him to decide they were right.\n\nOn 12 August 2017, the Unite the Right rally in Charlottesville, Virginia, turned deadly. Watching the events unfold, “I was immediately transported back to my childhood,” Kelvin said. “The hatefulness of their energy and what they were saying, the way they were saying it, especially ‘You will not replace us’ – it was just like being an eight- or nine-year-old kid, when my dad took me to an American Nazi party picnic.”\n\nHe started writing what would become Sins of My Father, which he self-published in February 2020. In addition to telling Kelvin’s personal story the book, written with Carole Donoghue, draws on private letters and other archival documents that reveal how perceived grievances, personal disappointment, and twisted self-regard led William Pierce to dedicate his life to white supremacy.\n\nThough it’s impossible to pinpoint the exact moment when his father’s beliefs began to curdle – stories of radicalization are never so precise – Kelvin finds seeds of discontent in the years when William Pierce was a new husband, a new father and newly endowed with his physics doctorate. “I think Dad was becoming angry and resentful and was suddenly frightened of the future and the heaviness of it all,” Kelvin writes. “He hated the idea of working for someone else. He never wanted to have to answer to anyone else, even his wife.”\n\nThis period in William Pierce’s life coincided with the rise of progressive identity politics – the acceleration of the civil rights movement, for instance, and the dawn of second-wave feminism. He wanted to be a man who mattered, a man people listened to. White nationalism allowed him to be that. His life became one long ideological devolution, nourished by the power and attention he accrued evangelizing about hate.\n\nKelvin Pierce photographed at his home in Vienna. Photograph: Johnathon Kelso/The Guardian\n\nIf the story sounds familiar, it is. America is still plagued by the forces of rightwing radicalization. Sins of My Father draws parallels between William Pierce and Donald Trump, who “emboldened white supremacists and mass-shooters by his words and deeds,” as Kelvin writes. “In many ways, Trump has succeeded where Dad failed. He has taken hate and discrimination mainstream.”\n\nOther evidence of his father’s enduring impact hit closer to home. After Marieka Pierce enrolled in a police academy in Virginia, one day in class, her instructors showed the room a picture of her grandfather, describing him as an example of a homegrown extremist. “My hand went up,” Marieka later told her mom.\n\nThe instructors were stunned to hear about the family connection. William Pierce was a staple in their curriculum about hate crimes; they’d been teaching recruits about him for as long as they could remember. They asked to meet Kelvin to get a fuller picture of the man who, in obituaries, was remembered as “a cold and calculating racist” and “the godfather of hate in this country.”\n\nDonny MacMullen has his own take on William Pierce: he thinks Kelvin’s father was a great man.\n\nMacMullen, who is in his 30s, with reddish brown hair, a full beard, and striking blue eyes, moved to Mill Point from Massachusetts a few years ago to help preserve Pierce’s legacy. Today, he’s the caretaker of the National Alliance compound, which amounts to a few scattered buildings and the rocky sprawls of land between them.\n\nThe place is in a state of disrepair, and people rarely visit, but there are reminders of the community Kelvin’s dad was trying to build before he died: an AV facility stocked with equipment that was first-rate in the early aughts; a library that once housed several thousand volumes; stacks of slickly produced magazines promoting racism; a meeting house where William Pierce presided over annual National Alliance conferences. Today, even as Pierce’s ideas continue to find adherents, the organization he started is a shade of its former self.\n\nMacMullen was happy to welcome Kelvin to the compound in February. Indeed, members of the National Alliance had long made clear that William Pierce’s son could visit anytime. For more than 15 years after his father’s death, however, Kelvin stayed away. He wasn’t ready to make peace with it, because he wasn’t at peace with himself.\n\nIt was a steep drive up switchbacks to the heart of the compound, where MacMullen was waiting, wearing a knit cap with a swastika stitched to the front. When Kelvin asked him about the symbol, MacMullen laughed. It just represents love for the white race, he insisted. Kelvin pointed out that it was associated with hate and genocide, and MacMullen shifted gears. If you love something deeply, he said, then you have to hate anything that threatens it.\n\nDonny MacMullen’s office at the West Virginia compound. Photograph: Johnathon Kelso/The Guardian\n\nThis was another way of expressing the sentiment of a meme MacMullen once posted on his Facebook page: “I’m white but that doesn’t mean I’m racist … I will put my boot in your ass, my knife to your throat, and your body in the dirt if you f**k with me and mine.”\n\nKelvin and MacMullen walked for a while on the property, just the two of them. If it was painful to talk with a man who revered his father – who saw virtue in a racist who beat him every day of his childhood – Kelvin didn’t let it show. They talked about their divergent beliefs, and neither man was interested in budging.\n\n“We’ll just have to agree to disagree,” MacMullen said at one point.\n\nWhen Kelvin recounted the conversation to his best friend, Gil Jullien, who’d come on the trip as moral support, Jullien was furious. “Oh, that’s bullshit!” he said. “I don’t agree to disagree!”\n\nJullien was speaking from experience. He was troubled that a close childhood friend had become a vociferous Trump supporter, the sort who regularly posts racist and sexist content on Facebook. Once, when the two men were at a high school reunion talking politics, Jullien’s friend had told him they’d have to agree to disagree. Jullien wasn’t having it. “In my opinion, he’s ruining our country, and I’m not,” he later explained.\n\nKelvin shares Jullien’s moral compass. “Aggression and hate and violence are the epitome of cowardice,” he said. But he doesn’t want to feel antagonism or resentment toward anyone, not even white nationalists.\n\nHe prefers to listen and question, not to confront; to offer the possibility of connection rather than writing people off. His approach might not be for everyone, but for Kelvin it’s vital. If he could be redeemed, why not someone like MacMullen?\n\n“I’m putting myself out there for people that want help and want change,” Kelvin said.\n\nBefore Kelvin left the compound, MacMullen gave him a copy of a book – a tome, really, at more than 1,000 pages. Written in 1978 by William Gayley Simpson, a white nationalist who ran in the same circles as William Pierce, Which Way Western Man? bemoans the supposed decline of white civilization, the rise of feminism and multiculturalism, and the alleged chokehold liberal orthodoxy has on modern society – it’s a collection of white supremacy’s greatest hits.\n\nMacMullen said the text meant a lot to him. Back home in Virginia, in the spirit of listening and questioning, Kelvin cracked the book and read the first 50 or so pages. “It kind of boils down to, do you live your life stuck in the rat race, within society’s norms, or do you break out from that and try to live a more authentic life, doing what you want to do, what you feel is right versus what society says is right?” he said.\n\nThe language struck a chord. He heard echoes of his own transformation, of setting a new course for himself. Whereas Kelvin chose a path defined by hope and inclusivity, people who admire his father have let bigotry be their guide. Still, in their journeys’ common origin, Kelvin saw promise – the possibility of trying again, and getting it right this time.\n\n“It’s not as insurmountable a task to start a recovery process as some people think. It does take discipline, but it actually works,” he said. “I’m living proof of that, right?”\n\nThe trailer where William Luther Pierce once lived lies in disrepair at the National Alliance compound. Photograph: Johnathon Kelso/The Guardian\n\nThe last time Kelvin saw his father, he jumped off a mountain.\n\nKelvin had started hang-gliding in his 20s, and during his first visit to the compound in West Virginia – the only one he took while William Pierce was alive – his dad had suggested he glide off one of the property’s peaks. No way, Kelvin told him. There weren’t open areas below where he could land. At best he’d come away injured; at worst he could die.\n\nA few years later, in 1995, Kelvin traveled to Spruce Knob, the highest point in West Virginia, for a series of flights over the Labor Day weekend. He invited his dad to come watch him. He didn’t expect him to show, but as Kelvin was untying his glider from its rack on his truck, he heard a familiar voice.\n\n“You need a hand with that?” his father asked.\n\n“You actually came,” Kelvin replied.\n\nWith his father’s help, Kelvin made quick work of maneuvering his 80lb glider to the launch site. Before them was a pleated vista, gentle peaks and valleys thick with late-summer green. Kelvin suited up and pointed to the landing field where his father could meet him. “Clear!” he yelled, before taking a few running steps and leaving the earth.\n\nThe flight was perfect. A swell of wind – a lift, as hang-gliders say – allowed Kelvin to pilot much higher than he’d planned, rendering his dad a dot on the ground. He stayed in the sky for an hour. The view was majestic: forests and farms and fields stretching beneath him.\n\nHe touched down with ease in a wide field. As he was packing up his gear, he heard the familiar voice again: “Wow, Kelvin, that was absolutely amazing.”\n\nIt was the first time in his life that Kelvin knew for certain he’d impressed his father.\n\nThey stood in the landing field talking for a bit longer. Then father and son said their goodbyes and went their separate ways: William Pierce to what Kelvin called “his life of hate at the compound”; he to new chapters of his existence. Some, such as parenthood, would be joyous. Wrestling with his past would be torment. But just like he navigated the wind high above the mountains, Kelvin would steer himself to a place where he could land, safe and whole, and invite others to join him, if only they too have the courage to leap.\n\nKelvin Pierce at a park nearby his home in Virginia. Photograph: Johnathon Kelso/The Guardian\n\nSeyward Darby is the editor-in-chief of the Atavist Magazine and the author of Sisters in Hate: American Women on the Front Lines of White Nationalism. Johnathon Kelso is an editorial photographer working on long-form projects related to history and race in the American south"}, {"url": "https://www.splcenter.org/fighting-hate/extremist-files/individual/william-pierce", "page_content": "Pierce was the movement's fiercest anti-Semitic ideologue and he built the Alliance into a money-making machine through its hate music business, Resistance Records. Pierce was also the author of the race war novel The Turner Diaries. The book has been called \"the bible of the racist right,\" is known to have drawn many into the movement, and was a key inspiration for Timothy McVeigh's 1995 Oklahoma City bombing.\n\nIn His Own Words\n\n\"After the sickness of ‘multiculturalism,' which is destroying America, Britain, and every other Aryan nation in which it is being promoted, has been swept away, we must again have a racially clean area of the earth for the further development of our people. … We will not be deterred by the difficulty or temporary unpleasantness involved, because we realize that it is absolutely necessary for our racial survival.\"\n\n— \"What is the National Alliance?\", National Alliance website, undated\n\n\"[T]he Alliance has no interest at all in the so-called movement. We're not interested in uniting with the movement, and we're not interested in competing with the movement for members. If anything, we should be grateful that the movement is out there to soak up a lot of the freaks and weaklings who otherwise might find their way into the Alliance and make problems for us. In this regard, I was sorry to note Aryan Nations and the [World] Church of the Creator have, for all practical purposes, died in the last few weeks. I hope one or two replacement groups spring up to draw away from us the defectives.\"\n\n— Pierce's final speech, National Alliance leadership conference, April 2002\n\n\"If the protagonist learns something or comes to believe in something, if he changes his ideas, the reader tends to do the same thing, he changes too. So what you have is a powerful teaching tool, a persuasive tool.\"\n\n— Pierce, quoted in a biography of him called Fame of a Dead Man's Deeds, on the power of narrative\n\nBackground\n\nWilliam Luther Pierce's bigoted attitudes toward people of color were inculcated at an early age. He was born in Atlanta into an Old South aristocracy that included his mother and her ancestors. His great-grandfather, he has said, was governor of Alabama and attorney general of the Confederacy during the Civil War. According to a fawning biography of Pierce by University of Vermont Professor Robert Griffin, Fame of a Dead Man's Deeds: An Up-Close Portrait of White Nationalist William Pierce, he grew up in a Southern household during segregation with older relatives who treated a black servant like a virtual slave.\n\nPierce graduated from Houston's Rice University in 1955 with a bachelor's degree in physics. He worked at the Los Alamos National Laboratory before attending graduate school, first at Caltech and then at the University of Colorado at Boulder, where he earned his Ph.D. in physics in 1962. He taught physics as an assistant professor at Oregon State University from 1962 to 1965. It was during that time that Pierce became concerned by the threat to the white race that he believed was posed by the civil rights and anti-Vietnam War movements, and he joined the John Birch Society, a right-wing group that once accused President Eisenhower, among many others, of being a communist.\n\nThe John Birch Society, which generally rejected anti-Semitism, turned out to be too namby-pamby for Pierce. In 1966, he quit a job as a senior research scientist at a Connecticut aerospace firm to join George Lincoln Rockwell's American Nazi Party (1959-67). Upon buying a printing press, Pierce become editor of the party's National Socialist World. After Rockwell was assassinated the following year, Pierce continued to work with the remnants of the group, which by then was renamed the National Socialist White People's Party. In 1968, Pierce became an official of Youth for Wallace, an organization supporting Alabama segregationist and former Gov. George Wallace's bid for the presidency. Willis Carto, already one of America's leading anti-Semitic activists, also joined the Wallace group and in 1970 he and Pierce reconfigured Youth for Wallace into the National Youth Alliance (NYA). But the two men had a major falling out, and each claimed to be the new group's leader. In 1971, Carto accused Pierce of stealing a mailing list belonging to Carto's anti-Semitic Liberty Lobby organization. Pierce had written to those on the mailing list, attacking the Liberty Lobby's leaders, including Carto. Eventually, Pierce won control of the NYA, which was limited to people under age 30 and focused on activities on college and university campuses.\n\nIn 1974, Pierce dropped the age limit and reorganized the NYA as the National Alliance (NA), which he would lead until his death in 2002. The NA, which aimed to be a vanguard party capable of leading the \"lemmings\" comprising the white masses to revolutionary victory, adopted the slogans \"Free Men Are Not Equal\" and \"Equal Men Are Not Free.\" Effectively a Leninist in terms of tactics, Pierce was not interested in winning his battle through electoral successes. He wanted his vanguard to lead the white masses to power, something that could only come after a period of ethnic cleansing that Pierce referred to as a \"temporary unpleasantness,\" the seizure of state power and creation of all-white nations.\n\nThe text that made Pierce famous, however, was his novel of race war, The Turner Diaries, published in 1978 under the pseudonym Andrew MacDonald after first being serialized in the NA publication Attack! The NA boasted that the book was a \"Blueprint,\" a \"Handbook for White Victory.\" Pierce told his seminal story through two years of diary entries by his white supremacist hero, Earl Turner. Turner carries out orders for the Organization, an underground group struggling against the System — an anti-white, anti-gun U.S. government that continually puts more restrictions on its citizens. Using \"detonators, timers, igniters and other gadgets\" built by Turner, the Organization spawns vicious warfare between blacks, Jews and whites as it takes over the country, city by city. The violence is unforgettably vivid. Turner describes slicing the throat of a Jewish shop owner \"from ear to ear,\" murdering a Washington Post editor with two shotgun blasts, and watching starving blacks barbecue and eat white children. By the novel's end, Turner is working for an elite survivalist group called the Order and plotting a suicide mission — flying a crop-duster plane strapped with a warhead into the Pentagon, the System's last remaining military stronghold. \"Two-thirds of the troops around the Pentagon are n------,\" Turner writes in his journal, \"which should greatly enhance my chances of getting through.\"\n\nPierce's novel has inspired many a terrorist. In 1983, the NA's Pacific Northwest leader, Robert Mathews, joined with three other Alliance members and, later, some 20 other people, to create The Order, a white supremacist terrorist group. Based on the group portrayed in The Turner Diaries, Mathews' gang ultimately robbed some $4 million from armored cars. Declaring \"War in '84,\" members of The Order murdered a well-known Jewish talk show host, Alan Berg, in Denver. (The first person on their hit list was Southern Poverty Law Center co-founder Morris Dees. They abandoned that attempt due to high levels of security.) Later that year, Mathews was killed in a shootout with the FBI. Pierce hailed his martyred acolyte, saying Mathews \"took us from name-calling to bloodletting.\"\n\nIn 1995, Timothy McVeigh, aided by Army pals Terry Nichols and Michael Fortier, blew up the Oklahoma City federal building, killing 168 people, including 19 children. The day before, according to officials, McVeigh called an NA recorded message line seven times. When McVeigh was arrested, police found excerpts from The Turner Diaries in his car. After the attack, which was patterned on a similar bombing depicted in The Turner Diaries, Pierce predicted, or maybe hoped, that resentment of Jews, minorities and others would lead to terrorism \"on a scale the world has never seen before.\" In 1998, before three white men in Texas beat and dragged James Byrd Jr. to death behind a pickup truck, one of the men, John King, reportedly announced, \"We're starting The Turner Diaries early.\" There are many other cases, as well, where killers were said to be inspired by the novel.\n\nIn 1989, Pierce's publishing arm, National Vanguard Books, printed his second novel, Hunter, depicting the assassination of interracial couples, Jews and politicians. The book was dedicated to Joseph Paul Franklin, convicted of the sniper murders of at least two black men. That same year, on the 100th anniversary of Adolf Hitler's birth, Pierce editorialized that the Nazi leader was \"the greatest man of our era.\" In 1991, Pierce began broadcasting a shortwave radio program, \"American Dissident Voices,\" that was heard worldwide. Within months, it was carried by several AM stations.\n\nIn 1984, after several years in the Arlington, Va., area, Pierce paid $95,000 in cash for a 346-acre tract of land atop a small mountain in West Virginia, where he set up what would become the NA's permanent compound. He would build several structures on the land, including a building for his Cosmotheist Church, which housed the bogus religion conjured up by Pierce primarily as an unsuccessful tax dodge. It was from this compound that Pierce ran an empire that ultimately included sales of books, cassettes, music, and racist paraphernalia. The group created a system of monthly dues and produced a monthly update for its members, the National Alliance Bulletin. At its peak, around the time of Pierce's death in 2002, the NA had more than 1,400 dues-paying members.\n\nThe NA also served as a launching pad for many white supremacist terrorists. Besides the Order members, in 1996 officials arrested NA member Todd Vanbiber in Florida after a pipe bomb he was building exploded in his face. After Vanbiber was sentenced for federal firearms violations, other NA confederates testified that the Vanbiber gang had robbed three banks and donated at least $2,000 to Pierce. A week before the first anniversary of the Oklahoma City bombing, Larry Shoemake opened fire on a black neighborhood in Jackson, Miss., killing one person and wounding seven others. Relatives said he was inspired by Pierce's writings.\n\nIn 1999, Pierce made an important business investment, buying white power music label Resistance Records for some $250,000. The deal gave Pierce control of the label's CD catalogue, inventory, mailing list and publishing arm. In the next few years, Resistance came to dominate the white power music scene and also became the biggest moneymaker in the NA empire. Pierce added to that empire in 2000, after \"national socialist black metal\" musician and convicted German murderer Hendrik Möbus took up residence at the NA headquarters. Möbus' music label, Cymophane, was then transferred to Pierce's control. Three months after arriving at the compound, Möbus was arrested on an international arrest warrant issued in Germany. Pierce spearheaded a campaign to free Möbus and raised money to pay for his legal fees. Ultimately, however, Möbus was deported and jailed in Germany.\n\nIn 2001, in a major break with the past, the NA began to hold rallies and engage in other public activities like leafleting. Organized by Deputy Membership Coordinator Billy Roper, NA members joined, for the first time, with other white supremacists in front of the Israeli Embassy to protest Jewish influence in the U.S.\n\nAccording to Fame of a Dead Man's Deeds, Pierce married five times. His first wife was Patricia Jones, whom he met while at the California Institute of Technology. They were married in 1957 and had twins sons, Kelvin and Erik, born in 1962. The marriage ended in divorce in 1982. Pierce was remarried that same year to Elizabeth Prostel, who worked for the NA. The marriage ended in 1985, when Pierce moved his headquarters to West Virginia. In Fame of a Dead Man's Deeds, Pierce talks of preferring immigrant women from Eastern Europe. He married Hungarian Olga Skerlecz in 1986, a marriage that lasted until 1990, when she left Pierce and West Virginia \"for greener pastures in California.\" Pierce then wed a woman named Zsuzsannah, also Hungarian, in early 1991. They met through an ad that Pierce placed in a Hungarian women's magazine. Zsuzsannah left him for Florida in mid-1996. His last marriage, which lasted until his death, was with another Eastern European woman whom he married in 1997. He was sharp and condescending toward his last wife, identified only with the pseudonym Irena in Fame, when he was not ignoring her. Irena was miserable living with the savior of the white race.\n\nIn 2002, Pierce made his last public speech at one of the NA's secretive \"leadership conferences\" that were held twice a year at the West Virginia compound. Held on April 20, Hitler's birthday, Pierce emphasized the need to continue building a professional organization while rejecting alliances with other hate groups, whom he derisively mocked. For the 10 days before his unforeseen death from kidney failure and cancer on July 23, 2002, Pierce instructed his subordinates, and worked feverishly to try to assure the survival of the NA. Pierce died an old-fashioned death, appropriate for a man who conceived of himself in decidedly old-fashioned terms — as a lord among serfs, an elite leader uniquely capable of leading \"his people\" to victory over Jews, \"race traitors,\" and a whole host of other enemies.\n\nPierce's 2002 death came at a critical moment for the NA. A quarter-century after birthing the group, Pierce had finally remade his outfit into a remarkably professional organization. Much of the previous two years had been spent building up a talented staff, learning how to run a profitable business, and intensifying recruiting and propaganda. Just before his death, the NA was bringing in more than $1 million a year, had a paid national staff of 17 full-time officials, and was better known than at any time in its history. Pierce's voice, broadcast via his \"American Dissident Voices\" Internet show, was being heard in Europe and the U.S. In just five days in June 2002, NA members in 20 states distributed 70,000 leaflets.\n\nSix days after Pierce's death, a committee of his key staffers announced that the NA had selected a new leader. Erich Gliebe, the hard-edged former boxer who fought professionally as \"The Aryan Barbarian,\" would be the new chairman, although all agreed that no one could replace Pierce, who was memorialized as \"Our Eternal Chairman,\" comparable to Hitler himself. But Pierce's condescending and harsh words during his final speech doomed the group. His comments that other hate groups were filled with \"freaks and weaklings,\" something first disclosed by the Intelligence Report, seriously undermined the group by driving away its customer base. Within a few months, infighting broke out among the leadership, and splits started to occur. By 2009, the NA had lost nearly all of its members, falling from a high of more than 1,400 to fewer than than 100, Resistance was losing money, and Gliebe was living in the basement of his mother's Cleveland-area home."}, {"url": "https://www.splcenter.org/news/2012/07/23/ten-years-after-founders-death-key-neo-nazi-movement-joke", "page_content": "Last year, a balding, 46-year-old man slipped quietly into the men’s rooms of three Orlando, Fla., area biker bars, where he warily pasted “Bring Our Troops Home” stickers on washroom mirrors. From there, his secret mission took him to an upscale Irish pub and a seafood restaurant, where he again made his way to the men’s rooms and pasted up that sticker and another, “Stop Immigration!”\n\nA few days later, Wendell Duke Witten detailed his daring exploits to fellow members of the neo-Nazi group he’d joined seven months earlier, and on whose behalf he had been propagandizing. “I will check [the stickers] in a week to see how many are still where I placed them,” he earnestly assured his comrades.\n\nWelcome to the new National Alliance, once America’s leading hate group. Ten years after the death of founder William Pierce — a former university physics professor and radical intellectual with a major following both here and in Europe — the Alliance has been transformed from the nation’s radical-right powerhouse into a tiny band of small-time propagandists, criminal thugs and attention-seeking losers. Recruitment and income are dismal, and the group rarely makes the news. Its leader, fresh from a withering divorce from his stripper wife, is widely disrespected by his followers and does not even live at the group’s West Virginia headquarters.\n\nAnd the revolutionary activities of the Alliance, which seeks to build a fascist state peopled solely by whites, have been reduced to a few bathroom stickers.\n\nNot that the group isn’t dangerous. In the last decade, the organization that once prided itself on the quality of its members has been distinguished by the pure thuggery of its people. Since Pierce’s death, four Alliance recruits have been convicted or accused of having carried out at least a dozen murders. And that’s not all. Even many more humdrum members are distinguished by their criminality.\n\nTake Wendell Witten, who battles for the Aryan race with stickers pasted in the men’s rooms of seedy bars and chain restaurants. Witten, who goes by the name Edmond W. Duke on the Alliance’s Resistance Web forum, is a registered Florida sex offender with convictions for aggravated assault and sexual battery that go back more than 20 years. His many tattoos include one that reads, “No Mercy.”\n\nTen years ago, the Alliance had 1,400 carefully selected and clean-cut members, a paid national staff of 17, and great respect in radical-right circles in America and abroad. Its publications, including a newsletter and a journal, set the standard on the extreme right, and its leaders regularly met with their counterparts in Europe. In Florida, it bought radio time and billboard ads. Between dues and income from its white-power music label, it was bringing in almost $1 million a year.\n\nToday, the National Alliance is widely viewed as a joke.\n\n\n\nStrange encounters: Willis Carto was an ally of Alliance founder William Pierce in the 1960s, but the two anti-Semites feuded for the next three decades. Carto was nevertheless invited to a number of Alliance events in recent years, including one where he edified skinhead Ryan Maziarka, the swastika-tattooed treasurer of the group’s current board of directors. The end result was the humiliation of Pierce successor Erich Gliebe.\n\n“It’s a shame watching yet another organization collapse,” one poster lamented in a long thread about the group on the racist Stormfront Web forum this March. “There are hundreds of White ‘Nationalist’ organizations in the US — [but] not one is taken more serious[ly] than a street gang in LA. And most not even that serious[ly]. … Even the lowly negroid eclipses our best attempt at organization.”\n\n‘Freaks and Weaklings’ Redux\n\nNot long after the July 23, 2002, death of founder William Pierce, the Intelligence Report published excerpts from Pierce’s last speech, given on April 20 of that year. In his talk at one of the Alliance’s “leadership conferences,” Pierce mocked the white power movement, saying there was no such thing, and denigrated members of other neo-Nazi groups as “hobbyists, freaks and weaklings.”\n\nThose words, which increasingly describe the Alliance’s own poorly screened recruits and hapless current leader, are coming back to haunt the group today.\n\nRemarkably, Pierce's handpicked successor, Erich Gliebe, has managed over the last 10 years to hold on to power through a series of internal revolts, splits and personal attacks on him for his extremely weak leadership. But he has also taken the Alliance to a place where it has a membership of fewer than 75 people, has not published a magazine in recent memory, and is in desperate need of funds.\n\nThings came to something of a head in 2010, when Willis Carto, a longtime anti-Semite who had feuded with 1960s ally William Pierce for decades, was invited to one of the Alliance’s leadership conferences. Carto gave a speech sharply criticizing Gliebe and arguing the Alliance was failing because of his leadership.\n\nMembers who were there describe Gliebe as almost paralyzed during the attack and say he did not respond or try to defend himself. Instead, Jim Ring, a longtime member who some see as the group’s real leader, took Carto aside later and ordered him and his entourage off the group’s West Virginia compound.\n\nMany were shocked Gliebe had even invited Carto, who is not an Alliance member, and Gliebe later claimed he had not done so. But that was contradicted by the pre-printed program for the conference, which included Carto’s name.\n\nGliebe, despite frequently suggesting that he is writing from the Alliance’s headquarters, has not been back to West Virginia since — and the group never held the 2011 edition of its annual leadership conference there. (As a matter of fact, no one at all lives at the compound near Mill Point any more. A couple of members visit weekly to deal with the mail and other necessary tasks.) He lives in North Royalton, Ohio, near his mother, and reportedly works a few hours each night as a poorly paid custodian at a local product development and manufacturing firm.\n\nHe is now widely seen, to use Pierce’s word, as a “weakling.”\n\nPierce also despised what he called “hobbyists” or “Hollywood Nazis,” routinely mocking those who dress up in faux Nazi outfits. But Gliebe has been more forbearing — or perhaps just less attentive. This March, a man named Sean Michael Woodcock joined the Alliance, where, using the name Sean K98, he posted photos of himself at an event hosted by the Aryan Nations, one of the competing neo-Nazi organizations Pierce had belittled by name. He also posted pictures of his collection of World War II uniforms and memorabilia, along with hundreds of boxed dolls and toys from the Star Wars movies. “Don’t mind the Star Wars stuff,” he wrote.\n\nThat kind of “hobbyism” isn’t limited to Sean Woodcock. Another member, Joe Ross, reportedly left the Alliance $10,000 when he died around 2003. But a photo has since surfaced of Ross posing in full-blown Nazi regalia, sieg-heiling before a flaming swastika at Nordic Fest, an annual white-power concert long put on by the thuggish Imperial Klans of America at its Kentucky compound.\n\nEven Jim Ring, the California Alliance leader and longtime member who is the group’s most dedicated remaining activist, held a 2009 party to celebrate the führer’s 120th birthday. Two years later, he posed with his son, Connor Ring, who had just joined the Alliance, while brandishing a Nazi SS officer’s dagger and a thick, gold necklace chain incorporating the Alliance life rune symbol — just the kind of garish display that Pierce despised and routinely attributed to black “ghetto” culture.\n\nThe Alliance has devolved into something Pierce would have been appalled to see. But its failings today are not limited to its members’ low-rent activities. It has also become known for the murderous nature of many of its people.\n\nCrime and the New Alliance\n\nLast year, after a lengthy investigation, federal agents arrested a Washington state man named Kevin Harpham, who that January had planted a deadly anti-personnel bomb laced with rat poison on the route to be taken by about a thousand Martin Luther King Jr. Day marchers in Spokane. (The bomb was discovered and dismantled before it went off.) When the Southern Poverty Law Center said it had evidence that Harpham had joined the Alliance several years before, Gliebe hotly denied that the man had any affiliation with his group. But after Harpham pleaded guilty, drawing a 32-year prison term, prosecutors entered Harpham’s Alliance membership card into evidence as part of a sentencing memorandum.\n\nShortly after Harpham’s attempted mass murder, federal agents arrested a former Arizona Alliance member, Jeffrey Harbin, for manufacturing pipe bombs and grenades that were apparently intended for use against Latino immigrants. They had been designed, a prosecutor said later, so as to “maximize human carnage.” Harbin’s father, Jerry Harbin, had for years been the Alliance coordinator in Phoenix. This February, the younger Harbin was sentenced to two years in a plea deal.\n\nBut that just begins to cover Alliance-related criminality. Consider:\n\n•In October 2002, Alliance member Samuel Compton was one of three men who attacked an innocent bystander who was watching the men in a bar fight in Phoenix. Compton, a 20-year-old with “White Pride” tattooed on his back, and the other two stomped to death 20-year-old Cole Bailey, who was himself white, with the steel-toed boots favored by racist skinheads. After accepting a plea agreement, Compton was sentenced to 22 years in prison.\n\n\n\nSamuel Compton (left) and Jason McGhee, between them responsible for the murder of five people, are emblematic of the new National Alliance.\n\n•In March 2006, Alliance member Jason McGhee and two other men stormed into a farmhouse frequented by young people in Cumming, Ga., and stabbed or shot four people to death and wounded three others. Officials say the men apparently were responding to an insult that one of them had suffered at the house earlier. McGhee pleaded guilty last December and was handed four consecutive life sentences plus 100 years. The local district attorney said she believes McGhee, who has agreed to testify against his alleged confederates, did all the shooting and stabbing. (In 2001, McGhee and another man were arrested for yelling racial slurs and firing guns at a group of schoolchildren but were not prosecuted because the victims would not testify.)\n\n\n\nSean Woodcock’s paraphernalia collection typifies the “hobbyism” Aliance founder William Pierce despised.\n\n•In February 2008, former Alliance member Jim Leshkevich, after writing that he was depressed over learning that his wife was having an affair, murdered her before killing himself in the couple’s West Hurley, N.Y., home. Officials say that Leshkevich, 52, beat and strangled his 55-year-old wife, Deborah, in their bedroom before hanging himself in their attached garage.\n\n•In July 2010, former Alliance member William Dathan Holbert and his girlfriend were arrested in Nicaragua while trying to enter illegally and returned to Panama, where authorities say they killed at least six people. Officials in Panama said the couple kidnapped other U.S. expatriates, killed them, and then stole their property. Holbert confessed to five of the killings.\n\n\n\nAlliance stalwart Jim Ring, joined by his son Connor last year, poses with Nazi SS daggers and gold jewelry.\n\nThese cases weren’t the only evidence of the propensity of today’s Alliance members and associates to criminality. Still another came up in October 2010, shortly after Gliebe’s humiliation by Carto at the last leadership conference.\n\nOn the Alliance’s Resistance forum, Gliebe lauded a speech at the conference by Michael David Carothers, who uses the alias Michael Weaver and who Gliebe had named the Alliance’s 2008 “Activist of the Year.” Gliebe said Carothers had delivered a “truly inspirational, high energy speech” and predicted that he would be invited back the next year — to the leadership conference that never happened.\n\nSeven weeks after delivering that speech, Carothers drove a car up alongside a black man in Columbus, Ga., and attacked him with pepper spray. Last November, after a judge ruled that a jury could hear about a 1999 case in which Carothers had threatened three times to kill a 15-year-old girl, he pleaded guilty and was sentenced to one year of prison, to be followed by nine years of probation.\n\n\n\nErich Gliebe hotly denied that domestic terrorist Kevin Harpham was a part of his group. That didn’t stop prosecutors from entering Harpham’s membership card into evidence when he was sentenced to 32 years in prison.\n\nWinding Down\n\nThe Cleveland unit of the National Alliance, which Gliebe originally formed and still leads, reflects the general disarray into which the group has fallen. What was once a monthly meeting held in a large restaurant meeting room attended by dozens of members has diminished to half a dozen members, at most, gathering at a single table at Dimitri’s Restaurant in a rundown area of West Cleveland.\n\nThe meetings today are marked by complaining and bickering. One local member, David Daams, was attacked for not donating enough money. Another, Kurtis Kreit, has been ridiculed for his weight and not giving enough. Gliebe, who generally collects about $30 in donations at these meetings, has criticized others, including his ex-wife and North Carolina coordinator Robert Arnett, for a variety of reasons. A man who was Gliebe’s first recruit in the unit, Donald Myers Jr., recently began attending the meetings again, but mainly to complain about the state of the group. “The white race,” Myers now laments, “is not worth saving.”\n\n\n\nThe surfacing of this photo of late Alliance member Joe Ross has come as another embarrassment to the group’s leader.\n\nWhen Pierce died in 2002, the Alliance was taking in about $18,000 a week in dues, donations, book and music sales. Today, sales at Resistance Records and National Vanguard Books are down to about $500 a week. The group’s Resistance music magazine has not been published in five years, and its National Vanguard flagship publication has not appeared in three. Gliebe has been promising for 10 years to publish Pierce’s last book, a collection of essays titled Who We Are, but has not done so — despite the threat that a major bequest to the Alliance will not be released by the estate’s executor until Who We Are finally goes to press.\n\nAnd then there are the trees. Pierce, who originally bought the group’s West Virginia property, long treasured the ancient oaks, hickories and red maples that grew there, even forbidding his followers to cut trees to stoke the wood-fired stoves that heat the buildings on the compound. But now Gliebe has begun to sell those trees to a logging company that has already cut over the property twice.\n\nIt’s not clear how long the Alliance and its besieged leader can hang on in this atmosphere. But what is certain is the group is nothing like the tightly organized entity that William Pierce founded in 1970 and built into a real power.\n\n“I was a member up until 2009 and believe me I held out as long as I possibly could,” wrote one poster on the Stormfront thread entitled “Erich Gliebe RUINED The National Alliance.” “Erich, you should really ask yourself why it is the NA is a mere shadow of its former self. You should be ashamed of what you have done to the legacy of William Pierce. … Why the hell would anyone join the NA in its current state? … Now all I can hope for is that everyone keeps his memory alive.”"}, {"url": "https://www.nytimes.com/2002/07/24/us/william-pierce-69-neo-nazi-leader-dies.html", "page_content": "William Luther Pierce, an ascetic physics professor who built an organization of young supporters for George Wallace for president into the nation's largest neo-Nazi group, and whose novel ''The Turner Diaries'' was credited by Timothy J. McVeigh with inspiring the Oklahoma City bombing, died yesterday. He was 69.\n\nFour weeks ago, Dr. Pierce, as he preferred to be called, learned that he had terminal cancer and began preparing for others to continue the work of his organization, the National Alliance, said Kevin Strom, editor of its magazine, The National Vanguard.\n\nDr. Pierce died at noon in the trailer home where he had lived in Hillsboro, W.Va., for 20 years, said Roger DeMarais, another associate.\n\nHe died as the leader of another racist group, Richard Butler of the Aryan Nations, is seriously ill, leaving a leadership void in the small but violent world of racist organizations. That may benefit the Rev. Matt Hale, a former law school student in East Peoria, Ill., in expanding his World Church of the Creator, a religion that has no deity."}, {"url": "https://www.latimes.com/archives/la-xpm-2002-jul-24-me-pierce24-story.html", "page_content": "TIMES STAFF WRITER\n\nWilliam L. Pierce, a rocket scientist turned neo-Nazi writer who used a mix of intellect and hate to rise to the top of the American white supremacist movement and become the “godfather” of skinheads, died Tuesday in his West Virginia compound.\n\nHe was 68. The cause of death was renal failure, a spokesman said.\n\nPierce, who freeze-dried rabbits and stockpiled guns in preparation for Armageddon, wrote the novel “The Turner Diaries,” a hate-filled book thought to have inspired Oklahoma City bomber Timothy J. McVeigh.\n\nAdvertisement\n\nFrom his fenced-off compound in Hillsboro, W. Va., the tall, avuncular Pierce commanded an army of 1,500 skinhead followers, under the banner of the National Alliance, with dozens of chapters across the country and around the world.\n\nPierce called for the establishment of all-white “homelands” and the expulsion of blacks and Jews, and disseminated ideas through the Internet, books and rallies. The most recent National Alliance event was 10 days ago, a march in Gainesville, Ga., organized to intimidate the town’s large--and growing--Latino population.\n\nWatchdog groups consider the National Alliance the most dangerous white supremacist organization, partly because Pierce helped spread its message to educated and professional people.\n\n“William Pierce created a very regimented, sophisticated network,” said Deborah Lauter, Southeast regional director for the Anti-Defamation League. “He was the godfather of hate in this country. I imagine his death will be a blow to the movement.”\n\nPierce is credited with extending the reach of the skinhead movement to angry teens by buying a white-power recording studio, Resistance Records, which churns out lyrics like: “Did 6 million Jews really die or was it just a Zionist lie....” He also designed a video game called Ethnic Cleansing.\n\nHis supporters say that he was misunderstood and that despite his image as a violent separatist, he was in fact a gentle man who liked walking through the woods with his Persian cat, Hadley, on his shoulders.\n\n“Unfortunately, Dr. Pierce is one of those great men who will be better appreciated after he’s gone,” said Chester J. Doles, a National Alliance leader in Georgia. “I mean, some of his teachings were just too advanced for his time.”\n\nWilliam Luther Pierce was born in 1933 in Atlanta, the son of an insurance agent and journalist. He went to Rice University as an undergraduate, received his doctorate from the University of Colorado and then taught physics at Oregon State University. He also worked on jet propulsion at a Pratt & Whitney laboratory.\n\nBy the early 1970s, Pierce had left the scientific world to join the ranks of the growing Aryan movement. In 1974, he founded the National Alliance in Arlington, Va. Ten years later, he relocated to the hills of West Virginia, where authorities monitored him but mostly left him alone.\n\n“The Turner Diaries” is his best-known work, a fictional story published in 1978 about a group of neo-Nazis who violently overthrow the government.\n\nFederal prosecutors called the novel “a blueprint” for the Oklahoma City bombing, with McVeigh using the same explosive--ammonium nitrate fertilizer--as Pierce’s character in the book and setting off his device about the same time, 9 a.m. McVeigh was a known acolyte of Pierce’s, and a passage from “The Turner Diaries” was found in McVeigh’s car after his arrest.\n\nUnlike white supremacist leaders imprisoned for their connections to violent acts, Pierce was never convicted of a serious crime.\n\nThree weeks ago, he was diagnosed with widespread cancer, said Billy Roper, a National Alliance official.\n\nBut he chose to continue living in his compound and died of kidney failure in his room on Tuesday.\n\nPierce is survived by two sons and a brother.\n\nNational Alliance officials would not discuss who will succeed him."}, {"url": "https://simple.wikipedia.org/wiki/American_Nazi_Party", "page_content": "The American Nazi Party (ANP) is an American neo-Nazi political party. It was founded by George Lincoln Rockwell.[1] The original name of this organization was World Union of Free National Socialists (WUFENS). The WUFENS headquarters was in Arlington, Virginia. It was renamed to American Nazi Party in 1960.\n\nThe party is based on the ideals and policies of Adolf Hitler's Nazi Party in Germany during the Nazi era.[2]\n\nOn August 25, 1967, after Rockwell left a laundromat, he was shot by a former follower named John Patler as Rockwell was getting into his vehicle. Rockwell was later pronounced dead.[3]\n\nNotable former members [ change | change source ]\n\n\n\n"}, {"url": "https://truthout.org/articles/the-long-arm-of-the-american-nazi-party-reaches-the-2020-illinois-primary/", "page_content": "Republicans voting on Tuesday in Illinois’s 3rd congressional district primary will get to decide if they want Art Jones, a lifelong white supremacist, to be their candidate. The state’s GOP is actively campaigning against him. They are still embarrassed that Jones was their 2018 candidate, after the party had forgotten to field a primary opponent to ensure that he wasn’t their candidate in the general election in a strongly Democratic district. And later that year, despite ample publicity of his views, Jones received 57,000 votes (26 percent) in the general election.\n\nBut Jones, and his perennial campaigns, are not a random product of one man’s idiosyncratic commitment to bigotry. Rather, they are the direct result of neo-Nazi activity in Chicago, and Illinois more broadly, which goes back to the 1960s. These have included Nazi-led rallies which have drawn thousands, as well as electoral campaigns which have also produced unusually high outcomes.\n\nThe continuing influence of neo-Nazi organizing, a half-century after its heyday, should be a warning about the “alt-right.” Even though its influence is subsiding, we should be prepared for the thousands of young adults who’ve become white nationalists through the movement to remain politically active for decades. The alt-right has created a new generation of racist activists, breathing fresh life into what previously was a moribund movement.\n\nA History of White Supremacist Electoralism\n\nEven before World War II, there were Nazis in Chicago; pro-Hitler groups like the German American Bund had a strong base of support there. The leadership of the America First Committee also came from Chicago. This group opposed U.S. entry into the war but not from a pacifist approach; consequently, it was filled with fascists.\n\nChicago was also the site of the greatest achievement of George Lincoln Rockwell’s American Nazi Party, which was the first postwar group to openly embrace the Nazi label. Rockwell traveled to Chicago to oppose Martin Luther King Jr.’s Chicago Freedom Movement, which sought to desegregate housing markets. In August 1966, a Rockwell speech in Marquette Park drew 2,000 local residents. A September 1966 march drew 250 people, including many local youths who marched with the Nazis while wearing “White Power” t-shirts.\n\nIn order to take advantage of this newfound popularity, Rockwell changed the American Nazi Party’s catchy name to the awkward National Socialist White People’s Party (NSWPP). But he was assassinated in 1967 and his replacement was unpopular. Many groups splintered off the party, including members of the Chicago chapter, who in 1970 formed a new organization, the National Socialist Party of America (NSPA). They sought to rebuild a base in the same neighborhoods that had supported Rockwell in 1966. The NSPA opened a local storefront office and held public rallies — until the city prevented them from doing so with exorbitant fees. The NSPA responded by threatening to march in Skokie, a nearby suburb where many Jewish Holocaust survivors lived. This ended up in a famous lawsuit in which the Supreme Court ruled in favor of the Nazis, who were backed by the ACLU, on free speech grounds. The NSPA never went to Skokie, however; instead, they held a celebratory march in Marquette Park in July 1978. (This was lampooned in the Blues Brothers movie, where Jake and Elwood run the Nazis off a bridge after declaring, “I hate Illinois Nazis!”)\n\nThe NSPA used the ballot box, too; in 1975, their leader won 16 percent in a city council election. Meanwhile, in Milwaukee, the NSWPP’s Art Jones ran political ads — complete with swastikas — in the February 1976 mayoral race, pulling 5.5 percent. And soon after, he moved to Chicago.\n\nThis cohort of Nazis remains present in our political landscape , rang ing in its approach from Art Jones’s ballot to James Mason’s bullet.\n\nChip Berlet, a veteran researcher of the far right, told Truthout that around this time, “There were three different Nazi groups in Chicago. Jones had a group of youngsters who would parade around in uniform.” The NSPA disbanded in the early 1980s, and Jones tried to fill their shoes. Berlet wrote, “By late 1985 it was clear that neonazi Art Jones and Klan leader Ed Novak, both residents of Marquette Park area neighborhoods, along with their small but growing number of supporters, were making some gains in their attempts to organize the neighborhood against integration and tying that to anti-Semitic, anti–gay, and anti–communist organizing.”\n\nJones helped pass the flame of bigotry and blame to another generation, too, as Chicago was one of the first U.S. cities to have organized Nazi skinhead groups. For example, Christian Picciolini — who subsequently left the white supremacist movement and now runs the group Free Radicals, to help others leave it — told me he went to a private meeting with Jones in the 1980s.\n\nToday, Jones is still at it, using elections to spread his political talking points. And in addition to him, a number of other activists and organizations which came out of the American Nazi Party/NSWPP are also around today, and — following the party’s original strategy of courting media attention — regularly pop up in the news. Having changed its name a third time, the party itself still exists as New Order. Its most famous former member is David Duke, who was its star student activist in 1970; he later went on to win a seat as a Louisiana State Representative in 1989.\n\nBut the former member most influential on today’s alt-right is James Mason, whose book Siege has helped spawn “accelerationism” — an idea that encourages terrorism as part of strategy to collapse society. Mason is also the guru for the neo-Nazi Atomwaffen Division, which has been linked to five murders — at least until last week, when Mason announced the group’s dissolution.\n\nWilliam Pierce also came out of the party. Pierce’s infamous novel, The Turner Diaries, depicts a white supremacist revolution that starts with attacks on federal buildings (which inspired the 1995 Oklahoma City bombing) and ends in the “day of the rope” — when Nazis lynch their opponents in the streets. Although Pierce died in 2002, his organization, the National Alliance, still exists, and “the day of the rope” has become an alt-right meme.\n\nThe National Socialist Movement, an open neo-Nazi party which was at the 2017 Charlottesville rally, and in 2019 held an armed counterprotest against the Detroit Pride march, was formed by current and former NSWPP members in 1975. Stormfront, at one point the most popular white supremacist website, was founded by former NSWPP member Don Black. Other projects active today which are run by former party members include Rocky Suhayda’s American Nazi Party, Gerhard Lauck’s NSDAP/AO and Karl Hand’s Racial Nationalist Party of America.\n\nMeanwhile, the Northwest Front advocates forming a separate white ethnostate in the Pacific Northwest. Its founder, Harold Covington, was in the NSWPP; he also briefly lead the NSPA, during which he received 43 percent of the vote in the 1980 North Carolina GOP primary for attorney general. He later moved west and formed the Northwest Front, which has continued on after his 2018 death.\n\nLast, the alt-right also venerates Rockwell himself. His books and speeches are circulated along with memes glorifying him.\n\nIn the last few years, many thousands of people, mostly white men between their teens and 30s, have floated into the alt-right. They have created a whole new generation of white nationalists, with a limited number of organizational ties to the last generation. The American Nazi Party/NSWPP had a similar, although much smaller, dynamic in the 1960s and 1970s. But this cohort of Nazis remains present in our political landscape, ranging in its approach from Art Jones’s ballot to James Mason’s bullet. Though the alt-right appears to have plateaued in influence, it remains an active movement — and, just like its predecessor, we should expect its members to continue to engage in toxic political organizing for many decades to come.\n\nYes, we really mean it – your gift makes a difference. Did you know that of the millions of people who read Truthout, fewer than 1 percent make a donation? But even with that small number who give, Truthout is still overwhelmingly donor-funded. Every donation that comes our way makes an outsized impact for every single one of our readers.\n\nIf you can find a few dollars here or there to support the independent, always-honest journalism we produce, please consider making a donation. All gifts are tax-deductible and go directly to funding our justice-driven work. Will you give today?\n\n\n\nCopyright © Truthout. May not be reprinted without permission."}, {"url": "https://extremism.gwu.edu/founding-fathers-american-neo-nazi", "page_content": "PDF Version\n\nThis study analyzes the leadership style, impact, and enduring legacies of three crucial leaders in the white supremacist and neo-Nazi movements: Louis Beam, William Luther Pierce, and James Mason. It examines the interplay of leadership traits, significant events in the life narratives of the leader, and the legacies of these three key pioneers towards two aims. First, our analysis draws on the CIP Leadership Framework and charismatic leadership studies to assess the respective leadership roles of Beam, Pierce, and Mason. Second, it considers how the leadership traits and ideological impact of these leaders shaped contemporary far-right movements in the United States (U.S.), as well as how the legacies of these figures can be observed in the modern far-right landscape. Overall, we argue that the three leaders profiled herein cover the full leadership spectrum of the CIP framework and that each was both a product and exploiter of their life narratives in ways that fundamentally shaped their leadership style, impact, and legacy on the American far-right landscape.\n\nThis study begins by establishing the foundation for the conceptual framework through which the authors analyze the leadership and impact of Beam, Pierce, and Mason. It draws on the Ligon et al. CIP (Charismatic, Ideological, and Pragmatic) leadership model with its dual focus on leadership typologies and six life events that tend to characterize the life narratives of outstanding leaders. Our framework is further supplemented by a more nuanced conceptual grounding in charismatic leadership theory. It then features the three central case studies. These case studies seek to examine the respective backgrounds, leadership styles, influence, and lasting appeal of these American ideologues. It traces their life experiences, reviewing the totality of their contributions to their respective far-right milieus. In doing so, it examines their roles within specific right-wing movements as well as their roles as nodes that connected disparate elements of the modern far-right. This study concludes by drawing out key overarching findings that emerge from the preceding analysis. Specifically, it focuses on the enduring legacies of Beam, Pierce, and Mason by reflecting on how they have collectively impacted the evolution of violent far-right movements, and considers how the differences in the leadership types and life narratives have shaped that legacy. Finally, it offers policy insights and avenues for future research with respect to the modern far-right landscape and the role of charismatic leadership in prominent white supremacist movements active today."}, {"url": "https://www.vox.com/22232779/the-turner-diaries-novel-links-to-terrorism-william-luther-pierce", "page_content": "Following the January 6 attack on the US Capitol, Amazon took the unusual step on January 12 of removing all copies of a novel called The Turner Diaries from its virtual shelves. That may seem like a drastic stance given the debate over censorship and free speech that has accompanied these types of purges. But it’s one that signifies just how notorious the book has become, and how much real-world damage it’s arguably caused.\n\nWritten and self-published by a racist man who founded a dangerous white supremacist organization, The Turner Diaries has long been viewed as a fundamental manual of extremism. While other more well-known cultural artifacts like The Catcher in the Rye (a favorite of presidential and other assassins) or The Anarchist Cookbook (a well-known “murder manual” for terrorists, mass shooters, and other extremists) have captured the public consciousness as bait for potentially violent, disaffected loners, The Turner Diaries has been little-known for decades outside of extremist circles. But within those extremist circles, it became well-established as a core text due to its use as, essentially, a training manual for America’s largest neo-Nazi organization — and then the internet made it more accessible than ever.\n\nAlthough The Turner Diaries is fiction, its narrative mirrors recent real-world events, probably because many modern-day extremists have been so influenced by it. We can see that influence in the most direct and chilling way — because, among other things, The Turner Diaries ends with a violent terrorist coup against the US government, not unlike the January 6 Capitol insurrection. But while The Turner Diaries is foundational to modern white supremacy’s terrorist tactics, it may have shaped the ideology even more — and that’s an influence that will be harder to remove than the book itself.\n\nThe Turner Diaries was written by an avowed neo-Nazi\n\nThe Turner Diaries was first published in its entirety in 1978 under the pseudonym Andrew Macdonald. The real author was William Luther Pierce — a racist man the hate-watch group Southern Poverty Law Center dubbed “America’s most important Nazi” of the 20th century. It would be hard to overstate Pierce’s galling contributions to the cause of US white supremacy — and that’s without considering The Turner Diaries.\n\nBorn in Atlanta in 1933 and raised in Virginia and Alabama, Pierce reportedly claimed to be descended from a Civil War governor, and attended a military high school in Texas before going on to attain a doctorate in physics. According to an offensively obsequious 2001 biography of Pierce — in which author Robert Griffin extensively quotes Pierce spouting unchallenged white supremacist propaganda — Pierce was raised for part of his childhood by a relative who had a Black person who’d been convicted of a crime working for him who “in effect was his slave.” Racism was a consistent part of Pierce’s upbringing and his political pursuits, and he eventually left a career as a rocket scientist in 1966 to invest more deeply in American Naziism.\n\nHe first joined the American Nazi Party, then gradually latched onto a different group created in support of segregationist Alabama Gov. George Wallace and his 1968 presidential election campaign. Pierce evolved that organization into what ultimately became, in 1974, a group called the National Alliance. The group grew rapidly and gained influence at home and abroad, as Pierce preached dire warnings about how a rise in diversity and the societal changes of the civil rights movement would bring about “the end of white America.”\n\nThrough the National Alliance, Pierce ran his own underground media empire, including a newspaper, a book press, a radio station, and an extremist record distributor — all to broadcast his message of violent white nationalism. His efforts worked. In a report published in 1998, the Anti-Defamation League noted, “With 16 active cells from coast to coast, an estimated membership of 1,000 and several thousand additional Americans listening to its radio broadcasts and browsing its Internet site, the National Alliance is the largest and most active neo-Nazi organization in the nation.”\n\nThe group’s goals, the ADL reported, were to establish “a racially clean area of the earth” and to “do whatever is necessary to achieve this White living space and to keep it White.”\n\nGriffin’s biography reveals Pierce to be a man isolated by his own heinous ideas. Late in his life, he was estranged from both of his sons and was living in rural West Virginia with a lonely young wife with whom it seemed he could barely communicate. She was the latest in a string of Eastern European wives, all of whom he’d chosen based on his belief that Eastern European women were more subservient to men than American women. At the time of his death in 2001, he was reportedly living alone.\n\nBut Pierce’s impact on the national political landscape was far more lasting than his personal relationships.\n\nThe Turner Diaries became exactly what it was intended to be — a manual for violence\n\nThe Turner Diaries began as a fictional adventure series that Pierce published in the National Alliance newspaper, Attack, starting in 1975. A dystopian novel set in a future version of America, it follows the journal entries of a man named Earl Turner as he turns to increasing violence in his resistance to the US government as part of a group called the Organization.\n\nIn Pierce’s scenario, Turner is fighting an orgiastic ultraconservative fantasy of an unchecked liberal future: The government confiscates all guns from private citizens and pursues resistors using a force called “the Equality Police.” The media and Hollywood operate as untrustworthy left-wing propaganda, while racial and ethnic minorities gain power and enact anti-white laws. The back cover of the book asks readers, “What will you do when they come to take your guns?”\n\nThe book contains lurid, graphic violence carried out against liberals, government officials, members of the media, and Black and Jewish citizens. It gleefully urges white militias to rise up and engage in guerrilla warfare against the oppressive government — think the ’80s action movie Red Dawn, in which Russia invades the US and small-town civilians fight back with renegade tactics, but with more racism and bloodlust. Among other things, the book features car bombings, suicide missions, and one scene in which white supremacist terrorists hang politicians en masse — a scene that some experts felt had echoes in the Capitol insurrection, during which a gallows was erected amid calls to hang certain elected officials.\n\nThe book chillingly culminates in Turner planning to fly a plane into the Pentagon in a suicide bombing mission — an act the narrative tells us ushered in a “New Era” of white supremacist rule and made Turner a national folk hero to the subsequent Aryan civilization.\n\nBy all accounts, Pierce intended the book to be influential, more than just a work of fiction, and it was. In many chapters of the National Alliance, the book was required reading and was essentially presented to new members as an instruction manual. Pierce also intended it to glorify violence against nonwhites and progressives. The ADL report quoted a 1997 radio broadcast in which Pierce said:\n\nIn 1975, when I began writing The Turner Diaries ... I wanted to take all of the feminist agitators and propagandists and all of the race-mixing fanatics and all of the media bosses and all of the bureaucrats and politicians who were collaborating with them, and I wanted to put them up against a wall, in batches of a thousand or so at a time, and machine-gun them. And I still want to do that.\n\nAfter its serial publication, Pierce published The Turner Diaries in novel form in 1978 through his own independent press, after which it circulated underground for over a decade, known mainly only to white nationalists, extremists, and the people who kept a close watch on them. By the late 1980s, an advertisement for the book had appeared in the extremist survivalist magazine Soldier of Fortune, making it available via mail order. That’s how it ended up in the hands of an Army recruit named Timothy McVeigh.\n\nLater, at McVeigh’s trial for the 1995 Oklahoma City bombing — the worst terrorist attack on US soil prior to 9/11 — McVeigh’s fellow soldiers would testify that he was obsessed with the book and pored over it constantly. He sold copies of the book at gun shows, and mailed others to friends and family urging them to read it.\n\nOne of them did read it, and later recognized McVeigh’s attack on the Oklahoma City federal building as drawing straight from The Turner Diaries’ terrorist template. When authorities arrested McVeigh, they found excerpts from the book in his car.\n\nMcVeigh’s terrorism is the most famous, but it’s far from the only Turner Diaries-influenced act of extremism or racist violence. These range from lone individual hate crimes to at least one mass assault to numerous crime rings.\n\nOne group of domestic terrorists operating in the ’80s called itself “the Order” after one of the fictional militias in the book, which they referred to as a bible. Their ringleaders were former members of Pierce’s National Alliance, and they allegedly hoped their acts of violence might help usher in the dystopian uprising fictionalized in The Turner Diaries.\n\nIn 1998, another group of National Alliance members planned to detonate 14 bombs across the city of Orlando, including one at the entrance to Walt Disney World; they failed when one of the would-be bombers accidentally set off one of the bombs as he was building it. The Southern Poverty Law Center cites at least 14 terrorist acts linked to the National Alliance between 1983 and 2005.\n\nMuch of this activity, crucially, took place before the internet, which of course made it possible for The Turner Diaries to spread and gain more influence — even beyond the scope of terrorist acts it influenced.\n\nThe novel’s biggest impact on far-right politics may have been philosophical\n\nExtremist expert J.M. Berger has argued that even beyond its practical instruction in violent tactics, The Turner Diaries was directly responsible for a profound shift in extremist right-wing ideas — particularly regarding the way Pierce’s National Alliance, and later the neo-Nazi movement more generally, recruited new members. Through his organization and then through the book, Pierce broadened neo-Nazi messaging by emphasizing emotional rhetoric rather than drilling down into specific, potentially alienating philosophical debates.\n\nBerger wrote in the Atlantic in 2016 that through Pierce’s influence, “prominent white nationalists began to take a more carefully generic approach, playing on racial fear and resentment as they existed, rather than attempting to manufacture doctrinaire justifications.”\n\nIn many respects, Berger argued, The Turner Diaries presaged the amorphous, slippery character of the modern alt-right, with its various loosely allied groups all united under one general commitment to the theme of white nationalism. “The Turner Diaries,” he wrote, “demonstrated how to successfully leverage racial fears and resentments in the service of violence, without a call to a specific ideology.”\n\nNot only that, but The Turner Diaries’ rhetorical emphasis, the constant drumbeat of its themes — they’re coming to take your guns; they’re coming for you; the media can’t be trusted; violent reaction is all but inevitable — seems not only to form the backbone of far-right propaganda but to contain significant parallels to today’s mainstream conservative ideology. As a text, it offers the kind of heady heroic narrative that appeals to would-be rebels, patriots, and martyrs for a cause. It teaches its adherents not just to adopt the mentality that they are at war with progressives, but that a real-life war is inevitable. As the New York Times observed after the Capitol insurrection, a Telegram user watching the melee wrote, “The turner diaries mentioned this. Keep reading.”\n\nStill, Berger told Vox that while prohibiting access to The Turner Diaries is an important part of dismantling white supremacy, it’s not as crucial as many in the media have made it seem. “The Turner Diaries is a landmark text in white nationalism, and it’s worth talking about,” he said in an email. “But I think its relevance to the Capitol Siege has been overplayed somewhat.”\n\nBerger pointed out that while the book’s removal from Amazon is a step forward, it’s not the only such work out there that white supremacists have drawn inspiration from.\n\n“The book is already notorious and widely available online for free, so while it’s probably a net positive that it’s been removed from Amazon, it’s not exactly a game-changer,” he said.\n\n“I think the significance has more to do with Amazon waking up to the problem of extremist content on its platform, which can be seen in some of its other recent moves as well,” he added. He noted that in recent weeks, Amazon has removed products promoting the QAnon conspiracy and banned white nationalist groups from its charity program, after previously removing merchandise related to other white supremacist and neo-Nazi organizations. “Several of these removals are more pragmatically important because they deny revenue streams to current extremist leaders and groups,” Berger explained.\n\nIn other words, it takes dismantling a white supremacist village to fully attack the ugliness that leads to real-world violence. Removing The Turner Diaries and these other elements from Amazon, along with deplatforming extremists from other parts of the mainstream internet, won’t totally remove their ability to access harmful material that helps fuel their hate. Still, these actions may crucially make such material harder for potential recruits to find. As Berger concluded, Amazon and tech companies like it “still have some way to go, but it’s a start.”"}, {"url": "https://www.theatlantic.com/politics/archive/2016/09/how-the-turner-diaries-changed-white-nationalism/500039/", "page_content": "Before there was an alt-right, there was The Turner Diaries.\n\nFirst published nearly 40 years ago, the infamous dystopian novel depicts a fictional white nationalist revolution culminating in global genocide.\n\nThe events of the book open 25 years ago today—September 16, 1991, the date of the first entry in Earl Turner’s diary. The fictional diary describes a racist’s vision of a nightmare world, in which “The System”—African American enforcers led by Jewish politicians—attempt to confiscate all guns in the United States. A secretive organization known as The Order rises up to take back the country for white supremacists, eventually winning an apocalyptic insurgency and nuclear war, first taking over the country and later the world.\n\nThe Turner Diaries was created in the 1970s by William Luther Pierce, leader of the neo-Nazi group the National Alliance. Crudely written and wildly racist, The Turner Diaries has helped inspire dozens of armed robberies and more than 200 murders in the decades since its publication.\n\nThe Turner Diaries first made headlines when a violent white nationalist gang appropriated the name of The Order, following the tactical blueprint for terrorism in the book. Turner catapulted to national prominence when it was revealed to be a key inspiration for Oklahoma City bombing conspirator Timothy McVeigh, who killed 168 people using a truck bomb strikingly similar to one described in detail in the book. Since then, The Turner Diaries has inspired hate crimes and terrorism across the United States and in Europe in more than a dozen separate plots through the present day.\n\nBut beyond the violence committed by its readers, The Turner Diaries was also the seed of significant shift in white-nationalist ideology and recruitment, the effects of which are increasingly relevant today. In “The Turner Legacy,” a new paper for ICCT – The Hague, I examine the complicated history of racist dystopian propaganda and the reasons for Turner’s enduring impact.\n\nWhite nationalism was the law of the land in the United States through most of the country’s history. In the wake of the Civil War, institutionalized white supremacy began to erode, a process that accelerated into the 20th Century. Against the backdrop of the civil rights movement, white nationalism began to develop complex ideologies, with a number of different strains emerging.\n\nPedestrian racism—simply disliking or discriminating against people based on race—still played a significant role in society, but as mainstream white nationalism became increasingly stigmatized, these ideological variants became subcultures in which violent extremism could fester.\n\nThe most important movements to emerge from this dynamic were neo-Nazism and Christian Identity. Neo-Nazism is heavily focused on Holocaust denial and symbolic identity markers, while Christian Identity is based on an elaborate religious justification that evolved out of a 19th century religious conspiracy theory called British Israelism, which claimed Anglo-Saxons were the lost tribe of Israel. Both movements trafficked heavily in anti-Semitism, but their animus was directed to all non-white people.\n\nThese movements, along with the Ku Klux Klan, became the face of white nationalism, resulting in further marginalization due to their flamboyant racism and increasing scrutiny from law enforcement, as their views and rhetoric became increasingly extreme.\n\nIt was within this context that William Luther Pierce split from the American Nazi Party and founded the National Alliance. Pierce, an atheist and scientist, was attuned to the fact that these ostentatious forms of white nationalism were deeply alienating to “normal people,” attracting recruits he described as “defective” and “crippled.” The National Alliance downplayed swastikas and goose-stepping, and instead focused on creating propaganda capable of sidestepping mainstream media gatekeepers appealing to broader audiences.\n\nThe Turner Diaries was one of his earliest efforts, and undoubtedly the most successful. Serialized in a National Alliance newsletter, and later published in collected form, The Turner Diaries is a dystopian novel about a United States where non-white minorities have disarmed and oppressed white Americans, leading to an armed white nationalist revolution. In sparse, simplistic prose, the apocalyptic plot follows a white supremacist guerrilla resistance movement known as The Order as it launches a series of terrorist attacks, eventually blossoming into a full-blown insurgency. The Order wins in the end, and embarks on a campaign of global genocides against non-whites.\n\nThe Turner Diaries is notable for its lack of ideological persuasion. At one point in the novel, its protagonist, Earl Turner, is given a book to read. Turner claims the book perfectly explains the reasons for white supremacy and the justification of all of The Order’s actions. Importantly, this magical tome’s contents are never specified. Although the novel’s epilogue broadly hints at a Nazi orientation, the book never explicitly identifies The Order with a specific movement.\n\nDue in part to Pierce’s desire to appeal to “normal” people, as well as the novel’s limited initial circulation among neo-Nazis, Turner assumes its readers are already racist and do not need to be recruited to that mindset. The abandonment of “why” empowers a singular narrative focus on “what” and “how”—the necessity of immediate, violent action and concrete suggestions about how to go about it. This is part of why the book has so often been associated with violence and terrorism.\n\nBut as the book’s notoriety grew, it had another effect on the white nationalist movement. The Turner Diaries is a Rorschach test for racists of all stripes, pedestrian or ideological. Readers can bring their own ideologies and justifications to the narrative, or they can bring none at all.\n\nOver the course of time, this universalist approach to white supremacy became the dominant trend for the movement in the United States and Europe. Rather than attempting to market the elaborate mythology and scriptural footnotes of Christian Identity, or the stigmatized pageantry of Hitler and the Nazis, prominent white nationalists began to take a more carefully generic approach, playing on racial fear and resentment as they existed, rather than attempting to manufacture doctrinaire justifications.\n\nIt began with The Order, a real-life terrorist cell that was directly based on the organization described in The Turner Diaries. In a yearlong spree starting in 1983, The Order killed three people and stole millions of dollars, much of which was then distributed to white nationalist leaders and never recovered. Members of the group referred to Turner as their “bible.”\n\nOne member of The Order, David Lane, became a prolific writer in prison after authorities broke up the gang in 1984. Although he wrote a number of lengthy ideological tracts, one of his most important works was the three-page “White Genocide Manifesto,” which took Pierce’s dislike for complex ideological formulations to new heights, instead arguing from a platform of “Nature's laws, common sense and current circumstances.” The manifesto argues that “’racial integration’ is only a euphemism for genocide,” and that the “white race” is on the verge of extinction due to interbreeding with other races.\n\nLane later distilled his views further into a one-sentence statement now known as the 14 Words and widely quoted by white nationalists: “We must secure the existence of our people and a future for white children.” Lane died in prison in 2007.\n\nHis simplified formulation avoided the alienating and stigmatized imagery of neo-Nazism and the elaborate Biblical convolutions of Christian Identity, allowing the highly factionalized white nationalist movement to coalesce around a theme on which they could all agree – an existential threat to the “white race.”\n\nThe manifesto itself was soon reduced to the simple phrase “white genocide,” which proliferated at the start of the 21st century and has become the overwhelmingly dominant meme of modern white nationalism. The theme was promoted by white nationalist Robert Whitaker, who added what he called “the mantra”—“Anti-racist is a code word for anti-white.” These two phrases were deliberately repeated and spread widely online, among white nationalists of various ideological persuasions.\n\nWhite nationalist Richard B. Spencer moved the bar even further with the latest iteration of white identity politics, creating the “Alternative Right” website in 2010, the seed of the broader movement is now known as the alt right. Even more amorphous than its predecessors, the alt right includes a variety of anti-social attitudes, including racism, misogyny and religious bigotry, offering many points of entry for new adherents who are frustrated with some aspect of society or politics. Many who identify with the alt right continue to promote the white genocide theme.\n\nWhile it would be a mistake to credit The Turner Diaries for the entirety of this transition in white nationalism, the novel demonstrated how to successfully leverage racial fears and resentments in the service of violence, without a call to a specific ideology, and the book remains widely influential today.\n\nWhile Turner is rightly infamous for the violence it has inspired, most notably in Oklahoma City, its impact on the shape of white nationalism—and the movement’s current resurgence—is an equal part of its dark legacy."}]}