{"Martina Sorbara has written and produced music for commercials, including for Coca-Cola, Microsoft, and McDonald's.": [{"url": "https://www.thestar.com/life/together/people/2021/01/17/at-home-with-chef-cory-vitiello-dragonette-singer-martina-sorbara-and-their-adorable-toddler-barlow.html", "page_content": "What’s life in lockdown with a two-year-old like? “The greatest!” says Martina Sorbara. “We’re really fortunate,” says her partner, chef Cory Vitiello, of life at home with Barlow, who turned two in September. “We just have so much time during this critical stage to spend with him and watch him grow and enjoy every step.”\n\nThe couple’s busy schedules usually mean that they’re anywhere but at their home, which is between High Park and Roncesvalles Village. All that changed with the lockdown in March 2020, when Dragonette, Sorbara’s indie-pop project, was put on hold, and Vitiello, founder of elevated-takeout-rotisserie-chicken joint Flock Rotisserie + Greens, faced a wave of heartbreaking April cancellations, including Biblio Bash, the Toronto Public Library fundraiser with his catering partner 10Tation, and his annual fundraising dinner for children’s cancer charity Camp Ooch at Cactus Club Café, where he is head of culinary development for Toronto.\n\nBut the silver lining has been the extra time at home with their son. Right now, Barlow is learning to talk (“He calls me ‘hon’ and ‘babe,’” Sorbara says with a laugh), and he graduated early from potty training, which the couple initiated once they realized that their normally packed schedules had dramatically freed up.\n\nIt’s created plenty of time for lazy Sundays. “We’ve made Sundays about us,” says Vitiello. “That’s why it’s so special. We lock ourselves in, do our crosswords and cook.” On a typical weekend, the family will get up early and go for a stroll through High Park or Roncesvalles Village. They’re regulars at the Roncy café Reunion Island, sometimes scooping up a legendary breakfast sandwich from the Gold Standard takeout window. “They treat Barlow like a VIP,” says Vitiello.\n\nVitiello, a chef since he was 15, spent most Sundays during the first two decades of his 25-year career working hectic shifts in kitchens. After closing his acclaimed Harbord Room restaurant in 2016, his life changed. Now, in contrast to the harried pace of a restaurant kitchen, Vitiello savours the slower speed of cooking at home. He starts the day by picking up fresh ingredients from local merchants, such as fish market Hooked or Roncesvalles produce stand Ko Fruit Market.\n\nThough veggies and fish are usually the core ingredients of his mains, a high-quality cut of meat constitutes a special Sunday treat. Braised meats, especially short ribs, have been a favourite comfort food over the winter. While Sorbara is a pescatarian, Vitiello says he has “no problem spending the whole Sunday cooking this braise that could feed 15 people, even though there is only one person in the house who eats it.” Thankfully, it’s not hard to find some outside assistance. “I usually take some to the neighbours [as a] surprise,” he says.\n\nSorbara is a whiz in the kitchen, too, whipping up pastries to satisfy Vitiello’s sweet tooth. She’s happiest, however, spending a cosy Sunday working away on a crossword, a pastime Vitiello has picked up as well, along with his Sudoku habit.\n\nSorbara is a veteran puzzle master — she enjoys making crosswords as birthday gifts for her father, York University chancellor Gregory Sorbara. A highlight of her 2020 was receiving a thoughtful rejection from the New York Times for a crossword she’d submitted that had the theme of shape-shifting. “I’m going to submit another one, and I have high hopes!” she says.\n\nTo carve out time for themselves, they take turns putting Barlow down for his nap and to bed at night. “And our glory time is when we finally get him down to bed and we have our evening to ourselves,” says Vitiello.\n\nThat’s when the strategy board games come out. Their current favourite is A Few Acres of Snow, an out-of-print two-player game from 2011 based on the struggle between the French and the British to occupy Canada. Sorbara learned the game from her cousin, a board-game collector. “It’s hilariously nerdy,” she says. Vitiello also juggles three ongoing poker groups on Zoom: a game with friends, a game with fellow chefs and a game with “the old-timers, Martina’s father and his friends.”\n\nBut the highlight remains watching their baby boy grow. “In the past year, I think we have seen three different versions of him and had to say goodbye to some really sweet versions only to [witness the] birth [of] the next incarnation of who this child is,” says Vitiello. “It’s been so special to see that growth together.”\n\nRead more about:\n\nSHARE:"}, {"url": "https://www.celebsagewiki.com/martina-sorbara", "page_content": "Age, Biography and Wiki\n\nMartina Sorbara was born on 13 November, 1978 in Toronto, Canada, is a Canadian singer-songwriter. Discover Martina Sorbara's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is She in this year and how She spends money? Also learn how She earned most of networth at the age of 44 years old?\n\nPopular As N/A Occupation N/A Age 44 years old Zodiac Sign Scorpio Born 13 November 1978 Birthday 13 November Birthplace Toronto, Canada Nationality Canada\n\nWe recommend you to check the complete list of Famous People born on 13 November. She is a member of famous Songwriter with the age 44 years old group.\n\nMartina Sorbara Height, Weight & Measurements\n\nAt 44 years old, Martina Sorbara height not available right now. We will update Martina Sorbara's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is Martina Sorbara's Husband?\n\nHer husband is Dan Kurtz\n\nFamily Parents Not Available Husband Dan Kurtz Sibling Not Available Children Not Available\n\nMartina Sorbara Net Worth\n\nHer net worth has been growing significantly in 2022-2023. So, how much is Martina Sorbara worth at the age of 44 years old? Martina Sorbara’s income source is mostly from being a successful Songwriter. She is from Canada. We have estimated Martina Sorbara's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Songwriter\n\nMartina Sorbara Social Network\n\nInstagram Linkedin Twitter Facebook Martina Sorbara Facebook Wikipedia Martina Sorbara Wikipedia Imdb\n\nTimeline"}, {"url": "https://www.allmusic.com/artist/martina-sorbara-mn0000312515", "page_content": "Martina Sorbara Follow Artist +\n\nCanada has long been known for raising amazing female singer-songwriters. All the way from Joni Mitchell, k.d. lang, and Sarah McLachlan, to Alanis Morissette and Jann Arden, and now comes Martina Sorbara.…\n\nRead Full Biography"}, {"url": "https://www.famousfix.com/list/songs-written-by-martina-sorbara", "page_content": "Take It Like A Man Song by Dragonette\n\n0 0\n\nrank #4 ·\n\n\"Take It Like A Man\" is a song by Canadian electronic group Dragonette, from their debut studio album, Galore (2007). The track was released as the second single from the album. The single received only minor success, even though it was released on so many formats. It peaked at #112 in the UK Singles chart."}, {"url": "https://sweetslyrics.com/martina-sorbara/biography", "page_content": "When you pick up Martina Sorbara's April 9th release, 'The Cure For Bad Deeds', and you hear the elements of jazz, folk, pop and rock on the album, you really shouldn't be too surprised by the musical variety heard there. After all, we're talking about a multi-talented artist who takes the time to make her own guitars and her own clothes, as well as her own music, which is her primary focus.\n\nMartina has very quickly gained the attention and admiration of many involved in the Canadian music industry. The 'Cure...,' produced by Jian Ghomeshi (of the successful Toronto group, Moxy Fruvous), is a fresh musical adventure ranging from the dark and beat-driven 'Bonnie & Clyde II' to the effervescent pop of 'Claudia' to the touching folk ballad of 'Cherry Rd.'.\n\nAs Martina's popularity continues to grow while performing regular dates in Canada and the United States, her album is one of those musical gems you want to treat like a secret. It's so good that part of you wants to keep it to yourself, and part of you wants to tell the world.\n\nMost artists aspire to have talents that make them special--a quality about them that forces an audience to take notice. And some artists are special without ever trying to be. Martina Sorbara is such an artist. When one first catches a glimpse of Martina singing on stage it is only the beginning of the connection between the artist and the fan. Aside from her natural, intense beauty and effervescent personality, her voice is angelic with an amazing range, and her passion obvious and proud. Her wise and poetic lyrics are enveloped in an expressive and original style.\n\nAlthough some would find it difficult to categorize the young Torontonian's music, Martina is becoming more comfortable calling it pop. \"It took me a while to accept that I write pop music. That's what it is though. Well, maybe jazzy-rocky folk-pop,\" she states with a smile.\n\nPerforming on stage with only the accompaniment of a drummer, Martina plays both piano and guitar, switching from one instrument to the next throughout her set.\n\nAfter her vocals, the piano is her primary instrument. She is a self-taught guitarist with a captivating and highly original style. Her interest in the guitar began at age 11. At 15 she began writing her own music and performing it for others. She has already played at numerous festivals, including SXSW in Austin, Texas, The Edmonton Folk Festival, and has opened for such acts as Sarah Harmer, The Be Good Tanyas, Hawksley Workman and Bill Bragg.\n\nAs a songwriter, she says, \"I feel very satisfied with myself, and my songs, when a listener tells me they understand exactly what I mean. Ideally, I want people to just enjoy the melody and relate to my sentiments.\"\n\nOne of the many outstanding talents that Martina possesses, and that she remains very modest about, is the construction of her own guitars. \"Building my own guitars has given me an intimate relationship with my instrument. I don't know if it sounds better than other guitars, but I sure love it more than other guitars.\" She also enjoys spending her time sketching and focusing on visual art. \"I consider art as important to me as my music.\"\n\nMartina's music appeals to all ages and genders. Perhaps the fact that Martina is influenced by a wide range of artists, from Sarah Vaughan to John Prine to Cyndi Lauper, explains the diverse array of listeners. Her hero, in musical terms, is Tom Waits. \"Tom Waits has been on the top of my 'hero-list' for a long time as a result of his unparalleled individualism.\"\n\nMartina's passion for life is evident and infectious. The songs on \"The Cure For Bad Deeds\" clearly illustrate that passion.\n\nSource: http://www.martinasorbara.com/martina.html"}, {"url": "https://nowtoronto.com/news/martina-sorbara/", "page_content": "MARTINA SORBARA with SID SIX at Ted’s Wrecking Yard (549 College), Monday (December 18), $7. 928-5012. Rating: NNNNN\n\nmartina sorbara’s wildly colour-ful, whimsically decorated loft in downtown Toronto is a bit like Pee- wee’s Playhouse. There’s the orange drum kit and two pianos. There are two guitars crafted from scratch by Sorbara herself, each bearing intricate designs matching tattoos on her neck and right hip.\n\nAdd a vintage mint-green Singer her grandma gave her, her sketches, photography and clothing ­– yes, also created by Sorbara ­– and you get the sense that this is an artist with uncommon range.\n\nBut at the moment, it’s the rainy-day pop on her charmingly understated second disc, The Cure For Bad Deeds, that’s generating attention. And that’s because Sorbara ­– when teamed with percussionist sidekick Adam Hay ­– holds a funny sway over people.\n\nA recent Rivoli showcase, stuffed to brimming with habitually blabby agents, publicists, record company reps and other industry types, was a marvel of good behaviour. Sorbara, moving between guitar and keyboard, silenced the room and kept it silenced until the end.\n\nSorbara’s upper-register voice, even when breezily relaying everyday scenarios, carries the pathos of a torch singer six bourbons into her night.\n\nYet the 22-year-old insists, “I don’t know where that sadness comes from, because I have such a satisfying career and life. I don’t mean to write sad songs. They just seem to come out that way.”\n\nSigning a record deal, then endlessly touring and promoting herself ­– the obvious next step ­– isn’t a notion Sorbara is entirely comfortable with.\n\nSinger sewing machines and Sorbara’s much-loved fuchsia couch (where visitors to her pad must sit for a photograph while wearing a matching pink coat) don’t travel well in the back of a U-haul.\n\n“When I’m on the road, I just think about going home,” she laughs. “But then as soon as I get home, I want to play for more people.\n\n“I have this faith that everything I’m doing, whether it’s sewing or making a lamp, feeds the songwriting, even if it just provides a form of meditation,” Sorbara says, curling up in her kitchen chair.\n\n“My dream is to be able to support myself doing something I love. That way I can continue to do other things that won’t bring in money, like guitar-making,” which she says she does not so much to achieve a unique sound but because she grooves on sculpting mahogany.\n\nThanks to her progressive parents, Sorbara has been immersed in music and art literally forever. She, her twin brother and four other siblings attended the Waldorf alternative school in Thornhill from kindergarten on. “It’s not the most well-rounded school,” she says, “but I would definitely send a kid of mine there. What they teach is what I consider most important ­– art.”\n\nHer launch into professional music happened coincidentally enough. According to Sorbara, her dad ­– an MPP with no connections to the music world but a passing acquaintance through his political office with TV hosts Paula Todd and Steve Paikin ­– asked for their recommendation of someone “not too weaselly” in the business to forward an early demo tape to. The Studio 2 hosts suggested Sony A&R senior VP Mike Roth.\n\n“Around three or four years ago, I met with Mike Roth and he said he liked my stuff and mentioned a development deal, but nothing ever happened,” Sorbara says.\n\n“The first time I saw Martina perform,” Roth recalls, “she played guitar like Bruce Cockburn, sang like Kate Bush and then she told me she had built the guitar she was playing. I was, like, “Oh, my god.’\n\n“But she wasn’t sure if she wanted to be a musician. She was going to spend a year in Europe, and so my attitude was “Whenever you’re ready, I’m here.'”\n\n“In the wake of that,” Sorbara continues, “I made Unplaceables (her now-unavailable debut) just to have something on hand and to get a sense of what’s involved in making records. It was very low-key, just me and my guitar and piano.”\n\nFollowing the development deal, signed in 98, Sorbara, at Sony’s request, paired with several producers ­– Philosopher King Jon Levine, Matt DeMatteo and Dave Martin ­– to lay down demos. Sorbara recalls the experience as enlightening, saying she especially enjoyed the sessions cut with DeMatteo, which included a cover of Madonna’s Like A Virgin.\n\n“I learned that the stuff I write can go in a million different places,” Sorbara says. But both Roth and Sorbara agree the results weren’t electrifying. Roth says a Sony-Sorbara pact “might still develop. I’m keeping close tabs on what she’s doing.” Sorbara says maybe, maybe not.\n\nSorbara’s fast track might have paused there had it not been for the 99 Blue Skies Folk Festival just outside Kingston, which both Sorbara and Moxy Früvous singer/percussionist Jian Ghomeshi were playing. At that moment, Sorbara was ready to get serious with another record while Ghomeshi, already a veteran performer, was looking to explore other areas of the business.\n\n“The thing that’s unique about my relationship with Martina,” says Ghomeshi, who also manages the singer, “is that before it became more formal, we had a chance to interact as performers, so it was very organic. And even though I was interested in getting into other sides of the business, it had to be a labour of love to keep me interested.”\n\nGhomeshi’s impact has been two-fold. As a producer, he focused on Sorbara’s vocal performance while keeping effects to a minimum in order to showcase her guitar and piano playing. “I knew he wouldn’t take my music to some big production level I wasn’t comfortable with,” Sorbara confirms. “That was my fear with Sony, that I’d just take this big jump and there would be no logical progression that anyone could see.”\n\nAnd as a manager, Ghomeshi has provided Sorbara with a realistic portrait of how the business functions and a point of entry into the local scene.\n\nArtists such as Andy Stochansky, Danny Michel and Maury LaFoy, ex-posed to Sorbara through Ghomeshi’s considerable cheerleading, have helped by teaming up for gigs or guesting on the album. All the songs on Cure For Bad Deeds, however, were authored by Sorbara alone. Which makes people’s response really matter to her.\n\n“One of the most meaningful compliments I ever got came from a man who used to visit the cafe I used to work at, the Little York on King East, every morning. My CD was for sale there, and one day I pointed it out to him. He said, “OK, I’ll buy it’ ­– you know, sort of to support the little coffee-house chick.\n\n“Shortly after that, I got an e-mail from him that said something like, “I thought I was doing you a favour by buying your CD, but in fact it was you who did me the favour.'”MARTINA SORBARA with SID SIX at Ted’s Wrecking Yard (549 College), Monday (December 18), $7. 928-5012."}, {"url": "https://alchetron.com/Martina-Sorbara", "page_content": "Martina Sorbara (born November 13, 1978) is a Canadian singer-songwriter and frontwoman of the band Dragonette. She is also the daughter of Greg Sorbara, a former Member of Provincial Parliament and Minister of Finance in Ontario. Martina is a graduate of the Toronto Waldorf School in Thornhill.\n\nContents\n\nHer debut album, Unplaceables, was released independently in 1998 and is no longer in print.\n\nSorbara's second album, The Cure for Bad Deeds, was released independently in 2000. An expanded version of the album appeared on MapleMusic Recordings in 2002. Both versions of the album were produced by Jian Ghomeshi. Martina's only single from the album was Bonnie & Clyde II, which also had a music video that got airplay on MuchMoreMusic, as well as making an appearance on the Women & Songs compilations. The song also appeared in the film, All I Want, starring Elijah Wood and Franka Potente.\n\nSorbara recorded a version of the Christmas song, It's the Most Wonderful Time of the Year, for the 2003 Nettwerk compilation album, Maybe This Christmas Too?. That same year, she was featured on the soundtrack to Uptown Girls singing the song Spinning Around the Sun. She can also be heard on the From the Girls compilations issued by Nettwerk that contained a new recording of a song called Withered on the Vine.\n\nSince 2005 she has served as the frontwoman of the Canadian new wave/electropop band, Dragonette.\n\nSorbara co-wrote and sang on the 2006 Basement Jaxx single, \"Take Me Back to Your House\". She also appeared in the video for the song. She was credited as Martina Bang.\n\nIn 2009, Sorbara was featured on The Henrys album Is This Tomorrow singing on the track \"Chair by the Window\". She is also featured in Kaskade's song \"Fire in Your New Shoes\".\n\nIn 2010, Sorbara performed the vocals in Martin Solveig's songs \"Hello\", \"Boys & Girls\" and \"Big in Japan\". She is also featured in Kaskade's song \"Fire in Your New Shoes\" which was released digitally on April 13, 2010. In November 2010 she was featured in the song \"Animale\", which was the result of a collaboration between Dutch DJ and producer Don Diablo and Sorbara's band Dragonette.\n\nMartina sorbara bonnie and clyde ii\n\n"}, {"url": "https://www.allmusic.com/artist/martina-sorbara-mn0000312515/discography", "page_content": "Discography Martina Sorbara Follow Artist +\n\nCanada has long been known for raising amazing female singer-songwriters. All the way from Joni Mitchell, k.d. lang, and Sarah McLachlan, to Alanis Morissette and Jann Arden, and now comes Martina Sorbara.…\n\nRead Full Biography"}, {"url": "https://www.allmusic.com/artist/martina-sorbara-mn0000312515/songs", "page_content": "Song Highlights Martina Sorbara Follow Artist +\n\nCanada has long been known for raising amazing female singer-songwriters. All the way from Joni Mitchell, k.d. lang, and Sarah McLachlan, to Alanis Morissette and Jann Arden, and now comes Martina Sorbara.…\n\nRead Full Biography"}, {"url": "https://www.zimbio.com/Martina+Sorbara", "page_content": "Overview\n\nCheck out featured articles and pictures of Martina Sorbara the owner and promoter of Dragonette, she is also the lead singer for their album, 'The World Is Not Enough'. The band's first release was recorded in 1995 and released in 1999. Dragonette had initially had one of their members as its manager, Tony Turek, who later resigned in 2004... more Check out featured articles and pictures of Martina Sorbara the owner and promoter of Dragonette, she is also the lead singer for their album, 'The World Is Not Enough'. The band's first release was recorded in 1995 and released in 1999.\n\n\n\n\n\nDragonette had initially had one of their members as its manager, Tony Turek, who later resigned in 2004 due to the popularity of the album that it produced. During the first months of their reign, the band recorded six... Born: ( 1978-11-13) November 13, 1978 (age 41)\n\nOrigin: Vaughan, Ontario, Canada\n\nGenres: Electropop\n\nOccupation(s): Singer-songwriter\n\nInstruments: Vocals\n\nAssociated acts: Dragonette, Martin Solveig, Basement Jaxx This content is based on data from multiple web sources. If you see any errors, please contact us.\n\nCheck out featured articles and pictures of Martina Sorbara the owner and promoter of Dragonette, she is also the lead singer for their album, 'The World Is Not Enough'. The band's first release was recorded in 1995 and released in 1999.\n\n\n\n\n\nDragonette had initially had one of their members as its manager, Tony Turek, who later resigned in 2004 due to the popularity of the album that it produced. During the first months of their reign, the band recorded six...\n\nBorn: ( 1978-11-13) November 13, 1978 (age 41)\n\nOrigin: Vaughan, Ontario, Canada\n\nGenres: Electropop\n\nOccupation(s): Singer-songwriter\n\nInstruments: Vocals\n\nAssociated acts: Dragonette, Martin Solveig, Basement Jaxx\n\nThis content is based on data from multiple web sources. If you see any errors, please contact us."}]}