{"Martina Sorbara has also studied at the Royal Conservatory of Music.": [{"url": "https://www.thestar.com/entertainment/music/2022/11/15/toronto-songstress-martina-sorbara-and-the-return-of-dragonette.html", "page_content": "Martina Sorbara quips that every interview she’s done in support of Dragonette’s long-gestating new album, “Twennies,” turns out to be “a little bit therapy.”\n\nThis makes perfect sense, since the very act of making the record was something of a therapeutic process for the Toronto electro-pop songstress. During the six years since Dragonette’s last recording, 2016’s “Royal Blues,” Sorbara experienced the final dissolution of the original creative partnership at the heart of Dragonette, the start of a new romantic relationship and the subsequent birth of her first child followed by the further life-disrupting chaos of the COVID-19 pandemic, all the while wrestling with what form her musical career would take in the future.\n\nAll this upheaval audibly informs what might just be Dragonette’s finest album yet, a mature, three-dimensional pop offering that grapples with the simultaneous terror and thrilling potential of Big Change before confidently accepting that sometimes Big Change is the only way forward.\n\n“Dragonette was on the gurney,” admitted Sorbara over a post-rehearsal pint at her local microbrewery in the Roncesvalles neighbourhood. “I was just, like, ‘I’m gonna go make some music and we’ll defibrillate you if we need you. I’m gonna go make this record and we’ll see what it is and then maybe we’ll take you off life support.’ And then I was, like, ‘No, no. I have to.’ Because now Dragonette feels like mine.”\n\nIt seems odd that Sorbara, 43, would be nervous about carrying Dragonette — which she formed with her ex-husband, Dan Kurtz, 15 years ago — ahead as a solo act since she began performing and recording as a solo act when she was just 16.\n\nBut once she and Kurtz decided, after making “Royal Blues” together six years ago despite their recent separation, to part ways creatively, as well, it took her some time to claim the name and the legacy of Dragonette as her own. And also to realize that she was now in a position to do whatever she wanted with it.\n\n“I wasn’t going to wrap up shop. I was doing well just floating around the world writing with other people, doing collaborations,” she said. “I’d started writing for other artists, and I love collaborating and I love writing and I love releasing music. It was just the idea of having to put something that’s just mine behind my name and being the only person in the picture.”\n\nA series of encounters with potential label suitors didn’t help her disenchantment, as A&R professionals offered Sorbara — whose done just fine penning top-shelf pop fodder in the past with the likes of Martin Solveig and Kaskade, as well as for other artists such as Carly Rae Jepsen and Keith Urban — guidance towards the future in the form of radio-ready playlists that really didn’t sit comfortably with her.\n\n“I don’t want to diss what’s on the radio but it just was, like, ‘If I’m supposed to try to get on the radio, I don’t want to make music anymore,’” she recalled. “It’s not like ‘Music used to be better and now it sucks.’ I just don’t want to make that. It’s not that it’s bad. It’s just not for me. Maybe I aged out of it. I don’t know.\n\n“It wasn’t even like it was bad music. It was just, like, ‘No, I can’t do that.’ My soul just reacted in a way where I thought ‘If that’s what I’m supposed to do, maybe I’m not a band anymore because I don’t want to do that.’”\n\nA fortunate encounter with producer Dan Farber, who’s worked with Lizzo and Dizzee Rascal in the past, during a “random” writing trip to Los Angeles proved to be the catalyst for “Twennies” — even if it took Sorbara some time to wake up to that fact.\n\nOne of the first tunes the two wrote together was the sweet, bossa nova-tinged ballad “This Is All You Get,” yet at the time of its creation Sorbara deemed it a bad fit for Dragonette. Yet as time moved on, it dawned on her that now that Dragonette was just her, Dragonette could sound like whatever the hell she wanted Dragonette to sound like. She could even re-embrace her “inner Ani DiFranco” and take the music in directions that hearken back to her formative years as a folk singer/songwriter. Farber was a willing co-conspirator.\n\n“He’s so amazing. I’ve worked with so many people over the last 10 years when I started just walking in with strangers or whatever,” she said, “but I’ve never made a musical connection where all of a sudden you’re speaking a creative language with such easy flow and there’s no weird judginess and I’m not going to censor anything and that was how it was from the very beginning. We wrote that song and I was, like, ‘Too bad it’s not Dragonette.’ But with time and space and feeling like I could do whatever I want, it went from being ‘I can do whatever I want. This has to be a Dragonette record and this is how I make this thing mine.’ It was a thing I had to do to own the past 15 years of my life.”\n\nWith “Twennies” thrown out to the world at large on Oct. 28, Dragonette returns to a Toronto stage on Thursday at the Axis Club. It’s one of only a handful of gigs she’s done since the last record, but the first — a trip to the Planet Pride celebrations in Brooklyn last summer which she almost cancelled at the last minute — gave her inner confirmation that she was capable of claiming Dragonette as her own.\n\nAfter performing the worldwide smash “Hello,” a 2010 collaboration with DJ/producer Solveig that was back on the Billboard charts this year thanks to its inclusion in the TV series “Ted Lasso,” before the Planet Pride crowd Sorbara wandered around and heard “Hello,” her Kaskade cut “Fire In Your New Shoes” and her Galantis co-write “Peanut Butter Jelly” being spun to delirious crowds by other DJs. It was a welcome boost of confidence.\n\n“I wrote all these songs but I’d never in my life allowed myself to feel that,” she said. “It was like something happening outside of me and I couldn’t take ownership of it and, for some reason, I don’t know if it’s because now Dragonette is me and it’s mine I feel myself more holistically in this thing and I’m like ‘Wow, I did all those things.’ And those songs are living on. ‘Hello’ was on the top of the f---ing Billboard charts this year. That’s a f---ing classic.”\n\n“My point is not tooting my own horn or saying ‘Look at all this sh--- I did,’ but for the past 10 years I never took ownership of it. I just flew down there by myself. I had no entourage. I was a floater. And then I got up onstage and I sang for the first performance and something about the aloneness of me there, I think, made me realize all of a sudden ‘Oh, I had to do this.’ I woke up to my autonomy and my ownership of all this stuff and then I kept hearing my songs and all of a sudden I owned them and I was me.”\n\nSHARE:"}, {"url": "https://www.thestar.com/life/together/people/2021/01/17/at-home-with-chef-cory-vitiello-dragonette-singer-martina-sorbara-and-their-adorable-toddler-barlow.html", "page_content": "What’s life in lockdown with a two-year-old like? “The greatest!” says Martina Sorbara. “We’re really fortunate,” says her partner, chef Cory Vitiello, of life at home with Barlow, who turned two in September. “We just have so much time during this critical stage to spend with him and watch him grow and enjoy every step.”\n\nThe couple’s busy schedules usually mean that they’re anywhere but at their home, which is between High Park and Roncesvalles Village. All that changed with the lockdown in March 2020, when Dragonette, Sorbara’s indie-pop project, was put on hold, and Vitiello, founder of elevated-takeout-rotisserie-chicken joint Flock Rotisserie + Greens, faced a wave of heartbreaking April cancellations, including Biblio Bash, the Toronto Public Library fundraiser with his catering partner 10Tation, and his annual fundraising dinner for children’s cancer charity Camp Ooch at Cactus Club Café, where he is head of culinary development for Toronto.\n\nBut the silver lining has been the extra time at home with their son. Right now, Barlow is learning to talk (“He calls me ‘hon’ and ‘babe,’” Sorbara says with a laugh), and he graduated early from potty training, which the couple initiated once they realized that their normally packed schedules had dramatically freed up.\n\nIt’s created plenty of time for lazy Sundays. “We’ve made Sundays about us,” says Vitiello. “That’s why it’s so special. We lock ourselves in, do our crosswords and cook.” On a typical weekend, the family will get up early and go for a stroll through High Park or Roncesvalles Village. They’re regulars at the Roncy café Reunion Island, sometimes scooping up a legendary breakfast sandwich from the Gold Standard takeout window. “They treat Barlow like a VIP,” says Vitiello.\n\nVitiello, a chef since he was 15, spent most Sundays during the first two decades of his 25-year career working hectic shifts in kitchens. After closing his acclaimed Harbord Room restaurant in 2016, his life changed. Now, in contrast to the harried pace of a restaurant kitchen, Vitiello savours the slower speed of cooking at home. He starts the day by picking up fresh ingredients from local merchants, such as fish market Hooked or Roncesvalles produce stand Ko Fruit Market.\n\nThough veggies and fish are usually the core ingredients of his mains, a high-quality cut of meat constitutes a special Sunday treat. Braised meats, especially short ribs, have been a favourite comfort food over the winter. While Sorbara is a pescatarian, Vitiello says he has “no problem spending the whole Sunday cooking this braise that could feed 15 people, even though there is only one person in the house who eats it.” Thankfully, it’s not hard to find some outside assistance. “I usually take some to the neighbours [as a] surprise,” he says.\n\nSorbara is a whiz in the kitchen, too, whipping up pastries to satisfy Vitiello’s sweet tooth. She’s happiest, however, spending a cosy Sunday working away on a crossword, a pastime Vitiello has picked up as well, along with his Sudoku habit.\n\nSorbara is a veteran puzzle master — she enjoys making crosswords as birthday gifts for her father, York University chancellor Gregory Sorbara. A highlight of her 2020 was receiving a thoughtful rejection from the New York Times for a crossword she’d submitted that had the theme of shape-shifting. “I’m going to submit another one, and I have high hopes!” she says.\n\nTo carve out time for themselves, they take turns putting Barlow down for his nap and to bed at night. “And our glory time is when we finally get him down to bed and we have our evening to ourselves,” says Vitiello.\n\nThat’s when the strategy board games come out. Their current favourite is A Few Acres of Snow, an out-of-print two-player game from 2011 based on the struggle between the French and the British to occupy Canada. Sorbara learned the game from her cousin, a board-game collector. “It’s hilariously nerdy,” she says. Vitiello also juggles three ongoing poker groups on Zoom: a game with friends, a game with fellow chefs and a game with “the old-timers, Martina’s father and his friends.”\n\nBut the highlight remains watching their baby boy grow. “In the past year, I think we have seen three different versions of him and had to say goodbye to some really sweet versions only to [witness the] birth [of] the next incarnation of who this child is,” says Vitiello. “It’s been so special to see that growth together.”\n\nRead more about:\n\nSHARE:"}, {"url": "https://www.theglobeandmail.com/life/article-dragonette-martina-sorbara/", "page_content": "When electro-pop group Dragonette landed on the music scene in 2007 with their debut disc, Galore, Canadian radio was busy taking the charts hostage with unstylish, postgrunge burnout bands (think Our Lady Peace and Finger Eleven). Fortunately, Martina Sorbara, Dragonette’s frontwoman, lyricist and creative director, came along. She changed the EDM-challenged and glamour-deficient musical landscape of CanCon for the better.\n\nDragonette – which went from a trio to a solo act, owing to Sorbara’s divorce with the band’s former bassist – reframed Canadian music culture as a chic hub that went beyond the plaid-plagued, Sk8er Boi aesthetic of the time. Sorbara’s slick video concepts (think Björk meets BTS), highly danceable choruses (Cyndi Lauper once dubbed Dragonette, “the future of pop”) and forward-fashion sense (which prompted a collab with designer Jean Paul Gaultier) presented the world with a fresh example of Canada’s musical DNA – one that integrated dance, soul, visual art and fashion.\n\nOn the cusp of Dragonette’s fifth album, Twennies, and the album release party at the Axis Club in Toronto on Nov. 16, the Italian-Canadian talent dishes on motherhood, her new-found creative control and making art in the digital age.\n\nWhat is motivating you most while fronting Dragonette alone postdivorce?\n\nI’m realizing how much I have to offer and all the self-worth that comes with that. I had an eye-opening experience with a big producer – who I won’t name. I was in the studio with him and he couldn’t play chords to a certain song, he just wasn’t getting it. I had so much patience for him fumbling around. In the old days, I wouldn’t dream of showing a guy how to play something but at a certain point, I asked, “Can I try?” and played the chords easily. I realized that for some reason, I had to dim myself in the past because I was presuming knowledge that isn’t even there – presuming he knows better than me. I realize that this experience with the producer was just PTSD. Now, I’m just taking ownership and not being the host for any parasites any more.\n\nThis album possesses nostalgia for a time with no social media. Why is this theme important to you?\n\nWell, the digital onslaught happening right now does make you nostalgic, doesn’t it? Remember a night out with no photos and just a flip phone? Think of the hours of your life unaccounted for because you’re just looking at your phone. Not having your mind think in a digital way is kind of a relief too. The angle that we’re looking at things [with] is warped – our experience is constantly shifting into that question: “Is this social media? Or real life?” I feel like we’re constantly flipping from our brain eyes to our screen eyes.\n\nDragonette’s album covers and videos look like they were born for Instagram and TikTok. Does the vast number of references you see now cultivate or confuse your vision?\n\nYou can have your mind blown away multiple times a day online but sometimes, you have to realize that your mind doesn’t actually get blown away because you’re just desensitized to the amount of colour and action you see on screen. Artists have this double-edged sword with social media because there’s just so much of it and it’s hard to put it in any kind of mental Rolodex and think, oh this is so inspiring! A certain aesthetic on Instagram and TikTok might be hard to get excited about because once it’s out there you feel like it’s already been done.\n\nWhich pieces of art in your own collection fuel you?\n\nA piece of work from [Toronto-based artist duo] the Broadbent Sisters. I found out about it because I worked with their brother, [artist] Justin Broadbent, for album cover art and he had a photo of their work on his computer. The image is a rainbow staircase decorated with all these flowers around it. I’m also obsessed [Mallorca-based] artist Louise Despont – who uses ink and pencil on repurposed ledger paper – I have a piece that looks very tribal. I also have a portrait of a cat by [London-based] artist Christopher Page.\n\nAside from creating songs, you also make art. What mediums have you been in to lately?\n\nI’m working toward having my own exhibit. I’m working on drawings and sculptures. I have a series of faces with numbers on them. It’s almost like hidden faces and expressions. I have line drawings – one is of a disco ball and I’m doing these big pen drawings that are taking more than 12 hours to finish. I’m also making ceramic necklaces and before the pandemic I made a piggy bank shaped like a vagina.\n\nYou grew up in what you called a hippie commune in British Columbia and made guitars with your hands. Are you doing DIY craft lessons with your son?\n\nI’m so obsessed with making things. It’s my whole reason of living. I try to do crafts with my kid but I also don’t want to force him enjoy the same things that I enjoy, but I would love it if he was an obsessive maker too. I’m still learning about how to be a mom. In terms of inhabiting the music-making persona of Dragonette – having a baby was also not clear to me. I didn’t understand. I felt like my body cleaved into two different people.\n\nHaving [Chef] Corey Vitello as a partner must come with perks. What are the best dishes he’s made you so far?\n\nWe had morels growing in our garden and I picked them and made him make me just a very simple morel pasta – that felt very special because they are so hard to find. He was developing a dish of miso, trout with asparagus and enoki mushrooms that was beautiful. He’s finishing his cookbook soon so a lot of the food we eat is in that. This spring at our house he was doing food shoots downstairs and I was in the studio making music, so it was intense.\n\nYou have a slew of fashion-inspired songs like Fire In Your New Shoes, Big Sunglasses, New Suit and T-Shirt. Where do you like to shop?\n\nVSP Consignment. I like treasure hunting because it’s so hard to shop for new clothes. When I see five of the same outfit on a sales rack, it’s a real turn-off – that’s why I buy vintage. I wasn’t watching Beverly Hills, 90210, Sex and the City or reading Cosmo and getting socialized to be obsessed with the shoe and the purse or any accessories when I was growing up, so that affects the way I do things. I have such a different relationship with fashion. I have a lot of fun putting together quirky, unique outfits but I’m not looking at trends."}, {"url": "https://www.celebsagewiki.com/martina-sorbara", "page_content": "Age, Biography and Wiki\n\nMartina Sorbara was born on 13 November, 1978 in Toronto, Canada, is a Canadian singer-songwriter. Discover Martina Sorbara's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is She in this year and how She spends money? Also learn how She earned most of networth at the age of 44 years old?\n\nPopular As N/A Occupation N/A Age 44 years old Zodiac Sign Scorpio Born 13 November 1978 Birthday 13 November Birthplace Toronto, Canada Nationality Canada\n\nWe recommend you to check the complete list of Famous People born on 13 November. She is a member of famous Songwriter with the age 44 years old group.\n\nMartina Sorbara Height, Weight & Measurements\n\nAt 44 years old, Martina Sorbara height not available right now. We will update Martina Sorbara's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is Martina Sorbara's Husband?\n\nHer husband is Dan Kurtz\n\nFamily Parents Not Available Husband Dan Kurtz Sibling Not Available Children Not Available\n\nMartina Sorbara Net Worth\n\nHer net worth has been growing significantly in 2022-2023. So, how much is Martina Sorbara worth at the age of 44 years old? Martina Sorbara’s income source is mostly from being a successful Songwriter. She is from Canada. We have estimated Martina Sorbara's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Songwriter\n\nMartina Sorbara Social Network\n\nInstagram Linkedin Twitter Facebook Martina Sorbara Facebook Wikipedia Martina Sorbara Wikipedia Imdb\n\nTimeline"}, {"url": "https://nowtoronto.com/news/martina-sorbara/", "page_content": "MARTINA SORBARA with SID SIX at Ted’s Wrecking Yard (549 College), Monday (December 18), $7. 928-5012. Rating: NNNNN\n\nmartina sorbara’s wildly colour-ful, whimsically decorated loft in downtown Toronto is a bit like Pee- wee’s Playhouse. There’s the orange drum kit and two pianos. There are two guitars crafted from scratch by Sorbara herself, each bearing intricate designs matching tattoos on her neck and right hip.\n\nAdd a vintage mint-green Singer her grandma gave her, her sketches, photography and clothing ­– yes, also created by Sorbara ­– and you get the sense that this is an artist with uncommon range.\n\nBut at the moment, it’s the rainy-day pop on her charmingly understated second disc, The Cure For Bad Deeds, that’s generating attention. And that’s because Sorbara ­– when teamed with percussionist sidekick Adam Hay ­– holds a funny sway over people.\n\nA recent Rivoli showcase, stuffed to brimming with habitually blabby agents, publicists, record company reps and other industry types, was a marvel of good behaviour. Sorbara, moving between guitar and keyboard, silenced the room and kept it silenced until the end.\n\nSorbara’s upper-register voice, even when breezily relaying everyday scenarios, carries the pathos of a torch singer six bourbons into her night.\n\nYet the 22-year-old insists, “I don’t know where that sadness comes from, because I have such a satisfying career and life. I don’t mean to write sad songs. They just seem to come out that way.”\n\nSigning a record deal, then endlessly touring and promoting herself ­– the obvious next step ­– isn’t a notion Sorbara is entirely comfortable with.\n\nSinger sewing machines and Sorbara’s much-loved fuchsia couch (where visitors to her pad must sit for a photograph while wearing a matching pink coat) don’t travel well in the back of a U-haul.\n\n“When I’m on the road, I just think about going home,” she laughs. “But then as soon as I get home, I want to play for more people.\n\n“I have this faith that everything I’m doing, whether it’s sewing or making a lamp, feeds the songwriting, even if it just provides a form of meditation,” Sorbara says, curling up in her kitchen chair.\n\n“My dream is to be able to support myself doing something I love. That way I can continue to do other things that won’t bring in money, like guitar-making,” which she says she does not so much to achieve a unique sound but because she grooves on sculpting mahogany.\n\nThanks to her progressive parents, Sorbara has been immersed in music and art literally forever. She, her twin brother and four other siblings attended the Waldorf alternative school in Thornhill from kindergarten on. “It’s not the most well-rounded school,” she says, “but I would definitely send a kid of mine there. What they teach is what I consider most important ­– art.”\n\nHer launch into professional music happened coincidentally enough. According to Sorbara, her dad ­– an MPP with no connections to the music world but a passing acquaintance through his political office with TV hosts Paula Todd and Steve Paikin ­– asked for their recommendation of someone “not too weaselly” in the business to forward an early demo tape to. The Studio 2 hosts suggested Sony A&R senior VP Mike Roth.\n\n“Around three or four years ago, I met with Mike Roth and he said he liked my stuff and mentioned a development deal, but nothing ever happened,” Sorbara says.\n\n“The first time I saw Martina perform,” Roth recalls, “she played guitar like Bruce Cockburn, sang like Kate Bush and then she told me she had built the guitar she was playing. I was, like, “Oh, my god.’\n\n“But she wasn’t sure if she wanted to be a musician. She was going to spend a year in Europe, and so my attitude was “Whenever you’re ready, I’m here.'”\n\n“In the wake of that,” Sorbara continues, “I made Unplaceables (her now-unavailable debut) just to have something on hand and to get a sense of what’s involved in making records. It was very low-key, just me and my guitar and piano.”\n\nFollowing the development deal, signed in 98, Sorbara, at Sony’s request, paired with several producers ­– Philosopher King Jon Levine, Matt DeMatteo and Dave Martin ­– to lay down demos. Sorbara recalls the experience as enlightening, saying she especially enjoyed the sessions cut with DeMatteo, which included a cover of Madonna’s Like A Virgin.\n\n“I learned that the stuff I write can go in a million different places,” Sorbara says. But both Roth and Sorbara agree the results weren’t electrifying. Roth says a Sony-Sorbara pact “might still develop. I’m keeping close tabs on what she’s doing.” Sorbara says maybe, maybe not.\n\nSorbara’s fast track might have paused there had it not been for the 99 Blue Skies Folk Festival just outside Kingston, which both Sorbara and Moxy Früvous singer/percussionist Jian Ghomeshi were playing. At that moment, Sorbara was ready to get serious with another record while Ghomeshi, already a veteran performer, was looking to explore other areas of the business.\n\n“The thing that’s unique about my relationship with Martina,” says Ghomeshi, who also manages the singer, “is that before it became more formal, we had a chance to interact as performers, so it was very organic. And even though I was interested in getting into other sides of the business, it had to be a labour of love to keep me interested.”\n\nGhomeshi’s impact has been two-fold. As a producer, he focused on Sorbara’s vocal performance while keeping effects to a minimum in order to showcase her guitar and piano playing. “I knew he wouldn’t take my music to some big production level I wasn’t comfortable with,” Sorbara confirms. “That was my fear with Sony, that I’d just take this big jump and there would be no logical progression that anyone could see.”\n\nAnd as a manager, Ghomeshi has provided Sorbara with a realistic portrait of how the business functions and a point of entry into the local scene.\n\nArtists such as Andy Stochansky, Danny Michel and Maury LaFoy, ex-posed to Sorbara through Ghomeshi’s considerable cheerleading, have helped by teaming up for gigs or guesting on the album. All the songs on Cure For Bad Deeds, however, were authored by Sorbara alone. Which makes people’s response really matter to her.\n\n“One of the most meaningful compliments I ever got came from a man who used to visit the cafe I used to work at, the Little York on King East, every morning. My CD was for sale there, and one day I pointed it out to him. He said, “OK, I’ll buy it’ ­– you know, sort of to support the little coffee-house chick.\n\n“Shortly after that, I got an e-mail from him that said something like, “I thought I was doing you a favour by buying your CD, but in fact it was you who did me the favour.'”MARTINA SORBARA with SID SIX at Ted’s Wrecking Yard (549 College), Monday (December 18), $7. 928-5012."}, {"url": "https://www.rcmusic.com/about-us/news/the-royal-conservatory-of-music-re-names-school-in", "page_content": "The Royal Conservatory of Music Renames School in Honour of Alumnus Oscar Peterson\n\nPublished on September 9, 2021\n\n\n\nThe Royal Conservatory of Music (RCM) is proud to announce that the Royal Conservatory School – its community school – has been renamed the Oscar Peterson School of Music in honour of the legendary jazz pianist, and beloved alumnus and Honorary Fellow of The Royal Conservatory.\n\n\n\nDr. Peterson, widely regarded as one of the foremost jazz pianists of his generation, started his music training using the curriculum of the RCM Certificate Program, known for its internationally acclaimed standard of music education and achievement, and credited his classical music training as foundational to his success. He also asked his students to learn Bach, particularly The Well-Tempered Clavier and The Goldberg Variations, among others, as he considered these to be essential learning for pianists.\n\n\n\nDr. Peter Simon, The Royal Conservatory’s President & CEO stated: “It is The RCM’s immense pleasure to honour Oscar Peterson, one of the greatest pianists of the 20th century, by naming our school after him.”\n\n\n\n“I had the privilege of meeting and speaking with Oscar several times – we discussed his early training and how he developed his extraordinary command of the keyboard. He studied initially with his sister, Daisy, using the curriculum of The RCM to learn pieces and theory. He subsequently studied with Paul de Marky – a pianist whose teacher had studied with Franz Liszt and thus was able to pass along the virtuoso piano techniques that Liszt developed. Oscar believed that a classical grounding was essential for any musician and from this base, one could go anywhere.”\n\n\n\nOn behalf of the Peterson family, Ms. Kelly Peterson said: “The renaming of the Royal Conservatory School would have humbled Oscar tremendously – and he would have been thrilled. It was Oscar’s belief that music education is extremely important for every single person, regardless of whether they intend to pursue a career in music or not, and that his classical music training gave him his technical foundation.”\n\n\n\nThe RCM will also launch the Oscar Peterson Program, a scholarship program offering tuition-free music instruction to underserved youth, in the fall of 2022. Details will be announced early next year.\n\n\n\nIn an CBC Radio interview about establishing Toronto’s Advanced School of Contemporary Music in the 1960s, Dr. Peterson was asked about the importance of a classical grounding and how it laid the foundation for a wide range of genres and styles. He stated that classical training is “quite definitely essential for any musician … these are theories and practices we employ in the development of students”.\n\n\n\nThis is the second time that The Royal Conservatory has named one of its schools after an RCM alumnus. In 1997, The Royal Conservatory of Music Professional School was renamed The Glenn Gould School."}, {"url": "https://www.rcmusic.com/ggs/home", "page_content": "Faculty\n\nWorld-Renowned Performing Artists John O’Conor, piano\n\nOur acclaimed faculty of performing artists all share a deep commitment to developing supportive, mentoring relationships with their students. Each year, up to 50 guest artists—some of the world’s foremost musicians—lead more than 125 master classes for GGS students."}, {"url": "https://www.rcmusic.com/learning/examinations", "page_content": "MyRCM is where you can register for exams, see your marks, and manage your digital downloads and courses\n\nDates and deadlines for both practical and theory examinations, as well as details regarding theory examination timing.\n\nRegister for in-person exams, when available, or remote exams for practical and theory. For the best registration experience, please use Chrome as your browser.\n\nLearn more about how the RCM Certificate Program is now conducting exams remotely in addition to in-person\n\nGet more information about RCM Certificate Program requirements.\n\nYour questions, our answers\n\nTips and resources on technology and materials available for online learning"}, {"url": "https://www.britannica.com/art/conservatory-musical-institution", "page_content": "conservatory, in music, institution for education in musical performance and composition. The term and institution derive from the Italian conservatorio, which in the Renaissance period and earlier denoted a type of orphanage often attached to a hospital (hence the term ospedale also applied to such institutions). The foundlings (conservati) were given musical instruction at state expense; Naples was the centre for boys and Venice for girls. The conservatori were thus the first secular institutions equipped for training in practical music (the choir schools of the Middle Ages were attached to churches, and music in medieval universities was a theoretical subject comparable to mathematics). Institutions such as the Ospedale della Pietà (founded 1346, Venice) and the Conservatorio dei Poveri di Gesù Cristo (founded 1589, Naples) either trained or had as faculty members most of the leading composers of 17th- and 18th-century Italian opera.\n\nThe first secular school of music for students at large was established in Paris. Founded in 1784, it was reorganized and renamed the Conservatoire National de Musique et d’Art Dramatique in 1795 by the National Convention (the Revolutionary regime of 1792–95) as a result of the efforts of the bandmaster Bernard Sarrette. Its chief purpose was to train musicians to participate in public concerts, fêtes, and celebrations organized by the republic. A state subsidy was granted, admission was by competitive examination, and tuition was free. Later the curriculum was enlarged to include all branches of composition, instrumental and vocal technique, and acting (enabling students to train for the various Parisian opera houses and theatres). Eventually the institution’s political aim was abandoned. Although many famous pupils later revolted against the Conservatoire’s academic severities, it became the acknowledged centre of musical practice and erudition. It was renamed the Conservatoire National Supérieur de Musique in 1957.\n\nThroughout the 19th century the French model was copied, with modifications, in Europe and in the U.S. Conservatories were founded in Milan (1807), Naples (1808), Prague (1811; the first such institution in central Europe), and Vienna (the Akademie, founded in 1817 by the Gesellschaft der Musikfreunde [Society of Friends of Music]). The composers Felix Mendelssohn and Robert Schumann founded the Leipzig Conservatory (now called the Staatliche Hochschule für Musik) in 1843. Not all of the German schools, however, followed the principles of the Conservatoire nor did all similar institutions in Great Britain, of which the most notable were the Royal Academy of Music (1822; royal charter, 1830) and the Royal College of Music (first called the National Training-School of Music; founded 1882, royal charter 1883). The Royal Irish Academy of Music was founded in 1848 and the Royal Scottish Academy of Music and Drama in 1890.\n\nSuch institutions began to appear in the United States in the 1860s. Two of the first were those at Oberlin, Ohio (1865), and the Peabody Conservatory of Music, Baltimore, founded 1857 (first classes held in 1868). The New England Conservatory of Music and the Boston Conservatory of Music (both in Boston) followed in 1867 and the National Conservatory of Music in New York City in 1885. Other important institutions of music in the United States are the Eastman School of Music at Rochester, N.Y. (1919), and the Curtis Institute of Music, Philadelphia (1924). The Institute of Musical Art (1905) and the Juilliard Graduate School (1924) were united in 1926 to form the Juilliard School of Music, in New York City; this institution became the Juilliard School in 1968. Canadian conservatories include that at Toronto (1886). Australia has the Adelaide Conservatorium (1898)."}, {"url": "https://www.rcmusic.com/bios/george-thurgood", "page_content": "George Thurgood\n\nARCT (The Royal Conservatory); Bachelor of Music, Master of Music, Bachelor of Arts, and PhD candidate (University of Toronto)\n\nGeorge Thurgood studied composition and arranging at the Berklee College of Music. He also studied with Reginald Godden, Antonin Kubalek, Derek Holman, and Talivaldis Kenins. A composer, church organist, and founding member of the new-music organization Continuum, George has been active for many years as a pianist in jazz and popular music. His teaching spans piano, theory, and music history at the University of Toronto. A member of the American Federation of Music and the Society of Composers, Authors and Music Publishers of Canada, George is Chair of The Royal Conservatory’s theory department. He has been a faculty member since 1990.\n\nYou can reach Professor Thurgood through e-mail at: [email protected]"}]}