{"Martina Sorbara has written and produced music for film and television.": [{"url": "https://www.thestar.com/entertainment/music/2022/11/15/toronto-songstress-martina-sorbara-and-the-return-of-dragonette.html", "page_content": "Martina Sorbara quips that every interview she’s done in support of Dragonette’s long-gestating new album, “Twennies,” turns out to be “a little bit therapy.”\n\nThis makes perfect sense, since the very act of making the record was something of a therapeutic process for the Toronto electro-pop songstress. During the six years since Dragonette’s last recording, 2016’s “Royal Blues,” Sorbara experienced the final dissolution of the original creative partnership at the heart of Dragonette, the start of a new romantic relationship and the subsequent birth of her first child followed by the further life-disrupting chaos of the COVID-19 pandemic, all the while wrestling with what form her musical career would take in the future.\n\nAll this upheaval audibly informs what might just be Dragonette’s finest album yet, a mature, three-dimensional pop offering that grapples with the simultaneous terror and thrilling potential of Big Change before confidently accepting that sometimes Big Change is the only way forward.\n\n“Dragonette was on the gurney,” admitted Sorbara over a post-rehearsal pint at her local microbrewery in the Roncesvalles neighbourhood. “I was just, like, ‘I’m gonna go make some music and we’ll defibrillate you if we need you. I’m gonna go make this record and we’ll see what it is and then maybe we’ll take you off life support.’ And then I was, like, ‘No, no. I have to.’ Because now Dragonette feels like mine.”\n\nIt seems odd that Sorbara, 43, would be nervous about carrying Dragonette — which she formed with her ex-husband, Dan Kurtz, 15 years ago — ahead as a solo act since she began performing and recording as a solo act when she was just 16.\n\nBut once she and Kurtz decided, after making “Royal Blues” together six years ago despite their recent separation, to part ways creatively, as well, it took her some time to claim the name and the legacy of Dragonette as her own. And also to realize that she was now in a position to do whatever she wanted with it.\n\n“I wasn’t going to wrap up shop. I was doing well just floating around the world writing with other people, doing collaborations,” she said. “I’d started writing for other artists, and I love collaborating and I love writing and I love releasing music. It was just the idea of having to put something that’s just mine behind my name and being the only person in the picture.”\n\nA series of encounters with potential label suitors didn’t help her disenchantment, as A&R professionals offered Sorbara — whose done just fine penning top-shelf pop fodder in the past with the likes of Martin Solveig and Kaskade, as well as for other artists such as Carly Rae Jepsen and Keith Urban — guidance towards the future in the form of radio-ready playlists that really didn’t sit comfortably with her.\n\n“I don’t want to diss what’s on the radio but it just was, like, ‘If I’m supposed to try to get on the radio, I don’t want to make music anymore,’” she recalled. “It’s not like ‘Music used to be better and now it sucks.’ I just don’t want to make that. It’s not that it’s bad. It’s just not for me. Maybe I aged out of it. I don’t know.\n\n“It wasn’t even like it was bad music. It was just, like, ‘No, I can’t do that.’ My soul just reacted in a way where I thought ‘If that’s what I’m supposed to do, maybe I’m not a band anymore because I don’t want to do that.’”\n\nA fortunate encounter with producer Dan Farber, who’s worked with Lizzo and Dizzee Rascal in the past, during a “random” writing trip to Los Angeles proved to be the catalyst for “Twennies” — even if it took Sorbara some time to wake up to that fact.\n\nOne of the first tunes the two wrote together was the sweet, bossa nova-tinged ballad “This Is All You Get,” yet at the time of its creation Sorbara deemed it a bad fit for Dragonette. Yet as time moved on, it dawned on her that now that Dragonette was just her, Dragonette could sound like whatever the hell she wanted Dragonette to sound like. She could even re-embrace her “inner Ani DiFranco” and take the music in directions that hearken back to her formative years as a folk singer/songwriter. Farber was a willing co-conspirator.\n\n“He’s so amazing. I’ve worked with so many people over the last 10 years when I started just walking in with strangers or whatever,” she said, “but I’ve never made a musical connection where all of a sudden you’re speaking a creative language with such easy flow and there’s no weird judginess and I’m not going to censor anything and that was how it was from the very beginning. We wrote that song and I was, like, ‘Too bad it’s not Dragonette.’ But with time and space and feeling like I could do whatever I want, it went from being ‘I can do whatever I want. This has to be a Dragonette record and this is how I make this thing mine.’ It was a thing I had to do to own the past 15 years of my life.”\n\nWith “Twennies” thrown out to the world at large on Oct. 28, Dragonette returns to a Toronto stage on Thursday at the Axis Club. It’s one of only a handful of gigs she’s done since the last record, but the first — a trip to the Planet Pride celebrations in Brooklyn last summer which she almost cancelled at the last minute — gave her inner confirmation that she was capable of claiming Dragonette as her own.\n\nAfter performing the worldwide smash “Hello,” a 2010 collaboration with DJ/producer Solveig that was back on the Billboard charts this year thanks to its inclusion in the TV series “Ted Lasso,” before the Planet Pride crowd Sorbara wandered around and heard “Hello,” her Kaskade cut “Fire In Your New Shoes” and her Galantis co-write “Peanut Butter Jelly” being spun to delirious crowds by other DJs. It was a welcome boost of confidence.\n\n“I wrote all these songs but I’d never in my life allowed myself to feel that,” she said. “It was like something happening outside of me and I couldn’t take ownership of it and, for some reason, I don’t know if it’s because now Dragonette is me and it’s mine I feel myself more holistically in this thing and I’m like ‘Wow, I did all those things.’ And those songs are living on. ‘Hello’ was on the top of the f---ing Billboard charts this year. That’s a f---ing classic.”\n\n“My point is not tooting my own horn or saying ‘Look at all this sh--- I did,’ but for the past 10 years I never took ownership of it. I just flew down there by myself. I had no entourage. I was a floater. And then I got up onstage and I sang for the first performance and something about the aloneness of me there, I think, made me realize all of a sudden ‘Oh, I had to do this.’ I woke up to my autonomy and my ownership of all this stuff and then I kept hearing my songs and all of a sudden I owned them and I was me.”\n\nSHARE:"}, {"url": "https://www.celebsagewiki.com/martina-sorbara", "page_content": "Age, Biography and Wiki\n\nMartina Sorbara was born on 13 November, 1978 in Toronto, Canada, is a Canadian singer-songwriter. Discover Martina Sorbara's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is She in this year and how She spends money? Also learn how She earned most of networth at the age of 44 years old?\n\nPopular As N/A Occupation N/A Age 44 years old Zodiac Sign Scorpio Born 13 November 1978 Birthday 13 November Birthplace Toronto, Canada Nationality Canada\n\nWe recommend you to check the complete list of Famous People born on 13 November. She is a member of famous Songwriter with the age 44 years old group.\n\nMartina Sorbara Height, Weight & Measurements\n\nAt 44 years old, Martina Sorbara height not available right now. We will update Martina Sorbara's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is Martina Sorbara's Husband?\n\nHer husband is Dan Kurtz\n\nFamily Parents Not Available Husband Dan Kurtz Sibling Not Available Children Not Available\n\nMartina Sorbara Net Worth\n\nHer net worth has been growing significantly in 2022-2023. So, how much is Martina Sorbara worth at the age of 44 years old? Martina Sorbara’s income source is mostly from being a successful Songwriter. She is from Canada. We have estimated Martina Sorbara's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Songwriter\n\nMartina Sorbara Social Network\n\nInstagram Linkedin Twitter Facebook Martina Sorbara Facebook Wikipedia Martina Sorbara Wikipedia Imdb\n\nTimeline"}, {"url": "https://www.allmusic.com/artist/martina-sorbara-mn0000312515", "page_content": "Martina Sorbara Follow Artist +\n\nCanada has long been known for raising amazing female singer-songwriters. All the way from Joni Mitchell, k.d. lang, and Sarah McLachlan, to Alanis Morissette and Jann Arden, and now comes Martina Sorbara.…\n\nRead Full Biography"}, {"url": "https://www.famousfix.com/list/songs-written-by-martina-sorbara", "page_content": "Take It Like A Man Song by Dragonette\n\n0 0\n\nrank #4 ·\n\n\"Take It Like A Man\" is a song by Canadian electronic group Dragonette, from their debut studio album, Galore (2007). The track was released as the second single from the album. The single received only minor success, even though it was released on so many formats. It peaked at #112 in the UK Singles chart."}, {"url": "https://macleans.ca/culture/its-all-about-them/", "page_content": "Pop history suggests that husband and wife singer-songwriter teams tend to have far from enviable relationships. While they were amusing to watch, there was about as much sexual chemistry between Sonny and Cher as a Saturday morning cartoon. Arcade Fire’s main vocalists, the married Win Butler and Régine Chassagne, have made extraordinary indie rock in their two-disc career, but when they sing together you imagine their social life to be as much fun as a Chekhov novel. For every romantic June Carter and Johnny Cash, there are love stories à la Ike and Tina Turner and Courtney Love and Kurt Cobain with enough issues to make musicians swear off dating one another for good.\n\nMartina Sorbara and Dan Kurtz of the Canadian electropop group Dragonette, on the other hand, are lucky enough to have the type of passionate bond that translates well from real life to on-record. Ever since their first album, Galore, was released by Universal Music Canada in 2007, the happily married twosome has been giving fans a peek into their relationship, war wounds and all, via their music. Their debut album’s vampy first single, I Get Around, may extol the glories of a one-night stand but it was their successful second and third singles Take It Like A Man and Competition from Galore that really put a magnifying glass to Kurtz’s and Sorbara’s private life. It’s a formula that has made Björk a supporter of the band, moved Kanye West to blog about them and prompted Cyndi Lauper, who has written and recorded with the pair, to crown Dragonette “the future of pop music.”\n\nFor those who haven’t yet caught up with the group or haven’t a clue about their history, two things may come as a surprise. 1) Martina, 30, is the daughter of Greg Sorbara, former minister of finance for Ontario and a current Liberal MPP for the province, and 2) Galore was named one of the best albums of the year in 2007 by the fickle pop music website, Popjustice, which helped the band get a Juno nomination the following year.\n\nSitting in the rooftop bar at Toronto’s Park Hyatt hotel on an evening in June, the day after West devoted a post to them on his website, Sorbara and Kurtz attempt to explain themselves. “We’re definitely not the same group that we were when we opened up for Scissor Sisters, New Order and Duran Duran [in 2005], ” Kurtz begins, eager to explain the thinking behind their upcoming sophomore album, Fixin To Thrill (to be released Sept. 29). Before Kurtz finishes his thought, though, he is interrupted by his wife, who blurts out, “What he means is we’re a lot tougher and more aggressive.” She throws her fist into his shoulder for effect.\n\n“I feel like Galore was the pretty album,” she continues, speaking in an endearingly high voice while locking eyes with Kurtz. “It was girly and feminine and sweet. For Fixin To Thrill, I’ve cut my hair really short, de-censored myself, stopped taking advice on how to write the quote-unquote universal pop song and now . . .” she breathes before finishing, “it sounds like a tomboy wearing high heels—it’s much more us.”\n\nThe “us” Sorbara is talking about is drummer Joel Stouffer and guitarist Chris Huggett as well as Kurtz, yet it’s easy to understand why the group is often mistaken for a duo. Watching Sorbara and Kurtz (who acts as the band’s leader and producer) flirt with each other on stage, argue passionately in interviews and then harmonize in the studio, the magnetism is powerful. Then there’s the frankness of personality-driven tracks such as True Believer (from Galore) and Stupid Grin (from Fixin To Thrill). It all explains why Dragonette sticks out in a sea of slick media-trained pop groups.\n\n“When you listen closely to our lyrics, you find out way too much about me and Martina,” says the 37-year-old Kurtz, who is known in the Canadian music scene as one of the founding members of acclaimed live electronic band the New Deal. Before forming Dragonette with Sorbara, Kurtz produced Feist’s first album, Monarch, and co-produced Sarah Slean’s bestselling disc to date, Day One. “I may have a bias as her husband, but out of all the women I’ve worked with, I believe she has the potential to reach the same type of success as Alanis or Sarah McLachlan—she has an innate, sometimes brutal sense of honesty.”\n\nThe pair weren’t on totally honest ground when they first met, at a music festival more than seven years ago. Kurtz was already in a long-term relationship with someone when he began an affair with Sorbara—then an acoustic-guitar-wielding folkster who made what she now refers to as “tampon music.” The result of their liaison was an ugly breakup, a fast marriage (“we were so in a rush to make it official,” says Kurtz), and a campy Sorbara-penned single called Competition with the lyrics: “Your girlfriend’s got competition / goodness I like this / being your mistress.”\n\n“Our new songs such as Pick Up The Phone and Stupid Grin are much more indicative of our [six-year] marriage,” Kurtz explains. “We like to think of our music as free couples’ therapy. It’s a time where you love and hate your partner at the same time so your feelings become more complicated. We make sure that all goes into our work.”\n\nSorbara says she sees a need for meaty pop songs that come from “real life rather than a team of hit producers.” In fact, when Sorbara is asked to remark on a recent comment posting on YouTube—“when I hear [Dragonette] play live, I feel like I am in a threesome with them”—she lights up. “That makes me feel good because I don’t write fiction, and I do think part of a good show is giving the crowd that kind of intensity and intimacy,” she says. “I prefer [listeners] to know about my life rather than backward, boring messages like Beyoncé’s Put A Ring On It. It’s a song I love to listen to but I hate the lyrics. I’m also really impressed by Lady Gaga, but I wish she had smarter lines than ‘I want to take a ride on your disco stick.’ ”\n\nComments like these can make Sorbara come off as the electro music scene’s answer to Camille Paglia. Her appearance—a cross between Joan of Arc and a young Isabella Rossellini—drives the message home loud and clear: Sorbara is fatigued by all the Pussycat Dolls-style pop on the charts and wants to do something about it. “Pop like that reminds me of movies like He’s Just Not That Into You and Sex and the City,” she says, “films where women are running around town like chickens with their heads cut off trying to get a man. I want to offer the antithesis to that.”\n\nOn Fixin To Thrill, Sorbara’s voice is anything but weak. “Thinking for myself / I’ll be the only one,” she sings in Easy, poking fun at the tired notion of the traditional pop diva. “I am a feminist and think women in pop music don’t all have to be these clean prima donna princesses or cheesy sexpots,” she offers. “I can be glamorous and still keep my armpit hair. As the art director and the stylist for Dragonette, I have to make sure our image is raw and means something, just like our music, or what’s the point?”\n\nA perfect example of Sorbara’s progressive point of view is reflected in one of Dragonette’s B-sides from Fixin To Thrill—a track called My Things that touches on her and Kurtz’s wicked sense of humour. The chorus includes the line “get your titties off my things.” It’s a song Sorbara says was written as a lighthearted warning. “It’s about all these groupies lusting over guys with guitars. I am playfully singing to all those girls offering their [breasts] to Dan when we are on tour. Believe me, I have seen a lot of those hussies!” she laughs. “It’s hardly scandalous compared to Shakira or Rihanna’s songs. I’m just taking ownership of my relationship.”\n\nWhen asked if her father has heard the song (an article in the Globe and Mail in 2007 reported he had implored Martina not to use the “T” word in interviews anymore), Sorbara shakes her head and offers up a theory. “At this point my parents have come to expect the unexpected with me. I hope he thinks the song is kind of smart because it’s so macho. I’m turning the tables here. It may not be his style of music but I think they’d both chuckle,” she says. “I mean, I grew up creating handmade guitars in a hippie community in the mountains in Winlaw, B.C., and on a farm outside of Toronto, so what do you expect?”\n\nSorbara’s fierce way of communicating seems to be getting attention. She’s currently working on a song for Leona Lewis’s new album, and was asked to collaborate on a track with Parisian dance DJ Martin Solveig for Jean Paul Gaultier’s newest fragrance Ma Dame. In the video for the dance track, Sorbara shares screen time with the legendary French designer, who had her styled in his latest fall/winter collection. “It made sense for us,” she says. “Gaultier’s aesthetic suits me. His view of women is very powerful and the opposite of demure.”\n\nAs for the pair’s future plans, Dragonette is “not looking for world domination,” Sorbara jokes. “I just want me and Dan to be able to continue to make pop music that’s subversive and tour the world together like we are still on a honeymoon.”"}, {"url": "https://www.allmusic.com/artist/martina-sorbara-mn0000312515/discography", "page_content": "Discography Martina Sorbara Follow Artist +\n\nCanada has long been known for raising amazing female singer-songwriters. All the way from Joni Mitchell, k.d. lang, and Sarah McLachlan, to Alanis Morissette and Jann Arden, and now comes Martina Sorbara.…\n\nRead Full Biography"}, {"url": "https://alchetron.com/Martina-Sorbara", "page_content": "Martina Sorbara (born November 13, 1978) is a Canadian singer-songwriter and frontwoman of the band Dragonette. She is also the daughter of Greg Sorbara, a former Member of Provincial Parliament and Minister of Finance in Ontario. Martina is a graduate of the Toronto Waldorf School in Thornhill.\n\nContents\n\nHer debut album, Unplaceables, was released independently in 1998 and is no longer in print.\n\nSorbara's second album, The Cure for Bad Deeds, was released independently in 2000. An expanded version of the album appeared on MapleMusic Recordings in 2002. Both versions of the album were produced by Jian Ghomeshi. Martina's only single from the album was Bonnie & Clyde II, which also had a music video that got airplay on MuchMoreMusic, as well as making an appearance on the Women & Songs compilations. The song also appeared in the film, All I Want, starring Elijah Wood and Franka Potente.\n\nSorbara recorded a version of the Christmas song, It's the Most Wonderful Time of the Year, for the 2003 Nettwerk compilation album, Maybe This Christmas Too?. That same year, she was featured on the soundtrack to Uptown Girls singing the song Spinning Around the Sun. She can also be heard on the From the Girls compilations issued by Nettwerk that contained a new recording of a song called Withered on the Vine.\n\nSince 2005 she has served as the frontwoman of the Canadian new wave/electropop band, Dragonette.\n\nSorbara co-wrote and sang on the 2006 Basement Jaxx single, \"Take Me Back to Your House\". She also appeared in the video for the song. She was credited as Martina Bang.\n\nIn 2009, Sorbara was featured on The Henrys album Is This Tomorrow singing on the track \"Chair by the Window\". She is also featured in Kaskade's song \"Fire in Your New Shoes\".\n\nIn 2010, Sorbara performed the vocals in Martin Solveig's songs \"Hello\", \"Boys & Girls\" and \"Big in Japan\". She is also featured in Kaskade's song \"Fire in Your New Shoes\" which was released digitally on April 13, 2010. In November 2010 she was featured in the song \"Animale\", which was the result of a collaboration between Dutch DJ and producer Don Diablo and Sorbara's band Dragonette.\n\nMartina sorbara bonnie and clyde ii\n\n"}, {"url": "https://www.thestar.com/life/together/people/2021/01/17/at-home-with-chef-cory-vitiello-dragonette-singer-martina-sorbara-and-their-adorable-toddler-barlow.html", "page_content": "What’s life in lockdown with a two-year-old like? “The greatest!” says Martina Sorbara. “We’re really fortunate,” says her partner, chef Cory Vitiello, of life at home with Barlow, who turned two in September. “We just have so much time during this critical stage to spend with him and watch him grow and enjoy every step.”\n\nThe couple’s busy schedules usually mean that they’re anywhere but at their home, which is between High Park and Roncesvalles Village. All that changed with the lockdown in March 2020, when Dragonette, Sorbara’s indie-pop project, was put on hold, and Vitiello, founder of elevated-takeout-rotisserie-chicken joint Flock Rotisserie + Greens, faced a wave of heartbreaking April cancellations, including Biblio Bash, the Toronto Public Library fundraiser with his catering partner 10Tation, and his annual fundraising dinner for children’s cancer charity Camp Ooch at Cactus Club Café, where he is head of culinary development for Toronto.\n\nBut the silver lining has been the extra time at home with their son. Right now, Barlow is learning to talk (“He calls me ‘hon’ and ‘babe,’” Sorbara says with a laugh), and he graduated early from potty training, which the couple initiated once they realized that their normally packed schedules had dramatically freed up.\n\nIt’s created plenty of time for lazy Sundays. “We’ve made Sundays about us,” says Vitiello. “That’s why it’s so special. We lock ourselves in, do our crosswords and cook.” On a typical weekend, the family will get up early and go for a stroll through High Park or Roncesvalles Village. They’re regulars at the Roncy café Reunion Island, sometimes scooping up a legendary breakfast sandwich from the Gold Standard takeout window. “They treat Barlow like a VIP,” says Vitiello.\n\nVitiello, a chef since he was 15, spent most Sundays during the first two decades of his 25-year career working hectic shifts in kitchens. After closing his acclaimed Harbord Room restaurant in 2016, his life changed. Now, in contrast to the harried pace of a restaurant kitchen, Vitiello savours the slower speed of cooking at home. He starts the day by picking up fresh ingredients from local merchants, such as fish market Hooked or Roncesvalles produce stand Ko Fruit Market.\n\nThough veggies and fish are usually the core ingredients of his mains, a high-quality cut of meat constitutes a special Sunday treat. Braised meats, especially short ribs, have been a favourite comfort food over the winter. While Sorbara is a pescatarian, Vitiello says he has “no problem spending the whole Sunday cooking this braise that could feed 15 people, even though there is only one person in the house who eats it.” Thankfully, it’s not hard to find some outside assistance. “I usually take some to the neighbours [as a] surprise,” he says.\n\nSorbara is a whiz in the kitchen, too, whipping up pastries to satisfy Vitiello’s sweet tooth. She’s happiest, however, spending a cosy Sunday working away on a crossword, a pastime Vitiello has picked up as well, along with his Sudoku habit.\n\nSorbara is a veteran puzzle master — she enjoys making crosswords as birthday gifts for her father, York University chancellor Gregory Sorbara. A highlight of her 2020 was receiving a thoughtful rejection from the New York Times for a crossword she’d submitted that had the theme of shape-shifting. “I’m going to submit another one, and I have high hopes!” she says.\n\nTo carve out time for themselves, they take turns putting Barlow down for his nap and to bed at night. “And our glory time is when we finally get him down to bed and we have our evening to ourselves,” says Vitiello.\n\nThat’s when the strategy board games come out. Their current favourite is A Few Acres of Snow, an out-of-print two-player game from 2011 based on the struggle between the French and the British to occupy Canada. Sorbara learned the game from her cousin, a board-game collector. “It’s hilariously nerdy,” she says. Vitiello also juggles three ongoing poker groups on Zoom: a game with friends, a game with fellow chefs and a game with “the old-timers, Martina’s father and his friends.”\n\nBut the highlight remains watching their baby boy grow. “In the past year, I think we have seen three different versions of him and had to say goodbye to some really sweet versions only to [witness the] birth [of] the next incarnation of who this child is,” says Vitiello. “It’s been so special to see that growth together.”\n\nRead more about:\n\nSHARE:"}, {"url": "https://www.theglobeandmail.com/life/article-dragonette-martina-sorbara/", "page_content": "When electro-pop group Dragonette landed on the music scene in 2007 with their debut disc, Galore, Canadian radio was busy taking the charts hostage with unstylish, postgrunge burnout bands (think Our Lady Peace and Finger Eleven). Fortunately, Martina Sorbara, Dragonette’s frontwoman, lyricist and creative director, came along. She changed the EDM-challenged and glamour-deficient musical landscape of CanCon for the better.\n\nDragonette – which went from a trio to a solo act, owing to Sorbara’s divorce with the band’s former bassist – reframed Canadian music culture as a chic hub that went beyond the plaid-plagued, Sk8er Boi aesthetic of the time. Sorbara’s slick video concepts (think Björk meets BTS), highly danceable choruses (Cyndi Lauper once dubbed Dragonette, “the future of pop”) and forward-fashion sense (which prompted a collab with designer Jean Paul Gaultier) presented the world with a fresh example of Canada’s musical DNA – one that integrated dance, soul, visual art and fashion.\n\nOn the cusp of Dragonette’s fifth album, Twennies, and the album release party at the Axis Club in Toronto on Nov. 16, the Italian-Canadian talent dishes on motherhood, her new-found creative control and making art in the digital age.\n\nWhat is motivating you most while fronting Dragonette alone postdivorce?\n\nI’m realizing how much I have to offer and all the self-worth that comes with that. I had an eye-opening experience with a big producer – who I won’t name. I was in the studio with him and he couldn’t play chords to a certain song, he just wasn’t getting it. I had so much patience for him fumbling around. In the old days, I wouldn’t dream of showing a guy how to play something but at a certain point, I asked, “Can I try?” and played the chords easily. I realized that for some reason, I had to dim myself in the past because I was presuming knowledge that isn’t even there – presuming he knows better than me. I realize that this experience with the producer was just PTSD. Now, I’m just taking ownership and not being the host for any parasites any more.\n\nThis album possesses nostalgia for a time with no social media. Why is this theme important to you?\n\nWell, the digital onslaught happening right now does make you nostalgic, doesn’t it? Remember a night out with no photos and just a flip phone? Think of the hours of your life unaccounted for because you’re just looking at your phone. Not having your mind think in a digital way is kind of a relief too. The angle that we’re looking at things [with] is warped – our experience is constantly shifting into that question: “Is this social media? Or real life?” I feel like we’re constantly flipping from our brain eyes to our screen eyes.\n\nDragonette’s album covers and videos look like they were born for Instagram and TikTok. Does the vast number of references you see now cultivate or confuse your vision?\n\nYou can have your mind blown away multiple times a day online but sometimes, you have to realize that your mind doesn’t actually get blown away because you’re just desensitized to the amount of colour and action you see on screen. Artists have this double-edged sword with social media because there’s just so much of it and it’s hard to put it in any kind of mental Rolodex and think, oh this is so inspiring! A certain aesthetic on Instagram and TikTok might be hard to get excited about because once it’s out there you feel like it’s already been done.\n\nWhich pieces of art in your own collection fuel you?\n\nA piece of work from [Toronto-based artist duo] the Broadbent Sisters. I found out about it because I worked with their brother, [artist] Justin Broadbent, for album cover art and he had a photo of their work on his computer. The image is a rainbow staircase decorated with all these flowers around it. I’m also obsessed [Mallorca-based] artist Louise Despont – who uses ink and pencil on repurposed ledger paper – I have a piece that looks very tribal. I also have a portrait of a cat by [London-based] artist Christopher Page.\n\nAside from creating songs, you also make art. What mediums have you been in to lately?\n\nI’m working toward having my own exhibit. I’m working on drawings and sculptures. I have a series of faces with numbers on them. It’s almost like hidden faces and expressions. I have line drawings – one is of a disco ball and I’m doing these big pen drawings that are taking more than 12 hours to finish. I’m also making ceramic necklaces and before the pandemic I made a piggy bank shaped like a vagina.\n\nYou grew up in what you called a hippie commune in British Columbia and made guitars with your hands. Are you doing DIY craft lessons with your son?\n\nI’m so obsessed with making things. It’s my whole reason of living. I try to do crafts with my kid but I also don’t want to force him enjoy the same things that I enjoy, but I would love it if he was an obsessive maker too. I’m still learning about how to be a mom. In terms of inhabiting the music-making persona of Dragonette – having a baby was also not clear to me. I didn’t understand. I felt like my body cleaved into two different people.\n\nHaving [Chef] Corey Vitello as a partner must come with perks. What are the best dishes he’s made you so far?\n\nWe had morels growing in our garden and I picked them and made him make me just a very simple morel pasta – that felt very special because they are so hard to find. He was developing a dish of miso, trout with asparagus and enoki mushrooms that was beautiful. He’s finishing his cookbook soon so a lot of the food we eat is in that. This spring at our house he was doing food shoots downstairs and I was in the studio making music, so it was intense.\n\nYou have a slew of fashion-inspired songs like Fire In Your New Shoes, Big Sunglasses, New Suit and T-Shirt. Where do you like to shop?\n\nVSP Consignment. I like treasure hunting because it’s so hard to shop for new clothes. When I see five of the same outfit on a sales rack, it’s a real turn-off – that’s why I buy vintage. I wasn’t watching Beverly Hills, 90210, Sex and the City or reading Cosmo and getting socialized to be obsessed with the shoe and the purse or any accessories when I was growing up, so that affects the way I do things. I have such a different relationship with fashion. I have a lot of fun putting together quirky, unique outfits but I’m not looking at trends."}, {"url": "https://www.celebsages.com/martina-sorbara/", "page_content": "Birth Name: Martina Sorbara Occupation: Rock Singer Born In: Ontario, Canada Birthdate: November 13, 1978 Age: 44 years old (as of 2023) Ethnicity: Unknown Nationality: Canadian Sexuality: N/A\n\nMartina Sorbara was born on the 13th of November, 1978. She is known for being a Rock Singer. She collaborated with DJ Don Diablo on the 2010 song Animale. Martina Sorbara’s age is 44. Canadian singer and songwriter who has been the lead singer for the band Dragonette. The 44-year-old rock singer was born in Ontario, Canada. She graduated from Toronto Waldorf School and released her debut album Unplaceables in 1998. Her song Spinning Around the Sun was featured on the soundtrack to the film Uptown Girls in 2003.\n\nCountdown to Martina’s next birthday.\n\nMartina Sorbara is a Scorpio and her 45th birthday is in .\n\nJUMP TO: Martina Sorbara’s biography , facts , family , personal life , zodiac , videos , net worth , and popularity .\n\nChildhood\n\nMartina Sorbara was born in 1970s. The 1970s were a \"pivot of change\", it was an era of economic struggle, cultural change, and technological innovation. The Seventies saw many women's rights, gay rights, and environmental movements. Discover what happened on this day.\n\nMartina Sorbara is part of the Baby boomers generation. Baby Boomer is the result of the end of World War II, when birth rates across the world spiked. They are associated with a rejection of traditional values. These hippie kids protested against the Vietnam War and participated in the civil rights movement.\n\nYou can also find out who is Martina Sorbara dating now and celebrity dating histories at CelebsCouples.\n\nIt's hard to know Martina Sorbara birth time, but we do know her mother gave birth to her on a Monday. People born on a Monday tend to be a bit sensitive and emotional. They have imagination and don't like planning things in advance. They're flexible and good at improvising.\n\n[fetch instagram=”” display=”posts” ]\n\nThe 44-year-old Canadian was born in the Generation X and the Year of the Horse\n\nEducation\n\nThe education details are not available at this time. Please check back soon for updates.\n\nFamily\n\nMartina Sorbara’s mother’s name is unknown at this time and her father’s name is under review. We will continue to update information on Martina Sorbara’s parents.\n\nPersonal Life\n\nLike many famous people and celebrities, Martina Sorbara keeps her personal life private. Once more details are available on who she is dating, we will update this section.\n\nFast Facts\n\nREAL NAME: Martina Sorbara NICKNAME: Martina\n\nMARTIAL STATUS: Pending RELIGION: Unknown TATTOOS: N/A AGE GENERATION: Generation X BIRTH SIGN: Scorpio BIRTH DAY: Monday DAYS SINCE BIRTH:\n\nNet Worth\n\nThe 44-year-old Canadian rock singer has done well thus far. Majority of Martina’s money comes from being a rock singer. CelebsMoney has recently updated Martina Sorbara’s net worth .\n\nVideos\n\nHoroscope\n\nZodiac Sign: Martina Sorbara is a Scorpio. People of this zodiac sign like truth, being right, longtime friends, teasing, and dislike dishonesty, revealing secrets, passive people. The strengths of this sign are being resourceful, brave, passionate, a true friend, while weaknesses can be distrusting, jealous, secretive and violent. The greatest overall compatibility with Scorpio is Taurus and Cancer.\n\nChinese Zodiac: Martina Sorbara was born in the Year of the Rabbit. People born under this sign are seen as warm-hearted and easygoing. Independence is one of their greatest strengths, but sometimes they're overly frank with others.\n\n\n\n\n\nRuling Planet: Martina Sorbara has a ruling planet of Pluto and has a ruling planet of Pluto. Back the early 2,000 B.C. the outer planets, Uranus and Neptune were not yet discovered, since the telescope had not yet been invented. Astrologers and astronomers could only work with planets visible to the eye.\n\n[fetch instagram=”” display=”posts” show=”2″ ]\n\nMartina Sorbara’s birth sign is Scorpio and she has a ruling planet of Pluto.\n\nDon’t miss\n\n– Who’s the richest Rock Singer in the world?\n\n– Martina Sorbara Net Worth Stats\n\n– When is Martina Sorbara’s birthday?\n\nAssociated with\n\nFans also viewed"}], "Martina Sorbara has collaborated with artists such as Kaskade, Martin Solveig, and Basement Jaxx.": [{"url": "https://www.thestar.com/entertainment/music/2022/11/15/toronto-songstress-martina-sorbara-and-the-return-of-dragonette.html", "page_content": "Martina Sorbara quips that every interview she’s done in support of Dragonette’s long-gestating new album, “Twennies,” turns out to be “a little bit therapy.”\n\nThis makes perfect sense, since the very act of making the record was something of a therapeutic process for the Toronto electro-pop songstress. During the six years since Dragonette’s last recording, 2016’s “Royal Blues,” Sorbara experienced the final dissolution of the original creative partnership at the heart of Dragonette, the start of a new romantic relationship and the subsequent birth of her first child followed by the further life-disrupting chaos of the COVID-19 pandemic, all the while wrestling with what form her musical career would take in the future.\n\nAll this upheaval audibly informs what might just be Dragonette’s finest album yet, a mature, three-dimensional pop offering that grapples with the simultaneous terror and thrilling potential of Big Change before confidently accepting that sometimes Big Change is the only way forward.\n\n“Dragonette was on the gurney,” admitted Sorbara over a post-rehearsal pint at her local microbrewery in the Roncesvalles neighbourhood. “I was just, like, ‘I’m gonna go make some music and we’ll defibrillate you if we need you. I’m gonna go make this record and we’ll see what it is and then maybe we’ll take you off life support.’ And then I was, like, ‘No, no. I have to.’ Because now Dragonette feels like mine.”\n\nIt seems odd that Sorbara, 43, would be nervous about carrying Dragonette — which she formed with her ex-husband, Dan Kurtz, 15 years ago — ahead as a solo act since she began performing and recording as a solo act when she was just 16.\n\nBut once she and Kurtz decided, after making “Royal Blues” together six years ago despite their recent separation, to part ways creatively, as well, it took her some time to claim the name and the legacy of Dragonette as her own. And also to realize that she was now in a position to do whatever she wanted with it.\n\n“I wasn’t going to wrap up shop. I was doing well just floating around the world writing with other people, doing collaborations,” she said. “I’d started writing for other artists, and I love collaborating and I love writing and I love releasing music. It was just the idea of having to put something that’s just mine behind my name and being the only person in the picture.”\n\nA series of encounters with potential label suitors didn’t help her disenchantment, as A&R professionals offered Sorbara — whose done just fine penning top-shelf pop fodder in the past with the likes of Martin Solveig and Kaskade, as well as for other artists such as Carly Rae Jepsen and Keith Urban — guidance towards the future in the form of radio-ready playlists that really didn’t sit comfortably with her.\n\n“I don’t want to diss what’s on the radio but it just was, like, ‘If I’m supposed to try to get on the radio, I don’t want to make music anymore,’” she recalled. “It’s not like ‘Music used to be better and now it sucks.’ I just don’t want to make that. It’s not that it’s bad. It’s just not for me. Maybe I aged out of it. I don’t know.\n\n“It wasn’t even like it was bad music. It was just, like, ‘No, I can’t do that.’ My soul just reacted in a way where I thought ‘If that’s what I’m supposed to do, maybe I’m not a band anymore because I don’t want to do that.’”\n\nA fortunate encounter with producer Dan Farber, who’s worked with Lizzo and Dizzee Rascal in the past, during a “random” writing trip to Los Angeles proved to be the catalyst for “Twennies” — even if it took Sorbara some time to wake up to that fact.\n\nOne of the first tunes the two wrote together was the sweet, bossa nova-tinged ballad “This Is All You Get,” yet at the time of its creation Sorbara deemed it a bad fit for Dragonette. Yet as time moved on, it dawned on her that now that Dragonette was just her, Dragonette could sound like whatever the hell she wanted Dragonette to sound like. She could even re-embrace her “inner Ani DiFranco” and take the music in directions that hearken back to her formative years as a folk singer/songwriter. Farber was a willing co-conspirator.\n\n“He’s so amazing. I’ve worked with so many people over the last 10 years when I started just walking in with strangers or whatever,” she said, “but I’ve never made a musical connection where all of a sudden you’re speaking a creative language with such easy flow and there’s no weird judginess and I’m not going to censor anything and that was how it was from the very beginning. We wrote that song and I was, like, ‘Too bad it’s not Dragonette.’ But with time and space and feeling like I could do whatever I want, it went from being ‘I can do whatever I want. This has to be a Dragonette record and this is how I make this thing mine.’ It was a thing I had to do to own the past 15 years of my life.”\n\nWith “Twennies” thrown out to the world at large on Oct. 28, Dragonette returns to a Toronto stage on Thursday at the Axis Club. It’s one of only a handful of gigs she’s done since the last record, but the first — a trip to the Planet Pride celebrations in Brooklyn last summer which she almost cancelled at the last minute — gave her inner confirmation that she was capable of claiming Dragonette as her own.\n\nAfter performing the worldwide smash “Hello,” a 2010 collaboration with DJ/producer Solveig that was back on the Billboard charts this year thanks to its inclusion in the TV series “Ted Lasso,” before the Planet Pride crowd Sorbara wandered around and heard “Hello,” her Kaskade cut “Fire In Your New Shoes” and her Galantis co-write “Peanut Butter Jelly” being spun to delirious crowds by other DJs. It was a welcome boost of confidence.\n\n“I wrote all these songs but I’d never in my life allowed myself to feel that,” she said. “It was like something happening outside of me and I couldn’t take ownership of it and, for some reason, I don’t know if it’s because now Dragonette is me and it’s mine I feel myself more holistically in this thing and I’m like ‘Wow, I did all those things.’ And those songs are living on. ‘Hello’ was on the top of the f---ing Billboard charts this year. That’s a f---ing classic.”\n\n“My point is not tooting my own horn or saying ‘Look at all this sh--- I did,’ but for the past 10 years I never took ownership of it. I just flew down there by myself. I had no entourage. I was a floater. And then I got up onstage and I sang for the first performance and something about the aloneness of me there, I think, made me realize all of a sudden ‘Oh, I had to do this.’ I woke up to my autonomy and my ownership of all this stuff and then I kept hearing my songs and all of a sudden I owned them and I was me.”\n\nSHARE:"}, {"url": "https://www.laweekly.com/enter-the-dragonette/", "page_content": "Enter the Dragonette: Dragonette returned last fall with her first album in six years, Twennies. The artists real name Martina Sorbara, worked on the project with Dan Farber (Dizzee Rascal, Lizzo).\n\n“The word ‘twennies’ comes up in a couple songs on the record, and felt like a theme that was taking dominance,” she said in a statement. “I think it has to do with a kind of reflection on this moment, right now, the 2020’s versus me in MY 20’s. What do i have left from that time in my life, what is still with me, and precious and valuable, and what have I lost or intentionally left behind. As for the colloquial spelling, I feel like it captures a sort of throw-away nature time, but at the same time an intimacy with the passage of time.”\n\n“As Dragonette, Sorbara has lived multiple musical lifetimes over the past 15 years,” reads a press release. “A Juno-winning artist and sought-after songwriter, Sorbara has scored numerous global hits, including “Pick Up the Phone,” “Let it Go,” along with the chart-topping “Hello” with Martin Solveig. She’s collaborated with the world’s biggest DJs (Basement Jaxx, Martin Garrix, Kaskade, and Galantis, among others) and released four acclaimed albums, including the Juno-nominated Fixin to Thrill (2009) and Bodyparts (2012). A longtime priority writer with Sony/ATV publishing, the Toronto-based Sorbara’s diverse credits include songs for Keith Urban, Cyndi Lauper, Pretty Sister, Mike Mago, and Carly Rae Jepsen, amongst others. Along the way, Dragonette has headlined shows across the globe; supported the likes of Duran Duran, New Order, Ke$ha, and Miike Snow; and played to thousands of fans at Coachella, Electric Daisy Carnival, Glastonbury, and Lollapalooza.”\n\nCheck her out at the Roxy this week.\n\nEnter the Dragonette: 9 p.m. on Thursday, April 6 at the Roxy Theatre.\n\nEditor’s note: The disclaimer below refers to advertising posts and does not apply to this or any other editorial stories. LA Weekly editorial does not and will not sell content.\n\nAdvertising disclosure: We may receive compensation for some of the links in our stories. Thank you for supporting LA Weekly and our advertisers."}, {"url": "https://music.mxdwn.com/2022/11/30/reviews/album-review-dragonette-twennies/", "page_content": "Home Reviews Madeleine Thezan November 30th, 2022 - 9:00 AM\n\nDance-inducing, thoughtful pop with dazzling vibes\n\nCanadian electro pop singer-songwriter Martina Sorbara, professionally known as Dragonette, has just released her latest album, Twennies. Sorbara has previously worked with artists such as Martin Solveig on the hit “Hello.” Listen in for a catchy, light-hearted experience.\n\nThe first song, “Seasick,” introduces the album with a very colorful-sounding song about unrequited love. The chorus, “I get seasick floating along…’cause you got the taste for somebody else” depicts the end of a relationship in a pop-y, catchy way.\n\nThe title track, “Twennies,” is a four to the floor potent dance song with lyrics “attention… more of a distortion… the more I get it, the less I want it.” The music has a heightened energy, starting with a low bass ostinato and vocals and quickly shooting up to a pop-y energetic chorus.\n\n“T-shirt” is a sort of indie rock-sounding song. The lyrics of the chorus, “I wear your t-shirt a lot” show the longing of the singer for their former romantic interest, as do the wistful chords and guitar parts. This song, though simple in style, is musically deep and lyrically thoughtful.\n\nA little later in the album is “Good Intentions.” “I’m coming in hot with my good intentions, but I never live up to my expectations,” are the lyrics of the chorus. They speak of a relatable experience where one may be trying something new with little experience and a lot of hope for the best.\n\nThe last song, “Outie,” is a wistful, slow, singer-songwriter style-sounding song, but the lyrics go much deeper. The chorus is “Don’t threaten me with a good time,” and is presumably about not wanting to go out with someone that someone was talking to, but was not “[feeling] hard feelings” for. The song is short but packs a meaningful message about respecting space and feelings."}, {"url": "https://touring.apa-agency.com/rosters/dragonette/", "page_content": "Martina Sorbara, better known as the electro-pop outfit Dragonette, has lived multiple musical lifetimes over the past 15 years. A Juno-winning artist and sought-after songwriter, Sorbara has scored numerous global hits, including “Pick Up the Phone,” “Let it Go,” and the chart-topping “Hello” with Martin Solveig. She’s collaborated with the world’s biggest DJs (Basement Jaxx, Kaskade, and Galantis, among others) and released four acclaimed albums, including the Juno-nominated Fixin to Thrill (2009) and Bodyparts (2012). Along the way, Dragonette has headlined shows across the globe; supported the likes of Duran Duran, New Order, Ke$ha, and Miike Snow; and played to thousands of fans at Coachella, Electric Daisy Carnival, Glastonbury, and Lollapalooza. Sorbara’s songs have amassed over 150 Million streams on Spotify alone.\n\nA longtime priority writer with Sony/ATV publishing, the Toronto-based Sorbara also regularly works with acts under UMG, Warner Music, Syco, and Spinnin’. Her musically diverse credits include songs for Keith Urban, Cyndi Lauper, Pretty Sister, Mike Mago, and Carly Rae Jepsen with The Knocks.\n\nSorbara is currently working on Dragonette’s highly-anticipated follow-up to 2016’s Royal Blues."}, {"url": "https://www.allmusic.com/artist/dragonette-mn0000656811/biography", "page_content": "Led by singer/songwriter Martina Sorbara, Canadian electro-poppers Dragonette are known for their glistening and hooky, new wave-inspired sound. It's a style that initially drew comparisons to the Scissor Sisters, No Doubt, and the Killers, especially with the release of 2007's Galore and 2009's Fixin' to Thrill. However, later albums like 2012's Bodyparts and the group's international hit collaboration with producer Martin Solveig, \"Hello,\" proved the group had its own confident, club-savvy identity. While 2015's Royal Blues marked the end of Sorbara and longtime-collaborator Dan Kurtz's relationship, she forged ahead and debuted her solo version of Dragonette on 2022's Twennies.\n\nMartina Sorbara founded Dragonette in 2005 with multi-instrumentalist Dan Kurtz (formerly of the jazz and electronica-influenced Toronto-based jam band the New Deal), guitarist Simon Craig, and drummer Joel Stouffer. The daughter of York University Chancellor and former member of Ontario's provincial government Greg Sorbara, Sorbara had previously maintained a moderately successful solo career as an AOR/adult alternative artist in the style of Sarah McLachlan, releasing several albums including 2002's The Cure for Bad Deeds. However, after sparking a creative and romantic partnership with Kurtz, she decided to move forward in a collaborative fashion with Dragonette.\n\nA self-released and self-titled 2005 demo attracted the attention of the U.K. office of Mercury Records, which offered Dragonette a recording contract the following year. Moving their base of operations from Toronto to London (and losing Craig in the process, replaced by British guitarist Will Stapleton), Dragonette released their first single, \"I Get Around,\" in April 2007. Three more singles followed, \"Take It Like a Man,\" \"Competition,\" and a gender-reversal cover of Calvin Harris' hit \"The Girls\" called \"The Boys.\" Dragonette's debut album, Galore, was released in late summer 2007. The same year, Sorbara sang lead vocals on the hit Basement Jaxx single \"Take Me Back to Your House.\" Galore was released in the U.S. in 2008 on I Surrender Records.\n\nThe band's second album, Fixin' to Thrill, a more focused and polished effort that charted in Canada's Top Ten, arrived in 2009 and earned a nomination for Dance Recording of the Year at the 2011 Juno Awards. The following year, Dragonette released the Mixin' to Thrill remix album and collaborated with several dance producers on singles such as Kaskade's \"Fire in Your New Shoes,\" Don Diablo's \"Animale,\" and, most notably, Martin Solveig's \"Hello.\" The single, which appeared on Solveig's 2011 album Smash, became a worldwide hit, topping the charts in five countries, reaching the Top Ten in ten other countries, and topping Billboard's Hot Dance Club chart in the U.S. early in 2011 (the song ultimately earned the group a Juno for Dance Recording of the Year in 2012).\n\nIn 2011, Dragonette co-wrote and produced the song \"Lucky Day\" for Girls Aloud member Nicola Roberts' solo album Cinderella's Eyes, and returned to the studio to work on their third album. Released in 2012, Bodyparts was the first Dragonette album to be produced by the band, as well as the first to be released in Canada and the U.S. at the same time. The band followed it with several years of singles and collaborations, including a 2013 cover of the Mister Rogers' Neighborhood theme song \"Won't You Be My Neighbor?\" that appeared in Target Canada commercials. Later, team-ups with Mike Mago, LENNO, Joey Stylez, Paul Harris, and Big Data kept them busy in 2014 and 2015.\n\nDragonette issued the single \"Let the Night Fall\" in June 2015, offering the first taste of their fourth album, Royal Blues, which was inspired in part by Sorbara and Kurtz's separation. It was released in November 2016 and featured production work by Mago and U.K. producer Dada. Following the end of their relationship, Kurtz returned to his former band the New Deal, while Sorbara moved forward with Dragonette as her solo project. In October 2022, she returned with the full-length Twennies, recorded in Toronto with producer Dan Farber (Dizzee Rascal, Lizzo)."}, {"url": "https://www.thestar.com/life/together/people/2021/01/17/at-home-with-chef-cory-vitiello-dragonette-singer-martina-sorbara-and-their-adorable-toddler-barlow.html", "page_content": "What’s life in lockdown with a two-year-old like? “The greatest!” says Martina Sorbara. “We’re really fortunate,” says her partner, chef Cory Vitiello, of life at home with Barlow, who turned two in September. “We just have so much time during this critical stage to spend with him and watch him grow and enjoy every step.”\n\nThe couple’s busy schedules usually mean that they’re anywhere but at their home, which is between High Park and Roncesvalles Village. All that changed with the lockdown in March 2020, when Dragonette, Sorbara’s indie-pop project, was put on hold, and Vitiello, founder of elevated-takeout-rotisserie-chicken joint Flock Rotisserie + Greens, faced a wave of heartbreaking April cancellations, including Biblio Bash, the Toronto Public Library fundraiser with his catering partner 10Tation, and his annual fundraising dinner for children’s cancer charity Camp Ooch at Cactus Club Café, where he is head of culinary development for Toronto.\n\nBut the silver lining has been the extra time at home with their son. Right now, Barlow is learning to talk (“He calls me ‘hon’ and ‘babe,’” Sorbara says with a laugh), and he graduated early from potty training, which the couple initiated once they realized that their normally packed schedules had dramatically freed up.\n\nIt’s created plenty of time for lazy Sundays. “We’ve made Sundays about us,” says Vitiello. “That’s why it’s so special. We lock ourselves in, do our crosswords and cook.” On a typical weekend, the family will get up early and go for a stroll through High Park or Roncesvalles Village. They’re regulars at the Roncy café Reunion Island, sometimes scooping up a legendary breakfast sandwich from the Gold Standard takeout window. “They treat Barlow like a VIP,” says Vitiello.\n\nVitiello, a chef since he was 15, spent most Sundays during the first two decades of his 25-year career working hectic shifts in kitchens. After closing his acclaimed Harbord Room restaurant in 2016, his life changed. Now, in contrast to the harried pace of a restaurant kitchen, Vitiello savours the slower speed of cooking at home. He starts the day by picking up fresh ingredients from local merchants, such as fish market Hooked or Roncesvalles produce stand Ko Fruit Market.\n\nThough veggies and fish are usually the core ingredients of his mains, a high-quality cut of meat constitutes a special Sunday treat. Braised meats, especially short ribs, have been a favourite comfort food over the winter. While Sorbara is a pescatarian, Vitiello says he has “no problem spending the whole Sunday cooking this braise that could feed 15 people, even though there is only one person in the house who eats it.” Thankfully, it’s not hard to find some outside assistance. “I usually take some to the neighbours [as a] surprise,” he says.\n\nSorbara is a whiz in the kitchen, too, whipping up pastries to satisfy Vitiello’s sweet tooth. She’s happiest, however, spending a cosy Sunday working away on a crossword, a pastime Vitiello has picked up as well, along with his Sudoku habit.\n\nSorbara is a veteran puzzle master — she enjoys making crosswords as birthday gifts for her father, York University chancellor Gregory Sorbara. A highlight of her 2020 was receiving a thoughtful rejection from the New York Times for a crossword she’d submitted that had the theme of shape-shifting. “I’m going to submit another one, and I have high hopes!” she says.\n\nTo carve out time for themselves, they take turns putting Barlow down for his nap and to bed at night. “And our glory time is when we finally get him down to bed and we have our evening to ourselves,” says Vitiello.\n\nThat’s when the strategy board games come out. Their current favourite is A Few Acres of Snow, an out-of-print two-player game from 2011 based on the struggle between the French and the British to occupy Canada. Sorbara learned the game from her cousin, a board-game collector. “It’s hilariously nerdy,” she says. Vitiello also juggles three ongoing poker groups on Zoom: a game with friends, a game with fellow chefs and a game with “the old-timers, Martina’s father and his friends.”\n\nBut the highlight remains watching their baby boy grow. “In the past year, I think we have seen three different versions of him and had to say goodbye to some really sweet versions only to [witness the] birth [of] the next incarnation of who this child is,” says Vitiello. “It’s been so special to see that growth together.”\n\nRead more about:\n\nSHARE:"}, {"url": "https://canadatoday.news/ca/toronto-singer-martina-sorbara-and-the-return-of-dragonette-148681/", "page_content": "Martina Sorbara jokes that every interview she’s had in support of Dragonette’s long-matured new album Twennies turns out to be “a bit of therapy.”\n\nIt makes perfect sense as making the record was something of a therapeutic process for the Toronto electropop singer. In the six years since Dragonette’s last recording, 2016’s “Royal Blues,” Sorbara witnessed the final dissolution of the original creative partnership at the heart of Dragonette, the beginning of a new romantic relationship, and the subsequent birth of their first child, followed by further the life-shattering chaos of the COVID-19 pandemic, all the while wrestling with what her musical career would look like in the future.\n\nAll of this upheaval audibly shapes Dragonette’s best album, a mature, three-dimensional pop offering that grapples with Big Change’s simultaneous terror and exciting potential before confidently acknowledging that Big Change is sometimes the only way forward.\n\n“Dragonette was on the stretcher,” Sorbara admitted over a post-rehearsal pint at her local microbrewery in the Roncesvalles neighborhood. “I was just like, ‘I’m going to make some music and we’re going to defibrillate you if we need you. I’m going to make this record and we’ll see what it is, and then we might take you off life support. And then I thought, ‘No, no. I to have to.’ Because now Dragonette feels like mine.”\n\nIt seems odd that Sorbara, 43, would be nervous about taking Dragonette – which she formed 15 years ago with ex-husband Dan Kurtz – forward as a solo act since she first began performing and recording as a solo act, when she was just 16.\n\nBut when she and Kurtz, after making Royal Blues together six years ago despite their recent breakup, decided to part ways creatively as well, it took her some time to claim the Dragonette name and legacy as her own. And also to realize that she was now able to do what she wanted with it.\n\n“I didn’t want to lock up the shop. I was fine, just floating around the world writing and collaborating with other people,” she said. “I had started writing for other artists and I love collaborating and I love writing and I love releasing music. It was just the idea of ​​putting something of my own behind my name and being the only person in the picture.”\n\nA series of run-ins with potential label suitors didn’t help their disillusionment, as A&R pros offered Sorbara — who’d worked in the past with artists like Martin Solveig and Kaskade, as well as other artists such as Carly Rae Jepsen and Keith Urban — pointers to the future in form of radio-ready playlists that she really didn’t like.\n\n“I don’t want to diss what’s on the radio, but it was just like, ‘If I’m going to try to get on the radio, I don’t want to do any more music,'” she recalled. “It’s not like, ‘Music used to be better and now it sucks.’ I just don’t want to do this. It’s not that it’s bad. It’s just not for me. Maybe I’ve aged because of it. I do not know.\n\n“It wasn’t even like it was bad music. It was just, ‘No, I can’t.’ My soul just reacted in such a way that I was like, ‘If this is what I’m supposed to do, maybe I’m not a band anymore because I don’t want to.'”\n\nA fortunate encounter with producer Dan Farber, who has worked with Lizzo and Dizzee Rascal in the past, during a “chance” writing trip to Los Angeles proved to be the catalyst for “Twennies” — though Sorbara took some time to wake up to that fact.\n\nOne of the first tunes the two wrote together was the sweet, bossa novatinged ballad This Is All You Get, but at the time of its creation, Sorbara felt it was a poor fit for Dragonette. But over time it dawned on her that now that Dragonette was just her, Dragonette could sound whatever the hell Dragonette was supposed to sound like she wanted. She was even able to embrace her “inner Ani DiFranco” and take the music in directions dating back to her formative years as a folk singer/songwriter. Farber was a willing co-conspirator.\n\n“He’s so incredible. I’ve worked with so many people over the last 10 years when I just started coming in with strangers or whatever,” she said, “but I’ve never made a musical connection where you suddenly start speaking some creative language with one.” so easy flow and there’s no weird judgment and I’m not going to censor anything and it’s been like that from the start. We wrote that song and I was like, ‘Too bad it’s not Dragonette.’ But with time and space and feeling like I could do whatever I want, it got away from, “I can do whatever I want. This has to be a dragonette record, so I’m making that thing my own.” It was one thing I had to do to own the last 15 years of my life.”\n\nAfter “Twennies” was thrown out into the world on October 28th, Dragonette returns to a Toronto stage at the Axis Club on Thursday. It’s one of only a few gigs she’s done since last record, but the first – a trip to the Planet Pride celebrations in Brooklyn last summer, which she almost canceled at the last minute – gave her the inner validation that that she was able to claim Dragonettes as her own.\n\nAfter performing the worldwide hit Hello, a 2010 collaboration with DJ/producer Solveig, which returned to the Billboard charts this year thanks to his inclusion in the TV series Ted Lasso, ahead of the Planet Pride Crowd wandered, Sorbara heard “Hello,” her cascade cut “Fire In Your New Shoes,” and her Galantis co-writer “Peanut Butter Jelly,” spun into insane masses by fellow DJs. That was a welcome boost in confidence.\n\n“I wrote all these songs, but I never in my life allowed myself to feel that,” she said. “It was like something was happening outside of me and I couldn’t own it and for some reason I don’t know if it’s because Dragonette is me now and owns it. I feel more holistic about this and I’m like, ‘Wow, I’ve done all of these things.’ And those songs live on. “Hello” topped the fucking Billboard charts this year. It’s a damn classic.”\n\n“It’s not for me to honk my own horn or say, ‘Look at this shit I’ve done,’ but in the last 10 years I’ve never owned it. I just flew down there alone. I had no entourage. I was a floater. And then I got on stage and I sang for the premiere and something about my loneliness there I think suddenly made me realize, ‘Oh, me would have in order to do this.’ I woke up to my autonomy and ownership of all these things and then I kept listening to my songs and suddenly I owned them and I was me.”\n\nBen Rayner is a Toronto-based journalist and a regular contributor to the Star’s Culture section. Follow him on Twitter: @ihatebenraynerSHARE:\n\nJOIN THE CONVERSATION\n\nAnyone can read Conversations, but to contribute you should be a registered Torstar account holder. If you don’t have a Torstar account yet, you can create one now (it’s free)\n\nlog in\n\nto register\n\nConversations are opinions of our readers and are subject to the Code of Conduct. The star does not support these opinions.\n\nSource"}, {"url": "https://citizenfreak.com/artists/94325-dragonette", "page_content": "Dragonette\n\nWebsites: https://dragonette.rosecityworks.com/\n\nOrigin: Toronto, Ontario\n\nBiography:\n\nLed by singer/songwriter Martina Sorbara, Canadian electro-poppers Dragonette are known for their glistening and hooky, new wave-inspired sound. It's a style that initially drew comparisons to the Scissor Sisters, No Doubt, and the Killers, especially with the release of 2007's Galore and 2009's Fixin' to Thrill. However, later albums like 2012's Bodyparts and the group's international hit collaboration with producer Martin Solveig, \"Hello,\" proved the group had its own confident, club-savvy identity. While 2015's Royal Blues marked the end of Sorbara and longtime-collaborator Dan Kurtz's relationship, she forged ahead and debuted her solo version of Dragonette on 2022's Twennies.\n\nMartina Sorbara founded Dragonette in 2005 with multi-instrumentalist Dan Kurtz (formerly of the jazz and electronica-influenced Toronto-based jam band the New Deal), guitarist Simon Craig, and drummer Joel Stouffer. The daughter of York University Chancellor and former member of Ontario's provincial government Greg Sorbara, Sorbara had previously maintained a moderately successful solo career as an AOR/adult alternative artist in the style of Sarah McLachlan, releasing several albums including 2002's The Cure for Bad Deeds. However, after sparking a creative and romantic partnership with Kurtz, she decided to move forward in a collaborative fashion with Dragonette.\n\nA self-released and self-titled 2005 demo attracted the attention of the U.K. office of Mercury Records, which offered Dragonette a recording contract the following year. Moving their base of operations from Toronto to London (and losing Craig in the process, replaced by British guitarist Will Stapleton), Dragonette released their first single, \"I Get Around,\" in April 2007. Three more singles followed, \"Take It Like a Man,\" \"Competition,\" and a gender-reversal cover of Calvin Harris' hit \"The Girls\" called \"The Boys.\" Dragonette's debut album, Galore, was released in late summer 2007. The same year, Sorbara sang lead vocals on the hit Basement Jaxx single \"Take Me Back to Your House.\" Galore was released in the U.S. in 2008 on I Surrender Records.\n\nThe band's second album, Fixin' to Thrill, a more focused and polished effort that charted in Canada's Top Ten, arrived in 2009 and earned a nomination for Dance Recording of the Year at the 2011 Juno Awards. The following year, Dragonette released the Mixin' to Thrill remix album and collaborated with several dance producers on singles such as Kaskade's \"Fire in Your New Shoes,\" Don Diablo's \"Animale,\" and, most notably, Martin Solveig's \"Hello.\" The single, which appeared on Solveig's 2011 album Smash, became a worldwide hit, topping the charts in five countries, reaching the Top Ten in ten other countries, and topping Billboard's Hot Dance Club chart in the U.S. early in 2011 (the song ultimately earned the group a Juno for Dance Recording of the Year in 2012).\n\nIn 2011, Dragonette co-wrote and produced the song \"Lucky Day\" for Girls Aloud member Nicola Roberts' solo album Cinderella's Eyes, and returned to the studio to work on their third album. Released in 2012, Bodyparts was the first Dragonette album to be produced by the band, as well as the first to be released in Canada and the U.S. at the same time. The band followed it with several years of singles and collaborations, including a 2013 cover of the Mister Rogers' Neighborhood theme song \"Won't You Be My Neighbor?\" that appeared in Target Canada commercials. Later, team-ups with Mike Mago, LENNO, Joey Stylez, Paul Harris, and Big Data kept them busy in 2014 and 2015.\n\nDragonette issued the single \"Let the Night Fall\" in June 2015, offering the first taste of their fourth album, Royal Blues, which was inspired in part by Sorbara and Kurtz's separation. It was released in November 2016 and featured production work by Mago and U.K. producer Dada. Following the end of their relationship, Kurtz returned to his former band the New Deal, while Sorbara moved forward with Dragonette as her solo project. In October 2022, she returned with the full-length Twennies, recorded in Toronto with producer Dan Farber (Dizzee Rascal, Lizzo).\n\n-Matt Collar"}, {"url": "https://www.paquinartistsagency.com/roster/artist/dragonette", "page_content": "Martina Sorbara, better known as the electro-pop outfit Dragonette, has lived multiple musical lifetimes over the past 15 years. A Juno-winning artist and sought-after songwriter, Sorbara has scored numerous global hits, including “Pick Up the Phone,” “Let it Go,” and the chart-topping “Hello” with Martin Solveig. She’s collaborated with the world’s biggest DJs (Basement Jaxx, Kaskade, and Galantis, among others) and released four acclaimed albums, including the Juno-nominated Fixin to Thrill (2009) and Bodyparts (2012). Along the way, Dragonette has headlined shows across the globe; supported the likes of Duran Duran, New Order, Ke$ha, and Miike Snow; and played to thousands of fans at Coachella, Electric Daisy Carnival, Glastonbury, and Lollapalooza. Sorbara’s songs have amassed over 150 Million streams on Spotify alone.\n\nA longtime priority writer with Sony/ATV publishing, the Toronto-based Sorbara also regularly works with acts under UMG, Warner Music, Syco, and Spinnin’. Her musically diverse credits include songs for Keith Urban, Cyndi Lauper, Pretty Sister, Mike Mago, and Carly Rae Jepsen with The Knocks.\n\nSorbara is currently working on Dragonette’s highly-anticipated follow-up to 2016’s Royal Blues."}, {"url": "https://canadatoday.news/on/toronto-singer-martina-sorbara-and-the-return-of-dragonette-116513/", "page_content": "Martina Sorbara jokes that every interview she’s had in support of Dragonette’s long-matured new album Twennies turns out to be “a bit of therapy.”\n\nIt makes perfect sense as making the record was something of a therapeutic process for the Toronto electropop singer. In the six years since Dragonette’s last recording, 2016’s “Royal Blues,” Sorbara witnessed the final dissolution of the original creative partnership at the heart of Dragonette, the beginning of a new romantic relationship, and the subsequent birth of their first child, followed by further the life-shattering chaos of the COVID-19 pandemic, all the while wrestling with what her musical career would look like in the future.\n\nAll of this upheaval audibly shapes Dragonette’s best album, a mature, three-dimensional pop offering that grapples with Big Change’s simultaneous terror and exciting potential before confidently acknowledging that Big Change is sometimes the only way forward.\n\n“Dragonette was on the stretcher,” Sorbara admitted over a post-rehearsal pint at her local microbrewery in the Roncesvalles neighborhood. “I was just like, ‘I’m going to make some music and we’re going to defibrillate you if we need you. I’m going to make this record and we’ll see what it is, and then we might take you off life support. And then I thought, ‘No, no. I to have to.’ Because now Dragonette feels like mine.”\n\nIt seems odd that Sorbara, 43, would be nervous about taking Dragonette – which she formed 15 years ago with ex-husband Dan Kurtz – forward as a solo act since she first began performing and recording as a solo act, when she was just 16.\n\nRead also: Maple Leafs singer Martina Ortiz Luis is leaving the company\n\nBut when she and Kurtz, after making Royal Blues together six years ago despite their recent breakup, decided to part ways creatively as well, it took her some time to claim the Dragonette name and legacy as her own. And also to realize that she was now able to do what she wanted with it.\n\n“I didn’t want to lock up the shop. I was fine, just floating around the world writing and collaborating with other people,” she said. “I had started writing for other artists and I love collaborating and I love writing and I love releasing music. It was just the idea of ​​putting something of my own behind my name and being the only person in the picture.”\n\nA series of run-ins with potential label suitors didn’t help their disillusionment, as A&R pros offered Sorbara — who’d worked in the past with artists like Martin Solveig and Kaskade, as well as other artists such as Carly Rae Jepsen and Keith Urban — pointers to the future in form of radio-ready playlists that she really didn’t like.\n\n“I don’t want to diss what’s on the radio, but it was just like, ‘If I’m going to try to get on the radio, I don’t want to do any more music,'” she recalled. “It’s not like, ‘Music used to be better and now it sucks.’ I just don’t want to do this. It’s not that it’s bad. It’s just not for me. Maybe I’ve aged because of it. I do not know.\n\n“It wasn’t even like it was bad music. It was just, ‘No, I can’t.’ My soul just reacted in such a way that I was like, ‘If this is what I’m supposed to do, maybe I’m not a band anymore because I don’t want to.'”\n\nA fortunate encounter with producer Dan Farber, who has worked with Lizzo and Dizzee Rascal in the past, during a “chance” writing trip to Los Angeles proved to be the catalyst for “Twennies” — though Sorbara took some time to wake up to that fact.\n\nOne of the first tunes the two wrote together was the sweet, bossa novatinged ballad This Is All You Get, but at the time of its creation, Sorbara felt it was a poor fit for Dragonette. But over time it dawned on her that now that Dragonette was just her, Dragonette could sound whatever the hell Dragonette was supposed to sound like she wanted. She was even able to embrace her “inner Ani DiFranco” and take the music in directions dating back to her formative years as a folk singer/songwriter. Farber was a willing co-conspirator.\n\n“He’s so incredible. I’ve worked with so many people over the last 10 years when I just started coming in with strangers or whatever,” she said, “but I’ve never made a musical connection where you suddenly start speaking some creative language with one.” so easy flow and there’s no weird judgment and I’m not going to censor anything and it’s been like that from the start. We wrote that song and I was like, ‘Too bad it’s not Dragonette.’ But with time and space and feeling like I could do whatever I want, it got away from, “I can do whatever I want. This has to be a dragonette record, so I’m making that thing my own.” It was one thing I had to do to own the last 15 years of my life.”\n\nAfter “Twennies” was thrown out into the world on October 28th, Dragonette returns to a Toronto stage at the Axis Club on Thursday. It’s one of only a few gigs she’s done since last record, but the first – a trip to the Planet Pride celebrations in Brooklyn last summer, which she almost canceled at the last minute – gave her the inner validation that that she was able to claim Dragonettes as her own.\n\nAfter performing the worldwide hit Hello, a 2010 collaboration with DJ/producer Solveig, which returned to the Billboard charts this year thanks to his inclusion in the TV series Ted Lasso, ahead of the Planet Pride Crowd wandered, Sorbara heard “Hello,” her cascade cut “Fire In Your New Shoes,” and her Galantis co-writer “Peanut Butter Jelly,” spun into insane masses by fellow DJs. That was a welcome boost in confidence.\n\n“I wrote all these songs, but I never in my life allowed myself to feel that,” she said. “It was like something was happening outside of me and I couldn’t own it and for some reason I don’t know if it’s because Dragonette is me now and owns it. I feel more holistic about this and I’m like, ‘Wow, I’ve done all of these things.’ And those songs live on. “Hello” topped the fucking Billboard charts this year. It’s a damn classic.”\n\n“It’s not for me to honk my own horn or say, ‘Look at this shit I’ve done,’ but in the last 10 years I’ve never owned it. I just flew down there alone. I had no entourage. I was a floater. And then I got on stage and I sang for the premiere and something about my loneliness there I think suddenly made me realize, ‘Oh, me would have in order to do this.’ I woke up to my autonomy and ownership of all these things and then I kept listening to my songs and suddenly I owned them and I was me.”\n\nBen Rayner is a Toronto-based journalist and a regular contributor to the Star’s Culture section. Follow him on Twitter: @ihatebenraynerSHARE:\n\nJOIN THE CONVERSATION\n\nAnyone can read Conversations, but to contribute you should be a registered Torstar account holder. If you don’t have a Torstar account yet, you can create one now (it’s free)\n\nlog in\n\nto register\n\nConversations are opinions of our readers and are subject to the Code of Conduct. The star does not support these opinions.\n\nSource"}]}