{"Tom Wise was re-elected in 2005.": [{"url": "https://www.wikiwand.com/en/Tom_Wise_(politician)", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about Tom Wise (politician)?\n\nSummarize this article for a 10 years old"}, {"url": "https://peoplepill.com/people/tom-wise/", "page_content": "Tom (Thomas) Harold Wise (born 13 May 1948 in Bournemouth) was an Independent and UKIP Member of the European Parliament (MEP) for the East of England. A former police officer, he was elected in 2004 as a member of the UK Independence Party but later had the whip withdrawn when allegations of misuse of parliamentary expenses surfaced in The Sunday Telegraph. Following an inquiry carried out by the European Anti-Fraud Office, Wise was formally charged with false accounting and money laundering by Bedfordshire Police. After initially pleading not guilty, he admitted the charges and was sentenced in November 2009 at Southwark Crown Court to a two-year term of imprisonment. He is thought to be the first MEP to be jailed for expenses fraud. Sentencing him, the judge said that Wise had engaged in \"deliberate and blatant dishonesty\" and had set about to defraud the European Parliament almost as soon as he was elected.\n\nEarly career\n\nBorn in Bournemouth on 13 May 1948, Wise attended Bournemouth School between 1959 and 1965, before completing a Diploma in Public Speaking in 1967. He served with Dorset Police before embarking on a career in the food distribution and processing industry. He became the UK Managing Director of a German herbs and spices company. From 1981 to 1989 he was a member of the Liberal Party.\n\nPolitical career\n\nUKIP\n\nWise joined the United Kingdom Independence Party (UKIP) in 1997. He served as office manager to Jeffrey Titford MEP, during this period he worked on the rules governing MEPs' expenses and gained an expertise in the system which he would later use to his advantage. He was the fourth-placed candidate on UKIP's candidate list in for the European Parliament elections in 1999, and also stood as the party's candidate in the 1997, 2001 and 2005 general elections for the South West Bedfordshire constituency. In the 2005 general election, he came fourth with 4.2% of the votes cast.\n\nHe was elected as an MEP for UKIP in the 2004 European elections. He was UKIP's official spokesman on the Culture, Youth, Media and Sport Committee until his suspension by the party in February 2007. In his first speech to the Committee on 4 October 2004, Wise criticised the proposed budget and drew allusions with Nazi Propaganda Minister Joseph Goebbels. In his maiden speech to the Parliament on 16 December 2004, Wise blamed the European Union for creating unacceptable conditions for the transit of animals around Europe. Wise also spoke out against the Proposed directive on the patentability of computer-implemented inventions\n\nIndependent\n\nAfter losing the party whip in March 2007, Wise continued as an Independent within UKIP's Independence/Democracy parliamentary grouping pending the outcome of the fraud inquiry.\n\nDuring his time as an MEP, Wise disputed the genuine nature of the September 11th attacks. and labelled Russia-based businessman Alisher Usmanov a \"gangster and racketeer\"\n\nFollowing the decision to press criminal charges against him, Wise decided not to contest the 2009 European Parliament elections. He has however said that he wants to stand as an MP in the 2010 General Election.\n\nFraud conviction\n\nExposure\n\nOn 23 October 2005, a reporter for the Sunday Telegraph, Daniel Foggo, published an article accusing Wise of claiming £36,000 a year from the European Parliament in the name of his researcher, Lindsay Jenkins, while only passing on about a sixth of that amount to her. According to now-repealed Rules governing the payment of expenses and allowances to Members of the European Parliament, MEPs could claim up to £125,000 per year for assistants' wages, but this money must be paid either directly to the employees or to a third-party agent. The rules did not allow the funds to pass directly through the hands of MEPs themselves.\n\nFoggo later reported that Wise had supplied the European Parliament's Payments Office with a \"contract\" including her name and details, which stipulated that the £36,000 allowance should be paid into an account named \"Stags\". This account, held with the Co-operative Bank, was in fact Wise's own business account and its full name was \"T Wise trading as Stags\". The actual agreement between Wise and Jenkins stated that she would receive monthly \"retainer\" payments of £500 for advice and statistical research, with any extra work to be paid on top. Bank documents obtained by Foggo showed that between November 2004 and October 2005, Wise had paid £39,100 to this account, out of which Jenkins received £13,555. These funds were the only monies coming into the account. In another breach of the payment regulations, some of the £13,555 paid to Jenkins represented work done on behalf of other UKIP members, including party leader Nigel Farage who had agreed to fund the publication of a eurosceptic pamphlet by Jenkins. A further £19,000 was transferred from the account, some of which to pay off credit cards.\n\nOn 29 October, Wise admitted to breaching the rules and, to head off a scandal, agreed to repay £25,230. An internal UKIP inquiry was launched after the Parliament became aware of the affair, but no action was taken and the results of the investigation were kept secret. As Daniel Foggo later reported, UKIP's former leader, Roger Knapman, halted the inquiry after it uncovered serious wrongdoing, believing that the European Parliament would clear Wise. Farage told reporter Daniel Foggo that Wise \"had committed a simple, silly error by making himself a \"paying agent\" for his own staff.\"\n\nSuspension from UKIP\n\nOn 23 February 2007, party sources at UKIP discovered that the European Parliament had passed the affair to OLAF, the European Anti-Fraud Office. A UKIP meeting was convened in Brussels on 28 February 2007 at which Wise formally admitted to having spent £6,500 from the allowance on a dark green Peugeot 406 which he still drove, but refused to disclose how he had spent a further £13,000 of the funds. After a heated discussion, a decision was taken to remove the whip; both Knapman and fellow MEP Mike Nattrass challenged the decision and threatened to reconsider their futures in the party. Farage emphasised that, if cleared by the OLAF investigation, Wise would be welcomed back into the party, adding that he thought \"there is a great deal of public sympathy for us.\" Wise was however suspended by the party.\n\nFollowing his suspension, Wise spent a further £8,000 of the allowance in legal fees in contemplation of a libel case against Greg Lance-Watkins who had published claims on the Internet relating to Wise's activities. No action was ultimately brought against Lance-Watkins.\n\nNews of the World sting\n\nIn May 2008, the News of the World published details of a sting involving Tom Wise. A female reporter posing as a work experience student recorded Wise brazenly admitting in a Belgian bar that he had little idea of what his job as a Member of the European Parliament entailed, adding \"I don't know what an MEP's job is. No one's ever given me a job description. I've no idea what an MEP should or shouldn't do. So you make it up as you go along.\" He boasted of fiddling the Parliament's expenses system, stating \"Yes, I am milking the system [...] I have a simple philosophy. You and your parents are paying for me. Sorry, tough!\" The newspaper used its leading article to call for a change in the rules governing MEPs' expenses following the exposé.\n\nArrest and charges\n\nOn 20 June 2008, Wise was arrested by Bedfordshire Police's Economic Crime Unit on suspicion of making a false instrument, obtaining money by deception by transfer and converting criminal property. He was bailed until 29 October. Bedfordshire Police made the arrest after having been contacted by OLAF.\n\nOn 20 April 2009 the Crown Prosecution Service advised Bedfordshire Police to charge both Wise and Jenkins with one count each of false accounting contrary to the Theft Act 1968 and one count each of money laundering contrary to the Proceeds of Crime Act 2002. Both were scheduled to appear before the City of Westminster Magistrates' Court on in April 2009 to face the charges. Wise indicated that he was innocent and would fight the charges which carry a maximum 14-year jail term. He is thought to be the first MEP to face criminal charges over the misuse of parliamentary funds, and the second former UKIP MEP after Ashley Mote to have faced criminal charges during a parliamentary session.\n\nTrial and conviction\n\nWise appeared in court on 27 April 2009 and spoke only to confirm his name and plead not guilty. Jenkins also denied the charges. District Judge Daphne Wickham released both on conditional bail until 8 June. The case was transferred to Southwark Crown Court and charges specified: that Wise and Jenkins \"falsified a document, namely a contract for provision of services, an application for secretarial assistance allowance and invoices\". Also, that they used funds \"received from the European Parliament intended for use as payments for secretarial services.\"\n\nThe three-week trial began on 2 November 2009. Judge Geoffrey Rivlin QC heard the prosecution argue that Wise channelled parliamentary funds into an account he secretly controlled so that he could pay credit card debts and buy fine wines. He made separate payments of £2,228 and £1,260 to wine importers, and maintained the deception by asking Jenkins to sign blank documents which he completed later. But for his exposure, Wise would, according to prosecutors, have claimed up to £180,000.\n\nOn the third day of the trial, just before Nigel Farage was due to give evidence against him, Wise began several hours of negotiations with his legal team after which he changed his plea to guilty and said he was entirely to blame for the fraud. This resulted in Jenkins being acquitted. He was sentenced on 10 November 2009 to two years imprisonment, the sentence having been reduced by one year on account of his guilty plea. In sentencing him, Judge Geoffrey Rivlin declared that:\n\nIt is no exaggeration to say that you had hardly got your feet beneath your desk as an MEP before you were planning to defraud the parliament to which you were elected and the people you were elected to serve. This was very deliberate and blatant dishonesty. You did not fall into this offence as a result of some unfortunate combination of unforeseen circumstances which happened to suddenly present you with temptation. You knew the system of expenses inside out and this was a claim you devised and planned with some care.\n\nThe judge added that, in addition to jail, Wise would also have to pay £30,000 towards the prosecution's costs.\n\nPersonal life\n\nWise is married to Janet and, until his imprisonment, lived in Linslade near Leighton Buzzard in Bedfordshire. He has two grown-up children.\n\nWise has a developed interest in wines, having followed courses arranged by the Wine & Spirit Education Trust and has reached \"the level just below Master of Wine\". He has spoken of having a wine cellar containing 1,000 bottles of wine."}, {"url": "https://en-academic.com/dic.nsf/enwiki/8020398", "page_content": "Infobox MEP\n\nhonorific-prefix =\n\nname = Tom Wise\n\nhonorific-suffix =\n\nparliament = European\n\nconstituency_MP = East of England\n\nterm_start = June 2004\n\nterm_end =\n\nmajority =\n\npredecessor =\n\nsuccessor =\n\nbirth_date =\n\nbirth_place =\n\ndeath_date =\n\ndeath_place =\n\nnationality =\n\nspouse =\n\nrelations =\n\nchildren =\n\nresidence =\n\nalma_mater =\n\noccupation =\n\nprofession =\n\nreligion =\n\n\n\n\n\nwebsite = [ http://www.tomwisemep.co.uk/ tomwisemep.co.uk ]\n\nfootnotes =\n\nTom Wise is a Member of the European Parliament for the East of England for the United Kingdom Independence Party . He was first elected in 2004.\n\nHe is a former police officer and former managing director of a German herbs and spices company. He used to a member of the Liberal Party. [ cite web\n\nurl=http://www.tomwisemep.co.uk/news.php?subaction=showfull&id=1094829906&archive=&start_from=&ucat=3&TB=home3\n\ntitle=New Euro MP with a full-bodied position\n\ndate=2004-06-24\n\npublisher=tomwisemep.co.uk\n\naccessdate=2008-10-09 ]\n\nMEP Expenses\n\nIn 2005 he was in the news for claiming £36,000 to pay the salary of his researcher who was actually paid just £6000. He later agreed to repay some of this money. He was suspended from UKIP in February 2007 when further details of the allegations came to light. [ cite web\n\nurl=http://www.timesonline.co.uk/tol/news/politics/article1454811.ece?token=null&offset=0\n\ntitle=MEP 'bought car with taxpayers' funds'\n\naccessdate=2008-06-21\n\npublisher= The Times ] On June 20th 2008 he was arrested on suspicion of obtaining money by deception. [ cite web\n\nurl=http://news.bbc.co.uk/2/hi/uk_news/england/7467318.stm\n\ntitle=MEP arrested on fraud allegation\n\naccessdate=2008-06-21\n\npublisher= BBC News Online ]\n\nIn October 2008 a News of the World investigator, posing as a student on work experience, quoted him admitting to \"milking the system\" and doing very little work. [ cite web\n\nurl=http://www.newsoftheworld.co.uk/news/article4815.ece\n\ntitle=I can make shedloads as an MEP...it's cushy\n\naccessdate=2008-10-09\n\npublisher= News of the world ]\n\nExternal links\n\n* [ http://www.tomwisemep.co.uk/ Official web site ]\n\nReferences"}, {"url": "https://www.theguardian.com/politics/2009/nov/05/ex-mep-tom-wise-36000-expenses-scam", "page_content": "A former British MEP who masterminded a £36,000 expenses fiddle was facing jail today after he confessed during his trial.\n\nTom Wise, 61, had been charged with false accounting and money-laundering after an investigation into claims that he misused thousands of pounds of expenses.\n\nOriginally elected for the UK Independence party, Wise sat as an independent after being expelled from the party.\n\nThe former policeman, whose term of office in the European parliament came to an end in July this year, spent a year channelling taxpayers' cash into a bank account he secretly controlled.\n\nHe pretended the £3,000 \"secretarial assistance allowance\" he received every month was for his 62-year-old researcher Lindsay Jenkins.\n\nAfter paying her just £500, he spent the rest \"in support of his own interests\", London's Southwark crown court was told.\n\nMark Fenhalls, prosecuting, said: \"He used the funds, for example, to buy a car, to purchase fine wines and pay off some of his credit card debts.\"\n\nThe barrister said that when the fraud was eventually exposed by a national newspaper four years ago, the MEP promptly \"took steps to cancel the claim and repay the money\".\n\n\"He did so because he had been caught and was trying to minimise the trouble he was in,\" said counsel. \"Perhaps he hoped by swift repayment he could somehow head off further inquiry.\"\n\nHad it not been discovered, the scam could have lasted five years and netted £180,000.\n\nWise, of Ship Road, Leighton Buzzard, Bedfordshire, who was kicked out of Ukip over the scandal, denied false accounting between 14 October and 16 November 2004.\n\nBut, on the third day of his three-week trial and just before Ukip leader Nigel Farrage was to give evidence against him, Wise began a protracted round of discussions with his legal team.\n\nAfter several hours and an overnight adjournment to finalise details, the jury trying the case was discharged and the disgraced politician then admitted he was guilty after all.\n\nJenkins, of Queens Club Gardens, Barons Court, west London, had also been on trial, but was cleared.\n\nShe had denied both the false accounting charge and an allegation of using criminal property between 14 November 2004 and 1 November the following year.\n\nThe court heard she allegedly used \"just shy\" of £5,000 of the stolen money to publish a political work she had written.\n\nFenhalls explained that, in pleading guilty, Wise \"fully accepted responsibility for his actions and, by virtue of his plea and what he says, he has effectively exonerated Mrs Jenkins\".\n\nThe barrister said the former MEP also accepted documents he got Jenkins to sign to pull off the fraud were \"misleading and were in all probability blank when he asked her to sign them\".\n\n\"His acceptance of responsibility is fully consistent with the prosecution's opening and makes his basis of plea acceptable.\"\n\nHe told the court Jenkins's case had always been that the documents were blank, that she had \"trusted him\", and that the £500 Wise paid her each month was for work actually done.\n\n\"We are able to say ... there is no realistic prospect of conviction, nor, in fact, were it necessary, a public interest in continuing. In those circumstances we do not invite a trial against Mrs Jenkins and invite verdicts of not guilty against her.\"\n\nJudge Geoffrey Rivlin QC agreed, and formally ordered her acquittal on both counts, adding that her defence costs should be paid out of public funds.\n\nAfter quashing an outstanding money-laundering allegation against Wise, he told the former MEP he would be sentenced next Wednesday.\n\nHe said he could remain on bail in the meantime, but warned: \"It must, however, be fully understood that in terms of the ultimate sentence, nothing must be read into that.\"\n\nThe judge then added: \"I see Mr Wise nodding because he knows too well what the situation is.\"\n\nUkip's chairman, Paul Nuttall, said: \"Tom Wise broke faith with the UK Independence party, which is why the whip was withdrawn. We believe as a party it is vital as a matter of public confidence that justice is done and have no doubt that this will set a precedent for many Westminster MPs.\""}, {"url": "https://www.eadt.co.uk/news/21803546.tom-wise-charged-fraud/", "page_content": "Graham Dines\n\nAN East of England MEP targeted by a Sunday newspaper in an expenses expose is facing criminal charges.\n\nThe Crown Prosecution Service (CPS) has advised Bedfordshire Police to charge former UK Independence Party MEP Tom Wise, who now sits as an independent MEP for East Anglia, and his then researcher Lindsay Jenkins with one count each of false accounting and one count each of money laundering.\n\nMr Wise was elected to the European Parliament in 2004 as one of a dozen UKIP members, but is now a “non-attached” MEP hoping to fight the next euro-elections in June.\n\nThe charge relate to alleged offences between October 2004 and September 2005, when Mr Wise was still a UKIP member.\n\nDerek Frame, reviewing lawyer of the CPS Special Crime Division, said in a statement: \"'Following the publication of a news article in October 2005 relating to Mr Wise and Ms Jenkins, the European Anti-Fraud Office (OLAF) began an investigation into Mr Wise's use of allowances.\n\n\"These charges relate to alleged offences committed between October 2004 and September 2005. At the time Mr Wise was a Member of the European Parliament representing the United Kingdom Independence Party and Ms Jenkins was employed by him as a researcher.'\n\nMr Wise and his researcher are due to appear at City of Westminster Magistrates' Court on April 27."}, {"url": "https://www.thame.net/archives/50306", "page_content": "Tom Wyse – Independent – Thame North & District Council elections\n\nMY name is Tom Wyse and I was elected to Thame Council as a Independent 4 years ago.\n\nTom Wyse\n\nI have been very fortunate to have been born in Thame and to be able to enjoy living here all my life.\n\nMy adult children achieved degrees at University after receiving a first rate education in Thame schools.\n\nIn the last four years I have been a active member on the three main council committees, I am also the council representative for the very successful Thame Town Music Festival, in 2017 I had the great pleasure of opening the first Music Festival.\n\nIn 2017/2018 I had the privilege to be elected to the office of Mayor of Thame. In my duties as Mayor I was invited to many events in the town this made me very aware of the many kind local people who give their time and volunteer to make our town such a great place to live in. These people really are the backbone of our community.\n\nThame has grown from the sleepy little town of my childhood, the town has expanded and many new families have decided that our town is a great place to live in. We must welcome these families and encourage them to take part in all that Thame has to offer.\n\nI have always tried my best to work for the good of all the people of Thame and I believe it is not necessary to promote political parties on the local councils, the only criteria should be to make decisions for the benefit of Thame people.\n\nFor the above reasons I ask you to vote for me to be elected as a Independent councillor for Thame North ward and also as a Independent councillor for South Oxfordshire District Council."}, {"url": "http://www.oxfordhistory.org.uk/mayors/1714_1835/wise_thomas_1746.html", "page_content": "Thomas Wise 1707–1772) Mayor of Oxford 1746/7\n\nThomas Wise was born in Oxford on 4 November 1706 and baptised at St Michael-at-the-Northgate Church on 24 November. He was the son of Henry Wise and his first wife Mary Trollopp, who were married at St Aldate's Church on 29 April 1697. For more details about his parents and siblings, see the biography of his father, who was himself three times Mayor of Oxford.\n\nIn January 1722/3 when he was aged 16, Thomas was apprenticed as a mercer to his father.\n\nLeft: Portrait of Alderman Thomas Wise (wrongly dated 1738: perhaps 1758?),\n\nwhich hangs in the Council Chamber of the Town Hall\n\nIn September 1738 Thomas Wise (31) was chosen Mayor’s Child by the new Mayor, William Ives\n\nOn 3 September 1738 Wise was admitted free, and he later had his own mercer’s shop in Cornmarket.\n\nIn 1739 he was appointed a cloth-searcher; and in September 1741 he was elected Senior Bailiff.\n\nThomas's father Henry Wise died on 9 October 1741.\n\nAt some point Thomas Wise married a woman called Deborah, but the marriage has not been found. They do not appear to have had any children.\n\nIn July 1746 Wise was chosen as one of the eight Assistants, and in September that year he was elected Mayor of Oxford (for 1746/7), selecting John Phillips as his Child and William Cherry as his Chamberlain.\n\nOn 3 October 1755 Wise was elected an Alderman.\n\nBy 1758 Wise had moved from his Cornmarket shop: Jackson’s Oxford Journal reports that a Mrs Fowler had moved into his house in Cornmarket that year, and in 1760 that Henry Smith, mercer (former apprentice of John Austin, another Mayor) had opened at the shop in Cornmarket that was formerly kept by Alderman Wise.\n\nOn 20 September 1762 Thomas Wise was elected Mayor again, but refused to accept the office, paying the City Treasurer £50 as a fine for not serving.\n\nIn 1766 the City got into such debt that the council tried to sell its two parliamentary seats. As a result, the Mayor and ten councillors (including Alderman Wise) were committed to Newgate Prison in London for four days; they were discharged with a reprimand from the Speaker of the House of Commons on 10 February 1768.\n\nWise’s widowed sister, Mrs Elizabeth Lowe of Headington Hill, died on 2 October 1766.\n\nIn 1771, Thomas Wise was again chosen Mayor, but again refused, paying another fine of £50.\n\nBy 1772 Thomas Wise was living in a house in New Inn Hall Street. In that year a survey of every house in the city was taken in consequence of the Mileways Act of 1771, and according to H. E. Salter, the house of Alderman Wise, which had a frontage of 43 yards, 0 ft. and 10 in., occpied the site of the present 42, 44, 46, 48, and 50 New Inn Hall Street; and he also had a “garden, &c” on the site of 21 New Inn Hall Street, with a frontage of 12 yards, 2 ft. and 6 in.\n\nThomas Wise died in August 1772 at the age of 65. The plaque below says that he died on 13 August, but as he is recorded as having been buried inside the St Peter-in-the-East Church on 29 August, one of these dates may be wrong. He left all his estate to his wife Deborah.\n\nHis widow Deborah Wise died on 24 April 1777 at the age of 63 at her house in New Inn Hall Street and was buried with him on 1 May.\n\nAlthough they did not live in St Peter-in-the-East parish, they were buried inside that church with other members of Thomas Wise's family. There are two plaques on the wall of that church in memory of his family.\n\n\n\n\n\n\n\n(1) Thomas Wise's parents and siblings\n\nIuxta deponantur Reliquiae\n\nHENRICI WISE\n\nhuius Civitatis Aldermanni\n\nObiit Die 9o Octobris 1741\n\nAetatis suae 76.\n\nIuxta quoque requiescit Maria\n\nUxor eius, quae obiit Ian: 19o\n\n1752, Aetatis suae 76.\n\nNecnon Iohannes Henrici et Mariae Fius, qui ob; 14o\n\nNovembris 1728, Aet. sua 28.\n\nIn eodem etiam Sepulchro\n\nSita est ELIZ: LOWE\n\nHen: et Mar: Filia\n\nObiit Oct: 2, 1766\n\n[Nearby are deposited the remains of HENRY WISE, Alderman of this city, who died on 9 October 1741, aged 76.\n\nAlso nearby rests Mary his wife, who died on 19 January 1753, aged 76.\n\nAlso John the son of Henry and Mary who died on 14 November 1728, aged 28.\n\nELIZABETH LOWE, the daughter of Henry and Mary, who died 2 October 1766, was placed in the same tomb.]\n\n(2) Thomas Wise and his wife Deborah\n\nIn Sepulchro haud procul abhinc\n\nremoto, deponuntur Reliquiae\n\nTHOMÆ WISE\n\nHujus Civitatis Aldermanni\n\nHenrici et Mariae Filii\n\nObiit Aug: 13. 1772\n\nIn eodem etiam Tumulo\n\nQuicquid erat mortale deposuit\n\nDEBORAH\n\nuxor ejus Dilectissima\n\nApr: 24. 1777\n\n[In a tomb not far removed rom here are laid the remains of Thomas Wise, Alderman of this city and son of Henry and Maria, who died on 13 August 1772. In the same tomb DEBORAH, his most beloved wife, has laid down her mortal remains. Apr: 24. 1777.]\n\nSee also:"}, {"url": "https://open.lib.umn.edu/americangovernment/chapter/11-4-george-w-bush-reelected-in-2004/", "page_content": "Republican president George W. Bush ran for reelection against Democratic candidate Senator John Kerry (MA) and won. The campaign hinged on the candidates’ performance in battleground states where the race was close. Terrorism and the war in Iraq were key campaign issues.\n\nThe Nominating Campaign\n\nIn 2003, Governor Howard Dean (VT) was the Democratic presidential candidate most vociferously opposing the Iraq War. His stance and forceful rhetoric gave his campaign unprecedented success in obtaining funds and volunteers through the web (Teachout & Streeter, 2008). This accomplishment surprised the news media, generated reams of favorable coverage for him, helped him to raise funds, and transformed him from a marginal candidate to the front runner—all before a single vote was cast. But in the Iowa caucus, Governor Dean came in third behind Senators John Kerry of Massachusetts and John Edwards of North Carolina. That night, shouting over the din of his supporters, he committed to continuing his campaign and then let out a loud scream. The networks and cable news replayed the visual and shout, now described as “the scream heard around the political world,” hundreds of times, but without the loud audience noise over which he was attempting to be heard. He seemed a bit unbalanced and certainly not presidential. Parodies of “the scream” proliferated online.\n\nVideo Clip Howard Dean’s Scream (click to see video) The media endlessly replayed Democrat Howard Dean’s scream after the Iowa caucuses in 2004.\n\nAfter the Iowa caucuses the news media reported that Senator Kerry was likely to be nominated. Dean received less coverage than before, most of it negative. His support shrank by 50 percent in the polls, while Kerry’s popularity in the polls grew. Kerry won New Hampshire and other primaries, locking up the nomination on Super Tuesday, March 2.\n\nThe theme of the Democratic convention and John Kerry’s acceptance speech centered on Kerry’s status as a Vietnam war hero with the strength and determination to be president, commander in chief, and to wage the war on terrorism. Missing from the convention were a vision and program for the future of the country. There were few attacks on President George W. Bush or his record. For these reasons, Kerry did not experience much of a postconvention bounce.\n\nThe Republicans renominated the incumbents, President George W. Bush and Vice President Dick Cheney, who were unchallenged in their party’s caucuses and primaries. Their convention was held in New York City around the anniversary of the 9/11 terrorist attack on the World Trade Center and within staging distance of the ground zero site. The convention portrayed President Bush as a strong and decisive leader. Convention speakers attacked Kerry as weak, a waffler, and unqualified to be president. In his acceptance speech, President Bush laid out programs and policies he would pursue if reelected, which included security and defense in order to ensure that America “is safer.” In polls, his postconvention bounce ranged from 4 to 11 percent.\n\nThe Iraq War was an issue that posed problems for both candidates. For Bush, it was the continued insurgency against the US occupation and the failure to find weapons of mass destruction. He tried to finesse this by equating the war in Iraq with the war on terrorism. Kerry offered few alternatives to existing policy. He compounded his problem by saying in a speech at Marshall University about his vote for funding the war, “I actually did vote for the $87 billion before I voted against it.” This statement, at best confusing, at worst contradictory, was a major news story the next day and was pounced on by the Bush camp.\n\nThe Republicans had a wedge issue in same-sex marriage. For many months this subject had been prominent in the news. Eleven states had propositions on their ballots amending their constitutions to limit marriage to one man and one woman. An ad supporting this position used the sound of wedding bells to remind people that the amendment would protect traditional marriage. The issue primed people’s vote when evaluating the presidential candidates, attracting some Democratic voters to choose the Republican candidate. Nine of the eleven states went for President Bush."}, {"url": "https://alchetron.com/Tom-Wise", "page_content": "Thomas Harold Wise (born 13 May 1948) was an Independent and UKIP Member of the European Parliament (MEP) for the East of England. A former police officer, he was elected in 2004 as a member of the UK Independence Party but later had the whip withdrawn when allegations of misuse of parliamentary expenses surfaced in The Sunday Telegraph. Following an inquiry carried out by the European Anti-Fraud Office, Wise was formally charged with false accounting and money laundering by Bedfordshire Police. After initially pleading not guilty, he admitted the charges and was sentenced in November 2009 at Southwark Crown Court to a two-year term of imprisonment. He is thought to be the first MEP to be jailed for expenses fraud. Sentencing him, the judge said that Wise had engaged in \"deliberate and blatant dishonesty\" and had set about to defraud the European Parliament almost as soon as he was elected.\n\nEarly career\n\nBorn in Bournemouth, Wise attended Bournemouth School between 1959 and 1965, before completing a Diploma in Public Speaking in 1967. He served with Dorset Police before embarking on a career in the food distribution and processing industry. He became the UK Managing Director of a German herbs and spices company. From 1981 to 1989 he was a member of the Liberal Party.\n\nUKIP\n\nWise joined the United Kingdom Independence Party (UKIP) in 1997. He served as office manager to Jeffrey Titford MEP, during this period he worked on the rules governing MEPs' expenses and gained an expertise in the system which he would later use to his advantage. He was the fourth-placed candidate on UKIP's candidate list in for the European Parliament elections in 1999, and also stood as the party's candidate in the 1997, 2001 and 2005 general elections for the South West Bedfordshire constituency. In the 2005 general election, he came fourth with 4.2% of the votes cast.\n\nHe was elected as an MEP for UKIP in the 2004 European elections. He was UKIP's official spokesman on the Culture, Youth, Media and Sport Committee until his suspension by the party in February 2007. In his first speech to the Committee on 4 October 2004, Wise criticised the proposed budget and drew allusions with Nazi Propaganda Minister Joseph Goebbels. In his maiden speech to the Parliament on 16 December 2004, Wise blamed the European Union for creating unacceptable conditions for the transit of animals around Europe. Wise also spoke out against the Proposed directive on the patentability of computer-implemented inventions\n\nIndependent\n\nAfter losing the party whip in March 2007, Wise continued as an Independent within UKIP's Independence/Democracy parliamentary grouping pending the outcome of the fraud inquiry.\n\nDuring his time as an MEP, Wise disputed the genuine nature of the September 11th attacks. and labelled Russia-based businessman Alisher Usmanov, who is a shareholder of Arsenal F.C. a \"gangster and racketeer\"\n\nFollowing the decision to press criminal charges against him, Wise decided not to contest the 2009 European Parliament elections. He has however said that he wants to stand as an MP in the 2010 General Election.\n\nExposure\n\nOn 23 October 2005, a reporter for the Sunday Telegraph, Daniel Foggo, published an article accusing Wise of claiming £36,000 a year from the European Parliament in the name of his researcher, Lindsay Jenkins, while only passing on about a sixth of that amount to her. According to now-repealed Rules governing the payment of expenses and allowances to Members of the European Parliament, MEPs could claim up to £125,000 per year for assistants' wages, but this money must be paid either directly to the employees or to a third-party agent. The rules did not allow the funds to pass directly through the hands of MEPs themselves.\n\nFoggo later reported that Wise had supplied the European Parliament's Payments Office with a \"contract\" including her name and details, which stipulated that the £36,000 allowance should be paid into an account named \"Stags\". This account, held with the Co-operative Bank, was in fact Wise's own business account and its full name was \"T Wise trading as Stags\". The actual agreement between Wise and Jenkins stated that she would receive monthly \"retainer\" payments of £500 for advice and statistical research, with any extra work to be paid on top. Bank documents obtained by Foggo showed that between November 2004 and October 2005, Wise had paid £39,100 to this account, out of which Jenkins received £13,555. These funds were the only monies coming into the account. In another breach of the payment regulations, some of the £13,555 paid to Jenkins represented work done on behalf of other UKIP members, including party leader Nigel Farage who had agreed to fund the publication of a eurosceptic pamphlet by Jenkins. A further £19,000 was transferred from the account, some of which to pay off credit cards.\n\nOn 29 October, Wise admitted to breaching the rules and, to head off a scandal, agreed to repay £25,230. An internal UKIP inquiry was launched after the Parliament became aware of the affair, but no action was taken and the results of the investigation were kept secret. As Daniel Foggo later reported, UKIP's former leader, Roger Knapman, halted the inquiry after it uncovered serious wrongdoing, believing that the European Parliament would clear Wise. Farage told reporter Daniel Foggo that Wise \"had committed a simple, silly error by making himself a \"paying agent\" for his own staff.\"\n\nSuspension from UKIP\n\nOn 23 February 2007, party sources at UKIP discovered that the European Parliament had passed the affair to OLAF, the European Anti-Fraud Office. A UKIP meeting was convened in Brussels on 28 February 2007 at which Wise formally admitted to having spent £6,500 from the allowance on a dark green Peugeot 406 which he still drove, but refused to disclose how he had spent a further £13,000 of the funds. After a heated discussion, a decision was taken to remove the whip; both Knapman and fellow MEP Mike Nattrass challenged the decision and threatened to reconsider their futures in the party. Farage emphasised that, if cleared by the OLAF investigation, Wise would be welcomed back into the party, adding that he thought \"there is a great deal of public sympathy for us.\" Wise was however suspended by the party.\n\nFollowing his suspension, Wise spent a further £8,000 of the allowance in legal fees in contemplation of a libel case against Greg Lance-Watkins who had published claims on the Internet relating to Wise's activities. No action was ultimately brought against Lance-Watkins.\n\nNews of the World sting\n\nIn May 2008, the News of the World published details of a sting involving Tom Wise. A female reporter posing as a work experience student recorded Wise brazenly admitting in a Belgian bar that he had little idea of what his job as a Member of the European Parliament entailed, adding \"I don't know what an MEP's job is. No one's ever given me a job description. I've no idea what an MEP should or shouldn't do. So you make it up as you go along.\" He boasted of fiddling the Parliament's expenses system, stating \"Yes, I am milking the system [...] I have a simple philosophy. You and your parents are paying for me. Sorry, tough!\" The newspaper used its leading article to call for a change in the rules governing MEPs' expenses following the exposé.\n\nArrest and charges\n\nOn 20 June 2008, Wise was arrested by Bedfordshire Police's Economic Crime Unit on suspicion of making a false instrument, obtaining money by deception by transfer and converting criminal property. He was bailed until 29 October. Bedfordshire Police made the arrest after having been contacted by OLAF.\n\nOn 20 April 2009 the Crown Prosecution Service advised Bedfordshire Police to charge both Wise and Jenkins with one count each of false accounting contrary to the Theft Act 1968 and one count each of money laundering contrary to the Proceeds of Crime Act 2002. Both were scheduled to appear before the City of Westminster Magistrates' Court on in April 2009 to face the charges. Wise indicated that he was innocent and would fight the charges which carry a maximum 14-year jail term. He is thought to be the first MEP to face criminal charges over the misuse of parliamentary funds, and the second former UKIP MEP after Ashley Mote to have faced criminal charges during a parliamentary session.\n\nTrial and conviction\n\nWise appeared in court on 27 April 2009 and spoke only to confirm his name and plead not guilty. Jenkins also denied the charges. District Judge Daphne Wickham released both on conditional bail until 8 June. The case was transferred to Southwark Crown Court and charges specified: that Wise and Jenkins \"falsified a document, namely a contract for provision of services, an application for secretarial assistance allowance and invoices\". Also, that they used funds \"received from the European Parliament intended for use as payments for secretarial services.\"\n\nThe three-week trial began on 2 November 2009. Judge Geoffrey Rivlin QC heard the prosecution argue that Wise channelled parliamentary funds into an account he secretly controlled so that he could pay credit card debts and buy fine wines. He made separate payments of £2,228 and £1,260 to wine importers, and maintained the deception by asking Jenkins to sign blank documents which he completed later. But for his exposure, Wise would, according to prosecutors, have claimed up to £180,000.\n\nOn the third day of the trial, just before Nigel Farage was due to give evidence against him, Wise began several hours of negotiations with his legal team after which he changed his plea to guilty and said he was entirely to blame for the fraud. This resulted in Jenkins being acquitted. He was sentenced on 10 November 2009 to two years imprisonment, the sentence having been reduced by one year on account of his guilty plea. In sentencing him, Judge Geoffrey Rivlin declared that:\n\nIt is no exaggeration to say that you had hardly got your feet beneath your desk as an MEP before you were planning to defraud the parliament to which you were elected and the people you were elected to serve. This was very deliberate and blatant dishonesty. You did not fall into this offence as a result of some unfortunate combination of unforeseen circumstances which happened to suddenly present you with temptation. You knew the system of expenses inside out and this was a claim you devised and planned with some care.\n\nThe judge added that, in addition to jail, Wise would also have to pay £30,000 towards the prosecution's costs.\n\nPersonal life\n\nWise is married to Janet and, until his imprisonment, lived in Linslade near Leighton Buzzard in Bedfordshire. He has two grown-up children.\n\nWise has a developed interest in wines, having followed courses arranged by the Wine & Spirit Education Trust and has reached \"the level just below Master of Wine\". He has spoken of having a wine cellar containing 1,000 bottles of wine."}, {"url": "https://www.alreporter.com/2023/01/16/supreme-court-welcomes-justice-greg-cook-and-re-elected-justice-kelli-wise/", "page_content": "The Supreme Court of Alabama held an Investiture and Oath of Office ceremony Friday to welcome newly-elected Justice Gregory C. “Greg” Cook and re-elected Justice A. Kelli Wise. The Justices took their oaths of office at 2 p.m. in the Supreme Court Courtroom.\n\nJustice Cook was elected in November 2022 to fill the seat of Justice Michael F. Bolin, who retires this week after 18 years of service on the Supreme Court. Justice Wise was re-elected to a third term, having served on the Court since 2010.\n\nChief Justice Tom Parker, who will preside over the investiture ceremony, commented, “We welcome our new colleague Justice Greg Cook to our Court and we welcome back Justice Wise. We thank them both for their past service in the legal and judicial community, and confidently pray and believe that their future service will honor the Lord, the law, and the trust that the people of Alabama have placed in them.”\n\nAbout Justice Bolin’s departure, Chief Justice Parker added, “I wish Mike all the best in his retirement from the bench, although I expect he will stay active in service to his beloved State and Jefferson County. Mike and I joined this Court at the same time in 2005, so it will not be the same here without his formidable presence and voice on the Supreme Court. I thank him for his decades of service and for his friendship.”\n\nJustice Cook formally takes office and joins the Supreme Court on Tuesday, January 17, 2023."}], "Tom Wise resigned from UKIP in 2006 after being charged with false accounting and money laundering.": [{"url": "https://www.theguardian.com/politics/2009/nov/05/ex-mep-tom-wise-36000-expenses-scam", "page_content": "A former British MEP who masterminded a £36,000 expenses fiddle was facing jail today after he confessed during his trial.\n\nTom Wise, 61, had been charged with false accounting and money-laundering after an investigation into claims that he misused thousands of pounds of expenses.\n\nOriginally elected for the UK Independence party, Wise sat as an independent after being expelled from the party.\n\nThe former policeman, whose term of office in the European parliament came to an end in July this year, spent a year channelling taxpayers' cash into a bank account he secretly controlled.\n\nHe pretended the £3,000 \"secretarial assistance allowance\" he received every month was for his 62-year-old researcher Lindsay Jenkins.\n\nAfter paying her just £500, he spent the rest \"in support of his own interests\", London's Southwark crown court was told.\n\nMark Fenhalls, prosecuting, said: \"He used the funds, for example, to buy a car, to purchase fine wines and pay off some of his credit card debts.\"\n\nThe barrister said that when the fraud was eventually exposed by a national newspaper four years ago, the MEP promptly \"took steps to cancel the claim and repay the money\".\n\n\"He did so because he had been caught and was trying to minimise the trouble he was in,\" said counsel. \"Perhaps he hoped by swift repayment he could somehow head off further inquiry.\"\n\nHad it not been discovered, the scam could have lasted five years and netted £180,000.\n\nWise, of Ship Road, Leighton Buzzard, Bedfordshire, who was kicked out of Ukip over the scandal, denied false accounting between 14 October and 16 November 2004.\n\nBut, on the third day of his three-week trial and just before Ukip leader Nigel Farrage was to give evidence against him, Wise began a protracted round of discussions with his legal team.\n\nAfter several hours and an overnight adjournment to finalise details, the jury trying the case was discharged and the disgraced politician then admitted he was guilty after all.\n\nJenkins, of Queens Club Gardens, Barons Court, west London, had also been on trial, but was cleared.\n\nShe had denied both the false accounting charge and an allegation of using criminal property between 14 November 2004 and 1 November the following year.\n\nThe court heard she allegedly used \"just shy\" of £5,000 of the stolen money to publish a political work she had written.\n\nFenhalls explained that, in pleading guilty, Wise \"fully accepted responsibility for his actions and, by virtue of his plea and what he says, he has effectively exonerated Mrs Jenkins\".\n\nThe barrister said the former MEP also accepted documents he got Jenkins to sign to pull off the fraud were \"misleading and were in all probability blank when he asked her to sign them\".\n\n\"His acceptance of responsibility is fully consistent with the prosecution's opening and makes his basis of plea acceptable.\"\n\nHe told the court Jenkins's case had always been that the documents were blank, that she had \"trusted him\", and that the £500 Wise paid her each month was for work actually done.\n\n\"We are able to say ... there is no realistic prospect of conviction, nor, in fact, were it necessary, a public interest in continuing. In those circumstances we do not invite a trial against Mrs Jenkins and invite verdicts of not guilty against her.\"\n\nJudge Geoffrey Rivlin QC agreed, and formally ordered her acquittal on both counts, adding that her defence costs should be paid out of public funds.\n\nAfter quashing an outstanding money-laundering allegation against Wise, he told the former MEP he would be sentenced next Wednesday.\n\nHe said he could remain on bail in the meantime, but warned: \"It must, however, be fully understood that in terms of the ultimate sentence, nothing must be read into that.\"\n\nThe judge then added: \"I see Mr Wise nodding because he knows too well what the situation is.\"\n\nUkip's chairman, Paul Nuttall, said: \"Tom Wise broke faith with the UK Independence party, which is why the whip was withdrawn. We believe as a party it is vital as a matter of public confidence that justice is done and have no doubt that this will set a precedent for many Westminster MPs.\""}, {"url": "https://www.theguardian.com/politics/2009/sep/11/tom-wise-false-accounting-charge", "page_content": "A former British MEP today denied charges of false accounting and using criminal property.\n\nTom Wise, 61 – who used to represent Ukip but became an independent – was charged along with his 62-year-old former researcher Linday Jenkins.\n\nThe pair appeared at a 15-minute plea and case management hearing at Southwark crown court, in London, and spoke only to confirm their names and deny the charges.\n\nThe first alleges that they \"falsified a document, namely a contract for the provision of services and an application for secretarial assistance allowance and invoices\" between 14 December 2004 and 14 December 2005.\n\nThe second count claims that, during the same period, they received money \"from the European parliament intended for use as payments for secretarial services\".\n\nWise, of Leighton Buzzard, Bedfordshire, who has been an MEP for the East of England since 2004, and Jenkins, of west Kensington, west London, will return to court next Friday.\n\nA further directions hearing will then be held and a trial date fixed. They remain on bail."}, {"url": "https://www.thetimes.co.uk/article/mep-tom-wise-charged-with-fiddling-accounts-and-money-laundering-8bhdm600dlm", "page_content": "A Member of the European Parliament and his assistant have both been charged with false accounting and money laundering after an investigation into claims that they misused thousands of pounds of expenses.\n\nTom Wise, 60, who was hoping to stand for re-election in June, was elected for the UK Independence Party but now sits as an independent after being expelled from the party.\n\nSponsored\n\nHe and Lindsay Jenkins, his researcher, could face lengthy jail terms if found guilty.\n\nThe charges against Mr Wise, an MEP for the East of England, come less than two months before European elections for which an EU-wide survey has forecast a record low turnout. They follow a series of claims about the misuse of the generous expenses on offer in Brussels,"}, {"url": "https://www.eadt.co.uk/news/21803546.tom-wise-charged-fraud/", "page_content": "Graham Dines\n\nAN East of England MEP targeted by a Sunday newspaper in an expenses expose is facing criminal charges.\n\nThe Crown Prosecution Service (CPS) has advised Bedfordshire Police to charge former UK Independence Party MEP Tom Wise, who now sits as an independent MEP for East Anglia, and his then researcher Lindsay Jenkins with one count each of false accounting and one count each of money laundering.\n\nMr Wise was elected to the European Parliament in 2004 as one of a dozen UKIP members, but is now a “non-attached” MEP hoping to fight the next euro-elections in June.\n\nThe charge relate to alleged offences between October 2004 and September 2005, when Mr Wise was still a UKIP member.\n\nDerek Frame, reviewing lawyer of the CPS Special Crime Division, said in a statement: \"'Following the publication of a news article in October 2005 relating to Mr Wise and Ms Jenkins, the European Anti-Fraud Office (OLAF) began an investigation into Mr Wise's use of allowances.\n\n\"These charges relate to alleged offences committed between October 2004 and September 2005. At the time Mr Wise was a Member of the European Parliament representing the United Kingdom Independence Party and Ms Jenkins was employed by him as a researcher.'\n\nMr Wise and his researcher are due to appear at City of Westminster Magistrates' Court on April 27."}, {"url": "https://www.mirror.co.uk/news/uk-news/mep-tom-wise-charged-with-fiddling-389415", "page_content": "A British MEP was yesterday charged with fiddling taxpayers' cash.\n\nTom Wise, 60, now an independent, and his former researcher Lindsay Jenkins, 62, have been accused of false accounting and money laundering.\n\nThe alleged offences, took place between 2004 and 2005, when the MEP was representing UKIP.\n\nEx-police officer Wise, of Leighton Buzzard, Beds, and Jenkins, from London, were both bailed to appear at Westminster magistrates court on April 27.."}, {"url": "https://www.eadt.co.uk/news/ukip-suspends-euro-mp-tom-wise-7495684/", "page_content": "By Graham Dines\n\nONE of the region's MEPs was suspended from the UK Independence Party's European parliamentary group yesterday over allegations of financial irregularities.\n\nEuro MP Tom Wise is at the centre of a European Parliament inquiry into allegations he claimed money to pay one of his staff's wages, but did not pass on all the cash to her. He has been asked by the authorities in Brussels to give an explanation.\n\nIf officials are not satisfied with his answers, they are expected to pass the file to the police in Belgium and England.\n\nA statement from UKIP yesterday said Mr Wise had been suspended “for failure to provide information responding to alleged fraud irregularities that are now being investigated by OLAF (the European anti-fraud body).\n\n“The decision should in no way be seen as prejudicial to the outcome of the investigation.”\n\nSpeaking from Brussels yesterday, Mr Wise, who lives in Leighton Buzzard, Bedfordshire, said: “There is no comment to make and I have no comment to make.”\n\nThe party has no power to force Mr Wise to quit as an MEP. He will now sit as an Independent.\n\nMr Wise was elected in 2004 in second position from UKIP's list of candidates under the system of election to the European Parliament. Those elections resulted in the Conservatives winning three seats, UKIP two, and the Liberal Democrats and Labour one each.\n\nUnder European electoral regulations, there will be no by-election if Mr Wise quits. His place will be offered to one of the party's unsuccessful candidates, and the favourite will be Robin Page, who was in third position on the list behind Jeffrey Titford and Mr Wise.\n\nCambridgeshire farmer Mr Page, 63, who sprung to fame from his appearances on BBC2's One Man and His Dog series, said yesterday: “If it becomes necessary and I am asked, I will serve the remaining two years of Tom Wise's term as an MEP.”"}, {"url": "https://financialtransparency.org/mep-tom-wise-charged-with-fiddling-accounts-and-money-laundering/", "page_content": "The Times\n\nA Member of the European Parliament and his assistant have both been charged with false accounting and money laundering after an investigation into claims that they misused thousands of pounds of expenses.\n\nTom Wise, 60, who was hoping to stand for re-election in June, was elected for the UK Independence Party but now sits as an independent after being expelled from the party.\n\nContinue reading the article at TimesOnline.co.uk…"}, {"url": "https://www.wisbechstandard.co.uk/news/mep-charged-tom-wise-and-researcher-accused-of-false-accounting-5449224", "page_content": "MEP TOM Wise and his researcher have been charged with false accounting and money laundering after a police probe into claims they misused large amounts of public funds. Mr Wise, 60, an MEP for the Eastern Region that includes Cambridgeshire, was charged\n\nMEP TOM Wise and his researcher have been charged with false accounting and money laundering after a police probe into claims they misused large amounts of public funds.\n\nMr Wise, 60, an MEP for the Eastern Region that includes Cambridgeshire, was charged yesterday by the economic crime unit of Bedfordshire Police. His researcher Lindsay Jenkins, is also facing charges following the investigation into offences alleged to have occurred nearly five years ago.\n\nMr Wise has indicated through his solicitor Stephen Welfare that he will be defending the charges.\n\nMr Welfare felt it was \"scandalous\" the charges should be brought now: in two months times Mr Wise is proposing to stand again for the European Parliament as an independent candidate. He was elected last time on a UKIP ticket.\n\nDerek Frame, of the Crown Prosecution Service's special crime division, said the charges follow an investigation by a newspaper which led to a probe by the anti fraud unit in Europe who later handed evidence to Bedfordshire police.\n\nMr Wise and Ms Jenkins will appear at City of Westminster Magistrates' Court on April 27.\n\nMaximum sentence for false accounting is seven years and for money laundering it is 14 years."}, {"url": "https://www.theguardian.com/politics/2009/apr/20/mep-tom-wise-facing-fasle-accounting-charg", "page_content": "A British MEP targeted by a Sunday newspaper in an expenses expose is facing criminal charges, the Crown Prosecution Service said this afternoon.\n\nThe CPS has advised Bedfordshire police to charge former UK Independence party MEP Tom Wise, who now sits as an independent MEP for East Anglia, and his then researcher Lindsay Jenkins with one count each of false accounting and one count each of money laundering.\n\nWise was elected to the European parliament in 2004 as one of a dozen Ukip members, but is now a \"non-attached\" MEP hoping to fight the next euro-elections in June.\n\nHe was in the headlines in October last year when the News of the World quoted him as boasting that being in the European parliament was \"the opportunity to make shedloads of money\".\n\nThe charge relate to alleged offences between October 2004 and September 2005, when Wise was still a Ukip member.\n\nDerek Frame, reviewing lawyer of the CPS special crime division, said in a statement: \"Following the publication of a news article in October 2005 relating to Mr Wise and Ms Jenkins, the European Anti-Fraud Office (OLAF) began an investigation into Mr Wise's use of allowances.\n\n\"OLAF subsequently passed the investigation to Bedfordshire police economic crime unit for investigation.\n\n\"I received the full file on 20 March 2009 and carefully reviewed the evidence before making this decision.\n\n\"These charges relate to alleged offences committed between October 2004 and September 2005. At the time Mr Wise was a member of the European parliament representing the United Kingdom Independence party and Ms Jenkins was employed by him as a researcher.\"\n\nWise and his researcher are due to appear at City of Westminster magistrates' court on 27 April."}, {"url": "https://peoplepill.com/people/tom-wise/", "page_content": "Tom (Thomas) Harold Wise (born 13 May 1948 in Bournemouth) was an Independent and UKIP Member of the European Parliament (MEP) for the East of England. A former police officer, he was elected in 2004 as a member of the UK Independence Party but later had the whip withdrawn when allegations of misuse of parliamentary expenses surfaced in The Sunday Telegraph. Following an inquiry carried out by the European Anti-Fraud Office, Wise was formally charged with false accounting and money laundering by Bedfordshire Police. After initially pleading not guilty, he admitted the charges and was sentenced in November 2009 at Southwark Crown Court to a two-year term of imprisonment. He is thought to be the first MEP to be jailed for expenses fraud. Sentencing him, the judge said that Wise had engaged in \"deliberate and blatant dishonesty\" and had set about to defraud the European Parliament almost as soon as he was elected.\n\nEarly career\n\nBorn in Bournemouth on 13 May 1948, Wise attended Bournemouth School between 1959 and 1965, before completing a Diploma in Public Speaking in 1967. He served with Dorset Police before embarking on a career in the food distribution and processing industry. He became the UK Managing Director of a German herbs and spices company. From 1981 to 1989 he was a member of the Liberal Party.\n\nPolitical career\n\nUKIP\n\nWise joined the United Kingdom Independence Party (UKIP) in 1997. He served as office manager to Jeffrey Titford MEP, during this period he worked on the rules governing MEPs' expenses and gained an expertise in the system which he would later use to his advantage. He was the fourth-placed candidate on UKIP's candidate list in for the European Parliament elections in 1999, and also stood as the party's candidate in the 1997, 2001 and 2005 general elections for the South West Bedfordshire constituency. In the 2005 general election, he came fourth with 4.2% of the votes cast.\n\nHe was elected as an MEP for UKIP in the 2004 European elections. He was UKIP's official spokesman on the Culture, Youth, Media and Sport Committee until his suspension by the party in February 2007. In his first speech to the Committee on 4 October 2004, Wise criticised the proposed budget and drew allusions with Nazi Propaganda Minister Joseph Goebbels. In his maiden speech to the Parliament on 16 December 2004, Wise blamed the European Union for creating unacceptable conditions for the transit of animals around Europe. Wise also spoke out against the Proposed directive on the patentability of computer-implemented inventions\n\nIndependent\n\nAfter losing the party whip in March 2007, Wise continued as an Independent within UKIP's Independence/Democracy parliamentary grouping pending the outcome of the fraud inquiry.\n\nDuring his time as an MEP, Wise disputed the genuine nature of the September 11th attacks. and labelled Russia-based businessman Alisher Usmanov a \"gangster and racketeer\"\n\nFollowing the decision to press criminal charges against him, Wise decided not to contest the 2009 European Parliament elections. He has however said that he wants to stand as an MP in the 2010 General Election.\n\nFraud conviction\n\nExposure\n\nOn 23 October 2005, a reporter for the Sunday Telegraph, Daniel Foggo, published an article accusing Wise of claiming £36,000 a year from the European Parliament in the name of his researcher, Lindsay Jenkins, while only passing on about a sixth of that amount to her. According to now-repealed Rules governing the payment of expenses and allowances to Members of the European Parliament, MEPs could claim up to £125,000 per year for assistants' wages, but this money must be paid either directly to the employees or to a third-party agent. The rules did not allow the funds to pass directly through the hands of MEPs themselves.\n\nFoggo later reported that Wise had supplied the European Parliament's Payments Office with a \"contract\" including her name and details, which stipulated that the £36,000 allowance should be paid into an account named \"Stags\". This account, held with the Co-operative Bank, was in fact Wise's own business account and its full name was \"T Wise trading as Stags\". The actual agreement between Wise and Jenkins stated that she would receive monthly \"retainer\" payments of £500 for advice and statistical research, with any extra work to be paid on top. Bank documents obtained by Foggo showed that between November 2004 and October 2005, Wise had paid £39,100 to this account, out of which Jenkins received £13,555. These funds were the only monies coming into the account. In another breach of the payment regulations, some of the £13,555 paid to Jenkins represented work done on behalf of other UKIP members, including party leader Nigel Farage who had agreed to fund the publication of a eurosceptic pamphlet by Jenkins. A further £19,000 was transferred from the account, some of which to pay off credit cards.\n\nOn 29 October, Wise admitted to breaching the rules and, to head off a scandal, agreed to repay £25,230. An internal UKIP inquiry was launched after the Parliament became aware of the affair, but no action was taken and the results of the investigation were kept secret. As Daniel Foggo later reported, UKIP's former leader, Roger Knapman, halted the inquiry after it uncovered serious wrongdoing, believing that the European Parliament would clear Wise. Farage told reporter Daniel Foggo that Wise \"had committed a simple, silly error by making himself a \"paying agent\" for his own staff.\"\n\nSuspension from UKIP\n\nOn 23 February 2007, party sources at UKIP discovered that the European Parliament had passed the affair to OLAF, the European Anti-Fraud Office. A UKIP meeting was convened in Brussels on 28 February 2007 at which Wise formally admitted to having spent £6,500 from the allowance on a dark green Peugeot 406 which he still drove, but refused to disclose how he had spent a further £13,000 of the funds. After a heated discussion, a decision was taken to remove the whip; both Knapman and fellow MEP Mike Nattrass challenged the decision and threatened to reconsider their futures in the party. Farage emphasised that, if cleared by the OLAF investigation, Wise would be welcomed back into the party, adding that he thought \"there is a great deal of public sympathy for us.\" Wise was however suspended by the party.\n\nFollowing his suspension, Wise spent a further £8,000 of the allowance in legal fees in contemplation of a libel case against Greg Lance-Watkins who had published claims on the Internet relating to Wise's activities. No action was ultimately brought against Lance-Watkins.\n\nNews of the World sting\n\nIn May 2008, the News of the World published details of a sting involving Tom Wise. A female reporter posing as a work experience student recorded Wise brazenly admitting in a Belgian bar that he had little idea of what his job as a Member of the European Parliament entailed, adding \"I don't know what an MEP's job is. No one's ever given me a job description. I've no idea what an MEP should or shouldn't do. So you make it up as you go along.\" He boasted of fiddling the Parliament's expenses system, stating \"Yes, I am milking the system [...] I have a simple philosophy. You and your parents are paying for me. Sorry, tough!\" The newspaper used its leading article to call for a change in the rules governing MEPs' expenses following the exposé.\n\nArrest and charges\n\nOn 20 June 2008, Wise was arrested by Bedfordshire Police's Economic Crime Unit on suspicion of making a false instrument, obtaining money by deception by transfer and converting criminal property. He was bailed until 29 October. Bedfordshire Police made the arrest after having been contacted by OLAF.\n\nOn 20 April 2009 the Crown Prosecution Service advised Bedfordshire Police to charge both Wise and Jenkins with one count each of false accounting contrary to the Theft Act 1968 and one count each of money laundering contrary to the Proceeds of Crime Act 2002. Both were scheduled to appear before the City of Westminster Magistrates' Court on in April 2009 to face the charges. Wise indicated that he was innocent and would fight the charges which carry a maximum 14-year jail term. He is thought to be the first MEP to face criminal charges over the misuse of parliamentary funds, and the second former UKIP MEP after Ashley Mote to have faced criminal charges during a parliamentary session.\n\nTrial and conviction\n\nWise appeared in court on 27 April 2009 and spoke only to confirm his name and plead not guilty. Jenkins also denied the charges. District Judge Daphne Wickham released both on conditional bail until 8 June. The case was transferred to Southwark Crown Court and charges specified: that Wise and Jenkins \"falsified a document, namely a contract for provision of services, an application for secretarial assistance allowance and invoices\". Also, that they used funds \"received from the European Parliament intended for use as payments for secretarial services.\"\n\nThe three-week trial began on 2 November 2009. Judge Geoffrey Rivlin QC heard the prosecution argue that Wise channelled parliamentary funds into an account he secretly controlled so that he could pay credit card debts and buy fine wines. He made separate payments of £2,228 and £1,260 to wine importers, and maintained the deception by asking Jenkins to sign blank documents which he completed later. But for his exposure, Wise would, according to prosecutors, have claimed up to £180,000.\n\nOn the third day of the trial, just before Nigel Farage was due to give evidence against him, Wise began several hours of negotiations with his legal team after which he changed his plea to guilty and said he was entirely to blame for the fraud. This resulted in Jenkins being acquitted. He was sentenced on 10 November 2009 to two years imprisonment, the sentence having been reduced by one year on account of his guilty plea. In sentencing him, Judge Geoffrey Rivlin declared that:\n\nIt is no exaggeration to say that you had hardly got your feet beneath your desk as an MEP before you were planning to defraud the parliament to which you were elected and the people you were elected to serve. This was very deliberate and blatant dishonesty. You did not fall into this offence as a result of some unfortunate combination of unforeseen circumstances which happened to suddenly present you with temptation. You knew the system of expenses inside out and this was a claim you devised and planned with some care.\n\nThe judge added that, in addition to jail, Wise would also have to pay £30,000 towards the prosecution's costs.\n\nPersonal life\n\nWise is married to Janet and, until his imprisonment, lived in Linslade near Leighton Buzzard in Bedfordshire. He has two grown-up children.\n\nWise has a developed interest in wines, having followed courses arranged by the Wine & Spirit Education Trust and has reached \"the level just below Master of Wine\". He has spoken of having a wine cellar containing 1,000 bottles of wine."}]}