{"Tom Wise was born in London.": [{"url": "https://prabook.com/web/thomas.wise/3763095", "page_content": "Thomas Wise\n\nActor playwright\n\nMarch 23, 1865 (age 62) Faversham, England, United Kingdom\n\nHe began to act at eighteen, picking up what jobs he could on the coast, in variety shows. On August 27, 1883, while he was traveling with \"Ingham's Combination Troupe\" (seven people), the coach which carried them rolled down an embankment in the mountains. In 1885 William Gillette saw him act in San Francisco, and brought him east in The Private Secretary, but he got no nearer Broadway than the Grand Opera House on Eighth Avenue. He did not reach Broadway till 1888, when he appeared there in Lost in New York. From that time, he was a familiar figure in the New York theatre, filling a niche of his own, in farce-comedy especially. During the nineties he was often seen in the farces of George Broadhurst, and in 1899 appeared in The Wrong Mr. Wright in London. Among the plays he acted in during this decade were Gloriana (1892), On the Mississippi (1894), The War of Wealth, The House That Jack Built, and Are You a Mason? In 1901 he acted with Arnold Daly at Wallack's Theatre. The appearances with Daly were followed by Vivian's Papas (1903), Mrs. Temple's Telegram and The Prince Chap (1905), and The Little Cherub (1906), with Hattie Williams. In 1907 he was in a musical comedy called The Lady from Lane's, and the following season in Miss Hook of Holland. In 1908 he appeared as co-star with Douglas Fairbanks in a play written by himself and Harrison Rhodes, A Gentleman from Mississippi, a political comedy. He then wrote, again with Rhodes, and acted in a play called An Old New Yorker (1911). In the same year he and Rhodes wrote and produced a play called The Greatest Show on Earth, which was followed by a revival of Lights o' London. In the autumn of 1911 he acted with John Barrymore in Uncle Sam, in 1912 in Captain Whittaker's Place, by Joseph Lincoln, in 1913 in The Silver Wedding, and in 1914 in Edward Sheldon's dramatization of The Song of Songs. In 1916 he was back in a more congenial play, taking the place of James K. Hackett as Falstaff in The Merry Wives of Windsor, when Hackett, who had produced the play with elaborate sets by Joseph Urban, fell ill. After co-starring with William Courtenay in 1917 in Lee Dodd's Comedy, Pals First, in September 1918 he realized an ambition to impersonate P. T. Barnum, in a play called Mr. Barnum, written by himself and Harrison Rhodes. Later appearances were in Cappy Ricks (1919), as Sir Oliver in the Players' Club revival of The School for Scandal (June 1923), as Sir Anthony in The Rivals, with Mrs. Fiske (1924 - 1925), in The Adorable Liar (1926), and with Eleanor Painter in The Nightingale (1927). His later years were made difficult by illness. He made his last appearance in Chicago, in Behold This Dreamer, on October 31, 1927. He died on March 21, 1928, in New York."}, {"url": "https://peoplepill.com/people/tom-wise/", "page_content": "Tom (Thomas) Harold Wise (born 13 May 1948 in Bournemouth) was an Independent and UKIP Member of the European Parliament (MEP) for the East of England. A former police officer, he was elected in 2004 as a member of the UK Independence Party but later had the whip withdrawn when allegations of misuse of parliamentary expenses surfaced in The Sunday Telegraph. Following an inquiry carried out by the European Anti-Fraud Office, Wise was formally charged with false accounting and money laundering by Bedfordshire Police. After initially pleading not guilty, he admitted the charges and was sentenced in November 2009 at Southwark Crown Court to a two-year term of imprisonment. He is thought to be the first MEP to be jailed for expenses fraud. Sentencing him, the judge said that Wise had engaged in \"deliberate and blatant dishonesty\" and had set about to defraud the European Parliament almost as soon as he was elected.\n\nEarly career\n\nBorn in Bournemouth on 13 May 1948, Wise attended Bournemouth School between 1959 and 1965, before completing a Diploma in Public Speaking in 1967. He served with Dorset Police before embarking on a career in the food distribution and processing industry. He became the UK Managing Director of a German herbs and spices company. From 1981 to 1989 he was a member of the Liberal Party.\n\nPolitical career\n\nUKIP\n\nWise joined the United Kingdom Independence Party (UKIP) in 1997. He served as office manager to Jeffrey Titford MEP, during this period he worked on the rules governing MEPs' expenses and gained an expertise in the system which he would later use to his advantage. He was the fourth-placed candidate on UKIP's candidate list in for the European Parliament elections in 1999, and also stood as the party's candidate in the 1997, 2001 and 2005 general elections for the South West Bedfordshire constituency. In the 2005 general election, he came fourth with 4.2% of the votes cast.\n\nHe was elected as an MEP for UKIP in the 2004 European elections. He was UKIP's official spokesman on the Culture, Youth, Media and Sport Committee until his suspension by the party in February 2007. In his first speech to the Committee on 4 October 2004, Wise criticised the proposed budget and drew allusions with Nazi Propaganda Minister Joseph Goebbels. In his maiden speech to the Parliament on 16 December 2004, Wise blamed the European Union for creating unacceptable conditions for the transit of animals around Europe. Wise also spoke out against the Proposed directive on the patentability of computer-implemented inventions\n\nIndependent\n\nAfter losing the party whip in March 2007, Wise continued as an Independent within UKIP's Independence/Democracy parliamentary grouping pending the outcome of the fraud inquiry.\n\nDuring his time as an MEP, Wise disputed the genuine nature of the September 11th attacks. and labelled Russia-based businessman Alisher Usmanov a \"gangster and racketeer\"\n\nFollowing the decision to press criminal charges against him, Wise decided not to contest the 2009 European Parliament elections. He has however said that he wants to stand as an MP in the 2010 General Election.\n\nFraud conviction\n\nExposure\n\nOn 23 October 2005, a reporter for the Sunday Telegraph, Daniel Foggo, published an article accusing Wise of claiming £36,000 a year from the European Parliament in the name of his researcher, Lindsay Jenkins, while only passing on about a sixth of that amount to her. According to now-repealed Rules governing the payment of expenses and allowances to Members of the European Parliament, MEPs could claim up to £125,000 per year for assistants' wages, but this money must be paid either directly to the employees or to a third-party agent. The rules did not allow the funds to pass directly through the hands of MEPs themselves.\n\nFoggo later reported that Wise had supplied the European Parliament's Payments Office with a \"contract\" including her name and details, which stipulated that the £36,000 allowance should be paid into an account named \"Stags\". This account, held with the Co-operative Bank, was in fact Wise's own business account and its full name was \"T Wise trading as Stags\". The actual agreement between Wise and Jenkins stated that she would receive monthly \"retainer\" payments of £500 for advice and statistical research, with any extra work to be paid on top. Bank documents obtained by Foggo showed that between November 2004 and October 2005, Wise had paid £39,100 to this account, out of which Jenkins received £13,555. These funds were the only monies coming into the account. In another breach of the payment regulations, some of the £13,555 paid to Jenkins represented work done on behalf of other UKIP members, including party leader Nigel Farage who had agreed to fund the publication of a eurosceptic pamphlet by Jenkins. A further £19,000 was transferred from the account, some of which to pay off credit cards.\n\nOn 29 October, Wise admitted to breaching the rules and, to head off a scandal, agreed to repay £25,230. An internal UKIP inquiry was launched after the Parliament became aware of the affair, but no action was taken and the results of the investigation were kept secret. As Daniel Foggo later reported, UKIP's former leader, Roger Knapman, halted the inquiry after it uncovered serious wrongdoing, believing that the European Parliament would clear Wise. Farage told reporter Daniel Foggo that Wise \"had committed a simple, silly error by making himself a \"paying agent\" for his own staff.\"\n\nSuspension from UKIP\n\nOn 23 February 2007, party sources at UKIP discovered that the European Parliament had passed the affair to OLAF, the European Anti-Fraud Office. A UKIP meeting was convened in Brussels on 28 February 2007 at which Wise formally admitted to having spent £6,500 from the allowance on a dark green Peugeot 406 which he still drove, but refused to disclose how he had spent a further £13,000 of the funds. After a heated discussion, a decision was taken to remove the whip; both Knapman and fellow MEP Mike Nattrass challenged the decision and threatened to reconsider their futures in the party. Farage emphasised that, if cleared by the OLAF investigation, Wise would be welcomed back into the party, adding that he thought \"there is a great deal of public sympathy for us.\" Wise was however suspended by the party.\n\nFollowing his suspension, Wise spent a further £8,000 of the allowance in legal fees in contemplation of a libel case against Greg Lance-Watkins who had published claims on the Internet relating to Wise's activities. No action was ultimately brought against Lance-Watkins.\n\nNews of the World sting\n\nIn May 2008, the News of the World published details of a sting involving Tom Wise. A female reporter posing as a work experience student recorded Wise brazenly admitting in a Belgian bar that he had little idea of what his job as a Member of the European Parliament entailed, adding \"I don't know what an MEP's job is. No one's ever given me a job description. I've no idea what an MEP should or shouldn't do. So you make it up as you go along.\" He boasted of fiddling the Parliament's expenses system, stating \"Yes, I am milking the system [...] I have a simple philosophy. You and your parents are paying for me. Sorry, tough!\" The newspaper used its leading article to call for a change in the rules governing MEPs' expenses following the exposé.\n\nArrest and charges\n\nOn 20 June 2008, Wise was arrested by Bedfordshire Police's Economic Crime Unit on suspicion of making a false instrument, obtaining money by deception by transfer and converting criminal property. He was bailed until 29 October. Bedfordshire Police made the arrest after having been contacted by OLAF.\n\nOn 20 April 2009 the Crown Prosecution Service advised Bedfordshire Police to charge both Wise and Jenkins with one count each of false accounting contrary to the Theft Act 1968 and one count each of money laundering contrary to the Proceeds of Crime Act 2002. Both were scheduled to appear before the City of Westminster Magistrates' Court on in April 2009 to face the charges. Wise indicated that he was innocent and would fight the charges which carry a maximum 14-year jail term. He is thought to be the first MEP to face criminal charges over the misuse of parliamentary funds, and the second former UKIP MEP after Ashley Mote to have faced criminal charges during a parliamentary session.\n\nTrial and conviction\n\nWise appeared in court on 27 April 2009 and spoke only to confirm his name and plead not guilty. Jenkins also denied the charges. District Judge Daphne Wickham released both on conditional bail until 8 June. The case was transferred to Southwark Crown Court and charges specified: that Wise and Jenkins \"falsified a document, namely a contract for provision of services, an application for secretarial assistance allowance and invoices\". Also, that they used funds \"received from the European Parliament intended for use as payments for secretarial services.\"\n\nThe three-week trial began on 2 November 2009. Judge Geoffrey Rivlin QC heard the prosecution argue that Wise channelled parliamentary funds into an account he secretly controlled so that he could pay credit card debts and buy fine wines. He made separate payments of £2,228 and £1,260 to wine importers, and maintained the deception by asking Jenkins to sign blank documents which he completed later. But for his exposure, Wise would, according to prosecutors, have claimed up to £180,000.\n\nOn the third day of the trial, just before Nigel Farage was due to give evidence against him, Wise began several hours of negotiations with his legal team after which he changed his plea to guilty and said he was entirely to blame for the fraud. This resulted in Jenkins being acquitted. He was sentenced on 10 November 2009 to two years imprisonment, the sentence having been reduced by one year on account of his guilty plea. In sentencing him, Judge Geoffrey Rivlin declared that:\n\nIt is no exaggeration to say that you had hardly got your feet beneath your desk as an MEP before you were planning to defraud the parliament to which you were elected and the people you were elected to serve. This was very deliberate and blatant dishonesty. You did not fall into this offence as a result of some unfortunate combination of unforeseen circumstances which happened to suddenly present you with temptation. You knew the system of expenses inside out and this was a claim you devised and planned with some care.\n\nThe judge added that, in addition to jail, Wise would also have to pay £30,000 towards the prosecution's costs.\n\nPersonal life\n\nWise is married to Janet and, until his imprisonment, lived in Linslade near Leighton Buzzard in Bedfordshire. He has two grown-up children.\n\nWise has a developed interest in wines, having followed courses arranged by the Wine & Spirit Education Trust and has reached \"the level just below Master of Wine\". He has spoken of having a wine cellar containing 1,000 bottles of wine."}, {"url": "https://happyhappybirthday.net/en/age/tom-wise-person_uqeqalx", "page_content": "Tom Wise\n\nBritish politician (born 1948) – Tom Wise was born in Bournemouth (town in the ceremonial county of Dorset, England) on May 13th, 1948 and is 75 years old today.\n\nAge How old is Tom Wise? 75 Tom Wise is 75 years old.\n\nBiographical data\n\nTom Wise\n\nBirthday When was Tom Wise born? Tom Wise was born on May 13th, 1948.\n\nPlace of Birth Where was Tom Wise born? Bournemouth (town in the ceremonial county of Dorset, England).\n\n♉ ♉ Zodiac What is the zodiac sign of Tom Wise? Tom Wise was born in the zodiac sign Taurus (The Bull)."}, {"url": "https://www.celebsagewiki.com/thomas-a-wise", "page_content": "Age, Biography and Wiki\n\nThomas A. Wise was born on 23 March, 1865 in Faversham, Kent, England, UK, is an Actor, Writer. Discover Thomas A. Wise's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of Thomas A. Wise networth?\n\nPopular As N/A Occupation actor,writer Age 63 years old Zodiac Sign Aries Born 23 March 1865 Birthday 23 March Birthplace Faversham, Kent, England, UK Date of death 21 March, 1928 Died Place New York City, New York, USA Nationality UK\n\nWe recommend you to check the complete list of Famous People born on 23 March. He is a member of famous Actor with the age 63 years old group.\n\nThomas A. Wise Height, Weight & Measurements\n\nAt 63 years old, Thomas A. Wise height not available right now. We will update Thomas A. Wise's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nWho Is Thomas A. Wise's Wife?\n\nHis wife is Gertrude Whitty (? - ?)\n\nFamily Parents Not Available Wife Gertrude Whitty (? - ?) Sibling Not Available Children Not Available\n\nThomas A. Wise Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Thomas A. Wise worth at the age of 63 years old? Thomas A. Wise’s income source is mostly from being a successful Actor. He is from UK. We have estimated Thomas A. Wise's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Actor\n\nThomas A. Wise Social Network\n\nInstagram Linkedin Twitter Facebook Wikipedia Imdb\n\nTimeline"}, {"url": "http://www.oxfordhistory.org.uk/mayors/1714_1835/wise_thomas_1746.html", "page_content": "Thomas Wise 1707–1772) Mayor of Oxford 1746/7\n\nThomas Wise was born in Oxford on 4 November 1706 and baptised at St Michael-at-the-Northgate Church on 24 November. He was the son of Henry Wise and his first wife Mary Trollopp, who were married at St Aldate's Church on 29 April 1697. For more details about his parents and siblings, see the biography of his father, who was himself three times Mayor of Oxford.\n\nIn January 1722/3 when he was aged 16, Thomas was apprenticed as a mercer to his father.\n\nLeft: Portrait of Alderman Thomas Wise (wrongly dated 1738: perhaps 1758?),\n\nwhich hangs in the Council Chamber of the Town Hall\n\nIn September 1738 Thomas Wise (31) was chosen Mayor’s Child by the new Mayor, William Ives\n\nOn 3 September 1738 Wise was admitted free, and he later had his own mercer’s shop in Cornmarket.\n\nIn 1739 he was appointed a cloth-searcher; and in September 1741 he was elected Senior Bailiff.\n\nThomas's father Henry Wise died on 9 October 1741.\n\nAt some point Thomas Wise married a woman called Deborah, but the marriage has not been found. They do not appear to have had any children.\n\nIn July 1746 Wise was chosen as one of the eight Assistants, and in September that year he was elected Mayor of Oxford (for 1746/7), selecting John Phillips as his Child and William Cherry as his Chamberlain.\n\nOn 3 October 1755 Wise was elected an Alderman.\n\nBy 1758 Wise had moved from his Cornmarket shop: Jackson’s Oxford Journal reports that a Mrs Fowler had moved into his house in Cornmarket that year, and in 1760 that Henry Smith, mercer (former apprentice of John Austin, another Mayor) had opened at the shop in Cornmarket that was formerly kept by Alderman Wise.\n\nOn 20 September 1762 Thomas Wise was elected Mayor again, but refused to accept the office, paying the City Treasurer £50 as a fine for not serving.\n\nIn 1766 the City got into such debt that the council tried to sell its two parliamentary seats. As a result, the Mayor and ten councillors (including Alderman Wise) were committed to Newgate Prison in London for four days; they were discharged with a reprimand from the Speaker of the House of Commons on 10 February 1768.\n\nWise’s widowed sister, Mrs Elizabeth Lowe of Headington Hill, died on 2 October 1766.\n\nIn 1771, Thomas Wise was again chosen Mayor, but again refused, paying another fine of £50.\n\nBy 1772 Thomas Wise was living in a house in New Inn Hall Street. In that year a survey of every house in the city was taken in consequence of the Mileways Act of 1771, and according to H. E. Salter, the house of Alderman Wise, which had a frontage of 43 yards, 0 ft. and 10 in., occpied the site of the present 42, 44, 46, 48, and 50 New Inn Hall Street; and he also had a “garden, &c” on the site of 21 New Inn Hall Street, with a frontage of 12 yards, 2 ft. and 6 in.\n\nThomas Wise died in August 1772 at the age of 65. The plaque below says that he died on 13 August, but as he is recorded as having been buried inside the St Peter-in-the-East Church on 29 August, one of these dates may be wrong. He left all his estate to his wife Deborah.\n\nHis widow Deborah Wise died on 24 April 1777 at the age of 63 at her house in New Inn Hall Street and was buried with him on 1 May.\n\nAlthough they did not live in St Peter-in-the-East parish, they were buried inside that church with other members of Thomas Wise's family. There are two plaques on the wall of that church in memory of his family.\n\n\n\n\n\n\n\n(1) Thomas Wise's parents and siblings\n\nIuxta deponantur Reliquiae\n\nHENRICI WISE\n\nhuius Civitatis Aldermanni\n\nObiit Die 9o Octobris 1741\n\nAetatis suae 76.\n\nIuxta quoque requiescit Maria\n\nUxor eius, quae obiit Ian: 19o\n\n1752, Aetatis suae 76.\n\nNecnon Iohannes Henrici et Mariae Fius, qui ob; 14o\n\nNovembris 1728, Aet. sua 28.\n\nIn eodem etiam Sepulchro\n\nSita est ELIZ: LOWE\n\nHen: et Mar: Filia\n\nObiit Oct: 2, 1766\n\n[Nearby are deposited the remains of HENRY WISE, Alderman of this city, who died on 9 October 1741, aged 76.\n\nAlso nearby rests Mary his wife, who died on 19 January 1753, aged 76.\n\nAlso John the son of Henry and Mary who died on 14 November 1728, aged 28.\n\nELIZABETH LOWE, the daughter of Henry and Mary, who died 2 October 1766, was placed in the same tomb.]\n\n(2) Thomas Wise and his wife Deborah\n\nIn Sepulchro haud procul abhinc\n\nremoto, deponuntur Reliquiae\n\nTHOMÆ WISE\n\nHujus Civitatis Aldermanni\n\nHenrici et Mariae Filii\n\nObiit Aug: 13. 1772\n\nIn eodem etiam Tumulo\n\nQuicquid erat mortale deposuit\n\nDEBORAH\n\nuxor ejus Dilectissima\n\nApr: 24. 1777\n\n[In a tomb not far removed rom here are laid the remains of Thomas Wise, Alderman of this city and son of Henry and Maria, who died on 13 August 1772. In the same tomb DEBORAH, his most beloved wife, has laid down her mortal remains. Apr: 24. 1777.]\n\nSee also:"}, {"url": "https://buzzlearn.com/tom-wise/", "page_content": "Learn about Tom Wise Net Worth, Biography, Age, Birthday, Height, Early Life, Family, Dating, Partner, Wiki, and Facts.\n\nWho is Tom Wise:\n\nTom Wise is a famous British politician. He was born on May 13, 1948 and his birthplace is Bournemouth, Hampshire.\n\nOn Buzzlearn.com, Tom is listed as a successful Politician who was born in the year of 1948. He is also ranked in the richest person list from United Kingdom. His first name is “Tom” and his last name is “Wise”.\n\nBiography:\n\nBio / Wiki Full Name Tom Wise Occupation Politician Age 75 Date of Birth May 13, 1948 Place of Birth Bournemouth, Hampshire Star Sign Taurus Country United Kingdom Gender Male\n\nBirthday, Age & Zodiac Sign:\n\nTom Wise’s birthday is on 13-May-1948 and was born on Thursday. He is 75 years old. Tom sun sign is Taurus and his birth flower is Lily Of The Valley & Hawthorn.\n\nBirthdate 13-May Day of Birth Thursday Year of Birth 1948 Birth Sign Taurus Birth Sign Duality Passive Birth Sign Modality & Element Fixed Earth Opposite Sign Scorpio\n\nHeight, Weight & Physical Stats:\n\nBody measurements informations are given below:\n\nHeight N/A Weight N/A Bust N/A Waist N/A Hip N/A Hair Color N/A Eye Color N/A Shoe Size N/A\n\nEarly Life and Family:\n\nFamily Information Parents Name Not known Spouse Name Not known Children Name Unknown Number of Children(s) Not available Partner Name N/A Relative(s) Name N/A\n\nEducation:\n\nEducation N/A Alma mater Bournemouth School University N/A College N/A High School N/A School N/A\n\nTom Wise Net Worth:\n\nTom Wise’s net worth or net income is estimated to be $1 million – $4 million dollars. He has made such an amount of wealth from his primary career as a Politician.\n\nNet Worth $1 million – $4 million Annual Salary Under review Source of Income Politician Verification Status of Wealth Not verified\n\nDead or Alive?\n\nAccording to our database, Tom Wise is still alive.\n\nQuick Facts:\n\nHere are some interesting facts about Tom Wise:\n\n* He is originated from United Kingdom.\n\n* His Star sign is Taurus and zodiac sign element is Earth.\n\n* His duality is Passive and opposite sun sign is Scorpio.\n\nFrequently Asked Questions (FAQs):\n\nWhy is Tom Wise famous? He is famous for being a successful Politician. Where is he from? He is from United Kingdom. How tall is he? His height is not available. How much does he earn? His estimated earning is $1 million – $4 million. Is he married? Marital status is not available. How many children(s) does he have? Not available.\n\nReference: Wiki and Newspapers."}, {"url": "https://www.londonremembers.com/subjects/william-wise", "page_content": "William Hugh Surtees Wise was born on 6 April 1951 in Oxford, the youngest of the three sons of Horatio Thomas Wise (1906-1990) and Lucy Maud Wise née Helliwell (1919-1951). His elder brothers were Philip J. S. Wise (b.1949) and Richard James Surtees Wise (1950-2018).\n\nHe married Christine Cook, their marriage being registered in the 2nd quarter of 1976 in the Reading & Wokingham registration district. He was a computer programmer and they lived in Notting Hill. His obituary can be found on our picture source.\n\nHe died, aged 54 years, on 7 July 2005 whilst travelling on the lower deck of a Route No.30 bus that was targeted by a suicide bomber at Tavistock Square. The narrative verdict of his death can be found on the Coroner's Inquest Report."}, {"url": "https://www.dailymail.co.uk/home/books/article-9722841/How-rare-books-expert-owned-Bronte-familys-papers-exposed-forger.html", "page_content": "The name T. J. Wise will mean little to those outside the lofty world of rare books: it appears in passing in the details of an ‘incredibly rare’ set of handwritten poems by Emily Bronte which was to have been auctioned at Sotheby’s next month.\n\nThe poems — along with further Bronte notes, sketches, letters and books — are part of the Honresfield library, a collection of literary treasures amassed by Victorian industrialists, which also includes letters from Jane Austen to her sister Cassandra.\n\nSo important is the haul that the sale has been temporarily put on hold to allow a consortium led by Friends of the National Libraries, including Oxford’s Bodleian, the British Library and the National Library of Scotland, to try to raise £15 million to save the manuscripts for the nation.\n\nThomas J. Wise, born in 1859, had an international reputation as a bibliographic scholar and collector of rare books - perhaps the pre-eminent authority on book collecting and valuing modern first editions\n\nSo the future of the trove remains uncertain: not so the reputation of the man who plays his own part in this literary drama. Wise owned a number of Bronte manuscripts — works by Charlotte, Emily, Branwell and Anne — but his skill as a collector and dealer has long been lost to his notoriety.\n\nHis name now serves as a reminder of one of the greatest literary scandals of the 20th century.\n\nWise was at the centre of a bibliographic whodunnit of the highest order, a tale of class, money and hubris in which the ingenuity of a couple of young scholars destroyed the reputation of one of the most respected men of their age.\n\nThe early 20th century was a golden era of book collecting, when some of the foundations of the British Museum’s unparalleled collection of rare books were laid.\n\nBook collecting had been a game for the wealthiest aristocrats, seeking out priceless copies of works by Shakespeare or Chaucer.\n\nTowards the end of the 19th century, attention shifted to rare editions of what would now be called ‘modern classics’ — works by the Romantic poets and 19th-century novelists.\n\nThomas J. Wise, born in Gravesend, Kent, in 1859, was at the epicentre of this new and growing world.\n\nFor most of his career, Wise had an international reputation as a bibliographic scholar and collector of rare books — perhaps the pre-eminent authority on book collecting and valuing modern first editions. He became president of The Bibliographical Society and a trustee of the British Museum. He sat on the consultative committee of the Bodleian Library and became an Honorary Fellow of an Oxford college.\n\nHowever, a rogue comma revealed him as a forger, a thief and a cheat. Throughout his career, Wise had been 'discovering' and selling valuable 'first editions' that had never actually existed\n\nHe was also regarded as an expert on authenticating rare books and detecting fraud.\n\nBut just three years before the end of his long life — when he could reasonably have expected to be borne into posterity amid universal acclaim — Wise’s world imploded. He was revealed as a forger, a thief and a cheat. This head gamekeeper was, it turned out, the worst poacher of all.\n\nThroughout his career, Wise had been ‘discovering’ and selling valuable ‘first editions’ that had never actually existed.\n\nHe had staged phoney auctions to establish high prices for his own forgeries. He ripped out and stole pages from valuable books in the British Museum’s permanent collection to cannibalise them into the equivalent of what used-car dealers call ‘cut-n-shut’ jobs, before selling them to wealthy patrons in America.\n\nIt should be added here that there are no questions over the authenticity of the Bronte trove.\n\nWhy did he do it when his legitimate talents had already brought him a long way? Though Wise liked to hint that he was descended from Irish aristocracy, he was born into poverty.\n\nHe shared a poky home with his widowed father and two brothers and, as far as is known, never attended school, let alone university. Yet his late mother had left him with a love of the Romantic poets — Shelley in particular.\n\nAs a boy, he walked instead of taking a bus so he could save pennies to buy books. He hustled his way into the book world via the Shelley Society and made his name arranging for (legitimate) facsimile first editions to be printed.\n\nHe went on to seek out and supply rare books to America’s so-called robber barons — ruthless and highly successful industrialists who wanted to acquire their own libraries.\n\nThe name T. J. Wise appears in passing in the details of an ‘incredibly rare’ set of handwritten poems by Emily Bronte (pictured) which was to have been auctioned at Sotheby’s next month\n\nHe was damned good at it. As Joseph Hone, an academic writing a biography of Wise, describes it, ‘he was a serious, and a seriously good, collector’. And yet that wasn’t enough. He cheated, too. His confirmed forgeries include editions of everyone from Dickens and Tennyson to George Eliot and Wordsworth.\n\nNemeses arrived in the form of two young book dealers. While Wise had elbowed his way into the establishment by force of personality and low cunning, these two were definitely to the manor born.\n\nJohn Carter had breezed from Eton scholarship to a double first at King’s College, Cambridge. Even in his 20s he wore a monocle, and is reputed to have supplied James Bond’s creator Ian Fleming with the recipe for the perfect dry martini.\n\nGraham Pollard was more roguish: Oxford-educated, he barely scraped a third and didn’t even bother to collect his degree. A member of the aristocratic student drinking club the Hypocrites, he boasted of having beaten Evelyn Waugh to a half-blue in competitive spitting.\n\nCarter and Pollard became friends through a group of young booksellers known as the Biblio-boys, who met often to gossip over sherry.\n\nTheir interest was piqued when rumours began to circulate that there might be something not quite kosher about a much sought-after 1847 edition of Sonnets From The Portuguese, written by Elizabeth Barrett Browning.\n\nThe forgery had followed Wise’s by now standard modus operandi: print a copy of a genuine text and change the publication date, to imply it was a limited edition that had been circulated privately before the main printing. In an instant, you have a valuable property — and one that is very hard to prove is fake. Any comparators would be assumed to be squirrelled away in some other private collections.\n\nThe sale has been temporarily put on hold to allow Friends of the National Libraries, including Oxford’s Bodleian, the British Library and the National Library of Scotland, to try to raise £15 million to save the manuscripts (pictured) for the nation\n\nYet Carter, who had been asked to secure one by a client, smelled a rat. He ended up comparing notes with Pollard, who was onto an equally fishy edition of Ruskin. The two got together and started an investigation that was as pitiless as it was ingenious.\n\nForensic work on the history of type established, for example, that there was a special aspect of the lower case ‘f’ that could only be found after 1880.\n\nTheir analysis of a forged edition of George Eliot’s poem Agatha turned on such minutiae as the hyphenation in ‘garden-gate’, a comma after the word ‘behind’, and the stray letter ‘s’ turning ‘thing’ into ‘things’.\n\nThey were the first to do serious chemical analysis of paper, anticipating work done on other notorious frauds such as the Hitler Diaries in the 1980s.\n\nDiscovering that certain types of wood pulp were used only after the 1880s or 1890s, they persuaded a librarian at Harvard to let them analyse a sliver of the Browning edition in their collection — and lo and behold, the paper turned out to come from much later than the date on the title page.\n\nWhen they tumbled to what Wise had been up to, it was, as Carter put it: ‘...as if the Bank of England had been caught issuing counterfeit money’.\n\nHe and Pollard steadily built their case, and in 1934 they dropped their neutron bomb on the book world. An essay entitled An Enquiry Into The Nature Of Certain Nineteenth Century Pamphlets might sound somewhat dull, but its impact was devastating — a forensic work of genius that systematically debunked dozens of valuable 19th-century editions as outright fakes.\n\nAnd what did those editions have in common? They had all been authenticated by Thomas J. Wise.\n\nThe authors delicately avoided ever accusing their man of fraud. They did not need to. Bibliophiles are good at reading between the lines. Wise died in disgrace.\n\nHere was a man who wrote the standard bibliographies for swathes of 19th-century writers — and inserted references to his own forgeries.\n\nHe introduced them into the permanent collections of the British Museum and craftily seeded a mention of that 1847 edition of Sonnets From The Portuguese into an account of the Brownings’ honeymoon.\n\nAround 100 of his forgeries have been found, though Hone suspects there are more. ‘We’re still reckoning with Wise’s legacy,’ he says.\n\nAnd in a twisted way, Wise — this Robert Maxwell of the antiquarian book world — might be amused."}, {"url": "https://alchetron.com/Tom-Wise", "page_content": "Thomas Harold Wise (born 13 May 1948) was an Independent and UKIP Member of the European Parliament (MEP) for the East of England. A former police officer, he was elected in 2004 as a member of the UK Independence Party but later had the whip withdrawn when allegations of misuse of parliamentary expenses surfaced in The Sunday Telegraph. Following an inquiry carried out by the European Anti-Fraud Office, Wise was formally charged with false accounting and money laundering by Bedfordshire Police. After initially pleading not guilty, he admitted the charges and was sentenced in November 2009 at Southwark Crown Court to a two-year term of imprisonment. He is thought to be the first MEP to be jailed for expenses fraud. Sentencing him, the judge said that Wise had engaged in \"deliberate and blatant dishonesty\" and had set about to defraud the European Parliament almost as soon as he was elected.\n\nEarly career\n\nBorn in Bournemouth, Wise attended Bournemouth School between 1959 and 1965, before completing a Diploma in Public Speaking in 1967. He served with Dorset Police before embarking on a career in the food distribution and processing industry. He became the UK Managing Director of a German herbs and spices company. From 1981 to 1989 he was a member of the Liberal Party.\n\nUKIP\n\nWise joined the United Kingdom Independence Party (UKIP) in 1997. He served as office manager to Jeffrey Titford MEP, during this period he worked on the rules governing MEPs' expenses and gained an expertise in the system which he would later use to his advantage. He was the fourth-placed candidate on UKIP's candidate list in for the European Parliament elections in 1999, and also stood as the party's candidate in the 1997, 2001 and 2005 general elections for the South West Bedfordshire constituency. In the 2005 general election, he came fourth with 4.2% of the votes cast.\n\nHe was elected as an MEP for UKIP in the 2004 European elections. He was UKIP's official spokesman on the Culture, Youth, Media and Sport Committee until his suspension by the party in February 2007. In his first speech to the Committee on 4 October 2004, Wise criticised the proposed budget and drew allusions with Nazi Propaganda Minister Joseph Goebbels. In his maiden speech to the Parliament on 16 December 2004, Wise blamed the European Union for creating unacceptable conditions for the transit of animals around Europe. Wise also spoke out against the Proposed directive on the patentability of computer-implemented inventions\n\nIndependent\n\nAfter losing the party whip in March 2007, Wise continued as an Independent within UKIP's Independence/Democracy parliamentary grouping pending the outcome of the fraud inquiry.\n\nDuring his time as an MEP, Wise disputed the genuine nature of the September 11th attacks. and labelled Russia-based businessman Alisher Usmanov, who is a shareholder of Arsenal F.C. a \"gangster and racketeer\"\n\nFollowing the decision to press criminal charges against him, Wise decided not to contest the 2009 European Parliament elections. He has however said that he wants to stand as an MP in the 2010 General Election.\n\nExposure\n\nOn 23 October 2005, a reporter for the Sunday Telegraph, Daniel Foggo, published an article accusing Wise of claiming £36,000 a year from the European Parliament in the name of his researcher, Lindsay Jenkins, while only passing on about a sixth of that amount to her. According to now-repealed Rules governing the payment of expenses and allowances to Members of the European Parliament, MEPs could claim up to £125,000 per year for assistants' wages, but this money must be paid either directly to the employees or to a third-party agent. The rules did not allow the funds to pass directly through the hands of MEPs themselves.\n\nFoggo later reported that Wise had supplied the European Parliament's Payments Office with a \"contract\" including her name and details, which stipulated that the £36,000 allowance should be paid into an account named \"Stags\". This account, held with the Co-operative Bank, was in fact Wise's own business account and its full name was \"T Wise trading as Stags\". The actual agreement between Wise and Jenkins stated that she would receive monthly \"retainer\" payments of £500 for advice and statistical research, with any extra work to be paid on top. Bank documents obtained by Foggo showed that between November 2004 and October 2005, Wise had paid £39,100 to this account, out of which Jenkins received £13,555. These funds were the only monies coming into the account. In another breach of the payment regulations, some of the £13,555 paid to Jenkins represented work done on behalf of other UKIP members, including party leader Nigel Farage who had agreed to fund the publication of a eurosceptic pamphlet by Jenkins. A further £19,000 was transferred from the account, some of which to pay off credit cards.\n\nOn 29 October, Wise admitted to breaching the rules and, to head off a scandal, agreed to repay £25,230. An internal UKIP inquiry was launched after the Parliament became aware of the affair, but no action was taken and the results of the investigation were kept secret. As Daniel Foggo later reported, UKIP's former leader, Roger Knapman, halted the inquiry after it uncovered serious wrongdoing, believing that the European Parliament would clear Wise. Farage told reporter Daniel Foggo that Wise \"had committed a simple, silly error by making himself a \"paying agent\" for his own staff.\"\n\nSuspension from UKIP\n\nOn 23 February 2007, party sources at UKIP discovered that the European Parliament had passed the affair to OLAF, the European Anti-Fraud Office. A UKIP meeting was convened in Brussels on 28 February 2007 at which Wise formally admitted to having spent £6,500 from the allowance on a dark green Peugeot 406 which he still drove, but refused to disclose how he had spent a further £13,000 of the funds. After a heated discussion, a decision was taken to remove the whip; both Knapman and fellow MEP Mike Nattrass challenged the decision and threatened to reconsider their futures in the party. Farage emphasised that, if cleared by the OLAF investigation, Wise would be welcomed back into the party, adding that he thought \"there is a great deal of public sympathy for us.\" Wise was however suspended by the party.\n\nFollowing his suspension, Wise spent a further £8,000 of the allowance in legal fees in contemplation of a libel case against Greg Lance-Watkins who had published claims on the Internet relating to Wise's activities. No action was ultimately brought against Lance-Watkins.\n\nNews of the World sting\n\nIn May 2008, the News of the World published details of a sting involving Tom Wise. A female reporter posing as a work experience student recorded Wise brazenly admitting in a Belgian bar that he had little idea of what his job as a Member of the European Parliament entailed, adding \"I don't know what an MEP's job is. No one's ever given me a job description. I've no idea what an MEP should or shouldn't do. So you make it up as you go along.\" He boasted of fiddling the Parliament's expenses system, stating \"Yes, I am milking the system [...] I have a simple philosophy. You and your parents are paying for me. Sorry, tough!\" The newspaper used its leading article to call for a change in the rules governing MEPs' expenses following the exposé.\n\nArrest and charges\n\nOn 20 June 2008, Wise was arrested by Bedfordshire Police's Economic Crime Unit on suspicion of making a false instrument, obtaining money by deception by transfer and converting criminal property. He was bailed until 29 October. Bedfordshire Police made the arrest after having been contacted by OLAF.\n\nOn 20 April 2009 the Crown Prosecution Service advised Bedfordshire Police to charge both Wise and Jenkins with one count each of false accounting contrary to the Theft Act 1968 and one count each of money laundering contrary to the Proceeds of Crime Act 2002. Both were scheduled to appear before the City of Westminster Magistrates' Court on in April 2009 to face the charges. Wise indicated that he was innocent and would fight the charges which carry a maximum 14-year jail term. He is thought to be the first MEP to face criminal charges over the misuse of parliamentary funds, and the second former UKIP MEP after Ashley Mote to have faced criminal charges during a parliamentary session.\n\nTrial and conviction\n\nWise appeared in court on 27 April 2009 and spoke only to confirm his name and plead not guilty. Jenkins also denied the charges. District Judge Daphne Wickham released both on conditional bail until 8 June. The case was transferred to Southwark Crown Court and charges specified: that Wise and Jenkins \"falsified a document, namely a contract for provision of services, an application for secretarial assistance allowance and invoices\". Also, that they used funds \"received from the European Parliament intended for use as payments for secretarial services.\"\n\nThe three-week trial began on 2 November 2009. Judge Geoffrey Rivlin QC heard the prosecution argue that Wise channelled parliamentary funds into an account he secretly controlled so that he could pay credit card debts and buy fine wines. He made separate payments of £2,228 and £1,260 to wine importers, and maintained the deception by asking Jenkins to sign blank documents which he completed later. But for his exposure, Wise would, according to prosecutors, have claimed up to £180,000.\n\nOn the third day of the trial, just before Nigel Farage was due to give evidence against him, Wise began several hours of negotiations with his legal team after which he changed his plea to guilty and said he was entirely to blame for the fraud. This resulted in Jenkins being acquitted. He was sentenced on 10 November 2009 to two years imprisonment, the sentence having been reduced by one year on account of his guilty plea. In sentencing him, Judge Geoffrey Rivlin declared that:\n\nIt is no exaggeration to say that you had hardly got your feet beneath your desk as an MEP before you were planning to defraud the parliament to which you were elected and the people you were elected to serve. This was very deliberate and blatant dishonesty. You did not fall into this offence as a result of some unfortunate combination of unforeseen circumstances which happened to suddenly present you with temptation. You knew the system of expenses inside out and this was a claim you devised and planned with some care.\n\nThe judge added that, in addition to jail, Wise would also have to pay £30,000 towards the prosecution's costs.\n\nPersonal life\n\nWise is married to Janet and, until his imprisonment, lived in Linslade near Leighton Buzzard in Bedfordshire. He has two grown-up children.\n\nWise has a developed interest in wines, having followed courses arranged by the Wine & Spirit Education Trust and has reached \"the level just below Master of Wine\". He has spoken of having a wine cellar containing 1,000 bottles of wine."}, {"url": "https://www.ancestry.com/genealogy/records/frederick-henry-wise-24-1313yqp", "page_content": "This database contains family trees submitted to Ancestry by users who have indicated that their tree can be viewed by all Ancestry subscribers.These trees can change over time as users edit, remove, or otherwise modify the data in their trees. You can contact the owner of the tree to get more information.\n\nPrivate Member Trees\n\nThis database contains family trees submitted to Ancestry by users who have indicated that their tree can only be viewed by Ancestry members to whom they have granted permission to see their tree.These trees can change over time as users edit, remove, or otherwise modify the data in their trees. If you would like to view one of these trees in its entirety, you can contact the owner of the tree to request permission to see the tree."}], "Tom Wise gained a degree in economics from the University of East Anglia.": [{"url": "https://www.uea.ac.uk/about/school-of-economics", "page_content": "The School of Economics proudly combines a reputation for internationally-leading research with unparalleled standards in teaching and academic support for our students.\n\nWe are known worldwide for our ground-breaking research in behavioural and experimental economics, and for our expertise in competition policy: work that leads the field, informs policymakers and makes headlines. We also have a global reputation for research excellence in economic theory, applied econometrics, finance, and in policy areas of environment, resources, conflict and migration.\n\nOur research leads our teaching and we are at the forefront of developments in economics as a taught discipline. We have expertise in - and commitment to - your learning, your employability and to a fantastic student experience. Within the School we enjoy a wonderful sense of community. We offer a friendly, diverse environment, which we hope will be the perfect setting for you to achieve your goals, whatever they may be."}, {"url": "https://research-portal.uea.ac.uk/en/persons/martin-bruns", "page_content": "Martin Bruns joined the School of Economics in August 2019 as an Assistant Professor. He received his PhD from Freie University Berlin in July 2019 and his MSc degree from Toulouse School of Economics in 2014. He worked as a research associate in the forecasting department of the German Institute for Economic Research (2016-2019). Martin Bruns is interested in time series econometrics and empirical macroeconomics. His recent work is concerned with Bayesian estimation and the effects of uncertainty on the economy.\n\nPersonal Website\n\nhttps://sites.google.com/view/martin-bruns/home"}, {"url": "https://www.postgraduatesearch.com/courses/search/postgraduate/university-of-east-anglia-uea/msc-economics/52343882", "page_content": "Privacy overview\n\nWe use cookies, which are small text files placed on your computer, to allow the site to work for you, improve your user experience, to provide us with information about how our site is used, and to deliver personalised ads which help fund our work and deliver our service to you for free.\n\nThe information does not usually directly identify you, but it can give you a more personalised web experience.\n\nYou can accept all, or else manage cookies individually. However, blocking some types of cookies may affect your experience of the site and the services we are able to offer.\n\nYou can change your cookies preference at any time by visiting our Cookies Notice page. Please remember to clear your browsing data and cookies when you change your cookies preferences. This will remove all cookies previously placed on your browser.\n\nFor more detailed information about the cookies we use, or how to clear your browser cookies data see our Cookies Notice"}, {"url": "https://research-portal.uea.ac.uk/en/persons/fabio-arico", "page_content": "Biography\n\nFabio Aricò is a Professor in Higher Education and Economics. He studied at the University of Pavia (Italy) and continued his postgraduate education at the University of Warwick, where he was awarded his MSc and PhD in Economics. Prior to joining UEA, Fabio worked as Teaching Fellow at the University of Warwick, as Visiting Professor at Vanderbilt University, and as a Lecturer at the University of St Andrews. Fabio holds a MA in Higher Education Practice and he was awarded a prestigious National Teaching Fellowship by the Higher Education Academy in 2017. Fabio is a labour economist and his current research interests are focused on Economics of Education and Higher Education Policy and Practice, including: widening access to higher education, student self-efficacy, assessment and self-assessment, viva-voce examinations, pluralism in Economics education. He provides consultancy to HE institutions on teaching development, innovation, and technology-enhanced learning.\n\n\n\nPhD Supervision Interests\n\nFabio is interested in supervising students on topics in Economics of Education, including: widening access to higher education, higher education policy, skills mismatch and skills training. He will also consider supervision opportunities in the field of labour economics, such as discrimination, employment policies, and happiness and well-being in the workplace."}, {"url": "https://www.uea.ac.uk/new-homepage", "page_content": "05 Jun 2023\n\nBanning multibuy discounts drives sales rather than curbing appetites\n\nWith the government under pressure to devise policies that help curb excessive consumption of unhealthy foods and drinks, new research from the University of..."}, {"url": "https://www.theuniguide.co.uk/university-of-east-anglia-uea-e14/courses/economics-bsc-hons-2023-6a25af42d498", "page_content": "**Overview**\n\nHow do the choices of individuals and firms combine to drive the modern global economy? And how can this economy be best aligned with human goals? On our flagship degree in economics you'll develop an understanding of what makes the world tick. You’ll discover how economic policy can affect social change, and you’ll start to form your own ideas about how to make our world a better place.\n\n**About This Course**\n\nAn economics degree is ideal for you if you have a curious and questioning nature. You enjoy analysing numbers and at the same time you’re fascinated by people and human behaviour. You might know exactly what career you want to go into – or you may know that an economics degree keeps your options open, possibly more than any other.\n\nEconomics is a far broader subject than most people realise, and our BSc Economics degree enables you either to enjoy the full breadth of the discipline or to discover and develop you own area of personal interest. You may find your passion is for finance, derivatives, risk management or alternative investments; or for public-sector economics, political economy, or environmental economics; or for international economics, trade or development economics; or for competition economics, labour economics, behavioural economics, or the economics of sport; or indeed for the history of economic thought or for any one of many other offered specialisms. You'll explore all areas of the economy, from microeconomic and macroeconomic perspectives. You'll learn to use economic models and real-world data to gain deep insights about business, politics and markets.\n\n**Disclaimer**\n\nCourse details are subject to change. You should always confirm the details on the provider's website: **www.uea.ac.uk**"}, {"url": "https://www.thecompleteuniversityguide.co.uk/league-tables/rankings/economics", "page_content": "Your Privacy\n\nWe use cookies, which are small text files placed on your computer, to allow the site to work for you, improve your user experience, to provide us with information about how our site is used, and to deliver personalised ads which help fund our work and deliver our service to you for free.\n\nThe information does not usually directly identify you, but it can give you a more personalised web experience.\n\nYou can accept all, or else manage cookies individually. However, blocking some types of cookies may affect your experience of the site and the services we are able to offer.\n\nYou can change your cookies preference at any time by visiting our Cookies Notice page. Please remember to clear your browsing data and cookies when you change your cookies preferences. This will remove all cookies previously placed on your browser.\n\nFor more detailed information about the cookies we use, or how to clear your browser cookies data see our Cookies Notice"}, {"url": "https://research-portal.uea.ac.uk/en/persons/james-watson", "page_content": "Biography\n\nJames Watson completed his undergraduate degree in mathematics before embarking on a private-sector career involving a variety of small business ventures. James returned to higher education in 2004, completing a Graduate Diploma in Economics, MSc in Economics, and a PhD in Economics, here at the University of East Anglia. Shortly after completing his PhD James joined the School of Economics teaching team.\n\n\n\nJames teaches macroeconomics and finance to undergraduate and postgraduate students. He is particularly interested in fiscal and monetary policy, and the levels of government debt. James sits as the external member on the Investment Committee of a local financial advisory firm.\n\nKey Research Interests\n\nJames’ completed his PhD in 2011. His thesis investigated the role of UK inflation targeting in inducing stability in long-term government bond yields. This investigation was carried out using theoretical, empirical and experimental analysis. His current interests include the apparent divergence of sovereign states into ‘haven’ and ‘risk’ debtors; the implications of ever-growing central bank balance sheets; and the limits to conventional monetary policy. He also has a keen interest in the economic blogosphere and the increasing role this is playing in contemporary economic debate. James has also provided research assistance on a range of experimental research projects at UEA, including design, programming and running experimental sessions.\n\nTeaching Interests"}, {"url": "https://research-portal.uea.ac.uk/en/persons/theodore-turocy", "page_content": "I am a Professor in the School of Economics, and currently the Deputy Head of the School (from 2015) and Associate Dean for Research in the Faculty of Social Sciences (from 2016). I received my PhD in Managerial Economics and Decision Science from Northwestern University in 2001, and my BS in Computer Science and in Economics from the California Institute of Technology in 1994.\n\nI am interested in choice: specifically, how people go about making choices. My research programme extends the standard methods of economic analysis by taking account that the processes we use to make choices can affect not only what choice gets made, but how we feel about the outcomes of those choices as well.\n\nThrough the use of game theory, economists have recognised that the choices made in groups can depend on details of process such as timing and information. A strand of my research contributes to the standard application of game theory in economics and other disciplines, including via my Open Source software package, Gambit: Software Tools for Game Theory.\n\nMy work incorporates a richer notion of process, which takes into account the role that choice architecture, labeling, and social context, among others, colour the choice process. I am currently pursuing this as a co-I along with colleagues at UEA, Nottingham, and Warwick in the ESRC Network for Integrated Behavioural Science, under its theme \"The science of consumer behaviour\".\n\nYou can find additional information on my activities on my personal homepage.\n\nPhD Supervision Interests\n\nGame theory, auctions, the provision of public goods, contests, computational methods in game theory and economics, choice architecture."}, {"url": "https://www.studyin-uk.com/profiles/university/east-anglia/", "page_content": "Overview\n\nThe University of East Anglia (UEA) is an internationally renowned university based in a campus which provides world-class academic, social and cultural facilities to over 15,000 students from more than 100 countries.\n\nThe University is ranked in the top 200 universities in the world (Times Higher Education World Rankings 2022) and its teaching is of the highest quality having ranked Gold in the Teaching Excellence Framework (2017-2021).\n\nLocated in 300 acres of parkland, UEA is just three miles from the vibrant and historic city of Norwich. UEA’s mini-city campus has everything you need in one place. The safe campus boasts a wide range of accommodation, the Sainsbury’s Centre for Visual Arts; a state- of-the-art public art gallery and a renowned campus sports facilities in its Sportspark.\n\nWith international standards of excellence in teaching and research, outstanding facilities and comprehensive support, the University of East Anglia offers a truly unrivalled study experience. The University of East Anglia acceptance rate is 79%. A key University of East Anglia ranking is being 13th in the UK for quality of research outputs (Times Higher REF2021 Analysis)."}]}