{"Tom Wise worked as a financial adviser after his release.": [{"url": "https://www.libf.ac.uk/news-and-insights/insights/detail/2021/08/19/career-story-studying-to-become-a-financial-adviser", "page_content": "Sam Barr-Worsfold has worked in banking and finance for seven years. In 2016 he decided to qualify as a financial adviser. He tells us why, about studying DipFA and why working in financial advice is so rewarding.\n\nI started my career as a protection adviser after a short period in retail banking. Becoming a financial adviser seemed like a logical next step. The knowledge and skills I’d learned and used were transferable to wider financial advice.\n\nI’d often speak to my clients about arranging sufficient insurance until their retirement age and that was a natural point to discuss their pension provisions. But until I was qualified, I had to refer clients to our financial planners to take those discussions further.\n\nClients are often reluctant to speak to someone new and would often ask if I could help instead. I enjoy helping clients and wanted to provide a more holistic service.\n\nStudying to become a financial adviser\n\nI began studying for my Level 4 Diploma for Financial Advisers (DipFA) in late 2016.\n\nThe structure of the course was logical and relatively straightforward – practical in nature, teaching me what I really needed to know.\n\nThere’s a lot to learn in a short space of time but it’s great you can complete it in nine months. It can take far longer with some other educational bodies.\n\nAt times, studying for my DipFA was quite challenging whilst also doing my normal day job. It can be quite tricky to fit it all in but it’s more than possible with the right discipline\n\nBreaking the content down into manageable chunks – a chapter or 20-odd pages – and studying before work was best for me. I made sure I carved out the time to study during the week and gave myself the weekends off, for a well needed rest.\n\nFor the final exam, I completed the fact find report and remembered it off by heart. I recorded myself reading it out loud and listened to it during my morning dog walk.\n\nI passed my DipFA in July 2017 and started working as a Financial Adviser soon after, gaining ‘competent adviser status’ (CAS) in early 2018.\n\nTips on studying DipFA\n\nThe key is to get into a routine and stick to it!\n\nI found speaking with the advisers at my firm, Drewberry very helpful as they can often give you practical examples to back up the theory. For me this helps with the concepts and using real life examples/anecdotes made the concepts easier to digest.\n\nWhat’s the best thing about being a financial adviser?\n\nSpeaking with very different and interesting people. And it’s extremely rewarding to show clients they can retire sooner or take that once-in-a-lifetime trip without worrying that their money will run out later down the line.\n\nTo provide good advice you really need to get to know your clients, and many end up becoming more than just a client. It’s actually a very social job.\n\nWhat are you planning to do next?\n\nI’d like to expand my knowledge further. It’s important to continuously develop. I’m planning to start my journey to chartered status in the not too distant future\n\nRelated content\n\nFind out more about the Level 4 Diploma for Financial Advisers (DipFA)"}, {"url": "https://www.businesswire.com/news/home/20220816005936/en/Genesis-Announces-New-Leadership-Team", "page_content": "NEW YORK--(BUSINESS WIRE)--Genesis today announced a series of leadership appointments to position the company for its next phase of growth. Effective today, Genesis CEO Michael Moro is stepping down and will continue to advise the company through the transition. Chief Operating Officer Derar Islim, Ph.D., who joined Genesis in 2020 and has overseen the development of strategy and key core functions, has been appointed interim Chief Executive Officer. Seasoned financial services executive Tom Conheeney will consult to Genesis as a Senior Advisor, where he will support Islim on the firm’s overall strategy while advising the trading, lending, and risk teams. Conheeney will join Islim on the company’s Board of Directors. Genesis has also commenced a search for a full-time CEO.\n\nIn addition, Genesis has made key executive leadership hires to further strengthen its governance and position the firm for the future. Chief Risk Officer Michael Patchen, Chief Compliance Officer Michael Patterson, and Chief Technology Officer Matthew Johnson have recently joined Genesis. Alice Chan, Chief Financial Officer, and Arianna Pretto-Sakmann, Chief Legal Officer, round out the expanded leadership team focused on strengthening the company’s overall risk management in partnership with Genesis’ sales and trading leadership.\n\n“Our clients look to Genesis to provide integral capital and execution services across their digital asset portfolios,” said Derar Islim, Interim Chief Executive Officer. “The changes and investments we’re announcing today affirm our commitment to operational excellence as we continue to expand our services to meet the needs of our clients today and into the future.”\n\n“I’m thrilled to join the Genesis Board. I also look forward to working with Derar and the team to bolster key areas of Genesis and to expand the firm’s market position with more traditional financial institutions and alternative asset managers looking for investment opportunities in digital assets,” said Tom Conheeney, Genesis’ Senior Advisor.\n\n“Since we launched the first OTC bitcoin trading desk in 2013, sophisticated investors have come to Genesis to provide liquidity, lending, and custody services for their digital assets. It has been an honor to lead Genesis for nearly a decade and I look forward to supporting the company’s next phase of growth,” said Michael Moro.\n\nGenesis is a wholly-owned subsidiary of Digital Currency Group and has emerged as a leading digital asset trading and lending firm with hundreds of institutional clients around the world. “We thank Michael for his steadfast leadership of Genesis in building the company into the industry leader it is today,” said Mark Murphy, Chief Operating Officer, Digital Currency Group. “We’re pleased to elevate Derar to the interim CEO role – he has our full trust and confidence and has been instrumental in developing key areas of the Genesis business. We also welcome Tom, a proven leader and highly skilled financial services veteran, as we strengthen Genesis for the future.”\n\nDerar Islim – Interim CEO & Board Member\n\nPrior to joining Genesis in 2020 as COO, Dr. Derar Islim served as Head of Risk at Hard Yaka, a San Francisco based venture capital firm, and previously served as Vice President at Bank of America Merrill Lynch where he co-managed the company’s funding valuation adjustment trading desk. Islim earned his PhD. in Financial Mathematics with a focus on the pricing and hedging of financial derivatives from Florida State University and is a Fulbright Scholar. He holds FINRA 7 and 63 licenses.\n\nTom Conheeney – Senior Advisor & Board Member\n\nTom Conheeney has had an extensive career in financial services. He served as President of SAC Capital and its successor Point72 Asset Management from 2008 to 2015, after joining SAC in 1999 as Chief Operating Officer. Prior to SAC, Conheeney was President of Investment Management Services, Inc. He joined Moore Capital / IMS in 1993. Earlier in his career, he worked at Goldman Sachs Trust Company with responsibilities for daily operations, technology, and client services. He also worked in the operations and equity divisions of Goldman Sachs.\n\nMichael Patchen, CFA – Chief Risk Officer\n\nMichael Patchen is the Chief Risk Officer at Genesis, overseeing all risk departments. Previously, Patchen spent nearly six years with AQR Capital, a large systematic asset manager, where he was a principal and the Chief Risk Officer. While there he oversaw a large-scale Enterprise risk effort covering market, model, operational, counterparty, and technology risk. Before AQR, Patchen started his career as a portfolio manager and researcher and worked at top-tier asset management firms including SAC Capital and Goldman Sachs. He holds a B.S. from The Wharton School at the University of Pennsylvania and a BAS from the Engineering School.\n\nMichael Patterson – Chief Compliance Officer\n\nMichael Patterson, Chief Compliance Officer of Genesis, is a seasoned global business leader and board member with 40 years of cross-sector experience in strategy, P&L management and international operations. Patterson previously worked as senior partner and business leader with EY, Merrill Lynch & Co., BearingPoint Inc., and Arthur Andersen. He holds a B.B.A from Pace University.\n\nMatthew Johnson – Chief Technology Officer\n\nA fintech executive with twenty years of experience in technology administration and development, Matthew Johnson has worked with some of the world’s largest hedge funds revolutionizing their technology stacks. Previously he was the CTO of Bakkt, a platform for the management of digital assets. Prior to that, Johnson was the co-founder and Chief Product Officer of Digital Asset Custody Company, which was acquired by Bakkt in 2019.\n\nAlice Chan – Chief Financial Officer\n\nPrior to joining Genesis, Alice Chan was the Chief Financial Officer of Cantor Fitzgerald SPACs Franchise and served as a member of the board of directors. Chan also served as the Global Controller at Cantor Fitzgerald and Chief Financial Officer of certain investment funds. Previously, she worked at Goldman Sachs, focusing on broker dealers financial and regulatory reporting, and bank financial reporting. Chan is a Certified Public Accountant and holds a BS in Finance from Pace University and MS in Accounting from St. John’s University. She is also registered with FINRA and holds a Series 27 Financial Operations Principal License.\n\nArianna Pretto-Sakmann – Chief Legal Officer\n\nBefore joining Genesis, Arianna Pretto-Sakmann worked as a lawyer at Freshfields Bruckhaus Deringer LLP in New York and London from 2011-2019 and with Sullivan & Cromwell LLP from 2007-2011. She was previously an academic and taught law at the University of Oxford and Columbia Law School. She holds an MSt and a DPhil from Oxford University and an LLM from Columbia Law School.\n\nGenesis is a full-service digital currency prime brokerage providing a single point of access for select qualified individuals and global institutional investors. Genesis combines unrivaled operational excellence, a seamless user experience, and best-in-class client service to provide the full suite of services global investors require to manage their digital asset portfolios. For more information, please visit genesistrading.com and follow @GenesisTrading on Twitter."}, {"url": "https://alchetron.com/Tom-Wise", "page_content": "Thomas Harold Wise (born 13 May 1948) was an Independent and UKIP Member of the European Parliament (MEP) for the East of England. A former police officer, he was elected in 2004 as a member of the UK Independence Party but later had the whip withdrawn when allegations of misuse of parliamentary expenses surfaced in The Sunday Telegraph. Following an inquiry carried out by the European Anti-Fraud Office, Wise was formally charged with false accounting and money laundering by Bedfordshire Police. After initially pleading not guilty, he admitted the charges and was sentenced in November 2009 at Southwark Crown Court to a two-year term of imprisonment. He is thought to be the first MEP to be jailed for expenses fraud. Sentencing him, the judge said that Wise had engaged in \"deliberate and blatant dishonesty\" and had set about to defraud the European Parliament almost as soon as he was elected.\n\nEarly career\n\nBorn in Bournemouth, Wise attended Bournemouth School between 1959 and 1965, before completing a Diploma in Public Speaking in 1967. He served with Dorset Police before embarking on a career in the food distribution and processing industry. He became the UK Managing Director of a German herbs and spices company. From 1981 to 1989 he was a member of the Liberal Party.\n\nUKIP\n\nWise joined the United Kingdom Independence Party (UKIP) in 1997. He served as office manager to Jeffrey Titford MEP, during this period he worked on the rules governing MEPs' expenses and gained an expertise in the system which he would later use to his advantage. He was the fourth-placed candidate on UKIP's candidate list in for the European Parliament elections in 1999, and also stood as the party's candidate in the 1997, 2001 and 2005 general elections for the South West Bedfordshire constituency. In the 2005 general election, he came fourth with 4.2% of the votes cast.\n\nHe was elected as an MEP for UKIP in the 2004 European elections. He was UKIP's official spokesman on the Culture, Youth, Media and Sport Committee until his suspension by the party in February 2007. In his first speech to the Committee on 4 October 2004, Wise criticised the proposed budget and drew allusions with Nazi Propaganda Minister Joseph Goebbels. In his maiden speech to the Parliament on 16 December 2004, Wise blamed the European Union for creating unacceptable conditions for the transit of animals around Europe. Wise also spoke out against the Proposed directive on the patentability of computer-implemented inventions\n\nIndependent\n\nAfter losing the party whip in March 2007, Wise continued as an Independent within UKIP's Independence/Democracy parliamentary grouping pending the outcome of the fraud inquiry.\n\nDuring his time as an MEP, Wise disputed the genuine nature of the September 11th attacks. and labelled Russia-based businessman Alisher Usmanov, who is a shareholder of Arsenal F.C. a \"gangster and racketeer\"\n\nFollowing the decision to press criminal charges against him, Wise decided not to contest the 2009 European Parliament elections. He has however said that he wants to stand as an MP in the 2010 General Election.\n\nExposure\n\nOn 23 October 2005, a reporter for the Sunday Telegraph, Daniel Foggo, published an article accusing Wise of claiming £36,000 a year from the European Parliament in the name of his researcher, Lindsay Jenkins, while only passing on about a sixth of that amount to her. According to now-repealed Rules governing the payment of expenses and allowances to Members of the European Parliament, MEPs could claim up to £125,000 per year for assistants' wages, but this money must be paid either directly to the employees or to a third-party agent. The rules did not allow the funds to pass directly through the hands of MEPs themselves.\n\nFoggo later reported that Wise had supplied the European Parliament's Payments Office with a \"contract\" including her name and details, which stipulated that the £36,000 allowance should be paid into an account named \"Stags\". This account, held with the Co-operative Bank, was in fact Wise's own business account and its full name was \"T Wise trading as Stags\". The actual agreement between Wise and Jenkins stated that she would receive monthly \"retainer\" payments of £500 for advice and statistical research, with any extra work to be paid on top. Bank documents obtained by Foggo showed that between November 2004 and October 2005, Wise had paid £39,100 to this account, out of which Jenkins received £13,555. These funds were the only monies coming into the account. In another breach of the payment regulations, some of the £13,555 paid to Jenkins represented work done on behalf of other UKIP members, including party leader Nigel Farage who had agreed to fund the publication of a eurosceptic pamphlet by Jenkins. A further £19,000 was transferred from the account, some of which to pay off credit cards.\n\nOn 29 October, Wise admitted to breaching the rules and, to head off a scandal, agreed to repay £25,230. An internal UKIP inquiry was launched after the Parliament became aware of the affair, but no action was taken and the results of the investigation were kept secret. As Daniel Foggo later reported, UKIP's former leader, Roger Knapman, halted the inquiry after it uncovered serious wrongdoing, believing that the European Parliament would clear Wise. Farage told reporter Daniel Foggo that Wise \"had committed a simple, silly error by making himself a \"paying agent\" for his own staff.\"\n\nSuspension from UKIP\n\nOn 23 February 2007, party sources at UKIP discovered that the European Parliament had passed the affair to OLAF, the European Anti-Fraud Office. A UKIP meeting was convened in Brussels on 28 February 2007 at which Wise formally admitted to having spent £6,500 from the allowance on a dark green Peugeot 406 which he still drove, but refused to disclose how he had spent a further £13,000 of the funds. After a heated discussion, a decision was taken to remove the whip; both Knapman and fellow MEP Mike Nattrass challenged the decision and threatened to reconsider their futures in the party. Farage emphasised that, if cleared by the OLAF investigation, Wise would be welcomed back into the party, adding that he thought \"there is a great deal of public sympathy for us.\" Wise was however suspended by the party.\n\nFollowing his suspension, Wise spent a further £8,000 of the allowance in legal fees in contemplation of a libel case against Greg Lance-Watkins who had published claims on the Internet relating to Wise's activities. No action was ultimately brought against Lance-Watkins.\n\nNews of the World sting\n\nIn May 2008, the News of the World published details of a sting involving Tom Wise. A female reporter posing as a work experience student recorded Wise brazenly admitting in a Belgian bar that he had little idea of what his job as a Member of the European Parliament entailed, adding \"I don't know what an MEP's job is. No one's ever given me a job description. I've no idea what an MEP should or shouldn't do. So you make it up as you go along.\" He boasted of fiddling the Parliament's expenses system, stating \"Yes, I am milking the system [...] I have a simple philosophy. You and your parents are paying for me. Sorry, tough!\" The newspaper used its leading article to call for a change in the rules governing MEPs' expenses following the exposé.\n\nArrest and charges\n\nOn 20 June 2008, Wise was arrested by Bedfordshire Police's Economic Crime Unit on suspicion of making a false instrument, obtaining money by deception by transfer and converting criminal property. He was bailed until 29 October. Bedfordshire Police made the arrest after having been contacted by OLAF.\n\nOn 20 April 2009 the Crown Prosecution Service advised Bedfordshire Police to charge both Wise and Jenkins with one count each of false accounting contrary to the Theft Act 1968 and one count each of money laundering contrary to the Proceeds of Crime Act 2002. Both were scheduled to appear before the City of Westminster Magistrates' Court on in April 2009 to face the charges. Wise indicated that he was innocent and would fight the charges which carry a maximum 14-year jail term. He is thought to be the first MEP to face criminal charges over the misuse of parliamentary funds, and the second former UKIP MEP after Ashley Mote to have faced criminal charges during a parliamentary session.\n\nTrial and conviction\n\nWise appeared in court on 27 April 2009 and spoke only to confirm his name and plead not guilty. Jenkins also denied the charges. District Judge Daphne Wickham released both on conditional bail until 8 June. The case was transferred to Southwark Crown Court and charges specified: that Wise and Jenkins \"falsified a document, namely a contract for provision of services, an application for secretarial assistance allowance and invoices\". Also, that they used funds \"received from the European Parliament intended for use as payments for secretarial services.\"\n\nThe three-week trial began on 2 November 2009. Judge Geoffrey Rivlin QC heard the prosecution argue that Wise channelled parliamentary funds into an account he secretly controlled so that he could pay credit card debts and buy fine wines. He made separate payments of £2,228 and £1,260 to wine importers, and maintained the deception by asking Jenkins to sign blank documents which he completed later. But for his exposure, Wise would, according to prosecutors, have claimed up to £180,000.\n\nOn the third day of the trial, just before Nigel Farage was due to give evidence against him, Wise began several hours of negotiations with his legal team after which he changed his plea to guilty and said he was entirely to blame for the fraud. This resulted in Jenkins being acquitted. He was sentenced on 10 November 2009 to two years imprisonment, the sentence having been reduced by one year on account of his guilty plea. In sentencing him, Judge Geoffrey Rivlin declared that:\n\nIt is no exaggeration to say that you had hardly got your feet beneath your desk as an MEP before you were planning to defraud the parliament to which you were elected and the people you were elected to serve. This was very deliberate and blatant dishonesty. You did not fall into this offence as a result of some unfortunate combination of unforeseen circumstances which happened to suddenly present you with temptation. You knew the system of expenses inside out and this was a claim you devised and planned with some care.\n\nThe judge added that, in addition to jail, Wise would also have to pay £30,000 towards the prosecution's costs.\n\nPersonal life\n\nWise is married to Janet and, until his imprisonment, lived in Linslade near Leighton Buzzard in Bedfordshire. He has two grown-up children.\n\nWise has a developed interest in wines, having followed courses arranged by the Wine & Spirit Education Trust and has reached \"the level just below Master of Wine\". He has spoken of having a wine cellar containing 1,000 bottles of wine."}, {"url": "https://www.investopedia.com/articles/personal-finance/050815/what-do-financial-advisers-do.asp", "page_content": "Many wonder what a financial advisor does. In general, these professionals help you make decisions about what you should do with your money, which may include investments or other courses of action.\n\nKey Takeaways A financial advisor is often responsible for more than just executing trades in the market on behalf of their clients.\n\nAdvisors use their knowledge and expertise to construct personalized financial plans that aim to achieve the financial goals of clients.\n\nThese plans include not only investments but also savings, budget, insurance, and tax strategies.\n\nAdvisors further check in with their clients on a regular basis to re-evaluate their current situation and future goals and plan accordingly.\n\nYou do not need to be wealthy to benefit from the services of a financial advisor.\n\nThe Many Roles of a Financial Advisor\n\nA financial advisor is your financial planning partner. Let's say you want to retire in 20 years or send your child to a private university in 10 years. To accomplish your goals, you may need a skilled professional with the right licenses to help make these plans a reality; this is where a financial advisor comes in.\n\nTogether, you and your advisor will cover many topics, including the amount of money you should save, the types of accounts you need, the kinds of insurance you should have (including long-term care, term life, disability, etc.), and estate and tax planning.\n\nThe financial advisor is also an educator. Part of the advisor's task is to help you understand what is involved in meeting your future goals. The education process may include detailed help with financial topics. At the beginning of your relationship, those topics may include budgeting and saving. As you advance in your knowledge, the advisor will assist you in understanding complex investment, insurance, and tax matters.\n\nServices Provided by Financial Advisors Investment advice: Financial advisors offer advice on those investments that fit your style, goals, and risk tolerance and goals, developing an investing strategy and making adjustments as needed.\n\nFinancial advisors offer advice on those investments that fit your style, goals, and risk tolerance and goals, developing an investing strategy and making adjustments as needed. Debt management: Financial advisors can create strategies to help you pay down your debt and avoid debt in the future.\n\nFinancial advisors can create strategies to help you pay down your debt and avoid debt in the future. Budgeting: A financial advisor will provide tips and strategies to create a budget that helps you meet your goals in the short and the long term.\n\nA financial advisor will provide tips and strategies to create a budget that helps you meet your goals in the short and the long term. Saving for college: Part of a budgeting strategy may include strategies that help you pay for higher education.\n\nPart of a budgeting strategy may include strategies that help you pay for higher education. Retirement planning: Likewise, a financial advisor will create a saving plan crafted to your specific needs as you head into retirement.\n\nLikewise, a financial advisor will create a saving plan crafted to your specific needs as you head into retirement. Estate planning: Financial advisors will create a plan and help you identify the people or organizations you want to receive your legacy after you die.\n\nFinancial advisors will create a plan and help you identify the people or organizations you want to receive your legacy after you die. Long-term healthcare and insurance: A financial advisor will provide you with the best long-term solutions and insurance options that fit your budget.\n\nA financial advisor will provide you with the best long-term solutions and insurance options that fit your budget. Tax planning: Financial Advisor Tax Planning Services include:\n\nFinancial Advisor Tax Planning Services include: Tax return preparation.\n\nMaximizing tax deductions.\n\nScheduling tax-loss harvesting security sales, usually around year-end.\n\nEnsuring the best use of the capital gains tax rates.\n\nPlanning to minimize taxes in retirement.\n\n\n\nStep one in the financial advisory process is understanding your financial health. You can’t properly plan for the future without knowing where you stand today. Typically, you will be asked to complete a detailed written questionnaire. Your answers help the advisor understand your situation and make certain you don't overlook any important information.\n\nThe Financial Health Questionnaire\n\nA financial advisor will work with you to get a complete picture of your assets, liabilities, income, and expenses. On the questionnaire, you will also indicate future pensions and income sources, project retirement needs, and describe any long-term financial obligations. In short, you’ll list all current and expected investments, pensions, gifts, and sources of income.\n\nThe investing component of the questionnaire touches upon more subjective topics, such as your risk tolerance and risk capacity. Having an understanding of your risk assists the advisor when it’s time to determine your investment asset allocation. At this point, you'll also let the advisor know your investment preferences as well.\n\nThe initial assessment may also include an examination of other financial management topics, such as insurance issues and your tax situation. The advisor needs to be aware of your current estate plan, as well as other professionals on your planning team, such as accountants and lawyers. Once you and the advisor understand your present financial position and future projections, you’re ready to work together on a plan to meet your life and financial goals.\n\nCreating a Financial Plan\n\nThe financial advisor synthesizes all of this initial information into a comprehensive financial plan that will serve as a roadmap for your financial future. It begins with a summary of the key findings from your initial questionnaire and summarizes your current financial situation, including net worth, assets, liabilities, and liquid or working capital. The financial plan also recaps the goals you and the advisor discussed.\n\nThe analysis section of this lengthy document will provide more information about several topics, including your risk tolerance, estate-planning details, family situation, long-term care risk, and other pertinent present and future financial issues.\n\nBased upon your expected net worth and future income at retirement, the plan will create simulations of potentially best- and worst-case retirement scenarios, including the scary possibility of outliving your money. In this case, steps can be taken to prevent that outcome. It will look at reasonable withdrawal rates in retirement from your portfolio assets. Additionally, if you are married or in a long-term partnership, the plan will consider survivorship issues and financial scenarios for the surviving partner.\n\nAfter you review the plan with the advisor and adjust it as necessary, you’re ready for action.\n\n\n\nFinancial advising is a hot topic, and it pays to stay up to date on the Department of Labor's Fiduciary Rulings, as they may have a significant impact on the financial advising industry.\n\nFinancial Advisors and Investments\n\nIt’s important for you, as the consumer, to understand what your planner recommends and why. You should not follow an advisor’s recommendations unquestioningly; it’s your money, and you should understand how it’s being deployed. Keep a close eye on the fees you are paying—both to your advisor and for any funds bought for you.\n\nAsk your advisor why they recommend specific investments and whether they are receiving a commission for selling you those investments. Be alert for possible conflicts of interest.\n\nThe advisor will set up an asset allocation that fits both your risk tolerance and risk capacity. Asset allocation is simply a rubric to determine what percentage of your total financial portfolio will be distributed across various asset classes. A more risk-averse individual will have a greater concentration of government bonds, certificates of deposit (CDs), and money market holdings, while an individual who is more comfortable with risk may decide to take on more stocks, corporate bonds, and perhaps even investment real estate. Your asset allocation will be adjusted for your age and for how long you have before retirement.\n\nEach financial advisory firm is required to make investments in accordance with the law and with its company investment policy when buying and selling financial assets.\n\nA commonality among firms is that financial products are selected to fit the client’s risk profile. Suppose, for example, a 50-year-old individual who’s already amassed enough net worth for retirement and is predominantly interested in capital preservation. They may have a very conservative asset allocation of 45% in stock assets (which may include individual stocks, mutual funds, and/or exchange-traded funds (ETFs)) and 55% in fixed-income assets such as bonds. Alternatively, a 40-year-old individual with a smaller net worth and a willingness to take on more risk to build up their financial portfolio may opt for an asset allocation of 70% stock assets, 25% fixed-income assets, and 5% alternative investments.\n\nWhile taking into account the firm’s investment philosophy, your personal portfolio will also fit your needs. It should be based on how soon you need the money, your investment horizon, and your present and future goals.\n\nRegular Financial Monitoring\n\nOnce your investment plan is in place, you’ll receive regular statements from your advisor updating you on your portfolio. The advisor will also set up regular meetings to review your goals and progress and to answer any additional questions you may have. Meeting remotely via phone or video chat can help make those contacts happen more often.\n\nIn addition to regular, ongoing meetings, it’s important to consult with your financial advisor when you anticipate a significant change in your life that might impact your financial picture, such as getting married or divorced, adding a child to your family, buying or selling a home, changing jobs, or getting a job promotion.\n\n$78,371 The average base salary of a financial advisor, according to Indeed.\n\nSigns You May Need an Advisor\n\nAnyone can work with a financial advisor at any age and at any stage of life. You don’t have to have a high net worth; you just have to find an advisor suited to your situation.\n\nThe decision to enlist professional help with your money is a highly personal one, but any time you’re feeling overwhelmed, confused, stressed out, or scared by your financial situation may be a good time to look for a financial advisor. If you cannot afford such help, the Financial Planning Association may be able to help with pro bono volunteer assistance.\n\nIt’s also fine to approach a financial advisor when you’re feeling financially secure but you want someone to ensure that you’re on the right track. An advisor can suggest possible improvements to your plan that might help you achieve your goals more effectively. Finally, if you don’t have the time or interest to manage your finances, that’s another good reason to hire a financial advisor.\n\nThose are some general reasons you might need an advisor’s professional help. Here are some more specific ones.\n\nNone of Your Savings Is Invested or You Don’t Know How to Invest\n\nBecause we live in a world of inflation, any money you keep in cash or in a low-interest account declines in value each year. Investing is the only way to make your money grow, and unless you have an exceptionally high income, investing is the only way most people will ever have enough money to retire.\n\nYou Have Investments, But You’re Consistently Losing Money\n\nEven the best investors lose money when the market is down or when they make a decision that doesn’t turn out as they’d hoped. But, overall, investing should increase your net worth considerably. If it’s not doing that, hiring a financial advisor can help you find out what you’re doing wrong and correct your course before it’s too late.\n\nYou Don’t Have a Current Estate Plan\n\nA financial advisor can also help you put together an estate plan to make sure your assets are handled according to your wishes after you die. And if you aren’t properly insured (or aren’t sure what insurance you need), a financial advisor can help with that, too. Indeed, a fee-only financial advisor may be able to offer a less biased opinion than an insurance agent can.\n\n1:43 7 Steps To Evaluate A Financial Advisor\n\nHow to Choose a Financial Advisor\n\nFollow these simple steps in order to choose the right financial advisor that provides strategies and services that fit your goals and needs.\n\nInterview a few different advisors and compare their services, style, and fees. Don't forget to be prepared with a questionnaire to help you decide if they are a good fit.\n\nLook for an advisor who focuses on educating. A good financial advisor shouldn't just sell their services, but provide you with the tools and resources to become financially savvy and independent, so you can make informed decisions on your own.\n\nLook for an advisor who is educated and well-informed. You want an advisor who stays on top of the financial scope and updates in any area, and who can answer your financial questions about a myriad of topics.\n\nLook for an advisor that matches your style and beliefs, and understands your emotions. For example, you want an advisor that is well aware of your risk tolerance and encourages you to take wise decisions.\n\n\n\nThe Costs of a Financial Advisor\n\nA rule proposed by the Department of Labor (DOL) would have required all financial professionals who work with retirement plans or give retirement plan advice to provide advice that is in the client’s best interest (the fiduciary standard), as opposed to simply suitable for the client (the suitability standard). The rule was passed, its implementation was delayed and then a court killed it.\n\nBut in the roughly three-year interval between President Obama's proposal of the rule and its eventual death, the media shed more light than it had previously on the different ways financial advisors work, how they charge for their services and how the suitability standard might be less helpful to consumers than the fiduciary standard. Some financial advisors decided to voluntarily move to a fiduciary standard or more heavily promote that they already operated under that standard. Others, such as certified financial planners™(CFPs), already adhered to this standard. But even under the DOL rule, the fiduciary standard would not have applied to non-retirement advice.\n\nCommission-Based Model\n\nUnder the suitability standard, financial advisors typically work on commission for the products they sell to clients. This means the client may never receive a bill from the financial advisor. On the other hand, they could end up with financial products that charge higher fees than other similar products on the market. These same financial products may result in the advisor earning a high commission.\n\nFee-Based Model\n\nUnder the fiduciary standard, advisors either charge clients by the hour or as a percentage of their assets under management (AUM). A typical percentage fee is 1%, while a typical hourly fee for financial advice ranges from $120 to $300. Fees vary by location and the advisor’s experience. Some advisors may offer lower rates to help clients who are just getting started with financial planning and can’t afford a high monthly rate. Typically, a financial advisor will offer a free, initial consultation. This consultation provides a chance for both the client and the advisor to see if they’re a good fit for each other.\n\nCombination of Fees and Commissions\n\nFinancial advisors can also earn a combination of fees and commissions. A fee-based financial advisor is not the same as a fee-only financial advisor.\n\nA fee-based advisor may earn a fee for developing a financial plan for you, while also earning a commission for selling you a certain insurance product or investment.\n\nA fee-only financial advisor earns no commissions.\n\nThe Securities and Exchange Commission (SEC) proposed its own fiduciary rule called Regulation Best Interest in April 2018. In some ways, it was considered to be less strict than the DOL’s fiduciary rule, while also addressing some of the concerns of the critics of the DOL's fiduciary rule. At the same time, the SEC's rule was more all-encompassing because it would not be limited to retirement investments."}, {"url": "https://www.ft.com/content/3adc969b-212f-40d2-a1b7-d0126428fa58", "page_content": "When John Salton wanted to transfer out of his final salary defined benefit (DB) pension worth £600,000 to retire early, travel more and take on new hobbies, he thought he would make a good candidate.\n\nSalton, 55, has three pension pots and owns two properties with his wife, who also has her own pension.\n\nBut his adviser recommended that he remain in his DB pension.\n\n“I’m pretty disappointed,” Salton said. “My pension money is out of my control and someone else has a say over what I can do about it.”\n\nHis case is a predicament facing many on the cusp of retirement. Five years ago, though, he may have received a different decision.\n\nAs the Financial Conduct Authority (FCA) has brought in measure after measure — such as the ban on contingent charges where the adviser was only paid if the transfer occurred — to clean up a history of poor advice in the pensions transfer market and protect consumers, it has become tougher for advisers to operate in this space.\n\nMeanwhile, the risks associated with giving DB transfer advice have grown, sending adviser professional indemnity insurance (PII) and regulatory fees skyrocketing. Client fees have increased as a result.\n\nColin Tanner, a financial adviser at Tanner Financial Advice, said he had seen his PII premium jump by 363 per cent and regulatory costs increase by 306 per cent in three years, despite not even advising on pension transfers.\n\nTransferring out of a DB pension means giving up a guaranteed income for life for a lump sum, which attempts to match the pension being given up. But the transfer value offered is at the discretion of the scheme’s trustees.\n\nRecent FCA data show about 1,000 firms have left the DB market over the past two years. Firms not having adequate PII for this form of advice has been cited as a key reason.\n\nChanging direction\n\nOver the past four years, the FCA has also changed its stance towards DB pension transfers.\n\nInitially proposing in 2017 to be more neutral — removing the guidance that an adviser start from the assumption that a transfer would be unsuitable — the regulator in 2018 backtracked, saying it would maintain its “unsuitable” stance.\n\nThe FCA found significant evidence of unsuitable advice, including in relation to the British Steel Pension Scheme.\n\nEveryone agrees the quality of DB transfer advice needed to improve.\n\nDominic James Murray, financial adviser at Cameron James, said: “[FCA scrutiny] has raised the bar for the quality of advice. Sometimes people need protection from themselves because they do not realise the benefits they are giving away.”\n\nKate Shaw, chartered financial planner at Financial Life Planning, added: “There is great need for advice in this area and it has become more difficult to do the business, but that can only be a good thing. It needs to be difficult, because nine times out of 10 it is not the right thing for clients to do.”\n\nBut have the measures gone too far?\n\n“Each change to the process that the FCA brings in takes more people out of the market,” Shaw added.\n\n“Unfortunately, it is taking out some of the good folk as well and not necessarily getting rid of some of the big companies doing high volumes [of transfers]. Overall I still think it is in a better place than it was a few years ago.”\n\nSir Steve Webb, former pensions minister and partner at pensions consultancy Lane Clark & Peacock, added: “I know good quality advisers who have just given up on transfer advice because it is not worth the risks. One imagines that [of] those people who are keen to make money out of it, there are still plenty of them around.”\n\nSo where now for people like Salton who have been advised against a transfer?\n\nThey may be able to go ahead with the transfer, and go down the “insistent client” route, demanding that their adviser press ahead, although many advisers are now reluctant to do this.\n\nThey could find another adviser, who might be happy to complete the transfer, but they would have to pay another fee, or they could revisit the issue at a later date.\n\nWebb said: “One key point is to recognise that there are often flexibilities available within the DB scheme. Make sure you explore these.”\n\nThese could include taking early retirement, varying the percentage of the total pension taken in the form of a lump sum, or the option of a partial transfer.\n\nShaw added: “Sometimes people forget the value of their DB scheme. If they want to retire early and have other personal pensions and savings then these can be used to bridge the gap between retirement and the scheme normal retirement age or state pension age.”\n\nUsing equity release could be an alternative option for some to consider.\n\nApplying for a transfer\n\nIt is not a hard and fast rule, but the FCA has provided some guidance on who is best suited to a transfer.\n\nThese include individuals who do not rely only on their DB scheme to meet their income needs and will usually have other sources of retirement income, for example, other pensions and investments.\n\nAlternatively, they may be managing income for wealth or tax planning by taking it sooner or later, in a way that does not affect their ability to meet expenditure needs throughout retirement.\n\nOr they may have a limited life expectancy and want their family to be financially secure on their death.\n\nThere may also be rare occasions when those in serious financial difficulty could benefit from a transfer.\n\nWebb said transfers might also be suitable where a person is divorced and has children they want to pass their wealth to. If they die with a DB scheme, the pension dies with them.\n\nIn some cases, the terms on a transfer might be more generous than the terms on remaining in the DB scheme.\n\nWebb added: “There are plenty of reasons not to transfer, and it is right to assume that most people shouldn’t but there will be individuals for whom it makes sense.”\n\nBut trying to find affordable high quality advice is not an easy task. Searching online will not tell you who is a good or bad adviser.\n\nWebb suggested one way to address this could be for more pension scheme trustees to recommend good quality advisers that members can use — a trend he is seeing more frequently.\n\nThis tactic has already been employed by retail giant Tesco. It went even further and appointed a third-party governance provider to monitor the transfer advice provided by the two firms appointed to give retirement support to 220,000 members of its £13bn pension scheme.\n\nAs lockdown is lifted and the full measure of coronavirus is felt, it has been predicted that there will be mass redundancies prompting many more to seek a DB transfer.\n\nThe pandemic has also caused many to reassess their life choices — to use their pension and make hay while the sun is still shining.\n\nIma Jackson-Obot is deputy features editor of FTAdviser; Twitter"}, {"url": "https://www.businessinsider.com/5-important-lessons-i-learned-about-investing-as-a-financial-adviser-2017-7", "page_content": "5. You get what you don’t pay for\n\nIn most situations, there’s a basic truth that we have all come to accept: “You get what you pay for.”\n\nI reminded myself of this after my wife and I celebrated the “gender reveal” of our little baby girl…who ended up being our little baby boy. Long story short: we got the ultrasound from a place we found on Groupon. In other words, we got what we paid for.\n\nWhen it comes to investing, though, the exact opposite is true: You get what you don’t pay for.\n\nThat is, what you don’t pay in fees (to financial advisers and investments) typically comes back to you in the form of higher returns on your money.\n\nAnd, here’s another truth: Not all financial advisers are created equally.\n\nThere are a wide-range of professionals who consider themselves “financial advisers” — all with varying levels of experience, education and areas of expertise. Here are some of the common titles you’ll find:\n\n• Chartered Financial Analyst (CFA)\n\n• Certified Public Accountant (CPA)\n\n• Certified Financial Planner (CFP)\n\n• Wealth Manager\n\n• Investment Consultant\n\n• Personal/Private Banker\n\n• Insurance Agent/Broker\n\nRegardless of their specialty or certification, the way most of these advisers make money can be grouped into four categories:\n\n• Commission from the products they sell\n\n• A percentage of “assets under management” (AUM)\n\n• Flat fee for services\n\n• Salary\n\nDepending on how the financial adviser is paid (ie: commission), there may be a conflict of interest and misaligned incentives. In order for the adviser to maximize his or her personal income, they must recommend products that pay them the most. Products that pay them the most aren’t typically in your best interests (ie: whole life insurance).\n\nNow, in fairness, a counter-argument can easily be made as your wealth grows and your investments become more complicated.\n\nWhen I look around at the wealthiest people I know, they all have financial advisers. Do they have financial advisers because they’re wealthy or are they wealthy because they have financial advisers? Probably the former. But, it’s difficult to frown upon someone paying for financial advice while we simultaneously pay for people to cook for us, clean for us and mow our lawns. They’re all things we don’t feel like doing or don’t feel comfortable doing ourselves.\n\nSo, if the thought of managing your own investments is paralyzing then here are a few tips in finding an appropriate adviser:\n\n1. If you’re new to investing, check out Betterment : automated investing at a low cost (.25%) with simple, tax-efficient portfolios.\n\n2. If you have several accounts already or >$100k in investments, check out Personal Capital — free dashboard to view all your accounts, analyze fees and personalized advice for a slightly higher fee (.89%).\n\n3. Vanguard is always a good option as well. Easily the most preferred, investor-friendly company in the industry.\n\n4. If you find new technology intimidating and prefer to work with someone face to face, then you can check out anyone’s background ahead of time and which licenses they carry here: BrokerCheck.\n\n• Series 7 means they can sell you stocks. Series 6 means they’re limited to mutual funds and annuities.\n\n• You’ll probably have to pay at least 1% for their advice. Make sure they’re worth it.\n\n• Also, don’t listen to anyone that calls insurance an investment. Chances are they can only sell insurance.\n\nTo summarize, you can spend time learning about advisers, their expertise, how they’re paid, etc. or you can spend time learning about investments.\n\nTakeaway: No one cares more about your stuff than you do."}, {"url": "https://www.investmentnews.com/the-great-wealth-transfer-is-coming-putting-advisers-at-risk-63303", "page_content": "Financial adviser Karen DeRose never saw it coming.\n\nA week after the husband of a couple she’d worked with for 10 years dropped dead of a heart attack, Ms. DeRose received an order to transfer the couple’s $6 million portfolio into a self-directed account at Charles Schwab & Co. Inc.\n\nThat’s when Ms. DeRose realized she had overlooked the obvious: the couple’s son.\n\n“I felt bad,” she said. “I felt like all of the planning we had done really didn’t matter.”\n\n/assets/graphics src=”/wp-content/uploads2015/08/CI10029671.JPG”\n\nSome of that planning even took the form of “family meetings,” which included the couple and their two daughters, Ms. DeRose said.\n\n“All of the sudden, the son shows up with lots of questions,” she said. “We had built a trusted relationship and all of a sudden it had come undone.”\n\nUnfortunately, Ms. DeRose’s experience with the transfer of assets from one generation to the next is all too common.\n\n66% of children fire their parents’ financial adviser after they receive an inheritance. of children fire their parents’ financial adviser after they receive an inheritance.\n\nOver the next 30 years, an epic $30 trillion will be passed down from baby boomers to Generation X to millennials. In that enormous transfer of wealth, many investment advisers will see their hard-earned asset base evaporate — and the value of their firms plummet — because they don’t know how to connect with their clients’ children. The problem is especially difficult for the many advisers ill-equipped to connect with clients who are technology savvy and expect a very different service experience than their parents did.\n\n“The largest wealth transfer ever is coming and financial advisers are looking down the barrel of not being used by the heirs of the vast majority of their current clients,” said Vic Preisser, founding director of the Institute for Preparing Heirs, a consultancy that works with advisers on wealth transfer issues.\n\nA hit to the business\n\nThe simple, undeniable truth is this: Sixty-six percent of children fire their parents’ financial adviser after they inherit their parents’ wealth, according to an InvestmentNews survey of 544 advisers in April.\n\nAdvisers unable to prove they are effective at establishing relationships with clients’ children and serving the next generation also will discover their businesses are worth less to potential buyers, experts said.\n\nHow often advisers meet with clients’ children How advisers rank their business risks (Hover over the pie.)\n\n“Advisers are woefully behind in getting to know their clients’ adult children,” said Bernie Clark, head of Schwab Advisor Services. “The tricky part is that boomers still have to be served, so I think advisers will have to go through a period with multiple models to make sure they are serving all clients.”\n\nAt the same time, the giant wealth transfer on the horizon could be an opportunity for advisers who have a plan to draw in the children of their best clients and become the trusted family adviser.\n\nTraining the next generation\n\nWith proper guidance, advisers might even train heirs to be better stewards of their family’s wealth than past generations — a bar that wouldn’t be that tough to raise, given 70% of family money disappears by the end of the second generation, and 90% is gone by the end of the third, according to oft-cited research of 3,250 families conducted in 2003 by Mr. Preisser and Roy Williams, an independent wealth transfer consultant who helps advisers.\n\n“ Advisers are woefully behind in getting to know their clients’ adult children. ” — Bernie Clark, head of Schwab Advisor Services\n\n“Bringing up wealth transfer with clients shows them you care about the future success of their children; it can be a huge differentiator,” said Diane Doolin, an adviser with Morgan Stanley Wealth Management. “It’s not just about advisers losing assets when the clients die, it’s about taking the current relationships to a deeper level.”\n\nIn most cases, however, advisers aren’t even trying to make inroads with clients’ children.\n\nOnly 20% of advisers are targeting younger family members of their clients, according to a survey in February by Corporate Insight.\n\nMany advisers said they don’t know how to appeal to clients’ kids, or they believe that connection is not worth the effort.\n\nFor some, it’s too much work to invest time developing relationships with a client’s family, given how diluted assets can become as they are passed from one generation to the next, said Silviya Simeonova, an analyst at Corporate Insight. Advisers who have their own retirement in sight and aren’t planning a second evolution of their firm are especially reluctant to invest the time.\n\n“I’m not trying to collect new clients,” said Walter Altorfer, 71, principal of WRA & Associates. He rarely works with clients’ children and isn’t worried about his firm’s valuation.\n\nMr. Altorfer doesn’t foresee selling his advisory firm, having found it too difficult to find a successor.\n\nBut advisers who are dedicated to building their firms and creating sustainable businesses will need to start imagining what their balance sheets would look like if 66% of their best clients departed.\n\nNext-generation client explains why she stayed\n\n\n\nOften, heirs bring the assets to an adviser they already work with or choose to manage the money themselves. Sometimes the inheritance is split among so many parties there’s not much left to manage. And in other cases, heirs just spend the assets too quickly.\n\nImmune to advice\n\nMike Johnson, a principal with Moneta Group, got a call from one of his client’s children the same week the client died to ask how soon he could have his mother’s money.\n\n“He said he was building a pool and the contractor wanted to be paid,” Mr. Johnson said.\n\nSome children aren’t used to paying for financial advice and don’t see the wisdom in doing so, even after they are suddenly awash in wealth.\n\n“I see 60-year-old children, who have created little of their own wealth, leave and take the assets because they don’t want to pay us to manage the money,” said Sybil Praski, an adviser with Prosperion Financial Advisors. “I have worked with clients for 25 years sometimes and all of a sudden their wealth was gone.”\n\nFrom the child’s perspective, if they do want the advice but have no relationship with their parents’ adviser or one of their own, they will likely seek a financial professional who is closer to their own age or one who appeals to their own interests or needs. Why would they remain with an adviser who’s destined to retire before they do?\n\nThe biggest obstacle to retaining assets passed to heirs #1 Lack of a relationship #2 Children spend the assets too quickly #3 Inheritance is split among too many parties #4 Clients are unwilling to include adult children in meetings about wealth #5 Children show no interest in having the same adviser manage their assets #6 Inherited assets are too small to manage profitably\n\nFor Anne, who asked that her last name not be included, the responsibility of overseeing the multimillion-dollar estate her father left her three years ago when he died was overwhelming.\n\nShe transferred her inheritance away from the two brokers who had handled the money for her father at a large firm because she didn’t feel she was getting enough direction.\n\nAnne brought the assets to Family Wealth Planning Group because Tom La Macchio and his partners seemed to better understand what she needed, which was everything from hand-holding to creating a trust for her son.\n\n“I had big decisions in front of me and I didn’t know how to deal with it,” said Anne, 58. “With their guidance, I could start seeing pathways and a vision of how to do this.”\n\nThe lack of a relationship, like in the case of Anne and her father’s financial professionals, is the No. 1 reason advisers lose assets when clients leave their wealth to their children, according to the InvestmentNews survey of advisers.\n\nThe absence of a relationship between advisers and clients’ children also affects how much buyers may be willing to offer for an advisory firm, even before the money changes hands between generations.\n\nWhen calculating an advisory firm’s value, experts factor in the age of its clients and discount businesses whose clients are predominantly in their 70s and above, said John Furey, owner of consulting firm Advisor Growth Strategies.\n\nFirm valuations will be higher if the adviser can show the business has a relationship with the children of their older clients, such as the younger generation having accounts with the adviser, he said. Experts also look at the adviser’s track record of retaining assets after clients die.\n\n“There can be a precipitous drop in revenue if suddenly clients are 72 and advisers aren’t doing a good job retaining the assets or bringing in new clients,” said Tom Nally, president of TD Ameritrade Institutional. “Advisers have to start preparing for these huge shifts of wealth if they want to be able to capitalize on the opportunity.”\n\nTD Ameritrade and many of the nation’s largest custodians and brokerages recognize the impact the coming transfer of wealth could have on their own firms. They offer programs to help advisers develop skills to embrace multigenerational clients and create teams that can better serve diverse investors.\n\nFidelity Investments is one of several large firms that have employed the Institute for Preparing Heirs to train advisers on how to reach out to a client’s family members and establish trusting relationships. And timing is everything.\n\n“If you wait until an event-driven crisis to engage with surviving children, it’s likely too late,” said David Canter, executive vice president of practice management and consulting at Fidelity’s clearing and custody business.\n\nDo initiatives work?\n\nNot everyone agrees that formal initiatives targeting the next generation are effective.\n\nRichard Hough, chief executive of Silvercrest Asset Management Group, said the education and other programs offered by some wirehouses and banks are more “marketing and window dressing” than something real.\n\n“Clients are going to set the tone for how and in what way you’re going to be allowed to work with their children,” he said.\n\nSilvercrest, which manages $18 billion in assets, retains generations of clients with its intense focus on client service, Mr. Hough said. The firm’s advisers assist clients with major events in the children’s lives, such as buying a first house or advising on a trust for a child.\n\n“You end up working with the next generation and hopefully you’re remembered for playing a big role in those important events in their lives,” he said.\n\nPaul Reilly, chief executive of Raymond James Financial, puts it this way: Advisers should be thinking in terms of serving families from the beginning, not just couples or individuals.\n\n“Advisers have to make kids, the inheritors, part of the trusted relationship,” he said. “The best advisers are family advisers.”\n\n“ There can be a precipitous drop in revenue if suddenly clients are 72 and advisers aren’t doing a good job retaining the assets or bringing in new clients. ” — Tom Nally, president of TD Ameritrade Institutional\n\nThinking about the family as the “client” isn’t new for the firm. When Bob James started Raymond James he would not accept a client whose spouse and children didn’t attend meetings once a year, Mr. Reilly said.\n\n“He might have been ahead of his time 50 years ago, but the advice should be that if advisers aren’t going to follow the funds or bring people into their teams who work with their clients’ kids, they’re going to have a generational business and the assets are going to go somewhere else,” Mr. Reilly said.\n\nIf advisers do decide it’s worth reaching out to the next generation, they should do so early because it takes years to establish a relationship.\n\nFor example, advisers should help grandparents set up 529 college savings plans, make sure there is enough life insurance to protect the children, create lifetime gifting plans “and find any other way to get an introduction to the children,” said William Morgan, president of Herbein Wealth Management.\n\nHis firm’s fee structure supports its multigenerational goal. Everyone within a family pays the same rate at Herbein Wealth Management. If grandparents have an investment account, their children and grandchildren can open accounts with the firm and be charged the same rate — likely much lower than they’d get elsewhere if their asset base is nominal.\n\n“We’re not batting 1,000, but last year we had three deaths of significant clients for our firm and we retained every one of those,” Mr. Morgan said.\n\nToday Ms. DeRose is among the advisers who actively work to stem the flow of assets as wealth is ceded to children. First and foremost, she reaches out to clients’ children before they seek out their own adviser.\n\nEven more important, Ms. DeRose brought her son, who is 32, into DeRose Financial Planning Group. Now clients’ children have an associate at the firm who is their peer and relates well with them.\n\n“It also shows we’re doing our own intergenerational planning,” she said."}, {"url": "https://asic.gov.au/about-asic/news-centre/find-a-media-release/2021-releases/21-311mr-former-wa-financial-adviser-and-his-company-charged-with-dishonest-conduct/", "page_content": "ASIC media releases are point-in-time statements. Please note the date of issue and use the internal search function on the site to check for other media releases on the same or related matters.\n\nMonday 22 November 2021\n\n21-311MR Former WA financial adviser and his company charged with dishonest conduct\n\nFormer AMP financial adviser David Michael Fong and his Perth-based company Fong Financial Planners Pty Ltd have each been charged with engaging in dishonest conduct while carrying on a financial services business.\n\nASIC alleges that in 2014, while an authorised representative of AMP, Mr Fong via Fong Financial Planners acted dishonestly when he:\n\ncompleted and submitted false information in clients’ insurance applications;\n\nfailed to adequately disclose fees to clients;\n\nacted without client instructions; and\n\nfailed to adequately disclose the effect of advice, for instance clients becoming uninsured after closing their superannuation accounts.\n\nMr Fong appeared before the Perth Magistrates Court on 19 November 2021 and was granted conditional bail.\n\nThe matter is being prosecuted by the Commonwealth Director of Public Prosecutions. It has been listed for further mention on 14 January 2022.\n\nBackground\n\nIn 2017, ASIC permanently banned Mr Fong from providing financial services or engaging in credit activities (17-204MR). Mr Fong appealed ASIC’s decision to the Administrative Appeals Tribunal and the appeal process is stayed pending the outcome of the criminal proceedings.\n\nAt the time of the offending, for an individual, the maximum penalty for engaging in dishonest conduct while providing financial advice and carrying on a financial services business was 10 years imprisonment, a fine of either $765,000 or three times the total value of the benefits reasonably attributable to the offence, or both.\n\nAt the time of the offending, for a company, the maximum penalty for engaging in dishonest conduct while providing financial advice and carrying on a financial services business was a fine of either $7,650,000 or three times the total value of the benefits reasonably attributable to the offence, or 10% of turnover in the 12-month period ending at the end of the month in which the offence was committed.\n\nEditor's note:\n\nOn 14 January 2022, the matter was adjourned to 11 February 2022 for mention.\n\nEditor's note 2:\n\nOn 11 February 2022, the matter was adjourned to 25 March 2022 for mention.\n\nEditor's note 3:\n\nOn 25 March 2022, the matter was adjourned to 3 June 2022 for committal mention.\n\nEditor's note 4:\n\nOn 3 June 2022, the charges relating to Mr Fong were administratively adjourned to 29 July 2022 for committal mention.\n\nOn 17 June 2022, the charges relating to Fong Financial Planners Pty Ltd were administratively adjourned to 29 July 2022 for committal mention.\n\nEditor's note 5:\n\nOn 29 July 2022, the matter was adjourned to 16 September 2022 for committal mention.\n\nEditor’s note 6:\n\nOn 16 September 2022, the matter was adjourned to 14 October 2022 for committal mention.\n\nEditor's note 7:\n\nOn 14 October 2022, the matter was adjourned to 18 November 2022 for committal mention.\n\nEditor's note 8:\n\nOn 18 November 2022, the matter was adjourned to 13 January 2023 for committal mention.\n\nEditor's note 9:\n\nOn 13 January 2023, the matter was adjourned to 24 February 2023 for committal mention.\n\nEditor's note 10:\n\nOn 24 February 2023, the matter was adjourned to 24 March 2023 for committal mention."}, {"url": "https://asic.gov.au/about-asic/news-centre/find-a-media-release/2018-releases/18-189mr-asic-bans-financial-adviser-for-4-years/", "page_content": "ASIC media releases are point-in-time statements. Please note the date of issue and use the internal search function on the site to check for other media releases on the same or related matters.\n\nThursday 28 June 2018\n\n18-189MR ASIC bans financial adviser for 4 years\n\nASIC has banned financial adviser Mr Graeme Ashley Cowper, of Oatley, NSW, from providing financial services for 4 years after an investigation found he was not adequately trained or competent to provide financial services.\n\nThis is the first administrative banning decision made by ASIC’s new Financial Services and Credit Panel following a hearing before it.\n\nBetween 2007 and 2015 Mr Cowper worked as a financial adviser at National Australia Bank, AON and Tynan Mackenzie while based in Sydney. He then transferred to Ipac Securities Limited, which is a wholly-owned subsidiary of AMP Limited.\n\nMr Cowper was banned from providing financial services after the Panel found that Mr Cowper:\n\nhad a fundamental lack of understanding of the duties and obligations imposed by the Corporations Act 2001 on providers of financial services; and\n\non providers of financial services; and gave advice to a number of clients over the period 2007 to 2013 that did not appear to be appropriate.\n\nIn particular, the Panel found Mr Cowper:\n\nrecommended gearing strategies when the client could not afford it;\n\nrecommended clients switch to a new superannuation fund but did not give sufficient detail in the Statement of Advice (“SOA”) to enable the client to decide whether or not to proceed with the advice; and\n\nrecommended clients switch to a new superannuation fund without warning them in the SOA that the new fund was expensive compared to their old fund, or that it included insurance that did not cover the client’s pre-existing health condition which was covered in the current fund.\n\nThe banning will appear on ASIC’s Banned and Disqualified Persons Register and be reflected on ASIC’s Financial Advisers Register.\n\nMr Cowper has the right to appeal to the Administrative Appeals Tribunal for a review of ASIC's decision.\n\nASIC's MoneySmart website has useful information for clients of advisers to help them understand what to do if their adviser has been banned.\n\nBackground\n\nThe banning of Mr Cowper is part of ASIC's Wealth Management Project. The Wealth Management Project was established in October 2014 to lift the standards of major financial advice providers. The Wealth Management Project focuses on the conduct of the largest financial advice firms (NAB, Westpac, CBA, ANZ, Macquarie and AMP).\n\nASIC's work in the Wealth Management Project covers a number of areas including:\n\nworking with the largest financial advice firms to address the identification and remediation of non-compliant advice; and\n\nseeking regulatory outcomes, where appropriate, against licensees and advisers.\n\nAs part of its Wealth Management Project, ASIC has banned 48 advisers and one director from the financial services industry. Four bannings are the subject of appeals, with a further banning stayed pending the outcome of an appeal.\n\nThe Financial Services and Credit Panel\n\nThe Financial Services and Credit Panel (FSCP) is a pool of industry participants that ASIC draws upon when forming individual sitting panels (sitting panels). Each sitting panel comprises two members from the FSCP and an ASIC staff member. Sitting panels operate alongside our existing administrative decision-making processes for retail financial services and credit activities by providing an element of peer review.\n\nSitting panels decide whether we will make banning orders against individuals for misconduct in the course of providing retail financial services and/or engaging in credit activities. A banning matter may be referred to an individual sitting panel where we consider it appropriate for peer review because of its significance, complexity or novelty (refer: 17-388MR).\n\nEditor's note:\n\nMr Cowper sought review of ASIC’s banning decision in the Administrative Appeals Tribunal. However, on 29 January 2019, he withdrew his application."}, {"url": "https://leapwiseadvisory.com/about/our-people/tom-gash/", "page_content": "Tom Gash is Leapwise Managing Director, leading the organisation, overseeing some of its most critical projects, and developing many of Leapwise’s tools and methods. He has spent his career supporting decision making of ministers and prime ministers, senior officials and the boards of non-profits and private companies in the UK, Europe, Middle East, North America and Australasia.\n\nTom works at the interface of government, business and academia and is passionate about the need for better decision making to solve our most pressing social problems. Prior to becoming and independent adviser and founding Leapwise, Tom was Director of Research at the Institute for Government, where he was part of the organisation’s set up team and board and led a range of ground-breaking research to improve government effectiveness. Before this, he was senior adviser (Home Affairs) in the Prime Minister’s Strategy Unit in the mid-2000s, a role that followed a period supporting FTSE 100 executives as a strategy consultant with Boston Consulting Group.\n\nTom’s sector specialism is crime, security and justice and he operates across Leapwise service areas. He is the author of Times ‘Thought’ Book of the Year “Criminal: The Truth About Why People Do Bad Things” (Penguin, 2016), an in-demand international speaker on both criminal and organisational decision-making, and a regular media commentator (BBC, Sky, ABC, Fox) and government Select Committee expert witness. He has directed over 100 consulting and research projects and authored over 30 academic and practitioner focused articles, as well as articles for The Financial Times, The Times, The Guardian, WIRED, and Prospect Magazine. He is an Honorary faculty member of University College London and a Senior Fellow of the Institute for Government.\n\nFollow Tom on Twitter or Linked In\n\n\n\nGet our free guide on below:"}]}