{"Tom Wise worked as a financial adviser before being elected to Parliament in 2001.": [{"url": "https://www.thetimes.co.uk/article/mep-tom-wise-charged-with-fiddling-accounts-and-money-laundering-8bhdm600dlm", "page_content": "A Member of the European Parliament and his assistant have both been charged with false accounting and money laundering after an investigation into claims that they misused thousands of pounds of expenses.\n\nTom Wise, 60, who was hoping to stand for re-election in June, was elected for the UK Independence Party but now sits as an independent after being expelled from the party.\n\nSponsored\n\nHe and Lindsay Jenkins, his researcher, could face lengthy jail terms if found guilty.\n\nThe charges against Mr Wise, an MEP for the East of England, come less than two months before European elections for which an EU-wide survey has forecast a record low turnout. They follow a series of claims about the misuse of the generous expenses on offer in Brussels,"}, {"url": "https://alchetron.com/Tom-Wise", "page_content": "Thomas Harold Wise (born 13 May 1948) was an Independent and UKIP Member of the European Parliament (MEP) for the East of England. A former police officer, he was elected in 2004 as a member of the UK Independence Party but later had the whip withdrawn when allegations of misuse of parliamentary expenses surfaced in The Sunday Telegraph. Following an inquiry carried out by the European Anti-Fraud Office, Wise was formally charged with false accounting and money laundering by Bedfordshire Police. After initially pleading not guilty, he admitted the charges and was sentenced in November 2009 at Southwark Crown Court to a two-year term of imprisonment. He is thought to be the first MEP to be jailed for expenses fraud. Sentencing him, the judge said that Wise had engaged in \"deliberate and blatant dishonesty\" and had set about to defraud the European Parliament almost as soon as he was elected.\n\nEarly career\n\nBorn in Bournemouth, Wise attended Bournemouth School between 1959 and 1965, before completing a Diploma in Public Speaking in 1967. He served with Dorset Police before embarking on a career in the food distribution and processing industry. He became the UK Managing Director of a German herbs and spices company. From 1981 to 1989 he was a member of the Liberal Party.\n\nUKIP\n\nWise joined the United Kingdom Independence Party (UKIP) in 1997. He served as office manager to Jeffrey Titford MEP, during this period he worked on the rules governing MEPs' expenses and gained an expertise in the system which he would later use to his advantage. He was the fourth-placed candidate on UKIP's candidate list in for the European Parliament elections in 1999, and also stood as the party's candidate in the 1997, 2001 and 2005 general elections for the South West Bedfordshire constituency. In the 2005 general election, he came fourth with 4.2% of the votes cast.\n\nHe was elected as an MEP for UKIP in the 2004 European elections. He was UKIP's official spokesman on the Culture, Youth, Media and Sport Committee until his suspension by the party in February 2007. In his first speech to the Committee on 4 October 2004, Wise criticised the proposed budget and drew allusions with Nazi Propaganda Minister Joseph Goebbels. In his maiden speech to the Parliament on 16 December 2004, Wise blamed the European Union for creating unacceptable conditions for the transit of animals around Europe. Wise also spoke out against the Proposed directive on the patentability of computer-implemented inventions\n\nIndependent\n\nAfter losing the party whip in March 2007, Wise continued as an Independent within UKIP's Independence/Democracy parliamentary grouping pending the outcome of the fraud inquiry.\n\nDuring his time as an MEP, Wise disputed the genuine nature of the September 11th attacks. and labelled Russia-based businessman Alisher Usmanov, who is a shareholder of Arsenal F.C. a \"gangster and racketeer\"\n\nFollowing the decision to press criminal charges against him, Wise decided not to contest the 2009 European Parliament elections. He has however said that he wants to stand as an MP in the 2010 General Election.\n\nExposure\n\nOn 23 October 2005, a reporter for the Sunday Telegraph, Daniel Foggo, published an article accusing Wise of claiming £36,000 a year from the European Parliament in the name of his researcher, Lindsay Jenkins, while only passing on about a sixth of that amount to her. According to now-repealed Rules governing the payment of expenses and allowances to Members of the European Parliament, MEPs could claim up to £125,000 per year for assistants' wages, but this money must be paid either directly to the employees or to a third-party agent. The rules did not allow the funds to pass directly through the hands of MEPs themselves.\n\nFoggo later reported that Wise had supplied the European Parliament's Payments Office with a \"contract\" including her name and details, which stipulated that the £36,000 allowance should be paid into an account named \"Stags\". This account, held with the Co-operative Bank, was in fact Wise's own business account and its full name was \"T Wise trading as Stags\". The actual agreement between Wise and Jenkins stated that she would receive monthly \"retainer\" payments of £500 for advice and statistical research, with any extra work to be paid on top. Bank documents obtained by Foggo showed that between November 2004 and October 2005, Wise had paid £39,100 to this account, out of which Jenkins received £13,555. These funds were the only monies coming into the account. In another breach of the payment regulations, some of the £13,555 paid to Jenkins represented work done on behalf of other UKIP members, including party leader Nigel Farage who had agreed to fund the publication of a eurosceptic pamphlet by Jenkins. A further £19,000 was transferred from the account, some of which to pay off credit cards.\n\nOn 29 October, Wise admitted to breaching the rules and, to head off a scandal, agreed to repay £25,230. An internal UKIP inquiry was launched after the Parliament became aware of the affair, but no action was taken and the results of the investigation were kept secret. As Daniel Foggo later reported, UKIP's former leader, Roger Knapman, halted the inquiry after it uncovered serious wrongdoing, believing that the European Parliament would clear Wise. Farage told reporter Daniel Foggo that Wise \"had committed a simple, silly error by making himself a \"paying agent\" for his own staff.\"\n\nSuspension from UKIP\n\nOn 23 February 2007, party sources at UKIP discovered that the European Parliament had passed the affair to OLAF, the European Anti-Fraud Office. A UKIP meeting was convened in Brussels on 28 February 2007 at which Wise formally admitted to having spent £6,500 from the allowance on a dark green Peugeot 406 which he still drove, but refused to disclose how he had spent a further £13,000 of the funds. After a heated discussion, a decision was taken to remove the whip; both Knapman and fellow MEP Mike Nattrass challenged the decision and threatened to reconsider their futures in the party. Farage emphasised that, if cleared by the OLAF investigation, Wise would be welcomed back into the party, adding that he thought \"there is a great deal of public sympathy for us.\" Wise was however suspended by the party.\n\nFollowing his suspension, Wise spent a further £8,000 of the allowance in legal fees in contemplation of a libel case against Greg Lance-Watkins who had published claims on the Internet relating to Wise's activities. No action was ultimately brought against Lance-Watkins.\n\nNews of the World sting\n\nIn May 2008, the News of the World published details of a sting involving Tom Wise. A female reporter posing as a work experience student recorded Wise brazenly admitting in a Belgian bar that he had little idea of what his job as a Member of the European Parliament entailed, adding \"I don't know what an MEP's job is. No one's ever given me a job description. I've no idea what an MEP should or shouldn't do. So you make it up as you go along.\" He boasted of fiddling the Parliament's expenses system, stating \"Yes, I am milking the system [...] I have a simple philosophy. You and your parents are paying for me. Sorry, tough!\" The newspaper used its leading article to call for a change in the rules governing MEPs' expenses following the exposé.\n\nArrest and charges\n\nOn 20 June 2008, Wise was arrested by Bedfordshire Police's Economic Crime Unit on suspicion of making a false instrument, obtaining money by deception by transfer and converting criminal property. He was bailed until 29 October. Bedfordshire Police made the arrest after having been contacted by OLAF.\n\nOn 20 April 2009 the Crown Prosecution Service advised Bedfordshire Police to charge both Wise and Jenkins with one count each of false accounting contrary to the Theft Act 1968 and one count each of money laundering contrary to the Proceeds of Crime Act 2002. Both were scheduled to appear before the City of Westminster Magistrates' Court on in April 2009 to face the charges. Wise indicated that he was innocent and would fight the charges which carry a maximum 14-year jail term. He is thought to be the first MEP to face criminal charges over the misuse of parliamentary funds, and the second former UKIP MEP after Ashley Mote to have faced criminal charges during a parliamentary session.\n\nTrial and conviction\n\nWise appeared in court on 27 April 2009 and spoke only to confirm his name and plead not guilty. Jenkins also denied the charges. District Judge Daphne Wickham released both on conditional bail until 8 June. The case was transferred to Southwark Crown Court and charges specified: that Wise and Jenkins \"falsified a document, namely a contract for provision of services, an application for secretarial assistance allowance and invoices\". Also, that they used funds \"received from the European Parliament intended for use as payments for secretarial services.\"\n\nThe three-week trial began on 2 November 2009. Judge Geoffrey Rivlin QC heard the prosecution argue that Wise channelled parliamentary funds into an account he secretly controlled so that he could pay credit card debts and buy fine wines. He made separate payments of £2,228 and £1,260 to wine importers, and maintained the deception by asking Jenkins to sign blank documents which he completed later. But for his exposure, Wise would, according to prosecutors, have claimed up to £180,000.\n\nOn the third day of the trial, just before Nigel Farage was due to give evidence against him, Wise began several hours of negotiations with his legal team after which he changed his plea to guilty and said he was entirely to blame for the fraud. This resulted in Jenkins being acquitted. He was sentenced on 10 November 2009 to two years imprisonment, the sentence having been reduced by one year on account of his guilty plea. In sentencing him, Judge Geoffrey Rivlin declared that:\n\nIt is no exaggeration to say that you had hardly got your feet beneath your desk as an MEP before you were planning to defraud the parliament to which you were elected and the people you were elected to serve. This was very deliberate and blatant dishonesty. You did not fall into this offence as a result of some unfortunate combination of unforeseen circumstances which happened to suddenly present you with temptation. You knew the system of expenses inside out and this was a claim you devised and planned with some care.\n\nThe judge added that, in addition to jail, Wise would also have to pay £30,000 towards the prosecution's costs.\n\nPersonal life\n\nWise is married to Janet and, until his imprisonment, lived in Linslade near Leighton Buzzard in Bedfordshire. He has two grown-up children.\n\nWise has a developed interest in wines, having followed courses arranged by the Wine & Spirit Education Trust and has reached \"the level just below Master of Wine\". He has spoken of having a wine cellar containing 1,000 bottles of wine."}, {"url": "https://www.bbc.co.uk/news/uk-politics-15348166", "page_content": "Click on the pictures to read profiles of David Cameron's Conservative-Lib Dem coalition cabinet:\n\nPRIME MINISTER - DAVID CAMERON\n\nConservative David Cameron was virtually unknown outside Westminster when he was elected Tory leader in December 2005 at the age of 39.\n\nThe Old Etonian had dazzled that year's party conference with his youthful dynamism and charisma, reportedly telling journalists he was the \"heir to Blair\".\n\nHe has sought to match the former PM by putting the Conservatives at the centre ground of British politics.\n\nBefore becoming leader, he was the Conservatives' campaign co-ordinator at the 2005 general election and shadow education secretary.\n\nHe was special adviser to Home Secretary Michael Howard and Chancellor Norman Lamont in the 1990s before spending seven years as a public relations executive with commercial broadcaster Carlton.\n\nDEPUTY PRIME MINISTER - NICK CLEGG\n\nIn just five years, Liberal Democrat Nick Clegg, at 43 the same age as Mr Cameron, has gone from political obscurity to the absolute front line of British politics.\n\nAfter becoming MP for Sheffield Hallam at the 2005 election, he was promoted to Europe spokesman, before moving on to the home affairs role.\n\nWhen Sir Menzies Campbell resigned as leader in 2007, he entered the race to succeed him, in the end narrowly beating Chris Huhne.\n\nHe has campaigned against the government over civil liberties and opposed the Conservatives' spending cuts plans, attempting to create a distance between the Lib Dems and what he calls the \"old parties\".\n\nBut he really came to prominence during the televised debates ahead of the general elections, being judged in polls to have been the big winner of the first one.\n\nHowever, this appeared to do little to help the Lib Dems when they actually lost seats on 6 May. The party, though, retained enough MPs to become the vital players in the hung parliament.\n\nFOREIGN SECRETARY - WILLIAM HAGUE\n\nSince he returned to the shadow cabinet in 2005, Conservative William Hague has become a key adviser to David Cameron, and was seen as de facto deputy party leader.\n\nThe new foreign secretary has plenty of experience to call upon, having been Tory leader himself from 1997 to 2001 and shadow foreign secretary until the election.\n\nA witty and engaging Commons performer who is popular with grassroots Tory members, Mr Hague entered Parliament in 1989 having been special adviser to Chancellor Sir Geoffrey Howe. He was soon promoted to be a social security minister and in 1995 entered the Cabinet as Secretary of State for Wales.\n\nIn addition to his duties as shadow foreign secretary, Mr Cameron put Mr Hague in charge of rebuilding the party in the North of England, as chairman of its Northern Board.\n\nMr Hague has said that as foreign secretary, he is determined to put in place a \"distinctive British foreign policy\" and the situation in Afghanistan is a priority.\n\nMinister of State (Europe) - David Lidington (Conservative) Once a special adviser to Foreign Secretary Douglas Hurd and a parliamentary aide to William Hague, he is regarded as being less eurosceptic than those who occupied this important role when the Tories were in opposition\n\nMinister of State - Jeremy Browne (Liberal Democrat) A former Lib Dem press chief, he has been MP for Taunton since 2005. Was the party's deputy Treasury spokesman before the election.\n\nMinister of State - Lord Howell (Conservative)\n\nJunior Foreign Office minister - Henry Bellingham (Conservative)\n\nJunior Foreign Office minister - Alistair Burt (Conservative)\n\nCHANCELLOR - GEORGE OSBORNE\n\nOne of David Cameron's closest friends and Conservative allies, George Osborne rose rapidly after becoming MP for Tatton in 2001.\n\nMichael Howard promoted him from shadow chief secretary to the Treasury to shadow chancellor in May 2005, at the age of 34.\n\nMr Osborne took a key role in the election campaign and has been at the forefront of the debate on how to deal with the recession and the UK's spending deficit.\n\nEven before Mr Cameron became leader the two were being likened to Labour's Blair/Brown duo. The two have emulated them by becoming prime minister and chancellor, but will want to avoid the spats.\n\nBefore entering Parliament, he was a special adviser in the agriculture department when the Tories were in government and later served as political secretary to William Hague.\n\nThe BBC understands that as chancellor, Mr Osborne, along with the Treasury will retain responsibility for overseeing banks and financial regulation.\n\nMr Osborne said the coalition government was planning to change the tax system \"to make it fairer for people on low and middle incomes\", and undertake \"long-term structural reform\" of the banking sector, education and the welfare state.\n\nFinancial Secretary - Mark Hoban (Conservative) A chartered accountant, he first stood for Parliament in 1997 before being elected in 2001.\n\nExchequer Secretary - David Gauke (Conservative)\n\nCommercial Secretary - Sir James Sassoon (Conservative) Not an MP. To be given peerage\n\nHOME SECRETARY AND MINISTER FOR WOMEN AND EQUALITY - THERESA MAY\n\nTheresa May is the biggest winner so far in jobs allocated in the new cabinet, becoming only the second woman to hold the post of Home Secretary.\n\nShe was the first woman to become Conservative Party chairman, under the leadership of Iain Duncan Smith.\n\nShe then took up the culture and family portfolios before being made shadow Commons leader by David Cameron.\n\nShe has been a keen advocate of positive action to recruit more women Tories to winnable seats and was a key architect of the \"A list\" of preferred candidates.\n\nA passionate moderniser she famously ruffled feathers when she told Tory activists they were seen as members of the \"nasty party\".\n\nMs May was the shadow work and pensions minister ahead of the election.\n\nImmigration Minister - Damian Green (Conservative)\n\nThe 54-year-old rattled the previous government over immigration and sparked a cause celebre after being arrested by police investigating leaks - from his new government department.\n\nSecurity Minister - Baroness Pauline Neville-Jones (Conservative)\n\nThe baroness, 70, is a former governor of the BBC and was the first woman to chair the UK's Joint Intelligence Committee. She has extensive experience in foreign affairs and security.\n\nPolice Minister - Nick Herbert (Conservative)\n\nThe 47-year-old is a previous shadow justice minister. More recently, the MP for Arundel and South Downs held a shadow environmental brief. The role of police minister is held jointly with the Ministry of Justice.\n\nMinister For Equalities - Lynne Featherstone (Liberal Democrat) First elected to Parliament in 2005, the former Haringey councillor and London Assembly member served as youth and equalities spokesperson for her party before the election.\n\nParliamentary Under Secretary of State - James Brokenshire (Conservative) Was a shadow Home Office minister when the Conservatives were in opposition. MP for Bexley.\n\nDEFENCE SECRETARY - PHILIP HAMMOND\n\nPhilip Hammond has built up a reputation as an articulate and effective Commons performer since being elected MP for Runnymede and Weybridge in 1997.\n\nA former director of companies supplying medical equipment, he was initially a member of the Conservative shadow health team before going on to serve as trade and industry spokesman. He also backed Michael Portillo's 2001 leadership bid.\n\nIn summer 2002, he went to shadow the now defunct Office of the Deputy Prime Minister and local government department before being made shadow Chief Secretary to the Treasury, at the age of 51, in the July 2007 reshuffle.\n\nHe became Transport Secretary after David Cameron's coalition took power after the 2010 election, building on his reputation there as an effective performer before being shifted into the defence brief after the resignation of Liam Fox from the job in October 2011.\n\nArmed Forces Minister - Nick Harvey (Liberal Democrat)\n\nThe 48-year-old MP for North Devon was his party's shadow defence secretary from 2006.\n\nJunior Defence Minister - Gerald Howarth (Conservative)\n\nGerald Howarth was the shadow defence minister from 2002, with responsibility for procurement and the air force.\n\nJunior Defence Minister - Andrew Robathan (Conservative)\n\nLORD CHANCELLOR AND SECRETARY OF STATE FOR JUSTICE - KEN CLARKE\n\nMr Cameron has previously said that Mr Clarke was a \"big figure\" with \"great experience\". He was the last chancellor to lead the UK out of recession - during the John Major government of the 1990s.\n\nHis return to the Tory frontbench last year was seen as somewhat of a gamble for Mr Cameron given that Mr Clarke - who held a host of ministerial jobs in the Thatcher and Major governments - had staunchly pro-European views.\n\nThese views were widely seen to be the reason for his failure to win the three party leadership contests he entered - but Mr Cameron decided that Mr Clarke's experience was worth the risk of reopening party splits.\n\nMr Clarke was president of the union at Cambridge, became a QC in 1980 and after a succession of junior ministerial jobs he served as health, education and home secretaries before becoming chancellor from 1993 to 1997.\n\nMinister of State - Lord McNally (Liberal Democrat)\n\nTom McNally is the Lib Dem Leader in the House of Lords. A former senior Downing Street adviser, MP and founding member of the SDP, he entered the House of Lords in 1995.\n\nJunior Justice Minister - Crispin Blunt (Conservative)\n\nJunior Justice Minister - Jonathan Djanogly (Conservative)\n\nHEALTH SECRETARY - ANDREW LANSLEY\n\nAndrew Lansley, a former civil servant, became an active Conservative in the 1980s after a spell as private secretary to Norman Tebbit.\n\nIn 1990 he became head of the Conservative Research Department and was one of the architects of the Tories' surprise 1992 election victory. However, he later faced criticism for his central role in the disastrous 2001 poll campaign.\n\nHe returned to the shadow cabinet in 2003 under Michael Howard as shadow health secretary, the role he continues to hold under David Cameron.\n\nMr Cameron had long guaranteed Mr Lansley - who has played a key role in convincing people that the NHS is a high priority for the Conservatives - the role of health secretary in a government led by him.\n\nMinister of State - Paul Burstow (Liberal Democrat) Former Liberal Democrat chief whip, he is regarded as an expert on care for the elderly\n\nMinister of State - Simon Burns (Conservative)\n\nJunior Health Minister - Anne Milton (Conservative)\n\nJunior Health Minister - Earl Howe (Conservative) One of about ninety remaining hereditary peers in the House of Lords, the former banker held a number of ministerial positions in the Major government. He has been a shadow health spokesman since 1997\n\nEDUCATION SECRETARY - MICHAEL GOVE\n\nTory Michael Gove was seen as one of the brightest talents in the 2005 intake. The former Times journalist is a key member of David Cameron's inner circle who helps write many of his speeches.\n\nAs the Tories' housing spokesman, Mr Gove made a name for himself as an effective Commons performer in attacks on the government's home information packs.\n\nHe was drafted into the shadow cabinet, as children, schools and families spokesman, at the age of 39 when his leader split the education brief in two to reflect Gordon Brown's Whitehall changes.\n\nMr Gove headed the Policy Exchange think tank for three years before landing the safe seat of Surrey Heath.\n\nHe had previously said he was prepared to give up a post in the new Cabinet to ensure the deal with the Lib Dems went ahead, but he sticks with the education brief in government.\n\nSchools Minister - Nick Gibb (Conservative)\n\nBorn in 1960, Nick Gibb was a shadow education and skills minister under Michael Howard in 2001, and then from May 2005 was shadow education minister and shadow schools minister. He also has frontbench trade and treasury experience.\n\nMinister of State - Sarah Teather (Liberal Democrat)\n\nSarah Teather was Britain's youngest MP when she was elected to Parliament in a by-election in Brent East in September 2003. She was the Liberal Democrats' shadow housing minister before the election.\n\nJunior minister - Tim Loughton (Conservative)\n\nBorn in 1962, the former fund manager was most recently the shadow minister of children. He also has experience of environment and health policy. Recently lived with families on a council estate for a reality TV show.\n\nParliamentary Under Secretary of State - Jonathan Hill (Conservative)\n\nBUSINESS SECRETARY - VINCE CABLE\n\nVince Cable has had a long journey to reach the front rank of politics, having been a Labour and then an SDP supporter before its merger with the Liberals to become the Liberal Democrats.\n\nAn economist by profession, he entered Parliament as MP for Twickenham in 1997 and has gradually built up his powerbase among the Lib Dems.\n\nAs the party's deputy leader and Treasury spokesman he saw his stock rising during the credit crunch because of his earlier warnings.\n\nWhen he stood in as temporary leader after the resignation of Sir Menzies Campbell, he memorably described Gordon Brown as going from \"Stalin to Mr Bean\".\n\nHe is also expected to be a member of a new ministerial committee which is dedicated to creating banking policy, and chaired by the chancellor.\n\nMinister of State - Mark Prisk (Conservative)\n\nMinister of State - John Hayes (Conservative)\n\nJunior Minister - Edward Davey (Liberal Democrat) Was the party's foreign affairs spokesman in opposition\n\nJunior Minister - Ed Vaizey (Conservative)\n\nJunior Minister - Baroness Wilcox (Conservative)\n\nWORK AND PENSIONS - IAIN DUNCAN SMITH\n\nThis is a return to the front line for former Conservative leader Iain Duncan Smith, the MP for Chingford and Woodford Green.\n\nA former army officer, who saw active service in Northern Ireland, Mr Duncan Smith entered Parliament in 1992 and rapidly established himself as one of the Maastricht rebels that life so difficult for then Tory leader John Major.\n\nHe was seen as a rising star of the Eurosceptic right and, after a spell as shadow defence secretary under William Hague, was the surprise victor in the September 2001 leadership contest, beating better-known and more experienced, Europhile candidate Ken Clarke.\n\nHe had a torrid time as the Tory leader, failing to land any real blows on then PM Tony Blair and enduring a relentless barrage of criticism from the press and, in some cases, his own MPs.\n\nIn November 2002, he urged his party to \"unite or die\" in response to persistent whisperings of a challenge to his leadership, but a year later he was ousted after narrowly failing to win the backing of enough MPs in a vote of confidence.\n\nAfter losing the Tory leadership, he has successfully reinvented himself as a social reform champion who, with his centre-right think tank Centre for Social Justice, has played an influential role in developing Conservative policy on welfare and the \"broken society\".\n\nMinister of State - Chris Grayling (Conservative) The former shadow home secretary and MP for Epsom and Ewell, 48, was denied a Cabinet role. Earlier this year he was secretly recorded suggesting people who run B&Bs in their homes should have the right to reject homosexual guests.\n\nMinister of State - Steve Webb (Liberal Democrat) Elected to Parliament in 1997, the former professor of social policy at Bath University has held a number of frontbench positions. An expert on pensions, he is regarded as being on the left of the party.\n\nMinister for Welfare Reform - Lord Freud (Conservative) Welfare expert who advised Labour on reform of the benefits system but them switched sides and start working with the Conservatives. Was ennobled in 2009.\n\nJunior Minister - Maria Miller (Conservative) Was shadow families minister in opposition\n\nJunior Minister - Lord Freud\n\nENERGY AND CLIMATE CHANGE - ED DAVEY\n\nLiberal Democrat Ed Davey was appointed Energy and Climate Change Secretary on 3 February 2012 following the resignation of Chris Huhne.\n\nMr Davey was elected MP for the newly-created seat of Kingston in 1997 and has held a series of frontbench roles. Popular within the party, he was seen as an outside contender to succeed Sir Menzies Campbell when he stood down in 2007.\n\nAfter serving as the Liberal Democrat spokesman for foreign affairs prior to the 2010 election, he was appointed business minister responsible for the Post Office, Royal Mail and employment relations in the coalition government.\n\nMinister of State - Charles Hendry (Conservative)\n\nMinister of State - Gregory Barker (Conservative)\n\nParliamentary Under Secretary of State - Lord Marland (Conservative)\n\nCHIEF SECRETARY TO THE TREASURY - DANNY ALEXANDER\n\nDanny Alexander was Nick Clegg's chief of staff and the Liberal Democrats' campaign co-ordinator throughout the election.\n\nHe was also the former media chief of pro-euro campaign group Britain in Europe, which brought together leading Labour and Lib Dem voices with business groups.\n\nFirst elected to Parliament in 2005, he rose to prominence when Mr Clegg became party leader in 2007.\n\nThe 38-year-old was the author of the party's 2010 election manifesto, becoming the Scottish Secretary in David Cameron's initial coalition cabinet.\n\nHe was promoted to chief secretary - a crucial role overseeing spending cuts - to succeed David Laws after was forced to quit over his expenses after less than three weeks in the job.\n\nThe Inverness, Nairn, Badenoch and Strathspey MP won one of 11 seats for the Lib Dems in Scotland.\n\nSCOTTISH SECRETARY - MICHAEL MOORE\n\nMichael Moore - the MP for Berwickshire, Roxburgh and Selkirk - was named Secretary of State for Scotland at the age 44 years.\n\nThe Lib Dem MP took over from Danny Alexander, who was promoted to Chief Secretary to the Treasury after David Law's resignation less than three weeks after the May 2010 election.\n\nMichael Moore was elected MP for Tweeddale, Ettrick and Lauderdale at the 1997 general election, succeeding David Steel, for whom he had previously worked as a researcher.\n\nHe was elected to the new constituency in 2005, following boundary changes. Before the 2010 election he held a number of front bench spokesman jobs, including defence, foreign affairs and international development.\n\nAdvocate General for Scotland - Lord Wallace (Liberal Democrat) One of his party's most senior figures, he was deputy first minister for Scotland and acting first minister after the death of Donald Dewar and the resignation of Henry McLeish. He was an MP between 1983 and 2001 and an MSP between 1999 and 2007.\n\nJunior Minister - David Mundell (Conservative) The only Conservative MP in Scotland, he was shadow Scottish secretary in opposition\n\nCHIEF WHIP - PATRICK MCLOUGHLIN\n\nPatrick McLoughlin - the Tory chief whip while the party was in opposition, will carry on as the Government Chief Whip.\n\nThe former miner is the MP for Derbyshire Dales.\n\nWhen the Conservatives were in power, he was a minister at the departments of transport, employment, trade and industry, and in the whips' office. In opposition, he became deputy chief whip in 1998.\n\nMr McLoughlin's mother was a factory worker and he worked as a farm labourer before following his father and grandfather into the pits.\n\nHe spoke out against Arthur Scargill in the miners' strike.\n\nDeputy Chief Whip - Alistair Carmichael (Liberal Democrat) MP for Orkney and Shetland since 2001.\n\nDeputy Chief Whip - John Randall (Conservative)\n\nGovernment Whip - Mark Francois (Conservative)\n\nWhip - Michael Fabricant (Conservative)\n\nWhip - Angela Watkinson (Conservative)\n\nWhip - Jeremy Wright (Conservative)\n\nWhip - Brooks Newmark (Conservative)\n\nWhip - James Duddridge (Conservative)\n\nAssistant Whip - Philip Dunne (Conservative)\n\nAssistant Whip - Stephen Crabb (Conservative)\n\nAssistant Whip - Robert Goodwill (Conservative)\n\nAssistant Whip - Shailesh Vara (Conservative)\n\nAssistant Whip - Bill Wiggin (Conservative)\n\nAssistant Whip - Chloe Smith (Conservative)\n\nAssistant Whip - Norman Lamb (Lib Dem) Also chief parliamentary adviser to the deputy prime minister\n\nAssistant Whip - Mark Hunter (Lib Dem)\n\nCOMMUNITIES AND LOCAL GOVERNMENT SECRETARY - ERIC PICKLES\n\nEric Pickles was first elected to the Commons in 1992, representing an Essex seat far from his Yorkshire roots.\n\nHe has extensive local government experience, having led Bradford District Council for three years up to 1991.\n\nHe has also served in a variety of shadow ministerial roles, including transport, local government and social security spokesman, earning a reputation for loyalty and good humour.\n\nHe boosted his reputation and profile in the party by masterminding its landmark victory over Labour in the Crewe and Nantwich by-election and was appointed party chairman in 2009.\n\nAnd he became a regular and confident media performer in the months leading up to the 2010 general election.\n\nMinister for Decentralisation - Greg Clark (Conservative) Before becoming at MP in 2005, Greg Clark was director of policy for the Conservative Party from March 2001 for three Tory leaders - William Hague, Iain Duncan Smith and Michael Howard.\n\nMinister for Housing - Grant Shapps (Conservative) An MP since 2005, Grant Shapps was one of the most media-friendly shadow ministers. Has held the housing brief for some years and says his proudest political achievement was founding the Conservative Homelessness Foundation.\n\nJunior Minister - Andrew Stunell (Liberal Democrat) A former Baptist preacher, he was deputy chief whip of the Liberal Democrats. One of the party's four-strong team which negotiated the landmark coalition deal with the Conservatives\n\nJunior Minister - Bob Neill (Conservative) A former barrister, he served on the Greater London Council and London Assembly before becoming an MP. Was shadow minister for local government and planning in opposition\n\nJunior Minister - Baroness Hanham (Conservative) Since being made a life peer in 1999, she has held a number of shadow briefs in the House of Lords\n\nATTORNEY GENERAL- DOMINIC GRIEVE\n\nA Conservative activist from an early age - and the son of a former Tory MP - Dominic Grieve was elected to the Commons in 1997 as the MP for Beaconsfield in South Buckinghamshire.\n\nHe is a barrister and was the shadow attorney general for four and a half years until June 2008, when he was appointed shadow home secretary.\n\nHe filled the vacancy created when David Davis quit as an MP to fight a by-election on civil liberties and plans for a 42-day terror detention limit.\n\nMr Grieve is an ex-member of the London Diocesan Synod with an interest in constitutional issues and an opposition to devolution - he is a past shadow Scottish affairs spokesman.\n\nRegarded as a skilled and assiduous Commons performer, he was the Tories' shadow justice secretary ahead of the election. The attorney general is not a full cabinet position under David Cameron.\n\nCULTURE, OLYMPICS, MEDIA AND SPORT - JEREMY HUNT\n\nJeremy Hunt, 43, retains his existing brief in the new cabinet but gets specific responsibility for the smooth running of the 2012 London Olympics.\n\nThe MP for South West Surrey since 2005, he became the Conservatives' culture spokesman. He was previously the party's spokesman on disabilities and welfare reform.\n\nHe replaced Hugo Swire, who was sacked as culture spokesman shortly after suggesting free museum entry might be scrapped.\n\nMr Hunt, a fluent Japanese speaker, founded a company called Hotcourses, offering guides to help students find the right course before entering University.\n\nSports Minister- Hugh Robertson (Conservative) A former army officer who saw active service in Northern Ireland, Kuwait and Bosnia. After working in the City, he was elected to Parliament in 2001. A keen cricketer, he was shadow sports minister in opposition\n\nArts Minister - Ed Vaizey (Conservative) A former PR executive and speech writer for Michael Howard, he was first elected to Parliament in 2005. Was shadow arts and broadcasting minister in opposition\n\nJunior Minister - John Penrose (Conservative)\n\nCONSERVATIVE CO-CHAIRMAN - BARONESS WARSI\n\nBaroness Sayeeda Warsi is the first Muslim woman to serve in a British cabinet. She is the Conservative Party's co-chairman and minister without portfolio (party fundraiser and close friend of David Cameron, Andrew Feldman, is the other co-chairman but he will not be attending cabinet).\n\nBaroness Warsi was also the first Muslim woman to sit on the front bench of a British political party in July 2007 at the age of 36.\n\nStraight-talking and combative - she describes herself as a \"northern, working-class-roots mum\" - she gave up her job as a solicitor in 2004 to stand for Parliament in her home town of Dewsbury, West Yorkshire, losing out to Labour's Shahid Malik.\n\nShe was also a special adviser on community relations to then Tory leader Michael Howard before becoming the party's vice-chairman. She succeeds Eric Pickles in her new role.\n\nBaroness Warsi says her admiration for Conservative principles is inspired by her father, who went from working in a mill to running a £2m-a-year bed-manufacturing firm.\n\nENVIRONMENT - CAROLINE SPELMAN\n\nCaroline Spelman was the second woman, after Theresa May, to be Conservative Party chairman in 2007, at the age of 49.\n\nShe entered Parliament in 1997 and was tipped for a shadow cabinet post when Michael Howard became Tory leader in 2003. But she was first appointed spokesman for the environment and shadow minister for women - both non-frontbench positions.\n\nShe served as shadow secretary of state for international development, shadow secretary for local and devolved government and most recently shadow communities and local government.\n\nBefore entering Parliament, she worked in agriculture, including a spell as deputy director of the International Confederation of European Beetgrowers, in Paris. She now takes on the environment brief in the Lib Dem Conservative coalition government.\n\nMinister of State - James Paice (Conservative)\n\nJunior Minister - Richard Benyon (Conservative)\n\nJunior Minister - Lord Henley (Conservative)\n\nINTERNATIONAL DEVELOPMENT - ANDREW MITCHELL\n\nConservative MP Andrew Mitchell keeps his existing brief of international development.\n\nHe ran David Davis' leadership campaign in 2005 and kept his shadow-cabinet job under David Cameron's regime.\n\nA former social security minister and whip, Mr Mitchell has also served as shadow minister for police.\n\nHe first became an MP in 1987 and lost his Gedling seat a decade later, only to return as MP for Sutton Coldfield in 2001.\n\nBefore going to university, Mr Mitchell served in the Royal Tank Regiment and later worked for investment bank Lazard.\n\nMinister of State - Alan Duncan (Conservative) The former shadow business secretary was demoted from the shadow cabinet last year after saying MPs would be forced to live \"on rations\" after the expenses scandal. Was most recently shadow prisons minister\n\nJunior Minister - Stephen O'Brien (Conservative)\n\nTRANSPORT - JUSTINE GREENING\n\nJustine Greening was promoted to the cabinet in October 2011 at the age of 42.\n\nMiss Greening, the MP for Putney since 2005, became economic secretary to the Treasury after the 2010 election, succeeding Philip Hammond as transport secretary after he was promoted to defence secretary.\n\nBorn and educated in Yorkshire, Miss Greening studied economics at Southampton University, before getting an MBA from London Business School and worked as a finance manager at British Gas owner Centrica before joining the Commons.\n\nMinister of State - Theresa Villiers (Conservative) A former barrister and MEP, she was elected to Parliament in 2005. Was shadow transport secretary in the run-up to the election but is now number two at the department.\n\nJunior Minister - Norman Baker (Liberal Democrat) A railway enthusiast who was formerly Lib Dem transport spokesman\n\nJunior Minister - Mike Penning (Conservative) Former army officer first elected to Parliament in 2005\n\nNORTHERN IRELAND - OWEN PATERSON\n\nConservative MP Owen Paterson retains his Northern Ireland portfolio.\n\nHe entered the shadow cabinet for the first time, at the age of 50, in David Cameron's July 2007 reshuffle.\n\nA former managing director of the British Leather company, he entered Parliament as MP for Shropshire North in 1997, concentrating on rural issues as a junior agriculture spokesman and chairman of the Conservative Rural Action Group.\n\nA Eurosceptic and member of the right wing Cornerstone Group, which campaigns for traditional Tory values, he helped Iain Duncan Smith during his 2001 leadership bid and was briefly parliamentary private secretary to Ann Widdecombe. He has also served in the Opposition whips office.\n\nMinister of State - Hugo Swire (Conservative) Worked at auction house Sotheby's before going into politics. Was shadow culture secretary but replaced after questioning free museum entry. Now back on the frontbench\n\nWALES - CHERYL GILLAN\n\nConservative MP for Chesham and Amersham since 1992, Cheryl Gillan was a junior education minister in John Major's government.\n\nIn opposition, her front-bench jobs have covered trade and industry, the Foreign Office and a period as a party whip.\n\nBorn in Cardiff, she became a member of the shadow cabinet in 2005, at the age of 53, replacing Bill Wiggin as Welsh spokesman, which became a shadow cabinet post under David Cameron. She retains it in his cabinet.\n\nHer jobs before entering Parliament include marketing consultant and director of British Film Year.\n\nJunior Minister - David Jones (Conservative)\n\nLEADER OF HOUSE OF LORDS - LORD STRATHCLYDE\n\nLord (Tom) Strathclyde has been in the shadow cabinet since 1997 after being promoted to Lords leader following a term as opposition chief whip.\n\nDuring that time, he has led the Conservative charge in an upper house which often gave the Labour government more problems than the House of Commons.\n\nA former insurance broker, Lord Strathclyde has wide experience from the Conservatives' previous spell in government.\n\nHe was a minister of state at the Department of Trade and Industry during the 1990s and his various junior ministerial jobs covered tourism, Scotland, environment and consumer affairs.\n\nLords Chief Whip (Captain of the Honourable Corps of Gentlemen at Arms) - Baroness Anelay (Conservative)\n\nDeputy Chief Whip - Lord Shutt (Liberal Democrat)\n\nBaroness in Waiting - Baroness Northover (Liberal Democrat)\n\nBaroness in Waiting - Baroness Rawlings (Conservative)\n\nBaroness in Waiting - Baroness Verma (Conservative)\n\nLord in Waiting - Earl Attlee (Conservative)\n\nLord in Waiting - Lord Astor (Conservative)\n\nLord in Waiting - Lord De Mauley (Conservative)\n\nLord In Waiting - Lord Taylor of Holbeach (Conservative)\n\nLord in Waiting - Lord Wallace of Saltaire (Liberal Democrat)\n\nLEADER OF THE COMMONS - SIR GEORGE YOUNG\n\nThe North West Hampshire Tory MP, 68, was appointed shadow leader of the Commons after the demotion of Alan Duncan in September 2009. It marked a return to the shadow cabinet after a gap of nine years, and he has now retained the role in government, although he will not be a full cabinet member.\n\nSir George, an old Etonian known as the \"bicycling baronet\" after his election to the old Ealing Acton seat in 1974, had been chairman of the committee on standards and privileges since 2001.\n\nA widely respected figure in Parliament, who has twice stood unsuccessfully for the post of Speaker, he held the shadow Commons leader's job under William Hague's leadership.\n\nHe served as a health, environment and housing minister before becoming Financial Secretary to the Treasury in 1994 under then prime minister John Major. He served as transport secretary from 1995-97.\n\nDeputy Leader of the House - David Heath (Liberal Democrat) The Somerset MP was the Lib Dems Commons business manager in opposition\n\nCABINET OFFICE MINISTER - FRANCIS MAUDE\n\nThe high priest of Tory modernisers, as party chairman Francis Maude was at the forefront of David Cameron's efforts to move the Conservatives to the centre ground - a role that won him few friends among party traditionalists.\n\nHe was demoted to shadow Cabinet Office minister in July 2007, with responsibility for implementing policy. He and his team have been in months of talks with civil servants to ensure as smooth as possible a transition in the event of a new government - and to avoid wasting a first term as Mr Cameron's team believe Tony Blair did in 1997. He has also been working on detailed plans to shake-up the civil service and make them more accountable to ministers.\n\nHe will carry on with a similar policy implementation role in government, but he will not be full cabinet member.\n\nThe son of Tory MP Angus Maude, he has enjoyed a rollercoaster career since his election to the Commons in 1983, serving in the Whips' office, the Foreign Office and the Treasury.\n\nHe lost his seat at the 1992 election but returned to the Commons five years later, serving as shadow chancellor and shadow foreign secretary.\n\nHe managed Michael Portillo's 2001 leadership bid, returning to the backbenches to argue the case for reform when Mr Portillo withdrew from the race.\n\nMinister of State - Oliver Letwin (Conservative) Providing policy advice to the prime minister\n\nMinister for Civil Society - Nick Hurd (Conservative) Son of former Conservative Foreign Secretary Lord Hurd\n\nJunior Minister - Mark Harper (Conservative)\n\nMINISTER OF STATE AT CABINET OFFICE, POLICY - OLIVER LETWIN\n\nA former shadow home secretary and shadow chancellor, Oliver Letwin is one of the most experienced and erudite members of David Cameron's top team responsible for writing the Conservatives' general election manifesto. He will continue with the policy formation role he played in opposition as a minster of state, although he will not be a full member of cabinet.\n\nAn Old Etonian and former merchant banker, he has been MP for West Dorset since 1997.\n\nIn the 2001 election, he famously went into \"hiding\" after suggesting to a newspaper that the party wanted to cut public spending by £20bn.\n\nAfter the 2005 general election, at the age of 50, he decided to take the environment, food and rural affairs brief before being handed the job of reviewing policy across the board and made chairman of the Conservative research department.\n\nUNIVERSITIES AND SCIENCE - DAVID WILLETTS\n\nDavid Willetts is the minister of state for universities and science, within the Department for Business, Innovation and Skills, attending cabinet rather than a full member.\n\nKnown as one of the Conservative Party's big thinkers, former shadow education secretary David \"Two Brains\" Willetts was shunted sideways in the July 2007 reshuffle after a bitter row over the party's policy on grammar schools.\n\nA former Treasury civil servant and graduate of the Number 10 policy unit at the height of Margaret Thatcher's time in office, he subsequently became director of research for the Centre for Policy Studies.\n\nAfter his election to the Commons in 1992, he enjoyed a rapid rise through the ranks before being criticised for his role as a whip during the Neil Hamilton cash-for-questions investigation.\n\nIn opposition, he served as shadow education and employment secretary under William Hague before taking on the work and pensions job. He briefly dallied with a party leadership bid in 2005 before throwing his weight behind David Davis.\n\nSOLICITOR GENERAL - EDWARD GARNIER\n\nEdward Garnier became an MP in 1992 at the age of 40. Appointed Queen's Counsel in 1995, he served under Michael Howard in 2001. He was appointed to David Cameron's shadow frontbench team with responsibilities for justice in the July 2007 reshuffle. In September 2009, he became shadow attorney general."}, {"url": "https://thenewdaily.com.au/news/politics/australian-politics/2022/06/01/cabinet-ministers-labor-list/", "page_content": "A little over a week after Labor claimed victory at the federal election, the new government’s first full cabinet has been sworn in.\n\nWhen compared to the Coalition’s previous few cabinets, there are noticeably more women this time around, and Labor’s cabinet is also more diverse.\n\nBecause Labor is split into left and right factions, the two sides have a power-sharing agreement as to the makeup of the front bench.\n\nIt’s then up to the Prime Minister to actually allocate individual portfolios.\n\nAnd although Labor hasn’t been in government since 2013, almost half of the new cabinet have experience as government ministers.\n\nHere are the faces of the new Labor cabinet.\n\nAnthony Albanese\n\nPrime Minister\n\nMP for Grayndler, NSW\n\nLeft faction\n\nMost of the country should know who Anthony Albanese is by now, given he’s the new Prime Minister. Under Kevin Rudd and Julia Gillard he was the minister for transport and infrastructure, plus minister for regional development. Mr Albanese belongs to the party’s left-wing faction but ran a comparatively centrist campaign.\n\nRichard Marles\n\nDeputy Prime Minister\n\nMinister for Defence\n\nMP for Corio, Victoria\n\nRight faction\n\nAs deputy Labor leader, Richard Marles was always going to be Deputy Prime Minister. He’s also the current minister for defence, and had a very brief stint as minister for trade during Kevin Rudd’s second time as PM in 2013.\n\nPenny Wong\n\nMinister for Foreign Affairs\n\nSenator for South Australia\n\nLeft faction\n\nPenny Wong is a stalwart of the Labor Party and has been a senator for 20 years. She served as the minister for climate change and minister for finance under the Rudd and Gillard governments and was the Labor leader in the Senate after that. As Australia looks to repair several key relationships in the region, Ms Wong, who was born in Malaysia, becomes the first Asian foreign minister and the first openly lesbian front bencher.\n\nJim Chalmers\n\nTreasurer\n\nMP for Rankin, Queensland\n\nRight faction\n\nJim Chalmers worked as an adviser to several state premiers and federal ministers – all from the Labor Party – before his own tilt at Parliament in 2013. He even wrote his PhD thesis on Paul Keating. Mr Chalmers’ wife was a staffer for Julia Gillard, who also attended the couple’s wedding.\n\nKaty Gallagher\n\nMinister for Finance\n\nMinister for the Public Service\n\nMinister for Women\n\nSenator for the ACT\n\nLeft faction\n\nKaty Gallagher spent more than a decade in ACT politics before moving into federal politics in 2019. From 2011 to 2014, she even served as chief minister of the ACT – the territory’s equivalent of a premier. Before that, Ms Gallagher was an organiser for the Community and Public Sector Union, which represents government employees, among others.\n\nDon Farrell\n\nMinister for Trade and Tourism\n\nSenator for South Australia\n\nRight faction\n\nDon Farrell is a long-time senator and former head of the retail union, the Shop, Distributive and Allied Employees Association. When he briefly considered a pivot to state politics in 2014, Labor premier Jay Weatherill threatened to resign. Mr Farrell was one of only a few parliamentarians to abstain from the marriage equality vote in 2017.\n\nTony Burke\n\nMinister for Employment and Workplace Relations\n\nMinister for the Arts\n\nMP for Watson, NSW\n\nRight faction\n\nTony Burke previously held several portfolios under the Rudd and Gillard governments including agriculture, sustainability and multicultural affairs. His electorate includes the diverse suburbs of Western Sydney. He was previously an organiser for the retail union, the Shop, Distributive and Allied Employees Association.\n\nMark Butler\n\nMinister for Health and Aged Care\n\nMP for Hindmarsh, South Australia\n\nLeft faction\n\nMark Butler was the minister for mental health and ageing under the Rudd and Gillard governments, and later held several other portfolios for a shorter period. Mr Butler helped Mr Albanese’s bid to become Labor leader in 2013, only for him to lose to Bill Shorten. Before entering politics, he held a senior role in the Liquor, Hospitality and Miscellaneous Union.\n\nChris Bowen\n\nMinister for Climate Change and Energy\n\nMP for McMahon, NSW\n\nRight faction\n\nChris Bowen is a long-time Labor parliamentarian and held numerous portfolios under the Rudd and Gillard governments, working all the way up to becoming treasurer in 2013 before Labor’s defeat. A few years before entering federal politics, he was the mayor of Fairfield in Sydney’s west.\n\nTanya Plibersek\n\nMinister for the Environment and Water\n\nMP for Sydney, NSW\n\nLeft faction\n\nTanya Plibersek is the other top member of Labor’s left faction, after Mr Albanese. She was deputy opposition leader under Bill Shorten and was widely viewed as a potential candidate for party leader. Ms Plibersek held five portfolios at different times under the Rudd and Gillard governments, including health, women and human services. She was first elected to Parliament in 1998 at the age of 28.\n\nCatherine King\n\nMinister for Infrastructure, Transport, Regional Development and Local Government\n\nMP for Ballarat, Victoria\n\nLeft faction\n\nCatherine King is another long-time Labor MP who has served since 2001. She was the minister for both regional Australia and road safety under the Rudd and Gillard governments.\n\nLinda Burney\n\nMinister for Indigenous Australians\n\nMP for Barton, NSW\n\nLeft faction\n\nLinda Burney is a Wiradjuri woman who has previously held senior positions in the NSW state government cabinet and rose to deputy opposition leader shortly afterwards. She pivoted to federal politics at the 2016 election. Ms Burney is the first woman to hold the portfolio of Indigenous Affairs, and only the second Aboriginal person to do so after outgoing minister Ken Wyatt. The incoming assistant minister for Indigenous Australians is Yanyuwa woman Senator Malarndirri McCarthy.\n\nAmanda Rishworth\n\nMinister for Social Services\n\nMP for Kingston, South Australia\n\nRight faction\n\nAs minister for social services, Amanda Rishworth will oversee mental health support, among other things. She was a practising psychologist before entering Parliament in 2007. However, before that, she was an organiser for the SDA and served as the president of Young Labor in 2000.\n\nBill Shorten\n\nMinister for the NDIS\n\nMinister for Government Services\n\nMP for Maribyrnong, Victoria\n\nRight faction\n\nBill Shorten was the former opposition leader, who led Labor through two elections. At the 2016 election Labor gained several seats but it wasn’t enough to beat the Coalition, while in 2019 the party also lost despite polls pointing to a Labor victory. Since then he’s been relegated to a less prominent role in the cabinet.\n\nMark Dreyfus\n\nAttorney-General\n\nCabinet Secretary\n\nMP for Isaacs, Victoria\n\nRight faction\n\nAttorney-General Mark Dreyfus briefly held cabinet positions during Kevin Rudd’s second stint. Before entering politics in 2007, Mr Dreyfus had roughly 20 years of experience a barrister across commercial, defamation, constitutional and environmental law. He’s also served as a director of the Law Council of Australia and sat on the Victorian Bar Council.\n\nBrendan O’Connor\n\nMinister for Skills and Training\n\nMP for Gorton, Victoria\n\nLeft faction\n\nBrendan O’Connor has been in Parliament since 2001 and held numerous portfolios under the Rudd and Gillard governments, including home affairs, employment and human services. In the 1990s, he was assistant national secretary of the Australian Services Union.\n\nJason Clare\n\nMinister for Education\n\nMP for Blaxland, NSW\n\nRight faction\n\nJason Clare was previously the minister for home affairs, minister for justice and minister for defence materiel under the Rudd and Gillard governments. Before entering Parliament he was a senior adviser to former NSW premier Bob Carr.\n\nJulie Collins\n\nMinister for Housing\n\nMinister for Homelessness\n\nMinister for Small Business\n\nMP for Franklin, Tasmania\n\nLeft faction\n\nJulie Collins is the only Tasmanian in the cabinet, and the only Labor parliamentarian not to have finished high school. She began working for the Labor Party as an administrative assistant at a young age in 1987, before taking on a slew of different state roles for Labor politicians, premiers and government departments.\n\nMichelle Rowland\n\nMinister for Comunications\n\nMP for Greenway, NSW\n\nRight faction\n\nMichelle Rowland entered Parliament in 2010, while Labor was in opposition. She previously worked as a senior telecommunications lawyer and has also been a mayor and healthcare director.\n\nMadeleine King\n\nMinister for Northern Australia\n\nMinister for Resources\n\nMP for Brand, Western Australia\n\nRight faction\n\nMadeleine King is the most recently elected member of the cabinet, entering Parliament in 2016. She is also the only Western Australian. Ms King was a lawyer and political adviser.\n\nMurray Watt\n\nMinister for Agriculture, Fisheries and Forestry\n\nMinister for Emergency Management\n\nSenator for Queensland\n\nLeft faction\n\nMurray Watt was elected as a senator in 2016, but prior to that he was an MP in the Queensland state parliament. He initially worked in law before entering the public service and ultimately working as chief of staff to former Queensland premier Anna Bligh.\n\nEd Husic\n\nMinister for Industry and Science\n\nMP for Chifley, NSW\n\nRight faction\n\nEd Husic once worked as a researcher for former Chifley MP Roger Price, and took over his seat when Mr Price retired at the 2010 election. He became involved with the Communications, Electrical and Plumbing Union of Australia and became national president before entering Parliament. He is of Bosnian descent and was the first Muslim to be elected federally.\n\nClare O’Neil\n\nMinister for Home Affairs\n\nMinister for Cyber Security\n\nMP for Hotham, Victoria\n\nRight faction\n\nIn 2004, at the age of 23, Ms O’Neil was elected mayor of Dandenong, which makes her the youngest female mayor in Australian history. Two years later she was awarded a prestigious Fulbright scholarship to study a master of public policy at Harvard University in the US. Ms O’Neil worked as a manager at McKinsey & Company before being elected to Parliament."}, {"url": "https://www.gov.uk/government/people/tom-tugendhat", "page_content": "Tom Tugendhat MP was appointed Minister of State (Minister for Security) on 6 September 2022 and attends cabinet. He previously served as the Chair of the Foreign Affairs Select Committee from 2017 to 2022.\n\nHe has been the MP for Tonbridge and Malling since 2015.\n\nBefore being elected as an MP, Tom served on operations in Iraq and Afghanistan. He also worked for the Foreign Office, helping to set up the National Security Council of Afghanistan and the government in Helmand Province. On returning to the UK, Tom served as the military assistant and principal adviser to the Chief of the Defence Staff to the British Army.\n\nEducation\n\nTom studied Theology at the University of Bristol, followed by a Master’s degree in Islamic studies at Cambridge University, which included learning Arabic in Yemen.\n\nCareer\n\nAfter graduating, Tom worked in Beirut as a journalist, and soon after established one of Lebanon’s first public relations companies. On his return to the UK, Tom joined the Territorial Army. When the Iraq War broke out in 2003, he was mobilised as an Arabic-speaking intelligence officer to serve with the Royal Marines.\n\nIn 2005, Tom was asked by the Foreign Office to travel to Afghanistan to establish the National Security Council. After two years in Afghanistan and a brief return to the UK, Tom was mobilised and served operationally for a further two years with the Royal Marines, for which he received an MBE, coming off his last patrol in July 2009.\n\nTom went on to work on the Army Strategy Team helping to prepare for the Strategic Defence and Security Review. He later served as the Chief of the Defence Staff’s military assistant and principal adviser. He remains an Army Reserve officer.\n\nDefending Democracy Taskforce\n\nThe Minister is also responsible for establishing and chairing the Defending Democracy Taskforce, a cross-government initiative announced in November 2022 that aims to reduce the risk to the UK’s democratic processes, institutions and society and deliver a secure and resilient UK, free from threats of foreign interference."}, {"url": "https://www.politico.eu/article/20-mps-to-watch-in-2020-conservative-party-labour-liberal-democrats-parliament-british-politics/", "page_content": "Among the 140 new MPs who form the 2019 intake, 20 could sooner or later become big names | Jessica Taylor/EPA-EFE\n\nThis article is part of POLITICO’s Westminster Survival Guide.\n\nWestminster is buzzing with the 140 new MPs who form the 2019 intake.\n\nSome are Boris babies, others are Corbyn champions. They’ve been spotted at Commons drinks receptions, parliamentary Labour Party gatherings, European Research Group meetings and snapping photos in Westminster Hall.\n\nHere are 20 fresh-faced parliamentarians who could sooner or later become big names.\n\n1. Siobhan Baillie, who won the key swing seat of Stroud off Labour, has quickly been marked out as a rising star and is tipped to get promoted quickly. Her backstory — she was born in Yorkshire, left home at 15 and worked her way into the legal profession at 17 without having attended university — makes her a prime example of the kind of person the Conservatives want to be seen as bringing forward.\n\nParty: Conservative\n\n2. Florence Eshalomi beat competition from Momentum to win the fiercely contested selection in Vauxhall — having fought off a similar challenge when she was a member of the London Assembly. Her maiden speech, in which she warned that Londoners risked becoming “desensitized” to knife crime, was widely praised and got covered by the Evening Standard. She has also been applauded for speaking about caring for her mother, who suffered from sickle cell anemia.\n\nParty: Labour\n\n3. Laura Trott is a familiar face in Westminster, having worked for years as a political adviser before becoming director of strategic communications for David Cameron. Elected in the safe seat of Sevenoaks, she is the Tory MP with the highest place on the Private Members’ Bill ballot, guaranteeing that her bill will be debated — and giving her the opportunity to get noticed.\n\nParty: Conservative\n\n4. Fleur Anderson won Putney off the Conservatives and found herself in the spotlight as it turned out to be Labour’s only gain at this election. She has already made an impression among members of the parliamentary party as being quietly competent. She beat Bonnie Craven — who was understood to be the Labour leadership’s preferred candidate — to get selected for the seat, and has now backed Keir Starmer and Rosena Allin-Khan in the party’s leadership contest. She was previously deputy leader of the Labour Group on Wandsworth Council.\n\nParty: Labour\n\n5. Dehenna Davison has been the most successful of the new intake at boosting her profile, and is already well-known in Westminster. The 26-year-old Brexiteer — who became Bishop Auckland’s first-ever Tory MP with a majority of nearly 8,000 — spoke in her maiden speech about wanting to reduce violence after losing her father, who died after being attacked in a pub when she was 13. She has recruited an office staff of young acolytes and is already causing trouble by pushing hard for more NHS investment locally. Her social media following has ballooned since she was elected.\n\nParty: Conservative\n\n6. Sam Tarry, elected in the safe seat of Ilford South, is a former campaign manager to Jeremy Corbyn and director of Momentum. Close to both Rebecca Long-Bailey and Angela Rayner, he is in pole position for a future promotion. He has had a rocky start as an MP, however, facing criticism for not condemning a motion passed by a branch of his local Labour Party that attacked the Board of Deputies of British Jews.\n\nParty: Labour\n\n7. Jonathan Gullis is one of a number of new Tory MPs who come from an unorthodox background. Before getting elected in Stoke-on-Trent North, he worked as a secondary school teacher in Birmingham and was his school’s trade union representative. He comes from a working-class family and joined the Conservatives as a teenager, and will be the kind of person that the party wants to put at the forefront.\n\nParty: Conservative\n\n8. Sarah Owen, elected in the safe seat of Luton North, is Britain’s first female MP of Chinese descent and chair of Chinese for Labour. A former GMB union officer, she is well-connected and well-regarded within the party, with her selection welcomed by members of different factions, making her well-placed for a future promotion. In her maiden speech, she spoke about supporting the NHS and championing diversity.\n\nParty: Labour\n\n9. Richard Holden, who unexpectedly unseated Labour rising star Laura Pidcock in North-west Durham, has taken a more traditional route to becoming a Conservative MP than others in the new intake. He is well-known in Westminster, having worked on Boris Johnson’s leadership campaign and as a special adviser for a series of ministers, including Education Secretary Gavin Williamson. He began working at CCHQ in 2007 after graduating from university.\n\nParty: Conservative\n\n10. Daisy Cooper, elected in the heavily pro-Remain seat of St Albans, previously worked for the Hacked Off campaign for victims of press abuse and the cross-party group More United. She has been appointed Lib Dem spokesperson for justice and culture, but has higher ambitions, suggesting early on that she is considering standing for her party’s leadership.\n\nParty: Liberal Democrat\n\n11. Saqib Bhatti beat Nick Timothy — Theresa May’s former chief of staff — to get selected as the Tory candidate for Meriden. A chartered accountant, he has spoken about being influenced by his father, who moved from Pakistan to the U.K. in search of better opportunities. Before being elected an MP, he was the youngest-ever president of the Greater Birmingham Chambers of Commerce.\n\nParty: Conservative\n\n12. Zarah Sultana caught attention with her combative maiden speech, which decried “forty years of Thatcherism” and sparked a fierce debate about the achievements of the Tony Blair and Gordon Brown governments. Elected in the narrow marginal of Coventry South, she introduced Rebecca Long-Bailey at the launch of her leadership campaign, and is now beefing up her social media presence. She can expect to benefit if Long-Bailey wins.\n\nParty: Labour\n\n13. Miriam Cates, who won Penistone and Stocksbridge off Labour, is a key face of the Conservative Party’s drive to get more women elected (a campaign still in its infancy, given that only a quarter of its MPs are women). Before becoming an MP, she ran a small software company with her husband, and is one of a number of northern Tory women who could rise up the ranks.\n\nParty: Conservative\n\n14. Danny Kruger is one of several former advisers in the new intake, and has made the move from Downing Street — where he worked briefly as an aide to Boris Johnson — to parliament, where he was elected for the safe seat of Devizes. He previously was a speechwriter for David Cameron, and is the son of celebrity chef Prue Leith.\n\nParty: Conservative\n\n15. Alicia Kearns, the new MP for Rutland and Melton, is a former civil servant who has worked on defense and foreign policy and has vowed to focus on counterterrorism and national security as an MP. Together with a colleague, Theo Clarke, she has been working to coordinate the 2019 Conservative intake into a slate to vote for select committee chairs.\n\nParty: Conservative\n\n16. Nadia Whittome is Britain’s youngest MP at 23, representing Nottingham East. She captured headlines when she announced she would keep just £35,000 of her £79,000 salary and give the rest to charities, and has become a fixture of broadcast media rounds as well. On election night, she vowed to be a “new kind of MP, inspired by radical women of color across the world” and champion the same politics as Jeremy Corbyn.\n\nParty: Labour\n\n17. Amy Callaghan narrowly beat Lib Dem leader Jo Swinson in the marginal seat of East Dunbartonshire, quickly becoming one of the highest-profile MPs of the new intake. Marked out by SNP leader Nicola Sturgeon as a rising star, she comes from a working-class background and survived skin cancer after developing it as a teenager. She has pledged to protect the NHS and raise awareness about the symptoms of cancer among young people.\n\nParty: SNP\n\n18. Bell Ribeiro-Addy worked as an adviser to the shadow home secretary, Diane Abbott, before she was elected MP for the safe seat of Streatham. She comes from an activist background, having been black students’ officer for the National Union of Students and convenor of its anti-racism and anti-fascism campaign. She is backing Rebecca Long-Bailey and Richard Burgon in the Labour leadership contest, and could benefit from a victory from the left in the contest.\n\nParty: Labour\n\n19. Lee Anderson wins the prize for the most interesting political journey. A long-term Labour Party member and office manager for Gloria De Piero in Ashfield, he defected to the Conservatives in 2018 and went on to win the seat off Labour at this election. He personifies the Tories’ new voter base in former Labour seats.\n\nParty: Conservative\n\n20. Kenny MacAskill is an unusually experienced newcomer, beating Labour to win the marginal seat of East Lothian. He was previously a member of the Scottish parliament for nearly two decades and Scotland’s Cabinet secretary for justice between 2007 and 2014. He decided to make a comeback to politics because he saw this election as the “final heave” that could lead Scotland to independence. The SNP parliamentary party in Westminster could benefit from his long memory.\n\nParty: SNP"}, {"url": "https://leapwiseadvisory.com/about/our-people/tom-gash/", "page_content": "Tom Gash is Leapwise Managing Director, leading the organisation, overseeing some of its most critical projects, and developing many of Leapwise’s tools and methods. He has spent his career supporting decision making of ministers and prime ministers, senior officials and the boards of non-profits and private companies in the UK, Europe, Middle East, North America and Australasia.\n\nTom works at the interface of government, business and academia and is passionate about the need for better decision making to solve our most pressing social problems. Prior to becoming and independent adviser and founding Leapwise, Tom was Director of Research at the Institute for Government, where he was part of the organisation’s set up team and board and led a range of ground-breaking research to improve government effectiveness. Before this, he was senior adviser (Home Affairs) in the Prime Minister’s Strategy Unit in the mid-2000s, a role that followed a period supporting FTSE 100 executives as a strategy consultant with Boston Consulting Group.\n\nTom’s sector specialism is crime, security and justice and he operates across Leapwise service areas. He is the author of Times ‘Thought’ Book of the Year “Criminal: The Truth About Why People Do Bad Things” (Penguin, 2016), an in-demand international speaker on both criminal and organisational decision-making, and a regular media commentator (BBC, Sky, ABC, Fox) and government Select Committee expert witness. He has directed over 100 consulting and research projects and authored over 30 academic and practitioner focused articles, as well as articles for The Financial Times, The Times, The Guardian, WIRED, and Prospect Magazine. He is an Honorary faculty member of University College London and a Senior Fellow of the Institute for Government.\n\nFollow Tom on Twitter or Linked In\n\n\n\nGet our free guide on below:"}, {"url": "https://www.aarp.org/money/investing/info-2021/beware-of-financial-advisers-with-deceiving-credentials.html", "page_content": "When you walk into my office, you'll see a beautiful crystal plaque recognizing the recipient as one of “America's Top Financial Planners.” It's from a very prestigious-sounding organization that has a mailing address on Pennsylvania Avenue in Washington, DC.\n\nBut before you assume I'm bragging, let me reveal that this plaque was bestowed upon my dog, Max Tailwag'er, and I use it to illustrate how many in the financial services industry buy their way into bogus credentials in an effort to build credibility. The more credibility we create, the more likely you are to hand your money over to us.\n\nFlowers & Gifts Proflowers 25% off sitewide and 30% off select items View Details See All Benefits See more Flowers & Gifts offers > {\"hideCategory\":false,\"useAlternateLanguage\":false,\"headlineIconAltText\":\"\",\"listItems\":[{\"categoryTitle\":\"Flowers \\u0026 Gifts\",\"categoryUrl\":\"/membership/benefits/shopping/flower-gifts/\",\"categoryDeeplinkParam\":\"shoppingandgroceries-flowersandgifts\",\"isLimitedTimeOffer\":false,\"offerJson\":{\"dbr_offer_id\":\"54a1e51ec32c758b0ef69f44cfac6d5c\",\"source_name\":\"Proflowers\",\"offer_title\":\"25% Off Flowers, Plants \\u0026 Gifts\",\"offer_description\":\"\\u003cp\\u003eAs an AARP member, you automatically save 25% sitewide or you can save 30% on select items with promo code AARP30. No minimum purchase amount is required.\\u003c/p\\u003e\",\"offer_short_description\":\"25% off sitewide and 30% off select items\",\"category_list\":\"shoppingandgroceries\",\"subcategory_list\":\"shoppingandgroceries-flowersandgifts\",\"tags\":[{\"tagID\":\"dbr:shoppingandgroceries\",\"title\":\"Shopping \\u0026 Groceries\",\"name\":\"shoppingandgroceries\",\"deeplink_url\":\"/membership/benefits/shopping/\",\"deeplink_param_value\":\"shoppingandgroceries\",\"get_offers_url\":\"/etc/aarp/dbr/ws.api/offers/shoppingandgroceries.json\",\"sub_tags\":[{\"tagID\":\"dbr:shoppingandgroceries/flowersandgifts\",\"title\":\"Flowers \\u0026 Gifts\",\"name\":\"flowersandgifts\",\"deeplink_url\":\"/membership/benefits/shopping/flower-gifts/\",\"deeplink_param_value\":\"shoppingandgroceries-flowersandgifts\",\"get_offers_url\":\"/etc/aarp/dbr/ws.api/offers/shoppingandgroceries-flowersandgifts.json\"}]}],\"vertical_image_url\":\"/content/dam/aarp/benefits_discounts/providers/ftd/258x334-proflowers-feb-2023.jpg\",\"image_url\":\"/content/dam/aarp/benefits_discounts/providers/ftd/1140x641-proflowers-feb-2023.jpg\",\"advertisement_flag\":\"\",\"advertisement_sort_order\":\"\",\"merchant_phone\":\"1-800-315-7527\",\"merchant_phone_label\":\"or, call Proflowers at\",\"howto_redeem\":\"Learn More\",\"howto_redeem_url\":\"https://www.proflowers.com/aarp\",\"howto_redeem_expired\":\"Renew to Learn More\",\"howto_redeem_expired_link\":\"https://appsec.aarp.org/mem/renew\",\"howto_redeem_non_member\":\"Join to Learn More\",\"howto_redeem_non_member_link\":\"https://secure.aarp.org/applications/membershipChallenge/showChallengeForm.action?appName\\u003daccount\",\"howto_redeem_anonymous\":\"Join to Learn More\",\"howto_redeem_anonymous_link\":\"https://appsec.aarp.org/mem/join?campaignid\\u003dUASMBP1\\u0026intcmp\\u003dEWHERE-MBCHAE-LP-MMA-JOIN\",\"howto_redeem_desc\":\"The 25% discount is applied automatically. Enter promo code AARP30 to save 30% on select items.\",\"member_exclusive_flag\":\"no\",\"offer_type\":\"EverGreen\",\"hideLeavingAARP\":\"false\",\"interstitial_desc\":\"You\\u0027ll leave AARP.org and go to the website of a trusted provider. The provider\\u0027s terms, conditions, and policies apply.\",\"dbr_offer_type\":\"discount\",\"restrictions\":\"\\u003cp\\u003eAARP commercial member benefits are provided by third parties, not by AARP or its affiliates. Providers pay a royalty fee to AARP for the use of its intellectual property. These fees are used for the general purposes of AARP. Some provider offers are subject to change and may have restrictions.\\u003c/p\\u003e\\u003cp\\u003eThe 25% discount is applied to the standard retail prices set forth on the PROFLOWERS.COM website. The 30% discount applies to any item in the AARP Choice Collection. Enter promo code AARP30 to receive 30% discount on AARP Choice Collection items at checkout. Discounts are applied to the standard retail prices set forth on the PROFLOWERS.COM website (standard retail prices shall not include sale prices) and are not available on: (a) product customizations including vases or product add-ons, or (b) service, shipping, delivery, care and handling fees (collectively, “Service Fees”), or any other fees and applicable taxes. The discount is available online and through the special toll-free number. Discounts cannot be combined. Quantities may be limited. Delivery for Floral and Gifting Items: For each item delivered by a local florist or shipped direct, a standard Service Fee will apply (the standard Service Fee is waived for ProPerks Icon members). Service Fees may be higher based on day of delivery or product type, or during high volume holiday periods. If an item is not available, a comparable substitute may be provided. Due to the perishable nature of our products, please make any customer service inquiries within 7 days of delivery. For items delivered by a local florist, same day delivery is available in many locations if order is placed before 2 p.m. in recipient\\u0027s time zone. For more information on our delivery policies for these items, see \\u003ca data-overlay-msg\\u003d\\\"AARP.Everywhere.LeavingModal.drawOverlay(this,\\u0027\\u0027,/mnt/overlay/wcm/core/content/sites/properties.html,\\u0027\\u0027,\\u0027You are now leaving AARP.org and going to a website that is not operated by AARP. A different privacy policy and terms of service will apply.\\u0027);return false;\\\" data-default-element-msg\\u003d\\\"AARP.Everywhere.LeavingModal.drawOverlay(this,\\u0027\\u0027,/mnt/overlay/wcm/core/content/sites/properties.html,\\u0027\\u0027,\\u0027You are now leaving AARP.org and going to a website that is not operated by AARP. A different privacy policy and terms of service will apply.\\u0027);return false;\\\" data-displayoverlay\\u003d\\\"displayOverlay\\\" title\\u003d\\\"Proflowers Delivery Policy\\\" rel\\u003d\\\"noreferrer\\\" href\\u003d\\\"https://www.proflowers.com/delivery-policy\\\" target\\u003d\\\"_blank\\\"\\u003ewww.proflowers.com/delivery-policy\\u003c/a\\u003e.\\u003c/p\\u003e\",\"lto_daysleft_start_control\":30,\"is_redeemable_in_person\":\"false\",\"is_redeemable_only_in_person\":false,\"state_blacklist\":[],\"offer_timing\":\"anytime\",\"line_of_business\":\"ASI discounts\",\"asi_category\":\"ASI Shopping\",\"analytics_brand\":\"FTD | Proflowers\",\"analytics_offerid\":\"proflowers\",\"howto_redeem_already_registered_anon\":\"Member Log In\",\"howto_redeem_already_registered_anon_link\":\"https://login.aarp.org/online-community/loginform.action\",\"howto_redeem_already_registered_nonmember\":\"Link your membership\",\"howto_redeem_already_registered_nonmember_link\":\"https://secure.aarp.org/applications/membershipChallenge/showChallengeForm.action?appName\\u003daccount\",\"offer_keywords\":[\"aarp discounts\",\"aarp benefits\",\"flower deals\",\"plant savings\",\"gift discounts\"],\"offer_keywords_spanish\":[\"Beneficios de AARP\",\"Descuentos de AARP\",\"ofertas de flores\",\"ahorros en plantas\",\"descuentos en regalo\"],\"provider_logo\":\"/content/dam/aarp/benefits_discounts/providers/ftd/450x450-proflowers-logo.png\",\"provider_logo_alt_text\":\"Proflowers logo\",\"provider_logo_cdn_uri\":\"https://cdn.aarp.net/content/dam/aarp/benefits_discounts/providers/ftd/450x450-proflowers-logo.imgcache.rev198b42372f4faa150bb5ef89485f37cc.png\",\"provider_logo_width\":\"450\",\"provider_logo_height\":\"450\",\"enable_utm_parameters\":\"\",\"append_aid_paramter\":\"\",\"lto_model_heading\":\"Limited Time Member Offers\",\"lto_advertisement\":\"Member Exclusive Advertisement\",\"ty_socialMissionFlag\":\"true\",\"deeplink_param_value\":\"proflowers\",\"pixel_learn_more_value\":\"\",\"howto_redeem_2\":\"Learn More\",\"howto_redeem_already_registered_nonmember_label\":\"Already a member?\",\"howto_redeem_already_registered_anon_label\":\"Already a member?\",\"image_alt_text\":\"\",\"image_title\":\"Colorful Flowers in vase next to a plate of cookies\",\"image_cdn_uri\":\"https://cdn.aarp.net/content/dam/aarp/benefits_discounts/providers/ftd/1140x641-proflowers-feb-2023.imgcache.rev2a93225f0b94116f91f603518cfcdee3.jpg\",\"tab_label_offer_details\":\"Details\",\"tab_label_restrictions\":\"Disclosures\",\"geoloc_tab_label\":\"Locations\",\"disclaimer_label\":\"\",\"geoloc_provider_legal_info\":\"\",\"geoloc_miles_label_text\":\"Miles\",\"geoloc_show_results_within_label_text\":\"Show results within\",\"geoloc_see_more_button_text\":\"See More\",\"geoloc_find_location_label\":\"Find a Location\",\"geoloc_total_results_label\":\"Result(s)\",\"geoloc_no_results_view_message\":\"There are no locations within a 100 mile radius. Please try another location\",\"geoloc_tab_hint_text\":\"Enter an address, city, or ZIP\",\"geoloc_mobile_list_cta\":\"LIST VIEW\",\"geoloc_mobile_list_cta_url\":\"\",\"geoloc_mobile_map_cta\":\"MAP VIEW\",\"geoloc_mobile_map_cta_url\":\"\",\"geoloc_provider_link_cta_url\":\"\",\"geoloc_experience_type\":\"\",\"ty_ctaText\":\"Continue\",\"geoloc_hide_tab\":\"true\",\"ty_interstitialText\":\"Thanks for visiting aarp.org! Come back again to check out all of the AARP Member Benefits and unlock the full power of membership.\",\"howto_redeem_label\":\"How to Access\",\"ty_interstitialDesc\":\"Come back again to check out all of the AARP Member Benefits and unlock the full power of membership.\",\"ty_cancelText\":\"Cancel\",\"ty_interstitialTitle\":\"Thanks for visiting aarp.org!\",\"lto_daysleft\":\"Days Left\",\"provider_logo_title\":\"Proflowers logo\",\"geoloc_hide_see_more_button\":\"false\",\"geoloc_provider_link_cta\":\"\",\"offer_page_path\":\"/benefits-discounts/all/proflowers/\",\"redemption_content\":\"\",\"show_phone_number_above_cta\":\"\",\"restrictions_label\":\"Disclosures\",\"show_state_availability\":\"\",\"state_availability_text\":\"SEE AVAILABILITY IN YOUR STATE\",\"hideRestrictionsTab\":\"\",\"ltos\":[]},\"parentOfferJson\":{}}]}\n\nThere are well over 100 financial designations. Some require training, experience, rigorous testing and background checks, while others can basically be purchased while putting in little or no time. SmartAsset.com lists a few of the more rigorous designations as:\n\nCPA (certified public accountant) CFP (certified financial planner) ChFC (chartered financial consultant) CFA (chartered financial analyst)\n\nSome financial designations target seniors. Designations and awards, like the example I gave above, are for sale and require no more vetting than handing over your credit card number. My dog was also offered a spot in a physicians’ magazine as a top adviser for doctors. As previously mentioned, many designations are just used to build credibility, and some awards also target seniors specifically.\n\nSo how do you know if the adviser wanting your money truly has expertise and worked hard to build the necessary skills? Here are a few steps to figure that out.\n\nStep 1: Start with the Financial Industry Regulatory Authority (FINRA)\n\nFINRA is the main self-regulatory body of the financial services industry. This FINRA tool lists 213 financial designations, although some of the designation issuers are now defunct. It gives the following information:\n\nName of the issuing organization\n\nPrerequisites, such as education\n\nExamination type\n\nContinuing education requirements\n\nIt also notes whether the organization has a process to confirm the adviser holds that designation, whether it has a complaint process and whether it lists those who have been disciplined. The tool has hyperlinks that can make it easy to check out a financial adviser.\n\nIf the organization is defunct or appears to be a slam-dunk certification, look elsewhere.\n\nStep 2: Do 10 minutes of internet research\n\nIf the designation looks legitimate on the FINRA tool, or if you are checking out an award not listed by FINRA, then a quick internet search may help. You can type in phrases like “obtaining the XYZ designation” and see what's involved. One senior designation I looked at entailed paying some money and attending a three-day seminar in Las Vegas.\n\nIf it's an award or list of top advisers, look to see what's involved or if anyone has written about it, such as the award given to my dog. That same organization also issues top doctor, dentist, lawyer and other awards, and there are many articles online exposing these pay-for-prestige practices.\n\nNext check out that person. In addition to any complaint or disciplinary action by the organization issuing the designation, financial regulators also list actions. FINRA's Broker Check and the Security and Exchange Commission's Investment Adviser Public Disclosure website are two good places to look. Don't assume that because the issuing organization shows no discipline that other organizations (or the government) haven't disclosed misdeeds. In 2019, The Wall Street Journal noted there were more than 6,300 CFP certificants who had clean records on the CFP website but that had disclosures on the FINRA website, including felony charges."}, {"url": "https://www.wikiwand.com/en/Tom_Wise_(politician)", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about Tom Wise (politician)?\n\nSummarize this article for a 10 years old"}, {"url": "https://www.bbc.co.uk/news/uk-politics-62796077", "page_content": "Liz Truss became prime minister on 6 September 2022, replacing Boris Johnson who was in post for slightly more than three years.\n\nShe was not the first choice of Conservative MPs - but she was the clear winner in a ballot of Tory members, who had the final say.\n\nTruss has been a government minister since 2012, and held cabinet posts under David Cameron, Theresa May and Johnson, most recently as foreign secretary.\n\nA Remain supporter at the 2016 EU referendum, who began her political journey at Oxford University as a Liberal Democrat, she is now an enthusiastic Brexiteer who has vowed to get back to traditional tax-cutting Tory values.\n\nTruss, who has two children, was elected to Parliament as MP for South West Norfolk in 2010 after serving as deputy director of think tank Reform."}]}