{"Tom Wise was elected as a member of the UK Independence Party (UKIP).": [{"url": "https://www.wikiwand.com/en/Tom_Wise_(politician)", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about Tom Wise (politician)?\n\nSummarize this article for a 10 years old"}, {"url": "https://peoplepill.com/people/tom-wise/", "page_content": "Tom (Thomas) Harold Wise (born 13 May 1948 in Bournemouth) was an Independent and UKIP Member of the European Parliament (MEP) for the East of England. A former police officer, he was elected in 2004 as a member of the UK Independence Party but later had the whip withdrawn when allegations of misuse of parliamentary expenses surfaced in The Sunday Telegraph. Following an inquiry carried out by the European Anti-Fraud Office, Wise was formally charged with false accounting and money laundering by Bedfordshire Police. After initially pleading not guilty, he admitted the charges and was sentenced in November 2009 at Southwark Crown Court to a two-year term of imprisonment. He is thought to be the first MEP to be jailed for expenses fraud. Sentencing him, the judge said that Wise had engaged in \"deliberate and blatant dishonesty\" and had set about to defraud the European Parliament almost as soon as he was elected.\n\nEarly career\n\nBorn in Bournemouth on 13 May 1948, Wise attended Bournemouth School between 1959 and 1965, before completing a Diploma in Public Speaking in 1967. He served with Dorset Police before embarking on a career in the food distribution and processing industry. He became the UK Managing Director of a German herbs and spices company. From 1981 to 1989 he was a member of the Liberal Party.\n\nPolitical career\n\nUKIP\n\nWise joined the United Kingdom Independence Party (UKIP) in 1997. He served as office manager to Jeffrey Titford MEP, during this period he worked on the rules governing MEPs' expenses and gained an expertise in the system which he would later use to his advantage. He was the fourth-placed candidate on UKIP's candidate list in for the European Parliament elections in 1999, and also stood as the party's candidate in the 1997, 2001 and 2005 general elections for the South West Bedfordshire constituency. In the 2005 general election, he came fourth with 4.2% of the votes cast.\n\nHe was elected as an MEP for UKIP in the 2004 European elections. He was UKIP's official spokesman on the Culture, Youth, Media and Sport Committee until his suspension by the party in February 2007. In his first speech to the Committee on 4 October 2004, Wise criticised the proposed budget and drew allusions with Nazi Propaganda Minister Joseph Goebbels. In his maiden speech to the Parliament on 16 December 2004, Wise blamed the European Union for creating unacceptable conditions for the transit of animals around Europe. Wise also spoke out against the Proposed directive on the patentability of computer-implemented inventions\n\nIndependent\n\nAfter losing the party whip in March 2007, Wise continued as an Independent within UKIP's Independence/Democracy parliamentary grouping pending the outcome of the fraud inquiry.\n\nDuring his time as an MEP, Wise disputed the genuine nature of the September 11th attacks. and labelled Russia-based businessman Alisher Usmanov a \"gangster and racketeer\"\n\nFollowing the decision to press criminal charges against him, Wise decided not to contest the 2009 European Parliament elections. He has however said that he wants to stand as an MP in the 2010 General Election.\n\nFraud conviction\n\nExposure\n\nOn 23 October 2005, a reporter for the Sunday Telegraph, Daniel Foggo, published an article accusing Wise of claiming £36,000 a year from the European Parliament in the name of his researcher, Lindsay Jenkins, while only passing on about a sixth of that amount to her. According to now-repealed Rules governing the payment of expenses and allowances to Members of the European Parliament, MEPs could claim up to £125,000 per year for assistants' wages, but this money must be paid either directly to the employees or to a third-party agent. The rules did not allow the funds to pass directly through the hands of MEPs themselves.\n\nFoggo later reported that Wise had supplied the European Parliament's Payments Office with a \"contract\" including her name and details, which stipulated that the £36,000 allowance should be paid into an account named \"Stags\". This account, held with the Co-operative Bank, was in fact Wise's own business account and its full name was \"T Wise trading as Stags\". The actual agreement between Wise and Jenkins stated that she would receive monthly \"retainer\" payments of £500 for advice and statistical research, with any extra work to be paid on top. Bank documents obtained by Foggo showed that between November 2004 and October 2005, Wise had paid £39,100 to this account, out of which Jenkins received £13,555. These funds were the only monies coming into the account. In another breach of the payment regulations, some of the £13,555 paid to Jenkins represented work done on behalf of other UKIP members, including party leader Nigel Farage who had agreed to fund the publication of a eurosceptic pamphlet by Jenkins. A further £19,000 was transferred from the account, some of which to pay off credit cards.\n\nOn 29 October, Wise admitted to breaching the rules and, to head off a scandal, agreed to repay £25,230. An internal UKIP inquiry was launched after the Parliament became aware of the affair, but no action was taken and the results of the investigation were kept secret. As Daniel Foggo later reported, UKIP's former leader, Roger Knapman, halted the inquiry after it uncovered serious wrongdoing, believing that the European Parliament would clear Wise. Farage told reporter Daniel Foggo that Wise \"had committed a simple, silly error by making himself a \"paying agent\" for his own staff.\"\n\nSuspension from UKIP\n\nOn 23 February 2007, party sources at UKIP discovered that the European Parliament had passed the affair to OLAF, the European Anti-Fraud Office. A UKIP meeting was convened in Brussels on 28 February 2007 at which Wise formally admitted to having spent £6,500 from the allowance on a dark green Peugeot 406 which he still drove, but refused to disclose how he had spent a further £13,000 of the funds. After a heated discussion, a decision was taken to remove the whip; both Knapman and fellow MEP Mike Nattrass challenged the decision and threatened to reconsider their futures in the party. Farage emphasised that, if cleared by the OLAF investigation, Wise would be welcomed back into the party, adding that he thought \"there is a great deal of public sympathy for us.\" Wise was however suspended by the party.\n\nFollowing his suspension, Wise spent a further £8,000 of the allowance in legal fees in contemplation of a libel case against Greg Lance-Watkins who had published claims on the Internet relating to Wise's activities. No action was ultimately brought against Lance-Watkins.\n\nNews of the World sting\n\nIn May 2008, the News of the World published details of a sting involving Tom Wise. A female reporter posing as a work experience student recorded Wise brazenly admitting in a Belgian bar that he had little idea of what his job as a Member of the European Parliament entailed, adding \"I don't know what an MEP's job is. No one's ever given me a job description. I've no idea what an MEP should or shouldn't do. So you make it up as you go along.\" He boasted of fiddling the Parliament's expenses system, stating \"Yes, I am milking the system [...] I have a simple philosophy. You and your parents are paying for me. Sorry, tough!\" The newspaper used its leading article to call for a change in the rules governing MEPs' expenses following the exposé.\n\nArrest and charges\n\nOn 20 June 2008, Wise was arrested by Bedfordshire Police's Economic Crime Unit on suspicion of making a false instrument, obtaining money by deception by transfer and converting criminal property. He was bailed until 29 October. Bedfordshire Police made the arrest after having been contacted by OLAF.\n\nOn 20 April 2009 the Crown Prosecution Service advised Bedfordshire Police to charge both Wise and Jenkins with one count each of false accounting contrary to the Theft Act 1968 and one count each of money laundering contrary to the Proceeds of Crime Act 2002. Both were scheduled to appear before the City of Westminster Magistrates' Court on in April 2009 to face the charges. Wise indicated that he was innocent and would fight the charges which carry a maximum 14-year jail term. He is thought to be the first MEP to face criminal charges over the misuse of parliamentary funds, and the second former UKIP MEP after Ashley Mote to have faced criminal charges during a parliamentary session.\n\nTrial and conviction\n\nWise appeared in court on 27 April 2009 and spoke only to confirm his name and plead not guilty. Jenkins also denied the charges. District Judge Daphne Wickham released both on conditional bail until 8 June. The case was transferred to Southwark Crown Court and charges specified: that Wise and Jenkins \"falsified a document, namely a contract for provision of services, an application for secretarial assistance allowance and invoices\". Also, that they used funds \"received from the European Parliament intended for use as payments for secretarial services.\"\n\nThe three-week trial began on 2 November 2009. Judge Geoffrey Rivlin QC heard the prosecution argue that Wise channelled parliamentary funds into an account he secretly controlled so that he could pay credit card debts and buy fine wines. He made separate payments of £2,228 and £1,260 to wine importers, and maintained the deception by asking Jenkins to sign blank documents which he completed later. But for his exposure, Wise would, according to prosecutors, have claimed up to £180,000.\n\nOn the third day of the trial, just before Nigel Farage was due to give evidence against him, Wise began several hours of negotiations with his legal team after which he changed his plea to guilty and said he was entirely to blame for the fraud. This resulted in Jenkins being acquitted. He was sentenced on 10 November 2009 to two years imprisonment, the sentence having been reduced by one year on account of his guilty plea. In sentencing him, Judge Geoffrey Rivlin declared that:\n\nIt is no exaggeration to say that you had hardly got your feet beneath your desk as an MEP before you were planning to defraud the parliament to which you were elected and the people you were elected to serve. This was very deliberate and blatant dishonesty. You did not fall into this offence as a result of some unfortunate combination of unforeseen circumstances which happened to suddenly present you with temptation. You knew the system of expenses inside out and this was a claim you devised and planned with some care.\n\nThe judge added that, in addition to jail, Wise would also have to pay £30,000 towards the prosecution's costs.\n\nPersonal life\n\nWise is married to Janet and, until his imprisonment, lived in Linslade near Leighton Buzzard in Bedfordshire. He has two grown-up children.\n\nWise has a developed interest in wines, having followed courses arranged by the Wine & Spirit Education Trust and has reached \"the level just below Master of Wine\". He has spoken of having a wine cellar containing 1,000 bottles of wine."}, {"url": "https://en-academic.com/dic.nsf/enwiki/8020398", "page_content": "Infobox MEP\n\nhonorific-prefix =\n\nname = Tom Wise\n\nhonorific-suffix =\n\nparliament = European\n\nconstituency_MP = East of England\n\nterm_start = June 2004\n\nterm_end =\n\nmajority =\n\npredecessor =\n\nsuccessor =\n\nbirth_date =\n\nbirth_place =\n\ndeath_date =\n\ndeath_place =\n\nnationality =\n\nspouse =\n\nrelations =\n\nchildren =\n\nresidence =\n\nalma_mater =\n\noccupation =\n\nprofession =\n\nreligion =\n\n\n\n\n\nwebsite = [ http://www.tomwisemep.co.uk/ tomwisemep.co.uk ]\n\nfootnotes =\n\nTom Wise is a Member of the European Parliament for the East of England for the United Kingdom Independence Party . He was first elected in 2004.\n\nHe is a former police officer and former managing director of a German herbs and spices company. He used to a member of the Liberal Party. [ cite web\n\nurl=http://www.tomwisemep.co.uk/news.php?subaction=showfull&id=1094829906&archive=&start_from=&ucat=3&TB=home3\n\ntitle=New Euro MP with a full-bodied position\n\ndate=2004-06-24\n\npublisher=tomwisemep.co.uk\n\naccessdate=2008-10-09 ]\n\nMEP Expenses\n\nIn 2005 he was in the news for claiming £36,000 to pay the salary of his researcher who was actually paid just £6000. He later agreed to repay some of this money. He was suspended from UKIP in February 2007 when further details of the allegations came to light. [ cite web\n\nurl=http://www.timesonline.co.uk/tol/news/politics/article1454811.ece?token=null&offset=0\n\ntitle=MEP 'bought car with taxpayers' funds'\n\naccessdate=2008-06-21\n\npublisher= The Times ] On June 20th 2008 he was arrested on suspicion of obtaining money by deception. [ cite web\n\nurl=http://news.bbc.co.uk/2/hi/uk_news/england/7467318.stm\n\ntitle=MEP arrested on fraud allegation\n\naccessdate=2008-06-21\n\npublisher= BBC News Online ]\n\nIn October 2008 a News of the World investigator, posing as a student on work experience, quoted him admitting to \"milking the system\" and doing very little work. [ cite web\n\nurl=http://www.newsoftheworld.co.uk/news/article4815.ece\n\ntitle=I can make shedloads as an MEP...it's cushy\n\naccessdate=2008-10-09\n\npublisher= News of the world ]\n\nExternal links\n\n* [ http://www.tomwisemep.co.uk/ Official web site ]\n\nReferences"}, {"url": "https://www.eadt.co.uk/news/21803546.tom-wise-charged-fraud/", "page_content": "Graham Dines\n\nAN East of England MEP targeted by a Sunday newspaper in an expenses expose is facing criminal charges.\n\nThe Crown Prosecution Service (CPS) has advised Bedfordshire Police to charge former UK Independence Party MEP Tom Wise, who now sits as an independent MEP for East Anglia, and his then researcher Lindsay Jenkins with one count each of false accounting and one count each of money laundering.\n\nMr Wise was elected to the European Parliament in 2004 as one of a dozen UKIP members, but is now a “non-attached” MEP hoping to fight the next euro-elections in June.\n\nThe charge relate to alleged offences between October 2004 and September 2005, when Mr Wise was still a UKIP member.\n\nDerek Frame, reviewing lawyer of the CPS Special Crime Division, said in a statement: \"'Following the publication of a news article in October 2005 relating to Mr Wise and Ms Jenkins, the European Anti-Fraud Office (OLAF) began an investigation into Mr Wise's use of allowances.\n\n\"These charges relate to alleged offences committed between October 2004 and September 2005. At the time Mr Wise was a Member of the European Parliament representing the United Kingdom Independence Party and Ms Jenkins was employed by him as a researcher.'\n\nMr Wise and his researcher are due to appear at City of Westminster Magistrates' Court on April 27."}, {"url": "https://www.britannica.com/topic/United-Kingdom-Independence-Party", "page_content": "United Kingdom Independence Party (UKIP), British political party founded in 1993. It espouses a populist libertarian philosophy centred on the withdrawal of the United Kingdom from the European Union.\n\nOrigins and the growth of Euroskepticism The party has its roots in the Anti-Federalist League, a group led by London School of Economics professor Alan Sked that campaigned against the 1991 Maastricht Treaty on European Union. Sked founded UKIP in 1993, following Britain’s ratification of the Maastricht Treaty, the document that established the European Union. UKIP fielded nearly 200 candidates in the 1997 general election, but the party fared poorly, averaging only about 1 percent of the vote. UKIP fared better in the elections to the European Parliament in 1999, when it won three seats. Capitalizing on an increase in anti-immigration sentiment (and general weariness with the governing Labour Party), UKIP candidates won 12 seats in the European Parliament in 2004, and it posted a respectable showing in local elections that year. This momentum failed to translate into success in the national Parliament, however, as not one of the nearly 500 candidates the party fielded in the 2005 general election won a seat in the House of Commons. The party had an impressive electoral showing in 2009, however, when it won 13 seats in the European Parliament, surpassing the Liberal Democrats and pulling even with Labour. In the European Parliament, UKIP generally sided with other Euroskeptic and anti-immigration parties, including France’s National Front and the Dutch Party for Freedom, and its members gained a reputation for making what some saw as outlandish or attention-seeking statements. In February 2010 UKIP leader Nigel Farage insulted EU President Herman Van Rompuy, and in November of that year, a UKIP member of the European Parliament was fined for an outburst in which he called a German member a fascist. In local elections in Britain in 2012, the UKIP made significant gains at the ballot box, increasing its share of the vote in England (mostly at the expense of the Conservatives) to about 14 percent, though this translated into a gain of only one seat (bringing them to a total of seven). The party improved on that performance in spectacular fashion in May 2013, winning almost a quarter of the votes in English wards that it contested and gaining more than 100 local council seats. UKIP carried that momentum into the following year, winning more than 160 council seats in local elections in May 2014. Those elections were held concurrently with polls for the European Parliament, and UKIP rode a wave of Euroskeptic sentiment to a historic first-place finish, capturing more than 27 percent of the popular vote. That result marked the first time in modern British history that a party other than Labour or the Conservatives had won a national election. UKIP built on that success in October 2014, when it won its first elected seat in Parliament in a by-election in Clacton. In the May 2015 general election, UKIP received nearly four million votes. Although that represented 13 percent of the total votes cast, it translated into just one parliamentary seat because of Britain’s first-past-the-post electoral methodology. Farage cited the result as evidence of a “bankrupt” voting system and called for a reform of the process. Having failed to win a seat in the Thanet South constituency, Farage announced that he would resign as party leader. UKIP’s executive committee refused to accept his resignation, however, and Farage continued in his role as head of the party. A year later, in May 2016, UKIP made further significant electoral inroads by winning seven seats in the National Assembly for Wales.\n\nBrexit and its aftermath Nigel Farage United Kingdom Brexit referendum Perhaps the most obvious sign of UKIP’s growing influence in the British political scene was the June 2016 “in or out” referendum on Britain’s continued membership in the EU. The referendum had been promised by Conservative Prime Minister David Cameron in January 2013, at a time when support for such a measure seemed mixed at best. As the EU struggled to deal with an increasingly assertive Russia on its eastern flank, a migrant crisis, and a wave of Islamic State in Iraq and the Levant (ISIL; Islamic State in Iraq and Syria [ISIS])-sponsored terrorist attacks, however, Euroskeptic sentiment in Britain rose. Despite a largely successful renegotiation of Britain’s role within the EU, polling indicated that the two sides were approaching the June 23 “Brexit” referendum evenly matched. Turnout for the referendum topped 70 percent, and 52 percent of voters opted to leave the EU. Farage characterized the event as Britain’s “independence day.” Cameron, who had staked his government on the outcome of the vote, resigned as prime minister. Get a Britannica Premium subscription and gain access to exclusive content. Subscribe Now Farage announced his resignation as UKIP leader in the wake of the referendum, and the party faced a turbulent succession contest. UKIP deputy chair Diane James was elected party leader in September, but she resigned after just 18 days, citing an inability to effect change among UKIP’s “old guard.” The leadership search resumed as Farage once again took up the leadership mantle on an interim basis. Steven Woolfe, a member of the European Parliament (MEP) who was widely seen as a front-runner in the race, withdrew his candidacy and quit the party after engaging in a physical confrontation with another UKIP MEP. In November 2016 MEP Paul Nuttall was elected leader of UKIP; Nuttall pledged that UKIP would supplant Labour as the party of the British working class. This prediction was not borne out at the polls, however. Nuttall himself failed to capture a parliamentary seat in a by-election in Stoke-on-Trent Central in February 2017, and Douglas Carswell, UKIP’s sole sitting MP, quit the party the following month. The party’s fortunes turned significantly worse on May 4, 2017, when UKIP suffered an almost complete collapse in local elections. In Britain’s first significant electoral test since the Brexit vote, UKIP’s representation in local councils all but evaporated with the loss of more than 140 seats. Nuttall said that the party had been a “victim of its own success,” and it appeared that UKIP supporters had overwhelmingly shifted their support to Conservative candidates. With even longtime supporters calling UKIP a spent force, Nuttall faced the monumental challenge of rebuilding the party in the weeks prior to a snap general election."}, {"url": "https://www.britannica.com/biography/Nigel-Farage", "page_content": "Nigel Farage, in full Nigel Paul Farage, (born April 3, 1964, London, England), British politician who served as a member of the European Parliament from 1999 to 2020. He led the populist libertarian United Kingdom Independence Party (UKIP) from 2006 to 2009 and again from 2010 to 2016. In 2019 he launched the Brexit Party.\n\nEarly life and the rise of UKIP Farage was born into a prosperous family—his father was a stockbroker—and attended Dulwich College, a prestigious private school in London. At age 18, instead of pursuing a university education, he became a commodities trader. Initially a Conservative, he joined the newly formed UKIP when it was created in 1993 in order to support the Euroskeptical party’s campaign for Britain’s withdrawal from the European Union. He was elected to the European Parliament in 1999 and was reelected in 2004 and 2009. After becoming party leader in 2006, Farage campaigned for UKIP to stop focusing on a single issue and to develop policies on a broad range of economic and social issues, including immigration. He was helped by an engaging personality and (for many voters) by his reputation as someone who defied “political correctness” by smoking and drinking and enjoying both. Under his leadership UKIP became the first British party in modern times to propose nationalist policies without being labeled neofascist (branding that had prevented such parties as the National Front and the British National Party from advancing from isolated and short-lived electoral success to a more prominent role in national politics). In the 2009 European Parliament elections, UKIP secured nearly 17 percent support, won 13 of the United Kingdom’s 72 seats, and narrowly pushed the Labour Party into third place. However, UKIP’s support fell to just 3 percent in the U.K.’s general election in 2010, and under the British Parliament’s traditional first-past-the-post system, it won no seats. Farage had stood down as party leader in November 2009 to fight for the seat representing Buckingham, but after having finished third in the balloting, he resumed UKIP leadership in November 2010. After the 2010 general election, Farage expanded UKIP’s appeal, especially to Conservatives who were unhappy with the performance of Prime Minister David Cameron’s Conservative-led coalition government. UKIP also attracted protest voters more generally as the Liberal Democrats, so often beneficiaries of protest votes in the past, lost support as junior partners in the coalition. In local elections in Britain in 2012, the UKIP made significant gains at the ballot box, increasing its share of the vote in England (mostly at the expense of the Conservatives) to about 14 percent. In light of UKIP’s increasing popularity and in an attempt to secure the support of Euroskeptic members of his own party, in January 2013 Cameron promised a referendum on Britain’s continued membership in the EU by 2017.\n\nFarage and the Brexit vote Nigel Farage and the United Kingdom Independence Party UKIP did even better in local elections in May 2013, taking almost one-fourth of the vote in wards that it contested. UKIP carried that momentum into the following year, winning more than 160 council seats in local elections in May 2014. Those elections were held concurrently with polls for the European Parliament. Fulfilling a goal set by Farage, UKIP rode a wave of Euroskeptic sentiment to a historic first-place finish. The party captured more than 27 percent of the popular vote, resulting in 24 seats. That result marked the first time since 1906 that a party other than Labour or the Conservatives had won a national election. Observers agreed that UKIP owed much of its success to Farage’s candid, quick-witted manner. However, Farage announced the appointment of a more-diverse array of representatives who would advocate UKIP policies in the 2015 general election, conceding that his media presence had dominated those of other UKIP party members. In the 2015 British general election, Farage was unsuccessful in his bid for a parliamentary seat representing Thanet South. In keeping with a preelection promise to resign if he failed to win that contest, Farage stepped down as the leader of UKIP. The party’s executive committee rejected his resignation, however, and he retained his leadership position. Get a Britannica Premium subscription and gain access to exclusive content. Subscribe Now Nigel Farage Ahead of the June 23, 2016, “in or out” EU referendum, Farage cited Europe’s ongoing migrant crisis and terrorist attacks in Paris and Brussels as evidence for Britain’s need to “go it alone.” Polling ahead of the contest indicated a tight race, and both Cameron and Labour Party leader Jeremy Corbyn made the case for continued EU membership. In the event, 52 percent of voters supported a “Brexit” from the EU, a result that Farage heralded as Britain’s “independence day.” Two weeks after the referendum, Farage again announced his resignation as UKIP leader, saying that his “political ambition has been achieved.” His replacement, deputy chair Diane James, stepped down just 18 days after becoming leader in September, citing her inability to effect change among the “old guard” of UKIP. Farage took over as interim leader, serving until the November election of Paul Nuttall."}, {"url": "https://alchetron.com/Tom-Wise", "page_content": "Thomas Harold Wise (born 13 May 1948) was an Independent and UKIP Member of the European Parliament (MEP) for the East of England. A former police officer, he was elected in 2004 as a member of the UK Independence Party but later had the whip withdrawn when allegations of misuse of parliamentary expenses surfaced in The Sunday Telegraph. Following an inquiry carried out by the European Anti-Fraud Office, Wise was formally charged with false accounting and money laundering by Bedfordshire Police. After initially pleading not guilty, he admitted the charges and was sentenced in November 2009 at Southwark Crown Court to a two-year term of imprisonment. He is thought to be the first MEP to be jailed for expenses fraud. Sentencing him, the judge said that Wise had engaged in \"deliberate and blatant dishonesty\" and had set about to defraud the European Parliament almost as soon as he was elected.\n\nEarly career\n\nBorn in Bournemouth, Wise attended Bournemouth School between 1959 and 1965, before completing a Diploma in Public Speaking in 1967. He served with Dorset Police before embarking on a career in the food distribution and processing industry. He became the UK Managing Director of a German herbs and spices company. From 1981 to 1989 he was a member of the Liberal Party.\n\nUKIP\n\nWise joined the United Kingdom Independence Party (UKIP) in 1997. He served as office manager to Jeffrey Titford MEP, during this period he worked on the rules governing MEPs' expenses and gained an expertise in the system which he would later use to his advantage. He was the fourth-placed candidate on UKIP's candidate list in for the European Parliament elections in 1999, and also stood as the party's candidate in the 1997, 2001 and 2005 general elections for the South West Bedfordshire constituency. In the 2005 general election, he came fourth with 4.2% of the votes cast.\n\nHe was elected as an MEP for UKIP in the 2004 European elections. He was UKIP's official spokesman on the Culture, Youth, Media and Sport Committee until his suspension by the party in February 2007. In his first speech to the Committee on 4 October 2004, Wise criticised the proposed budget and drew allusions with Nazi Propaganda Minister Joseph Goebbels. In his maiden speech to the Parliament on 16 December 2004, Wise blamed the European Union for creating unacceptable conditions for the transit of animals around Europe. Wise also spoke out against the Proposed directive on the patentability of computer-implemented inventions\n\nIndependent\n\nAfter losing the party whip in March 2007, Wise continued as an Independent within UKIP's Independence/Democracy parliamentary grouping pending the outcome of the fraud inquiry.\n\nDuring his time as an MEP, Wise disputed the genuine nature of the September 11th attacks. and labelled Russia-based businessman Alisher Usmanov, who is a shareholder of Arsenal F.C. a \"gangster and racketeer\"\n\nFollowing the decision to press criminal charges against him, Wise decided not to contest the 2009 European Parliament elections. He has however said that he wants to stand as an MP in the 2010 General Election.\n\nExposure\n\nOn 23 October 2005, a reporter for the Sunday Telegraph, Daniel Foggo, published an article accusing Wise of claiming £36,000 a year from the European Parliament in the name of his researcher, Lindsay Jenkins, while only passing on about a sixth of that amount to her. According to now-repealed Rules governing the payment of expenses and allowances to Members of the European Parliament, MEPs could claim up to £125,000 per year for assistants' wages, but this money must be paid either directly to the employees or to a third-party agent. The rules did not allow the funds to pass directly through the hands of MEPs themselves.\n\nFoggo later reported that Wise had supplied the European Parliament's Payments Office with a \"contract\" including her name and details, which stipulated that the £36,000 allowance should be paid into an account named \"Stags\". This account, held with the Co-operative Bank, was in fact Wise's own business account and its full name was \"T Wise trading as Stags\". The actual agreement between Wise and Jenkins stated that she would receive monthly \"retainer\" payments of £500 for advice and statistical research, with any extra work to be paid on top. Bank documents obtained by Foggo showed that between November 2004 and October 2005, Wise had paid £39,100 to this account, out of which Jenkins received £13,555. These funds were the only monies coming into the account. In another breach of the payment regulations, some of the £13,555 paid to Jenkins represented work done on behalf of other UKIP members, including party leader Nigel Farage who had agreed to fund the publication of a eurosceptic pamphlet by Jenkins. A further £19,000 was transferred from the account, some of which to pay off credit cards.\n\nOn 29 October, Wise admitted to breaching the rules and, to head off a scandal, agreed to repay £25,230. An internal UKIP inquiry was launched after the Parliament became aware of the affair, but no action was taken and the results of the investigation were kept secret. As Daniel Foggo later reported, UKIP's former leader, Roger Knapman, halted the inquiry after it uncovered serious wrongdoing, believing that the European Parliament would clear Wise. Farage told reporter Daniel Foggo that Wise \"had committed a simple, silly error by making himself a \"paying agent\" for his own staff.\"\n\nSuspension from UKIP\n\nOn 23 February 2007, party sources at UKIP discovered that the European Parliament had passed the affair to OLAF, the European Anti-Fraud Office. A UKIP meeting was convened in Brussels on 28 February 2007 at which Wise formally admitted to having spent £6,500 from the allowance on a dark green Peugeot 406 which he still drove, but refused to disclose how he had spent a further £13,000 of the funds. After a heated discussion, a decision was taken to remove the whip; both Knapman and fellow MEP Mike Nattrass challenged the decision and threatened to reconsider their futures in the party. Farage emphasised that, if cleared by the OLAF investigation, Wise would be welcomed back into the party, adding that he thought \"there is a great deal of public sympathy for us.\" Wise was however suspended by the party.\n\nFollowing his suspension, Wise spent a further £8,000 of the allowance in legal fees in contemplation of a libel case against Greg Lance-Watkins who had published claims on the Internet relating to Wise's activities. No action was ultimately brought against Lance-Watkins.\n\nNews of the World sting\n\nIn May 2008, the News of the World published details of a sting involving Tom Wise. A female reporter posing as a work experience student recorded Wise brazenly admitting in a Belgian bar that he had little idea of what his job as a Member of the European Parliament entailed, adding \"I don't know what an MEP's job is. No one's ever given me a job description. I've no idea what an MEP should or shouldn't do. So you make it up as you go along.\" He boasted of fiddling the Parliament's expenses system, stating \"Yes, I am milking the system [...] I have a simple philosophy. You and your parents are paying for me. Sorry, tough!\" The newspaper used its leading article to call for a change in the rules governing MEPs' expenses following the exposé.\n\nArrest and charges\n\nOn 20 June 2008, Wise was arrested by Bedfordshire Police's Economic Crime Unit on suspicion of making a false instrument, obtaining money by deception by transfer and converting criminal property. He was bailed until 29 October. Bedfordshire Police made the arrest after having been contacted by OLAF.\n\nOn 20 April 2009 the Crown Prosecution Service advised Bedfordshire Police to charge both Wise and Jenkins with one count each of false accounting contrary to the Theft Act 1968 and one count each of money laundering contrary to the Proceeds of Crime Act 2002. Both were scheduled to appear before the City of Westminster Magistrates' Court on in April 2009 to face the charges. Wise indicated that he was innocent and would fight the charges which carry a maximum 14-year jail term. He is thought to be the first MEP to face criminal charges over the misuse of parliamentary funds, and the second former UKIP MEP after Ashley Mote to have faced criminal charges during a parliamentary session.\n\nTrial and conviction\n\nWise appeared in court on 27 April 2009 and spoke only to confirm his name and plead not guilty. Jenkins also denied the charges. District Judge Daphne Wickham released both on conditional bail until 8 June. The case was transferred to Southwark Crown Court and charges specified: that Wise and Jenkins \"falsified a document, namely a contract for provision of services, an application for secretarial assistance allowance and invoices\". Also, that they used funds \"received from the European Parliament intended for use as payments for secretarial services.\"\n\nThe three-week trial began on 2 November 2009. Judge Geoffrey Rivlin QC heard the prosecution argue that Wise channelled parliamentary funds into an account he secretly controlled so that he could pay credit card debts and buy fine wines. He made separate payments of £2,228 and £1,260 to wine importers, and maintained the deception by asking Jenkins to sign blank documents which he completed later. But for his exposure, Wise would, according to prosecutors, have claimed up to £180,000.\n\nOn the third day of the trial, just before Nigel Farage was due to give evidence against him, Wise began several hours of negotiations with his legal team after which he changed his plea to guilty and said he was entirely to blame for the fraud. This resulted in Jenkins being acquitted. He was sentenced on 10 November 2009 to two years imprisonment, the sentence having been reduced by one year on account of his guilty plea. In sentencing him, Judge Geoffrey Rivlin declared that:\n\nIt is no exaggeration to say that you had hardly got your feet beneath your desk as an MEP before you were planning to defraud the parliament to which you were elected and the people you were elected to serve. This was very deliberate and blatant dishonesty. You did not fall into this offence as a result of some unfortunate combination of unforeseen circumstances which happened to suddenly present you with temptation. You knew the system of expenses inside out and this was a claim you devised and planned with some care.\n\nThe judge added that, in addition to jail, Wise would also have to pay £30,000 towards the prosecution's costs.\n\nPersonal life\n\nWise is married to Janet and, until his imprisonment, lived in Linslade near Leighton Buzzard in Bedfordshire. He has two grown-up children.\n\nWise has a developed interest in wines, having followed courses arranged by the Wine & Spirit Education Trust and has reached \"the level just below Master of Wine\". He has spoken of having a wine cellar containing 1,000 bottles of wine."}, {"url": "https://www.eadt.co.uk/news/ukip-suspends-euro-mp-tom-wise-7495684/", "page_content": "By Graham Dines\n\nONE of the region's MEPs was suspended from the UK Independence Party's European parliamentary group yesterday over allegations of financial irregularities.\n\nEuro MP Tom Wise is at the centre of a European Parliament inquiry into allegations he claimed money to pay one of his staff's wages, but did not pass on all the cash to her. He has been asked by the authorities in Brussels to give an explanation.\n\nIf officials are not satisfied with his answers, they are expected to pass the file to the police in Belgium and England.\n\nA statement from UKIP yesterday said Mr Wise had been suspended “for failure to provide information responding to alleged fraud irregularities that are now being investigated by OLAF (the European anti-fraud body).\n\n“The decision should in no way be seen as prejudicial to the outcome of the investigation.”\n\nSpeaking from Brussels yesterday, Mr Wise, who lives in Leighton Buzzard, Bedfordshire, said: “There is no comment to make and I have no comment to make.”\n\nThe party has no power to force Mr Wise to quit as an MEP. He will now sit as an Independent.\n\nMr Wise was elected in 2004 in second position from UKIP's list of candidates under the system of election to the European Parliament. Those elections resulted in the Conservatives winning three seats, UKIP two, and the Liberal Democrats and Labour one each.\n\nUnder European electoral regulations, there will be no by-election if Mr Wise quits. His place will be offered to one of the party's unsuccessful candidates, and the favourite will be Robin Page, who was in third position on the list behind Jeffrey Titford and Mr Wise.\n\nCambridgeshire farmer Mr Page, 63, who sprung to fame from his appearances on BBC2's One Man and His Dog series, said yesterday: “If it becomes necessary and I am asked, I will serve the remaining two years of Tom Wise's term as an MEP.”"}, {"url": "https://www.theguardian.com/politics/2009/nov/05/ex-mep-tom-wise-36000-expenses-scam", "page_content": "A former British MEP who masterminded a £36,000 expenses fiddle was facing jail today after he confessed during his trial.\n\nTom Wise, 61, had been charged with false accounting and money-laundering after an investigation into claims that he misused thousands of pounds of expenses.\n\nOriginally elected for the UK Independence party, Wise sat as an independent after being expelled from the party.\n\nThe former policeman, whose term of office in the European parliament came to an end in July this year, spent a year channelling taxpayers' cash into a bank account he secretly controlled.\n\nHe pretended the £3,000 \"secretarial assistance allowance\" he received every month was for his 62-year-old researcher Lindsay Jenkins.\n\nAfter paying her just £500, he spent the rest \"in support of his own interests\", London's Southwark crown court was told.\n\nMark Fenhalls, prosecuting, said: \"He used the funds, for example, to buy a car, to purchase fine wines and pay off some of his credit card debts.\"\n\nThe barrister said that when the fraud was eventually exposed by a national newspaper four years ago, the MEP promptly \"took steps to cancel the claim and repay the money\".\n\n\"He did so because he had been caught and was trying to minimise the trouble he was in,\" said counsel. \"Perhaps he hoped by swift repayment he could somehow head off further inquiry.\"\n\nHad it not been discovered, the scam could have lasted five years and netted £180,000.\n\nWise, of Ship Road, Leighton Buzzard, Bedfordshire, who was kicked out of Ukip over the scandal, denied false accounting between 14 October and 16 November 2004.\n\nBut, on the third day of his three-week trial and just before Ukip leader Nigel Farrage was to give evidence against him, Wise began a protracted round of discussions with his legal team.\n\nAfter several hours and an overnight adjournment to finalise details, the jury trying the case was discharged and the disgraced politician then admitted he was guilty after all.\n\nJenkins, of Queens Club Gardens, Barons Court, west London, had also been on trial, but was cleared.\n\nShe had denied both the false accounting charge and an allegation of using criminal property between 14 November 2004 and 1 November the following year.\n\nThe court heard she allegedly used \"just shy\" of £5,000 of the stolen money to publish a political work she had written.\n\nFenhalls explained that, in pleading guilty, Wise \"fully accepted responsibility for his actions and, by virtue of his plea and what he says, he has effectively exonerated Mrs Jenkins\".\n\nThe barrister said the former MEP also accepted documents he got Jenkins to sign to pull off the fraud were \"misleading and were in all probability blank when he asked her to sign them\".\n\n\"His acceptance of responsibility is fully consistent with the prosecution's opening and makes his basis of plea acceptable.\"\n\nHe told the court Jenkins's case had always been that the documents were blank, that she had \"trusted him\", and that the £500 Wise paid her each month was for work actually done.\n\n\"We are able to say ... there is no realistic prospect of conviction, nor, in fact, were it necessary, a public interest in continuing. In those circumstances we do not invite a trial against Mrs Jenkins and invite verdicts of not guilty against her.\"\n\nJudge Geoffrey Rivlin QC agreed, and formally ordered her acquittal on both counts, adding that her defence costs should be paid out of public funds.\n\nAfter quashing an outstanding money-laundering allegation against Wise, he told the former MEP he would be sentenced next Wednesday.\n\nHe said he could remain on bail in the meantime, but warned: \"It must, however, be fully understood that in terms of the ultimate sentence, nothing must be read into that.\"\n\nThe judge then added: \"I see Mr Wise nodding because he knows too well what the situation is.\"\n\nUkip's chairman, Paul Nuttall, said: \"Tom Wise broke faith with the UK Independence party, which is why the whip was withdrawn. We believe as a party it is vital as a matter of public confidence that justice is done and have no doubt that this will set a precedent for many Westminster MPs.\""}, {"url": "https://eu.boell.org/en/2014/06/19/explaining-rise-uk-independence-party", "page_content": "Download Article\n\nAt the 2014 European Parliament elections the UK Independence Party (UKIP) become the first new party in British politics since the 1920s to top the poll in a nationwide election. It was also the first occasion since 1906 when a party other than Labour or the Conservatives won the highest share of the national vote. So where did UKIP come from, who is supporting it, and what does its rise reveal about British and also European politics?\n\nUKIP is the most significant new party in British politics for a generation. Particularly since 2010 the party has been attracting rapidly rising public support after broadening its Eurosceptic message to include strong opposition to immigration and populist attacks against Britain’s established political class. UKIP is currently winning more than one in ten voters at domestic Westminster voting intention polls, while at the recent European Parliament elections the party won over more than one in four. With 4.3 million votes at these elections UKIP established itself as a major political force. Moreover, these elections also saw Nigel Farage’s party attract extremely high levels of support in some areas that are mainly along the Eastern Coast of England. In nine local authorities, for example, UKIP polled over 45% of the vote, pointing to some likely strong results at the 2015 British general election.\n\nA long time coming: why UKIP is no ‘flash-in-the-pan’\n\nAccording to conventional wisdom, UKIP is simply the latest reflection of enduring divisions among Conservatives over Britain’s membership of the European Union. Since its formation in 1993, UKIP has been consistently portrayed as merely a ‘second home’ for elderly, middle-class and single-issue Conservatives who live in the suburbs, are only concerned about withdrawing Britain from the EU and want to return to the days when Margaret Thatcher took a hard-line with Brussels. Since 2010, many argue that these dissatisfied Conservatives have been further pushed into the arms of Nigel Farage by David Cameron, a Conservative leader who they see as not sharing their strong desire to withdraw Britain from the EU and their harder social conservatism. Seen from this perspective, UKIP is often treated as a flash party that is similar to the Poujadist movement in 1950s France; a short-term outlet for political protestors who will inevitably re-join the political mainstream.\n\nThis wisdom, however, only makes sense if you assume that UKIP has not changed since its early beginnings as an anti-EU pressure group that grew out of Eurosceptic think tanks like the Bruges Group. These lazy assumptions have also been adopted by left-wing thinkers, some of whom have applauded the rise of UKIP as a phenomenon that will ‘divide the right’ and ease the Labour Party’s return to power in 2015. But as we show in our new book, Revolt on the Right: Explaining Support for the Radical Right in Britain, this conventional wisdom is fundamentally flawed.\n\nThe rise and appeal of UKIP is far more complex than what much of Britain’s commentariat would us believe. Like other radical right parties in Europe, the underlying forces that are driving UKIP can be traced back over several decades and are rooted in much deeper social and value changes that are dividing the electorate into quite different groups. UKIP, in short, is mobilising back into politics longstanding social and economic divisions in Britain that initially opened in the 1970s and have since widened further following the post-2008 great recession.\n\nThis story of social change begins with the numerical decline of several groups who together we describe as the left behind; older, less well educated, low skilled and white working-class voters. The left behind were once central to Britain’s political and social debate, as they were in many other EU states. The trade unions to which they belonged wielded immense political power, and no party could secure an election victory without winning significant support from these voters.\n\nBetween the 1960s and early 2000s, however, this picture radically changed. The blue-collar voters who once dominated the electorate came to constitute a small and rapidly declining minority. Meanwhile, the rapid expansion of university education and professional white-collar employment placed a new class of more financially secure middle-class graduates and professionals at the centre of our media and politics. In only fifty years Britain was radically transformed from a society where low skilled, low educated and blue-collar voters decided the outcome of elections to where it is today; where left behind voters are only spectators in the political battle for professional middle-class votes. Consider one statistic from our book; when Harold Wilson and the Labour Party won the 1964 British general election, almost five in ten Britons worked in blue-collar jobs and four in ten belonged to a trade union. But by 1997, when Tony Blair and ‘New’ Labour assumed power, the proportion of voters in blue-collar jobs had slumped almost twenty points to one in three, while the proportion of trade union members had crashed to barely one in five.\n\nThis deep social change is absolutely essential to making sense of UKIP because while it has fundamentally transformed the national economy it has also been joined by a dramatic change in the values that dominate society. In sharp contrast to the professional middle-class majority, that albeit sceptical is broadly at ease with immigration, the EU and social liberalism, the employment and social mobility prospects facing the left behind have been receding for decades. Now, these voters also find that their values and priorities are being pushed to the margins of debate. The left behind, who since 2010 have been turning to UKIP in rapidly growing numbers, share a very distinctive outlook on issues that are central to the radical right; toward the European Union, national identity, immigration and the established political class. They are consistently the most receptive to demands to pull Britain out of the EU, to subscribe to a more restrictive conception of national identity that holds up ancestry, to feel intensely anxious over immigration, and excluded by a political class in Westminster and Brussels that they view as corrupt, out-of-touch and uncaring. On all of these issues it is the left behind who hold a markedly different outlook from the professional middle-class majority.\n\nWhile these divisions opened a long time ago, they have widened further since the onset of the post-2008 great recession. In fact, across all the years for which we have survey data the working classes in Britain have never felt so alienated as they do today; some 40% agree strongly that they have no say in government, while only 16% of middle-class respondents feel the same way. This disaffection is a product of party politics as well as social change. In the chase for electoral majorities Tony Blair’s ‘New’ Labour and Cameron’s ‘compassionate’ Conservatives converged on the centre ground and had little incentive to engage with the left behind on issues that in earlier years did not win elections, namely Europe and immigration. Moreover, many of these left behind voters are found in ‘safe seats’ that have been controlled by one of the main parties for decades.\n\nIn this way, underlying social change had already created a large reservoir of potential radical right voters long before Nigel Farage and UKIP even started to campaign. Only now –through an articulate and effective campaigner- are these underlying conflicts once again being mobilised by UKIP into British politics, much as they have been for over twenty years in other EU Member States.\n\nUKIP’s voters: Who are they really?\n\nThese underlying divides help to explain why UKIP’s voters share a very distinctive social profile and far more so than supporters of the main parties. UKIP’s core electorate is comprised of blue-collar, older, white men, who tend to have very few qualifications and feel pessimistic about their futures. Those who argue that UKIP and Farage are ‘catch-all’ populists who are appealing across society are wrong. UKIP’s is the most working class vote in British politics; to find an electorate as working-class you need to go back to when Michael Foot led the Labour Party in the early 1980s.\n\nThis will not surprise observers of the radical right on mainland Europe, where parties like the Front National in France and Danish People’s Party have built strong links with the working class by pitching to their concerns over immigration, globalisation, the EU and domestic politics. In some cases these parties won over blue-collar voters by combining anti-immigrant xenophobia with a heavy dose of economic protectionism. UKIP, however, is winning over the same groups in society while not offering a protectionist ethos, although this may change as UKIP completes a policy review. While the radical right in Britain was a late-starter, arriving some twenty years after other European examples, since 2010 UKIP has similarly drawn strength from the same underlying divisions and conflicts.\n\nWhat is motivating these voters? Our analysis of almost 6,000 UKIP voters reveals how three motives are especially key to explaining support for the party: opposition to immigration; opposition to the EU; and hostility to the established political class. This is the ‘triple motive’ that underpins the UKIP vote. Those who are supporting Nigel Farage are animated by so much more than just disdain of EU officials in Brussels and Strasbourg. Almost three-quarters of them give immigration the highest rating as an important issue. Over 90% of them disapprove of Britain’s EU membership, almost half are very dissatisfied with the state of British democracy, and almost one in three feel very pessimistic about their prospects, hinting at the underlying economic marginalisation that fuels their anger.\n\nUKIP voters are certainly Eurosceptic, but Euroscepticism alone is not enough to convince them to support the party. Rather, their motives are ‘Brussels-Plus’; their intense Euroscepticism is combined with strong hostility toward immigration, or hostility to politicians, or often both. These three motives have created a strongly motivated electorate; so angry and fed up that they are willing to back an untested radical alternative that is regularly ridiculed in the media. UKIP began in 1993 as a single-issue anti-EU rebellion among ex-Conservatives, but has since grown into a potent political force by consolidating Britain’s ‘left behind’ voters who use UKIP as a way of saying ‘no’ three times: no to Brussels; no to politicians in Westminster; and no to immigration and rising ethnic diversity. There is no ‘Farageism’ but nor does there need to be. This simple appeal is enough for voters who, for decades, have felt left behind economically and cut out of Britain’s political conversation over social and cultural issues like immigration and Europe.\n\nLessons for the Left: Why Labour and the Conservatives should listen\n\nWhere are these voters coming from politically? Disillusioned Conservatives have always been a big source of votes and activists for UKIP, and that remains true today. But they are not consistently the main source of support. Before 2010, and during the eras of Tony Blair and Gordon Brown, UKIP drew much of their strength from Britons who said they used to vote Labour. And while many of UKIP’s current voters say they backed the Conservatives last time, it is worth bearing in mind what else these voters say: they dislike Cameron intensely; they feel that the Conservatives have failed them on immigration and the financial crisis (the main issues which matter to them); and they feel that politics in Westminster has nothing to offer them. Therefore, it is hard to imagine that these voters would be loyal to the Conservatives today if UKIP did not exist. Rather, they would most likely be looking for another outlet for their discontent –or giving up entirely by staying at home.\n\nIn fact, in a less politically fragmented era these left behind voters should be expected to be switching over in large numbers to the main opposition. These voters – who, in a time of austerity and insecurity, are struggling with falling incomes, dismal prospects and cuts to benefits and public services - should be a primary target for Labour. But, instead, many left behind voters are switching their loyalty to an untested radical right insurgent over the traditional defender of redistribution and equality. Rather than turn to Labour, they are opting for a party that appears at ease with neo-liberal economics, the free market, defines itself as libertarian, talks of curbing welfare and sought to abolish inheritance tax at the last general election. The Conservatives may justly worry about their failure to hold on to these voters, but Labour should worry just as much about why they are not winning over the left behind.\n\nThere is another, sobering message for Labour when we look at how Farage and UKIP have grown so quickly since 2010. This growth has not come from UKIP forging ties with new groups; their support among young people, women, minorities and middle-class professionals remains weak. Labour’s rise in the polls, in contrast, has come precisely from these groups, who were always and remain hostile to UKIP. But while this is good news for progressives, among UKIP’s core electorate of left behind voters Labour’s advance since their 2009 low ebb has been anaemic. Between 2009 and 2013 Labour’s support among the over-65s, working-class, Britons with no qualifications and men increased by an average of just three percentage points. UKIP’s advance among these groups, in contrast, averages close to ten percentage points. Labour's failure to consolidate support among the left behind is one thing standing in the way of a more commanding poll lead, and the fact that UKIP are doing so well among these groups should be ringing loud alarm bells on the left.\n\nAnother reason UKIP’s revolt matters is Britain’s geographically defined electoral system. The left behind tend to concentrate in particular areas, and most of these traditionally return Labour MPs. This is why it is not surprising that, since 2010, UKIP have performed strongly in parliamentary by-elections in Labour seats like Rotherham and South Shields in more economically deprived northern England. It is precisely in these Labour areas where we find the largest numbers of left behind voters who are central to UKIP support. Through local, European and general elections UKIP could establish itself as the second force in many of these areas, positioning themselves as potential challengers to an unpopular Labour government in 2020 –assuming that the party survives that long.\n\nAll of this hints at a wider problem facing not just Labour but British politics in general. When we track the proportion of left behind voters who say they identify with the two main parties over the past thirty years, we find a dramatic shift. In the 1980s and 1990s the working class and those with no qualifications were participating in Britain’s two party system; a large majority of them identified with Labour or the Conservatives, although most sided with Labour. But during the 2000s these left behind groups steadily lost faith in Labour. However, instead of attaching themselves to the Conservatives they simply stopped identifying with either of the two main parties. UKIP is a by-product of this shift, and so the party raises other deeper questions. Why do these left behind voters feel so alienated from our politics? What can be done to bring them back into the mainstream fold? And what are the long-term consequences of our established political class failing to re-engage these voters?\n\nWriting about an earlier insurgency against the two main parties in the 1980s, by the Social Democratic Party, the academics Ivor Crewe and Anthony King noted how the SDP’s performance bore a resemblance to a biography of someone who showed early promise but died young. It is too early to know whether UKIP will follow the same path, but in a way it doesn’t matter. Irrespective of UKIP’s fortunes, their rise has opened a window on the left behind in Britain and tells us much about the growing identity crisis facing social democrats across Europe. These parties are now dominated by professional middle-class politicians chasing professional middle class votes, and increasingly find themselves estranged from struggling, left behind voters they were long ago founded to represent."}], "Tom Wise later sat as an independent.": [{"url": "https://www.wikiwand.com/en/Tom_Wise_(politician)", "page_content": "Dear Wikiwand AI, let's keep it short by simply answering these key questions:\n\nCan you list the top facts and stats about Tom Wise (politician)?\n\nSummarize this article for a 10 years old"}, {"url": "https://www.theguardian.com/politics/2009/nov/05/ex-mep-tom-wise-36000-expenses-scam", "page_content": "A former British MEP who masterminded a £36,000 expenses fiddle was facing jail today after he confessed during his trial.\n\nTom Wise, 61, had been charged with false accounting and money-laundering after an investigation into claims that he misused thousands of pounds of expenses.\n\nOriginally elected for the UK Independence party, Wise sat as an independent after being expelled from the party.\n\nThe former policeman, whose term of office in the European parliament came to an end in July this year, spent a year channelling taxpayers' cash into a bank account he secretly controlled.\n\nHe pretended the £3,000 \"secretarial assistance allowance\" he received every month was for his 62-year-old researcher Lindsay Jenkins.\n\nAfter paying her just £500, he spent the rest \"in support of his own interests\", London's Southwark crown court was told.\n\nMark Fenhalls, prosecuting, said: \"He used the funds, for example, to buy a car, to purchase fine wines and pay off some of his credit card debts.\"\n\nThe barrister said that when the fraud was eventually exposed by a national newspaper four years ago, the MEP promptly \"took steps to cancel the claim and repay the money\".\n\n\"He did so because he had been caught and was trying to minimise the trouble he was in,\" said counsel. \"Perhaps he hoped by swift repayment he could somehow head off further inquiry.\"\n\nHad it not been discovered, the scam could have lasted five years and netted £180,000.\n\nWise, of Ship Road, Leighton Buzzard, Bedfordshire, who was kicked out of Ukip over the scandal, denied false accounting between 14 October and 16 November 2004.\n\nBut, on the third day of his three-week trial and just before Ukip leader Nigel Farrage was to give evidence against him, Wise began a protracted round of discussions with his legal team.\n\nAfter several hours and an overnight adjournment to finalise details, the jury trying the case was discharged and the disgraced politician then admitted he was guilty after all.\n\nJenkins, of Queens Club Gardens, Barons Court, west London, had also been on trial, but was cleared.\n\nShe had denied both the false accounting charge and an allegation of using criminal property between 14 November 2004 and 1 November the following year.\n\nThe court heard she allegedly used \"just shy\" of £5,000 of the stolen money to publish a political work she had written.\n\nFenhalls explained that, in pleading guilty, Wise \"fully accepted responsibility for his actions and, by virtue of his plea and what he says, he has effectively exonerated Mrs Jenkins\".\n\nThe barrister said the former MEP also accepted documents he got Jenkins to sign to pull off the fraud were \"misleading and were in all probability blank when he asked her to sign them\".\n\n\"His acceptance of responsibility is fully consistent with the prosecution's opening and makes his basis of plea acceptable.\"\n\nHe told the court Jenkins's case had always been that the documents were blank, that she had \"trusted him\", and that the £500 Wise paid her each month was for work actually done.\n\n\"We are able to say ... there is no realistic prospect of conviction, nor, in fact, were it necessary, a public interest in continuing. In those circumstances we do not invite a trial against Mrs Jenkins and invite verdicts of not guilty against her.\"\n\nJudge Geoffrey Rivlin QC agreed, and formally ordered her acquittal on both counts, adding that her defence costs should be paid out of public funds.\n\nAfter quashing an outstanding money-laundering allegation against Wise, he told the former MEP he would be sentenced next Wednesday.\n\nHe said he could remain on bail in the meantime, but warned: \"It must, however, be fully understood that in terms of the ultimate sentence, nothing must be read into that.\"\n\nThe judge then added: \"I see Mr Wise nodding because he knows too well what the situation is.\"\n\nUkip's chairman, Paul Nuttall, said: \"Tom Wise broke faith with the UK Independence party, which is why the whip was withdrawn. We believe as a party it is vital as a matter of public confidence that justice is done and have no doubt that this will set a precedent for many Westminster MPs.\""}, {"url": "https://peoplepill.com/people/tom-wise/", "page_content": "Tom (Thomas) Harold Wise (born 13 May 1948 in Bournemouth) was an Independent and UKIP Member of the European Parliament (MEP) for the East of England. A former police officer, he was elected in 2004 as a member of the UK Independence Party but later had the whip withdrawn when allegations of misuse of parliamentary expenses surfaced in The Sunday Telegraph. Following an inquiry carried out by the European Anti-Fraud Office, Wise was formally charged with false accounting and money laundering by Bedfordshire Police. After initially pleading not guilty, he admitted the charges and was sentenced in November 2009 at Southwark Crown Court to a two-year term of imprisonment. He is thought to be the first MEP to be jailed for expenses fraud. Sentencing him, the judge said that Wise had engaged in \"deliberate and blatant dishonesty\" and had set about to defraud the European Parliament almost as soon as he was elected.\n\nEarly career\n\nBorn in Bournemouth on 13 May 1948, Wise attended Bournemouth School between 1959 and 1965, before completing a Diploma in Public Speaking in 1967. He served with Dorset Police before embarking on a career in the food distribution and processing industry. He became the UK Managing Director of a German herbs and spices company. From 1981 to 1989 he was a member of the Liberal Party.\n\nPolitical career\n\nUKIP\n\nWise joined the United Kingdom Independence Party (UKIP) in 1997. He served as office manager to Jeffrey Titford MEP, during this period he worked on the rules governing MEPs' expenses and gained an expertise in the system which he would later use to his advantage. He was the fourth-placed candidate on UKIP's candidate list in for the European Parliament elections in 1999, and also stood as the party's candidate in the 1997, 2001 and 2005 general elections for the South West Bedfordshire constituency. In the 2005 general election, he came fourth with 4.2% of the votes cast.\n\nHe was elected as an MEP for UKIP in the 2004 European elections. He was UKIP's official spokesman on the Culture, Youth, Media and Sport Committee until his suspension by the party in February 2007. In his first speech to the Committee on 4 October 2004, Wise criticised the proposed budget and drew allusions with Nazi Propaganda Minister Joseph Goebbels. In his maiden speech to the Parliament on 16 December 2004, Wise blamed the European Union for creating unacceptable conditions for the transit of animals around Europe. Wise also spoke out against the Proposed directive on the patentability of computer-implemented inventions\n\nIndependent\n\nAfter losing the party whip in March 2007, Wise continued as an Independent within UKIP's Independence/Democracy parliamentary grouping pending the outcome of the fraud inquiry.\n\nDuring his time as an MEP, Wise disputed the genuine nature of the September 11th attacks. and labelled Russia-based businessman Alisher Usmanov a \"gangster and racketeer\"\n\nFollowing the decision to press criminal charges against him, Wise decided not to contest the 2009 European Parliament elections. He has however said that he wants to stand as an MP in the 2010 General Election.\n\nFraud conviction\n\nExposure\n\nOn 23 October 2005, a reporter for the Sunday Telegraph, Daniel Foggo, published an article accusing Wise of claiming £36,000 a year from the European Parliament in the name of his researcher, Lindsay Jenkins, while only passing on about a sixth of that amount to her. According to now-repealed Rules governing the payment of expenses and allowances to Members of the European Parliament, MEPs could claim up to £125,000 per year for assistants' wages, but this money must be paid either directly to the employees or to a third-party agent. The rules did not allow the funds to pass directly through the hands of MEPs themselves.\n\nFoggo later reported that Wise had supplied the European Parliament's Payments Office with a \"contract\" including her name and details, which stipulated that the £36,000 allowance should be paid into an account named \"Stags\". This account, held with the Co-operative Bank, was in fact Wise's own business account and its full name was \"T Wise trading as Stags\". The actual agreement between Wise and Jenkins stated that she would receive monthly \"retainer\" payments of £500 for advice and statistical research, with any extra work to be paid on top. Bank documents obtained by Foggo showed that between November 2004 and October 2005, Wise had paid £39,100 to this account, out of which Jenkins received £13,555. These funds were the only monies coming into the account. In another breach of the payment regulations, some of the £13,555 paid to Jenkins represented work done on behalf of other UKIP members, including party leader Nigel Farage who had agreed to fund the publication of a eurosceptic pamphlet by Jenkins. A further £19,000 was transferred from the account, some of which to pay off credit cards.\n\nOn 29 October, Wise admitted to breaching the rules and, to head off a scandal, agreed to repay £25,230. An internal UKIP inquiry was launched after the Parliament became aware of the affair, but no action was taken and the results of the investigation were kept secret. As Daniel Foggo later reported, UKIP's former leader, Roger Knapman, halted the inquiry after it uncovered serious wrongdoing, believing that the European Parliament would clear Wise. Farage told reporter Daniel Foggo that Wise \"had committed a simple, silly error by making himself a \"paying agent\" for his own staff.\"\n\nSuspension from UKIP\n\nOn 23 February 2007, party sources at UKIP discovered that the European Parliament had passed the affair to OLAF, the European Anti-Fraud Office. A UKIP meeting was convened in Brussels on 28 February 2007 at which Wise formally admitted to having spent £6,500 from the allowance on a dark green Peugeot 406 which he still drove, but refused to disclose how he had spent a further £13,000 of the funds. After a heated discussion, a decision was taken to remove the whip; both Knapman and fellow MEP Mike Nattrass challenged the decision and threatened to reconsider their futures in the party. Farage emphasised that, if cleared by the OLAF investigation, Wise would be welcomed back into the party, adding that he thought \"there is a great deal of public sympathy for us.\" Wise was however suspended by the party.\n\nFollowing his suspension, Wise spent a further £8,000 of the allowance in legal fees in contemplation of a libel case against Greg Lance-Watkins who had published claims on the Internet relating to Wise's activities. No action was ultimately brought against Lance-Watkins.\n\nNews of the World sting\n\nIn May 2008, the News of the World published details of a sting involving Tom Wise. A female reporter posing as a work experience student recorded Wise brazenly admitting in a Belgian bar that he had little idea of what his job as a Member of the European Parliament entailed, adding \"I don't know what an MEP's job is. No one's ever given me a job description. I've no idea what an MEP should or shouldn't do. So you make it up as you go along.\" He boasted of fiddling the Parliament's expenses system, stating \"Yes, I am milking the system [...] I have a simple philosophy. You and your parents are paying for me. Sorry, tough!\" The newspaper used its leading article to call for a change in the rules governing MEPs' expenses following the exposé.\n\nArrest and charges\n\nOn 20 June 2008, Wise was arrested by Bedfordshire Police's Economic Crime Unit on suspicion of making a false instrument, obtaining money by deception by transfer and converting criminal property. He was bailed until 29 October. Bedfordshire Police made the arrest after having been contacted by OLAF.\n\nOn 20 April 2009 the Crown Prosecution Service advised Bedfordshire Police to charge both Wise and Jenkins with one count each of false accounting contrary to the Theft Act 1968 and one count each of money laundering contrary to the Proceeds of Crime Act 2002. Both were scheduled to appear before the City of Westminster Magistrates' Court on in April 2009 to face the charges. Wise indicated that he was innocent and would fight the charges which carry a maximum 14-year jail term. He is thought to be the first MEP to face criminal charges over the misuse of parliamentary funds, and the second former UKIP MEP after Ashley Mote to have faced criminal charges during a parliamentary session.\n\nTrial and conviction\n\nWise appeared in court on 27 April 2009 and spoke only to confirm his name and plead not guilty. Jenkins also denied the charges. District Judge Daphne Wickham released both on conditional bail until 8 June. The case was transferred to Southwark Crown Court and charges specified: that Wise and Jenkins \"falsified a document, namely a contract for provision of services, an application for secretarial assistance allowance and invoices\". Also, that they used funds \"received from the European Parliament intended for use as payments for secretarial services.\"\n\nThe three-week trial began on 2 November 2009. Judge Geoffrey Rivlin QC heard the prosecution argue that Wise channelled parliamentary funds into an account he secretly controlled so that he could pay credit card debts and buy fine wines. He made separate payments of £2,228 and £1,260 to wine importers, and maintained the deception by asking Jenkins to sign blank documents which he completed later. But for his exposure, Wise would, according to prosecutors, have claimed up to £180,000.\n\nOn the third day of the trial, just before Nigel Farage was due to give evidence against him, Wise began several hours of negotiations with his legal team after which he changed his plea to guilty and said he was entirely to blame for the fraud. This resulted in Jenkins being acquitted. He was sentenced on 10 November 2009 to two years imprisonment, the sentence having been reduced by one year on account of his guilty plea. In sentencing him, Judge Geoffrey Rivlin declared that:\n\nIt is no exaggeration to say that you had hardly got your feet beneath your desk as an MEP before you were planning to defraud the parliament to which you were elected and the people you were elected to serve. This was very deliberate and blatant dishonesty. You did not fall into this offence as a result of some unfortunate combination of unforeseen circumstances which happened to suddenly present you with temptation. You knew the system of expenses inside out and this was a claim you devised and planned with some care.\n\nThe judge added that, in addition to jail, Wise would also have to pay £30,000 towards the prosecution's costs.\n\nPersonal life\n\nWise is married to Janet and, until his imprisonment, lived in Linslade near Leighton Buzzard in Bedfordshire. He has two grown-up children.\n\nWise has a developed interest in wines, having followed courses arranged by the Wine & Spirit Education Trust and has reached \"the level just below Master of Wine\". He has spoken of having a wine cellar containing 1,000 bottles of wine."}, {"url": "https://www.brookings.edu/research/race-gaps-in-sat-scores-highlight-inequality-and-hinder-upward-mobility/", "page_content": "Taking the SAT is an American rite of passage. Along with the increasingly popular ACT, the SAT is critical in identifying student readiness for college and as an important gateway to higher education. Yet despite efforts to equalize academic opportunity, large racial gaps in SAT scores persist.\n\nThe great score divide\n\nThe SAT provides a measure of academic inequality at the end of secondary schooling. Moreover, insofar as SAT scores predict student success in college, inequalities in the SAT score distribution reflect and reinforce racial inequalities across generations.\n\nIn this paper, we analyze racial differences in the math section of the general SAT test, using publicly available College Board population data for all of the nearly 1.7 million college-bound seniors in 2015 who took the SAT. (We do not use the newest data released for the class of 2016, because the SAT transitioned mid-year to a new test format, and data has so far only been released for students who took the older test.) Our analysis uses both the College Board’s descriptive statistics for the entire test-taking class, as well as percentile ranks by gender and race. (The College Board has separate categories for “Mexican or Mexican American” and “Other Hispanic, Latino, or Latin American.” We have combined them under the term Latino.)\n\nThe mean score on the math section of the SAT for all test-takers is 511 out of 800, the average scores for blacks (428) and Latinos (457) are significantly below those of whites (534) and Asians (598). The scores of black and Latino students are clustered towards the bottom of the distribution, while white scores are relatively normally distributed, and Asians are clustered at the top:\n\nRace gaps on the SATs are especially pronounced at the tails of the distribution. In a perfectly equal distribution, the racial breakdown of scores at every point in the distribution would mirror the composition of test-takers as whole i.e. 51 percent white, 21 percent Latino, 14 percent black, and 14 percent Asian. But in fact, among top scorers—those scoring between a 750 and 800—60 percent are Asian and 33 percent are white, compared to 5 percent Latino and 2 percent black. Meanwhile, among those scoring between 300 and 350, 37 percent are Latino, 35 percent are black, 21 percent are white, and 6 percent are Asian:\n\nThe College Board’s publicly available data provides data on racial composition at 50-point score intervals. We estimate that in the entire country last year at most 2,200 black and 4,900 Latino test-takers scored above a 700. In comparison, roughly 48,000 whites and 52,800 Asians scored that high. The same absolute disparity persists among the highest scorers: 16,000 whites and 29,570 Asians scored above a 750, compared to only at most 1,000 blacks and 2,400 Latinos. (These estimates—which rely on conservative assumptions that maximize the number of high-scoring black students, are consistent with an older estimate from a 2005 paper in the Journal of Blacks in Higher Education, which found that only 244 black students scored above a 750 on the math section of the SAT.)\n\nA stubborn black-white gap\n\nDisappointingly, the black-white achievement gap in SAT math scores has remained virtually unchanged over the last fifteen years. Between 1996 and 2015, the average gap between the mean black score and the mean white score has been .92 standard deviations. In 1996 it was .9 standard deviations and in 2015 it was .88 standard deviations. This means that over the last fifteen years, roughly 64 percent of all test-takers scored between the average black and average white score.\n\nThese gaps have a significant impact on life chances, and therefore on the transmission of inequality across generations. As the economist Bhashkar Mazumder has documented, adolescent cognitive outcomes (in this case, measured by the AFQT) statistically account for most of the race gap in intergenerational social mobility.\n\nCould the gap be even wider?\n\nThere are some limitations to the data which may mean that, if anything, the race gap is being understated. The ceiling on the SAT score may, for example, understate Asian achievement. If the exam was redesigned to increase score variance (add harder and easier questions than it currently has), the achievement gap across racial groups could be even more pronounced. In other words, if the math section was scored between 0 and 1000, we might see more complete tails on both the right and the left. More Asians score between 750 and 800 than score between 700 and 750, suggesting that many Asians could be scoring above 800 if the test allowed them to.\n\nA standardized test with a wider range of scores, the LSAT, offers some evidence on this front. An analysis of the 2013-2014 LSAT finds an average black score of 142 compared to an average white score of 153. This amounts to a black-white achievement gap of 1.06 standard deviations, even higher than that on the SAT. This is of course a deeply imperfect comparison, as the underlying population of test-takers for the LSAT (those applying to law school) is very different from that of the SAT. Nonetheless the LSAT distribution provides yet another example of the striking academic achievement gaps across race:\n\nAnother important qualification is that the SAT is no longer the nationally dominant college-entrance exam. In recent years, the ACT has surpassed the SAT in popularity. If the distributions of students taking the two exams are significantly different, focusing on one test alone won’t give a complete picture of the racial achievement gap. A cursory look at the evidence, however, suggests that race gaps on the 2016 ACT are comparable to those we observe for the SAT. In terms of composition, ACT test-takers were 54 percent white, 16 percent Latino, 13 percent black, and 4 percent Asian. Except for the substantially reduced share of Asian test-takers, this is reasonably close to the SAT’s demographic breakdown. Moreover, racial achievement gaps across the two tests were fairly similar. The black-white achievement gap for the math section of the 2015 SAT was roughly .88 standard deviations. For the 2016 ACT it was .87 standard deviations. Likewise, the Latino-white achievement gap for the math section of the 2015 SAT was roughly .65 standard deviations; for the 2016 ACT it was .54 standard deviations.\n\nOr could the gap be narrower than it looks?\n\nOn the other hand, there is a possibility that the SAT is racially biased, in which case the observed racial gap in test scores may overstate the underlying academic achievement gap. But most of the concerns about bias relate to the verbal section of the SAT, and our analysis focuses exclusively on the math section.\n\nFinally, this data is limited in that it doesn’t allow us to disentangle race and class as drivers of achievement gaps. It is likely that at least some of these racial inequalities can be explained by different income levels across race. Unfortunately, publicly available College Board data on class and SAT scores is limited. The average SAT score for students who identify as having parents making between $0 and $20,000 a year is 455, a score that is actually .2 standard deviations above the average score for black students (428). These numbers are fairly unreliable because of the low rates of student response; some 40 percent of test-takers do not list their household income. In comparison, only 4 percent of test-takers fail to provide their racial identification.\n\nHowever, a 2015 research paper from the Center for Studies in Higher Education at the University of California, Berkeley shows that between 1994 and 2011, race has grown more important than class in predicting SAT scores for UC applicants. While it is difficult to extrapolate from such findings to the broader population of SAT test-takers, it is unlikely that the racial achievement gap can be explained away by class differences across race.\n\nDown with standardized tests?\n\nGiven the reliance of colleges on test scores for admissions, the gaps in SAT math performance documented here will continue to reproduce patterns of inequality in American society. It seems likely, however, that colleges rely too heavily on such tests. Research from William Bowen, Matthew Chingos, and Michael McPherson suggests that high school grades may have more incremental predictive power of college grades and graduation rates. The SAT may not be a good measure of student potential.\n\nEven to the extent that SAT scores do predict college success, it is far from clear that universities are justified in basing admissions so strongly on the exam. After all, a wide range of other morally relevant considerations—questions of distributive justice, for example—may well need to be weighed alongside considerations of academic preparation.\n\nSignificant racial and class inequalities much earlier in life explain persistent obstacles to upward mobility and opportunity. The extensive racial gaps in academic achievement and college preparation across high school seniors are symptomatic of those deeper drivers of inequality. Accordingly, policy efforts may be more effective if they target underlying sources of these achievement gaps. That means experimenting with earlier childhood interventions of the sort we have described elsewhere: increasing cash transfers to disadvantaged parents with young children, improving access to quality preschool programs, pursuing paid leave policies to allow for more quality parent investment during the first years of life, teaching parents the skills they need to effectively raise their children, and so on.\n\nIt is also important to bear in mind that despite persistent gaps in test scores, racial gaps in college enrollment have actually been closing in recent years. In fact, the college enrollment gap by income is now significantly larger than by race. The challenge now is about college graduation rates (where race gaps have not closed) as much as college enrollment: for graduation rates, race gaps remain larger than income gaps.\n\nIt is also clear, however, that when such large gaps have opened up by the end of the high school years, equalizing outcomes at the college level will be an almost impossible task. Interventions at the end of the K-12 years, or in the early stages of college, can often be too little, too late.\n\nDebates over the fairness, value and accuracy of the SAT are sure to continue. The evidence for a stubborn race gap on this test does meanwhile provide a snapshot into the extraordinary magnitude of racial inequality in contemporary American society. Standardized tests are often seen as mechanisms for meritocracy, ensuring fairness in terms of access. But test scores reflect accumulated advantages and disadvantages in each day of life up the one on which the test is taken. Race gaps on the SAT hold up a mirror to racial inequities in society as a whole. Equalizing educational opportunities and human capital acquisition earlier is the only way to ensure fairer outcomes."}, {"url": "https://www.testbig.com/practice/sat-reading-khan-diagnostic-quiz-level-4-reading-11", "page_content": "Questions 1-11 are based on the following\n\npassage.\n\n\n\nPassage 1 is excerpted from Noah Webster, “On the Education of Youth in America,” originally published in 1790. Passage 2 is excerpted from Benjamin Rush, “Of the Mode of Education Proper in a Republic,” originally published in 1798.[br]The symbol [1] indicates that the following sentence is referenced in a question.\n\n\n\nPassage 1\n\nAnother defect in our schools, which, since the revolution,\n\n\n\nis become inexcuseable, is the want of proper books. The\n\n\n\ncollections which are now used consist of essays that respect\n\nforeign and ancient nations. The minds of youth are\n\n5 perpetually led to the history of Greece and Rome or to Great\n\n\n\nBritain; boys are constantly repeating the declamations of\n\n\n\nDemosthenes and Cicero, or debates upon some political\n\n\n\nquestion in the British Parliament. These are excellent\n\n\n\nspecimens of good sense, polished stile and perfect oratory;\n\n10 but they are not interesting to children. They cannot be very\n\n\n\nuseful, except to young gentlemen who want them as models\n\n\n\nof reasoning and eloquence, in the pulpit or at the bar.\n\n\n\nBut every child in America should be acquainted with his\n\n\n\nown country. He should read books that furnish him with\n\n15 ideas that will be useful to him in life and practice. As soon\n\n\n\nas he opens his lips, he should rehearse the history of his own\n\n\n\ncountry; he should lisp the praise of liberty, and of those\n\n\n\nillustrious heroes and statesmen, who have wrought a\n\n\n\nrevolution in her favor.\n\n20 A selection of essays, respecting the settlement and\n\n\n\ngeography of America; the history of the late revolution and\n\n\n\nof the most remarkable characters and events that\n\n\n\ndistinguished it, and a compendium of the principles of the\n\n\n\nfederal and provincial governments, should be the principal\n\n25 school book in the United States. These are interesting\n\n\n\nobjects to every man; they call home the minds of youth and\n\n\n\nﬁx them upon the interests of their own country, and they\n\n\n\nassist in forming attachments to it, as well as in enlarging the\n\n\n\nunderstanding.\n\n30 \"It is observed by the great Montesquieu, that the laws of\n\n\n\neducation ought to be relative to the principles of the\n\n\n\ngovernment.\"\n\nIn despotic governments, the people should have little or\n\n\n\nno education, except what tends to inspire them with a servile\n\n35 fear. Information is fatal to despotism. In monarchies,\n\n\n\neducation should be partial, and adapted to the rank of each\n\n\n\nclass of citizens. But \"in a republican government,\" says the\n\n\n\nsame writer, \"the whole power of education is required.\"\n\n\n\nHere every class of people should know and love the laws.\n\n40 This knowledge should be diffused by means of schools and\n\n\n\nnewspapers; and an attachment to the laws may be formed by\n\n\n\nearly impressions upon the mind. Two regulations are\n\n\n\nessential to the continuance of republican governments:\n\n[1] Such a distribution of lands and such principles of\n\n45 descent and alienation, as shall give every citizen a power of\n\n\n\nacquiring what his industry merits. [2] Such a system of\n\n\n\neducation as gives every citizen an opportunity of acquiring\n\n\n\nknowledge and ﬁtting himself for places of trust. These are\n\n\n\nfundamental articles; the sine qua non of the existence of the\n\n50 American republics.\n\n\n\n\n\nPassage 2"}, {"url": "https://www.homeservicellp.co.uk/case-studies/case-study1.aspx", "page_content": "Case Studies - Tom Wise\n\nTom lives on his own in a bungalow in a small rural village on the outskirts of Herne Bay. Tom has lived here for many years having wonderful memories of his late wife and days of working as a successful chef.\n\nIn Tom's later years he has suffered from some mental health problems, causing him to feel very distressed and sometimes paranoid, this makes everyday tasks such as washing, dressing, preparing meals and taking medication very difficult for Tom to complete.\n\nHome Service was contacted by the local mental health assessment team to provide care and support to Tom in his own home, after speaking to Tom, liaising with the mental health team and completing our initial assessment, it became apparent that Tom was an independently minded person who did not feel he needed too much help. It was agreed that we would provide a minimal care package until Tom could trust his carers and our company.\n\nAfter receiving care from two of our experienced carers, Pam and Julie, Tom's trust was gained.\n\nTwo years later Tom now receives a call in the morning, afternoon, and evening seven days a week, 365 days a year, with three and a half hours support with additional domestic support. The calls are completed by Toms’ trusted carers Pam, Julie and Margaret.\n\nWithin these two years, with the help from Tom’s care manager, we have managed to help him in many ways; from organising a new central heating system to ensure Tom is safe and warm during the winter months, through to tending to his beloved cats.\n\nTom now lives an independent and comfortable life in his own home where he can reflect and share memories of his past."}, {"url": "https://alchetron.com/Tom-Wise", "page_content": "Thomas Harold Wise (born 13 May 1948) was an Independent and UKIP Member of the European Parliament (MEP) for the East of England. A former police officer, he was elected in 2004 as a member of the UK Independence Party but later had the whip withdrawn when allegations of misuse of parliamentary expenses surfaced in The Sunday Telegraph. Following an inquiry carried out by the European Anti-Fraud Office, Wise was formally charged with false accounting and money laundering by Bedfordshire Police. After initially pleading not guilty, he admitted the charges and was sentenced in November 2009 at Southwark Crown Court to a two-year term of imprisonment. He is thought to be the first MEP to be jailed for expenses fraud. Sentencing him, the judge said that Wise had engaged in \"deliberate and blatant dishonesty\" and had set about to defraud the European Parliament almost as soon as he was elected.\n\nEarly career\n\nBorn in Bournemouth, Wise attended Bournemouth School between 1959 and 1965, before completing a Diploma in Public Speaking in 1967. He served with Dorset Police before embarking on a career in the food distribution and processing industry. He became the UK Managing Director of a German herbs and spices company. From 1981 to 1989 he was a member of the Liberal Party.\n\nUKIP\n\nWise joined the United Kingdom Independence Party (UKIP) in 1997. He served as office manager to Jeffrey Titford MEP, during this period he worked on the rules governing MEPs' expenses and gained an expertise in the system which he would later use to his advantage. He was the fourth-placed candidate on UKIP's candidate list in for the European Parliament elections in 1999, and also stood as the party's candidate in the 1997, 2001 and 2005 general elections for the South West Bedfordshire constituency. In the 2005 general election, he came fourth with 4.2% of the votes cast.\n\nHe was elected as an MEP for UKIP in the 2004 European elections. He was UKIP's official spokesman on the Culture, Youth, Media and Sport Committee until his suspension by the party in February 2007. In his first speech to the Committee on 4 October 2004, Wise criticised the proposed budget and drew allusions with Nazi Propaganda Minister Joseph Goebbels. In his maiden speech to the Parliament on 16 December 2004, Wise blamed the European Union for creating unacceptable conditions for the transit of animals around Europe. Wise also spoke out against the Proposed directive on the patentability of computer-implemented inventions\n\nIndependent\n\nAfter losing the party whip in March 2007, Wise continued as an Independent within UKIP's Independence/Democracy parliamentary grouping pending the outcome of the fraud inquiry.\n\nDuring his time as an MEP, Wise disputed the genuine nature of the September 11th attacks. and labelled Russia-based businessman Alisher Usmanov, who is a shareholder of Arsenal F.C. a \"gangster and racketeer\"\n\nFollowing the decision to press criminal charges against him, Wise decided not to contest the 2009 European Parliament elections. He has however said that he wants to stand as an MP in the 2010 General Election.\n\nExposure\n\nOn 23 October 2005, a reporter for the Sunday Telegraph, Daniel Foggo, published an article accusing Wise of claiming £36,000 a year from the European Parliament in the name of his researcher, Lindsay Jenkins, while only passing on about a sixth of that amount to her. According to now-repealed Rules governing the payment of expenses and allowances to Members of the European Parliament, MEPs could claim up to £125,000 per year for assistants' wages, but this money must be paid either directly to the employees or to a third-party agent. The rules did not allow the funds to pass directly through the hands of MEPs themselves.\n\nFoggo later reported that Wise had supplied the European Parliament's Payments Office with a \"contract\" including her name and details, which stipulated that the £36,000 allowance should be paid into an account named \"Stags\". This account, held with the Co-operative Bank, was in fact Wise's own business account and its full name was \"T Wise trading as Stags\". The actual agreement between Wise and Jenkins stated that she would receive monthly \"retainer\" payments of £500 for advice and statistical research, with any extra work to be paid on top. Bank documents obtained by Foggo showed that between November 2004 and October 2005, Wise had paid £39,100 to this account, out of which Jenkins received £13,555. These funds were the only monies coming into the account. In another breach of the payment regulations, some of the £13,555 paid to Jenkins represented work done on behalf of other UKIP members, including party leader Nigel Farage who had agreed to fund the publication of a eurosceptic pamphlet by Jenkins. A further £19,000 was transferred from the account, some of which to pay off credit cards.\n\nOn 29 October, Wise admitted to breaching the rules and, to head off a scandal, agreed to repay £25,230. An internal UKIP inquiry was launched after the Parliament became aware of the affair, but no action was taken and the results of the investigation were kept secret. As Daniel Foggo later reported, UKIP's former leader, Roger Knapman, halted the inquiry after it uncovered serious wrongdoing, believing that the European Parliament would clear Wise. Farage told reporter Daniel Foggo that Wise \"had committed a simple, silly error by making himself a \"paying agent\" for his own staff.\"\n\nSuspension from UKIP\n\nOn 23 February 2007, party sources at UKIP discovered that the European Parliament had passed the affair to OLAF, the European Anti-Fraud Office. A UKIP meeting was convened in Brussels on 28 February 2007 at which Wise formally admitted to having spent £6,500 from the allowance on a dark green Peugeot 406 which he still drove, but refused to disclose how he had spent a further £13,000 of the funds. After a heated discussion, a decision was taken to remove the whip; both Knapman and fellow MEP Mike Nattrass challenged the decision and threatened to reconsider their futures in the party. Farage emphasised that, if cleared by the OLAF investigation, Wise would be welcomed back into the party, adding that he thought \"there is a great deal of public sympathy for us.\" Wise was however suspended by the party.\n\nFollowing his suspension, Wise spent a further £8,000 of the allowance in legal fees in contemplation of a libel case against Greg Lance-Watkins who had published claims on the Internet relating to Wise's activities. No action was ultimately brought against Lance-Watkins.\n\nNews of the World sting\n\nIn May 2008, the News of the World published details of a sting involving Tom Wise. A female reporter posing as a work experience student recorded Wise brazenly admitting in a Belgian bar that he had little idea of what his job as a Member of the European Parliament entailed, adding \"I don't know what an MEP's job is. No one's ever given me a job description. I've no idea what an MEP should or shouldn't do. So you make it up as you go along.\" He boasted of fiddling the Parliament's expenses system, stating \"Yes, I am milking the system [...] I have a simple philosophy. You and your parents are paying for me. Sorry, tough!\" The newspaper used its leading article to call for a change in the rules governing MEPs' expenses following the exposé.\n\nArrest and charges\n\nOn 20 June 2008, Wise was arrested by Bedfordshire Police's Economic Crime Unit on suspicion of making a false instrument, obtaining money by deception by transfer and converting criminal property. He was bailed until 29 October. Bedfordshire Police made the arrest after having been contacted by OLAF.\n\nOn 20 April 2009 the Crown Prosecution Service advised Bedfordshire Police to charge both Wise and Jenkins with one count each of false accounting contrary to the Theft Act 1968 and one count each of money laundering contrary to the Proceeds of Crime Act 2002. Both were scheduled to appear before the City of Westminster Magistrates' Court on in April 2009 to face the charges. Wise indicated that he was innocent and would fight the charges which carry a maximum 14-year jail term. He is thought to be the first MEP to face criminal charges over the misuse of parliamentary funds, and the second former UKIP MEP after Ashley Mote to have faced criminal charges during a parliamentary session.\n\nTrial and conviction\n\nWise appeared in court on 27 April 2009 and spoke only to confirm his name and plead not guilty. Jenkins also denied the charges. District Judge Daphne Wickham released both on conditional bail until 8 June. The case was transferred to Southwark Crown Court and charges specified: that Wise and Jenkins \"falsified a document, namely a contract for provision of services, an application for secretarial assistance allowance and invoices\". Also, that they used funds \"received from the European Parliament intended for use as payments for secretarial services.\"\n\nThe three-week trial began on 2 November 2009. Judge Geoffrey Rivlin QC heard the prosecution argue that Wise channelled parliamentary funds into an account he secretly controlled so that he could pay credit card debts and buy fine wines. He made separate payments of £2,228 and £1,260 to wine importers, and maintained the deception by asking Jenkins to sign blank documents which he completed later. But for his exposure, Wise would, according to prosecutors, have claimed up to £180,000.\n\nOn the third day of the trial, just before Nigel Farage was due to give evidence against him, Wise began several hours of negotiations with his legal team after which he changed his plea to guilty and said he was entirely to blame for the fraud. This resulted in Jenkins being acquitted. He was sentenced on 10 November 2009 to two years imprisonment, the sentence having been reduced by one year on account of his guilty plea. In sentencing him, Judge Geoffrey Rivlin declared that:\n\nIt is no exaggeration to say that you had hardly got your feet beneath your desk as an MEP before you were planning to defraud the parliament to which you were elected and the people you were elected to serve. This was very deliberate and blatant dishonesty. You did not fall into this offence as a result of some unfortunate combination of unforeseen circumstances which happened to suddenly present you with temptation. You knew the system of expenses inside out and this was a claim you devised and planned with some care.\n\nThe judge added that, in addition to jail, Wise would also have to pay £30,000 towards the prosecution's costs.\n\nPersonal life\n\nWise is married to Janet and, until his imprisonment, lived in Linslade near Leighton Buzzard in Bedfordshire. He has two grown-up children.\n\nWise has a developed interest in wines, having followed courses arranged by the Wine & Spirit Education Trust and has reached \"the level just below Master of Wine\". He has spoken of having a wine cellar containing 1,000 bottles of wine."}, {"url": "https://wiki2.org/en/Tom_Wise_(politician)", "page_content": "What we do. Every page goes through several hundred of perfecting techniques; in live mode. Quite the same Wikipedia. Just better.\n\nBritish politician\n\nThomas Harold Wise (born 13 May 1948) is a former Independent and UKIP Member of the European Parliament (MEP) for the East of England. A former police officer, he was elected in 2004 as a member of the UK Independence Party but later had the whip withdrawn when allegations of misuse of parliamentary expenses surfaced in The Sunday Telegraph. Following an inquiry carried out by the European Anti-Fraud Office, Wise was formally charged with false accounting and money laundering by Bedfordshire Police. After initially pleading not guilty, he admitted the charges and was sentenced in November 2009 at Southwark Crown Court to a two-year term of imprisonment. He is thought to be the first MEP to be jailed for expenses fraud. Sentencing him, the judge said that Wise had engaged in \"deliberate and blatant dishonesty\" and had set about to defraud the European Parliament almost as soon as he was elected.\n\nEarly career\n\nBorn in Bournemouth, Wise attended Bournemouth School between 1959 and 1965, before completing a Diploma in Public Speaking in 1967.[2] He served with Dorset Police before embarking on a career in the food distribution and processing industry. He became the UK managing director of a German herbs and spices company.[3] From 1981 to 1989 he was a member of the Liberal Party.[4]\n\nPolitical career\n\nUKIP\n\nWise joined the United Kingdom Independence Party (UKIP) in 1997. He served as office manager to Jeffrey Titford MEP,[5] during this period he worked on the rules governing MEPs' expenses and gained an expertise in the system which he would later use to his advantage.[6] He was the fourth-placed candidate on UKIP's candidate list in for the European Parliament elections in 1999, and also stood as the party's candidate in the 1997, 2001 and 2005 general elections for the South West Bedfordshire constituency.[7] In the 2005 general election, he came fourth with 4.2% of the votes cast.[8]\n\nHe was elected as an MEP for UKIP in the 2004 European elections. He was UKIP's official spokesman on the Culture, Youth, Media and Sport Committee until his suspension by the party in February 2007. In his first speech to the Committee on 4 October 2004, Wise criticised the proposed budget and drew allusions with Nazi Propaganda Minister Joseph Goebbels.[9] In his maiden speech to the Parliament on 16 December 2004, Wise blamed the European Union for creating unacceptable conditions for the transit of animals around Europe.[10] Wise also spoke out against the Proposed directive on the patentability of computer-implemented inventions[11]\n\nIndependent\n\nAfter losing the party whip in March 2007,[12] Wise continued as an Independent[13] within UKIP's Independence/Democracy parliamentary grouping pending the outcome of the fraud inquiry.[14]\n\nDuring his time as an MEP, Wise disputed the genuine nature of the September 11th attacks.[15] and labelled Russia-based businessman Alisher Usmanov, who is a shareholder of Arsenal F.C. a \"gangster and racketeer\"[16]\n\nFollowing the decision to press criminal charges against him, Wise decided not to contest the 2009 European Parliament elections.[17] He did however say that he wanted to stand as an MP in the 2010 General Election.[18]\n\nFraud conviction\n\nExposure\n\nOn 23 October 2005, a reporter for the Sunday Telegraph, Daniel Foggo, published an article accusing Wise of claiming £36,000 a year from the European Parliament in the name of his researcher, Lindsay Jenkins, while only passing on about a sixth of that amount to her. According to now-repealed rules governing the payment of expenses and allowances to Members of the European Parliament, MEPs could claim up to £125,000 per year for assistants' wages, but this money must be paid either directly to the employees or to a third-party agent. The rules did not allow the funds to pass directly through the hands of MEPs themselves.[19]\n\nFoggo later reported that Wise had supplied the European Parliament's Payments Office with a \"contract\" including her name and details, which stipulated that the £36,000 allowance should be paid into an account named \"Stags\". This account, held with the Co-operative Bank, was in fact Wise's own business account and its full name was \"T Wise trading as Stags\". The actual agreement between Wise and Jenkins stated that she would receive monthly \"retainer\" payments of £500 for advice and statistical research, with any extra work to be paid on top. Bank documents obtained by Foggo showed that between November 2004 and October 2005, Wise had paid £39,100 to this account, out of which Jenkins received £13,555. These funds were the only monies coming into the account. In another breach of the payment regulations, some of the £13,555 paid to Jenkins represented work done on behalf of other UKIP members, including party leader Nigel Farage who had agreed to fund the publication of a eurosceptic pamphlet by Jenkins. A further £19,000 was transferred from the account, some of which to pay off credit cards.[19]\n\nOn 29 October, Wise admitted to breaching the rules[20] and, to head off a scandal, agreed to repay £25,230. An internal UKIP inquiry was launched after the Parliament became aware of the affair, but no action was taken and the results of the investigation were kept secret.[19] As Daniel Foggo later reported, UKIP's former leader, Roger Knapman, halted the inquiry after it uncovered serious wrongdoing, believing that the European Parliament would clear Wise.[21] Farage told reporter Daniel Foggo that Wise \"had committed a simple, silly error by making himself a \"paying agent\" for his own staff.\"[22]\n\nSuspension from UKIP\n\nOn 23 February 2007, party sources at UKIP discovered that the European Parliament had passed the affair to OLAF, the European Anti-Fraud Office. A UKIP meeting was convened in Brussels on 28 February 2007 at which Wise formally admitted to having spent £6,500 from the allowance on a dark green Peugeot 406 which he still drove, but refused to disclose how he had spent a further £13,000 of the funds.[23] After a heated discussion, a decision was taken to remove the whip; both Knapman and fellow MEP Mike Nattrass challenged the decision and threatened to reconsider their futures in the party. Farage emphasised that, if cleared by the OLAF investigation, Wise would be welcomed back into the party, adding that he thought \"there is a great deal of public sympathy for us.\"[24] Wise was however suspended by the party.\n\nFollowing his suspension, Wise spent a further £8,000 of the allowance in legal fees in contemplation of a libel case against Greg Lance-Watkins who had published claims on the Internet relating to Wise's activities. No action was ultimately brought against Lance-Watkins.[25]\n\nArrest and charges\n\nOn 20 June 2008, Wise was arrested by Bedfordshire Police's Economic Crime Unit on suspicion of making a false instrument, obtaining money by deception by transfer and converting criminal property. He was bailed until 29 October.[26][27] Bedfordshire Police made the arrest after having been contacted by OLAF.[28]\n\nOn 20 April 2009 the Crown Prosecution Service advised Bedfordshire Police to charge both Wise and Jenkins with one count each of false accounting contrary to the Theft Act 1968 and one count each of money laundering contrary to the Proceeds of Crime Act 2002.[29] Both were scheduled to appear before the City of Westminster Magistrates' Court in April 2009 to face the charges.[30] Wise indicated that he was innocent and would fight the charges which carry a maximum 14-year jail term.[31][32] He is thought to be the first MEP to face criminal charges over the misuse of parliamentary funds,[citation needed] and the second former UKIP MEP after Ashley Mote to have faced criminal charges during a parliamentary session.[31]\n\nTrial and conviction\n\nWise appeared in court on 27 April 2009 and spoke only to confirm his name and plead not guilty. Jenkins also denied the charges. District Judge Daphne Wickham released both on conditional bail until 8 June.[33] The case was transferred to Southwark Crown Court and charges specified: that Wise and Jenkins \"falsified a document, namely a contract for provision of services, an application for secretarial assistance allowance and invoices\". Also, that they used funds \"received from the European Parliament intended for use as payments for secretarial services.\"[34]\n\nThe three-week trial began on 2 November 2009. Judge Geoffrey Rivlin QC heard the prosecution argue that Wise channelled parliamentary funds into an account he secretly controlled so that he could pay credit card debts and buy fine wines.[35] He made separate payments of £2,228 and £1,260 to wine importers,[citation needed] and maintained the deception by asking Jenkins to sign blank documents which he completed later.[36] But for his exposure, Wise would, according to prosecutors, have claimed up to £180,000.[37]\n\nOn the third day of the trial, just before Nigel Farage was due to give evidence against him, Wise began several hours of negotiations with his legal team after which he changed his plea to guilty and said he was entirely to blame for the fraud. This resulted in Jenkins being acquitted.[1][38][39] He was sentenced on 10 November 2009 to two years imprisonment, the sentence having been reduced by one year on account of his guilty plea.[40][41][42] In sentencing him, Judge Geoffrey Rivlin declared that:[citation needed]\n\nIt is no exaggeration to say that you had hardly got your feet beneath your desk as an MEP before you were planning to defraud the parliament to which you were elected and the people you were elected to serve. This was very deliberate and blatant dishonesty. You did not fall into this offence as a result of some unfortunate combination of unforeseen circumstances which happened to suddenly present you with temptation. You knew the system of expenses inside out and this was a claim you devised and planned with some care.\n\nThe judge added that, in addition to jail, Wise would also have to pay £30,000 towards the prosecution's costs.\n\nPersonal life\n\nWise is married to Janet and, until his imprisonment, lived in Linslade near Leighton Buzzard in Bedfordshire. He has two adult children.[3]\n\nWise has a developed interest in wines, having followed courses arranged by the Wine & Spirit Education Trust and has reached \"the level just below Master of Wine\".[43]\n\nReferences"}, {"url": "https://dl.acm.org/doi/fullHtml/10.1145/3531130.3533338", "page_content": "ACM Reference Format: Remi Delannoy and Kuldeep S. Meel. 2022. On Almost-Uniform Generation of SAT Solutions: The power of 3-wise independent hashing. In 37th Annual ACM/IEEE Symposium on Logic in Computer Science (LICS) (LICS '22), August 2–5, 2022, Haifa, Israel. ACM, New York, NY, USA 10 Pages. https://doi.org/10.1145/3531130.3533338\n\nIn this work, we design a new randomized algorithm that makes $\\mathcal {O}(\\varepsilon ^{-1} + \\log n \\log \\varepsilon ^{-1})$ calls to a SAT oracle and employs 3 − wise independent hash functions. The widely used 2 − wise independent hashing is tabulation hashing proposed by Carter and Wegman. Since this classical scheme is also 3 − wise independent, we observe that practical implementation of our technique does not incur additional overhead. We demonstrate that theoretical improvements translate to practice; in particular, we conduct a comprehensive study over 562 benchmarks and demonstrate that while JVV would time out for 544 out of 562 instances, our proposed scheme can handle all the 562 instances. To the best of our knowledge, this is the first almost-uniform generation scheme that can handle practical instances from real-world applications. We also present a nuanced analysis focusing on the both the size of SAT queries as well as the number of queries.\n\nGiven a Boolean formula φ and a distribution parameter ɛ, the problem of almost-uniform generation seeks to design a randomized generator such that every solution of φ is output with probability within (1 + ɛ)-factor of $\\frac{1}{|sol({\\varphi })|}$ where sol(φ) is the set of all the solutions of φ. The prior state of the art scheme due to Jerrum, Valiant, and Vazirani, makes $\\mathcal {O}(n^2 \\log n + n\\log n\\log \\varepsilon ^{-1})$ calls to a SAT oracle and employs 2 − wise independent hash functions.\n\n1 INTRODUCTION Let φ denote a Boolean formula in conjunctive normal form (CNF), and let X be the set of variables appearing in F. Let n = |X|. A truth assignment σ maps variables in X to 0 or 1. A satisfying assignment or witness of F is an assignment that makes φ evaluate to true. We denote the set of all witnesses of φ by sol(φ). We use $\\Pr \\left[\\mathcal {X}\\right]$ to denote the probability of event $\\mathcal {X}$. In this paper, we consider the following problem: Almost-Uniform Generation for Boolean Formulas Formula φ and parameter ɛ\n\n\n\ny ∈ sol(φ) ∪ {⊥}.\n\nLet $\\mathsf {Ret}$ be the event that the output is not ⊥. Then, \\begin{align*} &\\frac{1}{(1+\\varepsilon)|sol({\\varphi })|} \\le \\Pr [ \\sigma \\text{ is output} \\mid \\mathsf {Ret}] \\le \\frac{1+\\varepsilon }{|sol({\\varphi })|} \\\\ &\\text{ For some constant } c,\\ \\Pr [\\mathsf {Ret}] > c \\end{align*}\n\n\n\nThe problem of almost-uniform generation was first considered by Jerrum, Valiant, and Vazirani [10] who showed that almost-uniform generation can be achieved in probabilistic polynomial time given access to an approximate counter, which in turn employs a $\\mathsf {SAT}$ oracle. In particular, the JVV algorithm makes $\\mathcal {O}(n^2\\log n + n\\log n\\log \\varepsilon ^{-1}))$ calls to a SAT oracle (defined formally in Section 2) and uses 2-wise independent hash functions. The work of Jerrum et al. also considered the stricter notion of uniform generation (wherein ɛ = 0) and showed that uniform generation can be accomplished in probabilistic polynomial time given access to $\\Sigma _2^P$ oracle. Subsequently, Bellare, Goldreich, and Petrank [2] showed that uniform generation can be achieved in probabilistic polynomial time given access to $\\mathsf {NP}$ oracle. In particular, their proposed procedure, henceforth referred to as $\\mathsf {BGP }$, makes $\\mathcal {O}(n^2\\log n)$ calls to $\\mathsf {SAT}$ oracle but requires n − wise independent hash functions. One can express t − wise independent hash functions with polynomial of degree t over GF(2n). The high degree of polynomials make computations over them expensive and therefore, one would ideally like to work with polynomials of as small degree as possible. Therefore, from theoretical perspective, one wonders whether we can design algorithmic procedure for almost-uniform generation that makes fewer queries to $\\mathsf {SAT}$ oracle and requires hash functions with smaller independence. The need for efficient algorithms is exacerbated by the wide ranging applications of uniform sampling in diverse domains such as pathogen transmission inference in bioinformatics [17], constrained-random simulation for bug discovery for software and hardware [15], probabilistic inference for graphical models [5], and the like. In all such applications, the practical implementation of uniform generators replace $\\mathsf {SAT}$ oracle with a state of the art SAT solver. Therefore, one would ideally like to make as fewer calls to a $\\mathsf {SAT}$ oracle (a SAT solver in practice) as possible and use hash functions with as small independence as possible. 1.1 Our Results The key contribution of this work is to establish the following two theorems: Theorem 1.1 Given access to $\\mathsf {SAT}$ oracle, for all ɛ > 0, there exists a probabilistic polynomial time almost-uniform generation procedure for Boolean Formulas that makes $\\mathcal {O}(\\varepsilon ^{-1} + \\log n \\cdot \\log \\varepsilon ^{-1})$ queries to $\\mathsf {SAT}$ oracle and uses 3 − wise independent hashing. If given access to only 2 − wise independent hash family, we obtain the following: Theorem 1.2 Given access to $\\mathsf {SAT}$ oracle, for all ɛ > 1 , there exists a probabilistic polynomial time almost-uniform generation procedure for Boolean Formulas that makes $\\mathcal {O}(\\log n \\cdot \\log \\left(\\frac{1}{\\varepsilon -1}\\right))$ queries to $\\mathsf {SAT}$ oracle and uses 2 − wise independent hashing. To put our results in the context of existing work, we summarize our results along with existing results in Table 1. Table 1: Almost-uniform generators along with the number of queries and the independence of hash functions where n = |X| $\\mathsf {SAT}$ Queries Indep. Notes BGP [2] $\\mathcal {O}(n^2 \\log n)$ n ɛ = 0 CMV [8] $\\mathcal {O}(\\frac{1}{(\\varepsilon -1.71)^{2}} + \\log n)$ 3 ɛ > 1.71 JVV [10] $\\mathcal {O}(n^2 \\log n + n \\log n \\log \\varepsilon ^{-1})$ 2 ɛ > 0 Theorem 1.1 $\\mathcal {O}(\\varepsilon ^{-1} + \\log n\\cdot \\log \\varepsilon ^{-1})$ 3 ɛ > 0 Theorem 1.2 $\\mathcal {O}(\\log n\\cdot \\log (\\frac{1}{\\varepsilon -1}))$ 2 ɛ > 1 In typical use cases of uniform sampling, ɛ is set to a small constant. Therefore, from practical perspective, for a fixed ɛ, we improve the complexity of almost-uniform generation from $\\mathcal {O}(n^2\\log n)$ to $\\mathcal {O}(\\log n)$ while requiring 3 − wise independence instead of 2 − wise independence. It is worth noting that the standard construction of t − wise independent hash function is a random t − 1 degree polynomial in a large enough prime field. But thankfully, for small constant independence, more efficient constructions are known. In particular, the tabulation-based hashing dating back to Carter and Wegman [4] is known to be 3 − wise (and hence, 2-wise) independent [12]. Formally, a random hash function belonging to tabulation-based hashing h: {0, 1}n↦{0, 1}m can be constructed as h(X) = AX + b where A is a m × n matrix while b is m × 1 0-1 vector and each entry of A and b is either 0 or 1 with equal probability (i.e., 1/2). Tabulation-based scheme is shown to be significantly faster than alternative construction using degree 2-polynomials [16]. The availability of hash functions that can be described using linear function over GF(2) plays a consequential role in practical implementation of the techniques. It is worth emphasizing that we consider a salient strength of this paper is the simplicity of the algorithm including usage of simple data structures. Furthermore, the associated analysis takes a different route in comparison to prior work [2, 8, 10]. In particular, in our view, we offer a much simpler and intuitive analysis methodology in comparison to prior work. Another important contribution of our work is a nuanced complexity analysis, presented in Section 6, that seeks to capture both time and space complexity of SAT queries; such an analysis is inspired from the practical behavior of SAT solvers. To illustrate the practical impact of improvement due to our results, we implemented the three samplers wherein we employed the state of the art SAT solver, $\\mathsf {CryptoMiniSAT}$, to perform SAT calls. Our empirical evaluation over 562 benchmarks show that while our algorithm can successfully sample within one hour for all such instances, JVV timed out on 544 out of 562 instances . The rest of the paper is organized as follows: In Section 2, we introduce the basic notations and preliminaries. In Section 3, we present background overview of inner workings of JVV and BGP to put our contribution in context. We present the primary technical contribution of this paper in Section 4. In Section 5, we discuss how our proposed scheme can be extended to handle arbitrary $\\mathsf {NP}$ relations. In Section 7, we provide empirical evidence to demonstrate that the theoretical improvements lead to significant improvements in practice. We finally conclude in Section 8.\n\n2 PRELIMINARIES In this section, we will state basic notations and preliminaries. 2.1 Boolean Formulas Let φ denote a Boolean formula in conjunctive normal form (CNF), and let X be the set of variables appearing in φ. Let n = |X|. A satisfying assignment or witness of φ is an assignment that makes φ evaluate to true. We denote the set of all witnesses of φ by sol(φ). $\\mathsf {SAT}$ Oracle In this work, we assume access to a $\\mathsf {SAT}$ oracle that takes in a formula φ and returns a satisfying assignment σ if φ is satisfiable and ⊥ is φ is unsatisfiable. The model of $\\mathsf {SAT}$ oracle captures the behavior of the modern SAT solvers. Since the problem of satisfiability is self-reducible, one can easily show that the our model of $\\mathsf {SAT}$ oracle can be linearly (in n) simulated via the model of $\\mathsf {NP}$ decision oracle, which returns Yes or No. $\\mathsf {BSAT}$ Procedure In this work, we use the gadget of $\\mathsf {BSAT}$, which was introduced by Bellare et al in [2]. Formally, given a formula φ and threshold t, $\\mathsf {BSAT}$ returns a set of solutions W such that |W| = min(t, |sol(φ)|). The following proposition characterizes the complexity of $\\mathsf {BSAT}$. Proposition 1. $\\mathsf {BSAT}$ can be implemented in polynomial time given access to a $\\mathsf {SAT}$ oracle and makes $\\mathcal {O}(t)$ calls to $\\mathsf {SAT}$ oracle. Proof. The following procedure suffices: □ 2.2 Approximate Model Counting A problem closely related to almost-uniform generation is that of approximate model counting. Given a CNF formula φ, a tolerance θ > 0 and a confidence parameter δ ∈ (0, 1], a probabilistic approximate model counter ${\\mathsf {ApproxCount}}(\\cdot, \\cdot, \\cdot)$ ensures that \\begin{align*} \\mathsf {Pr}[\\frac{|sol(\\varphi)|}{1+\\theta } \\le {\\mathsf {ApproxCount}}(\\varphi, \\theta, \\delta) \\le (1+\\theta)|sol(\\varphi)|] \\\\ \\ge 1-\\delta. \\end{align*}\n\nWe will employ $\\mathsf {ApproxCount}$ as a gadget and the following theorem establishes the runtime complexity. Proposition 2. [3, 21] Given a CNF formula φ over n variables, tolerance θ > 0 and a confidence parameter δ ∈ (0, 1], there exists a probabilistic approximate model counter that runs in probabilistic polynomial time given access to a $\\mathsf {SAT}$ oracle and makes $\\mathcal {O} (\\log (n/\\theta) \\log (1/\\delta))$ calls to $\\mathsf {SAT}$ oracle. Proof. We will use the procedure $\\mathsf {ApproxMC}$ as a subroutine; the following claim captures the complexity of $\\mathsf {ApproxMC}$ as stated in Theorem 4 of [9]:□ Claim 1 Given a CNF formula φ over n variables, tolerance $\\hat{\\theta } > 0$ and a confidence parameter δ ∈ (0, 1], $\\mathsf {ApproxMC}$ runs in probabilistic polynomial time given access to a $\\mathsf {SAT}$ oracle and makes $\\mathcal {O} (\\log (n) \\cdot \\frac{1}{\\hat{\\theta }^2} \\cdot \\log (1/\\delta))$ calls to $\\mathsf {SAT}$ oracle, and returns an estimate c such that \\begin{align*} \\Pr \\left[ \\frac{|sol({\\varphi })|}{1+\\hat{\\theta }} \\le c \\le (1+\\hat{\\theta }) |sol({\\varphi })| \\right] \\ge 1-\\delta \\end{align*}\n\nGiven a formula φ over n variables. We first construct another formula ψ such that ψ is essentially t copies of φ where $t > \\frac{1}{\\log (1+\\theta)}$. Formally, let φ be defined on the set of variables X(1) such that n = |X(1)|. We now create another (t − 1) sets of fresh variables, denoted by X(2), …X(t), such that each of these sets have n variables. Formally, |X(1)| = |X(2)| = …|X(t)| = n. We can now define ψ as follows: \\begin{align*} \\psi := \\varphi (X^{(1)}) \\wedge \\varphi (X^{(1)} \\mapsto X^{(2)}) \\cdots & \\wedge \\varphi (X^{(1)} \\mapsto X^{(t)}) \\end{align*}\n\nWhere X(1)↦X(i) means that we substitute the variables of the set X(1) by the variables of the set X(i) in the formula. Note that |sol(ψ)| = |sol(φ)|t. Next, we compute an estimate $\\mathrm{initEst} = \\mathsf {ApproxMC}(\\psi, 1, \\delta)$. Now our estimate of the |sol(φ)| is simply (initEst)1/t. Note that the number of calls to SAT oracle is $\\mathcal {O} (\\log (n/\\hat{\\theta }) \\log (1/\\delta))$. It is probably worth emphasizing that the trick of creating multiple copies is fairly standard, and is indeed used in Figure 1 of [3] as well. 2.3 k-wise Independent Hashing Let and $\\mathcal {H}(n,m) \\subseteq \\lbrace h:\\lbrace 0,1\\rbrace ^{n} \\rightarrow \\lbrace 0,1\\rbrace ^m \\rbrace$ be a family of hash functions mapping {0, 1}n to {0, 1}m. We use $h \\xleftarrow {R} \\mathcal {H}(n,m)$ to denote the probability space obtained by choosing a function h uniformly at random from $\\mathcal {H}(n,m)$. Definition 1 A family of hash functions $\\mathcal {H}(n,m)$ is k − wise independent if for all distinct y 1 , y 2 , ⋅⋅⋅y k ∈ {0, 1}n and $\\forall \\alpha _1, \\alpha _2, \\cdots \\alpha _k \\in \\lbrace 0,1\\rbrace ^m, h \\xleftarrow {R} \\mathcal {H}(n,m)$, \\begin{align*} \\mathsf {Pr}[(h(y_1) = \\alpha _1) \\wedge \\cdots \\wedge (h(y_k) = \\alpha _k)] = \\left(\\frac{1}{2^{m}}\\right)^k \\end{align*}\n\nWe are interested in the set of elements of sol(φ) mapped to cell α by h, denoted $\\mathsf {Cell}_{\\langle \\varphi, h, \\alpha \\rangle }$ and its cardinality. Formally, $\\mathsf {Cell}_{\\langle \\varphi, h, \\alpha \\rangle }= \\lbrace y \\mid y \\in sol({\\varphi }) \\text{ and } h(y) = \\alpha \\rbrace$. In our work, we will be interested in a fixed α and for simplicity, we will fix α = 0. We will use shorthand ${\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }}$ to denote $|\\mathsf {Cell}_{\\langle \\varphi, h, \\mathbf {0} \\rangle }|$. Typically, higher the value of k, stronger one can obtain concentration bounds on the random variable ${\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }}$. In particular, the concentration bounds of the following form are typically obtain: \\begin{align*} \\Pr \\big [ \\left| \\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }- \\mathsf {E}[ \\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }] \\right| \\ge \\beta \\mathsf {E}[\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle } \\big ] \\\\ \\le f(\\mathsf {E}[ |\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }], k, \\beta) \\end{align*}\n\nThe standard concentration bounds lead to $f(\\mathsf {E}[ |\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }|],$ k, β) such that f is monotonically decreasing in $k, \\beta, \\mathsf {E}[ |\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }|]$. The following proposition concerning 2-wise and 3-wise hash functions is important in our analysis Proposition 3. Given a 2-wise independent hash family H(n, m), for $h \\xleftarrow {R} H(n,m), \\forall \\sigma \\in sol({\\varphi }), \\forall \\alpha \\in \\lbrace 0,1\\rbrace ^m$ $\\mathsf {E}[\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle } ]=\\frac{|sol({\\varphi })|}{2^m}$\n\n$\\mathsf {E}\\left[\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle } \\bigm \\vert h(\\sigma)=\\mathbf {0}\\right]=1 +\\frac{|sol({\\varphi })|-1}{2^m}$\n\n$Var \\left[\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }\\right]=\\frac{|sol({\\varphi })|}{2^m}-\\frac{|sol({\\varphi })|}{2^{2m}}\\le \\mathsf {E}[\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }]$\n\nIf H(n, m) is also a 3-wise independent hash family, then $Var[ \\mathsf {Cnt}_{\\langle \\varphi, h \\rangle } \\mid h(\\sigma)=\\alpha ]=\\frac{|sol({\\varphi })|-1}{2^m}-\\frac{|sol({\\varphi })|-1}{2^{2m}}\\le \\mathsf {E}[\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle } \\mid h(\\sigma)=\\mathbf {0}]$\n\nProof. ∀ω ∈ sol(φ), let γ ω, α be the indicator variable of the event h(ω) = α. \\begin{align*} \\gamma _{\\omega,\\alpha } = {\\left\\lbrace \\begin{array}{@{}l@{\\quad }l@{}}1 & \\text{if } h(\\omega)=\\alpha \\\\ 0 & \\text{otherwise} \\end{array}\\right.} \\end{align*}\n\nSince $\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }=\\sum _{\\omega \\in sol({\\varphi })} \\gamma _{\\omega,\\alpha }$, therefore, \\begin{align*} \\mathsf {E}[\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }] = \\sum _{\\omega \\in sol({\\varphi })} \\mathsf {E}[\\gamma _{\\omega,\\alpha }] &= \\sum _{\\omega \\in sol({\\varphi })} \\Pr [h(\\omega) = \\alpha ]\\\\ & = \\frac{|sol({\\varphi })|}{2^m} \\end{align*}\n\nGiven h(σ) = α, we have γ σ, α = 1. Therefore, \\begin{align*} \\mathsf {E}[\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle } \\mid h(\\sigma)=\\alpha ]=1 +\\frac{|sol({\\varphi })|-1}{2^m} \\end{align*}\n\nThe variance is $Var[ \\mathsf {Cnt}_{\\langle \\varphi, h \\rangle } ] = \\sum _{\\omega \\in sol({\\varphi })}Var[ \\gamma _{\\omega,\\alpha } ] + \\sum _{\\omega\n\ne \\omega ^{\\prime }}Cov[ \\gamma _{\\omega,\\alpha },\\gamma _{\\omega ^{\\prime },\\alpha } ]$. We have $Var[ \\gamma _{\\omega,\\alpha } ]=\\frac{1}{2^m}(1-\\frac{1}{2^m})$. Then, let us compute the covariance $Cov[ \\gamma _{\\omega,\\alpha },\\gamma _{\\omega ^{\\prime },\\alpha } ]=\\Pr [ h(\\omega)=\\alpha \\wedge h(\\omega ^{\\prime })=\\alpha ]-\\Pr [ h(\\omega)=\\alpha ]\\Pr [ h(\\omega ^{\\prime })=\\alpha ]$ $=\\frac{1}{2^{2m}}-\\frac{1}{2^m}\\frac{1}{2^m}=0$. Thus, we have $Var[ \\mathsf {Cnt}_{\\langle \\varphi, h \\rangle } ]=\\frac{|sol({\\varphi })|}{2^m}-\\frac{|sol({\\varphi })|}{2^{2m}}$ Also, observe that if H(n, m) is 3-wise independent hash family, then, $Var[ \\mathsf {Cnt}_{\\langle \\varphi, h \\rangle } \\mid h(\\sigma)=\\alpha ]=\\sum _{\\omega \\in sol({\\varphi })\\backslash \\lbrace \\sigma \\rbrace }Var[ \\gamma _{\\omega,\\alpha } ] +$ $\\sum _{\\omega\n\ne \\omega ^{\\prime }}Cov[ \\gamma _{\\omega,\\alpha },\\gamma _{\\omega ^{\\prime },\\alpha } \\mid \\gamma _{\\sigma,\\alpha }=1 ]$. The conditional covariance becomes $Cov[ \\gamma _{\\omega,\\alpha },\\gamma _{\\omega ^{\\prime },\\alpha }|\\gamma _{\\sigma,\\alpha }=1 ]\\\\ =\\frac{\\Pr [ h(\\omega)=\\alpha,h(\\omega ^{\\prime })=\\alpha,h(\\sigma)=\\alpha ]}{\\Pr [ h(\\sigma)=\\alpha ]}-\\frac{\\Pr [ h(\\omega)=\\alpha,h(\\sigma)=\\alpha ]}{\\Pr [ h(\\sigma)=\\alpha ]}\\frac{\\Pr [ h(\\omega ^{\\prime })=\\alpha,h(\\sigma)=\\alpha ]}{\\Pr [ h(\\sigma)=\\alpha ]}$ $=\\frac{2^m}{2^{3m}}-\\frac{2^m}{2^{2m}}\\frac{2^m}{2^{2^m}}=\\frac{1}{2^{2m}}-\\frac{1}{2^{2m}}=0$ Thus we have $Var[ \\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }|h(\\sigma)=\\alpha ]=\\frac{|sol({\\varphi })|-1}{2^m}-\\frac{|sol({\\varphi })|-1}{2^{2m}}$□ The standard construction of k − wise independent hash families consists of a degree k − 1 polynomially over a large enough prime field or GF(2n). But thankfully, for small constant independence, efficient constructions are known. In particular, the tabulation-based hashing proposed by Carter and Wegman [4] is known to be 3 − wise (and hence, 2-wise) independent [12]. Formally, the tabulation-based scheme can be defined as follows: Proposition 4. Let H be the set of all functions of the form h(X) = AX + b where A ∈ GF(2)m × n and b ∈ GF(2)m. Note that a uniformly random h ∈ H can be constructed by setting each entry in A and b to 0 or 1 independently with probability $\\frac{1}{2}$ each. Then H is 3-wise independent, i.e., all distinct y 1 , y 2 , y 3 ∈ {0, 1}n and $\\forall \\alpha _1, \\alpha _2, \\alpha _3 \\in \\lbrace 0,1\\rbrace ^m, h \\xleftarrow {R} \\mathcal {H}(n,m)$, \\begin{align*} \\mathsf {Pr}[(h(x_1) = \\alpha _1) \\wedge (h(x_2) = \\alpha _2) \\wedge (h(x_3) = \\alpha _3)] = \\frac{1}{2^{3m}} \\end{align*}\n\nTabulation-based scheme is shown to be significantly faster than alternative construction using degree 2-polynomials [16].\n\n3 BACKGROUND To put our contributions in context, we review the prior approaches to (almost-)uniform generation due to Bellare, Goldreich, and Petrank (referred to as BGP approach) and Jerrum, Valiant, and Vazirani (referred to as JVV approach). JVV approach is based on the observation that for a fixed ordering of variables, say x 1 ≻x 2 ....≻x n , we can set x 1 to 0 with probability $\\frac{|sol({\\varphi \\wedge (x_1 = 0)})|}{|sol({\\varphi })|}$. Then, once we have set x 1 to v 1 , we can set x 2 to 0 with probability $\\frac{|sol({\\varphi \\wedge x_1 = v_1 \\wedge (x_2 = 0) })|}{|sol({\\varphi \\wedge (x_1 = v_1)})|}$, and accordingly we can set rest of the variables. It is easy to see that if we have access to an exact counter, then the scheme would give rise to an exact counter, the above scheme would lead to a uniform generator. Interestingly, the careful analysis due to Jerrum et al's also demonstrated that given access to a probabilistic approximate model counter the above process would lead to almost uniform generator wherein each call to counter is called with θ = 1/n and $\\delta = \\frac{\\varepsilon }{2^{n+2}(2n+1)}$. There are two shortcomings of the above approach: (1) the procedure invokes a counter 2n times, and (2) each of the invocations of approximate counter employ very small values of θ and δ. The BGP approach seeks to circumvent multiple invocations of counter and instead seeks to directly employ the hashing paradigm. The key idea is to use a k − wise independent hash family $\\mathcal {H}(n,m)$ such that for a randomly chosen $h \\in \\mathcal {H}$ and for an appropriately chosen m, it is the case that all the cells are small, wherein a cell α is small if it has less than 2n2 solutions, i.e., a cell α is small if $|\\mathsf {Cell}_{\\langle F, h, \\alpha \\rangle }| < \\mathsf {thresh}$ for some appropriately chosen $\\mathsf {thresh}$. The key underpinning observation is that one can use a $\\mathsf {NP}$ oracle to check if all the cells are small. If it is the case that all the cells are small, then one can randomly choose one of the cells, enumerate all the solutions in the cell using an $\\mathsf {NP}$ oracle. Now if we were to just randomly sample a solution in a cell, then we may not achieve uniformity as while all the cells are small but it is not necessarily the case that all cells have equal number of solutions. Bellare et al. observed that we could just randomly pick a number between 1 and $\\mathsf {thresh}$, if the chosen number is less than the size of the cell, we pick an element from the cell uniformly at random else output ⊥. One possible threat to this idea is what if most of the cells have very few solutions (e.g., a small constant number of solutions)? In such a case, we would be outputting ⊥ with probability close to 1. Thankfully, Bellare et al also observed that for the appropriately chosen value of m, it is also the case that with probability 0.9, all cells are non-trivial, i.e., $|\\mathsf {Cell}_{\\langle F, h, \\alpha \\rangle }| > \\frac{\\mathsf {thresh}}{4}$, and small, i.e., $|\\mathsf {Cell}_{\\langle F, h, \\alpha \\rangle }| < \\mathsf {thresh}$. It is perhaps worth noting that $\\mathsf {thresh}$ is set to 2n2. The primary shortcoming of BGP approach is its reliance on $\\frac{n}{\\log n}$wise independent hashing. The BGP paper worked with n − wise independent hash functions but one can show that $\\frac{n}{\\log n}$-wise independence suffices thanks to the concentrations bounds for limited independence due to Schmidt, Siegel, and Srinivasan [18]. The crucial aspect of the analysis of BGP is to compute the probability that for a random choice of h, for all α, $ \\mathsf {thresh}/4 \\le |\\mathsf {Cell}_{\\langle F, h, \\alpha \\rangle }| < \\mathsf {thresh}$. We use $\\frac{n}{\\log n}$-independence of hash functions to ensure that for a given cell α, the probability of $ \\mathsf {thresh}/4 \\le |\\mathsf {Cell}_{\\langle F, h, \\alpha \\rangle }| < \\mathsf {thresh}$ is bounded by 1 − 2n + c for some constant c. Applying union bounds allow us to lower bound the probability that all the cells are non-trivial and small. The theoretical analysis framework of BGP can not be extended to handle hash functions with constant independence. It is perhaps worth emphasizing that BGP guarantees uniformity while our objective is to design an almost-uniform generator. To summarize, JVV approach reduces the problem of almost-uniform generation to linear number of invocations of a probabilistic approximate counter with $\\delta = \\mathcal {O}(2^{-n}n^{-1} \\varepsilon)$ and θ = 1/n. As noted above, there exist approximate counters that employ 2-wise independent hashing. On the other hand, BGP approach directly attempts to employ hashing-based paradigm but requires n − wise independent hash functions. In this work, we seek to design an approach that seeks to achieve the best of both the worlds: we seek to call approximate counter only once and then seek to directly employ hashing-based paradigm with 3 − wise independence instead of $\\frac{n}{\\log n}$-wise independence as needed in BGP. In addition BGP and JVV approaches, another attempt in similar spirit owes to Chakraborty, Meel, and Vardi [6, 8] who sought to blend the usage of approximate counting and 3-wise hashing; their proposed scheme, UniGen, could only provide guarantees of uniformity for ɛ > 1.71.\n\n4 ALMOST-UNIFORM GENERATION In our desired algorithm, we seek to employ hash families with constant independence (in particular, 3 − wise and 2 − wise). As a first step, we need to determine the appropriate value of m. To this end, we seek to rely on close relationship of counting and sampling, and invoke a probabilistic approximate counter to compute an estimate of |sol(φ)|, and compute the m based on the returned estimate by the counter. We will invoke the counter with a constant θ and δ ≤ ɛ/4 (Recall, JVV employs θ = 1/n and $\\delta = \\mathcal {O}(2^{-n}n^{-1}\\varepsilon)$). Given our usage of hash functions with constant independence, we can not ensure that size of all the cells would be below a pre-defined threshold and therefore, we seek to randomly pick a cell α, and check if its size is below a threshold. If the size of the cell is indeed below the threshold, we appropriately pick a solution. We now first present the algorithm formally, then perform the theoretical analysis, and close this section with interesting observations. 4.1 Algorithm We present the pseudo-code of the desired algorithm, called $\\mathsf {UniGen4}$, in Algorithm 1 . We describe the algorithm using the hash family H(n, m) whose independence properties will be spelled out in the following sections. $\\mathsf {UniGen4}$ first invokes $\\mathsf {BSAT}$ to check if φ has less than $\\mathsf {thresh}$ solutions (line 3). In such a case the strategy is to simply enumerate the solutions and pick one of the solutions uniformly at random. Otherwise, we invoke an approximate counter to determine the value of m (lines 8 – 9). Once we have determined the appropriate value of m, we pick a hash function randomly from H(n, m) and simply enumerate the solutions of F that map to h− 1(0). 4.2 Analysis when H(n, m) is 3-wise independent The primary objective of this section is to establish the following theorem: Theorem 1.1.Given access to $\\mathsf {SAT}$ oracle, for all ɛ > 0, there exists a probabilistic polynomial time almost-uniform generation procedure for Boolean Formulas that makes $\\mathcal {O}(\\varepsilon ^{-1} + \\log n \\cdot \\log \\varepsilon ^{-1})$ queries to $\\mathsf {SAT}$ oracle and uses 3 − wise independent hashing. Proof. We prove the above theorem by demonstrating that $\\mathsf {UniGen4}$ with 3-wise independent hash family H(n, m) gives rise to almost-uniform sampling (Lemma 3) and succeeds i.e., does not return ⊥, with probability at least 0.05 (Lemma 4). The Lemma 5 establishes the complexity of $\\mathsf {UniGen4}$ with respect to the number of queries to $\\mathsf {SAT}$ oracles. As noted in Introduction, our analysis takes a different route compared to that of JVV [10], BGP [2], and CMV [8].□ We first begin with list of shorthands for clarity of exposition: $\\mathsf {Ret}$ : The algorithm $\\mathsf {UniGen4}$ doesn't return ⊥\n\n$\\mathsf {AcCnt}$ : The count C returned by $\\mathsf {ApproxCount}$ satisfies $\\frac{|sol({\\varphi })|}{\\sqrt 2}\\le C \\le \\sqrt 2|sol({\\varphi })|$\n\n$\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle } = |\\mathsf {Cell}_{\\langle \\varphi, h, \\mathbf {0} \\rangle }|$\n\nfor σ ∈ sol(φ), O σ : The algorithm $\\mathsf {UniGen4}$ outputs σ\n\nWe begin by observing that if $|sol({\\varphi })|\\le \\mathsf {thresh}$ then it is immediate that the output distribution is uniform. Therefore, we focus on the case $|sol({\\varphi })|> \\mathsf {thresh}$. First observe from line 14, we have ∀σ ∈ sol(φ), \\begin{align*} \\Pr [O_\\sigma ] =\\frac{1}{\\mathsf {thresh}}\\times \\Pr [ h(\\sigma)=0\\wedge \\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }\\le \\mathsf {thresh}] \\end{align*}\n\nLemma 1∀σ ∈ sol(φ), $\\Pr [O_\\sigma |\\mathsf {Ret}]=\\frac{\\Pr [ \\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }\\le \\mathsf {thresh}\\mid h(\\sigma)=0 ]}{\\sum _{\\omega \\in sol({\\varphi })}\\Pr [ \\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }\\le \\mathsf {thresh}\\mid h(\\omega)=0 ]}$ Proof. Let σ ∈ sol(φ) \\begin{align*} &\\Pr [ O_\\sigma |\\mathsf {Ret}]=\\frac{\\Pr [ O_\\sigma \\wedge \\mathsf {Ret}]}{\\Pr [ \\mathsf {Ret}]}=\\frac{\\Pr [ O_\\sigma ]}{\\Pr [ \\mathsf {Ret}]} \\\\ &=\\frac{1/\\mathsf {thresh}\\times \\Pr [ h(\\sigma)=0\\wedge \\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }\\le \\mathsf {thresh}]}{1/\\mathsf {thresh}\\times \\sum _{\\omega \\in sol({\\varphi })}\\Pr [ h(\\omega)=0\\wedge \\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }\\le \\mathsf {thresh}]}\\\\ &=\\frac{\\Pr [ \\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }\\le \\mathsf {thresh}\\mid h(\\sigma)=0 ]}{\\sum _{\\omega \\in sol({\\varphi })}\\Pr [ \\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }\\le \\mathsf {thresh}\\mid h(\\omega)=0 ]} \\end{align*}\n\nThe last equality comes from the fact that ∀σ ∈ sol(φ), $ \\Pr [ h(\\sigma)=0 ]=1/2^m$. Lemma 2 $\\forall \\sigma \\in sol({\\varphi }), \\Pr [ \\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }\\le \\mathsf {thresh}| h(\\sigma)=0 \\wedge \\mathsf {AcCnt}]\\ge 1-\\frac{1}{2\\mathsf {pivot}}$ Proof. From Proposition 3, we have $\\mathsf {E}[\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle } \\mid h(\\sigma)=0]=1+\\frac{|sol({\\varphi })|-1}{2^m}$ and $Var[\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle } \\mid h(\\sigma)=0] \\le \\frac{|sol({\\varphi })|-1}{2^m}$. From the definition of m line 10, we have $\\frac{C}{\\sqrt {2}\\mathsf {pivot}}\\le 2^m\\le \\frac{\\sqrt {2}C}{\\mathsf {pivot}}$, and if we have an approximate count, then, we also have $\\frac{|sol({\\varphi })|}{\\sqrt 2}\\le C \\le \\sqrt 2|sol({\\varphi })|$. Thus, \\begin{align*} \\mathsf {E}[\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }|h(\\sigma)=0\\wedge \\mathsf {AcCnt}]\\le 1+2\\cdot \\mathsf {pivot}\\\\ Var[\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }|h(\\sigma)=0\\wedge \\mathsf {AcCnt}]\\le 2\\cdot \\mathsf {pivot}. \\end{align*}\n\n$\\mathsf {thresh}\\ge 2+4\\mathsf {pivot}$ . Therefore, \\begin{align*} &\\Pr \\big [ \\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }> \\mathsf {thresh}|h(\\sigma)=0\\wedge \\mathsf {AcCnt}\\big ]\\\\ & \\le \\mathrm{Pr\\big [ |\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }-\\mathsf {E}[\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }]|\\ge 1+2\\mathsf {pivot}|h(\\sigma)=0\\wedge \\mathsf {AcCnt}\\big ]}. \\end{align*}\n\n\\begin{align*} &\\mathrm{Pr\\big [ |\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }-\\mathsf {E}[\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }]|\\ge 1+2\\mathsf {pivot}|h(\\sigma)=0\\wedge \\mathsf {AcCnt}\\big ]}\\\\ &\\le \\frac{Var[\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }|h(\\sigma)=0\\wedge \\mathsf {AcCnt}]}{(1+2\\mathsf {pivot})^2}\\le \\frac{1}{2\\mathsf {pivot}} \\end{align*}\n\nRemember that. Therefore,Applying Chebyshev inequality we get Remark 4.1 Note that application of Chebyshev inequality required bounding $Var [ \\mathsf {Cnt}_{\\langle \\varphi, h \\rangle } \\mid h(\\sigma)=0]$ from above. We obtained such a bound on $Var[\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle } \\mid h(\\sigma)=0]$ with the usage of 3 − wise independence. Lemma 3 $\\forall \\sigma \\in sol({\\varphi }), \\frac{1}{(1+\\varepsilon)|sol({\\varphi })|}\\le \\Pr [ O_\\sigma |\\mathsf {Ret}]\\le \\frac{1+\\varepsilon }{|sol({\\varphi })|}$ Proof. The high-level overview is to employ Lemma 2 to obtain the lower bound and employ Lemma 1 to obtain the desired upper bound. \\begin{align*} &\\Pr [ \\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }\\le \\mathsf {thresh}|h(\\sigma)=0 ]\\\\ &\\ge \\Pr [ \\mathsf {AcCnt}]\\Pr [ \\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }\\le \\mathsf {thresh}| h(\\sigma)=0\\wedge \\mathsf {AcCnt}] \\end{align*}\n\nUsing Lemma 2, we obtain \\begin{align*} \\Pr [ \\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }\\le \\mathsf {thresh}|h(\\sigma)=0 ]\\ge (1-\\delta)(1-\\frac{1}{2\\mathsf {pivot}}) \\end{align*}\n\nThus, we have $\\forall \\sigma \\in sol({\\varphi }),(1-\\delta)(1-\\frac{1}{2\\mathsf {pivot}})\\le \\Pr [ \\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }\\le \\mathsf {thresh}|h(\\sigma)=0 ] \\le 1$ Then using Lemma 1, \\begin{align*} \\frac{(1-\\frac{1}{2\\mathsf {pivot}})(1-\\delta)}{|sol({\\varphi })|}\\le \\Pr [ O_\\sigma \\mid \\mathsf {Ret}]\\le \\frac{1}{(1-\\frac{1}{2\\mathsf {pivot}})(1-\\delta)|sol({\\varphi })|}. \\end{align*}\n\nIf 0 < ɛ ≤ 1, $1-\\frac{\\varepsilon }{2}\\ge \\frac{1}{1+\\varepsilon }$, and as $\\mathsf {pivot}\\ge \\frac{2}{\\varepsilon }$ and $\\delta \\le \\frac{\\varepsilon }{4}$, $(1-\\delta)(1-\\frac{1}{2\\mathsf {pivot}})\\ge 1-\\frac{\\varepsilon }{2}\\ge \\frac{1}{1+\\varepsilon }$ Else if ɛ > 1, δ = 0.1 and $\\mathsf {pivot}=200$ thus $(1-\\delta)(1-\\frac{1}{2\\mathsf {pivot}})=0.89775 \\ge \\frac{1}{2} \\ge \\frac{1}{1+\\varepsilon }$ Hence in all cases $\\frac{1}{(1+\\varepsilon)|sol({\\varphi })|}\\le \\Pr [ O_\\sigma |\\mathsf {Ret}]\\le \\frac{1+\\varepsilon }{|sol({\\varphi })|}$□ Lemma 4 $\\Pr [ \\mathsf {Ret}]\\ge 0.05$ Proof. Let $\\mathsf {loTh}=\\frac{3\\mathsf {pivot}}{10}$, we have \\begin{align*} \\Pr [\\mathsf {Ret}]\\ge (1-\\delta)\\Pr [ \\mathsf {loTh}\\le \\mathsf {Cnt}_{\\langle \\varphi, h \\rangle } \\le \\mathsf {thresh}|\\mathsf {AcCnt}]\\frac{\\mathsf {loTh}}{\\mathsf {thresh}} \\end{align*}\n\nThis inequality comes from the observation that if $\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }\\ge \\mathsf {loTh}$ then there is a probability of at least $\\frac{\\mathsf {loTh}}{\\mathsf {thresh}}$ that we return an element of sol(φ) (we choose k uniformly at random in $[1,\\mathsf {thresh}]$ and there are at least $\\mathsf {loTh}$ values that yield a return). Next, observe that $\\frac{\\mathsf {loTh}}{\\mathsf {thresh}}\\ge \\frac{3\\mathsf {pivot}}{10*(3+4\\mathsf {pivot})}\\ge \\frac{2}{27}$ (as $\\mathsf {pivot}\\ge 200$) Remember that $\\mathsf {thresh}\\ge 2+4\\mathsf {pivot}$, and if we have an approximate count, then, $ \\frac{\\mathsf {pivot}}{2}\\le \\mathsf {E}[\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }]\\le 2\\mathsf {pivot}$. Hence, we have $\\mathsf {E}[\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }]-\\frac{\\mathsf {pivot}}{5}\\ge \\mathsf {loTh}$ and $\\mathsf {E}[\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }]+\\frac{\\mathsf {pivot}}{5}\\le \\mathsf {thresh}$ Thus, \\begin{align*} \\Pr [ \\mathsf {loTh}\\le \\mathsf {Cnt}_{\\langle \\varphi, h \\rangle } \\le \\mathsf {thresh}\\bigm \\vert \\mathsf {AcCnt}] \\\\ \\ge \\Pr \\big [ \\bigm \\vert \\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }-\\mathsf {E}[\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }] \\bigm \\vert < \\frac{\\mathsf {pivot}}{5} \\bigm \\vert \\mathsf {AcCnt}\\big ] \\end{align*}\n\nApplying Chebyshev inequality $\\Pr \\big [ \\bigm \\vert \\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }-\\mathsf {E}[\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }] \\bigm \\vert < \\frac{\\mathsf {pivot}}{5} \\bigm \\vert \\mathsf {AcCnt}\\big ] \\le \\frac{25\\mathsf {E}[\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }]}{\\mathsf {pivot}^2}\\le \\frac{50}{\\mathsf {pivot}}\\le \\frac{1}{4}$ Hence $\\Pr [ \\mathsf {loTh}\\le \\mathsf {Cnt}_{\\langle \\varphi, h \\rangle } \\le \\mathsf {thresh}\\bigm \\vert \\mathsf {AcCnt}]\\ge \\frac{3}{4}$ and $\\Pr [ \\mathsf {Ret}]\\ge \\frac{9}{10}\\frac{3}{4}\\frac{2}{27}=0.05$□ Lemma 5 The algorithm $\\mathsf {UniGen4}$ makes $\\mathcal {O}(\\log n \\log \\varepsilon ^{-1} + \\varepsilon ^{-1})$ calls to $\\mathsf {SAT}$ oracle. Proof. $\\mathsf {ApproxCount}$ is invoked with δ ≤ ɛ/4, therefore, from Proposition 2, this leads to $\\mathcal {O}(\\log n \\log \\varepsilon ^{-1})$ calls. Furthermore, since $\\mathsf {thresh}\\in \\mathcal {O}(\\varepsilon ^{-1})$, the calls to $\\mathsf {BSAT}$ add another $\\mathcal {O}(\\varepsilon ^{-1})$. Therefore, in total $\\mathsf {UniGen4}$ makes $\\mathcal {O}(\\log n \\log \\varepsilon ^{-1} + \\varepsilon ^{-1})$ calls to $\\mathsf {SAT}$ oracle.□ Choice of Parameters The complexity of the algorithm is tightly related to the values of δ and $\\mathsf {pivot}$. The parameter δ is directly linked to the number of calls to the SAT oracle, and $\\mathsf {pivot}$ is the main parameter that influences the number of calls made by BSAT. It is worth noting that we only need to verify the equation $(1-\\delta)(1-\\frac{1}{2\\mathsf {pivot}})\\le \\frac{1}{1+\\varepsilon }$ for the Lemma 3 to be true. We purposefully take simple values for the sake of proof simplicity. One could search better values by trying to minimize the number of calls to the oracle $\\mathcal {O}(\\log n\\log \\delta ^{-1} + \\mathsf {pivot})$ and/or the query size $\\mathcal {O}(|\\varphi | + \\mathsf {pivot}+ n^2)$. Nevertheless, we expected the probability to be close to $\\frac{\\mathsf {E}[\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }]}{\\mathsf {thresh}}$. Indeed, we only fail if k is greater than $\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }$, as we sample k uniformly at random, the expected probability of success is $\\frac{\\mathsf {E}[\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }]}{\\mathsf {thresh}}$. Unfortunately, proving that the probability of success is, indeed, $\\frac{\\mathsf {E}[\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }]}{\\mathsf {thresh}}$ is not that simple because of several technical details. Mainly, $\\mathsf {BSAT}$ halts after $\\mathsf {thresh}$ calls, so we only have a truncated expectation ($\\Pr [ \\mathsf {Ret}]=\\sum _{i=1}^\\mathsf {thresh}\\frac{i}{\\mathsf {thresh}} \\Pr [ \\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }=i ]$). Because of this, to guarantee a probability of success, we were forced to do a less careful analysis, and we likely get a very loose bound. This is also the reason why we add upper and lower bounds on δ and $\\mathsf {pivot}$ respectively. 4.3 From 3-wise to 2-wise independent hash function family As mentioned in Remark 4.1, the proof of Lemma 2 crucially relies on the usage of 3-wise independence. In this context, one naturally wonders whether it is possible to obtain stronger guarantees with access to only 2-wise independent hash functions. The objective of this section is to establish the following theorem: Theorem 1.2.Given access to $\\mathsf {SAT}$ oracle, for all ɛ > 1 , there exists a probabilistic polynomial time almost-uniform generation procedure for Boolean Formulas that makes $\\mathcal {O}(\\log n \\cdot \\log \\left(\\frac{1}{\\varepsilon -1}\\right))$ queries to $\\mathsf {SAT}$ oracle and uses 2 − wise independent hashing. 4.4 Modifications to $\\mathsf {UniGen4}$ We will consider the variant of UniSamp wherein line 7 is replaced by $\\delta \\leftarrow min(0.1,\\frac{\\varepsilon -1}{\\varepsilon +1})$. It is worth noting that this change still implies $\\log (\\delta ^{-1})=\\mathcal {O}(\\varepsilon ^{-1})$. However, $\\mathsf {thresh}$ is now a constant, so therefore, the UniSamp makes $\\mathcal {O}(\\log n \\log \\varepsilon ^{-1} + \\mathsf {thresh}) \\in \\mathcal {O}(\\log n \\log \\varepsilon ^{-1})$ calls to SAT oracle. Lemma 6 If H(n, m) is 2-wise independent, $\\forall \\sigma \\in sol({\\varphi })\\\\ \\Pr (\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }\\le \\mathsf {thresh}| h(\\sigma)=0\\wedge \\mathsf {AcCnt})\\ge \\frac{1}{2}$ Proof. Reusing the notations introduced in Lemma 2, note that computation of $\\mathsf {E}[\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }|h(\\sigma)=0\\wedge \\mathsf {AcCnt}]$ only requires 2-wise independence. Therefore, $\\mathsf {E}[\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }|h(\\sigma)=0\\wedge \\mathsf {AcCnt}] \\le 1+2\\mathsf {pivot}$. But the 2-wise independence does not suffice to bound the $Var[\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }|h(\\sigma)=0\\wedge \\mathsf {AcCnt}]$ and therefore, we can not proceed with the usage of Chebyshev inequality. That said, we observe that we can instead rely on the weaker concentration bound offered by Markov inequality as follows: \\begin{align*} \\Pr [ \\mathsf {Cnt}_{\\langle \\varphi, h \\rangle } \\le \\mathsf {thresh}| \\gamma _\\sigma \\wedge \\mathsf {AcCnt}]\\\\ \\ge 1-\\frac{\\mathsf {E}[\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }|h(\\sigma)=0 \\wedge \\mathsf {AcCnt}]}{\\mathsf {thresh}} \\end{align*}\n\n$\\mathsf {thresh}\\ge 2+4\\mathsf {pivot}$ , \\[ \\Pr [ \\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }\\le \\mathsf {thresh}| \\gamma _\\sigma \\wedge \\mathsf {AcCnt}]\\ge 1-\\frac{1+2\\mathsf {pivot}}{2+4\\mathsf {pivot}}=\\frac{1}{2} \\]\n\nRecalling that It is perhaps worth noting that with 3 − wise independence, we could lower bound the above probability by $1-\\frac{1}{2 \\mathsf {pivot}}$, and therefore, allowing it to be arbitrarily close to 1. Theorem 4.2 If H(n, m) is 2 − wise independent, then \\begin{align*} &\\forall \\varepsilon > 1,\\forall \\sigma \\in sol({\\varphi }),\\\\ &\\frac{1}{(1+\\varepsilon)|sol({\\varphi })|}\\le \\Pr (O_\\sigma | \\mathsf {Ret}) \\le \\frac{1+\\varepsilon }{|sol({\\varphi })|} \\end{align*}\n\nProof. The proof follows along the similar lines that of Lemma 3 with the usage of Lemma 2 substituted with that of Lemma 6. \\begin{align*} &\\Pr (\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }\\le \\mathsf {thresh}|h(\\sigma)=0)\\\\ &=\\Pr (\\mathsf {AcCnt})\\Pr (\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }\\le \\mathsf {thresh}| h(\\sigma)=0\\wedge \\mathsf {AcCnt}) \\\\ &+ \\Pr (\\overline{\\mathsf {AcCnt}})\\Pr (\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }\\le \\mathsf {thresh}| h(\\sigma)=0\\wedge \\overline{\\mathsf {AcCnt}}) \\\\ & \\ge \\Pr (\\mathsf {AcCnt})\\Pr (\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }\\le \\mathsf {thresh}| h(\\sigma)=0\\wedge \\mathsf {AcCnt}) \\end{align*}\n\nUsing Lemma 6, $\\Pr (\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }\\le \\mathsf {thresh}|h(\\sigma)=0)\\ge (1-\\delta)(1-\\frac{1}{2})$. Therefore, we have $\\forall \\sigma \\in sol({\\varphi }),(1-\\delta)(1-\\frac{1}{2})\\le \\Pr (\\mathsf {Cnt}_{\\langle \\varphi, h \\rangle }\\le \\mathsf {thresh}|h(\\sigma)=0) \\le 1$ Then using Lemma 1, \\begin{align*} \\frac{(1-\\delta)}{2|sol({\\varphi })|}\\le \\Pr (O_\\sigma |\\mathsf {Ret})\\le \\frac{2}{(1-\\delta)|sol({\\varphi })|} \\end{align*}\n\n$\\delta \\le \\frac{\\varepsilon -1}{\\varepsilon +1}$ , $1-\\delta \\ge \\frac{2}{\\varepsilon +1}$ and we have \\[ \\frac{1}{(1+\\varepsilon)|sol({\\varphi })|}\\le \\Pr (O_\\sigma |\\mathsf {Ret})\\le \\frac{1+\\varepsilon }{|sol({\\varphi })|} \\]\n\nAsand we have\n\n5 UNIVERSAL GENERATORS So far we have focused on one particular $\\mathsf {NP}$ relation: SAT but the core framework can be applied to any arbitrary $\\mathsf {NP}$ relation with minor modifications. To this end, we will first fix some notations: given an $\\mathsf {NP}$ language L, let R be the NP-relation defining L, i.e. L = {y | ∃w such that R(y, w) = 1}. Also, let n = |y|, and without loss of generality, we can assume $R_{y}\\stackrel{def}{=} \\lbrace x\\ |\\ R(y,x)=1\\rbrace \\subseteq \\lbrace 0,1\\rbrace ^n$. Similar to [2], for h: {0, 1}n↦{0, 1}m, y ∈ L R , we can define \\begin{align*} R_{y,h} = \\lbrace w \\in R_{y} \\mid h(w) = 0 \\rbrace = h^{-1}(0) \\cap R_{y} \\end{align*}\n\nThe following proposition generalizes the Proposition 1 Proposition 5. [2] For every $\\mathsf {NP}$ relation R, there is a polynomial time oracle algorithm $\\mathcal {M}_1$ that takes in y ∈ L R , h ∈ H(n, m), and $\\mathsf {thresh}$ as input and outputs R y, h if $|R_{y,h}| \\le \\mathsf {thresh}$ and ⊥ otherwise. $\\mathcal {M}_1$ makes $\\mathcal {O}(n\\cdot \\mathsf {thresh})$ calls to $\\mathsf {NP}$ oracle. Proof. Let consider the set S R, h = {(y, k) | ∃z 1 , z 2 ...z k such that z 1 ...z k are distinct and ∀i ∈ [1, k], R(y, z k ) = 1 and h(z k ) = 0} and $S_{R,h}^{\\prime }=\\lbrace (y,k,i,j)\\ | \\ \\ \\exists z_1\\prec z_2\\prec...\\prec z_k \\mathrm{\\ such\\ that\\ } z_{i,j}=1 \\mathrm{\\ and\\ } \\forall l\\in [1,k],R(y,z_l)=1\\mathrm{\\ and\\ } h(z_l)=0 \\rbrace$ Here, z i, j is the j-th bit of z i and ≺ denotes some ordering relation. As R is an NP relation and h can be computed in polynomial time, these sets are in NP. Then, given the access to a NP oracle, $\\mathcal {M}_1$ can be implemented as follow. It is immediate that we make at most $1 + \\mathsf {thresh}+ \\mathsf {thresh}\\cdot n \\in \\mathcal {O}(n\\cdot \\mathsf {thresh})$ calls to the oracle.□ Note that when m = 0, h is just an identity function, and therefore, we will omit mentioning h for the special case when m = 0. We also have an analogous generalization for Proposition 2. Proposition 6. [3] For every $\\mathsf {NP}$ relation R, there is a probabilistic polynomial time algorithm $\\mathcal {M}_2$ that takes in y ∈ L R , θ > 0, and δ > 0 as input and returns an estimate ν such that \\begin{align*} \\Pr \\left[ \\frac{|R_{y}|}{1+\\theta } \\le\n\nu \\le (1+\\theta) |R_{y}| \\right] \\ge 1-\\delta \\end{align*}\n\n$\\mathcal {M}_2$ makes $\\mathcal {O}(\\log (n/\\theta) \\log (1/\\delta))$ calls to $\\mathsf {NP}$ oracle. Furthermore,makescalls tooracle. Equipped with the two propositions, we can now finally state the theorem: Theorem 5.1 Let R be an $\\mathsf {NP}$-relation. Then there exists an almost-uniform generation procedure for R for all ɛ > 0 that makes $\\mathcal {O}(n\\varepsilon ^{-1})$ queries to $\\mathsf {NP}$ oracle and uses 3 − wise independent hashing. Proof. Given proposition 5 and 6 we can adapt our algorithm by replacing BSAT by $\\mathcal {M}_1$ and ApproxCount by $\\mathcal {M}_2$. We state the pseudocode of the algorithm in Algorithm 3 for completeness. Then, it is immediate that our algorithm makes $\\mathcal {O}(n\\varepsilon ^{-1} + \\log n \\log (\\varepsilon ^{-1})) \\in \\mathcal {O}(n\\varepsilon ^{-1})$ queries to the NP oracle.□\n\n6 A NUANCED ANALYSIS: ON SIZE OF SAT QUERIES Table 2: Almost-uniform generators along with the number of queries, the size of $\\mathsf {SAT}$ Queries, and the independence of hash functions. $\\mathsf {SAT}$ Queries Size Independence JVV- $\\mathcal {A}$ [Prop. 8] $\\mathcal {O}(n^2 \\log n + n \\log n \\log \\varepsilon ^{-1})$ $\\mathcal {O}(|\\varphi | + n^4)$ 2 $\\mathsf {UniGen4}$ - $\\mathcal {A}$ [Prop. 10] $\\mathcal {O}(\\varepsilon ^{-1} +\\log n\\cdot \\log \\varepsilon ^{-1})$ $\\mathcal {O}(|\\varphi | + n^2 + n \\varepsilon ^{-1})$ 3 JVV- $\\mathcal {B}$ [Prop. 9] $\\mathcal {O}(n^4 \\log n + n^3 \\log n \\log \\varepsilon ^{-1})$ $\\mathcal {O}(|\\varphi | + n^3)$ 2 $\\mathsf {UniGen4}$ - $\\mathcal {B}$ [Prop. 11] $\\mathcal {O}(\\varepsilon ^{-1} +\\log n\\cdot \\log \\varepsilon ^{-1})$ $\\mathcal {O}(|\\varphi | + n^2+ n \\varepsilon ^{-1})$ 3 The traditional analysis often focuses on the number of queries to the given oracle. Over the past two decades, SAT solving has witnessed an unprecedented progress that has allowed the modern SAT solvers to solve problems involving millions of variables [11]. The progress in SAT solving has led to rise in designing algorithms such that the formulas over which SAT solvers are invoked with are easy for SAT solvers to solve [13]. While understanding the behavior of SAT solvers is a major open research question, a parameter of interest is often the size of the queries. In this regard, the past few years have witnessed design of algorithm that may trade off the number of queries for smaller sized queries. To put this in perspective, we will survey the complexity of two different algorithms for approximate counting algorithms: Proposition 7. Given a CNF formula φ over n variables, tolerance θ > 0 and a confidence parameter δ ∈ (0, 1]: there exists probabilistic approximate model counter $\\mathcal {A}$ that runs in probabilistic polynomial time given access to a $\\mathsf {SAT}$ oracle, makes $\\mathcal {O} (\\log (n/\\theta) \\log (1/\\delta))$ calls to $\\mathsf {SAT}$ oracle and each query is of the size $\\mathcal {O}(|\\varphi | + \\frac{n^2}{\\theta ^2})$ [3, 10, 21]\n\nprobabilistic approximate model counter $\\mathcal {B}$ that runs in probabilistic polynomial time given access to a $\\mathsf {SAT}$ oracle, makes $\\mathcal {O} (\\log (n) \\frac{1}{\\theta ^2} \\log (1/\\delta))$ calls to $\\mathsf {SAT}$ oracle and each query is of the size $\\mathcal {O}(|\\varphi | + \\frac{n}{\\theta ^2})$ [7, 9]\n\nIt is worth noting that $\\mathsf {ApproxCount}$ referenced in Section 2.2 is a variant of model counter $\\mathcal {A}$ while $\\mathsf {ApproxMC}$ referenced in Claim 1 is a variant of model counter $\\mathcal {B}$. In practice, it turns out that variants of algorithm $\\mathcal {B}$ work more efficiently than those of $\\mathcal {A}$ [1, 14]. The current state of the art algorithm for approximate model counting (based on empirical performance) is $\\mathsf {ApproxMC}$ (a variant of $\\mathcal {B}$) [9, 20]. We present a more nuanced analysis of the complexity of JVV approach and $\\mathsf {UniGen4}$ in the following table (Table 2) based on the approximate model counters invoked by them. In Table 2, JVV-$\\mathcal {A}$ refers to implementation of JVV with probabilistic model counter $\\mathcal {A}$ stated in Proposition 7; similarly, JVV-$\\mathcal {B}$ refers to JVV with probabilistic model counter $\\mathcal {B}$. The following propositions prove the results stated in Table 2. Proposition 8. $\\mathsf {JVV}$-$\\mathcal {A}$ makes $\\mathcal {O}(n^2\\log n + n\\log n\\log \\varepsilon ^{-1})$ SAT queries. The size of the queries is $\\mathcal {O}(|\\varphi |+n^4)$. Proof. From the pseudocode of JVV, the algorithm makes 2n+1 calls to ApproxCount with θ = 1/n and $\\delta =\\frac{\\varepsilon }{(2n+1)2^{n+2}}$. Here, their procedure ApproxCount is implemented by a probabilistic approximate counter which makes $\\mathcal {O}(\\log (n/\\theta)\\log (1/\\delta)))$ calls to a SAT oracle. Substituing θ and δ by their value, one call to ApproxCount in the JVV algorithm makes $\\mathcal {O}(\\log (n^2)\\log ((2n+1)2^{n+2}\\varepsilon ^{-1}))=\\mathcal {O}(\\log n(\\log n + (n+2) + \\log (\\varepsilon ^{-1}))=\\mathcal {O}(n\\log n + \\log n \\log (\\varepsilon ^{-1}))$ calls to a SAT oracle. As JVV makes $\\mathcal {O}(n)$ calls to ApproxCount, the total number of queries is $\\mathcal {O}(n^2\\log n + n\\log n \\log (\\varepsilon ^{-1}))$. The size of the queries is $\\mathcal {O}(|\\varphi |+ \\frac{n^2}{\\theta ^2})$, substituing with θ = 1/n immediatly gives $\\mathcal {O}(|\\varphi |+ n^4)$.□ Proposition 9. $\\mathsf {JVV}$-$\\mathcal {B}$ makes $\\mathcal {O}(n^4\\log n + n^3\\log n\\log \\varepsilon ^{-1})$ SAT queries. The size of the queries is $\\mathcal {O}(|\\varphi |+n^3)$. Proof. Likewise, we substitute θ and δ by their value. The only difference is that the probabilistic approximate counter now makes $\\mathcal {O}(\\theta ^{-2}\\log n \\log \\delta ^{-1})$ SAT queries. We get that one call to ApproxCount in the JVV algorithm makes $\\mathcal {O}(n^2\\log (n)\\log ((2n+1)2^{n+2}\\varepsilon ^{-1}))$ $=\\mathcal {O}(n^2\\log n(\\log n + (n+2) + \\log (\\varepsilon ^{-1}))=\\mathcal {O}(n^3\\log n + n^2\\log n \\log (\\varepsilon ^{-1}))$ calls to a SAT oracle. As JVV makes $\\mathcal {O}(n)$ calls to ApproxCount, the total number of queries is $\\mathcal {O}(n^4\\log n + n^3\\log n \\log (\\varepsilon ^{-1}))$. The size of the queries is $\\mathcal {O}(|\\varphi |+ \\frac{n}{\\theta ^2})$, substituing with θ = 1/n immediatly gives $\\mathcal {O}(|\\varphi |+ n^3)$.□ Table 3: Experimental Results. Benchmark Variables Clauses JVV (ɛ = 0.3) $\\mathsf {UniGen4}$ (ɛ = 0.3) time (sec/sample) success rate time (sec/sample) success rate s27_new_3_2 17 31 0.38 0.372 0.02 1.00 s27_new_7_4 17 35 0.38 0.372 0.02 1.00 4step 165 418 timeout - 1.03 0.21 s420_15_7 366 994 timeout - 1.56 0.29 GuidanceService2.sk 715 2181 timeout - 1.00 0.23 min-6s 839 2762 timeout - 34.18 0.20 GuidanceService.sk 988 3088 timeout - 1.06 0.29 prod-2s 1113 4974 timeout - 6.91 0.19 90-16-2-q 1216 1920 timeout - 3254.91 0.31 UserServiceImpl.sk 1509 5009 timeout - 0.72 0.29 PhaseService.sk 1686 5655 timeout - 1.39 0.21 ProjectService3.sk 3175 11019 timeout - 6.90 0.19 blasted_case104 3666 11589 timeout - 319.88 0.32 blasted_squaring41 4185 13599 timeout - 3348.58 0.55 ProcessBean.sk 4768 14458 timeout - 5.87 0.23 doublyLinkedList.sk 6890 26918 timeout - 6.28 0.20 01B-1 9159 39959 timeout - 345.59 0.29 107.sk_3_90 8948 40147 timeout - 7.51 0.32 LoginService.sk 8200 26689 timeout - 7.13 0.19 sort.sk_8_52 12125 49611 timeout - 11.46 0.20 enqueueSeqSK.sk 16466 58515 timeout - 29.71 0.21 compress.sk 44901 166948 timeout - 123.19 0.19 hash-4 188361 755882 timeout - 315.34 0.29 Proposition 10. $\\mathsf {UniGen4}$-$\\mathcal {A}$ makes $\\mathcal {O}(\\varepsilon ^{-1} + \\log n \\log \\varepsilon ^{-1})$ SAT queries. The size of the queries is $\\mathcal {O}(|\\varphi |+n^2 + n\\varepsilon ^{-1})$. Proof. UniSamp makes only one call to the probabilistic approximate counter with $\\theta =\\sqrt 2-1$ and δ ≤ ɛ/4. Substituing these values, we makes $\\mathcal {O}(\\log n \\log \\varepsilon ^{-1})$ calls to a SAT oracle to get an approximate count. Then, we need to add the calls made by BSAT. BSAT makes at most $\\mathsf {thresh}$ calls by design. As $\\mathsf {thresh}=\\mathcal {O}(pivot)$ and $pivot=\\mathcal {O}(\\varepsilon ^{-1})$, BSAT makes $\\mathcal {O}(\\varepsilon ^{-1})$ additionnals calls to the SAT oracle. Adding the calls of BSAT to the ones of ApproxCount, we get $\\mathcal {O}(\\varepsilon ^{-1}+\\log n \\log \\varepsilon ^{-1})$ As θ is constant, the size of the queries made by ApproxCount is $\\mathcal {O}(|\\varphi |+ n^2)$. For BSAT, we add a blocking clause for each witness already found. As each clause contain at most n variables and that we can find at most $\\mathsf {thresh}=\\mathcal {O}(\\varepsilon ^{-1})$ witness, the size of the queries made by BSAT is $\\mathcal {O}(|\\varphi | + n\\varepsilon ^{-1})$. All in all, the queries size is $\\mathcal {O}(|\\varphi |+n^2+n\\varepsilon ^{-1})$.□ Proposition 11. $\\mathsf {UniGen4}$-$\\mathcal {B}$ makes $\\mathcal {O}(\\varepsilon ^{-1} + \\log n \\log \\varepsilon ^{-1})$ SAT queries. The size of the queries is $\\mathcal {O}(|\\varphi |+n^2 + n\\varepsilon ^{-1})$. Proof. As θ is constant, the number of calls to the oracle made by ApproxCount and the size of the queries do not change. As the only difference between UniSamp-$\\mathcal {A}$ and UniSamp-$\\mathcal {B}$ is the implementation of ApproxCount, both algorihtms have the same complexity in term of number and size of queries.□\n\n7 EXPERIMENTAL RESULTS Since uniform sampling has widespread applications, we are interested in measuring the impact of our algorithmic framework. Given the lack of scalability of JVV, the practical implementations have to rely on algorithms without formal guarantees . Therefore, we seek to understand if our scheme can lead to practically scalable tools. To this end, we conducted a comprehensive performance evaluation of counting algorithms involving 562 benchmarks arising from wide range of application areas including probabilistic reasoning, plan recognition, DQMR networks, ISCAS89 combinatorial circuits, quantified information flow, program synthesis, functional synthesis, logistics [20]. We employ $\\mathsf {CryptoMiniSAT}$ [19] as the underlying SAT solver given its native support for CNF-XOR formulas, i.e., formulas expressed as conjunction of CNF and XOR clauses. Our empirical analysis employs ApproxMC, which is a variant of model counter $\\mathcal {A}$. The experiments were conducted on a high performance computer cluster, with each node consisting of an E5-2690 v3 CPU with 24 cores and 96GB of RAM such that each core's access was restricted to 4GB. The computational effort for the evaluation consisted of over 20,000 hours. We used timeout of 3600 (i.e., 1 hour) seconds for each experiment, which consisted of running a tool on a particular benchmark. Since the algorithms are randomized, for an accurate measurement, we run each algorithm 100 times for every benchmark and compute the average time per sample generation and the observed success probability. The success probability is computed as the number of runs where a sample was returned divided by the total number of runs (i.e., 100). The average time per sample generation is computed as the total time taken across 100 runs divided by the number of runs that generated samples while the observed success probability is computed as the fraction of runs that output a sample (i.e, the output is not ⊥). We present the results on a subset of benchmarks in Table 3. The first column states the name of the benchmark, while the second and third columns state the number of variables and clauses corresponding to the benchmark. The fourth and fifth columns state the time taken per sample generation and the observed success probability for $\\mathsf {JVV}$ while the sixth and seventh columns present the corresponding data for $\\mathsf {UniGen4}$. For lack of space, we present results on a subset of the benchmarks. Table 3 clearly shows that while JVV times out on all except two instances, $\\mathsf {UniGen4}$ is able to generate samples within reasonable time. Furthermore, observe that in practice, the success rate is significantly higher than our theoretical guarantees, thereby suggesting the potential for tighter analysis. Across all the benchmarks, JVV timed out on 544 out of 562 instances while $\\mathsf {UniGen4}$ did not time on any of the 562 instances.\n\n8 CONCLUSION Uniform sampling is a fundamental problem with wide range of applications. The prior state of the art techniques, however, required $\\mathcal {O}(n^2 \\log n + \\log n \\log \\varepsilon ^{-1})$ calls to $\\mathsf {SAT}$ oracle while using 2-wise independence. In this work, we propose a new algorithm that makes only $\\mathcal {O}(\\varepsilon ^{-1}+\\log n \\log \\varepsilon ^{-1})$ calls to $\\mathsf {SAT}$ oracle. The improvement in theory also leads to the development of the first almost-uniform sampling tool with rigorous guarantees and our empirical comparisons clearly demonstrate that $\\mathsf {UniGen4}$ is able to handle instances that were beyond the ability of JVV."}, {"url": "https://www.theguardian.com/politics/2009/sep/11/tom-wise-false-accounting-charge", "page_content": "A former British MEP today denied charges of false accounting and using criminal property.\n\nTom Wise, 61 – who used to represent Ukip but became an independent – was charged along with his 62-year-old former researcher Linday Jenkins.\n\nThe pair appeared at a 15-minute plea and case management hearing at Southwark crown court, in London, and spoke only to confirm their names and deny the charges.\n\nThe first alleges that they \"falsified a document, namely a contract for the provision of services and an application for secretarial assistance allowance and invoices\" between 14 December 2004 and 14 December 2005.\n\nThe second count claims that, during the same period, they received money \"from the European parliament intended for use as payments for secretarial services\".\n\nWise, of Leighton Buzzard, Bedfordshire, who has been an MEP for the East of England since 2004, and Jenkins, of west Kensington, west London, will return to court next Friday.\n\nA further directions hearing will then be held and a trial date fixed. They remain on bail."}]}