{"In 1887, Frederick Thomas Brentnall set up his own practice in Birmingham.": [{"url": "https://lemelson.mit.edu/resources/frank-sprague", "page_content": "Urban development got a major boost in 1887 when inventor Frank Julian Sprague developed the world’s first successful electric street railway system, making it feasible to build cities and towns that were more vast in size and allowing for a greater concentration of businesses in commercial areas.\n\nBorn in Milford, Conn., on July 25, 1857, Sprague showed early talent in mathematics and was admitted to the United States Naval Academy in Annapolis, Maryland, from where he graduated in 1878. He served several tours as an officer on the USS Richmond, USS Minnesota and USS Lancaster, where he spent much of his time filling notebooks with mechanical drawings of devices for telecommunications and transport.\n\nIn 1881, Sprague attended the Paris Electrical Exhibition and the Crystal Palace Exhibition in Sydenham, England, where he served as secretary of the jury of awards for gas engines, lamps and dynamos. He began to develop somewhat of a reputation for ingenuity among those in industry, and in 1883, he left the Navy to accept an invitation to work as a technical assistant to Thomas Edison.\n\nWhile working for Edison he developed an electric motor that could be adapted for use with industrial machinery. He also helped with the installation of Edison’s groundbreaking three-wire electrical light systems and made refinements to the inventor’s power distribution system. He introduced to Edison’s firm the idea of using mathematical formulas rather than trial-and-error experimentation to develop concepts, which helped the company to reel in its R&D expenditures.\n\nAfter just one year, however, Sprague realized that his interests lied with power and transport, rather than with lighting systems. So, in 1884, he left Edison’s firm to set up his own business, the Sprague Electric Railway & Motor Company, in New York City. He began working on electrical energy and wheel suspension systems with the aim of creating an electric street railway. Commercial success with his various electric motors provided him the capital he needed to take on this task.\n\nPrior to 1850, horse-drawn vehicles were the primary method for transport in cities. Later it was realized that by setting these vehicles on rails, horses could pull a greater load more quickly. Many cities, therefore, had built rails in the streets, and some also used cable cars. With the advent of electricity, dozens of attempts in the United States and in Europe were made to prove the feasibility of an electricity-powered service, with varying degrees of success.\n\nSprague was able to conquer a number of challenges with a comprehensive system that incorporated several designs he invented himself, including improved electrical energy systems, wheel suspension, automatic controls, automatic brakes and a non-sparking motor that could maintain constant revolutions with varying loads. In 1887, Sprague began the installation of a 12-mile electric rail system in Richmond, VA, for the Richmond Union Passenger Railway. This was to be the first large-scale electric trolley line in the world. It opened with great fanfare on Feb. 2, 1888.\n\nThe system’s success proved the efficiency, safety and financial viability of an electric-powered street rail service, and within a decade, horse-powered rail and cable car vehicles were all but obsolete. The city of Boston ordered the world’s second electric rail system after evaluating Sprague’s Richmond installation, and others followed around the world, with 20,000 miles of streetcar tracks laid in the United States alone by 1905. His system served as the basis for a variety of systems later built by competitors such as Thomas-Houston, General Electric and Westinghouse.\n\nIn 1890, Sprague sold his company to the Edison General Electric Company. In 1892, he formed a new venture, this time to work on vertical transport, in the form of electric elevators. Via the Sprague Electric Elevator Company, Sprague and associate Charles Pratt invented the Sprague-Pratt Electric Elevator, which employed Sprague’s all-important method of returning power to main supply systems. The elevator had the ability to carry heavier loads and move more quickly than hydraulic or steam elevators. He sold nearly 600 elevators for buildings around the world before selling the firm to the Otis Elevator Company in 1895.\n\nThat year, he began working on a multiple-unit system for electric railway operation, which greatly contributed to the development of electric traction. He also designed a safety system for automatic train control via yet another new enterprise, the Sprague Safety Control & Signal Corporation; from 1896 to 1900 he served on the Commission for Terminal Electrification of the New York Central Railroad. Later, in the 1920s, he returned to the elevator-building arena, designing a dual-elevator system that allowed for the operation of two elevators in a single shaft. He sold this to the Westinghouse Company.\n\nSprague is said to have continued innovating up until his death on October 25, 1934, at the age of 77. His numerous honors and awards include the 1889 gold medal at the Paris Electrical Exhibition, the grand prize at the St. Louis Exhibition in 1904, the 1910 Edison Medal of the American Institute of Electrical Engineers, and the Elliott-Cresson Medal awarded by the Franklin Institute in 1904. He was also the recipient of the Franklin Medal in 1921, and was awarded the John Fritz Gold Medal posthumously in1935. He is buried in Arlington National Cemetery in Washington, D.C."}, {"url": "https://www.prepressure.com/printing/history/1850-1899", "page_content": "During the second half of the nineteenth century, the invention of the Linotype solves a major problem of the printing industry. Due to the ever-increasing speed of presses, typesetting had become a major bottleneck in the production process. The Linotype solved this problem for newspapers while book printers relied on hot metal typesetters from Monotype and others.\n\n\n\nDuring this era many magazines that are still in existence today are brought to market, including ‘Scientific American’ (1845, originally a 4-page weekly), ‘Harper’s Magazine’ (1850), ‘National Geographic’ (1888) and ‘Vogue’ (1892).\n\nCountries start implementing free and compulsory education, which broadens the group of people that can read and hence might be interested in printed matter.\n\n1851 – The New-York Daily Times\n\nThe first issue is published of what will later become The New York Times.\n\n1856 – Full-page ads\n\nRobert E Bonner runs the first full-page ad in a newspaper. It promotes the New York Ledger, his own literary paper.\n\n1858 – Gordon Jobber\n\nBased on an earlier design by Stephen P. Ruggles, George Phineas Gordon produces the Franklin press, which is also known as the Gordon Jobber. The press uses a foot pedal to press the surface holding the paper against the flat inked printing plate. Only a single operator is needed, making this a perfect press for small print shops. Once the patents on this design expired other companies build presses based on Gordon’s design, such as the Chandler & Price letterpress below. Until the early 1900s, these were the workhorses in many print shops and some remain in use even today.\n\nThe round disk distributes ink\n\n1860 – Photozincography\n\nA reproduction of the Domesday Book is the first publication that is printed using photozincography, a lithographic printing technique that uses zinc plates instead of stones. These plates are easier to move than lithographic stones and can handle larger print runs. They are the precursor to today’s aluminum offset printing plates. Photozincography is developed by the team of Henry James of the British Ordnance Survey. The picture below shows them in front of the photography building.\n\n1864 – RR Donnelley is founded\n\nR.R. Donnelley & Sons Company is founded in Lancaster, Pennsylvania. It becomes one of the largest custom map-making companies in the United States and gradually expands into other markets. Nowadays it is a Fortune 500 company that is still heavily print-oriented, next to offering global marketing and business communication services.\n\n1865 – Faster web presses\n\nWilliam Bullock perfects Hoe’s rotary press. His press doesn’t print on sheets but is fed by a roll of paper that is printed on both sides. The press then folds the paper and cuts sheets at a speed of up to 12,000 sheets an hour. Bullock dies during an operation to amputate his leg that accidentally got crushed in one of his presses.\n\n1867 – Agfa is founded\n\nAgfa, the Aktiengesellschaft fur Anilinfabrikation, is founded in Rummelsburg, Germany. Originally the company focusses on producing color dyes but it will gradually become one of the leading manufacturers of film, printing plates, and large-format printers.\n\n1874 – Production of corrugated board\n\nMass production of corrugated board starts. It is initially used to package bottles and glass lantern chimneys.\n\nThe image below dates from that same year. It shows lithographic printing and is printed by Prang and Mayer from Boston who specialized in architectural and educational prints as well as greeting cards.\n\nPrang’s aids for object teaching – Source: American Antiquarian\n\n1875 – Printing on tin\n\nIn England, Robert Barclay patents the first rotary offset lithographic printing press for printing on tin. As the name offset implies, in this press the tin substrate does not come into direct contact with the printing cylinder. In between is an offset cylinder covered with specially treated cardboard that transfers the printed image to the recipient. Cardboard later gets replaced by rubber, which is still the most commonly used material today.\n\n1876 – Duplicating documents with the Mimeograph\n\nThomas Edison receives a patent for a printing mechanism that around 1890 will result in the mimeograph or stencil duplicator. The Mimeo name is a trademark of Albert Blake Dick who licenses Edison’s patents. European manufacturers such as Gestetner develop similar machines. They allow anyone to inexpensively print dozens or hundreds of copies of a typed page. These small duplicators remain popular until photocopying becomes affordable.\n\nWilhelm Koenig designs the first KBA web-fed rotary press. It is installed at the Magdeburgische Zeitung. By 1895 the company delivers its 5000th cylinder press.\n\nGolding & Co. introduces the Pearl letterpress, a small printing press that is available in two sizes. It has no throw-off or depressible grippers and two ink rollers. The press sells well but many commercial printers only consider it suitable for ‘bedroom printers’.\n\n1877 – Creative advertising agencies\n\nThe J. Walter Thompson Company is the first advertising agency to have its own creative department staffed with copywriters and artists. It is also the first American agency to expand internationally with the opening of J. Walter Thompson London in 1899. Its founder James Walter Thompson is credited as the ‘father of modern magazine advertising.’ In 2018 the agency merged with digital agency Wunderman to form Wunderman Thompson.\n\n1878 – Invention of photogravure\n\nThe Czech painter Karel Klíč invents photogravure, a process to faithfully reproduce the detail and continuous tones of photographs. To do so a copper plate is coated with a light-sensitive gelatin tissue that has been exposed to a film positive. The plate is then etched so that when ink is applied to the plate and wiped off, some ink will remain in the etched grooves and can then be transferred to paper.\n\nA less successful invention from that same year is the Paige Compositor, one of the earliest attempts to build a typesetting machine. Using it a skilled operator can set text six times faster than by hand. Unfortunately, the machine is so complex that its reliability suffers. American author Mark Twain is one of the financial backers of James W. Paige’s project.\n\n1883 – First practical use of halftone screening\n\nAround 1850 William Fox Talbot had come up with the idea of halftone printing – reproducing the gray levels in a photograph using dots that vary either in size or in spacing. Various people worked on this concept, with the first screened photograph appearing in the New York Daily Graphic in 1873. The first one to develop a commercially successful way of reproducing pictures with relief halftones is the German Georg Meisenbach. He uses a glass plate with a fine pattern of lines during the exposure of a photograph to create a screened photograph. In 1883 the ‘Leipziger Wochenzeitschrift’ magazine is the first to print a black and white photo processed using this technique.\n\nThat same year T. & R. Annan in Glasgow is the first photogravure in Britain.\n\nA printer in Wyoming runs out of white paper and prints a telephone directory on yellow paper instead. The concept is picked up by others and in 1886 Reuben H. Donnelley creates the first official Yellow Pages directory.\n\nDuring this decade the McLoughlin Brothers publish The Little Folks’ Painting Book, the first-ever coloring book. The drawings are made by Kate Greenaway.\n\n1884 – Mechanical sewing machines\n\nHugo Brehmer develops the first mechanical thread-based sewing machine for bookbinding. The image below shows a sewing machine from a few years later.\n\n1885 – Automating punch cutting\n\nLinn Boyd Benton invents the pantographic punch cutter. With this machine, an operator can trace the brass pattern of a letter with one arm of the device. A cutting tool is mounted on another arm and it engraves the letter on the punch in a reduced size. The punch cutter can be adjusted to cut a complete series of sizes from one set of patterns. Those letters have a more uniform shape than the type that previously always had to be carved manually. The punch-cutting machine makes the mass-production of punches possible and it paves the way for the Linotype and other composing machines.\n\nFrederick and Samuel Goss found the Goss Printing Press Company in Chicago, with the financial backing of Jacob Walser. Their first product is the Clipper, a press that can print double-sided by reversing one of its cylinders. After a few difficult years the Straightline Newspaper Perfecting Press, which debuts in 1892, firmly establishes the company as a leading manufacturer of newspaper presses. Newspaper were four-page weeklies at the beginning of the century but by this time they have become sixteen-page dailies.\n\n1886 – Invention of the Linotype\n\nOttmar Mergenthaler invents the Linotype composing machine. With this typesetter, an operator can enter text using a 90-character keyboard. From a stock of letter form molds, the machine assembles a line containing the typed text. Molten lead is then poured over this line to create a slug, a line of metal type. Once the operation is finished the matrices are returned to the type magazine from which they came. The machines are built in New York by the Mergenthaler Linotype Co. The name ‘line-o’-type’ is a pretty good description of what the machine does. It is widely regarded as one of the greatest advances in printing since the development of movable type 400 years earlier. With a Linotype a compositor can output at least 6000 characters per hour, three times more than working by hand.\n\nAround that same time the Swiss company Orell Gessner Füssli patents the ‘Aac process’ that is used to create photochroms, also called photochrome prints. In this process, colorized images are produced from black and white photographic negatives via the direct photographic transfer of a negative onto a lithographic stone. Six to fifteen tint stones, each bearing an appropriate retouched image, are used to create the color print. The photochrom technique is very popular in the 1890s and mainly used for printing postcards of city scapes.\n\nPhotochrome depicting the Groenerei in Bruges, Belgium\n\nLothar Meggendorfer’s International Circus is a pop-up book that contains six pop-up scenes of circus acts, including acrobats, clowns, and daredevil riders. Unfolded they form a circus complete with orchestra and spectators. It is not the first pop-up book to be published but thanks to reproductions, such as the 1979 version shown below, it is still available today.\n\n1890 – First flexo press\n\nBibby, Baron, and Sons build the first flexographic press. This type of press uses the relief on a rubber printing plate to hold the image that needs to be printed. Because the ink that is used in that first flexo press smears easily, the device becomes known as Bibby’s Folly. Later improvements in the technology do make flexography one of the most used industrial printing processes.\n\nThat same year Robert Gair accidentally invents the pre-cut cardboard box.\n\nAround this time the Miehle Printing Press & Manufacturing Co. is founded by Robert Miehle. The company builds flat-bed cylinder presses and from 1921 onward will also produce a series of popular vertical cylinder presses.\n\n1892 – Eastman Kodak Company is founded\n\nGeorge Eastman changes the name of his company to Eastman Kodak Company, which later becomes Kodak.\n\nThat same year the first issue of Vogue, the American fashion and lifestyle magazine, is published. It begins as a weekly newspaper but in later years becomes a monthly publication.\n\n1893 – Addressograph\n\nAddressograph International starts manufacturing the Addressograph, a machine that allows business to quickly print a series of addresses on envelopes, invoices, quotes or other documents. The system uses a chain with rubber stamps that are inked and then pressed on the substrate. The model shown below dates from 1896.\n\nThat same year the first Sears, Roebuck and Co. catalog is published. The image below is from the 1895 edition when bicycles were added. The first color section appears in 1897, to show off shoes in black, brown, and red. The first specialty catalog for automobiles dates back to 1913 and the first Christmas catalog follows in 1933. The ‘Big Book’ catalog is discontinued in 1993 when the Specialty Catalog Group is formed.\n\nAlso popular during the second half of the nineteenth century is the Railway Library. The novels in this series use a cheap straw pulp cover, allowing publisher George Routledge to make the books very affordable.\n\n1894 – First European Linotypes\n\nDe Nederlandsche Financier in Amsterdam, Holland is the first newspaper on the European continent to start using a Linotype. Two years later the Mergenthaler Setzmaschinenfabrik is founded in Berlin to cater for the European market.\n\nDeutscher Buch- und Steindrucker is published for the first time. It is the precursor to ‘Deutscher Drucker’, still the leading German trade magazine.\n\n1895 – Harris presses & D. Stempel AG foundry\n\nCharles and Alfred Harris found the Harris Automatic Press Company to market the first printing press with an automatic sheet feeder. The press is nearly ten times faster than handfed presses and the brothers have to understate its capabilities in order to get prospects to believe them. The company will produce many innovative presses before moving into the semiconductor business and selling off its printing division in 1983.\n\nDavid Stempel founds the D. Stempel AG typographic foundry in Frankfurt am Main, Germany. It will employ important font designers like Rudolf Wolf and Hermann Zapf and is among the select foundries that produce matrices for the Linotype machine.\n\nD. Stempel factory in 1913\n\n‘Yellow Kid’ by Richard Outcault is the first comic strip to use text balloons.\n\n\n\n1896 – Lanston Monotype Machine Company\n\nThe Lanston Monotype Machine Company, founded by Tolbert Lanston in Washington D.C. in 1887, builds its first hot metal typesetting machine. In contrast to the Linotype which casts complete lines of type, the Monotype machine forms individual letters. That makes it easier to correct spelling mistakes by adding or removing an individual letter. This is an advantage for less time-critical work, such as typesetting books. The Monotype system consists of two components: the keyboard and the composition caster. Text entered using the keyboard is output on paper tape which can be fed into the caster which output slugs of metal type. Such a configuration allows multiple operators to typeset text that will be output on a single caster.\n\nIn 1896 Monotype issues its first typeface, Modern Condensed.\n\n1898 – First car ad\n\nThe July issue of Scientific American includes an advertisement for the Winton Motor Carriage. This is generally considered to be the first ad for an automobile.\n\n< 1800-1849 – 1900-1949 >"}, {"url": "https://artblart.com/tag/thomas-frederick-goodall-setting-the-bow-net/", "page_content": "Exhibition dates: 11th May – 25th September 2016\n\nCurators: Dr Carol Jacobi, Curator of British Art 1850-1915 at Tate Britain, and Dr Hope Kingsley, Curator, Education and Collections, Wilson Centre for Photography, with Tim Batchelor, Assistant Curator at Tate Britain\n\nPeter Henry Emerson (British, 1856-1936)\n\nHaymaker with Rake\n\nc. 1888, published 1890\n\nFrom Pictures of East Anglian Life portfolio\n\nPhotogravure on paperImage: 277 x 196mm\n\nVictoria and Albert Museum\n\nGift from the photographer\n\nAn interesting concept for an exhibition. I would have liked to have seen the exhibition to make a more informed comment. Parallels can be drawn, but how much import you put on the connection is up to you vis-à-vis the aesthetic feeling and formal construction of each medium. It is fascinating to note how many of the original art works are photographs with the painting following at a later date, or vice versa. Photographically, Julia Margaret Cameron and John Cimon Warburg are the stars.\n\nPhotographs have always been used by artists as aide-mémoire since the birth of photograph. Eugené Atget called his photographs of Paris “Documents pour artistes”, declaring his modest ambition to create images for other artists to use as source material … but I take that statement with a pinch of salt. Perhaps a salt print from a calotype paper negative!\n\nDr Marcus Bunyan\n\n.\n\nMany thankx to the Tate for allowing me to publish the art work and photographs in the posting. Please click on the photographs for a larger version of the image.\n\nTate Britain presents the first major exhibition to celebrate the spirited conversation between early photography and British art. It brings together photographs and paintings including Pre-Raphaelite, Aesthetic and British impressionist works. Spanning 75 years across the Victorian and Edwardian ages, the exhibition opens with the experimental beginnings of photography in dialogue with painters such as J.M.W. Turner and concludes with its flowering as an independent international art form.\n\nStunning works by John Everett Millais, Dante Gabriel Rossetti, JAM Whistler, John Singer Sargent and others will for the first time be shown alongside ravishing photographs by pivotal early photographers such as Julia Margaret Cameron, which they inspired and which inspired them.\n\nJohn Everett Millais (English, 1829-1896)\n\nThe Woodman’s Daughter\n\n1850-51\n\nOil paint on canvas\n\n889 x 648mm\n\nGuildhall Art Gallery, City of London\n\nMinna Keene (Canadian born Germany, 1861-1943)\n\nDecorative Study\n\nc. 1906\n\n© Royal Photographic Society / National Media Museum/ Science & Society Picture Library\n\nDante Gabriel Rossetti (English, 1828-1882)\n\nProserpine\n\n1874\n\nOil on canvas\n\nSupport: 1251 x 610mm\n\nFrame: 1605 x 930 x 85mm\n\nPresented by W. Graham Robertson 1940\n\nZaida Ben-Yusuf (American born England, 1869-1933)\n\nThe Odor of Pomegranates\n\n1899, published 1901\n\nPhotogravure on paper\n\nTate\n\nZaida Ben-Yusuf (21 November 1869 – 27 September 1933) was a New York-based portrait photographer noted for her artistic portraits of wealthy, fashionable, and famous Americans of the turn of the 19th-20th century. She was born in London to a German mother and an Algerian father, but became a naturalised American citizen later in life. In 1901 the Ladies Home Journal featured her in a group of six photographers that it dubbed, “The Foremost Women Photographers in America.” In 2008, the Smithsonian National Portrait Gallery mounted an exhibition dedicated solely to Ben-Yusuf’s work, re-establishing her as a key figure in the early development of fine art photography…\n\nIn 1896, Ben-Yusuf began to be known as a photographer. In April 1896, two of her pictures were reproduced in The Cosmopolitan Magazine, and another study was exhibited in London as part of an exhibition put on by The Linked Ring. She travelled to Europe later that year, where she met with George Davison, one of the co-founders of The Linked Ring, who encouraged her to continue her photography. She exhibited at their annual exhibitions until 1902.\n\nIn the spring of 1897, Ben-Yusuf opened her portrait photography studio at 124 Fifth Avenue, New York. On 7 November 1897, the New York Daily Tribune ran an article on Ben-Yusuf’s studio and her work creating advertising posters, which was followed by another profile in Frank Leslie’s Weekly on 30 December. Through 1898, she became increasingly visible as a photographer, with ten of her works in the National Academy of Design-hosted 67th Annual Fair of the American Institute, where her portrait of actress Virginia Earle won her third place in the Portraits and Groups class. During November 1898, Ben-Yusuf and Frances Benjamin Johnston held a two-woman show of their work at the Camera Club of New York.\n\nIn 1899, Ben-Yusuf met with F. Holland Day in Boston, and was photographed by him. She relocated her studio to 578 Fifth Avenue, and exhibited in a number of exhibitions, including the second Philadelphia Photographic Salon. She was also profiled in a number of publications, including an article on female photographers in The American Amateur Photographer, and a long piece in The Photographic Times in which Sadakichi Hartmann described her as an “interesting exponent of portrait photography”.\n\n1900 saw Ben-Yusuf and Johnston assemble an exhibition on American women photographers for the Universal Exposition in Paris. Ben-Yusuf had five portraits in the exhibition, which travelled to Saint Petersburg, Moscow, and Washington, D.C. She was also exhibited in Holland Day’s exhibition, The New School of American Photography, for the Royal Photographic Society in London, and had four photographs selected by Alfred Stieglitz for the Glasgow International Exhibition of 1901, Scotland.\n\nIn 1901, Ben-Yusuf wrote an article, “Celebrities Under the Camera”, for the Sunday Evening Post, where she described her experiences with her sitters. By this stage she had photographed Grover Cleveland, Franklin Roosevelt, and Leonard Wood, amongst others. For the September issue of Metropolitan Magazine she wrote another article, “The New Photography – What It Has Done and Is Doing for Modern Portraiture”, where she described her work as being more artistic than most commercial photographers, but less radical than some of the better-known art photographers. The Ladies Home Journal that November declared her to be one of the “foremost women photographers in America”, as she began the first of a series of six illustrated articles on “Advanced Photography for Amateurs” in the Saturday Evening Post.\n\nBen-Yusuf was listed as a member of the first American Photographic Salon when it opened in December 1904, although her participation in exhibitions was beginning to drop off. In 1906, she showed one portrait in the third annual exhibition of photographs at Worcester Art Museum, Massachusetts, the last known exhibition of her work in her lifetime.\n\nText from the Wikipedia website\n\nIn the Studio\n\nMany photographers trained as painters. They set up studios and employed artists’ models, skilled at holding poses for the time it took to take a picture. Later in the century, improved photographic negatives required shorter exposure times and it became easier to stage and capture difficult positions and spontaneous gestures.\n\nPainters and illustrators used photographs as preparatory studies and as substitutes for props, costumes and models, and art schools created photographic archives for their students. Photographs commissioned and sold by institutions such as the British Museum made classical sculpture and old master paintings more accessible, inspiring both painters and photographers.\n\nHenry Wallis (British, 1830-1916)\n\nChatterton\n\n1856\n\nOil paint on canvas\n\nSupport: 622 x 933mm\n\nFrame: 905 x 1205 x 132mm\n\nTate\n\nBequeathed by Charles Gent Clement 1899\n\nChatterton is Wallis’s earliest and most famous work. The picture created a sensation when it was first exhibited at the Royal Academy in 1856, accompanied by the following quotation from Marlowe:\n\nCut is the branch that might have grown full straight\n\nAnd burned is Apollo’s laurel bough.\n\n.\n\nRuskin described the work in his Academy Notes as ‘faultless and wonderful’.\n\nThomas Chatterton (1752-1770) was an 18th Century poet, a Romantic figure whose melancholy temperament and early suicide captured the imagination of numerous artists and writers. He is best known for a collection of poems, written in the name of Thomas Rowley, a 15th Century monk, which he copied onto parchment and passed off as mediaeval manuscripts. Having abandoned his first job working in a scrivener’s office he struggled to earn a living as a poet. In June 1770 he moved to an attic room at 39 Brooke Street, where he lived on the verge of starvation until, in August of that year, at the age of only seventeen, he poisoned himself with arsenic. Condemned in his lifetime as a forger by influential figures such as the writer Horace Walpole (1717-1797), he was later elevated to the status of tragic hero by the French poet Alfred de Vigny (1797-1863).\n\nWallis may have intended the picture as a criticism of society’s treatment of artists, since his next picture of note, The Stonebreaker (1858, Birmingham City Museum and Art Gallery), is one of the most forceful examples of social realism in Pre-Raphaelite art. The painting alludes to the idea of the artist as a martyr of society through the Christ-like pose and the torn sheets of poetry on the floor. The pale light of dawn shines through the casement window, illuminating the poet’s serene features and livid flesh. The harsh lighting, vibrant colours and lifeless hand and arm increase the emotional impact of the scene. A phial of poison on the floor indicates the method of suicide. Following the Pre-Raphaelite credo of truth to nature, Wallis has attempted to recreate the same attic room in Gray’s Inn where Chatterton had killed himself. The model for the figure was the novelist George Meredith (1828-1909), then aged about 28. Two years later Wallis eloped with Meredith’s wife, a daughter of the novelist Thomas Love Peacock (1785-1866).\n\nFrances Fowle. “Chatterton,” on the Tate website December 2000 [Online] Cited 16/02/2023\n\nJames Robinson\n\nThe Death of Chatterton\n\n1859\n\nTwo photographs, hand-tinted albumen prints on paper mounted on card\n\nCollection Dr Brian May\n\nJames Robinson\n\nThe Death of Chatterton (detail)\n\n1859\n\nTwo photographs, hand-tinted albumen prints on paper mounted on card\n\nCollection Dr Brian May\n\nTHIS STEREOCARD IS NOT IN THE EXHIBITION\n\nOne of the most famous paintings of Victorian times was Chatterton, 1856 (Tate) by the young Pre-Raphaelite-style artist, Henry Wallis (1830-1916). Again, the tale of the suicide of the poor poet, Thomas Chatterton, exposed as a fraud for faking medieval histories and poems to get by, had broad appeal. Chatterton was also an 18th-century figure, but Wallis set his picture in a bare attic overlooking the City of London which evoked the urban poverty of his own age. The picture toured the British Isles and hundreds of thousands flocked to pay a shilling to view it. One of these was James Robinson, who saw the painting when it was in Dublin. He immediately conceived a stereographic series of Chatterton’s life. Unfortunately Robinson started with Wallis’s scene (The Death of Chatterton, 1859). Within days of its publication, legal procedures began, claiming his picture threatened the income of the printmaker who had the lucrative copyright to publish engravings of the painting. The ensuing court battles were the first notorious copyright cases. Robinson lost, but strangely, in 1861, Birmingham photographer Michael Burr published variations of Death of Chatterton with no problems. No other photographer was ever prosecuted for staging a stereoscopic picture after a painting and the market continued to thrive…\n\nRobinson’s The Death of Chatterton illustrates the way this uncanny quality [the ability to record reality in detail] distinguishes the stereograph from even the immaculate Pre-Raphaelite style of Wallis’s painting of the same subject. The stereograph represented a young man in 18th-century costume on a bed. The backdrop was painted, but the chest, discarded coat and candle were real. Again, the light and colour appear crude in comparison with the painting but the stereoscope records ‘every stick, straw, scratch’ in a manner that the painting cannot. The torn paper pieces, animated by their three-dimensionality, trace the poet’s recent agitation, while the candle smoke, representing his extinguished life, is different in each photograph due to their being taken at separate moments. The haphazard creases of the bed sheet are more suggestive of restless movement, now stilled, than Wallis’s elegant drapery. Even the individuality of the boy adds potency to his death.\n\nExtract from the essay by Carol Jacobi. “Tate Painting and the Art of Stereoscopic Photography,” on the Tate website 17th October, 2014 [Online] Cited 14/02/2015\n\nDante Gabriel Rossetti (English, 1828-1882)\n\nBeata Beatrix\n\nc. 1864-1870\n\nOil on canvas\n\nSupport: 864 x 660mm\n\nFrame: 1212 x 1015 x 104mm\n\nPresented by Georgiana, Baroness Mount-Temple in memory of her husband, Francis, Baron Mount-Temple 1889\n\nRossetti draws a parallel in this picture between the Italian poet Dante’s despair at the death of his beloved Beatrice and his own grief at the death of his wife Elizabeth Siddal, who died on 11 February 1862. Dante Alighieri (1265-1321) recounted the story of his unrequited love and subsequent mourning for Beatrice Portinari in the Vita Nuova. This was Rossetti’s first English translation and appeared in 1864 as part of his own publication, The Early Italian Poets.\n\nThe picture is a portrait of Elizabeth Siddall in the character of Beatrice. It has a hazy, transcendental quality, giving the sensation of a dream or vision, and is filled with symbolic references. Rossetti intended to represent her, not at the moment of death, but transformed by a ‘sudden spiritual transfiguration’ (Rossetti, in a letter of 1873, quoted in Wilson, p.86). She is posed in an attitude of ecstasy, with her hands before her and her lips parted, as if she is about to receive Communion. According to Rossetti’s friend F.G. Stephens, the grey and green of her dress signify ‘the colours of hope and sorrow as well as of love and life’ (‘Beata Beatrix by Dante Gabriel Rossetti’, Portfolio, vol. 22, 1891, p. 46).\n\nIn the background of the picture the shadowy figure of Dante looks across at Love, portrayed as an angel and holding in her palm the flickering flame of Beatrice’s life. In the distance the Ponte Vecchio signifies the city of Florence, the setting for Dante’s story. Beatrice’s impending death is evoked by the dove – symbol of the holy spirit – which descends towards her, an opium poppy in its beak. This is also a reference to the death of Elizabeth Siddall, known affectionately by Rossetti as ‘The Dove’, and who took her own life with an overdose of laudanum. Both the dove and the figure of Love are red, the colour of passion, yet Rossetti envisaged the bird as a messenger, not of love, but of death. Beatrice’s death, which occurred at nine o’clock on 9th June 1290, is foreseen in the sundial which casts its shadow over the number nine. The picture frame, which was designed by Rossetti, has further references to death and mourning, including the date of Beatrice’s death and a phrase from Lamentations 1:1, quoted by Dante in the Vita Nuova: ‘Quomodo sedet sola civitas’ (‘how doth the city sit solitary’), referring to the mourning of Beatrice’s death throughout the city of Florence.\n\nFrances Fowle. “Beata Beatrix,” on the Tate website December 2000 [Online] Cited 16/02/2023\n\nJulia Margaret Cameron (British, 1815-1879)\n\nCall, I Follow, I Follow, Let Me Die!\n\n1867\n\n© Royal Photographic Society / National Media Museum / Science & Society Picture Library\n\nIn late 1865, Julia Margaret Cameron began using a larger camera. It held a 15 x 12 inch glass negative, rather than the 12 x 10 inch negative of her first camera. Early the next year she wrote to Henry Cole with great enthusiasm – but little modesty – about the new turn she had taken in her work. Cameron initiated a series of large-scale, closeup heads that fulfilled her photographic vision. She saw them as a rejection of ‘mere conventional topographic photography – map-making and skeleton rendering of feature and form’ in favour of a less precise but more emotionally penetrating form of portraiture. Cameron also continued to make narrative and allegorical tableaux, which were larger and bolder than her previous efforts.\n\nIn this image, Cameron concentrates upon the head of her maid Mary Hillier by using a darkened background and draping her in simple dark cloth. The lack of surrounding detail or context obscures references to narrative, identity or historical context. The flowing hair, lightly parted lips and exposed neck suggest sensuality. The title, taken from a line in the poem ‘Lancelot and Elaine’ from Alfred Tennyson’s ‘Idylls of the King’, transforms the subject into a tragic heroine.\n\nAnonymous. “Call, I Follow, I Follow, Let Me Die!,” on the V&A website [Online] Cited 16/02/2023\n\nNew truths\n\nMid-nineteenth century innovations in science and the arts became part of intense debates about ‘truth’ – variously defined as objective observation and as individual artistic vision. Inspired by artist and critic John Ruskin, the Pre-Raphaelite circle took a new approach to nature, discovering meaning in details previously overlooked, ‘rejecting nothing, selecting nothing’.\n\nAs the quality of paints and lenses improved, painters and photographers tested the bounds of perception and representation. They moved out of the studio, to explore light and other atmospheric effects as well as geological subjects, landscape and architecture. New photographic materials like glass plate negatives and coated printed papers offered greater accuracy and photography became a valuable aid for painters.\n\nJohn Brett (British, 1831-1902)\n\nGlacier of Rosenlaui\n\n1856\n\nOil on canvas\n\nHeight: 445 mm (17.52 in)\n\nWidth: 419 mm (16.5 in)\n\nTate Britain\n\nPurchased 1946\n\nPhoto: Tate, London, 2011\n\nThomas Ogle (British, 1813 – about 1882)\n\nThe Bowder Stone in Our English Lakes, Mountains and Waterfalls as seen by William Wordsworth by A.W. Bennett\n\nPublished 1864\n\nTate\n\nView taken by Thomas Ogle of the Bowder Stone in Borrowdale, Cumbria, illustrating Our English Lakes, Mountains, And Waterfalls, as seen by William Wordsworth (1864). The book juxtaposes photographs of the Lake District with poems by the English Romantic poet. The Bowder Stone, an enormous boulder, was probably deposited by glaciation during the last Ice Age. It rests in Borrowdale, a valley of woods and crags in the Lake District whose scenic beauty inspired artists, writers and poets of the Romantic Movement in the late 18th and early 19th centuries. Wordsworth (1770-1850) was among them, and the photograph of the Bowder Stone accompanies his poem, Yew-Trees (1803), from which the following passage is taken:\n\n“…But worthier still of note\n\nAre those fraternal four of Borrowdale,\n\nJoined in one solemn and capacious grove;\n\nHuge trunks! – and each particular trunk a growth\n\nOf intertwined fibres serpentine\n\nUp-coiling, and inveterately convolved, –\n\nNor uninformed with phantasy, and looks\n\nThat threaten the profane; – a pillared shade,\n\nUpon whose grassless floor of red-brown hue,\n\nBy sheddings from the pining umbrage tinged\n\nPerenially – beneath whole sable roof\n\nOf boughs, as if for festal purpose, decked\n\nWith unrejoicing berries, ghostly shapes\n\nMay meet at noontide – Fear and trembling Hope,\n\nSilence and Foresight – Death the skeleton\n\nAnd Time the shadow…”\n\nText from the British Library website [Online] Cited 18/09/2016\n\nAtkinson Grimshaw (English, 1836-1893)\n\nBowder Stone, Borrowdale\n\nc. 1863-1868\n\nOil on canvas\n\nSupport: 400 x 536mm\n\nFrame: 662 x 709 x 100mm\n\nPurchased with assistance from the Friends of the Tate Gallery 1983\n\nTate Britain uncovers the dynamic dialogue between British painters and photographers; from the birth of the modern medium to the blossoming of art photography. Spanning over 70 years, the exhibition brings together nearly 200 works – many for the first time – to reveal their mutual influences. From the first explorations of movement and illumination by David Octavius Hill (1802-1870) and Robert Adamson (1821-1848) to artful compositions at the turn-of-the-century, the show discovers how painters and photographers redefined notions of beauty and art itself.\n\nThe dawn of photography coincided with a tide of revolutionary ideas in the arts, which questioned how pictures should be created and seen. Photography adapted the Old Master traditions within which many photographers had been trained, and engaged with the radical naturalism of JMW Turner (1775-1851), the Pre-Raphaelites, and their Realist and Impressionist successors. Turner inspired the first photographic panoramic views, and, in the years that followed his death, photographers and painters followed in his footsteps and composed novel landscapes evoking meaning and emotion. The exhibition includes examples such as John Everett Millais’s (1829-1896) nostalgic The Woodman’s Daughter and John Brett’s (1831-1902) awe inspiring Glacier Rosenlaui. Later in the century, PH Emerson (1856-1936) and TF Goodall’s (c. 1856-1944) images of rural river life allied photography to Impressionist painting, while JAM Whistler (1834-1903) and Alvin Langdon Coburn (1882-1966) created smoky Thames nocturnes in both media.\n\nThe exhibition celebrates the role of women photographers, such as Zaida Ben-Yusuf (1869-1933) and the renowned Julia Margaret Cameron (1815-1879). Cameron’s artistic friendships with George Frederic Watts (1817-1904) and Dante Gabriel Rossetti (1830-94) are recognised in a room devoted to their beautiful, enigmatic portraits of each other and shared models, where works including Cameron’s Call, I Follow, I Follow, Let Me Die and Rossetti’s Beata Beatrix are on display.\n\nHighlights of the show include examples of three-dimensional photography, which incorporated the use of models and props to stage dramatic tableaux from popular works of the time, re-envisioning well-known pictures such as Henry Wallis’s (1830-1916) Chatterton. Such stereographs were widely disseminated and made art more accessible to the public, often being used as a form of after-dinner entertainment for middle class Victorian families. A previously unseen private album in which the Royal family painstakingly re-enacted famous paintings is also exhibited, as well as rare examples of early colour photography.\n\nCarol Jacobi, Curator British Art 1850-1915, Tate Britain says: “Painting with Light offers new insights into Britain’s most popular artists and reveals just how vital painting and photography were to one another. Their conversations were at the heart of the artistic achievements of the Victorian and Edwardian era.”\n\nPainting with Light: Art and Photography from the Pre-Raphaelites to the Modern Age is curated by Dr Carol Jacobi, Curator of British Art 1850-1915 at Tate Britain, and Dr Hope Kingsley, Curator, Education and Collections, Wilson Centre for Photography, with Tim Batchelor, Assistant Curator at Tate Britain. The exhibition is accompanied by a fully illustrated catalogue from Tate Publishing and a programme of talks and events in the gallery.”\n\nPress release from Tate Britain\n\n‘Whisper of the Muse’\n\nAs the nineteenth century progressed, some artists moved away from the clarity and detail that had been the aim of earlier Pre-Raphaelite art, turning instead to a search for pure beauty. The aesthetic movement, as this tendency came to be known, emphasised the sensual qualities of art and design and explored imaginative themes and effects.\n\nIn London and on the Isle of Wight, a community of artists forged closer links between the visual arts, music and literature. This circle included the photographer Julia Margaret Cameron, painters George Frederic Watts and Dante Gabriel Rossetti, and the poet Alfred Tennyson. Rossetti and Cameron worked with similar subjects, many inspired by Tennyson’s poetry. Together with Watts they developed a newly-intimate form of portraiture, exploring emotional and psychological states. They also shared models, whose striking looks introduced new types of modern beauty.\n\nJulia Margaret Cameron (British, 1815-1879)\n\nWhisper of the Muse\n\n1865\n\nPhotograph, albumen print on paper\n\n325 x 238mm\n\nWilson Centre for Photography\n\nDante Gabriel Rossetti (English, 1828-1882)\n\nMariana\n\n1870\n\nOil on canvas\n\nAberdeen Art Gallery & Museum Collection\n\nInto Light and Colour\n\nIn the second half of the nineteenth century Japanese culture became an important influence in Britain. Japanese goods were sold in London in new department stores such as Liberty, while the Japanese Village, established in Knightsbridge in 1885, attracted more than a million visitors.\n\nJapanese props and motifs appeared in art and design and the vogue for Japanese prints inspired painters and photographers. Painters experimented with new colour palettes, flattened picture planes and condensed, cropped formats, innovations also important to later British impressionist works. Such experiments in light and colour were paralleled in photography with the 1907 introduction of the autochrome, the first practical colour photographic process.\n\nJohn Cimon Warburg (British, 1867-1931)\n\nPeggy in the Garden\n\n1909, printed 2016\n\nPhotograph, transparency on lightbox from autochrome\n\nRoyal Photographic Society / National Media Museum / Science and Society Picture Library\n\nJohn Cimon Warburg (1867-1931) British photographer born to a wealthy family dedicated his whole life to photography. In 1897, he joined the Royal Photographic Society. During his photographic career, John Cimon Warburg used a wide range of photographic processes, but excelled especially in autochromes. Best known for his atmospheric landscapes and its fascinating studies of his children, Warburg lectured and written about the process and explained his autochromes the annual exhibition of the Royal Photographic Society.\n\nText from the Autochrome website [Online] Cited 18/09/2016. No longer available online\n\nPatented by the Lumière brothers in 1903, Autochrome produced a colour transparency using a layer of potato starch grains dyed red, green and blue, along with a complex development process. Autochromes required longer exposure times than traditional black-and-white photos, resulting in images with a hazy, blurred atmosphere filled with pointillist dots of colour.\n\nJohn Singer Sargent (American, 1856-1925)\n\nCarnation, Lily, Lily, Rose\n\n1885-1886\n\nOil paint on canvas\n\n1740 x 1537 mm\n\nTate. Presented by the Trustees of the Chantrey\n\nBequest 1887\n\nThe inspiration for Carnation, Lily, Lily, Rose came during a boating expedition Sargent took on the Thames at Pangbourne in September 1885, with the American artist Edwin Austin Abbey, during which he saw Chinese lanterns hanging among trees and lilies. He began the picture while staying at the home of the painter F.D. Millet at Broadway, Worcestershire, shortly after his move to Britain from Paris. At first he used the Millets’s five-year-old daughter Katharine as his model, but she was soon replaced by Polly and Dorothy (Dolly) Barnard, the daughters of the illustrator Frederick Barnard, because they had the exact hair-colour Sargent was seeking.\n\nHe worked on the picture, one of the few figure compositions he ever made out of doors in the impressionist manner, from September to early November 1885, and again at the Millets’s new home, Russell House, Broadway, during the summer of 1886, completing it some time in October. Sargent was able to work for only a few minutes each evening when the light was exactly right. He would place his easel and paints beforehand, and pose his models in anticipation of the few moments when he could paint the mauvish light of dusk.\n\nAs autumn came and the flowers died, he was forced to replace the blossoms with artificial flowers. The picture was both acclaimed and decried at the 1887 Royal Academy exhibition. The title comes from the song The Wreath, by the eighteenth-century composer of operas Joseph Mazzinghi, which was popular in the 1880s. Sargent and his circle frequently sang around the piano at Broadway. The refrain of the song asks the question ‘Have you seen my Flora pass this way?’ to which the answer is ‘Carnation, Lily, Lily, Rose’.\n\nTerry Riggs. “Carnation, Lily, Lily, Rose,” on the Tate website February 1998 [Online] Cited 16/02/2023\n\nUnknown photographer\n\nH.R.H. Princess Alexandra, H.R.H. Princess Victoria & Mr. Savile, “Two’s company and three’s none” in Tableaux Vivants Devonport\n\nc. 1892-1893\n\nBound volume. Displayed open at Marcus C. Stone’s ‘Two’s Company, Three’s None”\n\nPhotograph, albumen print on paper\n\n360 x 480 x 58mm – book closed\n\nWilson Centre for Photography\n\nUnknown photographer\n\nH.R.H. Princess Alexandra, H.R.H. Princess Victoria & Mr. Savile, “Two’s company and three’s none” in Tableaux Vivants Devonport (detail)\n\nc. 1892-1893\n\nBound volume. Displayed open at Marcus C. Stone’s ‘Two’s Company, Three’s None”\n\nPhotograph, albumen print on paper\n\n360 x 480 x 58mm – book closed\n\nWilson Centre for Photography\n\nThomas Armstrong (English, 1832-1911)\n\nThe Hay Field\n\n1869\n\n© Victoria and Albert Museum, London\n\nAtmosphere and Effect\n\nThe relationship between landscape painting and photography continued to develop into the twentieth century. The etchings and nocturnes of James Abbott McNeill Whistler inspired photographers, who adopted his atmospheric subjects and aesthetics. While photography had achieved a technical sophistication that allowed photographers to produce highly resolved, realistic images, many chose to pursue soft-focus effects rather than detail and precision. Such photographs paralleled the unpeopled landscapes of painters like John Everett Millais and the gas-lit cityscapes of John Atkinson Grimshaw.\n\nJames Abbott McNeill Whistler (American, 1834-1903)\n\nThree Figures Pink and Grey\n\n1868-1878\n\nOil paint on canvas\n\nSupport: 1391 x 1854mm\n\nFrame: 1701 x 2158 x 75mm\n\nTate\n\nPurchased with the aid of contributions from the International Society of Sculptors, Painters and Gravers as a Memorial to Whistler, and from Francis Howard 1950\n\n\n\nThis picture derives from one of six oil sketches that Whistler produced in 1868 as part of a plan for a frieze, commissioned by the businessman F.R. Leyland (1831-1892), founder of the Leyland shipping line. Known as the ‘Six Projects’, the sketches (now in the Freer Art Gallery, Washington) were all scenes with women and flowers, and all six were strongly influenced by his admiration for Japanese art. Another precedent for these works was The Story of St George, a frieze that Edward Burne-Jones (1833-1898) executed for the artist and illustrator Myles Birket Foster (1825-1899) in 1865-1867. The series of large pictures was destined for Leyland’s house at Prince’s Gate, but never produced, and only one – The White Symphony: Three Girls (1867) was finished, but was later lost. Whistler embarked on a new version, Three Figures: Pink and Grey, but was never satisfied with this later painting, and described it as, ‘a picture in no way representative, and in its actual condition absolutely worthless’ (quoted in Wilton and Upstone, p. 117). He followed the original sketch closely, but made a number of pentimenti which suggest that the picture is not simply a copy of the lost work. In spite of Whistler’s dissatisfaction, it has some brilliant touches and a startlingly original composition.\n\nAlthough the three figures are clearly engaged in tending a flowering cherry tree, Whistler’s aim in this picture is to create a mood or atmosphere, rather than to suggest any kind of theme. Parallels have been drawn with the work of Albert Moore, whose work of this period is equally devoid of narrative meaning. The design is economical and the picture space is partitioned like a Japanese interior. The shallow, frieze-like arrangement, the blossoming plant and the right-hand figure’s parasol are also signs of deliberate Japonisme. Whistler has suppressed some of the details in the oil sketch, effectively disrobing the young girls by depicting them in diaphanous robes. The painting is characterised by pastel shades, a ‘harmony’ of pink and grey, punctuated by the brighter reds of the flower pot and the girls’ bandannas, and the turquoise wall behind. It has been suggested that Whistler derived his colour schemes, and even the figures themselves, in their rhythmically flowing drapery, from polychrome Tanagra figures in the British Museum, which was opposite his studio in Great Russell Street.\n\nFrances Fowle. “Three Figures: Pink and Grey,” on the Tate website December 2000 [Online] Cited 16/02/2023\n\nJohn Cimon Warburg (British, 1867-1931)\n\nThe Japanese Parasol\n\nc. 1906\n\nAutochrome\n\n711 x 559mm\n\n© Royal Photographic Society / National Media\n\nMuseum/ Science & Society Picture Library\n\nLife and Landscape\n\nThe 1880s brought a renewed interest in landscape. Rural scenes provided common ground for British painters and photographers. Their distinctive style derived from French realism and impressionism, which had been introduced by independent galleries, and by artists such as George Clausen and Henry La Thangue who studied in Paris. This new approach was shared by their friend and fellow painter Thomas Goodall, and influenced his collaboration with the photographer Peter Henry Emerson. Emerson and Goodall’s first project, a photographic series on the Norfolk Broads, focused on the life of working people, as described in their album Life and Landscape on the Norfolk Broads, published in 1887.\n\nSir George Clausen (British, 1852-1944)\n\nWinter Work\n\n1883-1884\n\nOil on canvas\n\nFrame: 1075 x 1212 x 115mm\n\nSupport: 775 x 921mm\n\nPurchased with assistance from the Friends of the Tate Gallery 1983\n\n© The estate of Sir George Clausen\n\nIn the 1880s Clausen devoted himself to painting realistic scenes of rural work after seeing such pictures by the French artist Jules Bastien-Lepage (1848-1884). In this picture he shows a family of field workers topping and tailing swedes for sheep fodder. It was painted at Chilwick Green near St Albans, where the artist had moved in 1881. He uses subdued colouring to capture the dull light and cold of winter, and manages to convey the hard reality of country work. Such unromanticised scenes of country life were often rejected by the selectors of the Royal Academy annual exhibitions.\n\nThomas Frederick Goodall (British, 1856-1944) and Peter Henry Emerson (British, 1856-1936)\n\nSetting the Bow-Net, in Life and Landscape on the Norfolk Broads\n\n1885, published 1887\n\nBook – open at The Bow Net\n\nPhotograph, platinum print on paper\n\n300 x 420mm (book closed)\n\nPrivate collection\n\nThomas Frederick Goodall (British, 1856-1944)\n\nThe Bow Net\n\n1886\n\nOil paint on canvas\n\n838 x 1270mm\n\nNational Museums Liverpool, Walker Art Gallery\n\nRoger Fenton (British, 1819-1869)\n\nThe Water Carrier\n\n1858\n\nAlbumen Print, Wilson Center for Photography\n\nFrederick Goodall (English, 1822-1904), R.A.\n\nThe Song of the Nubian Slave\n\n1863\n\nDiploma Work, accepted 1863\n\n71.2 x 92 x 2.3cm\n\nOil on canvas\n\nPhoto credit: © Royal Academy of Arts, London; Photographer: John Hammond\n\nOut of the Shadows\n\nIn the late nineteenth century, painters and photographers pursued the representation of an idealised beauty, inspired by Italian Renaissance artists such as Michelangelo and Leonardo da Vinci. Themes of allegory and myth were widely explored in the arts at this time, particularly in Britain in the writings of Walter Pater and Oscar Wilde.\n\nAt the turn of the century painting and photography were part of a wider artistic search for harmony between subject matter and expression. Artists found inspiration in each other’s practice and continued to share ideas through illustrated books and journals. This spirit of collaboration and interchange led photographer Fred Holland Day to claim that ‘the photographer no longer speaks the language of chemistry, but that of poetry’.\n\nAlvin Langdon Coburn (American, 1882-1966)\n\nRegent’s Canal\n\nPhotogravure on paper\n\nImage: 206 x 161 mm\n\nFrame: 508 x 406 mm\n\nWilson Centre for Photography\n\nArthur Hacker (English, 1858-1919)\n\nA Wet Night at Piccadilly Circus\n\n1910\n\nOil on canvas\n\n710 x 915mm\n\nRoyal Academy of Arts, London\n\nAlvin Langdon Coburn (American, 1882-1966)\n\nLeicester Square (The Old Empire Theatre)\n\n\n\nEdward Linley Sambourne (English, 1844-1910)\n\nEthel Warwick, Camera Club, 2 August 1900\n\nPhotograph, cyanotype on paper\n\nDimensions\n\nImage: 165 x 120mm\n\nFrame: 507 x 855mm\n\n18 Stafford Terrace, The Royal Borough of Kensington and Chelsea\n\nTate Britain\n\nMillbank, London SW1P 4RG\n\nUnited Kingdom\n\nPhone: +44 20 7887 8888\n\nOpening hours:\n\nDaily 10.00am – 18.00pm\n\nTate Britain website\n\nLIKE ART BLART ON FACEBOOK\n\nBack to top"}, {"url": "https://www.history.com/topics/us-presidents/benjamin-harrison", "page_content": "In 1890, Harrison signed into law the Sherman Antitrust Act, the first piece of legislation designed to prohibit industrial combinations, or trusts. Before the end of his first term, support for Harrison was waning even within the Republican Party. In 1892, he lost his bid for reelection to Grover Cleveland by a wide margin; he remained active in public life as a lawyer and public speaker until his death in 1901.\n\nBenjamin Harrison followed the distinguished example of his grandfather William Henry Harrison all the way to the White House, winning election as the nation’s 23rd president in 1888. While his support for protective tariffs led to rising prices for consumers and arguably paved the way for the nation’s future economic woes, his bold pursuit of America’s foreign policy goals (including his proposal to annex the Hawaiian Islands) displayed his expanded vision of the nation’s role in world affairs.\n\nBenjamin Harrison: Early Life and Career\n\nHarrison was born on August 20, 1833, in North Bend, Ohio; he grew up on a farm located near the Ohio River below Cincinnati. His father, John Harrison, was a farmer, and his grandfather, William Henry Harrison, was elected as the ninth president of the United States in 1840, but died of pneumonia only one month after he took office. Benjamin Harrison graduated from Miami University in Oxford, Ohio, in 1852 and married Caroline Lavinia Scott the following year; the couple would go on to have two children. After studying law in Cincinnati, Harrison moved to Indianapolis, Indiana, in 1854 and set up his own law practice.\n\nDid you know? Benjamin Harrison was the last Civil War general to serve as president of the United States. He stood five feet six inches tall, and was called \"Little Ben\" by his Democratic opponents.\n\nThough his father had warned Benjamin of the pressures of a life in politics, his wife encouraged his political ambitions. The young Harrison became active in state politics in Indiana, joining the fledgling Republican Party, which had been built on the opposition to slavery and its extension into the western territories. He supported the first Republican presidential candidate, John C. Frémont, in 1856 and Abraham Lincoln in 1860. When the Civil War broke out in 1861, Harrison joined the Union Army as a lieutenant in the 70th Indiana Volunteer Infantry Regiment, and he would attain the rank of brevet brigadier general by 1865.\n\nBack in Indiana after the war’s end, Harrison resumed his law practice and political activity, campaigning unsuccessfully for the Republican gubernatorial nomination in 1872. Four years later, he won the nomination but lost a close race in the general election.\n\nBenjamin Harrison’s Road to the White House\n\nFrom 1881 to 1887, Harrison represented Indiana in the U.S. Senate, arguing for the rights of homesteaders and Native Americans against the expanding railroad industry and campaigning for generous pensions for Civil War veterans, among other issues. A highly principled and devoutly religious man, Harrison broke with the Republican Party to oppose the Chinese Exclusion Act of 1882 (which aimed to close the United States to Chinese immigrants) due to its violation of rights given to the Chinese under an earlier treaty; the act passed without his support.\n\nHarrison lost his Senate seat after a Democratic victory in the Indiana state legislature in 1887, only to gain the Republican nomination for president the following year. Rather than travel around the country during the campaign, he gave numerous speeches to delegations that visited him in Indianapolis–an early example of so-called “front-porch campaigning.” In a controversial general election, Harrison lost the popular vote to the incumbent President Grover Cleveland by 90,000 votes but carried the electoral college, gaining 233 electoral votes to Cleveland’s 168 thanks to victories in the key swing states of New York and Indiana (where Harrison’s opponents later suggested that his campaign had purchased votes in order to win).\n\nHISTORY Vault: U.S. Presidents Stream U.S. Presidents documentaries and your favorite HISTORY series, commercial-free Start free trial\n\nBenjamin Harrison’s Domestic & Foreign Policy\n\nDuring Harrison’s term in the White House, the lingering effects of an economic depression led to calls for more expansive federal legislation. A longtime protectionist, Harrison supported the passage of the McKinley Tariff Act of 1890 (backed by the Ohio congressman and future president William McKinley). For the first time in peacetime, Congress appropriated a billion dollars during Harrison’s administration, angering many Americans who saw the president and his fellow Republicans as too supportive of wealthy interests.\n\nOn the other hand, Harrison lent his support to the Sherman Silver Purchase Act, which required the government to purchase 4.5 million ounces of silver per month, and bowed to the pressure of agrarians and reformers by signing into law the Sherman Antitrust Act, designed to prohibit industrial combinations or trusts. (Ohio Senator John Sherman sponsored both acts.) Harrison also continued his support of veterans’ benefits as well as his advocacy of forest conservation and the expansion of the U.S. Navy.\n\nIn the foreign policy arena, Harrison’s administration (including the president and secretary of state, James G. Blaine) displayed a growing American influence in world affairs. The First International Conference of American States (later the Pan-American Union) took place in Washington, D.C. in late 1889. In addition, Harrison’s State Department successfully negotiated with Germany and Great Britain to set terms for an American protectorate in the Samoan Islands and opposed Britain and Canada in order to prevent the overharvesting of seals in the Bering Sea. Harrison was unsuccessful, however, in his attempts to convince Congress to back the construction of a canal in Nicaragua, as well as in his efforts to annex Hawaii in 1893.\n\nBenjamin Harrison’s Post-Presidency Career\n\nUp for reelection in 1892, Harrison struggled to overcome growing populist discontent, including a number of labor strikes. In the general election, he faced Grover Cleveland again, along with a third-party challenge from the Populist, or People’s, Party. The revelation that Caroline Harrison was seriously ill led to modest campaign efforts by both men and caused Harrison to limit his appearances in key swing states, contributing to the margin of his defeat. Caroline died of tuberculosis in late October, and two weeks later Harrison lost to Cleveland by an electoral vote of 145 to 277, the most decisive victory in 20 years.\n\nAfter leaving the White House, Harrison returned to Indianapolis and his law practice. At the age of 62, he married Mary Lord Dimmick, his late wife’s niece and caretaker; they had one child. In 1898, Harrison served as leading counsel for Venezuela in the arbitration of its boundary dispute with Great Britain. After spending almost a decade as a respected elder statesman and acclaimed public speaker, he died in 1901 of pneumonia."}, {"url": "https://www.nytimes.com/2003/07/25/arts/antiques.html", "page_content": "Jeckyll grew up in East Anglia, the son of a Church of England clergyman. His father was greatly affected by rioting farm laborers, who were protesting low wages with violent attacks on churches in the 1830's, and he left to join a Bible study group that practiced an apocalyptic brand of Christianity. Living in reduced circumstances, the father expected strict piety from his children. It seems that Thomas, who was never formally trained as an architect, learned draftsmanship from his dad.\n\nThomas Jeckyll was part of the Victorian design reform movement that stressed art in the making of everything from buildings to furniture. He set up his own architectural firm in Norfolk in 1847, when he was 20, and worked feverishly until 1876, when he suffered the first of several mental breakdowns. He never married and died at 54 in a hospital for the insane.\n\nHe began his career as a Gothic Revival architect, designing rectories and schools and restoring churches and historic houses. He went on to do architecture in the Old English, Queen Anne and Anglo-Japanese styles. His finest house is probably the lodge in the Old English style that he designed in 1872 for Framingham Pigot in Norfolk, for George Henry Christie and James Brook Christie of the auction-house family.\n\n''The majority of his architectural career was based in Norfolk,'' Ms. Arbuthnott said. ''He was a very hard worker and had a good architectural practice from the beginning. Most of his life he worked alone, without assistants.''\n\nIt took an American to rediscover him. Ms. Soros learned about Jeckyll in 1985, when she was writing her master's thesis on Whistler. She wrote her doctoral dissertation on the English architect E. W. Godwin, another friend and contemporary of Jeckyll. When she began to investigate him, however, she found that unlike Whistler and Godwin, Jeckyll had left no major archive or written record."}, {"url": "https://www.britannica.com/biography/Thomas-Edison/The-Edison-laboratory", "page_content": "The Edison laboratory\n\nA widower with three young children, Edison, on February 24, 1886, married 20-year-old Mina Miller, the daughter of a prosperous Ohio manufacturer. He purchased a hilltop estate in West Orange, New Jersey, for his new bride and constructed nearby a grand, new laboratory, which he intended to be the world’s first true research facility. There, he produced the commercial phonograph, founded the motion-picture industry, and developed the alkaline storage battery. Nevertheless, Edison was past the peak of his productive period. A poor manager and organizer, he worked best in intimate, relatively unstructured surroundings with a handful of close associates and assistants; the West Orange laboratory was too sprawling and diversified for his talents. Furthermore, as a significant portion of the inventor’s time was taken up by his new role of industrialist, which came with the commercialization of incandescent lighting and the phonograph, electrical developments were passing into the domain of university-trained mathematicians and scientists. Above all, for more than a decade Edison’s energy was focused on a magnetic ore-mining venture that proved the unquestioned disaster of his career.\n\nThe first major endeavour at the new laboratory was the commercialization of the phonograph, a venture launched in 1887 after Alexander Graham Bell, his cousin Chichester, and Charles Tainter had developed the graphophone—an improved version of Edison’s original device—which used waxed cardboard instead of tinfoil. Two years later, Edison announced that he had “perfected” the phonograph, although this was far from true. In fact, it was not until the late 1890s, after Edison had established production and recording facilities adjacent to the laboratory, that all the mechanical problems were overcome and the phonograph became a profitable proposition.\n\nIn the meantime, Edison conceived the idea of popularizing the phonograph by linking to it in synchronization a zoetrope, a device that gave the illusion of motion to photographs shot in sequence. He assigned the project to William K.L. Dickson, an employee interested in photography, in 1888. After studying the work of various European photographers who also were trying to record motion, Edison and Dickson succeeded in constructing a working camera and a viewing instrument, which were called, respectively, the Kinetograph and the Kinetoscope. Synchronizing sound and motion proved of such insuperable difficulty, however, that the concept of linking the two was abandoned, and the silent movie was born. Edison constructed at the laboratory the world’s first motion-picture stage, nicknamed the “Black Maria,” in 1893, and the following year Kinetoscopes, which had peepholes that allowed one person at a time to view the moving pictures, were introduced with great success. Rival inventors soon developed screen-projection systems that hurt the Kinetoscope’s business, however, so Edison acquired a projector developed by Thomas Armat and introduced it as “Edison’s latest marvel, the Vitascope.”\n\nAnother derivative of the phonograph was the alkaline storage battery, which Edison began developing as a power source for the phonograph at a time when most homes still lacked electricity. Although it was 20 years before all the difficulties with the battery were solved, by 1909 Edison was a principal supplier of batteries for submarines and electric vehicles and had even formed a company for the manufacture of electric automobiles. In 1912 Henry Ford, one of Edison’s greatest admirers, asked him to design a battery for the self-starter, to be introduced on the Model T. Ford’s request led to a continuing relationship between these two Americans, and in October 1929 he staged a 50th-anniversary celebration of the incandescent light that turned into a universal apotheosis for Edison.\n\nBritannica Quiz Pop Quiz: 15 Things to Know About the Industrial Revolution\n\nMost of Edison’s successes involved electricity or communication, but throughout the late 1880s and early 1890s the Edison Laboratory’s top priority was the magnetic ore-separator. Edison had first worked on the separator when he was searching for platinum for use in the experimental incandescent lamp. The device was supposed to cull platinum from iron-bearing sand. During the 1880s iron ore prices rose to unprecedented heights, so that it appeared that, if the separator could extract the iron from unusable low-grade ores, then abandoned mines might profitably be placed back in production. Edison purchased or acquired rights to 145 old mines in the east and established a large pilot plant at the Ogden mine, near Ogdensburg, New Jersey. He was never able to surmount the engineering problems or work the bugs out of the system, however, and when ore prices plummeted in the mid-1890s he gave up on the idea. By then he had liquidated all but a small part of his holdings in the General Electric Company, sometimes at very low prices, and had become more and more separated from the electric lighting field.\n\nFailure could not discourage Edison’s passion for invention, however. Although none of his later projects were as successful as his earlier ones, he continued to work even in his 80s."}, {"url": "https://antique-marks.com/arts-and-crafts-artists.html", "page_content": "Contents\n\n\n\nArts and Crafts Artists from William Morris to Gustav Stickley, William de Morgan and Christopher Dresser.\n\nIn 1861 the english designer William Morris started the arts and crafts movement in an effort to improve the tastes of the Victorian public.\n\nA great many artists and designers of the time, supported the Arts and Crafts movement\n\nThey looked upon the mass produced industrialised wares as bland, inferior and lacking any soul.\n\nThese Arts and Crafts artists and designers helped create an ethos in which many workers guilds rose to prominence.\n\nAnd in which evening school classes and socially based craft projects sprang up and thrived.\n\nNoteable Arts and Crafts Artists and Designers\n\nCharles Francis Annesley Voysey (1857-1941).\n\nCFA Voysey was the architect and designer son of the Rev. Charles Voysey, founder of the Theistic Church.\n\nOriginally trained as an architect, and after working as a pupil in the offices of JP Seddon, he set up his own design practice in 1882 where he concentrated initially on decorative work, including his own designs for fabrics and wallpaper.\n\nIn 1881 he joined the Arts and Crafts ArtWorkers Guild.\n\nIn 1888 he built his first house, a commission for MH Lakin at Bishops' Itchington.\n\nHe soon developed his own characteristic style; linear, simple and with virtually no surface decoration. His designs were published widely, exhibited at the Arts & Crafts Exhibition Society from 1888 and were highly influential.\n\nVoysey's furniture was made by F C Nielsen. His metalwork by Thomas Elsley & Co. and his textiles by Alexander Morton, GP&J. Baker, AH Lee, JW&C Ward, Stead McAlpin, Thomas Wardle, Turnbull & Stockdale, Donald Brothers, Foxton's, Templeton's, Tomkinson & Adam and sold to the shops Liberty & Co., Story's and Wylie & Lochead.\n\nIn 1900 he completed his own house, The Orchard at Chorley Wood, Hertfordshire, for which he designed most of the furniture.\n\nIn 1914 at the outbreak of WW1, his architectural practice virtually ceased but he took up decorative designs again in the 1920's.\n\nGiven his Quaker background there is, in his best work, an almost Shaker spareness to which he added simple elegance well suited to todays minimalist, clean lines philosophy.\n\nVoysey furniture designs are still being reproduced by a number of manufacturers in England and America.\n\nWalter Frederick Cave (1863-1939)\n\nWalter cave was articled to Sir Arthur Blomfield and after a time spent travelling abroad set up his own practice in London in 1889.\n\nHe was a member of the inner circle of the Art Worker's Guild and used forms of expression very close to those of CFA Voysey.\n\nIn 1897 he took over one of Voysey's commisions, a house in Steatham Park, London.\n\nOther Voyseyesque houses followed but he later changed his style to a more French Classical look. He also designed furniture, light fittings and painted.\n\nMackay Hugh Baillie Scott (1865-1945)\n\nBorn in Kent, the eldest son of fourteen children of a Scottish Laird. Originally sent to agricultural college, being groomed to take over the family holdings in Australia.\n\nHowever his aptitude for drawing led him to be articled to Charles Davis, Bath City architect.\n\nMarried in 1889 he went to the Isle of Man and set up practice as an architect.\n\nThere he met the designer Archibald Knox and later collaborated with him on the design and execution of stained glass, iron grates and fireplace hoods for the houses he designed there.\n\nIn 1897 he collaborated with CR Ashbee on the refurbishment of the grand Ducal palace at Darmstadt.\n\nIn 1901 he moved to Bedford, England and through the furniture manufacturer John P White issued a catalogue of furniture. This was retailed thorough Liberty's as well as White's own showrooms in Bond St, London.\n\nBaillie Scott retired in 1939\n\nWilliam Arthur Smith Benson (1854-1924)\n\nBorn in London, the son of a prosperous lawyer. Founder member of The Art Worker's Guild.\n\nPersuaded by William Morris in 1880 whom he had met at Oxford, to open a workshop in Hammersmith, London, specialising in metalwork.\n\nMoved to larger premises in 1882 and in 1887 opened a showroom in Bond St, London.\n\nHis famous lamp and lighting designs were on show at Samuel Bing's Maison de l'Art Nouveau in Paris.\n\nBenson also designed wallpaper and furniture for Morris & Co, becoming their Managing Director in 1896. He also made furniture designs for JS Henry & Co.\n\nWilliam AS Benson retired in 1920.\n\nChristopher Dresser (1834-1904)\n\nBorn in Glasgow, the son of an excise officer, Christopher Dresser studied at the Government School of Design and then lectured at The Department of Science & Art at South Kensington, specialising in botany.\n\nChristopher Dresser was one of the most influential British designers of 19th Century, he helped reform modern manufacture. He studied with Henry Cole, Richard Redgrave and his mentor Owen Jones.\n\nBotany had a huge influence on his work which held to the idea that something simple can be beautiful and perform a clear function.\n\nHe published a number of works, exploring the relationship between botany and design with a later interest in Japanese art.\n\nIn the late 1860's he included designs for furniture by Burges and Bruce talbert.\n\nBy 1868 Christopher Dresser had taken on many different roles from designer to author and teacher. He gained recognition through his writing and lectures at the Royal Society of Arts and in his earlier designs of wallpaper, fabrics and ceramics for companies including Minton and Wedgwood.\n\nIn 1871 he made his first designs for the Coalbrookdale Co\n\nIn 1875 he began designing for Elkingtons.\n\nIn 1876 Dresser went to America and then onwards to Japan, collecting examples of Japanese goods on behalf of Tiffany & Co of New York.\n\nThe pinnacle of Christopher Dresser’s design career came in 1880 when a shop was opened on New Bond Street, London, through the Art Furnishers’ Alliance.\n\nIt stocked everything for the home and all pieces were either designed or approved by Dresser.\n\nUnfortunately by 1883 the Alliance went into liquidation and most of the goods were taken on by Liberty.\n\nBy then Dresser was a household name, he allowed everyday people to obtain items that were well-made and efficient in a time of transition in the design industry.\n\nHe was once described as 'perhaps the greatest of commercial designers, imposing his fantasy and invention upon the ordinary output of British Industry'\n\nHe designed for various manufacturers in subsequent years, including Hukin & Heath, James Dixon & Sons, Ault, Linthorpe, Mintons, Benham & Froud and William Couper amongst others."}, {"url": "https://openstax.org/books/writing-guide/pages/3-4-annotated-sample-reading-from-narrative-of-the-life-of-frederick-douglass-by-frederick-douglass", "page_content": "In the case of Mr. Auld and Douglass, Douglass gives an account of Auld’s exact language in order to hold a mirror to the racism of Mr. Auld—and the reading audience of his memoir—and to emphasize the theme that literacy (or education) is one way to combat racism.\n\nIn the portion of the text included here, Douglass chooses to represent the dialogue of Mr. Auld, an enslaver who by the laws of the time owns Douglass. Douglass describes this moment with detail and accuracy, including Mr. Auld’s use of a racial slur. In an interview with the Public Broadcasting Service (PBS), Harvard professor Randall Kennedy (b. 1954), who has traced the historical evolution of the word, notes that one of its first uses, recorded in 1619, appears to have been descriptive rather than derogatory. However, by the mid-1800s, White people had appropriated the term and begun using it with its current negative connotation. In response, over time, Black people have reclaimed the word (or variations of it) for different purposes, including mirroring racism, creating irony, and reclaiming community and personal power—using the word for a contrasting purpose to the way others use it. Despite this evolution, Professor Kennedy explains that the use of the word should be accompanied by a deep understanding of one’s audience and by being clear about the intention. However, even when intention is very clear and malice is not intended, harm can, and likely will, occur. Thus, Professor Kennedy cautions that all people should understand the history of the word, be aware of its potential negative effect on an audience, and therefore use it sparingly, or preferably not at all.\n\nFrederick Douglass (1818–1895) was born into slavery in Maryland. He never knew his father, barely knew his mother, and was separated from his grandmother at a young age. As a boy, Douglass understood there to be a connection between literacy and freedom. In the excerpt from his autobiography, Narrative of the Life of Frederick Douglass, an American Slave, that follows, you will learn about how Douglass learned to read. By age 12, he was reading texts about the natural rights of human beings. At age 15, he began educating other enslaved people. When Douglass was 20, he met Anna Murray, whom he would later marry. Murray helped Douglass plot his escape from slavery. Dressed as a sailor, Douglass bought a train ticket northward. Within 24 hours, he arrived in New York City and declared himself free. Douglass went on to work as an activist in the abolitionist movement as well as the women’s suffrage movement.\n\nLiving by Their Own Words\n\nLiteracy from Unexpected Sources\n\nannotated textFrom the title and from Douglass’s use of pronoun I, you know this work is autobiographical and therefore written from the first-person point of view.end annotated text\n\npublic domain text[excerpt begins with first full paragraph on page 33 and ends on page 34 where the paragraph ends]end public domain text\n\npublic domain textVery soon after I went to live with Mr. and Mrs. Auld, she very kindly commenced to teach me the A, B, C. After I had learned this, she assisted me in learning to spell words of three or four letters. Just at this point of my progress, Mr. Auld found out what was going on, and at once forbade Mrs. Auld to instruct me further, telling her, among other things, that it was unlawful, as well as unsafe, to teach a slave to read.end public domain text\n\nannotated textDouglass describes the background situation and the culture of the time, which he will defy in his quest for literacy. The word choice in his narration of events indicates that he is writing for an educated audience.end annotated text\n\npublic domain textTo use his own words, further, he said, “If you give a nigger an inch, he will take an ell. A nigger should know nothing but to obey his master—to do as he is told to do. Learning would spoil the best nigger in the world. Now,” said he, “if you teach that nigger (speaking of myself) how to read, there would be no keeping him. It would forever unfit him to be a slave. He would at once become unmanageable, and of no value to his master. As to himself, it could do him no good, but a great deal of harm. It would make him discontented and unhappy.”end public domain text\n\nannotated textIn sharing this part of the narrative, Douglass underscores the importance of literacy. He provides a description of Mr. Auld, a slaveholder, who seeks to impose illiteracy as a means to oppress others. In this description of Mr. Auld’s reaction, Douglass shows that slaveholders feared the power that enslaved people would have if they could read and write.end annotated text\n\nannotated textDouglass provides the details of Auld’s dialogue not only because it is a convention of narrative genre but also because it demonstrates the purpose and motivation for his forthcoming pursuit of literacy. We have chosen to maintain the authenticity of the original text by using the language that Douglass offers to quote Mr. Auld’s dialogue because it both provides context for the rhetorical situation and underscores the value of the attainment of literacy for Douglass. However, contemporary audiences must understand that this language should be uttered only under very narrow circumstances in any current rhetorical situation. In general, it is best to avoid its use.end annotated text\n\npublic domain textThese words sank deep into my heart, stirred up sentiments within that lay slumbering, and called into existence an entirely new train of thought. It was a new and special revelation, explaining dark and mysterious things, with which my youthful understanding had struggled, but struggled in vain. I now understood what had been to me a most perplexing difficulty—to wit, the white man’s power to enslave the black man. It was a grand achievement, and I prized it highly. From that moment, I understood the pathway from slavery to freedom. It was just what I wanted, and I got it at a time when I the least expected it. Whilst I was saddened by the thought of losing the aid of my kind mistress, I was gladdened by the invaluable instruction which, by the merest accident, I had gained from my master.end public domain text\n\nannotated textIn this reflection, Douglass has a definitive and transformative moment with reading and writing. The moment that sparked a desire for literacy is a common feature in literacy narratives, particularly those of enslaved people. In that moment, he understood the value of literacy and its life-changing possibilities; that transformative moment is a central part of the arc of this literacy narrative.end annotated text\n\npublic domain textThough conscious of the difficulty of learning without a teacher, I set out with high hope, and a fixed purpose, at whatever cost of trouble, to learn how to read. The very decided manner with which he spoke, and strove to impress his wife with the evil consequences of giving me instruction, served to convince me that he was deeply sensible of the truths he was uttering. It gave me the best assurance that I might rely with the utmost confidence on the results which, he said, would flow from teaching me to read. What he most dreaded, that I most desired. What he most loved, that I most hated. That which to him was a great evil, to be carefully shunned, was to me a great good, to be diligently sought; and the argument which he so warmly urged, against my learning to read, only served to inspire me with a desire and determination to learn. In learning to read, I owe almost as much to the bitter opposition of my master, as to the kindly aid of my mistress. I acknowledge the benefit of both.end public domain text\n\nannotated textDouglass articulates that this moment changed his relationship to literacy and ignited a purposeful engagement with language and learning that would last throughout his long life. The rhythm, sentence structure, and poetic phrasing in this reflection provide further evidence that Douglass, over the course of his life, actively pursued and mastered language after having this experience with Mr. Auld.end annotated text\n\npublic domain text[excerpt continues with the beginning of Chapter 7 on page 36 and ends with the end of the paragraph at the top of page 39]end public domain text\n\npublic domain text[In Chapter 7, the narrative continues] I lived in Master Hugh’s family about seven years. During this time, I succeeded in learning to read and write. In accomplishing this, I was compelled to resort to various stratagems. I had no regular teacher. My mistress, who had kindly commenced to instruct me, had, in compliance with the advice and direction of her husband, not only ceased to instruct, but had set her face against my being instructed by any one else. It is due, however, to my mistress to say of her, that she did not adopt this course of treatment immediately. She at first lacked the depravity indispensable to shutting me up in mental darkness. It was at least necessary for her to have some training in the exercise of irresponsible power, to make her equal to the task of treating me as though I were a brute.end public domain text\n\npublic domain textMy mistress was, as I have said, a kind and tender-hearted woman; and in the simplicity of her soul she commenced, when I first went to live with her, to treat me as she supposed one human being ought to treat another. In entering upon the duties of a slaveholder, she did not seem to perceive that I sustained to her the relation of a mere chattel, and that for her to treat me as a human being was not only wrong, but dangerously so. Slavery proved as injurious to her as it did to me. When I went there, she was a pious, warm, and tender-hearted woman. There was no sorrow or suffering for which she had not a tear. She had bread for the hungry, clothes for the naked, and comfort for every mourner that came within her reach. Slavery soon proved its ability to divest her of these heavenly qualities. Under its influence, the tender heart became stone, and the lamblike disposition gave way to one of tiger-like fierceness. The first step in her downward course was in her ceasing to instruct me. She now commenced to practise her husband’s precepts. She finally became even more violent in her opposition than her husband himself.end public domain text\n\nannotated textDouglass describes in detail a person in his life and his relationship to her. He uses specific diction to describe her kindness and to help readers get to know her—a “tear” for the “suffering”; “bread for the hungry, clothes for the naked, and comfort for every mourner.”end annotated text\n\npublic domain textShe was not satisfied with simply doing as well as he had commanded; she seemed anxious to do better. Nothing seemed to make her more angry than to see me with a newspaper. She seemed to think that here lay the danger. I have had her rush at me with a face made all up of fury, and snatch from me a newspaper, in a manner that fully revealed her apprehension. She was an apt woman; and a little experience soon demonstrated, to her satisfaction, that education and slavery were incompatible with each other.end public domain text\n\nannotated textThe fact that Douglass can understand the harm caused by the institution of slavery to slaveholders as well as to enslaved people shows a level of sophistication in thought, identifies the complexity and detriment of this historical period, and demonstrates an acute awareness of the rhetorical situation, especially for his audience for this text. The way that he articulates compassion for the slaveholders, despite their ill treatment of him, would create empathy in his readers and possibly provide a revelation for his audience.end annotated text\n\npublic domain textFrom this time I was most narrowly watched. If I was in a separate room any considerable length of time, I was sure to be suspected of having a book, and was at once called to give an account of myself. All this, however, was too late. The first step had been taken. Mistress, in teaching me the alphabet, had given me the inch, and no precaution could prevent me from taking the ell.end public domain text\n\nannotated textOnce again, Douglass underscores the value that literacy has for transforming the lived experiences of enslaved people. The reference to the inch and the ell circles back to Mr. Auld’s warnings and recalls the impact of that moment on his life.end annotated text\n\npublic domain textThe plan which I adopted, and the one by which I was most successful, was that of making friends of all the little white boys whom I met in the street. As many of these as I could, I converted into teachers. With their kindly aid, obtained at different times and in different places, I finally succeeded in learning to read. When I was sent of errands, I always took my book with me, and by going one part of my errand quickly, I found time to get a lesson before my return. I used also to carry bread with me, enough of which was always in the house, and to which I was always welcome; for I was much better off in this regard than many of the poor white children in our neighborhood. This bread I used to bestow upon the hungry little urchins, who, in return, would give me that more valuable bread of knowledge. I am strongly tempted to give the names of two or three of those little boys, as a testimonial of the gratitude and affection I bear them; but prudence forbids;—not that it would injure me, but it might embarrass them; for it is almost an unpardonable offence to teach slaves to read in this Christian country.end public domain text\n\nannotated textDouglass comments on the culture of the time, which still permitted slavery; he is sensitive to the fact that these boys might be embarrassed by their participation in unacceptable, though humanitarian, behavior. His audience will also recognize the irony in his tone when he writes that it is “an unpardonable offense to teach slaves . . . in this Christian country.” Such behavior is surely “unchristian.”end annotated text\n\npublic domain textIt is enough to say of the dear little fellows, that they lived on Philpot Street, very near Durgin and Bailey’s ship-yard. I used to talk this matter of slavery over with them. I would sometimes say to them, I wished I could be as free as they would be when they got to be men. “You will be free as soon as you are twenty-one, but I am a slave for life! Have not I as good a right to be free as you have?” These words used to trouble them; they would express for me the liveliest sympathy, and console me with the hope that something would occur by which I might be free.end public domain text\n\nannotated textDouglass pursues and attains literacy not only for his own benefit; his knowledge also allows him to begin to instruct, as well as advocate for, those around him. Douglass’s use of language and his understanding of the rhetorical situation give the audience evidence of the power of literacy for all people, round out the arc of his narrative, and provide a resolution.end annotated text"}, {"url": "https://adc.bmj.com/content/88/6/549", "page_content": "In my library of classic medical literature, I (JES) am lucky enough to possess the 1881 Applied anatomy by Frederick Treves, FRCS (1853–1923).1 I call it, with great affection, “the little red book”. It is a true “handbook”, fitting comfortably in my outstretched palm. This book is full of anatomical pearls, such as the following about the appendix:\n\n“The tip of the vermiform appendix may adhere to a neighbouring peritoneal surface, and thus form a ‘band’ beneath which a piece of the small gut may be strangled. It is favourably placed for the accumulation of intestinal concretions and in it foreign bodies are apt to lodge. For these and other reasons it happens that ulceration of the appendix is a frequent cause of perityphlitis.”\n\nIn 1888, Treves described the possible positions of the appendix in the form of a clock face.2\n\nAn appreciation of the illustrious life and great accomplishments of this master surgeon and anatomist is incomplete without a consideration of his role in the treatment of appendicitis. While Treves is a major figure in the history of knowledge about the appendix, he is not alone in the pantheon of medical genius. Proper perspective comes from further perusal of my bookshelf, which also contains a yellowing copy of the imposing tome by Kelly and Hurdon, The vermiform appendix and its diseases.3 I like to look back at 1905, when the authors could write, “aggressive surgery of the vermiform appendix as practised to-day is only a development of the past twenty years”. In prose that is expansive but never discursive, Kelly and Hurdon show how the ancient practice of incision and evacuation of blood and pus in the abdominal cavity evolved over time with an awareness of the existence and maladies of the appendix.\n\nWilliams4 stated, “The history of appendicitis includes examples of great resistance to changing concepts, brilliant but unaccepted early observations, emotional support for unsupportable views, the importance of timing, and, finally, the development of a highly satisfactory solution.”\n\nAcute appendicitis was described by Wilhelm Ballonius in 1734. James Parkinson (1775–1824) described peritonitis as an important complication of acute perforated appendicitis.5\n\nWhen to treat appendicitis has been as contentious an issue as how to treat it. Moore’s vignette of the surgeon John Homans and the great pathologic anatomist Reginald Heber Fitz illuminates the issues6:\n\n“Homans operated upon an 11 year old boy on the fifth day of his disease. A very early appendiceal abscess was found and drained. Recovery was gratifying. ‘Early operation’ was stressed (again for abscess drainage) but the concept of removing the appendix prior to perforation was not recognized at all. Homans reported the case before the Suffolk District Society on April 19, 1886, with both pride and charm, politely doffing his hat to the referring physician whose early diagnosis made it possible. One cannot help but wonder if Dr. Homans’ colleague Dr. Fitz was in the audience, and equally politely, holding his counsel and avoiding premature release of his concept that Dr. Homans’ little patient was truly operated on quite late in the disease.\n\nFitz’s report in 1886 in the American Journal of Medical Sciences constitutes a classic example of the pathologist pointing the way for the surgeon. He read his paper on June 18, 1886, before the American Association of Physicians, just two months after the Homans paper in Boston. He clearly visualized the difference between early operation on appendicitis and early drainage of an abscess. He stated ‘a simple catarrhal appendicitis is to be recognized anatomically but it is doubtful whether its clinical appreciation is possible. This appendicitis, in the absence of a concretion of foreign body, may progress towards ulceration and even to peritonitis which may terminate fatally.’ Fitz then went on to point out the signs and symptoms of early appendiceal involvement. He decried the habit, then becoming current, of waiting for a visible mass and fluctuance to appear before operation. He pointed out clearly that the second, third and fourth days were those in which peritonitis began. He analyzed the time of death from peritonitis and found over half the patients died in the first week. The homily ... that ‘if it is appendicitis, it is ruptured in four days’ finds its origin in Fitz’s original description.”\n\nIncision and evacuation for cases of “typhlitis” and “perityphlitis”, conditions ascribed to inflammation of the caecum and surrounding areas, evolved over time to actual removal of the appendix. Shepherd7 gave an excellent overview of the shift in diagnostic focus from the caecum to the appendix.\n\nThe history of appendectomy (appendicectomy in Britain) is fascinating. Claudius Aymand removed an appendix containing a calcified mass surrounding a pin in 1735 or 1736. Both Ellis8 and Williams9 took pains to qualify this appendectomy as occurring as part of surgical correction of an inguinal hernia and faecal fistula. Richardson10 reported, “When [Amyand] opened the scrotum he found the appendix in this unusual position and moreover, that the appendix was perforated by a pin. He removed the appendix and then dealt with the hernia and fistula.”\n\nAdvances in anatomic and pathologic knowledge were joined by the twin breakthroughs of anaesthesia and antisepsis. Lawson Tait removed an inflamed but intact appendix in 1880. He reported the following: “A large abscess which extended deeply down towards the brim of the pelvis and lying bare in the cavity was the vermiform appendix ... it was black and discolored and gangrenous. I therefore snipped it off, and inverted the stump into the cavity, stitching the inverted peritoneal surfaces together with fine silk, then fastened a drainage tube into the pelvis and closed the wound.” The report of this successful surgery was not published until 1890.3 Abraham Groves removed an inflamed appendix 1883, but no report occurred until his 1934 autobiography.4 Charles McBurney, who published the results of an 1888 surgery in 1889, was thus not erring by stating, “This is, I believe, the first recorded case where an acutely inflamed unruptured appendix has been removed full of pus”.8\n\nIn an address presented in 1884, Johannes von Mikulicz advocated surgery for non-traumatic perforations of the appendix.3 Ulrich Kronlein performed a coeliotomy with removal of the appendix that same year (report published in German in 1886).3 Treves operated on a chronically affected appendix on 16 February 1887 (report published in 1888).3 George Thomas Morton, whose brother and son both died of appendicitis,11 excised a partially perforated appendix on 27 April 1887 (report published in The Philadelphia Medical News in 1887).3\n\nTreves wrote the following letter, which was published on 5 November 1892 in the Philadelphia Medical News3:\n\n“I have just read with interest a leading article in the Medical News for August 6 on the matter of operative treatment of the vermiform appendix. The fact that I live in a remote island, and further that a holiday of two months has taken me away from the haunts of books, must explain this tardy allusion to that paper. The article discusses the origin of the operation for removing the vermiform appendix, and it is stated that to Dr. Thomas G. Morton belongs the credit of first devising this procedure; the suggestion is also made that the operation should be called ‘Morton’s operation,’ and it is asserted that Morton’s operation embodies one of the most important and radical advances of modern surgery. Dr. Morton thus becomes the founder of what will, I suppose, be known as ‘Appendiceal Surgery,’ should the present love for ridiculous terms survive. I gather that Dr. Morton’s first operation was performed in 1888, and was reported in the Philadelphia County Society’s Transactions for that year. The nature of the transaction is not stated. Who first excised the appendix some musty and forgotten tome will no doubt reveal in the course of time ... In 1886 a patient with relapsing typhlitis came under my care at the London Hospital, and after due consideration, I proposed to ‘deliberately seek for and remove his appendix.’ I operated on him during a period of apparent health, on February 16, 1887, and was able to correct the distortion of the appendix without removing it. He made a perfect recovery. On September 19, 1887, I brought the matter before the Royal Medical and Surgical Society. The paper was read in February, 1888. I advised the treatment of selected cases of relapsing typhlitis by the deliberate removal of the offending appendix during a quiescent period. The proposal was not well received. In due course, however, an exuberant reaction took place, and of late appendices have been removed with a needless and illogical recklessness which has brought this little branch of surgery into well-merited disrepute. Discussions on questions of priority constitute the most pitiable and petty items in the literature of medicine. The object of the letter is merely to bring up from oblivion an unpretending paper which lies buried in the annals of an ancient society.\n\nBelieve me to remain, yours faithfully,\n\nFREDERICK TREVES”\n\nIn a thoughtful analysis, Kelly and Hurdon3 concluded:\n\n“As a matter of fact, neither Morton nor Treves is entitled to the distinction of first removing the appendix, since Kronlein ... made the diagnosis and performed the operation in February, 1884, and published the account in 1886. ... Any claim to priority in medicine or surgery always rests by the consent of the profession not upon the date of performance, but upon date of publication. Reflection will only confirm this dictum by showing that the printed word is, after all, the only possible arbiter which can be generally appealed to and accepted when disputes arise. Moreover, in the particular case in hand, the operations done, although having the same organ in view, were essentially different—one was purely orthopedic and the other exsective; it is the difference between a plastic operation upon a limb and an amputation; therefore, in view of this fact alone, no conflicting claims as to priority can be raised.”\n\nTreves was not one to seek glory. Steinke and Zellweger12 provided insight into his character in their thorough history of Richter’s hernia:\n\n“Treves credited Richter with the distinction of having given the first scientific description of this particular lesion and suggested the term Richter’s hernia, (partly) because with Richter must rest the main credit of establishing the individuality of this lesion.13 Treves’ unparalleled scholarly contribution to the subject remains, after more than a century, the cornerstone of modern understanding. Not only did he provide a detailed clinical description based on his own surgical experience, but he also exhaustively treated the topic by citing 52 authors since 1606 in his analytic and historical review of the subject. He then modestly proposed Richter, not himself, as deserving eponymous recognition for this hernia. All of this exemplifies his honest and scientific approach to research and medicine.”\n\nGibbs14 stated, “It was especially in the field of abdominal surgery that Treves excelled and made lasting contributions. It is unlikely that anybody, before or since, has prepared himself more thoroughly with knowledge of abdominal anatomy, both in comparative and human anatomy.” Treves performed the first curative operation for megacolon in a 5 year old child. As Howard15 reported, “Although there was massive dilatation of the proximal colon, the lower sigmoid colon and rectum were narrow. He performed an abdominoperineal resection of the distal colon and rectum with anastomosis of the proximal colon to the anal margin. The patient was known to survive at least until 67 years of age.” Treves was the first to report caecal bascules.16\n\nTwo inconstant folds of peritoneum have been called “Treves’ folds”. The ileocaecal fold is known by the eponym “Treves’ bloodless fold”. On several occasions, the senior author (JES) has seen minute blood vessels travelling in this fold. Therefore, we advise our residents to exercise extreme care in ligating both the ileocaecal and ileocolic folds to avoid postoperative haematoma. As Kelly and Hurdon point out, the ileocaecal fold is bloodless “in the sense that its origin was not determined by blood-vessels, as in the case of the ileocolic fold”.3\n\nA witty writer and lover of precision in language, Treves’ texts are still enjoyable reading. He wrote of the caecum, “In herbivorous animals it is of great size, and appears to serve as a reservoir for the elaboration and absorption of food, since its removal causes great emaciation. In man, therefore, the caecum has been said to exist as an anatomical protest against vegetarianism”.1 Concerning the sigmoid flexure, Treves stated, “This loop, when unfolded, describes a figure that, if it must be compared to a letter, may well be compared to the capital Omega”.17 He reserved special scorn for a Latin-Greek portmanteau word used by American doctors: “One knows that the academical-minded have a great objection to this uncouth term ‘appendicitis’; it lacks precision, but it has found its place in the clumsy nomenclature of medicine, and has been accepted by the public with an extraordinary amount of generosity”.18\n\nTreves was 35 years old on 29 June 1888, when he first removed a chronically affected appendix.11 He couched his reasoning for recommending surgery more in terms of typhlitis than appendicitis19:\n\n“Typhlitis is very liable to relapse ... I am under the impression that the great majority of examples of relapsing typhlitis are due to troubles in the appendix; indeed, that the diverticulum affords anatomical reasons for relapse that are not provided either by the caecum or by the peritoneum. A simple local peritonitis shows no disposition to relapse, nor are there circumstances in those lesions of the caecum that lead to typhlitis which will readily explain frequent attacks of inflammatory trouble.”\n\nAdamant to the point of dogmatism about circumstances and timing of surgery of the appendix, in 1889 Treves proclaimed the value of “interval” surgery: “The operation should not be performed until all inflammatory and other symptoms have quite subsided”.20 He championed delayed treatment even for a first acute attack: “A case of death from perforation within thirty-six hours of the appearance of the symptoms of typhlitis does not afford a legitimate argument for the routine performance of an operation within that period in even the majority of cases”.21\n\nBy 1901, Treves had removed a thousand appendices.22 Yet an appendicitis that progressed to peritonitis claimed Treves’ daughter Hetty in 1900, despite his belated surgical intervention.23\n\nTreves’ most famous surgery is undoubtedly his treatment of the appendiceal abscess of King Edward VII. Edward’s bouts of pain in the lower right abdomen began less than two weeks before his scheduled coronation on 26 June 1902. Treves examined the prince on 18 June and continued with daily visits. During this period of relative quiescence, Treves presented a major address on appendiceal inflammation.18 As his pain waxed and waned, Edward resisted all counsel for surgical intervention, attending a banquet on 23 June. By the next morning, he was gravely ill.\n\nEllis22 described the dramatic scene in Buckingham Palace:\n\n“It fell to Lister to explain to the King that his medical advisers all agreed that an operation was urgently necessary. Edward, steeped in the tradition of service to his people, refused: ‘I must keep faith with my people and go to the [Westminster] Abbey for the coronation.’ This he repeated over and over again as his doctors did their best to persuade him. Treves realized that the time had come to speak frankly, and when the King reiterated, ‘I must go to the Abbey’, Treves finally said, ‘Then, Sire, you will go as a corpse.’ At this the King agreed to submit to surgery.”\n\nAfter draining the appendiceal abscess in a hastily assembled operating theatre, Treves spent seven sleepless days and nights caring for the king. Edward was crowned on 9 August 1902. Williams’24 summary is apt: “Appendicitis thus became well known in Edwardian London, and appendicectomy rapidly was accepted by English surgeons, even though the royal appendix remained in situ.”\n\nSir Frederick Treves was already a Companion of the Order of the Bath and a Knight Commander of the Royal Victorian Order in 1902. For his service, he gained a baronetcy, and achieved augmentation of his coat of arms. Harrison25 gave this description of the latter achievement:\n\n“Augmentation is a special mark of honour usually from the Sovereign ... granted by royal warrant under the hand of the Privy Seal for great service to the Sovereign or the state. Few medical practitioners have been so honoured ...”\n\nThe description of the renewed Treves family crest with its symbol of royalty (the rampant lion) is as rich in technical terminology and detail as the finest topographic anatomy:\n\n“His arms were blazoned: ‘Argent, a cross couped gules, thereon a tower tripled turreted Or, in the first and fourth quarters a dexter hand appaume proper, and in the second and third quarters a tent proper; and for honourable augmentation, on a chief gules, a lion passant guarant Or, armed and langued azure’ (being one of the lions from His Majesty’s Royal Arms).”\n\nWangensteen and Wangensteen26 give us a final glimpse of Treves:\n\n“Treves developed an enormous private surgical practice and abandoned his hospital appointment at the London [Hospital] at age forty-five. At age fifty-five he withdrew completely from surgery to devote himself to travel. He died from peritonitis at age seventy-two in a Lausanne nursing home. Unfortunately a postmortem examination prior to cremation was not performed. Could incomplete cecal descent, a clinical entity identified by Treves, attended by appendiceal obstruction have accounted for the peritonitis that took his life? It has been suggested that the peritonitis was biliary in origin. But certainly rupture of the appendix is a far more frequent cause of peritonitis than is cholecystitis.”\n\nDelightfully, there is an “appendix” to the story of Treves in the case of contemporary patient EMG, published in 2000 by Lavelle27:\n\n“Treves’ young patient\n\nEMG will be 100 years old this month. She is both a friend and a former patient. I first met her as a friend in 1984, and in 1993 I found myself operating on her for gallstones. Laparoscopic surgery had arrived, and so I performed a laparoscopic cholecystectomy. Preoperatively, she mentioned that she had had her appendix removed as a child, and as a routine I asked her the name of the surgeon. ‘Treves—Frederick Treves’, she said. It turned out that she had had her appendix removed at home in Ealing at the age of 6 (in 1906). Her father was well off and was able to command the services of a surgeon in his home, rather than allowing his child to be taken to the local hospital. At that time, the operation of appendicectomy was still not commonly performed, but it had gained in popularity when Sir Frederick Treves had operated on the Prince of Wales in 1901, [sic] the night before his coronation, and drained an appendix abscess that had been brewing for several days. The coronation had to be postponed, but the Prince of Wales survived to be crowned King Edward VII. Treves is also remembered today for his role in studying and looking after ‘the Elephant Man’. EMG remembers waiting for Treves to arrive, and she remembers a table being taken upstairs to one of the bedrooms for the operation. She then remembers that after the operation she was in bed for three weeks. During that time, she had a day nurse and a night nurse, and her mother was not allowed to see her at all. In fact, her mother peeped through the keyhole one day and when the nurse found out about this she stopped up the hole. EMG remembers having regular dressing changes, and this was a very painful business. The local doctor supervised the dressings, and if EMG behaved herself—that is, she didn’t scream the place down—he left a penny on the mantlepiece. After three weeks, she was allowed out in a push chair [wheelchair] and had to suffer the taunts of the local children. At about the same time, EMG remembers that another child of her age developed appendicitis and went to the local hospital, but died in hospital. When I performed EMG’s laparoscopic cholecystectomy in 1993, I was able to visualise the caecum and thus see the results of Sir Frederick Treves’s handiwork. She had a large incision in the right iliac fossa, which would have been necessary in prerelaxant days to gain access to the appendix.”\n\nAs Gibbs14 so aptly stated, “Sir Frederick Treves was a man of many-sided genius and widely varied achievement ... There is much evidence that Treves saw himself as a participant on the stage of history ... He had lived through a remarkable period of change in surgical practice ... When he started as a student many aspects of surgery had scarcely changed since medieval times.” The history of the anatomy and surgery of the appendix is a beautiful chapter in medical education, and we appreciate the role of Sir Frederick Treves in its development."}, {"url": "https://antique-collecting.co.uk/2020/06/15/bernard-leach-a-quick-guide-to-his-ceramics/", "page_content": "On the centenary of the influential Leach Pottery formed in St Ives in 1920, Antique Collecting highlights the ceramics of its founders Bernard Leach and Shoji Hamada.\n\nRegarded as the ‘father of British studio pottery’, Bernard Leach’s contribution as both a ceramicist and teacher is difficult to over-emphasize.\n\nLife of Bernard Leach\n\nThe Leach Pottery, established in 1920 with his friend, colleague and fellow artist Shoji Hamada, went on to become one of the most influential studios of the 20th century.\n\nFunded by the Guild of Handicraft, Leach and Hamada wanted to challenge the homogeneity of British mass production and position ceramic practice as an equal to the fine arts. Not only did the potters construct the first Japanese-style climbing kiln in the West, their subsequent influence on studio pottery and the philosophy of ceramics became internationally renowned.\n\nLeach’s influence and ideals were to resonate strongly within the community of modern artists living in post-war St Ives.\n\nBernard Leach – the early days\n\nBernard Howell Leach was born in Hong Kong in 1887, the son of English parents. His mother died in childbirth and he was taken to Kyoto in Japan by his maternal grandparents. Four years later his father remarried and he brought Leach back to Hong Kong and then on to Singapore when he was appointed a judge.\n\nHe returned to England aged 10, leaving school at 16 having excelled only in drawing, elocution and cricket. Leach then enrolled at The Slade School of Art but left when his father became ill in 1904 to seek out a job in the Hong Kong and Shanghai Bank (HSBC).\n\nWhen his father died, with a small inheritance, the 21-year-old enrolled at the London School of Art in Kensington where he was taught etching by Frank Brangwyn who was an inspiration to Leach.\n\nReturn to Japan\n\nIt was on his return to Japan in 1909 that he first discovered ‘raku’ (a low-fired earthenware that was an integral part of the culture of the Japanese tea ceremony). At a party in Tokyo, he was invited to decorate such a piece which had been recently fired and glazed.\n\nHe was enthralled by the firing process and wrote, “By this to me a miracle, I was carried away to a new world. Enthralled, I was on the spot seized with the desire to take up the craft”. This was a pivotal time in Leach’s life and he decided to follow the path of ceramics.\n\nHe was recommended and then studied with Urano Shigekichi, known by his title of Kenzan VI, two days a week for two years. It was a remarkable pupillage, with Leach becoming the first Western potter to be trained in the Oriental tradition.\n\nThis cultural cross-pollination of East and West was important in the development of Leach’s art, both in the type of kiln he set up and the pottery he founded in Cornwall with Shoji Hamada. Potter and author Edmund De Waal described him as ‘a kind of link or courier between English and Japanese potters in the interchange between our pre-industrial tradition and theirs.’\n\nLike William Morris before him, Leach was concerned with the dying folk arts of Japan and England that were gradually being eroded by the modernising forces of the 20th century. He and Hamada felt that is was their duty to revive these crafts before they were lost to the course of history. His exposure in Japan to ceramics produced there, and in Korea and China, was a great source of inspiration, as was the English slipware tradition that was still being practised in small pockets of Devon.\n\nBernard Leach in St Ives\n\nLeach returned to England in 1920 with Shoji Hamada. Hamada was a young, enthusiastic student at the Kyoto Institute of Ceramics, who had followed and admired both Leach’s and his fellow artist Kenkichi Tomimoto’s works in various exhibitions in Tokyo.\n\nIt was through these exhibitions that he eventually got to know Leach and became so excited by his ideology and lifestyle that he volunteered to accompany the artist to the UK as his assistant.\n\nHamada’s detailed study of glazes was considered to be of great value to Leach, who had not been educated in these techniques.\n\nThey settled in St Ives in Cornwall, a small artistic community, where they set up a business. Leach purchased a small strip of land and, using local workmen, built a kiln, house and studio. He continued to experiment with many forms and techniques even holding raku parties at which his first wife Muriel served Cornish teas for 1 shilling.\n\nBy living in Cornwall Leach gradually absorbed aspects of Celtic mythology and recreated them by featuring mythological creatures and heraldic images in many of his works. Similarly, the shapes he used were inspired by the English rural tradition with an emphasis on medieval jugs, mead jars, grain jars and flagons. He began to study and reinterpret the signed pieces of 17th-century slipware by Thomas and Ralph Toft. This allowed him to play with the idea of his identity as a potter, believing all pots were a projection of the minds of their creators.\n\nThis is evident in many of his pieces where he incorporated his monogram and the St Ives pottery seal with the context of his designs. In expressing himself in such a way he found satisfaction through what he perceived as the balance between pot and maker and beauty and function.\n\nThis sense of harmony, which he learnt in the East and which he felt was lacking in the West, is obvious in his art forms. The influence of the East is also evident in other ways, from the use of the simple shapes inspired by the Japanese tea ceremony, the yunomis (Oriental teabowls), saki bottles, teapots and fl asks to his interpretation of the glazes from the Sung dynasty (oatmeal, tenmoku, celadon).\n\nHis repeated use of ‘graphic’ images such as the willow, the pagoda and the mountain range, created through simple brush strokes, is also straight from Japanese culture.\n\nBernard Leach’s Legacy\n\nLeach’s training of aspiring students was formidable in guiding and inspiring a generation of artists.\n\nMichael Cardew (1901-1983) became the first student at the Leach Pottery in St Ives in 1923, where he worked for three years. He established his pottery, Winchcombe Pottery in Gloucestershire in 1926, where he concentrated on making slip-decorated earthenware, creating traditional and affordable domestic pieces with increasing success.\n\nRichard Batterham (b. 1936) trained at the Leach Pottery in 1957 and 1958, returning to his native Dorset in 1959 to set up his own pottery.\n\nNorah Braden (1901-2001) studied at the Royal College of Art until 1925 when she joined the workshop. Leach described her as one of his most gifted pupils and her work was equally appreciated by Michael Cardew. In 1928 she joined Katharine Pleydell- Bouverie (1895-1985) at her pottery in Coleshill, where she spent the next eight years producing individual pieces and undertaking extensive glaze experiments using ash glazes made from the plants and wood on the estate.\n\nAlthough distinct potters in their own right, Leach’s influence on his own family – among others Janet, David (his son) and John (his grandson) – is also of note.\n\nOn Leach’s death in 1979 production at the pottery continued where it does to this day, with ceramicists remaining true to the Leach ideals and some even producing wares using the original tools dating back to the 1930s.\n\nDid you know?\n\nIn the early 1980s, inmates of Featherstone Prison near Wolverhampton used their pottery classes to produce copies of Leach’s work using the prison’s kilns. While many experts were fooled by the fakes, Janet Leach revealed their flaws.\n\nThe Market for Bernard Leach\n\nThe market for studio ceramics is currently polarised with a few potters attracting a premium at auction.\n\nThe market for Leach’s work is strong, with interest on an international level but particularly in Britain, America and Japan (where they consider him one of their own).\n\nEarly slipware pieces and academic pieces are highly sought after, with prices further increased by examples decorated with ‘classical’ Leach images, such as the leaping hare, the deer, the salmon and the pagoda.\n\nOne of his most famous examples, his ‘pilgrim’ plate produced in the mid-1960s, featured a stencilled motif of a hooded pilgrim with a staff walking towards a mountain range and is in glazed tenmoku.\n\nAs collectors become priced out of the top end of the market other collecting trends emerge. Tiles provide an alternative affordable area, particularly those featuring Leach’s best-known symbols. They were a perfect medium for the potter – easy to manufacture, quick to decorate and the flat surfaces ideally suited to Leach’s style of brushwork.\n\nDavid Leach\n\nDavid (British, 1911-2005) joined his father’s pottery at St Ives in 1930 as an apprentice.\n\nFrom 1934-1936 he attended the Pottery Managers course at North Staffordshire Technical College, Stoke-on-Trent to acquire more technical knowledge on pottery.\n\nOn his return to the Leach Pottery in 1946 David and Bernard formed a partnership and his industrial training allowed him to modernise the workshop, introducing machinery and developing a new stoneware body. His developments allowed for successful production of the standard ware range, which he designed together with Bernard.\n\nIn 1956 he established his own studio at Lowerdown Pottery, South Devon where he developed his individual style, moving away from repetitive domestic ware to make more individual pieces. He was chairman of the Craft Potters’ Association of Great Britain in 1967 and exhibited widely in the UK, Europe and America.\n\nJanet Leach\n\nJanet Leach, nee Darnell, was born in Texas, USA (1918-1997). Before meeting Bernard Leach she was an established artist in her own right specialising in stoneware and porcelain pots with minimal decoration.\n\nIn 1938 she enrolled in sculpture classes in New York and worked as a sculptor’s assistant on the Federal Art Project and for Robert Cronback on architectural commissions.\n\nDuring the war she worked as a welder on ships on Staten Island (1939-1945).\n\nHer interest in pottery began in 1947 and she trained at Inwood Pottery and Alfred University, USA.\n\nShe met Bernard Leach, Soetsu Yanagi and Shoji Hamada at Black Mountain College, when they were touring in America in 1952. She soon became interested in Japanese techniques and the philosophy of pottery.\n\nShe went to Japan in 1954 where she spent two years studying under Hamada, who she always considered her principal mentor. She was the first foreign woman to study pottery in Japan and only the second westerner.\n\nIn 1956, she settled in Britain after her marriage to Bernard Leach and together they ran the Leach Pottery in St. Ives. After her husband died in 1979, Janet continued potting, throwing individual pieces in a variety of clays using a number of different firing techniques. She exhibited widely and held regular one-person shows in England and Japan. Her work can be found in many public collections."}]}