{"Frederick Thomas Brentnall was particularly noted for his work in the Arts and Crafts style.": [{"url": "https://adb.anu.edu.au/biography/brentnall-frederick-thomas-3050", "page_content": "by Ronald Lawson\n\nFrederick Thomas Brentnall (1834-1925), Wesleyan minister, journalist, company director and politician, was born on 17 June 1834 at Riddings, Derbyshire, England, eldest of the twelve children of George Brentnall, builder, and his wife Mary, née Clarke. He was educated at an endowed school in Alfreton, near Derby. He entered business in Ripley, Derbyshire, but in 1863 was sent to join the Wesleyan Conference of New South Wales and Queensland. After serving on several circuits in New South Wales, in April 1873 he joined the Brisbane circuit, where he quickly made an impact as a forceful and eloquent preacher. He became chairman of the Queensland district, where he was prominent in the formation of a strong loan fund which was to prove important in extending Wesleyan Methodist work in Queensland. He served also in the circuits of Fortitude Valley and Ipswich, and at the Ann Street Church in Brisbane, before a throat infection forced him to retire from the ministry in 1883.\n\nIn 1875, towards the climax of the education controversy in Queensland, Brentnall was instrumental with three other clergymen in establishing the Queensland Evangelical Standard, a journal dedicated to a system of secular education, and thus anti-Catholic in tone. Viewing the 'squatting party' as allies of the Catholics, the Standard adopted a clear political posture, championed the cause of (Sir) Samuel Griffith, a Liberal and son of a Congregational cleric, and poured invective on 'Land Rings and Railway Kings'. Brentnall used his pen with telling effect against the McIlwraith ministry in its handling of the steel rails contract of 1881 and soon afterwards of the land-grant railway proposal.\n\nBrentnall's activity in the business world seems to have been recognized as early as 1881. The Daily Observer, 28 February, openly attacked him in an advertisement: 'Wanted for the Christian Ministry … Special advantages are now offered to worldly-minded men to join the ranks … Men of business turn of mind specially eligible for this ministry, and always come to the front. “Fervency of spirit” not at all necessary. Shareholders in gold mines, tin mines, newspaper companies, land speculating, and such like heavenly pastures, will always be accepted as specially qualified'. The Standard, smarting under the sarcasm, responded so sharply that its reply led to a libel case. On his retirement from the church Brentnall joined the Telegraph, in which he was a minor shareholder, as a journalist. In 1885 he greatly increased his holdings in the company and became chairman of directors, a position he retained until May 1893, after which he continued to hold a large financial interest. He became increasingly active in business affairs, his directorships included the Queensland Deposit Bank and Building Society, and the Queensland Trustees (later becoming chairman of directors of both companies), Queensland General Insurance, Finney Isles, Coolgarra Tin Mining, Queensland Exploration and Queensland Copper Freeholds. He speculated widely, sometimes successfully, sometimes disastrously, in Queensland mining ventures. He was one of the earliest settlers and landholders at Coorparoo and sold some of his blocks in the boom year of 1888 as it began to emerge as a prestige suburb. He was a member of the Bulimba Divisional Board and for two years first chairman of the Coorparoo Shire Council, where he acted also as shire clerk in 1888-92. In 1886 he had been nominated to the Legislative Council, where he remained active until it was abolished in 1922; in 1893-1902 he was chairman of committees. His political views had gradually become more conservative since the Standard days, especially after the rise of the Labor Party, of which he was an uncompromising enemy. He vigorously opposed 'advanced' legislation and abolition of the Legislative Council. He became a fellow of the Royal Geographical Society of Australasia (Queensland). He maintained his interest in church life, served on church committees, made settlements on various Methodist institutions, giving them an annual income, and in his will left substantial sums to the Methodist Church.\n\nIn 1867 he married Elizabeth Watson, daughter of a store-keeper in Mansfield, Nottingham. She had left her position as headmistress of a large Wesleyan day school for girls at Bacup, Lancashire, and followed Brentnall to Sydney to marry him. She was the first president of the Queensland Women's Christian Temperance Union, holding office in 1885-99, and then honorary president until her death in 1909. Brentnall died in Brisbane on 11 January 1925, survived by two daughters: Flora, who in 1893 married Edgar Bridal Harris, a shipping agent, and Charlotte Amelia. He left substantial holdings in the Telegraph Newspaper Co. to his family, and his grandson later became chairman of directors."}, {"url": "https://www.howold.co/person/frederick-thomas-brentnall/biography", "page_content": "Frederick Thomas Brentnall Biography\n\nAustralian businessman and politician\n\nHon. Frederick Thomas Brentnall (17 June 1834 – 11 January 1925) was a Wesleyan preacher in New South Wales and a journalist, businessman and politician in Queensland, Australia. He was a Member of the Queensland Legislative Council.\n\nEarly life\n\nBrentnall was born at Riddings, Derbyshire and educated at Alfreton.\n\nReligious life\n\nBrentnall was sent by the British Wesleyan Conference to New South Wales in 1863 to join the ranks of the Wesleyan ministry in that colony. An affection of the throat, however, necessitated his resignation about 1883.\n\nBusiness life\n\nBrentnall then bought an interest in the Brisbane Telegraph, and joined the literary staff, becoming Chairman of the Company upon the retirement of the Hon. James Cowlishaw in Oct. 1885. Brentnall was a director of several companies, including the Queensland Deposit Bank and Building Society, and the Queensland General Insurance Company, Ltd.\n\nPolitics\n\nBrentnall was appointed a Member of the Queensland Legislative Council on 17 April 1886. Although a lifetime appointment, he held it until the abolition of the Council on 23 March 1922.\n\nBrentnall was also a member of the Coorparoo Shire Council and served as its chairman in 1888 and 1889.\n\nLater life\n\nBrentnall died in Brisbane in 1925 and was buried in Balmoral Cemetery. He was survived by two daughters: Flora (Mrs E. B. Harris) and Charlotte Amelia Brentnall. His daughter, Flora Harris would help convene the Women's War Memorial Committee in Brisbane, which was instrumental in fundraising to establish a fountain in Anzac Square, following WWI. This fountain which sits alongside the carved panel carved by Daphne Mayo, honoured the men who fell during WWI.\n\nReferences\n\n\n\n"}, {"url": "https://www.uq.edu.au/news/article/2010/07/familys-fourth-generation-uq", "page_content": "WHEN Joshua Keyes-Liley received his Bachelor of Arts this week, he was the fourth generation of his family to receive a degree from The University of Queensland.\n\nJoshua's UQ connections actually go back six generations, as his great-great-great-grandfather Frederick Thomas Brentnall was a member of the Queensland Legislative Council in 1910 when the University was established, and often spoke on education issues in the House.\n\nJoshua's great-great-grandmother Flora Harris - FT Brentnall's daughter - was a patron and founder of The Women's College.\n\nJosh's parents, grandmothers and one set of great-grandparents all gained UQ degrees.\n\nHis father, Bill Liley, a doctor at Cairns Base Hospital, has three UQ awards: a Bachelor of Physiotherapy (1983), a Diploma of Education Studies - Counselling (2004) and a Bachelor of Medicine/ Bachelor of Surgery (2008).\n\nDr Liley's mother Margaret Liley (née Price) received her UQ Bachelor of Science in 1957, a Diploma of Education in 1978 and a Bachelor of Education Studies in 1985.\n\nJosh's mother Mary Keyes, a Professor of Law at Griffith University, has two UQ degrees: Arts (1988) and Law (1993).\n\nProfessor Keyes' mother Lynette Keyes (née Denmead) gained her BA from UQ in 1959, and then went on to gain a Diploma of Education in 1960 and a Bachelor of Education in 1963.\n\nMrs Keyes' parents - Josh's great-grandparents - Noela Denmead (née Brentnall) and Alan Knox Denmead both had UQ Science degrees, specialising in Geology.\n\nJosh Keyes-Liley, 20, said there had been no family pressure for him to attend UQ, but it was a good choice.\n\n\"It wasn't a given - I just chose UQ,\" he said.\n\n\"It's been enjoyable and stimulating. It's been something I've really enjoyed and that I found challenging and interesting.\n\n\"In a Bachelor of Arts you don't have to worry about anything other than the pursuit of knowledge for its own sake.\"\n\nJosh did an extended major in Philosophy and a minor in the logic and philosophy of science, and will now go straight on to an Honours year at UQ.\n\nHis parents and grandmothers were at UQ yesterday to watch him graduate in a ceremony at the UQ Centre.\n\nIn the Great Court beforehand, Margaret Liley recalled that she began her UQ studies at George St in the city, and then became part of the first UQ cohort to study Physics in the Richards Building, one of the sandstone structures that makes up the Great Court.\n\nHis other grandmother, Lynette Keyes, is the daughter of the late Alan Denmead, who gained his BSc (Geology) from UQ in the late 1920s and his MSc (Geology) in the early 1930s. He started work in 1927 with the Queensland Government's Geological Survey and worked in locations around Queensland over the next 40 years.\n\nAK Denmead was Chief Government Geologist from 1956 until his retirement in 1967.\n\nThe Geological Society of Australia (Queensland Division) has run an annual AK Denmead Lecture since 1991, in recognition of his work that is widely acknowledged to have laid the foundations of Queensland's export coal industry.\n\nMrs Keyes said that when her parents were young newlyweds, her father was sent to work at Cracow in central Queensland, during \"the last Queensland gold rush\".\n\nHer mother Noela worked as his assistant in the field, but - in the midst of the Depression - the Government said it could not afford to pay her due to the tight financial conditions.\n\n\"Given that she also had a Geology degree, the Government got a very good deal - two for the price of one!\" Mrs Keyes said.\n\nMedia: Fiona Cameron, UQ Communications, ph 07 3346 7086"}, {"url": "https://www.womenaustralia.info/biogs/PR00177b.htm", "page_content": "Forceful, eminently capable and with fine organisational ability, Elizabeth Brentnall had been mistress of a large girl's school before her marriage. She was the daughter of a storekeeper in Mansfield, Nottingham. In 1867 she left her position as headmistress of the Wesleyan day school for girls at Bacup, Lancashire, and followed Frederick Thomas Brentnall to Sydney where they married.\n\nFrederick Brentnall, a moral extremist, opposed votes for women, except with the property qualification, which placed him in direct opposition to his wife's political ideology. Elizabeth and Frederick had two daughters; Flora, who in 1893 married Edgar Bridal Harris, a well established shipping agent, and Charlotte Amelia. Like her mother, Flora, was a confirmed suffragist and 'Y' organiser for the WCTU.\n\nSources used to compile this entry: Centenary of Queensland Women's Suffrage 2005, Who's Who in Brisbane 1900?, Centre for Research on Women, Gender, Culture and Social Change, School of EMSAH, The University of Queensland, St. Lucia, 2005, http://www.emsah.uq.edu.au/awsr/Act_Centenary/whoiswho.htm; Personal Correspondence with Elizabeth Brentnall's Biographer, John McCulloch."}, {"url": "https://www.findagrave.com/memorial/136472185/frederick-thomas-brentnall", "page_content": "Your suggestions have been submitted and will be reviewed by the memorial manager.\n\nYour edit did not contain any changes from the original.\n\nThank you! Your suggested merge has been submitted for review.\n\nYou are now the manager of this memorial.\n\nThanks for helping with Find a Grave! You may request to transfer up to 250,000 memorials managed by Find a Grave. more details You are nearing the transfer limit for memorials managed by Find a Grave. more details\n\nPhoto request sent successfully.\n\nPhoto Request successfully deleted.\n\nFailed to delete photo request. Try again later.\n\nMemorial Transfer Successful As manager of this memorial you can add or update the memorial using the Edit button below. Learn more about managing a memorial ."}, {"url": "https://www.australianculture.org/freedom-on-the-wallaby-henry-lawson/", "page_content": "[Editor: This is one of the most well-known poems written by Henry Lawson. It was quoted by conservative Queensland parliamentarians as an example of the radicalism of The Worker newspaper (see the “Editor’s notes” section below). Published in The Worker (Brisbane, Qld.), 16 May 1891.]\n\n\n\n\n\nFreedom on the Wallaby.\n\n(Written for the “Worker.”)\n\nAustralia’s a big country,\n\nAn’ Freedom’s humping bluey,\n\nAnd Freedom’s on the wallaby;\n\nOh don’t you hear ’er cooey?\n\nShe’s just begun to boomerang.\n\nShe’ll knock the tyrants silly,\n\nShe’s going to light another fire\n\nAnd boil another billy.\n\nOur fathers toiled for bitter bread\n\nWhile loafers thrived beside ’em,\n\nBut food to eat and clothes to wear,\n\nTheir native land denied ’em.\n\nAn’ so they left that native land,\n\nIn spite of their devotion,\n\nAn’ so they come, or if they stole,\n\nWere sent across the ocean.\n\nThen Freedom couldn’t stand the glare\n\nOf Royalty’s regalia.\n\nShe left the loafers where they were\n\nAn’ come out to Australia.\n\nBut now across the mighty main\n\nThe chains have come ter bind her,\n\nShe little thought to see again\n\nThe wrongs she left behind her.\n\nOur parents toiled to make a home,\n\nHard grubbin’ ’twas and clearin’,\n\nThey wasn’t crowded much with lords\n\nWhen they was pioneerin’.\n\nBut now that we have made the land\n\nA garden full of promise.\n\nOld Greed must crook ’is dirty hand\n\nAn’ come ter take it from us.\n\nSo we must fly a rebel flag,\n\nAs others did before us,\n\nAnd we must sing a rebel song\n\nAnd join in rebel chorus.\n\nWe’ll make the tyrants feel the sting\n\nO’ those that they would throttle;\n\nThey needn’t say the fault is ours,\n\nIf blood should stain the wattle.\n\nHenry Lawson.\n\nBrisbane, May, 1891.\n\n\n\n\n\n\n\n\n\nSource:\n\nThe Worker (Brisbane, Qld.), Saturday 16 May 1891, page 8\n\nAlso published in:\n\nThe Worker (Sydney, NSW), 29 September 1894, p. 1\n\nThe Worker (Brisbane, Qld.), 7 September 1922, p. 4\n\nEditor’s notes:\n\n[Editor: Corrected title of poem “Freeeom on the Wallaby” to “Freedom on the Wallaby”.]\n\nThe Worker’s publication of the poem was later quoted against it by two Queensland parliamentarians, Frederick Thomas Brentnall (MLC) in 1891 and by John James Kingsbury (MLA) in 1896, as a proof of the paper’s radicalism.\n\nThe Brisbane Courier (15 July 1891) reported on Frederick Brentnall’s speech in the Queensland parliament:\n\nMr. Brentnall quoted extracts from the official organ of the Australian Labour Federation (The Worker) to show what kind of influences had been brought to bear upon the working classes, to make them rise in arms against their employers.\n\nThe Brisbane Courier (7 March 1896) reported on an election speech of John Kingsbury at the Centennial Hall in Brisbane:\n\nKingsbury, who was the first speaker, was well received. He said: . . . It may not be out of place to refer to the methods previously advocated by the “Worker” for settling wages disputes in Queensland. I will take one extract from a hundred. “Worker,” 16th May, 1891: “So we must fly a rebel flag,\n\nAs others did before us,\n\nAnd we must sing a rebel song,\n\nAnd join in rebel chorus. We’ll make the tyrants feel the sting\n\nO’ those that they would throttle;\n\nThey needn’t say the fault is ours,\n\nIf blood should stain the wattle.” (Hear, hear, and applause.)\n\nSome years later, The Worker (27 February 1940) reported on Brentnall’s mention of Henry Lawson’s poem in the Queensland parliament:\n\nThe politician who objected to the stirring words in “Freedom on the Wallaby” was none other than Mr. F. T. Brentnall, a journalist and one time editor of the “Telegraph,” . . . Brentnall’s reference to “The Worker,” in which was published “Freedom on the Wallaby,” was during a debate on a motion brought before the Legislative Council on July 14, 1891 . . . Brentnall said: “I am not going to trouble the House much longer, and I will vary the entertainment slightly: “Our parents toiled to make a home.\n\nHard grubbin’ ’twas and clearin’.\n\nThey wasn’t crowded much with lords\n\nWhen they was pioneerin’.\n\nBut now that we have made the land\n\nA garden full of promise.\n\nOld Greed must crook ’is dirty hand\n\nAn’ come ter take it from us. So we must fly a rebel flag.\n\nAs others did before us.\n\nAnd we must sing a rebel song\n\nAnd join in rebel chorus,\n\nWe’ll make the tyrants feel the sting\n\nO’ those that they would throttle;\n\nThey needn’t say the fault is ours\n\nIf blood should stain the wattle.”\n\n— Henry Lawson. That was written in Brisbane. I had a little more poetry marked, quite as entertaining, perhaps even more so; but I have lost the run of it. They are rather fond of poetry in this periodical. I have brought this specially before your attention in order that you may see the agencies that have been at work to produce the result which has evoked from us this afternoon a vote of thanks which, there cannot be a shadow of a doubt, will be unanimously accorded to the Defence Force and the volunteers and police who have been called out and who have obeyed with alacrity the call of duty to put down this insurrection, the outbreak of which cannot give any one of us the least surprise after reading and reflecting upon the extracts I have read.\n\nReferences:\n\n“Parliament. Tuesday, July 14”, The Brisbane Courier (Brisbane, Qld.), Wednesday 15 July 1891, page 6\n\n“North Brisbane. Messrs. Kingsbury and Byrnes. Speeches at the Centennial Hall”, The Brisbane Courier (Brisbane, Qld.), Saturday 7 March 1896, page 6, column 2 (part of a section of the newspaper on the “General Election”)\n\n“Henry Lawson — The Industrial Rebel”, The Worker (Brisbane, Qld.), Tuesday 27 February 1940, page 10\n\n“Former Members Register”, Queensland Parliament (accessed 12 November 2011)"}, {"url": "https://prabook.com/web/frederick.brentnall/2450076", "page_content": "Frederick Brentnall\n\npolitician\n\nJune 17, 1834 (age 90)\n\nHonorary Brentnall was sent by the British Wesleyan Conference to New South Wales in 1863 to join the ranks of the Wesleyan ministry in that colony. An affection of the throat, however, necessitated his resignation about 1883. Brentnall then bought an interest in the Brisbane Telegraph, and joined the literary staff, becoming Chairman of the Company upon the retirement of the Honorary James Cowlishaw in October 1885. Brentnall was a director of several companies, including the Queensland Deposit Bank and Building Society, and the Queensland General Insurance Company, Limited. Although a lifetime appointment, he held it until the abolition of the Council on 23 March 1922. Brentnall died in Brisbane in 1925 and was buried in Balmoral Cemetery. He was survived by two daughters: Flora and Charlotte Amelia."}, {"url": "https://peoplepill.com/people/frederick-thomas-brentnall/", "page_content": "Hon. Frederick Thomas Brentnall (17 June 1834 – 11 January 1925) was a Wesleyan preacher in New South Wales and a journalist, businessman and politician in Queensland, Australia. He was a Member of the Queensland Legislative Council.\n\nEarly life\n\nBrentnall was born at Riddings, Derbyshire and educated at Alfreton.\n\nReligious life\n\nBrentnall was sent by the British Wesleyan Conference to New South Wales in 1863 to join the ranks of the Wesleyan ministry in that colony. An affection of the throat, however, necessitated his resignation about 1883.\n\nBusiness life\n\nBrentnall then bought an interest in the Brisbane Telegraph, and joined the literary staff, becoming Chairman of the Company upon the retirement of the Hon. James Cowlishaw in Oct. 1885. Brentnall was a director of several companies, including the Queensland Deposit Bank and Building Society, and the Queensland General Insurance Company, Ltd.\n\nPolitics\n\nBrentnall was appointed a Member of the Queensland Legislative Council on 17 April 1886. Although a lifetime appointment, he held it until the abolition of the Council on 23 March 1922.\n\nBrentnall was also a member of the Coorparoo Shire Council and served as its chairman in 1888 and 1889.\n\nLater life\n\nBrentnall died in Brisbane in 1925 and was buried in Balmoral Cemetery. He was survived by two daughters: Flora (Mrs E. B. Harris) and Charlotte Amelia Brentnall. His daughter, Flora Harris would help convene the Women's War Memorial Committee in Brisbane, which was instrumental in fundraising to establish a fountain in Anzac Square, following WWI. This fountain which sits alongside the carved panel carved by Daphne Mayo, honoured the men who fell during WWI."}, {"url": "https://www.hunker.com/13722013/influential-figures-arts-and-crafts-movement", "page_content": "The arts and crafts movement touched everything from furniture to architecture to jewelry, under the overarching philosophy that the handmade object was of utmost importance — even with new technological advancements. The movement didn't necessarily encompass one style, but it did have far-reaching effects. Take, for instance, the Craftsman-style house — a direct result of the movement coming to the U.S.\n\nAdvertisement\n\nAs independent scholar Monica Obniski writes for the Metropolitan Museum of Art, the movement's designers wanted to \"create an environment in which beautiful and fine workmanship governed.\" In order to drive home this ethos, many of the era's most iconic figures not only designed items, they also became part of collectives and exhibitions that shone a spotlight on this work.\n\nVideo of the Day\n\nHere are just a few of the most important figures from the arts and crafts movement:\n\n1. William Morris\n\nMost major histories of the arts and crafts movement name one key figure: William Morris. Born in 1834 in East London, Morris spearheaded the resistance to mass-produced items. Along with a few other influential figures — like mathematician Charles Faulkner and civil engineer Peter Paul Marshall — Morris helped found the firm and interiors company Morris, Marshall, Faulkner & Co. It later became Morris & Company, and Morris continued on a prolific streak. He designed everything from rugs to tapestries to wallpaper designs. His writing also focused on the importance of handicrafts.\n\nAdvertisement\n\n2. M.H. Baillie Scott\n\nManxman Pianoforte designed by Mackay Hugh Baillie Scott Image Credit: Wikimedia Commons / Sailko\n\nAccording to the Victoria and Albert Museum, Mackay Hugh Baillie Scott believed that \"furniture should appear to grow out of the requirements of the room.\" Born in 1865, he contributed to the arts and crafts movement as both an architect and designer. One of his most famous architectural projects: the Blackwell House, originally designed as a holiday home. Located in Cumbria, England, the house includes details like carved stone, mosaic floors, wall hangings, and plaster work, according its official site. It is currently open to the public.\n\nAdvertisement\n\nAdvertisement\n\n3. May Morris\n\nWhile William Morris dominates most conversations about the history of the arts and crafts movement, his daughter May Morris made some important contributions as well. Born in 1862, she studied at the National Art Training School and joined Morris and Company at 23 years old, according to Thames & Hudson. In fact, the \"Honeysuckle\" wallpaper pattern, often attributed to William, is her design. In 1896, May struck out on her own and started an embroidery workshop; she also exhibited her work through the Arts and Crafts Exhibition Society. In 1907, she founded the Women's Guild of Arts.\n\nAdvertisement\n\n4. C.F.A. Voysey\n\nBlock-printed silk textile by Charles Francis Annesley Voysey Image Credit: Wikimedia Commons / Los Angeles County Museum of Art\n\nArchitect and designer Charles Francis Annesley Voysey (a.k.a. C.F.A. Voysey) created everything from wallpapers to fabrics to homes. Born in 1857, he often used stylized nature patterns in his work. While there are debates about which era or style he fits into specifically, it's still worth noting his contributions to the arts and crafts era. While he often stuck to traditionalist design values, his focus on simple yet impactful design particularly influenced the next generation of architects.\n\nAdvertisement\n\n5. Susan Stuart Frackelton\n\nStoneware jar by Susan Stuart Frackelton Image Credit: Wikimedia Commons / Metropolitan Museum of Art\n\nSusan Stuart Frackelton helped to elevate the medium of ceramics as part of the arts and crafts movement. Born in 1848, she made her mark through her pained china and stoneware pieces — as well as her patents for a portable gas kiln. She encouraged other makers by founding the Milwaukee Artist's Association in 1887, creating the National League of Mineral Painters in 1892, and publishing the highly praised handbook Tried by Fire: A Work on China-Painting. Her work earned her numerous awards.\n\nAdvertisement\n\nAdvertisement\n\n6. Gustav Stickley\n\nArmchair by Gustav Stickley, circa 1907-1913. Image Credit: Wikimedia Commons / Metropolitan Museum of Art\n\nYou'll often hear the name Gustav Stickley in histories of the arts and crafts movement, particularly in the U.S. Born in 1858, Stickley made an impact not only as a furniture designer but also as a thinker. A trip to Europe in 1895 influenced his own design and sparked his motivation to bring the arts and crafts attitude of simplicity to the States. He started the magazine The Craftsman in 1901; over the years it covered topics like gardening, political issues, and city planning. Looking back at Stickley's work and issues of the magazine creates a fuller picture of the arts and crafts in the U.S.\n\nAdvertisement\n\n7. Charles Robert Ashbee\n\nCovered bowl by Charles Robert Ashbee. Image Credit: Wikimedia Commons / Daderot\n\nBorn in 1863, Charles Robert Ashbee embodied the arts and crafts movement's values of returning to a pre-industrialization craftsmanship. He founded the Guild of Handicraft in 1888 and it exhibited work everywhere from Vienna to Munich to England. The guild — and Ashbee — focused on metalwork, copper, and ironwork (as well as furniture). Ashbee often lectured on the importance of handicrafts; his contributions inspired the next generation of designers.\n\nAdvertisement\n\n8. Charles Rohlfs\n\nCharles Rohlfs designed stove parts while also working as an actor, eventually focusing on furniture design. Born in 1853, he exhibited his work across the United States and Europe. His furniture pieces won the praise of writers during the era for their artistic flourishes. Rohlfs drew inspiration from Asian art, art noveau style, and American architecture, to name a few. His work was praised again in 2009 with the traveling retrospective exhibition \"The Artistic Furniture of Charles Rohlfs.\"\n\nAdvertisement\n\nAdvertisement\n\n9. William Arthur Smith Benson\n\nCoffee pot designed by William Arthur Smith Benson Image Credit: Wikimedia Commons / Daderot\n\nWilliam Arthur Smith Benson (a.k.a. W.A.S. Benson) made a name for himself through his metalwork pieces. Born in 1858, he started his own workshop in 1880 and opened a shop in 1887. His innovative thinking led to impactful designs for both candles and electric light, according to Cooper Hewitt Design Museum. Benson contributed to the arts and crafts movement as a founding member of the Art Workers' Guild; he also made important efforts towards the creation of the Arts and Crafts Exhibition Society.\n\n10. Charles and Henry Greene\n\nThe Gamble House in Pasadena, California. Image Credit: Wikimedia Commons / Mr. Exuberance\n\nWhen discussing the Craftsman style, the American brand of the arts and crafts movement, two important architects come to mind: brothers Charles and Henry Greene. Born in 1868 and 1870, respectively, the brothers started their careers by studying fields like woodworking. Around the 1890s, they started their own firm — Greene & Greene in Pasadena, California. Their iconic projects include the Gamble House in Pasadena, officially a National Historic Landmark.\n\nAdvertisement"}, {"url": "https://popularbio.com/frederick-thomas-brentnall/", "page_content": "Updated On April 30, 2023\n\nFrederick Thomas Brentnall estimated Net Worth, Biography, Age, Height, Dating, Relationship Records, Salary, Income, Cars, Lifestyles & many more details have been updated below. Let’s check, How Rich is Frederick Thomas Brentnall in 2020-2022? Scroll below and check more details information about Current Net worth as well as Monthly/Year Salary, Expense, Income Reports!\n\nBiography\n\nFrederick Thomas Brentnall was born in Riddings, Derbyshire, England on June 17, 1834.\n\nOn Popular Bio, Frederick Thomas Brentnall is one of the successful Politician. Frederick has ranked on the list of those famous people who were born on June 17, 1834. Frederick Thomas Brentnall is one of the Richest Politician who was born in Australia. Frederick Thomas Brentnall also has a position among the list of Most popular Politician.\n\nShort Profile First Name Frederick Last Name Brentnall Profession Politician Died 90 years (age at death) Birth Sign Gemini Birth Date June 17, 1834 Birth Place Riddings, Derbyshire, England Country Australia\n\nFrederick Thomas Brentnall Net Worth\n\nFrederick Thomas Brentnall estimated Net Worth, Salary, Income, Cars, Lifestyles & many more details have been updated below. Let’s check, How Rich is Frederick Thomas Brentnall in 2020-2022?\n\nAccording to Wikipedia, Forbes, IMDb & Various Online resources, famous Politician Frederick Thomas Brentnall’s net worth is $1-5 Million before died. Frederick Thomas Brentnall earned the money being a professional Politician. Frederick Thomas Brentnall is from Australia.\n\nFrederick Thomas Brentnall’s Net Worth:\n\n$1-5 Million\n\nEstimated Net Worth in 2022 $1-$3million Previous Year’s Net Worth (2020) Under Review Annual Salary Under Review. Income Source Primary Income source Politician (profession). Net Worth Verification Status Not Verified\n\nAge, Height & Body Measurements\n\nFrederick Thomas Brentnall has been died on 90 years (age at death). Frederick Thomas Brentnall’s height Unknown & weight Not Available right. Full body measurements, dress & shoe size will be updated soon.\n\nWho is Frederick Thomas Brentnall Dating?\n\nFrederick Thomas Brentnall keeps his personal and love life private. Check back often as we will continue to update this page with new relationship details. Let’s take a look at Frederick Thomas Brentnall past relationships, ex-girlfriends and previous hookups. Frederick Thomas Brentnall prefers not to tell the details of marital status & divorce.\n\nDating is to describe a stage in a person’s life when he or she is actively pursuing romantic relationships with different people. If two unmarried celebrities are seen in public together, they are often described as “dating” which means they were seen in public together, and it is not clear whether they are merely friends, exploring a more intimate relationship, or are romantically involved.\n\nFacts About Frederick Thomas Brentnall"}]}