{"Frederick Thomas Brentnall was a member of the Birmingham Artisans' Guild, Birmingham Architectural Association, and Royal Institute of British Architects.": [{"url": "https://adb.anu.edu.au/biography/brentnall-frederick-thomas-3050", "page_content": "by Ronald Lawson\n\nFrederick Thomas Brentnall (1834-1925), Wesleyan minister, journalist, company director and politician, was born on 17 June 1834 at Riddings, Derbyshire, England, eldest of the twelve children of George Brentnall, builder, and his wife Mary, née Clarke. He was educated at an endowed school in Alfreton, near Derby. He entered business in Ripley, Derbyshire, but in 1863 was sent to join the Wesleyan Conference of New South Wales and Queensland. After serving on several circuits in New South Wales, in April 1873 he joined the Brisbane circuit, where he quickly made an impact as a forceful and eloquent preacher. He became chairman of the Queensland district, where he was prominent in the formation of a strong loan fund which was to prove important in extending Wesleyan Methodist work in Queensland. He served also in the circuits of Fortitude Valley and Ipswich, and at the Ann Street Church in Brisbane, before a throat infection forced him to retire from the ministry in 1883.\n\nIn 1875, towards the climax of the education controversy in Queensland, Brentnall was instrumental with three other clergymen in establishing the Queensland Evangelical Standard, a journal dedicated to a system of secular education, and thus anti-Catholic in tone. Viewing the 'squatting party' as allies of the Catholics, the Standard adopted a clear political posture, championed the cause of (Sir) Samuel Griffith, a Liberal and son of a Congregational cleric, and poured invective on 'Land Rings and Railway Kings'. Brentnall used his pen with telling effect against the McIlwraith ministry in its handling of the steel rails contract of 1881 and soon afterwards of the land-grant railway proposal.\n\nBrentnall's activity in the business world seems to have been recognized as early as 1881. The Daily Observer, 28 February, openly attacked him in an advertisement: 'Wanted for the Christian Ministry … Special advantages are now offered to worldly-minded men to join the ranks … Men of business turn of mind specially eligible for this ministry, and always come to the front. “Fervency of spirit” not at all necessary. Shareholders in gold mines, tin mines, newspaper companies, land speculating, and such like heavenly pastures, will always be accepted as specially qualified'. The Standard, smarting under the sarcasm, responded so sharply that its reply led to a libel case. On his retirement from the church Brentnall joined the Telegraph, in which he was a minor shareholder, as a journalist. In 1885 he greatly increased his holdings in the company and became chairman of directors, a position he retained until May 1893, after which he continued to hold a large financial interest. He became increasingly active in business affairs, his directorships included the Queensland Deposit Bank and Building Society, and the Queensland Trustees (later becoming chairman of directors of both companies), Queensland General Insurance, Finney Isles, Coolgarra Tin Mining, Queensland Exploration and Queensland Copper Freeholds. He speculated widely, sometimes successfully, sometimes disastrously, in Queensland mining ventures. He was one of the earliest settlers and landholders at Coorparoo and sold some of his blocks in the boom year of 1888 as it began to emerge as a prestige suburb. He was a member of the Bulimba Divisional Board and for two years first chairman of the Coorparoo Shire Council, where he acted also as shire clerk in 1888-92. In 1886 he had been nominated to the Legislative Council, where he remained active until it was abolished in 1922; in 1893-1902 he was chairman of committees. His political views had gradually become more conservative since the Standard days, especially after the rise of the Labor Party, of which he was an uncompromising enemy. He vigorously opposed 'advanced' legislation and abolition of the Legislative Council. He became a fellow of the Royal Geographical Society of Australasia (Queensland). He maintained his interest in church life, served on church committees, made settlements on various Methodist institutions, giving them an annual income, and in his will left substantial sums to the Methodist Church.\n\nIn 1867 he married Elizabeth Watson, daughter of a store-keeper in Mansfield, Nottingham. She had left her position as headmistress of a large Wesleyan day school for girls at Bacup, Lancashire, and followed Brentnall to Sydney to marry him. She was the first president of the Queensland Women's Christian Temperance Union, holding office in 1885-99, and then honorary president until her death in 1909. Brentnall died in Brisbane on 11 January 1925, survived by two daughters: Flora, who in 1893 married Edgar Bridal Harris, a shipping agent, and Charlotte Amelia. He left substantial holdings in the Telegraph Newspaper Co. to his family, and his grandson later became chairman of directors."}, {"url": "https://peopleaustralia.anu.edu.au/biography/brentnall-frederick-thomas-3050", "page_content": "Aboriginal and Torres Strait Islander people should be aware that this website contains names, images, and voices of deceased persons.\n\nIn addition, some articles contain terms or views that were acceptable within mainstream Australian culture in the period in which they were written, but may no longer be considered appropriate.\n\nThese articles do not necessarily reflect the views of The Australian National University.\n\nOlder articles are being reviewed with a view to bringing them into line with contemporary values but the original text will remain available for historical context."}, {"url": "https://www.howold.co/person/frederick-thomas-brentnall/biography", "page_content": "Frederick Thomas Brentnall Biography\n\nAustralian businessman and politician\n\nHon. Frederick Thomas Brentnall (17 June 1834 – 11 January 1925) was a Wesleyan preacher in New South Wales and a journalist, businessman and politician in Queensland, Australia. He was a Member of the Queensland Legislative Council.\n\nEarly life\n\nBrentnall was born at Riddings, Derbyshire and educated at Alfreton.\n\nReligious life\n\nBrentnall was sent by the British Wesleyan Conference to New South Wales in 1863 to join the ranks of the Wesleyan ministry in that colony. An affection of the throat, however, necessitated his resignation about 1883.\n\nBusiness life\n\nBrentnall then bought an interest in the Brisbane Telegraph, and joined the literary staff, becoming Chairman of the Company upon the retirement of the Hon. James Cowlishaw in Oct. 1885. Brentnall was a director of several companies, including the Queensland Deposit Bank and Building Society, and the Queensland General Insurance Company, Ltd.\n\nPolitics\n\nBrentnall was appointed a Member of the Queensland Legislative Council on 17 April 1886. Although a lifetime appointment, he held it until the abolition of the Council on 23 March 1922.\n\nBrentnall was also a member of the Coorparoo Shire Council and served as its chairman in 1888 and 1889.\n\nLater life\n\nBrentnall died in Brisbane in 1925 and was buried in Balmoral Cemetery. He was survived by two daughters: Flora (Mrs E. B. Harris) and Charlotte Amelia Brentnall. His daughter, Flora Harris would help convene the Women's War Memorial Committee in Brisbane, which was instrumental in fundraising to establish a fountain in Anzac Square, following WWI. This fountain which sits alongside the carved panel carved by Daphne Mayo, honoured the men who fell during WWI.\n\nReferences\n\n\n\n"}, {"url": "https://peoplepill.com/people/frederick-thomas-brentnall/", "page_content": "Hon. Frederick Thomas Brentnall (17 June 1834 – 11 January 1925) was a Wesleyan preacher in New South Wales and a journalist, businessman and politician in Queensland, Australia. He was a Member of the Queensland Legislative Council.\n\nEarly life\n\nBrentnall was born at Riddings, Derbyshire and educated at Alfreton.\n\nReligious life\n\nBrentnall was sent by the British Wesleyan Conference to New South Wales in 1863 to join the ranks of the Wesleyan ministry in that colony. An affection of the throat, however, necessitated his resignation about 1883.\n\nBusiness life\n\nBrentnall then bought an interest in the Brisbane Telegraph, and joined the literary staff, becoming Chairman of the Company upon the retirement of the Hon. James Cowlishaw in Oct. 1885. Brentnall was a director of several companies, including the Queensland Deposit Bank and Building Society, and the Queensland General Insurance Company, Ltd.\n\nPolitics\n\nBrentnall was appointed a Member of the Queensland Legislative Council on 17 April 1886. Although a lifetime appointment, he held it until the abolition of the Council on 23 March 1922.\n\nBrentnall was also a member of the Coorparoo Shire Council and served as its chairman in 1888 and 1889.\n\nLater life\n\nBrentnall died in Brisbane in 1925 and was buried in Balmoral Cemetery. He was survived by two daughters: Flora (Mrs E. B. Harris) and Charlotte Amelia Brentnall. His daughter, Flora Harris would help convene the Women's War Memorial Committee in Brisbane, which was instrumental in fundraising to establish a fountain in Anzac Square, following WWI. This fountain which sits alongside the carved panel carved by Daphne Mayo, honoured the men who fell during WWI."}, {"url": "https://alchetron.com/Frederick-Thomas-Brentnall", "page_content": "Hon. Frederick Thomas Brentnall (17 June 1834 – 11 January 1925) was a Wesleyan preacher in New South Wales and a journalist, businessman and politician in Queensland, Australia. He was a Member of the Queensland Legislative Council.\n\nEarly life\n\nBrentnall was born at Riddings, Derbyshire and educated at Alfreton.\n\nReligious life\n\nBrentnall was sent by the British Wesleyan Conference to New South Wales in 1863 to join the ranks of the Wesleyan ministry in that colony. An affection of the throat, however, necessitated his resignation about 1883.\n\nBusiness life\n\nBrentnall then bought an interest in the Brisbane Telegraph, and joined the literary staff, becoming Chairman of the Company upon the retirement of the Hon. James Cowlishaw in Oct. 1885. Brentnall was a director of several companies, including the Queensland Deposit Bank and Building Society, and the Queensland General Insurance Company, Ltd.\n\nPolitics\n\nBrentnall was appointed a Member of the Queensland Legislative Council on 17 April 1886. Although a lifetime appointment, he held it until the abolition of the Council on 23 March 1922.\n\nBrentnall was also a member of the Coorparoo Shire Council and served as its chairman in 1888 and 1889.\n\nLater life\n\nBrentnall died in Brisbane in 1925 and was buried in Balmoral Cemetery. He was survived by two daughters: Flora (Mrs E. B. Harris) and Charlotte Amelia Brentnall. His daughter, Flora Harris would help convene the Women's War Memorial Committee in Brisbane, which was instrumental in fundraising to establish a fountain in Anzac Square, following WWI. This fountain which sits alongside the carved panel carved by Daphne Mayo, honoured the men who fell during WWI."}, {"url": "https://www.findagrave.com/memorial/136472185/frederick-thomas-brentnall", "page_content": "Your suggestions have been submitted and will be reviewed by the memorial manager.\n\nYour edit did not contain any changes from the original.\n\nThank you! Your suggested merge has been submitted for review.\n\nYou are now the manager of this memorial.\n\nThanks for helping with Find a Grave! You may request to transfer up to 250,000 memorials managed by Find a Grave. more details You are nearing the transfer limit for memorials managed by Find a Grave. more details\n\nPhoto request sent successfully.\n\nPhoto Request successfully deleted.\n\nFailed to delete photo request. Try again later.\n\nMemorial Transfer Successful As manager of this memorial you can add or update the memorial using the Edit button below. Learn more about managing a memorial ."}, {"url": "https://popularbio.com/frederick-thomas-brentnall/", "page_content": "Updated On April 30, 2023\n\nFrederick Thomas Brentnall estimated Net Worth, Biography, Age, Height, Dating, Relationship Records, Salary, Income, Cars, Lifestyles & many more details have been updated below. Let’s check, How Rich is Frederick Thomas Brentnall in 2020-2022? Scroll below and check more details information about Current Net worth as well as Monthly/Year Salary, Expense, Income Reports!\n\nBiography\n\nFrederick Thomas Brentnall was born in Riddings, Derbyshire, England on June 17, 1834.\n\nOn Popular Bio, Frederick Thomas Brentnall is one of the successful Politician. Frederick has ranked on the list of those famous people who were born on June 17, 1834. Frederick Thomas Brentnall is one of the Richest Politician who was born in Australia. Frederick Thomas Brentnall also has a position among the list of Most popular Politician.\n\nShort Profile First Name Frederick Last Name Brentnall Profession Politician Died 90 years (age at death) Birth Sign Gemini Birth Date June 17, 1834 Birth Place Riddings, Derbyshire, England Country Australia\n\nFrederick Thomas Brentnall Net Worth\n\nFrederick Thomas Brentnall estimated Net Worth, Salary, Income, Cars, Lifestyles & many more details have been updated below. Let’s check, How Rich is Frederick Thomas Brentnall in 2020-2022?\n\nAccording to Wikipedia, Forbes, IMDb & Various Online resources, famous Politician Frederick Thomas Brentnall’s net worth is $1-5 Million before died. Frederick Thomas Brentnall earned the money being a professional Politician. Frederick Thomas Brentnall is from Australia.\n\nFrederick Thomas Brentnall’s Net Worth:\n\n$1-5 Million\n\nEstimated Net Worth in 2022 $1-$3million Previous Year’s Net Worth (2020) Under Review Annual Salary Under Review. Income Source Primary Income source Politician (profession). Net Worth Verification Status Not Verified\n\nAge, Height & Body Measurements\n\nFrederick Thomas Brentnall has been died on 90 years (age at death). Frederick Thomas Brentnall’s height Unknown & weight Not Available right. Full body measurements, dress & shoe size will be updated soon.\n\nWho is Frederick Thomas Brentnall Dating?\n\nFrederick Thomas Brentnall keeps his personal and love life private. Check back often as we will continue to update this page with new relationship details. Let’s take a look at Frederick Thomas Brentnall past relationships, ex-girlfriends and previous hookups. Frederick Thomas Brentnall prefers not to tell the details of marital status & divorce.\n\nDating is to describe a stage in a person’s life when he or she is actively pursuing romantic relationships with different people. If two unmarried celebrities are seen in public together, they are often described as “dating” which means they were seen in public together, and it is not clear whether they are merely friends, exploring a more intimate relationship, or are romantically involved.\n\nFacts About Frederick Thomas Brentnall"}, {"url": "https://prabook.com/web/frederick.brentnall/2450076", "page_content": "Frederick Brentnall\n\npolitician\n\nJune 17, 1834 (age 90)\n\nHonorary Brentnall was sent by the British Wesleyan Conference to New South Wales in 1863 to join the ranks of the Wesleyan ministry in that colony. An affection of the throat, however, necessitated his resignation about 1883. Brentnall then bought an interest in the Brisbane Telegraph, and joined the literary staff, becoming Chairman of the Company upon the retirement of the Honorary James Cowlishaw in October 1885. Brentnall was a director of several companies, including the Queensland Deposit Bank and Building Society, and the Queensland General Insurance Company, Limited. Although a lifetime appointment, he held it until the abolition of the Council on 23 March 1922. Brentnall died in Brisbane in 1925 and was buried in Balmoral Cemetery. He was survived by two daughters: Flora and Charlotte Amelia."}, {"url": "https://adb.anu.edu.au/lifesummary/brentnall-frederick-thomas-3050", "page_content": "Aboriginal and Torres Strait Islander people should be aware that this website contains names, images, and voices of deceased persons.\n\nIn addition, some articles contain terms or views that were acceptable within mainstream Australian culture in the period in which they were written, but may no longer be considered appropriate.\n\nThese articles do not necessarily reflect the views of The Australian National University.\n\nOlder articles are being reviewed with a view to bringing them into line with contemporary values but the original text will remain available for historical context."}, {"url": "https://www.ancestry.com/genealogy/records/frederick-thomas-brentnall-24-gky176", "page_content": "This database contains family trees submitted to Ancestry by users who have indicated that their tree can be viewed by all Ancestry subscribers.These trees can change over time as users edit, remove, or otherwise modify the data in their trees. You can contact the owner of the tree to get more information.\n\nPrivate Member Trees\n\nThis database contains family trees submitted to Ancestry by users who have indicated that their tree can only be viewed by Ancestry members to whom they have granted permission to see their tree.These trees can change over time as users edit, remove, or otherwise modify the data in their trees. If you would like to view one of these trees in its entirety, you can contact the owner of the tree to request permission to see the tree."}]}