{"Frederick Thomas Brentnall designed a wide range of buildings including churches, schools, factories, warehouses, offices, shops, and private residences.": [{"url": "https://prabook.com/web/frederick.brentnall/2450076", "page_content": "Frederick Brentnall\n\npolitician\n\nJune 17, 1834 (age 90)\n\nHonorary Brentnall was sent by the British Wesleyan Conference to New South Wales in 1863 to join the ranks of the Wesleyan ministry in that colony. An affection of the throat, however, necessitated his resignation about 1883. Brentnall then bought an interest in the Brisbane Telegraph, and joined the literary staff, becoming Chairman of the Company upon the retirement of the Honorary James Cowlishaw in October 1885. Brentnall was a director of several companies, including the Queensland Deposit Bank and Building Society, and the Queensland General Insurance Company, Limited. Although a lifetime appointment, he held it until the abolition of the Council on 23 March 1922. Brentnall died in Brisbane in 1925 and was buried in Balmoral Cemetery. He was survived by two daughters: Flora and Charlotte Amelia."}, {"url": "https://trove.nla.gov.au/newspaper/article/85903691", "page_content": "; Coorparoo. The deceased gentleman expired\n\nat 9 o'clock, after an illness of seven weeks.\n\nHe was aged 90 years and six months. At\n\nthe special request of deceased the funeral,\n\nwhich, took place this . afternoon, was con- ?\n\n??'.-' fined to members of the family and person\n\n?','.. al friends, the interment taking place at the\n\nMorningside' Cemetery, Bulimba. His ca\n\nreer was a distinguished one, divided be\n\ntween service to ? the Church and to the\n\n- State. :\n\nThe Horn. Frederick Thomas Brentnall,\n\nWho was the son of the late Mr. and Mrs.\n\nGeorge' Brentnall, of Reddings, in Derby\n\nshire, was born on June 17, 1834.- His fa\n\nther was a builder, and he was educated at\n\nAlfreton,. also in Derbyshire. He. was the\n\neldest of 12 children, and his father also was\n\nthe eldest of 12. After leaving school he\n\nresided at Bishop Auckland, in Durham\n\nshire, and later was engaged in business at\n\n'Ripley, in Derbyshire, until he entered the\n\nWesleyan ministry. In 1863, when in his\n\n29th year, he and nine other young m'en\n\nwere sent by the British Wesleyan cOnfe\n\nence to. New South Wales to . strengthen t'!e\n\nministerial ranks of that denomination and\n\nhe ?arrived in Sydney in October, 1863. In\n\n1867 he was married to Miss Elizabeth Wat\n\nson, of Mansfield, Nottingham, who had held\n\nthe position of head mistress of a large\n\nWesleyan day .school for girls at Bacup,\n\n.?in Lancashire, and went' to Sydney to be\n\nmarried. The Rev. F. T. Brentnall, six\n\nyears later, was appointed by the New\n\nSouth Wales conference to the Brisbane cir\n\ncuit, and he arrived in Brisbane with his\n\nWife and two young daughters on April IS,\n\n1873. Three years later he was transferred\n\nto the Fortitude Valley Circuit. His next\n\ncircuit was Ipswich, where he remained for\n\ntwo years. In 1875 he, with the late Revs.\n\n.. E. Griffith, Colin McCulloch and D. F. Mit\n\nchell promoted a religious weekly newspa\n\nper named the 'Evangelical Standard.' That\n\n. Was the time when the struggle between\n\nthe advocates^ of denominational and State\n\n. schools was at its height, the result being\n\nthat the present State system of education\n\nwas firmly established in Queensland. The\n\neditorial quartette abovenanied fought\n\nthroughout against .. denominationalism in\n\neducation. In 1883 Mr. Brentnall had to\n\nretire from the ministry, a throat affection\n\ncausing the failure of his voice. He left\n\nthe ministry with, a record of 20 years' good\n\nservice. He ? was a forceful and eloquent\n\n]:-re.acher, and in the 10 years of his min- .\n\nistry in Queensland he did much to free\n\nthe Churches of his district from the hind\n\nrance due to debt. In 1881 he joined the\n\nTelegraph Newspaper Company as business\n\n' manager and contributor. In 1885 on the\n\nretirement of the Hon. James Cowlishaw, he\n\nbecame managing director of*, the 'Tele-\n\ngraph' Newspaper Company, and he held\n\nthat position till 1893, when he withdrew\n\n? from all active participation in the com\n\npany's affairs. In 1887 he visited England\n\n. and attended, the jubilee thanksgiving ser\n\nvice in Westminster Abbey. He was the\n\nbearer of an address of loyalty from Queens\n\nland to Queen 'Victoria. There were two\n\n? important events in the history of Queens\n\nland in which Mr. Brentnall's facile but\n\ntrenchant pen was used with telling effect.\n\nThe first occurred in 1881, and was brought\n\nabout by what was known as the steel rails\n\nContract, in which the Ministry of the day\n\nwas allegedly involved. The other was\n\noccasioned by the late Sir Thomas M'll\n\nwraith's famous land grant railway propo-.\n\nsal, sarcastically termed ? the ' 'grid iron'\n\nrailway. On both- questions Mr. Brentnall\n\nWith his powerful, pen espoused the popu\n\nlar cause. On the 17th April, 1886 he was\n\nappointed a member of the Legislative\n\nCouncil, and in 1893 he was el\n\nected Chairman of Committees. , Three\n\nyears later he was re-elected to that po\n\nsition, ard again in 1899. Mr. Brentnall\n\ntor'- an active interest in local government,\n\nanc' was a member of the first Bulimba\n\nDr-'-ional Board. When shire councils\n\n?took. 'the place of divisional boards, he be\n\ncame a councillor of the Coorparoo Shire,\n\nin which he resided, and for two years was\n\n(president of that shire. He also was a\n\nmember of the executive council of the Fe\n\nderated Employers' Union of Queensland,\n\n' and was a fellow of the Royal Geographi\n\ncal Society of Australasia (Queensland). Mr,\n\nBrentnall also was extensively interested in\n\nthe mining industry of Queensland. In this\n\nregard it may be said that, though some of\n\nliis speculations wore profitable, many oth\n\ners were disastrous failures. ' During his\n\nlong life he held a large number of com\n\npany directorships, amongst them being the\n\nQueensland 'Deposit Bank and Building So\n\nciety, Queensland Trustees Limited, ? Cool -\n\ng'arra 'Tin Mining Co., and the Queensland\n\nCopper Freeholds (both British companies\n\nworking at Ckmcurry), the Queensland Mu\n\ntual Insurance Co., Finney, Isles, and Co.\n\nOn ''??- attainment of his SOth year in 1914\n\nlie : ' 'nified ? the event by making gifts to\n\nthe Methodist churches and organisations\n\nin Brisbane on the basis of 10/- and £1\n\nfor every year of his -age. The institutions\n\n??which benefited were the Methodist Homo"}, {"url": "https://chambers.com/lawyer/frederick-b-thomas-usa-5:32921", "page_content": "USA\n\nPractice Areas\n\nFritz Thomas represents clients in corporate governance and securities law matters and in a wide range of transactions. His corporate governance and securities law practice involves representing boards of directors, standing and special committees of boards of directors and management regarding a variety of corporate governance, securities and related matters, including compliance with federal securities laws, state corporate laws and stock exchange rules, as well as consideration of shareholder and other stakeholder relationships and the policies of proxy advisory firms. He provides advice both in ordinary course of business settings as well as in exceptional circumstances (e.g. situations involving possible changes of control, activist shareholder initiatives and possible changes to board or management composition). His transactional practice focuses on stock acquisitions, asset acquisitions, public and private mergers, tender offers, joint ventures, strategic alliances, financings, shareholder arrangements and various other transactions involving US, foreign and multinational corporations and other entities, both public and private."}, {"url": "https://www.coorparoohall.net.au/our-history", "page_content": "The Coorparoo School of Arts and Memorial Hall is a heritage listed community hall located on Cavendish Road, Coorparoo.\n\nThe Coorparoo School of Arts and RSL Memorial Hall was constructed in 1892 for the Coorparoo Shire Council. The Council remained in the building until October 1925, when amalgamation of local governments occurred and Greater Brisbane was created. Since 1925, it has been used as a School of Arts.\n\n​\n\nThe Divisional Boards Act 1879 established 74 local authorities in Queensland with Coorparoo administered as Subdivision 3 of the Bulimba Divisional Board. Primary concerns of the board included the maintenance and improvement of roads and bridges, the Bulimba ferry and water supply to river villages. In 1888 Coorparoo was represented on the Bulimba Divisional Board by Frederick Thomas Brentnall, Frederick Wecker and John Douglas. These men, along with other Coorparoo residents, claimed that more could be accomplished for the locality. They resigned from the Board and led demands for the creation of the Coorparoo Shire. The Shire of Coorparoo was proclaimed on 27 October 1888.\n\n​\n\nBy 1892 the Councillors decided that a Shire Hall was a necessity. Two allotments on the corner of Cavendish Road and Council (now Halstead) streets were purchased. Henry Wallace Atkinson, a local architect, designed the Hall and it was built by a Mr Allibone at a cost of £514, plus £78 for architect's fees and £14 for seating. The Council moved in on 7 October 1892.\n\n​\n\nConstructed with gas fittings for six lamps, the Hall was the first gas lit building in the Shire, further, the first telephone in the district was installed on 1 November 1892. The Hall was hired out as a social club and played an important role in the social life of the district. The Roll of Honour was unveiled by James Stodart, Member of the Queensland Legislative Assembly for Logan on 24 June 1916. The honour board is dedicated to the men and women of the District who served in the World War I.\n\n​\n\nWith the amalgamation of local government authorities and the establishment of Greater Brisbane in 1925, a new use was sought for the shire hall. Local residents organised to form a School of Arts committee and, in 1928, the Trustees of the School of Arts contracted to pay the Greater Brisbane City Council £1000.\n\n​\n\nIn 1930 the Trustees accepted the offer of the Avondale Lodge to build a side verandah on the north-west elevation. The Trustees paid £200 for the fabric. The new wing was officially opened by Trustee and politician Reginald King, the Member of the Queensland Legislative Assembly for Logan on 19 July 1930. In 1938, the stage was removed providing more space in the Hall and a small stage was constructed at the rear.\n\n​\n\nIn 1946, the Brisbane City Council began asking for payment of £750 which was owing on the purchase price of the hall, the alternative was to hand in the Hall's keys. Revenue was raised through a variety of activities, including renting the hall to the Coorparoo Kindergarten, and by 1948 the fund stood at over £550. It was also at this time that the Coorparoo RSL suggested that they take over the Hall and its debts. Solicitor King drew up a new constitution for the two groups and in April 1956, the Minister of Public Lands and Crown Law Office approved the amalgamation and constitution. The Hall was subsequently renamed the Coorparoo School of Arts and RSL Memorial Hall.\n\n​\n\nThe brick and stucco additions as the front of the Hall were initially rejected at a meeting of the School of Arts committee in December 1951, however, by July 1953, the Trustees' honorary architect, Eric Percival Trewern, had drawn up plans and specifications and called for tenders. Builder AA Lock's tender for £777 was accepted.\n\n​\n\nCoorparoo School of Arts and RSL Memorial Hall continues to be used extensively by the community."}, {"url": "https://www.e-architect.com/england/beckfords-tower-bath-renewal", "page_content": "Beckford’s Tower Bath Conservation, BPT News, Building Renewal Architects, Stenning & Co\n\nBeckford’s Tower Bath Renewal\n\n12 July 2021\n\nLocation: Bath, in southwest England, UK\n\nBeckford’s Tower building in the landscape:\n\n\n\nphoto © Tom Burrows\n\nOur Tower Bath News\n\nBath Preservation Trust appoints Design Team for Beckford’s Tower\n\nBath Preservation Trust (BPT) has announced that architects Thomas Ford & Partners and quantity surveyors Stenning & Co have been appointed to lead the design work for the £3.3 million Our Tower project.\n\nThe Our Tower plan, which is funded by Historic England and The National Lottery Heritage Fund, will address urgent repair and conservation works required to the almost 200-year-old Grade I listed Beckford’s Tower, that stands above the UNESCO World Heritage Site of Bath and is the only museum dedicated to William Beckford in the world.\n\nBorn in 1760, William Beckford was a colourful and controversial character. At just 10-years old he inherited his father’s fortune, which included the Fonthill estate and several sugar plantations in Jamaica. His wealth gave him the freedom to pursue his interests in art, architecture, writing and music.\n\nIn 1782, Beckford undertook a Grand Tour, which inspired his travel writing and passion for collecting which continued throughout his life – especially when exiled to Europe for 10 years following the exposure of his relationship with William Courtenay (1784).\n\nIn 1826 William Beckford commissioned an extraordinary landscape back home in Bath – a Garden between his Lansdown Crescent home and the retreat now known as Beckford’s Tower, where he could escape from the city within the natural environment. The Tower was created to house his library, art collection and every day Beckford would ride up there from his home, accompanied by his pack of spaniels. This expanse became known as Beckford’s Ride, a mile of interlinked gardens.\n\nBeckford’s grave in Bath:\n\n\n\nphoto courtesy Bath Preservation Trust\n\nBeckford’s Tower stands in an exposed location and, like many historic buildings, almost two centuries of exposure to weather, pollution, and the challenges of climate change, now threaten the fabric of the building. There is now an urgent need for repair and conservation, particularly to address water ingress at high level within the belvedere & lantern. Beckford’s Tower was added to the Historic England ‘Heritage at Risk’ Register in October 2019.\n\nOur Tower will bring new parts of the tower into use, and upgrade services and visitor infrastructure. BPT will also use the project as an opportunity to develop the visitor experience, engage wider audiences and reconnect the Tower with its lost landscape, through new experiences, interpretation, and access. A development grant awarded by the National Lottery Heritage Fund is also enabling Bath Preservation Trust to re-examine the way in which they share the story of William Beckford’s links to the transatlantic slave trade.\n\nOrnamental furniture in Mr Beckford’s Collection, Views of Lansdown Tower, Plate XIV, 1844:\n\n\n\nimage : Beckford’s Tower & Museum – Bath Preservation Trust\n\nThe project is scheduled to complete in winter 2023.\n\nLondon based conservation architects Thomas Ford & Partners are led by Clive England, who brings over 30 years’ experience to the project. Clive is Surveyor of the Fabric to Ely Cathedral, and Cathedral Architect to Sheffield Cathedral.\n\nStenning & Co – who are located in Bath – are led by Quantity Surveyor Adrian Stenning. Experts and specialists in building conservation work, Adrian has worked extensively with organisations including the Landmark Trust and the National Trust.\n\nBPT Capital Works Director Simon Butler said “We are delighted to welcome Thomas Ford & Partners and Stenning & Co to the project. Both bring huge conservation experience to this nationally important building, and we look forward to securing an exciting new future for this Bath landmark.”\n\nClive England said: “We are delighted to be involved with BPT’s Our Tower project. Beckford’s Tower is a unique building, in a spectacular setting, with a fascinating history – exactly the type of project that every conservation architect dreams about!”\n\nAdrian Stenning said “I am very pleased to continue my relationship with the Bath Preservation Trust and in particular Beckford’s Tower with which I have been involved for over 20 years. I look forward to this opportunity to not just repair the Tower, but to also open up & show its’ story for a wider audience.”\n\nSecuring the Design team is just the start of this project, with urgent fundraising now needed to ensure vital conservation work to the building and landscape takes place, to ensure today’s visitors and future generations can continue to explore and enjoy this iconic Bath landmark.\n\nTower engraving, unknown 19th century:\n\n\n\nimage © Beckford’s Tower and Museum, Bath Preservation Trust\n\nBeckford’s Tower Bath Refurbishment Team\n\nBath Preservation Trust\n\nBath Preservation Trust was set up in 1934 to safeguard the historic city of Bath. Bath is a UNESCO World Heritage Site, and the only complete city in the UK afforded World Heritage Status. The purposes of the Trust are: to encourage and support the conservation, evolution and enhancement of Bath and its environs within a framework appropriate both to its historic setting and its sustainable future, and to provide educational resources, including museums, which focus on the architectural and historic importance of the city.\n\nThe Trust receives no statutory funding and is supported by visitor income, grants, legacies, donations and around 1400 members who share a passion for the city and its environs. The Trust runs four accredited museums in Bath – No. 1 Royal Crescent, the Museum of Bath Architecture, the Herschel Museum of Astronomy, and Beckford’s Tower. For more information visit www.bath-preservation-trust.org.uk / Twitter @BathPresTrust / Facebook /@bathprestrust / Instagram @bath_preservation_trust\n\nFor more information about Beckford’s Tower, visit www.beckfordstower.org / Twitter @BeckfordsTower / Facebook @beckfordstower / Instagram @beckfordstower\n\nBeckford’s Tower Bath cemetery:\n\n\n\nimage courtesy Bath Preservation Trust\n\nThomas Ford & Partners\n\nThomas Ford & Partners is a leading conservation-based architectural practice. Originally established in 1926, the practice specialises in the repair, remodelling, reuse, and regeneration of historic buildings and heritage sites.\n\nProjects cover wide range of building types and uses from museums and galleries to educational buildings, and from military and industrial buildings to cathedrals. The practice has been successfully involved with NLHF and HLF funded projects for over 20 years with completed projects at Brooklands Museum, Weybridge (shortlisted for the prestigious ‘Museum of the Year’ award and recently featured in the TV series ‘Secrets of the Transport Museum’); St John’s Church, Hackney; Fulham Palace; Sheffield Cathedral (winner of RIBA Regional and National Awards); Hall Place, Bexley; Wakefield Cathedral; Guildford Cathedral; Forty Hall, Enfield; Hadlow Tower, Kent; and many others. Currently working on the restoration of the spectacular Victorian Subway at Crystal Palace.\n\nThomas Ford & Partners are appointed as architects for a wide range of buildings, including some 350 churches and 5 cathedrals. We have also worked on a long list of Lottery funded Parks for People projects including currently Hainault Forest Country Park; Cranford Park, Hillingdon; and completed projects at Beckenham Place Park; Holywells Park, Ipswich; Bishops Park, Fulham. Visit www.thomasford.co.uk / Instagram @thomasfordandpartners\n\nStenning & Co Ltd\n\nStenning & Co Ltd was formed in 2009 when Adrian Stenning left Quantity Surveyors Bare, Leaning & Bare to continue and ensure active involvement with historic building work. Stenning & Co Ltd specialise extensively and almost exclusively in the repair and conservation of historic buildings.\n\nProjects have ranged from work upon classical architectural buildings, five Cathedrals and many Churches (well over 100 with services ranging from estimate advice to full Quantity Surveying Services) and through to vernacular timber framed barns as well as associated modern buildings. He has extended his Quantity Surveying background and acts as Project Manager and/or Contract Administrator on a number of projects.\n\nAdrian Stenning’s surveying experience with Historic Buildings has been recognised by the RICS by his inclusion upon their Register of Certified Historic Building Professionals since its inception. He became Chairman of the RICS Conservation Forum Board for a three-year fixed term having previously sat on the Board for several years and continues to be engaged in promoting good practice and philosophy across the spectrum of conservation.\n\nHe has recently completed eight years as one of the national judges for the RICS Awards, being the specialist for the Building Conservation category. Stenning & Co Ltd’s website is currently closed.\n\nThe Museum of Bath Architecture is housed in the Countess of Huntingdon’s Chapel, The Vineyards, Bath, BA1 5NA, England, UK:\n\n\n\nimage © Bath Museum of ArchitectureBath Preservation Trust\n\nBeckford’s Tower Bath Renewal images / information from Bath Preservation Trust (BPT)\n\nLocation: Bath, south western England, UK\n\nBath Buildings\n\nBath Buildings : key architecture southwest England\n\nBath Architecture – selection below:\n\nParallel (of Life and) Architecture – Bath Exhibition\n\nBath Architecture Exhibition\n\nBath Abbey Building\n\nDesign: Feilden Clegg Bradley Studios\n\n\n\nimage from architect\n\nBath Abbey Building\n\nBath Riverside\n\nDesign: Alison Brooks Architects\n\n\n\nimage from Alison Brooks Architects\n\nBath Riverside\n\nThe Dyson Centre for Neonatal Care\n\nFeilden Clegg Bradley Studios\n\n\n\nphoto © Craig Aukland / Fotohaus\n\nThe Dyson Centre for Neonatal Care Bath\n\nBath Spa development\n\nGrimshaw Architects\n\n\n\nphotograph : Edmund Sumner\n\nThermae : Bath Spa\n\nHolburne Museum of Art\n\nEric Parry Architects\n\nBath Arts building\n\nThe Royal High School Bath\n\nFeilden Clegg Bradley Studios\n\nRoyal High School Bath\n\nBristol Buildings\n\nBath Architectural Heritage Debate : Speakers incl. Eric Parry + Sir Richard MacCormac\n\nEnglish Architects\n\nEnglish Architecture\n\nComments / photos for the Beckford’s Tower Bath Renewal page welcome\n\nEngland"}, {"url": "https://bathnewseum.com/2021/07/12/designers-appointed-for-tower-project/", "page_content": "Another step forward in the planned multi-million pound restoration of Beckford’s Tower.\n\nBath Preservation Trust (BPT) has announced that architects Thomas Ford & Partners and quantity surveyors Stenning & Co have been appointed to lead the design work for the £3.3 million Our Tower project.\n\nThe Our Tower plan, which is funded by Historic England and The National Lottery Heritage Fund, will address urgent repair and conservation works required to the almost 200-year-old Grade I listed Beckford’s Tower, that stands above the UNESCO World Heritage Site of Bath and is the only museum dedicated to William Beckford in the world.\n\nBorn in 1760, William Beckford was a colourful and controversial character. At just 10-years old he inherited his father’s fortune, which included the Fonthill estate and several sugar plantations in Jamaica. His wealth gave him the freedom to pursue his interests in art, architecture, writing and music.\n\nIn 1782, Beckford undertook a Grand Tour, which inspired his travel writing and passion for collecting which continued throughout his life – especially when exiled to Europe for 10 years following the exposure of his relationship with William Courtenay (1784).\n\nIn 1826 William Beckford commissioned an extraordinary landscape back home in Bath – a Garden between his Lansdown Crescent home and the retreat now known as Beckford’s Tower, where he could escape from the city within the natural environment. The Tower was created to house his library, art collection and every day Beckford would ride up there from his home, accompanied by his pack of spaniels. This expanse became known as Beckford’s Ride, a mile of interlinked gardens.\n\nBeckford’s Tower stands in an exposed location and, like many historic buildings, almost two centuries of exposure to weather, pollution, and the challenges of climate change, now threaten the fabric of the building. There is now an urgent need for repair and conservation, particularly to address water ingress at high level within the belvedere & lantern. Beckford’s Tower was added to the Historic England ‘Heritage at Risk’ Register in October 2019.\n\nOur Tower will bring new parts of the tower into use, and upgrade services and visitor infrastructure. BPT will also use the project as an opportunity to develop the visitor experience, engage wider audiences and reconnect the Tower with its lost landscape, through new experiences, interpretation, and access. A development grant awarded by the National Lottery Heritage Fund is also enabling Bath Preservation Trust to re-examine the way in which they share the story of William Beckford’s links to the transatlantic slave trade.\n\nBeckford’s grave\n\nThe project is scheduled to complete in winter 2023.\n\nLondon based conservation architects Thomas Ford & Partners are led by Clive England, who brings over 30 years’ experience to the project. Clive is Surveyor of the Fabric to Ely Cathedral, and Cathedral Architect to Sheffield Cathedral.\n\nStenning & Co – who are located in Bath – are led by Quantity Surveyor Adrian Stenning. Experts and specialists in building conservation work, Adrian has worked extensively with organisations including the Landmark Trust and the National Trust.\n\nBPT Capital Works Director Simon Butler said “We are delighted to welcome Thomas Ford & Partners and Stenning & Co to the project. Both bring huge conservation experience to this nationally important building, and we look forward to securing an exciting new future for this Bath landmark.”\n\nClive England said: “We are delighted to be involved with BPT’s Our Tower project. Beckford’s Tower is a unique building, in a spectacular setting, with a fascinating history – exactly the type of project that every conservation architect dreams about!”\n\nAdrian Stenning said “I am very pleased to continue my relationship with the Bath Preservation Trust and in particular Beckford’s Tower with which I have been involved for over 20 years. I look forward to this opportunity to not just repair the Tower, but to also open up & show its’ story for a wider audience.”\n\nSecuring the Design team is just the start of this project, with urgent fundraising now needed to ensure vital conservation work to the building and landscape takes place, to ensure today’s visitors and future generations can continue to explore and enjoy this iconic Bath landmark.\n\nFor your further information\n\nBath Preservation Trust was set up in 1934 to safeguard the historic city of Bath. Bath is a UNESCO World Heritage Site, and the only complete city in the UK afforded World Heritage Status. The purposes of the Trust are: to encourage and support the conservation, evolution and enhancement of Bath and its environs within a framework appropriate both to its historic setting and its sustainable future, and to provide educational resources, including museums, which focus on the architectural and historic importance of the city. The Trust receives no statutory funding and is supported by visitor income, grants, legacies, donations and around 1400 members who share a passion for the city and its environs. The Trust runs four accredited museums in Bath – No. 1 Royal Crescent, the Museum of Bath Architecture, the Herschel Museum of Astronomy, and Beckford’s Tower. For more information visit www.bath-preservation-trust.org.uk / Twitter @BathPresTrust / Facebook /@bathprestrust / Instagram @bath_preservation_trust\n\nFor more information about Beckford’s Tower, visit www.beckfordstower.org / Twitter @BeckfordsTower / Facebook @beckfordstower / Instagram @beckfordstower\n\nThomas Ford & Partners is a leading conservation-based architectural practice. Originally established in 1926, the practice specialises in the repair, remodelling, reuse, and regeneration of historic buildings and heritage sites. Projects cover wide range of building types and uses from museums and galleries to educational buildings, and from military and industrial buildings to cathedrals. The practice has been successfully involved with NLHF and HLF funded projects for over 20 years with completed projects at Brooklands Museum, Weybridge (shortlisted for the prestigious ‘Museum of the Year’ award and recently featured in the TV series ‘Secrets of the Transport Museum’); St John’s Church, Hackney; Fulham Palace; Sheffield Cathedral (winner of RIBA Regional and National Awards); Hall Place, Bexley; Wakefield Cathedral; Guildford Cathedral; Forty Hall, Enfield; Hadlow Tower, Kent; and many others. Currently working on the restoration of the spectacular Victorian Subway at Crystal Palace. We are appointed as architects for a wide range of buildings, including some 350 churches and 5 cathedrals. We have also worked on a long list of Lottery funded Parks for People projects including currently Hainault Forest Country Park; Cranford Park, Hillingdon; and completed projects at Beckenham Place Park; Holywells Park, Ipswich; Bishops Park, Fulham. Visit www.thomasford.co.uk / Instagram @thomasfordandpartners\n\nStenning & Co Ltd was formed in 2009 when Adrian Stenning left Quantity Surveyors Bare, Leaning & Bare to continue and ensure active involvement with historic building work. Stenning & Co Ltd specialise extensively and almost exclusively in the repair and conservation of historic buildings. Projects have ranged from work upon classical architectural buildings, five Cathedrals and many Churches (well over 100 with services ranging from estimate advice to full Quantity Surveying Services) and through to vernacular timber framed barns as well as associated modern buildings. He has extended his Quantity Surveying background and acts as Project Manager and/or Contract Administrator on a number of projects. Adrian Stenning’s surveying experience with Historic Buildings has been recognised by the RICS by his inclusion upon their Register of Certified Historic Building Professionals since its inception. He became Chairman of the RICS Conservation Forum Board for a three-year fixed term having previously sat on the Board for several years and continues to be engaged in promoting good practice and philosophy across the spectrum of conservation. He has recently completed eight years as one of the national judges for the RICS Awards, being the specialist for the Building Conservation category. Stenning & Co Ltd’s website is currently closed.\n\nLike this: Like Loading..."}, {"url": "https://trove.nla.gov.au/newspaper/article/85903691", "page_content": "; Coorparoo. The deceased gentleman expired\n\nat 9 o'clock, after an illness of seven weeks.\n\nHe was aged 90 years and six months. At\n\nthe special request of deceased the funeral,\n\nwhich, took place this . afternoon, was con- ?\n\n??'.-' fined to members of the family and person\n\n?','.. al friends, the interment taking place at the\n\nMorningside' Cemetery, Bulimba. His ca\n\nreer was a distinguished one, divided be\n\ntween service to ? the Church and to the\n\n- State. :\n\nThe Horn. Frederick Thomas Brentnall,\n\nWho was the son of the late Mr. and Mrs.\n\nGeorge' Brentnall, of Reddings, in Derby\n\nshire, was born on June 17, 1834.- His fa\n\nther was a builder, and he was educated at\n\nAlfreton,. also in Derbyshire. He. was the\n\neldest of 12 children, and his father also was\n\nthe eldest of 12. After leaving school he\n\nresided at Bishop Auckland, in Durham\n\nshire, and later was engaged in business at\n\n'Ripley, in Derbyshire, until he entered the\n\nWesleyan ministry. In 1863, when in his\n\n29th year, he and nine other young m'en\n\nwere sent by the British Wesleyan cOnfe\n\nence to. New South Wales to . strengthen t'!e\n\nministerial ranks of that denomination and\n\nhe ?arrived in Sydney in October, 1863. In\n\n1867 he was married to Miss Elizabeth Wat\n\nson, of Mansfield, Nottingham, who had held\n\nthe position of head mistress of a large\n\nWesleyan day .school for girls at Bacup,\n\n.?in Lancashire, and went' to Sydney to be\n\nmarried. The Rev. F. T. Brentnall, six\n\nyears later, was appointed by the New\n\nSouth Wales conference to the Brisbane cir\n\ncuit, and he arrived in Brisbane with his\n\nWife and two young daughters on April IS,\n\n1873. Three years later he was transferred\n\nto the Fortitude Valley Circuit. His next\n\ncircuit was Ipswich, where he remained for\n\ntwo years. In 1875 he, with the late Revs.\n\n.. E. Griffith, Colin McCulloch and D. F. Mit\n\nchell promoted a religious weekly newspa\n\nper named the 'Evangelical Standard.' That\n\n. Was the time when the struggle between\n\nthe advocates^ of denominational and State\n\n. schools was at its height, the result being\n\nthat the present State system of education\n\nwas firmly established in Queensland. The\n\neditorial quartette abovenanied fought\n\nthroughout against .. denominationalism in\n\neducation. In 1883 Mr. Brentnall had to\n\nretire from the ministry, a throat affection\n\ncausing the failure of his voice. He left\n\nthe ministry with, a record of 20 years' good\n\nservice. He ? was a forceful and eloquent\n\n]:-re.acher, and in the 10 years of his min- .\n\nistry in Queensland he did much to free\n\nthe Churches of his district from the hind\n\nrance due to debt. In 1881 he joined the\n\nTelegraph Newspaper Company as business\n\n' manager and contributor. In 1885 on the\n\nretirement of the Hon. James Cowlishaw, he\n\nbecame managing director of*, the 'Tele-\n\ngraph' Newspaper Company, and he held\n\nthat position till 1893, when he withdrew\n\n? from all active participation in the com\n\npany's affairs. In 1887 he visited England\n\n. and attended, the jubilee thanksgiving ser\n\nvice in Westminster Abbey. He was the\n\nbearer of an address of loyalty from Queens\n\nland to Queen 'Victoria. There were two\n\n? important events in the history of Queens\n\nland in which Mr. Brentnall's facile but\n\ntrenchant pen was used with telling effect.\n\nThe first occurred in 1881, and was brought\n\nabout by what was known as the steel rails\n\nContract, in which the Ministry of the day\n\nwas allegedly involved. The other was\n\noccasioned by the late Sir Thomas M'll\n\nwraith's famous land grant railway propo-.\n\nsal, sarcastically termed ? the ' 'grid iron'\n\nrailway. On both- questions Mr. Brentnall\n\nWith his powerful, pen espoused the popu\n\nlar cause. On the 17th April, 1886 he was\n\nappointed a member of the Legislative\n\nCouncil, and in 1893 he was el\n\nected Chairman of Committees. , Three\n\nyears later he was re-elected to that po\n\nsition, ard again in 1899. Mr. Brentnall\n\ntor'- an active interest in local government,\n\nanc' was a member of the first Bulimba\n\nDr-'-ional Board. When shire councils\n\n?took. 'the place of divisional boards, he be\n\ncame a councillor of the Coorparoo Shire,\n\nin which he resided, and for two years was\n\n(president of that shire. He also was a\n\nmember of the executive council of the Fe\n\nderated Employers' Union of Queensland,\n\n' and was a fellow of the Royal Geographi\n\ncal Society of Australasia (Queensland). Mr,\n\nBrentnall also was extensively interested in\n\nthe mining industry of Queensland. In this\n\nregard it may be said that, though some of\n\nliis speculations wore profitable, many oth\n\ners were disastrous failures. ' During his\n\nlong life he held a large number of com\n\npany directorships, amongst them being the\n\nQueensland 'Deposit Bank and Building So\n\nciety, Queensland Trustees Limited, ? Cool -\n\ng'arra 'Tin Mining Co., and the Queensland\n\nCopper Freeholds (both British companies\n\nworking at Ckmcurry), the Queensland Mu\n\ntual Insurance Co., Finney, Isles, and Co.\n\nOn ''??- attainment of his SOth year in 1914\n\nlie : ' 'nified ? the event by making gifts to\n\nthe Methodist churches and organisations\n\nin Brisbane on the basis of 10/- and £1\n\nfor every year of his -age. The institutions\n\n??which benefited were the Methodist Homo"}, {"url": "https://trove.nla.gov.au/newspaper/article/85903691", "page_content": "; Coorparoo. The deceased gentleman expired\n\nat 9 o'clock, after an illness of seven weeks.\n\nHe was aged 90 years and six months. At\n\nthe special request of deceased the funeral,\n\nwhich, took place this . afternoon, was con- ?\n\n??'.-' fined to members of the family and person\n\n?','.. al friends, the interment taking place at the\n\nMorningside' Cemetery, Bulimba. His ca\n\nreer was a distinguished one, divided be\n\ntween service to ? the Church and to the\n\n- State. :\n\nThe Horn. Frederick Thomas Brentnall,\n\nWho was the son of the late Mr. and Mrs.\n\nGeorge' Brentnall, of Reddings, in Derby\n\nshire, was born on June 17, 1834.- His fa\n\nther was a builder, and he was educated at\n\nAlfreton,. also in Derbyshire. He. was the\n\neldest of 12 children, and his father also was\n\nthe eldest of 12. After leaving school he\n\nresided at Bishop Auckland, in Durham\n\nshire, and later was engaged in business at\n\n'Ripley, in Derbyshire, until he entered the\n\nWesleyan ministry. In 1863, when in his\n\n29th year, he and nine other young m'en\n\nwere sent by the British Wesleyan cOnfe\n\nence to. New South Wales to . strengthen t'!e\n\nministerial ranks of that denomination and\n\nhe ?arrived in Sydney in October, 1863. In\n\n1867 he was married to Miss Elizabeth Wat\n\nson, of Mansfield, Nottingham, who had held\n\nthe position of head mistress of a large\n\nWesleyan day .school for girls at Bacup,\n\n.?in Lancashire, and went' to Sydney to be\n\nmarried. The Rev. F. T. Brentnall, six\n\nyears later, was appointed by the New\n\nSouth Wales conference to the Brisbane cir\n\ncuit, and he arrived in Brisbane with his\n\nWife and two young daughters on April IS,\n\n1873. Three years later he was transferred\n\nto the Fortitude Valley Circuit. His next\n\ncircuit was Ipswich, where he remained for\n\ntwo years. In 1875 he, with the late Revs.\n\n.. E. Griffith, Colin McCulloch and D. F. Mit\n\nchell promoted a religious weekly newspa\n\nper named the 'Evangelical Standard.' That\n\n. Was the time when the struggle between\n\nthe advocates^ of denominational and State\n\n. schools was at its height, the result being\n\nthat the present State system of education\n\nwas firmly established in Queensland. The\n\neditorial quartette abovenanied fought\n\nthroughout against .. denominationalism in\n\neducation. In 1883 Mr. Brentnall had to\n\nretire from the ministry, a throat affection\n\ncausing the failure of his voice. He left\n\nthe ministry with, a record of 20 years' good\n\nservice. He ? was a forceful and eloquent\n\n]:-re.acher, and in the 10 years of his min- .\n\nistry in Queensland he did much to free\n\nthe Churches of his district from the hind\n\nrance due to debt. In 1881 he joined the\n\nTelegraph Newspaper Company as business\n\n' manager and contributor. In 1885 on the\n\nretirement of the Hon. James Cowlishaw, he\n\nbecame managing director of*, the 'Tele-\n\ngraph' Newspaper Company, and he held\n\nthat position till 1893, when he withdrew\n\n? from all active participation in the com\n\npany's affairs. In 1887 he visited England\n\n. and attended, the jubilee thanksgiving ser\n\nvice in Westminster Abbey. He was the\n\nbearer of an address of loyalty from Queens\n\nland to Queen 'Victoria. There were two\n\n? important events in the history of Queens\n\nland in which Mr. Brentnall's facile but\n\ntrenchant pen was used with telling effect.\n\nThe first occurred in 1881, and was brought\n\nabout by what was known as the steel rails\n\nContract, in which the Ministry of the day\n\nwas allegedly involved. The other was\n\noccasioned by the late Sir Thomas M'll\n\nwraith's famous land grant railway propo-.\n\nsal, sarcastically termed ? the ' 'grid iron'\n\nrailway. On both- questions Mr. Brentnall\n\nWith his powerful, pen espoused the popu\n\nlar cause. On the 17th April, 1886 he was\n\nappointed a member of the Legislative\n\nCouncil, and in 1893 he was el\n\nected Chairman of Committees. , Three\n\nyears later he was re-elected to that po\n\nsition, ard again in 1899. Mr. Brentnall\n\ntor'- an active interest in local government,\n\nanc' was a member of the first Bulimba\n\nDr-'-ional Board. When shire councils\n\n?took. 'the place of divisional boards, he be\n\ncame a councillor of the Coorparoo Shire,\n\nin which he resided, and for two years was\n\n(president of that shire. He also was a\n\nmember of the executive council of the Fe\n\nderated Employers' Union of Queensland,\n\n' and was a fellow of the Royal Geographi\n\ncal Society of Australasia (Queensland). Mr,\n\nBrentnall also was extensively interested in\n\nthe mining industry of Queensland. In this\n\nregard it may be said that, though some of\n\nliis speculations wore profitable, many oth\n\ners were disastrous failures. ' During his\n\nlong life he held a large number of com\n\npany directorships, amongst them being the\n\nQueensland 'Deposit Bank and Building So\n\nciety, Queensland Trustees Limited, ? Cool -\n\ng'arra 'Tin Mining Co., and the Queensland\n\nCopper Freeholds (both British companies\n\nworking at Ckmcurry), the Queensland Mu\n\ntual Insurance Co., Finney, Isles, and Co.\n\nOn ''??- attainment of his SOth year in 1914\n\nlie : ' 'nified ? the event by making gifts to\n\nthe Methodist churches and organisations\n\nin Brisbane on the basis of 10/- and £1\n\nfor every year of his -age. The institutions\n\n??which benefited were the Methodist Homo"}, {"url": "https://www.e-architect.com/england/beckfords-tower-bath-renewal", "page_content": "Beckford’s Tower Bath Conservation, BPT News, Building Renewal Architects, Stenning & Co\n\nBeckford’s Tower Bath Renewal\n\n12 July 2021\n\nLocation: Bath, in southwest England, UK\n\nBeckford’s Tower building in the landscape:\n\n\n\nphoto © Tom Burrows\n\nOur Tower Bath News\n\nBath Preservation Trust appoints Design Team for Beckford’s Tower\n\nBath Preservation Trust (BPT) has announced that architects Thomas Ford & Partners and quantity surveyors Stenning & Co have been appointed to lead the design work for the £3.3 million Our Tower project.\n\nThe Our Tower plan, which is funded by Historic England and The National Lottery Heritage Fund, will address urgent repair and conservation works required to the almost 200-year-old Grade I listed Beckford’s Tower, that stands above the UNESCO World Heritage Site of Bath and is the only museum dedicated to William Beckford in the world.\n\nBorn in 1760, William Beckford was a colourful and controversial character. At just 10-years old he inherited his father’s fortune, which included the Fonthill estate and several sugar plantations in Jamaica. His wealth gave him the freedom to pursue his interests in art, architecture, writing and music.\n\nIn 1782, Beckford undertook a Grand Tour, which inspired his travel writing and passion for collecting which continued throughout his life – especially when exiled to Europe for 10 years following the exposure of his relationship with William Courtenay (1784).\n\nIn 1826 William Beckford commissioned an extraordinary landscape back home in Bath – a Garden between his Lansdown Crescent home and the retreat now known as Beckford’s Tower, where he could escape from the city within the natural environment. The Tower was created to house his library, art collection and every day Beckford would ride up there from his home, accompanied by his pack of spaniels. This expanse became known as Beckford’s Ride, a mile of interlinked gardens.\n\nBeckford’s grave in Bath:\n\n\n\nphoto courtesy Bath Preservation Trust\n\nBeckford’s Tower stands in an exposed location and, like many historic buildings, almost two centuries of exposure to weather, pollution, and the challenges of climate change, now threaten the fabric of the building. There is now an urgent need for repair and conservation, particularly to address water ingress at high level within the belvedere & lantern. Beckford’s Tower was added to the Historic England ‘Heritage at Risk’ Register in October 2019.\n\nOur Tower will bring new parts of the tower into use, and upgrade services and visitor infrastructure. BPT will also use the project as an opportunity to develop the visitor experience, engage wider audiences and reconnect the Tower with its lost landscape, through new experiences, interpretation, and access. A development grant awarded by the National Lottery Heritage Fund is also enabling Bath Preservation Trust to re-examine the way in which they share the story of William Beckford’s links to the transatlantic slave trade.\n\nOrnamental furniture in Mr Beckford’s Collection, Views of Lansdown Tower, Plate XIV, 1844:\n\n\n\nimage : Beckford’s Tower & Museum – Bath Preservation Trust\n\nThe project is scheduled to complete in winter 2023.\n\nLondon based conservation architects Thomas Ford & Partners are led by Clive England, who brings over 30 years’ experience to the project. Clive is Surveyor of the Fabric to Ely Cathedral, and Cathedral Architect to Sheffield Cathedral.\n\nStenning & Co – who are located in Bath – are led by Quantity Surveyor Adrian Stenning. Experts and specialists in building conservation work, Adrian has worked extensively with organisations including the Landmark Trust and the National Trust.\n\nBPT Capital Works Director Simon Butler said “We are delighted to welcome Thomas Ford & Partners and Stenning & Co to the project. Both bring huge conservation experience to this nationally important building, and we look forward to securing an exciting new future for this Bath landmark.”\n\nClive England said: “We are delighted to be involved with BPT’s Our Tower project. Beckford’s Tower is a unique building, in a spectacular setting, with a fascinating history – exactly the type of project that every conservation architect dreams about!”\n\nAdrian Stenning said “I am very pleased to continue my relationship with the Bath Preservation Trust and in particular Beckford’s Tower with which I have been involved for over 20 years. I look forward to this opportunity to not just repair the Tower, but to also open up & show its’ story for a wider audience.”\n\nSecuring the Design team is just the start of this project, with urgent fundraising now needed to ensure vital conservation work to the building and landscape takes place, to ensure today’s visitors and future generations can continue to explore and enjoy this iconic Bath landmark.\n\nTower engraving, unknown 19th century:\n\n\n\nimage © Beckford’s Tower and Museum, Bath Preservation Trust\n\nBeckford’s Tower Bath Refurbishment Team\n\nBath Preservation Trust\n\nBath Preservation Trust was set up in 1934 to safeguard the historic city of Bath. Bath is a UNESCO World Heritage Site, and the only complete city in the UK afforded World Heritage Status. The purposes of the Trust are: to encourage and support the conservation, evolution and enhancement of Bath and its environs within a framework appropriate both to its historic setting and its sustainable future, and to provide educational resources, including museums, which focus on the architectural and historic importance of the city.\n\nThe Trust receives no statutory funding and is supported by visitor income, grants, legacies, donations and around 1400 members who share a passion for the city and its environs. The Trust runs four accredited museums in Bath – No. 1 Royal Crescent, the Museum of Bath Architecture, the Herschel Museum of Astronomy, and Beckford’s Tower. For more information visit www.bath-preservation-trust.org.uk / Twitter @BathPresTrust / Facebook /@bathprestrust / Instagram @bath_preservation_trust\n\nFor more information about Beckford’s Tower, visit www.beckfordstower.org / Twitter @BeckfordsTower / Facebook @beckfordstower / Instagram @beckfordstower\n\nBeckford’s Tower Bath cemetery:\n\n\n\nimage courtesy Bath Preservation Trust\n\nThomas Ford & Partners\n\nThomas Ford & Partners is a leading conservation-based architectural practice. Originally established in 1926, the practice specialises in the repair, remodelling, reuse, and regeneration of historic buildings and heritage sites.\n\nProjects cover wide range of building types and uses from museums and galleries to educational buildings, and from military and industrial buildings to cathedrals. The practice has been successfully involved with NLHF and HLF funded projects for over 20 years with completed projects at Brooklands Museum, Weybridge (shortlisted for the prestigious ‘Museum of the Year’ award and recently featured in the TV series ‘Secrets of the Transport Museum’); St John’s Church, Hackney; Fulham Palace; Sheffield Cathedral (winner of RIBA Regional and National Awards); Hall Place, Bexley; Wakefield Cathedral; Guildford Cathedral; Forty Hall, Enfield; Hadlow Tower, Kent; and many others. Currently working on the restoration of the spectacular Victorian Subway at Crystal Palace.\n\nThomas Ford & Partners are appointed as architects for a wide range of buildings, including some 350 churches and 5 cathedrals. We have also worked on a long list of Lottery funded Parks for People projects including currently Hainault Forest Country Park; Cranford Park, Hillingdon; and completed projects at Beckenham Place Park; Holywells Park, Ipswich; Bishops Park, Fulham. Visit www.thomasford.co.uk / Instagram @thomasfordandpartners\n\nStenning & Co Ltd\n\nStenning & Co Ltd was formed in 2009 when Adrian Stenning left Quantity Surveyors Bare, Leaning & Bare to continue and ensure active involvement with historic building work. Stenning & Co Ltd specialise extensively and almost exclusively in the repair and conservation of historic buildings.\n\nProjects have ranged from work upon classical architectural buildings, five Cathedrals and many Churches (well over 100 with services ranging from estimate advice to full Quantity Surveying Services) and through to vernacular timber framed barns as well as associated modern buildings. He has extended his Quantity Surveying background and acts as Project Manager and/or Contract Administrator on a number of projects.\n\nAdrian Stenning’s surveying experience with Historic Buildings has been recognised by the RICS by his inclusion upon their Register of Certified Historic Building Professionals since its inception. He became Chairman of the RICS Conservation Forum Board for a three-year fixed term having previously sat on the Board for several years and continues to be engaged in promoting good practice and philosophy across the spectrum of conservation.\n\nHe has recently completed eight years as one of the national judges for the RICS Awards, being the specialist for the Building Conservation category. Stenning & Co Ltd’s website is currently closed.\n\nThe Museum of Bath Architecture is housed in the Countess of Huntingdon’s Chapel, The Vineyards, Bath, BA1 5NA, England, UK:\n\n\n\nimage © Bath Museum of ArchitectureBath Preservation Trust\n\nBeckford’s Tower Bath Renewal images / information from Bath Preservation Trust (BPT)\n\nLocation: Bath, south western England, UK\n\nBath Buildings\n\nBath Buildings : key architecture southwest England\n\nBath Architecture – selection below:\n\nParallel (of Life and) Architecture – Bath Exhibition\n\nBath Architecture Exhibition\n\nBath Abbey Building\n\nDesign: Feilden Clegg Bradley Studios\n\n\n\nimage from architect\n\nBath Abbey Building\n\nBath Riverside\n\nDesign: Alison Brooks Architects\n\n\n\nimage from Alison Brooks Architects\n\nBath Riverside\n\nThe Dyson Centre for Neonatal Care\n\nFeilden Clegg Bradley Studios\n\n\n\nphoto © Craig Aukland / Fotohaus\n\nThe Dyson Centre for Neonatal Care Bath\n\nBath Spa development\n\nGrimshaw Architects\n\n\n\nphotograph : Edmund Sumner\n\nThermae : Bath Spa\n\nHolburne Museum of Art\n\nEric Parry Architects\n\nBath Arts building\n\nThe Royal High School Bath\n\nFeilden Clegg Bradley Studios\n\nRoyal High School Bath\n\nBristol Buildings\n\nBath Architectural Heritage Debate : Speakers incl. Eric Parry + Sir Richard MacCormac\n\nEnglish Architects\n\nEnglish Architecture\n\nComments / photos for the Beckford’s Tower Bath Renewal page welcome\n\nEngland"}, {"url": "https://heritage.brisbane.qld.gov.au/heritage-places/1988", "page_content": "Established in Brisbane on 3 August 1886, the Queensland Deposit Bank and Building Society Ltd was a non-trading bank. Although using the title of building society, the bank never operated as a building society but rather provided building loans, bill financing and operated as a land bank. It was one of only six local banks and building societies established during the period 1863-87. These banks were founded principally as safeguards for maintaining Queenslanders’ control over the colony’s finances against inter-colonial or London interests. The establishment of the Bank also occurred during one of Brisbane’s most significant population and building booms. According to Ronald Lawson, “The 1880s were a time of tremendous expansion for Brisbane. In one decade the population of the city almost trebled” The other financial institutions were the Bank of Queensland (1863-66), the Queensland National Bank (1872-1948), the Royal Bank of Queensland (1885-1922), the Federal Building Land and Investment Society United and Deposit Bank (1887-1931) and the Brisbane Permanent Benefit Building and Investment Society (1874).\n\nThe Bank had a number of prominent citizens on its original Board of Directors. The Chairman of the Board, Berkley Basil Moreton, was a Member of the Queensland Legislative Council (MLC), as was Frederick Thomas Brentnall. John Donaldson was a Member of the Queensland Legislative Assembly (MLA) and George Agnew eventually became a MLA. James Hipwood was the Mayor of Brisbane at the time of the Bank’s establishment. The Board also included Justices of the Peace J. J. Kingsbury and Acheson Overend (future Booroodabin Divisional Board member), together with R. J. Cottell. Hugh Agnew was the first manager.\n\nThe Bank commenced its operations on 1 October 1886 from leased premises in the Albert Buildings at the corner of Adelaide and Albert Streets. It established a freehold land department that bought and sold land for development purposes, making a ₤10,339 net profit in its first year. The company’s reliance on land speculation, however, almost reduced it to insolvency during Queensland’s 1893 bank crash. By 1897, staff salaries had to be reduced and directors’ fees waived to keep the bank viable. In 1899, the Bank moved to the Adelaide Chambers at 42 Adelaide Street and by the following year the Bank was once again returning a profit. The Bank continued to experience problems, particularly as it held more assets (unsold land) than actual capital. No dividends had been paid to shareholders since 1892 and the company’s stormy annual meetings were reported in the press, thereby reducing public confidence in the Bank. The first dividend in seventeen years was paid in 1919.\n\nBy the 1920s, the Queensland Deposit Bank and Building Society had become commonly known as the Queensland Deposit Bank. In 1920, the announcement of a new City Hall to be erected on land partly occupied by the Adelaide Chambers Building caused the Queensland Deposit Bank to look for new premises. A number of options were considered by the Board of Directors, including leasing space in the new City Hall, relocating the Bank to either an Ann or an Adelaide Street nearby site, or moving further up Adelaide Street to the Napier Automobile Company Building.\n\nThe economic prosperity of the 1920s, particularly in the local building industry, improved the Bank’s financial position, allowing it to erect its own headquarters on an Albert Street site that was occupied by the single-storey premises of Henry Halliday’s Turkish Baths. The final decision to build the Bank’s new headquarters was not without controversy. Board Chairman Acheson Overend, in particular, was against the Albert Street site because his “offer to let his shop at the corner of Albert and Elizabeth Streets had been rejected”. Overend resigned as Chairman in April 1922. Another director, Mr. Bunning, resigned in May over the proposed location of the new building. As well, the replacement Chairman, Major Harte, resigned on 22 June 1922, just before construction began, as he believed that the Bank’s finances should be put to better use than for funding a new building.\n\nThe architectural firm of Atkinson & Conrad was contracted to design the Bank’s new headquarters. Henry Atkinson and Arnold Henry Conrad commenced their partnership in 1907 and it continued until Atkinson’s death in 1939. The builders were J & E. L. Rees who erected St Paul’s Church in Spring Hill, the Jubilee Hotel in Fortitude Valley and also worked with Atkinson & Conrad on alterations and additions to the Colonial Mutual Fire Insurance Company Building in Creek Street. The Queensland Deposit Bank Building was completed in May 1923.\n\nHenry Halliday, who had operated his Turkish Baths from this 231 Albert Street site since the 1890s, moved his baths into the basement of the new Queensland Deposit Bank Building after it was completed. The Bank offices were located on the ground floor while a variety of offices leased by dentists, accountants, solicitors and manufacturing agents occupied the upper floors. The Mason’s United Grand Lodge, whose Grand Master, Alexander Corrie, was one of the Bank’s directors, leased the building’s top floor for offices and a Masonic Room. This arrangement continued until 1929, when the Masons moved to their new Temple in Ann Street. Other organisations to take up offices there included the Australian Institute of Architects (1923-43) and the Town & Country Women’s Club (1932-49). In 1929, the architectural firm of Atkinson, Powell & Conrad oversaw alterations to the building, which cost £1,500. By this time Henry Atkinson had also joined the Bank’s Board of Directors.\n\nEven after moving into its new building, the Bank was plagued by internal strife. One director, Leslie Corrie left in July 1924 after failing to have the Articles of Association revised. Chairman William Kelso had a dispute with long-term manager George Seabrook that ended with Seabrook’s resignation in 1927. He was replaced by Kelso’s former workmate, Mr. A. F. Knowles. Seabrook then went to the press about the Bank’s affairs. Referring to the new bank building, Seabrook\n\ndisclosed that he had obtained the first offer of a site at Edward and Adelaide Streets, better than the Albert Street site. He said the board turned it down, and the site was then taken up by another institution, which made nearly ₤8,000 on the deal.\n\nSome expansion did occur, however, as the Bank established lending agencies in four towns north of Brisbane.\n\nAt the same time, the Brisbane Permanent Building Society made an initial offer to amalgamate with the Queensland Deposit Bank. Discussions held between officers of the two financial institutions on 22 November 1927, proved inconclusive. Then in September 1931, as a result of uncertainty due to the effects of the Great Depression, there was a run on the Queensland Deposit Bank, the Brisbane Permanent Building Society and the Federal Deposit Bank. The Queensland Deposit Bank was the hardest hit by these customer withdrawals, losing ₤50,102 or 60% of its capital. It was while in this parlous state that the Bank resumed merger talks with the Brisbane Permanent on 10 November 1931.\n\nFive weeks later, the Queensland Deposit Bank ceased to trade, following the last shareholders’ meeting on 15 December 1931. In 1932, the Brisbane Permanent sold the Queensland Deposit Bank Building to the Commercial Bank of Australia (CBA), which then used the building as its Queensland headquarters. Halliday’s Turkish Baths closed the next year. In 1982, the CBA merged with the Bank of New South Wales to become Westpac. A Westpac branch operated from the building until 2000.\n\nAs with most commercial premises within the Central Business District, the Queensland Deposit Bank Building has undergone many internal changes over the years to accommodate the requirements of its different tenants. This is particularly the case with the ground floors of CBD buildings. Brisbane City Council approved alterations to the building in 1949, 1952, 1953, 1955 and 1971.\n\nThe Brisbane History Group identified the Queensland Deposit Bank as a part of Brisbane’s commercial heritage in 2002, when they included it in their publication Walking Tours – Brisbane’s Commercial Heritage 1900-1940."}]}