{"Winnebago Deal is from Brooklyn, New York.": [{"url": "https://www.globenewswire.com/news-release/2021/07/20/2265528/0/en/Winnebago-Industries-to-Acquire-Premium-Pontoon-Boat-Manufacturer-Barletta.html", "page_content": "-- Extends Winnebago Industries’ Marine Platform into the Attractive Pontoon Market Segment --\n\n\n\n-- Accretive Acquisition Enhances Company Growth Profile with Addition of Barletta’s Fast-Growing, High-Quality Brand --\n\n-- Company to Host Conference Call Today at 7:30 a.m. Central to Discuss Transaction --\n\nEDEN PRAIRIE, Minn., July 20, 2021 (GLOBE NEWSWIRE) -- Winnebago Industries, Inc. (NYSE: WGO), a leading outdoor lifestyle product manufacturer, today announced that it has entered into a definitive agreement to acquire Barletta Pontoon Boats (“Barletta”), the industry’s fastest-growing, premium pontoon boat manufacturer, for an initial consideration of $255 million in cash and newly-issued Winnebago Industries shares, plus up to $15 million in Winnebago Industries shares upon the achievement of performance milestones at the end of calendar 2021. Certain growth objectives, if achieved through calendar years 2022 and 2023, provide the opportunity for up to $50 million in additional cash consideration. The transaction extends Winnebago Industries’ marine platform into one of the fastest-growing boating segments, advances the Company’s ongoing evolution into a premier outdoor lifestyle company, and is expected to drive significant financial accretion.\n\nBarletta was founded in 2017 with a focus on high-quality, innovative products, unrivaled service and strong dealer relationships, which has allowed the company to grow rapidly in the pontoon boat segment and establish a strong, differentiated position in the market. The privately-owned company manufactures a portfolio of premium pontoon boats and has a network of 125 dealer locations across the U.S. and Canada with coast-to-coast coverage and significant opportunity for regional expansion. Barletta generated full-year 2020 revenues of $120.6 million and EBITDA of $10.5 million, and expects to deliver full-year 2021 revenues of approximately $214.6 million and EBITDA of $26.4 million. Barletta’s growth trajectory is supported by a strong backlog of orders. The company recently opened a new manufacturing facility in Bristol, Indiana to add production capacity and scale to better meet the demands of its continued growth.\n\n\"The acquisition of Barletta significantly expands Winnebago Industries’ presence in the strong and growing marine market by acquiring the fastest-growing brand within one of the most rapidly-growing boating segments,\" said Winnebago Industries President and Chief Executive Officer, Michael Happe. \"Barletta's premium, innovative pontoon boats are a natural fit with our broader brand portfolio, with shared appeal among families looking to create great experiences and memories on land or on water. Barletta's commitment to quality, innovation and service – the same golden threads that unite all Winnebago Industries brands – and strong relationships with its dealer partners, has driven tremendous growth, enabling Barletta to become a rising force in the industry in a short period of time. We look forward to leveraging our operational excellence, functional resources and proven expertise in nurturing and growing outdoor lifestyle brands to fuel the organic expansion of Barletta’s product line, market share and margins. We are excited to welcome Barletta’s talented employees to the Winnebago Industries team and believe this transaction positions us well to deliver enhanced growth and significant value creation for employees, customers and shareholders.”\n\nBarletta Pontoon Boats President and Founder Bill Fenech commented, “Today is an exciting day for Barletta, as Winnebago Industries’ track record of cultivating premium outdoor lifestyle brands will allow us to further accelerate our growth, expand our offerings, and gain greater share of the pontoon boat market segment. Our shared values and dedication to creating exceptional outdoor experiences make Winnebago Industries an ideal owner and partner for us. We look forward to continuing to innovate and deliver the highest-quality products, unrivaled customer experience, and win-win partnerships with our dealers as Barletta grows within the Winnebago Industries portfolio.\"\n\nFollowing the close of the transaction, Barletta will operate as a distinct business unit within Winnebago Industries. Winnebago Industries’ public reporting will include the formation of new Marine reporting segment comprised of Barletta and Chris-Craft. Barletta’s manufacturing facilities will remain in Bristol, Indiana. Bill Fenech will continue to lead the Barletta business post-closing as its President.\n\nTransaction Highlights\n\nExtends Winnebago Industries’ Marine Platform into the Highly Attractive Pontoon Market Segment: The acquisition of Barletta broadens Winnebago Industries’ presence in the complementary and growing Marine market. Built on versatility, value and accessibility, pontoon boats represent the largest and one of the fastest-growing boating segments in North America, growing at double-digit CAGR over the past 10 years. As the demand for products by outdoor enthusiasts continues to grow, an expanded marine platform will enable Winnebago Industries to grow its customer reach and further balance its overall portfolio and revenue profile beyond recreational vehicles (RVs). Barletta’s premium pontoons are highly differentiated from Winnebago Industries’ Chris-Craft brand and have very limited dealer overlap with other Winnebago Industries brands. Additionally, the pontoon boat market segment provides an opportunity for Winnebago Industries to leverage the intersections between the RV and marine lifestyles and customer demographics, enhance sales and share best practices across the entire Winnebago Industries enterprise.\n\n\n\nThe acquisition of Barletta broadens Winnebago Industries’ presence in the complementary and growing Marine market. Built on versatility, value and accessibility, pontoon boats represent the largest and one of the fastest-growing boating segments in North America, growing at double-digit CAGR over the past 10 years. As the demand for products by outdoor enthusiasts continues to grow, an expanded marine platform will enable Winnebago Industries to grow its customer reach and further balance its overall portfolio and revenue profile beyond recreational vehicles (RVs). Barletta’s premium pontoons are highly differentiated from Winnebago Industries’ Chris-Craft brand and have very limited dealer overlap with other Winnebago Industries brands. Additionally, the pontoon boat market segment provides an opportunity for Winnebago Industries to leverage the intersections between the RV and marine lifestyles and customer demographics, enhance sales and share best practices across the entire Winnebago Industries enterprise. Enhances Winnebago Industries’ Growth Profile with Barletta’s Fast-Growing, High-Quality Brand: Recognized for its quality and innovation in the premium pontoon boat category, Barletta has achieved a 60+% revenue CAGR since its first year of production in 2018 and is already ranked among the top ten pontoon manufacturers by market share. Barletta’s three main tiers of premium pontoons offer an extensive customer lifetime value runway as consumers upgrade over time. Barletta will benefit from Winnebago Industries’ proven framework for differentiation through unique approaches to quality, innovation and service, and the ability to leverage the Company’s operational expertise, supply chain relationships and resources to fuel product line expansion and broader geographic dealer penetration into untapped US markets.\n\n\n\nRecognized for its quality and innovation in the premium pontoon boat category, Barletta has achieved a 60+% revenue CAGR since its first year of production in 2018 and is already ranked among the top ten pontoon manufacturers by market share. Barletta’s three main tiers of premium pontoons offer an extensive customer lifetime value runway as consumers upgrade over time. Barletta will benefit from Winnebago Industries’ proven framework for differentiation through unique approaches to quality, innovation and service, and the ability to leverage the Company’s operational expertise, supply chain relationships and resources to fuel product line expansion and broader geographic dealer penetration into untapped US markets. Attractive Financial Impact: The transaction is expected to be accretive to Winnebago Industries’ cash earnings per share starting in the first year after closing and will also be accretive to EBITDA margins. Barletta expects to generate approximately $215 million in calendar 2021 revenue and has a rapidly expanding margin profile – growing EBITDA margin from 8.7% in 2020 to 9.5% for the last twelve months as of March 31, 2021 – with opportunities for continued, meaningful expansion over time.\n\n\n\nThe transaction is expected to be accretive to Winnebago Industries’ cash earnings per share starting in the first year after closing and will also be accretive to EBITDA margins. Barletta expects to generate approximately $215 million in calendar 2021 revenue and has a rapidly expanding margin profile – growing EBITDA margin from 8.7% in 2020 to 9.5% for the last twelve months as of March 31, 2021 – with opportunities for continued, meaningful expansion over time. Deepens Winnebago Industries’ Bench of Marine Talent and Expertise: The addition of Barletta’s deeply experienced management team, led by Bill Fenech, brings valuable marine expertise to Winnebago Industries and enhances Winnebago Industries’ ability to develop new opportunities for continued growth. The Barletta team shares with Winnebago Industries an unwavering focus on building high-quality products, serving as a true partner to dealers, delivering an unparalleled customer experience, and fostering a culture of teamwork and community for employees.\n\n\n\nTransaction Details\n\nThe initial transaction consideration of $255 million is expected to be funded with $230 million in cash on hand and $25 million in newly-issued Winnebago Industries stock upon closing, and Winnebago Industries will issue up to an additional $15 million in Winnebago Industries stock to Barletta ownership upon the achievement of performance milestones at the end of calendar 2021.\n\n\n\nThe total $270 million expected initial consideration values Barletta at approximately 8.5x Barletta’s estimated 2021 EBITDA, including $29.7 million in acquired tax assets and excluding real estate assets also included in the transaction valued at approximately $15 million.\n\n\n\nUnder the terms of the agreement, Barletta ownership is entitled to receive further cash payments of up to $50 million upon the achievement of certain performance milestones in calendar years 2022 and 2023.\n\n\n\nFollowing the close of the transaction, Winnebago Industries expects to maintain its strong financial flexibility and balance sheet with a pro forma net debt to Adjusted EBITDA ratio following the acquisition of Barletta below the target range of 0.9 – 1.5x.\n\nThe transaction is expected to close early in Winnebago Industries’ first quarter of Fiscal 2022, subject to regulatory approvals and other customary closing conditions.\n\nLazard is serving as exclusive financial advisor to Winnebago Industries and Faegre Drinker Biddle & Reath LLP is serving as legal advisor.\n\nConference Call\n\nWinnebago Industries, Inc. will discuss the transaction at 7:30 a.m. Central Time today. Members of the news media, investors and the general public are invited to access a live broadcast of the conference call via the Investor Relations page of the Company's website at http://investor.wgo.net. The event will be archived and available for replay for the next 90 days.\n\nAbout Winnebago Industries\n\nWinnebago Industries, Inc. (NYSE: WGO) is a leading North American manufacturer of outdoor lifestyle products under the Winnebago, Grand Design, Chris-Craft and Newmar brands, which are used primarily in leisure travel and outdoor recreation activities. The Company builds quality motorhomes, travel trailers, fifth wheel products, boats and commercial community outreach vehicles. Winnebago Industries has multiple facilities in Iowa, Indiana, Minnesota and Florida. For access to Winnebago Industries' investor relations material or to add your name to an automatic email list for Company news releases, visit http://investor.wgo.net.\n\nAbout Barletta Pontoon Boats\n\nHeadquartered in Bristol, Indiana, Barletta Pontoon Boats is a premium pontoon boat manufacturer whose focus on high-quality, innovative products, unrivaled customer experience and strong dealer relationships have propelled its rapid growth since it was founded in 2017. Today, Barletta is the fastest-growing company in the pontoon segment with over 300 dedicated employees and an expansive network of dealer partners across the United States and Canada. Visit barlettapontoonboats.com for more information.\n\nForward Looking Statements\n\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Investors are cautioned that forward-looking statements are inherently uncertain and involve potential risks and uncertainties. A number of factors could cause actual results to differ materially from these statements, including, but not limited to risks relating to the Company’s proposed acquisition of Barletta Pontoon Boats and related companies (“Barletta”), including the possibility that the closing conditions to the contemplated transaction may not be satisfied or waived, including that a governmental entity may prohibit, delay or refuse to grant antitrust approval; delay in closing the transaction or the possibility of non-consummation of the transaction; the occurrence of any event that could give rise to termination of the Purchase Agreement; risks inherent in the achievement of expected financial results and cost synergies for the acquisition and the timing thereof; risks that the pendency, financing, and efforts to consummate the transaction may be disruptive to the Company or Barletta or their respective management teams; the effect of announcing the transaction on Barletta’s ability to retain and hire key personnel and maintain relationships with customers, suppliers and other third parties; risks related to integration of the two companies and other factors. Additional information concerning other risks and uncertainties that could cause actual results to differ materially from that projected or suggested is contained in the Company's filings with the Securities and Exchange Commission (SEC) over the last 12 months, copies of which are available from the SEC or from the Company upon request. The Company disclaims any obligation or undertaking to disseminate any updates or revisions to any forward looking statements contained in this press release or to reflect any changes in the Company's expectations after the date of this press release or any change in events, conditions or circumstances on which any statement is based, except as required by law.\n\nMedia Contact: Sam Jefson - Public Relations Specialist - 641-585-6803 - sjefson@wgo.net\n\nNon-GAAP Reconciliation\n\nThe following information provides reconciliations of non-GAAP financial measures relating to Barletta, which are presented in the accompanying news release, to the most comparable financial measures calculated and presented in accordance with accounting principles generally accepted in the U.S. (\"GAAP\"). The Company has provided non-GAAP financial measures, which are not calculated or presented in accordance with GAAP, as information supplemental and in addition to the financial measures presented in the accompanying news release that are calculated and presented in accordance with GAAP. Such non-GAAP financial measures should not be considered superior to, as a substitute for, or as an alternative to, and should be considered in conjunction with, the GAAP financial measures presented in the news release. The non-GAAP financial measures in the accompanying news release may differ from similar measures used by other companies. The following tables reconcile the non-GAAP measure of Adjusted Earnings Before Interest, Taxes, Depreciation and Amortization (\"EBITDA\") referred to in this press release to the most directly comparable GAAP measure.\n\nBarletta Pontoon Boats Net Income to EBITDA Reconciliation\n\n($ in millions) Barletta 2020 Actual* Barletta 2021 Estimates* Net Income $9.8 $24.7 Interest Expense 0.0 0.0 Provision for Income Taxes 0.0 0.0 Depreciation 0.7 1.7 Amortization 0.0 0.0 EBITDA $10.5 $26.4\n\n* Data represents Barletta Pontoon Boats, LLC."}, {"url": "https://www.outdoorsy.com/rv-rental/new-york/new-york", "page_content": "This city is so vibrant and full of life that it is hard to imagine a place where you go in New York, NY that does not serve as its own attraction. The magic of the city aside; there are plenty of standout locations that deserve your attention. Bring your New York camper rental here and discover all the opportunities available.\n\nThe outer boroughs are not just places for people to live and then commute into Manhattan, and they deserve your attention too. Here, you will be rewarded with little to no flocks of tourists and a very genuine New York City experience. Pack a lunch, load up the kiddos, and head into the city. The Bronx Zoo, Botanical Gardens, and Arthur Avenue are all across the street from each other and combined would make for a beautiful day. Come visit at any time of year, and the Botanical Gardens will have plants in bloom, and the animals at the zoo never take a vacation. Split up your day by checking out the restaurants lining Arthur Avenue, which are good enough to rival Little Italy for the best Italian food.\n\nIf you are adventurous head over to Hoboken, New Jersey to see where Frank Sinatra was born. Visit one of his namesake parks or simply stroll along the streets taking in the breathtaking condominiums.\n\nBack in the heart of the city, consider a trip back to Central Park.The nature here is not the only reason to visit it. Scattered around the park, or just across the street, are the Metropolitan Museum of Art, Solomon R. Guggenheim Museum, and the Museum of Natural History. All three of these brilliant museums deserve your time. Drive your RV rental here and have fun! The Met and the Guggenheim are filled with priceless pieces of art from the likes of Van Gogh and Monet, and the Museum of Natural History has halls lined with the most magnificent exhibits featuring animals, plants, and the rest of our planet.\n\nLooking for a great New York City place to spend your afternoon, consider a New York City travel trailer rental. Check out the zoos, museums, and parks, visit the iconic One World Trade Center, walk down Wall Street, and witness the madness in Times Square. Rent an RV in New York, New York, and experience as much in as you can while you're here!"}, {"url": "https://www.globenewswire.com/news-release/2021/08/31/2289578/0/en/Winnebago-Industries-Completes-Acquisition-of-Barletta-Pontoon-Boats.html", "page_content": "EDEN PRAIRIE, Minn., Aug. 31, 2021 (GLOBE NEWSWIRE) -- Winnebago Industries, Inc. (NYSE: WGO), a leading outdoor lifestyle product manufacturer, today announced that it has completed its previously announced acquisition of Barletta Pontoon Boats (“Barletta”), the industry’s fastest-growing, premium pontoon boat manufacturer. Consideration paid included $255 million in cash and Winnebago Industries shares. Winnebago Industries will pay an additional $15 million in Winnebago Industries shares, contingent upon Barletta’s achievement of performance milestones at the end of calendar 2021. As previously announced, certain growth objectives, if achieved through calendar years 2022 and 2023, provide the opportunity for up to $50 million in additional cash consideration.\n\n“This acquisition of Barletta extends Winnebago Industries’ marine platform into one of the fastest-growing boating segments, advances our ongoing evolution into a premier outdoor lifestyle company, and is expected to drive significant financial accretion,” commented Michael Happe, Winnebago Industries President and Chief Executive Officer. “Barletta’s commitment to quality, innovation and service in addition to their strong dealer relationships has allowed them to become the fastest growing pontoon boat manufacturer in the industry and makes them a natural fit into our portfolio. We are excited to work with the talented Barletta team and their high-quality dealer partners to bring our now extended portfolio of premium products to families looking to create great outdoor experiences on land or on water and drive new growth opportunities and significant value creation for our employees and shareholders.”\n\nLazard acted as the exclusive financial advisor to Winnebago Industries and Faegre Drinker Biddle & Reath LLP served as legal advisor.\n\nAbout Winnebago Industries\n\nWinnebago Industries, Inc. (NYSE: WGO) is a leading North American manufacturer of outdoor lifestyle products under the Winnebago, Grand Design, Chris-Craft, Newmar and Barletta brands, which are used primarily in leisure travel and outdoor recreation activities. The Company builds quality motorhomes, travel trailers, fifth wheel products, boats and commercial community outreach vehicles. Winnebago Industries has multiple facilities in Iowa, Indiana, Minnesota and Florida. For access to Winnebago Industries' investor relations material or to add your name to an automatic email list for Company news releases, visit http://investor.wgo.net.\n\nAbout Barletta Pontoon Boats\n\nHeadquartered in Bristol, Indiana, Barletta Pontoon Boats is a premium pontoon boat manufacturer whose focus on high-quality, innovative products, unrivaled customer experience and strong dealer relationships have propelled its rapid growth since it was founded in 2017. Today, Barletta is the fastest-growing company in the pontoon segment with over 300 dedicated employees and an expansive network of dealer partners across the United States and Canada. Visit barlettapontoonboats.com for more information.\n\nForward Looking Statements\n\nThis press release may contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Investors are cautioned that forward-looking statements are inherently uncertain and involve potential risks and uncertainties. A number of factors could cause actual results to differ materially from these statements, including, but not limited to competition and new product introductions by competitors, our ability to attract and retain qualified personnel, increases in market compensation rates, business or production disruptions, sales order cancellations, risk related to the terms of our credit agreement and compliance with debt covenants and leverage ratios, stock price volatility and share dilution, disruptions or unanticipated costs from facility expansions, availability of labor, a slowdown in the economy, low consumer confidence, the effect of global tensions, increases in interest rates, availability of credit, availability of financing for RV and marine dealers, impairment of goodwill, risk related to cyclicality and seasonality of our business, slower than anticipated sales of new or existing products, integration of operations relating to merger and acquisition activities generally, the possibility that the Barletta acquisition may not perform as expected or may not result in earnings growth, difficulties and expenses related to integrating Barletta into our business, possible unknown liabilities of Barletta, significant costs related to the Barletta acquisition, increased focus of management attention and resources on the Barletta acquisition, inadequate liquidity or capital resources, inventory and distribution channel management, our ability to innovate, our reliance on large dealer organizations, significant increase in repurchase obligations, availability and price of fuel, availability of chassis and other key component parts, increased material and component costs, exposure to warranty claims, ability to protect our intellectual property, exposure to product liability claims, dependence on information systems and web applications, risk related to data security, governmental regulation, including for climate change and risk related to anti-takeover provisions applicable to us. Additional information concerning certain risks and uncertainties that could cause actual results to differ materially from that projected or suggested is contained in the Company's filings with the Securities and Exchange Commission (SEC) over the last 12 months, copies of which are available from the SEC or from the Company upon request. The Company disclaims any obligation or undertaking to disseminate any updates or revisions to any forward looking statements contained in this release or to reflect any changes in the Company's expectations after the date of this release or any change in events, conditions or circumstances on which any statement is based, except as required by law."}, {"url": "https://www.lichtsinn.com/winnebago-dealer/winnebago-dealer-brooklyn-ny", "page_content": "Lichtsinn RV, the top Winnebago Dealer in North America, is ready to assist you in Brooklyn, New York just like other recent customers we have sold Winnebago RVs to from your area. Lichtsinn RV is your dealership of choice whether you are looking to buy a New or Used Winnebago Motor Home, service and repair a Winnebago or Itasca motor home, or in need of ordering a Winnebago, Itasca, Winnebago Touring Coach or Workhorse Motor Home Parts. See what our guests have to say about their experience with Lichtsinn RV.\n\n\n\nAs the closest dealer to Winnebago Industries in Forest City, Iowa (only 1 mile away), we are privileged to provide customers from all over North America with New Winnebago Motor Homes having NO DELIVERY MILES or stress on them! This allows you to break in your RV the way Winnebago recommends. WHY BUY from Lichtsinn RV. We are a New and Used Winnebago Motorhome Dealer, in business for over 45 years, earning awards of Top Winnebago Dealer in North America for the past 5 consecutive years and the Top Motorhome Dealer in Iowa for over 18 years . Providing expert product knowledge and superior guest service on RVs for Sale to customers like you in Brooklyn, NY as confirmed by our receipt of the Winnebago Flying W Customer Service Award each year for over 25 years. Using our website you can view our New Winnebago Motorhomes, Used RVs or many other Motorhomes for Sale.\n\nLichtsinn RV provides quality Used RVs for the Brooklyn, NY area\n\nLichtsinn RV is proud to provide quality Used Winnebago Motorhomes and other RV brands for guests from the Brooklyn, NY area looking to purchase a Used Motor Home. Our sales consultants provide exceptional guest service to each of our guests. When you walk into our Winnebago dealership after coming from Brooklyn, NY you'll experience guest service that stands out from other RV Dealerships. We’re confident you'll find the perfect used Winnebago Motorhome or other brand Motor Home at Lichtsinn RV. Many of our Pre-Owned Motorhomes come with a Certified Preowned RV Warranty. We look forward to meeting and assisting guests from Brooklyn, NY! See our Map of sold guests from throughout the Country.\n\nGet Directions to Lichtsinn RV\n\nRV Service & Repair servicing Brooklyn, New York\n\nLichtsinn RV is your premier choice to service your New Winnebago or RV if you live near Brooklyn, NY. We have years of experience and our RVDA certified technicians are highly skilled in servicing new and used Winnebago Motor Homes . Customers from Brooklyn, NY and around the country keep traveling back to our dealership for their Winnebago RV repairs as they receive professional treatment in a friendly atmosphere. Lichtsinn RV’s standard of service and repair is unprecedented! See what our guests have to say about their experience with the Lichtsinn RV Service Department.\n\nSchedule Service\n\nWinnebago RV Parts for Brooklyn, New York\n\nWhen the time does come for you to order Winnebago RV Parts, we offer Winnebago, Itasca, Winnebago Touring Coach and Workhorse Parts at competitive discounts. As the closest dealer to the Winnebago factory we are afforded the opportunity to provide you with same-day shipping on all in-stock parts from our warehouse and from Winnebago Industries warehouse. We offer fair shipping quotes and you can avoid sales tax on out-of-state shipments! Our resourceful team ships parts to Brooklyn, NY, throughout the country and internationally. We have the largest Winnebago Parts Department in the Country and our factory trained parts team is very knowledgeable in finding the correct part the first time.\n\n\n\nAt LichtsinnRV.com we also have the only Winnebago Parts Price Look-Up Tool in the Country! PLUS, if you are a WIT Club member we offer a 10% discount on Winnebago parts!\n\n\n\nParts Order\n\nCustomer Testimonial\n\nWhile we do not have facilities in Brooklyn, NY, we do work with customers from all over North America. Customers like Tim & Dena from Northborough, Massachusetts, who have this to say about our Forest City, Iowa, dealership:\n\n\"You have distinguished yourself by your attention to detail regarding communication before sale, during sale, after sale and delivery. The quick response to questions by phone, e-mail and your informative website gave us a level of confidence about purchasing our RV from a dealer 1,600 miles from our home. It was amazing actually. You anticipated our needs and met them. As customers, we are delighted!\"\n\n\n\nCheck out our reviews on Google and Facebook to find out what other guests have to say about their experiences at Lichtsinn RV."}, {"url": "https://www.smartrvguide.com/winnebago-rvs-for-sale-in-brooklyn-new_york", "page_content": "$52,000\n\nBrooklyn, New York\n\nYear 2003 Make Winnebago Model Journey 36 Category - Length 36 Posted Over 1 Month\n\n2003 Winnebago Journey 36, 2003 Journey 36 DL - Cat 330 engine - Allison 3000 6 speed tranny - Fullbody paint - 77k miles (approx) - Onan 7.5 Quiet Diesel generator with 1,200 hours (approx) Many Major Upgrades - Every single rug in this unit was removed the day I brought it home and replaced with beautiful and durable wood look linoleum - All leather couches - Extra 15,000 but Coleman Mach 1 PowerSaver rooftop AC unit added. This unit can keep you cold in some of the hottest temps - Washer / Dryer Unit installed - Awning over every window. Main large awning and over door are power awnings.- Custom sun shades for front windows Meticulously Maintained with all service records kept - Transmission has been fully serviced with filters and double flushed and filled with Transynd (Synthetic Tranny Fluid)) - All belts serviced and changed to Gate Heavy Duty Green-stripe belts - Radiator has been flushed and fully serviced - Coolant Overflow tank has been replaced as a preventative maintenance item - All valve adjustments have been done as per Cat specs - Extra belts and filters included Below is a video I had made awhile back, but it gives you a good idea of what RV looks like and has in it. Definitely check it out: Click 2003 Journey DL to view my 2003 Journey Video The RV is in great condition. Always fully maintained, serviced and exercised. Absolutely no rust on the frame. Stored fully covered every winter. Lightly used, no one ever full timed in it and that is very obvious when you see it. I bought it in 2009 and it has provided me with many years of trouble free flawless service. I would not hesitate driving it across the country tomorrow. Pulls hills without even flinching. We are selling it because we no longer have the time to use it as mush as we used to in the past. If sold for right price, I will provide Blue Ox 10k lb tow bar and brake Buddy. Must come and see it for yourself. Owned fully outright and have title in hand. Can help with delivery. Note that unit is for sale locally and I reserve right to end auction early. Call or text me with any questions, anytime. Steve 917-604-6487 $52,000.00 9176046487"}, {"url": "https://www.smartrvguide.com/winnebago-journey-rvs-for-sale-in-brooklyn-new_york", "page_content": "$52,000\n\nBrooklyn, New York\n\nYear 2003 Make Winnebago Model Journey 36 Category - Length 36 Posted Over 1 Month\n\n2003 Winnebago Journey 36, 2003 Journey 36 DL - Cat 330 engine - Allison 3000 6 speed tranny - Fullbody paint - 77k miles (approx) - Onan 7.5 Quiet Diesel generator with 1,200 hours (approx) Many Major Upgrades - Every single rug in this unit was removed the day I brought it home and replaced with beautiful and durable wood look linoleum - All leather couches - Extra 15,000 but Coleman Mach 1 PowerSaver rooftop AC unit added. This unit can keep you cold in some of the hottest temps - Washer / Dryer Unit installed - Awning over every window. Main large awning and over door are power awnings.- Custom sun shades for front windows Meticulously Maintained with all service records kept - Transmission has been fully serviced with filters and double flushed and filled with Transynd (Synthetic Tranny Fluid)) - All belts serviced and changed to Gate Heavy Duty Green-stripe belts - Radiator has been flushed and fully serviced - Coolant Overflow tank has been replaced as a preventative maintenance item - All valve adjustments have been done as per Cat specs - Extra belts and filters included Below is a video I had made awhile back, but it gives you a good idea of what RV looks like and has in it. Definitely check it out: Click 2003 Journey DL to view my 2003 Journey Video The RV is in great condition. Always fully maintained, serviced and exercised. Absolutely no rust on the frame. Stored fully covered every winter. Lightly used, no one ever full timed in it and that is very obvious when you see it. I bought it in 2009 and it has provided me with many years of trouble free flawless service. I would not hesitate driving it across the country tomorrow. Pulls hills without even flinching. We are selling it because we no longer have the time to use it as mush as we used to in the past. If sold for right price, I will provide Blue Ox 10k lb tow bar and brake Buddy. Must come and see it for yourself. Owned fully outright and have title in hand. Can help with delivery. Note that unit is for sale locally and I reserve right to end auction early. Call or text me with any questions, anytime. Steve 917-604-6487 $52,000.00 9176046487"}, {"url": "https://winnebago.gcs-web.com/news-releases/news-release-details/winnebago-launches-real-deal-dealer-days-event", "page_content": "Showcases New 2016 Lineup With All New Adventurer/Suncruiser\n\n\n\nand New Scorpion Toy Hauler Fifth Wheel Lines\n\nLAS VEGAS, NV -- ( Marketwired ) -- 04/09/15 -- Winnebago Industries, Inc. (NYSE: WGO), a leading United States (U.S.) recreation vehicle manufacturers, launched the Company's new 2016 motorhome and towable lines today at The Mirage Hotel in Las Vegas, Nev.\n\n\"Winnebago is the 'Real Deal', and we're proud to display the best and most comprehensive lineup in the Company's history,\" said Winnebago Vice President of Sales and Product Management Scott Degnan . \"With nearly 500 in attendance, we are seeing great response to new and redesigned products from what we consider the best dealer network in the industry.\"\n\nThe Adventurer and Suncruiser, Winnebago's flagship Class A gas models, have been totally redesigned inside and out. The exterior includes new front and rear molded fiberglass styling, as well as new lights, LED accent lights, aluminum finned grill and molded \"blade-type\" wheel trims with chrome accents. Inside, the excitement continues with new interior upgrades as well with a new contemporary dash, \"pull-over\" passenger work station with USB and 12-volt ports, new Xite G3 Infotainment system, new tile flooring extending into the cab area, new interior décor, curb view window and much more. The Adventurer and Suncruiser are a fantastic alternative to a consumer who wants the look and functionality of a higher-end diesel, but on a gas platform.\n\nThe iconic Winnebago design just became even more \"cool\" with the addition of the new \"Daytona\" full-body paint option to the retro-style Brave and Tribute motorhomes. This motorhome line is a great mix of the past and present with three unique Winnebago floorplans.\n\nWinnebago also introduced an all-new Journey and Meridian 38P four-slide floorplan. The 38P features an island wrap-around galley, large pop-up TV with Rest Easy sofa, large picture window on the patio side and spacious bedroom and bathroom with Winnebago's largest shower.\n\nA new Scorpion premium fifth wheel toy hauler is joining the Winnebago lineup and offers a large 14-foot garage space to haul all your toys. The garage portion of the Scorpion features a private half bath, sliding glass door, as well as facing sofas with an optional queen bed. The ramp provides a 15 degree clearance for easy entry. When not in use as a ramp, the door becomes a patio with an optional sliding patio railing with retractable steps. Inside the living area of the unit, the wide body design and radius ceiling provide a spacious interior with features such as a 55\" TV, a large island with raised breakfast bar and much more.\n\nWinnebago's brand licensing partners also have products on display, including two new Winnebago park model RVs, Winnebago RV Covers and Winnebago Headwear and Apparel.\n\nAbout Winnebago Industries\n\nWinnebago Industries, Inc. , \"The Most Recognized Name in Motor Homes ®\", is a leading U.S. manufacturer of recreation vehicles, which are used primarily in leisure travel and outdoor recreation activities. The Company builds quality motor homes, travel trailers, fifth wheel products, and transit buses. Winnebago Industries has received the Quality Circle Award from the Recreation Vehicle Dealers Association every year since 1996. The Company's common stock is listed on the New York and Chicago Stock Exchanges and traded under the symbol WGO. Options for the Company's common stock are traded on the Chicago Board Options Exchange . For access to Winnebago Industries' investor relations material or to add your name to an automatic email list for Company news releases, visit http://investor.wgo.net.\n\nContact:\n\nSheila Davis\n\nPR/IR Mgr.\n\n641-585-6803\n\nsdavis@wgo.net"}, {"url": "https://seekingalpha.com/news/3499431-winnebago-buys-premium-rv-maker-newmar-in-344m-deal", "page_content": "To ensure this doesn’t happen in the future, please enable Javascript and cookies in your browser.\n\nIs this happening to you frequently? Please report it on our feedback forum. If you have an ad-blocker enabled you may be blocked from proceeding. Please disable your ad-blocker and refresh.\n\nIf you have an ad-blocker enabled you may be blocked from proceeding. Please disable your ad-blocker and refresh."}, {"url": "https://www.smartrvguide.com/winnebago-36-rvs-for-sale-in-brooklyn-new_york", "page_content": "$52,000\n\nBrooklyn, New York\n\nYear 2003 Make Winnebago Model Journey 36 Category - Length 36 Posted Over 1 Month\n\n2003 Winnebago Journey 36, 2003 Journey 36 DL - Cat 330 engine - Allison 3000 6 speed tranny - Fullbody paint - 77k miles (approx) - Onan 7.5 Quiet Diesel generator with 1,200 hours (approx) Many Major Upgrades - Every single rug in this unit was removed the day I brought it home and replaced with beautiful and durable wood look linoleum - All leather couches - Extra 15,000 but Coleman Mach 1 PowerSaver rooftop AC unit added. This unit can keep you cold in some of the hottest temps - Washer / Dryer Unit installed - Awning over every window. Main large awning and over door are power awnings.- Custom sun shades for front windows Meticulously Maintained with all service records kept - Transmission has been fully serviced with filters and double flushed and filled with Transynd (Synthetic Tranny Fluid)) - All belts serviced and changed to Gate Heavy Duty Green-stripe belts - Radiator has been flushed and fully serviced - Coolant Overflow tank has been replaced as a preventative maintenance item - All valve adjustments have been done as per Cat specs - Extra belts and filters included Below is a video I had made awhile back, but it gives you a good idea of what RV looks like and has in it. Definitely check it out: Click 2003 Journey DL to view my 2003 Journey Video The RV is in great condition. Always fully maintained, serviced and exercised. Absolutely no rust on the frame. Stored fully covered every winter. Lightly used, no one ever full timed in it and that is very obvious when you see it. I bought it in 2009 and it has provided me with many years of trouble free flawless service. I would not hesitate driving it across the country tomorrow. Pulls hills without even flinching. We are selling it because we no longer have the time to use it as mush as we used to in the past. If sold for right price, I will provide Blue Ox 10k lb tow bar and brake Buddy. Must come and see it for yourself. Owned fully outright and have title in hand. Can help with delivery. Note that unit is for sale locally and I reserve right to end auction early. Call or text me with any questions, anytime. Steve 917-604-6487 $52,000.00 9176046487"}, {"url": "https://finance.yahoo.com/news/winnebago-boosts-rv-portfolio-344m-143902266.html", "page_content": "In a bid to boost its portfolio, Winnebago Industries, Inc. WGO recently inked a deal to acquire Indiana-based recreational vehicle (RV) manufacturer, Newmar Corporation, for $344 million.\n\nDeal Details\n\nTotal consideration of the deal is valued at $344 million, which will be funded by a combination of cash and stock, based on Winnebago’s $36.77 closing price on Sep 13. Winnebago will finance the deal with $270 million in cash and 2 million shares of its stock issued to Newmar shareholders. Per the pact, any stock price shortfall — as of the closing date — will be compensated by incremental cash payment up to $20 million.\n\nSubject to satisfactory closing conditions and regulatory approvals, the agreement is set for closure in first-quarter fiscal 2020. Upon completion of the deal, Newmar shareholders will hold approximately 6% of Winnebago’s outstanding shares. Newmar will operate as a standalone unit within Winnebago.\n\nDeal Motive\n\nWinnebago, which is a leading producer of RVs in the United States, primarily builds quality motorhomes, travel trailers, fifth wheel products and boats. Newmar, which manufactures luxury motorhomes, seems to be a natural fit in Winnebago’s portfolio of outdoor lifestyle brands. The complementary asset base has been the key driver of the deal.The Newmar buyout adds high-end motorized products to the existing Winnebago brand lineup. The deal will enable the companies to pool their expertise in the region and share their best practices, and bolster the combined entity’s scale and leadership position.\n\nDeal Benefits\n\nThis buyout is likely to bolster Winnebago’s product line and dealer network, and rev up the motor-home segment. The deal will expand Winnebago’s core RV platform, thereby enhancing its position in North American RV landscape.\n\nThe combined entity will have approximately $2.6 billion in pro-forma revenuesand lead to a reduction in debt. The deal is likely to be immediately accretive to its free cash flow and fiscal 2020 EPS. Additionally, the strategic acquisition is expected to lead to significant commercial, financial and operational synergies due to the integration of asset, systems and staff. The deal is also expected to result in cost savings of at least $5 million annually for a period of three years.\n\nWinnebago Gaining From Strategic Buyouts\n\nOn a year-to-date basis, Winnebago has rallied 55.6%, outperforming the industry’s growth of 37.8%. The company also surpassed earnings estimates in each of the trailing four quarters. Winnebago has been riding on the strength of its acquisitions, including the buyout of Grand Design and Chris-Craft in 2016 and 2018, respectively. The Grand Design acquisition expanded the existing towable RV product offerings of Winnebago, while the Chris-Craft takeover enabled the company to enter into the marine segment. These acquisitions bolstered the firm’s footprint and diversified portfolio in the outdoor lifestyle market. The Newmar acquisition is also likely to boost the performance of Winnebago.\n\nWill Growth Continue Amid Recession Worries?\n\nThe recreational vehicle industry is influenced by many strong macroeconomic factors and is extremely sensitive to overall strength of the economy, as buying an RV is a large discretionary purchase for majority of customers. With the weakening of the economy, RV sales generally fall sharply, as consumers do not feel confident enough in their financial stability to justify a large recreational purchase.\n\nThe industry has started to show signs of a slowdown, which is considered as an early warning sign of a recession. According to the RV Industry Association, RV unit shipments have declined around 20% so far this year, after declining 4.1% in 2018. Amid such a scenario, RV manufacturing biggie Thor Industries THO is scaling down the production of RVs. Further, LCI Industries LCII has consolidated some of its facilities in view of the slowdown. Headwinds like rising input costs and sluggish demand may impact the near-term performance of Winnebago, which carries a Zacks Rank #4 (Sell).\n\nNotably, wholesale shipments of RVs in 2019 are forecast to be 401,200 units, indicating a 17.1% year-over-year decline. Shipments for 2020 are likely to decline 3.5% to about 387,400 units. The industry is at risk from the U.S.-China trade war, with RV components likely to get impacted by tariffs, which would significantly raise prices for manufacturers. The price increase would likely be passed on to consumers, in turn lowering demand.\n\nDespite the cyclical downturn, the industry surely holds promise, as millennials are more inclined to spend on experiences that recreational vehicles can deliver. If the economy stays strong and continues to grow, RV sales will likely get a boost, thereby enhancing the performance of stocks within the industry.\n\nMeanwhile, a better-ranked stock in the RV space is Indiana-headquartered Skyline Champion Corporation SKY, which sports a Zacks Rank #1 (Strong Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nThe firm builds a variety of manufactured and modular homes, park-model RVs, along with modular buildings. It was formed by the merger of Skyline Corporation and Champion Enterprises Holdings, LLC in June 2018. Skyline Champion, which had generated $1.3 billion revenues last year, is one of the largest homebuilders in America of late.\n\n5 Stocks Set to Double\n\nZacks experts released their picks to gain +100% or more in 2020. One is a famous cutting-edge food company that is “hiding in plain sight.” Swamped with competitors and ignored by Wall Street, its stock price floundered. Now, suddenly, it acquired a company that gives it an advantage none of its peers have.\n\nToday, see all 5 stocks with extreme growth potential >>\n\n\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\n\n\nWinnebago Industries, Inc. (WGO) : Free Stock Analysis Report\n\n\n\nSkyline Corporation (SKY) : Free Stock Analysis Report\n\n\n\nThor Industries, Inc. (THO) : Free Stock Analysis Report\n\n\n\nLCI Industries (LCII) : Free Stock Analysis Report\n\n\n\nTo read this article on Zacks.com click here."}], "Winnebago Deal is an American indie rock band.": [{"url": "https://www.allmusic.com/artist/winnebago-deal-mn0000904976", "page_content": "Winnebago Deal Follow Artist +\n\nThe early 21st century may be remembered as the rock era when bands began 'downsizing' the amount of bandmembers, A plethora of duos appeared during this time (who handled all the chores themselves),…\n\nRead Full Biography"}, {"url": "https://www.sputnikmusic.com/bands/Winnebago-Deal/5225/", "page_content": "Winnebago Deal Rock (1 votes) Alternative Rock Ambient Americana Art Pop Atmospheric Black Metal Black Metal Bluegrass Blues Bossa Nova Breaks Britpop Classical Country Death Metal Deathcore Disco Djent Doom Metal Downtempo Dream Pop Drone Drum and Bass Dubstep Electronic Emo Experimental Folk Folk Punk Funeral Doom Funk Garage Glam Rock Gothic Grime Grind Groove Metal Grunge Hard Rock Hardcore Heavy Metal Hip-Hop House IDM Indie Folk Indie Pop Indie Rock Industrial Instrumental Hip-Hop Jam Rock Jazz Jazz Fusion Lo-fi Math Rock Mathcore Melodic Black Metal Melodic Death Metal Metal Metalcore Minimal New Age New Wave Noise Noise Rock Nu Jazz Nu-metal Pop Pop Punk Pop Rock Post Hardcore Post Metal Post Punk Post Rock Power Electronics Power Metal Progressive Metal Progressive Rock Psychedelic Punk R&B Reggae Rock Shoegaze Ska Sludge Metal Soul Soundtrack Stoner Rock Synthpop Techno Thrash Metal Trance Trip Hop\n\nWinnebago Deal started life as a four piece band in 1999 at Bartholomew School, in Eynsham (Oxford), though two of the original members left shortly after. Winnebago currently consists of two Bens, Ben Perrier (vocals, guitar) and Ben Thomas (drums). The two Bens generated strong support from local youth center gigs and many appearances at Oxford's Zodiac club, eventually supporting Fugazi at London's Forum, this lead to their first record, the Plata O Plomo EP in 2003. They were nominated for the Kerrang Award's 'Best British Newcomer' that year. Soon after, the band signed a recording con ...read more\n\n\n\nWinnebago Deal started life as a four piece band in 1999 at Bartholomew School, in Eynsham (Oxford), though two of the original members left shortly after. Winnebago currently consists of two Bens, Ben Perrier (vocals, guitar) and Ben Thomas (drums). The two Bens generated strong support from local youth center gigs and many appearances at Oxford's Zodiac club, eventually supporting Fugazi at London's Forum, this lead to their first record, the Plata O Plomo EP in 2003. They were nominated for the Kerrang Award's 'Best British Newcomer' that year. Soon after, the band signed a recording contract with Double Dragon Music, and produced their debut album Dead Gone with Jack Endino, released in September 2004. Plata O Plomo was reissued in Australia, with an expanded track listing. The two Bens then went on to play as Mondo Generator with Nick Oliveri, former Queens Of The Stone Age bassist/vocalist. As well as playing Mondo Generator gigs, they still toured as Winnebago Deal and even supported Mondo Generator, earing them the moniker Winnebago Generator from fans. Having entered Dave Grohl's studio to record the next Mondo Generator Album, it was announced in July 2006 that they had left the band for undisclosed reasons. In that same month they released their latest album Flight Of The Raven. It was produced by Jack Endino, producer of the first Nirvana album Bleach. The album features many other artists including band partner Nick Oliveri. « hide\n\nFlight Of The Raven\n\n2006\n\n\n\n3\n\n1 Votes Rate It Awful Very Poor Poor Average Good Great Excellent Superb Classic Dead Gone\n\n2004\n\n\n\n3.8\n\n2 Votes Rate It Awful Very Poor Poor Average Good Great Excellent Superb Classic George Dickel\n\n2004\n\n\n\nRate It Awful Very Poor Poor Average Good Great Excellent Superb Classic Plata O Plomo\n\n2003\n\n\n\nRate It Awful Very Poor Poor Average Good Great Excellent Superb Classic Contributors: Neoteric,"}, {"url": "https://winnebagodeal.bandcamp.com/", "page_content": "Digital Album Streaming + Download\n\nIncludes unlimited streaming via the free Bandcamp app, plus high-quality download in MP3, FLAC and more.\n\nPurchasable with gift card"}, {"url": "https://www.last.fm/music/Winebago+Deal/+wiki", "page_content": "The early 21st century may be remembered as the rock era when bands began 'downsizing' the amount of bandmembers, A plethora of duos appeared during this time (who handled all the chores themselves), including British heavies, Winnebago Deal. Hailing from Oxford, the group began as a quartet however, during 1999. With a sound comparable to classic Sub Pop bands and Queens of the Stone Age (when Nick Oliveri mans the mic), two of the original members exited shortly thereafter, leaving Ben Perrier (vocals, guitar) and Ben Thomas (drums) to fend for themselves. Making a name for themselves the old-fashioned way (touring incessantly via van for very little pay and handing out demos), the duo eventually began building a loyal following, which led to a gig supporting Fugazi at London's Forum, which in turn got the attention of the head of indie label Fierce Panda Records. This led to the release of the duo's debut EP, Plata O Plomo, in March of 2003, and as a result, racked up accolades (including being nominated 'Best British Newcomer' at that years' Kerrang Awards). 2003 was a busy one for the Ben's, as they played well over a hundred gigs (including a spot at the Reading/Leeds festivals, and playing alongside the likes of Burning Brides and Nebula). Several singles and EP's found their way into the shops during late 2003 and early 2004 Manhunt, a split 7\" with tour mates Nebula, and the George Dickel EP, while Winnebago Deal was invited to take part in one XFM and two Radio One sessions. A new recording contract with Double Dragon Music soon followed, as the duo hooked up with renowned Sub Pop producer Jack Endino (best known for working with both Nirvana and Soundgarden early on). The resulting debut full-length, Dead Gone, appeared in September 2004, which was prefaced by a few gigs supporting Mondo Generator. A month after their debut's release, Plata O Plomo was reissued in Australia, with an expanded track listing.\n\n-Greg Prato / allmusic.com\n\nBetween the release of \"Dead Gone\" and recording the new album \"Flight Of The Raven\" Winnebago Deal toured the UK and Europe with High On Fire, Brant Bjork & The Bros, Therapy?, The Eighties Matchbox B-Line Disaster, Tokyo Dragons and The Dwarves, as well as playing in Nick Oliveri's band Mondo Generator for European and US shows including a German tour with Motorhead and the recording of songs for the new Mondo album."}, {"url": "https://music.metason.net/artistinfo?name=Winnebago%20Deal", "page_content": "Winnebago Deal\n\nBand, *1999 GB, Oxford\n\nAlternative and Rock\n\nWinnebago Deal are a rock music band from Oxford, United Kingdom. They started life in the late 1990s at Bartholomew School in Eynsham, with Ben Perrier (vocals, guitar) and Ben Thomas (then on guitar) writing songs then recruiting a drummer and bass player through an ad. They played their first gig in early 1999 and fired the bass player a few months later, with Ben Thomas switching from guitar to bass. By the summer of 2000, Perrier and Thomas' dissatisfaction with their drummer led to his departure, with Thomas switching from bass to drums so the band could continue as a two-piece. Winnebago Deal now consists of two Bens, Ben Perrier (vocals, guitar) and Ben Thomas (drums)."}, {"url": "https://www.wikiwand.com/en/Winnebago_Deal", "page_content": "Winnebago Deal are a British rock band from Oxford. They formed in the late 1990s at Bartholomew School in Eynsham, with Ben Perrier (vocals, guitar) and Ben Thomas (drums). Perrier and Thomas decided to perform as a duo after ejecting some early members.[1] Their sound has been compared to Queens of the Stone Age and the bands who recorded for Sub Pop Records.[1] Winnebago Deal generated strong support from many appearances at Oxford's Zodiac club, eventually supporting Fugazi at London's Forum.[2] Their first release was the EP Plata O Plomo in 2003.[1] They were nominated as Best British Newcomer at that year's Kerrang! awards.[3]\n\nQuick facts: Winnebago Deal, Origin, Genres, Years active,... ▼\n\nThe band then signed with Double Dragon Music, and recorded their debut album Dead Gone with producer Jack Endino.[1] The album was released in September 2004 and was positively reviewed by Drowned in Sound.[4] During this period, Perrier and Thomas toured with the band Mondo Generator (headed by Nick Oliveri), while also opening for Mondo Generator as Winnebago Deal.[5] Perrier and Thomas recorded some tracks for the Mondo Generator album Dead Planet but then left the project.[6]\n\nThe second Winnebago Deal album, Flight of the Raven, was released in 2006 with Endino again producing. This album was also reviewed positively by Drowned in Sound.[7] Their third album, Career Suicide, was released in 2010. In a review of the album, Rock Sound called Winnebago Deal \"A ridiculously overlooked and consistently great band\".[8]"}, {"url": "https://www.musicomh.com/reviews/albums/winnebago-deal-flight-of-the-raven", "page_content": "Album Reviews\n\nWinnebago Deal – Flight Of The Raven (Fierce Panda) UK release date: 10 July 2006\n\nWhen a band describes themselves as AC/DC meets Black Flag you know they are either ridiculously deluded or, as is the case with Oxford duo Winnebago Deal, that they have spent their entire youths holed up in dank rehearsal rooms, consuming, digesting and emulating their rock god heroes; earning their right to spew forth their very own brand of pedal-to-the-metal, punk-infused rock and roll.\n\nConsisting of two men named, uh Ben, Winnebago Deal have been touring constantly for the past six years; building a fan base where none existed often through sheer repetitive effort; playing venues that most bands would turn down; and touring in a van packed so tightly that mere accessories like bass players and their equipment have had to be dismissed along the way. Although, as two pieces go, these boys make The White Stripes look like purveyors of stagnant nursery rhymes.\n\nFlight Of The Raven is their second full-length album, released on renowned indie label Fierce Panda. Opener With Friends Like These sets the tone for an album of stoner-influenced, punk-paced drinking tunes that will never make it to radio but, thanks to the boys’ commitment to relentless touring, should still be coming to a town near you.\n\nFuture single Spider Bite starts with a muted, rolling riff that is unleashed into a thrashing tub-thumping rock number, complete with Hellacopters piano lick in the mid-section and the gruffest vocals you will hear on a song about spiders, ever. Reeper, meanwhile, is a slice of Fu Manchu in their early days with Cathedral‘s Lee Dorrian on vocal duties, tearing through their balls-out rock and roll by-numbers tune with style.\n\nVenomised sees the velocity slowed way down for a crushing horror groove that grinds its way through three minutes of feedback-laced lead lines and whispered female backing vocals. A Dose Of Something is just what the doctor ordered, back firmly in late ’90s stoner territory, and makes it clear to see why this band have supported Nebula on numerous occasions. The title track features some of the rawest vocals you will ever hear, and follower You Let Me Down will have you scratching your head as to just how two instruments can make this much noise.\n\nWhile some rock bands seek to take their influences and set about trying to forge an as yet undiscovered musical mastery, there are others who simply reproduce their heroes’ chords in a different order and make a packet on the back of someone else’s creativity. Thankfully Winnebago Deal turn the latter position on its head, where they are only too happy to pay constant homage to their inspiration. You can barely find an interview where the lads aren’t shouting about Melvins or Black Flag; and it’s because of this that the blistering live duo will gain respect enough to negate what they’re lacking in originality and hopefully win some fans en route."}, {"url": "https://en-academic.com/dic.nsf/enwiki/1614420", "page_content": "Infobox musical artist\n\nName = Winnebago Deal\n\n\n\n\n\nImg_capt =\n\nImg_size =\n\nLandscape =\n\nBackground = group_or_band\n\nAlias =\n\nOrigin = England\n\nGenre = Rock\n\nYears_active = 1999–present\n\nLabel = Fierce Panda Records , Double Dragon Music\n\nAssociated_acts =\n\nURL = [ http://www.winnebagodeal.com/ www.winnebagodeal.com ]\n\nCurrent_members = Ben Perrier\n\nBen Thomas\n\nPast_members =\n\nNotable_instruments =\n\nWinnebago Deal is a rock music band from Oxford , United Kingdom . It started life in the late 90s at Bartholomew School in Eynsham , with Ben Perrier (vocals, guitar) and Ben Thomas (then on guitar) writing songs then recruiting a drummer and bass player through an ad. They played their first gig in early 1999 and fired the bass player a few months later, with Ben Thomas switching from guitar to bass. By the summer of 2000, Perrier and Thomas' disatisfaction with their drummer led to his departure, with Thomas switching from bass to drums so the band could continue as a 2-piece. Winnebago Deal now consists of two Bens, Ben Perrier (vocals, guitar) and Ben Thomas (drums).\n\nWinnebago Deal generated strong support from local youth center gigs and many appearances at Oxford's Zodiac club, eventually supporting Fugazi at London's Forum; this led to their first record, the \" Plata O Plomo \" EP in 2003 . They were nominated for the Kerrang Award's 'Best British Newcomer' that year. Soon after, the band signed a recording contract with Double Dragon Music , and produced their debut album \" Dead Gone \" with Jack Endino , producer of the first Nirvana album \" Bleach \". \" Dead Gone \" was released in September 2004 . \"Plata O Plomo\" was reissued in Australia later that year, with an expanded track listing.\n\nThe \"two Bens\" then went on to play as Mondo Generator with Nick Oliveri , former Queens of the Stone Age bassist/vocalist. As well as playing Mondo Generator gigs, they still toured as Winnebago Deal and even supported Mondo Generator , earing them the moniker \"Winnebago Generator\" from fans. After recording tracks at Dave Grohl 's Studio 606 for the next Mondo Generator album with producer Nick Raskulinecz, it was announced in July 2006 that they had left the band for \"undisclosed reasons\".\n\nIn that same month they released their second full-length album \" Flight Of The Raven \", with the band again chosing to record with producer Jack Endino . The album features guest appearances from other artists including band partner Nick Oliveri , Endino, local thugs Paul Morrill and Edward \"Raven\" Heaton from the band Sicarios, and the legendary Rusty Needles of Oxford band Deguello, and was cited as the sixth best album in 2006 by Kerrang! writer Raziq Rauf . In 2007 the Bens formed a new band called The Dresdens with their comrade Jack Goldstein of Oxford band Gunnbunny.\n\nWinnebago Deal are currently working on songs for their third full-length album.\n\nDiscography\n\nAlbums\n\n*\" Dead Gone \" - (27 September 2004)\n\n*\" Flight Of The Raven \" - (10 July 2006)\n\nEP\n\n*\" Plata O Plomo \" - (24 March 2003)\n\n*\" George Dickel EP \" - (5 April 2004)\n\ningles\n\n*\"Manhunt\" - (11 August 2003)\n\n*\" Nebula/Winnebago Deal Split 7\" \" - (8 December 2003) - Limited to 1800 copies.:A: Nebula - \"Strange Human\":AA: Winnebago Deal - \" Takin' Care of Business \"\n\n*\"Cobra\" - (13 September 2004)\n\n*\"Did it, Done It, Doing It Again\" - (25 April 2005)\n\n*\"Spider Bite\" - (17 July 2006)\n\n*\"Reeper\" - (13 November 2006)\n\nCompilations\n\n*\"\" - (1 March 2004):contributed track 17 - \"Manhunt\"\n\n*\" Road To Nowhere \" - (25 September 2007) [ http://www.poisontreerecords.com Poison Tree Records ] :contributed track 05 - \"Venomized\"\n\nAwards\n\n(Nominated) Best British Newcomer - Kerrang! Awards 2003\n\nExternal links"}, {"url": "https://www.wikiwand.com/en/George_Dickel_(EP)", "page_content": "Winnebago Deal are a British rock band from Oxford. They formed in the late 1990s at Bartholomew School in Eynsham, with Ben Perrier (vocals, guitar) and Ben Thomas (drums). Perrier and Thomas decided to perform as a duo after ejecting some early members.[1] Their sound has been compared to Queens of the Stone Age and the bands who recorded for Sub Pop Records.[1] Winnebago Deal generated strong support from many appearances at Oxford's Zodiac club, eventually supporting Fugazi at London's Forum.[2] Their first release was the EP Plata O Plomo in 2003.[1] They were nominated as Best British Newcomer at that year's Kerrang! awards.[3]\n\nQuick facts: Winnebago Deal, Origin, Genres, Years active,... ▼\n\nThe band then signed with Double Dragon Music, and recorded their debut album Dead Gone with producer Jack Endino.[1] The album was released in September 2004 and was positively reviewed by Drowned in Sound.[4] During this period, Perrier and Thomas toured with the band Mondo Generator (headed by Nick Oliveri), while also opening for Mondo Generator as Winnebago Deal.[5] Perrier and Thomas recorded some tracks for the Mondo Generator album Dead Planet but then left the project.[6]\n\nThe second Winnebago Deal album, Flight of the Raven, was released in 2006 with Endino again producing. This album was also reviewed positively by Drowned in Sound.[7] Their third album, Career Suicide, was released in 2010. In a review of the album, Rock Sound called Winnebago Deal \"A ridiculously overlooked and consistently great band\".[8]"}, {"url": "https://www.allmusic.com/artist/winnebago-deal-mn0000904976/credits", "page_content": "Credits Winnebago Deal Follow Artist +\n\nThe early 21st century may be remembered as the rock era when bands began 'downsizing' the amount of bandmembers, A plethora of duos appeared during this time (who handled all the chores themselves),…\n\nRead Full Biography"}]}