{"Winnebago Deal has released three full-length albums, two EPs, and a handful of singles.": [{"url": "https://www.wikiwand.com/en/Winnebago_Deal", "page_content": "Winnebago Deal are a British rock band from Oxford. They formed in the late 1990s at Bartholomew School in Eynsham, with Ben Perrier (vocals, guitar) and Ben Thomas (drums). Perrier and Thomas decided to perform as a duo after ejecting some early members.[1] Their sound has been compared to Queens of the Stone Age and the bands who recorded for Sub Pop Records.[1] Winnebago Deal generated strong support from many appearances at Oxford's Zodiac club, eventually supporting Fugazi at London's Forum.[2] Their first release was the EP Plata O Plomo in 2003.[1] They were nominated as Best British Newcomer at that year's Kerrang! awards.[3]\n\nQuick facts: Winnebago Deal, Origin, Genres, Years active,... ▼\n\nThe band then signed with Double Dragon Music, and recorded their debut album Dead Gone with producer Jack Endino.[1] The album was released in September 2004 and was positively reviewed by Drowned in Sound.[4] During this period, Perrier and Thomas toured with the band Mondo Generator (headed by Nick Oliveri), while also opening for Mondo Generator as Winnebago Deal.[5] Perrier and Thomas recorded some tracks for the Mondo Generator album Dead Planet but then left the project.[6]\n\nThe second Winnebago Deal album, Flight of the Raven, was released in 2006 with Endino again producing. This album was also reviewed positively by Drowned in Sound.[7] Their third album, Career Suicide, was released in 2010. In a review of the album, Rock Sound called Winnebago Deal \"A ridiculously overlooked and consistently great band\".[8]"}, {"url": "https://www.allmusic.com/artist/winnebago-deal-mn0000904976/discography", "page_content": "Discography Winnebago Deal Follow Artist +\n\nThe early 21st century may be remembered as the rock era when bands began 'downsizing' the amount of bandmembers, A plethora of duos appeared during this time (who handled all the chores themselves),…\n\nRead Full Biography"}, {"url": "https://www.liquisearch.com/winnebago_deal", "page_content": "Winnebago Deal are a rock music band from Oxford, United Kingdom. They started life in the late 1990s at Bartholomew School in Eynsham, with Ben Perrier (vocals, guitar) and Ben Thomas (then on guitar) writing songs then recruiting a drummer and bass player through an ad. They played their first gig in early 1999 and fired the bass player a few months later, with Ben Thomas switching from guitar to bass. By the summer of 2000, Perrier and Thomas' dissatisfaction with their drummer led to his departure, with Thomas switching from bass to drums so the band could continue as a two-piece. Winnebago Deal now consists of two Bens, Ben Perrier (vocals, guitar) and Ben Thomas (drums).\n\nWinnebago Deal generated strong support from many appearances at Oxford's Zodiac club, eventually supporting Fugazi at London's Forum; this led to their first record, the Plata O Plomo EP in 2003. They were nominated for the Kerrang Award's 'Best British Newcomer' that year. Soon after, the band signed a recording contract with Double Dragon Music, and produced their debut album Dead Gone with Jack Endino, producer of the first Nirvana album Bleach. Dead Gone was released in September 2004. Plata O Plomo was reissued in Australia later that year, with an expanded track listing.\n\nThe \"two Bens\" then went on to play as Mondo Generator with Nick Oliveri, former Queens of the Stone Age bassist–vocalist. As well as playing Mondo Generator gigs, they still toured as Winnebago Deal and even supported Mondo Generator, earning them the moniker \"Winnebago Generator\" from fans. After recording tracks at Dave Grohl's Studio 606 for the next Mondo Generator album with producer Nick Raskulinecz, it was announced in July 2006 that they had left the band for \"undisclosed reasons\".\n\nIn that same month they released their second full-length album Flight Of The Raven, with the band again choosing to record with producer Jack Endino. The album features guest appearances from other artists including band partner Nick Oliveri, Endino, Paul Morrill and Edward \"Raven\" Heaton from the band Sicarios, and Rusty Needles of Oxford band Deguello, and was cited as the sixth best album in 2006 by Kerrang! writer Raziq Rauf.\n\nWinnebago Deal's third full-length album, \"Career Suicide\", was recorded in November 2009 and released a year later."}, {"url": "https://winnebago.gcs-web.com/news-releases/news-release-details/winnebago-industries-announces-strong-fourth-quarter-and-full", "page_content": "-- RV Market Share Gains Continue --\n\n-- Quarterly Revenues Up 39.1% Year-Over-Year, Driven by Strong End Consumer Demand --\n\n-- Fourth Quarter Gross Margin Expansion of 90 Basis Points --\n\n-- Reported Quarterly Diluted EPS of $1.25 ; Adjusted EPS of $1.45 Up 45.0% Over Prior Year --\n\n-- Cash Flow From Operations of $270.4 million for the Fiscal Year Up 102.2% Over Prior Year --\n\nFOREST CITY, Iowa , Oct. 21, 2020 (GLOBE NEWSWIRE) -- Winnebago Industries, Inc. (NYSE: WGO), a leading outdoor lifestyle product manufacturer, today reported financial results for the Company's fourth quarter and full year Fiscal 2020.\n\nFourth Quarter Fiscal 2020 Results\n\nRevenues for the Fiscal 2020 fourth quarter ended August 29, 2020 , were $737.8 million , an increase of 39.1% compared to $530.4 million for the Fiscal 2019 period. Revenues for Newmar , which was acquired in the first quarter of Fiscal 2020, were $126.3 million . Revenues excluding Newmar were $611.5 million , reflecting an organic increase of 15.3% compared to the Fiscal 2019 period primarily driven by growth in the Towable segment. Gross profit was $122.5 million compared to $83.2 million for the Fiscal 2019 period. Gross profit margin increased 90 basis points in the quarter, driven by Motorhome segment lower input costs and Towable segment fixed cost leverage, partially offset by segment mix. Operating income was $68.4 million for the quarter, an increase of 52.8% compared to $44.8 million for the fourth quarter last year, driven by Towable segment revenue growth and the addition of Newmar . Fiscal 2020 fourth quarter net income was $42.5 million , an increase of 33.2% compared to $31.9 million in the fourth quarter of last year, driven by the growth in operating income partially offset by increased interest expense. The increase in interest expense is related to the convertible bond issued to finance the acquisition of Newmar , and separately, the write-off of certain debt issuance costs associated with the termination of the company's Term Loan B which was refinanced by a bond issuance during the quarter. Earnings per diluted share was $1.25 , an increase of 23.8% compared to $1.01 in the same period last year. Adjusted earnings per diluted share was $1.45 for the fourth quarter, an increase of 45.0% compared to adjusted earnings per diluted share of $1.00 in the same period last year. Fiscal 2020 fourth quarter consolidated adjusted earnings per diluted share excludes costs totaling $6.6 million , or $0.20 per diluted share, after tax, driven by debt issuance costs written off due to the termination of the Term Loan B, and the non-cash portion of interest expense related to the convertible bond. Consolidated Adjusted EBITDA was $76.5 million for the quarter, compared to $50.8 million last year, representing an increase of 50.5%.\n\nPresident and Chief Executive Officer Michael Happe commented, “In the face of the unprecedented impacts of the COVID-19 pandemic, our strong fourth quarter finish to the year was a testament to the incredible resolve of our world-class team, the strength of our portfolio of leading outdoor lifestyle brands, and our efficiency in quickly and safely resuming operations to meet tremendous consumer demand. We added motorized scale through the acquisition of Newmar and continued to grow our RV market share throughout the year by leveraging strong dealer relationships, exciting new products and record consumer interest. Winnebago Industries also generated expanded margins and stronger cash flows, while delivering a quality product and customer experience in collaboration with our channel partners. Looking ahead, we enter our 2021 fiscal year with four premier brand platforms, strong operational momentum, a record backlog, and the financial flexibility to manage through the ongoing uncertainty in the environment. Our efforts continue to rally around building an extraordinary outdoor lifestyle company, and creating value for our end customers, dealers, employees and shareholders. I want to thank all of our Winnebago Industries employees for their resilience and commitment during these unique times and focusing on giving our customers a safe and memorable experience with our products in the outdoors.\"\n\nFull Year Fiscal 2020 Results\n\nFiscal 2020 revenues of $2.4 billion increased 18.6% from $2.0 billion in Fiscal 2019. Revenues for Newmar , which was acquired in the first quarter of Fiscal 2020, were $388.4 million . Revenues excluding Newmar were $2.0 billion , roughly flat with Fiscal 2019 as a result of the impacts of the COVID-19 pandemic and related suspension of manufacturing operations during the Fiscal 2020 third quarter and disruptions across the dealer network, supply chain, and end consumers. Gross profit margin decreased 220 basis points, primarily due to the mix impact of adding Newmar as well as the related purchase accounting impacts, and the impact of COVID-19 during the fiscal third quarter. Operating income was $113.8 million for Fiscal 2020, compared to $155.3 million in Fiscal 2019. Net income for Fiscal 2020 was $61.4 million , a decrease of 45.0% compared to $111.8 million in Fiscal 2019 due to the impact of COVID-19 and increased interest expense. The increase in interest expense is related to the convertible bond issued to finance the acquisition of Newmar , and separately, the write-off of certain debt issuance costs associated with the termination of the company's Term Loan B which was refinanced by a bond issuance during the fourth quarter. Fiscal 2020 earnings per diluted share was $1.84 , a decrease of 47.7% compared to earnings per diluted share of $3.52 in Fiscal 2019. Adjusted earnings per diluted share was $2.58 for Fiscal 2020, compared to adjusted earnings per diluted share of $3.45 in the same period last year. Fiscal 2020 consolidated adjusted earnings per diluted share excludes costs totaling $25.0 million , or $0.75 per diluted share, after tax, related to the non-cash portion of interest expense associated with the convertible bond, Newmar acquisition-related costs, debt issuance costs written off due to the termination of the Term Loan B and restructuring costs. Adjusted earnings per diluted share was also impacted by the share consideration issued in the Newmar acquisition. Fiscal 2020 consolidated Adjusted EBITDA was $168.1 million , a decrease of 6.4% from $179.7 million in Fiscal 2019.\n\nTowable Fourth Quarter and Full Year Fiscal 2020 Results\n\nRevenues for the Towable segment were $414.0 million for the fourth quarter, up 34.8% over the prior year, primarily driven by strong consumer demand for outdoor experiences, particularly in Grand Design products. Segment Adjusted EBITDA was $61.3 million , up 45.8% over the prior year period. Adjusted EBITDA margin of 14.8% increased 110 basis points, primarily due to leverage, but also benefiting from profitability initiatives. Backlog increased to a record $747.9 million , up 219.2% over the prior year, as dealers have experienced sizable reductions to their inventory as they have encountered extremely high levels of consumer demand in the fourth quarter.\n\nFor the full year Fiscal 2020, revenues for the Towable segment were $1.23 billion , up 2.5% from Fiscal 2019. Segment Adjusted EBITDA for the full year was $148.3 million , down 9.4% from Fiscal 2019 driven by the impact of COVID-19 during the Fiscal 2020 third quarter. Adjusted EBITDA margin of 12.1% decreased 160 basis points for the full year.\n\nMotorhome Fourth Quarter and Full Year Fiscal 2020 Results\n\nIn the fourth quarter, revenues for the Motorhome segment were $301.8 million , up 50.4% from the prior year, driven by the addition of Newmar . Revenues excluding Newmar were $175.5 million , down 12.6%, as strong class B sales were more than offset by sales declines in class A and class C. Segment Adjusted EBITDA was $19.5 million , up 81.2% from the prior year due to improved profitability in the Winnebago branded business and the addition of Newmar , partially offset by the organic revenue decline and class mix. Adjusted EBITDA margin of 6.4% increased 100 basis points. Backlog increased to a record $1.1 billion , up 535.8% over the prior year, reflecting extremely high levels of consumer demand.\n\nFor the full year Fiscal 2020, revenues for the Motorhome segment were $1.1 billion , up 49.5% from Fiscal 2019. Revenues excluding Newmar were $668.4 million , down 5.4% from Fiscal 2019, as a result of manufacturing and distribution disruption due to the COVID-19 pandemic. Segment Adjusted EBITDA for the full year was $32.9 million , up 20.0% from Fiscal 2019 driven by the addition of Newmar partially offset by the impact of COVID-19 during the Fiscal 2020 third quarter. Adjusted EBITDA margin of 3.1% was down 80 basis points for the full year due to the impact of COVID-19 during the Fiscal 2020 third quarter partially offset by the addition of Newmar .\n\nBalance Sheet and Cash Flow\n\nAs of August 29, 2020 , the Company had total outstanding debt of $512.6 million ( $600.0 million of debt, net of convertible note discount of $74.3 million , and net of debt issuance costs of $13.1 million ) and working capital of $413.2 million . Cash flow from operations was $270.4 million for the full year Fiscal 2020, resulting in an increase of $136.7 million , or 102.2%, from the $133.8 million generated in Fiscal 2019.\n\nQuarterly Cash Dividend\n\nOn August 19, 2020 , the Company’s board of directors approved a quarterly cash dividend of $0.12 per share payable on September 30, 2020 , to common stockholders of record at the close of business on September 16, 2020 . This represents a 9% increase from the prior dividend of $0.11 per share.\n\nMr. Happe continued, “As we look ahead to Fiscal 2021, we are encouraged by the ongoing outdoor recreation demand trends we are experiencing. We have built a strong and growing position in the RV market, and our customers continue to view all our brands as a trusted and safe way to have extraordinary experiences as they travel, live, work, and play in the outdoors. I’m incredibly proud of the progress we have made over the last several years expanding Winnebago Industries' portfolio while simultaneously enhancing the quality of our product lineup and service levels and the profitability we are able to achieve. During fiscal year 2020, we continued to expand our family of outstanding brands with the acquisition of Newmar , and when combined with our Winnebago , Grand Design RV, and Chris-Craft brands, we believe we have four of the most respected brands in the outdoors industry. We have expanded our leadership team capabilities as well in the past year, through the acquisition of Newmar and also through adding new talent to the team in Huw Bower to lead our Winnebago Outdoors business, as announced at the end of September. Going forward, we are committed to managing our Company in a highly disciplined fashion so that we are best positioned to build on our momentum in the marketplace, capture the numerous opportunities we believe lie ahead and deliver further value to the customers and communities we serve. Finally, Fiscal 2020 also marks an inflection point in our efforts to improve on our corporate responsibility obligations. It is our strong intention that through these initiatives, our Winnebago Industries team will emerge as an even stronger leader in our communities, and in so doing, will make a meaningful contribution to an improvement in the many dimensions of social justice.”\n\nConference Call\n\nWinnebago Industries, Inc. will discuss fourth quarter and full year Fiscal 2020 earnings results during a conference call scheduled for 9:00 a.m. Central Time today. Members of the news media, investors and the general public are invited to access a live broadcast of the conference call via the Investor Relations page of the Company's website at http://investor.wgo.net. The event will be archived and available for replay for the next 90 days.\n\nAbout Winnebago Industries\n\nWinnebago Industries, Inc. is a leading North American manufacturer of outdoor lifestyle products under the Winnebago , Grand Design, Chris-Craft, and Newmar brands, which are used primarily in leisure travel and outdoor recreation activities. The Company builds quality motorhomes, travel trailers, fifth wheel products and boats. Winnebago Industries has multiple facilities in Iowa , Indiana , Minnesota and Florida . The Company's common stock is listed on the New York Stock Exchange and traded under the symbol WGO. For access to Winnebago Industries' investor relations material or to add your name to an automatic email list for Company news releases, visit http://investor.wgo.net.\n\nForward Looking Statements\n\nThis press release may contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Investors are cautioned that forward-looking statements are inherently uncertain. A number of factors could cause actual results to differ materially from these statements, including, but not limited to increases in interest rates, availability of credit, low consumer confidence, availability of labor, significant increase in repurchase obligations, inadequate liquidity or capital resources, availability and price of fuel, a slowdown in the economy, increased material and component costs, availability of chassis and other key component parts, sales order cancellations, slower than anticipated sales of new or existing products, new product introductions by competitors, the effect of global tensions, integration of operations relating to mergers and acquisitions activities, business interruptions, any unexpected expenses related to enterprise resource planning, impacts of public health crises, such as COVID-19, risks related to compliance with debt covenants and leverage ratios, cyber-attacks, and other factors. Additional information concerning certain risks and uncertainties that could cause actual results to differ materially from that projected or suggested is contained in the Company's filings with the Securities and Exchange Commission (SEC) over the last 12 months, copies of which are available from the SEC or from the Company upon request. The Company disclaims any obligation or undertaking to disseminate any updates or revisions to any forward looking statements contained in this release or to reflect any changes in the Company's expectations after the date of this release or any change in events, conditions or circumstances on which any statement is based, except as required by law.\n\n\n\n\n\nWinnebago Industries, Inc.\n\nCondensed Consolidated Statements of Income\n\n(Unaudited and subject to reclassification)\n\nThree Months Ended (in thousands, except percent and per share data) August 29, 2020 August 31, 2019 Net revenues $ 737,807 100.0 % $ 530,396 100.0 % Cost of goods sold 615,298 83.4 % 447,208 84.3 % Gross profit 122,509 16.6 % 83,188 15.7 % Selling, general, and administrative expenses 50,521 6.8 % 35,992 6.8 % Amortization of intangible assets 3,590 0.5 % 2,431 0.5 % Total operating expenses 54,111 7.3 % 38,423 7.2 % Operating income 68,398 9.3 % 44,765 8.4 % Interest expense 14,321 1.9 % 4,646 0.9 % Non-operating income (514 ) (0.1 )% (251 ) — % Income before income taxes 54,591 7.4 % 40,370 7.6 % Provision for income taxes 12,132 1.6 % 8,502 1.6 % Net income $ 42,459 5.8 % $ 31,868 6.0 % Income per common share: Basic $ 1.26 $ 1.01 Diluted $ 1.25 $ 1.01 Weighted average common shares outstanding: Basic 33,641 31,507 Diluted 33,929 31,696 Year Ended (in thousands, except percent and per share data) August 29, 2020 August 31, 2019 Net revenues $ 2,355,533 100.0 % $ 1,985,674 100.0 % Cost of goods sold 2,042,605 86.7 % 1,678,477 84.5 % Gross profit 312,928 13.3 % 307,197 15.5 % Selling, general, and administrative expenses 177,061 7.5 % 142,295 7.2 % Amortization of intangible assets 22,104 0.9 % 9,635 0.5 % Total operating expenses 199,165 8.5 % 151,930 7.7 % Operating income 113,763 4.8 % 155,267 7.8 % Interest expense 37,461 1.6 % 17,939 0.9 % Non-operating income (974 ) — % (1,581 ) (0.1 )% Income before income taxes 77,276 3.3 % 138,909 7.0 % Provision for income taxes 15,834 0.7 % 27,111 1.4 % Net income $ 61,442 2.6 % $ 111,798 5.6 % Income per common share: Basic $ 1.85 $ 3.55 Diluted $ 1.84 $ 3.52 Weighted average common shares outstanding: Basic 33,236 31,536 Diluted 33,454 31,721\n\nPercentages may not add due to rounding differences.\n\n\n\n\n\nWinnebago Industries, Inc.\n\nCondensed Consolidated Balance Sheets\n\n(Unaudited and subject to reclassification)\n\n(in thousands) August 29, 2020 August 31, 2019 Assets Current assets: Cash and cash equivalents $ 292,575 $ 37,431 Receivables, net 220,798 158,049 Inventories 182,941 201,126 Prepaid expenses and other assets 17,296 14,051 Total current assets 713,610 410,657 Property, plant, and equipment, net 174,945 127,572 Other assets: Goodwill 348,058 274,931 Other intangible assets, net 404,768 256,082 Investment in life insurance 27,838 26,846 Operating Lease Assets 29,463 — Other assets 15,018 8,143 Total assets $ 1,713,700 $ 1,104,231 Liabilities and Stockholders' Equity Current liabilities: Accounts payable $ 132,490 $ 81,635 Income taxes payable 8,840 — Accrued expenses 159,060 107,217 Current maturities of long-term debt — 8,892 Total current liabilities 300,390 197,744 Non-current liabilities: Long-term debt, less current maturities 512,630 245,402 Deferred income taxes 15,608 12,032 Unrecognized tax benefits 6,511 3,591 Operating Lease Liabilities 27,048 — Deferred compensation benefits, net of current portion 11,130 12,878 Other 12,917 372 Total non-current liabilities 585,844 274,275 Stockholders' equity 827,466 632,212 Total liabilities and stockholders' equity $ 1,713,700 $ 1,104,231\n\n\n\n\n\n\n\nWinnebago Industries, Inc.\n\nCondensed Consolidated Statements of Cash Flows\n\n(Unaudited and subject to reclassification)\n\nYear Ended (in thousands) August 29, 2020 August 31, 2019 Operating activities: Net income $ 61,442 $ 111,798 Adjustments to reconcile net income to net cash provided by operating activities: Depreciation 15,997 13,682 Amortization of intangibles 22,104 9,635 Non-cash interest expense, net 10,727 — Amortization of debt issuance costs 7,379 1,612 Last in, first-out expense (5,188 ) 2,258 Stock-based compensation 6,475 7,058 Deferred income taxes (879 ) 7,984 Other, net 2,405 1,313 Change in assets and liabilities: Receivables (25,773 ) 6,418 Inventories 105,994 (8,256 ) Prepaid expenses and other assets (358 ) (4,499 ) Accounts payable 37,041 907 Income taxes and unrecognized tax benefits 11,422 (13,810 ) Accrued expenses and other liabilities 21,646 (2,350 ) Net cash provided by operating activities 270,434 133,750 Investing activities: Purchases of property and equipment (32,377 ) (40,858 ) Acquisition of business, net of cash acquired (260,965 ) (702 ) Proceeds from the sale of property — 148 Other, net 266 2,476 Net cash used in investing activities (293,076 ) (38,936 ) Financing activities: Borrowings on long-term debt 2,786,824 891,892 Repayments on long-term debt (2,446,824 ) (930,424 ) Purchase of convertible bond hedge (70,800 ) — Proceeds from issuance of warrants 42,210 — Payments of cash dividends (14,588 ) (13,670 ) Payments for repurchases of common stock (1,844 ) (8,171 ) Payments of debt issuance costs (18,030 ) — Other, net 838 648 Net cash provided by (used in) financing activities 277,786 (59,725 ) Net increase (decrease) in cash and cash equivalents 255,144 35,089 Cash and cash equivalents at beginning of year 37,431 2,342 Cash and cash equivalents at end of year $ 292,575 $ 37,431 Supplement cash flow disclosure: Income taxes paid, net $ 3,667 $ 37,061 Interest paid $ 17,253 $ 14,921 Non-cash transactions: Issuance of Winnebago common stock for business acquisition $ 92,572 $ — Capital expenditures in accounts payable $ 178 $ 387\n\n\n\n\n\nWinnebago Industries, Inc.\n\nSupplemental Information by Reportable Segment - Towable\n\n(in thousands, except unit data)\n\n(Unaudited and subject to reclassification)\n\nThree Months Ended August 29, 2020 % of\n\nRevenues August 31, 2019 % of\n\nRevenues $ Change % Change Net revenues $ 413,956 $ 306,992 $ 106,964 34.8 % Adjusted EBITDA 61,294 14.8 % 42,039 13.7 % 19,255 45.8 % Three Months Ended Unit deliveries August 29, 2020 Product\n\nMix(1) August 31, 2019 Product\n\nMix(1) Unit\n\nChange % Change Travel trailer 7,865 61.9 % 5,894 62.4 % 1,971 33.4 % Fifth wheel 4,832 38.1 % 3,553 37.6 % 1,279 36.0 % Total towables 12,697 100.0 % 9,447 100.0 % 3,250 34.4 % Year Ended August 29, 2020 % of\n\nRevenues August 31, 2019 % of\n\nRevenues $ Change % Change Net revenues $ 1,227,567 $ 1,197,327 $ 30,240 2.5 % Adjusted EBITDA 148,276 12.1 % 163,677 13.7 % (15,401 ) (9.4 )% Year Ended Unit deliveries August 29, 2020 Product\n\nMix(1) August 31, 2019 Product\n\nMix(1) Unit\n\nChange % Change Travel trailer 23,184 61.2 % 22,458 61.0 % 726 3.2 % Fifth wheel 14,706 38.8 % 14,371 39.0 % 335 2.3 % Total towables 37,890 100.0 % 36,829 100.0 % 1,061 2.9 % August 29, 2020 August 31, 2019 Change % Change Backlog(2) Units 24,903 7,225 17,678 244.7 % Dollars $ 747,925 $ 234,339 $ 513,586 219.2 % Dealer Inventory Units 10,528 15,658 (5,130 ) (32.8 )%\n\n(1) Percentages may not add due to rounding differences.\n\n(2) We include in our backlog all accepted orders from dealers which generally have been requested to be shipped within the next six months. Orders in backlog can be cancelled or postponed at the option of the dealer at any time without penalty and, therefore, backlog may not necessarily be an accurate measure of future sales.\n\n\n\n\n\nWinnebago Industries, Inc.\n\nSupplemental Information by Reportable Segment - Motorhome\n\n(in thousands, except unit data)\n\n(Unaudited and subject to reclassification)\n\nThree Months Ended August 29, 2020 % of\n\nRevenues August 31, 2019 % of\n\nRevenues $ Change % Change Net revenues $ 301,771 $ 200,698 $ 101,073 50.4 % Adjusted EBITDA 19,461 6.4 % 10,739 5.4 % 8,722 81.2 % Three Months Ended Unit deliveries August 29, 2020 Product\n\nMix(1) August 31, 2019 Product\n\nMix(1) Unit\n\nChange % Change Class A 690 30.2 % 253 12.7 % 437 172.7 % Class B 1,064 46.6 % 937 47.2 % 127 13.6 % Class C 527 23.1 % 795 40.1 % (268 ) (33.7 )% Total motorhomes 2,281 100.0 % 1,985 100.0 % 296 14.9 % Year Ended(2) August 29, 2020 % of\n\nRevenues August 31, 2019 % of\n\nRevenues $ Change % Change Net revenues $ 1,056,794 $ 706,927 $ 349,867 49.5 % Adjusted EBITDA 32,949 3.1 % 27,455 3.9 % 5,494 20.0 % Year Ended Unit deliveries August 29, 2020 Product\n\nMix(1) August 31, 2019 Product\n\nMix(1) Unit\n\nChange % Change Class A 2,493 30.8 % 1,582 20.8 % 911 57.6 % Class B 3,351 41.3 % 2,784 36.7 % 567 20.4 % Class C 2,261 27.9 % 3,225 42.5 % (964 ) (29.9 )% Total motorhomes 8,105 100.0 % 7,591 100.0 % 514 6.8 % August 29, 2020 August 31, 2019 Change % Change Backlog(3) Units 8,463 1,808 6,655 368.1 % Dollars $ 1,051,415 $ 165,373 $ 886,042 535.8 % Dealer Inventory Units 2,761 3,891 (1,130 ) (29.0 )%\n\n(1) Percentages may not add due to rounding differences.\n\n(2) August 29, 2020 year end data includes Newmar results from the time of acquisition (11/08/19); 2019 data excludes Newmar for both the three month ended and year end periods\n\n(3) We include in our backlog all accepted orders from dealers which generally have been requested to be shipped within the next six months. Orders in backlog can be cancelled or postponed at the option of the dealer at any time without penalty and, therefore, backlog may not necessarily be an accurate measure of future sales.\n\n\n\n\n\nWinnebago Industries, Inc.\n\nNon-GAAP Reconciliation\n\n(Unaudited and subject to reclassification)\n\nNon-GAAP financial measures, which are not calculated or presented in accordance with accounting principles generally accepted in the United States (“GAAP”), have been provided as information supplemental and in addition to the financial measures presented in the accompanying news release that are calculated and presented in accordance with GAAP. Such non-GAAP financial measures should not be considered superior to, as a substitute for, or as an alternative to, and should be considered in conjunction with, the GAAP financial measures presented in the news release. The non-GAAP financial measures presented may differ from similar measures used by other companies.\n\nThe following table reconciles Diluted income per share to Adjusted diluted income per share:\n\nThree Months Ended Year Ended (in thousands)(1) August 29, 2020 August 31, 2019 August 29, 2020 August 31, 2019 Diluted income per share $ 1.25 $ 1.01 $ 1.84 $ 3.52 Pretax acquisition-related costs (1) — — 0.29 — Pretax acquisition-related fair-value inventory step-up — — 0.14 — Pretax non-cash interest expense (2) 0.10 — 0.32 — Restructuring expense 0.01 (0.01 ) 0.05 0.03 Debt issuance write-off 0.14 — 0.14 — Research and development tax credits — — — (0.10 ) Tax impact of adjustments (3) (0.05 ) — (0.20 ) (0.01 ) Adjusted diluted income per share (4) $ 1.45 $ 1.00 $ 2.58 $ 3.45\n\n(1) Per share numbers may not foot due to rounding\n\n(2) Represents transaction-closing costs.\n\n(3) Non-cash interest expense associated with the Convertible Notes issued related to our acquisition of Newmar .\n\n(4) Income tax charge calculated using the statutory tax rate for the U.S. of 21.0% for both periods presented.\n\n\n\n\n\nThe following table reconciles net income to consolidated EBITDA and Adjusted EBITDA.\n\nThree Months Ended Year Ended (in thousands) August 29, 2020 August 31, 2019 August 29, 2020 August 31, 2019 Net income $ 42,459 $ 31,868 $ 61,442 $ 111,798 Interest expense 14,321 4,646 37,461 17,939 Provision for income taxes 12,132 8,502 15,834 27,111 Depreciation 4,143 3,894 15,997 13,682 Amortization of intangible assets 3,590 2,431 22,104 9,635 EBITDA 76,645 51,341 152,838 180,165 Acquisition-related fair-value inventory step-up — — 4,810 — Acquisition-related costs — — 9,761 — Restructuring 393 (253 ) 1,640 1,068 Non-operating income (514 ) (251 ) (974 ) (1,581 ) Adjusted EBITDA $ 76,524 $ 50,837 $ 168,075 $ 179,652\n\nWe have provided non-GAAP performance measures of Adjusted diluted income per share, EBITDA, and Adjusted EBITDA as comparable measures to illustrate the effect of non-recurring transactions occurring during the reported periods and improve comparability of our results from period to period. Adjusted diluted income per share is defined as income per share adjusted for items that impact the comparability of our results from period to period. EBITDA is defined as net income before interest expense, provision for income taxes, and depreciation and amortization expense. Adjusted EBITDA is defined as net income before interest expense, provision for income taxes, depreciation and amortization expense, and other adjustments made in order to present comparable results from period to period. We believe Adjusted diluted income per share and Adjusted EBITDA provide meaningful supplemental information about our operating performance because these measures exclude amounts that we do not consider part of our core operating results when assessing our performance. Examples of items excluded from Adjusted income per share include acquisition-related costs, acquisition-related fair-value inventory step-up, non-cash interest expense, and the tax impact of the adjustments. Examples of items excluded from Adjusted EBITDA include acquisition-related fair-value inventory step-up, acquisition-related costs, restructuring expenses, and non-operating income.\n\nManagement uses these non-GAAP financial measures (a) to evaluate our historical and prospective financial performance and trends as well as our performance relative to competitors and peers; (b) to measure operational profitability on a consistent basis; (c) in presentations to the members of our board of directors to enable our board of directors to have the same measurement basis of operating performance as is used by management in its assessments of performance and in forecasting and budgeting for our company; (d) to evaluate potential acquisitions; and (e) to ensure compliance with restricted activities under the terms of our ABL credit facility and outstanding notes. We believe these non-GAAP financial measures are frequently used by securities analysts, investors, and other interested parties to evaluate companies in our industry.\n\nContact: Steve Stuber - Investor Relations - 952-828-8461 - srstuber@wgo.net\n\nMedia Contact: Sam Jefson - Public Relations Specialist - 641-585-6803 - sjefson@wgo.net\n\n\n\n\n\n\n\n\n\nSource: Winnebago Industries, Inc."}, {"url": "https://sonichits.com/artist/Winnebago_Deal", "page_content": "Winnebago Deal started life as a four piece band in 1999 at Bartholomew School, in Eynsham (Oxford, UK), though two of the original members left shortly after. Winnebago currently consists of two Bens, Ben Perrier (vocals, guitar) and Ben Thomas (drums).\n\n\n\nThe two Bens generated strong support from local youth center gigs and many appearances at Oxford's Zodiac club, eventually supporting Fugazi at London's Forum, this lead to their first record, the Plata O Plomo EP in 2003.\n\nWinnebago Deal started life as a four piece band in 1999 at Bartholomew School, in Eynsham (Oxford, UK), though two of the original members left shortly after. Winnebago currently consists of two Bens, Ben Perrier (vocals, guitar) and Ben Thomas (drums).\n\n\n\nThe two Bens generated strong support from local youth center gigs and many appearances at Oxford's Zodiac club, eventually supporting Fugazi at London's Forum, this lead to their first record, the Plata O Plomo EP in 2003. They were nominated for the Kerrang Award's 'Best British Newcomer' that year. Soon after, the band signed a recording contract with Double Dragon Music, and produced their debut album Dead Gone with Jack Endino, released in September 2004. Plata O Plomo was reissued in Australia, with an expanded track listing.\n\n\n\nCurrently 'the Ben's' are also playing as Mondo Generator with Nick Oliveri, former Queens Of The Stone Age bassist/vocalist. As well as playing Mondo Generator gigs, they still tour as Winnebago Deal and even support Mondo Generator. Their 2006 album Flight Of The Raven was produced by Jack Endino (producer of the first Nirvana album Bleach), featuring many other artists including band partner Nick Olivieri. A fourth album, Career Suicide, was released in 2010."}, {"url": "https://www.qobuz.com/us-en/interpreter/winnebago-deal/189366", "page_content": "Winnebago Deal\n\nThe early 21st century may be remembered as the rock era when bands began 'downsizing' the amount of bandmembers, A plethora of duos appeared during this time (who handled all the chores themselves), including British heavies, Winnebago Deal. Hailing from Oxford, the group began as a quartet however, during 1999. With a sound comparable to classic Sub Pop bands and Queens of the Stone Age (when Nick Oliveri mans the mic), two of the original members exited shortly thereafter, leaving Ben Perrier (vocals, guitar) and Ben Thomas (drums) to fend for themselves. Making a name for themselves the old-fashioned way (touring incessantly via van -- for very little pay -- and handing out demos), the duo eventually began building a loyal following, which led to a gig supporting Fugazi at London's Forum, which in turn got the attention of the head of indie label Fierce Panda Records. This led to the release of the duo's debut EP, Plata O Plomo, in March of 2003, and as a result, racked up accolades (including being nominated 'Best British Newcomer' at that years' Kerrang Awards). 2003 was a busy one for the Ben's, as they played well over a hundred gigs (including a spot at the Reading/Leeds festivals, and playing alongside the likes of Burning Brides and Nebula). Several singles and EP's found their way into the shops during late 2003 and early 2004 -- Manhunt, a split 7\" with tour mates Nebula, and the George Dickel EP, while Winnebago Deal was invited to take part in one XFM and two Radio One sessions. A new recording contract with Double Dragon Music soon followed, as the duo hooked up with renowned Sub Pop producer Jack Endino (best known for working with both Nirvana and Soundgarden early on). The resulting debut full-length, Dead Gone, appeared in September 2004, which was prefaced by a few gigs supporting Mondo Generator. A month after their debut's release, Plata O Plomo was reissued in Australia, with an expanded track listing.\n\n© Greg Prato /TiVo\n\nRead more"}, {"url": "https://www.musicomh.com/reviews/albums/winnebago-deal-flight-of-the-raven", "page_content": "Album Reviews\n\nWinnebago Deal – Flight Of The Raven (Fierce Panda) UK release date: 10 July 2006\n\nWhen a band describes themselves as AC/DC meets Black Flag you know they are either ridiculously deluded or, as is the case with Oxford duo Winnebago Deal, that they have spent their entire youths holed up in dank rehearsal rooms, consuming, digesting and emulating their rock god heroes; earning their right to spew forth their very own brand of pedal-to-the-metal, punk-infused rock and roll.\n\nConsisting of two men named, uh Ben, Winnebago Deal have been touring constantly for the past six years; building a fan base where none existed often through sheer repetitive effort; playing venues that most bands would turn down; and touring in a van packed so tightly that mere accessories like bass players and their equipment have had to be dismissed along the way. Although, as two pieces go, these boys make The White Stripes look like purveyors of stagnant nursery rhymes.\n\nFlight Of The Raven is their second full-length album, released on renowned indie label Fierce Panda. Opener With Friends Like These sets the tone for an album of stoner-influenced, punk-paced drinking tunes that will never make it to radio but, thanks to the boys’ commitment to relentless touring, should still be coming to a town near you.\n\nFuture single Spider Bite starts with a muted, rolling riff that is unleashed into a thrashing tub-thumping rock number, complete with Hellacopters piano lick in the mid-section and the gruffest vocals you will hear on a song about spiders, ever. Reeper, meanwhile, is a slice of Fu Manchu in their early days with Cathedral‘s Lee Dorrian on vocal duties, tearing through their balls-out rock and roll by-numbers tune with style.\n\nVenomised sees the velocity slowed way down for a crushing horror groove that grinds its way through three minutes of feedback-laced lead lines and whispered female backing vocals. A Dose Of Something is just what the doctor ordered, back firmly in late ’90s stoner territory, and makes it clear to see why this band have supported Nebula on numerous occasions. The title track features some of the rawest vocals you will ever hear, and follower You Let Me Down will have you scratching your head as to just how two instruments can make this much noise.\n\nWhile some rock bands seek to take their influences and set about trying to forge an as yet undiscovered musical mastery, there are others who simply reproduce their heroes’ chords in a different order and make a packet on the back of someone else’s creativity. Thankfully Winnebago Deal turn the latter position on its head, where they are only too happy to pay constant homage to their inspiration. You can barely find an interview where the lads aren’t shouting about Melvins or Black Flag; and it’s because of this that the blistering live duo will gain respect enough to negate what they’re lacking in originality and hopefully win some fans en route."}, {"url": "https://www.allmusic.com/artist/winnebago-deal-mn0000904976", "page_content": "Winnebago Deal Follow Artist +\n\nThe early 21st century may be remembered as the rock era when bands began 'downsizing' the amount of bandmembers, A plethora of duos appeared during this time (who handled all the chores themselves),…\n\nRead Full Biography"}, {"url": "https://www.sputnikmusic.com/bands/Winnebago-Deal/5225/", "page_content": "Winnebago Deal Rock (1 votes) Alternative Rock Ambient Americana Art Pop Atmospheric Black Metal Black Metal Bluegrass Blues Bossa Nova Breaks Britpop Classical Country Death Metal Deathcore Disco Djent Doom Metal Downtempo Dream Pop Drone Drum and Bass Dubstep Electronic Emo Experimental Folk Folk Punk Funeral Doom Funk Garage Glam Rock Gothic Grime Grind Groove Metal Grunge Hard Rock Hardcore Heavy Metal Hip-Hop House IDM Indie Folk Indie Pop Indie Rock Industrial Instrumental Hip-Hop Jam Rock Jazz Jazz Fusion Lo-fi Math Rock Mathcore Melodic Black Metal Melodic Death Metal Metal Metalcore Minimal New Age New Wave Noise Noise Rock Nu Jazz Nu-metal Pop Pop Punk Pop Rock Post Hardcore Post Metal Post Punk Post Rock Power Electronics Power Metal Progressive Metal Progressive Rock Psychedelic Punk R&B Reggae Rock Shoegaze Ska Sludge Metal Soul Soundtrack Stoner Rock Synthpop Techno Thrash Metal Trance Trip Hop\n\nWinnebago Deal started life as a four piece band in 1999 at Bartholomew School, in Eynsham (Oxford), though two of the original members left shortly after. Winnebago currently consists of two Bens, Ben Perrier (vocals, guitar) and Ben Thomas (drums). The two Bens generated strong support from local youth center gigs and many appearances at Oxford's Zodiac club, eventually supporting Fugazi at London's Forum, this lead to their first record, the Plata O Plomo EP in 2003. They were nominated for the Kerrang Award's 'Best British Newcomer' that year. Soon after, the band signed a recording con ...read more\n\n\n\nWinnebago Deal started life as a four piece band in 1999 at Bartholomew School, in Eynsham (Oxford), though two of the original members left shortly after. Winnebago currently consists of two Bens, Ben Perrier (vocals, guitar) and Ben Thomas (drums). The two Bens generated strong support from local youth center gigs and many appearances at Oxford's Zodiac club, eventually supporting Fugazi at London's Forum, this lead to their first record, the Plata O Plomo EP in 2003. They were nominated for the Kerrang Award's 'Best British Newcomer' that year. Soon after, the band signed a recording contract with Double Dragon Music, and produced their debut album Dead Gone with Jack Endino, released in September 2004. Plata O Plomo was reissued in Australia, with an expanded track listing. The two Bens then went on to play as Mondo Generator with Nick Oliveri, former Queens Of The Stone Age bassist/vocalist. As well as playing Mondo Generator gigs, they still toured as Winnebago Deal and even supported Mondo Generator, earing them the moniker Winnebago Generator from fans. Having entered Dave Grohl's studio to record the next Mondo Generator Album, it was announced in July 2006 that they had left the band for undisclosed reasons. In that same month they released their latest album Flight Of The Raven. It was produced by Jack Endino, producer of the first Nirvana album Bleach. The album features many other artists including band partner Nick Oliveri. « hide\n\nFlight Of The Raven\n\n2006\n\n\n\n3\n\n1 Votes Rate It Awful Very Poor Poor Average Good Great Excellent Superb Classic Dead Gone\n\n2004\n\n\n\n3.8\n\n2 Votes Rate It Awful Very Poor Poor Average Good Great Excellent Superb Classic George Dickel\n\n2004\n\n\n\nRate It Awful Very Poor Poor Average Good Great Excellent Superb Classic Plata O Plomo\n\n2003\n\n\n\nRate It Awful Very Poor Poor Average Good Great Excellent Superb Classic Contributors: Neoteric,"}, {"url": "https://alchetron.com/Winnebago-Deal", "page_content": "Winnebago Deal are a rock music band from Oxford, United Kingdom. They started life in the late 1990s at Bartholomew School in Eynsham, with Ben Perrier (vocals, guitar) and Ben Thomas (then on guitar) writing songs then recruiting a drummer and bass player through an ad. They played their first gig in early 1999 and fired the bass player a few months later, with Ben Thomas switching from guitar to bass. By the summer of 2000, Perrier and Thomas' dissatisfaction with their drummer led to his departure, with Thomas switching from bass to drums so the band could continue as a two-piece. Winnebago Deal now consists of two Bens, Ben Perrier (vocals, guitar) and Ben Thomas (drums).\n\nContents\n\nWinnebago Deal generated strong support from many appearances at Oxford's Zodiac club, eventually supporting Fugazi at London's Forum; this led to their first record, the Plata O Plomo EP in 2003. They were nominated for the Kerrang Award's 'Best British Newcomer' that year. Soon after, the band signed a recording contract with Double Dragon Music, and produced their debut album Dead Gone with Jack Endino, producer of the first Nirvana album Bleach. Dead Gone was released in September 2004. Plata O Plomo was reissued in Australia later that year, with an expanded track listing.\n\nThe \"two Bens\" then went on to play as Mondo Generator with Nick Oliveri, former Queens of the Stone Age bassist–vocalist. As well as playing Mondo Generator gigs, they still toured as Winnebago Deal and even supported Mondo Generator, earning them the moniker \"Winnebago Generator\" from fans. After recording tracks at Dave Grohl's Studio 606 for the next Mondo Generator album with producer Nick Raskulinecz, it was announced in July 2006 that they had left the band for \"undisclosed reasons\".\n\nIn that same month they released their second full-length album Flight Of The Raven, with the band again choosing to record with producer Jack Endino. The album features guest appearances from other artists including band partner Nick Oliveri, Endino, Paul Morrill and Edward \"Raven\" Heaton from the band Sicarios, and Rusty Needles of Oxford band Deguello, and was cited as the sixth best album in 2006 by Kerrang! writer Raziq Rauf.\n\nWinnebago Deal's third full-length album, \"Career Suicide\", was recorded in November 2009 and released a year later."}]}