{"Winnebago Deal's sound has been described as a mix of indie rock, post-punk, and psychedelic rock.": [{"url": "https://www.udiscovermusic.com/stories/story-of-indie-music/", "page_content": "Photo: Eva Edsjo/Redferns\n\nRather like goth, indie music is one of pop’s most nebulous genres. The myriad bands operating within its parameters are generally labeled “indie rock” or “indie pop,” but in reality, its boundaries are much broader. What should be stressed above all else is that the notion of indie music derives from the word “independent”: in this context, small and relatively low-budget record labels inspired by punk’s DIY ethos and releasing music for misfits made by the maverick outsiders who reject the corporate world of rock’n’roll.\n\nListen to the best indie music on Spotify.\n\nThe rise of indie music\n\nThe story of indie music as we know it begins with Buzzcocks’ Spiral Scratch EP. First released in April 1977, this influential four-track 7” from the iconic Manchester pop-punk quartet is widely recognized as rock’s first independently-funded and distributed disc. The fact that it sold out its original pressing of 1,000 copies and then went on to move a further 15,000 copies effectively created the blueprint for independent labels in one fell swoop. In fact, such was Spiral Scratch’s impact that, by the end of 1978, the UK alone boasted of hundreds of self-starting imprints with game-changing labels such as Rough Trade, Factory, and Mute already well into their infancy.\n\nADVERTISEMENT\n\nYet, while these landmark imprints attracted reams of critical praise, commercial success initially proved elusive. Issued by Rough Trade, Stiff Little Fingers’ incendiary 1979 debut, Inflammable Material, became the first independently-released album to sell over 100,000 copies, while a few choice indie singles, such as Joy Division’s sublime “Love Will Tear Us Apart” and Depeche Mode’s “Just Can’t Get Enough,” chalked up bona fide UK Top 30 placings on the cusp of the 80s. However, many small imprints were still the preserve of the have-a-go entrepreneur whose goals were merely to release a lone single and perhaps secure a session on BBC Radio 1’s John Peel show.\n\nIndie music’s stock, however, rose dramatically in 1983, when Rough Trade signed The Smiths – arguably the UK’s most important guitar-based band of the decade. In the US, meanwhile, Murmur, the debut album by a little-known Athens, Georgia, quartet, R.E.M. (released through Miles Copeland and Jay Boberg’s indie imprint, IRS), scooped Rolling Stone’s Album Of The Year award, beating off the challenge of Michael Jackson’s multi-million-selling Thriller in the process.\n\nR.E.M. - Radio Free Europe\n\nWatch this video on YouTube Click to load video\n\nBy the mid-80s, the DIY ethic resonated globally, with respected US-based independents such as SST, Touch & Go, and Twin/Tone gaining a foothold, and notable imprints from far-flung territories such as Australia’s Hot Records and New Zealand’s Flying Nun entering the marketplace.\n\nAlso at this juncture, the rock press had taken to referring to the albums released by self-financed labels as “indie music” – something that was reinforced by the influential 1986 compilation C86. Originally a cover-mounted cassette released by the UK rock weekly NME, this collection included tracks by future indie music crossover stars including Primal Scream and The Wedding Present, and showed that a new breed of bands tuned into post-punk and guitar-driven 60s pop were very much back in vogue.\n\nIndie goes mainstream\n\nSigns that indie music was about to go overground became apparent during the late 80s. US tours by rising British bands with indie backgrounds, such as New Order and Echo And The Bunnymen, were playing to ever larger arenas, while albums from groundbreaking US indie rock acts, including Sonic Youth’s Daydream Nation, Pixies’ Doolittle and Dinosaur Jr’s Bug remain among the era’s defining records. Indeed, as the decade closed out, indie music had morphed into a genuinely major player, with Manchester’s indie-dance icons The Stone Roses and Happy Mondays surfing the zeitgeist; The Cure playing a massive international stadium tour behind their multi-platinum masterpiece Disintegration; and Depeche Mode’s Music For The Masses tour concluding with a show at the 90,000-capacity Pasadena Rose Bowl in California.\n\nThe 90s, though, are generally regarded as the golden age for indie music, both creatively and commercially. During the early years of this especially seismic decade, grunge music spearheads Nirvana, Pearl Jam, The Smashing Pumpkins, and Soundgarden broke into the mainstream, achieving multi-million sales and a global profile beyond the wildest dreams of the independents that emerged during the post-punk era. Inadvertently spawning another catch-all indie-related term, “alternative rock,” in the process, the success of the grunge pioneers also enabled a welter of fledgling US stars-in-waiting, ranging from punk revivalists Green Day and The Offspring to experimental lo-fi stars Beck and Liz Phair to establish themselves in the long term\n\nBeck - Pay No Mind (Snoozer)\n\nWatch this video on YouTube Click to load video\n\nIn the UK, indie music played an equally central role to the 90s pop scene. Britpop superstars Oasis, Pulp, Blur, The Verve, Supergrass, and Elastica all hailed from indie backgrounds, while the much-feted Creation label (home to Oasis, Primal Scream, Super Furry Animals, and many more) was hailed as one of the cornerstones of what the UK media referred to as “Cool Britannia,” the resulting exposure leading to label boss Alan McGee and Oasis’ Noel Gallagher famously taking tea with British Prime Minister Tony Blair at No.10 Downing Street.\n\nIndie music continued to cast a long shadow in the early years of the new millennium. Respected imprints such as Heavenly, Creation, and a revitalized Rough Trade promoted many of the era’s movers and shakers, including precocious Aussie outfit The Vines, stylish Swedish garage-rockers The Hives, and two drop-dead-cool New York outfits, The Strokes and Yeah Yeah Yeahs. Surely the biggest indie draw of the 00s, though, were Sheffield’s Arctic Monkeys, whose profile initially rose through their interaction with fans via MySpace before their much-acclaimed 2006 debut, Whatever People Say I Am, That’s What I’m Not, yielded multi-platinum sales and international recognition.\n\nYeah Yeah Yeahs - Maps (Official Music Video)\n\nWatch this video on YouTube Click to load video\n\nIndie isn’t dead\n\nChanging trends and the way we now consume music via digital platforms have, however, caused some cultural commentators to write indie music off in more recent years, with a 2012 article in UK broadsheet The Guardian even referring to “the slow and painful death” of indie rock.\n\nYet a wealth of contradictory evidence abounds. In fact, in 2018, genre godfathers The Cure, New Order and Depeche Mode continue to fill stadiums; indie imprints both old (Cherry Red, Fire, Rough Trade) and new (Dead Oceans, Spinefarm) remain innovative and active, while acclaimed albums from newer indie/alt.rock visionaries Arcade Fire, Tame Impala, St Vincent, Vampire Weekend, Glass Animals, Fat White Family, and Shame all conspire to suggest that rumors of this resilient genre’s demise are recklessly premature.\n\nListen to the best indie music on Spotify."}, {"url": "https://walnutcreekband.org/history-of-indie-rock-music/", "page_content": "Indie rock is a genre of rock music that originated in the United Kingdom in the 1970s. It was developed from the original rock and roll sound of the 1950s and 1960s, and typically incorporates a strong emphasis on guitar pop hooks and DIY ethic.\n\nThe Origins of Indie Rock\n\nIndie rock is a genre of rock music that originated in the United States and United Kingdom in the 1970s. Originally used to describe independent record labels, the term became associated with the music they produced and was initially used interchangeably with alternative rock. As grunge and punk rock became popular in the early 1990s, indie rock developed a variety of subgenres and related styles. In the 2000s, changes in the music industry and a growing importance of the Internet enabled a new wave of indie rock bands to achieve mainstream success.\n\nThe term “indie rock” was originally used to describe records produced on independent record labels, but it soon came to be associated with the style of music produced by these labels. The biggest difference between indie rock and other genres like pop or country is that indie rock bands are not supported by major record labels. This lack of financial backing means that indie rock bands have more creative freedom than their mainstream counterparts.\n\nIndie rock is known for its DIY attitude; bands often self-publish their music or release it on small, independent record labels. This Do-It-Yourself approach allows indie rock bands to explore new sonic territory and create sounds that are not constrained by commercial interests.\n\nThe roots of indie rock can be traced back to the 1960s, when bands like The Velvet Underground and The Beach Boys began to experiment with new sounds and production techniques outside of the mainstream music industry. In the 1970s, punk rock emerged as a reaction against the bloated stadium Rock of bands like Led Zeppelin and Yes. Punk Rock pushed DIY values to the forefront, with many punk bands self-releasing their music on small, independent labels.\n\nThe 1980s saw an increase in home recording technology, which allowed more musicians to create their own recordings without depending on larger studios. This shift led to an explosion of creativity in theIndependent Music Scene, with many new genres and subgenres emerging. In the 1990s, grunge and punkrock became popular, drawing attention away from Indie Rock. However, many Indie Rock bands continued to experiment with new sounds and styles throughout the decade.\n\nThe 2000s saw a renewed interest in Indie Rock, thanks in part to the rise of digital music services like MP3 filesand iTunes. These changes allowed Indie Rock bands to bypass radio gatekeepers and reach a wider audience directly through online channels. In recent years, Indie Rock has continued to evolve, embracing new technologies and reaching new audiences aroundthe world\n\nThe Rise of Indie Rock\n\nIndie rock is a genre of alternative rock that originated in the United States and the United Kingdom in the 1980s. Indie rock bands are characterized by their DIY ethic, independence frommajor record labels and aversion to mainstream pop culture.\n\nThe roots of indie rock can be traced back to punk rock in the 1970s, when bands such as The Ramones and Sex Pistols broke away from the mainstream music industry and began releasing music on their own terms. In the 1980s, indie rock moved away from its punk roots and developed into its own distinct genre, fueled by the rise of independent record labels such as Rough Trade and SST.\n\nThe 1990s saw the continued rise of indie rock, with bands such as Pavement, Sonic Youth, and Nirvana achieving commercial success while remaining true to their indie roots. In the 2000s and 2010s, indie rock has remained a popular genre, with bands such as The Strokes, The White Stripes, Arcade Fire, and Vampire Weekend achieving critical and commercial success.\n\nThe Mainstreaming of Indie Rock\n\nThe mid-2000s saw the mainstreaming of indie rock, with many bands crossing over from independent labels and into the Billboard charts. The term “indie rock” became less of a genre descriptor and more of an umbrella term, encompassing a wide range of sounds and styles. Although some purists decried the mainstreaming of indie rock, others saw it as a sign that the music was finally getting the attention it deserved.\n\nOne of the earliest signs of indie rock’s mainstreaming was the success of the band Modest Mouse, whose single “Float On” reached No. 1 on the Alternative Songs chart in 2004. The following year, another indie rock band, Vampire Weekend, released their self-titled debut album to great commercial and critical acclaim. Indie rock was also featured prominently in films and television shows such as Juno (2007) and (500) Days of Summer (2009), further increasing its exposure to mass audiences.\n\nDespite its growing popularity, indie rock still retained its outsider status in many ways. Mainstream radio airplay continued to be elusive for most indie bands, and many music critics still tended to view the genre with suspicion or outright condescension. Nevertheless, the 2010s have seen continued success for indie rock artists such as Arcade Fire, Grizzly Bear, and Tame Impala, with several albums achieving commercial and critical breakthroughs. It remains to be seen whether indie rock will continue to grow in popularity or recede back into the underground scene from which it emerged.\n\nThe Decline of Indie Rock\n\nThe mid-2000s saw the decline of indie rock, with many bands disbanded or on hiatus. One major reason for this was the fact that many of the most popular indie rock bands had been signed to major record labels, and as such, were no longer independent. In addition, the popularity of file sharing and digital music formats made it easier for people to find and listen to music without having to buy it, which also contributed to the decline in sales of indie rock music.\n\nThe Resurgence of Indie Rock\n\nIn the 1990s, there was a resurgence of interest in indie rock music. This was due in part to the increasing popularity of alternative rock music and the DIY ethic of the grunge and punk scenes. Indie rock bands began to experiment with different sounds and influences, resulting in a more diverse range of styles.\n\nToday, indie rock is one of the most popular genres of music, with many bands achieving mainstream success. However, some purists argue that the commercial success of indie rock has compromised its independent spirit.\n\nThe Evolution of Indie Rock\n\nThe term “indie rock” is used to describe a wide variety of styles of alternative rock music that have developed since the 1980s. Indie rock is characterized by its DIY (do-it-yourself) ethic, independent record labels, and lack of mainstream appeal.\n\nThe first wave of indie rock was led by American and British bands such as R.E.M., Sonic Youth, and Pixies. These bands were able to find success on independent labels such as SST Records and Matador Records. In the 1990s, indie rock underwent a major expansion with the rise of “lo-fi” and “slacker rock” bands such as Pavement, Weezer, and Beck. These bands brought a more pop sensibility to indie rock, helping to break down barriers between alternative music and the mainstream.\n\nIn the 2000s, indie rock experienced another wave of popularity with the rise of “indie pop” bands such as The Shins, Death Cab for Cutie, and Modest Mouse. These bands combined elements of pop music with a more experimental edge, creating a sound that was both accessible and challenging.\n\nToday, indie rock is one of the most popular genres of alternative music. It continues to evolve and expand in new directions, serving as a home for artists who are looking to create something unique and successful outside of the mainstream music industry.\n\nThe Globalization of Indie Rock\n\nThe globalization of indie rock began in the late 1990s and early 2000s, as the genre began to gain popularity in countries outside North America and Europe.\n\nIndie rock music has its origins in the independent music scene of the 1980s and 1990s, when DIY (do it yourself) ethic-driven musicians released their own records on small, independent labels or distributed them through self-promotion.\n\nIn the late 1990s and early 2000s, however, indie rock began to gain popularity in countries outside North America and Europe, thanks to the globalization of popular culture and the rise of the Internet. This led to a new wave of indie rock bands from countries as diverse as Japan, South Korea, Brazil, Argentina, Chile, Russia, and India.\n\nToday, indie rock is enjoyed by fans all over the world, thanks to the efforts of these pioneering bands who helped bring it to a global audience.\n\nThe Future of Indie Rock\n\nWhat does the future hold for indie rock? That’s a difficult question to answer, as the genre is constantly evolving and changing. However, there are a few things that we can predict.\n\nOne trend that is likely to continue is the increasing popularity of female-fronted bands. In the last few years, there has been a boom in the number of women in indie rock, and this is only likely to continue. More and more women are picking up guitars and forming bands, and they are beginning to make waves in the music industry.\n\nAnother trend that is likely to continue is the rise of DIY culture. With the advent of social media and streaming platforms such as Bandcamp, it’s easier than ever for independent artists to reach a wider audience. We’re likely to see more and more artists taking matters into their own hands and releasing their music independently.\n\nFinally, we can expect to see more cross-pollination between different genres. As indie rock continues to evolve, we’re likely to see it incorporating elements from other genres such as hip hop, electronic music, and even classical music. This crossover will only make the genre even more rich and diverse.\n\nThe Impact of Indie Rock\n\nIndie rock is a genre of music that emerged in the 1990s as a means for independent artists to express themselves without the constraints of major label control. These artists operated outside of the mainstream music industry and relied on alternative channels, such as college radio and independent record stores, to get their music heard. The DIY approach of indie rock allowed for a more intimate connection between artist and audience, and this directness became one of the key distinguishing factors of the genre.\n\nWhile indie rock initially developed as a response to the mainstream music industry, it has since come to be appreciated as its own distinct musical form. Indie rock bands are known for their creative approach to songwriting and their DIY ethic, and they have had a significant impact on the evolution of popular music over the past few decades.\n\nThe Legacy of Indie Rock\n\nIndie rock is a genre of rock music that originated in the United Kingdom in the 1970s. Originally used to describe independent record labels, the term became associated with the music they produced and was initially used interchangeably with alternative rock. As grunge and punk revival bands in the US and Britpop bands in the UK broke into the mainstream in the 1990s, it came to be used to identify those acts that retained an outsider and underground perspective. In the 2000s, as a result of changes in the music industry and a growing importance of the Internet, some indie rock acts began to enjoy commercial success, leading to questions about its meaningfulness as a term.\n\nIn the mid-1980s, the use of “indie” started to shift from its reference to recording companies to describe the style of music produced on punk and post-punk labels. During 1985, C86 was released by NME, promoting sixty-seven tracks by bands including The Wedding Present, The Vaselines and Primal Scream. Similar compilations were included on cassette tapes given away with Sounds andMelody Maker during 1986. In 1990 C87 was released by NME; it featured eighty tracks including Ride’s “Vapour Trail”, The Jesus and Mary Chain’s “Just Like Honey” and My Bloody Valentine’s “Feed Me with Your Kiss”. The following year saw further compilations released by Safari (The Indie Scene ’91) and Acid Jazz (Jazz Funk & Soul Sisters). By 1992 most major record labels had signed up to SafAIR’s initiative which allowed for vinyl records or CDs of new releases being supplied free or at greatly reduced cost remaining on sale for fourteen weeks; after this time full price recordings were returned or destroyed.[5] This facilitated a steady growth during 1992–3 as acts such as STOME became breakthrough artists.[citation needed]\n\nIn 1993 British firms enabling companies such as Creation Records [which?] Chrysalis Records [which?] took control over key US college radio stations playing Britpop imports thereby increasing airtime for such artists.[citation needed] That same year Britpop greats Blur debuted with Leisure whose mix of strident guitars riffs and mournful lyrics about alienated youth resonated with American indie fans raised on Pavement, Dinosaur Jr., Nirvana et al..[citation needed] Britpop soon dominated rotation on KROQ-FM[citation needed], arguably America’s most important modern rock station at that time.[citation needed] radios Xfm (in London) & WFNX (in Boston) also played host to many key Britpop figures including Elastica & James.[citation needed] Furthermore Oasis’ Definitely Maybe album entered Billboard 200 during 1994 – resulting their US tour that fall – their first dates outside from UK – selling out Madison Square Garden venues within three hours.[citation needed] Noel Gallagher has often credited America’s legacy college radio system for providing an essential platform upon which Oasis built their success citing in particular KROQ DJ Richard Blade who “put us on every show he could.”[citation needed]"}, {"url": "https://www.guitarlobby.com/best-indie-rock-bands-of-all-time/", "page_content": "One of the leading genres of modern time, indie rock infiltrated the music industry as early as the 1970s with its notorious DIY attitude, low-budget production, and its amalgamation of punk rock, psychedelia, post-punk, and country.\n\nThough the term was originally utilized to describe independent record labels, “indie” became synonymous with bands who strived to deviate from the mainstream norm in both sound and appearance, creating a slew of subgenres such as shoegaze, math rock, and emo. In the rest of this article, we’ll be discussing the best indie rock bands of all time and the major impact they’ve had on the music industry.\n\nList of the Best Indie Rock Bands of All Time\n\n12. Modest Mouse\n\nFrontman Isaac Brock (1992 to Present) Origin Issaquah, Washington Years 1992 to Present Genre Indie Rock\n\nPerhaps one of the more underrated indie rock bands of their era, Modest Mouse was formed in 1992 by teen Isaac Brock when he met bassist Eric Judy at his local video store and drummer Jeremiah Green at a heavy metal show, deciding that they would form a band together.\n\nThe band released their first recordings in 1994 on their debut EP, Blue Cadet-3, Do You Connect? Under K Records. Performing mostly at DIY punk venues across Washington, Modest Mouse gained larger recognition in 2000 with the release of their third studio album, The Moon & Antarctica, which was critically acclaimed with NME referring to it as “one of the greatest records ever made.” They became a major commercial success in 2004 with the release of their fourth studio album, Good News for People Who Love Bad News, which sold over 1.5 million copies in the US and was certified platinum by the end of the year.\n\nReferred to as “the best Modest Mouse album yet” by The New York Times, the album was critically acclaimed upon its release and was nominated for the Grammy Award for Best Alternative Music Album in 2005.\n\nModest Mouse continued to define the indie rock genre throughout the 2000s and 2010s and continue to explore their limits within the genre, releasing their newest album in June 2021, The Golden Casket.\n\n11. Interpol\n\nFrontman Paul Banks (1997 to Present) Origin Manhattan, New York Years 1997 to Present Genre Post-Punk Revival, Indie Rock\n\nOne of the key players in the revival of indie and alternative rock during the early 2000s, Interpol remains one of the truly great rock bands, drawing inspiration from Television and Joy Division which extended the arms of the post-punk revival.\n\nInterpol was formed by guitarist Daniel Kessler and drummer Greg Drudy in 1997. Kessler met bassist Carlos Dengler in their philosophy class at New York University and later met Paul Banks who became the band’s frontman, finalizing the band’s earliest line-up. The band released their debut work, Fukd ID No. 3 in 2000 which garnered little attention. It was during this time that Drudy left the band and was replaced by Sam Fogarino, who has remained the band’s drummer since.\n\nThe band released their debut studio album in 2002 after signing with Matador Records, titled Turn On the Bright Lights. Though the album wasn’t an immediate success, it garnered critical acclaim and cult status, with Pitchfork naming the album the best of the year. Along with bands such as The Strokes, TV on the Radio, and Yeah Yeah Yeahs, Interpol became a major influence in the post-punk revival of the 2000s and the New York City indie rock scene, helping to define the era’s distinct sound.\n\nInterpol saw continued success with their second studio album released in 2004, Antics, which is reportedly frontman Paul Banks’ favorite out of the band’s discography, as he felt more confident musically and “put a lot of blood, sweat and tears onto this record.” The band was signed to Capitol Records in 2006 and released their third studio album in 2007, Our Love to Admire, and went on to headline Lollapalooza that year.\n\nAfter releasing music regularly throughout the 2000s and 2010s, Interpol’s highly anticipated seventh studio album is currently in the works, though it was delayed by the COVID-19 pandemic and is expected to be released in early 2022.\n\n10. Arctic Monkeys\n\nFrontman Alex Turner (2002 to Present) Origin Sheffield, England Years 2002 to Present Genre Indie Rock, Post-Punk Revival, Garage Rock, Alternative Rock\n\nThough often known for dominating the “Tumblr era” of alternative rock music in the 2010s, Arctic Monkeys were highly influential much earlier, releasing an abundance of influential indie rock albums throughout the 2000s.\n\nLong-time friends Matt Helders (drums), Alex Turner (vocalist), and Andy Nicholson (bass) formed Arctic Monkeys and played their first gig together in 2003 at The Grapes at Sheffield city center. The band recorded a handful of demos and caught the attention of BBC Radio, as their Myspace page created by fans had become relatively popular. They released their debut EP in 2005, Five Minutes with Arctic Monkeys, which led them to perform at the Reading and Leeds festivals.\n\nThe band released their debut studio album in 2006, Whatever People Say I Am, That’s What I’m Not, which sold over 350,000 copies during its first week, the fastest-selling debut studio album by a band in England. The album was released in the US a month later, debuted at number 24 on the Billboard 200 Albums Chart, and sold over 30,000 copies during its first week, the second fastest-selling debut indie rock album in the US. Though music critics in the US were hesitant about Arctic Monkeys due to the UK’s critics notoriously “over-hyping” bands in the past, the band proved to be a major success during their debut North American tour.\n\nArctic Monkeys’ follow-up album in 2007, Favourite Worst Nightmare, garnered even more attention, though the band’s hype began to die down slightly with the release of their albums Humbug (2009) and Suck It and See (2011), though they continued to tour extensively. The band saw their biggest mainstream success yet with the release of their fifth studio album in 2013, AM. Featuring the smash hit singles Do I Wanna Know, Why’d You Only Call Me When You’re High? and R U Mine?, the band garnered wide attention from younger audiences, with NME describing the album’s legacy as “the soundtrack for countless nights out, hook-ups and comedowns in every town and city of this country by the end of the 2010s.”\n\nDescribed as a staple in the indie, garage, and psychedelic rock scenes, Arctic Monkeys have become one of the most important bands of the 2010s with punk poet John Cooper Clarke stating that the band is “the nearest thing to the Beatles,” while Vice stated that they are “probably the UK’s biggest, most culturally important band.”\n\n9. The White Stripes\n\nFrontman Jack White (1997 to 2011) Origin Detroit, Michigan Years 1997 to 2011 Genre Indie Rock, Garage Rock, Blues Rock\n\nFormed out of Detroit, Michigan by husband and wife music duo Jack and Meg White, The White Stripes became a smash hit in the early 2000s, helping to define a new era of indie rock.\n\nAfter meeting in high school, Jack and Meg married in 1996 and began playing music seriously together the following year in hopes of forming a two-piece band, with Jack as the vocalist and guitarist and Meg as the drummer. The duo began performing shortly after and made a name for themselves in the underground garage rock scene before releasing their debut single, Let’s Shake Hands, with Italy Records.\n\nThe band signed to Sympathy for the Record Industry in 1999, releasing their eponymous debut studio album which gained little recognition. Despite divorcing in 2000, the pair decided to continue on as The White Stripes and released their second studio album, De Stijl (the style) which despite being relatively unsuccessful has been considered by many as a cult classic because of its simplicity and authentic garage rock sound.\n\nThe White Stripe’s breakthrough success came in 2002 with the release of their fourth studio album in 2003, Elephant, which has been regarded by numerous music publications as one of the most important albums of the decade, with Rolling Stone listing the album as the fifth-best of the 2000s. Having earned a Grammy Award for Best Alternative Music Album at the 46th Grammy Awards, Elephant reached number 6 on the Billboard 200 Albums chart and its leading single, Seven Nation Army, won the Grammy Award for Best Rock Song the same year.\n\nThe band saw continued success with their follow-up albums Get Behind Me Satan (2005) and Icky Thump (2007) before disbanding officially in 2011. Though the band hasn’t toured or released music since the release of their 2007 album, they remain one of the most influential of the decade and one of the greatest duos of all time for their masterful combination of blues, garage, and alternative rock and iconic red, white and black clothing that defined the band’s iconic style.\n\n8. Oasis\n\nFrontman Liam Gallagher (1991 to 2009) Origin Manchester, England Years 1991 to 2009 Genre Britpop, Indie Rock\n\nPerhaps the most influential Britpop band of all time, Oasis has sold over 70 million records across the globe and has earned numerous accolades, making them one of the most successful and best-selling alternative music groups of all time.\n\nThe band was formed as the Rain in 1991 by guitarist Paul Arthurs, bassist Paul McGuigan and drummer Tony McCarroll who recruited the Gallagher brothers, Liam and Noel, who changed the band’s name to Oasis. Noel had written an abundance of music and became the band’s frontman and sole songwriter. The band was discovered by record producer Alan McGee in 1993 who signed the band to Creation Records. They released their debut studio album the following year, Definitely Maybe.\n\nDefinitely Maybe, considered the band’s breakthrough album, featuring the hit singles Supersonic, Live Forever, and Shakermaker which propelled the band into mainstream success. The album was critically acclaimed almost immediately and was praised for its differences from the grunge scene that was dominating alternative music in the US during the time. The album was featured on Rolling Stone Magazine’s most recent 500 Greatest Albums of All-Time list, coming in at number 217 and in 2006 was listed as the third-best British album of all time by NME.\n\nOasis’ success only continued with the release of their follow-up album in 1995, (What’s the Story) Morning Glory? which has since become the fifth-best-selling album in British music chart history and the best-selling of the decade. Featuring the iconic alternative rock anthem Wonderwall, the album sold over 350,000 copies during its release, and over 20 million since. The album was received well critically, with Rolling Stone stating that the album is “a triumph, full of bluster and bravado but also moments of surprising tenderness,” and that it “capped a true golden age for Britpop.”\n\nThough Oasis disbanded in 2009, they are still considered one of the most influential British bands and indie rock bands, inspiring the music and culture scenes of the 1990s and early 2000s often referred to as the Cool Britannia era. The band has also notably inspired a slew of artists, such as The Killers, Arctic Monkeys, Alvvays, and Deafheaven, all of whom have recalled Oasis as a major component of their musical upbringings.\n\n7. The Stone Roses\n\nFrontman Ian Brown (1983 to 1996, 2011 to 2017) Origin Manchester, England Years 1983 to 1996, 2011 to 2017 Genre Indie Rock, Alternative Rock, Dance-Rock, Madchester\n\nKnown as one of the founding brands of the Madchester scene that dominated England throughout the late 1980s and early 1990s, The Stone Roses has been regarded as one of the most prominent alternative English acts of all time for their innovation in the psychedelic and alternative rock genres as well as electronic dance.\n\nThe Stone Roses formed in 1983 by vocalist/bassist and guitarist Ian Brown and John Squire became a near-immediate success at the time of their fruition with the release of their eponymous debut studio album in 1989, which has since been regarded as one of the greatest British albums of all-time. Though not commercially successful right away, the album was praised highly by music critics and journalists, with Mojo stating that it “set the tone for rock music in the 90s.” The album has been ranked across a variety of “best of” lists throughout the years, earning the “greatest album ever” award at the NME Premier Awards show in 2000.\n\nThe band’s follow-up album in 1994, Second Coming, received relatively mixed reviews despite being commercially successful, selling over one million copies worldwide. Though the band had already been regarded as massively influential, their five-year gap between albums and lack of touring likely contributed to the album’s criticism, though it was praised by the Los Angeles Times who was in favor of Squire’s “inspired guitar work.” The group disbanded shortly afterward, though they reunited in 2011 and toured relatively extensively until 2017 when they officially disbanded.\n\nDespite having only one truly successful album, The Stone Roses have been regarded as massively influential in the alternative rock boom that spawned the grunge scene in the 1990s, inspiring Noel Gallagher of Oasis who stated that “when I heard Sally Cinnamon for the first time, I knew what my destiny was.”\n\n6. Dinosaur Jr.\n\nFrontman J Mascis (1984 to 1997, 2005 to Present) Origin Amherst, Massachusetts Years 1984 to 1997, 2005 to Present Genre Indie Rock, Noise Rock, Lo-Fi, Alternative Rock\n\nFormed by legendary guitarist J Mascus, Dinosaur Jr rose to prominence in the early 1990s and became known for their 60s and 70s inspired classic rock sound that utilized an abundance of distortion and feedback, with became a major trend in the alternative rock scene of the 90s.\n\nJ Mascus and bassist Lou Barlow played together in hardcore punk band Deep Wound before forming their own band together in 1984. They released their debut studio album the following year, Dinosaur, which was relatively ignored commercially and by music critics. While playing a gig in New York City shortly after the release of their debut album, local noise rock band Sonic Youth declared themselves as fans of the band, inviting them to open for them on their 1986 Northeastern and Northern Midwest American tours.\n\nThe band’s follow-up albums You’re Living All Over Me (1987) and Bug (1988) gained moderate attention, though the band began seeing more success with the release of their fourth studio album in 1991, Green Mind, under Sire Records. After seeing more positive reception at their live shows, the band released their fifth and most successful studio album in 1993, Where You Been, which reached number 50 on the Billboard 200 Albums Chart. Featuring the iconic indie staples Start Choppin’ and Out There, the album was extremely successful critically and has since been regarded by many as the bands best work and one of the best examples of 1990s alternative rock.\n\nDinosaur Jr. saw more success with their follow-up album in 1994, Without a Sound, which features one of their biggest hits to date, Feel the Pain. The single peaked on the Billboard Modern Rock Tracks chart at number 4, the band’s biggest commercial hit. The band split in 1997 before reuniting in 2005, releasing a handful of albums throughout the late 2000s and 2010s. Their most recent album, Sweep It Into Space, was released in April 2021 and the band embarked on their current tour in September 2021.\n\n5. The Strokes\n\nFrontman Julian Casablancas (1998 to Present) Origin New York City, New York Years 1998 to Present Genre Indie Rock, Post-Punk Revival, Garage Rock Revival\n\nFronted by legendary vocalist Julian Casablancas, The Strokes defined the indie rock sound of the 2000s with their iconic debut studio album in 2001, Is This It, which solidified the band as one of the key players in the early-2000s indie rock revival.\n\nTeenagers Julian Casablancas, Fabrizio Moretti, and Nick Valensi began playing together in 1997 and rehearsed relentlessly, forming The Strokes within the next two years and performing constantly across New York City. The band played their first official show as The Strokes in 1999 and released their debut EP, The Modern Age EP, in 2001 which resulted in record labels starting the largest bidding war over any band in a number of years.\n\nThe Strokes released their debut studio album shortly afterward, Is This It, and featured the singles Last Nite, Someday, and Hard to Explain. The album was an immediate commercial and critical success, reaching number 33 on the US Billboard 200 and was named the “best album of 2001” by numerous publications, including Time, Billboard, NME, and Entertainment Weekly, while Rolling Stone raved about the album’s release, stating that it is “the stuff of which legends are made.” Described as indie rock, garage rock, and post-punk revival, the album went on to define the modern rock sound, with The Observer stating the album’s release was a “world-changing moment.”\n\nEver since The Strokes debut, they’ve continued to pioneer the modern alternative rock sound with their follow-up albums Room on Fire (2003) and First Impressions of Earth (2006) while their most recent album The New Abnormal (2020) has grown to become a favorite among fans and critics. Now regarded as one of the most influential bands of all time, The Strokes remain one of the most influential acts of the early 2000s, with novelist Lizzie Goodman writing in her novel documenting the New York City music scene, stating that the band is “as influential to their era as the Velvet Underground or the Ramones were to theirs.”\n\n4. Sonic Youth\n\nFrontman Kim Gordon (1981 to 2011) Origin New York City, New York Years 1981 to 2011 Genre Indie Rock, Noise Rock, Experimental Rock, Post-Punk\n\nPerhaps one of the earliest indie rock bands, Sonic Youth emerged from the New York City no-wave art and music scene, becoming one of the most influential noise-rock bands that truly experimented with classic rock guitar.\n\nVocalist Kim Gordon and guitarist Thurston Moore formed Sonic Youth together after performing in separate bands in the late 1970s, the Coachmen and CKM, respectively. The band recorded their eponymous debut EP under Neutral Records which was relatively unsuccessful, though it received positive reviews from music journalists. The band’s earlier work throughout the early to mid-1980s drew inspiration from post-punk and helped develop the iconic no-wave sound and became synonymous with the noise rock scene made popular by bands like the Butthole Surfers and Big Black.\n\nThe band’s breakthrough came later in their career with the release of their sixth studio album in 1990, Goo, released under Geffen Records. The album largely explored pop culture and female empowerment while maintaining its signature layered sound and alternating guitar arrangements. It was the band’s most successful to date and has since been regarded as one of the more important indie and alternative rock albums of all time, appearing on Rolling Stone’s most recent 500 Greatest Albums of All-Time List at number 358.\n\nSonic Youth only continued to garner major success throughout the 1990s, releasing their seventh studio album in 1992, Dirty, which was stated as “much-needed proof that the old-fangled concept of a rock guitar band can still result in vital, undeniably moving music” by Entertainment Weekly. The band also saw success with their follow-up albums Experimental Jet Set, Trash and No Star (1994), Washing Machine (1995), and A Thousand Leaves (1998).\n\nThe band continued to make music throughout the early to mid-2000s, though it wasn’t as successful as what the band had created in the 90s. After being married for 27 years, Moore and Gordon separated and as a result, Sonic Youth disbanded officially in 2011. Despite the band’s break-up, they remain one of the most influential alternative bands of all time, having been credited with pioneering the noise and alternative rock genres. Overall, Sonic Youth is easily one of the best indie rock bands of all time and certainly deserves a spot toward the top of this list.\n\n3. Joy Division\n\nFrontman Ian Curtis (1976 to 1980) Origin Salford, England Years 1976 to 1980 Genre Post-Punk, New Wave, Gothic Rock, Indie Rock\n\nDespite being a band for a mere four years, Joy Division was one of the most unique music groups to emerge during the latter half of the 1970s, helping define the post-punk sound. The band’s blossoming career was cut short at the dawn of the 80s following the tragic death of frontman Ian Curtis, who has since become a legendary figure in post-punk history.\n\nChildhood pals Peter Hook and Bernard Sumner were heavily inspired to create their own band after attending a Sex Pistols show, resulting in Hook begging his mother for a bass which he received shortly afterward. The duo soon recruited fellow concert-goer Terry Mason as their drummer and vocalist Ian Curtis who responded to an advert that the band placed in search of a frontman. Originally named Warsaw, the group performed for the first time at Electric Circus, supporting other acts such as the Buzzcocks. Music journalists from NME and Sounds were in attendance and wrote positively about the band.\n\nIn 1977 Warsaw finalized their band with drummer Stephen Morris and changed their name to Joy Division the following year to avoid being confused with the punk band Warsaw Pakt. The band recorded their debut EP shortly afterward, An Ideal for Living, and performed on television for the first time on So It Goes, where they performed the iconic track Shadowplay. Joy Division saw their major breakthrough in 1979 after the release of their debut studio album, Unknown Pleasures, which has been, practically unanimously, highly praised by music critics since its release and subsequently named one of the best and most influential albums of all time by Rolling Stone Magazine, NME, AllMusic and Spin.\n\nThe band recorded their second and final studio album in March of 1980, Closer. After struggling with an uncontrollable bout of seizures and marriage problems, frontman Ian Curtis committed suicide at the age of 23 just two months following the recording of the album. Curtis’ death shook the band and their fans, and the group unanimously decided that they would not continue on as Joy Division without Curtis. The band released Closer in July of that year, which was believed by Curtis as their “artistic pinnacle.” The album stands as one of the most important of all time and their most defining work, with music critic Mark Fisher stating that it is “the crown jewel of post-punk.”\n\nJoy Division remains one of the most defining bands of the 1970s for their iconic melancholic gothic overtones and dance rhythms, directly influencing numerous artists such as The Cure, Interpol, Soundgarden, and U2. AllMusic has referred to the band’s legacy, stating that they “became the first band in the post-punk movement by emphasizing not anger and energy but mood and expression.”\n\n2. Pixies\n\nFrontman Black Francis (1986 to 1993, 2004 to Present) Origin Boston, Massachusetts Years 1986 to 1993, 2004 to Present Genre Indie Rock, Alternative Rock, Noise Pop\n\nThough not popular in the mainstream at the time of their upbringing, The Pixies became one of the most influential indie bands towards the latter half of the 1980s, inspiring a major shift in popular music towards alternative rock which dominated the 1990s by bands such as Nirvana, the Smashing Pumpkins and Radiohead.\n\nVocalist Black Francis met guitarist Joey Santiago during their college years, forming a band together in early 1986. The duo was joined by bassist Kim Deal and drummer David Lovering, and the Pixies soon came to fruition. The young band began playing small shows across Boston and were quickly discovered by record producer Gary Smith, who reportedly told the band that he “could not sleep until you guys are world-famous.”\n\nThe band was almost immediately signed to 4AD and released their debut work, a mini-LP titled Come on Pilgrim in 1987 which was followed by their iconic debut studio album the following year, Surfer Rosa. Produced by legendary record producer and musician Steve Albini, the album has become a trademark in the alternative rock genre and has been considered one of the most influential of the 1980s across all genres. At the time of its release, the album was praised highly by music critics from magazines such as NME and Q, though it didn’t garner much attention in the US until years after its release.\n\nWith songs like Where Is My Mind and Gigantic becoming alternative anthems, the Pixies released their next studio album in 1989, Doolittle, which has since been considered the band’s true breakthrough and staple album. Featuring a true mixture of the loud to quiet dynamic in tracks like Tame, the album became an immediate influence on the alternative rock genre as it rose to number 98 on the Billboard 200 Albums chart in the US. The album has since been featured on a variety of “best-of” lists, most notably as number 141 on Rolling Stone’s 500 Greatest Albums of All-Time list and as the second-greatest album of all-time by NME.\n\nSince the Pixies’ debut, they have become one of the most important bands of all time, not only for the wave of alternative music that they went on to inspire but for their sheer innovation in music as a whole with their pioneering of the soft and quiet/loud and hard dynamic. David Bowie referred to the band’s legacy, stating that they made “just about the most compelling music of the entire 80s,” while Bono of U2 named them as “one of America’s greatest bands.” Kurt Cobain of Nirvana stated that their iconic hit Smells Like Teen Spirit was “an attempt to co-op the Pixies’ style.”\n\n1. The Smiths\n\nFrontman Morrissey (1982 to 1987) Origin Manchester, England Years 1982 to 1987 Genre Post-Punk, Indie Rock, Jangle Pop, Alternative Rock\n\nKnown for their poetic lyricism, chiming guitar, and sensitive melancholia, The Smiths is one of the most prolific indie rock bands of all time. They have inspired a variety of subgenres such as Britpop and notable indie artists Noel Gallagher of Oasis and John Squire of The Stone Roses.\n\nThe Smiths came to fruition in 1982 when Johnny Marr knocked on the door of his acquaintance Morrissey’s home, asking him to form a band. Morrissey was timid but agreed, and the duo began rehearsing together just days afterward. Joined by drummer Mike Joyce and bassist Dale Hibbert, the band played their first gig later that year, performing the songs Suffer Little Children and The Hand That Rocks the Cradle.\n\nThe band released their eponymous debut studio album in 1984 which peaked at number two on the UK Albums Chart. Featuring the notable tracks Reel Around the Fountain, Still Ill and Pretty Girls Make Graves, the album was a major stepping stone for the band, establishing their signature post-punk sound. They released their debut compilation album later that year, Hateful of Hollow, which featured some of the band’s popular non-album singles How Soon Is Now?, Heaven Knows I’m Miserable Now and William, It Was Really Nothing.\n\nThe Smith’s second studio album in 1985, Meat Is Murder, was more political than their previous releases, though it continued to expand on the band’s post-punk sound with popular tracks such as The Headmaster Ritual and That Joke Isn’t Funny Anymore. The band saw major success with their third album in 1986, The Queen Is Dead. The album received wide critical acclaim, reaching number 70 on the US Billboard 200 Albums chart. Featuring the hits The Boy with the Thorn in His Side, Bigmouth Strikes Again, There Is a Light That Never Goes Out, and Cemetry Gates, the album has since been regarded as one of the most important of the 1980s, with NME listing it as the best album of all-time in 2013, while Rolling Stone listed the album at number 113 on their most recent 500 Greatest Albums of All-Time list.\n\nThe band released their final studio album in 1987, Strangeways, Here We Come, and their final compilation album later that year, Louder Than Bombs. The Smiths disbanded due mostly to creative differences between Morrissey and Marr, both of whom embarked on solo careers shortly afterward.\n\nThe Smiths, despite creating music together for only five years, have been regarded critically and commercially as one of the most important indie rock bands of all time, with BBC News stating that they are “the band that inspired deeper devotion than any British group since the Beatles,” while Q stated that they were “the one truly vital voice of the 80s.”"}, {"url": "https://www.musicindustryhowto.com/what-is-indie-rock-music/", "page_content": "Indie rock music has been around for decades, although it became popular in the 1980s. Since then, hundreds of indie rock musicians have risen to the top of the charts.\n\nIndie rock music differs from traditional rock music because it often embraces a softer sound. This type of rock music got its name because most record labels producing this music were independent of others in the industry.\n\nWhat Is Indie Rock Music?\n\nIndie rock music is an offshoot of rock music that developed after young musicians wanted to embrace a different sound than pop and rock music genres were familiar with at the time. The word indie is short for independent, which refers to the labels that cropped up to help artists release music that didn’t fit into more defined genres.\n\nThis music started in the 1980s in the United Kingdom and the United States. Many music lovers associated grunge sounds and alternative songs to fit in with the indie rock scene at the time of its conception.\n\nIndie Rock Music Characteristics\n\nIndie rock music is characterized by a few unique features. Typically, indie rock music has a careful mixture of poppy notes and sensitive lyrics. Additionally, this genre will depict the singer to have a level of authenticity and portray the musician as an easy-going individual looking for love or acceptance.\n\nThere is usually a melodic use of pop to drive a narrative that paints a picture of betrayal or mistreatment. This genre will also use a mixture of verses that use soft melodies adjacent to angry and grungy choruses that may showcase anger.\n\n9 Examples of Indie Rock Music\n\nThere are dozens of stunning examples of indie rock music, but these nine songs perfectly showcase indie rock music. Without these classic examples of the indie rock music genre, the whole subcategory would not be what it has developed into in today's music scene.\n\nThese artists have topped the charts for their unique sounds and personalities. Artists like Arctic Monkey and Weezer have morphed this category into something that takes the music world by storm.\n\nSoul Meets Body by Death Cab for Cutie\n\nSoul Meets Body by Death Cab for Cutie is a song that can be interpreted in many ways. The lyrics of this song can indicate someone feeling sad about their impending mortality or discuss the happiness of being alive in the present moment.\n\nThere are mentions of traveling and getting as far from thoughts as possible. This song may also discuss finding a place to belong and feeling out of place no matter where you go. Ideally, when the singer finds where they are meant to be, their soul will meet their body.\n\nWhen the Sun Goes Down by Arctic Monkeys\n\nWhen the Sun Goes Down by Arctic Monkeys tells a depressing story about a woman who finds herself in a poor position. Without many options for her life, she becomes a prostitute and gets abused multiple times by the man she works under.\n\nThis song was based on a real place the main singer had seen before and had been inspired by upon a visit. This song details the sad optimism of wanting better and endlessly hoping for things to improve as the next day comes. However, it also discusses how dark and despairing things become during the night in this location.\n\nSay It Ain’t So by Weezer\n\nSay It Ain’t So by Weezer is a sad song about a family torn apart by rampant alcoholism slowly destroying the household. One of the band members discusses being inspired by a picture he drew as a child of him and his father playing soccer before his father began a downward spiral that tore his family to bits.\n\nAs this band member grew into adolescence and grew through his teenage years, his father spiraled out of control, and there was nothing this musician could do to stop it.\n\nSeven Nation Army by The White Stripes\n\nThis anthem is about finding strength within to keep everyone else at bay and focusing only on yourself and your needs. Seven Nation Army was named from a mistaken pronunciation of the charity Salvation Army, making it an apt comparison since the song is about straying from being subject to others.\n\nSmells Like Teen Spirit by Nirvana\n\nSmells Like Teen Spirit by Nirvana was initially inspired by a comment that Kurt Cobain’s girlfriend made, saying he smelled like a deodorant brand. Cobain later discussed how he wrote Smells Like Teen Spirit as a revolution anthem, although his bandmates considered the song to be cliche.\n\nHowever, the song took the world by storm and became an icon for teens across the world. Smells Like Teen Spirit is all about defiance and subverting expectations that many people placed on young adults as they grow up. This song was meant to break free from the apathy of the world and help the youth wake up and embrace themselves.\n\nBitter Sweet Symphony by The Verve\n\nBitter Sweet Symphony is about the moments in someone’s life that can feel too good and too bad at the same time. For example, saying goodbye to friends as they go to college or get a really well-paying job can be bitter-sweet moments.\n\nThis song by The Verve showcases how sad these moments can make someone feel and how they can taint an overall happy experience. However, it can show how bitter moments can have sweetness too. For example, a breakup with someone can open a door to finding a better fit for love, or moving to a new city may mean meeting new friends.\n\nThis Charming Man by The Smiths\n\nThe Smiths wrote This Charming Man to discuss feeling disconnected from societal norms and what it's like to watch others and view them positively. This song shows what it’s like to view yourself in a less positive light while you see others above your class or societal station and appreciate their effort and success.\n\nThis Charming Man is rife with self-awareness and exposes what it’s like to desire change. This song explores how deeply the singer wants to be a different person but may feel despair that they will never embody that person.\n\nTake Me Out by Franz Ferdinand\n\nTake Me Out by Franz Ferdinand is one of the most famous indie rock songs about loneliness and finding community with other like-minded people who struggle with the same feeling. The singer discusses feeling disconnected from someone they really loved in the past and how they feel like they are stuck in the cross-hairs of a conflict or disaster.\n\nFranz Ferdinand discusses feeling upset because they know they won’t be able to leave the place they’re in with the person they love. This unrequited love seems to make the singer feel so despaired about the situation that they would rather not participate in daily life functions anymore.\n\nMr. Brightside by The Killers\n\nMr. Brightside is unique because it uses a poppy sound to discuss a traumatizing event. However, this event may be only happening in the singers’ minds. Mr. Brightside is about a person plagued by the thought of someone he loves spending the night with another person. Some listeners speculate that this person is a sex worker and that the singer had developed an obsession with the worker.\n\nMr. Brightside is easily one of the most distressing indie rock songs but holds a nihilistic feel. This singer knows they’ll be okay, even if they don’t get what they want.\n\n5 Top Indie Rock Musicians\n\nThere are hundreds of indie rock musicians and bands that have tried their hand at performing and producing top-tier content. However, there are a handful of musicians that succeeded and offered the world something truly undeniable.\n\nArtists like Nirvana, Red Hot Chili Peppers, and Radiohead are some of the most famous and talented musicians in the indie rock category. These bands have a unique sound that makes them some of the best musicians in the genre.\n\nNirvana\n\nThe band Nirvana was formed in 1987 and began as a garage band. This band constantly pushed boundaries with their outfits, their music, and their genre. Plenty of the songs that Nirvana wrote focused on blending grungy, garage band sounds with soft vocals to create anthems, and sad prose, and convey creative messages.\n\nNirvana was a giant in the indie rock scene and this band paved the way for other bands to thrive.\n\nArctic Monkeys\n\nArctic Monkeys were formed in 2002 and began making music that embraced sad, contemplative songs. This band originated from England and wrote in many different genres, opting to change their style often to prevent fading into obscurity.\n\nArctic Monkeys were considered one of the best and most important bands in the age and received plenty of praise via the newly formed internet forums.\n\nRed Hot Chili Peppers\n\nRed Hot Chili Peppers are still making music in 2022, but they were first formed in 1983. Over the last 30 years, this band has embraced dozens of music genres and made music to cater to themselves, their situations, and the lives of their listeners.\n\nFans of the Red Hot Chili Peppers are typically also fans of Nirvana, Pearl Jam, and Foo Fighters. All of these bands are top contenders in the indie music scene and are famous for producing relatable content.\n\nRadiohead\n\nThe band Radiohead first began in 1985, and this band was first famous for producing hard rock and rock content. However, Radiohead was a top contender in the indie rock music scene, as well. This band produced a lot of experimental content that may not have sat well with their initial target demographic.\n\nWhile Radiohead has not broken up, the members are currently working on solo projects, meaning the band will not be producing group content for the time being.\n\nLinkin Park\n\nLinkin Park is a famous band and has a massive following for being one of the top musicians in the indie rock music genre. Linkin Park pushed the boundaries of rock music by introducing rapping into their songs, allowing them to embrace a wider audience and experiment with other song structures.\n\nLinkin Park has been a band since 1996, but no longer produces new content. This band suffered the loss of its lead singer, Chester Bennington, in July of 2017.\n\nThe History of Indie Rock Music\n\nIndie rock music hit the scene in the 1980s. This music became popular among music lovers but many record labels wouldn’t take chances on the unique sound. Instead, these musicians went to independent labels willing to put themselves on the line for bands that were equally talented and passionate about their new work.\n\nDozens of famous bands cropped up from this newfound genre. The Smiths, R.E.M., and Nirvana are only some of the headliners of the genre that changed music history forever. More independent labels began to grow, establish themselves in the limelight, and back artists pushed the boundaries on what indie rock music could be.\n\nWhat Is Indie Rock Music? Final Thoughts\n\nIndie rock music and musicians have morphed into something entirely new from other rock and pop categories. The artists who have worked on indie rock songs offer something soft and unique to preexisting genres to make something entirely their own.\n\nAlthough there are some defining characteristics of the indie rock genre, there is also some wiggle room. These songs and artists have changed history since the 1980s and brought new sounds to the table that have taken radio stations to a whole new level."}, {"url": "https://walnutcreekband.org/what-is-the-definition-of-indie-rock-music/", "page_content": "If you’re a fan of alternative and independent music, then you’ve probably heard the term “indie rock” before. But what is the definition of indie rock music, exactly? In this post, we’ll explore the history and evolution of this musical genre to help you better understand what it is and why it’s so popular.\n\nIndie Rock Music?’ style=”display:none”>\n\nThe History of Indie Rock\n\nIndie rock is a genre of rock music that originated in the United Kingdom in the 1970s. Originally used to describe independent record labels, the term became associated with the music they produced and was initially used interchangeably with alternative rock or “guitar pop rock”. In the 1980s, the use of the term “indie” started to shift from its reference to recording companies to describe the style of music produced on punk and post-punk labels. During the 1990s, grunge and punk revival bands in the US and Britpop bands in the UK broke into the mainstream, and the term “alternative” lost its original counter-cultural meaning.\n\nThe origins of indie rock\n\nIndie rock is a genre of popular music that emerged in the late 1970s and early 1980s. Originally used to describe independent record labels, the term became associated with the musical style of bands such as the Pixies, Hüsker Dü, and R.E.M.\n\nIn the 1990s, after the success of Nirvana and other grunge bands, indie rock developed a more commercial sound, leading to the popularity of bands such as Oasis, Pavement, and Weezer. In the 2000s, indie rock experienced a resurgence, with the rise of bands such as The Strokes and The White Stripes.\n\nIndie rock has been described as “a scrappy combination of punk DIY ethic and aesthetic”, and is sometimes characterized by its rejection of traditional genre boundaries. There is no one definition of indie rock, but it is generally understood to be a type of alternative rock that is independent from major label support.\n\nThe development of indie rock\n\nThe development of indie rock was strongly influenced by the original independent rock movement of the 1960s and 1970s. This movement was led by bands like the Velvet Underground, Sonic Youth, and Pixies, who paved the way for later indie rock groups.\n\nIn the 1980s, college radio became an important platform for independent music. This is when iconic bands like R.E.M., Hüsker Dü, and The Replacements rose to prominence.\n\nThe 1990s saw the advent of two subgenres that would come to be synonymous with indie rock: lo-fi and Britpop. Lo-fi bands like Sebadoh and Pavement made music that was intentionally rough around the edges, while Britpop groups like Oasis and Blur brought a more pop sensibility to the genre.\n\nThe 2000s saw indie rock continue to evolve, with new subgenres like math rock, post-rock, and indie pop emerging. At the same time, established bands like Radiohead and Arcade Fire found crossover success without compromising their independent status.\n\nToday, indie rock is as popular as ever, with a wide variety of artists keeping the genre fresh and exciting.\n\nThe Characteristics of Indie Rock\n\nIndie rock is a subgenre of alternative rock that originated in the United Kingdom in the late 1970s. Indie rock is characterized by a DIY ethic, independent record label ownership, and a disdain for the mainstream music industry. Indie rock music is typically released on independent record labels or on major label subsidiaries that cater to an indie rock audience.\n\nThe sound of indie rock\n\nIndie rock is a genre of rock music that originated in the United States and United Kingdom in the 1970s. Originally used to describe independent record labels, the term became associated with the music they produced and was initially used interchangeably with alternative rock or “guitar pop rock”. In the 1980s, the use of the term “indie” started to shift from its reference to recording companies to describe the style of music produced on punk and post-punk labels. During the 1990s, grunge and punk revival bands in the US and Britpop bands in the UK broke into the mainstream, which created a new group of listeners for indie rock. The term “indie rock”, which comes from “independent”, describes the small and relatively low-budget labels on which it is released and developed a buzz.\n\nThe lyrics of indie rock\n\nThe lyrics of indie rock tend to be personal and introspective, often dealing with the troubles and anxieties of everyday life. They often take an ironic or dark tone, and can be seen as a form of social commentary. Many indie rock songs are also story-songs, which tell a narrative story through the lyrics.\n\nThe look of indie rock\n\nIndependent music is typically associated with a do-it-yourself (DIY) ethic, in which artists produce, release and promote their own material. This DIY approach often results in a more eclectic or experimental sound than that of more mainstream artists. Indie rock artists often eschew traditional major label contracts and work with independent record labels or release their music independently.\n\nIndie rock is typically characterized by its use of distorted guitars, off-beat rhythms and irregular song structure. Indie rock bands often experiment with different sounds and influences, and as a result, the genre is highly diverse. Some common subgenres of indie rock include lo-fi, math rock, noise pop, post-rock and shoegaze.\n\nThe Culture of Indie Rock\n\nIndie rock is a genre of popular music that originated in the United Kingdom in the 1970s. It was originally used to describe independent record labels, but has since been used to describe a variety of different music styles. Indie rock is known for its DIY ethic and for its focus on independent artists.\n\nThe indie rock scene\n\nThe indie rock scene is a subculture that originally developed in the United Kingdom in the 1980s. Indie rock is a genre of alternative rock music that emerged from the independent music underground of the 1980s and became widely popular in the 1990s. Indie rock is characterized by a DIY ethic, experimentalism, and uncompromising commitment to an independent vision.\n\nThe term “indie rock” was used originally to describe the music of independently signed artists, on small independent record labels, who were challenging the major label system from within. In the 1990s, as major label signing deals became more and more common for indie rock bands, the term came to mean anything that was not part of the mainstream music industry.\n\nWhat sets apart indie rock from other genres is its focus on an artist’s individuality and creativity, rather than on commercial success. Indie rock bands are often signed to independent record labels, which allows them more creative freedom than bands signed to major labels.\n\nThe indie rock scene has its roots in punk rock, but it has also been influenced by a wide range of musical genres, including folk music, hip hop, electronic music, and even classical music.\n\nThe indie rock community\n\nThe indie rock community is a group of musicians, music critics, and music fans who support independent music. The term “indie rock” is used to describe a wide variety of musical styles, including but not limited to: punk, post-punk, new wave, college rock, jangle pop, noise pop, lo-fi, math rock, emo, homespun DIY recordings, and more.\n\nThe indie rock community is united by a preference for independent record labels and an aversion to the major label system. Indie rock musicians often try to distance themselves from the mainstream music industry and the commercialism that comes with it.\n\nThe indie rock community is supportive of DIY culture and do-it-yourself ethics. Many indie rock bands self-produce their records and sell them through independent record labels or through online stores such as Bandcamp.\n\nThe term “indie rock” is sometimes used interchangeably with “alternative rock,” but there are some key differences between the two genres. Alternative rock is more likely to be found on commercial radio stations and in the mainstream music industry, while indie rock is more underground and niche.\n\nThe Future of Indie Rock\n\nIndie rock is a genre of alternative rock that originated in the United Kingdom in the 1970s. Indie rock is a subculture that seeks to promote independent music, and it has been described as “a style of alternative rock characterized by a DIY ethic and an aversion to major studio polish.” Indie rock has been expanding in popularity in recent years, due in part to the rise of streaming services like Spotify and Apple Music.\n\nThe evolution of indie rock\n\nThe term “indie rock” has been used to describe a wide variety of musical styles over the years, making it hard to pinpoint a single definition. In general, indie rock can be seen as a reaction against the mainstream music industry, with artists creating music that is more personal and experimental.\n\nOver time, the sound of indie rock has evolved and incorporated elements from other genres, such as punk, hip hop, and electronic music. As a result, there is now a huge range of different indie rock subgenres, each with its own unique sound.\n\nSome of the most popular indie rock subgenres include lo-fi, math rock, emo, noise pop, post-rock, and shoegaze. With so many different styles to choose from, there is sure to be an indie rock sound that appeals to everyone.\n\nThe influence of indie rock\n\nIndie rock is a genre of music that is typically characterized by a do-it-yourself and independent musician mentality. Indie rock bands are usually unsigned, or signed to an independent record label rather than a major label. Indie rock music is typically alternative in nature, and often takes influence from punk rock, garage rock, lo-fi, and post-punk.\n\nThe term “indie rock” was first used in the late 1980s to describe the output of British independent record labels that were starting to release music by artists who were influenced by American punk and alternative music. The term was later used in the United States to describe the same thing.\n\nIn the 1990s and 2000s, indie rock became more popular in the mainstream, as bands such as Nirvana, Radiohead, and The Strokes achieved commercial success. As a result, many indie rock bands have been signed to major labels or have broken up altogether.\n\nThe future of indie rock is uncertain. However, there is still a large underground scene of independent musicians who are keeping the genre alive."}, {"url": "https://walnutcreekband.org/list-of-independent-music-indie-rock-bands/", "page_content": "If you’re looking for some new music to check out, look no further than these great indie rock bands! From up-and-coming artists to established acts, there’s something for everyone on this list. So turn up the volume and get ready to rock out!\n\nRock Bands to Check Out Right Now’ style=”display:none”>\n\nThe 1975\n\nThe 1975 is an English rock band that formed in 2002. The band’s members include lead vocalist and rhythm guitarist Matthew Healy, bassist Ross MacDonald, lead guitarist Adam Hann, and drummer George Daniel. The band’s debut album, released in 2013, topped the UK Albums Chart and was certified platinum in the US. The band’s second album, released in 2016, also topped the UK Albums Chart and was certified gold in the US.\n\nAbout the band\n\nThe 1975 are an English pop rock band from Manchester, England. The group consists of lead vocalist and rhythm guitarist Matthew Healy, bassist Ross MacDonald, lead guitarist Adam Hann and drummer George Daniel. The band’s debut album, The 1975 (2013), reached number one in the UK and number 28 in the US. It was certified platinum in the UK and double platinum in the US.\n\nThe band’s second album, I Like It When You Sleep, for You Are So Beautiful yet So Unaware of It (2016), entered the UK Albums Chart at number one and the US Billboard 200 at number two. It won Best British Album at the 2017 Brit Awards. The album was also nominated for Album of the Year at the Grammy Awards. In May 2018, they released a single entitled “Give Yourself a Try”, followed by “Love It If We Made It” in July. Their third album, A Brief Inquiry into Online Relationships (2018), was released on 30 November 2018 and peaked at number four on both charts.\n\nTheir sound\n\nThe 1975 is an English indie rock band formed in 2002. The group consists of lead vocalist and guitarist Matthew “Matty” Healy, drummer George Daniel, bassist Ross MacDonald, and keyboardist Adam Hann. They have released four studio albums: The 1975 (2013), I like it when you sleep, for you are so beautiful yet so unaware of it (2016), A Brief Inquiry into Online Relationships (2018), and Notes on a Conditional Form (2020).\n\nThe band’s origins trace to Healy and Daniel’s attendance at Wilmslow High School in Cheshire, where they formed the group Drive Like I Do. The duo shared a love of performing live, and began playing gigs around Manchester while still in school. Drive Like I Do broke up in 2009, but Healy and Daniel continued to work together. In late 2011, they recruited Hann and MacDonald as their new bandmates, adopted the name “The 1975”, and began working on new material.\n\nThe band released their debut single “Chocolate” in August 2012 to positive reviews from music critics. Their self-titled debut album followed in September 2013 and debuted at number one on the UK Albums Chart. It was later certified platinum by the British Phonographic Industry (BPI). The album’s second single, “Sex”, peaked at number 22 on the UK Singles Chart while its third single, “Robbers”, reached number nine. The band’s second album, I like it when you sleep, for you are so beautiful yet so unaware of it, was released in February 2016 to positive reviews from critics. It debuted at number one on the UK Albums Chart and became the fastest-selling album by a band since Blur’s 1997 self-titled album. Its lead single “Love Me” peaked at number nine on the UK Singles Chart while its second single “The Sound” reached number 17; both received widespread radio airplay in the United Kingdom.\n\nNotable songs\n\nThe 1975 is an English pop rock band from Manchester. The group consists of Matthew Healy, Adam Hann, Ross MacDonald and George Daniel. The band’s debut album, titled The 1975, was released on 2 September 2013 through Dirty Hit and Polydor Records. Their second album I like it when you sleep, for you are so beautiful yet so unaware of it was released on 26 February 2016 and debuted at number one in the UK and number five in the US.\n\nThe band has released a number of successful singles, such as “TheSound”, “Love Me”, “Somebody Else”, “Chocolate”, “Girls” and “Robbers”.\n\nThe National\n\nThe National is an American indie rock band from Cincinnati, Ohio, formed in 1999. The band consists of Matt Berninger (vocals), Aaron Dessner (guitar, keyboards), Bryce Dessner (guitar, keyboards), Scott Devendorf (bass) and Bryan Devendorf (drums). Aaron and Bryce are the twin brothers of the band. The National has released eight studio albums, two of which were on the list of “The 100 Best Albums of the Decade So Far” (2010 and 2013).\n\nAbout the band\n\nThe National is an American indie rock band from Cincinnati, Ohio, formed in 1999. The band consists of Matt Berninger (vocals), Aaron Dessner (guitar, keyboards), Bryce Dessner (guitar, keyboards), Scott Devendorf (bass) and Bryan Devendorf (drums). Originally self-released in 2001, the band’s fourth album, Alligator (2005), brought them to the attention of a wider audience. Boxer (2007) and High Violet (2010), the band’s fifth and sixth albums respectively, were also highly praised by critics. A seventh album, Sleep Well Beast was released on September 8th, 2017 to critical acclaim.\n\nTheir sound\n\nThe National’s music has been called dark, sad, and even depressing by some. But that’s not an entirely accurate representation of their sound. Sure, their lyrics often deal with heavy subject matter like addiction, mental health, and mortality, but there’s also a good amount of hope, love, and humor woven into their songs.\n\nAnd while The National might not be everyone’s cup of tea, there’s no denying that they’re one of the most important indie rock bands of the last 20 years. They’ve released six studio albums, all of which have been met with critical acclaim, and their live shows are legendary. If you’re a fan of indie rock, or just good music in general, The National are definitely worth checking out.\n\nNotable songs\n\nThe National is an American rock band from Cincinnati, Ohio, formed in 1999. The band consists of Matt Berninger (vocals), Aaron Dessner (guitar, keyboards), Bryce Dessner (guitar), Scott Devendorf (bass) and Bryan Devendorf (drums).\n\nThe group’s eponymous debut album was released in 2001 on Brassland Records to critical acclaim. The National’s second album, Sad Songs for Dirty Lovers, was released in 2003 also to critical acclaim. Their third album, Alligator, was released in 2005 to wider commercial success and acclaim. Boxer followed in 2007 and High Violet arrived in 2010; both albums improved upon the commercial success of Alligator and were critically acclaimed. Trouble Will Find Me debuted at #3 on the Billboard 200 chart and continued the band’s trend of increasing album sales and positive reviews from critics. The National’s seventh studio album Sleep Well Beast was released on September 8th 2017 to critical acclaim. Sleep Well Beast won “Best Alternative Album” at the 2018 Grammy Awards and “Best Rock Album” at the 2018 British Phonographic Industry Awards among numerous other accolades.\n\nThroughout their career, The National has been nominated for various awards; they won an Academy Award for Best Original Song for “I Need My Girl” from the soundtrack for All is Lost in 2013, a Grammy Award for Best Alternative Music Album for Trouble Will Find Me in 2014, and a Golden Globe Award for Best Original Song also for “I Need My Girl”.\n\nArcade Fire\n\nArcade Fire is a Canadian indie rock band that was formed in 2001. The band consists of Win Butler, Régine Chassagne, Richard Reed Parry, Tim Kingsbury,Will Butler, and Jeremy Gara. The band’s debut album, Funeral, was released in 2004 and was nominated for the Juno Award for Album of the Year.\n\nAbout the band\n\nArcade Fire is a Canadian indie rock band, consisting of husband and wife Win Butler and Régine Chassagne, along with Win’s younger brother William Butler, Richard Reed Parry, Tim Kingsbury and Jeremy Gara. The band’s eponymous debut album was released in March 2004 to critical acclaim and commercial success, winning the Juno Award for Alternative Album of the Year. Their second studio album, Neon Bible, was released in March 2007 and topped the charts in the United Kingdom. In 2010, Arcade Fire released their third studio album, The Suburbs, which received great reviews and won both the 2011 Grammy Award for Album of the Year and 2011 Juno Award for Album of the Year.\n\nTheir sound\n\nArcade Fire is an indie rock band that was formed in Montreal, Quebec in 2001. The band consists of Win Butler, Régine Chassagne, Richard Reed Parry, Tim Kingsbury, Will Butler, and Jeremy Gara. The band’s sound has been described as a mix of indie rock, baroque pop, art rock, and post-punk.\n\nArcade Fire’s debut album, Funeral, was released in 2004 and received widespread critical acclaim. The album won the 2005 Polaris Music Prize and was nominated for the Grammy Award for Best Alternative Music Album. The band’s second album, Neon Bible, was released in 2007 and also received critical acclaim. The album was nominated for the Grammy Award for Best Alternative Music Album.\n\nThe band’s third album, The Suburbs, was released in 2010 and received even more critical acclaim than their previous two albums. The album won the 2011 Grammy Award for Album of the Year and the 2011 Juno Award for Album of the Year.\n\nThe band’s fourth album, Reflektor, was released in 2013 and once again received critical acclaim. The album was nominated for the Grammy Award for Best Alternative Music Album.\n\nArcade Fire is one of the most successful indie rock bands of all time and their sound is definitely unique. If you’re looking for something new to listen to, definitely check them out!\n\nNotable songs\n\n“Arcade Fire” is an indie rock band that was formed in Quebec, Canada in 2001. The band’s current lineup consists of Win Butler, Régine Chassagne, Richard Reed Parry, Tim Kingsbury, Will Butler, and Jeremy Gara. The band is known for their anthemic sound and energetic live shows.\n\nArcade Fire’s debut album, “Funeral”, was released in 2004 and was met with critical acclaim. The album features the singles “Neighborhood #1 (Tunnels)”, “Neighborhood #2 (Laika)”, and “Rebellion (Lies)”. “Funeral” is considered to be one of the best indie rock albums of all time.\n\nThe band’s second album, “Neon Bible”, was released in 2007 and was also met with critical acclaim. The album features the singles “Keep the Car Running” and “Intervention”.\n\nArcade Fire’s third album, “The Suburbs”, was released in 2010 and won the Grammy Award for Album of the Year. The album features the singles “Ready to Start”, “We Used to Wait”, and “Sprawl II (Mountains Beyond Mountains)”.\n\nArcade Fire’s fourth album, “Reflektor”, was released in 2013 and was met with mixed reviews. The album features the singles “Reflektor” and “Afterlife”.\n\nGrizzly Bear\n\nAbout the band\n\nGrizzly Bear is an American indie rock band from Brooklyn, New York, formed in 2002. The band consists of Edward Droste (vocals, guitar), Daniel Rossen (vocals, guitar, keyboards), Chris Taylor (bass, backing vocals), and Christopher Bear (drums, backing vocals). Their sound has been categorized as psychedelic pop, folk rock, and experimental.\n\nTheir sound\n\nGrizzly Bear’s sound has been described as ” downtempo “, ” ethereal “, and ” warm “, with influences including Brian Wilson, Neil Young, and the Beach Boys. In an interview with Glide , Droste said that the band’s song “Ready, Able” was written in the key of C major .\n\nIn March 2006, AllMusic wrote that Grizzly Bear’s “[…] overall sound is pastoral and downcast but also beautifully crafted”. The website later said that the band’s sound on Yellow House was “[…] slightly more accessible [/i] than on their debut”. The A.V. Club said that on […] Veckatimest [/i] , Grizzly Bear “[…] fill every inch of sonic space with fragile melodies and gorgeous waves of noise”.\n\nNotable songs\n\n“Ready Ain’t Gonna Happen”\n\n“Heaven”\n\n“While I’m Alive”\n\n“What’s Wrong”\n\n“Will Put A Smile On Your Face”\n\nGrizzly Bear is an American indie rock band from Brooklyn, New York, formed in 2002. The band consists of Ed Droste (vocals, guitar, keyboards), Daniel Rossen (vocals, guitar, banjo), Christopher Bear (drums, vocals) and Chris Taylor (bass, backing vocals). Their sound has been categorized as psychedelic pop, folk rock, and experimental..\n\nBroken Social Scene\n\nAbout the band\n\n“Broken Social Scene is an indie rock band, formed in 1999 in Toronto. The band currently consists of Kevin Drew and Brendan Canning, both of whom are also members of BSS founding member Charles Spearin’s side project, The Happiness Project. The rest of the current live lineup consists of frequent collaborators Lisa Lobsinger, Justin Peroff, Sam Goldberg, Andy Kim and Ariel Engle. Broken Social Scene’s sound combines often disparate musical elements (post-rock experimentalism, noise pop, electronica) into complex pop songs.”\n\n-Wikipedia\n\nTheir sound\n\nBroken Social Scene is a Canadian rock band, formed in 1999. The band currently consists of Kevin Drew and Brendan Canning. The band’s sound combines indie rock, alternative rock, and electronica. They have released five studio albums: Feel Good Lost, You Forgot It in People, Bee Hives, Broken Social Scene, and Forgiveness Rock Record.\n\nThe band’s 2003 album You Forgot It in People was nominated for the Juno Award for Album of the Year. In 2010, they were nominated for two Grammy Awards: Best Alternative Music Album for their self-titled album and Best Rock Performance by a Duo or Group with Vocals for “Forced to Love”. Both nominations were lost to Arcade Fire’s The Suburbs.\n\nNotable songs\n\nBroken Social Scene is a Canadian indie rock band, formed in 1999. They are noted for their unique sound, which draws from many genres including rock, electronic, and hip hop. The band has released six studio albums, the most recent of which, Hug of Thunder, was released in 2017.\n\nNotable songs by Broken Social Scene include “Anthems for a Seventeen Year Old Girl”, “Cause = Time”, “7/4 (Shoreline)”, and “Stars and Sons”."}, {"url": "https://hellomusictheory.com/learn/famous-indie-rock-bands/", "page_content": "By Laura Macmillan\n\nIndie rock isn’t just a genre—it’s a movement within the music industry. Indie is short for “independent,” referring to small, autonomous record labels.\n\nWhile pop bands’ idea of success was to sign with famous record labels to become as popular and rich as possible, counterculture movements like punk rock valued autonomy over popularity.\n\nIndie rock originated during the late ’70s as a haven for alternative rock and punk artists to record music with underground, independent record labels, and some have been quite successful.\n\nThus in this post, we’ll go over 13 of the greatest and most famous indie rock bands to hit the airwaves. Read on!\n\n1. R.E.M.\n\nOne of the pioneers of the Indie rock movement and one of the most decorated indie bands in history is R.E.M. The group formed in 1980 and consisted of Michael Stipe, Peter Buck, Bill Berry, and Mike Mills.\n\nStipe’s complex and intellectual lyrics paired with the band’s industrial post-punk sound were an instant hit for the underground music scene. R.E.M. broke through to the mainstream with the song “The One I Love” in 1987.\n\nTheir early ’90s albums Out of Time and Automatic for the People reached the top of Billboard charts in America and Europe and garnered various Grammy awards and nominations. As a result, they have been inducted into the Rock and Roll Hall of Fame.\n\n2. The Smiths\n\nIn the UK, it was rock band The Smiths who spearheaded the independent rock movement, which has garnered them a huge following.\n\nThe Smiths originated from Manchester in 1982 with its primary band members Morrissey as a singer, Johnny Marr on guitar, Andy Rourke on bass, and Mike Joyce on the drums.\n\nDuring their short five-year lifespan, The Smiths recorded three albums that were all wildly popular and controversial. Their live performances garnered spots on UK Billboard charts with songs like “Reel Around the Fountain,” “The Charming Man,” and “What Difference Does It Make.”\n\nThey didn’t record an album until the 1984 release of their self-titled debut album. Their 3rd album, The Queen Is Dead was popular enough to draw a major indie following in the US.\n\n3. Pixies\n\nFrom Boston, Massachusetts, the Pixies started in 1986 as a collaboration between lead guitarist Joey Santiago and singer-songwriter Black Francis during their college years in Amherst. Soon after, they recruited Kim Deal on the bass and David Lovering on drums.\n\nTheir debut album was Come on Pilgrim in 1987, followed in quick succession by Surfer Rosa (1988), Doolittle (1989), Bossa Nova (1990), and Trompe le Monde (1991). Surfer Rosa and Dolittle achieved Gold and Platinum status.\n\nTheir sound incorporates punk and surf rock as melodic influences, while Francis’ lyrics take inspiration from his strict Christian upbringing.\n\nSome of their songs, “Here Comes Your Man” and “Where Is My Mind,” have been featured in major Hollywood films like Fight Club and 500 Days of Summer.\n\n4. The White Stripes\n\nModern blues garage-rock duo White Stripes is comprised of singer and guitarist Jack White and his ex-wife and drummer Meg White. The two married and began jamming informally during the late ’90s, performing live for the first time in 1997.\n\nThey released their eponymous debut album in 1999, which would be the first of six albums released between 1999 and 2007. The most popular were White Blood Cells, featuring the song “We’re Going to Be Friends,” and Elephant, containing the hit “Seven Nation Army.”\n\nBoth albums received widespread praise both during their release and years later, and both are on Rolling Stone’s Greatest Albums of All Time list.\n\n5. Sonic Youth\n\nFounded in New York City in 1981, Sonic Youth is both a pioneering indie rock band and a pioneering band for the experimental rock and noise rock genres.\n\nOver their 30-year run, they garnered a wide following, but have never been a mainstream band due to the noisy and distorted nature of their music. Still, they have influenced some of the greatest mainstream bands of the ’80s, ’90s, and 2000s.\n\nMany of their songs and albums have made it on US Billboard charts and have had songs, like “Kool Thing,” feature as the theme song for the video game Guitar Hero.\n\n6. Radiohead\n\nConsisting of Thom Yorke, Jonny Greenwood, Colin Greenwood, Ed O’Brien, and Phillip Selway, experimental English rock band Radiohead formed the band in 1985.\n\nStarting with Pablo Honey in 1993, Radiohead has released 9 albums. The single “Creep,” featured in their debut album, became their greatest hit.\n\nFor their work, Radiohead has received 20 Grammy nominations and 42 awards from global music organizations. Rolling Stone magazine has called them one of the greatest rock bands of all time, and in 2019, they were inducted into the Rock and Roll Hall of Fame.\n\n7. The Strokes\n\nOriginating in New York City in 1998, The Strokes is an alternative rock band comprised of Julian Casablancas, Nikolai Fraiture, Fabrizio Moretti, Nick Valensi, and Albert Hammond.\n\nThe band became a regular installment in the NYC underground rock club circuit during the late ’90s, perfecting their 14-song set they’d soon release on their debut album, Is This It, in 2001.\n\nThey recorded six albums total, but none of them reached the level of fandom as Is This It, which won a Grammy for Best International Album. It was also Album of the Year in 2002 for many global music publications and the envy and inspiration of most indie bands during that decade.\n\n8. Spoon\n\nIn 1993, a post-punk, experimental rock band named Spoon formed in Austin, Texas. Their founding members, Britt Daniel and Jim Eno, who’re multi-instrument musicians, had left their previous band to collaborate.\n\nSpoon has released ten albums, all through independent record labels. Their breakthrough to nationwide popularity came during the first decade of 2000 with the Girls Can Tell and Kill the Moonlight.\n\nThe song “The Way We Get By” was featured in the hit indie film Stranger than Fiction with Will Farrell, Emma Thompson, and Maggie Gyllenhaal. After the movie’s debut, Spoon played a slew of nationally televised late-night talk shows.\n\n9. The Shins\n\nAs a side project, singer James Mercer formed The Shins in 1996. Mercer was already in a hit band and created The Shins with fellow bandmate and drummer Jesse Sandoval.\n\nTheir third album, Wincing the Night Away (2007), became a commercial success and was nominated for a Best Alternative Music Album Grammy. Soon after, their song “New Slang” was featured in the indie film Garden State.\n\nThey were well on the road to fame when Mercer decided to sign onto a major label, dropping other band members. As the founder, Mercer has been the only continuous member and continues to record and tour with a different lineup.\n\n10. Belle and Sebastian\n\nScottish folk rock band Belle and Sebastian formed in 1994 when Stuart Murdoch and Stuart David were music students. They recorded their first songs with their music professor Alan Rankine.\n\nThey recorded their first album, Tigermilk, in 1996 along with a hit single, “Legal Man,” which became an instant hit in the UK. Their retro pop-rock music quickly became popular with US audiences, starting in 2000 when the band was mentioned in the movie High Fidelity.\n\nSince High Fidelity, their songs have been featured in other films, like 500 Days of Summer and Juno, to name a few. They’ve garnered more popularity with critics than with fans.\n\n11. LCD Soundsystem\n\nOriginating in Brooklyn in 2002, LCD Soundsystem is the epitome of indie revival and the pioneers of Brooklyn’s hipster culture.\n\nNot only is founder James Murphy, a lead songwriter in LCD Soundsystem, but he’s also an independent record producer. His label, DFA Records, released the band’s singles and hit albums from 2002 through 2010.\n\nTheir music is a mix of electronic rock and dance-punk. Its many members utilizes multiple synthesizers, keyboards, and percussions in addition to standard drums, guitar, and bass.\n\nTheir 2005 single “Daft Punk Is Playing at My House” received a Grammy nomination for the Best Electronic/Dance Album, and their 2008 song “Tonight” won a Grammy for Best Dance Recording.\n\n12. Modest Mouse\n\nFounders Isaac Brock, drummer Jeremiah Green, and Eric Judy created indie and emo rock band Modest Mouse in 1993.\n\nThey were popular in the Seattle area until the release of their fourth album, Good News for People Who Love Bad News, in 2004, which garnered national acclaim for the song “Float On” and “Ocean Breathes Salty.”\n\nJudy left the band in 2012, and there have been multiple rotating band members that have accompanied Green and Brock, including the former guitarist and founder of The Smiths, Jonny Marr.\n\n13. MGMT\n\nAndrew VanWyngarden and Ben Goldwasser are the duo behind MGMT, is an electronic pop and psychedelic rock group formed in 2002.\n\nThe two members started experimenting with sounds and sharing musical musing during their time as students. They released their first single in 2005, called “Time to Pretend,” followed by “Kids.”\n\nBoth singles eventually became part of their full album Oracular Spectacular, which they released in 2007. This album gained widespread acclaim, garnering various Grammy and Brit Award nominations. It was also named by Rolling Stone one of the top 500 albums of all time.\n\nSumming Up Our List Of Popular Indie Rock Bands\n\nFrom the start, indie rock bands have spanned the rock and roll subgenres, often inventing their own style and treasured legacy.\n\nWhile there are countless indie rock bands, the above list names the most well-known and influential of the lot. These bands have created sounds so unique that they’ve cemented themselves high on music charts.\n\nFor this, they will never be forgotten, and their songs and albums will be enjoyed for many generations to come."}, {"url": "https://simple.wikipedia.org/wiki/Indie_rock", "page_content": "Indie rock is a subgenre of alternative rock music which originated in the United Kingdom and North America in the early 1980s. Initially a form of independent music, it was based on small labels with low budgets which produced lo-fi rock records. Indie rock, as a genre, is very diverse; indie rock has several subgenres, and each vary greatly in style. Nevertheless, indie rock distinguishes itself from indie pop as it is generally rougher and more hard-edged.\n\nIndie rock and alternative rock are often used interchangeably.[1] Nevertheless, there are some differences between the genres. Initially, the term \"indie\" was used for British-based music, whilst \"alternative\" for American.[1] In 1986, British magazine NME released a cassette, C86, which defined much of the sound of what is today regarded as \"indie\" music,[1] notably the usage of jangly guitar sounds, retro elements borrowing from 1960s rock bands, and a DIY, amateur-like sound.[1]\n\nAccording to About.com, the term indie has two different general meanings in the UK and North America. In the UK, \"indie\" is a term used to describe \"melancholy\" and \"non-rock\" ballad-based music;[1] in North America, on the other hand, \"indie\" is often used to refer to retro-sounding, \"twee\" and \"Anglophilic\" music.[1]\n\nToday, indie rock has been able to find some commercial success. Popular indie rock acts and artists include R.E.M., Pavement, Regina Spektor and Superchunk, to name a few.\n\nAdditionally, indie rock has fused to create several new genres and subgenres. Indietronica, or indie electronic music, is a genre which fuses elements of indie rock, pop and electronic music, and often makes usage of synthesizers and drum machines. Alternative dance music, or indie dance, is also a genre which fuses elements of electronic dance music, alternative rock, indie rock and new wave, usually incorporating elements of the rock genres and using them in a dance-based context."}, {"url": "https://theconversation.com/explainer-indie-music-28321", "page_content": "Today, indie-rock, indie-folk, indie-dance, indie-hip-hop and even indie-classical are common terms used to describe the sonically discernible offshoots of an evolving genre once referred to as “indie”.\n\nThe term derives from “independent” – which is to say a record label operating independently from commercial, mainstream record companies. Such independent record labels existed long before the iconic labels of UK post-punk era music, such as Rough Trade and Creation.\n\nSam Phillips’ Sun Records and Berry Gordy’s Motown were independent labels in the 1950s and 60s; these auteurist founders often took on A&R, managerial, engineering and production duties as well as overseeing the manufacturing and distribution processes.\n\nBut Sun Records’ country and blues (Johnny Cash, B.B. King) and Motown’s soul canon (Smokey Robinson, The Jackson 5) were never described as indie. And that’s because, aesthetically, indie music has evolved to mean more than simply an association to an independent record label.\n\nDavid Taverne\n\nIndie as a defined musical genre descriptor emerged from post-punk, new wave and “alternative” music released on late-1970s UK independent labels.\n\nTony Wilson’s Factory Records, Daniel Miller’s Mute, Chris Parry’s Fiction and, perhaps most famously, Geoff Travis’s Rough Trade were all founded in 1978. From the beginning, indie’s musical aesthetics were hard to pin down; the dark, heavy, rhythm-centric intensity of Joy Division’s Unknown Pleasures (Factory, 1979) was a musical world away from the synth-laden, upbeat electro-pop served up on Depeche Mode’s debut album Speak & Spell (Mute, 1981).\n\nbrett jordan\n\nBy the mid-1980s, Manchester band The Smiths (Rough Trade) came to exemplify indie both musically and culturally. Together, lead singer Morrissey’s observational, experiential and socio-political lyrics delivered in dead-pan, poetic monologues over Johnny Marr’s jangly, multi-textured, often tremolo and reverb-soaked guitar were an authentic, culturally-resonant antidote to superficial, major-label manufactured pop.\n\nThe Smiths’ albums Meat is Murder (Rough Trade, 1984) and The Queen is Dead (Rough Trade, 1986) are quintessentially indie records – benchmarks in sound, style and wider socio-cultural significance.\n\nDespite much dance, electronica, metal and country musics released on independent labels from the 1980s onwards, indie has come to evoke non-commercially driven, song-led and guitar-oriented music embracing DIY aesthetics. It’s texturally lighter than classic rock, often featuring earnest, emotive and realist – borderline pessimist – lyrics with strong socio-political and arts references.\n\nIndependent music recordists have also played a key role in constructing the sonically identifiable character of indie music. Record producer John Leckie (The Fall, The Stone Roses), Southern Records’ late founder John Loder (The Jesus and Mary Chain, PJ Harvey) and stateside recording engineer Steve Albini (Pixies, Throwing Muses) are three whose maverick recording methods shaped indie as a distinct musical contrast to constructed, polished mainstream pop.\n\nWarp Films/EPA\n\nLabels and genre\n\nIndependent record labels are barometers of musical authenticity because artists tend to retain more creative control over their musical and aesthetic direction than if signed to a major label. Subsequently, independent labels are historically and aesthetically aligned to niche genre, as the earlier examples of Sun and Motown illustrate.\n\nThe Jerry Dammers-founded 2-Tone label (The Specials, The Selecter, The Beat, Madness) was an essential disseminator of early 1980s ska-punk fusion. Independent US labels Def Jam (Run DMC, LL Cool J), Tommy Boy (De La Soul, Coolio) and Death Row (Dr Dre, Snoop Dogg) were synonymous with the “golden age” of 1980s and 1990s hip-hop.\n\nStig Nygaard\n\nFounded in 1986 by Bruce Pavitt and Jonathan Poneman in Seattle, Sub Pop (Sonic Youth, Mudhoney, Soundgarden) pioneered a heavier brand of US alternative indie. The label became synonymous with grunge music, largely due to the raw, distortion-laden sound of its most famous signing, Nirvana.\n\nRelationship with commercial mainstream\n\nSteve C Mitchell/EPA\n\nThe ways in which indie artists negotiate the commercial mainstream, while simultaneously retaining their authenticity, are as varied as they are challenging.\n\nUS band REM created a strong indie foundation – five albums released on the I.R.S. label between 1983-1987 – before signing a multi-million dollar deal with Warners in 1988. Nirvana managed a successful move from Sub Pop to DGC (Geffen/ Universal) in 1990 – an example of a band moving to a seemingly independent label that in reality was a major label subsidiary.\n\nMajor labels recognise independent “authenticity” as currency and as such, often “pass off” their major signings as independent. In the early 1990s, UK indie band Ned’s Atomic Dustbin released three albums to global critical acclaim on Furtive, an independent label created for the band by Sony.\n\nDaniel Hambury/EPA\n\nIndie music reached a commercial peak in the mid-1990s, culminating in Britpop, a form of guitar-led indie-pop/rock songwriting referencing class politics and culture, delivered in strong, regional British accents.\n\nBlur (Food), Pulp (Island) and, particularly, Oasis (Creation), transcended their independent roots and achieved global success on an unprecedented scale. Oasis alone sold more than 70 million albums. Post-Britpop, major labels viewed indie as viable music for the commercial mainstream.\n\nInto the 2000s, Parlophone (EMI) signings Radiohead and Coldplay maintained a degree of independent “credibility”, despite the stadium tours, global distribution and chart successes usually ascribed to commercial pop artists.\n\nIndie today\n\nIn recent times, indie culture has been criticised as homogenised, snobby and decidedly lacking in the strong socio-political messages it was once renowned for. Musically, what used to be termed indie is now a multitude of subgenres.\n\nIn 2012, Pitchfork identified “indie-classical” as a subgenre, recognising a new movement of contemporary musicians, such as Jonny Greenwood (Radiohead) and Andrew W.K. shifting into experimental, classical performance and composition.\n\nFacundo Arrizabalaga/EPA\n\nThe stripped-back, lo-fi production aesthetics and traditional song form heard in the music of Fleet Foxes (Sub Pop) and Bon Iver (4AD) exemplify current, indie-folk subgenre. Today, indie music is most relevant when performed to festival crowds.\n\nWith their unique brand of art-indie, Montreal-based Arcade Fire (Merge) have played to global audiences in the hundreds of thousands. Abrasive, northern UK indie-rock band, Arctic Monkeys (Domino) are another example of an independent band to have won over festival scenes with their frantic, raw performances.\n\nToday, indie does not simply mean independently released music, nor does it describe any single genre of music. It’s an all-encompassing terminology that describes general resistance to popular and mainstream culture, evoking realism, independence and authenticity.\n\n\n\n\n\n\n\nSuggested further reading:\n\nRip it up and Start Again: Post Punk 1978-1984, by Simon Reynolds. Faber & Faber.\n\nMurmur by J. Niimi [REM]. Bloomsbury Academic.\n\nThe Stone Roses and the Resurrection of British Pop, by John Robb. Random House.\n\nMy Magpie Eyes are Hungry for the Prize: The Creation Records Story, by David Cavanagh. Virgin Books.\n\nMaking Overtures – The Emergence of Indie Classical, by Jayson Greene. Pitchfork.\n\nSuggested further listening:"}, {"url": "https://www.gemtracks.com/guides/view.php?title=indie-music-characteristics&id=550", "page_content": "What is Indie Music and its Characteristics in 2023?\n\nWhat does indie music sounds like? Find out the characteristics that make indie music what they are and see if your music has these qualities.\n\nNEW!! Imagine being a recording artist. For a cheap $149, buy one-off beats by top producers to use in your songs. Gemtracks is a marketplace for original beats and instrumental backing tracks you can use for your own songs. Choose a Genre Hip Hop Pop EDM Rock Country Jazz\n\nAlready making good music? Submit to Playlists\n\nThe term indie music is a bit like the term pop music, it encompasses a wide range of influences and even genres, it has meant different things at different times, and there is little agreement on what it actually means, and which bands/artists fall under that category. However, a generally agreed upon classification is that indie music is music that has been produced outside of commercial record labels, music that has a DIY approach to both recording and publishing.\n\nThat description, indie as an economic model of producing your own music, or producing music with an independent label, is one way to look at it. But Indie music is also sometimes used as a genre description, a way to describe a certain sound. And it's true, some artists and bands are considered 'indie' and do record and produce their music within a commercial record label. Similarly, many DIY 'indie' bands produce music outside of the record industry but who fall into various other genres, and would not easily identify themselves with the term 'indie'. This has led many to question whether the use of 'indie' as a term to describe a style of music has any real meaning.\n\nIndie vs. Alternative\n\nThere is a lot of confusion about the difference between the alternative and indie genres. The history of the two terms intertwines. Alternative first pops up in the 1980s to describe rock music that was simply considered outside of the mainstream. At the time popular rock bands were power metal, glam metal, and classic style rock. They were technical and very polished. But many underground artists were still playing rock and certainly did not fit any of those categories.\n\nThe term indie is similar. Indie first simply means bands that are not signed to one of the major labels and came from a variety of genres. The internet increased the awareness of many of these bands as it became easier to share music. Many bands that were once considered indie would end up signing with major labels, such as The Strokes and Modest Mouse.\n\nAlternative rock and indie rock have gradually merged with each other because of their extensive overlap. Many indie rock bands are simultaneously categorized as alternative rock, and many alternative rock bands are simultaneously categorized as indie bands. This has led to an oxymoronic situation in which you have many indie artists recording on major labels, and many alternative artists recording on independent labels. But the reason for this confusion has to do with the common threads that have existed between artists of both genres throughout the years.\n\nAt the end of the day, it really doesn't make a difference what you call these bands. Whether you consider them indie or alternative are merely semantic differences that have no clear solution. The power of the music produced by these artists extends far beyond what these mere labels describe.\n\nStill, the indie genres has a fascinating history. So let's take a look at some of indie music's characteristics, and the huge variety of subgenres of indie music that have existed throughout the years.\n\nRead our article on Pop Music Genres and Characteristics.\n\nIndie Rock\n\nDescribing a very diverse range of subgenres, as we said above, indie rock does not describe a definitive musical entity. However, a few things do tend to typify indie rock bands. One of the more important things is that indie rock artists tend to reject the swagger typified by traditional rock bands. The use of the term 'indie' to describe bands that did not record on the major commercial labels fell out of fashion in the 80s. Instead, indie began to refer to a style of music usually related to punk or post-punk.\n\nThe 90s saw grunge, punk-revival, and Britpop bands go mainstream, but many of these bands were able to maintain their 'indie' status. For example, Sub Pop Records enjoyed mainstream success in the early 1990s with the rise of the grunge genre, which they were instrumental in promoting. But in 1995 they sold to Warner Music Group.\n\nLo-fi, emo, noise pop, slowcore, math-rock, and post-rock are all considered indie genres. The 2000s saw the impact of the internet on music consumption and distribution, and new waves of indie bands began to achieve success, some of them signing to major labels, others continued with independent labels. Many of these bands played a kind of back-to-basics guitar rock, like The Strokes and The White Stripes.\n\nEmo\n\nBoth Weezer and Jawbreaker would release foundational emo albums in 1994 (24 Hour Revenge Therapy, and Weezer respectively). But the emo genre traces its roots back to 1984 and the post-hardcore band Rites of Spring which combined the hardcore punk music style with more varied rhythms and melodies, as well as lyrical content that would come to define the genre: personal, emotional, nostalgia-driven, romantically bitter and poetically desperate. Like many of these music subgenres, emo is more than just a music style, it also has an associated fashion and cultural element, including long bangs, skinny jeans, tight t-shirts, studded belts. Emo enjoyed mainstream success in the early 2000s with bands like My Chemical Romance and Fall Out Boy.\n\nNoise Pop\n\nWith its mix of feedback, dissonance, and pop music songcraft, noise pop experimented with distortion, drones, and white noise all while maintaining conventional pop music songwriting. The style has been described as hazy, narcotic, textured, angular and many regard the influential band The Velvet Underground as one of the earliest examples of the genre. It wasn't, however, until 1985's Psychocandy by the Scottish alt-rock band The Jesus and Mary Chain that the genre was properly born. Noise pop would lead directly to the development of the shoegazing movement which began to emerge in the late '80s.\n\nKeep reading on about The Stages of Custom Music Production & Its Benefits to gain a deeper understanding of the topic.\n\nPost-Punk Revival\n\nThis genre of indie rock began developing in the late 90s and early aughts. Inspired by a combination of different styles, primarily garage rock, new wave, and post-punk, several post-punk revival bands went mainstream in the early 2000s. Post-punk itself was a style of music developed in the late 1970s that saw a departure from the simplistic traditions of punk rock and infused the genre with avant-garde influences. Post-punk revival offered a return to that late-70s form ranging from the atonal music created by groups like Liars to the more melodic pop-inflected songs of The Sounds. Several bands saw mainstream success such as The Strokes, The Killers, Franz Ferdinand, and the Arctic Monkeys. The style declined in popularity by 2010, but many bands, such as Arcade Fire, were strongly influenced by the subgenre.\n\nIndie Pop\n\nLike indie rock, indie pop is related to rock music in general, particularly guitar pop. Indie pop generally exists in opposition to mainstream pop with its do-it-yourself ethic. Also like indie rock, indie pop traces its origin from post-punk. Melodies tend to play a more prominent role in indie pop when compared to indie rock, and they tend to be less abrasive, more positive, and relatively free of angst. Chamber pop, twee pop, dream pop, and the Japanese Shibuya-Kei style are all examples of this genre. Let's take a look at them.\n\nChamber Pop\n\nMelody, texture, and use of orchestral elements such as strings, horns, and piano, are all defining elements of chamber pop (sometimes called 'orchestral pop'). The Beach Boys' 1966 album Pet Sounds was a huge influence on the subgenre, as were the baroque pop bands of the 1960s. Like all of the indie bands on this list, chamber pop is stylistically and aesthetically diverse. But they all share a strong influence by pop musicians like Burt Bacharach, Scott Walker, Lee Hazlewood, and Brian Wilson. Chamber pop shares many parallel influences with the Japanese music movement known as Shibuya-Kei.\n\nTwee Pop\n\nWould you be interested in Music 101: What is Indie Music?\n\nThe origins of twee pop take us back to 1986, and to a cassette compilation put out by the British music magazine NME. Originally it was the term C86 that defined this kind of indie music. Twee pop is characterized by treble-heavy, undistorted guitars, with power-pop melodies and structures. Boy-girl harmonies, lyrics about love and relationships, and a perceived innocence also define its sound. Twee pop would evolve into the cuddlecore subgenre, which enjoyed brief success in the mid-90s\n\nDream Pop\n\nThis subgenre often overlaps with other indie genres, especially shoegaze, so much so that dream pop and shoegaze are often used interchangeably. The main thing that sets this genre apart from its peers is its atmosphere and heavy reliance on sonic textures, and the immersive experience offered to the listener. Again the music of Brian Wilson and other mid-60s/early-70s figures were the primary source of influence. Bands such as Cocteau Twins, A. R. Kane, Bat for Lashes, and My Bloody Valentine all count themselves among the genres best.\n\nUnderground Hip Hop\n\nSometimes refered to as 'indie hip-hop', underground hip-hop encompasses anything in hip-hop that is produced outside of the commercial record. It does have some characteristics that make it different from its more commercial cousin, and that includes lyrics that are generally more socially conscious and positive. Alt-hip hop and 'conscious' hip hop all have ties to underground hip-hop and emphasize that they do not conform to any of the traditional genres or stereotypes, and draw equally from funk, pop, rock, jazz, reggae, soul, and folk music.\n\nIndie Music Scenes\n\nIn addition to the different subgenres of indie music, there are also several localized 'indie music scenes'. Often a local music scene can play just as much of a role in music history and the developments of different genres as the music coming out of the big commercial labels.\n\nOther readers recommend reading about Arpeggiator and Its Uses next for more information.\n\nSome examples of prominent indie music scenes are:\n\nNo Wave - This was an avant-garde art scene that came out of late 70s New York City. It was a reaction against punk rock and its perceived recycling of clichés and influences from rock music. Musicians of the No Wave movement relied on experimentation with noise and dissonance, with atonality and abrasiveness, and with confrontation and a worldview drenched in nihilism. The movement embraced many different styles such as funk, jazz, blues, and punk rock. Perhaps the best-known band to emerge from this genre was Sonic Youth.\n\nMadchester - Developed in Manchester, U.K. in the late 80s, Madchester was an indie cultural scene. Not just a music scene, Madchester was closely associated with dance. 'Indie-raves' were presided over by music that merged acid house, psychedelia, 60s pop, and rave music. It was heavily influenced by the drug MDMA and was part of a broader social phenomenon of 1980s UK youth culture, sometimes called the Second Summer of Love. Madchester Bands would dominate the UK indie charts for much of the late 80s and early 90s. Some well-known groups to come out of the Madchester scene include The Stone Roses and 808 State.\n\nGrunge - This subculture, which was also sometimes referred to as 'Seattle sound', was a rock subculture that emerged in the mid-80s around the state of Washington. Fusing punk rock and heavy metal, Grunge incorporated angst-filled, introspective lyrics that addressed themes of social alienation, trauma, neglect, and self-doubt. Sub Pop Records was home to many of the brands associated with the grunge movement, and this independent label did much to market the genre before selling out to Warner Music Group in 1995. In the early 90s grunge was hugely popular throughout the English-speaking world, and made grunge the most popular form of rock music of its day. Nirvana, Pearl Jam, Soundgarden, and Alice in Chains were all bands that came out of that movement.\n\nConclusion\n\nAs we've seen, indie music is hardly one single thing. Not only does it have multiple, sometimes overlapping subgenres, but the genre of 'indie music' itself overlaps with other broader musical trends, like alternative rock, punk, pop, and hip-hop. No sooner can you point to an example of what indie music 'is', than you can point to several contradictory examples that hold up a different ethos. Regardless of the differences, indie music shares a rejection of commercial aspirations, and the trends of commercial genres.\n\nEXCLUSIVE: You may be interested in What is Sound Design and Its Use ? as well."}]}