{"Bill Brown left Celtic in 1967 and joined Partick Thistle, where he made over 100 appearances before retiring in 1970.": [{"url": "https://www.pressandjournal.co.uk/fp/past-times/3506694/partick-thistle-beat-celtic/", "page_content": "[[title]] [[text]] [[success]] Email address Sign up\n\nSam Leitch, the normally prescient BBC sports presenter, had no doubts about the outcome of the 1971 Scottish League Cup final.\n\nIn the one corner were Celtic, masterfully managed by Jock Stein, whose Lisbon Lions, captained by Billy McNeill, had famously triumphed in the European Cup in 1967 and reached the final of the same competition in 1970.\n\nIn the other were Partick Thistle, a team with a reputation as perennial bridesmaids – if they even received an invitation to the wedding – in the Glasgow goldfish bowl.\n\nOn the eve of the combatants’ climactic meeting at Hampden in October 50 years ago, Leitch dismissively told his audience that the Maryhill Magyars had “no chance”.\n\nYet, in what turned into one of the most extraordinary occasions in the history of Scottish football, Thistle didn’t merely create a sack-load of opportunities, but scored no less than four times in the opening 37 minutes as all their dreams came true.\n\nThe cup was a true test of stamina in those days. Davie McParland’s Thistle squad, which featured a clutch of youngsters, including Alan Rough, John Hansen (brother of the more famous Alan), Ronnie Glavin and Denis McQuade, disposed of Arbroath, Raith Rovers, East Fife and Alloa, en route to the last eight.\n\nBut they were beaten 2-0 in the first leg of their quarter-final tussle with St Johnstone and an uphill battle loomed.\n\nThe Old Firm had bigger fish to fry than worrying about dear old Thistle.” Alan Rough\n\nUndaunted, when the clubs met again a week later, Partick secured an emphatic 5-1 win in Glasgow and that outcome provided the momentum for them to defeat Falkirk – who had previously prevailed against Aberdeen, Dundee and Hibs – and progress to the final for the fourth time.\n\nIn the earlier contests, they had suffered reverses against East Fife, Celtic and Hearts, and there was no huge confidence they could halt that sorry trend against Stein’s all-conquering squad, who were in the midst of their nine-in-a-row championship charge.\n\nYet there was no pressure on them, either. And they were determined to prove they could make a name for themselves in the spotlight and in front of the TV cameras.\n\nAlan Rough, who later represented Scotland at three World Cups, spent the morning of the match in charge of his Boys’ Brigade team – and the kids won their match 3-2.\n\nMeanwhile, at home, his mother Jean had ironed his kit in readiness for her son heading off to join the rest of the Partick players at Esquire House for a meal.\n\nHe made the journey via the No 11A bus at Knightswood and found himself surrounded by Celtic fans who were discussing how many goals their heroes would amass.\n\nAs he recalled: “I was sitting in the top deck and none of the folk in green and white had a clue who I was, but the general tone of their conversation was ‘We’ll murder this lot’ and ‘How the hell did Partick Thistle get this far, anyway?’\n\n“I remember a couple of their more middle-aged supporters asking me: ‘Well, son, are you going to Hampden to watch the Bhoys collect another trophy?’\n\n“I just smiled, mentioned that I had to meet my family for a meal, and hoped they enjoyed a pleasant afternoon.\n\n“It definitely wasn’t the time or place to be shooting my mouth off. But this was the response we had grown used to at Firhill: the Old Firm had bigger fish to fry than worrying about dear old Thistle.\n\n“In a way, that was a good thing and I was pretty relaxed before the kick-off.\n\n“Bear in mind I was just 19, we were massive underdogs, and nobody – not even our own fans – were giving us a prayer. So we could go out and express ourselves with no fear.\n\n“The next couple of hours passed in a glorious whirl.”\n\nDavie McParland told his men it would be crucial to keep the elusive Jimmy Johnstone on a tight leash and Ronnie Glavin was assigned the thorny task of marking the diminutive, but often deadly, winger.\n\nBut he reminded his charges that Celtic were missing their talismanic skipper, McNeill, and that everybody, be it pundits, bookies or the press, had written off Thistle.\n\nRough said: “I don’t recall there was any anxiety among our guys. Instead, there was a shared feeling that these kind of high-profile matches don’t come along very often for a club like ours, so it was time we stepped up to the plate and did ourselves proud.”\n\nNobody could question they achieved that objective once the action commenced.\n\nWe knew they would come hard at us.” Alan Rough\n\nThere was a fizzing energy and effervescence about the Partick contingent from the outset. And a rather lethargic, stumbling display from Celtic by comparison.\n\nThe consequences were spectacular. First, Alex Rae confounded goalkeeper Evan Williams with a 20-yard lob for the opening goal in the 10th minute, then Bobby Lawrie, a pacy, dangerous performer, cut inside Davie Hay and doubled the lead.\n\nAlmost immediately thereafter, Johnstone was forced to leave the field with an ankle injury and Thistle pounced again when McQuade netted on the half-hour mark.\n\nAnd, if you listened to the crowd, it was as if Hampden was shrouded in disbelief; an atmosphere that heightened when Jimmy Bone added a fourth.\n\nThis was the stuff of fantasy for somebody such as Rough, who barely had to lift a finger at the other end of the pitch while his colleagues were wreaking havoc.\n\n‘I couldn’t believe what I was watching’\n\nHe said: “I could have been sitting in a deckchair, reading a paper, for all I had to do. When Rae grabbed his goal, I was like: ‘Hang on, we’ve scored’.\n\n“Then, I was splurting: ‘Jeez, there’s another one’ when it became 2-0 and I had to battle to keep my emotions in check, because it was unbelievable.\n\n“By the time it got to McQuade and Bone’s efforts, I was rubbing my eyes and saying over and over: ‘Oh my God, Oh my God, what on earth is happening here?\n\n“It was like nothing any of us had ever experienced before. It wasn’t all one-way traffic and Celtic carved out a couple of chances, but we were 4-0 in front and as we walked into the dressing room at the interval, I have never witnessed so many stunned expressions as we sat down and took a breather.”\n\nOkay, let’s get ready for the big backlash\n\nHe continued: “There was no singing or wild celebrations from us at the break. If anything, the mood was more bewilderment than anything else – had we really gone out there at the national stadium in a major final and stuck four past Celtic?\n\n“Most of us were inwardly aware that, given our reputation and the talent in their ranks, there was a risk we could still end up losing 6-4 or 7-4. But credit to Davie, he allowed us to collect our thoughts and catch our breaths and he was remarkably calm.\n\n“He told us very quietly: ‘You have done half the job, lads. I’m proud of you. Now, go out there and finish it’.\n\n“And that was it. We knew they would come hard at us. But we all felt we had enough resilience, ambition and guts to hold them at bay.”\n\nAs expected, Celtic made a better fist of things in the second half and rampaged forward menacingly.\n\nRough had to produce a couple of decent saves to thwart the elusive Kenny Dalglish, but this was nothing to rival the Siege of Mafeking.\n\nBy the hour mark, the news of the scoreline had spread around Glasgow and Rangers fans flocked from Govan to join the Hampden throng as the shockwaves reverberated.\n\nEventually, after 70 minutes, Dalglish broke Celtic’s duck, but it was the only time Rough was beaten and there were no further signs of a miraculous recovery.\n\nAs the perm-wearing goalie said: “Anybody who still clings to the idea that our victory was a fluke should face reality.\n\n“We were the better team on the day – and you might fluke one goal in any match, but not four.\n\n“So it’s doing a disservice to Partick to bang on about Celtic’s shortcomings and even their fans who stayed to the end applauded our performance.”\n\nIt was only later it emerged that a BBC sports announcer had refused to believe the interval score and informed viewers that the network would “check it out”.\n\nYet as the Thistle players marched up to collect the League Cup, they knew they had produced a stunning display that made a mockery of the pre-match forecasts.\n\nMcParland was effusive on the greatest afternoon of his life, but Stein was gracious as well and talked about the pride and passion he had seen in the Partick ranks.\n\nAnd, as he added: “In a cup final, it’s sometimes about who wants it more. They were on their game right from the first whistle. We weren’t. And they made us pay.”\n\nAs the Partick players and staff made their way towards their fans with the trophy, there was understandable euphoria at how they had created history.\n\nBut, as they hastily tried to organise an impromptu celebration, it soon became clear that nobody, not even the Firhill club’s own officials, had remotely considered the possibility they might actually beat the Stein machine.\n\nRough recalled: “In the circumstances, we were entitled to an open-top bus parade, but no one had thought to book such a vehicle, so we ended up commissioning a single-decker bus and attempted to clamber through the skylight.\n\n“Eventually, a few of us managed to clamber on to the top of the bus, but it was a wee bit embarrassing – we were driving along and people in the street were watching and wondering who the hell we were.\n\n“By then, we had realised that most of our supporters would still be in the pubs around Hampden.\n\n“And then, once we had arrived back at Firhill, we found the place was locked. So yes, there’s no doubt that it was all a bit chaotic.”\n\nThere were tangible benefits for Thistle from their Hampden heroics. For one thing, their youngsters had demonstrated their talents on the national stage and several of them never looked back from that giddy achievement.\n\nThey had also qualified for the 1972-73 Uefa Cup – the second year of the tournament’s existence – and met Honved of Hungary, who beat them 4-0 on aggregate.\n\nBut despite their transient stardom, Rough was among those who were in their element and he concluded: “We were a collection of ambitious youngsters, and none of us had appeared in a cup final before, so we weren’t intimidated by the opposition or the occasion because we nothing to measure it against.\n\n“And, in the next few years, quite a few of us, including myself, Ronnie Glavin, Jimmy Bone, Alex Forsyth and John Hansen went on to represent Scotland.\n\n“So it wasn’t as if we were a bunch of no-hopers. We were Partick Thistle.”\n\nPartick Thistle beat Celtic… then crash back to earth in Aberdeen\n\nThistle’s stars were, however briefly, in demand and the cocks of the walk. On the back of their Cup victory, they were invited on a pre-season tour to Malaysia and Indonesia.\n\nBut sadly, just a week after their giant-killing exploits, Partick ventured north to tackle Aberdeen at Pittodrie in the league.\n\nAnd they were thrashed 7-2!"}, {"url": "https://www.scottishdailyexpress.co.uk/sport/football/remembering-partick-thistles-historic-shock-25238049", "page_content": "Something went wrong, please try again later.\n\nInvalid email Something went wrong, please try again later.\n\nWant all the latest Scottish Sports news direct to your inbox? Share your email for the biggest headlines, transfer news and more\n\nIT remains the greatest cup final shock in Scottish football history - the incredible day that little Partick Thistle stunned the mighty Celtic in front of over 60,000 people at Hampden on October 23, 1971.\n\nNo-one gave the Maryhill men an earthly as they ran out at the national stadium including the BBC's Sam Leitch who introduced coverage of the match by saying Thistle had no chance.\n\nWithin 37 minutes they had rattled four goals into the Cetic net to utterly stun the football world - and all of those watching.\n\nCaptain Alex Rae fired a volley past Evan Williams, Bobby Lawrie placed a right foot shot into the right corner, Dennis McQuade scored from close range then Jimmy Bone walked in the fourth goal, completely unmarked.\n\nCeltic were at the peak of their powers under Jock Stein having won six successive league titles - en route to nine - having also won the 1967 European Cup and narrowly lost the 1970 final.\n\nThey would go on to reach the semi-finals that season where they agonisingly lost on penalties to Inter Milan, the side they had vanquished in Lisbon in '67.\n\nQuite simply, Celtic were not just the strongest side in Scotland they were one of the greatest in Europe.\n\nKenny Dalglish scored in the second half, but there was no way back for Celtic who were humiliated by electric Jags.\n\nSkipper Rae said: \"To try to explain to anyone on the planet what was going to happen was simply impossible.\n\n\"I remember the referee telling me there were only seconds to go and the feeling was incredible.\n\n\"As a boy growing up in Govan - and as a Rangers fan - it was a dream come true to go to Hampden and lift the League Cup. It was just superb.\n\n“I don’t suppose we did really understand the significance of the win. It’s surreal. It’s as simple as that. You just try and concentrate on the ball!\n\n“If you were a sensible person you would never have bet on us that day, you just wouldn’t. A couple of my pals put a bet on but surprisingly they only got odds of 4/1. But the bookies are rogues, aren’t they?\n\n“Celtic clearly took us for granted. Six of our players went on to get caps which says something about the level of ability in the team. On our day we played good football.\n\n“A lot of people say Celtic had the better chances in the second half but the first thing I remember was Dennis McQuade striking the ball from about 25 yards and it skimmed the crossbar. It was really a very competent performance – not necessarily all gung-ho and attacking, it was efficient defending too.”\n\nThe famous Thistle team that day - managed by Davie McParland - was:\n\nAlan Rough; John Hansen, Jackie Campbell, Hugh Strachan, Alex Forsyth; Ronnie Glavin, Alex Rae, Frank Coulston; Dennis McQuade, Jimmy Bone, Bobby Lawrie."}, {"url": "https://www.bbc.co.uk/sport/football/56935516", "page_content": "Partick Thistle hammered Falkirk 5-0 to clinch the League One title\n\nThe last 13 months have been among the most tumultuous in the 145-year history of Partick Thistle.\n\nThe Glasgow club wrapped up the Scottish League 1 title in style with a 5-0 thumping of Falkirk on Thursday and secured an immediate return to the second tier, from which they were relegated just over a year ago in controversial circumstances.\n\nArbitrations, statements, and rancour have been part of the deal for the Maryhill outfit, who were a top half Premiership side just four years ago.\n\nWith the help of defender Richard Foster, BBC Scotland takes a look back at how the title was won....\n\nA cruel demotion\n\nThe summer of 2020 was one of bitterness and fury in Scottish football. After heated debate, briefings, counter-briefings and the shambles of Dundee's missing vote, Thistle were consigned to relegation from the Championship on a points-per-game basis.\n\nGiven the Glasgow club were only two points behind Queen of the South at the bottom of the division with a game in hand when the season was halted in March, the decision caused uproar.\n\nThistle joined Hearts in legal action against the SPFL after enough clubs failed to support league reconstruction, seeking reinstatement into the second tier or £2m in compensation. The club was fighting for its very existence.\n\n\"I ask everyone associated with Thistle to never forget today,\" chairman Jacqui Low said after the case was lost. \"To never forget how it feels to be relegated unfairly.\n\n\"We have every right to be angry. So let's use that anger as the fuel that drives our campaign in 2020/21. Our fate and our success once again lies in our own hands and our hands only.\"\n\nSlow start in League 1\n\nWith the farrago off the pitch briefly subsiding, Thistle's bid to bounce back was in the hands of manager Ian McCall, who had returned for a second spell in September 2019 after a successful stint at Ayr United.\n\nA Thistle fan with experience of getting Ayr out of League 1 (twice), it seemed the perfect match. However, a slow start in which they won just four of their first 10 games put the manager and his squad under serious pressure.\n\nGoals were not flowing, and an injury crisis labelled by McCall as the worst he has ever seen in his two decades as a manager, all added up to the Maryhill club sitting in fifth, outside the play-offs and six points behind Falkirk.\n\n\"We just never took our chances,\" full-back Richard Foster tells BBC Scotland.\n\n\"The game that stands out is probably Dumbarton at home. We could've quite conceivably won 7-0, but we drew 0-0. It got to the point where we started losing goals as well. It wasn't a good combination.\"\n\nThe shutdown boost\n\nThen, came a second lockdown, with Leagues 1 and 2 put back into hibernation in January with no sign of when they would be able to return.\n\nAs one of only two established full-time teams in the third tier (along with Falkirk), Thistle were critical of the decision. Their players and staff were not even allowed to train, while part-time teams in the division above were allowed to continue.\n\nIt compounded the sense of injustice from their relegation as well as the subsequent distribution of Scottish government grants which saw part-time sides in the Championship receive £500,000, while Thistle got just £150,000 despite having greater costs.\n\n\"It was tough, strange,\" says Foster. \"I'm 20 years in the game and have never experienced that. The manager's even longer in the game and he was saying the same. Does he give us [individual] training? Running?\n\n\"We were meeting in pairs to try and do a bit together, but it's not the same. But in a strange way it almost galvanised us more. I know I realised how much I didn't want to retire because I was so happy to be back training.\"\n\nTitle tilt finally takes off\n\nThe shutdown may have complicated matters but, ultimately, when League 1 did return on 20 March, Thistle knew what they had to do. A shortened 22-game campaign meant they had 12 games to save their season.\n\nDrawing three of their first four was not the start they would have hoped for, and as they traipsed into the dressing room at Bayview trailing East Fife 2-0, their championship aspirations looked in tatters.\n\nBut Brian Graham headed in, and new loan signing Scott Tiffoney snatched a point in the final minute of stoppage time. At that stage Thistle sat seven points behind Falkirk with eight games left. Their task still looked daunting.\n\n\"The manager had a sense that that point was going to be a really big one,\" Foster explains.\n\n\"I think he tried to use that. There was a mindset shift to really knuckle down and make sure we go on a winning run. At that point there wasn't much pressure on us, because Falkirk were so far ahead.\"\n\nFrom that point, a run of five straight wins, in which they scored 13 goals and conceded none - coupled with Falkirk's collapse in form - propelled McCall's men to the summit.\n\nA subsequent draw with title rivals Cove Rangers put them in the driving seat before Falkirk's visit on Thursday, with Thistle delivering a magnificent performance to thrash their faltering visitors 5-0 and clinch the crown.\n\nBefore that game, Tiffoney had taken his tally to nine goals and three assists in 12 appearances, and Graham and Zak Rudden added 13 goals between them during the unbeaten run of 10 games since the restart.\n\nThe experience of Foster and 36-year-old Steven Bell, another loan signing from East Kilbride, helped ensure a miserly defence.\n\n\"For me, the one was Rudden,\" says Foster. \"He has a lot of talent and ability and he works hard but things just weren't going well for him. Then he scored two in a game and the touchpaper was lit. He took off from there.\"\n\nThe thumping of Falkirk was the icing of the cake, a perfect performance in which they looked every inch a top-end Championship team. It's the division they will be playing next season, the one which they feel they should never have left.\n\nSPFL chief executive Neil Doncaster called Thistle \"worthy champions\" but the club left all their talking to the pitch."}, {"url": "https://marcjwallace.medium.com/history-made-the-story-of-partick-thistles-long-road-to-scottish-cup-glory-3de6a2ae4df8", "page_content": "History Made — The Story of Partick Thistle’s long road to Scottish Cup Glory. Marc Wallace · Follow · Apr 17, 2021 8 min read -- Listen Share\n\nIt is impossible as a Partick Thistle fan not to think of the time we stunned Jock Stein’s famed Celtic, even though it happened long before I was born.\n\nWhether it’s tales from the older boys in the pub who were there or wishing that you could have gone yourself when watching the highlights on YouTube, the pride is still there, even as we approach the half-century of what remains Celtic’s record League Cup final defeat.\n\nThistle stunned the nation in 1971 when we obliterated Celtic 4–1 in the League Cup Final.\n\nHowever, fifty years before that and sadly losing its battle with the sands of time is the only time (to date) we have won the Scottish Cup.\n\nThe list of sides who have gone on to win it for the first time since in the fast-approaching 100 years makes even the most ardent Jags fan wince, but the story of that remarkable victory needs telling a new audience.\n\nThere were 11 games played from the second round to the final, beginning with a visit to Easter Road to face Hibs on February 5th, 1921.\n\nAnd they had Kenny Campbell in goal to thank as an inspired performance kept The Hibees at bay, as we held on for a goalless draw.\n\nThat meant a replay three days later at Firhill, and this time Hibs were grateful for their goalkeeper Bill Harper for preventing them from exiting the cup.\n\nThis second goalless draw was Thistle’s fifth in succession, having not scored in any competition since a 2–0 victory over St. Mirren in the league on January 4th.\n\nThey would break the run of games without scoring on February 12th when they beat Greenock Morton 4–0.\n\nThat set them up nicely for the third replay with Hibs — and this time, the Hibees were beaten 2–0 at Celtic Park in a game described by The Courier as being played in “disagreeable conditions” of wind and rain.\n\nAfter the drama of three replays against Hibs, the third-round clash at Firs Park against East Stirlingshire was considerably low-key as Thistle edged out the hosts 2–1.\n\nThe victory over The Shire was Thistle’s 5th game in February of 1921 alone, the game taking place on the 19th for reference, and was our 12th fixture since New Year’s day, a 1–0 win over Third Lanark at Firhill.\n\nA 2–1 defeat at Clyde and a 1–1 draw at Firhill with Kilmarnock preceded our next match in the cup, a trip to Fir Park to take on Motherwell.\n\nDescribed by The Sunday Post’s Bob Mercer as “just a trifle lucky”, Thistle fell behind courtesy of Hughie Ferguson’s goal before equalising through McFarlane “piloting” the ball beyond the goalkeeper, as eloquently told by Mercer.\n\nFerguson restored Motherwell’s lead before the break, and it seemed that Thistle’s long run in the cup was in danger, but up popped Willie Salisbury, and Thistle headed for yet another cup replay.\n\nThat replay took place on March 8th, three days after the original tie, none of this “week after the original tie” stuff you see today.\n\nPredictably, it required a third replay to determine the semi-finalist, following a goalless draw.\n\nAs with Hibs, Thistle finally triumphed in the third replay over Motherwell.\n\nIbrox hosted the seemingly inseparable sides, and Bobby McFarlane and Alex Lauder set up a semi-final with Hearts.\n\nThe semi-finals took place on March 26th at Ibrox and Celtic Park.\n\nRangers eased into the final with a 4–1 victory over Albion Rovers at Celtic Park courtesy of a Tommy Cairns brace and a goal each from Andy Cunningham and Sandy McFarlane.\n\nAlmost predictably, Thistle and Hearts played out a draw, meaning that all bar one of Thistle’s ties in the cup had gone to a replay by this point.\n\nThe semi itself was Thistle’s second fixture in their last three hosted at Ibrox, and they would play their next two fixtures there, a 1–0 defeat to Celtic in the league and the replay with Hearts.\n\nAfter one goalless draw and multiple do-overs at nearly every stage, Hearts were understandably the favourites for the rematch.\n\nStill, it would be Thistle who came closest to winning this time, James Kinloch and Matthew Wilson spurning great chances, and it meant for the third time in the cup run, Thistle would have to contest a second replay.\n\nSandwiched between the two replays for Thistle was a 2–2 draw at Firhill with Aberdeen, Joe Harris and Willie Salisbury were Thistle’s goalscorers.\n\nThus, it came down to a Celtic Park showdown for the right to reach the final at, erm, Celtic Park. We’ll come to that bit later.\n\nAfter two drawn games derided in the press for their poor quality, Thistle and Hearts served up a third, but fortunately, Thistle won out this time.\n\nJimmy Kinloch, who had missed one of the two big chances that Thistle spurned in the first replayed match, made amends by scoring both of the goals to send Thistle through to play Rangers.\n\nAfter capitalising on Hearts’ Wilson’s poor clearance, Kinloch then took his time to beat Kane in the Hearts goal after 13 minutes of play and a maiden Scottish Cup final for Thistle was secured by a strike from distance by that man Kinloch again.\n\nIn perhaps the most typical Partick Thistle fashion, this Herculean effort to reach the Scottish Cup final was followed three days later by a 1–0 defeat to Hamilton Accies.\n\nThe loss to Accies gave Thistle eight days to stew ahead of the final against Bill Struth’s seemingly unstoppable Rangers.\n\nThe 1921 Scottish Cup final is one of real intrigue, even if you’re not a Thistle supporter because of its closeness in time to Black Friday, which happened three days earlier.\n\nCoal miners had been on strike since the end of March 1921.\n\nThey widely expected that their Triple Alliance allies would join them, the Triple Alliance being the name of the triumvirate of the Trade Unions supporting the Miners, the Railwaymen and Transport.\n\nBut on Black Friday (April 15th), the Transport and Rail Unions voted not to do so, the name Black Friday coming about from Labour radicals feeling there had been a betrayal of trust and breach of solidarity.\n\nBack to the game and the final took place at Celtic Park, and the decision to raise the admission from one shilling to two caused consternation among the match-going punters, especially during social unrest.\n\nAs a result of the raised gate prices, the “Boycott Final”, as it became known, attracted only 28,294 to Glasgow’s East End for the showpiece event, the previous season’s final between Kilmarnock and Albion Rovers had attracted a crowd of 95,000 to Hampden Park, by comparison.\n\nThistle’s two meetings with Rangers had ended with two defeats to nil, losing 3–0 at Ibrox on October 16th, 1920 and 2–0 at Firhill on January 3rd, 1921.\n\nAs mentioned earlier, Rangers were convincing champions in Bill Struth’s first year in charge at Ibrox as manager, going on to lose just one of their 42 league games that season, winning 35.\n\nThey had two players who would score more than 20 goals that season in Andy Cunningham (27) and Geordie Henderson (23), while two more got more than 10, Sandy Archibald and Tommy Cairns both scoring 16 each.\n\nThistle were also without their two best players in Willie Hamilton, who missed the game with illness, and Jimmy McMullan, their star half-back, injured on international duty with Scotland the week of the final.\n\nSo just how did Thistle win it? Well, in an otherwise analytical report on the final by Celtic manager Willie Maley for The Sunday Post, he suggests that Rangers beat themselves.\n\nHe does, however, credit Thistle’s defence, which dropped back to frustrate Rangers short passing game, which had worked so well for them in the league that season.\n\nRangers dominated the first 20 minutes of the game, Andy Cunningham and Sandy Archibald saw efforts blocked by the tenacious Thistle defence while Tommy Cairns also missed from close range.\n\nIn this spell of Rangers dominance, the winning goal for Thistle arrived courtesy of a Willie Salisbury cross and a finish from close range by Johnny Blair.\n\nSuch was the accuracy of Blair’s effort that Rangers goalkeeper Willie Robb did not attempt to deny the Thistle outside-right.\n\nAnd Thistle nearly had a second goal just before the interval when Jimmy Kinloch, the hero of the second replay of the semi-final against Hearts, saw his effort at goal held by Robb in the Rangers goal.\n\nTry as they might, Rangers could not find a way back into the game, thanks in part to the stellar defending on show from Thistle, who drafted in Walter Borthwick to replace Willie Hamilton.\n\nThistle also had the ageless Celtic legend Jimmy McMenemy playing, who showed at no stage his being almost 41 years of age.\n\nMcMenemy had joined Thistle in 1920 after spending 18 years at Celtic, where he scored 142 goals in 456 games, lifting 11 league titles and six Scottish Cups — winning a league and cup double in 1907 and 1908 then again in 1914.\n\nNicknamed Napoleon by his peers for his tactical prowess and leadership qualities, he would stay at Firhill until 1923, finally retiring aged 42 before going on to coach after a sabbatical from the game to run a pub.\n\nHe coached at Thistle briefly, then returned to Celtic as a trainer, then as Willie Maley’s assistant.\n\nPassed over for the Celtic job when Maley retired in 1940, he retired himself soon after, dying in Glasgow in 1965 at the age of 84.\n\nHe is also related [distantly] to the former Southampton and England manager, Lawrie McMenemy.\n\nIt seems unfathomable considering everything that has occurred since this defeat to Thistle extended Rangers wait for the Scottish Cup to 18 years, but it had.\n\nThey would eventually get their hands on the cup for the first time since 1903 in 1927 when they defeated Celtic 4–0 in the final.\n\nThistle and Rangers would meet again in the Scottish Cup final in 1930, with the match going to a replay.\n\nUnfortunately for Thistle, there was no repeat of 1921, and we lost 2–1.\n\nSuch was the scale of the change in fortune to come for both sides that John Torbet’s goal in that 1930 final replay would be the last time Thistle scored against Rangers in the cup until Damon Gray scored THAT goal at Ibrox in 2008.\n\nThe record for the most games played in a Scottish Cup run is 11 matches, set by Third Lanark in 1878 and equalled by Vale of Leven in 1890.\n\nHowever, Thistle broke ground by becoming the first side to play that amount of matches and win the trophy — the two sides above were losing finalists.\n\nUnsurprisingly, it has only happened once since, by East Fife in 1938, although Hibs did play 11 matches in reaching the 1924 final.\n\nAnd with the advent of no replays in the current Scottish Cup season, such gruelling schedules are (probably gladly) a thing of the past.\n\nIn summary, Partick Thistle played 11 matches in the Scottish Cup en route to winning it, needing nine attempts to win three games.\n\nThey were without two of their best players and had to call on a 40-year-old they’d signed, glittering C.V. as such — and they beat the best team in the country who only lost one game all season out of 42.\n\nIf that isn’t a very Partick Thistle way of getting things done, I don’t know what is."}, {"url": "https://football50.co.uk/22nd-august-1967-partick-thistle-v-celtic-glasgow-cup/", "page_content": "Monday 21st August\n\nIn the evening papers, there were one story and one headline which caught the eye. The first was a story about the Boss –\n\n‘New English First Division club Coventry City are said to be ready to offer Jock Stein a salary of £10,000 a year to manage their club in succession to Jimmy Hill, who resigned the Coventry job last week. Will he? Won’t he? I have the feeling that there is no need for panic in the streets of the east end of Glasgow. Mr Stein is a happy man these days. He has made Celtic. He has taken them to victory in every tournament in Scottish and European football in a year. He does not consider that his job is finished – and that it is time that he took up a new challenge. Mr Stein has taken Celtic to the top – and his aim is to keep them there and win further honours for Scottish and British football’.\n\nAnd there was just a hint that there would be some new faces making an appearance against Thistle in the Glasgow Cup tie –\n\nCeltic New Boys in Line for Cup Debut\n\nThe names mentioned were Chris Shevlane, Pat McMahon, Lou Macari and Hugh McKellar.\n\nOn that Monday evening, the players had all met at the new Celtic Supporters’ Club in London Road for the official opening. The supporters put on a house-warming for the Celtic players, the management, the directors and some guests. The new club was opened by the club chairman Bob Kelly.\n\n22nd August\n\nThere was no pre-match meal before this one. We all merely reported at the appropriate time and a bus took us across the city to Firhill, where after a quick look at the pitch, we were ushered back into the dressing-room to hear the team. As has been suggested in the press, it turned out that there were debuts for some new boys;\n\nTeams\n\n\n\nPartick Thistle\n\nTaylor\n\nGibb, Muir\n\nCunningham, McParland, Walters\n\nMcLindon,Rae, Coulson, Flanagan, Duncan.\n\nSub: O’Neill\n\nCeltic\n\nSimpson\n\nShevlane, Gemmell\n\nClark, McNeill, O’Neill\n\nJohnstone, McMahon, Wallace, Gallagher, Lennox.\n\nSub: McKellar\n\nThe Play\n\nThis was rather brutally summed up in a comment in one of the following day’s papers –\n\n‘Without four of their European Cup-winning team for the entire game and a fifth, Johnstone, for the second half, Celtic, just as they had done in last year’s final, completely demoralized a Partick Thistle team uncertain in defence and pathetically inept in attack. Indeed the second half last night came perilously close to being shooting practice for the Celtic forwards’.\n\nBrutal, indeed! Watching from the stand, I would have described the occasion as a ‘rout’, with the goals coming as follows –\n\n10 minutes:\n\nWispy side-stepped the on-rushing Thistle keeper and swept the ball high into the roof of the net. 1-0 Celtic\n\n25 minutes:\n\nPat McMahon rammed home a lob from Jinky. 2-0 Celtic\n\n46 minutes:\n\nCharlie Gallagher’s free-kick was slipped to Wispy, who drove home from 25 yards. 3-0 Celtic\n\n53 minutes:\n\nPat McMahon raced forward and coolly rounded the keeper before slipping the ball into the empty net. 4-0 Celtic\n\n77 minutes:\n\nnice cross from Charlie Gallagher, an even better header from Wispy.\n\nFinal Score Partick Thistle 0 Celtic 5\n\nAnd that scoreline put Celtic into the semi-final of the Glasgow Cup, where they would face Rangers.\n\nIn the papers the next morning, just under a report of the match with this headline;\n\nCeltic Demoralise Partick Thistle’s Uncertain Defence\n\nThere was one comment that would have pleased any Jags fans.-\n\n‘Thistle’s one moment of glory came when Rae hit the post in the first half’.\n\nWell, if you get beaten 5-0 then you have to be grateful for small mercies!\n\nIt was also mentioned that ex-Celt Pat Crerand, by then at Manchester United, who was reported for spitting at a Stoke City player at Old Trafford in May, was ordered to give a written undertaking within seven days not to repeat the offence in the future, the Football Association disciplinary committee announced yesterday."}, {"url": "https://www.thecelticwiki.com/1967-08-22-celtic-5-0-partick-thistle-glasgow-cup/", "page_content": "Trivia\n\nNeither Celtic nor Partick Thistle had a mid-week League Cup game so both sides took advantage of the fixture gap to play this Glasgow Cup tie. The winners would go on to meet Rangers in the semi final.\n\nCoventry City made a bid to lure Jock Stein south as manager with an offer of a salary of £10,000.\n\nThis was a chance to give some of the new young lads and some of the back-up players a run out. Jock Stein made four changes bringing in newly signed Shevlane at right back and Pat McMahon at inside right, and give Willie O'Neill and Charlie Gallacher run outs.\n\nThe Celtic Supporters club on the London Road was opened on 21st August with all the directors and players in attendance.\n\nFirst mention of Kenny Dalglish as a 16 year old playing for Cumbernauld Utd but already on the books at Celtic and training at Celtic Park twice a week uinder the eyes of Willie Fernie, part time youth team coach this season.\n\nReview\n\nThe wealth of talent available was shown by the performance of the new young players in this game. In the second half Hugh McKellar, an inside right signed from Ardeer Recreation, came on for Jimmy Johnstone with Charlie Gallacher going to outside right and McMahon switching to the left. Pat McMahon in particular had a good game showing that he had been a decent acquisition from Kilsyth Rangers. He scored two and had two others ruled out for offside. Wallace was everywhere and a real thorn in the side of Partick.\n\nTeams\n\nCeltic:\n\nSimpson, Shevlane, Gemmell, Clark, McNeill, O'Neill, Johnstone (McKellar, 45), McMahon, Wallace, Gallacher, Lennox\n\nScorers: Wallace 3 (10, 46, 77), McMahon 2 (25, 53)\n\nPartick Thistle:\n\nTaylor Gibb Muir Cunningham McParland Walters McLindon Rae Coulson Flanagan Duncan Sub: O'Neill\n\nScorers:\n\nReferee: A Wilson (Glasgow)\n\nAttendance: 25,000\n\nArticles\n\nMatch Report (see end of page below)\n\nPictures\n\nArticles"}, {"url": "https://football50.co.uk/14th-october-1967-partick-thistle-v-celtic-league/", "page_content": "12th October\n\nDown at Seamill, there was no rest for the team of the previous evening. As was the norm, we were up early and did our usual pre-breakfast walk, along the main road to the far end of West Kilbride golf course, down the lane to the beach and then along the sand to the back of the hotel. It was a very pleasant journey on a fine day; if the wind was blowing strongly, you felt as if you were being cut in half. Fortunately, though, on that particular morning, the weather was not too bad and we went into breakfast feeling on top of the world.\n\nAfter that, we got the opportunity for a few holes of golf before coming back to the hotel in time for lunch. Then followed a period of rest before we did a workout on the lawn at the back of the hotel. This consisted of some short stuff followed by a 7-a-side match, 2-touch and no tackling! The 2-touch bit was easy, the no tackling much more difficult and I am in no doubt you can easily decide which of the two rules we found most difficulty with.\n\nAfter the workout, we headed for the swimming pool and the baths. What a tough life it was!\n\nWhile all this was going in down on the Ayrshire coast, Celtic fans in Scotland were devouring the papers to find out what was happening behind the scenes. They would have been delighted with the headline and comment in one of the morning ‘dailies’ –\n\nThe Magnificent Seven ‘No team that I have seen since the days when Real Madrid were truly great would have stood up to the Celts of last night. They burned up the Hampden turf, linked top speed play with brains working at the same pace and they shot with the accuracy of a Queen’s Prize winner at Bisley’.\n\nMore surprising was the story under another heading –\n\nJohnstone Capped ‘Scotland’s team manager Bobby Brown today dropped a football bombshell when he chose Jimmy Johnstone, Celtic’s outside-right, to play against Northern Ireland in a European Nations Cup tie on Saturday of next week. Johnstone has been chosen despite the fact that he appears before the SFA Referee Committee on Monday and faces possible suspension for being ordered off against St Johnstone at Celtic Park on 23rd September. Scotland’s football writers are astounded at his choice of outside-right but last night Brown merely said “I do not pre-judge. Johnstone is the man I want and that’s why he is in the side”.\n\n13th Friday\n\nThis date can cause a few problems for anyone of a superstitious mind but it apparently meant little to Jock Stein, who again got us to start with the trek along the road etc. The routine varied little from the previous day but the golf was out and in the evening, we were addressed by the Boss, who dealt with not only the match against Partick Thistle but looked ahead to the World Club Championship game against Racing Club the following Wednesday.\n\nHe also announced the team for the Jags match, which was the same side as against Hibs and Morton.\n\nThe evening papers also had some information. –\n\n‘Celtic will field the side which hit Morton for 7 in Wednesday’s League Cup semi-final when they line up against Partick Thistle at Firhill. Manager Jock Stein made a fitness check today at Seamill where Celtic are relaxing and decided to field the team which drew 1-1 with Dinamo Kiev in Russia before beating Hibs 4-0 and Morton 7-1. John Fallon, Steve Chalmers and Willie O’Neill will play in a strong Celtic reserve side at Celtic Park tonight against Partick Thistle reserves’.\n\nBecause of the Northern Ireland versus Scotland international in Belfast on Saturday of next week, the Rangers v Dundee and Celtic v Motherwell games due to be played that day have been re-arranged for October 23rd and 24th respectively.\n\nAs we were having a final cup of tea before heading for our rooms that night, we heard the news that in the reserve match at Parkhead, Celtic had beaten the Jags 3-1. Was that an omen for the first-team tomorrow?\n\nMorning of the Match\n\nWe did not start the day with the usual longer walk I mentioned previously but we did go down on to the beach at Seamill just to stretch our legs. Then it was back to the hotel and breakfast, before spending the rest of the morning just lazing round the place.\n\nA quick glance at the morning papers showed that almost no one believed that Partick Thistle had any chance in this match. In fact, one headline summed up the situation in rather brutal fashion –\n\nPity the Poor Old Jags\n\nThe Boss, though, was having none of it, once more reminding us that the Thistle players would, like most of the others we had faced in the league and league cup campaigns so far, be really up for the match, determined to show that they were as good as this team which had won the European Cup. We might have heard the words before but in the matches we had already played, they had turned out to be an accurate estimation of what had occurred, so we had no reason to think that the Jags players would be any different.\n\nWe were being treated like royalty down at Seamill and we were even provided with some lunch before the match. As we were eating in the dining room, we could see the Cotter’s bus in place to take us up to Firhill and before long, we were on our way. Once more, Lemon and I had a laugh when we saw our favourite gate in the farm field and I was really impressed when we reached Thistle’s ground to see the size of the crowd. Firhill, of course, had a much smaller capacity than our recent venues of Hampden and Parkhead but on that day, the fans had certainly turned up in droves and would certainly provide the sort of atmosphere we loved.\n\nThe Teams\n\nPartick Thistle\n\nNiven\n\nCampbell, Muir\n\nO’Neill, McKinnon, Gibb\n\nRae, McParland, Coulson, Flanagan, Duncan.\n\nSub: Divers\n\nCeltic\n\nSimpson\n\nCraig, Gemmell\n\nMurdoch, McNeill, Clark\n\nJohnstone, Lennox, Wallace, Auld, Hughes.\n\nSub: Brogan\n\nThe Play\n\nIt did turn out to be a very tough match from the start. We were certainly the better-moving side and had the majority of the possession but the Jags were never out of it and made some good chances. The crowd – estimated at 30,000 – was obviously loving it. A crucial incident, though, occurred just on the half-hour mark –\n\n30 minutes\n\nWispy and Davie McParland tangled, it became a bit serious, then the referee broke it up, pulled McParland to one side, booked him, then ordered him off.\n\nThe Thistle players were naturally very upset by all this and protested vehemently but it was all to no avail and Davie was not coming back. Curiously enough, with Davie off, I think that we took our feet off the pedal, relaxed a bit and did not take full advantage of being a man up.\n\nWe certainly made some chances. Wispy, Bertie and Lemon all had good chances but all of them fluffed their lines. But it was just before the break that we got the goal we badly needed to take some of the pressure off –\n\n43 minutes\n\na low cross by Bertie was hammered in by Cesar. 1-0 Celtic\n\nI suspect that this goal changed the ambience of the Boss’s talk at the interval. Up till then, he must have been almost pulling his hair out as we failed to take advantage of the extra man but by the time we came in for the break, he was once again his usual calm, constructive self as he tried to steady the ship\n\nAs usual, his words helped and right from the whistle, we assumed control and scored another four, all of then by Lemon.\n\n52 minutes\n\nfine pass by Bertie, good finish by Bobby. 2-0 Celtic\n\n59 minutes\n\nthis time I provided the low cross, Bobby met it at the near post. 3-0 Celtic\n\n71 minutes\n\nthrough ball by Wispy, which Lemon met perfectly. 4-0 Celtic\n\n76 minutes\n\nThistle pull one back when a cross-cum-shot by Arthur Duncan from just outside the box swerved past Ronnie. 4-1 Celtic\n\n89 minutes\n\nsquare pass by Yogi driven hard and true into the net from 10 yards by Bobby.\n\nFinal Score Partick Thistle 1 Celtic 5\n\nOther Results\n\nClyde 1 – 3 Rangers Dundee 1 – 4 St. Johnstone Falkirk 1 – 1 Kilmarnock Hibs 2 – 0 Dunfermline Morton 4 – 0 Airdrie Motherwell 3 – 1 Stirling Albion Raith Rovers 2 – 4 Hearts Aberdeen 6 – 0 Dundee United\n\nTable\n\nTeam P W D L F A GAv Pts 1 Rangers 6 5 1 0 10 2 5.00 11 2 Celtic 5 4 1 1 17 3 5.67 9 3 Hibernian 6 4 1 1 16 3 5.33 9 4 St Johnstone 6 2 4 0 10 6 1.67 8 5 Kilmarnock 6 2 4 0 8 5 1.60 8\n\nA Night at the Coast\n\nThe day ended in an unusual fashion. Instead of our usual routine, where we headed for home before doing whatever each of us did on a Saturday night, we boarded the bus again for the trip back to Seamill.\n\nIt turned out to be a night to forget. Dinner with the whole squad was followed by us sitting round chatting, watching TV or playing cards, all with a glass of lemonade in our hands. Most of us went to bed before 10pm, more out of boredom than anything else!"}, {"url": "https://www.heraldscotland.com/opinion/18276064.obituary-bill-brown-last-real-expert-still-teaching-ceramics-scotland/", "page_content": "BILL Brown, respected ceramics designer and teacher, has died at the age of 68 following a short illness.\n\nHe was an expert in his craft and gained international recognition for his knowledge of slip-casting and transfer printing. As Head of Ceramic Design at Glasgow School of Art in its final years, he unwillingly became “the last ‘real’ expert” still teaching ceramics in Scotland, according to former colleague Ian Pirie, before the department closed in 2011. It was the last single degree-level programme in ceramics left in Scotland’s art schools.\n\nBorn in Voe, Shetland, in February 1951, Bill was the second child of popular shopkeepers Maggie and John Brown. He left the islands when he was 18 to do a four-year diploma at Gray’s School of Art, Aberdeen, becoming the first in his family to attend higher education. He specialised in ceramics and, along with Pirie, was selected for a scholarship to do a post-graduate diploma.\n\nTheir external examiner was none other than David Leach, the eldest son of the famous potter Bernard Leach. The younger Leach was so impressed with their work he recommended they apply to join the elite Craftsmen Potters’ Association in London. They were accepted and became the first makers from Scotland to gain membership.\n\nBill spent the rest of the 1970s and early 1980s running a succession of potteries in Aberdeenshire and teaching part-time at Gray’s. He married my mother, Anna, and had two daughters, my sister Sunni and myself. In 1984 he left his young family and moved to North Berwick, near Edinburgh, transporting a hut from outside their small cottage in Monyroads to the backyard of ceramicist Dave Cohen. He taught part-time at Glasgow School of Art, with Cohen and Archie McCall, and at Cumbria School of Art. In 1991 he left the hut, which was by then rather damp and layered with plaster dust and cigarette ash, and moved to Glasgow to take up a full-time lecturing job at GSA.\n\nArchie McCall, who became Bill’s predecessor as Head of Ceramics at GSA, writes: “Those who worked with him were impressed by his fierce intellect, deep knowledge and mastery of language, often including self-deprecation or a wry punchline, timed to perfection. He worked tirelessly helping students from all parts of the art school, usually long into the evenings. His advice, though often reserved for the very last minutes of any review, was always the most positive, practical and succinct, even if a gentle ‘well, I might sleep on that idea if I were you’ summed up everything there was to say.”\n\nBill’s teaching and research took him to many countries including Iceland, Norway, Estonia, Hungary, Malta, Russia, the United States and Australia. Although his own work explored the use of transfer printing and other industrial processes in the context of studio crafts, his interests and expertise extended to archaeological projects with the University of Glasgow, ranging from Neolithic digs on Orkney to the recreation of pots from moulds retrieved from the site of the famous Bell’s pottery in Glasgow.\n\nHe also had an excellent ear for languages and music. He was fluent in Norweigan and German, and loved playing the fiddle – in particular Swedish folk tunes.\n\nThe year 2011 marked a new phase of his life, though not at first a good one. After investing decades of his life into GSA, the closure of the ceramics department left him deeply disappointed. Archie McCall recalls: “One of his most telling comments prior to the closure of the department at GSA in 2011 was simply: ‘I don’t believe that the human race spent millions of years evolving opposable thumbs just to text message!’.”\n\nAt this time Dad’s second marriage, to Marjorie Fernie, broke down. But ever the optimist, he started making plans: a return to his native Shetland as an independent ceramics designer. The move, which he finally made in 2013, did not dampen his interest in travel and he took the chance to work with former student Sue Mifsud, who was pottery manager of the heritage pottery Ceramika Maltija in Malta at the time.\n\n“He was the lecturer with the softly spoken voice and approachable manner and never became impatient with students,” Mifsud recalls. She invited him to give a series of lectures and workshops and to start rejuvenating the pottery’s moulds. “The pottery is still running today with much of its success due to Bill’s hard work, skill and creativity,” she says.\n\nWhen back on home soil, Billbuilt a custom-made workshop and, later, a house on a croft owned by his grandparents in Voe, Shetland. On one side the croft overlooks the house in which he was born, and on the other side the view reaches across the bay to the graveyard where his parents are buried and indeed the plot where he himself would be interred.\n\nWith typical pragmatism and poetic flair, he used the ruins of his grandparents’ ‘but and ben’ as a sheltered spot to grow kale and fruit bushes, and experimented with local clay and soapstone, which he collected himself. His work played on Shetland’s culture and natural heritage – not to mention his acute observational skills and dry wit – and was in high demand at local galleries. He fell in love with art lecturer Sólveig Aðalsteinsdóttir, and was the happiest me and my sister had seen him for many years.\n\nTragically, he did not have long to enjoy this stage of his life. After being diagnosed with lung cancer in October 2019, his health deteriorated rapidly and he died at home on February 3, a few weeks before his 69th birthday.\n\nDad described ceramics as a “timeless material”, outliving the maker and subject to re-interpretation by every successive generation.\n\n“The things we make have different meanings, the communities of makers have different places in society and a craft that is ‘high art’ in one time and place can be the lowliest of manual work in another,” he said. “Whatever we make now may well be around in a couple of thousand years’ time and will inevitably gain status in the process. Potters do have the last laugh.”\n\nBill will be remembered not only as a talented artist and teacher, but also as a loving father and grandfather, who was very proud of his family.\n\nHe is survived by Sólveig Aðalsteinsdóttir, his two daughters, and three grandchildren."}, {"url": "https://www.glasgowworld.com/sport/football/partick-thistle-alan-rough-1971-league-cup-final-celtic-3430504", "page_content": "It is 50 years to the day since a Partick Thistle side ran out at Hampden Park to face European giants Celtic in the 1971 Scottish League Cup Final.\n\nNobody gave them a chance and who could blame the doubters?\n\nThis was a young Jags side who had been relegated the previous season only to bounce back immediately under the leadership of new manager Davie McParland.\n\nAdvertisement\n\nAdvertisement\n\nThe ensuing 90 minutes sent shock waves through the football world as first-half goals from Alex Rae, Bobby Lawrie, Denis McQuade, and Jimmy Bone had the Jags in a commanding 4-0 lead at half-time.\n\nYet there was still feeling among the Thistle’s ranks that Jock Stein’s imperious Hoops could mount a momentous comeback.\n\nAfter all, there were four members of the famous Lisbon Lions team – Jimmy Johnstone, Tommy Gemmell, Bobby Murdoch, and Jim Craig – along with rising stars Kenny Dalglish and Lou Macari that never knew when they were beat.\n\nDespite a barrage of Celtic pressure in the second half, a solitary strike from Dalglish proved little consolation as Thistle stood firm.\n\nAdvertisement\n\nAdvertisement\n\nIt was an afternoon fresh-faced 17-year-old goalkeeper Alan Rough will never forget as he recalled: “It flies by so quickly and the first thing I said to myself after the final whistle was ‘I wish I could do this all over again.’\n\n“We were the kind of team who played attacking football and we were vulnerable to losing goals.\n\n“At half-time we were 4-0 up and we didn’t think it was over as we knew they were regularly scoring five or six goals a game.\n\n“There was a lot of apprehension even though we were winning so easily because they had guys like Kenny Dalglish, Lou Macari and Harry Hood.\n\nAdvertisement\n\nAdvertisement\n\n“They had a lot of goal scorers so we just had to try and keep a level head on it and believe we could see it out.\n\n“Bizarrely I always used to keep a watch in my cap. I don’t know why but I did. I knew exactly how long was left when Dalglish scored. Someone said it was 21 minutes but I told them it was 22!\n\n“I actually wasn’t too busy in the second half and it is a tragedy we can’t see the 90 minutes of that match again. We only have 15 or 20 minutes of highlights.\n\n“We played as well in the second half as we didn’t in the first half and we didn’t have another few chances.\n\nAdvertisement\n\nAdvertisement\n\n“I do have a lasting memory of the second half just right at the start we could have scored another couple.\n\n“I think Denis McQuade was through and I think Evan Williams had a tremendous save, so we weren’t on the back foot by any manner of means, I think we handled the game quite well.”\n\nPartick Thistle celebrate with the League Cup after the Jags stunning win over Celtic in 1971. Picture: Contributed\n\nRough described Jags boss McParland as a “father figure” to him and believes that was the main reason Stein decided to bring him to Celtic as his assistant manager at the start of the 1976/77 season.\n\nHe added: “You have to remember, I think there were four of us that were only 18 or 19, four of us had just played our first-team games in a season in the lower divisions so he was like Jock Stein.\n\nAdvertisement\n\nAdvertisement\n\n“I think that is probably why Jock took him to Celtic, I think Jock saw a lot in Davie McParland in himself in his younger career and basically he was a father figure, he watched what you were doing, he was always on top of you if you weren’t toing the line, that kind of thing.\n\n“Tactical-wise you just have to look at the formation we played, 4-2-4, it was two full-backs attacking, four forwards, and that is the way we played and that was his philosophy of how we should be playing.”\n\nRough earned 53 caps for the national team, the majority coming under Stein’s tenure, and he still remembers vividly the ribbing he received from Scottish football’s greatest ever manager.\n\nHe reckons the biggest advantage Thistle had ahead of the Cup Final was the absence of centre-back Billy McNeil from the Celtic side.\n\nAdvertisement\n\nAdvertisement\n\nRough admitted: “All the time, he used to wind me up by saying it was ‘just a one off’, ‘we felt sorry for yous’ and all that carry-on, but I said, ‘aye that will be shining bright’.\n\n“For me I think one of the biggest factors of that was game was Billy McNeill not playing, and I spoke to big Billy, unfortunately he has passed away now, and he was sad he missed that game as well.\n\n“I thought he was a mainstay in their team and it was a bonus for us I think he got injured before that game.\n\n“It has become almost mythical because for provincial clubs like us, these days don’t come around very often.\n\nAdvertisement\n\nAdvertisement\n\n“St Johnstone were a perfect example last season and it is something you hang on to. The fact we beat Celtic in the final also makes it that bit extra special even 50 years on.”\n\nJock Stein on the pitch at Elland Road after being appointed Leeds United's new manager in August 1978.\n\nRemarkably, every member of Thistle’s 71’ squad are still around and will attend Firhill this afternoon when Ian McCall’s side take on bottom of the table Dunfermline.\n\nRough is hopeful the Jags can mark the occasion with a victory that would be sure to put a lot of smiles on people’s faces.\n\n“It would be fantastic,” he stated. “I think obviously Dunfermline will be a different Dunfermline to who we played in the first game of the season, obviously we’d like to carry on the Hamilton result which was fantastic.\n\nAdvertisement\n\nAdvertisement\n\n“It would just be a great start to the weekend, but nothing is predictable and I’m sure Ian (McCall) and the boys will have that in the back of their mind that it would make a lot of people happy if they could pull it off.\n\n“It will be a great day and if you mingle around our supporters there are still some who were at that game. Hopefully, there are plenty others who have heard about and will turn out in their numbers.\n\n“Everybody in our team is still alive, unfortunately in the Celtic team there are some legends who are no longer with us.\n\n“They won’t have great memories of that day, but I am sure if they were still here, they would be talking about it.\n\nAdvertisement\n\nAdvertisement\n\n“I remember as soon as those 90 minutes finished in the cup final, the first thing was every Celtic player to a man came over and congratulated us, there was no walking off the park or anything like that.\n\n“I think they appreciated what we had done, which I just think is a great thing for a team like Celtic to do.\n\n“But it is a tragedy that some of the Celtic boys aren’t here because they are big, big legends at their club”\n\nRough has been monitoring the progress of current Thistle keeper Jamie Sneddon, who continues to impress between the sticks.\n\nAdvertisement\n\nAdvertisement\n\nSneddon is a product of Hearts youth system and the former Scotland legend has tipped the 24-year-old to have a big future in the game.\n\nHe said: “I think he’s improved year on year. He has obviously had to fight for his place, which is a good thing as well.\n\n“The manager had a decision at the beginning of the season who to go with and in fairness he gave both of them a shot. Jamie came out winning that one and since he’s come back in he has been fantastic."}, {"url": "https://www.thecelticwiki.com/players/all-time-a-to-z-of-celtic-players/m/mcneill-billy-1958-75/", "page_content": "Personal\n\nFullname: William McNeill\n\naka: Billy McNeill\n\nNicknames: Cesar, King Billy, The Big Man\n\nBorn: 2 March 1940\n\nDied: 22 April 2019\n\nBirthplace: Bellshill, North Lanarkshire\n\nSigned (as player): 20 August 1957 (from Our Lady’s High)\n\nLeft (as player): 3 May 1975 (retired)\n\nPositon: Centre half, Defender\n\nFirst game: Clyde home 2-0 League Cup 23 August 1958\n\nLast game: Airdrie Hampden 3-1 Scottish cup final 3 May 1975\n\nFirst goal: Ayr United away 3-1 league 4 March 1961\n\nLast goal: Airdrie home 6-0 league 16 November 1974\n\nInternationals: Scotland\n\nInternational Caps: 29 Caps\n\nInternational Goals: 3\n\nManager: 1978-1983, 1987-1991\n\nFirst game as manager in first spell: Clyde home 2-1 Anglo Scottish cup 3 August 1978\n\nLast game as manager in first spell: Rangers away 4-2 league 14 May 1983\n\nSucceeding: Jock Stein\n\nSuccessor: David Hay\n\nFirst game as manager in second spell: Morton away 4-0 league 8 August 1987\n\nLast game as manager in second spell: St Johnstone away 3-2 11 May 1991\n\nSucceeding: David Hay\n\nSuccessor: Liam Brady\n\n‘If ever a man was made for a specific club, it was Billy McNeill and Glasgow Celtic…. His heart was always at Parkhead.’\n\nPeter Swales (Chairman of Man City 1989)\n\nPlaying Career\n\nAn undoubted Celtic great, Billy McNeill, ‘Cesar’, was the captain of the Lisbon Lions and the lynchpin in the team Stein led to much success.\n\nBilly McNeill was born on 2 March 1940 in Bellshill, North Lanarkshire, of part Irish and part Lithuanian descent.\n\nHe was signed by Celtic from nearby junior team, Blantyre Victoria, in 1957 as a defender. As captain he won nine Scottish League Championships, seven Scottish Cups, and six Scottish League Cups, as well as the European Cup final. He had the honour of being the first British player to lift the European Cup.\n\nHe retired as a player in 1975 after over 800 appearances for Celtic. During his career, he won 29 caps for Scotland.\n\nWhenever someone discusses Celtic’s nine-in-a-row, the focus is always on Jock Stein and what he did. Sometimes it can just overshadow the part that the players played in this, and in some ways that is very true of Billy McNeill (‘Cesar‘), possibly Celtic’s greatest elder statesman.\n\nBilly McNeill is pivotal in the history of Celtic and even more so in the golden era under Jock Stein. Raised in Bellshill (Lanarkshire), in his youth he used to go watch Motherwell (the nearest senior club) and used to play for Our Lady’s High School football side. After signing for Celtic (having been spotted by Bobby Evans) he soon cemented his place in the Celtic defence. However, all was not well and before the arrival of Jock Stein at Celtic, things at Parkhead weren’t so good, with poor coaching and management difficulties that made him close to jacking it all in and was attracting interest from Spurs. Strange how things could have turned out or could have been if he had decided to go, but thankfully the arrival of Jock Stein changed things for him to stay and all for the better.\n\nIt’s said that Stein’s appointment as manager was important to Billy McNeill yet the truth is that Billy McNeill’s presence at Parkhead was just as important for Jock Stein. Celtic’s rise to the top began step by step and it was Billy McNeill who scored the pivotal winning goal in the 1965 Scottish Cup final against the match final favourites Dunfermline to give Celtic their first senior trophy since 1957. A late charge with eight minutes to go saw Celtic win a corner. Charlie Gallagher swung in a perfect inswinger into the box which Billy McNeill connected to and headed the ball into the back of the net. Billy McNeill was only in the box as he was pushed by Jock Stein to do so, previously defenders were told not to do so.\n\nThe importance of the game was acknowledged by Stein years later and it was through a combination of Stein’s tactics and Celtic’s determination that the team won the trophy and set the club up for the great years to come. Billy McNeill’s place had now been marked in Celtic’s annals, and it is fair to say that he had helped to kickstart Celtic into the Golden Era (or headed the team in!). Incredibly it was his first major title win with Celtic after seven years with the club.\n\nFrom here on in, Billy McNeill’s ability as a player was now at the forefront of Celtic’s play. A strong determined footballer, he commanded respect not only from his fellow players but from opposition players as well. Strong in the tackle and in the air, he was a commanding player but it was his organisational skills and communicational abilities on the park that gave him an edge over others. He had an aura and despite his strong will, he was actually a pleasant and decent person at all times and few if any have ever had anything to say bad about him. There was no high & mighty attitude with Billy McNeill, and all were treated fairly.\n\nOne important point is that some players can be made greater with the players round them, and in Billy McNeill’s case this was where John Clark came into play. Generally overlooked by many when reviewing Celtic’s history, it is true to say that Billy McNeill was twice the player with John Clark beside him but this is not to take anything away from either at all. When players combine well together (as Larsson and Sutton did so well in the 2000s), it’s almost as if you have an extra man on the pitch.\n\nThe league title in 1965-66 increased Billy McNeill’s stature at the club, but the first signs of what could be achieved were sown in the European Cup Winners Cup in 1965-66 where Celtic bowed out in the semi-finals. It was a disappointment but a pre-cursor to the glorious 1966-67 season where Billy McNeill was the lynchpin to Celtic’s success. The role of honour can never be understated, the domestic treble (league, Scottish Cup and League Cup) with the European Cup is as much a testament to his abilities as Captain of the side as it was to Jock Stein’s managerial ability.\n\nThe European Cup final of 1967 was the pinnacle of his career. In his own words:\n\n\n\n“The biggest thing I had to do as captain was in illustrating to the team that we had nothing to fear. I had to swap pennants with their captain, Picchi before the kick-off. We exchanged words but I didn’t have any Italian and I don’t think he had any English, but you always manage to get through.” A stout Celtic defence sadly conceded an early goal, but the team was more than ably captained by Billy McNeill, and Celtic fought back to defeat the Catenaccio of Inter Milan. His crowning glory was his sole march to lift the trophy after the final whistle, which the rest of the team themselves didn’t see (stuck in the dressing room). He lifted the trophy above his head and immortalised his image to proclaim Celtic champions of Europe. He was more ‘Caesar‘ than ‘Cesar [Romero]’ at this moment, a befitting moment for him as much as a great man as a player of his stature. Still makes the supporters all proud when anyone sees that picture.\n\nThe following World Club Championships, where the Celtic players were kicked and assaulted to defeat by Racing Club, was a low point for Celtic, but an interview with a Racing player later depicted a side to Billy McNeill’s character that showed him to be a giant against above all other men. The player saw Billy McNeill approach at the final whistle and expected an assault after what had transpired in the previous 90 mins. Instead, Billy McNeill graciously and humbly held out his hand and they shook hands followed by an exchanging of jerseys. The Racing Club player was so taken by the gesture in the strained circumstances that he grasped Billy McNeill’s jersey tight and ran back to the dressing rooms so as to ensure no one could take it from him. He stated that after all that happened he was humbled by Billy McNeill and hoped they might play again in the World Cup 1970 (which Scotland sadly didn’t make). It was the mark of the man that he was able to still be a gentleman even in the face of so much tension and havoc. (See match page.)\n\nComing years saw Celtic continue to dominate domestically under Jock Stein’s auspice, with Billy McNeill at the helm on the field and Celtic were coasting league victories and titles. Rangers were unable to match Billy McNeill for presence or stature, and the support were comfortable in the knowledge that he was always Celtic’s man.\n\nEven in European games, Billy McNeill continued to excel with the games against Leeds in the European Cup semi-finals of 1970 another high mark. The opposition employed long ball tactics were completely undone as the Celtic defence under Billy McNeill stood tall and won everything thrown at them. The final was another matter and disappointingly Celtic lost. Sadly, Billy McNeill was party at the centre of the losing goal, and in his own words the club lost a lot of self-belief after this defeat.\n\nAs a captain Billy McNeill was the main man and a total inspiration to those around him on the pitch and on the terracing. For a centre half to score in three Scottish cup finals is a magnificent achievement (1965, 1969 and 1972) and his leadership was inspirational during the glory years. It’s no coincidence that when Celtic lost 4-1 to Partick Thistle in the 1971 League Cup final that Billy McNeill’s presence in defence was badly missed. The fans admired him tremendously and Billy McNeill was greatly loved by the Celtic support.\n\nNevertheless, he was forgiven as after all he’d done for Celtic on the pitch, moments like as happened in the 1970 European Cup final do happen to all the greats. Further forays in the European Cup to semi-finals in 1972 and 1974 showed that Celtic were a strong force and Billy McNeill was always there to push the First Team further.\n\nAn additional point must be added to how Billy also fostered the careers of many around them. The ‘Quality Street Gang‘ of players in the early 1970’s were always looking up to him and loved him, and he played a strong part in their development. If only the club was managed better at the board level then Billy McNeill could have played with them for longer, but the Quality Street players departed one by one as financial matters came to a head.\n\nIn 1975, Billy McNeill played his last game for the club. It was the end of an era for the man all Celtic fans loved. At the final whistle of his last game (Scottish Cup Final victory v Airdrie), he was carried aloft by all his fellow players as the fans chanted his name. Thankfully this was not to be Billy’s last involvement with the club, and he has been in love with Celtic as much as any fan has ever been.\n\nMany like to talk about Jinky or Stein but Billy McNeill is a name that should always be at the forefront too. A wonderful player and person, and never one whom Celtic will ever be able to replace man for man.\n\nIf anything, the following quote from Jock Stein sums up Billy McNeill’s importance to the Celtic sides of the era perfectly:\n\n“What makes a great player? He’s the one who brings out the best in others. When I am saying that I’m talking about Billy McNeill.”\n\nMajor Honours as a Player\n\nEuropean Cup\n\nScottish Division One\n\n\n\nScottish Cup\n\nScottish League Cup\n\nNote:\n\n1 European Cup\n\n9 League Titles\n\n6 Scottish League Cups\n\n7 Scottish Cups\n\nRead the numbers from top to bottom: 1967\n\nManager 1978 – 1983\n\n“I have often been asked what makes a successful team and I believe the answer is relatively simple. It’s about knowing that your mates are standing by your side ready to lend their unqualified support in the belief that there is nothing that cannot be achieved.” Billy McNeill\n\nBilly McNeill had the daunting task to take over from the legendary Jock Stein. How exactly was Billy McNeill to do?\n\nHaving worked from the bottom up with Clyde & then Aberdeen (for one season taking over from Ally MacLeod who went to Argentina to manage the hapless Scotland squad), he had gained the rudiments that help set the best managers up in their careers. For Jock Stein, the change was a difficult move; a poignant picture, from the time of transfer of power over to Billy, depicts a handshake between Billy and the then chairman being coldly looked down upon by Jock Stein. It was a sad day, and even now many years after than picture was taken, the Celtic support can still feel the hurt and pain.\n\nIn any case, Billy McNeill was now in charge and the environment had moved on from his heyday as a player. Rangers were heavily resorting back to their old physical dogmatic style of play and it had paid dividends in a treble in 1978. Celtic, on the other hand, had sunk quickly and it was up to Billy McNeill to take on the reins and lead Celtic back to the top. Taking his knowledge and experience of working under Jock Stein, the club was hoping to repeat the successes of years gone by.\n\nHis first year was eventful, and a good squad of players worked their way up the ladder taking on Rangers. A closely fought season saw the whole championship boil down to the last game of the season (for Celtic), where ‘Ten men won the league‘. An incredible game saw Celtic playing Rangers with a man down, yet Celtic came from behind to win the game and seal the league at the death. Sheer brilliance, and a moment up there with the best experienced domestically under Jock Stein’s reign.\n\nThe highlight of Billy McNeill’s first foray as Celtic manager was to come in 1980. In the European Cup, a galvanised Celtic team pushed above their weight and reached the quarter-finals to set up a mouth-watering game against Spanish giants Real Madrid. At home, the team put in a workman-like performance and outplayed the lauded opposition (much fancied to easily defeat us) and Celtic won by two goals to nil.\n\nFor Billy McNeill, more than at any point he could now come out from under Jock Stein’s shadow, too often an unfair burden, and with this result Billy McNeill could be heralded in his own right. Magnificent. The return leg was never going to be easy, and a pumped-up Real Madrid easily swatted Celtic aside 3-0 at the Bernabeu. Hopes were bitterly dashed but this was Celtic’s best performance in Europe since 1974, and was in large part due to Billy McNeill who deserved full credit.\n\nCeltic is all about players, and in Charlie Nicholas, Billy McNeill had a gem in the same way that Jock Stein had Jinky. A precocious player Charlie Nicholas set the heather on fire in his first seasons and was lauded with praise from all quarters. Nurturing talent like Charlie Nicholas was no easy task but Billy had seen it going both right (Jinky) and awry (George Connelly), so if anything Billy McNeill had experience on how to handle Charlie Nicholas (no easy task). Billy McNeill helped to bring up other great players in his time as manager, but few stand out as much as Charlie Nicholas.\n\nIt was a new era beginning in Scottish football, however, as much as that was partially true, a new era was dawning but not for Celtic (or Rangers) but for the ‘New Firm‘ (Dundee Utd & Aberdeen). In the early 1980’s Aberdeen and then Dundee Utd began to battle against the old Glasgow duopoly of the Scottish game. A welcome change for the Scottish league but with the the legendary Alex Ferguson at the helm at Aberdeen. Aberdeen won the league in 1979/80 but Celtic pinched the league back in the next two seasons under Billy McNeill in hard close fought tussles. The squad was well managed and respected, and Billy McNeill was moulding the players together.\n\nOne of the more celebrated moments in Billy’s reign was off the field. Back in 1980, en route to Hungary for a European tie, Billy McNeill, after a heated discussion over a match decision (in a recent Celtic v Rangers game) with Gerry McNee (an extreme bawbag & major David Murray sycophant), Billy McNeill invited Gerry McNee to carry on the discussion outside. On accepting the invitation, Billy McNeill famously lamped Gerry McNee once they got outside, although sadly it didn’t knock any sense into his head as Gerry McNee’s future journalistic contributions were to show.\n\nFor the incidents, Billy McNeill was fined £500 for the punch and then given a public rebuke. Most fans regarded it (and still do) as a bargain. There was an ironic, and humorous, postscript when the press party eventually arrived at their Hungarian outpost, about four hours drive from Budapest. Billy McNeill invited the travelling hacks to take penalties against him after training, and the only one to score was the bold Gerry. Stories that he achieved this feat while clutching his eye at the same time have never been confirmed.\n\nIn truth, the real challenge was off-the-field against the club’s own board. Mismanagement had come back to haunt the club, the board directors having taken little advantage of Celtic’s earlier dominance to build the facilities deserved (for the players as well as the fans), and for Billy McNeill there was to be little financial assistance to help re-build the club back up. After all the previous success there was little in the kitty, and Billy McNeill spent a disproportionate amount of time simply fighting with the board.\n\nThe straw that broke the camel’s back was the transfer of Charlie Nicholas to Arsenal, which became a very public fall-out between the Chairman (Desmond White) & Billy McNeill. Losing a talent such as Charlie Nicholas was a real body blow, and at such a young age he still had much development to go through. Celtic had been a selling club for too long despite the club’s size and pedigree, but to lose even the club’s youth players, what then was the manager’s team to work with? In the past, Dalglish and others had at least left after a number of years at the club.\n\nAt the end of season 1982/83, Billy McNeill had had enough of the board, and openly said it. He left the club to move to Man City as manager, a sad way to lose a good successful manager. Under him Celtic had won 3 league titles in 5 years, and he could hold his head up high with some wonderful memories left for all the support. As for the board, they were to remain the same for too many more years to come. This should have been the sign that things had to change and modernise but sadly the Celtic support had to wait for a lot longer for that.\n\nManager: 1987-1991\n\n‘If ever a man was made for a specific club, it was Billy McNeill and Glasgow Celtic. He was never really manager here, or at Aston Villa. His heart was always at Parkhead.’\n\nPeter Swales (Chairman of Man City 1989)\n\nA commonly asked football trivia question in England is: ‘Who was the first manager to to manage two relegated teams in the same season?’. The answer is sadly ‘Billy McNeill‘. His stints between managing Celtic, at Man City & Aston Villa, simply didn’t work out for him although at Man City he did have some initial success, and is fondly remembered for managing them to promotion back to the top tier. His departure from Man City to move to Aston Villa was a mistake, where he moved from one poor board management to an even worse one.\n\nIn many ways he was destined to return home to Glasgow, and after Davie Hay was sacked in 1987, Billy McNeill was asked to return as Celtic manager and he said yes almost immediately. It was Celtic’s Centenary Season (1987-88) and it was hoped for something special to celebrate the year. Billy McNeill was hampered by the loss of a number of key individuals (top scorer Brian McClair for example) but he bought and sold wisely, and the season was a sensation as Celtic romped to the domestic double of league and cup.\n\nIt was an emotional time and many placed the triumphs high up in their estimations. There were a number of talismans in the squad that season but it was Billy McNeill who helped keep everything in check, a mighty task when you had to blend together the headstrong captaincy of Roy Aitken and the mercurial talent of Paul McStay alongside that of the maverick Frank McAvennie. It was wonderful mix and the side developed over the season.\n\nCeltic had a number of key late victories, most notably the Scottish Cup final, and it showed that the players were all working to the last kick, an attribute instilled in them by Billy McNeill as he himself had when he was a player. The football was a joy to watch and confidence had returned.\n\nHowever, the squad was young and still weak (possibly one of the weakest Celtic squads to have won the SPL), and things had to be shored up to carry on the success, but it didn’t happen. The problem was that Rangers were rejuvenated and strengthening financially off the field which was paying dividends on the field, and Celtic couldn’t match them in the spending stakes.\n\nPost-centenary season, things turned so much into the red that it was just bewildering. In 1989 if the season was measured by league performances from Jan-Dec, Celtic would have finished second bottom in the table. Losing talisman Frank McAvennie was inevitable (to birds & booze as much to West Ham), but replacing him became impossible for Billy McNeill. A respite for Celtic by winning the Scottish Cup, stopping a Rangers’ treble in 1989, but that was Billy McNeill’s last trophy as Celtic manager. The biggest event was the loss of the signing of Mo Johnston to Rangers in 1989, an event that really signalled the poor state Celtic was in; the signing shook Celtic and Billy McNeill badly.\n\nThe nadir for Billy McNeill was the signing of Martin Hayes in 1990. Some say that Arsenal privately laughed over Celtic’s offer price and bit their hand off to sell him to Celtic. Others say that Celtic got a player who was well regarded by the Arsenal fans and played a strong role in past seasons for them. In any case, his signing was nothing less than a disaster with few appearances and no plaudits for anything. Long-term injuries hampered the rest of his time at Celtic.\n\nFrom then on there was little Billy McNeill could do to repair his current managerial reputation, so bad was it sullied by that signing, and sadly Hayes’ signing is brought up every time Billy McNeill’s management spell is spoken about (in jest as much as in seriousness). The biggest problem is that unlike previous failings in the transfer market this one could not be blamed on the board, which was a staple retort to any criticism ever aimed at the coaching team in years gone by.\n\nThe writing was on the wall, and it was only a matter of time. Some good results did come about in his final days, in particular the two live games on TV against Rangers which Celtic won (one dubbed the ‘St Patrick’s Day Massacre‘), however Celtic still ended the season empty handed after an embarrassing exit from the Scottish Cup thereafter to Motherwell. In fairness, the ‘Sack the Board’ events had started to creep in, and so for Billy McNeill there was little help off-field for his predicament.\n\nBilly McNeill was effectively sacked in 1991, and there was a mixed view on how it all happened. The anti-board view, fuelled by the press, labelled it as knifing the club’s greatest stalwart in the back as the story was leaked to the press by a mole in the boardroom. Many say a position to retain him at the club should have been made. Billy McNeill was scathing on how it all happened, especially critical of then Chief Executive Terry Cassidy’s handling of the affair.\n\nOn the other hand, there was likely no position for Billy McNeill suitable or worthy for him other than being on the board, but possibly the Celtic boardroom was not suited for him. It’s no easy decision to have to let go of one of the greatest stalwarts in the club’s history, but he was a highly paid manager and results couldn’t hide the failure in his last tenure. A clean break is sometimes for the best. Also working with the incumbents as were on the board at the time would have been a difficult move for anyone.\n\nIt was a sorry end to his management career but the good memories definitely outweigh the bad, and the Celtic support will remember him as fondly for having been Celtic’s manager as much as having been one of Celtic’s players.\n\nPost-Celtic Managerial\n\n“Apart from playing for Celtic, I’ll always be a Celtic supporter.”\n\nBilly McNeill\n\nYears later, Billy McNeill was briefly assisting as a mentor to Jim Duffy at Hibernian, and was interim manager for one game after Jim Duffy was sacked. Hibs lost 3-0 to Aberdeen. It was ironically in season 1997-98, a celebrated season when Celtic finally won the league to stop Rangers charge to ten league titles in a row.\n\nHe never took up a frontline role in football again, however in time as Celtic evolved, especially after the Celtic Takeover upheaval had settled down, he was once again heavily involved with Celtic, both officially and in unofficial circles, playing a strong role keeping the spirit of the club alive. Supporters were in awe of him, and he was a living legend to everyone.\n\nIn July 2009 Celtic announced that Billy McNeill had been named as the club’s ambassador in recognition of his contribution to Celtic over so many years.\n\nIn December 2015, a statue in his honour was unveiled in front of Celtic Park’s entrance, a perfect tribute.\n\nIn February 2017, it was announced that sadly Billy McNeill was battling dementia. He was to make an appearance in the draw for the European Cup group stages, and all watching could see the difficulties he was having in performing these tasks as his then frailty was proving to be impossible to hide.\n\nIn April 2019, Billy McNeill was awarded the “One Club Man” honour by Athletic Bilbao. “The choice of Billy McNeill as OCM transcends the player’s extraordinary individual career links directly to the team he captained,” said Bilbao. Athletic’s ‘One Club Man Award’ was set up four years previously with the aim of honouring players whose career with one team represents the values of “commitment, loyalty, responsibility, sportsmanship and respect”, which embody the Basque side’s own identity.\n\nPassing Away\n\n‘Where you went others followed’\n\nTribute line to Billy McNeill on his passing\n\nOn 22nd April 2019, Billy McNeill passed away. It was humbling to see the response across football globally to his passing away, with his status acknowledged & recognised everywhere.\n\nAn incredible moment happened in the following match, which clearly proved that there is a fairytale aspect about Celtic. The winner in the following match (1-0 victory v Kilmarnock 27 April 2019) was scored by a central defender (Simunovic) wearing the no.5 shirt on the 67th minute with a header (Billy McNeill’s shirt number was 5, he was a central defender and was famous for his headed goals). Incredible, as if it was destined to be so and written in the stars. Simunovic had vowed to score in McNeill’s honour, but what timing. McNeill will have been looking down with pride at what was an emotional time for his family & friends, and Simunovic’s jersey was donated to McNeill’s family members as a tribute for this wonderful moment.\n\nBilly McNeill’s funeral was held at St Aloysius Church in Glasgow, with his cortège passing by Celtic Park for a a final journey.\n\nFellow Lisbon Lion Stevie Chalmers passed away a week later also in part from the impact from dementia. It reignited discussions on the potential link between the long-term impact of heading in football and the possible impact to the onset of dementia. Billy McNeill, Stevie Chalmers and Jim Brogan all from the same era and Billy McPhail from the 1950s had succumbed to dementia. It was something that should be openly discussed.\n\nOne poignant moment was in May 2019, Billy McNeill had been awarded a One Man (Club) award by Athletic Bilbao and was to be presented this at a following match in Spain. However, as Billy McNeill passed away just a week later, in his place long-term friend John Clark and Susan Chalmers (daughter of Billy McNeill) received the award in his honour. The crowd sung along with “You’ll never walk alone” as a giant no.5 hoops circle was placed in the centre circle.\n\nBilly McNeill will never be forgotten, and is immortalised in the club’s history. He is one of the greatest Celts there has ever been, and we will forever be in his debt.\n\nMajor Honours as Celtic manager\n\nScottish League\n\n\n\nScottish Cup\n\n\n\nScottish League Cup\n\n\n\nThe Nickname ‘Cesar’\n\nEveryone seems to know that Billy McNeill’s nickname is Cesar, and then have images of the rampaging Roman leader Julius Caesar rising above all others at the Coliseum. When you see the pictures of Billy McNeill holding aloft the European Cup in 1967 on being presented the trophy after the victory over Inter Milan, it is easy to see how the comparisons come about. Cries and headlines of ‘Hail Cesar‘ are not uncommon either when his name is mentioned.\n\nAlas, it is an easy mistake for anyone to make. Firstly note, it’s ‘Cesar‘ not ‘Caesar‘, and the nickname is not actually in reference to the old Roman leader.\n\nHis nickname actually derives from being one of the only Celtic team players to own a vehicle at the time, and was inspired by a role in the movie Ocean’s Eleven (the original version) played by the actor Cesar Romero who acted as the crime gang’s getaway driver in the film. Cesar Romero was, at the time, one of the original Hollywood bratpack of Sinatra, Romero, Sammy Davies Jnr, Dean Martin etc, a million miles away from Billy McNeill’s real persona.\n\nStill, the mistake is carried on by many, and even Billy McNeill himself played along with it, with an autobiography of his having been titled ‘Hail Cesar‘, carrying over the spelling difference.\n\nHowever, there are still plenty of those who still claim otherwise. Lisbon Lion, Bertie Auld says that the nickname ‘Caesar‘ was used long after the original nickname of ‘Cesar‘, and many still stick to that story, although Billy McNeill himself dismissed this.\n\nThe original with ‘Cesar‘ as was used by Billy McNeill in his autobiography seems more likely to sit right.\n\nCareer Stats\n\nClub Performance League Cup League Cup Continental Total Season League Apps Goals Apps Goals Apps Goals Apps Goals Apps Goals Scotland League Scottish Cup Scottish League Cup Europe Total 1957-58 Div One 0 0 0 0 0 0 0 0 0 0 1958-59 17 0 0 0 6 0 0 0 23 0 1959-60 19 0 7 0 6 0 0 0 32 0 1960-61 31 1 8 0 4 0 0 0 43 1 1961-62 29 1 6 0 6 0 0 0 41 1 1962-63 28 1 7 0 6 0 1 0 42 1 1963-64 28 0 4 0 6 0 8 0 46 0 1964-65 22 0 6 1 6 0 2 0 36 1 1965-66 25 0 7 0 10 0 7 1 49 1 1966-67 33 0 6 0 10 2 9 1 58 3 1967-68 34 5 1 0 10 0 2 0 50* 6† 1968-69 34 3 7 3 9 0 6 0 56 6 1969-70 31 5 5 0 10 2 9 0 55 7 1970-71 31 1 8 1 10 0 5 1 54 3 1971-72 34 3 6 1 8 0 7 0 55 4 1972-73 30 1 7 1 10 0 4 0 51 2 1973-74 30 0 5 0 11 0 7 0 53 0 1974-75 30 1 4 0 9 0 2 0 45 1 Career Total 486 22 94 7 137 4 69 3 789* 37† ________ ________ ________ ________ ________ ________ ________ ________ ________ ________ ________ ________ * Includes 3 Appearances in the World Club Championship † Includes 1 Goal in the World Club Championship\n\n[managerial record to be added]\n\nPictures\n\nQuotes\n\nArticles\n\nStatues\n\nLinks\n\nBooks\n\nDVD\n\nThe Billy McNeill Story (2009)"}]}