{"Bill Brown played in the 1967 European Cup Final, which Celtic lost 2–1 to Inter Milan.": [{"url": "https://www.thecelticwiki.com/1967-05-25-celtic-2-1-inter-milan-european-cup/", "page_content": "Celtic win the European Cup for the first time and create history.\n\nThe greatest day in the club’s history, and a landmark in European footballing history.\n\nT rivia\n\nCeltic became the first British, Northern-European & Non-Latin side to win the European Cup.\n\nOnly Scottish club to have won the European Cup and reach the final.\n\nCeltic completed a clean sweep of all five competitions they entered – League, League Cup, Scottish Cup, Glasgow Cup & European Cup. An incredible achievement.\n\nThe winning team of players were dubbed ‘The Lisbon Lions‘ in honour of their success.\n\nInter Milan were favourites and were previous winners of the tournament. Inter had lost only once in the European Cup in four successive seasons, winning the trophy twice and losing that sole game to Real Madrid. What a challenge!\n\nCeltic had an astonishing 42 attempts on goal to Inter’s five, and Celtic had ten corners to Inter’s nil. Inter’s catenaccio defensive formation was truly destroyed.\n\nIn April 2010, highly regarded ‘ World Soccer’ magazine ranked this match amongst the top 50 games since the first publication of their magazine (50 years ago in April 1960).\n\nmagazine ranked this match amongst the top 50 games since the first publication of their magazine (50 years ago in April 1960). Rangers were in the final of the European Cup Winners Cup six days later against Bayern Munich in Nuremberg. They lost 1-0 and the city of Glasgow was denied a unique record.\n\nThe Lead-Up to the game\n\nThe game itself was played on a Thursday. But Celtic began their lead up to the game over a week before, immediately after their last Scottish league game against Kilmarnock. Celtic spent most of their time in Scotland after the last league game at Seamills training, relaxing and planning for the big game. As ever Jock Stein the master tactician closeted the players with schemes and tactics, so not only were they physically fit and prepared but they were also mentally sharp and ready.\n\nA report appeared in the Evening Times saying that a new Chicago football team were trying to entice Bobby Murdoch, Willie Wallace and Bobby Lennox to the USA with salaries around the £20,000 mark being offered. As all three had re-signed for the new season the story was thought to be a ringer.\n\nThe Celtic party of 20 left for Lisbon on Tuesday 23rd May by charter flight from Glasgow Airport. As well as the side that played Celtic also took just about everybody that had played during the season. This included sub Fallon, Young, Cattanach, Cushley (the subject of overtures from West Ham), McBride (on the road to recovery from knee surgery), Hughes, Brogan, O’Neill, and Charlie Gallacher.\n\nJock Stein was named British Manager of the Year for the second year in succession.\n\nOn the Monday prior to the game Inter found out that their ace striker Luis Suarez was out with a torn cartilage. He would not make the game.\n\nA training schedule was worked out on their arrival in Lisbon. The Players would train on the Estadio Nacional pitch on the Tuesday afternoon from 5:30pm. exactly 48 hours before the game. On Wednesday there would be a light training session with more talks on tactics and positions. Each team were allotted a time schedule on the pitch Inter were given from 10:00am and Jock Stein planned to bring the Bhoys to the ground to watch Inter training. In a bluff though, Herrera and Inter turned up early and when Celtic arrived at 10:30 Inter had finished and were gone. Instead Inter sat and watched Celtic train.\n\nThere was very much a feeling, both in Italy and in Portugal, that Inter were not a well-liked team. This came to a degree from their arrogance that they could and should win everything, but in Italy there was also a sense of something a little more underhand with referees and league planners. They were offhand with the Press and gave the feeling of being above their supporters. By contrast Jock Stein went out of his way to be accommodating and welcoming to the European Press and the Portugese, and this openness made Celtic friends.\n\nCeltic had already been invited to play Real Madrid in Alfredo di Stefano’s Testimonial. But whilst they were in Lisbon they received a further invitation from the Spanish Football Federation to take part in a four-team tournament in Malaga in August. Celtic were considering the option.\n\nThe Thursday was fully mapped out. The Celtic players were under orders not to leave their beds before 10am. They were under orders NOT to go out in the sun at the hotel before arrival of the coach in the afternoon to take them to the stadium.\n\nMany of the players’ wives travelled to watch the game leaving Glasgow early on Thursday morning. Over 20 charter flights left Glasgow airport between 1:30 and 9:30am to make the three to four hour flight to Lisbon.\n\nMatch Review\n\nCeltic had absolutely no chance of winning the European Cup according to outsiders. As Inter Milan had won the trophy twice before and had a glittering array of stars on the park, then Celtic were only there as cannon fodder. Big mistake, someone had forgot to tell big Jock and the rest of the Lisbon Lions.\n\nCeltic took to the field signing the Celtic song, to the amazement of the Milan players. Milan manager Herrera was furious when big Jock took the bench he had earmarked for himself, but his backside was planted and he was not moving.\n\nThe match kicked off and it was first blood to the Italians, Mazzola opened the scoring for Inter from a penalty award in the 7th minute, which to this day James Craig states was never a penalty as it was never a foul.\n\nCeltic followed the Stein script to the letter by firing in shot after shot until the Italian stronghold broke.Celtic got their just rewards, when Big Tam Gemmell blasted the ball into the Milan net from 20 yards, 1-1.\n\nWith 5 minutes left in the match it was Gemmell again, with a clever pass to Bobby Murdoch who drove the ball into the area, cannoning off Steve Chalmers and into the net for the winner. Celtic had ripped the script to shreds, 2-1.\n\nWith so little time left, the Inter Milan players could not do much more. They were run off their feet, and Celtic had made history and won the European Cup.\n\nJock Stein had been manager for a little over two seasons and had taken Celtic to the pinnacle of club success, the European Cup, the first British side to mount the summit.\n\nIt was a truly phenomenal achievement.\n\nMatch Details\n\nCeltic Team\n\nManager: Jock Stein\n\nRonnie Simpson ;\n\nJames Craig, Thomas Gemmell; Robert Murdoch, Billy McNeill (captain), John Clark;\n\nJimmy Johnstone, William Wallace, Stevie Chalmers, Bertie Auld, Robert Lennox\n\nReserve: John Fallon (goalkeeper)\n\nScorers:\n\n63′ Tommy Gemmell 1-1\n\n84′ Stevie Chalmers 2-1\n\nInternazionale (Inter Milan)\n\nManager: Helenio Herrera\n\nGiuliano Sarti; Tarcisio Burgnich, Giacinto Facchetti; Giancarlo Bedin, Aristide Guarneri, Armando Picchi (captain); Angelo Domenghini, Sandro Mazzola, Renato Cappellini, Mauro Bicicli, Mario Corso\n\nReserve: Ferdinando Miniussi (goalkeeper)\n\nScorers:\n\n6′ Sandro Mazzola 0-1\n\nLocation: Estádio Nacional, Vale do Jamor, near Lisbon\n\nDate: May 25, 1967\n\nAttendance: 45,000 spectators\n\nReferee: Kurt Tschenscher (Germany)\n\nStats\n\nInter\n\nCeltic\n\nGoal Attempts 5 42 Shots On Target 4 24 Shots Off Target 0 16 Fouls 20 20 Corners 0 10 Offside 2 7\n\nFull Game :\n\nHighlights:\n\nPictures\n\nLinks\n\nArticles\n\nPre-match Report\n\nMatch Reports\n\nStadium\n\nKStreet\n\nQuotes\n\nStein’s inspiring pre-match battle cry was: “If you’re ever going to win the European Cup, then this is the day and this is the place. But we don’t just want to win this cup, we want to do it playing good football – to make neutrals glad we’ve won it, glad to remember how we did it.”\n\nJock Stein before the game\n\n‘We thought it would be impossible. We had seen Real Madrid play and all those teams, Milan and all those and we thought they were magnificent.’\n\nBobby Lennox speaking in 2003 about the players assessment of success in 1967\n\n‘At that point we had no thoughts about winning the European Cup. In fact it was a big thrill for us to just go to Zurich because we had never been there.’\n\nBobby Lennox speaking in 2003 about Celtic’s opening tie of the European Cup 66/67.\n\n“Big Jock always said we’d win,” Jinky recalled last time we met, “but, to be honest, I thought we’d get a right gubbin’. I can see them yet standing alongside us in the tunnel waiting to go out on the pitch: Facchetti, Domenghini, Mazzola, Cappellini, all six-footers wi’ Ambre Solaire suntans, Colgate smiles and slicked-back hair. Each and every wan o’ them looked like yon film star Cesar Romero. They even smelt beautiful.\n\n“And there’s us midgets. Ah’ve got nae teeth, Bobby Lennox has’nae any either, and old Ronnie Simpson‘s got the full monty, nae teeth top and bottom. The Italians are starin’ doon at us and we’re grinnin’ back up at ’em wi’ our great, gumsy grins. We must have looked like something oot o’ the circus.”\n\nJimmy “Jinky” Johnstone\n\n“It (Winning the European Cup) might have been for Scotland, but it definitely wasn’t for Britain…it was for Celtic.”\n\nBilly McNeill on European Cup Final win of 1967 (1995)\n\n“I doubt whether they (Celtic) would beat us in the final at Lisbon. After all we need only one goal.”\n\nInter Milan manager Herera on facing Celtic in 1967 final\n\n\n\n“My time will come!”\n\nJock Stein to John Mackenzie of the Scottish Daily Express, prior to European Cup final 1967 after enduring snubs and mind games from opposite number Herrera (Inter Milan Manager)\n\nStein’s inspiring pre-match battle cry was: “If you’re ever going to win the European Cup, then this is the day and this is the place. But we don’t just want to win this cup, we want to do it playing good football – to make neutrals glad we’ve won it, glad to remember how we did it.”\n\nJock Stein before the game 25th March 1967\n\n“Tell me, the 9 o’clock and 10 o’clock mass are all ticket?”\n\nJock Stein joking to Hugh McIlvaney on the surge of Celtic fans coming to Lisbon to see the team play in the European Cup Final (retold by Hugh McIlvaney)\n\nItalian interviewer: “Who is your star player?”\n\nJock Stein: “Madam, I have eleven stars & their names are on the programme”\n\nJock Stein interview question (May 1967)\n\n“I am now going to tell him (Herrera) how Celtic will be the first team to bring the European Cup back to Britain. But it will not help him in any manner, shape or form: we are going to attack as we have never attacked before. Cups are not won by individuals, but by men in a team who put their club before personal prestige. I am lucky – I have the players who do just that for Celtic”\n\nJock Stein 23rd May 1967\n\n“We must play as if there are no more games, no more tomorrows…”\n\nJock Stein, shortly before kick off in Lisbon\n\n“We don’t just want to win the European Cup. We want to do it playing good football, to make neutrals glad we won it, pleased to remember how we did it.”\n\nJock Stein before the European Cup win in 1967\n\n“Coming here you’ve made history, go out and play to your capability and enjoy yourself”\n\nJock Stein to the players as they were to go out to play in the European Cup Final (1967)\n\n“We just knew, even after 15 minutes, that we were not going to keep them out. It was a miracle that we were still 1-0 up at half-time. Sometimes in those situations your confidence increases and you start to believe. Not on that day. Even in the dressing room at half-time we looked at each other and we knew we were doomed…\n\n(Following the equaliser) “I remember at one point Picchi turned to the goalkeeper and said ‘Giuliano, let it go, just let it go. Sooner or later they’ll get the winner’. I never thought I would hear those words. I never imagined my captain would tell our keeper to throw in the towel. But that shows how destroyed we were at that point. It’s as if we did not want to prolong the agony.”\n\nInter Milan defender Tarcisio Burgnich speaking about the game years later, from ‘Inverting The Pyramid – A History of Football Tactics’ by Jonathan Wilson (2008).\n\n“I shall be a Celtic supporter on Thursday.”\n\nScott Symon, Rangers manager, in an interview with Tuttosport. He predicted the Celtic victory (1967)\n\n\n\n“Once Inter scored, John Clark and I could have gone and sat in the stand.”\n\nBilly McNeill on the 1967 European Cup final\n\n“Celtic had proved that attacking football had a future, and it wasn’t just Shankly who was grateful for that.”\n\nFrom the seminal ‘Inverting The Pyramid – A History of Football Tactics’ by Jonathan Wilson (2008)\n\n“We were also angry with the manager because he had watched them play and hadn’t told us they were so good.”\n\nInter Milan legend Sandro Mazzola (2017)\n\nAfter winning the European Cup\n\n“We did it by playing football. Pure, beautiful, inventive football”.\n\nJock Stein\n\n“There is always a time to move on.”\n\nJock Stein\n\n“We can have no complaints. Celtic deserved their victory. We were beaten by Celtic’s force. Although we lost, the match was a victory for sport.”\n\nHelenio Herrera, Inter Milan manager after the 1967 European Cup Final\n\n“This team will never be beaten!”\n\nJock Stein to Bill Shankly on bus back, overheard by Bertie Auld\n\n“There is not a prouder man on God’s Earth than me at this moment. Winning was important, aye, but it was the way that we have won that has filled me with satisfaction. We did it by playing football. Pure, beautiful, inventive football. There was not a negative thought in our heads. Inter played right into our hands; it’s so sad to see such gifted players shackled by a system that restricts their freedom to think and to act. Our fans would never accept that sort of sterile approach. Our objective is always to try to win with style.”\n\nJock Stein, 1967\n\n“What a performance, what a performance”\n\nBill Shankley\n\n\n\nInterviewer : “What a wonderful season!”\n\nJock Stein: “Aye, but what do I do next year?”\n\n“I actually broke down in tears of joy that night, the first time in all my years in the game that I had cried. What a thrill it was to see young boys like Murdoch, McNeill, Johnstone, Gemmell, Clark and Lennox coming of age. What a thrill it was to see the club I had served all my life reach its pinnacle. My one ambition now is to live long enough to shed some more tears into that magnificent European Cup.”\n\nCeltic legend Jimmy McGrory on the victory (from A Lifetime in Paradise, 1975)\n\n“Words just cannot express this achievement after such a wonderful season.”\n\nRangers’ Scot Symon on Celtic’s European Cup win, 1967\n\n“We hope that the next hands on the European Cup are yours.”\n\nProphetic words from Jock Stein to Matt Busby in 1967, as he received the BBC Sports team of the year award form 1967 (Man U under Matt Busby ended up winning the European Cup in 1968)\n\n\n\n“Players come and go but some achievements live forever. The thing about the Lisbon Lions is we stick together for everything in the bad times and the good times, we’re always there.”\n\nJohn Clark on Lisbon Lions, the greatest of them all\n\n“For an assassination of Celtic’s character was now under-way by those, particularly outside Scotland but not exclusively so, who paid scant attention to the preliminaries before Montevideo and who in any case could not accept Celtic’s achievements as anything other than fortuitous.\n\n“One such was Peter Lorenzo, an English journalist and broadcaster who was known to have given Celtic some savaging in his reports and was upbraided by an equally famous Scottish journalist James Sanderson, or ‘ Solly ‘ as he was generally known, in the airport lounge before flying home from Montevideo when there was a delay for two hours due to fog. In keeping with the mayhem of the preceding day, Solly, who would have entered the ring as a bantamweight, decided to defend Celtic’s honour against the heavyweight Lorenzo’s bad-mouthing by delivering him a swift right hook to the jaw, which floored the Englishman. Although apologies were made for this misconduct, by other journalist’s, Solly had acted as many of his colleagues had felt like doing, though they opted to chose the old adage that the pen is mightier than the sword.”\n\nArchie MacPherson from his biography on Jock Stein\n\n“Rangers or Celtic? My first feeling was Celtic. When I was 13 years old I saw for the first time in my life a European Cup final – Inter against Celtic. That image is, even today, clear in my mind; that day, that game, Jimmy Johnston, Riva… I was so impressed. When I was in Mozambique, far away from football in Europe, I always remembered that day and that team. Especially because when they started to play in the national stadium in Portugal I thought Celtic were Sporting Lisbon because they dressed like Sporting.”\n\nCarlos Quieroz (Man U assistant manager in 2007)\n\n\n\n“To get a team from within a 25-mile radius of Glasgow going up against that Inter Milan, coming from a goal down and going on to win, it’s an unbelievable story. The only one that’s looked to match it since has been Leicester winning the Premier League last year. But although that’s a creditable second, it’s a good distant second.\n\n“It (Lisbon) was a frightening achievement. It was surreal when they won it but to think that 50 years have now passed – time just flies by.\n\n“The achievement will always be number one. And the way that team went about their work after Lisbon, and the success they enjoyed, was a huge credit to them and their attitude.”\n\nKenny Dalglish on the Lisbon Lions (2017)\n\n“The greatest feat in football. They set the pattern for a period, particularly when Manchester United the next year did it. From ’65 to ’67, if someone had written a book about it they would call it fiction. It was amazing.”\n\nAlex Ferguson (2017)\n\nThe Match in their own words\n\nBERNIE BOYLE was a 29-year-old draughtsman and a fanatical Celtic fan.\n\nSTEVIE CHALMERS was 30 years old and the Celtic centre-forward.\n\nJOHN CLARK was the 26-year-old Celtic left-half.\n\nJACKIE CONNOR was a 44-year-old bookmaker and friend of Jock Stein.\n\nBOBBY LENNOX was 23 years of age and played on the left wing for Celtic.\n\nBILLY McNEILL was an established Scottish international and was the 27-year-old captain of Celtic.\n\nJACK MARSHALL was a 43-year-old a wholesale confectioner. He first saw Celtic play in 1936 and even followed their fortunes from a POW camp in World War II.\n\nERNIE WILSON was a 25-year-old unemployed, soon-to-be-divorced Celtic fan.\n\nTHE BUILD UP\n\nBobby Lennox: “At the beginning of the season I don’t really think the European Cup was on our horizon at all to be fair. I think we thought we were just going to enjoy the adventure.”\n\nJohn Clark: “Once we got by the first stage of the European Cup people started looking up and saying, ‘There’s a team in Scotland that seems to be doing well’. Every time we progressed to the next stage we got more confident about ourselves.”\n\nJackie Connor: “At that time the players mixed with the fans. Everybody knew Bertie Auld, big ‘Tam’ Gemmell, wee Jimmy Johnstone. They were OUR team and every one of them was friendly with the fans.”\n\nBilly McNeill: “We were all very local boys. Bobby Lennox had come the farthest and that was only 30 miles away on Ayrshire coast. The rest of us lived virtually next door to the ground. Having come through the ranks at Celtic without any real success was the thing that stimulated that group of players. We were very determined, very positive in our attitude to the game. When Big Jock had come back to Celtic in 1965 he realised the potential and really got us playing to our full.”\n\nErnie Wilson: “When Celtic got through we just couldn’t believe that our team was going to play in the European Cup final. Even if we didn’t win, the thought of just being there was just terrific. Even friends who were Rangers supporters were wishing me luck when they heard that I was going. They told me not to come back to Glasgow without the trophy.”\n\nJackie Connor: “Who had ever heard of a team of local boys from Glasgow getting to the European Cup final. Everyone thought that it would be an impossible feat to beat Inter Milan. They were the top team at the time and Helenio Herrera was reckoned the best manager in the world. It was fully understood that if they scored a goal you just packed your bags and went home. They were the unbeatables.”\n\nBobby Lennox: “I think they had won the European Cup twice in the previous three years and they had also won the world club championship – they had a lot of good players.”\n\nBernie Boyle: “Everybody was very excited, no doubt about it. If you look at pictures of people leaving for this game, they were going dressed in suits and collars and ties. A workingman in Glasgow wouldn’t wear a collar and tie unless he was either going to church on Sunday or going to something special like a wedding or a funeral. These guys went to that game dressed in collars and ties because it really was something special.”\n\nJackie Connor: “There had been nothing seen like the contingent that went out to Lisbon. Celtic fans just took over all forms of transport and a lot of guys even set off in old bangers and you’d wonder how they were going to get out of London Road, never mind get to Lisbon.”\n\nErnie Wilson: “I saw on the news that the fans were leaving by car and coach and that’s when it really got to me that I had to be there. I would have done anything bar murder or rob a bank to see my team play in the European Cup final. But I’d just been laid off work from my job as a fireman on the old steam engines and I just couldn’t raise the money to go, so I gave my scarf to a friend, John McCabe, so that if I wasn’t there, at least my scarf got there.”\n\nBernie Boyle: “I had been due to travel out on a charter flight that a local pub had been running but they overbooked the plane and I was one of the people they let down. I phoned about trying to find a spare seat on a plane but with no success I drove to Glasgow Airport and explained my predicament. I must have been sat there for an hour when I was rushed onto an aircraft, where I found myself seated next to my boyhood hero, Charlie Tully, who had played for Celtic for many years. I arrived in Lisbon at six o’clock the next morning.”\n\nErnie Wilson: “I was sitting in my house a week ahead of the game, desperately wanting to go when I had a brainstorm. I decided to sell my house. I told my wife that I was moving in with my mother and got managed to get a deposit on the house and this got me to Lisbon. When I came back I still had to go through with the deal to sell and needless to say it didn’t go down very well with my wife. It had been a kind of a trial separation, but it was looking liked I would be staying on for the kids. Of course when I broke the news of what I’d done, that was goodbye to my marriage. It was worth every penny. I’m sure my family didn’t see it like that at the time but I had to get there.”\n\nBilly McNeill: “For about four or five days before we left Glasgow for Lisbon we had been down at Seamill, which was a hotel down the Ayrshire coast that we would use for training. It was a relaxed training session and during the course of those four or five days we started to hear the names of the Inter Milan players and how the ‘Big Man’ thought they would set themselves up.”\n\nJohn Clark: “Jock Stein had been invited out to Milan a few years earlier to watch Herrera’s methods of training. Little did he know at the time that he would be facing Herrera in the European Cup final maybe two years hence.”\n\nBobby Lennox: “We knew about Facchetti and all these guys, they were great players – Mazzola, Bicicli, Burgnich, they were all top men at the time. They were a team of internationals.”\n\nJackie Connor: “I was a bookmaker at the time and I’d made Celtic favourites to win the final, which was ridiculous. I took out an advert in the newspaper – everyone thought I was off my head but it got me plenty of publicity.”\n\nBernie Boyle: “As fans we weren’t afraid of Inter because we knew little or nothing about European football. For that particular game I would say the vast majority of fans stepped on board an aeroplane for the first time in their lives.”\n\nLISBON\n\nBilly McNeill: “We went to Lisbon early on the Tuesday morning and the game was on the Thursday. We did a reasonable training session on the Tuesday evening and after the game Jock announced the team at a press conference – two days before the game. I think that was to let Inter see that we weren’t afraid of them.\n\nStevie Chalmers: “Jock was always a move in front of everybody else and he would have done that to upset Herrera.”\n\nBobby Lennox: “The team was exactly as had been expected. That team had played in the second leg of the semi-final and it had played the last couple of league games. If there had been a change in the team it would have been a surprise.”\n\nBobby Lennox: “Herrera was trying to get the Portuguese to support Inter Milan but I think most of them came for the underdogs and supported us, which was great for us, but we had a massive support with us anyway.”\n\nJohn Clark: “We were the underdogs by a mile, but we were a team full of confidence in our own ability and teamwork, plus we had an excellent manager who prompted us all the time and made sure our feet were on the ground. We concentrated a lot on what we were asked to do and we did it thoroughly.”\n\nJackie Connor: “Celtic fans knew that they had a chance because the team didn’t play like everybody else. The backs – Jim Craig and big ‘Tam’ Gemmell – were actually forwards, which had never been seen before. They were up beside the wingers Jimmy Johnstone and Bobby Lennox every game. Whenever Gemmell or Craig got the ball they were at liberty to go up the pitch and that baffled other teams because they couldn’t work out how these guys got the freedom on the park.”\n\nBilly McNeill: “On the Wednesday morning we did a training session at the stadium. Inter Milan switched their training so they could sit and watch us, but that only helped to make us more determined.”\n\nStevie Chalmers: “We thought they were having a good laugh at us, that we were a nothing team. I honestly believe they thought they’d only to turn up and they’d win. They sat there laughing, so the boss just said to us, ‘Okay, we’ll show them very little, we’ll just muck about’.”\n\nBobby Lennox: “Big Jock had everybody playing in different positions. We had as much fun watching them as they did watching us. Jock said, ‘You go and play left-back Bobby and Tommy Gemmell will go and play centre-forward and Billy McNeill will go to the sidelines’. At that session nobody played where they would have normally. The cat and mouse stuff had started.”\n\nJohn Clark: “Jock was a bit of a psychologist that way. The Italians were overconfident, but these guys were the superstars of the football world at the time.”\n\nBobby Lennox: “We stayed in a hotel called the Palácio in Estoril and it was absolutely wonderful. It was a beautiful hotel set in lovely gardens with a fabulous swimming pool, which we didn’t use because Big Jock wanted to keep us out of the sun. The build up was great and everything that could have been done was done for us.”\n\nJackie Connor: “I was very friendly with Jock Stein and I knew a lot of the players. We would often go to training and spend time with the team at their hotel when they were playing away, but for the Inter Milan game they were kept more to themselves than usual. Any other game they were free to do more or less what they liked, but for that game Jock didn’t even allow them to take their strips of at the hotel in case they got sunburnt.”\n\nBobby Lennox: “I shared a room with Jimmy Johnstone as usual. Although he was a great player he was he was a bit of a worrier. He’d be saying, ‘But they’ve got Facchetti and they’ve got Mazzola’. I’d say, ‘But we’ve got you and Billy and Tommy Gemmell, we’ve got great players in our team too’.”\n\nBilly McNeill: “We were so relaxed on the night before the game. There was a lad called Brodie Lennox who had a country club not far from the hotel and he’d invited us to his house. He put on a meal for us and we watched England play against Spain on his television. We walked back the hotel afterwards.\n\nJohn Clark: “On the way back the trainer Neil Mochan took us on a short cut but it came to a dead end and we had to climb over a fence. On the eve of the European Cup final we were climbing over a fence to get back onto the road again.”\n\nBobby Lennox: “When we got back to the hotel we had a wee cup of tea, as usual. There were be a few nerves but there were more nerves the next day.”\n\nTHE DAY OF THE GAME\n\nStevie Chalmers: “It was a Holy Day Of Obligation and you’re supposed to go to mass.”\n\nJohn Clark: “A friend of ours, Father Bertie O’Reagan, was in Lisbon and when Jock Stein found out it was a religious day he asked him if he would he say Mass for the players who had to go. We’d been brought up in the religious way and you always kept to your rules. It worked out for us and God looked after us.”\n\nStevie Chalmers: “There were four non-Catholics in the team – Ronnie Simpson, Tommy Gemmell, Willie Wallace and Bertie Auld – and they obviously didn’t go to church, but they didn’t think anything of it because it often happened when we were playing away and they would just make a joke about it. But it wasn’t a team of sectarianism in any way, we were all working together.”\n\nBilly McNeill: “It was important because a lot of the lads were good living and religion was an important aspect of their lives, but it was also good because it ate into the morning and it gave us something to concentrate on.”\n\nBernie Boyle: “The majority of Celtic fans were Catholics, so the chapels were packed with fans and I think it helped win over the Lisbon people. The locals were expecting these cold-hearted Scots and there we were, not only singing and dancing in the main square and showing off our colours, but attending Mass too.”\n\nErnie Wilson: “It was the first time I’d been abroad and when I arrived in Lisbon all the Celtic fans were gathered in the plaza in the city centre, but who was the first face I saw but John McCabe – and he still had my scarf wrapped round his neck. So I ended up at the game with my scarf.”\n\nBobby Lennox: “The kick-off was at five o’clock so when we got back to the hotel we had our lunch and got away to our beds and spent the afternoon resting.”\n\nBobby Lennox: “We had the team-talk at the hotel. Jock just said, ‘You know it’s been a wonderful season and this can be a season that we can all look back on with great fondness. It can be the best season of our careers’.”\n\nJohn Clark: “He told us was that we had a chance to make history, that the opportunity was there and the platform was there for each and every one of us to make history.”\n\nBobby Lennox: “On the way to the stadium I think the coach driver went the wrong way, but we were at the back of the bus singing songs so we wouldn’t have particularly noticed anyway.”\n\nBilly McNeill: “The stadium was set in a national park and it was chaos around the ground, but we got there eventually and I think sometimes things like take your mind off the game and you can relax.”\n\nBobby Lennox: “We arrived 50 minutes before kick-off, which suited us perfectly. We came into the stadium, walked up the tunnel and onto the park. The Celtic support were already in, thousands of them. We waved to the supporters and then went back into the dressing room. There was no time to sit about and worry or get too nervous.”\n\nJack Marshall: “I flew in just for in time for the match. Approaching the ground we were jammed in the traffic and getting held back, so I jumped out of the mini bus coming to the stadium and I held up the traffic so we wouldn’t miss the match. We got us in just in time. It wasn’t a big ground but it was marvellous, with beautiful surroundings and with trees along one side.”\n\nBobby Lennox: “When I first saw the stadium I thought it was spectacular. It was three sided with a wee press box along one side and I could picture Billy going up to collect the cup at the top of the podium.”\n\nTHE GAME\n\nBobby Lennox: “Jock could usually be like anything with the players, depending on what side of the bed he had got out of, but before that game he was wonderful. He got us all at ease and talked to us all before the game and he was very calm and relaxed. We had been given the bench in the shade and Inter were given the bench in the sun and when we went out they were sitting on our bench. Big Jock had to threaten them to move them on.”\n\nBilly McNeill: “We came out of the dressing room and through a courtyard, before going into a long tunnel. They held us there for a while. I remember turning round and the Italian team were looking absolutely magnificent. It’s quite an inspiring strip, the blue and black stripes, the black shorts, black stockings, the tanned legs, the athleticism of their team and the handsome Italian faces. Then out of nowhere Bertie Auld, a real Glaswegian character, started singing ‘The Celtic Song’ and we all joined in. You should have seen the expressions on the faces of the Italians.”\n\nJohn Clark: “They must have got the shock of their lives – how do you deal with a team singing a football song seconds before they walk out to play in a big game.”\n\nBobby Lennox: “The next thing we were up the steps and suddenly the green and white scarves went up from the big Celtic support. It was wonderful.”\n\nBilly McNeill: “The biggest thing I had to do as captain was in illustrating to the team that we had nothing to fear. I had to swap pennants with their captain, Picchi before the kick-off. We exchanged words but I didn’t have any Italian and I don’t think he had any English, but you always manage to get through.”\n\nBobby Lennox: “Right after kick-off Bicicli ran past me and planted a kiss on the side of my cheek and then just carried on. I guess he was kind of excited. It’s different if you score a goal and your team-mates plant one on your cheek but that was strange.”\n\nStevie Chalmers: “In those days the Italians played very defensively and they marked man-to-man. One of our plans for the game was for our forwards to take their defenders to stupid positions because they were going to follow us, leaving spaces for our fullbacks to attack. Left-back Tommy Gemmell had six or seven shots on goal inside six or seven minutes, really good shots. We played the game an awful lot quicker than the Italians. Now they were all superb players but they were not used to people coming at them, which is what we did.”\n\nBernie Boyle: “There was a kind of calmness amongst the fans before the game that was shattered in the seventh minute when the penalty was given.”\n\nBilly McNeill: “With catenaccio in vogue then, the worst thing we wanted to do was concede an early goal. I don’t know what happened to Jim Craig because we pushed out to keep the game as tight as we could and all of a sudden Jim was five yards behind us. Although he swears he didn’t bring Cappellini down, it looks now as though he did.”\n\nBobby Lennox: “With just seven minutes gone I thought it was never a penalty, but when you look at it now it was. At the time, though, you think you’ve been hard done by.”\n\nErnie Wilson: “There was a sinking feeling among the fans when Inter scored, but a chorus of ‘Hail, hail’ went up and the whole crowd just started to lift themselves again and we knew it was just a matter of time until Celtic were going to score. There was just wave after wave of attack as they hit the woodwork three times. I don’t know if Sarti ever had a game like it, but I’d certainly never seen a goalkeeping display of the like in my life.”\n\nBobby Lennox: “Before the game we’d heard that Sarti, the goalkeeper, was the weak link in the Inter team but he was absolutely great for them.”\n\nJohn Clark: “Jock had told us that Inter were a team who would want us to come to them all the time and the more you come to them, the more you’ve got to be on your toes, because they liked to hit you on the break. When they got the goal with the penalty kick, that’s more or less what they did, but they didn’t realise that we could come at them all night.”\n\nJackie Connor: “Celtic were playing the game like they were down at Barrowfields where they trained. They had no anxieties at all.”\n\nBilly McNeill: “At half-time Jock Stein calmed us down just a little bit because we all thought that the referee had done us in just a little bit by the penalty kick. He hadn’t as it happened, but I think it suited Big Jock that he could have a wee go at us. He said, ‘Never mind concentrating on what the referee had done, we can’t do anything about that, it’s what we’re gonna do in the second half that’s important’.”\n\nJack Marshall: “I was with this feller who was bursting for the toilet at half-time. Inside the ground there was lots of shrubbery and trees. He went in there and the next minute he came out with two policemen with their guns out and they were going to arrest him.”\n\nJackie Connor: “Big Jock had a theory and I know this from talking to him. They had no chance of scoring against that mob if they were in the Inter penalty box, so they had to get it ball outside the box – and that’s where our goal came from.”\n\nBobby Lennox: “The two full backs had got up the park at the same time, which shouldn’t really have happened, but just shows how much we were on top.”\n\nJackie Connor: “The ball was passed back from Craig to Tommy Gemmell and the next thing the ball was in the back of the net, through about eight Milan players. The place erupted then.”\n\nBernie Boyle: “When Tommy Gemmell’s goal went in it was probably one of the most beautiful goals that you’ll ever see in a European Cup final. I’ve never hugged so many people in my life.”\n\nJohn Clark: “It was a thunderous shot from 25 yards out. It was unstoppable.”\n\nErnie Wilson: “I jumped up and a Portuguese chap in a Celtic scarf got hold of me and he was shouting, ‘Celtic, Celtic’. I was on cloud nine.”\n\nBobby Lennox: “When the ball went in we all jumped on top of big Tommy. It was relief and pleasure – all the emotions at one time. We know when that went in that we were going to win the match.”\n\nStevie Chalmers: “If we’d have got beaten we’d have got credit for going there and putting up a good performance, but I didn’t feel as if we were in awe of these people – we really took the game to them and let them worry about it.”\n\nJohn Clark: “In the 83rd minute Bobby Murdoch hit a tremendous shot across goal. Whether it was going in or not I don’t know, but Stevie Chalmers prodded it in and made it 2-1 for us.”\n\nJackie Connor: “I was in ecstasy. I was jumping up and down – I think I nearly squeezed my wife to death.”Stevie Chalmers: “People say that was quite lucky – but Jock Stein had us working on that move at least three times a week.”\n\nBobby Lennox: “Stevie must have done that a thousand times in training – the ball came through and he pushed it in the corner of the net.”\n\nErnie Wilson: “I think I burst out crying. We were going to be European Champions, the first British team to do it. The way Celtic were playing they probably could have moved up the park and scored a third goal, but they just played it about. It was wonderful.”\n\nBilly McNeill: “After we scored the second goal I was convinced that we would be up against it, so I said to John Clark, ‘This is when we’ve got to win this, we’ve got to play’, but they didn’t. I think they were a spent force. They’d underestimated the ability that we had in that side and I think they also underestimated our fitness. The conditions were ideal for an Italian team, but we were running and chasing and hunting right to the last minute of the game. By the end of the game they were a much more tired team than we were.”\n\nErnie Wilson: “I remember Jimmy Johnstone running down time at the end of the game and he took the ball for a walk. Three Inter players came round him and were desperate to get the ball back. Jimmy gave a wee drop of one shoulder and then a wee drop of the other – then he was away. He left the three of them for dead.”\n\nBobby Lennox: “I’ll never forget the final whistle – I was in the centre circle near John Clark and the two of us jumped into each others arms and jumped about deliriously. ”\n\nJohn Clark: “Bobby Lennox and myself were hugging each other on the halfway line and that’s the last I can remember about the final whistle because then the crowd broke onto the field.”\n\nBernie Boyle: “After the equalising goal I had moved down, along with hundreds of others, to this big wall that ran around the pitch. On the other side of the wall there was a small moat and armed Portuguese police stood facing us. When the final whistle went a few fans jumped over on to the grass. It was a trickle to start with – I watched a man who was the same age as my father jumping over and thought if he can do it, I can too. It was the only time in my life I ran onto the park.”\n\nJack Marshall: “A lot of the fans fell into the moat and had to be pulled out. By the time they got to the park they were kissing the grass, doing the highland fling and cutting bits of the grass out. I just sat and laughed at all these characters going cuckoo.”\n\nBilly McNeill: “A few of the boys had to make a mad dash to Ronnie Simpson’s goal – the ones with false teeth had kept them in Ronnie Simpson’s cap in the goal so they could put them in quickly for the presentation, but Ronnie forgot to bring them when he ran up the pitch to join us. Thankfully they were still there. It was astonishing that no-one had taken the bonnet as a souvenir.”\n\nStevie Chalmers: “I changed jerseys with Bedin, who had been marking me. Then I tried to get to the dressing room. By that time there were thousands of Celtic supporters on the park and it was very difficult to get off because the people were wanting to take your jerseys, your boots, anything as souvenirs.”\n\nErnie Wilson: “I jumped onto the park and headed for what players I could see. I got hold of big ‘Tam’ Gemmell and hugged him and I chased after Bobby Lennox. I feel sorry for the players, as they were getting strips ripped off them. I saw Billy McNeill and the scratches that man had on his back were unbelievable, just from people trying to get the strip off him. Two big heavy men were shielding him and trying to get him into the tunnel.”\n\nBobby Lennox: “Once the crowd started to get on the park we all scattered back into the tunnel and the changing room. I think it was Burgnich that I met in the tunnel and the two of us swapped strips.”\n\nStevie Chalmers: “It was chaos in the dressing room. It was mostly reporters and friends of the manager. Bill Shankly was there and he congratulated everybody and said what a great man Jock was.”\n\nErnie Wilson: “There was an announcement, first in English, then in Italian and Portuguese, saying that the presentation of the trophy would be delayed.”\n\nBilly McNeill: “I remember Big Jock coming to me and saying that I and myself and the assistant manager Sean Fallon had to go and get the trophy. At the time I hadn’t a clue what he was talking about because we were back in the dressing room and we were jumping up and down for joy.”\n\nBernie Boyle: “It was only Billy McNeill who was taken through the crowd up to this huge balcony with pillars on either side of him. I think the fact that the Celtic fans had invaded the pitch then prevented the team coming out again.”\n\nBobby Lennox: “We didn’t know the cup wasn’t there or that Billy wasn’t there. The dressing room was chaos.”\n\nErnie Wilson: “We stood in a massive crowd and waited for the trophy to come up. We saw the green and white strip coming out and it was Billy and when he raised it I don’t think there was a dry eye in the house. I can still see him now – that big smile of his when he held it up.”\n\nBilly McNeill: “Having seen the footage of the presentation so often I know what happened, but I don’t have any distinct recollection of it. The Portuguese police didn’t think it was safe for us to go back across the pitch so they decided to take us back to the dressing rooms around the outside of the stadium in a police car. But before they took us there it seemed as though every policeman on duty had their photo taken with the cup. Not with us, but with the cup.”\n\nStevie Chalmers: “Certainly it would have been nice if we’d had a lap of honour but thousands of these people came from Glasgow and some of them left themselves skint for years. They would all want to celebrate at the same time as us – and with us. So although we didn’t get a lap of honour, the fans at least got their money’s worth when they got onto the park.”\n\nErnie Wilson: “I was on the park a good hour after the game, kissing the grass. I ran into the net where the goals were scored and I was swinging on the crossbar. If my family had seen me they would have got me locked up.”\n\nBobby Lennox: “Later on that evening when we were sitting in the restaurant, when Billy came in with a box and gave us all our medals. It’s probably the worst presentation of medals in the history of the European Cup.”\n\nHOMEWARD BOUND\n\nBernie Boyle: “We took the coaches back into Lisbon. I think we had time for a couple of beers and then it was out to the airport. I think I was home at one o’clock and in my bed. My wife often says I was home quicker from Lisbon than I’d ever been from Aberdeen.”\n\nErnie Wilson: “When the busses left for the airport the locals were lined up on the streets clapping us at one or two in the morning – mothers, kids, grannies. Some of us hadn’t slept for two days but our adrenaline kept us going. I threw my Celtic shirt into the crowd. We owed the locals of Lisbon a big thank you because they were terrific.”\n\nJack Marshall: “It was different three years later when we got to the European Cup final again. I went to Milan to see Celtic play Feyenoord and that time locals didn’t like us at all because we’d beaten Inter in Lisbon.”\n\nErnie Wilson: “I’ve read stories that some fans ended up staying in Lisbon and getting jobs. There were definitely lots of fans who lost their passports and there were delays. Hundreds of passports were on laid out on tables at the airport waiting for people to claim them.”\n\nJackie Connor: “I think some of the planes flew out with maybe a dozen people missing.”\n\nErnie Wilson: “At the airport we heard a roar as the Celtic team arrived with their wives. Jock Stein made all the players come out and they were singing ‘Hail, Hail’ with the fans. One of the fans shouted to Tommy Gemmell ‘How are you doing Tam?’ and I remember him saying ‘Top of the world’.”\n\nBernie Boyle: “The day I came home I dressed my car up with flags and took my brother and two sons to the airport to see the team come home. Thankfully a policeman who had a leaning for Celtic told me to go round to the back entrance as that was the way the team were coming out and I followed right behind them all the way through Glasgow and back to the ground. When we were just about to turn into Celtic Park a police sergeant on horseback came galloping after me, so I abandoned the car. A friend of mine behind the railings shouted ‘Bernie, you made good time back’. He thought I’d driven all the way back from Lisbon to Celtic Park!”\n\nJohn Clark: “The best thing that happened was when we came back to Celtic Park – that made up for not getting the cup presented the right way. The streets were lined with people all the way from the centre of Glasgow to Celtic Park. We were put on the back of a lorry and we went round the track three or four times, getting our lap of honour.”\n\nBernie Boyle: “When I got home the following day I went round to visit my dad. In his lapel he had a sprig of white heather with a green, white and gold ribbon – he was a very committed Celtic man, but that was the first and only time I saw him with colours on. He gave me a big hug and he said ‘Were you on the pitch?’. I wondered whether I should tell him because he was kind of strict, but I said, ‘Yes, I was Dad’. He said, ‘I thought you would be, I was on it myself looking for you’. I could not believe that my father had done such a thing, but that just shows you that everybody was just caught up in the euphoria of that occasion.”\n\nErnie Wilson: “Maybe I shouldn’t have but I had dug up a big bit of the pitch and brought it home in my bag. I took it in the pub the next day but everybody grabbed big chunks of this turf and I ended up with just a wee spot that wouldn’t fit in a box of matches. My mum put it in a plant pot in the window and she said, ‘It’s always there if you need it’.”\n\nJackie Connor: “After that game for the first time ever I sent a letter to Big Jock Stein and thanked him for everything he had done for Celtic.”\n\nBobby Lennox: “Winning the European Cup was the making of the club. After that everyone knew about Celtic. We even beat Real Madrid two week later. They’d won it the previous year and they kept saying they were the real champions, but we went a beat them 1-0 on their own patch in front of 135,000 people.”\n\nBilly McNeill: “It was Di Stefano’s testimonial. It was a fantastic evening and the game was very competitive. Bobby Lennox scored the goal for us – and afterwards there could be no doubt that we could be called true European Champions.\n\nBobby Lennox: “That just proved to Europe that we were the best team. We entered five tournaments that year and we won all five of them.”"}, {"url": "https://www.theguardian.com/football/1967/may/25/championsleague.sport", "page_content": "Celtic flags fly triumphantly in the evening shadows here today. At last, like the World Cup, the European Cup comes home to Britain. Celtic are the new champions and worthy ones at that, having beaten Inter Milan 2-1 in the final after a remarkable match; by sheer determination when all seemed stacked against them, when frustration and defeat stared them straight in the eye.\n\nThere is no individual hero. Every man gave his all. No other British club has ever reached the final, let alone won Europe's most coveted prize. And as the shadows lengthened just five minutes away from extra time Celtic scored the winning goal. It seemed the final minutes would never pass for their 7,000 supporters, who had travelled so far and so hopefully. It was like Wembley all over again after the Scottish victory against England. Jubilation was everywhere as the supporters cavorted around their heroes.\n\nBut hope had been slim for so long. Not for an hour could the despairing Scots break the defensive wall Inter built round their goal. Inter have done it so often, so successfully, it seemed Celtic, for all Johnstone's cunning and Murdoch's support of the forwards, had not the key to prise apart the tall Facchetti from his cohorts, Burgnich, Guarneri and Bedin. But the assistance of the backs and particularly the shooting of Gemmell from outside the wall was rewarded in the end.\n\nFor all the great expectation of high tension, no one could have expected it to erupt so sharply or suddenly. Within the first six minutes Celtic were a goal down to a penalty. It came as Craig fouled Cappellini and was scored by Mazzola, for whom this must have been an emotional experience for it was here his father played his last match before he died so tragically in the air crash afterwards. Inter, for all their leisurely approach, snapped into action near goal with surprising skill and speed and only seconds before the goal Cappellini sprinted down the wing and Mazzolla's low header glanced off Simpson's knees.\n\nFrom that disastrous goal, however, Celtic gained in strength. Back came Inter into the old familiar pattern of massed defence behind which stalked Sarti plucking the high shots out of the air. There was no way through for Celtic. There was no way over the wall either. It had to be from outside the wall in the hope of a chink being made that success would come. Celtic waited so long. Incident piled upon incident, thrill upon thrill. Auld hit the crossbar, a low left from Johnstone was smothered by Sarti, who in the next minute tipped a header from Johnstone over the crossbar.\n\nNine men were pulled back to stem Celtic. Inter were well content and determined to hold what they had. It demanded defence of the highest order against an attack as consistent and resolute as Celtic's. Sarti just managed to smother one free kick which Gemmell deflected off this wall of defence. Later, lobbing rather speculatively, Gemmell's shot his the bar as the evening sun glinted in Sarti's eyes. And all the while Inter had not threatened again. And when they needed to come from their defensive box they could not.\n\nGemmell claimed the goal which brought Celtic level after an hour, and what a beautifully taken goal it was, coming from the clever understanding of Murdoch and Craig. This time the groping fingers of Sarti could not touch Gemmell's fierce, first time shot. With the goal cam renewed hope for in spite of Inter's stubborn defence, Celtic were back with a real chance. It did not come until five minutes from time and then Chalmers was promptly submerged by his jubilant colleagues after he had scored the most crucial goal of his career. And so on to the rejoicing."}, {"url": "https://www.bbc.co.uk/scotland/sportscotland/asportingnation/article/0045/", "page_content": "© SCRAN\n\nOn Thursday 25 May 1967, Scottish Football reached a pinnacle of success in Europe which has yet to be surpassed in the modern era, when Glasgow Celtic Football Club, under the leadership of manager Jock Stein defeated Internacionale of Milan 2-1 at the Estadio Nacionale in Lisbon to win the European Cup.\n\nLess than 24 hours earlier, Kilmarnock FC exited the semi-finals of the Uefa Cup (known then as the Fair Cities Cup), when Leeds United defeated them 4-2 at Rugby Park, with both sides having played out a goalless encounter in the first leg at Elland Road on Wednesday 19 May.\n\nDespite the disappointment of failing to become the first Scottish side to reach the final of a major European trophy, Malky McDonald's Killie managed to defeat Royal Antwerp of Belgium 8-2 on aggregate and La Gantoise of Ghent 3-1 along the way, before Don Revie's men booked their ultimately doomed place in the finals against Dynamo Zagreb.\n\nSix days later, on Wednesday 31 May, Rangers failed to overcome Bayern Munich in the final of the European Cup Winners Cup in Nuremberg, with the Franz Roth notching up the only goal of a dull match during extra-time.\n\n1967 was indeed an exciting time for Scottish football, but it was Celtic who eventually lasted the distance in Europe, when an officially-recorded crowd of over 45,000 crammed into the Portuguese national stadium to witness the famous Glasgow side wrestle the greatest prize in club football from the preserve of Europe's Latin sides, for the first time in the history of the tournament.\n\nBefore kick-off, few neutrals believed Celtic were capable of overcoming the negative defensive tactics of Helenio Hererra's outfit, who had successfully dismissed such giants as CSKA Sofia, Real Madrid and Torpedo Moscow en route to the final. But Stein's side were galvanised by an overwhelming self-belief in their own invincibility, and their football was both exciting and attack-based, drawing from the great Hungarian sides of the 1960s and pioneering the concept of 'total football', many years in advance of the Dutch masters.\n\n© SNSpix\n\nAccording to the Celtic players, Stein's instructions ahead of the game were simple: go out enjoy yourself; but his plan almost went off the rails in the opening moments when Jim Craig felled Cappellini and Mazolla netted the resulting penalty, sending Ronnie Simpson the wrong way with barely eight minutes on the clock and giving Milan a vital early lead.\n\nThe opener seemed nothing more than a minor diversion for the Glasgow side, as Stein pressed for his players to attack and lay siege to the Italian goalmouth. Milan reverted to their famous defensive pattern and successfully thwarted Celtic's every effort on goal, but not without the help of some miraculous saves from goalkeeper Sarti and a fair amount of good fortune from the woodwork.\n\nWhen half-time arrived, the scoreline remained 1-0 in favour of Inter, but Stein knew that Celtic were capable of scoring from any position on the pitch, and shortly after the break their much-needed equaliser arrived - from the boot of Celtic's full-back, Tommy Gemmell. On 65 minutes, the adventurous defender linked up with Jim Craig and Bobby Murdoch to send home an unstoppable shot and level the score. Almost an hour had passed since Mazolla had handed Inter the lead, but Celtic had finally found the inspiration they needed to take full control of the game and press on for victory."}, {"url": "https://www.irishtimes.com/sport/soccer/what-became-of-celtic-s-lisbon-lions-1.3869157", "page_content": "Celtic became the first British team to win the European Cup on May 25th, 1967.\n\nJock Stein’s ‘Lisbon Lions’ beat Inter Milan 2-1 at the Estadio Nacional in the Portuguese capital.\n\nHere we remember the trailblazing side which made history and takes a look at what became of the players, all of whom were born within a 30-mile radius of Glasgow.\n\nRonnie Simpson\n\nREAD MORE\n\nThe goalkeeper enjoyed one of the most spectacular Indian summers in football after joining Celtic in 1964 from Hibernian, who were then managed by Stein. Signed as understudy to John Fallon, he forced his way into the first team and made his Scotland debut aged 36 in the 3-2 Wembley win over world champions England. Six weeks later he was a European Cup winner. After hanging up his gloves in 1970, he had a spell as Hamilton boss and served as a local councillor in Edinburgh. Glasgow-born Simpson died of a heart attack in 2004.\n\nJim Craig\n\nThe right-back began the 1964-65 season playing for Glasgow University while studying to become a dentist. He ended it in the Celtic reserves and he soon made the Parkhead club’s first team, becoming a regular fixture in time for Lisbon glory. Craig, who went to primary school in the shadow of Ibrox, later became a dentist and the 75-year-old is still a regular at Celtic Park, often helping with commentary duties for the club’s TV channel as well as his own on-line blog.\n\nTommy Gemmell\n\nMotherwell-born Gemmell signed for Celtic on the same night as Jimmy Johnstone in October 1961 and the pair caught the same bus back to Lanarkshire. The attacking left-back scored the equaliser against Inter and also netted in the 1970 European Cup final defeat by Feyenoord before leaving the club for Nottingham Forest a year later. He played for and managed Dundee before running a hotel and then becoming a financial adviser, having a brief stint as Albion Rovers manager too. He remained a familiar figure at Parkhead, but died in March 2017 following a long illness.\n\nBilly McNeill\n\nAnother Lanarkshire-born defender, the centre-back went down in history in Lisbon as the first British player to lift the European Cup. The Lisbon Lions skipper spent 18 years at Celtic as a player — making a club-record 790 appearances — and had two spells as manager, where his greatest achievement was guiding the club to the double in their centenary season, 1987-88. Nicknamed Cesar after actor Cesar Romero, who played the getaway driver in the original Ocean's Eleven, because he was one of the few players to own a car in the early 1960s. McNeill also managed Aberdeen, Manchester City and Aston Villa and later worked in television. McNeill's family confirmed during 2017 that he had been diagnosed with dementia. The former Celtic captain died in April 2019, aged 79.\n\nJohn Clark\n\nNicknamed ‘The Brush’, Clark was the sweeper behind McNeill — both men were born in Bellshill. He first joined Celtic in 1958 and the 78-year-old has continued his close relationship with the club, having worked at the Lennoxtown training ground and also on matchdays as the first-team kit man. Clark managed Cowdenbeath, Stranraer and Clyde before returning to Celtic, where he was a regular in the dugout until very recently.\n\nBobby Murdoch\n\nDescribed by Stein as “just about the best player I had as manager”, Murdoch’s passing ability was a key feature of the Lions and his nickname ‘Chopper’ also signified his hard side. He spent 11 seasons at Celtic Park before playing for and later managing Middlesbrough. Murdoch, who was from Rutherglen just down the road from Parkhead, later had a spell as a publican. Murdoch was the first of the Lions to die after suffering a stroke at the age of 56 in 2001.\n\nBertie Auld\n\nThe midfielder epitomised the fearless approach of the Lions, starting a rendition of ‘The Celtic Song’ in the tunnel as the Inter team watched in bemusement. The former Birmingham player’s intervention helped settle the nerves of his team-mates and more than likely unsettled his opponents. The Glaswegian later managed the likes of Partick Thistle and Hibernian and remains a much-loved figure among his fellow Celtic supporters. Often appearing as a guest on Celtic TV, Auld was inducted into the Scottish Football Hall of Fame in November 2009. Auld, now 81, showed he had not lost his singing prowess at the 2016/2017 Betfred Cup final with a table-topping, glass-thumping performance inside a Hampden executive box.\n\nJimmy Johnstone\n\nThe most naturally-gifted of the Lions, 'Jinky' was voted the club's greatest player by fans in 2002. The winger mesmerised many a top team other than Inter and weeks after the Lisbon triumph he stole the show in Alfredo Di Stefano's testimonial as Celtic defeated Real Madrid in the Bernabeu. The 23-times capped Scotland international struggled to deal with his Celtic exit in 1975 and battled with alcohol problems. He returned to Celtic in a coaching role in the 1980s after finishing his playing career with spells with the likes of San Jose Earthquakes, Sheffield United, Shelbourne and Dundee. Johnstone was diagnosed with motor neurone disease, campaigning to raise money and awareness to fight the condition, and lost his battle in 2006. He is immortalised in a statue outside Celtic Park.\n\nBobby Lennox\n\nHugely popular with the Celtic fans, Lennox spent 19 seasons playing for the club, minus a few months in the United States of America. He was the last Lion to retire as a player, in 1980, and stayed on in a coaching capacity at Celtic Park. He won 25 major trophies during his time with the club — almost a quarter of Celtic’s total — and his 277-goal haul is second only to Jimmy McGrory in the team’s scoring charts. Hailing from Saltcoats in Ayrshire, Lennox was the only one of the Lisbon Lions to have been born more than 10 miles from Parkhead. The 75-year-old is still a familiar face at the ground, often working as a matchday host and recently had a statue unveiled in his honour in his home town.\n\nStevie Chalmers\n\nThe man who scored the winner, Chalmers was told he had three weeks to live as a 20-year-old when he contracted tuberculosis meningitis, but was one of the first Scots to survive the illness after being given pioneering treatment. Four years later in 1959 he joined Celtic from Ashfield Juniors and had to wait six years for his first trophy, but then enjoyed unprecedented success. Glasgow-born Chalmers scored three goals in five Scotland appearances and netted 231 times in 12 years for Celtic. He later played for Morton and Partick Thistle before running an off-licence business and then becoming a sales agent for the Celtic Pools. Now 83, Chalmers, whose son Paul played for Celtic, suffered a heart attack in the late 1980s. His family revealed Chalmers was unable to attend the Lisbon Lions 50th anniversary events due to ill health, having been diagnosed with dementia.\n\nWillie Wallace\n\nThe prolific goalscorer joined Celtic six months before Lisbon in a club record transfer from Hearts. With Joe McBride suffering a bad knee injury weeks later, ‘Wispy’ formed a partnership with Chalmers which carried Celtic to a clean sweep of trophies. Wallace, from Kirkintilloch, netted 134 goals in five years for Celtic before moving to Crystal Palace in 1972. He rounded off his career in Australia, where he still lives, but the 78-year-old has made the long journey back from Down Under to attend some games at at Celtic Park."}, {"url": "https://www.scotsman.com/sport/football/celtic-2-1-inter-european-cup-final-report-lisbon-1967-1448956", "page_content": "In old Lisbon tonight Celtic annihilated Inter Milan by a single goal. They were hailed uproariously as new champions of Europe and not since Real Madrid in 1960 has there been more decisive and satisfying winners of the European Champions Cup. They were great as they became the first club ever to win their National Championship, their National Cup and the European Cup.\n\nThe Scotsman's John Rafferty and journalist colleague Hugh McIlvanney lead Billy McNeill through the crowds to the trophy presentation.\n\nIf annihilated needs explaining it needs explained that Celtic – after losing a goal to a penalty kick and being pestered and frustrated by an unsatisfactory referee – destroyed the theorising of the alleged magician, Herrera, with refreshing attacking football. Had they won by four goals it would have been a fair reflection of the play.\n\nPerhaps, however, it was appropriate that they should win by a single goal for that is how this defensive-minded Inter planned to win. The biter was bitten.\n\nAdvertisement Hide Ad\n\nAdvertisement Hide Ad\n\nJock Stein said before the game that Celtic would win with pace. Tonight he can add to that adventure, ball skill, courage and all the football phrases beloved by the spectators.\n\nHe has claimed, too, that Celtic could raise their game on the big occasion. That they did tonight with two glorious goals far above anything that Inter could have imagined. It was perhaps their finest game of the season. Stein did not play three forwards in the modern manner but instead there was not a player, apart from Simpson, who was not at one time or another committed to attack.\n\nIn modern football this was revolutionary.\n\nIn the second half Tommy Gemmell, a full back, was so committed to racing up the wing that he was on the point of collapse and sought refreshment from the trainer. Indeed, Stein’s answer to the massive defending of the Italians was to play the ball back to a defender running on to it.\n\nThe mightiest shooting came from Murdoch and Gemmell, but they were in the limelight doing the finishing and were no more important than Chalmers, Lennox and Wallace, who kept defenders committed and moving with them and making spaces for the big guns coming from the rear.\n\nIf football is a game like draughts then Stein out-thought and out-witted Herrera. If it is a game to entertain the masses then Celtic are the worthiest champions and the greatest thing to hit European football since the decline of Real Madrid.\n\nAll who sat in this great national stadium in the burning sunshine were happy that once more attacking football had won. Those of us who were Scots and indeed British were wildly emotional and ranged from those who had hitch-hiked across 1700 miles of Europe to those of us who thought we were blasé and had seen it all. We do not like to see a football field invaded, but when these Celtic supporters broke in at the end and took command of the field and knelt and kissed the turf, and some “howked” out souvenir clods, we could understand.\n\nWe watched proudly as Celtic struggled to their dressing-room, Murdoch crying unashamedly, Lennox was without a boot but he was not caring, Billy McNeill strode majestically as the winning captain should, and then there was the light relief when he had to be taken from the dressingroom when it was discovered that in the hectic enthusiasm they had forgotten the presentation of the Cup. He was on the point of collapse but finally he struggled up to get his hands on it.\n\nThe atmosphere was weird and wonderful and wildly Celtic from the moment Jock Stein took his players onto the field to test the turf. He came round to the dressingroom obviously deeply moved to see the crowd out there and he said: “They are ALL Celtic supporters, it is inspiring.”\n\nAdvertisement Hide Ad\n\nAdvertisement Hide Ad\n\nIndeed they all seemed to be Celtic supporters and all around the great bowl green flags were waving and Celtic chants breached the air and hysteria raged when the teams came out of the hole in the ground that led from the dressing rooms.\n\nThe first Celtic burst looked promising. Johnstone skipped away and beat Burgnich three different ways. This early the Celtic approach was clear. Stein had turned Johnstone loose to prod all around the forward line. Herrera sent the tough little Burgnich to mark him.\n\nThere was a touch of luck for Celtic in the third minute. Mazzola headed Cappellini’s cross and the ball hit Simpson on the shins. Then Johnstone was near with a header before, in the seventh minute, calamity befell Celtic.\n\nCraig tackled Cappellini in the penalty box and swept the legs from under him. Immediately the referee signalled a penalty kick. Mazzola took it and his low shot was unsavable.\n\nThen there was an exciting spell of exhilarating Celtic attacking in which three chances were made and Inter were so rattled that Herrera was on the field beseeching Italian action and Sarti, the goalkeeper, was reprimanded by the referee for wasting time.\n\nAuld glided through the defence and his well-hit shot looked a goal but the ball smacked against the crossbar.\n\nWallace had a shot brilliantly saved and then on his knees he headed just wide. In the attacking skills, Celtic, as their first half progressed, completely overwhelmed Inter. Their play out of defence was masterly, the build up of Murdoch and Auld devastating in the way their long passes sent men racing up the flanks.\n\nInter were crushed back on Sarti by the massive attacking, and the ball work of Johnstone and Auld seemed to surprise the defenders, who were obviously not used to such adventurous football. Celtic had often been less in command and had run up a string of goals.\n\nAdvertisement Hide Ad\n\nAdvertisement Hide Ad\n\nIn contrast to this Celtic approach, Inter looked miserably dull. Their man-to-man marking was shattered by the foraging of Craig and Gemmell, but, as Celtic pressed on, the goal refused to come.\n\nThere was another great try by Auld that was worth a goal, a drive from volley by Gemmell that would have been a goal any other day, but Sarti, diving to his left, saved instinctively.\n\nAs half-time approached, the game took on a farcical appearance, with standing room limited in the penalty area among the crush of bodies while Herrera screamed from the sideline. It was a relief when Mazzola had a shot at Celtic’s goal – from 30 yards.\n\nCeltic might have had a penalty kick at the start of the second half but instead got an indirect free-kick inside the box and then, in the scramble from the kick, the ball seemed over the line but this unsatisfactory referee waved play on.\n\nGemmell was booked for a foul. Then, in the 60th minute, he scored one of the greatest goals ever seen on any football field. Craig’s pass rolled in front of him and he put everything into the shot – the most powerful in Britain. And all the way it was a goal, a memorable one and not before time.\n\nWhat a beating Inter took then. If they had not been so dull one could have been sorry for the once great team taking such humiliation. There was a spell in the second half when one wondered how their goal held.\n\nShots rained on it. Gemmell struck the crossbar and a shot from Murdoch struck Picchi on the face. There was a blatant penalty kick denied when Wallace’s leg was felled near goal and then at last with five minutes to go Celtic had won it.\n\nMurdoch drove the ball hard across the goal and Chalmers slid on to it and pushed it into the net. Justice had indeed been done and Inter knew it. There was no fight back as Celtic played out time.\n\nAdvertisement Hide Ad\n\nAdvertisement Hide Ad"}, {"url": "https://theconversation.com/lisbon-lions-why-celtics-historic-1967-european-cup-win-was-a-defining-moment-for-the-irish-diaspora-in-scotland-131708", "page_content": "Like anywhere else in the world on St Patrick’s Day, where there are people of Irish Catholic descent there will be celebrations of national pride – and the same is true of Scotland. But for many people of Irish descent in Scotland, there is one particular cause for celebration that eclipses even St Patrick’s Day. It’s the story of how an iconic – and unexpected – win for a Glasgow football team in Portugal 50 years ago raised the esteem and restored the pride of a marginalised community.\n\nOn May 25 1967, Celtic FC came from behind to defeat Italian side Inter Milan 2-1, becoming the first club from outside of Spain, Portugal or Italy to win the European Cup (now called the UEFA Champions League). Widely recognised as the most prestigious club soccer trophy in the world, only 22 clubs have managed to win it since its inception in 1956.\n\nBut only through closer inspection can this victory’s more profound religious, ethnic and cultural meaning for Catholics of Irish descent in Scotland be properly understood. Celtic’s win has been noted, reported and highlighted regularly through the years, particularly in 2017 during the club’s recent 50th anniversary celebration.\n\nThough other teams in Britain have won the trophy since, the significance of Celtic’s win went beyond the successes normally associated with such sporting achievement. In our research, we tasked ourselves to find out how this footballing triumph affected Catholics of Irish descent and contributed to the confidence and pride experienced within that community.\n\nCeltic roots\n\nCeltic’s origins are rooted in the cataclysmic Great Starvation (An Gorta Mor in Irish) in Ireland between 1845 and 1849, when millions of people died or were forced to flee the island. The immediate trigger was the failure of the main dietary staple of the potato – but the history of centuries-long British colonisation of Ireland, and the wars and conflict that followed, provides the greater cultural, economic and political context for this human disaster.\n\nFor Scotland, a predominantly Protestant country, one of the main consequences was the influx of Irish Catholic refugees. In 1888, out of the newly forming Irish communities in west-central Scotland, a football club was established in Glasgow by a member of a Catholic religious order called Brother Walfrid. The aim of the club was to raise funds to educate and feed the mainly Catholic Irish poor in and around the east end of the city.\n\nCeltic FC has been one of this Irish immigrant community’s most revered totems since the late 19th century. Fifty years after the Lisbon Lions’ win, the enormity of the achievement was recalled by Scottish historian Tom Devine, who encapsulated its significance, saying:\n\nA key factor in the long story of the emancipation of the Catholic Irish in this country … in terms of signal events, the Lisbon Lions victory probably stands alongside the visit of Pope John Paul II in 1982.\n\nWhile not specifically a Catholic football club, without Catholicism, Irish Catholic immigration and a revival of the Catholic church in post-Reformation Scotland, there would be no Celtic. This fact is fundamental to understanding the club’s origins, identity, appeal and resilience. Former Celtic player and manager Tommy Burns once commented that Celtic players had to remember that:\n\nIt’s more than just a football team they’re playing for. They’re playing for a cause and a people.\n\nSigificance of ‘67\n\nFor Celtic and its supporters, 1967 has become a moment when the underdogs of Scottish society became the most successful underdogs on the football field. To understand the impact and legacy of Celtic’s win, our study examined several commemorative accounts of the victory, and conducted a focus group with fans that travelled to Lisbon in 1967.\n\nIn a commemorative book, one supporter wrote:\n\nIt was the best week of my short life. I made my confession on the 19th, my holy communion on the 20th, my confirmation on the 24th and Celtic won the European Cup on the 25th. I was the centre of the world that week. When Tommy Gemmell scored the equaliser my two big brothers held me up and waved me about. Could life get any better?\n\nOne supporter who attended the match said that in Scotland, “We were no longer afraid to stand up and be counted”. Another described how the Celtic players, “were our heroes in a way that Muhammad Ali might be for black guys in America”. In 2018, academic Paddy Hoey added his own gloss:\n\nTheir achievement was a powerful beacon … for an immigrant community that had been forced to deal with sectarianism and political marginalisation in Scotland.\n\nAlthough people from non-Catholic and non-Irish backgrounds have always supported Celtic and other football fans celebrated the win too, this European Cup victory must be examined in relation to the history of the multi-generational Irish community in Scotland. On what other occasion was there ever – among those of Irish descent in Scotland at least – such enthusiasm and sense of community as when Celtic triumphed as European champions? Its 1967 victory was an iconic moment in the social and cultural history of Scotland and its Irish Catholic diaspora. This is a success memorialised in documentaries and through song, story, theatre, books, vintage football jerseys and casual wear.\n\nCelebrated on a grand scale during its 25 and 50 year anniversaries, the story of the “Lisbon Lions” represents an indelible link for generations of Celtic supporters. It connects to Celtic’s roots and ethos; to the Great Irish Starvation; to the immigrant Catholic Irish experience in Scotland; and to the worldwide Irish diaspora.\n\nThe European Cup win of 1967 is a monument to the survival, experience and success of a resilient community that has frequently viewed aspects of its Irishness and Catholicism in Scotland as ignored, unrecognised and discriminated against. Celtic’s win has become a central component of group memory, linking the past, present and future, offering confidence and hope to a marginalised community in Scotland. It also demonstrates the symbolic power of sport to rise above events on the field of play and represent something more resonant and enduring."}, {"url": "https://www.bbc.co.uk/sport/football/52520874", "page_content": "Davie Hay in action against Feyenoord in the 1970 European Cup final\n\nBilly McNeill, captain of the Lisbon Lions, buries his face in the turf. Midfielder Bertie Auld is bowled over with his hands on his knees. Goalkeeper Evan Williams struggles to his feet. He has just been delicately lobbed by Feyenoord's Swedish striker Ove Kindvall. Three minutes of extra-time remain.\n\nCeltic are 2-1 down. Their grip on the club's second European Cup loosens further with every passing second.\n\nThe pandemonium spills over on to the pitch, photographers encroach the penalty area and surround Kindvall. Celtic's players pick themselves up and desperately search their minds for ideas of how to rescue a replay. None were forthcoming.\n\nIn a matter of a few seconds, referee Concetto lo Bello blows the final whistle, confirming Feyenoord as European Cup winners for the first time - and Celtic as European Cup final losers for the first time. Delirium for the Dutch and dismay for the Scots.\n\nHere, BBC Scotland hears about games being decided by a coin toss, career lows and final complacency.\n\n'My greatest disappointment in football'\n\nWhile the heat of Lisbon is still felt upon the steep slopes of Celtic Park even in the depths of winter every 67th minute, there is little rejoicing about the near miss just three years later. That despite the almost herculean feat of getting to two European finals in such a short period.\n\n\"The greatest disappointment of my footballing career,\" admits Davie Hay, Celtic's right-back on that evening in Milan.\n\n\"When you look at the pictures of us going up to get our medals, there is a total look of despair and despondency.\n\n\"We hadnae heard of Feyenoord. They were something like 44-1 rank outsiders.\"\n\nThere is a beautiful irony about Hay's comments. Three years prior, Helenio Herrera's glamorous Inter Milan side would have felt similar about Celtic's team of locals before they succumbed to one of football's greatest upsets. Celtic became the first British team to win the European Cup in 1967 by beating them 2-1 in Lisbon.\n\nThis time, there was no such fairytale ending. Tommy Gemmell's opener from a free-kick - his second European Cup final goal - after half-an-hour gave Jock Stein's side a lead that lasted just two minutes. Rinus Israel's equaliser quickly brought them back down to earth.\n\nTo go from the underdogs to the favourites must have come as a bit of a culture shock for Stein's men. In the years that followed the triumph of '67, Celtic's domestic form had been impeccable, winning successive league titles and cups. They were used to being domestic powerhouses, but their European form had been lacking.\n\nIn 1968, they exited the European Cup in the first round following a 3-1 aggregate defeat by Dynamo Kiev, and a narrow 1-0 loss to AC Milan dumped them out at the quarter-final stage in 1969.\n\n'The toss of a coin was farcical'\n\nThe club were in a transitional stage. Williams had taken the place of Ronnie Simpson in goals, Hay had moved into Jim Craig's spot at right-back, George Connelly was already making his mark on the first team, while Kenny Dalglish, Danny McGrain and Lou Macari were all flying through the ranks.\n\nThere was hope of another European challenge in 1970, and things got off to a good start with an aggregate victory over Basel, but Celtic faced a great scare in the second round. After beating Benfica 3-0 at Celtic Park, it should have been a comfortable passage through to the quarter-final, but Stein's men got a taste of their own medicine, losing 3-0 at Estadio da Luz, as Benfica equalised with the last kick of the 90 minutes.\n\nWith the scores level after extra-time, how do you decide who goes through to the quarter-finals? Penalties? A replay? No. The referee took the two captains, Celtic's McNeill and Mario Coluna of Benfica, into his dressing room for a coin toss.\n\nMcNeill called heads, it landed on heads. He was then informed that round was merely for the right to toss the actual coin. He stuck to his guns. Heads again. He won, Celtic won, and were through to the quarter-finals.\n\n\"It was midnight before the game was decided,\" the late McNeill told BBC Scotland in 2006. \"The toss of a coin was a farcical way of deciding a tie - irrespective of who won.\n\n\"It was done in the referee's room. It was just myself, Sean Fallon and Big Jock. The room was a bit away from the dressing rooms.\n\n\"After it was decided, it was chaos. I didn't speak to any of the Benfica players afterwards, but I know they were angry.\"\n\nFeyenoord doing homework & underestimating the Dutch\n\nIn the quarter-finals, Celtic beat Fiorentina 3-1 to set-up an all-British semi-final. Though they beat Don Revie's Leeds United, the consensus seems to be that Celtic became complacent for the final as a result.\n\nDid they think the hard work had already been done?\n\n\"Everybody in Britain thought that,\" says former Celtic midfielder Auld. \"Leeds had a very good team and they were doing extremely well down in England. They had the ability, confidence and determination, and we beat them.\n\n\"We were self-confident but not over-confident. We had players who could win the game on their own and Jock covered every inch and every player; he was very special.\n\n\"We knew that Feyenoord were a good team with individuals who could stamp their authority on a game, but they turned out to be a better team than we thought they were and they were the better team on the night.\"\n\nTommy Gemmell celebrates putting Celtic into the lead against Feyenoord\n\nHay gives more weight to the argument, however, and is convinced that they did indeed take Feyenoord lightly.\n\n\"You should never go into a game and think it's going to be easy, especially a European Cup final,\" he said.\n\n\"On the night, we just didn't perform. Big Jock changed the team from the Leeds game, we didn't dominate the midfield, and Feyenoord did their homework.\n\n\"We totally underestimated them.\"\n\n'I cherish it even though we lost'\n\nAs Feyenoord celebrated with their travelling fans, Celtic's players cleared the pitch and waited for their manager in the dressing room, deep in thought.\n\n\"There was disbelief about what had happened, a total quietness in there,\" Hay continues. \"It was like when you wake up from a dream and you think 'did that happen?'\"\n\nHad Stein been speaking honestly immediately after the match, he probably would have told his players that they had missed out on a gilt-edged chance to seal their names in European history once more, and that they only had themselves to blame.\n\nDespite the disappointment, keeper Williams looks back on that night in Milan with fond memories.\n\n\"I cherish it even though we lost,\" he states emphatically.\n\n\"Don't worry, I won plenty. Leagues, cups, the lot. It was my privilege to play with and get to know those Celtic boys, to say I was a player under Jock Stein. I'm a lucky man to have those memories.\"\n\n\"Evan is right,\" says Auld. \"Although we lost, it is such a highlight - Celtic in a second European Cup final. We were playing well enough in the league and in Europe, but that particular night it was not to be.\""}, {"url": "https://www.glasgowworld.com/sport/football/celtic/celtic-1967-lisbon-lions-squadbest-club-side-of-all-time-in-bbc-poll-3715958", "page_content": "Jock Stein’s side became the first British team to win the presitgious European Cup after beating Inter Milan at the\n\nCeltic’s iconic Lisbon Lions squad has been voted as the best club side of all time, according to votes cast on a recent BBC poll.\n\nThe famous Hoops team of 1967 were shortlisted alongside nine other clubs to decide who comes out on top as best side to ever exist in the history of the sport in a poll published by BBC Sport.\n\nAdvertisement\n\nAdvertisement\n\nManager Jock Stein led his Celtic team to European Cup glory after beating Italian champions Inter Milan 2-1 at the Estadio Nacional in the Portuguese capital, courtesy of second half goals from Tommy Gemmell and Stevie Chalmers.\n\nThe Lisbon Lions. The Celtic team line up before their European Cup Final match against Inter Milan in Lisbon. They went on to win 2-1 to become the first British club to lift the trophy.\n\nIt marked a historical achievement as the Hoops became the first British team to win the presitgious competition.\n\nRegarded as the best squad to have ever graced Scottish football, the 1967 team remain the only British club to complete the quadruple, which led to the birth of their nickname ‘The Lisbon Lions’.\n\nReacting to the success, Stein commented: “Winning was important, but it was the way that we won that has filled me with satisfaction. We did it by playing football; pure, beautiful, inventive football. There was not a negative thought in our heads.”\n\nAdvertisement\n\nAdvertisement\n\nFamously, all 11 players were born withing 30 miles of Celtic Park, a feat unimaginable in today’s game.\n\nThe Parkhead club marked the 55th anniversary of their famous triumph at a special lunch event last week, where club directors welcomed Bobby Lennox, Jim Craig and John Clark as well as the families of all other players and manager Jock Stein.\n\nWillie Wallace also joined digitally from his residence in Australia and Celtic chairman Ian Bankier delivered his message of congratultions.\n\nCurrent Hoops boss Ange Postecoglou was not in attendance but sent his own personal video message.\n\nAdvertisement\n\nAdvertisement\n\nHe stated: “To be manager of a club with such a special history is a real honour and the Lions are fundamental to this history - their achievement was the greatest of all.\n\n“It has been a real priviliege to meet members of the team since I have been at the club - great men who gave so much to the club.\n\n“Rightly, their wonderful success should be celebrated.”\n\nNow, according to the poll which closed at 5pm on Tuesday, May 31, Celtic’s immortals have won the battle to be crowned the greatest club side of all time by a stunning 10 per cent.\n\nRESULTS\n\n1 - CELTIC 1966-67 (34%)\n\nMatt Busby presenting Jock Stein with the team prize at the BBC's Sport Review of 1967 in recognition of Celtic's European Cup triumph in Lisbon\n\n2 - BARCELONA 2010-11 (24%)\n\nDominanted European football for roughly a decade in the early 2000s but Pep Guardiola took the La Liga giants to another level during his four years in charge. Crowned Champions League winners after beating United 3-1 at Wembley and stormed to the La Liga title with 96 points. Lionel Messi scored 53 goals, aided by the help of midfield trio Xavi, Andres Iniesta and Sergio Busquets.\n\n3 - MANCHESTER UNITED 1998-99 (14%)\n\nAdvertisement\n\nAdvertisement\n\nThe pinnacle of their English football dominance at the time saw the Red Devile secure a Treble by winning the Premier League, FA Cup and Champions League. Ryan Giggs, David Beckham, Paul Scholes, Roy Keane, Peter Schmeichel and Dwight Yorke were all crucial figures in Fergie’s side.\n\n4 - LIVERPOOL 1983-84 (9%)\n\nSealed a memorable Treble by lifting the European Cup after beating Roma on penalties in the final, First Division title and League Cup, with Ian Rush netting 47 goals in all competitions. A team which featured several Scottish icons, including Alan Hansen, Graeme Souness and Kenny Dalglish.\n\nLiverpool and Bob Paisley celebrate their League Cup victory over Manchester United in 1983.\n\n5 - AC MILAN 1988-89 (4%)\n\nBecame known as ‘The Immortals’ after collecting 10 major honours in nine years, including three European Cups. A side brimming with legends of the game such as Marco van Basten, Paolo Maldini, Ruud Gullit, Carlo Ancelottie and Franco Baresi to name just a few.\n\nJT-6 - REAL MADRID 1959-60 (3%),\n\nDominated the European Cup in the early years. Stars names included Alfredo di Stefano and Ferenc Puskas - the pair scoring all seven goals between them in the 7-3 European Cup final win over Eintracht Frankfurt.\n\nAJAX 1971-72 (3%)\n\nAdvertisement\n\nAdvertisement\n\nThe Dutch giants won three European Cups in a row at the beginning of the 70s during the height of their ‘Total Football’ phase. A side brimming with talent and containing top goalscorer Johan Cruyff completed a clean sweep of trophies by winning the Eredivisie, Dutch Cup and European Cup.\n\nSANTOS 1962 (3%),\n\nThe dominant force in Brazilian football during the 1960s. Inspired by Pele, they went on a 5-match unbeaten run between November 1960 and October 1963, a world record at the time.\n\n7 - TORINO 1947-48 (1%)\n\nThe kings of Italian football in the 1940s - going on an unbeaten home run of more than six years.\n\n8 - BAYERN MUNICH 2012-13 (0%),\n\nManaged by Jupp Heynckes, the Germans enjoyed a trophy-laden campaign by lifting the German Super Cup, Bundesliga, German Cup and Champions League. Thomas Muller finished as top scorer with 23 goals, while Franck Ribery was nominated for the Ballon d’Or and Arjen Robben played a starring role throughout.\n\n1966/67 CELTIC SQUAD (Starting XI vs Inter Milan in bold)\n\nManager - Jock Stein\n\nGoalkeepers - RONNIE SIMPSON, John Fallon, Jack Kennedy\n\nAdvertisement\n\nAdvertisement\n\nDefenders - Jim Brogan, Davie Cattanach, JIM CRAIG, John Cushley, JOHN CLARK, TOMMY GEMMELL, Jim Holton, BILLY McNEIL, Willie O’Neill, Ian Young, Frank McCarron\n\nMidfielders - BERTIE AULD, Sammy Henderson, JIMMY JOHNSTONE, Lou Macari, BOBBY MURDOCH, Charlie Gallagher"}, {"url": "https://www.glasgowtimes.co.uk/sport/other_football/14675632.now-you-know-ove-kindvall-was-feyenoords-goal-hero-against-celtic-in-1970-european-cup-final/", "page_content": "CHICK (Mosspark) – I was on holiday in Cyprus last week and met a few Feyenoord fans in the local hostelry. We got chatting about the 1970 European Cup Final between Celtic and Feyenoord but we couldn’t agree on who scored for the Dutch. Can you help?\n\nIn the semi-final Celtic beat Leeds United 3-1 on aggregate, after a memorable 2-1 victory at Hampden Park in front of over 136,000 fans.\n\nThe final was played at the San Siro Stadium on May 6. Feyenoord won the match 2-1 after extra-time.\n\nTommy Gemmell opened the scoring on the half-hour mark for Celtic but two minutes later Israel equalised for the Dutch. The game went into extra-time.\n\nThe Swede Ove Kindvall broke the Scottish hearts to score the winner after a rare defensive lapse.\n\nLike the 1967 European Cup Final-winning team all the Celtic players and manager were Scottish, and Tommy Gemmell had scored in two European Finals.\n\nRONALD MASON (Erskine) – I might seem a lot to answer but being a regular follower of your Now You Know column, could you answer the following?\n\nI know Bill Brown signed for Spurs in 1959 to pay for the Dundee floodlights.\n\nDid Brown and Alan Gilzean play in the same Dundee and Spurs teams?\n\nWhen did Gilzean sign for Spurs and when did they leave Spurs?\n\nFinally, of the 1962 Dundee Championship-winning side, are Pat Liney, Ian Ure, Alan Cousin, Alan Gilzean and Hugh Robertson the only members left of that side?\n\nAs I say it might seem a lot to answer but I would be much obliged if you can help.\n\nBill Brown left Dundee for Spurs in the Summer of 1959. Alan Gilzean joined Dundee, as an amateur originally, in 1956.\n\nAlthough he didn’t make his competitive debut until shortly after Brown had left. Gilzean went to Tottenham in December 1964.\n\nBill Brown left Tottenham for Northampton Town in October 1966. So the two players certainly played together at Spurs.\n\nGilzean was at White Hart Lane until 1974, when he left for South Africa.\n\nAs far as we can tell, of the Championship-winning team, first-team regulars Pat Liney, Bobby Seith, Ian Ure, Bobby Wishart, Alan Cousin and Alan Gilzean do survive.\n\nAs do fringe players Craig Brown, Bobby Waddell, Alex Stuart and George McGeachie."}, {"url": "https://www.britannica.com/topic/Celtic", "page_content": "As of 2021 Celtic has won the Scottish League Championship 51 times, most recently in 2020. The club has won the Scottish Cup 40 times and the Scottish League Cup 19 times. In European competition, Celtic won the European Cup once, in the 1966–67 season.\n\nCeltic’s biggest rival is Rangers FC, another football (soccer) team in Glasgow, Scotland. The rivalry carries the religious overtones of Catholic versus Protestant. These two teams have dominated Scottish football, Rangers having won 55 titles to Celtic’s 51 as of 2021. The next closest teams are tied at 4 titles each.\n\nCeltic was founded by Brother Walfrid in 1887 at a meeting in St. Mary’s Church hall in the Calton district of Glasgow , Scotland. The club played its first match, against Rangers , the following year, winning 5–2. In 1892 Celtic moved to Celtic Park (Parkhead), where they currently play.\n\nCeltic, in full Celtic Football Club, also called Celtic FC, Scottish professional football (soccer) team based in Glasgow. Nicknamed “the Bhoys,” (the h is said to have been added to phonetically represent an Irish pronunciation of the word boys) Celtic shares a fierce rivalry with the crosstown Rangers, which is often of a sectarian nature, with Celtic and its supporters seen as the Catholic team and Rangers as the Protestant side. Together, the two teams have long dominated Scottish domestic football.\n\nCeltic was founded in 1887 at a meeting in St. Mary’s Church hall in the Calton district of Glasgow. The club played its first match, against Rangers, the following year, winning 5–2. Celtic moved to its longtime home, Celtic Park (also known as Parkhead), in 1892. Renovated in 1995, the stadium now accommodates more than 60,000 spectators. Celtic began playing in white shirts with green collars, and the club’s famous uniform of a green-and-white striped shirt with white shorts debuted in 1903.\n\nBritannica Quiz Great Moments in Sports Quiz\n\nCeltic won its first league championship in the 1892–93 season and has won 50 in total. The club has also won the Scottish League Cup 16 times and the Scottish Cup 37 times. Celtic went through a lean run of 11 seasons without a league championship before the arrival of Jock Stein as manager in 1965, but the team went on to win nine Scottish league championships in a row from 1965–66 to 1973–74.\n\nThe club has also had a number of notable accomplishments outside of domestic play. In 1967 Celtic became the first British club to win the prestigious European Cup (now the Champions League), defeating Inter Milan 2–1 in Portugal. That Celtic team—which featured star players such as Billy McNeill, Bobby Lennox, and Jimmy Johnstone—is remembered as “The Lisbon Lions.” Celtic almost repeated the feat three years later when it was the runner-up in the 1970 European Cup final. Wim Jansen, a player on the Dutch team Feyenoord that beat Celtic on that occasion, in 1997 became the club’s first manager from outside of Britain or Ireland. Six years later Celtic reached the 2003 Union of European Football Associations (UEFA) Cup final but lost to FC Porto."}]}