{"Bill Brown made his debut for Clyde in a 3–2 win over Partick Thistle in October 1951.": [{"url": "https://thecelticstar.com/oh-harry-harryoh-harry-hood-part-2-cruising-with-the-clyde/", "page_content": "“Oh Harry, Harry…Oh Harry Hood” : Part 2: Cruising with the Clyde\n\nHarry Hood’s second Clyde debut took place at Shawfield on Saturday, 8 October 1966, a 3-1 win over Motherwell in front of 4,000 spectators. He would not score on that occasion but was back on the goal trail the following weekend as the Bully Wee lost 4-3 to Dundee United at Tannadice. Clyde would edge another seven-goal thriller across the road at Dens Park just before Christmas, with Harry grabbing a brace on that occasion.\n\nREAD PART ONE HERE… “Oh Harry, Harry…Oh Harry Hood”: Springburn, Shawfield & Sunderland…but no Celtic\n\nThe calendar year 1967 would be a momentous one for both of the old east end rivals, Celtic and Clyde, whilst it would spell the end of the road for another traditional old Glasgow club, Third Lanark. The signs for the Hi Hi were growing increasingly desperate as Celts hosted Clyde on Wednesday, 11 January 1967, the match deferred from the Ne’erday holiday due to the frozen conditions. The Hoops began life minus their injured top scorer Joe McBride by thrashing the Shawfield outfit 5-1, Stevie Chalmers with a double and Charlie Gallagher, Tommy Gemmell and Bobby Lennox netting for Celts whilst Joe Gilroy – frequently rumoured to be a signing target for Jock Stein – briefly gave Clyde parity in the first half. It was only a second defeat in 10 for the visitors and halted a run of four successive away League victories.\n\nHarry opened his Scottish Cup account for the season with another double, in the 4-1 win over East Fife at Shawfield on Saturday, 18 February 1967, and he would repeat that feat in the replayed quarter-final tie against Hamilton Academical on Wednesday, 22 March 1967, my sixth birthday, as the Bully Wee won 5-1 at Douglas Park in front of over 9,000 spectators.\n\nThat set up a last four clash between Clyde and Celtic at Hampden on the opening day in April, almost 57,000 braving a blustery afternoon to watch the sides battle the elements and each other before settling for a 0-0 draw. The two big incidents occurred in the closing quarter, first Ronnie Simpson pulling off a fabulous save from Joe Gilroy before Celts were denied a penalty by referee JRP Gordon when Jimmy Johnstone’s goalbound shot was stopped on the line by Dave Souter’s elbow. An injury suffered by Harry at Hampden saw him miss the replay, before 55,000 at the same venue four days later, and Clyde had also missed their chance of glory, goals from Bobby Lennox and Bertie Auld settling the tie within the opening 22 minutes.\n\nHarry would miss the next three games but would return for the final four fixtures of the League season, scoring a double on the last day as Clyde came back from 2-0 down at half-time to beat Stirling Albion 5-2 at Annfield and secure third place in the Championship, the club’s highest League finish of all time.\n\nThey would be cruelly robbed of a place in European football by a strange rule whereby only one club from each city could compete in the Inter-Cities Fairs Cup, runners-up Rangers claiming Glasgow’s spot, whilst with the teams finishing immediately below Clyde – Aberdeen and Hibernian – qualifying on their own merits, sixth-placed Dundee got the nod to replace them. To rub salt into Clyde wounds, the Dens Park men would then go all the way to the last four of the competition before following the Easter Road and Ibrox outfits as the third Scottish club to be defeated by Cup-winners Leeds United.\n\nThings continued to progress well with Harry’s career. He was chosen as part of a Scotland touring party for a series of close-season ‘test matches’ in May and June 1967, as new boss Bobby Brown looked at fringe players who may break into the full squad for the upcoming World Cup campaign. Hood replaced new Rangers signing Andy Penman in the opening match in Tel Aviv, scoring the winner as the Scots beat Israel 2-1. The next game would take place on Lisbon Day, Thursday, 25 May 1967, Harry also enjoying the taste of victory with a goal in Scotland’s 4-1 win over Hong Kong, Dunfermline Athletic pair Alex Ferguson – with a double – and Willie Callaghan – elder brother of Tommy – with the other counters for the tourists.\n\nThree days later, Hood was in action again as another Ferguson goal, this time in Sydney, beat an Australian national team managed by a certain Jo Venglos! Harry would sit out further victories over the Socceroos in Adelaide and Melbourne before returning on Tuesday, 5 June 1967 for the match in Wellington against a New Zealand Under-23 team, Hood not on the scoresheet as the Scots won 7-2, thanks to a hat-trick from Joe Harper, a double from recent Wembley hero Jim McCalliog, a Tommy McLean penalty and a Gary Lake own goal.\n\nThat scoreline would be repeated in the final tour match against Canada, played in Winnipeg, this time Harper grabbing five with Bobby Hope and Willie Morgan also netting for Scotland. Of the 19 players who travelled, only seven would not receive full caps for Scotland, Harry Hood and Alex Ferguson being the most high-profile of those. To this day, I would struggle to name a better uncapped Scottish player than Harry Hood.\n\nClyde would open their 1967/68 League campaign at the home of the European champions, Celtic, Chris Shevlane and Pat McMahon given League debuts as Mrs Kelly unfurled the flag. The Shawfield club were now under temporary new management in the shape of former Airdrieonians boss, Archie Wright, Davie White having moved to Ibrox as assistant to Scot Symon, who he would later replace whilst Rangers were at the top of the League as the Govan outfit began to fear, feel then resent the chill in Jock Stein’s shadow. Kilsyth Bhoy McMahon would open the scoring before Lions Bobby Lennox and Bertie Auld completed a 3-0 win before the interval.\n\nHarry would then hit the goal trail with three in the victories over Partick Thistle and Aberdeen which followed, before the run came to an end with a 2-0 defeat by Falkirk at Shawfield on Saturday, 30 September 1967, a match my father actually took me along to, if I recall correctly. The highlight of the autumn schedule was a 5-0 win over Dundee United at Shawfield just before Christmas, with Hood scoring twice.\n\nThe new year 1968 opened with another Clyde managerial appointment, former player Archie Robertson – the man whose goal directly from a corner had prevented Jimmy McGrory’s Celtic from retaining their Scottish Cup in April 1955 – picking up the reins from Archie Wright. Jock Stein’s current Hoops side would eventually edge a five-goal thriller at Shawfield, with Harry Hood very much to the fore if Press reports are to be believed.\n\n“The power of Murdoch and Brogan at wing-half and the hard running of Chalmers and McBride, who scored Celtic’s goals between them, were unmatchable over the whole game by Clyde, for whom Anderson, Hood and McFarlane took the eye in much briefer glimpses. Clyde forestalled any thoughts of a rout two minutes after the interval, when McFarlane took Anderson’s pass and shot home from an angle. Indeed, they played their best football in the next 15 minutes, during which Hood hit a post and Simpson made timely saves from Hood and Stewart.”\n\nSadly, Ronnie Simpson would sustain a rib injury which would rule him out of the following day’s clash with Rangers at Celtic Park, a vital match with the two rivals neck-and-neck for the title. John Fallon would take Ronnie’s place and would be blamed for the two goals which gave Rangers an undeserved draw and left the advantage for the flag race with the Ibrox club.\n\nThere would be joy for Harry with a hat-trick for Clyde in a 6-3 win over Hearts at Shawfield on Saturday, 20 January 1968, then disappointment as they exited the Scottish Cup following a 3-2 defeat by Partick Thistle at Firhill in front of 14,000 spectators in late February. In between those matches, however, there was finally some well-deserved international recognition for Harry, chosen in the Scotland side for the Under-23 international with England at Hampden on Wednesday, 7 February 1968.\n\nHe was joined in the navy blue by a number of stars who would go on to become household names, Pat Stanton, Peter Cormack and Colin Stein with Hibernian, Bobby Moncur at Newcastle United and Willie Morgan at Manchester United, together with Steve Murray, who would later join him at Celtic. Hood would score Scotland’s only goal, early in the second half, sadly sandwiched between strikes from Martin Chivers and Rodney Marsh, as the visitors won 2-1.\n\nFollowing the high of playing for his country at Hampden, Harry would suffer the heaviest defeat of his career at the same venue as Clyde ran into a rampant Celtic side in the final of the Glasgow Cup, on Wednesday, 17 April 1968. The Hoops scored seven goals in an incredible 24-minute spell in the first half, Jimmy Johnstone, Bobby Lennox with a hat-trick, John Hughes with a brace and Tommy Gemmell doing the damage.\n\nFortunately, for Clyde, Celts eased off in the second half, only Bobby Murdoch early on adding to the Bully Wee misery. The 8-0 victory witnessed by 25,000 equalled a record scoreline for this final which had stood since the year Celtic was founded. Clyde would win two of the final three League games, with Harry scoring the winner at Fir Park, to finish the season in a highly-respectable eighth position.\n\nHood commenced what would be his final season with Clyde by scoring in a 4-1 win over Aberdeen in the League Cup sectional tie at Shawfield, on Saturday, 10 August 1968, then again in a 3-2 victory at Tannadice in midweek. He would then return from injury to hit a hat-trick in the final game, a 3-0 defeat of Dunfermline Athletic at Shawfield which saw the Bully Wee emerge from a difficult group to face Ayr United in the quarter-final.\n\nBefore that clash, Clyde found themselves again facing the champions Celtic in the opening League game of the season, this time at Shawfield on Saturday, 7 September 1968. The old Rutherglen stadium was crammed with 22,000 fans, most expecting to see Celts continue the high-scoring form which had seen them blow away Rangers, Morton and Partick Thistle in their own League Cup section.\n\nThey would get three goals from Jock Stein’s men, two of them late on to put a rather flattering look on the scoreline at 3-0, after Jim Brogan had scored the finest goal of his Celtic career midway through the first half.\n\nClyde would win both legs of the quarter-final against an Ayr United side who would be promoted from the Second Division at the end of the season, Harry on target in the 2-0 win at Shawfield on Wednesday, 25 September 1968. On the same night, a young man called Kenny Dalglish was given his Celtic debut by Jock Stein at Douglas Park as the Hoops followed up a 10-0 first leg humiliation of Hamilton Academical – Stevie Chalmers and Bobby Lennox each scoring five – with a 4-2 victory in the return, Charlie Gallagher’s final match for Celtic.\n\nThe two east end clubs would now meet at Hampden for the third time in 18 months, on Wednesday, 9 October 1968, Harry Hood described as a “constant threat” to Celtic who won thanks to a late George Connelly strike, the big Fifer scoring with a fierce shot just three minutes after replacing the injured Joe McBride, to send most of the 35,000 fans home happy.\n\nThe clubs would clash again two months later in the by-now annual New Year’s Day fixture, this time at Celtic Park. New signing Tommy Callaghan from Dunfermline Athletic helped himself to a double, whilst a Tommy Gemmell penalty and second-half strikes from Willie Wallace and Bobby Lennox made it a comfortable 5-0 victory for the hosts.\n\nHarry would be joined up front later that month by Jimmy Quinn, a young player on loan from Celtic, grandson of the Mighty Hoops striker of the same name, the Bould Bhoy from Croy. Quinn would score before being sent off in a 1-1 draw with Motherwell at Fir Park on Saturday, 25 January 1969, as the Bully Wee finished the Scottish Cup first round match with just nine men.\n\nThe Shawfield men would then win the home replay 2-1 in midweek, to set up yet another cup clash with Treble-chasing Celtic, the following month. On the same night, the Hoops had destroyed Partick Thistle 8-1 in their replayed tie – with SEVEN different goalscorers – the sides having drawn 3-3 at Firhill on the Saturday thanks to Jimmy Bone’s last-gasp strike.\n\nThe second round would prove significant for two wonderful Celts, albeit for vastly different reasons. The game took place at Shawfield on Wednesday, 12 February 1969 with a 4.30 kick-off, due to issues with Clyde’s floodlighting system. Nevertheless, more than 25,000 crammed into the Rutherglen arena and they would see Celtic goalkeeper Ronnie Simpson dislocate his shoulder early on following a clash with – would you believe it – Hoops loanee Jimmy Quinn. Tommy Gemmell would replace ‘Faither’ in goals as the match petered out to a goalless draw. Sadly, this would be the start of Ronnie’s injury problems which would ultimately cause his retirement from football. Such a cruel and crazy game is football sometimes.\n\nThe replay would take place 12 days later at Celtic Park, the Hoops buoyant after an excellent 0-0 draw in the San Siro which raised Parkhead hopes of a second European Cup triumph in three seasons. A higher-than-normal crowd of 38,000 turned out on an icy evening to see Stevie Chalmers give Celts the lead midway through the first half. Despite incessant attacking, they had to wait until the closing 15 minutes before further strikes from John Hughes and Bobby Murdoch sealed the 3-0 victory and a quarter-final match with St Johnstone.\n\nBack at Shawfield, Harry Hood would continue to get himself amongst the goals as February became March. There was a touch of symmetry about the match with Rangers at Ibrox on Saturday, 15 March 1969. Back in November 1962, Harry had made his debut for Clyde in Govan as an 18-year-old hopeful. This day would now mark his final game for the club, at the same venue.\n\nTwo days later, on Monday, 17 March 1969 – St Patrick’s Day – after 96 goals in 197 matches for Clyde, Henry Anthony Hood became Harry Hood of the Celtic.\n\nLife would never be quite the same.\n\nHail Hail! Part 3 to follow shortly on The Celtic Star.\n\nMatt Corr\n\nFollow Matt on Twitter @Boola_vogue"}, {"url": "https://www.cricbuzz.com/profiles/5971/bill-brown", "page_content": "\n\nFull profile Bill Brown, who played for Australia in the 1930s and 1940s, was known for his rock-solid technique. He was also rated highly for his fielding skills. Just like many of the other Australian ...\n\nBatting Career Summary M Inn NO Runs HS Avg BF SR 100 200 50 4s 6s Test 22 35 1 1592 206 46.82 2655 59.96 4 1 9 85 1\n\nBowling Career Summary M Inn B Runs Wkts BBI BBM Econ Avg SR 5W 10W Test 22 - - - - - - - - - - -\n\nCareer Information\n\nProfile\n\nBill Brown, who played for Australia in the 1930s and 1940s, was known for his rock-solid technique. He was also rated highly for his fielding skills. Just like many of the other Australian cricketers of his era, he missed out on playing Test cricket due to the second World War.\n\n\n\nBrown, made his First-Class debut in 1932-33 for New South Wales. However, he had a bad start to his fledgling career as he was run-out for zero and that too without facing a single delivery. Consistent scores in the Sheffield Shield helped him to gain a place in the Ashes squad that toured England in 1934.\n\n\n\nThe century against Lancashire during that tour won him a place in the Test side that took on England at Trent Bridge. He gave a glimpse of his skills with a measured innings of 73 and that too with Australia finding themselves in trouble. In the next Test at Lord's, he amassed his first ton. Brown then scored heavily during the tour of South Africa in 1935.\n\n\n\nDuring the tour of England in 1938, with his double-hundred in the Test at Lord's, he held the innings together and the game ended in a draw. In 1946, when Australia resumed playing Test cricket, Brown seemed to have lost his way a bit.\n\n\n\nBrown captained the Australian side that played one-off Test in New Zealand in 1946. The tour to England in 1948 though, turned out to be his last series. With players like Morris and Harvey coming through the ranks, he faded away from the scene.\n\n\n\nAfter retiring from the game, Brown served as the selector for Queensland and then for Australia. Brown passed away in March 2008.\n\n\n\nBy Bharath Ramaraj"}, {"url": "https://www.bbc.com/sport/football/64527164", "page_content": "Rangers \"won in the right way\" after allowing Partick Thistle to equalise in a tumultuous Scottish Cup tie at Ibrox, said manager Michael Beale.\n\nThistle levelled unopposed through Scott Tiffoney when the visitors complained Malik Tillman had been unsportsmanlike when making it 2-1.\n\nThe midfielder had intercepted the ball as the Championship side intended to surrender possession from a throw-in.\n\n\"It was a big misunderstanding, the whole thing,\" said Beale.\n\n\"Malik gets injured. We play the ball out. Malik's on the floor, he's unaware that we've played the ball out so when he gets up, he just thinks it's a throw-in to Partick Thistle. He presses innocently and then he's through on goal and he goes and finishes the move.\n\n\"I don't want us to win a football game on a misunderstanding and it was a misunderstanding. It would've been the wrong thing to do. I've got high standards but the club I work for has got high standards as well and as Rangers Football Club, we're in a better place tonight that we did that. It's not an easy thing to do, trust me. We won the game, we won the game in the right way.\"\n\nPartick Thistle boss Ian McCall commented: \"I don't think Malik Tillman knew what he was doing. I think he got mixed up and put it in the net.\n\n\"Michael Beale showed an awful lot of class, so did James Tavernier to do what they did. It was the right to do so there's no blame on anybody, not even the ref. I've been involved in the game since 1981 - I've never seen it before.\"\n\nAntonio Colak and James Sands also scored for Rangers, who came from behind to book their place in Monday's quarter-final draw with Ayr United, Celtic, Hearts, Kilmarnock, Inverness Caledonian Thistle, Raith Rovers and Darvel or Falkirk.\n\n'It was a big misunderstanding' - Beale on Ibrox drama\n\nThe hosts had a nervous moment early on when Tillman tussled with Holt on the very edge of the Rangers penalty area but referee David Munro offered the 2,500-strong travelling Thistle support no encouragement.\n\nThe visitors held their own with a disciplined defensive approach and a determination not to allow their hosts time and space. Kyle Turner won and took a free-kick that tested Allan McGregor - and the goalkeeper was forced into an even better stop to deny Tiffoney moments later.\n\nBut, in the aftermath, the visitors were awarded their spot-kick. Munro was asked to review whether Kevin Holt's header had been handled by Colak and the referee signalled penalty. Holt converted confidently.\n\nRangers' play had been too narrow and their short passing game food and drink for the Jags. Ibrox manager Michael Beale took action at half-time with Ryan Kent and Kemar Roofe sent on in place of Ianis Hagi and Todd Cantwell. And there was almost instant reward. Kent sent Roofe through and the striker fired narrowly wide.\n\nThe leveller duly arrived when Nicolas Raskin chipped from the inside right channel for Colak to nod in. The Croatian had gone nine games without a goal since his last on 29 October.\n\nThe keeper may have done better with that one but stood up well to block Colak's next effort and made his mark again by saving a Rangers' penalty.\n\nTillman was dragged down by Stuart Bannigan, who was adamant the foul had taken place outside the box. The award stood but so did Sneddon as he stayed in a central position to get in the way of Tavernier's spot-kick.\n\nBut then, another jaw-dropping twist. Rangers put the ball out after Tillman pulled up with a knock and, after the restart, Tillman robbed Holt and evaded chasing defenders and Sneddon to score. Thistle were furious, insisting the Rangers attacker had stolen the ball just as they were about to kick it back to the home defence.\n\nA melee ensued on the pitch and Beale was active in his technical area, with the instruction given before Tiffoney sauntered forward from the re-start to round McGregor and score.\n\nIt was from a Borna Barisic corner that the decisive goal came, but again confusion reigned. Sands threw himself at the ball and celebrated when the net bulged but replays suggested Thistle's Connor McAvoy may have knocked it over the line.\n\nTillman danced away from a clutch of challenges only to be denied by Sneddon in added time, the last major incident of an enthralling Scottish Cup tie.\n\nPlayer of the match - Nicolas Raskin\n\nRangers' January signing marked his first start with an assist and his use of the ball was integral to much of Rangers' play in the second half\n\nWhat they said\n\nRangers manager Michael Beale: \"It was right to make the changes in the second half. I didn't think the performance was great. To be fair to the character and mentality of the players, they have found a way to win.\"\n\nPartick Thistle manager Ian McCall: \"We're full of pride but full of disappointment as well. The players were absolutely magnificent. First half, I thought we were terrific. They allowed us to score the goal to get us to 2-2 and then it was game on, And, unfortunately Rangers scored from a set play.\"\n\nLine-ups\n\nMatch Stats\n\nLive Text Line-ups Rangers Formation 4-2-3-1 1 McGregor 2 Tavernier 19 Sands 26 Davies 31 Barisic 18 Kamara 43 Raskin 7 Hagi 71 Tillman 13 Cantwell 9 Colak 1 McGregor\n\n2 Tavernier\n\n19 Sands\n\n26 Davies\n\n31 Barisic Booked at 72mins\n\n18 Kamara Booked at 79mins\n\n43 Raskin Substituted for Jack at 89' minutes\n\n7 Hagi Substituted for Kent at 45' minutes\n\n71 Tillman\n\n13 Cantwell Substituted for Roofe at 45' minutes\n\n9 Colak Substituted for Morelos at 83' minutes Substitutes 6 Goldson\n\n8 Jack\n\n14 Kent\n\n20 Morelos\n\n23 Wright\n\n25 Roofe\n\n33 McLaughlin\n\n38 King\n\n44 Devine Partick Thistle Formation 5-4-1 1 Sneddon 2 McMillan 18 McAvoy 22 Muirhead 4 Holt 3 Milne 7 Tiffoney 16 Hodson 6 Turner 8 Bannigan 9 Graham 1 Sneddon Booked at 82mins\n\n2 McMillan\n\n18 McAvoy\n\n22 Muirhead\n\n4 Holt\n\n3 Milne Booked at 52mins\n\n7 Tiffoney Booked at 72mins Substituted for Fitzpatrick at 74' minutes\n\n16 Hodson Substituted for Mackenzie at 89' minutes\n\n6 Turner Booked at 52mins\n\n8 Bannigan Substituted for Docherty at 75' minutes Booked at 80mins\n\n9 Graham Booked at 44mins Substituted for Dowds at 66' minutes Substitutes 5 Brownlie\n\n10 Dowds\n\n11 Lawless\n\n14 Smith\n\n19 Mullen\n\n21 Fitzpatrick\n\n23 Docherty\n\n29 Mackenzie\n\n31 Mitchell Referee: David Munro Attendance: 44,636 Match Stats Live Text Post update Match ends, Rangers 3, Partick Thistle 2. Full Time Second Half ends, Rangers 3, Partick Thistle 2. Post update Attempt saved. Malik Tillman (Rangers) left footed shot from the centre of the box is saved in the centre of the goal. Post update Corner, Rangers. Conceded by Connor McAvoy. Post update James Tavernier (Rangers) wins a free kick in the attacking half. Post update Foul by Zander Mackenzie (Partick Thistle). Substitution Substitution, Partick Thistle. Zander Mackenzie replaces Lee Hodson. Substitution Substitution, Rangers. Ryan Jack replaces Nicolas Raskin. Post update Foul by Kemar Roofe (Rangers). Post update Kyle Turner (Partick Thistle) wins a free kick in the attacking half. goal Goal! Goal! Rangers 3, Partick Thistle 2. James Sands (Rangers) header from the centre of the box to the centre of the goal. Assisted by Borna Barisic. Post update Corner, Rangers. Conceded by Connor McAvoy. Substitution Substitution, Rangers. Alfredo Morelos replaces Antonio-Mirko Colak. Booking Jamie Sneddon (Partick Thistle) is shown the yellow card. Post update Corner, Rangers. Conceded by Kevin Holt. Booking Ross Docherty (Partick Thistle) is shown the yellow card for a bad foul. Booking Glen Kamara (Rangers) is shown the yellow card for a bad foul. Post update Corner, Rangers. Conceded by Harry Milne. Post update Corner, Rangers. Conceded by Jamie Sneddon. Post update Attempt saved. Ben Davies (Rangers) header from the centre of the box is saved in the centre of the goal. Page 1 of 5 rewind previous Navigate to the next page next Navigate to the last page forward"}, {"url": "https://www.bbc.co.uk/sport/football/63182478", "page_content": "Last updated on .From the section Scottish Championship\n\nScott Tiffoney scored Partick Thistle's winner\n\nPartick Thistle remain top of the Scottish Championship on goal difference after securing an away win over Hamilton Academical.\n\nJonny Ngandu and Andy Ryan threatened for Accies but it was Thistle that took the lead.\n\nBrian Graham volleyed the visitors in front following a free-kick.\n\nRyan drew Hamilton level but Scott Tiffoney struck powerfully to restore the Jags' lead and they lead Inverness at the top of the table."}, {"url": "https://dundeefc.co.uk/club/history/our-story/", "page_content": "“Welcome! thrice welcome! to the year 1893, For it is the year that I intend to leave Dundee.”, wrote poet William McGonagall in his New Years Resolution poem but if he did so, then he would have been unfortunate enough to miss the birth of Dundee Football Club who were founded that year and their first ever game which was played at West Craigie Park against Glasgow Rangers on August 12th.\n\nDundee F.C. were formed from the amalgamation of two local clubs Our Boys and East End and their merger formed the basis of an application to join the three year old Scottish Football League into which they were admitted in June 1893.\n\nTheir first match took place therefore at the home of Our Boys with their colours being the sky blue and white strips of East End and on the ‘Glorious Twelfth’, Dundee’s first match ended 3-3 with Sandy Gilligan having the honour of scoring the Club’s first goal.\n\nBy the end of their debut season, Dundee had moved to a new ground at the city docks at Carolina Port where a smoking slag heap on the adjacent Gas works on the Broughty Ferry Road side, nicknamed the ‘Burning Mountain’ often gave hundreds of fans, a free view of the game.\n\nIn March 1894, goalkeeper Bill March, centre-half William ‘Plum’ Longair and left winger Sandy Keillor became the first Dundee players to represent Scotland in a 2-1 victory over Ireland in Belfast and two years later Keillor became the first Dundee player to score for Scotland in a 4-0 triumph over Wales in the first and only international to be held at Carolina Port.\n\n‘The Port’ had a superb playing surface but it was too remote, with no public transport links and in 1899, Dundee moved to their current home of Dens Park. Dens Park was officially opened against St. Bernards on August 19th 1899 when Fred McDiarmid was awarded with a medal for scoring the first goal on the new ground and the move was the start of the good times for The Dee.\n\nTwelve months previously, Dundee were saved from liquidation after poor gates had contributed to large debts and the part of the new committee’s strategy was increase attendances by relocating to the new ground. It was a move that paid off, as the crowds started to flock to Dens and with Dundee now regularly playing in the dark blue of Our Boys, they finished as runners-up in the Scottish League championship three times within the next decade.\n\nDUNDEE IN THE 20TH CENTURY\n\nSilverware was also just around the corner and in 1910, Dundee won their first major honour when they brought home the Scottish Cup for the first and to date only time in the Club’s history. After a marathon ten game campaign, Dundee won the oldest football trophy in the world after a 2-1 win over Clyde at Ibrox in the second replay. Jimmy Bellamy scored the equaliser after the Bully Wee had taken the lead and it was John ‘Sailor’ Hunter who wrote his name into Dundee folklore by scoring the winning goal.\n\nIt would be another forty-one years before Dundee would win another major honour, although they did reach the Scottish Cup Final again in 1925 when they lost 2-1 to Celtic who scored two late goals after Davie McLean gave Dundee a half-time lead.\n\nHowever it wasn’t until after the Second World War that Dundee emerged as a major force in the Scottish game when managing / director George Anderson built a side that was to challenge for honours. Having been relegated on the eve of War, Anderson lead Dundee to back to back B Division championships, having been denied promotion in the 1945/46 season as the Scottish League gave clubs a years grace to get players back from the armed forces and soon they were challenging for the A Division title.\n\nAnderson would tell the players to ‘go out and enjoy themselves’ and he liked to encourage attractive football and Dundee’s first season back in the top flight was rewarded with a fourth place finish, their highest placing for twenty-six years.\n\nSeason 1948/49 saw Dundee reach the semi-finals of both the League and Scottish Cups and in the League Championship finished second after a heart breaking last day defeat. Dundee were one point ahead going into the final match at Falkirk and a win would guarantee the League Flag, regardless of what Rangers did at Albion Rovers but it wasn’t to be.\n\nThe Dundee players were flooded with nerves and the effervescent and chirpy Anderson was unable to dispel them. When confronted with the usual pre-match opposition banter, Anderson locked his troops in the dressing room an hour before kick off and tried to protect his players from unnecessary distractions. It back fired however as Dundee first missed a penalty while at 0-0 and then fell apart in the second half and went down 4-1 as Rangers snatched the title with a similar score line at Coatbridge.\n\nIn just five short years however, Anderson had taken Dundee from Division Two also-rans to Championship contenders but the fact was, that there was no major trophies in the Dens Park cabinet and he had to work out how he was going to change that.\n\nHowever it was the signing George Anderson made in September 1950 which was the final piece in the jigsaw, when pulled off one of the transfer coups of the century when he signed Scottish superstar Billy Steel for a world record fee of £23, 500. Anderson had fought off competition from Rangers to land Steel and the inside forward brought power, skill and imagination to the Dundee forward line. It was extraordinary for a provincial club like Dundee to pay such an extraordinary fee and Anderson’s philosophy of ‘think big’ was repaid when silverware was soon on its way to Dens.\n\nWith the strong back-line of Cowie, Gallacher and Boyd added to the goals of Flavell and the skill of Steel, Dundee won their first trophy since 1910 when on October 27th 1951, Dundee won the League Cup in an exciting 3-2 win over Rangers at Hampden.\n\nTwelve months later Dundee became the first club to retain the League Cup when the defeated Kilmarnock 2-0 in the Final and with a Scottish Cup Final defeat to Motherwell squeezed in between the two League Cup wins, Anderson had finally turned Dundee in a trophy winning, Scottish footballing force.\n\nWhile the early fifties brought cup glory, the rest of the decade would see dismay for the Dark Blues in the country’s main competition notably with a three nil defeat in the season 1953/54 by C Division Berwick Rangers.\n\nThings got worse five years later when in January 1959 Dundee visited to Highland League Fraserburgh in the Scottish Cup first round and crashed out with an embarrassing 1-0 loss. With a team that was full of experience and youthful promise, the Dark Blues had Bill Brown and Doug Cowie both of whom appeared for Scotland at the previous year’s World Cup Finals, alongside Jimmy Gabriel who would go on to have a fine career with Everton, Hugh Robertson, Alan Cousin, Bobby Cox and Alex Hamilton. On paper Dundee should have been comfortable winners but the defeat to ‘The Broch’ is perhaps the biggest shock defeat ever from a Highland League Club.\n\nHowever Robertson, Cousin, Cox and Hamilton didn’t have long to wait for honours, for in season 1961/62 the Dark Blues had their most glorious season, beating Rangers 5-1 at Ibrox and winning the Scottish League championship with a 3-0 win at Muirton Park, Perth on the final day of the season.\n\nThe names of Liney, Hamilton, Cox, Seith, Ure, Wishart, Smith, Penman, Cousin, Gilzean and Robertson trip off the tongue of every Dundee fan young and old and managed by Bob Shankly, they were described by Scottish Football historian Bob Crampsey as ‘the best Scottish footballing side to emerge in Scotland since the war, better even than the Lisbon Lions.’\n\nShankly brought together a blend of players together both on and off the park who allowed Dundee to live their dreams. There were the young stars like goal scoring phenomenon Alan Gilzean, who had trained as a painter and decorator, Ian Ure, who had given up rugby to play football for Dundee and Andy Penman, the ‘Penalty King’, the homesick genius whom Willie Thornton had rescued from Everton at the tender age of fifteen.\n\nThere was the ageing genius Gordon Smith who had been put out to pasture by Hearts with four championship medals in his pocket, whom Bob Shankly picked up for nothing at the age of 37 and who would play in a European Cup semi-final at 39. There were fellow veterans Bobby Wishart and Bobby Seith who had championships behind them with Aberdeen and Burnley respectively and who would bring vital experience to a young team.\n\nThere was Alan Cousin, the part-time footballer who juggled his playing career with school teaching and whose double shuffle was something that could never be taught. There was Hugh Robertson, deft and electric on the left wing and Pat Liney, without whom the Championship might not have been won had he not saved a penalty against St. Mirren in the penultimate game.\n\nThere was Alex Hamilton, Dundee’s most capped player with 24 international appearances for Scotland, a joker and an extrovert, whose party-piece was playing keepie-up with a sixpence before flicking it up and catching it in his pocket and fellow full back Bobby Cox, the local boy who with his famous sliding tackle who skippered the Club he loved to its greatest moment.\n\nLegends all of them and the following season, Dundee set off on a memorable European odyssey as the Club entered into it’s first foray into continental competition. As they took their European Cup challenge to a semi-final against AC Milan, they showed that the classic Scottish passing game which they played, could work as well in Europe as in Scotland. Their campaign began with an 8-1 thumping of second favourites Cologne, before a bruising rematch in Germany. Sporting Lisbon and Anderlecht were also despatched before AC Milan ended the dream 5-1 in the San Siro despite Dundee winning the second leg 1-0 at home.\n\nAnother Scottish Cup Final followed in 1964 when only two late goals denied them a replay against Rangers in a game during which keeper Bert Slater turned in one of all time great performances in a final and a League Cup Final was reached in 1967 where the Dark Blues lost 5-3 to Celtic.\n\nThat same season Dundee reached their second European semi final as they reached the last four of the Inter City Fairs Cup – the predecessor to the UEFA Cup where they lost to Don Revie’s Leeds United 2-1 on aggregate.\n\n1973 brought Dundee’s last major trophy when captain Tommy Gemmell lifted the League Cup after Gordon Wallace’s winner had beaten Celtic 1-0 at Hampden and both would later go on to manage the Club..\n\nTwo seasons later came the formation of the Premier League, something Dundee had been prime movers in establishing, but they were not in it long, being relegated at the end of the first season. They found life tougher than anticipated in the First Division and although promotion was achieved in 1978 the Dark Blues were back down by the end of the following campaign despite registering a famous 5-1 win over Celtic towards the end of the season.\n\n1980-81 saw them win their way back to the Premier League and reach another League Cup final which was played at Dens Park in an historic Jute City Final against Dundee United and once up Dundee, stayed in the top flight throughout the eighties\n\nThe nineties brought more years in second tier wilderness with a Centenary Cup win in 1990 and two First Division titles in 1992 and 1998 and another League Cup Final as a First Division club, where they lost 2-0 to Aberdeen at Hampden.\n\nPromotion in 1998 entered Dundee into the inaugural Scottish Premier League but it was a season that Dundee off the field were in a continual fight against adversity, expulsion, bankruptcy and takeover fears. The S.P.L. wanted to see Dens Park as a 10 000 all seated stadium within twelve months and Dundee United attempted a takeover and merge the clubs but the players got on with it and turned in some terrific performances.\n\nOn the field, Dundee showed a gritty determination and fighting spirit to retain their top flight status and by the end of the season, The Dee finished in fifth place, their highest league position for twenty-five years and never bettered since they were Scottish champions in 1962.\n\nDundee had also failed to finish above their rivals Dundee United during the same period but now they managed to achieve this after a memorable derby victory on May 1st 1999 when goals from Brian Irvine and James Grady gave Dundee a famous 2-0 win.\n\nThe stands were built and named after the League Championship winning captain and manager Bobby Cox and Bob Shankly and despite being within a point of finishing fifth again that season, Jocky Scott was replaced in favour of Italian manager Ivano Bonetti.\n\nBonetti would bring excitement, stars and wonderful football and had no problem attracting players, most notably Argentine superstar Claudio Caniggia but the problem was that apart from Caniggia, they could not sell the stars in for a big profit. With cost spiralling out of control and no tangible league or cup success to match Dundee’s stylish football Bonetti left in 2002 to be replaced by Jim Duffy who took over for the second time.\n\nA 21ST CENTURY DUNDEE\n\nDundee still had a fine squad and Duffy led them to the Scottish Cup Final in his first season, losing 1-0 to Rangers in a match which the Dark Blues could well have won and took Dundee back into Europe after a twenty-nine year absence. There they defeated KS Vllaznia 6-0 on aggregate in the preliminary round of the UEFA Cup before losing out 3-1 to Serie A side Perguia when over 2000 Dees had travelled to Umbria to watch the second leg.\n\nHowever the following month, November 2003 brought a bombshell for the Dark Blues faithful as Dundee went into administration. The court appointed Tom Burton and Fiona Taylor from the accountants Ernst & Young as joint administrators and the following day the full extent of Dundee’s financial plight was revealed with debts reported to be close to a staggering £20 million.\n\nDundee fans feared the worst and it was a crucial time for the survival of Dundee FC with the supporters’ association launching its Dee4Life fundraising campaign which was crucial in helping save the Club.\n\nTwenty-five members of staff had been immediately axed and manager Jim Duffy took it upon himself to inform the playing and coaching staff and almost immediately became a target for Partick Thistle to replace Gerry Collins who was sacked with the Maryhill club rooted to the bottom of the league. He showed incredibly loyalty however and stayed with the beleaguered Dees and against all the odds led them to a seventh place finish at the end of that year.\n\nThere was real concern that the Club would not survive and the drastic cost cutting that was necessary to do so, impacted not just on that season but continues until today. In 2005 the Dark Blues were relegated in dramatic style on the final day of the season after Tam McManus’ injury time shot which hit the post would have kept them up and the first season in the lower leagues saw Duffy and his replacement Alan Kernaghan both sacked.\n\nAlex Rae replaced the Irishman in the summer of 2006 but a third and then second place finish couldn’t get The Dee back up and he was replaced in November 2008 by Jocky Scott for his third spell in charge.\n\nScott’s first game in charge stopped the rot with a 1-1 draw at home to Airdrie United and the following week on November 8th, Dundee got their first win since August 23rd with an impressive 1-0 victory over Dunfermline in Fife thanks to a goal from Guadeloupe international Mikel Antoine-Curier.\n\nResults continued to pick up with just one league defeat in nine as well as running Celtic close in the third round of the Scottish Cup at Parkhead when Colin McMenamin gave The Dee a 1-0 lead before eventually losing 2-1.\n\nAnother run of only one defeat in nine in February / March saw Dundee propel up the league but their poor early season form meant that they never really put pressure on St Johnstone and Partick at the top.\n\nIn April Dundee held their first ever Hall of Fame Dinner at the Invercarse Hotel and manager Jocky Scott was one of eight inaugural inductees alongside William Longair, Alan Gilzean, Billy Steel, Doug Cowie, Claudio Caniggia, Bobby Cox and Barry Smith, Scott’s former captain from his last spell in charge whom he would bring back to Dens to coach the Under-19s.\n\nAt the end of the season Dundee finished a credible fourth, fifteen points behind champions St Johnstone who won the League with 65 points – four less than Dundee had as runners-up the year before.\n\nHopes were high therefore that promotion could be achieved in season 2009/10 under the guidance of the experienced Scott who had led Dundee to the First Division title in 1998. After years of struggling with the financial constraints caused by the administration period of 2003/04, it looked like those days might be behind the club thanks to new investment that had come into the club in the summer of 2009.\n\nThat investment came in the form of Aberdeen businessman Calum Melville who joined the board in March 2009 after answering a newspaper advert from Dundee F.C. chairman Bob Brannan which invited investment into the club. Prior to the forty-one year old’s arrival at Dens, Dundee, if not exactly reaching for the stars, were hardly in the gutter either and the board, having studied the impact of administration, realised that they couldn’t afford to live beyond their means and if that meant fans had to lower their expectations, so be it.\n\nSuch pragmatism exited Dens Park however when Melville breezed into the City of Discovery with big promises and grander ambitions and journalists regaled Dundee supporters with various tales of Melville’s wealth, from his princely house in Gleneagles and his Bentley, to how he wasn’t averse to hearing himself compared with the American billionaire, Donald Trump.\n\nBrannan had placed the advert in The Sunday Times at a cost of £5900 in February 2009 advertising for ‘Business Directors’ and at the club’s AGM a few weeks later, told the assembled shareholders that a shortlist of ten interested parties had been drawn up. By the end of March that list had been reduced to one and on the 26th of the month, Melville was invited to come on board.\n\nMelville was born in Aberdeen and made his fortune through commercial and residential property, hotels and the oil and gas industry in the Granite City, and was a lifelong Dons supporter. He was listed in The Sunday Times top 500 rich list in 2008 and in his first public interview since joining Dundee in the Evening Telegraph on April 27th, Melville revealed that the board had come up with a plan that for every full price season ticket over the figure sold the previous year, they were going to match it pound for pound to invest in the playing staff.\n\n“If we sell a thousand more than last year, that’s £280,000 from the fans and we will put in another £280,000 to match that and get the best players we can”, said Calum in an exclusive interview for the local press. “We are having a genuine push to get back to the SPL and the term we will use again and again is that second is last. There is no second prize in the First Division and we have to be first.\n\n“We have to get promoted and the guys in the street have to know that and support us accordingly. I’ll say it again and keep saying it – the mantra for next season is second is nowhere.”\n\nBefore then Brannan had already announced at the club’s annual Hall of Fame dinner on April 3rd that the budget for the playing staff would increase by 25% for the following season and that manager Jocky Scott was already identifying some exciting signing targets.\n\nAn approach for one of those signing targets was made on the last day of the season against Partick Thistle when Scott asked Jags manager Ian McCall about the availability of midfielder Gary Harkins who had been outstanding despite Dundee’s 4-0 win. Harkins had been nominated for the First Division player of the year award and after a protracted three-month transfer saga, Jocky eventually got his man for a fee of £150,000 plus add-ons which was funded by the new director.\n\nAlso on Jocky’s radar was nineteen-year-old Livingston striker Leigh Griffiths and an approach was made for the Scotland B cap in April shortly after Melville joined the club. This approach was immediately rebuffed by the West Lothian club and Dundee looked to have a job on their hands to secure his services as the much sought after youngster was also being coveted by a number of SPL clubs including Hearts who publicly stated as much. Dundee, however, were the only club who put cash on the table and on June 25th, Livingston accepted Dundee’s offer of £125,000 and “Sparky” was on his way to Dens.\n\nWith a number of new players, including some with international experience, reported to also be close to joining Dundee, Melville was asked in an interview with the Dundee Mad website if the club could sustain the wages they were now offering without him.\n\nHis answer was emphatic and he said, “Yes. This is not a Gretna situation. This club is only sustainable in the long run in the SPL and that is where we need to be. We can pay good money now so imagine doubling the crowds and having SPL football to offer. We are aiming for regular 4th to 8th place in that league. I need to make it clear the players joining the club just now, they are not mercenaries. They are not being paid SPL wages, they are being paid good First Division wages. There are fantastic bonuses in place for success in this league and to get out of it. They get First Division wages now with built in SPL wages after promotion. They are buying into the opportunity we are giving them. The board, the fans, the backroom staff and the players, we are all in this together. Everyone wants to see this club back in the SPL.”\n\nTo invest to get into the SPL was clearly Dundee’s plan as the build-up to the 2009/10 season saw a host of new players join the Club, including former Scotland internationalists Brian Kerr and Colin Cameron, Northern Ireland internationalist Chris Casement, goalkeepers Tony Bullock and John Gibson, strikers Pat Clarke and Sean Higgins and midfielder Ritchie Hart. In total eleven new players joined the club and straight away things seemed to click into place in the first game of the season when Stranraer were dispatched 5-0 in the League Cup 1st round, with three of the new boys on target.\n\nBy the end of October, Dundee had reached the final of the ALBA Cup, the League Cup quarter-final after beating SPL Aberdeen in the third round, and were level on points at the top of the league with Queen of the South and the next two months would see Dundee win the ALBA Cup and open up that eight-point gap at the top on Boxing Day.\n\nDundee had reached the Scottish League Challenge Cup Final, now sponsored by Gaelic speaking television channel BBC ALBA for the third time in their history where they met fellow First Division title contenders Inverness Caledonian Thistle at McDiarmid Park on Sunday 22nd November 2009.\n\nIn a thrilling final, Dundee were 2-0 down at half-time but stormed back in the second half to win 3-2 thanks to an own goal from Caley’s Nauris Bulvitis and strikes from Gary Harkins and Craig Forysth to lift the cup for the second time.\n\n“That was a big win,” said an understandably delighted Dundee manager Jocky Scott when he emerged from the home dressing room. “It was a big win though not a big score and hopefully that will inspire the players for the future and prove to them that we are a good side when we do the right things.”\n\nImmediately Jocky appeared to be right as the ALBA Cup win inspired the players to storm to the top of the Scottish League First Division with impressive away wins against Ross County (1-0) and Partick Thistle (2-0) in the immediate aftermath of the Cup Final. These victories were followed by two 3-1 home wins over Ayr United and Morton and after a Boxing Day draw against the recently relegated Inverness, the Dark Blues had opened up an eight-point lead at the top of the table ahead of Queen of the South and a twelve-point lead over the side from the Highlands who had been arguably Dundee’s biggest threat to promotion pre-season.\n\nDecember saw Jocky Scott win the Irn-Bru First Division Manager of the Month Award and Gary Harkins named as the Irn-Bru Phenomenal Player of the month and in the first half in Inverness on the 26th, Dundee were extremely comfortable against one of their main rivals and went in at half time 1-0 ahead thanks to a Leigh Griffiths penalty. A win would mean a fifteen-point gap being opened up over the Highlanders but the second half was a completely different proposition and The Dee were lucky to escape with a 1-1 draw.\n\nHaving endured a long trek on Boxing Day, Dundee were also disappointed that the Scottish League fixture list had given them another match on the road at New Year, this time away to Airdrie United. This had meant that the club had missed out on some potentially decent revenue as the festive fixtures are often well attended while the fixtures before Christmas are normally amongst the lowest of the season for every club and Dundee had hosted Morton on December 19th in front of just over 4000.\n\nHowever, by the Monday in the lead-up to Airdrie on January 2nd, it became clear that the match was already in severe jeopardy due to the weather and at Melville’s suggestion, Dundee approached The Diamonds and the Scottish League to have the game moved to Dens as the Dark Blues had under soil heating and were confident they could get the fixture played. Melville felt this would give Dundee a great chance to get some revenue in over the festive period, as well as continue the recent good run, and with the majority of other games likely to be off, Dundee could increase their lead at the top.\n\nMelville approached the Scottish League personally and all parties agreed that the game could go ahead at Dens on Sunday the 3rd with the corresponding fixture against Airdrie in March now being swapped to be played at the Excelsior Stadium.\n\nA monumental effort therefore took place to get the game on but by Sunday lunchtime, Club General Manger Jim Thomson, who had overseen the operation, feared the worst as temperatures plummeted in Dundee. To everyone’s relief, referee Colin Brown finally did deem it playable at 2.20pm but in hindsight, it would have perhaps have been better if he hadn’t as, in the words of Jocky Scott, “Everything that could have gone wrong went wrong on that day.”\n\nIn the sub zero temperatures Dundee slipped to their first defeat in fourteen as Airdrie deservedly won 1-0. It was a tale of two penalties with Leigh Griffiths’ spot-kick being saved with the game at 0-0 before Kevin McDonald sent Rab Douglas the wrong way with his shot from twelve yards shortly afterwards.\n\nAs the fans watched the pitch start to glisten towards the end, Airdrie were reduced to ten men and still Dundee couldn’t make the breakthrough in a game that was to have ramifications for the rest of the season. Losing to the side at the bottom of the league was a serious blow and was a big dent to the players’ confidence and the swapping of the fixtures meant that Dundee would now have six of their last nine fixtures away from home for the title run-in. The pitch itself also took some serious punishment and cut up badly and it didn’t really recover from this until pre-season. It meant that it was often more of a hindrance to Dundee and a help to the opposition when they visited Dens and it could affect Dundee’s passing game.\n\nOne such game was three weeks later when second-placed Ross County came to Dens and snatched a 1-0 win in a drab affair to cut The Dees’ lead at the top to six points having also played three games more. There was a huge surprise for the Dundee support at kick-off when top goalscorer Leigh Griffiths started on the bench, having been left out of the starting line-up as a punishment for turning up late. Dundee were 1-0 down at the break and so Sparky came on at half time but he couldn’t inspire the Dark Blues as they turned in a dismal performance and blew the chance to go twelve points clear. It was another dent to the players’ confidence and it gave both Highland sides the chance to close the gap on Dundee at the top.\n\nMelville’s appearances at Dens however had become more infrequent since Christmas and he claimed this was due to being busy with his business interests and he was censored by the SFA after claiming to BBC journalist Jim Spence that Dundee might offer Dundee United £500,000 for Scott Robertson in the January transfer window. Dundee had already outspent the likes of Rangers that season and the SFA gave Melville a ‘slap on the wrist’ as it was seen as ‘tapping up’ the player.\n\nOn February 20th Dundee were due to play Partick at Dens but on the eve of the match the club received some devastating news that legendary skipper of the 1962 championship winning side Bobby Cox had passed away during the night. ‘Sir’ Bobby as he was known by the fans was a regular at Dens on match days until he had recently taken ill and the club honoured him with a minute’s applause before the game. The players stood for the applause in front of the stand which bears his name and they furthered honoured his memory when current captain Eric Paton scored the winner in a 1-0 victory.\n\nLess than a month later however, there was more devastating news when another of the League winning side, Hugh Robertson, passed away, but by then Dundee’s results had been on the slide. On March 6th Dundee again came back from 2-0 down against Inverness to draw two each and keep Caley at nine points’ arms length but that lead was being whittled away with a draw at Ayr and a defeat again to Airdrie later in the month.\n\nThere was a further blow on March 13th when Dundee lost at 2-1 home to Raith Rovers in the Scottish Cup quarter-final and this disappointment was further deepened when the Fife side drew Dundee United in the semi-final in what would have been a huge money spinner for the club.\n\nThat defeat, coupled with the loss at Airdrie, signaled the end of Jocky Scott’s time in charge and the shocking performance in Lanarkshire had been the final straw for the board. Calum Melville wasn’t at the match at the Excelsior Stadium but he took the responsibility himself to personally inform Scott of his fate and left his home in Aberdeen to drive south give him the bad news after a conference phone call between the directors decided the manager had to go.\n\nIn a statement released by the club via the official website, it explained why the decision had been made despite Dundee still being top of the league. “The unanimous decision of the board was not taken lightly but it was felt in view of the results since the turn of the year that the move was essential and in the best interests of the club.”\n\nRecent performances had indeed been poor and with the lead now down to just three points, there was a worry that Inverness were going to overhaul The Dee sooner rather than later. It was clear now that it was imperative for the club to win the First Division to return to the SPL after a five-year absence and the mantra of ‘second is nowhere’ meant Jocky Scott had to pay the ultimate price despite his side still being top of the league.\n\nJocky Scott was sacked on March 20th with just nine matches to go until the end of the season and according to striker Colin McMenamin, “The whole place died the day they sacked Jocky Scott and we just never recovered from that. The boys were so close to Jocky and they felt really let down by the board at the time.”\n\nIt was not the first time that Dundee had replaced their manager while top of the First Division, it was the third and on the previous occasions Dundee managed to finish the season as champions in their last two successful promotion campaigns. The first was in 1992 when Iain Munro was replaced by Simon Stainrod in February while in 1998, John McCormack was ironically replaced by Jocky Scott during the same month to guide them to the league title.\n\nHaving won just two of their eight games since New Year, the board felt a fresh approach was needed to again get Dundee over the finishing line and they were desperate to get a new man in charge before the following Tuesday when the Dark Blues were due to face Queen of the South.\n\nIronically it was Queens’ manager Gordon Chisholm who quickly became the board’s first choice to take over and they envisaged a management dream team to include former Dundee favourite Billy Dodds, who had been coaching part-time with Chisholm in Dumfries. The Dark Blues wanted Dodds to give up his media career and join Dundee as full-time assistant manager instead of Chisholm’s number two at Palmerston, Kenny Brannigan, and when the pair agreed, they were offered their new roles at Dens.\n\nChisholm and Dodds were controversial choices for many Dark Blues fans with Chisholm becoming the first man to manage both Dundee and Dundee United while Dodds had criticised the club on a number occasions while working on the radio for BBC Scotland.\n\nChisholm’s opening match in charge just two days later therefore was against the club he’d just left and the match against Queen of the South was shown live on BBC ALBA. The hope was that Dundee would get the immediate boost that a new manager often brings to a club and the game got off to the perfect start when Queens were reduced to ten men in sixteen minutes. McAusland was sent off for denying Leigh Griffiths a goalscoring opportunity in the box and the striker dusted himself down and scored the resultant spot kick.\n\nThe Dee however couldn’t make their extra man count and after an hour Queens drew level through Bob Harris and managed to hold on for a point. In injury time it had looked as if Dundee might snatch a winner when the referee pointed to the spot again, this time for a handball from by Paul Burns but as Griffiths placed the ball on the spot, the Queens’ players surrounded referee Scott MacDonald as he went to consult his linesman and after an agonising delay, he changed his mind and awarded Dundee a corner.\n\nIt was another blow to the confidence of the players while the fans had also been noticeably nervy after the Doonhamers’ equaliser. It was a disappointing start for Chisholm with another two points dropped and now they had to face a Ross County side in Dingwall who were only seven points behind with three games in hand and on a high after knocking Hibs out of the Scottish Cup in their last match.\n\nFour changes were made by Chisholm for the trip up north and it looked like Dundee were heading for a timely three points when on-loan Celtic striker Ben Hutchinson opened the scoring just after half time. However, with just three minutes left on the clock, former Dundee forward Steven Craig equalised for County and the game despairingly ended in a draw.\n\nIt was another two points dropped and The Dee had now taken just two points from nine in the last eight days. Second placed Inverness had won 1-0 at Partick Thistle to take seven points from nine in the same period and they now dislodged Dundee from top spot to move one point clear.\n\nThe following Tuesday was now going to be a crucial one with a full set of First Division fixtures seeing the top four playing each other and second placed Dundee had another away game at third placed Dunfermline, who themselves still harboured ambitions of promotion.\n\nHowever, it turned out to be a miserable night for Dundee in more ways than one, as they went down by two goals to one on a cold, wet, snowy night on a slippy, muddy surface. Dunfermline were firing on all cylinders from the off and took the lead in six minutes while a lacklustre Dens side were never at the races and went in at the break 2-0 behind. Chisholm sent on all three substitutes at half time and went for broke but an injury time goal from Eddie Malone only served as scant consolation.\n\nIn the Highland derby in Inverness, league leaders Caley gunned down fourth placed Ross County by three goals to nil and in the process extended their lead over Dundee. It was a disastrous start for Chisholm, without a win in his first three games, and the three-point lead he had inherited had now turned round to a four-point deficit.\n\nDundee were now desperate for a win and achieved one at Dens against Ayr United the following Saturday but the 3-0 victory was overshadowed by the news that Caley had come from behind twice against Raith to win 4-3.\n\nDundee were due to play Inverness on the last day of the season at the Caledonian Stadium and the hope now was that Dundee could get within three points of Inverness before they had to travel north to give them a chance of grabbing the title. Caley however showed no sign of letting up and were on a sixteen-game unbeaten run which stretched back to November and they made it seventeen games on April 6th with a midweek 2-0 win at Greenock which gave them a seven-point lead as Dundee were inactive.\n\nDundee kept within touching distance of top spot when they won their first league away match of the year 1-0 at Partick but the following week dropped two more points when a late Griffiths equaliser earned a 2-2 draw with Morton.\n\nSparky’s free kick in the 86th minute at Greenock meant that Dundee were now nine points behind with three games to play and that goal had merely meant that Dundee could still mathematically catch Inverness. To do so they would have to win their game in hand at Raith Rovers the following Tuesday, but after twenty-six minutes they suffered a serious blow when goalkeeper Tony Bullock had to go off with a hamstring injury.\n\nDundee had been unlucky throughout the season with goalkeeping injuries to Robert Douglas and Tony Bullock and veteran goalkeeping coach Bobby Geddes had already featured on the bench five times before Christmas. In the ALBA Cup quarter-final at Stirling in October, it looked like the forty-nine year old Dundee legend would have to come on when Bullock picked up a knock, but the Englishman played on, much to everyone’s relief.\n\nTo avoid a repeat of this scenario, Jocky Scott had brought in former Dundee goalkeeper Derek Soutar in November but now both he and Douglas were injured for the game at Stark’s Park and Geddes was again on the bench and therefore had to come on when Bullock hobbled off. At the age of forty-nine years and eight months, Geddes became the oldest player in Scottish football history and let no one down with a performance that rolled back the years.\n\nHowever, it wasn’t enough to prevent Raith from taking all three points as The Dee turned in a dreadful performance and the 1-0 win for Rovers handed Inverness the First Division Championship.\n\nThe farcical situation with the goalkeeper just about summed things up for Dundee as a fifteen-point lead over Inverness had been overturned to a nine-point deficit. Dundee gained some revenge over Raith on the Saturday with a 2-0 win in their last home game but a 1-0 defeat at Caley on the last day meant Inverness won the league by twelve points, having orchestrated a twenty-seven point swing.\n\nWhere it all had gone wrong was what every Dundee fan wanted to know but credit to Inverness who went on a twenty-one game unbeaten run just after their defeat to the Dark Blues in the ALBA Cup final. Dundee, by contrast, had won just four league games since Christmas and didn’t enjoy the boost normally enjoyed by clubs when they bring in a new manager. Dundee never really recovered from the defeats to Airdrie and Ross County in January and took only nine points from twenty-seven after Gordon Chisholm took charge.\n\nAfter a season which had started with so much hope and promise, it became painful watching the SPL dream, which seemed so close at Christmas, slowly disappear. Dundee had clearly gambled on getting promotion by offering higher wages than previous years and paying the second highest transfer fees in Scotland but it had not paid off.\n\nIt was obvious therefore that failure to win the league meant cutbacks had to be made and budgets had to be reduced and new Business Development Manager Harry MacLean, who had joined the club in May 2010 and would become CEO in September, immediately went from raising money to saving it, cutting the first team wages from £31,000 a week to £16,000.\n\nDuring pre-season, Chisholm had a number of players on trial, training with the squad and on the eve of the new campaign, deals were completed with Nicky Riley, Stephen O’Donnell and Gary Irvine. Mikael Antoine-Curier also joined up with the team after a spell last season on loan at Hamilton and the Guadeloupe international went straight into the side for the season’s opener against Alloa Athletic in defence of the ALBA Cup which The Dee won 2-1.\n\nThe league campaign started with a 1-0 win over Queen of the South at Dens with debutants Rhys Weston, Netan Sansara and Jamie Adams on loan from St Johnstone in the side. Dundee achieved that victory despite going down to nine men but the next game saw the Dark Blues go from the courageous to the ridiculous when they crashed out in of the ALBA Cup to Second Division Stenhousemuir, after a dismal performance saw The Dee surrender the trophy with a 4-1 defeat.\n\nResults continued to be poor with a defeat away to Partick and a 0-0 draw with Ross County at Dens before another embarrassing cup exit, this time in the League Cup at Brechin on penalties.\n\nDefeats in Fife to Dunfermline and Cowdenbeath in September started to put real pressure on Gordon Chisholm but rumours started to circulate that there were more pressing financial pressures off the pitch. Internet chatter was suggesting that Dundee may be in some sort of financial trouble and that Calum Melville might be about to jump ship and the dreaded ‘A’ word started to being bandied about.\n\nThe local press were suggesting that Dundee owed the taxman in the region of £365,000 and on Friday 1st October, the players and staff were left reeling when the club failed to pay their wages. Financial expert Blair Nimmo had been negotiating with HMRC on the club’s behalf and was trying to persuade them to accept a lump sum now and the balance in the summer but the talks became deadlocked and Dundee decided not to pay their staff after taking independent advice.\n\nThe reality now was that if a resolution wasn’t reached, Dundee would have to go into administration for the second time in seven years. On October 14th it was official when the papers were lodged at the Court of Session in Edinburgh and Bryan Jackson of PKF assumed control of the club. It was the third occasion that the club was on the brink due to financial mismanagement and as Dundee arguably sunk to the lowest level in its 117-year history, there was real worry that the club might not survive this time.\n\nAs expected, the first task of the Administrator was to reduce the wage costs and release a number of staff with immediate effect. Jackson was involved in the same process at Motherwell when they went into administration in 2002, letting go nineteen players shortly after taking over at Fir Park and on this occasion the number was thirteen.\n\nFrom the playing staff, Mikael Antoine-Curier, Scott Fox, Charlie Grant, Brian Kerr, Njazi Kuqi, Paul McHale, Colin McMenamin, Eric Paton and Dominic Shimmin were released alongside manager Gordon Chisholm, assistant manager Billy Dodds, youth development coach John Holt and ticket office manager/kit man Neil Cosgrove.\n\nOctober 15th 2010 was a horrendous day at Dens and Bryan Jackson held a press conference to inform the fans that firstly under-19 coach Barry Smith had been put in charge of the team as caretaker-manager and secondly that Dundee’s debts were much larger than initially feared and were in the region of around £2 million.\n\nAmidst all the chaos and conjecture, Dundee actually had a game to play twenty-four hours later at Stirling Albion and new boss Barry Smith had the job of lifting the thirteen senior players who were left on the books. With so few players remaining, the team virtually picked itself while the substitutes’ bench would have to be supplemented with players from the youth team.\n\nAstonishingly, after such a week of turmoil and despair, a match would have understandingly been the last thing on the mind of the players, but they turned in an excellent performance which trumped anything of recent weeks. In front of a noisy away support, Dundee dominated the first half before Leigh Griffiths gave The Dee the lead not long after the break. Stirling, however, bounced back and equalised despite being down to ten men and although it was one way traffic towards The Binos’ goal, Dundee couldn’t grab the winner as every player gave their all.\n\nUnder the circumstances it was a very good point and an emotional week ended with an emotional moment that fitted the day perfectly. Before the match, the players had gone into a huddle for the second match in a row and then at the end, every member of the team, alongside Barry Smith and his coaches, made a point of heading towards the 1000 plus away support that stood to applaud their heroes. The Dundee fans gave the players a tremendous ovation and the bond between the players and the fans was a theme that was to become more prevalent in the weeks and months to come.\n\nAs they had done seven years before, the Dundee support mobilised quickly and the Dundee FC Supporters’ Society started a fighting fund in an attempt to save the club while the threadbare squad achieved credible draws against Dunfermline and Falkirk in their next two games.\n\nBefore the next match at home to Partick however the club received another blow when the Scottish League hit Dundee with a twenty-five point penalty on November 1st. It was a serious threat to the club’s very existence as relegation could mean part-time football or even closure. It left Dundee on minus eleven points, bottom of the league and in a state of shock.\n\nDundee were reeling and on the precipice and the next game against Partick Thistle at Dens on November 6th was clearly going to be one of the biggest games in the club’s history as the reaction of the players, staff and supporters would go a long way to showing the footballing world whether Dundee FC had a future or not. The fight for survival was now in full swing.\n\nThe players and fans didn’t disappoint as over 6000 turned up to wave their red cards in protest of the draconian 25 point penalty and watch Jamie Adams score in the 85th minute to give The Dee a priceless 2-1 win. It was the first victory since going into administration and there were wild celebrations both on and off the park. The noise nearly lifted the roof off of the old Archibald Leitch stand and Dee-Fiant was now the belief and inspiration.\n\nVictories in the next five games against Ross County (home and away), Morton, Cowdenbeath and Stirling Albion put The Dee on a ten game unbeaten run and chipped away at the gap between Dundee and second bottom place which was now down to ten points.\n\nAgainst Ross County on January 2nd a familiar face was in the line-up when Steven Robb returned to help out his old club as a trialist. As well as the 25 point deduction the Scottish League had imposed a transfer embargo on Dundee and in the coming months manager Barry Smith would use the 3-game trialist loophole to help boost his tiny squad.\n\nThe most celebrated example of this occurred a month later against league leaders Raith Rovers at Dens on February 12th when club legend Neil McCann came out of retirement and put his boots on again for three games. Now working as a SKY Sports pundit, he came to the aid of his old club and old team mate Barry Smith and it was a fairytale return for the winger.\n\nMcCann started on the bench and came on after 57 minutes with Dundee already 1-0 down. His appearance saw the tide begin to turn however and with four minutes left captain Gary Harkins scored a fantastic free kick to deservedly level the scores.\n\nDundee didn’t settle for a point however and four minutes into injury time, those who were there witnessed one of the great Dens Park moments. A Craig Forsyth corner was cleared by a Raith defender but when it fell to Matt Lockwood outside the box, he lofted it back in where it was met by Forsyth who headed the ball down. It landed at the feet of McCann twelve yards out and as he spun and fell to the ground, he lifted the ball gently into the air and watched it float over the Rovers keeper and into the net.\n\nMcCann’s sprint towards the South Enclosure belied his thirty-six years and his team mates didn’t catch him till he reached the touchline. When they got there, they buried him in dark blue bodies in front of a frenzied Dundee support which had bounced to the front of the South Enclosure to celebrate with their heroes. It was simply magnificent as Dens reverberated with joy.\n\nThe previous week Dundee had come off the bottom of the league for the first time after a 2-1 win at Dumfries and the victory over Raith was incredibly Dundee’s fourteenth match unbeaten.\n\nTen days later Dundee met Raith again this time in Fife and there was another fairytale in the Dens Park ranks when Lochee United’s Craig Robertson, a lifelong Dee, was offered the chance to turn out for his heroes. Dundee exploited another loophole where Junior players could be used as trialists and Robertson did himself proud with a magnificent performance in the middle of the park in another 2-1 win.\n\nTwo weeks later Dundee were back in Fife and their 3-1 win over Cowdenbeath equaled the club’s 19-game unbeaten run record set by the Championship winning side of 1961/62. They broke the record with a 2-1 win over Queen of the South on March 12th and the run would eventually become a new record of 23 games, broken only when Raith gained a modicum of revenge for McCann’s last minute goal with a last minute winner of their own at Starks Park on April 2nd.\n\nBy then Dundee had survival in their sights and on Easter Saturday travelled up to Dingwall where victory would ensure not only that Dundee would avoid bottom spot but also ninth place which would have put Dundee into a relegation play-off.\n\nAlthough Barry Smith had predicted a ‘cracker’, it turned out in the end to be anything but, but no one connected with Dundee cared a jot as in they secured the victory they needed with a 1-0 win in a scrappy affair. In many ways it was a performance which summed up much of the post-administration season as they defended superbly when under pressure, played some neat passing football, ground out a result when most needed and saw a youngster come to the fore by grabbing the winning goal.\n\nThe winning goal came from Leighton McIntosh in sixty-five minutes when he took advantage of a poor touch from Michael McGovern to take the ball off the County keeper before rolling it into the empty net in front of the jubilant away fans. It was McIntosh’s fourth goal in three games and as the only fit striker on the books he had really come of age with vital goals at vital times after missing part of the season earlier with a broken wrist, which he still protected with a cast.\n\nThe final whistle brought scenes of joy as players, management and fans celebrated the amazing feat of what they had achieved in staying up after the 25 point deduction with two games to spare. Survival had seemed a pipe dream in November but it would be an achievement long remembered.\n\nThe following week there was a carnival atmosphere at Dens as almost 8000 fans came out to salute their heroes against Partick Thistle. An entertaining 3-2 win meant that Dundee had lost just one game in 27 and the players enjoyed a lap of honour at the end. Dundee would finish the league in sixth place, 24 points ahead of bottom, 9 points ahead of the play-offs and the players deserved the applause for everything they had done in adversity, giving their all and for playing a huge, huge part in saving the club.\n\nThe fans more than did their bit as well, raising an astonishing £250,000 in six months which allowed the Administrator to propose a CVA as early as March 11th. It was accepted without appeal and Dundee officially exited Administration on May 12th to become a fans’ owned club with the Dundee FC Supporters’ Society as the majority shareholder.\n\nThe fans-led new board was announced at the end of season player of the year dinner at the Hilton Hotel as was the news that Barry Smith had been appointed permanent manger. He’d been given a three year deal as reward for his remarkable Dee-fiant leadership and this elicited a huge cheer and standing ovation in the room.\n\nSmith’s task was now to consolidate Dundee’s position in the league and build on the confidence of the Dee-Fiant season. It was a new beginning and a new chapter for club and no one seriously expected Dundee to be challenging for promotion as the club started to rebuild.\n\nWhat the fans didn’t expect however was to be bottom of the league by November after a 1-0 home defeat to Partick. A series of disappointing defeats to Livingston, Morton, Falkirk, Hamilton and Ross County contributed to being rooted to the bottom.\n\nThe return of a former hero however changed the fortunes on the pitch when Gavin Rae rejoined the club seven years after leaving for Rangers to raise much needed cash during the first administration. Almost immediately Gavin’s drive and determination in the middle of the park saw results pick up, culminating in a superb 6-1 win at Hamilton in December. Steven Milne, another former Dee who had returned in the summer scored a hat-trick at New Douglas Park as the Dark Blues started to shoot up the league.\n\nBy early February Dundee were up to third, six points behind leaders Ross County who had two games in hand but had lost Gavin Rae to his hometown team Aberdeen. The chance to close the gap on the Staggies however came when they visited Dens at the end of the month but a 1-1 draw allowed County to keep their distance and as they won their games in hand, started to pull away at the top.\n\nDundee kept plugging away however and by the end of March were up to second in the league albeit 15 points behind the Highlanders. By then however Rangers had gone into administration on Valentine’s Day and the press started to hint that second in the First Division may be good enough for promotion should Rangers liquidate. A run of four home games in a row allowed Dundee to stay ahead of Falkirk in second spot and when they beat the Bairns at Dens in early April, it all but ensured that Dundee would finish as runners-up.\n\nA last day 1-0 home win over Livingston thanks to youngster Jamie Reid’s debut goal secured second spot behind champions Ross County and it was another superb achievement from Barry Smith less than twelve months after coming out of admin.\n\nBy the end of the season the situation with Rangers was no clearer and the uncertainty became a Scottish football summer soap opera. Rangers had indeed liquidated but when the new season fixtures were released on June 20th, the S.P.L. named ‘Club 12’ on their list as no decision had yet been on the future of the new company headed by Charles Green.\n\nThe 2012/13 fixture list gave Dundee an opening day home game against Dumbarton but they were watching the Rangers situation quietly and with great interest. Dundee had finished as First Division runners-up for the third time in five years but if the ‘Newco’ were denied entry into the S.P.L., then The Dee would be in prime position to move back into the top tier after a seven year absence.\n\nAfter a season of consolidation manager Barry Smith now looked to assemble a Dark Blue squad to attempt to win promotion but as he did so, events with Rangers took a dramatic turn. On July 4th the eleven other S.P.L. clubs unanimously rejected the ‘Newco’ Rangers’ application to join them and twelve days later named Dundee F.C. as ‘Club 12’. For once ‘second was somewhere.’\n\nDundee were handed their Golden Ticket just two weeks before the start of the new season and indeed didn’t actually receive their S.P.L. share until twenty-four hours before opening day and the national summer of uncertainty meant the whole of Scottish football were ill prepared as fixture reshuffling ensued.\n\nThe League Cup First Round draw was made in June giving Dundee an away trip to Peterhead but this match was scheduled to take place on the first day of the S.P.L. season as the top flight clubs had a bye. This match therefore had to be brought forward four days to the previous Wednesday meaning Dundee had to cancel a pre-season friendly with Bristol City.\n\nDundee however had been building for a tilt at the First Division title and had assembled a squad over the summer which reflected this. They scraped through on penalties after a 0-0 draw in the ‘Blue Toon’ but that uninspiring result didn’t stop over 3000 Dees travelling to Kilmarnock for their first SPL game and witness a battling 0-0 draw; a decent start against the League Cup holders\n\nThe next two games however highlighted Dundee’s deficiencies with a 2-0 home defeat to St Mirren and a 3-0 loss ‘across the road’ at Tannadice to bitterest rivals Dundee United in which captain Stephen O’Donnell was sent off live on SKY Sports.\n\nWith no goals and no points after three games, it was obvious that Dundee needed to add to their squad but they were unable to do so as they had yet to receive any money from the SPL. With Rangers now playing in the Third Division this caused uncertainty with the television deals and the usual August payment was delayed until September after the transfer window had closed. With Dundee having no overdraft since administration, they were therefore only able to bring in Hartlepool striker Colin Nish on loan until January.\n\nA 1-0 home defeat to Ross County after the derby was followed by one of the worst cup results in the club’s history when Dundee crashed out 2-1 in the League Cup to Third Division Queens Park at Hampden after scoring their first goal in over 500 minutes. A surprise 1-0 win away to Hearts in the next game was followed by six straight defeats and the SPL was becoming a nightmare.\n\nDundee’s inability to score would plague them all season and despite having seven strikers on the books, the top scorer finished with just seven goals. In fact the strikers scored no league goals in August and from September to January scored just one league goal between them each month.\n\nLong term injuries to key players also didn’t help and throughout the season The Dee lost the services of Carl Finnigan, Jamie McClusky, Stephen O’Donnell, Mark Stewart, Lewis Toshney for extended periods as well as those of new signings David Grassi, Brian Easton and Mark Kerr who had been brought in as free agents for their experience.\n\nA mini revival was sparked in November when another win over Hearts was followed by a draw at Motherwell then victory against Hibs which put second bottom St Mirren in their sights but when the sides met next met in Paisley, the turning point was the dismissal of Colin Nish and the Dark Blues lost 2-1. The decision to move the following midweek game against Kilmarnock to a free Saturday in January meant that Nish would now be suspended for the home derby against United and another 3-0 defeat meant the natives were becoming restless.\n\nA dismal Christmas period put pressure on Barry Smith and after a New Year defeat at Perth, a director was alleged to have leaked to a local newspaper that Smith’s position was under review. Dundee denied this and gave Smith a vote of confidence until the end of the season but on February 20th with just two more points secured, Smith was dismissed.\n\nIt was a sad end for a Dundee legend who was elevated from youth coach to manager in October 2011 after the administrators axe fell on Gordon Chisholm. Smith led them on a club record run to avoid relegation, helping literally save the club as well as secure that second place which was crucial in getting into the SPL.\n\nOn February 23rd former player John Brown was appointed as caretaker boss and had the job until the end of the season but with Dundee fifteen points adrift at the bottom he claimed it would be ‘a mountain to climb’. League results and displays improved but the ‘mountain was never climbed’ and relegation to the First Division was confirmed on May 5th after a controversial 1-1 draw with Aberdeen. It was a lot later than many expected after a run of just one defeat in nine since Bomber was appointed and Brown was deservedly given the job full-time.\n\nIn the summer Dundee endured a soap opera of their own rather than a national one as Football Partners Scotland looked to invest in the club. After a protracted saga, a vote was held at a Supporters Society SGM on August 12th where members voted overwhelmingly to approve the issuance of 100 million new shares in Dundee FC for FPS to purchase. Bill Colvin was subsequently appointed as chairman, with Steve Martin and Ian Crighton rejoining the board alongside John Nelms from American investment group Keyes Capital who was appointed Director of Football Operations.\n\nManager John Brown spent the summer building a squad to get Dundee back into the top tier at the first attempt and after a sluggish start, were right on the tail of leaders Hamilton after the first quarter.\n\nBy the New Year Dundee were on top of new Scottish Championship but after a series of disappointing home results, Brown resigned with his side joint top of the league. To replace him, The Dee turned to former Scotland internationalist Paul Hartley who had done an impressive job at Alloa, leading them to consecutive promotions and his target was to make it a hat-trick by taking Dundee back into the top tier at the first attempt.\n\nHartley’s first game in charge was against fellow title challengers Hamilton Academical on February 8th and his reign got off to the perfect start with a 1-0 win over his old side, making Hartley the first Dundee manager for 24 years to win his opening game.\n\nOver the next few months the lead repeatedly changed hands between Dundee and Hamilton with Falkirk also on their tales and after a valiant 1-1 draw with Hamilton at New Douglas Park and a convincing 4-0 home win over Cowdenbeath at Dens, the Dark Blues were in pole position with just three games left.\n\nHowever disaster struck on a sunny day in Greenock when already relegated Morton shocked The Dee with a 1-0 win. Hamilton went back to the top by a point meaning Dundee needed favours from others but just seven days later the football gods were smiling on Dundee as Dumbarton thumped Hamilton 4-1 as The Dee beat Alloa 3-0 in front of a sold out away end at Recreation Park.\n\nIt was all set up for Dundee to clinch promotion and the Scottish Championship trophy at home to Dumbarton on the last day of the season where a win would guarantee the title while a draw was likely good enough as Dundee were two points and eight goals ahead of Accies.\n\nAnticipation reached fever pitch as Dens Park sold out by the Wednesday but the capacity crowd in attendance could hardly have anticipated the high drama that was about to unfold. Christian Nade and Peter MacDonald gave Dundee a 2-0 half-time lead but when Scott Agnew pulled one back from the spot with twenty minutes left, the news filtering through from Lanarkshire was that Accies were beating Morton 8-1. The Greenock side pulled one back before Hamilton scored twice to make it 10-2, giving them the eight goals they needed to better Dundee’s goal difference on goals scored.\n\nA goal for Dumbarton therefore would hand the title to Hamilton and The Sons desperately pushed forward in search of an equaliser to spoil the Dark Blues’ party. First there was a penalty shout for Dumbarton, then an almighty scramble in the Dundee box and then with 90 minutes on the clock Kyle Letheren pulled off a world class fingertips save from a Bryan Prunty header as The Dee tried to desperately hang on to their 2-1 lead.\n\nEventually the referee’s final whistle went and Dens Park exploded into unbridled joy. Dundee were SPFL Championship winners and had won promotion at the first attempt. The helicopter carrying the Championship trophy which had been circling over Dens in the final minutes delivered the trophy and when it was handed over to captain Gavin Rae it signaled that Dundee were back in the big time and could now look forward to the Premiership and the return of the derbies.\n\nPaul Hartley rebuilt the squad in the summer in preparation for the Premiership and it would pay dividends with a top six finish in Dundee’s first season back in the top tier. The highlight was the derby victory over United in April which all but secured that top six finish and the success of Dundee’s season was emphasised by Greg Stewart’s nomination for Premiership Player of the Year and Scott Bain’s call up to the full Scotland side.\n\nIn Dundee’s second season in the Premiership, they just missed out on successive top six finishes by a point but there was compensation when Dundee got the chance to relegate their rivals Dundee United in what would become known as the ‘Doon Derby.’\n\nDundee had a good record against United that season with two draws at Tannadice a New Year win at Dens and the first draw in August was particularly memorable when The Dee came back from 2-0 down with 10 minutes to go to draw 2-2 thanks to a stunning strike from Greg Stewart and a 94th minute equaliser from James McPake.\n\nOn May 2nd 2016, the Dundee fans had the time of their lives when United crossed the road needing a win to avoid dropping down to the Championship. It looked like they might survive to fight another day when Ofere gave them the lead nine mutes after the break but on the 77th minute, Bulgarian defender Kostadin Gadzhalov wrote himself into the history books when he headed home a Gary Harkins corner to equalise and effectively relegate United.\n\nHowever in injury time, Dundee fan Craig Wighton hit the final nail in United’s coffin when he hit home a 93rd minute winner and send United down and the home fans into delirium.\n\nGreg Stewart was again nominated for the PFA Player of the Year alongside team mate Kane Hemmings and both were lured south to Oxford United and Birmingham City at the start of the 2016/17 season, with around £750,000 coming into the Dens Park coffers.\n\nHowever their goals and influence were difficult to replace and the Dark Blues struggled at times in a rollercoaster season where Dundee sat 1st, 6th and 12th in the Premiership at various points across the season.\n\nIt was certainly a season of highs and lows as Rangers were defeated at home for the first time in 25 years, Inverness were beaten at Dens for the first time since 2005, Dundee scored six and seven in consecutive home games and ended their Highland hoodoo in the first league outing of the season. The Dee came back from two down to win a thrilling match against Hearts, then threw away a two goal lead at Inverness a month later and gave Celtic three of toughest matches of their imperious season with a hat-trick of narrow one goal losses. Dundee also scored five in the first half in Motherwell but then didn’t win again until they went back there in Neil McCann’s first match in charge.\n\nMcCann was appointed as interim manager after Paul Hartley departed with The Dee hovering precariously near the bottom after the Premiership split and wins at Motherwell and Kilmarnock and a 1-1 draw at home to Ross County (secured thanks to a penalty from Darren O’Dea who ran into the South Enclosure after he scored) were enough to see Dundee safe from going down with two games to spare.\n\nDundee legend McCann was appointed full time manager in the summer and his first full season in charge saw more points won, an improvement in league position and further progress in both cup competitions.\n\nIt was a season of transition with Neil trying to implement his own football philosophy into the playing style and considering he was remembered in his Dundee playing career for his famous late goals, McCann clearly tried to instil that never-say-die attitude into his team with late winners against Raith, Hearts, Ross County, Hamilton, Partick and St Johnstone.\n\nIn the League Cup Dundee knocked their big rivals Dundee United out in the second round, after facing them in the group stages and the 2-1 victory came via a winner from Paul McGowan and a stunning opener from Faissal El Bahktaoui which saw him win the DFC Goal of the Season for the second year in a row.\n\nAnother highlight was defeating Rangers 2-1 in November – the second home win over the Light Blues in the calendar year and a decent post split campaign helped Dundee comfortably secure safety in the end.\n\nArticle by Kenny Ross – Kenny is the author of ‘Dundee: Champions of Scotland 1961-62’, ‘Dundee Legends’, ‘Dundee’s Hampden Heroes’ and ‘It’s All About the Memories’. A selection of those are available to purchase from the club shop and also online by clicking here."}, {"url": "https://www.boston.com/sports/boston-bruins/2018/10/31/3-takeaways-from-the-bruins-3-2-win-over-the-hurricanes/", "page_content": "Bruins 3 takeaways from the Bruins’ 3-2 win over the Hurricanes Bruce Cassidy isn't afraid to shake things up. Brad Marchand had two goals against the Hurricanes Tuesday. AP Photo/Gerry Broome\n\nCOMMENTARY\n\nThe Bruins’ matchup against the Carolina Hurricanes is the NHL’s newest nontraditional storyline.\n\nTuesday night, the teams combined for 75 shots, nine penalties, four power play goals and numerous shorthanded scoring chances. The game even saw Bruce Cassidy break up Boston’s dynamic trio of Brad Marchand, Patrice Bergeron and David Pastrnak.\n\nThe Bruins weathered the storm — no pun intended — and Marchand tallied two impressive goals to down the Hurricanes Tuesday night, 3-2. Here’s we learned from Boston’s chaotic come-from-behind victory at PNC Arena in Raleigh.\n\nIt might be Jaroslav Halak’s time\n\nAfter seemingly every game, the main talking point around the Bruins is goaltender performance, and it appears that Jaroslav Halak has taken the lead over Tuukka Rask.\n\nAdvertisement:\n\nThis isn’t as much about what Rask isn’t doing, but rather about what Halak is doing.\n\nTuesday night against Carolina, the 33-year-old goaltender stood on his head, made 42 saves, and never let the Hurricanes get more than a one-goal lead when Boston’s offense was struggling. Halak was up to the task for every one of Carolina’s breakaway opportunities and the two goals he gave up came on the penalty kill.\n\n?WHAT A SAVE? Jaroslav Halak saves the #NHLBruins from a #TakeWarning goal AGAIN on the Power Play PART 2 pic.twitter.com/ZnooSLF0Jp — Boston Bruins on CLNS (@BruinsCLNS) October 31, 2018\n\nThis wasn’t the first time Halak was a difference-maker, as he is 4-0-2 in his seven appearances. It is not a guarantee that he will take over sole possession of the starting role, as Boston, now 7-3-2, has enjoyed early success with a two-goalie rotation. Yet, it’s hard to imagine Halak not getting the reins as Cassidy’s premier netminder if both goalies continue their trajectories.\n\nBruce Cassidy isn’t afraid to shake things up\n\nThe Bruins had trouble scoring goals until Pastrnak’s second period power play tally. They went exactly 92 minutes and 45 seconds between Tuesday’s first goal and Zdeno Chara’s empty-netter against the Flyers on Oct. 25.\n\nWith the recent lack of offensive production, Cassidy showed Tuesday that he isn’t afraid to shake things up. The third-year Bruins coach did the unthinkable and broke up Boston’s top line — a line that has combined for 50 points this season — by assigning Pastrnak to the second line to play alongside fellow countryman David Krejci and moving Jake DeBrusk up to the first line.\n\nAdvertisement:\n\nThe Bruins netted three goals following the changes — two on the power play — but were all scored by members of the original top line so it is difficult to tell if the move had any real affect on the offensive depth and secondary scoring.\n\nIt is hard to imagine that this move is anything more than just a bandaid fix for the Bruins’ early scoring woes against the Hurricanes. But it’s also not hard to see Cassidy making necessary adjustments, even if it means breaking up one of the best lines in the National Hockey League.\n\nTorey Krug makes his season debut\n\nHe worked hard during his rehab from an ankle injury at training camp and skated in the last two preseason games. But another setback in the final exhibition contest kept Boston’s top puck-moving defenseman out of the lineup for the first 11 games.\n\nKrug finally made his regular season debut Tuesday night. He skated alongside John Moore on the Bruins’ second defensive line and picked up right where he left off quarterbacking the first power play unit.\n\nThe former Michigan State standout looked comfortable throughout his 18:03 of ice time — third-most among Bruins defensemen — and notched a key assist on Pastrnak’s 11th goal of the season.\n\nAdvertisement:\n\nKrug’s addition into an already depleted defense that is missing Charlie McAvoy, Kevan Miller and Matt Grzelcyk is massive. His veteran presence and offensive mindset are exactly what the Bruins need as they continue to battle the injury bug."}, {"url": "https://www.bbc.co.uk/sport/football/58375791", "page_content": "Last updated on .From the section European Football\n\nLionel Messi came on for Neymar just after PSG went 2-0 up\n\nLionel Messi made his Paris St-Germain debut as a 66th-minute substitute in a 2-0 win at Reims in Ligue 1.\n\nThe Argentine, wearing his new number 30 PSG shirt, received a standing ovation as he replaced his friend Neymar in front of a sell-out crowd.\n\nIt was the first club game of his career for a team other than Barcelona.\n\n\"He is still far away from his best form but he has been training well and he will be fit in the next two weeks,\" boss Mauricio Pochettino told Amazon.\n\n\"We are waiting for the best from him. I'm very happy that he made his debut. It was very important for him.\n\n\"He was good, from his first touches he gave the team peace of mind. It's good for him to start with a win.\n\n\"It was good to hear the crowd cheering for him, not just our supporters, it's something Leo has earned.\"\n\nKylian Mbappe scored both goals on what could be his final appearance for the club, with Real Madrid keen to sign him before Tuesday's transfer deadline.\n\nReal Madrid have made a 160m euro (£137m) bid to sign the 22-year-old, who has now scored 135 goals in 175 games for PSG.\n\nLionel Messi drew several fouls, including this one\n\nHis first goal was a header from an Angel di Maria cross and for his second he swept home Achraf Hakimi's cross.\n\n\"Kylian is our player and you know that in football and in business there is always gossip and rumours,\" Pochettino said.\n\n\"I think our president and our sporting director were very clear and he is still here. I am really happy to have Kylian.\n\n\"He is one of the best, one of the most important players in the world today, and for him to be with us is a gift.\"\n\nBut the headlines will be about 34-year-old Messi, who came on moments after that second goal.\n\nTickets for the game were being resold for about 6,000 euros after Reims sold over 20,000 tickets for the Stade Auguste-Delaune match. Before Messi's signing only about 6,000 had been sold.\n\nTheir purchasers may have been disappointed to see Messi only named on the bench - although he got an ovation as he warmed up, with fans chanting his name, and an even bigger one when he came on.\n\nHe played some nice passes and was involved in good link-up play, drawing several fouls. However he had few touches in the penalty area and no shooting opportunities.\n\n\"He brings serenity to the team. His energy and his optimism trickle down on the rest of the team,\" said Pochettino.\n\nMessi had missed the first few games for PSG since his free transfer move following his exit from Barcelona. This was his first game since winning the Copa America with Argentina in July.\n\nHe joined Barcelona as a 13-year-old and scored a record 672 goals in 778 games for the club.\n\nHe has won six Ballons d'Or - also a record - and is considered one of the greatest footballers ever."}, {"url": "https://www.boston.com/sports/boston-bruins/2018/03/09/4-takeaways-from-the-bruins-3-2-win-over-the-flyers/", "page_content": "Bruins 4 takeaways from the Bruins’ 3-2 win over the Flyers Another Bruins win by Brad Marchand's late-game heroics. The Bruins are a perfect 5-0 on their season-long six-game homestand. Angela Spagna/Bruins Daily\n\nThe Philadelphia Flyers were winless in their first four games of March when they took the ice at TD Garden on Thursday night against their archrivals. At the opposite end were the Bruins, with four straight W’s — three in overtime — under their belts.\n\nThe clash marked the Black and Gold’s fifth game of a six-game homestand — their longest of the season — and the first of three contests in less than 72 hours, with a matinee home-and-home series against the Blackhawks coming up this weekend.\n\nThursday saw another case of coach Bruce Cassidy shuffling all hands on deck; he welcomed goalie Tuukka Rask back from a minor lower-body injury, while forward David Backes — who was suspended three games for Tuesday’s hit on Frans Nielsen of the Red Wings — joined Patrice Bergeron and Charlie McAvoy on the sidelines. Cassidy’s third line ended up with Tommy Wingels in place of Backes, and Danton Heinen and Brian Gionta on the wings.\n\nAdvertisement:\n\nThe contest that followed may not have compared to the Bruins’ clashes of yesteryear against the Broad Street Bullies, but any time these teams meet, the result is usually an energy filled and highly entertaining 60 minutes. Here’s what we learned from a game that produced all of that en route to a 3-2 win for Boston.\n\nMarchand notched his third straight game-winner.\n\nJust another day at the office for @Bmarch63. That’s three straight games with the game-winner for the Bruins leading scorer. #NHLBruins pic.twitter.com/5lTwXMyMHC — Boston Bruins (@NHLBruins) March 9, 2018\n\n“He just keeps on ticking,” Cassidy said about his leading goal scorer. “He seems like he’s on a bit of a mission with Bergy [Bergeron] out, that he wants to pick the team up in the offensive part of it.”\n\nBrad Marchand has carried his team with three consecutive game-winners, with two coming in overtime.\n\nOn Thursday, it appeared yet another OT was coming. But in the waning seconds of the final frame, Zdeno Chara put a left-point shot on net that found David Pastrnak digging for the puck at one post. The puck squirted opposite, and Marchand needed but a single moment to win the game at 19:38 by poking home his 29th of the season.\n\n“I think we all have to carry the load a bit,” Marchand said after wearing the “A” in Bergeron’s absence. “I think we’re all feeling that. You know, it’s very hard missing a guy like [Bergeron] and McAvoy, and now Backes for a few games. It’s tough to replace them, so … I think we all feel that a bit and have to step up.”\n\nBruins barely capitalized on facing their second consecutive rookie goalie.\n\nForty-year-old Zdeno Chara connects with 39-year-old @Giostyle21 for this beautiful breakaway tally, Gionta’s first as a Bruin ? pic.twitter.com/ybzVMzg1Yn — Boston Bruins (@NHLBruins) March 9, 2018\n\nAdvertisement:\n\nOn Tuesday, the Bruins sent Red Wings rookie goalie Jared Coreau to the bench after scoring four goals by the mid-game mark – including two on their first two shots. On Thursday, Philly’s Alex Lyon was making his fourth career NHL start.\n\nLyon went the distance, keeping it a one-goal game until the final horn. He was at his best stopping three rat-a-tat Boston bids with two minutes left in the second period.\n\nBut David Pastrnak twirled 360 degrees before taking one swipe to pay dirt, and Riley Nash’s second-rebound poke gave Boston its first goal at 9:14 of the first period. That goal evened the game at one apiece after Jakub Voracek had given the Flyers the lead within the first two minutes.\n\nWith 25 ticks left in the opening period, Gionta went in alone from center ice off Chara’s 75-foot pass, and dropped Lyon before backhanding Boston to a 2-1 lead. The tally was Gionta’s first goal and fourth point after returning to the NHL from the Winter Olympics. Call it the tallest to shortest play of the season – Chara at 6-foot-9 and Gionta at 5-foot-7.\n\n“To be able to come in and [be in] the everyday battles that go along with being an NHLer, a professional player, time and space, little plays,” Cassidy listed as positives about Gionta. “It looks like he hasn’t missed a beat at all.”\n\nRask was active in his return.\n\nAfter missing a week with a minor lower-body injury, 2014 Vezina winner Tuukka Rask had with 31 saves in a solid outing.\n\nAdvertisement:\n\n“We talked to him [about] dealing with a nagging injury,” Cassidy said, “but it’s helped him to get back to where he needs to be, and we’ll see how he recovers tomorrow. That’s probably the best test; see if he’s sore or just your typical game sore. I thought he did a good job.”\n\nRask didn’t look all that sharp on Jori Lehtera’s shorthanded goal at 7:21 of the second period to tie the game at 2-2. He also had to deal with quality chances for the Flyers early, including their conversion on a double-minor to Boston’s Kevan Miller (for high-sticking) in which Rask was beaten clean by Voracek for the 1-0 advantage.\n\nOtherwise, Rask produced a fairly active performance in his return to the crease.\n\n“Oh, it was good. It was sharp,” Rask said. “[I] got into the game early with the power play, a lot of shots there. Felt sharp.”\n\nMcQuaid was also solid in his return.\n\nPick the top Bruin who returns seamlessly after being M.I.A., and it might well be Adam McQuaid.\n\nAfter missing 36 games with a broken leg, the veteran defenseman went back to providing his usual stay-at-home, dependable play on Jan. 17. He then played 17 of the next 18, before sitting out the last four while Bruce Cassidy got a look at newcomer Nick Holden.\n\n“Adam is going to play his game,” Cassidy said. “He is going to be the heart; he is going to block shots. He’s going to confront the opposition and stick up for his teammates, try to make the easy play. So it’s not easy missing some time – long stretches – and then [coming] back in … he’s working at it.”\n\nAdvertisement:\n\nMcQuaid was paired with the red-hot Torey Krug against Philadelphia, with the latter fresh off a career-high four points in Tuesday’s game against Detroit. He did not disappoint, with four hits and three blocked shots in his 19:11 of ice time – including 4:03 on the penalty kill.\n\n“I’m always a big fan of Adam’s kill,” Cassidy said.\n\n“It was nice to … be out there competing with the guys, to be a part of a win again. It feels good,” McQuaid said. “It wasn’t how I would’ve drew things up, or how I envisioned things going. But I’m trying to put the first part – the injury – behind me and focus on where I am at now.”"}, {"url": "https://www.bbc.co.uk/sport/football/64092693", "page_content": "Last updated on .From the section Scottish Championship\n\nSimon Murray opened the scoring this afternoon as his side went top\n\nQueen's Park went top of the Scottish Championship after an entertaining 2-0 win over Partick Thistle.\n\nSimon Murray latched onto Grant Savoury's cutback for the game's opener after just five minutes.\n\nPatrick Jarrett doubled the Spiders' lead to secure the three points with 15 minutes left.\n\nIt was Partick's first loss in five games while Dundee's defeat at Arbroath allowed Owen Coyle's side to leapfrog them to the league's summit."}, {"url": "https://www.bbc.co.uk/sport/football/65643013", "page_content": "Last updated on .From the section Scottish\n\nScott Tiffoney celebrates his second goal at Somerset Park\n\nPartick Thistle are through to the Premiership play-off final after brushing aside 10-man Ayr United at a packed Somerset Park.\n\nLeading 3-0 from the first leg, the visitors added five more goals, Jack McMillan striking early and Scott Tiffoney doubling their lead moments after Dipo Akinyemi was sent off for an angry shove.\n\nIn the second half, McMillan set up Tiffoney's second, Stevie Lawless drilled home and Kevin Holt added a late header in a one-sided contest.\n\nThistle, who also hit eight against Queen's Park in the quarter-final, are the first team to make the final after finishing fourth in the Championship.\n\nThe first leg is at Firhill on Thursday and the Jags' scintillating form will have their top-flight opponents very concerned.\n\nRoss County and Kilmarnock, who meet at Rugby Park on Sunday, are battling to avoid 11th spot, while there is a remote chance of Dundee United hauling themselves off the bottom.\n\nA bumper crowd turned out, with the home faithful hoping for something special, but that bubble was burst on seven minutes when McMillan headed in after an Aidan Fitzpatrick shot was stopped by goalkeeper Charlie Albinson.\n\nAnd the hosts' slim hopes evaporated when top-scorer Akinyemi was dismissed for reacting to being held by Aaron Muirhead, with the defender making the most of it with a dramatic fall.\n\nThistle soon doubled their lead on the counter-attack, Tiffoney converting from Fitzpatrick's low cross.\n\nTiffoney added another goal in the 54th minute, poking in a McMillan delivery from six yards.\n\nLawless cracked in a neat reverse finish after Albinson had palmed away Holt's cross and the defender got the better of the keeper from a corner to complete the scoring.\n\n'When you're winning, your legs don't feel tired'\n\nAyr top-scorer Akinyemi was dismissed for a first-half shove on Aaron Muirhead\n\nPartick Thistle manager Kris Doolan: \"I think it's a statement of the way we want to play, of how good we can be and what's coming.\n\n\"That's how we've approached every game, we've not sat back. We've come into the play-offs strong and we'll get strong as the games go on.\n\n\"When you score goals, you feel great. When you're winning games, your legs don't feel as tired.\n\n\"Winning breeds winning. We've set up a winning environment. Even in training, our boys compete like that.\"\n\nAyr United boss Lee Bullen: \"Partick Thistle were excellent over the two games and deserve to go through. I wish them the very best.\n\n\"From our point of view, it's very, very sore. We lost the early goal, but the red card gave us an impossible task. I never really got to see it and I haven't seen it back yet, so I'm going to hold my council on that until I do see it.\n\n\"We're hurting so badly. In the summer we might be able to sit back and appreciate the highs but, at the moment, it feels like a failure and like we've let people down.\""}], "Bill Brown joined Partick Thistle after leaving Celtic and made over 100 appearances for the club.": [{"url": "https://www.scotsman.com/sport/football/international/saturday-interview-jimmy-bone-recalls-one-of-scottish-footballs-biggest-shocks-3430189", "page_content": "It seems something worth celebrating that making an appointment to discuss someone's heroics in a game that took place half-a-century ago involves slotting into a work schedule.\n\nBone celebrates for Partick Thistle in that final against Celtic.\n\nJimmy Bone, now 72, is still coaching at Wallace High School, in the shadow of the Wallace Monument in Stirling.\n\nHe is helping maintain a tradition of sporting excellence stretching back many years and including Scotland rugby star Finn Russell and the Caldwell footballing brothers. It’s 11.15am in the morning and Bone has already been out on the playing fields with kids.\n\nAdvertisement Hide Ad\n\nAdvertisement Hide Ad\n\nHe is also just off the phone to Dick Campbell, manager at one of Bone’s former clubs Arbroath, and who he helps by studying future opponents.\n\nBone in action for Hearts in 1984.\n\n“Right, where do you want to start?” Bone asks, placing his hands on the knees of his Adidas tracksuit in a corner of the school staff room.\n\nThis week of all weeks, it can only be one place.\n\nThere are many reasons to commend the brilliantly maverick Partick Thistle side of the early 1970s, including of course that League Cup triumph over Celtic 50 years ago this very afternoon. Something else distinguishing them is they are all still here – “all above ground,” as Bone phrases it – and able to tell their stories.\n\nThis is in contrast with Celtic, sadly. It seems very poignant to note that five players who featured for them that afternoon are now in the high stand. This does not even include the late Billy McNeill, who missed the game because of illness.\n\nSt Mirren captain Bone celebrates with the Anglo-Scottish Cup in 1980.\n\n“It was a factor,” says Bone, who ended up being team-mates with McNeill not long afterwards. “Billy was such a leader for Celtic. When I joined, you immediately knew who The Man was. Billy was.\n\n“He was a leader. He made sure everything was right. On that particular day they did not have that leader. We started so well and scored the first goal they did not have anyone to go and gel and bring them back round. If Billy was playing maybe he would have calmed things down and got things sorted.”\n\nMaybe. Reviewing footage of the match underlines just how irrepressible Thistle were. It really was a case of the Maryhill Magyars. Among the repercussions, Bone’s abrupt sale included, was Alan Hansen helping Liverpool to three European Cups and umpteen other titles. It’s said that watching his brother John taste such glory in unforgettable style convinced him to play football seriously having already shown enough promise to consider golf as a professional.\n\n“One thing we did have – when we were hot, we were really good,” says Bone. “And when we were not hot, we lost goals because we had four forwards, two wingers and two strikers, and we had two full backs – Hansen and [Alex] Forsyth – who bombed on. On our day, we were capable of beating anyone.\n\nBone when Partick Thistle assistant manager in 2006.\n\nAdvertisement Hide Ad\n\nAdvertisement Hide Ad\n\n“Playing for Thistle was great,” he adds. “They had a real loyal support. They would turn up on a Saturday not knowing what to expect but they got behind the team anyway. If they got beaten, they were still there the next game anyway. If they won? It was all singing and dancing. They had a real hard core. It was a fabulous club to play for.”\n\nIt seems fitting that the current Thistle are a glorious reincarnation of such freewheeling times, scoring six in their last outing, away at Hamilton Accies, four in their last home game against Ayr United and in between times losing 2-0 in the SPFL Trust trophy to Queen of the South. Ian McCall’s side will wear sponsorless, 1971-style shirts today against Dunfermline.\n\nThose who originally filled them have been in demand this week of course and all of them, minus 82-year-old father of the team Hughie Strachan and Ronnie Glavin, who turned 70 earlier this year, will be in attendance at Firhill this afternoon.\n\nThey will then gather tomorrow for an anniversary lunch at the Hampden Park venue where, on October 23, 1971, they were four up before Celtic had finished their starters.\n\nJimmy Bone shows off the League Cup, 50 years on from the triumph.\n\nBone walked the fourth goal past Celtic ‘keeper Evan Williams just 37 minutes in to send the information superhighway of the day – basically reporters spluttering into phone receivers – into meltdown. Legend has it Rangers fans swarmed to Hampden to get in on the action. And we’ve all heard stories of Grandstand anchor Frank Bough reacting to the news of the half-time score from Hampden as if, well, he’d just heard that Thistle were four goals up at half-time against Celtic in a cup final. Say again? “We’ll get that checked,” he told viewers while adjusting his earpiece.\n\nWhile it is of course unusual to be four goals up in a cup final against anyone, let alone opponents of Celtic’s class, it doesn’t seem outrageous for Thistle to harbour belief they had a chance. According to Bone, that’s exactly how they felt. They’d already beaten Rangers that season and would go onto finish seventh in an 18-team league. Hardly no-hopers.\n\n“Six of that team went on to represent Scotland, and four of us went to Celtic and one, Alex Forsyth, went to Rangers as well as Man Utd.\n\n\"Roughie [Alan Rough], Gibby [Johnny Gibson], Ronnie Glavin and me went to Celtic.\n\nAdvertisement Hide Ad\n\nAdvertisement Hide Ad\n\n\"On that day, it was not a fluke. We were capable of doing that against a lot of teams. One time we scored seven against Motherwell.\n\n\"Sometimes we would lose heavily too,” he adds, truthfully.\n\nThe The Partick Thistle team with the League Cup trophy in 1971.\n\nThistle’s response to the triumph was wonderfully Thistle – they spent a week in Blairgowrie. The Perthshire base was reckoned to be convenient for the midweek clash with Dundee – rescheduled from the Saturday – and for a third game in an emotional, draining week v Aberdeen at Pittodrie, which they lost 7-2.\n\n“We stayed up in Blairgowrie, which I don’t really think that was the best decision,” says Bone now. “We were doing a lot of sitting around. We drew 0-0 with Dundee. That was a good performance, that was a right good Dundee team. Then we went to Aberdeen, we just didn’t have any legs left. Everything hit us. Bang. But we recovered.”\n\nBone was sold to Norwich City a couple of months later and missed out on Thistle’s foray into Europe, where they lost to Hungarian side Honved – in fact, Bone wouldn’t make his European debut until the grand age of 35, while at Hearts.\n\nThere was a lot to fit in before then, including locating Norwich on a map. He was part-time at the time – Bone calculated as many as three of the Thistle team against Celtic had day jobs – and so Norwich City's plan to sign him had to be relayed to Bone down a coal pit in Fallin. He had just completed an apprenticeship as an electrician.\n\n“You know, it was my first day as a tradesman,” he says. “I went to part-time then I had spell when I went full-time and then I thought, wait a wee minute, I have just left a trade here, I only have a matter of eight or nine months to do, so I went back part-time. When we won the cup final I was part-time – I was on night shift.”\n\n“Jackie Campbell was also part time, Coulston and myself. We trained the Tuesday and Thursday night. I was an electrician, I worked in the mines. After I qualified, on my first day, I got the phone call to come up the pit. It was manager David McParland. He said, ‘grab an overnight bag, you are coming to stay with me tonight. We are going down to Norwich tomorrow for talks.’ In those days it was a case of you were going. We did not have the power players have now.”\n\nWhile heading to Norwich hadn’t been his intended career path, it was the making of him. Talk to any Canaries fan of a certain age about Bone and their eyes will mist up. While it now might seem like they are perennially yo-yoing between the Premier League and Championship, Bone helped Norwich secure promotion in the last few weeks of that same, enchanted 1971-72 season before scoring their first-ever goal in the English top-flight, against Everton.\n\nAdvertisement Hide Ad\n\nAdvertisement Hide Ad\n\nAs now, Norwich found it hard going and manager Ron Saunders felt he needed some midfield grit. Bone was on the road again, this time to Sheffield United, in exchange for Trevor Hockey. It broke up a \"Cross-Bone\" partnership with David Cross that seemed born to be.\n\nRemarkably, the transfer took place days before Norwich were due to take part in the League Cup final against Spurs, which meant Bone, who had played in the quarter-final and semi-final wins over Arsenal and Chelsea, was denied making League Cup final appearances on either side of the Border in successive seasons.\n\nNorwich lost the final 1-0 to Spurs. Bone, meanwhile, made his debut for Sheffield United a few miles away at Highbury, scoring in a 3-2 defeat.\n\n“A Scotsman called Jim Blair, formerly of Airdrie, replaced me,” he reflects. “He was a completely different player to me. He was a dribbler guy whereas I had a really good partnership with a guy called David Cross. Crossy was good in the air, I was able to run onto things. Jim Blair was more about having the ball at his feet. It was a strange one.”\n\nAside from playing there once, for next club Sheffield United, he has never returned to Norwich, though not through lack of trying. He is after all in their Hall of Fame and is bound to be warmly received.\n\n“One of the times I was intending to go I was at Prestwick, the flight could not go because of snow,” he recalls. “But it wasn’t at Prestwick, it was at Norwich! It never snows in Norwich!”\n\nHe also had to call off from attending Musselburgh-born former skipper Duncan Forbes’ funeral two years ago due to work commitments.\n\nHe will return one day because the ties are strong. It’s not quite how he feels with regards Celtic, where he experienced a frustrating time after Jock Stein brought him back to Scotland after a short, productive spell at Bramall Lane, where he scored nine times in 31 league appearances. Bone just wasn’t given the chance to get going in a side packed with talent, and when he did finally score a goal, in a win over Dunfermline, he was sold days later – to Arbroath.\n\nAdvertisement Hide Ad\n\nAdvertisement Hide Ad\n\nIt’s where, he says, he got his “sparkle” back. There was something about Gayfield. Even the wind seemed to blow for him. “The ball just seemed to run for me there,” he says. “Whereas in other places it would go out of play.”\n\nSt Mirren’s Love Street was another place that suited him, playing in the No 10 position, with attacking players of the calibre of Doug Somner, Frank McDougall, Frank McAvennie and Billy Stark. There’s a recently completed mural at the new stadium of Bone holding aloft the Anglo-Scottish Cup, won in 1980. Bone is in the Hall of Fame there, too. He left St Mirren, via two summer spells with Toronto Blizzard, to sign for Hong Kong Rangers.\n\nOn his return from the Far East, there was a message waiting for him at the airport. “It was Alex MacDonald from Hearts, wanting me to make contact …”\n\n********\n\nAfter all the coming and going, all the highs and the lows, all the travelling, this was the maroon shirt – no disrespect to Arbroath – that he had always really wanted to pull on.\n\nAlthough his mother was from Glasgow, her family had been Hearts. His father was Rangers and the young Jimmy – the eldest of six – went along with that just so he could see some football on a Saturday afternoon, hence why his boyhood hero was Ibrox striker Jimmy Millar.\n\nBut he kept a light burning for Hearts which is why there was a grin almost as wide as the Alexanders logo on his chest when he signed for the Tynecastle side in 1983\n\n“I was also offered the chance to go to Hibs, they wanted me to do some coaching as well. I said no because I wanted to play for as long as I could. And also, well, I am a bit of a Jambo.”\n\nHe quickly became a part of the scenery. According to John Robertson, one room in the old Tynecastle main stand was christened “Jimmy Bone’s tea room”.\n\nAdvertisement Hide Ad\n\nAdvertisement Hide Ad\n\n“To be fair it was not just Jimmy Bone’s,” he says. “It was Jimmy Bone and Willie Johnston’s tea room. The manager was Alex MacDonald, the assistant was Sandy Jardine, and there was me and Willie Johnston. The papers would give it: ‘Oh, it’s Dad’s army..’\n\n“So if any of the young boys were stepping out of line, me and Bud we would ask them to come and see us in the ‘tea room’. ‘Why should we not go and tell the manager’, it was that kind of stuff.\n\n“There would be a knock on the door, and we would say: ‘why do you think you should come in here? And we’d say, ‘ok you have a cup of tea’, or it was a case of ‘nah, you spoke back to one of the experienced players, you have not shown enough respect,’ and we would throw them out.”\n\nIt was undeniably old school but Hearts youngsters such as Robertson seemed to benefit from this treatment, bunking up with Bone – who he stills refers to as “Da’” – on way trips. The pair remain close. Sandy Clark was Bone's more than decent replacement, but who knows, things might have been different had the veteran still been around to come on and save the day in the final league game of the 1985/86 season.\n\n“I was actually coaching in Zambia,” he recalls. He listened to the Dens Park denouement in the toilet. “It was the only place I could get reception!” He mimics holding a crackling radio against his ear. “It was crazy.”\n\nPerhaps not quite as crazy as what happened 50 years ago today. However one judges it, Bone’s lived a life – and is still going strong.\n\nA message from the Editor: Thank you for reading this article. We're more reliant on your support than ever as the shift in consumer habits brought about by Coronavirus impacts our advertisers. If you haven't already, please consider supporting our trusted, fact-checked journalism by taking out a digital subscription."}, {"url": "https://www.glasgowlive.co.uk/news/glasgow-news/celtic-partick-thistle-legend-jimmy-19323427", "page_content": "Something went wrong, please try again later.\n\nInvalid email Something went wrong, please try again later.\n\nGet the latest Celtic F.C updates, transfer news and analysis from Football Scotland delivered straight to your inbox every day for free\n\nA 100 year old medal from Partick Thistle’s only Scottish Cup triumph has been snapped up for £8,100 at auction, well above its estimate.\n\nThe winner’s medal, which was awarded to Jags forward, Jimmy McMenemy, following the club’s 1-0 victory over Rangers in the 1921 showpiece, was one of the star attractions at McTear’s Sporting Medals and Trophies auction in Glasgow.\n\nMcMenemy joined Partick Thistle in 1920 following 18 years with Celtic, where he picked up multiple trophies and established himself as one of the finest players ever to wear the hoops.\n\nThe forward was 39 years old when he moved across Glasgow and had turned 40 when he stepped out onto Celtic Park in front of 28,000 fans for the Scottish Cup Final on 16 April 1921.\n\nCommenting on the auction, McTear’s Managing Director, Brian Clements, said: “We see a good number of Old Firm medals coming to auction due to the number of trophies both clubs have won, but this is something quite different and very special. Partick Thistle has only won the Scottish Cup once in their 144 year history so anything related to that historic moment is going to be of great interest to football fans and sports historians alike.\n\n“Bidding on Jimmy McMenemy’s Scottish Cup medal was fierce and we were not surprised to see the value soar well above the higher estimate for the lot. This is a true piece of Scottish football history and we are delighted that it achieved such a good price.”\n\n(Image: DR/Mctears)\n\nCommenting on the player Jags legend, Alan Rough, said: “This is a fantastic piece of Thistle history. Jimmy McMenemy was a legend in Scottish football and earned his place in the Jags history books as a member of the all-conquering 1921 Scottish Cup winning squad. It will be 100 years next year since the Scottish Cup win and 50 years since we won our last piece of silverware, so maybe 2021 will be our year again.”\n\nBorn in Rutherglen in 1880, Jimmy ‘Napoleon’ McMenemy was a mainstay in Willie Maley’s Celtic side in the early part of the 20 Century, winning a total of 11 League championships and six Scottish Cups. The player made 56 appearances for Partick Thistle between 1920-22 and was capped 12 times for Scotland. In later years McMenemy would be appointed as coach at Partick Thistle before becoming assistant manager to Willie Maley at Celtic in 1934. He passed away on 23 June 1965, aged 84.\n\nThe Partick Thistle medal, which was consigned by an anonymous seller, appeared in the November auction at McTears.\n\nFind out more on McTears website."}, {"url": "https://thecelticstar.com/celtic-legend-jimmy-mcmenemys-100-year-old-scottish-cup-medal-sells-for-8000/", "page_content": "An almost 100 year old medal from Partick Thistle’s only Scottish Cup triumph has been snapped up for £8,100 at auction, well above its estimate.\n\nThe winner’s medal, which was awarded to Jimmy McMenemy following Partick Thistle’s 1-0 victory over Rangers in the 1921 Final, was one of the star attractions at McTear’s Sporting Medals and Trophies auction in Glasgow.\n\nMcMenemy had joined Partick Thistle in 1920 after 18 glorious years with Celtic. Whilst wearing the hoops, McMenemy collected numerous trophies (11 league titles and 6 Scottish Cups), earned himself the nickname of Napoleon and left a legacy making him one of the greatest Celtic players of all time.\n\nThe forward was 39 years old when he signed for the Jags and had turned 40 when he stepped out onto Celtic Park in front of 28,000 fans for the Scottish Cup Final on 16 April 1921.\n\nCommenting on the auction, McTear’s Managing Director, Brian Clements, said: “We see a good number of Old Firm medals coming to auction due to the number of trophies both clubs have won, but this is something quite different and very special. Partick Thistle has only won the Scottish Cup once in their 144 year history so anything related to that historic moment is going to be of great interest to football fans and sports historians alike.\n\n“Bidding on Jimmy McMenemy’s Scottish Cup medal was fierce and we were not surprised to see the value soar well above the higher estimate for the lot. This is a true piece of Scottish football history and we are delighted that it achieved such a good price.”\n\nSunday morning thoughts 🤔 I'll need to stop telling my competition about auctions that are coming up, especially the fitba medal ones as some of them might have only knew about the auction through me and my big mooth 😮https://t.co/z9mir0395c — jamief (@jamiebhoy2009) November 22, 2020\n\nCommenting on the item, former Thistle and Celtic keeper, Alan Rough, said: “This is a fantastic piece of Thistle history. Jimmy McMenemy was a legend in Scottish football and earned his place in the Jags history books as a member of the all-conquering 1921 Scottish Cup winning squad. It will be 100 years next year since the Scottish Cup win and 50 years since we won our last piece of silverware, so maybe 2021 will be our year again.”\n\nAfter hanging up his boots in 1922, McMenemy was appointed as coach at Partick Thistle before becoming assistant manager to Willie Maley at Celtic in 1934. He is largely credited with taking control of the team and introducing modern tactics, which led to the Empire Exhibition Cup success in 1938.\n\nThe Partick Thistle medal, which was consigned by an anonymous seller, appeared in the November auction at McTears."}, {"url": "https://www.glasgowworld.com/sport/football/partick-thistle-alan-rough-1971-league-cup-final-celtic-3430504", "page_content": "It is 50 years to the day since a Partick Thistle side ran out at Hampden Park to face European giants Celtic in the 1971 Scottish League Cup Final.\n\nNobody gave them a chance and who could blame the doubters?\n\nThis was a young Jags side who had been relegated the previous season only to bounce back immediately under the leadership of new manager Davie McParland.\n\nAdvertisement\n\nAdvertisement\n\nThe ensuing 90 minutes sent shock waves through the football world as first-half goals from Alex Rae, Bobby Lawrie, Denis McQuade, and Jimmy Bone had the Jags in a commanding 4-0 lead at half-time.\n\nYet there was still feeling among the Thistle’s ranks that Jock Stein’s imperious Hoops could mount a momentous comeback.\n\nAfter all, there were four members of the famous Lisbon Lions team – Jimmy Johnstone, Tommy Gemmell, Bobby Murdoch, and Jim Craig – along with rising stars Kenny Dalglish and Lou Macari that never knew when they were beat.\n\nDespite a barrage of Celtic pressure in the second half, a solitary strike from Dalglish proved little consolation as Thistle stood firm.\n\nAdvertisement\n\nAdvertisement\n\nIt was an afternoon fresh-faced 17-year-old goalkeeper Alan Rough will never forget as he recalled: “It flies by so quickly and the first thing I said to myself after the final whistle was ‘I wish I could do this all over again.’\n\n“We were the kind of team who played attacking football and we were vulnerable to losing goals.\n\n“At half-time we were 4-0 up and we didn’t think it was over as we knew they were regularly scoring five or six goals a game.\n\n“There was a lot of apprehension even though we were winning so easily because they had guys like Kenny Dalglish, Lou Macari and Harry Hood.\n\nAdvertisement\n\nAdvertisement\n\n“They had a lot of goal scorers so we just had to try and keep a level head on it and believe we could see it out.\n\n“Bizarrely I always used to keep a watch in my cap. I don’t know why but I did. I knew exactly how long was left when Dalglish scored. Someone said it was 21 minutes but I told them it was 22!\n\n“I actually wasn’t too busy in the second half and it is a tragedy we can’t see the 90 minutes of that match again. We only have 15 or 20 minutes of highlights.\n\n“We played as well in the second half as we didn’t in the first half and we didn’t have another few chances.\n\nAdvertisement\n\nAdvertisement\n\n“I do have a lasting memory of the second half just right at the start we could have scored another couple.\n\n“I think Denis McQuade was through and I think Evan Williams had a tremendous save, so we weren’t on the back foot by any manner of means, I think we handled the game quite well.”\n\nPartick Thistle celebrate with the League Cup after the Jags stunning win over Celtic in 1971. Picture: Contributed\n\nRough described Jags boss McParland as a “father figure” to him and believes that was the main reason Stein decided to bring him to Celtic as his assistant manager at the start of the 1976/77 season.\n\nHe added: “You have to remember, I think there were four of us that were only 18 or 19, four of us had just played our first-team games in a season in the lower divisions so he was like Jock Stein.\n\nAdvertisement\n\nAdvertisement\n\n“I think that is probably why Jock took him to Celtic, I think Jock saw a lot in Davie McParland in himself in his younger career and basically he was a father figure, he watched what you were doing, he was always on top of you if you weren’t toing the line, that kind of thing.\n\n“Tactical-wise you just have to look at the formation we played, 4-2-4, it was two full-backs attacking, four forwards, and that is the way we played and that was his philosophy of how we should be playing.”\n\nRough earned 53 caps for the national team, the majority coming under Stein’s tenure, and he still remembers vividly the ribbing he received from Scottish football’s greatest ever manager.\n\nHe reckons the biggest advantage Thistle had ahead of the Cup Final was the absence of centre-back Billy McNeil from the Celtic side.\n\nAdvertisement\n\nAdvertisement\n\nRough admitted: “All the time, he used to wind me up by saying it was ‘just a one off’, ‘we felt sorry for yous’ and all that carry-on, but I said, ‘aye that will be shining bright’.\n\n“For me I think one of the biggest factors of that was game was Billy McNeill not playing, and I spoke to big Billy, unfortunately he has passed away now, and he was sad he missed that game as well.\n\n“I thought he was a mainstay in their team and it was a bonus for us I think he got injured before that game.\n\n“It has become almost mythical because for provincial clubs like us, these days don’t come around very often.\n\nAdvertisement\n\nAdvertisement\n\n“St Johnstone were a perfect example last season and it is something you hang on to. The fact we beat Celtic in the final also makes it that bit extra special even 50 years on.”\n\nJock Stein on the pitch at Elland Road after being appointed Leeds United's new manager in August 1978.\n\nRemarkably, every member of Thistle’s 71’ squad are still around and will attend Firhill this afternoon when Ian McCall’s side take on bottom of the table Dunfermline.\n\nRough is hopeful the Jags can mark the occasion with a victory that would be sure to put a lot of smiles on people’s faces.\n\n“It would be fantastic,” he stated. “I think obviously Dunfermline will be a different Dunfermline to who we played in the first game of the season, obviously we’d like to carry on the Hamilton result which was fantastic.\n\nAdvertisement\n\nAdvertisement\n\n“It would just be a great start to the weekend, but nothing is predictable and I’m sure Ian (McCall) and the boys will have that in the back of their mind that it would make a lot of people happy if they could pull it off.\n\n“It will be a great day and if you mingle around our supporters there are still some who were at that game. Hopefully, there are plenty others who have heard about and will turn out in their numbers.\n\n“Everybody in our team is still alive, unfortunately in the Celtic team there are some legends who are no longer with us.\n\n“They won’t have great memories of that day, but I am sure if they were still here, they would be talking about it.\n\nAdvertisement\n\nAdvertisement\n\n“I remember as soon as those 90 minutes finished in the cup final, the first thing was every Celtic player to a man came over and congratulated us, there was no walking off the park or anything like that.\n\n“I think they appreciated what we had done, which I just think is a great thing for a team like Celtic to do.\n\n“But it is a tragedy that some of the Celtic boys aren’t here because they are big, big legends at their club”\n\nRough has been monitoring the progress of current Thistle keeper Jamie Sneddon, who continues to impress between the sticks.\n\nAdvertisement\n\nAdvertisement\n\nSneddon is a product of Hearts youth system and the former Scotland legend has tipped the 24-year-old to have a big future in the game.\n\nHe said: “I think he’s improved year on year. He has obviously had to fight for his place, which is a good thing as well.\n\n“The manager had a decision at the beginning of the season who to go with and in fairness he gave both of them a shot. Jamie came out winning that one and since he’s come back in he has been fantastic."}, {"url": "https://www.thecelticwiki.com/players-who-never-played-a-game-a-l/", "page_content": "Player Season Season Club Club Comments\n\nFrom To Signed from Playing with\n\nJohnny Adams 1994-95 1995-96 Celtic BC Celtic From Wishaw. Signed early ’94 and playing for the Youths / U18 side. Was in the U19 squad in mid August 94 at Sunderland International Youth Tourney. Went to International Youth Tournament, Kearney, USA with U18’s\n\nJonathan Afolabi 2019\n\nKenny Aird 1964-65 1965-66 Drumchapel Strollers Celtic inside or outside left mostly Combined Reserves with occasional A Reserves; was freed in the cull at\n\n\n\n1965-66 1967-68 Celtic St Mirren the end of 64/65.\n\n1967-68 1972-73 St Mirren St Johnstone\n\n1972-73 1976-77 St Johnstone Hearts\n\n1976-77 1977-78 Hearts Toronto\n\n1977-78 1977-78 Toronto Arbroath\n\nSean Anderson 2004-05 2006-07 Pro Youth Academy Celtic left Celtic Feb, 06; joined Dundee Utd Reserves; signed to main team 7/07 to 5/08; left for East Stirling.\n\n2007-08 2007-08 Celtic Dundee Utd\n\nWillie Angus 1911 1914 Carluke Rovers World War One legend who won the Victoria Cross\n\n\n\n2008-09 2008-09 Dundee Utd East Stirling\n\n2009-10 2009-10 East Stirling Montrose\n\n2009-10 2009-10 Montrose Lochee United\n\n2010-11 Lochee United East Stirling\n\nWilliam Ankarhake 2010-11 2011-12 Nykoppings Atvidabergs U19 Swedish kid who had a trial at Stoke academy but chose Celtic over Stoke; it would appear separation from country and family proved to much and he returned to Sweden at the end of the season.\n\nDavid Annand 1994-95 1994-95 Celtic Boys Club Celtic CBC U16; onto Groundstaff for 1 season\n\nGary Arbuckle 2000-01 2003-04 ? Celtic\n\n2004-05 2007-08 Celtic Clyde\n\n2008-09 2008-09 Clyde Queen of the South released at the end of the season\n\nWalter Arnott 1898\n\nCallum Bagshaw 2008-09 2010-2011 Aberdeen Youth Celtic released at end of season\n\nIan Baillie 1975-76 1975-76 Kilbirnie Ladeside Celtic LB; regular Reserve 75/76\n\n\n\nJames Baillie 1963-64 1964-65 Lochore Welfare Celtic young left half taken on after the public trial on 14/8/64; freed at the end of 64/65\n\n\n\n1965-66 1968-69 Celtic Alloa\n\nRoss Ballantyne 2001-02 2001-02 ? Celtic Released from Motherwell 31/5/04; joined Kilwinning Rangers; then played for East Kilbride Thistle\n\n2002-03 2003-04 Celtic Motherwell\n\n2004-05 2008-09 Motherwell Arthurlie\n\n2008-09 2009-10 Arthurlie East Kilbride Thistle\n\nJohn Balmer 1971-72 1973-74 Beith Celtic centre forward joined in April ’72; left sometime in ’74\n\n\n\nStuart Balmer 1987-88 1990-91 Gairdoch BC Celtic See Player Profile link\n\n1990-91 1997-98 Celtic Charlton Athletic\n\n1997-98 1998-00 Charlton Athletic Wigan Athletic\n\n1998-00 2000-01 Wigan Athletic Oldham Athletic\n\n2000-01 2001-02 Oldham Athletic Scunthorpe Utd\n\n2002-03 2003-04 Scunthorpe Utd Boston Utd\n\n2004-05 2004-05 Boston Utd Clyde\n\n2005-06 2005-06 Clyde Hamilton\n\nGraham Barclay 1973-74 ? Blantyre Vics Celtic GK; joined as a 16 y.o.\n\nJim Beattie 1991-92 1992-93 Celtic St Mirren\n\n1993-94 1993-94 St Mirren Ayr Utd\n\n1993-94 1994-95 Ayr Utd Albion Rovers\n\n1995-96 ? Albion Rovers Petershill\n\nStuart Beattie 1984-85 1984-85 Ardeer Recreation Celtic played in Youth Cup\n\n1984-85 1984-85 Celtic Ardeer Recreation\n\n1985-86 1985-86 Ardeer Recreation Rangers\n\n1986-87 1988-89 Rangers Doncaster Rovers\n\n1989-90 ? Juniors Had testimonial Ayrshire Junior X1 v Rangers 21.04.96\n\nGary Bendoris 1989-90 1990-91 Celtic BC Celtic\n\n1991-92 1991-92 Celtic St Mirren\n\nTommy Berwick 1973-74 ? Celtic BC Celtic RB, signed on an S-Form\n\n\n\nIan Black 1976-77 1978-79 Tranent Celtic\n\n1978-79 1979-80 Celtic Hearts\n\n1979-80 1980-81 Hearts Hibs\n\n1980-81 1980-81 Hibs East Fife\n\n1980-81 1981-82 East Fife Berwick Rangers\n\n1982-83 ? Berwick Rangers Ormiston Primrose\n\nSean Boggins 1950-51 ? Caman Celtic (Ireland) Celtic\n\nStephanne Bonnes 1999-00 2003-04 FC Mulhouse Celtic\n\n2003-04 2003-04 Celtic Partick Thistle\n\n2004-05 ? Partick Thistle St Louis Neuweg\n\n1999-00 2001-02 Celtic Queens Park\n\n2002-03 Queens Park Juniors\n\nDeclan Boyle 1995-96 1996-97 Sligo Rovers Celtic see player profile link\n\nDavid Brady 1961-62 1964-65 Lourdes School Celtic outside left; signed in ’61-62; Combined Reserves in ’62-63;was released at the end of ’63-’64 and\n\n\n\n1964-65 1964-65 Celtic Third Lanark joined Third Lanark under then manager Bobby Evans\n\n\n\nJoe Bradley 2005-06 2008-09 Celtic Academy Celtic Useful and keen RW / RMF; started breaking into the team then fell away; released\n\n2008-09 2008-09 Celtic St Mirren U19’s\n\n2009-10 St Mirren Beith\n\nJohn Brankin 1963-64 1963-64 Coatbridge St Pats HS Celtic\n\nKieran Brennan 2001-02 2010-11 celtic Academy Celtic released at the end\n\nFrancis Breslin 1976-77 1976-77 Dalry Thistle Celtic\n\nDavid Brown 1964-65 1964-65 Dundonald Bluebell Celtic Goalkeeper joined at start of 64/65 with Combined Reserves; freed at the end of 64/65\n\n\n\nGraham Brown 1975-76 1977-78 Celtic BC Celtic GK; signed Feb ’76\n\n\n\nRamsey Brown 1961-62 1962-63 St Roch’s Celtic made the ‘A’ reserve side; forward (inside left); released on a free in May 1963\n\n\n\nHugh Bryceland 1953-54 1954-55 St Anthonys Celtic Hugh’s younger brother Tommy could have been a Celt but chose to join St Mirren\n\n\n\n1960-61 1962-63 ? Albion Rovers\n\nPaddy Buckley A centre forward who got Celtic and our Manager Jimmy McGrory into trouble regarding his signing late 40s.\n\nDeclan Bunting 2007-08 2011-12 St Mary’s Bangor FC Not seen after October 10/11 when he sustained a serious knee injury. Was released after rehab is now believed to be playing with Bangor FC.\n\nAlex Burns 1958-59 1958-59 Cambuslang Rangers Celtic Goalkeeper;played the one season in the reserves then released and returned to cambuslang Rangers\n\nJames Burns 1955-56 1955-56 Maryhill Harp Celtic\n\nJohn Burns 1924-25 1925-25 Ormiston Primrose Celtic & Leith Athletic Signed as cover for ageing Alex McNair farmed out to Leith Athletic then released. Went to East Stirlingshire.\n\nKevin Byrne 1978-79 1979-80 Celtic BC Celtic\n\n1979-80 1980-81 Celtic Dumbarton\n\nPaul Cahillane 2005-06 2007-08 Belvedere Celtic released summer 2008\n\nJoseph Campbell 1946-47 1949-50 St Anthonys Celtic\n\n1949-50 1950-51 Celtic Leyton Orient\n\n1950-51 1950-51 Leyton Orient Gillingham\n\nKenny Campbell 1990-91 1990-91 Celtic BC Celtic\n\n1991-92 1991-92 Celtic Alloa\n\n1992-93 ? Alloa Blantyre Vics\n\nMark Canning 1999-00 1999-00 Celtic BC Celtic\n\n2000-01 2004-05 Celtic Kilmarnock\n\n2004-05 2005-06 Kilmarnock Stirling Albion\n\n2006-07 2008-09 Stirling Albion Dumbarton released by Dumbarton end of season 08/09\n\nGary Carberry 1995-96 1995-96 Celtic BC Celtic see Player Profile link\n\n1996-97 1997-98 Celtic Stirling Albion\n\nTommy Carmichael 1959-60 1961-62 St Andrews United Celtic Outside right Tommy Carmichael, signed at the end of the 59-60 season and immediately went\n\n1962-63 1962-63 Celtic Brechin full time.\n\n1963-64 1963-64 Brechin Hamilton\n\nNeil Carr -1971 1972-73 Maryhill Jnrs Celtic Goalkeeper taken on start of 71-72 season\n\n\n\n-1973 1973-74 Celtic Clyde First team GK at Clyde. On release joined Glencairn\n\n\n\n-77 Clyde Rutherglen r eleased December 1977\n\n? Carruthers 1961-62 1961-62 Celtic centre half; appears on teamsheets in Combined Reserve league side\n\nMark Casey 1998-99 2000-01 Celtic BC Celtic\n\n2000-01 2004-05 Celtic Portsmouth\n\n2005-06 Jan-08 Portsmouth Ayr Utd\n\nJan-08 Jun-08 Ayr Utd Glenafton\n\nJun-08 still Albion Rovers\n\nEddie Cattenach 1970-71 1973-74 Grangemouth International BC Celtic Brother of David Cattenach.\n\nFrank Cassidy 1964-65 1964-65 Ashfield Celtic Taken on as a provisional during 64/65 and released at the end of the season\n\n\n\nKevin Cawley 2005-06 2008-09 Celtic Academy Celtic\n\n2009-10 2009-10 Celtic Ayr United\n\n2010-11 Ayr United East Stirlingshire\n\nAlan Chappell 1963-64 1964-65 Lochore Welfare Celtic released at the end of 64/65\n\n\n\nPeter Cheney 1988-89 Celtic Youth Cup player.\n\nCharlie Christie 1987-88 1988-89 Inverness Thistle Celtic Became manager of Inverness Caledonian Thistle.\n\n1988-89 1993-94 Celtic Inverness Caledonian\n\n1994-95 2003-04 Inverness Caledonian Inverness CT\n\nGareth Christie 2002-03 2005-06 Home Farm BC Celtic Released fr Kildare County at start of 07/08. Current whereabouts not known.\n\n2006-07 2007-08 Celtic Kildare Co.\n\nGerry Christie -1974 1974-75 Celtic BC Celtic outside left; signed in April ’74 as an S Form;\n\n\n\n1975-76 1976-77 Celtic Irvine Meadow\n\n1976-77 1984-85 Irvine Meadow Ayr\n\n1984-85 1986-87 Ayr United Airdrie\n\n1986-87 1987-88 Airdrie Clydebank\n\nJim Clarke 1966-67 1968-69 St Michaels Kilwinning Celtic taken on provisionally in 66-67 and a decent forward scoring goals when played in Reserves\n\n\n\n1969-70 1970-71 Celtic Kilmarnock\n\n1970-71 1970-71 Kilmarnock Morton\n\nJacky Clarke 1968-69 1969-70 Shamrock Rovers Celtic centre half; impressed in the Friendly 18/3/68 and signed for the new season 68/69\n\n1969-70 Celtic Bohemians he returned to |Ireland in Nov 1969 to play for Bohemians\n\nJohn Clifford 1950-51 1951-52 Carfin Harp Celtic\n\nJohn Clifford -1976 1977-78 Forth Wanderers Celtic 17 y.o striker scouted and watched and signed in December 1976; played for Reserves in 77/78 and\n\n\n\n1977-78 1978-79 Celtic Motherwell released April ’78\n\nThomas Clifford Ayr Glossop\n\nHaydn Cochrane 2010-11 Celtic Clyde Been with Celtic since age 10. Joins Clyde 05/10.\n\nMarc Cocozza 1997-87 2001-02 St Johnstone BC Celtic\n\n2001-02 2002-03 Celtic Dundee United\n\n2002-03 2002-03 Dundee United Forfar\n\n2003-04 2003-04 Forfar Johnstone Burgh\n\n2004-05 2004-05 Johnstone Burgh Maryhill Juniors\n\nMichael Collins 1964-65 1965-66 Thornton Hibs Celtic\n\n1966-67 1966-67 Celtic Alloa\n\n1966-67 1966-67 Alloa Brechin\n\n1966-67 1966-67 Brechin Stenhousemuir\n\n1967-68 ? Stenhousemuir St Andrews United\n\n1970-71 1970-71 St Andrews United Alloa\n\nJohn Colquhoun 1957-58 1959-60 Strathallan Hawthorn Celtic\n\n1959-60 1961-62 Celtic Stirling Albion\n\n1961-62 1963-64 Stirling Oldham\n\n1964-65 1967-68 Oldham Scunthorpe\n\n1968-69 1970-71 Scunthorpe Oldham\n\nCraig Connell 2005-06 2007-08 Celtic\n\n2008-09 2008-09 Celtic Kilmarnock\n\nLuca Connell 2019 2022 Bolton\n\nOwen Connelly 1964-65 1964-65 Tuliallan Thistle Celtic Taken on as a provisional in 64/65 and released at the end of the season\n\n\n\n1965-66 1966-67 Celtic East Stirling\n\nTommy Connors 1948-49 1948-49 Brentford Celtic\n\nHugh Conroy 1946-47 1946-47 Celtic\n\nMike Conway 1979-80 1979-80 Campsie Black Watch Celtic\n\n1985-86 1992-93 ? Stirling Albion\n\n1993-94 1993-94 Stirling Albion East Stirling\n\n1994-95 ? East Stirling Cumbernauld Utd\n\nRay Cormack 1967-68 1968-69 Salvesen BC Celtic\n\n1969-70 1969-70 Celtic Dundee\n\n1970-71 1970-71 Dundee Raith\n\nEddie Corrigan 1963-64 1964-65 Ashfield Celtic an inside left, was signed at least provisionally and played for Combined Reserves\n\nMarco Cortani 1998-99 1999-00 AS Roma Celtic\n\n2000-01 2000-01 Celtic Civitavecchia\n\n2000-01 2000-01 Civitavecchia Pisoniano\n\n2001-02 2001-02 Pisoniano AS Astrea\n\n2002-03 2002-03 AS Astrea Lupa Frascati\n\n2003-04 2003-04 Lupa Frascati US Sorianese\n\n2004-05 2007-08 single seasons with Terracina, Anziolavinio, Pomezia + untraced team\n\n2008-09 still ? SS Formia\n\nMarty Coughlin 1994-95 1994-95 San Diego (USA) Celtic See Player Profile Link\n\nJoe Coyle -1975 1975-76 Greyfriars BC Celtic MF, OR; Greyfriars BC; provisional signed Apr ’75, 17 y.o. Juvenile international\n\n1976 1977 Celtic Shettleston went to Shettleston where did well in Juniors and looked at by a number of clubs\n\n\n\n1977 1982-83 Shettleston Dumbarton\n\n1982-83 1983-84 Dumbarton Airdrie\n\n1983-84 1985-86 Airdrie Dumbarton\n\n1985-86 1986-87 Dumbarton Morton\n\n1986-87 1986-87 Morton Arbroath\n\n1987-88 1987-88 Arbroath Stranraer\n\nJohn Cranston 1950-51 1950-51 Musselburgh Celtic\n\nGerry Crawley 1978-80 1978-80 Goodyear Amtrs Queen’s Park\n\nDumbarton\n\nBrechin\n\nSt. Johnstone\n\nBath City\n\nWillie Crayton 1985-86 1987-88 Celtic BC Celtic\n\nHenry Creaney -1975 1977? Celtic BC Celtic S-Form June ’75; farmed out to Maryhill; started with Celtic Boys Club; went north to Ross Co then\n\n\n\n1977 1978 Celtic Ross County bought by Bertie Auld for Partick Thistle in August ’78. Forward.\n\n\n\n1978 ? Ross County Partick Thistle\n\nJohn Creechan 1978-79 1980-81 Celtic BC Celtic\n\nBobby Crilly 1973-74 ? Celtic BC Celtic mentioned as a S-Former in April ’74\n\n\n\nStuart Cringean 1999-00 2000-01 ? Celtic\n\n2000-01 2001-02 Celtic Clyde\n\n2002-03 2003-04 Clyde Falkirk\n\n2003-04 ? Falkirk Linlithgow Rose\n\n? still Linlithgow Rose Camelon Juniors\n\nBobby Crookston 1950-51 1950-51 Auchtermuchty Celtic\n\nGerry Crossley 1996-97 1998-99 Celtic BC Celtic see Player Profile link\n\nCraig Culkin 1995-96 1997-98 Jersey Scottish BC Celtic see Player Profile link\n\nCharles Cullen 1962-63 1963-64 St Rochs Celtic inside right/left with Combined Reserve League\n\n1964-65 1964-65 Celtic Third Lanark\n\nHugh Cunningham 1964-65 1965-66 Maryhill Harp Celtic\n\n1965-66 1966-67 Celtic Fulham\n\nJohn Cunningham 1976-77 ? Blantyre Celtic Celtic made the reserves bench in 76/77\n\n\n\nJIm Currie 1966-67 1966-67 Campsie Black Watch Celtic\n\nScott Cuthbert 2004-05 2008-09 Celtic BC Celtic Scotland under 21 international while with Celtic; captain Reserves, loan St Mirren 08/09\n\n2009-10 still Celtic Swindon Town\n\nPaul Dalglish 1995-96 1996-97 Celtic BC Celtic Son of Kenny Dalglish\n\n1996-97 1997-98 Celtic Liverpool Won 6 under 21 caps for Scotland after leaving Celtic\n\n1997-98 1998-99 Liverpool Newcastle\n\n1997-98 loan Newcastle Bury\n\n1998-99 2001-02 Newcastle Norwich City loans to Wigan at this time\n\n\n\n2002-03 2002-03 Norwich Blackpool l oaned to Scunthorpe\n\n2003-04 2003-04 Blackpool Linfield\n\n2004-05 2004-05 Linfield Modena (Italy)\n\n2005-06 2005-06 Modena (Italy) Livingston\n\n2005-06 2005-06 Livingston Hibernian\n\n2006-07 2006-07 Hibernian Houston Dynamo (USA)\n\n2007-08 2007-08 Houston Dynamo (USA) Kilmarnock\n\nBrian D’Arcy 1968-69 1969-70 Aberdeen Sunnybank Celtic\n\nAlan Davidson 1979-80 1980-81 Royal Albert Celtic Son of ex-referee Bobby Davidson\n\n1980-81 1980-81 Celtic Royal Albert\n\n1980-81 1981-82 Royal Albert Airdrie\n\n1982-83 1993-94 Airdrie Queen of the South\n\n1993-94 1993-94 Queen of the South Ards\n\n1994-95 1996-97 Ards Albion Rovers\n\nJim Davidson 1968-69 1974-75 Maryhill Juniors Celtic a centre half may have been released in May ’74\n\n\n\n1975-76 ? Celtic Pollok Juniors Joins Pollok July ’75\n\nWillie Davidson 1954-55 1954-55 Duntocher Hibs Celtic\n\nPeter Davis 1996-97 1996-97 Shelbourne Celtic\n\n? Delaney 1974 Celtic listed as RB against Albion Rovers in Challenge match Jan ’74\n\n\n\nJim Devine 1946-47 1948-49 Mossend Boys Guild Celtic\n\n1949-50 1949-50 Celtic Hamilton\n\nJames Devine 1958-59 1958-59 Petershill Celtic inside left\n\n\n\nCraig Devlin 1997-98 1999-00 Celtic Academy Celtic Youth GK; had periods w Juniors Troon Amateurs, Tower Hearts, Cumbernauld Utd.\n\n2000-01 2002-03 Celtic St Johnstone\n\n2003-04 2003-04 St Johnstone Ross County\n\n2004-05 ? Ross County Juniors\n\nKevin Docherty 1993-94 1995-96 Celtic BC Celtic Played CBC U16 through 93/94 season; signed to the Groundstaff at the end of that season; from\n\n\n\n1996-96 Reynir sandgerdi Cumbernauld and school at Our Lady’s High; Reserve and Youth Team Player 95/96; won promotion\n\n1996-98 ? Larkhall to Icelandic premier league 96 then went onto larkhall for a couple of years before playing for St\n\n1999-99 Finn Harps Rochs for 11 years winning promotion,player of the year and top goal scorer on several occasions\n\n1999-2010 St. Roch’s\n\nBilly Dolan 1991-92 1993-94 Giffnock North Celtic\n\n1993-94 1994-95 Celtic St Mirren\n\n1994-95 1994-95 St Mirren Albion Rovers\n\n1995-96 ? Albion Rovers Largs Thistle\n\nMark Donaghy 1990-91 1992-93 Giffnock North Celtic After retiring as a player became an agent for players running Arena Sports Agent Management. He was Neil Lennon an Maciej Zurawski’s agent..\n\n1993-94 1994-95 Celtic Morton\n\n1994-95 1997-98 Morton East Fife\n\n1998-99 1998-99 East Fife Partick Thistle\n\n1998-99 1999-00 Partick Thistle Alloa\n\nPatrick Donahgue Celtic\n\nPlayed for Celtic, Millwall Athletic, before joining Port Vale in 1922. (see link for 1920’s Donoghue standing next to the wee blue devil Alan Morton at the end of the second row is Patrick Donoghue, a Celtic player we have no record of on the wiki.Played for Celtic, Millwall Athletic, before joining Port Vale in 1922. (see link for photo\n\nDanny Donaldson 1980-81 1980-81 Maryhill Celtic\n\nThomas Donegan 1946-47 1953-54 Celtic Dumbarton\n\n1954-55 1955-56 Dumbarton Arbroath\n\nAlec Donnelly 1961-62 1962-63 Pumpherston Celtic\n\nbrother of John Donnelly ; Inside right; played for the A Reserves in ’61-’62 as a provisional; released and\n\n1963-64 1967-68 Celtic Arbroath returned to Pumpherston; trialled with Hibs; wanted by Chesterfield;\n\n\n\n1967-68 1967-68 Arbroath Falkirk\n\n1968-69 1970-71 Falkirk Stenhousemuir\n\nSteve Dornan 1988-89 1988-89 Celtic BC Celtic\n\nColin Douglas -1979 1979-81 Bellfield BC Celtic\n\n1981-82 1991-92 Celtic Doncaster Rovers\n\n1986-87 loan Doncaster Rovers Rotherham United\n\nJohn Paul Dow 1996-97 1997-98 Celtic BC Celtic see Player Profile link\n\n1997-98 1998-99 Celtic Motherwell\n\n1999-00 2007-08 Motherwell Greenock Juniors\n\n2008-09 still Greenock Juniors Largs Thistle\n\nEdward Dowdalls 1949-50 1951-52 St Johnstone Celtic\n\n1952-53 1952-53 Celtic Albion Rovers\n\nTroy Douglin 2000-01 2000-01 Torquay Utd Celtic\n\n2001-02 2001-02 Celtic Torquay Utd\n\n2002-03 2003-04 Torquay Utd Tiverton\n\n2003-04 2004-05 Tiverton Bromsgrove Utd\n\n2004-05 2005-06 Bromsgrove Utd Rushall Olympic\n\n2006-07 2007-08 Rushall Olympic Tipton Town\n\nMichael Doyle 1977-78 1979-80 Celtic BC see Player Profile link\n\nMichael Doyle 2001-02 2003-04 Cherry Orchard Celtic Capped at full level for Republic of Ireland while with\n\n2003-04 still Celtic Coventry City Coventry City\n\n2009-10 Coventry City Leeds Utd )(loan)\n\n2007-08 2007-08 Celtic\n\n2008-09 Celtic Kilmarnock squad No. 33\n\nTom Duddy 1960-61 1962-63 Maryhill Harp Celtic Centre half; signed as provisional but only played a few games; asked to be released from his\n\n\n\n1963-64 1963-64 Blantyre Celtic Airdrie contract with Celtic towards the end of 1961-62 season and joined Blantyre Celtic\n\n1964-65 1964-65 Airdrie Cowdenbeath\n\nIan Duff 1978-79 1978-79 Errol Rovers Celtic\n\nDavid Duffy 1949-50 1955-56 Dundee St Josephs Celtic\n\n1956-57 1956-57 Celtic Montrose\n\nJim Duffy 1979-80 1981-82 Maryhill Celtic While with Dundee was capped once for Scotland at under 21 level as an over age player.\n\n1981-82 1985-86 Celtic Morton\n\n1985-86 1990-91 Morton Dundee\n\n1990-91 1992-93 Dundee Partick Thistle\n\n1992-93 1996-97 Partick Thistle Dundee\n\nJohn Duffy 1948-49 1953-54 Dunkeld Amateurs Celtic\n\n1953-54 loan Celtic Arbroath\n\n1954-55 1954-55 Celtic Southend\n\nEamonn Duggan 1996-97 1997-98 Celtic BC Celtic on leaving had a trial w Rotherham; fr East Kilbride\n\n1998-99 ? Celtic Juniors\n\nDavie Duncan 1946-47 1953-54 Celtic East Fife\n\n1953-54 1954-55 East Fife Raith\n\n1955-56 1955-56 Raith Crewe\n\n1955-56 1958-59 Crewe Brechin\n\nPeter Duncan 1964-65 1964-65 New Blackburn Celtic a provisional centre forward taken on in and released at the end of 64/65; he returned to New Blackburn\n\n\n\n1965-66 1967-68 New Blackburn St Johnstone Athletic and in 1965/66 was in demand from Sheffield Wednesday, Falkirk and Morton\n\n\n\n1968-69 1968-69 St Johnstone Hamilton\n\nSimon Dunne 2006-07 2006-07 Shelbourne Celtic\n\nThomas Dunne 1963-64 1963-64 St Anthonys Celtic an inside right, Tommy Dunne signed from St Anthony’s provisionally in ’63-’64 and played Combined\n\n\n\n1964-65 1964-65 Celtic Leyton Orient Reserve football. When he was released he went south to Leyton Orient before returning to play for\n\n\n\n1964-65 1966-67 Leyton Orient Dumbarton tKilwinnig Rangers then Greenock Juniors before Dumbarton took him on.\n\n\n\n1967-68 1967-68 Dumbarton Albion Rovers\n\n1967-68 1970-71 Albion Rovers Dundee United\n\nGary Dunphy 2004-05 2004-05 Ferrybank AFC Celtic\n\n2005-06 still Celtic Waterford United\n\nMatt Dunsmore 1952-53 1953-54 Bonnybridge Celtic\n\nAlan Duthie 1972-73 1972-73 Edinburgh Athletic Celtic inside forward signed in April ’73 and farmed out to Newtongrange\n\n\n\nJames Elliot 2003-04 2004-05 Celtic BC Celtic Unable to trace post-Celtic\n\nChris Fahey 1995-96 1995-96 Celtic BC Celtic See Player Profile link – currently with Cumnock\n\n2005-06 2005-06 Larkhall Thistle Stenhousemuir\n\n2006-07 2007-08 Stenhousemuir Raith Rovers\n\n2008-09 2008-09 Raith Rovers Glenafton\n\n2009-10 Glenafton Cumnock\n\nConnor Fairley 2006-07 2009-10 Celtic Academy Celtic GK joined age 13 in ’05. Left for Hearts U19s.\n\n2010-11 Celtic Hearts\n\nIan Fairley -1975 1975-77 Melbourne Thistle Celtic farmed out to Newtongrange Star 75/76\n\n\n\nJim Feeney -1979 1979-80 Neilston Celtic signed some time in 1979 and played Reserve football thru 79/80\n\n\n\nPeter Feeney 1985-86 1986-87 Celtic Groundstaff, U18’s plus a few Reserve and Reserve sub spots\n\nScott Fergusson 1992-93 1993-94 Celtic BC Celtic\n\n1993-94 1994-95 Celtic Meadowbank\n\nHugh Ferry 1978-79 1978-79 Celtic BC Celtic\n\nSimon Ferry 2006-07 2010-11 Celtic\n\n2010-11 Celtic Swindon Town\n\nIslam Feruz 2005-11 Snubbed many at Celtic to sign for Chelsea, and turned his back on many who helped him and his family.\n\nRichard Filaret 2007-08 2008-09 Atletico Arad Celtic\n\nKjartan Finnbogason 2005-06 2006-07 KR Reykjavik Celtic\n\n2007-08 2008-09 Celtic Sandefjord (Norway)\n\n2009-10 Sandefjord Falkirk\n\nKevin Finnon 1988-89 1990-91 ? Celtic Reserve and Youth team player; Voted Celtic Boys Club U16 Boy of the Year 89/90; whereabouts unknown\n\nJim Fisher 1962-63 1962-63 Pollok Juniors Celtic Goalkeeper, brought in provisionally in December ’63 and released end of season\n\n\n\nSean Fitzharris 2006-07 2010-11 Rangers Youth Celtic Signed from Rangers youth; recruited to the Academy and played U17 & U19\n\n2011-12 continues Celtic Morton originally from Greenock\n\nPaddy Fitzpatrick 1996-97 1997-98 Celtic BC Celtic\n\n1998-99 1998-99 Celtic Motherwell\n\nBarry Fitzsimmonds 1992-93 1993-94 Celtic BC Celtic\n\n1994-95 ? Celtic Partick Thistle\n\nHugh Fletcher 1954-55 1955-56 Lochgilphead Celtic\n\nPeter Flynn 1998-99 2001-02 Celtic BC Celtic\n\n2002-03 2002-03 Celtic Hamilton Acc.\n\nEddie Folan 1957-58 1958-59 Dundee St Josephs Celtic\n\n1958-59 1962-63 Celtic Dundee St Josephs\n\n1962-63 1965-66 Dundee St Josephs Montrose\n\nEric Foley 2006-07 2008-09 Home Farm Celtic To Sporting Fingal for 2009\n\n2009 2009 Celtic Sporting Fingal\n\n2010 Sporting Fingal Shelbourne\n\nScott Fox 2003-04 2008-09 Dundee Utd Youth Celtic Left end of 2008/09; trial w Exeter City 10/09 and Lincoln 12/09.\n\n2009-10 2009-10 Celtic Queen of the South Took amateur contract w QotS Jan ’10\n\n2010-11 Queen of the South Dundee\n\nRay Franchetti 1971-72 1973-74 Baillieston Jnrs Celtic Centre Forward; signed in July 1971; made good inroads w the Reserves but gradually fell out of the\n\n\n\n1973-74 1974-75 Celtic Airdrieonians running a released on a free end of 72/73; first team at Airdrie\n\n\n\n1975-76 1980-81 Airdrieonians Albion Rovers\n\n1981-82 ? Albion Rovers Shettleston Juniors\n\nSandy Fraser 1983-84 1987-88 Hamilton Thistle Celtic\n\n1987-88 1988-89 Celtic Hamilton Accies\n\n1989-90 1994-95 Hamilton Accies Portadown\n\n1995-96 1996-97 Portadown Derry City\n\n1996-97 1996-97 Derry City Glenavon\n\n1997-98 ? Glenavon Omagh Town\n\nAllan Fraser 1998-99 2000-01 Celtic BC Celtic\n\nBert Fraser 1947-48 1948-49 Lochee Harp Celtic\n\n1948-49 1952-53 Celtic Hearts\n\n1953-54 1954-55 Hearts St Johnstone\n\n1954-55 1955-56 Montrose Montrose\n\nGary Fraser 2003-04 2003-04 Dundee schools Celtic\n\n2003-04 2003-04 Celtic Rangers\n\n2006-07 2008-09 SS. Peter and Paul Forfar Athletic\n\n2008-09 still Forfar Athletic Downfield Juniors\n\nScott Friel 2002-03 2003-04 Dublin City Celtic Moved on fr Clydebank in 07/08.\n\n2004-05 2006-07 Celtic Albion Rovers\n\n2007-08 2007-08 Albion Rovers Clydebank\n\nGraham Fyfe 1999-00 2001-02 S Form Celtic\n\n2002-03 loan Celtic Raith\n\n2003-04 2004-05 Celtic Cheltenham Town\n\n2005-06 2008-09 Cheltenham Town Hawkes Bay United (NZ)\n\n2009 Hawkes Bay United (NZ) Redlands United (AUS)\n\nGrant Gallagher 2007-08 2009-10 Celtic Academy Celtic\n\n2010-11 Celtic Stranraer\n\nJim Gallacher 1950-51 1950-51 St Anthonys Celtic\n\nDeclan Gallagher 2007-08 2011-12 Unknown Clyde Had a loan spell with Stranraer in Feb 2011 to the end of season; joined Clyde on a free on 9/8/11\n\nJim Gallagher 1996-97 1999-00 Glenea United Celtic\n\n2000-01 2002-03 Celtic St Patricks Athletic\n\n2003-04 2008 St Patricks Athletic Finn Harps\n\nFrancis Gardiner 1989-90 1989-90 Celtic BC Celtic\n\n1991-92 ? Celtic East Stirling\n\nDanny Gardner 2008-09 2008-09 Manchester College Celtic\n\n2009-10 2009-10 Celtic Flixton\n\n2009-10 2009-10 Flixton Crewe Alex.\n\nMichael Gardyne 2002-03 2006-07 Lawside Academy Celtic\n\n2006-07 loan Ross County\n\n2007-08 Jan-08 Celtic Morton\n\nJan-08 still Morton Ross County\n\nLaurence Gaughan 2007-08 2008-09 Liverpool Celtic To Sheffield FC, Eastwood Town\n\nStephen Gavin 1983-84 1983-84 Hutcheson Vale BC Celtic\n\n1983-84 1983-84 Celtic Cowdenbeath\n\n1984-85 1984-85 Cowdenbeath Fauldhouse United\n\n1984-85 1984-85 Fauldhouse United Stenhousemuir (trial)\n\n1985-86 1987-88 Stenhousemuir Stirling Albion\n\n1987-88 1987-88 Stirling Albion St Johnstone\n\n1988-89 1988-89 St Johnstone Broxburn Athletic\n\n1988-89 1989-90 Broxburn Athletic Stenhousemuir\n\n1990-91 ? Stenhousemuir Linlithgow Rose\n\nGerard Gillan 1963-64 1964-65 St Anthony’s Celtic Gerrard Gillan was an inside forward signed provisionally from St Anthony’s who played a good\n\n\n\n1965-66 1967-68 Celtic Ashfield number of games for the Combined Reserves in ’63-’64 and is pictured in the Public trial at the start\n\n\n\n1967-68 ? Ashfield St Anthony’s of 64-65. Released end of 64/65 season. Went on to play for Ashfield then back to the Ants\n\n\n\nMichael Gilhooley 1913 1920 Celtic Vale of Leven Went to to play for a number of clubs, and also won a cap in 1922 for Scotland\n\n\n\nPaul Gillies ? 1992-93 Aberdeen Boys Club Celtic Released from the Groundstaff at the end of the season. Believed to be playing Highland League\n\n\n\n1992-93 1992-93 Celtic Highland League football\n\n\n\nWillie Gillies 1954-55 1954-55 Petershill Celtic\n\nKevin Gilligan 1995-96 1996-97 Guernsey Rovers Celtic From the channel island, Guernsey. Invited for trial in summer of 1994. Impressed enough to be offered S forms allowing him to sign for the club while continuing to live at home in Guernsey. Was offered a 2 year Professional contract by then manager Tommy Burns when he turned 16. Unfortunately, his time at Celtic was hampered by a number of serious knee injuries and he left the club by mutual consent after his contract had ran out.\n\nJack Gilroy 1946-47 1951-52 Celtic\n\n1952-53 1954-55 Celtic St Johnstone\n\n1955-56 1956-57 St Johnstone Stranraer\n\n1957-58 1957-58 Stranraer Stenhousemuir\n\n1957-58 1959-60 Stenhousemuir Montrose\n\n1959-60 1959-60 Montrose Cowdenbeath\n\n1960-61 1960-61 Cowdenbeath Forfar\n\n1960-61 1960-61 Forfar Albion Rovers\n\nHugh Gilshan 1963-64 1963-64 Greenock Celtic\n\n1964-65 1966-67 Celtic Ayr United\n\n1967-68 1971-71 Ayr United St Mirren\n\nDaniele Giordano 2008-09 2011-12 US Lecce Youth Perugia He had loan spells at Montrose and at the end of 10/11 he moved on a free to Perugia\n\nShay Given 1992-93 1993-94 Lifford Celtic Celtic Released by Celtic, became Republic of Ireland international goalkeeper and capped more than 80 t\n\n\n\n1994-95 1997-98 Celtic Blackburn Rovers times overtaking Pat Bonner’s record number of appearances\n\n\n\n1995-96 loan Blackburn Rovers Swindon Town\n\n1995-96 loan Blackburn Rovers Sunderland\n\n1997-98 2008-09 Blackburn Rovers Newcastle United To Man City for £5.9m in January 2009\n\n2008-09 2010-11 Newcastle Utd Manchester City\n\n2010-11 continues Manchester City Aston Villa\n\n2013 2014 Aston Villa Middlesbrough loan\n\nWilliam Glover\n\nCeltic\n\nStephen Gnaulati 1963-64 1963-64 St Rochs Celtic inside left; played for the A Reserves in 63-64\n\n\n\n1963-64 1963-64 Celtic Dumbarton\n\nBernie Godzik 1973-74 1978-79 Celtic BC Celtic S-Former April ’74; released on a free April ’79; 1993: Campbelltown Rams (NSW)\n\n1979-80 1979-80 Celtic Airdrie\n\n1980-81 1981-82 Airdrie Dover Athletic\n\n1982 ? Dover Athletic APIA Leichhardt\n\nCharlie Goldwyre 1992-93 1994-95 Celtic BC Celtic S-Form signing end 91/92 season; X-Form season 93/94 and full time onto Groundstaff; from Perth; regular Youth Team Player 93/94, 94/95; U19 squad mid August 94.\n\n\n\n1995-96 1995-96 Celtic Berwick Rangers Left the Club March ’95 for Berwick Rangers full pro contract via Frank Connor connection.\n\n2001 2007 ? Paderborn Utd. Never played for ‘the wee gers’ then joined the British army at some point and enjoyed a long spell at German ex-pat side Paderborn Utd before being dispatched to Afghanistan.\n\nBrian Goodwin 1965-66 1967-68 Schools Celtic Celtic were interested in Goodwin as a 15 year old outside right at Our Lady’s High and he was in\n\n\n\n1967-68 1967-68 Celtic Chelsea for training. In the 66-67 the Press reported Celtic interested in an outside right of the same name\n\n\n\n1968-69 1970-71 Chelsea Hamilton from Blantyre Vics.\n\n\n\n1970-71 1970-71 Hamilton Accies Dumbarton\n\n1971-72 1972-73 Dumbarton Stranraer\n\nJim Gormley 1973-74 1973-74 St Aidan’s School Celtic\n\n1974-75 1977-78 Celtic Junior Football\n\n1977-78 1980-81 Junior Football Hamilton Accies\n\n1981-82 1981-82 Hamilton Accies Albion Rovers\n\nCharles Gorevin 1888 Played in the first ever Celtic Match\n\nIain Gourlay 1972-73 1976-77 Celtic BC Celtic FB signed after international Youth tournament in Apr. ’73; farmed out to Maryhill Juniors for 74/75;\n\n\n\n1977-78 1978-79 Celtic Clydebank regular in Reserves 75/76;\n\n\n\n1979-80 1981-82 Clydebank East Stirling\n\nPeter Gowans 1960-61 1962-63 Dundee Shamrock Celtic inside right; played Combined Reserves in ’61-’62; released on a free in May 1963\n\n\n\n1963-64 1966-67 Celtic Crewe Alexandra\n\n1966-67 1969-70 Crewe Alexandra Aldershot\n\n1970-71 1973-74 Aldershot Rochdale\n\n1973-74 1973-74 Rochdale Southport\n\nMichael Graham 2005-06 2008-09 Celtic Academy Celtic\n\nCharlie Grant 2003-04 2009-10 Celtic BC Celtic Daily Record’s ‘gies a game’ summer 09 & 10.\n\n2010 Celtic Dundee Still on Celtic’s books during season 2009/2010.\n\nJohn Grant 1959-60 1960-61 Gowanhill United Celtic mentioned on reserve team lists 1961-’62 season\n\n\n\n1960-61 1960-61 Celtic East Fife\n\nBilly Gray 1975-76 1977? St Luke’s BC Celtic Fwd; farmed out to Blantyre Vics; played against Rangers Reserves Aug ’75\n\n\n\nBilly Green 1963-64 1963-64 Ashfield Celtic inside right, provisional signing start 63/64; Billy went on to coach Giffnock North and Pollok Juniors after finishing playing Junior football with Ashfield and Blantyre Celtic\n\n\n\nChris Greechan 1973-74 ? Kirkintilloch Rob Roy Celtic signed as a 16 y.o in September ’73\n\nGordon Greenfield 1978-79 1979-80 Queens Park Celtic\n\n1980-81 1981-82 Celtic Ayr United\n\n? Grubb 1959-60 1960-61 Celtic\n\nJack Greenwood 1947-48 1948-49 Dundela Celtic goalkeeper trialled and played only for Combined Reserves\n\n1948-49 ? Celtic Glentoran\n\nStefan Gryzka 1971-72 1974-75 Whitehill Welfare Celtic GK; joined in April ’72 and pitched in to Reserve game against Hearts\n\n\n\n1974-75 1976-77 Celtic Albion Rovers joined Albion Rovers August ’74\n\n\n\n1977-78 ? Albion Rovers Pollok Juniors\n\nAndrew Gutman 2019 2021\n\nCraig Haldane 1992-93 1992-93 Celtic BC Celtic\n\nIan Hall 1968-69 1971-72 Tranent Jnrs Celtic Inside Forward; was sub in pre-season Friendly v Stenhousmuir 1969\n\n\n\n1969-70 loan Celtic Hamilton Accies\n\n1971-72 1971-72 Celtic Darlington joined Darlington 10th July 1971\n\n\n\n1971-72 1974-75 Darlington Berwick Rangers\n\n1974-75 1974-75 Berwick Durban United (RSA) South Africa\n\n1974-75 1975-76 Durban United (RSA) Hamilton Accies\n\n1975-76 1977-78 Hamilton Dunfermline Ian Hall died aged 28 on the weekend before 4/10/78\n\n\n\nStephen Hall 2007-08 2007-08 Celtic\n\n2008-09 2008-09 Celtic Hamilton Acc. appears to have joined Hamilton as youth GK\n\n2009-10 2009-10 Hamilton Acc. Alloa\n\nJohn Halpin 1963-64 1966-67 Our Ladys HS Celtic centre half who was quickly moved up from Combined Reserves to A Reserves but never broke into\n\n\n\n1967-68 1971-72 Celtic Stranraer the first team; freed in May ’67 he went on to play for Stranraer.\n\n\n\nSteven Hamill 1994-95 1994-95 Possil YM Celtic\n\nJohn Hanlon 1948-49 1949-50 Fauldhouse United Celtic\n\n1949-50 1949-50 Celtic Arbroath\n\nJim Harkins 1967-68 1967-68 Renfrew Celtic believed to have been a goalkeeper and was on the groundstaff in July 1967; may have come from\n\n\n\n1968-69 1970-71 Celtic Dumbarton Vale of Leven.\n\n\n\n10970-71 1971-72 Dumbarton Shettleston very well thought of keeper in Junior football\n\n\n\n1971-72 Shettleston Benburb\n\nRoss Harris 2004-05 2005-06 Celtic BC Celtic\n\n2006-07 2006-07 Celtic Dundee\n\n2006-07 2007-08 Dundee Stirling Albion\n\n2008-09 ? Stirling Albion Albion Rovers\n\nBilly Harrison 1971-72 1971-72 Salvesen BC Celtic Centre forward; joined from Salvesen Boys Club in December; was last heard trialling with Albion Rovers\n\nJimmy Harrower 1968-69 1968-69 Glenrothes Celtic schoolboy international and provisional signing in ’68\n\n\n\nWillie Hastie 1989-90 1990-91 Australian Youth team Celtic\n\n1991-92 1991-92 Celtic Dundee spotted playing in a Youth Tournament\n\n1992-93 1993-94 Dundee Sligo Rovers p/t at Sligo Rovers\n\nJoe Hayes 1997-98 1998-99 Celtic BC Celtic\n\n1999-00 2007-08 Celtic Rutherglen Glencairn Vale of Clyde 09/10\n\n2008-09 still Rutherglen Glencairn Cumnock Juniors\n\nJohnny Hemphill 1967-68 1968-69 Port Glasgow Celtic taken on first at 16 training twice a week;unmentioned in Reserves; released end of 68-69 season and\n\n\n\n1969-70 1970-71 Port Glasgow Juniors Dumbarton returned to Port Glasgow Juniors; had a trial with Morton but moved to Dumbarton; inside right.\n\n\n\nPaul Hendrie 1971-72 1971-72 Kirkintilloch Rob Roy Celtic Outside left, former schoolboy international; taken on provisionally then released after 6 months;\n\n\n\n1972-73 1975-76 Kirkintilloch Rob Roy Birmingham City much in demand thereafter; trials down south; joined Birmingham City\n\n\n\n1976-77 1976-77 Birmingham City Portland Timbers (USA)\n\n1977-78 1978-79 Portland Timbers (USA) Bristol Rovers\n\n1979-80 1983-84 Bristol Rovers Halifax Town\n\n1984-85 1988-89 Halifax Town Stockport County Non-League with Nuneaton, Bath and Burton Albion before Non-League management to 2001\n\n\n\nRoss Hepburn 2006-07 2007-08 Celtic Academy Celtic\n\n2008-09 2008-09 Celtic Kirkintilloch Rob Roy Picked up by Rob Roy for one season. Then?\n\nMichael Herbet 1999-00 2003-04 Paris St Germain B Celtic\n\n2001-02 loan Celtic Hamilton Accies To Australia: Marconi Stallions, Sydney Olympic, Waverley Old Boys, Blacktown City.\n\nLeo Hjelde 2019 2021\n\nJulius Hjulian 1925 1926 First person ever on Celtic’s books to have played in the World Cup (1934 with the USA)\n\nJoe Hoey 1964-65 1964-65 Coltness Utd Celtic predominantly a centre forward but also played at outside left; released end of 64/65 season\n\n\n\nGary Holt 1993-94 1993-94 Army Celtic\n\n1994-95 1994-95 Celtic Stoke City Released by Celtic, went on to play 10 times for Scotland\n\n1995-96 2000-01 Stoke City Kilmarnock\n\n2001-02 2004-05 Kilmarnock Norwich City\n\n2005-06 2006-07 Norwich City Nottingham Forest\n\n2007-08 2009 Nottingham Forest Wycombe Wanderers\n\n2009 2009 Wycombe Wanderers Colchester Utd\n\n2009 20019 Colchester Utd Lowestoft Town\n\nRaymond Hood 1971-72 1971-72 Calderbank Am Celtic Inside Forward; joined Celtic November 1971; No longer appears with Lowestoft\n\nKirk Hudson 2004-05 2005-06 Ipswich Town Celtic\n\n2005-06 2005-06 Celtic Bournemouth\n\n2006-07 2009-10 Bournemouth Aldershot Town\n\n2010-11 Aldershot Brentford\n\nMatty Hughes 2008-09 2010-11 Rochdale Academy Celtic\n\nTom Hughes 1949-50 1950-51 Port Glasgow Celtic Released at the end\n\nPaul Hutchinson 2003-04 2005-06 Sunderland Celtic From Sunderland youth setup – the first youth from England ever signed by the club. Had offers from\n\n\n\n2006-07 2006-07 Celtic Newcastle Blue Star Man Utd and West Ham but chose Celtic. Released ’06\n\n\n\n2007-08 still Newcastle Blue Star Ashington AFC\n\nKenny Innes 1972-73 1976-77 Celtic BC Celtic Forward signed after International Youth Tournament in Apr ’73; farmed out to Maryhill Juniors for\n\n\n\n1977-78 1977-78 Celtic Falkirk 74/75. Reserve 75/76; became a sweeper at Falkirk; returned to Maryhill Juniors August ’78\n\n\n\n-1978 1978-79 Falkirk Maryhill\n\nGary Irvine 2004-05 2006-07 Celtic BC Celtic\n\n2006 loan Ross County a number of representative appearances in Friendlies and Testimonials\n\n2007-08 2009-10 Celtic St Johnstone\n\n2010-11 St Johnstone Dundee\n\nWillie Irvine 1972-73 1974-75 Dunipace Jnrs Celtic inside forward signed provisionally in December ’72.farmed out to Whitburn Juniors\n\n\n\n1977-78 1978-79 Fauldhouse United Alloa\n\n1978-79 1982-83 Alloa Motherwell\n\n1982-83 1986-87 Motherwell Hibernian\n\n1985-86 loan Hibernian Falkirk\n\n1986-87 1986-87 Hibernian Hearts\n\n1986-87 1986-87 Hearts Ayr United\n\nSteven Jack 1999-00 2003-04 Bellshill Celtic\n\nClyde\n\nStevie Jack 1993-94 1993-94 Celtic BC Celtic\n\nMichael Jago 2000-01 2000-01 Everton Youth Celtic Long career in the Junior ranks\n\n2007-08 still Caernarfon Town Joined the army; also spells with Chester City and Vauxhall Motors\n\nSteve Jardine 1978-79 1981-82 Shamrock BC Celtic First signed S-Form as a 15 y.o. in 1978.\n\n\n\nRobert Jeffrey 1961-62 1961-62 Celtic outside right; played Combined Resrve League in 61-62\n\nPhil Johnston 2008-09 2008-09 Hibernian Celtic RW; came from a strong Hibs U19 in March; released; went to Clyde FC’s open trials. Back in Celtic\n\n2010-11 Celtic Airdrie United Reserves 3/10 (?) trial w Ayr Utd 7/10; Airdrie 17.8.10 on 1yr deal.\n\nOwen Jones 2005-06 2006-07 Celtic\n\n2007-08 2007-08 Celtic Motherwell Young Welsh GK; left for Motherwell who released him after a season\n\nKevin Joyce 1995-96 1996-97 Celtic BC Celtic\n\nLubos Kamenar 2012 2013 Nantes (loan) see Player Link\n\nSteve Kean 1985-86 1986-87 Celtic BC Celtic Became assistant manager at Fulham, Real Sociedad, Coventry City – to manager Chris Coleman.\n\n1986-87 1986-87 Celtic Swansea City In Portugal w Academica Coimbra as player and coach and from there to Real Sociedad\n\nDouglas Keast -1975 1977? Schools Celtic Schoolboy international signed on S-Form\n\n\n\nJack Keay 1975-76 1976-77 Celtic BC Celtic CH; signed in Feb ’76\n\n\n\n1977-78 1981-82 Celtic Shrewsbury Town\n\n1982-83 1985-86 Shrewsbury Town Wrexham\n\n1986-87 Wrexham Derry City Captained Derry to an historic treble in 1988-89.\n\nScott Kellacher 1997-98 1998-99 Celtic BC Celtic Youth team; released 10/5/99; previous loan spell\n\n1999-00 1999-00 Celtic Inverness CT with Inverness Caledonian Thistle from 20/3/99;\n\n2000-01 2006-07 Inverness CT Nairn County played regularly w Nairn County; had half a season\n\n2006-07 2006-07 Elgin City with Elgin City at the end of 06/07; now works as a\n\n2007-08 2007-08 Nairn County coach with Inverness CT to the U19’s and U13’s; released from Nairn County end of 07/08\n\nGerry Kelly 2000-01 2000-01 Celtic Albion Rovers\n\nHugh Kelly 1995-96 1995-96 Celtic BC Celtic Long career in Junior ranks\n\nKevin Kelly 1985-86 1986-87 Celtic BC Celtic Playing Youth football with the club in an U18 role; he got a few Reserve outings as well as playing with the U18’s in the inaugural amateur league\n\nMike Kelly 1971-72 1973-74 Celtic BC Celtic centre half signed in July 72; probably left July ’74\n\n\n\nDavid Kenny -1979 1979-82 Eastercraigs BC Celtic\n\n1981-82 loan Celtic Dumbarton\n\n1981-82 loan Celtic Airdrie\n\n1982-83 1983-84 Celtic Partick Thistle\n\nAndrew Kennedy 2007-08 Hamilton Acc. Celtic Bought from Hamilton; Scotland U19 GK; out of\n\n2007-08 2010-11 Celtic Hamilton Acc. contract; returned to Hamilton\n\nLiam Keogh 1998-99 2001-02 Celtic BC Celtic Liam Keogh now works offshore on the rigs.\n\n2001-02 loan Celtic Forfar\n\n2001-02 2002-03 Celtic St Mirren\n\n2002-03 2006-07 St Mirren Inverness CT\n\n2007-08 2007-08 Inverness CT Peterhead\n\nPat Keogh 1991-92 1992-93 Celtic BC Celtic Capped at Junior level by Scotland. Left Forfar (1/09). Joins Beith but can’t get fit and retires.\n\n1998-99 2003-04 Maryhill Clyde\n\n2004-05 2005-06 Clyde Hamilton Acc.\n\n2006-07 2007-08 Hamilton Acc. Stranraer\n\n2008-09 2008-09 Stranraer Forfar\n\nStephen Kerr 2005-06 2008-09 Celtic St Johnstone U17 04/05; LW/FWD b. Dundee; On to St Johnstone and makes first team end 07/08. Given 6 month deal but released end 08. To Dundee Violet.\n\nTim Kiely 2005-06 2006-07 St Michael’s Celtic Stocky Irish striker from St. Michael’s FC, injured after signing but now recovered. A good number of\n\n\n\n2007-08 01-Aug Celtic Kilkenny City FC p laces on the U19 sides . Left to join Kilkenny City; with demise of Kilkenny he joined Cork City for\n\n2008 2009 Kilkenny City FC Cork City 0 8/09\n\n2010 Cork City Limerick\n\nMark Kilgallon 1978-79 1978-79 Celtic BC Celtic\n\nBilly Kilgannon 1964-65 1964-65 Dunipace Jnrs Celtic right back in Combined Reserves\n\nAndy Kilmartin 1999-00 2000-01 Rosario Youth Soccer Club Celtic\n\n2001-02 2002-03 Celtic Ballynahinch Olympic\n\n2002-03 2004-05 Ballynahinch Olympic Glentoran\n\n2005-06 still Glentoran Lisburn Distillery\n\nJim Knighton 1972-73 ? Shotts YM Celtic signed in March ’73 probably left July 74 or 75\n\n\n\nJ Kyles 1971-72 Maryhill Juniors Celtic Inside Forward; listed on full time roster start of 71/72 season\n\n\n\nDanny Lafferty 2005-06 2009-10 Oxford United Stars Celtic Loaned to Ayr 2/10\n\n2010-11 Celtic Derry City\n\nTom Lally 1970-71 1971-72 Sligo Rovers Celtic Came on trial at the beginning of 70/71 season\n\n\n\nOct ’71 Celtic St. Patricks Athletic returned to Ireland Oct’71\n\n\n\n8/78 St Patricks Athletic Galway Rovers\n\n? Laird 1974 Celtic listed at outside right in Challenge match against Albion Rovers Jan ’74\n\n\n\nFrank Lapinski 1971-72 1972-73 Tranent Juniors Celtic Centre Half; Taken on start of 71/72 season; straight into the Reserves\n\n\n\nAllan Lawson 1959-60 1963-64 Campsie Black Watch Celtic played as a left and right half for the Combined and A Reserves in ’61-’64\n\n1964-65 1968-69 Celtic Oldham Athletic\n\nIan Leckie 1961-62 1962-63 Ashfield Celtic goalkeeper; not called up in 62-63 and continued to play w Ashfield; was a provisional signing and was\n\n\n\n1963-64 1963-64 Celtic Oxford United released in May 1963\n\nPaul Leddie 1990-91 1991-92 Celtic BC Celtic Then Forfar Athletic, Keith\n\n1992-93 1992-93 Celtic St. Johnstone\n\nJohn / Alan Lee 1971-72 1972-73 Celtic BC Celtic S-Form, Celtic Boys Club, farmed out to Shettleston but free transferred in Jan 73\n\n\n\nWalter Lees 1964-65 1964-65 St Rochs Celtic Taken on as a provisional during 1964-65 and released at the end of the season\n\n\n\n1968-69 1974-75 Junior Football Watford\n\nJacob Lensky 2005-06 2005-06 Surrey United BC (Canada) Celtic Capped at under 21 level for Canada after leaving Celtic\n\n2006-07 2007-08 Celtic Feyenoord He returned to Canada at the end of 07/08\n\n2009-10 still ??? FC Utrecht returned to Holland\n\nMike Leonard -1974 Glasgow Perthshire centre forward; provisional signing in April 1974\n\n\n\n1974-75 Celtic free transfer eos\n\n1975-80 Sligo Rovers\n\n1980-81 Dunfermiline\n\n1981-? Pollok Juniors\n\nAlan Lindsay 2004-05 2004-05 Celtic Youth Celtic\n\n2005-06 2006-07 Celtic Ross County\n\n2007-08 2007-08 Ross County Stenhousemuir\n\n2008-09 Stenhousemuir Petershill\n\nBrian/Bernie Little 1974-75 1975-76 Cumbernauld United Celtic Celtic Boys Club, farmed out to Cumbernauld Utd; , plays for Reserves in August ’74\n\n\n\nGary Livingstone 2005-06 2007-08 Celtic BC Celtic\n\n2008-09 still Celtic Linlithgow Rose\n\nTom Livingstone 1968-69 1970-71 Cumbernauld Utd Celtic goalkeeper; first heard of as Scotland U15 GK on May 11th 1968; signed provisionally for 1968-69\n\n\n\n1971-72 1972-73 Ashfield Pollok Juniors season and on the books 1969-70. Released 71/72 back to Cumbernauld\n\nJoe Logan 1958-59 1958-59 ? Celtic Played in Benefit game against Dumbarton 1958\n\nStephen Low 2001-02 2004-05 Calderbrae BC Celtic U18 / U21 central defender; Moved up to the Elgin City; released 1/6/07; was playing for Shotts Bon\n\n\n\n2006-07 2006-07 Elgin City Accord; 09/10 w Bellshill Athl.\n\n2007-08 still Juniors\n\nJordan Lowdon 2005-06 2010-11 Celtic Academy Celtic Released at the end of the season\n\nJimmy Lumsden 1966-67 1969-70 Juniors Leeds Became Assistant Manager to Eddie Gray at Rochdale and Leeds Utd; management roles at\n\n\n\n1970-71 1970-71 Leeds Southend United Bristol City, where he signed Jackie Dziekanowski from Celtic, and Preston; Moved with David\n\n\n\n1971-72 1974-75 Southend United Morton Moyes to Everton; still assistant to Moyes at Everton; he moved with Moyes to Manchester Utd and\n\n\n\n1975-76 1977-78 Morton Clydebank received the manager’s fate too when Moyes was sacked by Man Utd in 2014.\n\n1978-79 1978-79 Clydebank Aberdeen Jimmy was brought to Celtic to work principally as a coach but was fit enough to play for the\n\n\n\n1978-79 1979-80 Aberdeen Celtic Reserves through 1978 and ’79.\n\n\n\nPhil Lynch 1958-59 1959-60 Schools Celtic Our Lady’s HS, Motherwell; Left back\n\n\n\nSam Lynch -1975 1977? Salvesen BC Celtic DF; signed at start of 75/76\n\nSteve Lynch 1959-60 1961-61 Drumchapel Amateurs Celtic Former St. Mungo’s Former Pupil; in youth side 60-61;released May 1961\n\nGerry Lyttle 1995-96 1997-98 Celtic BC Celtic Capped 8 times at under 21 level for Northern Ireland, twice while at Celtic\n\n1998-99 1999-00 Celtic Peterborough United\n\n1999-00 (dec) 1999-00 Peterborough United Kingstonian (loan)\n\n2000-01 2000-01 Peterborough United Ballymena United\n\n2001-02 2001-02 Ballymena United Newry City\n\n2001-02 (nov) 2002-03 Newry City Cliftonville\n\n2003-04 2004-05 Cliftonville Lisburn Distillery"}, {"url": "https://www.skysports.com/football/news/29032/11866154/lottery-winner-colin-weir-takes-over-partick-thistle-and-will-hand-club-back-to-fans", "page_content": "Lottery winner Colin Weir has completed the takeover of Partick Thistle and told fans he will hand the club over to them for free within months.\n\nThe lifelong Jags supporter, who won £161m on the Euromillions along with his ex-wife Christine in 2011, has bought a majority stake in the club through his group Three Black Cats (TBC).\n\nHis intention is to gift his newly-acquired 55 per cent stake in the Scottish Championship club to a new fan shareholding entity currently being developed, no later than the end of March.\n\nHe has also bought back parts of Thistle's ground at Firhill, bringing the stadium back to full club ownership after 10 years.\n\nImage: Partick Thistle are set to become community-owned\n\nWeir, 71, approached fans's group Thistle For Ever (TfE) in September and supported their offer to buy out Partick Thistle's majority shareholding in a move designed to make the club supporter-owned for the benefit of the community.\n\nTfE will now work with PTFC Trust to get a new structure in place to accept the share transfer. The new fan ownership group will be similar to Motherwell's Well Society.\n\nWeir, who had previously invested significantly in Thistle and its Academy said: \"Thistle for Ever (TfE) planted the thought of fan ownership as a real option in my mind.\n\n\"From there, TBC has taken the dream and is turning it in to a reality. But this has all happened quicker than anyone might have anticipated.\n\n\"That's why I have offered a three to four month window for fans to get everything in place before handing over shares.\n\n\"They want to get it right and I want to be sure that when the new entity is operational, there is a structure that will allow for a smooth transfer of ownership.\n\n\"This is a major financial commitment on my part as fan owners will not need to repay a penny - but I believe this gives fan ownership the best possible start.\n\n\"Today is a great day for a Club that means everything to me. I hope that fans can get behind this exciting development. They talk about Thistle being their Club - and now it really will be.\""}, {"url": "https://www.bbc.co.uk/sport/football/29718349", "page_content": "Last updated on .From the section Football\n\nHighlights: Celtic 6-0 Partick Thistle\n\nGuidetti scores first Celtic hat-trick\n\nIzaguirre ends four-year wait for a goal\n\nSubstitute Griffiths nets double\n\nThistle's Bannigan sent off in quarter-final\n\nCeltic routed 10-man Partick Thistle to seal their place in the semi-finals of the Scottish League Cup.\n\nJohn Guidetti once again demonstrated why moves are afoot to sign him on a permanent basis with a hat-trick.\n\nEmilio Izaguirre grabbed his first Celtic goal in four years after Guidetti's opener was followed by Stuart Bannigan's red card for Thistle.\n\nAnd Leigh Griffiths leapt off the bench to score a brace and complete the scoring.\n\nCeltic join Aberdeen,Dundee United and Rangers in Saturday's semi-final draw.\n\nThistle's last win at Celtic Park was in 1992 and their last League Cup success over Celtic was their famous 4-1 final triumph under Davie McParland in 1971.\n\nAnd the visitors settled well with Bannigan, Nathan Eccleston and James Craigen all flashing efforts wide of the target.\n\nBut as the first half progressed, Celtic grew into the game and took the lead on the half-hour after Guidetti had been hauled down by Abdul Osman.\n\nThe Swede - on loan at Celtic from Manchester City - stroked the free-kick home to give the favourites the lead.\n\nOn Halloween week, the horror was just beginning for the Maryhill men.\n\nGoal-hungry Guidetti John Guidetti has scored eight goals in eight appearances since joining Celtic on loan from Manchester City\n\nBannigan was shown a straight red card by referee Kevin Clancy for thumping into Guidetti who was left writhing in agony.\n\nHalf-time arrived but it was not long before the turkey-shoot got underway.\n\nIzaguirre's goal drought was ended as he thumped home a Stokes flick-on just after the break.\n\nGuidetti grabbed another from a superb arching free-kick before completing his treble from the penalty spot, the Swede having been fouled.\n\nAs the carnage unfolded, Griffiths arrived on the scene and headed an Izaguirre cross past Scott Fox.\n\nFox then drove a clearance off the former Hibernian forward and it spun into the far corner for Celtic's sixth.\n\nMercifully for the Jags, with half-an-hour still to play, the damage did not get worse.\n\nWhat will please manager Ronny Deila will be the nature of the performance in the closing stages as Celtic did not drop down into cruise control, with substitute Stefan Scepovic almost squirming an effort home.\n\nBut it stayed at six and Celtic's recent woes in the tournament look to be at an end.\n\nCeltic manager Ronny Deila: \"The second half was fantastic. We created a lot of chances and we opened them up.\n\n\"They went down to 10 men and it was difficult for Partick Thistle, but he deserved the red card, so that's not our fault.\n\n\"We were professional, we worked hard for 90 minutes and we created chances and a lot of good moments in the second half.\n\n\"We have five clean sheets in nine games now, so defensively it's good and offensively we still have to get things quicker, but I think we are going the right way.\"\n\nPartick Thistle manager Alan Archibald: \"Very disappointing.\n\n\"Game of two halves, the sending off changes things totally. There was nothing in the game up until the [first] free-kick [goal].\n\n\"We were very disappointed by the foul that led to it because we didn't think it was a foul.\n\n\"I didn't think Stuart had to make the challenge. It was a wee bit reckless. The game totally changes on that.\n\n\"We lost poor goals. The lads felt a bit sorry for themselves and that led to a couple of the soft goals that we lost.\n\n\"They've got to learn from it.\"\n\nGuidetti followed his free-kick Weekend goal against Kilmarnock with another converted set piece\n\nBannigan's red card gave Thistle a mountain to climb\n\nIzaguirre scored his first Celtic goal since October 2010\n\nGuidetti once again showed his prowess at free-kicks with the hosts' third\n\nGriffiths made a scoring contribution from the bench"}, {"url": "https://www.dailyrecord.co.uk/sport/football/football-transfer-news/transfer-deadline-live-celtic-rangers-19122163", "page_content": "It's finally all over.\n\nThe window has slammed shot. Greg Taylor is a Celtic player and Ryan Kent is a Rangers signing.\n\nElsewhere, St Johnstone have captured Jason Holt from the Ibrox giants, who offloaded Graham Dorrans earlier in the day.\n\nKirk Broadfoot is poised to sign for St Mirren after being released by Kilmarnock. The Rugby Park side are in the market for a striker with Osman Sow from Dundee United a target.\n\nHibs are working on a deal to land Jason Naismith on loan from Peterborough.\n\nBack in Glasgow Celtic are poised to confirm the signings of Manchester United’s Lee O'Connor and Manchester City's Jeremie Frimpong.\n\nIt's all quiet at Aberdeen and Hearts but don't rule out some late signing drama.\n\nFollow all the latest transfer news here LIVE!"}, {"url": "https://www.skysports.com/football/news/11095/12870587/swpl-round-up-glasgow-city-win-at-partick-thistle-and-celtic-claim-win-over-hibernian-but-rangers-draw", "page_content": "Glasgow City bounced back from back-to-back loses to defeat Partick Thistle in the 'Petershill Park' derby.\n\nThe Jags, who have lost all their matches since the split, started the game solidly as they looked to take advantage of a bruised City side. With the sides level into additional time of the first half, City took the lead to deal a sucker punch to Thistle. Bea Prades with a fine strike from the edge of the box after it fell kindly for the Spanish midfielder.\n\nWith less than an hour played, City found the final goal despite the best efforts of Megan Cunningham in the Partick Thistle net. It looked like she'd done enough by denying Linda Motlhalo from close range but the SWPL top goalscorer, Lauren Davidson, was on hand to fire home for her 24th goal in the league.\n\nThe result means Glasgow City remain top of the table, two points clear of Celtic, and Partick Thistle continue to occupy sixth. City host Hibernian on Wednesday while Thistle are away to Heart of Midlothian.\n\nCeltic 3-0 Hibernian\n\nCeltic kept pace at the top of the Park's Motor Group SWPL with a comfortable victory over Hibernian at the Excelsior Stadium.\n\nImage: Celtic ran out 3-0 winners over Hibernian\n\nIt was unlikely we'd see a repeat scoreline from the opening day of the season when Celtic were 9-0 winners, but they started fast with the opener after just 18 minutes. Former Hibee, Amy Gallacher, with a fine finish to take her top of Celtic's goalscoring charts in the league. Gallacher then turned provider with 40 minutes played, whipping in a corner for Chloe Craig to finish at the back post.\n\nWithin moments of the restart, Celtic increased their lead. Natasha Flint was alert to intercept the Hibs pass before finishing off for her fourth goal in her last three SWPL matches.\n\nCeltic remain two points behind Glasgow City and face Rangers, live on Sky Sports, this Thursday in what could be a monumental match for both sides' title chances. Hibernian are fifth and four points clear of Partick Thistle.\n\nRangers 1-1 Heart of Midlothian\n\nRangers were denied by a late Hearts penalty as they moved behind the top two in the battle for the Park's Motor Group SWPL trophy. It adds extra pressure on Malky Thomson's side for Thursday's clash with Celtic, live on Sky Sports, likely a must-win if Rangers are to retain their title.\n\nHearts are the only side outside of the top two to have taken any points against Rangers coming into the game, a 0-0 draw at Oriam back in January.\n\nThe opening goal of the game came with 37 minutes on the clock as Sam Kerr grabbed her fifth goal in her last four SWPL matches. The Scotland midfielder created the goal after driving into the opposition box, finding Kirsty Howat before it bounced back kindly for Kerr to smash home.\n\nIt looked set that Rangers would clinch all three points and keep pace at the top, but Hannah Davison conceded a penalty nearly three minutes into additional time for a foul on Cailin Michie. Former Rangers midfielder, Ciara Grant stepped up and smashed the ball home at the death.\n\nRangers are now five points behind Glasgow City and three behind Celtic ahead of Thursday's match. Hearts remain fourth, nine points clear of Hibernian with five games left to play.\n\nHamilton Academical 1-1 Dundee United\n\nHamilton Accies and Dundee United shared the spoils at New Douglas Park, leaving them five points apart with five games remaining. The result favours Dundee United who are in 10th and just outside the relegation play-off spot.\n\nDanni McGinley got the opening goal for United, her 13th in the league this season, after eight minutes. The United forward hammered her free-kick low and with enough power to pass Chloe Nicolson in goals.\n\nOne of Accies' star players, Josi Giard, was without a goal in her last seven matches before today and her strike could be vital for Accies avoiding the relegation play-off. The German forward's ball towards goal was from a tight angle and was parried in by Fiona McNicoll in the United goal.\n\nHamilton are away to Motherwell on Wednesday in the Lanarkshire derby while Dundee United travel to Spartans.\n\nAberdeen 0-2 Motherwell\n\nMotherwell maintained their 100 per cent record against Aberdeen this season with another comfortable victory up North.\n\nThe away side took the lead just before the half-time whistle thanks to the in-form Tiree Burchill. The loanee's strike from distance beating her Celtic team-mate, India Marwaha, to give Motherwell the lead and her fifth goal in her last five SWPL matches.\n\nThe final goal came with just under an hour played through Louisa Boyes as the Dons gave away possession in their own box with the Motherwell forward capitalising.\n\nThe result keeps Motherwell seventh as they battle to finish top of the bottom six since the split. They host the Lanarkshire derby against Hamilton Academical on Wednesday. Aberdeen remain eight points clear of the relegation play-off ahead their midweek home match against relegated Glasgow Women.\n\nGlasgow Women 0-1 Spartans\n\nGlasgow Women were relegated from the Park's Motor Group SWPL after falling to their 27th defeat of the season. They had earned promotion to the top division on the last day of the 2021/22 season but have so far failed to get a point.\n\nDespite a battling performance, Spartans prevailed to maintain their unbeaten run in April with three wins and one draw. The only goal of the game came from Mya Bates after seven minutes played. On her 18th birthday, Bates blasted home after the cutback from Caley Gibb.\n\nSpartans remain eighth, two points behind Motherwell in the battle for seventh. The Edinburgh side host Dundee United on Wednesday at Ainslie Park while Glasgow Women are away to Aberdeen."}, {"url": "https://www.express.co.uk/sport/football/806564/Partick-Celtic-match-report-result-Scotland", "page_content": "Patrick Roberts scored twice to help Celtic to a comfortable 5-0 win over Partick Thistle\n\nIn a show oozing confidence and class the champions pulverised Partick with a performance as devastating as any put on this season during the now 45-game unbeaten domestic run.\n\nIt’s now looking more like how many will the Hoops score against Hearts on Sunday rather than if they will manage to avoid defeat and move to within a cup final win of an Invincible season.\n\nThis 5-0 romp was made to look easy by a Celtic team high on confidence and short on mercy.\n\nLeigh Griffiths got the ton up from the spot to spark the rout – before blotting his copybook with a rant at being subbed.\n\nHe and his manager later appeared to kiss and make up on the park after the game.\n\nPatrick Roberts fired a sensational double – vying with himself for goal of the game!\n\nTom Rogic chipped in as did Callum McGregor while sorry Thistle were happy to escape with losing just five on a night when they barely ventured into the Celtic half let alone the box."}]}