{"Bill Brown went on to make over 100 appearances for the club before moving to Celtic in 1957.": [{"url": "https://dundeefc.co.uk/club/history/hall-of-fame/", "page_content": "Dundee Football Club is proud of its history that has developed ever since it became the first professional football club founded in the city in 1893. That history has not been achieved by time but by the achievements, star quality and inspirational characteristics of the players and management who have served our great Club.\n\nIn 2008 the Directors of the Club decided to mark the achievements of these legendary figures and a Committee was set up decide the criteria for the Hall of Fame. The public were asked to vote for their favourites through the official matchday programme, website and local newspapers and the idea sparked great debate amongst the Dark Blue support. After hundreds of votes were cast, a total of eight legendary players were inducted in the inaugural Dundee Football Club Hall of Fame on Friday 3rd April 2009\n\nInductees\n\nWILLIAM “PLUM” LONGAIR – 2009 HERITAGE AWARD\n\nThe first Inductee into the Hall of Fame was William “Plum” Longair who served the club for 33 years, captaining the side in its first ever match in 1893 against Rangers at West Craigie Park. He went on to make over 100 appearances and brought international recognition to Dundee by becoming its first ever-international player when capped against Wales in 1894. After his retirement from playing he helped train the team, including the Scottish Cup winners of 1910 and in over 20 years of coaching he never missed a game.\n\nOn his death in 1926 an estimated 20,000 people lined the streets as his coffin was taken from his home in Victoria Street to Eastern Cemetery to honour one of the greatest footballing figures in the early development of football in the city.\n\nDOUG COWIE – 2009 LEGENDS AWARD\n\nThe next entry into the Hall of Fame was Doug Cowie who played 446 games for the club in a 16-year spell; a club record. The highlight of his career came when Dundee won the League Cup in successive seasons against Rangers and Kilmarnock in 1951 and 1952. The winner’s medals were overdue after Dundee and Doug sadly lost the League title on the last day of the 1948/49 season.\n\nPlaying at either wing-half or centre-half made no difference to Doug, his skill and elegance on the ball was always on show. Even the bullish Billy Steel admitted that his half back could “play a wee bit”.\n\nIn 1953 Doug made his international debut alongside Billy as Scotland drew 2-2 against England at Wembley. It was the first of 20 full caps for the national side and all gained whilst playing for Dundee. He is the only Dundee player to represent his country in two World Cup Finals.\n\nCLAUDIO CANIGGIA – 2009 INTERNATIONAL AWARD\n\nThe first ever International Award was given to Claudio Caniggia whose arrival in the City of Discovery in many ways mirrored that of Billy Steel fifty years previously. Both arrivals stunned the Scottish football scene and brought massive media attention and while both arrived with a reputation as controversial characters, they were quickly taken to the hearts of a Dens public who recognised their undoubted ability.Caniggia was aged 33 in September 2000 and hadn’t played for months but from the moment he took to the field for his debut as a substitute at Pittodrie there was no doubt that he was still the real deal. His last minute goal was pure theatre and 3,000 Dark Blue fans headed south from the Granite City that evening ready to tell anyone who hadn’t been lucky enough to make the trip “I was there when Claudio played for Dundee for the first time.”In the weeks and months that followed it was unusual to see a replica top with anything other than ‘Caniggia 33’ on the back as ‘The Tayzurri’ revelled in the Argentinean’s presence on Tayside – and on the field the darting runs of a man who still had phenomenal acceleration over short distances lit up a season when entertainment almost seemed more important than results. It was a brief stay on Tayside but full of so many fond memories for Dundee supporters.\n\nBARRY SMITH – 2009 LEGENDS AWARD\n\nCaniggia’s captain Barry Smith was next into the Hall of Fame. Few would have imagined that when Barry arrived at Dens in 1995 as part of the deal which saw Morton Wieghorst move to Celtic, that the club would be welcoming a man who would go on to be one of the finest captains in the clubs history. Barry’s time at Dens spanned over 11 years and as captain led the club to the First Division Championship, a Scottish Cup Final and the club’s return to Europe after a 27 year absence.Dundee spent seven seasons in the SPL with Barry as captain, in the first year the side finished 5th under the management of Jocky Scott. The next few seasons saw Barry as the Scottish heart in Ivano Bonetti’s continental Dees before Jim Duffy took over and led the club to the Scottish Cup Final. His legendary status was further enhanced on how he captained the side through the pain of Administration in November 2003 before going on to taste success winning the Icelandic league with FC Valur. In late 2008, Barry was welcomed back to Dens as part of Jocky Scott’s backroom staff. Taking charge of the under 19’s he was given the chance to join Brechin on loan to continue playing until the club came calling again in October 2009 and asked him to take up the position of caretaker-manager when the club fell into Administration for a second time. The heroic efforts in overcoming a draconian 25-point penalty from the Scottish Football League to avoid relegation had many wondering if he could be voted into the Hall of Fame for a second time.\n\nBILLY STEEL – 2009 LEGENDS AWARD\n\nIn September 1950 the next entrant of the Dundee Hall of Fame had developed into one of the first football superstars with 17 Scottish caps to his name and since his wonder goal for Great Britain against the Rest of the World in 1947, he was regarded as one of the best inside forwards in the world. George Anderson wanted the best for Dundee and in Billy Steel there was no finer inside forward so when an initial approach was rejected he re-doubled his efforts and offered a new record British transfer fee of £23,500.\n\nBilly’s outstanding ability gave him a confidence, often seen as arrogance, however a year after his arrival Dundee beat Rangers to win the League Cup with Billy setting up Alfie Boyd for the winning goal. Success bred more success and the following year Dundee became the first club to retain the League Cup by beating Kilmarnock in the final.\n\nBilly Steel played a total of 131 games for the club scoring 45 goals and also gained a further 13 Scotland caps during his Dens career, playing alongside Doug Cowie in two Internationals against England and Sweden. In over 40 years involvement in local football Tommy Gallagher regarded Billy Steel as the best player ever to play for Dundee and many who were lucky to watch him would agree.\n\nJOCKY SCOTT – 2009 LEGENDS AWARD\n\nJocky Scott’s place in the Club’s Hall of Fame was never in doubt after a 45-year connection with the Club after arriving as a 16 year old in 1964 and made his debut in a 6-0 win over Motherwell at Dens. Two weeks later he scored the first of his many career goals for The Dee with his double putting Dundee on the way to a 4-1 derby win at Tannadice.The creative part of his game was as important as the goals he scored and a succession of Dens strikers would testify to the service supplied by the keen football brain of Scott and he was part of the Dundee that beat Celtic on a rain swept day in 1973 to win the League Cup Final at Hampden and bring the cup back to Tayside for the third time. The run to the Scottish Cup semi-final in the same season saw Dundee regarded as the best in the country at the time. Jocky returned to Dens as a player in 1980 playing five more first team games but it was as a coach that his future would map out. He progressed to assistant-manager at Dens under Archie Knox and took over the hot seat when Knox returned to Aberdeen. It was the first of three spells in charge at Dens.\n\nALAN GILZEAN – 2009 LEGENDS AWARD\n\nThere have been some great forwards in Dundee’s history but none have had a strike rate to match Alan Gilzean, the Coupar Angus born hit-man delivering 169 goals in 190 top-flight competitive appearances in the club’s colours.\n\nHe holds almost every club goalscoring record – most career goals, most goals in a season, European top scorer, most hat-tricks and shares the honour of scoring most goals in a game when he netted an incredible seven goals against Queen of the South in December 1962. That season Gillie’s fame spread throughout the Continent as Dundee progressed to the European Cup semi-final, beating Cologne, Sporting Lisbon and Anderlecht on the way.\n\nAmazingly the following season he surpassed his impressive scoring rate with 52 goals in 48 games and a winner for Scotland against England in April 1964. A month later he scored twice as Scotland drew 2-2 with West Germany in Hanover and by now it was obvious that English clubs would come calling for his talents. In December 1964 he moved to Tottenham Hotspur but not before signing off in style with a hat-trick against St Johnstone.\n\nBOBBY COX – 2009 LEGENDS AWARD\n\nThe inaugural Hall of Fame Dinner came to a fitting close with the final Legends Award going to whom Dundee supporters simply called Mr Dundee – Bobby Cox.\n\nHe was born overlooking Dens Park and was educated at nearby SS Peter and Paul then St. Johns,signing for Dundee in 1955 and a year later after only four reserve games he was given his debut at home to Queens Park. The story of a Legend had begun.\n\nBobby was an almost ever present in the side for the next decade only missing out for injuries to his cartilage and slipped disc. He was given the honour of taking over the club captaincy from Doug Cowie and thus leading the club into its finest hour at Muirton Park on 28th April 1962.\n\nThat League championship brought qualification to the European Cup and Bobby led the team on the brilliant aggregate defeats of Cologne, Sporting Lisbon and Anderlecht. Injury against Motherwell ruled him out against AC Milan in the semi-final and robbed Dundee of one of its most influential players. Bobby would experience further European ties in the European Cup Winners Cup and the Inter-Cities Fairs Cup.\n\nIn 1964 he captained the team in the Scottish Cup Final on 25th April 1964 against Rangers, their last appearance at that stage of the tournament for 39 years.\n\nBobby retired in 1969 after 14 years with club but the association would not stop there for this one club man and through his hosting of the hospitality lounges at Dens he gave the club a loyal service for over 50 years.\n\nBOB SHANKLY – 2010 HERITAGE AWARD\n\nThe second recipient of the Heritage Award was Bob Shankly, manager of what many regard as the greatest team in the club’s history.\n\nHe managed Dundee to their one (and only) League Championship in 1962 then into the European Cup beating the famous names of Cologne, Sporting Lisbon and Anderlecht before falling at the semi-final stage against Italian giants AC Milan. His free scoring side reached the Scottish Cup final in 1964 during a season in which they scored an incredible 141 goals.\n\nShankly once recalled what he looked for in a player “I look for character. I want lads with guts and go, who won’t crumple when things don’t go their way.” No one could argue with his philosophy or how he moulded his team into winners. He let his players express themselves but earned their utmost respect and they rewarded him with the greatest days in the club’s history.\n\nGIORGI NEMSADZE – 2010 INTERNATIONAL AWARD\n\nThe International Award went to Giorgi Nemsadze, a player who had a nomadic existence in Europe before arriving at Dens in 2000. His ability was without question as he had almost 50 caps for his country but as part of the Tayzurri he had his longest stay at any club in his career and that stability brought the best out of him.\n\nThe man with the dancing feet brought joy to the terraces at Dens. He could command a match from the centre of midfield and when he scored they were memorable.\n\nIn November 2000 at Tannadice he linked with Barry Smith and Claudio Caniggia before chipping united keeper Alan Combe. A goal that sent 5,000 Dundee supporters into ecstatic celebration. His goal against Inverness Caledonian Thistle in 2003 gave the club their first Scottish Cup final appearance in 39 years. That was a mark of a Dundee Legend – he always brought joy to Dundee supporters when they watched him. One reporter even commented on his play at Dundee: “The Georgian’s close control was such that one wondered if he had wiped his boots with glue rather than polish”.\n\nGORDON WALLACE – 2010 LEGENDS AWARD\n\nAsk any Dundee supporter who Gordon Wallace is and you will get the reply: “He’s the man who scored the winner in Dundee’s League Cup victory over Celtic in December 1973!” And so he did, chesting down a Bobby Wilson free-kick with his back to the goal, turning and, almost all in the one movement, firing the ball past the desperately diving Ally Hunter for one of the best goals ever seen in a Hampden Cup Final.\n\nBorn and bred in the city, Gordon watched Billy Steel make his debut at Dens in 1950 and overcome the setback of being released by Dundee in his early career to make his way into the club’s Hall of Fame.\n\nIn a career laden with goals his 265 League goals was a Scottish record for over 20 years until broken by Ally McCoist. In 1968 he broke an Old Firm monopoly and was awarded the Scottish Writers Player of the Year for almost single-handedly keeping Raith Rovers in Division One with his goals.\n\nHe managed the club in 1989 and won the Scottish League Centenary Cup the following year.\n\nALEX HAMILTON – 2010 LEGENDS AWARD\n\nAlex Hamilton was one of the Scottish game’s great characters both on and off the pitch. Crew cut hairstyle, driving a white jaguar and forming a pop band Hammy and the Hamsters was all show.\n\nSo was his football. Pace, self-confidence and the ability to sell dummies like a salesman in a tailor’s shop made him one of the first overlapping full-backs in the country. He would very soon become the best in the country with 24 full Scottish International caps to prove it. At his peak in 1964, declared himself, Mohammed Ali-style, to be “The Greatest” right-back in Europe – a claim not without foundation as that very year he appeared for the Rest of Europe against Scandinavia.\n\nHe formed a formidable full back partnership with lifelong friend Bobby Cox and in 1961-62 Hammy was an ever present in the side that won the Scottish League Championship as he was the following season in the European Cup campaign that saw the Dark Blues reach the semi-final.\n\nAlex made 359 appearances for Dundee in ten seasons, won a club record 24 International caps, 2 International Trial Appearances, 8 Scottish League Caps and most importantly that League Championship medal.\n\nJIM DUFFY – 2010 LEGENDS AWARD\n\nIn 2009 Jim Duffy hosted the first Dundee Hall of Fame Dinner but twelve months later he was himself inducted into the legends of the club for his tremendous service in his various roles as player, coach, assistant-manager and manager in his four spells with the club.\n\nHe was a tremendous centre-half for Dundee and a rock in a Dark Blue jersey and a solid inspiration not just to the fans but also to all around him. Only the wealth of talent in the Scottish defence at the time prevented him from gaining any full international caps. His playing career was cruelly curtailed when a knee injury forced him to give up the game in 1987, just as Dundee looked to be challenging again for honours. Fellow Dundee Legend Gordon Wallace declared upon resuming his playing career in 1989 that if he had retuned earlier the team would not have been relegated.\n\nJim has had two spells as manager at Dens. In his first spell as manager, he led Dundee to the League Cup Final and then to the semi final the following season, a tremendous feat for a First Division side. His second spell at the helm saw him lead Dundee to their first Scottish Cup final since the days of Bob Shankly, capture a top six finish with a fourteen match unbeaten run and lead Dundee into Europe for the first time in twenty-nine years.\n\nTOMMY GALLACHER – 2011 HERITAGE AWARD\n\nTommy Gallacher was inducted into the Hall of Fame with the Heritage Award to mark not only his cultured playing days in the late 1940’s and early 1950’s but for his work in the local newspaper industry.\n\nHis senior career started with Queens Park as his legendary father, Patsy Gallacher, was determined none of his sons would follow him and play for Celtic. After World War II this peerless half-back was in demand and could have signed for Wolves, St Mirren or Aberdeen but chose Dundee. That coincided with one of the greatest eras in the club’s history and the backbone of the legendary Dundee team was Tommy Gallacher, Doug Cowie and Alfie Boyd. It is a half-back line still recited to this day by older Dundee fans. He won the Scottish League Cup in 1951 but the honours list could have been so much longer as that Dundee team missed out on the League Championship on the last day of the 1948/49 season and a Scottish Cup final to Motherwell in 1952.\n\nHis impact on Dundee was not just as part of one of the greatest sides in the club’s history but after his retirement in 1956, he became one of the most respected journalists in the country. During the next 30 years his words became the staple diet of the city’s football support before the internet and wall-to-wall television coverage.\n\nPAT LINEY – 2011 LEGENDS AWARD\n\nPat Liney, the club’s Honorary President became the first ever goalkeeper inducted into the Hall of Fame. In his time at Dens he had the task of replacing one of the country’s best ever keepers in Bill Brown – a task he accomplished in style being a member of that elite team who won the Scottish League Championship in 1962.\n\nHe is perhaps most remembered by Dundee’s supporters for a crucial penalty save in the penultimate game of the Championship season at home to St Mirren. With only twelve minutes left and Dundee 1-0 up disaster struck when the referee awarded St. Mirren a penalty and Dundee’s chances of winning the League Flag looked like they were over. That is until the keeper parried the spot kick and Dundee went up the park to score again. As they left the pitch the players heard of Rangers’ defeat at Aberdeen and the title was almost there.\n\nFellow Championship team member Bobby Wishart remembers this Legend as someone who fancied himself as a bit of a crooner. At the 40th Anniversary Championship Dinner in 2002 at the Hilton Hotel, he grabbed the microphone and led the assembled Dees in a chorus of, ‘Hail, Hail, The Dees are Here.’ Legends are made of such stuff!\n\nIAN URE – 2011 LEGENDS AWARD\n\nAnother rock of the Dundee League winning defence was next up to receive his Legends award. Things could have been so different for this Dundee FC hero and bedrock of Dundee’s title winning defence had he followed his first love of rugby and gave in to the early doubts he harboured about his footballing ability.\n\nIan Ure turned his back on his first love, rugby to join Dundee in 1958 and learnt his trade from another Dundee Great, Doug Cowie. In season 1961/62, Dundee become Scottish League Champions and this colossus was an ever present making the number five jersey his own for both club and country. He made the first of eleven international appearances for Scotland, eight of which he won at Dens, in November 1961 against Wales and just three days later was part of the Dundee side which recorded the club’s greatest ever league result, a 5-1 victory over Rangers at Ibrox.\n\nIn December 1962, his superb performances at both home and in the European Cup, saw him presented with the Scottish Footballer of the Year Award, the only Dundee player to win such an accolade. Four months later as he starred in Scotland’s 2-1 win over England at Wembley the B.B.C. commentator Kenneth Wolstenholme described him as ‘the greatest centre half in the world today’\n\nIt took a then world record fee for a defender of £62,500 to take him away to Arsenal but the memories live long in the minds of the Dundee support.\n\nALAN COUSIN – 2011 LEGENDS AWARD\n\nThroughout his playing career Alan Cousin became a Dundee Legend whilst remaining part-time as he chose to combine his early senior career with a St. Andrews’ University degree course.\n\nSporting mainly the number nine shirt, the striker proved the perfect foil for fellow front man Alan Gilzean and between them proved to be a very effective partnership that shot Dundee not only to the League title but also to the European Cup semis and Scottish Cup Final in subsequent years.\n\nIn over a decade at Dens, he played 384 games putting him comfortably in the top ten of most appearances for The Dee. He sits fourth in Dundee’s all time scorer list with a terrific 141 goals. This loyalty to the club was achieved despite approaches from several clubs when he was widely acclaimed as one of the top forwards in the country.\n\nHe became known as ‘the King of the Double Shuffle’ with a unique scissors movement that seemed to propel him away from opponents in an instant and he regularly mesmerised teams at both home and abroad.\n\nANDY PENMAN – 2011 LEGENDS AWARD\n\nWhen you enter through the main reception at Dens Park, you are greeted with a picture with the simple caption ‘The Penalty King’ and inside the frame is a photo of a boy genius of Dundee, Andy Penman, who made his debut at the tender age of fifteen making him the club’s youngest player, won a Championship medal aged just nineteen after scoring the goal which clinched the title.\n\nHe was a wonderful midfield player and contributed a terrific 141 goals as one of only ten players to hit over a century for Dundee and is the club’s fifth top scorer of all time. A dead ball expert, his forte was from the penalty spot where he rarely missed, scoring twenty-five of them in eight years at Dens. He had startling vision and was a fine passer of the ball who could clip balls precisely through, round and over defences to give his forwards clear, unhindered runs at goal. He was a genius, a child prodigy in the art of football.\n\nSadly, Andy died in 1994, aged just fifty-one but his legacy lives on at Dens Park. Not only are you greeted by Andy’s image when you enter the main door but there is also a hospitality lounge that bears his name showing that ‘Boy Kings’ never grow up and they never die, at least not in the memories of those who were lucky enough to witness the skills and genius of Andy Penman.\n\nTOMMY COYNE – 2011 LEGENDS AWARD\n\nTommy Coyne’s first spell at Dens was short – barely lasting two years – but it was certainly illustrious, earning him legendary status in the Hall of Fame.\n\nHe formed a prolific partnership with Keith Wright that produced a goals-to-game ratio barely matched in Dundee’s history. The Cobra and The Mongoose terrorised opposition defences and by the end of their first season, the magnificent attacking football had seen the side score a remarkable 100 goals in all competitions with this legend netting 15 at a strike rate of one goal in less than every two games.\n\nThe Cobra would start his second season in the same way and in September Dundee got revenge for a Scottish Cup semi-final five months earlier when they defeated Dundee United in a pulsating League Cup quarter-final at Dens in front of a capacity 19,724 crowd.\n\nIn November Coyne inflicted more misery on The Arabs when he scored a brace in a 3-1 Derby win at Tannadice as the Dundee fans taunted their rivals by thanking them for giving them their former striker. In his time at Dens he would be a thorn in United’s side scoring five goals, playing in three wins and five draws.\n\nBy the turn of the year he had netted his 30th goal, a magnificent achievement that put him in the running for the U.E.F.A. Golden Boot for Europe’s top league scorer. Ultimately however, Tommy would score thirty-three league goals to finish third and win the Bronze Boot: compensated by going into the record books as the Premier League’s top scorer. In February 1989 he left for Celtic Park, leaving a legacy of 60 goals in only 109 games but would return again in 1999 for a second spell where he helped Dundee to fifth in the SPL – their joining highest league placing since being Champions of Scotland in 1962.\n\n2012 AWARDS\n\nIn 2012 the club integrated the Hall of Fame event with the 50th Anniversary of its League Championship win in 1962 with a dinner held in the Caird Hall attended by around 700 supporters desperate to recognise the greatest achievement ever by a Dundee team.\n\nIn a marvellous evening of nostalgia, the remaining players from the core of 11 who won the League Championship were inducted into the Hall of Fame with Legends Awards. Bobby Seith, Bobby Wishart and Gordon Smith had all won League titles before they arrived at Dundee and their experience was vital in nurturing the youthful talent abundant at Dens. That talent included winger Hugh Robertson who fittingly was the last name on the team sheet at No. 11 and became the last of the League Legends into the Hall of Fame.\n\nIn the year of Dundee’s 120th anniversary, a further five Legends were inducted at the club’s fifth Hall of Fame dinner at the Invercarse Hotel on Friday 29th March 2013.\n\nHUGH ROBERTSON – 2012 LEGENDS AWARD\n\nHugh Robertson was wonderfully tricky left-winger in his 292 appearances for Dundee and as well as being a key supply line for Dundee’s forwards, contributed 61 goals in his eight years a Dens. A coal miner before joining The Dee from Auchinleck Talbot in 1957, Shug was an ever present in the 1961/62 title winning campaign in which he also won his first full Scottish cap against Czechoslovakia a World Cup play-off match as well as two Under-23 caps. Was part of the side to reach the European Cup semi-final in 1963 and the Scottish Cup Final the following year and would later return to Dens in 1975 as first a coach and then chief scout.\n\nBOBBY SEITH – 2012 LEGENDS AWARD\n\nA cultured and artistic right-half, Bobby Seith won the English League title with Burnley in 1960 before repeating that feat with Dundee two years later as part of the formidable half-back line of Seith, Ure and Wishart. He captained the Scottish League v Scotland during Dundee’s championship season and the following year captained the Dark Blues in both legs of the European Cup semi-final against AC Milan. Made 197 appearances for The Dee, including the 1964 Scottish Cup Final and would later go on to become a coach at Dens Park upon hanging up his boots.\n\nGORDON SMITH – 2012 LEGENDS AWARD\n\nGordon Smith was a hugely important member of Dundee’s 1961/62 title winning squad and is regarded by many as the final piece of the successful jigsaw that manager Bob Shankly pieced together. Smith’s precision play was perfect in aiding the development of young forwards Alan Cousin and Alan Gilzean and Gillie’s prowess in the air was the perfect foil for Smith’s superb crossing ability. He was the pin-up of Scottish Football and the oldest member of the Dundee title winning side at 38 years old and in view of his age, Smith achievements at Dens are extraordinary. In total he played 100 times in three seasons, scoring 19 times and during the championship winning season he played 37 games, bettering that a year later with 48 appearances including a European Cup semi-final appearance at the age of 39. Having already won the League Flag with Hibs and Hearts as well as 32 caps for Scotland during a glittering career, Gordon contributed nine goals in he Dark Blue’s league winning year, including a famous strike in a 4-1 win over Dundee United on his home league debut.\n\nBOBBY WISHART – 2012 LEGENDS AWARD\n\nBobby Wishart was a cultured left-half and a member of the celebrated Dundee half-back line of Bobby Seith, Ian Ure and himself A championship winner with Aberdeen in 1955, he repeated that feat with The Dee after joining from The Dons in January 1961 for a fee of £3,500 which gave him a golden finish to an excellent footballing career. Scored on his debut against Dundee United, Bobby also scored seven times in the Dark Blues’ league winning campaign, including the opening goal of the celebrated season. He played 37 times in the title winning year and in the following European Cup season, played ten games more including being an ever present in the Champions Cup run to the semi-final, scoring a famous goal in the first round 8-1 win over Cologne at Dens.\n\nALFIE BOYD – 2013 LEGENDS AWARD\n\nAlfie Boyd’s induction into the Hall of Fame with a Legends Award comes as the most successful captain in the club’s history and lived the dream that all Dees have by growing up to play for the team he supported as a boy and scoring the winning goal in a cup final for them. He is the captain with the most winners’ medals in the club’s history with two League Cup medals and one Scottish League B Division medal and in the first League Cup win in 1951, he scored a dramatic last minute winner to defeat Rangers 3-2 at Hampden. As part of the famous half-back line of Gallacher, Cowie and Boyd, Alfie made 169 appearances for The Dee which also saw him lead Dundee out in the 1952 Scottish Cup Final and finish as Scottish League Championship runner-up three years before.\n\nBOBBY GLENNIE – 2013 LEGENDS AWARD\n\nBobby Glennie is a Dens Park cult hero who was lucky enough to play for the club he supported as a boy for twelve enjoyable years and relished his Legends Award when he was inducted into the Hall of Fame. As a Dundee player there is arguably no one who was more committed to the cause and he quickly became a fans favourite during his 388 appearances in Dark Blue. In 1980 he had the honour of captaining Dundee in the Bell’s League Cup Final and in the last game of that season, in which he played in every match, he laid on the goal against East Stirlingshire for Eric Sinclair to secure promotion back to the Premier Division. Bobby was also a key member of Dundee’s 1979 First Division title winning team and is also revered for his forty yard screamer against Aberdeen in 1983.\n\nBOBBY WILSON – 2013 LEGENDS AWARD\n\nBobby Wilson’s induction with a Legends Award comes after his eleven years at Dens makes him one of the Club’s longest serving players. In total he made 411 appearances for The Dee which includes a club record seventeen outings in European competition. A right-back very much in the wing back mould, Bobby’s highlight in a Dundee shirt undoubtedly came in the 1973 League Cup Final when he played a key part in the victory as his free kick was controlled by Gordon Wallace who then struck it into the net for the winner. Bobby also played in the 1967 League Cup Final against Celtic, scored in the Inter-Cities Fairs Cup semi-final against Leeds United the same season and also scored the winner in the famous UEFA Cup game against Cologne in 1971 when Dundee came back from 4-2 down with twenty minutes to go, to win 5-4.\n\nJACK COWAN – 2013 INTERNATIONAL AWARD\n\nFollowing in the footsteps of Claudio Caniggia and Giorgi Nemsadze, Canadian Jack Cowan is the latest International Award inductee into the Dundee FC Hall of Fame. Cowan was a popular left back who made 149 appearances for The Dark Blues between 1949 and 1954 and was a key member of successful side of that period. In 1951 Jack was part of the team which defeated Rangers in the League Cup Final at Hampden in October and became the first Canadian soccer player to win a major football honour in Europe. Two months later he was named as the North American Football Confederation Player of the Year for 1951 after his terrific displays for Dundee and his League Cup winning achievement and became the first Dundee player to be awarded with any player of the year award outside of the club. Jack also played in the 1952 Scottish Cup Final later that season and was one of the inaugural inductees into the Canadian Soccer Hall of Fame in May 2000.\n\nGEORGE ANDERSON – 2013 HERITAGE AWARD\n\nGeorge Anderson’s induction with this year’s Heritage Award is as the most successful manager in The Dee’s history who did as more than anyone to shape the major force that Dundee became post-war. His first involvement with the club was as a goalkeeper in the all-conquering 1917/18 wartime Dark Blues which won every competition it entered but he is more fondly remembered as the manager who brought the most silverware to Dens during his eleven years in charge. Becoming managing/director in 1944, he found Dundee in the second tier and as he rebuilt the club from its wartime hiatus, he led them to back to back B Division Championships before being granted promotion to the top tier. Within two years Dundee were runners-up in the Scottish League Championship and after spending a world record fee for Billy Steel in 1950, his ‘think big, be big’ philosophy paid off as Dundee became the first side to retain the Scottish League Cup in 1951 and 1952 with a Scottish Cup Final appearance sandwiched in between.\n\nBILL BROWN – 2015 LEGENDS AWARD\n\nBill Brown was one of the greatest Scottish goalkeepers of the post-War period and is a legend at Dens Park as a member of the 1951 League Cup winning side. He represented Scotland in the 1958 World Cup as a Dundee player and his legacy at Dens is 274 appearances, making sixty-two shut outs, winning one major trophy, gaining thirteen international caps at various levels and a host of memories of a keeper who was elastically agile, endowed with remarkably sharp reflexes and never less than impeccable for The Dee. Bill went on to achieve legendary status with Spurs in their double winning side of 1960/61 playing 292 times for the London club up to 1966.\n\nJOHN DUNCAN – 2015 LEGENDS AWARD\n\nLocal boy made good John Duncan was one of the privileged few who got to play for the club he loved and repaid that by scoring goals for fun. In a seven year Dens Park career he scored 109 goals in 188 appearances, including forty in season 1972/73 where he finished as Scotland’s top scorer. The following season he was part of the team to win the League Cup against Celtic at Hampden while in European competition he is revered for his hat-trick against Cologne in 1971 in one of the greatest games Dens Park has ever seen. He was signed by Spurs in 1974, where his goal scoring feats continued, scoring 73 goals in 148 appearances over 5 seasons.\n\nSANDY MACFARLANE- 2015 HERITAGE AWARD\n\nA legendary figure in the annals of Dundee FC with a career that spanned over a quarter of a century – will receive the Heritage Award. He was both a player from 1901 to 1913 and as a manager where he had two spells between the Wars. The clever inside-forward made 333 appearances for Dundee, scoring 71 times and his time at Dens saw him win eight international honours, be a Scottish League Championship runner-up three times and was a key figure in Dundee’s 1910 Scottish Cup win.\n\nJAMES GRADY (GOAL VS. DUNDEE UNITED) – 2015 HALL OF FAME MODERN MOMENT\n\nA new category introduced this year – was be awarded to the ever popular James Grady. The pint-sized striker etched himself in to Dundee folklore, latching on to a Eddie Annand flick on before producing a stunning half volley that gave Jocky Scott’s Dark Blues a 1-0 victory against Dundee United at Tannadice in November 1998. Playing nearly 100 times for the Dark Blues, he was an integral part of the team that won the Scottish First Division and secured promotion back to the Premier League in season 1997/98.\n\nJULIAN SPERONI – 2015 INTERNATIONAL AWARD\n\nArgentinian keeper travelled up from London especially for the event – to be presented with the International Award. Signed under freedom of contract from Argentinean side Athletico Platense by Italian manager Ivano Bonetti in the summer of 2001, he quickly established himself as Dundee’s No. 1 and was an ever present the following season under Jim Duffy. He joined Crystal Palace for £750,000 ten years ago and has remained at Selhurt Park ever since, winning 4 Player of the Year Awards and having a restaurant at the Stadium named in his honour.\n\nBOBBY GEDDES – 2016 SPECIAL RECOGNITION AWARD\n\nGeddes is a member of Paul Hartley’s backroom team and he is a man who knows Dens Park well having been an excellent and popular goalkeeper for eleven years. Having served the Dark Blues with distinction for almost two decades, the Club felt it only right to induct him into the 2016 Hall of Fame with a new category, a Special Recognition Award.\n\nGeddes kept 97 clean sheets in 313 appearances, played in a national cup final, was part of a promotion winning side, won 5 Scotland Under-21 caps, captain Dundee to success in the Tennents Sixes and is the oldest player to play a competitive senior match in Scotland after coming off the bench at Raith in April 2010 aged 49 years and 256 days, almost 30 years after he played for Dundee in the League Cup Final.\n\nJOHN ‘SAILOR’ HUNTER – 2016 HERITAGE AWARD\n\nJohn ‘Sailor’ Hunter is a legendary name in the history of Dundee Football Club as the man who scored the winning goal when the Dark Blues first won a major trophy, the Scottish Cup in 1910. Sailor scored four goals en route to lifting the trophy, including the winner against Hibs in the semi-final and was part of the side to finish as Scottish League runners-up by one point the year before.\n\nHunter scored 60 goals in 107 appearances, won one full Scotland cap while at Dens and was top seasonal scorer on two occasions in his three years at Dens and is inducted into the Dundee Hall of Fame with a Heritage Award.\n\nJIMMY TONER – 2016 GOLDEN ERA AWARD\n\nThe 2016 Hall of Fame introduced a new category, the Golden Era Award to recognise the successful post-war period in the Club’s history. In the twenty five or so years after the Second World War Dundee FC won the Scottish League Championship, were the first team to win back to back Scottish League Cups, reached two Scottish Cup Finals and another League Cup Final, were League Championship runners-up, won two Scottish League B Division titles and reached the European Cup and Inter-Cities Fairs Cup semi-finals; it truly was a golden era. This new award is designed to honour the players whose achievements made it such a special time and the Club were delighted to announce that the first recipient of the Golden Era Award was Jimmy Toner, a member of that wonderful George Anderson side of the early Fifties who won two Scottish League Cups. Dundee were the first side to win back to back League Cups and Toner played in both finals against Rangers and Kilmarnock in 1951 and 1952 in his 71 appearances for the Dark Blues. He is one of only seven players to win two major winners medals with The Dee and returned to coach at Dens between 1966 and 1978.\n\nALLY DONALDSON – 2016 LEGENDS AWARD\n\nAlly Donaldson’s Dark Blue career spanned 14 years over two spells where he amassed 408 appearances for The Dee. He was part of the Dundee side to win the First Division title and promotion in 1979 and won two Scottish League caps and two Scotland Under-23 caps while at Dens.\n\nThe popular keeper played in the Inter-Cities Fairs Cup semi-final against Leeds in 1968 and with 126 clean sheets he holds the Club’s clean sheet record and is the fifth goalkeeper to be inducted into the Dundee Hall of Fame after Pat Liney, Bill Brown Julian Speroni and Bobby Geddes.\n\nBILLY PIRIE – 2016 LEGENDS AWARD\n\nBilly Pirie is a goalscoring legend for The Dee who found scoring as natural as breathing. In four years at Dens he scored 106 goals in 138 appearances and his record speaks for itself as a prolific goal getter, not just in Dundee’s history but also in Scottish Football history. His 44 goal haul in his first season with Dundee has yet to be bettered by any player who has followed and helped him win the 1977 Scottish League First Division Player of the Year.\n\nHis 1.3 goals per game ratio did much to alleviate the sense of doom and gloom then prevailing at Dens Park following relegation from the inaugural Premier Division and the memory of him scoring for fun in the First Division lives long in the memory of all who saw him. Part of the 1979 First Division winning side, goals king Billy more than deserves to be inducted into the club’s Hall of Fame with a Legends Award.\n\nNEIL MCCANN – 2016 MODERN HEROES AWARD\n\nNeil McCann came through the youth ranks and Dens and burst onto the scene in the early Nineties where he became the first winner of the Andy De Vries Memorial Trophy as Dundee Player of the Year. He scored the goal which took Dundee to the 1995 League Cup Final with a fantastic strike in the semi against Airdrie and he came out of retirement in 2011 in the Dark Blues’ hour of need to score another sensational goal as a Dee-Fiant hero against Raith Rovers; one of Dens Park’s greatest moments.\n\nThe winger won ten Scotland Under-21 caps while at Dens and those two never-to-be-forgotten strikes were among 12 goals in 97 appearances. Neil McCann is a true modern day hero of Dundee FC and in recognition of everything he achieved with and did for The Dee, the Club are honoured to induct him into the 2016 Hall of Fame with a new Modern Heroes Award.\n\nALEC TROUP – 2017 HERITAGE AWARD\n\nKnown to many fans as ‘Wee Troupie’ due to his small stature, Alec was a wonderfully tricky winger whose sparkling play, gentlemanly demeanour, good humour and extremely likeable personality undoubtedly brightened up many a troubled heart during the dark days of the First World War and the years that followed. He became a real hero of the people at Dens Park at a time when such role models were in great demand to rouse the population’s spirits as well as being an extremely talented player.\n\nAlec Troup is a Dundee legend and folk hero and the Club were delighted that his grandson Brian Taylor, who himself lives Troup’s native Forfar, was in attendance to accept the 2017 Heritage Award on ‘Wee Troupie’ behalf\n\nALEX STUART – 2017 GOLDEN ERA AWARD\n\nAlex Stuart won a Scottish League Championship medal with Dundee at the tender age of 21, played in the European Cup semi-final and had the honour of captaining Dundee in the 1967 League Cup Final. An accomplished defender, Stuart was famed for his powerful shooting and in his nine seasons in the first team, he scored a very credible 31 goals making him the highest scoring defender in the Club’s history to date.\n\nAlex Stuart enjoyed a memorable eleven years at Dens Park when Dundee were at the height of their glory and was the only member of the league winning squad to play in both the Scottish and League Cup Finals. He was the last of the Championship side to leave Dens Park and his departure marked the end of a golden age for Dundee F.C.\n\nTHOMSON ALLAN – 2017 LEGENDS AWARD\n\nDundee have had a fine tradition of good goalkeepers over the years and Thomson Allan certainly fits into that category, winning the Scottish League Cup in 1973 and going to the World Cup in West Germany with Scotland the following year. He was confidence personified and inspired his team mates with his immaculate handling and wonderful ability to cut out cross balls and is one of the best keepers to have worn the number one shirt for Dundee.\n\nThe consistent, reliable and agile keeper is fondly remembered by Dundee supporters who were lucky enough to see him and he came out with the most number of votes in a fans’ favourite goalkeeper online poll on Dundee’s official site in 2009 and is now voted into the Hall of Fame by the supporters\n\nKEITH WRIGHT – 2017 LEGENDS AWARD\n\nFor Dundee fans everywhere a mongoose is so much more than a small predatory mammal from Africa, chiefly known for its distinctive long tail. Rather it is a bona fide legend, famed for predatory goal scoring exploits while wearing a distinctive dark blue shirt, namely Keith Wright. Signed from Raith Rovers in 1986, Wright was part of two successful goal scoring partnerships in his time at Dens but became a legend in his own right when he scored a hat-trick in a memorable derby win over Dundee United in 1989.\n\nWright scored 75 goals in 197 appearances, won the Tennents Sixes and the Centenary Cup and was the last Dundee player to represent the Scottish League in 1990 and his goals against United will live long in the memory.\n\nROBERT DOUGLAS – 2017 MODERN HEROES AWARD\n\nThe Club introduced the Modern Heroes Award to recognise the contribution of a player or manager from the Nineties onwards and Robert Douglas is a player who earned legendary status across the three decades that this award covers.\n\nWith 98 clean sheets in 303 appearances, Douglas is a Dark Blue goalkeeping great and as big a Dundee hero as you’ll meet. He won the First Division in 1998 and the Player of the Year an unprecedented three times before becoming a Dee-Fiant in his second spell at Dens.\n\nRobert Douglas has a special place in the hearts of many of the supporters who saw him play for their club and country and now that he has finally hung up those big gloves, Scottish Football is a sadder place.\n\nDAVID ‘NAPPER’ THOMSON – 2018 HERITAGE AWARD\n\nDavid Thomson was a pre-war Dark Blue stalwart making 385 appearances over a fourteen year period with Dundee FC, his only senior club. Nicknamed ‘Napper’ because of his cool, collective approach, he played for Dundee in the 1925 Scottish Cup Final and earned one full cap and two Scottish League caps during a distinguished Dens Park career.\n\nBOBBY FLAVELL – 2018 GOLDEN ERA AWARD\n\nTo score a goal in a winning cup final for Dundee is pretty special but to do it twice is incredible and only one man has achieved this tremendous feat, Bobby Flavell. When Dundee became the first side to win back to back League Cups in 1951 and 1952, Flavell wrote himself into the Dark Blue history books by scoring in both victorious finals and the forward scored 53 goals in 98 appearances, striking up a famous partnership with 2009 inductee Billy Steel.\n\nCAMMY FRASER – 2018 LEGENDS AWARD\n\nHailing from Fintry, Cammy Fraser is ‘one of our own’ and an inspirational captain from the early eighties. He joined Dundee in September 1980 when they were bottom of the First Division and by the end of the season his drive and attacking midfield flair helped Dundee win promotion and to a national cup final after scoring the winner in the League Cup quarter-final away at Premier League champions Aberdeen and a vital equaliser in the semi against Ayr. He also played his part in the First Division title winning campaign in his second spell in 1992 and was a terrific player who gave his all every time he pulled on a dark blue shirt.\n\nERIC SINCLAIR – 2018 LEGENDS AWARD\n\nEric Sinclair was a player who was wholeheartedly committed to the cause, played for the jersey and who enhanced his reputation and popularity when he scored the goal which returned Dundee to the Premier Division in May 1981. The tall, blond, predatory striker never gave anything less than 100% during games and was a regular goal getter for The Dee, netting 95 times in 289 appearances and finishing as top goal in two different seasons. He won the SPFA First Division Player of the Year in 1980/81 when his 22 goals helped Dundee into the top flight and was capped by the Scottish League when he scored against the English League. Sinky’s speciality was shielding the ball with his back to goal and he was also part of the Dundee side which won the 1979 First Division title and played in the 1980 League Cup Final. Eric also scored in the famous 5-1 win over Celtic in April 1980 and to cap it off scored the only goal against Dundee United earlier the same season; the second time he had scored a winner in the derby.\n\nGAVIN RAE – 2018 MODERN HERO AWARD\n\nGavin Rae truly is a Dark Blue Modern Hero who enjoyed three spells at Dens between 1994 and 2014. He became the 21st player in 120 years to reach his third century of games for the club just before lifting the Championship trophy as skipper in May 2014 and his time at Dens also saw him win the First Division, play in the Scottish Cup Final, score in the U.E.F.A. Cup and become Dundee’s first Scottish internationalist in fifteen years. Starting and finishing his career at Dens Park, Gavin scored 32 times in 302 appearances and gave his all every time he pulled on the famous dark blue.\n\nALBERT JULIUSSEN – 2019 HERITAGE AWARD\n\nAlbert Juliussen was a real ‘Roy of the Rovers’ post war hero to the Dundee support when he scored an incredible 95 goals in 73 competitive games (plus another 33 goals in Forfarshire Cup, Dewar Shield and friendly matches) and was top scorer for The Dee for three years in a row from 1945/46 to 1947/48. He was part of a free scoring Dundee side which won back to back Scottish League B Division championships and has the best goal ratio of any Dundee striker who has played more than 20 goals for the club with an average of 1.3 goals per game. Juliussen was a goal scoring machine in his time in Dark Blue and his seven goals against Dunfermline is a joint club record (with Alan Gilzean) for most goals in one match. He brought hope and joy to a war weary Dundee footballing public who were grateful for the goals that fired Dundee back into the big time and the club were honoured to have his son Laurence in attendance to accept his Heritage Award on his behalf.\n\nTOSH McKINLAY – 2019 LEGENDS AWARD\n\nTosh McKinlay was a wonderfully, classy left-back with attacking flair who served Dundee with distinction in his 204 appearances. He scored nine goals in a Dark Blue shirt and none is more fondly remembered than his stunning goal in a famous derby win over Dundee United at Tannadice in 1984 for which Dundee fans are forever grateful. His record in the derby of seven wins and six draws help cement his Dark Blue popularity and the Dundee fans were proud to see him go on and represent Scotland at both Euro 96 and France 98 after leaving Dens.\n\nGEORGE STEWART – 2019 LEGENDS AWARD\n\nGeorge Stewart’s 12 year career at Dens Park saw him play in a European semi-final, ten domestic semi-finals and two national cup finals and pick up winners’ medal as part of the Dundee side which won the Scottish League Cup in 1973. Powerful in the air with a good touch on the ground, Stewart had been a popular character in both the dressing room and on the terracing is part of the last Dundee side to win a major trophy. He talks with pride of his 292 appearances for The Dee and deservedly entered the Dundee FC Hall of Fame, joining five of his team mates from that iconic 1973 side, one of whom Gordon Wallace, presented him with his award.\n\nDARIUSZ ADAMCZUK – 2019 INTERNATIONAL AWARD\n\nDariusz Adamczuk was a cult hero to the Dundee support during the Nineties when he arrived for a club record fee, left 11 games later for another club record fee, returned to Dens three years later to help Dundee win the First Division and then was part of the side which secured the Dark Blues’ highest ever Premier Division finish. While at Dens Dariusz was capped four times by Poland and won the Dundee FC Player of the Year in 1999. His two spells at Dens Park were his most successful in his career and were as enjoyable for player and fans alike. He is a modern day Dundee FC hero who gave his all every time he pulled on the Dark Blue.\n\nMORTEN WEIGHORST – 2019 INTERNATIONAL AWARD\n\nMorten Weighorst was a hero for both his club Dundee and his country Denmark and while a player from a Scottish First Division side winning an international tournament with a top five FIFA ranked side may seem unlikely, that is exactly what Morten Weighorst did in 1995 the Danes won the King Fahd Cup (renamed the Confederations Cup in 1997). That same year Morten was a vital cog in the Dundee side that reached the Coca-Cola Cup Final and in the quarters against Hearts at Dens, scored a stunning strike to make it 4-4 in extra time before slotting home the winning penalty. A popular player at Dens, Morten was hugely influential in the Dark Blue midfield with his craft, surging runs and an eye for goal, and the week before the League Cup Final at Hampden scored the winning goal in a derby at Tannnadice. Legends are made of such stuff.\n\n“Honouring the past, inspiring the future”, these inductees are worthy entrants into the Dundee FC Hall of Fame and represent all that is great about this wonderful club."}, {"url": "http://www.margatefootballclubhistory.com/billbrown.shtml", "page_content": "Bill Brown\n\n*Indicates unconfirmed information. Figures in brackets after English team names indicate all appearances made and goals scored in competitive matches for Football League clubs from 1888 onwards. For Scottish League clubs the figures show details of all competitive appearances and goals scored from 1946/47 onwards.\n\nBill Brown\n\nAppearances: 9 Goals: 2\n\nDate / Year of birth: 7th February 1943\n\nPosition: Striker\n\nSeason of first appearance: 1969/70\n\nSeason of last appearance: 1969/70\n\nAlso played for: Southampton (0), Charlton Athletic (0), Romford, Chelmsford City, Bedford Town, Gillingham (115+1,34), Portsmouth (9,2), Brentford (4,0), Dunstable Town and Ford United\n\nBurly 6' 0\" tall Croydon-born centre-forward who started his career at Southampton and then had a spell with Charlton before joining Southern Leaguers Romford. Bill was their top scorer during 1963/64, finishing the season with a total of 29 goals.\n\nDuring the 1964/65 campaign Bill left Romford and signed for Chelmsford where he spent the remainder of the season before his next move took him to Bedford in August 1965.\n\nBill scored 17 goals in 42 games for Bedford before Gillingham's new manager Basil Hayward paid £2,000 for his services in February 1966. Hayward had just joined the club from Bedford.\n\nA few days after signing for the Gills Bill scored a hat-trick in a 4-2 friendly win over Ipswich and he then scored on his competitive debut in a 1-1 draw at Bournemouth. Bill went on to make 116 first team appearances for Gillingham, scoring 34 goals, before transferring to Portsmouth in June 1968.\n\nAfter a year at Fratton Park he moved to Brentford in July 1969 but the transfer didn't work out and Bill joined Margate in October the same year. He decided to move back into part-time football as he had a haulage business that he wanted to devote more time to.\n\nBill made his Margate debut in a 2-0 defeat at Poole in the Southern League on 18.10.69 and he was described by the Thanet Times as being \"a player of considerable ability\". Bill was especially strong in the air and he scored his first goal for Margate on 8.11.69 during a 2-1 defeat at Hillingdon. It was a spectacular strike - a scissor kick that the local paper said \"ripped into the roof of the net with such velocity that the netting required immediate repairs\".\n\nOn 15.11.69 Bill was in the Margate side that were thrashed 7-2 by visitors Aldershot in the FA Cup 1st Round but he struggled for form after that and only played three more first team games, scoring in the last of them - a 3-1 defeat at Hillingdon on 20.12.69. Bill then had a spell in the reserves before leaving Margate in February 1970 having scored twice from nine appearances.\n\nHe spent the remainder of the 1969/70 season back at Bedford.\n\nIn August 1970 Bill joined Dunstable and he later played for Ford United.\n\nIn 2014 Bill was living in Essex."}, {"url": "https://www.swanseacity.com/history/players-past", "page_content": "SWANSEA CITY PAST PLAYERS (Post War) A-Z\n\nA\n\nPAWEL ABBOTT\n\nThe Polish striker arrived at the Liberty from Huddersfield Town for £150,000 in January 2007. A Poland Under-23 international, he was brought in to fill the void left by Rory Fallon, who had left to join Plymouth. He made his debut as a substitute in a 2-0 win over Gillingham and scored his only goal for the Swans in a 2-1 victory at Rotherham in Roberto Martinez’s first game in charge. Abbott featured in the side that narrowly missed out on a place in the play-offs at the end of the 2006-07 season, before departing during the summer for Darlington after 18 appearances (nine as sub) and one goal. He went on to sign for Darlington, Oldham, Charlton and Polish clubs Ruch Chorzów and Zawisza Bydgoszcz.\n\nPETER ABBOTT\n\nStriker Peter Abbott was a member of Harry Gregg's squad at Swansea City. A former Manchester United apprentice, he turned professional in October 1970 but failed to secure a first-team slot and moved to the Vetch Field initially on loan in February 1974. He made his League debut in that month's 3-0 win at home to Stockport and netted three goals in 41 Fourth Division games for Swansea prior to joining Hartford Bi-Centennials in May 1976. Reuniting with Harry Gregg at Crewe Alexandra in August 1976, he joined Southend United in July 1977 and was a promotion winner in 1977-78, then returned to the United States.\n\nTAMMY ABRAHAM\n\nA tall, gangly striker, Abraham spent the 2017-18 season on loan with the Swans from parent club Chelsea. After a promising start to the campaign, Tammy and the team struggled, and he ended up with just five goals as the Swans were relegated from the Premier League. After leaving the Swans, the England international spent a season on loan at Aston Villa where he found his goalscoring form again to help the club secure promotion to the Premier League with a play-off victory over Derby County at Wembley. He has since gone on to make his mark in the Premier League with Chelsea, where he was an academy graduate; making two first-team appearances in 2016 before a successful loan move to Bristol City.\n\nREUBEN AGBOOLA\n\nVersatile left-back Reuben Agboola gained Nigerian international recognition whilst at Swansea City. Signing professional for Southampton in April 1980, he gained considerable top-flight experience before joining Sunderland for £150,000 in January 1985. He helped them win the Third Division title in 1987-88 and was loaned to Charlton Athletic and Port Vale before moving to the Vetch Field in November 1991. Making 28 League appearances for Swansea prior to joining Woking in August 1993, he then played for Gosport.\n\nPAUL AGNEW\n\nFormer Northern Ireland U-23 left-back Paul Agnew briefly played for Swansea City during the 1987-88 campaign. Initially with Cliftonville, he joined Grimsby Town for £15,000 in February 1984 and starred in their 1989-90 and 1990-91 promotion successes. He followed Alan Buckley to West Brom for £65,000 in February 1995 and reunited with Keith Alexander at Ilkeston Town in July 1997. Moving to Swansea on non-contract terms in September 1997, he made seven Third Division appearances before joining Wisbech Town in December 1997.\n\nADEBAYO AKINFENWA\n\nNigerian striker Adebayo Akinfenwa scored the winner in Swansea City's 2006 Football League Trophy final triumph. Initially with Watford, he then played for Atlantas and scored their winner in the 2001 Lithuanian Cup final. He joined Barry Town in August 2002 and featured in their 2003 Welsh Cup final success, then had spells with Boston United, Leyton Orient, Rushden & Diamonds and Doncaster Rovers before moving to Torquay United in July 2004. Top scorer in 2004-05, he reunited with Kenny Jackett at Swansea for an initial £35,000 in July 2005 and appeared in the 2005-06 League One play-off final.\n\nSANDY ALLAN\n\nScottish striker Sandy Allan had a loan spell at Swansea City during the 1972-73 season. A former amateur with Barnsley and Doncaster Rovers, he was a prolific goalscorer for Rhyl prior to joining Cardiff City for £12,500 in March 1967. He netted a hat-trick against Mjondalen in the 1969-70 ECWC and moved to Bristol Rovers for £12,500 in March 1970. Harry Gregg signed him on loan in March 1973 and he scored once in seven League games for struggling Swansea. He joined Cape Town City in March 1974, then had a spell as Harrogate Railway's player-boss before returning to South Africa to set up a window company.\n\nIVOR ALLCHURCH\n\nWelsh international inside-forward Ivor Allchurch is widely regarded as Swansea's finest post-war player. Signing professional at the Vetch Field in May 1947, the 'Golden Boy' was leading marksman three times before moving to Newcastle United for £28,000 plus Reg Davies in October 1958. He joined Cardiff City for £15,000 in August 1962 and returned to Swansea for £6,500 in July 1965. Scoring 164 goals in 445 League games overall for the Swans, he moved to Worcester City in July 1968, then was Haverfordwest's player-manager. Awarded the MBE, he later worked as a storeman and died in Swansea in May 1997.\n\nLEN ALLCHURCH\n\nWelsh international winger Len Allchurch was capped seven times whilst at Swansea. The younger brother of Ivor, he signed professional at the Vetch Field in October 1950 and featured in two consecutive Welsh Senior Cup finals before being sold to Sheffield United for £14,000 in March 1961. He helped them clinch promotion that season and moved to Stockport County in September 1965, starring in their 1966-67 Fourth Division triumph. Re-joining Swansea in July 1969, he netted 60 goals in 347 League games overall before moving to Haverfordwest in July 1971.\n\nJOE ALLEN\n\nThe Narberth-born midfielder joined the Swansea City family as an 11-year-old, coming through the youth ranks before making his mark in the first team. Allen made his senior debut in the final game of the 2006-07 season – a 6-3 home defeat against Blackpool at the Liberty. The seasons that followed saw Joe consolidate his position in the first-team squad, with the midfielder going on to make his Under-21 and senior bows for Wales. As the Swans progressed, so did Allen. He helped the club win promotion to the Premier League following the Play-Off Final win over Reading at Wembley, before going on to play a big part in the Swans’ debut season in the top-flight. His outstanding performances earned him the Wales Player of the Year award for 2012 and he went on to follow Brendan Rodgers to Liverpool in a £15million deal in the summer after 128 appearances (35 as sub) and seven goals.\n\nJOE ALLON\n\nEx-England Youth Striker Joe Allon featured prominently in Swansea City's 1987-88 promotion campaign. Signing professional for Newcastle United in November 1984, he moved to Swansea in August 1987 and scored in seven consecutive matches. He netted 12 times in 34 League games overall prior to joining Hartlepool United for £10,000 in November 1988 and was top scorer in their 1990-91 promotion success. Sold to Chelsea for £300,000 in August 1991, he joined Brentford for £275,000 in November 1992 and later played for Port Vale, Lincoln City and Hartlepool again.\n\nJULIAN ALSOP\n\nStriker Julian Alsop was an influential figure in Swansea City's 1999-2000 Third Division title triumph. Initially with Nuneaton Borough, he had spells with VS Rugby, RC Warwick, Tamworth and Halesowen Town prior to joining Bristol Rovers for £15,000 in February 1997. He moved to Swansea for £30,000 in March 1998 after a loan period and netted 16 goals in 90 League games before joining Cheltenham Town in July 2000. Top scorer in two consecutive seasons, including their 2001-02 promotion success, he joined Oxford United in June 2003 and has since played for Northampton, Tamworth, Newport County and Carmarthen.\n\nKEVIN AMANKWAAH\n\nA tall, rangy full-back, Amankwaah arrived at the Liberty in July 2006 from Yeovil. After suffering a horrific car crash in 2002 that saw him break his neck, the defender recovered well to continue his football career. Unfortunately, he didn’t really suit the style of then boss Kenny Jackett and he was eventually released by Roberto Martinez, going on to sign for Swindon Town after 29 appearances (six as sub).\n\nJORDI AMAT\n\nBarcelona-born centre back Jordi Amat joined the Swans after our League Cup winning campaign. A product of the youth academy at La Liga side Espanyol, Amat made a positive impact during the Swans Europa League spell, making his full debut playing the full 90 mins in a 4-0 home victory against Malmo FF. He went on to make 52 league appearances for the Jacks and nine appearances in Europe. In 2018, after a season long loan spell at La Liga side Real Betis, Jordi returned to Rayo Vallecano permanently.\n\nKWAME AMPADU\n\nRepublic of Ireland Under-21 midfielder Kwame Ampadu featured in Swansea City's 1994 Autoglass Trophy final success. Signing professional for Arsenal in November 1988, he joined West Brom for £50,000 in June 1991 and featured in their 1992-93 promotion campaign. 'Paddy' moved to Swansea for £15,000 in February 1994 and appeared in the 1996-97 Third Division play-off final, netting 12 goals in 147 League games before joining Leyton Orient in July 1998. He helped them qualify for the Third Division play-offs in 1998-99, then played with John Cornforth at Exeter and Newport County before moving to Tiverton.\n\nIJAH ANDERSON\n\nAttacking left-back Ijah Anderson featured in Swansea City's 2004-05 promotion success. A former Tottenham Hotspur trainee, he moved via Southend United to Brentford in July 1995 and starred as they won the Third Division title in 1998-99, were LDV Vans Trophy finalists in 2000-01 and Second Division play-off finalists in 2001-02. He was loaned to Wycombe Wanderers prior to joining Bristol Rovers in February 2003. Kenny Jackett signed him in November 2004 and he helped Swansea win the FAW Cup that season but was sacked by Swans in January 2006 after being banned for six months for drug abuse.\n\nPAUL ANDERSON\n\nAnderson was a speedy winger who was part of the Swans squad that lifted the League One title in 2007-08. He was brought to the club on a season-long loan from Liverpool in July 2007 and the youngster proved a big hit in his one and only season at the Liberty. Anderson could regularly be seen tearing up defences on the right flank – going on to secure England under-19 honours in the process. There was hope of signing the winger on a permanent basis following promotion to the Championship, but he opted to move to Nottingham Forest instead. After leaving Forest in 2012, Anderson featured for Bristol City before signing for Ipswich.\n\nMATT ANDREW\n\nWing-half Matt Andrew was a member of Swansea's 1948-49 Third Division (South) championship squad. He failed to secure a first-team slot at Bristol City before moving to the Vetch Field in August 1948 and made his League debut in place of Jim Feeney in Swansea's 3-1 defeat at Leyton Orient the following month. Featuring in two consecutive West Wales Senior Cup final triumphs, he also helped the reserves win the London Combination Cup in 1950 and made four League appearances prior to joining new-boys Workington in June 1951. Subsequently with QPR, he settled near Port Talbot and died in August 1999.\n\nKERI ANDREWS\n\nWelsh Youth international winger Keri Andrews featured in Swansea's 1987-88 promotion campaign. Locally born, he was a trainee at the Vetch Field and made his League debut in Swansea's 2-2 draw at home to Lincoln City in April 1985. He turned pro in July 1986 and helped Swansea win the West Wales Senior Cup in 1987, netting three goals in 41 League outings before moving to Newport County in July 1988 until their demise. Subsequently with Merthyr Tydfil and various Welsh League clubs, he ended his playing career with Port Tennant Colts and still lives in Swansea.\n\nRICHIE APPLEBY\n\nEx-England Youth winger Richie Appleby featured in Swansea's 1999-2000 Third Division title triumph. The younger brother of Matt Appleby, he turned pro with Newcastle in August 1993 and had a spell with Ipswich before moving to the Vetch in August 1996. He helped Swansea qualify for the promotion play-offs in 1996-97 and 1998-99, netting 11 goals in 120 League games before reuniting with Jan Molby at Kidderminster in November 2001. Was back with Molby at Hull and Kidderminster again before spells at Forest Green Rovers and Llanelli.\n\nWARREN ASPINALL\n\nMuch-travelled England Youth midfielder Warren Aspinall had a loan spell at Swansea during the 1993-94 season. Turned pro with Wigan and moved to Everton for £150,000 in 1986, then Aston Villa for £300,000 in 1987. He joined Portsmouth for £315,000 in 1988 and was loaned to Swansea in October 1993. He made five League appearances while at the Vetch, then played for Bournemouth, Carlisle, Brentford, Colchester and Brighton.\n\nJOEL ASORO\n\nMaking the switch from Sunderland’s academy for the Swans academy, the young Swedish striker broke into the first team in the 2018-19 campaign, appearing 15 times in all competitions. Asoro was loaned out twice during his time at Swansea to gather more first team experience, making 17 appearances for Eredivisie side FC Groningen scoring three goals, before turning out for Italian side Genoa. Asoro joined Swedish side Djurgardens IF after leaving the Swans.\n\nPAUL ATKINSON\n\nWinger Paul Atkinson had two separate loan spells at Swansea. Signing pro for Oldham in 1979, he was ever-present in 1982-83. He joined Watford for £175,000 in 1983 and featured in the 1984 FA Cup final, returning to Oldham in 1985. Initially loaned to Swansea in December 1986, he returned on loan in March 1987 and netted three goals in 18 League games overall. He moved to Burnley in July 1988, then Northwich Victoria, Belgian side Binchoise, Altrincham, Frickley and Farsley Celtic.\n\nBRIAN ATTLEY\n\nVersatile full-back Brian Attley featured in Swansea's 1980-81 promotion and Welsh Cup double success. Signing pro for Cardiff in 1973, he helped them win promotion in 1975-76 and reach the FA Cup fifth round in 1976-77. He moved to the Vetch for £20,000 in February 1979 and briefly played in the top-flight, netting six goals in 89 League games for Swansea before being sold to Derby for £25,000 in February 1982. Following a loan spell at Oxford, he joined Gresley Rovers in 1984, then Stapenhill.\n\nKEVIN AUSTIN\n\nTrinidad & Tobago international defender Kevin Austin starred in Swansea's 2004-05 promotion campaign. He impressed with Saffron Walden prior to joining Leyton Orient in August 1993 and was sold to Lincoln for £30,000 in July 1996. Ever-present in their 1997-98 promotion success, he joined Barnsley in July 1999 but was sidelined by an Achilles injury. He had spells with Brentford and Cambridge before reuniting with John Still at Bristol Rovers in July 2002. Moving to Swansea in July 2004, he helped them qualify for the play-offs.\n\nJORDAN AYEW\n\nGhana international Jordan followed in the footsteps of elder brother Andre when he joined the Swans from Aston Villa in January 2017 in a player exchange deal that saw Neil Taylor and a small fee go the other way. With the Swans relegated at the end of a difficult 2017-18 season that saw three different managers in charge of the club, Jordan joined Premier League club Crystal Palace on loan for the 2018-2019 season. That loan move was made permanent in the summer of 2019. Jordan had started his career at Marseille before a loan move to Sochaux and a permanent switch to Lorient prior to his 2015 transfer to Villa.\n\nANDRE AYEW\n\nThe Ghanaian international first arrived in SA1 in the summer of 2015 on a free transfer. Scoring three goals in his first four league appearances, his form continued to make an immediate impact for the Swans which earned him Premier League Player of the Month in August 2015. The following season, Ayew signed for West Ham United for a then club record fee of £20.5 million. The winger went on to score 12 goals in 50 appearances for the Hammers before returning to Swansea in 2018. Ayew helped the Swans reach the play-offs in consecutive seasons, finishing both the 2019-20 and 2020-21 seasons as the club’s top scorer with 15 and 16 goals respectively.\n\nB\n\nMARK BAKER\n\nWelsh U-21 striker Mark Baker featured in Swansea's 1978-79 promotion campaign. Locally born, he signed pro for Swansea in September 1978 and was given his League debut in the 2-1 defeat at Chesterfield the following month. He scored twice in Swansea's 3-2 win at home to Mansfield but failed to maintain a first-team slot behind Alan Curtis and made 11 League appearances overall before joining Merthyr in 1980. He played extensively in the Welsh League for Haverfordwest, Llanelli (twice), Maesteg, Port Talbot and Morriston.\n\nCOURTNEY BAKER-RICHARDSON\n\nAfter an impressive season for Leamington in the Southern League Premier Division, scoring 28 times in 74 appearances, the young English striker joined the Swans on a two-year deal. Baker-Richardson made 21 appearances for the Jacks, scoring four time including a goal in the penultimate game of the 2018-19 season against Blackburn Rovers. At the conclusion of his Swans’ deal, Courtney joined Newport County.\n\nPETA B'ALAC\n\nGoalkeeper Peta B'alac had a loan spell at Swansea during the 1973-74 season. A former Plymouth apprentice, he turned pro in December 1971 and was given his League debut in the following month's 4-0 victory at home to York. He contested a first-team slot with Jim Furnell and was loaned to Swansea in September 1973, making four consecutive Fourth Division appearances while at the Vetch. Later playing in South Africa for 12 years, mainly for Johannesburg-based Kaiser Chiefs, he also played for Torrington.\n\nJOHNNY BARBER\n\nWinger Johnny Barber understudied Cyril Beech while at the Vetch. A former Arsenal amateur, he joined Swansea initially on trial in 1950 and made his League debut in the 2-2 draw at home to Doncaster the following month. He played four successive Second Division games in place of the injured Beech and also helped Swansea reserves win the Welsh League First Division title in 1950-51. Moving to Walsall in July 1951, he was unable to prevent them having to seek re-election in 1951-52 and later played for Hereford, Burton Albion and Brush Sports. He died in Lichfield in September 2002.\n\nKEITH BARBER\n\nBrave goalkeeper Keith Barber was an important figure in Swansea's 1977-78 promotion success. Initially with Dunstable, he joined Luton in 1971 and helped them win promotion to the top-flight in 1973-74. He was ever-present in 1975-76 but lost his place after injury and moved to Swansea in July 1977. Making 42 Fourth Division appearances while at the Vetch, he was loaned to Cardiff City in September 1978, then played for Bridgend.\n\nDAVID BARNHOUSE\n\nWelsh U-21 defender David Barnhouse provided reliable cover for Steve Jenkins while at Swansea. Locally born, he was a trainee at the Vetch and made his League debut in Swansea's 3-0 defeat at Hull on the final day of the 1991-92 season. He turned pro in July 1993 and helped take Middlesbrough to an FA Cup third round replay in 1994-95, playing 23 League games for Swansea prior to joining Merthyr in August 1996. Moving to Carmarthen soon afterwards, he gained Welsh Semi-Pro recognition and played in the 1999 Welsh Cup final. He also played for Haverfordwest.\n\nJAMIE BARNWELL-EDINBORO\n\nYoung striker Jamie Barnwell-Edinboro had a loan spell at Swansea during the 1995-96 campaign. Signing professional for Coventry in 1994, he made his Premiership debut in their 2-1 defeat at Middlesbrough in September 1995. He was loaned to Swansea in December 1995 and made four League appearances while at the Vetch. Moving to Cambridge in March 1996, he joined Stevenage Borough in July 1998 and later played for Doncaster, Goole, North Ferriby, Denaby, Brigg, Goole again and Hall Road Rangers.\n\nDANNY BARTLEY\n\nEx-England Youth international left-back Danny Bartley starred as Swansea City won promotion in two consecutive seasons under John Toshack. Signing professional for Bristol City in October 1964, he gained a regular first-team slot as a winger and joined Swansea in a joint £12,000 deal with Dave Bruton August 1973. He netted eight goals in 198 League games while at the Vetch Field before moving to Hereford United in March 1980, then played for TrowbridgeTown, Forest Green Rovers, Maesteg Park, Port Talbot, Bridgend and Llanelli. Still living in Swansea.\n\nDANNY BARWOOD\n\nWelsh Youth international winger Danny Barwood was a Swansea City trainee who made his League debut as a 16 year-old in the 2-0 victory at home to HullCity in January 1998. He possessed electrifying pace and strength on the ball, scoring his solitary goal in three Third Division games in Swansea's 2-0 win over Chester City two months later. In March 1998 he played for Wales U-18 in the Paolo Valenta Tournament in Italy. He had a trial with Cardiff City before moving to Merthyr Tydfil in November 2000 but failed to make an impact and decided to switch codes, following his father Adrian Barwood into Rugby Union.\n\nMIKE BASHAM\n\nEngland Youth international central defender Mike Basham featured in Swansea City's 1994 Autoglass Trophy final triumph. Signing professional for West Ham in July 1992, he made his League debut on loan to Colchester before joining Swansea initially on loan in March 1994. He helped to beat Middlesbrough in the 1994-95 FA Cup third round replay and scored once in 29 League games prior to joining Peterborough United in December 1995. Moving to Barnet in August 1997, he featured as they qualified for the play-offs in 1997-98 and 1999-2000. He subsequently played for York City, Chelmsford City and Thurrock.\n\nGUILLEM BAUZA\n\nBauza, more fondly known as ‘Bussy’ was one of Roberto Martinez’s first signings in the summer of 2007. The Spaniard arrived from Espanyol on a one-year deal and featured for Spain in their Under-16 European Championship winning team, playing alongside Fernando Torres. Also a qualified teacher, he was a wholehearted player who never gave anything less than 100 per cent during his time at the Liberty. He famously scored some vital goals for the club, including a brace at Gillingham in April 2008 that guaranteed promotion to the Championship. After extending his stay in SA1 for a further two seasons, Bauza departed the Swans in May 2010 after 68 appearances (35 as sub) and 16 goals, going on to feature for Hereford, Northampton, Exeter City and Port Talbot in the League of Wales.\n\nMARCUS BEAN\n\nYoung midfielder Marcus Bean had two separate loan spells at Swansea City. A former QPR scholar, he helped them reach the Second Division play-off final in 2002-03, then win promotion in 2003-04. He turned professional in July 2004 and joined Swansea on loan at the same time as his team-mate Kevin McLeod was signed for £60,000 in February 2005. Featuring in that promotion campaign, he was recalled by QPR during an injury crisis two months later but re-joined Swansea on loan in September 2005 and scored once in 17 League games overall for the club. He moved from QPR to Blackpool in January 2006.\n\nCRAIG BEATTIE\n\nBeattie was a former Rangers schoolboy who made his name with arch-rivals Celtic. The striker made his Champions League debut in a qualifier against FB Kaunas in 2003, eventually going on to score 16 goals in 43 games for the Hoops. That form earned him a move to West Brom in July 2007, but following a bout of injuries he joined the Swans in August 2009 as a replacement for Jason Scotland. Injuries also hampered his time at the Liberty, although he was part of the squad that won promotion to the Premier League in 2011 before being released after 46 appearances (24 as sub) and seven goals. After a spell with Hearts in the SPL, Beattie joined Hearts, St Johnston, Barne and Dundee.\n\nJOEY BEAUCHAMP\n\nFlying winger Joey Beauchamp had a loan spell at Swansea City during the 1991-92 season. Signing professional for Oxford United in May 1989, he was loaned to Swansea in October 1991 and scored once in seven League games whilst at the Vetch Field. He starred in Oxford's 1993-94 FA Cup run and was sold to West Ham for £1,000,000 in June 1994. Moving to Swindon Town in a deal involving Adrian Whitbread just two months later, he re-joined Oxford for £75,000 in October 1995 and starred in their 1995-96 promotion success. He was top scorer in 1997-98 and subsequently played for Abingdon and Didcot Town.\n\nCYRIL BEECH\n\nHard-working winger Cyril Beech scored in Swansea's 1950 Welsh Cup final triumph. Previously with Merthyr Tydfil, he moved to the Vetch Field for £6,000 in August 1949 and was Swansea's leading marksman in 1949-50. He played alongside his older brother Gilbert and netted 29 goals in 136 Second Division games for Swansea prior to joining Worcester City in August 1954, then reunited with Billy Lucas at Newport County in July 1955. Moving to Hereford United in March 1957, he later played for Merthyr again, Brecon Corinthians and Brierley Hill. He became a coach driver and died in Merthyr in May 2001.\n\nGILBERT BEECH\n\nLong-serving left-back Gilbert Beech featured in Swansea's 1950 Welsh Cup final success. He starred as Merthyr Tydfil won the Southern League and Cup 'double' in 1947-48, then beat Swansea in the 1949 Welsh Cup final. Moving to the Vetch Field for £5,000 in November 1949, he was ever-present in two consecutive seasons and contested a first-team slot with Dai Thomas. He netted three goals in 157 League games for Swansea before re-joining Merthyr in July 1958, then reunited with his brother Cyril at Hereford United and Brecon Corinthians.\n\nALAN BEER\n\nFormer Welsh Amateur international striker Alan Beer was a young member of Roy Bentley's squad at Swansea City. He played local football for Tower United and West End before signing professional for Swansea in February 1971, netting three goals in 15 Third Division games while at the Vetch Field. Joining Weymouth in August 1972, he featured in their 1973 Southern League Cup final triumph. He joined Exeter City for £8,000 in November 1974 and starred in their 1976-77 promotion success. A knee injury ended his playing career soon after and he became Exeter's coach.\n\nJAN BEKKER\n\nStriker Jan Bekker featured in Swansea City's 1975 West Wales Senior Cup final triumph. Born in Cardiff of a Dutch father, he played for Roath Rangers, Cardiff Corries and was leading marksman as Everwarm (Bridgend) won the Welsh League title in 1972-73. He moved to the Vetch Field in February 1975 and contested a first-team slot with Geoff Bray, netting four goals in 20 Fourth Division games for Swansea prior to re-joining Bridgend in August 1976. Later player-boss of Tondu Robins, he also managed Garw Athletic to promotion.\n\nALF BELLIS\n\nExperienced winger Alf Bellis helped Swansea to reach the FA Cup fifth round in 1951-52. Initially with Shell Juniors and Burnell's Ironworks, he joined Port Vale in March 1938 and scored on his League debut in their 4-1 win over Rochdale the following month. He guested for Rochdale, Manchester United, Manchester City, Lincoln City and Notts County during the war and joined Bury in exchange for Walter Keeley plus £4,000 in January 1948. Moving to Swansea in August 1951, he netted 11 goals in 41 League games prior to joining Chesterfield in August 1953, then played for Rhyl, Colwyn Bay and Penmaenmawr.\n\nDEREK BELLOTTI\n\nMuch-travelled keeper Derek Bellotti briefly succeeded Tony Millington in Swansea City's goal. A former QPR apprentice, he followed Basil Hayward from Bedford Town to Gillingham in July 1966 and joined Charlton Athletic for £5,000 in October 1970. He moved to Southend United in December 1971 and helped them win promotion that season. Harry Gregg paid £3,000 for him in May 1974 and he made 19 Fourth Division appearances for Swansea prior to joining Maidstone United in July 1975, then played for Falmouth, Bideford and Torrington.\n\nDAVID BERESFORD\n\nEx-England Youth international winger David Beresford had a loan spell at Swansea City during the 1995-96 season. Signing professional for Oldham Athletic in July 1994, he was loaned to Swansea in August 1995 and made six League appearances while at the Vetch Field. He joined Huddersfield for £350,000 in March 1997 and starred as they reached the FA Cup fifth round in 1998-99, moving to Hull City in July 2001 Following spells at Plymouth and Macclesfield he reunited with Brian Little at Tranmere in November 2003 subsequently returned to Macclesfield in 2005.\n\nFEDE BESSONE\n\nRoberto Martinez signed the Argentine defender, formerly of Barcelona, Tarragona and Espanyol, on a free transfer in 2008. Bessone played for the Swans for two full seasons before leaving for Leeds United in the summer of 2010. However, he found it difficult to hold down a regular place at Elland Road and following a brief loan spell at Charlton, Bessone returned to the Liberty on a free transfer in August 2011. He acted as cover for Neil Taylor during our debut Premier League season and was released in 2012 after just two appearances, taking his total to 42 (four as sub) and one goal. He later went on to feature for Swindon, Oldham Kansas City and Millwall.\n\nPAUL BEVAN\n\nVersatile midfielder Paul Bevan was a member of Harry Gregg's squad at Swansea City. Signing professional for Shrewsbury Town in October 1970, he made his League debut in that month's 2-0 defeat at Halifax Town and followed Gregg to the Vetch Field for £5,000 in August 1973. He netted five goals in 80 League games for Swansea before reuniting with Gregg again at Crewe Alexandra in July 1975. Moving to Worcester City in March 1980, he later played for Newtown in Welsh football.\n\nALFIE BIGGS\n\nCentre-forward Alfie Biggs played for Swansea during the 1968-69 season. Initially with Bristol Rovers, he was ever-present in 1956-57 and moved to Preston for £18,000 in July 1961. Sold to Walsall for £10,000 in March 1968, he joined Swansea in exchange for Jimmy McMorran in October 1968 and netted four goals in 16 Fourth Division games before reuniting with Doug Hillard at Taunton Town in July 1969.\n\nJOHNNY BIRD\n\nExperienced left-back Johnny Bird contested a first-team slot with Vic Gomersall whilst at Swansea. Signing professional for Newport County in November 1957, the Welsh Schoolboy international made his League debut as a 16 year-old and was a Welsh Cup finalist in 1963. He played nearly 300 games for Newport, reuniting with Billy Lucas at the Vetch Field in July 1967 and making eight Fourth Division appearances for Swansea prior to joining John Charles' Hereford United in July 1968. Subsequently with Merthyr Tydfil, Caerau and Pontyclun's player-boss.\n\nTONY BIRD\n\nWelsh U-21 striker Tony Bird featured in Swansea City's 1999-2000 Third Division title triumph. A former Cardiff City trainee, he helped them win the Third Division title in 1992-93 and moved to Barry Town in January 1996. He starred in two League of Wales title successes as well as their 1997 Welsh Cup final triumph. Jan Molby paid £60,000 for him and Dave O'Gorman in August 1997 and he was Swansea's top scorer in 1997-98, netting 18 goals in 86 League games before reuniting with Molby at Kidderminster Harriers in July 2000. He also played for St Patricks, Drogheda, Bath City and Haverfordwest.\n\nJOHN BLACK\n\nFormer Welsh Schoolboy goalkeeper John Black played for Swansea in the 1964-65 Welsh Cup semi-final. Signing professional for Arsenal in February 1963, he helped them win the Football Combination title that season but failed to secure a first-team slot and moved to the Vetch Field in December 1964. He made his League debut in place of Ronnie Briggs in Swansea's 4-0 win at home to Preston three months later and played 15 League games prior to joining Worcester City in November 1965, then played for Ammanford.\n\nDEREK BLACKBURN\n\nCentral defender Derek Blackburn understudied Dudley Peake whilst at Swansea. He had spells with Burnley and Chesterfield without making any first-team appearances and moved via Ossett Town to the Vetch Field for £1,500 in January 1957. Given his League debut in Swansea's 4-0 defeat at home to Blackburn Rovers in September 1957, his only other Second Division appearance was in the 3-1 reverse against Rotherham two months later. He joined Yeovil Town in July 1958 and helped win the Southern League Cup in 1961.\n\nPETER BODAK\n\nMuch-travelled midfielder Peter Bodak featured in Swansea City's 1987-88 Fourth Division play-off final triumph. Initially with Coventry City, he helped them reach the League Cup semi-finals in 1980-81 and moved to Manchester United in July 1982. He joined rivals Manchester City five months later, then played for Royal Antwerp and Seiko prior to joining Crewe Alexandra in December 1986. Terry Yorath signed him in March 1988 and he netted four goals in 31 League outings for Swansea before returning to Hong Kong with Happy Valley in May 1989. He subsequently played for Walsall and Atherstone United.\n\nFERRIE BODDE\n\nSigned in the summer of 2007 from Dutch side ADO Den Haag, Bodde went on to become a firm fans favourite at the Liberty Stadium. The tough-tackling midfielder attracted interest from various clubs in Europe but Bodde opted to ply his trade in south west Wales, along with former team-mate Dorus De Vries. He was a star performer in a Swansea side that ran away with the League One title in his first full season at the club, and was labelled as the Dutch Roy Keane on more than one occasion. Had the ability in midfield to spray the ball all over the pitch at will and score spectacular goals. However, a seemingly innocuous challenge against Birmingham in November 2008 resulted in cruciate ligament damage and despite two operations and trying numerous comebacks, the player was forced to retire from football in his prime after 59 appearances (three as sub) and 14 goals.\n\nPHIL BOERSMA\n\nMidfielder Phil Boersma (above left) was an experienced figure in Swansea City's 1978-79 promotion success. Signing professional for Liverpool in September 1966, he helped them win the League Championship and UEFA Cup in 1972-73 and was sold to Middlesbrough for £72,000 in December 1975. He joined Luton Town for £35,000 in August 1977 and reunited with John Toshack at the Vetch Field for a similar fee in September 1978. Scoring once in 18 League games for Swansea until breaking his ankle at Swindon in April 1979, he became Swansea's assistant manager.\n\nCHAD BOND\n\nThe Neath-born forward was a Welsh Semi-Pro international, who had loan spells with CF Balaguer, Ostersunds and Newport County during his time with the Swans after signing in July 2005. A hard-working striker, he found it difficult to get first team games and made his only league appearance at Coventry City in 2009, and featuring in a League Cup tie at home to Scunthorpe. Upon his release at the end of the 2009-10 season he signed for Port Talbot Town in the Welsh Premier League.\n\nMATTHEW BOUND\n\nRugged central defender Matt Bound was an important figure in Swansea City's 1999-2000 Third Division title triumph. Signing professional for Southampton in May 1991, he had limited Premiership opportunities and joined Stockport County for £100,000 in October 1994. He featured in their 1996-97 promotion campaign and moved to Swansea for £55,000 in November 1997, helping to qualify for the Third Division play-offs in 1998-99. Starring alongside Jason Smith, he scored nine times in 174 League games prior to joining Oxford United in December 2001. He later played for Weymouth and Eastleigh.\n\nFABIO BORINI\n\nBrought in to the club on loan from Chelsea by manager Brendan Rodgers at the end of the 2011 season, Borini immediately hit the headlines by scoring twice on his debut against Nottingham Forest. The striker joined Chelsea from Bologna in 2007 but found it hard to break into the first team, making only four appearances in four years. But having worked with Rodgers during his time at Stamford Bridge, he jumped at the chance to play regularly in the first team at the Liberty and didn't disappoint during his short time at the club with six goals from 12 appearances (one as sub). He played his final Swans game at Wembley in the Championship Play-Off Final in 2011, and was later reunited with Rodgers at Liverpool after a big-money move.\n\nJASON BOWEN\n\nWelsh international winger Jason Bowen starred in Swansea City's 1994 Autoglass Trophy final triumph. A former trainee at the Vetch Field, he turned professional in July 1990 and helped Swansea reach the Second Division play-offs in 1992-93. He was leading marksman in 1993-94 and scored 26 times in 124 League games before being sold to Birmingham City for £350,000 in July 1995. Featuring in their 1995-96 Coca-Cola Cup run, he joined Reading for £200,000 in December 1997 and reunited with Frank Burrows at Cardiff City in January 1999. Helping them win promotion three times, he also played for Newport County and Llanelli.\n\nWALTER BOYD\n\nJamaican international striker Walter Boyd featured prominently in Swansea City's 1999-2000 Third Division title campaign. 'The Pearl' starred for Jamaican side Arnett Gardens and played for his country in the 1998 World Cup, then had a spell with Colorado Foxes in the United States before John Hollins signed him in October 1999. He scored twice on his League debut in Swansea's 2-0 win at home to Rotherham United but suffered injury problems during his time at the Vetch Field.\n\nTERRY BOYLE\n\nFormer Welsh international central defender Terry Boyle played for Swansea City during the 1989-90 campaign. Signing professional for Tottenham Hotspur in November 1975, he joined Crystal Palace in January 1978 and was swapped for Bristol City's Kevin Mabbutt in October 1981. He moved via Newport County to Cardiff City for £22,500 in August 1986 and featured in their 1987-88 promotion and Welsh Cup 'double' success. Reuniting with Ian Evans at Swansea for £11,000 in August 1989, he scored once in 27 League games before moving to Merthyr Tydfil in August 1990. He has also coached various Welsh clubs.\n\nLEE BRACEY\n\nGoalkeeper Lee Bracey was a key figure in Swansea City's 1989 Welsh Cup final triumph. Signing professional for West Ham in July 1987, he moved to the Vetch Field in August 1988 and helped Swansea take Liverpool to an FA Cup third round replay in 1989-90. He made 99 League appearances prior to joining Halifax Town for £47,500 in October 1991, missing just one match during their fateful 1992-93 campaign. Sold to Bury for £20,000 in August 1993, he was a promotion winner in 1995-96 and joined Ipswich Town in August 1997. He also played for Hull City, Ossett Town, Chorley and Mossley.\n\nFEBIAN BRANDY\n\nSigned on loan from Manchester United in January 2008, Brandy played his part in the Swans’ League One title success. He returned to the Liberty for a further six months at the start of the 2008-09 season, despite being used as a substitute for most of his time at the club. After leaving the Swans following 39 appearances (33 as sub) and three goals, he featured for Hereford, Gillingham, Notts County, Walsall and Sheffield United.\n\nGEOFF BRAY\n\nStriker Geoff Bray was Swansea City's leading marksman in 1975-76. A former Gillingham junior, he played for Erith & Belvedere before joining Oxford United in July 1971 and made his League debut in their 2-0 defeat at Huddersfield in September 1972. Harry Griffiths signed him in July 1975 and he scored 19 times in 46 Fourth Division outings for Swansea prior to joining Torquay United in November 1976. He moved to Dartford in July 1977 and topped their goalscoring charts in 1977-78.\n\nPAUL BRAYSON\n\nEngland Youth striker Paul Brayson helped Swansea City qualify for the Third Division play-offs in 1996-97. Signing professional for Newcastle United in August 1995, he was loaned to Swansea in January 1997 and scored five times in 11 Third Division games whilst at the Vetch Field. He moved to Reading for £100,000 in March 1988 but was unable to prevent relegation that season and joined Cardiff City in March 2000, helping them win promotion in 2000-01 and reach the Second Division play-offs in 2001-02. Joining newly promoted Cheltenham Town in August 2002 and then Northwich Victoria.\n\nDEREK BRAZIL\n\nRepublic of Ireland U-21 defender Derek Brazil had a loan spell at Swansea City during the 1991-92 campaign. He played for Rivermount Boys Club prior to joining Manchester United in March 1986 and was loaned to Swansea in September 1991, scoring once in 12 League games whilst at the Vetch Field. He joined Cardiff City for £85,000 in August 1992 and starred in their 1992-93 Third Division title and Welsh Cup 'double' success. Moving to AFC Newport in August 1996, he helped Cabletel win the 1999 Welsh Cup final and played and managed Haverfordwest.\n\nRHIAN BREWSTER\n\nLiverpool youth star Rhian Brewster joined the Swans in January 2020 on loan for the remainder of the season, reuniting with former manager Steve Cooper with whom he won the under-17 World Cup title with England. The striker made his debut in the south Wales derby which ended in a goalless draw before scoring the winning goal against Wigan Athletic on home turf a week later. Brewster ended the campaign with 11 goals in 22 appearances before securing a permanent move to Sheffield United.\n\nSAM BRIDDON\n\nWing-half Sam Briddon played for Swansea either side of the Second World War. Initially with Port Vale, he played for Stanton Hill and Devessall before re-joining Port Vale in February 1933 and joined Brentford in August 1935. He gained top-flight experience whilst at Griffin Park and moved via Swindon Town to Swansea in July 1939, featuring in the first three matches of the aborted 1939-40 League campaign. A wartime guest for Bolton and West Ham, he appeared in Swansea's first post-war League game and played 18 Third Division (South) games before retiring. He became a miner and died in Mansfield in June 1975.\n\nRONNIE BRIGGS\n\nNorthern Ireland international goalkeeper Ronnie Briggs starred as Swansea reached the FA Cup fifth round in 1964-65. Signing professional for Manchester United in March 1960, he had limited top-flight opportunities behind Harry Gregg and moved to the Vetch Field in May 1964. He understudied Noel Dwyer and made 27 Second Division appearances for Swansea prior to joining Bristol Rovers in May 1965, then played for Minehead, Frome Town, Glastonbury and Taunton Town until a hand injury ended his career. Sadly, Ronnie passed away in August, 2008.\n\nSTEVE BRODIE\n\nHard-working midfielder Steve Brodie helped Swansea City win the West Wales Senior Cup in 2002. Signing professional for Sunderland in July 1991, he failed to secure a regular first-team slot and was loaned to Doncaster Rovers before joining Scarborough in December 1996. He starred as they qualified for the Third Division play-offs in 1997-98 and reunited with Colin Addison at Swansea in November 2001. Scoring twice in 26 League outings, he moved to Chester City in July 2002 and was loaned to Nuneaton, Forest Green and Leigh RMI prior to joining Droylsden and Stalybridge Celtic.\n\nGRAHAM BROWN\n\nGoalkeeper Graham Brown briefly played for Swansea City during the 1976-77 campaign. He played for Millwall and Crawley Town prior to joining Mansfield Town in August 1969 and featured in their 1969-70 FA Cup run. Moving to Doncaster Rovers in July 1974, he had a spell with Portland Timbers before joining Swansea in September 1976. He made four consecutive League appearances prior to joining Southport in December 1976, then played for Portland again, York City, Rotherham United and Mansfield again.\n\nLINTON BROWN\n\nFast striker Linton Brown appeared for Swansea City in the 1996-97 Third Division play-off final. He played for Bridlington Trinity, North Ferriby, Guiseley and Halifax Town before joining Hull City in January 1993, partnering Dean Windass in their attack. Moving to the Vetch Field for £60,000 in March 1996, he was blighted by injury problems and netted three goals in 28 League outings for Swansea. He was loaned to Scarborough prior to joining Emley in March 1998, then reunited with several former Hull players at Gainsborough Trinity.\n\nTOMMY BROWN\n\nEx-England Youth defender Tommy Brown helped Swansea win the West Wales Senior Cup in 1956. Initially with South Liverpool, he joined Doncaster Rovers in February 1951 and made his League debut in their 2-0 win at home to Leeds United seven months later. He was a regular in their Second Division side before moving to Llanelly in July 1954, returning to League action with Swansea for £7,500 in November 1955. Alternating between right-back and right-half whilst at the Vetch Field, he made 68 Second Division appearances for Swansea until leaving in May 1959.\n\nDAVE BRUTON\n\nCentral defender Dave Bruton was Swansea City's 'Player of the Year' in 1973-74. Signing professional for BristolCity in July 1971, he moved to Swansea with Danny Bartley in a £12,000 deal in August 1973 and featured in the 1976-77 promotion near-miss. He helped Swansea win promotion the following season and scored 19 times in 192 League outings before being sold to Newport County for £15,000 in October 1978. Starring as they won promotion in 1978-79 and were ECWC quarter-finalists in 1979-80, he later played for Gloucester City.\n\nKEVIN BUDD\n\nFull-back Kevin Budd briefly played for Swansea City during the 1985-86 season. A former Bournemouth apprentice, he followed John Benson to Norwich City in October 1979 and Manchester City in February 1981. He played for hometown Hillingdon before reuniting with John Bond at Swansea on a non-contract basis in November 1985. After impressing in the reserves, he made his League debut in that month's 3-1 defeat at home to Bristol City but suffered an ankle injury and by the time he was fit again Bond had been a victim of economy cuts.\n\nRON BURGESS\n\nFormer Welsh international wing-half Ron Burgess had a spell as Swansea's player-manager. Initially with Cwm Villa, he joined Tottenham Hotspur in May 1936 and captained the 'Push & Run' side to the Second Division title in 1949-50 and League Championship in 1950-51. He was capped 32 times and moved to Swansea as player-coach in August 1954, succeeding Billy McCandless as player-boss a year later. Scoring once in 46 Second Division games, he resigned in August 1958 and subsequently managed Watford, Hendon, Bedford Town and Harrow Borough. He resided in Swansea until his death in February 2005.\n\nCHRIS BURNS\n\nMidfielder Chris Burns had two spells with Swansea City. He began with Cheltenham Town and moved to Portsmouth for £25,000 in March 1991. Ever-present as Pompey reached the FA Cup semi-finals in 1991-92, he also helped qualify for the First Division play-offs in 1992-93 and reunited with Frank Burrows on loan to Swansea in December 1993. He re-joined the Swans in November 1994 and made nine League appearances before moving to Northampton Town in January 1995. Later with Gloucester City, he played for Forest Green in the 2001 FA Trophy final and was player-boss of Gloucester and Cinderford.\n\nFRANK BURNS\n\nWing-half Frank Burns was ever-present in two consecutive seasons including Swansea's 1948-49 Third Division (South) title triumph. A former Wolves amateur, he moved to the Vetch Field in August 1944 and helped Swansea win the London Combination Cup in 1947. He was a tenacious tackler with good positional sense and scored nine times in 172 League outings for Swansea prior to joining Southend United in July 1952. Moving to Crewe in November 1956, he joined Cheltenham Town in July 1958, then played for Margate.\n\nFINLEY BURNS\n\nThe Manchester City teenager arrived on loan in January 2022 but found game time hard to come by in a fairly settled Swans back three. He made just three appearances for the Swans, and spent most of his time on the bench. He returned to City at the end of the season.\n\nPAUL BURROWS\n\nWelsh Youth striker Paul Burrows briefly appeared for Swansea City during the 1985-86 campaign. Locally born, he was an apprentice at the Vetch Field and made his League debut in Swansea's 5-1 victory at Wolves a month before turning professional in October 1985. He scored in the 2-1 FA Cup second defeat at home to Bristol Rovers and played three League games overall prior to joining Haverfordwest in 1987. Later with Barry Town, Inter Cabletel, Briton Ferry, Carmarthen and Haverfordwest and still lives in Swansea.\n\nTOM BUTLER\n\nSigned from Hartlepool United in August 2006, the winger enjoyed spells at Sunderland and Dunfermline before going out on loan at Darlington. Twice capped by the Republic of Ireland, Butler was a first team regular for four years before injuries dogged his final season at the Liberty. A hard-working player who gained a reputation for his off the cuff humour in and around the dressing room, he was a player who would always be remembered fondly by fans and colleagues alike for his effort on and off the pitch. He made 145 appearances (59 as sub) and scored 19 goals before being forced to hang up his boots at the age of 31 because of a persistent thigh injury.\n\nSHAUN BYRNE\n\nRepublic of Ireland U-21 left-back Shaun Byrne had a loan spell at Swansea City during the 2003-04 season. A former West Ham trainee, he signed professional at Upton Park in July 1999 and made his Premiership debut in their 2-2 draw at Newcastle United six months later. He was loaned to Bristol Rovers in January 2000, then followed Leon Britton and Izzy Iriekpen to Swansea on loan in January 2004, making nine Third Division appearances whilst at the Vetch Field. Moving to Dublin City in August 2004, he joined Chesham United in January 2005 and also played for Burnham and Hemel Hempstead.\n\nC\n\nIAN CALLAGHAN\n\nFormer England international midfielder Ian Callaghan was an experienced figure in Swansea City's 1978-79 promotion campaign. He made a record 640 League appearances for Liverpool, starring in five League Championship successes, two FA Cup final triumphs and also helping to win the European Cup and UEFA Cup. He was Footballer of the Year in 1974 and awarded the MBE, reuniting with John Toshack at the Vetch Field in September 1978. Scoring once in 76 League outings for Swansea, he had spells with Cork Hibernians and Soudifiord before joining Crewe in October 1981.\n\nDANNY CANNING\n\nWelsh goalkeeper Danny Canning helped Swansea clinch the Third Division (South) title in 1948-49. Initially with Abercynon, he joined Cardiff City in July 1945 and featured prominently in their 1946-47 Third Division (South) title triumph. He moved to Swansea for £3,000 in January 1949 and contested a first-team slot with Jack Parry, making 47 League appearances before being sold to Nottingham Forest for £2,000 in July 1951. Later with Great Yarmouth, Newport County and Abergavenny.\n\nTOM CARROLL\n\nAfter a successful loan spell at Swansea City during the 2014-15 campaign, Carroll returned to the club on a three-and-a-half-year deal from Tottenham Hotspur in January 2017. During his first game as a permanent Swan, he helped the squad to a first ever away league win at Anfield. The midfielder scored his first goal for the club in a vital relegation battle against Stoke City in 2017. During his time at the Swans, Carroll enjoyed a short loan spell at Aston Villa before suffering a hip injury in the 2018-19 season. He made 85 appearances for the Jacks, scoring two goals.\n\nDAVE CARVER\n\nExperienced right-back Dave Carver had a loan spell at Swansea City during the 1972-73 season. Signing professional for Rotherham United in January 1962, he moved to Cardiff City for £11,000 in January 1966 and helped them reach the ECWC semi-finals in 1967-68. He featured in four successive Welsh Cup final triumphs and was loaned to Swansea in January 1973, making three League appearances whilst at the Vetch Field. Joining Hereford United in August 1973, he had a loan spell with Doncaster, then played for Retford.\n\nRYAN CASEY\n\nRepublic of Ireland U-21 winger Ryan Casey featured in Swansea City's 1999-2000 Third Division title campaign. A former trainee at the Vetch Field, he made his League debut in Swansea's 1-0 defeat at Leyton Orient seven months before signing professional in May 1997. He regularly featured as a substitute but was unlucky with injuries. Able to deliver quality crosses from the left flank, he returned from a loan spell at Merthyr Tydfil to score twice in 62 League games for Swansea before reuniting with Tony Bird at Irish side St Patrick's in August 2002. Later with Cork City and Galway United.\n\nBRIAN CASH\n\nRepublic of Ireland U-21 winger Brian Cash had a loan spell at Swansea City during the 2002-03 season. A former Nottingham Forest trainee, he signed professional in December 1999 and was given his League debut in their 3-1 victory at Stockport County in February 2002. He had few opportunities at the City Ground and was loaned to Swansea in October 2002, making five Third Division appearances whilst at the Vetch Field. Following a similar loan period at Rochdale, he briefly joined Bristol Rovers on a non-contract basis in December 2004, then played for Hearts and Derry City.\n\nSTEVEN CAULKER\n\nCaulker joined the Swans in the summer of 2011 on a season long loan from Tottenham Hotspur. A central defender at the tender age of 19, he was loaned out to Bristol City in 2010, impressing so much that he won their Player of the Year award with some outstanding performances. His previous loan spell was with Yeovil Town in 2009-10, playing 46 games for the club and representing England in the Under-19 European Championships that same year. Caulker ended up having an exceptional season with the Swans, teaming up with Ashley Williams in the heart of the defence in the club’s inaugural Premier League season before returning to Spurs after 26 appearances. Capped by England at senior level in November 2012, Caulker signed for newly-promoted Cardiff at the start of the 2013-14 season.\n\nBERSANT CELINA\n\nKosovan midfielder Bersant Celina began his professional career at Manchester City, making four appearances before being loaned to Eredivisie side FC Twente and Championship side Ipswich Town. Celina joined the Jacks in the summer of 2018 on a four-year deal. Brought up in Norway, he represented Norway as a youth before switching to represent Kosovo in 2013. He appeared 77 times in all competitions for the Swans, scoring 10 goals in total including a goal against his former side Manchester City in the 2019 FA Cup quarter final.\n\nPAUL CHALMERS\n\nEx-Scotland Youth striker Paul Chalmers featured in Swansea City's 1991 Welsh Cup final triumph. The son of former Celtic legend Steve Chalmers, he signed professional for Celtic in October 1980 and had a loan spell with Bradford City before being sold to St Mirren for £20,000 in September 1986. He was twice leading marksman and was valued at £124,000 when he joined Swansea with John Hughes and Keith Walker in November 1989. Scoring 13 times in 58 League outings whilst at the Vetch Field, he joined Dunfermline Athletic in August 1992, then played for Hamilton Academicals, Ayr United and East Fife.\n\nLEE CHAPMAN\n\nFormer England U-21 striker Lee Chapman ended his playing career with Swansea City. The son of Roy Chapman, he began with Stoke City and was twice top scorer prior to joining Arsenal for £500,000 in August 1982. He moved to Sunderland in December 1983, then played for Sheffield Wednesday, Niort and Nottingham Forest before moving to Leeds United in January 1990. Top scorer in their 1991-92 League Championship success, he had spells with Portsmouth, West Ham and Ipswich prior to joining Swansea in March 1996, netting four goals in seven League games until retiring.\n\nLES CHAPPELL\n\nExperienced midfielder Les Chappell starred in Swansea City's 1977-78 promotion success. Signing professional for Rotherham United in February 1965, he was leading marksman in 1966-67 and moved to Blackburn Rovers for £20,000 plus Alan Gilliver in May 1968. He joined Reading in July 1969 and was top scorer three times, moving to Doncaster Rovers in December 1974. Harry Griffiths signed him in July 1976 and he netted five goals in 67 League games for Swansea before becoming youth team coach. He later managed Farnborough and Basingstoke, then coached Torquay.\n\nSHAUN CHAPPLE\n\nWelsh U-21 midfielder Shaun Chapple featured in Swansea City's 1994 Autoglass Trophy final triumph. Locally born, he turned professional at the Vetch Field in July 1991 and made his League debut in Swansea's 3-0 defeat at Fulham two months later. He also helped the Swans qualify for the promotion play-offs in 1992-93 and 1996-97, overcoming successive injury problems to score nine times in 106 League outings. Following loan spells with Barry Town and Merthyr Tydfil, he moved to Forest Green Rovers in December 1998 and then Carmarthen Town.\n\nJEREMY CHARLES\n\nVersatile Welsh international Jeremy Charles (below) starred in Swansea City's thrilling rise under John Toshack. The son of former Swansea favourite Mel Charles, he signed professional at the Vetch Field in January 1977 and featured in several Welsh Cup final triumphs. Scoring 53 goals in 247 League games, he moved to QPR in November 1983. He joined Oxford United in February 1985 and helped to secure top-flight status that season, then win the Milk Cup in 1986. After injury ended his career, he coached Oxford United, then was football development officer at Swansea and Southampton.\n\nMEL CHARLES\n\nVersatile Welsh international Mel Charles was capped 21 times while at Swansea. The younger brother of John Charles, he signed professional for Swansea in May 1952 and played in two Welsh Cup finals, helping Wales to reach the World Cup quarter-finals in 1958. He netted 66 goals in 233 League games for the Swans before joining Arsenal for £42,750 plus Dave Dodson and Peter Davies in March 1959. Moving to Cardiff City for £28,500 in February 1962, he later played for Portmadoc, Port Vale and Haverfordwest.\n\nCHICO FLORES\n\nChico joined the Swans in July 2012 for around £2m under manager Michael Laudrup who was also his boss at Mallorca. He made his debut for the club in the opening Premier League game of the 2012 season, an incredible 5-0 away win at QPR. A talented, ball-playing central defender, he was larger than life on and off the field during a stint in SA1 that included the League Cup triumph at Wembley in 2013. The fiormer Spanish Under-21 international eventually left the Liberty Stadium in 2014 after 58 league appearances to join Lekhwiya in Doha, again under Laudrup. From there he went on to play for Granada, Rubin Kazan and Fuenlabrada. Chico - full name Jose Manuel Flores Moreno - started his professional career with hometown club Cadiz, he went on to have spells with Portuense, Barcelona B, Almeria, Genoa and Mallorca before heading to South Wales.\n\nGIORGIO CHINAGLIA\n\nBustling centre-forward Giorgio Chinaglia was capped 14 times by Italy after leaving Swansea. The son of a Cardiff Italian restaurateur, he was an apprentice at the Vetch Field and made his League debut in Swansea's 0-0 draw at home to Portsmouth two months before turning professional in April 1965. He scored once in five Second Division games overall for the Swans prior to joining Italian side Massese in July 1966, moving via Inter Napoli to Lazio in July 1969 where he was top scorer in their 1973-74 Italian title triumph. Later starring as New York Cosmos won the NASL three times, he became Lazio's president.\n\nGARY CHIVERS\n\nVersatile defender Gary Chivers played for Swansea City during the 1983-84 campaign. Initially with Chelsea, he made his First Division debut in their 2-1 victory at home to Middlesbrough in April 1979 and featured in their 1981-82 FA Cup run. He moved to the Vetch Field in August 1983 and made ten Second Division appearances for Swansea before following Jeremy Charles to QPR in February 1984. He remained in the top-flight after joining Watford in September 1987, then helped Brighton clinch promotion that season. Later with Norwegian side Lyn, Bournemouth, Stamco and Worthing.\n\nCYRUS CHRISTIE\n\nChristie joined Swans on loan from Fulham in January 2022. The Republic of Ireland international mainly occupied an attack-minded wingback role in head coach Russell Martin’s side. He made 23 appearances, scored three goals and contributed with four assists.\n\nKEVIN CLARKE\n\nRepublic of Ireland international wing-half Kevin Clarke was a member of Swansea's 1948-49 Third Division (South) title squad. He represented the League of Ireland and was capped twice with Drumcondra before joining the strong Irish contingent at the Vetch Field in November 1948. Unable to secure a regular first-team slot behind the likes of Rory Keane, Jack O'Driscoll and Roy Paul, he helped Swansea win the London Combination Cup in 1949-50 and Welsh League title in 1950-51, making ten League appearances for the Swans before being released in May 1952.\n\nMARK CLODE\n\nVersatile left-back Mark Clode was an influential figure in Swansea City's 1994 Autoglass Trophy final triumph. Signing professional for Plymouth Argyle in March 1991, he failed to secure a first-team slot and moved to the Vetch Field in July 1993. He made his League debut in Swansea's 2-1 defeat at York City the following month and helped reach the Third Division play-off final in 1996-97, scoring three times in 119 League outings for the Swans before losing his place to Michael Howard after a series of injury problems. Moving to Bath City in July 1999, he later played for Clevedon Town.\n\nSAM CLUCAS\n\nA product of the Leicester City academy, midfielder Sam Clucas signed a four-year contract with Swansea City after a two-year spell with Hull City. Clucas found the back of the net three times for the Jacks all of which came against Arsenal. Towards the end of the season, he suffered a knee injury which ended his time in SA1. He join Stoke City in the summer of 2018.\n\nJONATHAN COATES\n\nWelsh U-21 winger Jonathan Coates featured in Swansea City's 1999-2000 Third Division title triumph. The younger brother of Marc Coates, he turned professional at the Vetch Field in July 1993 and appeared for the Swans in the 1996-97 Third Division play-off final. He also helped Swansea qualify for the Third Division play-offs in 1998-99, moving to Cheltenham Town in October 2002. After a spell with Woking, he re-joined Swansea in March 2003 and netted 23 goals in 278 League games overall prior to joining Newport County in August 2004. He then played for Aberystwyth and Pontardawe Town. Still lives locally.\n\nGARY COBB\n\nAttacking midfielder Gary Cobb had a loan spell at Swansea City during the 1989-90 campaign. Signing professional for hometown Luton in August 1986, he had limited opportunities in the top-flight and was loaned to Swansea in August 1989. He played at Panathinaikos in the ECWC and made five Third Division appearances whilst at the Vetch Field. Moving to Fulham in August 1990, he joined Chesham United in September 1992 and helped win the Diadora League title that season. He later played for Aylesbury, St Albans, Chertsey, Bedford and Berkhamsted, also working for Chelsea's football in the community scheme.\n\nDAVE COLE\n\nTall central defender Dave Cole played for Swansea City during the 1984-85 season. A former Sunderland apprentice, he signed professional in October 1983 and moved to the Vetch Field on a non-contract basis in September 1984. He made eight Third Division appearances for Swansea prior to joining Swindon Town in February 1985, helping win the Fourth Division title in 1985-86. Moving to Torquay United in November 1986, he appeared against Swansea in the 1987-88 Fourth Division play-off final, then starred in Rochdale's 1989-90 FA Cup run before playing for Exeter City, Merthyr Tydfil, Newport AFC and Cinderford Town.\n\nCHRIS COLEMAN\n\nBrilliant left-back Chris Coleman was capped 31 times by Wales after leaving Swansea City. A former Manchester City junior, he moved to the Vetch Field in August 1987 and starred as Swansea won promotion in 1987-88. He was twice a Welsh Cup winner and ever-present in 1989-90, scoring twice in 160 League games prior to joining Crystal Palace for £275,000 in July 1991. Helping them win the First Division title in 1993-94, he moved to Blackburn Rovers for £2,800,000 in December 1995, then Fulham for £2,100,000 two years later. His career was ended by a car accident and he went on to manage Fulham and the Wales national team.\n\nMATTY COLLINS\n\nCollins was a Wales Under-21 full-back who started his career at Swindon Town before moving to Fulham. After being released by the Premier League side he signed on loan with Wrexham before making his way to the Liberty in May 2008. A highly-rated competitive defensive midfielder or full-back, he suffered his fair share of injuries in his career and was released from the club in 2010 after six appearances (one as sub). He has subsequently made his home back in Wales, playing for Haverfordwest, Neath, Carmarthen and Aberystwyth.\n\nTERRY COLLINS\n\nInside-forward Terry Collins briefly played for Swansea during the 1967-68 campaign. A former Swansea junior, he joined Barry Town in July 1961 and helped them win the South Wales Senior Cup on his debut. He moved to Hereford United in July 1964 and was a promotion winner in 1964-65, then had spells with Haverfordwest and Ton Pentre before re-joining Swansea in March 1967. His only League appearance was in the following month's 1-0 win at home to Aldershot and he returned to Haverfordwest in July 1968. He later played for Merthyr Tydfil and managed Abercynon.\n\nLEN COMLEY\n\nVersatile forward Len Comley featured in Swansea's first post-war League match against West Brom in August 1946. Locally born, he progressed through the ranks at the Vetch Field and scored Swansea's winner in the 1947 Football Combination Cup final. He netted seven goals in 28 Third Division (South) games prior to joining Milford United in August 1948. Moving to Newport County two months later, he starred in their 1948-49 FA Cup run, then played for Scunthorpe United, Carmarthen Town, Llanelly and Aberystwyth.\n\nKARL CONNOLLY\n\nExperienced midfielder Karl Connolly was plagued by injury problems while at Swansea City. He played local football in Warrington prior to joining Wrexham in May 1991 and helped them beat Arsenal in the 1991-92 FA Cup third round, then win promotion the following season and the Welsh Cup in 1995. Also starring in their 1996-97 FA Cup run, he joined QPR in May 2000 and reunited with Brian Flynn at Swansea in August 2003. He suffered an ankle injury in the 2-0 win at Huddersfield that put Swansea top of the table and scored once in ten League games before joining hometown Prescot Cables in June 2004.\n\nPAUL CONNOR\n\nHard-working striker Paul Connor was an influential figure in Swansea City's 2004-05 promotion success. Signing professional for Middlesbrough in July 1996, he was loaned to Hartlepool before joining Stoke City in March 1999. He was a member of their 2000 Auto Windscreens Shield winning squad and moved to Rochdale for £100,000 in March 2001. Helping them qualify for the Third Division play-offs in 2001-02, he joined Swansea for £35,000 in March 2004. He played alongside Lee Trundle and netted 16 goals in 65 League games before joining Leyton Orient for £40,000 in January 2006, helping them win promotion.\n\nTERRY CONNOR\n\nFormer England U-21 striker Terry Connor featured in Swansea City's 1991 Welsh Cup final triumph. Initially with Leeds United, he scored on his First Division debut and was swapped for Brighton's Andy Ritchie in March 1983. He was leading marksman four times prior to joining Portsmouth for £200,000 in June 1987. Terry Yorath paid £200,000 for him in August 1990 and netted six goals in 39 League outings for Swansea before being sold to Bristol City for a similar fee in September 1991, re-joining Swansea on loan in November 1992. He then played for Yeovil Town, since coaching at both Bristol clubs and Wolves, who he also managed.\n\nMICKY CONWAY\n\nExciting winger Micky Conway featured in Swansea City's 1977-78 promotion success. A former Brighton apprentice, he was their youngest League debutant when he scored in the 2-2 draw at home to Nottingham Forest in April 1973. He moved to the Vetch Field for £3,000 in December 1975 and became a favourite with his pace and sparkling control on the left wing. Scoring 11 goals in 61 League outings for Swansea, he was badly injured in a car crash in April 1978 and forced to retire from the professional game. He had a testimonial match between Swansea and Brighton in May 1979.\n\nANDY COOK\n\nAttacking left-back Andy Cook helped Swansea City reach the 1994 Autoglass Trophy final but missed the Wembley triumph through injury. Signing professional for Southampton in July 1987, he had limited top-flight opportunities behind Derek Statham prior to joining Exeter City for £50,000 in September 1991. He moved to the Vetch Field for £125,000 in July 1993 and overcame a broken leg to make 61 League appearances for Swansea before joining Portsmouth for £35,000 in December 1996. Sold to Millwall for £50,000 in January 1998, he later played for Salisbury.\n\nANTONIO CORBISIERO\n\nYoung midfielder Antonio Corbisiero briefly played for Swansea City during the 2003-04 campaign. A former Swansea scholar, he captained the youth team to success in the 2003 Welsh Youth Cup final and also featured in that year's West Wales Senior Cup final triumph. He made his League debut as a substitute in the 4-1 victory at home to Mansfield Town in August 2003 that put Swansea top of the Third Division. His first start was in that season's 3-2 defeat at home to Hull City and he played five League games, signing professional for Swansea in July 2004. He moved to Newport County in July 2005 after two loan spells. Also played for Llanelli.\n\nJOHN CORNFORTH\n\nWelsh international midfielder John Cornforth skippered Swansea City's 1994 Autoglass Trophy final triumph. Signing professional for Sunderland in October 1985, he featured in their rise to the top-flight under Denis Smith and joined Swansea for £50,000 in August 1991. He helped qualify for the Second Division play-offs in 1992-93 and netted 16 goals in 149 League outings before being sold to Birmingham City for £350,000 in March 1996. After a spell with Wycombe Wanderers, he reunited with Frank Burrows at Cardiff City in August 1999 and had spells as player-boss of Exeter City and Newport County.\n\nDAVID COTTERILL\n\nA full Welsh international, he joined the Swans after a loan spell from Sheffield United for a then record fee of £600,000 in November 2009. He began his career with Bristol City as a trainee before a £2m move to Wigan Athletic. In two seasons at the DW Stadium he featured in 18 league games and by February 2008 he found himself on loan at Sheffield United - signing a permanent deal the following July. After the Swans won promotion in 2011, Cotterill didn't make a Premier League appearance for the club and was eventually released after 38 appearances (11 as sub) and one goal to join Portsmouth, Barnsley and then Doncaster.\n\nTONY COTTEY\n\nWelsh Youth midfielder Tony Cottey briefly appeared for Swansea City during the 1984-85 campaign. Locally born, he was an apprentice at the Vetch Field and signed professional in June 1984. He made his League debut in Swansea's 3-1 defeat at home to York City three months later and played two further Third Division games that season, at home to Rotherham United and Bristol Rovers, before being released by John Bond in May 1985. He later played for Merthyr Tydfil but cricket became his priority and he achieved success with Glamorgan and Sussex.\n\nTERRY COTTON\n\nFormer Welsh Amateur international Terry Cotton was a member of Swansea's 1969-70 promotion squad. Initially with Llanelli, he was a prolific scorer for Ammanford Town in the Welsh League before signing professional for Swansea in June 1968. His solitary goal in 12 League outings came in Swansea's 4-1 defeat at Fulham in August 1970 and he joined Yeovil Town in July 1971. He was top scorer in 1971-72 and featured in three Southern League Cup finals during two spells with the Glovers, also playing for Salisbury, Taunton and Bridport.\n\nDENIS COUGHLIN\n\nVersatile centre-forward Denis Coughlin featured in Swansea's 1966-67 relegation battle. Signing professional for Barnsley in October 1957, he played for Yeovil Town prior to joining Bournemouth in March 1963. He was twice leading marksman and joined Swansea in exchange for Ken Pound in August 1966, scoring ten goals in 40 League outings before moving to Chelmsford City in July 1968. Later with King's Lynn, Bedford Town and South Shields.\n\nRUSSELL COUGHLIN\n\nFormer Welsh Youth midfielder Russell Coughlin starred in Swansea City's 1991 Welsh Cup final triumph. Starting with Manchester City, he was a promotion winner with Blackburn Rovers in 1979-80, Carlisle United in 1981-82 and Plymouth Argyle in 1985-86. He moved via Blackpool to Swansea for £30,000 in October 1990 and starred as the Swans qualified for the Second Division play-offs in 1992-93, scoring twice in 101 League games before swapped for Exeter City's John Hodge in July 1993. Joining Torquay United in October 1995, he later played for Dorchester Town and Gretna.\n\nTOMMY CRAIG\n\nFormer Scotland international winger Tommy Craig was an experienced figure as Swansea City won promotion and the Welsh Cup in 1980-81. Initially with Aberdeen, he was sold to Sheffield Wednesday for £100,000 in May 1969 and moved to Newcastle United for a similar fee in December 1974. He was a League Cup finalist in 1976 and joined Aston Villa for £275,000 in January 1978, moving to the Vetch Field for £150,000 in July 1979. Scoring nine times in 52 League outings for Swansea, he joined Carlisle United in March 1982. He later played for Hibernian, since coaching at Celtic, Aberdeen and Newcastle.\n\nIAN CRANEY\n\nThe midfielder signed on loan in November 2006 from Accrington before making the move permanent in January 2007. He had moved from Altrincham to Accrington in the summer of 2004 and was the star performer in a club that regained its league status after over 40 years in non-league. While at Accrington, his performances earned him a place in the England non-league international team, and secured him the Conference and Non-League Player of the Year awards. A leader on the field and a regular goalscorer from midfield for Accrington, he found it difficult at the Liberty to secure a place in the starting line-up and after only one season returned to his former club on a free transfer after 39 appearances (11 as sub).\n\nCOLIN CROTTY\n\nWelsh Youth striker Colin Crotty briefly played for Swansea during the 1968-69 campaign. He progressed through the ranks at the Vetch Field and signed professional in August 1968. A consistent goalscorer in the reserves, he scored on his League debut in Swansea's 2-0 victory at York City in May 1969. He also made a substitute appearance in the next Third Division game at home to Exeter City, replacing Denley Morgan, and moved to Barry Town in July 1969. Joining Merthyr Tydfil in July 1970, he subsequently played in local football for Hills Plymouth.\n\nGEOFF CRUDGINGTON\n\nEx-England Schoolboy goalkeeper Geoff Crudgington was ever-present in Swansea City's 1978-79 promotion success. A former Wolves junior, he joined Aston Villa in September 1969 and moved to Crewe Alexandra initially on loan in March 1972. He was ever-present on four occasions and joined Swansea for £30,000 in July 1978, making 52 League appearances before being sold to Plymouth Argyle for £45,000 in October 1979 after the arrival of Glan Letheran. Ever-present as Plymouth reached the FA Cup semi-finals in 1983-84 and won promotion in 1985-86.\n\nTONY CULLEN\n\nWinger Tony Cullen made a significant contribution as Swansea City qualified for the Second Division play-offs in 1992-93. A former Newcastle United trainee, he joined Sunderland in September 1988 and featured in their 1989-90 promotion campaign. He was loaned to Carlisle, Rotherham and Bury before joining Swansea in August 1992, scoring three times in 27 League outings while at the Vetch Field. Returning to his native North East with Gateshead in August 1993, he later played for Seaham Red Star, Tow Law Town and Jarrow Roofing.\n\nREG CUNLIFFE\n\nVersatile left-back Reg Cunliffe featured in Swansea's 1947 London Combination Cup final triumph. Initially a Manchester City junior, he joined hometown Wigan Athletic in September 1945 and impressed in the Cheshire League before moving to the Vetch Field in May 1946. He made his League debut in Swansea's 1-1 draw at Manchester City five months later and also appeared in the 2-2 draw at Bristol Rovers in September 1947. After a spell playing in attack for the reserves, he returned to Wigan in July 1948 but injury ended his playing career soon afterwards. He died in Fleetwood in August 2000.\n\nALAN CURTIS\n\nWelsh international striker Alan Curtis was an influential figure in Swansea City's thrilling rise under John Toshack. Signing professional at the Vetch Field in July 1972, he was leading marksman in Swansea's 1977-78 promotion success and moved to Leeds United for £350,000 in June 1979. He re-joined Swansea in December 1980 and featured in consecutive Welsh Cup final triumphs, joining Southampton in November 1983. Later with Stoke City, Cardiff City, Swansea again, Barry Town and Haverfordwest, he has since served Swansea in various capacities including caretaker manager, assistant-manager, head of youth development and first team coach.\n\nNICK CUSACK\n\nExperienced midfielder Nick Cusack captained Swansea City's 1999-2000 Third Division title triumph. He played for Long Eaton and Alvechurch prior to joining Leicester City in June 1987, then had a spell with Peterborough United before moving to Motherwell for £100,000 in August 1989. Joining Darlington for £95,000 in January 1992, he moved via Oxford United to Fulham in November 1994 and was a promotion winner in 1996-97. He joined Swansea for £50,000 in October 1997 and had a spell as player-manager, netting 13 goals in 198 League games before leaving in September 2002. He has since worked for the PFA.\n\nNEIL CUTLER\n\nEx-England Youth goalkeeper Neil Cutler had a loan spell at Swansea City during the 2002-03 campaign. Signing professional for West Brom in September 1993, he had spells with Chester and Crewe Alexandra before re-joining Chester in July 1998. He moved to Aston Villa as cover in November 1999 and briefly appeared in the Premiership, joining Stoke City in July 2001. Starring in their 2001-02 Second Division play-off final triumph, he was loaned to Swansea in February 2003 and made 13 League appearances while at the Vetch Field. He joined Stockport County in July 2004, moving to Rotherham United in August 2005.\n\nD\n\nNIGEL DALLING\n\nWinger Nigel Dalling remains the youngest player to appear in the Football League for Swansea City. Locally born, he was 15 years 289 days old when he came on as substitute in Swansea's 2-2 draw at home to Southport in December 1974. He helped the reserves win the Welsh League First Division title in 1975-76 and featured in Swansea's 1977-78 promotion campaign, making eight League appearances before joining Bridgend Town in January 1978. Later playing for Ammanford, Llanelli, Afan Lido, Ragged School and Port Tennant Colts.\n\nRAY DANIEL\n\nWelsh international centre-half Ray Daniel ended his League career with hometown Swansea. Initially a Swansea amateur, he signed professional for Arsenal in October 1946. He played in the 1952 FA Cup final and was a key figure in the Gunners' 1952-53 League Championship success, moving to Sunderland for £27,500 in June 1953. Following a spell with Cardiff City, he joined Swansea in March 1958 and netted seven goals in 44 League outings prior to joining Hereford United in July 1960. He became their player-boss, then worked in the licensed trade and was a sub-postmaster in Swansea. He died in November 1997.\n\nDAVID D'AURIA\n\nWelsh Youth midfielder David D'Auria was a young member of Swansea City's 1987-88 promotion squad. Locally born, he signed professional for Swansea in July 1988 and regularly featured as a substitute, netting six goals in 45 League outings prior to joining Merthyr Tydfil in July 1991. He moved to Barry Town in August 1993 and scored in their 1994 Welsh Cup final triumph, joining Scarborough in August 1994. Sold to Scunthorpe United for £40,000 in December 1995, he moved via Hull City to Chesterfield for £50,000 in November 1999. Later with Newport, Llanelli, Skewen and Neath.\n\nSIMON DAVEY\n\nYoung midfielder Simon Davey was a member of Swansea City's 1991 Welsh Cup winning squad. Locally born, he made his League debut as a 16 year-old in Swansea's 1-0 defeat at home to Torquay in April 1987 and turned professional in July 1989. He netted four goals in 49 League outings for Swansea prior to joining Carlisle United in August 1992. Featuring in their 1994-95 Third Division title campaign, he moved to Preston for £125,000 in February 1995 and helped win the Third Division title in 1995-96. His playing career was ended by a recurring back injury at the age of 28 and he became Preston's youth team manager. Went on to manage Barnsley, Darlington and Hereford.\n\nNEIL DAVIDS\n\nEx-England Youth central defender Nigel Davids featured in Swansea City's 1977-78 promotion campaign. Signing professional for Leeds United in August 1973, he joined Norwich City in April 1975 and had loan spells at Northampton Town and Stockport County prior to joining Swansea in July 1977. He made nine League appearances while at the Vetch Field before moving to Wigan Athletic in July 1978, playing in their first-ever League match.\n\nALAN DAVIES\n\nWelsh international midfielder Alan Davies was an important figure in Swansea City's 1987-88 promotion success. Signing professional for Manchester United in December 1978, he featured in their 1983 FA Cup final triumph but suffered a broken ankle and moved to Newcastle United for £50,000 in July 1985. He was loaned to Charlton and Carlisle prior to joining Swansea in August 1987. Reuniting with Terry Yorath at Bradford City for £130,000 in June 1989, he followed him back to Swansea in exchange for Robbie James in August 1990. He netted 12 goals in 127 League games overall until his tragic death in February 1992.\n\nALEX DAVIES\n\nWelsh U-18 goalkeeper Alex Davies briefly played for Swansea City during the 2000-01 season. Locally born, he was a second year trainee at the Vetch Field when he came on as substitute for Jason Jones in Swansea's 3-0 defeat at Bury in March 2001. He immediately saved a penalty but the referee ordered a retake from which Bury scored. Playing in Swansea's youth team for the remainder of that season, he moved to Port Talbot in July 2001, then had a three month spell with Rushden & Diamonds and has since played for Pontardawe, Garden Village, Carmarthen, Llanelli, West End and in local football for St Josephs.\n\nDAI DAVIES\n\nWelsh international goalkeeper Dai Davies starred as Swansea City finished sixth in the top-flight in 1981-82. Initially with Ammanford, he joined Swansea in July 1969 and moved to Everton in December 1970. He was loaned to Swansea in February 1974, joining Wrexham for £8,000 in September 1977. Starring in their 1977-78 Third Division title and Welsh Cup 'double' triumph, he returned to Swansea for £45,000 in July 1981 and helped win the Welsh Cup in 1982. He played 86 League games before joining Tranmere Rovers in June 1983.\n\nDAI DAVIES\n\nWelsh Youth central defender Dai Davies played alongside Dave Bruton while at Swansea City. He graduated through the ranks at the Vetch Field and turned professional in July 1973, making his League debut in Swansea's 2-0 victory at home to Barnsley three months later. Playing 22 consecutive Fourth Division games that season, he had limited first-team chances thereafter and made 28 League appearances for Swansea before joining Afan Lido in July 1975. He later played for Maesteg Park and Port Talbot.\n\nDAI DAVIES\n\nMidfielder Dai Davies made his solitary League appearance for Swansea City as a 16 year-old substitute in the 2-0 defeat at AFC Bournemouth in April 1973. A former apprentice at the Vetch Field, he turned professional for Swansea in July 1974 and reunited with Harry Gregg at Crewe Alexandra in March 1975. Helping them beat Chelsea in the 1975-76 League Cup second round, he featured in the 1977 Cheshire Premier Cup final and made over 200 League appearances for the Alex until leaving Gresty Road in May 1981. He also had a spell playing football in Hong Kong.\n\nGLENNIE DAVIES\n\nVersatile central defender Glen Davies scored twice in Swansea City's 1975 West Wales Senior Cup final triumph. Locally born, he turned professional at the Vetch Field in July 1970 and made his League debut in Swansea's 2-1 defeat at home to Aston Villa the following month. He netted 13 goals in 145 League games for Swansea prior to joining Everwarm (Bridgend Town) in May 1976. Subsequently playing for Afan Lido, Maesteg, Milford United, Llanelli, Ragged School and West End while working for the Post Office, he is currently part the coaching staff at Swansea City's Youth Academy and still lives locally.\n\nGLYN DAVIES\n\nFormer Welsh Schoolboy left-back Glyn Davies played for Swansea during the 1962-63 season. Signing professional for Derby County in July 1949, he helped them win the Third Division (North) title in 1956-57 and joined hometown Swansea in July 1962. His solitary goal in 18 Second Division games came in the Swans' 2-0 victory at Derby in March 1963 and he joined Yeovil Town in May 1963, becoming their player-boss. He re-joined Swansea as manager between June 1965 and October 1966, then was Pembroke Borough's player-coach. Later with Oswestry Town.\n\nIAN DAVIES\n\nFormer Welsh U-21 left-back Ian Davies played under John Bond for the third time in his career while at Swansea City. He was Norwich City's youngest-ever League debutant at 17 years 29 days old in April 1974 but had limited top-flight opportunities and joined Newcastle United for £150,000 in June 1979. Reuniting with John Bond at Manchester City in August 1982, he had spells with Bury, Brentford, Cambridge United, Carlisle United, Exeter City and Bristol Rovers prior to joining Swansea in November 1985. He made 11 League appearances until suffering a broken leg.\n\nJAMIE DAVIES\n\nTeenage striker Jamie Davies briefly played for Swansea City during the 1998-99 campaign. Locally born, he was a trainee at the Vetch Field and signed professional for Swansea in July 1998, making his solitary League appearance as a substitute for Aidan Newhouse in the Swans' 1-1 draw at home to Carlisle United seven months later. He was loaned to Bangor City and Llanelli before returning to Llanelli in August 2001 but suffered an injury and briefly moved to Garden Village in March 2002. Since then he has played for Carmarthen Town, Pontardawe and Garden Village.\n\nLYN DAVIES\n\nWelsh U-23 goalkeeper Lyn Davies understudied Tony Millington while at Swansea City. A former Cardiff City apprentice, he signed professional in October 1965 and was a League Cup semi-finalist that season. He followed John Charles to Hereford United in August 1968, moving to Llanelli in October 1969 and featuring in their 1970-71 Welsh League title triumph. Roy Bentley signed him in July 1972 and he made three League appearances for struggling Swansea prior to joining BP Llandarcy in August 1973.\n\nMARK DAVIES\n\nTeenage defender Mark Davies briefly appeared for SwanseaCity during the 1991-92 campaign. Locally born, he was a trainee at the Vetch Field and a member of the West Wales Senior Cup winning squad shortly before signing professional in July 1991. He made his debut against Monaco in the ECWC first round first-leg two months later, also featuring in the second-leg that the Swans lost 8-0. His solitary League appearance was in Swansea's 1-0 defeat at home to Huddersfield and he joined Merthyr Tydfil in August 1992 but had to give up football because of a medical condition, briefly resuming with Llanelli.\n\nPETER DAVIES\n\nWing-half Peter Davies featured in Swansea's 1961 Welsh Cup final success. He impressed with Llanelli prior to joining Arsenal for £5,000 in November 1957 but failed to secure a first-team slot at Highbury and moved to Swansea as part of the Mel Charles deal in March 1959. Scoring five goals in 134 League games while at the Vetch Field, he joined Brighton in July 1965, then reunited with Harry Griffiths at Merthyr Tydfil in January 1966. He later played for South African side Germiston Callies, then Ammanford.\n\nREG DAVIES\n\nFormer Welsh international inside-forward Reg Davies helped Swansea win the Welsh Cup in 1961. Initially with Southampton, he joined Southend United in July 1949 and scored on his League debut in their 2-0 win over Notts County five months later. He moved to Newcastle United for £9,000 in April 1951 and was unlucky to miss their 1955 FA Cup final success with tonsillitis. Joining Swansea as part of the Ivor Allchurch deal in October 1958, he netted 29 goals in 111 League games before moving to Carlisle United in June 1962, then appeared for Merthyr and was King's Lynn player-manager. He emigrated to Australia.\n\nRONNIE DAVIES\n\nLocal born left-half Ronnie Davies briefly appeared for Swansea during the 1958-59 season. He played for Tower United in the Swansea League before moving to the Vetch Field in May 1958 and was given his League debut in place of Mal Kennedy in Swansea's 1-0 victory at home to Stoke City in February 1959. Also featuring in the next match at Charlton Athletic, he was sold to Plymouth Argyle for £2,000 in June 1959 but failed to secure a first-team slot and joined Haverfordwest in July 1960. He later played for Ton Pentre, Llanelli and local side West End.\n\nJOE DAVIS\n\nExperienced defender Joe Davis was a Billy Lucas signing for Swansea. Initially with Soundwell, he joined Bristol Rovers in March 1956 and made his League debut in their 4-1 victory at home to Luton Town in February 1961. He was Rovers' first-ever substitute against Walsall in October 1965 and had a spell as captain before moving to Swansea for £1,000 in March 1967. Featuring in the 1967-68 FA Cup fourth round tie at home to Arsenal, he made 36 League appearances before a knee injury ended his career, then was a coach and scout back at Bristol Rovers.\n\nROBBIE DENNISON\n\nFormer Northern Ireland international winger Robbie Dennison had a loan spell at Swansea City during the 1995-96 season. Initially with Glenavon, he joined West Brom for £40,000 in September 1985 and moved to Wolves for £20,000 in March 1987. He scored in their 1988 Sherpa Van Trophy final triumph, starring as they won the Fourth Division title and Third Division title in consecutive years. Loaned to Swansea in October 1995, he made nine League appearances while at the Vetch Field. He joined Hednesford in July 1997, then played for Hereford United and Warley Borough.\n\nJONATHAN DE GUZMAN\n\nThe Canadian-born Dutch international midfielder joined the Swans on loan from Villarreal in 2012, having previously worked under Michael Laudrup at Mallorca. His time at the Liberty was a great success and he scored a number of stunning goals, including a brace at Wembley in the League Cup final win, plus a call up to the Dutch national team. But after two loan seasons at the club, he moved to Napoli. He currently plays for German side Eintract Frankfurt. He was a part of the Dutch squad for the 2014 World Cup in Brazil.\n\nDORUS DE VRIES\n\nDorus began his career in his native Holland with Telstar before joining ADO Den Haag. After a successful time with the club he moved to Scotland, signing for Dunfermline Athletic where he played in the Scottish Cup final against Celtic alongside another future Swan, Jason Scotland. His contract ended in the summer of 2007 and he opted to join Swansea alongside another former team-mate, Ferrie Bodde. In his first season at the club he helped the Swans gain promotion from League One and in the club’s first season back in the Championship he kept a club-record 22 clean sheets, winning the Football League’s Golden Glove award in the process. The following season saw Dorus play in the victorious Wembley win over Reading to reach the Premier League for the first time, but the goalkeeper surprisingly opted to sign for fellow top-flight side Wolves instead after 203 appearances. Dorus then signed for Nottingham Forest.\n\nLEIGH DEVULGT\n\nWelsh U-21 defender Leigh Devulgt was a fringe member of Swansea City's 1999-2000 Third Division title squad. Locally born, he was a trainee at the Vetch Field and signed professional in July 1999, making his League debut in Swansea's 1-0 victory at Leyton Orient five months later. He made his Welsh U-21 debut against Armenia in August 2001 but failed to secure a regular first-team slot with Swansea and had loan spells at Merthyr Tydfil and Llanelli to gain match practice. Making 23 League appearances for the Swans before moving to Carmarthen Town in January 2003, he has also played for Port Talbot.\n\nJOHN DEWSBURY\n\nYoung full-back John Dewsbury briefly played alongside Gilbert Beech in Swansea's defence. Locally born, he progressed through the ranks at the Vetch Field and turned professional in April 1950. He made his League debut in Swansea's 2-2 draw at home to Everton in October 1952 and played nine consecutive Second Division games in place of Steve Leavy. Helping the Swans win the West Wales Senior Cup in 1954, he followed Billy Lucas to Newport County in August 1955 and later played for Milford United.\n\nYAN DHANDA\n\nDudley-born Dhanda joined Swansea on a free transfer in May 2018 signing a four year deal. He enjoyed a memorable senior debut scoring the winning goal against Sheffield United just 29 seconds after being introduced off the bench on the opening day of the season. He made a further five first team appearances during that campaign. In his four years at the club, he made a total of 63 appearances and scored four goals. He left the club at the conclusion of his deal in July 2022.\n\nSTEPHEN DOBBIE\n\nThe Glasgow-born striker began his career at Scottish giants Rangers, but after finding his playing time restricted he moved to Hibernian, before joining St Johnstone and then Queen of the South. After impressing north of the border, Dobbie joined Swansea on a free transfer in the summer of 2009 under the guidance of Paulo Sousa. He had excellent technique and a wonderful football brain, impressing the most during the 2010-11 season. He scored the third goal in that memorable play-off final win over Reading at Wembley and featured for the Swans in their opening Premier League clash against Manchester City the following August. After a loan spell back at former club Blackpool, Dobbie was reunited with Ian Holloway at Crystal Palace, helping the Eagles reach the top flight before loan spells at Blackpool. He made 62 appearances (31 as sub) for the Swans with 17 goals.\n\nTOMMY DODDS\n\nVersatile inside-forward Tommy Dodds appeared for Swansea during the early post-war era. Initially with Hebburn St Cuthberts, he moved via North Shields to Aston Villa in January 1939 and featured in their first post-war League match against Middlesbrough in August 1946. He joined Swansea as part of the Trevor Ford deal in January 1947 and scored twice in 11 League outings while at the Vetch Field before returning to North Shields in August 1948. Moving to Barry Town in January 1949, he then played for Hereford United and settled back in his native North-East, residing in South Shields until his death in April 1998.\n\nDAVE DODSON\n\nEx-England Youth winger Dave Dodson scored in Swansea's 1960 West Wales Senior Cup final success. Signing professional for Arsenal in November 1957, he failed to secure a first-team slot at Highbury and joined Swansea in July 1959. He made his League debut in the following month's 2-1 victory at home to Lincoln City and netted 11 goals in 30 Second Division games before being sold to Portsmouth for £4,000 in December 1961. Helping them clinch the Third Division title that season, he joined Aldershot in January 1965, then played for Hereford, Guildford, Andover and Fleet.\n\nPETER DONNELLY\n\nInside-forward Peter Donnelly played for Swansea during the 1961-62 campaign. Signing professional for Doncaster Rovers in March 1954, he scored on his League debut the following month. He moved to Scunthorpe United in July 1958 and was leading marksman in 1959-60, joining Cardiff City in exchange for Joe Bonson in June 1960. Trevor Morris paid £6,500 for him in October 1961 and he netted three goals in 16 Second Division games for Swansea before being sold to Brighton for £7,000 in July 1962. He topped their goalscoring charts in 1962-63 and later played for Bradford City, Margate and Canterbury City.\n\nSCOTT DONNELLY\n\nA strong, forceful midfielder who began his career at QPR before moving to Aldershot Town in the hope of finding first-team football. Scott was a regular goalscorer from midfield for the Shots, earning himself a move to the Liberty in June 2010. However, the competition for places was evidently intense under Brendan Rodgers and after 18 months at the club he had made just one substitute appearance in the league and one start in the cup. After a loan spell at Wycombe, Donnelly moved to the club on a permanent basis, before spells at Aldershot, Southend and Newport County. He featured for County at Wembley in their victorious Conference play-off win over Wrexham before joining Farnborough and Havant.\n\nFRANK DONOVAN\n\nEx-Welsh Amateur international outside-right Frank Donovan played for Swansea during the 1950-51 season. He developed with Milford United and Haverfordwest, then skippered Pembroke Borough to promotion in 1947-48 and was selected for the 1948 Great Britain Olympic squad. Moving to the Vetch Field in May 1950, he scored twice in 15 Second Division games for Swansea prior to re-joining Pembroke in July 1951. He helped them win the Welsh League 'double' in 1953-54, then managed Pembroke and Milford United. An electrician at Pembroke Docks, he also had a sports shop and died in April 2003.\n\nCRAIG DRAPER\n\nYoung midfielder Craig Draper featured in Swansea City's 2002 West Wales Senior Cup final triumph. Locally born, he was a trainee at the Vetch Field and signed professional in July 2001. He made his League debut in Swansea's 1-0 defeat at home to Rochdale three months later and also appeared as a substitute in the 2-2 draw against Torquay on the final day of the 2001-02 season. Reuniting with former Swans coach Peter Nicholas at Llanelli in July 2002, he joined his local side Winch Wen soon afterwards but was then sidelined by a serious knee injury. He revived his career with Garden Village before re-joining Winch Wen.\n\nDEREK DRAPER\n\nWelsh U-23 inside-forward Derek Draper was an influential figure in Swansea's 1963-64 FA Cup run. Locally born, he turned professional at the Vetch Field in May 1962 and netted ten goals in 61 League games for Swansea before being sold to Derby County for £5,000 in April 1966. He joined Bradford PA in September 1967 and moved to Chester in January 1969. Leading marksman in 1972-73, he starred as they won promotion and were League Cup semi-finalists in 1974-75.\n\nDARYL DUFFY\n\nThe Scotland Under-21 international arrived in English football from Falkirk in January 2006, signing for Hull City after netting 27 goals in 65 starts north of the border. Duffy signed on loan for the Swans from Hull in February 2007 season, scoring five goals in five starts. This form prompted boss Roberto Martinez to make Duffy’s move permanent, with the striker going on to help the club win promotion from League One in 2008 before joining Bristol Rovers, Cheltenham and Salgaocar in Goa after 40 appearances (18 as sub) and seven goals.\n\nRICHARD DUFFY\n\nTeenage defender Richard Duff"}, {"url": "https://www.sportsbroadcastjournal.com/bill-brown-after-30-years-with-the-astros-i-thought-it-was-time-before-fans-get-critical/", "page_content": "Not many non ex ballplayers start their broadcast careers right in the big leagues. Bill Brown did and spent 30 fulltime seasons with the Houston Astros after seven years working Cincinnati Reds TV .\n\nAmong the microphone men in major league parks today, most folks paid their minor league dues, some for a shorter time and others longer. They include Marty Brennaman, Ken Korach, John Rooney, Tom McCarthy, Dave Van Horne, Terry Smith, Andy Freed, Rick Rizzs, Joe Davis, Dave Femming and Matt Hicks. Brown’s circumstances didn’t permit it.\n\nIf we examined the entire roster of MLB announcers, we would see lots more who did the bus grind in either or both the top and lower minors. Those who didn’t will likely admit that the learning curve was littered with unevenness or rust.\n\nBallplayers are exceptions. Their early work might be choppy, yet they bring a depth of knowledge that generally surpasses the professionally trained broadcaster. The best to transition from the field to the play-by-play booth include Don Drysdale, Ernie Johnson Sr., Rick Monday, Mike Shannon, Buddy Blattner, Phil Rizzuto, Geogre Kell, Bob Uecker, Mike Krukow, Herb Score and Duane Kuiper. If we looked under the hood, we would likely identify more.\n\nDuring his young adulthood, years when others were in the minors honing their play-by-play skills, Bill Brown was in Vietnam. A communications major at Missouri, he did play-by-play for the school station. But after college and a short stay in San Antonio where he cut his teeth on commercial television, Uncle Sam called. Bill was off to Vietnam where 58,000 Americans were killed. Lucky for Bill though and we talk about it in our Q&A, he was assigned there to do radio and TV for the troops. (Mel Allen and Lindsey Nelson did similar communications work in World War II.)\n\nAfter he was back on American soil, Brown wound up in Cincinnati where he did studio work for WLWT-TV before delving into play-by-play.\n\nUnlike other announcers, Brown recognized when it’s time to turn off the mic. There are not many who do. ‘My wife will tell me when I’m not as sharp,’ is a refrain which is no more than an excuse to stay on – just when the memory begins to lapse, word retention weakens and information retrieval isn’t quite at the tip of the tongue.\n\nThe legendary Cawood Ledford, who called the Kentucky Wildcat games for eons got out when he felt it was time. He didn’t want to hear that fans were talking about him, saying Cawood is losing it. He picked himself up on his own accord and took retirement. Brown did the same. He left (albeit he does some promotional work for the club and occasional on-air fill-in).\n\nIn all, Brown spent 37 fulltime seasons on television .Ten of those seasons he did radio too. He retired from fulltime play-by-play in 2016.\n\n***\n\nServing in Vietnam, as you did, is a challenging transition to adulthood. Back in 1971 in Saigon, before the magic of instantaneous worldwide communication, you gave the troops in Vietnam a touch of home, providing scores and sports news on military radio and television. The Vietnam experience for you transcended sportscasting. What was it like?\n\nWe used to joke in the Army about troops being assigned to jobs not even close to what they were trained to do, but for some reason this time, it worked in my favor and I was really grateful to be able to do what I always wanted to do – broadcast sports. We had all the creature comforts any Specialist 4 could ever hope for in Vietnam – housing in a hotel, bus transportation to work and security. It didn’t seem like being in Vietnam at all. We read the sports stories on the AP and UPI wires, rewrote them into our scripts and went on the air. We worked 12-hour shifts every day.\n\nYour first baseball play-by-play gig was in Cincinnati. You were a TV anchor but had never done major or even minor league ball. How did you get your reps and your experience, to enable you to start right in the big leagues with the Reds?\n\nI knew play-by-play was coming. So I went to every game when the team was in town and found an empty broadcast booth; used game notes and score sheets to create a simulated broadcast to work on the craft. I kept thinking about all the great experiences minor league broadcasters were getting every night and how I was competing with them for jobs in the future. Practicing at the big ballpark was the best I could do.\n\nAfter seven seasons with the Reds (1972-82), your career took another direction. You eventually headed out west and were away from day-to-day baseball until you ran into Dick Wagner, then general manager in Houston. Wagner, of course, worked in Cincinnati beforehand while you were there. He hired you to broadcast Astros games in 1987 where you spent 30 years in the booth. You arrived in Houston after the team’s original voice, Gene Elston, left. He was the first voice of the Astros and was embedded in the community. Any challenges being accepted in Houston?\n\nI thought people would be hopping mad that Gene was no longer in the booth and would not accept a guy they had never heard of as his replacement. In my mind I created a problem that probably wasn’t so much of an issue; but for the first few years it was not a comfortable feeling.\n\nWagner helped build the Big Red Machine and later strengthened the Astros. He also had worked in small market radio. How did he treat you?\n\nHe carefully checked out people before hiring them. He had been a radio station owner in Nebraska who paid a lot of attention to broadcasting and broadcasters. He counseled me to ask short interview questions like Jack Buck. Dick was always looking for bargains in the broadcast booth rather than hiring expensive big names. I was fortunate to be an easy mark for a low salary when it came to realizing my dream.\n\nDo you have any sense of what it was like for Gene Elston when Milo Hamilton arrived in 1985? Milo had somewhat of an overpowering personality. Gene was more restrained. The two were together a couple seasons. Did Gene feel threatened?\n\nI would be guessing, but from what I heard they kept each other at arm’s length. Gene actually made out the announcers’ schedules, so he had control of when he worked on radio and when he was on TV. He and Milo were not on the air in the same booth. Geno might do radio one day and Milo would be on TV that day, so they did not have to interact that much. Apparently, they didn’t.\n\nOf the Astros’ announcers, you’ve had the longest tenure to date, 30 seasons! Milo was there 27 years, and Elston, 25. You’re talented, of course. Yet, what’s the secret to survival as a big-league announcer?\n\nUnderstanding that you are an employee is very important. Some broadcasters become tremendously popular with fans and they allow themselves to think they’re more important than anyone in the front office. That can be the kiss of death.\n\nYou grew up in Missouri a fan of Jack Buck. You told me you would often think to yourself, “Am I trying to sound too much like him?” What made Buck special and why did you look up to him more than Harry Caray who was the Cards’ lead announcer? Buck was his number #2 for many years.\n\nI went to a game in St. Louis with my transistor radio. Harry Caray was doing play-by-play. He said, “There’s a hot smash to Ken Boyer at third…” as he often did. What my eyes saw was a routine two-hop ground ball not hit very hard. Harry lost all credibility with me on that play. Harry built drama as well as any broadcaster, but accuracy sometimes suffered. Jack was more intent to be a reporter and was more accurate. The broadcast was not about Jack. It was about what happened on the field. I loved his lack of ego.\n\nIt’s no secret that Milo Hamilton can be a difficult boothmate. He had uneasy relationships with other announcers, notably Harry Caray. What made him difficult and did you have problems working with him?\n\nI did not experience problems with Milo. He did not see me as a threat to his job. He was a Ford Frick Award winner in 1992, and after winning the highest award for a baseball broadcaster he had no worries. He was keyed very high and had a healthy ego. It’s my opinion that the egos in the booth can be every bit as large as they are on the field. In the final result, few of the listeners/viewers know or care about that. The broadcaster’s resume should be his body of work on the air. That’s not to excuse anybody from not being a good citizen, of course.\n\nYou left the Astros on you own accord and by your own initiative. You wanted to retire and transition to new opportunities at an age when you still had work years ahead of you. Why?\n\nIn my opinion, my performance on the air was slipping. Management was terrific and held my letter of resignation for two days, asking if I wanted to reconsider before it acted on it. But I had thought it through and was certain it was the right move. It was always my opinion that many broadcasters stayed on the job too long. Fans are forgiving and they do usually give an old broadcaster a “pass” when he makes an obvious mistake. I really couldn’t live with it and was not willing to keep going further down that road. When I was 30, I used to look at all the announcers in their 70s and wonder why they hadn’t had enough. When I got there,68, I realized how blessed I was to have many years on the job and thought the team would be better served with someone more proficient and more passionate. I could feel that some of my passion had exited, and that meant it was time for me to exit. Fortunately, the team asked me to stay on as a part time employee. If not, I planned to play some golf, do some volunteer work and travel with my wife. We have three grandchildren, and we love spending time with them.\n\nYou’ll hear some of the older guys say, “I’ll know when it’s time” or “My wife will tell me when I’m beginning to lose my sharpness.” Are these announcers just looking for excuses? Word retention, word retrieval and eyesight all generally weaken over time.\n\nYes, frequently they do not know when it’s time. People are talking about them, and it’s not complimentary. I experienced decline in all those areas you mention. Also, I mentioned in a little press conference at the retirement announcement that I felt as if I was on a high-speed train going through a tunnel, with images of many games and memories flashing past too quickly to enjoy them. For me, it was time to try to slow down the passing of time with more time to savor it.\n\nAt one point, I asked you about Vin Scully. You unhesitatingly chuckled and said, “Vin’s on another planet.” You won’t get an argument from anyone in their right mind. Yet, why so?\n\nHe’s not the ONLY broadcaster who would reference an opera or Broadway show or literary work on a baseball broadcast, but with anybody else it would be forced to create attention to his genius. He avoided clichés as well as anybody. He told countless stories about the players from his unquenchable preparation and made baseball broadcasts learning experiences."}, {"url": "https://www.spursodyssey.com/0405/brown.html", "page_content": "Spurs Odyssey was very saddened to hear this week of the death of another Spurs Legend - Double goalkeeper, Bill Brown. (1st December, 2004) Bill had spent many years living in Canada, after he ended his playing days in Toronto. The Spurs and Scotland legend had been unable to travel to England for the Double Reunion dinner in 2001, and also was not well enough to make it to White Hart Lane for the induction of Bill Nicholson and all the Double side into the Spurs Hall of Fame in March this year.\n\nPlayers from both Spurs and Liverpool wore black armbands in last night's Carling Cup quarter-final, but it is unfortunate that the club seems to have set a precedent by not holding a one-minute silence for one of the true Spurs' greats. Bill left the club in 1966, having been superceded by a young Pat Jennings, who was a fitting successor to a great goalie.\n\nHere is an extract from Brian Judson's excellent introduction to the Double series on Spurs Odyssey:-\n\nBill Brown was a very unflashy goalkeeper who just got on with the business of playing football instead of playing to the gallery like some goalkeepers do. Born in 1931, Brown played his first football for junior teams in Scotland before joining Dundee. In 1959, Nicholson signed Brown from Dundee for what seems a paltry sum of money these days but was then an enormous amount. Brown brought confidence to the defence for the first time since the heyday of Ted Ditchburn. Brown was rarely absent from the team until he left for Northampton Town in 1966 but in his last two seasons with Tottenham, he was encouraging the very young Pat Jennings, who had been signed from Watford. Brown only missed two games during 1960-61. After ending his career at Northampton, Brown emigrated to Canada, where he worked in property development for many years.\n\nThus, a third former player enters the \"Great Double Team in the Sky\" along with John White and Danny Blanchflower, where they have been joined recently by the much-loved and much-missed Bill Nicholson, who no doubt will be keeping a fond eye on them all.\n\nFollow @spursodyssey\n\nTop of page | Index to 2004-5 Matches & Reports"}, {"url": "https://football-talk.co.uk/182879/who-am-i-guess-the-footballer-based-on-their-transfer-history/", "page_content": "Welcome to “Who Am I?”, the guessing game that challenges your knowledge of footballers and their transfer histories. In this game, we will provide you with a series of clues about a particular footballer’s transfer history, including the teams they’ve played for, the fees involved in their transfers, and any significant moments in their career.\n\nYour job is to use your footy trivia knowledge and deduction skills to figure out the identity of the footballer in question. We have 20 questions, each relating to a transfer made by a current Premier League team. The answers will be revealed at the end of the quiz.\n\nSo grab yourself a pen & paper, and get ready to put your football knowledge to the test and see if you can guess the footballer based on their transfer history!\n\n20 “Who Am I” Football Trivia Questions:\n\nI started my career at Rennes, I was transferred to Deportivo La Coruña where I never made an appearance. I then joined Bordeaux where I won the Golden Boot in the 1998-99 season. Arsenal then signed me for a then-record fee of £13 million. Who am I?\n\nI started my career in Colombia, winning the Categoría Primera A in my first professional season for Atlético Nacional. I then moved to River Plate, becoming the league’s top goalscorer in the year 2000. The following season I moved to Aston Villa for a then-record fee of £9.5 million. Who am I?\n\nI started my career at Tottenham, making loan moves to Chesterfield, Leyton Orient & Gillingham. In 2009, I joined Leyton Orient on a permanent transfer and played over 100 games for the club before joining Bournemouth in 2012. Who am I?\n\nI joined the youth academy of Legia Warsaw aged 15 before moving to Arsenal’s youth setup in 2006. I turned professional in 2009, making 132 appearances for Arsenal. In the 2009-10 season I joined Brentford on loan. Who am I?\n\nI graduated from the youth academy of 1899 Hoffenheim in 2008, transferred to Karlsruher in 2011, before joining FC Ingolstadt 04 in 2012. I went on to make over 150 appearances for Ingolstadt, scoring 17 goals. In 2007, I joined Brighton for a fee of £3 million. Who am I?\n\nMy career began in the late 90s, bursting on the scene with goal scoring seasons for Argeș Pitești & Dinamo București. In the early 2000s, I spent time in Italy playing for Inter Milan, Verona & Parma, before my transfer to Chelsea in 2003 for around £16 million. Who am I?\n\nI started my career in 1999 for Argentinian team Platense, before joining Dundee in the 2001 season. In 2004, I signed for Crystal Palace for £750,000 and went on to make 347 league appearances for the club. Who am I?\n\nIn 1997 I left my home country and joined Millwall on a free transfer. I went on to make 217 league appearances for the club, scoring 52 goals. In 2004 I joined Everton for £1.5 million. I went on to play 226 league appearances for the club, becoming captain and getting nominated for a Ballon d’Or. Who am I?\n\nI started my career at Charlton Athletic where I made over 100 appearances. In 2004 I joined Chelsea for £10 million, before moving the following season to Newcastle for £6.5 million and succeeding Alan Shearer as captain. In 2007, I joined West Ham where I went on to make over 100 appearances, before joining Tottenham in 2011. I ended my career at Fulham, retiring in 2017. Who am I?\n\nIn 1991, I joined AZ Alkmaar where I remained for 3 years before getting released. I then played amateur football for a year before joining Portuguese side Campomaiorense in 1995. The following season I joined Boavista and became the league’s second highest goalscorer, earning me a £2 million move to Leeds United. Who am I?\n\nMy youth career started at AAS Sarcelles in 2004. I had a two-month trial at Scottish club St Mirren, but left due to the cold weather. In 2007, I signed a professional contract with Quimper before joining Le Havre in 2010. In 2014, I joined Leicester City for £450,000, where I went on to make 158 league appearances scoring 48 goals. Who am I?\n\nMy career started at Wacker München and after impressing as a junior, I joined Bayern Munich aged 16, making my debut as a professional in 1993. After playing in the 1998 World Cup, I joined Newcastle United for £5.5 million. The following season I joined Liverpool for £8 million where I went on to make 191 league appearances. Who am I?\n\nAfter graduating from the Santos academy in 2002 I went on to make 108 league appearances for the club, scoring 47 goals. In 2005, I joined Real Madrid for €24 million, taking over the number 10 shirt previously worn by Luís Figo. In 2008, I signed for Manchester City for £32.5 million on the same day that the club was taken over by Abu Dhabi United Group. Who am I?\n\nI started my professional career at Estudiantes before moving to Boca Juniors in 1996. Shortly after making my international debut, I was signed by Sven-Göran Eriksson’s Sampdoria. I went on to play for fellow Italian sides Parma & Lazio in the following years, before signing for Manchester United in 2001 for a then-record transfer fee of £28.1 million. Who am I?\n\nI started my professional career in my home country of Peru for Sporting Cristal, in 1993, I joined Deportivo Municipal, before returning back to Sporting Cristal at the end of the season. I went on to play 97 league games for Cristal, before joining Boca Juniors in 1997, where I was given the nickname the ‘Maestrito’ by Diego Maradona. In 1998, I signed for Newcastle United for £2,480,000, playing 172 league matches and becoming a club legend. Who am I?\n\nI started my career at Cambridge FC in New Zealand, moving between other New Zealand based clubs before joining West Brom in 2009. During my time at West Brom I was loaned out to 6 different teams, before signing for Leicester. In 2015, I signed for Leeds United and went on to score 41 goals in 83 league games. I then joined Burnley for a fee of £15 million in 2017, before Newcastle triggered my £25 million release clause in 2022. In the 2023 season I was loaned to Nottingham Forest . Who am I?\n\nMy professional career started at Leece in 2004. I was loaned out to three different Italian sides to aid my development, before AZ Alkmaar signed me in 2007. I would go on to play for Parma, Sampdoria & Feyenoord, before signing for Southampton in 2014 for £8 million. Who am I?\n\nMy professional career started at Wolves in 1997, where I managed 24 goals in 73 league appearances, earning me a £6 million transfer to Coventry City (a then-record transfer for a British teenager). After an impressive debut season for Coventry, I was signed by Inter Milan for £13 million in July 2000. I would then join Leeds United for £13 million the following season, before moving on again 1 year later for £7 million to Tottenham Hotspur. Who am I?\n\nI started my career at Lazio in 1985 and went on to represent multiple Italian giants such as Juventus, Napoli & Milan. In 1996, I moved to Celtic and after impressing in my first season, earned a move to the Premier League, signing for Sheffield Wednesday in 1997 for £4.2 million. In 1999, I completed a £1.5 million move to West Ham United, where I’d later become a club legend scoring 47 goals in 118 appearances. Who am I?\n\nAfter graduating from the Rangers youth academy I began my professional career at Falkirk. In 1990, I signed for Millwall where I stayed for 6 years, making 218 league appearances and scoring 63 goals. My form for Millwall earned me a then-big money move to Premier League side Sunderland in 1996. In 2001, I signed for Wolves for £1.2 million, becoming a crowd favorite and helping the club return to the Premier League in my second season. Who am I?\n\nAnswers:\n\nSylvain Wiltord Juan Pablo Ángel Charlie Daniels Wojciech Szczęsny Pascal Groß Adrian Mutu Julián Speroni Tim Cahill Scott Parker Jimmy Floyd Hasselbaink Riyad Mahrez Dietmar Hamann Robinho Juan Sebastián Verón Nolberto Solano Chris Wood Graziano Pellè Robbie Keane Paolo Di Canio Alex Rae\n\nAnd there you have it! We hope you enjoyed playing “Who Am I? Guess the Footballer Based on Their Transfer History.” It’s always fascinating to see the journey of a footballer’s career and the clubs they’ve played for along the way."}, {"url": "https://www.bathcityfc.com/past-players-a/", "page_content": "First name Surname Apps Goals Pen Picture\n\n???? Abrahams 3 2 Played for City during the 1923-24 season.\n\nPaul Abrahams 5 0 Played for City during the 1970-71 season.\n\n???? Acocks 3 1 Stationed in the Bath area with the RAF he made a handful of appearances for City as football started up again following World War II.\n\n???? Adams n/a 0 Played for City during the 1905-06 season.\n\nAdie Adams 3 0 Former England U18’s Schoolboy International Adie joined City on loan from Forest Green Rovers at the beginning of September 2003. Made his debut as a substitute in the 3-3 draw at Weymouth and the 19-year went on to make two uneventful starts in a City shirt. Then headed back from where he came. Spent time on loan at Bashley and Swindon Supermarine during the 2004-05 season. Joined Team Bath in October 2005.\n\nBernard Adams 1 0 Played for City during the 1921-22 season.\n\nGeorge Adams 21 7 George moved to City from Leyton Orient in July 1950 having previously played for Chelmsford City. The Falkirk born wing-half played for Crystal Palace later in his career.\n\nMike Adams 175 22 Attacking midfielder Micky was signed from Bristol Rovers toward the end of the 1983-84 season by Bobby Jones and became a regular in the City side for the next four seasons. A frequent goalscorer he was best remembered for his injury-time winner, scored with his knee, against Aylesbury United in the FA Cup to set up the famous Bristol City matches in 1986. However, his failure to register even a single goal during the 1987-88 season contributed to City’s relegation and saw him released by new manager Harold Jarman. Went on to play for Weston Super Mare and Keynsham Town.\n\nReg Adams 179 0 A goalkeeper signed from Chippenham Town following the First World War. After six seasons with the club he retired in 1925.\n\nPaul Adcock 129 41 Plymouth-born striker Paul’s City career began in spectacular style with a debut day hat-trick against Macclesfield Town in August 1993. He ended that season as top scorer with 23 goals and continued this form in the early stages of the next campaign. However, regular injury and suspension problems contributed to a loss of form and he struggled to recapture this start. Despite this Paul earned a three-month contract with Torquay United in the summer of 1996. When this was not extended he briefly returned to City (5 games 1 goal) before joining Gloucester City in November 1996. Also played for Weymouth and most recently South Western League side Tavistock.\n\nDavid Adekola 9 3 Despite making just nine appearances for City ‘Pepsi’ or ‘Prince’ Adekola is a name that remains etched on many City fans minds. It was a major coup when Tony Ricketts obtained his services just before the 1995 transfer deadline as the striker had played top division football in both France and Belgium as well as scoring 14 goals in just 22 appearance for Nigeria. His performances for City seemed to support this pedigree and Ricketts made, ultimately unsuccessful, attempts to keep him at Twerton Park during the summer of 1995. However, many years later it was revealed that this whole background may have never actually happened! What is true is that he played for Bury between 1992 and 1994 and is remembered as a legend there, and also had brief spells with Oldham, Hereford, Cambridge United, Bishop’s Stortford and Brighton.\n\n???? Adkins 2 0 Played for City during the 1924-25 season\n\n???? Adlam n/a 0 Played for City during the 1903-04 season.\n\nDave Ainscough 6 0 Played for City during the 1973-74 season.\n\n???? Aitken 1 0 One of two players called Aitken to feature for City during the 1911-12 season\n\n???? Aitken 2 0 One of two players called Aitken to feature for City during the 1911-12 season\n\nPeter Aitken 126 8 Vastly experienced defender Peter had two spells with City after playing for both Bristol City, where he was captain before becoming one of the ‘Ashton Gate Eight’ that were cut by the Robins in 1982 to save the club going bust, and Bristol Rovers during the 1970’s. Moved onto York City then had a spell in Hong Kong from where he joined City in 1982. He left almost immediately to join AFC Bournemouth but after one game was back at Twerton Park. Made over 100 appearances before quitting for Trowbridge Town at the end of the 1984-85 season. Spent three seasons at Frome Road, where he also began coaching, then moved onto Forest Green Rovers. His second spell lasted just six months and nine games in 1988. Was back again as assistant to Tony Ricketts in the summer of 1991 but cost cutting measures before the end of that season saw him leave the club. Now back at Rovers as their Community Scheme Organiser.\n\nE Alden 17 7 Played for City for two seasons between 1926 and 1928.\n\nW Alden 16 4 Played for City during the 1908-09 season, netting on four occasions.\n\nW Allan n/a 2 Played for City during the 1904-05 season.\n\nBertie Allen 18 3 Bertie played for City during the 1948-49 season before joining Chippenham United.\n\nBertie Allen n/a 2 A young striker from Peasdown, Bertie scored on his debut against Bromsgrove Rovers in November 1972 and his first league start a month later but failed to fulfil this early promise. Played for Frome Town later in his career, scoring over 160 goals including twice in the Robins FA Cup win over City in 1984.\n\nJohn Allen 218 76 Forward John was one of ten former Welton Rovers players signed by the West Clewes ex-manager Arnold Rogers during the 1967 close season. He went on to make over 200 appearances for the club before joining Trowbridge Town in July 1971.\n\nKenny Allen 289 0 As part of City’s 1978 Southern League championship winners side Kenny is regarded as one of the best goalkeepers to ever pull on a City shirt. The 6’4 shot-stopper arrived at Twerton Park from Torquay United in 1973 and made 280 appearances in the next five years before a surprise move to Bournemouth for £6000 took him back into league football. Spent five seasons with the South Coast club and then had spells with Peterborough, Bury, Swindon Town and, once again, Torquay. It was from the Gulls that he rejoined City in July 1988 but after just nine games he broke his leg conceding a penalty against Dorchester. Was released when he regained fitness early in 1989 and returned to Torquay where he made his last appearance at Wembley in the 1989 LDV Vans Trophy Final.\n\nTom Allen 69 38 Thomas was an inside-forward who played 69 games for City, scoring 38 goals, in two spells with the club before the First World War. In-between these two stints he spent a season with Bristol City but only made one first team appearance.\n\nMalcolm Allison 2 0 The word most commonly associated with Malcolm is ‘flamboyant’ and even in his early managerial career with City there were signs of this approach. As a player he made nearly 250 appearances for West Ham United before illness brought his professional career to a premature end. He did turn out for Romford after this and played two games for City during his one season with the club. Of course, it was a manager he is most well-know and he began at Twerton Park in 1963, leading the club to a 3rd place finish in the Southern League and an appearance in the 3rd Round of the FA Cup, plus introducing full-time training and the sweeper system. At the end of that season he left to join Plymouth Argyle before going on to manage Manchester City, Crystal Palace and Middlesbrough. He also managed overseas, in Turkey with Galatasaray (1976-1977), and in Portugal with Sporting. With the Lisbon club he won the championship title, and the Portuguese Cup, in 1981-1982.\n\nSam Allison 56 8 Undoubtedly talented but never consistent pacy forward Sam had two spells with City. Burst onto the scene with five goals in eight reserve team games at the start of the 2000-01 season. Made over 40 first team appearances after this, although just 16 in the starting line-up. Following a falling out with manager Alan Pridham he joined Clevedon Town in October 2001 for £500. Returned to Twerton Park at the beginning of the next season but only added one further start and three substitute outings to his tally. Following his release at the end of that season played for Salisbury City and Paulton Rovers before joining Chippenham Town in December 2003.\n\nSimeon Allison 3 1 Younger cousin of Sam Allison, Simeon’s career with City followed a similar path without ever quite making the step up to the first team. Was a regular in the reserve side before switching to Clevedon Town in December 2001. Was back with City again the following year but only made one substitute appearance. Joined Frome Town in July 2005.\n\nGil Alsop 67 47 A regular reserve team player, Gil made the step up to the first team squad during the late 1920’s. His goalscoring feats began to attract the attention of a host of league clubs during the 1929-30 season, with scouts from Sheffield Wednesday, Crystal Palace and Bristol City all watching City’s 7-1 FA Cup win over Garrards Athletic, in which Gil scored once. Eventually he signed for Coventry City – who had knocked City out of the FA Cup a few weeks earlier – in December 1929, along with George Plummer for a joint fee of £700. He went on to play for Walsall, WBA and Ipswich Town, before returning to Walsall to finish his playing career in 1947, staying with the Midlands clubs as groundsman and trainer. When they moved to their new Bescott Stadium in 1990 a stand was named in his honour, although ten years later it became the Purple Loans and then Floors-to-Go Stand!\n\nHarry Andrews 13 10 A forward signed from Merthyr Town during the second half of the 1928-29 season. He began his career with Torquay United (then a non-league club) before joining Exeter City in 1927. He switched to the Welsh club the following year.\n\nW Anstey n/a 1 Played for City for three seasons between 1904 and 1907.\n\n???? Anthony 18 2 Played for City for two seasons between the World Wars.\n\nTony Aplin 23 0 Tony made 23 appearances for City during the 1971-72 season.\n\nW Archard n/a 7 A former army player who won Army Cup medals in India, he played for the club in 1907-08 season.\n\nCJ Ash n/a 6 A winger who player for City in their early years, also representing the Somerset FA.\n\nErnie Ashe 54 8 Ernie was one of manager’s Ivor Powell’s first signings for the 1966-67 season when he arrived from Yeovil Town.\n\nRoy Ashton 2 0 A goalkeeper signed at the start of the 1949-50 season, Roy only lasted a couple of games before being released. He had started his career at Wrexham, but failed to make a first-team appearance. In April 1948 he joined Cardiff City where he played one game before his short spell at Twerton Park. After this he went on to have two spells with Newport County, plus stints at Merthyr Tydfil, Millford and Barry Town.\n\nCyril Ashworth 1 0 Played for the club during the 1949-50 season. His playing career was ended by a serious motorbike crash.\n\nChris Astley 6 0 Teenage goalkeeper Chris was signed from Chippenham Town just before Christmas 2005 as cover for 1st choice no.1 Paul Evans. He came through the youth set-up at Filton Academy and played for the England Schools Under-18 side. Played for Calne in the Western League when not required by City."}, {"url": "https://autoaction.com.au/2022/09/24/rembering-bill-brown-for-more-than-the-obvious", "page_content": "REMEMBERING BILL BROWN – FOR MORE THAN THE OBVIOUS\n\nBy Bruce Williams\n\nVALE BILL BROWN\n\nAUTO ACTION is sad to acknowledge the passing of sports and touring car racer Bill Brown who died on September 23rd at the age of 81 after a short battle with illness.\n\nSeen in the above photo with a young Dick Johnson.\n\nWhile it is the two huge crashes at Bathurst in Ford Falcons that Bill Brown is widely known for, it was his success in sports car racing in the late 60’s and early 70’s that he was most proud of.\n\nIt all began for Brown competing in some club racing in Sydney during the early ‘60’s, racing a Porsche 1600 Speedster at the Homebush and Warwick Farm circuits in NSW.\n\nAs a young man, Bill Brown was great mates with Spencer Martin, and indeed they remained close friends right up till his passing.\n\nIt was via this friendship that Brown got to know racer David McKay, later of Scuderia Veloce fame. David McKay was well known for preparing and racing cars and specialised in preparing cars for longer distance events and this led to some endurance drives for Brown and Martin.\n\nIn 1964 Brown teamed up with Martin for the 500 mile race at Bathurst and the pair won their class at in a Vauxhall Viva.\n\nThe relationship with McKay grew and saw Bill Brown racing in sports cars.\n\nIn 1966, he took a class victory in the Surfers Paradise 12Hour in a Volvo P1800 he shared with David McKay.\n\nThe relationship with McKay also gave him the opportunity to race the fabulous Scuderia Veloce Ferrari 250LM.\n\nThe 250LM delivered Brown many race wins. Indeed, Brown rated his greatest race victory as that of winning the 1967 Surfers Paradise 12 Hour. In that race he shared the victory with Greg Cusack.\n\nBrown also managed to prang the very valuable Ferrari at Warwick Farm in 1967.\n\nThe relationship with Scuderia Veloce’s David McKay also gave him the opportunity to race another fabulous Ferrari, when in 1968 McKay imported the Ferrari Can-Am 350. The Ferrari had been converted from one of the 1967 Le Mans 4.0 Litre V12 factory P4’s.\n\nOriginally imported for Chris Amon to race, Brown drove the car at a round of the Tasman Series at Longford. During the event, Brown set an Australian speed record at the tree lined Tasmanian road circuit of 182.9 MPH (294.5 Km/h), this was the fastest ever recorded outright speed at an Australian race circuit at the time.\n\nA few months later he raced the car at Bathurst and set another record for the fastest official time down Conrod straight of 181 MPH (291 Km/h).\n\nIn 1968 Brown was part of the first Holden Dealer Racing Team, racing the new HK Holden Monaro GTS 327.\n\nIt was a clandestine ‘Factory effort’ sponsored by the Sydney Daily Telegraph newspaper and put together by Scuderia Veloce’s David McKay.\n\nAlthough a Monaro delivered Holden its first ‘Great race’ win, it was a privateer in Bruce McPhee and Barry Mullholland who took the flag first.\n\nThe best placed car of the McKay managed Holden Dealer Racing Team Monaro’s was Jim Palmer/Phil West in second, while a damaged wheel put Brown and teammate Paul Hawkins Monaro out of the race.\n\nBut for most race fans, it was the two big Bathurst crashes that Brown had during the running of the 500-mile production car races that he became infamous for.\n\nIn 1969, on the opening lap he crashed the big Falcon XW GT HO on the run down the hill from Skyline after a slight touch with another competitor. It was a big crash that saw many competitors get caught up in and the race was slowed to a crawl while the wreckage was removed.\n\nAnd then in 1971, it was the huge crash at McPhillamy Park that will live long in the memories of most touring car fans.\n\nIt is a crash that is still considered to be one of the most violent ever witnessed and is regularly played in event highlight packages.\n\nWhile running competitively in the front part of the field, Brown’s XY GTHO Phase III Falcon blew a tyre in the high-speed run through McPhillamy and then after losing control and slamming into the fence, the big Falcon barrel rolled along the top of the armco narrowly missing an official and slicing the big sedan in half just behind the driver’s seat.\n\nMost who witnessed the incident feared that Brown had been killed or at least seriously injured, but after several minutes, with the help of officials and spectators Brown emerged from the wreckage with a few minor cuts and bruises and was thankful that the big Falcon had not ended up in the crowd.\n\nBrown kept racing and in the early 1970’s was still a fast peddler in 911 Porsche’s and competed in the Australian Touring Car Championship races. Later his Porsche 911 carried the Grace Bros signage.\n\nDuring the ’70’s Brown continued to race occasionally at Bathurst and last competed at Bathurst in 1978, with by then former wife Sue Ransom in Ford Capri GT 3000 Mk.1.\n\nWhile he only ever considered himself an amateur racer, he was still highly regarded for his abilities.\n\nBrown retired from a successful business life several years ago.\n\nAUTO ACTION extends our condolences to Bill Brown’s family, friends and those who knew him."}, {"url": "https://www.cosmopolitan.com/entertainment/celebs/a7208731/celebrity-club-appearances-facts/", "page_content": "Getty\n\nA chart-topping song or TV role can yield a pretty paycheck, sure, but for many celebs, the real bread and butter is in the two-hour club appearance. So what goes into these lucrative deals, beyond fist-pumping? Cosmopolitan.com spoke to David Weintraub, CEO of DWE Talent, a management, film and television production company that represents the likes of Scott Disick, Brody Jenner, and Ray J — all big-paycheck club headliners — to learn more.\n\n1. From beginning to end, a club appearance usually takes less than two hours. “The job is to come in, take pictures, do something like a press line — but without any real important press — and host. Obviously a 90-Day Fiancé star is not going to be talking to Cosmo about their future in the TV business at a red carpet. However, Scott Disick for an example, he is going to do 20 minutes on the press line, which will be five to 10 interviews; he will probably do four minutes of pictures with [the club’s] big-dollar spenders who are guaranteed to get a picture with him, and then after that everything is cut off, he has to go in and do his appearance, talk on the mic, say hello to everyone, maybe do a couple of inside pictures, depending. His total amount of job duties [take], like, 30 minutes, tops.”\n\nMore From Cosmopolitan play icon The triangle icon that indicates to play\n\n2. The celebrity isn’t actually there to party. “They are not really trying to hang out at the club — it’s a meat circus for them. You can’t really have fun there, especially if your life is getting scrutinized. Everything they are doing is being looked at and talked about: Who did they talk to? Who did they hug? Who shook their hand? How did they treat somebody? Any picture can be taken out of context. A photo at the wrong angle of some girl saying, ’Hi, I am a huge fan,’ and whispering in your ear can all of a sudden become, ’Are you dating that person or did you hook up with them?’ The world of Instagram and social media has complicated public appearances. I would say [it can cause] issues at home.”\n\n3. The negotiations are intense. “You don’t just walk up and you get handed a stack of cash. This is planned out, weeks and sometimes months, in advance. There are a lot of [logistics] like hair and makeup, arrival time. How many pictures they are going to take? How many autographs are they going to sign? Are they drinking? Are they bringing their TV-show crew with them? Then there are all the travel arrangements. Will it be coach tickets, first-class tickets, your own private plane? How many hotel rooms, meals per diem? I have seen crazy demands.”\n\nGetty\n\n4. Seriously, the demands can be crazy. “Sometimes I will talk the clients into the crazy demands — I know that we can get them, so why not? If you’re going to a major hotel like Omnia at Caesars Palace and you’re going to go perform, I know that they can give you 10 rooms, two suites, a fantasy suite, all the ground transportation, all the food, anything you want, because it’s really just a write-off and it’s all there. There is also picking and choosing what type of crowd you want in the club that night — you want it to be mostly girls, mostly guys, a mix? Big things that people demand a lot of these days is Don Julio 1942, Johnnie Walker Blue. Ace of Spades is the big \"It\" Champagne that everybody has to drink. The bottle is [about] $300 and it comes in this black box, and it’s a whole thing to open the box.”\n\n5. Social media stars aren’t a major draw. “The biggest payday is in the DJ world, reality TV, and rap. You’ve got to remember, to do an appearance, it’s not that you need to be highly skilled, it’s that you need to have some type of value that is going to attract people to come. So the Instagram and YouTube world, a lot of which is semi-comedy, [aren’t as profitable]. It’s not like people are going to go to a nightclub to hear somebody do some type of shtick or do some weird Vine video. Also, women make a lot more than men — not compared to rappers or DJs, strictly in the reality world.\"\n\n6. Paychecks range from a couple thousand to over a quarter million dollars. “Bottom-of-the-barrel reality TV stars, they are probably getting between $5,000 to $15,000 to do an appearance. The next tier up is going to be your Love & Hip Hop, your Housewives, and they are going for probably between $15,000 and $50,000. And then you have the Kardashians, Paris Hilton, Amber Rose, Blac Chyna, Future, Drake, 2 Chainz, Snoop Dogg — they have their own tier, which is probably $50,000 to $250,000 and upward. I am not doing a deal for $5,000 — I don’t have time to do that kind of deal. I don’t have time to hear your demands. I don’t need to make $300 on a deal, I need to make $30,000.”\n\n7. Venues expect exclusivity. \"These guys have to commit to some level of exclusivity for a period of time — that will [affect] the money they are going to receive. Depending on the talent, they likely can’t [go to another club prior to their commitment]. It really comes down to the territory. If you’re doing something in Atlantic City, you’re not going to be affected by an L.A. pop-in. [But] they do try to keep the attention that you may be getting to a minimum. You definitely can’t allow [another venue] to do any marketing or advertising with your likeness.\"\n\nGetty\n\n8. There is a constant need for damage control. “As a manager and as a booker for those celebrities, you are in a constant battle between the client and the venue and all of the rigmarole that goes in between. I have to be the sane person to mediate, to let talent know that their demands are maybe off the wall and crazy, and to let the club know when they are oversold and they have too much press and they want too many pictures. Or they want you to meet this guy because this guy usually spends $100,000 a week at the club and he has got to sit right next to the talent — but your talent doesn’t like that person and they want to sit next to [the talent].”\n\n\n\n9. You can’t cash in on appearances forever. “You got to get it while you’re hot. You are only as relevant as your last hit or your last look. You got to monetize it immediately. If a big story hits or a big show is about to come out or we know there’s going to be a big media circus surrounding something, you got to be preemptive, out there booking the dates ahead of time.”\n\n10. There’s a huge market for private parties. And foodie celebrities are on the rise. “People assume club, club, club — OK, but the other huge world that we deal with is the private world — and it’s 10 times the money. The bar mitzvahs, the private birthday parties, the rich family get-togethers, the holiday parties, those are the big ones. [An artist] can go get $300,000 to play two songs at a party for somebody. Also, the foodie scene is starting to emerge as a big payday world. This is the next area. I haven’t seen the big plateau with the Instagram/model world; everybody thinks that these Instagram models are making money but they are not. They are making $100 to $500 to go do appearances. I am not really going to deal with somebody who takes pictures all day unless you’re the biggest one in the game.”\n\nFollow Darla on Twitter.\n\n\n\nCorrection: a previous version of this post suggested Omnia hosts celebrity red carpets, which is not accurate. It also incorrectly stated that Omnia is at the MGM; it’s at Caesars Palace."}, {"url": "https://theanalyst.com/2022/08/youngest-players-to-play-100-premier-league-games/", "page_content": "Race to the Century: The Youngest Players to Play 100 Premier League Games\n\nArsenal’s Bukayo Saka and Manchester City’s Phil Foden both made their 100th Premier League appearance at the weekend, versus Bournemouth and Newcastle United respectively.\n\nSurely they’re two of the youngest players to reach a century of Premier League games, right?\n\nCorrect for Saka, but very wrong for Foden.\n\nWhilst Saka enters just inside the top 10 – level with Joe Cole at 20 years and 349 days old, there are 52 tyros that can put their hand up and say that they were younger than Foden when they reached the 100 appearances in the competition – we look in detail at the youngest five.\n\nNo.1: Wayne Rooney\n\n19 years, 321 days old\n\nMatch: Manchester United 1-1 Manchester City (10 September 2005)\n\nWayne Rooney became the youngest player to reach 100 Premier League appearances when he played for Manchester United in their derby against Manchester City at Old Trafford in September 2005. In doing so, he broke a 10-year record in the competition, overtaking Chris Bart-Williams’ achievement of being the youngest of the landmark in February 1995.\n\nHe wasn’t to score or assist in his 100th league appearance, but Rooney had tallied 39 goal involvements by this point in his career – only Michael Owen (54) has ever had more goal involvements by Rooney’s age on the day of this record-breaking 100th appearance.\n\nTotal Premier League appearances: 491\n\nTotal top flight league appearances: 539\n\nVerdict: At the time of writing, Rooney is still the all-time leading scorer for Man Utd in all competitions (253 goals), while only Bobby Charlton (199) has scored more league goals for the club than he did (183). He is also the leading scorer in England men’s history (53), while no outfielder has won as many caps for the Three Lions (120).\n\nOnly Alan Shearer (260) scored more Premier League goals than Rooney (208), only Ryan Giggs (162) and Cesc Fàbregas (111) assisted more often in the competition than he did (103), while he was one of only three players to reach the century of goals and assists in the competition (alongside Shearer and Frank Lampard), but having played his last Premier League game 179 days short of his 33rd birthday, there will always be a lingering feeling that he could have achieved even more.\n\nRooney is, arguably, the Premier League’s last anti sports science player who will make it on sheer talent alone.\n\nNo.2: Cesc Fàbregas\n\n19 years, 340 days old\n\nMatch: Newcastle United 0-0 Arsenal (9 April 2007)\n\nNothing much happened on Monday 9 April 2007 at St James’ Park in a drab 0-0 draw between Newcastle and Arsenal, but it did see Spanish midfielder Cesc Fàbregas make his 100th Premier League appearance.\n\nHe missed out on becoming the youngest to the landmark by only 19 days, but as a consolation prize he became the youngest non-English star to a century of Premier League appearances.\n\nTotal Premier League appearances: 350\n\nTotal top flight league appearances: 500 (at the time of writing)\n\nVerdict: Cesc Fàbregas is rightly remembered as one of the best creative players in Premier League history, with only Ryan Giggs (162) having more assists in the competition than him. Since his first Premier League season in 2004-05, Fàbregas has created 846 chances and assisted 111 goals – no player can match those tallies in the competition.\n\nHe left Arsenal in the search for a league title medal – which he got in his second season in the first-team at Barcelona in La Liga (2012-13), before adding two Premier League titles with Chelsea in 2014-15 and 2016-17.\n\nA rarity in that he’s loved by both Arsenal and Chelsea fans, just like the FA Cup trophy this century.\n\nNo.3: James Milner\n\n20 years, 104 days old\n\nMatch: Wigan Athletic 3-2 Aston Villa (18 April 2006)\n\nJames Milner made his 100th Premier League appearance in a five-goal thriller between Wigan and Aston Villa in April 2006 – unfortunately for the English midfielder, he ended on the losing side.\n\nOn loan from Newcastle United at the time, Milner became the second youngest player to reach 100 appearances, just seven months after Wayne Rooney set the record (Fabregas overtook Milner a year later, pushing him to third in the rankings).\n\nMilner was recognised for his achievement with a card – a yellow from then-referee, now TV-man-in-a-room-explaining-VAR-decisions expert Peter Walton.\n\nTotal Premier League appearances: 590 (at the time of writing)\n\nTotal top flight league appearances: 590 (at the time of writing)\n\nVerdict: Nothing boring about being the third youngest player to 100 Premier League appearances, is there.\n\nHe holds the title of the Premier League’s most used substitute (177) and is now just 10 matches away from being only the fourth player to reach 600 Premier League appearances. With only 64 appearances left to make before breaking Gareth Barry’s competition appearance record, Milner is a rare occurrence of a player being used so often in his teenage years yet lasting the distance. Even more impressively, he’s still doing it at one of the best clubs in European football, Liverpool, and now has a beard.\n\nNo.4: Chris Bart-Williams\n\n20 years, 247 days old\n\nMatch: Sheffield Wednesday 1-2 Aston Villa (18 February 1995)\n\nChris Bart-Williams is probably a name unknown to many modern Premier League fans but let me be the one to tell you that he was an excellent player, equally as comfortable in an attacking midfield role or more defensively later in his career.\n\nBart-Williams was a key player across England youth sides, but cruelly never won a full international cap for the Three Lions despite their struggles in the first half of the 1990s.\n\nHis 100th Premier League appearance came in February 1995, as the Owls lost 2-1 at home to Aston Villa – a Dean Saunders brace ruining his day.\n\nBart-Williams may have been the 27th player to reach 100 appearances in the Premier League, but a little-known fact is that he was the first to do so under the age of 21.\n\nTotal Premier League appearances: 211\n\nTotal top flight league appearances: 226\n\nVerdict: Bart-Williams made more Premier League appearances before his 21st birthday (109) than he did after it (102), with four of his last five seasons as a Nottingham Forest player coming in the second tier. Undoubtedly a big talent, he never lived up to expectations of many – but still had a solid enough career overall, though.\n\nNo.5: Michael Owen\n\n20 years, 270 days old\n\nMatch: Liverpool 3-2 Manchester City (9 September 2000)\n\nWhen Michael Owen broke through at Liverpool in 1998, he was arguably the first potential world class striker produced by England in the Premier League era.\n\nOn his 100th Premier League appearance – against Man City in September 2000, Owen scored his 54th goal in the competition. Only 12 players have scored more than Owen by the time they’d reached a century of appearances in the Premier League, none of those at a younger age.\n\nOverall, he managed 72 goal involvements in his first 100 Premier League games, and he was still 95 days shy of his 21st birthday.\n\nTotal Premier League appearances: 326\n\nTotal top flight league appearances: 362\n\nVerdict: Weirdly, despite being such an obvious talent and potent goal scorer, Owen never registered 20 goals in a single league season as a player.\n\nOnly five players scored more goals for the England men’s team than Owen (41), while he remains the last Englishman to win the Ballon d’Or (2001).\n\nInjuries robbed Owen of a phenomenal career – he played just 619 minutes of league football following his 30th birthday, scoring four goals. To show what he could have achieved with a little more luck, Alan Shearer was able to come back from serious injuries in his 20s and go on to score 84 more Premier League goals in his 30s.\n\nNo. 6-10\n\nHere are the names who round out the top 10, all of them English and with nine Premier League title wins between them.\n\n\n\nNo.6: Raheem Sterling (20 years, 285 days)\n\nNo.7: Gareth Barry (20 years, 323 days)\n\nNo.8: Micah Richards (20 years, 334 days)\n\nNo.9: Robbie Fowler (20 years, 342 days)\n\n=No.10: Joe Cole (20 years, 349 days)\n\n=No.10: Bukayo Saka (20 years, 349 days)\n\nEnjoy this? Subscribe to our mailing list to receive exclusive weekly content."}]}