{"Bill Brown is best known for his time at Celtic, where he made over 500 appearances in all competitions between 1951 and 1967.": [{"url": "https://www.scottishfootballmuseum.org.uk/exhibitions/hall-of-fame/bill-brown/", "page_content": "Inducted in 2014\n\n1931 — 2004\n\nFootball Player; Bill Brown is best known as an outstanding goalkeeper for Dundee, Tottenham Hotspur and Scotland, although he also enjoyed spells towards the end of his career with Northampton Town and Toronto Falcons. Brown joined Dundee from Junior club Carnoustie Panmure in 1949 and spent nearly a decade at Dens Park. During his spell on Tayside, Brown won the Scottish League Cup in 1952 and 1953 and won his first Scotland cap in 1958. A big move to Tottenham Hotspur followed in 1959.\n\nBill was a member of the ‘Spurs’ team which won the League Championship and FA Cup ‘double’ in season 1960/61. He won another FA Cup winners medal the following season and in 1963 won the European Cup Winners’ Cup as the Londoners became the first English club to win a major European trophy. Bill was capped 28 times by Scotland between 1958 and 1965 and played at the 1958 World Cup Finals in Sweden."}, {"url": "https://www.heraldscotland.com/opinion/18276064.obituary-bill-brown-last-real-expert-still-teaching-ceramics-scotland/", "page_content": "BILL Brown, respected ceramics designer and teacher, has died at the age of 68 following a short illness.\n\nHe was an expert in his craft and gained international recognition for his knowledge of slip-casting and transfer printing. As Head of Ceramic Design at Glasgow School of Art in its final years, he unwillingly became “the last ‘real’ expert” still teaching ceramics in Scotland, according to former colleague Ian Pirie, before the department closed in 2011. It was the last single degree-level programme in ceramics left in Scotland’s art schools.\n\nBorn in Voe, Shetland, in February 1951, Bill was the second child of popular shopkeepers Maggie and John Brown. He left the islands when he was 18 to do a four-year diploma at Gray’s School of Art, Aberdeen, becoming the first in his family to attend higher education. He specialised in ceramics and, along with Pirie, was selected for a scholarship to do a post-graduate diploma.\n\nTheir external examiner was none other than David Leach, the eldest son of the famous potter Bernard Leach. The younger Leach was so impressed with their work he recommended they apply to join the elite Craftsmen Potters’ Association in London. They were accepted and became the first makers from Scotland to gain membership.\n\nBill spent the rest of the 1970s and early 1980s running a succession of potteries in Aberdeenshire and teaching part-time at Gray’s. He married my mother, Anna, and had two daughters, my sister Sunni and myself. In 1984 he left his young family and moved to North Berwick, near Edinburgh, transporting a hut from outside their small cottage in Monyroads to the backyard of ceramicist Dave Cohen. He taught part-time at Glasgow School of Art, with Cohen and Archie McCall, and at Cumbria School of Art. In 1991 he left the hut, which was by then rather damp and layered with plaster dust and cigarette ash, and moved to Glasgow to take up a full-time lecturing job at GSA.\n\nArchie McCall, who became Bill’s predecessor as Head of Ceramics at GSA, writes: “Those who worked with him were impressed by his fierce intellect, deep knowledge and mastery of language, often including self-deprecation or a wry punchline, timed to perfection. He worked tirelessly helping students from all parts of the art school, usually long into the evenings. His advice, though often reserved for the very last minutes of any review, was always the most positive, practical and succinct, even if a gentle ‘well, I might sleep on that idea if I were you’ summed up everything there was to say.”\n\nBill’s teaching and research took him to many countries including Iceland, Norway, Estonia, Hungary, Malta, Russia, the United States and Australia. Although his own work explored the use of transfer printing and other industrial processes in the context of studio crafts, his interests and expertise extended to archaeological projects with the University of Glasgow, ranging from Neolithic digs on Orkney to the recreation of pots from moulds retrieved from the site of the famous Bell’s pottery in Glasgow.\n\nHe also had an excellent ear for languages and music. He was fluent in Norweigan and German, and loved playing the fiddle – in particular Swedish folk tunes.\n\nThe year 2011 marked a new phase of his life, though not at first a good one. After investing decades of his life into GSA, the closure of the ceramics department left him deeply disappointed. Archie McCall recalls: “One of his most telling comments prior to the closure of the department at GSA in 2011 was simply: ‘I don’t believe that the human race spent millions of years evolving opposable thumbs just to text message!’.”\n\nAt this time Dad’s second marriage, to Marjorie Fernie, broke down. But ever the optimist, he started making plans: a return to his native Shetland as an independent ceramics designer. The move, which he finally made in 2013, did not dampen his interest in travel and he took the chance to work with former student Sue Mifsud, who was pottery manager of the heritage pottery Ceramika Maltija in Malta at the time.\n\n“He was the lecturer with the softly spoken voice and approachable manner and never became impatient with students,” Mifsud recalls. She invited him to give a series of lectures and workshops and to start rejuvenating the pottery’s moulds. “The pottery is still running today with much of its success due to Bill’s hard work, skill and creativity,” she says.\n\nWhen back on home soil, Billbuilt a custom-made workshop and, later, a house on a croft owned by his grandparents in Voe, Shetland. On one side the croft overlooks the house in which he was born, and on the other side the view reaches across the bay to the graveyard where his parents are buried and indeed the plot where he himself would be interred.\n\nWith typical pragmatism and poetic flair, he used the ruins of his grandparents’ ‘but and ben’ as a sheltered spot to grow kale and fruit bushes, and experimented with local clay and soapstone, which he collected himself. His work played on Shetland’s culture and natural heritage – not to mention his acute observational skills and dry wit – and was in high demand at local galleries. He fell in love with art lecturer Sólveig Aðalsteinsdóttir, and was the happiest me and my sister had seen him for many years.\n\nTragically, he did not have long to enjoy this stage of his life. After being diagnosed with lung cancer in October 2019, his health deteriorated rapidly and he died at home on February 3, a few weeks before his 69th birthday.\n\nDad described ceramics as a “timeless material”, outliving the maker and subject to re-interpretation by every successive generation.\n\n“The things we make have different meanings, the communities of makers have different places in society and a craft that is ‘high art’ in one time and place can be the lowliest of manual work in another,” he said. “Whatever we make now may well be around in a couple of thousand years’ time and will inevitably gain status in the process. Potters do have the last laugh.”\n\nBill will be remembered not only as a talented artist and teacher, but also as a loving father and grandfather, who was very proud of his family.\n\nHe is survived by Sólveig Aðalsteinsdóttir, his two daughters, and three grandchildren."}, {"url": "https://autoaction.com.au/2022/09/24/rembering-bill-brown-for-more-than-the-obvious", "page_content": "REMEMBERING BILL BROWN – FOR MORE THAN THE OBVIOUS\n\nBy Bruce Williams\n\nVALE BILL BROWN\n\nAUTO ACTION is sad to acknowledge the passing of sports and touring car racer Bill Brown who died on September 23rd at the age of 81 after a short battle with illness.\n\nSeen in the above photo with a young Dick Johnson.\n\nWhile it is the two huge crashes at Bathurst in Ford Falcons that Bill Brown is widely known for, it was his success in sports car racing in the late 60’s and early 70’s that he was most proud of.\n\nIt all began for Brown competing in some club racing in Sydney during the early ‘60’s, racing a Porsche 1600 Speedster at the Homebush and Warwick Farm circuits in NSW.\n\nAs a young man, Bill Brown was great mates with Spencer Martin, and indeed they remained close friends right up till his passing.\n\nIt was via this friendship that Brown got to know racer David McKay, later of Scuderia Veloce fame. David McKay was well known for preparing and racing cars and specialised in preparing cars for longer distance events and this led to some endurance drives for Brown and Martin.\n\nIn 1964 Brown teamed up with Martin for the 500 mile race at Bathurst and the pair won their class at in a Vauxhall Viva.\n\nThe relationship with McKay grew and saw Bill Brown racing in sports cars.\n\nIn 1966, he took a class victory in the Surfers Paradise 12Hour in a Volvo P1800 he shared with David McKay.\n\nThe relationship with McKay also gave him the opportunity to race the fabulous Scuderia Veloce Ferrari 250LM.\n\nThe 250LM delivered Brown many race wins. Indeed, Brown rated his greatest race victory as that of winning the 1967 Surfers Paradise 12 Hour. In that race he shared the victory with Greg Cusack.\n\nBrown also managed to prang the very valuable Ferrari at Warwick Farm in 1967.\n\nThe relationship with Scuderia Veloce’s David McKay also gave him the opportunity to race another fabulous Ferrari, when in 1968 McKay imported the Ferrari Can-Am 350. The Ferrari had been converted from one of the 1967 Le Mans 4.0 Litre V12 factory P4’s.\n\nOriginally imported for Chris Amon to race, Brown drove the car at a round of the Tasman Series at Longford. During the event, Brown set an Australian speed record at the tree lined Tasmanian road circuit of 182.9 MPH (294.5 Km/h), this was the fastest ever recorded outright speed at an Australian race circuit at the time.\n\nA few months later he raced the car at Bathurst and set another record for the fastest official time down Conrod straight of 181 MPH (291 Km/h).\n\nIn 1968 Brown was part of the first Holden Dealer Racing Team, racing the new HK Holden Monaro GTS 327.\n\nIt was a clandestine ‘Factory effort’ sponsored by the Sydney Daily Telegraph newspaper and put together by Scuderia Veloce’s David McKay.\n\nAlthough a Monaro delivered Holden its first ‘Great race’ win, it was a privateer in Bruce McPhee and Barry Mullholland who took the flag first.\n\nThe best placed car of the McKay managed Holden Dealer Racing Team Monaro’s was Jim Palmer/Phil West in second, while a damaged wheel put Brown and teammate Paul Hawkins Monaro out of the race.\n\nBut for most race fans, it was the two big Bathurst crashes that Brown had during the running of the 500-mile production car races that he became infamous for.\n\nIn 1969, on the opening lap he crashed the big Falcon XW GT HO on the run down the hill from Skyline after a slight touch with another competitor. It was a big crash that saw many competitors get caught up in and the race was slowed to a crawl while the wreckage was removed.\n\nAnd then in 1971, it was the huge crash at McPhillamy Park that will live long in the memories of most touring car fans.\n\nIt is a crash that is still considered to be one of the most violent ever witnessed and is regularly played in event highlight packages.\n\nWhile running competitively in the front part of the field, Brown’s XY GTHO Phase III Falcon blew a tyre in the high-speed run through McPhillamy and then after losing control and slamming into the fence, the big Falcon barrel rolled along the top of the armco narrowly missing an official and slicing the big sedan in half just behind the driver’s seat.\n\nMost who witnessed the incident feared that Brown had been killed or at least seriously injured, but after several minutes, with the help of officials and spectators Brown emerged from the wreckage with a few minor cuts and bruises and was thankful that the big Falcon had not ended up in the crowd.\n\nBrown kept racing and in the early 1970’s was still a fast peddler in 911 Porsche’s and competed in the Australian Touring Car Championship races. Later his Porsche 911 carried the Grace Bros signage.\n\nDuring the ’70’s Brown continued to race occasionally at Bathurst and last competed at Bathurst in 1978, with by then former wife Sue Ransom in Ford Capri GT 3000 Mk.1.\n\nWhile he only ever considered himself an amateur racer, he was still highly regarded for his abilities.\n\nBrown retired from a successful business life several years ago.\n\nAUTO ACTION extends our condolences to Bill Brown’s family, friends and those who knew him."}, {"url": "https://www.speedcafe.com/2012/03/09/bill-brown/", "page_content": "Bill Brown raced during the 1960s when racing drivers were classed as either semi-professional or weekend warriors.\n\nBrown admits that racing was a hobby for him throughout his career, but one that he took seriously nevertheless.\n\nDuring his career Brown owned and ran newsagencies in Sydney. This was a full time job for him, but one that still allowed him to race on weekends.\n\nHe was one of Australia’s more well known amateur drivers, noted for his class win in Bathurst alongside Spencer Martin in 1964 and the crash at the top of Mount Panorama in 1971 – the video of which is still keenly watched more than 40 years after the incident.\n\nFor Brown, an interest in cars and racing started early, but he didn’t enter his first race until he was 21.\n\n“I always had an interest in cars, when I first got my licence I bought an Austin Healy but I was never allowed to compete,” Bill Brown told Speedcafe.com\n\n“When I was 21 I said to mum that I really wanted to race and told her that for me it was always a hobby and not a professional thing.\n\n“So she gave me her blessing and I started to race.”\n\nBrown started to race in 1962 and it all began with Porsches at Homebush and Warwick Farm in New South Wales.\n\n“I had a 1600 Super Porsche which I used to drive at Homebush,” said Brown.\n\n“I was told that I drove well and was asked if I’d like to have a race and I said ‘Not really but why not’.\n\n“We went to Warwick Farm and I came second in the race and it just went from there.\n\n“I actually remember in those early days, driving a (Porsche) Speedster at Warwick Farm, where I was black flagged for not wearing protective goggles.\n\n“I argued that there was a windscreen, but my opinion fell on deaf ears.”\n\nBeing a good friend of Spencer Martin, Brown struck a relationship with David McKay – who used to race and prepare race cars – which led to some endurance drives.\n\n“David asked me to partner Spencer in some four or six hour races driving a Fiat and various other cars,” said Brown.\n\n“Spencer and I did Bathurst in the Vauxhall which we won our class in and when Spencer left to go to Bob Jane I then drove the Ferrari 250 LM for 12 to 18 months.\n\n“My biggest win at the time was the 12-hour race at Surfers Paradise with Greg Cusack.\n\n“The following year, in 1968, I took over the P4 Ferrari when Chris Amon came out here, then I took up driving Porsches.”\n\nBrown was known for racing in endurance events but he also won the Queensland Tourist Trophy and ran in the Toby Lee Series.\n\nWhile he did much of his racing driving Ferraris and Porsches, he also drove Fords and was part of the original Holden Dealer Team (HDT) to race at Bathurst.\n\n“We went to Lang Lang (Holden’s proving ground) driving the original Monaro 327 around before it was released,” said Brown.\n\n“HDT ran three cars at Bathurst, we were running reasonably well but we sliced a wheel at ‘the Cutting’ which put us out of the race.”\n\nBrown raced several cars at Bathurst, including the Monaro and a Torana, but he had more disappointment there than success\n\nHaving said that 1964 was Brown’s best year at Bathurst, where teaming up with Martin he won his class.\n\nBack then official line honors went to Bob Jane and George Reynolds, but Brown and Martin won ‘A Class’ in a Vauxhall ahead of his teammates who came second and fourth.\n\n“I was driving for Scuderia Veloce in a Vauxhall Viva and Spencer and I were able to win the class in that race,” said Brown.\n\n“It was exciting, I was fortunate that I knew some people who gave me wonderful support.\n\n“I’ve had some great cars to drive; I was able to equip myself very well.”\n\nBrown drove regularly at Bathurst but they were one-off drives. He used to go to the local dealership for his cars.\n\n“We’d basically get a car for the Bathurst weekend,” said Brown.\n\n“We wouldn’t drive it through the year; we’d drive it up to Bathurst, race and then drive it back.\n\n“You didn’t need too much practice; you should be able to come to grips with a car within 20 laps.”\n\nIf 1964 was memorable for winning his class at Bathurst, the 1971 event made Brown famous. On lap 43 Brown had one of the biggest accidents in the history of Bathurst, going off the track at the top of the mountain slicing his car in two.\n\n“This incident still gets played 40 years after it happened,” said Brown.\n\n“I was going well, I was looking after the brakes and we were running third.\n\n“We were the quickest private car. There were three works cars and we were the first privateer after them on the grid to start with.\n\n“We knew that we had a tyre problem, the tyre was rubbing.\n\n“I was actually going to pit in a couple of laps, came over the top at McPhillamy went into the corner and it just went straight ahead.\n\n“I guess I was doing 170 or 180 kilometres an hour.\n\n“In those days there was a bank there, I went up into the air onto the bank, there was a wooden fence there in those days, so it caught that and the car rolled down the fence.\n\n“The car rolled down and cut in two. I walked away from it and drove home that evening.”\n\nWhile he got out of the car and wasn’t injured the track medics wanted to take him to hospital.\n\n“I went around to have a look at the car and they said they’d take me to hospital, they wanted to put me on a stretcher, but I refused,” said Brown.\n\n“I thought, actually I won’t tell you what I said; I thought we were in trouble then there was banging and crashing and I was rested upside down.\n\n“The car didn’t have a roll cage as such, I was fortunate though when I came to rest my hat was only grazed on the left hand side, I was pretty lucky.”\n\nWhat was amazing at the time was that immediately following the accident the race kept running, unlike today when a car pulls over to the side and a safety car enters the track.\n\n“In those days it was a totally different event,” said Brown.\n\n“It was about a group of people getting together to race.\n\n“We’d buy a car off the showroom floor; we bought ours at the local Ford dealer and drove it home after the event. Today cars are purpose built.\n\n“In those days there were four or five classes and we had to contend with the faster and slower cars with a field of over 60 cars.\n\n“It was a totally different race to what it is now, it’s totally professional now.”\n\nWhile he raced several European cars, Brown also got to race during the era of the first true Australian super cars.\n\n“There were some impressive race cars back then, the XR and the GT-HO and Holden had the Monaro,” said Brown.\n\n“They were petro guzzlers, you look at them today or drive them and they were rough.\n\n“The gear shift, there was nothing very nice about it. Today they are beautiful to drive in comparison to those big brutes of things.”\n\nBrown stopped racing in the mid 1970s, but ran at Bathurst alongside his wife in 1978 before giving it away to concentrate on the business.\n\nHe has fond memories of Bathurst in 1964 and of racing several high powered cars, particularly the Ferrari P4, but admits racing throughout his life was very much a hobby.\n\n“Although we were total amateurs we were able to achieve a bit of success,” said Brown.\n\n“I stopped racing to focus on the business and while I haven’t done much racing since I have been invited to drive out at Eastern Creek on a couple of occasions and enjoyed it.\n\n“I’m retired now. I sold my last business, which was a food business, about four years ago.\n\n“Now I just wander around, do some travel with the family and muck around with a couple of cars.”\n\nBrown’s accident at Bathurst in 1971 (Note the race is still running despite the accident)"}, {"url": "https://www.britannica.com/biography/William-Wells-Brown", "page_content": "William Wells Brown, (born 1814?, near Lexington, Ky., U.S.—died Nov. 6, 1884, Chelsea, Mass.), American writer who is considered to be the first African-American to publish a novel. He was also the first to have a play and a travel book published.\n\nBrown was born to a black slave mother and a white slaveholding father. He grew up near St. Louis, Mo., where he served various masters, including the abolitionist Elijah P. Lovejoy. Brown escaped in 1834 and adopted the name of a Quaker, Wells Brown, who aided him when he was a runaway. He settled in the Great Lakes region before moving to the Boston area. In 1847 his popular autobiography Narrative of William W. Brown, a Fugitive Slave was published. Its highly dramatic content is set forth in a remarkably detached style. Having educated himself, Brown began lecturing on abolitionism and temperance reform. His antislavery lectures in Europe inspired Three Years in Europe (1852), which was expanded as The American Fugitive in Europe (1855).\n\nBritannica Quiz American Writers Quiz\n\n(Read W.E.B. Du Bois’ 1926 Britannica essay on African American literature.)\n\nBrown’s only novel, Clotel (1853), tells the story of the daughters and granddaughters of President Thomas Jefferson and his slave Currer. His only published play is The Escape; or, A Leap for Freedom (1858), a melodrama, with notable comic moments, about two slaves who secretly marry. Brown’s historical writings include The Black Man (1863), The Negro in the American Rebellion (1867), and The Rising Son (1873). His final book, My Southern Home (1880), contains miscellanea about slave life, abolitionism, and racism.\n\n(Read Henry Louis Gates, Jr.’s Britannica essay on \"Monuments of Hope.\")"}, {"url": "https://www.billbrownmusic.com/bio", "page_content": "About Bill\n\nAward-winning composer Bill Brown is best known for scoring all nine seasons of the hit CBS series 'CSI: NY', as well as writing epic scores for games such as 'Wolfenstein', 'Lineage II', 'Captain America: Super Soldier', Tom Clancy's 'Rainbow Six' and many more. His scores for film include 'The Devil's Tomb', with Cuba Gooding Jr., 'Desiree', starring Ron Perlman, the action-thriller 'Infamous' starring Bella Thorne and Jake Manley, and the epic sci-fi series ‘Dominion’.\n\nAccolades for his music include PCXL Magazine's Best Music Award for Tom Clancy's Rainbow Six, Nine BMI awards, and the Music4Games Editor's Choice Award. His scores have also received nominations from the British Academy of Film and Television Arts (BAFTA), The Game Audio Network Guild and more.\n\nIn 2018, Bill released 'Dreamstate', a personal album project that combines his passion for analog synths, piano and live orchestra (www.dreamstateproject.com). And in 2019, Bill conducted a 110 piece orchestra performing his music from 'Lineage II' live in concert.\n\nBill resides in Los Angeles and is represented by Randy Gerston at Fortress Talent Management."}, {"url": "https://www.billbrownmusic.com/", "page_content": "About Bill\n\nAward-winning composer Bill Brown is best known for scoring all nine seasons of the hit CBS series 'CSI: NY', as well as writing epic scores for games such as 'Wolfenstein', 'Lineage II', 'Captain America: Super Soldier', Tom Clancy's 'Rainbow Six' and many more. His scores for film include 'The Devil's Tomb', with Cuba Gooding Jr., 'Desiree', starring Ron Perlman, the action-thriller 'Infamous' starring Bella Thorne and Jake Manley, and the epic sci-fi series ‘Dominion’.\n\nAccolades for his music include PCXL Magazine's Best Music Award for Tom Clancy's Rainbow Six, Nine BMI awards, and the Music4Games Editor's Choice Award. His scores have also received nominations from the British Academy of Film and Television Arts (BAFTA), The Game Audio Network Guild and more.\n\nIn 2018, Bill released 'Dreamstate', a personal album project that combines his passion for analog synths, piano and live orchestra (www.dreamstateproject.com). And in 2019, Bill conducted a 110 piece orchestra performing his music from 'Lineage II' live in concert.\n\nBill resides in Los Angeles and is represented by Randy Gerston at Fortress Talent Management."}, {"url": "https://www.sportscasting.com/boston-celtics-john-havlicek-was-teammates-with-jim-brown-and-bill-russell-in-the-same-week/", "page_content": "Boston Celtics great John Havlicek was drafted by the Cleveland Browns in 1962 even though he didn't play college football.\n\nJohn Havlicek played all 16 years of his illustrious NBA career with the Boston Celtics. “Hondo” was a 13-time NBA All-Star and an eight-time champion who had his share of signature moments with the Celtics.\n\nHavlicek was much more than the guy who stole the ball. He went on to have a Hall of Fame career in the NBA. In order for it all to happen, he had to turn in his cleats for sneakers.\n\nJohn Havlicek was drafted by the Cleveland Browns and the Boston Celtics in 1962\n\nBoston Celtics green coach Bill Russell, left and white coach Red Auerbach, right, argue with an official as John Havlicek stands by during the Celtics Legends game in Boston, Jan. 5, 1985. | John Blanding/The Boston Globe via Getty Images.\n\nHavlicek was a three-sport star at Bridgeport (Ohio) High School — an All-Stater in basketball, football, and baseball. He took his talents to Ohio State, where he played basketball for three seasons. As a senior, the 6-foot-5 guard/forward put up his best season, averaging 17.0 points and 9.7 rebounds.\n\nHavlicek’s hometown NFL team, the Cleveland Browns, took a shot with him in the 1962 NFL Draft. They hoped he could help at wide receiver, so they used a seventh-round pick to snag him. Havlicek hadn’t played a down of football since quarterbacking his high school team as a senior. The Celtics also grabbed the versatile Havlicek in the 1962 NBA Draft, using the ninth overall selection.\n\nMore surprising than the Browns selecting Havlicek was the fact that Havlicek actually showed up at Browns camp with hopes of making the team.\n\nAccording to the Pro Football Hall of Fame, Havlicek appeared in one preseason game against the Pittsburgh Steelers and didn’t catch a pass. Archives show he had a key block that set Hall of Fame running back Jim Brown free for a 45-yard touchdown.\n\nFour days later, coach Paul Brown released Havlicek so he could focus on his basketball career. He quickly signed with the Celtics, and the rest is history.\n\nHavlicek then teamed up with Bill Russell on the Celtics\n\nHavlicek clearly took the path to success when he settled on basketball. As a rookie with the Celtics, he made an immediate impact. He played in all 80 games, averaging 14.3 points and 6.7 rebounds.\n\nHavlicek went to the NBA Finals in his first seven seasons, winning six championships during that stretch. He’s remembered for his steal in the 1965 Eastern Conference Finals against the Philadelphia 76ers that secured a Celtics victory in Game 7. With Boston clinging to a 110-109 lead, Havlicek tipped a pass intended for Chet Walker to Sam Jones, who dribbled out the final seconds.\n\nLongtime Celtics announcer, the late Johnny Most, made the famous “Havlicek stole the ball” call that lives on forever.\n\nHavlicek was a strong two-way player for Boston, averaging 20.8 points over his career. He also was an eight-time All-Defensive player.\n\nHavlicek, who died in 2019, was known for his stamina. He’d outrun and outhustle every opponent, which often resulted in easy transition baskets.\n\n“He didn’t really shoot from the outside or dribble that much,” said former teammate Tommy Heinsohn in April 2019, per The New York Post. “But he was like a wide receiver in football, and he would run and catch long passes from (Bob) Cousy for layups.”\n\nHe was a wide receiver, if only for one preseason game."}, {"url": "https://www.espncricinfo.com/cricketers/bill-brown-4225", "page_content": "WA (Bill) Brown was an outstanding opening batsman and excellent fieldsman for Australia on either side of the Second World War, his achievements perhaps overshadowed by his more lauded contemporaries. He averaged nearly 47 in Tests, and over fifty in first-class cricket, making 39 first-class hundreds. He would have undoubtedly played more Test cricket if it were not for the war. An unspectacular bat, he was a superb glancer, and deft placer of the ball. He had a full range of shots, however, and was hard to tie down.\n\nBrown's cricket career got off to a most inauspicious start when in his debut first-class innings for New South Wales in 1932 he was run out for a duck without facing a ball. He made a good impression in the Sheffield Shield, and to the surprise of some was picked to tour England in 1934. He had an outstanding tour; his 119 against Lancashire earned him a place in the first Test, where his second innings 73 helped Australia earn victory after Woodfull, Ponsford and Bradman had failed. He made his debut Test hundred in the second Test, as Australia experienced a rare loss at Lord's, and was promoted to open with Ponsford in the third Test where he made a useful 72. He failed in the final two Tests, but had proven himself as a Test player of class, ending up third in the Test averages.\n\nHe scored consistently on the 1935-36 tour of South Africa, with four fifties and a century in the five Tests, but was less successful in the two home Tests he played against England. 1936 saw him accept a coaching position in Brisbane and he represented Queensland from 1936-37. In 1937-38 he was appointed Queensland captain and by 1938 he was at the height of his ability, and stood out in a side marked by outstanding batsmen (Bradman, Fingleton, McCabe and Hassett). He made a century in the first Test after Australia had followed on, and he carried his bat for a superb unbeaten 206 at Lord's. He missed the third Test through injury, but was the top Australian scorer in either innings at the Oval Test so dominated by Hutton.\n\nDuring the war he served in the Pacific with the RAAF as a flight lieutenant. After the war he was not the dominating player he had been before, and he had lost possibly his most productive cricket years. He did captain Australia in their inaugural Test against New Zealand, presiding over a 2-day rout, and making the highest score of the match. In the final Test against India in 1947-48 he was most unluckily run out for 99, but was chosen to tour England with the \"Invincibles\" in 1948. He played in the first two Tests but then lost his place to Neil Harvey. He made eight centuries on that tour, but with the advent of fine young players like Morris and Harvey, he retired at the end of the following season after captaining the Australian second team to New Zealand. He was a Queensland selector from 1950-51 to 1959-60 and an Australian selector in 1952-53. In 1992 the Queensland Cricket Association elected him a life member.\n\nA likeable, popular and modest man was awarded Medal of the Order of Australia in 2000 for services to cricket. He died on March 16, 2008, aged 95, after being ill for a few months.\n\nDavid Liverman"}, {"url": "https://www.espncricinfo.com/wisdenalmanack/content/story/429601.html", "page_content": "Obituary, 2009\n\nBill Brown\n\nBROWN, WILLIAM ALFRED, OAM, died on March 16, 2008, aged 95. Bill Brown was Australia's oldest Test cricketer, and when he died his contribution to the country's cricket was immediately eulogised in the Australian parliament by the leaders of both main parties.\n\nThe journalist Ray Robinson called Brown \"the most serene batsman I ever saw play for Australia\". His approach was not one of extravagance or power, but based on an immaculate defence, out of which grew the ability to cut precisely and unfurl the occasional restrained drive. Above all, though, there was his predilection for the on side, crowned by the delicacy of his grass-hugging leg-glance. Brown was never regarded as a crowd-pleaser, though his highest first-class score of 265 not out, against Derbyshire in 1938, came at almost a run a minute. Perhaps Australian spectators never quite realised his quality: injury decreed that only five of his 22 Tests were at home, while his greatest deeds were performed in far corners of foreign fields.\n\nBrown's dairy-farmer father moved the family from rural Queensland to Sydney in 1914; by the time he was 20, the son was playing for his adopted state, making 69 against the Bodyline attack in his first season. Controversially selected, aged 21, ahead of Jack Fingleton for the 1934 Ashes tour, Brown adapted well to English conditions, passing 70 in each of the first three Tests, including 105 in the defeat at Lord's. \"The boy Brown\" was lauded by Neville Cardus in the Manchester Guardian, for playing \"with a bat as straight as a tall hat, immaculate and calm and ever so old-headed.\" Cardus added: \"He is a young man who, I imagine, never gets into a state about anything.\" Brown was even more prolific in South Africa in 1935-36, when he and Fingleton put together three century Test opening stands (and two more in the nineties), their best effort coming at Cape Town where they each made hundreds in a partnership of 233. He also joined Fingleton in the menacing squad of short legs for the bowling of Bill O'Reilly and Clarrie Grimmett. An injured thumb kept Brown out of the start of the 1936-37 Ashes series but, back in England in 1938, he made centuries in the first two Tests, his 206 at Lord's being the first double by a batsman carrying his bat in a Test. \"I have seldom seen a young man play the veteran's part as easefully as Brown did today,\" wrote Cardus this time. England seemed to face the prospect of bowling at him for years.\n\nIn 1936-37 Brown had returned to Brisbane, attracted by the offer of secure employment as a car salesman. His presence provided much-needed stiffening to a vulnerable Queensland side; a year later he became captain and in 1938-39 he hit 990 runs in six Sheffield Shield matches at an average of 110. But Brown had other enemies to face now besides England: he joined the Royal Australian Air Force, serving as a pilot of transport and supply planes in the Pacific and achieving the rank of flight-lieutenant.\n\nHaving captained the Australian side to New Zealand in 1945-46, where the single representative match was accorded Test status retrospectively, Brown missed all of the following season's Ashes series because of a broken thumb. During the inaugural visit of the Indians to Australia in 1947-48, he gained notoriety because of his carelessness in being twice run out at Sydney by Vinoo Mankad for backing up too far, initially in the Australian XI game in which Don Bradman scored his 100th hundred, and then again in the second Test. Fifty years later, Brown was characteristically insisting that the incidents were his own fault and that the bowler had warned him on each occasion. On top of that, he was run out in the fifth Test on 99 (his only home Test fifty) by a smart return to the keeper from Mankad. Running out the non-striker while he is backing up is still known as \"Mankading\" in Australia.\n\nBrown was part of Bradman's great 1948 team in England, but the successful opening partnership of Sid Barnes and Arthur Morris meant that he was moved to the middle order and then dropped after two quiet Tests, even though he averaged 57.92 for the tour overall, with eight centuries. He retired in 1950, having already opened a sports store in Brisbane, which was an immediate success. He was a state selector throughout the 1950s and a national selector in 1952-53. Brown grew old gracefully, attending the Brisbane and Sydney Tests annually with dignity and wry self-deprecation. \"He was the most reticent cricketer I've ever known,\" said the writer David Frith. \"Not just modest, but intensely modest. Even when he came to the press box at Lord's, he wouldn't talk about his batting there. He wanted to talk about the other people. It was sad in a way.\" Brown, the last surviving pre-war Wisden Cricketer of the Year, was much admired by the modernday Australian team, and Steve Waugh would get him to present the baggy green cap to Test debutants.\n\n© Wisden Cricketers' Almanack"}]}