{"Bill Brown won four Scottish League titles, four Scottish Cups, and two Scottish League Cups during his time at Celtic.": [{"url": "https://www.bbc.co.uk/sport/football/50203529", "page_content": "Last updated on .From the section Scottish\n\nJohn Robertson was one of six former players to be inducted into Scottish football's hall of fame\n\nInverness CT boss John Robertson was one of six former players to be inducted into Scottish football's hall of fame on Sunday night.\n\nRobertson finished his playing career as Hearts' all-time leading scorer with 214 goals.\n\nColin Stein and Tommy McLean, who won the European Cup Winners Cup with Rangers in 1972, also made it.\n\nThey were joined by Aberdeen striker Joe Harper, Celtic's Patsy Gallacher and Dundee United's Paul Sturrock.\n\nStein commanded the first six-figure player transfer between two Scottish clubs when Rangers paid Hibernian £100,000 for his services in 1968.\n\nHe scored one of Rangers' three goals against Dynamo Moscow as they lifted the ECWC.\n\nTeam-mate McLean had spells at Kilmarnock, Rangers and Motherwell. He helped Killie win the Scottish First Division in 1965, before earning a further 10 domestic honours at Ibrox.\n\nAs manager, he led Motherwell to the 1991 Scottish Cup, defeating brother Jim's Dundee United in the final.\n\nHarper is best remembered for his two spells at Aberdeen between 1969 and 1972, and again in 1976-1981, where he became the club's record goal scorer. He managed to win all three domestic trophies while at the Dons.\n\nHe also holds the unique accolade of scoring a hat-trick for Hibernian in the 1974 Scottish League Cup final but still ending up on the losing side.\n\nNicknamed \"The Mighty Atom\", Patsy Gallacher signed for Celtic in 1911 and stayed for 14 years, making 464 appearance and scoring 195 goals.\n\nHe won six league titles, four Scottish Cups and four Glasgow Cups. One of his most famous moments came during the 1925 Scottish Cup Final when he scored by somersaulting over the goal line with the ball between his feet.\n\nPaul Sturrock spent his entire playing career with Dundee United, and in 385 appearances he scored 109 goals, winning the club's only league title to date in 1983 and scoring in both League Cup final wins in 1979 and 1980."}, {"url": "https://www.footiecentral.com/20190327/celtic-vs-rangers-rivalry-history-head-to-head-trophies/", "page_content": "Introduction\n\nOn 31st March 2019, two teams will meet for the 416th time in what is arguably the most fiercely contested derby in Europe. The Old Firm contest – Celtic vs Rangers is much more than a football match between two sides from the south-west and the east of Glasgow. It is a clash of identities in which a potent mix of religion, politics and history is intertwined – the Union Jack versus the Irish Tricolour, Protestant against Catholic, Unionism as opposed to Socialism.\n\nFans of rival clubs in other cities may dislike each other sometimes, but often, away from football, they can be friends, lovers, or even members of the same family. This is true too with Celtic and Rangers but much less so, and it is rare that, with other teams, you find sections of the fan base with such visceral hatred of their opponents as you will find in Glasgow. That means that before and after the match this March both the hospitals and jails are likely to be full with the victims and perpetrators of such dislike. Parkhead that day will be no place for the faint-hearted.\n\nRangers vs Celtic: The Historical Roots\n\nHowever, to understand how we got here, it is necessary to delve into the history of both Britain and Northern Ireland, because the origins of the present problems date centuries back. Although originally a Catholic country, following the Protestant and Scottish Reformations in the 16th century, Scotland adopted Presbyterianism as the State religion, forcing Catholics into a minority position in the country. Then in the late 19th and early 20th century, a wave of economic migrants from Northern Ireland, both Protestant and Catholic came to Glasgow seeking jobs, bringing with them the politics and disputes of that region.\n\nHowever, when Rangers was formed in 1872, many of those factors had yet to emerge. Founded by four men – William McBeath, Peter Campbell, and two brothers Moses and Peter McNeil – Rangers had a Protestant identity from the start but not an overt one. And while Celtic, founded 16 years later in 1888, had its roots firmly in Irish Catholicism, relations between the two clubs were initially cordial. It was Rangers who provided Celtic with their first opponents, and, within a few years, the clubs were travelling to away matches together. They became so close, in fact, that the Press coined the phrase “Old Firm” to describe how the pair had established a cosy monopoly over the Scottish game.\n\nHarland and Wolff\n\nIf the schism between the two clubs and communities can be traced back to a single event, it was the opening of a huge shipyard in Govan by Belfast shipyard Harland and Wolff in 1912 in Govan, just a short distance away from Rangers’ home ground in Ibrox. The company had a “Catholics need not apply” employment policy, and with many of the club’s supporters now working in the shipyard, Rangers moved to becoming increasingly a Protestant and Unionist club. As a reaction, Celtic, which already had a Catholic fan base, became associated with Irish Nationalism and socialism as well.\n\nAttitudes then became hardened in the following decade, as fans reacted to events like the 1916 Easter Uprising in Dublin, and the heavy losses of both Scottish and Irish regiments during the First World War.\n\nFrom that date, Rangers adopted an unwritten policy of not signing any Catholic players, a taboo that stayed in place until Graeme Souness in 1989 recruited Mo Johnston. For their part, Celtic had a more egalitarian outlook, and some of the most iconic figures in their history have, in fact, been Protestants – Jock Stein, Kenny Dalglish, and Danny McGrain, for example.\n\nNeil Lennon\n\nIn fact, nothing exemplifies the bitterness and the rancour of the derby than the story of the present Celtic manager, Neil Lennon. Born a Catholic in what used to be predominantly Protestant Northern Ireland he grew up supporting Celtic as a boy, and after a career that took him to Crewe Alexandra, Manchester City, and Leicester City, he ended up playing for them between 2000 and 2007. He also played for the Northern Irish national side, and captained the team, but Lennon was forced to quit international football when he received death threats before a match against Cyprus, after claiming he wanted to play for a team representing a United Ireland. The outlawed Protestant terror group the Loyalist Volunteer Force later denied responsibility for the threats.\n\nBut the threat of sectarianist violence was never far from the scene. In 2003 he was attacked by two students near his home, and a year later a road rage attack on a local motorway led to a man being fined £500. Then in 2008 two men knocked him unconscious when he was leaving a pub.\n\nIn 2011 things went a step further. In January of that year, packets of bullets were sent to him and his player Niall McGinn, who had transferred from Irish club Derry City to Celtic two years previously. Then later that year, Lennon, along with two other prominent Celtic supporters, lawyer Paul McBride and politician Trish Godman were sent parcel bombs packed with nails, which were later described by police as viable. The two men eventually convicted of the crime were both ardent Rangers supporters, and one Trevor Muirhead, had strong links with Protestant loyalist organisations.\n\nCeltic vs Rangers: The wider picture\n\nSectarian violence is not confined to Glasgow it should be said, with Heart of Midlothian and Hibernian also divided on religious and cultural lines, although their Edinburgh rivalry is less bitter and acrimonious than that between Celtic and Rangers. Broadly speaking, Hearts are associated with Protestantism and Hibs with Catholics. The rivalries do overlap though. In 2011 a Hearts fan invaded the pitch, shouted and swore at Celtic manager Neil Lennon during a match between the two clubs. He was sentenced to 8 months in jail for a breach of the peace. And, to bring things right up to date, a Hibernian fan was arrested by police for man-handling Rangers captain James Tavernier as he went to take a throw-in during a game in March 2019. However, it is in Scotland’s largest city that the fault-lines are most prominent.\n\nRangers vs Celtic: Recent Developments\n\nWith the influx of foreign players into the game, the two teams that face each other later this month will likely contain men from various nationalities, and political, religious and cultural affiliations.\n\nOver the years as societal attitudes changed, and the political landscape in Ulster embraced the Good Friday Agreement in 1995 and the cessation of violence in Northern Ireland itself, the sectarian elements in the Celtic-Rangers rivalry appear to have become ameliorated.\n\nHowever, three elements in recent years have combined to bring tensions to the fore again – the rise of social media, the Scottish Referendum in 2014, and the liquidation of the original Rangers club in 2012.\n\nSocial Media\n\nThe role of social media in helping to spread and encourage support for extreme views, is a complex subject, and beyond the scope of this article. However, a 2017 study on the role of social media in encouraging sectarianism in Scotland found that the biggest single factor in its spread was football (76%), followed by Orange Order marches (73%) and Republican marches (63%), two factors which also help fuel the Celtic-Rangers enmity. Nearly half (48%) of respondents interviewed described the use of sectarianist language on social media in Scotland as a big problem, whilst a further 36% labelled it a “small problem”.\n\nScottish Referendum\n\nIn 2014 Scotland held a referendum on whether it wanted to break away from the rest of the United Kingdom and become an independent sovereign nation. Those living outside the country may be surprised to know that Scottish flags are rarely seen at an Old Firm match. Instead Rangers fans will brandish Union Jacks, whilst their Celtic counterparts will wave the Irish Tricolour.\n\nHowever, although many Rangers supporters would have voted for Independence, whilst Celtic fans would have voted to stay in the UK, broadly speaking Rangers are pro-Unionist and, therefore, in favour of remaining part of the United Kingdom, whilst those of the green and white persuasion would prefer an independent nation.\n\nScotland voted 55%/45% to stay in the United Kingdom.\n\nRangers Liquidation\n\nIn a bid to remain successful and competitive at the top level in the late 1990s, Rangers began to exploit a legal loophole called Employee Benefit Trusts (EBTs) as a way of paying players, and avoiding tax. Although the EBTs were legal at the time, the way that Rangers used them was not, enabling them to acquire players – and win trophies – that they otherwise could not afford. When EBTs were subsequently outlawed, the club was faced with an enormous tax bill that it simply could not meet.\n\nIn the end, the holding company that owned Rangers were forced into liquidation in 2012. A new company bought them, and the club was forced to reconstitute itself and reapply to the league, joining at the lowest tier of Scottish professional football in League Two.\n\nIt took them four years to climb back to the Premiership, and, apart from the occasional cup game, there were no derbies in that period. In their absence, Celtic established themselves as the dominant force in the Scottish game, winning seven Scottish Premier League titles, three Scottish Cups, and four League Cups.\n\nSome Celtic fans have taunted their Rangers counterparts by claiming that their newly formed club are just parvenus with no history. Yet, whilst there were a section of Celtic fans who professed not to miss their old rivals, TV companies, broadcasters and club treasurers certainly did. No other games in Scotland come close in terms of how much money is generated from them.\n\nCeltic vs Rangers: Tragedies and Controversies\n\nNo other match in British football has seen so many tragedies and controversies, on and off the pitch.\n\nThe worst incident came in 1971 at Ibrox, home of Rangers. It was a stadium that had seen its share of deaths before. In 1902, 25 people died and 517 people were injured when part of a stand collapsed during a Scotland and England match. Two people were killed in a crush on a stairway in 1961, and, both in 1967 and 1969, there were injuries on the notorious Stairway 13. Two years later, disaster struck in an Old Firm match. With Celtic leading heading into injury time, thousands of Rangers fans tried to leave early. However, their side conjured a late equaliser, causing pandemonium and a deadly crush. 66 people died, and more than 200 people were injured. It was the worst British stadium disaster before Hillsborough, which happened 18 years later.\n\nSadly, deaths have not been confined to the stadium. There have been numerous fights and stabbings amongst rival fans, and the threat of violence is never far from the surface.\n\nAnother flashpoint came after the 1980 Scottish Cup Final, which Celtic won by a single goal. However, that was completely overshadowed by the aftermath which saw rival fans battle on the pitch, using bottles, cans, bricks, wooden staves and iron bars. More than 200 people were arrested, and an alcohol ban was imposed on fans attending Scottish matches. Both clubs were fined heavily, and the matter was also discussed in the British parliament.\n\nAs for red and yellow cards, the fixture is littered with them. There have been so many that it is hard to single any match out, but the 2011 derby is particularly memorable. Rangers finished the match with only 8 men, Steven Whittaker, Madjid Bougherra and El-Hadji-Diouf all getting their marching orders, whilst, after the game, the two managers, Lennon of Celtic, and McCoist of Rangers, squared up to each other on the touchline.\n\nSix years earlier, Lennon, still a Celtic player at the time, was sent off for dissent after the final whistle, joining team mate Alan Thompson who had already been dismissed (Thompson was a serial offender in derbies, getting three red cards in his time with Celtic).\n\nRangers vs Celtic: Head to Head\n\nAs the head to head record show, Rangers currently have a very slight edge in head-to-head encounters.\n\nMatches Rangers Wins Celtic Wins Draws 415 160 156 99\n\nRangers vs Celtic: Trophies Won\n\nMajor Trophies Won Rangers Celtic Scottish First Division/Premiership 54 49 Scottish Cup 54 49 Scottish League Cup 27 18 European Cup/Champions League 1 UEFA Cup Winners Cup 1 Total 115 106\n\n*Data Tabulated 27th March 2019\n\nConclusion\n\nWhilst the passions and sentiments that underpin the Celtic-Rangers rivalry may seem parochial to an audience outside Scotland, they inform one of the most bitter enmities between two clubs to be found anywhere on earth. Of course there are many well-behaved and mild-mannered supporters of both clubs, but there is a hard core for whom such fixtures provide a focus for religious and political bigotry that would otherwise have no outlet in polite society.\n\nExpect more headlines to be written after their next match, not all of them, ostensibly at least, to do with football."}, {"url": "https://historyandthings.com/2021/12/11/scottish-footballs-most-successful-clubs-ever-may-2021/", "page_content": "The ARL Football Success Ranking System for men’s European club football establishes for certain the clubs most successful of each nation and in the whole of Europe.\n\nIt is a system of scoring points to clubs based on what trophies and how many have been won.\n\nDifferent trophies score different points and are based on a ‘glory’ criteria.\n\nOnly ‘competitive football’ trophies are considered.\n\nCompetition Key Points UEFA SC: UEFA Super Cup\n\n2 LC: League Cup (Scottish League Cup)\n\n2 FIFA CWC: Intercontinental Cup / FIFA Club World Cup\n\n3 AC: Association Cup (Scottish FA Cup)\n\n3 UEFA ECL: UEFA Europa Conference League\n\n4 UEFA EL: UEFA Cup / Europa League\n\n6 UEFA CWC: UEFA Cup Winners Cup\n\n6.5 UEFA CL: UEFA European Cup / Champions League\n\n8 T: Top Tier League Title (Division 1 / Scottish Premiership)\n\n7\n\nScotland, its Premiership and ‘Old Firm’\n\nAs one of football’s ‘Home Nations’, Scotland’s football spans three centuries. The Scottish Cup is the 2nd oldest in the world and its clubs have been fighting it out for National Championships since 1890.\n\nA number of countries have stand-out giants of the game which dominate their leagues. Scotland is famous for two of these giants and their ferocious, all consuming rivalry is known as the ‘Old Firm’. It has been ever-present and completely overshadows the Premiership. Both clubs subsequently have ginormous Success Point hauls leaving scraps for the rest. Just these two clubs make it into the ‘Big 100+’ yet have almost 1100 Success points between them! – As good a testament to Glasgow’s age old dominance over Scottish league football as any.\n\nThe Premiership prospered after WW2 but it just couldn’t keep up with the sort of money neighbouring England’s Premier League could attract. 21st Century Scottish football is comparatively poor as a result. Clubs between leagues 6-10 of the UEFA Coefficient score -2 points per domestic trophy. The SP is 9th in the Coefficient as of 2023.\n\nScottish clubs have had some success in Europe, winning 3 major trophies between them including the first UEFA trophy in the whole of Britain. They have 23 Success Points from UEFA competitions.\n\nScroll to the bottom to view the table of Scotland’s 17 most successful clubs\n\n5. Hibernian FC\n\nPoints: 43\n\nEarliest Trophy Won: Scottish Cup, 1887\n\nLatest Trophy Won: Scottish Cup, 2016\n\nMost Successful Manager: Hugh Shaw – 21 points (1948-1961)\n\nMost Successful Decade: 1950s, 14 Points\n\n‘The Hibees’ won their first ever major trophy, a Scottish Cup, in the same year as Queen Victoria’s Golden Jubilee. In 1903 they won another cup followed by their first Title the year after.\n\nHibs’ glory period followed World War Two when the club were crowned Scottish champions three times in just four years. With an attacking forward line known as the ‘Famous Five’, Hibs were arguably one of the best teams in Britain. They have also won three Scottish League Cups, including the latest in 2007.\n\n4. Heart of Mithlothian FC\n\nPoints: 60\n\nEarliest Trophy Won: Scottish Division 1, 1891\n\nLatest Trophy Won: Scottish Cup, 2012\n\nMost Successful Manager: Tommy Walker – 25 Points (1951-1966)\n\nMost Successful Decade: 1950s, 23 Points\n\n‘The Jambos’ were one of the best teams in Scotland, and indeed the world, towards the end of the 19th Century by being crowned Scottish champions on two occasions (and were even ‘World Champions’ in 1902 by beating Tottenham Hotspur at Tynecastle) They also won the Scottish Cup four times before 1906.\n\nHearts enjoyed another glorious period with Tommy Walker as manager in the 1950s and ’60s. With club legends like John Cumming and Dave Mackay, Hearts would clinch another two Scottish Titles and five domestic cups. A memorable 5-1 thrashing over Edinburgh rivals Hibernian FC to win the Scottish Cup in 2012 is Hearts’ latest trophy won. They are the most successful club in Edinburgh.\n\n3. Aberdeen FC\n\nPoints: 69.5\n\nEarliest Trophy Won: Scottish Cup, 1947\n\nLatest Trophy Won: Scottish League Cup, 2014\n\nMost Successful Manager: Sir Alex Ferguson – 43.5 points (1878-1986)\n\nMost Successful Decade: 1980s, 41.5 Points\n\nAs Scotland’s 3rd most successful club, outside the Old Firm’s heady heights, ‘The Dons’ of Aberdeen have done well for themselves, clinching major trophies in every decade since the 1940’s apart from the 2000s.\n\nAberdeen FC won its first Title in 1955. It then revelled in a glory period under a manager who would go on to become one of the greatest managers in modern history. Under Alex Ferguson’s guidance, the club won three Titles, four Scottish Cups and a League Cup. He also lead them to a UEFA CWC, beating mighty Real Madrid in the final, plus Scotland’s first UEFA Super Cup – all this in the space of seven years.\n\n2. Celtic FC\n\nPoints: 534\n\nEarliest Trophy Won: Scottish Cup, 1892\n\nLatest Trophies Won: Scottish Premiership, Scottish Cup and League Cup, 2023\n\nMost Successful Manager: Willie Maley – 154 Success points (1897-1940)\n\nMost Successful Decade: 2010s, 91 points.\n\nThis Glaswegian club was founded by a Catholic priest as a means of raising money to alleviate poverty in the slums. 5 years later they would beat Rangers in their first ever game 5-2, then described as a ‘friendly encounter’.\n\nFew clubs reach the stratospheric 500+ Success Point mark. To do this, Celtic have been filling their boots with silverware almost non-stop. This includes winning over a quarter of all Scottish Cups. They’ve won Titles every decade except the 1940s. The ‘50s was a lean decade, as other clubs such as Hibernian FC enjoyed success, so too were the ‘90s which betrayed the fact Celtic’s stewards had failed to keep abreast of rising commercial revenue streams which had begun to infuse football across Europe.\n\nThe Bhoys managed 6 Titles in a row from 1905-1910; 9 from 1966-74 plus 9 consecutively from 2012-2020. These are not the sorts of winning streaks seen at all often with other giant clubs!\n\nUnder club manager legend, Jock Stein, The Celts would claim their first quadruple in 1967 managing to grab Scotland’s first and only European Cup as well. It was a feat that’s never been matched south of the border; an ‘annus mirabilis‘ for Celtic. Celtic took full advantage of Rangers’ exile from the top flight to achieve an ‘invincible’ season – and sixth treble – under Brenden Rogers in 2017.\n\n1. Rangers FC\n\nPoints: 554.5\n\nEarliest Trophy Won: Scottish Division 1, 1891\n\nLatest Trophy Won: Scottish Cup, 2022\n\nMost Successful Manager: Bill Struth – 160 Success points (1920-1954)\n\nMost Successful Decade: 1990s, 93 points\n\nRangers FC were founded all the way back in 1872. Those first 19 years before its first major trophy was a rare period when Scottish football was free of the Old Firm’s vice like grip; when only the Scottish Cup was to play for at national level, before the first National Championship in 1890. Rangers would win the 2nd edition in 1891.\n\nLike its Glaswegian rival Celtic, Rangers’ trophy cabinet is absolutely festooned with shiny metal, including a UEFA Cup Winners’ Cup (CWC) won in 1972. Rangers have won at least 50% of Titles in 4 out of the 13 decades Scottish Championships have run, and almost half of Scottish Titles total and in every decade since the 1890s.\n\nAfter ‘The Gers’ latest League/LC double in 2011 something unfathomable happened; Rangers went into administration due to financial mismanagement and re-emerged in the Scottish 4th tier. They returned stronger 5 seasons later, however, to win their 55th Title in 2021.\n\nRangers FC is Scotland’s most successful club and the 2nd most successful in all of Europe!\n\nCompetition Key\n\nPoints UEFA SC: UEFA Super Cup\n\n2 LC: League Cup (Scottish League Cup)\n\n2 FIFA CWC: Intercontinental Cup / FIFA Club World Cup\n\n3 AC: Association Cup (Scottish FA Cup)\n\n3 UEFA ECL: UEFA Europa Conference League\n\n4 UEFA EL: UEFA Cup / Europa League\n\n6 UEFA CWC: UEFA Cup Winners Cup\n\n6.5 UEFA CL: UEFA European Cup / Champions League\n\n8 T: Top Tier League Title (Division 1 / Scottish Premiership)\n\n7\n\nScotland’s 17 Most Successful Clubs\n\nPosition Club Sub-point Totals Success Point Total 1 Rangers FC LC: 27 x 2 = 54\n\n\n\nAC: 34 x 3 = 102\n\n\n\nUEFA CWC: 1 x 6.5 = 6.5\n\n\n\nT: 55 x 7 = 385\n\n\n\n+7 (Trebles) 554.5 2 Celtic FC LC: 21 x 2 = 42\n\n\n\nAC: 35 x 3 = 105\n\n\n\nCL: 1 x 8 = 8\n\n\n\nT: 53 x 7 = 371\n\n\n\n+8 (Trebles) 534 3 Aberdeen FC UEFA SC: 1 x 2 = 2\n\n\n\nLC: 6 x 2 = 12\n\n\n\nAC: 7 x 3 = 21\n\n\n\nUEFA CWC: 1 x 6.5 = 6.5\n\n\n\nT: 4 x 7 = 28 69.5 4 Heart of Midlothian FC LC: 4 x 2 = 8\n\n\n\nAC: 8 x 3 = 24\n\n\n\nT: 4 x 7 = 28 60 5 Hibernian FC LC: 3 x 2 = 6\n\n\n\nAC: 3 x 3 = 9\n\n\n\nT: 4 x 7 = 28 43 6 Queen’s Park FC\n\nAC: 10 x 3 = 30\n\n30 7 Kilmarnock FC LC: 1 x 2 = 2\n\n\n\nAC: 3 x 3 = 9\n\n\n\nT: 1 x 7 = 7 18 =8 Dundee United FC LC: 2 x 2 = 4\n\n\n\nAC: 2 x 3 = 6\n\n\n\nT: 1 x 7 = 7 17 =8 Dumbarton FC AC: 1 x 3 = 3\n\n\n\nT: 2 x 7 = 14 17 10 Dundee FC LC: 3 x 2 = 6\n\n\n\nAC: 1 x 3 = 3\n\n\n\nT: 1 x 7 = 7 16 11 Motherwell FC LC: 1 x 2 = 2\n\n\n\nAC: 2 x 3 = 6\n\n\n\nT: 1 x 7 = 7 15 12 Third Lanark AC AC: 2 x 3 = 6\n\n\n\nT: 1 x 7 = 7 13 13 St Mirren FC LC: 1 x 2 = 2\n\n\n\nAC: 3 x 3 = 9 11 =14 East Fife FC LC: 3 x 2 = 6\n\nAC: 1 x 3 = 3 9 =14 Vale of Leven FC\n\nClyde FC\n\nAC: 3 x 3 = 9\n\n9 17 St Johnstone FC LC: 1 x 2 = 2\n\n\n\nAC: 2 x 3 = 6 8\n\nOne-Time Monthly Yearly Make a one-time donation Make a monthly donation Make a yearly donation Choose an amount $5.00 $15.00 $100.00 $5.00 $15.00 $100.00 $5.00 $15.00 $100.00 Or enter a custom amount Your contribution is appreciated. Your contribution is appreciated. Your contribution is appreciated. DonateDonate monthlyDonate yearly\n\nAdvertisement"}, {"url": "https://www.bbc.co.uk/sport/football/52624318", "page_content": "Paul Lambert stood wide-eyed in the Westfalenstadion, drinking in one of European football's great cathedrals, and wondered aloud to team-mate Billy Davies \"can you imagine what it's like to play here every other week?\".\n\nIt was September 1994 and Lambert's Motherwell had lost 1-0 to Borussia Dortmund in the first leg of a Uefa Cup first round tie. Lambert impressed but, even so, had you predicted that less than three years later he would appear in a Champions League final alongside Dortmund's stars, the man himself would probably have dismissed the notion as ludicrous.\n\nThe Motherwell side of that era was a good one. They finished runners-up to Rangers in the Premier Division that same season. Lambert had joined them in 1993, having won a Scottish Cup aged 17 with St Mirren, and was viewed as a tidy, reliable Scottish top-flight midfielder. But by the summer of 1996, he decided he wanted more.\n\nNo seat on the bus & strong start\n\nFootball was coming to grips with the implications of the new Bosman rule and, with his Motherwell contract at an end, Lambert wanted to test the waters. He was put in touch with agent Ton van Dalen by former team-mate Rab McKinnon, who joined Dutch side Twente Enschede the same summer.\n\nVan Dalen told him he had fixed up two trials and, despite not knowing the identity of the clubs, Lambert flew to meet him. \"Sure enough, there's this guy waiting with a placard with my name on it,\" Lambert recalls of his leap of faith.\n\n\"Ton said, 'I'm going to tell you the teams now - one is PSV Eindhoven, the other is Borussia Dortmund'. I thought he was going to take me to Lichtenstein or Azerbaijan or somewhere.\"\n\nThe first trial was at PSV, managed by future Rangers boss Dick Advocaat and boasting the likes of Arthur Numan, Philip Cocu and Jaap Stam. Deployed out of position on the right wing, Lambert still managed two goals in two friendlies, but Advocaat's preference for a pacy winger saw him send him on his way to Dortmund.\n\n\"By this time I'm thinking I'm out of my depth,\" he says. \"In the car to Dortmund's pre-season base in Lubeck, I was thinking that if this doesn't work out I need to go back to Motherwell or back to Scotland.\n\nPaul Lambert tackles Andreas Moller in a Uefa Cup tie\n\n\"I got on the team bus and I must have sat on about five or six seats and every time a player would say, 'You can't sit there'. It was Stefan Klos who said, 'come and sit next to me'. That was my seat on the bus from then on.\"\n\nAccepted by his team-mates off the pitch, Lambert impressed on it during the Fuji Cup pre-season tournament and was offered a deal by manager Ottmar Hitzfeld.\n\nPortuguese superstar Paulo Sousa arrived at Dortmund at the same time, fresh from a Champions League triumph with Juventus. A 7m Deutschmarks signing versus a free transfer from Motherwell - there was no real doubt who would play when both players were fit.\n\n\"I played in the Bundesliga opener against Leverkusen, then we played Dusseldorf on the Tuesday. I had one of those games where I could have shut my eyes and the ball would still have gone where I wanted it to go. I set up two and just couldn't have had a better game.\n\n\"Coming off the bench that night were Karl-Heinz Riedle and Sousa. When the board went up for a substitution I automatically assumed my number would go up, but it didn't. After that I thought, 'I am never coming out this team because if I do, I ain't getting back in'. That's when it hit me, I was with the best team in Europe.\"\n\nDi Livio's prediction & joining elite group\n\nDortmund were chasing a third straight German title, but were struggling to keep pace with Bayern Munich. However, having emerged from their Champions League group as runners-up to Atletico Madrid, their European campaign soon started to pick up steam.\n\nAuxerre were battered in the quarter-final, then they were too good for Alex Ferguson's Manchester United in the last four. Dortmund triumphed 1-0 home and away and, less than a year after leaving Motherwell with no idea where he was headed, Lambert was now en route for a Champions League final with Juventus at Munich's Olympic Stadium.\n\n\"I noticed in the tunnel before the game that [Juventus midfielder] Angelo Di Livio had 3-1 written on his hand,\" the Scot recalls. \"I said to Paulo Sousa, 'check out his hand' and he said, 'I know, he's predicting the score'.\n\n\"When we walked out, the trophy was there and I said to myself, 'If there is one game you need to perform, this is it'.\"\n\nThe Borussia Dortmund team that took on Juventus in the 1997 Champions League final\n\nLambert performed. His cross set-up Riedle for the opener and he managed to reduce Zinedine Zidane to a peripheral role in the final. Riedle struck again to make it 2-0 before Alessandro Del Piero pulled one back.\n\nBut Lars Ricken's exquisite goal put the game to bed and ensured Lambert would become the first British player to lift the European Cup with a continental side and join a select band of Scots to win club football's greatest prize.\n\n\"It put me in that elite group with the guys that had done it before - Kenny Dalglish, Graeme Souness, Alan Hansen, John Robertson, the Lisbon Lions,\" says Lambert. \"It was an incredibly proud moment and nobody can ever take it away from me.\"\n\n'Zidane remembered me'\n\nSo impressed were Juventus with Lambert's display, they made him an offer to move to Turin that summer. It was one of many, but he was happy to stay at Dortmund.\n\nAnd though he turned down the chance to play alongside Zidane, he would encounter the French maestro many years later. \"I went over to watch Real Madrid train when Carlo Ancelotti was the manager. Paul Clement was the assistant and he introduced me to Zidane, who said, 'Oh my god, that game!'. He remembered me.\n\n\"Wolves played Chelsea in the FA Cup not too long ago and Antonio Conte asked to see me before the game. He said: 'Juve - Dortmund, I was injured that night and watched from the stands. You were unbelievable.' That was great.\"\n\nPaul Lambert takes on Zinedine Zidane in the Champions League final\n\nBy November 1997, personal circumstances forced Lambert to look for a move closer to home. Wim Jansen was a long-time admirer and a transfer to Celtic was agreed, but leaving Dortmund was a wrench.\n\n\"For about a month, I couldn't kick my backside at Celtic,\" he says. \"My head was all over the place, I was thinking, 'What have I done?' Slowly but surely my game started to come.\"\n\nCeltic would win the title that season to halt Rangers' march to 10-in-a-row. It was the start of a glorious spell, during which Lambert won four Scottish titles, two Scottish Cups, two league cups and captained Celtic to the 2003 Uefa Cup final. His spell with Borussia Dortmund had transformed him, injected him with the confidence of a truly elite player.\n\n\"I had that fearless thing of knowing I had done it at the highest level, so if you're going to beat me you're going to have to match me or be better than me. That's what Borussia Dortmund did for me, catapulted me to that level. I could then handle playing in big games in front of big crowds. After that, nothing fazed me.\""}, {"url": "https://www.bbc.co.uk/sport/football/51128915", "page_content": "Bobby Brown managed Scotland for four years\n\nFormer Scotland goalkeeper and manager Bobby Brown has died at the age of 96.\n\nA Rangers Hall of Fame inductee, he made 296 appearances in 10 years at Ibrox, winning eight trophies, including an unprecedented domestic treble.\n\nBrown won five caps before retiring and becoming St Johnstone manager in 1958.\n\nHe was named Scotland's first full-time manager nine years later and famously led the national side to a 3-2 win at Wembley over then-world champions England in his first competitive game.\n\nBrown began his senior career at Queen's Park in 1939 before his stint at the club was disrupted by World War Two, the goalkeeper serving in the Fleet Air Arm of the Royal Navy.\n\nHe joined Rangers in 1946 and, across his near-300 outings, kept 109 clean sheets. Between August 1946 and April 1952, he embarked on a remarkable run of 179 consecutive league starts, never missing a match, while combining football with a job as a schoolmaster.\n\nBrown won three Scottish titles, three Scottish Cups and two Scottish League Cups, helping Rangers become the first treble-winning team in 1948.\n\nAfter 10 years at the club, Falkirk bought Brown, who retired from playing a season later.\n\nHe became manager of St Johnstone, propelling the Perth side from the second tier to the top flight, before being named Scotland boss in 1967.\n\nThe national team's first full-time manager, he took Scotland on a 10-game tour of Israel, Hong Kong, Australia and New Zealand, winning each of the friendly matches.\n\nBut Brown is perhaps best known for guiding the Scots to their historic Wembley triumph, inflicting the reigning world champions' first loss in 19 fixtures since their famous triumph of 1966.\n\nScotland narrowly failed to qualify for the 1970 World Cup and Brown became \"thoroughly fed up\" by the frustrations of the role, citing the unhelpfulness of some club managers when their players were called up for international duty.\n\nWhen he stepped down in 1971, he only remained in football in a scouting capacity, helping his wife run several shops and a cafe called the Copper Cauldron.\n\nRangers will hold a minute's silence in memory of Brown before Friday night's Scottish Cup visit of Stranraer.\n\n'Iconic figure swooping around his goal' - analysis\n\nFormer football commentator Archie Macpherson on BBC Radio Scotland's Good Morning Scotland\n\nI met Bobby Brown about four years ago, I think it was at a function at Hampden Park, for the first time in years. He would have been 92 then and it was astonishing - he looked middle-aged, bronzed, fit-looking, like a man who had been at the gym every day at that astonishing age.\n\nI reflected on when I first saw him. My grandfather used to take me on the bus, all the way across Glasgow from the east end to Hampden to watch Queen's Park and Third Lanark the other week and I saw Bobby Brown then.\n\nIn those days, the Queen's Park goalkeeper wore a black jersey with a white band round the middle and I remember the supporters called him \"Boy Brown\" because he was so young and had come straight from school to play for Queen's Park.\n\nHe had this contrast between the blonde mop and the black jersey and it made him a kind of iconic figure swooping around his goal. I know the term swallow might seem like a cliche, but he exemplified it - immensely athletic, lithe, he was born to be a goalkeeper.\n\nI got to know him better when he became Scotland manager. He was always approachable, always cheery, always intelligent.\n\nThat glorious, rosy day that Jim Baxter dominated - he put on a cabaret show - against England has made many people forget he was manager.\n\nUnfortunately, I was also there when he finished, again at Wembley, because he was plagued, as many Scotland mangers have been, with call-offs, injuries and so on, so it never worked out the way that he and most of us thought it would."}, {"url": "https://www.thescottishsun.co.uk/sport/football/8323629/how-many-league-titles-scottish-cups-rangers-won/", "page_content": "RANGERS football club are one of the most decorated football teams in the world.\n\nThe Light Blues are known for their prestigious history which includes more than a few memorable trophy triumphs.\n\n1 Rangers won the Scottish Premiership title under Steven Gerrard last season\n\nBut just how many League titles, Scottish Cups and Scottish League Cups have Rangers won?\n\nScottish Top Division Titles\n\nRangers have won 55 domestic top-flight titles in their history.\n\nAnd that's more than any other Scottish team have managed - with Celtic the only side coming close with 52.\n\nThe Scottish Premiership title returned to Ibrox two seasons ago for the first time since 2010/11.\n\nSteven Gerrard's side put together an impressive unbeaten campaign to ultimately end their rivals bid for ten in a row.\n\n32 out of 38 matches ended in victory overall - whilst Allan McGregor and his defence let by just 13 goals in the entire campaign.\n\nScottish Cup Titles\n\nRangers lifted the Scottish Cup for the first time in over a decade last season after beating Hearts 2-0 in extra-time.\n\nThey failed to win the game in 90 minutes but Scott Wright and Ryan Jack's goals in extra-time sealed the trophy.\n\nTheir first title came all the way back in 1894.\n\nRangers faced Celtic in the first ever Old Firm Scottish Cup final - with Gers running out 3-1 winners in front of 17,000 at Hampden Park.\n\nBut before last season, the last Rangers player to lift the cup was back in 2008/09.\n\nA 1-0 win over Falkirk made it back-to-back trophies in successive seasons that day.\n\nNacho Novo scored the winning goal after a comprehensive 3-0 victory against St Mirren had secured their place in the final.\n\nBETTING SPECIAL - BEST NEW CUSTOMER OFFERS AND FREE BETS\n\nScottish League Cup Titles\n\nThe Scottish League Cup is a tournament Rangers have strong traditions of success in.\n\nNo other club can come close to the 27 titles the Ibrox side boast - with nearest challengers Celtic lagging behind with 20.\n\nThe Light Blues even won the very first edition of the cup all the way back in 1947.\n\nAlmost 83,000 watched on as a Rangers side managed by club legend Bill Struth dismantled Aberdeen 4-0 at the national stadium.\n\nTheir last time winning the competition saw goals from Steven Davis and Nikica Jelavic defeat Celtic 2-1 after extra-time in the final.\n\nEuropean Titles\n\nOne of the most famous nights in Rangers history took place back in Barcelona in 1972.\n\nThe Ibrox side took on Dynamo Moscow of the then Soviet Union in the European Cup Winners Cup final - winning 3-2 on the night to bring the trophy home to Glasgow.\n\nAn early goal from Colin Stein and two from Willie Johnstone had put Rangers three up by the 50 minute mark.\n\nMoscow though rallied late on - pulling two back to set up a nervy finish in the Camp Nou.\n\nBut Rangers held on - going on to record one of the greatest results the club have ever achieved.\n\nThe Light Blues were close to adding a second trophy last season after reaching the final of the Europa League final.\n\nBut an agonising penalty shootout defeat to Eintracht Frankfurt ensured they took the runner up medals.\n\nKeep up to date with ALL the latest news and transfers at the Scottish Sun football page"}, {"url": "https://www.thescottishsun.co.uk/sport/football/8322352/how-many-league-titles-scottish-cup-celtic-won/", "page_content": "CELTIC have won their fair share of honours in their 134-year history.\n\nDomestic league titles and cups have almost become a regular celebration for Hoops fans at Parkhead.\n\n1 Celtic won last season's Premier Sports cup after defeating Hibs 2-1 Credit: PA\n\nAnd SunSport takes a look at how many trophies Celtic have won since being formed.\n\nScottish League Titles\n\nThe Hoops have achieved an impressive 52 Scottish top-flight titles in their history.\n\nAnd they won their first title all the way back in 1893.\n\nThe Hoops took the crown from Dumbarton who had beaten them to top place the year before - going on to take three of the next five titles in the following seasons.\n\nAnd Celtic of course tie the record for most consecutive titles on the bounce - winning nine in a row between 1966-1974 and 2012-2020.\n\nAnge Postecoglou's side will be looking to bring home title 53 this season.\n\nScottish Cup Titles\n\nNo team in football have won more Scottish Cup titles than Celtic have.\n\nThe Parkhead side have won no fewer than 40 titles in their history - with only Rangers coming anywhere close with 34.\n\nThe last time The Hoops lifted the trophy came in the delayed 2019/20 season.\n\nRyan Christie, Odsonne Edouard and Leigh Griffiths all netted in a thrilling 3-3 draw with Hearts that year.\n\nThe tie went all the way to penalty kicks - with Kristoffer Ajer securing the decider and winning the club their first ever Scottish Cup Final penalty shootout.\n\nThe win made it four on the bounce in that competition for Celtic, who defeated Aberdeen, Motherwell and Hearts again in the years prior.\n\nScottish League Cup Titles\n\nCeltic have a mightily impressive League Cup record in recent years.\n\nIn fact - nine of the last 10 editions of the tournament have ended with the cup back in Glasgow's east end.\n\nThis takes their total number of wins of the tournament to 20 - with a 2-1 win over Hibernian this year bringing the title back after a year in Perth.\n\nPostecoglou's side had fallen behind through a goal from Paul Hanlon.\n\nBut they instantly hit back when Kyogo Furuhashi equalised just seconds later - with the Japanese fan favourite going on to net the winner with 18 minutes to play.\n\nEuropean Honours\n\nCeltic don't just have domestic honours to their name - but they perhaps boast one of the most famous football continental triumphs too.\n\nOf course, we're talking about the 1967 European Cup victory.\n\nLed by manager Jock Stein - The Lisbon Lions defeated Italian giants Inter Milan 2-1 in the final thanks to goals from Tommy Gemmell and Stevie Chalmers.\n\nCeltic that night famously became the first British side to win Europe's premier football competition.\n\nThe squad have gone down in history as one of the greatest ever - gaining legendary status for the accomplishment.\n\nKeep up to date with ALL the latest news and transfers at the Scottish Sun football page"}, {"url": "https://www.thescottishsun.co.uk/sport/football/2571804/celtic-scott-brown-top-10-decorated/", "page_content": "The Parkhead men won their seventh successive Premiership title after beating Rangers 5-0, making it the skipper's 15th major honour in his time at Celtic\n\nSCOTT BROWN has entered the top ten of most decorated Celtic players after winning his 15th major honour with the Hoops.\n\nThe former Scotland star captained Brendan Rodgers’ side to an Old Firm romp against Rangers at Parkhead today to clinch Celtic's seventh title in a row.\n\n1 Scott Brown is now on a prestigious list Credit: Kenny Ramsay - The Sun Glasgow\n\nAnd his latest winners medal has propelled him into the top ten of Parkhead’s all-time, most trophy-laden players and managers.\n\nAnd Celtic winger James Forrest, who netted today, isn't far behind now after collecting 13 trophies at the age of just 26.\n\nBrown has now won eight league titles, four League Cups and three Scottish Cups. He also won a League Cup with Hibs ten years ago.\n\nForrest has collected seven league titles, three League Cups and three Scottish Cups.\n\nBET £10 WITH SUN BETS AND GET A FREE £30 BET\n\nBrown is now only one major honour behind Neil Lennon, who collected 16 trophies - 11 as a player and five as a manager.\n\nHoops skipper Brown is now tenth on the all-time list jointly with Jim Craig and Jim Young, after overtaking Danny McGrain, Bertie Auld and Jim Brogan.\n\nThe current top ten are are led by Willie Maley with an astonishing 34 trophies.\n\nNext come Billy McNeill with 31; Jock Stein, 27; Bobby Lennox, 25; Jimmy Johnstone, 19; Bobby Murdoch, Alec McNair and Jimmy McMenemy 18; Neil Lennon 16; Scott Brown, Jim Craig and Jim Young, 15.\n\nKeep up to date with ALL the latest news, transfers and goals from Scottish football plus fixtures, results and live match commentary"}, {"url": "https://www.thescottishsun.co.uk/sport/football/1895315/celtic-scott-brown-trophies-top-ten/", "page_content": "Broony was exceptional once again as he captained the Hoops to a fourth successive trophy at Hampden yesterday\n\nGOING FOR THE 10\n\nSCOTT BROWN is just one trophy away from entering the top ten of most decorated Celtic players after winning his 14th major honour with the Hoops.\n\nThe Scotland star captained Brendan Rodgers' side to a Betfred Cup Final win against Motherwell in a controversial Cup Final.\n\n2 Scott Brown plants a kiss on the Betfred Cup for the second year in a row Credit: Kenny Ramsay - The Sun Glasgow\n\nAnd his next trophy win will propel him into the top ten of Parkhead's all-time, most trophy-laden players and managers.\n\nCeltic winger James Forrest has also now burst into the top 20 after collecting 12 trophies at the age of just 26.\n\nBrown has now won seven league titles, four League Cups and three Scottish Cups. He also won a League Cup with Hibs ten years ago.\n\nForrest has 12 honours - six league titles, three League Cups and three Scottish Cups.\n\n2 Celtic legend Billy McNeill has 31 major honours to his name Credit: Kenny Ramsay - The Sun Glasgow\n\nTop 10 trophy-laden Celtic players Willie Maley - 34\n\nBilly McNeill - 31\n\nJock Stein - 27\n\nBobby Lennox - 25\n\nJimmy Johnstone - 19\n\nBobby Murdoch - 18\n\nAlec McNair - 18\n\nJimmy McMenemy - 18\n\nNeil Lennon - 16\n\nJim Craig - 15\n\nJim Young - 15\n\nHoops skipper Brown is currently joint 11th on the all-time list, alongside Danny McGrain, Bertie Auld and Jim Brogan. Another success would put him into the top ten, jointly with Jim Craig and Jim Young.\n\nThe current top ten are are led by Willie Maley with an astonishing 34 trophies.\n\nNext come Billy McNeill with 31; Jock Stein, 27; Bobby Lennox, 25; Jimmy Johnstone, 19; Bobby Murdoch, Alec McNair and Jimmy McMenemy 18; Neil Lennon 16; Jim Craig and Jim Young, 15.\n\nMeanwhile Broony bumped into old manager Lennon after a night out of celebrations following yesterday's Cup triumph.\n\nThe midfielder was with teammates Kieran Tierney and Patrick Roberts when old Parkhead legend Lenny popped his head into the taxi on their way home.\n\nBrown posted the photo to his Instragam account saying: “Can’t beat jumping in a taxi then meeting your old gaffer with a couple of muppets”.\n\nCeltic captain Scott Brown unleashes his dance moves after his side’s Betfred Cup Final triumph\n\nKeep up to date with ALL the latest news, transfers and goals from Scottish football plus fixtures, results and live match commentary"}, {"url": "https://www.sportingnews.com/uk/football/news/how-many-scottish-premiership-titles-have-celtic-won/ufpu1xryd7fu2x0i14gyw46m", "page_content": "Celtic have retained the Scottish Premiership title they won in 2021/22, making Australian manager Ange Postecoglou a league winner in both of his seasons at the club.\n\nThe Bhoys were initially revived under Postecoglou and are now the dominant force in Scotland again, losing only once on their way to sealing top spot with a 2-0 win at Hearts.\n\nThere had been a chance Celtic would need to win at arch-rivals Rangers the following week to confirm their triumph as Hearts held firm until midway through the second half at Tynecastle – but the dismissal of Alex Cochrane hampered the home side, who were beaten by goals from Kyogo Furuhashi and Oh Hyeon-gyu.\n\nThe Sporting News takes a look at how many titles Celtic have won across their trophy-laden history as they prepare to bring another Scottish crown back to Celtic Park.\n\nMORE: Ange Postecoglou's brutal take on VAR\n\nHow many Premiership titles have Celtic won?\n\nSince being founded in 1888, Celtic have managed to win 53 Scottish Premiership titles, with 17 of them coming after the turn of the 21st century.\n\nSome of the most successful managers in football history have managed the Glasgow giants, including titan Willie Maley, who was in charge of the club for 43 years.\n\nIt is simply impossible to talk about Celtic without lavishing praise on the great Jock Stein, who guided them to becoming the first club from northern Europe to win the European Cup in 1967 during a campaign in which the Lisbon Lions won every trophy they entered.\n\nStein was one of a handful of Celtic managers to preside over an era of dominance in which the Scottish Premiership title found its home in Parkhead.\n\nJock Stein: 'Lisbon Lions' and the creation of a legend\n\n1965-1978\n\n10 Scottish titles (nine consecutive titles 1965-74)\n\n25 major trophies overall (including European Cup)\n\nWhere do you start? Known as the most influential figure in Celtic's history, Jock Stein was the man that brought the club to the forefront of worldwide attention back in the 1960s and 1970s.\n\nIn terms of major Scottish trophies, the Hoops managed to win the league title 10 times, with nine of these coming in a row between the years of 1965 and 1974. At the time, this was a feat of unprecedented dominance in Scottish football.\n\nThis form translated to the European stage and other cup competitions, as his side picked up a further 14 domestic honours over his tenure.\n\nMost memorable, though, was when Celtic won the European Cup in 1967, defeating Inter Milan 2-1 in the final in Lisbon. They reached the final again in 1970, made semi-final appearances in 1971/72 and 1973/74, one quarter-final appearance in 1968/69 and reached the European Cup Winners Cup semi-final in 1965/66.\n\nIt is important to remember that Stein arrived at the club amid a backdrop of underachievement that hadn't seen the Hoops win any league titles since 1953/54. Once Stein arrived and put his stamp on the club, the rest was history.\n\nMartin O'Neill: New millennium, new dominance\n\n2000-2005\n\nThree Scottish Premiership titles and four domestic cups, including domestic treble\n\nUEFA Cup final in 2003\n\nAfter stopping Rangers from winning 10 in a row in 1998, Celtic lost the Scottish Premiership in 1998/99 and 1999/00 to their rejuvenated rivals.\n\nMartin O'Neill stepped in to turn the tide of Rangers' domination, which had seen the Hoops win just one of an available 12 titles between 1988/89 and 1999/00. The Irishman would prove to be a crucial appointment by Celtic, as he helped to win Scottish Premierships in 2000/01, 2001/02 and 2003/04.\n\nCeltic would win the league at a canter in all three victorious seasons, setting a marker for the levels of success they have achieved in the 21st century. In his first match against adversaries Rangers, O'Neill's men went on to record one of the most memorable Glasgow derby wins in history, defeating Rangers 6-2 in front of a rapturous home support.\n\nHe would also take Celtic to a UEFA Cup final in 2003, where they narrowly lost to Jose Mourinho's Porto 3-2 despite Henrik Larsson's best efforts. He also oversaw three Scottish Cup wins and a Scottish League Cup triumph throughout his time at the club, completing the domestic treble in 2000/01.\n\nSimilar to Jock Stein, O'Neill took Celtic from a state of disarray to being a reputable team domestically and on the continent. Without his contribution, things could've looked very different for Celtic in contemporary times.\n\nLennon, Deila, Rodgers and Lennon again: The quadruple treble\n\nCeltic won nine consecutive titles from 2011/12 to 2019/20 under three different managers\n\nThey clinched the 'quadruple treble', winning all three domestic trophies for four seasons running\n\nFailed to deliver titles in a row in 2020/21, finishing 25 points off top spot\n\nGordon Strachan delivered three more titles between 2005/06 and 2007/08, but Celtic would not be crowned champions again until 2012.\n\nNeil Lennon had been in charge since the tail end of 2009/10 and lost the league by a point in 2010/11, but he was to get his hands on the trophy a year later in what was the start of Celtic's run to winning nine in a row for the second time in their history.\n\nRangers had been in severe financial difficulty for a few years in the lead-up to 2011/12, which subsequently lead to the Hoops' rivals going into administration, then liquidation and starting 2012/13 in the Scottish Third Division (fourth tier of Scottish football).\n\nDue to the league being weakened significantly, Celtic fairly comfortably wrapped up titles from 2012/13 to 2016/17 under Lennon, Ronny Deila, and Brendan Rodgers. In the latter, Rangers had worked their way up the pyramid and gained promotion to the Scottish Premiership, leading some to think that for the first time in years there could be a serious title race in Scotland.\n\nDespite this, Celtic went on the rampage under Rodgers, becoming the first and only side in Scottish football to go invincible in every domestic competition as they won the treble. They finished 30 points clear of Aberdeen in second, as well as being 39 above third-placed Rangers, who they defeated 5-1 home and away in two derby clashes.\n\nAnother clean sweep of Scottish trophies followed in 2017/18 as their British-record unbeaten run of 69 domestic games unbeaten was finally ended by Hearts. The following season heralded a far more competent Rangers side, though Celtic were again crowned champions, topping the table by nine points. Another treble success was in order, making it three on the bounce despite much-loved Celtic manager Rodgers leaving for Leicester in February 2019 and Lennon returning to Parkhead.\n\nThe 2019/20 season proved to be a momentous one in the history of Celtic, as they clinched their ninth league title in a row as part of that latest treble. Lennon's side recorded vital wins against Rangers at Ibrox, as well as a last-gasp Scott Brown winner at home to Hamilton Academical giving them a priceless 2-1 win at home that would spur them on to win the league championship. There were also domestic cup final victories over Hearts and Aberdeen.\n\nThe 2019/20 season was closed down early due to the COVID-19 pandemic, meaning Celtic were eventually awarded their 51st league title on a points-per-game basis. In their delayed Scottish Cup schedule, which was played six months later, they would go on to claim the first ever quadruple treble, defeating Hearts on penalties in the final. They had beaten Rangers 1-0 in the Scottish League Cup final earlier that season.\n\nAnge Postecoglou: Putting Celtic back on top – and then some\n\nCeltic made a transitional start before regaining the Scottish title under Ange Postecoglou\n\nAn early loss at St Mirren was their only defeat before winning it again in his second season\n\nCeltic could surpass Rangers' honours haul in 2023-24 if Postecoglou's trophy rate goes on\n\nAs much as it may seem like a memory from far longer ago than 2021 now, Celtic made a start so inauspicious under Postecoglou that it served to fuel talk from his critics that the first Australian to manager a major club in Europe had been a poor appointment by his club.\n\nExpectations were not spectacularly high after Celtic finished 25 points behind Rangers the previous season, and the start of the Athens-born coach's reign saw them knocked out of the UEFA Champions League qualification stage and find themselves midtable in the Premiership as part of a run started by a defeat to Hearts in the new boss's first league game.\n\nScottish League Cup glory that December was a sign of the success to come, and a 3-0 win against Rangers in February was one of the highlights as Celtic finished four points above the side who they had spent a decade eyeing enviously from second place.\n\nCeltic's 21-goal superiority over Rangers was also a reflection of the high-octane style that has seen Postecoglou deservedly linked with vacancies in the English Premier League.\n\n\"Champions. That's who we are!\"\n\n\n\nDrop a 💚 for Ange Postecoglou!#CelticFC🍀🏆 pic.twitter.com/IJUs3NpOwk — Celtic Football Club (@CelticFC) May 7, 2023\n\nBy the time they suffered their first defeat of the 2022-23 season - their only loss, by the time they won the title - Postecoglou's players had won 5-0 at Kilmarnock, 9-0 at Dundee United and thumped Rangers 4-0 at home, with draws against Rangers and Motherwell in 2023 becoming the only other occasions on which they dropped points prior to lifting the trophy.\n\n\"They've maintained an absolutely ridiculous standard this year,\" Postecoglou told BBC Scotland, praising a squad who had already won the 2022-23 Scottish League Cup \"They are relentless in their approach.\"\n\nDo Celtic or Rangers have more trophies?\n\nThe Glasgow rivalry is about as close as you'll come within elite football: Rangers have 116 major honours to Celtic's 115 trophies. Of course, arguments are often made by fans of both clubs about the prestigiousness and timing of trophies won.\n\nCeltic could yet add to their tally in 2022/23: they face Inverness Caledonian Thistle in the final of the Scottish Cup on June 3.\n\nTrophies won by Celtic and Rangers"}]}