{"Eden Natan-Zada was an Israeli soldier who perpetrated a shooting attack on a bus in the Israeli Arab town of Shfaram on August 4, 2005.": [{"url": "https://www.theguardian.com/world/2013/nov/28/israeli-arabs-lynching-soldier-shooting-eden-natan-zada", "page_content": "An Israeli court sentenced seven Arab citizens to prison terms of between eight months and two years for their part in the lynching of a soldier who went on a deadly shooting spree in 2005.\n\nEden Natan-Zada was a Jewish extremist who went awol from his military unit in 2005 before embarking on a shooting spree on a bus in a northern Arab town. He killed four Arabs before running out of ammunition. An angry mob then beat him to death.\n\nA Haifa district court judge said that despite the soldier's actions, a democracy could not tolerate vigilante justice and rejected an \"eye for an eye\" defence. After the verdict on Thursday, Israeli Arabs hurled stones toward police in protest at what they called unjust punishment.\n\nMeanwhile, in Jerusalem, a two-year-old girl was moderately wounded when she was struck in the head by a stone hurled at the car in which she was traveling. A police spokesman, Micky Rosenfeld, said the attack appeared to be nationalistic in nature as Jewish vehicles are often targeted in the area by youths in nearby Arab villages.\n\nThe baby girl was taken to hospital, where the mayor of Jerusalem, Nir Barkat, called on authorities to crack down on a recent wave of stone-throwing attacks in the city. \"It's about time we start treating a stone as a weapon,\" he told Israel's Channel 10 TV.\n\nThe prime minister, Binyamin Netanyahu, wished the girl a speedy recovery. \"We will find these criminals and bring them to justice,\" he said."}, {"url": "https://www.wikiwand.com/en/Shfar%27am_bus_attack", "page_content": "Eden Natan-Zada (Hebrew: עדן נתן-זדה, born 9 July 1986, died 4 August 2005) was an Israeli soldier who opened fire in a bus in Shefa-Amr in northern Israel on 4 August 2005, killing four Israeli-Arabs and wounding twelve others.[1] He was restrained, disarmed and cuffed when he tried to reload to prepare for another round of shooting.[2] After he was restrained and handcuffed, he was beaten to death by the crowd, as recorded on video.[3] It has been inferred that the shooting was a personal protest against the Israeli government's disengagement plan, since an orange ribbon was found attached to Natan-Zada's pocket (orange was an emblem color of anti-disengagement activism).[4]\n\nIsraeli soldier and mass-murderer\n\nQuick facts: Eden Natan-Zada, Born, Died, Cause of de... ▼\n\nNo group had taken credit for the terror attack and one official in the settler movement denounced it. Natan-Zada was absent without leave and in hiding from the IDF at the time of the shooting.[5] He had recently become religious after getting involved with far-right activists.[6]"}, {"url": "https://apnews.com/article/ea6303b5034d4f3b9bf1a6f59939ae08", "page_content": "JERUSALEM (AP) — An Israeli court on Thursday sentenced seven Arabs citizens to prison terms of eight months to two years for their part in the lynching of a soldier who went on a deadly shooting spree in 2005.\n\nEden Natan-Zada was a Jewish extremist who went AWOL from his military unit in 2005 before embarking of a shooting spree on a bus in a northern Arab town. He killed four Arabs before running out of ammunition. An angry mob then beat him to death.\n\nA Haifa district court judge said that despite the soldier’s actions, a democracy could not tolerate vigilante justice and rejected an “eye for an eye” defense. Following the verdict, Israeli Arabs hurled stones toward police in protest of what they called unjust punishment.\n\nMeanwhile, in Jerusalem, a two-year-old girl was moderately wounded when she was struck in the head by a stone hurled toward the car in which she was traveling. Police spokesman Micky Rosenfeld said the attack appeared to be nationalistic in nature as Jewish vehicles are often targeted in the area by youths in nearby Arab villages.\n\nThe baby girl was taken to hospital, where Jerusalem Mayor Nir Barkat called on authorities to crack down on a recent wave of stone throwing attacks in the city. “It’s about time we start treating a stone as a weapon,” he told Israel’s Channel 10 TV.\n\nPrime Minister Benjamin Netanyahu wished the girl a speedy recovery. “We will find these criminals and bring them to justice,” he said."}, {"url": "https://www.timesofisrael.com/killers-of-jewish-terrorist-get-11-24-months-in-prison/", "page_content": "The Haifa District Court on Thursday handed out jail terms ranging from 11 to 24 months to seven men convicted in the 2005 lynching of Jewish terrorist Eden Natan Zada, an AWOL IDF soldier who was beaten to death by a mob in the northern city of Shfaram after opening fire in a public bus, killing four.\n\nFour of the defendants, found guilty of attempted manslaughter, assaulting a police officer, rioting and interfering with a police investigation, received prison sentences ranging from 20 months to two years. A fifth defendant, found guilty of all the charges except attempted manslaughter, was sentenced to 18 months. A sixth defendant facing lesser charges was sentenced to 11 months in prison and the seventh defendant received eight months’ probation.\n\nAll the seven are from Shfaram, where the shooting took place.\n\nHundreds of residents of the Arab-Israeli village of Shfaram and other supporters rallied in their defense outside the court in Haifa on Thursday. Police spokesman Mickey Rosenfeld said 9 demonstrators were arrested after the court ruling for throwing rocks at police officers.\n\nMK Hanin Zoabi, who recently failed in her bid to become mayor of Nazareth, was also in attendance at the sentencing hearing, the Maariv newspaper reported, as were some 500 police officers.\n\nGet The Times of Israel's Daily Edition by email and never miss our top stories Newsletter email address Get it By signing up, you agree to the terms\n\nIn handing down the sentences, judge Ilan Schiff said that the state “cannot tolerate acts of retribution” even if they were unplanned, and noted the brutal nature of the mob violence which killed Zada.\n\nOn August 4, 2005, shortly before the Israeli withdrawal from Gaza, an AWOL IDF soldier, Eden Natan Zada, opened fire on a public bus traveling through an Arab village, killing four Israeli Arabs — Michael Bachus, Nader Khaik and the sisters Hazar and Dina Turki — and wounding 22 before he was subdued and beaten to death by the other passengers.\n\nZada killed his victims, the judges wrote, “simply because they were Arabs.”\n\nAdvertisement\n\nAfter the killing spree, and with Zada handcuffed and in police custody on the bus, the crowd prevented Israeli police from defending Zada and pummeled him for an hour, until long after he was dead. Later, as part of a massive police investigation, 12 Shfaram residents were arrested, with seven going on trial.\n\nTimes of Israel staff contributed to this report."}, {"url": "https://www.haaretz.com/2008-06-15/ty-article/no-murder-charges-for-suspects-in-lynch-of-jewish-terrorist/0000017f-db88-df62-a9ff-dfdfbf4e0000", "page_content": "The 12 suspects in the death of Jewish terrorist Eden Natan-Zada, who was lynched by an Israeli Arab mob in 2005 will be charged with violent assault rather than murder, it emerged on Sunday.\n\nAWOL Israel Defense Forces soldier Natan-Zada, 19, was killed after murdering four Israeli Arabs on a bus in the northern town of Shfaram in August 2005, days before Israel's withdrawal from the Gaza Strip.\n\nThe suspects were instructed Sunday to appear at a court hearing on July 13, where they will be indicted.\n\nHadash chairman MK Mohammed Barakeh, slammed the court's decision to charge the suspects with any sort of crime. \"The whole world knows that the citizens of Shfaram were the victims and targets of an abominable massacre,\" Barakeh said. \"I emphasize the need to indict those same military officials that knew of the danger of the terrorist as well those who allowed him a warm home as a army deserter.\"\n\nBalad MK Jamal Zekhelaka accused the government of blaming Israeli Arabs for their own tragedy.\" Again they are blaming the victim... the police did not invest the effort to investigate what help that criminal Natan-Zada received, and is harassing those who protected themselves and prevented mass murder. If they do try these people, we won't let it happen quietly. There will be a huge protest.\"\n\nUntil Sunday, it was unclear what move the state would make in connection to the politically charged case, after the state prosecution and attorney general repeatedly delayed making a decision on the issue.\n\nIn April, police officers in the Northern Region questioned whether the state prosecutor and attorney general's delayed decision on the lynch was due to a lack of evidence or was political.\n\nA scathing condemnation of the prosecution's decision was issued by Faiza Turki, whose daughters Dina and Hazar were killed in the shooting attack. She said that the Israeli government and the IDF should be the ones to stand trial for allowing Natan-Zada to move around freely.\n\nTurki said that if Natan-Zada was still alive, \"Of course they would make him out to be a psychopath and mentally ill, and send him to receive treatment. Since the event itself and up until today we hardly sleep at all at night. The state now is looking to avenge Natan-Zada's blood instead of seeking the real culprits who filled him with hatred in order for him to commit this abominable act.\"\n\nNatan-Zada was an Israel Defense Forces soldier who held extreme right-wing views. He lived on the West Bank settlement of Tapuah where he was in contact with members of the outlawed Kach movement.\n\nHis shooting attack took place during the lead-up to Israel's pullout from the Gaza Strip in August 2005. After he had unloaded his army-issue M-16 assault rifle on fellow passengers on a bus he was beaten to death by the crowd that subsequently gathered.\n\nThe local committee established in the town established in the wake of the attack announced it will hold an emergency meeting at 19:00 Sunday to examine the ramifications of the prosecution's decision. Ahmed Hamdi, chairman of the committee, said that an atmosphere of rage prevails in Shfaram following the \"surprising decision.\"\n\nAccording to Hamdi, even if the prosecution decides to reduce the gravity of the charges against the suspects, the committee rejects the indictments out of hand.\n\n\"We said, and we say again: We are the victim in this incident and will not permit our sons to sit on the bench of the accused. At the meeting we will decide upon a series of protest measures - among others, demonstrations and even a strike in the town and the Arab sector,\" Hamdi said."}, {"url": "https://www.aljazeera.com/news/2013/11/29/palestinians-condemn-prison-sentences", "page_content": "Seven given up to two years in jail by Israeli court for killing soldier who went on deadly bus shooting spree in 2005.\n\nProtests erupted outside an Israeli court as prison sentences were handed down to seven Palestinian citizens of Israel convicted of beating a Israeli soldier to death after he carried out a shooting spree on a bus in 2005.\n\nA Haifa district court judge said on Thursday that despite the soldier’s actions, Israel could not tolerate vigilante justice, or an “eye-for-an-eye” defence.\n\nSix men were sentenced to between eight months and two years in prison, while another was given a suspended sentence and released on probation.\n\n“It was a discriminatory decision, a discriminatory judgment, and we will never agree to go to jail even for a day,” said one of the defendants after walking out of the court.\n\nEden Natan-Zada, a 19-year-old soldier, killed four Palestinian citizens of Israel in 2005 after opening fire aboard a bus in Shfaram, a Palestinian town in northern Israel.\n\nSettlements link\n\nAnother 22 people were injured, before a group of passengers killed Natan-Zada immediately after the attack.\n\nNatan-Zada was reportedly distraught over Israeli plans to evacuate Jewish settlements from the occupied Gaza Strip.\n\nIsraeli security officials later said he had hoped to spur sectarian violence in Israel in an effort to derail the Gaza withdrawal, which went ahead weeks later.\n\nSiry Khourieh, defence lawyer, argued during the trial that the men had acted in self-defence. He said the defence would appeal for Thursday’s sentence to be overturned.\n\n“In our opinion, we are speaking about an exaggerated punishment and a very serious one. According to the indictment we think that the Supreme Court will take its time and will give them a more appropriate sentence,” Khourieh said.\n\nThe case has drawn an angry response from Israel’s Palestinian citizens, which viewed the arrests as an injustice against the community targeted in Natan-Zada’s deadly attack.\n\nDemonstrations held\n\nDozens of Shfaram residents demonstrated outside the court and chanted in support of the seven men on Thursday.\n\nPalestinians make up 20 percent of Israel’s population.\n\nJamal Zahalka, a Palestinian member of the Israeli parliament, the Knesset, called the sentences “an aggressive message to the Arab citizens of Israel”.\n\n“It is a message that says that the Arabs can’t defend themselves, that Arab blood is worthless. We don’t accept that and will keep protesting until they are released from jail,” Zahalka said.\n\nMohamed Barakeh, another Palestinian lawmaker, said: “This is an attempt to punish the victims. The convicted men are on the side of the victims, of those four people who are now in the ground.”"}, {"url": "https://www.haaretz.com/2013-11-28/ty-article/.premium/lynch-defendants-sentenced/0000017f-e0ab-d568-ad7f-f3ebfd820000", "page_content": "Six Israeli Arabs were sentenced Thursday to terms of up to two years in jail for their role in lynching Eden Natan-Zada, who killed four Israeli Arabs and wounded more than 20 in a shooting spree on a bus in Shfaram in 2005.\n\nNa’aman Bahus, Basel Kadari and Jamil Sapori, who were convicted of attempted manslaughter, were each sentenced to two years. Basel Khatib, convicted of the same charge, was sentenced to 20 months, while Fadi Nasrallah and Arkan Kurbaj, both convicted of aggravated assault, were sentenced to 18 and 11 months, respectively. All six were also found guilty of assaulting policemen. Munir Zakut, who was convicted only of assaulting a policeman, received an eight-month suspended sentence.\n\nJudges Ilan Shiff, Hanny Horowitz and Tsila Keinan of the Haifa District Court said that jail terms were necessary to uphold two vital social values: the sanctity of life and law and order. Nevertheless, they added, the sentences would have been much stiffer had it not been for “the unique circumstances of the case,” which they said made it one of the hardest sentencing decisions they had ever faced.\n\nThe sentences will be deferred for 45 days while the defendants decide whether to appeal. But defense attorneys said that from a legal standpoint, they were actually satisfied with the court’s leniency, noting that prosecutors had sought jail terms of six to nine years. Sentences that didn’t include jail time were never a realistic expectation, said one, Maher Talhami.\n\nThe defendants, however, disagreed, as did the hundreds of Shfaram residents and Israeli Arab political activists who demonstrated outside the court yesterday. “The sentence revealed the state’s racist face,” Sapori charged. “If we had been Jews, they surely wouldn’t have sent us to jail.”\n\nThe demonstrators denounced the legal system vociferously, and at one point, during a scuffle with police, rocks and stun grenades were thrown. Ten demonstrators were arrested.\n\nIn Shfaram itself, a general strike was called to protest the ruling. Mayor Amin Anabtawi explained that most residents think the seven should never have been indicted to begin with.\n\nNatan-Zada, an AWOL soldier and Kahanist, was apparently acting in opposition to the upcoming disengagement from Gaza when, with his army-issue rifle, he boarded a bus en route to Shfaram from Haifa on August 4, 2005. As Natan-Zada shot at passengers, an angry mob stormed the bus and killed him. Police opened an inquiry into his death after viewing photographs that showed him still alive after being disarmed and bound.\n\nOpen gallery view Protests outside the Haifa District Court during the sentencing hearing in the lynching of Eden Natan-Zada. Credit: Rami Shlush\n\nOpen gallery view Defendants in the lynching of Eden Natan-Zada at court, November 28, 2013. Credit: Rami Shalush\n\nOpen gallery view People surrounding the bus shortly after the attack in Shfaram Credit: Ancho Gosh/Gini"}, {"url": "https://alchetron.com/Eden-Natan-Zada", "page_content": "Eden Natan-Zada (Hebrew: עדן נתן-זדה‎‎, born 9 July 1986, died 4 August 2005) was an Israeli soldier who opened fire in a bus in Shefa-Amr in northern Israel on 4 August 2005, killing four Israeli-Arabs and wounding twelve others. He was restrained, disarmed and cuffed when he tried to reload to prepare for another round of shooting. After he was restrained and handcuffed, he was beaten to death by the crowd, as recorded on video. It has been inferred that the shooting was a personal protest against the Israeli government's disengagement plan, since an orange ribbon was found attached to Natan-Zada's pocket. (Orange was an emblem color of anti-disengagement activism).\n\nNo group had taken credit for the terror attack and one official in the settler movement denounced it. Natan-Zada was absent without leave and in hiding from the IDF at the time of the shooting. He had recently become religious after getting involved with far-right activists.\n\nEarly life\n\nNatan-Zada was born to an Israeli-Jewish family that had immigrated to Israel from Iran and Yemen. Natan-Zada's parents describe him as having been a \"bright and studious Israeli schoolboy\" prior to his becoming involved with the Jewish extremist Kahanism movement, to which he was introduced via the Internet. He then began spending weekends in Kfar Tapuach, an Orthodox West Bank settlement. During his national service in the Israel Defense Forces (IDF), Natan-Zada deserted the army and hid in Kfar Tapuach to avoid further service. According to Matthew Gutman of the Jerusalem Post, Kfar Tapuach \"became the unofficial headquarters of the Jewish terrorist group Kahane Chai in 1990,\" but supporters deny the existence of a Kahane headquarters.\n\nIn a letter left behind after his desertion, Natan-Zada expressed dismay to his parents over the disengagement plan, saying 'Just as I couldn't carry out an order that desecrates the Sabbath, I cannot be part of an organization that expels Jews.' He added the anti-pullout slogan 'Jews don't expel Jews' to his letter, and concluded the message with the words: 'I will consider how I will continue to serve.'\n\nHis mother claims that prior to the shooting she alerted the IDF and other security services that her son was still in possession of his military-issued weapon. 'We told everyone he's AWOL, that he could do something with his gun. We begged them to take away his gun. He also asked them to take his gun. The army destroyed my child. The army destroyed my life.' According to The New Republic, 'an army psychiatrist warned that he wasn't fit for weapons or uniform, but his professional judgment was awaiting approval by a panel of medical experts that was not very swift in assembling' and that a 'former chief of staff of the IDF' had 'speculated that the killer's parents might have a chance to win damages in court for neglect by the army of the welfare of their son.'\n\nShefa-Amr attack\n\nNatan-Zada boarded the Shefa-'Amr-bound bus on Thursday, 4 August 2005. He was dressed in full IDF uniform, carrying his IDF-issued M16 rifle, and, according to observers, wearing the skullcap, beard, and sidelocks of an observant Jew, as well as an orange ribbon hanging from his pocket. According to witnesses, the bus driver was initially surprised to see a religiously-observant Jewish soldier making his way to Shefa-'Amr (an overwhelmingly Arab city) via public bus, so he asked Natan-Zada if he was certain he wanted to take his current route. Upon arriving in Shefa-'Amr's primary Druze neighborhood, Natan-Zada stood up and approached the front door as if to disembark the bus. When the door opened, Natan-Zada turned around and shot the driver. He then fatally shot a man sitting behind the driver, and fired into the rest of the bus, killing two young women and wounding twenty-one passengers. When he paused to reload his weapon, a passenger grabbed the barrel of his gun, sustaining burn injuries, and he was subdued by streetgoers gathered around the scene of the bus shooting. When the police arrived at the scene he was tied up but still alive, but the small force of police officers on the scene could not prevent the crowd from lynching him, and nine police officers were injured attempting to protect him. It took the police four hours to remove his body from the scene.\n\nThe four victims were Hazar Turki and Dina Turki, two sisters in their early twenties, and two men, Michel Bahus (the driver) and Nader Hayek; all were Arab citizens of Israel. The wounded were rushed to Rambam Medical Center in Haifa. In the days after the attack, 40,000 people attended a funeral service in honor of the victims in the town. The two sisters were buried in an Islamic cemetery, and the two men in the local Christian cemetery.\n\nSuspicion that authorities were aware of Natan-Zada's intentions\n\nIn March 2010, a lawyer representing some of the lynch suspects discovered security forces aerial footage of the scene prior to, during and after Natan-Zada's attack and after the lynching of Natan-Zada and accused the Israeli government of prior knowledge of Natan-Zada's intentions. At the time, the police denied it had aerial support and some have claimed a conspiracy theory that the government was trying to delegitimize the anti-disengagement movement by provoking an extremist act or setting up Natan-Zada.\n\nReactions\n\nThen Prime Minister of Israel Ariel Sharon condemned Natan-Zada's actions unequivocally, calling them \"a reprehensible act by a bloodthirsty Jewish terrorist,\" and \"a deliberate attempt to harm the fabric of relations among all Israeli citizens.\" Vice Premier Shimon Peres and Interior Minister Ophir Pines-Paz visited the bereaved families. \"Your pain is the pain of the entire State of Israel. We will not allow crazy men and terrorists to harm your life here,\" Peres told the families. Sharon's government consistently referred to the shooting as \"an act of terrorism,\" language usually reserved for Palestinian suicide bombers.\n\nWhile the Israeli government and US State Department both consider groups based on Kahanism to be terrorist organizations, Kahanist advocates insist their ideology only advocates the forced removal of Arabs from the Land of Israel, not murder.\n\nInvestigation and trial\n\nThe Israel Police opened a criminal investigation into Zada's lynching.\n\nThe High Follow-Up Committee for Arab Citizens of Israel called on the government to refrain from investigating the death of Eden Natan-Zada. Arab Knesset member Mohammad Barakeh, a Shefa-'Amr resident himself, warned that protests could erupt if police probe Zada's lynching: \"Normally when someone stops a terrorist from continuing to kill he is considered a hero, but in this case it is the heroes who are sitting on the defense stand\". However, Shefa-'Amr's security officer, Jamal Aliam, told Army Radio that Zada had been attacked by dozens of people after he had been handcuffed and subdued by police.\n\nEventually, on 13 June 2006, five suspects in the lynching were arrested, one who was already serving a prison sentence was brought in for questioning, and a seventh suspect turned himself in after learning he was wanted by police. The police said: \"We're responsible for maintaining the law, and you can't take the law into your own hands even when it concerns a terrorist who murdered innocent people, even though he made a heinous terrorist act\". Two suspects were subsequently released. There was general support for their arrest and even left-wing activist Yossi Beilin said: \"Israel can't put up with a lynch made on a handcuffed person even if his actions are heinous and unforgivable. It's a combined interest of both Jews and Arabs that Israel won't close its eyes to such behaviour\". The Arab Knesset members however demanded their release and called their arrest a crime.\n\nOn 7 June 2009, twelve Arab citizens were indicted over the lynching in the Haifa District Court. Seven were charged with attempted murder. In March 2010, Maher Talhami, their defense lawyer, stated that recently discovered aerial footage of the bus, recorded by an Israeli drone before, during and after the attack took place indicates that Israeli defense officials were aware of Natan-Zada's intentions.\n\nIn July 2013, the seven defendants charged with attempted murder were acquitted of that charge, but four were convicted of attempted manslaughter and two were convicted of aggravated battery, while one was exonerated entirely. The sentencing took place on 28 November 2013. Three were sentenced to two years in prison, while one was sentenced to 20 months, one to 18 months, and one to 11 months.\n\nBurial controversy\n\nNatan-Zada's funeral was a controversial matter. Jewish law requires a swift burial, but nationwide outrage against his attacks left his body without a willing resting place for two days.\n\nAn initial agreement between IDF officials and the Natan-Zada family would have allowed burial in a military cemetery, but with no military honors such as a 21-gun salute or placement of the Israeli flag upon his coffin. However, Meir Nitzan, the mayor of Rishon LeZion intervened before the funeral. The morgue which housed Natan-Zada's body, Abu Kabir Forensic Institute, refused to release the body to friends and fellow Kahane activists to bury, resulting in a bitter protest.\n\nResidents of Kfar Tapuach were divided on the issue. Kfar Tapuach resident Moshe Meirsdorf said Natan-Zada's connection to the community \"has been destructive for us. We totally reject everything he did.\" Meirsdorf claimed that Natan-Zada and other extremist youth were not official community members, despite the fact that Natan-Zada had legally updated his address to Kfar Tapuach. \"He was never accepted by the absorption committee,\" said Meirsdorf, whose wife is a member of the committee. Others supported Natan-Zada, including four teenagers from Tapuach who were arrested following the incident. Most locals, however, voiced opinions in line with Tapuach leader David Haivri, who expressed pain over the loss of Natan-Zada and emphasized the tragedy of his death.\n\nSome Israeli media outlets initially suggested that Natan-Zada be buried in the West Bank settlement of Kiryat Arba, where Baruch Goldstein, who committed Cave of the Patriarchs massacre 11 years earlier, is buried. Natan-Zada's body resided for two days in the Abu-Kabir morgue, pending an appeal to Prime Minister Sharon by his parents. On 7 August 2005, the Prime Minister's Bureau overruled Meir Nitzan's ban against burial in Rishon LeZion, and decreed that Zada should be buried in the civilian cemetery there. He was buried in the Gordon neighborhood. Because of the delays, Natan-Zada was buried two days after Jewish law allows. Three of the hundreds of mourners at the burial were arrested with administrative arrest orders, including \"New Kach\" leader Efraim Hershkovits, American citizen Saadia Herskof, and former Kach activist Tiran Pollack's son Gilad.\n\nVictim compensation\n\nAfter the event, the Israeli Defense Ministry ruled that the four Arab citizens shot dead were not victims of terror because their killer was not part of a terrorist organization, and are thus not entitled to the usual compensation for life lost due to terror attacks. According to Mayan Malkin, a spokeswoman with the Israeli Defense Ministry, an attacker must be a member of the \"enemy forces\" against Israel to be considered a terrorist under the law. Instead, they received payment \"beyond the letter of the law,\" as a lump-sum payment, as opposed to the lifelong monthly annuity given to the families of terror victims. Representatives of the Arab community in Israel condemned the decision, with Mohammed Barakeh, an Arab member of the Israeli parliament, saying that the \"…decision raises a strong scent of racism, which distinguishes between a Jewish terrorist and an Arab terrorist.\" On 19 July 2006, the Israeli government changed the \"Compensation Law for Victims of Hostile Acts\" to include anyone victimized by violence stemming from the Israeli-Arab conflict. As a result of this change, the victims and families of Natan-Zada became eligible for terror compensation."}, {"url": "https://www.npr.org/2005/08/05/4786600/israeli-shooter-was-awol-from-army", "page_content": "Israeli Shooter was AWOL from Army\n\nA 19-year-old Israeli man absent without leave from the Army opened fire on Israeli Arabs riding a bus in northern Israel Thursday, killing four people and injuring at least a dozen more. He was beaten to death by an enraged crowd. The violence heightens tensions over Israel's planned pullout from settlements in Gaza.\n\nLINDA WERTHEIMER, host:\n\nThis is MORNING EDITION from NPR News. I'm Linda Wertheimer.\n\nSTEVE INSKEEP, host:\n\nAnd I'm Steve Inskeep.\n\nPolice in northern Israel are on high alert after a shooting rampage. The man who opened fire was an Israeli army deserter, and by the time the soldier himself was killed, four Israeli Arabs were dead and 20 wounded. NPR's Linda Gradstein reports on what Prime Minister Ariel Sharon called the act of a bloodthirsty terrorist.\n\nLINDA GRADSTEIN reporting:\n\nIsraeli media report that 19-year-old Eden Natan Zada deserted the army about two months ago after refusing orders to help prepare for Israel's impending withdrawal from the Gaza Strip. Taking his army-issued M-16 rifle with him, Natan Zada moved to the Jewish settlement of Tapuach near Nablus in the West Bank. The settlement is known as the stronghold of Kach, an outlawed extremist movement that calls for the expulsion of all Arabs from both Israel and the occupied territories.\n\nLast night, Natan Zada, still in army uniform and carrying his gun, boarded a bus going from the northern Israeli city of Haifa to the town of Shfaram Amer. When the bus entered the Israeli Arab town, the 56-year-old driver called Natan Zada forward and asked him if he was sure he was on the right bus. It was at that point, according to Israeli media reports, that Natan Zada opened fire, shooting the driver in the head. He then emptied an entire magazine into the bus, killing a Christian shop owner and two Arab sisters who were students at a teachers college in Haifa.\n\nAs the shooting stopped, angry residents of Shfaram Amer stormed the bus and beat Natan Zada to death. It took police several hours to calm the situation before they were able to get on the bus and retrieve the bodies. The killings angered Israel's Arab citizens, who make up close to 20 percent of the population. Police braced for trouble Friday, ahead of the funerals for the victims of the rampage. But Jafar Farah, the director of an advocacy center for Israeli Arabs, denied there would be any unrest, and he charged the police with incitement.\n\nMr. JAFAR FARAH: There's no plans for demonstration. The plan is to have funerals of the victims. And the fact that this question is raised again and again, it's the fact that the security forces, especially the police, is inciting since last night about such riots that nobody's planning such a thing.\n\nGRADSTEIN: Israeli investigators say they're still not certain what prompted the rampage by Natan Zada, but his mother, Debbie(ph), speaking on Israel radio, blamed the army.\n\nDEBBIE (Eden Natan Zada's Mother): (Through Translator) I begged the army to go and get him. The army is guilty. They gave him the gun. They knew he didn't want to go to the army and they still gave him a gun. Now my child is gone.\n\nGRADSTEIN: Israeli officials say they have long feared this kind of an attack by an extremist, hoping to derail the government's plan to withdraw troops and Jewish settlers from Gaza. Joseph Alpher, an Israeli analyst and former intelligence official, says the rampage showed a clear intelligence failure.\n\nMr. JOSEPH ALPHER (Israeli Analyst): It seems to me that the mistake was not to put people like this, known extremists who have weapons--one, not to disarm them, and, two, not to put them under some kind of administrative detention, at least for the duration of the disengagement. Beyond that, I think the army has to ask itself how it doesn't succeed or does--perhaps doesn't even try to weed out people like this and get them out of the service and get them away from weapons.\n\nGRADSTEIN: With the start of the Israeli withdrawal now less than two weeks away, Alpher thinks another extremist attack is likely. Linda Gradstein, NPR News, Jerusalem.\n\nCopyright © 2005 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\n\nNPR transcripts are created on a rush deadline by an NPR contractor. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record."}, {"url": "http://www.chinadaily.com.cn/english/doc/2005-08/05/content_466721.htm", "page_content": "Israeli police brace for possible riots\n\n(AP)\n\nUpdated: 2005-08-05 19:17 Police braced for possible rioting Friday by Arabs incensed over the killings of four Israeli Arabs by a Jewish soldier opposed to Israel's impending pullout from Gaza, the Associated Press.\n\nMourners light candles on the site where a Israeli soldier opened fire on a bus killing four, in the northern Israeli town of Shfaram, early Friday, Aug. 5, 2005. [AP] The soldier, 19-year-old Eden Natan-Zada, boarded a bus in this Israeli Arab town Thursday and opened fire, killing the driver and three passengers and injuring 13. An enraged mob beat him to death after the shooting and prevented police from removing his body from the bus for hours. Police commissioner Moshe Karadi said forces had been diverted recently to deal with this week's anti-pullout demonstration in Israel's south, leaving the north ― where most of Israel's Arab population lives ― short-handed. He cautioned that the attack could trigger additional violence. In Jerusalem, ahead of Muslim Sabbath prayers on Friday, police raised their alert to the highest level and assigned SWAT teams and cavalry to the area, in anticipation of possible rioting in the Old City. For months, Israeli security has been warning that as the mid-August pullout from Gaza and four small northern West Bank settlements nears, desperate extremists might try to sabotage it by attacking Arabs and diverting forces. Natan-Zada's father said he deserted his army unit in protest after he was ordered to help prepare for the pullout and moved to Tapuah, an extremist West Bank settlement. The funerals for the four dead ― including two sisters in their 20s ― are to be held later Friday. Natan-Zada is also to be buried Friday in a civilian service, after the Ministry of Defense overturned the army's decision to accord him a military funeral without honors, the military said. The Haaretz newspaper cited witnesses as saying Natan-Zada boarded the bus bound for Shfaram, a city of 35,000 Muslims, Christians and Druze, in the northern city of Haifa. He wore the skullcap, beard and sidelocks of an ultra-Orthodox Jew, and an orange ribbon symbolizing opposition to the withdrawal was attached to a pocket, the newspaper said. When the bus entered a Shfaram neighborhood, Natan-Zada opened fire on the driver, killing him instantly, witnesses said. The bus rolled on for 20 yards until it hit a parked car and ground to a halt, Haaretz said. Natan-Zada continued shooting inside the bus, which was carrying about 20 passengers. He emptied an entire magazine. When he tried loading a new magazine, one of the passengers jumped him. Ahkim Janhwi told Israel Radio he wrestled the attacker to the ground and disarmed him ― only to be attacked by a confused crowd who thought he was the gunman. When the gunfire erupted \"I immediately lay down between the seats,\" Janhwi said. \"I thought about everybody who is important to me and who I'm important to, and I thought I was a goner. I closed my eyes and heard his footsteps getting closer to me. \"There was a woman sitting nearby who began screaming and begged him not to do anything to her, and at that moment I jumped on him and grabbed his gun,\" Janhwi said. \"He shot about three bullets, and I pulled him back. We rolled back to the back of the bus and I held him down. Then I called on people through the window to help me.\" People who boarded the bus beat Natan-Zada to death, media reports said. Television stations reported Thursday he was attacked with iron bars and stones. For hours, until the crowd was subdued, the gunman's body lay on the floor of the bus, his head covered with a black plastic bag. His shirtless upper torso was heavily bruised and bloodied. The windows of the bus were shattered by bullets and by rocks the mob threw at the gunman. Blood stained-seats, and rocks covered the bus floor. Burning candles marked the site of the attack on Friday morning. Police were looking for the people who killed the soldier, Army Radio said. Military chief Lt. Gen. Dan Halutz said he was \"definitely worried that people on the fringes are going too far.\" \"There is no doubt that the unfolding reality, the comments, and the internal debates causes fringe elements to migrate even more toward the fringes,\" Halutz told Israel Radio. Israeli Arabs were planning a commercial strike, demonstrations and a memorial gathering in Shrafam on Friday. In Nazareth, the largest Arab city in northern Israel, shops were shuttered Friday morning. Three juveniles from the West Bank Jewish settlement of Tapuah, aged 15 to 17, were arrested in connection with the deadly attack, Channel 2 TV reported. The three teenagers are suspected of hosting Natan-Zada, knowing of his intentions, and withholding evidence, the report said. Tapuah is dominated by followers of U.S.-born Rabbi Meir Kahane, who advocated expelling Arabs from Israel and the West Bank. Kahane was assassinated in New York in 1990. Prime Minister Ariel Sharon issued a statement condemning the attack as \"a despicable act by a bloodthirsty terrorist.\" He called for calm. Yitzhak Natan-Zada, 49, the soldier's father, said Thursday that he had asked the army to find his son, who fled from his unit after refusing to participate in the Gaza pullout. Natan-Zada said he was concerned his son's weapons would fall into the hands of fanatics in Tapuah. \"I wasn't afraid that he would do something. I was afraid of the others,\" Natan-Zada told The Associated Press in a telephone interview. He said he had no indication his son would carry out such an act. \"I spoke to him two days ago and he was a happy and good-hearted boy and he told me he would find the time to return the weapon,\" Natan-Zada said. It was the bloodiest such incident in Israel since 1990, when an Israeli opened fire at a bus stop where Palestinians gathered for job placements, killing seven. In 1994, Baruch Goldstein, an American-born Jewish settler, entered a holy site in the West Bank city of Hebron and opened fire on Muslim worshippers, killing 29 ― the bloodiest attack by a Jewish extremist against Palestinians. Palestinian leader Mahmoud Abbas called on Israel to prevent Jewish settlers from carrying weapons. Many have army-issue guns. Arab citizens of Israel make up about 20 percent of Israel's population of 6.9 million. Though they are full citizens, they have suffered from discrimination by Jewish-dominated governments. Many of their towns and villages lack basic infrastructure, and Arab localities usually top of Israel's unemployment lists.\n\n\n\nClose Japanese PM launches general election campaign Katrina slams US Gulf Coast, oil rigs adrift Japan's 6 parties square off in TV debate Today's Top News Top World News President Hu Jintao: Gender equality crucial\n\nSpecial grants offered to poor students\n\nEU takes steps to unblock China textiles\n\nFarmers sue county for illegal land use\n\nSearch for 123 trapped miners suspended\n\nHurricane Katrina rocks New Orleans\n\nBush promises post-storm help for victims Sharon: Not all settlements in final deal Hurricane Katrina rocks New Orleans Sri Lanka PM focuses on ending civil war Musharraf warns Pakistan Islamic schools Katrina may cost insurers $25 bln\n\nGo to Another Section select hot link News Center China World Business Life Sports Most Popular Photo Gallery Story Tools News Talk Are the Republicans exploiting the memory of 9/11? Find Suppliers Trade Leads Firm Directory Product Directory China Products Gold Suppliers Hot Products Hot Buys New Products Country Search Trade Shows"}]}