{"Natan-Zada was killed by a mob of angry townspeople after he opened fire on the bus.": [{"url": "https://www.theguardian.com/world/2013/nov/28/israeli-arabs-lynching-soldier-shooting-eden-natan-zada", "page_content": "An Israeli court sentenced seven Arab citizens to prison terms of between eight months and two years for their part in the lynching of a soldier who went on a deadly shooting spree in 2005.\n\nEden Natan-Zada was a Jewish extremist who went awol from his military unit in 2005 before embarking on a shooting spree on a bus in a northern Arab town. He killed four Arabs before running out of ammunition. An angry mob then beat him to death.\n\nA Haifa district court judge said that despite the soldier's actions, a democracy could not tolerate vigilante justice and rejected an \"eye for an eye\" defence. After the verdict on Thursday, Israeli Arabs hurled stones toward police in protest at what they called unjust punishment.\n\nMeanwhile, in Jerusalem, a two-year-old girl was moderately wounded when she was struck in the head by a stone hurled at the car in which she was traveling. A police spokesman, Micky Rosenfeld, said the attack appeared to be nationalistic in nature as Jewish vehicles are often targeted in the area by youths in nearby Arab villages.\n\nThe baby girl was taken to hospital, where the mayor of Jerusalem, Nir Barkat, called on authorities to crack down on a recent wave of stone-throwing attacks in the city. \"It's about time we start treating a stone as a weapon,\" he told Israel's Channel 10 TV.\n\nThe prime minister, Binyamin Netanyahu, wished the girl a speedy recovery. \"We will find these criminals and bring them to justice,\" he said."}, {"url": "https://www.haaretz.com/2005-08-08/ty-article/reconstruction-of-shfaram-lynch-shows-natan-zada-was-killed-after-some-policemen-stepped-off-bus/0000017f-ef16-d4cd-af7f-ef7e99dc0000", "page_content": "Some of the policemen who had shielded the Jewish terrorist, Eden Natan Zada, from an angry mob in Shfaram immediately after he had killed four people on a bus driving through the Arab city on Thursday, stepped off the vehicle, which enabled several people to board the bus and beat him to death. This scenario emerged from a reconstruction of the incident with Shfaram residents, defense forces and bus passengers.\n\nAt 5:05 P.M. on Thursday, Egged bus No. 165 to Shraram left Haifa's Lev Hamifratz station, where the Jewish terrorist Eden Natan Zada apparently got on. \"The religious Jewish soldier was on the bus, sitting in the back,\" Abtihaj Salame, who boarded the bus at the Kiryat Ata junction, said. \"Everyone thought he would get off before Shfaram, but he remained seated when the bus reached the city's entrance.\" Another passenger, Khail Janahawi, recalled that at 5:35 P.M., the driver asked the soldier to come to the front of the bus, but he ignored the request. \"When we reached Shfaram's Druze neighborhood, the soldier rose and walked to the front door, as though he wanted to get off. The door opened, and then he turned around and started shooting,\" Salame said.\n\nBadia Sha'aban was sitting in the back part of the bus when the attack took place. \"I didn't know what was happening,\" she said. \"I heard shots and screams, and lay between the seats. The soldier approached me, placed the barrel on my head and pulled the trigger. I closed my eyes and saw the end, but there were no bullets left. He started changing magazines, but I pushed him, and two others jumped on him and stopped him.\"\n\nA member of the security forces who was driving behind the bus in his car, said: \"I cocked my rifle and started running. I reached the back door, entered the bus with two others, and saw the terrorist aim his rifle at the head of a young woman, while he was trying to change magazines. We jumped on him. I held my rifle to his head, and told him to drop the gun. Hundreds of people crowded outside the bus. I held him tightly for a few minutes, and two policemen arrived. One of them handcuffed him, and I turned to the front of the bus to see what was happening. Four people including the driver were lying motionless there.\"\n\nThe man said that as soon as the terrorist was overcome, \"many people boarded the bus - mainly youngsters. The commotion was great. Within minutes, the bus was bursting with people and surrounded by an angry crowd, whose rage increased when it transpired that the shooter was a Jewish soldier.\"\n\nShfaram policemen reached the bus. One officer said Natan Zada was badly beaten but still alive. Channel 10 broadcast video clips yesterday confirming that the terrorist was alive after the shooting. Naatan Zada is seen walking in the bus bound. A few youngsters are seen bursting into the bus, while at least two policemen were inside it.\n\nAt 5:40 P.M. the telephone in Shfaram's emergency center rang. \"We were flooded with calls reporting massive shooting on a bus,\" M'houl, a paramedic, said. Five minutes later, M'houl was on the bus. \"I got in through the front door. The driver was slumped in his seat lifeless. Another passenger behind him was dead. Two women sat in the other front seat, one was lifeless and the other unconscious, but breathing. We started resuscitating her. I saw a commotion in the back of the bus. I did not know then that a soldier had done the shooting.\"\n\nAt 6:06 P.M., the media broadcast the report of the bus attack. Large police forces amassed at the city's entrance. Policemen surrounded Zada in the back of the bus. The crowd would not let them take Zada out with with the bodies. Ambulances came to evacuate the three bodies.\n\nShortly afterward, the crowd removed the bodies from the bus, leaving only Zada and the policemen on board. \"I saw his face covered with a black bag, but his legs were moving. I didn't know if he was alive or dead,\" a youngster said.\n\nThe police tried to prevent other youngsters from entering the bus under a shower of stones hurled by the crowd. The police tried to drive the bus away, but the crowd would not let them proceed.\n\nSome of the policemen left the bus, and many youngsters boarded it and wrestled with the remaining policemen inside. They finally reached Zada and beat him to death. \"He's finished,\" one of them yelled from the window.\n\nBy 10:20 P.M., religious leaders tried to persuade the crowd to disperse, but in vain. At 10:35 P.M., Zada's body was taken out of the back window into a police car, which drove through the crowd while youngsters threw stones at it. As soon as the terrorist's body was removed, the crowd calmed down and started to disperse. The town began to mourn its dead."}, {"url": "https://www.timesofisrael.com/killers-of-jewish-terrorist-get-11-24-months-in-prison/", "page_content": "The Haifa District Court on Thursday handed out jail terms ranging from 11 to 24 months to seven men convicted in the 2005 lynching of Jewish terrorist Eden Natan Zada, an AWOL IDF soldier who was beaten to death by a mob in the northern city of Shfaram after opening fire in a public bus, killing four.\n\nFour of the defendants, found guilty of attempted manslaughter, assaulting a police officer, rioting and interfering with a police investigation, received prison sentences ranging from 20 months to two years. A fifth defendant, found guilty of all the charges except attempted manslaughter, was sentenced to 18 months. A sixth defendant facing lesser charges was sentenced to 11 months in prison and the seventh defendant received eight months’ probation.\n\nAll the seven are from Shfaram, where the shooting took place.\n\nHundreds of residents of the Arab-Israeli village of Shfaram and other supporters rallied in their defense outside the court in Haifa on Thursday. Police spokesman Mickey Rosenfeld said 9 demonstrators were arrested after the court ruling for throwing rocks at police officers.\n\nMK Hanin Zoabi, who recently failed in her bid to become mayor of Nazareth, was also in attendance at the sentencing hearing, the Maariv newspaper reported, as were some 500 police officers.\n\nGet The Times of Israel's Daily Edition by email and never miss our top stories Newsletter email address Get it By signing up, you agree to the terms\n\nIn handing down the sentences, judge Ilan Schiff said that the state “cannot tolerate acts of retribution” even if they were unplanned, and noted the brutal nature of the mob violence which killed Zada.\n\nOn August 4, 2005, shortly before the Israeli withdrawal from Gaza, an AWOL IDF soldier, Eden Natan Zada, opened fire on a public bus traveling through an Arab village, killing four Israeli Arabs — Michael Bachus, Nader Khaik and the sisters Hazar and Dina Turki — and wounding 22 before he was subdued and beaten to death by the other passengers.\n\nZada killed his victims, the judges wrote, “simply because they were Arabs.”\n\nAdvertisement\n\nAfter the killing spree, and with Zada handcuffed and in police custody on the bus, the crowd prevented Israeli police from defending Zada and pummeled him for an hour, until long after he was dead. Later, as part of a massive police investigation, 12 Shfaram residents were arrested, with seven going on trial.\n\nTimes of Israel staff contributed to this report."}, {"url": "https://www.ynetnews.com/articles/0,7340,L-3727320,00.html", "page_content": "The Haifa District Prosecution filed formal charges against 12 Shfaram residents involved in the lynching of army deserter Eden Natan Zada in 2005.\n\nNatan Zada was beaten to death by a Shfaram mob after going on a murderous rampage in the northern Arab town, killing four people and wounded 22 others aboard a city bus.\n\nRelated stories:\n\nSeven suspects have been charged with attempted murder, aggravated assault on a police officer, obstruction of justice and rioting. Five other suspects have been charged with aggravated assault on a police officer, obstruction of justice and rioting. The cases are to be heard by the Haifa magistrates' and district courts.\n\nThe Haifa District Prosecution said that hundreds of depositions were taken during the court of the four-year investigation, resulting in the arrest of 12 suspects, ages 23 to 50.\n\n\"The State Prosecutor's Office is continuing to make the victim into the guilty party,\" Hadash Chairman Mohammad Barakeh said in response to the prosecution's move. \"Instead of tracing the actions of the man who committed the massacre and his accomplices and bring them to justice, (the prosecution) is blaming the victim,\" he said.\n\nFellow Hadash MK Afou Agbaria said, \"The residents of Shfaram should have been given a badge if honor instead of indictments for their heroic act. They protected the lives of the city's residents while placing their own lives at risk.\n\n\"The decision to indict serves as a green light to terrorists from the extreme right,\" he said, \"this is another example of the courts' double standard. When the residents of Jerusalem took the law into their own hands and lynched the tractor driver they were handed citations and not indictments.\"\n\nBalad Chairman Jamal Zahalka called the action a \"police provocation that sends the message that Arabs do not have a right to self-defense. We'll continue to demand the establishment of an objective inquiry committee tasked with exposing who was behind Zada's act,\" he said.\n\nAhmed Hamdi, chairman of the Shfaram committee established in the wake of Zada's attack, said \"this decision sets us back. This man (Zada) entered our city with the intent to kill, and he killed four residents in cold blood. He would have killed 50 if he had the chance.\n\n\"The young men who were indicted merely protected themselves in the face of the terrorist's attack. I call for the case to be closed. Continuing to deal with it will reopen a wound that hasn’t fully healed,\" he said."}, {"url": "https://www.haaretz.com/2013-08-02/ty-article/.premium/secrets-from-file-of-arab-killer-natan-zada-prosecutors-refused-to-call-him-a-terrorist/0000017f-ef4e-d497-a1ff-efce39b80000", "page_content": "The State Prosecutor’s Office refused to call Eden Natan-Zada, who killed four people in a shooting spree in Shfaram in August 2005, a terrorist. The prosecution said it did not want to “defame the dead,” reveals a document relating to the exchange between prosecutors and defense attorneys of seven people accused of attempted murder for attacking Natan-Zada, who was lynched by a crowd after he opened fire in the bus.\n\nA Haifa court on Monday acquitted seven Israeli Arabs of attempted murder in the lynching of Natan-Zada, but convicted four of them of attempted homicide and two more of aggravated assault. The court convicted all seven defendants of aggravated assault of police officers, obstruction of justice, and property damage due to rioting.\n\nNatan-Zada, a deserter from the IDF, was believed to have committed the murders in protest against Israel’s disengagement from Gaza, which was taking place at the time. He opened fire on passengers en route to Shfaram from Haifa using his army-issued rifle. He killed the bus driver, Michel Bahus, and three passengers, Nader Hayek and two sisters, Hazar Turki and Dina Turki, and wounded 20 others.\n\nAfter the indictments were filed against the seven defendants four years ago, the judges in the case recommended to both sides that they reach a plea bargain. The case was passed over to a mediator, but in August 2010 when the defense attorneys met with prosecutors, the negotiations blew up - even before the two sides discussed a deal. Instead they argued about changes the defense attorneys wanted made in the statement of facts in the indictment.\n\nDefense attorneys wanted to add the description “terrorist” to Natan-Zada’s name in the indictment in a number of places, and have it say he acted out of “nationalistic motives.”\n\nThe prosecution refused to have Natan-Zada refeerred to as a terrorist, and the defense attorneys documented the meeting and kept a record for themselves. Nonetheless, the two sides ended up reaching a plea bargain, though it was never completed.\n\nDespite the prosecution’s refusal, at the time of the shooting, then Prime Minister Ariel Sharon called Natan-Zada’s actions an “act of terror,” and the victim’s families were recognized as being the victims of hostile acts. The judge in the case also described Natan-Zada’s actions as terror n every way."}, {"url": "https://www.ynetnews.com/articles/0,7340,L-4459151,00.html", "page_content": "The Haifa District Court sentenced three of the attackers of Jewish terrorist Eden Natan Zada to two years in prison. In August 2005, Natan Zada murdered four Shfaram residents and was beaten to death by an angry mob. Two other defendants also received jail time, while one was given probation.\n\nNaaman Bahus, Basal Kadri and Jamil Sfori were sentenced to two years in prison. Basal Hatib was sentenced to 20 months in prison, Fadi Nasrallah to 18 months and Arka'an Korbag to 11 months.\n\nRelated stories:\n\nMeanwhile, hundreds of Shfaram residents demonstrated outside the court as the sentence was being handed down. Some said they will appeal the sentence. The protesters blocked a nearby road and began hurling stones. Police are at the scene trying to restore order.\n\nPresiding Judge Ilan Schiff said the State of Israel cannot tolerate acts of retribution. He noted the act was not planned but was particularly brutal, lasting a whole hour.\n\n\"We have no proof of discrimination against Jews in similar circumstances,\" he said. \"We did not see fit to address past cases where Jews who were tried for similar offences were pardoned.\" He explained this does not affect the sentence but the procedures following it.\n\nDefendants in court (Photo: Yotam Ronen)\n\nOutside the court hundreds of Muslims, Christians and Druze gathered to protest, among them Arab Knesset members. \"This is the toughest day for us,\" one of the defendants said. \"We deserve no punishment. We paid enough with all the hardships we’ve been through in the past few years. Unfortunately the state wants to turn us into terrorists instead of being honored.\"\n\nProtest outside court (Photo: Avishag Shaar-Yeshuv)\n\nSfori's brother told Ynet: We've seen similar incidents of Jews who killed Palestinians and ended up being commended by the State… they don't deserve even one day on prison… they were only defending themselves.\"\n\nHatib's father said: \"The entire case was unjust. All the defendants should have returned to their homes unpunished. Natan Zada came to us to murder people. He murdered four and could have murdered more. His death saved lives.\"\n\nHatib expressed hope that all the defendants be pardoned. \"Whoever does what Natan Zada did should not get out alive – whether Arab or Jew.\n\nBahus's father insisted that the defendants were not responsible for Natan Zada's death. Police on scene were responsible for his death. This trial was all politics. We're living in a racist country. They always punish Arab citizens but Jews who do the same thing are heroes.\n\nOn August 4, 2005, Natan Zada, an IDF soldier who had gone AWOL, opened fire at a bus in Shfaram, killing four people. He was then stopped by some of the passengers. Police officers who tried to remove him from the scene were unable to stop an angry mob from beating him to death.\n\nIn June 2009, indictments were filed against seven Shfaram residents for attempted murder, aggravated assault on a police officer, obstruction of justice and rioting.\n\nPhoto: Avishag Shaar-Yeshuv\n\nAccording to the indictment, each of the defendants assaulted the soldier, who was laying on the floor, with rocks and iron rods.\n\nLast July, the Haifa District on Monday convicted four out of seven defendants tried for the lynching of Eden Natan Zada of attempted manslaughter. Two were convicted of aggravated battery and one defendant was acquitted.\n\n\"No self-respecting society will tolerate lynching even if the person committed a heinous crime,\" the verdict read. \"Revenge is for God; punishment is for the judiciary.\"\n\nFollow Ynetnews on Facebook and Twitter\n\n"}, {"url": "https://www.ynetnews.com/articles/0,7340,L-4411157,00.html", "page_content": "The Haifa District on Monday convicted four out of seven defendants tried for the lynching of Eden Natan Zada of attempted manslaughter. Two were convicted of aggravated battery and one defendant was acquitted.\n\n\"No self-respecting society will tolerate lynching even if the person committed a heinous crime,\" the verdict read. \"Revenge is for God; punishment is for the judiciary.\"\n\nRelated stories:\n\n\"Our hearts are with the bereaved families who have lost their loved ones because of this hateful murderous crime,\" judge Ilan Schiff said. \"We find it hard to understand how a person decides to take lives and cause such suffering to families of innocents.\"\n\n\n\n\n\nDefendants in court (Photo: Eran Gilvarg)\n\nNatan Zada was beaten to death by a Shfaram mob after going on a murderous rampage in the northern Arab town, killing four people and wounded 22 others aboard a city bus.\n\nHundreds of people gathered outside the court in protest, expressing solidarity with the defendants. \"The case was handled with anti-Arab racism,\" said Jamil Safouri, one of the defendants. \"We are ordinary people and now I'm starting to think I am a murderer.\"\n\n\n\n\n\nProtest outside Haifa court (Photo: Avishag Shaar-Yeshuv)\n\nOn August 4, 2005, Natan Zada, an IDF soldier who had gone AWOL, opened fire at a bus in Shfaram, killing four people. He was then stopped by some of the passengers. Police officers who tried to remove him from the scene were unable to stop an angry mob from beating him to death.\n\n\"We can't forget this act of terror,\" said the mother of sisters Dina and Hazar Turki, who were killed in the attack. \"The State and the court should have taken our feelings under consideration and forgo a conviction.\"\n\n\n\n\n\nWaiting for the verdict in Shfaram (Photo: Mohamed Shinawi)\n\nIn June 2009, indictments were filed against seven Shfaram residents for attempted murder, aggravated assault on a police officer, obstruction of justice and rioting.\n\nAccording to the indictment, each of the defendants assaulted the soldier, who was laying on the floor, with rocks and iron rods.\n\nHundreds of Shfaram residents called for an acquittal, gathering in an encampment in the city.\n\n\"The atmosphere here is very tense,\" said Mayor Nahed Khazam. \"What happened in Shfaram, as then Prime Minister Ariel Sharon put it, was an act of terror.\"\n\nAttorney Yaakov Menkin, who represents the Zada family said, \"The family is completely heartbroken. They are hurt by the state that did not recognize their son as a fallen soldier, and for the mistreatment of the criminal case. This is a murder case but the charges were for minor offences. This act was recorded on footage, and everyone knows that the victim was alive but never made it to the police station alive.\"\n\n\"The defendants should have been convicted of murder. There was sufficient evidence to convict all suspects. It's inconceivable that an Israeli citizen, a soldier in uniform, is murdered, and the case ends with attempted manslaughter.\"\n\nThe attorney further added: \"We hope the prosecution will appeal, the family was hoping for justice, and justice was not served.\"\n\nThe other side was equally displeased. Attorney Maher Talahmi, representing one of the defendants said, \"We didn’t expect a conviction on such serious offences. The circumstances were clear, it was a terror attack.\"\n\nMK Mohammad Barakeh (Hadash) said, \"We do not accept the verdict. This is convicting the victim. Had they been Jews they would have gotten a citation.\"\n\nAhiya Raved, Hassan Shaalan and Raanan Ben-Zur contributed to this report\n\nFollow Ynetnews on Facebook and Twitter\n\n"}, {"url": "https://www.haaretz.com/2013-07-29/ty-article/4-convicted-of-lynching-jewish-terrorist/0000017f-e8a8-dc7e-adff-f8ad12e00000", "page_content": "A Haifa court on Monday acquitted seven Israeli Arabs of attempted murder in the lynching of Jewish terrorist Eden Natan-Zada, but convicted four of them of attempted homicide and two more of aggravated assault.\n\nThe court on Monday convicted all seven defendants of aggravated assault of police officers, obstruction of justice, and property damage due to rioting.\n\n\"At the very least, their intent was established,\" the judges said. \"The defendants' behavior before entering the bus shows intent to achieve their goal. They tried to kill Zada.\" They said it was unclear if Zada was already dead or alive, and added, \"Before the incident, there was a great provocation. The provocation was both objective and subjective,\" and therefore the defendants could not be convicted of attempted murder but rather of attempted homicide.\n\nNatan-Zada, a deserter from the IDF, was killed in a lynching shortly after he perpetrated an attack on a bus in Shfaram in August 2005, killing four. The act was believed to be in protest against Israel’s disengagement from Gaza taking place at the time.\n\nSome 300 residents of the northern Israeli city of Shfaram protested outside Haifa's District Court on Monday in support of the defendants. The city of Shfaram announced a general strike over the indictments against the seven. Protestors warned of roadblocks if convicted.\n\nIsraeli Arab leaders who came to the demonstration said the conviction would be a blow to their community.\n\n\"Anything short of the complete acquittal of the defendants would constitute the justice system saying the blood of an Arab is worthless and the blood of a Jew, even when he is a terrorist, is holy,\" said MK Mohammed Barakeh (Hadash). \"That is an equation we cannot live with.\"\n\nNatan-Zada opened fire on passengers en route to Shfaram from Haifa using his army-issued rifle. He killed the bus driver, Michel Bahus, and three passengers, Nader Hayek and two sisters, Hazar Turki and Dina Turki, and wounded 20 others.\n\nAfter the incident, photographs were published showing Natan-Zada was alive after he had been disarmed. The publication of these photographs led to a police investigation that ended with the arrest of 12 residents of Shfaram. Seven of them were charged with attempted murder, aggravated assault of police officers, obstruction of justice, and property damage due to rioting. The other five confessed as part of a plea bargain to interfering with and assaulting a police officer and were sentenced to community service. The seven defendants were Naaman Bahus, 37; Arkan Kurbaj, 27; Munir Zakut, 27; Basel Kader, 35; Basel Khatib, 29; Fadi Nasrallah, 36 and Jamil Sfouri, 49.\n\n“This is a political trial,” one resident told Haaretz. “It’s obvious to us that the seven are going to be convicted. The goal of the trial is to placate the right wing. The prosecutor couldn’t back down from the situation it had gotten itself into. When they are convicted, roads in the north will be blocked.”\n\nLast week, a protest tent was set up in Shfaram, and hundreds of residents have gathered there every evening to show solidarity with the defendants. Protesters also claim the state did not do enough to find those they say dispatched Natan-Zada to perpetrate the attack. The seven defendants deny the charges against them and their defense attorneys say there was no reason to try them.\n\nAttorney Maher Talhami said that no investigation had been opened in similar cases where civilians or police officers acted against suspected attackers. In some cases, he said, police officers and civilians even received citations from the defense establishment.\n\nTalhami also said it would be difficult to prove the defendants’ involvement in the crimes they are accused of. During the incident, he said, thousands of people congregated around the bus. The prosecution relied mainly on the testimony of police officers and photographs from the scene, claiming that Natan-Zada had been restrained and disarmed when he was beaten to death.\n\nOpen gallery view People surrounding the bus shortly after the attack in Shfaram Credit: Ancho Gosh/Gini\n\nOpen gallery view Residents of Shfaram protest outside Haifa District Court. Credit: Gil Eliyahu\n\nOpen gallery view Eden Natan Zada's parents holding up his picture as a child in 2005. Credit: Guy Raivitz"}, {"url": "https://merip.org/2005/12/crime-and-punishment-on-israels-demographic-frontier/", "page_content": "Crime and Punishment on Israel’s Demographic Frontier\n\nOn August 4, 2005, Natan Zada, 19, boarded an Egged bus at Haifa’s Hamifratz station, picked a seat in the back and rode it into Shafa ‘Amr, a mixed Druze, Muslim and Christian town in the heart of the Arab Galilee. Zada wore his Israel Defense Forces uniform and, as prescribed, carried with him his military-issued M-16 assault rifle, magazine primed in the slot. On any given day, Israel’s public transport system brims with young men like him, shuttling to and from military bases across the Israeli coastal plain and the occupied Golan Heights and West Bank. On this particular day, however, he was neither returning home nor reporting for duty. Several weeks earlier, he had deserted from the army in protest at his government’s evacuation of 8,000 settlers from the occupied Gaza Strip as part of Israel’s self-styled “disengagement” from shards of the Occupied Territories. Zada himself had recently moved to the West Bank settlement of Tapuah, where, it was later reported, he had fallen in with the far-right Kach movement. Formally outlawed by the Israeli government, Kach expounds a virulently racist ideology demanding the removal of all non-Jews from the Land of Israel. Once his bus had arrived in Shafa ‘Amr, Zada set his M-16 on automatic and put his beliefs into practice. He killed the driver and three passengers, and wounded another 12, before being overpowered and then beaten to death by angry townspeople, who shunted aside a handful of policemen belatedly arriving at the scene to handcuff the killer. All of the victims were Palestinian citizens of Israel, often termed “Israeli Arabs” by Israeli Jews.\n\nDeploying the kind of flanking public relations maneuver that has become his hallmark, Israeli Prime Minister Ariel Sharon moved quickly to contain the damage. To wide international acclaim, he branded Zada a “terrorist,” and slotted the shootings into appropriate context. “This terrorist event was a deliberate attempt to harm the fabric of relations among all Israeli citizens,” his office explained. It was widely presumed that Zada wanted to provoke disturbances among Israel’s Arab minority — a fifth of the Israeli population, and mostly concentrated in the country’s north — and so force the government to divert a share of the 40,000 soldiers and police mobilized for the southern Gaza evacuations, thereby disrupting the “disengagement.” At the very least, he inspired Asher Weissgan, 38, from the West Bank settlement of Shvut Rahel, who on August 17 shot dead four West Bank Palestinians with whom he worked in a nearby settlement industrial zone, and wounded two others. The following day Weissgan told the Israeli press he had “no regrets” and that he hoped someone would kill Sharon. The Israeli premier dutifully condemned the attack as an “exceptionally grave Jewish act of terror,” and “instructed the security establishment to deal harshly with all attempts to harm innocent people,” Israel Radio reported. In contrast to Zada’s attack, Weissgan’s crime garnered few headlines in Israel, and none in the international media, which was otherwise disengaged in Gaza. BBC World evening news showed the way by appending a one-line mention of the attack to a ten-minute panorama of tearful Gaza settlers jostling with Israeli soldiers.\n\nThat their lives are cheap came as no news to Palestinians in the Occupied Territories. To Palestinian citizens of Israel, however, Weissgan’s copycat rampage only deepened the sense that their own existence inside Israel is becoming similarly fraught, buffeted by obsessive Israeli demographic debates and hateful denigrations by senior politicians that reached a fever pitch in the run-up to disengagement, and in which “Israeli Arabs” figure as a national threat no less than their kin across the Green Line. In this respect, the government and media’s voluminous response to Zada’s attack did much less to reassure them than to remind them of how warped is the “fabric of relations” in which they are entangled.\n\nNews from Another Country\n\nFor Arab citizens attempting to follow events in Shafa ‘Amr on the evening of August 4, the most surreal spectacle was provided not by Natan Zada but by their national media. Following an hour of stumped silence, fragmentary reports began emerging on radio and television, hazarding at first, as transcribed by the Nazareth-based I‘lam Media Center, that “a Druze soldier shot at the passengers in the bus.” Two and a half hours after the attack, Channel 2 reported a “conflict between the passengers and the soldier, who was drawn into it, with these results” and went on to note that among the victims “there are some people who are not Jewish.” On the rival Channel 10 news network, anchors Yiron London and Tzvi Yehezkeli “retained an easy, relaxed atmosphere,” observed I‘lam. “At the top of the broadcast, [London] gave no acknowledgement to the headline newsflash of a ‘major event, with shooting and deaths,’ [instead] beginning his report with news on the Maccabi Haifa soccer team, reporting with more seriousness than he did for…Shafa ‘Amr. [Afterwards] Tzvi Yehezkeli joined London in the studio, also with [a] calm, serene face as if the murder of these four people was an imaginary event, involving the deaths of imaginary victims.”\n\nAnxious Arab families were left to imagine the worst. There was no coverage of the dozen people Zada had wounded, notes I‘lam: “No reports or interviews were made from the hospitals, no emergency numbers were broadcast and no psychologists assisting the families were interviewed…. Not one media outlet posed even one question about the wounded, in stark contrast to standard practice in similar incidents where the victims are Jews.” Coverage of Zada’s victims was largely crowded out by coverage of Zada himself, presented with a solemnity otherwise reserved for Jewish victims of Palestinian terror. His picture was shown on TV, captioned with his identity as an Israeli solider, the dates of his birth and death, and the epitaph “God Bless His Soul.” The day after, Hebrew and English tabloids carried front-page pictures of Zada and his bruised corpse. Papers excavated the human story behind the killer and incessantly interviewed his stricken family — an interest they could not arouse for any of his victims. While framed by a wall-to-wall display of solemn condemnation that even recruited Israeli settler representatives for full, if also surreal effect, the coverage served only to remind Palestinian citizens that they are marginal in Israeli society in ways that even a Jewish extremist like Zada could never be. The contrast with the media’s parallel presentation of disengagement as a national trauma uniting Jewish settlers and soldiers in a pastiche of grief was stark.\n\nLike Zada’s attack, such media coverage sharpened the question of just where Israel’s Arab citizens belong. What was most disquieting about his rampage was that it enacted a belief that they are as much enemies of their state as the Palestinians in the Occupied Territories — a presumption that Zada is far from alone in making, as the coverage infallibly demonstrated. Once the full story emerged, editorials and TV commentators predicted inevitable riots, muscularly anticipated by their government. In preparation for the funerals of Zada’s victims, Reuters reported, “Thousands of Israeli police were called to the north after alerts of potential riots,” ominously recalling that “forces shot dead 13 Israeli Arabs in October 2000 when they tried to quell a rally in support of a Palestinian uprising that had grown violent.” Such references to the “October Riots,” as they are known to most Israeli Jews, were ubiquitous in the press. Palestinian citizens of Israel had already registered the echo of an event they saw very differently — a debacle during which they had been open targets of a rhetoric and treatment akin to that meted out across the border.\n\nThe conversations that their Jewish co-citizens conducted over their heads the following week did nothing to allay this sense of elision. On August 11, the liberal Israeli daily Ha’aretz demoted the disengagement preparations and the Shafa ‘Amr fallout to lead with a piece of breaking census information. “For the First Time, Jews No Longer a Majority Between the Jordan and the Sea,” ran the headline. Nonetheless, the article reassured readers, by ditching Gaza and its 1.4 million Palestinians, Israel would buy itself Jewish demographic superiority for another 20 years. To Israel’s first citizens it was an overt plug for disengagement; to Palestinian citizens of Israel, it was a pointed reminder that the Jewish left-center lumps them with other Palestinians no less than did Zada. The inferred difference is that Kach begs the bigger question: after 20 years, then what? Aptly surmounting the day’s other headlines, the Ha’aretz census story provided a metatext for events in Gaza and Shafa ‘Amr. As veteran commentator Akiva Eldar fruitlessly noted in the same paper: “Solid politicians and popular intellectuals who lend a hand — whether by commission or omission — to erasing the Green Line that, in the collective consciousness, distinguishes residents of the Triangle [the densest cluster of Arab towns in Israel], from their neighbors in the West Bank, are turning Israel’s Arabs into enemies.”\n\n“Lynching” the Victims\n\nThe press, however, was already busy working the transformation. As I‘lam observed, on the night of the attack, Channel 2 broadcast only one picture from the scene: the picture of the “angry mob.” It lingered in the ether well into the night, explicated by comments like “the mob is still angry,” and signified by incessant references to the “riots” of October 2000. According to the version of the latter events then enshrined by the media, they were carried out by an armed Arab “mob” seeking to invade neighboring Jewish communities, egged on by the local Arab leadership. Evidence presented to a subsequent government-appointed inquiry, the Or Commission, showed this narrative to be patently false. Yet the myth prevailed, and it was now readily redeployed. Relentlessly interpolating “Israeli Arabs” as violent, irrational and easily “incited” pathogens within the body politic, the effect, as in the aftermath of October 2000, was to preposition them not as an aggrieved and threatened community but as a riot-in-the-making and to license, if necessary, their violent suppression. As Palestinian citizens mourned their dead, they were reminded that there might be more if they did not mourn quietly and that, as in 2000, those killed or executed would only have themselves to blame.\n\nThe “lynching” of Zada became a fulcrum for this discourse, the angle quickly adjusted by editorial headlines like “The Shame of the Jews — and Arabs.” International wire services and major networks like the BBC also peppered their online stories with the word “lynching.” In Israel, indeed, the killing of Zada became a story to rival his killings. On Channel 1, journalist Ayala Hason treated viewers to phrases like “they slaughtered him” and “they took their fury out on him.” These were carefully cultivated echoes of the lynching of two Israeli soldiers who had mysteriously become “lost” in Ramallah during the bloodiest phase of the Israeli army’s counterinsurgency in October 2000, so linking “Israeli Arab” behavior to that of the Palestinian enemy at large. Israelis didn’t fail to pick up on this. “Who knows what happened to him?” one neighbor of Zada’s family told the press. “Maybe the lynching of the soldiers in Ramallah affected him.” That the Israeli journalist dismissed this as a “delusional theory” did nothing to dampen the atmospheric resonance. The outrage was critically amplified by the fact that Zada was killed after the local police had boarded the bus and taken him into custody, effectively turning the affair into an Arab assault on Jewish authority. Sharon soon ordered a full investigation into the matter, stressing that everyone would be held accountable.\n\nBy taking Zada’s killers to task, the lynching narrative also burnished Israel’s self-image as a state committed to law and legality. Recouping its failure to uphold the law with respect to Jewish extremists, it thrust the spotlight back on its unruly\n\nArab minority. Indeed, as the media waxed nervous about the redistribution of security forces necessitated by disengagement, it reinforced the notion that law only existed when Jews were there to enforce it. Arab Knesset members fed grist into this mill by calling for the government to suspend its inquiry into Zada’s killing. “Usually a person who disarms a terrorist is considered a hero, but in this case the heroes are being accused,” protested one “Arab sector” leader to Israeli Army Radio. Under the headline “A Lynching Is a Lynching,” the right-leaning Jerusalem Post countered that “no country in which the law is properly enforced would permit an incident in which people take the law into their own hands to be ignored without in- vestigating the circumstances and those involved.”\n\nAs a few Jewish commentators observed, however, a bit of investigative vigilance would have been in order well before August 4. The attack was, as peace activist Uri Avnery commented, “a massacre foretold.” Zada was on an alert list maintained by the General Security Services (Shin Bet), was a known Kach member, and had done at least one reconnaissance tour on the bus in which he would stage his attack. He had also deserted the army with his gun in hand. “The murderer himself was arrested several times in the course of extreme right-wing activities in the past,” noted Avnery. “And why didn’t the army act, in spite of the fact that the commanders of the murderer knew that he had deserted in protest against the disengagement, taking his rifle with him? Indeed, his mother, who foresaw what was coming, bombarded the army with requests to find him and take the weapon away from him.” What no commentator reflected on, however, was the fact that if Zada had known that his was indeed a country where “the law is properly enforced,” he might not have extinguished four lives.\n\n“The Police Will Come, and It Will Be OK”\n\nFrom firsthand accounts it is possible to reconstruct the trail of events on August 4. As the bus entered a Druze neighborhood of Shafa ‘Amr and pulled up at a stop, Zada went to the front, leveled his M-16 at the Arab driver, Michel Bahous, 56, and shot him. He then moved down the aisles, firing in short bursts at the dozen passengers cowering in the back. One rider managed to jump out the open door. Zada killed Nadir Hayak, 55, and sisters Hazar and Dina Turki, aged 23 and 21 respectively, but ran out of bullets with the barrel leveled at the head of a pleading young woman. As he fumbled to change his clip, she shoved him. Other passengers saw their chance and rushed the assailant. They were quickly joined by Husam al-‘Ayan, an armed Druze security guard who was driving in his car behind the bus, and boarded through the open door. For five minutes the other men wrestled with and beat Zada, who clung to his weapon, according to al-‘Ayan. He was effectively under citizens’ arrest by the time a few policemen arrived to handcuff him. A mobile phone camera recording broadcast on Israeli TV showed that Zada was still alive at this time. Soon enough, however, a growing crowd overpowered the police and what remained of Zada’s life was beaten out of him.\n\nInferring that “he knew he would never get out alive,” Palestinian Knesset member Azmi Bishara dubbed Zada’s “a suicide operation” in Egypt’s al-Ahram Weekly. But Bishara was mistaken. As Zada confessed on the bus, he didn’t think for a moment that he would pay with his life for what he had done. “Do you know what you are doing?” one man asked the pinned-down soldier, according to al-‘Ayan. “There are soldiers and policemen living here.” The man was referring to the Druze, who have been encouraged by the state to foster an identity distinct from Arab Palestinians — and, unlike Muslims and Christians, must by law serve in Israel’s armed forces. “All I know is that this is an Arab town,” responded Zada. “Soon the police will come, and it will be OK.” His intended victims, now turned captors, knew he was right. “Punishment depends on nationality,” Amira Hass reminded Ha’aretz readers afterwards. Among others, she recalled the example of Yoram Skolnik, who in 1993 “murdered an Arab who was bound hand and foot, and was given a life sentence. President Ezer Weizman twice reduced his sentence: first to 15 years, and then to 11 years and three months. He was ultimately released seven years after his arrest. Skolnik is part of a list of Jews who murdered Arabs and were released by the judicial system.” The most poignant comparison, however, evaded even Hass.\n\nIn 1984, in what came to be known as the “Bus 300 Affair,” operatives from the Shin Bet — the same agency charged with investigating the killing of Zada — stormed an Egged bus hijacked by four Palestinian militants from Gaza. Two gunmen and a passenger were killed. The two remaining Palestinians were removed in handcuffs, as captured on film by Israeli journalists, and were soon executed on the orders of the agency’s director, Avraham Shalom. The government claimed they died on the way to hospital. Despite a lengthy and murky state investigation involving internal disciplinary hearings, no was ever jailed over the killings. When the attorney general threatened to indict the involved, he was sacked. To forestall any other legal challenges, Israeli President Chaim Herzog awarded the Shin Bet agents an amnesty in 1986, a decision subsequently backed by the Supreme Court. Ten years later, on his retirement from the Shin Bet, Ehud Yatom admitted to an Israeli newspaper that he had crushed his two captives’ skulls with a stone, adding that such extrajudicial killings were routine during Shin Bet operations. Yatom’s handiness did not much impede his career. In June 2001, Ariel Sharon sought to appoint him as a special “counter-terrorism” advisor but was forced to back down after the courts intervened. Today Yatom is a member of the Knesset for Sharon’s Likud party.\n\nSuch stories are familiar to Israel’s Palestinian citizens. As one witness to the attack told the Jerusalem Post: “If this attack had occurred in a Jewish neighborhood and the attacker was Arab, he would have been killed immediately. The police came and they didn’t do anything!” It was notable that al-‘Ayan himself had not used his gun, as he was trained to do against terrorists, and despite the fact that when he boarded the bus, Zada was still clutching his M-16. Al-‘Ayan is employed as a security guard by the Israeli government, serves in its armed forces and, in the absence of the police, boarded the bus as the state’s emissary. But the idea of an Arab killing a Jew, even when the Arab is defending life and the Jew threatening it, was too forbidding. Al-‘Ayan’s caution doubtless underscored to the local crowd that the arrival of the police meant not that Zada would be delivered unto justice, but that justice would be snatched from his victims. Told that he had treated them all as just Arabs, they returned the gesture. Over the ensuing days, it was commonly recounted in the neighborhood that there had been an additional 14 M-16 clips in a bag Zada had carried with him on the bus.\n\nEquality before the law was not an issue for the killer alone. At the funeral of Zada’s victims, ‘Abd al-Rahman Salih, a Bedouin leader, demanded that “the Israeli government destroy the house of the man who did this. If they do it to a [Palestinian] terrorist they should do it here.” In the irony-free corridors of Israel’s government, however, collective responsibility does not extend to Israeli Jews: Zada’s parents were not rendered homeless. When equal treatment was afforded, meanwhile, it was so conspicuous as to beg more questions than it stilled, as Amira Hass again noted: “Shortly after the murders in Shfaram [as Shafa ‘Amr is rendered in Hebrew], it was reported that those wounded and the families of the murder victims would receive recognition as victims of terrorism, dealt with and compensated accordingly. And the question immediately arose, since when do you highlight as a news item something that is self-explanatory and common sense? Except that equality among Jews and Arabs in Israel is not something self-explanatory. Therefore the news item, which should never have been a news item, was appropriate.”\n\nA ministerial committee later decided that it would not be possible to recognize Shafa ‘Amr’s dead and wounded as “victims of terror” because Zada was a soldier and could not under the law be identified as a “member of a hostile organization.”\n\nWanting to Believe\n\nZada’s choice of Shafa ‘Amr as the site for his attack exposed awkward ironies in the imagined Arab-Jewish equality in Israel. Though close to Nazareth, “capital” of Israel’s Arab Palestinian minority and home to many of its most prominent political and cultural figures, Shafa ‘Amr is widely viewed as a “pro-Israeli” Arab town by the government and praised as such by media commentators. During Israel’s 1948 war of independence its leadership openly cooperated with Jewish forces, with the result that its inhabitants were spared the forced evictions that accompanied the conquest and near emptying of Arab Palestine, executed with particular brutality in nearby villages like Tantura and Safsaf, where Zionist forces carried out a massacre of the civilian population. Tellingly, Shafa ‘Amr’s mayor served an uninterrupted term from the late 1930s through the 1960s, just after the Israeli government suspended the application of martial law to its Arab minority. Unusually, the present mayor is a member of the Likud. The spoils of such loyalty are evident in a gleaming glass-and-chrome cultural center on the outskirts of town, and in a relative prosperity that, while a pale shadow of the Galilee’s self-consciously “colonizing” Jewish communities, contrasts favorably with the crowded ghetto-like conditions of Arab towns like Nazareth, Acre and Sakhnin.\n\nIn this arrangement, Shafa ‘Amr’s Druze community, of which Husam al-‘Ayan is a typically upstanding member, occupies a marginally more privileged tier. Like him, Druze men serve in the Israeli security forces, one of the few employment advantages afforded them over other Arabs in Israel. Yet it is telling that, as a member of a community distinct from Israel’s Jewish citizens, al-‘Ayan’s exemplary conduct during the attack was not highlighted. In reporting by Ha’aretz he was identified only as a “security guard,” from which many readers would infer that he is Jewish. In the Arab mob tableau, he did not fit the picture. Indeed, a day before the expiration of the first deadline set by Sharon for the Shin Bet’s Shafa ‘Amr investigation, al-‘Ayan had not yet been interviewed by a single official, though he was an ideal witness for the state.\n\nThough none of Zada’s victims were Druze, his attack in Shafa ‘Amr’s Druze neighborhood opened minor cracks in the community’s relations with the government. Shamil Ibrahim, the owner of a kiosk across the street from where the shooting took place, was among the first Druze locals to board the bus. A lean man with a crew cut, he is also a member of the Israeli army’s crack Golani brigade, with a tour of duty in Lebanon on his record, and had just been called up to serve as part of the army’s disengagement mobilization. The day after the attack, however, he tore up his summons. “After what I saw, I can’t wear this uniform,” he explained with a hard stare. Knowing the importance of the Druze to Israel’s armed forces, Zada’s calculation may indeed have been to provoke precisely this kind of response. But Shamil is in a minority. Al-‘Ayan heeded his own call-up order that same week. Despite loud complaints from the police that nine officers had been injured in scuffles with the crowd, officers on the scene relied on local residents for cups of coffee and food as they entered a long standoff with the crowd for control of the bus. In the immediate wake of Zada’s rampage, Israeli flags still fluttered from several houses in Shafa ‘Amr’s Druze neighborhood. Such a sight is rare in Arab towns in Israel, even in less aggrieved circumstances.\n\nMany of Shafa ‘Amr’s residents belong to the always small and now further shrinking segment of Israel’s Arab (and less self-consciously Palestinian) population struggling to believe in the “fabric of relations,” tested though they may be by their government. A friend of Shamil’s, Jabbour Jabbour, a local travel agent and the son of Shafa ‘Amr’s Christian deputy mayor, proudly recounted that in the late 1990s he had made national and international news by trying to become the first Arab flight attendant on El Al airlines. He was declined three times by the hiring board and then took his case public, in what proved to be a major international embarrassment for Israel’s national carrier. Finally vindicated, he became a poster boy for how, purportedly, Arab citizens can combat prejudice within the parameters, and indeed with the help, of Israeli law. Though he never accepted his belated job offer, he feels his case opened the door to a few Arab individuals who later did, but he admits that such victories may still be token. He sustains no illusions in matters such as the Zada attack. “The problem was that people were afraid that if the police took him away he would be judged as crazy and freed after three to five years. He would be released a hero,” he said unhesitatingly.\n\n“Not an Isolated Incident”\n\nJabbour’s fears were justified. Zada had acted “in a fit of insanity,” according to a typical Israeli editorial in the wake of the attack. “We will not allow crazy men and terrorists to harm your life here,” echoed Israeli Vice Premier Shimon Peres as he visited the victims’ families two days later. Not incidentally, insanity was also the plea quickly adopted by Asher Weissgan’s lawyer in defense of his client. “A sane and balanced person would not have said what he said,” he argued, prompting the Petah Tikvah Magistrate’s Court to order a psychiatric evaluation. Though calls for Sharon’s head were hardly an aberration among the settler community in the run-up to disengagement, this rationalization found frequent purchase. Allowing Israeli society to selectively distance itself from Zada, the moniker of the Bad Apple from Tapuah (“apple” in Hebrew) rapidly gained currency in the press.\n\nImportantly, this pathological subtext also denied any equating of Jewish and Arab terror, Sharon’s condemnations notwithstanding. Zada was a sick human being, but a human being nonetheless. Arabs, by implicit converse, are merely sickly inhuman: unlike Jews, degeneracy is innate in their nature. Such inferences could not but be drawn by Palestinian citizens habitually characterized by Jewish politicians and religious leaders as a disease or vermin. The most frank exponents of such language are the Moledet and Yisrael Beiteinu parties, which campaign openly for the Arab population’s transfer from the country. Moledet sat in a coalition government with Sharon’s Likud from 2001 until 2004 and, like Yisrael Beiteinu, mines a deep vein of public sympathy. Support for transfer — expulsion — has always been high in Israel and is showing no signs of abating; a 2003 Democracy Index survey shows that 57 percent of Jews support the idea, either as implemented through “incentives” or by force. Not surprisingly, Peres’ assurances to Zada’s victims that “your pain is the pain of the entire State of Israel” were hard for most Palestinian citizens to swallow.\n\nAs Arab communities across Israel observed a one-day strike, Sheikh Ra’id Salah, the formerly imprisoned head of the Islamic Movement in Israel, echoed the rest of the Arab leadership in his response. “This is not an isolated incident. It is the outcome of the Israeli discriminatory policy against the Arab residents of Israel,” he noted at the Shafa ‘Amr funerals. “Israel officially incites against the Arabs in the country. Senior officials repeatedly state that we are considered a demographic danger, and describe us as cancer cells which should be removed.” State policy reflects such rhetoric, tightly constraining the development of Arab communities through rolling land confiscations, strict limits on new construction, house demolitions, discriminatory social budgeting and encystment by rings of Jewish development. That the Arab minority is socially disadvantaged is widely acknowledged by the Israeli media. As a rule, however, the effects of structural state violence are mystified by references to Arab primitiveness and anomie. Redress is at best indefinitely deferred, at worst openly acknowledged as a non-issue for a state whose primary responsibility is to its Jewish citizens. When Israel’s National Insurance Institute published a report five days after Zada’s attack showing that poverty in Israel has reached historic highs, a Ministry of Finance spokesman could accordingly hasten to add that more than two thirds of those poor were Arab and ultra-Orthodox (non-Zionist Jews). Critically, acknowledgement of discrimination never licenses Arab protest, a lack of empathy that conspicuously contrasts with the media’s coverage of the Zada family’s life on the down-and-out margins of the middle-class town of Rishon Letzion. “They have put us into a ghetto,” complained Zada’s father, Yitzhak. “How is it possible to live this way?”\n\nArab leaders who posed the same question after Shafa ‘Amr, however, were quickly intimidated and promptly vilified as agents provocateurs in an overt throwback to Israel’s master narrative of October 2000. In the mandate subsequently laid down for the Or Commission by the government, incitement charges against Arab leaders were prescribed as a fact and the Commission dutifully sustained them in three cases. Resetting the stage after Shafa ‘Amr, the hawkish Jerusalem Post sought to shift the blame even further, complaining: “In its final report that commission chose to place emphasis on the long history of official discrimination against the Arabs rather than on the growing and vociferous identification of the Israeli Arab leadership with Arafat and the PLO.” As documented by the Arab Association for Human Rights in Nazareth, police brutality against Palestinian citizens has continued unabated since October 2000, subject to widespread impunity. Symptomatically, not a single policeman has been prosecuted in connection with the October 2000 shootings, even though strong evidence, pointing inter alia to point-blank executions of protesters, implicated several officers. An official line was drawn belatedly under these events in September 2005, when the Justice Ministry’s investigations unit, Mahash, published a report after five years of mostly inactive inquiries in which it refused to indict a single police officer. But, whereas Israel’s attorney general has argued that incitement by Jewish anti-disengagement protesters, shading into death threats against Sharon, is merely part of lively public debate, Arab leaders who worked Zada’s actions into context were themselves immediately labeled as inciters.\n\nWith headlines like “Residents’ Restraint and Leaders’ Threats,” the media helped the government shift responsibility for any fallout onto Israel’s Arab leaders. “Most of the media (broadcast and print) did not hesitate to impose the task of ‘calming things down’ on the Arab members of the Knesset,” noted I‘lam. “Channel 1’s Ayala Hason dedicated all of her post-attack interviews with Arab MKs…to this subject.” Editorializing on the center-left, Ha’aretz admonished that “Israel’s political leaders — Jewish and Arab — must work together as seldom before to ensure that, in contrast to the early days of this round of conflict in the fall of 2000, protests and anger in the Israeli Arab community do not explode into bitter violence.” On the right, the Jerusalem Post fulminated against those responsible “five years ago” for “widespread anti-Israel hostilities…in obvious coordination with the eruption of Yasser Arafat’s second murderous intifada in the territories.” Largely, the coverage singled out for censure the very same leaders targeted by the Or Commission as “inciters” and “organizers.” The Jerusalem Post was not above seeing such shadowy forces at work on the bus itself. “It may well be that Zada was killed in a more calculated fashion by extremist elements in what has been one of the most pro-Israel minority cities in Israel,” warned one editorial.\n\nAfterthoughts on the Margins\n\nThe final narrative of Shafa ‘Amr came to rely heavily on the “extremist element.” Its ghost plainly gunned for Palestinian citizens as they grappled with the event. When the crowd sang “Biladi, Biladi,” the popular Palestinian national anthem, while mourning and protesting at the scene of the attack, TV reporters immediately seized upon this as a “call to extremism,” noted I‘lam. Israeli viewers would have been even more alarmed by the funerals of Zada’s victims. In cars festooned with black antenna strips — contrasting with the orange strips adopted by Israeli Jewish anti-disengagement protesters — more than 10,000 Arabs from Shafa ‘Amr and the surrounding area gathered in town om August 5. Many joined a solemn procession conveying the coffins of sisters Hazar and Dina Turki to their graves, threaded with young men holding aloft a few Palestinian flags and shouting slogans like “With our blood and soul, we will sacrifice for you, o martyr.” Leading the procession, Shafa ‘Amr native and MK Muhammad Baraka spoke to the crowd of Israel’s history of violence against its Palestinian citizens.\n\nMore ambivalent dissent was voiced by the Arab Higher Follow-Up Committee, a moribund association dominated by mayors. Spokesman ‘Abid Anabtawi predicted the possibility of a “non-violent intifada” erupting in response to the killings. “A popular uprising against the fascism and negative treatment we receive is the most reasonable scenario,” he told Israeli Army\n\nRadio. Yet such rhetoric was immediately softened by committee chairman Shawqi Khatib, who said that the Israeli Arab leadership would continue “to act responsibly as it has in the past 57 years.” There were other signs of fabric mending at work: wreaths from the Israeli government deposited on the graves of victims that none of the protesters thought to remove, and the appearance of Rabbi Menachem Froman from the West Bank settlement of Tekoa at a prayer ceremony for Zada’s two Christian victims, condemning the soldier on behalf of Israel’s Sephardi Chief Rabbi Shlomo Amar. “Nothing will happen,” one despondent Arab activist commented during the funeral. “People will talk about it. It’s good, nice, to see people unite. The question is, what will we do Monday? We are still living with them [the Jews] as if nothing has happened.”\n\nYet in contrast to an Arab minority still struggling to organize dissent within the forbidding parameters laid down by their government, the Jewish “fringe” makes no attempt to “live with them as if nothing has happened.” In the wake of the attack, Jerusalem Post writer Yosef Goell was content to reinvent common Israeli illusions of normalcy. “No segment of Israeli society has condoned this attack, much less cheered it,” he averred. “The contrast between these attitudes and the funerals of Palestinian terrorists is telling. No frenzied thousands are waiting to march with Zada’s coffin, to vow more bloodshed and glorify him as a heroic martyr.” The posturing at Hamas funerals is, however, the preserve of the weak. The militant settlers, one of whom told Ha’aretz at Zada’s funeral that Zada was “a righteous man and did what we are incapable of doing,” launch attacks on Palestinian villages from state-subsidized settlements with only very occasional penalty.\n\nSentiments like those voiced at Zada’s funeral, moreover, are more common than many Israelis would like to admit. A 1987 poll of Jewish youth conducted by the Van Leer Institute showed that one third “supported the ideas of Rabbi Kahane and his [Kach] movement.” A 2001 Haifa University survey found that 20 percent of Israelis would vote for Kach if permitted to do so. Ironically, legalization of the movement is no longer necessary, with Moledet and Yisrael Beiteinu channeling Kahane’s politics into more elliptical and therefore ostensibly permissible agendas. The latitude nevertheless afforded Jewish\n\n“extremists” contrasts starkly with the state’s obsessive concerns about Arab militancy, observes Uri Avnery. “The Kach group was officially declared a terrorist organization and outlawed some 12 years ago. This means that anyone belonging to it, supporting it or assisting it with money or in any other way, is legally considered a terrorist…. But for years now, the Kach people have been roving the country without hindrance and have committed numberless outrages against Israeli Arab citizens and inhabitants of the occupied Palestinian territories.”\n\nIndeed, in attempting to distance themselves from Zada, Israeli Jews struggled to compartmentalize a “fringe” movement whose sensibilities increasingly ply the country’s political mainstream, rehabilitated by media coverage of the disengagement process. On the Israeli left, some commentators sought to attribute Zada’s action to the zealotry incubated in the country’s settlements. Eliding the quiet repression of Israel’s own Arab citizens, this narrative also contended awkwardly with the fact that in the summer of 2005 no Israelis were at once presented as more human and more sacrificing for their nation and its ideals than these zealots. In the weeks following Zada’s attack, TV screens filled with children and tight nuclear families and gardens and houses and pets, everyone hugging and crying. The pathological Zada fitted poorly into this picture. More typically therefore he was described by one reporter for the Jerusalem Post as “unconsciously camouflaged by the thousands of the settlement movement’s entirely peaceful activists…. His newfound fanaticism fueled his hatred, and compelled him to do what the vast majority of settlers think unconscionable.”\n\nThat settler “activists” had on June 29 tried to stone to death a Palestinian youth by Gaza’s Gush Katif bloc had no bearing on such explications. Nor did a trail of killings in the West Bank — some perpetrated by prominent settler leaders like Pinhas Wallerstein — of which Weissgan’s was only the most recent. Instead, the spectacle of military officials demanding that settler leaders condemn Zada and Weissgan contributed to the re-edification of the “ethical” colonists, and displaced questions about the underlying politics that spawns their project. Chasing away from Zada’s grave “a few children with long side curls and big woolen skullcaps…[is] easier than dismantling Tapuah,” commented Tom Segev in Ha’aretz. In parsing the final ruckus over where Zada would be buried, Segev also noted that, though many settlers and ordinary Israelis might indeed shy away from emulating Zada, theirs would not be a judgment on killing Arabs, as much as the context of such killing. “Defense Minister Shaul Mofaz prohibited Natan Zada’s burial in a military cemetery,” noted Segev, “as though he had not been a soldier or had served in a different army. Mofaz, who is not exactly a moral authority, argued that the murderer of Arab passengers on a bus was ‘not worthy’ of a military grave. However, if we were to remove from the military cemeteries all the soldiers who are tainted with moral opprobrium, in some cases for illegal killing of Palestinian civilians, quite a bit of space would become available.”\n\nA Matter of Time and Place\n\nAs much as Zada’s attack, Israeli discourse on it proved a disturbingly revealing installment in a running debate about the terms of Palestinian life both in and out of Israel. Though it cuts to the heart of the question of just who and where they should be, this is not a debate in which Palestinian are included and it remained that way after Shafa ‘Amr. As Yitzhak Laor characterized their enduring situation in Ha’aretz: “They are part of the demographic danger; their mothers’ wombs are a ticking bomb…. Because they constitute a ‘demographic danger’ — and they must hear this every day, because they do make children — and if their children overcome the backwardness that is fostered from above and make it to university, here, too, they have to listen to learned discussions about the danger of their natural increase…. Who will now include the experts on the demographic danger among those responsible for incitement? As a rule, the Arabs are a danger, a matter of time. How much time? It’s not clear.”\n\nIf disengagement is a preemptive maneuver in the demographic battle Israel self-consciously wages against all the Palestinians under its rule, Zada bloodily reminded everyone of its final frontier. Currently demarcated inside Israel by a combination of disenfranchisement, discrimination and occasionally overt violence, this divide hardened further in Shafa ‘Amr. Unreflective acceptance of Israel’s terms of engagement with its Palestinian and Arab minority allowed most Jewish Israelis to cast Zada’s act as that of a crazed loner, and simultaneously use the opportunity to reinscribe limits to any Arab challenge of these terms. Israeli Palestinian reactions, on the other hand, could not but be filtered through their broader experiences within the threadbare “fabric of relations.” To them, the larger question remains whether Israel is disengaging not just from Gaza and slivers of the West Bank, but also from a future in which Palestinians might have a real and secure place anywhere in their own country."}, {"url": "https://www.ynetnews.com/articles/0,7340,L-3555829,00.html", "page_content": "The Haifa District Prosecution subpoenaed Sunday 12 of Shfaram's residents to a pre-trial hearing in connection with the killing of IDF soldier Eden Natan Zada.\n\nZada, a military deserter, boarded a bus in Shfaram in August of 2005 and began shooting its passengers, killing four people and wounding nine, before he was apprehended by some of the passengers. He was later captured by a local mob and beaten to death.\n\nProtests Protest: Don't put lynch perpetrators on trial Roee Nahmias Hundreds of residents of Arab town of Shfaram call not to put those who perpetrated lynch of Jewish soldier terrorist Eden Natan Zada, who murdered four Shfaram residents in August 2005. MK Barakeh: 'We will break any hand raised against us' Protest: Don't put lynch perpetrators on trial\n\nThe prosecution stated it is considering indicting all 12 on various charges of aggravated assault. None of the men are currently facing manslaughter or murder charges.\n\nTen months after the attack, police arrested six people in connection to Zada's lynching. A seventh suspect turned himself in shortly thereafter.\n\nSeveral weeks after being detained, the suspects were remanded to house arrest. The arrests inflamed Shfaram's residents, who initiated a series of protest rallies against the State's intent to prosecute the alleged offenders.\n\n\n\n\n\nThe Shfaram bus, shortly after the attack (Archive photo: AP)\n\nBalad chairman, MK Jamal Zahalka slammed the Haifa prosecution's decision to subpoena the Shfaram residents in the case: \"This is an act of provocation. The police failed to find out who was assisting Zada and who sent him, and are blaming the victims. If they indict they will have riots on their hands,\" he said.\n\nHadash Chairman MK Mohammad Barakeh added that \"any minute longer in which Zada would have lived could have claimed the lives of many more of Shfaram's residents.\n\n\"The investigation should focus on the military, which knew they had a dangerous deserter on their hands,\" he said."}], "Natan-Zada killed four people and wounded several others in the attack.": [{"url": "https://www.theguardian.com/world/2013/nov/28/israeli-arabs-lynching-soldier-shooting-eden-natan-zada", "page_content": "An Israeli court sentenced seven Arab citizens to prison terms of between eight months and two years for their part in the lynching of a soldier who went on a deadly shooting spree in 2005.\n\nEden Natan-Zada was a Jewish extremist who went awol from his military unit in 2005 before embarking on a shooting spree on a bus in a northern Arab town. He killed four Arabs before running out of ammunition. An angry mob then beat him to death.\n\nA Haifa district court judge said that despite the soldier's actions, a democracy could not tolerate vigilante justice and rejected an \"eye for an eye\" defence. After the verdict on Thursday, Israeli Arabs hurled stones toward police in protest at what they called unjust punishment.\n\nMeanwhile, in Jerusalem, a two-year-old girl was moderately wounded when she was struck in the head by a stone hurled at the car in which she was traveling. A police spokesman, Micky Rosenfeld, said the attack appeared to be nationalistic in nature as Jewish vehicles are often targeted in the area by youths in nearby Arab villages.\n\nThe baby girl was taken to hospital, where the mayor of Jerusalem, Nir Barkat, called on authorities to crack down on a recent wave of stone-throwing attacks in the city. \"It's about time we start treating a stone as a weapon,\" he told Israel's Channel 10 TV.\n\nThe prime minister, Binyamin Netanyahu, wished the girl a speedy recovery. \"We will find these criminals and bring them to justice,\" he said."}, {"url": "https://www.haaretz.com/2013-08-02/ty-article/.premium/secrets-from-file-of-arab-killer-natan-zada-prosecutors-refused-to-call-him-a-terrorist/0000017f-ef4e-d497-a1ff-efce39b80000", "page_content": "The State Prosecutor’s Office refused to call Eden Natan-Zada, who killed four people in a shooting spree in Shfaram in August 2005, a terrorist. The prosecution said it did not want to “defame the dead,” reveals a document relating to the exchange between prosecutors and defense attorneys of seven people accused of attempted murder for attacking Natan-Zada, who was lynched by a crowd after he opened fire in the bus.\n\nA Haifa court on Monday acquitted seven Israeli Arabs of attempted murder in the lynching of Natan-Zada, but convicted four of them of attempted homicide and two more of aggravated assault. The court convicted all seven defendants of aggravated assault of police officers, obstruction of justice, and property damage due to rioting.\n\nNatan-Zada, a deserter from the IDF, was believed to have committed the murders in protest against Israel’s disengagement from Gaza, which was taking place at the time. He opened fire on passengers en route to Shfaram from Haifa using his army-issued rifle. He killed the bus driver, Michel Bahus, and three passengers, Nader Hayek and two sisters, Hazar Turki and Dina Turki, and wounded 20 others.\n\nAfter the indictments were filed against the seven defendants four years ago, the judges in the case recommended to both sides that they reach a plea bargain. The case was passed over to a mediator, but in August 2010 when the defense attorneys met with prosecutors, the negotiations blew up - even before the two sides discussed a deal. Instead they argued about changes the defense attorneys wanted made in the statement of facts in the indictment.\n\nDefense attorneys wanted to add the description “terrorist” to Natan-Zada’s name in the indictment in a number of places, and have it say he acted out of “nationalistic motives.”\n\nThe prosecution refused to have Natan-Zada refeerred to as a terrorist, and the defense attorneys documented the meeting and kept a record for themselves. Nonetheless, the two sides ended up reaching a plea bargain, though it was never completed.\n\nDespite the prosecution’s refusal, at the time of the shooting, then Prime Minister Ariel Sharon called Natan-Zada’s actions an “act of terror,” and the victim’s families were recognized as being the victims of hostile acts. The judge in the case also described Natan-Zada’s actions as terror n every way."}, {"url": "https://www.haaretz.com/2013-07-29/ty-article/4-convicted-of-lynching-jewish-terrorist/0000017f-e8a8-dc7e-adff-f8ad12e00000", "page_content": "A Haifa court on Monday acquitted seven Israeli Arabs of attempted murder in the lynching of Jewish terrorist Eden Natan-Zada, but convicted four of them of attempted homicide and two more of aggravated assault.\n\nThe court on Monday convicted all seven defendants of aggravated assault of police officers, obstruction of justice, and property damage due to rioting.\n\n\"At the very least, their intent was established,\" the judges said. \"The defendants' behavior before entering the bus shows intent to achieve their goal. They tried to kill Zada.\" They said it was unclear if Zada was already dead or alive, and added, \"Before the incident, there was a great provocation. The provocation was both objective and subjective,\" and therefore the defendants could not be convicted of attempted murder but rather of attempted homicide.\n\nNatan-Zada, a deserter from the IDF, was killed in a lynching shortly after he perpetrated an attack on a bus in Shfaram in August 2005, killing four. The act was believed to be in protest against Israel’s disengagement from Gaza taking place at the time.\n\nSome 300 residents of the northern Israeli city of Shfaram protested outside Haifa's District Court on Monday in support of the defendants. The city of Shfaram announced a general strike over the indictments against the seven. Protestors warned of roadblocks if convicted.\n\nIsraeli Arab leaders who came to the demonstration said the conviction would be a blow to their community.\n\n\"Anything short of the complete acquittal of the defendants would constitute the justice system saying the blood of an Arab is worthless and the blood of a Jew, even when he is a terrorist, is holy,\" said MK Mohammed Barakeh (Hadash). \"That is an equation we cannot live with.\"\n\nNatan-Zada opened fire on passengers en route to Shfaram from Haifa using his army-issued rifle. He killed the bus driver, Michel Bahus, and three passengers, Nader Hayek and two sisters, Hazar Turki and Dina Turki, and wounded 20 others.\n\nAfter the incident, photographs were published showing Natan-Zada was alive after he had been disarmed. The publication of these photographs led to a police investigation that ended with the arrest of 12 residents of Shfaram. Seven of them were charged with attempted murder, aggravated assault of police officers, obstruction of justice, and property damage due to rioting. The other five confessed as part of a plea bargain to interfering with and assaulting a police officer and were sentenced to community service. The seven defendants were Naaman Bahus, 37; Arkan Kurbaj, 27; Munir Zakut, 27; Basel Kader, 35; Basel Khatib, 29; Fadi Nasrallah, 36 and Jamil Sfouri, 49.\n\n“This is a political trial,” one resident told Haaretz. “It’s obvious to us that the seven are going to be convicted. The goal of the trial is to placate the right wing. The prosecutor couldn’t back down from the situation it had gotten itself into. When they are convicted, roads in the north will be blocked.”\n\nLast week, a protest tent was set up in Shfaram, and hundreds of residents have gathered there every evening to show solidarity with the defendants. Protesters also claim the state did not do enough to find those they say dispatched Natan-Zada to perpetrate the attack. The seven defendants deny the charges against them and their defense attorneys say there was no reason to try them.\n\nAttorney Maher Talhami said that no investigation had been opened in similar cases where civilians or police officers acted against suspected attackers. In some cases, he said, police officers and civilians even received citations from the defense establishment.\n\nTalhami also said it would be difficult to prove the defendants’ involvement in the crimes they are accused of. During the incident, he said, thousands of people congregated around the bus. The prosecution relied mainly on the testimony of police officers and photographs from the scene, claiming that Natan-Zada had been restrained and disarmed when he was beaten to death.\n\nOpen gallery view People surrounding the bus shortly after the attack in Shfaram Credit: Ancho Gosh/Gini\n\nOpen gallery view Residents of Shfaram protest outside Haifa District Court. Credit: Gil Eliyahu\n\nOpen gallery view Eden Natan Zada's parents holding up his picture as a child in 2005. Credit: Guy Raivitz"}, {"url": "https://www.haaretz.com/2013-11-28/ty-article/.premium/lynch-defendants-sentenced/0000017f-e0ab-d568-ad7f-f3ebfd820000", "page_content": "Six Israeli Arabs were sentenced Thursday to terms of up to two years in jail for their role in lynching Eden Natan-Zada, who killed four Israeli Arabs and wounded more than 20 in a shooting spree on a bus in Shfaram in 2005.\n\nNa’aman Bahus, Basel Kadari and Jamil Sapori, who were convicted of attempted manslaughter, were each sentenced to two years. Basel Khatib, convicted of the same charge, was sentenced to 20 months, while Fadi Nasrallah and Arkan Kurbaj, both convicted of aggravated assault, were sentenced to 18 and 11 months, respectively. All six were also found guilty of assaulting policemen. Munir Zakut, who was convicted only of assaulting a policeman, received an eight-month suspended sentence.\n\nJudges Ilan Shiff, Hanny Horowitz and Tsila Keinan of the Haifa District Court said that jail terms were necessary to uphold two vital social values: the sanctity of life and law and order. Nevertheless, they added, the sentences would have been much stiffer had it not been for “the unique circumstances of the case,” which they said made it one of the hardest sentencing decisions they had ever faced.\n\nThe sentences will be deferred for 45 days while the defendants decide whether to appeal. But defense attorneys said that from a legal standpoint, they were actually satisfied with the court’s leniency, noting that prosecutors had sought jail terms of six to nine years. Sentences that didn’t include jail time were never a realistic expectation, said one, Maher Talhami.\n\nThe defendants, however, disagreed, as did the hundreds of Shfaram residents and Israeli Arab political activists who demonstrated outside the court yesterday. “The sentence revealed the state’s racist face,” Sapori charged. “If we had been Jews, they surely wouldn’t have sent us to jail.”\n\nThe demonstrators denounced the legal system vociferously, and at one point, during a scuffle with police, rocks and stun grenades were thrown. Ten demonstrators were arrested.\n\nIn Shfaram itself, a general strike was called to protest the ruling. Mayor Amin Anabtawi explained that most residents think the seven should never have been indicted to begin with.\n\nNatan-Zada, an AWOL soldier and Kahanist, was apparently acting in opposition to the upcoming disengagement from Gaza when, with his army-issue rifle, he boarded a bus en route to Shfaram from Haifa on August 4, 2005. As Natan-Zada shot at passengers, an angry mob stormed the bus and killed him. Police opened an inquiry into his death after viewing photographs that showed him still alive after being disarmed and bound.\n\nOpen gallery view Protests outside the Haifa District Court during the sentencing hearing in the lynching of Eden Natan-Zada. Credit: Rami Shlush\n\nOpen gallery view Defendants in the lynching of Eden Natan-Zada at court, November 28, 2013. Credit: Rami Shalush\n\nOpen gallery view People surrounding the bus shortly after the attack in Shfaram Credit: Ancho Gosh/Gini"}, {"url": "https://www.ynetnews.com/articles/0,7340,L-3262230,00.html", "page_content": "It was cleared for publication Tuesday that Police have arrested six suspects in the lynching of Jewish terrorist Eden Natan Zada, who shot four Israeli-Arabs dead in Shfaram ten months ago.\n\nThree suspects were apprehended in their Shfaram homes Monday night, and two more were arrested near Eilat and Kiryat Gat. Another suspect was brought in from his incarceration in the Tzalmon Prison.\n\nShfaram Lynch Killer's last moments Ynetnews Arab photographer captures Shfaram terrorist bound by his hands, moments before angry mob kills him Killer's last moments\n\nThe seventh suspect later handed himself over to police.\n\nThe suspects, ages 20, 24, 26, 28, 30, and 42, and another suspect scheduled to be detained Tuesday will be brought before a Haifa court to extend their remand.\n\nThe suspects, three Muslims, three Druze, and one Christian, reflect the population in Shfaram. They were arrested after the police received photographed material from the media and testimonies from police officers and witnesses.\n\nThe commander of the Northern District Police established a special investigative team headed by Chief Superintendent Haim Rahamim, who investigated the case over the last 10 months.\n\nPolice didn’t escape criticism, however, and many question their action, asking why it took so long to arrest the suspects in light of the clear evidence police has against them.\n\n\"I'm sure the police had other instructions and was weighing political reasons,\" said chairman of the Hadash party, MK Mohammad Barakeh, who criticized the arrests in Shfaram.\n\n\n\n\n\nSuspect in police custody (Photo: Hagai Aharon)\n\n\"Such arbitrary arrests are meant to serve the right-wing on the eve of the one year anniversary to Zada's massacre,\" said Barakeh, and added that \"residents of Shfaram protected themselves when they realized that the killer meant to murder more people. Police and the security forces have been searching ever since for an alibi to falsify the facts and deny the fact that there has been a massacre in town.\"\n\nMK Jamal Zahalka (National Democratic Assembly) said after the arrests \"they put the blame on the victim, once again. In Shfaram there was vile killer who killed four civilians and the residents protected themselves. Instead of adding insult to injury the police must investigate who the killer's accomplices were and who turned a blind eye.\"\n\nTonight the \"Popular Committee,\" which was established following the Zada incident, will convene to determine how to provide aid to the suspects that were arrested and how to convey Shfaram residents' protest following the arrests. The committee consists of public officials and attorneys from Shfaram.\n\nPayback Jewish Terrorist's grave desecrated By Eli Senyor Vandals dump sign, remove dirt from gravesite of Jewish terrorist Eden Natan Zada in Rishon Lezion Jewish Terrorist's grave desecrated\n\nTen months ago extreme right-wing activist Zada opened fire in bus number 165 in Shfaram, killing four of the passengers and wounded nine otthers.\n\n'A law is a law'\n\nZada was an IDF deserter who spent much of his time in the West Bank settlement of Kfar Tapuah and was known to be a Kach activist. Angry residents managed to board the bus after the shooting and lynched Zada. Police managed to evacuate Zada's body only four hours later and put it in a police vehicle, while religious leaders used loudspeakers to persuade the mob not to attack the officers.\n\nNorthern District Police Chief Dan Ronen said the incident is especially complicated and sensitive. \"The investigation was conducted under strict professional consideration. It is my guarantee. There were no political considerations, not even from the minister who is responsible.\"\n\nRonen added: “In a country with law and order, despite the sensitivity, people can't do whatever they see fit. I hope the Arab sector will display maturity and responsibility.\n\nHe also spoke with the mayor of Shfaram, Orsan Yassin, who responded by saying that \"a law is a law, and an order is an order.\"\n\n“My opinions were clear from the beginning: I demanded no investigation and no arrests. I would prefer that Zada stay alive and get punished by the court of law, but what was done to him was the public's expression of rage\" he said.\n\nRonen reiterated that the investigation was carried out with the utmost sensitivity. \"We learned our lessons from the October 2000 events. The four people who were murdered could have turned into 40 had the police opened fire, and we did have the authority to open fire. He said four of the seven suspects have criminal records.\n\nWhen asked why it took so long to arrest the suspects, Ronen said: \"I'm familiar with the criticism that was voiced and I guarantee you, no official, certainly not a political official, was ever involved in the case; everything was conducted in accordance with strict professional considerations and every stage was accompanied by consultations."}, {"url": "https://en.wikinews.org/wiki/Four_Israeli_Arabs_killed_by_Army_deserter", "page_content": "Friday, August 5, 2005\n\nA uniformed AWOL Israeli private suddenly opened fire in a crowded bus, killing 4 Israeli Arabs and wounding 12. A mob stormed the bus and beat the shooter to death. The Israeli government condemned the random shooting and mobilized troops in anticipation of rioting in northern Israel.\n\nM16 assault rifle\n\nThe attacker, Eden Natan-Zada, 19, boarded Egged bus 165 en route from Haifa and sat mid-section. When the bus, carrying about 10–15 passengers, neared the bus stop at the center of the Druze neighborhood of the predominantly Israeli Arab town of Shefa-Amr in lower Galilee, Natan-Zada, walked to the front. When the bus stopped he shot the driver in the head with his M16 and began systematically firing as passengers crouched behind seats. He repeatedly shot Hazar Turki, 23 and her sister, Dina, 21, apparently to make sure they were dead.\n\nAs Natan-Zada was reloading his rifle and a young girl pleaded with him to spare her, Ahayal Jahnawi, 28 began struggling with the gunman. He succeeded in pinning Natan-Zada to the floor until the crowd broke into the bus. At first the mob mistook Jahnawi for the perpetrator and began pummeling him. They then began kicking and hurling objects at Natan-Zada. The security officer of Shefa-Amr, Jamal Aliam reportedly told Army Radio that Zada had been attacked by dozens after he had been handcuffed and subdued by police. Police were unable to control the mob, which wounded 5 officers. Magen David Adom ambulances evacuated the wounded to Rambam Medical Center in Haifa.\n\nNatan-Zada had been absent without leave from his army unit since mid-June after refusing to participate in preparations for the Gaza pullout. He moved to Kfar Tapuach, a West Bank Jewish settlement dominated by the militant Kach movement. His father Yitzhak Natan-Zada urged Eden to return his weapon and informed the army that his son was dangerous. Eden's mother Debbie, speaking from the family home in Rishon LeZion was told that someone must be AWOL for 45 days to be officially considered a deserter and was advised to go herself to Kfar Tapuah to disarm her son.\n\nEden had recently become more fanatical and encountered writings on the Internet about revenge and zealots in Judaism published by the outlawed terrorist Kach group in The Way of the Torah. He befriended people from Tapuah over the Internet and apparently became involved in resistance to plans to remove Jewish settlers from territory slated to be turned over to Palestinian control.\n\nWhen called up into the Israel Defense Forces (IDF) for basic training in May 2005 Natan-Zada went reluctantly, then refused to obey an order and was briefly imprisoned. He spurned advice to seek a psychiatric discharge under Section 21 of military regulations. According to his father, \"When they told him to set up a tent city [next to Kibbutz Re'im] in opposition to his views, he deserted and went to Tapuah.\"\n\nThe dead\n\nMichel Bahus, 56 (bus driver, Christian)\n\nNader Hayak, 55 (Christian)\n\nHazar Turki, 23 (Muslim)\n\nDina Turki, 21 (sister of Hazar, Muslim)\n\nSources\n\n\n\n\n\n\n\n"}, {"url": "https://forward.com/news/2561/arab-groups-don-e2-80-99t-probe-killer-e2-80-99s-death/", "page_content": "Israeli Arab leaders have demanded that the police not investigate the death of the Jewish gunman who killed four Arabs last week.\n\nThe gunman, Eden Natan-Zada, an AWOL Israeli soldier, was murdered by an Arab mob after he shot and killed the driver of the bus he was on, as well as three passengers. Twelve people were wounded in the August 4 attack.\n\nOne August 6, the Arab leaders, after a meeting of the Higher Arab Monitoring Committee, issued their demand that Natan-Zada’s death not be probed.\n\nOn Sunday night, a day after the meeting of the Arab leaders, Israel’s Channel 10 aired video footage showing that Natan-Zada had been disarmed and handcuffed by police officers before he was lynched to death by an angry mob. Photographs published by the Arab language newspaper Al-Sinara also show a living, albeit badly beaten, Natan-Zada in handcuffs.\n\nA court injunction was issued following the broadcast, forbidding publication of any further information that might interfere with the police investigation.\n\nThe effort to block an exploration of the mob killing was criticized by Ha’aretz in an August 9 editorial.\n\n“No country in which the law is properly enforced would permit an incident in which people take the law into their own hands to be ignored without investigating the circumstances and those involved, and agree in advance to withhold charges against suspects in a crime,” the newspaper stated. “The claim that an investigation of this nature might cause tempers in the town to flare up is not acceptable. The police, as a matter of course, detained and interrogated Jewish youths involved at the end of June in the attempted lynching of a young Palestinian resident of Muasi in Gaza. There is also the instance of Yoram Skolnik, who was convicted in April 1994 of murdering a bound Arab and sentenced to imprisonment. The same law that applies to Jewish transgressors in the territories must be applied, in a country where law prevails, to Arabs who break the law in Shfaram.”"}, {"url": "https://www.ynetnews.com/articles/0,7340,L-3727320,00.html", "page_content": "The Haifa District Prosecution filed formal charges against 12 Shfaram residents involved in the lynching of army deserter Eden Natan Zada in 2005.\n\nNatan Zada was beaten to death by a Shfaram mob after going on a murderous rampage in the northern Arab town, killing four people and wounded 22 others aboard a city bus.\n\nRelated stories:\n\nSeven suspects have been charged with attempted murder, aggravated assault on a police officer, obstruction of justice and rioting. Five other suspects have been charged with aggravated assault on a police officer, obstruction of justice and rioting. The cases are to be heard by the Haifa magistrates' and district courts.\n\nThe Haifa District Prosecution said that hundreds of depositions were taken during the court of the four-year investigation, resulting in the arrest of 12 suspects, ages 23 to 50.\n\n\"The State Prosecutor's Office is continuing to make the victim into the guilty party,\" Hadash Chairman Mohammad Barakeh said in response to the prosecution's move. \"Instead of tracing the actions of the man who committed the massacre and his accomplices and bring them to justice, (the prosecution) is blaming the victim,\" he said.\n\nFellow Hadash MK Afou Agbaria said, \"The residents of Shfaram should have been given a badge if honor instead of indictments for their heroic act. They protected the lives of the city's residents while placing their own lives at risk.\n\n\"The decision to indict serves as a green light to terrorists from the extreme right,\" he said, \"this is another example of the courts' double standard. When the residents of Jerusalem took the law into their own hands and lynched the tractor driver they were handed citations and not indictments.\"\n\nBalad Chairman Jamal Zahalka called the action a \"police provocation that sends the message that Arabs do not have a right to self-defense. We'll continue to demand the establishment of an objective inquiry committee tasked with exposing who was behind Zada's act,\" he said.\n\nAhmed Hamdi, chairman of the Shfaram committee established in the wake of Zada's attack, said \"this decision sets us back. This man (Zada) entered our city with the intent to kill, and he killed four residents in cold blood. He would have killed 50 if he had the chance.\n\n\"The young men who were indicted merely protected themselves in the face of the terrorist's attack. I call for the case to be closed. Continuing to deal with it will reopen a wound that hasn’t fully healed,\" he said."}, {"url": "https://www.ynetnews.com/articles/0%2C7340%2CL-3137316%2C00.html", "page_content": "Police arrested three ultra-orthodox men early Sunday after they hung posters of Jewish terrorist Eden Natan Zada in the Arab town of Shfaram, where he killed four Israelis.\n\nZada shot four people dead aboard a bus and was later beaten to death by angry residents who were at the scene.\n\nPolice are set to request the Acco Magistrates Court extend the remand of the three suspects. Meanwhile, local officials have removed the offensive posters.\n\nThe 25-year-old suspects are known to be supporters of the far-right, outlawed Kach movement. One is a resident of the West Bank settlement of Tapuach, another lives in Holon and the third suspect is a Canadian citizen.\n\nGlorifying terror: Kach poster of Eden Natan Zada (Photo: Ahiya Raved)\n\n\n\n\n\nA Kach spokesman said the arrest was based on political motives.\n\nPolice received a telephone call from one of the residents at about 4:00 a.m., after he complained that three religious men were hanging signs in town.\n\nPolice investigated the claim and found the men posting signs with Zada's image.\n\nShfaram mayor: Need to find a solution\n\nShafarm Police Chief Yoram Danieli said that in addition to the image, the poster read,\" Verily there is a reward for the righteous,\" and claimed that Zada \"committed the murder with police approval.\"\n\nPolice detained the three, who demonstrated no resistance to the arrest, and took them in for questioning.\n\nLocal officials, including Shfaram Mayor Orsan Yassin, were called in to remove the posters.\n\nKach Spokesman Itamar Ben-Gvir said Sunday morning that the arrested of the three men was based on political motives.\n\n\"The central message of the posters is that a public committee to investigate the murder of soldier Eden Zada must be established,\" he said. \"It is still not clear how the boy - who was handcuffed and under police control - was murder, 30 days after the incident. His killers and the police who were supposed to protect him, have not yet been punished.\"\n\nBen-Gvir added that his fellow Kach supporters plan to hold a rally in Shfaram, in a bid to demand Zada's death be investigated.\n\nShfaram Mayor Orsan Yassin told Ynet he is concerned about the possibility of an additional right-wing activist operating in town.\n\n\"I don't want anymore people harmed. Four residents have already been killed, and this situation cannot continue,\" he said. \"On the other hand, should residents catch any of these people, it would not end well. Luckily the police caught them, but we have to find a solution.\""}, {"url": "https://www.israelnationalnews.com/news/131746", "page_content": "Police charged 12 Israeli Arabs from the Arab-Israeli city of Shfaram Sunday in the death of AWOL soldier Eden Natan-Zada, who killed four Arabs in 2005 before being lynched by an angry Arab mob.\n\nZada had fled the army several weeks before he boarded a bus that went to Shfaram and opened fire at short range. Zada murdered the driver and three passengers, two of them women, and wounded four additional Arab Israelis. Citizens on the bus disarmed Zada and then police arrived and handcuffed the 19-year-old. A Druze and Arab mob surrounded the bus, murdered Zada and injured several policemen before security forces could bring the situation under control.\n\n\n\nZada's action came after five years of incessant and horrific Arab terrorist attacks against Jews.\n\n(screenshot -- Channel 10).\n\nThe State Prosecution will charge seven of the Arabs with attempting to murder Zada. The other five are charged with attacking police under serious circumstances.\n\nThe count of attempted murder is a less serious one than murder. While it is not clear why the prosecution preferred this charge, the reason may be that it believes it would have a difficult time proving which of the lynch participants dealt Zada the blow that actually killed him.\n\n“Without minimizing the seriousness of Zada’s actions,” the prosecution said, “the events that led to his death are an affront to the law. In a lawful state, someone who takes the law into his own hands and attacks someone who has already been captured and neutralized, even if he committed a depraved act, must stand trial.”\n\nArab MKs were incensed at the development. “These charges are a police provocation sending a message that an Arab does not have the right to self defense,” MK Jamal Zahalka said. “The prosecution is turning the victim into the guilty party,” MK Mohammad Barakeh claimed.\n\nHowever, a video documenting the lynch clearly shows that Zada was unarmed and handcuffed by police before the mob attacked and killed him. After the event, police were accused of handcuffing Zada and then leaving him at the mercy of the mob, because they feared to take the action necessary to protect him from the bloodthirsty crowd."}]}