{"Carpenter also wrote for the BBC's Doctor Who and The Saint.": [{"url": "https://link.springer.com/article/10.1007/s10739-019-09568-3", "page_content": "So far, I have considered Carpenter’s early attitudes towards Lamarck and his involvement in the Unitarian church. In this section, I return to 1839 to trace how Carpenter compiled the anecdotes that he used to support his views on heredity. Carpenter may have rejected the transmutationist ideas of Lamarck, but he still believed that “the philosophic naturalist” was responsible for “investigating the degree of variation which each is liable to undergo” (Carpenter 1839, p. 414). This job description stemmed from his own anxieties that Christianity was under threat from scientific efforts to prune non-European races from the human family tree. From the 1830s onwards, Britain experienced a profound cultural shift in its attitudes towards mixed race marriages (Salesa 2011, p. 133). While Prichard had been the dominant authority on questions of the human races and intermarriage, at the time of his death his views were being eclipsed by the American polygenists (Augstein 1998; Kidd 2006; Keel 2013; Salesa 2011). For Carpenter (and many other Unitarians), the historical accuracy of Genesis had already been abandoned: what mattered instead was what Kidd has described as “the central theological truth of mankind’s unitary origins” (2006, p. 130). Non-European races were certainly intellectually inferior in Carpenter’s judgement, but this inequality stemmed from the absence of European habits of study and the influence of Christian civilization. He maintained that:\n\nwhilst the American and Oceanic races appear doomed to extinction as pure races, wherever they come into contact with Europeans, there is no evidence that such is the case with those of Mongolian or of African descent; the latter, indeed, hold their ground with remarkable tenacity, and we may not improbably regard them as destined, under the influence of Christian civilization, to bear an important part in the future history of Mankind. (Carpenter 1849, p. 1365)\n\nThe inclusion of all races into the Christian destiny was always of central importance to Carpenter, and the inheritance of acquired characteristics offered not only as a means of explaining the existing variations between races, but also of the power of Christian education to reform and improve. The causes of temperance and education, as I show below, became increasingly important to him through the 1840s, as he began to publish on the subjects of temperance and mental physiology.\n\nIt is important to consider the criticisms that were directed towards the inheritance of acquired characteristics by Carpenter’s contemporaries. In 1839, the young Scottish anatomist Allen Thomson, a classmate of Carpenter’s, compiled a list of 41 common stories repeated by farmers and the public, and cautioned: “We look upon all these alleged facts with distrust. Many of them are coincidences; others, we suspect, are false” (1839, p. 472). Cases of cats born without tails received mention, as did the instincts of pointers and hunting dogs. The educability of horses and the wariness of foxes that lived in areas where hunting is practiced—all such stories, Thomson claimed, were misleading and false. Twenty-five years earlier, James Cowles Prichard’s Researches into the Physical History of Mankind, first published in 1813, contained a refutation of the inheritance of acquired characteristics (p. 195). The evidence for the idea was, in his eyes, scant, and by no means strong enough for the task of confronting polygenist arguments against the old and familiar arguments that adaptation to climate had produced the different races. When criticizing the inheritance of acquired characteristics, Prichard commented that the stories in its favor seemed suspect:\n\nThe authors who have brought such examples as these in defence of their opinions, would not probably have thought them worth recording, or indeed deserving of the smallest notice, if they had not happened to coincide with the systems they were advocating. (1813, p. 197)\n\nPrichard understood chance variation to produce races and varieties (1813, p. 26). As Augstein (1998) has shown, these ideas fit Prichard’s Unitarian faith. His aim was merely to reject a body of evidence that he viewed as specious and conflicting with his views on the moral responsibility of the individual. The inheritance of acquired characteristics, in contrast, described sin as arising in the choices and actions of one’s ancestors. Based on Carpenter’s friendship and admiration for Prichard, it seems difficult to maintain that he would champion the inheritance of acquired characteristics merely on the grounds of abolitionism.\n\nThe cases and examples Carpenter compiled all evidenced one idea: civilization and cultivation prompt individuals (plants, animals, and humans) to alter their habits. These alterations can take the form of behaviors or physical traits, but they will—when they align with the natural propensities of the species—be transmitted to offspring. In his Principles of Comparative Physiology (1839), Carpenter introduced the key cases and examples that he would continue to advance as late as his paper on the inheritance of acquired characteristics in 1873. From the plant realm, Carpenter cited the ability of gardeners to convert single flowers into doubles by the power of cultivation—a familiar argument that cultivation could induce transmittable new habits into varieties of plants (1839, p. 419). Cultivation was a useful source of evidence, and like many others, Carpenter appealed to the authority of nurserymen and plant breeders. He attended to the practices at his local plant nursery in Bristol, and he reported in the first edition of his Principles that the nurseryman at Durdham Down had demonstrated that three Orchideous plants previously regarded as belonging to distinct genera could be produced from the same parent, if cultivated properly (1839, p. 415). Such examples had immediate significance for debates over the origin of the human races, despite their apparent remove. A couple of years after the second edition of the Principles was released, Josiah Nott delivered a series of lectures in which he likened the “retrograde movement” of freed Africans towards barbarity to that of poorly cultivated plants (1844, pp. 40–50). In his influential work on the Varieties of Mankind (1849), Carpenter continued to appeal to plants to support the belief that gardeners and plant breeders were well aware of the power of cultivation to establish new varieties. He appealed to the familiar work of the botanist William Herbert, who was able to raise primrose, polyanthus, cowslip, and oxlip, all cultivated varieties, from the seeds of the same plant (Carpenter 1849b, p. 1305; Herbert 1837). While Herbert believed in the inheritance of acquired characteristics, not all plant breeders and gardeners regarded these traits as acquired by any means—the idea of “sports” and chance variations were important to these knowledge communities. But Carpenter represented these narratives to fit his own view that the influence of cultivation was the causal factor in the appearance of these hereditary traits.\n\nCarpenter was also willing to break with the views of Prichard and to attach authority to an older canon of stories about the inheritance of mutilations. In addition to a discussion of “cats deprived of their tails,” Carpenter claimed in his Principles that: “instances are on record in which dogs, that have been deprived of their tails by accident or design, have produced puppies with a similar deficiency” (1839, p. 422). The “record” mentioned was the agricultural and sporting press, where such anecdotal cases abounded. To quote an example from The American Turf Register:\n\nAccidental injuries sometimes become hereditary blemishes. Little Billy had one eye put out when a colt, by accident, the other remained good during the whole time he was on the turf; after he became a stallion, he lost his other eye by a stroke of the whip from his groom, in a few years after, many of his stock were blind, and this did not occur until he had been some years in that condition. (Anonymous 1832, p. 74)\n\nThe emphasis from Carpenter, once more, was that such cases and stories testified to the ubiquity of the phenomenon—for animal breeders and farmers, such cases fit their ordinary and practical expectations of breeding. They conflicted with Carpenter’s contention that only traits allied to the natural propensities of the species were transmitted, but Carpenter clearly valued them as a base of familiar evidence too much to discount them on such grounds. He would make such a departure again in the case of alcoholism (considered below).\n\nLike many others, Carpenter was convinced that a vast and useful experiment on heredity was playing out in the colonies, where the introduction of European breeds and varieties brought about an opportunity to observe the hereditary effects of new climate and soil (Desmond 1989, p. 301; Müller-Wille and Rheinberger 2012). A well-respected collection of these anecdotal cases had already been investigated and compiled by the French physician and travel writer François Désiré Roulin (Osborne 1994). Roulin communicated a highly influential report on climate and heredity in 1828 to the Academie des sciences, which later confirmed for Carpenter that the hereditary transmission of acquired habits was now a familiar phenomenon, widely observed in farms and colonies abroad. Of particular interest to Carpenter (and also Lyell) was an account of how dogs imported to Colombia had adopted new hunting instincts:\n\nIn a mongrel race of dogs employed by the inhabitants of the banks of the Magdalena almost exclusively in hunting the white-lipped Pecari, a peculiar instinct appears to have become hereditary, like that of the pointers and other dogs of this country. The address of these dogs consists in restraining their ardour, and attaching themselves to no animal in particular, but keeping the whole herd in check. Now among these dogs some are found which, the very first time they are taken to the woods, are acquainted with this mode of attack; whereas, a dog of another breed starts forward at once, is surrounded by the Pecari, and, whatever may be his strength, is destroyed in a moment. (Carpenter 1839, pp. 421–22; Lyell 1832, pp. 39–40; Roulin 1829)\n\nThe wording is largely based on a translation of Roulin’s article published in the Edinburgh Monthly in 1829, which appears verbatim in Lyell’s Principles of Geology (1832). Roulin’s testimony was trustworthy, not only because of his status as a physician, but also because his observations had been communicated to the Academy, where Geoffrey Saint-Hilaire quickly endorsed and elaborated upon Roulin’s cautious ideas as to how such habits became hereditary (Appel 1987, p. 133). Roulin’s accounts of such cases from the colonies fit other sources that Carpenter employed. He frequently made mention of an anecdote from Thomas Bell about how domestication of two Australian dingoes had yielded, when bred, puppies with spots, when their parents had been uniformly brown (Carpenter 1849b, p. 1305; Bell 1834, p. 203). Such cases helped to illustrate the effects of cultivation. But Carpenter was also interested in travel observations that confirmed the effects of climate on such traits—even if they included notions that some climates (for whatever reason) tend to shape different species in the same manner. “It is a curious and very significant fact,” he explains, “that the sheep of the Cape of Good Hope, which are descended from the European stocks, should exhibit the same tendency to the accumulation of fat about the rump, as is seen in the human races indigenous to that region” (Carpenter 1849b, p. 1312). Carpenter was referring to Angola sheep, gaining his opinion from reading the veterinarian William Youatt’s discussion of their unusual features (1837, pp. 119–120).\n\nAlongside these animal and plant anecdotes, Carpenter discussed cases from ethnology and medicine. Carpenter was particularly influenced by the controversial work of the London physician Alexander Walker, whose book Intermarriage (1838) included numerous examples and cases of the benefits of crossing races and varieties to the quality of the human stock. Walker had included an example from John Hancock, doctor and zoologist whose travels in South America produced communications that frequently provided material for the periodicals and popular encyclopedias of the 1830s. Walker had instigated a correspondence with John Hancock from which he gained new stories and material for his Intermarriage, among which was the claim by Hancock that he had witnessed “whitening” among slaves and African servants in the Americas and Europe due to the effects of climate (Walker 1838, pp. 275–278; Carpenter 1841). The obvious failure of such a principle to account for the variety of skin tones in tropical and temperate climates had been debated since the Enlightenment, making it all the more surprising that Carpenter would endorse it (Livingstone 2008 p. 59; Gould 2006). Responding to these convincing arguments, Prichard himself argued in 1813 that “white races of people migrating to a hot climate, do preserve their native complexion unchanged, and have so preserved it in all the examples of such migration which we know to have happened” (p. 231). But Carpenter’s principle of heredity, as we saw in the case of animals, placed a tremendous emphasis on the power of climate and circumstances to alter the physical appearance of species:\n\namong some savage nations of North America and New Holland, precisely the same notion of direction is manifested, as is evinced, in a degree scarcely more remarkable, by the lower animals; individuals traversing pathless forests for the first time without swerving in the least from the direct line towards the point at which they are aiming. (Carpenter 1839, p. 423)\n\nCarpenter may have found such stories in the writings of Humboldt, whose descriptions of American Indians invoked hereditary powers (Walls 2009, pp. 58–64), or he may have encountered them in Alexander Walker’s Intermarriage (1838), which had included some excerpts from correspondence Walker claimed to receive from Thomas Andrew Knight, who had recently published a collection of cases supporting the inheritance of acquired traits (Knight 1837). In these passages, Knight is quoted as having written to Walker that: “The offspring of a family of American or Australian savages, would more readily acquire the power of tracing the steps of an animal in a trackless forest, than the child of an educated English family would do” (Walker 1838, p. 179).\n\nCarpenter used his treatises as a space in which to gather cases and examples that could respond to the growing threat of polygenism. While monogenists that he admired (like Prichard) had rejected these stories, Carpenter determined that the movement should change tack and appeal to the idea that cases like these were illustrative of experiences familiar to all. When we consider Carpenter’s interest in temperance and education, his preference for the inheritance of acquired characteristics becomes clearer."}, {"url": "https://www.bbc.co.uk/mediacentre/mediapacks/doctor-who-legend-of-the-sea-devils/", "page_content": "In a swashbuckling special adventure, the Doctor (Jodie Whittaker), Yaz (Mandip Gill) and Dan (John Bishop) come face to fin with one of the Doctor’s oldest adversaries: the Sea Devils. Why has legendary pirate queen Madam Ching come searching for a lost treasure? What terrifying forces lurk beneath the oceans of the nineteenth century? And did Yaz really have to dress Dan up as a pirate?\n\nLegend of the Sea Devils is the second in a trio of specials airing in 2022. Jodie Whittaker’s final feature-length special will transmit in autumn 2022 as part of the BBC’s Centenary celebrations.\n\nLegend of the Sea Devils airs on BBC One and BBC iPlayer on Sunday April 17.\n\nAK\n\nQ&A with Chris Chibnall\n\nWhere do we find our core cast at the beginning of this special?\n\nThis special sees the TARDIS crew landing in a coastal village in China, on the trail of the mystery of the treasure of the Flor de la Mar, which the Doctor has been meaning to find out about for a long time. When they get there, they discover some very strange events and a terrible evil being unleashed in this village!\n\nWhat was your inspiration for this episode and how did you come to work together with Ella Road on this script?\n\nWe had been intending to do a piratey story during Flux and we didn't manage to make it work for all sorts of reasons. So when it came to thinking about the final specials that was one of things I really wanted to revisit, to do a big, thrilling Bank Holiday romp of an adventure for Jodie's penultimate story, featuring a warrior pirate queen. Ella (Road) then came to us with the idea of Madam Ching - this incredible character from history - and it all knitted together thanks to her.\n\nCan you tell us a bit about the process of bringing the new guest actors on board?\n\nWe are always really lucky on Doctor Who as we have one of the best Casting Directors in the business in Andy Pryor. Andy’s great at keeping tabs on everyone and also uncovering great new, young talent as well. So when we were thinking about the story, I talked to him and gave him a heads up on the characters that we were thinking of. Usually the process is that Andy will put together a list, people who will tape and we'll look at load of people so that's how it went on this and we saw some amazing people.\n\nCrystal (Yu) just absolutely shone out, and then we also Marlowe Chan-Reeves who plays Ying-Ki, I think this is his first television job and he's an absolute star of the future. It's something that happens all the time on Doctor Who, down to the genius of Andy Pryor and his team – they’re the unsung heroes of the series since 2005. They have cast every episode and this litany of incredible guest actors is absolutely down to them and their brilliance. The show owes that team a huge debt of gratitude.\n\nWhy did you decide to bring back the Sea Devils? Was it always planned? How did you go about bringing that vision to life with your team?\n\nWe didn't start with Sea Devils at all, but the great thing about Doctor Who’s history is sometimes you can pull on all of that history and go, “Oh wait okay, the perfect monster has already been created, and is already in there!” So you can spend a long time thinking about creating or making a bespoke monster for this story, but actually, we thought, “If you add the Sea Devils in, this becomes really exciting” – they bring an extra layer of story, an extra layer of thrills and an extra layer of meaning for the fans. And so it wasn't always in there but when we put them in and tried them out it really worked.\n\nThen the question is whether you do a big redesign, as we did with the Silurians when I was working for Steven Moffat on Matt Smith’s first season. They were created by the same writer, Malcom Hulke, and are sort of cousin monsters! With the Sea Devils, it felt like there were ways that we could fit that original, brilliant and recognisable design into this story and have a bit of fun with it, pirate them up a little bit while also doing little bits of updating and augmenting – but fundamentally retaining the incredible design by John Friedlander.\n\nSo they’re very much his creation, and updated by Robert Allsopp and Ray Holman, our costume and monster designers. Then we were really lucky in that we had Craige Els, who played Karvanista in Flux, as the Chief Sea Devil. He’s a magnificent actor who is now beneath another mask– we still haven’t seen his real face in the main show! He does a brilliant performance and we knew we needed a really great actor - a great voice actor and a physical actor as well. What he brings is just gorgeous, as always.\n\nWhat was added in after filming? They seem very true to the prosthetic that was created by Robert Allsopp.\n\nIt’s just things like expression, blinking of the eyes, they do a bit of snarling - just tiny little things to make sure that things come alive but they’re very much the monsters as you saw them previously.\n\nThere seems to be great anticipation about their return?\n\nIt’s the lovely thing you can do occasionally - there aren’t millions of Doctor Who monsters that you can bring back. But there’s a lovely affection for the Sea Devils, and they haven’t been used in the modern era. Also probably my earliest memory of Doctor Who and probably my earliest memories of being alive almost, is seeing them on the TV, so it was a nice thing to do in the penultimate story we were doing.\n\nHow does the relationship between Yaz and the Doctor develop further in this episode?\n\nDan has cottoned onto the dynamic between the Doctor and Yaz and from a distance, observed what they haven't been admitting to themselves. I think really, in Eve of the Daleks, both Yaz and the Doctor have hinted that they have feelings that they are suppressing and keeping quiet about. So there are some conversations that need to be had and you'll see those conversations developing and taking place in Legend of the Sea Devils. The Doctor and Yaz have something to talk about!\n\nWould you say this is more of a standalone episode?\n\nYes, it’s a big standalone bank holiday action romp for all the family! A rollicking, swashbuckling adventure for the Doctor, Dan and Yaz with big monsters, big pirate ships, the sword fights, lots of fun, loads of action, lots of lovely jokes and a great, fun tone before we go into the big epic battle for survival with Jodie's final episode.\n\nThis episode was of course filmed during strict COVID restrictions. What were some of the bigger challenges that you faced in making it happen?\n\nIt was a huge ask, and I didn't know whether we could do it after the production team had pulled out all the stops for Flux. We knew it was a big deal to be able to transport the show back in time, around the world, onto ships and onto the seas. It’s just a testament to the whole production team from first to last - from pre-production to post production.\n\nDaf Shurmer, our Production Designer, is an absolute legend himself and he did something that I think should have been impossible - and I think was impossible - and he achieved it. He's just given us such scale with so many great sets that look amazing.\n\nHaolu Wang, our brilliant director, and Mark Waters our Director of Photography, have shot it wonderfully with energy and love and fun, and the cast all got into that. And DNEG who do all our CG and visual effects have just delivered something really special. We've got sea monsters, we've got pirate ships, we've got the oceans, and we’re in an ancient coastal village!\n\nAs with every episode of Doctor Who, is it was a massive team effort. Everybody involved in the COVID procedures on Doctor Who whether it was testing everybody or sorting out the bubbles - we never had a day shut down due to COVID, it involved incredible work by the whole team. And the fact that I think Jodie Whittaker did not go out for almost a year, while she was working on her final series -she set such a great and responsible example, and put the show first.\n\nFor anyone who is coming to Doctor Who as a new viewer is this an easy one to step in and get on board with? What do you hope families take from it?\n\nI think it’s definitely a great episode to come into. It's got a lot of action, very heroic plot, lots of fun, big mad monsters, mad ideas, cinematic ambition, all that stuff and a great cast. We have a big, epic, rollicking, fun adventure for you whether you've never seen Doctor Who or you've seen every episode. And then for long term audiences and fans of the show there are loads of lovely little easter eggs and nods to the past so it's absolutely got something for everyone.\n\nIs it starting to feel a bit surreal now that your time on the series is coming to an end?\n\nThe workload is less so it’s lovely doing the post production on these last two specials because you're not having to write and film at the same time. As showrunner, when you're doing Doctor Who and you're in the thick of it you're doing three jobs at the same time. You're writing for episodes down the line, you're looking at all the filming that's happening and you're in the edit and post production on multiple episodes. So it's really nice now that I don't have any other episodes to think about.\n\nI love the post production process, it’s one of my favourite bits because you're just watching teams of geniuses produce great work! So it's nice not to have the workload, it’s nice not to have the pressure of what’s coming up. I'm sort of combining having a break with finishing these episodes and working on other things so it’s lovely right now.\n\nQ&A with Jodie Whittaker\n\nWhat can audiences expect from this special?\n\nWe’re a few centuries off where the Doctor was aiming for and we stumble across a period in history that is a first for the Doctor Who universe. The TARDIS knows that it's going to China so Yaz and the Doctor have prepared appropriately for it but Dan gets a bit of a bum steer and his costume is all wrong! It’s a Pirates of the Caribbean style sci-fi, action adventure that marries historical characters with Whovian characters with a really brilliant high octane Doctor Who adventure.\n\nDid you enjoy stepping onto set – we heard the ship was impressive?\n\nYeah, it was amazing! The art department worked night and day to create a really extraordinary set and I think it's the biggest one that we've worked on. We walked into an incredible pirate ship - it has so many different levels, it was really epic. It has so much depth and detail and also I think it was one boat that ended up being three different ones and in the episode, you can tell that the art department have worked so hard for that to go completely unnoticed.\n\nHow was it to find out the Sea Devils were coming back, with Craige Els as the Chief Sea Devil? How did they match up to other Doctor Who creatures you’ve come up against?\n\nI was really pleased to be working with the Sea Devils! It’s always good to work with creatures from the Doctor Who universe. This is a hat trick for me now with Craige Els! Me and Craige were in a play called Antigone at the National with Chris Eccleston - now it’s a trio of Whovian cast. I spent the entire time with Craige saying “What did you say?” because of the mask! I think they were less familiar to me so it interesting to see Craigs Els’ interpretation because obviously he's playing a very different kind of Sea Devil than we've seen before. Because of the costume and the restrictions of the mask it meant that Craige’s lines were recorded so that added complication to it but as far as the look of it, it looked great! I think an acting thing must have been incredibly challenging for Craige but once again he brought an incredible characterisation and smashed it.\n\nHow was it working with the brilliant guest actors?\n\nOn this episode we got to work with some really exciting cast. Crystal was absolutely brilliant. And also I think, Madam Ching as a character was such a great character. I think Crystal is an actress throws herself into things 100%. She's amazing, as is Craig, Marlowe and Arthur (Lee) - we had a really contained cast. There was obviously more than that but for us it was a kind of ensemble feel as were together all of the time.\n\nCrystal’s energy was brilliant - she was never tired - she was running around, jumping off things, swinging off things, fighting, memorising lots of lines and at no point does she ever stop smiling. She's such a wonderful person to have on set and it was really was lovely. And I think the dynamic between her, Arthur and Marlowe was great too. What was lovely was that Marlowe was at the very beginning of his career and that’s always really exciting as well, to work with people that are starting out and Doctor Who plays a part in the start of their professional life as an actor. Working with our Director Haolu (Wang) was absolutely brilliant too, I loved getting to work with her for the first time - her energy and personality really shine through in this episode.\n\nWe heard Marlowe is a big fan of Doctor Who?\n\nMarlowe is a Whovian and his knowledge of Doctor Who far surpassed mine! There was a scene where I couldn't say one of my lines and it was a very specific scientific term. I just kept getting this word wrong and he would stand next to the camera and slightly mouth it to me as I did it. It really should have been roles reversed - I should have been helping him out because he has just started but he was always helping me out!\n\nCan you tell us about your stunts/action scenes in this episode?\n\nThere was a scene where I needed to slide down the ship but the thing was the ship didn't have a side on it, it was really high! The team’s issue was the fact that there was no other side so if I did topple over the other side it would have probably been quite a dramatic day at work, but I was absolutely adamant (to do it). When I did it was actually really controlled but I didn’t know if it looked as good as I really thought it was going to but I was really proud of it. With sword fighting I was really nervous as I had not done it since drama school and then when we ended up rehearsing it, it was just like choreographing a dance and as soon as it was like that I could do it and I really enjoyed it.\n\nHow was your new costume?\n\nThere wasn’t as many tweaks being made to it throughout filming - I didn’t get to hang out with my wonderful dresser Ian as much as I’d like to as once this costume was on it was on! What always seems to happen on Doctor Who is you wear a thick heavy material in summer and a thin t-shirt in winter, so I was really sweaty but that was not down to the look – I felt I looked a million dollars.\n\nHow does it feel as we get closer to the big centenary special?\n\nIt’s interesting because time wise, it’s such a long time off (before they air). What's great about the standalone episodes are that if you do watch it now and then you watch another episode in autumn, you don’t need to rewatch it to understand what's happening in the next one. They are great standalone individuals stories, that obviously marry all of my seasons together, build on relationships and things like that. But they are also these individual set pieces that can be dipped into and watched without the context of the rest of the show, which I think is really important. It shouldn’t exclude viewers and or may you feel like you need to go back and do homework to watch something!\n\nQ&A with Mandip Gill\n\nWhat can audiences expect from this special?\n\nIt's definitely one for the family. It's got returning monsters in the Sea Devils and it's got new characters! For a new audience, you're able to relate to new characters, or if you're watching it with your grandparents, you then get to see the return of the Sea Devils. It's a really exciting story and it looks amazing. We have brilliant costumes and actors -it's a little bit scary and a little dark in parts, but I think all that works if you're going to be watching it as a family.\n\nWhere do we pick up at the start of this episode?\n\nAt the beginning of the episode, the TARDIS lands at a small coastal village but once again it's landed where it's not supposed to land. The Doctor promised Dan and Yaz that they’d be going to a beach somewhere exciting and they land on a beach, just not the beach that they expect. They get out, hear a massive scream and they realise that something very terrible is happening in this place.\n\nHow was it to film on this set?\n\nIt was a really epic ship that was built in the studios at the BBC. I saw Matt Strevens our Executive Producer in the hallway (before filming) and he was so excited for us to see it. It was brilliant, it was a huge ship so we didn't have to cheat any of the places or any of the angles. It was all there for us – things worked and moved and Jodie was able to do her stunt scene on that actual set which is always so helpful. It was one of the few times we had the whole thing there to work with. It was really spacious too, it was built to get all of us on it and a crew. The attention to detail was brilliant and having seen the episode it looks amazing!\n\nHow was it for you working with the Sea Devils?\n\nI thought the prosthetics were amazing. Also, we knew the Sea Devils were part of Doctor Who’s history so I've always found it really exciting to work with characters that have already been there previously like Cybermen, like Daleks - it always feels like it really cements our place in the world. And then to be up against something that has been around for so long, was also an honour. They were so tall and the attention to detail was just brilliant. Again, it was great to be working with something that's there in front of you so to a degree don't have to use your imagination. It's all there!\n\nWas it nice to have Craige Els back on set as the Chief Sea Devil?\n\nIt was brilliant! On set, you’re having these really natural conversations with a massive giant sea animal – we’re just casually having these normal conversations and having a laugh and I always wonder what it looks like from the outside looking in - he's ever so tall so he’s not always on the same chairs as us either to protect his costume. So he’s sat a little bit higher, and I am having these really in depth conversations with this sea monster!\n\nCan you tell us about working with the guest actors?\n\nEvery single time you get new guest actors you get new best mates. I had already worked with Crystal on Casualty, so we knew each other and that felt quite familiar. Arthur was absolutely brilliant, you could see him going away to work on his lines - I love watching everyone else's acting techniques. Marlowe has done so well to be on a professional set and at young age and he’s so together. Also he’s a fan of the show and I love when people come in and they love the show. They want to be there as an actor, but they also love it and it's something that they actually watch on the outside.\n\nI’ve always liked that about our guest actors - I love that they love it for a multitude of reasons, not just because they get to work as an actor. As it was a pandemic there were very few guest actors on and they tended to stay a lot longer than they did in previous series – we spent a fair bit of time together in Cardiff and I got on really well with them and had such lovely conversations. Crystal has got a really gorgeous energy and I think she's a brilliant actress, I think she was perfect for the part. Their costumes were great and we all did action sequences together which you don't often get to do, they were all brilliant!\n\nWhat was your experience of the sword fighting?\n\nWe didn't do any training for the sword fighting but we rehearsed a sequence on the morning of it and because the set was really big, there was space to practice on the actual deck. You only see a little clip snippet of the whole work that we do after the edit but it was much harder than you think - the actual swords were a lot heavier than I expected! I was really into doing my own stunts before then and then I hurt my finger and I was like, “It's not for me!”\n\nJohn Bishop mentioned that the team missed a trick not having Dan do more stunts. I don't know what you think about that?\n\nI love how confident he is! To be honest, you think it’s going to be all fun and games and you want to do it all and are proper up for it. And then you do it and you realise that stunt people look so incredibly easy, because you have to go again and again and again! And so it's all fun and games until you're on the tenth take and you’re upside down again. But yeah, I guess I've had three years of being upside down and chased and whatnot.. John had one year but I mean, he probably wouldn't say that after three series!\n\nWhat would you say we can expect in this episode between the Doctor and Yaz? Will their feelings be addressed further?\n\nSo the relationship between the Doctor and Yaz has definitely developed further. There’s not an awful lot I can say about it but there's a lot of bravery, there's a lot of emotion and a lot of understanding, and openness. Conversations are not concluded in this episode, but they still definitely have advanced from where they were at the New Year’s episode. There’s a lot of open and honest conversations.\n\nHow does this episode set us up for the final special?\n\nWe definitely get a sense that something is coming because there always is something coming when the Doctor is around! Things have not been resolved by the end of the episode and I think that can be said for the relationship between Yaz and the Doctor but also the Doctor’s history and future.\n\nWhy should everyone tune in this Easter Sunday?\n\nI think it's a really jam packed, epic story. It looks amazing - you'll see the hard work that went in from the crew and the cast during the pandemic. They've definitely excelled in terms of prosthetics makeup, costume and set design. Everything is just brilliant. It's a standalone episode that has adventure, returning monsters, but also, ultimately and fundamentally there is a story of love at the centre of it all.\n\nQ&A with John Bishop\n\nWhat’s next in store for the trio on this adventure?\n\nWell, this adventure involves monsters, someone dressed as a pirate, real pirates, an underlying love story, and it involves somebody finding something in themselves to make a commitment to another person to look after them. It has all of those things, and sword fighting, so I don’t think you could ask for more!\n\nFor this episode, we have the return of the Sea Devils, which everyone is very excited about. How did they compare to working with other Doctor Who monsters? Obviously we have Craige (Els) was back in a costume so you got to work with him again!\n\nThat was quite an interesting dynamic. Craige is great, but when he was Karvanista we were mates whereas with the Sea Devils it’s a bit of a different story - so it made the coffee breaks interesting! It was also, from a performance point of view and so on, really odd because they were physically threatening. In Doctor Who some of the monsters are not necessarily bigger than you are or physically different than you. Whereas with the Sea Devils…put it this way - if they walked into a pub, nobody is going to take them on!\n\nDid you know much about them before filming or did anyone need to bring you up to speed on the history?\n\nI knew a little bit about them and then Ray (Holman) our Costume Designer had a chat with me about their history, and how they’ve not been around for a while, so I knew what he had told me. Like all the elements of Doctor Who, the main actors are a small part of the fabric of what makes it work. The designers, the art department, the prosthetics, wardrobe and all those things make it work on the day and then afterwards, the post production, the music; all of those things make what you see so much better than what you’re doing on the day. And when you do it on the day and it’s good, you know it’s going to be brilliant on the telly because all of those bits get added.\n\nYou've got quite a striking pirate costume in this episode. How did that one come about?\n\nIt starts out a little joke between the characters – between Yaz and Dan - and then events take over and he never gets the chance to change!\n\nWas there anything about the sets that really impressed you?\n\nI’ll tell you what impressed me - having a ship! I just couldn’t believe it. It was a full ship built in the studio next door to the TARDIS. So we were filming a previous episode, and then you walk in next door and there's a ship that has been built. It absolutely floored me, honest to God it staggered me - the workmanship and the level of detail in it. It literally blew me away.\n\nThere are some new guest actors in this episode. How was it welcoming them into the Doctor Who family?\n\nIt's always good, particularly when they’re good actors! Crystal was familiar with Cardiff because obviously she has been in Casualty and when she was on set there she was thinking about what it was like in the Doctor Who studio - on the other side of the wall - so it was interesting to see it from that perspective. It was Marlowe’s first job and he was he was brilliant. Everyone wanted to look after him but he was just so accomplished, me and him were hanging upside down for half a day just having a laugh. Which is an odd way of getting to know someone!\n\nHow was your experience filming this special compared to others?\n\nTo get on the beach, on the coast, all of that setting and just being outside was good. But the main thing for me was just the ship, filming on the ship and just seeing the way it's done. There’s a massive screen for all of the CGI and I've never seen anything like that before - it was just so impressive.\n\nIs Dan still involved with the Doctor and Yaz in this episode in terms of the development of their relationship?\n\nI think it was probably a surprise to both the Doctor and Yaz that it was so obvious to him that there was feelings between them. And I think as a character he is probably not the most obvious persons to be the matchmaker. Because he comes in as an ordinary bloke you would suspect is so bemused by the world that he's in is too busy to absorb what's going on around him to notice. But because the bond between them is so clear, and because I think as well as he says to Yaz in the New Year’s special - sometimes if you've got feelings for somebody you just have to act on them because otherwise if you don’t it will be too late.\n\nWere you involved in any of the sword fighting for this episode?\n\nI'll be honest with you - I think they missed an opportunity because I was so desperate to do a few somersaults and swing on ropes - I really wanted to be a proper pirate! I got a bit done but if it was down to me I think there was a big likelihood that I wouldn't have been in the show at all because I think I would have killed myself at some point. I was like a kid on the set, climbing up ropes and everything - the stunt coordinator kept going “Get off, get off!” There’s a bit of rope swinging a bit of sword fighting and all that. Because we knew it was a special and the way the story was we played it for fun - it was written to be big and bold and that’s what it was.\n\nHow does it set us up for the final special? Does it gives any clues about what to expect?\n\nYou know there’s something big about to happen. You can see the change in the Doctor and change in the dynamic and you just know there’s something big around the corner."}, {"url": "https://www.britannica.com/topic/Doctor-Who", "page_content": "Doctor Who, British science fiction television series produced by the British Broadcasting Corporation (BBC). The show’s original run lasted 26 years, from 1963 to 1989. Remembered for its primitive special effects and compelling story lines, Doctor Who became a landmark of British popular culture. The series resumed to much acclaim in 2005.\n\nDoctor Who chronicled the adventures of an eccentric time-traveling scientist from the remote planet Gallifrey, home of the Time Lords. The Doctor, a Time Lord himself, traveled through time and space in his unique craft, the TARDIS, an acronym for Time and Relative Dimensions in Space. With an interior larger than its exterior, the TARDIS could take on various shapes to blend into its environment. Although capable of whisking the Doctor and his passengers to any time and any place in the universe, the craft was frequently parked on Earth in the form of a blue police box. Whether in England or in the far reaches of space, the Doctor and his colleagues battled a multitude of evils, including robots, monsters, and a twisted Time Lord. Certain adversaries recurred throughout the series, notably the Daleks, genocidal aliens armoured in robotlike suits who sought the extermination of life-forms inferior to themselves.\n\nBritannica Quiz Pop Culture Quiz\n\nThe original Doctor was played by William Hartnell until 1966, when the show revealed that Time Lords had the ability to regenerate themselves when near death. Their reincarnated forms appeared as different people, although they retained the same memories and skills. This plot twist allowed different actors to assume the title role. The original series eventually featured seven different Doctors, the longest-lasting of which was Tom Baker (1974–81). Over the course of the program, companions of the Doctor included Brigadier Lethbridge-Stewart (Nicholas Courtney), a commander in an organization that combats extraterrestrials; Jamie McCrimmon (Frazer Hines), an 18th-century Scotsman; and Sarah Jane Smith (Elisabeth Sladen), an investigative journalist.\n\nThe original series was not so much cancelled as postponed. Following a television movie in 1996, the BBC began producing new episodes in 2005, which quickly proved popular. The 10th Doctor, portrayed by David Tennant in 2005–10, became a fan favourite, along with such new characters as Rose Tyler (Billie Piper), his loyal assistant, and the mysterious River Song (Alex Kingston). In 2017 the show made news with the announcement that the 13th Doctor would be portrayed by a woman, Jodie Whittaker; the first episode starring Whittaker aired the following year. Doctor Who also engendered numerous spin-offs across different media, including the TV series Torchwood (2006–11) and The Sarah Jane Adventures (2007–11)."}, {"url": "https://www.nytimes.com/2005/01/19/books/humphrey-carpenter-english-biographer-dies-at-58.html", "page_content": "Humphrey Carpenter, the English writer, editor, radio broadcaster and musician who wrote intimate biographies of Auden, Pound, J.R.R. Tolkien, Dennis Potter and Spike Milligan, among others, died on Jan. 4 in Oxford, England. He was 58.\n\nThe cause was a pulmonary embolism, Ion Trewin, editor in chief of the publishing house Weidenfeld & Nicolson, said in an article in The Sunday Times of London. Mr. Carpenter had been suffering from Parkinson's disease.\n\nA man of boundless and sometimes impish energy, Mr. Carpenter was prolific, his work ranging from conducting radio interviews to producing children's theater to writing trenchant book reviews to playing a variety of musical instruments. A band he founded in 1983, Vile Bodies, made up of publishers and Oxford dons and specializing in music of the 1920's and 30's, performed for years at the Ritz Hotel in London.\n\nBut he was best known for his biographies, particularly for his \"Tolkien: A Biography\" (Houghton Mifflin, 1977). He knew the subject's family, and he followed that book with \"The Inklings: C.S. Lewis, J.R.R. Tolkien, Charles Williams, and Their Friends\" (Houghton Mifflin, 1979), a work on Tolkien's pro-Christian, anti-modernism circle at Oxford. Later he edited a volume of Tolkien's letters with Christopher Tolkien, the author's son."}, {"url": "https://www.bbc.com/mediacentre/mediapacks/the-power-of-the-doctor", "page_content": "There will be laughter, there will be huge jeopardy, and there will be tears at the departure of the Thirteenth Doctor. It's the biggest threat the Doctor has ever faced - and that any Doctor has ever faced - to their life or lives. — Chris Chibnall\n\nIn a feature-length Special to mark her last adventure, Jodie Whittaker’s Thirteenth Doctor must fight for her very existence, against her deadliest enemies: the Daleks, the Cybermen and her arch-nemesis, the Master.\n\nWho is attacking a speeding bullet train on the edges of a distant galaxy? Why are seismologists going missing from 21st century Earth? Who is defacing some of history’s most iconic paintings? Why is a Dalek trying to make contact with the Doctor? And just what hold does the mesmeric Rasputin have over Tsar Nicholas in 1916 Russia?\n\nThe Doctor faces multiple threats... and a battle to the death.\n\nAK\n\nInterview with Chris Chibnall\n\nCan you tell us what audiences can expect from this special?\n\nYou can expect a massive all action thrill ride from start to finish. There will be laughter, there will be huge jeopardy, and there will be tears at the departure of the Thirteenth Doctor. It's the biggest threat the Doctor has ever faced - and that any Doctor has ever faced - to their life or lives.\n\nCan you talk a bit about the process in putting this feature length episode together? What did you finally set out to achieve?\n\nIt’s a particularly unique brief and a particularly unique episode because it's a regeneration episode, but it's also a celebratory episode for the BBC centenary and Doctor Who's place within the BBC. So I really wanted to ensure that it had sufficient scale, but also that it was connected into the past, present, and future of Doctor Who.\n\nWe’re bringing back characters like Tegan and Ace, also there are lots and lots of easter eggs. Some are visual, some are verbal, some are so deeply buried that only few people will recognise them! But there are so many references to the past of Doctor Who in there that it’s got its own crazy movie length identity for the BBC centenary, whilst also saying goodbye to a very beloved Doctor.\n\nWe’ve got some exciting returnees such as Sacha Dhawan, Sophie Aldred and Janet Fielding. How was it having those conversations?\n\nOne of the great joys are always the phone calls to people who've been in the show, or who might want to be in the show, and telling them what you think the story is how it's going to play out and asking them back. So the calls to Janet and Sophie were wonderful and were incredibly emotional. They were amazing and thrilled and throughout the whole process have just been extraordinary.\n\nIt’s important to take a moment to praise their sheer bravery and guts - to come back to something you have not done in twenty or thirty years is incredible. To step onto a set where you don't know anybody but to be going back to a world you thought you left behind is really extraordinary. And they are so amazing in the episode. It's a delight to see them amidst modern Doctor Who. So that was fantastic.\n\nWe talked about where we collectively thought their characters would be now. I really wanted them to feel comfortable with what had happened in the gap between when we'd last seen those characters on screen and where we meet them here. It's lightly sketched in, but it's really important for them as performers and for those characters.\n\nDid you always want to bring back companions from the past?\n\nIt was more to do with being asked to do a centenary special, that I thought there had to be something from the past that felt strong, unique and different to what else we’d done during Jodie’s time as the Doctor. So it was just a brilliant opportunity, and as soon as we knew we were doing that, that was one of the things I wanted to do.\n\nThose characters and those actors came to mind as I think they're representative of certain times in the show's history and they are both incredibly strong and vibrant characters. There are so many to choose from and in a way you want to do all of them but actually, I had to just pick two! And what both of them said separately was ‘Oh I think, Tegan would get on well with Ace’ and then ‘Oh I think Ace would get on really well with Tegan’.\n\nWith Sacha, it was a long term plan that we had spoken about when he was last on the show. At the end of season 12 I had the conversation with him, knowing that we would be doing Jodie's final episode at the end of the following season. The big conversation was about coming back for her finale, because it had always felt like his Master and Jodie's Doctor instantly had that chemistry, and that it would be a really fitting last battle. It took a lot of planning and obviously then that was disrupted by the pandemic so we held on to it through everything, through all the storms. Obviously he's incredibly in demand and he was also filming The Great but we made it work in the end. He made it happen and were just thrilled because that was the plan all along. He has rewarded everyone with the most incredible performance in this episode.\n\nWe have a focus on villains in this episode, was it hard to keep that balance of good evil? Will it be a dark episode?\n\nI would say it's a fast, lively and exciting episode. What you have with the three villains is separate plans and multiple threats for the Doctor. So the Doctor is really having to contain separate attacks on multiple fronts and it's incredibly overwhelming. She's running from pillar to post to try and sort all of these things out. And again, it was something I had in my mind for a long time, that it'd be lovely to do the axis of evil, the triumvirate of evil in Jodie's final episode. We hadn’t done those, and I really wanted to hold that back for her finale.\n\nThe scale of this episode is huge, apart from the obvious COVID challenges, what were the other challenges faced during this process?\n\nEvery sequence is massive. So even the pre-credits - which is the longest pre-credits we've ever done - is like a mini movie in itself. And this episode has more visual effects shots than any episode in Doctor Who history. It was a huge demand on the visual effects team. There is a lot of action, there are a lot of locations, there are a lot of monsters, there’s a lot of things exploding! Really from the get go it had to feel constantly on the move, constantly exciting and I think it does. It was a lot of work and a lot of brilliant directing by Jamie Magnus Stone, who really is such an incredible talent and has such an ability to corral both of the emotions and the action and the scares and the humour. I think he's done an extraordinary job.\n\nHow was it writing the Doctor’s final scenes, and did you see them being filmed?\n\nWriting it, I always knew where we were going so I knew what I was writing towards. I knew what the final words were going to be, and where everything was going to happen and finish. So I wrote those quite early on and sort of just put them to one side.\n\nI was on set for the final day shoot, there were a lot of people on set and there was an outpouring of love. It was a very special and very fun-filled day, there was a lot of music being played, Jodie put on playlists. There was a real sort of party atmosphere on the final day, and then we ended with these incredibly emotional final scenes. It was just a great way to finish, I have to say the last few days we had a shooting were just delightful and particularly after coming through quite a challenging year of filming, it felt like everything landed in the right place. The production team had done a great job in scheduling the final scenes of that Doctor as the final scenes we were going to film which isn’t always the case and it felt very appropriate, very right, very lovely. It didn’t feel like a sad day, it felt like a very happy day, a sense of job well done and there was so much love for Jodie and Mandip.\n\nWhat do you think Jodie's impact has been during her time as the Doctor?\n\nShe changed the game. She changed history in terms of Doctor Who. I think what she's brought is a Doctor who is full of hope, and positivity and generosity and I think that these times really needed that. I think she's shown off her incredible sort of clowning side, the humour that she can do, which maybe some people didn't know her for beforehand. I think she's enriched the character of the Doctor, as all actors who play the Doctor do, but it's an incredibly bold and brave performance.\n\nAnd she took responsibility for the Doctor being a woman, she took it on her shoulders and represented and that was not a given, that was her strength and decision and power. I think she has been utterly magnificent, she exceeded all of our expectations. She's given a whole generation of young girls and women a chance to feel that they are the Doctor also and that was always the purpose from the start of this era, was to really widen that net.\n\nIf you could pick your top two or three favourite episodes, what would they be?\n\nI'd have to have a really long think about it but it’s definitely more than two or three! The ones that I really loved looking back were things like Spyfall, Rosa, Demons of the Punjab, Kerblam!, Fugitive of the Judoon, Ascension Of The Cybermen, War of the Sontarans, Village of the Angels, Eve of the Daleks. But actually, there's loads of them that I really love and that I'm really proud of. I think it’s impossible to choose because on different days, you'll feel different things! There's quite a range in there, from out and out comedy to really serious drama and action in between. I feel like we really tried to make the most of the range of the stories. The whole experience is very hard to break down into components once you're at the end!\n\nWhat are you most proud of during your time on the show and what will you miss the most about Doctor Who?\n\nIt's really hard to talk about what you're proud of. I like the range of stories and the variety of stories. There’s a lot (to be proud of) - the first woman Doctor, a lot more women writing and directing the show, and a more diverse range of directors and writers on the show. That was the mission statement at the start for me, that's what I wanted to do when we came in. And as I look at it now, in terms of the run we've had we absolutely delivered on that. That was really, really important. I'm really proud of that, but then there's just certain stories that you think ‘We really landed that one!’\n\nI think the thing I will miss the most is the madness of making the show. Because you can be shown the design for a monster one minute, then you're in 1950s America, the next moment you're getting the rushes in - you get to do things on Doctor Who you don't do anywhere else. And the visual effects teams are amazing.\n\nDid you take any mementos from set?\n\nYes I have a roundel of the TARDIS, quite a few of us do! I have a few little gifts that I was given, a front plate of the TARDIS – the plaque on the front. I didn’t take a lot, because I have a lot from the past couple of years! Weirdly the thing you take most are the memories and you kind of can't explain those. That sounds really sentimental but it's really true, it's not the objects, it's the experiences and the people.\n\nThis is also the end of Yaz’s journey, what can we expect?\n\nIt’s a big episode for Yaz and it’s the last chapter in her story, and there is a lot of things that she has to deal with do in this story. I really wanted it to feel big for Yaz as an episode, and I really think it does.\n\nMandip, there are not enough words in any language to describe how extraordinary Mandip is, and how brilliant she has been for the show. She is such an amazing actor. She is one of the greatest human beings, she is so smart, so funny, so kind and everyone in the television industry should be queuing up to have her as the lead in their next series because she is such a huge talent and such an amazing person. I cannot speak highly enough of her.\n\nWe really lucked out when we cast her because you never know, and to have her along for the whole of the Jodie's era - she is as defining of it as Jodie is. The journey that her character has gone on, it's so broad. My admiration for Mandip is unlimited.\n\nAre you excited about the next era and being a viewer again?\n\nI'm really looking forward to not knowing anything, I’m already enjoying it. And in fact, I had to say to Russell on a couple of occasions, ‘Please don't tell me!’ I'm lucky enough to have seen the full ending of The Power of the Doctor and even the tiny bit of the end just made me thrilled about and excited and desperate to see more about what comes next. It’s a delightful prospect!\n\nCan you tease what's coming next for you?\n\nThat's the great thing now is I don't have to tease anything. *laughs* I’m doing lots of different projects, I’m doing stage projects, quite a lot of TV activity and we'll see where it goes. But I'm having a lot of fun doing very different things!\n\nInterview with Jodie Whittaker\n\nCan you tell us what audiences can expect from your final big special?\n\nI would say that Whovians are in for an absolute treat. We celebrate the old, the present and the new. It’s a wonderful homage to the legacy that Doctor Who has had. It encapsulates all the things the fans love about Doctor Who – whether it be old monsters, returning characters, new elements, everything that unites Whovians is in this episode. If you haven’t seen Doctor Who before this special will be sure to hook you in for your new Doctor.\n\nWas it exciting to be part of the BBC’s Centenary celebrations?\n\nIt is. I love the BBC, it’s a huge part of the fabric of our industry. Doctor Who is a huge part of that. Being part of a show that is so iconic in the BBC, I’m very passionate about. For this episode to come out now is a real celebration. As a young kid, the TV shows I watched led me to this now. All the drama, the comedies and the 100 years of the path that it’s laid has led to my casting.\n\nIt's a huge episode for the villains – it’s the first time we’ve got the cybermen, The Master and the Daleks all in one. How has it been working with Sacha again?\n\nI love Sacha, he’s amazing, an incredible actor and a phenomenal force of nature on set. His detail and level of commitment to The Master is inspiring. But in that he’s also a team player, he turns up and the crew love him, cast love him because he’s a really good laugh and he makes sure he’s part of the team. For me, he’s the perfect villain because in real life he’s the complete opposite and on screen you absolutely believe everything that comes out of his mouth. If you know him in real life, he’s such a nice guy and a lovely man. So to be so convincing as The Master? Hats off. All his choices I love. A lot of my favourite scenes throughout my tenure have been with Sacha. So being told he would be part of my final episode was an absolute joy for me. I don’t feel as it would have served my Doctor to not have the moment of resolution and heartbreak with him.\n\nHow tense are those scenes?\n\nWhat I love about Sacha’s Master, and what I think is important, is that he’s so broken and actually it’s not just two-dimensional evil. It’s got so many layers and there’s such a vulnerability to him that it makes things much more complicated for the Doctor. That he cannot let the Doctor survive is the most heart-breaking thing. Our last scenes were shot in order, which we never usually do so it had a big build up.\n\nHow were the stunts this time?\n\nStunt-wise, the opening sequences were really fun because they involved all of us at all different competence levels. You have got Dan falling out of the TARDIS but then smashing his landing. There are a lot of iconic costumes that even the fandom who haven’t even seen the episode are recreating. Someone at Comic Con turned up in my orange astronaut costume.\n\nThere are so many brilliant moments for us, there’s a lot of playfulness. There was a massive stunt that I wasn’t allowed to film where Sacha yanks the Doctor back. That was Linda, my double. Sometimes I’m gutted I’m not allowed to do things, but I didn’t miss out on being dragged over a quarry. I was fine with that!\n\nWe did loads of wire work for walking on the roof of the train. The suits were hot, and we had to have fans pumped in but they had to be turned off and then the screens would steam up. So, you had that critical moment where they’d scream ‘film’ and then the steam would come up. You go, ‘It’s not as easy as it looks!’\n\nCan you tell us about the atmosphere on set during those final scenes?\n\nEveryone was wonderful. On my last day there were last scenes with Yaz and the Doctor on the TARDIS but I got in a bit before Mandip to start filming. I was wondering where everyone was, but they got me on set and the cast and crew had lined up and were clapped me and I obviously lost it there. Then we did it for Mandip and I was crying more than her!\n\nJen, who was our third AD, had stepped up to step in as the first (AD) that last few days. She said ‘So this is the final time I’m going to call ‘Rehearsal in the TARDIS’ and I lost it. We shot the last moment and it was one take and once the camera team were happy, I could see everyone nodding and making eye-contact and my bottom lip went and I knew it was the end. It was just (the challenge of) being able to articulate to everyone what you think of them. It’s not just Mandip, not just the cast, it’s all the phenomenal people you get to work with. It’s lifelong friendships that have been forged in four years and we’ve had the time of our lives and survived a pandemic! At the beginning of our work, we had to be all separate and then at the end, we could all come together. It felt particularly emotional because of where we were at.\n\nWhat will you miss most about being the Doctor?\n\nI’m not a method actor, I don’t stay in character between scenes, but I spent a lot of time before I played the Doctor doing quite emotionally traumatised roles. I’ve played people who lost children, people whose husband had been disabled, things where characters were on the brink a lot of the time. They were major events that I can’t understand, so a lot of the time at work you are always on the moment of devastation. A lot of the time for me filming was amazing and fun to do, but you are always on the brink of upset. (With Doctor Who)\n\nThere were four seasons, there was heartbreak, there was fear and there was loss, but my overriding emotion was excitement. I felt like the over-riding thing the Doctor brought was curiosity and excitement. Obviously fear, rage and all those things, but the thing that encapsulated my Doctor the most was that bouncing into things, and that really fed into my evening and my weekend and my year. I was very half-full all day every day, so it bleeds into life. I’m not someone who sits in character all weekend but you do realise how much that emotional trauma leaves you on the edge of upset when you’ve been doing it for 12 hour days. You don’t quite let it go at the end of the day, without realising. So the reason I can gush so much about this job is because it wasn’t just happiness on set, it fed into everything. I feel like it’s knocked 15 years off me because I’ve been so energised because I had to be at work that it fed outwards and I’ll miss the energy of the Doctor.\n\nWhat are you looking forward to about being a viewer of the next era?\n\nI’m really excited to not know any spoilers! There was two big events for me – knowing O turned into the Master and that Whovians would be like, ‘OMG!’, and that I dig up a TARDIS and I turn round and Jo Martin is the Doctor. Knowing those two things were coming in one season and they hadn’t been leaked was the most fun. So now I won’t get to know those things before they come out, so I can’t wait to go, ‘You are kidding me!’. I cannot wait to see it in real time, and I don’t have the stress of keeping the secrets.\n\nDid you steal anything from the set?\n\nI’ve got my costume, my sonic, a Cyberman! When I fly the TARDIS, I flick a switch and what spins inside is a mini TARDIS that lights up so that spins and then I pull the handle down - I’ve got that too.\n\nYou and Mandip have spent such a long time together. What will you miss most about the bond between the Doctor and Yaz?\n\nMandip makes me laugh in a way that nobody else does. I find her to be one of the funniest people I’ve ever been around. Mandip is in-built half-full and really constant. Everyone loves being around her. Whenever we get people on set, everyone gravitates towards her because she just is ace to be around and she is a perfect energy for me. On a selfish note, she makes me a better actor and a more level-headed person. So, on a selfish note, I feel like my anchor has gone because she never runs out of chat, which is my favourite thing…there’s an unconditional love and sisterhood. It’s unique where you find that later in life. I met her at 36 and you don’t think you’ve got room at that age. But to not be around her energy every day has been hard and I have really missed it, but obviously we speak all the time.\n\nIf you could pick one scene from your whole time that you’d love to do again, what would it be?\n\nThe episode I’d like to do again because I had such an amazing time around it, it wasn’t just the filming but the location, the people, and experiences while we were there – was Demons of the Punjab. I loved that we shot in Spain, it was our first season, it book ended our time with Jamie Childs, who’d directed us at the beginning and the end. There were some very funny moments on and off camera, we had a wonderful story that educated me because I shamefully didn’t have the knowledge about that period of history that I should have had.\n\nSo if I could go back and relive that time, I’d choose Demons of the Punjab but it would be for many reasons. Any Doctor Who fan who is into our series knows I love a birthday and I had a birthday out there, so that played a big part. But as far as doing a scene again, because it was my first week, I wish I could do the crane scenes again because the jump across, filming with Jonny (Dixon) and having scenes with Amit Shah and doing massive stunts. They were my first scenes on set and I had my very first hero speech so I would love to do that again, not because I want to change anything, but so I could relive it.\n\nWhat would be your top tip for the next Doctor?\n\nThis is yours for the taking.\n\nInterview with Mandip Gill\n\nCan you tell us what audiences can expect from this feature length centenary special?\n\nExpect lots of jaw dropping moments and amazing character interactions. When I first watched the episode my mouth was wide open. It is fast paced and as expected Chris Chibnall has once again upped the stakes in this special.\n\nIt's a huge episode for villains with the Master, Daleks, Cybermen all appearing together for the first time since 2005. How was it working with Sacha again? Were you excited to find out he was back?\n\nI love Sacha. It is amazing to work with one of my closest friends for obvious reasons but to watch him as an actor, creating the work he does is a privilege to watch. Trust me - you’ll see what I mean when you see it!\n\nWe’ve also got two returning companions, Sophie Aldred and Janet Fielding, did you get to know them on set?\n\nYes we did. It was really nice to be working with people who love the show as much as the current cast and both have so much energy and plenty of stories from their time which helped pass time during filming. It was also really exciting trying to keep them both a secret whilst filming.\n\nThe trailer looks action-packed, can you tell us a bit about any stunts we can expect?\n\nFirstly I do all my own, so please remember that when you see me flying in the air holding on for my dear life! That was really hard and all me. Seriously it was really fun but taxing. The ropes are tight and it’s difficult to hear in the helmets. Oh and climbing up the ladder was also so difficult. It was wobbling everywhere so my look of sheer panic and distress is real. However it’s always fun to read a script where you see a stunt written, you know it’s going to be a fun few days on set.\n\nCan you tell us about any fun moments with the team during filming? Those spacesuits look comfy!\n\nThe suit itself was very comfortable but we had huge space helmets on that had air pumped into them and I was apprehensive to put it on at first, as I was scared the air supply would stop. But the team were amazing and would take them off if I needed it. Deian Humphreys, our Sound Mixer, kindly played Dave the rapper into my helmet so I could have a little dance and rap along.\n\nCan you tell us a bit about how you handled filming your final scenes?\n\nFilming the final scenes were emotional, as to be expected. The Executive Producers were on the floor, the atmosphere was beautiful and naturally Jodie and I had real emotions flowing. It will be something I will remember for the rest of my days as we all knew it was the end of a beautiful chapter.\n\nYou and Jodie have been on this amazing journey together, do you hope to share the screen again?\n\nAbsolutely, we think of ideas and it usually ends up with us both been very northern and attached to the police force somehow. I would love to work with her again on something completely different, even a different genre. I am so fortunate to have found a best friend in her. The last four years have been amazing and so easy as we quickly become inseparable. We’ve been fortunate to have seen some of the world together too.\n\nIf you could go back and film one episode or scene again, what would it be and why?\n\nI would zoom back to the beginning where the Doctor falls through the train roof and we all meet. At the time I was thinking about my delivery, character and the scene. This time I would stop and be able to see the amazing journey we’re embarking on and I would be able to enjoy it a tiny bit more.\n\nWho have been some of your favourite guest artists over the years?\n\nToo many to name. But watching Kevin McNally at work doing what he does so well is a highlight. Working with Jacob Anderson was a real treat I’ll treasure forever. Sacha has since become one of my closest mates but watching his process was precious. He is such a hard working brilliant actor. Joana Borja, Nadia Parkes and Crystal Yu (to name a few) are just some of the reasons why working on this show has been the highlight of my career so far. Getting to meet amazing talented interesting actors that become friends is a wonderful feeling.\n\nWhat will you miss the most about Doctor Who and what are you most proud of during your time?\n\nI will miss Cardiff and the crew there. They work so hard and are truly like family. I can’t emphasise how enjoyable my time has been on Doctor Who. Working long hours in all sorts of terrain with your mates is not really working for me. I am most proud of the atmosphere on set I helped to create. There were some very tough days but staying upbeat and positive can really help the rest of the cast and crew in difficult times. Jodie unknowingly has set a very high bar as “number 1” and I will work hard to follow suit.\n\nDid you take anything from set? We heard a few things went missing..!\n\nSo, I definitely heard someone say we can take stuff. As soon as we heard that the TARDIS was dismantled in seconds! I took a sphere that was glued down but with the help of the runners it was soon in my possession and hidden from anyone I thought would steal it off me. Then we heard they still had scenes on the TARDIS to film - imagine my face because I am not naughty.\n\nAre you excited to see the next era?\n\nI am so excited, it will be really interesting to see their stories as I know some of our episodes were specific to my heritage, such as Demons of the Punjab and Tosin Cole’s (heritage) in Rosa, so it’ll be interesting to see theirs. Also to see them up against new and returning monsters will be fun to watch!\n\nHow was it knowing that this episode would be part of the BBC centenary celebrations?\n\nAt the time we were still only half way through the current series so it almost felt normal until I realised it was a feature long episode and it would be the regeneration and many wonderful characters! Only then did it dawn on me how privileged I was to be a part of something so iconic for Doctor Who and the BBC.\n\nCan you sum up Yaz in three words?\n\nLoyal, courageous and resilient.\n\nInterview with Sacha Dhawan\n\nHow did you feel when you heard you’d play such a big part in the Thirteenth Doctor’s final episode?\n\nI was really excited to be a part of the centenary special and Jodie’s last episode, but I was also slightly nervous. You want to do the episode justice for Jodie, the rest of the cast, and for the fans. So it was a case of being excited to come back, but also wanting to offer the fans something different. I think that’s something we’ve certainly achieved.\n\nDid you expect to return?\n\nI knew Chris (Chibnall) wanted to bring me back. We had an open and honest conversation which was amazing, it was like a wish list. He asked me, ‘If you were to come back, what would you like to do’ and I think my head exploded. I think one of the things I really wanted to do is... fans have seen my incarnation, but I always felt that with The Master, there are so many different layers to explore. For me, he’s always been a master of disguise. He’s not happy within himself so he likes hiding in the skin of other people. That’s why I said to Chris that in this episode, I’d love to play around with these different layers and see how far we can take it.\n\nIs it hard to get back into The Master’s skin every time?\n\nIt always brings challenges and that’s great because I’m always wanting to do something different with it. But I enjoy playing him, so even though it can be a bit terrifying at times, it’s a good feeling to have. The Master is unlike any other character I’ve ever played because they’re so rich and dynamic. You never quite know what you're going to get, and I relish leaning into that.\n\nSophie (Aldred) and Janet (Fielding) have complimented your work!\n\nThat’s so nice of them. I’m a huge fan of both Janet Fielding and Sophie Aldred, they’ve had so much more history with the show. It’s a huge part of their lives and you want to do it justice for them, so when they are complimentary, it means more than just an actor complimenting your work. The feeling is certainly mutual and I think they do a fantastic job in the episode.\n\nWhat is it that you think makes The Master such an iconic villain throughout Doctor Who’s history?\n\nIt’s like the relationship between Moriarty and Sherlock Holmes. The Master gets to do things that the Doctor just can’t do. You can even wipe out his existence and he’ll still find a way to come back with vengeance. He’s also a character you love to hate because there's always a certain charm and charisma in the execution of his evil plans. I think the audience really like that because it counteracts The Doctor.\n\nAnd the relationship between both The Master and the Doctor has always been so fascinating because it's steeped in so much history, not only in front of the camera, but also, behind the camera too, especially if you look at the actors that have taken on the role over the years. And it’s a show that totally embraces each new incarnation with such excitement, with each era being an historical event of our time; ‘Who was your Doctor?’\n\nI guess it's the fandom themselves that make both The Doctor and The Master so iconic, by being so warm and welcoming of its new additions. It’s why the show continues to thrive from generation to generation.\n\nCan you tease what audiences can expect from The Master and the special in general?\n\nThere is a line that The Master says to the Doctor, ‘This is the day you die’. In fact, it's the day that puts both their lives on the line because The Master has no real control over its outcome, which makes it all the more terrifying. The Master will set out his masterplan with plenty of room for spontaneity and chaos. He's really pushes the dial to its limits, because the truth is, he has nothing left to lose.\n\nCan you tell us about any key moments from filming or building friendships on set over the years?\n\nIt was so nice working with the Doctor Who team again. It’s like stepping into one big family as they're all so warm and welcoming. I was so nervous when I first joined the cast in Series 12, but I felt like I was more at ease this time round which meant I could soak it all up a bit more, and take in what was really a special moment in history. Not only were we celebrating the centenary, but we were also celebrating Jodie's era as the first female Doctor. I couldn't be more honoured and proud to have been a part of that.\n\nI will always recall my first day in Series 12; we were in South Africa against this absolutely amazing backdrop, which I couldn't take in because I was just so nervous. It was only when I stepped into the make-up trailer for the first time and was greeted with both Jodie and Mandip's beaming faces and contagious laughter that I knew that this was going to special one.\n\nCan you tell us a bit about the different incarnations of The Master we can expect?\n\nOne of the early ideas I had about playing the character was that I didn’t ever want to use prosthetics. It's what makes The Master such fun to play, because I get to sink my teeth into so many different characters, and the onus is on me to make them believable and interesting. It also keeps the audience on their toes too, because I never wanted them to feel settled with my incarnation.\n\nWith this episode in particular I had early conversations with Chris (Chibnall) about each specific version of The Master and then worked closely with our brilliant makeup team and costume designer (Ray Holman) to create the right look. It does require a lot of attention to detail, not just in how the character looks, but making sure the performance of each incarnation feels truthful and fully formed. There’s definitely one incarnation you wouldn’t expect, but has been a long time coming...\n\nWhat have been some of your standout memories on Doctor Who so far?\n\nThere’s been quite a few but I’d say the reveal of The Master on the plane in Spyfall was an iconic moment. That was the first time anyone had seen my incarnation. You practice the scene over and over again on your own, but it's only when you get on set with the actors that the character really comes alive. It was utterly terrifying, but something really special happened in that moment. To be honest, it wasn't what I initially intended when I was rehearsing on my own... but that's what I love about what we do. Sometimes you just have to surrender to the moment, take it with both hands, and embrace it.\n\nCould you ever be tempted back to Doctor Who?\n\nI’m in two minds about coming back. I was nervous about coming back for the centenary special because you offer something up and you think, ‘Well, maybe I have done as much as I can with it and I don’t ever want it to feel predictable’. And we end on such an epic finale in this special... do we need to see him again?\n\nBut in saying that, it’s Russell T Davies and he’s an amazing writer and a beautiful human being too... so who knows? And also, let’s not forget, you can put The Master on the edge of the universe, but he'll always find his way back again...\n\nHow would you describe the legacy of Jodie Whittaker’s Doctor?\n\nI remember seeing the announcement that Jodie was the first female Doctor and I wasn’t part of the show then. I was blown away because it was a real moment in history, and she couldn’t have been more perfect for it.\n\nBut to be an actual part of the show, you get to see a version of the Doctor that people don’t get to see, which is Jodie being an absolute company leader. She's the most gracious and generous actress I've ever worked with. And she takes it upon herself to look after all of us on set, which isn't an easy feat when you're playing such an iconic role. And she manages to do it all with such ease and charm.\n\nThe world is moving way too fast nowadays. We're always looking for the next 'moment', the next piece of news, without really digesting the moment here and now. And Jodie’s era is an iconic moment in history not only because she was the first female Doctor, but she was also part of an era that overcame a global pandemic. A pandemic that has changed our lives forever. Jodie for me represents hope, our shining light, she’s a beacon of our time.\n\nInterview with John Bishop\n\nWhat can we expect for Dan in this special?\n\nI think at the start Dan is committed to his time with the Doctor and with Yaz, but then there is an incident that makes him question where he really needs to be and what his next steps should be. It takes him a little bit by surprise as well.\n\nVillains are playing a huge role in the episode, can you speak about what people can look forward to seeing?\n\nMy main interaction is with the Cybermen. The strange thing about most of the monsters in Doctor Who when you are on the set, a lot of them are prosthetic based so when there’s a break you can kind of know when an actor is there. With the Cybermen when they walk on set they are scary! They have a scary aura about them. If I was ever to run a nightclub and need a bouncer, I think I’d get a Cyberman!\n\nWe’ve seen you get to wear some pretty stylish spacesuits?\n\nWearing the spacesuit is a proper step up. It’s something that you’d pay to do at a theme park with your mates, you can’t think of anything more fun. There’s a bit where my nose gets stuck in the helmet, but my actual real nose wasn’t big enough to get stuck so they made a copy of my real nose and then gave it to me. So I stuck my prosthetic nose on my real nose to get stuck. It’s a weird experience to have your nose in your pocket!\n\nWhat was the atmosphere like on set?\n\nIt was definitely emotional. We went out for dinner one night with Jodie and Mandip and there was a tear shed mainly by me! You don’t often get that kind of feeling. You cross paths with people and you hope that whatever happens, these people are always in my life. That’s a rare thing.\n\nWhat do you think the impact of Jodie’s Doctor has been?\n\nThere are few things, like changing the gender of the Doctor was huge step. The relationship between the Doctor and Yaz is a huge evolution.\n\nHer legacy will be energy, if you look through the character traits and the characteristics she’s inherited and that she’s picked out, the character trait that she seems to have focused on from previous Doctors is the energy, the drive to come up with solutions quickly and to explain them as quickly has her mouth would speak. I think she nailed it incredibly well and on set you could feel it. She could get a page of information, which language wise was hard long complicated words in a crisis situation, she’s got to explain it to humans. The Doctor’s got to explain this mass of intellect and reduce it to the mind of normal beings. In some respects it’s like being a parent to a four year old.\n\nI think the energy and joy she brought to the role is amazing. For me I’m going to confuse the screen character to the on set person, so I will always see that positive on set personality shining through the screen because the screen character is carrying on the traits of the previous Doctor’s. Jodie is just sunshine.\n\nWhat has being part of Doctor Who meant for you and for your acting career going forward?\n\nIt might have given me one or ended it! *laughs* Most people’s experience of me is in entertainment TV shows unless they’ve seen me live – live comedy is what I do best and what I love most. The TV shows are entertainment which means they are there for the moment they are on, they are there to entertain and that’s fine. They’re like candyfloss, they are nice while you have them but they don’t fill you up.\n\nTo be placed in the world of Doctor Who, that has a legacy and which will last beyond the moment you are filming it, for me that alone makes it worth it. It’s very rare in your career where you get the opportunity to be in that type of show. You know you’re in something iconic in Doctor Who and in fifteen years’ time, someone will watch those episodes for the first time. That’s what being in Doctor Who is and that’s a very special thing.\n\nDo you have Doctor Who fans coming to your gigs now?\n\nOh yeah, I have Doctor Who fans coming up to me, only yesterday I had three different people come up to me and they couldn’t have been more different. There’s not a stereotypical Doctor Who fan at all. If there was a line up and you were to guess who was a Doctor Who fan I could put those three in there and you would never have picked them.\n\nWhy should people watch the centenary special?\n\nIt’s a feature length episode but it’s fast, there’s something happening all the time. The jeopardy is huge, I think Sacha as The Master is just brilliant. They’re going to see a lot of familiar faces and surprises, a lot of surprises. I think they are going to get all the best of what they have wanted from Doctor Who... it’s like a mega value box of monsters because they are all there. Everyone you’ve had nightmares about arrives!\n\nInterview with Janet Fielding\n\nWas it difficult to make the decision to come back to Doctor Who?\n\nIt took me oh, it must have been a whole thirty seconds to think yeah, I would (be interested)! But I didn’t anticipate that it would be anything other than a tiny cameo. I just assumed that that’s what it would be. And it wasn’t!\n\nCan you tell me about your discussions with Chris Chibnall about coming back?\n\nWell he phoned me up and we had a long chat and I said I thought that Tegan would be some sort of social campaigner, that I saw her getting involved in social issues, and that amongst them would be the environment and campaigning... I thought she’d probably have a couple of divorces behind her and that she would have adopted a child because that would be an environmental thing for her to do.\n\nWas it challenging to get back into the character of Tegan again?\n\nI do the Big Finish audio dramas, so I’m still often in the head space anyway although usually it’s back in time and not Tegan having moved on. I’m nearly 70, so it’s slightly different, it’s Tegan not having left the world of Doctor Who, it’s Tegan before she walks out the door which I did in 1984.\n\nWas it hard to keep your return a secret and how did you feel about the reaction?\n\nI found keeping the secret quite difficult because people are used to me going away doing Blu-ray extras and doing the odd bit of filming for that and fan conventions so I basically told people that I was doing Blu-ray extras, just I seemed to be doing more Blu-ray extras than normal, an awfully concentrated set of them, so that was quite funny. So “Where are you filming?” people make conversation, I made the mistake of saying “Cardiff” to a friend who instantly guessed because I’d been going away so often! She’s a really good friend and I told her if you tell anybody I’ll have to kill you, and she did keep the secret! One of the hard things was how do you get people to run lines because you need somebody to run your lines with you.\n\nWas that aspect of getting back on set quite nerve wracking, in terms of tackling line learning, etc?\n\nIt’s a bit like driving, it’s an act of coordination and so you have to get into the rhythm of it, and so it took me a little bit, like a few days, to get into the rhythm of it. Things like remembering the lines, once upon a time it wasn’t really a problem, now it’s not as easy as it was because I’m not used to it!\n\nThe response was just amazing, to hearing that you were coming back. Was there anything that stood out to you?\n\nI was gobsmacked! Everybody sort of said, ‘Oh my god I screamed when I saw you and Sophie (Aldred) in the trailer!’. And you go, ‘Really?’ They were so excited. Chris Chibnall and Russell T Davies both warned me, and reached out to say it will be incredible. It was truly overwhelming the number of tweets that night. And then of course all the newspapers picked up on it and all the online editions had it as a story. I sent it off to my brothers in Australia.\n\nCan you talk a bit about your involvement with the villains on set?\n\nI’ve got such sympathy for Patrick O’ Kane as the lead Cyberman (Ashad). He is absolutely terrifying to look at, he emanates really serious menace and he’s a very big man anyway, but he so was terrific, because we were in scenes together, we would sit and wait in the breakout area and I’d think “Oh god, how uncomfortable that must be.”\n\nAnd then Sacha, I mean, Sacha is so good as The Master. So menacing. I’d use the word, unhinged. He’s very unpredictable as The Master, he’s very alarming for that reason…it’s a brilliant performance.\n\nDid you have input into Tegan’s costume?\n\nI went to meet with Ray Holman just before we started filming. He’s clever, Ray, and he’s so lovely, what a lovely team. I sort of said what I thought, given what her story is now and how she’s developed, and he had put together what he thought, we didn’t even have to go looking, he’d sent me a photograph of the jacket, coat, and as soon as I put it on I thought ‘yep, absolutely, love it.’\n\nHow would you describe where we find Tegan in this special?\n\nThe former companions who are on Earth have managed to get in contact with each other and she and Ace know that something is happening, and that the activity is likely to be alien. And they are investigating...\n\nDid you enjoy working with Sophie Aldred?\n\nOf course. How could you not enjoy working with Sophie? She’s the loveliest person.\n\nDid it feel special to be part of Jodie’s final episode?\n\nIt felt hugely special. The first female Doctor, and a really exciting story, and also that I’ll be there for another Doctor’s regeneration - it’s the second time that’s happened! (Note: the first time was for Tom Baker regenerating into Peter Davison: Tegan’s first story, Logopolis)\n\nHow would you describe Tegan?\n\nShe takes no nonsense and she’s assertive and a lot of female characters of that time were “I’d be so nice to have in your drawing room” whereas Tegan would be more likely to challenge you. “Oh really, you think that? Tell me why.”\n\nInterview with Sophie Aldred\n\nCan you tell us about the call to come back and be a part of the centenary special and was it a tough decision?\n\nI’ll never forget where I was. I was in the conservatory in my house and I got the call from my agent who said ‘Andy Pryor who is the Casting Director on Doctor Who has been in touch and you know what that means!’ I put the phone down and burst into tears. The call I didn’t realise I’d been waiting for all these years. The next thing that happened was a Zoom call with Chris Chibnall where he asked me if I would do the great honour and privilege of being in the BBC centenary episode. I said wild horses wouldn’t stop me! That was it.\n\nWhat were your first impressions of getting that script and what were you most excited about?\n\nThere’s a particular thing that happens which I couldn’t believe Chris put in, because it calls back to something I did thirty years ago. To do that again was just incredible. I was really lucky that I was a companion as I met the Daleks and the Cybermen and The Master. I was really excited to meet and be in scenes with Jodie and Mandip and it was a thrill to be in the TARDIS – What was I most excited about? All of it!\n\nWere there any big differences in being on set, was the family feeling always there?\n\nThe family feeling was completely the same, run by Jodie. That was totally her, it was incredible. The banter, the jokes, but also the hard work ethic, having fun, everyone, cast, crew, production. It was lovely to see the relationship between Jodie and Mandip. It reminded me of how it was with Sylvester (McCoy) and me. The same close relationship which I’m sure will be for life, like mine with Sylv.\n\nI think the only thing that was very different was not having rehearsals like we used to have at the BBC in North Acton and COVID of course. Everyone was in masks. It was quite weird because my wonderful makeup artist, India, was wearing a mask, and when I saw her without it, I had no idea who she was!\n\nWas it difficult to keep it a secret, were you shocked by the response?\n\nYes it was difficult to keep the secret because I did quite a lot of appearances and podcasts during COVID and people were asking me direct questions about it. There were some fans that were awfully near the mark and I just couldn’t say anything! I knew the trailer would be well received by the fans, but I didn’t think that we would break the internet. *laughs*\n\nThe following day someone told me that on the BBC news website ‘Janet and Sophie back on Doctor Who’ was one of the biggest topics which was just bonkers. I had no idea it would be such a big deal. People were still tweeting, nearly two weeks later, and still going now!\n\nHow has it changed when you’ve been at conventions?\n\nThe conventions that I love most are the small ones with about a couple of hundred fans. That’s like a family really; that’s not changed. Although people are incredibly excited and always tell me how they screamed and shouted and jumped off the sofa when they saw the trailer. As for the bigger ones, the Comic Cons, my queue for one recently was all day long, and I didn’t stop!\n\nI’ve never had that, not even when we were doing the original series. Demographic wise, there’s a lot of young women, who have fallen in love with the series via Jodie and now who have gone back and watched the classics and they really relate to the character of Ace. They love the realism, her feistiness, her wearing her heart on her sleeve and she speaks to them.\n\nHow difficult was to get back into Ace’s skin on set?\n\nIn Big Finish and other audiobooks and spin offs, I’m usually playing a younger Ace, probably up to age 30. So suddenly to play middle-aged Ace... I’d had a chance to think about how she’d be and how she’d be with the Doctor (through other projects like the Torchwood audios and the Blu-Ray box set trailer). It doesn’t take her very long to get back into this youthful frame of mind!\n\nCan you tell us how you prepared for Ace’s stunts – I hear you were looking forward to that side of things?\n\nI was talking to Janet Fielding in one of our breaks and I said when Chris asked me what I’d like to do, I wanted to show that middle aged women have still got it! We can be fit and active if we choose to and do that same stuff and I said to him that I’d love to do what I used to do. Janet said several expletives *laughs* because of course she had to chase me around up the stairs, run around and do all that as well. I think she was secretly pleased!\n\nDid you strike up any bonds on set and how was it working with the core cast?\n\nIt was gorgeous to see Jodie and Mandip’s bond. I really get the feeling that they would do anything for each other as people. I’m sure they see each other a lot but I remember when Doctor Who stopped I missed being with Sylvester (McCoy) on set and I’m sure it’s the same for them.\n\nI think the relationship that has delighted me (as well as deepening the friendship with Janet of course) has been the one with Jemma (Redgrave) because the three of us, me and Janet and Jemma planned meeting up after – we haven’t done it yet! Jemma’s always working! We will eventually!\n\nHow was the atmosphere on set?\n\nIt was bittersweet. We weren’t there the day they did the last scenes but I know there were lots of tears shed. I said to the crew, ‘Gosh you’re going to miss this.’ It was a really solid group of people who loved each other’s company and working together. There was no hierarchy.\n\nHave you followed Jodie’s Doctor throughout her tenure?\n\nYes I have, I think it’s really important that she’s brought a whole new demographic to the fandom. That’s her legacy, it's bringing that young female audience to Doctor Who.\n\nThere are a lot of villains involved in this episode, can you tease audience about what they’re going to expect?\n\nI was thrilled to watch Sacha, The Master, in action. I think he’s a genius and he’s so not like that in real life; he’s sweet and mild mannered. I think the word I’d use to describe his acting is dangerous. You always feel with this Master that he is on the edge of insanity, but totally logical and has got a plan. He’s not an over the top villain which would be so easy for The Master to evolve into, but he’s got this edge and way about him. You don’t know where you are with him and you don’t know quite what he’s going to do next. Which I find incredibly exciting to watch as an actor, it’s like watching a masterclass, watching him work.\n\nPatrick (O’Kane) as well is great to watch. What he goes through to be that character, he can’t sit down, or go to the toilet. He’s another menacing, brilliant actor. You’re watching and you just think wow! Similar kind of dangerousness, it’s electric to witness that.\n\nWhat can viewers expect from Ace’s return and this episode?\n\nThey’re already excited! They won’t be disappointed."}, {"url": "https://metro.co.uk/2021/11/07/doctor-who-when-did-it-start-and-who-created-it-15559012/", "page_content": "Doctor Who is currently airing its 13th series - but it's actually run for many more seasons than that (Picture: BBC Studios/Zoe McConnell)\n\nDoctor Who has been a landmark in pop culture and an icon in British television for nearly six decades across many, many seasons.\n\nIf you’re late to the party and still don’t know just who is Who – the show focuses on a time-travelling alien shapeshifter (who just happens to take the form of beloved actors like Jodie Whittaker, David Tennant and Christopher Eccleston).\n\nTravelling around the universe, the Doctor and his many assistants solve problems and save the world.\n\nFor many fans, it’s just always been a presence. But when did Doctor Who first start?\n\nWhen did Doctor Who first air?\n\nThe first season of Doctor Who was originally broadcast on BBC on November 23, 1963.\n\nThe first ever episode was titled An Unearthly Child and the first series ended with The Reign of Terror on September 12, 1964.\n\nThe first actor to play the Timelord was William Hartnell.\n\nHartnell was also well known for military roles, playing Company Sergeant Major Percy Bullimore in the ITV sitcom The Army Game (1957, 1961) and Sergeant Grimshaw, the title character of the first Carry On film, Carry On Sergeant (1958).\n\nThe first run of Doctor Who was cancelled in 1989, after lasting for 26 years.\n\nThe show would be later revived in 2005 by showrunner Russell T Davies, who is returning to helm the show in 2023.\n\nWho created Doctor Who?\n\nWho created Who is not as easy to answer as one might think.\n\nUnlike the likes of Stan Lee and Jack Kirby being credited with creating their Marvel characters like Spider-Man and the X-Men, Doctor Who was the end result of a lot of people’s involvement.\n\nThough many names get bandied around, the key figures instrumental in bringing Doctor Who to life on the BBC include Sydney Newman, Donald Wilson, Verity Lambert, Antony Coburn and Bunny Webber.\n\nSydney Newman was a Canadian film and television producer, who played a pioneering role in British television drama from the late 1950s to the late 1960s. Spotting an opportunity for the BBC to produce a weekly series, he championed the idea of a science fiction show to fill it and recruited Verity Lambert as producer.\n\nHe was keen that it should be unlike anything done on the BBC before, and popular with all ages, whilst retaining an authenticity and credibility. In that respect, he set the tenor and tone of Doctor Who.\n\nDoctor Who has introduced the world to the likes of the Tardis and the Daleks (Picture: Getty)\n\nThe crucial idea that the Doctor’s time machine should be able to travel in space and in all kinds of matter can be traced back to Donald Wilson, according to sources including the BBC.\n\nAnthony Coburn was credited as the writer for the first four televised episodes, so he surely helped create what would become Doctor Who as we know it today.\n\nOther elements that are integral to the universe of the Timelord have been credited to various artists.\n\nPeter Brachacki designed the interior of the TARDIS and Ron Grainer wrote the theme tune.\n\nSo, basically, it took a village. Luckily there's room for them all in the Tardis...\n\nDoctor Who continues on BBC One tonight at 6.15pm.\n\nMORE : Matt Smith addresses possible Doctor Who return for 60th anniversary: Russell T Davies return is exciting…’\n\nMORE : Doctor Who: Who is Omari Douglas as bookies suspend bets on the actor?\n\nFollow Metro across our social channels, on Facebook, Twitter and Instagram.\n\nShare your views in the comments below."}, {"url": "https://www.thehindu.com/books/literary-review/the-doctor-and-the-saint/article5740369.ece", "page_content": "March 01, 2014 05:40 pm | Updated May 19, 2016 11:42 am IST\n\nAnnihilation of Caste is B.R. Ambedkar’s most radical text. It is not an argument directed at Hindu fundamentalists or extremists, but at those who considered themselves moderate, those whom Ambedkar called “the best of Hindus”— and some academics call “left-wing Hindus”. Ambedkar’s point is that to believe in the Hindu shastra s and to simultaneously think of oneself as liberal or moderate is a contradiction in terms. When the text of Annihilation of Caste was published, the man who is often called the ‘Greatest of Hindus’ — Mahatma Gandhi — responded to Ambedkar’s provocation.\n\nTheir debate was not a new one. Both men were their generation’s emissaries of a profound social, political and philosophical conflict that had begun long ago and has still by no means ended. Ambedkar, the Untouchable, was heir to the anticaste intellectual tradition that goes back to 200–100 BCE. Gandhi, a Vaishya, born into a Gujarati Bania family, was the latest in a long tradition of privileged-caste Hindu reformers and their organisations.\n\nPutting the Ambedkar–Gandhi debate into context for those unfamiliar with its history and its protagonists will require detours into their very different political trajectories. For this was by no means just a theoretical debate between two men who held different opinions. Each represented very separate interest groups, and their battle unfolded in the heart of India’s national movement. What they said and did continues to have an immense bearing on contemporary politics. Their differences were (and remain) irreconcilable. Both are deeply loved and often deified by their followers. It pleases neither constituency to have the other’s story told, though the two are inextricably linked. Ambedkar was Gandhi’s most formidable adversary. He challenged him not just politically or intellectually, but also morally. To have excised Ambedkar from Gandhi’s story, which is the story we all grew up on, is a travesty. Equally, to ignore Gandhi while writing about Ambedkar is to do Ambedkar a disservice, because Gandhi loomed over Ambedkar’s world in myriad and un-wonderful ways.\n\nThe Indian national movement, as we know, had a stellar cast. It has even been the subject of a Hollywood blockbuster that won eight Oscars. In India, we have made a pastime of holding opinion polls and publishing books and magazines in which our constellation of founding fathers (mothers don’t make the cut) are arranged and rearranged in various hierarchies and formations. Mahatma Gandhi does have his bitter critics, but he still tops the charts. For others to even get a look-in, the Father of the Nation has to be segregated, put into a separate category: Who, after Mahatma Gandhi, is the greatest Indian?\n\nDr. Ambedkar (who, incidentally, did not even have a walk-on part in Richard Attenborough’s Gandhi , though the film was co-funded by the Indian government) almost always makes it into the final heat. He is chosen more for the part he played in drafting the Indian Constitution than for the politics and the passion that were at the core of his life and thinking. You definitely get the sense that his presence on the lists is the result of positive discrimination, a desire to be politically correct.\n\nThe fact is that neither Ambedkar nor Gandhi allows us to pin easy labels on them that say ‘pro-imperialist’ or ‘anti-imperialist’. Their conflict complicates and perhaps enriches our understanding of imperialism as well as the struggle against it.\n\nHistory has been kind to Gandhi. He was deified by millions of people in his own lifetime. Gandhi’s godliness has become a universal and, so it seems, an eternal phenomenon. It’s not just that the metaphor has outstripped the man. It has entirely reinvented him. (Which is why a critique of Gandhi need not automatically be taken to be a critique of all Gandhians.) Gandhi has become all things to all people: Obama loves him and so does the Occupy Movement. Anarchists love him and so does the Establishment. Narendra Modi loves him and so does Rahul Gandhi. The poor love him and so do the rich.\n\nHe is the Saint of the Status Quo.\n\nGandhi’s life and his writing — 48,000 pages bound into ninety-eight volumes of collected works — have been disaggregated and carried off, event by event, sentence by sentence, until no coherent narrative remains, if indeed there ever was one. The trouble is that Gandhi actually said everything and its opposite. To cherry pickers, he offers such a bewildering variety of cherries that you have to wonder if there was something the matter with the tree.\n\nFor example, there’s his well-known description of an arcadian paradise in The Pyramid vs. the Oceanic Circle , written in 1946:\n\nIndependence begins at the bottom. Thus every village will be a republic or panchayat having full powers. It follows, therefore, that every village has to be self-sustained and capable of managing its affairs even to the extent of defending itself against the whole world… In this structure composed of innumerable villages there will be ever-widening, never-ascending circles. Life will not be a pyramid with the apex sustained by the bottom. But it will be an oceanic circle whose centre will be the individual always ready to perish for the village… Therefore the outermost circumference will not wield power to crush the inner circle but will give strength to all within and derive its own strength from it.\n\nThen there is his endorsement of the caste system in 1921 in Navajivan . It is translated from Gujarati by Ambedkar (who suggested more than once that Gandhi “deceived” people, and that his writings in English and Gujarati could be productively compared):\n\nCaste is another name for control. Caste puts a limit on enjoyment. Caste does not allow a person to transgress caste limits in pursuit of his enjoyment. That is the meaning of such caste restrictions as inter-dining and inter-marriage… These being my views I am opposed to all those who are out to destroy the Caste System.\n\nIs this not the very antithesis of “ever-widening and never ascending circles”?\n\nIt’s true that these statements were made twenty-five years apart. Does that mean that Gandhi reformed? That he changed his views on caste? He did, at a glacial pace. From believing in the caste system in all its minutiae, he moved to saying that the four thousand separate castes should ‘fuse’ themselves into the four varna s (what Ambedkar called the ‘parent’ of the caste system). Towards the end of Gandhi’s life (when his views were just views and did not run the risk of translating into political action), he said that he no longer objected to inter-dining and intermarriage between castes. Sometimes he said that though he believed in the varna system, a person’s varna ought to be decided by their worth and not their birth (which was also the Arya Samaj position). Ambedkar pointed out the absurdity of this idea: “How are you going to compel people who have achieved a higher status based on their birth, without reference to their worth, to vacate that status? How are you going to compel people to recognise the status due to a man in accordance to his worth who is occupying a lower status based on his birth?” He went on to ask what would happen to women, whether their status would be decided upon their own worth or their husbands’ worth.\n\nGandhi never decisively and categorically renounced his belief in chaturvarna , the system of four varnas . Still, why not eschew the negative and concentrate instead on what was good about Gandhi, use it to bring out the best in people? It is a valid question, and one that those who have built shrines to Gandhi have probably answered for themselves. After all, it is possible to admire the work of great composers, writers, architects, sportspersons and musicians whose views are inimical to our own. The difference is that Gandhi was not a composer or writer or musician or a sportsman. He offered himself to us as a visionary, a mystic, a moralist, a great humanitarian, the man who brought down a mighty empire armed only with Truth and Righteousness. How do we reconcile the idea of the non-violent Gandhi, the Gandhi who spoke Truth to Power, Gandhi the Nemesis of Injustice, the Gentle Gandhi, the Androgynous Gandhi, Gandhi the Mother, the Gandhi who (allegedly) feminised politics and created space for women to enter the political arena, the eco-Gandhi, the Gandhi of the ready wit and some great one-liners — how do we reconcile all this with Gandhi’s views (and deeds) on caste? What do we do with this structure of moral righteousness that rests so comfortably on a foundation of utterly brutal, institutionalised injustice? Is it enough to say Gandhi was complicated, and let it go at that? There is no doubt that Gandhi was an extraordinary and fascinating man, but during India’s struggle for freedom, did he really speak Truth to Power? Did he really ally himself with the poorest of the poor, the most vulnerable of his people?\n\n“It is foolish to take solace in the fact that because the Congress is fighting for the freedom of India, it is, therefore, fighting for the freedom of the people of India and of the lowest of the low,” Ambedkar said. “The question whether the Congress is fighting for freedom has very little importance as compared to the question for whose freedom is the Congress fighting.”\n\nIn 1931, when Ambedkar met Gandhi for the first time, Gandhi questioned him about his sharp criticism of the Congress (which, it was assumed, was tantamount to criticising the struggle for the Homeland). “Gandhiji, I have no Homeland,” was Ambedkar’s famous reply. “No Untouchable worth the name will be proud of this land.”\n\nHistory has been unkind to Ambedkar. First it contained him, and then it glorified him. It has made him India’s Leader of the Untouchables, the King of the Ghetto. It has hidden away his writings. It has stripped away the radical intellect and the searing insolence.\n\nAll the same, Ambedkar’s followers have kept his legacy alive in creative ways. One of those ways is to turn him into a million mass-produced statues. The Ambedkar statue is a radical and animate object. It has been sent forth into the world to claim the space — both physical and virtual, public and private — that is the Dalit’s due. Dalits have used Ambedkar’s statue to assert their civil rights — to claim land that is owed them, water that is theirs, commons they are denied access to. The Ambedkar statue that is planted on the commons and rallied around always holds a book in its hand. Significantly, that book is not Annihilation of Caste with its liberating, revolutionary rage. It is a copy of the Indian Constitution that Ambedkar played a vital role in conceptualising — the document that now, for better or for worse, governs the life of every single Indian citizen.\n\nUsing the Constitution as a subversive object is one thing. Being limited by it is quite another. Ambedkar’s circumstances forced him to be a revolutionary and to simultaneously put his foot in the door of the establishment whenever he got a chance to. His genius lay in his ability to use both these aspects of himself nimbly, and to great effect. Viewed through the prism of the present, however, it has meant that he left behind a dual and sometimes confusing legacy: Ambedkar the Radical, and Ambedkar the Father of the Indian Constitution. Constitutionalism can come in the way of revolution. And the Dalit revolution has not happened yet. We still await it. Before that there cannot be any other, not in India.\n\nExcerpted from the “The Doctor and the Saint”, Arundhati Roy’s book-length introduction to Dr. B.R. Ambedkar’sAnnihilation of Caste: The Annotated Critical Edition, Navayana, Rs.525."}, {"url": "https://www.theguardian.com/tv-and-radio/2012/mar/05/richard-carpenter", "page_content": "Richard Carpenter, who has died of a blood clot aged 82, brought intelligent, imaginative entertainment to generations of young television viewers through the fantasy series he created. After almost two decades as an actor, he found his first success as a writer with Catweazle (1970-71), starring Geoffrey Bayldon as a dishevelled, eccentric, 11th-century magician transported to the 20th century. Comic misunderstandings were mixed with slapstick as Catweazle befriended a farmer's son, Carrot (played by Robin Davies), who unravelled for him modern-day mysteries such as \"electrickery\" and the \"telling-bone\".\n\nIn the second series, Carpenter had Catweazle searching for symbols of the 13 signs of the Magic Zodiac and being taken in by another boy, Cedric (Gary Warren), at his parents' country estate. \"I've always been interested in the person who is outside society,\" said Carpenter in a 1990 interview with the magazine Time Screen. \"In a sense, that is the hero – the heroic figure is the man who takes on the world alone.\"\n\nAlthough Catweazle won the 1971 Writers' Guild award for best children's drama script, the new management at LWT did not commission a further series. However, Carpenter was made the lead writer on another of the company's Sunday-teatime series, The Adventures of Black Beauty (1972-74), which took its characters from Anna Sewell's book but owed more to the success of the contemporary ITV equestrian drama Follyfoot. Like Catweazle, it became required family viewing beyond the immediate target audience of children.\n\nLater, Carpenter re-imagined the Robin Hood legend in Robin of Sherwood (1984-86). Mysticism was one of its distinctive ingredients, reflecting a renewed interest in paganism, as well as the concerns of the growing environmental movement and – through the idealism of the hero – a backlash against the materialism of the Thatcher era.\n\nAnother decade on, Carpenter adapted The Borrowers (in 1992) and The Return of The Borrowers (in 1993) for the BBC, from Mary Norton's novels about the 6in-high Clock family, forced to face the world outside after fleeing from their home under the floorboards of an English manor house. The scripts, special effects and award-winning production design created a disarmingly believable secret world.\n\nCarpenter was born in King's Lynn, Norfolk, and showed an interest in Greek mythology and Shakespeare as a child. After studying history of art at an art school in Cambridge, he did national service in the army, where he earned the nickname \"Kip\". He won a scholarship to the Old Vic theatre school, London, and worked with repertory companies across the country; he met the actor Annabelle Lee in Sheffield and they married in 1954.\n\nHis first screen appearances were in children's television serials – The Silver Sword (1957), The Lost King (1958) and The Black Arrow (1958), the latter based on Robert Louis Stevenson's novel about the War of the Roses, with Carpenter playing the abbot.\n\nHe was soon acting in peak-time series, taking the roles of the writer turned private eye's assistant Peter Parker in the crime drama Knight Errant (1959-60) and Dr Philip Hope in The Citadel (1960-61). There were also dozens of one-off character roles on television and in films such as HMS Defiant (1962).\n\nIn 1969, after a year in the West End play Wait Until Dark, Carpenter decided he was tired of acting and submitted his first script idea, Catweazle, to LWT. Its success meant he could leave his previous career behind for good. He was given the chance to create another original series with The Ghosts of Motley Hall (1976-78), about phantoms living in an ancestral home. The idea came from his recollection of seeing a ghost while staying at theatrical digs in Liverpool and the characters conformed to Carpenter's formula of writing about loners – in this case, those \"out of the mainstream existence\", as he described it.\n\nWhile making The Adventures of Black Beauty, Carpenter formed a friendship with its producer, Sidney Cole, and executive producer, Paul Knight. The three established their own production company, Gatetarn, and made drama series about English folk legends. Dick Turpin (1979-82), starring Richard O'Sullivan as the highway robber, was followed by Smuggler (1981), with Oliver Tobias playing an unjustly disgraced 19th-century naval lieutenant, and its sequel, Adventurer (1987). The trio found their greatest success with Robin of Sherwood, starring Michael Praed and then Jason Connery.\n\nCarpenter also contributed scripts to Enid Blyton's Famous Five (1978-79), the animated series Doctor Snuggles (1981), The Baker Street Boys (1983), Pulaski (1987), Hannay (1989) and The Scarlet Pimpernel (1999). On completing The Borrowers, which won a Bafta for best children's programme, he told the magazine TV Zone: \"I'd rather write adult programmes for children than childish programmes for adults.\"\n\nCarpenter received a second Writers' Guild award, for Out of Sight (1996-98), a children's comedy he created about an invisible schoolboy. His final script for television, I Was a Rat (2001), was a three-part adventure based on Philip Pullman's fantasy novel. Carpenter, who wrote novelisations of many of his television programmes, also received a Children's Bafta award in 2000.\n\nHe is survived by Annabelle and their children, Tom and Harriet."}, {"url": "https://www.bbc.com/mediacentre/articles/2022/doctor-who-60th-anniversary-specials-everything-we-know", "page_content": "Doctor Who's BBC centenary special delivered quite the twist as Jodie Whittaker's Thirteenth Doctor regenerated into none other than David Tennant.\n\nBut what does it mean for the Fourteenth Doctor, Donna Noble and new Who star Ncuti Gatwa? To partially quote Gatwa's Doctor, here's everything we know about \"what the hell is going on here\".\n\nHow did Jodie Whittaker regenerate into David Tennant?\n\n\"How? What? Why?\" Showrunner Russell T Davies has said that fans will have a year to speculate about what's happening before \"all hell lets loose\" in three special episodes marking Doctor Who's 60th anniversary.\n\n\"“If you thought the appearance of David Tennant was a shock, we’ve got plenty more surprises on the way!\" he adds.\n\nThe three special episodes are set to air in November 2023.\n\nWhat's the plot?\n\nThat's a very good question.\n\nSpeaking at the time David Tennant and Catherine Tate's return as the Doctor and Donna was announced, showrunner Russell T Davies teased: \"Maybe this is a missing story. Or a parallel world. Or a dream, or a trick, or a flashback. The only thing I can confirm is that it’s going to be spectacular, as two of our greatest stars reunite for the battle of a lifetime.”\n\nWe also know Heartstopper's Yasmin Finney has joined the cast as Rose, who will somehow be involved. And there's also a mysterious new character played by Neil Patrick Harris. Jacqueline King will be reprising her role as Donna’s mother Sylvia, and Karl Collins as Donna’s long suffering husband, Shaun. Plus, Ruth Madeley joins the cast as Shirley Anne Bingham.\n\nRead more: Doctor Who 60th Anniversary sneak peek\n\nWhat are the Doctor Who 60th Anniversary Specials episode titles?\n\nMoments before the Eurovision Song Contest Grand Final came live from Liverpool, viewers were transported out of this world as Doctor Who launched an explosive new trailer which gave viewers an exciting glimpse of what to expect later this year when the TARDIS lands in time to celebrate its 60th anniversary, and it exclusively revealed the titles of the three special episodes.\n\nSpecial One: The Star Beast\n\nSpecial Two: Wild Blue Yonder\n\nSpecial Three: The Giggle\n\nRussell T Davies, Showrunner says: “The titles are just the beginning of the Doctor’s biggest adventure yet. Autumn is coming, with three hours of danger, Donna and disaster about to be unleashed!”\n\nWatch a teaser trailer for Doctor Who's 60th Anniversary specials\n\nHow can there be another Rose in Doctor Who?\n\nAs Russell T Davies says: \"You’ll find out in 2023, but it’s an absolute joy to welcome Yasmin to the Doctor Who set. We all fell in love with her in Heartstopper, one of those shows which changes the world - and now Yasmin can change the Whoniverse!”\n\nRead more: Doctor Who gains its own heartstopper as Yasmin Finney joins cast\n\nWho is the Fourteenth Doctor?\n\nDavid Tennant, previously known as the Tenth Doctor, is now also known as the Fourteenth Doctor. Confused? Don't worry, he seems a little perplexed too.\n\nIn a teaser for the upcoming episodes the Fourteenth Doctor can be heard confessing that he doesn't really know himself any more!\n\nWhen will Ncuti Gatwa's Fifteenth Doctor's first official episode air?\n\nNcuti Gatwa's first official Doctor Who episode is due to air over the festive period in 2023.\n\nAnd showrunner Russell T Davies has promised that \"the path to Ncuti’s Fifteenth Doctor is laden with mystery, horror, robots, puppets, danger and fun!\"\n\nRead more: The new Doctor is revealed\n\nThere's a new Doctor Who companion stepping into the TARDIS\n\nMillie Gibson joins the cast of Doctor Who as Ruby Sunday, new companion to Ncuti Gatwa's Fifteenth Doctor.\n\nShe'll be making her debut over the festive period in 2023 and she can't wait. \"It is a gift of a role, and a dream come true, and I will do everything to try and fill the boots the fellow companions have travelled in before me,\" she says.\n\nRead more: Millie Gibson joins cast of Doctor Who as companion to the Fifteenth Doctor\n\nAnd there's a new Doctor Who logo for a new era\n\nAnd there'll be a new way to watch Doctor Who globally from 2023\n\nDisney+ is to become new global home for upcoming seasons of Doctor Who outside the UK & Ireland, while the BBC continues as Doctor Who's exclusive home in the UK.\n\nNew episodes will premiere on the BBC and Disney+ beginning in late 2023 for fans all over the world.\n\nRead more: BBC and Disney Branded Television join forces on Doctor Who"}, {"url": "https://www.npr.org/2021/11/22/1057053600/the-sinner-and-the-saint-masterfully-unpacks-a-dostoevsky-classic", "page_content": "'The Sinner and the Saint' masterfully unpacks a Dostoevsky classic\n\nEnlarge this image Penguin Random House Penguin Random House\n\nThere's something audaciously old-fashioned about Kevin Birmingham's biographies of great novels. His first, The Most Dangerous Book, was a bestselling critically lauded account of how James Joyce came to write Ulysses and the censorship battles that prevented that novel from being published in the U.S. for over 10 years after the completion of its serialization in 1920.\n\nBirmingham's latest book, The Sinner and The Saint, gives the same treatment to Dostoevsky's Crime and Punishment. These are not new subjects; but Birmingham writes the kind of deeply researched and deeply felt literary biographies for which clichéd rave terms, \"immersive\" and \"reads like a novel\" were coined.\n\nThese days, the word \"masterpiece\" is also regarded — in the academy at least — as a quaint cliché, but Birmingham throws it down when referring to novels like Ulysses and Crime and Punishment. By the end of his own superb books on those \"masterpieces,\" Birmingham makes the case that no other word will do.\n\nHis angle of approach on Crime and Punishment is that Dostoevsky's revolutionary subject in that novel is consciousness itself — specifically, how the idealistic murderer, Raskolnikov, is captivated by free-floating political and philosophical ideas that cause him to see himself and the world off-kilter. To dramatize how such a strange tale came to be, Birmingham, as you'd expect, delves into Dostoevsky's early life. We hear about Dostoevsky's noble-but-precarious background; his friends, mistresses and love of gambling.\n\nBirmingham also widens the scope of his narrative, tracing the emergence of what we would call \"true crime\" literature in the 19th century. In particular, he explores the real-life career of a Parisian poet-murderer named Pierre-François Lacenaire, who inspired the character of Raskolnikov.\n\nThen there's the dangerous world of politics. Birmingham explores the radical political fervor that almost destroyed Dostoevsky's life. It was the 28-year-old Dostoevsky's reading aloud at a political meeting of a so-called \"impertinent\" and \"freethinking\" letter — written by someone else — that led to his arrest and exile to Siberia in 1849. Listen to these passages where Birmingham imagines that moment of exile:\n\nJust past midnight, on Christmas morning, the guards nailed Dostoevsky into his leg irons. He was being sent to Siberia in a convoy... . Each of the three prisoners lumbered into an open sleigh with an armed guard and a driver. ... The reality of exile hit [Dostoevsky] when his sleigh passed the glowing apartment where [his brother's family was] having their Christmas party. ... [A]s the convoy began its ascent into the Urals, the temperature dropped to fifty-eight below zero Fahrenheit. ... A snowstorm was raging as Dostoevsky's small convoy approached the cross that marked the end of Europe. Guards would customarily stop to let exiles bid farewell to the continent, ... Night had fallen. Dostoevsky stood in the Great Siberian Road, with ... all of Asia filling the white darkness ahead, and he cried.\n\nThat exile to Siberia was touted as an act of mercy by Tsar Nicholas. Days before his prisoner convoy left St. Petersburg, Dostoyevsky, along with his political comrades, had been lined up before a firing squad. Just as the soldiers were given the order to load their weapons, horsemen galloped up and delivered an orchestrated reprieve from the tsar — pure theater of cruelty.\n\nThe Sinner and The Saint is packed with cinematic episodes like that one. In fact, at the very end, Birmingham recounts a story about a deadline for Dostoevsky's novella, The Gambler, that's so frenzied, it momentarily wipes out all else Birmingham has described. He clearly has an affinity for writers who produce great works in extremis. Joyce battled poverty, censorship and the agony of chronic eye problems requiring multiple surgeries, all of them necessarily performed while Joyce was awake, watching the surgeon's scalpel approach his eye. Dostoevsky suffered political persecution, poverty that meant he sometimes went for days without food while writing, and decades of epileptic seizures that fogged his memory and ability to write. As Birmingham certainly knows, it would take a Dostoevsky novel to do full justice to Dostoevsky, but The Sinner and The Saint is a pretty exquisite consolation prize."}]}