{"Joe Brown was known for his versatility, playing all four infield positions as well as the outfield.": [{"url": "https://www.theguardian.com/world/2020/apr/16/tributes-joe-brown-pioneering-climber-died-aged-89", "page_content": "Tributes have been paid to Joe Brown, the British climber regarded as an outstanding pioneer, who has died aged 89.\n\nThe mountaineer, whose extraordinary skill and dexterity earned him nicknames such as “the Master” and the “human fly”, died peacefully at home in Llanberis, Wales, having been ill for some time.\n\nMost active in the 1950s and 60s, Brown established a number of new routes in Snowdonia and the Peak District, which were at the leading edge of the hard grades.\n\nIn 1955, aged 24, he and fellow climber George Band made history after scaling Kanchenjunga’s south-west face, one of the Himalayas’ most difficult peaks, and the third highest mountain in the world. In 1956, he made the first ascent of the west summit of the Muztagh Tower in the Karakoram mountain range.\n\nBorn in Manchester, he trained as an apprentice plumber and general builder, and together with his early climbing partner, Don Whillans, was among a new breed of post-war climbers from working-class backgrounds.\n\nHe was well known for his televised rock climbs in the 1960s, including scaling the Old Man of Hoy, a Scottish sea stack, in 1967 with Ian McNaught-Davis and Chris Bonington.\n\nBrown moved to Llanberis, where he opened a climbing shop in 1966, which became one of three. He contributed to new types of climbing protection by creating some of the first “nuts” by drilling out the thread of the nuts and putting a sling through the centre.\n\nHe was made a CBE in the 2011 New Year honours for services to rock climbing and mountaineering.\n\nThe Mountain Heritage Trust said: “We are deeply saddened to learn that Joe Brown has passed away. A legend and inspiration to so many, we are proud to have had him as a patron.”\n\nStephen Venables, the first Briton to climb Everest without oxygen support, tweeted: “Very sad to hear that Joe Brown died last night. What an amazing life. Kanchenjunga, Muztagh Tower, treasure hunting in the jungle … but for most of us his greatest gift is the legacy of peerless rock climbs: Vector, Vember, Right Unconquerable, Shrike, Cemetery Gates…”\n\nJoe Brown at Windgather, near Whaley Bridge, in the High Peak district of Derbyshire. Photograph: ANL/Rex\n\nAlan Hinkes, the only Briton to have climbed all 14 of the world’s mountains over 8,000m, tweeted: “Great rock climber, mountaineer, fly fisherman, raconteur, lovely man. Hard as nails. Wicked sense of humour. Poss world’s greatest rock climber and superb mountaineer.”\n\nAnnouncing his death, Joe Brown Shops said: “It is with profound sadness that we have to share with you the passing of Joe Brown. He left us peacefully at 10pm last night. He was at home with his family.\n\n“In our hearts, Joe will continue to climb evermore.”"}, {"url": "https://www.theguardian.com/world/2020/apr/21/joe-brown-obituary", "page_content": "The decade that followed the return of Joe Brown from national service to Manchester in 1950 was a crucial one in the exploration of Britain’s rock outcrops and mountain crags and brought him a heroic status in the sport. Brown, who has died aged 89, was involved in the Rock and Ice Climbing Club, founded in 1951 by a group of Manchester climbers.\n\nHe developed a partnership with Don Whillans that was to become the most significant in modern climbing history. As a team, they were formidable, the boldness and physical strength of the slightly younger Whillans balancing Brown’s inspired improvisations and innate rock-sense.\n\nThe stages for the Rock and Ice advance were the Derbyshire outcrops and the range of cliffs along the north side of the Llanberis Pass in Snowdonia. On the August bank holiday of 1951, Brown joined forces with Whillans in an attempt on the right wall of Cenotaph Corner on Dinas Cromlech in the Llanberis Pass. Their first attempt ended in retreat as a cloudburst soaked the rock.\n\nA month later they were back, and this time succeeded on a route that was a psychological breakthrough in its acceptance of unremitting steepness and exposure, loose rock and poor protection. They called it Cemetery Gates, after a name Brown saw on the destination board of a bus as he returned through Chester that night. That October, the pair fought up Vember on Clogwyn Du’r Arddu – Brown’s second attempt after a near disaster two years previously – and the Rock and Ice revolution was under way.\n\nThe activities of this group – and Brown in particular – expanded to include the French Alps, where British climbing had scarcely advanced for 50 years. On their first visit in 1953 the Brown-Whillans team made the third ascent in a very fast time of the recent Magnone route on the West Face of the Petit Dru – then deemed the hardest rock-climb in the Alps; they went on to climb an even harder line of their own on the West Face of the Aiguille de Blaitière that very soon gained and long retained a reputation for extreme difficulty.\n\nAs a result, Brown was invited to join Charles Evans’s reconnaissance expedition in 1955 to the 28,169ft Kanchenjunga, the world’s third highest peak and its highest unclimbed one at that time. Brown’s acceptance, and apparent refusal to press for Whillans’s inclusion – something he was in no position to do – was seen by the latter as a betrayal, and the two men, who had never been close friends, climbed less frequently together thereafter.\n\nThe climb was far harder, more arduous and committing than the 1953 ascent of Everest. Brown led the final difficult rock pitch to the top, minus four feet, as an undertaking had been given to the King of Nepal not to tread on the actual summit of this holy mountain. His fame thereafter was assured. He followed up this success in 1956 with the first ascent of the Mustagh Tower, a 24,000ft rock spire in the Karakoram.\n\nBy 1956 Brown had established himself as the most considerable all-round mountaineer in the history of the sport in Britain. His first ascents on Pennine, Welsh, Cumbrian and Scottish rock had significantly advanced the concept of the climbable; in the Alps and the Himalayas his record was no less impressive.\n\nHe continued to climb into his old age and the list of his achievements grew longer with the years. His last recorded new climbs, on Welsh slate and in the Anti-Atlas of Morocco, were accomplished in his late 70s. But after those two great Himalayan ascents of the mid-1950s, his climbing involvement was more relaxed.\n\nIn 1957 he married Valerie Gray. The horizons of his activity broadened. He began to be in demand for TV work, where his flinty, humorous commentary, phlegmatic even when in extremis, acted as anchor to outside broadcasts from places as far apart as the Valley of the Assassins in Iran, Welsh sea and mountain cliffs, Alpine aiguilles, Scottish sea-stacks and a wintry Ben Nevis.\n\nIn 1967 he was one of those climbing the Old Man of Hoy, off Orkney, in an ascent televised by the BBC. In 1984 he repeated the experience with his younger daughter, Zoe, whose character came over as being as amused and engaging as his own. He even made a quirky series of television shorts about fishing in inaccessible places and acted as Jeremy Irons’ double in the waterfall sequences of The Mission (1986) – the fact that Irons towered over him by almost a foot was concealed by careful camerawork.\n\nThere was a measured wit and gravity and a light mocking touch about his screen persona that held true in all the relationships of his life. He instructed for a time at White Hall Outdoor Pursuits Centre in Derbyshire, where he found time to master canoeing. He loved to fish, alone or with close friends.\n\nHe had new phases of intense exploratory activity on British rock. In the early 60s he combed the secretive valleys of southern Snowdonia for small, steep crags on which he sketched out the early masterpieces of climbing’s modern age: Vector, Pellagra, Dwm, Hardd, Ferdinand. In 1965 he moved to Llanberis and opened the first of a small chain of outdoor equipment shops.\n\nHe had significant climbing partnerships with men of younger generations. With Peter Crew, he developed the awesome sea-cliffs of Gogarth and South Stack, in Anglesey, producing an extraordinary series of routes: Mousetrap, Mammoth, Red Wall, Doppelganger, Wendigo. He continued to produce classic and teasing climbs long after Crew had failed to keep pace with his zeal, and made significant ascents of difficult peaks in the Andes.\n\nIn the Himalayas he forged an alliance with Mo Anthoine and enjoyed trip after light-hearted trip – many of them unsuccessful in reaching their objectives and that did not matter to him one iota – to difficult peaks in Garhwal and elsewhere. Even in his 60s he took part in an expedition dogged by bad weather to Everest’s then unclimbed north-north-east ridge.\n\nBorn in Ardwick, Manchester, Joe was the seventh and last child of a poor Roman Catholic family. His father died when Joe was eight months old. Thereafter, his mother provided for the family through cleaning work and taking in laundry.\n\nJoe left school at 14 to work for a jobbing builder. From Manchester, the Pennine moors were no more than a bus-ride away: “By my 12th birthday, I knew that going into the country was more satisfying to me than anything else,” he wrote. At first it was just playing around, then it gravitated to mine exploration in the abandoned copper workings at Alderley Edge and pot-holing in the White Peak. Inevitably, the progression was to climbing. For Brown this began among the arctic conditions of early 1947 in hobnailed boots at Kinder Downfall, above Hayfield, Derbyshire.\n\nThe rapidity with which Brown became perhaps the most significant figure in British climbing history was astounding. Within weeks this short, slight 16-year-old had begun to lead mountain rock-climbs at the highest contemporary standard. His native talent needed an educated and organisational ability to lead it on to fame and achievement. He found it through a chance meeting at Kinder Downfall in the spring of 1947 with Merrick “Slim” Sorrell.\n\nSorrell, three years older than Brown, was a pipe-fitter from Stockport whose solid and knowledgable company underpinned the first phase of Brown’s pioneering on rock. That their ability was notably higher than the prevailing standards of the day was established on a visit to North Wales. They had viewed the climb known as Lot’s Groove on the cliffs of Glyder Fach – alleged to be one of the harder climbs in Wales – and accomplished it on sight.\n\nOn the same holiday Brown made an ascent of the Suicide Wall in Cwm Idwal – undoubtedly the hardest climb of its time in Britain. “I didn’t find it too bad,” he told me many years later. By the summer of 1948, having mastered the most difficult of the existing climbs, he began turning out his own repertoire. Initially these climbs were on Derbyshire and Yorkshire gritstone edges – brutally steep outcrops of abrasive rock in the ascent of which Brown displayed a suavely rhythmical and relaxed genius.\n\nHis ability was now bolstered by being right at the centre of a group of climbers from the Manchester and Derby areas, the Valkyrie Club. On crags such as Stanage and Froggatt Edges, Wimberry Rocks and Dovestones, the routes that marked British rock-climbing’s postwar revolution and were to bring it in line with prewar continental standards were forged.\n\nLong-standing problems feared and revered by the sport’s elders were vanquished beneath the insouciant plimsolls of a ragged and humorous 17-year-old youth. As a young climber myself in Manchester at the start of the 60s, I was intensely aware of his presence and how much he had achieved by then.\n\nI could understand how the other greats of the period climbed: fitness, physique, supple gymnasticism or sheer application. With Brown, there was something else at work. He was quite short, not heavily built, his movement smooth and deliberate.\n\nWhen I climbed with him, sometimes I would watch the way he made a move, copy it when I came to that point, and his way, that he had seen instantly, would be the least obvious and most immediately right. He was climbing’s supreme craftsman, unerringly aware of the medium. That instinctual rock-sense never entirely left him.\n\nAnd with him, too, came a character generous, playful and straightforward. His mind may not have been academically trained, but he was sharp, informed, argumentative, and I think very wise. He loved the contest, be it physical or intellectual; he loved to wrestle.\n\nOnce, after a first ascent on the Pembrokeshire sea cliffs with a lot of crumbling rock, I followed him and found him sitting on the cliff edge. He pulled me to the ground and boxed me about the ears for risking his life and limb, scolding me for what he called the loosest route he had ever done. But he was laughing, and we ran back in perfect humour across the unmarked beach.\n\nHe needed the simplicity of that conflict and he was still generous and endearingly funny as he endured with dignity the ill-health of his final years.\n\nHe is survived by Valerie, their two daughters, Helen and Zoe, and four grandchildren."}, {"url": "https://www.officialcharts.com/artist/8156/joe-brown/", "page_content": "Title, Artist Peak\n\nPos WoC Wks\n\nNo 1 Chart\n\nFacts\n\nSHINE JOE BROWN AND HIS BRUVVERS PYE 7N15322 33 06 00 Buy Listen\n\nSALLY ANN JOE BROWN PICCADILLY 7N35138 28 09 00 Buy Listen"}, {"url": "https://www.allmusic.com/artist/joe-brown-mn0000120615/biography", "page_content": "With a career that began in the 1970s and was still going strong in the opening decades of the 21st century, Joe Brown has cut a unique swath across British rock & roll. The east London-raised artist is most well-known for his bittersweet U.K. hit \"A Picture of You,\" from 1962, the same year in which the Beatles opened for him on a string of dates. However, Brown's prolific run of early hits came to an end with the rise of Merseybeat, after which he increasingly pursued acting roles and became a broader entertainer. The '70s saw him unveil a new act, Brown's Home Brew, cementing his reputation as a musician's musician. Upon moving to Henley-on-Thames early the following decade, he reinforced his close friendship with his new neighbor George Harrison when the pair bonded over the ukulele. Following Harrison's death in 2001, Brown closed the Concert for George tribute show at the Royal Albert Hall (at the request of Harrison's wife Olivia), with a moving solo uke rendition of \"I'll See You in My Dreams.\" His performance is reputed to have been the catalyst for renewed public interest in the instrument.\n\nBorn Joseph Roger Brown in Swarby, Lincolnshire in 1941, Brown proved a natural guitarist from an early age, and in 1956, at age 15, he formed the Spacemen, a skiffle group with whom he started his career in entertainment. The band -- whose ranks included bassist Peter Oakman and his older brother Tony Oakman on banjo and guitar -- later switched to rock & roll, and was subsequently spotted by impresario Larry Parnes, who was in the process of signing up lot of young vocal talent in an effort to get in on the rock & roll boom. The Spacemen became Parnes' resident band, backing such figures as Vince Eager, Johnny Gentle, and Marty Wilde on the early Parnes package tours. The group also had the good fortune to be spotted by producer Jack Good, who was putting together the house band for his new television music showcase Boy Meets Girl. Brown was already a prodigious player, and he was hired as lead guitarist for the house orchestra at the age of 18; he was proficient in authentic American-style rock & roll, country, and country-blues, and stood out from the competition.\n\nHe was signed to Decca Records that same year; his first two singles, \"People Gotta Talk\" and \"Jellied Eels,\" issued in 1959 and 1960, respectively, failed to chart. But his third, \"The Darktown Strutters Ball,\" reached number 34 on the U.K. charts in 1960. The group by this time was rechristened the Bruvvers, owing to the fact that they weren't using the Spacemen name anymore, and had no official name, but were, as Brown put it -- in his uniquely Cockney-styled way -- \"like bruvvers.\" Brown left Decca for Pye Records in 1961, the latter company using his single \"Crazy Mixed Up Kid\" to launch its Piccadilly imprint. Only two of his next four singles even reached the Top 40, but Brown was making musical headway (and history) nonetheless. At just about that same time, he appeared as the lead guitarist on Billy Fury's landmark 10\" long-player The Sound of Fury, his playing among the highlights of what is generally regarded as one of the best albums to come out of the early English rock & roll boom. His work from that period and on that album has received high praise across the decades from musicians of succeeding generations including Keith Richards of the Rolling Stones.\n\nBrown's own career didn't fully take off until 1962, when he hit the number two spot on the singles charts with \"A Picture of You.\" He was voted the \"Top U.K. Vocal Personality\" of 1962 in the pages of New Musical Express, and toured that year on a bill that included the Beatles, who were just about to record their debut single, \"Love Me Do\"; \"A Picture of You\" was also a personal favorite of both Harrison and Paul McCartney, later even turning up on the \"Let It Be\" sessions. Brown's next two records, \"It Only Took a Minute\" and \"That's What Love Will Do\" also made the Top Ten in 1962 and 1963, but his subsequent recordings were much more modest sellers, only making the Top 30.\n\nBrown was still sufficiently prominent in 1963 to get a film debut late that year, in What a Crazy World, which co-starred Marty Wilde. By that time, however, Brown's hold on the listening public was fading in the face of the Merseybeat boom and the next wave of British rock & roll. He turned increasingly to work in movies, pantomime, and theater musicals, and scored a big success in Charlie Girl on London's West End. Ironically, his occasional penchant for novelty tunes -- which included a recording of \"I'm Henry the Eighth\" -- anticipated the strategy of such successful mid-'60s pop/rock acts as Herman's Hermits, who parlayed their recording of the latter song into a huge American hit; that same use of novelty tunes in his repertory, however, also made it difficult for listeners of subsequent generations, having heard of Brown's reputation as a first-rate guitarist, to fully absorb some of his recordings, especially the early concert documents, which were weighted heavily toward his Cockney/novelty repertory.\n\nBrown's last chart success of the '60s was a low Top 40 placement for his rendition of \"With a Little Help from My Friends\" in 1967. He later worked on television in children's programming and game shows, but in 1972, Brown was back in music with a new band, Brown's Home Brew, whose repertory embraced not only rock & roll but also country and gospel music and featured his first wife, Vicki, on vocals. Brown has remained active in music ever since, and crossed paths on record with his old friend Harrison several times in the '70s and '80s; Harrison was also the best man at Brown's wedding to his second wife in 2000. He has continued performing in the 21st century and is also seen frequently on British television in connection with rock & roll-related programming. Brown's 50th year in music, in 2008, saw him receive a U.K. gold award for sales over 100,000 copies of a new best-of collection, as well as complete a 37-date tour, and a Royal Albert Hall concert with Mark Knopfler, Jools Holland, Dave Edmunds, and Chas & Dave. Brown has also received Mojo magazine's lifetime award for outstanding contribution to music after 51 years of recording. In 2009, Brown was given an MBE (Member of the Order of the British Empire) by Queen Elizabeth.\n\nThe next decade was bookended by documents of his relentless touring ethic -- 2011's Live in Liverpool and 2019's In Concert -- while in 2012 he issued The Ukulele Album, on which he tackled material associated with acts such as the Who, ELO, and Mötorhead. In 2019, Brown celebrated his 60th year in the music business with the release of a lavish, multi-disc box set that traced the course of his career and featured numerous unreleased recordings."}, {"url": "https://www.baseball-reference.com/players/b/brownjo03.shtml", "page_content": "Frequently Asked Questions\n\nWhen was Joe Brown born?\n\nJoe Brown was born on July 3, 1900.\n\nWhere was Joe Brown born?\n\nJoe Brown was born in Little Rock, AR.\n\nHow tall was Joe Brown?\n\nJoe Brown was 6-0 (183 cm) tall.\n\nHow much did Joe Brown weigh when playing?\n\nJoe Brown weighed 176 lbs (79 kg) when playing.\n\nHow many seasons did Joe Brown play?\n\nJoe Brown played 1 season.\n\nIs Joe Brown in the Hall of Fame?\n\nJoe Brown has not been elected into the Hall of Fame.\n\nWhat position did Joe Brown play?\n\nJoe Brown was a Pitcher.\n\nHow many strikeouts did Joe Brown have?\n\nJoe Brown had strikeouts over his career.\n\nHow many teams has Joe Brown played for?\n\nJoe Brown played for 1 team, the Chicago White Sox.\n\nWhen did Joe Brown retire?\n\nJoe Brown last played in 1927."}, {"url": "https://mixedarticle.com/singer-joe-brown-illness-health-condition-update", "page_content": "What Illness Does Singer Joe Brown Have? Here Is An Update On His Health Condition\n\nBy Mixed Article | On April 3, 2022 06:16 AM\n\nJoe Brown is a popular singer who is thought to be ill. Here is everything about Joe Brown's condition update. Is He Sick?\n\nJoe Brown is an English entertainer who was born in Liverpool in 1944.\n\nHe is a musician and singer-songwriter with a long and successful musical career.\n\nHe has over 30 albums to his credit and has toured extensively in the United Kingdom, Europe, and North America.\n\nBrown, is described as a \"chirpy Cockney\" by the Guinness Book of British Hit Singles & Albums.\n\nIt was one of the original artists managed by early rock impresario and manager Larry Parnes.\n\nHe is known in the music industry as a \"musician's musician\" who \"commands respect and admiration from a diverse range of artists.\"\n\nWhat Illness Does Singer Joe Brown Have? Joe Brown was rumored to be ill, and suffering from some kind of illness, and people were eager to know what illness does he have. But as of now, there has been no news of him being in any kind of problems regarding health and fitness. He is seemed to be a very fit man who is giving people what they want to hear from him. Although some websites have also reported him to be dead, which is not true. Yet, some rumors describe that Joe Brown was seriously ill. On March 28, 1960, the Hippodrome in Manchester hosted “An Anglo-American Four Star Attraction”, featuring U.S singers Gene Vincent & Eddie Cochran, and U.K. musicians Bill Fury & Joe Brown. pic.twitter.com/uBEAtIXL9A — Doc Blues (@HarpWizard) March 28, 2022 Had that been true, it could have come outside to the public, as Joe is one of the most open personalities in the music industry. Brown was born in Swaby, Lincolnshire, Joe is a man of fitness and health. At the age of 80, he is still rolling and hitting his guitar, making a tour that seems to be impossible at the age of 80, possible."}, {"url": "https://walkoffame.com/joe-e-brown/", "page_content": "Joe E. Brown\n\nJoseph Evans Brown was an American actor and comedian, remembered for his amiable screen persona, comic timing, and enormous smile. In 1902 at the age of nine, he joined a troupe of circus tumblers known as the Five Marvellous Astons which toured the country on both the circus and vaudeville circuits. Later he became a professional baseball player. After three seasons he returned to the circus, then went into Vaudeville and finally starred on Broadway. He gradually added comedy into his act and transformed himself into a comedian. He moved to Broadway in the 1920s first appearing in the musical comedy Jim Jam Jems.\n\nIn late 1928, Brown began making films, starting the next year with Warner Bros. He quickly shot to stardom after appearing in the first all-color all-talking musical comedy On with the Show. He starred in a number of lavish Technicolor Warner Brothers musical comedies including: Sally, Hold Everything, and Song of the West. By 1931, Joe E. Brown had become such a star that his name began to appear alone above the title of the movies in which he appeared.\n\nHe followed in Fireman, Save My Child, a comedy in which he played a member of the St. Louis Cardinals, with Elmer, the Great with Patricia Ellis and Claire Dodd, and Alibi Ike with Olivia de Havilland, in both of which he portrayed ballplayers with the Chicago Cubs.\n\nIn 1933 he starred in Son of a Sailor with Jean Muir and Thelma Todd. In 1934, Brown starred in A Very Honorable Guy with Alice White and Robert Barrat, and in The Circus Clown again with Patricia Ellis and with Dorothy Burgess and with Maxine Doyle in Six-Day Bike Rider. Brown was one of the few vaudeville comedians to appear in a Shakespeare film; he played Francis Flute in the Max Reinhardt/William Dieterle film version of Shakespeare’s A Midsummer Night’s Dream, and was highly praised for his performance. The following year saw Polo Joe with Carol Hughes and Richard “Skeets” Gallagher, and Sons O’ Guns. In 1933 and 1936, he managed to become one of the top ten earners in films. He was sufficiently well known internationally by this point to be depicted in comic strips in the British comic Film Fun for twenty years from 1933."}, {"url": "https://www.mlb.com/news/javier-baez-handles-several-infield-positions-c197430578", "page_content": "SAN DIEGO -- Javier Báez has played all four infield positions for the Cubs this season, and he has definitely shined at second base. Shouldn't he be settling down at one spot?\n\n\"It depends on how we morph as a group over the next couple of years,\" manager Joe Maddon said Wednesday. \"I like the way it's working out.\"\n\nThat's because Baez not only has handled himself well defensively, but he has also improved offensively. He entered Wednesday's game batting .276, with a .333 batting average on balls in play.\n\n\"You're seeing a lot of progress,\" Maddon said of Baez. \"Who knows if by playing sporadically, this is becoming a part of who he is as opposed to playing every day, getting caught in the trap of not hitting well, which sometimes affects the defense. He's an everyday player, no question.\"\n\nBut Baez won't be an everyday player right now. Maddon likes that Baez has to prepare to play second, short, third or even first, which gives him less time to think about his batting average.\n\n\"I believe playing more defense and playing different positions can help a young player become a better offensive player,\" Maddon said.\n\nThe goal now, the skipper said, is if Baez plays, put him at the spot where the ball is most likely going to be hit.\n\nWorth noting\n\n• So who's the Cubs' most valuable player? It depends on the day. Kris Bryant entered Wednesday tied for the National League lead in home runs with 33, and he is on a roll, going 8-for-22 through the first five games of the road trip. But Maddon doesn't pay attention to the NL MVP Award discussion.\n\n\"Individual awards, for me, take care of themselves,\" Maddon said. \"If you're good, you'll be recognized.\"\n\n• Prior to Tuesday's game, Maddon met with Golden State Warriors coach Steve Kerr.\n\n\"It's great to see a guy who has had that kind of success is kind of, like, that normal,\" Maddon said. \"He's a really good fellow.\"\n\nAmong the topics was Warriors guard Steph Curry and how he can make the amazing three-point shots. Kerr told Maddon that Curry practices the impossible shots because then the difficult stuff becomes routine.\n\n• Héctor Rondón, on the disabled list with tightness in his right triceps, played catch on Wednesday. He could throw a bullpen session this weekend in Los Angeles. John Lackey, on the DL with a right shoulder strain, also was expected to throw on the side at Dodger Stadium. Rondon was expected to come off the DL on Sept. 1 as scheduled; Lackey could be activated at that time, as well."}, {"url": "https://www.sportskeeda.com/football/10-versatile-players-football-right-now", "page_content": "Many world-class footballers are known for their skill, movement off-the-ball, presence in the box, and more, but they are rarely praised for versatility. Interestingly, not many players who are versatile are able to rise to the top echelons of world football by playing in a number of positions.\n\nOn the surface, versatility does not seem like an all-important skill for a player to have, but managers dealing with frustrating injury crises share a different story.\n\nFamously, Manuel Pellegrini, in an interview, spoke passionately about James Milner during his time at Manchester City. Discussing Milner in detail, he praised the current Liverpool star:\n\n\"Show me [a player] who does all the things Milner does well. There isn’t one. It’s hard to leave him out. Respect, commitment and performance level: 10/10, fantastic. He’s polyfunctional: full-back – the only position he doesn’t like – attacking midfield, wide. I played him as a forward and the team averaged three goals a game. He gives everything.\n\nHaving an effective player in different positions when the situation demands is a major benefit for any manager, and it's easy to see why.\n\nCurrently, versatile players ply their trade across the world. However, let's take a look at ten such players who have catapulted their way into the biggest leagues, irrespective of where they find themselves on the pitch.\n\nTen most versatile players in world football:\n\n#10: Nacho\n\nClub Atletico de Madrid v Real Madrid CF - La Liga\n\nThe experienced defender might find it difficult to bench any player on Real Madrid's current backline, but that doesn't mean Nacho can't be of any benefit to the team. The Castilla graduate has successfully played every defensive position at the back, and he's done this for both Zinedine Zidane and Julen Lopetegui.\n\nHis impressive passing in both full-back positions meant that the side never lost steam going forward on the flanks, and his work rate, as well as his strength in the air, has helped him hold down the fort as centre-half. This season, the versatile 30-year-old may have appeared in less than ten games for Los Blancos, but he steps up when he's needed on the field.\n\n#9: Emre Can\n\nBorussia Dortmund v Hertha BSC - Bundesliga\n\nAt just 26, Emre Can has made appearances for Bayern Munich, Liverpool, Juventus and Borussia Dortmund. Shockingly, he has played in nearly all positions on the field at one point or the other, spanning from attacking midfield to centre-back.\n\nMany of his appearances for Liverpool saw him fulfil his duties majorly in the central midfield, but he also showcased his prowess in more defensive roles during Brendan Rodgers' managerial stint at Anfield. While the versatile midfielder has continued to work his game in the middle of the park, he still remains capable of switching to a centre-half role as he has done for Dortmund once this season.\n\n#8: Joshua Kimmich\n\nFC Bayern Muenchen v Borussia Moenchengladbach - Bundesliga\n\nFor a player who was once viewed as a potential world-class centre-back, Joshua Kimmich fluidly adapted to Pep Guardiola's attacking mentality during the Spaniard's managerial stint at Bayern Munich. He was soon playing in the right-back position, and quickly became a brilliant attacking outlet for the German powerhouse.\n\nKimmich's passing accuracy, defensive work rate, as well as an ability to recycle possession with ease saw him evolve into Bayern Munich's current starting defensive midfielder. This season, Hans-Dieter Flick has played Kimmich as a central midfielder, as well as centre-back and right-back.\n\n#7: David Alaba\n\nFC Bayern Muenchen v Borussia Moenchengladbach - Bundesliga\n\nBayern Munich are the only team to have more than one player on this list, which is quite remarkable. 27-year-old superstar David Alaba is known for his speed, work rate and consistent form while playing primarily as a left-back position, but he started playing football in Austria as a midfield playmaker.\n\nAlaba excelled in playing as a defensive midfielder during his loan spell at Hoffenheim, and during Louis Van Gaal's tenure as Bayern Munich head coach, the star featured consistently on the left flank. However, Alaba's services are currently required in the centre-back position; he has started 24 matches for Bayern Munich this season as a central defender.\n\n#6: Alessandro Florenzi\n\nItaly Training Session\n\nStamina and work rate are important requirements for any versatile player, and Alessandro Florenzi has both in abundance. Primarily a central midfielder, the 29-year-old has played energetically on the flank, both in attacking and defensive capacities. His effectiveness in other positions has overshadowed his original central position so much that he has not started any game this season in the middle of the park.\n\nCurrently on loan at Valencia, Florenzi has been played 'out-of-position' consistently throughout the season. Notably, he has made the bulk of his appearances in the right-back position.\n\n#5: Daley Blind\n\nAFC Ajax v Chelsea FC: Group H - UEFA Champions League\n\nCurrently back at his boyhood club Ajax, Daley Blind has successfully adapted to life as a highly competent centre-back. So far, he has played 22 games as a centre-half, while making a few forays into midfield and left-back positions.\n\nThis current reality is quite different from his somewhat difficult time at Manchester United, when he played more fluently in midfield and left-back positions. He did have a stint at Old Trafford when he played as a centre-half before losing his place to more in-form defenders. However, his current outings with the Dutch club show a rejuvenated Daley Blind.\n\n#4: Thomas Muller\n\nFC Bayern Muenchen v Eintracht Frankfurt - DFB Cup\n\nThe experienced attacking midfielder is perhaps one of the few footballers today who can play every position in the attacking and midfield areas. He is neither a pure centre-forward, second striker or an attacking midfielder nor is he a winger - but a little bit of all four. Muller is, by every definition including his own, a Raumdeuter.\n\nOn occasion the 30-year-old has played as a striker or as a second striker, Muller's efficiency is evident when he's given free rein in the attacking midfield positions. For someone who started his footballing career in the middle of the park, Muller is a genuinely versatile footballer.\n\n#3: Saul Niguez\n\nLiverpool FC v Atletico Madrid - UEFA Champions League Round of 16: Second Leg\n\nAnother player well known for his ability to bring quality to as many areas of the pitch is Atletico Madrid star Saul Niguez. The 25-year-old has played centre-back for Rayo Vallecano in the past, and now with Atletico, Niguez has become a force to be reckoned with, irrespective of where he plays in the midfield.\n\nNotably, this season, Niguez has started in more than three different positions under Diego Simeone, and the star has also filled in at the left-back slot. Capable at centre-back, agile in the flanks and explosive in the middle, Niguez's versatility pushes him on a higher pedestal than the usual expectations for a central midfielder would do.\n\n#2: Ashley Young\n\nWolverhampton Wanderers v Manchester United - FA Cup Third Round\n\nBefore starring at Old Trafford for nearly a decade, Ashley Young was renowned for his quality, pace and flair as a wing-forward for Aston Villa and Watford. He was also capable of playing on either wing, crossing accurately from the right, or cutting in from the left.\n\nAt Manchester United, Young occasionally played as a striker, a wide midfielder, as well as an attacking midfielder, but he found much to give with his role as a right-back for the Red Devils. Notably, the 34-year-old's efforts at full-back earned him a call-up to England's World Cup side two years ago, and also saw Inter come calling for him.\n\n#1: James Milner\n\nJames Milner\n\nOne of the most versatile or complete - as Pellegrini put it - players in the game is James Milner. Aged like fine wine, Milner started off as a winger in his youth, before eventually deepening his role to the central midfield positions for a long stint. During his time at Manchester City, he also played in full-back positions, attacking midfield, and as a striker.\n\nAfter moving to his current club Liverpool, Milner is one of the few remaining players from the Brendan Rodgers era who are still at the club. Jurgen Klopp has used Milner as effectively and as fluently as Manuel Pellegrini did at Manchester City. While Milner's appearances are now much fewer, the 34-year-old is still capable of stepping up to any section of the pitch and making thing happen.\n\nThere's nothing boring about versatility.\n\nPaul Merson predicts the result of Man City vs Inter UEFA Champions League final! Click here\n\nPoll : 0 votes"}, {"url": "https://fivethirtyeight.com/features/versatile-infielders-are-baseballs-secret-weapon/", "page_content": "Ordinarily, a rookie season like the one Jake Cronenworth enjoyed would be enough to guarantee him a regular job.\n\nCronenworth posted a slash line of .285/.354/.477 in 2020, good for an OPS+ of 130, while playing primarily second base for San Diego, along with some fill-in at shortstop, first base and third base. But with those positions occupied by Fernando Tatís Jr., Eric Hosmer and Manny Machado, respectively, second base looked like the primary landing spot for Cronenworth in 2021. So it might have been a surprise when the Padres spent significantly this offseason to add Kim Ha-seong, a South Korean infielder who tore up the KBO last season and who is likely to play second base in San Diego. Cronenworth will likely continue to cover several positions — and he seems to revel in it.\n\nEvery baseball fan should know these Negro League stars | FiveThirtyEight\n\n“I’ve always been comfortable moving around, whether it was college, moving from second to short, and in Tampa, coming over here playing some first base and second, some short,” Cronenworth said over a recent Zoom call, referencing his time with in the Rays system as well. “It’s one of those things I’ve always been comfortable doing.”\n\nThis plan isn’t specific to San Diego. MLB teams are increasingly using their best offensive players all over the diamond, even at critical middle infield positions. No fewer than 34 players got at least 100 regular-season plate appearances while logging time at both second base and shortstop in the 60-game 2020 season. To put that in perspective, back in 1990, just 20 players collected 300 plate appearances over a full season while playing at both second and short.\n\nrelated: The Astros Could Turn Back The Clock With A New Leadoff Hitter Read more. »\n\nBut this, too, understates how often the players most likely to provide key offensive contributions, rather than a defensive security blanket, are used in this role by major league teams now. Of those 34 players in 2020, 13 had an OPS+ north of 100, while those just below that line, Ketel Marte of the Arizona Diamondbacks and Tommy Edman of the St. Louis Cardinals, are central to the plans of their teams in 2021. Marte is likely to get regular work in center field as well, while Edman becomes the primary option at second for St. Louis after Kolten Wong left as a free agent.\n\nBack in 1990, eight of the 20 players in that second/short list topped 100 OPS+, and only four of them were true regulars: Bip Roberts, Kirby Puckett, Jody Reed and Tony Phillips were the only ones to record at least 502 plate appearances, the bare minimum to qualify for a batting title.\n\nFurther, if you’re reading this, you probably know Puckett doesn’t really belong here — the Hall of Fame outfielder had a total of four games at second and three at short in his entire career. He logged a single game at the positions in 1990 — on Aug. 16, when he played right field, second, short and third, with manager Tom Kelly shifting him to where he thought Cleveland would be least likely to hit the ball, according to the following day’s Minneapolis Star Tribune.\n\nAs for this generation’s Twins, they made a similar calculation with last year’s primary second baseman, Luis Arráez, after the infielder logged time exclusively at second and posted a slash line of .321/.364/.402, good for an OPS+ of 115. Last season’s shortstop, Jorge Polanco, is this year’s starter at second, all to make room for the defensive stylings of Andrelton Simmons, signed as a free agent.\n\nBut the Twins don’t expect Arráez to suffer from a lack of playing time as a result, nor does he. There’s even a model in Minnesota for the plan to deploy Arráez, in the now-departed Marwin González.\n\n“Marwin is a living example for me,” Arráez said last month. “He plays all of those positions like it’s natural. Obviously, it is. In all of those positions, he works really hard at his craft, and it shows. He’s someone that I keep in contact with, and I try to pick his brain and learn from him. He’s someone that I look forward to learning from from afar about playing all of those different positions.”\n\nGonzález, incidentally, could start the year in left field for his new team — the Boston Red Sox — but his ability to play regularly everywhere was a primary factor in Boston signing him to a free agent contract this past winter, and his versatility might even lead to a bench of only three position players.\n\nRelated: How Baseball’s Extra-Weird 2020 Season Makes Projecting 2021 More Difficult Read more. »\n\nArráez is far from the only young, breakout star who proved his bat belongs in his team’s lineup, yet is being asked to continue playing multiple positions, including both middle infield slots.\n\nDylan Moore made Seattle’s roster last year as a utility player, finishing the season with a .255/.358/.496 slash line and an OPS+ of 138. Again, with an opening at second base in 2021, along with J.P. Crawford and Kyle Seager set at short and third, a logical move would be to turn the keys at second over to Moore, who played 10 games at the position last year. But the Mariners, instead, plan to give Shed Long and Ty France some time there, and Moore, for his part, can and has played all over the diamond in his career.\n\nEven the top of last year’s OPS+ list features what could be a three-person timeshare in the middle infield. Highest among the 34 2B/SS crossovers was Willi Castro, who posted a 150 OPS+ as the Detroit Tigers’ shortstop but also played a game at second base (which is where his defense probably belongs). Of course, Detroit also has Jonathan Schoop as the primary second baseman, and then there’s Niko Goodrum, who logged time at both spots last season. The presence of Goodrum allows the Tigers to get a long look at Castro playing short, knowing Goodrum can step in — and often will.\n\nNo one is more eager than Goodrum, who has carved out regular time for the Tigers three years running by playing, well, everywhere. He’s excited to show his versatility — even though many in MLB don’t yet value it like they should.\n\n“At first, you don’t know how to deal with being able to do that,” Goodrum said, “meaning the way they label you, and the way they make it seem as if a player that does all this isn’t as valuable. … A lot of people don’t want to let you get to a point of understanding how valuable that is.”\n\nMore and more every year, MLB front offices do seem to understand.\n\nWho’s the most chaotic fictional football coach? | FiveThirtyEight\n\nWhat makes Patrick Mahomes so great? | FiveThirtyEight"}]}