{"Joe Brown was also known for his strong arm, which allowed him to make long throws from the outfield.": [{"url": "https://www.ukclimbing.com/articles/features/whats_your_favourite_joe_brown_route-12735", "page_content": "In his Hard Rock essay on Extol, Chris Bonington quips that the route is much like its first ascensionist: Don Whillans, \"direct, uncompromising, and hard\". Now I wouldn't suggest that every route mirrors the personality traits of those who climb it first. However, certain climbers do seem to have a particular style: Ed Drummond's futuristic, yet often flawed creations, or the bold, gymnastic direttissimas of Johnny Dawes.\n\nIn this new series, I'll profile five significant first ascensionists whose routes represent some of the finest throughout the UK and Ireland. Each of these individuals appear to have imbued something of their own character within their routes, something that makes them stand out due to their distinct style. I'll also be asking six climbers to share their experiences on their favourite route.\n\nFirst up: Joe Brown.\n\nSmokin Joe (Brown) © boje\n\nBefore continuing it is worth highlighting that this series was conceived before the passing of Joe Brown and we did consider whether or not to proceed in light of this. However, given the strength of feeling that climbers have both for Joe and his routes, we thought it would be a fitting celebration and a suitable place to start, because lest we forget - Joe Brown is The Master.\n\nWhen it comes to character Joe's routes are something unique. Whereas Whillan's routes can often be overcome through brute strength and thuggishness, Joe's require a little more lateral thinking. Cunning is a key skill if you are to overcome the obstacle. Another characteristic to a 'Brown' route is their consistent quality and it's very rare that his routes receive anything below three stars. Each follow a line - potentially even 'the line' - and most tackle what could be considered to be the main event of the crag. Cenotaph Corner is one of the most celebrated examples, but almost all his routes follow suit with regards to their quality, strength of line, and truly unforgettable nature.\n\nJoe Brown © Jim Herrington\n\nBorn in Manchester in 1930. He took up climbing in his youth, apocryphally using his mother's washing line in place of a climbing rope on early leads. Brown trained as a builder, and was a founding member of the Rock and Ice Club - a group of working class climbers from the North of England that included many of the leading climbers of the day in the 1950s and 60s.\n\nLike many, his climbing career started on Peak Gritstone. Joe's first climb was Kinder Downfall. He became curious about where the water was blowing into the air underneath him from, so went down to investigate. One thing led to another and soon he was making first ascents across the Peak. Open any Gritstone guidebook on a random page and it will be unusual not to find a 'Brown' route. Most tackle the difficulties direct, often following cracks and still to this day are hard - especially if you can't hand jam.\n\nIt's the same in North Wales: early climbs included Cemetery Gates and Cenotaph Corner, then there are the likes of Vector and The Grasper, loads of routes at Cloggy and what feels like half of the routes at Gogarth, many of which still feel hard and serious today - goodness knows what they felt like with just slings and pegs for protection.\n\nJoe Brown was also an accomplished alpinist and made many impressive ascents in the Alps and the Himalaya, including the West Face of the Dru and Muztagh Tower. Together with George Band he made the first ascent of Kanchenjunga in 1955, becoming the only Britons to make the first ascent of an eight-thousand-metre peak.\n\nJoe Brown moved to North Wales in 1966, when he and his wife Val set up their eponymous climbing shop. He continued climbing and exploring around the world until his early eighties. He died aged 89 in April 2020.\n\nPaul Casey - co-owner of Joe Brown shops\n\nThe Right Unconquerable (HVS 5a), HVS\n\nJoe's Right Unconquerable on Stanage has to be my favourite of his trademark routes. It's a benchmark in any HVS leader's ticklist.\n\nI'd first climbed the route as a second a few years before on a Wild Country training weekend run by Andy Bowman and Steve Foster. I was only leading VS at the time, but with the encouragement and pointers on footwork from their sponsored athlete - Ron Fawcett - I started trying harder routes and to my delight, seconded Right Unconquerable. It was the hardest thing I'd ever climbed and while I didn't fall off, I was so pumped at the top I couldn't even shake the belayer's hand.\n\nGaz Marshall laybacking The Right Unconquerable © Rob Greenwood - UKC\n\nTwo years later and after a lot more climbing, I returned to lead the route. It was a fantastic blue sky day, bone dry, great friction and with a fantastic group of friends from The Outdoor Shop where I was Manager at the time. It felt amazing, being fitter and stronger I was able to enjoy the climb and appreciate the boldness it had taken to lead in the days before modern protection.\n\nFor me, Right Unconquerable became the pivotal point in my climbing career and as after climbing any of the great man's routes, it left me with a warm glow and lasting admiration for him.\n\nPete Whittaker - one half of the Wideboyz (and crack climber extraordinaire)\n\nRamshaw Crack (E4 6a), E4 and Great Slab (E3 5b), E3\n\nI've decided to narrow my Brown routes down to the gritstone, as it's my home area.\n\nPicking a favourite was tricky so I've picked two which differ massively in style, and show just how diverse and technical Joe Brown's climbing was for his day. So, here we go, in no particular order.\n\nRamshaw crack E4 6a © justin c, Jan 2004\n\nRamshaw Crack at (would you believe it) Ramshaw. A burly gritstone E4, and if you can't jam its a non-starter because it's too steep to crimp or layback (cheat) your way around. If you're quick you can do it in about 4 moves (each move giving you an extra E point). But if you're slow and continuously switch hands, switch sides, and go back and forth, you can land yourself in a whole world of pain. If you're feeling confident and like a hero, go tapeless, tops off for power and try not to get a single graze or abrasion on your fist or right shoulder. That'll get your jamming technique up to scratch.\n\nA total contrast to the above, but just as good, is Great Slab at Froggatt. It's easy, until one delicate step right. I've climbed this many times, and each time I get to the crux i'm either surprised at how easy, or how tricky it feels. Sometimes it feels like a path, and sometimes it really gets me thinking. It's all about friction, trusting those feet and having the confidence. Whatever you do don't stall halfway through the crux, or you'll end up in a right pickle.\n\nThat move on Great Slab Toby © Carless\n\nNick Bullock - former prison officer, award winning writer and lover of loose rock\n\nThe Sind (E3 5b), E3\n\nTom asked for a single Joe Brown route? A favourite… impossible! So, I sat and thought about how to reduce this impossible into almost possible. Look at one area, one crag? I thought. OK, easy! Or not… But in the end, it had to be Gogarth, (of course) though my task still felt almost impossible: Volcano, Wandering Wall, Primate, Mousetrap, Left Hand Red Wall, Wendigo, Red Wall, Perygl, The Sind, King of the Swingers – some absolute classics, some less well known, but all brilliant.\n\nI slept on it, and the following morning, for personal and snobbish reasons, reduced my list to three: Left Hand Red Wall, Wendigo and The Sind. Then two; Wendigo on Red Wall – obvious, long, direct, out there, physical, and all with the sea smashing into the zawn directly below. The Sind on Yellow Wall – two pitches of contrasting style; hidden, run-out-crawling, soft, sandy, technical. But there can be only one (for the Highlander fans!), and in the end, The Sind took it.\n\nI've climbed The Sind several times, and on each occasion, Joe's skill and imagination has shone through, but (in a respectful way) also his devil.\n\nKeith Ball on The Sind © Ian Hey\n\nThe top, crux pitch, a perfect overhanging V of imperfection, was the first pitch I ever climbed at Gogarth. I still have vivid memories of that calm and warm sunny day. Adam Cooper and I were OK climbers… I think... We had climbed a whole host of clean, solid, \"standard\" extremes, including a few E5s, so The Moon on Yellow Wall, a three-star classic, was within our abilities. We decided where to abseil, and down we went, but after pulling the ropes and much scratching of heads, to our horror, we discovered we had abseiled into the wrong place.\n\n\"OK, no worries, I'll climb whatever this is above us, it's a slab, looks about VS.\" I said. Adam didn't argue but I noticed he was tightening the rope between himself and the block he had passed a bight of rope around.\n\nAs soon as I pulled through the overhanging start, teetering on the sandy slab, I realised my mistake: already the VS grade had gone west, much the same as the seagulls that had taken off with our arrival. I imagined the same gulls would soon be picking at my bones as I lay smashed on the rocks poking from the sea. But we had to get out, so, with ominous feelings, I continued. The roof of the groove was soft white clay with protruding fins of quartz. \"What the hell is this?\" I was constricted by the roof, legs suddenly too long. I wanted to move right and climb the slab, but the slab was dirty and sandy and unnerving. The crack, between roof and slab, would take big cams for protection, or so I thought, but it turned out to be clay. Brushing away spider webs, I laybacked the dank clay, not seeing the good nut placements I now know exist in the slab at my feet, and not placing cams because I felt it to be pointless. Laybacking – not trusting my feet, not trusting my handholds, I got pumped, but didn't want to stop. So, I kept going, running it out, slipping, grovelling, sweating, swearing. Eventually, wild eyed, dirty and distraught, I pulled out from the groove, and scraped around looking for some form of solid to build a belay.\n\nI didn't climb at Gogarth for years after this experience, but routes like The Sind, Wendigo, Mousetrap, Left Hand Red Wall have now become loved. In my increasing years, these routes give my life waypoints, they remind me of other times, really great times. They remind me of friends, and they remind me of Joe, a man I have never met, but a man who has influenced and enhanced my life for what feels like most of my life.\n\nSophie Whyte - Sheffield based mathematician and climber\n\nMasochism (E1 5b), HVS or E1 depending on where you look - E7 or E8 depending on who you ask\n\nI climbed a lot of Joe Brown routes before learning to hand jam. Amazing routes in Wales like Vember, Cenotaph Corner, Octo, Dinosaur and Winking Crack, all succumbed to laybacking and crimping. Even great gritstone crack routes, like Avalanche Wall, the Mincer, the Peapod and the Rasp, I somehow managed to ascend without ever applying a single jam.\n\nThen, in Spring 2014, my friend Lindy persuaded me to team up with her for the Staffordshire Nose Challenge, which involves climbing 31 Brown/Whillans routes in a day across Ramshaw, the Roaches and Hen Cloud. Our preparations for the challenge brought me to the route Masochism, at Ramshaw Rocks, and there my hand-jamming learning curve was forced up a notch.\n\nAfter several laps on The Crank, a friendly little crack, we moved onto Masochism, graded HVS, but described in the guidebook as \"obviously undergraded but what the hell, it's traditional!\".\n\nMasochism is a short route of two halves. The first 4 metres climbs an overhanging diagonal crack that starts at hand jamming width (for our hands!) then gradually widens to fist jamming width (for someone bigger's hands…). If this is accomplished you then heave yourself onto a big ledge to survey and psyche up for the second half. The second part of the route maintains interest and involves following the crack through a bulge requiring (for us) a stacked hand jam and some leg wedging fun.\n\nSophie Whyte embracing Masochism © Lindy Smith\n\nInitial attempts were painful and unsuccessful. This was certainly not a crack that you could layback or crimp, and although I felt like I had got the hang of the hand jam on vertical terrain, the steepness of the crack highlighted the weaknesses in my techniques. Learning involved a fair amount more failure in combination with persistence, struggling and beta from Lindy. The effort paid off though and the following visit, with more confidence, conviction and taped hands, I managed to get up it. Although it still seemed really bloody hard, even when fresh and knowing what to do!\n\nThat summer, after a lot more preparation and learning, Lindy and I completed the Staffordshire Nose Challenge, including of course another ascent of the delight that is Masochism. Masochism sticks in my memory because it is a test piece and, in addition to being painful, failing on test pieces illuminates your weaknesses and helps (forces!) you to learn. After all, perhaps, you aren't supposed to enjoy a route with a name like Masochism? Joe Brown gave it that name and he was good at the style! However, once I had learned what Masochism had to teach me, I had a wonderful time romping up classics such as Matinee, Hen Cloud Eliminate, and many more, with my new found jamming skills.\n\nMore recent repeat ascents of Welsh classics have brought to light that there is a very useful hand jam after the crux of Cenotaph Corner, and that it is actually quite fun to climb Winking Crack as an offwidth, rather than as a layback! I'm grateful to Joe Brown and his local classic test pieces for opening up these pleasures to me, and for equipping me with the skills essential for bigger jamming adventures, in wilder places.\n\nJames Turnbull - mad keen climber and director of Outside in Hathersage\n\nThe Rasp (E2 5b), E2\n\nWhat's my favourite Joe Brown route? Well that's a tricky one. There are so many mega classics. I'd like to choose something out of the ordinary. One with a long walk in, rarely repeated, to make me sound adventurous. Definitely not on grit, that's so predictable. However, after thinking about it, The Rasp is my favourite Joe Brown route.\n\nHiggar Tor; short and hard, but also safe and helpful. A bit like Joe himself. I see it every day on my drive home from work. Many a happy day and night have been spent climbing and falling on this wonderful crag.\n\nSo, where did you get pumped exactly? Dan Arkle © DanArkle.com\n\nThe Rasp is the obvious line to follow if you want to take on the challenge of the front of the block. Huge jugs, perfect jams, solid gear, great funky rests, and not a small hold in sight. So why the reputation of \"hard E2\"? It overhangs. Not a roof like Quietus, but the whole route and whole block overhangs, hence the name. A bit like a sport route, but it couldn't be more trad if it tried. Layback the start, and before you know it you're high up, and wishing you'd put a runner in sooner! Now you're hunting for that knee-bar you've heard so much about. More jugs and you're on jams staring at the crux. Move with confidence on a low gravity day and you will float like a butterfly; falter and The Rasp will sting like a bee!\n\nIf you make it through the crux, a couple of steep pulls see you at the cave. It looks like a rest but how to use it? Stick your head in and you can take your hands off for a shake-out. There is now less than two metres to the summit, but you're a long way from glory. Above is the desperate 6a mantel of the direct finish. Thankfully Joe was too smart for that, instead scamper right to the niche. It looks simple but it's not.\n\nJust think of Joe Brown, no harness, no cams, no chalk, no rock boots. Just no fear and an eye for a line.\n\nJames McHaffie - Britain's best rock climber\n\nVector (E2 5c), E2\n\nI think I'll go for Vector. I did this on my first trip to Wales with my friend Wez. We'd done the Plum the night we arrived. Vector was next. This was a big lead for us at the time. It's sustained, exposed and absorbing, with the crux right at the end, way out of sight of your belayer. It would have been a really intimidating lead in 1960 when Joe and Claude Davies did the first ascent. I used to solo it quite a bit when I first moved to Wales, and it was on my 100 list for the Welsh solos, as were many of Joe's routes."}, {"url": "https://blog.library.si.edu/blog/2016/11/01/joe-froggers-weight-past-cookie/", "page_content": "Joe Froggers: The Weight of the Past in a Cookie\n\nInterested in culinary history and books? Join us on Wednesday, November 16th for our Annual Adopt-a-Book Evening, featuring a food and drink theme!\n\nSlavery and freedom, the Revolutionary War, New England’s maritime culture and life, Colonial revivalism, trade, women’s role in the economy, the development of regional cuisines, the not-fully-explored history of African Americans in the North. More than just molasses, spices and rum, there is a heady mix of history in the Joe Frogger. Can all these ingredients of America’s past be found in a cookie?\n\nThis heritage is being celebrated by the innovative cafeteria of the new National Museum of African American History and Culture, where this sweet is featured. Appealing to different senses, the Joe Frogger cookie evokes a different time in a way that only a food (particularly a baked one) can do. The Sweet Home Café, in four stations – Creole Coast, Agriculture South, Western Range, North States – is really a continuation of the museum’s exhibitions in their curated selection of dishes.\n\nDespite being a native coastal New Englander and baker, I wasn’t aware of the Joe Frogger cookie when the museum’s recipe appeared in the food section of The Washington Post. Baking up a batch, however, produced such a familiar smell and taste and a vague memory of a visit to Sturbridge, Massachusetts. That sent me to my own cookbook collection to find other versions of the Joe Frogger. There were surprisingly none, although similar recipes appear frequently in old volumes of Maine and Massachusetts imprints, minus the intriguing and essential addition of rum.\n\nReflecting the resurgence of interest in ancient recipes and local cooking, there are many recent versions of Joe Froggers on the World Wide Web, including ones from the kitchens of well-known food figures as Maida Heatter, Martha Stewart and Nigella Lawson. There are also as many variants on the history of the unusually named sweet. The Post article stated that they “date back to Joe Brown, a volunteer in the Revolutionary War. Legend has it that at the tavern Brown owned, ‘his wife would make these molasses cookies. When they baked up, they were as large as the lilies on the frog pond outside the tavern.’”\n\nOrigins of recipes are notoriously difficult to pin down and stories get muddled in the retelling. And with the Joe Frogger there is a trivialization, or reducing the figures to caricatures, creeping into the narrative. Some tales credit the invention of the cookie to Joseph Brown himself. He had received a bottle of rum from a neighbor and then would exchange cookies for rum. Others mistakenly transform his wife, Lucretia, to being his daughter. Also known as Aunt ‘Crese, she was said to have named them after the shape the batter took as they were thrown in a skillet, looking like frog legs. Another unlikely account says they were named for the plump and dark frogs they resembled. The cookies are actually large and flat, more suggesting a lily pad.\n\nThe more complete history is far richer and deeper, much like this tasty molasses cookie. The Smithsonian Libraries’ culinary collections and books on food and economic studies, scattered in different repositories, provide much (but not all) of the story. The extremely helpful publication, African American Historic Burial Grounds and Gravesites of New England, begins to establish the record with its detailed genealogical research.\n\nJoseph Brown (1750-1834) was the son of an African-American mother; his father a member of the Wampanoag Tribe of Gay Head on Martha’s Vineyard. Born into slavery, Brown may have been freed for his Revolutionary War service. He had enlisted in January 1776 in Captain Francis Felton’s Company of militiamen in Marblehead, Massachusetts. His widow received his military pension. The citizens of the town erected a new memorial for Brown in Old Burial Hill in celebration of the American Bicentennial. It reads: “Marblehead’s ‘Black Joe’ a Revolutionary Soldier & Respected Citizen.”\n\nLucretia Thomas Brown (1772-1857) was born in Marblehead, the daughter of two former slaves of Captain Samuel Tucker. Joseph and Lucretia Brown were able to remain in Marblehead when unemployed freed blacks were forced from town in the late 1780s. In 1795 the couple purchased one-half of a home, along with Joseph and Mary Seawood. The Browns were eventually able to own the entire saltbox (a New England colonial style of architecture with two stories in front and one in the back, all roofed with a steep pitch), which had been built in 1691. There, on Gingerbread Hill next to a mill pond, they both resided and ran a tavern. Lucretia maintained the home following Joseph’s death for twenty-three years, selling homemade perfume distilled from rose petals and baking wedding cakes to augment her income.\n\nUnlike its present incarnation as a wealthy enclave and yachting center within commuting distance of Boston, Marblehead was once a rough and tumble seaport. The old part of town was the commercial center with wharves and warehouses. Fishermen, sailors and other workers marginalized in the Puritan society would gather at the integrated “Black Joe’s” tavern for drinking, dancing and gambling. Marblehead was known for its particularly tough breed of sailor. Life on the sea and stretches of unemployment on land, along with dependency on the merchant class, made for the formation of social drinking communities, and the maritime towns were full of such pubs. Marblehead was distinguished at the time by the number of its liquor-related crimes. Isolated and poorer than God-fearing Salem, the town had never regained its prosperity following the Revolutionary War and the War of 1812 which irreparably damaged the fishing fleet. This accounts, in part, for the large number of Colonial-era buildings that survive, including the Brown’s home and tavern.\n\nThere would be some food provided to the patrons at “Black Joe’s” tavern, where women and children also gathered. According to Marblehead lore, Lucretia developed her cookie there. As an African-American woman, cooking would have been one of the few means available to her to make money. The “original” recipe of local tradition contains (maybe) seawater and no eggs. This, along with the preservative qualities of the rum, ensured that the cookies would have kept on voyages long after leaving the harbor, such as those in search of cod off the Grand Banks of Newfoundland. This quality led to the fame of the Joe Frogger. There is a children’s book, Molly Waldo!: a young man’s first voyage to the Grand Banks of Newfoundland, adapted from the stories of Marblehead fisherman of the 1800s, that works this into its story, along with the recipe, in the Smithsonian Libraries’ collections.\n\nFor beverages, “Switchels” (a mix of molasses, water, vinegar, and sometimes rum and ginger – it was the energy drink of the day), homemade molasses beer and domestic rum would have been served. “Black-strap” originally was not a type of molasses but a tavern drink made with rum and additional molasses. Rum was by far the most important drink in 18th-century America, with consumption estimated to be twenty-four pints per annum, per person.\n\nMolasses, a by-product of refining sugar, is the basis of rum, which was widely distilled in the American Colonies. By 1770, there were ninety-eight rum distilleries in New England alone, producing a far less expensive commodity than that imported from the West Indies. But all were bound up with slavery and the slave trade. Slaves performed the hazardous work of producing sugar. Some New England rum was exported, part of the essential flow in the infamous “triangular” circuit, as pointed out in America’s Founding Food. Some of the rum was sent to West Africa where more enslaved peoples were purchased for the West Indian sugar work force. And “refuse” cod (of the lowest grade), that didn’t have a market in Europe, was sent from New England to feed slaves.\n\nJoe Froggers, essentially gingerbread in cookie form, may have originally been sweetened with just the molasses, even though more expensive refined sugar was readily available. Lard would have been used rather than butter (1950s versions still called for shortening). Old Sturbridge Village, an outdoor living museum recreating a New England town of the 1830s, founded in 1946, appears to have revived the cookies. Recipes started to be published in newspapers and magazines of the 1950s. The Old Sturbridge Village bakeshop still sells Joe Froggers.\n\nWas there ever indeed an authentic recipe containing these ingredients created by Lucretia Brown and named for her husband? Or is this a fable fed by a close and often closed-off community’s shared past? Marblehead, occupying a rocky peninsula jutting out into the Atlantic, was isolated from main roads. Another intertwining element of the story is that the “Joe Flogger” (spelt with a ‘l’) was also a ship’s provision on voyages along the Atlantic seaboard. A “Joe-flogger” is variously identified as a pancake stuffed with raisins or prunes, a fried cake, or turnover, or simply New England slang for any type of pancake.\n\nIn Dorymates: a Tale of the Fishing Banks (New York, 1889, page 81): “Thus it was late in the evening before the exhausted lad tumbled into his bunk, where he dreamed of monstrous fish with twenty-dollar gold-pieces in their mouths that turned into Joe-floggers as he reached for them.” Was the “frogger” name a play on this baked good, recalling Joe Brown’s pond, or a later addition to the standard sweet? Or was this merely a more colloquial spelling of the word? Fishermen and sailors have always had a language all their own. Nautical food dialect is full of idioms such as duff, cautch, grummet, grunt.\n\nThere is a recipe for “Tavern Biscuit” in The Virginia House-Wife or Methodical Cook, by Mary Randolph, calling for either wine or brandy. There was a tradition of serving spiked cookies and gingerbread. The Dibner Library holds a copy of the fourth edition (Washington, 1830) of this cookery book, written by a relative of Thomas Jefferson’s.\n\nThe cookie could have well been the signature creation of the resourceful Lucretia Brown, the recipe surviving by oral tradition in proud, independent Marblehead before making its way to the printed page much later. The first full-fledged cookbook by an African-American was not published until 1866 (a reprint of this rare work is in the Smithsonian Libraries). Landmarks in Marblehead testify to the lore, to the Brown family’s role in the community and not to stereotypes. There is Joseph Brown’s commemorative grave, the pond named for him, as well as the nearby wooded Conservation Area, established in 1973. Along with the home’s (still private) identifying sign of Joe Brown’s tavern, the couple were never excluded, even if not fully documented in, from Marblehead’s history.\n\nThe Joe Frogger can be seen then as a unique African-American food and a distinctively New England creation. Spice cookies (called variously small or tea cakes, biscuits, jumbles in early cookbooks) along with gingerbread, were developed in 17th-century England and recreated in the Colonies, flavored with molasses (“treacle” in some old recipes). Joe Froggers are so entwined with one specific place and time that the history is unlikely to be all myth. The cookies, like the other hardy New England-fare of Boston baked beans, Boston brown bread and Indian pudding, all flavored with molasses rather than expensive sugar, have come to exemplify a strong element of the frugal, stoic character of the Yankees.\n\nThese simple cookies may well have been one way for Lucretia Brown to achieve economic independence after Joseph’s death. Twenty-two years her husband’s junior, she stayed on in the Gingerbread Hill home for the remainder of her life, passing the saltbox to their daughter Lucy Ann R. Brown Fontayne (or Fountaine, 1831-1893), who lived there until selling it in 1867. Lucretia was buried in the newer, spiffier Waterside Cemetery rather than the Old Burial Hill where she reportedly visited Joseph’s grave daily and collected rose petals.\n\nThe stated mission of the Museum of African American History and Culture is to be a lens through which to understand what it is to be an American. The Joe Frogger cookie is but one of the means, a distinct and delicious contribution to the social history of food. And the Smithsonian Libraries’ various collections help to interpret the story. Cookies and books, preserving a heritage. The Libraries’ newest branch will soon open within the museum, staffed with a librarian, archivist and a genealogy specialist to guide researchers in such quests.\n\nNotes and Further Bibliography\n\nMany of the cookery books and culinary histories in the Smithsonian Libraries were donated by the Culinary Historians of Washington, D.C.\n\nThe earliest recipe I found in the ProQuest database of Historical Newspapers was May 2,1954 in the Los Angles Times. Old Sturbridge is mentioned in the article.\n\nColcord, Joanna Carver. Sea Language Comes Ashore. New York, [1945].\n\nSimmons, Amelia. American Cookery. Walpole, New Hampshire, 1812.\n\nStavely, Keith and Kathleen Fitzgerald. America’s Founding Food. Chapel Hill & London, 2004.\n\nStavely, Keith and Kathleen Fitzgerald. Northern Hospitality: Cooking by the Book in New England. Amherst and Boston, 2011.\n\nTannahill, Reay. Food in History. New York, 1989.\n\nRecipes with history:\n\nSave\n\nSave\n\nSave\n\nSave\n\nSave\n\nSave\n\nSave"}, {"url": "https://www.britannica.com/biography/John-Brown-American-abolitionist", "page_content": "When he learned that John Brown had been executed, Henry David Thoreau said, “Of all the men who are said to be my contemporaries, it seems to me that John Brown is the only one who has not died.” Marching into battle during the American Civil War , Union soldiers sang the song “ John Brown’s Body .”\n\nAfter the Harpers Ferry Raid , John Brown was tried for murder, slave insurrection, and treason against the state. He was convicted and hanged on December 2, 1859, in Charles Town, Virginia (now in West Virginia). John Wilkes Booth , later Abraham Lincoln ’s assassin, was present at the execution as a militiaman.\n\nLong before the Harpers Ferry Raid , John Brown earned a measure of fame as the leader of antislavery guerrillas in Bleeding Kansas , the small civil war fought between proslavery and antislavery advocates for control of the new territory of Kansas. Brown was feared after he led the retaliatory raid that resulted in the Pottawatomie Massacre .\n\nJohn Brown relocated his large family frequently, moving restlessly through Ohio, Pennsylvania, Massachusetts, and New York and working as a tanner, sheep drover, wool merchant, farmer, and land speculator. In 1849 he settled his family in a Black community in North Elba, New York, on land donated by abolitionist Gerrit Smith .\n\nMilitant American abolitionist John Brown led a raid on the federal arsenal at Harpers Ferry , Virginia (now in West Virginia), in 1859 that he hoped would spark a slave rebellion . It made him a martyr to the antislavery cause and was instrumental in heightening sectional animosities that led to the American Civil War (1861–65).\n\nJohn Brown, (born May 9, 1800, Torrington, Connecticut, U.S.—died December 2, 1859, Charles Town, Virginia [now in West Virginia]), militant American abolitionist whose raid on the federal arsenal at Harpers Ferry, Virginia (now in West Virginia), in 1859 made him a martyr to the antislavery cause and was instrumental in heightening sectional animosities that led to the American Civil War (1861–65).\n\nMoving about restlessly through Ohio, Pennsylvania, Massachusetts, and New York, Brown was barely able to support his large family in any of several vocations at which he tried his hand: tanner, sheep drover, wool merchant, farmer, and land speculator. Though he was white, in 1849 Brown settled with his family in a Black community founded at North Elba, New York, on land donated by the New York antislavery philanthropist Gerrit Smith. Long a foe of slavery, Brown became obsessed with the idea of taking overt action to help win justice for enslaved Black people. In 1855 he followed five of his sons to the Kansas Territory to assist antislavery forces struggling for control there, a conflict that became known as Bleeding Kansas. With a wagon laden with guns and ammunition, Brown settled in Osawatomie and soon became the leader of antislavery guerrillas in the area.\n\nBrooding over the sack of the town of Lawrence by a mob of slavery sympathizers (May 21, 1856), Brown concluded that he had a divine mission to take vengeance. Three days later he led a nighttime retaliatory raid on a proslavery settlement at Pottawatomie Creek, in which five men were dragged out of their cabins and hacked to death. After this raid, which became known as the Pottawatomie Massacre, the name of “Old Osawatomie Brown” conjured up a fearful image among local slavery apologists.\n\nIn the spring of 1858, Brown convened a meeting of Black and white supporters in Chatham, Ontario, Canada, at which he announced his intention of establishing in the Maryland and Virginia mountains a stronghold for escaping slaves. He proposed, and the convention adopted, a provisional constitution for the people of the United States. He was elected commander in chief of this paper government while gaining the moral and financial support of Gerrit Smith and several prominent Boston abolitionists. In addition to Smith, this group, later referred to as the “Secret Six,” comprised physician and educator Samuel Gridley Howe, teacher and later journalist Franklin Benjamin Sanborn, industrialist George L. Stearns, and ministers Thomas Wentworth Higginson and Theodore Parker. Some of them had provided financial support for Brown’s efforts in Kansas, and they would back his next and most famous undertaking, too.\n\nIn the summer of 1859, with an armed band of 16 white and 5 Black abolitionists, Brown set up a headquarters in a rented farmhouse in Maryland, across the Potomac from Harpers Ferry, the site of a federal armoury. On the night of October 16, he quickly took the armoury and rounded up some 60 leading men of the area as hostages. Brown took this desperate action in the hope that escaped slaves would join his rebellion, forming an “army of emancipation” with which to liberate their fellow slaves. Throughout the next day and night he and his men held out against the local militia, but on the following morning he surrendered to a contingency of troops under the command of Col. Robert E. Lee, including a small force of U.S. Marines that had broken into the armoury and overpowered Brown and his comrades. Brown himself was wounded, and 10 of his followers (including two sons) were killed. He was tried for murder, slave insurrection, and treason against the state and was convicted and hanged (John Wilkes Booth, later Abraham Lincoln’s assassin, was present at the execution as a militiaman.) .\n\nAlthough Brown failed to spark a general slave revolt, the high moral tone of his defense helped to immortalize him and to hasten the war that would bring emancipation. Noting that the gaze of Europe was fixed on America, French novelist Victor Hugo wrote that Brown’s hanging would “open a latent fissure that will finally split the Union asunder.” As they marched into battle during the Civil War, Union soldiers sang a song called “John Brown’s Body” that would later provide the tune for the “Battle Hymn of the Republic”:\n\nGet a Britannica Premium subscription and gain access to exclusive content. Subscribe Now"}, {"url": "https://www.planetmountain.com/en/news/alpinism/goodbye-to-british-climbing-legend-joe-brown.html", "page_content": "The West Face of Nameless Tower, also referred to as Trango Tower, Karakorum, Pakistan. Eternal Flame runs up the right skyline of the tower, which is actually its south buttress. The first ascent of Trango Tower was carried out in 1976 by Mo Anthoine, Martin Boysen, Joe Brown and Malcolm Howells. Photo by Hinterbrandner / Huberbuam.de\n\nLegendary British climber Joe Brown standing below Dinas Cromlech in Wales. Brown pioneered climbs through Great Britain, the Alps and the Greater Ranges, with ascents such as Cenotaph Corner on Dinas Cromlech in Wales and the first ascent of Kangchenjunga (8586m) in Nepal testament to his talent. Photo by Ray Wood\n\nGoodbye to British climbing legend Joe Brown\n\n16.04.2020 by by Planetmountain\n\nJoe Brown, one of the world’s greatest all-round climbers, passed away last night aged 89. Brown pioneered climbs throughout Great Britain, the Alps and the Greater Ranges in particular in the 1950's and '60's. Cenotaph Corner on Dinas Cromlech in Wales and the first ascent of Kangchenjunga (8586m) in Nepal stand as an all-time testament to his undisputed talent.\n\nJoe Brown, one of world’s greatest all-round climbers, passed away peacefully at his home in Llanberis, Wales, last night. Born in Manchester on 26 September 1930 the youngest of seven children, Brown left school aged 14 and served an apprentice as a builder before pioneering hundreds of climbs during the 1950’s and 60’s throughout Great Britain, the Himalaya and Greater Ranges. Such was his reputation that for many years letters were sent to him addressed simply to \"The Human Fly, UK.\"\n\nBrown started exploring the nearby gritstone outcrops of the Peak District at an early age and quickly discovered his love and talent for climbing. His first routes date back to the immediate post-war period with all-time classics such as Three Pebble Slab, Brown’s Eliminate and Valkyrie at Froggatt, and Right Unconquerable at Stanage being established in 1948 and 1949. After an enforced 18-month stop due to National Service he returned to forging new rock climbs across Britain that contributed to a significant rise in standards. His climbs were rarely inspected or cleaned beforehand and although pegs were placed, Brown tended towards his self-imposed limit of 2 pegs per pitch.\n\nBrown climbed extensively with fellow Mancunian Don Whillans and they formed what is recognised as being one of the strongest climbing partnerships of all time. After joining forces to establish the ultra-classic Matinee at the Roaches in April 1951, later that year they added another milestone with Cemetery Gates on Dinas Cromlech in Wales. It was at this crag in the Llanberis pass that Brown teamed up with Doug Belshaw a year later to make the first ascent of his undisputed pièce de résistance, Cenotaph Corner. A strong contender for the most famous routes in Wales if not the entire British Isles, this was first ascended in wet conditions by Brown wearing only socks and stands as an all-time testament to his skill and mettle.\n\n\n\nBrown was also extremely prolific on nearby Clogwyn Du'r Arddu, the Black Cliff just below Mount Snowdon, where he established classics such as Vember, Octo, The Corner, Black Cleft, Shrike and Taurus to name just a few. Brown was also formidable at winter climbing and in 1954 together with Whillans and Nat Allen he succeeded on the coveted lineon Ben Nevis they called Sassenach. The route, established by the visiting Englishmen on Scotland's finest mountain, proved somewhat controversial but indicated strongly the alpine direction Brown would be taking in the near future.\n\nEarly trips to the Alps resulted in quick repeats of big alpine climbs as well as, in 1954, a demanding new route with Don Whillans up Aiguille de Blaitière. The difficult crack dubbed \"Fissure Brown\" on this route is named in Brown’s honour, while shortly afterwards the duo caused a considerable stir with their third ascent of the West Face of Petit Dru in a record-breaking 25 hours.\n\n\n\nThis trip proved a turning point and on his return Brown, aged 25 at the time, received an invitation to take part in the 1955 Kangchenjunga expedition. Standing 8586m tall, the world’s third highest mountain was at the time the highest unclimbed peak in the world. Brown proved his tenacity by summiting on 25 May with George Band, having breached sections deemed to be the hardest ever climbed at altitude for the next two decades, until the 1975 British Mount Everest Southwest Face expedition. Ever on the move, in 1956 Brown made the first ascent of the striking Muztagh Tower (7273m) in the Karakoram with Ian McNaught-Davis, Tom Patey and John Hartzog, while in the ensuing years he continued to explore climbs in other far flung corners of the world.\n\nBrown consolidated his alpine reputation with hard climbs in the Mont Blanc massif, notably with a difficult new direct variation up the West Face of Aiguille du Plan and a new line up the NW Face of Aiguille Sans Nom, both with Tom Patey in 1963, while in 1964 with Patey, Chris Bonington and R. Ford he established a new route up Aiguille de Leschaux. In 1967 with Bonington and Patey once again, as well as Ian McNaught-Davis, Pete Crew and Dougal Haston he climbed a new route up one of Britain’s most striking features, the Old Man of Hoy; this ascent was televised in front of an estimated 15 million viewers. A feat never seen before or since.\n\nIn 1973 with Hamish MacInnes and Don Whillans he made the first ascent of Mount Roraima in Guyana, while in 1976 Brown travelled to Pakistans’s Karakorum with Martin Boysen, Julian Mo Anthoine and Malcom Howells to claim the impressive first ascent of the Nameless Tower in the Trango group. At the time this involved some of the hardest rock climbing ever achieved at altitude.\n\nAfter marrying Valerie Melville Gray in 1957 and having two daughters, Brown moved to Llanberis in Wales in 1966 where he ran his high successful climbing shop. He was elected Member of the Order of the British Empire (MBE) many years ago and in 2011 he was appointed Commander of the Order of the British Empire (CBE) for services to rock climbing and mountaineering.\n\nShare Tweet"}, {"url": "https://www.allmusic.com/artist/joe-brown-mn0000120615/biography", "page_content": "With a career that began in the 1970s and was still going strong in the opening decades of the 21st century, Joe Brown has cut a unique swath across British rock & roll. The east London-raised artist is most well-known for his bittersweet U.K. hit \"A Picture of You,\" from 1962, the same year in which the Beatles opened for him on a string of dates. However, Brown's prolific run of early hits came to an end with the rise of Merseybeat, after which he increasingly pursued acting roles and became a broader entertainer. The '70s saw him unveil a new act, Brown's Home Brew, cementing his reputation as a musician's musician. Upon moving to Henley-on-Thames early the following decade, he reinforced his close friendship with his new neighbor George Harrison when the pair bonded over the ukulele. Following Harrison's death in 2001, Brown closed the Concert for George tribute show at the Royal Albert Hall (at the request of Harrison's wife Olivia), with a moving solo uke rendition of \"I'll See You in My Dreams.\" His performance is reputed to have been the catalyst for renewed public interest in the instrument.\n\nBorn Joseph Roger Brown in Swarby, Lincolnshire in 1941, Brown proved a natural guitarist from an early age, and in 1956, at age 15, he formed the Spacemen, a skiffle group with whom he started his career in entertainment. The band -- whose ranks included bassist Peter Oakman and his older brother Tony Oakman on banjo and guitar -- later switched to rock & roll, and was subsequently spotted by impresario Larry Parnes, who was in the process of signing up lot of young vocal talent in an effort to get in on the rock & roll boom. The Spacemen became Parnes' resident band, backing such figures as Vince Eager, Johnny Gentle, and Marty Wilde on the early Parnes package tours. The group also had the good fortune to be spotted by producer Jack Good, who was putting together the house band for his new television music showcase Boy Meets Girl. Brown was already a prodigious player, and he was hired as lead guitarist for the house orchestra at the age of 18; he was proficient in authentic American-style rock & roll, country, and country-blues, and stood out from the competition.\n\nHe was signed to Decca Records that same year; his first two singles, \"People Gotta Talk\" and \"Jellied Eels,\" issued in 1959 and 1960, respectively, failed to chart. But his third, \"The Darktown Strutters Ball,\" reached number 34 on the U.K. charts in 1960. The group by this time was rechristened the Bruvvers, owing to the fact that they weren't using the Spacemen name anymore, and had no official name, but were, as Brown put it -- in his uniquely Cockney-styled way -- \"like bruvvers.\" Brown left Decca for Pye Records in 1961, the latter company using his single \"Crazy Mixed Up Kid\" to launch its Piccadilly imprint. Only two of his next four singles even reached the Top 40, but Brown was making musical headway (and history) nonetheless. At just about that same time, he appeared as the lead guitarist on Billy Fury's landmark 10\" long-player The Sound of Fury, his playing among the highlights of what is generally regarded as one of the best albums to come out of the early English rock & roll boom. His work from that period and on that album has received high praise across the decades from musicians of succeeding generations including Keith Richards of the Rolling Stones.\n\nBrown's own career didn't fully take off until 1962, when he hit the number two spot on the singles charts with \"A Picture of You.\" He was voted the \"Top U.K. Vocal Personality\" of 1962 in the pages of New Musical Express, and toured that year on a bill that included the Beatles, who were just about to record their debut single, \"Love Me Do\"; \"A Picture of You\" was also a personal favorite of both Harrison and Paul McCartney, later even turning up on the \"Let It Be\" sessions. Brown's next two records, \"It Only Took a Minute\" and \"That's What Love Will Do\" also made the Top Ten in 1962 and 1963, but his subsequent recordings were much more modest sellers, only making the Top 30.\n\nBrown was still sufficiently prominent in 1963 to get a film debut late that year, in What a Crazy World, which co-starred Marty Wilde. By that time, however, Brown's hold on the listening public was fading in the face of the Merseybeat boom and the next wave of British rock & roll. He turned increasingly to work in movies, pantomime, and theater musicals, and scored a big success in Charlie Girl on London's West End. Ironically, his occasional penchant for novelty tunes -- which included a recording of \"I'm Henry the Eighth\" -- anticipated the strategy of such successful mid-'60s pop/rock acts as Herman's Hermits, who parlayed their recording of the latter song into a huge American hit; that same use of novelty tunes in his repertory, however, also made it difficult for listeners of subsequent generations, having heard of Brown's reputation as a first-rate guitarist, to fully absorb some of his recordings, especially the early concert documents, which were weighted heavily toward his Cockney/novelty repertory.\n\nBrown's last chart success of the '60s was a low Top 40 placement for his rendition of \"With a Little Help from My Friends\" in 1967. He later worked on television in children's programming and game shows, but in 1972, Brown was back in music with a new band, Brown's Home Brew, whose repertory embraced not only rock & roll but also country and gospel music and featured his first wife, Vicki, on vocals. Brown has remained active in music ever since, and crossed paths on record with his old friend Harrison several times in the '70s and '80s; Harrison was also the best man at Brown's wedding to his second wife in 2000. He has continued performing in the 21st century and is also seen frequently on British television in connection with rock & roll-related programming. Brown's 50th year in music, in 2008, saw him receive a U.K. gold award for sales over 100,000 copies of a new best-of collection, as well as complete a 37-date tour, and a Royal Albert Hall concert with Mark Knopfler, Jools Holland, Dave Edmunds, and Chas & Dave. Brown has also received Mojo magazine's lifetime award for outstanding contribution to music after 51 years of recording. In 2009, Brown was given an MBE (Member of the Order of the British Empire) by Queen Elizabeth.\n\nThe next decade was bookended by documents of his relentless touring ethic -- 2011's Live in Liverpool and 2019's In Concert -- while in 2012 he issued The Ukulele Album, on which he tackled material associated with acts such as the Who, ELO, and Mötorhead. In 2019, Brown celebrated his 60th year in the music business with the release of a lavish, multi-disc box set that traced the course of his career and featured numerous unreleased recordings."}, {"url": "https://climbing-history.org/climber/612/joe-brown", "page_content": "Born in 1930, Joe Brown was one of the pivotal figures in post-war climbing in the UK. In the 1950s and 60s, and alongside contemporaries such as Don Whillans, he pushed the standard of rock climbing in the UK to new levels with the first ascents of classic routes such as Cemetry Gates (E1), Great Slab (E3) and Right Eliminate (E3). Joe's routes frequently ventured in to territory that was previously considered off limits, often tackling bold and uncompromising features with minimal protection.\n\nIt is sometimes suggested that he was one of the inventors of jamming. Though this seems unlikely, though it is certainly true that he employed the technique to great effect on many of his new routes.\n\nJim Perrin:\n\nWith all the other greats of my time, I could understand how they climbed: fitness, physique, supple gymnasticism or sheer application. With Brown, there was something else at work. He was quite short, not heavily built, his muscles corded rather than developed, his movement smooth and deliberate. When I climbed with him, sometimes I would watch the way he made a move, copy it when I came to that point, and his way, that he had seen instantly, would be the least obvious and most immediately right. He was climbing's supreme craftsman, unerringly aware of the medium. [3]\n\nReferences\n\n[1] An extended biography written by Ollie Burrows is available here https://www.theclimbersshopjoebrownblog.co.uk/blog/joe-brown-biography including a list of many of Joe's first ascents.\n\n[2] Interview with the BMC\n\n[3] Obituary on UKClimbing written by Jim Perrin."}, {"url": "https://www.encyclopedia.com/education/news-wires-white-papers-and-books/brown-joe-19", "page_content": "Joe Brown 19(?)(?) –\n\nJudge\n\nBegan Legal Career\n\nBecame TV Judge\n\nThe Brown Philosophy\n\nSources\n\nUntil April of 2001, Joe Brown billed himself as the only sitting judge with his own television show. Following his resignation from the Tennessee Criminal Court, he concentrated solely on hosting his nationally-televised daily courtroom drama series, Judge Joe Brown. Larry Lyttle, president of Big Ticket Television, said in the company’s show description of Judge Joe Brown that Brown “is magnetic, wise, and compassionate. At the same time, his from-the-streets upbringing gives him a tough-love approach to courtroom justice that endears him to viewers nationwide.”\n\nBrown was born into a tough neighborhood in Washington, O.C., the only child of two schoolteachers. The family moved to southcentral Los Angeles when he was a young boy. Life in the inner city, whether Washington or Los Angeles, was difficult and dangerous. Brown saw friends succumb to the harshness and despair of the streets. He said in the Big Ticket Television show description that he was one of the few kids in his neighborhood who did not end up “dead or in jail.” Brown credited education for his escape. He graduated at the top of his class from Dorsey High School in the Crenshaw area of Los Angeles. He then went on to the University of California Los Angeles (UCLA), where he majored in political science and helped pay for classes by digging ditches and loading trucks. Although the law had not been his goal initially, Brown decided to apply to law school at UCLA and was accepted. To support himself while he earned his law degree, Brown worked as a substitute teacher.\n\nIn 1973, Brown moved to Memphis, Tennessee, to work with legal services there and was later employed by the Equal Employment Opportunity Commission (EEOC). He became the city’s first African-American prosecutor in the city and then moved to the Public Defender’s office as director.\n\nBy 1978, Brown had left public life and opened his own law office. He returned to the public arena 12 years later, when he was elected judge of Division 9, State Criminal Courts, for Shelby County in 1990. He began to make a small name for himself with his efforts to help kids stay out of trouble and his methods of alternative sentencing. He was known for spending personal time following up on his cases in criminal court, especially those that involved young people. For his work with inner city kids, Brown was honored at the\n\nAt a Glance …\n\nBorn Joe Brown, in Washington, D.C; son of two schoolteachers; children: two sons. Education: UCLA Law School.\n\nCareer: Legal Services, Memphis, TN; EEOC; Public Defender’s Office, Memphis, TN, director; State Criminal Courts, Shelby County, judge, 1990-01; television show, Judge Joe Brown, 1998-.\n\nAwards: Olender Foundation, Advocate for Justice Award.\n\nAddresses: Judge Joe Brown, P.O. Box 949, Los Angeles, CA 90078.\n\nKennedy Center in Washington, D.C., and given the Olender Foundation’s Advocate for Justice Award.\n\nBrown found himself in the national spotlight when, in 1998, he was appointed judge on the reopened case of the late James Earl Ray, who had been convicted and sentenced to 99 years in prison for the 1968 assassination of civil rights leader Martin Luther King, Jr. Ray always maintained he had not been alone in the killing. Although Brown was assigned to preside over the reopened case, he was later removed from the case by the Criminal Court of Appeals, which felt that he had demonstrated bias on the bench. After Ray died on April 23, 1998, the case was closed for a second time. Brown, believing that the full details of King’s assassination need to be brought to light, said later that he felt the case should not have been closed after Ray’s death.\n\nWhile he was presiding over the Ray case, Brown appeared on Nightline, a late-night, nationwide talk show. His forceful personality impressed Larry Lyttle, the president of Big Ticket Television. At the time, Lyttle was looking for a real-life judge to star in an upcoming reality courtroom series and he offered Brown the job.\n\nIn 1998 Judge Joe Brown debuted as a tough, reality courtroom series presenting actual cases taken from anywhere in the nation. The show provided audiences with real trials and real solutions. The show caught on immediately, consistently topping the ratings charts. But on the heels of popularity came trouble. Although he was gaining a nationwide audience who seemed to delight in his no-holds-barred judgments and opinions, there were backstage rumors about poor attendance on the real-life bench. The television show required Brown to be in Los Angeles for taping three days a week every other week. Tennessee officials complained that Brown’s television court schedule left little time for his Tennessee court work, calling him, according to the New York Post Online Edition “out-of-town Judge Brown.”\n\nIn fact, Brown was absent more than any other judge in the criminal court, a full one-third of his required working days. Brown countered by claiming that he had merely, as he told the Memphis Flyer, “streamlined” things. He said he was doing the same amount of work on the bench, but it just took less time. He strongly denied that the missed days were the result of working on the television show. However, in April 2001, Brown resigned from the real-life bench, although his term did not expire until 2006. He said in the Big Ticket Television show description that he did so simply because he had “too many irons in the fire.”\n\nBrown has professed shock at the publicity his show enjoys, and has thrived on the controversy that often swirls around him. The show’s popularity has boomed with an estimated more than five million viewers nationwide. An integral part of Judge Joe Brown’s success is the personality of its host. He possesses a flair for the dramatic that serves him well in his television court. Known for mixing justice with fairness, Brown has brought tough-love and streetwise sense to his TV courtroom.\n\nMost of all, audiences have admired Brown’s creative sentencing. To Brown, creative sentencing is far more effective in some cases than sending someone to jail. Brown has said that jail is simply the easy way out for some people. A place to stay, food, and recreation sometimes do not seem so bad. Brown has attempted to ensure that jail is not an attractive option. Sometimes, Brown said in the Big Ticket Television show description, “something more is called for.”\n\nHis method of sentencing first-time nonviolent offenders is especially noteworthy. “I tried not to sentence anyone in the conventional way if I could think of a better way to get their attention,” Brown said in the Big Ticket Television show description. Toward that end, Brown once ordered a writer of bad checks to write an apology. The catch was that the apology had to be written 100,000 times! On another case, a convicted burglar was obliged to invite his victim into his own home so that the victim could choose any item he wanted to take away.\n\nIn following up on his cases and through his tough-love approach to sentencing, Brown has demonstrated that he truly cares about the people who stand before him in court. In the show description from Big Ticket Television, Brown explained his philosophy of life: “People need to be humane, kind and caring to each other. This country should be brought together—black, white, brown, yellow, red, whatever—and America needs to be promoted so we can remain the best in the world. That’s what I’m about.”\n\nPeriodicals\n\nMemphis Flyer, August 21, 2000.\n\nOnline\n\nThe Judge Joe Brown website, http://www.judgejoebrown.com\n\nNew York Post Online Edition, http://www.nypost.com\n\nOther\n\nAdditional material for this profile was provided by Big Ticket Television and from the Judge Joe Brown show description.\n\n—Rose Blue and Jennifer M. York"}, {"url": "https://theclimbersshopjoebrownblog.co.uk/blog/joe-brown-biography", "page_content": "Note:\n\nGradings given here are current ones. At the time of some of the first ascents V.S. (very severe) was the highest grading used. Routes were rarely inspected or cleaned beforehand, but pegs were placed more readily than today both for protection and aid. Joe developed a self-imposed limit of 2 pegs on a pitch preferring to leave harder routes for later generations.\n\nJoe Brown, the youngest of seven children, was born on 26th September 1930, the son of Joseph and Mary Brown (nee Atwell). Life began in Ardwick, a working class area of Manchester. His father was a jobbing builder but with work scare during the depression of the early thirties, he made ends meet with periods spent at sea. When Joe was only 8 months old his father suffered a shipboard accident sustaining an injury which became gangrenous and led to his death. With a large family and only his eldest brother bringing home a wage the family’s financial position was dire. At first his mother took in washing, then once he was old enough to be left in the care of elder brothers and sisters, she went out to work as a cleaner.\n\nBy the start of the Second World War the family had moved from their two-up, two-down terrace to a larger house in Chorlton-cum-Medlock an area that suffered badly in the Blitz of 1940. Not only was their house severely damaged, but first one then another of the schools Joe attended was destroyed. Against this background and with many younger teachers conscripted into the forces his schooling was much disrupted. Although Joe never excelled academically he was equally never near the bottom of the class. It was just school did not seem that important to him. His great joy was exploration, initially in his local area then, by the age of 12 on camping expeditions made with the most rudimentary of equipment. This was the period of Arthur Ransomes “Swallows and Amazons”, when it was not considered totally irresponsible to let children of this age off to explore by themselves. Indeed, at the age of 14 most people from Joe’s world would have left education and be in full time work. Exploits from this period included the discovery of the Alderley Edge mines and of Eldon Hole, where his group descended the huge 180 ft. (60m.) shaft hand over hand on various lengths of rope knotted together - an escapade that rates as amongst the most dangerous of his career!\n\nWhen Joe left school at 14 he became apprenticed to a plumber and general builder called Archie. Archie paid Joe ten shillings (50p.) a week, most of which he passed to his mother. Nevertheless he was able to save towards his first pair of boots - helped by Archie who hearing this gave him the £3 10s. 0d. he desperately needed, an act of kindness never forgotten. Joe and his friends were now scrambling and climbing in the local gritstone quarries. This soon led to expeditions further afield, and, when Joe was about 16, to the discovery of Kinder Downfall — a cut through the gritstone plateau where water runs off the Kinder Scout. Joe led the way to the top solo before throwing down the end of a brewer’s rope for his companions to follow. The ropes the group had were rudimentary - a piece of rope found beside roadworks, and most famously his mother’s washing line - it had actually started life as a length of sash cord before serving as a washing line, but had been discarded as she thought it too old to be reliable!\n\nAfter this episode Joe became determined to climb more, and by good fortune soon met a slightly older group of lads, led by \"Slim\" Sorrell, who at 18 had a wider experience of the Peak. His first trip away from his home area was to the Lake District in 1946, when encumbered by over heavy sacks they struggled to Pillar Rock. Pillar Rock is always impressive. and was on a scale far larger than anything Joe or his companions had previously encountered. They were intimidated by the longer climbs and the much greater exposure than on the gritstone edges so started with routes on the lower side of the rock. Here they felt more at home, and soon realized that the climbing itself was no harder than they were used to, indeed many of the holds were more positive than on grit. Quite soon they progressed to climbing a VS route here (in 1946 VS was well above the standard most experienced climbers were operating) and with rapidly growing confidence, by then end of the holiday tackled New West route, a technically easy route on the main face.\n\nIn 1947 Joe began to climb his first new routes, the most memorable being Saul’s Crack (HVS, 5a) at the Roaches. At Christmas Joe made his first trip to Snowdonia. Wearing gym shoes and climbing as it snowed they ascended the Idwal Slabs (Ogwen Valley) before being repulsed by the steeper Holly Tree Wall above. A return trip was made the following spring, and in glorious weather Joe and Slim Sorrell climbed most of the routes on Holly Tree Wall and the Gribin Facet. Having cut their teeth on these traditional and popular routes on their next visit they moved to Tryfan and Glyder Fawr, to do Munich Climb (V.S.) and Lot’s Groove (V.S.) both routes with a considerable reputation for difficulty and seriousness. In barely two years Joe had progressed from untutored scrambling to ascents of highly regarded Welsh routes.\n\nUp to 1948 Joe and his friends had operated largely in isolation - indeed they continued to operate outside the mainstream of the climbing world for several more years. They had not served the usual long apprenticeship with older more experienced climbers which was the norm at the time, but were self-taught, through adventure and mis-adventure, and approached the cliffs without any of the inhibitions and traditional values that might otherwise have held them back. They had little idea of grades and grading but judged climbs solely according to their own opinions, assuming that if they could get up it, it could not be regarded as hard by other more experienced climbers. Joining the Valkyrie Club in 1948 brought Joe into regular contact with other climbers, and together they explored the Peak District’s gritstone edges, with Joe now making a number of first ascents such as Freddie’s Finale (E1, 5b), The Trident (HVS, 5a) and Blue Lights Crack (HVS, 5a) all at Wimberry. Brown’s Eliminate on Froggat is also a climb of this period. Graded E2, 5b today, on the first ascent it was a far harder prospect than now (contra the comment in Peak Rock). He climbed in nailed boots relying on flakes only a fraction of an inch in thickness. Many of these flakes have now broken off leaving larger holds. Also at Frogatt he climbed Three Pebble Slab (E1,5a) and Valkyrie (HVS, 5a), while on Stanage Right Unconquerable (HVS, 5a) fell to him the following year.\n\n1948 also saw Joe’s first serious foray into winter climbing with a camping trip to Ben Nevis which culminated with a forced evacuation from a high campsite in the face of a blizzard which literally destroyed the tent. The Glen Nevis bridge had been washed away, the river crossing proved epic, and Joe’s companion, Ludder, was found to have a broken leg, from an injury sustained descending the Red Burn five days previously!\n\nAt the end of 1948 the club met at Ogwen for Christmas. Joe and his group were now climbing at every opportunity, with Joe making what was probably the first winter ascent of Hanging Garden Gully (IV) on Christmas Day. They also took the opportunity to top rope Suicide Wall which had been put up by Preston only 3 years earlier and had the fearsome reputation of being the hardest route in Wales. Given that they had just made a winter ascent it must also have been very cold indeed, and shows remarkable bravado even to think of attempting it! Joe was to come back some years later to make the true second ascent but this was after he had completed his period of National Service.\n\nThe next day Joe borrowed five pegs from Ernie Phillips and with Wilf White went round to the Llanberis Pass to make an attempt on what was to become Cenotaph Corner. Given the fact it was winter, and Joe and his peers had only been climbing for 2 or 3 years, it was show of amazingly audacity even to try a major new route that had already been eyed up by the leading climbers of the day. But they were no respecters of tradition, and climbing solely for their own pleasure were in no way overawed by such thoughts, but instead had the confidence of the young in their own abilities – indeed their ability had already been amply demonstrated in the exploits of the previous few days. They also were not afraid of failing now only to return later. It is easy to imagine that being on a high, having top roped what was regarded as the hardest route around, nothing would seem impossible. Seconded by Wilf White Joe reached the niche at 100ft, the exit from which is the crux of the whole climb. While trying to place a peg he let the peg hammer slip from his mouth, and it fell directly down the corner hitting his hapless second a glancing blow on the head. He descended to find Wilf dazed but conscious, and within a few minutes he had been encouraged to get back on the rock. Joe re-ascended to the niche, but he had used all five of the pegs they had with them, and had to retreat again. There was some subsequent criticism of the number of pegs Joe had used (Harding wrote in his 1950 Pass guide \"with sufficient ironmongery and few scruples this corner could be ascended\"). Such criticism was hardly justified, in part because the corner was choked with grass, and was cleaned only in the course of Joe’s ascent (it was then a very different and harder proposition than doing it today), but also because of Harding’s own ethics , and indeed the prevailing ethics of the day. When Harding made the first ascent of Ivy Sepulche in 1947 it was pre-cleaned from an abseil rope yet still required 2 points of aid on the first ascent. Nearby, the first ascent of Kaisergebirge Wall in 1948 used 7 points of aid: \"Nothing was barred, pegs, knotted bootlaces…\" even (later) the famous bicycle crank added for aid and protection. So such implicit criticism seems to have been born more out of envy than a sense of genuine indignation.\n\nJoe was called up for 18 months National Service in late January 1949. Finding that there was no mountaineering corps, and that joining the Marines meant signing-on for a longer period, he served in the Ordnance Corps, with postings to Portsmouth, Leamington Spa and later Singapore. This kept him off the crags for a large part of 1949/50. But as far as possible his leave was spent with friends climbing either in the Peak District or Scotland.\n\nDuring a period of leave at Easter 1949 that he made his first visit to Clogwyn d’ur Arddu - the Black Cliff. Joe easily jammed his way up the first pitch of Curving Crack, a pitch that was then usually then laybacked. Impressed with the cliff he returned with Slim Sorrell later in the year when they proceeded to climb all 13 major routes that existed on the cliff. This was an target few of the leading climbers of the day had achieved, yet alone by a pair of youngsters during their first year at the crag. Having done the existing routes they turned his attention to the unclimbed lines. Starting up the ‘drainpipe crack’ (which had already climbed by Birtwistle) he attempted to take the cracks above on the right. The weather was poor, damp and cold (not that such thoughts ever deterred Joe and his companions from trying even the hardest routes), and Joe was climbing in socks. High on the second pitch, with his fingers over the top, but numb, he was unable to pull up any more and fell, cutting through two of the three strands of their much valued hemp hawser laid rope. He survived and the route remained for another day.\n\nDuring National service Joe suffered one of several accidents to befall him when not climbing - breaking a leg in three places in a scrum for the tea urn. But three months later he was back, stealing a new route at Froggatt under the nose of Wilf White who had inadvisably told Joe he was thinking of giving it a go in a letter that Joe had received while still in hospital! No doubt Wilf had imagined he had rather more breathing space before Joe hit the crags again, but arrived to find Joe already at the top.\n\nOnce demobbed Joe resumed his attack on standards in the Peak District with a vengeance, over the next 12 months establishing Elder Crack (E2, 5b) and Right Eliminate (E3, 5c) on Curbar, and, in contrast to the crack climbs which had become his hallmark, Great Slab (E3,5b) on Frogatt. On Birchens Edge he climbed Orpheus Wall (E1, 5c); while at the Roaches he put up The Mincer (HVS, 5b), Dorothy’s Dilemma (HVS 5a) and Matinee (HVS, 5a,5b). At Stanage, Tower Crack (HVS 5a) and Namenlos (E1,5a) both date from this period. More routes followed at Stanage the following year - The Unprintable (E1, 5b), Terraza Crack (HVS 5b) and Baw’s Crawl (HVS 5a). Although he and his companions also returned to Cloggy (Clogwyn D’ur Arddu) many times in 1951-2, but it was in the Llanberis Pass that Joe established the first of his many new Welsh routes, Hangover (E1 5a,5b) in May 1951.\n\nIn April 1951 Don Whillans first entered the scene. Joe and his friends were climbing at the Roaches in Staffordshire and Joe had just established a direct start (HVS, 5a) to Valkyrie, a 1946 Peter Harding VS of some reputation. Slim Sorrell was unable to follow. Don said he would give it a try, was tied on and within a few minutes had joined Joe at the top. Within a few months the one of the most influential climbing partnership in history had been formed. In June 1951 Joe returned to Cloggy, this time with Whillans to establish Diglyph (HVS, 4a,5b,4c), in October they were back again, this time adding Vember (E1, 5a,5b,4b) the scene of a previous failure. Finally, Joe led The Boulder (E1, 4c,5a,5a). The upper pitches of this were done as a single run-out of 270 feet (80m.) on two ropes knotted together, after Ron Moseley (who was climbing well having made the first unaided ascent of Kaisergebirge Wall the previous weekend) and his companion declined to follow – doubtless a wise decision in view of the absence of protection on the difficult traverse, and the uninviting pendulum that awaited the unwary. When almost at the top Joe caught his anorak hood during a difficult sequence of moves and almost took what would have been a very spectacular and serious flyer, but with a last great struggle he freed himself to complete the route in a state of total exhaustion. Climbing was not restricted to Cloggy, Joe and Don also made the first ascent of Cemetery Gates (E1 5b,4c) on Dinas Cromlech in the Llanberis Pass - the name spotted on the destination board of a bus in Chester as they returned home which fitted well with the tone of the adjacent routes Cenotaph Corner and Ivy Sepulchre.\n\n1951 saw the disbandment of the Valkyrie Club as its members moved away. Meanwhile, Joe and a small group of elite climbers had started meeting at the Y.M.C.A. in Manchester on Wednesday nights and from this sprang the ‘Rock and Ice’, which was officially founded on 26th September 1951. This was a club never that owned a hut, nor had much in the way of a constitution or rules, but was nevertheless became one of the most influential clubs in the history of British climbing. Indeed, in no other club before or since has there been such a mixture of drive and talent, so that it stood head and shoulders above everything else – its members regarded with awe wherever they went. Although much has sometimes been made of rivalries within the club these were generally in the form of competition between its members keen to get one up on their companions, and were not as bitter as has been portrayed. This club too eventually died, primarily because it no longer served its original function. It was resurrected as the Rock and Ice Climbing Club some years later but by that time the burning energy had gone, and most of its members operated independently.\n\n1952 saw Joe establish a further six routes on Cloggy, including Pinnacle Flake (E1, 5b,4c), the Black Cleft (E2, -,5c,5c, 5a,-) Llithrig (HVS, 4a,5a,4c,4c), Octo (HVS 4b,5b) and the Corner (HVS, 4a, 5a); but his greatest prize of the year was the first ascent of Cenotaph Corner (E1, 5c). This immaculate route, probably the best known climb in Wales, follows a vertical 120ft. (35m) corner between two wide perpendicular walls. The line was obvious, and had already been named by Menlove Edwards. After news of his attempt at the end of 1947 circulated a number of other leading climbers had tried their luck but none were able to pass the first difficult section at 20 feet. When Joe returned in August 1952 he knew that he had previously placed more pegs than were necessary and this time completed the route with the use of only two - indeed, thereafter he adopted the rule of limiting himself to no more than two pegs on a pitch. It is interesting to note that even on this obviously difficult route Joe did not wait for ideal conditions, climbing it in socks because of the dampness. This was typical of his group who would never let poor weather interfere with their plans.\n\nThe following year there were another five new routes on Cloggy - including the fine Girdle of the East Buttress (HVS, 4a,5a,4c,4c,4b,5a,4b,5a). On Cyrn Las he made the first ascent of The Grooves (E1, 5b,5b,5b), a fine natural line destined to become a classic route on the crag. In the Lakes with Whillans in the lead they put up Dovedale Groove (E1,5b) and Triermain Eliminate (E1,5b), while Joe led Moseley and Tom Waghorn up Laugh Not (HVS, 5b) on White Ghyll. 1953 saw Joe make his first trip to the Alps - on the pillion of Don Cowan’s motorbike. On the East Ridge of the Crocodile Joe broke his wooden shafted ice axe and they had to cut their 250ft. rope into pieces after it jammed, disasters to the impecunious pair. They then made an abortive attempt to re-climb the Allain-Fix route on the Blaitiere after a major rockfall. This was a highly regarded route, the only one in the guidebook to have a VIb graded rock pitch. Indeed this was why they chose it, reckoning that they were up to any rock they encountered. Although they only got a third of the way up the difficulties Joe mastered the difficult crack, which would later be named in his honour ‘Fissure Brown’. Needless to say by the time these two novices left the valley they had made a considerable impression!\n\nEaster 1954 saw another winter climbing trip to Ben Nevis. Whillans and Nat Allen had spent a couple of days trying to force a route through the overhangs on the Carn Dearg buttress before Joe joined them. Following a crack that cut the main roof he reached a chockstone on the lip and got a sling around it, but then retreated, removing his runners, ready for the following day. They decided that, because it was so strenuous, one would climb to the lip placing slings, then retreat and allow the other to climb through. In view of Joe’s effort the previous day Don offered to place the gear, and let him finish the pitch. However, once on the lip Don was still climbing strongly, and with Joe’s encouragement to keep going pulled round the roof into a far from easy crack above. At this there was a shout of \"English Bastards!\" from the CIC hut from where their progress had been closely observed. A classic Scottish line had fallen to English visitors! The name Sassenach (E1 with 2pts. aid, 4c,5a,5a,5a,-,4b,-) seemed appropriate.\n\nBack in the Peak Joe and Don tossed a coin for the lead on The Sloth (HVS, 5b) at the Roaches — Don won, and so another now classic route was created. By diligent saving through the winter of 1953-4 Joe and his companions had accumulated enough money to be able to spend a prolonged season in the Alps - sufficient they hoped to be able to wait out bad weather and achieve some really worthwhile climbing. Unfortunately 1954 turned out to be one of the poorest seasons that Chamonix had known, and little was accomplished. Their first success was to complete the route that they had retreated from on the Blaitiere the previous summer. They then turned their attention to the West face of the Dru, successfully making only the third ascent, and that in a record time. This impressive feat for still relative novices to alpine climbing gained them recognition not only in Chamonix but also among the established British alpine fraternity. This was to have major implications for Joe’s future life, as he would now start to get invitations to join expeditions rather than just climbing with his Manchester based friends.\n\nSo it was that Joe’s life became centered around climbing (he says\n\nit was from his very first day on Kinder Downfall), with everything else taking a subordinate role. To go to the Alps he and his companions had given up their jobs and they returned to England broke and unemployed. For the next six or seven years Joe continued to work as a self-employed jobbing builder as this was a way he could take off time when he wanted, to go climbing. Initially he under-priced his quotes, which meant that although he was never short of work he made little money, and had to work fast and hard just to break even at the end of the week. Tradition has it that Joe was a plumber by trade. This is not true, Joe and Archie were always general builders. However, Joe did have two brothers who were plumbers, so he would get advice on plumbing jobs from them, becoming a proficient plumber in his own right.\n\nBut work was just a means to fund the next climbing trip. Throughout the following years a pattern was established with regular winter trips to Scotland, weekends spent in Wales, or less frequently in the Lakes District, and an extended trip during the summer to the Alps or further afield. Winter weekends were sometimes spent pegging artificial routes on limestone — a social activity as much as serious climbing, with the group brewing up in a cave or under an overhang while one member climbed — with days spent in places such as Dovedale, the Manifold Valley and at Goredale Scar. Routes such as Brown’s Overhang (A3) at Stoney Middleton; Venery (A1) and Southern Rib (A2) in Dovedale and the classic White Edge (A2) on Ilam Rock date from this era. In warmer weather they went to the gritstone edges where in 1954, on Stanage, Joe climbed the Dangler (E2, 5c) and freed Quietus (E3,5c). Although there was no training in the modern sense, by climbing every weekend all year and doing manual work during the week he and his group maintained an exceptional level of fitness.\n\nOn his return from the Alps in 1954 Joe had a telegram awaiting him from Charles (later Sir Charles) Evans, who was to lead the 1955 Kanchenjunga expedition. Kanchenjunga was the third highest summit in the world (28,156ft.), and then the highest one to remain unclimbed. The expedition was intended primarily as a reconnaissance, but Charles Evans nevertheless wanted a strong climbing team to be able to make a sound judgment about a return expedition. All expenses were to be paid - Joe need bring only £20 for pocket money - Joe didn’t like to say that he didn’t have £20! This was a expedition in the wake of, and very much in the mould of the successful 1953 Everest expedition. A long journey by boat to Bombay, then by train to Darjeeling where six tons of gear was divided into sherpa loads. Although the ice fall proved difficult the expedition established camp 4 on the ridge above. Joe acclimatised well, and with George Band was selected for the first summit attempt. The summit was reached by them on 25 th May 1955, although not without some difficulty as Joe had had to climb an overhanging crack in the final wall (the following day Norman Hardie and Tony Streather found an easy way around the obstacle and also reached the summit). At that time Kanchenjunga was the highest summit ever reached by a Briton - Everest having of course been climbed by a New Zealander and a sherpa. It was also probably the hardest climbing done at this sort of altitude until the Everest South West Face expedition some 20 years later\n\nIt was a weekend in April 1956 when Joe and Whillans returned home after making the first ascent of the Cromlech Girdle that Joe arrived back to find Ian McNaught Davies sitting in the front room waiting for him. Ian announced that he was off the unclimbed Mustagh Tower in the Himalaya in a fortnight - would Joe like to come? The Mustagh Tower (23,860ft.) had been described as \"Nature’s last stronghold - probably the most inaccessible of all the great peaks, its immense precipices show no weakness in its defence\" (R.L.G. Irving). So described it presented an immediate and compulsive challenge. This expedition was the antithesis of the Kanchenjunga one — much smaller and privately financed by its wealthier participants, although still shipping three tons of equipment. Joe of course could not have afforded to pay, but his credentials from the Alps and Kanchenjunga made him the first choice for lead climber for any cutting edge expedition.\n\nAn exciting flight got them to Skardu (the Dakota had an altitude ceiling of 13,000 much the same as some of the passes it needed to cross) which was followed by a walk up the Baltoro glacier. Much of the tower proved to be very friable, with sections of Alpine grade V climbing. At 23,000ft. a diversion onto the North face was required to turn a steep rock band. Above a short ice pitch they found themselves climbing unbelayed in deep unconsolidated snow for two pitches before finding a rock belay. Several false summits led to the true double summit. This came as a surprise as they hadn’t realised that it was not a single distinct peak. Not sure which was the higher they attempted to cross between the two. Joe fell through the cornice at this point and was left with legs dangling 7,000ft above the glacier below. In the face of such dangerous snow conditions and incredibly tired they abandoned their attempt to reach the other summit and retreated, biviouacing 200ft. below the summit. On the way down the following day they passed Tom Patey and John Hartzog making their summit bid - which, given better snow conditions, they achieved, reaching both summits, just six days before a French expedition reached the top via the South ridge of the mountain.\n\nOver the next few years Joe continued to put up grit test-pieces such as The Rasp (E2,5b) on Higgar Tor, and the Hanging Crack (now E2,5b, but some aid originally used) on Dovestones Edge; then there were the usual round of trips to Wales, The Lakes, Scotland and the Alps. On Cloggy he continued to produce hard, quality routes with Taurus (E4,5c) climbed with Whillans in 1956, and one of the earliest routes of this grade; The Mostest (E2, 4a,5a,5c,3a) and November (now E3, 5a,5c,5a, but originally aided with chockstones) in 1957, Shrike (E1 5c,5b) in 1958 and Woubits Left Hand (E3, 5b,5b,6a) in 1959. But the Rock and Ice seemed to have lost some of their drive as members married or moved away.\n\nIndeed, Joe himself was married on 17th February 1957 to Valerie Melville Gray a primary school teacher, and inevitably also a member of the climbing fraternity, for nobody else could have understood or accepted the way of life that Joe and his contemporaries had established for themselves.\n\nIn 1959 Joe was approached to take part in a safety film titled ‘Hazard’ which was intended to get its message across through the medium of climbing. This was too good an opportunity to miss, offering five expenses paid weeks in the Dolomites. While there, Joe and Don Roscoe attempted the major Cassin Route on the Cima Grande, but ill-equipped and without a guidebook they failed to realise its seriousness. A major electric storm accompanied by hail hit them when part way up and they were forced to bivouac in sodden clothing. Retreat was the only option, but because of the overhanging nature of the climb they had to down climb pitches, since abseils would have risked them becoming marooned in mid-air on the end of the rope. Eventually, on vertical rock they started to rappel, passing another party on the way up. This retreat in itself caused a stir as it was not generally considered possible. Only one other party had ever attempted retreat from so high on the face, and they had suffered a fatality in the process.\n\n1960 saw the birth of his first daughter, Helen. This year also marked a change in direction. For the past seven or eight years Joe’s aspiration in Wales had centred on Cloggy. Like Cox before him he had grown to know the cliff intimately, but had worked it out at the standards of the day. Some variety was needed. Although not matching Clogwyn D’ur Arddu in scale or ambience Tremadog nevertheless has some advantages. It is a user friendly crag, being situated immediately beside the road, offering rock with good friction, a variety of climbing, and a far drier climate (it also doesn’t\n\ntake drainage so dries quickly) than is found in the mountains, although only 20 miles from Snowdon. And, above all, at this stage it still offered plenty of scope for exploration. Joe’s first visit was in March 1960 Joe, lured there by climbing partner Claude Davies. Immediately Joe established two crack climbs that were destined to become classics of the crag, Leg Slip (E1, 5a,5b) and First Slip (E1, 5c,4c). Vector (E2, — another classic that weaves an unlikely way through overhangs - was accomplished next, over two visits, the first with Trevor Jones, the second with Trevor and Claude Davies. Both fell off at the first overhang - Claude was able to regain the rock because of a runner above him. Trevor, coming last, was not so lucky since Claude had removed it, and he was left hanging in space. Much to his frustration he had to be lowered to the ground; so missing out on the first ascent of what was to become the best known route on Craig Bwlch-y-Moch. Exploration was in the air and the North Wales was scoured for new crags. One offering was Carreg Hyll-drem, a small and viciously overhanging roadside crag where Joe established classic routes of Primus (E2, 4c,5c,4c), Hardd (E2, 5c,4b) and the Girdle (HVS, 4c,4b,4b,4c); another was Castell Cidwm where he climbed Dwm (A1,HVS, A1,5a,5a,A1) Vertigo (HVS, 5a,4c) and The Curver (VS, 4c,4c), returning in 1962 with Chris Bonnington to establish Trango (E4, 6a free but originally aided) a photo of which was later used as the Joe Brown shop logo.\n\n1961 saw a return to Tremadog with The Neb (E2, 5b,5c,5c), Nimbus (E2, 4b,5c,4b,5a), The Grasper (E2, 5c,5c) and The Fang (HVS, 5a,5c) all being climbed. In 1961 Tom Stobart was making a film about the Valley of the Assassins in Persia (now Iran) for the B.B.C. and invited Joe to accompany him to gain access to caves high on the cliffs. Disappointingly, although the film was a success, little of interest was found in the caves.\n\nUpon his return from Iran in September Joe commenced work as an instructor at White Hall, Derbyshire’s Outdoor Pursuits Centre at Buxton. Although not a teacher it was held that this was more than compensated for by his abilities. Although this gave Joe the opportunity to spend his working time in the outdoors it also had its drawbacks. One was that now Joe was no longer his own boss and could not accept any invitation he chose for climbing trips. Inevitably within a couple of weeks of starting at White Hall he had asked for 2 weeks leave the following spring to go on a trip to Petra in Jordan where Tom Stobart was working on a further archaeological film. But another invitation to go to Patagonia had to be turned down. Indeed, had he been able Joe could have spent most of the ensuing two years on expeditions! Nevertheless he enjoyed his time at White Hall, and for a time even lost his enthusiasm for climbing. In its place he took up canoeing, enjoying the challenge and thrill of paddling white water.\n\nBy nature Joe has never been overtly competitive, and had no wish to get involved in slalom competition. However, he was once persuaded by Colin Mortlock to go to slalom with him. Paddling in Division 4 Joe immediately gained promotion to Division 3, beating Colin into the bargain! If the will had been there he would doubtless have progressed further, but Joe never bothered to paddle competitively again - perhaps to Colin’s relief. One party piece he developed was the ability to canoe upside down, always guaranteed to make an impression with his students.\n\n1962 saw Joe invited to join an expedition to the Pamirs, partly funded by a Texan businessman to encourage détente between East and West. John Hunt had already led an expedition to the Caucasus in 1958, and a Russian group had been hosted in Britain in 1960. In the event an S.M.C. expedition led by Malcolm Slesser amalgamated with the Alpine Club one to form a British expedition. The regimented structure of Russian mountaineering, the ‘sports plan’ mentality of Russian mountaineers, and indeed the way the British party was treated like a trade delegation, was anathema to the climbers who deliberately tried to flout the system at every opportunity. The expedition was marred both by the incompatibility of the British and their Russian hosts - the former considering the latter reckless in their determination, while the latter considered the former undisciplined and indolent - and by the deaths of Robin Smith and Wilfred Noyce in a fall during descent. After this half the expedition left for home, others including Joe remained. The difference in attitude and the gulf between the groups became obvious on the ascent of Pic Communism (24,590ft.) when Anatoli Ovchinnikov, the Russian leader, announced that \"In the Soviet Union all peoples go to the summit. Peoples who not reach the summit make the climb a failure…The strong will go in front, the weak behind. The strongest of the weak will go at the very back and force the weakest to keep up\". At the summit a short speech was made and medals presented, and the British and Soviet flags flown from ice axes. Fortunately, all the British climbers made it to the top, thus making expedition an unqualified success in Russian eyes. The return trip gave Joe a brief entree in to the world of espionage.\n\nWhile waiting in the airport at Moscow the group was approached by a man who claimed he was a reporter. While their soviet ‘minder’ was diverted he asked Joe to take a small but bright yellow package back to England. Fearing that this could be a trap, and not wishing the whole expedition to end up in the Lubyanka Joe declined, but found the packet thrust into the anorak he was carrying over his arm. Not wanting to expose the man, or indeed daring to say anything Joe boarded the plane with his heart in his mouth, expecting to be challenged at any moment. However, the flight went smoothly, and the plane landed safely. But no sooner were they on the tarmac than a man in a trench coat approached the group saying \"I believe that one of you has something for me\". The package was handed over with Joe still having no idea what it contained, who sent it, or who collected it.\n\nThe 1963 trip to the Alps, arranged with Tom Patey, accomplished a new direct variation on the Greloz-Roch route on the West face of the Aiguille du Plan, a successful ascent of the South-West Pillar of the Dru and another first ascent on the North West face of the Pic sans Nom. Their ascent went smoothly, although the weather deteriorated rapidly on the descent, to such a degree that they were forced to get out the bivi sack and sit out a storm while the hiss of small avalanches passed to either side of them. A pair of Italians attempting the Dru, with whom they had biviouaced the night before, became trapped high on the face. It was five days later before one managed to get down, the other had died in the attempt.\n\nThe following year the same pair returned and on the second attempt succeeded in establishing a new routes on the North Face of the Migot, and the remote West Face of the Petites Jorasses – for a change this turned out to be much easier than they had anticipated and they only to need to use the rope for a couple of pitches.\n\nJust to show the old touch hadn’t deserted him he also once he returned to Britain he returned to Ramshaw Rocks to put up Ramshaw Crack (Now E4, 6a, but originally with some aid).\n\nA new departure for T.V. was the live televised climb. Joe was first invited to take part in a Eurovision broadcast from the South Face of the Midi. It was an interesting experience, with the broadcast commencing in a snowstorm. Because of the tightly worked schedule and the live transmission the climbers had to be in particular places at set times. To do this climbing normally would be difficult if not impossible, given the variability of weather conditions. So the whole thing was a cheat, with the climbers traversing on and off the face between slots, and using the cable car to get higher for later transmissions. Even so, the climbing that was shown was genuinely difficult in the prevailing weather. Back home the BBC approached Joe about a similar broadcast for the following year. He suggested Cloggy, with cameras on Llithrig, Piggot’s and Pinnacle Flake. Unfortunately, the weather was poor, with thick mist, and technical problems dogged some of the best positioned cameras.\n\nHowever, the broadcast was deemed a success, and the BBC began looking for a follow-up to be broadcast at Easter 1966. South Stack on Holy Island off Anglesey was chosen because of the accessibility of the awesome and unclimbed Red Wall. Many climbers had looked at this, but none had touched it. Although the route climbed for the programme was almost entirely artificial (Television Route, A1) it gave Joe a view of the face which seemed to have a continuous crack line. This was good enough to tempt him and Pete Crew to make an attempt later in the year which resulted in the first ascent of Red Wall (E2 4b,5c,4b), followed 4 days later by the ascent of the line he had seen initially, which gave Wendigo (E3 4c,5a,5b,4b).\n\nJoe found out about the much better rock and the possibilities which existed slightly further along the cliffs towards North Stack. After a period when climbing had become less important in his life this provided the impetus he needed to encourage him to further exploration, and he returned frequently climbing a number of now classic routes. The outside T.V broadcast became a feature of the period, with two others in Glencoe and on the sea stack known as the Old Man of Hoy in the Orkneys. Joe, Chris Bonninton and Tom Patey had made the first ascent in 1966, and Joe proposed it as a suitable, indeed stunning location for an outside broadcast climb. It was, albeit a logistical nightmare for the programme makers because of its remoteness! However, the programme gave what is probably the best remembered T.V. spectacular, with an all star cast of Joe, Ian McNaught Davies, Pete Crew, Dougal Haston and Tom Patey on the climbing team and Hamish McInnes, John Cleare, Rusty Baille and Ian Clough on filming. The climb repeated for TV some 15 years later with Joe then teaming up with his daughter Zoe. She was an instant hit with the viewers through her outspoken but cheery manner and immediately was snapped up as a presenter for the children's magazine programme Tiswas.\n\n1966 was also a year of change at home. Val had never been entirely happy living at White Hall, and they had considered opening a climbing shop for some time. Joe had already started making fibreglass climbing helmets, which he thought he could expand into more of a full time business. A suitable property was found in Llanberis High Street (the some one as is the shop today), and helped with a loan from Chris Briggs of the Pen-y-Gwryd Hotel, they moved in to a building in need of major repair and complete refurbishment, done by Joe and climbing acquaintances. They opened for business at Easter while Joe was climbing on South Stack for the BBC live outside broadcast. So things came full circle with the scene of many of Joe’s happiest climbing days now on his doorstep.\n\nJoe’s second daughter, Zoe, was also born this year, so with money tight he offered private guiding, made helmets in the back room of the shop and (with extensive help from Pete Crew and Robin Collomb) to publish his autobiography, “The Hard Years” (now available in paperback) which appeared in August 1967.\n\nThe helmets were an immediate success. At that time few designs were available. Most were imported and designed to protect from stonefall in the alps rather than giving the wearer protection if they fell off and swung into the rock. The one British helmet, the Compton, which did give protection in the event of a fall, was heavy and cumbersome, and few chose to wear it. Remarkably, although Joe later sold the business, and it has gone through several hands since, but the helmets have continued to be made until 2005!\n\nAlthough Joe wanted to contribute to business he did not enjoy the adulation that was inevitable if he worked in the shop itself. He therefore remained in the background, doing refurbishment and making the helmets, and later climbing “software” harnesses, tape slings and the like. As the helmet business grew he took on Mo Anthoine to help him. The story goes that testing was done by one of them wearing the helmet while the other him them over the head! As it expanded so new premises were needed and an old stable across the road was bought and converted. Still it grew. At this point it was becoming a fully fledged commercial undertaking, needing constant supervision to ensure the quality standards were maintained. Although Joe was happy working for himself he never wanted the problems of running such a business, and he decided to give it to Mo.\n\nShortage of funds, a young family, and the demands that setting up the business made on him and Val meant that for the next few years Joe did not go on any expeditions. However, in 1970 Mo asked Joe if he would like to join a small group going to El Toro (5710m) in the Peruvian Andes. The expedition, which was sponsored by United Newspapers, had dual objectives, to make the ascent and to try and find a plane supposedly carrying gold that was thought to have crashed on the glacier below. Shortly before the expedition left there was a major earthquake in Peru; debris littered the roads en route to the mountain and the expedition suffered repeated aftershocks. The objective was a splendid peak with an impressive vertical granite face. To one side of this an ice couloir led to the summit ridge. From basecamp they followed a glacier to a camp below this feature. Because the mountain was near to the equator the heat of the midday sun melted the ice, making climbing impossible. The regular routine was therefore to rise early, climb until mid-morning and then descend. By this time water would be gushing down the couloir, and their ice screws would be melting out, making this procedure somewhat risky. By the following morning the ropes left in-situ would be frozen and encased in ice and the ice screws secure once more. At one point a deep crevasse cut across the couloir, and disappeared downwards to the underlying rock 40 feet below. The thought that the entire route below this might suddenly disappear in one of the aftershocks was not one anybody cared to dwell upon!\n\nThe climbing went smoothly and they gained height steadily, in due course emerging from the onto the summit ridge. The snow here was of a type not uncommon in South America, a plating of brittle ice over unconsolidated powder. The climbers moved cautiously up the ridge, overcoming minor difficulties until about 100 feet below the summit. At this point they could clearly see the summit, but although no further technical difficulties remained the state of the snow was such that no one was prepared to risk their life just to stand on the true summit, so the actual summit remained inviolate for another generation.\n\nThe Dinorwic Slate Quarry had closed in 1969. In 1971 Joe, Claude Davies and Morty Smith established the first routes there, Opening Gambit (HVS, 4c, but altered by rockfall and described in the guide as \"a typically bold venture on the biggest slate cliff\") started things and was followed by Hamadryad (E3, 5a,5c,5a,4b, but originally with 2 points of aid) so pre-empting the slate climbing explosion by over 10 years.\n\nIn 1972 Joe was asked by Tony Streather, who had been with him on Kanchenjunga, to help with an expedition to Ethiopia. This was not a mountaineering expedition, but was to reward young helpers for their charity work in the U.K. and foster links with their peers in Ethiopia. In Addis Ababa they were joined by an equal number of Ethiopians, and then proceeded to the highlands in the north of the country. This area consisted of a dissected plateau, with deep valleys within which stood a number of rock towers which were the objective of the climbing part of the expedition. Camp was established on the plateau, so reaching the objective required descent rather than ascent! Unfortunately, shortly after arriving Joe again wrenched his back and immediately became immobile. He knew from past experience that he would remain incapacitated for days if not weeks and would have to be stretchered out. At first this seemed hopeless over such rough ground, with the stretcher party making very slow progress. However, the arrival of a party of local tribesmen completely altered the situation. Five, under the command of a leader carried the stretcher shoulder high and at a jog, covering the ground so fast that the rest of the expedition could not keep up — a quite remarkable feat. On his return to the U.K. Joe at last found a surgeon who was able to diagnose his back problem, and following an operation to remove the offending disc climbing suddenly became easier again, although he did lose some of the flexibility that had been a hallmark of many of his earlier exploits.\n\n1973 saw a return to South America with the Roriama Expedition (9094ft.). Although not very high this prow of rock jutted from the rain forest at the junction of Guyana, Venezuela and Brazil, and had been the inspiration for Conan Doyle’s story of prehistoric survivals in ‘The Lost World’. In fact it could approached easily from the south, coming up a gradual slope, but because of its political significance Guyana were keen to support an expedition that approached from the north. Don Whillians and Adrian were joint leaders with Don, Joe, Mo Anthoine, Hamish McInnes and Mike Thompson being the main climbers. Also attached were a camera team, a radio operator, a doctor and a several officials. People either love or hate the jungle. Joe loved it; despite the wet, the scorpions, spiders, snakes and myriad other nasties that inhabited it he found things of interest everywhere. The climbing started only beyond camp 6 after a nine day walk-in. The prow itself was 1500ft. of vertical or overhanging sandstone. Much of the climbing was artificial, and almost without respite, although one camp was established in hammocks halfway up the face. Mo, who loved pegging, led the largest part of the route, and the four of them finally emerged on the top to find it a flat, but dissected area of bare rock.\n\nIn 1975 Joe led an expedition to Trango Tower (20,500ft.), a rock spire beside the Trango Glacier, a tributary of the Baltoro Glacier in the Karakorum. Mo Anthoine had made most of the arrangements, and the other lead climber was to be Martin Boysen, one the leading rock-climbers of his generation. The team was inexperienced at organising Himalayan trips, but soon discovered the frustrations and bureaucracy that besets all Himalayan trips. They suffered unanticipated delays, then a shortage of porters, then porter strikes and go-slows, which together resulted in the team reaching the mountain with less than three weeks of the trip left. The final straw came when Martin trapped his knee in a crack about half way up the tower. Eventually he released it, but it suffered considerable damage. With him ruled out of the climbing team the expedition ground to a halt.\n\nThe objective was a good one so the following year a return trip was arranged, with Jim Curran and Tony Riley coming along this time to film the ascent. With the experience of the previous year things ran more smoothly. Base camp was established on the glacier then advanced base at the foot of the tower itself. Old fixed ropes were replaced and the first camp established at a snow patch one third of the way up the face. Martin did battle with the infamous crack from the year previous and this time won. Above were two more days of hard climbing giving out eventually on to the snowy shoulder of the tower. Fittingly Mo and Martin made up the first summit party, with Joe and Malcolm Howells ascending the fixed ropes to the top in increasingly unsettled weather the following day. At the time, and indeed for a decade after this route rated as some of the hardest rock climbing ever achieved at such an altitude. Indeed, the Tower did not see another successful ascent for 11 years.\n\nNepal was the destination of Joe’s next trip, in 1977, although this time he was involved in supporting a BBC television expedition mounted to hunt for the Yeti. Despite weeks spent travelling the area no incontrovertible evidence was turned up. In 1978 Joe, partnered by Davy Jones was beaten (by Mick Pointon and Phil Kershaw) by a matter of hours to the first ascent of what is perhaps Wales finest ice route (at least it would be its finest, if it formed fully!) — the Devil’s Appendix in Cwm Idwal.\n\nIn 1979 Joe was involved in two trips. The first was with Hamish McInnes and Yvon Chouinard to South America. Hamish had come across a well documented tale of native gold hidden at the time of the Spanish conquistadors, a story that was backed up with a map purporting to show its location. Although they knew that the chance of finding the treasure was remote this was combined with a plan to climb Cotipaxi (19,347ft.). At first the details of the map could be followed, and features related to the topography. Like all the best quests they crossed a plateau of the quaking bog before reaching an area of dense arrow grass. This grew so closely that the only means of progress was for one of them to stand with arms outstretched and palms together while the next man pushed them forward through the grass. But it quickly became evident that they were not sufficiently equipped or supported to make much further progress here. By climbing onto the ridge tops travel became much easier — indeed other animals had created paths there — and they spent some days exploring their surroundings. Among discoveries was an old mine by a black pool. Years later a large and extravagantly equipped American expedition on a similar quest discovered and dived this pool and recovered some Mayan gold objects, although not the large treasure for which they were searching. For Joe's group the second objective was Cotopaxi. Local information was that, given familiarity with the area some people had managed to climb it in a weekend trip from Lima. They hired a jeep for two days and drove as high as they could and then walked up to an unoccupied mountain hut. After a few hours sleep they again set off for the summit, making fast progress. This was reached without problem, they descended, and amazingly returned the jeep within 24 hours of having hired it!\n\nThe second trip that year was to Brammah 2 (21,079ft; 6425m) in the Kistwar. As has often happened Joe was invited to join an expedition which had already been planned. None of the expedition members had actually visited the area so the objective had been selected unseen, mainly because it was one of the highest summits of the region. The route chosen was an unclimbed line via the S.W. col. The walk in, which involved several days slog up the glacier, gave sight of numerous splendid towers which would have provided excellent alpine style objectives, while Brammah 2 itself proved a disappointment. Although higher than the towers it was a rounded dome which offered little in the way of technical challenge, but was guarded by complex crevassed snowfields. Under the prevailing conditions of heavy snow cover route-finding through these proved very difficult and frustrating, and the expedition ground to a halt without reaching the top.\n\nThe year after Joe, Hamish McInnes and Mo returned to the Llanghnates rain forest in South America, this time with a larger group which included local guides, and equipped for an extended expedition. Again peaks, quaking bogs and other features could be related to the treasure hunter’s map. This brought them to the edge of the rain-forest. The transition was abrupt and total. Suddenly visibility was reduced to only a few feet, and progress slowed to a crawl. The natives had abandoned them so all their supplies now had to be carried in relay. Generally two members would cut a path through the forest, while the others ferried the stores. Progress was slow averaging only 2 miles a day, and the denseness of the vegetation meant that they could have passed within feet of the treasure without seeing it. After 42 miles and 21 days they emerged at a river on the far side of the forest. This provided an easier and faster means of travel and they following it, soon reached a native village. Although the expedition had been a failure in terms of its objective no one had really expected to find the gold, and Joe actually remembers it with great fondness, as one of his most enjoyable expeditions. Indeed, so much had they enjoyed it there they decided to return for a shorter trip the following year, but this time accompanied by Hamish’s girlfriend and Mo’s wife Jackie. But, as can happen, the magic of the previous occasion was not there and could not be recaptured. This time they started from the village where they had emerged from the forest the previous year. Following the river upstream from here they reached a track into the jungle that led to the remains of buildings discovered since their previous visit.\n\nA characteristic of most of Joe's expeditions is that it is the company that matters, not the objective. Certainly charismatic objectives and new routes add appeal, but despite his immediate success on Kanchenjunga, large expeditions to the highest peaks have never really held the attraction for Joe that they have for some mountaineers such as Sir Chris Bonnington. The expedition to Thalay Sagar (22,650ft.; 6904m.) in 1982 was typical. Only four climbers were involved - they all knew each other, and were not relying on commercial sponsorship to pay for the trip. It was thus more like an extended holiday with a group of friends — on this occasion Mo Anthoine, Clive Rowlands, Malcolm Howells and Bill Barker. The mountain itself was unclimbed, and their selected route, on the north flank, looked as though it had a fair amount of technically difficult climbing in the upper sections. They approached via the glacier from which the Ganges emerges, which is, for that reason, a place of pilgrimage for Hindus. The roads were crowded and busy right to the glacier snout where a hermit held sway over the emerging river. The expedition established base camp higher up, and then climbed through an icefall to reach the back of the cwm. From advanced base camp here they ascended a long steep snow couloir that eventually brought them to a col on the ridge that links Thalay Sagar to Briguparth. Another camp was established at this col. Although ropes were fixed to this point above they climbed alpine style, without fixed ropes and camps. The ridge proved far from easy, with pitch after pitch of V.S. standard climbing, and little respite. Eventually a small snow patch provided just enough space for the final camp to be established. Joe until now had done nearly all the leading, and was feeling tired from the effort he had expended. It looked as if one more day would bring them to the summit. The following day Mo was feeling unwell and remained at the camp, but the other four set off up the snow ridge. Near the top they reached what they thought would be the final obstacle, a steep wall with an overhanging crack rising from its base. This looked hard. Joe had been seconding, but at this point the others all declined the lead. Joe put in a final big effort to overcome the crack and reached a ledge above. From here the obvious way ahead was a traverse along the ledge to an easy looking corner crack, but Joe felt he had done his share. He called down for back-up. But nobody came forward. Perhaps they were diffident because they thought that if Joe was now calling for assistance what lay ahead of him must be harder than the crack he had just surmounted with great difficulty! Without support Joe had no options left. He retreated and they returned to their last camp. Overnight the weather broke, and they all descended the following day. The weather continued bad for the next four days. The fixed ropes soon disappeared under snow and after sitting out storms on the glacier for several days more they retired from the mountain. Joe felt cheated - he knew that they had almost finished the route, and the summit was within their grasp - indeed, more help when it was needed or just one more fine day would have made all the difference. He and Mo resolved to return.\n\nThe next year they returned alone, hoping to re-use their fixed ropes and quickly regain their high point. This time they brought a camera loaned by the BBC to record their progress. Things were very different this year. The couloir was much deeper in snow, and their ropes from the previous year had disappeared under maybe twenty or thirty feet of fresh powder. Excavating them was out of the question, so new rope was fixed as they made slow upward progress for about 500 feet. Here they left the camera and other equipment overnight and returned to their camp at the base of the couloir. Overnight the weather deteriorated, and a storm hit them. It snowed heavily and continuously. Eventually Joe concluded that the monsoon must have arrived unusually early, and that further climbing that season would be out of the question. They decided to abandon their attempt, but there was a small matter of a very expensive BBC film camera 500ft. up the couloir. They tossed a coin and Joe lost. Reluctantly he climbed the snow filled gully, throwing things down to Mo and eventually returning with the camera. They left, disappointed. Later that year the mountain was climbed for the first time.\n\nIn July 1984 Joe was involved in the second outside broadcast from the Old Man of Hoy in Orkney. By 1983 cameras had become much lighter and could be carried by the climbers rather than having to have a separate film team. This time Joe climbed with his daughter, Zoe, then a very bubbly 17 year old. She was an immediate hit with viewers, and from that sprang her career for the next few years as a children’s programme presenter. In the course of this programme Joe became friendly with Mike Begg a producer for the BBC. From this friendship a number of other programmes were born, the best remembered probably a series of short films entitled \"Fishing the Hard Way\", which brought together Joe’s two great loves, climbing and fishing. It involved Joe reaching some unlikely inaccessible fishing pools using climbing skills and techniques. A feature of the series was that he never seemed to catch a fish — at least not on camera, although he swears that he had more success when the cameras were off!\n\nIn 1983 Joe also took time out on an African holiday to climb Mt. Kenya.\n\nIn 1985 Joe (along with Hamish McInnes and Mo Anthoine) was engaged as safety officer for the filming of \"The Mission\"; a film about conflict between a Jesuit priest and a 17th century slave trader set against a South American background. The work involved safeguarding the actors, occasionally doubling for them (Joe doubled for Robert de Niro) and preparing rock for stunts. Although much of the action apparently takes place in the middle of the jungle, in fact the waterfall used was situated just below a luxury hotel, which was the base for the film crew. At one time a concrete walkway had crossed the wide river above the falls from the hotel. This had been washed or fallen away over the years, but the stunt crew together with the safety officers decided it would be fun to try and make a crossing back to the hotel from the far side. It was necessary to wade up to chest depth to get from island to island. All was going fine until on one sandbank, Joe, who was leading, came face to face with a large cayman - the South American crocodile. Fortunately the beast decided that it was no match for Joe, and slipped away into the water. However, the group were now marooned on an island a quarter of a mile from either bank, now knowing that the rivers was cayman infested! They decided to press on, only to be halted a hundred yards from the hotel lawns by the deepest and fastest flowing part of the river. There was no alternative but to retrace their steps the whole way to reach the bank from which they had started.\n\nJoe enjoyed the summer, both for the company, and the games they played, and got paid for it too! As result he has worked on several further films - the James Bond film \"A view to a Kill\" (when he was involved for several weeks in arranging a single spectacular stunt where “James Bond” skies down an alpine slope and jumps down into a 80 foot crevasse), \"Rambo\", filmed in Israel in 1987 and Fred Zinnerman's \"Five Days one Summer\" again in the Alps.\n\nIn 1985 Joe received an invitation to join an Everest expedition that was to attempt the N.E. Ridge from the Chinese side. Any expedition attempting this route was going to be pretty big. Although Joe had of recent years only been on small informal expeditions, the chance to see for himself the scenes described in all the Everest books he had devoured so eagerly as a boy outweighed his reservations about large expeditions, and he accepted readily. The expedition was led by Brummie Stokes, who, although he served in the S.A.S. came to mountaineering without the usual military outlook. As a precursor he had managed to get some free flights to Alaska for the team to train. Thus 1985 saw Joe, Mo, and Brummie on Mt. McKinley (20,340ft.). Their initial route was the voie normal - a route which follows the glacier to 14,000ft before traversing 1000ft. diagonally up a large icefield to reach the shoulder of the mountain at 17,000ft. Although the traverse is exposed the route is not of great technical difficulty. This ascent went without incident, and gave Joe and Mo an opportunity to cache some food for a planned later ascent. Clive Rowlands, John Fresh and Davy Jones arrived shortly after Brummie left and the new team set off, this time for the Cassin Ridge, a five day route of considerably more technical interest. The summit was reached successfully although their cache of food had unfortunately disappeared, and they had to beg food from another expedition, who were well supplied.\n\nThe 1986 Everest expedition approached from the northern side, following in the footsteps of the pre-war British expeditions, and visiting such places as the famed Rongbuk monastery. Once on the mountain itself life became much more intense, with a long hard climb between advanced base and camp one, which had to be done over and over again. Joe, as had always been the case, acclimatized easily, and paired with Mo spent a lot of time load carrying at around 24,000ft. As time went by the weather deteriorated, the winds increased and the jet stream gradually extended down the mountain. Indeed, Joe spent one night alone in a tent wondering if it (and he) would still be there in the morning or if all would be whisked away by the wind and end up flying over the Kangshung Face! Unfortunately, once again the weather had beaten them. On popular Himalayan peaks there is always a great problem. Their popularity means that many expeditions have to accept less than ideal time slots, but simply by doing this they hugely reduce their chances of success as the likelihood of adverse weather is so much higher.\n\nThe following year, 1987, Joe was on expedition to Latok 2 (also known as Latok West, 23,319ft.; 7,108m.). The approach was as usual, up a glacier to establish a camp near its head. From there was a rising traverse to a camp established on the ridge. From here the route followed the ridge turning the pinnacles to the foot of the summit pyramid. A camp was established here. Joe led what proved to be the crux pitch of the ascent which started with an almost vertical chimney excavated in deep and poorly consolidated snow. At the top he was able to get a sound rock belay, and they placed a fixed rope on the pitch. Above the climbing proved somewhat easier, following ledges and chimneys to a high camp. Once this was established the party were in a position to make a summit attempt. Again Joe took the lead, making steady progress and fixing ropes on difficult sections for later. As the day wore on the weather deteriorated yet again, and they finally decided to return to the high camp. It continued to snow for 36 hours, at the end of which they decided that there was no alternative but to retreat to a lower camp. Even this was not easy, as visibility was now very poor, and finding the end of the fixed ropes took some time. Once down the technical section of the route they made faster progress and reached the glacier by nightfall, again beaten by the weather. 1998 saw a return to Everest. The team was similar to the 1986 one, with Russell Brice and Harry Taylor as lead climbers. But as in 1986 they suffered another failure in the face of poor weather.\n\nIn 1990 Joe joined an expedition to Cho Oyu, (25,905ft. 8,201m) the sixth highest mountain in the world, and accepted as the easiest of the 8,000m. peaks if it is climbed by the standard route. One of the aims of the expedition was to allow two paragliders to fly off the summit, and thus establish a tandem paragliding height record. There was little technical difficulty involved in the ascent, which climbs steadily to a ridge below the summit plateau. A camp was established here from which Russell Brice, Harry Taylor and one of the paragliders made a summit bid. In fact only Russell reached the summit, which involved a straightforward but very tiring walk across the summit plateau at over 8000m. In fact the visibility was so poor he was not even able to say categorically that he had stood on top of the highest point, but only that he had gone the appropriate distance in the right direction and stood on the highest lump he could see. He rejoined the others it to discuss their next move. If two were to make a tandem descent then one of the three was going to have to walk down alone. The solution was simple – a three-man descent — so establishing not just a tandem, but a triple paragliding height record! They went for it and remarkably reached base camp without incident. It was at 7,000m. on this expedition 4\n\nJoe came to a decision. High altitude mountaineering was now too much hard work. He was used to going better than his companions at these heights, but now, at 60, age was catching up with him and he was no longer the fittest. This was to be his last major expedition.\n\nSince 1990 he has by no means stopped climbing. He still climbs, although not so regularly since he passed 70, and still has a thirst for cliff exploration and new routing. For the past decade he has visited Spain (mainly the Benidorm area) and Morocco frequently. But the popular sports climbing routes hold little in the way of excitement as the line is pre-determined. His love is to follow a natural line on a large cliff, and almost all his climbing has been on new multi-pitch routes up to 1000ft. in length, often at around 5a standard, although he can still climb the odd 5b pitches if no easier option presents itself. These routes, done with friends of long standing, such as Claude Davies, Les Brown, Pete Turnbull, and Derek Walker, are often not written up (Although Claude Davies has recently published a guide to Morocco), and have left with no visible trace of their passage so others can rediscover them in the future.\n\nLocally his most recent first ascent was when he seconded Davy Jones on The Last of the Summer Wine (E4, 5b5a,5b,5b/c) on Red Wall at Gogarth, in the autumn of 1999.\n\nIn Britain he has over the years also had fun skateboarding and at one point got into white water rafting. Fishing, particularly flyfishing has long been a major hobby; a collapsible fishing rod has accompanied him on most expeditions. Until 1995 he also personally made some of the Joe Brown harnesses and climbing tapes sold in the Joe Brown shops! The one thing he has always shunned is any form of self-publicity, giving lectures or after dinner speeches.\n\nUpdated 15 February 2006\n\nWritten by Ollie Burrows"}, {"url": "https://teara.govt.nz/en/biographies/5b46/brown-andrew-joseph-francis", "page_content": "Brown, Andrew Joseph Francis Mechanic, entrepreneur, entertainment promoter, businessman, racehorse owner This biography, written by Jim Sullivan, was first published in the Dictionary of New Zealand Biography in 2000.\n\nAndrew Joseph Francis Brown (known as Joe) was born at Naseby, Central Otago, on 3 October 1907, the son of goldminer George Bernard Brown and his wife, Mary Josephine Downes. He attended Naseby School, and later recalled that he was ‘a bad fellow’, failing the proficiency examination more than once. But while there he had his first success in business when he organised a dance to raise funds for the school rugby team. He later went to the Christian Brothers’ School in Dunedin, where he passed proficiency, and then began a motor mechanic apprenticeship with Cossens and Black.\n\nAs a young man Brown suffered a serious back injury playing rugby, and for the rest of his life he wore a brace and walked with a stoop. After eight years as a mechanic he lost his job, and during the depression he earned a living selling fruit and vegetables from a bicycle. In 1936, sensing a need for after-match entertainment during the Otago rugby team’s long tenure of the Ranfurly Shield, he decided to organise a dance in the Dunedin town hall. To raise the £36 needed to float the venture, he borrowed money from his family to buy dogs and a ferret and went rabbiting in Central Otago. The first dance, on the night of the Otago–Southland shield game, made a small profit, and although the second made a small loss, he believed he was on to a winner.\n\nWhen the commercial radio station 4ZB was established in 1937 Brown arranged for the town hall dance to be broadcast, and over the next 30 years it became a national institution through live radio broadcasts. A crowded meeting place for hundreds of Otago couples, it was often called ‘Joe Brown’s matrimonial agency’. He met his own wife, Marjorie Alice Wallis, at one of the dances. Married in Dunedin on 24 March 1945, they were to have two sons and a daughter.\n\nBrown and his family capitalised on the success of the dances by establishing other businesses, including tearooms at Highcliff, a catering business for weddings, a furniture store to serve young couples setting up home, a pram- and cot-hire business and, eventually, a property development scheme that led to probably the region’s first ‘Parade of Homes’. He also became a racehorse owner and trainer on a small farmlet at Janefield, near Mosgiel. He had his first win with Moon Raider in 1940 and gained a reputation for making something of unlikely horses. His successes included a win in the Wellington Cup and a third placing in the Melbourne Cup, both in 1952 with Reformed.\n\nBrown was enthusiastic about providing what he called ‘good, clean, family-based entertainment’. His first national venture was the 1959 Search for Stars, which attracted 3,000 entries and saw the emergence of many successful entertainers, including John Hore (later Grenell), Dinah Lee, Bunny Walters and Eddie Low. His skill at predicting public taste led to tours by many overseas artists, although at least one, a 1964 comeback by pre-war child star Bobby Breen, was not a success.\n\nJoe Brown became best known for staging the Miss New Zealand Show, holding the franchise from 1960 to 1973 and again from 1979 to 1986. Intended as family entertainment, the show gained in popularity from 1963 with the regular involvement of the Howard Morrison Quartet who, along with other artists, had their music released on Brown’s record label. From the early 1970s, however, the show was picketed by feminists. Brown was unrepentant, claiming that ‘I have been criticised for exploiting women, but I believe I have been liberating them for years’. In all his show-business ventures he was a hands-on operator, acutely aware of the value of publicity and gimmicks to promote his shows, and quick to capitalise on the latest fads, such as the hula-hoop craze.\n\nHe was a Mosgiel borough councillor, and a member of the local milk authority, the Taieri athletic and swimming clubs, and the management committee of Mosgiel District High School (now Taieri High School). In 1970 he was awarded the British Empire Medal. Regarded in his time as New Zealand’s leading show-business entrepreneur, Joe Brown continued working until shortly before his death at his Janefield home on 23 August 1986. He was survived by his wife, a daughter, and son Dennis, who took over his entertainment business."}, {"url": "https://www.climbing.com/news/legendary-british-climber-joe-brown-dies-at-age-89/", "page_content": "Heading out the door? Read this article on the new Outside+ app available now on iOS devices for members! Download the app.\n\nOn April 15, the legendary British climber Joe Brown passed away in his home at the age of 89. Brown was at the cutting edge of rock climbing and mountaineering in the 1950s and 1960s, not only for his ascents, but for his vision, technique, and gear. Brown put up countless first ascents in the United Kingdom, including classics such as Cemetary Gates, Cenotaph Corner, The Unconquerables, Valkyrie, Elder Crack, and Great Slab, to name a few. He was also on the first ascent of Kanchenjunga, the world’s third highest peak.\n\nhttps://www.instagram.com/p/B_CZUipj4IY/\n\nBrown came from humble means, a stark contrast to the long history of aristocratic English mountaineers. He was born in 1930, the youngest of seven children. Brown’s father died from complications related to a workplace accident when he was just eight months old. The Great Depression hit the family hard; their mother worked as a cleaner to support the brood of children. During World War II, German airstrikes decimated the Browns’ home in Manchester.\n\nIn his youth, Brown was drawn to the outdoors. He would camp and hike on the outskirts of the city, and took up climbing as a teenager in the Peak District, taking naturally to gritstone. In 1951, he met Don Whillans while climbing at the Roaches in the Peak District. They became longtime partners, putting up countless first ascents together in the UK, as well as a number of ascents in the Alps. Having made a name for himself as a strong and reliable climber, Brown was recruited by Charles Evans in 1955 to join an expedition to climb Kanchenjunga—at 28,169 feet tall, Kanchenjunga is the third highest mountain on Earth. Joe Brown and George Band reached the Himalayan summit on May 25, 1955.\n\nBrown’s gear shop in Capel Curig, Wales. Richard Smith, CC BY-SA 2.0\n\nBrown was a plumber’s apprentice in the 1950s and reportedly a “jack-of-all-trades.” This handy nature of his could explain his contributions to the world of climbing gear: he was one of the first climbers to use nuts as a means of protection. He would buy nuts (like “nuts and bolts”) from a hardware store, bore out the threads, and use them as chockstones. Brown opened a climbing shop in Snowdonia, the northwest region of Wales, in 1966 where he manufactured and sold climbing equipment. His shop has since expanded to three locations with an online presence. Brown is survived by his wife, Valerie, and two daughters, Helen and Zoe.\n\nVideo: Watch Joe Brown and partner Don Whillans climbing in 1985:"}]}