{"After his major league career ended, Joe Brown continued to play in the minor leagues until 1915.": [{"url": "https://sabr.org/journal/article/joe-e-brown-a-clown-prince-of-baseball/", "page_content": "This article was written by Rob Edelman\n\nThis article was published in The National Pastime (Volume 27, 2007)\n\nYou will not find Joe E. Brown’s name in a major league box score. But in his way, he is as much a part of baseball lore as the Gas House Gang, the Whiz Kids, and the House That Ruth Built.\n\nJoe E. Brown was a movie star: a wide-mouthed co­ median whose face was his fortune. The zenith of his popularity came in the 1930s, when he appeared in a se­ries of hit comedies produced by Warner Bros. Three of them-Fireman, Save My Child (1932), Elmer the Great (1933), and Alibi Ike (1935)-featured Joe E. as comical baseball players. Moreover, Brown was around the game all his life. He played baseball. He loved baseball. And he was a vigorous proponent of the game.\n\nJoseph Evan Brown was born on July 28, 1892, in Holgate, a small town in northwestern Ohio. His parents were warm and loving but desperately poor, and young Joe E. was determined to abandon his roots and embrace a life of adventure. “I remember when I was a little guy going to school, stopping to look at a big 24-inch sheet announcing the arrival of the circus,” he recalled in 1963. “Another boy was with me. I pointed to the aerial act and said, ‘That’s what I’m gonna be.’ I remember it clearly. I didn’t say, ‘That’s what I want to be.’ I said, ‘That’s what I’m gonna be.”‘\n\nAnd so, at the age of nine, Joe E. lived out what for other youngsters would be a storybook fantasy as he left home to join the circus. He became the junior member of The Five Marvelous Ashtons, an acrobatic act that toured the country performing under big tops and in vaudeville theaters. He earned $1.50 a week for the honor of being tossed through the air, and often being bloodied. As he grew into adolescence, Brown developed into a solidly proficient acrobat. While playing a date in San Francisco, he experienced firsthand the 1906 earthquake. It was around this time that he linked up with acrobats Tommy Bell and Frank Prevost and became the junior member of the Bell-Prevost Trio, a vaudeville act.\n\nDuring this period Brown managed to play baseball whenever he could. He wrote in his autobiography, Laughter Is a Wonderful Thing, that his passion for the game “predates my first days at school, of that I’ m sure, so it probably began when I learned to walk.” In his youth, he explained, he\n\nbegan haunting the knotholes around big league ball parks when 1 wasn’t on stage or practicing. And in the spring, after a season of sore ankles, skinned wrists, and broken legs, baseball as a career held more than a casual interest for me.\n\nIn 1908, Brown decided that he would seek summer employment as a ballplayer. Tim Flood, manager of the St. Paul Saints in the American Association, signed him as a second sacker, but his season ended abruptly when he broke his leg while sliding into third base. During the next few summers he played for various semipro teams in the Toledo, OH, area, including the Crowley All-Stars, Young Avondales, and Needham’s All-Stars. One of the many baseball-related photos printed in his autobiography features a serious-looking Brown, with arms folded, garbed in a Crowley All-Stars uniform and posing with a dozen teammates.\n\nIn 1911, when he was 19, Brown was offered a Boston Red Sox contract. At the time, he also had a lucrative offer to appear in a burlesque show. He already had spent a decade in show business, and realized that his best chance for long-term success was on the stage. So burlesque won out over baseball.\n\nOn Christmas Eve, 1915, Brown wed Kathryn Frances McGraw. The couple eventually became the parents of two sons and two adopted daughters. As Joe E. now had a family to support, his career choice was appropriate given his now-steady employment on the stage. By this time, he had morphed from acrobat to comic actor. On occasion, he even incorporated baseball into his stage act. The New York Times described one such routine, in which “a young pitcher [is] harried by batters, umpires and base runners.” Brown often quipped that he\n\nonce had a major league job. The manager wanted me to play third base. He said that ifT couldn’t reach the ball with my hands, I would open my mouth and catch it between my teeth. I tried it once and darn near swallowed the ball.\n\nHis Great White Way debut came in Jim Jam Jems (1920), and he spent the decade as a headliner appearing on Broadway and touring in stage shows. But he was not through playing baseball. In 1920, Brown worked out and appeared in exhibition games with the Red Sox.\n\nThroughout his career, newspaper or magazine pro­ files of Brown invariably cited his love of baseball-and his talent for playing the game. As far back as March 1921, the Boston Globe reported that Brown “has recently received an offer from the New York Americans to play with the team this year.” The actor added,\n\nAt one time I played [semipro ball in Toledo], but an accident to my arm made it necessary for me to give it up. Since then I have received many offers to go back into baseball but it would be rather foolish alter I had started a successful career on the stage.\n\nWhile a fine athlete — his athleticism is ever apparent in his baseball films, as he tosses balls and belts line drives without the aid of special effects or body dou­bles — it is debatable whether Brown possessed the talent to sustain a major league career. During a moment of candor in a 1937 interview, he even admitted, “[There] are a lot of stories about my baseball playing, but most of my big-league experiences happened in the imagina­tion of various writers.”\n\nBrown’s celebrity status, however, did allow him to maintain his insider access to major leaguers. On April 18, 1922, the Boston Globe reported, “The Red Sox and Yankees occupied boxes last night at ‘Greenwich Village Follies’ at the Shubert Theatre as guests of Joe E. Brown, the principal comedian in the show.” The item concluded by noting that Brown “was formerly a profes­sional baseball player.”\n\nBy this time Brown’s calling card was his face rather than his physical aptitude. A Boston Globe profile of the comic began: ‘”Did you ever see anything so funny as that man’s expression,’ exclaimed a woman in the audi­ence at the Wilbur Theatre… as she gazed upward at Joe E. Brown, comedian of’ Jim Jam Jems.”‘ The article continued, “He has a comic style particularly his own, and not the least part of his success is the expression of his countenance. He doesn’t have to say a word to get a laugh.”\n\nNevertheless, the nature of Brown’s comedy primarily was physical-and it was a wonder that he did not become a silent cinema comedian. His screen debut did not come until the dawn of the sound era, in Crooks Can’t Win (1928), an inauspicious melodrama. He quickly established himself, however, upon signing a Warner Bros. contract and appearing in a series of come­ dies in which he alternately played two character types, both of whom were rubes. One was self-centered, with a mouth that was figuratively and literally big. The other was more shy and naive.\n\nBrown’s three baseball films were especially popular. The first was Fireman, Save My Child, in which he starred as “Smokey” Joe Grant, an absentminded, Rube Waddell­ like small-town firefighter whose pitching prowess earns him a spot with the St. Louis Cardinals. Just as he was starting his screen career, Brown had been cast in the road production of Elmer the Great, Ring Lardner and George M. Cohan’s stage comedy about a none-too­ bright hurler (originally played by Walter Huston) which opened on Broadway in 1928. Jack Oakie starred in the first screen version, titled Fast Company (1929). Brown was tapped for the remake, in which his character, Elmer Kane, is a small-town rube/home run hitter who plays for the Chicago Cubs and falls for a flighty actress. Finally, in Alibi Ike, Brown played Frank X. Farrell, a fireballing Cubs rookie right hander who is as brash and overconfident as he is talented.\n\nWhen Warner Bros. decided to sign him to a contract, Brown asked the studio to provide him with his own baseball team. It was written into his contract that Warner Bros. would pay for the team’s uniforms, equip­ment, and travel expenses. The ball club was named Joe E. Brown’s First National All-Stars; it consisted of studio employees and former professional players, and was pitted against all-star, semipro, college, and Negro League nines up and down the Pacific Coast. Decades later, Brown described the contract as a “pip.”\n\nAs he settled into his Hollywood lifestyle, the come­dian was at the epicenter of Southern California baseball. In February 1932, he and Buster Keaton-another screen star whose love for baseball was legendary-were involved in an all-star fund-raiser for the Los Angeles Olympic games. Over 8,500 fans packed Wrigley Field to see the Joe E. Browns defeat the Buster Keatons, 10-3. Rogers Hornsby, Gabby Hartnett, Paul and Lloyd Waner, Sam Crawford, Billy Jurges, Stan Hack, Tris Speaker, Dave Bancroft, Carl Hubbell, Charlie Root, Pat Malone, Johnny Moore, and Pie Traynor were a few of the big leaguers who participated.\n\nBrown also was instrumental in getting his baseball pals parts in movies. Frank Shellenback had a supporting role in Fireman, Save My Child; Shellenback and a roster full of ballplayers (Herman “Hi” Bell, Guy Cantrell, Dick Cox, Cedric Durst, Ray French, Mike Gazella, Wally Hebert, Wally Hood, Don Hurst, Smead Jolley, Lou Koupal, Wes Kingdon, Jim Levey, Bob Meusel, Wally Rehg, Jim Thorpe, and Ed Wells) appear as big leaguers in Alibi Ike.\n\nIn 1934, a Los Angeles Times reporter asked Brown, “You didn’t really ask Dizzy and Daffy Dean to accept a picture contract, did you?” His response:\n\nWhy not? They’re fine boys, interesting, natural, lovely characters. When I was sitting next to Dizzy in Detroit [during the World Series], with the fans swarming around him for autographs, he whispered, “Funny, isn’t it? Five years ago I didn’t even own a pair of shoes.” They’re not swell-headed. Besides, Warners wired me to ask them…\n\nThe Dean boys soon were starring in Dizzy and Daffy (1934), a Warner Bros. two-reel comedy short in which Shemp Howard (of the Three Stooges fame) remarks, “The only Dean I ever heard of is Gunga.”\n\nBrown also reportedly-and inadvertently-played a more direct role in the ’34 series. According to the Los Angeles Times, Detroit hurler Schoolboy Rowe “caught part of his pitching hand in a door jamb…and subse­quently had the bruise aggravated by a hearty good-luck hand-shake from Joe E. Brown, the film comedian.”\n\nFrom 1932 through 1935, Brown was a part owner of the American Association Kansas City Blues. In 1935, the rumor circulated that he was considering purchasing the Boston Braves, but this came to naught. Brown organized a semi pro basketball team whose roster was stocked with ex-UCLA Bruins. He owned racehorses, and often could be found at Santa Anita, Hollywood Park, and other Southern California racetracks. His Beverly Hills home housed a trophy room for his rapidly growing collection of autographed baseballs, bats, caps, and other sports memorabilia. He accumulated hundreds of items, from lumber used by Babe Ruth and Nap Lajoie and a cap worn by Eddie Collins to a baseball autographed by England’s King George V, a football jersey worn by Red Grange, Gene Tunney’s and James J. Braddock’s boxing trunks, and a first-edition copy of Henry Chadwick’s 1868 book, The Game ofBase Ball, the initial hardcover baseball tome. Alas, most of the memorabilia was destroyed later in a house fire.\n\nDecades later, Brown recalled that upon learning that Lou Gehrig was about to retire, he wrote the Iron Horse to request the ballplayer’s first baseman’s glove for his collection. “Lou wrote back, asking me to name anything but that, and I understood but I felt bad about having asked,” he explained.\n\nNot long afterward, he retired. In the fall of that year [ 1939] I went to New York to see the Yankees play in the World Series. Just before gametime a batboy came up to me and asked me to come to the Yankees’ bench. Well-Lou was waiting there. He was very ill, by then, so thin and gaunt that I was startled at his appearance. But he smiled and held something out to me — it was his first baseman’s glove. “Here it is, pal,” he said.\n\nBy the late 1930s, Brown’s popularity was waning. He left Warner Bros., appeared in some independent movies, and concluded his starring career in a series of low­ budget Columbia Pictures comedies released in the late 1930s and early 1940s.\n\nBut Brown did not fade from the public eye. During World War II, he proved that his heart was as big as his mouth as he became one of the first Hollywood celebri­ties to volunteer to entertain the troops. Brown trekked to combat zones from North Africa to Italy, the Pacific is­ lands to Australia and New Zealand, bringing laughter to the Gls. He once estimated that he had traveled over 200,000 air miles during the war. Ever the jokester, he quipped, “When I opened my mouth in the South Pacific, 8,000 mosquitoes flew in.” Even though he was a civil­ian, Brown reportedly was allowed to pack a carbine and ride in a tank while on Luzon, the Philippine island.\n\nFor his tirelessness in entertaining the troops, Brown was given a Bronze Star as well as a special citation, voted by the Military Order of the Purple Heart, for his “meritorious service.” However, he and Kathryn person­ ally felt the brunt of the war. Their eldest son, Don Evan Brown, a captain in the Army Air Corps, died at age 25 in October 1942, when his plane crashed near Palm Springs during a training exercise.\n\nIn 1945, as the war wound down, Brown signed to tour as Elwood P. Dowd in Harvey, Mary Chase’s Pulitzer Prize-winning comedy. He opened in Chicago and eventually appeared in the play well over 1,000 times on stages from Broadway to Australia. He also returned to the screen, and gave a highly regarded dramatic per­formance as a small-town minister in The Tender Years (1947). He was ideally cast as Cap’n Andy in the second remake of Show Boat ( 1951), and gave what easily is his best-remembered performance as a loony millionaire in Billy Wilder’s Some Like It Hot ( 1959). Here, as he slyly winks at the camera, Brown ardently romances Jack Lemmon’s jazz musician-in-drag. His closing line­ “Nobody’s perfect”-is one of the more famous in film history.\n\nBaseball, of course, remained an intrinsic part of his life. “Whenever he doesn’t have a matinee, he’s at some sports event,” noted sports columnist Braven Dyer in 1946, while Brown was performing Harvey in Chicago. From 1953 to 1964, he served as first president of the PONY League, comprising teams made up of 13- and 14-year-olds. Long a supporter of the UCLA Bruins baseball team, the school’s Westwood ballyard was named “Joe E. Brown Field.”\n\nDuring the 1953 season, Brown conducted pre- and post-game interviews for the New York Yankees and did five innings of play-by-play-three on television, and two on the radio. Radio-television critic Warren Bennett wrote that Brown was “as relaxed before the cameras as an old shoe. Shy, diffident ball players loosen up for him as they never did for his predecessor, the illustrious Joe DiMaggio.” Brown told Bennett, “What I want to do is talk to the baseball fan who loves the game so much he stands in line to get a good seat.”\n\nIn l955, his 37-year-old son, Joe L. Brown, replaced Branch Rickey as general manager of the Pittsburgh Pirates. But Joe E. remained firmly rooted in Southern California-and as the Dodgers abandoned Brooklyn for Los Angeles, he was well-suited to become a high-profile promoter of West Coast baseball. In October 1957, not long after the team played its final game at Ebbets Field, Brown was the master of ceremonies of a star-studded luncheon at Los Angeles’ Statler Hotel, held in honor of the team.\n\nBrown was among the leaders in the battle for the “Yes” vote that would approve the Dodgers’ contract with the city of Los Angeles, and result in the construc­tion of Dodger Stadium. He became general chairman of the Taxpayers Committee on Yes for Baseball, and pre­dicted that the Dodgers would lure baseball fans from far across the region-particularly if they competed in a spanking-new ballyard. The actor clearly was jockeying for support when he observed, near the start of the 1958 season, “Dodger President Walter O’Malley hopes to admit 300,000 youngsters [free of charge] to Coliseum games this season, and will up the figure to 600,000 when the club builds its own stadium in Chavez Ravine.” He added, “The boy whose idol is Duke Snider or Junior Gilliam can’ t go very far wrong in his future life.”\n\nJoe E. Brown quietly lived out the rest of his life. He died at age 81 on July 6, 1973, of pneumonia and heart failure. Kathryn, his wife of 58 years, survived him. Brown was buried at Forest Lawn Memorial Park in Glendale, which houses the remains of entertainment in­dustry legends from George Burns and Gracie Allen to Humphrey Bogart, James Stewart, and Spencer Tracy.\n\nBrown’s life may be summed up by the title of a classic Hollywood film, albeit one in which he did not appear: It’s a Wonderful Life. “There’s been tragedy, when we lost our boy,” he recalled in 1963. “But l’ve had the chance given every other citizen in a free country of living my life as I wanted to live it and becoming what I wanted to become.”\n\nROB EDELMAN most recently authored the box liner notes and an essay on early baseball films included on the DVD compilation Reel Baseball: Baseball Films from the Silent Era, 1899-1926. He also is an interviewee on several doc­umentaries included on the DVD re-release of The Natural.\n\nSources\n\nBibliography\n\nBooks\n\nBronner, Edwin J. The Encyclopedia of the American Theatre, 1900-1975.\n\nNew York: A.S. Barnes, 1980.\n\nBrown, Joe E., as told to Ralph Hancock. Laugluer Is a Wonde,ful Thing.\n\nNew York: A.S. Barnes, 1956.\n\nEdelman, Rob. Great Baseball Films. New York: Citadel Press, 1994.\n\nNewspapers\n\nBennett, Warren. “Joe E. Brown Bobs Up As Baseball Commentator.” Washington Post, May 7, 1953.\n\nBrowning, Norma Lee. “Baseball ls Still the Big Love of Joe E. Brown.” Chicago Tribune, September 28, 1966.\n\nDavis, Jr., Charles. “Relives Baseball, Movies: Joe E. Brown Celebrates 1-lis 72nd Birthday as Past Meets Present.” Los Angeles Times, July 28, 1963.\n\nDyer, Braven. “The Sports Parade.” Los Angeles Times, August 16, 1946. Gould, Alan. “Dizzy Dean Pitches for Cards Today.” Los Angeles Times, October 9, 1934.\n\nHenry, Bill, “Hollywood in Sport: Joe E. Brown Most Beloved Sportsman.” Los Angeles Times, February 28, 1937.\n\nMeagher, Ed. “Joe E. Brown Dies at Age of 81 at His Home in Brentwood.” Los Angeles Times, July 6, 1973.\n\nMillones, Peter. “Joe E. Brown, Comedian of Movies and Stage, Dies.” New York Times, July 7, 1973.\n\nRedfield, Margaret. “Joe E. Brown-That’s Saying a Mouthful.” Los Angeles Times, April 24, 1966.\n\nRemenih, Anton. “Joe E. Brown Adds New Zest to Radio Show.” Chicago Tribune, August 11, 1951.\n\nWebb, Jr., Melville E. “Weather Man Plays Mean Trick on Boston Teams, Robbing Sox of Apparent Victory, Keeping Braves Idle.” Boston Globe, April 18, 1922.\n\nWolters, Larry. “Where to Dial Today.” Chicago Tribune, August 6, 1954. Zimmerman, Paul. “Joe E. Brown to MC Affair for Dodgers.” Los Angeles Times, October 22, 1957.\n\n“Art of Comic Facial Expression.” Boston Globe, March 6, 1921. “Dodger Youth Program Lauded by Joe E. Brown.” Los Angeles Times, May 2, 1958.\n\n“Dodgers Will Bring Visitors from Far Away, Joe E. Brown Declares.” Los Angeles Times, April 4, 1958.\n\n“Does Filmdom Give Athletes Swelled Head?” Los Angeles Times, November 11, 1934.\n\n“Durable comedian .Joe E. Brown dies.” Chicago Tribune, July 7, 1973. “Joe E. Brown Gets Citation.” New York Times, May 5, 1946.\n\n“Joe E. Brown Loses Home and Mementoes.” Los Angeles Times, November 7, 1961.\n\n“Joe E. Brown May Buy Interest in Braves.” Los Angeles Times, June 23, 1935.\n\n“Joe E. Brown Nine Wins Olympic Benefit Tilt.” Los Angeles Times, February 29, 1932.\n\n“Joe E. Brown Target of the Circus Saints.” New York Times, November 27, 1948."}, {"url": "https://www.theatlantic.com/entertainment/archive/2013/04/the-real-story-of-baseballs-integration-that-you-wont-see-in-i-42-i/274886/", "page_content": "The new film ignores the broad-based movement that helped make Jackie Robinson's arrival in baseball possible, as well as the first black major-leaguer's own activism.\n\nWB\n\nOne of America's most iconic and inspiring stories—Jackie Robinson breaking baseball's color line in 1947—is retold in the film 42, which opens nationally this weekend. Even if you're not a baseball fan, the film will tug at your heart and have you rooting for Robinson to overcome the racist obstacles put in his way. It is an uplifting tale of courage and determination that is hard to resist, even though you know the outcome before the movie begins.\n\nBut despite bravura performances by relatively unknown Chadwick Boseman as Robinson and superstar Harrison Ford as Branch Rickey (the Brooklyn Dodgers' general manager who recruited Robinson and orchestrated his transition from the Negro Leagues to the all-white Major Leagues), the film strikes out as history, because it ignores the true story of how baseball's apartheid system was dismantled.\n\nThe film portrays baseball's integration as the tale of two trailblazers—Robinson, the combative athlete and Rickey, the shrewd strategist—battling baseball's, and society's, bigotry. But the truth is that it was a political victory brought about by a social protest movement. As an activist himself, Robinson would likely have been disappointed by a film that ignored the centrality of the broader civil rights struggle.\n\nThat story has been told in two outstanding books, Jules Tygiel's Baseball's Great Experiment (1983) and Chris Lamb's Conspiracy of Silence: Sportswriters and the Long Campaign to Desegregate Baseball (2012). As they recount, Rickey's plan came after more than a decade of effort by black and left-wing journalists and activists to desegregate the national pastime. Beginning in the 1930s, the Negro press, civil rights groups, the Communist Party, progressive white activists, and radical politicians waged a sustained campaign to integrate baseball. It was part of a broader movement to eliminate discrimination in housing, jobs, and other sectors of society. It included protests against segregation within the military, mobilizing for a federal anti-lynching law, marches to open up defense jobs to blacks during World War II, and boycotts against stores that refused to hire African Americans under the banner \"don't shop where you can't work.\" The movement accelerated after the war, when returning black veterans expected that America would open up opportunities for African Americans.\n\nRobinson broke into baseball when America was a deeply segregated nation. In 1946, at least six African Americans were lynched in the South. Restrictive covenants were still legal, barring blacks (and Jews) from buying homes in many neighborhoods—not just in the South. Only a handful of blacks were enrolled in the nation's predominantly white colleges and universities. There were only two blacks in Congress. No big city had a black mayor.\n\nMartin Luther King Jr. once told Dodgers star Don Newcombe, another former Negro Leaguer, \"You'll never know what you and Jackie and Roy [Campanella] did to make it possible to do my job.\"\n\nIt is difficult today to summon the excitement that greeted Robinson's achievement. The dignity with which Robinson handled his encounters with racism—including verbal and physical abuse on the field and in hotels, restaurants, trains, and elsewhere—drew public attention to the issue, stirred the consciences of many white Americans, and gave black Americans a tremendous boost of pride and self-confidence. Martin Luther King Jr. once told Dodgers star Don Newcombe, another former Negro Leaguer, \"You'll never know what you and Jackie and Roy [Campanella] did to make it possible to do my job.\"\n\nJackie Robinson, right, and Martin Luther King, Jr. (Solipsis)\n\nRobinson, who spent his entire major league career (1947 to 1956) with the Dodgers, was voted Rookie of the Year in 1947 and Most Valuable Player in 1949, when he won the National League batting title with a .342 batting average. An outstanding base runner and base stealer, with a .311 lifetime batting average, he led the Dodgers to six pennants and was elected to the Hall of Fame in 1962.\n\n\n\n\n\n* * *\n\n42 is the fourth Hollywood film about Robinson. All of them suffer from what might be called movement myopia. We may prefer our heroes to be rugged individualists, but the reality doesn't conform to the myth embedded in Hollywood's version of the Robinson story.\n\nIn The Jackie Robinson Story, released in 1950, Robinson played himself and the fabulous Ruby Dee portrayed his wife Rachel. Produced at the height of the Cold War, five years before the Montgomery bus boycott, the film celebrated Robinson's feat as evidence that America was a land of opportunity where anyone could succeed if he had the talent and will. The movie opens with the narrator saying, \"This is a story of a boy and his dream. But more than that, it's a story of an American boy and a dream that is truly American.\"\n\nIn 1990 TNT released a made-for-TV movie, The Court Martial of Jackie Robinson, starring Andre Braugher, which focused on Robinson's battles with racism as a soldier during World War II. In 1944, while assigned to a training camp at Fort Hood in segregated Texas, Robinson, a second lieutenant, refused to move to the back of an army bus when the white driver ordered him to do so, even though buses had been officially desegregated on military bases. He was court martialed for his insubordination, tried, acquitted, transferred to another military base, and honorably discharged four months later. By depicting Robinson as a rebellious figure who chafed at the blatant racism he faced, the film foreshadows the traits he would have to initially suppress once he reached the majors.\n\nHBO's The Soul of the Game, released in 1996, focused on the hopes and then the frustrations of Satchel Paige and Josh Gibson, the two greatest players in the Negro Leagues, whom Branch Rickey passed up to integrate the majors in favor of Robinson, played by Blair Underwood. Rickey had long wanted to hire black players, both for moral reasons and because he believed it would increase ticket sales among the growing number of African Americans moving to the big cities. He knew that if the experiment failed, the cause of baseball integration would be set back for many years. Rickey's scouts identified Robinson—who was playing for the Negro League's Kansas City Monarchs after leaving the army—as a potential barrier-breaker. Rickey could have chosen other Negro League players with greater talent or more name recognition, but he wanted someone who could be, in today's terms, a role model. Robinson was young, articulate and well educated. His mother moved the family from Georgia to Pasadena, California in 1920 when Robinson was 14 months ago. Pasadena was deeply segregated, but Robinson lived among and formed friendships with whites growing up there and while attending Pasadena Junior College and UCLA. He was UCLA's first four-sport athlete (football, basketball, track, and baseball), twice led the Pacific Coast League in scoring in basketball, won the NCAA broad jump championship, and was a football All-American. Rickey knew that Robinson had a hot temper and strong political views, but he calculated that Robinson could handle the emotional pressure while helping the Dodgers on the field. Robinson promised Rickey that, for at least his rookie year, he would not respond to the inevitable verbal barbs and even physical abuse he would face on a daily basis.\n\nIn 1997, America celebrated Robinson with a proliferation of conferences, museum exhibits, plays, and books. Major League Baseball retired Robinson's number—42—for all teams. President Bill Clinton appeared with Rachel Robinson at Shea Stadium to venerate her late husband.\n\nBut the next Hollywood movie about Robinson didn't arrive until this year's 42, written and directed by Brian Helgeland (screenwriter of L.A. Confidential and Mystic River), under the auspices of Warner Brothers and Legendary Pictures. The real story of baseball's integration has plenty of drama and could have easily been incorporated into the film.\n\n* * *\n\nStarting in the 1930s, reporters for African-American papers (especially Wendell Smith of the Pittsburgh Courier, Fay Young of the Chicago Defender, Joe Bostic of the People's Voice in New York, and Sam Lacy of the Baltimore Afro-American), and Lester Rodney, sports editor of the Communist paper, the Daily Worker, took the lead in pushing baseball's establishment to hire black players. They published open letters to owners, polled white managers and players (some of whom were threatened by the prospect of losing their jobs to blacks, but most of whom said that they had no objections to playing with African Americans), brought black players to unscheduled tryouts at spring training centers, and kept the issue before the public. Several white journalists for mainstream papers joined the chorus for baseball integration.\n\nProgressive unions and civil rights groups picketed outside Yankee Stadium the Polo Grounds, and Ebbets Field in New York City, and Comiskey Park and Wrigley Field in Chicago. They gathered more than a million signatures on petitions, demanding that baseball tear down the color barrier erected by team owners and Commissioner Kennesaw Mountain Landis. In July 1940, the Trade Union Athletic Association held an \"End Jim Crow in Baseball\" demonstration at the New York World's Fair. The next year, liberal unions sent a delegation to meet with Landis to demand that major league baseball recruit black players. In December 1943, Paul Robeson, the prominent black actor, singer, and activist, addressed baseball's owners at their annual winter meeting in New York, urging them to integrate their teams. Under orders from Landis, they ignored Robeson and didn't ask him a single question.\n\nNational Endowment for the Humanities\n\nIn 1945, Isadore Muchnick, a progressive member of the Boston City Council, threatened to deny the Red Sox a permit to play on Sundays unless the team considered hiring black players. Working with several black sportswriters, Muchnick persuaded the reluctant Red Sox general manager, Eddie Collins, to give three Negro League players—Robinson, Sam Jethroe, and Marvin Williams—a tryout at Fenway Park in April of that year. The Sox had no intention of signing any of the players, nor did the Pittsburgh Pirates and Chicago White Sox, who orchestrated similar bogus auditions. But the public pressure and media publicity helped raise awareness and furthered the cause.\n\nOther politicians were allies in the crusade. Running for re-election to the New York City Council in 1945, Ben Davis—an African-American former college football star, and a Communist—distributed a leaflet with the photos of two blacks, a dead soldier and a baseball player. \"Good enough to die for his country,\" it said, \"but not good enough for organized baseball.\" That year, the New York State legislature passed the Quinn-Ives Act, which banned discrimination in hiring, and soon formed a committee to investigate discriminatory hiring practices, including one that focused on baseball. In short order, New York City Mayor Fiorello LaGuardia's established a Committee on Baseball to push the Yankees, Giants, and Dodgers to sign black players. Left-wing Congressman Vito Marcantonio, who represented Harlem, called for an investigation of baseball's racist practices.\n\nThis protest movement set the stage for Robinson's entrance into the major leagues. In October 1945, Rickey announced that Robinson had signed a contract with the Dodgers. He sent Robinson to the Dodgers' minor-league team in Montreal for the 1946 season, then brought him up to the Brooklyn team on opening day, April 15, 1947.\n\nThe Robinson experiment succeeded—on the field and at the box office. Within a few years, the Dodgers had hired other black players—pitchers Don Newcombe and Joe Black, catcher Roy Campanella, infielder Jim Gilliam, and Cuban outfielder Sandy Amoros—who helped turn the 1950s Dodgers into one of the greatest teams in baseball history.\n\n* * *\n\nViewers of 42 will see no evidence of the movement that made Robinson's—and the Dodgers'—success possible. For example, Andrew Holland plays Pittsburgh Courier reporter Wendell Smith, but he's depicted as Robinson's traveling companion and the ghost-writer for Robinson's newspaper column during his rookie season. The film ignores Smith's key role as an agitator and leader of the long crusade to integrate baseball before Robinson became a household name.\n\nRobinson recognized that the dismantling of baseball's color line was a triumph of both a man and a movement. During and after his playing days, he joined the civil rights crusade, speaking out—in speeches, interviews, and his column—against racial injustice. In 1949, testifying before Congress, he said: \"I'm not fooled because I've had a chance open to very few Negro Americans.\"\n\nRobinson viewed his sports celebrity as a platform from which to challenge American racism. Many sportswriters and most other players—including some of his fellow black players, content simply to be playing in the majors—considered Robinson too angry and vocal about racism in baseball and society.\n\nRobinson viewed his sports celebrity as a platform from which to challenge American racism. Many sportswriters and other players—including some of his fellow black players—considered Robinson too angry and vocal about racism.\n\nWhen Robinson retired from baseball in 1956, no team offered him a position as a coach, manager, or executive. Instead, he became an executive with the Chock Full o' Nuts restaurant chain and an advocate for integrating corporate America. He lent his name and prestige to several business ventures, including a construction company and a black-owned bank in Harlem. He got involved in these business activities primarily to help address the shortage of affordable housing and the persistent redlining (lending discrimination against blacks) by white-owned banks. Both the construction company and the bank later fell on hard times and dimmed Robinson's confidence in black capitalism as a strategy for racial integration.\n\nIn 1960, Robinson supported Hubert Humphrey, the liberal Senator and civil rights stalwart from Minnesota, in his campaign for president. When John Kennedy won the Democratic nomination, however, Robinson shocked his liberal fans by endorsing Richard Nixon. Robinson believed that Nixon had a better track record than JFK on civil rights issues, but by the end of the campaign—especially after Nixon refused to make an appearance in Harlem—he regretted his choice.\n\nDuring the 1960s, Robinson was a constant presence at civil rights rallies and picket lines, and chaired the NAACP's fundraising drive. Angered by the GOP's opposition to civil rights legislation, he supported Humphrey over Nixon in 1968. But he became increasingly frustrated by the pace of change.\n\n\"I cannot possibly believe,\" he wrote in his autobiography, I Never Had It Made, published shortly before he died of a heart attack at age 53 in 1972, \"that I have it made while so many black brothers and sisters are hungry, inadequately housed, insufficiently clothed, denied their dignity as they live in slums or barely exist on welfare.\"\n\nIn 1952, five years after Robinson broke baseball's color barrier, only six of major league baseball's 16 teams had a black player. It was not until 1959 that the last holdout, the Boston Red Sox, brought an African American onto its roster. The black players who followed Robinson shattered the stereotype—once widespread among many team owners, sportswriters, and white fans—that there weren't many African Americans \"qualified\" to play at the major league level. Between 1949 and 1960, black players won 8 out of 12 Rookie of the Year awards, and 9 out of 12 Most Valuable Player awards in the National League, which was much more integrated than the American League. Many former Negro League players, including Willie Mays, Henry Aaron, Don Newcombe, and Ernie Banks, were perennial All-Stars.\n\nBut academic studies conducted from the 1960s through the 1990s uncovered persistent discrimination. For example, teams were likely to favor a weak-hitting white player over a weak-hitting black player to be a benchwarmer or a utility man. And even the best black players had fewer and less lucrative commercial endorsements than their white counterparts.\n\nIn the 16 years he lived after his retirement in 1956, Robinson pushed baseball to hire blacks as managers and executives and even refused an invitation to participate in the 1969 Old Timers game because he did not yet see \"genuine interest in breaking the barriers that deny access to managerial and front office positions.\" No major league team had a black manager until Frank Robinson was hired by the Cleveland Indians in 1975. The majors' first black general manager—the Atlanta Braves' Bill Lucas—wasn't hired until 1977.\n\n* * *\n\nLast season, players of color represented 38.2 percent of majo- league rosters, according to a report by the Institute for Diversity and Ethics in Sport at the University of Central Florida. Black athletes represented only 8.8 percent of major-league players—a dramatic decline from the peak of 27 percent in 1975, and less than half the 19 percent in 1995. One quarter of last season's African-Americans players were clustered on three teams—the Yankees, Angels, and Dodgers. Their shrinking proportion is due primarily to the growing number of Latino (27.3%) and Asian (1.9%) players, including many foreign-born athletes, now populating major league rosters.\n\nBut there are also sociological and economic reasons for the decline of black ballplayers. The semi-pro, sandlot, and industrial teams that once thrived in black communities, serving as feeders to the Negro Leagues and then the major leagues, have disappeared. Basketball and football have replaced baseball as the most popular sports in black communities, where funding for public school baseball teams and neighborhood playgrounds with baseball fields has declined. Major league teams more actively recruit young players from Latin America, who are typically cheaper to hire than black Americans, as Adrian Burgos, in Playing America's Game: Baseball, Latinos, and the Color Line (2007) and Rob Ruck, in Raceball: How the Major Leagues Colonized the Black and Latin Game (2012) document.\n\nAmong today's 30 teams, there are only four managers of color—three blacks (the Reds' Dusty Baker, the Astros' Bo Porter, and the Rangers' Ron Washington) and one Latino (the Braves' Fredi Gonzalez). (Two of last season's Latino managers—the Indians' Manny Acta, and Ozzie Guillen of the Marlins—were fired). One Latino (Ruben Amaro Jr. of the Phillies) and one African American (Michael Hill of the Marlins) serve as general managers. (White Sox GM Ken Williams, an African American, was promoted to executive VP during the off-season.) Arturo Moreno, a Latino, has owned the Los Angeles Angels since 2003. Basketball great Earvin \"Magic\" Johnson, part of the new group that purchased the Los Angeles Dodgers last year, is the first African-American owner of a major league team.\n\nLike baseball, American society—including our workplaces, Congress and other legislative bodies, friendships, and even families—is more integrated than it was in Robinson's day. But there is still an ongoing debate about the magnitude of racial progress, as measured by persistent residential segregation, a significantly higher poverty rate among blacks than whites, and widespread racism within our criminal justice and prison systems.\n\nAs Robinson understood, these inequities cannot be solved by individual effort alone. It also requires grassroots activism and protest to attain changes in government policy and business practices. 42, misses an opportunity to recap this important lesson. Robinson's legacy is to remind us of the unfinished agenda of the civil rights revolution and of the important role that movements play in moving the country closer to its ideals."}, {"url": "https://sabr.org/jackie75/segregation/", "page_content": "Before Jackie: Baseball’s Color Line\n\n\n\nThe 1888 Syracuse Stars included two Black players, catcher Moses Fleetwood Walker (top row, far left), and pitcher Robert Higgins (bottom row, far left). On July 14, 1887, International League owners voted to ban any future contracts with Black players. Fed up with the racism he had experienced in baseball, Higgins quit the team in midseason and Walker, the league’s lone remaining Black player, was released in 1889. No Black player would appear in an International League game again until Jackie Robinson with the Montreal Royals in 1946. (NATIONAL BASEBALL HALL OF FAME LIBRARY)\n\nAs we celebrate the 75th anniversary of Jackie Robinson’s debut with the Brooklyn Dodgers, we need to look back at the history of the color line. As early as the 1860s, the Philadelphia Pythians were kept from playing in an all-White league. In the 1880s, Cap Anson and the Chicago White Stockings refused to take the field with Black players Moses Fleetwood Walker and George Stovey. In 1887, International League team executives voted to ban future contracts for Black players — and thus, the color line was born.\n\nThere were attempts from the 1890s to the 1940s to break the color line at the major-league level, but none succeeded. By the 1890s, most Black professional players had to play on all-Black teams, barnstorming across the country. Teams like the Cuban Giants, the Page Fence Giants, and the Chicago Unions played all comers, Black and White, but not in any major leagues. Black and White teams continued to play one another until 1947, but always outside the official channels of what was then considered Organized Baseball.\n\nA few individual players, such as Jimmy Claxton and Charlie Grant, tried to break the color line unsuccessfully. Some Black teams played against White opponents in the prestigious amateur Denver Post Tournament and later for the US Navy’s Great Lakes team. These efforts did little to change the racial attitudes present in baseball.\n\nSome players were invited to tryouts with big-league clubs in the 1930s and 1940s. None of these opportunities dented the color line. Sports writers Wendell Smith, Fay Young, Sam Lacy, and Joe Bostic pushed to make many of these efforts happen, but were disappointed with the lack of follow-up by the Pittsburgh Pirates, Brooklyn Dodgers, and the Boston Braves and Red Sox.\n\nSports writers were not the only ones pushing for change. Communist Party organizations and newspapers such as The Daily Worker took up the call for ending the color line to no avail. World War II caused some people to question the idea of men going to die for their country but not being able to play baseball together. Branch Rickey founded the United States League in 1945 as a way to begin looking for a player to break the color line. His efforts led to the signing of Jackie Robinson to a contract with the Dodgers organization, resulting in his debut with the Brooklyn Dodgers on April 15, 1947. Robinson’s debut finally broke a color line that had existed since just after the Civil War.\n\nOn this page, enjoy learning more about the players and figures who helped pave the way for Jackie Robinson to make his debut with the Dodgers in 1947.\n\n— Leslie Heaphy\n\n"}, {"url": "https://bleacherreport.com/articles/683529-hey-kid-let-me-see-some-id-20-youngest-mlb-players-to-debut-since-world-war-i", "page_content": "0 of 20\n\nChristian Petersen/Getty Images\n\nBaseball is a young man's game. Gone are the days of 40-year-old MVPs and late career renaissances that seemed so prevalent in the last two decades of Major League Baseball.\n\nThere seems to be an influx of youth in Major League baseball these days, as performance-enhancing drugs and their impact upon the game have been reduced by baseball's renewed focus on eradicating under-handed methods of enhancing one's abilities and prolonging careers beyond their natural expiration dates.\n\nTeams are once again realizing the vital role that talented youths play in this great game, as we are seeing young players contributing to their teams across MLB. Whether out of a desire for youthful exuberance and energy, or financial concerns with signing more established players, there appears to be a new wave of youngsters taking Major League Baseball by storm.\n\nOnce upon a time, teenage ballplayers were counted on as a necessity when vast numbers of Major Leaguers were called into military service during World War II. Though many of them were merely fill-ins during the absence of more established older players, others turned their opportunities as teens into productive careers in the big leagues.\n\nWith young, modern phenoms such as Bryce Harper knocking on the door of the big leagues while still in his teens, let's take a look at the 20 youngest players to play in Major League games since the end of World War I."}, {"url": "https://www.allmusic.com/artist/joe-brown-mn0000120615/biography", "page_content": "With a career that began in the 1970s and was still going strong in the opening decades of the 21st century, Joe Brown has cut a unique swath across British rock & roll. The east London-raised artist is most well-known for his bittersweet U.K. hit \"A Picture of You,\" from 1962, the same year in which the Beatles opened for him on a string of dates. However, Brown's prolific run of early hits came to an end with the rise of Merseybeat, after which he increasingly pursued acting roles and became a broader entertainer. The '70s saw him unveil a new act, Brown's Home Brew, cementing his reputation as a musician's musician. Upon moving to Henley-on-Thames early the following decade, he reinforced his close friendship with his new neighbor George Harrison when the pair bonded over the ukulele. Following Harrison's death in 2001, Brown closed the Concert for George tribute show at the Royal Albert Hall (at the request of Harrison's wife Olivia), with a moving solo uke rendition of \"I'll See You in My Dreams.\" His performance is reputed to have been the catalyst for renewed public interest in the instrument.\n\nBorn Joseph Roger Brown in Swarby, Lincolnshire in 1941, Brown proved a natural guitarist from an early age, and in 1956, at age 15, he formed the Spacemen, a skiffle group with whom he started his career in entertainment. The band -- whose ranks included bassist Peter Oakman and his older brother Tony Oakman on banjo and guitar -- later switched to rock & roll, and was subsequently spotted by impresario Larry Parnes, who was in the process of signing up lot of young vocal talent in an effort to get in on the rock & roll boom. The Spacemen became Parnes' resident band, backing such figures as Vince Eager, Johnny Gentle, and Marty Wilde on the early Parnes package tours. The group also had the good fortune to be spotted by producer Jack Good, who was putting together the house band for his new television music showcase Boy Meets Girl. Brown was already a prodigious player, and he was hired as lead guitarist for the house orchestra at the age of 18; he was proficient in authentic American-style rock & roll, country, and country-blues, and stood out from the competition.\n\nHe was signed to Decca Records that same year; his first two singles, \"People Gotta Talk\" and \"Jellied Eels,\" issued in 1959 and 1960, respectively, failed to chart. But his third, \"The Darktown Strutters Ball,\" reached number 34 on the U.K. charts in 1960. The group by this time was rechristened the Bruvvers, owing to the fact that they weren't using the Spacemen name anymore, and had no official name, but were, as Brown put it -- in his uniquely Cockney-styled way -- \"like bruvvers.\" Brown left Decca for Pye Records in 1961, the latter company using his single \"Crazy Mixed Up Kid\" to launch its Piccadilly imprint. Only two of his next four singles even reached the Top 40, but Brown was making musical headway (and history) nonetheless. At just about that same time, he appeared as the lead guitarist on Billy Fury's landmark 10\" long-player The Sound of Fury, his playing among the highlights of what is generally regarded as one of the best albums to come out of the early English rock & roll boom. His work from that period and on that album has received high praise across the decades from musicians of succeeding generations including Keith Richards of the Rolling Stones.\n\nBrown's own career didn't fully take off until 1962, when he hit the number two spot on the singles charts with \"A Picture of You.\" He was voted the \"Top U.K. Vocal Personality\" of 1962 in the pages of New Musical Express, and toured that year on a bill that included the Beatles, who were just about to record their debut single, \"Love Me Do\"; \"A Picture of You\" was also a personal favorite of both Harrison and Paul McCartney, later even turning up on the \"Let It Be\" sessions. Brown's next two records, \"It Only Took a Minute\" and \"That's What Love Will Do\" also made the Top Ten in 1962 and 1963, but his subsequent recordings were much more modest sellers, only making the Top 30.\n\nBrown was still sufficiently prominent in 1963 to get a film debut late that year, in What a Crazy World, which co-starred Marty Wilde. By that time, however, Brown's hold on the listening public was fading in the face of the Merseybeat boom and the next wave of British rock & roll. He turned increasingly to work in movies, pantomime, and theater musicals, and scored a big success in Charlie Girl on London's West End. Ironically, his occasional penchant for novelty tunes -- which included a recording of \"I'm Henry the Eighth\" -- anticipated the strategy of such successful mid-'60s pop/rock acts as Herman's Hermits, who parlayed their recording of the latter song into a huge American hit; that same use of novelty tunes in his repertory, however, also made it difficult for listeners of subsequent generations, having heard of Brown's reputation as a first-rate guitarist, to fully absorb some of his recordings, especially the early concert documents, which were weighted heavily toward his Cockney/novelty repertory.\n\nBrown's last chart success of the '60s was a low Top 40 placement for his rendition of \"With a Little Help from My Friends\" in 1967. He later worked on television in children's programming and game shows, but in 1972, Brown was back in music with a new band, Brown's Home Brew, whose repertory embraced not only rock & roll but also country and gospel music and featured his first wife, Vicki, on vocals. Brown has remained active in music ever since, and crossed paths on record with his old friend Harrison several times in the '70s and '80s; Harrison was also the best man at Brown's wedding to his second wife in 2000. He has continued performing in the 21st century and is also seen frequently on British television in connection with rock & roll-related programming. Brown's 50th year in music, in 2008, saw him receive a U.K. gold award for sales over 100,000 copies of a new best-of collection, as well as complete a 37-date tour, and a Royal Albert Hall concert with Mark Knopfler, Jools Holland, Dave Edmunds, and Chas & Dave. Brown has also received Mojo magazine's lifetime award for outstanding contribution to music after 51 years of recording. In 2009, Brown was given an MBE (Member of the Order of the British Empire) by Queen Elizabeth.\n\nThe next decade was bookended by documents of his relentless touring ethic -- 2011's Live in Liverpool and 2019's In Concert -- while in 2012 he issued The Ukulele Album, on which he tackled material associated with acts such as the Who, ELO, and Mötorhead. In 2019, Brown celebrated his 60th year in the music business with the release of a lavish, multi-disc box set that traced the course of his career and featured numerous unreleased recordings."}, {"url": "https://www.history.com/news/jackie-robinson-black-baseball-players-1947", "page_content": "Jackie Robinson wasn’t the only Black baseball player to suit up in the big leagues in 1947. After he broke the color line and became the first Black baseball player to play in the American major leagues during the 20th century, four other players of color soon followed in his footsteps.\n\nWATCH: The HISTORY Channel documentary After Jackie online now.\n\nLike Robinson, these four men had to deal with unimaginable pressure. They had teammates who wouldn’t shake their hands, fans ridiculed and threatened them. None could stay in the same hotels as their teammates. And they all had to prove to the world that a Black man could be just as good as a white man, not just at baseball, but as members of society. Like #42, they were all pioneers.\n\nREAD MORE: Jackie Robinson's Life and Career in Pictures\n\nLarry Doby\n\nGetty Images On July 5, 1947, just three months after Jackie Robinson joined the National League, Larry Doby became the American League’s first Black player when he suited up for the Cleveland Guardians (then known as the Cleveland Indians).\n\nOn July 5, 1947, less than three months after Robinson’s first appearance in the National League, Larry Doby pinch-hit in the seventh inning of the Cleveland Guardians' (then known as the Cleveland Indians) game against the Chicago White Sox, becoming the first Black player in the American League. Although his career started out on a low note with a strikeout, it ended triumphantly, with his bust in the National Baseball Hall of Fame.\n\nDoby was born in Camden, South Carolina, but became a three-sport star in high school in Paterson, New Jersey. He was soon noticed by the Newark Eagles of the Negro National League and signed to play professionally with them at age 17. Because he did not want to lose his amateur status—and his scholarship to Long Island University—Doby played under the pseudonym “Larry Walker.” He eventually took his name back and played for the Eagles for two years before shipping off to the South Pacific in World War II.\n\nMeanwhile, Cleveland Guardians owner Bill Veeck was trying hard to integrate the majors. Starting in 1942, Veeck began petitioning the league to let him bring in a Black player but was rejected by Commissioner Kenesaw Mountain Landis. After Robinson signed with the Dodgers in 1946 (he spent a year in the minor leagues before his 1947 debut), the door was open for Veeck to sign a Black player, too. Because of Doby’s age and skills, as well as his sterling reputation off the field, the choice was an easy one for Veeck.\n\nUnlike how the Dodgers brought in Robinson, the Guardians did not send Doby off to the minor leagues first. Instead, they allowed him to stay in the Negro Leagues with the Eagles (where he’d returned after the war). Veeck waited to make the signing official, wading carefully through the waters of integration until he felt his fan base was ready. Once he felt the time was right, Veeck signed Doby and put him on the big league roster.\n\nDoby got his first start the very next day, but played only sparingly for the rest of the 1947 season. As a regular player in 1948, Doby helped the Guardians advance to a World Series championship, and became the first African American to hit a home run in the “Fall Classic.”\n\nWhile playing with Cleveland, Doby made the All-Star team every year from 1949 until 1955, before being traded to the White Sox prior to the 1956 season. Although he was saddled with mounting injuries, Doby was productive for the White Sox, but returned to Cleveland for the 1958 season. He played part-time for the Detroit Tigers before returning to the White Sox. He retired in 1959 at the age of 35.\n\nIn 1978, Doby became the second Black manager in the big leagues, (after the Guardians’ player-manager Frank Robinson in 1976), when he helmed the White Sox in the second half of the season. He was elected to the National Baseball Hall of Fame in 1998 and passed away in 2003.\n\nAlthough he may have been second to Robinson in baseball, he was the first African American to play in the American Basketball League (a predecessor to the NBA), when he joined the Paterson Crescents in the winter of 1947.\n\nLISTEN: Jackie Robinson Tries Out for the Majors on HISTORY This Week\n\nHank Thompson and Willard Brown\n\nBettmann Archive/Getty Images Hank Thompson (left) and Willard Brown (right) sit in the dugout with manager “Muddy” Ruel just after signing with the St. Louis Browns, <em>July 17, 1947</em>.\n\nOn July 16, 1947, Dan Daniel of The Sporting News wrote in his column, “In St. Louis, they say the fans would never stand for Negroes on the Cardinals or the Browns. St. Louis, they insist, ‘is too much of a Southern City.’”\n\nJust one day later, the St. Louis Browns put that bold prediction to the test, when they signed not just one African American player, but two: Hank Thompson and Willard “Home Run” Brown. Like Jackie Robinson, both Thompson and Brown came over from the Kansas City Monarchs of the Negro American League.\n\nThe 21-year-old Thompson made his debut at second base on July 17, finishing hitless in four at-bats. The Oklahoma native played again the next day, singling off of Red Sox pitcher Dave Ferriss for his first big league hit. The 32-year-old Brown, a Louisiana-born Negro League legend, made his debut in July 19, but went hitless.\n\nOn July 20, the two made history by becoming the first Black players in the same starting lineup of a big-league game. On August 17, Brown and Thompson were in the lineup together again as the Browns played Larry Doby’s Guardians, marking the first time African American players had squared off against each other in a game.\n\nUnlike the signings of Robinson and Doby, Thompson and Brown were brought to the majors mainly to boost St. Louis’ sagging attendance. Owner Richard Muckerman saw the surging crowds in Brooklyn and Cleveland. Eager to sell tickets, he struck a deal with Kansas City to integrate his team. The Browns agreed to pay the Monarchs $5,000 upfront, and then $5,000 for each man if the club decided to keep them after a period of time.\n\nWhen the time came for St. Louis to decide whether or not to keep the struggling sluggers, the team was not seeing results in the standings—or at the ticket office. Brown was sent back to the Monarchs. Thompson hung around but was released after the season. The Browns then unofficially re-segregated and did not allow another Black player on the roster until they signed Satchel Paige in 1951. Paige was signed (coincidentally or not) after the team was purchased by Bill Veeck, who had integrated the Guardians.\n\nAlthough Thompson’s stint with the Browns was short-lived, he has the distinction of being the only player to break the color barrier for two different franchises. On July 8, 1949, he and Monte Irvin became the first African Americans to start for the New York Giants.\n\nHank played for the Giants until 1956, and passed away in 1969, at the age of 43. Despite never playing again in the majors, Brown was elected to the Hall of Fame in 2006, 10 years after his death.\n\nDan Bankhead\n\nBettmann Archive/Getty Images Dan Bankhead, pictured during Spring Training in 1948, became the first Black pitcher in a Major League baseball game.\n\nThere was one more pioneer to break the barrier in 1947. Unlike the others, 27-year-old Dan Bankhead did not earn his standing as a batter, but as a pitcher. Four months after Robinson's debut, owner Branch Rickey signed Bankhead and brought him up to Brooklyn, making the Alabama native the first African American pitcher in Major League Baseball.\n\nBankhead, who was often compared to Hall-of-Fame pitcher Bob Feller, seemingly had all the tools to succeed at the big league level. He also came from a strong baseball background, as he and four of his brothers all played in the Negro leagues. Bankhead had a solid career with the Birmingham Black Barons and the Memphis Red Sox of the Negro American League before signing with the Dodgers.\n\nThe former U.S. Marine made his debut as a reliever in the Dodgers’ August 26 game against the Pittsburgh Pirates. The Pirates had jumped all over Brooklyn’s starter, Hal Gregg, knocking him out of the game with nobody out in the top of the second inning. When Bankhead came in to try to clean up the mess, the Pirates tagged him for eight more runs in just over three innings.\n\nThe one silver lining of Bankhead’s outing did not come on the mound but in his first big league at-bat when he smacked a Fritz Ostermueller pitch over the fence for a two-run home run. That made Bankhead, a pitcher, the first African American to hit a home run in his first Major League at-bat.\n\nUnfortunately, things never improved on the mound for Bankhead. According to Crossing the Line: Black Major Leaguers, 1947-1959 by Larry Moffi and Jonathan Kronstadt, Bankhead was hampered by control problems, an old injury and an all-too-common disappointment. \"Like many of baseball’s first Black players, he was thrown into white baseball with the physical tools to succeed but little or no emotional support,” write the authors.\n\nAfter only a few more appearances that season, Bankhead was sent down to the minor leagues, and didn’t return to the Dodgers again until 1950. After a 1951 season, Bankhead left the game for good at age 31. He passed away in 1976."}, {"url": "https://www.britannica.com/biography/Joe-Louis", "page_content": "Joe Louis was an American boxer who was world heavyweight champion from 1937 until 1949, the longest reign in the history of any weight division. Louis successfully defended his title 25 times, more than any other champion in any division, scoring 21 knockouts. He was known as an extremely accurate and economical knockout puncher.\n\nJoe Louis, byname of Joseph Louis Barrow, also called the Brown Bomber, (born May 13, 1914, Lafayette, Alabama, U.S.—died April 12, 1981, Las Vegas, Nevada), American boxer who was world heavyweight champion from June 22, 1937, when he knocked out James J. Braddock in eight rounds in Chicago, until March 1, 1949, when he briefly retired. During his reign, the longest in the history of any weight division, he successfully defended his title 25 times, more than any other champion in any division, scoring 21 knockouts (his service in the U.S. Army from 1942 to 1945 no doubt prevented him from defending his title many more times). He was known as an extremely accurate and economical knockout puncher.\n\n(Read Gene Tunney’s 1929 Britannica essay on boxing.)\n\nBritannica Quiz Sports Quiz\n\nLouis’s father, a sharecropper, was committed to a state mental hospital when Louis was about two years old. After his mother remarried, the family, which included eight children, moved to Detroit, Michigan, where Louis took up amateur boxing. He won the U.S. Amateur Athletic Union 175-pound championship in 1934 and also was a Golden Gloves titleholder; of 54 amateur fights, Louis won 50 and lost 4. His first professional fight took place on July 4, 1934, and within 12 months he had knocked out Primo Carnera, the first of six previous or subsequent heavyweight champions who would become his victims; the others were Max Baer, Jack Sharkey, Braddock, the German champion Max Schmeling, and Jersey Joe Walcott. Louis sustained his first professional loss in 1936 at the hands of Schmeling. In 1938, after having beaten Braddock and taken the title, Louis met Schmeling in a rematch that the American media portrayed as a battle between Nazism and democracy (though Schmeling himself was not a Nazi). Louis’s dramatic knockout victory in the first round made him a national hero. He was perhaps the first Black American to be widely admired by whites, a fact attributable not only to his extraordinary pugilistic skills but also to his sportsmanlike behaviour in the ring (he did not gloat over his white opponents), his perceived humility and soft-spoken demeanour, and his discretion in his private life.\n\nLouis was at his peak in the period 1939–42. From December 1940 through June 1941 he defended the championship seven times. After enlisting in the U.S. Army in 1942, he served in a segregated unit with Jackie Robinson, who later became the first African American to play major league baseball. Louis did not see combat but fought in 96 exhibition matches before some two million troops; he also donated more than $100,000 to Army and Navy relief funds. After the war he was less active, and in 1949 he retired as the undefeated champion long enough to allow Ezzard Charles to earn recognition as his successor.\n\nAlthough Louis earned nearly $5 million as a fighter, he spent or gave away nearly all of it. When the Internal Revenue Service demanded more than $1 million in back taxes and penalties, he was forced to return to the ring to pay off his debts. He fought Charles for the championship on September 27, 1950, but lost a 15-round decision. In his last fight of consequence, against future champion Rocky Marciano on October 26, 1951, he was knocked out in eight rounds. From 1934 to 1951, Louis had 71 bouts, winning 68, 54 by knockouts. A Hollywood movie about his life, The Joe Louis Story, was made in 1953.\n\nAfter his second retirement Louis continued to be plagued by money problems, and he was briefly forced to work as a professional wrestler. Later he became a greeter for Caesar’s Palace, a resort and casino in Las Vegas, Nevada. Upon his death in 1981 he was buried in Arlington National Cemetery; one of the pallbearers at his funeral was Schmeling. Louis remained a Detroit icon after his death: the Joe Louis Arena was home to the Detroit Red Wings of the National Hockey League from 1979 to 2017, and a well-known public monument to Louis (a 24-foot [7.3-metre] arm with a clenched fist suspended in pyramidal frame) was erected in downtown Detroit in 1986. Louis was inducted into the Ring Magazine Boxing Hall of Fame in 1954 and the International Boxing Hall of Fame in 1990. He was posthumously awarded the Congressional Gold Medal in 1982."}, {"url": "https://www.history.com/this-day-in-history/joe-nuxhall-makes-mlb-debut-at-15", "page_content": "On June 10, 1944, 15-year-old Joe Nuxhall becomes the youngest person ever to play Major League Baseball when he pitches in a game for the Cincinnati Reds. Nuxhall threw two-thirds of the ninth inning in an 18-0 loss to the St. Louis Cardinals; he was pulled only after one wild pitch and allowing five runs on five walks and two hits. The game was played during World War II, when it became common for adolescent and older players to fill in for big leaguers fighting overseas.\n\nIn 1942, after the Japanese attack on Pearl Harbor, President Roosevelt wrote to Baseball Commissioner Kenesaw Mountain Landis to ask that baseball continue even though the United States was going to war: “I honestly feel that it would be best for the country to keep baseball going. There will be fewer people unemployed and everybody will work longer hours and harder than ever before. And that means they ought to have a chance for recreation and for taking their minds off their work even more than before.” Landis obliged, and play continued even as the stars of the era left to enroll in the armed forces. Detroit Tigers first baseman Hank Greenberg was among the players who had enlisted even before 1941, in the prime of his Hall of Fame career. After the 1942 season, more than 500 big league players enlisted, including stars Ted Williams, Joe DiMaggio, Bob Feller, Dom DiMaggio and Pee Wee Reese.\n\nMeanwhile, the major leagues had to make do with whoever was available, and the 15-year-old Nuxhall was just one of many new players who normally wouldn’t have come close to a shot at the big leagues. Others included Pete Gray, a one-armed outfielder who hit .218 and drove in 13 runs in 77 games with the St. Louis Browns in 1945, and 16-year-old Carl Scheib, who pitched for the Philadelphia A’s in 1943. Eighteen-year-old Vern Benson got to hit twice for the A’s that year, while 17-year-old Cass Michaels began his 12-year major league career many years ahead of schedule playing third base for the White Sox. Older players also got in on the act: Mike Ryba and Al Simmons were among the former major leaguers who returned to fill in for their younger counterparts overseas.\n\nAs for Nuxhall, though the June 10 outing was his only appearance in 1944, he rejoined the Reds in 1952 when he was 23 years old and pitched 15 seasons in the big leagues. He ended his career with a 135-117 record and a 3.90 ERA. He died in 2007."}, {"url": "https://www.loc.gov/collections/jackie-robinson-baseball/articles-and-essays/baseball-the-color-line-and-jackie-robinson/1940-to-1946/", "page_content": "Breaking the Color Line: 1940 to 1946\n\nBy the 1940s, organized baseball had been racially segregated for many years. The black press and some of their white colleagues had long campaigned for the integration of baseball. Wendell Smith of The Pittsburgh Courier was especially vocal. World War II experiences prompted more people to question segregation practices.\n\nAlthough several people in major league baseball tried to end segregation in the sport, no one succeeded until Brooklyn Dodger's general manager Branch Rickey set his \"great experiment\" (See Jules Tygiel's Baseball's Great Experiment in the bibliography) into motion. In 1945, the Jim Crow policies of baseball changed forever when Branch Rickey and Jackie Robinson of the Negro League's Kansas City Monarchs agreed to a contract that would bring Robinson into the major leagues in 1947.\n\nIn addition to racial intolerance, economic and other complex factors contributed to segregation in baseball. For example, many owners of major league teams rented their stadiums to Negro League teams when their own teams were on the road. Team owners knew that if baseball were integrated, the Negro Leagues would probably not survive losing their best players to the majors, major league owners would lose significant rental revenue, and many Negro League players would lose their livelihoods. Some owners also thought that a white audience would be reluctant to attend games with black players. Others saw the addition of black players as a way to attract larger white as well as black audiences and sell more tickets. Looking back on this time, Rickey described the problems he faced and the events that influenced his decision in a speech to the One Hundred Percent Wrong Club in 1956.\n\nBranch Rickey (1881-1965) was involved with baseball in a variety of capacities -- as a player, coach, manager, and owner -- for more than sixty years. His Hall of Fame plaque mentions both his creation of baseball's farm system in the 1920s and his signing of Jackie Robinson. Rickey's interest in integrating baseball began early in his career. He had been particularly troubled by the policy of barring African Americans from grandstand seating in St. Louis, when he worked for the Cardinals.\n\nThe noted sportswriter Red Smith fondly summed up Rickey's multi-faceted persona: \"player, manager, executive, lawyer, preacher, horse-trader, spellbinder, innovator, husband and father and grandfather, farmer, logician, obscurantist, reformer, financier, sociologist, crusader, sharper, father confessor, checker shark, friend and fighter.\" (Editorial page, St. Louis Post- Dispatch, Monday, October 31, 1955)\n\nIn 1942, Rickey joined the Dodgers and quietly began plans to bring black players to the team. The first black baseball player to cross the \"color line\" would be subjected to intense public scrutiny, and Rickey knew that the player would have to be more than a talented athlete to succeed. He would also have to be a strong person who could agree to avoid open confrontation when subjected to hostility and insults, at least for a few years. In 1945, when Rickey approached Jackie Robinson, baseball was being proposed as one of the first areas of American society to integrate. Not until 1948 did a presidential order desegregate the armed forces; the Supreme Court forbid segregated public schools in 1954.\n\nThe player who would break the color line, Jack (John) Roosevelt Robinson, was born in Cairo, Georgia, on January 31, 1919. His mother moved the family to Pasadena, California, in 1920, and Robinson attended John Muir Technical High School and Pasadena Community College before transferring to the University of California, Los Angeles. An outstanding athlete, he lettered in four sports at UCLA -- baseball, football, basketball, and track -- and excelled in others, such as swimming and tennis. Consequently, he had experience playing integrated sports.\n\nRobinson showed an early interest in civil rights in the Army. He was drafted in 1942 and served on bases in Kansas and Texas. With help from boxer Joe Louis, he succeeded in opening an Officer Candidate School to black soldiers. Soon after, Robinson became a second lieutenant. At Fort Hood, Texas, Robinson faced a court martial for refusing to obey an order to move to the back of a bus. The order was a violation of Army regulations, and he was exonerated. Shortly after leaving the Army in 1944, Robinson joined the Kansas City Monarchs, a leading team in the Negro Leagues.\n\nAfter scouting many players from the Negro Leagues, Branch Rickey met with Jackie Robinson at the Brooklyn Dodgers office in August, 1945. Clyde Sukeforth, the Dodgers scout, had told Robinson that Rickey was scouting for players because he was starting his own black team to be called the Brown Dodgers. At the meeting, Rickey revealed that he wanted Robinson to play for the major league Dodgers. Rickey then acted out scenes Robinson might face to see how Robinson would respond. Robinson kept his composure and agreed to a contract with Brooklyn's Triple-A minor league farm club, the Montreal Royals.\n\nOn October 23, 1945, Jackie Robinson officially signed the contract. Rickey soon put other black players under contract, but the spotlight stayed on Robinson. Rickey publicized Robinson's signing nationally through Look magazine, and in the black press through his connections to Wendell Smith at the Pittsburgh Courier. In response to allegations that Negro League contracts had been broken, Rickey sought assurances that Robinson had not been under formal contract with the Monarchs. Robinson responded to Rickey in a letter preserved in the Branch Rickey Papers.\n\nAfter a successful season with the minor league Montreal Royals in 1946, Robinson officially broke the major league color line when he put on a Dodgers uniform, number 42, in April 1947.\n\nBranch Rickey, Brooklyn Dodger manager and owner. Photograph by Harold Rhodenbaugh (Look staff photographer). Photomechanical print in: \"A Branch Grows in Brooklyn,\" Look, March 19, 1946, p. 70. (Library of Congress, Prints and Photographs Division. Reproduction #: LC-USZ62-119888)\n\nBranch Rickey, Brooklyn Dodger manager and owner. Photograph by Harold Rhodenbaugh (Look staff photographer). Photomechanical print in: \"A Branch Grows in Brooklyn,\" Look, March 19, 1946, p. 70. (Library of Congress, Prints and Photographs Division. Reproduction #: LC-USZ62-119888) Jackie Robinson, in Kansas City Monarchs uniform. Photograph from The Call (Kansas City), 1945. (Library of Congress, Prints and Photographs Division. Reproduced with permission from The Call. Reproduction number: on order)\n\nIn 1945, Robinson played 47 games for the Monarchs of the Negro American League as well as the East-West All-Star game.\n\nJackie Robinson, in Kansas City Monarchs uniform. Photograph from The Call (Kansas City), 1945. (Library of Congress, Prints and Photographs Division. Reproduced with permission from The Call. Reproduction number: on order) In 1945, Robinson played 47 games for the Monarchs of the Negro American League as well as the East-West All-Star game.\n\nBlues Stadium was home to both the American Association Kansas City Blues, and the Negro League Kansas City Monarchs. Formerly a frog pond, swimming hole, and ash heap, the site opened as a baseball field in 1923. J. Leslie Wilkinson, the field's first owner, had a portable lighting system built to illuminate the field at night for Negro League games. This innovation took two hours to set up, made it difficult for fielders to see fly balls, batters to see pitches, and made so much noise that the center fielders couldn't hear the infielders. Despite the poor conditions the night-lighting system created for the players, it generated ticket sales and saved the Monarchs during the Depression years. Between 1923 and 1972, when the last game was played there, the dimensions and fence height in Blues Stadium changed more often than in any other ballpark. Jackie Robinson played for the Monarchs in Blues Stadium briefly in 1945, before Branch Rickey bought his contract.\n\nBlues Stadium was home to both the American Association Kansas City Blues, and the Negro League Kansas City Monarchs. Formerly a frog pond, swimming hole, and ash heap, the site opened as a baseball field in 1923. J. Leslie Wilkinson, the field's first owner, had a portable lighting system built to illuminate the field at night for Negro League games. This innovation took two hours to set up, made it difficult for fielders to see fly balls, batters to see pitches, and made so much noise that the center fielders couldn't hear the infielders. Despite the poor conditions the night-lighting system created for the players, it generated ticket sales and saved the Monarchs during the Depression years. Between 1923 and 1972, when the last game was played there, the dimensions and fence height in Blues Stadium changed more often than in any other ballpark. Jackie Robinson played for the Monarchs in Blues Stadium briefly in 1945, before Branch Rickey bought his contract. Lobby card for The Jackie Robinson Story. Copyright by Pathe Industries, 1950. (Library of Congress, Motion Picture Broadcasting and Recorded Sound Division. Reproduction number: LC-USZC4-6146.)\n\nScene in which Branch Rickey interviews Jackie Robinson.\n\nSee Script excerpt and more lobby cards from \"The Jackie Robinson Story.\""}, {"url": "https://www.insider.com/football-players-who-became-actors-2021-1", "page_content": "Football players don't have the longest shelf life — many retire when they're still young.\n\nSome football players turned to acting as their second careers.\n\nTerry Crews, beloved star of \"Brooklyn Nine-Nine,\" played in the NFL before becoming an actor.\n\nVisit Insider's homepage for more stories.\n\nTop editors give you the stories you want — delivered right to your inbox each weekday. Loading Something is loading. Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy\n\nActing isn't the most stable career path, but it could be argued that football is even less so. One bad injury could take you out of the game forever, like it did with some of these stars.\n\nThese 15 football players all turned to acting after their sports careers ended, with varying levels of success. Dwayne Johnson, the most bankable actor in Hollywood, first tried to hack it as a football player before starring in the \"Fast and Furious\" franchise.\n\nKeep scrolling to learn more about 15 football players who switched the gridiron for movie sets."}]}