{"Joe Brown was born in St. Louis, Missouri.": [{"url": "https://www.ancientfaces.com/person/joseph-brown-birth-1932-death-2002/65109113", "page_content": "Refresh this page to see various historical events that occurred during Joseph's lifetime.\n\nIn 1932, in the year that Joseph Brown was born, on February 27th, actress Elizabeth Taylor was born in London. Her parents were Americans living in London and when she was 7, the family moved to Los Angeles. Her first small part in a movie was in There's One Born Every Minute in 1942 but her first starring role was in National Velvet in 1944. She became as famous for her 8 marriages (to 7 people) as she was for her beauty and films.\n\nIn 1967, at the age of 35 years old, Joseph was alive when on November 7th, President Johnson signed legislation passed by Congress that created the Corporation for Public Broadcasting (CPB), which would later become PBS and NPR. The legislation required CPB to operate with a \"strict adherence to objectivity and balance in all programs or series of programs of a controversial nature\".\n\nIn 1971, when he was 39 years old, on May 3rd, 10,000 federal troops, 5,100 officers of the D.C. Metropolitan Police, 2,000 members of the D.C. National Guard, and federal agents assembled in Washington DC to prevent an estimated 10,000 Vietnam War protesters from marching. President Nixon (who was in California) refused to give federal employees the day off and they had to navigate the police and protesters, adding to the confusion. By the end of a few days of protest, 12,614 people had been arrested - making it the largest mass arrest in US history.\n\nIn 1980, by the time he was 48 years old, on December 8th, ex-Beatle John Lennon was shot and killed by Mark David Chapman in front of his home - the Dakota - in New York City. Chapman was found guilty of murder and still remains in jail.\n\nIn 1994, when he was 62 years old, on May 6th, the Channel Tunnel or \"Chunnel\" was officially opened. The Chunnel is a railway tunnel beneath the English Channel that connects Great Britain to mainland France. Original plans for such a tunnel were developed in 1802 and approved by Napoleon Bonaparte but the British rejected the plan fearing that Napoleon would use the railway to invade."}, {"url": "https://www.sos.mo.gov/archives/resources/birthdeath/Default.asp", "page_content": "Missouri Birth & Death Records Database, Pre-1910\n\nThe Missouri Birth and Death Records Database is an abstract of the birth, stillbirth, and death records recorded before 1909 and that are available on microfilm at the Missouri State Archives. (See Brief History of Vital Records in Missouri)\n\nThe Bureau of Vital Records has certificates of Missouri births from 1910 to the present. The Bureau also maintains certificates of Missouri deaths that are less than fifty years old. House Bill 1634 (2004) transferred all death records over fifty years old to the Missouri State Archives (Search Missouri Death Certificate)\n\nThe database currently contains over 185,000 records from 87 counties. Information found in this database includes:\n\nBirths and Stillbirths: name of child, date and place of birth, sex, and race; nationality, residence, and ages of parents, occupation and full name of father, maiden name of mother, name and address of medical or other attendant making return; in case of stillbirth, name of undertaker and place of burial.\n\nDeaths: date of report, name, sex, color, age, occupation, marital status, nationality, birthplace; date, place, and cause of death; date and place of burial, addresses of undertaker, physician returning certificate.\n\n\n\nView sample birth record: [ small ] [ large ] View sample stillbirth record: [ small ] [ large ] View sample death record: [ small ] [ large ]\n\nFor more information about the Birth and Death Records:\n\n[ Search Tip ]\n\nThe Birth and Death Records Database can be searched by entering all or part of a name. It is recommended to enter just the last name. The search engine is designed to search for keywords. Entering \"William\" will find records containing the first or last name of \"William\", \"Williams\", or \"Williamson.\" The birth and stillbirth records search the name of the child, mother's name, mother's maiden name, and name of father. All records for a county can also be viewed by selecting the county and leaving the name blank.\n\n"}, {"url": "https://www.spokeo.com/Joe-Brown/Missouri", "page_content": "Showing 5 records from over 100 Criminal Records & Traffic Violations that matched the name Joe Brown:\n\nDisclaimer: By using this website, you accept the Spokeo Terms of Use. Spokeo is not a consumer reporting agency as defined by the Fair Credit Reporting Act (FCRA). This site should not be used to make decisions about employment, tenant screening, or any purpose covered by the FCRA.\n\n\n\nThe records were matched using first and last name only. The records below may not pertain to the individual that you're looking for, and may or may not pertain to the same charge. Please make your own determination of the relevance of these court records."}, {"url": "https://www.findagrave.com/memorial/169497895/joe-lewis-brown", "page_content": "Joe Lewis Brown\n\nAugust 20, 2016:\n\n\n\nJoe Lewis Brown, 77, of Williamsburg, Missouri passed away on August 20, 2016 at Audrain Medical Center in Mexico, Missouri.\n\n\n\nFuneral services will be at 11:00 a.m. on Wednesday, September 7 , 2016 at Debo Funeral Home in Fulton. Burial will follow at Yucatan Cemetery near Williamsburg. Visitation will be from 10:00 a.m. until time of services at the funeral home.\n\n\n\nJoe was born June 10, 1939 in Williamsburg to Herbert and Leona Forrest Brown, Sr. and they preceded him in death. He had been married to Mary Pat Mahaney and she survives.\n\nHe attended Fulton Public Schools and then worked at Gaspers Truck Stop, on a barge on the Missouri River, Fosters Cattle Farm in Auxvasse, Callaway County Nuclear Plant and then as a bus driver for North Callaway Schools until his retirement.\n\n\n\nJoe lived his entire life in the Yucatan and Williamsburg area and he had been a member of the Williamsburg Lions Club and Operators Engineers Local 513 out of St. Louis. He enjoyed pitching horse shoes, playing cards, drinking his beer and whiskey, going deer hunting and spending time at the deer camp.\n\n\n\nHe is survived by daughters, Lisa (Cristin) Groom of Kansas City, Missouri and Joanna (Edward) Anthony of Holts Summit, Missouri; sister, Leastermae \"Cookie\" Brown of Williamsburg; brothers, John W. (Evelyn) Brown of Kingdom City and James M. Brown of Williamsburg; grandchildren, Shawnna Brown, Shawn Brown, Andrea (Jamie) Mulchahey, Amber Butler, Alainnah Anthony and Sherrod Sanning ; great-grandchildren, Thojuree Johnson, Tomisaac Johnson, Xavier Walker, Keaton Walker, Avery Mulchahey, Harper Mulchahey, La'Kendrick Gurley, Jackson Brown, Grant Brown and Kyndrie Brown along with many other loving family members and friends.\n\n\n\nHe was also preceded in death by son, Joe Lewis Brown, Jr.; daughters, Leona Mae Tapp, Sandra Kathleen Brown; sister, Joyce Sara Ann Brown and brothers, Herbert Hadley Brown, Jr. and Alvin Brown.\n\nJoe Lewis Brown\n\nAugust 20, 2016:\n\n\n\nJoe Lewis Brown, 77, of Williamsburg, Missouri passed away on August 20, 2016 at Audrain Medical Center in Mexico, Missouri.\n\n\n\nFuneral services will be at 11:00 a.m. on Wednesday, September 7 , 2016 at Debo Funeral Home in Fulton. Burial will follow at Yucatan Cemetery near Williamsburg. Visitation will be from 10:00 a.m. until time of services at the funeral home.\n\n\n\nJoe was born June 10, 1939 in Williamsburg to Herbert and Leona Forrest Brown, Sr. and they preceded him in death. He had been married to Mary Pat Mahaney and she survives.\n\nHe attended Fulton Public Schools and then worked at Gaspers Truck Stop, on a barge on the Missouri River, Fosters Cattle Farm in Auxvasse, Callaway County Nuclear Plant and then as a bus driver for North Callaway Schools until his retirement.\n\n\n\nJoe lived his entire life in the Yucatan and Williamsburg area and he had been a member of the Williamsburg Lions Club and Operators Engineers Local 513 out of St. Louis. He enjoyed pitching horse shoes, playing cards, drinking his beer and whiskey, going deer hunting and spending time at the deer camp.\n\n\n\nHe is survived by daughters, Lisa (Cristin) Groom of Kansas City, Missouri and Joanna (Edward) Anthony of Holts Summit, Missouri; sister, Leastermae \"Cookie\" Brown of Williamsburg; brothers, John W. (Evelyn) Brown of Kingdom City and James M. Brown of Williamsburg; grandchildren, Shawnna Brown, Shawn Brown, Andrea (Jamie) Mulchahey, Amber Butler, Alainnah Anthony and Sherrod Sanning ; great-grandchildren, Thojuree Johnson, Tomisaac Johnson, Xavier Walker, Keaton Walker, Avery Mulchahey, Harper Mulchahey, La'Kendrick Gurley, Jackson Brown, Grant Brown and Kyndrie Brown along with many other loving family members and friends.\n\n\n\nHe was also preceded in death by son, Joe Lewis Brown, Jr.; daughters, Leona Mae Tapp, Sandra Kathleen Brown; sister, Joyce Sara Ann Brown and brothers, Herbert Hadley Brown, Jr. and Alvin Brown."}, {"url": "https://www.wikitree.com/wiki/Brown-27598", "page_content": "Joseph B Brown\n\n1817 in Blount, Tennessee, United States Bornin\n\nAncestors\n\nAsenith Farmer Badgett Husband of— married 20 Oct 1843 in Blount County, Tennessee, USA\n\nDescendants\n\nGeorge Alexander Brown Father of\n\n7 Jul 1865 at about age 48 in St Louis, St Louis, Missouri, United States Diedin\n\nProfile last modified 5 Aug 2019 | Created 18 Apr 2014\n\nThis page has been accessed 190 times.\n\nBiography\n\nThis biography was auto-generated by a GEDCOM import.[1] It's a rough draft and needs to be edited.\n\nThis biography was auto-generated by a GEDCOM import.[2] It's a rough draft and needs to be edited.\n\nName\n\nBirth\n\nBirth: Date: 1817 Place: Blount County, Tennessee, USA[11][12]\n\nDeath\n\nDeath: Date: 07 JUL 1865 Place: Saint Louis, Independent Cities, Missouri, USA[13][14][15][16]\n\nResidence\n\nResidence: Age: 33 Date: 1850 Place: District 10, Blount, Tennessee[17] Residence: Age: 40 Date: 1860 Place: District 10, Blount, Tennessee, United States[18][19]\n\nBurial\n\nBurial: Date: 07 JUL 1865 Place: Lemay, St. Louis County, Missouri, USA[20][21][22][23]\n\nMarriage\n\nSources\n\nSource: S-785345887 Repository: #R-1198373012 Title: Ancestry Family Trees Publication: Online publication - Provo, UT, USA: Ancestry.com. Original data: Family Tree files submitted by Ancestry members. Page: Ancestry Family Tree Data: Text: http://trees.ancestry.com/pt/AMTCitationRedir.aspx?tid=65046751&pid=279\n\nRepository: #R-1198373012 Title: Ancestry Family Trees Publication: Online publication - Provo, UT, USA: Ancestry.com. Original data: Family Tree files submitted by Ancestry members. Page: Ancestry Family Tree Data: Text: http://trees.ancestry.com/pt/AMTCitationRedir.aspx?tid=65046751&pid=279 Repository: R-1198373012 Name: Ancestry.com\n\nName: Ancestry.com Source: S112 Author: Ancestry.com Title: 1850 United States Federal Census Publication: Name: Ancestry.com Operations, Inc.; Location: Provo, UT, USA; Date: 2009; Repository: #R1\n\nAuthor: Ancestry.com Title: 1850 United States Federal Census Publication: Name: Ancestry.com Operations, Inc.; Location: Provo, UT, USA; Date: 2009; Repository: #R1 Repository: R1 Name: Ancestry.com Address: http://www.Ancestry.com E-Mail Address: Phone Number:\n\nName: Ancestry.com Address: http://www.Ancestry.com E-Mail Address: Phone Number: Source: S113 Author: Ancestry.com Title: Web: Missouri, Find A Grave Index, 1812-2012 Publication: Name: Ancestry.com Operations, Inc.; Location: Provo, UT, USA; Date: 2012; Repository: #R1\n\nAuthor: Ancestry.com Title: Web: Missouri, Find A Grave Index, 1812-2012 Publication: Name: Ancestry.com Operations, Inc.; Location: Provo, UT, USA; Date: 2012; Repository: #R1 Source: S15 Author: Ancestry.com Title: Selected U.S. Federal Census Non-Population Schedules, 1850-1880 Publication: Name: Ancestry.com Operations, Inc.; Location: Provo, UT, USA; Date: 2010; Repository: #R1\n\nAuthor: Ancestry.com Title: Selected U.S. Federal Census Non-Population Schedules, 1850-1880 Publication: Name: Ancestry.com Operations, Inc.; Location: Provo, UT, USA; Date: 2010; Repository: #R1 Source: S20 Author: National Cemetery Administration Title: U.S. Veterans Gravesites, ca.1775-2006 Publication: Name: Ancestry.com Operations Inc; Location: Provo, UT, USA; Date: 2006; Repository: #R1\n\nAuthor: National Cemetery Administration Title: U.S. Veterans Gravesites, ca.1775-2006 Publication: Name: Ancestry.com Operations Inc; Location: Provo, UT, USA; Date: 2006; Repository: #R1 Source: S83 Author: Ancestry.com Title: U.S., Find A Grave Index, 1600s-Current Publication: Name: Ancestry.com Operations, Inc.; Location: Provo, UT, USA; Date: 2012; Repository: #R1\n\nAuthor: Ancestry.com Title: U.S., Find A Grave Index, 1600s-Current Publication: Name: Ancestry.com Operations, Inc.; Location: Provo, UT, USA; Date: 2012; Repository: #R1 Source: S91 Author: Ancestry.com Title: 1860 United States Federal Census Publication: Name: Ancestry.com Operations, Inc.; Location: Provo, UT, USA; Date: 2009; Repository: #R1\n\nAuthor: Ancestry.com Title: 1860 United States Federal Census Publication: Name: Ancestry.com Operations, Inc.; Location: Provo, UT, USA; Date: 2009; Repository: #R1 Source: S95 Author: Ancestry.com Title: U.S. National Cemetery Interment Control Forms, 1928-1962 Publication: Name: Ancestry.com Operations, Inc.; Location: Provo, UT, USA; Date: 2012; Repository: #R1\n\nAuthor: Ancestry.com Title: U.S. National Cemetery Interment Control Forms, 1928-1962 Publication: Name: Ancestry.com Operations, Inc.; Location: Provo, UT, USA; Date: 2012; Repository: #R1 Source: S98 Author: Ancestry.com Title: Tennessee State Marriages, 1780-2002 Publication: Name: Ancestry.com Operations Inc; Location: Provo, UT, USA; Date: 2008; Repository: #R1"}, {"url": "https://stlouis.genealogyvillage.com/stlouisbirth08052018.htm", "page_content": "St. Louis Missouri Births Compiled by David A. Lossos - August 2018\n\nOne of my pet projects the last few years is the creation of a genealogical database in which everyone included is somehow related to St. Louis. In addition to my own personal and professional research I've entered data into a Legacy 8 database from the following sources:\n\n(A) \"St. Louis: The Fourth City, 1764 -1909\" Volume II and III by Walter B. Stevens (2,145 pages)\n\n(B) \"The Book of St. Louisans\" by John W. Leonard in 1906 (603 pages)\n\n(C) \"Edwards's Great West and Her Commercial Metropolis\" by Richard Edwards and M. Hopewell in 1860 (605 pages)\n\n(D) \"Annals of St. Louis in its Territorial Days from 1804 to 1821\" by Frederic L. Billon in 1888 (428+ pages)\n\n(E) \"Encyclopedia of the History of St. Louis\" William Hyde and Howard L. Conard in 1899 (2572 pages\n\n(F) \"Final Resting Place\" by Kevin Amsler (220 pages)\n\n(F) \"Tales from Bellefontaine Cemetery\" by Carol Ferring Shepley in 2008 (372 pages).\n\nFind someone of interest and contact me for possibly more info - Dave Lossos at [email protected]\n\nTo return to the \"Genealogy in St. Louis\" Web Site click here."}, {"url": "https://www.dignitymemorial.com/obituaries/fulton-mo/joe-brown-7075223", "page_content": "OBITUARY\n\nJoe Lewis Brown\n\nJune 10, 1939 – August 20, 2016\n\nIN THE CARE OF Debo Funeral Home\n\nJoe Lewis Brown, 77, of Williamsburg, Missouri passed away on August 20, 2016 at Audrain Medical Center in Mexico, Missouri. Funeral services will be at 11:00 a.m. on Wednesday, September 7 , 2016 at Debo Funeral Home in Fulton. Burial will follow at Yucatan Cemetery near Williamsburg. Visitation will be from 10:00 a.m. until time of services at the funeral home. Joe was born June 10, 1939 in Williamsburg to Herbert and Leona Forrest Brown, Sr. and they preceded him in death. He had been married to Mary Pat Mahaney and she survives. He attended Fulton Public Schools and then worked at Gaspers Truck Stop, on a barge on the Missouri River, Fosters Cattle Farm in Auxvasse, Callaway County Nuclear Plant and then as a bus driver for North Callaway Schools until his retirement. Joe lived his entire life in the Yucatan and Williamsburg area and he had been a member of the Williamsburg Lions Club and Operators Engineers Local 513 out of St. Louis. He enjoyed pitching horse shoes, playing cards, drinking his beer and whiskey, going deer hunting and spending time at the deer camp. He is survived by daughters, Lisa (Cristin) Groom of Kansas City, Missouri and Joanna (Edward) Anthony of Holts Summit, Missouri; sister, Leastermae “Cookie” Brown of Williamsburg; brothers, John W. (Evelyn) Brown of Kingdom City and James M. Brown of Williamsburg; grandchildren, Shawnna Brown, Shawn Brown, Andrea (Jamie) Mulchahey, Amber Butler, Alainnah Anthony and Sherrod Sanning ; great-grandchildren, Thojuree Johnson, Tomisaac Johnson, Xavier Walker, Keaton Walker, Avery Mulchahey, Harper Mulchahey, La’Kendrick Gurley, Jackson Brown, Grant Brown and Kyndrie Brown along with many other loving family members and friends. He was also preceded in death by son, Joe Lewis Brown, Jr.; daughters, Leona Mae Tapp, Sandra Kathleen Brown; sister, Joyce Sara Ann Brown and brothers, Herbert Hadley Brown, Jr. and Alvin Brown.\n\nSee more\n\nSee Less"}, {"url": "https://www.gormanscharpf.com/obituary/joe-brown", "page_content": "Joe William Brown was born December 11, 1938 and had his peaceful departure June 28, 2020.\n\nBorn to Lois McMorris and Leon Brown in Bay, Arkansas Joe later moved to Springfield, Missouri. At 18 years of age he married the love of his life, Jenell C. Brown, with whom he enjoyed 59 years of love, laughter, great food, and the occasional tongue lashing. It was from this union they started their family: daughter Gayla (Brown)-Fewell, who then married William D. Fewell, who had a son Douglas J. Fewell, who had 2 children Zyra and Brayden. Beyond all things it was this family that Joe loved and cherished and carried in his heart for all his days.\n\nAmong the list of jobs Joe had in his younger days, it was Kraft Foods where he spent the majority of his career. He retired in 1992 after working over 30 years. In this time he met many of his lifetime friends, whom he also cherished beyond measure, Howell B. Lewis, being the closest friend of all.\n\n\n\nA very active man most of his life, with many accomplishments, including being a Golden Glove Boxing champion. He also was a lifetime golfer and enjoyed many years playing with another great friend of his (Dan), and even was put into the Springfield News-Leader for achieving a hole-in-one, by far the most difficult shot to execute, but then again that alone speaks volumes about his drive and determination to the things he loved. He also enjoyed walking long distances (7 miles per day) and lifting weights with his grandson late into his 70's. Joe also enjoyed giving. He was a blood donor at the American Red Cross and over his lifetime gave over 8 gallons of blood. After his retirement, Joe enjoyed giving his time; he served his community by volunteering for Sunset Church of Christ, where he was an active member for many years. Joe was loyal to his Christian faith and read his Bible every day for years upon years.\n\nJoe was preceded in death by his wife Jenell C. Brown, parents Leon Brown, and Lois McMorris, stepfather Lawrence Tureaud, and siblings Savoy Tureaud, Arthur Lee Tureaud, and Lawrence\" Butch\" Tureaud, and his best friend Howell B. Lewis.\n\nJoe is survived by his daughter Gayla L. Fewell, son-in-law William D. Fewell, grandson Douglas J. Fewell,great- grandchildren Zyra S. Fewell, and Brayden J. Hurst-Fewell. He is also survived by his siblings Robert D. Brown, Patricia Starks, Penitia Brown, Ella Tureaud, Arzo Tureaud, and Miles McMorris.\n\nVisitation will be held at Gorman-Scharpf Funeral Home, 1947 E. Seminole St., Springfield, MO 65804 on Wednesday July 1, 2020 from 2:00 PM - 5:00 PM. Graveside services will be at Hazelwood Cemetery, 1642 E. Seminole St., Springfield, MO 65804 on Thursday July 2, 2020 at 11:00 AM.\n\nOn behalf of the family of Joe W. Brown we would like to thank you all for joining us in celebrating the life of a truly great and loving man. He will surely be missed, but we are content in our faith that he is in heaven rejoicing and dancing once again with the love of his life. We know that this is not a goodbye. Just a see you later."}, {"url": "https://www.ancientfaces.com/person/joseph-brown-birth-1932-death-2002/65109113", "page_content": "Refresh this page to see various historical events that occurred during Joseph's lifetime.\n\nIn 1932, in the year that Joseph Brown was born, on February 27th, actress Elizabeth Taylor was born in London. Her parents were Americans living in London and when she was 7, the family moved to Los Angeles. Her first small part in a movie was in There's One Born Every Minute in 1942 but her first starring role was in National Velvet in 1944. She became as famous for her 8 marriages (to 7 people) as she was for her beauty and films.\n\nIn 1948, at the age of 16 years old, Joseph was alive when on May 14th, the State of Israel was proclaimed by David Ben-Gurion, who became Israel's first Premier, and the U.S. officially recognized Israel. That evening, Egypt launched an air assault on Israel.\n\nIn 1959, by the time he was 27 years old, on August 8th, Hawaii became the 50th state of the United States. The US flag was changed to show 50 stars.\n\nIn 1975, by the time he was 43 years old, on September 5th, Lynette \"Squeaky\" Fromme tried to assassinate President Ford in Sacramento, California. She failed when her gun wouldn't fire. President Ford escaped a second assassination attempt 17 days later on September 22 when Sarah Jane Moore tried to shoot him in San Francisco. A bystander saw her raise her arm, grabbed it, and the shot went wild.\n\nIn 1980, at the age of 48 years old, Joseph was alive when on December 8th, ex-Beatle John Lennon was shot and killed by Mark David Chapman in front of his home - the Dakota - in New York City. Chapman was found guilty of murder and still remains in jail."}, {"url": "https://www.wikitree.com/genealogy/BROWN", "page_content": "BROWN Genealogy\n\nWikiTree is a community of genealogists growing an increasingly-accurate collaborative family tree that's 100% free for everyone forever. Please join us.\n\nSponsored Search\n\nPlease join us in collaborating on BROWN family trees. We need the help of good genealogists to grow a completely free shared family tree to connect us all.\n\nB Genealogy > BROWN\n\nA | B | C | D | E | F | G | H | I | J | K | L | M | N | O | P | Q | R | S | T | U | V | W | X | Y | Z"}]}