{"Joe Brown played in the minor leagues for two years before making his major league debut in 1908.": [{"url": "https://www.sports-management-degrees.com/10-first-african-american-players-in-major-league-baseball/", "page_content": "Image Source\n\nSome people may write off sports as mere entertainment, but perhaps they should look a little closer. Sports can not only ignite the passions, allegiances and fanaticism of millions, but also help people to overcome racial prejudice and discrimination. Read on for an inside look at ten of the first African-American baseball players to break the color line and play in Major League Baseball (MLB) in the modern era. These pioneers in one of America’s favorite sports withstood abuse and resentment from crowds and teammates alike. Yet they persevered, changing the face of the game and making valuable contributions to the American civil rights movement.\n\n10. Curt Roberts – 1954-1956\n\nr\n\nImage Source\n\nSecond baseman Curt Roberts made history on April 13, 1954, when he became the first African-American to play for the Pittsburgh Pirates. Roberts first made a name for himself in the Negro Leagues with the Kansas City Monarchs. He also played in Minor League Baseball (MiLB) and the Mexican League before joining up with the Pirates. General manager Branch Rickey signed Roberts to the team after facing mounting pressure from the local black community. Roberts was chosen not only for his baseball skills, but also for his calm personality, which helped him cope with the racial slurs and heckling he took.\n\nRoberts’ MLB career was destined to be short-lived, however, as his batting average dropped significantly in his second season with the Pirates. As he feared that the mounting racial abuse was affecting Roberts’ game, Brooklyn Dodgers’ second baseman Jackie Robinson contacted Roberts offering support and encouragement. Sadly, it didn’t help, and Roberts was cut from the team in the 1955 season.\n\nMLB.com journalist Tom Singer wrote, “Roberts humanized the ongoing integration of baseball by thrashing the perception that African-Americans had to be superstars to find a place in a big league world of white bench players. He was a flop. Yet the tide of integration continued to roll across the Major League landscape, with healthier expectations.”\n\n9. Ernie Banks – 1953-1971\n\nImage Source\n\nErnie Banks began his baseball career in the Negro American League with the Kansas City Monarchs. The Chicago Cubs signed him in 1953, and on September 17 that year he became the first African-American player to compete for the team. Banks flourished in MLB and went on to appear for the Cubs for 19 seasons, playing as shortstop and first baseman. He joined the 500 home run club on May 12, 1970, and by the time his career ended in 1971 he had hit 512 home runs and held the record (at the time) for the most home runs as a shortstop. In 1955, Banks hit five grand slams in a season – a record that remained unbroken for more than three decades.\n\nBanks retired on December 1, 1971 but stayed with the Cubs as a coach. During his career, he earned the nicknames “Mr. Cub” and “Mr. Sunshine,” and he is still one of Chicago’s most beloved players. In 1977 Banks received a spot in the National Baseball Hall of Fame, and in 2011 he was honored for his contribution to civil rights. In an interview with website AARP.com, he said, “I tried to get along with people who did not normally associate with blacks – and didn’t know anything about blacks. I let them know there’s good and bad in every ethnic group.”\n\n8. Bob Trice – 1953-1955\n\nImage Source\n\nPitcher Bob Trice debuted for the Philadelphia Athletics (now Oakland Athletics) on September 13, 1953, becoming the first African-American to play for the team. Prior to appearing in MLB, Trice had struggled in MiLB, but he excelled with the International League’s Ottawa A’s, and his brilliant performance earned him his place with the Athletics. Although his MLB career was short-lived, Trice’s work challenging racial intolerance as an early African-American professional baseball pioneer cannot be over-emphasized.\n\n“Black players encountered racial barriers, both on and off the field: teammates refusing to shake hands, fans shouting out insults, whites-only signs and many other painful struggles just to play baseball,” said previous entry Ernie Banks. “Today’s black athletes and major league players have no idea what we had to endure.” Trice ended his career with a 5.80 earned run average (ERA) and a batting average of .288.\n\n7. Willie Mays – 1951-1973\n\nImage Source\n\nWillie Mays began his career with the Chattanooga Choo-Choos in 1947. Then in 1950 the New York Giants signed him up to their Class-B affiliate in Trenton, New Jersey. The following year, he had been promoted to Triple-A Minneapolis, and when he was called up to the New York Giants on May 24, 1951, Mays was skeptical about such a sudden rise. Nevertheless, his plane ticket was on its way and his manager was persistent, so there was no getting around it.\n\nMays struggled in his first 12 times at bat but hit a home run on his thirteenth. From that moment on, it was only a matter of time before he would become a baseball legend. Mays said that whenever people in the crowd heckled him and called him names, he just hit harder. On one occasion the announcer encouraged the crowd to leave him alone because he was killing the opposition.\n\nMays also played for the San Francisco Giants and the New York Mets, and during his career he hit 660 home runs. After his playing days were over, Mays was the Mets’ hitting instructor up through 1979, and in 1986 he became the special assistant to the president of the San Francisco Giants. In 1979, he earned a place in the National Baseball Hall of Fame.\n\n6. Sam “The Jet” Jethroe – 1950-1954\n\nImage Source\n\nSam Jethroe, also known as “The Jet,” was a center fielder known for his speed. In 2001 fellow African-American player Don Newcombe described him as “the fastest human being I’ve ever seen.” Jethroe played in the Negro Leagues for several years before being traded to the Boston Braves’ in October 1949 for a whopping $150,000. In 1950 he was awarded Rookie of the Year after stealing 35 bases – 18 more than any other MLB player during the same period.\n\nIn 1954 Jethroe left MLB and joined the International League. After retiring, he moved to Pennsylvania, where he got a job in a factory and eventually opened a tavern. In 1994, he brought a case against MLB for the pensions he and other black players had been denied. Jethroe argued that they weren’t given the chance to play long enough to earn pensions owing to the racial discrimination of the ‘40s and ‘50s. Although the case was dismissed, MLB chose to give Negro League veterans – including Jethroe – an annual pension in 1997.\n\n5. Monte Irvin – 1949-1956\n\nImage Source\n\nLeft fielder Monte Irvin was 30 years old when he finally got his chance to play in MLB. Irvin began his career in 1938 in the Negro Leagues with the Newark Eagles, and he also played for Azules de Veracruz in the Mexican League in 1942. Like other black players of his era, Irvin wished he’d had an opportunity to play in MLB ten years earlier, but racial prejudice delayed his debut until July 8, 1949. “All these players were great players and I said, ‘Well, I’ve got the chance and I’ll do the best I can, but I sure wish they’d signed me earlier,’” Irvin explained in an interview. “But we all did the best we could, played well, and most of us tried to set an example for those who came after us.”\n\nIrvin played for the New York Giants from 1949 to 1955 and was on the Chicago Cubs team for one season in 1956. He returned to MiLB for one more year before retiring. Although he no longer played baseball professionally, Irvin’s career in sports was far from over. He had a job as a scout for the New York Mets between 1967 and 1968 and then went on to work as a public relations expert for Bowie Kuhn, the fifth Commissioner of MLB, from 1968 to 1984.\n\n4. Willard “Home Run” Brown – 1947\n\nImage Source\n\nEven though his time in MLB was short-lived, Willard “Home Run” Brown still made a significant contribution to the acceptance of African-American baseball players. Brown was an outfielder known for his sheer power, and according to the Society for American Baseball Research, he “was one of the most feared hitters in the Negro Leagues.”\n\nBrown made his MLB debut for the St. Louis Browns on July 19, 1947 – two days after Hank Thompson – and made history as the first African-American player in the American League ever to hit a home run. Sadly, Brown couldn’t take the racial abuse he was forced to endure, and he only played 21 MLB games. After leaving the Browns, he enjoyed a prolific season in Puerto Rico, and in 2006 he achieved a place in the National Baseball Hall of Fame and the Caribbean Baseball Hall of Fame.\n\n3. Hank Thompson – 1947-1956\n\nImage Source\n\nHank Thompson, pictured above (right), was a left-handed hitter and third baseman known for his exceptionally strong throwing arm. He played in the Negro Leagues with the Kansas City Monarchs before making his MLB debut playing for the St. Louis Browns on July 17, 1947. He was the team’s first African-American player, but unfortunately he was released after just over a month. During his time with the Browns, Thompson made MLB history with fellow African-American teammate Willard Brown. On July 20, 1947, the pair became the first two African-American players to appear in the same starting lineup.\n\nIn 1948, Thompson returned to the Negro Leagues, playing with the Monarchs. Then in 1949 he broke another color line when he signed for the New York Giants, becoming the first African-American to play in the National and American leagues – and he also became the first African-American player to break the color line with two separate teams. Thompson helped make history in the 1951 World Series as part of the first all African-American outfield in MLB alongside Willie Mays (center) and Monte Irvin (left). The National Baseball Hall of Fame calls Thompson an “integration trailblazer.”\n\n2. Larry Doby – 1947-1959\n\nImage Source\n\nOn July 5, 1947, center fielder Larry Doby became the first African-American to play for the Cleveland Indians. He was also the first black player to go directly from the Negro Leagues to MLB. “I got a lot of resentment from a lot of teammates,” Doby said. “But after a period of time they got an opportunity to judge me for who I was and not the color of my skin.” He also stated, “I think that’s one of the biggest things that happened in baseball, that we were able to integrate and judge for ourselves what kind of character these people had.”\n\nDoby was the second African-American baseball player to break the color line and play in MLB. He was a true pioneer who also went on to join the Chicago White Sox and the Detroit Tigers. However, by 1960 Doby had sustained several debilitating injuries and the White Sox released him. After failing a medical test with the Toronto Maple Leafs thanks to a badly injured ankle, Doby went on to become the third American to play in Japan’s Nippon Professional Baseball league when he signed for the Chunichi Dragons in 1962. Then in 1978 he became the manager of the White Sox, making him the second African-American manager in MLB history.\n\n1. Jackie Robinson – 1947-1956\n\nImage Source\n\nJackie Robinson is one of the most famous baseball greats on this list. On April 15, 1947, he played first base for the Brooklyn Dodgers, making him the first African-American to smash the MLB color line in the modern era. This moment went down in history and opened the door for many more players to follow in his footsteps.\n\nRobinson was chosen not only because he could play excellent ball, but also because Branch Rickey, general manager of the Brooklyn Dodgers, believed he could withstand the inevitable prejudice and racial discrimination he would encounter – both on and off the field. After a three-hour discussion, Rickey questioned Robinson on whether he’d be able deal with the abuse without losing his cool. Robinson replied, “Are you looking for a negro who is afraid to fight back?” To which Rickey philosophically replied, “Robinson, I’m looking for a ballplayer with guts enough not to fight back.”\n\nRobinson’s debut marked the beginning of an exceptional career that saw him rise to the height of baseball legend. His accomplishments include becoming 1947’s Rookie of the Year, being picked six times for All-Star Games, and receiving the National League Most Valuable Player Award in 1949. Perhaps more importantly, he challenged deeply rooted segregation and made a valuable contribution to the civil rights movement. Robinson retired from baseball on January 5, 1957 and landed a spot in the National Baseball Hall of Fame in 1962. In 1997, MLB retired Robinson’s number 42 across all MLB teams. Robinson is the first professional athlete to receive such an honor.\n\nOther Articles of Interest:"}, {"url": "https://www.history.com/topics/sports/negro-league-baseball", "page_content": "Negro League Baseball got its start thanks to the increasing popularity of two things after the Civil War : baseball and segregation . The National Association of Amateur Base Ball Players rejected African American membership in 1867, and in 1876, owners of the professional National League adopted a “gentleman’s agreement” to keep Black players out. Subsequent African American players found their greatest opportunities with traveling teams until 1920, when Rube Foster launched the Negro National League. Reformulated several times with new leagues and owners, Negro League baseball enjoyed periods of success in the early 1920s and again after the Great Depression . However, Jackie Robinson ’s integration of baseball in 1947 prompted a slow but irreversible influx of talent to the majors, and the remaining Negro League teams generally folded by the 1960s.\n\nFormation of Baseball’s Color Line\n\nAs the expanding popularity of baseball in the United States led to the formation of amateur clubs in the second half of the 19th century, African Americans were among those joining the action. Records exist of an abbreviated game between two Black teams as far back as 1855, and by the end of the decade there were several African American clubs in the New York area.\n\nHowever, the continued development of the sport led to attempts to exclude Black players from its highest ranks. In 1867, the National Association of Amateur Base Ball Players elected to reject applications from African American clubs. In 1876, the professional National League was formed by owners intent on keeping it a white man’s game.\n\nRegardless, African Americans continued to play and even thrive at various levels of professional baseball. In 1884, catcher Moses Fleetwood Walker of the Toledo Blue Stockings became the first African American to play in what was then considered a major league. However, Walker and fellow African Americans often faced outright hostility and physical intimidation from both teammates and opponents. In one case, 19th-century superstar Cap Anson of the Chicago White Stockings threatened to cancel a game with Toledo if Walker was in the lineup.\n\nSeveral of the top Black players of the era, including infielders Frank Grant and Bud Fowler and pitcher George Stovey, relocated to the prominent International League playing in New York, New Jersey and southeast Canada. However, racial tensions persisted, and in 1887 African Americans were barred from signing new contracts in that circuit as well.\n\nBy the 1890s, Black players were increasingly facing exclusion from organized baseball and finding more opportunities with traveling teams. The Cuban Giants, formed in 1885 under the pretense of being dark-skinned Latin Americans, traversed the East in a private railroad car to play local squads. Fowler’s Page Fence Giants enjoyed impressive success against both Black and white opponents, winning 118 of 154 games in 1895.\n\nThe close of the century brought an end to formal integrated baseball. In 1899, Bill Galloway appeared in five games for Woodstock, Ontario, of the Canadian League. Save for attempts to pass African Americans off as Spanish or Native American, there would be no more Black players in white professional leagues for more than four decades.\n\nRise of the Negro Leagues\n\nSegregation notwithstanding, Black players continued to find ways to foster high-level competition in major northern cities. The first “Colored Championship of the World” was held in 1903, with pitcher Rube Foster leading the Cuban X-Giants to victory over the Philadelphia Giants.\n\nAttempts to establish an organized circuit sputtered on several occasions: The integrated International League of Independent Baseball endured a rocky season in 1906 before dissolving, and the planned National Negro Baseball League came and went in 1910 before a single game was played. Top teams like the Leland Giants of Chicago and the Lincoln Giants of New York enjoyed some staying power, but were often at the mercy of white booking agents who controlled access to large stadiums.\n\nRube Foster Founds The Negro National League\n\nA turning point for Black baseball came in 1920, when Rube Foster founded the Negro National League. It launched with eight teams: Chicago American Giants, Chicago Giants, Cuban Stars, Dayton Marcos, Detroit Stars, Kansas City Monarchs, Indianapolis ABCs and the St. Louis Giants.\n\nAn enterprise of Black ownership, its early financial success prompted the formation of the Eastern Colored League in 1923. The two circuits converged to play the World’s Colored Championship in 1924, and continued the annual series until 1927.\n\nStability proved fleeting for the Negro Leagues, however, as players jumped from squad to squad in pursuit of the highest bidder, and teams skipped league games when a more lucrative exhibition offer surfaced. A vital leader was lost when Foster was institutionalized in 1926, and the Eastern Colored League folded in 1928. It reformulated as the American Negro League in 1929, but the Great Depression proved costly to professional Black baseball, with the Negro Southern League and a few strong independent clubs emerging as the only entities to survive the 1932 season.\n\nIn 1933, Pittsburgh Crawfords owner and numbers kingpin Gus Greenlee restarted the Negro National League. That year he introduced the East-West All-Star Game in Chicago, which became the sport’s biggest annual event, attracting more than 50,000 fans at its peak.\n\nThe Negro Leagues enjoyed a resurgence of success thanks to the backing of owners who became rich through gambling and other illegal operations, as well as the dazzling performances of top players. Some, like catcher Josh Gibson, earned renown for hitting tremendous home runs, but Black baseball primarily became known for showcasing a style of speed, daring play and showmanship. Its most famous player, pitcher Satchel Paige, might guarantee to strike out the first six batters he faced, or order his outfielders to the dugout in the middle of an inning. Still, its stars knew to buckle down during exhibitions against white All-Star teams, and enjoyed a strong record in those matchups.\n\nIn 1937, the Negro American League was formed from teams in the Midwest and South to counter the Negro National League. The sport’s health seemingly stronger than ever, an estimated 3 million fans turned out to watch Negro League teams play in 1942, with its World Series revived that September.\n\nJackie Robinson Integrates Baseball\n\nBy that point, the push to integrate major league baseball was slowly gaining steam. In 1942, former UCLA athletic star Jackie Robinson and another Black player named Nate Moreland were granted a cursory workout with the Chicago White Sox. The 1944 death of Baseball Commissioner Kenesaw Mountain Landis, a strict segregationist, provided another opening, and in 1945 sportswriters engineered tryouts for Negro Leaguers with the Brooklyn Dodgers and Boston Red Sox, the latter again involving Robinson.\n\nAs it turned out, Dodgers general manager Branch Rickey was already scouting African Americans, ostensibly for a new Negro league but in reality for his major league team. He forged a secret arrangement with Robinson in August 1945, and shook the baseball world with his official announcement in October.\n\nFollowing an outstanding season with the minor league Montreal Royals in 1946, Robinson officially integrated major league baseball by manning first base for the Dodgers on April 15, 1947. On July 5, former Newark Eagles star Larry Doby became the second Black big leaguer by suiting up for the Cleveland Indians. Three more appeared in the majors by the end of the year, and the following season, after signing the now-42-year-old Paige, Cleveland went on to win the World Series.\n\nThe End of the Negro Leagues\n\nThe successes of Robinson, Doby and other African Americans like Roy Campanella and Monte Irvin drew the attention of Black communities and drained the Negro Leagues of its fan base. The Negro National League disbanded in 1948, and the Negro American League limped through the 1950s, its attempts to sign white players and women having little lasting impact on the turnstiles.\n\nIn the meantime, despite the growing power of the civil rights movement, major league baseball was proving slow to change; as late as August 1953, only six of its 16 teams were fielding Black players. However, the historic accomplishments of young stars like Willie Mays, Hank Aaron and Ernie Banks soon prompted organizations to change their ways, and in 1959, the Red Sox became the last major league team to integrate with the addition of infielder Elijah “Pumpsie” Green.\n\nThe following year, the Negro American League folded. Some longtime clubs like the Monarchs attempted to stay afloat, but the combination of lower-grade talent and strengthening of major sports franchises led to their extinction through the decade, with only the Indianapolis Clowns managing to survive as a traveling team until ceasing operations in 1989.\n\nOn December 16, 2020, Major League Baseball Commissioner Rob Manfred declared that the seven Negro leagues would be recognized as official major leagues, with their players' records and statistics counted in baseball’s record books.\n\nPhoto Galleries\n\nWhen he made his Brooklyn Dodgers debut on April 15, 1947, Jackie Robinson became the first African American to break the Major League Baseball color barrier. He won the Rookie of the Year Award that season, and went on to become the first Black MVP in 1949. Over a 10-year career, Robinson was selected as an All-Star six times and helped the Dodgers win the World Series in 1955. He was elected to the Major League Baseball Hall of Fame in 1962, and his number 42 was retired across MLB in 1997. (Credit: Photo File / Getty Images) On July 5, 1947, just three months after Jackie Robinson broke the color barrier in the National League, Larry Doby became the American League's first Black player when he suited up for the Cleveland Indians. Doby became a staple of their lineup for eight years, before also playing for the Chicago White Sox and Detroit Tigers. Doby was elected to the Major League Baseball Hall of Fame in 1998. (Credit: Photo File / Getty Images) July 17, 1947: Hank Thompson (left) sits in the dugout with manager \"Muddy\" Ruel before his major league debut for the St. Louis Browns. Thompson would go on to play nine years in the majors, and also broke the color barrier for the San Francisco Giants in 1949. (Credit: Bettmann / Getty Images) Monte Irvin (left) and Hank Thompson (right) became the first African Americans to play for the New York Giants on July 8, 1949. Here they are pictured before Game 2 of the 1951 World Series with teammate Willie Mays, one of the best players in MLB history. (Credit: Bettmann / Getty Images) Sam Jethroe made his big league debut as a 33-year old with the Boston Braves on April 18, 1950. He hit a home run that day, and won the National League Rookie of the Year Award that season. \"The Jet\" twice led the league in stolen bases, but age caught up with him quickly (it was rumored he was older than he'd let on), and he was out of the big leagues in 1954. (Credit: Transcendental Graphics / Getty Images) Although he started his career with the Cleveland Indians in 1949, Cuban-born Minnie Miñoso became the first Black player on the Chicago White Sox when he made his Southside debut on April 19, 1949. He went on to a lengthy career, earning three Gold Gloves and nine All-Star selections during his 17 seasons in Major League Baseball. He retired in 1964, but famously played in three games in 1976, and two more in 1980 (at the age of 54), making him the only big leaguer to play in six different decades. (Credit: Hy Peskin / Getty Images) \"Mr. Cub\" Ernie Banks made his major league debut for the North-siders on September 17, 1953. He would go on to a Hall of Fame career, earning 14 All-Star selections, 2 MVP Awards and smacking over 500 home runs. (Credit: Bettmann / Getty Images) On April 13, 1954, Curt Roberts started for the Pittsburgh Pirates, becoming the first African American player in the club's history. Roberts got the majority of the playing time at second base for the Pirates that year, and would play 171 games in a three-year career. (Credit: Charles 'Teenie' Harris/Carnegie Museum of Art / Getty Images) Tom Alson, pictured here on the trainer's table prior to a game in 1957, broke the color barrier for the St. Louis Cardinals on April 13, 1954. Alston played in 66 games for the Cards that season, but played only sparingly over the next few seasons. He retired after the 1957 season. (Credit: Bettmann / Getty Images) Nino Escalera, pictured (left) during a Puerto Rican Winter League game in 1954, and Chuck Harmon made their debuts for the Cincinnati Reds (or Redlegs as they were known then) on April 17, 1954. Escalera, a native of Puerto Rico, played 73 games for the Reds that year, but never again suited up for a big league team. (Credit: Bettmann / Getty Images) Chuck Harmon, pictured here during a pre-game celebration at the Civil Rights game in 2010, made his major league debut on April 17, 1954. He and teammate Nino Escalera broke the Cincinnati Reds' (known as the Redlegs then) barrier together. Harmon would go on to play 289 games in four years with the Reds, St. Louis Cardinals and Philadelphia Phillies. (Credit: John Grieshop / MLB Photos via Getty Images) Elston Howard broke the color barrier for the New York Yankees when he stepped onto the field on April 14, 1955. Howard quickly became one of the better catchers in the league, eventually earning 12 All-Star selections, two Gold Gloves, four World Series titles and the 1963 MVP Award. (Credit: Bettmann / Getty Images) Carlos Paula Nationals 1954 Dominican-born Ozzie Virgil started his career with the Giants, but joined the Tigers' lineup on June 6, 1958, becoming the first black player in Detroit's history, and the first Dominican player in the Majors. He would play nine years over all, before retiring in 1969. His son, Ozzie Virgil, Jr., enjoyed an 11-year big league career of his own (1980-1990). (Credit: Al Moldvay / Getty Images) On July 21, 1959, Pumpsie Green (left) suited up for the Boston Red Sox, making them the final team to field a Black player. Green would go on to play five seasons of big league baseball, including one with the New York Mets in 1963. (Credit: Bettmann / Getty Images) 1 / 15"}, {"url": "https://bleacherreport.com/articles/683529-hey-kid-let-me-see-some-id-20-youngest-mlb-players-to-debut-since-world-war-i", "page_content": "0 of 20\n\nChristian Petersen/Getty Images\n\nBaseball is a young man's game. Gone are the days of 40-year-old MVPs and late career renaissances that seemed so prevalent in the last two decades of Major League Baseball.\n\nThere seems to be an influx of youth in Major League baseball these days, as performance-enhancing drugs and their impact upon the game have been reduced by baseball's renewed focus on eradicating under-handed methods of enhancing one's abilities and prolonging careers beyond their natural expiration dates.\n\nTeams are once again realizing the vital role that talented youths play in this great game, as we are seeing young players contributing to their teams across MLB. Whether out of a desire for youthful exuberance and energy, or financial concerns with signing more established players, there appears to be a new wave of youngsters taking Major League Baseball by storm.\n\nOnce upon a time, teenage ballplayers were counted on as a necessity when vast numbers of Major Leaguers were called into military service during World War II. Though many of them were merely fill-ins during the absence of more established older players, others turned their opportunities as teens into productive careers in the big leagues.\n\nWith young, modern phenoms such as Bryce Harper knocking on the door of the big leagues while still in his teens, let's take a look at the 20 youngest players to play in Major League games since the end of World War I."}, {"url": "https://www.verifythis.com/article/news/verify/sports-verify/jackie-robinson-not-first-black-major-league-baseball-player-but-first-after-color-barrier-erected/536-c807a497-a0ae-43dd-9111-83029d01e4eb", "page_content": "Three Black men played in the majors prior to the institution of the league's color barrier in 1887, which Robinson broke in 1947.\n\nExample video title will go here for this video\n\nBlack history and accomplishments are celebrated all throughout February for Black History Month. That includes the celebration of Jackie Robinson, who famously broke Major League Baseball's color barrier on April 15, 1947.\n\nLast year, journalist and poet Michael Harriot tweeted that “Jackie Robinson was NOT the first Black Major League Baseball player.”\n\nTHE QUESTION\n\nWas Jackie Robinson the first Black Major League Baseball player?\n\nTHE SOURCES\n\nTHE ANSWER\n\nNo, Jackie Robinson was not the first Black Major League Baseball player. However, he was the first Black player in the modern-day majors, following his breaking of the “color line” in 1947.\n\nWHAT WE FOUND\n\nThere are three Black men who played in the major leagues between 1879 and 1884, according to the Society for American Baseball Research (SABR). They played at a time when Major League Baseball consisted of six different leagues including the still-active National League.\n\nThe three Black players who played in the majors in the 1800s were: William Edward White, who played one game in 1879; Moses Fleetwood Walker, who played 42 games in 1884 and Weldy Walker, who played five games in 1884.\n\nPrior to the addition of seven Negro Leagues to the list in 2020, Major League Baseball officially recognized six leagues as “major leagues.” Those leagues were: the American Association (1882-91), Union Association (1884), Players’ League (1890), Federal League (1914-15), and the still active National League (since 1876) and American League (since 1901).\n\nEven though the modern-day MLB — an alliance of the NL and AL led by a National Commission or commissioner — didn’t form until 1903, the three Black players from the 1800s are officially considered Major League Baseball players.\n\nWhite played a June 21, 1879 game for the National League’s Providence Grays, SABR says; he filled in for an injured player while still in college. He was biracial; his parents being a white man and a Black woman, who had been the white man’s slave.\n\nBecause of this, White is the first known Black man to play Major League Baseball. But he was not the first “openly” Black man to play; White “passed” as a white man. In the 1880 census, and in future censuses, he identified himself as white, and there’s no evidence anyone challenged him on this. SABR says there is “no known contemporary record,” except for census reports, that “contains reference to his race.”\n\nThe first “openly” Black man, and thus the first to experience racist backlash, to play in the majors was Moses Fleetwood Walker, according to SABR. “Fleet,” as he was called, joined the Toledo Blue Stockings in 1883, while the team was still in a minor league. He played catcher for the team, and was praised by the local media and his team for his play en route to their minor league title.\n\nBut even in the minors, Fleet was targeted by segregationists.\n\nIn August 1883, Adrian \"Cap\" Anson, a future hall-of-famer, leading voice of the movement to segregate baseball and player-manager of the Chicago White Stockings, announced that his team would not play an exhibition game against Toledo if it kept Fleet in the lineup, says Lemelson-MIT, a youth inventor development program ran by the Massachusetts Institute of Technology School of Engineering. SABR says Toledo’s manager called Anson’s bluff, forcing the latter’s team to play to secure his interest in ticket sales.\n\nThe Blue Stockings joined the American Association the following year, allowing Fleet to make his major-league debut in 1884. Fleet and his team were the targets of increasingly hostile and violent attempts to keep him out of games.\n\nHe played his last game Sept. 4, 1884 and was eventually released on Sept. 22, 1884 because of an injury. Although he continued to play minor league baseball until 1889, Fleet never played in another major league game. No other Black man played in the majors until Jackie Robinson did in 1947.\n\nDuring their 1884 campaign, the Toledo Blue Stockings also played with Fleet’s brother, Weldy Walker, for four games. Weldy made his major-league debut July 15, 1884 to fill in for the team’s injured players, SABR says. He never played alongside Fleet, who was injured at the time, during his five-game career, and Weldy was released sometime after his final major league game Aug. 6, 1884."}, {"url": "https://www.britannica.com/sports/baseball/Blacks-in-baseball", "page_content": "During baseball’s infancy, a colour barrier was put up by the first formal organization of baseball clubs, the National Association of Base Ball Players, which decreed in 1867 that clubs \"which may be composed of one or more coloured persons\" should not be permitted to compete with its teams of gentlemen amateurs. When the first professional league was formed four years later, it had no written rule barring Black players, but it was tacitly understood that they were not welcome.\n\nThe colour line was not consistently enforced, though, during the early years of professionalism. At least 60 Black players performed in the minor leagues during the late 19th century—mostly in all-Black clubs. In 1884 two African Americans played in a recognized major league, the American Association. They were Moses Fleetwood (“Fleet”) Walker, a catcher for the Association’s Toledo team, and his brother Welday, an outfielder who appeared in six games for Toledo.\n\nThe number of Black players in professional leagues peaked in 1887 when Fleet Walker, second baseman Bud Fowler, pitcher George Stovey, pitcher Robert Higgins, and Frank Grant, a second baseman who was probably the best Black player of the 19th century, were on rosters of clubs in the International League, one rung below the majors. At least 15 other Black players were in lesser professional leagues. Although they suffered harassment and discrimination off the field, they were grudgingly accepted by most of their teammates and opponents.\n\nA League of Colored Base Ball Clubs, organized in 1887 in cities of the Northeast and border states, was recognized as a legitimate minor league under organized baseball’s National Agreement and raised hopes of sending Black players to big league teams. The league’s first games, however, attracted small crowds, and it collapsed after only one week. While no rule in organized baseball ever stated that Black players were banned, a so-called “gentlemen’s agreement” to exclude Blacks eventually prevailed.\n\nThere were other disturbing signs of exclusion for Black players in 1887. The Syracuse (New York) Stars of the International League suffered a mutiny when pitcher Douglas (“Dug”) Crothers refused to sit for a team portrait with his Black teammate Robert Higgins. In Newark, New Jersey, Black pitcher Stovey was kept out of an exhibition game with the major league Chicago White Stockings at the insistence of Cap Anson, Chicago’s manager and one of the most famous players of baseball’s early days. And the St. Louis Browns, American Association champions, refused to play an exhibition game against the all-Black Cuban Giants. The night before the scheduled game, eight members of the Browns handed a message to the team’s owner that read: \"[We] do not agree to play against Negroes tomorrow. We will cheerfully play against white people at any time.\"\n\nIn midseason that year the International League’s board of directors told its secretary to approve no more contracts for Black players, although it did not oust the league’s five Blacks. The Ohio State League also wrestled inconclusively with the colour question. It was becoming clear that the colour bar was gradually being raised. Black players were in the minor leagues for the next few years, but their numbers declined steadily. The last Black players in the recognized minor leagues during 19th century were the Acme Colored Giants, who represented Celoron, New York, in the Iron and Oil Leagues in 1898.\n\nAs the 20th century dawned, separation of the races was becoming the rule, especially in the South. The U.S. Supreme Court had written segregation into national law in 1895 in Plessy v. Ferguson, which approved separate schools for Black and white children. In the South, state laws and local ordinances placed limits on the use of public facilities by African Americans and forbade athletic competition between Blacks and whites. In the North, African Americans were not usually segregated by law, but local custom dictated second-class citizenship for them.\n\nNevertheless, the idea of Black players in the major and minor leagues was not yet unthinkable. In 1901 John J. McGraw, manager of the Baltimore Orioles in the new American League, tried to sign a Black second baseman named Charlie Grant by saying that he was a Native American named Tokohama, a member of the Cherokee tribe. The effort failed when rivals correctly identified Grant instead as a member of the Chicago Columbia Giants, a Black team. Five years later there was an aborted attempt to bring African American William Clarence Matthews, Harvard University’s shortstop from 1902 to 1905, into the National League.\n\nIncreasingly, Black players who wanted to play professionally had to join all-Black teams. (Several swarthy players in the big leagues were widely assumed to be Black, although they claimed to be white Latin Americans. No admitted Black men played in the white leagues at the time.) Ninety percent of the country’s African American citizens lived in the South, but migration to Northern states was increasing. With the growing base of potential fans in the North, top-quality Black teams appeared in the Northeast and Midwest. Among them were the Genuine Cuban Giants and Cuban X Giants of New York City (both made up of African Americans despite their names), the Cuban Stars and Havana Stars (both with real Cubans), the Lincoln Giants of New York City, the Philadelphia Giants, the Bacharach Giants of Atlantic City (New Jersey), the Homestead (Pennsylvania) Grays, the Hilldale Club of Philadelphia, and the Norfolk (Virginia) Red Stockings. In the Midwest the leaders were the Chicago American Giants, the Columbia Giants, Leland Giants, and Union Giants of Chicago, the Kansas City (Missouri) Monarchs, and the Indianapolis ABCs. Especially noteworthy was the All Nations team, composed of African Americans, whites, a Japanese, a Hawaiian, an American Indian, and several Latin Americans. On its roster at various times before World War I were two of the greatest Black pitchers, John Donaldson and Jose Mendez.\n\nThese teams vied for the mythical \"colored championship of the world\" and also played white semipro and college teams. Salaries were modest. Journeymen players earned $40 to $75 a month, while a star might command more than $100. Some Chicago teams played in the city’s semipro league on weekends, occasionally competing against big leaguers from the Cubs and White Sox who played under assumed names. During the week they played white clubs in nearby towns.\n\nMajor league teams often played Black teams during spring training trips to Cuba and sometimes had postseason games against Black clubs in the United States. In 1909, for example, the Chicago Cubs won three close games in a series with the Leland Giants. In 1915, eastern Black teams won four of eight games against big league teams, including a five-hit shutout of the National League champion Philadelphia Phillies by Smokey Joe Williams of the Lincoln Giants. In the late 1920s Commissioner Landis forbade big league clubs from competing in toto in the off-season. Partisans of Black baseball believed it was because Black teams often beat the major leaguers.\n\nIn the Midwest a few teams barnstormed all season long. The Kansas City (Kansas) Giants, for example, were on the road all summer, traveling mostly by railroad. Their opponents were white semipro teams throughout the Midwestern states and southern Canada. Although a Black face was a novelty in the small towns, the players remembered that by and large they had little trouble finding food and lodging in the rural areas.\n\nFormed in 1920 and 1921, respectively, the Negro National League and the Negro Eastern League played in New York City, Chicago, St. Louis, Kansas City (Missouri), Detroit, and other cities that had absorbed a large influx of African Americans from the South during and after World War I. In the 1920s a Negro World Series was begun and was held annually until the Negro leagues failed in the 1930s. A second Negro National League was founded late in that decade, and the Negro American League, formed in 1936, ultimately had Eastern and Western divisions that in 1952 played a Negro East-West game. Among the most famous players in the various Negro leagues were Josh Gibson (who was credited with hitting 89 home runs in one season), Satchel Paige, Bill Yancey, John Henry Lloyd, Andrew (“Rube”) Foster, and James Thomas (“Cool Papa”) Bell. After World War II, attendance at Negro league games declined as outstanding players were lost to formerly all-white teams. (For more in-depth information on this topic, see Negro leagues.)"}, {"url": "https://www.beyondtheboxscore.com/2016/2/15/10991906/black-baseball-players-history-before-jackie-robinson-negro-leagues", "page_content": "Author's Note: I would like to thank everyone who contributed to this article coming together. While it is my name on the byline, this article wouldn't be half of what it is without the great help from Richard Hershberger, Leslie Heaphy, James Brunson, and Jacob Pomrenke. All photos in this article are used with the permission of the National Baseball Hall of Fame. As this article represents only a small slice of the vivid stories of these early pioneers, I highly recommend reading all the articles cited in the end notes for the full stories of these incredible men.\n\nThe story is well-known. On April 15, 1947 Jackie Robinson made his major league debut for the Brooklyn Dodgers, breaking baseball's color barrier and putting an end to a disgraceful period in the history of the national pastime. The dominant historical narrative holds Branch Rickey as a maverick willing to charge against the status quo and having a burning desire to end baseball's color barrier. Robinson was his hand-picked player who then became the first man ever to step foot on a field with white professional baseball players. But this is a false narrative. Robinson and Rickey deserve recognition - that much is for sure - but there were black players in organized white baseball who came before Robinson, and there were attempts to integrate the modern game before Rickey's.\n\nThe stories of the brave pioneers who came before Robinson and Rickey are virtually unknown outside the inner circles of baseball history, being recounted only in a piecemeal fashion. Maybe casual fans have heard of Moses Fleetwood Walker in passing or are aware of Bill Veeck's attempt to buy the Philadelphia Phillies because they read Veeck as in Wreck. But the stories and the struggles of these early pioneers are important to remember in the historical context of pre-integration baseball history. What these men accomplished on and off the field and what they had to endure because of the overt racism of the era should not be lost to history.\n\nJohn \"Bud\" Fowler is often credited to be the first black man to play organized white baseball in 1878. Baseball historian James Brunson begs to differ, calling this story the \"object of baseball mythmaking.\"[1] At this point, we have no way of knowing who the first black player was in organized white baseball. There is precedent of white and black players playing together as far back as 1870, when black players Frank Stewart and Charles Bannister played on an otherwise all-white team for a game against the all-black Washington's Mutual Base Ball Club in Rochester, N.Y. Stewart was a Civil War veteran[2] who played primarily for the all-black Rochester's Unexpected Club and was called by the Rochester Evening Express as the best ballplayer in the state of New York - black or white.[3]\n\nThe myth of Fowler being first has persisted, though, probably because he was an outstanding ballplayer. He hit .308 in more than 2,000 at-bats in organized baseball and was a good pitcher as well. Fowler, born John W. Jackson Jr., was raised in Cooperstown, N.Y. and was a professional baseball player for 10 years, playing for over a dozen early minor league teams. He dedicated himself to the promotion of black baseball from coast to coast for over 30 years, becoming the first black captain of a professional baseball team.[4] [5] For a black man in organized white baseball one year after Reconstruction ended, Fowler was unsurprisingly not always well-received by his opponents, the fans, or even his own teammates. This was a time in the United States when Jim Crow laws were just coming onto the books, and the prevailing thought in the South was the racist dogma of de jure segregation, though it is inaccurate to say that this was a purely southern way of thought.\n\nBorn in Marshalltown, Iowa, Adrian \"Cap\" Anson was a true pioneer of the game of baseball. He was the first superstar of professional baseball and was the first to reach 3,000 career hits.[6] C. Montgomery Burns had him on the original short list to play for the Springfield Nuclear Power Plant nine. He was enshrined in the Baseball Hall of Fame in 1939. He was also a horrible racist who was largely responsible for the unwritten \"Gentlemen's Agreement\" which saw black players blackballed from Major League Baseball. Anson was a segregationalist, and his stature in the game lent his bigoted opinion a lot of weight, and he used that position in the game to push for his views.[7]\n\nHis involvement in pushing for the \"Gentlemen's Agreement\" originates on August 10, 1883 when his Chicago White Stockings (now the Cubs) played an exhibition game against the Toledos of the Northwest League. Anson saw that Toledo had a black catcher, Moses Fleetwood \"Fleet\" Walker, and refused to take the field if Walker was to play. Now Walker was not originally scheduled to catch that day, but upon hearing Anson's demands, Toledo manager Charlie Morton decided to start Walker in the outfield. Anson eventually agreed to play so he wouldn't miss out on his share of the gate.\n\nIn 1884, Chicago played Toledo again, which had moved to the American Association, and Walker sat the game out. John R. Husman's account of the incidents on the SABR website says that, \"Chicago requested assurance in writing that no black would play any position in the July 25 exhibition game.\" Husman also notes that Walker didn't play in Toledo's previous three games and didn't see action behind the plate again until August 18th, so perhaps Chicago's request was meaningless in the end.[8]\n\nThe result of the Anson-Walker ordeal was the most shameful period in the history of baseball. For the ensuing 63 years Major League Baseball conspired to keep black players out of the game. While true, to say that this robbed many great players the chance to compete at the highest level doesn't fully encapsulate the injustice and moral indignity that was the \"Gentlemen's Agreement\". But despite the agreement, there were a handful of black players who played in organized white baseball before Robinson broke the color barrier in 1947.\n\nFleet Walker played in 42 games for the Toledo Blue Stockings in 1884 and hit .263/.325/.316, which was good for a 107 OPS+, second-best on the team. He collected 40 hits in 166 plate appearances, including two doubles and three triples. Despite his rough debut behind the plate, Walker was also praised for his defensive abilities at catcher.[9] Walker developed makeshift wooden shin guards years before Roger Bresnahan to protect his legs from being spiked by runners. This equipment innovation came during a time when it was considered cowardly to use a glove and most fielders played barehanded.\n\nIt wasn't just Walker's opponents who didn't like that a black man was playing baseball, his own teammates disliked him. Toledo pitcher Tony Mullane would intentionally throw the ball in the dirt, trying to injure his own battery mate. Walker suffered several injuries, including fractured ribs, during the season as a result of this. This sabotage contributed to Walker collecting a league-leading 72 passed balls in 41 games behind the plate (he played the outfield once). Mullane would refuse to acknowledge Walker's signals and intentionally crossed him up but later told The New York Age, \"He was the best catcher I ever worked with.\" Mullane recalled an incident with Walker in the interview:\n\n\"I disliked a Negro and whenever I had to pitch to him I used to pitch anything I wanted without looking at his signals. One day he signaled me for a curve and I shot a fast ball at him. He caught it and walked down to me. \"‘Mr. Mullane,' he said, ‘I'll catch you without signals, but I won't catch you if you are going to cross me when I give you signal.' \"And all the rest of that season he caught me and caught anything I pitched without knowing what was coming.\"[10]\n\nWalker's post-playing career is fascinating as well. He was well-educated, having attended Oberlin College and the University of Michigan. After playing in the minor leagues for several years after the \"Gentlemen's Agreement,\" he retired to become a businessman and inventor, receiving several patents. In 1891 he was charged with second-degree murder after he fatally stabbed a white man who had attacked him and was acquitted by an all-white jury. At the turn of the 20th century, Walker became a supporter of Black Nationalism and in 1908 published a widely-read pamphlet called Our Home Colony, which pre-dated Marcus Garvey's rise to prominence in the movement.[11]\n\nWhile Fleet Walker is most often remembered by historians, it's often overlooked that he was not the only black player on the Blue Stockings that year. Fleet's brother Welday Walker appeared in five games with Toledo in 1884, though he hit just .222/.222/.278 with a double and two RBIs. The story of how Welday, whom people called Weldy, became a member of the Blue Stockings is interesting. He was in Toledo visiting his brother and was signed to fill out the roster for a July 15th game. There is no indication that Weldy was still a member of the Blue Stockings when Cap Anson's White Stockings came into Toledo 10 days later with the demand that no black player take the field.\n\nWeldy had just a small cup of coffee, but it was not without significance. Though they never appeared in a game together, Weldy and Fleet would be the only pair of black teammates on a major league team until Hank Thompson and Willard \"Home Run\" Brown on the 1947 St. Louis Browns. After he left Toledo, Weldy played in the minors and in the National Colored Baseball League, the first-ever league of teams comprised of all black players, in 1887 - though the league never really got off the ground. Much like his brother, Weldy was intelligent, well-educated, and politically aware. He made a career for himself after baseball as a business owner and political activist. Later on in life he worked as a bootlegger during Prohibition and at one time ran a gambling house.[12] Much of what we know about Weldy Walker comes from David Zang's 1995 biography of his brother, entitled Fleet Walker's Divided Heart.\n\nThe Walker brothers were not the first black players to play Major League Baseball. In 1879, William Edward White played one game for the Providence Grays of the National League. White was the son of a Georgia businessman and one of his slaves, who was mixed-race. In the eyes of the law at the time, that made White legally black and a slave, although he passed as a white man for his entire adulthood after slavery was abolished.[13] In his one game for the Grays on June 21, 1879, White went 1-4 with a run scored while starting at first base and batting ninth.[14]\n\nThe controversy surrounding White and his possible breaking of the color barrier is that if he was three-quarters white, lived as a white man, and was never challenged as such, should he be considered the first black baseball player? Since the racist attitudes of the time likely were a contributing factor to White concealing his black heritage, it is only fair that he should be considered the first black player in Major League Baseball history, even though he was not openly so. The counter argument to that is that if his being white was not questioned at the time, then why should we revise history and consider him black?\n\nWhile the Walker brothers remained the only openly black players in Major League Baseball, there were other players who kicked around the white minor leagues after the \"Gentlemen's Agreement\" and before the color line became firmly established. The most notable of those players was second baseman and Baseball Hall of Famer Frank Grant. Grant played three seasons in the International League for the Buffalo Bisons from 1886-1888 and was the only black player in organized white baseball to spend three seasons with the same club until the 1940s.[15]\n\nGrant, who originally tried to pass for a Spaniard, was an outstanding player - nicknamed the \"Black Dunlap\" for the comparisons that he drew to white second baseman Fred Dunlap. Minor league stats from the 1880s being what they are, we don't have complete career numbers available for Grant, but his Baseball-Reference page indicates that as a 22 year old with Buffalo in 1888, he hit .346 with 11 home runs in 347 at-bats.\n\nWhile Grant was playing for Buffalo, the tipping point was reached in terms of blacks being formally banned from organized white baseball. On July 14, 1887, the International League voted to formally ban any additional signings of black players by its clubs. Black players in the league - George Stovey, Bob Higgins, Grant and Fleet Walker - were allowed to stay with their clubs. Grant stuck around for one more season in the IL, while Walker remained in the league through 1889. By 1897, all organized white baseball leagues had adopted either written or unwritten rules like this one.\n\nThe very same day that the International League voted to formally ban black players from entering the league, there was a third incident between Cap Anson and Fleet Walker, who was now with the Newark Little Giants. Stovey and Walker were set to be the battery in the exhibition game against the White Stockings, and once again Anson threatened not to take the field against the two black players. Newark's manager didn't show the same backbone that Charlie Morton had shown four years earlier and caved to Anson's demands, removing the pair from the lineup.\n\nAt the end of 1887, Grant re-signed with Buffalo and even held out for a short time for a salary increase to $250 per month. He was popular with the local fans, but his teammates were not as accepting. Several white players refused to sit for the team portrait if Grant was going to sit for it, and in 1888 they didn't take a picture at all because players didn't want to be photographed alongside Grant. During a road game in Toronto, Grant endured chants from the crowd of \"kill the n----r.\" Brian McKenna dug up a particularly chilling description of Grant's life with the Bisons from the Louisville Post in Grant's SABR bio:\n\n\"He is a fine ball tosser...and hasn't many superiors among players either white or black...Grant is very popular in Buffalo, and for that reason the management is forced to hold him, although the players of the club are said to feel keenly having to play with a colored man. In the east Grant goes with the other members of the club, stops at the same hotels, eats at the same table and possibly occupies the same room. While in this city he is registered at the Galt House, but is roomed with the colored help and takes his meals with them.\"\n\nAfter the 1888 season, Grant left Buffalo and played in the Negro Leagues until 1903. Unlike the Walker brothers, Grant lived the remainder of his life out of the public spotlight working various service and labor jobs before passing away in 1937. One of the greatest players of the 1800s - black or white - was buried in East Ridgelawn Cemetery in Clifton, New Jersey in a grave that remained unmarked until 2011.[16]\n\nMeanwhile, after the 1887 season, George Stovey was approached by John Montgomery Ward about joining the New York Giants. Ward, who was a teammate of William Edward White for that one day in 1879 with the Grays, convinced the owner of the Giants, John Day, that he should sign Stovey.[17] Ward, the Giants player-manager, was undoubtedly impressed with Stovey, a dominant lefty hurler who was only 21 years old. When opposing players and owners led by none other than Cap Anson caught wind of the plan, Day backed down. Stovey continued playing in the minor leagues until 1897 and umpired in his native Williamsport, PA through at least 1913. He worked odd jobs throughout his later life and like Weldy Walker dabbled in bootlegging during Prohibition.[18] Like Grant, Stovey passed away living in poverty, passing of a heart attack in 1936.\n\nIndependent Organized Black Teams Team Years in Existence St. Louis Brown Stockings 1870 Chicago Uniques 1873-1880 St. Louis Black Stockings 1883-1886 Chicago Gordons 1884-1887 Louisville Fall Citys 1885-1886 Trenton Cuban Giants 1886-1890\n\nOne of the stops along the way for both Grant and Stovey was the Middle States League in 1889, which was a mostly-white league that fielded two all-black teams: the New York Gorhams and the Trenton Cuban Giants.[19] The nature of race relations in baseball at the time was clearly in transition from the very light integration of the late 1870s and early 1880s to what would eventually be an all-out ban by the turn of the century. While on one hand in the International League there was a rule banning blacks, on the other hand was the Middle States League with two all-black teams competing against all-white teams. It should be noted that the status of the Middle States League as being a part of organized baseball is in question, as it was not part of any national agreement and has since been characterized as an Outlaw League.[20]\n\nOver the years there were a handful of black players who tried to pass themselves off as Cuban, Native American, or just simply a dark-skinned white man in order to play in the major leagues. Often times the ruses were found out in advance of the players being signed and were nixed, but there were some exceptions, like George Treadway. Treadway claimed Native American ancestry and lasted in the Major Leagues for four years until 1896. Toward the end of his rookie season in 1893 with the Baltimore Orioles of the National League, an article appeared in the Louisville Courier-Journal claiming that Treadway was black. Baseball Editor Sam McKee wrote, \"There can be little doubt that Treadway, Baltimore's right fielder is a Negro...all the players say he is.\"[21]\n\nTreadway denied the allegations, and two separate investigations - one by The Baltimore Afro-American and one by Orioles management - determined the story was untrue. The utter lack of facts supporting the claim didn't stop opposing fans from taunting him with racist rhetoric. Before the 1894 season, Treadway was traded to the Brooklyn Grooms for stars Dan Brouthers and \"Wee\" Willie Keeler. Treadway had a successful year for the team later to be known as the Dodgers, hitting .330/.420/.521 with 28 doubles, 26 triples, and 102 RBIs in 124 games. He lasted one more year in Brooklyn before finishing off his Major League career in 1896 with the Louisville Colonels.\n\nThough his Major League career was over, Treadway bounced around the minor leagues until his retirement in 1904 at the age of 37. Treadway's disappearance from Major League Baseball almost certainly had something to do with the rumors that he was actually a black man, even though no evidence supporting that has ever turned up. The rumors are believed started by an unnamed, slighted ex-teammate of Treadway's who tried to discredit him after he had reached the Major Leagues. These vague rumors destroyed Treadway's career, but he was far from the only player accused of having black ancestry. Famously there were unsubstantiated rumors of Babe Ruth being black, and Ty Cobb even refused to share a hotel room with him because of the rumors.\n\nWith the turn of the 20th century and the formation of the American League in 1901, a plan was hatched by John McGraw, Clark Griffith, and Dave Wyatt to pass a black player named Charlie Grant (no relation to Frank) as a Cherokee Indian named Tokohoma.[22] It would not be an easy task; many players knew Grant personally and were aware of his racial background, including at least two members of McGraw's Baltimore Orioles. McGraw, et al., organized a cover-up of the scheme in the newspapers, perhaps with inside help at the Chicago Tribune, which Brian McKenna does a good job of tracking in Grant's SABR bio.\n\nWithin a month of the plan being hatched, the ruse started to unravel as newspapers began reporting that Tokohoma was actually Grant. A temporary saving grace for the plan was that the Washington Post had him confused with Frank Grant, calling him \"the old negro player.\" McGraw and Grant vehemently denied the allegations, committing to the story that he was an American Indian, pointing to the confusion with Frank Grant. But the Chicago White Sox and owner Charles Comiskey weren't buying it, as Grant had previously played for the Columbia Giants, a black baseball team in Chicago. Comiskey said in so many words, \"If McGraw keeps his Indian, I'll put a Chinaman on third base.\"\n\nFor reasons that are still unknown, although undoubtedly partly because the jig was up, McGraw backed away from the plan, and Grant rejoined the Columbia Giants, using the Tokohoma name. He was given a big ceremony and gifts from the Giants' fans, which has been credited with blowing his cover at times, but he had been exposed previous to the April 6th celebration.\n\nThe eventual demise of the \"Gentlemen's Agreement\" gained momentum in the early 1940s with several happenings. The one that has gone on to live the longest in baseball lore was Bill Veeck's failed attempt at purchasing the Philadelphia Phillies in 1942 and stocking the team with the best Negro League players. As Veeck told it, the plan was quashed when he informed Commissioner Kennesaw Mountain Landis. Landis turned the franchise over to National League president Ford Frick, who refused to do business with Veeck and sold the franchise to William Cox.[23] The authenticity of Veeck's is questionable, because very little evidence supporting it has ever come to light, despite some good research.[24] [25]\n\nThe best piece of circumstantial evidence for it comes from a quote by Abe Saperstein in the Philadelphia Independent on August 14, 1954.[26] Saperstein was the head of the Harlem Globetrotters and, according to Veeck, a co-conspirator in the plan to overhaul the Phillies:\n\n\"I'll tell you one thing about Veeck, something that few people know. In 1942 the Phillies were for sale and Veeck attempted to buy them. But Bill Cox raised more money and got the club. Do you know what Veeck planned to do? He was going to take the Phils to spring training in Florida and then - on the day the season opened - dispose of the entire team. Meanwhile, with a team composed entirely of Negroes, who would have trained separately, he could have opened the National League season.\"\n\nThis at least indicated that Saperstein was aware of a plan by Veeck, but the rest of what we know comes directly from Veeck and is less than reliable - not that Saperstein is the most reliable person either. I would highly recommend reading both pieces of research in the end notes to get a better understanding of Veeck and the 1943 Phillies than I could ever provide. Veeck of course was a pioneer in the integration of baseball, as he signed Larry Doby to play for the Cleveland Indians. Doby debuted on July 5, 1947, becoming the first black player to play in the American League.\n\nEarly 'Colored' Leagues League Years in Existence Colored League of Louisiana 1875 Colored League of District of Columbia 1878-1880 Colored League of Washington, Maryland and Pennsylvania 1884 League of Southern Colored Base Ballists 1886 National Colored Base Ball League 1887 Texas Colored League 1888 Colored League of Texas 1897\n\nAs the Veeck-Phillies drama played out quietly before the 1943 season, across the country in Oakland, CA a pitcher named Chet Brewer was given an opportunity to try out for the Oakland Oaks of the Pacific Coast League. Vince Devincenzi, the owner of the Oaks, demanded that manager Johnny Vergez give tryouts to Brewer and Lou Dials. Dr. Layton Revel and Luis Munoz of the Center for Negro League Baseball Research said, \"Devincenzi was responding to pressure by the Tribune (Oakland's local newspaper) to give more than lip service to racial reform.\"[27] Vergez refused to give the men a tryout, and nothing materialized.\n\nIn 1945, the Bakersfield Indians, a minor league club for Cleveland, wanted to hire Brewer as a player-manager for the 1946 season. Minor League Baseball determined that Brewer would be eligible to play as there was no written rule forbidding black players. But upon hearing the plan, Roger Peckinpaugh, then the General Manager of the Cleveland Indians, forbade the Bakersfield club from making the hire. In July 1946, the Cleveland Indians were sold to Bill Veeck, Peckinpaugh resigned, and one year later, Larry Doby was taking the field.[28]\n\nThere were other tryouts or attempted tryouts that occurred from around 1942 until 1945, when the Dodgers signed Jackie Robinson. In August of 1942, there was a New York Times report that the President of the Pittsburgh Pirates, Bill Benswanger, was considering giving tryouts to several Negro League players, including Josh Gibson. Clarence \"Pants\" Rowland, who oversaw the Chicago Cubs farm system, toyed with the idea of trying out several Negro League players, including Brewer, before Cubs owner P.K. Wrigley decided against it.[29] Ironically the Boston Red Sox, owned by notorious racist Tom Yawkey, actually followed through on trying out Negro League players in 1945, when Jackie Robinson, Sam Jethro, and Marvin Williams worked out for coaches at Fenway Park.[30]\n\nIt took baseball 12 years to fully integrate, with the Boston Red Sox being the last team in 1959. Black representation in baseball has fluctuated since that point and has become a hot-button issue in recent years as the number of black players has shrunk. Even more important is that we still to this day treat black athletes in general different than white athletes - they are held to a higher standard and as a result are eviscerated by fans and the media over things that are shrugged off when white athletes do the same acts with the same intentions. The Cam Newton post-Super Bowl 50 drama is just one in a long line of examples of this. If we are ever to get past a point where this bias exists, we must always remember the atrocities that are deeply engrained in the history of this sport. Most important of all, we must not forget the men who faced this bigotry at its absolute worst and stood up for what they believed in.\n\nWe cannot allow men like William Edward White, Bud Fowler, Fleet and Weldy Walker, Frank and Charlie Grant, George Stovey, and George Treadway to be lost to history. We cannot forget about the stand taken by Toledo manager Charlie Morton, the efforts of John Montgomery Ward and John McGraw to get black players into Major League Baseball, or the challenges to the color line made by Vince Devincenzi, Bill Veeck, and others in the early 1940s. We all know the story of Jackie Robinson and Branch Rickey. We know the story of the Negro Leagues. We need to do a better job at knowing the stories of those who came before - they are a part of baseball history.\n\nFirst Black Player by Team Player Team Date Jackie Robinson (HOF) Brooklyn Dodgers 4/15/1947 Larry Doby (HOF) Cleveland Indians 7/5/1947 Hank Thompson St. Louis Browns 7/17/1947 Monte Irvin (HOF) New York Giants 1/8/1949 Hank Thompson New York Giants 1/8/1949 Sam Jethroe Boston Braves 4/18/1950 Minnie Minoso Chicago White Sox 5/1/1951 Bob Trice Philadelphia Athletics 9/13/1953 Ernie Banks (HOF) Chicago Cubs 9/17/1953 Curt Roberts Pittsburgh Pirates 4/13/1954 Tom Alston St. Louis Cardinals 4/13/1954 Nino Escalera Cincinnati Reds 4/17/1954 Chuck Harmon Cincinnati Reds 4/17/1954 Carlos Paula Washington Senators 9/6/1954 Elston Howard New York Yankees 4/14/1955 John Kennedy Philadelphia Phillies 4/22/1957 Ozzie Virgil, Sr. Detroit Tigers 6/6/1958 Pumpsie Green Boston Red Sox 7/21/1959\n\n\n\n\n\n[1] James Brunson, email message to the author, February 13, 2016\n\n[2] Stewart served as a non-commissioned officer in the Eleventh Rhode Island Colored Infantry Division.\n\n[3] James Brunson, email message to the author, February 13, 2016\n\n[4] Brian McKenna, \"Bud Fowler,\" Society for American Baseball Research, http://sabr.org/bioproj/person/200e2bbd\n\n[5] \"John ‘Bud' Fowler,\" Negro Leagues Baseball Museum, http://coe.k-state.edu/annex/nlbemuseum/history/players/fowler.html\n\n[6] David Fleitz, \"Cap Anson,\" Society for American Baseball Research, http://sabr.org/bioproj/person/9b42f875\n\n[7] Richard Hershberger (October 27, 2015), \"The Curse of Anson,\" Ordinary Times, http://ordinary-gentlemen.com/2015/10/27/the-curse-of-anson/\n\n[8] John R. Husman, \"August 10, 1883: Cap Anson vs. Fleet Walker,\" Society for American Baseball Research, http://sabr.org/gamesproj/game/august-10-1883-cap-anson-vs-fleet-walker.\n\n[9] John R. Husman, \"May 1, 1884: Fleet Walker's Major League Debut,\" Society for American Baseball Research, http://sabr.org/gamesproj/game/may-1-1884-fleet-walker-s-major-league-debut\n\n[10] Thom Karmik (January 13, 2014), \"Three or four Men who looked like Wonders in the Big Leagues Disappeared,\" Baseball History Daily, http://baseballhistorydaily.com/2014/01/13/three-or-four-men-who-looked-like-wonders-in-the-big-leagues-disappeared/\n\n[11] John R. Husman, \"Fleet Walker,\" Society for American Baseball Research, http://sabr.org/bioproj/person/9fc5f867\n\n[12] John R. Husman, \"Weldy Walker,\" Society for American Baseball Research, http://sabr.org/bioproj/person/08893f9f\n\n[13] Peter Morris and Stefan Fastis (February 4, 2014), \"Baseball's Secret Pioneer,\" Slate, http://www.slate.com/articles/sports/sports_nut/2014/02/william_edward_white_baseball_s_first_black_player_lived_his_life_as_a_white.single.html\n\n[14] John R. Husman, \"June 21, 1879: The Cameo of William Edward White,\" Society for American Baseball Research, http://sabr.org/gamesproj/game/june-21-1879-cameo-william-edward-white\n\n[15] Brian McKenna, \"Frank Grant,\" Society for American Baseball Research, http://sabr.org/bioproj/person/2f633c50\n\n[16] Deena Yellin (June 15, 2011), \"Gravesite of Negro Leagues pioneer finally gets a marker,\" The Record, http://www.northjersey.com/community-news/cemetery-honors-a-baseballpioneer-1.190536\n\n[17] \"John Ward,\" National Baseball Hall of Fame, http://baseballhall.org/hof/ward-john\n\n[18] Brian McKenna, \"George Stovey,\" Society for American Baseball Research, http://sabr.org/bioproj/person/8ff10f5c\n\n[19] Merl F. Kleinknecht, \"Blacks in 19th Century Organized Baseball,\" Society for American Baseball Research, http://research.sabr.org/journals/blacks-in-19th-c-baseball\n\n[20] Richard Hershberger, e-mail message to author, February 12, 2016.\n\n[21] Thom Karmick (October 16, 2012), \"George Treadway,\" Baseball History Daily, http://baseballhistorydaily.com/2012/10/16/george-treadway/\n\n[22] Brian McKenna, \"Charlie Grant,\" Society for American Baseball Research, http://www.baseball-reference.com/players/t/treadge01.shtml\n\n[23] As it turned out, Cox would be banned from baseball in 1944 for betting on his own team.\n\n[24] David M. Jordan, Larry P. Gerlach, John P. Rossi (1998); \"A Baseball Myth Exploded;\" Society for American Baseball Research, http://sabr.org/cmsFiles/Files/Bill_Veeck_and_the_1943_sale_of_the_Phillies.pdf\n\n[25] Jules Tygiel, \"Revisiting Bill Veeck and the 1943 Phillies,\" SABR Baseball Research Journal, No. 35 (2006): 109-114, http://research.sabr.org/journals/files/SABR-Baseball_Research_Journal-35.pdf\n\n[26] Tygiel, 113.\n\n[27] Dr. Layton Revel & Luis Munoz, \"Forgotten Heroes: Chet Brewer,\" Center for Negro League Baseball Research, http://www.cnlbr.org/Portals/0/Hero/Chet-Brewer.pdf\n\n[28] In a March 29, 1987 New York Times article written by Dave Anderson entitled, \"Has baseball forgotten Larry Doby?\", Doby recounts the following tale of his first day in Cleveland: \"The day I joined the Indians in Chicago, Lou Boudreau lined up all the players. One by one, Lou introduced me to each player, ‘This is Joe Gordon,' and Gordon put his hand out. ‘This is Bob Lemon,' and Lemon put his hand out. ‘This is Jim Hegan,' and Hegan put his hand out. All the guys put their hands out, all but three. As soon as he could, Bill Veeck got rid of those three.\" http://www.nytimes.com/1987/03/29/sports/sports-of-the-times-has-baseball-forgotten-larry-doby.html?pagewanted=all&src=pm\n\n[29] \"Integration of Major League Baseball,\" Center for Negro League Baseball Research, http://www.cnlbr.org/Portals/0/RL/Integration%20of%20Major%20League%20Baseball.pdf\n\n[30] \"Red Sox coaches check out Negro League players,\" The Boston Globe (April 17, 1945), https://www.bostonglobe.com/sports/1945/04/17/red-sox-coaches-check-out-negro-league-players/XsxnxwoWmMx2GIsIYcbWHI/story.html\n\n...\n\nJoe Vasile is the Broadcasting and Media Relations assistant for the Salem Red Sox and is a contributor at Beyond the Box Score. Follow him on Twitter at @JoeVasilePBP."}, {"url": "https://www.funtrivia.com/trivia-quiz/Sports/Stop-The-Bus-364600.html", "page_content": "Quiz Answer Key and Fun Facts\n\n1. What New York Yankee, who once got a hit in 56 straight MLB games, played four years in the Pacific Coast league between 1931-1935?\n\n\n\nAnswer: Joe Dimaggio\n\n\n\nAll of these men played centerfield for the New Your Yankees; however, Joe DiMaggio is the only one to hit safely in 56 straight games. DiMaggio was nicknamed the \"Yankee Clipper\" by New York sportswriters because he glided around the bases and the outfield. DiMaggio was born in the Northern California town of Martinez, the eighth child of an Italian immigrant. Joe followed his older brother Vince into a career in baseball to avoid life as a San Francisco fisherman. In 1931, he joined the Pacific Coast League's San Francisco Seals, and immediately started to gain attention. Ironically, while DiMaggio would set the major league record for getting at least one hit in 56 straight games, it was not even his longest streak. DiMaggio hit safely in 61 straight games while playing for the Seals in 1933.\n\n\n\nDiMaggio almost never made it to New York, as he suffered a career threatening knee injury in 1934. In a remarkable recovery, Joe hit .394 with 154 RBI's in 1935 for the Seals and never looked back. DiMaggio played for the New York Yankees his entire major league career retiring with a .325 career average. DiMaggio like many other 1940's stars enlisted in the American war effort and served in World War II. DiMaggio's older brother Vince and younger brother Dom also played in the major leagues. For good measure, DiMaggio was part of nine World Series championships while playing for the Yankees. DiMaggio died of lung cancer in 1999.\n\n2. What Baseball Hall of Fame pitcher has the distinction to be the oldest rookie and the oldest first time all-star?\n\n\n\nAnswer: Leroy \"Satchel\" Paige\n\n\n\nLeroy \"Satchel\" Paige had the unfortunate distinction to be born in 1906 and spent over 20 years playing baseball in relative obscurity in America's Negro Leagues. It was not until 1947 when the color barrier was lifted, and African-American ballplayers were \"permitted\" to play in the major leagues, that Leroy Paige got his chance to play at the highest level. In 1948, at the age of 42, Paige became the oldest player to make his major league debut when he pitched for the Cleveland Indians. In 1952, now 46 and pitching for the St. Louis Browns, Paige became the oldest first-time All-Star. Paige also made the All-Star team in 1953. While Paige's major league record was only 28 wins to 31 losses, the fact that he did not get a chance to pitch until he was in his 40's remains a testament to how amazing an athlete he was. Paige's greatness was demonstrated during his years in the Negro League's. In one stretch from 1934-1941, Paige was an almost perfect 64-7.\n\n\n\nPerhaps even more amazing were Paige's achievements after leaving the major leagues. From 1956-1961 Paige pitched for the minor league Miami Marlins and the Portland Beavers at the AAA level throwing over 360 innings and having an excellent win/loss record of 31-22. The remarkable thing was that while the batters were on average 24 years old, Paige was 54 years old when he finished the 1961 season. Paige played one more game at the minor league level. In 1966 at the age of 59 Satchel pitched two innings for the Peninsula Grays of the Carolina League. The 1966 Peninsula Grays also featured 18 year old catcher and future Hall of Famer, Johnny Bench.\n\n\n\nLarry Doby is often a forgotten man in the history of MLB's integration. While Jackie Robinson is rightfully credited as the first player to \"break the color barrier,\" Doby was the second overall and first in the American League. Doby was a seven-time All-Star playing for mostly for the Cleveland Indians. Josh Gibson is a legendary African-American catcher who played his entire career in the Negro leagues. Gibson is often called \"the best player never to play in the major leagues\". Hall of Fame pitcher Bob Feller, in contrast to Satchel Paige, never played a day in the minor leagues, making his major league debut at the age of 17, in 1936. Feller went on to compile a record of 266-162.\n\n3. What Baseball Hall of Fame \"southpaw\" pitcher, who compiled a record of 300-141 for the Philadelphia Athetics and Boston Red Sox, started his career by playing five years with the minor league Baltimore Orioles?\n\n\n\nLefty Grove\n\n\n\nWhile all of the pitchers named are Hall of Fame left-handers, Lefty Grove is the only one to pitch for the A's and Red Sox. Grove is often considered the best left-hander ever. He compiled a win loss percentage that is amongst the best all-time, won 300 games, led the league in lowest ERA nine times and was the 1931 MVP. Before making his major league debut in 1925, Grove played five years for the minor league Baltimore Orioles, where he compiled an astounding minor league record of 108-28. \"Baltimore Orioles\" was a common name for teams playing in Baltimore, as several professional teams used the moniker before the current major league team (having previously been the St. Louis Browns) started to play in 1953.\n\n\n\nThe manager/owner of the minor league Orioles that signed Lefty Grove in 1920 had in 1914 previously discovered a local Baltimore product named George Herman \"Babe\" Ruth. Answer:While all of the pitchers named are Hall of Fame left-handers, Lefty Grove is the only one to pitch for the A's and Red Sox. Grove is often considered the best left-hander ever. He compiled a win loss percentage that is amongst the best all-time, won 300 games, led the league in lowest ERA nine times and was the 1931 MVP. Before making his major league debut in 1925, Grove played five years for the minor league Baltimore Orioles, where he compiled an astounding minor league record of 108-28. \"Baltimore Orioles\" was a common name for teams playing in Baltimore, as several professional teams used the moniker before the current major league team (having previously been the St. Louis Browns) started to play in 1953.The manager/owner of the minor league Orioles that signed Lefty Grove in 1920 had in 1914 previously discovered a local Baltimore product named George Herman \"Babe\" Ruth.\n\n4. Former career minor league pitcher and high school science teacher, Jim Morris attended an open tryout held by the Tampa Bay Devil Rays in 1999 and remarkably was signed to a contract. Morris made his Major League debut in 2000 at age 35. What event prompted Morris to attend the tryout?\n\n\n\nAnswer: A pledge to high school players he was coaching\n\n\n\nSports often create storylines that even the best Hollywood screenwriters could never imagine. Such is the case with the amazing story of how Jim Morris, a 35 year high school science teacher and baseball coach in Reagan County Texas, found himself pitching for the Tampa Bay Devil Rays in 1999. Morris had been a star high school athlete who dreamed of playing pro baseball. He was drafted by the Milwaukee Brewers with the fourth overall pick in the 1983 draft. Morris, however, only played parts of four years in the minor leagues before a series of arm injuries seemingly ruined his career. Morris left baseball, started a family, and earned a teaching degree. Morris eventually became a high school science teacher and baseball coach in Big Lake Texas.\n\n\n\nMany of Morris' players were aware of their coach's derailed professional career. As motivation during the 1998-99 school season, Morris agreed to go to an open tryout being held by the Tampa Bay Devil Rays if his team won the title. When the squad performed, the coach fulfilled his promise. Rather than being an abject lesson in the humility of broken dreams, Morris impressed the team and was signed to a contract. On September 18, 1999 at the age of 35, Jim Morris made his Major League debut. Morris never became a star, as his arm troubles returned in 2000, but his inspirational story was made into a book and a rather enjoyable 2002 movie called \"The Rookie\".\n\n5. Jackie Robinson, Hall of Fame second baseman and the first African-American Major League player of the modern era, never played in the minor leagues.\n\n\n\nAnswer: False\n\n\n\nEven if one does not count the year of Negro League baseball that Robinson played in 1945, Jackie Robinson began his historic color barrier breaking career as a member of the minor league Montreal Royals of the International League. In 1946, after the (then) Brooklyn Dodgers signed Robinson to a professional contract, Jackie was sent to the minor leagues to hone both his talent and prepare him for storm of controversy an African-American ballplayer would cause. Robinson faced discrimination and threats merely by being listed on the team's roster. When Robinson made his professional debut on April 18, 1946, Robinson became the first African-American to play minor league baseball. Robinson went on to bat .349 and was named the MVP of the league.\n\n\n\nAfter his successful stint in the International League, Robinson became the first modern era African-American to play major league baseball on April 15, 1947. During 1947, despite the constant scrutiny and the draining weight of being the first black player, Robinson nonetheless earned the Rookie of the Year Award. In 10 seasons with the Dodgers, Robinson batted .311, was a six time all star and was named to the Hall of Fame in 1962. In 1997 Major League Baseball retired Robinson's jersey number, 42, for each team as an enduring honor to a great player and important figure in American history.\n\n6. Which of these Baseball Hall of Fame sluggers played in the minor leagues before debuting as the right fielder for the Milwaukee Braves on April 13, 1954?\n\n\n\nAnswer: Hank Aaron\n\n\n\nOtt, Winfield, and Kaline are three of an exclusive club of baseball players who were inducted into the Hall of Fame without ever playing in the minor leagues. Most major league players hone their skills while \"riding the bus\" in the less glamorous minor leagues. Such was the case with Milwaukee and Atlanta Braves great Henry \"Hank\" Aaron. Aaron grew up in Mobile, Alabama. A short stint as a player in the Negro Leagues in 1951 earned the young Henry a contract offer from the Milwaukee Braves organization. Aaron signed with the Braves and spent the better part of two years playing in Eau Claire Wisconsin and later Jacksonville Florida before becoming a minor league all star and most valuable player.\n\n\n\nAaron made his Major League debut April 13, 1954 and became an immediate star. Over the next 18 years, \"Hammerin\" Hank Aaron hit 755 home runs had 3771 hits, knocking in 2297 runs and played in 25 all star games. When he retired in 1976, Aaron had hit more home runs than any other player. Aaron was inducted into the Hall of Fame in 1982.\n\n7. What NBA superstar temporarily retired from basketball in 1994 to pursue a career in minor league baseball?\n\n\n\nAnswer: Michael Jordan\n\n\n\nMichael Jordan, perhaps the greatest professional basketball player ever, announced his retirement form the NBA on October 6, 1993 just days after his Chicago Bulls had won their third straight NBA Championship. Speculation as to Jordan's motives included the allegation that his \"retirement\" was to avoid a suspension for gambling in violation of NBA rules; or as is more likely, a response to the murder of Jordan's father earlier that year. However, Jordan stunned the sports world when he signed a contract to play baseball for the Chicago White Sox. Jordan played the 1994 season as a member of the Birmingham Barons, a mid-level minor league team. The media and fans marveled at superstar Jordan riding the bus from town to town as a baseball rookie. Jordan, however, turned out not to be so great of a baseball prospect, batting just .202 with three home runs during his time with the Barons. Jordan returned to basketball, \"unretiring\" in 1995, where he later led the Bulls to another string of three consecutive titles between 1995-1998.\n\n\n\nJordan is not the only NBA star to play professional baseball. Dave Debusschere was a star forward for the New York Knicks and a pitcher in 1962-1963 for the Chicago White Sox. Boston Celtic guard Danny Ainge played three years of major league baseball for the Toronto Blue Jays from 1979-1981, before wisely deciding to return to basketball. Perhaps the most interesting NBA/MLB cross over is Chuck Connors. Connors played for the Chicago Cubs in 1951 after previously playing basketball for the Boston Celtics between 1946-1948. Connors, however, is best remembered as an actor and star of the US television series \"the Rifleman\" which ran from 1958-1963.\n\n8. What Los Angeles Dodger pitcher, known as \"El Burro\", played for four years in Mexican and American minor leagues, then won the Cy Young and Rookie of the Year Award in 1981?\n\n\n\nFernando Valenzuela\n\n\n\nFernando Valenzuela was barely 20 years old, could speak only limited English when he took the baseball world by storm in 1981. Valenzuela first played professional baseball as a 16 year old in the Mexican League. He became a cultural icon when he started and won his first eight games for the Los Angeles Dodgers in 1981. Valenzuela was selected to the All-Star and led the Dodgers to the World Series Championship. Valenzuela became the first rookie pitcher to start an All-Star game, led the league in strikeouts, be selected the Rookie of the Year and earn the Cy Young Award as the best pitcher for that year. The furor caused, in particular in the Mexican-American communities of Los Angeles, by the success Valenzuela was dubbed \"Fernadomania\". Valenzuela whose stocky appearance earned him the nickname \"El Burro\" (the bull) went on to be a six time all-star and compile a 173-154 record in 17 seasons as a major league player.\n\n\n\nNewcombe, Sutcliffe and Howe were other Dodger pitchers who earned Rookie of the Year awards. Newcombe was the Rookie of the Year for 1949. However, his best year was 1956. In 1956, Newcombe went 27-7 and was named the Most Valuable Player and the inaugural Cy Young Winner. Newcombe was the first player to earn the Rookie of the Year, Most Valuable Player and Cy Young Awards in a career. Answer:Fernando Valenzuela was barely 20 years old, could speak only limited English when he took the baseball world by storm in 1981. Valenzuela first played professional baseball as a 16 year old in the Mexican League. He became a cultural icon when he started and won his first eight games for the Los Angeles Dodgers in 1981. Valenzuela was selected to the All-Star and led the Dodgers to the World Series Championship. Valenzuela became the first rookie pitcher to start an All-Star game, led the league in strikeouts, be selected the Rookie of the Year and earn the Cy Young Award as the best pitcher for that year. The furor caused, in particular in the Mexican-American communities of Los Angeles, by the success Valenzuela was dubbed \"Fernadomania\". Valenzuela whose stocky appearance earned him the nickname \"El Burro\" (the bull) went on to be a six time all-star and compile a 173-154 record in 17 seasons as a major league player.Newcombe, Sutcliffe and Howe were other Dodger pitchers who earned Rookie of the Year awards. Newcombe was the Rookie of the Year for 1949. However, his best year was 1956. In 1956, Newcombe went 27-7 and was named the Most Valuable Player and the inaugural Cy Young Winner. Newcombe was the first player to earn the Rookie of the Year, Most Valuable Player and Cy Young Awards in a career.\n\n9. Mordecai Brown was a Hall of Fame pitcher during the first part of the 20th century. Brown played many years on minor league teams before debuting in the Major Leagues at age 26. What is his celebrated nickname that stems from damage to two of his fingers on his right hand?\n\n\n\nAnswer: Three-Finger\n\n\n\nMordecai Peter Centennial Brown was nicknamed \"Three Fingers\" due to the loss of part of the index and ring fingers on his right hand. Brown's fingers were damaged in a childhood accident, when he slipped during the use of a farm feeder. However, Brown's injury may have assisted his rise to baseball greatness. The unusual grip Brown's disability required him to use to hold the ball created a unique spin. The spin caused the ball to curve and dip making it extremely hard to hit. Brown perfected his unusual pitch in the minor leagues before making the major leagues in 1903. In 1901 and 1902 Brown pitched for the Terre Haute Hottentots and compiled a 25-8 record and lead the league in strikeouts and wins. In 1902 Brown moved to the higher level Omaha Indians and again led the league in wins with 27.\n\n\n\nIn the major leagues, Brown pitched for 14 years compiling a record of 239-130 predominately for the Chicago Cubs. Brown was the star pitcher for the Cubs when they won their only two World Series Championships in 1907 and 1908. Brown compiled records in those years of 20-6 and 29-9 respectively. Mordecai Brown was elected to the Hall of Fame in 1949. After ending his major league career, Brown returned to the minor leagues and played for another ten years. Despite being in his late 40s. Brown managed an impressive record of 85-52.\n\n\n\nMordecai Brown is not the only baseball player to overcome a disability to play. Pete Gray was an outfielder from the 1945 St. Louis Browns and a successful minor league player. Gray played despite losing an arm as a child. Jim Abbott was born without a hand on his right arm. Abbott pitched for the University of Michigan and then went straight to the major leagues where he played for ten years. Abbot won 89 games in his career and amazingly pitched a no-hitter on September 4, 1993.\n\n10. What do Hall of Fame baseball players Judy Johnson, Buck Leonard, and Cool Papa Bell have in common?\n\n\n\nAnswer: Never played a game in the major leagues\n\n\n\nJosh Gibson, Buck Leonard, Cool Papa Bell were part of a group of nine African-American baseball players who were inducted into the Hall of Fame in 1971. These players that also included Satchel Paige, Monte Irvin, Oscar Charleston, Josh Gibson, John Henry Johnson and Martin Dihigo were selected exclusively for their play in the Negro Baseball League. The induction was recognition of the tremendous skill and talent these men displayed and the travesty imposed on baseball fans by segregation. Of this first group, only Paige and Irvin , each past their prime, played in the major leagues. Over time, other greats from the Negro League and other segregated baseball leagues were added to the Hall of Fame.\n\n\n\nThe image of the old broken bus taking minor league players from town to town is particularly poignant when considering 20th century African-American history. The busses and accommodation afforded minor league players would seem a luxury to Negro League players. In 1946, Jackie Robinson was the first African-American allowed \"on the bus\" as an integrated minor league player. It is no coincidence that Robinson's highly public and successful play supported and invigorated the civil rights movement in the United States. The metaphor of the bus, as an integrated group of people, was taken to the next step in 1955, when Rosa Parks refused to move to the \"back of the bus\".\n\nSource: Author adam36 This quiz was reviewed by FunTrivia editor stuthehistoryguy before going online.Any errors found in FunTrivia content are routinely corrected through our feedback system."}, {"url": "https://www.app.com/story/sports/2021/08/11/nj-minor-league-baseball-jackie-robinson-roosevelt-stadium-jersey-city/5544246001/", "page_content": "Most baseball fans know the story by heart: Jackie Robinson broke the color barrier in 1947 for the Brooklyn Dodgers when they played the Boston Braves on April 15.\n\nThe rest is history.\n\nBut that’s not exactly right.\n\nRobinson’s real history-making moment occurred a year earlier.\n\nAnd it happened in the minor leagues in New Jersey.\n\nBefore the Hall of Famer ever played an inning of ball for the Dodgers he stepped up to the plate on April 18, 1946, for the Montreal Royals of the International League during a game at Jersey City’s Roosevelt Stadium against the Jersey City Giants.\n\n“There was a big difference in the baseball crowd that day,” Anne Schraff wrote in her 2008 book, Jackie Robinson, An American Hero. “The fans were not just from Jersey City. People had come from New York, Philadelphia, Boston, Baltimore and places even farther away. Some white fans had come to see what would happen when a black man took the field for the first time. The many black fans had come to share in what was a proud moment.”\n\nSchraff wrote that Robinson received more cheers and support than boos, but noted “the crowd applauded politely, but not warmly.”\n\nDuring his first at-bat Robinson hit a ground ball to the shortstop for an easy out. But in the third inning, with two men on base, he swung at the first pitch and belted it far over the left field fence for a three-run homer.\n\nThe book states that Robinson’s then-manager, Clay Hopper, a Mississippian who had opposed his place on the team, patted his new star on the back as he rounded third after the four-bagger.\n\n“This was the day the dam burst between me and my teammates,” Robinson later wrote. “Northerners and Southerners alike, they let me know how much they appreciated the way I had come through.”\n\nIn the fifth inning, Robinson bunted his way on, stole second and went to third on a ground out. He later scored again on balk. In his next at bat in the seventh, the rookie singled, stole second again and scored on a triple.\n\nThree hits and three runs scored. Not bad for a first-timer.\n\nIn the end, the Royals clobbered the Giants 14-1.\n\nMORE:Before Colin Kaepernick, Syracuse 8 were football protest pioneers\n\nRoosevelt Stadium, located at Route 440 and Danforth Avenue, was torn down in 1985 after years of decay and neglect, according to MiLB.com, the Minor League Baseball website. But a statue honoring Robinson’s debut in the city was erected in 1998 a few miles away.\n\nThousands of people pass the 14-foot statue at the Journal Square PATH station daily for a reminder of what occurred in the city 75 years ago.\n\nAnother New Jersey link\n\nBut Jersey City’s Giants are not the only New Jersey link to breaking the baseball color barrier.\n\nA few months after Robinson’s 1947 debut as the first man of color in the National League and the Major Leagues, another player broke the race wall in the American Leaque. Larry Doby, a South Carolina native, moved to Paterson at 14 with his mother and later attended East Side High School.\n\nAfter excelling in high school baseball, football, basketball and track, Doby joined the Negro League’s Newark Eagles in 1942 at the age of 17.\n\nBy 1943, World War II was in full swing and Doby joined the Navy for two years. Upon his discharge, he played a season for the San Juan Senators in Puerto Rico, then rejoined the Eagles in 1946.\n\nA year later, Doby started for the Cleveland Indians on July 3, 1947 just three months after Robinson’s Major League debut. He went on to play 13 seasons in the big leagues, for the Indians and later the Tigers and White Sox.\n\nDoby was inducted into the Baseball Hall of Fame in 1998. He died in Montclair in 2003.\n\nThe New Jersey Jackals and Passaic County honored the groundbreaking legend last month with a tribute at the July 23 Jackals game, a tour of Hinchliffe Stadium in Paterson, where Doby played high school ball, and a special July 29 viewing of a documentary on his life.\n\nMinors Team Name of the Week\n\nNow this week’s minor league name of note: Toledo Mudhens.\n\nFull disclosure, as a fan of M*A*S*H, the 1970s and 1980s comedy, I first learned of the Mudhens through Corporal Max Klinger, the fictional M*A*S*H character portrayed by Jamie Farr.\n\nFarr, himself a Toledo native, spewed tales and tributes for his home city during the series, often citing his love of the Mudhens. (He even wore a team jersey in several later episodes).\n\nWell, they are a real team and have been since 1896, making them one of the oldest continuously competitive minor league teams in the nation.\n\nLaunched that season as the \"Swamp Angels\", they played in Bay View Park, located near marshland inhabited by the American coots, also known as \"mud hens.\" Local sportswriters began calling them \"Mud Hens\" and the name stuck.\n\nAmong its notable alumni have been Jim Thorpe, Casey Stengel, Bobby Murcer, Frank Viola, Justin Verlander and Curtis Granderson.\n\nToday’s Mudhens are a Triple-A affiliate of the Detroit Tigers. Keeping with the marshland theme, their team store is the Swamp Shop, while their eat-in restaurant is the Bird Cage.\n\nAs for Farr, the team has not forgotten its most famous fan, holding regular M*A*S*H-themed events and even creating a bobblehead in his honor.\n\nJoe Strupp is an award-winning journalist with 30 years’ experience who covers education and Monmouth County for APP.com and the Asbury Park Press. He is also a die-hard Yankees fan when not checking out the marvelous minor leagues."}, {"url": "https://www.dailymail.co.uk/sport/mlb/article-11107851/Baseball-journeyman-Wynton-Bernard-makes-MLB-debut-10-YEARS-minors.html", "page_content": "This is the tear-jerking moment Wynton Bernard told his mom he was a Major League baseball player after 10 years of bouncing around the minors.\n\nBernard, 31, won't forget this week in a hurry, after the Colorado Rockies called him up to face the Arizona Diamondbacks on Friday, before he went on to tally his first hit, get a stolen base and secure his first ever run on debut.\n\nBernard has spent the last decade playing in the minors after he was initially drafted by the San Diego Padres, and he could be forgiven for thinking his time at the top had passed him by.\n\nWynton Bernard grounds out to second base in his first Major League at bat against Arizona\n\nOn Thursday, he gave his mom the news that he was heading up to the major leagues\n\nBoth Bernard and his mom cried on the phone, and things got even better on Friday evening\n\nWynton Bernard got the MLB call up to the Rockies after a decade in the minor leagues.\n\n\n\nHe shared the moment with his mom 💜🥺\n\n\n\n(via @bgold_3) pic.twitter.com/zd0A2bIS4C — SportsCenter (@SportsCenter) August 13, 2022\n\nBut the center-fielder got the call he dreamed about this week, and instantly FaceTimed his mom to give her the good news.\n\nIn the heartwarming clip, Bernard tells his mom: 'I'm going to the major leagues,' before they both break down in tears and he thanks her for her support over the years.\n\nTo top it off, she was able to attend the game on Friday night, watching from the stands as her son helped the Rockies to a 5-3 win with his first - and hopefully not last - run in MLB.\n\nSpeaking before the game, Bernard said: 'It's a special moment. After how many years I've played I'm finally here. It's amazing. I'm finally here.\n\n'My mom's emotions, it made me break down even more. She's done so much. The way I saw her take care of my dad before he passed away, he was bedridden but she stayed by his side.\n\nBernard warms up before his Major League Baseball debut with the Colorado Rockies\n\nFirst hit✅\n\nFirst stolen base✅\n\nFirst run✅\n\n\n\nWhat a debut night, @SaintBerny36! pic.twitter.com/zDT2datiFd — Colorado Rockies (@Rockies) August 13, 2022\n\n'I said to myself, \"I know how hard she worked so I'm going to work just as hard -- if not harder.\" Just to see her reaction meant a lot.'\n\nThe 31-year-old was taken in the 35th round of the 2012 draft and spent three seasons in the Padres' minor league system. He also played in the minors for Detroit, San Francisco and the Chicago Cubs along with stints in the Mexican Winter League, Venezuelan Winter League and independent ball.\n\nAnd he played for the Brisbane Bandits of the Australian Baseball League.\n\nColorado manager Bud Black went to see Bernard and outfielder Connor Joe in the winter of 2020. He pitched batting practice to both players and encouraged the Rockies to sign them.\n\n'I made the recommendation to our front office to see if we can sign these guys,' Black said. 'Our front office contacted their agents and they got deals done.'\n\nColorado Rockies head trainer Keith Dugger hugs outfielder Bernard during pregame warmup\n\nBernard jokes with Kelsey Wingert as she interviews him after his brilliant first MLB game\n\nJoe made his Rockies debut in 2021 while Bernard played for the Isotopes the past two seasons. He hit .254 with seven homers in 2021. This year, his numbers are outstanding: .325 with 17 homers, 24 doubles and 26 stolen bases.\n\nIn 10 minor league seasons, he is hitting .286 with 50 homers and 226 stolen bases.\n\nThe Rockies designated pitcher Jordan Sheffield for assignment. They also recalled catcher Dom Nunez and placed outfielder Yonathan Daza (left shoulder dislocation) and catcher Elias Diaz (left wrist sprain) on the 10-day injured list.\n\nBernard was slotted eighth in the lineup for his first big league game.\n\nThrough his first two at bats he went hitless with a ground out to second base and then a strike out. He then went on to record his first hit on an infield single in the bottom of the seventh inning.\n\nColorado would go on to win the game 5-3 after taking the lead in the seventh when Bernard would score the fifth run on a sacrifice fly hit by teammate Jose Iglesias.\n\nThe result would leave both teams with a record of 51-64 and tied for fourth place in the National League West. The teams will play again on Saturday in the second of a three game series."}, {"url": "https://studiogaryc.com/2021/02/03/country-brown/", "page_content": "Back in the 1940s and 50s, during that fleeting age just after the war and before television took over everyone’s recreation time, the minor leagues experienced their greatest years. During this era, there were about fifty minor leagues operating in all corners of the country, more if you include Canada and Mexico. And, in the decade before the Dodgers and Giants moved west and the Major League added more teams, each corner of the country had their own Paul Bunyan-esque minor league baseball heroes who, to them, were anything but minor. The west coast worshipped Steve Bilko, the southwest boasted of Joe Bauman, the northeast loved Luke Easter and, down south, no one player was cheered more than Country Brown.\n\nRalph Brown hailed from Walker County, Georgia, one of Tom and Dovie Brown’s ten children. The Browns worked a small farm and were hit especially hard when the Depression came in 1929. Brown and his siblings walked several miles each day to attend the nearest school, which stopped at grade seven. Still, Brown enjoyed school and continued to attend classes even though he aged out. Finally, the Depression made farm life unsustainable for the Browns, and the family moved to Summerville, in Chattooga County, where textile mills were hiring. Here, Brown was able to attend high school. His speed on the playground attracted the attention of Summerville High’s football coach. He was even more impressed with the teen’s speed when he realized that he was running in his older sister’s hand me down shoes! Wearing a new pair of boys cleats courtesy of the coach, Brown became a star running back for Summerville High’s football team.\n\nWhile still in high school, Brown began dating Curtis Mae, and the pair married. Luckily for the couple, Brown served stateside in the Army Air Force, and Curtis Mae was able to accompany her husband from post to post. It was during his army service that Brown began playing baseball seriously. He had played the game since he was a kid on the farm, but his high school did not field a team, so he had no coaching or team experience. While stationed at Daniel Field outside Augusta, Georgia, Brown played alongside and against many with professional experience, and was surprised to find he more than held his own. Being left-handed and six-feet tall, Brown was made the team’s pitcher and played outfield when not on the mound. Because he had no experience on the mound, Brown over extended himself and suffered an arm injury that limited his throwing ability for the rest of his career.\n\nIt was during his army service that he would also be given the name that would forever replace Ralph: “Country.” The story, as Brown later told it in 1994, came about when he was talking to a fellow GI from New York. When he asked Brown where he was from and the response was “Summerville, Georgia,” the New Yorker said “That must be in the country.” Brown said, “You could call it country” to which the Northerner stated, “I think I’ll just call you Country.”\n\nWhen Brown was discharged, he decided to pursue baseball as his career. The men he played with in the service told him that they’d spread the word of his ability. Sure enough, the Tampa Smokers of the Class D Florida State League signed him up for ’46, and Brown proceeded to set the panhandle on fire. First, he set an organized baseball record of hitting 13 consecutive base hits, a record that still stands. He hit the ball at a .381 clip and stole 32 bases, leading the league in both categories and being named the Florida State League’s MVP.\n\nAt this point, the New York Yankees became interested. The Yanks were re-building their early 1940s dynasty and were in the market for a hard-hitting, speedy outfielder to eventually take over from Joe DiMaggio. A check was cut and Country Brown became part of the Yankees organization.\n\nThe Yanks sent Brown to Augusta, their farm team in the South Atlantic League. There, Brown basically duplicated his 1946 season, batting .356 and swiping 44 bases for the Tigers. For the second year in a row he was voted his league’s MVP. The future seemed limitless for Country Brown, and the papers opined that it was just a short time before he would be playing center field in Yankee Stadium. The Yank’s front office thought the same and sent Brown to their top farm club, the Newark Bears, just a subway token away from Yankee Stadium.\n\nWith Newark, Brown faltered a little, hitting .263 in 12 games. The Yankees scouts also became concerned with Brown’s throwing arm, injured during his army service. The higher-ups surmised that it would be too weak to make the long throws from Yankee Stadium’s outer fields, and the consensus was to convert Brown into a first baseman. While Country might have consented to re-training as a first baseman, he wasn’t having any of the team’s proposal to send him back to single A ball to learn to how to play first base.\n\nBy this time, Brown was 27 years old and his window of opportunity was closing fast. Every year, the Yankees signed younger kids who already knew their way around first base, so having to work his way back up the chain of farm teams after learning a new position didn’t sit right with him. Brown refused to report. The Yankees, not used to anyone saying no to them, were indignant at this upstart named Country. Brown didn’t care; he took the train back to Summerville to see what would happen next. He didn’t have long to wait. Within ten days, his contract was purchased by the Atlanta Crackers of the Class AA Southern Association.\n\nThe Atlanta Crackers were the classiest ballclub in the south. Their attendance was consistently among the highest in the league and fielded lineups that kept them in the thick of the pennant race each summer. The team’s owner, Earl Mann, was a player’s owner, and he treated his boys like they were kin. Breaking from the norm, Mann guaranteed his players that if he sold their contract to a big league team, they would get a taste of the money, too. No other owner did this on a regular basis. Country Brown’s short but spectacular minor league record and his being a Georgia boy combined to make him an instant fan favorite in Atlanta.\n\nBrown joined the team in June and proceeded to live up to his reputation, batting .338. But besides a great average, Country Brown seemed to be the consummate ballplayer. Sure, he could slug the ball, but he also made highlight reel catches before there were highlight reels. And that weak arm the Yanks were worried about? The Southern Association players heard about it, too, and commenced testing it out. When Country threw out half a dozen runners trying to stretch a single into a double, no one talked about Country’s arm any longer. But the one thing that singled out Country Brown from the rest was his ownership of the old-time drag bunt.\n\nThe drag bunt was particularly suited to left handed batters like Brown because in the batter’s box they were already closer to first base. As opposed to the common bunt, where a batter squares before the pitch is thrown, a drag bunt requires the batter to stay in his stance as if to swing, only squaring to bunt after the ball is on the way to the plate. At this point, the batter angles the bat towards third base, directing the ball in that direction and into the dirt. With the left-handed batter already closer to first, a speedy runner could beat out the play time and time again. And that’s just what Country Brown did. It’s a faster, more intimate play than a home run, and the Atlanta fans loved it. More than the excitement Brown’s drag bunting generated, it made him a perennial baserunner where his speed became an additional offensive threat.\n\nBesides his hitting, running and anything else he did on the field, Country Brown’s own nature made him the most popular player not just on the Crackers, but throughout the Southern Association. He didn’t have movie star looks or a classic athlete’s physique. He didn’t come from money or a big city. He’d even given up his place on the greatest baseball team in the world to play back home. He was a country boy from Georgia who looked every inch like the hard scrabble son of the Great Depression south that he was. In short, Country Brown was one of their own.\n\nFor four and a half long hot summers, Country Brown played for Atlanta. While other players came for a season, made a name for themselves and moved on, Country remained a fixture in the Cracker’s outfield. It seemed as if everyone had a personal story to tell about Country, how he somehow endeared himself to a young fan.\n\nOne story, told by Harold “Bubba” Love in one of those “remember when” articles, tells of the time when as an 11 year-old, his only desire was to get a ball signed by his favorite player, Country Brown. When his parents scored seats behind the dugout, he knew his chance had come. Late in the game, Crackers manager Dixie Walker emerged from the dugout and moved to the railing near where he was sitting. After some prodding, Bubba approached Walker for a signed ball. It wasn’t Country Brown, but he figured this could be an opening to get that prized signature. Walker turned the boy down cold, telling him he couldn’t spare a ball. Young Bubba returned to his seat, defeated. However, somehow, Bubba never knew how, Country Brown learned of the exchange. A few innings later, a voice called out from the field. It was Country Brown, and he was gesturing towards Bubba! He ran down to the railing where he was greeted with a handshake from his hero and presented with a brand new Southern Association ball, complete with Dixie Walker and Country Brown’s names penned on the white leather.\n\nAnother great anecdote from his Crackers years is from June of 1949 when he and his wife Curtis Mae had their first and only child. Batting in the first inning that night, Brown took a strike, then stepped out of the box, took a cigar printed with “It’s a Boy” on the label and handed it to the umpire. The crowd went nuts. It’s those kind of gestures, not just cold stats, that made Country Brown a legend.\n\nThe 1950 team has gone down in history as the best lineup to ever wear the Atlanta colors. Besides Country Brown, the Crackers featured a teenage phenom named Eddie Mathews, who proceeded to punish Southern Association pitchers to the tune of 32 home runs. The Crackers ran away with the pennant and cemented their reputation as the class of the Southern Association. Yet, while lesser players passed through on their way to The Show, Country remained a Cracker.\n\nIn 1951, Country Brown was thirty. There was no way a big league team was going to take a chance on a middle-aged singles hitter with a sore arm label. For his part, Country Brown was content in Atlanta. He was making between $600 and $700 a month, not bad at all for the time. Plus, he was a star down south and close to his family in Summerville. As he told the Atlanta Constitution in 1994, “I felt like when I was playing for the Crackers I was in the major leagues.”\n\nBut all good things must come to an end. After that great 1950 season, relations between manager Dixie Walker and his perennial star, Country Brown, soured. The team was underperforming on the field, and Walker was taking most of the flak for it. He, in turn, took it out on Brown. Things got worse in 1952, culminating in Walker suspending Brown for “insubordination.” Country went home to Summerville and stayed put after his suspension ended. When Crackers owner Earl Mann called to see what the problem was, Country told him he couldn’t play for Dixie no longer. While Earl Mann was ahead of his time in player-owner relations, he could not bring himself to fire a manager to placate a player. A few days later, with Country’s okay, Mann sold his veteran star to The Chattanooga Lookouts of the same league.\n\nThis surprise move immediately came back to haunt Dixie Walker and the Crackers. Re-invigorated with the Lookouts fan support (Chattanooga was only a few miles from Summerville), Country went on a hitting tear that not only destroyed Atlanta’s pennant hopes, but propelled Chattanooga to the Championship. As in Atlanta, Chattanooga’s attendance soared with the addition of Brown. After two seasons, he was traded to Little Rock, Birmingham and then Nashville, all still Southern Association League teams who benefitted at the box office from Country’s rabid fan support. Finally, at the age of 36, Country was ready to call it quits. However, he delayed his retirement for one more season when the Louisville Colonels offered him $800 in 1957. Louisville was in the American Association, one level below the majors. Even with his eye sight failing, Country managed to hit .245 against future major leaguers almost half his age.\n\nCountry took his wife and child back to Summerville, where he remained a local legend. He bumped around trying out different occupations that didn’t require a bat before settling into law enforcement. He rapidly advanced to become a popular judge in his native Chattooga Country. As a final nod to his career as the most beloved ballplayer in Georgia, he was inducted into the state’s Sports Hall of Fame in 1994. Up until he passed away in 1996, Country Brown still received daily letters from his former fans, now approaching retirement age, asking for the signature of their old hero."}]}