{"Wayne Allyn Root was an anchor of War Stories with Oliver North on Fox News Channel.": [{"url": "https://www.britannica.com/biography/Oliver-North", "page_content": "Oliver North, in full Oliver Laurence North, (born October 7, 1943, San Antonio, Texas, U.S.), U.S. Marine Corps officer, conservative political commentator, and author who was involved in the Iran-Contra Affair in the 1980s.\n\nNorth graduated from the U.S. Naval Academy and served in the Vietnam War. In 1981 he was assigned to the National Security Council, where his work focused on Central America. Embracing the cause of the Nicaraguan contras, he raised private donations for them. In 1986, after Congressional investigation of the Iran-Contra Affair, he was reluctantly dismissed by then president Ronald Reagan. In 1988 North was indicted for conspiracy to defraud the government and resigned from the Marine Corps. At his 1989 trial, he was found guilty of obstructing the U.S. Congress, destroying documents, and accepting an illegal gratuity and was sentenced to two years’ probation. In 1991, after a prosecution witness claimed that his testimony had been tainted, all charges against North were dropped.\n\nNorth ran unsuccessfully for a U.S. Senate seat in Virginia in 1994. In the mid-1990s he began hosting a conservative radio talk show. He also cowrote a number of books, including a thriller series. The memoir Under Fire: An American Story (cowritten with William Novak) was published in 1991. North was named president of the National Rifle Association (NRA) in 2018. He later became involved in a power struggle with NRA chief executive Wayne LaPierre as regulators investigated the organization’s tax-exempt status amid allegations of financial improprieties. In 2019 North announced that he was resigning as president, noting that the NRA was in the midst of a “clear crisis.”"}, {"url": "https://www.wikiwand.com/en/War_Stories_with_Oliver_North", "page_content": "War Stories is a military history program on Fox News, hosted by Oliver North, a decorated Marine Corps officer, Vietnam war veteran, and key participant of the Iran–Contra affair. The program covered a number of different stories relating to war and national defense, featuring individuals who were directly involved with the topic covered in the episode.\n\nFormer military history program on Fox News\n\nAmerican TV series or program\n\nQuick facts: War Stories with Oliver North, Starring, Coun... ▼ War Stories with Oliver North Starring Oliver North Country of origin United States Original language English No. of episodes 101 list of episodes) Production Executive producer Pamela K. Browne Running time 60 minutes Release Original network Fox News Original release September 30, 2001 ( ) –\n\nMarch 25, 2016 ( 2016-03-25 )\n\nEach episode focused on one of three areas:\n\nA particular noteworthy individual, such as George Patton or Douglas MacArthur\n\nA particular battle, such as the Battle of Hamburger Hill\n\nA segment devoted to a specific topic, such as the use of animals in the military or the Huey\n\nThe episodes were often based on current events; the episode which aired August 6, 2006 featured the history of Fidel Castro's rise to power (in light of Castro's temporary relinquishment of power) while the prior week's episode centered on Hezbollah.\n\nNorth ends the episode with the tagline, \"his/hers/theirs is a war story, that deserves to be told\".\n\nAs of January 3, 2015, War Stories with Oliver North is aired on the weekends from 8-11 p.m. ET on Fox Business Network.\n\nA new episode of War Stories with Oliver North was aired on Friday, March 25, 2016. The episode was titled War Stories: Fighting ISIS.[1]"}, {"url": "https://www.foxnews.com/story/war-stories-exclusive-interview-with-oliver-north", "page_content": "In advance of another season of War Stories with Oliver North on the FOX News Channel, foxnews.com sat down with North to discuss his experiences in Iraq and the highlights of the new season.\n\nBe sure to watch War Stories on Sunday evenings at 8 p.m. ET only on the FOX News Channel!\n\nFOXNEWS.COM: You’ve served in other military conflicts as a soldier. What was it like to be a part of a war [Operation Iraqi Freedom (search)]as a member of the media?\n\nLT COL. OLIVER NORTH, WAR STORIES HOST: There are some things that never change. The dust, the long sleepless days and nights, the stark reality of war's horror. As a Marine officer in combat, I was responsible for the lives and safety of all the Marines who served with me. This time I was responsible only for myself and my very brave field producer Griff Jenkins.\n\nIn uniform I had to make judgments about the best course of action in combat when the only choices were \"bad\" or \"worse.\" As a member of the media I only had to decide how to get the best \"shot\" -- preferably without getting shot.\n\nIn the end, my prior military experience was a considerable advantage. I knew the \"lingo,\" could \"speak their language,\" and the soldiers, sailors, airmen and marines we covered all knew me -- and knew without question that I would give them a fair shake at letting them tell their story.\n\nI don't pretend to be a trained journalist. I do write a weekly newspaper column and a book now and then. And over the past two years I've learned a good bit about television here at fox news channel -- but I didn't study journalism at [the Naval Academy in] Annapolis. So I decided right from the start to simply let these youngsters tell their own story. I made it a practice to try and put one of them on each live or taped broadcast. I went out of my way to interview and put on the air the young troopers who were doing the fighting rather than the senior officers and generals who were running the war -- and I think that made a big difference. That's they way Ernie Pyle (search) covered world war ii and I figured if it worked for him it would work for me. It did.\n\nA lot of people have said nice things about my reports during the war -- and I'm grateful. But I think the real reason it \"worked\" is because what they saw wasn't about me -- it was about the brave young Americans we have serving in harm's way.\n\nI like to tell people that I have the best job in the media. All I do is hang around with heroes. I do that every week for my \"War Stories\" documentary series -- and when FOX News wants -- I go off and cover the young Americans we send to places like Afghanistan or Iraq. Sure beats covering car chases in Los Angeles.\n\nFOXNEWS.COM: Were you embedded longer than any other FNC journalist? - it seemed like you were “serving” for a very long time! How did you manage the physical strain of your job?\n\nNORTH: I wasn't keeping score as to who was there the longest, but I'm pretty sure I was the oldest. And while I try to keep myself in pretty good shape, I still lost 18 lbs. When I returned, one of my daughters -- a nurse -- told me, \"if you were really in the kind of shape you said you were in dad, you wouldn't have lost so much weight.\" the fact is -- even the young guys -- average age of a Marine or soldier is 19.6 years -- will lose a good bit of weight over there.\n\nAt one point I had my camera on while I ran to cover a minor fire-fight that had broken out about 150 yards from where I had been standing. All you can hear in the microphone is a few shots being fired -- and my heavy breathing! When I caught up to the staff sergeant who was leading the attack he turned to me and said, \"Hey, Colonel, you all right?\"\n\n\"Sure,\" I huffed in response, \"Why?\"\n\n\"'Cause you're sweating like a hog!\" he replied with a smile. And I was. But then again -- he was 25 and I'm pushing 60.\n\nFOXNEWS.COM: What’s the most memorable moment of your tour as an embed?\n\nNORTH: The most surprising thing about this war was how fast it went. No military force in history has ever gone so far, so fast, with so few casualties. Except for one 3 day period when we were blanketed by a dust storm of biblical proportions, we moved almost non-stop, day and night, from the start of the war on 20 March all the way to the end.\n\nThere were -- because this was war -- some very memorable events: the first casualties of the war occurred just a few yards from us as a helicopter went down in a terrible fireball -- killing all aboard. There were the night attacks across the Euphrates and the Tigris; the capture of the salman pak terrorist training facility; the presidential palace in baghdad -- where the helos we were riding got shot at on every mission -- and hit more times than i care to count. I won't forget the day we got shot down in a UH11N north of Baghdad -- or the guys who rescued us.\n\nMost memorable of course are the people. The list is too long to name them, but i will never forget them. They are the smartest, fittest, best trained and best equipped young soldiers, sailors, airmen, guardsmen and marines our country has ever had. And while I don't think anyone who has ever really been to a war ever wants to go to another -- we're blessed to have young Americans who are willing to go when our country calls. And I'm blessed to be able to have gone with them.\n\nFOXNEWS.COM: What do you think the American public needs to know about war with Iraq?\n\nNORTH: That is isn't over -- and we have a long way to go. There are three distinct groups shooting at our troops in Iraq:\n\n1. The criminals Saddam released just before the war started. The only way to deal with them is to reconstitute an Iraqi police force, have Iraqi cops arrest these crooks and put 'em back in jail.\n\n2. The Baathists (search) who miss the perks of power. These thugs know Saddam isn't going to make a \"comeback\" but they think if they can drive us out, they can reclaim some of their prior status. They are now paying unemployed soldiers to shoot at our troops. An Iraqi National Guard needs to be recruited and trained to deal with this problem ASAP before it gets any worse. The unemployed soldiers who don't get recruited for the new national guard need to be put to work cleaning up the mess Saddam made of their country.\n\n3. The \"Jihaddists\" these are the radical Islamic terrorists -- most from outside of Iraq who are being fomented to blow themselves up trying to kill Americans. These are real terrorists and they can only be dealt with one way: they have to be killed before they can kill themselves killing an American. We have the kind of units that are very good at doing just that. We need better intelligence -- and it's coming. It may mean doing some very tough things in neighboring countries -- like we did in Yemen with the predator. But in the end, the best way to prevent terror attacks is to kill the terrorists. Sounds harsh. It is. But it beats being killed by a car bomb.\n\nIf we deal with [these groups] as quickly as indicated above, a functioning democracy and a healthy economy will follow quickly.\n\nFOXNEWS.COM: What do Americans need to know about the post-war era in Iraq?\n\n\n\nNORTH: See answer to #4 above.\n\nFOXNEWS.COM: Let’s discuss the new season of War Stories… Is there a theme to the shows for this season?\n\nNORTH: The same as always: we let the heroes tell their own stories. That's what makes this whole series so great. We go out and find the real footage, digging through the hundreds of film reels at the National Archives and old reels from Fox Movietone News (search). We then find those who fought the battles, put them in front of a microphone and a TV camera and have them bring these events to life.\n\nEach episode of War Stories is about a particular battle, place, event or person. And everyone involved tries hard to bring out facts that may not be known all that well. Most importantly, we've been able to document these with those who were there -- and some of them -- like Joe Foss -- who appears in both the Guadalcanal episode -- and our show on Aces -- blessed us with their last recorded interviews before they died.\n\nWe don't just document history -- we let those who made history document it for us.\n\nFOXNEWS.COM: What have you learned, in an historical sense, from the subjects you’ve profiled this season?\n\nNORTH: There is no lack of heroism for those who fight. And while I am absolutely in awe of what our soldiers, sailors, airmen, guardsmen and Marines do in combat -- Americans don't have a monopoly on courage. This season we'll bring our viewers Allies who fought bravely in every theater. We've got the heroes of the U.S. Merchant Marine -- who suffered greater losses in World War II than any of the armed forces. We have an exclusive interview with the last German spy sent to America in a U-boat during World War II. We have the FBI agents and O.S.S. officers who fought the war in the shadows -- often with no recognition whatsoever. We have a profile on Douglas MacArthur that will surprise a lot of people who think they know all about him.\n\nBecause we're losing so many of those who fought in World War II, we wanted to document as much of that war as possible before we lose our eyewitnesses. And even though I grew up in the home of a WW II vet, and have studied the war in detail -- I learn something new in the interviews I conduct for every episode.\n\nFOXNEWS.COM: How long does it take to put together a new season of war stories?\n\nNORTH: We started working on this season's 10 new episodes last November. We'll finish up in September. Of course we got a little behind in our work while I was off running around Iraq -- and then putting together our \"Operation Iraqi Freedom\" special. But generally speaking it takes about two months per episode and we edit on two at a time.\n\nFOXNEWS.COM: What kind of a team do you work with?\n\nNORTH: They are all professionals -- who know how to take countless hours of film, videotape and live subjects and make great TV. Pam Browne, our Senior Producer has had a long career in television news and she supervises all of our episode producers and production assistants. They all do volumes of research on each event that we cover -- and it shows in the final product.\n\nWe're our own greatest critics -- but the compliments we receive from veterans, their families and from the military services themselves that \"you got it right,\" is our greatest assurance that we've captured the events correctly.\n\nFOXNEWS.COM: Do you have a favorite program this season?\n\nNORTH: This is our third season coming up and that's really a tough call. The fighter aces show we're leading with has some heart-stopping stuff in it -- and guys who really do have \"the right stuff.\"\n\nOur episode on how the merchant marine ran the gauntlet of German U-boats, raiders and Japanese attacks will make some people wonder how we managed to win WW II.\n\nThe MacArthur biography -- thanks to the folks at West Point (search) and the MacArthur Memorial Library & Archives -- and those who served with him is a real eye opener.\n\nAnd anyone who watches our untold story of the Eastern Front will give everyone a whole new perspective on how tough things can get in combat.\n\nThanks to some great research, production and eyewitness accounts, the harrowing battles for Guam (search), Saipan (search) and Tinian (search) in the Mariana Islands (search) will seem like yesterday.\n\nAnd when you see \"Agent 146 -- Spying for the Third Reich\" you will understand why even the prosecutors who tried Erich Gimpel (search) -- a German spy -- wanted to spare his life. He was sentenced to death. We found him alive.\n\nLots of people saw the \"Black Sheep Squadron\" television show years ago. But almost nobody knows the true story of this legendary Marine fighting squadron. We've got it.\n\nThe U.S. Army's \"Big Red One\" has a lineage that spans America's history -- and the way our War Stories team put this episode together will make everyone who knows a soldier proud.\n\nBecause this is the 50th anniversary of the end of The Korean War (search) -- we wanted to get the heroic stand at the Pusan Perimeter (search) right. And we did.\n\nIf World War II had a \"forgotten battle\" it was in the Pacific at Peleliu (search). Yet, after you see the way we covered the bloody battle for this 8 square mile piece of coral jutting out of the South Pacific -- you'll always remember.\n\nThat's quite a season -- I can't pick a favorite. And I’m pretty sure that after our fans see these episodes -- they'll agree -- these are all \"war stories\" that deserve to be told.\n\nBe sure to watch the new season of War Stories on Sunday evenings at 8 p.m. ET only on the FOX News Channel!\n\n"}, {"url": "https://www.foxnews.com/story/war-stories-from-iraq-with-oliver-north", "page_content": "Sunday, November 9 at 8 p.m. ET!\n\nHosted by Lt. Col. Oliver North\n\nHere's just some of what you'll experience in this special edition of War Stories with Oliver North...\n\nIt was the second time we faced a familiar enemy...\n\nOn the morning of March 20, 2003, American and British coalition forces stormed into the Al Faw peninsula from Kuwait.\n\nFrom sea, they launched Tomahawk cruise missiles and air strikes targeting key government buildings in the capital city of Baghdad. Operation Iraqi Freedom (search) had begun. The mission was to topple the Iraqi dictator Saddam Hussein and his bloody regime that had terrorized the Iraqi people for more than 25 years. The mission was accomplished in three weeks. No military force has ever gone so far so fast and with so few casualties.\n\nEmbedded first with the 1st Marine Expeditionary For (search)ce and later with the Army's 4th Infantry Division (search), combat veteran Oliver North brought a unique perspective to the battlefield. Over 44 days, using hand-held small cameras, North and his field producer Griff Jenkins, were able to capture exclusive, dramatic behind-the-scenes footage from battle and casualty evacuation operations in Iraq.\n\nIn this special episode, you'll meet some of the soldiers, sailors, airmen and Marines who battled their way through this ancient land. Some paid for the liberation of others with their lives. You’ll experience the danger our troops faced each day from Saddam’s army and the threat of chemical weapons. You’ll see the abandoned, opulent palaces that the dictator built and the slums his countrymen called home.\n\nIn this special edition of War Stories From Iraq with Oliver North, you will go inside rescue operations during a blinding sandstorm. And, you'll witness the heroism of a Marine captain who coordinated the rescue of 73 Marines in the fight for Saddam's palace.\n\nThese are stirring stories from the frontlines of \"Operation Iraqi Freedom.\"\n\nDon't miss this week's episode of War Stories From Iraq on Sunday, November 9 at 8 p.m. ET!\n\nStaff for this special episode:\n\nSenior Producer: Pamela K. Browne\n\nField Producer : Griff Jenkins\n\nProduced and Written by: Pamela K. Browne, Cyd Upson, Martin Hinton and Gregory Johnson\n\nEditor: Josh Parker and Eddie Montague\n\nDesigner : Greg Van Why"}, {"url": "https://www.foxnews.com/story/an-exclusive-interview-with-oliver-north", "page_content": "Our new series of War Stories episodes is underway!\n\nRecently, we asked the host of War Stories, retired Marine Lt. Col. Oliver North to talk with us about the series and what Americans can learn from the heroism displayed every Sunday night at 8 p.m and 1 a.m. ET.\n\nFoxnews.com: As we inch closer to a possible war with Iraq, what can Americans learn from the men and women profiled in the War Stories episodes?\n\n\n\nCol. North: War Stories takes me all over the world to interview those who have fought in past conflicts and those who serve today. There are remarkable parallels: Now as then they are citizen soldiers. They are bright, remarkably well trained, dedicated to one another, committed to the cause of freedom and willing to go into harm's way if that's what our country requires. And now -- as then -- they are the best in the world.\n\n\n\nUnlike our adversaries in the past or today, our military is comprised of young people who grew up in freedom. None of them that I have met, then or now, glorify war -- but they do want to have their sacrifices recognized.\n\n\n\nAnd having served for 22 years myself, there is one similarity that's driven home to me every time I review the footage from some battle in the past -- and every time I talk to one of those serving today: Those who fight our nation's battles are young. In peacetime we would call them boys and girls. In times of war we call them soldiers, sailors, airmen and Marines.\n\n\n\nFoxnews.com: Just recently we aired The Battle of Britain. What's special about that new show?\n\n\n\nNorth: The Battle of Britain is about the remarkable people of the British Isles -- fighting alone against Hitler before the U.S. entered the war.\n\n\n\nYoung people today -- looking at the U.S. And Britain standing up to Saddam Hussein -- wonder about the \"special relationship\" that we have with the U.K. There is more to it than just a common language -- and it's evident in this episode of War Stories. Winston Churchill said of the Royal Air Force heroes we have on this show: \"never was so much owed by so many to so few.\" He was right.\n\nFoxnews.com: What's your favorite show in the news series? Why?\n\nNorth: I can't pick a favorite. Whether I'm with those who fought in the skies over Europe, at Pearl Harbor, in the jungles of Burma, the mountains of Europe, on Guadalcanal or the desert in North Africa, the freezing cold of \"The Bulge\" or the troops in and on the way to Afghanistan or Iraq, it's clear to me that I've got the best job in television. All I do is hang around with heroes. Some of ‘em are older than I am. Some are younger -- but they are all people who have dared to do difficult and dangerous things when their country called. They all put themselves at risk, were separated for months or years from family and loved ones and are a great inspiration to me – and, I think, to our audience. At the end of one of these episodes of War Stories you can't help but feel better about who we are as a people.\n\nFoxnews.com: What have you learned from doing this series?\n\nNorth: We're told by the media critics that the American audience likes \"reality TV.” Well this is \"reality television\" -- with live ordnance! And the people we interview are real \"survivors.\"\n\nBut aside from the excitement that is inherent in any depiction of combat and courage, there is an incredible thirst for these stories in the American public. The response we have received to these documentaries has been overwhelming. As a person who spent more than two decades in uniform, it has been especially gratifying.\n\nFoxnews.com: None of the producers for War Stories has a military background... is that a good thing or a bad thing?\n\nNorth: I think it helps. First, they are professional journalists and broadcasters. They all are very careful in their research and have a good \"eye\" for how something will look on the show. Second, at almost as important: I'm a military man. I tend to think, write and speak in military jargon -- a \"language\" that most people don't really understand. Our War Stories team will catch something I, or one of those we're interviewing, have said that might not be comprehended by our civilian audience and ensure that we put it in terms that everyone understands.\n\n\n\nFoxnews.com: How do you prepare for each episode of War Stories?\n\nNorth: We get a lot of great ideas about particular battles or events from our viewers. But FOX News requires that we have real footage -- either videotape or combat \"mo-pic\" film -- and real eyewitnesses to the events -- people who are actual participants. That means our production team will spend weeks -- sometimes months -- trying to chase down some footage that's relevant to the story. We spend hours interviewing the participants -- and sometimes traveling around the world to find them. We also look for appropriate venues for every episode so that our viewers have a sense for the history we're documenting. Finally, we spend countless more hours editing what we have to make it all fit in a one-hour show. It's not unusual to have 10 or more hours of tape in an episode... so that's quite a challenge.\n\nFoxnews.com: What's the one thing you would like the FOX News Channel audience to know about these shows?\n\n\n\nNorth: For two centuries the people of the United States have dispatched their sons and daughters to far away places to defend the liberties we hold dear and to offer others the hope of freedom. We have never fought for gold or colonial conquest but for the ideals in our own Declaration of Independence and Constitution. No other nation on earth can make such a claim. These are the people we honor in these documentaries. Fifty years from now, these stories will still be relevant. Each episode is a chronicle of courage. They are all part of an extraordinary legacy and help those who see them understand who we Americans really are.\n\nPlease join us for War Stories every Sunday evening at 8 p.m. and 1 a.m .ET on the FOX News Channel."}, {"url": "https://www.thefamouspeople.com/profiles/oliver-north-5035.php", "page_content": "In 1981, he graduated from the Naval War College in Newport, Rhode Island, where he had taken a 'Command and Staff Course'.\n\nHe attended the United States Marine Corps Platoon Leaders Class for a summer. This was held at the Marine Corps Base Quantico in Virginia. In 1963, he was appointed in the United States Naval Academy.\n\nIn 1961, he graduated from the Ockawamick High School. He later went on to attend the State University of New York at Brockport, New York, for two years.\n\nHe was born as Oliver Laurence North on October 7, 1943 in San Antonio, Texas, to Oliver Clay North, a US Army major and Ann Theresa. He was raised in the neighbourhood of Philmont, New York.\n\nRecommended Lists:\n\nCareer\n\nIn 1968, he was appointed as a second lieutenant in the United States Marine Corps. During the Vietnam War, he was posted as a platoon commander.\n\nHe became an instructor in Quantico, Virginia, at the United States Marine Corpse’s, The Basic School, which was training school that intended to teach the various prerequisites needed to become an Officer of Marines.\n\nIn 1970, he went to South Vietnam as one of the witnesses of the trial of Corporal Randy Herrod. Herrod, a U.S Marine, previously under his commandment, was accused of mass killing of Vietnamese citizens.\n\nIn 1971, he received promotion as Captain and started serving as the commanding officer of the U.S. Marine Corps in the Northern Training Area in Okinawa Prefecture, Japan.\n\nAfter duty in Japan, he was commissioned to work at the Marine Corps Headquarters in Arlington, Virginia, for the next four years. Subsequently, after being promoted as a major, he served as an operations officer in the 3rd Battalion, 8th Marine Regiment.\n\nFrom 1981, he was appointed as the deputy director for political-military affairs in the National Security Council in Washington, D.C. In the next three years, he was promoted as a lieutenant colonel.\n\nAs the deputy director for political-military affairs in the National Security Council, he led the operation of the ‘1983 Beirut barracks bombing' case. This bombing resulted in the loss of 299 military personnel, both American and French.\n\nDuring his tenure with the National Security Council he was part of the ‘Operation Urgent Fury', which was the 1983 invasion of Grenada, located in the Caribbean Islands. He also planned the bombing of Libya.\n\nHe was implicated in the Iran–Contra affair, which involved the sale of arms to Iran in exchange for U.S. hostages. This was to covertly aid Contra guerrillas in Nicaragua.\n\nContinue Reading Below\n\nIn 1988, he officially resigned from the Marine Corps commission. During his trial period in the last two years, he was on duty at the Headquarters Marine Corps in Arlington, Virginia.\n\nIn 1989, he was declared guilty of 12 charges in the Iran–Contra affair and was granted a suspended jail sentence of three years. He was also fined a sum of $150,000.\n\nIn 1990, three of the charged convictions were dropped. The following year, he was relived off the charges that were put against him, after it was found that the witnesses were impermissibly affected due to his 'immunized congressional testimony'.\n\nIn 1991, he came out with the book titled, ‘Under Fire: An American Story'. The same year, he was seen on the first season of the syndicated talk show, 'The Jerry Springer Show' and the sitcom, ‘Wings’.\n\nIn 1994, he stood for the United States Senate as the Republican Party candidate in Virginia. The run was not a successful one as he lost to Democrat candidate Charles Robb.\n\nFrom 1995, he started hosting the nationally-syndicated radio show, 'Oliver North Radio Show or Common Sense Radio'.\n\nFrom 2001, he started hosting the Fox News military history show, ‘War Stories with Oliver North'. He also appeared as a commentator on the TV show, ‘Hannity'. He was also seen on the drama show, ‘JAG’.\n\nIn 2012, he was given credit as the military consultant for the shooter video game, ‘Call of Duty: Black Ops II’. He has also appeared on an episode of the reality show, ‘Auction Kings’.\n\nContinue Reading Below"}, {"url": "https://www.foxnews.com/story/oliver-north-on-controversial-videotape-from-fallujah", "page_content": "This is a partial transcript from \"Hannity & Colmes,\" Nov. 15, 2004, that has been edited for clarity.\n\nWatch \"Hannity & Colmes\" weeknights at 9 p.m. ET!\n\nSEAN HANNITY, CO-HOST: U.S. troops battling for Fallujah have destroyed Iraq's, well, terrorist insurgent headquarters, while Iraqi militants have opened up fronts in other parts of the country.\n\nBut today there was some troubling news from Fallujah. A video obtained by Fox News allegedly shows Marines entering a mosque and finding several wounded Iraqi sniper terrorists. Now, one of the Marines explains that one of the fighters is not actually dead. Let's take a look at what happens.\n\n(BEGIN VIDEO CLIP)\n\nUNIDENTIFIED MALE: He's dead.\n\n(END VIDEO CLIP)\n\nHANNITY: And then he says, \"Now he's dead.\"\n\nJoining us now, the author of the brand new book, \"War Stories II: Heroism in the Pacific,\" a great book, by the way, and also host of \"WAR STORIES\" here on the Fox News Channel, Oliver North.\n\nIt's a tough video.\n\nOLIVER NORTH, \"WAR STORIES\": Well, it is. But here's the important thing.\n\nWhat ought to be the story is that, that case, what you just saw on the television, is going to be thoroughly investigated. If a crime was committed — and we don't know that for certain — but if a crime was committed the individual or individuals participating in it will be prosecuted. And a just punishment will be ascribed.\n\nThere are several things that are important here. One, that will never happen to those who beheaded those poor hostages. There will never be a trial, there will never be an investigation, because they got away with it.\n\nWe're different. And in World War II, the book, those kinds of things happened and no military organization, not in our country, whether it's the Army, Navy, Air Force, Marines or Coast Guard, can allow that kind of thing to happen.\n\nHANNITY: But first of all, I want to urge everybody, because now this is getting wallpapered all over the media.\n\nNORTH: This will be the story.\n\nHANNITY: Well, and here's my concern. Number one, you're right. We cannot tell.\n\nNumber two, what I see here doesn't look good, Colonel.\n\nNORTH: No, it doesn't.\n\nHANNITY: I want you as a guy that has two or three purple hearts, has won all of these medals, put us in the position — these guys — there has got to be some perspective here brought to the situation for the American people and the people sitting at home.\n\nNORTH: These guys have been in combat now nonstop 24/7 for eight days. They kicked off the attack, Sunday, a week ago. They have been at it for eight days. They are exhausted. Nerves are frayed.\n\nThis guy, who apparently did this deed, was wounded himself just hours before this event. He's lost good buddies.\n\nAll of that said, no U.S. military organization can ever have that kind of thing happen without some kind of action being taken to prevent it from happening again.\n\nHANNITY: But with all the — it has to be, if, in fact, what we think may have happened on the tape, if, after it's fully investigated — would it be brought into account, well, this guy that's now — wait a second — this guy who has risked his life, who has been up now 24/7 for the last eight days, that maybe in a moment of — made a mistake. Is there any forgiveness for him?\n\nNORTH: Well, I mean, what will happen, is there will be a court — if, indeed, this thing proves to be a crime. OK? There will be an article 32 investigation conducted by naval intelligence or naval investigative service.\n\nThey will judge whether a crime was committed. Then they will find out who was responsible for the crime, the individual himself, his supervisor, meaning the next small-unit leader, maybe all the way up the chain of command.\n\nHANNITY: This concerns you, though?\n\nNORTH: It has me deeply concerned because — for two reasons. One, you can never have something like what is alleged take place without some kind of punishment.\n\nNumber two, my concern is that this will become like Abu Ghraib became the story. This will become the story of Fallujah without perspective — look. You and I, all three of us, know the mainstream media. They are going to jump on this story and make this the story.\n\nWorse yet, the Arab media, Al-Jazeera, Al Arabiya, all of them, are going to make this the story. And what's — all the good that's being done out there, it will be forgotten. It'll be washed over...\n\n(CROSSTALK)\n\nCOLMES: I want to ask you this. What does the military code say about situations like this?\n\nNORTH: The uniform code of military justice is very clear. You cannot shoot when — there is no such thing as a mercy killing. There is no such thing as a reprisal killing.\n\nCOLMES: Right.\n\nNORTH: You cannot shoot somebody who is unarmed or unable to defend themselves.\n\nCOLMES: Why do we have soldiers in positions where they are working so many hours that maybe it's hard...\n\nNORTH: Because, Alan, it's war. OK? War is what this is all about.\n\nCOLMES: But there are rotations, right?\n\nNORTH: Well, yes, but, I mean, the fact is, I mean, I just wrote a book about this. Those guys went on and stayed on for four years in World War II. This is a terrible, difficult circumstance.\n\nIt is particularly difficult when the enemy is wearing the same clothes as the civilian population around them. It is very difficult when you've been in combat for day after day.\n\nI'm not whining, been there, done that. I'm suggesting to you that the military command out there, from the battalion commander on down, is deeply concerned about it. I can assure you from the battalion commander on up they are deeply concerned about it, because you cannot allow something like this to take place without stopping it dead in its tracks.\n\nCOLMES: Is part of the problem that we don't — have we not had enough troops in Iraq? Did we not have enough troops to begin with? Are people not being rotated out fast enough?\n\nNORTH: No, Alan, I mean, this is what war is like. I mean, we've kind of gotten used to the 100-hour war from Gulf War I. This is much closer to what real warfare is always like. You know, we've never had — except for Gulf War I — an immediate victory.\n\nCOLMES: We've heard story after story about commanders saying, \"We need more troops?\"\n\nNORTH: No, you haven't. No, you haven't. Let me just tell you.\n\nI can assure you that, if any commander had gone back to the national command authority and said, \"I need more troops.\" If General Sanchez came back to the Pentagon and said, \"I need 50,000 more troops,\" he would have had them in a heartbeat, OK?\n\nNo commander has said — I've been with them, Alan. I have never had a commander out there tell me, \"Gosh, I need another battalion here or I need another regiment there.\" I have never heard it.\n\nHANNITY: All right. We want to come back to this in just a second, and some of the other questions it raises.\n\n(COMMERCIAL BREAK)\n\nCOLMES: And a page tonight from the HANNITY AND COLMES notebook.\n\nIs there a dream match-up for the Democrats in the 2008 primary? Is it Hillary Clinton versus John Edwards? Well, a brand new Gallup poll shows Senator Clinton comfortably ahead of Senator Edwards 55-35, so maybe it isn't much of a dream for the Edwards camp.\n\nAnd on the Republican side, former Mayor Rudy Giuliani leads the pack with 47 percent with Senator John McCain a distant second at 27 percent. The Rudy versus Hillary Senate race may never have materialized but a run for president, that could be exciting. And we now continue with the host of \"WAR STORIES,\" Oliver North.\n\nYou're smiling at all that...\n\nNORTH: No, no, I just — we just had an election.\n\n(CROSSTALK)\n\nCOLMES: I know, but it's always fun to think of what's going to happen. Before I want to talk about your book, didn't Paul Bremer say he asked for more troops? Zinni has talked about more troops. Abizaid has talked about more troops.\n\nNORTH: Well, no. Nobody in a position of military responsibility has come back to the president or to the secretary of defense or to the chairman of the Joint Chiefs and said, \"I need more troops out here.\" And if they had, they would have gotten them.\n\nCOLMES: All right, but you know we have security issues. Powell always said, \"Overwhelming force, exit strategy,\" that's the Powell doctrine. That seemed not to...\n\n(CROSSTALK)\n\nNORTH: Yes, it was great in Gulf War I, but the fact is, this is a different kind of war.\n\nCOLMES: Let me talk about your new book, because you talk about issues having to deal with World War II that have never come to light. We fired first at Pearl Harbor?\n\nNORTH: We did. USS Ward, an hour before the first Japanese bomb drops on Pearl Harbor, the USS Ward engages a midget submarine right outside the submarine net that was across the mouth of Pearl Harbor. Most people don't know. We fired the first shot.\n\nCOLMES: Why has this been so underreported?\n\nNORTH: In part, it's because it wasn't nearly as dramatic as what then transpired. And, of course, everybody has seen that footage of what happens to Pearl Harbor literally an hour later.\n\nCOLMES: Why were we so unprepared?\n\nNORTH: In part because our intelligence was bad and part we did not expect that we were going to be in World War II in part because America was very isolationist. You know, just a little bit more than a month before the start of World War II, FDR finally gets the draft approved by one vote in the Congress of the United States. Astounding.\n\nCOLMES: Japanese had a strategy that almost had them win.\n\nNORTH: Well, what it would have done is, it could have created a situation where they would never have seized Hawaii. They would never have invaded the West coast. They would have gotten their co-prosperity sphere — Greater East Asia Co-Prosperity sphere and prevented the Allies from seizing the initiative enough to get an unconditional surrender out of them.\n\nCOLMES: Battle of Midway?\n\nNORTH: Turning point of the war. Remember, you got — and I don't mean you, Alan, specifically, but the left in this country constantly talks about the quagmire of Iraq.\n\nThink about this. For the first six and a half months of World War II, we lost every single solitary battle we were engaged in. There was not a single victory out there. Nobody called for FDR's head on the platter. Nobody stood up in the well of the Congress in the United States and said, \"Let's have an impeachment.\"\n\nCOLMES: We were attacked.\n\nNORTH: Wait a second.\n\nHANNITY: We were attacked here.\n\nNORTH: 9/11, have you forgotten what happened down here?\n\nCOLMES: We were not talked by Iraq.\n\nNORTH: Let me tell you something. Let me ask you, because I know you know the answers. The guy who tried to kill my wife and kids...\n\nCOLMES: Abu...\n\nNORTH: Abu Nidal was found where? Baghdad.\n\nCOLMES: I understand. But you're mixing and matching. We're not talking about September 11th.\n\nNORTH: We're talking about global terrorism. We're talking about a hotbed of terrorists, the very people who are now being rounded up in Fallujah, OK?\n\nThose are terrorists. And if they weren't killing people over there, they would be killing people here.\n\nCOLMES: We went into Fallujah. They say the insurgents escaped...\n\nNORTH: Some.\n\nCOLMES: ... and live to fight them another day. We're going to have to do a Fallujah all over again someplace else, aren't we?\n\nNORTH: Well, of course. In fact, it's happening right as we speak up in Mosul.\n\n(CROSSTALK)\n\nNORTH: We ought to get a team up there to pursue them.\n\nHANNITY: Colonel, first of all, this was a great book. And what I love about it, too, you also include a free DVD, which is very cool, with some war stories.\n\nNORTH: The turning point of the war and all the great stories from these eyewitnesses. This is not a book about me, Sean. This is a book about guys like your dad and mine who were out there fighting that war.\n\nHANNITY: Well, my dad, like so many in that generation — I mean, you talk about heroism in the Pacific. This is right after Pearl Harbor, he and all his friends signed up and he serves four years in the Pacific.\n\nNORTH: And gone for...\n\nHANNITY: They were gone. They were gone the whole time. And he was a hero there.\n\nAnd so the DVD comes with it, but this is all about, a lot of these stories — this is great.\n\nNORTH: These are the eyewitnesses, and if people want to see a chapter of it, they can get it by going to warstoriesbook.com. If they want it for Christmas, a signed copy for Christmas, by going to olivernorth.com and it does make a great Christmas gift.\n\nHANNITY: I want to go back to this issue of this tape. Because it's very important to me, because I really am concerned that people want to rush to judgment and attack our brave men and women that have been out there serving, as you have been out there with them.\n\nAnd I just want to point out something that has yet to be pointed out. As people, before they rush to judgment — \"The New York Times,\" I'm sure the liberal media will do this — but how many troops have suffered because of booby-trapped bodies that are there? How many guys?\n\nNORTH: Well, I mean, 125 that were killed as of last Friday by IEDs. And I just got an e-mail today from a guy from the unit that I was with — that covered out there when I was out there this summer, and one of those young guys that I was with just got killed yesterday. And by IEDs, by booby traps, whatever you want to call them.\n\nHANNITY: But they have been purposefully...\n\nNORTH: Oh, yes.\n\nHANNITY: ... and targeting, they put these on bodies. And I'm not..\n\nNORTH: No, these are suicide terrorists.\n\nHANNITY: I'm not making any excuses. We don't know. But I'm asking the American people not to rush to judgment, because the liberal media will rush to judgment.\n\nNORTH: Well, and it's particularly important to remember this. Here's the bottom line of that tape. And everybody is going to see it a thousand times between now and the next month.\n\nWhat is going to happen is that there will be an investigation. There has never been and nor there will ever be an investigation of those who beheaded people on videotapes.\n\nHANNITY: Well, that's, I think, pretty...\n\n(CROSSTALK)\n\nNORTH: Second, if a crime was committed, the individuals who committed it will be prosecuted. That will never happen for those who committed those heinous acts and got away with it.\n\nHANNITY: Yes, and I think people need to know. I am concerned, because we are going to get a rush to judgment. The one thing more than anything else that those guys have earned that have been out there putting their lives on the line for us, the kids that you would put on TV every night, I think they have earned the right to have a fair trial. They have earned the right to tell their side of the story, and...\n\nNORTH: And not for this to become the story. The heroism that's been out there is not going to covered.\n\nHANNITY: The heroism is not going to be told, and it's going to be lost by people that want to exploit one circumstance to make a case about the war in general.\n\nNORTH: Oh, and you count on it.\n\nHANNITY: Oh, it's happening. And that's what scary. But those guys earned the right to tell their side. We weren't there. The video only tells part of the story, and I want to hear the whole story before I come to a conclusion.\n\nNow, if...\n\nNORTH: If something was done wrong...\n\nHANNITY: If he did this wrong, there's going to be punishment.\n\nNORTH: There will be.\n\nHANNITY: And there ought to be.\n\nNORTH: In the American military, this kind of thing can't happen.\n\nHANNITY: Can't happen. It cannot happen.\n\nNORTH: Without some kind of justice being done.\n\nCOLMES: All right. Thanks for being with us. Good to see you.\n\nNORTH: Always a pleasure, Alan.\n\nCOLMES: Good luck with the book.\n\nContent and Programming Copyright 2004 Fox News Network, L.L.C. ALL RIGHTS RESERVED. Transcription Copyright 2004 eMediaMillWorks, Inc. (f/k/a Federal Document Clearing House, Inc.), which takes sole responsibility for the accuracy of the transcription. ALL RIGHTS RESERVED. No license is granted to the user of this material except for the user's personal or internal use and, in such case, only one copy may be printed, nor shall user use any material for commercial purposes or in any fashion that may infringe upon Fox News Network, L.L.C.'s and eMediaMillWorks, Inc.'s copyrights or other proprietary rights or interests in the material. This is not a legal transcript for purposes of litigation."}, {"url": "https://www.biography.com/political-figures/oliver-north", "page_content": "(1943-)\n\nWho Is Oliver North?\n\nOliver North was born on October 7, 1943, in San Antonio, Texas. He trained at the United States Naval Academy in Annapolis. During the Vietnam War, he led a marine platoon and was awarded a Silver Star and a Purple Heart. In 1981 President Reagan appointed him deputy-director of the National Security Council. He was later implicated in the Iran-Contra affair and convicted, but by 1990, he was cleared of all charges. In 2018 North was chosen to become the new president of the N.R.A.\n\nOliver North\n\nPresident of the N.R.A.\n\nIn May 2018 North was selected as the new president of the National Rifle Association (N.R.A.), replacing Pete Brownell.\n\n\"Oliver North is, hands down, the absolute best choice to lead our N.R.A. Board, to fully engage with our members, and to unflinchingly stand and fight for the great freedoms he has defended his entire life,\" N.R.A. CEO Wayne LaPierre stated.\n\nCo-president Kris Brown of the Brady Campaign to Prevent Gun Violence vehemently disapproved of North's selection, stating that: \"Oliver North's very name is synonymous with corruption and disgrace.\"\n\nParents & Career in Armed Forces\n\nFormer U.S. Marine Corps Lieutenant Colonel Oliver North was born in San Antonio, Texas on October 7, 1943 to parents Oliver Clay North, an Army major, and Ann Theresa Clancy. He trained at the United States Naval Academy in Annapolis, and during the Vietnam War led a counter-insurgency marines platoon, receiving a Silver Star and Purple Heart. Appointed a deputy-director of the National Security Council by President Ronald Reagan in 1981, he played a key role in a series of controversial military and security actions.\n\nIran-Contra Scandal and Aftermath\n\nImplicated in the Iran-Contra scandal, involving the supply of arms to Iran in exchange for U.S. hostages and the operation of a secret slush fund to aid the Contra guerrillas in Nicaragua, North was forced to resign in 1986. Found guilty on three of 12 charges arising from the affair, he was given a three-year suspended jail sentence, ordered to do community service and fined $150,000. In 1990 the three convictions were overturned, and all charges were dropped in 1991 by a Federal judge. North later headed a political action group, V-PAC, and gave radio broadcasts. In 1991 he published the memoir Under Fire: An American Story. Additional books include American Heroes: In The Fight Against Radical Islam (2008), American Heroes in Special Operations (2010), Heroes Proved (2012), and American Heroes: On the Homefront (2013).\n\nIn 1994 North ran unsuccessfully for a Virginia seat in the Senate on the Republican ticket. He has gone on to serve as an on-air personality for Fox News, helming the program War Stories, which premiered in 2001 and ended in 2016. North has also co-authored several novels, including 2014's thriller Counterfeit Lies, and served as an episode consultant for the FX TV drama The Americans, among other projects.\n\nPersonal Life\n\nNorth married his wife Betsy in 1967, and together, they have four children.\n\nQUICK FACTS\n\nName: Oliver North\n\nBirth Year: 1943\n\nBirth date: October 7, 1943\n\nBirth State: Texas\n\nBirth City: San Antonio\n\nBirth Country: United States\n\nGender: Male\n\nBest Known For: Oliver North, former deputy-director of the National Security Council, was implicated in the Iran-Contra affair and forced to resign. He was convicted of three charges, which were overturned in 1990.\n\nIndustries\n\nVietnam War\n\nAstrological Sign: Libra\n\nSchools\n\nUnited States Naval Academy\n\nFact Check\n\nWe strive for accuracy and fairness.If you see something that doesn't look right,contact us!\n\nCITATION INFORMATION"}, {"url": "https://tubitv.com/series/300005166/war-stories-with-oliver-north", "page_content": "We're Sorry.\n\nTubi is the largest free movie and TV streaming service in the US. Unfortunately, we're not currently available in your area.\n\nWatch this webpage to see when Tubi is available in your area."}, {"url": "https://simple.wikipedia.org/wiki/Oliver_North", "page_content": "Oliver Laurence North (born October 7, 1943) or Ollie North is a retired United States Marine Corps Lieutenant Colonel, political commentator, television host, military historian, and New York Times best-selling author. He is currently the host of War Stories with Oliver North on Fox News Channel.\n\nIn 2018, North became the President of the National Rifle Association of America (NRA).\n\nNorth was at the center of national attention during the Iran–Contra affair, a political scandal in the late 1980s during the presidency of Ronald Reagan. Some people say North took the blame and punishment rather than Reagan.\n\nNorth was born on October 7, 1943 in San Antonio, Texas.[1] North grew up in Philmont, New York. He studied at State University of New York at Brockport. He has been married to Betsy Stuart since 1987.\n\nOther websites [ change | change source ]\n\nMedia related to Oliver North at Wikimedia Commons"}], "Wayne Allyn Root is a regular guest on various news programs on Fox Business, CNBC, and other networks.": [{"url": "https://www.podchaser.com/podcasts/the-wayne-allyn-root-show-1456927", "page_content": "Wayne Allyn Root​, conservative media dynamo, best selling author, and a relentless patriot is bringing his popular talk program to USA Radio Networks and now your station. Wayne has become a political and media phenomenon in the United States. He is a former Libertarian Presidential candidate who won the 2008 Vice-Presidential nomination, guest commentator on Fox News and other network programs, syndicated columnist, best-selling author, international business speaker and more. Wayne Allyn Root is set to become the next great national radio talk show host.\n\n\n\n\"You’re in the right place...Opportunity is knocking, and Wayne Root will show you how to seize it. He knows how to be tenacious and relentless—and how to win!\" - Donald J. Trump, President of the United States​."}, {"url": "https://www.newsmax.com/finance/Insiders/WayneAllynRoot/bio-101/", "page_content": "Wayne Allyn Root - Biography\n\nWayne Allyn Root was the 2008 Libertarian Party vice presidential nominee.\n\n\n\nA college classmate of Barack Obama at Columbia University (class of 1983), he is now the face and voice of Libertarian-conservative politics in the mainstream national media. The media calls him “the anti-Obama.” Root calls himself a Reagan libertarian — modeled after his heroes Ronald Reagan, Barry Goldwater, and Thomas Jefferson.\n\n\n\nHe is regular guest on TV networks including the Fox News Channel, Fox Business Network, CNBC, and radio shows hosted by Glenn Beck, Michael Savage, Jerry Doyle, and Mancow Muller. He recently added his own radio talk show, \"W.A.R: The Wayne Allyn Root Show.\"\n\n\n\nRoot's political and business careers have been profiled on CNBC and CNN/Money, as well as in The New York Times, The Wall Street Journal, Time magazine, Newsweek, Fortune, Equities, The Financial Times, Millionaire, Success, Entrepreneur, Worth, The Robb Report, and even Emmy magazine (among many others).\n\n\n\nHis new book is entitled \"The Power of Relentless.\"\n\n\n\nThis high-profile small businessman, home-school father, citizen politician, and capitalist evangelist is now the recognized leader of a new American citizen revolution for smaller government; lower taxes; dramatically reduced government spending and entitlements; school choice; more economic and personal freedom; and more power for the people — just as the Founding Fathers intended.\n\n\n\nHis website is: www.rootforAmerica.com."}, {"url": "https://www.creators.com/author/wayne-allyn-root", "page_content": "Wayne Allyn Root (aka WAR) is a high-energy, passionate, outspoken, unapologetic conservative media star. He has been branded him a “conservative warrior” and “capitalist evangelist.” Root is a former presidential candidate and the 2008 Libertarian vice presidential nominee. He is a now a national TV and radio host and a nationally syndicated newspaper columnist.\n\nRoot’s national TV show, \"The Wayne Allyn Root Show,\" airs nightly on Newsmax TV at 8 p.m. ET, or 5 p.m. PT. Bill O'Reilly, America’s \"King of Cable TV News,” is a guest three times per week.\n\nRoot hosts the nationally syndicated \"WAR Now: The Wayne Allyn Root Show\" on USA Radio Network daily from 6 to 9 p.m. ET, or 3 to 6 p.m. PT.\n\nRoot was opening speaker at many Trump presidential campaign events, including Trump’s rally at the Las Vegas Convention in September 2018.\n\nRoot appears regularly in the national media, including on Fox News. He has defended Trump on television in over 30 countries across the globe -- including Israel. Root presented the Tea Party’s national TV response to President Barack Obama’s 2016 State of the Union; Root is the only person ever chosen for the task who was not a U.S. senator, congressperson or former presidential candidate.\n\nAnd Root is the author of 11 books, including national best-sellers “The Ultimate Obama Survival Guide,” “Millionaire Republican,” “The Conscience of a Libertarian,” “The Murder of the Middle Class” and the No. 1 business best-seller “The Power of RELENTLESS,\" endorsed by President Donald Trump.\n\nWayne Allyn Root resides in the suburbs of Las Vegas, Nevada."}, {"url": "https://rootforamerica.com/", "page_content": "WAR Story\n\nThe Bio of Wayne Allyn Root\n\nWayne Allyn Root has been branded by media across the globe as “the Capitalist Evangelist.” A former Libertarian Vice Presidential nominee, Wayne is a fierce, enthusiastic and relentless defender of Reagan conservatism, Libertarianism, economic freedom and capitalism.\n\n“Wayne Allyn Root is one of the great conservative thinkers in America” – Bill Cunningham, host “The Bill Cunningham Show” Premiere Radio Network\n\nHe is both a political and business personality in the national media. He is known for his fiery personality and unmatched levels of energy. On the political side, Wayne is a lifelong Republican-conservative firebrand, Fox News regular, and political commentator on hundreds of conservative talk radio stations.\n\nRead More"}, {"url": "https://www.gambling911.com/politics/wayne-allyn-root-appear-various-news-outlets-062309.html", "page_content": "Las Vegas, NV-Tuesday June 23, 2009--Libertarian 2008 Vice Presidential candidate Wayne Allyn Root appeared on \"Cavuto\" with host Neil Cavuto on FOX Business Network on Monday afternoon. That was the first of 4 FOX appearances this week for Root. He will be in New York on Wednesday live in-studio with Judge Andrew Napolitano on Freedom Watch at 2 PM EST; then live in-studio on The Glenn Beck Program at 5 PM EST on Wednesday. Then Thursday Root will appear live in studio with Neil Cavuto on \"Your World.\"\n\nSaturday Root will also host his Saturday radio show, \"W.A.R: The Wayne Allyn Root Show\" from Salem Radio's Manhattan studios. His guests this week will include nationally-known political strategist and author of 6 New York Times Best-sellers Dick Morris and one of America's greatest direct marketing gurus and author of 6 books, Joe Sugarman, the man who literally invented the idea of taking credit card orders on toll free numbers.\n\nRoot's show is broadcast in New York (on 970 The Apple), Los Angeles (on KABC) and Chicago (on WIND). It is also streamed at: ROOTforAmerica.com\n\nIn the past 3 weeks Wayne's radio guests have included former Republican Presidential candidate and U.S. Congressman Ron Paul; FOX News host and judicial expert Judge Andrew Napolitano; former Congressman and MSNBC host Joe Scarborough; 3-time NY Times #1\n\nBest-selling author Robert Ringer; economist and FOX News regular Peter Schiff; economist and founder of FreedomFest and author of 25 books Mark Skousen; economist Kip Herraige, the Founder/CEO of Wealth Masters International; and rare coin and gold expert Steve Contursi, Founder/CEO of Rare Coin Wholesalers.\n\nOnce he returns from New York, Root heads to Dallas to address the largest Tea Party events in the country on July 4th in Austin and Dallas. Root will be the only speaker to address both events, as well as a Libertarian Party gathering in Dallas on July 3rd. The July 4th Dallas event, called \"America's Tea Party\" is expecting 50,000 attendees at Southfork (J.R.'s Ranch from the TV series \"Dallas\")- the largest gathering of its kind ever. Root will be speaking along with Michelle Malkin and hero jet pilot Scott O'Grady."}, {"url": "https://heartland.org/about-us/who-we-are/wayne-allyn-root/", "page_content": "A former Libertarian Vice Presidential nominee, Wayne is a fierce, enthusiastic and relentless defender of Reagan conservatism, Libertarianism, economic freedom and capitalism.\n\nHe is both a political and business personality in the national media. He is known for his fiery personality and unmatched levels of energy. On the political side, Wayne is a lifelong Republican-conservative firebrand, Fox News regular, and political commentator on hundreds of conservative talk radio stations.\n\nWayne is the author of three national best-selling conservative books- including the #1 bestseller in bookstores “The Ultimate Obama Survival Guide.” His other hit political books include, “The Murder of the Middle Class,” “Millionaire Republican,” and “The Conscience of a Libertarian.”\n\nHe is also one of the most popular syndicated columnists in the conservative world- with millions of readers at sites like FoxNews, TheBlaze, TownHall, Breitbart, PersonalLiberty and DailyCaller. His columns often appear at The Washington Times.\n\nWayne was not only on the Libertarian Presidential ticket in 2008, but the elected Chairman of the Libertarian National Campaign Committee and a twice- elected member of the Libertarian National Committee. Today he serves as Chairman of the National Campaign Committee for the Republican Liberty Caucus.\n\nOn the business side, Wayne is one of a kind. Most businessmen go by the standard titles “Chairman, CEO or President.” Wayne prefers “CRPE”- standing for Chief Rainmaker and Pitchman Extraordinaire…”CE” standing for Capitalist Evangelist…and “HEB” standing for Human Energizer Bunny.\n\nHis new business and personal development book is entitled, “The Power of RELENTLESS.” You can feel Wayne’s energy and intensity in every page.\n\nWayne is a high-profile CEO, serial entrepreneur, international business speaker, spokesman for many national and international companies, TV personality, media dynamo, and former anchorman and host for Financial News Network (now known as CNBC). He is also a Policy Advisor for The Heartland Institute.\n\n“Mr. RELENTLESS” has achieved success in business, politics, entertainment, sports, gaming, publishing and television production. Wayne has created, produced and sold three TV series in Hollywood.\n\nWayne is a graduate of Columbia University, Class of ’83- along with his classmate President Barack Obama. Wayne resides in the suburbs of Las Vegas, Nevada — a place with zero state income tax, zero business income tax, zero capital gains tax, zero inheritance tax and the 9th lowest property taxes in America. He is a policy advisor to The Heartland Institute.\n\nWayne Allyn Root Contributions\n\nPRESS RELEASE: Heartland Institute Experts React to President Trump’s State of the Union Address Government & Politics\n\nEnvironment & Energy\n\nGovernment & Liberty\n\nEmployment\n\nEducation\n\nEntitlements\n\nHealth Care\n\nEconomy\n\nGovernment Spending"}, {"url": "https://www.podbean.com/podcast-detail/z5kvq-216f7d/The-Wayne-Allyn-Root-Show-Podcast", "page_content": "GFBS Grand Forks Best Source At Grand Forks Best Source Studio we are here to p... 323\n\nMatters of Policy & Politics Matters of Policy & Politics is a Hoover Instituti... 1174\n\nThe Post Podcast North Platte Post Podcast powered North Platte Kub... 109\n\nThe Ben Shapiro Show Tired of the lies? Tired of the spin? Are you read... 241044"}, {"url": "https://usaradio.com/shows/the-wayne-allyn-root-show/", "page_content": "Show Description\n\n15\n\nPolitics\n\nRoot is a political and media phenomenon. He is a former Libertarian Presidential candidate who won the 2008 Vice Presidential nomination. He has been branded as “Mr. Relentless,” “The Capitalist Evangelist” and “The Poor Man’s Donald Trump.”\n\nMore Information\n\nThis real-life Renaissance Man has achieved remarkable levels of success in the fields of business, politics, media, television, sports and publishing. He is a CEO, serial entrepreneur, national media personality, bestselling author, international business speaker, television producer, syndicated columnist and popular radio talk show host."}, {"url": "https://www.spreaker.com/show/the-wayne-allyn-root-show", "page_content": "...\n\nRoot is set to become the next great national radio talk show host.\n\n\n\n\"You’re in the right place...Opportunity is knocking, and Wayne Root will show you how to seize it. He knows how to be tenacious and relentless—and how to win!\" - Donald J. Trump, President of the United States​.\n\nWayne Allyn Root​, conservative media dynamo, best selling author, and a relentless patriot is bringing his popular talk program to USA Radio Networks and now your station. Wayne has become a political and media phenomenon in the United States. He is a former Libertarian Presidential candidate who won the 2008 Vice-Presidential nomination, guest commentator on Fox News and other network programs, syndicated columnist, best-selling author, international business speaker and more. Wayne Allyn"}, {"url": "https://podcastaddict.com/podcast/the-wayne-allyn-root-show/3115906", "page_content": "By USA Audio\n\nJun 07 2023 84\n\nWayne Allyn Root​, conservative media dynamo, best selling author, and a relentless patriot is bringing his popular talk program to USA Radio Networks and now your station. Wayne has become a political and media phenomenon in the United States. He is a former Libertarian Presidential candidate who won the 2008 Vice-Presidential nomination, guest commentator on Fox News and other network programs, syndicated columnist, best-selling author, international business speaker and more. Wayne Allyn Root is set to become the next great national radio talk show host.\n\n\n\n\"You’re in the right place...Opportunity is knocking, and Wayne Root will show you how to seize it. He knows how to be tenacious and relentless—and how to win!\" - Donald J. Trump, President of the United States​."}]}