{"Wayne Allyn Root is the host of The Wayne Allyn Root Show.": [{"url": "https://rootforamerica.com/about/", "page_content": "Wayne Allyn Root (aka WAR) is not your typical CEO. He prefers the titles SOB, HEB and MR- for “Son of a Butcher” “Human Energizer Bunny” and “Mr. Relentless.” The media calls him “the conservative warrior” and “the capitalist evangelist.”\n\n2022 was quite the year of a lifetime for Wayne! He was Knighted “Sir Wayne Allyn Root.” Wayne was inducted into the Nevada Broadcasters Hall of Fame. And he fulfilled a lifetime goal of being included in “SWANK: the 14th Annual International Best Dressed List.”\n\nEven more impressive, Wayne became the host of two new television shows in late 2022. “America’s Top Ten Countdown with Wayne Allyn Root” on Real America’s Voice TV Network on Saturdays at Noon ET…and “Wayne Allyn Root: Raw & Unfiltered” streamed daily on Lindell TV (at FrankSpeech.com). It airs Monday-Friday at 7 PM ET on Lindell TV 2.\n\nThis former 2008 Libertarian Vice Presidential nominee is also the host of the nationally syndicated “Wayne Allyn Root: Raw & Unscripted” on USA Radio Network daily from 6 PM to 9 PM ET.\n\nWayne is the bestselling author of 15 books- including “The Great Patriot Protest & Boycott Book,” “TRUMP RULES,” “The Power of Relentless,” “The Ultimate Obama Survival Guide” and “The Murder of the Middle Class.”\n\nWayne is a high-energy, dynamic, outspoken, fiery, combative, controversial, unapologetic, in-your-face, New York businessman, Las Vegas gaming CEO, reality TV show producer, and former Presidential candidate, turned conservative media superstar."}, {"url": "https://usaradio.com/shows/the-wayne-allyn-root-show/", "page_content": "Show Description\n\n15\n\nPolitics\n\nRoot is a political and media phenomenon. He is a former Libertarian Presidential candidate who won the 2008 Vice Presidential nomination. He has been branded as “Mr. Relentless,” “The Capitalist Evangelist” and “The Poor Man’s Donald Trump.”\n\nMore Information\n\nThis real-life Renaissance Man has achieved remarkable levels of success in the fields of business, politics, media, television, sports and publishing. He is a CEO, serial entrepreneur, national media personality, bestselling author, international business speaker, television producer, syndicated columnist and popular radio talk show host."}, {"url": "https://www.creators.com/author/wayne-allyn-root", "page_content": "Wayne Allyn Root (aka WAR) is a high-energy, passionate, outspoken, unapologetic conservative media star. He has been branded him a “conservative warrior” and “capitalist evangelist.” Root is a former presidential candidate and the 2008 Libertarian vice presidential nominee. He is a now a national TV and radio host and a nationally syndicated newspaper columnist.\n\nRoot’s national TV show, \"The Wayne Allyn Root Show,\" airs nightly on Newsmax TV at 8 p.m. ET, or 5 p.m. PT. Bill O'Reilly, America’s \"King of Cable TV News,” is a guest three times per week.\n\nRoot hosts the nationally syndicated \"WAR Now: The Wayne Allyn Root Show\" on USA Radio Network daily from 6 to 9 p.m. ET, or 3 to 6 p.m. PT.\n\nRoot was opening speaker at many Trump presidential campaign events, including Trump’s rally at the Las Vegas Convention in September 2018.\n\nRoot appears regularly in the national media, including on Fox News. He has defended Trump on television in over 30 countries across the globe -- including Israel. Root presented the Tea Party’s national TV response to President Barack Obama’s 2016 State of the Union; Root is the only person ever chosen for the task who was not a U.S. senator, congressperson or former presidential candidate.\n\nAnd Root is the author of 11 books, including national best-sellers “The Ultimate Obama Survival Guide,” “Millionaire Republican,” “The Conscience of a Libertarian,” “The Murder of the Middle Class” and the No. 1 business best-seller “The Power of RELENTLESS,\" endorsed by President Donald Trump.\n\nWayne Allyn Root resides in the suburbs of Las Vegas, Nevada."}, {"url": "https://factsbuddy.com/wayne-allyn-root/", "page_content": "Wayne Allyn Root Bio | Wiki\n\nWayne Allyn Root is a popular American conservative radio host, author, activist, far-right political commentator, and conspiracy theorist. As of now, Wayne works as the host of The Wayne Allyn Root Show at KBET and the USA Radio Network and previously on Newsmax TV. Prior to that, Wayne worked as an opinion columnist for the Las Vegas Review-Journal.\n\nHe also served as the Vice Presidential nominee for the Libertarian Party in the 2008 presidential election. Wayne left the Libertarian Party, in 2012, rejoined the Republican Party, as well as endorsed and voted for Mitt Romney and Donald Trump in both 2016 and 2020. Afterward, Wayne expressed regret for his support of Romney but has remained a staunch supporter and close friend as well as confidant of Trump. In addition, Wayne is the CEO of the publicly-traded company VegasWinners.com, (WNRS symbol) who lately teamed up with the MGM Hotel’s BetMGM.\n\nWayne Allyn Root Age\n\nWayne was born on July 20, 1961, in Mount Vernon, New York, in the United States. He is 61 years old. Wayne celebrates his birthday on July 20, every year.\n\nWayne Allyn Root Height\n\nHe is a man of average stature. Wayne stands at a height of 5 ft 7 in ( Approx1.7 m).\n\nWayne Allyn Root Family\n\nHe was born in Mount Vernon, New York, in the United States to his caring and loving parents. Wayne is the proud son of a Jewish butcher father David Root and Stella Root. He explained to The Jewish Telegraphic Agency that all four grandparents are Jewish and that his DNA shows him “99.5” percent European Jewish. He was brought up with his sister named Lori Brown.\n\nWayne Allyn Root Wife\n\nWayne is now happily married to his lovely wife Cindy Parker. The pair married in 2017. Previously, Wayne was married to Debra Parks from 1991 to 2017 whom together they share four children. Wayne and his second wife Debra Root have four children namely: Contessa Churchill Antoinette Root, Dakota Root, Remington Reagan Root, and Hudson Root. Prior to Marrying Debra parks, Wayne was married to his first wife Victoria Creg-Payne. In 1990, Wayne and Victoria divorced.\n\nWayne Allyn Root Children\n\nWayne and his second wife Debra Root have four children namely: Contessa Churchill Antoinette Root, Dakota Root, Remington Reagan Root, and Hudson Root.\n\nAllyn Root Education\n\nAfter completing his primary and high school education, Wayne attended the Thornton-Donovan School in New Rochelle, New York. Later on, in 1979, Wayne attended Columbia University, studying pre-law and political science, and was a member of the class of 1983. He used to be a classmate of President Barack Obama.\n\nWayne Allyn Root Show | Newsmax\n\nHe served at WNBC radio (now WFAN) in the early 1980s. Wayne served with the Financial News Network from 1989 to 1991, prior to its subsumption into CNBC. He was founder and chairman of Winning Edge International Inc. During the 2000s, Wayne hosted Wayne Allyn Root’s Winning Edge, a television show which brought Root’s sports handicapping operation.\n\nHe is currently the Nationally-Syndicated Radio Host of “WAR Now: The Wayne Root Show” at USA Radio Networks. Wayne co-hosted King of Vegas on Spike TV. In addition, Wayne produced Ghost Adventures on the Travel Channel.\n\nHe was a board member of Wealth Masters International (“WMI”), a now-defunct global financial services and education company in Houston, Texas. In 2010 Norwegian authorities suspended WMI’s sales, finding it to be an illegal pyramid scheme. Wayne became named in the finding.\n\nHis opinions reach tens of millions of Americans as a regular columnist as well as a commentator for several most popular conservative political websites such as FoxNews.com and TheBlaze.com.\n\nWayne Allyn Root Books\n\n– Trump Rules (2018)\n\n– The Great Patriot Protest & Boycott Book (2021)\n\n– Angry White Male: How the Donald Trump Phenomenon is Changing America—and What We Can All Do to Save the Middle Class (2016)\n\n– The Murder of the Middle Class: How to Save Yourself and Your Family from the Criminal Conspiracy of the Century (2014)\n\n– The Ultimate Obama Survival Guide: How to Survive, Thrive, and Prosper During Obamageddon (2013)\n\n– Millionaire Republican (2005)\n\n– The Power of Relentless: 7 Secrets to Achieving Mega-Success, Financial Freedom, and the Life of Your Dreams (2015)\n\nWayne Allyn Root Salary\n\nWayne earns a satisfying amount from his work as a National TV Host of “WAR Now on Newsmax Tv since 2017. Wayne’s average salary is $78,681 per year.\n\nWayne Allyn Root Net Worth\n\nWayne gets his wealth from his work as a National TV Host of “WAR Now on Newsmax Tv since 2017. Therefore, Wayne has accumulated a decent fortune over the years he has worked. Wayne’s estimated net worth is $799,291\n\nHow Old Is Wayne Allyn Root\n\nWayne is a 61-year-old who was born on July 20, 1961, in Mount Vernon, New York, in the United States.\n\nWhere Is Wayne Allyn Root\n\nHe works as the host of The Wayne Allyn Root Show at KBET and the USA Radio Network and previously on Newsmax TV. Prior to that, Wayne worked as an opinion columnist for the Las Vegas Review-Journal."}, {"url": "https://www.jpost.com/American-Politics/Who-is-Wayne-Allyn-Root-who-called-Trump-King-of-Israel-599398", "page_content": "WASHINGTON — On Wednesday morning, President Donald Trump quoted a conservative talk show host named Wayne Allyn Root to defend comments he had made the day before that angered many in the Jewish community: that Jews who vote for Democrats show “a total lack of knowledge or great disloyalty.”\n\n“Thank you to Wayne Allyn Root for the very nice words,” Trump said before quoting something Root has said previously about the president.\n\n“President Trump is the greatest President for Jews and for Israel in the history of the world, not just America, he is the best President for Israel in the history of the world … and the Jewish people in Israel love him … like he’s the King of Israel. They love him like he is the second coming of God,” the quote said.\n\n“Thank you to Wayne Allyn Root for the very nice words. “President Trump is the greatest President for Jews and for Israel in the history of the world, not just America, he is the best President for Israel in the history of the world...and the Jewish people in Israel love him.... — Donald J. Trump (@realDonaldTrump) August 21, 2019\n\n....like he’s the King of Israel. They love him like he is the second coming of God...But American Jews don’t know him or like him. They don’t even know what they’re doing or saying anymore. It makes no sense! But that’s OK, if he keeps doing what he’s doing, he’s good for..... — Donald J. Trump (@realDonaldTrump) August 21, 2019\n\n.....all Jews, Blacks, Gays, everyone. And importantly, he’s good for everyone in America who wants a job.” Wow! @newsmax @foxandfriends @OANN — Donald J. Trump (@realDonaldTrump) August 21, 2019\n\nIt’s not the only Jewish thing Root has said about Trump. Just two weeks after Trump was elected, Root sought to reassure Jewish Americans, who had voted overwhelmingly for his rival, Democratic nominee Hillary Clinton, about the president-elect’s bona fides.\n\n“I believe Donald Trump should be called ‘America’s first Jewish president,'” he wrote on the Fox News website. “I should know. I’m an Ivy League-educated Jewish kid from New York.”\n\nMaybe, in the sense that Saul was a Jewish kid from Tarsus — Root is an evangelical Christian, something he did not mention in his Fox column.\n\nRoot, speaking Tuesday evening on his talk show on Newsmax, also a conservative news site, was a little more candid about where he was faith-wise.\n\n“I happen to be Jewish by birth,” he said.\n\nWho exactly is Wayne Allyn Root and why are he and Trump so fond of each other? Here are some answers.\n\nHe says he’s Jewish and has interesting ideas about Jewish identity.\n\nIn the Fox column, the 58-year-old Root refers to his “Jewish butcher father, David Root.” He told The Jewish Telegraphic Agency that all four grandparents are Jewish and that his DNA shows him “99.5” percent European Jewish.\n\nRoot, who lives in Las Vegas, says he founded the Republican Jewish Coalition chapter in Nevada. Matt Brooks, the RJC’s executive director, confirmed that Root was involved in the group but says he has not been for more than a decade. (Sheldon Adelson, the casino magnate who is a major funder of the RJC and Republican candidates along with Jewish causes, hired Root to write a column for the Las Vegas Review-Journal after buying the newspaper in 2015 — a move that among fans of the paper’s hard news tradition.)\n\nRoot told JTA he “took Jesus Christ as a savior” about 30 years ago, but he still considers himself Jewish.\n\nNotably, several other Trump defenders are Jews turned Christian, including Trump’s lawyer, Jay Sekulow, and the right-wing activist and lawyer Larry Klayman.\n\nThe lessons Root takes away from being born Jewish comport with hoary Jewish stereotypes — some flattering, others less so.\n\n“I am a Jew and you can’t take away from a person being a Jew,” he said, noting that Islamist extremists and white supremacists would target him as Jewish. “I’ve got Jewish blood and passion and zeal.”\n\n“Jesus Christ was a Jew, and the CEO of the Christian religion,” Root said, adding that he, too, was born Jewish and was a CEO.\n\nRoot, who calls himself a “capitalist evangelist” told Daniel Davis, a syndicated radio host, that his Jewish background informed his philosophy. Jews were “relentless,” he said.\n\n“They like to hammer down the door till they get what they want,” he said.\n\nIn the Fox column, Root said Trump “is your typical Jewish parent.”\n\n“Donald’s children are all Ivy League graduates — just like my daughter who recently graduated magna cum laude from Harvard,” he said, adding that “Donald is handing his business over to his children. That is the goal of every Jewish businessman in history.”\n\nElsewhere in the column: “Donald is a big success in Hollywood as a TV producer. He joins an exclusive club that is predominantly Jewish.”\n\nAdd forthrightness to the list of traits Root finds Jewish.\n\n“He says whatever is on his mind, even if it offends,” he wrote in the column. “All of those are traits I’ve seen in my Jewish friends, relatives and business partners for my entire life.”\n\nHe can be emphatically evangelical.\n\nA few months before the 2016 election, writing on another conservative website, Townhall, Root used a more Christian pitch in addressing coreligionists who were put off by Trump’s brashness and viciousness.\n\n“Let me repeat my message to Christians: ‘YOU’RE MISSING THE BOAT,'” Root said. “God is about miracles. We don’t need a ‘nice guy’ or a ‘gentleman’ right now. It’s the fourth quarter and we’re losing 14-0. We need a miracle. I believe Trump is our miracle.”\n\nHe’s been on the Trump train longer than most.\n\nRoot, the Libertarian Party’s vice presidential nominee in 2008, announced his support for the businessman and reality star almost as soon as Trump announced he was running in June 2015. He emceed one of the candidate’s first rallies, in Las Vegas. Trump, unsurprisingly, praised Root’s book “Angry White Male: How the Donald Trump Phenomenon is Changing America” published that year.\n\nRoot, who ran a sports gambling business, told JTA that the Republican Party has not done enough to shake Jewish voters out of their adherence to Democrats.\n\n“I’m one of the best salesmen in America, and I believe I can sell conservatism to Jews,” he said.\n\nRoot went on to say that he would soon announce that he will head a “major Jewish organization” and planned to set up a Jews for Trump political action committee.\n\nHe’s called a conspiracy theorist — he says he asks questions.\n\nLiberal outlets have long singled out Root for peddling conspiracy theories, including that the 2017 shooting massacre in Las Vegas that killed 58 concertgoers was the work of Islamist extremists. No motive has been ascribed for the attack, which was carried out by a white non-Muslim man named Stephen Paddock.\n\nRoot has also questioned whether white supremacists were behind the deadly violence at a neo-Nazi march in Charlottesville, Virginia, in 2017, and whether there is more to the 2016 murder of Seth Rich, a Jewish Democratic Party staffer. (Police believe Rich was killed in a robbery gone bad; conspiracy theorists believe Hillary Clinton was behind the killing.)\n\nRoot told JTA that conspiracy theories proliferate on the right and the left, and that he does not necessarily endorse the theories — he asks questions. That, he said, was a very American thing to do, and that pluralities of Americans do not buy into the accepted narratives behind the assassination of President John F. Kennedy in 1963 or the suicide of disgraced financier Jeffrey Epstein this month.\n\n“I question everything coming out of the mouths of government officials,” he said. “They’re egomaniacs who lie about everything to protect themselves.”"}, {"url": "https://rootforamerica.com/", "page_content": "WAR Story\n\nThe Bio of Wayne Allyn Root\n\nWayne Allyn Root has been branded by media across the globe as “the Capitalist Evangelist.” A former Libertarian Vice Presidential nominee, Wayne is a fierce, enthusiastic and relentless defender of Reagan conservatism, Libertarianism, economic freedom and capitalism.\n\n“Wayne Allyn Root is one of the great conservative thinkers in America” – Bill Cunningham, host “The Bill Cunningham Show” Premiere Radio Network\n\nHe is both a political and business personality in the national media. He is known for his fiery personality and unmatched levels of energy. On the political side, Wayne is a lifelong Republican-conservative firebrand, Fox News regular, and political commentator on hundreds of conservative talk radio stations.\n\nRead More"}, {"url": "https://www.jta.org/2019/08/21/politics/who-is-wayne-allen-root-the-evangelical-christian-trump-quoted-to-validate-his-comments-on-jews", "page_content": "WASHINGTON (JTA) — On Wednesday morning, President Donald Trump quoted a conservative talk show host named Wayne Allyn Root to defend comments he had made the day before that angered many in the Jewish community: that Jews who vote for Democrats show “a total lack of knowledge or great disloyalty.”\n\n“Thank you to Wayne Allyn Root for the very nice words,” Trump said before quoting something Root has said previously about the president.\n\n“President Trump is the greatest President for Jews and for Israel in the history of the world, not just America, he is the best President for Israel in the history of the world … and the Jewish people in Israel love him … like he’s the King of Israel. They love him like he is the second coming of God,” the quote said.\n\n“Thank you to Wayne Allyn Root for the very nice words. “President Trump is the greatest President for Jews and for Israel in the history of the world, not just America, he is the best President for Israel in the history of the world…and the Jewish people in Israel love him…. — Donald J. Trump (@realDonaldTrump) August 21, 2019\n\n….like he’s the King of Israel. They love him like he is the second coming of God…But American Jews don’t know him or like him. They don’t even know what they’re doing or saying anymore. It makes no sense! But that’s OK, if he keeps doing what he’s doing, he’s good for….. — Donald J. Trump (@realDonaldTrump) August 21, 2019\n\nIt’s not the only Jewish thing Root has said about Trump. Just two weeks after Trump was elected, Root sought to reassure Jewish Americans, who had voted overwhelmingly for his rival, Democratic nominee Hillary Clinton, about the president-elect’s bona fides.\n\n“I believe Donald Trump should be called ‘America’s first Jewish president,'” he wrote on the Fox News website. “I should know. I’m an Ivy League-educated Jewish kid from New York.”\n\nMaybe, in the sense that Saul was a Jewish kid from Tarsus — Root is an evangelical Christian, something he did not mention in his Fox column.\n\nRoot, speaking Tuesday evening on his talk show on Newsmax, also a conservative news site, was a little more candid about where he was faith-wise.\n\n“I happen to be Jewish by birth,” he said.\n\nWho exactly is Wayne Allyn Root and why are he and Trump so fond of each other? Here are some answers.\n\nHe says he’s Jewish and has interesting ideas about Jewish identity.\n\nIn the Fox column, the 58-year-old Root refers to his “Jewish butcher father, David Root.” He told The Jewish Telegraphic Agency that all four grandparents are Jewish and that his DNA shows him “99.5” percent European Jewish.\n\nRoot, who lives in Las Vegas, says he founded the Republican Jewish Coalition chapter in Nevada. Matt Brooks, the RJC’s executive director, confirmed that Root was involved in the group but says he has not been for more than a decade. (Sheldon Adelson, the casino magnate who is a major funder of the RJC and Republican candidates along with Jewish causes, hired Root to write a column for the Las Vegas Review-Journal after buying the newspaper in 2015 — a move that raised eyebrows among fans of the paper’s hard news tradition.)\n\nRoot told JTA he “took Jesus Christ as a savior” about 30 years ago, but he still considers himself Jewish.\n\nNotably, several other Trump defenders are Jews turned Christian, including Trump’s lawyer, Jay Sekulow, and the right-wing activist and lawyer Larry Klayman.\n\nThe lessons Root takes away from being born Jewish comport with hoary Jewish stereotypes — some flattering, others less so.\n\n“I am a Jew and you can’t take away from a person being a Jew,” he said, noting that Islamist extremists and white supremacists would target him as Jewish. “I’ve got Jewish blood and passion and zeal.”\n\n“Jesus Christ was a Jew, and the CEO of the Christian religion,” Root said, adding that he, too, was born Jewish and was a CEO.\n\nRoot, who calls himself a “capitalist evangelist” told Daniel Davis, a syndicated radio host, that his Jewish background informed his philosophy. Jews were “relentless,” he said.\n\n“They like to hammer down the door till they get what they want,” he said.\n\nIn the Fox column, Root said Trump “is your typical Jewish parent.”\n\n“Donald’s children are all Ivy League graduates — just like my daughter who recently graduated magna cum laude from Harvard,” he said, adding that “Donald is handing his business over to his children. That is the goal of every Jewish businessman in history.”\n\nElsewhere in the column: “Donald is a big success in Hollywood as a TV producer. He joins an exclusive club that is predominantly Jewish.”\n\nAdd forthrightness to the list of traits Root finds Jewish.\n\n“He says whatever is on his mind, even if it offends,” he wrote in the column. “All of those are traits I’ve seen in my Jewish friends, relatives and business partners for my entire life.”\n\nHe can be emphatically evangelical.\n\nA few months before the 2016 election, writing on another conservative website, Townhall, Root used a more Christian pitch in addressing coreligionists who were put off by Trump’s brashness and viciousness.\n\n“Let me repeat my message to Christians: ‘YOU’RE MISSING THE BOAT,'” Root said. “God is about miracles. We don’t need a ‘nice guy’ or a ‘gentleman’ right now. It’s the fourth quarter and we’re losing 14-0. We need a miracle. I believe Trump is our miracle.”\n\nHe’s been on the Trump train longer than most.\n\nRoot, the Libertarian Party’s vice presidential nominee in 2008, announced his support for the businessman and reality star almost as soon as Trump announced he was running in June 2015. He emceed one of the candidate’s first rallies, in Las Vegas. Trump, unsurprisingly, praised Root’s book “Angry White Male: How the Donald Trump Phenomenon is Changing America” published that year.\n\nRoot, who ran a sports gambling business, told JTA that the Republican Party has not done enough to shake Jewish voters out of their adherence to Democrats.\n\n“I’m one of the best salesmen in America, and I believe I can sell conservatism to Jews,” he said.\n\nRoot went on to say that he would soon announce that he will head a “major Jewish organization” and planned to set up a Jews for Trump political action committee.\n\nHe’s called a conspiracy theorist — he says he asks questions.\n\nLiberal outlets have long singled out Root for peddling conspiracy theories, including that the 2017 shooting massacre in Las Vegas that killed 58 concertgoers was the work of Islamist extremists. No motive has been ascribed for the attack, which was carried out by a white non-Muslim man named Stephen Paddock.\n\nRoot has also questioned whether white supremacists were behind the deadly violence at a neo-Nazi march in Charlottesville, Virginia, in 2017, and whether there is more to the 2016 murder of Seth Rich, a Jewish Democratic Party staffer. (Police believe Rich was killed in a robbery gone bad; conspiracy theorists believe Hillary Clinton was behind the killing.)\n\nRoot told JTA that conspiracy theories proliferate on the right and the left, and that he does not necessarily endorse the theories — he asks questions. That, he said, was a very American thing to do, and that pluralities of Americans do not buy into the accepted narratives behind the assassination of President John F. Kennedy in 1963 or the suicide of disgraced financier Jeffrey Epstein this month.\n\n“I question everything coming out of the mouths of government officials,” he said. “They’re egomaniacs who lie about everything to protect themselves.”"}, {"url": "https://www.mediamatters.org/coronavirus-covid-19/new-york-ag-calls-newsmaxs-wayne-allyn-root-cease-and-desist-making-misleading", "page_content": "The New York State Office of the Attorney General has told Newsmax TV host Wayne Allyn Root “to immediately cease and desist from making misleading claims” after the right-wing host touted alkaline silver as an important product for people who are concerned about coronavirus.\n\nRoot is the host of The Wayne Allyn Root Show on Newsmax TV, a cable news network that “reaches over 70 million cable/satellite homes and subscribers.” The network has positioned itself as an aggressively pro-Trump voice and recently began airing a program featuring former White House press secretary Sean Spicer and former Republican National Committee deputy communications director Lyndsay Keith. Its CEO is Christopher Ruddy, a Trump friend and adviser.\n\nAs Media Matters first reported, Root used his March 11 program to downplay concerns about the coronavirus. He then addressed people who were concerned about the virus by directing them to watch an ad touting a suspect silver product. Root stated: “‘My Doctor Suggests’ message is next. You fear coronavirus, here’s a very important message now.” Newsmax then aired an ad for MyDoctorSuggests.com featuring Gordon Pedersen, who claims to have an “all-natural solution” that “destroys” things like “viruses.” (The advertisement also touted a promo code specific to Root.)"}, {"url": "https://www.haaretz.com/us-news/2019-08-22/ty-article/who-is-wayne-allyn-root-the-host-trump-quoted-saying-hes-like-the-king-of-israel/0000017f-e3e0-d804-ad7f-f3fa087e0000", "page_content": "On Wednesday morning, President Donald Trump quoted a conservative talk show host named Wayne Allyn Root to defend comments he had made the day before that angered many in the Jewish community: that Jews who vote for Democrats show “a total lack of knowledge or great disloyalty.”\n\n“Thank you to Wayne Allyn Root for the very nice words,” Trump said before quoting something Root has said previously about the president.\n\n“President Trump is the greatest President for Jews and for Israel in the history of the world, not just America, he is the best President for Israel in the history of the world … and the Jewish people in Israel love him … like he’s the King of Israel. They love him like he is the second coming of God,” the quote said.\n\nIt’s not the only Jewish thing Root has said about Trump. Just two weeks after Trump was elected, Root sought to reassure Jewish Americans, who had voted overwhelmingly for his rival, Democratic nominee Hillary Clinton, about the president-elect’s bona fides.\n\n“I believe Donald Trump should be called ‘America’s first Jewish president,'” he wrote on the Fox News website. “I should know. I’m an Ivy League-educated Jewish kid from New York.”\n\n>> Read more: >> Trump has made it official: He is the greatest anti-Semite of our age | Opinion ■ To please Trump, Netanyahu turned Omar, Tlaib and BDS into prime time news | Analysis ■ Nixing Tlaib and Omar visit, Netanyahu harms Israel to assuage Trump’s ego | Analysis\n\nMaybe, in the sense that Saul was a Jewish kid from Tarsus — Root is an evangelical Christian, something he did not mention in his Fox column.\n\nRoot, speaking Tuesday evening on his talk show on Newsmax, also a conservative news site, was a little more candid about where he was faith-wise.\n\n“I happen to be Jewish by birth,” he said.\n\nWho exactly is Wayne Allyn Root and why are he and Trump so fond of each other? Here are some answers.\n\nHe says he’s Jewish and has interesting ideas about Jewish identity.\n\nIn the Fox column, the 58-year-old Root refers to his “Jewish butcher father, David Root.” He told The Jewish Telegraphic Agency that all four grandparents are Jewish and that his DNA shows him “99.5” percent European Jewish.\n\nRoot, who lives in Las Vegas, says he founded the Republican Jewish Coalition chapter in Nevada. Matt Brooks, the RJC’s executive director, confirmed that Root was involved in the group but says he has not been for more than a decade. (Sheldon Adelson, the casino magnate who is a major funder of the RJC and Republican candidates along with Jewish causes, hired Root to write a column for the Las Vegas Review-Journal after buying the newspaper in 2015 — a move that raised eyebrows among fans of the paper’s hard news tradition.)\n\nRoot told JTA he “took Jesus Christ as a savior” about 30 years ago, but he still considers himself Jewish.\n\nNotably, several other Trump defenders are Jews turned Christian, including Trump’s lawyer, Jay Sekulow, and the right-wing activist and lawyer Larry Klayman.\n\nThe lessons Root takes away from being born Jewish comport with hoary Jewish stereotypes — some flattering, others less so.\n\n“I am a Jew and you can’t take away from a person being a Jew,” he said, noting that Islamist extremists and white supremacists would target him as Jewish. “I’ve got Jewish blood and passion and zeal.”\n\n“Jesus Christ was a Jew, and the CEO of the Christian religion,” Root said, adding that he, too, was born Jewish and was a CEO.\n\nRoot, who calls himself a “capitalist evangelist” told Daniel Davis, a syndicated radio host, that his Jewish background informed his philosophy. Jews were “relentless,” he said.\n\n“They like to hammer down the door till they get what they want,” he said.\n\nIn the Fox column, Root said Trump “is your typical Jewish parent.”\n\n“Donald’s children are all Ivy League graduates — just like my daughter who recently graduated magna cum laude from Harvard,” he said, adding that “Donald is handing his business over to his children. That is the goal of every Jewish businessman in history.”\n\nElsewhere in the column: “Donald is a big success in Hollywood as a TV producer. He joins an exclusive club that is predominantly Jewish.”\n\nAdd forthrightness to the list of traits Root finds Jewish.\n\n“He says whatever is on his mind, even if it offends,” he wrote in the column. “All of those are traits I’ve seen in my Jewish friends, relatives and business partners for my entire life.”\n\nHe can be emphatically evangelical.\n\nA few months before the 2016 election, writing on another conservative website, Townhall, Root used a more Christian pitch in addressing coreligionists who were put off by Trump’s brashness and viciousness.\n\n“Let me repeat my message to Christians: ‘YOU’RE MISSING THE BOAT,'” Root said. “God is about miracles. We don’t need a ‘nice guy’ or a ‘gentleman’ right now. It’s the fourth quarter and we’re losing 14-0. We need a miracle. I believe Trump is our miracle.”\n\nHe’s been on the Trump train longer than most.\n\nRoot, the Libertarian Party’s vice presidential nominee in 2008, announced his support for the businessman and reality star almost as soon as Trump announced he was running in June 2015. He emceed one of the candidate’s first rallies, in Las Vegas. Trump, unsurprisingly, praised Root’s book “Angry White Male: How the Donald Trump Phenomenon is Changing America” published that year.\n\nRoot, who ran a sports gambling business, told JTA that the Republican Party has not done enough to shake Jewish voters out of their adherence to Democrats.\n\n“I’m one of the best salesmen in America, and I believe I can sell conservatism to Jews,” he said.\n\nRoot went on to say that he would soon announce that he will head a “major Jewish organization” and planned to set up a Jews for Trump political action committee.\n\nHe’s called a conspiracy theorist — he says he asks questions.\n\nLiberal outlets have long singled out Root for peddling conspiracy theories, including that the 2017 shooting massacre in Las Vegas that killed 58 concertgoers was the work of Islamist extremists. No motive has been ascribed for the attack, which was carried out by a white non-Muslim man named Stephen Paddock.\n\nRoot has also questioned whether white supremacists were behind the deadly violence at a neo-Nazi march in Charlottesville, Virginia, in 2017, and whether there is more to the 2016 murder of Seth Rich, a Jewish Democratic Party staffer. (Police believe Rich was killed in a robbery gone bad; conspiracy theorists believe Hillary Clinton was behind the killing.)\n\nRoot told JTA that conspiracy theories proliferate on the right and the left, and that he does not necessarily endorse the theories — he asks questions. That, he said, was a very American thing to do, and that pluralities of Americans do not buy into the accepted narratives behind the assassination of President John F. Kennedy in 1963 or the suicide of disgraced financier Jeffrey Epstein this month.\n\n“I question everything coming out of the mouths of government officials,” he said. “They’re egomaniacs who lie about everything to protect themselves.”"}, {"url": "https://www.creators.com/read/wayne-allyn-root", "page_content": "I believe I've come up with a game-changer: an idea that has the power to save America from destruction and collapse at the hands of our enemies (domestic and foreign), an idea so powerful that if former president and current presidential candidate Donald Trump adopts it as a centerpiece of his campaign, it will catapult him to reelection as the 47th president of the United States.\n\nThis idea is like kryptonite to the deep state. It threatens the power structure of the entire American political system and U.S. government.\n\nBecause it will prove virtually the entire D.C. swamp, deep state, Democrat Party, U.S. government and even large swaths of the GOP are traitors to the American people.\n\nHow do I know this idea is that good, that powerful?\n\nFirst, because I unveiled it recently at my speech in front of over 1,200 attendees at Club 47, the world's largest Trump fan club, in Palm Beach, Florida. My speech ended with a standing ovation — and this idea received the wildest ovation of the night.\n\nAfter the event, there was a one-hour line for my book signing. This was the idea everyone would not stop talking about!\n\nSecond, days ago I laid out this idea for the first time as a guest on a YouTube show aimed at military veterans. This show was INSTANTLY banned and deleted by YouTube. This has never happened in the history of this YouTube show. That's how powerful this idea is.\n\nThe idea is simple. If we want to save America, we must demand politicians and government officials take periodic, random...\n\nLIE DETECTOR TESTS.\n\nI believe our politicians and government officials have sold us out. They're on the take. They're bribed and blackmailed. They're playing for the other side. They're traitors. All the bad things happening to our country are happening because we've been sold out.\n\nI believe I know who has bought our politicians and government officials. They are owned lock, stock and barrel by either China, the CCP (Chinese Communist Party), the Mexican drug cartels, multinational corporate interests or Big Pharma.\n\nI know the game they're playing. Either they're taking cash bribes directly into offshore accounts... or it's laundered through offshore charities... or through corrupt offshore countries like Ukraine... or through illegal campaign contributions... or the bribes are doled out to family members or trusted friends of the politicians and government officials to keep them one step removed. One thing is clear: Our nation has been sold out.\n\nThere's only one way to find out: LIE DETECTOR TESTS.\n\nThe politicians will refuse. They'll say these tests are \"unreliable.\" Let's turn the tables on them. I found out recently that Navy SEALs are forced to take random lie detector tests several times a year to detect if they've shared top-secret information with spouses, family or friends. If they fail the test, they're instantly fired.\n\nIf the government accepts the results of lie detector tests as proof enough to fire Navy SEALs, then \"we the people\" accept the results to fire the corrupt politicians and bureaucrats. From now on, either take the lie detector test, or in the words of Donald Trump, \"You're fired!\"\n\nWhat questions would I ask?\n\n—Are you now, or have you ever been on China's payroll? Or the CCP payroll?\n\n—Are you now, or have you ever been on the payroll of the Mexican drug cartels?\n\n—Are any of your family members or friends on any of these foreign payrolls?\n\n—Do you have an offshore bank account? Does anyone in your family accept payoffs in an offshore account?\n\n—Do you accept illegal campaign contributions from any foreign interests?\n\n—Are you on the payroll of any Big Pharma company or vaccine manufacturer? Do you have family members or friends on the Big Pharma payroll or receiving stock or stock options from Big Pharma?\n\n—Are you being blackmailed, or have you ever been blackmailed?\n\n—Have you given government contracts to spouses, family members or friends?\n\n—Have you passed inside information on public companies to family or friends, and shared in the profits?\n\n—Are you 100% loyal to the interests of America and your constituents?\n\nI think that about covers it. Get the answers to those questions and we save America. We throw the bums and traitors out.\n\nSadly, I believe we'd have to replace virtually the entire House, Senate, every federal judge and every government bureaucrat.\n\nMy message to Trump...\n\nThe American people will go wild for this idea. Trust me, I've already tested it. Take this idea and run with it — literally. Please adopt this idea as a centerpiece of your presidential campaign — along with term limits.\n\nThat powerful one-two punch will catapult you back into the White House.\n\nAnd if YouTube chose to immediately ban and delete my interview, you know this idea scares the deep state to death. They don't want the American people to ever hear about this idea. They're treating it like Hunter Biden's laptop.\n\nThat's how you know this idea is a grand-slam home run!\n\nIf it's good enough for Navy SEALs, it's time for \"we the people\" to demand the politicians and bureaucrats take lie detector tests.\n\nWayne Allyn Root is known as \"the Conservative Warrior.\" Wayne's latest book is out, \"The Great Patriot BUY-cott Book.\" https://www.amazon.com/Great-Patriot-BUY-cott-Book-Conservative/dp/099173372X/ref=tmm_pap_swatch_0?_encoding=UTF8&qid=1676215826&sr=8-1. Wayne is now the host of two new TV shows on Real America's Voice and Mike Lindell TV. He is also host of the nationally syndicated \"Wayne Allyn Root: Raw & Unfiltered\" on USA Radio Network, daily from 6 PM to 9 PM EST. Visit ROOTforAmerica.com for more information."}], "Wayne Allyn Root is the author of several books including The Power of Relentless: 7 Secrets to Achieving Mega-Success, Financial Freedom, and The Good Life.": [{"url": "https://books.google.com/books/about/The_Power_of_Relentless.html?id=NB1pCQAAQBAJ", "page_content": ": 7 Secrets to Achieving Mega-Success, Financial Freedom, and the Life of Your Dreams Wayne Allyn Root Simon and Schuster , 10 Aug 2015 - Business & Economics - 256 pages 0 Reviews Reviews aren't verified, but Google checks for and removes fake content when it's identified Named one of Steve Forbes' favorite books of 2015...\n\n\n\nAre you ready to supercharge your career ... grow your business beyond your wildest dreams ... turn your life up to eleven?\n\n\n\nLearn the secrets of success from \"Mr. Relentless\" himself. Capitalist evangelist Wayne Allyn Root—bestselling author, reality TV producer, serial entrepreneur, former vice presidential nominee, and business speaker on the international circuit—reveals the seven principles of relentless that will take you to a level you never imagined. Preview this book »"}, {"url": "https://www.goodreads.com/author/list/137708.Wayne_Allyn_Root", "page_content": "Showing 21 distinct works.\n\nsort by popularity original publication year title average rating number of pages\n\nTrump Rules: Learn the Trump Rules and Tools of Mega Success and Wealth From the Greatest Warrior and Winner in History!\n\nThe Great Patriot BUY-cott Book: The Great Conservative Companies to BUY From & Invest In!\n\nThe Ultimate Obama Survival Guide: How to Survive, Thrive, and Prosper During Obamageddon\n\nThe Great Patriot BUY-cott Book: The Great Conservative Companies to BUY From & Invest In!\n\nThe King of Vegas' Guide to Gambling: How to Win Big at POKER, Casino Gambling & Life! The Zen of Gambling updated\n\nTrump Rules: Learn the Trump Rules and Tools of Mega Success and Wealth From the Greatest Warrior and Winner in History!\n\nThe Joy of Failure: How to Fail Your Way to the Top\n\nThe Zen of Gambling: Lessons from the World's Greatest Gambler\n\nAngry White Male: How the Donald Trump Phenomenon is Changing America―and What We Can All Do to Save the Middle Class\n\nThe Power of Relentless: 7 Secrets to Achieving Mega-Success, Financial Freedom, and the Life of Your Dreams\n\nThe Great Patriot Protest & Boycott Book: The Priceless List for Conservatives, Christians, Patriots, & 80+ Million Trump Warriors to Cancel \"Cancel Culture\" and Save America!\n\nThe Murder of the Middle Class: How to Save Yourself and Your Family from the Criminal Conspiracy of the Century\n\nThe Conscience of a Libertarian: Empowering the Citizen Revolution with God, Guns, Gold and Tax Cuts\n\nThe Ultimate Obama Survival Guide: Secrets to Protecting Your Family, Your Finances, and Your Freedom\n\n* Note: these are all the books on Goodreads for this author. To add more books, click here"}, {"url": "https://www.conservativebookclub.com/book/the-power-of-relentless", "page_content": "** Part one and part two of our Exclusive CBC Author Interview with Wayne Allyn Root **\n\nRegnery Publishing announced today plans to publish The Power of Relentless by author and “Capitalist Evangelist” Wayne Allyn Root, a nationally recognized CEO, entrepreneur, conservative media personality, and former vice presidential nominee. The book is scheduled to be released in August 2015.\n\nKnown for his many political achievements, Root has built successful careers in media, politics, television, and business. In his new book, The Power of Relentless, Root will draw on his personal experience as a successful entrepreneur and world-class financial risk-taker to teach others how they can also achieve remarkable success.\n\nIn addition to Root’s personal story of success, The Power of Relentless will have lessons from the personal success stories of Winston Churchill, Abraham Lincoln, Nelson Mandela, Ronald Reagan, Steve Jobs, Jack Welch, Oprah, Walt Disney, Charles Schwab, Colonel Harland Sanders, and P.T. Barnum—all of whom embrace the power of relentless to succeed against adversity and great challenge.\n\nMr. Root is the bestselling author of ten books, including The Ultimate Obama Survival Guide (Regnery, 2013) and The Murder of the Middle Class (Regnery, 2014).\n\nTags: Power, Relentless, Wayne Allen Root"}, {"url": "https://www.barnesandnoble.com/w/the-power-of-relentless-wayne-allyn-root/1122098929", "page_content": "Named one of Steve Forbes' favorite books of 2015...\n\n\n\nAre you ready to supercharge your career ... grow your business beyond your wildest dreams ... turn your life up to eleven?\n\n\n\nLearn the secrets of success from \"Mr. Relentless\" himself. Capitalist evangelist Wayne Allyn Root—bestselling author, reality TV producer, serial entrepreneur, former vice presidential nominee, and business speaker on the international circuit—reveals the seven principles of relentless that will take you to a level you never imagined."}, {"url": "https://www.creators.com/author/wayne-allyn-root", "page_content": "Wayne Allyn Root (aka WAR) is a high-energy, passionate, outspoken, unapologetic conservative media star. He has been branded him a “conservative warrior” and “capitalist evangelist.” Root is a former presidential candidate and the 2008 Libertarian vice presidential nominee. He is a now a national TV and radio host and a nationally syndicated newspaper columnist.\n\nRoot’s national TV show, \"The Wayne Allyn Root Show,\" airs nightly on Newsmax TV at 8 p.m. ET, or 5 p.m. PT. Bill O'Reilly, America’s \"King of Cable TV News,” is a guest three times per week.\n\nRoot hosts the nationally syndicated \"WAR Now: The Wayne Allyn Root Show\" on USA Radio Network daily from 6 to 9 p.m. ET, or 3 to 6 p.m. PT.\n\nRoot was opening speaker at many Trump presidential campaign events, including Trump’s rally at the Las Vegas Convention in September 2018.\n\nRoot appears regularly in the national media, including on Fox News. He has defended Trump on television in over 30 countries across the globe -- including Israel. Root presented the Tea Party’s national TV response to President Barack Obama’s 2016 State of the Union; Root is the only person ever chosen for the task who was not a U.S. senator, congressperson or former presidential candidate.\n\nAnd Root is the author of 11 books, including national best-sellers “The Ultimate Obama Survival Guide,” “Millionaire Republican,” “The Conscience of a Libertarian,” “The Murder of the Middle Class” and the No. 1 business best-seller “The Power of RELENTLESS,\" endorsed by President Donald Trump.\n\nWayne Allyn Root resides in the suburbs of Las Vegas, Nevada."}, {"url": "https://www.abebooks.com/9781621574101/Power-Relentless-Secrets-Achieving-Mega-Success-1621574105/plp", "page_content": "Are you ready to supercharge your career ... grow your business beyond your wildest dreams ... turn your life up to eleven? Learn the secrets of success from \"Mr. Relentless\" himself. Capitalist evangelist Wayne Allyn Root bestselling author, reality TV producer, serial entrepreneur, former vice presidential nominee, and business speaker on the international circuit reveals the seven principles of relentless that will take you to a level you never imagined:\n\n\n\nRelentless HEART the secret Wayne learned from his dying mother\n\nRelentless CHUTZPAH how to NEVER take No” for an answer\n\nRelentless AMBITION and GOAL-SETTING positive thinking is only the first part of the equation\n\nRelentless PREPARATION Wayne reveals his Relentless TRIAD (the remarkable, incredible, magical scheduled daily action plan that will change your life by 9:00 a.m.)\n\nRelentless BRANDING learn from Floyd Money” Mayweather, Broadway Joe” Namath, and Wayne to use the magic of branding to turn yourself into a highly marketable commodity\n\nRelentless STORYTELLING how the power of video can make your business or career EXPLODE\n\nRelentless AGGRESSIVE ACTION how to hunt, hound, pitch, promote, market, and sell your way to breakout success\n\n\n\nPlus, as an added bonus, Wayne reveals the twelve \"Positive Addictions\" that give him the non-stop energy to put these seven principles of relentless into action all day, every day with an enthusiasm unknown to mankind.\n\n\"You're in the right place with The Power of Relentless. Opportunity is knocking, and Wayne Root will show you how to seize it. He knows how to be tenacious and relentlessand how to win!\"\n\nDonald J. Trump, chairman of The Trump Organization, executive producer of Celebrity Apprentice, and bestselling author ofThe Art of the Deal\n\n\n\n\"Wayne Root has a brilliant mind, but in this book he makes it clear that that is not a unique characteristic. He shows the reader how to use their brilliant minds to take what they have, to get what they want. It's a fun read.\"\n\nBenjamin S. Carson Sr., M.D., professor emeritus of neurosurgery, oncology, plastic surgery, and pediatrics at Johns Hopkins and presidential candidate\n\n\n\n\"My grandfather, B.C. Forbes, who founded the publication that bears his name, particularly admired what he called \"stick-to-it-iveness.\" Wayne Allyn Root demonstrates how to apply that crucial characteristic to all aspects of your life in order to achieve well-rounded success in this vibrantly written and engaging book.\"\n\nSteve Forbes, chairman of Forbes Media and editor-in-chief of Forbes magazine\n\n\"About this title\" may belong to another edition of this title."}, {"url": "https://www.goodreads.com/book/show/119868519-the-power-relentless", "page_content": "7 Secrets to Achieving Mega Success, Financial Freedom and the Life of Your Dreams\n\n\n\nARE YOU READY TO\n\n• Supercharge your career?\n\n• Grow your business beyond your wildest dreams?\n\n• Turn your life up to eleven?\n\n\n\nLearn the secrets of success from “Mr. Relentless” himself. Capitalist evangelist Wayne Allyn Root—reveals the seven principles of relentless that will take you to a level you never\n\n• Relentless HEART—the secret Wayne learned from his dying mother\n\n• Relentless CHUTZPAH—how to never take “No” for an answer\n\n• Relentless AMBITION and GOAL-SETTING—positive thinking is only the first part of the equation\n\n• Relentless PREPARATION—Wayne reveals his Relentless Triad—the daily action plan that will change your life by 9:00 a.m.)\n\n• Relentless BRANDING—learn from Floyd “Money” Mayweather, “Broadway Joe” Namath, and Wayne to use the magic of branding\n\n• Relentless STORYTELLING—how the power of video can make your business or career explode\n\n• Relentless AGGRESSIVE ACTION—how to hunt, hound, pitch, promote, market, and sell your way to breakout success\n\n\n\nAs an added bonus, Wayne reveals the twelve “Positive Addictions” that give him the non-stop energy to put these seven principles of relentless into action all day, every day—with an enthusiasm unknown to mankind.\n\n\n\nWAYNE ALLYN ROOT is “Mr. Relentless.” The media call him “the Capitalist Evangelist.” He is a bestselling author, reality TV producer, serial entrepreneur, former vice presidential nominee, and business speaker on the international circuit. He is spokesman and rainmaker for companies all over the world."}, {"url": "https://www.abebooks.com/9781501260971/Power-Relentless-Wayne-Allyn-Root-1501260979/plp", "page_content": "\"You're in the right place with The Power of Relentless. Opportunity is knocking, and Wayne Root will show you how to seize it. He knows how to be tenacious and relentless and how to win!\"\n\nDonald J. Trump, chairman of The Trump Organization, executive producer of Celebrity Apprentice, and bestselling author of The Art of the Deal\n\n\n\n\"Wayne Root has a brilliant mind, but in this book he makes it clear that that is not a unique characteristic. He shows the reader how to use their brilliant minds to take what they have, to get what they want. It's a fun read.\"\n\nBenjamin S. Carson Sr., M.D., professor emeritus of neurosurgery, oncology, plastic surgery, and pediatrics at Johns Hopkins and presidential candidate\n\n\n\n\"My grandfather, B.C. Forbes, who founded the publication that bears his name, particularly admired what he called \"stick-to-it-iveness.\" Wayne Allyn Root demonstrates how to apply that crucial characteristic to all aspects of your life in order to achieve well-rounded success in this vibrantly written and engaging book.\"\n\nSteve Forbes, chairman of Forbes Media and editor-in-chief of Forbes magazine|Are you ready to supercharge your career ... grow your business beyond your wildest dreams ... turn your life up to eleven? Learn the secrets of success from \"Mr. Relentless\" himself. Capitalist evangelist Wayne Allyn Root bestselling author, reality TV producer, serial entrepreneur, former vice presidential nominee, and business speaker on the international circuit reveals the seven principles of relentless that will take you to a level you never imagined:\n\n\n\nRelentless HEART the secret Wayne learned from his dying mother\n\nRelentless CHUTZPAH how to NEVER take No” for an answer\n\nRelentless AMBITION and GOAL-SETTING positive thinking is only the first part of the equation\n\nRelentless PREPARATION Wayne reveals his Relentless TRIAD (the remarkable, incredible, magical scheduled daily action plan that will change your life by 9:00 a.m.)\n\nRelentless BRANDING learn from Floyd Money” Mayweather, Broadway Joe” Namath, and Wayne to use the magic of branding to turn yourself into a highly marketable commodity\n\nRelentless STORYTELLING how the power of video can make your business or career EXPLODE\n\nRelentless AGGRESSIVE ACTION how to hunt, hound, pitch, promote, market, and sell your way to breakout success\n\n\n\nPlus, as an added bonus, Wayne reveals the twelve \"Positive Addictions\" that give him the non-stop energy to put these seven principles of relentless into action all day, every day with an enthusiasm unknown to mankind.\n\nWAYNE ALLYN ROOT is “Mr. Relentless.” The media call him “the Capitalist Evangelist.” Starting out as a blue collar S.O.B. (son of a butcher), this real-life Renaissance Man has achieved remarkable levels of success in many fields. He is a former vice presidential nominee, national media personality, bestselling author, TV producer, prolific infomercial pitchman, CEO, serial entrepreneur, and international business speaker. He is spokesman and rainmaker for companies all over the world.\n\n\"About this title\" may belong to another edition of this title."}, {"url": "https://www.audible.com/author/Wayne-Allyn-Root/B001K8E4QM", "page_content": "WAYNE ALLYN ROOT is a CEO, entrepreneur and successful businessman like his mentor Donald Trump. He is the host of nationally-syndicated \"Wayne Allyn Root: Raw and Unfiltered\" on USA Radio Network and former host of national TV show \"WAR Now: The Wayne Allyn Root Show\" on Newsmax TV. He is a bestselling Conservative author and syndicated columnist and a former Libertarian vice presidential nominee. A key ally of Trump from the beginning, Root aims to share the secrets to a successful life through the lens of the forty-fifth president of the United States.\n\nRead more\n\nRead less"}]}