{"Paul Caddis was loaned to Burton Albion in 2017.": [{"url": "https://www.skysports.com/football/news/11095/10743887/paul-caddis-leaves-birmingham-after-contract-cancellation", "page_content": "Paul Caddis, who scored a dramatic goal to save Birmingham from relegation in 2014, has left the club by mutual consent.\n\nCaddis' contract was not due to expire until June 2017 but the right-back has been allowed to leave St Andrew's early in order to seek a new club as a free agent.\n\nBirmingham manager Gianfranco Zola held talks with Caddis over his future and all parties have agreed to cancelling his contract early.\n\nZola brought in right-back Emilio Nsue from Middlesbrough during the transfer window, while young defender Josh Dacres-Cogley has moved above Caddis in the pecking order.\n\nCaddis, 28, arrived at Birmingham in 2012 on an initial loan deal from Swindon before joining permanently and going on to captain the side on a number of occasions.\n\nImage: Caddis scored a late equaliser against Bolton in 2014 to preserve Birmingham's second-tier status\n\nThe 28-year-old was a fan-favourite among Blues fans and famously scored a stoppage-time equaliser against Bolton to save the club from relegation to League One on the final day of the 2013-14 campaign.\n\nCaddis follows Jonathan Spector - who was Birmingham's longest-serving player - in exiting the Sky Bet Championship club as Zola seeks to freshen up his new side."}, {"url": "https://the72.co.uk/2022/02/24/birmingham-city-legends-quiz-5-quickfire-questions-on-paul-caddis/", "page_content": "Paul Caddis initially joined the Blues on loan but would go on to make himself a hero at Birmingham City.\n\nThe versatile ace’s debut was a sign of things to come, producing a man-of-the-match performance as Birmingham City defeated Peterborough United.\n\nCaddis eventually signed permanently in 2013 and went on to spend a further four-and-a-half years at St Andrew’s.\n\nIn the 2013/14 season, Caddis featured heavily again, but it was a tough season for Birmingham City. On the final day of the season, needing one point to stay up, Birmingham City faced Bolton Wanderers. Caddis produced a last-minute equaliser to keep Birmingham City in the Championship, sparking chaotic scenes among the travelling fans.\n\nFollowing his heroics the season before, Caddis had his stand-out year at St Andrew’s. He missed one game in all competitions all season, also captaining the club on many occasions. He was regarded as one of the best-attacking full-backs in the league that campaign too.\n\nCaddis left St Andrew’s in January 2017 after mutually terminating his contract after falling out of favour.\n\nBut how well do you know Caddis’ time with Birmingham City? Test your knowledge in the quiz below…"}, {"url": "https://www.11v11.com/players/paul-caddis-229276/", "page_content": "Paul Caddis joined Swindon Town in August 2010 with a three-year contract that was extended to June 2014 in May 2012.\n\nHe joined Birmingham City in September 2013 with a three-year contract that was extended to June 2017 in July 2015 before it was cancelled in January 2017.\n\nPaul joined Bury in February 2017 with a contract to June 2017.\n\nHe joined Blackburn Rovers in July 2017 with a two-year contract."}, {"url": "https://www.thecelticwiki.com/players/all-time-a-to-z-of-celtic-players/c/caddis-paul/", "page_content": "Personal\n\nFullname: Paul Caddis\n\nBorn: 19 April 1988\n\nBirthplace: Irvine, Scotland\n\nSigned: 1 July 2006 (from youth)\n\nLeft: 2 August 2010 (to Swindon)\n\nPosition: Right-Back, full-back\n\nDebut: Falkirk 0-1 Celtic, League, 27 Jan 2008\n\nSquad No.:\n\nInternationals: Scotland\n\nInternational Caps: 1\n\nInternational Goals: 0\n\n\n\nBiog\n\nPaul Caddis came through the youth ranks at Celtic to earn first team recognition in the latter half of season 2007/08.\n\n\n\nInjuries to Mark Wilson and Andreas Hinkel saw Gordon Strachan turn to the 19-year-old right-back who made an instant impression with his assured performances. Good going forward, hard working and with good touch and distribution the teenager displayed all the raw ingredients to become a top quality full-back.\n\n\n\nInitially used from the bench, Caddis’ was given a starting spot in the 3-2 Champions League defeat to Barcelona at Parkhead. Although he would be subbed that night the youngster did not look out of his depth in such illustrious company.\n\n\n\nWith Hinkel and Wilson already vying for the right-back berth Caddis may have to bide his time before he becomes a first team regular but the early signs are that he has the talent to ensure that even internationalists can’t take a starting spot for granted.\n\n\n\nHe was a very good player but he just wasn’t given sufficient opportunities to progress and many were sceptical that he would make it. Buying in was seen as better too often to taking a gamble on a youngster. Caddis may have been a good prospect but with Celtic messing up the league titles in 2008 & 2009 and then having multiple changes in managers, it doesn’t help anyone’s career let alone a developing youngster. Gordon Strachan in his last season & then Tony Mowbray were poor coaches during those spells.\n\nPaul Caddis was loaned out to Dundee United to gain first team experience in the January 2009 transfer window.\n\nHe returned to Celtic and featured in pre-season friendlies, this time under Neil Lennon. However, in Aug 2010 he made a transfer to Swindon after a successful £350,000 double bid for both himself and Simon Ferry. We hoped him the best.\n\nHe definitely had the making of a good player for Celtic, and some of the support were very much convinced that Celtic had missed out on a great player to be if the Club had held onto him and developed him.\n\n\n\nPost-Celtic\n\nA successful time at Swindon, he helped them to the league two title in England.\n\nHe then went onto have a long career with Birmingham over five seasons, and was a firm favourite. Made himself a hero by scoring a dramatic equaliser at the death in the last league match of Birmingham City’s season in 2013/14 season to keep them up in their division.\n\nA proud moment came in 2016 when he finally made his debut for Scotland, a debut late in his career, albeit only playing a few minutes late on in the game after being subbed on in a 1-0 win over the Czech Republic in a friendly.\n\nIn 2017, Paul Caddis signed for Blackburn Rovers, coincidentally under Tony Mowbray his former Celtic manager. He later moved to Bradford and then most memorably returning to Swindon where he (again) helped the club win the league two title. He wrapped up his playing career in 2022 but had ended his time in the senior game on the playing side in 2021.\n\n[…]\n\nQuotes\n\n“14 years ago I was involved the last time Celtic won the title at tannadice. Tonight is another chance of doing that. Tommy Burns looked down on us that night like he will tonight. Good luck.”\n\nPaul Caddis (June 2022)\n\n\n\nPlaying Career\n\nClub From To Fee League Scottish/\n\nFA Cup League cup Other Swindon 02/08/2010 £350k Dundee Utd 02/02/2009 31/05/2009 Loan 10 (1) 0 0 (0) 0 0 (0) 0 0 (0) 0 Celtic 01/07/2006 02/08/2010\n\nTrainee 3 (14) 0 3 (0) 0 2 (0) 0 2 (0) 0 Totals £0 30 (17) 0 4 (1) 0 3 (0) 0 2 (1) 0 Apps Goals Apps Goals Apps Goals Apps Goals\n\nHonours with Celtic\n\nnone\n\nPictures"}, {"url": "https://www.hitc.com/en-gb/2018/10/31/as-free-agent-paul-caddis-trains-with-bradford-leeds-should-cons/", "page_content": "Leeds United need a short term plug at right-back.\n\nLeeds United are without Luke Ayling for the next two months after the right-back suffered a MCL sprain against Nottingham Forest.\n\nWith Gaetano Berardi also out with injury, Leeds are looking more stretched at the position than they would like.\n\nOne possible short term option is to look at signing a free agent, and one name who is available is currently training with local rivals Bradford City.\n\nPaul Caddis is currently training with the Bantams [via Telegraph and Argus] with a view to signing a new deal after leaving Blackburn Rovers.\n\nIn terms of what Leeds need, on a short term deal, Caddis could fill the void until Ayling returns.\n\nThe former Celtic defender spent four seasons at Birmingham between 2013 and 2017, making more than 140 Championship appearances.\n\nHe then signed with Blackburn Rovers for a season, playing 14 times as they won promotion.\n\nAt 30-years-old the former Scotland international could be a useful option as a squad player for Leeds until Ayling returns at the end of the year.\n\nLeeds cannot dip into the transfer market until January and their decision to only sign one defender in the summer leaves their squad stretched.\n\nCaddis could bolster them on a short term basis and give them the experience they need to help keep their strong run going.\n\n\n\n"}, {"url": "https://www.theguardian.com/football/that-1980s-sports-blog/2017/jan/06/fa-cup-third-round-leicester-city-burton-albion-block-wood", "page_content": "When Burton Albion of the Northern Premier League were drawn against Division One side Leicester City in the third round of the FA Cup in 1985, it appeared to be a romantic tie: a David v Goliath clash that the part-timers of Burton in the spotlight and in the hunt for an upset. It had all of the ingredients required for a third round classic but, sadly, the tie ended up making headlines for different reasons.\n\nNeil Warnock’s Burton team took hope from the memory of Leicester’s surprising defeat to Harlow Town in the Cup in 1980. Leicester had drawn with the Athenian Premier League side at Filbert Street, before suffering a 1-0 defeat in the replay. Leicester defender Tommy Williams had played in that tie and did not want to suffer another embarrassment against Burton. “We realise we are on a hiding to nothing,” said Williams. “We were terrible that night at Harlow and it would have been no injustice if they had won by three or four clear goals. So some of us know what to expect. That’s why we are going out against Burton determined not to let it happen again.”\n\nBurton had already disposed of Wootton Blue Cross, Stevenage Borough, Willenhall Town, Wycombe Wanderers, Staines Town and Aldershot on their way to reaching the third round for the first time since 1956, but their adventure was expected to end against Leicester. They had been hammered 7-0 by Charlton at this stage 29 years before and Burton suffered another thrashing when they met Leicester on the 5 January 1985. However, this time there were outside influences to take into account.\n\nMidlands brewery company Ind Coope, sponsors of both teams, provided both sets of players with an even greater incentive to progress to the fourth round; a barrel of best bitter, containing 288 pints of beer. Come the end of the match, Burton keeper Paul Evans must have felt like he had drunk the lot. Burton had been holding their own before the incident. Gary Lineker had opened the scoring after 16 minutes before an equaliser from David Vaughan sent the Burton fans into raptures. Then things took a turn for the worse.\n\nThroughout the match – which had been moved to the Baseball Ground in Derby for safety reasons – Burton keeper Evans had been showered with missiles while patrolling his area. “Someone threw a can in the goalmouth just after the start,” Evans recalled after the match. “So I picked it up. It was full of sand.” There was more to come. “There were a lot of coins being thrown and one of them hit me. Then I was hit by something else and I went down.”\n\nEvans was struck by a block of wood thrown from the stands, believed to be a part of the seating, and players gathering around the stricken keeper with concerned looks on their faces. “I didn’t quite pass out and eventually I managed to get up. I felt very nauseated and kept trying to throw up.” In fact, Evans was sick on the pitch and continued to vomit at half-time.\n\nEventually struggling to his feet, Evans then conceded two goals, not that he knew much about them. “I can’t remember the second and third goals at all. Someone told me they were headers.” Having already used their one permitted substitute, Burton were reluctant to go down to 10 men, but they had a big decision to make at half-time.\n\nReferee Brian Hill extended the break by five minutes to give Evans time to recover. “I was weak at the knees,” Evans said. “A doctor told me not to go out for the second half but by then I was beginning to feel a little better. I didn’t want to miss anything.” Evans made it out for the second half but three more goals gave Leicester a 6-1 win, Lineker’s hat-trick apparently putting Gordon Milne’s team into the fourth round.\n\nLeicester players celebrate with 288 pints of beer. Photograph: Duncan Raban/Empics\n\n“It should have been a gala occasion. Instead, it was a rather unpleasant day out,” wrote Simon Barnes in the Times, as rumours began to circulate that Burton would lodge a protest with the FA asking for a replay. After a two-hour meeting, Burton decided to appeal to the FA, with the club’s chairman, Bill Royall, making the 200-mile round trip through snow to deliver the protest letter to Lancaster Gate. “We know we are only little Burton but the principle is important,” said Warnock. “Whoever is playing, hooligans must not be allowed the opportunity of altering the course of a match.”\n\nIn 1974, the FA ordered Newcastle and Nottingham Forest to replay their fifth-round tie after crowd trouble and Uefa had recently ruled that the Cup-Winners’ Cup tie between Celtic and Rapid Vienna should be played again due to a missile allegedly striking a Rapid player. So there was hope for the non-league team. Six days after the original match, Burton’s case was heard.\n\nLeicester secretary Alan Bennett made his feelings clear on the matter. “Of the 6,000 tickets sold behind the goal, only 1,828 were issued by Leicester. The rest were sold at the gate on the day to anyone. There were incidents earlier in the match when Leicester fans behind the goal were hit by missiles from the stand above. The feeling was that the culprits were Derby people.” Derby officials hit back but the most important opinion would be that of the FA committee.\n\nThe FA came down in favour of Burton, ordering a replay to be played at the Baseball Ground behind closed doors. “The clear message from the decision is that the FA will not draw back from actions strong enough to prove that crowd trouble must not pay,” FA secretary Ted Croker announced after the hearing. Leicester were less than happy but had to accept the decision. “The team and our genuine supporters are victims of idiots and to call them only idiots is to treat them kindly,” said Milne.\n\nThe Foxes found an unlikely ally in the Burton goalkeeper. “My sympathies are with Leicester. I think they deserve the tie on the basis of the first result,” said Evans, admirably, after the hearing. Evans, his manager and team-mates now had another chance, but it brought another headache: could they get time off work to play in the replay? “I’ve got lorry drivers, shopkeepers, solicitors and all sorts of working lads who will have to get the day off,” said Warnock. “But we’ll have 11 out there and that’s the important thing.” Warnock, who was also working as a chiropodist in Sheffield, had to cancel a number of bookings, a situation that wasn’t improved when the replay scheduled for Monday 14 January was called off due to snow.\n\nThe £35-a-week part-timers now had to sort out leave from work for a second time, as the fixture was moved to the Wednesday afternoon at Highfield Road in Coventry due to the unavailability of the Baseball Ground. Finally, the replay went ahead, in front of 200 or so people, made up of club representatives, journalists and a few ball boys who had to stand and shiver on the empty, snow-covered terraces.\n\nAlan Smith of Leicester City and Steve Dolby of Burton Albion battle it out at an empty Highfield Road. Photograph: Bob Thomas/Getty Images\n\nPaul Ramsey’s goal after four minutes settled the tie but Doug Newton and Stewart Mell went close for Burton. The match was a strange affair, played out in an eerie atmosphere. “It is unfair to ask teams to play in that environment and I wouldn’t like to think that any professional side will be asked to do that again,” said Milne after his team had progressed to a fourth-round date with Carlisle. “The crowd is part of the game and you can’t perform without them.”\n\n“We did ourselves justice,” said Warnock as the saga reached its conclusion. “Without outside interference we got on with the game and showed a lot of guts and determination and quite a lot of skill. We are disappointed we lost but we were happy to prove that it would have been closer in the first match without intimidation.”\n\nBut the final word should come from Evans. “We went to the game to enjoy ourselves. But I was deprived of half an hour of a game I had been looking forward to.” And that is the saddest part of this sorry tale. A chapter that unfortunately could be added to many others in a season of violence that sent British football hurtling to rock bottom."}, {"url": "https://www.bbc.com/sport/football/23048066", "page_content": "Last updated on .From the section Football\n\nSwindon Town defender Paul Caddis says he is still unclear about his future with the club.\n\nCaddis, 24, is under contract at with the League One side until next summer.\n\nBut he has not played for Swindon since May 2012, after falling out with former Town boss Paolo Di Canio. and spent last season on loan at Birmingham.\n\nCaddis at Swindon Signed in August 2010 from Celtic\n\nMade 42 appearances in first season\n\nCaptain for 2011-12 campaign and led Swindon to League Two title\n\nDropped by Paolo Di Canio in August and loaned to Birmingham\n\nMade 27 Championship appearances last season for the Blues\n\nAsked if he was staying for the long-term, Caddis told BBC Wiltshire: \"Honestly, I don't know the way the club is going at the moment.\"\n\nHe continued: \"Right now I'm contracted at Swindon and, as always, I'll give 100% until the day I leave.\"\n\nBirmingham have previously made several unsuccessful bids to take the right-back to St Andrew's on a permanent deal, but Swindon manager Kevin MacDonald says the Blues have cooled their interest.\n\nCaddis made 28 appearances for Birmingham last season and believes it has helped him develop as a player.\n\n\"The Championship is, arguably, the toughest league in the world and it's extremely tough for a club to get out of,\" he continued.\n\n\"It was good to test myself at a higher level.\"\n\nHe arrived at Swindon from Celtic in 2010 and captained Town to the League Two title to following season.\n\nCaddis agreed a contract extension last summer but a spat with now Sunderland boss Di Canio led to him being stripped of the captaincy and sent out on loan.\n\nThe club is now under new management, with MacDonald having replaced Di Canio in February, and new ownership, following chairman Jed McCrory's takeover in the same month.\n\nAnd the club's overhaul has hit the playing squad as well, with six first-team players having already departed this summer.\n\n\"There's only about nine senior players left, and that's including Louis Thompson and Leigh Bedwell who are still young,\" added Caddis.\n\n\"There's only really Paul Benson, Alan Navarro and Wardy [Darren Ward] who are the old heads.\n\n\"It's quite a depleted squad at the moment but they've got time and I'm sure the manager will track some quality players.\""}, {"url": "https://www.bbc.co.uk/sport/football/23836019", "page_content": "Swindon defender Paul Caddis has said he is frustrated with the club's board because his future is not yet resolved.\n\nThe 25-year-old right-back was loaned to Birmingham City last season and has not featured in the squad this term.\n\nCaddis believes that, as one of Town's highest earners, the club have frozen him out with the intention to sell, but have not acted on interest from both Blues and Millwall.\n\nHe told BBC West Sport: \"I don't understand where I'm at.\"\n\nCaddis, who is under contract until next summer, explained: \"I spoke to Jed [McCrory, chairman] when I first came back from Birmingham and he said my wage could be a problem. I understand that.\n\nCaddis' Swindon swansong? The last time Paul Caddis made a first-team appearance for Swindon was on 5 May, 2012 in the 0-0 draw with Bradford. The previous game, he had lifted the League Two title as Town captain.\n\n\"They're not playing me now because they want to sell me. Jed has said there's not been interest because of my salary but it's just not true.\n\n\"Millwall and Birmingham have agreed to take over my contract [on loan] but for some reason the club have blocked it.\n\n\"One minute they're blocking me, the next they're saying I won't play. That's a choice that's been taken out of the manager's [Mark Cooper] hands.\"\n\nMcCrory has responded to Caddis' claim, saying the club had only received one formal offer for him - believed to be from Blackpool, with whom Caddis admits he failed to agree personal terms.\n\nSpeaking to BBC Wiltshire, he said: \"I'm disappointed that Paul came to the media rather than talk to me. If he is frustrated he can talk to me at any time. I didn't realise that we had a problem.\n\n\"Paul sat with me, about six weeks ago, and he told me he wanted to play in the Championship and I did tell him he was one of the club's highest earners, which he is aware of.\n\n\"We want players who want to play for this club and take the club forward. At the time of this meeting Paul made it quite clear that he saw his career at a higher level.\"\n\nFormer Celtic player Caddis captained Swindon to the League Two title in 2011-12 season but was sent out to Birmingham last summer following a dispute with former Town boss Paolo Di Canio, who has since taken over at Premier League Sunderland.\n\nScotsman Caddis proved a success at St Andrew's, making 28 appearances, but the Championship club failed in their attempt to bring back Caddis in April.\n\nKevin MacDonald was manager when Caddis returned to the County Ground for pre-season this summer, and described the player's attitude as \"professional\" and said he \"gave 100%\" during training.\n\nBut after an unsettled year, with his last appearance for Swindon coming in May 2012, the player admits: \"I go home and I think 'is it me? Have I done something?'.\n\n\"People will be thinking I'm this big trouble maker, but I've never had a bad attitude or caused problems.\n\n\"There's been reports I've asked to leave the club, which is not true. I want to help the club and I'm not being allowed to do that.\"\n\nDuring Caddis' time away from the County Ground last year, Swindon were taken over by McCrory's consortium and the new chairman was forced to make budget cuts, after significant spending from Di Canio's era.\n\nTen first-team members have since left the club, and Caddis has now spent the first five games of this season watching from the stands.\n\n\"It's completely out of my hands now,\" he added. \"I was given a contract by the previous board, that they thought I deserved.\n\n\"I'm hoping there's a resolution, although it looks unlikely. The fans and the club are the most important thing and I just hope they understand what position I'm in.\n\n\"If a deal doesn't get done it looks as though I'll be sitting in the stand for a year. It would be really disappointing but I'm contracted to the club so I've got to be there every day.\""}, {"url": "https://www.bbc.co.uk/sport/football/22544303", "page_content": "Last updated on .From the section Football\n\nBirmingham have failed to secure a permanent deal for Swindon's Paul Caddis because of budget restrictions.\n\nThe 25-year-old was loaned to Blues last August after falling out with former Swindon manager Paolo Di Canio.\n\nBirmingham are thought to have made four unsuccessful bids for the Scottish defender in March.\n\nAnd BBC Wiltshire understands the Championship side have now been told their budget has been scaled back for next season's campaign.\n\nCaddis still has a year to run on his contract at the County Ground and a number of second-tier clubs are thought to be interested in signing the former Celtic player.\n\nHe joined Swindon in 2010 and was made captain by Di Canio during the 2011-12 season, in which they won the League Two title.\n\nBut Caddis was stripped of the armband last summer and sent out on loan after Di Canio suggested the defender had \"changed his attitude\".\n\nDespite struggling with a shoulder injury, Caddis made 28 appearances for Birmingham this season."}, {"url": "https://www.bbc.co.uk/sport/football/23938373", "page_content": "Last updated on .From the section Football\n\nBirmingham City have signed former Swindon Town skipper Paul Caddis for an undisclosed fee on a three-year deal.\n\nThe 25-year-old Scot was first loaned to Blues a year ago after falling out with ex-Swindon manager Paolo Di Canio.\n\nAfter a successful season on loan at St Andrew's, Caddis was hopeful of making the move permanent, only for Birmingham to fail with a string of offers.\n\nBut Blues' need for a right-back was enhanced by an injury to Neal Eardley in Saturday's 1-1 draw with Ipswich.\n\nWhere it all started Paul Caddis was given his debut for Celtic as a 19-year-old by Gordon Strachan in January 2008.\n\nSummer signing Eardley could be sidelined for several months after suffering knee ligament damage.\n\nAnd the cash-strapped, up-for-sale Championship club have now found the funds to complete the signing.\n\nIrvine-born Caddis, who still had a year to run on his contract at the County Ground, was thought be the target for several second-tier clubs.\n\nCaddis, who joined Swindon from Celtic in 2010, was made captain by Di Canio during the 2011-12 season, in which they won the League Two title.\n\nBut Caddis was stripped of the armband last summer and sent out on loan after Di Canio suggested that the defender had \"changed his attitude\".\n\nDespite struggling with a shoulder injury, Caddis made 28 appearances for Blues last season, mostly at right-back.\n\nMeanwhile, Birmingham, who cancelled striker Marlon King's contract on Friday, to reduce their wage bill, have released 19-year-old midfielder Eddy Gnahore by mutual consent."}]}