{"Paul Caddis signed permanently for Burton in 2018.": [{"url": "https://www.bradfordcityafc.com/news/2018/november/city-complete-caddis-signing/", "page_content": "Bradford City have completed the signing of Scottish international Paul Caddis.\n\nCaddis, who can operate at right-back and in midfield, has agreed a deal which will keep him at the Northern Commercials Stadium until at least the end of the season.\n\nThe 30-year-old has made more than 300 career appearances, enjoying spells with Celtic, Swindon, Birmingham, Bury and Blackburn over an 11-year professional career.\n\nIrvine-born Caddis said: “I am delighted to be joining the club, it is great to finally have the deal over the line.\n\n“I have been training with the team for the last few weeks, which has been well documented, and am now looking forward to getting stuck in and helping City move away from the relegation zone.\n\n“On paper we have a fantastic squad, packed full of talent and quality. But you don’t get results on paper and there is a great deal of hard work ahead.\n\n“I will bring a fair bit of experience to the team and will do all I can to help us get the results we need.\n\n“I have won League Two before and have earned promotion from League One, so I know what it is all about.\n\n“I have played my part in teams who have survived the threat of relegation and kicked on, which is what I want to achieve here - at the very least.”\n\nCity head coach David Hopkin, completing his second new signing since arriving at the club in September, said: “Paul is a fantastic addition for us and we are really pleased to have got him over the line.\n\n“He has been training with us for a couple of weeks and has looked really sharp. He is fit and raring to go.\n\n“Paul comes with a wealth of experience and I am looking forward to seeing what he will add to the team in the weeks and months ahead.”\n\nCaddis’ signing is subject to the club receiving the relevant clearances."}, {"url": "https://gossipgist.com/paul-caddis", "page_content": "Paul McLean Caddis is a Scottish professional football player who plays for League One club Swindon Town as a right-back or midfielder. He started playing football for the youth team of Celtic and made his competitive debut for the senior team on 27 January 2008. On 2 February 2009, he joined Dundee United on loan until the end of the season and made his debut for the club on 14 February 2009. In August 2010, he joined English League One club Swindon Town for an undisclosed fee. He spent the 2012-13 season on loan to Birmingham City and joined the club on a permanent contract in September 2013. After three-and-a-half seasons in his second spell with Birmingham, his contract was cancelled by mutual consent in January 2017. On 25 February 2017, he signed a short-term contract with EFL League One club Bury where he made 13 appearances for the club. In July 2017, he signed a two-year contract with another League One club Blackburn Rovers. In October 2018, he joined Bradford City of League One on trial after injuries left the club without a fit right back and signed a contract until the end of the 2018-19 season on 16 November 2018. On 15 November 2019, he rejoined Swindon Town on a short-term contract and made his first appearance for the club on 16 November 2019.\n\nOn the international level, he has represented Scotland at various age levels. He has represented Scotland at U19, U21, and the senior level. He made his senior international team debut on 24 March 2016.\n\nWhat is Paul Caddis Famous For?\n\nBeing a professional football player.\n\nHonours\n\nWon the 2011-12, 2019-20 League Two with Swindon Town.\n\nWhere is Paul Caddis From?\n\nPaul Caddis was born on 19 April 1988. His birth name is Paul McLean Caddis. His birthplace is Irvine, Scotland. Detail about his parents has been kept secret and not been disclosed yet. He is the younger brother of former Ayr United striker Ryan Caddis and older brother of former Alloa Athletic midfielder Liam Caddis and former Kilmarnock goalkeeper, Dylan. He attended St Joseph’s Academy in Kilmarnock. He holds Scottish nationality. He belongs to the white ethnicity. His religion is Christianity. His horoscope sign is Aries.\n\nSource: @thescottishsun\n\nPaul Caddis Club Career\n\nHe started playing football for the youth team of Celtic and made his competitive debut for the senior team on 27 January 2008 in a 1-0 victory away to Falkirk. On 20 February 2008, he made his home debut in a 2-3 loss against Barcelona in the Champions League last 16 first leg fixtures.\n\nFrom 2007-2010, he went on to play 17 times in the Scottish Premier League for Celtic.\n\nOn 2 February 2009, he joined Dundee United on loan until the end of the season and made his debut for the club on 14 February 2009 in a 1-1 draw against Inverness CT, playing the full 90 minutes on the right-wing. He made 11 appearances for the club.\n\nIn August 2010, he joined English League One club Swindon Town for an undisclosed fee and made his debut on 10 August 2010 in a 1-2 loss against Leyton Orient in the Football League Cup. During the 2010-11 season, he made 42 appearances as Swindon was relegated to League Two.\n\nIn the 2011-12 season, he extended his contract until 2014.\n\nSource: @gettyimages\n\nHe spent the 2012-13 season on loan to Birmingham City and joined the club on a permanent contract in September 2013. After three-and-a-half seasons in his second spell with Birmingham, his contract was cancelled by mutual consent in January 2017.\n\nFrom 2013-2017, he made 122 appearances and scored 15 goals for Birmingham City.\n\nOn 25 February 2017, he signed a short-term contract with EFL League One club Bury where he made 13 appearances for the club.\n\nIn July 2017, he signed a two-year contract with another League One club Blackburn Rovers where his contract was terminated by mutual consent on 31 August 2018.\n\nIn October 2018, he joined Bradford City of League One on trial after injuries left the club without a fit right back and signed a contract until the end of the 2018-19 season on 16 November 2018.\n\nOn 16 November 2018, he made his debut for the club in a 1-1 draw away to Peterborough United which put an end to the team's six-match losing streak. On 11 December 2018, he scored his first goal for the club in a 4-4 draw with Peterborough in the FA Cup, but his shot was saved as his team was eliminated on penalties.\n\nSource: @swindonadvertiser\n\nIn the 2018-19 season, he was one of eleven players to be released when their contracts expired at the end of the season where he made 27 league matches, mainly as a starter as Bradford City was unable to avoid relegation to League Two.\n\nOn 15 November 2019, he rejoined Swindon Town on a short-term contract and made his first appearance for the club on 16 November 2019 in a 3-2 win away to Salford City which took Swindon top of the table and soon established himself as a regular in the starting eleven.\n\nIn January 2020, he extended his contract to the end of the 2020-21 season. He was a key player for the Swindon team that went on to win the 2019-20 EFL League Two trophy decided on Points Per Game during the COVID-19 pandemic.\n\nOn 9 January 2021, he played his first game of 2021 in a 2-3 win against Ipswich in League One.\n\nSource: @gettyimages\n\nPaul Caddis International Career\n\nHe has represented Scotland at various age levels.\n\nHe has represented Scotland at U19, U21, and the senior level.\n\nIn March 2013, he was called into the senior squad as a late replacement to cover for the injured Russell Martin for the World Cup qualifier away to Serbia but remained an unused substitute.\n\nHe made his senior international team debut on 24 March 2016 in a 1-0 win against the Czech Republic by replacing goalscorer Ikechi Anya after 88 minutes.\n\nPaul Caddis Girlfriend\n\nLooking at his personal Life, Paul Caddis is an unmarried guy. The footballer is focusing on his professional career. He might be dating a beautiful girl at present or might be single. Any updates on his love life will be updated here.\n\nPaul Caddis Height and Weight\n\nPaul Caddis stands at a height of 1.70m i.e. 5 feet and 7 inches tall. He has a bodyweight of 67kg. He has an athletic body build. His eye color is dark brown and his hair color is grey. His sexual orientation is straight.\n\nPaul Caddis Net Worth and Salary\n\nPaul Caddis earns from his professional career as a football player. His income is from contracts, salaries, bonuses, and endorsements. In August 2010, he joined English League One club Swindon Town for an undisclosed fee. In September 2013, he joined Birmingham City on a permanent contract. In February 2017, he signed a short-term contract with EFL League One club Bury. In October 2018, he joined the Bradford City of League One until the end of the 2018-19 season. In November 2019, he rejoined Swindon Town on a short-term contract. As of 2021, his estimated net worth is €1 million-€5 million and his salary is £93,600, while his market value is around €400 Th."}, {"url": "https://www.hitc.com/en-gb/2018/10/31/as-free-agent-paul-caddis-trains-with-bradford-leeds-should-cons/", "page_content": "Leeds United need a short term plug at right-back.\n\nLeeds United are without Luke Ayling for the next two months after the right-back suffered a MCL sprain against Nottingham Forest.\n\nWith Gaetano Berardi also out with injury, Leeds are looking more stretched at the position than they would like.\n\nOne possible short term option is to look at signing a free agent, and one name who is available is currently training with local rivals Bradford City.\n\nPaul Caddis is currently training with the Bantams [via Telegraph and Argus] with a view to signing a new deal after leaving Blackburn Rovers.\n\nIn terms of what Leeds need, on a short term deal, Caddis could fill the void until Ayling returns.\n\nThe former Celtic defender spent four seasons at Birmingham between 2013 and 2017, making more than 140 Championship appearances.\n\nHe then signed with Blackburn Rovers for a season, playing 14 times as they won promotion.\n\nAt 30-years-old the former Scotland international could be a useful option as a squad player for Leeds until Ayling returns at the end of the year.\n\nLeeds cannot dip into the transfer market until January and their decision to only sign one defender in the summer leaves their squad stretched.\n\nCaddis could bolster them on a short term basis and give them the experience they need to help keep their strong run going.\n\n\n\n"}, {"url": "https://www.bbc.co.uk/sport/football/33611783", "page_content": "Last updated on .From the section Football\n\nCaddis began his career at Celtic before joining Swindon from Dundee United in August 2010\n\nBirmingham full-back Paul Caddis has signed a new contract extension which could keep him at the Championship club until 2018.\n\nThe 27-year-old has been at St Andrew's since joining from Swindon Town in September 2013 following a loan spell.\n\nCaddis scored an injury-time equaliser when Blues famously drew 2-2 at Bolton to avoid relegation to League One on the final day of the 2013-14 season.\n\nHis new deal is for two years, with the option to extend it by another season.\n\nCaddis, who has played 118 times for Blues and scored 12 goals, follows Clayton Donaldson, Demarai Gray and Koby Arthur in agreeing new contracts at St Andrew's this summer."}, {"url": "https://www.bbc.co.uk/sport/football/40669564", "page_content": "Last updated on .From the section Football\n\nPaul Caddis made 131 appearances for Birmingham City between 2013 and 2016\n\nBlackburn Rovers have signed former Birmingham City defender Paul Caddis on a two-year deal following a trial.\n\nThe 29-year-old Scotland international previously played under Tony Mowbray at Celtic and most recently for Bury on a short-term deal.\n\nCaddis played in Rovers' pre-season friendlies against Barrow, Sparta Prague and York City prior to signing.\n\nHe scored a 93rd-minute equaliser in Blues' draw at Bolton in 2013-14 which secured their Championship status.\n\nCaddis won his sole international cap so far as a substitute in Scotland's 1-0 win over the Czech Republic in March last year.\n\nFind all the latest football transfers on our dedicated page."}, {"url": "https://www.dailyrecord.co.uk/news/scottish-news/dna-test-shock-for-celtic-star-973874", "page_content": "Something went wrong, please try again later.\n\nInvalid email Something went wrong, please try again later.\n\nGet the latest top news stories sent straight to your inbox with our daily newsletter\n\nTEENAGE Celtic star Paul Caddis was tricked into thinking he was a dad, DNA tests have revealed.\n\nThe 19-year-old rising star was at Leanne McIntosh's side for baby Lewis's birth and even chose his name.\n\nShe told him she was 100 per cent sure he was the dad. But DNA tests proved that Lewis was really another man's son.\n\nCaddis had provided for the little boy since he was born in February and pals said last night he was confused and angry.\n\nOne added: \"He was taken for a ride by this girl, who was only interested in his money and fame. She told him there was no chance it could be anyone else.\"\n\nCaddis said last night: \"I've had a difficult time recently and I want to put all that behind me.\"\n\nLeanne, 18, told Caddis she was pregnant after a one-night stand.\n\nThey met through acquaintances in Kilmarnock, their home town.\n\nAnother of the footballer's pals said: \"This girl was a one-night fling and nothing more. Young footballers are always getting girls throwing themselves at them and Paul has learned the hard way at a young age to be careful.\n\n\"He was trying to do the brave and decent thing because he's a decent young boy.\"\n\nCaddis took advice after Leanne told her story to a newspaper.\n\nThe pal said: \"He hated people at Celtic knowing about his private life through a newspaper story but they were really supportive.\"\n\nCaddis, who has been a member of the Scotland under-21 squad, paid for the DNA tests.\n\nThe friend added: \"She was still professing that it would have to be an immaculate conception but the results came through and suggest otherwise.\n\n\"Paul was pretty angry and hurt because he had been with the baby every day.\n\n\"He had given the baby his name and looked in his eyes, all the time thinking it was his son.\"\n\nThe friend revealed that Caddis had found out the truth just a day after shelling out for a pram.\n\nThe pal added: \"The whole thing has been like an episode of the Jeremy Kyle show. Paul was adamant he would do the right thing if the baby was his.\"\n\nLeanne is said to have made her claims immediately after Caddis made his first appearance for the Celtic first team in February.\n\nHe starred in a 5-1 rout of his home town team Kilmarnock in the Scottish Cup.\n\nHe then made his home debut on February 20 against Barcelona in the Champions League.\n\nLast night, Caddis refused to discuss the DNA results.\n\nHe said: \"My priority is my football and I'm looking forward to doing well at Celtic.\""}, {"url": "https://www.celebsagewiki.com/paul-caddis", "page_content": "Age, Biography and Wiki\n\nPaul Caddis was born on 19 April, 1988 in Irvine. Discover Paul Caddis's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 35 years old?\n\nPopular As N/A Occupation N/A Age 35 years old Zodiac Sign Aries Born 19 April 1988 Birthday 19 April Birthplace Irvine Nationality\n\nWe recommend you to check the complete list of Famous People born on 19 April. He is a member of famous with the age 35 years old group.\n\nPaul Caddis Height, Weight & Measurements\n\nAt 35 years old, Paul Caddis height is 1.7 m and Weight 67 kg.\n\nPhysical Status Height 1.7 m Weight 67 kg Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nHe is currently single. He is not dating anyone. We don't have much information about He's past relationship and any previous engaged. According to our Database, He has no children.\n\nFamily Parents Not Available Wife Not Available Sibling Not Available Children Not Available\n\nPaul Caddis Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Paul Caddis worth at the age of 35 years old? Paul Caddis’s income source is mostly from being a successful . He is from . We have estimated Paul Caddis's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income\n\nPaul Caddis Social Network\n\nInstagram Linkedin Twitter Paul Caddis Twitter Facebook Wikipedia Paul Caddis Wikipedia Imdb\n\nTimeline"}, {"url": "https://www.hitc.com/en-gb/2018/11/16/report-paul-caddis-could-join-bradford-city-on-friday-three-mont/", "page_content": "The former Blackburn Rovers right-back is said to be due at Bradford City this morning.\n\nPaul Caddis could join Bradford City on Friday, three months after leaving Blackburn Rovers, according to the Telegraph and Argus.\n\nThe newspaper reports that Caddis, who had his Blackburn contract terminated by mutual consent, is due to hold further talks and potentially undergo a medical with Bradford.\n\nBut a deal must be concluded by 12pm (midday) if the right-back is to be eligible for Saturday’s trip to Peterborough United.\n\nCaddis, whose final game for Blackburn came in the EFL Cup in August, has been training with Bradford since the end of last month.\n\nThe once-capped Scotland international began his career at Celtic, before spells at Dundee United, Swindon Town, Birmingham City, Bury and Blackburn.\n\nCaddis would become the second free signing made by the new Bradford manager, David Hopkin, after a third Scot, Jim O’Brien."}, {"url": "https://www.capology.com/player/paul-caddis-32252/profile/", "page_content": "Paul Caddis Salary Profile Paul Caddis (Defense) has earned approximately $783,489 gross in his playing career. He last played for Blackburn (Championship) in 2018-2019. Base salary estimates are not inclusive of bonuses or incentives. Actual salaryies may vary. Coverage may be limited or incomplete.\n\nCurrencyTry Free EUR GBP USD Salary Try Free Gross Net Status Inactive Career Adj. (2023) Age DOB Scotland Country Position D Earnings History Find career earnings by season, along with figures adjusted for inflation. Historical coverage may be limited or incomplete. Career\n\nPosition\n\nClub History Find salary and contract information for all clubs below. Historical coverage may be limited or incomplete.\n\nEarnings History Find career earnings by season, along with figures adjusted for inflation. Historical coverage may be limited or incomplete. Season Gross P/W\n\n(EUR) Gross P/Y\n\n(EUR) Adj. Gross\n\n(2023, EUR) Gross P/W\n\n(GBP) Gross P/Y\n\n(GBP) Adj. Gross\n\n(2023, GBP) Gross P/W\n\n(USD) Gross P/Y\n\n(USD) Adj. Gross\n\n(2023, USD) Net P/W\n\n(EUR) Net P/Y\n\n(EUR) Adj. Net\n\n(2023, EUR) Net P/W\n\n(GBP) Net P/Y\n\n(GBP) Adj. Net\n\n(2023, GBP) Net P/W\n\n(USD) Net P/Y\n\n(USD) Adj. Net\n\n(2023, USD) Club"}, {"url": "https://www.bbc.co.uk/sport/football/22041064", "page_content": "Last updated on .From the section Football\n\nSwindon have turned down bids from Birmingham City for Paul Caddis, BBC Wiltshire has learned.\n\nThe 24-year-old defender was sent out on loan to the Blues last August following a public spat with then Robins manager Paolo Di Canio.\n\nBirmingham are keen to sign Caddis permanently but financial issues mean they have only been able to offer Swindon a deal in instalments.\n\nThe Scotsman has a year remaining on his contract at the County Ground.\n\nIt is thought the Blues have tabled three bids - the latest offer being £125,000 with a further £125,000 over the coming months.\n\nBut Swindon want immediate payment and are demanding around £275,000 for the player, who captained Town to the League Two title last season.\n\nCaddis fell out with Di Canio at the start of the campaign and, after being dropped as skipper, moved to St Andrews on a season-long swap deal with striker Adam Rooney.\n\nThe former Celtic man has since made 22 appearances for the Championship outfit.\n\nHe was called up to the Scotland squad last month, and was an unused substitute in their defeat by Serbia."}]}