{"Winger released four albums between 1988 and 1993.": [{"url": "https://www.allmusic.com/artist/winger-mn0000678650/discography", "page_content": "Discography Winger Follow Artist +\n\nOne of the leading hair metal bands of the 1980s, they perfected the art of following fiery rock anthems with monster power ballads.\n\nRead Full Biography"}, {"url": "https://www.discogs.com/artist/302123-Winger", "page_content": "Profile:\n\nHair / Glam Metal (Heavy Metal) band from New York (USA).\n\n\n\nThe band was formed in 1987 by Kip Winger. They were well known for their songs \"Easy Come, Easy Go\", \"Headed For A Heartbreak\", \"Madalaine\", \"Miles Away\" and \"Seventeen\"."}, {"url": "https://rockandrollglobe.com/rock/it-all-comes-back-around-the-return-of-winger/", "page_content": "An exclusive chat with Kip Winger about the band’s new album Seven and more\n\nOn May 5, hard rockers Winger released Seven, their – you guessed it – seventh studio album.\n\nThe band members haven’t put out anything together since 2014’s Better Days Comin’, and frontman Kip Winger admits that he was bit nervous as this latest release date approached. “Oh God, it’s always so stressful – it’s just like the first time I put out an album. It’s always high stakes. You wonder what people think,” he says.\n\nThe long gap between albums happened because Winger himself has been pursuing an acclaimed career in classical music, while guitarist Reb Beach has spent time playing with Whitesnake. The pandemic also caused significant delays.\n\nNow that Seven is finally out, Winger can finally breathe.\n\n“I’m really happy with the way it sounds and the content of the record, and I’m proud of the fact that there’s no filler,” he says. “I feel like it’s right in the zone of where I want it to be, somewhere between our first record [1988’s Winger], which had a certain thing to it, and our [1993] third record, Pull, which was a huge album for us, and really was the beginning of the sound of the band, in my mind. This record is really a great cross collateralization of all the stuff that we’ve done, wrapped up into one thing.”\n\nThe band, which includes all four original members–Winger on bass, guitarist Reb Beach, multi-instrumentalist Paul Taylor and drummer Rod Morgenstein–plus longtime third guitarist John Roth, recorded the new album in Nashville, where Winger has lived for several years. This time, he produced it himself. “When it comes to my own music, I’m pretty confident about knowing where to finish [a song] – because I also know that after a point, diminishing returns doesn’t help you much,” he says.\n\nHe also felt confident about the material, even though it’s been a long time since he recorded a rock album. “I’m replete with ideas,” he says. “A long time ago, I would get stumped for ideas and have nowhere to go. It wasn’t until I really started studying and learning other things and stepping out of my comfort zone that I really started flourishing in the musical idea department.”\n\nHe’s referring to his years studying classical composition at the University of New Mexico, starting in 1997. By that time, “I had already had a full career in music, so I took what I had known already and applied these new things to what I already did, and it created an incredibly fertile ground to work in.”\n\nIn truth, though, Winger had begun studying music his entire life. “My parents were in a band. They put a guitar in my hand when I was five. I did my first professional gig at eight years old, and my two elder brothers and I played in a band [together] from the time I was five years old ’til the time I was 20 years old.” That means, and sixty-one years old, he’s been a working musician for more than five decades.\n\nThough he started out as a guitarist, he switched to bass after becoming a fan of Beatles bassist Paul McCartney. “And my brother grabbed the guitar, and my other brother grabbed the drums, so it was an obvious choice for me to play bass to round out the band,” he says.\n\nFrustrated that the band with his brothers wasn’t achieving significant success, Winger quit and moved from his native Colorado to New York City. His skills earned him a spot in shock rocker Alice Cooper’s band, and he stayed on for two years. Though it was a good job, he left in 1987 (with Cooper’s blessing) so he could form his own eponymous band.\n\n“I felt at the time it was like, ‘Once a side man, always a side man,’ and I needed to make the break right then,” Winger says. “In some ways it was really stupid. I gambled on myself and won, but I could have just as easily gambled and lost.”\n\nVIDEO: Winger “Madalaine”\n\nForming the band definitely turned out to be the right call, as their first two albums, 1988’s Winger and 1990’s In the Heart of the Young, both earned platinum sales status. Several of their singles – including “Madalaine,” “Seventeen,” “Headed for a Heartbreak,” “Miles Away,” and “Easy Come Easy Go” – were ubiquitous on radio and MTV. Although the grunge era caused the band to take a break during the 1990s, Winger says that they’ve retained a loyal following because of their emotional connection to the music.\n\n“Nothing makes somebody feel something more than music,” Winger says. “The only thing that you ever remember about anything is what it makes you feel like. If you go to the beach, you don’t remember what it looks like as much as how it makes you feel. If you watch a movie, it’s always about the lingering feeling. If you get in a fight with somebody, maybe you’ll remember what they said, and it’ll piss you off or make you cry or whatever it is – it’s always about the emotion.”\n\nIn the past, the band’s willingness to tap into that emotion has sometimes earned them derision from other hard rock musicians. Metallica, in particular, took public swipes at Winger, leading some fans to follow suit.\n\n“A lot of rock fans hated us and thought we were wimpy. We took a lot of shit,” Winger says. “But I think in a lot of ways, our music actually does stand the test of time, and there’s a lot more under the hood than what the general consensus of the pop world would think of ‘Hey, he’s just Mister ‘Seventeen.’ I mean, anybody that knows the difference knows that it’s way deeper than all of that.”\n\nThese days, he adds, “We’re getting a lot more respect. It’s kind of come full circle. And the only reason that’s happened is that I stayed the course and I just kept trying to become a better musician. I didn’t pay attention to any of it, as much as I could. I just realized there was nothing I could do to change it. And so the things that you can’t change, you can’t dwell on them in a way that’s going to ruin your life. You just have to focus on the things that you are in control of – and the only thing I was in control of was the music that I was writing. Nothing else.”\n\nWinger was vindicated when, in 2017, he was nominated for a Grammy award in classical composition.\n\n“Once that happened, I never looked back,” he says. “That basically set the record straight on whether I’m a good musician or not. So anybody that wants to imagine that I don’t know what music is, they can go ahead and just keep imagining that, but they’re just completely out of touch with reality.”\n\nFortunately, he knows there are many fans who’ve defended the band, then and now – and soon, those loyal followers will get a chance to see Winger in person when the band embark on an extensive string of tour dates – some headlining, and others performing with Steel Panther or Tom Keifer Band.\n\nWinger himself promises fans that they’ll have a blast at these shows: “I can hit every note I’ve ever been able to hit. People heard ‘Seventeen’ in high school and they’re coming to hear that song and I don’t want to let them down.” In order to keep performing at this level, he says he’s “big on health and working out, and working on my voice. I haven’t had a drink since 2012.”\n\nGiving back to the fans, with good gigs and new music, is Winger’s way of showing gratitude.\n\n“I appreciate everybody hanging in with us,” he says. “This is our 35th anniversary year, so we’re really happy we’re still standing!”"}, {"url": "https://xsrock.com/winger-where-are-they-now/", "page_content": "Winger released their debut album “Winger in 1988 and it scored the band its first platinum-selling album. Winger released its second album In the Heart of the Young in 1990 and it also went platinum. Since then the band has released the following albums: Pull (1993), IV (2006), Karma (2009), and Better Days Comin’ (2014). The band is currently in the studio finishing a new album for release in the near future.\n\nOur article about Winger and Beavis & Butthead has been one of the most viewed in XS ROCK’s history. You can read it here: https://xsrock.com/how-beavis-butthead-ruined-wingers-coolness-at-the-peak-of-their-popularity/\n\nAnd now for the big question, Winger…Where Are They Now?\n\nKip Winger\n\nKip Winger (real name Charles Frederick Kip Winger) got his first break co-writing the song Bang Bang for Kix’s “Midnite Dynamite” album and playing bass and providing backup vocals on the Alice Cooper albums “Constrictor” and “Raise Your Fist And Yell”. Alice Cooper suggested that the band change their name to “Winger” from “Sahara”, which is what the band was using n the early days. Winger found success with two platinum albums, but their third album “Pull” didn’t meet the sales of the albums before it and the band went in different directions pursuing solo careers for quite some time. Kip Winger married Beatrice Richter in 1991 but tragedy would strike in 1996 when she was killed in a car accident. Kip Winger released the following solo albums: This Conversation Seems Like a Dream (1997), Down Incognito (1999), Songs from the Ocean Floor (2001), From the Moon to the Sun (2008), Ghosts – Suite No. 1 (2010) and Conversations with Nijinsky (2016). In 2019 Kip composed the soundtrack to “Get Jack” a musical thriller about Jack The Ripper. Kip is currently working on finishing the latest Winger album.\n\nhttps://www.kipwinger.com/\n\nReb Beach\n\nWhen Winger disbanded after the “Pull” album, Reb Beach (real name Richard Earl Beach Jr.) stayed very busy playing guitar for Alice Cooper and joined Dokken for the album “Erase The Slate” and also performed on their live album “Live From The Sun”. He would then go on to Whitesnake, where he still remains a member of the band as well as a member of Winger. Reb also has been in several so-called supergroups featuring all-star members from other well-known bands like The Mob and Black Swan. Reb Beach has also released several solo albums showcasing his guitar virtuoso skills with “The Fusion Demos”, “Masquerade”, and “A View From The Inside”.\n\nhttp://www.rebbeach.com\n\nRod Morgenstein\n\nPrior to joining Winger, drummer and percussionist Rod Morgenstein played with The Dixie Dregs and Steve Morse’s solo band. He’s also been involved as a member of several progressive rock groups like Platypus, Jelly Jam, and Rudess/Morgenstein Project alongside Dream Theater’s Jordan Rudess.\n\nhttp://www.rodmorgenstein.com/\n\nPaul Taylor\n\nPaul Taylor (real name Paul Horowitz) was playing in Alice Cooper’s solo band alongside Kip Winger back in 1987. The two would work on original songs in their downtime and would later use many of those songs for the first Winger album. Paul played on the first two Winger albums Winger (1988) and In the Heart of the Young (1990). He has rejoined the band for different tours over the years. He played on Alice Cooper’s “Fistful Of Alice” (1997) and former Journey singer Steve Perry’s solo album “For the Love of Strange Medicine” (1994)\n\nJohn Roth\n\nGuitarist John Roth joined Winger after working with Kip Winger on several of his solo albums. Roth has played on the following Winger albums: Winger IV (2006)\n\nWinger Live (2007), Karma (2009) Better Days Coming (2014). John Roth got his big break playing for Black Oak Arkansas when he was just 19. He has also toured and performed with the Starship, Eddie Money, Mike Reno of Loverboy, Taylor Dane, and more. He has also been in the critically acclaimed band Giant.\n\nhttp://johnroth.com/"}, {"url": "https://www.discogs.com/release/4411604-Winger-Winger", "page_content": "Printed in U.S.A. by WEA Manufacturing INC.\n\nTrack 11 is a bonus track\n\n\n\nCatalog number on spine and back: A2 81867\n\nCatalog number on disc: A2-81867\n\nCatalog number in booklet: 81867-2"}, {"url": "https://www.allmusic.com/artist/winger-mn0000678650/biography", "page_content": "Biography Winger Follow Artist +\n\nOne of the leading hair metal bands of the 1980s, they perfected the art of following fiery rock anthems with monster power ballads.\n\nRead Full Biography"}, {"url": "https://www.last.fm/music/Winger/+wiki", "page_content": "Winger is an American rock band that has combined elements of glam metal and progressive metal. Formed in New York City, Winger gained popularity during the late 1980s and early 1990s. The band's two platinum albums, Winger and In the Heart of the Young, along with charting singles \"Seventeen,\" \"Headed for a Heartbreak\" and \"Miles Away,\" put them on the top of the charts by the early 1990s. In 1990, the band was nominated for an American Music Award for \"Best New Heavy Metal Band.\" As the music scene changed in the early to mid-1990s due to the popularity of grunge, their success faded after their third release Pull.\n\nWinger disbanded in 1994. In 2001 they reunited and have since conducted several successful tours. In 2006, the band's 1993 touring line-up (minus Paul Taylor but including John Roth) reunited to record the band's first studio album in over 13 years, IV, and toured in support of the album into 2008.\n\nIn 2009, the band released their fifth album, Karma. As of 2013, Winger was performing on mini-tours, festivals and private events. Their most recent album, Better Days Comin', came out in 2014.\n\nHistory:\n\nMain career and break-up (1987–1994).\n\nThe debut album, Winger, was released on August 10, 1988 on Atlantic Records. The record was a success, achieving platinum status in the United States, and gold status in Japan and Canada. On February 11, 1989, the album peaked at number 21 on the Billboard 200, and was in various places on the chart for 63 weeks. Radio and MTV hits from the album included \"Madalaine\", \"Seventeen\", \"Headed for a Heartbreak\" and \"Hungry\". In 1990, the band was nominated for an American Music Award for \"Best New Heavy Metal Band\".\n\nShortly after that tour, Winger released its second album In the Heart of the Young, which went 1-and-1/2 platinum in the U.S. and gold in Japan. Hit radio tracks and MTV videos included \"Can't Get Enuff\", \"Miles Away\" and \"Easy Come Easy Go\".\n\nWinger followed the release of its second album with a 13-month world tour, playing over 230 dates with Kiss, Scorpions, ZZ Top, Extreme and Slaughter. Paul Taylor left the band after the tour, citing exhaustion after years of touring. Their third studio album, Pull, produced by Mike Shipley, was recorded in 1992/1993 as a three-piece band. It was originally to be called Blind Revolution Mad, after the opening song. Reportedly, Kip Winger, anticipating that critics would dismiss the album out of hand, renamed it Pull as a tongue-in-cheek reference to the CD being used by critics as a skeet-shooting target. The album was not as successful as the previous albums sales wise, but gained solid reviews. On the following tour, John Roth was called in to replace Paul Taylor on rhythm guitar. The album coincided with the rise of grunge, which swept aside the brand of melodic pop metal that Winger represented.\n\nIn the 1990s, Winger was subject to mockery from MTV's animated series Beavis and Butt-head. Series creator Mike Judge later revealed that he had been incorrectly informed that Kip Winger had asked the network not to make jokes about the band on the series, which led to further jokes about the band, but later learned from Winger himself that he had never made any such stipulation. “Stewart”, an early character from the TV show, wore a Winger t-shirt during the shows original run on MTV during the early 90s.\n\nAfter disbanding in 1994, bassist/lead vocalist Kip Winger went on to a solo career, guitarist Reb Beach went on to touring projects with artists Dokken, Alice Cooper and has held a permanent guitar spot in Whitesnake since 2002. The band's other members pursued or resumed careers as session musicians.\n\nReunions (2001–present)\n\nIn 2001, it was announced that all original members of the band would return to the studio to record the song \"On the Inside\" for The Very Best of Winger. In 2002, all five members embarked on a reunion tour of the U.S. and Canada on a bill with Poison. According to Kip Winger, in a 2008 interview with rock and roll comic C.C. Banana, it was important to include all five members because \"it was the big, long-awaited reunion so I wanted to include everybody who had ever been in the band.\" In 2003, it was confirmed that activity had been halted due to Reb Beach's touring commitment with Whitesnake as well as his solo album \"Masquerade\" and involvement with \"super-group\" project The Mob with King's X frontman Doug Pinnick and Night Ranger drummer Kelly Keagy.\n\nOn July 16, 2005, it was announced that Kip Winger would perform as the lead singer for the Alan Parsons Live Project at the Common Ground Music Festival in Lansing, Michigan. In May 2006, it was confirmed that Winger had reformed without one of its original members Paul Taylor, to record another album and tour Europe. The album, IV, was released in Europe in October and the nine-country \"Winger IV Tour\" ran in the last two weeks of the same month.\n\nOn February 25, 2008, the band performed in Providence, Rhode Island, as part of a benefit for survivors of the Station nightclub fire. The concert, along with other artists was debuted on VH1 Classic on March 23, 2008. In late 2009, it was confirmed that Winger would record a fifth album Karma, with a tour to support it. Most recently, John Roth became the guitarist for Giant and would appear on their forthcoming album Promise Land then set for release in February/March of 2010.\n\nWinger released their sixth studio album titled, Better Days Comin' in April 2014, after teasers were published on Kip Winger's website and on the official Winger Facebook page as well.\n\nAs of late 2018, Winger was playing club dates. They were scheduled on Dec 29, 2018 in Westland, Michigan.\n\nStyle and influences.\n\nThe band's musical style combines elements of glam metal and progressive metal. Kip Winger, in description of the band's musical ability and style, said, \"Our band was known to musicians, and a lot of musicians showed up to see me play — watching, trying to figure out how I'm playing. We were like the 'hair band' (version of) Dream Theater.\""}, {"url": "https://www.discogs.com/master/274746-Winger-Winger", "page_content": "juvat270 May 19, 2021 Report\n\nEdited 2 years ago\n\nI've bought a few Friday Music releases and while the physical quality of the albums has always been top notch, the sound quality always leaves something to be desired. The first Friday Music release I ever bought was Ratt's \"Out of the Cellar\". Even with not having, nor having ever heard an original pressing of said album at the time that I purchased it, it just didn't sound \"right\". It was somewhat flat and muddy sounding. This was confirmed when I eventually did get an original pressing of that record. Night and day difference. The original was loud and dynamic. Skid Row's debut was slightly better in the sound department, but still doesn't compare to an original. And that brings me to WInger's Debut. Call me an eternal optimist, but I keep thinking with each new Friday Music release its going to get better. Unfortunately Winger suffers from the same problem as the others, the sound. All the dynamics having been sucked out, it just sounds flat and lifeless. I've noticed that all these Friday releases are mastered by Joe Reagoso. Other than being the owner of Friday Music, he doesn't seem to be any one of any note as far as mastering engineers go. Certainly not in the same company as Kevin Gray and Robert Ludwig, et al. And a quick search on the internet seems to confirm this. So perhaps the blame should fall on him for the sub-par sound quality. Perhaps Mr. Reagoso's hearing isn't the greatest. Perhaps he just has no idea what hes doing when it comes to mastering. Or maybe he really does think these releases sound good to him. Whatever the reason, I just can't recommend any of these releases on sound quality alone.\n\n\n\nTL;DR....its not god-awful and if you can't find an original this release this should serve as a decent player copy. However, as tired and cliche as its become...an original first pressing blows this away in every regard."}, {"url": "https://www.highresaudio.com/en/album/view/dp64ov/winger-winger-remaster", "page_content": "Info for Winger (Remaster)\n\nRather unfairly Winger were lumped into the '80s hair metal scene. However, it was an easy mistake to make considering Kip Winger's drop dead gorgeous looks and the band's penchant for penning memorable and melodic rock of an altogether addictive nature. However, beneath the fancy looks was a band of enormous depth, containing members that had already notched up years of experience and played with several demanding and high caliber artists. Originally issued in 1988, and produced by man of the moment Beau Hill, the album caused an immediate stir with it's seductive blend of heavy, yet melodic, rock suggesting that Winger's talent was very much in the same realms as Bon Jovi and Foreigner. Indeed, such was the excitement surrounding the album that it achieved platinum status and made them a fixture on MTV, all helped by their good looks and fully formed songs such as 'Madalaine', 'Hungry', 'Headed for a Heartbreak' (a Top 20 US hit single) and the superhumanly catchy 'Seventeen' ; a tour de force of perfection.\n\n„Since Winger was marketed largely on the looks of lead singer Kip Winger, and since their sleazy rockers and lovelorn ballads cover the same old pop-metal territory, the band's high-quality musicianship tended to get overlooked. Guitarist Reb Beach earned wide praise from other musicians, and he, ex-Dixie Dregs drummer Rod Morgenstein, and keyboardist Paul Taylor bring a distinct progressive metal influence to many of the tunes on Winger. Even if the lyrics are standard issue, the album is impeccably composed, crafted, and played, with melodies, riffs, and guitar solos taking off in unexpected directions and keeping the listener slightly off balance -- no easy task in the cookie-cutter hair metal genre. The only misstep is an overdone, tight-assed, totally misguided recasting of 'Purple Haze.' Otherwise, Winger is a surprisingly accomplished debut.“ (Steve Huey, AMG)\n\nKip Winger, vocals, bass, keyboards, string arrangements\n\nReb Beach, guitars, vocals\n\nPaul Taylor, keyboards, vocals\n\nRod Morgenstein, drums, vocals\n\nAdditional musicians:\n\nDweezil Zappa, left side guitar solo on 'Purple Haze'\n\nBeau Hill, vocals\n\nIra McLaughlin, vocals\n\nSandra Park, strings\n\nRebecca Young, strings\n\nHae Young Ham, strings\n\nMaria Kitsopoulos, strings\n\nRecorded 1988 at Atlantic Studios, New York City\n\nProduced by Beau Hill\n\nDigitally remastered\n\n"}], "Winger had several hit singles, including 'Seventeen' and 'Headed for a Heartbreak'.": [{"url": "https://genius.com/artists/Winger", "page_content": "About Winger\n\nWinger are an American heavy metal band that has combined elements of glam metal and progressive metal. Formed in New York City, Winger gained popularity during the late 1980s and early 1990s. The band’s two platinum albums, Winger and In the Heart of the Young, along with charting singles “Seventeen”, “Headed for a Heartbreak” and “Miles Away”, put the band on the top of the charts by the early 1990s. In 1990, the band was nominated for an American Music Award for “Best New Heavy Metal Band”. As the music scene changed in the early to mid-1990s due to the popularity of grunge, the band faded after their third release Pull.\n\nSouce Wikipedia Article https://en.wikipedia.org/wiki/Winger_(band)"}, {"url": "https://blabbermouth.net/news/winger-has-written-seven-songs-for-heavy-catchy-and-progressive-new-album/", "page_content": "In a new interview with the 213Rock Podcast, WINGER guitarist Reb Beach spoke about the progress of the songwriting sessions for the band's new studio album. The disc, which is tentatively due next summer, will be the follow-up to 2014's \"Better Days Comin'\".\n\n\"We've written about seven songs for the new album,\" he said. \"It sounds great. It's WINGER — heavy riffs with big vocals. Very catchy songs and very heavy stuff — very progressive.\"\n\nIn early November, Beach told the \"Pat's Soundbytes Unplugged\" podcast that he and frontman Kip Winger had written 11 songs for WINGER's next album, but that Kip \"threw away six of 'em, saying that this has to be like the first BOSTON record where every song is undeniable. And he just wants it to be progressive and like nothing he's hard before,\" he said. \"I brought him these riffs that are just straight-ahead rock riffs, and he said, 'I already know what the next three chords are gonna be after I've heard three chords.'\n\n\"We're going for something that's poppy and sing-along stuff yet cool, heavy, progressive riffs — kind of like [2009's] 'Karma',\" Reb explained. \"That's what we're going for.\"\n\nThis past spring, WINGER invited artists, friends and fans — including Alice Cooper and members of SCORPIONS, STEELHEART and WARRANT — to sing along to \"Better Days Comin'\", the title track of the band's sixth studio album. An official music video for the new version of the song was made available in late April.\n\nWINGER formed in the late 1980s and soared to immediate success with its 1988 self-titled release. The album spawned the hit singles \"Seventeen\" and \"Headed For A Heartbreak\" and achieved platinum sales status. \"Winger\" also stayed on The Billboard 200 chart for over 60 weeks where it peaked at #21. Their next album, \"In The Heart Of The Young\", also achieved platinum status behind the singles \"Can't Get Enuff\" and \"Miles Away\". The change in musical climate of the mid-'90s, compounded with unprovoked ridicule on MTV's popular \"Beavis And Butt-Head\" show, led the band to go on hiatus in 1994. In 2001, WINGER reunited and has not looked back since. Kip also earned a 2016 Grammy nomination for the classical album \"C.F. Kip Winger: Conversations With Nijinsky\", recorded with the San Francisco Ballet Orchestra."}, {"url": "https://ultimateclassicrock.com/winger-career-collapsed/", "page_content": "In 1993, Winger had every reason to believe their third album, Pull, was going to be a big hit. Guitarist Reb Beach was so confident that he “banked” on the record going gold – and was forced into a large-scale U-turn when it didn’t happen.\n\nThe band's self-titled debut LP had introduced the group to the world via the hit singles “Headed for a Heartbreak” and “Seventeen,” then the follow-up, In the Heart of the Young, continued the streak with “Can't Get Enuff,” “Easy Come Easy Go” and “Miles Away.” But by the time Pull was ready for release, the grunge revolution had changed everything.\n\nIn Tom Beaujour and Richard Bienstock’s new book Nothin' but a Good Time: The Uncensored History of the '80s Hard Rock Explosion, Winger noted that their rise to fame had come thanks to MTV’s support for their “Madalaine” video and an opening slot on tour with Scorpions. “We got some good touring out of our second record, but the writing was on the wall before it came out,” frontman Kip Winger said. “Bad timing.”\n\nKeyboardist and guitarist Paul Taylor added: “We were starting to notice, like, wow, where’s everybody at the shows? … I remember it finally hit home in Cincinnati. We had a night off, and I went to see Extreme and Cinderella with David Lee Roth at the Riverbend [Music Center]. And it was half-full. … David Lee Roth was the ultimate rock star. And now the place is half-empty? I was like, ‘Whoa. Something's up.’ Because two years prior it would've been sold out.”\n\nBeach agreed with Winger’s “bad timing” analysis. “If we had come out in ’86, I’m sure I’d be a very rich man,\" he explained. \"But we came out in '89, right at the tail end. We didn't know it was gonna end. On the third album we were gonna get big publishing advances. If it had done well, I would've made a lot of money. And I banked on that. I figured, it's gotta do well! The last one sold a million and a half records. This one's gotta at least go gold.”\n\nSo, he \"bought a new house and moved the whole fam to Florida. ‘C’mon, kids! We’re moving to Florida!’ I got a house on a lake with a pool, and you could jump from the pool right into the lake! It was incredible. I was only there for eight months before I had to sell that house. That's how quickly it all went south.”\n\nThe band split in 1994, before reforming briefly in 2001 then more permanently in 2006. They’ve released three more albums since Pull, the most recent being 2014’s Better Days Comin’."}, {"url": "https://www.last.fm/music/Winger/+wiki", "page_content": "Winger is an American rock band that has combined elements of glam metal and progressive metal. Formed in New York City, Winger gained popularity during the late 1980s and early 1990s. The band's two platinum albums, Winger and In the Heart of the Young, along with charting singles \"Seventeen,\" \"Headed for a Heartbreak\" and \"Miles Away,\" put them on the top of the charts by the early 1990s. In 1990, the band was nominated for an American Music Award for \"Best New Heavy Metal Band.\" As the music scene changed in the early to mid-1990s due to the popularity of grunge, their success faded after their third release Pull.\n\nWinger disbanded in 1994. In 2001 they reunited and have since conducted several successful tours. In 2006, the band's 1993 touring line-up (minus Paul Taylor but including John Roth) reunited to record the band's first studio album in over 13 years, IV, and toured in support of the album into 2008.\n\nIn 2009, the band released their fifth album, Karma. As of 2013, Winger was performing on mini-tours, festivals and private events. Their most recent album, Better Days Comin', came out in 2014.\n\nHistory:\n\nMain career and break-up (1987–1994).\n\nThe debut album, Winger, was released on August 10, 1988 on Atlantic Records. The record was a success, achieving platinum status in the United States, and gold status in Japan and Canada. On February 11, 1989, the album peaked at number 21 on the Billboard 200, and was in various places on the chart for 63 weeks. Radio and MTV hits from the album included \"Madalaine\", \"Seventeen\", \"Headed for a Heartbreak\" and \"Hungry\". In 1990, the band was nominated for an American Music Award for \"Best New Heavy Metal Band\".\n\nShortly after that tour, Winger released its second album In the Heart of the Young, which went 1-and-1/2 platinum in the U.S. and gold in Japan. Hit radio tracks and MTV videos included \"Can't Get Enuff\", \"Miles Away\" and \"Easy Come Easy Go\".\n\nWinger followed the release of its second album with a 13-month world tour, playing over 230 dates with Kiss, Scorpions, ZZ Top, Extreme and Slaughter. Paul Taylor left the band after the tour, citing exhaustion after years of touring. Their third studio album, Pull, produced by Mike Shipley, was recorded in 1992/1993 as a three-piece band. It was originally to be called Blind Revolution Mad, after the opening song. Reportedly, Kip Winger, anticipating that critics would dismiss the album out of hand, renamed it Pull as a tongue-in-cheek reference to the CD being used by critics as a skeet-shooting target. The album was not as successful as the previous albums sales wise, but gained solid reviews. On the following tour, John Roth was called in to replace Paul Taylor on rhythm guitar. The album coincided with the rise of grunge, which swept aside the brand of melodic pop metal that Winger represented.\n\nIn the 1990s, Winger was subject to mockery from MTV's animated series Beavis and Butt-head. Series creator Mike Judge later revealed that he had been incorrectly informed that Kip Winger had asked the network not to make jokes about the band on the series, which led to further jokes about the band, but later learned from Winger himself that he had never made any such stipulation. “Stewart”, an early character from the TV show, wore a Winger t-shirt during the shows original run on MTV during the early 90s.\n\nAfter disbanding in 1994, bassist/lead vocalist Kip Winger went on to a solo career, guitarist Reb Beach went on to touring projects with artists Dokken, Alice Cooper and has held a permanent guitar spot in Whitesnake since 2002. The band's other members pursued or resumed careers as session musicians.\n\nReunions (2001–present)\n\nIn 2001, it was announced that all original members of the band would return to the studio to record the song \"On the Inside\" for The Very Best of Winger. In 2002, all five members embarked on a reunion tour of the U.S. and Canada on a bill with Poison. According to Kip Winger, in a 2008 interview with rock and roll comic C.C. Banana, it was important to include all five members because \"it was the big, long-awaited reunion so I wanted to include everybody who had ever been in the band.\" In 2003, it was confirmed that activity had been halted due to Reb Beach's touring commitment with Whitesnake as well as his solo album \"Masquerade\" and involvement with \"super-group\" project The Mob with King's X frontman Doug Pinnick and Night Ranger drummer Kelly Keagy.\n\nOn July 16, 2005, it was announced that Kip Winger would perform as the lead singer for the Alan Parsons Live Project at the Common Ground Music Festival in Lansing, Michigan. In May 2006, it was confirmed that Winger had reformed without one of its original members Paul Taylor, to record another album and tour Europe. The album, IV, was released in Europe in October and the nine-country \"Winger IV Tour\" ran in the last two weeks of the same month.\n\nOn February 25, 2008, the band performed in Providence, Rhode Island, as part of a benefit for survivors of the Station nightclub fire. The concert, along with other artists was debuted on VH1 Classic on March 23, 2008. In late 2009, it was confirmed that Winger would record a fifth album Karma, with a tour to support it. Most recently, John Roth became the guitarist for Giant and would appear on their forthcoming album Promise Land then set for release in February/March of 2010.\n\nWinger released their sixth studio album titled, Better Days Comin' in April 2014, after teasers were published on Kip Winger's website and on the official Winger Facebook page as well.\n\nAs of late 2018, Winger was playing club dates. They were scheduled on Dec 29, 2018 in Westland, Michigan.\n\nStyle and influences.\n\nThe band's musical style combines elements of glam metal and progressive metal. Kip Winger, in description of the band's musical ability and style, said, \"Our band was known to musicians, and a lot of musicians showed up to see me play — watching, trying to figure out how I'm playing. We were like the 'hair band' (version of) Dream Theater.\""}, {"url": "https://myrockmixtapes.com/2016/09/12/the-story-of-wingers-headed-for-a-heartbreak/", "page_content": "“Headed for a Heartbreak” was one of those songs which I instantly fell in love with, the very second I heard for the first time. I had no idea who Winger were but thankfully, this song opened a new door for me and I got the chance to explore more of Kip Winger’s incredible voice and persona, as well as discover other beautiful songs of them, such as “Miles Away” and “Seventeen”.\n\nWinger debuted way too late. The 80s were long gone, music styles and directions were changing and the hair/glam metal era was beginning to fade. What they were bringing to the table was no longer desired, unfortunately. Just after a few successful singles and two platinum albums, they decided to call it quits. Yes, they did release a bunch of new stuff in 2006, 2009 and 2014 but, you know, it’s not the same. To me, personally, their first two albums were absolutely the best!\n\nAnyhow, as I was saying, “Headed for a Heartbreak” is definitely one of my favorite ‘80s rock tunes and most certainly in my “top 10 power ballads” list. Kip is absolutely killing it with his vocals and the beautiful guitar solo is just transferring me to another dimension…And the lyrics – definitely nothing so special or distinctive about them, but still quite painful, emotional and quite relatable, as I’m sure many of us have been in a similar situation as the protagonist of this song. There’s also this unique orchestra aura that surrounds the song, achieved by the keyboard bits, which actually made me fall for this song so much!\n\n\n\nThe track was released in May 1989, as a single from Winger‘s self-titled debut album. It was written by the lead singer of the band – Kip Winger. According to him, this is the most definite Winger song.\n\n\n\n“I wrote the riff and we jammed on it a little bit, and it was just one of those things that happened magically. You’ll talk to many people who think the best ideas happen by accident, and that was definitely one of them. A lot of times I’ll sit down and the s–t will just drop into my hands and I don’t even think about it. That was one of those songs,” Kip Winger said in an interview.\n\nWritten in a lydian scale, the song tells us a story about a man, who wants to be left alone and move on with his life, as his love has become a stranger to him. Despite that he’s going to be heartbroken, he chooses to “live again” instead of keep on dealing with the pain she’s causing him.\n\n\n\n“Headed For A Heartbreak” LYRICS\n\nYeah… Morning came and I was on my way\n\nWhen you reminded me\n\nI had too soon forgotten\n\nIt was you that set me free\n\nYeah, you were here when I came\n\nYou’ll be here when I’m gone\n\nSo don’t be waiting on love\n\n‘Cause I’ll be waiting to ramble on Headed for a heartbreak\n\nHeaded for a heartbreak Darling, don’t wait up for me\n\nTonight I won’t be home\n\nYou’ve become a stranger\n\nI just got to be alone\n\nDon’t need nobody on my side\n\nTo dull the blade I’m on\n\nSo don’t be waiting on love\n\n‘Cause I’ll be waiting to ramble on Headed for a heartbreak\n\nHeaded for a heartbreak\n\nHeaded for a heartbreak It’s not a mistake\n\nDon’t you think I can feel the pain?\n\nI walk away, to live again… Headed for a heartbreak\n\nHeaded for a heartbreak (Don’t make me hurt you)\n\nHeaded for a heartbreak (‘Cause I love you…)\n\nHeaded for a heartbreak Don’t you think I feel the pain?\n\nReferences: “Headed for a Heartbreak” by Winger, retrieved from http://www.songfacts.com/detail.php?id=33963\n\n“Headed for a Heartbreak” Lyrics, retrieved from http://www.azlyrics.com/lyrics/winger/headedforaheartbreak.html\n\nP.S. I don’t own any audio or visual material used in this publication. All the rights and credits go to the owners and/publishers.\n\nCheers~\n\nThe publication expresses my personal opinion and in no way is trying to make a generalized statement. Please be kind and considerate when you read and/or comment."}, {"url": "https://www.hairandflannel.com/winger/winger/", "page_content": "Hair Metal\n\nWinger Winger\n\nGlam prog (chest) hair metal band Winger released their self-titled debut album (Atlantic Records) in 1988. A quartet of singles in Madalaine, Headed for a Heartbreak, Hungry, and the most outrageous lyrics in the hair metal game in Seventeen make for a strong debut album for Kip Winger and the band.\n\nUpdated Oct 28 2022\n\nThe lyrics of Winger's Seventeen are upper echelon hair metal lyrics. Singles Madalaine, Headed for a Heartbreak, and Hungry highlight Winger's debut album.\n\nRecorded at Atlantic Studios in New York City, and coming in at a concise 43:50, Winger's self-titled album was produced by Alice Cooper, Warrant, and Ratt collaborator, Beau Hill.\n\nWinger songs are an eclectic mix of hair metal, prog rock, and power pop balladry. I think this is due to the outstanding musicians who made up the band. Moving beyond Kip, we have:\n\nReb Beach (lead guitar, backing vocals)\n\nReb was in hair metal bands: Winger, Whitesnake, and Dokken. Beyond that, he contributed to a ton of other projects, including Alice Cooper, Danger Danger, Twisted Sister, and even Chaka Khan.\n\nPaul Taylor (keyboards, backing vocals)\n\nBeyond the band Winger, Taylor has played with Eric Martin of Mr. Big, Aldo Nova, Steve Perry, and other rock legends.\n\nRod Morgenstein (drums, backing vocals)\n\nDrummer Rod Morgenstein teaches percussion at Berklee in Boston. So there's that. Plus, he's played with guitar legend Steve Morse.\n\nThe guys Kip chose to play with are no slouches. I mean sure, they might not have had Kip's gracious chest plummage. But really, who does!?\n\nIt's actually got some strong songs.\n\nThe Winger album cover art is interesting. The multi-layered face thing ... The string or laser beam (unsure) through the eye ... The Def Leppard lettering ...\n\nSlicing your head like a laser beam ... the album cover is as if Kip foreshadowed his future contribution to the Bill and Ted's Bogus Journey soundtrack.\n\nWinger notes\n\nMadalaine\n\nA big Mark Slaughter YEEAAAAHH from Kip to start Madalaine. For it.\n\nYou need to see the video to watch Kip Winger rip out the power bass player look.\n\nShreddy guitar fun in the solo with some solid whammy/tapping.\n\nKEY CHANGE! Like an old friend, always nice to see.\n\nHungry\n\nWhoa! What a video (and song).\n\nAlright, let me set the scene.\n\nGuy gets married\n\nGets in a car accident with his girl after skidding around many turns\n\nHe gets tossed from the car\n\nThen watches the car blow up\n\nNow he is hungry for her physical love\n\nBro, she hasn't been dead for more than 30 seconds. Kids these days ...\n\nAnyway, Hungry rocks.\n\nSeventeen\n\nLike Benny Mardones Into the Night, but hair metal.\n\nBoth Into the Night and Seventeen's lyrics are superiorly creepy. But hair metal is the great equalizer, and Winger's song rocks.\n\nSeventeen is written like an 80s hair metal madlib.\n\nI'm only 17. I'll show you love like you ain't never seen. She's only 17. Daddy says she's too young, but she's old enough for me.\n\nThese lyrics are criminal in MANY states.\n\nLook at them laughing in the video. They know something is wrong with all of this and ... nevermind, bitchin' solo.\n\nBig \"Uh\" at 2:33.\n\nShe loves to work shirtless Kip overtime. Are seventeen year olds even legally allowed to work overtime? Pretty sure not.\n\nShe's a magic mountain, she's a leather glove, she's my soul, it must be love.\n\nI feel disgusted just typing it. But hey, it was the 80s, I guess anything went. At least Reb smokes out dope riff after dope riff.\n\nWithout the Night\n\nYou can feel the heartbreak thumping in your metal heart on Without the Night.\n\nKip's bass interplays well with the synth. His vocals take on a Jani Lane on Cherry Pie tone on this track 4 ballad.\n\nSome nice medium power Dimarzio Super Distortions (guessing) all over the lead track.\n\nPurple Haze\n\nWinger adds all the sex to Purple Haze that Jimi Hendrix left out. And all the Aqua Net. And all the falsetto.\n\nI don't hate it though. They don't back down when faced with the challenge of covering Jimi, and I applaud them for it.\n\nCameo by Dweezil Zappa, cause why not?\n\nState of Emergency\n\nFun vocal effects. Decent riffing to kick State of Emergency off. I don't hate this glam prog thing. This could have been on the Bill and Ted's Excellent Adventure soundtrack - it has the right feel.\n\nIs it me or did the chorus go minor in the second half of the song!?!? Total pro move.\n\nI bet the keys player (Paul Taylor) suggested it. Every band needs one. A keys player that is.\n\n... and a choral modulation.\n\nTime to Surrender\n\nA song made by bad asses, for bad asses. Reb Beach sprinkles notes like cheese on a pizza. Rod Morgenstein hits pretty hard on Time to Surrender.\n\nPoison Angel\n\nNot be confused with Fallen Angel by Poison, Poison Angel follows in the footsteps of Seventeen with a fistful of innuendo, just NOWHERE near as good.\n\nPoison Angel is co-written by Kip Winger and Reb Beach ... and it sounds like it was. Total bass and guitar shred it up tune.\n\nLove the ending, from the dive bomb to extra shred.\n\nHangin' On\n\nBitchin' intro! Calls out to Damn Yankees Coming of Age, with a hint of early Van Halen.\n\nAnd a ... Warrant Pre-Chorus!?\n\nGang vocals are keeping me interested.\n\nReb Beach really rocks. I underappreciated him in my youth.\n\nBack to the Damn Yankees riff post chorus (or maybe Damn Yankees lifted it from Winger). Who cares?\n\nHeaded for a Heartbreak\n\nKip Winger is like, \"Coheed and Cambria, here, hold my beer! THIS is how you do prog rock!\"\n\nJokes aside, Headed for a Heartbreak is a pretty decent tune. The entire band shows up on this tune, especially Paul Taylor's keyboards.\n\nI can see Kip penning Headed for a Heartbreak now, thinking, \"gosh, the song is good, but the video will ascend to echelons not seen before or since. it will have a white piano, the color purple, someone half drowning, and it shall feature my chest hair! prominently!\"\n\nHigher and Higher\n\nHigher and Higher is just a standard, upbeat 80s hair metal track. A few verses, a few choruses, typical lyrics, a progressively more bad ass solo, whammy bars, high vocals, etc., etc., etc.\n\nTrack 11 \"Higher and Higher\" was a B-side of the Madalaine single\n\nThe list could go on, but the album does not.\n\nMore Winger Details\n\nWinger Info Release Date Length Producer Studio Record Label |\n\nReviews of Winger Albums"}, {"url": "https://www.theaudiodb.com/artist/114080", "page_content": "\n\nDown Incognito\n\nSeventeen\n\nMiles Away\n\nCan't Get Enuff\n\nHeaded for a Heartbreak\n\nEasy Come Easy Go\n\n4 users Winger - Seventeen4 users Winger - Miles Away4 users Winger - Headed for a Heartbreak4 users Winger - MadalaineAvailable in: Winger is an American hard rock band formed in New York City that gained popularity during the late 1980s and early 1990s. The band's two platinum albums, Winger and In the Heart of the Young, along with charting singles \"Seventeen\", \"Headed for a Heartbreak\" and \"Miles Away\", put the band on the top of the charts by the early 1990s. In 1990, the band was nominated for an American Music Award for \"Best New Heavy Metal Band\". As the music scene changed in the early to mid-1990s due to the popularity of grunge, the band faded after their third release Pull.The band broke up in 1994, but reunited in 2001 for several successful tours. In 2006, the band's 1993 touring line-up (minus Paul Taylor but including John Roth) reunited to record the band's first studio album in over 13 years, IV, and toured in support of the album into 2008. In 2009, the band released their fifth album, Karma. As of 2013 Winger is still together as a band, they play together on mini tours, special gigs as well as private gigs."}, {"url": "https://www.songlyrics.com/winger-lyrics/", "page_content": "Winger is an American heavy metal band that has combined elements of glam metal and progressive metal. Formed in New York City, Winger gained popularity during the late 1980s and early 1990s. The band's two platinum albums, Winger and In the Heart of the Young, along with charting singles \"Seventeen\", \"Headed for a Heartbreak\" and \"Miles Away\", put the band on the top of the charts by the early 1990s. In 1990, the band was nominated for an American Music Award for \"Best New Heavy Metal Band\". As the music scene changed in the early to mid-1990s due to the popularity of grunge, the band faded after their third release Pull.\n\nThe band broke up in 1994, but reunited in 2001 for several successful tours. In 2006, the band's 1993 touring line-up (minus Paul Taylor but including John Roth) reunited to record the band's first studio album in over 13 years, IV, and toured in support of the album into 2008. In 2009, the band released their fifth album, Karma. As of 2013, Winger still performs on mini-tours and private events.\n\nSource: https://en.wikipedia.org/wiki/Winger_(band)"}]}