{"Paul Taylor left Winger in 1994 to pursue a solo career.": [{"url": "https://prabook.com/web/paul.taylor/2179442", "page_content": "Paul Taylor\n\nGuitarist keyboardist\n\nJune 4, 1960 (age 31) San Francisco, California, United States of America\n\nAlthough he is perhaps most frequently associated with Winger, Taylor has also played with numerous other prominent musicians, including future Sammy Hagar and Boston guitarist Gary Pihl (in his early days), Eric Martin (solo artist and future Mr Big frontman), Aldo Nova, Steve Perry of Journey, Alice Cooper and Tommy Shaw. Taylor experienced his first mainstream success in the early 1980s as the touring keyboardist in Canadian musician Aldo Nova\"s backing band, and he appears in the music video for Nova\"s biggest hit, \"Fantasy.\" Prior to forming Winger, Taylor and Kip Winger were both playing with Alice Cooper\"s backing band on the tours for Cooper\"s mid-80s albums, Constrictor (1986) and Raise Your Fist and Yell (1987). During this time, the two began composing songs together and, while on break from touring, recorded what would become the first Winger demos. Whereas Kip left Alice\"s band prior to the European leg of the 1987 tour, Paul remained on board for the European dates. However, in the midst of touring Europe, Paul received a call from Kip, who had been working with future Winger lead guitarist Reb Beach recording more demos in New York, informing him that he had gotten a record deal. After the European tour was finished, Paul flew straight back to New York, and the Winger project (initially known as \"Sahara\") began rehearsing and recording their debut album. Taylor remained in Winger throughout the band\"s most successful period, which included the two smash albums, Winger and In the Heart of the Young. However, after the tour supporting the latter album ended in 1991, Taylor left the band in early 1992, citing exhaustion and a desire to write and get involved with other projects. Throughout the 1990s, Taylor immersed himself in numerous other projects, perhaps the most prolific of which was recording and touring with Steve Perry for his 1994 solo album. In 1998, he returned to the Alice Cooper band (this time, alongside fellow former Winger guitarist Reb Beach), and once that tour ended, he embarked on a brief tour with Tommy Shaw. Winger reunited in 2001 to record new material for a Greatest Hits album. Although it is unclear whether Taylor participated in these recording sessions, he did later join the band on the supporting tour. Though Paul was asked by Kip Winger to rejoin the band again to work on their 2006 reunion album, he declined because he was already involved with other projects. More recently, Taylor has become involved in composing music for television series programs and has also been pursuing his passion for photography. He also spent the summer months of 2012 touring with Cinderella throughout the United States. playing keyboards for them. He returned to Winger during mid-2013 and performed with them on select tour dates up through early 2014 and appeared in the Queen Babylon released in late 2014."}, {"url": "https://ultimateclassicrock.com/winger-career-collapsed/", "page_content": "In 1993, Winger had every reason to believe their third album, Pull, was going to be a big hit. Guitarist Reb Beach was so confident that he “banked” on the record going gold – and was forced into a large-scale U-turn when it didn’t happen.\n\nThe band's self-titled debut LP had introduced the group to the world via the hit singles “Headed for a Heartbreak” and “Seventeen,” then the follow-up, In the Heart of the Young, continued the streak with “Can't Get Enuff,” “Easy Come Easy Go” and “Miles Away.” But by the time Pull was ready for release, the grunge revolution had changed everything.\n\nIn Tom Beaujour and Richard Bienstock’s new book Nothin' but a Good Time: The Uncensored History of the '80s Hard Rock Explosion, Winger noted that their rise to fame had come thanks to MTV’s support for their “Madalaine” video and an opening slot on tour with Scorpions. “We got some good touring out of our second record, but the writing was on the wall before it came out,” frontman Kip Winger said. “Bad timing.”\n\nKeyboardist and guitarist Paul Taylor added: “We were starting to notice, like, wow, where’s everybody at the shows? … I remember it finally hit home in Cincinnati. We had a night off, and I went to see Extreme and Cinderella with David Lee Roth at the Riverbend [Music Center]. And it was half-full. … David Lee Roth was the ultimate rock star. And now the place is half-empty? I was like, ‘Whoa. Something's up.’ Because two years prior it would've been sold out.”\n\nBeach agreed with Winger’s “bad timing” analysis. “If we had come out in ’86, I’m sure I’d be a very rich man,\" he explained. \"But we came out in '89, right at the tail end. We didn't know it was gonna end. On the third album we were gonna get big publishing advances. If it had done well, I would've made a lot of money. And I banked on that. I figured, it's gotta do well! The last one sold a million and a half records. This one's gotta at least go gold.”\n\nSo, he \"bought a new house and moved the whole fam to Florida. ‘C’mon, kids! We’re moving to Florida!’ I got a house on a lake with a pool, and you could jump from the pool right into the lake! It was incredible. I was only there for eight months before I had to sell that house. That's how quickly it all went south.”\n\nThe band split in 1994, before reforming briefly in 2001 then more permanently in 2006. They’ve released three more albums since Pull, the most recent being 2014’s Better Days Comin’."}, {"url": "https://www.britannica.com/biography/Paul-Taylor-choreographer", "page_content": "Paul Taylor, in full Paul Belville Taylor, (born July 29, 1930, Wilkinsburg, Pennsylvania, U.S.—died August 29, 2018, New York, New York), American modern dancer and choreographer noted for the inventive, frequently humorous, and sardonic dances that he choreographed for his company.\n\nEntering Syracuse University in 1947 on a scholarship, Taylor took painting classes and joined the swim team. He began dance training in 1951 and subsequently studied modern dance at Juilliard with Martha Graham, Doris Humphrey, and José Limón and ballet with Antony Tudor and Margaret Craske. He began his professional career in 1953 with Martha Graham’s company, creating such important roles as Aegisthus in Clytemnestra (1958), Hercules in Alcestis (1960), and Theseus in Phaedra (1962). He also performed in works by other modern choreographers, including those of Charles Weidman and Merce Cunningham. He danced a solo created for him by George Balanchine in Episodes (1959), a work choreographed by Balanchine and Graham to music by Anton Webern.\n\nAs a choreographer, Taylor utilized a wide variety of movement styles, some of which he described as “flat” (two-dimensional in appearance), “dance scribbling” (emphasis on action rather than on shape or line), and “lyric” (“long arms”). His avant-garde works ranged from Duet (1957), in which he and his partner remained motionless for four minutes, to Orbs (1966), an hour-long composition to Beethoven’s last string quartets. Other well-known dances included Three Epitaphs (1956), Aureole (1962), Scudorama (1963), The Book of Beasts (1971), Esplanade and Runes (1975), Cloven Kingdom (1976), Aphrodisiamania (1977), Airs (1978), Nightshade (1979), and Le Sacre du Printemps (1980). His Aureole entered the repertoires of such major ballet troupes as the Paris Opéra Ballet and the Royal Danish Ballet.\n\nTaylor’s company, established in 1954 and usually numbering 13 dancers, first performed in Europe in 1960, toured South America in 1965 under the International Cultural Exchange Program of the U.S. State Department, and in 1978 toured the U.S.S.R. and appeared on the U.S. public-television network. Taylor also choreographed for the Spoleto (Italy) Festival of Two Worlds and won several prestigious awards. He withdrew from performing in the 1970s."}, {"url": "https://www.calendarz.com/on-this-day/june/4/paul-taylor-winger", "page_content": "Birth\n\nJun, 4\n\nPaul Taylor (Winger)\n\nPaul Taylor, American guitarist and keyboard player\n\nPaul Taylor (born June 4, 1960 in San Francisco, California), formerly credited as Paul Horowitz, is an American musician, who is best known as the keyboardist/guitarist with the late 1980s and early 1990s rock band, Winger (1987–1992, 2001–2003, 2013–2014, 2014–2017, 2018–present). Although he is perhaps most frequently associated with Winger, Taylor has also played with numerous other prominent musicians, including future Sammy Hagar and Boston guitarist Gary Pihl (in his early days), Eric Martin (solo artist and future Mr. Big frontman), Aldo Nova, Steve Perry of Journey, Alice Cooper and Tommy Shaw.\n\n\n\nIn the late 70's Paul briefly played in a Northern California band called Stark Raving Mad (Paul on lead guitar, Piano and Vocals, with Donovan Stark, Gary Pihl (later on with Sammy Hagar and Boston), Jay Causbrook, and David Payne, with Eric Martin (of Mr. Big). Taylor experienced his first mainstream success in the early 1980s as the touring keyboardist in Canadian musician Aldo Nova's backing band, and he appears in the music video for Nova's biggest hit, \"Fantasy.\"\n\n\n\nPrior to forming Winger, Taylor and Kip Winger were both playing with Alice Cooper's backing band on the tours for Cooper's mid-80s albums, Constrictor (1986) and Raise Your Fist and Yell (1987). During this time, the two began composing songs together and, while on break from touring, recorded what would become the first Winger demos. Whereas Kip left Alice's band prior to the European leg of the 1987 tour, Paul remained on board for the European dates. However, in the midst of touring Europe, Paul received a call from Kip, who had been working with future Winger lead guitarist Reb Beach recording more demos in New York, informing him that he had gotten a record deal. After the European tour was finished, Paul flew straight back to New York, and the Winger project (initially known as \"Sahara\") began rehearsing and recording their debut album.\n\n\n\nTaylor remained in Winger throughout the band's most successful period, which included the two smash albums, Winger and In the Heart of the Young. However, after the tour supporting the latter album ended in 1991, Taylor left the band in early 1992, citing exhaustion and a desire to write and get involved with other projects.\n\n\n\nThroughout the 1990s, Taylor immersed himself in numerous other projects, perhaps the most prolific of which was recording and touring with Steve Perry for his 1994 solo album. In 1998, he returned to the Alice Cooper band (this time, alongside fellow former Winger guitarist Reb Beach), and once that tour ended, he embarked on a brief tour with Tommy Shaw.\n\n\n\nWinger reunited in 2001 to record new material for a Greatest Hits album. Although it is unclear whether Taylor participated in these recording sessions, he did later join the band on the supporting tour.\n\n\n\nThough Paul was asked by Kip Winger to rejoin the band again to work on their 2006 reunion album, he declined because he was already involved with other projects.More recently, Taylor has become involved in composing music for television series programs and has also been pursuing his passion for photography. He also spent the summer months of 2012 touring with Cinderella throughout the U.S. playing keyboards for them. He returned to Winger during mid-2013 and performed with them on select tour dates up through early 2014 and appeared in the Queen Babylon released in late 2014.\n\n\n\n"}, {"url": "https://www.danceinforma.com/2018/09/03/paul-taylor-the-practical-poet-of-american-modern-dance-an-elegy/", "page_content": "Paul Taylor was a true giant of American modern dance, with works that displayed both simplicity and depth of understanding into the human condition. He passed away on August 29, 2018, at 88 years of age. A spokesperson from the company said it was due to renal failure. Surviving him is a company that he founded, many admiring dance lovers and an American contemporary dance that he had a significant hand in shaping.\n\nIn a choreographic career lasting more than a half century, he created 147 works – of varying atmospheres, aesthetics and moods – for his company and others from American Ballet Theatre to Houston Ballet. From the social and human commentary he created in his works, to the lyrical quality of the movement within it, Taylor was a poet. Yet, ever practical, he once remarked that a ticking clock was his muse. Pedestrian movements were often his inspiration.\n\nLincoln Kirstein once said that his work was set apart from all of the “idiosyncratic” modern dance he observed. Taylor’s works had the economy and wit of well-crafted short stories, along with an exquisite craftsmanship in all aesthetic aspects, explains Sarah Kaufman of the Washington Post. He was also entirely unconventional in approach, wearing flannel and jeans while prohibiting mirrors in his studios (claiming that they create “bad habits”).\n\nPaul Belville Taylor Jr. was born outside of Pittsburgh on January 29, 1930. His mother was a businesswoman and his father a physicist, but the family’s fate changed with the coming of the Great Depression. They moved to Washington, where his father managed a hotel and his mother a restaurant. Although his mother had three children from a previous marriage, Taylor grew up “essentially as an only child,” says Kaufman. He directed his curiosity toward insects, the halls of the family’s hotel, and the various characters coming in and out of there.\n\nTaylor attended Syracuse University on partial scholarship in the early 1950s, planning to study painting. Looking for an extracurricular endeavor, he joined the swim team. Alastair Macaulay of The New York Times describes Taylor’s interest in athletic dancers, and athleticism in dance; “many of his male dancers had powerful musculatures, while many of his female dancers displayed lissomeness, force and boldness.” Yet dance soon replaced swimming as his physical endeavor of focus.\n\nDancing could satisfy a need to expel his physical energy, he said in his 1987 memoir, Private Domain. He studied in Bar Harbor, Maine, in the summer of 1951, while chauffeuring for the dance school where he took classes. He was instantly hooked, Kaufman explains. The following summer, he studied at Connecticut College, with modern dance heavyweights such as Martha Graham, José Limón and Doris Humphrey. Taylor transferred to the Juilliard School in New York City, training with other notables such as ballet choreographer Antony Tudor.\n\nUpon graduation, Taylor was successful as a dancer and choreographer fairly quickly. A calmly lyrical mover with both size (standing at 6’1) and athletic strength, he caught the attention of Martha Graham and Merce Cunningham. From 1953-55, he was a founding member of the Merce Cunningham Dance Company, and joined Graham’s company on 1955.\n\nMacaulay explains how Taylor’s modernist aesthetic seemed to be most significantly influenced by Graham but with an important difference; Graham’s technique contained a “forceful expressive tension that it forged between torso and legs…[i]n her work, the body was often excitingly at war with itself[, but i]n his work, that tension would be translated into a vehemently lyrical current.”\n\nWhile dancing in their companies, he created works with collaborators including composer John Cage, and designers Robert Rauschenberg and Alex Katz. George Balanchine choreographed a solo for Taylor, which he performed in New York City Ballet’s season. He left Graham’s company in 1962, in order to focus on his own company, Paul Taylor Dance Company.\n\nHis pragmatic approach remained, yet subject and style shifted over the years. Duet (1957) consisted of he and a partner in stillness for four-and-a-half minutes. Louis Horst’s witty review of the work was simply a blank page. “My movements are scribbles of what people do,” Taylor remarked in response, “and people do sometimes stand or sit still, you know.”\n\nYet, as Kaufman describes, he came to realize that his works needed to offer music and movement in order to be accessible to a variety of audience members – and therein keep them in their seats.\n\nPedestrian movement always interested him and guided his work, however, perhaps because he began dancing later in life, Kaufman believes. Taylor’s seminal work, Esplanade (1975), for instance, assembles walking, running, gliding and small, simple leaps – all set to Bach. Taylor also infused virtuosity in the work, and so many others, however; Esplanade has a richness of pattern as well as speed, in certain sections, that is itself virtuosic, for instance.\n\nDue to hepatitis and ulcers, Taylor retired from the stage in 1974, at 44 years old. He remarked that it was nice “to be just be still and not hurt.” Yet he continued, and in fact deepened his work in, choreographing. Aureole (1962), set to Handel, demonstrated a joyfulness – one verging on sentimentality – uncommon in modern dance. It reflected the promise of President John F. Kennedy’s America. Further demonstrating his interest in pedestrian movement and the general quotidian, he gained inspiration for the chilling Last Look (1985) from the darting gazes of a homeless man.\n\nFor many years, the Paul Taylor Dance Company toured internationally through State Department sponsorship. The company gained international fame – exceeding that of Merce Cunningham or Martha Graham’s companies, despite how Taylor got his start from these modern dance heavyweights, says Kaufman. Taylor alumni include infamous dance names such as Twyla Tharp and Pina Bausch. Taylor founded Taylor 2 in 1994. In 2014, Taylor decided it was time for change and planning for the company surviving him. He renamed it the Paul Taylor American Modern Dance Company, and re-formatted the repertory to also include non-Taylor works from other prominent contemporary choreographers.\n\nThis past March, Taylor appointed Company Dancer Michael Novak as artistic director-designate. Taylor remained involved with the company and making work, however. With Taylor’s passing, the 35-year-old Novak will now head the school and all other entities under the company umbrella – sooner than expected, remarks Courtney Escoyne of Dance Magazine. Escoyne adds that “Mr. Taylor will be missed.”\n\nIndeed, he will be. He once said that making dances is similar to arranging his beloved insect collections, that you shape and rearrange things until they look good – so very practical, yet so very poetic.\n\nBy Kathryn Boland of Dance Informa."}, {"url": "https://www.celebsagewiki.com/paul-taylor-keyboardist", "page_content": "Age, Biography and Wiki\n\nPaul Taylor was born on 4 June, 1960 in San Francisco, California, United States, is an American musician, guitarist/keyboardist with Winger. Discover Paul Taylor's Biography, Age, Height, Physical Stats, Dating/Affairs, Family and career updates. Learn How rich is He in this year and how He spends money? Also learn how He earned most of networth at the age of 63 years old?\n\nPopular As N/A Occupation Musician,keyboardist,pianist,guitarist,vocalist Age 63 years old Zodiac Sign Gemini Born 4 June 1960 Birthday 4 June Birthplace San Francisco, California, United States Nationality United States\n\nWe recommend you to check the complete list of Famous People born on 4 June. He is a member of famous Musician with the age 63 years old group.\n\nPaul Taylor Height, Weight & Measurements\n\nAt 63 years old, Paul Taylor height not available right now. We will update Paul Taylor's Height, weight, Body Measurements, Eye Color, Hair Color, Shoe & Dress size soon as possible.\n\nPhysical Status Height Not Available Weight Not Available Body Measurements Not Available Eye Color Not Available Hair Color Not Available\n\nDating & Relationship status\n\nHe is currently single. He is not dating anyone. We don't have much information about He's past relationship and any previous engaged. According to our Database, He has no children.\n\nFamily Parents Not Available Wife Not Available Sibling Not Available Children Not Available\n\nPaul Taylor Net Worth\n\nHis net worth has been growing significantly in 2022-2023. So, how much is Paul Taylor worth at the age of 63 years old? Paul Taylor’s income source is mostly from being a successful Musician. He is from United States. We have estimated Paul Taylor's net worth , money, salary, income, and assets.\n\nNet Worth in 2023 $1 Million - $5 Million Salary in 2023 Under Review Net Worth in 2022 Pending Salary in 2022 Under Review House Not Available Cars Not Available Source of Income Musician\n\nPaul Taylor Social Network\n\nInstagram Linkedin Twitter Facebook Paul Taylor Facebook Wikipedia Paul Taylor Wikipedia Imdb\n\nTimeline"}, {"url": "https://everything.explained.today/%5C/Paul_Taylor_(Winger)/", "page_content": "Paul Taylor (keyboardist) explained\n\nPaul Taylor Background: non_vocal_instrumentalist Birth Date: 4 June 1960 Birth Place: San Francisco, California, U.S. Years Active: 1980–present\n\nPaul Taylor (born June 4, 1960), formerly credited as Paul Horowitz, is an American musician, who is best known as the keyboardist/guitarist with the late 1980s and early 1990s rock band, Winger (1987–1992, 2001–2003, 2013–2014, 2014–2017, 2018–present). Although he is perhaps most frequently associated with Winger, Taylor has also played with numerous other prominent musicians, including future Sammy Hagar and Boston guitarist Gary Pihl (in his early days), Eric Martin (solo artist and future Mr. Big frontman), Aldo Nova, Steve Perry of Journey, Alice Cooper and Tommy Shaw.\n\nTaylor was born in San Francisco, California. In the late 1970s he briefly played in a Northern California band called Stark Raving Mad (Paul on lead guitar, Piano and Vocals, with Donovan Stark, Gary Pihl (later on with Sammy Hagar and Boston), Jay Causbrook, and David Payne, with Eric Martin (of Mr. Big). Taylor experienced his first mainstream success in the early 1980s as the touring keyboardist in Canadian musician Aldo Nova's backing band, and he appears in the music video for Nova's biggest hit, \"Fantasy.\"\n\nPrior to forming Winger, Taylor and Kip Winger were both playing with Alice Cooper's backing band on the tours for Cooper's mid-80s albums, Constrictor (1986) and Raise Your Fist and Yell (1987). During this time, the two began composing songs together and, while on break from touring, recorded what would become the first Winger demos. Whereas Kip left Alice's band prior to the European leg of the 1987 tour, Paul remained on board for the European dates. However, in the midst of touring Europe, Paul received a call from Kip, who had been working with future Winger lead guitarist Reb Beach recording more demos in New York, informing him that he had gotten a record deal. After the European tour was finished, Paul flew straight back to New York, and the Winger project (initially known as \"Sahara\") began rehearsing and recording their debut album.\n\nTaylor remained in Winger throughout the band's most successful period, which included the two smash albums, Winger and In the Heart of the Young. However, after the tour supporting the latter album ended in 1991, Taylor left the band in early 1992, citing exhaustion and a desire to write and get involved with other projects.\n\nThroughout the 1990s, Taylor immersed himself in numerous other projects, perhaps the most prolific of which was recording and touring with Steve Perry for his 1994 solo album. In 1996, he returned to the Alice Cooper band (this time, alongside fellow former Winger guitarist Reb Beach), and once that tour ended, he embarked on a brief tour with Tommy Shaw.\n\nWinger reunited in 2001 to record new material for a Greatest Hits album. Although it is unclear whether Taylor participated in these recording sessions, he did later join the band on the supporting tour.\n\nThough Paul was asked by Kip Winger to rejoin the band again to work on their 2006 reunion album, he declined because he was already involved with other projects.[1]\n\nMore recently, Taylor has become involved in composing music for television series programs and has also been pursuing his passion for photography. He also spent the summer months of 2012 touring with Cinderella throughout the U.S. playing keyboards for them. He returned to Winger during mid-2013 and performed with them on select tour dates up through early 2014 and appeared in the Queen Babylon released in late 2014.\n\nDiscography\n\nwith Alice Cooper\n\nwith Winger\n\nwith Steve Perry\n\nGuest appearances\n\nNotes and References"}, {"url": "https://peoplepill.com/people/paul-taylor-16/", "page_content": "Paul Taylor (born June 4, 1960 in San Francisco, California), formerly credited as Paul Horowitz, is an American musician, who is best known as the keyboardist/guitarist with the late 1980s and early 1990s rock band, Winger (1987–1992, 2001–2003, 2013–2014, 2014–2017, 2018–present). Although he is perhaps most frequently associated with Winger, Taylor has also played with numerous other prominent musicians, including future Sammy Hagar and Boston guitarist Gary Pihl (in his early days), Eric Martin (solo artist and future Mr. Big frontman), Aldo Nova, Steve Perry of Journey, Alice Cooper and Tommy Shaw.\n\nIn the late 70's Paul briefly played in a Northern California band called Stark Raving Mad (Paul on lead guitar, Piano and Vocals, with Donovan Stark, Gary Pihl (later of with Sammy Hagar and Boston), Jay Causbrook, and David Payne, with Eric Martin (of Mr. Big). Taylor experienced his first mainstream success in the early 1980s as the touring keyboardist in Canadian musician Aldo Nova's backing band, and he appears in the music video for Nova's biggest hit, \"Fantasy.\"\n\nPrior to forming Winger, Taylor and Kip Winger were both playing with Alice Cooper's backing band on the tours for Cooper's mid-80s albums, Constrictor (1986) and Raise Your Fist and Yell (1987). During this time, the two began composing songs together and, while on break from touring, recorded what would become the first Winger demos. Whereas Kip left Alice's band prior to the European leg of the 1987 tour, Paul remained on board for the European dates. However, in the midst of touring Europe, Paul received a call from Kip, who had been working with future Winger lead guitarist Reb Beach recording more demos in New York, informing him that he had gotten a record deal. After the European tour was finished, Paul flew straight back to New York, and the Winger project (initially known as \"Sahara\") began rehearsing and recording their debut album.\n\nTaylor remained in Winger throughout the band's most successful period, which included the two smash albums, Winger and In the Heart of the Young. However, after the tour supporting the latter album ended in 1991, Taylor left the band in early 1992, citing exhaustion and a desire to write and get involved with other projects.\n\nThroughout the 1990s, Taylor immersed himself in numerous other projects, perhaps the most prolific of which was recording and touring with Steve Perry for his 1994 solo album. In 1998, he returned to the Alice Cooper band (this time, alongside fellow former Winger guitarist Reb Beach), and once that tour ended, he embarked on a brief tour with Tommy Shaw.\n\nWinger reunited in 2001 to record new material for a Greatest Hits album. Although it is unclear whether Taylor participated in these recording sessions, he did later join the band on the supporting tour.\n\nThough Paul was asked by Kip Winger to rejoin the band again to work on their 2006 reunion album, he declined because he was already involved with other projects.\n\nMore recently, Taylor has become involved in composing music for television series programs and has also been pursuing his passion for photography. He also spent the summer months of 2012 touring with Cinderella throughout the U.S. playing keyboards for them. He returned to Winger during mid-2013 and performed with them on select tour dates up through early 2014 and appeared in the Queen Babylon released in late 2014.\n\nDiscography\n\nwith Alice Cooper\n\nRaise Your Fist and Yell (1987)\n\n(1987) A Fistful of Alice (1997)\n\nwith Winger\n\nWinger (1988)\n\n(1988) In the Heart of the Young (1990)\n\nwith Steve Perry\n\nFor the Love of Strange Medicine (1994)\n\nGuest appearances"}, {"url": "https://elle.com.sg/2020/12/02/jackson-wang-musician-solo-career-interview-dec-2020-cover-star/", "page_content": "Music has undergone much of a cultural reset in recent years, with more Asian musicians entering the mainstream and charting alongside Western heavyweights like Drake, Taylor Swift and Ariana Grande. There’s BTS, who have spent 11 weeks at the top of Billboard’s Artist 100 chart; Blackpink, who have proven that their catchphrase “Blackpink in your area” was prophetic of global dominance; and Jackson Wang, the first Chinese solo musician to place on the U.S. Top 40 Radio chart with his single 100 Ways. Blackpink and BTS’ record-smashing and boundary-breaking achievements are often likened to the Beatlemania of the ‘60s, but Wang is more like Harry Styles. His One Direction is Got7, the seven-piece K-pop group that was launched in 2014 by one of Korea’s big three entertainment companies, JYP Entertainment.\n\niGot7, the group’s fandom, will know that, despite Wang’s silver-tongued talent as one of Got7’s rappers, he’s a foreign export — born and raised in Hong Kong by parents who were professional athletes. A gymnast at the young age of seven who picked up fencing when he was 10 years old, he went on to fence for Hong Kong for seven years and qualified for the 2012 London Olympics before his career trajectory took a 180. “Sometimes I think it’s fate, because the Korean entertainment casting team came to our school that day. I could have just left after [my] exam but I stayed, playing basketball, and they came at the exact same time,” Wang says. His sporting past is immortalised on his left bicep where the five Olympic rings are imprinted in ink.\n\nVest top, by TEAM WANG. Leather trousers, by DUNHILL. Pasha de Cartier yellow gold watch in 41mm, $23,800, Juste un Clou pink gold bracelet in small, $4,550, Juste un Clou pink gold bracelet, $10,200, and Juste un Clou pink gold necklace with diamonds, $16,400, by CARTIER. Photo: Yu Cong\n\nPost-audition, he recalls the four to five months spent waiting for news from JYP to be impossibly long, when he’d check his email inbox every morning in hopes of being called up for its trainee programme. When it finally came, Wang was in the midst of gearing up for the Asian Junior and Cadet Fencing Championships, and couldn’t relocate to South Korea at the drop of a hat. It was JYP’s turn to wait for him, and they did, for seven months. “It was hard to persuade my parents [to let me pursue music], because they’re both athletes.” He continues, “The thing they told me was, ‘Everyone’s dreaming of being in your position. It’s not easy [to be] where you’re at now.’” As an Olympian in the making with offers from universities knocking on his door, Wang convinced his parents that these crossroads would lead to music. “I just thought: ‘We only live one life, you never know what’s going to happen tomorrow’,” he says.\n\nAfter three years of minting his reputation as Got7’s self-deprecating rapper with a larger-than-life personality and a singer’s chops to boot, Wang took another leap of faith. He set up his record label Team Wang, and launched a solo career. Behind his first single Papillon’s 42 million views on YouTube at press time and its number one spot on Billboard’s China V chart, was a steep learning curve he had to tackle; Wang’s job scope scaled up from artiste to employer and boss, seemingly overnight. “You know, it was really tough when I started out and there [were] a lot of times that I [would] mentally and physically break down,” he says. “I went through that, and depression. Everything is on [my] back.” He realised that heading up a team meant that music and production wasn’t the entire picture, and that communication and dealing with emotions was part of the work too. He calls it “the system” — the process of getting everyone involved on the same page, regardless if their heads are all in different, metaphorical worlds. The upside is that he gets to truly be himself, composing the tracks, writing the lyrics, and at times, co-directing the music videos he releases. “I could be like, ‘I want this release to be this and that.’ It’s more personal [and] it’s my own true colour,” says Wang.\n\n3 Moncler Grenoble ski suit, $3,770, by MONCLER. Juste un Clou pink gold necklace with diamonds, $5,700, Juste un Clou pink gold bracelet in small, $4,550, Juste un Clou pink gold bracelet with diamonds, $16,900, by CARTIER. Singlet, stylist’s own. Photo: Yu Cong\n\nKnown for speaking at least four languages — English, Mandarin, Korean and Cantonese — fluently, his songs as a solo musician are predominantly in English, but Wang ensures that his Chinese roots have a place in his often synth-inflected releases. The 100 Ways music video takes the love song back several centuries with its cast of Chinese warriors, and his latest single Pretty Please in collaboration with DJ duo Galantis kicks off in a Chinese restaurant with the musician and his crew conversing in Cantonese. Wang is aware that he’s part of a new generation of Asian musicians — alongside the aforementioned BTS and Blackpink — that are recognised worldwide, and perceives his music as a vehicle to amplify Chinese culture. “I’m very proud that I’m Chinese, [and] I’m proud that I’m Asian.” He continues, “As much as I love learning about other cultures, I love sharing mine, and I hope people can relate and see [such a] body of work in the market.”\n\nTogether with Gucci Mane and the hip-hop tune Different Game, he leaned into the genre’s flex culture, albeit through, once again, a Chinese lens. This cross-pollination that he relishes has also brought about tie-ups with other Asian musicians like 88rising’s Joji and Rich Brian, whose entertainment and mass media company’s core purpose is setting Asian artistes up on the world stage — just like Wang has, under Team Wang, done for himself. Today, he’s irrefutably global; the numbers don’t lie. His first album Mirrors has clocked more than 50 million streams on Spotify, and Pretty Please peaked at number 12 on the Billboard Hot Dance/Electronic Songs chart.\n\n\n\nLeft: T-shirt, $260, by CK CALVIN KLEIN. Trunks, by CALVIN KLEIN. Sweatpants, by TEAM WANG. Juste un Clou pink gold bracelet in small, $4,550, Juste un Clou pink gold bracelet with diamonds, $16,900, and Juste un Clou pink gold necklace with diamonds, $16,400, by CARTIER. Right: Sweater, $1,500, shirt, $1,850, and trousers, by FENDI. Pasha de Cartier yellow gold watch in 41mm, $23,800, by CARTIER. Photo: Yu Cong\n\nWhile there are a handful of other Chinese musicians who got their start in K-pop who have since left to pursue their own careers, Wang is straddling both Got7 and his solo endeavours. It’s a tough grind that sees him dedicating half a year to each camp, and he admits, “It’s stressful and it’s hard, but it’s something that I really believe in and am in love with. I’m blessed and grateful to be able to do that every day.”\n\nTack onto that yet another project he’s spearheaded and put out into the world in the recent months — this time clothing. Team Wang Design, the accompanying garment line to his record label, is a tireless move on Wang’s part that catapults him into the same elite space that hip-hop’s most eminent multi-hyphenates occupy — Kanye West, Travis Scott and Tyler, The Creator have all parlayed their musical prowess into fashion hype. In the thick of it all, Wang’s ambitious, in-it-to-win-it sporting instinct never fails to kick in. He says, “I always have the vision of trying to beat the previous me every time — with every release.”\n\nShirt and trousers, by XANDER ZHOU. Juste un Clou pink gold necklace with diamonds, $16,400, by CARTIER. Photo: Yu Cong\n\nReleases in which he’s toured genres from hip-hop to EDM and pop, each song a fragment of the artiste that both his audience and Wang himself gradually uncovers, which will eventually come together as a full suite at some point. “I don’t even know, but I’m sure it’s going to be something different,” he says of his next drop, citing the element of surprise as one of his driving forces.\n\nThe glue holding it all together and the vision on the horizon turns out to be a mantra that he’s lived by since he was a child (a truncated version of it sits proudly on his Instagram bio today): “To know yourself, and make your own history.” And Wang’s next history-defining chapter is just a matter of time.\n\nThis story first appeared in ELLE Singapore’s December 2020 issue."}, {"url": "https://bravewords.com/news/winger-keyboardist-guitarist-paul-taylor-talks-early-version-of-in-the-heart-of-the-young-album-the-label-heard-it-and-were-like-whats-this", "page_content": "In the latest episode of the 80's Glam Metalcast, hots Metal Mike talks with Winger keyboardist / guitarist Paul Taylor. He reveals what Winger has been up to recently, and looks back at their classic debut and the follow up, In The Heart Of The Young.\n\nOn the new Winger album and writing with Mick Mars\n\nTaylor: \"There’s a new record that’s basically in the can. We’ve all recorded our parts. Right now, it’s all falling on Kip to put it all together. He’s got a symphony he’s going to be releasing, he’s got solo gigs, and we’ve got Winger gigs. There’s a lot of logistics. John’s had Starship gigs, Reb has some gigs coming up with Whitesnake....we’ve had our hands full. Kip is working really hard on it though. He’s doing some final vocal things and all the mixing. It shouldn’t be too much longer, maybe a couple months.\n\nI don’t actually have any songwriting credits on this one. I was writing for some other records. One I can mention is Mick Mars. I wrote a lot of songs with him. It was me, Mick, and Jacob Bunton (who was singing with Steven Adler) writing together. Those are all mixed. I don’t know if and when he is going to release them. We had a good time working on this stuff. They are for his solo album. He’s switched gears a few times in who he wants to work with and what he wants to do. We’re hoping the songs we did with him get released.\n\nMick is a monster. He comes up with some cool, creative stuff. I can’t say too much more about it. I can it’s very musical and very heavy. I think people will be really surprised by it. So I was busy with these other projects, and Kip and Reb are so damn prolific....by the time I was ready to jump in, they had the whole thing written already.\"\n\nOn Winger's debut album\n\nTaylor: \"The debut is probably my favorite out of all the ones we’ve done. The angst, you’re young, and you’ve got your fingers crossed. At the time we were getting to release it, Kip, Reb, and me all moved into an apartment in Hoboken, NJ. I was still playing with Alice Cooper, so I was flying in and out. Rod they had met last minute. So Rod had cut the drums and was part of the band. I never actually met him until the album was completely finished. We all had never played one gig together and we ended up opening for the Scorpions for a month. We had to get it together really quick.\"\n\nOn second album, In The Heart Of The Young\n\nTaylor: \"It was even more progressive sounding until the label got a hold of it. The label heard it and were like 'What’s this?' They said they would release it, but they weren’t going to push it as it was. They wanted some singles. We went back to the drawing board and came up with 'Can’t Get Enough' and 'Easy Come Easy Go'. In the end, they were probably right. We wanted to be all prog rock; not sure what we were thinking then.\n\nThat’s what’s cool about Winger; we can do 'Rainbow In The Rose' and then do 'Can’t Get Enough'. It’s a good blend. With 'Miles Away', I had written that in the early 80’s with Eric Martin singing on it. I think Eric’s voice is what sold it. People who heard it thought it could be a hit. When Kip heard it, he wanted it on the record. Then he turns around and writes the ballad 'Under One Condition', which I thought was amazing. I thought 'Uh oh, there goes my ballad.' Our record company president loved 'Miles Away', though, and wanted it as a single.\""}]}