{"Paul Taylor attended the University of Illinois at Urbana-Champaign and studied music and theater.": [{"url": "https://illinois.edu/about/awards.html", "page_content": "John Bardeen (1908–1991) won the Nobel Prize in physics in 1956 and 1972, the only person to have won the physics prize twice. He shared the 1956 prize with W. H. Brattain and W. Shockley for research on semiconductors and the invention of the transistor at Bell Labs, and the 1972 prize with L. N. Cooper and J. R. Schrieffer for the theory of superconductivity, developed at the U of I. Bardeen served on the University’s faculty from 1951 until his death in 1991.\n\nLeon N Cooper (1930– ) shared the 1972 Nobel Prize in Physics with faculty member John Bardeen and alumnus John R. Schreiffer for their development of the theory of superconductivity, usually called the BCS-theory. He was a research associate at the U of I from 1955 to 1957.\n\nElias Corey (1928– ) won the Nobel Prize in chemistry in 1990 for his “development of the theory and methodology of organic synthesis.” Corey served on the faculty in the Department of Chemistry at the University from 1951 to 1959.\n\nVincent Du Vigneaud (1901–1978) won the Nobel Prize in chemistry in 1955 for his work on “biochemically important sulfur compounds, especially for achieving the first synthesis of a polypeptide hormone.” Du Vigneaud received a Bachelor of Science (1923) and a Master of Science (1924) from the U of I. He served on the University faculty from 1929 to 1932.\n\nMurray Gell-Mann (1929– ) won the Nobel Prize in Physics in 1969 for \"his contributions and discoveries concerning the classification of elementary particles and their interactions.\" Gell-Mann was a postdoctoral research associate in 1951 and a visiting research professor from 1952-1953.\n\nLeonid Hurwicz (1917–2008) shared the Nobel Prize in economics in 2007 with Eric S. Maskin and Roger B. Myerson for \"having laid the foundations of mechanism design theory.\" He served as a faculty member at the University of Illinois Department of Economics from 1949-1951.\n\nPaul C. Lauterbur (1929–2007) shared the Nobel Prize in physiology or medicine in 2003 with Sir Peter Mansfield for \"seminal discoveries concerning the use of magnetic resonance to visualize different structures.\" Lauterbur was among the first scientists to use nuclear magnetic resonance in the studies of molecules, solutions, and solids. Lauterbur joined the U of I faculty in 1985.\n\nAnthony J. Leggett (1938– ) shared the 2003 Nobel Prize in physics with Alexei A. Abrikosov and Vitaly L. Ginzburg for \"pioneering contributions to the theory of superconductors and superfluids.\" Leggett formulated the decisive theory explaining how atoms interact and are ordered in the superfluid state. Leggett joined the U of I faculty in 1983.\n\nSalvador Luria (1912–1991) won the Nobel Prize in medicine and physiology in 1969 with Max Delbruck and Alfred Hershey for discoveries concerning the replication mechanism and the genetic structure of viruses. He served as a professor of bacteriology at the University from 1950 to 1959.\n\nSir Peter Mansfield (1933– ) shared the 2003 Nobel Prize in Medicine with faculty member Paul C. Lauterbur for “seminal discoveries concerning the use of magnetic resonance to visualize different structures.” Mansfield was a research associate in the U of I department of physics from 1962 to 1964.\n\nRudolph Marcus (1923– ) won the Nobel Prize in chemistry in 1992 for contributions to the theory of how electrons are transferred between molecules—work that helps explain such phenomena as rust and how plants draw nourishment from light. He served as a faculty member in the U of I Department of Chemistry from 1964 to 1978 and completed much of his prize-winning research at the University.\n\nFranco Modigliani (1918–2003) won the Nobel Prize in economics in 1985 for two major theories: one on personal finance and one on corporate finance. He served as a faculty member in the U of I Department of Economics from 1948 to 1952.\n\nAlvin Roth (1951 -) shared the 2012 Nobel Memorial Prize in Economic Science for his work in market design and matching theory, which relate to how people and companies find and select one another in everything from marriage to school choice to jobs to organ donations. Roth was a member of the business faculty at Illinois from 1975-1982."}, {"url": "http://research.physics.illinois.edu/QI/Photonics/", "page_content": "About us\n\nWe are a quantum information research group in the physics department at the University of Illinois at Urbana-Champaign.\n\nOur research interests include:\n\nFundamental studies of quantum mechanics\n\nOptical quantum information resources including single-photon sources, single-photon detectors, sources of entanglement, quantum random number generators, and adaptive optics\n\nApplications such as quantum key distribution, quantum state and process tomography, quantum state creation and remote preparation, hyperentanglement-enhanced quantum communication, quantum-enhanced precision measurements, and quantum memory\n\nThe interaction of quantum states of light with biological systems, including the human visual system\n\nMore about us »\n\nMore about our research »"}, {"url": "https://physics.illinois.edu/research/groups-and-centers/nuclear-physics", "page_content": "What is Nuclear Physics?\n\nLearn more about the Nuclear Physics Group\n\nMore than 99% of the mass of visible matter in the universe is nuclear matter. Protons and neutrons are the building blocks of atomic nuclei. Exotic forms of nuclear matter were present in the early universe and continue to exist today in neutron stars. Nuclear fusion processes at the core of our Sun are the source of the vast energy flow that sustains life on Earth. Nuclear fusion in stars and nuclear processes at the end of stellar life have formed the rich spectrum of elements we observe in nature.\n\nNuclear physics is the study of the structure of nuclei—their formation, stability, and decay. It aims to understand the fundamental nuclear forces in nature, their symmetries, and the resulting complex interactions between protons and neutrons in nuclei and among quarks inside hadrons, including the proton.\n\nExperimental nuclear physics drives innovation in scientific instrumentation and has a far-reaching impact on research in other fields of science and engineering. From medicine—x-ray and magnetic resonance imaging, radiation therapies for cancer treatment—to materials science—x-ray lithography and neutron scattering—to propulsion and energy production—nuclear physicists have changed our world. Today's research in nuclear physics is not only unraveling fundamental questions about matter and energy but also enabling a host of new technologies in materials science, biology, chemistry, medicine, and national security.\n\nTheoretical nuclear physics draws from a wide variety of fields such as statistical mechanics, fluid dynamics, statistics, particle physics, astrophysics, and gravity to understand fundamental properties of the universe on the smallest scales. Theorists use these tools to study the interior of neutron stars, simulate tiny versions of the Big Bang created in the laboratory, study fluid dynamic properties in relativistic systems, and calculate the microscopic interactions of quarks and gluons.\n\nWe have both experimental and theoretical groups covering a broad range of nuclear physics and related fields. We have joint speakers, seminars, journal clubs and other more informal interactions which provide unique learning opportunities for everyone in these groups.\n\nWhat are we doing in Experimental Nuclear Physics at Illinois?\n\nThe Nuclear Physics Laboratory (NPL) at the University of Illinois at Urbana-Champaign carries out research in two broad areas. We are making precision measurements of neutron decay and searching for the neutron electric dipole moment and the axion. We also study both hot and cold QCD in relativistic heavy-ion experiments and in spin-dependent nucleon structure measurements .\n\nWe have significant state-of-the-art infrastructure to design and build scientific instrumentation in our laboratory. We focus on the development of instruments for novel experimental approaches to solving open questions in nuclear physics. Past and current examples include the large volume superconducting spectrometer magnet for the G0 experiment at Jefferson Laboratory, the cryogenic 4He target for the neutron EDM experiment at Oakridge National Laboratory, the W-trigger and the MPC, a forward EMC for the PHENIX experiment at Brookhaven National Laboratory, a large planar drift chamber for the COMPASS experiment at CERN, 6000 detector towers for the electromagnetic calorimeter for sPHENIX at Brookhaven National Lab and novel ultra-radiation-hard forward detectors for Pb-Pb and p-Pb physics in ATLAS at CERN.\n\nWe participate in several large-scale experiments at accelerator and reactor facilities in the United States and abroad. A careful balance between experiments in different stages—R&D, construction, data taking, data analysis—results in a broad spectrum of research opportunities. Our large group—nearly 50 graduate students, postdocs, and undergraduate student researchers—focuses on discovery in fundamental nuclear physics, modern data analysis techniques, and advanced instrumentation.\n\nExperiments, status, and major goals\n\nARIADNE (Axion Resonant InterAction DetectioN Experiment) is an NMR-type experiment which searches for induced magnetization in a small sample of cryogenic, polarized helium-3 atoms as a dense, non-magnetic source mass is modulated in close proximity. This would be a signal of an exotic, spin-dependent interaction which could be mediated by the axion, a hypothesized, light, weakly-interacting particle that has emerged as a leading candidate for dark matter.\n\nATLAS Study of the quark-gluon plasma (QGP) produced in the collisions of large nuclei using the modification of jets from their vacuum fragmentation configurations as they propagate through the QGP. The Illinois group also is contributing to the two stage upgrade of the ATLAS Zero-Degree Calorimeter for the high luminosity LHC runs 3 (2022-2025) and 4 (2029-2032) and leads the development of a novel Reaction Plane Detector using AI reconstruction algorithms.\n\nBL3 The Beam Lifetime (BL) experiment at the National Institute of Standards and Technology (NIST) measures the neutron lifetime using a different technique by observing neutron decay in flight. The neutron lifetime is determined by comparing the rate of beta-decay protons captured in a Penning trap to the rate of beam neutrons passing through the trap. The neutron lifetime measured using the beam method differs from that measured using the bottle method (UCNtau) by ~10 seconds. The continued disagreement hints at new physics, including neutron oscillations and low-energy physics in the dark sectors.\n\nCOMPASS (COmmon Muon Proton Apparatus for Structure and Spectroscopy) is a fixed-target experiment at CERN. It has been using the muon or hadron beams of the Super Proton Synchrotron (SPS) to scatter off a target of unpolarized or spin-polarized protons or deuterons, and unpolarized heavier nuclear targets. The SPS is also used to inject beams into the Large Hadron Collider (LHC).\n\nneutron EDM The possible existence of a non-zero electric dipole moment of the neutron is of great fundamental interest and directly impacts our understanding of the nature of electro-weak and strong interactions. The experimental search for this moment has the potential to reveal new sources of T and CP violation. Such new sources would help us to understand the matter-antimatter asymmetry in the universe and challenge proposed extensions to the Standard Model.\n\nProject 8 The energy of the beta emitted from tritium atoms near its endpoint energy, through simple kinematics, reveals the absolute mass of the electron neutrinos. The Project 8 experiment aims to measure the mass of neutrinos using a novel technique of Cyclotron Radiation Emission Spectroscopy (CRES) to reach an unparalleled sensitivity of 40 meV. This mass sensitivity covers the range of inverted neutrino mass hierarchy and reaches into the prediction for the normal hierarchy. To achieve this goal, we need to trap atomic tritiums. A magneto-gravitational trap using a Halbach array of permanent magnets, similar to the UCN trapping in the UCNτ experiment, could be readily applied to trap cold tritium atoms.\n\nSeaQuest The Fermilab E-906/SeaQuest experiment is part of a series of fixed target Drell-Yan experiments designed to measure the antiquark structure of the nucleon and the modifications to that structure when the nucleon is embedded in a nucleus. Its principal goal is to extend the landmark measurement of the sea flavor asymmetry d(x)i u(x) in the proton made by its predecessor, E866, to the high-x regime.\n\nsPHENIX The main physics motivation for the sPHENIX detector is the study of the quark-gluon plasma (QGP) produced in the collisions of large nuclei using the modification of jets from their vacuum fragmentation configurations as the propagate through the QGP. Together with the ATLAS program, the detectors at RHIC (sPHENIX) and the LHC (ATLAS) will allow us to constrain the temperature dependence of the properties of the QGP. The sPHENIX experiment also allows for the measurement of proton transverse-spin and transverse-momentum dependent effects.\n\nUCNtau The UCNtau experiment measures the neutron lifetime using magnetically trapped ultracold neutrons (UCN) at the Los Alamos National Laboratory. In the UCNtau apparatus, UCN are magnetically levitated by an array of permanent magnets and confined by earth gravitational fields. The large volume of UCNtau, its asymmetrical construction, and the use of active neutron counting in-situ make it possible to reach a precise lifetime determination on the level of 1e-4, which is needed to test the unitarity of the CKM matrix and probe physics beyond the standard model.\n\nTheory, collaborations, and major goals"}, {"url": "https://physics.illinois.edu/people/directory/profile/kwiat", "page_content": "Paul G Kwiat\n\nPrimary Research Area Atomic, Molecular, and Optical Physics John Bardeen Chair in Electrical Engineering and Physics (217) 333-9116 kwiat@illinois.edu 337B Loomis Laboratory\n\nFor More Information\n\nEducation\n\nPh.D., Physics, University of California, Berkeley, 1993\n\nBiography\n\nProfessor Paul G. Kwiat received his Ph.D from the University of California, Berkeley (1993), where his dissertation was on nonclassical effects from spontaneous parametric downconversion. After two years as a Lise Meitner Fellow with the quantum optics group of Prof. Anton Zeilinger (at the Univ. of Innsbruck, Austria), he went to Los Alamos National Laboratory (LANL) as an Oppenheimer Fellow; in 1998 he became a technical staff member in the Neutron Science and Technology group of Physics Division. He has given invited talks at numerous national and international conferences and has authored more than 100 articles on various topics in quantum optics and quantum information, including several review articles. He is a Fellow of the Optical Society of America and the American Physical Society and an Expert Panel member for both the Quantum Computation and Quantum Cryptography Roadmaps.\n\nIn 1998, Professor Kwiat was awarded the LANL Fellows Prize for his work on optical studies of quantum information. He has done pioneering research on the phenomena of quantum interrogation, quantum erasure, and optical implementations of quantum information protocols. He is a primary inventor of the world's first two sources of polarization-entangled photons from down-conversion, which have been used for quantum cryptography, dense-coding, quantum teleportation, entanglement distillation, and most recently, optical quantum gates. In January 2001, he joined the Physics faculty as the second Bardeen Chair.\n\nIn 2018, Professor Kwiat was instrumental in the formation of the Illinois Quantum Information Science and Technology Center (IQUIST) at the University of Illinois at Urbana-Champaign and is currently serving as the center's inaugural Director. IQUIST seeks to accelerate quantum information science (QIS) research on the Urbana campus through collaborations across physics, electrical and computer engineering, computer science, math, and other engineering disciplines; and to build new educational programs to better equip a future QIS-smart workforce.\n\nTeaching Statement\n\nMy intent is to motivate students to care about these topics (e.g., electricity and magnetism, and thermal physics), by showing the ubiquitous application to our everyday lives, in addition to cutting edge technologies.\n\nResearch Statement\n\nQuantum Optics and Quantum Information — In our quantum optics lab, we use photons to investigate a range of topics from foundations of quantum mechanics (such as tests of nonlocality, the quantum Zeno effect, and so forth) to quantum cryptography (enabling for the first time provable unconditional security), communication (including \"teleportation\"), and computation (investigating simple quantum logic, algorithms, and decoherence-defeating measures). We have developed methods to produce pairs of photons that share the most mysterious of all quantum properties -- entanglement. The goal now is to improve these systems, to explore uncharted waters of novel quantum mechanical states, and to learn to use them to advantage in all areas of information processing.\n\nPhotonic Quantum Information Systems — Our goal is to develop the following optical quantum technologies for quantum information processing (including computation, cryptography, and metrology), and apply them to critical problems in these areas: Entangled-photon sources and characterization, quantum state transducer, photon storage and quantum memory, periodic single photon source, and photon number-resolving solid-state photomultipliers (SSPMs). These are central resources for many quantum communication applications.\n\nHyper-entanglement for Advanced Quantum Communication — Hyper-entanglement — the property that quantum systems, photons in our case, may be simultaneously entangled in multiple degrees of freedom — promises to enhance the capabilities of current quantum communication protocols, and to enable new ones. We will extend our experience in the creation, manipulation and characterization of hyper-entanglement in the photon pairs produced via spontaneous parametric down-conversion, and employ them for several relevant advanced quantum communication applications: quantum super-dense coding, production and application of bound entanglement, optimized teleportation beyond single qubits, and entanglement-enhanced quantum fingerprinting. Our research in these areas will substantially increase understanding of the benefits — and limitations — of using hyper-entanglement for quantum information processing, extending the capabilities of current communication protocols, and enabling new ones.\n\nOptical Quantum Computing — Quantum computing uses the unique quantum properties of small systems to enable exponential computational speedups for certain classes of problems. Simple gates have been realized in several systems; the cleanest of these have been using photons as the quantum bits (\"qubits\"). Now we are investigating the feasibility of transitioning these small scall results to a much larger system, eventually capable of performing universal computations. We are exploring two approaches in detail. The first uses the newly devised \"cluster\" state paradigm, thereby reducing resoures requirements by several orders of magnitude. The second approach, relying on weak nonlinear effects, reduces the resource requirements even further.\n\nUndergraduate Research Opportunities\n\nI routinely have talented undergraduates working in my group. They typically begin assisting with ongoing projects before taking responsibility for their own research project. Much of the research has resulted in published papers, with the students as co-authors.\n\nResearch Interests\n\nPh.D. thesis title: Nonclassical Effects from Spontaneous Parametric Downconversion\n\nSelected Articles in Journals\n\nArticles in Conference Proceedings\n\nResearch Honors Optical Society of America R. W. Wood Prize (2009) (2009)\n\nYoung Scholar Award (3rd place), Amazing Light competition (2005) (2005)\n\nFellow, Optical Society of America (2005) (2005)\n\nJ. David Murley Milestone Award for Outstanding Achievements in Quantum Cryptography (2004) (2004)\n\nDescartes Prize (2004) (2004)\n\nFellow, American Physical Society (2002) (2002)\n\nBardeen Chair, Dept. of Physics, Univ. of Illinois (2001-present) (2001)\n\nLos Alamos National Laboratory Fellows Prize (1999) (1999)"}, {"url": "https://physics.illinois.edu/people/directory/profile/selvin", "page_content": "Paul R Selvin\n\nPrimary Research Area Biological Physics Professor (217) 417-6101 selvin@illinois.edu 365 Loomis Laboratory\n\nFor More Information\n\nEducation\n\nPh.D., Physics, University of California-Berkeley, 1990\n\nBiography\n\nPaul Selvin earned a Ph.D. from the University of California, Berkeley, in 1990. Formally it was in physics, but in reality, it was in biophysics. The last experiment for his thesis, for example, was measuring the torsional rigidity of DNA by looking at a fluorophore intercalated in DNA, twisting around. A paper based on this experiment was published in Science (Selvin, 1992, Science) and later confirmed in a single molecule experiment (Bryant, Nature, 2003).\n\nProfessor Selvin did two sets of experiments during his postdoctoral training. One was developing a new type of fluorescence resonance energy transfer (FRET) based on lanthanides, called luminescence resonance energy transfer (LRET). He later used this technique to discover how a potassium ion channel, in part responsible for nerve conduction, responds to voltage (Cha, 1999, Nature; Posson, 2005, Nature). The second involved single molecule fluorescence—the first measurement of FRET between a single donor and single acceptor (Ha, 1996, PNAS).\n\nAfter joining the Department of Physics at the University of Illinois in 1997, his interest has turned to molecular motors — proteins whose job is moving cargoes around the cell. For example, chromosomes are bound to molecular motors (kinesin and dynein) and under their power, are moved into the two halves of a cell during cell division. Selvin’s task was to determine how the motors moved. They were known to be dimeric, with two “feet,” held together by a head that consumed ATP (the universal food of the cell) and a stalk that bound to the cargo. It was also known that for each ATP burned up, these proteins moved between 8 and 37 nm, depending on the individual motor.\n\nBut did they move in a walking-type motion (also called “hand-over-hand”), or did they move as an inchworm does? A walking-type motion would move the back foot twice the center-of-mass distance, with the front foot not translating at all; an inchworm-type motion would move all parts equally—equal to the center of mass. The problem was that this distance for the walking motion was only 74 nm for the biggest motor, and 16 nm for the smallest motor—or 37 nm and 8 nm for an inchworm motion—about 30 times smaller than the diffraction limit of light, arguably the smallest distance that can be resolved with visible light.\n\nThe trick to get around this problem was to realize that a single molecule’s position can be located arbitrarily well. It’s much like a mountain peak, which can be located to within a few yards, even though the mountain itself may be a a mile wide. Similarly, a single molecule’s center can be determined to be its width (~250 nm), divided by the square root of the numbers of photons collected (see left diagram). Selvin and his group managed to collect 10,000 photons in 0.5 s, meaning that the fluorophore’s center could be determined to ±1.25 nm (250/√104). With some clever chemistry, the single fluorophore could last several minutes, meaning that Selvin could watch the fluorescently-labeled molecular motor take several steps (Yildiz, 2003, Science). He called the technique FIONA—Fluorescence Imaging with One-Nanometer Accuracy.\n\nThe first measurement was performed in vitro to control the amount of ATP that the motor “ate,” thereby slowing it down so each individual step could be seen. With FIONA, Selvin found that from the biggest motor, Myosin V, (Yildiz, 2003, Science) to the smallest motor, kinesin, (Yildiz, 2004, Science), to one in between (Myosin VI), (Yildiz, 2004, J.Biol.Chem.), the motors all moved in a hand-over-hand, or walking, fashion. This discovery won the award as one of the ten most significant advances in science for 2003, as judged by Science magazine. It also won for Selvin’s student, Ahmet Yildiz, Science’s grand prize (a world-wide competition) for the most noteworthy Ph.D thesis.\n\nSelvin then looked in vivo, i.e., inside a cell (Kural, 2005, Science). Here the time resolution had to be improved to 1 msec—a 500-fold increase—because the ATP was now not under his control, and was at a fairly high concentration. The motion of individual kinesins, and individual dyneins, could be measured, and surprisingly, they could move cargo around more than 10 times faster than what had been measured in vitro!\n\nSelvin is now combing FIONA with optical traps (holding particles with light) in vivo, to see how many motors are causing such large velocities. Selvin’s future plans call for measurements in situ, for example, in Planaria and in C. Elegans, to test how these motors act in “real life.”\n\nSelected Articles in Journals\n\nTeaching Honors List of Teachers Ranked as Excellent by their Students, Fall 1999, Fall 2001, Spring 2002, Spring 2003, Spring 2007, Spring 2015, Spring 2016, Spring 2021\n\nNational Science Foundation CAREER Award for Outstanding Research/Teaching (2000) Research Honors Grass Imaging Fellowship, Marine Biological Lab, Woods Hole, Mass., Summer 2014.\n\nNikon Fellowship, Marine Biological Laboratory, Woods Hole, Massachusetts (2010)\n\nThe International Raymond and Beverly Sackler Prize in Biophysics, Tel Aviv University (2006)\n\nUniversity Scholar, University of Illinois Urbana-Champaign (2006-2007)\n\nFaculty Member of the Precision Proteomics Research Theme, Institute for Genomic Biology (2005-present)\n\nFellow, American Physical Society (2004-present)\n\nPhysics Sony Faculty Scholar (2004-2007)\n\nElected to General council of Biophysical Society (2004)\n\nBiophysical Society Michael and Kate Barany Award for Young Investigators (2004)\n\nBeckman Fellow, Center for Advanced Studies, Urbana (Spring 2000)\n\nCottrell Scholar, Research Corporation (2000)\n\nXerox Award for Outstanding Research (2000)\n\nResearch Innovation Award, Research Corp. (1999)\n\nYoung Fluorescence Investigator Award, Biophysical Society (1999)\n\nAAAS Mass Media Science and Engineering Fellow (1990)\n\nOffice of Technology Assessment Congressional Fellow Winner (1990)"}, {"url": "https://news.illinois.edu/view/6367/808849", "page_content": "CHAMPAIGN, Ill. — An interdisciplinary team of researchers at the University of Illinois at Urbana-Champaign conducted a two-year study on the efficacy of workplace wellness programs and found that such programs have little impact on employee health, health beliefs and medical utilization.\n\nSince the passage of the 2010 Affordable Care Act, the workplace wellness industry has grown rapidly, spurred in part by the law’s incentives for firms to adopt such programs by raising the financial benefits offered to program participants. Among large U.S. firms offering health benefits in 2019, 84% also offered a workplace wellness program to reduce health care costs and improve employee health.\n\nBut a randomized controlled trial showed that, after 24 months, a comprehensive workplace wellness program had no significant effects on measured physical health outcomes such as weight, blood pressure, cholesterol or blood glucose; rates of medical diagnoses; or the use of health care services; according to a new paper co-written by U. of I. scholars David Molitor, Laura Payne and Julian Reif.\n\nThe paper, which was published in the journal JAMA Internal Medicine, comes out of the Illinois Workplace Wellness Study, which examined a workplace wellness program offered to employees from the Urbana campus of the University of Illinois.\n\n“Many employers use workplace wellness programs in an attempt to improve employee health and reduce medical costs, but randomized evaluations of their efficacy are rare,” said Molitor, a professor of finance at the Gies College of Business and a faculty research fellow at the National Bureau of Economic Research. “Our randomized evaluation found no significant effect of the program on employee health measures or medical use.”\n\nThe comprehensive workplace wellness program, dubbed iThrive, was designed to represent a typical corporate wellness program offered by employers. It included three annual components: an on-site biometric screening and survey; an online health risk assessment; and a choice of wellness activities.\n\nIn the study, individual employees were randomly assigned to a treatment group that was eligible to participate in a two-year comprehensive workplace wellness program, or a control group that was ineligible. The researchers evaluated the effects of the program on health beliefs, self-reported health behaviors, clinician-collected biometrics, and claims-based medical diagnoses and medical use.\n\nIn a randomized controlled trial of more than 4,800 U. of I. employees, the researchers found that those invited to join the wellness program showed no significant differences in clinical outcomes compared with the control group.\n\nMeasures taken at 12- and 24-month intervals included 16 clinician-collected biometric outcomes; administrative claims related to medical diagnoses such as diabetes, hypertension and hyperlipidemia, and medical use such as office visits, inpatient visits, and emergency room visits; and 14 self-reported health-behavior and health-belief outcomes.\n\nThe program included paid time off for annual on-site health screenings, health risk assessments and ongoing wellness activities – for example, physical activity programs encouraging campus walks over lunch breaks, smoking-cessation programs and chronic disease self-management programs.\n\nThe program affected two self-reported health outcomes: It increased the proportion of employees reporting that they have a primary care physician and improved employee beliefs about their own health, the authors report.\n\n“A significantly higher proportion of employees in the treatment group reported having a primary care physician after 24 months,” Molitor said. “The workplace wellness program also significantly improved a set of employee health beliefs on average. But we found no significant effect of the program on employee health measures or medical use, demonstrating a mismatch between employee perceptions of workplace wellness programs and an actual improvement in health. These findings shed light on employees’ perceptions of workplace wellness programs, which may influence long-run effects on health.”\n\nThe study adds to a growing body of evidence from randomized evaluations showing that workplace wellness programs affect some self-reported outcomes but are unlikely to significantly improve employee health or reduce medical use in the short term, said Reif, a professor of finance at the Gies College of Business and a faculty research fellow at the National Bureau of Economic Research.\n\n“Many prior studies found that workplace wellness programs improved health and reduced medical use, but those results were likely due to differences in who participates. Our study complements recent randomized studies and demonstrates the value of using randomized evaluations to determine causal impact,” Reif said.\n\nPayne is a professor of recreation, sport and tourism in the College of Applied Health Sciences at the University of Illinois at Urbana-Champaign.\n\nMolitor, Reif and Payne’s co-authors are David Chan, of Stanford University and the National Bureau of Economic Research; and Damon Jones, of the University of Chicago and NBER.\n\nThe research was supported by the National Institute on Aging of the National Institutes of Health; the National Science Foundation; the U.S. Health Care Delivery Initiative of J-PAL North America, a regional office of the Abdul Latif Jameel Poverty Action Lab; Evidence for Action, a program of the Robert Wood Johnson Foundation; and the W.E. Upjohn Institute for Employment Research. Illinois Human Resources provided in-kind logistical support for developing the program."}, {"url": "https://physics.illinois.edu/people/directory/profile/hughest", "page_content": "Taylor L Hughes\n\nPrimary Research Area Condensed Matter Physics Professor (217) 333-1195 hughest@illinois.edu 2115 Engineering Sciences Building\n\nFor More Information\n\nBiography\n\nProfessor Taylor Hughes received his bachelor's degrees in physics and mathematics from the University of Florida in 2003, graduating summa cum laude. He subsequently worked as a software engineer for a year as a department of defense contractor. He went on to obtain a Ph.D. from Stanford University in 2009, working in the condensed matter theory group of Professor Shou-Cheng Zhang. His research covered a broad range of subjects from spintronics, to graphene/graphite, to topological insulators. His two primary research contributions as a graduate student are the collaborations which predicted of the existence of a quantum spin Hall state in HgTe/CdTe quantum wells, and secondly constructed the topological response theory of 3D time-reversal invariant topological insulators.\n\nProfessor Hughes then moved to the University of Illinois at Urbana-Champaign as a postdoc under Professor Eduardo Fradkin. During these two years he began developing methods to characterize states of matter using quantum entanglement, most notably, disordered fermionic systems and topological insulator/ordered systems. Additionally he began working on the theory of the topological visco-elastic response in topological insulators.\n\n\n\nProfessor Hughes joined the faculty at the University of Illinois in the Fall of 2011.\n\nResearch Statement\n\nMy research interests are focused in three main areas:\n\n1. Topological insulators/Superconductors\n\n2. Using quantum information/entanglement techniques to characterize quantum condensed matter systems.\n\n3. Mesoscopic transport in low-dimensional materials or heterostructures\n\nOther interests include topological order, quantum Hall effect, spin-orbit coupled electronic systems, connections between high-energy physics, gravity, and condensed matter.\n\nSome of my recent work has been on connections between torsion, gravity, and viscosity in topological insulators, characterizing disordered topological insulators using the entanglement spectrum, and transport calculations in graphene/superconductor junctions.\n\nInterested students should contact me via email and be willing to work on a broad range of topics. Before contacting me please look at some of my selected publications below, or on the arxiv to get an idea of which subjects are of the most interest to you.\n\nI have several opportunities for research projects/reading courses for undergraduates who are highly-motivated and can program or proficiently use either Matlab, Mathematica, or C/C++/FORTRAN.\n\nPost-Doctoral Research Opportunities\n\nI do not have any (funded) post-doctoral research opportunities at this time.\n\nGraduate Research Opportunities\n\nI have graduate student positions open for one, or possibly two students.\n\nUndergraduate Research Opportunities\n\nProfessor Hughes has several opportunities for research projects/reading courses for undergraduates who are highly-motivated and can program or proficiently use either Matlab, Mathematica, or C/C++. Students must have had at least PHY485 or PHY 486.\n\nSelected Articles in Journals\n\nTeaching Honors Donald Biggar Willett Faculty Scholar (April 2020, May 2022) Research Honors ONR Young Investigator Award (May 2015)\n\nUniversity of Illinois Center for Advanced Study Fellowship (November 2014)\n\nNSF CAREER Award (February 2014)\n\nDean's Award for Excellence in Research for an Assistant Professor (February 2014)\n\nAlfred P. Sloan Foundation Research Fellow (April 2013)"}, {"url": "https://matse.illinois.edu/people/profile/pbraun", "page_content": "Paul V. Braun\n\nProfessor and Grainger Distinguished Chair in Engineering; Director of Materials Research Laboratory (217) 244-7293 pbraun@illinois.edu 2015 Superconductivity Center\n\nFor More Information\n\nMajor Consulting Activities\n\nXerion Advanced Battery Corporation, Kettering, OH\n\n3M Corporation, St. Paul, MN\n\nAutonomic Materials, Inc., Champaign, IL\n\nUT Dots Inc., Champaign, IL\n\nProfessional Highlights\n\nFollowing a postdoctoral appointment at Bell Labs, Lucent Technologies, he joined the faculty of the University of Illinois in 1999. Prof. Braun has co-authored a book, about 300 peer-reviewed publications, been awarded multiple patents, and has co-founded three companies. He is the recipient of the Illinois MatSE Young Alumnus Award (2011), the Friedrich Wilhelm Bessel Research Award of the Alexander von Humboldt Foundation (2010), the Stanley H. Pierce Faculty Award (2010), the 2002 Robert Lansing Hardy Award from TMS, a Beckman Young Investigator Award (2001), a 3M Nontenured Faculty Award (2001), the Xerox Award for Faculty Research (2004, 2009), and multiple teaching awards. In 2006, he was named a University Scholar by the University of Illinois, in 2011 was named the Ivan Racheff Professor of Materials Science and Engineering, and in 2020 was named a Grainger Distinguished Chair in Engineering. Prof. Braun has served on the editorial advisory boards of multiple journals. He was a member of the 2010-2011 DARPA Defense Science Study Group, and the 2015-2017 National Academies Technical Advisory Board for the US Army Research Laboratory. In 2018 Prof. Braun was elected a Fellow of the Materials Research Society.\n\nProf. Paul V. Braun is the Director of the Materials Research Laboratory, the Grainger Distinguished Chair in Engineering, and Professor of Materials Science and Engineering. He also has a co-appointment as a Professor in Chemistry and is affiliated with the Department of Mechanical Sciences and Engineering and the Beckman Institute for Advanced Science and Technology. The Braun group focuses on the synthesis of materials with carefully crafted 3D nano- and mesoscale architectures which lead to emergence of new optical, electrochemical, and thermal functionalities. Recent priority research areas include materials for energy storage, advanced optics, chemical sensing, and the control of heat. Prof. Braun received his B.S. degree with distinction from Cornell University, and his Ph.D. in Materials Science and Engineering from the University of Illinois.\n\nResearch Statement\n\nThe Braun group focuses on new functional materials for energy storage and solar energy harvesting, in particular on the synthesis of materials with carefully crafted 3D nano- and mesoscale architectures which lead to emergence of new optical, electrochemical, and thermal functionalities. The group also has considerable research interests in self-healing materials and materials for chemical sensing.\n\nResearch Areas Polymers\n\nResearch Topics\n\nSelected Articles in Journals\n\nC.R. Ocier, C.A. Richards, D.A. Bacon-Brown, Q. Ding, R. Kumar, T.J. Garcia, J. van de Groep, J.-H. Song, A.J. Cyphersmith, A. Rhode, A.N. Perry, A.J. Littlefield, J. Zhu, D. Xie, H. Gao, J.F. Messinger, M.L. Brongersma, K.C. Toussaint Jr., L.L. Goddard, and P.V. Braun, Direct laser writing of volumetric gradient index lenses and waveguides, Light: Science & Applications 9, 196 (2020). DOI: 10.1038/s41377-020-00431-3\n\nJ.H. Park, C.H. Lee, J.-M. Ju, J.-H. Lee, D. Yim, C. Choi, P.V. Braun, S.U. Lee and J.H. Kim, Molecular Engineering of Nanostructures and Activities on Bifunctional Oxygen Electrocatalysts for Zinc-Air Batteries, Applied Catalysis B: Environmental, 270, 118869 (2020). DOI: 10.1016/j.apcatb.2020.118869\n\nA.M. Abdullah, X. Li, P.V. Braun, J.A. Rogers, and K.J. Hsia, Kirigami Inspired Self-assembly of 3D Structures, Advanced Functional Materials, 30, 190988 (2020). DOI: 10.1002/adfm.201909888\n\nC.R. Ocier, C.A. Richards, D.A. Bacon-Brown, N.A. Krueger, M.K. Clawson, J.A.N.T. Soares and P.V. Braun, Optically anisotropic porous silicon microlenses with tunable refractive indexes and birefringence profiles, Optical Materials Express, 10, 4, 868-883 (2020). DOI: 10.1364/OME.385013\n\nS.B. Kim, J. Koo, J. Yoon, A. Hourlier-Fargette, B. Lee, S.L. Chen, S. Jo, J. Choi, Y.S. Oh, G. Lee, S.M. Won, A.J. Aranyosi, S.P. Lee, J.B. Model, P.V. Braun, R. Ghaffari, C. Park, and J.A. Rogers, Soft, skin-interfaced microfluidic systems with integrated enzymatic assays for measuring the concentration of ammonia and ethanol in sweat, Lab on a Chip, 20, 84-92 (2020). DOI: 10.1039/C9LC01045A\n\nT. Yang, J.G. Kang, P.B. Weisensee, B. Kwon, P.V. Braun, N. Miljkovic, and W.P. King, A Composite Phase Change Material Thermal Buffer Based on Porous Metal Foam and Low-Melting-Temperature Metal Alloy, Applied Physics Letters, 116, 7 (2020). DOI: 10.1063/1.5135568\n\nW. Huang, Z. Yang, M. Kraman, Q. Wang, Z. Ou, M.M. Rojo, A. S. Yalamarthy, V. Chen, F. Lian, J.H. Ni, S. Liu, H. Yu, L. Sang, J. Michaels, D.J. Sievers, J.G. Eden, P.V. Braun, Q. Chen, S. Gong, D.G. Senesky, E. Pop, and X. Li, Monolithic mtesla-level magnetic induction by self-rolled-up membrane technology, Science Advances, 6, 3, eaay4508 (2020). DOI: 10.1126/sciadv.aay4508\n\nA.A. Kulkarni, E. Hanson, R. Zhang, K. Thornton, and P.V. Braun, Archimedean lattices emerge in template-directed eutectic solidification, Nature, 577, 355-358 (2020). DOE 10.1038/s41586-019-1893-9\n\nP.P. Sun, R. Zhang, W. Chen, P.V. Braun and J.G. Eden, Dynamic Plasma/Metal/Dielectric Photonic Crystals in the mm-Wave Region: Electromagnetically-Active Artificial Material for Wireless Communications and Sensors, Applied Physics Reviews, 6, 041406 (2019). DOI: 10.1063/1.5120037\n\nZ. Ou, A. Kim, W. Huang, P.V. Braun, X. Li, and Q. Chen, Reconfigurable nanoscale soft materials, Current Opinion in Solid State & Materials Science, 23, 1, 41-49 (2019). DOI: 10.1016/j.cossms.2018.12.002\n\nP. Shetty, S.S. Daryadel, B.T. Haire, Z.R. Tucker, T. Wu, V. Subramani, J.J. Morrison, P. Quayle, S. Yeates, P.V. Braun and J.A. Krogstad, Low-temperature Pack Aluminization Process on Pipeline Steel to Inhibit Asphaltene Deposition, ACS Applied Materials & Interfaces, 11, 47596-47605 (2019). DOI: 10.1021/acsami.9b17430\n\nZ. Li, X. Zhan, W. Zhu, S. Qi and P.V. Braun, Carbon-free, High-capacity, and Long Cycle Nanowires/Metallic 1T MoS2 Composite Lithium-ion Battery Anodes, ACS Applied Materials & Interfaces, 11, 44593-44600 (2019). DOI: 10.1021/acsami.9b15543\n\nT. Yang, T. Foulkes, B. Kwon, J.G. Kang, P.V. Braun, W.P. King and N. Miljkovic, An Integrated Liquid Metal Thermal Switch for Active Thermal Management of Electronics, Transactions on Components, Packaging and Manufacturing Technology, 9, 12, 2341-2351 (2019). DOI: 10.1109/TCPMT. 2019.2930089\n\nS. Zhang, C. Zhang, H. Chen, S.J. Kieffer, F. Neubrech, H. Giessen, A.G. Alleyne and P.V. Braun, Selective Autonomous Molecular Transport and Collection by Hydrogel-embedded Supramolecular Chemical Gradients, Angewandte Chemie, 58, 1-7 (2019). DOI: 10 .1002/anie.201908647 (cover)\n\nW.M. Jones, R. Zhang, E. Murty, X. Zhu, Y. Yao, H. Manohara, P.V. Braun and L.C. Montemayor, Field Emitters Using Inverse Opal Structures, Advanced Functional Materials, 29, 1808571 (2019). DOI: 10.1002/adfm.201808571\n\nS. Kim, J. Choiu, S.-M. Bak, L. Sang, Q. Li, A. Patra,and P.V. Braun, Reversible Conversion Reactions and Small First Cycle Irreversible Capacity Loss in Metal Sulfide‐Based Electrodes Enabled by Solid Electrolytes, Advanced Functional Materials, 29, 1901719 (2019). DOI: 10.1002/adfm.201901719\n\nS. Kim, S. Qu, R. Zhang and P.V. Braun, High Volumetric and Gravimetric Capacity Electrodeposited Mesostructured Sb2O3 Sodium Ion Battery Anodes, Small, 15, 1900258 (2019). DOI: 10.1002/smll.201900258\n\nZ. Zheng, B. Chen, N. Fritz, Y. Gurumukhi, J. Cook, M.N. Ates, N. Miljkovic, P.V. Braun and P. Wang, Lithiation Induced Stress Concentration for 3D Metal Scaffold Structured Silicon Anodes, Journal of Electrochmical Society, 166, A2083-A2090 (2019). DOI: 10.1149/2.1031910jes\n\nW. Chen, X. Zhan, B. Luo, Z. Ou, P.-C. Shih, L. Yao, S. Pidaparthy, A. Patra, H. An, P.V. Braun, R. Stephens, H. Yang, J.-M. Zuo and Q. Chen, Effects of Particle Size on Mg2+ Ion Intercalation into λ-MnO2 Cathode Materials, Nano Letters, 19, 4712-4720 (2019). DOI: 10.1021/acs.nanolett.9b01780\n\nP. Sun, J. Davis III, L. Cao, Z. Jiang, J.B. Cook, H. Ning, J. Liu, S. Kim, F. Fan, R.G. Nuzzo and P.V. Braun, High capacity 3D structured tin-based electroplated Li-ion battery anodes, Energy Storage Materials, 17, 151-156 (2019). DOI: doi.org/10.1016/j.ensm.2018.11.017\n\nS. Yun, S.-M. Bak, S. Kim, J.S. Yeon, M.G. Kim, X.-Q. Yang, P.V. Braun and H.S. Park, Rational Design of Hierarchically Open-Porous Spherical Hybrid Architectures for Lithium-Ion Batteries, Advanced Energy Materials, 9, 1802816 (2019). DOI: 10.1002/aenm.201802816\n\nK.A. Miller, E.G. Morado, S.R. Samanta, B.A. Walker, A.Z. Nelson, S. Sen, D.T. Tran, D.J. Whitaker, R.H. Ewoldt, P.V. Braun and S.C. Zimmerman, Acid-Triggered, Acid-Generating, and Self-Amplifying Degradable Polymers, Journal of the American Chemical Society, 141, 2838-2842 (2019). DOI: 10.1021/jacs.8b07705\n\nE.S. Epstein, L. Martinetti, R. Kollarigowda, O. C.-D. La Torre, J.S. Moore, R.H. Ewoldt and P.V. Braun, Modulating Noncovalent Cross-links with Molecular Switches, JACS, 141, 3597-3604 (2019). DOI: 10.1021/jacs.8b12762\n\nV. Akkisetty, R.T. Rooney, S. Lai, A.A. Gewirth and P.V. Braun, Trimethylsilyl Azide (TMSN3) Enhanced Li-O2 Battery Electrolytes, ACS Applied Energy Materials, 2, 2662-2671 (2019). DOI: 10.1021/acsaem.9b00007\n\nJ. Shin, J. Sung, M. Kang, X. Xie, B. Lee, K.M. Lee, T.J. White, C. Leal, N.R. Sottos, P.V. Braun and D.G. Cahill, Light-triggered thermal conductivity switching in azobenzene polymers, PNAS, 116, 13, 5973-5978 (2019). DOI: 10.1073/pnas.1817082116\n\nP.P. Shetty, R. Zhang, B.T. Haire, C.S. Smith, L.M. Kenny, T. Wu, V. Subramani, J.J. Morrison, P. Quayle, S. Yeates, P.V. Braun and J.A. Krogstad, Effect of Surface Chemistry and Roughness on the High-Temperature Deposition of a Model Asphaltene, Energy & Fuels, 33, 4104-4114 (2019). DOI: 10.1021/acs.energyfuels.9b00386\n\nJ. Pu, J. Li, K. Zhang, T. Zhang, C. Li, H. Ma, J. Zhu, P.V. Braun, J. Lu and H. Zhang, Conductivity and lithiophilicity gradients guide lithium deposition to mitigate short circuits, Nature Communications, 10, 1896 (2019). DOI: 10.1038/s41467-019-09932-1\n\nL. Tian, B. Zimmerman, A. Akhtar, K.J. Yu, M. Moore, J. Wu, R.J. Larsen, J.W. Lee, J. Li, Y. Liu, B. Metzger, S. Qu, X. Guo, K.E. Mathewson, J.A. Fan, J. Cornman, M. Fatina, Z. Xie, Y. Ma, J. Zhang, Y. Zhang, F. Dolcos, M. Fabiani, G. Gratton, T. Bretl, L.J. Hargrove, P.V. Braun, Y. Huang and J.A. Rogers, Large-area MRI-compatible epidermal electronic interfaces for prosthetic control and cognitive monitoring, Nature Biomedical Engineering, 3, 194-205 (2019). DOI: 10.1038/s41551-019-0347-x\n\nZ. Li, P. Sun, X. Zhan, Q. Zheng, T. Feng, P.V. Braun and S. Qi, Metallic 1T phase MoS2/MnO composites with improved cyclability for lithium-ion battery anodes, Journal of Alloys and Compounds, 796, 25-32 (2019). DOI: 10.1016/j.jallcom.2019.04.313\n\nA.A. Kulkarni, J. Kohanek, E. Hanson, E. Hanson, K. Thornton and P.V. Braun, Control of lamellar eutectic orientation via template-directed solidification, Acta Materialia, 166, 715-722 (2019). DOI: 10.1016/j.actamat.2019.01.016\n\nJ. Liu, X. Lin, H. Zhang, Z. Shen, Q. Lu, J. Niu, J. Li and P.V. Braun, A bee pupa-infilled honeycomb structure-inspired Li2MnSiO4 cathode for high volumetric energy density secondary batteries, Chemical Communications, 55, 3582-3585 (2019). DOI: 10.1039/c9cc00729f (cover)\n\nJ.H. Pikul, S. Özerinc, B. Liu, R. Zhang, P.V. Braun, V.S. Deshpande and W.P. King, High strength metallic wood from nanostructured nickel inverse opal materials, Scientific Reports, 9, 719 (2019). DOI: 10.1038/s41598-018-36901-3\n\nA. Ghosh, G. Chaudhary, J.G. Kang, P.V. Braun, R.H. Ewoldt and K.S. Schweizer, Linear and nonlinear rheology and structural relaxation in dense glassy and jammed soft repulsive pNIPAM microgel suspensions, Soft Matter 15, 1038-1052 (2019). DOI: 10.1039/C8SM02014K\n\nK. Nan, H. Wang, X. Ning, K. A. Miller, C. Wei, Y. Liu, H. Li, Y. Xue, Z. Xie, H. Luan, Y. Zhang, Y. Huang, J.A. Rogers and P.V. Braun, Soft Three-Dimensional Microscale Vibratory Platforms for Characterization of Nano-Thin Polymer Films, ACS Nano 13, 449-457 (2019). DOI: 10.1021/acsnano.8b06736\n\nG. Chaudhary, A. Ghosh, A. Bhardwaj, J.G. Kang, P.V. Braun, K.S. Schweizer and R.H. Ewoldt, Thermoresponsive stiffening with microgel particles in a semiflexible fibrin network, Macromolecules, 52, 3029-3041 (2019). DOI: 10.1021/acs.macromol.9b00124\n\nK.W. Tan, J. Werner, M. Goodman, H.S. Kim, B. Jung, H. Sai, P.V. Braun, M. Thompson and U. Wiesner, Synthesis and Formation Mechanism of All-Organic Block Copolymer-Directed Templating of Laser-Induced Crystalline Silicon Nanostructures, ACS Applied Materials & Interfaces, 10, 42777-42785 (2018). DOI: 10.1021/acsami.8b12706\n\nX. Li, J. Shao, S.-K. Kim, C. Yao, J. Wang, Y.-R. Miao, Q. Zheng, P. Sun, R. Zhang and P.V. Braun, High energy flexible supercapacitors formed via bottom-up in filling of gel electrolytes into thick porous electrodes, Nature Communications, 9, 2578 (2018). DOI: 10.1038/s41467-018-04937-8\n\nZ. Ou, X. Song, W. Huang, X. Jiang, S. Qu, Q. Wang, P.V. Braun, J.S. Moore, X. Li and Q. Chen, Colloidal Metal-Organic Framework Hexapods Prepared from Postsynthesis Etching with Enhanced Catalytic Activity and Rollable Packing, ACS Applied Materials & Interfaces, 10, 40990-40995 (2018). DOI: 10.1021/acsami.8b17477\n\nB.M. Mosby, S. Shah and P.V. Braun, Salt Water-Triggered Ionic Crosslinking of Polymer Composites by Controlled Release of Functional Ions, ACS Omega, 3, 16127-16133 (2018). DOI: 10.1021/acsomega.8b02786\n\nZ. Yu, J. Wang, N. Zhang, J. Shin, Q. Zheng, S. Qu, X. He, A. Rockett, H. Yang, Z. Jiang and P.V. Braun, Dendritic Nanostructured FeS2-Based High Stability and Capacity Li-ion Cathodes, RSC Advances, 8, 38745-38750 (2018). DOI: 10.1039/C8RA07606E\n\nM. Ali, T.-H. Tsai and P.V. Braun, Amplified Detection of Chemical Warfare Agents using 2D Chemical Potential Gradients, ACS Omega, 3, 14665-14670 (2018). DOI: 10.1021/acsomega.8b01519\n\nM. Yang, J. Choi, S-K. Kim, and P.V. Braun, Flexible binder-free CuS/polydopamine-coated carbon cloth for high voltage supercapacitors, Energy Technology, 6, 1-8 (2018). DOI: 10.1002/ente.201800153.\n\nJ. Pu, J. Li, S. Zihan, C. Zhong, J. Liu, H. Ma, J. Zhu, H. Zhang and P.V. Braun, Interlayer Lithium Plating in Au Nanoparticles Pillared Reduced Graphene Oxide for Lithium Metal Anodes, Advanced Functional Materials, 1804133 (2018). DOI: 10.1002/adfm.201804133\n\nP.P. Shetty, R. Zhang, J.P. Angle, P.V. Braun and J.A. Krogstad, Pack Aluminization Assisted Enhancement of Thermo-mechanical Properties in Nickel Inverse Opal Structures, Chemistry of Materials, 30, 1648-1654 (2018). DOI: 10.1021/acs.chemmater.7b04988\n\nD. Pham-Cong, S.J. Kim, S.-Y. Jeong, J. Pil, P.V. Braun and C.-R. Cho, Enhanced Cycling Stability of Fe3O4 Nanoparticles Encapsulated with Nitrogen-Doped Carbon and Graphene Frameworks for Lithium-Ion Battery Anodes, Carbon, 129, 621-630 (2018). DOI: 10.1016/j.carbon.2017.12.073\n\nN. Sekerak, K. Hutchins, B. Luo, J.G. Kang, P.V. Braun, Q. Chen and J.S. Moore, Size Control of Cross-Linked Carboxy-Functionalized Polystyrene Particles: Four Orders of Magnitude of Dimensional Versatility, European Polymer Journal, 101, 202-210 (2018). DOI: 10.1016/j.eurpolymj.2018.01.028\n\nS. Zhang, S.J. Kieffer, C. Zhang, A.G. Alleyne and P.V. Braun, Directed Molecular Collection by E-jet Printed Micro-Scale Chemical Potential Wells in Hydrogel Films, Advanced Materials, 30, 1803140 (2018). DOI:10.1002/adma.201803140\n\nN.A. Krueger, A.L. Holsteen, Q. Zhao, S.-K. Kang, C.R. Ocier, W. Zhou, G. Mensing, J.A. Rogers, M.L. Brongersma and P.V. Braun, Electrochemical Fabrication of Flat, Polymer‐Embedded Porous Silicon 1D Gradient Refractive Index Microlens Arrays, Physica Status Solidi A, 215, 1800088 (2018). DOI: 10.1002/pssa.201800088\n\nW. Bai, H. Yang, Y. Ma, H. Chen, J. Shin, Y. Liu, Q. Yang, I. Kandela, Z. Liu, S.-K. Kang, C. Wei, C.R. Haney, A. Brikha, X. Ge, X. Feng, P.V. Braun, Y. Huang, W. Zhou and J.A. Rogers, Flexible Transient Optical Waveguides and Surface‐Wave Biosensors Constructed from Monocrystalline Silicon, Advanced Materials, 30, 1801584 (2018). DOI: 10.1002/adma.201801584\n\nA.M. Abdullah, X. Li, P.V. Braun, J.A. Rogers and K.J. Hsia, Self-folded Gripper-like Architectures from Stimuli-responsive Bilayers, Advanced Materials, 30, 1801669 (2018). DOI: 10.1002/adma.201801669\n\nJ. Choi, A.A. Kulkarni, E. Hanson, D. Bacon-Brown, K. Thornton and P.V. Braun, Processing-Dependent Microstructure of AgCl-CsAgCl2 Eutectic Photonic Crystals, Advanced Optical Materials, 6, 1701316 (2018). DOI: 10.1002/adom.201701316\n\nA.A. Kulkarni, J. Kohanek, K.I. Tyler, E. Hanson, D.-U. Kim, K. Thornton and P.V. Braun, Template-Directed Solidification of Eutectic Optical Materials, Advanced Optical Materials, 6, 1800071 (2018). DOI: 10.1002/adom.201800071\n\nN.A. Krueger, A.L. Holsteen, Q. Zhao, S.-K. Kang, C.R. Ocier, W. Zhou, G. Mensing, J.A. Rogers, M.L. Brongersma and P.V. Braun, Electrochemical Fabrication of Flat, Polymer-Embedded Porous Silicon 1D Gradient Refractive Index Microlens Arrays, Physica Status Solidi A: Applications and Materials Science 215, 1800088 (2018). DOI: 10.1002/pssa.201800088\n\nP.V. Braun and J.B. Cook, Deterministic Design of Chemistry and Mesostructure in Li-Ion Battery Electrodes, ACS Nano 12, 3060-3064 (2018). DOI: 10.1021/acsnano.8b01885\n\nD. Bacon-Brown and P.V. Braun, Tunable Antireflection Coating to Remove Index-Matching Requirement for Interference Lithography, Advanced Optical Materials, 6, 1707049 (2018). DOI: 10.1002/adom.201701049\n\nZ. Yan, M. Han, Y. Shi, A. Badea, Y. Yang, A. Kulkarni, E. Hanson, M.E. Kandel, X. Wen, F. Zhang, Y. Luo, Q. Lin, H. Zhang, X. Guo, Y. Huang, K. Nan, S. Jia, A.W. Oraham, M.B. Mevis, J. Lim, X. Guo, M. Gao, W. Ryu, K.J. Yu, B.G. Nicolau, A. Petronico, S.S. Rubakhin, J. Lou, P.M. Ajayan, K. Thornton, G. Popescu, D. Fang, J.V. Sweedler, P.V. Braun, H. Zhang, R.G. Nuzzo, Y. Huang, Y. Zhang and J.A. Rogers, Three-Dimensional Mesostructures as High Temperature Growth Templates, Electronic Cellular Scaffolds and Self-Propelled Micro-Robots, PNAS (2017). DOI: 10.1073/pnas.1713805114\n\nJ. Oh, R. Zhang, P. Shetty, J. Krogstad, P.V. Braun, N. Miljkovic, Thin Film Condensation on Nanostructured Surfaces, Advanced Functional Materials, 28, 1707000 (2018). DOI: 10.1002/adfm.201707000\n\nJ. Liu, P. Zhou, T. Han, J. Huang, J. Liu, J. Li and P.V. Braun, Ni-encapsulated TiO2 nanotube array prepared using atomic layer deposition as a high-performance Li-ion battery anode, Materials Letters, 219, 12-15 (2018). DOI:10.1016/j.matlet.2018.02.036\n\nC. Tang, P. Sun, J. Xie, Z. Tang, Z. Yang, Z. Dong, G. Cao, S. Zhang, P.V. Braun and X. Zhao, Engineering layer structure of MoS2-graphene composites with robust and fast lithium storage for high-performance Li-ion capacitors, Energy Storage Materials, 9, 195-205 (2017). DOI: 10.1016/j.ensm.2017.07.013\n\nM.P.B. Glazer, J. Wang, J. Cho, J. Almer, J.S. Okasinski, P.V. Braun, D.C. Dunand, In Operando X-ray Diffraction Strain Measurement in Ni3Sn2 -Coated Inverse-Opal Ni Nanoscaffold Anodes for Li-ion Batteries, Journal of Power Sources, 367, 80-89 (2017). DOI: 10.1016/j.jpowsour.2017.09.040\n\nT. Yan, B. Kwon, P.B. Weisensee, J.G. Kang, X. Li, P.V. Braun, N. Miljkovic and W.P. King, Millimeter-scale liquid metal droplet thermal switch, Applied Physics Letters, 112, 063505 (2018). DOI: 10.1063/1.5013623\n\nM. Miyake, M. Suginohara, N. Narahara, T. Hirato and P.V. Braun, Low-temperature hydrothermal synthesis of colloidal crys-tal templated nanostructured single-crystalline ZnO, Chemistry of Materials, 29, 9734-9741 (2017). DOI: 10.1021/acs.chemmater.7b03466\n\nS. Kim, S.-K. Kim, P. Sun, N. Oh and P.V. Braun, Reduced graphene oxide/LiI composite lithium ion battery cathodes, Nano Letters, 17, 6893-6899 (2017). DOI: 10.1021/acs.nanolett7b03290\n\nP. Yuan, J.M. McCracken, D. Gross, P.V. Braun, J.S. Moore and R.G. Nuzzo, A Programmable Soft Chemo-mechanical Actuator Exploiting a Catalyzed Photochemical Water-Oxidation Reaction, Soft Matter, 13, 7312-7317 (2017). DOI: 10.1039/C7SM01600J\n\nY. Wan, N.A. Krueger, C.R. Ocier, P. Su, P.V. Braun and B.T. Cunningham, Resonant mode engineering using low-index porous silicon dioxide in a photonic crystal sensor, Advanced Optical Materials, 5, 1700605 (2017). DOI: 10.1002/adom.201700605\n\nA.M. Abdullah, P.V. Braun and K.J. Hsia, Bifurcation of Self-folded Polygonal Bilayers, Applied Physics Letters, 11 104101-1 (2017). DOI: 10.1063/1.5001699\n\nS. Kim, J. Liu, K. Sun, S.J. Dillon and P.V. Braun, Improved performance in FeF2 Conversion Cathodes through use of a Conductive 3D scaffold and Al2O3 ALD coating, Advanced Functional Materials, 27, 1702783 (2017). DOI: 10.1002/adfm.201702783\n\nJ. Choi, N.R. Kim, K. Lim, K. Ku, H.J. Yoon, J.G. Kang, K. Kang, P.V. Braun, H.-J. Jin, Y.S. Yoon, Tin Sulfide-Based Nanohybrid for High Performance Anode of Sodium-Ion Batteries, Small, 13, 170076 (2017). DOI: 10.1002/smll.201700767\n\nM.P.B. Glazer, J. Wang, J. Cho, J.D. Almer, J.S. Okasinski, P.V. Braun and D.C. Dunand, In operando X-ray diffraction strain measurement in Ni3Sn2 – Coated inverse opal nanoscaffold anodes for Li-ion batteries, Journal of Power Sources, 367, 80-89 (2017). DOI: 10.1016/j.jpowsour.2017.09.040\n\nR. Zhang, J. Cohen, S. Fan and P.V. Braun, Electrodeposited High Strength, Thermally Stable Spectrally Selective Rhenium Nickel Inverse Opals, Nanoscale, 9, 11187-11194 (2017). DOI: 10.1039/C7NR03567E\n\nY. Myung, J. Choi, F. Wu, S. Banerjee, E. Majzoub, J. Jin, S. Son, P.V. Braun and P. Banerjee, Cationically Substituted Bi0.7Fe0.3OCl Nanosheets as Li-Ion Battery Anodes, ACS Applied Materials and Interfaces, 9, 14187-14196 (2017). DOI: 10.1021/acsami.6b16822\n\nS. Kim, H.J. Koo, J. Liu and P.V. Braun, Flexible and Wearable Fiber Micro-Supercapacitors Based on Carbon Nanotube-Agarose Gel Composite Electrodes, ACS Applied Materials & Interfaces, 9, 19925-19933 (2017). DOI: 10.1021/acsami.7b04753\n\nJ. Pikul, P.V. Braun and W. King, Performance modeling and design of ultra-high power microbatteries, Journal of The Electrochemical Society, 164, E3122-E3131 (2017). DOI: 10.1149/2.0151711jes\n\nT.-H. Tsai, M.A. Ali, Z. Jiang and P.V. Braun, Dynamic Gradient Directed Molecular Transport and Concentration in Hydrogel Films, Angewandte Chemie, 56, 5001-5006 (2017). DOI: 10.1002/anie.201700166\n\nC.R. Ocier, N.A. Krueger, W. Zhou and P.V. Braun, Tunable Visibly Transparent Optics Derived from Porous Silicon, ACS Photonics, 4, 909-914 (2017). DOI: 10.1021/acsphotonics.6b01001\n\nH. Zhang, H. Ning, J. Busbee, Z. Shen, C. Kiggins, Y. Huang, J. Eaves, J. Davis, T. Shi, Y.-T. Shao, J.-M. Zuo, X. Hong, Y. Chen, S. Wang, P. Wang, P. Sun, S. Xu, J. Liu, and P.V. Braun, Electroplating Lithium Transition Metal Oxides, Science Advances, 3, e1602427 (2017). DOI: 10.1126/sciadv.1602427\n\nA.L. Stanton, K.A. Serrano, P.V. Braun and R.C. Bailey, Polymer Brush-Modified Microring Resonators for Partition-Enhanced Small Molecule Chemical Detection, Chemistry Select, 2, 1521-1524 (2017). DOI: 10.1002/slct.201700082\n\nN.A.K. Bharadwaj, J.G. Kang, M.C. Hatzell, K.S. Schweizer, P.V. Braun and R. Ewoldt, Integration of colloids into a semi-flexible network of fibrin, Soft Matter, 13, 1430-1443 (2017). DOI: 10.1039/C6SM02141G\n\nX. Xie, D. Li, T.-H. Tsai, J. Liu, P.V. Braun, D.G. Cahill, Thermal Conductivity, Heat Capacity, and Elastic Constants of Water-Soluble Polymers and Polymer Blends, Macromolecules, 49, 972-978 (2016). DOI: 10.1021/acs.macromol.5b02477\n\nJ. Kim, J.-Y. Kim, D. Pham-Cong, S.-Y. Jeong, J. Chang, P.V. Braun and C.-R. Cho, Individually carbon-coated and electrostatic-force-derived graphene-oxide-wrapped Li4Ti5O12 nanofibers as anode material for lithium-ion batteries, Electrochimica Actra, 199, 35-44 (2016). DOI: 10.1016/j.electacta.2016.03.137\n\nJ. Shin, M. Kang, T.-H. Tsai, C. Leal, P.V. Braun and D. Cahill, Thermally-functional liquid crystal networks by magnetic field driven molecular orientation, ACS Macro Letters, 5, 955-960 (2016). DOI: 10.1021/acsmacrolett.6b00475\n\nD. Pham-Cong, J.H. Choi, J. Yun, A.S. Bandarenka, J. Kim, P.V. Braun, S.-Y. Jeong and C.R. Cho, Synergistically Enhanced Electrochemical Performance of Hierarchical MoS2/TiNb207 Hetero-Nanostructures as Anode Materials for Li-Ion Batteries, ACS Nano, 11, 1026-1033 (2017). DOI: 10.1021/acsnano.6b07666\n\nN.A. Krueger, A.L. Holsteen, S.-K. Kang, C. Ocier, W. Zhou, G. Mensing, J.A. Rogers, M.L. Brongersma and P.V. Braun, Porous silicon gradient refractive index micro-optics, Nano Letters, 16, 7402-7407 (2016). DOI: 10.1021/acs.nanolett.6b02939\n\nD. Pham-Cong, J.S. Park, J.H. Kim, J. Kim, P.V. Braun, J.H. Choi, S.J. Kim, S.Y. Jeong, C.R. Cho, Enhanced cycle stability of polypyrrole-derviced nitrogen-doped carbon-coated tin oxide hollow nanofibers for lithium battery anodes, Carbon, 111, 28-37 (2017). DOI: 10.1016/j.carbon.2016.09.057\n\nX. Xie, K. Yang, D. Li, T.-H. Tsai, J. Shin, P.V. Braun and D.G. Cahill, High and low thermal conductivity of amorphous macromolecules, Physical Review B, 95, 035406 (2017). DOI: 10.1103/PhysRevB.95.035406\n\nK.V. Waynant, H.-J. Koo, C. Zhang and P.V. Braun, Qualitative degradation of the pesticide coumaphos in solution, controlled aerosol, and solid phases on quaternary ammonium fluoride polymer brushes, Polymers for Advanced Technologies, 28, 73-79 (2017). DOI: 10.1002/pat.3861\n\nJ.H. Choi, J. Kim, H. Yoo, J. Liu, S. Kim, C.-W. Baik, C.-R. Cho, J.G. Kang, M. Kim, P.V. Braun, S. Hwang and T.-S. Jung, Heteroepitaxial Growth of GaN on unconventional templates and layer-transfer for large-area, flexible or stretchable light-emitting diodes, Advanced Optical Materials, 4, 505-521 (2015). DOI: 10.1002/adom.201500526\n\nJ. Liu, Q. Zheng, M.D. Goodman, H. Zhu, J. Kim, N.A. Krueger, H. Ning, X. Huang, J. Liu, M. Terrones and P.V. Braun, Graphene Sandwiched Mesostructured Li-Ion Battery Electrodes, Advanced Materials, 28, 7696-7702 (2016). DOI: 10.1002/adma.201600829\n\nJ. Liu, X. Chen, J. Kim, Q. Zheng, H. Ning, P. Sun, X. Huang, J. Liu, J. Niu and P.V. Braun, High volumetric capacity three-dimensionally sphere-caged secondary battery anodes, Nano Letters, 16, 4501-4507 (2016). DOI: 10.1021/acs.nanolett.6b01711\n\nR. Zhang, H. Ning, N.A. Krueger, D. Bacon-Brown and P.V. Braun, 3D Holographic Photonic Crystals Containing Embedded Functional Features, Advanced Optical Materials, 4, 1533-1540 (2016). DOI: 10.1002/adom.201600158\n\nS. Peng, R. Zhang, V. Chen, E. Khabiboulline, P.V. Braun and H. Atwater, Three-dimensional single gyroid photonic crystals with a mid-infrared bandgap, ACS Photonics, 3, 1131-1137 (2016). DOI: 10.1021/acsphotonics.6b00293\n\nQ. Zheng, P.V. Braun and D.C. Cahill, Thermal conductivity of graphite thin films grown by low temperature chemical vapor deposition on Ni (111), Advanced Materials Interfaces, 3, 1600234 (2016). DOI: 10.1002/admi.201600234\n\nXiao, T., Cifci, O., Bhargava, S. Chen, H., Gissibl, T., Zhou, W., Giessen, H., Toussaint, K., Yablonovitch, E. and Braun, P.V., Diffractive Spectral-Splitting Optical Element Designed by Adjoint-Based Electromagnetic Optimization and Fabricated by Femtosecond 3D Direct Laser Writing, ACS Photonics, 3, 886-894 (2016). DOI: 10.1021/acsphotonics.6b00066\n\nM. T. Barako, A. Sood, C. Zhang, J. Wang, T. Kodama, M. Asheghi, X. Zheng, P.V. Braun, K. Goodson, Quasi-ballistic Electronic Thermal Conduction in Metal Inverse Opals, Nano Letters, 16, 2754-2761 (2016). DOI: 10.1021/acs.nanolett.6b00468\n\nS.-K. Kang, R.KJ. Murphy, S.-W. Hwang, S.M. Lee, D.V. Harburg, N.A. Krueger, J. Shin, P. gamble, H. Cheng, S. Yu, Z. Liu, J.G. McCall, M. Stephens, H. Ying, J. Kim, G. Park, R.C. Webb, C.H. Lee, S. Chung, D.S. Wie, A.D. Gujar, B. Vemulapalli, A.H. Kim, K-M. Lee, J. Cheng, Y. Huang, P.V. Braun, W.Z. Ray and J.A. Rogers, Bioresorbable Silicon Sensors for the Brain with Implantable Wireless Operation, Nature, 530, 71-76 (2016). DOI: 10.1038/nature16492\n\nD. Pham-Cong, J.S. Park, J.-H. Kim, J. Kim, P.V. Braun, , J.H. Choi, S.J. Kim, S.-Y. Jeong and C.R. Cho, Enhanced cycle stability of polypyrrole-derived nitrogen-doped carbon-coated tin oxide hollow nanofibers for lithium battery anodes, Carbon, 111, 28-37 (2016). DOI: 10.1016/j.carbon.2016.09.057\n\nA. M. Abdullah, P.V. Braun and J. Hsia, Programmable Shape Transformation of Spherical Domes, Soft Matter, 12, 6184-6195 (2016). DOI: 10.1039/C6SM00532B\n\nJ. Pikul, J. Liu, P.V. Braun and W.P. King, Integration of High Capacity Materials into Interdigitated Mesostructured Electrodes for High Energy and High Power Density Primary Microbatteries, Journal of Power Sources, 315, 308-315 (2016). DOI: 10.1016/j.jpowsour.2016.03.034\n\nY.S. Yun, Y.-U. Park, S.-J. Chang, B.H. Kim, J. Choi, J. Wang, D. Zhang, P.V. Braun, H.-J. Jin and K. Kang, Crumpled graphene paper for high power sodium battery anode, Carbon, 99, 658-664 (2016). DOI: 10.1016/j.carbon.2015.12.047\n\nS.-K. Kim, J. Cho, J.S. Moore, H.S. Park and P.V. Braun, High-Performance Mesostructured Organic Hybrid Pseudocapacitor Electrodes, Advanced Functional Materials, 26, 903-910 (2016). DOI: 10.1002/adfm.201504307\n\nH. Zhang, T. Shi, D.J. Wetzel, R. Nuzzo and P.V. Braun, 3D Scaffolded Nickel-Tin Li-Ion Anodes with Enhanced Cyclability, Advanced Materials, 28, 742-747 (2016). DOI: 10.1002/adma.201504780\n\nQ. Zheng, H. Kim, R. Zhang, M. Sardela, J.-M. Zuo,B. Manavaimaran, S. Lourdudoss, Y.-T. Sun and P.V. Braun, Epitaxial growth of three dimensionally structured III-V photonic crystal via hydride vapor phase epitaxy, Journal of Applied Physics, 118, 224303 (2015). DOI: 10.1063/1.4937273\n\nE. Epstein, J. Yoon, A. Madhukar, J. Hsia and P.V. Braun, Colloidal Particles that Rapidly Change Shape via Elastic Instabilities, Small, 11, 6051-6057 (2015). DOI: 10.1002/smll.201502198\n\nM.D. Goodman, S. Kim, N. Tatsuda, K. Yano and P.V. Braun, Enhanced secondary battery anodes based on Si and Fe3O4 nanoparticle infill monodisperse carbon starburst colloidal crystals, Particle & Particle Systems Characterization, 32, 928-933 (2015). DOI: 10.1002/ppsc.201500081\n\nS.-K. Kim, H.J. Kim, J.-C. Lee, P.V. Braun and H.S. Park, Extremely Durable, Flexible Supercapacitors with Greatly Improved Performance at High Temperatures, ACS Nano, 9, 8569-8577 (2015). DOI: 10.1021/acsnano.5b03732\n\nJ. Liu, J. Wang, J. Kim, H. Ning, Z. Pan, S. Kelly, E. Epstein, X.-J. Huang, J. Liu and P.V. Braun, High Full-Electrode Basis Capacity Template-Free Three-Dimensional Nanocomposite Secondary Battery Anodes, Small, 11, 6265-6271 (2015). DOI: 10.1002/smll.201502538\n\nZ. Wang, D.L. Marks, P.S. Carney, L.J. Millet, M.U. Gillette, A. Mihi, P.V. Braun, Z. Shen, S.G. Prasanth and G. Popescu, Spatial light interference tomography (SLIT), Optics Express, 19, 19907-18 (2011). DOI: 10.1364/OE.19.019907\n\nS.-K. Kim, E. Jung, MD. Goodman, K.S. Schweizer, N. Tatsuda, K. Yano and P.V. Braun, Self-Assembly of Monodisperse Starburst Carbon Spheres into Hierarchically Organized Nanostructured Supercapacitor Electrodes, ACS Applied Materials and Interfaces, 7, 9128-9133 (2015). DOI: 10.1021/acsami.5b01147\n\nJ. Liu, S.J. Kelly, E.S. Epstein, Z. Pan, X. Huang, J. Liu and P.V. Braun, Three-dimensionally scaffolded Co3O4 nanosheet anodes with high performance, Journal of Power Sources, 299, 40-48 (2015). DOI: 10.1016/j.jpowsour.2015.08.078\n\nJ. Kim, L.K. Aagesen, J.H. Choi, J. Choi, H.S. Kim, J. Liu, C.-R. Cho, J.G. Kang, A. Ramazani, K. Thornton and P.V. Braun, “Template-Directed Directionally Solidified Three-Dimensionally Mesostructured AgCl-KCl Eutectic Photonic Crystals,” Advanced Materials, 27, 4551-4559 (2015). DOI: 10.1002/adma.201502265\n\nM.P.B. Glazer, J. Cho, J. Almer, J. Okasinski, P.V. Braun and D.C. Dunand, In Operando Strain Measurement of Bicontinuous Silicon-Coated Nickel Inverse Opal Anodes for Li-Ion Batteries, Advanced Energy Materials, 5, 1500466 (2015). DOI: 10.1002/aenm.201500466\n\nJ. Zhao, S. Jaber, P. Mulvaney, P. Braun and H. Giessen, Repetitive Hole-Mask Colloidal Lithography for the Fabrication of Large-Area Low-Cost Plasmonic Multi-Shape Single-Layer Metasurfaces, Advanced Optical Materials, 3, 680-686 (2015). DOI: 10.1002/adom.201400561\n\nJ. Chang, R.T. Haasch, J. Kim, T.P. Spila, P.V. Braun, A.A. Gerwirth, and R.G. Nuzzo, The Synergetic Rolde of Li+ during Mg Electrodeposition/Dissolution in Borohydride Diglyme Electrolyte Solution: Voltammetric Stripping Behaviors on a Pt microelectrode Indicative of Mg-Li Alloying and Facilitated Dissolution, ACS Applied Materials & Interfaces, 7, 2494-2502 (2015). DOI: 10.1021/am507375t\n\nJ. Wang, H. Zhou, J. Nanda and P.V Braun, Three-Dimensionally Mesostructured Fe2O3 Electrodes with Good Rate Performance and Reduced Voltage Hysteresis, Chemistry of Materials, 27, 2803-2811 (2015). DOI: 10.1021/cm504365s\n\nH. Ning, J.H. Pikul, R. Zhang, X. Li, S. Xu, J. Wang, J.A. Rogers, W.P. King and P.V. Braun, Holographic Patterning of High-Performance on Chip 3-D Lithium Ion Batteries, PNAS, 112, 6573-6578 (2015). DOI: 10.1073/pnas.1423889112\n\nC. Zhang, A. Sitt, H.-J. Koo, K. Waynant, H. Hess, B. Pate and P.V. Braun, Autonomic Molecular Transport by Polymers Containing Programmed Chemical Potential Gradients, JACS, 137, 5066-5073 (2015). DOI: 10.1021/jacs.5b00240\n\nM. Mesch, C. Zhang, P.V. Braun and H. Giessen, Functionalized Hydrogel Assisted Glucose Sensing with Plasmonic Nanoantennas, ACS Photonics, 2, 475-480 (2015). DOI: 10.1021/acsphotonics.5b00004\n\nQ. Mahmood, M.G. Kim, S. Yun, S. Bak, X.-Q. Yang, W.S. Kim, H.S. Shin and P.V. Braun, Unveiling Surface Redox Charge Storage of Strongly Interacting Two-Dimensional Hetero-Nanosheets in Hierarchical Architectures, Nano Letters, 15, 2269-2277 (2015). DOI: 10.1021/nl504200y\n\nJ. Liu, N. Li, M. Goodman, H. Zhang, E. Epstein, B. Huang, Z. Pan, J. Kim, J.H. Choi, X.-J. Huang, J. liu, K. Hsia, S. Dillon and P.V. Braun, Mechanically and Chemically Robust Sandwich-Structured C2Si2C Nanotube Array Li-ion Battery Anodes, ACS Nano, 9, 1985-1994 (2015). DOI: 10.1021/nn507003z\n\nS. Lee, A.R. Damodaran, P. Gorai, N. Oh, J.A. Moyer, J.-H. Kwon, N. Ferdous, A. Shah, Z. Chen, E. Breckenfeld, R.V.K. Mangalam, P.V. Braun, P. Schiffer, M. Shim, J.-M. Zuo, E. Ertekin and L.W. Martin, A Novel, Layered Phase in Ti-Rich SrTiO3 Epitaxial Thin Films, Advanced Materials, 27, 861-868 (2015). DOI: 10.1002/adma.201403602\n\nJ. Kim, H. Kim, J.-H. Choi, H. Jeon, Y. Yoon, J. Liu, J.-G. Park and P.V. Braun, Epitaxial Growth of Three-Dimensionally Mesostructured Single Crystalline Cu2O via Templated Electrodeposition, Chemistry of Materials, 26, 7051-7058 (2014). DOI: 10.1021/cm5034645\n\nP.V. Braun and R.G. Nuzzo, Batteries: Knowing when small is better, Nature Nanotechnology, 9, 962-963 (2014). DOI: 10.1038/nnano.2014.263\n\nJ. Liu, H.G. Zhang, J. Wang, J. Cho, J.H. Pikul, E.S. Epstein, X. Huang, J. Liu, W.P. King and P.V. Braun, Hydrothermal Fabrication of Three-Dimensional Secondary Battery Anodes, Advanced Materials, 26, 7096-7101 (2014). DOI: 10.1002/adma.201402552\n\nH. Ning, N. Krueger, X. Sheng, H. Keum, C. Zhang, K. Choquette, X. Li, S. Kim, J. Rogers and P.V. Braun, Transfer-printing of tunable porous silicon microcavities with embedded emitters, ACS Photonics, 1, 1144-1150 (2014). DOI: 10.1021/ph500230j\n\nM.E. Grady, P.H. Geubelle, P.V. Braun and N.R. Sottos, Molecular Tailoring of Interfacial Failure, Langmuir, 30, 11096-11102 (2014). DOI: 10.1021/la50227k\n\nS.-K. Kim, H.-J. Koo, A. Lee and P.V. Braun, Selective Wetting-Induced Micro-Electrode Patterning for Flexible Micro-Supercapacitors, Advanced Materials, 26, 5108-5112 (2014). DOI: 10.1002/adma.201401525\n\nJ. Pikul, Z. Dai, X. Yu, H. Zhang, T. Kim, P.V. Braun, W. King, Micromechanical devices with tunable stiffness fabricated from regular 3D porous materials, Journal of Micromechanics and Microengineering, 24, 105006 (2014). DOI: 10.1088/0960-1317/10/105006\n\nC. Zhang, G.G. Cano, P.V. Braun, Linear and Fast Hydrogel Glucose Sensor Materials Enabled by Volume Resetting Agents, Advanced Materials, 26, 5678-5683 (2014). DOI: 10.1002/adma.201401710.\n\nH.-J. Koo, K. Waynant, C. Zhang, P.V. Braun, Polymer Brushes Patterned with Micrometer-Scale Chemical Gradients Using Laminar Co-Flow, ACS Appl. Mater. Interfaces, 6, 14320-14326 (2014). DOI: 10.1021/am503609x\n\nJ. Zhao, B. Frank, F. Neubrech, C. Zhang, P.V. Braun and H. Giessen, Hole-mask colloidal nanolithography combined with tilted-angle-rotation evaporation: A versatile method for fabrication of low-cost and large-area complex plasmonic nanostructures and metamaterials, Beilstein, 5, 577-589 (2014). DOI: 10.10.3762/bjnano.5.68\n\nH.-J. Koo, K.V. Waynant, C. Zhang, Haasch, R. and P.V. Braun, General Method for Forming Micrometer-Scale Lateral Chemical Gradients in Polymer Brushes, Chemistry of Materials, 26, 2678-2683 (2014). DOI: 10.1021/cm5004388\n\nC.K. Lee, C.E. Diesendruck, E. Lu, A.N. Pickett, P.A. May, J.S. Moore and P.V. Braun, Solvent Swelling Activation of a Mechanophore in a Polymer Network, Macromolecules, 47, 2690-2694 (2014). DOI: 10.1021/ma500195h\n\nR.H. Coridan, K.A. Arpin, B.S. Brunschwig, P.V Braun and N.S. Lewis, Photoelectrochemical behavior of hierarchically structured Si/WO3 core-shell tandem photoanodes, Nano Letters, 14, 2310-2317 (2014). DOI: 10.1021/nl404623t\n\nJ. Cho, M.D. Losego, H.G. Zhang, H. Kim, J. Zuo, I. Petrov, D.G. Cahill and P.V. Braun, Electrochemically Tunable Thermal Conductivity of Lithium Cobalt Oxide, Nature Communications, 5, 4035 (2014). DOI: 10.1038/ncomms5035\n\nH.-J. Koo, S. Kim and P.V. Braun, Facile Fabrication of Graphene Composite Microwires via Drying-Induced Size Reduction of Hydrogel Filaments, RSC Advances, 4, 20927-20931 (2014). DOI: 10.1039/c4ra01154f\n\nM. Fu, K. Chaudhary, J.G. Lange, H.S. Kim, J.J. Juarez, J.A. Lewis and P.V. Braun, “Anisotropic Colloidal Templating of 3D Ceramic, Semiconducting, Metallic and Polymeric Architectures,” Advanced Materials, 26, 1740-1745 (2014).\n\nB. Frank, X.H. Yin, M. Schaferling, J. Zhao, S.M. Hein, P.V. Braun and H. Giessen: Large-Area 3D Chiral Plasmonic Structures, ACS Nano, 7, 6321-6329 (2013). DOI: 10.1021/nn402370x\n\nC.J. Zhang, M.D. Losego and P.V. Braun: Hydrogel-Based Glucose Sensors: Effects of Phenylboronic Acid Chemical Structure on Response,\" Chemistry of Materials, 25, 3239-3250 (2013). DOI: 10.1021/cm401738p\n\n(invited) D.G. Cahill, P.V. Braun, G. Chen, D.R. Clarke, S. Fan, K.E. Goodson, P. Keblinski, W.P. King, G.D. Mahan, A. Majumdar, H.J. Maris, S.R. Philpot, E. Pop and L. Shi, Nanoscale thermal transport. II. 2003-2012, Applied Physics Reviews, 1, 011305 (2014).\n\nS. Martha, J. Nanda, H. Zhou, J.C. Idrobo, S. Pannala, N.J. Dudney, J. Wang and P.V. Braun, Electrode Architectures for High Capacity Multivalent Conversion Compounds: Iron (II and III) Fluorides, Royal Society of Chemistry, 4, 6730-6737 (2014). DOI: 10.1039/c3ra47266c\n\n(invited) P.V. Braun, Materials Chemistry in 3D Templates for Functional Photonics, Chemistry of Materials, 26, 277-286 (2014). DOI: 10.1021.cm4023437\n\nK.A. Arpin, M.D. Losego, A.N. Cloud, H. Ning, J. Mallek, N.P. Sergeant, L. Zhu, Z. Yu, B. Kalanyan, G.N. Parsons, G.S. Girolami, J.R. Abelson, S. Fan and P.V. Braun, Three-Dimensional Self-Assembled Photonic Crystals with High Temperature Stability for Thermal Emission Modification, Nature Communications, 4 (2013). DOI: 10.1038/ncomms3630\n\nS. Xu, Y. Zhang, J. Cho, J. Lee, X. Huang, L. Jia, J.A. Fan, Y. Su, J. Su, H. Zhang, H. Cheng, B. Lu, C. Yu, C. Chuang, T. Kim, T. Song, K. Shigeta, S. Kang, C. Dagdeviren, I. Petrov, P.V. Braun, Y. Huang, U. Paik and J.A. Rogers, Stretchable batteries with self-similar serpentine interconnects and integrated wireless recharging systems, Nature Communications, 4, 1543 (2013). DOI: 10.1038/ncomms2553\n\nC.K. Lee, B.A. Beiermann, M.N. Silberstein, J. Wang, J.S. Moore, N.R. Sottos and P.V Braun: Exploiting Force Sensitive Spiropyrans as Molecular Level Probes, Macromolecules, 46, 3746-3752 (2013). DOI: 10.1021/ma40054281\n\nM.D. Goodman, K.A. Arpin, A. Mihi, N. Tatsuda, K. Yano and P.V. Braun: Enabling New Classes of Templated Materials Through Mesoporous Carbon Colloidal Crystals, Advanced Optical Materials, 4, 300-304 (2013). DOI: 10.1002/adom.201300120\n\nJ.H. Pikul, H.G. Zhang, P.V. Braun and W. King: High Power Lithium Ion Micro Batteries from Interdigitated Three-Dimensional Bicontinuous Nanoporous Electrodes, Nature Communications, 4, 1732 (2013). DOI: 10.1038/ncomms2747\n\nM.D. Losego, I.P. Blitz, R.A. Vaia, D.G. Cahill and P.V. Braun: Ultralow Thermal Conductivity in Organoclay Nanolaminates Synthesized via Simple Self-Assembly, Nano Letters, 13, 2215-2219 (2013). DOI: 10.1021/nl4007326\n\nS.H. Cho, S.R. White and P.V. Braun: Room-Temperature Polydimethylsiloxane-Based Self-Healing Polymers, Chemistry of Materials, 22, 4209-4214 (2012). DOI: 10.1021/cm202501b\n\nJ. Ma, B.R. Parajuli, M.G. Ghossouh, A. Mihi, J. Sadhu, P.V. Braun and S. Sinha: Coherent Phonon-Grain Boundary Scattering in Silicon Inverse Opals, Nano Letters, 13, 618-624 (2013). DOI: 10.1021/nl304190s\n\nC. Diesendruck, B. Steinberg, N. Sugai, M. Silberstein, N. Sottos, S. White, P. Braun and J. Moore, Proton-Coupled Mechanochemical Transduction – A Mechanogenerated Acid, Journal of the American Chemical Society, 134, 12446-12449 (2012). DOI: 10.1021/ja305645x\n\nS. Choi, C. Xue, B.-C. Choi, P.V. Braun and D. Leckband: Protein Adsorption Modes Determine Reversible Cell Attachment on Poly(N-isopropyl acrylamide) Brushes, Advanced Functional Materials, 22, 2394-2401 (2012). DOI: 10.1002/adfm.201103056\n\nW.S. Chae, D. Gough, S.-K. Ham, D. Robinson and P.V. Braun: Effect of Ordered Intermediate Porosity on Ion Transport in Hierarchically Nanoporous Electrodes, ACS Applied Materials & Interfaces, 4, 3973-3979 (2012). DOI: 10.1021/am300798j (cover)\n\nJ. Zhao, C. Zhang, P.V. Braun and H. Giessen, Large-area low-cost Plasmonic nanostructures in the near infrared region for Fano resonant sensing, Advanced Materials, 24, OP247-OP252 (2012). DOI: 10.1002/adma.201202109\n\nH. Zhang and P.V. Braun: Three-dimensional Metal Scaffold Supported Bicontinuous Silicon Battery Anodes, Nano Letters, 12, 2778-2783 (2012). DOI: dx.doi.org/10.1021/nl204551m\n\nH. Ning, A. Mihi, J. Geddes, M. Miyake, P.V. Braun: Radiative Lifetime Modification of LaF3: Nd Nanoparticles Embedded in Three Dimensional Silicon Photonic Crystals, Advanced Materials, 24, OP153-OP158 (2012). DOI: 10.1002/adma.201104769\n\nM. Losego, M.E. Grady, N.R. Sottos, D.G. Cahill and P.V. Braun: Effects of Chemical Bonding on Heat Transport Across Interfaces, Nature Materials, 11, 502-506 (2012). DOI: 10.1038/NMAT3303\n\nY.-C. Chen, J.B. Geddes, L. Yin, P. Wiltzius and P.V. Braun: X-ray computed tomography of Holographically fabricated three-dimensional photonic crystals, Advanced Materials, 24, 2863-2868 (2012). DOI: 10.1002/adma.201200411\n\nS. Odom, S. Chayanupatkul, B.J. Blaiszik, O. Zhao, A.C. Jackson, P.V. Braun, N.R. Sottos, S.R. White and J.S. Moore, A Self-Healing Conductive Ink, Advanced Materials, 24, 2578-2581 (2012). DOI: 10.1002/adma.201200196\n\nA.M. Bowen, M.J. Motala, J.M. Lucas, S. Gupta, A.J. Baca, A. Mihi, A.P. Alivisatos, P.V. Braun and R.G. Nuzzo, Triangular Elastomeric Stamps for Optical Applications: Near-Field Phase Shift Photolithography, 3D Proximity Field Patterning, Embossed Antireflective Coatings, and SERS Sensing, Advanced Functional Materials, 22, 2927-2937 (2012). DOI: 10.1002/adfm.201102455\n\nP.V. Braun, J. Cho, J.H. Pikul, W.P. King and H. Zhang, High Power Rechargeable Batteries, Current Opinion in Solid State Materials Science, 16, 186-198 (2012). DOI: 10.1016/j.cossms.2012.05.002\n\nD.V. Gough, J.L. Defino and P.V. Braun, Programmed size-selected permeation of ssDNA into ZnS mesoporous hollow spheres, Soft Matter, 8, 4396-4401 (2012). DOI: 10.1039/c2sm00053a\n\nH. Keum, A. Carlson, H. Ning, A. Mihi, J.D. Eisenhaure, P.V. Braun, J.A. Rogers and S. Kim, Silicon Micro-Masonry Using Elastomeric Stamps for Three-Dimensional Microfabrication, Journal of Micromechanics and Microengineering, 22, 055018 (2012). DOI: 10.1088/0960-1317/22/5/055018\n\nS. Kim, Y. Su, A. Mihi, S. Lee, Z. Liu, T.K. Bhandakkar, J. Wu, J.B. Geddes III, H.T. Johnson, Y. Zhang, J.-K. Park, P.V. Braun, Y. Huang and J.A. Rogers: Imbricate Scales as a Design Construct for Microsystem Technologies, Small, 8, 901-906 (2012). DOI: 10.1002/smll.201101832 (cover)\n\nS. Cataldo, J. Zhao, F. Neubrech, B. Frank, C. Zhang, P.V. Braun and H. Giessen: Hole-Mask Colloidal Nanolithography for Large-Area Low-Cost Metamaterials and Antenna-Enhanced SEIRA Substrates, ACS Nano, 6, 979-985 (2012). (cover) DOI: 10.1021/nn2047982\n\nD. Chanda, K. Shigeta, T. Truong, E. Lui, A. Mihi, M. Schulmerich, P.V. Braun, R. Bhargava and J. Rogers: Coupling of Plasmonic and optical cavity modes in quasi-three-dimensional Plasmonic crystals, Nature Communications, 2, 479 (2011). DOI: 10.1038/ncomms1487\n\nK.A. Arpin, M.D. Losego and P.V. Braun: Electrodeposited 3D Tungsten Photonic Crystals with Enhanced Thermal Stability, Chemistry of Materials, 23, 4783-4788 (2011). DOI: 10.1021/cm2019789\n\nA.C. Jackson, J.A. Bartelet and P.V. Braun: Transparent Self-healing Polymers based on Encapsulated Plasticizers in a Thermoplastic Matrix, Advanced Functional Materials, 21, 4705-4711 (2011). DOI: 10.1002/adfm.201101574\n\nK.A. Arpin, J.H. Pikul, W.P. King, H. Fan, P.V. Braun: Template Directed Assembly of Dynamic Micellar Nanoparticles, Soft Matter, 7, 10252 (2011). DOI: 10.1039/c1sm06078c\n\nH. Ning and P.V. Braun: Light control takes wing, Physics, 4, 76 (2011). DOI: 10.1103/Physics.4.76\n\nE.C. Nelson, N. Dias, K. Bassett, S. Dunham, V. Verma, M. Miyake, P. Wiltzius, J. Rogers, J. Coleman, X. Li and P.V. Braun: Epitaxial growth of three-dimensionally architectured optoelectronic devices, Nature Materials, 10, 676-681 (2011). (cover) DOI: 10.1038/NMAT3071\n\nA. Mihi, C. Zhang and P. V. Braun: Transfer of Preformed 3D Photonic Crystals onto Dye Sensitized Solar Cells, Angewandte Chemie, 50, 5712-5715 (2011). DOI: 10.1002/anie.201100446\n\nS.-G. Park, M. Miyake, S.-M. Yang and P. V. Braun: Cu2O Inverse Woodpile Photonic Crystals by Prism Holographic Lithography and Electrodeposition, Advanced Materials, 23, 2749-2752 (2011).\n\nA. Radke, T. Gissibl, T. Klotzbucher, P. V. Braun and H. Giessen: Three-Dimensional Bi-Chiral Plasmonic Crystals Fabricated by Direct Laser Writing and Electroless Silver Plating, Advanced Materials, 23, 3018-3021 (2011). DOI: 10.1002/adma.201100543\n\nA. C. Jackson, J. A. Bartelt, K. Marczewski, N. R. Sottos and P. V. Braun: Silica-protected Mircron and Sub-micron Capsules and Particles for Self-Healing at the Microscale, Macromolecular Rapid Communications, 32, 82-87 (2011). DOI: 10.1002/marc.201000468\n\nH.-G. Zhang and P. V. Braun: Three-dimensional Bicontinuous Ultrafast Charge and Discharge Bulk Battery Electrodes, Nature Nanotechnology, 6, 277-281 (2011). DOI: 10.1038/NNANO.2011.38\n\nC. Xue, N. Yonet-Tanyeri, N. Brouette, M. Sferrazza, P.V. Braun D.E. Leckband: Protein Adsorption on Poly(N-isopropylacrylamide) Brushes: Dependence on Grafting Density and Chain Collapse, Langmuir, 27, 8810-8818 (2011). DOI:10.1021/la2001909\n\nD. Chanda, K. Shigeta, S. Gupta, T. Cain, A. Carlson, A. Mihi, A.J. Baca, G. R. Bogart, P. Braun and J.A. Rogers: Large-area flexible 3D optical negative index metamaterial formed by nanotransfer printing, Nature Nanotechnology, 6, 402-407 (2011). DOI: 10.1038/nnano.2011.82\n\nW.-P. Hsieh, M.D. Losego, P.V. Braun, S. Shenogin, P. Keblinski and D.G. Cahill: Testing the minimum thermal conductivity model for amorphous polymers using high pressure, Physical Review B, 83, 174205 (2011).\n\nP.V. Braun: Colour without colourants, Nature, 472, 423-424 (2011).\n\nN. Yonet-Tanyeri, R. C. Evans, H. Tu and P. V. Braun: Molecular Transport Directed via Functionalized Patterned Surfaces, Advanced Materials, 23, 1739-1743 (2011).\n\nM. D. Losego, L. Moh, K. A. Arpin, D. G. Cahill and P. V. Braun: Interfacial thermal conductance in spun-cast polymer films and polymer brushes, Applied Physics Letters, 97, 011908 (2010).\n\nL. Moh, M. Losego and P. V. Braun: Solvent quality effects on scaling behavior of poly(methylmethacrylate) brushes in the moderate and high density regimes, Langmuir, 27, 3698-3702 (2011).\n\nShin, J., P. V. Braun and W. Lee: Fast Response Photonic Crystal pH Sensor Based on Templated Photopolymerized Hydrogel Inverse Opal, Sensors and Actuators B, 150, 183-190 (2010).\n\nAmeling, R., L. Langguth, M. Hentschel, M. Mesch, P. V. Braun and H. Giessen: Cavity-enhanced localized plasmon resonance sensing, Applied Physics Letters, 97, 253116 (2010).\n\nLee, C. K., D. A. Davis, S. R. White, J. S. Moore, N. R. Sottos and P. V. Braun: Force Induced Redistribution of a Chemical Equilibrium, JACS, 132, 16107-16111 (2010).\n\nShir, D. J., E. C. Nelson, D. Chanda, A. Brzezinski, P. V. Braun, P. Wiltzius and J. Rogers: Dual exposure, two-photon, conformal phasemask lithography for three dimensional silicon inverse woodpile photonic crystals, Journal of Vacuum Science and Technology, 28, 783-788 (2010).\n\nYu, X., L. Shi, D. Han, J. Zi and P. V. Braun: High Quality Factor Metallodielectric Hybrid Plasmonic-Photonic Crystals, Advanced Functional Materials, 20, 1910-1916, (2010).\n\nJuhl, A. T., J. D. Busbee, J. J. Koval, L. V. Natarajan, V. P. Tondiglia, R. A. Vaia, T. J. Bunning and P. V. Braun: Holographically Directed Assembly of Polymer Nanocomposites, ACS Nano, 4, 5953-5961 (2010).\n\nJun, Y., D. Yu, M. C. George, and P. V. Braun: Holographically Defined Nanoparticle Placement in 3D Colloidal Crystals, Journal of the American Chemical Society, 132, 9958-9959 (2010).\n\nBraun, P. V.: Self-Healing Polymers, Encyclopedia of Polymer Science and Technology (2010).\n\nArpin, K. A., A. Mihi, H. T. Johnson, A. J. Baca, J. A. Rogers, J. A. Lewis and P. V. Braun: Multidimensional Architectures for Functional Optical Devices, Advanced Materials, 22, 1-18 (2010).\n\nPark, J.-H. and P. V. Braun: Coaxial Electrospinning of Self-Healing Polymer Coatings, Advanced Materials, 22, 496-499 (2010).\n\nYu, X., H. Zhang, J. K. Oliverio and P. V. Braun: Template-Assisted Three-Dimensional Nanolithography via Geometrically Irreversible Processing, Nano Letters, 9, 4424-4428 (2009).\n\nBrezezinski, A., Y.-C. Chen, P. Wiltzius and P. V. Braun: Complex Three-Dimensional Conformal Surfaces Formed By Atomic Layer Deposition: Computation and Experimental Verification, Journal of Materials Chemistry, 19, 9126-9130 (2009).\n\nBusbee, J. D., A. T. Griffith, L. V. Natarajan, V. P. Tongdilia, T. J. Bunning, R. A. Vaia, and P. V. Braun: SiO2 Nanoparticle Sequestration via Reactive Functionalization in Holographic Polymer Dispersed Liquid Crystals, Advanced Materials, 21, 3659-3662 (2009).\n\nGeorge, M. C. and P. V. Braun: Multicompartmental Materials by Electrohydrodynamic Cojetting, Angewandte Chemie, 48, 2-6 (2009).\n\nLee, J. T., M. C. George, J. S. Moore and P. V. Braun: Multiphoton Writing of 3D Microfluidic Channels, Journal of the American Chemical Society, 48, 2-6 (2009).\n\nCaruso, M. M., S. R. Schelkoft, A. C. Jackson, A. M. Landry, P. V. Braun and J. S. Moore: Microcapsules Containing Suspensions of Carbon Nanotubes, Journal of Materials Chemistry, 19, 6093-6096 (2009).\n\nMiyake, M., Y.-C. Chen, P. V. Braun and P. Wiltzius: Fabrication of Three-Dimensional Photonic Crystals Using Multibeam Interference Lithography and Electrodeposition, Advanced Materials, 21, 3012-3015 (2009).\n\nGough, D. V., A. T. Juhl and P. V. Braun: Programming Structure into 3D Nanomaterials, Materials Today, 12, 2-9 (2009).\n\nGough, D. V., A. Wolosiuk, and P. V. Braun: Mesoporous ZnS Nanorattles: Programmed Size Selected Access to Encapsulated Enzymes, Nano Letters, 9, 1994-1998 (2009).\n\nDavis, D.A., A. Hamilton, Y. Yang, L.D. Cremar, D.V. Gough, S.L. Potisek, M.T. Ong, P.V. Braun, T.J. Martinez, S.R. White, J.S. Moore and N.R. Sottos: Force-Induced Activation of Covalent Bonds in Mechanoresponsive Polymeric Materials, Nature, 459, 68-72 (2009).\n\nGeorge, M. C., E. C. Nelson, J. A. Rogers, P.V. Braun: Direct Fabrication of 3D Periodic Inorganic Microstructures using Conformal Phase Masks, Angew. Chem. Int. Ed., 121, 150-154 (2009).\n\nSon, D., A. Wolosiuk, P. Braun: Double Direct Templated Hollow ZnS Microspheres Formed on Chemically Modified Silica Colloids, Chemistry of Materials, 21, 628-634 (2009).\n\nCho, S., S. R. White and P. V. Braun: Self-Healing Polymer Coatings, Advanced Materials, 21, 645-649 (2009).\n\nShir, D., E. C. Nelson, Y. C. Chen, A. Brzezinski, H. Liao, P. V. Braun, P. Wiltzius, K. H. A. Bogart, and J. A. Rogers: Three dimensional silicon photonic crystals fabricated by two photon phase mask lithography, Applied Physics Letters, 94, 011101-1 (2009).\n\nGeorge, M.C., A. Mohraz, M. Piech, N. S. Bell, J. A. Lewis, and P. V. Braun: Direct Laser Writing of Photo-Responsive Colloids for Microscale Patterning of 3D Porous Structures, Advanced Materials, 21, 66-70 (2009).\n\nChae, W., R. J. Kershner, and P. V. Braun: Fabrication of 50 to 1000 nm monodisperse ZnS colloids, Bulletin of the Korean Chemical Society, 30, 129-132 (2008).\n\nNelson, E. C. and P. V Braun: Photons and electrons confined, Nature Photonics, 2, 650-651 (2008).\n\nBrzezinski, A., J.-T. Lee,. J. D. Slinker, G. G. Malliaras, P. V. Braun, and P. Wiltzius: Enhanced emission from fcc fluorescent photonic crystals, Physical Review B, 77, 233106 (1-4) (2008). DOI: 10.1103/Phys Rev B.77.233106.\n\nNelson, E. C., F. García-Santamaría and P. V. Braun: Lattice registered two-photon polymerized features within colloidal photonic crystals and their optical properties, Advanced Functional Materials, 18, 1983–1989, (2008).\n\nShyr, M., D. Wernette, P. Wiltzius, Y. Lu, P. Braun: DNA and DNAzyme-mediated 2-D Colloidal Assembly, Journal of the American Chemical Society, 130, 8234-8240 (2008).\n\nRamanan, V., E. Nelson, A. Brzezinski, P. V. Braun and P. Wiltzius: Three dimensional silicon-air photonic crystals with controlled defects using interference lithography, Applied Physics Letters, 92, 173304 (1-3) (2008).\n\nLau, W. T., J.-T. Shen, G. Veronis, S. Fan and P. V. Braun: Tuning coherent radiative thermal conductance in multilayer photonic crystals, Applied Physics Letters, 92, 103106 (1-3) (2008).\n\nRinne, S. A., F. Garcia-Santamaria, and P. V. Braun : Embedded cavities and waveguides in three-dimensional silicon photonic crystals, Nature Photonics, 2, 52-56 (2008).\n\nChen, Y. C., J. B. Geddes III, J. T. Lee, P. V. Braun and P. Wiltzius: Holographically fabricated photonic crystals with large reflectance, Applied Physics Letters, 91, 241103 (2007).\n\nNelson, E. C., and P. V. Braun: Enhancing Colloids Through the Surface, Science, 318, 924-925 (2007).\n\nChae, W.-S., and P. V. Braun: Templated mesoporous silica colloids with controlled internal structures, Chemistry of Materials, 19, 5593-5597 (2007).\n\nGarcía-Santamaría, F., E. C. Nelson, and P. V. Braun: Optical surface resonance may render photonic crystals ineffective, Physical Review B, 76, 075132(1-6), (2007).\n\nRau, C., W. Liu, V. Crecea, K.M. Peterson, P.R. Jemian, C.-P. Richter, U. Neuhäusler, G. Schneider, X. Yu, P. V. Braun, I. K. Robinson: Synchrotron-based imaging and tomography with hard X-rays, Nucl. Instrum. Methods Phys. Res., Sect. B, 261, 850-854 (2007).\n\nLee, W., and P. V. Braun: Epitaxially grown colloidal crystals of silica microspheres on patterned substrate of triangular arrays, Materials Science and Engineering C, 27, 961–967 (2007).\n\nYu, X., Y.-J. Lee, R. Furstenberg, J. O. White, and P. V. Braun: Filling Fraction Dependent Properties of Inverse Opal Metallic Photonic Crystals, Advanced Materials, 19, 1689-1692 (2007).\n\nGarcÃ­a-SantamarÃ­a, F., M. Xu, V. Lousse, S. Fan, P. V. Braun and J. A. Lewis: A germanium inverse woodpile structure with a large photonic band gap, Advanced Materials, 19, 1567-1570 (2007).\n\nGarcÃ­a-SantamarÃ­a, F., and P. V. Braun: Are artificial opals non-close-packed fcc structures?, Applied Physics Letters, 90, 241905 (1-3) (2007).\n\nRau, C., V. Crecea, K.M. Peterson, P.R. Jemian, C.-P. Richter, U. NeuhÃ¤usler, G. Schneider, X. Yu, P. V. Braun, T. C. Chiang, I. K. Robinson: Imaging of micro- and nano-structures with hard X-rays, Micro and Nano Letters, 2, 1â€“5 (2007).\n\nShimmin, R. G., R. Vajtai, R. W. Siegel, and P. V. Braun: Room-temperature assembly of germanium photonic crystals through colloidal crystal templating, Chemistry of Materials, 19, 2102-2107 (2007).\n\nTu, H., L. Hong, S. M. Anthony, P. V. Braun and S. Granick: Brush-sheathed particles diffusing at brush-coated surfaces in the thermally-responsive PNIPAAm system, Langmuir, Vol 23, 2322-2325 (2007).\n\nBerfield, T. A., J.K. Patel, R.G. Shimmin, P.V. Braun, J. Lambros, and N.R. Sottos: Micro- and Nanoscale Deformation Measurement of Surface and Internal Planes via Digital Image Correlation, Experimental Mechanics, Vol 47, 51-62 (2007).\n\nPutnam, S. A., D. G. Cahill, P. V. Braun, Z. Ge, and R. G. Shimmin: Thermal conductivity of nanoparticle suspensions, J. Appl. Phys., Vol 99, 084308 (2006).\n\nLee, Y.-J., C. E. Heitzman, W. R. Frei, H. T. Johnson, and P. V. Braun: Transformation of Hydrogel-Based Inverse Opal Photonic Sensors from FCC to L11 During Swelling, J. Phys. Chem B, Vol 110, 19300-19306 (2006).\n\nBraun, P. V., S. A. Pruzinsky, and F. Garcia-Santamaria: Introducing defects in 3D photonic crystals: State of the art, Advanced Materials, Vol 18, 2665â€“2678 (2006).\n\nGe, Z., D. G. Cahill, and P. V. Braun: Thermal conductance of hydrophilic and hydrophobic interfaces, Physical Review Letters, Vol 96, 186101-1-186101-4 (2006).\n\nShimmin, R. G., A. J. DiMauro, and P. V. Braun: Slow vertical deposition of colloidal crystals: A Langmuir-Blodget process? Langmuir, Vol 22, 6507-6513 (2006).\n\nWang, X., H. Tu, P. V. Braun and P. W. Bohn: Length Scale Heterogeneity in Lateral Gradients of Poly(N-isopropylacrylamide) Polymer Brushes Prepared by Surface-Initiated Atom Transfer Radical Polymerization Coupled with In-Plane Electrochemical Potential Gradients, Langmuir, Vol 22, 817-823 (2006).\n\nCho, S. H., M. H. Andersson, S. R. White, N. R. Sottos, and P. V. Braun: Polydimethylsiloxane-based Self-Healing Materials, Advanced Materials, Vol 18, 997-1000 (2006).\n\nRogozhina, E. V., D. A. Eckhoff, E. Gratton, and P. V. Braun: Carboxyl functionalization of ultrasmall luminescent silicon nanoparticles through thermal hydrosilylation, J. Mater. Chem., Vol 16, 1421-1430 (2006).\n\nBerfield, T. A., J. K. Patel, R. G. Shimmin, P. V. Braun, N. R. Sottos, and J. Lambros: Fluorescent Image Correlation for Nanoscale Deformation Measurements, Small, Vol 2, 631-635 (2006).\n\nGratson, G. M., F. García-Santamaría, V. Lousse, M. Xu, S. Fan, J. A. Lewis, and P. V. Braun: Direct-Write Assembly of 3D Photonic Crystals: Conversion of Polymer Scaffolds to Silicon Hollow-Woodpile Structures, Advanced Materials, Vol 18, 461-465 (2006).\n\nPiech, M., M. C. George, N. S. Bell and P. V. Braun: Patterned colloid assembly by grafted photochromic polymer layers, Langmuir, Vol 22, 1379-1382 (2006).\n\nEckhoff, D. A., J. D. B. Sutin, R. M. Clegg, E. Gratton, E. V. Rogozhina, and P. V. Braun: Optical characterization of ultrasmall Si nanoparticles prepared through electrochemical dispersion of bulk Si. Journal of Physical Chemistry B, Vol 109, 19786-19797 (2005).\n\nBraun, P. V.: MRS Workshop Explores the Diversity of 3D Multifunctional Ceramic Composites, MRS Bulletin, Vol 30, 986-987 (2005).\n\nPruzinsky, S. A., and P. V. Braun: Fabrication and Characterization of Two-Photon Polymerized Features in Colloidal Crystals, Advanced Functional Materials, Vol 15, 1995-2004 (2005).\n\nWolosiuk, A., O. Armagan, P. V. Braun: Double Direct Templating of Periodically Nanostructured ZnS Hollow Microspheres, J. Am. Chem. Soc., Vol 127, 16356-16357 (2005).\n\nBraun, P. V., P. Osenar, M. Twardowski, G. N. Tew, and S. I. Stupp: Macroscopic Nano-Templating of Semiconductor Films with Hydrogen Bonded Lyotropic Liquid Crystals, Advanced Functional Materials, Vol 15, 1745-1750, (2005).\n\nGarcia-Santamaria, F., J. F. Galisteo-Lopez, P. V. Braun, and C. Lopez: Optical diffraction and high-energy features in three-dimensional photonic crystals, Phys. Rev. B, Vol 71 (19), 195112 (2005).\n\nGe, Z., Y. Kang, T. A. Taton, P. V. Braun, and D. G. Cahill: Thermal transport in Au-core polymer-shell nanoparticles, Nano Letters, Vol 5, 531-535 (2005).\n\nLee, Y.-J., S. A. Pruzinsky, and P. V. Braun: Diffraction response of colloidal crystals, effect of numerical aperture, Optics Letters, Vol 30, 153-155 (2005).\n\nGe, Z., D. G. Cahill, and P. V. Braun: AuPd Metal Nanoparticles as Probes of Nanoscale Thermal Transport in Aqueous Solution, J. Phys. Chem. B, Vol 108, 18870-18875 (2004).\n\nLiang, H., T. E. Angelini, P. V. Braun, and G. C. L. Wong: Roles of anionic and cationic template components in biomineralization of CdS nanorods using self-assembled DNA – membrane complexes, J. Am. Chem. Soc., Vol 126, 14157-14165 (2004).\n\nBevan, M. A., J. A. Lewis, P. V. Braun, P. Wiltzius: Structural evolution of colloidal crystals with increasing ionic strength, Langmuir, Vol 20, 7045-7053 (2004).\n\nJeon, S., J.-U. Park, R. Cirelli, S. Yang, C. E. Heitzman, P. V. Braun, P. J. A. Kenis, J. A. Rogers: Fabricating complex three-dimensional nanostructures with high-resolution conformable phase masks, Proc. of the National Academy of Sciences, Vol 101, 12428-12433 (2004).\n\nTu, H., C. E. Heitzman, P. V. Braun: Patterned poly(N-isopropylacrylamide) brushes on silica surfaces by microcontact printing followed by surface-initiated polymerization, Langmuir, Vol 20, 8313-8320 (2004).\n\nHeitzman, C. E., H. Tu, P. V. Braun: Two-dimensional diffusion of prodan on self-assembled monolayers studied by fluorescence recovery after photobleaching, J. Phys. Chem. B., Vol 108, 13764-13770 (2004).\n\nZhang, Z. S., O. M. Wilson, M. Yu. Efremov, W. Senaratne, E. A. Olson, M. Zhang, P. V. Braun, C. K. Ober and L. H. Allen: Heat capacity measurements of two-dimensional self-assembled monolayers on polycrystalline gold, Appl. Phys. Lett., Vol 84, 5198-5200 (2004).\n\nShimmin, R. G., A. B. Schoch and P. V. Braun: Polymer size and concentration effects on the size of gold nanoparticles capped by polymeric thiols, Langmuir, Vol 20, 5613-5620 (2004).\n\nDellinger T. M., and P. V. Braun: Lyotropic liquid crystals as nanoreactors for nanoparticle synthesis, Chem. Mater., Vol 16, 2201-2207 (2004).\n\nLee, W., A. Chan, M. A. Bevan, J. A. Lewis and P. V. Braun: Nanoparticle-mediated epitaxial assembly of colloidal crystals on patterned substrates, Langmuir, Vol 20, 5262-5270 (2004).\n\nBraun, P. V.: Spontaneous ligand organization, Nature Materials, Vol 3, 281-282 (2004).\n\nLee, Y.-J., S. A. Pruzinsky and P. V. Braun: Glucose-sensitive inverse opal hydrogels, analysis of optical diffraction response, Langmuir, Vol 20, 3096-3106 (2004).\n\nMeitl, M. A., T. M. Dellinger, and P. V. Braun: Bismuth-ceramic nanocomposites with unusual thermal stability via high-energy ball milling, Adv. Functional Mater., Vol 13, 795-799 (2003).\n\nLiang, H., T. E. Angelini, J.Ho, P. V. Braun and G. C. L. Wong: Molecular imprinting of biomineralized CdS nanostructures, Crystallographic control using self-assembled DNA-membrane templates, J. Amer. Chem. Soc., Vol 125, 11786-11787 (2003).\n\nLee, Y.-J., and P. V. Braun: Tunable inverse opal hydrogel pH sensors, Adv. Mater., Vol 15, 563-566(2003).\n\nJeon, S., and P. V. Braun: Hydrothermal synthesis of Er-doped luminescent TiO2 nanoparticles, Chemistry of Materials, Vol 15, 1256-1263 (2003).\n\nWilson, O.M., X. Hu, D.G. Cahill, and P.V. Braun: Colloidal metal particles as probes of nanoscale thermal transport in fluids, Phys. Rev. B, Vol 66, 224301 (2002).\n\nBelomoin, G., E. Rogozhina, J. Therrien, P.V. Braun, L. Abuhassan, M.H. Nayfeh, L. Wagner, and L. Mitas, â€œEffects of surface termination on the band gap of ultrabright Si-29 nanoparticles: Experiments and computational models,â€\u009d Phys. Rev. B, Vol 65, 193406 (2002).\n\nBraun, P.V., and P. Wiltzius, “Macroporous materials – electrochemically grown photonic crystals,” Adv. Colloid and Interface Sci., Vol 7, 116-123 (2002).\n\nLee, W., S.A. Pruzinsky, and P.V. Braun: Multi-photon polymerization of waveguide structures within three-dimensional photonic crystals, Adv. Mater., Vol 14, 271-274 (2002).\n\nBraun, P.V., R.W. Zehner, C.A. White, M.K. Weldon, S.S. Patel, and P. Wiltzius: Optical spectroscopy of high dielectric contrast 3D photonic crystals, Europhysics Lett., Vol 56, 207-213 (2001).\n\nTohver, V., J.E. Smay, A. Braem, P.V. Braun, and J.A. Lewis: Nanoparticle halos: A new colloid stabilization mechanism, Proc. Natl. Acad. Sci., Vol 98, 8950-8955 (2001).\n\nDellinger, T.M., and P.V. Braun: BiOCl nanoparticles synthesized in lyotropic liquid crystal nanoreactors, Scripta Materialia, Vol 44, 1893-1897 (2001).\n\nRogozhina , E., G. Belomoin, A. Smith, L. Abuhassan, N. Barry, O. Akcakir, P.V. Braun, and M.H. Nayfeh: Si-N linkage in ultrabright ultrasmall Si nanoparticles, Appl. Phys. Lett., Vol 78, 3711-3713 (2001).\n\nBraun, P.V., R.W. Zehner, C.A. White, M.K. Weldon, C. Kloc, S.S. Patel, and P. Wiltzius: Epitaxial growth of high dielectric contrast three-dimensional photonic crystals, Adv. Mater., Vol 13, 721-724 (2001).\n\nBraun P.V., and P. Wiltzius: Electrochemical Fabrication of 3-D Microperiodic Porous Materials: Adv. Mater., Vol 13, 482-485 (2001).\n\nPralle, M.U., C.M. Whitaker, P.V. Braun, and S.I. Stupp: Molecular variables in the self assembly of supramolecular nanostructures, Macromolecules, Vol 33, 3550-3556 (2000).\n\nAizenberg, J., P.V. Braun, and P. Wiltzius: High resolution colloidal deposition through electrostatic and capillary forces, Phys. Rev. Lett., Vol 84, 2997-3000 (2000).\n\nBraun, P.V., and P. Wiltzius: Electrochemically grown photonic crystals, Nature, Vol 402, 603-604 (1999).\n\nBraun, P.V., P. Osenar, V. Tohver, S.B. Kennedy, and S.I. Stupp: Nanostructure templating in inorganic solids with lyotropic liquid crystals, J. Am. Chem. Soc., Vol 121, 7302-7309 (1999).\n\nRogers, J.A., Z. Boa, A. Makhija, and P.V. Braun: Printing process suitable for reel-to-reel production of high-performance organic transistors and circuits, Adv. Mater., Vol 11, 741-745 (1999).\n\nBraun, P.V., and S.I. Stupp: CdS mineralization of hexagonal, lamellar, and cubic lyotropic liquid crystals, Mater. Res. Bull., Vol 34, 463-469 (1999)\n\nStupp, S.I., and P.V. Braun: Molecular manipulation of materials: biomaterials, ceramics, and semiconductors, Science, Vol 277, 1242-1248 (1997).\n\nTohver, V., P.V. Braun, M.U. Pralle, and S.I. Stupp: Counterion effects in liquid crystal templating of nanostructured CdS, Chem. Mater., Vol 9, 1495-1498 (1997).\n\nOsenar, P., P.V. Braun, and S.I. Stupp: Lamellar semiconductor-organic nanostructures from self assembled templates, Adv. Mater., Vol 8, 1022-1025 (1996).\n\nBraun, P.V., P. Osenar, and S.I. Stupp: Semiconducting superlattices templated by molecular assemblies, Nature, Vol 380, 325-328 (1996).\n\nKeddie, J.L., P.V. Braun, and E.P. Giannelis: Interrelationship between densification, crystallization, and chemical evolution in sol-gel titania thin films, J. Am. Cer. Soc., Vol 77, 592-1596 (1994).\n\nKeddie, J.L., P.V. Braun, and E.P. Giannelis: Relationship between water desorption and low-temperature densification of colloidal anatase thin films, J. Am. Cer. Soc., Vol 76, 2529-2533 (1993).\n\nTeaching Honors\n\nNamed on List of Teachers Ranked as Excellent by Their Students (2008, 2010, 2011, 2012, 2013, 2014 (Spring and Fall), 2015, 2019 (Spring), 2022 (Spring))\n\nAccenture Engineering Council Award for Excellence in Advising (2007)\n\nAccenture Multi-year Faculty Achievement Award, College of Engineering, UIUC (2007)\n\nResearch Honors\n\nElected Fellow, National Academy of Inventors (NAI) (2022)\n\nAmerican Association for the Advancement of Science (AAAS) Fellow (2020)\n\nGrainger Distinguished Chair in Engineering, University of Illinois (2020)\n\nMaterials Research Society Fellow (2018)\n\nVisiting Lecturer Award of the Chemistry Promotion Center, Ministry of Science and Technology, Taiwan (2017)\n\nIvan Racheff Professorship, University of Illinois (2011)\n\nDefense Science Study Group, DARPA (2010-2011)\n\nFriedrich Wilhelm Bessel Research Award, Alexander von Humboldt Foundation (2010)\n\nStanley H. Pierce Faculty Award, College of Engineering, UIUC (2010)\n\nPlenary Lecturer, Composites at Lake Louise, Banff, Alberta, Canada (2009)\n\nXerox Award for Faculty Research, College of Engineering, UIUC (2009)\n\nUniversity Scholar, University of Illinois Urbana-Champaign (2006-2009)\n\nRecipient of a Xerox Award for Faculty Research, College of Engineering (2004)\n\nWillett Faculty Scholar Award, College of Engineering, UIUC (2002) (2002)\n\nRobert Lansing Hardy Award of the TMS (2002)\n\n3M Nontenured Faculty Award (2001)\n\nArnold and Mabel Beckman Young Investigator Award (2001)\n\nRacheff Assistant Professorship, Dept. of Materials Science and Engineering (1999)"}, {"url": "https://illinois.edu/about/index.html", "page_content": "Since its founding in 1867, the University of Illinois Urbana-Champaign has earned a reputation as a world-class leader in research, teaching, and public engagement.\n\nFaculty A talented and highly respected faculty is the university’s most significant resource. Many are recognized for exceptional scholarship with memberships in such organizations as the American Academy of Arts and Sciences, the National Academy of Sciences, and the National Academy of Engineering. Our faculty have been awarded Nobel Prizes, Pulitzer Prizes, and the Fields Medal in Mathematics. The success of our faculty is matched by that of our alumni: 11 are Nobel Laureates and another 18 have won Pulitzer Prizes.\n\nAcademic Resources Academic resources on campus are among the finest in the world. The University Library is one of the largest public university collections in the world with 14 million volumes in its 20+ unit libraries. Annually, 53,000,000 people visit its online catalog. Students have access to thousands of computer terminals in classrooms, residence halls, and campus libraries for use in classroom instruction, study, and research.\n\nResearch At Illinois, our focus on research shapes our identity, permeates our classrooms and fuels our outreach. Fostering discovery and innovation is our fundamental mission. As a public, land-grant university, we have the responsibility to create new knowledge and new ideas and translate these into better ways of working, living and learning for our state, nation and world. Entrepreneurship flows from the classrooms to Research Park, a space that houses everything from Fortune 500 companies to student-founded startups. We are consistently ranked among the top five universities for NSF-funded research and our total annual research funding exceeds $600 million.\n\nThe Arts A major center for the arts, the campus attracts dozens of nationally and internationally renowned artists each year to its widely acclaimed Krannert Center for the Performing Arts. The University also supports two major museums: the Krannert Art Museum and Kinkead Pavilion; and the Spurlock Museum, a museum of world history and culture. Other major facilities include the multipurpose State Farm Center (16,500 seats); Memorial Stadium (70,000 seats), site of Big Ten Conference football games; and the Activities and Recreation Center (ARC), one of the largest recreational facilities of its kind on a university campus."}]}