{"Paul Taylor released his debut solo album, Another Place and Time, in 1998.": [{"url": "https://www.allaboutjazz.com/musicians/paul-taylor", "page_content": "Other key tracks include the EDM jam “Club 702,” a high energy tribute to the many successful DJs in Taylor’s adopted hometown of Las Vegas (whose area code is 702); the spirited midtempo electronic funk piece “Knocking At Your Door,” featuring Taylor’s backing vocals seductively repeating the title; and a whimsical “Roundup” of a lot of different styles, including the folksy, jangling guitar of Brian Monroney and touches of progressive EDM grooves and jazzy energy. One of the highlights of Taylor’s Tenacity album was his cover of The Weeknd’s “Wicked Games.” Setting a precedent by re-inventing a tune by the same artist on consecutive albums, Taylor extends his love for the Canadian alt-R&B singer to his fresh and atmospheric, deep soul-jazz take on the #1 pop hit “The Hills.”\n\nCountdown’s first single, “Arrival” is a spot on reflection of their multi-faceted freewheeling approach to stylistic fusion. The two also cite Paul’s soprano led track “Told Ya So” as another prime example. “It’s dancehall reggae the way artists like Drake and Rihanna do it,” Taylor says. “It’s cool to apply that contemporary pop current to my R&B/jazz sound.” Another track that Taylor feels steps away from the usual urban jazz hitting the charts these days is “Crossroads,” Complementing these tracks are two infectious, in the pocket tunes which reveal Taylor’s mastery of melody and easy flowing funk grooves – achieved here via seductive clapping percussion. The first is the opening track “Countdown,” which introduces the sizzling horn texture dynamic that drives many of the emotional high points throughout the set. Taylor says, “This one starts in a dreamy place, as if you’re anticipating something big, and then it breaks through with beats and ambience, creating emotional power but in a subdued mystical way.” The second is “Polaris,” one of the jazzier tunes on the album, a gentle soprano ballad featuring the subtle acoustic guitar graces of Peter White (providing harmonies and a transcendent solo).\n\nThe album’s colorful fusion of grooves and styles was created by the saxophonist and his longtime collaborator, co-writer and producer Dino Esposito. The two share a dynamic several decade long history that began when they played in the same band while attending the University of Nevada, Las Vegas. Esposito’s collaboration as a co-writer, producer and sonic co-architect began with Paul’s 1995 debut On the Horn and continued with Pleasure Seeker (1997), Undercover (2000), Hypnotic (2001), Nightlife (2005), Prime Time (2011) and Tenacity (2014).\n\nIn the first few bars of the title track to his new Peak Records/eOne album, Countdown, contemporary urban jazz’ hit saxman Paul Taylor, ever the engaging showman, invites his legion of fans into the experience by counting off 5…4…3…2…1. He launches into his incredible third decade as a solo artist with a set that’s fuses his trademark jazzy/funk/soul vibe with prominent elements of synthy dance pop/EDM, trancelike neo-soul, electronica, folksy lite rock, reggaeton, even a touch of blues.\n\n“Getting the go-ahead for a new album is always the greatest news because we can toss around ideas and come up with fresh new ways to color around the edges of my core melodic horn vibe, staying true to my stylistic integrity,” says Taylor. “Our goal is always to do something we haven’t tried before, and we have fun experimenting and being adventurous. On Countdown, we achieve that by trying new EDMish kind of mashups, trying to make two or three different styles mesh.”\n\nEsposito agrees he and Taylor are so in tune and trust each other so implicitly that if the saxman shoots him an eight or 16 bar idea or vice versa, the other can pick it up and develop it exactly the way the other envisioned. “Paul has never been afraid to step out of the box of the sound urban jazz artists usually conform to, and I’m always pushing that envelope as well,” he says. “Paul’s always hearing amazing new sounds and he’s open to all the music I’ve been immersed in like chill, hip-hop, EDM, electric soul and pop alternative. We’re always thinking, what can we bring to the table, what can we explore and how can we fuse different touches of all we love without going too far out of the genre’s mainstream”\n\nThough Taylor has been a groundbreaking force among the sax elite in the genre since his hit 1995 debut On The Horn, his 2014 #1 hit “Supernova” continued the exhilarating upswing he has been enjoying since he started his second decade as an artist with Ladies’ Choice (2007) – his first ever #1 on the Billboard Contemporary Jazz Albums Chart. “Burnin’,” the title track from his 2009 album, hit #1 on the airplay charts, and “Push To Start” from Prime Time (2011), hit the pole position on the Smooth Jazz Songs chart. Prime Time further lived up to its colorful name by reaching the Top Ten on the Billboard Jazz Albums chart.\n\nThe Denver native has been mesmerizing thousands of fans, headlining hundreds of shows and being part of exciting all-star tours – most recently doing dates with Peter White and Euge Groove in a lineup affectionately dubbed “Peter, Paul and Euge.” Before that he was part of the blockbuster summer tours Gentlemen of the Night (with Marion Meadows and Warren Hill) and Sax and the City (with Meadows and Vincent Ingala). Over the years, he has also hit the road with The Rippingtons and the acclaimed “Groovin’ For Grover” tour.\n\nIn December 2012, the longtime basketball enthusiast achieved another longtime dream, performing the National Anthem in Madison Square Garden at a New York Knicks game; their coach Mike Woodson is a longtime fan. Taylor is now also an official endorsee of Vigilante mouthpieces and tenor and alto for Cannonball Musical Instruments.\n\nAfter over ten albums of non-stop hit making, thousands of charismatic performances worldwide and years of setting new standards for the sonic possibilities of contemporary urban jazz, Paul Taylor’s still got his antenna up – ready to pounce on, absorb and be inspired by every vibe he hears that’s fresh, hip and edgy. Now, with Countdown, he’s blasting off into the next phase of his career, excited about the road ahead! Show less"}, {"url": "https://www.qobuz.com/us-en/interpreter/paul-taylor/56645", "page_content": "Paul Taylor\n\nPaul Taylor is an American alto and soprano saxophonist. His reedy tone and warm, bright sound frame dynamic, danceable grooves and intricate pop shot through with electronica. He has been leading his own dates since 1995's On the Horn. 2000's Undercover spent 28 weeks on the Contemporary Jazz charts. 2007's chart-topper Ladies Choice crossed over to R&B thanks to hit singles \"I Want to Be Loved by You\" (feat. LaToya London) and \"How Did You Know\" (feat. Regina Belle). Taylor played sold-out houses on the Gentlemen of the Night tours with fellow saxophonists Marion Meadows, Michael Lington, and Warren Hill. Taylor's skillful collaborations with vocalists include charting appearances with Maxi Priest and Peabo Bryson. 2014's Tenacity also crossed over thanks to its first single, \"Supernova\" (feat. Jonathan Fritzen). 2021's And Now This was constructed from digital files exchanged between Taylor and longtime producer Dino Esposito during the pandemic; their goal was to create a beat-conscious set of club tracks and radio singles. The latter included \"Ride It,\" sung by All-4-One vocalist Jamie Jones. Taylor was raised in Denver. He took up the alto saxophone at the age of seven. He played in school bands, and in high school joined a Top 40 band called Mixed Company where he picked up the soprano horn as well. He attended the University of Nevada, Las Vegas on a full music scholarship. After graduating, jazz keyboardist Keiko Matsui and her producer husband Kazu Matsui, discovered him playing a gig at the Catalina Island Jazz Festival and hired him to back her on the spot. He spent two years with her road band before Kazu produced his 1995 debut solo album, On the Horn; it reached the jazz charts and spawned a radio hit in \"Til We Meet Again.\" Taylor worked with Keiko in the studio on 1995's chart-topping Sapphire, 1996's Dream Walk, and 1998's Full Moon and the Shrine, and remained a guest with her studio band through 2009's Moyo (Heart and Soul). Simultaneously, the saxist worked the road and in the studio with Casiopea drummer Akira Jimbo. He appeared on 1996's Flower and 1997's Stone Butterfly. Pleasure Seeker, Taylor's second solo album, followed in 1997 and was equally successful. In 1999 he appeared on the Rippingtons' Topaz. He released his third album, Undercover, on Peak/N-Coded Music in February 2000 and toured as a special guest soloist with the Rippingtons. Subsequent albums Hypnotic (2001), Steppin' Out (2003), Nightlife (2005), and Ladies' Choice (2007), were all issued by Peak Records and registered high on the contemporary jazz charts -- Ladies' Choice went all the way to number one, crossed over to R&B, and landed well inside the Top 30. The album remained on the charts for 29 weeks. That year, Taylor played soprano on \"I Try,\" the Top Ten single from Peabo Bryson's Missing You. Peak released Taylor's eighth album, Burnin', in 2009. It spent 38 weeks on the smooth jazz charts and also peaked at number one. Two years later, Taylor returned with Prime Time; it went to number three on the contemporary jazz charts. In 2014, Taylor released Tenacity. With guest appearances from Jeff Lorber and vocalist Jonathan Fritzen, it too peaked at three, while spending 20 weeks on the jazz charts. In 2015, Taylor returned to working with Jimbo in the studio and on the road; he played alto and soprano on the drummer's acclaimed Groove of Life. Taylor's 2016 release Countdown cracked the Top Ten at jazz albums. After a long period of global touring with Jimbo, Matsui, and on his own, Taylor got an unintentionally extended break due to the COVID-19 pandemic. At the end of the year he began trading digital files with Esposito, consciously crafting an album aimed at global dancefloors. In November 2021, And Now This appeared from Peak with its first single, \"Ride It, sung by All-4-One's Jamie Jones. Later that month, Taylor enlisted Twitch streaming host OriginalSnow to duet with him on the funky non-album single \"Share It with You.\"\n\n© William Ruhlmann & Thom Jurek /TiVo\n\nRead more"}, {"url": "https://www.allmusic.com/artist/paul-taylor-mn0001923753/biography", "page_content": "Biography Paul Taylor Follow Artist +\n\nLong a vital part of Memphis' vibrant 21st century music scene, multi-instrumentalist and producer Paul Taylor has always followed his own sense of direction. The son of a Memphis musician and studio…\n\nRead Full Biography"}, {"url": "https://www.last.fm/music/Paul+Taylor/+wiki", "page_content": "The name \"Paul Taylor\" is used for (at least) three different artists:\n\n(1) Paul Taylor - Jazz Musician\n\nPaul Taylor (born April 30, 1960) is an American smooth jazz saxophonist who has released eight albums since his debut On the Horn in 1995. He is signed to Peak Records. Although originally from Denver, Colorado, he is based in Las Vegas, Nevada. He also played as a special guest with the Rippingtons for a short time in 1999 and 2000, after Jeff Kashiwa left the group and before Eric Marienthal joined them.\n\nHe collaborated with many R&B vocalists such as LaToya London, Regina Belle, and Terry Dexter.\n\n\n\nExpanding upon the sensuous and romantic smooth jazz vibe that has made him one of the genre’s most dynamic saxophonists, Paul Taylor makes his fourth Peak Records release a true Ladies’ Choice; creating his most soulful instrumental tracks ever and keeping company with three of today’s most acclaimed female R&B vocalists—Regina Belle, La Toya London and Terry Dexter.\n\nCapturing all of the soulful grooves, dazzling melodies and seductive magic that have become his trademark, Ladies’ Choice perfectly reflects the incredible synergy the charismatic Taylor has had for over a decade with his devoted audience, and takes his music to a whole new urban adult contemporary dimension. The collection is also the sax man’s third in a row—after 2003’s Steppin’ Out and 2005’s Nightlife–to feature tracks helmed by veteran R&B/jazz producers Barry Eastmond (Al Jarreau, Regina Belle, Jonathan Butler, Anita Baker) and Rex Rideout (Richard Elliot, Gerald Albright, Boney James, Najee). The title was inspired by a special moment that happened every night at clubs throughout the country in the 70s. The DJ would stop the music, take the mike and declare the next song to be “Ladies’ Choice”—an invitation for the ladies to pick the guys they want to dance with.\n\n“When I first got into the studio with Barry at his place in New York, we started completely from scratch and had no idea that the exciting Ladies’ Choice idea would emerge,” says Taylor. “Generally, he’ll have some tracks worked up and I’ll start with some melodic ideas and take it from there. When we listened back to the first song we wrote, its cool thumping old school vibe just reminded me of those 70s disco nights and the title ‘Ladies’ Night’ just hit me as the right title to convey the blend of retro-soul, romantic music and contemporary edges we were going for. Once we had established this concept, we expanded on it by including songs sung by some of my favorite female artists. I’ve included vocal tracks before on my recordings, but these ladies are taking my music to a whole new level.”\n\nEastmond (who produced seven tracks), Rideout (four) and Taylor are all good friends, and Taylor’s two producers have a friendly competition going each time the sax man asks them to come on board. “They want to know who’s going to do the most tracks,” Taylor laughs, “and who’s going to win out—Barry, whom Rex calls ‘the king of urban AC,’ or Rex, whose trademark is creating subtle accompaniment that lets me grow and do my thing. I have a dynamic chemistry with both, and each in their own way brings out the essence of what I do with my melodies.\n\nI know their tracks and soundscapes are going to be amazing, and I look forward to what we’re going to come up with together.” The first five Eastmond-produced cuts on Ladies’ Choice include the title track, “Here We Go” and “Streamline,” three co-writes by Eastmond and Taylor that blend old school soul atmospheres, bouncing bass grooves and the saxophonist’s dashing flair for horn texturing. Taylor’s powerful alto coloring and solo complement London’s passionate voice on the dreamy late night ballad “I Want To Be Loved By You”; his alto also sways behind Belle’s playful and sassy vocals on the crisp, sparsely arranged romance “How Did You Know” (which she co-wrote with Eastmond).\n\nEastmond’s other tracks include another lush Belle penned ballad, “Open Your Eyes,” which features a searing vocal/sax duet energy; and the sweet and breezy, old school-vibin’ “Summer’s End.” Rideout produced the other two incredible vocals on Ladies’ Choice, the sensuous, almost mystical “Long Distance Relationship,” which features beautiful voice texturing behind the lead of Terry Dexter, and the mid-tempo and brassy, classic blues and soul flavored “A Love Of Your Own” (a cover of an Average White Band classic) with vocalist Lauren Evans; Evans also co-wrote “Long Distance Relationship” with Rideout and guitarist Darrell Crooks. Rideout also helmed the sizzling, hard-edged disco-fied “Overdrive” and the funky; horn inflected closer “Point Of View.”\n\nA native of Denver, Taylor has lived and worked in the thriving musical environment of Las Vegas since graduating as a music performance major from UNLV. He began playing sax at age seven and discovered his true calling while playing in a local high school garage band called Mixed Company, which played Top 40, funk and Crusader-styled fusion. Aiming to build his resume beyond the many dues-paying Vegas lounge gigs that marked his early professional life, he commuted often to Los Angeles and hooked up in the late 80s with (his later producer) Dino Esposito. Taylor did one of Esposito’s sessions at Jeff Lorber's home studio; a few years later, in 1994, the popular keyboardist remembered Taylor and asked him to play with him at the Catalina Island Jazz Trax Festival. Popular keyboardist Keiko Matsui and her producer/husband Kazu liked Taylor’s charismatic performance and soon offered him an audition with their band. He recorded and toured with the Matsuis for two years (appearing on Sapphire and Dream Walk), and Kazu Matsui eventually produced the sax man’s debut On The Horn, which spawned the #1 radio hit “Till We Meet Again.” Taylor quickly found his own niche in the smooth jazz world, and his quick but well deserved popularity led Pleasure Seeker to the top of the radio charts. The #1 title track was one of Radio & Records most played genre cuts of the year.\n\nAlthough Taylor has since been one of the genre's most popular live attractions as a solo artist, he eagerly accepted Russ Freeman’s invitation to tour with The Rippingtons as a special guest artist in 2000—the year he released his third album Undercover–after Jeff Kashiwa left the group. After making his Peak debut with 2001’s Hypnotic, Taylor’s career reached a fever pitch in 2004 when “Steppin’ Out,” the title track from his 2003 Top Ten Billboard Contemporary Jazz album, became Radio & Records’ third biggest genre airplay cut of the year. He also toured as a featured performer with the all-star “Groovin’ For Grover” lineup (including Jeff Lorber, Richard Elliot and Gerald Albright) and performed and made his acting debut on the legendary ABC soap opera One Life To Live. The incredible momentum continued with his 2005 release Nightlife, Taylor’s latest to hit the Top Five of Billboard’s Contemporary Jazz Chart. After participating in Norman Brown’s Summer Storm II tour in 2006, the saxophonist began 2007 aboard the Brian Culbertson All-Star Smooth Jazz Cruise as a featured headlining performer.\n\nThis year, he is looking forward to sharing numerous tour dates with Regina Belle. “For me, the whole music making process begins with me in a room with the sax, writing melodies from the heart,” says Taylor. “In addition to working with Barry and Rex again, it’s been a great experience to work with these incredible ladies. The best part of this project was just being able to get in the studio and do it. It’s easy to take this journey for granted, but I’m grateful to be alive to share the music that’s in my heart with the fans. I feel very lucky that I’ve been able to make it happen for so long.”\n\nOne of the high points of Taylor’s live performances is the segment when he invites a handful of excited female fans onstage to sway along with him as he plays his hit song “Deeper.” With Ladies’ Choice, the sweet ongoing seduction goes deeper still!\n\n(2) Paul Taylor - Psytrance DJ\n\nAlready well known internationally as a DJ with a unique ability to source and play the freshest sounds, Paul\u0081fs credentials are well documented. A veteran from Goa parties since the mid nineties, he was quickly noticed by TIP records and joined in 2001 as a label DJ along with Dimitri Nakov and Raja Ram. After two years in the London Tip Office, he then relocated to Ibiza where he soon began to co produce music with artists such as Earthling, Shanti and Bushman.\n\nIn 2002 he joined Spun Records as Ibiza label manager and A&R/DJ, compiling the very well received Spun Complilation: Tweakers\u0081. A regular at many of the bigger events in Europe, Mexico, South America, Israel and Japan, Paul is one of the most sought after Psy Trance DJ\u0081's around the world, having made his reputation for playing powerful sets of his own particular style of Hi Tech inspired Full On and continuously pushing the boundaries of the Psy Trance medium. His exacting taste, and ability to source music has led to five very successful V.A compilations so far, on labels such as Crystal Matrix, Spun, Sirius, & Sound Sorcery; all of which have been firm favourites with on the world DJ circuit.\n\n\n\nHis new record 'High Times' (Kundalini 2008) was originally meant as another V/A compilation. However Paul soon decided to craft his own sounds and the album soon became an artist album under his own name. With a focus on a more minimal sound 'High Times' reflects on the tech-trance of the late 90's but gives it a new fresh edge with some tight production and forward thinking.\n\n(3) Paul Taylor - Experimental Musician\n\nOne half of Sutcliffe Jügend and occasional solo artist."}, {"url": "https://prabook.com/web/paul.taylor/2179442", "page_content": "Paul Taylor\n\nGuitarist keyboardist\n\nJune 4, 1960 (age 31) San Francisco, California, United States of America\n\nAlthough he is perhaps most frequently associated with Winger, Taylor has also played with numerous other prominent musicians, including future Sammy Hagar and Boston guitarist Gary Pihl (in his early days), Eric Martin (solo artist and future Mr Big frontman), Aldo Nova, Steve Perry of Journey, Alice Cooper and Tommy Shaw. Taylor experienced his first mainstream success in the early 1980s as the touring keyboardist in Canadian musician Aldo Nova\"s backing band, and he appears in the music video for Nova\"s biggest hit, \"Fantasy.\" Prior to forming Winger, Taylor and Kip Winger were both playing with Alice Cooper\"s backing band on the tours for Cooper\"s mid-80s albums, Constrictor (1986) and Raise Your Fist and Yell (1987). During this time, the two began composing songs together and, while on break from touring, recorded what would become the first Winger demos. Whereas Kip left Alice\"s band prior to the European leg of the 1987 tour, Paul remained on board for the European dates. However, in the midst of touring Europe, Paul received a call from Kip, who had been working with future Winger lead guitarist Reb Beach recording more demos in New York, informing him that he had gotten a record deal. After the European tour was finished, Paul flew straight back to New York, and the Winger project (initially known as \"Sahara\") began rehearsing and recording their debut album. Taylor remained in Winger throughout the band\"s most successful period, which included the two smash albums, Winger and In the Heart of the Young. However, after the tour supporting the latter album ended in 1991, Taylor left the band in early 1992, citing exhaustion and a desire to write and get involved with other projects. Throughout the 1990s, Taylor immersed himself in numerous other projects, perhaps the most prolific of which was recording and touring with Steve Perry for his 1994 solo album. In 1998, he returned to the Alice Cooper band (this time, alongside fellow former Winger guitarist Reb Beach), and once that tour ended, he embarked on a brief tour with Tommy Shaw. Winger reunited in 2001 to record new material for a Greatest Hits album. Although it is unclear whether Taylor participated in these recording sessions, he did later join the band on the supporting tour. Though Paul was asked by Kip Winger to rejoin the band again to work on their 2006 reunion album, he declined because he was already involved with other projects. More recently, Taylor has become involved in composing music for television series programs and has also been pursuing his passion for photography. He also spent the summer months of 2012 touring with Cinderella throughout the United States. playing keyboards for them. He returned to Winger during mid-2013 and performed with them on select tour dates up through early 2014 and appeared in the Queen Babylon released in late 2014."}, {"url": "http://news.theurbanmusicscene.com/2021/10/saxophonist-paul-taylor-to-release-new-project-and-now-this/", "page_content": "AND NOW THIS!\n\nTHE NEW ALBUM FROM SAXMAN PAUL TAYLOR’\n\nNOVEMBER 5, 2021\n\nTaylor and Long Time-Collaborator and Producer Dino Esposito Back In High Gear\n\nFirst Radio Single “Straight to the Point” #1 Most added on Billboard’s SJ Radio Chart\n\nSecond Grat Track Coming Oct. 22 features Jamie Jones from All-4-One\n\nOver 25 years into a stellar, multi-faceted career that’s found him continually pushing the sonic boundaries of what’s possible in contemporary urban jazz, saxophonist Paul Taylor brings us his highly-anticipated new recording AND NOW THIS on Peak Records.\n\nAND NOW THIS, fully created via the exchange of digital files between the Las Vegas based Taylor and his longtime musical compadre, collaborator, co-writer and producer Dino Esposito, features the saxman’s ongoing exploration of an expansive range of dynamic danceable grooves and intricate pop/electronica vibes. The ten tracks fully reflect the way Taylor began moving forward in his personal and creative life, as if to say, in his words, “we’re coming out of the pandemic, this is what I’ve been creating, we’re kicking it back into high gear and we are more open-minded in our approach to music than ever.”\n\nFrom the atmospheric soul and fast paced funk of the title track (featuring the guitar of Brian Monroney) through the sultry flow of the closing track “Good Night,” AND NOW THIS also celebrates the decades long friendship and intuitive, forward thinking musical chemistry between Taylor and Esposito. Their dynamic history dates back to when they played in the same band as students at the University of Nevada Las Vegas – and includes Taylor touring in Esposito’s band when he was a pop star in the late 80s touring with New Kids on the Block. Esposito has been Taylor’s chief sonic co-architect since the saxophonist’s 1995 debut On The Horn and subsequently collaborated on Pleasure Seeker (1997), Undercover (2000), his Peak Records debut Hypnotic (2001), Nightlife (2005), Prime Time (2011), Tenacity (2014) and Countdown (2016).\n\nWhile for some artists, song titles on instrumental urban jazz releases are merely clever sounding afterthoughts, the names of each track on AND NOW THIS represent the feeling and intention of the music. With its funked out grooves and swirling sax notes in the hook, “[email protected]” is all about that moment when we clock out, make our weekend plans and have the freedom to, as Taylor says, “chill and relax or take a drive along the coast.” Likewise, “The Face of You” represents a new facet of the saxman’s ever-deeper artistry, an immersion into an urban exotica landscape and hypno-cool synth textured atmosphere with his ever-present soaring soprano. Next is “Epic Dream,” a groove of soundscape effects and soaring atmospheres that’s pure dreamy escapist.\n\nTaylor enjoys riffing on the way some of the other titles combine to create something of a narrative about how the project took shape: “With Dino’s amazing synth swells, ‘Seize the Day’ is that perspective we’ve all gained this past year about the importance of living in the moment, and for musicians, it’s about always being the best version of ourselves. The vibe of ‘One Step Closer’ reminds me of that cool step music that was coming out of Chicago, but of course thematically it’s about working hard each day to finish the work or fulfill a dream. Those angelic synth voices Dino created throughout are like our special encouragers, reminding us that we can do it and to keep going. Covid happened, and we couldn’t get together to record, but we always ‘Find a Way’ to make things happen. It’s kind of a sweet romantic tune that tells us no matter what obstacles come in our path, we can always figure things out and get past them.”\n\nAmong Taylor’s chief musical influences in recent years have been globally popular, cutting edge DJ/producer/artists like the late Avicii, Tiesto and Regard. Complementing the new album’s nine inspiring originals, Taylor and Esposito have a blast bringing a vibrant, freewheeling new energy to a re-imagining of “Ride It,” Regard’s global 2019 hit remix of Jay Sean’s 2008 #1 UK R&B hit that started as a viral sensation on TikTok. Taylor’s infectious twist features the smooth, soulful vocals and fast paced phrasing of Jamie Jones of the GRAMMY winning group All-4-One.\n\nThe remarkable thing about those Taylor-Esposito collabs is that even the earliest albums they did together in the late 90s and early 2000s sound as sonically and rhythmically innovative as they did a few decades ago. A popular presence in contemporary urban jazz since the early 90s when he toured and later recorded with Keiko Matsui, Taylor scored #1 Billboard hits in the 2010s with “Burnin’,” “Push To Start” and “Supernova” and had his first #1 on the Billboard Contemporary Jazz Albums chart with Ladies’ Choice (2007), which was produced by Barry J. Eastmond and Rex Rideout.\n\nDuring the course of his storied career, the Denver native has headlined hundreds of shows and has been part of numerous all-star tours – including dates with Peter White and Euge Groove in a lineup affectionately dubbed “Peter, Paul and Euge;” Gentleman of the Night (with Marion Meadows and Warren Hill). He has also performed with The Rippingtons and the acclaimed “Groovin’ For Grover” tour. Some of his first post-pandemic lockdown shows have been with labelmate Michael Lington and Sax to the Max with Michael and Vincent Ingala.\n\nOfficially entering his second quarter century of recording, with AND NOW THIS, Taylor is as excited as ever to continue casting his creative aim higher and grateful for every opportunity to bring his best to his loyal legion of longtime and newer fans. “What I like most about the new album is its freshness, and the fact that after 25 years, Dino and I still have so many unique avenues to explore,” he says. “It’s a special album created in unusual, highly stressful times. There’s something to be said for all of us artists persevering through the shutdown of 2020 and finding a way to get it done. And we did — AND NOW THIS!”\n\nEastWest Media"}, {"url": "https://www.udiscovermusic.com/stories/paul-mccartney-debut-solo-album/", "page_content": "Cover: Courtesy of MPL Communications\n\nWhen Paul McCartney’s debut solo album, simply titled McCartney, was released on April 17, 1970, it was far from what many expected. Following Abbey Road’s polished perfection, McCartney chose to issue an album of songs, experiments, and sound doodles predominantly made on his own at home. It would launch a solo career spanning five decades – and counting. But first, he had to leave The Beatles.\n\nListen to McCartney on Apple Music and Spotify.\n\n“Paul quits The Beatles”\n\nOn April 9, 1970, McCartney phoned John Lennon to tell him that he was quitting the band. Lennon had told the group of his own intention to leave the group back in September 1969, though, by mutual agreement, no announcement was made. Now McCartney, too, had decided to up sticks.\n\nADVERTISEMENT\n\nWhat McCartney failed to mention to Lennon was that he had just sent a “self-interview” to the nation’s press, all but informing them that The Beatles were over. In this press release, which was sent with promotional copies of his self-titled debut solo album, Paul answered questions he assumed he would have been asked had he done a press conference. As well as talking about the new album, he spoke about The Beatles’ future – or lack of it.\n\nQ: Are you planning a new album or single with the Beatles?\n\nA: No.\n\nQ: Is this album a rest away from The Beatles or the start of a solo career?\n\nA: Time will tell. Being a solo album means it’s “the start of a solo career…” and not being done with The Beatles means it’s just a rest. So it’s both.\n\nQ: Is your break with The Beatles temporary or permanent, due to personal differences or musical ones?\n\nA: Personal differences, business differences, musical differences, but most of all because I have a better time with my family. Temporary or permanent? I don’t really know.\n\nQ: Do you foresee a time when Lennon-McCartney becomes an active songwriting partnership again?\n\nA: No.\n\nThe next day’s Daily Mirror ran the front-page headline “Paul Quits The Beatles.” If Paul wanted to ensure that his debut solo album didn’t go unnoticed, he could hardly have done more.\n\n“There was no attempt to compete”\n\nIn the half-century since its release, McCartney has been praised for its homemade nature, which gives it the charm that Paul saw in it all along. “I had all these rough things and I liked them all and thought, Well, they’re rough, but they’ve got that certain kind of thing about them.”\n\nAt the time of McCartney’s release, however, the reception was mixed, with many critics finding the songs half-finished and under-produced. With hindsight, however, by not attempting to compete with his former group with a well-produced record that he’d labored over, Paul stepped out from their shadows. As Neil Young put it when inducting Paul into the Rock And Roll Hall Of Fame, “There was no attempt made to compete with the things he had already done.”\n\nAlongside the Q&A, Paul included a track-by-track breakdown of the songs on his debut album, which he recorded largely on a Studer four-track tape machine in his Georgian townhouse in London’s leafy St John’s Wood, a short walk from Lord’s Cricket Ground, London Zoo and, more importantly, EMI’s studios at Abbey Road. The album was finished at Morgan Studios in the northwest London suburb of Willesden, and Abbey Road. Today, McCartney’s modus operandi has become an entire field of music-making, known as lo-fi. At the time, however, it was unheard of for a major artist to use such basic methods. Working without even a mixing desk, Paul plugged straight into the tape machine.\n\n“A trailer to the full song”\n\nMcCartney opens with a doodle of a song called “The Lovely Linda.” Coming in at well under a minute in length, McCartney admitted that this was the first thing he’d recorded when the Studer was installed, “to test the machine.” In his notes, Paul promises that “the song is a trailer to the full song, which will be recorded in the future.” Fifty years on, we’re still waiting to hear it.\n\nNext up is “That Would Be Something,” which, like “The Lovely Linda,” was written by McCartney on his Scottish farm in 1969. George Harrison declared it to be “great.” It’s an effortless breeze of a song, its country roots emphasized by Paul’s southern drawl. Of particular note are the drum fills, which Paul sings rather than plays.\n\nThat Would Be Something (Remastered 2011)\n\nWatch this video on YouTube Click to load video\n\nIf these two songs set an earthy atmosphere, “Valentine Day” establishes the record’s casual feel. Like “Momma Miss America,” this improvised instrumental was recorded “with more concern for testing the machine than anything else.”\n\nBut for all the casual nature of “Valentine Day,” it’s immediately followed by the first genuine McCartney classic of the collection. It would appear that “Every Night” tells of the two lives Paul was living at the time. On the one hand, The Beatles were falling apart; business differences found him on one side of a divide, with John, George, and Ringo on the other. By his own admission, McCartney descended into a depression and turned to the bottle for solace.\n\nOn the other hand, he was newly married, with a new baby girl, as well as Linda’s six-year-old daughter from a previous marriage. This dichotomy is reflected in “Every Night,” which opens, “Every night, I just want to go out/Get out of my head/Every day, I don’t want to get up/Get out of my bed,” before concluding: “But tonight I just want to stay in and be with you.”\n\nIn his notes, McCartney said that he’d had the opening lines for a few years. It’s also the first song on the album not recorded at home, having been laid down at Abbey Road.\n\nEvery Night (2011 Remaster)\n\nWatch this video on YouTube Click to load video\n\n“I sent Sinatra a song called ‘Suicide’ – he did not get it”\n\nIf he’d had those lines for a little while, “Hot As Sun” dates from much further back – to at least the late 50s. A 12-bar instrumental, Paul clearly enjoyed the number: not only had he revived it from over a decade earlier, during The Beatles’ “Get Back” sessions in January 1969, but he added it to the setlist for Wings’ final tour, in 1979.\n\nThe track is topped off with Paul’s recordings of wine glasses, before a brief fragment of a song called “Suicide” can be heard. Paul had written that song with the intention of giving it to Frank Sinatra. “I spoke to him on the phone and told him about it: ‘Great, Paul, send it along.’ Thank you, Frank! So I got that out of it. I did a demo, sent it to him and he thought I was taking the piss. He really did. ‘Is this guy kidding?’ You know, sending Sinatra a song called ‘Suicide’? He did not get it.”\n\nNext up is “Junk,” a song Paul had written during The Beatles’ stay with the Maharishi in India, in 1968. Appropriately, for an album that could be described as musical bric-a-brac, “Junk” features a lyric describing the ephemera in a junkyard. “Handlebars, sentimental jubilee, jam jars: I like images like that,” Paul explained in his fan club newspaper Club Sandwich. “There are certain words you like. I always used to say that ‘candlestick’ was my favorite word. Certain words either make colors in your head or bring up a feeling. So the song was a potpourri of nice words that I had to make some sense out of, so it was, ‘Buy buy, sell sell, ‘Junk’ says the sign in the yard.’ To lump it all together I got the idea of ‘Junk.’ It was a nice way to write a song.”\n\nJunk (2011 Remaster)\n\nWatch this video on YouTube Click to load video\n\nSide One of the original vinyl pressing closes with “Man We Was Lonely,” a song written towards the end of the recording sessions for McCartney’s solo debut album. As Paul noted, this was also his first duet with Linda. “The chorus (‘Man we was lonely’) was written in bed at home, shortly before we finished recording the album,” he recalled. “The middle (‘I used to ride…’) was done one lunchtime in a great hurry, as we were due to record the song that afternoon.”\n\nThe second half of the album opens with “Oo You,” an instrumental recorded at home, to which McCartney later added vocals at Morgan. After the bluesy instrumental “Momma Miss America,” came a song Paul had tried unsuccessfully to complete during the “Get Back” sessions. The Beatles’ aborted attempt at “Teddy Boy” would later surface on their Anthology 3 compilation, complete with John Lennon’s lampooning backing vocals, instructing the listener “take your partner, do-si-do,” while Paul collapses in giggles. It is a whimsical story-song typical of McCartney around those times, following the tradition of “Rocky Raccoon” and “Maxwell’s Silver Hammer.” An instrumental version of “Junk,” appropriately named “Singalong Junk,” follows, before the album’s undisputed tour de force, “Maybe I’m Amazed.”\n\nEven more passionate today\n\nWritten about his wife Linda in 1969, “Maybe I’m Amazed” was recorded at Abbey Road, with Paul again playing all the instruments – including one of his best guitar solos. Included in Rolling Stone’s list of the 500 greatest songs of all time, “Maybe I’m Amazed” remains a centrepiece of McCartney’s live shows. As he sings, photos of him, Linda and their family appear on a giant screen behind him; if anything, Paul’s delivery is even more passionate today, many years after Linda’s death, than it is on the album recording.\n\nPaul McCartney - Maybe I’m Amazed\n\nWatch this video on YouTube Click to load video\n\nBringing Paul McCartney’s solo debut album to a close is an experimental instrumental track named “Kreen-Akrore.” As McCartney explained in his notes: “There was a film on TV about the Kreen-Akrore Indians living in the Brazilian jungle, their lives, and how the white man is trying to change their way of life to his, so the next day, after lunch, I did some drumming. The idea behind it was to get the feeling of their hunt. So later piano, guitar, and organ were added to the first section.\n\n“The end of the first section has Linda and I doing animal noises (speeded up) and an arrow sound (done live with bow and arrow – the bow broke), then animals stampeding across a guitar case.”\n\nAnd with that, Paul McCartney began a solo career.\n\nMcCartney can be bought here."}, {"url": "https://bestclassicbands.com/paul-mccartney-solo-debut-album-review-6-27-20/", "page_content": "Share This:\n\nAs the Beatles stumbled through their final recording sessions in 1969, every member seemed to have a different view on whether they were about to break up, or had already done so. Maybe they were simply ready for a break from each other (and the often difficult job of being Beatles) and might continue to work together in the future? John Lennon had already asked for a “divorce” from the band, but didn’t specify when or how he might depart. As a business/management entity, the group had split into opposing camps, with John Lennon, George Harrison and Ringo Starr allied with hard-nosed New York businessman Allen Klein since May 1969, often clashing with lone hold-out Paul McCartney , who clung to his high-powered lawyers Lee and John Eastman, not incidentally his wife Linda’s father and brother.\n\nIn November/December 1969 McCartney went into self-imposed exile from the whole Beatles mess, spending eight weeks in Scotland at his farm High Park, with Linda, her daughter Heather (from a previous marriage to Melville See), and their newborn daughter Mary. Paul had already kicked around some original tunes with the Beatles that hadn’t found a permanent home, including “Junk” and “Teddy Boy,” and began to think more seriously about launching a solo career with an LP he could record all by himself.\n\nListen to the Beatles’ demo of “Teddy Boy”\n\nJust before Christmas he and the family returned to their home in Cavendish Avenue, St. John’s Wood, London, and, as he later put it, he began to record with “a [4-track] Studer, one mic and nerve.”\n\nMcCartney didn’t have an overall plan in mind, and was happy to cobble together fragments of unfinished songs, ad-lib melodies on the spot and fiddle with instrumental experiments that owed something to his interest in the work of avant-garde classical composers John Cage, Karlheinz Stockhausen and Luciano Berio.\n\nHe hid his plans from the other Beatles even as he worked with Harrison and Starr on their final recording, “I Me Mine,” in early January 1970. He took his home recordings to Morgan Studios in northwest London, bumping them up to 8-track to overdub some additional parts, like Mellotron strings for a second version of “Junk.” By late February he was at EMI’s Abbey Road Studios, where he recorded “Every Night” (another Get Back/Let It Be sessions reject), “Man We Was Lonely” and “Maybe I’m Amazed,” still playing all the instruments himself.\n\nOn April 9, 1970, McCartney had Apple Records execs Derek Taylor and Pete Brown send out a press kit “Q&A” for which Paul posed the questions and answered them, making it clear the Beatles were over; his new album affirmed his devotion to “home, family, love.” McCartney was released the following week, on Apr. 17, over the objections of Klein and the other Beatles, who were incensed that it interfered with the already-scheduled Apple releases of Let It Be and Starr’s Sentimental Journey. Lennon later dismissed the album as “rubbish.” Harrison praised several tracks, but also criticized it for its fragmentary, unfinished nature, saying McCartney’s lack of collaborators meant “the only person he’s got to tell him if the song’s good or bad is Linda.”\n\nAt just under 35 minutes in length, the album was certainly unambitious when compared to McCartney’s previous contributions to Revolver, Sgt. Pepper’s, The White Album, etc., and that was clearly the point. This was homespun music that answered to no one else, a declaration of independence that made it to #1 on Billboard’s Top LPs listing, while underwhelming most music critics upon release.\n\nRelated: The #1 albums of 1970\n\nReviews with phrases like “sheer banality,” “no substance” and “second rate” were the norm, although most reserved some kind words for “Maybe I’m Amazed,” the most commercial and fully realized track. McCartney refused to release it, or anything else on the album, as a 45 rpm single, but airplay was copious nonetheless. When anyone thinks of McCartney’s debut they probably remember “Maybe I’m Amazed” first, despite it being placed as the second-to-last track on side two, normally seen as an LP’s dead zone.\n\nThe snippet “The Lovely Linda” begins the album before yielding to “That Would Be Something,” a bluesy, repetitive lope with minimal lyrics (“That would be something/To meet you in the falling rain”) and McCartney’s amusing, playful vocal scatting.\n\n(Fun fact: Recognizing its roots in the blues, Jerry Garcia inserted the super-loose tune into 16 Grateful Dead shows in the 1990s, often paired with “Nobody’s Fault But Mine.”) The wordless “Valentine Day” follows, with McCartney doing some fine offhand work on electric guitar, dubbed over his acoustic, and some pretty good drumming.\n\nAlong with the other instrumental tracks “Hot as Sun/Glasses,” and “Kreen-Akrore,” it functions as something more than filler, although most fans probably ignore these instrumentals as “not real songs.” The heavy-drumming “Kreen-Akrore” which ends the album, by the way, was McCartney’s attempt at an audio tribute to the hunters of the Amazonian tribe he saw on a television documentary.\n\n“Every Night” has a beautiful melody, nicely laid in bass and guitar tracks, and is sung quite well by McCartney, who fails to provide lyrics for the chorus and goes into a falsetto “woo-hoo-hoo” instead, to charming effect. “Junk” features glockenspiel-like struck wineglasses, very delicate guitar and bass parts, and what sounds like a percussion shaker or maybe a brushed snare drum. The lyrics are tenderly evocative: “Motor cars, handlebars/Bicycles for two/Broken-hearted jubilee/Parachutes, army boots/Sleeping bags for two/Sentimental jamboree.” A second version without lyrics, titled “Singalong Junk,” is included on the second side of the LP. Originally written when the Beatles were in India during 1968, it never found a place on one of their albums despite being demoed.\n\n“Man We Was Lonely” is a countryish ditty which nods to Carl Perkins and Johnny Cash in its arrangement; one can easily imagine Harrison playing the slide guitar part. McCartney’s singing is engaging even when the lyrics aren’t much, and Linda interjects a couple vocal echoes.\n\n“Oo You” is McCartney’s version of funk, cowbell to the fore. He’s clearly having a blast playing drums, guitar and bass like he’s at a bizarro Chuck Berry session. It’s got another freewheeling, improvisatory vocal with typical-for-Paul Little Richard touches, and flaunts its rudimentary lyrics with panache: “Look like a woman/Dress like a lady/Talk like a baby/Love like a woman.”\n\nAnnouncing “rock and roll springtime—take one,” McCartney rips into “Momma Miss America” with drumming that recalls “Don’t Pass Me By,” bumping bass, tremolo-laden electric guitar and pounding piano. It falls apart in the middle and starts over with a different-sounding electric guitar solo over acoustic, has another false ending, and then McCartney goes all Jerry Lee Lewis on the piano as the cut crashes to an end.\n\nThe 13-track album was wrapped in a striking gatefold sleeve, with a collage of Linda’s family photos inside, and two images that became especially iconic: spilled cherries on the front cover (without any type) and baby Mary tucked into Paul’s fur jacket on the back under the word “McCartney.”\n\nListen to “Don’t Cry Baby,” an outtake from the album\n\nAn expanded CD reissue in 2011 featured some unremarkable outtakes, a demo of a somewhat embarrassing tune titled “Women Kind,” and live recordings of “Every Night,” “Hot as Sun” and “Maybe I’m Amazed” from Glasgow, 1979. Successful as it was commercially, the casual McCartney was eclipsed by its follow-up, Ram, the following year. For some, the debut is merely a lightweight prelude to the last 50 years of McCartney’s extraordinary, varied solo career. It certainly has its moments, and contains some quite heartfelt sentiments about Linda and family life that with her untimely death in 1998 are all the more poignant. McCartney is a picture of Paul in transition, a historical document of quiet beauty.\n\nWatch Paul and Wings perform “Maybe I’m Amazed” live in 1976"}, {"url": "https://www.allmusic.com/artist/paul-taylor-mn0000066318/biography", "page_content": "Paul Taylor is an American alto and soprano saxophonist. His reedy tone and warm, bright sound frame dynamic, danceable grooves and intricate pop shot through with electronica. He has been leading his own dates since 1995's On the Horn. 2000's Undercover spent 28 weeks on the Contemporary Jazz charts. 2007's chart-topper Ladies Choice crossed over to R&B thanks to hit singles \"I Want to Be Loved by You\" (feat. LaToya London) and \"How Did You Know\" (feat. Regina Belle). Taylor played sold-out houses on the Gentlemen of the Night tours with fellow saxophonists Marion Meadows, Michael Lington, and Warren Hill. Taylor's skillful collaborations with vocalists include charting appearances with Maxi Priest and Peabo Bryson. 2014's Tenacity also crossed over thanks to its first single, \"Supernova\" (feat. Jonathan Fritzen). 2021's And Now This was constructed from digital files exchanged between Taylor and longtime producer Dino Esposito during the pandemic; their goal was to create a beat-conscious set of club tracks and radio singles. The latter included \"Ride It,\" sung by All-4-One vocalist Jamie Jones.\n\nTaylor was raised in Denver. He took up the alto saxophone at the age of seven. He played in school bands, and in high school joined a Top 40 band called Mixed Company where he picked up the soprano horn as well. He attended the University of Nevada, Las Vegas on a full music scholarship. After graduating, jazz keyboardist Keiko Matsui and her producer husband Kazu Matsui, discovered him playing a gig at the Catalina Island Jazz Festival and hired him to back her on the spot. He spent two years with her road band before Kazu produced his 1995 debut solo album, On the Horn; it reached the jazz charts and spawned a radio hit in \"Til We Meet Again.\" Taylor worked with Keiko in the studio on 1995's chart-topping Sapphire, 1996's Dream Walk, and 1998's Full Moon and the Shrine, and remained a guest with her studio band through 2009's Moyo (Heart and Soul). Simultaneously, the saxist worked the road and in the studio with Casiopea drummer Akira Jimbo. He appeared on 1996's Flower and 1997's Stone Butterfly. Pleasure Seeker, Taylor's second solo album, followed in 1997 and was equally successful.\n\nIn 1999 he appeared on the Rippingtons' Topaz. He released his third album, Undercover, on Peak/N-Coded Music in February 2000 and toured as a special guest soloist with the Rippingtons. Subsequent albums Hypnotic (2001), Steppin' Out (2003), Nightlife (2005), and Ladies' Choice (2007), were all issued by Peak Records and registered high on the contemporary jazz charts -- Ladies' Choice went all the way to number one, crossed over to R&B, and landed well inside the Top 30. The album remained on the charts for 29 weeks. That year, Taylor played soprano on \"I Try,\" the Top Ten single from Peabo Bryson's Missing You.\n\nPeak released Taylor's eighth album, Burnin', in 2009. It spent 38 weeks on the smooth jazz charts and also peaked at number one. Two years later, Taylor returned with Prime Time; it went to number three on the contemporary jazz charts. In 2014, Taylor released Tenacity. With guest appearances from Jeff Lorber and vocalist Jonathan Fritzen, it too peaked at three, while spending 20 weeks on the jazz charts. In 2015, Taylor returned to working with Jimbo in the studio and on the road; he played alto and soprano on the drummer's acclaimed Groove of Life. Taylor's 2016 release Countdown cracked the Top Ten at jazz albums.\n\nAfter a long period of global touring with Jimbo, Matsui, and on his own, Taylor got an unintentionally extended break due to the COVID-19 pandemic. At the end of the year he began trading digital files with Esposito, consciously crafting an album aimed at global dancefloors. In November 2021, And Now This appeared from Peak with its first single, \"Ride It, sung by All-4-One's Jamie Jones. Later that month, Taylor enlisted Twitch streaming host OriginalSnow to duet with him on the funky non-album single \"Share It with You.\""}, {"url": "https://paultaylorsax.com/epk/", "page_content": "BIOGRAPHY\n\nPROMOTION\n\nOver 25 years into a stellar, multi-faceted career that’s found him continually pushing the sonic boundaries of what’s possible in contemporary urban jazz, saxophonist Paul Taylor brings us his twelfth highly-anticipated new recording AND NOW THIS on Peak Records.\n\nAND NOW THIS, fully created via the exchange of digital files between the Las Vegas based Taylor and his longtime musical compadre, collaborator, co-writer and producer Dino Esposito, features the saxman’s ongoing exploration of an expansive range of dynamic danceable grooves and intricate pop/electronica vibes. The ten tracks fully reflect the way Taylor began moving forward in his personal and creative life, as if to say, in his words, “we’re coming out of the pandemic, this is what I’ve been creating, we’re kicking it back into high gear and we are more open-minded in our approach to music than ever.”\n\nDuring the course of his storied career, the Denver native has headlined hundreds of shows and has been part of numerous all-star tours – including dates with Peter White and Euge Groove in a lineup affectionately dubbed “Peter, Paul and Euge;” Gentleman of the Night (with Marion Meadows and Warren Hill). He has also performed with The Rippingtons and the acclaimed “Groovin’ For Grover” tour. Some of his first post-pandemic lockdown shows have been with labelmate Michael Lington and Sax to the Max with Michael and Vincent Ingala.\n\nPeak Records press coverage for And Now This\n\nBACKGROUND\n\nPaul Taylor grew up in Denver, where he took up the saxophone at the age of seven. He played in school bands, and in high school joined a Top 40 band called Mixed Company. Jazz keyboardist Keiko Matsui and her husband, producer Kazu Matsui, discovered him playing at the Catalina Island Jazz Festival and hired him to play in their band. He spent two years with them, and then Kazu Matsui produced his 1995 debut album, On the Horn, which reached the jazz charts and spawned a radio hit in “Til We Meet Again.” Pleasure Seeker, his second album, followed in 1997 and was equally successful. Taylor released his third album, Undercover, on Peak/N-Coded Music in February 2000. Also in 2000, he toured as a special guest artist with the Rippingtons. Subsequent albums Hypnotic (2001), Steppin’ Out (2003), Nightlife (2005), and Ladies’ Choice (2007), all issued by Peak Records, figured high in the contemporary jazz charts, with Ladies’ Choice going all the way to number one. Peak released Taylor’s eighth album, Burnin’, in 2009. Two years later, Taylor returned with the album Prime Time. In 2014, Taylor released Tenacity, which featured guest appearances from Jeff Lorber and Jonathan Fritzen. The album was produced by Dino Esposito, who was also at the controls for Taylor’s 2016 release Countdown, which cracked the Top Ten of the jazz album charts.\n\nAND NOW THIS\n\nAnd Now This: https://paultaylorsax.com/wp-content/uploads/And-Now-This.mp3\n\nDownload Full Album Preview (Zip)\n\nHI-RES DOWNLOADS\n\n(Right-click and Save As)\n\nSOCIAL\n\nFACEBOOK\n\nINSTAGRAM\n\nTWITTER\n\nYOUTUBE\n\nSPOTIFY\n\nAPPLE MUSIC\n\nCONTACT\n\nWORLDWIDE BOOKING:\n\nFred Hansen\n\nRELIANT TALENT AGENCY\n\n917-701-8805\n\nfhansen@relianttalent.com\n\nPUBLICITY CONTACT:\n\nSheryl Feuerstein\n\nEastWest Media, 310-650-8668\n\nsheryl@eastwestmedia.net\n\nRECORD LABEL CONTACT:\n\nPeak Records / Andi Howard\n\npeakrecordsusa@gmail.com"}]}