{"Linda Hunt made her film debut playing Mrs. Oxheart in Popeye (1980).": [{"url": "https://pantheon.world/profile/person/Linda_Hunt/", "page_content": "Linda Hunt\n\nLydia Susanna \"Linda\" Hunt (born April 2, 1945) is an American actress of stage and screen. She made her film debut playing Mrs. Oxheart in Popeye (1980) . Read more on Wikipedia\n\nSince 2007, the English Wikipedia page of Linda Hunt has received more than 7,486,203 page views. Her biography is available in 45 different languages on Wikipedia (up from 41 in 2019) . Linda Hunt is the 458th most popular actor (up from 641st in 2019), the 866th most popular biography from United States (up from 1,156th in 2019) and the 236th most popular American Actor.\n\nLinda Hunt is most famous for playing the role of a male character in the movie \"The Year of Living Dangerously\" (1982)."}, {"url": "https://en.geneastar.org/genealogy/huntlydia/linda-hunt", "page_content": "Lydia Susanna \"Linda\" Hunt (born April 2, 1945) is an American actress of stage and screen.\n\nShe made her film debut playing Mrs. Oxheart in Popeye (1980). Hunt portrayed the male character Billy Kwan in The Year of Living Dangerously (1982) for which she won the Academy Award for Best Supporting Actress, becoming the first person to win an Oscar for portraying a character of the opposite sex. Hunt has also appeared in films such as Dune (1984), Silverado (1985), Kindergarten Cop (1990), Pocahontas (1995), Pocahontas II: Journey to a New World (1998), and Stranger Than Fiction (2006).\n\nHunt has had a successful career on television and in voice-over work, notably being the narrator for the Ancient Greek mythology themed God of War video game series. From 1997 to 2002, she played the recurring role of Judge Zoey Hiller on The Practice and played Commander Chennault on the sci-fi series Space Rangers. Beginning in 2009, she has portrayed Henrietta \"Hetty\" Lange on the CBS television series NCIS: Los Angeles, a role for which she has received two Teen Choice Awards.\n\n...\n\nLydia Susanna \"Linda\" Hunt (born April 2, 1945) is an American actress of stage and screen.She made her film debut playing Mrs. Oxheart in Popeye (1980). Hunt portrayed the male character Billy Kwan in The Year of Living Dangerously (1982) for which she won the Academy Award for Best Supporting Actress, becoming the first person to win an Oscar for portraying a character of the opposite sex. Hunt has also appeared in films such as Dune (1984), Silverado (1985), Kindergarten Cop (1990), Pocahontas (1995), Pocahontas II: Journey to a New World (1998), and Stranger Than Fiction (2006).Hunt has had a successful career on television and in voice-over work, notably being the narrator for the Ancient Greek mythology themed God of War video game series. From 1997 to 2002, she played the recurring role of Judge Zoey Hiller on The Practice and played Commander Chennault on the sci-fi series Space Rangers. Beginning in 2009, she has portrayed Henrietta \"Hetty\" Lange on the CBS television series NCIS: Los Angeles, a role for which she has received two Teen Choice Awards.Early lifeHunt was born on April 2, 1945, in Morristown, New Jersey. Her father, Raymond Davy Hunt (1902–1985), was vice president of Harper Fuel Oil. Her mother, Elsie Doying Hunt (1903 – c. 1994), was a piano teacher who taught at the Westport School of Music, and performed with the Saugatuck Congregational Church Choir in Westport, Connecticut, the town where Hunt would be raised. She has one sibling, an older sister named Marcia (born 1940). Hunt attended the Interlochen Arts Academy and graduated from the Goodman School of Drama at the Art Institute of Chicago (now at DePaul University).CareerTheatreHunt was a well-known live-stage actress before she entered film and television. She made her Broadway debut in the 1975 revival of Ah, Wilderness. She was nominated for the Tony Award for Best Actress in a Play for her work in the 1984 play End of the World. She also received two ensemble Obie Awards for her work Off-Broadway in Top Girls and A Metamorphosis in Miniature.Hunt created the role of Aunt Dan in Wallace Shawn's play Aunt Dan and Lemon. She was a member of the Long Wharf Theatre Company in Connecticut, where she performed the Player Queen in a production of Hamlet, amongst other roles. She portrayed Sister Aloysius in the Pasadena Playhouse production of John Patrick Shanley's play Doubt. Hunt was praised for her performance as the title character in Bertolt Brecht's Mother Courage and Her Children. She also appeared as Pope Joan in Caryl Churchill's Top Girls when London's Royal Court Theatre's production was staged at the Public Theater in New York.In an interview with writer Craig Gholson and actor Vincent Caristi, Hunt said: \"Acting onstage is like an explosion each night. And what comes in at you all the time as you are trying to . . . create something which is a tremendous act of organization and concentration.\"FilmKnown for her small stature, Hunt made her film debut in 1980 in Robert Altman's musical comedy Popeye.Two years later, Hunt co-starred as Billy Kwan in The Year of Living Dangerously, Peter Weir's film adaptation of the novel of the same name. For her work in this film, Hunt won the Academy Award for Best Supporting Actress in 1983, becoming the first person to win an Oscar for playing a character of the opposite sex. In her screen test, Hunt wore a hairpiece, a fake moustache, and \"paste-on pieces above her eyes to [appear] Asian.\" To play the role, Hunt had her hair dyed and cut short, had her eyebrows shaved, wore padding and makeup, and wore something in her shirt pocket. In her 1986 interview with the Bomb magazine, Hunt remarked that Billy Kwan \"is supra-personal [with] layers of sexual ambiguity[.]\"Hunt also played the Shadout Mapes in Dune (1984 film), a nurse in She-Devil (1989), the austere school principal Miss Schlowski opposite Arnold Schwarzenegger in Kindergarten Cop (1990), and assassin Ilsa Grunt in If Looks Could Kill (1991).TelevisionHunt's television appearances include recurring roles as Judge Zoey Hiller on David E. Kelley's series The Practice and as Dr. Claire Bryson on Without a Trace. She has narrated several installments of The American Experience on PBS. Since 2009, she has co-starred as Operations Manager Henrietta \"Hetty\" Lange on the CBS show NCIS: Los Angeles. Her co-stars on that show have included Chris O'Donnell, LL Cool J, Daniela Ruah, Eric Christian Olsen, Miguel Ferrer and Barrett Foa. Hunt has won two Teen Choice Awards for her work on NCIS: Los Angeles.Voice workHunt is known for her husky voice. She has narrated numerous documentaries, cartoons, and commercials. She is the on-air host for City Arts & Lectures, a radio program recorded by KQED public radio at the Nourse Theater in San Francisco. Hunt voiced the role of Grandmother Willow in the animated musical film Pocahontas (1995) and its direct-to-video sequel Pocahontas II: Journey to a New World (1998).Hunt narrated the National Geographic documentary The Great Indian Railway (1995). In 1998, she narrated the Discovery Channel documentary \"Titanic: Untold Stories.\" Hunt's voice work also includes the character of Management in Carnivàle (2003, 2005) and the narrator for God of War video game series. She narrated a PBS Nature special entitled Christmas in Yellowstone (2006).Personal lifeHunt has been in a relationship with psychotherapist Karen Kline since 1978. The two were married in 2008.As a teenager, Hunt was diagnosed as having hypopituitary dwarfism. Hunt stands 4 feet 9 inches (145 cm) tall.Hunt is an ambassador for the Best Friends Animal Society.In July 2018, People magazine reported that she was involved in a multicar accident in Los Angeles. The accident resulted in Hunt taking most of a year off from NCIS: Los Angeles.FilmographyVideo gamesGod of War as Gaia/NarratorGod of War II as Gaia/NarratorGod of War: Chains of Olympus as Gaia/NarratorGod of War III as Gaia/NarratorGod of War: Ghost of Sparta as Gaia/NarratorGod of War: Ascension as Gaia/NarratorTelevision creditsTheatreSee alsoList of LGBT Academy Award winners and nomineesReferencesExternal linksLinda Hunt at IMDbLinda Hunt at the Internet Broadway DatabaseLinda Hunt at the Internet Off-Broadway DatabaseLinda Hunt at City Arts & Lectures\n\n\n\nBiography from Wikipedia (see original) under licence CC BY-SA 3.0"}, {"url": "https://www.videodetective.com/person/linda-hunt-32690", "page_content": "Lydia Susanna Hunt, better known by her stage name Linda Hunt, is an American actress. After making her film debut playing Mrs. Oxheart in Popeye (1980), Hunt's breakthrough came playing the male character Billy Kwan in The Year of Living Dangerously (1982), for which she won the Academy Award for Best Supporting Actress, becoming the first person to win an Oscar portraying a character of the opposite sex.\n\nBirth Name\n\nLydia Susanna Hunter\n\nBorn\n\nMonday, 02 April 1945\n\nActress Filmography"}, {"url": "https://www.scripts.com/actor/linda_hunt", "page_content": "Linda Hunt\n\nLydia Susanna Hunt (born April 2, 1945), better known by her stage name Linda Hunt, is an American actress. After making her film debut playing Mrs. Oxheart in Popeye (1980), Hunt's breakthrough came playing the male character Billy Kwan in The Year of Living Dangerously (1982), for which she won the Academy Award for Best Supporting Actress, becoming the first person to win an Oscar portraying a character of the opposite sex. She has had great success in films such as The Bostonians (1984), Dune (1984), Silverado (1985), Eleni (1985), Waiting for the Moon (1987), She-Devil (1989), Kindergarten Cop (1990), If Looks Could Kill (1991), Rain Without Thunder (1992), Twenty Bucks (1993), Younger and Younger (1993), Prêt-à-Porter (1994), Pocahontas (1995), The Relic (1997), Pocahontas II: Journey to a New World (1998), Dragonfly (2002), Yours Mine and Ours (2005), and Stranger than Fiction (2006). Hunt has also had a successful television career. She played Rose in the television movie Basements (1987) and narrated in the television movie The New Chimpanzees. She guest-starred on Hallmark Hall of Fame in both 1978 and 1987, Space Rangers in 1993, Carnivale in both 2003 and 2005, Without a Trace in 2008, The Unit in 2008, and Nip/Tuck in 2009. From 1997 to 2002, Hunt played the recurring role of Judge Zoey Hiller on The Practice. She currently portrays Henrietta \"Hetty\" Lange on the CBS television series NCIS: Los Angeles, a role she has played since 2009, for which she has received two Teen Choice Awards. She is also the narrator for the Greek era of the God of War video game franchise.\n\nUpdate this biography »\n\nComplete biography of Linda Hunt »"}, {"url": "https://www.tcm.com/tcmdb/person/90862%7C0/Linda-Hunt/", "page_content": "Biography\n\nDespite her diminutive 4-foot, 9-inch frame, actress Linda Hunt emerged as a prominent, Oscar-winning performer in only her second film, playing doomed Chinese-Australian photojournalist Billy Kwan in Peter Weir's \"The Year of Living Dangerously\" (1982), which marked the first time in Academy Award history that an actor won for playing a character of the opposite sex. Her triumphant win led to a Tony-nominated performance in Arthur Kopit's \"End of the World\" (1983) and a supporting role as a saloon keep in the revisionist Western, \"Silverado\" (1985), though opportunities later became few and far between. While she logged numerous film and television roles over the years, including a long-running recurring role as a judge on \"The Practice\" (ABC, 1996-2004), Hunt developed a second career as a busy voiceover artist. She lent her surprising baritone as a narrator on environmental specials, while voicing characters in both video games - most notably on the \"God of War\" series - and various animated projects like Disney's \"Pocahontas\" (1995). By the time she was seen with regularity on such hit procedurals as \"Without a Trace\" (CBS, 2002-09) and \"NCIS: Los Angeles\" (2009- ), Hunt was a familiar presence in several different mediums; a testament to both her talent and her ability to overcome the odds.\n\nBorn on April 2, 1945, in Morristown, NJ, Hunt moved to Westport, CT with her family while still an infant. Burdened with a host of health problems since birth, Hunt was misdiagnosed with cretinism at six months of age. While in her teens, she was correctly diagnosed with hypo-pituitary dwarfism, a condition in which the pituitary gland fails to release enough growth hormone. Ironically, or perhaps consequently, Hunt grew up an unusual overachiever, undaunted by her condition. She took her first stab at acting at age 12 while performing in a production of \"Flibbertigibbet\" at Westport's famed Silver Nutmeg Theater. Hunt moved to New York in the mid-1960s, where she found consistent work in summer stock theater. Concerned that her unusual physical type would limit her future as an actress, Hunt initially focused on becoming a stage director. But the lure of acting proved too powerful to resist, so in 1969, Hunt returned to Westport to study acting under dramatic coach, Robert Lewis.\n\nIn the early 1970s, Hunt began a longtime association with the Long Wharf Theater in New Haven. Her one-woman show based on the life of Joan of Arc won the actress rave reviews and even flickers of interest from Broadway. A year later, Hunt went to New York City and made her off-Broadway debut as the Player Queen in the New York Shakespeare Festival's production of \"Hamlet\" in Central Park. This led to Hunt's first major role as the Irish maid Nora in a 1973 production of Eugene O'Neill's play, \"Ah, Wilderness!\" Originally directed by Arvin Brown for the Long Wharf Theatre, the play eventually moved to the Circle-in-the-Square Theatre along the Great White Way in New York, where it was taped for airing as a PBS special, \"Theater In America\" (1976). Hunt's screen career began in the late 1970s, when she made her television debut in a \"Hallmark Hall of Fame\" presentation of Arthur Miller's \"Fame\" (CBS, 1979). Adapted for the screen by the playwright himself, it was noteworthy that Miller specifically created Hunt's role of Mona with the actress in mind.\n\nThe following year, Hunt made her official big screen debut in Robert Altman's bloated and ultimately failed musical, \"Popeye\" (1980). Cast in a small supporting role as the feisty Mrs. Oxheart, Hunt's appearance was a fortunately forgettable cameo lost in an even more forgettable film that dogged stars Robin Williams and Shelley Duvall for years to come. Her next film, however, permanently changed her career. Tapped to co-star in the controversial drama \"The Year of Living Dangerously,\" Hunt joined burgeoning young actors Mel Gibson and Sigourney Weaver in director Peter Weir's complex drama. Based on a novel of the same name by Christopher Koch, the film told the complicated tale of an Australian journalist caught at the center of a foreign country's political overthrow. Based on the real-life events of the attempted 1965 coup of Jakarta by Indonesia's Communist party, \"Dangerously\" earned Hunt an Academy Award for Best Supporting Actress for her portrayal of Eurasian photographer, Billy Kwan. The first actor to ever win an Oscar for playing a role of the opposite gender, Hunt's record stood untouched until 1999, when Hilary Swank won an Oscar for \"Boys Don't Cry.\"\n\nDespite her formidable talent, however, Hunt hit the proverbial glass ceiling. Though she remained consistently employed on stage - even winning two Obies and a Tony nomination in the 1980s and 1990s - the pedigree of her film work had slipped. Still, Hunt's presence in movies managed to endure throughout this period. Among her higher profile roles were supporting turns in such critical favorites as \"Silverado\" (1985), in which she played Stella, a genial saloon proprietor, and the blockbuster comedy, \"Kindergarten Cop\" (1990), portraying a school principle disapproving of a rough-and-tumble cop (Arnold Schwarzenegger) going undercover as a kindergarten teacher to capture a wanted fugitive. In 1993, Hunt briefly returned to television, starring in the ill-fated space opera, \"Space Rangers\" (CBS, 1993), which was cancelled after just six episodes. After a brief dormancy in the mid-to late 1990s, during which time she only appeared in the horror dud, \"The Relic\" (1997), Hunt's career underwent something of a renaissance when she turned to television. In 1997, Hunt created the role of Judge Zoey Hiller on David E. Kelly's long-running legal dramedy, \"The Practice.\" A favorite recurring character for the show's fans, Hunt reprised the role more than two dozen times before the show finally adjourned its run.\n\nIn 2003, Hunt joined the cast of the HBO drama \"Carnivale\" (HBO, 2003-05) for a 10-episode run as the mysterious voice of Management. In 2005, actress Hunt added an unlikely new credit to her resume: video game icon. As the resonant, authoritative voice of the Narrator for the award-winning \"God of War\" video game series, Hunt gained a whole new generation of fans unfamiliar with her acting work. Hunt reprised the voiceover role for the game's sequel, \"God of War 2.\" Following a long vacation away from features, Hunt finally returned to the big screen with the blended family comedy \"Yours, Mine, and Ours\" (2005), starring Dennis Quaid and Rene Russo. While her role was hardly much of a challenge for the actress, the movie did at least allow Hunt a rare opportunity to flex her comedic muscles. Her next project continued in the same vein, as Dr. Mittag-Leffler in director Marc Forster's twisted comedy, \"Stranger than Fiction\" (2006) starring Will Ferrell and Emma Thompson. After building a second career voicing narration for numerous PBS specials, including \"Secrets of the Ocean Realm\" (1997), \"Woodrow Wilson\" (2002) and \"Auschwitz: Inside the Nazi State\" (2004), Hunt joined the cast of the successful spin-off series, \"NCIS: Los Angeles\" (CBS, 2009- ), playing OSP Operations Manager Henrietta Lange."}, {"url": "https://alchetron.com/Linda-Hunt", "page_content": "Lydia Susanna Hunter (born April 2, 1945), better known by her stage name Linda Hunt, is an American film, stage, and television actress. After making her film debut playing Mrs. Oxheart in Popeye (1980), Hunt's breakthrough came playing the male character Billy Kwan in The Year of Living Dangerously (1982), for which she won the Academy Award for Best Supporting Actress, becoming the first person to win an Oscar portraying a character of the opposite sex.\n\nShe has had great success in films such as The Bostonians (1984), Dune (1984), Silverado (1985), Eleni (1985), Waiting for the Moon (1987), She-Devil (1989), Kindergarten Cop (1990), If Looks Could Kill (1991), Rain Without Thunder (1992), Twenty Bucks (1993), Younger and Younger (1993), Prêt-à-Porter (1994), Pocahontas (1995), The Relic (1997), Pocahontas II: Journey to a New World (1998), Dragonfly (2002), Yours Mine and Ours (2005), and Stranger Than Fiction (2006).\n\nHunt has also had a successful television career. She played Rose in the television movie Basements (1987) and narrated in the television movie The New Chimpanzees. She guest-starred on Hallmark Hall of Fame in both 1978 and 1987, Space Rangers in 1993, Carnivale in both 2003 and 2005, Without a Trace in 2008, The Unit in 2008, and Nip Tuck in 2009. From 1997 to 2002, Hunt played the recurring role of Judge Zoey Hiller on The Practice. She currently portrays Henrietta \"Hetty\" Lange on the CBS television series NCIS: Los Angeles, a role she has held since the 2009 debut, for which she has received two Teen Choice Awards. She is also the narrator in the God of War video game franchise.\n\nEarly life\n\nHunt was born in Morristown, New Jersey, and raised in Westport, Connecticut. She is one of the two daughters of Raymond Davy Hunter, vice president of Harper Fuel Oil on Long Island, and Elsie Doying Hunter, a piano teacher who taught at the Westport School of Music and accompanied the Saugatuck Congregational Church choir. Hunt attended the Interlochen Arts Academy and the Goodman School of Drama in Chicago (now part of DePaul University).\n\nFilm\n\nHunt's film debut in 1980 was in Robert Altman's musical comedy Popeye. Two years later, she co-starred as Billy Kwan in The Year of Living Dangerously, Peter Weir's film adaptation of the novel of the same name. For her role as the male Chinese-Australian photographer Billy Kwan, Hunt won the Academy Award for Best Supporting Actress in 1983, becoming the first person to win an Oscar for playing a character of the opposite sex. In addition, the character was Asian and had the condition of dwarfism. In her screen test, Hunt wore a hairpiece, a fake moustache, and \"paste-on pieces above her eyes to [appear] Oriental\". To accomplish the role during production, Hunt shortened \"her hair and dye[d] it black[,] wore padding around her waist, shaved her eyebrows, and carried something in her shirt pocket.\" In her 1986 interview with the Bomb magazine, Hunt remarked that Billy Kwan \"is supra-personal [with] layers of sexual ambiguity[.]\"\n\nHunt also played a nurse in She-Devil (1989) and the austere school principal opposite Arnold Schwarzenegger in Kindergarten Cop in 1990. Hunt played the assassin Ilsa Grunt in If Looks Could Kill (1991) opposite Richard Grieco and Roger Rees.\n\nTheatre\n\nHunt was a well-known stage actress before she entered film and television. She made her Broadway debut in a 1975 production of Ah, Wilderness. She was nominated for the Tony Award for Best Actress in a Play for her work in the 1984 play End of the World. She also received two ensemble Obie Awards for her work Off-Broadway in Top Girls and A Metamorphosis in Miniature. She created the role of Aunt Dan in Wallace Shawn's play Aunt Dan and Lemon. She was a member of the Long Wharf Theatre Company in Connecticut. There she played the Player Queen in a production of Hamlet, among other roles. She portrayed Sister Aloysius in the Pasadena Playhouse production of John Patrick Shanley's play Doubt. She was praised for her performance as the title character in Bertolt Brecht's Mother Courage and Her Children. Hunt also appeared as Pope Joan in Caryl Churchill's Top Girls when London's Royal Court Theatre's production was staged at the Public Theater in New York. In an interview with writer Craig Gholson and actor Vincent Caristi, Hunt discussed her experience acting in theatre, “Acting onstage is like an explosion each night. And what comes in at you all the time as you are trying to . . . create something which is a tremendous act of organization and concentration.”.\n\nTelevision\n\nHer television appearances include recurring roles as Judge Zoey Hiller on David E. Kelley's series The Practice and as Dr. Claire Bryson on Without a Trace. She has narrated several installments of The American Experience on PBS. Since 2009, she has co-starred as Operations Manager Henrietta \"Hetty\" Lange, on the CBS show NCIS: Los Angeles with Chris O'Donnell, LL Cool J, Daniela Ruah, Eric Christian Olsen, and Barrett Foa.\n\nVoice work\n\nHunt has a rich, resonant voice, which she has used in numerous documentaries, cartoons, and commercials. She is the on-air host for City Arts & Lectures, a radio program recorded by KQED public radio at the Nourse Theater in San Francisco, a program that presents interviews with celebrated writers, artists, and thinkers addressing contemporary ideas and values, often discussing the creative process. Hunt was chosen by Walt Disney Feature Animation to lend her enigmatic speaking and singing voice to Grandmother Willow in the animated musical film Pocahontas and its direct-to-video sequel Pocahontas II: Journey to a New World.\n\nHer voice work includes also the character of Management in Carnivàle, and the protogenoi Gaia, who serves as the narrator in the God of War series of video games. She narrated the introductory film at the International Spy Museum in Washington, DC, and has also been heard in various commercials of the late 1990s for Tylenol.\n\nHunt narrated the PBS Nature special entitled Christmas in Yellowstone. She also narrated the National Geographic documentary The Great Indian Railway.\n\nPersonal life\n\nHunt is 4 feet 9 inches (1.45 m) tall. In high school, she was diagnosed as having hypopituitary dwarfism.\n\nSince 1987 Hunt has lived in Los Angeles with her wife Karen Klein, whom she married in 2008. Hunt is an ambassador for the Best Friends Animal Society.\n\nVideo games\n\nGod of War as Narrator\n\nGod of War II as Gaia/Narrator\n\nGod of War: Chains of Olympus as Narrator\n\nGod of War III as Pre-title screen credits Narrator\n\nGod of War: Ghost of Sparta as Narrator\n\nGod of War: Ascension as Narrator"}, {"url": "https://www.owlapps.net/owlapps_apps/articles?id=492152&lang=en", "page_content": "Lydia Susanna \"Linda\" Hunt (born April 2, 1945) is an American actress of stage and screen.\n\nShe made her film debut playing Mrs. Oxheart in Popeye (1980). Hunt portrayed the male character Billy Kwan in The Year of Living Dangerously (1982) for which she won the Academy Award for Best Supporting Actress, becoming the first person to win an Oscar for portraying a character of the opposite sex. Hunt has also appeared in films such as Dune (1984), Silverado (1985), Kindergarten Cop (1990), Pocahontas (1995), Pocahontas II: Journey to a New World (1998), and Stranger Than Fiction (2006).\n\nHunt has had a successful career on television and in voice-over work, notably being the narrator for the Ancient Greek mythology themed God of War video game series. From 1997 to 2002, she played the recurring role of Judge Zoey Hiller on The Practice and played Commander Chennault on the sci-fi series Space Rangers. From 2009 to 2023, she has portrayed Henrietta \"Hetty\" Lange on the CBS television series NCIS: Los Angeles, a role for which she has received two Teen Choice Awards.\n\nEarly life\n\nHunt was born on April 2, 1945, in Morristown, New Jersey. Her father, Raymond Davy Hunt (1902–1985), was vice president of Harper Fuel Oil. Her mother, Elsie Doying Hunt (1903 – c. 1994), was a piano teacher who taught at the Westport School of Music, and performed with the Saugatuck Congregational Church Choir in Westport, Connecticut, the town where Hunt would be raised. She has one sibling, an older sister named Marcia (born 1940). Hunt attended the Interlochen Arts Academy and graduated from the Goodman School of Drama at the Art Institute of Chicago (now at DePaul University).\n\nCareer\n\nTheatre\n\nHunt was a well-known live-stage actress before she entered film and television. She made her Broadway debut in the 1975 revival of Ah, Wilderness. She was nominated for the Tony Award for Best Actress in a Play for her work in the 1984 play End of the World. She also received two ensemble Obie Awards for her work Off-Broadway in Top Girls and A Metamorphosis in Miniature.\n\nHunt created the role of Aunt Dan in Wallace Shawn's play Aunt Dan and Lemon. She was a member of the Long Wharf Theatre Company in Connecticut, where she performed the Player Queen in a production of Hamlet, amongst other roles. She portrayed Sister Aloysius in the Pasadena Playhouse production of John Patrick Shanley's play Doubt. Hunt was praised for her performance as the title character in Bertolt Brecht's Mother Courage and Her Children. She also appeared as Pope Joan in Caryl Churchill's Top Girls when London's Royal Court Theatre's production was staged at the Public Theater in New York.\n\nIn an interview with writer Craig Gholson and actor Vincent Caristi, Hunt said: \"Acting onstage is like an explosion each night. And what comes in at you all the time as you are trying to . . . create something which is a tremendous act of organization and concentration.\"\n\nFilm\n\nKnown for her small stature, Hunt made her film debut in 1980 in Robert Altman's musical comedy Popeye.\n\nTwo years later, Hunt co-starred as Billy Kwan in The Year of Living Dangerously, Peter Weir's film adaptation of the novel of the same name. For her work in this film, Hunt won the Academy Award for Best Supporting Actress in 1983, becoming the first person to win an Oscar for playing a character of the opposite sex. In her screen test, Hunt wore a hairpiece, a fake moustache, and \"paste-on pieces above her eyes to [appear] Asian.\" To play the role, Hunt had her hair dyed and cut short, had her eyebrows shaved, wore padding and makeup, and wore something in her shirt pocket. In her 1986 interview with the Bomb magazine, Hunt remarked that Billy Kwan \"is supra-personal [with] layers of sexual ambiguity[.]\"\n\nHunt also played the Shadout Mapes in Dune (1984 film), a nurse in She-Devil (1989), the austere school principal Miss Schlowski opposite Arnold Schwarzenegger in Kindergarten Cop (1990), and assassin Ilsa Grunt in If Looks Could Kill (1991).\n\nTelevision\n\nHunt's television appearances include recurring roles as Judge Zoey Hiller on David E. Kelley's series The Practice and as Dr. Claire Bryson on Without a Trace. She has narrated several installments of The American Experience on PBS. Since 2009, she has co-starred as Operations Manager Henrietta \"Hetty\" Lange on the CBS show NCIS: Los Angeles. Her co-stars on that show have included Chris O'Donnell, LL Cool J, Daniela Ruah, Eric Christian Olsen, Miguel Ferrer and Barrett Foa. Hunt has won two Teen Choice Awards for her work on NCIS: Los Angeles.\n\nVoice work\n\nHunt is known for her husky voice. She has narrated numerous documentaries, cartoons, and commercials. She is the on-air host for City Arts & Lectures, a radio program recorded by KQED public radio at the Nourse Theater in San Francisco. Hunt voiced the role of Grandmother Willow in the animated musical film Pocahontas (1995) and its direct-to-video sequel Pocahontas II: Journey to a New World (1998).\n\nHunt narrated the National Geographic documentary The Great Indian Railway (1995). In 1998, she narrated the Discovery Channel documentary \"Titanic: Untold Stories.\" Hunt's voice work also includes the character of Management in Carnivàle (2003, 2005) and the narrator for God of War video game series. She narrated a PBS Nature special entitled Christmas in Yellowstone (2006).\n\nPersonal life\n\nHunt has been in a relationship with psychotherapist Karen Kline since 1978. The two were married in 2008.\n\nAs a teenager, Hunt was diagnosed as having hypopituitary dwarfism. Hunt stands 4 feet 9 inches (145 cm) tall.\n\nHunt is an ambassador for the Best Friends Animal Society.\n\nIn July 2018, People magazine reported that she was involved in a multicar accident in Los Angeles. The accident resulted in Hunt taking most of a year off from NCIS: Los Angeles.\n\nFilmography\n\nVideo games\n\nGod of War as Gaia/Narrator\n\nas Gaia/Narrator God of War II as Gaia/Narrator\n\nas Gaia/Narrator God of War: Chains of Olympus as Gaia/Narrator\n\nas Gaia/Narrator God of War III as Gaia/Narrator\n\nas Gaia/Narrator God of War: Ghost of Sparta as Gaia/Narrator\n\nas Gaia/Narrator God of War: Ascension as Gaia/Narrator\n\nTelevision credits\n\nTheatre\n\nSee also"}, {"url": "https://peoplepill.com/people/linda-hunt/", "page_content": "Lydia Susanna \"Linda\" Hunt (born April 2, 1945) is an American actress of stage and screen.\n\nShe made her film debut playing Mrs. Oxheart in Popeye (1980). Hunt portrayed the male character Billy Kwan in The Year of Living Dangerously (1982) for which she won the Academy Award for Best Supporting Actress, becoming the first person to win an Oscar for portraying a character of the opposite sex. Hunt has also appeared in films such as Dune (1984), Kindergarten Cop (1990), Pocahontas (1995), Pocahontas II: Journey to a New World (1998), and Stranger Than Fiction (2006).\n\nHunt has had a successful career on television and in voice-over work, notably being the narrator for the Greek-era God of War series. From 1997 to 2002, she played the recurring role of Judge Zoey Hiller on The Practice and played Commander Chennault on the sci-fi series Space Rangers. Beginning in 2009, she has portrayed Henrietta \"Hetty\" Lange on the CBS television series NCIS: Los Angeles, a role for which she has received two Teen Choice Awards.\n\nEarly life\n\nHunt was born on April 2, 1945, in Morristown, New Jersey. Her father, Raymond Davy Hunt (1902–1985), was vice president of Harper Fuel Oil. Her mother, Elsie Doying Hunt (1903 – c. 1994), was a piano teacher who taught at the Westport School of Music, and performed with the Saugatuck Congregational Church Choir in Westport, Connecticut, the town where Hunt would be raised. She has one sibling, an older sister named Marcia (born 1940). Hunt attended the Interlochen Arts Academy and graduated from the Goodman School of Drama at the Art Institute of Chicago (now at DePaul University).\n\nCareer\n\nTheatre\n\nHunt was a well-known live-stage actress before she entered film and television. She made her Broadway debut in a 1975 production of Ah, Wilderness. She was nominated for the Tony Award for Best Actress in a Play for her work in the 1984 play End of the World. She also received two ensemble Obie Awards for her work Off-Broadway in Top Girls and A Metamorphosis in Miniature.\n\nHunt created the role of Aunt Dan in Wallace Shawn's play Aunt Dan and Lemon. She was a member of the Long Wharf Theatre Company in Connecticut. There, she played the Player Queen in a production of Hamlet, among other roles. She portrayed Sister Aloysius in the Pasadena Playhouse production of John Patrick Shanley's play Doubt. Hunt was praised for her performance as the title character in Bertolt Brecht's Mother Courage and Her Children. Hunt also appeared as Pope Joan in Caryl Churchill's Top Girls when London's Royal Court Theatre's production was staged at the Public Theater in New York.\n\nIn an interview with writer Craig Gholson and actor Vincent Caristi, Hunt said: \"Acting onstage is like an explosion each night. And what comes in at you all the time as you are trying to . . . create something which is a tremendous act of organization and concentration.\"\n\nFilm\n\nKnown for her small stature, Hunt made her film debut in 1980 in Robert Altman's musical comedy Popeye.\n\nTwo years later, Hunt co-starred as Billy Kwan in The Year of Living Dangerously, Peter Weir's film adaptation of the novel of the same name. For her work in this film, Hunt won the Academy Award for Best Supporting Actress in 1983, becoming the first person to win an Oscar for playing a character of the opposite sex. In her screen test, Hunt wore a hairpiece, a fake moustache, and \"paste-on pieces above her eyes to [appear] Asian.\" To play the role, Hunt had her hair dyed and cut short, had her eyebrows shaved, wore padding and makeup, and wore something in her shirt pocket. In her 1986 interview with the Bomb magazine, Hunt remarked that Billy Kwan \"is supra-personal [with] layers of sexual ambiguity[.]\"\n\nHunt also played Shadout Mapes in Dune (1984 film), a nurse in She-Devil (1989), an austere school principal opposite Arnold Schwarzenegger in Kindergarten Cop (1990), and assassin Ilsa Grunt in If Looks Could Kill (1991).\n\nTelevision\n\nHunt's television appearances include recurring roles as Judge Zoey Hiller on David E. Kelley's series The Practice and as Dr. Claire Bryson on Without a Trace. She has narrated several installments of The American Experience on PBS. Since 2009, she has co-starred as Operations Manager Henrietta \"Hetty\" Lange on the CBS show NCIS: Los Angeles. Her co-stars on that show have included Chris O'Donnell, LL Cool J, Daniela Ruah, Eric Christian Olsen, Miguel Ferrer and Barrett Foa. Hunt has won two Teen Choice Awards for her work on NCIS: Los Angeles.\n\nVoice work\n\nHunt is known for her husky voice. She has narrated numerous documentaries, cartoons, and commercials. She is the on-air host for City Arts & Lectures, a radio program recorded by KQED public radio at the Nourse Theater in San Francisco. Hunt voiced the role of Grandmother Willow in the animated musical film Pocahontas (1995) and its direct-to-video sequel Pocahontas II: Journey to a New World (1998).\n\nHunt narrated the National Geographic documentary The Great Indian Railway (1995). In 1998, she narrated the Discovery Channel documentary \"Titanic: Untold Stories.\" Hunt's voice work also includes the character of Management in Carnivàle (2003, 2005) and the narrator for God of War video game series. She narrated a PBS Nature special entitled Christmas in Yellowstone (2009).\n\nPersonal life\n\nHunt has been in a relationship with psychotherapist Karen Kline since 1978. The two were married in 2008.\n\nAs a teenager, Hunt was diagnosed as having hypopituitary dwarfism. Hunt stands 4 feet 9 inches (145 cm) tall.\n\nHunt is an ambassador for the Best Friends Animal Society.\n\nIn July 2018, People magazine reported that she was involved in a multicar accident in Los Angeles. The accident resulted in Hunt taking most of a year off from NCIS: Los Angeles.\n\nFilmography\n\nYear Film Role Notes 1980 Popeye Mrs. Holly Oxheart 1982 The Year of Living Dangerously Billy Kwan Academy Award for Best Supporting Actress\n\nAustralian Film Institute Award for Best Actress in a Supporting Role\n\nBoston Society of Film Critics Award for Best Supporting Actress\n\nKansas City Film Critics Circle Award for Best Supporting Actress\n\nLos Angeles Film Critics Association Award for Best Supporting Actress\n\nNational Board of Review Award for Best Supporting Actress\n\nNew York Film Critics Circle Award for Best Supporting Actress\n\nNominated—Australian Film Institute Jury Prize\n\nNominated—Golden Globe Award for Best Supporting Actress – Motion Picture\n\nNominated—National Society of Film Critics Award for Best Supporting Actress 1984 Dune Shadout Mapes The Bostonians Dr. Charlotte Prance 1985 Eleni Katina Silverado Stella 1987 Waiting for the Moon Alice B. Toklas 1989 She-Devil Hooper 1990 Kindergarten Cop Miss Ingrid Schlowski Carmilla Narrator 1991 If Looks Could Kill Ilsa Grunt 1992 Rain Without Thunder Atwood Society Director 1993 Younger and Younger Frances Twenty Bucks Angeline 1994 Prêt-à-Porter Regina Krumm National Board of Review Award for Best Acting Ensemble 1995 Pocahontas Grandmother Willow Voice 1997 The Relic Dr. Ann Cuthbert Amazon Narrator Voice Eat Your Heart Out Kathryn 1998 Pocahontas II: Journey to a New World Grandmother Willow Voice 2002 Dragonfly Sister Madeline 2005 Auschwitz: The Nazis and the 'Final Solution' Narrator Voice Yours, Mine and Ours Mrs. Edna Munion The Great Transatlantic Cable Narrator 2006 Stranger Than Fiction Dr. Jill Mittag-Leffler 2007 The Singing Revolution Narrator 2017 The Relationtrip Dr. Lipschweiss 2018 Solo: A Star Wars Story Lady Proxima Voice\n\nVideo games\n\nGod of War as Narrator\n\nas Narrator God of War II as Gaia/Narrator\n\nas Gaia/Narrator God of War: Chains of Olympus as Narrator\n\nas Narrator God of War III as Narrator\n\nas Narrator God of War: Ghost of Sparta as Narrator\n\nas Narrator God of War: Ascension as Narrator\n\nTelevision credits\n\nYear Title Role Notes 1976 Great Performances Nora 1 episode 1978 Fame Mona 1987 American Playhouse Alice B Toklas 1 episode Basements Rose Hudd Segment: \"The Room\"—director: Robert Altman The Room Upstairs Mrs. Felicia Sanders TV movie 1993 Space Rangers Commander Chenault 1997–2002 The Practice Judge Zoey Hiller 24 episodes 1998–2006 The American Experience Narrator 2003 Before We Ruled the Earth Narrator 2003–2005 Carnivàle Management—voice 9 episodes 2006 Nature Narrator Episode: \"Christmas in Yellowstone\" 2007 The Unit Dr. Eudora Hobbs 2 episodes 2008 Without a Trace Dr. Claire Bryson 3 episodes 2009–present NCIS: Los Angeles Henrietta \"Hetty\" Lange Starring role 2011, 2012 Teen Choice Awards Herself Teen Choice Award for Choice TV Actress Action 2014 Scorpion Henrietta \"Hetty\" Lange Episode: \"True Colors\"\n\nTheatre"}], "Linda Hunt won the Academy Award for Best Supporting Actress for her performance as Billy Kwan, a male Chinese-Australian photographer, in The Year of Living Dangerously (1982).": [{"url": "https://www.theguardian.com/film/2015/jan/09/the-year-of-living-dangerously-rewatched-linda-hunt-unforgettable", "page_content": "Australian cinema in 2014 delivered not one but two great performances from female actors playing women who become men.\n\nIn the Spierig brothers’ madcap time travel movie Predestination, Sarah Snook turned heads in a role that not only saw her play both genders but also offered a wild and saucy take on what might happen if a person bumped into a version of themselves from the future. Del Herbert-Jane struck a more melancholic note in director Sophie Hyde’s drama 52 Tuesdays, which focused on a daughter’s reaction to her mother’s journey to becoming a trans man.\n\nBut Peter Weir’s 1982 film The Year of Living Dangerously, adapted by the director himself and playwright David Williamson from Christopher Koch’s bestselling novel, takes the cake for the most startling gender-realigning performance in Australian cinema.\n\nAmerican actor Linda Hunt played Chinese-Australian dwarf Billy Kwan, a photographer who teams up with newbie foreign correspondent Guy Hamilton (Mel Gibson) when he moves to Jakarta. Billy shows him the ropes in a city where simmering danger (the film is set in the mid 1960s, during the overthrow of President Sukarno) is about to boil over into violence and revolution.\n\nHunt’s performance isn’t startling because of a body-related character arc. There is no physical transformation for Billy, who has always been a man. It’s startling because Hunt’s performance is so good you never pause to doubt it.\n\nWhat a bold (yet strangely sensible) turn of casting: Hunt, a woman, hired to play Billy, a man, because she was simply the best fit for the part. Hunt stole the hearts and minds of audiences and wooed the Academy, who awarded her an Oscar for best supporting actress.\n\nBilly is stubborn and headstrong but needy in uncomfortable ways that the film gradually reveals. He shares similarities with acidic protagonist Barbara Covette (Judi Dench) from director Richard Eyre’s Notes on a Scandal, a loquacious narrator loyal to the point of being unnervingly possessive. Hunt channels the demeanour of someone constantly trying to make sense of the environment around them, propelled to pick it apart bit by bit: a world of big things and grand purposes, overpowering and impenetrable.\n\nThere is a scene in which Billy looks up at a huge billboard-sized picture of Suharto and stands in awe, as if wowed by the might of it. Hunt’s performance seems to exist in that moment: a constant struggle to come to terms with forces outside the control of Billy, a proud, cunning little man forced into humility.\n\nThe Year of Living Dangerously charts his journey and those of several others with a sensibility both subtle (utterly restrained, given the subject and setting) and unforgettable (the film’s images, particularly Billy’s final scene and Guy’s trip to the airport in the last act, will stay with you).\n\nIt opens with Billy banging away on his typewriter, writing to Guy. Moments like this form a voiceover that give the film a colourful, literary ooze, as if partly written by Billy himself. The commentary functions like film noir narration (recalling the framing of 1944 classic Double Indemnity – the confession of a crooked insurance salesman to his boss), only more florid and a little less spiffy.\n\n“Most of us become children again when we enter the slums of Asia,” Billy writes. “Last night I watched you walk back into childhood, with all its opposite intensities. Laughter and misery, the crazy and the grim. Toy town and a city of fear.”\n\nAs bold but strait-laced Hamilton – a fish out of water rising to a challenge and slowly growing frazzled and stressed – Mel Gibson cuts a solid presence in the Tom Cruise ilk of a leading man. The film’s emotions either bounce off or project on to him, without the actor needing to do much. Sigourney Weaver plays his lover, and while the film’s poster depicts their embrace, it’s most memorable for other things – its mood, its sense of location and Hunt’s tour de force performance.\n\nThe Year of Living Dangerously was the first Australian film to be financed by an American studio (MGM). While indisputably there is plenty Australian about it (including key characters and cast, the crew, filming locations, government-granted tax incentives and financing for development and marketing), the producers’ unprecedented wheeling and dealing with Hollywood ultimately led to an existential question for the local industry: what does the term “Australian film” even mean?\n\nThat question hit a high water mark (or a moment of absurdity) in January 2014 when a blockbuster studio movie, The Great Gatsby, won 13 Australian Academy of Cinema and Television Arts awards. It was not only financed by Warner Bros and led by A-list Hollywood celebrities, but based on a book widely regarded as one of the greatest and most quintessentially American novels.\n\nThe Year of Living Dangerously was a stepping stone to Hollywood for Weir, whose body of work includes Picnic at Hanging Rock and The Last Wave. It was on the set of his first world war film Gallipoli that he proposed the character of Guy Hamilton to Gibson. The director, one of our very greatest, has made fine work since (including 1989’s Dead Poet’s Society and 1998’s The Truman Show) but never returned to Australian stories."}, {"url": "https://english.elpais.com/usa/2022-01-31/when-the-oscars-rewarded-an-american-actress-for-portraying-a-chinese-australian-man.html", "page_content": "Linda Hunt with the Oscar for Best Supporting Actress in 1983. Bettmann (Bettmann Archive)\n\nJavier Bardem is at the center of the latest Hollywood controversy due to the inappropriateness – in the eyes of some at least – of the Spanish actor portraying a Cuban character, Desi Arnaz, in Being the Ricardos, the story of American comedian Lucille Ball and her husband and co-star on the sitcom I Love Lucy. In an interview with The Hollywood Reporter, Bardem played down the issue: “I’m an actor, and that’s what I do for a living: try to be people that I’m not,” said the Oscar winner. Bardem also alluded to the problem being based on “accents” – that there tends not to be any furore over English-speakers giving a foreign tongue a go. “Where is that conversation with English-speaking people doing things like The Last Duel, where they were supposed to be French people in the Middle Ages?” he wondered.\n\nIn the interview, Bardem joked about the prevailing debate on representation and casting: “We should all start not allowing anybody to play Hamlet unless they were born in Denmark.” The issue tends to surface most around the awards season – the issue of diversity has more or less finished off the Golden Globes – and the decision by director Guy Nattiv to cast English actress Helen Mirren as former Israeli prime minister Golda Meir has recently been making headlines. Jewish actress Maureen Lipman criticized Mirren’s involvement in the movie Golda a few weeks ago, stating that the “the Jewishness of the character is so integral.”\n\n“My opinion, and that’s what it is, a mere opinion, is that if the character’s race, creed or gender drives or defines the portrayal then the correct – for want of an umbrella [term] – ethnicity should be a priority,” The Pianist actor told Variety.\n\nThe days when a director had the option to skirt the industry’s norms and cast an actor not only against race or creed, but gender, seem long distant but that is exactly what Peter Weir did in 1982 when the man behind the camera on Dead Poets Society (1989) and The Truman Show (1998) was casting The Year of Living Dangerously, a romantic tale set against the backdrop of the overthrow of President Sukarno in Indonesia.\n\nHelen Mirren at the Telluride Film Festival Vivien Killilea (Getty Images)\n\nMel Gibson and Sigourney Weaver were on board, but Weir had difficulty finding an actor capable of playing the role of photographer Billy Kwan, a charismatic character who would serve as the moral compass of the movie. Weir had settled on Australian dancer David Atkins, but a clash of personalities with Gibson led him to leave the production after filming had begun. That was when a member of the casting department suggested Linda Hunt.\n\n“The sets were being built in Manila and time was of the essence,” Weir said in an interview with The New York Times in 2019. “The casting agent said he had a possible Billy Kwan called L. Hunt. Later it was revealed she was a woman. We were desperate, we gave her a shot and it was brilliant.” Hunt, who had enjoyed a solid career in theater to that point but was far from a household name, was more surprised than anyone by the decision. “I didn’t quite understand what I was there for; I talked to the casting director about it and he just said, ‘This would be a part that you would play as a man,’” the NCIS: Los Angeles star told The Daily Beast. “I said, ‘Holy shit,’ and laughed.”\n\nHunt attempted to change Weir’s mind but without success. “Can you rewrite it for a woman?” the director recalls the actor asking. “I said this would change the entire story and there was a silence,” he recalled. “‘Could you play a man?’ I asked her and there was a longer silence. ‘Only if you believe in me,’ she replied.”\n\nWhen Hunt went for the first screen test they put her in a wig, a mustache and placed pieces of rubber over her eyes to give her a more oriental appearance. She looked in the mirror and said to herself: “Let’s take all this shit off and let me do it.”\n\nI didn’t try to pass myself off as a man; the movie wasn’t about that Actress Linda Hunt\n\n“I didn’t try to pass myself off as a man; the movie wasn’t about that,” Hunt told the New Straits Times in 2016. But she had to make the audience believe that she was a man. To achieve this, she cut her hair short and dyed it, and shaved her eyebrows. The result was so convincing that waiters would call her “sir” even when she was wearing a dress.\n\nHunt, who despite playing a Chinese-Australian in The Year of Living Dangerously, is white and was born in New Jersey in 1945, was diagnosed with hypopituitary dwarfism as a teenager, which made her adolescent life difficult. “When I was growing up, particularly during puberty in my teen years, I was so miserable because I elicited so much teasing and meanness from my teenage cohorts,” she told The Daily Beast. She first felt the call of acting in a production of Peter Pan – a role traditionally played by women in the theater – but due to the reaction among the producers to her physical appearance, she decided to concentrate on directing. “Until I got to New York and saw the stupidity of that idea. If it’s hard to get into acting, what is it like for a woman to become a director?”\n\nThe Year of Living Dangerously was Hunt’s first major movie role following her debut in Robert Altman’s Popeye, which was roundly panned by critics. As such, in 1982, Hunt’s extraordinary talent was a secret beyond the theaters of Broadway. After the movie was released, it would never be a secret again. Spectators stayed in theaters for the credits to roll to find out who the actor playing Billy Kwan was and were surprised when it was revealed to be a woman. “Linda Hunt, a New York stage actress who enters the role so fully that it never occurs to us that she is not a man. This is what great acting is, a magical transformation of one person into another,” wrote movie critic Roger Ebert in the Chicago Sun Times: words that echo Bardem’s in The Hollywood Reporter. Her portrayal of Billy Kwan even won her the Academy Award for Best Supporting Actress in 1983.\n\nHunt’s performance as Kwan is not one of cinema’s greatest whitewashing moments – see John Wayne as Genghis Khan in The Conqueror or Mickey Rooney playing Mr Yunioshi in Breakfast at Tiffany’s – but in 2018 there was a considerable backlash when an image of Hunt in The Year of Living Dangerously was shown at the Oscars during a montage of past winners. Critics said her inclusion detracted from what was an important year for minority representation, explained Teen Vogue.\n\nDespite the controversy, a few months after the gala Weir told The New York Times that he did not regret the decision to cast Hunt. “Casting is fundamental and it should not be influenced by any trends.” Tell that to the Golden Globes."}, {"url": "https://www.independent.co.uk/arts-entertainment/films/features/oscars-academy-awards-linda-hunt-year-of-living-dangerously-a8781306.html", "page_content": "Get our free weekly email for all the latest cinematic news from our film critic Clarisse Loughrey Get our The Life Cinematic email for free Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nThe Life Cinematic email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\n\nToday, the casting would be the subject of blog posts, tweet storms and op-eds. But 35 years ago, when Peter Weir embraced the spirit of the title The Year of Living Dangerously and hired an American woman to play a Chinese-Australian man in that political drama, his gamble paid off: Linda Hunt became the only person to win an Academy Award for playing a cisgender character of the opposite sex.\n\nIt wasn’t an easy decision. The filmmaker had asked a fellow Australian David Atkins to take the role of dwarf Billy Kwan in the drama about expats in Indonesia during the 1965 coup attempt. But Atkins didn’t click with the movie’s star, Mel Gibson, during rehearsals. “Sets were being constructed in Manila, and the clock was ticking,” Weir recalled in a recent email. “The casting agent said he had a possible Billy Kwan called L Hunt. He then revealed he was a she. We were desperate and gave her a try, and she was great.”\n\nBut Hunt, a stage actor whose sole film credit was a part in Robert Altman’s Popeye, wasn’t sure she could pull off the role of a male photographer who facilitates a romance between an Australian journalist (Gibson) and a British diplomat (Sigourney Weaver). “She said, ‘Could you rewrite it for a woman?’” Weir remembered. “I said it would change the whole story. Silence. ‘Could you play a man?’ Now a really long silence. ‘Only if you believe in me,’ she said. So we took the plunge.”\n\nDuring the early stages of production, Hunt still doubted herself. “I thought, oh my God, I’m going to have to go somewhere when this film opens, just away, as far as I could get,” she told The Daily Beast in 2011. She said she thought her performance “was so awful. It got better and better as we went on”. Hunt declined to be interviewed for this article.\n\nLinda Hunt in ‘The Year of Living Dangerously’ in 1983 (Rex)\n\nCritics agreed after The Year of Living Dangerously opened in January 1983. “This is what great acting is,” Roger Ebert wrote in The Chicago Sun-Times. “A magical transformation of one person into another.” The New York Times’ Vincent Canby said the crossgender casting “works to the film’s advantage. It’s Billy’s fate to play God, and gods are, if not androgynous, then not necessarily condemned to a single sexual identity.”\n\nA year later, Hunt won Best Supporting Actress from critics’ associations in New York and Los Angeles. Her Oscar nomination pitted her against another woman with little big-screen experience – Cher in Silkwood – as well as Amy Irving (Yentl), Alfre Woodard (Cross Creek) and Glenn Close (The Big Chill). It would be the second of six losses for Close, who received her seventh nomination last month, for Best Actress for The Wife.\n\nAfter Hunt’s name was announced, she told the academy members: “There was an Indonesian phrase in the film, which translates into English as ‘water from the moon’, and it means that which is unattainable, the impossible, that which one can never have or know. Making The Year of Living Dangerously for me was water from the moon.”\n\nThe actors who’ve won the most Oscars Show all 44 1 / 44 The actors who’ve won the most Oscars The actors who’ve won the most Oscars Anthony Hopkins.jpg Anthony Hopkins picked up his second Oscar for ‘The Father’, beating the late Chadwick Boseman in a shock victory in 2021. Hopkins, who was unable to attend the ceremony in person, had previously won for his chilling portrayal of serial killer Hannibal Lector in Jonathan Demme’s ‘The Silence of the Lambs' Getty Images for Netflix The actors who’ve won the most Oscars Renee Zellweger Renée Zellweger won her second Oscar for portraying Judy Garland in 2019’s Judy. The actor had previously won a Best Supporting Actress award for her role in Cold Mountain, back in 2004. Getty Images The actors who’ve won the most Oscars Mahershala Ali Mahershala Ali became the first Muslim actor to win an Oscar after taking home best Supporting Actor his Barry Jenkins' Moonlight. Two years later, he'd win the same trophy for eventual Best Picture winner, Green Book. AMPAS/Getty The actors who’ve won the most Oscars Christoph Waltz It was the Austrian-born actor’s long-running collaboration with controversial filmmaker Quentin Tarantino that brought him to the mainstream public consciousness. In Inglourious Basterds, Waltz plays terrifying Nazi colonel Hans Landa, while in Django Unchained, he seems a world apart playing benevolent dentist-cum-bounty hunter Dr. King Schultz. Both roles were rewarded with Oscars for Best Supporting Actor. AFP/Getty The actors who’ve won the most Oscars Kevin Spacey Spacey won two Oscars, for The Usual Suspects in 1996 and American Beauty in 2000. After numerous allegations of sexual assault emerged in 2017, the actor was removed from the Ridley Scott film All the Money in the World, and Christopher Plummer was given a Best Supporting Actor nomination after reshooting Spacey’s scenes in his stead. AFP/Getty The actors who’ve won the most Oscars Hilary Swank Swank won two awards for Best Actress, for Boys Don’t Cry and Million Dollar Baby. Accepting the award for the former, Swank neglected to thank her then-husband, Chad Lowe. Girls star Lena Dunham would later thank Lowe when she received a Golden Globe in 2013, tweeting that she did it “because Hilary Swank forgot.” Getty The actors who’ve won the most Oscars Vivien Leigh Leigh’s performances as Scarlett O’Hara in Gone with the Wind in 1939 and as Blanche DuBois in the Tennessee Willimas adaptation A Streetcar Named Desire in 1951 stand as two of the most iconic in film history. The actress was fittingly rewarded for the roles, taking home a Best Actress trophy each time. Getty The actors who’ve won the most Oscars Dianne Wiest Wiest appeared in five films by writer-director Woody Allen, winning Best Supporting Actress awards for her roles in Hannah and Her Sisters and Bullets Over Broadway. She is currently a regular on the CBS sit-com Life in Pieces. AFP/Getty The actors who’ve won the most Oscars Peter Ustinov Ustinov was a highly acclaimed performer – with two Academy Awards to his name, for Spartacus and Topkapi – but was in no way limited to acting. Ustinov held a panoply of other occupations, including as a writer, a dramatist, a filmmaker, a director of theatre and opera, a humorist, a newspaper columnist, a radio broadcaster and a TV presenter. Getty The actors who’ve won the most Oscars Jason Robards The son of a stage and silent film actor who was a victim of Hollywood’s transition to sound, Jason Robards was blessed with more success in the industry, eventually winning two Academy Awards. The actor appeared in numerous stage and screen adaptations of Eugene O’Neill plays, but it was his work in All the President’s Men that bagged him his first Best Supporting Actor statuette, doubling his tally the next year, in 1977, with Julia. AFP/Getty The actors who’ve won the most Oscars Melvyn Douglas Douglas won two Oscars, for Hud (1963) and for acting alongside a revelatory Peter Sellers in Being There (1969). The actor was known for being an outspoken anti-fascist ever since visiting Europe in 1931 with his wife, Helen Gahagan, who served three terms as a US Congresswoman, running against Richard Nixon for Governor in 1950. Getty The actors who’ve won the most Oscars Shelley Winters Over the course of her 63-year career, Winters appeared in successful blockbusters such as The Poseidon Adventure. But it was her more nuanced supporting roles in 1960’s The Diary of Anne Frank and 1965’s A Patch of Blue that would win over Academy voters, for which she collected two awards in the category. Getty The actors who’ve won the most Oscars Anthony Quinn Quinn is something of an anomaly in the ranks of multiple Oscar-winners. The actor was born in Chihuahua, Mexico, in 1915, to a Mexican mother and an Irish father, and is one of one only five actors with a Latin-American background to win an acting Oscar – the others being Rita Moreno, José Ferrer, Mercedes Ruehl, and Benicio del Toro – and the only one to win twice. Roma nominees Yalitza Aparicio and Marina de Tavira are in contention this year. AFP/Getty The actors who’ve won the most Oscars Glenda Jackson Jackson was one of the most accomplished actors of her generation, with two Best Actress wins under her belt by the age of 37 (for Women in Love and A Touch of Class). But starting in 1992, she took a 23-year sabbatical from the industry, serving as the Labour MP for Hampstead and Kilburn. Getty The actors who’ve won the most Oscars Maggie Smith Long before she was captivating younger audiences with her roles in the Harry Potter franchise and popular TV series Downton Abbey, Dame Maggie Smith had wowed Oscar voters with The Prime of Miss Jean Brody (1969), adding a Best Supporting Actress win for California Suite in 1978. Getty Images The actors who’ve won the most Oscars Bette Davis Davis won her only two Best Actress Oscars in 1935 and 1938 – for Dangerous and Jezebel respectively –but over the course of her hugely successful six-decade career, she would continue to accrue more nominations, eventually becoming the first actor to reach a milestone of 10. Getty Images The actors who’ve won the most Oscars Fredric March Along with Helen Hayes, March is one of only two actors to win two Oscars and two Tony Awards. The multi-talented star won Best Actor for the bifurcated titular role in 1931’s horror adaptation Dr. Jekyll and Mr. Hyde, winning again in 1946 for The Best Years of Our Lives, a post-WWII drama about soldiers returning home from the war. Getty The actors who’ve won the most Oscars Sally Field Field’s Oscar win for Places in the Heart in 1985 has been immortalised by her acceptance speech – which included the infamous lines “you like me, right now, you really like me” - but the actor had already proven she was more than just a soundbite having won the same trophy for her star turn in Norma Rae five years earlier. AFP/Getty The actors who’ve won the most Oscars Elizabeth Taylor Taylor gained 30 pounds for the 1966 black comedy Who’s Afraid of Virginia Woolf?, a film which sees her trapped in a poisonous marriage with a character played by her off-and-on real-life paramour Richard Burton. The star had previously nabbed a Best Actress award for her portrayal of a sex worker in BUtterfield 8, a film she claimed to dislike. Getty The actors who’ve won the most Oscars Sean Penn After scooping up the Best Actor prize in 2003 for Mystic River, Penn won another for portraying iconic LGBT campaigner and US politician Harvey Milk, who was assassinated in 1978. Penn opened his victory speech with “Thank you. Thank you. You commie, homo-loving sons-of-guns!” Getty The actors who’ve won the most Oscars Frances McDormand Fargo Oscar-winner McDormand delivered a rousing address at the 2018 Oscar ceremony, demanding an end to Hollywood’s gender imbalance. The speech, made while accepting her second Best Actress prize - for Three Billboards Outside Ebbing, Missouri - brought all the women in the audience to their feet in solidarity. She ended her speech with the phrase “inclusion rider,” a stipulation that can be put into a performer’s contract to ensure equal opportunity hiring on set. McDormand subsequently won again in 2021 for her leading turn in ‘Nomadland’ Getty The actors who’ve won the most Oscars Gene Hackman Hackman won his first Oscar playing “Popeye” Doyle in William Friedkin’s The French Connection – a taboo-busting cop thriller that was hardly the stuff of Academy tradition. 19 years later, his supporting turn as the villain in Clint Eastwood’s revisionist Western Unforgiven made it a double. Getty The actors who’ve won the most Oscars Tom Hanks Hanks made his name in romantic comedies with some successes in the 1980s, but his first Oscar win – for AIDS drama Philadelphia - was a big departure. The next year, in 1995, he won again, for the hugely popular Forrest Gump. AFP/Getty Images The actors who’ve won the most Oscars Olivia de Havilland Dame Olivia de Havilland, now 102 years old, is perhaps best known for her role in Gone with the Wind. Garnering five nominations across her career, de Havilland took home two statuettes in the 1940s, for To Each His Own and The Heiress. Getty Images The actors who’ve won the most Oscars Jodie Foster Next to Luise Rainer, Jodie Foster is the only other actor to have won two Oscars before the age of 30, for The Accused in 1988, and Silence of the Lambs in 1991. It’s a fitting record for an actor whose career took off while she was still a child, with breakout roles in Bugsy Malone and Taxi Driver. AFP/Getty The actors who’ve won the most Oscars Michael Caine Sir Michael Caine, familiar around the globe for his distinctive cockney accent, once confessed that 1983’s Educating Rita was “the last good picture I made before I mentally retired.” In spite of this, the actor managed to win Oscars for Hannah and Her Sisters in 1986 and The Cider House Rules in 1999. Getty The actors who’ve won the most Oscars Gary Cooper Cooper won his first Best Actor Oscar in 1942 for Sergeant York. The famously stoic star didn’t turn up to collect his second award – for an understated turn in the classic Western High Noon – instead sending John Wayne, who said: \"Coop and I have been friends, hunting and fishing, for more years than I like to remember. He's one of the nicest fellows I know. I don't know anybody any nicer.” Getty The actors who’ve won the most Oscars Jessica Lange In 1982, Jessica Lange became the first star in nearly four decades to be nominated for two films in the same year, for Tootsie and Frances, the former of which yielded a win. Lange is currently tied as the sixth most nominated Actress in history. AFP/Getty Images The actors who’ve won the most Oscars Dustin Hoffman Initially winning at the same time as co-star Meryl Streep for Kramer Vs Kramer, Hoffman’s second Best Actor Oscar came for Rain Man in 1988, in a role which has been recognised as important in raising awareness of autism. Getty Images The actors who’ve won the most Oscars Jane Fonda The poster girl for the flower child generation, Jane Fonda was always expected to politicise the Oscars. After an unexpectedly reserved acceptance speech for Klute in 1972, she presented part of her 1979 speech – for Coming Home – in sign language. AFP/Getty Images The actors who’ve won the most Oscars Robert De Niro Following a supporting turn in 1974’s The Godfather Part II, Robert De Niro’s second Oscar-winning role, playing boxer Jake LaMotta in Raging Bull, is about as hard-earned as they come. The actor honed his boxing ability to professional standards, and gained approximately 60 pounds to play an older, washed-up version of the character. Getty Images The actors who’ve won the most Oscars Cate Blanchet The Aviator is often dismissed as a minor Martin Scorsese film, but the Howard Hawks biopic won Blanchett her first Oscar in 2004. She would have to wait until Blue Jasmine seven years later - her sixth nominated performance, out of seven total - to win in the Best Actress category. Getty Images The actors who’ve won the most Oscars Jack Lemmon Lemmon was legendary for his mastery of both comedy and pathos, and it was chiefly his humorous chops that saw him win Best Supporting Actor in 1955, for his role in Mister Roberts. With a follow-up win for Save the Tiger, the Some Like it Hot star became the first actor to claim Oscar wins in both the lead and supporting categories. Getty The actors who’ve won the most Oscars Marlon Brando Eight-time Oscar nominee Brando influenced a generation of actors with his revolutionary approaches to method, winning Hollywood’s biggest prize twice in the process - for On the Waterfront (1954) and The Godfather (1974). Brando famously sent Native American actress Sacheen Littlefeather to accept his second award in protest of the industry’s representation of Native Americans. Littlefeather later revealed the protest caused her to be blacklisted by many studios. Getty The actors who’ve won the most Oscars Spencer Tracy Spencer Tracy won two Oscars from nine nominations for Best Actor. He holds the joint record for the most nominations in the category, along with Laurence Olivier, who won only once. Getty Images The actors who’ve won the most Oscars Luise Rainer Rainer has been described as the first victim of the so-called “Oscar curse”. The Austrian-American star won Best Actress twice in quick succession – for The Great Ziegfeld in 1936 and for The Good Earth in 1937 – which resulted in MGM studios eagerly miscasting her in a series of flops. This would lead to a 54-year break from cinema, before returning alongside Michael Gambon in 1997’s The Gambler. Getty The actors who’ve won the most Oscars Helen Hayes Helen Hayes holds the record for being the actor with the longest gap between two Oscar victories. A practiced stage actress, Hayes also appeared in a few silent films before making her debut ‘talkie’ The Sin of Madelon Claudet, for which she won Best Actress. Hayes’s next and final win would be for a supporting role in Airport, nearly 40 years later. Getty The actors who’ve won the most Oscars Denzel Washington Denzel Washington is the only black actor to win multiple competitive Academy Awards, for Glory in 1990 – a Best Supporting Actor award - and then Training Day in 2002. No African-American actor has won more than one award since, although Mahershala Ali could match his total should he win for Green Book. Getty Images The actors who’ve won the most Oscars Walter Brennan Brennan had originally started work as an extra after losing most of his money in the 1925 real estate slump, appearing (often uncredited) in over 120 films across the next decade. He would then win three Best Supporting Actor Oscars in the space of four years, for Come and Get It (1936), Kentucky (1938) and The Westerner (1940). Rex The actors who’ve won the most Oscars Jack Nicholson Nicholson became regarded as one of the voices of his generation at the start of the 1970s with iconic roles in Easy Rider and Five Easy Pieces, but it took six nominations for him to win his first Oscar, for the Miloš Forman-directed One Flew Over the Cuckoo’s Nest in 1976. He would later win two more, one for Terms of Endearment and the other for As Good as It Gets. Getty Images The actors who’ve won the most Oscars Ingrid Bergman Ingrid Bergman, the Swedish star who successfully crossed over to Hollywood in 1939, won three Oscars during her career, beginning with Gaslight in 1944. An extra-marital affair with director Roberto Rossellini in the early 1950s scandalised her American audience, but the success of Anastasia in 1956 brought her back into the bosom of the public favour and she won a second Best Actress trophy. She added a Supporting Actress honour in 1974 for Murder on the Orient Express, one of her last film projects. Getty Images The actors who’ve won the most Oscars Daniel Day-Lewis Sir Daniel Day-Lewis is the only male actor to win three Best Actor awards, for his roles in My Left Foot, There Will Be Blood and Lincoln. After writing himself into the annals of film history with his 2012 win for portraying the American president, Day-Lewis took a step back from the industry, appearing in only one film since – Paul Thomas Anderson’s Phantom Thread - which he has claimed is his final role. Getty Images The actors who’ve won the most Oscars Meryl Streep For Meryl Streep, Oscar nominations are nearly as regular as dental appointments. Streep’s name has appeared on the ballot a total of 21 times, 17 of which were in the Best Actress category, and she has won three times: for Kramer vs Kramer in 1980, Sophie’s Choice in 1983, and The Iron Lady in 2012. Getty Images The actors who’ve won the most Oscars Katharine Hepburn Katharine Hepburn boasts more Oscar victories – four – than any other actor, all in the Actress in a Leading Role category. Hepburn’s The Lion in Winter trophy was shared with Barbra Streisand in the only ever instance of a tied Best Actress result. Hepburn never attended any of the ceremonies. Getty\n\nHunt thanked her parents, who were in the audience. At 4ft 9in, Hunt seemed unlikely to succeed as an actor, and her father, an oil company president, had urged her to study teaching. (Her mother was a piano teacher.)\n\n“He lived though the Academy Awards and died about 18 months later of a stroke,” Hunt said in 2011. “It now means a great deal that he got to be there. My father was so relieved when I won that award. He was like, ‘You know what? I guess she’s right. She’s going to be OK.’”\n\nAccess unlimited streaming of movies and TV shows with Amazon Prime Video Sign up now for a 30-day free trial Sign up\n\nThat she has been. Hunt has gone on to play memorable parts in Silverado, Stranger Than Fiction and other movies, and has co-starred on NCIS: Los Angeles since 2009.\n\nNontraditional gender roles have attracted the attention of Oscar voters over the years, with Jack Lemmon earning a Best Actor nomination for the cross-dressing comedy Some Like It Hot and William Hurt taking home the same award for his gay prisoner who identifies as a woman in Kiss of the Spider Woman. More recently, playing transgender characters has won Oscars for Hilary Swank in Boys Don’t Cry and Jared Leto in Dallas Buyers Club. Cate Blanchett received a nomination for her turn as Bob Dylan in I’m Not There, but Hunt’s win remains the only time the academy has honored a woman for playing a cisgender man.\n\nIn the wake of the whitewashing charges that have been levelled against the casting of white actors like Emma Stone (Aloha) as characters of Asian heritage, Hunt might prove an even more controversial choice today as the half-Asian Kwan. (Advocates for little people might also object.) But Weir indicated he would do it again: “Casting is critical and should not be influenced by any fashionable trends.”\n\nHunt’s work remains audacious more than three decades later. In a recent phone interview, Pete Hammond, a film critic and awards columnist for Deadline, called it “a dominating performance. She totally immersed herself in that character. It was impossible to ignore.”\n\nThe academy didn’t, and Weir could not have been more pleased. “I was thrilled to see her win the award for this extraordinary gamble,” he said. “So well deserved.”\n\n© New York Times"}, {"url": "https://www.weareresonate.com/2018/03/oscars-slammed-including-linda-hunts-billy-kwan-yellowface-montage/", "page_content": "Hunt won an Oscar for portraying a half-Asian male photographer in The Year of Living Dangerously\n\nFootage of Linda Hunt as Billy Kwan from The Year of Living Dangerously was included in a montage presented at the Oscars, resulting in backlash.\n\nDuring the 2018 Oscars, a montage sequencing showcasing past Best Supporting Actress winners, Linda Hunt was featured for her role in 1983’s The Year of Living Dangerously.\n\nIn the film, Hunt played a half-Asian male photographer by the name of Billy Kwan. Hunt’s performance was awarded the Academy Award for Best Supporting Actress later that year.\n\nHunt’s portrayal of Billy Kwan is now largely regarded as ‘yellowface’ for recreating Asian features through makeup.\n\nMany were quick to pick up this year’s Oscars montage that featured Hunt as Billy Kwan.\n\n“That was Linda Hunt in yellowface as ‘Billy Kwan’ during that Best Supporting Actress montage but sure let’s pretend like it’s worth casual inclusion,” Vulture writer E. Alex Jung tweeted.\n\n“#Oscars all about inclusivity and diversity this year, but still includes a clip of Linda Hunt as Billy Kwan,” wrote another Twitter user.\n\n“Third #Oscars montage for Best Supporting Actress had a great lineup of women until I saw Linda Hunt playing Yellow face and she won an Oscar for it,” said another.\n\nWow we are really showing that clip of Linda Hunt from The Year of Living Dangerously? Sounds good, everybody! #oscars — Stephen Sajdak (@stephensajdak) March 5, 2018\n\n#Oscars all about inclusivity and diversity this year, but still includes a clip of Linda Hunt as Billy Kwan. — Asian Americanist (@americanist) March 5, 2018\n\nbtw that was Linda Hunt in yellowface as “Billy Kwan” during that Best Supporting Actress montage but sure let’s just pretend like it’s worth casual inclusion — E. Alex Jung (@e_alexjung) March 5, 2018\n\nThe Academy is so clueless that on a night talking about inclusion they still showed clips of Linda Hunt as Billy Kwan and RDJ in ironic blackface for Tropic Thunder — Kevin J. Harrington (@KJHcomedy) March 5, 2018"}, {"url": "https://www.nytimes.com/2019/02/01/movies/linda-hunt-oscars.html", "page_content": "Today, the casting would be the subject of blog posts, tweet storms and op-eds. But 35 years ago, when Peter Weir embraced the spirit of the title “The Year of Living Dangerously” and hired an American woman to play a Chinese-Australian man in that political drama, his gamble paid off: Linda Hunt became the only person to win an Academy Award for playing a cisgender character of the opposite sex.\n\nIt wasn’t an easy decision. The filmmaker had asked a fellow Australian, David Atkins, to take the role of the dwarf Billy Kwan in the drama about expats in Indonesia during the 1965 coup attempt. But Atkins didn’t click with the movie’s star, Mel Gibson, during rehearsals. “Sets were being constructed in Manila, and the clock was ticking,” Weir recalled in a recent email. “The casting agent said he had a possible Billy Kwan called L. Hunt. He then revealed he was a she. We were desperate and gave her a try, and she was great.”\n\nBut Hunt, a stage actress whose sole film credit was a part in Robert Altman’s “Popeye,” wasn’t sure she could pull off the role of a male photographer who facilitates a romance between an Australian journalist (Gibson) and a British diplomat (Sigourney Weaver). “She said, ‘Could you rewrite it for a woman?’” Weir remembered. “I said it would change the whole story. Silence. ‘Could you play a man?’ Now a really long silence. ‘Only if you believe in me,’ she said. So we took the plunge.”\n\nDuring the early stages of production, Hunt still doubted herself. “I thought, oh my God, I’m going to have to go somewhere when this film opens, just away, as far as I could get,” she told The Daily Beast in 2011. She said she thought her performance “was so awful. It got better and better as we went on.” Hunt declined to be interviewed for this article."}, {"url": "https://www.britannica.com/biography/Linda-Hunt", "page_content": "Linda Hunt, original name Lydia Susanna Hunter, (born April 2, 1945, Morristown, New Jersey, U.S.), American stage, film, and television character actress known for her resonant voice, small stature, and magnetic performances in a wide variety of roles.\n\nHunt grew up in Westport, Connecticut, and she became entranced with the idea of acting when she saw a stage performance of Peter Pan. She studied at the Interlochen Arts Academy in Michigan and at the Goodman School of Drama (now the Theatre School of DePaul University) in Chicago, where she focused on directing, fearing that her unusual physique (she had hypopituitary dwarfism and was not conventionally pretty) would limit her acting opportunities. She then moved to New York City, where she directed and stage-managed at small community theatres before joining the Long Wharf Theatre in New Haven, Connecticut. Hunt made her professional debut in the theatre’s 1972 production of Hamlet, playing Lucianus. She first appeared on Broadway in 1975, playing Norah in Eugene O’Neill’s Ah, Wilderness!, and she also performed in the Long Wharf production of The Rose Tattoo in 1977. She appeared in 1978 in the television movie Fame, written by Arthur Miller, and she won praise for her performance in A Metamorphosis in Miniature (1982), an off-off-Broadway production.\n\nBritannica Quiz Pop Culture Quiz\n\nHunt made her film debut in a small part in Robert Altman’s Popeye (1980). In her second movie appearance Hunt was cast as the diminutive male Chinese-Australian photographer Billy Kwan in Peter Weir’s The Year of Living Dangerously (1982), set in 1965 in Indonesia near the end of the Sukarno regime. Hunt’s portrayal of the complex and contradictory character, who serves as the dramatic centre of the film, earned her an Academy Award (making her the first person to win an Oscar for playing a character of the opposite sex). She performed in two Off-Broadway productions in 1983, playing Joan of Arc in Little Victories and Pope Joan in Top Girls. She won praise for her performance in the title role of a 1984 staging by the Boston Shakespeare Company of Bertolt Brecht’s Mother Courage and Her Children, and she was nominated for a Tony Award for her leading role in the 1984 Broadway production of Arthur Kopit’s End of the World. In addition, she appeared in the Merchant and Ivory film The Bostonians (1984) and in David Lynch’s Dune (1984). Hunt played a saloon hostess in Silverado (1985), Alice B. Toklas in Waiting for the Moon (1987; part of the American Playhouse television series), and Aunt Dan in the Off-Broadway premiere of Wallace Shawn’s Aunt Dan and Lemon (1985).\n\nHunt’s later films included She-Devil (1989), based on a novel by Fay Weldon; the comedy Kindergarten Cop (1990), starring Arnold Schwarzenegger; and Altman’s Prêt-à-Porter (1994; Ready to Wear). She voiced Grandmother Willow in the Disney animated feature Pocahontas (1995). She played Commander Chennault on the short-lived sci-fi television series Space Rangers (1993–94) and had a recurring role as a judge on The Practice (1997–2002). Hunt also became a well-known narrator, serving in that capacity in the TV miniseries Auschwitz: The Nazis and the “Final Solution” (2005), several episodes of American Experience (1993–2006), and, most notably, for the God of War series of video games, beginning in 2005. She lent her voice to the film Solo: A Star Wars Story (2018). Hunt later became best known for her role as the enigmatic Assistant Director Hetty Lange on the series NCIS: Los Angeles (2009– )."}, {"url": "https://biographymask.com/linda-hunt/", "page_content": "Linda Hunt’s real name Lydia Susanna Hunter is an American stage actress, film, and television character recognized for her resonant voice, small stature, and magnetic performances in a large variety of roles. Linda Hunt is renowned for her academic Award-winning role in The Year of Living Dangerously. In the year 2013, she portrayed God of War: Ascension.\n\nEarly Life and Childhood\n\nIntroducing her early life, Linda Hunt was born on April 2, 1945. Her birthplace is Morristown, New Jersey, and The United States. Currently, she is 77 years old. Her birth sign is Aries. Her birth name is Lydia Susanna Hunter. She was born to Raymond Davy Hunter and Elsie Doying Hunter. Her father was vice president of Harper Fuel Oil.\n\nSimilarly, her mother was a piano tutor who taught at the Westport School of Music. she has one sibling; an older sister and her name is Marcia Hunt. her nationality is American whereas she belongs to the English ethnicity.\n\nHunt was raised in Westport, Connecticut, and she became entranced with the idea of acting when she glimpsed a stage performance of Peter Pan. Likewise, she studied at the Interlochen Arts Academy in Michigan and the Goodman School of Drama and there she concentrated on directing, fearing that her abnormal physique would limit her acting scope.\n\nLinda Hunt – Career and Professional life\n\nHer professional career started in the year 1980. Linda’s debuted her first film in Robert Altman’s musical comedy Popeye. After two years, she was a leading lady as Billy Kwan in The Year of Living Dangerously, Peter Weir’s film adaptation of the novel of the same name. For her title role as the male Chinese-Australian photographer Billy Kwan, she received the Academy Award for Best Supporting Actress in the year 1983 where Hunt became the first person to earn an Oscar for playing the role of the opposite sex.\n\nFollowing her career, she also played in Shadout in Dune in the year 1984. Moreover, she also played the role of the nurse in the movie She-Devil in 1989. She starred as the Austere school principal where her opposite co-star was Arnold Schwarzenegger in the movie Kindergarten Cop in 1990.\n\nOn the other side, she is also a renowned stage actress before she took a step into the film and television industry. She made her Broadway debut in a 1975 production of Ah, wilderness. Similarly, Hunt also builds the role of Aunt Dan in Wallace Shawn’s play Dan Aunt and Lemon.\n\nAwards and Nominations\n\nSpeaking about her entire lifetime achievements and awards. She achieved the Australian Film Institute Awards in the year 1983. Similarly, Hunt has been nominated for Best Performance by an actress in the Supporting Role in a Motion Picture.\n\nHunt is best known for winning the Oscar award for playing the role of the opposite sex. Moreover, she also won the Teen Choice Award for Choice Tv Actress: Action for NCIS: Los Angeles in 2009. Last but not least, she won a Bronze Wrangler Award for Western Documentary for Ishi: The Last Yahi in 1992.\n\nLinda Hunt – Net worth 2023\n\nAccording to some sources of information, Linda’s net worth is expected to be around $10 million but there is no genuine data about her detailed net earnings and salary. Likewise, her detailed property information regarding fixed assets and car status is still unknown. But her main source of income is from the film industry.\n\nPersonal life and Relationships\n\nLinda has been in a relationship with psychotherapist Karen Kline since 1978. The couple got married in 2008. Kline is six years younger than Hunt.\n\nHowever, her past relationship and personal life are still a mystery. It seems that she prefers to keep her personal life behind the mass media therefore there is no genuine information related to her previous relationships.\n\nLinda Hunt – Rumors and Controversy\n\nCar accident\n\nIn the year July 2018, a minor car crash in Hollywood left her Hospitalized. Hunt was driving a black SUV that strikes with the two vehicles while she was making a left turn. Her accident caused her minor injuries but thankfully she recovered soon. The others had also minor injuries.\n\nBody Measurement\n\nLinda had a deficiency of height from an early age causing dwarfism therefore she has just 4 feet 9-inch height. Furthermore, she weighs 65kg. Her hair color is black whereas her eye color is blue. Nevertheless, her other detail about the physical body and measurement are not stated.\n\nSocial Media\n\nOn the other side, she doesn’t seem to be very much active on social media. Till now, there is no official social media account for her."}, {"url": "https://www.tvinsider.com/people/linda-hunt/", "page_content": "Actress\n\nBirth Date: April 2, 1945\n\nAge: 78 years old\n\nBirth Place: Morristown, New Jersey\n\nDespite her diminutive 4-foot, 9-inch frame, actress Linda Hunt emerged as a prominent, Oscar-winning performer in only her second film, playing doomed Chinese-Australian photojournalist Billy Kwan in Peter Weir's \"The Year of Living Dangerously\" (1982), which marked the first time in Academy Award history that an actor won for playing a character of the opposite sex. Her triumphant win led to a Tony-nominated performance in Arthur Kopit's \"End of the World\" (1983) and a supporting role as a saloon keep in the revisionist Western, \"Silverado\" (1985), though opportunities later became few and far between. While she logged numerous film and television roles over the years, including a long-running recurring role as a judge on \"The Practice\" (ABC, 1996-2004), Hunt developed a second career as a busy voiceover artist. She lent her surprising baritone as a narrator on environmental specials, while voicing characters in both video games - most notably on the \"God of War\" series - and various animated projects like Disney's \"Pocahontas\" (1995). By the time she was seen with regularity on such hit procedurals as \"Without a Trace\" (CBS, 2002-09) and \"NCIS: Los Angeles\" (2009- ), Hunt was a familiar presence in several different mediums; a testament to both her talent and her ability to overcome the odds."}, {"url": "https://www.tcm.com/tcmdb/person/90862%7C0/Linda-Hunt/", "page_content": "Biography\n\nDespite her diminutive 4-foot, 9-inch frame, actress Linda Hunt emerged as a prominent, Oscar-winning performer in only her second film, playing doomed Chinese-Australian photojournalist Billy Kwan in Peter Weir's \"The Year of Living Dangerously\" (1982), which marked the first time in Academy Award history that an actor won for playing a character of the opposite sex. Her triumphant win led to a Tony-nominated performance in Arthur Kopit's \"End of the World\" (1983) and a supporting role as a saloon keep in the revisionist Western, \"Silverado\" (1985), though opportunities later became few and far between. While she logged numerous film and television roles over the years, including a long-running recurring role as a judge on \"The Practice\" (ABC, 1996-2004), Hunt developed a second career as a busy voiceover artist. She lent her surprising baritone as a narrator on environmental specials, while voicing characters in both video games - most notably on the \"God of War\" series - and various animated projects like Disney's \"Pocahontas\" (1995). By the time she was seen with regularity on such hit procedurals as \"Without a Trace\" (CBS, 2002-09) and \"NCIS: Los Angeles\" (2009- ), Hunt was a familiar presence in several different mediums; a testament to both her talent and her ability to overcome the odds.\n\nBorn on April 2, 1945, in Morristown, NJ, Hunt moved to Westport, CT with her family while still an infant. Burdened with a host of health problems since birth, Hunt was misdiagnosed with cretinism at six months of age. While in her teens, she was correctly diagnosed with hypo-pituitary dwarfism, a condition in which the pituitary gland fails to release enough growth hormone. Ironically, or perhaps consequently, Hunt grew up an unusual overachiever, undaunted by her condition. She took her first stab at acting at age 12 while performing in a production of \"Flibbertigibbet\" at Westport's famed Silver Nutmeg Theater. Hunt moved to New York in the mid-1960s, where she found consistent work in summer stock theater. Concerned that her unusual physical type would limit her future as an actress, Hunt initially focused on becoming a stage director. But the lure of acting proved too powerful to resist, so in 1969, Hunt returned to Westport to study acting under dramatic coach, Robert Lewis.\n\nIn the early 1970s, Hunt began a longtime association with the Long Wharf Theater in New Haven. Her one-woman show based on the life of Joan of Arc won the actress rave reviews and even flickers of interest from Broadway. A year later, Hunt went to New York City and made her off-Broadway debut as the Player Queen in the New York Shakespeare Festival's production of \"Hamlet\" in Central Park. This led to Hunt's first major role as the Irish maid Nora in a 1973 production of Eugene O'Neill's play, \"Ah, Wilderness!\" Originally directed by Arvin Brown for the Long Wharf Theatre, the play eventually moved to the Circle-in-the-Square Theatre along the Great White Way in New York, where it was taped for airing as a PBS special, \"Theater In America\" (1976). Hunt's screen career began in the late 1970s, when she made her television debut in a \"Hallmark Hall of Fame\" presentation of Arthur Miller's \"Fame\" (CBS, 1979). Adapted for the screen by the playwright himself, it was noteworthy that Miller specifically created Hunt's role of Mona with the actress in mind.\n\nThe following year, Hunt made her official big screen debut in Robert Altman's bloated and ultimately failed musical, \"Popeye\" (1980). Cast in a small supporting role as the feisty Mrs. Oxheart, Hunt's appearance was a fortunately forgettable cameo lost in an even more forgettable film that dogged stars Robin Williams and Shelley Duvall for years to come. Her next film, however, permanently changed her career. Tapped to co-star in the controversial drama \"The Year of Living Dangerously,\" Hunt joined burgeoning young actors Mel Gibson and Sigourney Weaver in director Peter Weir's complex drama. Based on a novel of the same name by Christopher Koch, the film told the complicated tale of an Australian journalist caught at the center of a foreign country's political overthrow. Based on the real-life events of the attempted 1965 coup of Jakarta by Indonesia's Communist party, \"Dangerously\" earned Hunt an Academy Award for Best Supporting Actress for her portrayal of Eurasian photographer, Billy Kwan. The first actor to ever win an Oscar for playing a role of the opposite gender, Hunt's record stood untouched until 1999, when Hilary Swank won an Oscar for \"Boys Don't Cry.\"\n\nDespite her formidable talent, however, Hunt hit the proverbial glass ceiling. Though she remained consistently employed on stage - even winning two Obies and a Tony nomination in the 1980s and 1990s - the pedigree of her film work had slipped. Still, Hunt's presence in movies managed to endure throughout this period. Among her higher profile roles were supporting turns in such critical favorites as \"Silverado\" (1985), in which she played Stella, a genial saloon proprietor, and the blockbuster comedy, \"Kindergarten Cop\" (1990), portraying a school principle disapproving of a rough-and-tumble cop (Arnold Schwarzenegger) going undercover as a kindergarten teacher to capture a wanted fugitive. In 1993, Hunt briefly returned to television, starring in the ill-fated space opera, \"Space Rangers\" (CBS, 1993), which was cancelled after just six episodes. After a brief dormancy in the mid-to late 1990s, during which time she only appeared in the horror dud, \"The Relic\" (1997), Hunt's career underwent something of a renaissance when she turned to television. In 1997, Hunt created the role of Judge Zoey Hiller on David E. Kelly's long-running legal dramedy, \"The Practice.\" A favorite recurring character for the show's fans, Hunt reprised the role more than two dozen times before the show finally adjourned its run.\n\nIn 2003, Hunt joined the cast of the HBO drama \"Carnivale\" (HBO, 2003-05) for a 10-episode run as the mysterious voice of Management. In 2005, actress Hunt added an unlikely new credit to her resume: video game icon. As the resonant, authoritative voice of the Narrator for the award-winning \"God of War\" video game series, Hunt gained a whole new generation of fans unfamiliar with her acting work. Hunt reprised the voiceover role for the game's sequel, \"God of War 2.\" Following a long vacation away from features, Hunt finally returned to the big screen with the blended family comedy \"Yours, Mine, and Ours\" (2005), starring Dennis Quaid and Rene Russo. While her role was hardly much of a challenge for the actress, the movie did at least allow Hunt a rare opportunity to flex her comedic muscles. Her next project continued in the same vein, as Dr. Mittag-Leffler in director Marc Forster's twisted comedy, \"Stranger than Fiction\" (2006) starring Will Ferrell and Emma Thompson. After building a second career voicing narration for numerous PBS specials, including \"Secrets of the Ocean Realm\" (1997), \"Woodrow Wilson\" (2002) and \"Auschwitz: Inside the Nazi State\" (2004), Hunt joined the cast of the successful spin-off series, \"NCIS: Los Angeles\" (CBS, 2009- ), playing OSP Operations Manager Henrietta Lange."}, {"url": "https://www.cbsnews.com/pictures/linda-hunt/", "page_content": "Linda Hunt as Hetty Lange, operations manager of an elite undercover division of the Naval Criminal Investigative Service in \"NCIS: Los Angeles.\"\n\n\n\nThe diminutive 4-foot, 9-inch actress is a towering talent on stage, TV, and the movie screen. She has won an Academy Award and two Obie Awards and was nominated for a Tony Award, and her \"NCIS\" role has earned her the Teen Choice Award for Best Actress in an action series two years in a row.\n\nBorn in 1945, she was raised in Westport, Conn., but Hunt was diagnosed with a form of dwarfism.\n\n\n\nWhen her parents took her to her first Broadway show -- a production of \"Peter Pan\" -- Hunt realized the stage was a place she might at least feel taller. \"I longed to be bigger than life, because I wasn't,\" she told Lee Cowan. Through acting, \"I could pretend to be anything.\"\n\n\n\nHunt attended the Interlochen Arts Academy in Michigan (where she received the Theatre Department Award her junior and senior year) and the Goodman School of Drama in Chicago.\n\nLinda Hunt performs a scene from \"The Importance of Being Ernest,\" May 21, 1963, on WPBN-TV in Traverse City/Cadillac, Mich.\n\n\n\nHunt told Cowan that she worked on her voice, to sound more authoritative than she appeared. \"When I was 16, nobody else talked like me. Nobody else sounded like me,\" she said. \"That made me big.\"\n\nHunt appeared at the Long Wharf Theater in New Haven, Conn., in a one-woman show on the life of Joan of Arc. She then made her New York debut in 1972, as the Player Queen in the New York Shakespeare Festival's Central Park production of \"Hamlet.\" Her off-Broadway and Broadway credits include Eugene O'Neill's \"Ah, Wilderness!\"; Bertoldt Brecht's \"Mother Courage and Her Children\"; \"Doubt\"; \"The Cherry Orchard\"; \"Three Sisters\"; and Wallace Shawn's \"Aunt Dan and Lemon.\"\n\n\n\nShe won two Obie Awards (for \"A Metamorphosis in Miniature\" and \"Top Girls\"), and was nominated for a Tony Award for \"End of the World.\"\n\nHunt's first major film appearance was in the 1982 drama \"The Year of Living Dangerously.\" Set in Jakarta, Indonesia in 1965, the film follows an Australian journalist (Mel Gibson) and his photographer-assistant Billy Kwan (Hunt) covering the political turmoil as the Sukarno government teeters on collapse.\n\nA cypher to many, Hunt's character is a behind-the-scenes player who keeps meticulous dossiers on local figures and even on the people he works for.\n\n\n\nHis rage about the plight of Indonesia's poor leads him to ever-more-dangerous work against the Sukarno regime.\n\n\"I can't be a man,\" Linda Hunt said. \"But I can embrace the head of a man, the intelligence of a man, the spirit of a man.\"\n\n\n\nFor her powerful performance, Hunt won the Academy Award for Best Supporting Actress -- the first time ever an Oscar was awarded for playing a character of the opposite sex.\n\nLinda Hunt as the saloonkeeper Stella and Kevin Kline as the gunslinger Paden in Lawrence Kasden's \"Silverado\" (1985).\n\nIn David Lynch's adaptation of the science fiction novel \"Dune\" (1984), Linda Hunt played Shadout Mapes, a housekeeper in the Imperial Residence on Arrakis, who learns the identity of a traitor in their midst -- and pays for it.\n\nLinda Hunt appeared in Peter Yates' \"Eleni\" (1985), based on Nicholas Gage's memoir about the effects of the Greek Civil War on the village of his youth.\n\nLinda Hunt as Alice B. Toklas and Linda Bassett as Gertrude Stein in \"Waiting for the Moon.\" The film won the Grand Jury Prize at the 1987 Sundance Film Festival.\n\nLinda Hunt as Miss Schlowski, the school principal, in the Arnold Schwarzenegger comedy \"Kindergarten Cop\" (1990).\n\nSally Kellerman, Tracey Ullman and Linda Hunt in Robert Altman's 1994 satire of the Paris fashion scene, \"Pret-a-Porter.\"\n\nLinda Hunt and Kevin Costner in the 2002 thriller \"Dragonfly.\"\n\nLinda Hunt (Hetty Lange) and Chris O'Donnell (Special Agent Callen) in \"NCIS: Los Angeles.\"\n\nLinda Hunt (here with Peter Cambor and David Bickford in \"NCIS: Los Angeles\") nearly always steals the scene.\n\nActors Chris O'Donnell, LL Cool J and Linda Hunt attend the 2011 CBS Upfront at The Tent at Lincoln Center on May 18, 2011 in New York City.\n\n\n\nBy CBSNews.com senior editor David Morgan"}]}