{"Jerry Leger is a Canadian singer-songwriter.": [{"url": "https://jerryleger.com/about/", "page_content": "Bio\n\nBorn in the mid-80s, singer-songwriter Jerry Leger came of age in the Upper Beaches area of Toronto. Surrounded by music from a young age, his grandfather first turned him onto Hank Williams, constantly playing the youngster a plethora of the honky tonk master’s great recordings. Although Williams’ voice came from another world in terms of time, geography, and class, Leger was intrigued by the ways that Williams’ songs told a story and often conjured up mysterious images in his head. Other seminal influences were slowly added including John Lennon (and the Beatles), Bob Dylan, Lightnin’ Hopkins, Leonard Cohen, Elvis Costello, Neil Young, the Everly Brothers, Tom Waits, and Gordon Lightfoot.\n\nIn 2005 as Leger turned nineteen he cut his first independently released album. In the sixteen years since then the multi-talented singer-songwriter has recorded nine additional studio albums as well as one live compilation under his own name. In 2014 he was signed to the Cowboy Junkies’ label, Latent Recordings, releasing the critically acclaimed Early Riser that same year. His second Latent release, Nonsense and Heartache, followed in 2017. A year later the two-album set was picked up by Proper Records for distribution in the U.K and Europe, leading to extensive touring throughout the continent, in the process opening up a whole new audience for Leger’s finely crafted songs. With his next Latent album, 2019’s Time Out for Tomorrow, Leger began to receive positive notices in such high-profile music magazines as Uncut and Rolling Stone.\n\nA restless hungry spirit, when not performing and recording under his own name, Leger stays busy with a plethora of side projects including The Del Fi’s (loose improvisatory rock and roll) and the Bop Fi’s (Leger reciting his poetry over jazz accompaniment). He has also been known to work under the pseudonym Hank Holly (bonus points go to those who can figure out where that name came from!). Making the most of his time while off the road due to the pandemic, in 2020 Leger published his first book of poetry Just the Night Birds, made a film for his mailing list subscribers, The Apartment Show He Never Gave, while releasing what he terms a “surprise” album, Songs from the Apartment. In between all that activity, Leger also cut a handful of one-off singles. One of those tracks, “Halfway ‘Till Gone” recorded with former Moby Grape member Don Stevenson, turned the Replacements’ Tommy Stinson into a fan!\n\nSongs from the Apartment was a stripped-down lo-fi affair recorded in Leger’s home using a cheap tape recorder with an internal microphone. Two songs from the current album, “Underground Blues” and “Sinking In,” were also recorded in Leger’s home, this time using two SM58 microphones fed into his vintage 1981 Tascam 4-track tape recorder. The remaining nine tracks included on Nothing Pressing present Leger’s work in two starkly contrasting soundscapes. “Nothing Pressing,” “Protector,” and “Still Patience,” are solo acoustic recordings cut live in the studio with little embellishment save Dan Mock’s overdubbed harmony vocals and, on the title track, producer Michael Timmins’ ukulele. The other six tracks are prime roots rock and roll featuring his long-time band The Situation (drummer Kyle Sullivan and bass player Dan Mock). Among the latter songs, “Kill It With Kindness” and “Have You Ever Been Happy?” have the kind of drive, energy and spirit that are sure to make them highlights of his future live shows.\n\nLeger often times finds himself at a loss as to explain the source of his songs. He feels his songwriting, while clearly drawing on experiences filtered through a panoply of influences, often verges on being a supernatural experience. Over the course of the eleven songs on Nothing Pressing, the songwriter’s songwriter engages with questions of existence, mortality, hope, trust and heartbreak while simultaneously conjuring feelings of isolation, reflection, longing and gratitude.\n\nPaired with such evocative lyrics are wonderfully crafted melodies, soulful vocals and the spirit and energy of a mature songwriter, comfortable in his skin and growing as an artist with every release. Nothing Pressing serves a wonderfully refreshing tonic in troubling times."}, {"url": "https://canadianbeats.ca/2023/02/08/jerry-leger-five-questions-with/", "page_content": "Jerry Leger unveils a 4-song EP, Live From Paradise\n\nAmericana singer-songwriter Jerry Leger has shared Live From Paradise, a four-song collection of recordings from his May 31st, 2022, show at Toronto’s stunning Paradise Theatre.\n\n“We were grateful to see a packed house in still uncertain times,” shares Jerry.\n\nThis performance ended up being Jerry’s first hometown show since Lee’s Palace in November 2019. So much had happened since that show, including a new album, Nothing Pressing (2022), and a change in the band lineup after more than a decade.\n\n“Fresh off of a 5-week European/UK tour, we had multiple things to celebrate and wanted to properly capture it,” says Jerry.\n\nThe live EP includes “The Big Smoke Blues” (watch the live video here), “With Only You”, “Factory Made,” and the album single “Corner Light.”\n\n“This is my favourite song from my Time Out For Tomorrow (2019) album and probably would have been a single if COVID hadn’t interrupted things,” shares Jerry. “Like most of the songs, it’s evolved musically in concert and the band gives it their all. I think this version really puts you into the feel and vulnerability of the lyrics.”\n\nListen to Live From Paradise below and learn more about Jerry Leger via our Five Questions With segment.\n\nCare to introduce yourself to our readers?\n\nMy name is Jerry Leger. I’m a singer-songwriter, born and raised in the east end of Toronto, where I still am.\n\nTell us a bit about your most recent release.\n\nIt’s an EP with a few tracks taken from our performance at Paradise Theatre in Toronto in May of last year. There’s also beautiful footage of it. Two videos are up on the YouTube channel now. It was our first show after a five-week European and UK tour and our first hometown performance since late 2019.\n\nWhere do you tend to pull inspiration from when writing?\n\nIt really depends. Sometimes it’s pure imagination, sometimes inspiration, sometimes real, sometimes a version of reality. I just keep my ears and eyes open. You never know when someone will say something interesting.\n\nDo you have any upcoming shows you’d like to tell us about?\n\nI’m playing a few solo shows in Ontario this March. On the 1st, I’ll be at a cool little bookstore called Sellers & Newel in Toronto that puts on shows. They kind of have a house concert vibe. I’m gonna use the opportunity to only play new songs. March 10th, I’ll be in Peterborough at Jethro’s for an early performance (6 pm-8 pm), followed by March 11th in Trenton at Old Church Theatre. Tickets are on sale now for the latter. Always love playing the Church.\n\nWhat’s your goal for 2023?\n\nSurvive and stay busy.\n\nConnect with Jerry Leger\n\nWebsite\n\nFacebook\n\nTwitter\n\nInstagram"}, {"url": "https://www.thesoundcafe.com/post/a-conversation-with-toronto-based-singer-songwriter-jerry-leger", "page_content": "\n\n\n\nPhoto Credit: Laura Proctor.\n\n\n\n\n\n\n\n\n\nDouglas McLean chats with Toronto-based singer-songwriter Jerry Leger, for his latest Sound Cafe Podcast, 'Backstage'.\n\n\n\n\n\n\n\n\n\nYou can listen to the entire interview and music HERE\n\n\n\n\n\n\n\n\n\nBorn in the mid-80s, singer-songwriter Jerry Leger came of age in the Upper Beaches area of Toronto. Surrounded by music from a young age, his grandfather first turned him onto Hank Williams, constantly playing the youngster a plethora of the honky tonk master’s great recordings. Although Williams’ voice came from another world in terms of time, geography, and class, Leger was intrigued by the ways that Williams’ songs told a story and often conjured up mysterious images in his head.\n\nOther seminal influences were slowly added including John Lennon (and the Beatles), Bob Dylan, Lightnin’ Hopkins, Leonard Cohen, Elvis Costello, Neil Young, the Everly Brothers, Tom Waits, and Gordon Lightfoot.\n\nJerry Leger’s newest album, Nothing Pressing, released March 16th, 2022, is the best! Full of energetic and carefully crafted melodies and lyrics, Leger again displays why so many think he is one Canada’s great rock and roll artists, as well as a pre-eminent songwriter.\n\n\n\n\n\nJerry joined Douglas McLean in conversation about his career, songwriting approach and tour plans before his show on April 01, 2022 at Bracebridge Hall in Bracebridge, Ontario, Canada.\n\n​\n\n​\n\nFEATURED SONGS:\n\nKill It with Kindness\n\nA Page You've Turned\n\nThe Great Unknown\n\nHave You Ever Been Happy?\n\nNothing Pressing\n\nSurvived Like a Stone\n\nWait a Little Longer\n\n\n\n\n\n​\n\nYou can listen to the entire interview and music HERE\n\n\n\n\n\n​\n\n\n\n\n\n​\n\nWebsite: jerryleger.com\n\nBandcamp: jerryleger.bandcamp.com/music\n\nFacebook: www.facebook.com/jerrylegermusic\n\nSpotify: open.spotify.com/artist\n\n\n\n\n\n\n\n"}, {"url": "https://www.wikiwand.com/en/Jerry_Leger", "page_content": "Jerry Leger (born Gerald Micheal Leger; April 19, 1985) is a Canadian singer-songwriter. Since 2005, he has released 13 albums (7 solo, 3 credited to Jerry Leger & The Situation and 3 with his side projects, The Del Fi's and The Bop Fi's).[1]\n\nCanadian singer-songwriter (born 1985)\n\nQuick facts: Jerry Leger, Background information, Born, Ge... ▼\n\nMusical artist\n\nLeger's last three major albums Early Riser (2014), the double LP Nonsense and Heartache (2017) and Time Out For Tomorrow (2019) were produced by songwriter/musician, Michael Timmins of Cowboy Junkies and released on their record label, Latent Recordings. He has been praised by other songwriters such as Doug Paisley and Ron Sexsmith, who appeared on a couple of his albums and said, \"Jerry Leger has that spark in him that all the great songwriters have. He's the real deal.\"\n\nJerry Leger has toured extensively through Canada, the US, Europe and the UK, playing headlining shows and opening for acts such as Ron Sexsmith, The Sadies, Jesse Winchester, Fred Eaglesmith, Jill Barber, Justin Townes Earle, Jim Cuddy, Deer Tick, Skydiggers, Jim Lauderdale, Dawes, Tift Merritt, Doug Paisley, among others.\n\nMaik Brüggemeyer of Rolling Stone Magazine in the March 2018 European edition called Leger, \"One of the best Canadian songwriters.\"[2]"}, {"url": "https://www.rootsmusic.ca/2019/11/02/jerry-leger-talks-about-his-new-album-time-out-for-tomorrow/", "page_content": "Jerry Leger took some time out of his busy schedule to chat with Roots Music Canada about his love of vinyl, his career, and his forthcoming release, Time Out For Tomorrow, available on vinyl Nov. 8 on Latent Recordings.\n\nJerry is a critically acclaimed Canadian singer/songwriter that’s clearly ahead of his time. He started releasing his albums on vinyl as early as 2010’s Travelling Grey.\n\n“I’ve been buying vinyl since I was a little kid,” he said. “The first album I bought when I was eight was John Lennon’s Mind Games album. When I was about five or six, my Dad gave me a stack of records and a record player, and that started me off. I love records. There’s just something about it that you don’t get from listening to stuff digitally. It’s hard to hand down files to your kids. I like listening to albums from start to finish.”\n\nJerry’s debut album was released in 2005 when he was still a teenager. He admitted that he often felt like an outsider while coming of age in Toronto’s East End.\n\n“Growing up and still living in the East End of Toronto you’re very separated from where the action is, and those scenes,” he said. I remember feeling very kind of not part of people’s treehouses, or on the outside looking in when I would go downtown. I was never in the cool groups. I was never invited into those circles. I always felt very separated from that living in the East End.”\n\nBut Jerry’s love of music would force him out of his comfort zone resulting in him sneaking into Toronto bars to perform when he was just 17 years old. It also resulted in him meeting another eastender, producer and musician Tim Bovaconti, who ended up opening a lot of doors for the artist. Tim would go on to produce or co-produce Jerry’s first five albums.\n\nJerry’s East End lifestyle did lead to a chance meeting with another famous Canadian artist.\n\n“Ron (Sexsmith) used to live in the East End,” he said. “The first time I met him was when I was working at Home Hardware and he would come in, and of course, I knew who he was. I gave him a demo CD, and he actually listened to it and liked it and gave some cool feedback.”\n\nRon Sexsmith would end up performing on Jerry’s sophomore album 2006’s Farewell Ghost Town and again on 2012’s Some Folks Know.\n\nJerry’s incredibly tight backing band is known as the Situation. Jerry’s high school friend, drummer Kyle Sullivan, appeared on his debut album and has remained a member of the Situation ever since. By Jerry’s third album, 2008’s You, Me and the Horse, Jerry and Kyle were joined by guitarist James McKie and bassist Dan Mock, forming the lineup that remains over twelve years later.\n\nJerry explained, “We’re friends and we get along. That’s a big part of it. We’re all invested in a way in bringing something honest, whatever ‘honest’ means. Maybe the word ‘honest’ isn’t honest, but whatever ‘honest’ means, in what we’re doing, that’s what we’re trying to bring to people. And I think we all personally get off on that. Especially when other people get into it.”\n\nSo, it’s no surprise that when I caught Jerry and the Situation’s late-night set on the closing night of the second annual Troubadour Festival in Barrie, ON last month, I saw a well-oiled machine that continues to enjoy playing music together and playing music in front of an audience. The band’s set included several songs from Jerry’s forthcoming album Time Out For Tomorrow.\n\nUnlike 2017’s double LP Nonsense and Heartache, Time Out … isn’t a concept album, Jerry said.\n\n“You let the music go in whatever direction it wants to go for that time period. The next record, I don’t know what it’s going to sound like. I don’t think always under the same umbrella. Some songs are more observational. Some songs have a piece of my life in it just ’cause you can’t always help it.”\n\nTogether with producer Michael Timmins (Cowboy Junkies), Jerry and his band would record 20 songs, finally settling on 10 that would form the album version. Most of the songs were written specifically for Time Out For Tomorrow, with the exception of “Tell A Lie.” While it was originally recorded during 2017’s Nonsense and Heartache sessions, Jerry didn’t feel that it fit the concept for that album. Thankfully, when it came time to record his next album, he found the right place for the song and re-recorded it for Time Out For Tomorrow.\n\nThe last song to be written for Time Out For Tomorrow would turn out to be the first track on the album, “Canvas Of Gold,” a beautiful, well-crafted song that perfectly sets the tone for the entire album.\n\n“Burchell Lake” was inspired by Ghost Towns of Ontario: Field Guide Vol. 2., a book by Canadian author Ron Brown. The song is about the town of Burchell Lake, an actual ghost town located southwest of Thunder Bay, ON.\n\n“Nobody knows Ontario like Ron Brown,” Jerry explained. He’d owned the book for several years and, while he hasn’t been able to visit Burchell Lake, it did inspire him to embark on a ghost town road trip down Highway 7 all the way to Ottawa a few years ago.\n\nI’m fortunate enough to own five of Jerry Leger’s albums, and after listening to Time Out For Tomorrow, I felt compelled to listen to his previous albums to try and hear if and how Jerry has evolved as a songwriter and performer.\n\nIn my opinion, Jerry Leger’s greatest strength is his songwriting. It’s been strong for years and Time Out For Tomorrow is another great example of that strength. It features lyrics and arrangements that don’t feel the least bit contrived or formulaic. Jerry chooses not to be constricted by rigid song structure, in favour of letting the feel of the song dictate how it will unfold. The result is a fantastic album that easily engages the listener from start to finish.\n\nI certainly lost myself during Jerry Leger’s Troubadour Festival set and again when I previewed my advance copy of his forthcoming album. If you’re looking to escape into honest stories told through song I’d highly recommend Jerry Leger and the Situation’s Time Out For Tomorrow.\n\nIf you are enjoying this content, please take a second to support Roots Music Canada on Patreon!"}, {"url": "https://jerryleger.bandcamp.com/music", "page_content": "JERRY LEGER Toronto, Ontario\n\nsinger/songwriter from Toronto, Canada. Jerry Leger has been called “one of Canada’s best” by Exclaim, a “gifted storyteller” by The Toronto Star and \"One of the best Canadian songwriters\" by Rolling Stone.\n\nRon Sexsmith, Jim Lauderdale and Michael Timmins of Cowboy Junkies are known fans. ... more"}, {"url": "https://www.kmuw.org/a-musical-life/2021-02-26/a-musical-life-jerry-leger", "page_content": "Jerry Leger is a singer, songwriter and poet based in Toronto, Ontario, Canada. His albums include Songs From The Apartment, Time Out For Tomorrow, and Nonsense and Heartache, among others. His latest single is “Jumped In The Humber,” which was produced by Michael Timmins of Cowboy Junkies. He is also author of Just The Night Birds, a collection of poetry.\n\n“It was The Beatles that first inspired me to write songs. It was the first music I was exposed to, because of my parents; it was really their music. But my older brothers and I raided their record collections and it's still music I love and still listen to today.\n\nAbout that time when I was a kid, my brothers were writing songs. And that was really fascinating to me. And I wanted to do that. Hank Williams was another artist I heard a lot because of my grandfather, and that had a real lasting effect.\n\nUnless I'm writing free form, poetry and lyrics can be interconnected. If a poem I'm writing has a certain flow and rhythm to it and apply it to music.\n\nWhen I'm specifically writing lyrics, it's because I have a melody in my head, and I'm writing to that or I'm writing the words and music at the same time, on a guitar or a piano, but I've also written the lyrics turned into a poem rather than a song. So they're interconnected.\n\nIf it's too hard finishing a song, I usually drop it and move on. But I mean, if it's worth working on, it's usually because there's a few lines that I can change or a chord I can flip around and [that] makes a song.”"}, {"url": "https://peoplepill.com/people/jerry-leger/", "page_content": "Jerry Leger (born April 19, 1985 Toronto, Ontario) is a Canadian singer-songwriter. Since 2005, he has released 8 acclaimed albums (4 solo, 3 credited to Jerry Leger & The Situation and 1 with his side project, The Del Fi's) and toured extensively playing shows with acts such as Ron Sexsmith, The Sadies, Jesse Winchester, Fred Eaglesmith, Danny Michel, Jill Barber, Justin Townes Earle, Deer Tick, Skydiggers, Jim Lauderdale, Dawes, Tift Merritt, Doug Paisley, among others.\n\nJerry Leger's music has been heard on CBC Radio shows (including Q, Drive, Mainstreet, Bandwidth, Shift), NPR, WSM, BBC Radio and various campus radio stations. Videos for \"You Got Away From Me\" and \"All Over again ft. Serena Ryder\" are still in rotation on Country Music Television (CMT).\n\nHis songwriting influences include Hank Williams, Bob Dylan, Lightnin' Hopkins, Elvis Costello, Buddy Holly, Gordon Lightfoot and Leonard Cohen.\n\nRon Sexsmith has called him \"One of the best songwriters I've heard in quite some time.\"\n\nCareer\n\nLeger cut his first album when he was 19 in 2005, with frequent producer/musician, Tim Bovaconti. His sophomore record, Farewell Ghost Town, followed the next year. Produced by Don Kerr and Tim Bovaconti and featuring constant Leger supporter, Ron Sexsmith on piano and Fergus Hambleton(of The Sattalites). Farewell Ghost Town was charming not only for its strong songwriting, but also in its unassuming approach.\n\nIn 2007, Leger struck up a friendship with Skydiggers co-founder, Josh Finlayson. This resulted in the 2008 album, You, Me and The Horse, co-produced by Tim Bovaconti. You, Me and The Horse garnered rave reviews and pushed Leger's career forward with appearances on the popular CBC Radio show, Q, in-sessions on the legendary WSM Radio in Nashville and The WDVX concert series, Blue Plate Special in Knoxville, TN.\n\nThe end of 2010 saw the release of Leger's 4th record, Traveling Grey. Ron Sexsmith remarked, \"Traveling Grey is probably Jerry's best record so far and he hasn't made any bad ones.\n\nTraveling Grey is Jerry Leger's fourth album and finds him poised to indelibly add his name to the roll call that has built Toronto's international reputation as a singer/songwriter Mecca. Leger revealed in Exclaim! Magazine how the record came about \"It's the most spontaneous record since my first one, which was done in two days. This one rather from when we were touring out east most of July [2010]. When I got back, I just had this bug: I need to make a record. One song was written at four a.m. the night before the sessions.\" During this time, Jerry appeared twice on Music City Roots, hosted by singer/songwriter, Jim Lauderdale, who has called Leger a great young songwriter.\n\nIn 2011, Jerry released the digital only mini album, The Good Old Days are Back in Drag. Jason Schneider at Exclaim! said \"its seven tracks crackles with the raw energy of a Sun Records single.\" The album artwork is a sketch by Leger.\n\nSome Folks Know was released near the end of 2012, showcasing his longtime backing band, The Situation (James McKie, Dan Mock, Kyle Sullivan), Ron Sexsmith reprising his role on piano and a duet with Serena Ryder. Ben Rayner of The Toronto Star called the album \"the works of a young gifted storyteller\" and \"some folks do indeed already know what he's up to. Time, Jerry. Give it time. It's coming.\"\n\nIn the summer of 2013, Leger met up with Michael Timmins, member and main songwriter in the legendary band, Cowboy Junkies. This resulted in the 2014 album, Early Riser, produced by Timmins and released on the Junkies own label, Latent Recordings, distributed by Fontana North. All Jerry's previous albums had been released independently on his own label, Golden Rocket Records (named after the Hank Snow song). The album has received high acclaim from Exclaim!, NOW, The Toronto Star, The Globe and Mail and CBC. Zachary Houle from PopMatters called the record, \"A commanding and astounding listen\" and \"deserving of any laurels and accolades thrown its way.\" It's also noted for Daniel Romano providing the album artwork/design.\n\nWinter 2015, the album Crowd Pleaser by his side project, The Del Fi's was released. It was recorded live off the floor in 10 hours with 13 musicians who barely knew or didn't know the material at all. Leger wrote all the songs, with most of them being written very quickly before going into the studio to maintain a spontaneous and loose rock 'n' roll sound. Kerry Doole at Exclaim! wrote, \"It remains something of a mystery why roots troubadour Jerry Leger hasn't made more of a mark. He regularly releases albums of a high quality, he's an engaging performer and he has earned major peer respect.\" Adding \"The record does a fine job of capturing the vitality of his band's live show...This is a crowd-pleasing addition to a worthy discography.\" Another side project appeared in 2016 stemming from The Del Fi's called The Bop Fi's featuring poetry written and spoken by Leger with a backdrop of jazz, mainly in the bebop and cool jazz style.\n\nDiscography"}, {"url": "https://hifiplus.com/articles/music-interview-jerry-leger/", "page_content": "Canadian singer-songwriter Jerry Leger is a voracious collector of vinyl records. When I spoke to him on his last UK tour, ahead of a gig with his band, The Situation, in East London, he told me: “When I get into a record, I dissect it – I listen very closely to it and it means something to me. Over a beer, I can talk all night about music I love.”\n\nHis new record, Time Out For Tomorrow, has been heavily influenced by two albums that he adores – Lou Reed’s Coney Island Baby and Nick Lowe’s The Impossible Bird. “Coney Island Baby was the first solo Lou Reed record I heard. I think it was my brother, Shawn, who bought it at a garage sale or something. I was still pretty young, maybe 14 or so. I had got into The Velvet Underground a couple of years earlier,” he says.\n\n“It’s an album that has always stuck with me. It’s not trying to prove anything – it’s there to discover. I love the production, especially the drum sound, which is what I really wanted on this record.”\n\nHe adds: “Nick Lowe’s The Impossible Bird is just a beauty of an album. It has a wonderful bright sound to it. I get the same feeling listening to an Everly Brothers or Jack Scott record.\n\n“Have you ever listened to Jack Scott? He was one of the first Canadian rock ‘n’ rollers to break through abroad and he’s one of my dad’s favourite singers. I suppose he influenced me to some degree. I know my parents did, musically. They have great taste in music. When my parents like my album, then I know I’ve made a good one.”\n\nTime Out For Tomorrow – the ninth studio album by Toronto-based Leger – should meet with his parents’ approval. It’s a brilliant record – from the Dylanesque country-rock of first single ‘Canvas of Gold’, to the melancholy, piano-led ballad ‘That Ain’t Here’, the blues-folk of ‘Burchell Lake’ – inspired by a ghost town in Ontario – and the haunting mountain tune, ‘Survived Like A Stone’ – with fiddle and saw – these are raw, powerful and emotional songs that deserve to be heard by a much wider audience.\n\nThrough a gruelling touring schedule, Leger has slowly started to build up a following in the UK and Europe. In spring 2019, he released a limited edition, retrospective compilation album, called Too Broke To Die, which was put together especially for the European market and was available to buy from his merchandise stall.\n\nSix months after our first meeting in London, I caught up with him again to talk about the making of his latest album and find out more about the influences behind it…\n\nSH: Could Time Out For Tomorrow be the your ‘breakout’ album?\n\nJL: I hope it does – just to make it easier to keep travelling and making albums. I certainly think that there are enough people that would dig it to make that happen, but it’s hard these days. Once upon a time the music would come to them, now they gotta dig for it, unless there’s a lot of money behind it, pushing it. We’ll definitely be back [in the UK and Europe] in the spring. We’re just starting to figure that out. I’m really looking forward to it.\n\n2018’s Nonsense and Heartache, was a double album – the first half had a raw, electric, blues feel, but the second half was much more stripped-down and alt-country. The new album feels less bluesy and more Americana…\n\nYeah – that’s a fair comment. I think the Nonsense portion of Nonsense and Heartache was basically a blues record. It’s just where I was at for those sessions. They’re all kind of blues records, but this one swings more.\n\nWith 10 tracks, it feels very direct – it doesn’t mess around…\n\nThe last record was a double because we were making two very different records at the same time. [Producer] Michael Timmins said, “why don’t we just release them together under the same roof?” I knew this one was gonna be a single album and I wanted it to be short and sweet – to say what it needs to say and then move on to the next thing.\n\nSome of my favourite albums are doubles for the reason that the artists do it because they need to let it all out at that moment, for better or worse. On the other hand, some of my favourite albums are the ones where they’re there and then they’re gone – just like some of the best memories you have. You get a natural high and all you wanna do is re-live it. I wanted to make a record like that – that made you feel good.\n\nYour basic band set-up on this album is very mid‑‘60s Bob Dylan…\n\nBob Dylan has influenced everything and everyone, whether they like it or not. As Warren Zevon once said, ‘He invented my job.’ Having said that, it wasn’t anything intentional. We just have a good buddy, Alan Zemaitis, who plays the organ like you’ve never heard. He recently played with Buddy Guy in Chicago, and Buddy gave him the nod and thumbs up. I really wanted him as part of the family on this record.\n\nHow were the recording sessions?\n\nSmooth and quick. It basically took a week, but a few tunes were recorded during the rehearsals and they ended up as final takes. Unlike the other records, the band and I met up more to try out different arrangements of the tunes or hammer out parts that we really dug. There was still spontaneity and some songs were re-arranged on the fly, but we definitely took more time finding the world each song lived in. We recorded it at the Cowboy Junkies’ studio, The Hangar, in Toronto.\n\nWhat’s Michael Timmins (Cowboy Junkies) like to work with?\n\nHe doesn’t interfere, but he’ll suggest things when he feels like he needs to. A lot of times he’s right. I trust him. There are only a handful of people that I really trust with my music. I think this record is the closest sound-wise that I’ve ever got to what’s in my head. You can never get there 100%, but I’m very proud of it.\n\nDid you have many songs left over from the album sessions?\n\nYeah – every record has that. Sometimes the best song is dropped because it just doesn’t fit. This record had about eight or nine other tunes that didn’t make the cut. They were some of my favourites, but I trusted the vision of the album.\n\nAre all the songs on Time Out For Tomorrow new, or do some date from a while back?\n\nThere was just one song, ‘Tell A Lie’ that we recorded for the last album. I knew it didn’t fit, but I also knew that it had something – a great chorus and feel, so we re-recorded it for Time Out For Tomorrow. The rest of the songs were new. I wrote ‘Canvas of Gold’ days before we started recording.\n\nThe title of the new album is taken from a ‘60s dime store collection of sci-fi short stories that a friend gave you. Why and how did that inspire you and why did you feel it summed up the record?\n\nI just couldn’t get the title out of my head. It seemed to make sense to me for this record. Sometimes I know exactly what it means and sometimes I think it could be something else. I dig that.\n\nThe first song on the record – and also the first single – is ‘Canvas of Gold’. Is the song autobiographical?\n\nWell, my dad had a rough upbringing – not a lot of money in a very full house in St. John’s, Newfoundland. He always worked very hard – he did a few jobs to make sure that we didn’t grow up the same way. His work ethic is still inspiring to me. He always had pride in what he was doing. My Dad was no sell-out.\n\nAs a full-time musician trying to earn a living, do you feel like a hustler?\n\nYeah. Life is a hustle for people that don’t rely on luck, or rely on someone to create the illusion for them.\n\nOne of my favourite tracks on the album is ‘Burchell Lake’, which was written about a ghost town in Ontario. Can you tell me more about the song?\n\nI read about Burchell Lake in a book on ghost towns, which was written by Ron Brown. The gas station was still there, with some products left behind on the shelves, a row of houses, a general store… I wrote the song in five or 10 minutes. ‘Burchell Lake’ just seemed like a song that needed to be around.\n\nThe song ‘Survived Like A Stone’ has a folk feel to it and a fiddle and a saw on it. It has an eerie and dark atmosphere, and sounds like a mountain ballad…\n\nI wrote it on piano, but it felt better on guitar. I pictured it in an old Western film – coming off the mountains. That’s why the choruses have that atmosphere to them. Once Upon A Time In The West is one of my favourite movies and I love Ennio Morricone’s scores. I really like the words to ‘Survived Like A Stone’. I thought it was a cool idea – stones and rocks, some have been here forever and we come and go. There are spirits in those stones…\n\nWould you say this album is more personal than some of your other records? It feels like it is…\n\nI think they all have a degree of that. It’s intertwined with make believe and random thoughts, too.\n\nWhat music are you currently enjoying? You’re a big record collector. Have you bought any vinyl recently?\n\nI’ve been listening to a lot of Butch Hancock. I finally got my hands on a few of his albums – they’re not easy to find. I was in Newfoundland recently and picked up an album by a legendary artist from there named Ron Hynes. When you get a chance, check out a song called ‘1962’. It’s beautiful.\n\nIf you could get some ‘time out for tomorrow’, what would you do?\n\nProbably just write more songs, or maybe try and write and direct a good, old haunted house movie. Something that is simple and creepy. I hope that someday someone asks me to write music for a spooky film.\n\nTime Out For Tomorrow by Jerry Leger is out now on Latent Recordings. https://jerryleger.com\n\nAll images by Laura Proctor"}, {"url": "https://courthousebangor.com/event/jerry-leger/", "page_content": "Jerry Leger is a singer-songwriter from the East End of Toronto. He cut his first independently released album at just 19 and since then, the prolific singer-songwriter has recorded 10 additional albums under his own name, with the last 4 released via Cowboy Junkies’ label, Latent Recordings.\n\nReleased in March of 2022, Jerry’s album Nothing Pressing (produced by Michael Timmins) pairs evocative lyrics are wonderfully crafted melodies, soulful vocals and the spirit and energy of a mature songwriter. He cites the music of Hank Williams, Leonard Cohen, Elvis Costello, the Everly Brothers and Neil Young as influences.\n\n“The Gently sardonic, arch wordplay and country-rock twang recall Nick Lowe.”\n\nUNCUT"}], "Jerry Leger is from Toronto, Ontario.": [{"url": "https://www.thesoundcafe.com/post/a-conversation-with-toronto-based-singer-songwriter-jerry-leger", "page_content": "\n\n\n\nPhoto Credit: Laura Proctor.\n\n\n\n\n\n\n\n\n\nDouglas McLean chats with Toronto-based singer-songwriter Jerry Leger, for his latest Sound Cafe Podcast, 'Backstage'.\n\n\n\n\n\n\n\n\n\nYou can listen to the entire interview and music HERE\n\n\n\n\n\n\n\n\n\nBorn in the mid-80s, singer-songwriter Jerry Leger came of age in the Upper Beaches area of Toronto. Surrounded by music from a young age, his grandfather first turned him onto Hank Williams, constantly playing the youngster a plethora of the honky tonk master’s great recordings. Although Williams’ voice came from another world in terms of time, geography, and class, Leger was intrigued by the ways that Williams’ songs told a story and often conjured up mysterious images in his head.\n\nOther seminal influences were slowly added including John Lennon (and the Beatles), Bob Dylan, Lightnin’ Hopkins, Leonard Cohen, Elvis Costello, Neil Young, the Everly Brothers, Tom Waits, and Gordon Lightfoot.\n\nJerry Leger’s newest album, Nothing Pressing, released March 16th, 2022, is the best! Full of energetic and carefully crafted melodies and lyrics, Leger again displays why so many think he is one Canada’s great rock and roll artists, as well as a pre-eminent songwriter.\n\n\n\n\n\nJerry joined Douglas McLean in conversation about his career, songwriting approach and tour plans before his show on April 01, 2022 at Bracebridge Hall in Bracebridge, Ontario, Canada.\n\n​\n\n​\n\nFEATURED SONGS:\n\nKill It with Kindness\n\nA Page You've Turned\n\nThe Great Unknown\n\nHave You Ever Been Happy?\n\nNothing Pressing\n\nSurvived Like a Stone\n\nWait a Little Longer\n\n\n\n\n\n​\n\nYou can listen to the entire interview and music HERE\n\n\n\n\n\n​\n\n\n\n\n\n​\n\nWebsite: jerryleger.com\n\nBandcamp: jerryleger.bandcamp.com/music\n\nFacebook: www.facebook.com/jerrylegermusic\n\nSpotify: open.spotify.com/artist\n\n\n\n\n\n\n\n"}, {"url": "https://canadianbeats.ca/2023/02/08/jerry-leger-five-questions-with/", "page_content": "Jerry Leger unveils a 4-song EP, Live From Paradise\n\nAmericana singer-songwriter Jerry Leger has shared Live From Paradise, a four-song collection of recordings from his May 31st, 2022, show at Toronto’s stunning Paradise Theatre.\n\n“We were grateful to see a packed house in still uncertain times,” shares Jerry.\n\nThis performance ended up being Jerry’s first hometown show since Lee’s Palace in November 2019. So much had happened since that show, including a new album, Nothing Pressing (2022), and a change in the band lineup after more than a decade.\n\n“Fresh off of a 5-week European/UK tour, we had multiple things to celebrate and wanted to properly capture it,” says Jerry.\n\nThe live EP includes “The Big Smoke Blues” (watch the live video here), “With Only You”, “Factory Made,” and the album single “Corner Light.”\n\n“This is my favourite song from my Time Out For Tomorrow (2019) album and probably would have been a single if COVID hadn’t interrupted things,” shares Jerry. “Like most of the songs, it’s evolved musically in concert and the band gives it their all. I think this version really puts you into the feel and vulnerability of the lyrics.”\n\nListen to Live From Paradise below and learn more about Jerry Leger via our Five Questions With segment.\n\nCare to introduce yourself to our readers?\n\nMy name is Jerry Leger. I’m a singer-songwriter, born and raised in the east end of Toronto, where I still am.\n\nTell us a bit about your most recent release.\n\nIt’s an EP with a few tracks taken from our performance at Paradise Theatre in Toronto in May of last year. There’s also beautiful footage of it. Two videos are up on the YouTube channel now. It was our first show after a five-week European and UK tour and our first hometown performance since late 2019.\n\nWhere do you tend to pull inspiration from when writing?\n\nIt really depends. Sometimes it’s pure imagination, sometimes inspiration, sometimes real, sometimes a version of reality. I just keep my ears and eyes open. You never know when someone will say something interesting.\n\nDo you have any upcoming shows you’d like to tell us about?\n\nI’m playing a few solo shows in Ontario this March. On the 1st, I’ll be at a cool little bookstore called Sellers & Newel in Toronto that puts on shows. They kind of have a house concert vibe. I’m gonna use the opportunity to only play new songs. March 10th, I’ll be in Peterborough at Jethro’s for an early performance (6 pm-8 pm), followed by March 11th in Trenton at Old Church Theatre. Tickets are on sale now for the latter. Always love playing the Church.\n\nWhat’s your goal for 2023?\n\nSurvive and stay busy.\n\nConnect with Jerry Leger\n\nWebsite\n\nFacebook\n\nTwitter\n\nInstagram"}, {"url": "https://peoplepill.com/people/jerry-leger/", "page_content": "Jerry Leger (born April 19, 1985 Toronto, Ontario) is a Canadian singer-songwriter. Since 2005, he has released 8 acclaimed albums (4 solo, 3 credited to Jerry Leger & The Situation and 1 with his side project, The Del Fi's) and toured extensively playing shows with acts such as Ron Sexsmith, The Sadies, Jesse Winchester, Fred Eaglesmith, Danny Michel, Jill Barber, Justin Townes Earle, Deer Tick, Skydiggers, Jim Lauderdale, Dawes, Tift Merritt, Doug Paisley, among others.\n\nJerry Leger's music has been heard on CBC Radio shows (including Q, Drive, Mainstreet, Bandwidth, Shift), NPR, WSM, BBC Radio and various campus radio stations. Videos for \"You Got Away From Me\" and \"All Over again ft. Serena Ryder\" are still in rotation on Country Music Television (CMT).\n\nHis songwriting influences include Hank Williams, Bob Dylan, Lightnin' Hopkins, Elvis Costello, Buddy Holly, Gordon Lightfoot and Leonard Cohen.\n\nRon Sexsmith has called him \"One of the best songwriters I've heard in quite some time.\"\n\nCareer\n\nLeger cut his first album when he was 19 in 2005, with frequent producer/musician, Tim Bovaconti. His sophomore record, Farewell Ghost Town, followed the next year. Produced by Don Kerr and Tim Bovaconti and featuring constant Leger supporter, Ron Sexsmith on piano and Fergus Hambleton(of The Sattalites). Farewell Ghost Town was charming not only for its strong songwriting, but also in its unassuming approach.\n\nIn 2007, Leger struck up a friendship with Skydiggers co-founder, Josh Finlayson. This resulted in the 2008 album, You, Me and The Horse, co-produced by Tim Bovaconti. You, Me and The Horse garnered rave reviews and pushed Leger's career forward with appearances on the popular CBC Radio show, Q, in-sessions on the legendary WSM Radio in Nashville and The WDVX concert series, Blue Plate Special in Knoxville, TN.\n\nThe end of 2010 saw the release of Leger's 4th record, Traveling Grey. Ron Sexsmith remarked, \"Traveling Grey is probably Jerry's best record so far and he hasn't made any bad ones.\n\nTraveling Grey is Jerry Leger's fourth album and finds him poised to indelibly add his name to the roll call that has built Toronto's international reputation as a singer/songwriter Mecca. Leger revealed in Exclaim! Magazine how the record came about \"It's the most spontaneous record since my first one, which was done in two days. This one rather from when we were touring out east most of July [2010]. When I got back, I just had this bug: I need to make a record. One song was written at four a.m. the night before the sessions.\" During this time, Jerry appeared twice on Music City Roots, hosted by singer/songwriter, Jim Lauderdale, who has called Leger a great young songwriter.\n\nIn 2011, Jerry released the digital only mini album, The Good Old Days are Back in Drag. Jason Schneider at Exclaim! said \"its seven tracks crackles with the raw energy of a Sun Records single.\" The album artwork is a sketch by Leger.\n\nSome Folks Know was released near the end of 2012, showcasing his longtime backing band, The Situation (James McKie, Dan Mock, Kyle Sullivan), Ron Sexsmith reprising his role on piano and a duet with Serena Ryder. Ben Rayner of The Toronto Star called the album \"the works of a young gifted storyteller\" and \"some folks do indeed already know what he's up to. Time, Jerry. Give it time. It's coming.\"\n\nIn the summer of 2013, Leger met up with Michael Timmins, member and main songwriter in the legendary band, Cowboy Junkies. This resulted in the 2014 album, Early Riser, produced by Timmins and released on the Junkies own label, Latent Recordings, distributed by Fontana North. All Jerry's previous albums had been released independently on his own label, Golden Rocket Records (named after the Hank Snow song). The album has received high acclaim from Exclaim!, NOW, The Toronto Star, The Globe and Mail and CBC. Zachary Houle from PopMatters called the record, \"A commanding and astounding listen\" and \"deserving of any laurels and accolades thrown its way.\" It's also noted for Daniel Romano providing the album artwork/design.\n\nWinter 2015, the album Crowd Pleaser by his side project, The Del Fi's was released. It was recorded live off the floor in 10 hours with 13 musicians who barely knew or didn't know the material at all. Leger wrote all the songs, with most of them being written very quickly before going into the studio to maintain a spontaneous and loose rock 'n' roll sound. Kerry Doole at Exclaim! wrote, \"It remains something of a mystery why roots troubadour Jerry Leger hasn't made more of a mark. He regularly releases albums of a high quality, he's an engaging performer and he has earned major peer respect.\" Adding \"The record does a fine job of capturing the vitality of his band's live show...This is a crowd-pleasing addition to a worthy discography.\" Another side project appeared in 2016 stemming from The Del Fi's called The Bop Fi's featuring poetry written and spoken by Leger with a backdrop of jazz, mainly in the bebop and cool jazz style.\n\nDiscography"}, {"url": "https://www.kmuw.org/a-musical-life/2021-02-26/a-musical-life-jerry-leger", "page_content": "Jerry Leger is a singer, songwriter and poet based in Toronto, Ontario, Canada. His albums include Songs From The Apartment, Time Out For Tomorrow, and Nonsense and Heartache, among others. His latest single is “Jumped In The Humber,” which was produced by Michael Timmins of Cowboy Junkies. He is also author of Just The Night Birds, a collection of poetry.\n\n“It was The Beatles that first inspired me to write songs. It was the first music I was exposed to, because of my parents; it was really their music. But my older brothers and I raided their record collections and it's still music I love and still listen to today.\n\nAbout that time when I was a kid, my brothers were writing songs. And that was really fascinating to me. And I wanted to do that. Hank Williams was another artist I heard a lot because of my grandfather, and that had a real lasting effect.\n\nUnless I'm writing free form, poetry and lyrics can be interconnected. If a poem I'm writing has a certain flow and rhythm to it and apply it to music.\n\nWhen I'm specifically writing lyrics, it's because I have a melody in my head, and I'm writing to that or I'm writing the words and music at the same time, on a guitar or a piano, but I've also written the lyrics turned into a poem rather than a song. So they're interconnected.\n\nIf it's too hard finishing a song, I usually drop it and move on. But I mean, if it's worth working on, it's usually because there's a few lines that I can change or a chord I can flip around and [that] makes a song.”"}, {"url": "https://jerryleger.bandcamp.com/music", "page_content": "JERRY LEGER Toronto, Ontario\n\nsinger/songwriter from Toronto, Canada. Jerry Leger has been called “one of Canada’s best” by Exclaim, a “gifted storyteller” by The Toronto Star and \"One of the best Canadian songwriters\" by Rolling Stone.\n\nRon Sexsmith, Jim Lauderdale and Michael Timmins of Cowboy Junkies are known fans. ... more"}, {"url": "https://jerryleger.bandcamp.com/", "page_content": "JERRY LEGER Toronto, Ontario\n\nsinger/songwriter from Toronto, Canada. Jerry Leger has been called “one of Canada’s best” by Exclaim, a “gifted storyteller” by The Toronto Star and \"One of the best Canadian songwriters\" by Rolling Stone.\n\nRon Sexsmith, Jim Lauderdale and Michael Timmins of Cowboy Junkies are known fans. ... more"}, {"url": "https://www.datathistle.com/event/1670701-jerry-leger-and-the-situation/", "page_content": "This listing is from a previous year,\n\nsearch current listings »\n\nJerry Leger has a thing for ghosts. The Toronto singer/songwriter confirmed it a couple of years ago when he went on a personal journey to explore many of Ontario's largely unknown ghost towns, having been inspired by the writings of historian Ron Brown. Leger has immortalized one of those towns, Burchell Lake, on his new album Time Out For Tomorrow, containing 10 portraits of the impermanence of life, love, or simply catching a glimpse of a shooting star.\n\nYet, other ghosts reside much deeper in Leger's songs. Whether theyre the voices of Roy Orbison, Lou Reed, Gene Clark, Rick Danko or Ronnie Lane, they naturally complement the universal truths at the core of Jerry Leger's music, along with his undying faith in rock n roll as a way for all people to find common ground.\n\nTime Out For Tomorrow continues Leger's run of consistently high output and displays the finely honed artistic vision that has been evident since 2005 when, at age 19, he released the first of nine studio albums. Most of those listeners didnt discover Leger until his 2014 album Early Riser, his first with Michael Timmins of Cowboy Junkies handling production duties, as well as the first to be released on the Junkies label, Latent Recordings. The combination of Timmins capture-the-moment production aesthetic and the Rolling Thunder-esque chemistry of Leger's longtime band The Situation (plus a few special guests) now appears unbeatable. And although Time Out For Tomorrow may not be as expansive as Leger's previous Timmins-produced effort, the acclaimed 2017 double album Nonsense And Heartache, its more concentrated dose of everything Leger does best is just as potent.\n\nSongwriter Ron Sexsmith, and outlets such as Rolling Stone, PopMatters and the Toronto Star have sung Leger's praises. He's also shared stages with The Sadies, Justin Townes Earle, Deer Tick, Dawes, and others. Canada may be known more these days for punching above its weight in the global pop music field, but its long and storied tradition of singer/songwriters refuses to die. Jerry Leger is carrying that torch, and if there's any further proof needed that he's at the vanguard, just listen to Time Out For Tomorrow.\n\nwww.jerryleger.com www.cosmicamerican.com\n\nText supplied by third party."}, {"url": "https://jerryleger.com/2022/05/", "page_content": "Wow, thanks to everyone who came out to see us in Germany, Sweden, Norway, The Netherlands, England, Scotland and Spain. We feel truly grateful and can’t wait to come back.\n\nHere’s some reviews of the shows:\n\nKrxsset show review – Oslo, Norway (April 21)\n\n“This is a report from a fan of Jerry Leger who finally got to experience one of his great songwriting heroes live again! …had this been the only song (“John Lewis”) Jerry sang that night, it would still have been worth the entrance ticket and the trip to Oslo city center. But it was not, and the evening was not over.” https://gubberock.com/2022/04/22/jerry-leger-i-oslo/\n\nMusic Star show review – Norderstedt, Germany (April 26)\n\n“When Jerry Leger returns to Germany, please make a pilgrimage to his concerts.” https://www.soundsandbooks.com/jerry-leger-the-situation-live-in-norderstedt/\n\nDer Aa-Theater show review – Groningen, Netherlands (April 29)\n\n“It turned out to be such an inescapably catchy performance, the whole hall was in motion with the uptempo songs or hung on Leger’s lips in the more sensitive and calmer songs. The audience is drawn further and further into the show, without really having to put in any effort.” http://thenextgig.nl/jerry-leger-the-situation-zijn-onontkombaar-aanstekelijk/\n\nThe Chapel show review – Nottingham, England (May 6)\n\n“His (Jerry Leger) star continues to rise slowly. His live show proves the point. An hour of impassioned country rocking tunes, alternating with intense, almost Tom Verlaine (ish) guitar solos, his band are sublime. Just bass, drums and keyboards but filling the sound out beautifully. I urge you to check him out, you won’t regret it.” http://www.neonfiller.com/wordpress/?p=14097\n\nBroadcast show review – Glasgow, Scotland (May 7)\n\n“Leger is a force to be considered with. He looks cool, he sings brilliantly, the band are on fire and he has the songs to back all this up.” https://americana-uk.com/live-review-jerry-leger-the-situation-scott-c-park-broadcast-glasgow-9th-may-2022\n\nLoco Club show reviews – Valencia, Spain (May 11)\n\n“Impeccable execution of the instrumental performance of the four musicians on stage…almost as an intermission, the band The Situation left the scene to leave Jerry Leger alone with his acoustic guitar…playing before a silent audience, hypnotized.” http://www.clubdelospilotossuicidas.com/2022/05/18/cronica-de-conciertos-jerry-leger-the-situation-loco-club-valencia-11-05-2022/\n\n“Discovering new artists who have something to count on, melodies that even if you listen to them for the first time, you feel that they are already part of you, is not easy at all. Jerry Leger gets it. The wonderful melodies of his songs, together with the elaborate lyrics that accompany them, show us the energy and spirit of a mature composer who has grown as an artist, offering us a well-designed work full of experiences, reflections, longing and gratitude.” https://madafackismounderground.com/2022/05/17/cronica-concierto-jerry-leger-valencia/\n\nFun House show review – Madrid, Spain (May 14)\n\n“Jerry Leger is one of those whom fans would define as authentic and who, furthermore, came accompanied by three other guys who gave the concert absolute solvency.” http://www.elgiradiscos.com/2022/05/jerry-leger-situation-la-solvencia-de.html?fbclid=IwAR3IsXOYq2U4ht7D-NTChZ6XhkPuZbSM6giTVT1yIJ2aSsNnuOjYuKlJmuU\n\nNow that we’re back home in Toronto, we cannot wait for our rescheduled album release show at Paradise on Bloor, Tuesday, May 31st. All previous tickets sold will be honoured for the new date.\n\nIf you’re in town, we hope you can celebrate the record Nothing Pressing with us.\n\nTickets available here: https://www.showpass.com/jerry-leger-live/\n\nI’m also excited about some acoustic duo shows I have happening this June in Ontario. Dan Mock will be joining me on upright bass and backing vocals.\n\nSadly, we had to cancel our Eastern Canadian run due to unforeseen circumstances. We were really looking forward to heading back there but it just wasn’t in the cards this time around.\n\nWe hope to see you out at one of these intimate shows if you’re in the Hamilton, Bracebridge, Trenton and Ottawa areas"}, {"url": "https://courthousebangor.com/event/jerry-leger/", "page_content": "Jerry Leger is a singer-songwriter from the East End of Toronto. He cut his first independently released album at just 19 and since then, the prolific singer-songwriter has recorded 10 additional albums under his own name, with the last 4 released via Cowboy Junkies’ label, Latent Recordings.\n\nReleased in March of 2022, Jerry’s album Nothing Pressing (produced by Michael Timmins) pairs evocative lyrics are wonderfully crafted melodies, soulful vocals and the spirit and energy of a mature songwriter. He cites the music of Hank Williams, Leonard Cohen, Elvis Costello, the Everly Brothers and Neil Young as influences.\n\n“The Gently sardonic, arch wordplay and country-rock twang recall Nick Lowe.”\n\nUNCUT"}, {"url": "http://www.permafrost.today/2021/01/22/jerry-leger-with-a-deluxe-edition-of-2019-album/", "page_content": "www.permafrost.today is not found\n\nwww.permafrost.today is not found in the configuration on this server. It might be because of a newly changed or wrong DNS pointer, or a reconfiguration of the server.\n\n\n\nPlease contact customer support if the problem persists."}]}