{"Jerry Leger has been described as a 'roots-rock troubadour'.": [{"url": "https://tinnitist.com/2022/03/18/albums-of-the-week-jerry-leger-nothing-pressing/", "page_content": "T HE EDITED PRESS RELEASE: “Written during the pandemic, Nothing Pressing isn’t the only thing has kept singer-songwriter Jerry Leger busy while off the road. In 2020 he published his first book of poetry Just the Night Birds and made a film for his mailing list subscribers titled The Apartment Show He Never Gave, while releasing what he termed a “surprise” album, Songs From The Apartment.\n\nSongs From The Apartment was a stripped-down lo-fi affair recorded in his home using a cheap tape recorder with an internal microphone. Two songs from Nothing Pressing — Underground Blues and Sinking In — were also recorded in Leger’s home, this time using two Shure SM58 microphones fed into his vintage 1981 Tascam 4-track tape recorder. The remaining nine tracks included on Nothing Pressing present Leger’s work in two starkly contrasting soundscapes. Nothing Pressing, Protector and Still Patience are solo acoustic recordings cut live in the studio with little embellishment save Dan Mock’s overdubbed harmony vocals and, on the title track, producer (and Cowboy Junkies guitarist) Michael Timmins’ ukulele. The other six tracks are prime roots rock ’n’ roll featuring his long-time band The Situation (drummer Kyle Sullivan and bassist Mock). Among the latter songs, Kill It With Kindness and Have You Ever Been Happy? have the kind of drive, energy and spirit that are sure to make them highlights of his future live shows.\n\nLeger often times finds himself at a loss as to explain the source of his songs. He feels his songwriting, while clearly drawing on experiences filtered through a panoply of influences, often verges on being a supernatural experience. Over the course of the 11 songs on Nothing Pressing, the songwriter’s songwriter engages with questions of existence, mortality, hope, trust, and heartbreak while simultaneously conjuring feelings of isolation, reflection, longing, and gratitude. Paired with such evocative lyrics are wonderfully crafted melodies, soulful vocals, and the spirit and energy of a mature songwriter, comfortable in his skin and growing as an artist with every release. Nothing Pressing serves a wonderfully refreshing tonic in troubling times.\n\nBorn in the mid-’80s, singer-songwriter Leger came of age in the Upper Beaches area of Toronto. Surrounded by music from a young age, his grandfather first turned him on to Hank Williams, constantly playing the youngster a plethora of the honky-tonk master’s great recordings. Although Williams’ voice came from another world in terms of time, geography, and class, Leger was intrigued by the ways that Williams’ songs told a story and often conjured up mysterious images in his head. Other seminal influences were slowly added, including John Lennon (and The Beatles), Bob Dylan, Lightnin’ Hopkins, Leonard Cohen, Elvis Costello, Neil Young, The Everly Brothers, Tom Waits and Gordon Lightfoot.\n\nIn 2005, as Leger turned 19, he cut his first independently released album. In the 16 years since then the multi-talented singer-songwriter has recorded nine additional studio albums as well as one live compilation under his own name. In 2014 he was signed to the Cowboy Junkies’ label Latent Recordings, releasing the critically acclaimed Early Riser that same year. His second Latent release, Nonsense and Heartache, followed in 2017. A year later the two-album set was picked up for distribution in the U.K and Europe, leading to extensive touring throughout the continent, opening up a whole new audience for Leger’s finely crafted songs. With his next album, 2019’s Time Out For Tomorrow, Leger began to receive positive notices in high-profile music magazines.\n\nA restless hungry spirit, when not performing and recording under his own name, Leger stays busy with a plethora of side projects including The Del Fi’s (who play loose, improvisatory rock ’n’ roll) and The Bop Fi’s (which features Leger reciting his poetry over jazz accompaniment). He has also been known to work under the pseudonym Hank Holly (bonus points go to those who can figure out where that name came from!).”"}, {"url": "https://spillmagazine.com/album-review-jerry-leger-early-riser/", "page_content": "Jerry Leger\n\nEarly Riser\n\nLatent Recordings\n\n\n\nEarly Riser marks Jerry Leger’s seventh album in less than 10 years and it’s clear that he’s a man on a mission to reinvigorate the Canadian Roots Rock landscape for the better. When listening to his latest release, artists like The Cash Brothers, The Sadies and Dustin Bentall come to mind as the songs deliver a serious Canadiana vibe from melody to lyrics. It’s the kind of album that you’ll want to spin for a long drive through the prairies on a cross-country trek; it could easily be put on repeat without wearing thin. Along with an enviable cast of studio musicians that appear on the album, Leger commissioned the seasoned production skills of Michael Timmins (Cowboy Junkies), a man who has been around the hit-single block a few times and was the perfect fit to put this album in its proper place. These amazing songs shine with tasteful injections of fiddle, pedal steel, keys, gospel backup vocals and much more – while never overdoing any of the above –giving each song its own persona. Early Riser’s overall package is so easy to take in.\n\nStandout tracks include the opener, “Factory Made”, a dramatic song with heavy bass lines that push the tune into dark places, keeping a continuity of beauty and subtle messages of life perspective and personal strife. Not only does this song set the bar extremely high for the remainder of the album, it also has a super catchy chorus that sticks. “Nobody’s Angel” is another track that caught my attention; it’s a sweet ballad of a young woman whose compromised lifestyle is something of a never-ending tragedy. The meandering and subtle piano mixed with tremolo guitars and Leger’s velvety emotional voice really lays down a heavy mood. I could listen to this song with a drink in hand and sob my eyes out. Moving on, “She Ain’t My Woman and I Ain’t No Woman’s Man” is a cool Dylan-esque tune with loads of percussion and a strong set of lyrics. This tune paints a picture of a rough and tumble troubadour with more than one lover; it’s certainly one of the album’s highlights.\n\nOverall we have a VERY impressive release here, something the band and contributing players should be very proud of. I certainly look forward to hearing these songs live.\n\nAndre Skinner (Twitter @andreskinner)\n\nhttp://latentrecordings.com/jerryleger/"}, {"url": "https://www.fyimusicnews.ca/articles/2019/11/06/five-questions-%E2%80%A6-jerry-leger", "page_content": "On his new album Time Out For Tomorrow, released Nov. 8, Toronto singer/songwriter Jerry Leger continues his consistently high output that began in 2005 when, at age 19, he released the first of nine studio albums. It’s added up to a body of work that was recently celebrated with the European-only compilation Too Broke To Die, aimed at Leger’s growing fan base in Britain and the EU.\n\nMost of those listeners didn’t discover Leger until his 2014 album Early Riser, his first with Michael Timmins of Cowboy Junkies handling production duties, as well as the first to be released on the Junkies’ label, Latent Recordings. The combination of Timmins’ capture-the-moment production aesthetic and the Rolling Thunder-esque chemistry of Leger’s longtime band The Situation (plus a few special guests) now appears unbeatable.\n\nIndeed, Time Out For Tomorrow finds Leger at the peak of his writing powers right from the opening track Canvas Of Gold, on which he laments Toronto’s gentrification projects that have put pressure on the city’s artistic communities. He also takes aim at tensions stoked by hate groups on the inspiring ballad That Ain’t Here, although his love of early rock ‘n roll shines brilliantly on Read Between The Lines.\n\nTime Out For Tomorrow may not be as expansive as Leger’s previous Timmins-produced effort, the acclaimed 2017 double album Nonsense And Heartache, but its more concentrated dose of everything Leger does best is just as potent. Jerry Leger officially launches Time Out For Tomorrow in Toronto on Nov. 28 at Lee’s Palace, followed by shows in Hamilton at Mills Hardware on Nov. 29 and in Montreal at Quai des Brumes on Nov. 30. More details here .\n\nWhat was the process like making Time Out For Tomorrow and how does it stand apart from your previous work?\n\nI definitely felt the most focused on this record in terms of how I wanted it to sound than on other albums I’ve made. I usually like to go in and just see what happens. There was a bit of that still, but I did have an idea of how I wanted the songs executed.\n\nWhat songs on the record are you most proud of and why?\n\nI love I Would because it's a simple and sweet little song. That Ain't Here feels like it's been around forever and I stumbled upon it. It touches on my feelings of confusion on why the world needs to be the way it is. What's so funny about peace, love and understanding, right? I also like Corner Light because it’s the most ambitious song on the record and it came out exactly the way I wanted it to.\n\nWhat's your best touring story?\n\nThere are a lot, and they usually randomly come back to me. Being on Neil Young's bus after opening for Pegi Young & The Survivors was pretty cool. Pegi was real sweet, as was the band. Her bass player Rick Rosas, who has also sadly passed away, was the one who invited me on the bus. He dug our set and grabbed an album. It was wild to sit there hanging out, eating A&W, watching a Highwayman DVD and chatting with [keyboardist] Spooner Oldham across from me!\n\nAnother one that comes to mind was playing a festival in Manitoba that also had Toby Keith or Tim McGraw on it—I can’t remember which. We were watching their set and convinced some of the audience members around us that we were his backing band that he’d just fired. And on Canada Day to boot! We took photos with some of them.\n\nWhat are your fondest musical memories as you were growing up?\n\nListening and singing along to The Beatles, John Lennon, Rodney Crowell, and others on drives with my family when I was a kid. I also fondly recall staying after class in high school and teaching myself how to play piano in the music room and the auditorium. Employees would just be cleaning up and vacuuming around me. And I’m proud to say that the first proper concert I saw was Chuck Berry. He was still great, even at that age, and his pickup band that night seemed pretty good too.\n\nWhat do you recall about your first time performing in public?\n\nIt was an old stage at a coffee shop down the street from where I grew up. Some of my school friends came to see me. I think I was 14. I played a couple of my own songs, a Dylan song and a Neil Young song. I remember it felt so good to be playing in front of people instead of the wall. I think it was the least nervous I've ever been playing in front of people. I just wanted to do it so badly, to know how it felt. I ended up getting my own night there every Wednesday for the rest of high school. There was no PA so it forced me to learn how to project my voice and my playing.\n\nFacebook / Instagram: @ jerrylegermusic\n\nTwitter: @ jerryleger\n\nLabel: Latent Recordings"}, {"url": "https://exclaim.ca/music/article/jerry_leger-traveling_grey", "page_content": "Jerry Leger Traveling Grey\n\nPublished Jan 24, 2011\n\nThis is the fourth album from hardworking Toronto, ON troubadour Jerry Leger, and it deserves to bring him wider recognition. He has flown a little under the Canadian roots scene radar, but has earned the respect of such peers as Ron Sexsmith, Fred Eaglesmith and Jim Lauderdale. The fact that he's made an impact in Nashville and the South is revealing, likely attributable to his \"old school\" approach to songwriting. Not many young songsmiths can use a '60s word like \"babe\" convincingly, but Leger can. His expressive vocals are always front and centre, though he's more than ably accompanied by a fine band, including guitarist/album producer Tim Bovaconti (Sexsmith) and fiddler/multi-instrumentalist James McKie. Leger's lyrics are imaginative, fusing folk and country elements seamlessly. There's nice diversity to the tempos and tones. \"Dreamer, Pretender,\" the title track, and \"Is He Treating You Good?\" are primarily solo and acoustic, while \"Whistling That Lonesome Tune\" is built upon melancholy piano. By contrast, there's a robust full band feel to \"Truth is All Around You\" and \"John Lewis.\" At 25, Leger clearly has a bright future ahead of him.It is the most spontaneous record since my first one, which was done in two days. When I got back from touring out East last July, I just had this bug: \"I need to make a record.\" Initially, I wanted to make a full band record with lots of energy, like we do live. On the other hand, I had all these other songs written that I really loved. It was much easier to just go into Tim Bovaconti's studio and knock this album out. The band are on half and the other half is me with tickles of other instruments. Everything happened really quickly and there weren't really even any demo sessions. \"Truth is All Around You\" was written at four a.m. the night before the sessions. You can hear that everybody is just finding that song at that moment.I'm in no way knocking Toronto or Canada, but it feels that I don't need any gimmicks down there. In the States, they're very curious about where the songs come from ― my music doesn't have any gimmicks and I can't make up any. To me, music scenes are kind of weird ― some of the best songwriters always felt on the outside; I always did, even when I was starting in folk clubs at 17. I'd just go there to play my songs and see what happened. I had no desire to be accepted in any circle. I'm excited that some kid will discover what I'm doing then find out I have six albums. I feel I'm building a story.It's a little too early, in terms of reviews. I gave Ron Sexsmith an advance copy and the first thing he said to me was, \"I think this is the best record you've made.\" People have said it's the best I've ever sounded, vocally. I'm like, 'Okay, sure.' It felt good, but I never thought, \"I'm singing or writing better than ever.\" At this point, I feel I made a good record, but getting validation from people I respect is great. You never quite know what people will make of it, but you can't really care about that kind of thing.That'd make sense. It's the most spontaneous record since my first one, which was done in two days. This one rather came about from when we were touring out east most of July [2010]. When I got back, I just had this bug: I need to make a record. Initially, I wanted to make a full band record with lots of energy, like we do live. But to record a full band album a lot more has to go into it, and a huge budget, if you want to do it properly. On the other hand, I had all these other songs written that I really loved. I had in my mind putting two records out, but that's a rather stupid idea these days. For this one, it was much easier to just go into Tim Bovaconti's studio and knock this album out. The band are on half the album and the other half is me with tickles of other instruments. The band didn't even know about these other songs. Everything happened really quickly. The past couple of records were more thought out. There weren't really even any demo sessions for this album. One song was written at four a.m. the night before the sessions. After a show at the Cameron, I got home and had this idea in my head. It's the first song on the album, \"Truth is All Around You.\" You can hear that everybody is just finding that song at that moment; I like that about it. \"John Lewis\" is the only song that had been in our set for a year or so, and that's the biggest band arrangement on the album. I think it's a great little record, but I'm already itching to do another one. That is just how I am: constantly writing and wanting to lose money. I think this is a good progression from the last record and to the full band record we will eventually make.He's great; we've worked together on all my records. He adapts very well. Every time I make a record it's a little bit different. The first record was pretty energetic, like Dylan with a little Clash almost. The second was leaning more towards adding those country influences, thenis an acoustic record. He has adapted well to all those scenarios. I see no point in not working with him on anything. Certain artists have producers like that. I'm sure I won't make every album with him, but there'd have to be some reason not to.Yes I would. With this record there are a few songs where I had certain ideas, like on one song where Tim, not my drummer Kyle, plays percussion. He also played piano on \"Wrong Kind of Girl.\" It was actually the first time he'd played piano in front of an audience when we did that song at our Hugh's Room release show recently. He did a great job; I'm really happy with how everybody played. My drummer, Kyle, has been with me since the beginning [in] 2004. The other guys, it was from the last record.Whenever I write, I never have it in mind whether it should be acoustic or for the band, I just write them. For the most part, I try them all with the band. With these songs, they were just there; I never really played them live even. I always feel my songs are adaptable. I feel like all these songs could be played by the band. I like the two different worlds: that someone could listen to this record and hear songs a little more in their natural state, then come and see us live and go, \"Oh, there are colours in it.\" That excites me ― changing things up ― even if that can piss some people off. I even like screwing up songs. That's exciting.Yes, they were. Only two are a year or more old. A couple were written on the road as we were out East last summer, scribbled in the car or at the motel. \"Wrong Kind of Girl\" was written like that. It starts off as that sort of classic '50s, \"make that girl mine\" [song] then it turns out that it's not going to work out, but that's okay 'cause she's actually wrong for this world.Yes, I like to keep active. I remember Ron Sexsmith saying once that he tries to write every day. I think it's great to do that ― not to force it, but to have something on hand. As a creative person, a writer, you always have these lines floating around. Obviously it is not always good, but I think it's a good idea to keep writing. I'm still young, but I've never had writer's block. I feel that is a good way to keep it off. If your mind is constantly active, there's always going to be something. I hope I don't have to deal with it. Woody Allen has never had writer's block, but it's not always good. Or Neil Young. Still, I can't wait to make a really bad record; I'm excited to do that. Like Dylan and, though it has \"Brownsville Girl\" on it, and that's a great song. With Dylan and Lennon, I really respect their not-so-great albums. The first album I bought with my own money was when I was eight, growing up in Lindsay, Ontario, and I bought. I can't wait to make one of those indifferent albums. It can be fun to see how much someone dislikes something and why.I'd have had more, but I didn't have enough money. I'd have had an album out every year if I could. There were albums in 2005 and 2006, '07 was a weird year for me, then 2008. I already have a backlog even though I'm a beginner, in some ways. The Beatles did two a year; I'd love to have another album out in 2011. This will be out on vinyl in the spring, and that's exciting.[I'm] in no way knocking Toronto or Canada, but it feels that I don't need any gimmicks down there. For decades, people have grabbed your attention through a hype machine and it has paid off, but my music doesn't have any gimmicks, and I can't make up any. To me, music scenes are kind of weird. Some of the best songwriters always felt on the outside. I always did, even when I was starting in folk clubs at 17; I felt outside of that clique. I'd just go there to play my songs and see what happened. I had no desire to be accepted in any circle. I feel that going to the States, the musicians I've met down there, it's kind of the same thing. In the long run, I think it's exciting 'cause there might be a kid who discovers what I'm doing and then finds out, \"Oh, he's got six albums.\" I always loved discovering artists then finding they'd been building a story. I feel I'm building a story; I don't mind the hard work. So, yes, I like the States. They have had open arms; they're very curious about where the songs come from. I just feel a lot of warmth down there. I'm going back to the States next month. This time, it'll be a little more financially rewarding, as it's our third trip down; I got guarantees, stuff like that. There's been warmth in Canada as well and I'm sure there are other parts of Canada I haven't been to where I may have big fans and I just don't know it. That's one of the exciting things about touring. I also love that people who are big fans, who come and see us and send emails, some have been with us since the beginning. I don't write songs that are somehow of the moment or for a particular person. I think they're songs you can grow old with. They're not directed at a certain demographic.Music City RootsYes, it was amazing ― just seeing all the photos on the wall was crazy. Of course, you see the poster boy: Hank Williams. It was a lot of fun too and I'll be doing that again soon. The host, Jim Lauderdale [a noted Americana artist], was super-nice, a great guy. He gave me a record and signed it, saying I was a great writer. He didn't have to say that. He made us feel really at home. It's a big show, and here I am, this young guy from Toronto. Lots of those big Nashville staff writers were there and they really liked what I was doing. It's a different side to the way they write. The show is filmed too, so you can see it on YouTube.Yes, a lot of it got destroyed. I got the audio recording of the interview and songs, but the film was lost.Yes, a concert show called. It was cool. They have plates all over the studio walls. Fred Eaglesmith was on there, lots of bluegrass artists. But they stopped making the plates as they ran out of space. I didn't get a plate, so I was sad about that. I'm excited to see how they react to this record, but I'm also excited to see how Canada reacts when we go out. I know it's a good record. There's nothing crazy about it; it's a bunch of songs that I think are great ― no crazy science behind it.I know we're doing the Dauphin country fest in Manitoba. We'll do the Eaglesmith picnic again; it was great fun last year, a really comfortable festival, everybody just wanted to hang out. After the music, we still played in our tent area. I had a blast. Other festivals say we are on their shortlist.For sure, I'd love that. I've just started playing with the idea of getting a publisher on board. These are worlds I'm not really familiar with, and that world has changed a lot. Now, it seems everybody wants to write, even if they shouldn't. I definitely feel these records could make their mouth water, but who knows. (Independent)"}, {"url": "https://exclaim.ca/music/article/jerry_leger-early_riser", "page_content": "Jerry Leger Early Riser\n\nPublished Apr 18, 2014\n\n8\n\n\"Feel like a problem, feel like a smoker's cough/ Thumbing my way from town to town, trying to shake it off.\"On his seventh record in nine years, Americana wunderkind Jerry Leger sounds nearly as wizened as a late-career troubadour. And yet, at 29 years of age, the truth is that the Toronto native's only getting started. Signs are everywhere on this terrific new album, his best yet, that his already impressive knack for songcraft is evolving, maturing into something remarkable. A few missteps aside, it's almost there. What we hear onis the sound of a good singer-songwriter making the leap into great territory, and mostly sticking the landing.The eight songs between noir-soaked opener \"Factory Made\" and the wistful, affirming title track range from blues workouts (\"She Ain't My Woman\") to effortless country (\"Cashing In\") to rousing gospel-tinged soul (\"To Let Me Go\"). Throughout, Leger infuses these old forms with new blood; his tight band (The Situation) pulls us in, but his thoughtful, wise lyrics are the glue that keeps us there. Leger's high, brittle voice — think Mark Olson of the Jayhawks crossed with a young Rodney Crowell — is the perfect conduit for these lonesome stories and heartfelt pleas.Credit should go to producer Michael Timmins (Cowboy Junkies), whose ear for rich melody and honest vocals is legendary in Canada's roots music circles (and beyond), for finding just the right sonic landscape for Leger's songs. After all, this is the man who, back in 1992, helped introduce a pretty obscure Texas singer-songwriter named Townes Van Zandt to Canadian audiences. Timmins knows singer-songwriters, is what I'm saying. In Leger, he's found one of Canada's best.. ( Latent"}, {"url": "https://www.fyimusicnews.ca/articles/2020/08/10/jerry-leger-halfway-til-gone-feat-don-stevenson", "page_content": "Jerry Leger: Halfway 'Til Gone- feat. Don Stevenson (Independent): This brand new track is a collaboration between two lifers whose passion for music shines bright. At 35, Toronto roots troubadour Jerry Leger can almost be termed a veteran already, given an extensive discography well into double figures. At more than double his age, Don Stevenson continues to perform regularly, often as a TTC busker. He found fame as a drummer, vocalist and songwriter in legendary ‘60s San Francisco psychedelic band Moby Grape, and is now a Toronto resident and Canadian citizen.\n\nStevenson adds sweet harmony vocals to this new Leger original. Halfway 'Til Gone has a melancholy tinge reflecting the theme of love on the rocks – “you were tracking in the mud, sneaking in from a room of love.” Leger’s songwriting and vocal performance are typically strong, while the instrumentation and production work of his longtime collaborator, Tim Bovaconti (Ron Sexsmith, Burton Cummings), is first-rate.\n\nIn a press release, Leger notes that “I had this heartbreak song floating around and I wanted to do it with a kind of Everly Brothers feel. I thought Don and I could sing it really nicely together, and thankfully he dug the tune and was into the idea. I thought it would be perfect and comfortable to do it at Tim Bovaconti's studio with Tim producing.\"\n\nBovaconti had introduced Leger to Stevenson, and a close musical and personal bond quickly developed. \"If you look closely at some of the photos from my Moby Grape days, I look a lot like Jerry,\" says Stevenson. \"He is definitely from the same vibe and is all about the music. Halfway 'Til Gone has that Leger feeling and hanging out with him and Tim Bovaconti at Tim's Garage studio making music is my idea of fun.\"\n\nLeger recalls, \"When I finally got to see Don play, I was first struck by how great and pure he still sounded after all these years; and then by what a great guy he was. I admire that he’s still playing music with the same passion and love that he had for it at my age. We talked, and the more we talked we found we spoke the same language and dug a lot of the same music!”\n\nJerry Leger has released over a dozen critically acclaimed albums since 2005, including the recent Time Out For Tomorrow (2019), produced by Michael Timmins of Cowboy Junkies and released on his label, Latent Recordings. That release was acclaimed by such publications as Rolling Stone in Europe, Uncut, and American Songwriter. Leger is actually better known in Europe and the UK than the rest of Canada, a situation that needs to be rectified, given his serious talent.\n\nLinks\n\nWebsite - Jerry Leger\n\nWebsite -Don Stevenson\n\nFacebook - Jerry Leger\n\nFacebook - Don Stevenson\n\nTwitter\n\nInstagram\n\nPR: Tony Bonyata, Pavement PR"}, {"url": "https://peoplepill.com/people/jerry-leger/", "page_content": "Jerry Leger (born April 19, 1985 Toronto, Ontario) is a Canadian singer-songwriter. Since 2005, he has released 8 acclaimed albums (4 solo, 3 credited to Jerry Leger & The Situation and 1 with his side project, The Del Fi's) and toured extensively playing shows with acts such as Ron Sexsmith, The Sadies, Jesse Winchester, Fred Eaglesmith, Danny Michel, Jill Barber, Justin Townes Earle, Deer Tick, Skydiggers, Jim Lauderdale, Dawes, Tift Merritt, Doug Paisley, among others.\n\nJerry Leger's music has been heard on CBC Radio shows (including Q, Drive, Mainstreet, Bandwidth, Shift), NPR, WSM, BBC Radio and various campus radio stations. Videos for \"You Got Away From Me\" and \"All Over again ft. Serena Ryder\" are still in rotation on Country Music Television (CMT).\n\nHis songwriting influences include Hank Williams, Bob Dylan, Lightnin' Hopkins, Elvis Costello, Buddy Holly, Gordon Lightfoot and Leonard Cohen.\n\nRon Sexsmith has called him \"One of the best songwriters I've heard in quite some time.\"\n\nCareer\n\nLeger cut his first album when he was 19 in 2005, with frequent producer/musician, Tim Bovaconti. His sophomore record, Farewell Ghost Town, followed the next year. Produced by Don Kerr and Tim Bovaconti and featuring constant Leger supporter, Ron Sexsmith on piano and Fergus Hambleton(of The Sattalites). Farewell Ghost Town was charming not only for its strong songwriting, but also in its unassuming approach.\n\nIn 2007, Leger struck up a friendship with Skydiggers co-founder, Josh Finlayson. This resulted in the 2008 album, You, Me and The Horse, co-produced by Tim Bovaconti. You, Me and The Horse garnered rave reviews and pushed Leger's career forward with appearances on the popular CBC Radio show, Q, in-sessions on the legendary WSM Radio in Nashville and The WDVX concert series, Blue Plate Special in Knoxville, TN.\n\nThe end of 2010 saw the release of Leger's 4th record, Traveling Grey. Ron Sexsmith remarked, \"Traveling Grey is probably Jerry's best record so far and he hasn't made any bad ones.\n\nTraveling Grey is Jerry Leger's fourth album and finds him poised to indelibly add his name to the roll call that has built Toronto's international reputation as a singer/songwriter Mecca. Leger revealed in Exclaim! Magazine how the record came about \"It's the most spontaneous record since my first one, which was done in two days. This one rather from when we were touring out east most of July [2010]. When I got back, I just had this bug: I need to make a record. One song was written at four a.m. the night before the sessions.\" During this time, Jerry appeared twice on Music City Roots, hosted by singer/songwriter, Jim Lauderdale, who has called Leger a great young songwriter.\n\nIn 2011, Jerry released the digital only mini album, The Good Old Days are Back in Drag. Jason Schneider at Exclaim! said \"its seven tracks crackles with the raw energy of a Sun Records single.\" The album artwork is a sketch by Leger.\n\nSome Folks Know was released near the end of 2012, showcasing his longtime backing band, The Situation (James McKie, Dan Mock, Kyle Sullivan), Ron Sexsmith reprising his role on piano and a duet with Serena Ryder. Ben Rayner of The Toronto Star called the album \"the works of a young gifted storyteller\" and \"some folks do indeed already know what he's up to. Time, Jerry. Give it time. It's coming.\"\n\nIn the summer of 2013, Leger met up with Michael Timmins, member and main songwriter in the legendary band, Cowboy Junkies. This resulted in the 2014 album, Early Riser, produced by Timmins and released on the Junkies own label, Latent Recordings, distributed by Fontana North. All Jerry's previous albums had been released independently on his own label, Golden Rocket Records (named after the Hank Snow song). The album has received high acclaim from Exclaim!, NOW, The Toronto Star, The Globe and Mail and CBC. Zachary Houle from PopMatters called the record, \"A commanding and astounding listen\" and \"deserving of any laurels and accolades thrown its way.\" It's also noted for Daniel Romano providing the album artwork/design.\n\nWinter 2015, the album Crowd Pleaser by his side project, The Del Fi's was released. It was recorded live off the floor in 10 hours with 13 musicians who barely knew or didn't know the material at all. Leger wrote all the songs, with most of them being written very quickly before going into the studio to maintain a spontaneous and loose rock 'n' roll sound. Kerry Doole at Exclaim! wrote, \"It remains something of a mystery why roots troubadour Jerry Leger hasn't made more of a mark. He regularly releases albums of a high quality, he's an engaging performer and he has earned major peer respect.\" Adding \"The record does a fine job of capturing the vitality of his band's live show...This is a crowd-pleasing addition to a worthy discography.\" Another side project appeared in 2016 stemming from The Del Fi's called The Bop Fi's featuring poetry written and spoken by Leger with a backdrop of jazz, mainly in the bebop and cool jazz style.\n\nDiscography"}, {"url": "https://www.greennote.co.uk/production/jerry-leger/", "page_content": "JERRY LEGER: Born in the mid-80s, singer-songwriter Jerry Leger came of age in the East End of Toronto. Surrounded by music from a young age, his grandfather first turned him onto Hank Williams. Leger was intrigued by the ways that Williams’ songs told a story and often conjured up mysterious images in his head. Other seminal influences were added including John Lennon (and the Beatles), Bob Dylan, Lightnin’ Hopkins, Leonard Cohen, Elvis Costello, Neil Young, the Everly Brothers, Tom Waits, and Gordon Lightfoot.\n\nIn 2005, a nineteen year old Leger cut his first independently released album. Since then, the prolific singer-songwriter has recorded10 additional albums under his own name, with the last 4 released via Cowboy Junkies’ label, Latent Recordings.\n\nReleased in March of 2022, Jerry’s album Nothing Pressing (produced by Michael Timmins) received positive notices in such music magazines as Uncut and Rolling Stone. Paired with such evocative lyrics are wonderfully crafted melodies, soulful vocals and the spirit and energy of a mature songwriter, comfortable in his skin and growing as an artist with every release. Leger and his band supported the album with a successful European and UK tour, before returning to Toronto for a packed hometown show at Paradise Theatre. This performance was captured on tape and film, resulting in the EP Live From Paradise released at the beginning of 2023.\n\n“Jerry Leger has that spark in him that all the great songwriters have. He’s the real deal.” RON SEXSMITH\n\n“The Gently sardonic, arch wordplay and country-rock twang recall Nick Lowe.” UNCUT\n\nDoors open 7pm, Music starts 8.30pm. The venue is mixed seated and standing. Tables are limited, and available on a first come first served basis, so if you’d like a seat, we recommend arriving early!"}, {"url": "https://www.rootsmusic.ca/2019/11/02/jerry-leger-talks-about-his-new-album-time-out-for-tomorrow/", "page_content": "Jerry Leger took some time out of his busy schedule to chat with Roots Music Canada about his love of vinyl, his career, and his forthcoming release, Time Out For Tomorrow, available on vinyl Nov. 8 on Latent Recordings.\n\nJerry is a critically acclaimed Canadian singer/songwriter that’s clearly ahead of his time. He started releasing his albums on vinyl as early as 2010’s Travelling Grey.\n\n“I’ve been buying vinyl since I was a little kid,” he said. “The first album I bought when I was eight was John Lennon’s Mind Games album. When I was about five or six, my Dad gave me a stack of records and a record player, and that started me off. I love records. There’s just something about it that you don’t get from listening to stuff digitally. It’s hard to hand down files to your kids. I like listening to albums from start to finish.”\n\nJerry’s debut album was released in 2005 when he was still a teenager. He admitted that he often felt like an outsider while coming of age in Toronto’s East End.\n\n“Growing up and still living in the East End of Toronto you’re very separated from where the action is, and those scenes,” he said. I remember feeling very kind of not part of people’s treehouses, or on the outside looking in when I would go downtown. I was never in the cool groups. I was never invited into those circles. I always felt very separated from that living in the East End.”\n\nBut Jerry’s love of music would force him out of his comfort zone resulting in him sneaking into Toronto bars to perform when he was just 17 years old. It also resulted in him meeting another eastender, producer and musician Tim Bovaconti, who ended up opening a lot of doors for the artist. Tim would go on to produce or co-produce Jerry’s first five albums.\n\nJerry’s East End lifestyle did lead to a chance meeting with another famous Canadian artist.\n\n“Ron (Sexsmith) used to live in the East End,” he said. “The first time I met him was when I was working at Home Hardware and he would come in, and of course, I knew who he was. I gave him a demo CD, and he actually listened to it and liked it and gave some cool feedback.”\n\nRon Sexsmith would end up performing on Jerry’s sophomore album 2006’s Farewell Ghost Town and again on 2012’s Some Folks Know.\n\nJerry’s incredibly tight backing band is known as the Situation. Jerry’s high school friend, drummer Kyle Sullivan, appeared on his debut album and has remained a member of the Situation ever since. By Jerry’s third album, 2008’s You, Me and the Horse, Jerry and Kyle were joined by guitarist James McKie and bassist Dan Mock, forming the lineup that remains over twelve years later.\n\nJerry explained, “We’re friends and we get along. That’s a big part of it. We’re all invested in a way in bringing something honest, whatever ‘honest’ means. Maybe the word ‘honest’ isn’t honest, but whatever ‘honest’ means, in what we’re doing, that’s what we’re trying to bring to people. And I think we all personally get off on that. Especially when other people get into it.”\n\nSo, it’s no surprise that when I caught Jerry and the Situation’s late-night set on the closing night of the second annual Troubadour Festival in Barrie, ON last month, I saw a well-oiled machine that continues to enjoy playing music together and playing music in front of an audience. The band’s set included several songs from Jerry’s forthcoming album Time Out For Tomorrow.\n\nUnlike 2017’s double LP Nonsense and Heartache, Time Out … isn’t a concept album, Jerry said.\n\n“You let the music go in whatever direction it wants to go for that time period. The next record, I don’t know what it’s going to sound like. I don’t think always under the same umbrella. Some songs are more observational. Some songs have a piece of my life in it just ’cause you can’t always help it.”\n\nTogether with producer Michael Timmins (Cowboy Junkies), Jerry and his band would record 20 songs, finally settling on 10 that would form the album version. Most of the songs were written specifically for Time Out For Tomorrow, with the exception of “Tell A Lie.” While it was originally recorded during 2017’s Nonsense and Heartache sessions, Jerry didn’t feel that it fit the concept for that album. Thankfully, when it came time to record his next album, he found the right place for the song and re-recorded it for Time Out For Tomorrow.\n\nThe last song to be written for Time Out For Tomorrow would turn out to be the first track on the album, “Canvas Of Gold,” a beautiful, well-crafted song that perfectly sets the tone for the entire album.\n\n“Burchell Lake” was inspired by Ghost Towns of Ontario: Field Guide Vol. 2., a book by Canadian author Ron Brown. The song is about the town of Burchell Lake, an actual ghost town located southwest of Thunder Bay, ON.\n\n“Nobody knows Ontario like Ron Brown,” Jerry explained. He’d owned the book for several years and, while he hasn’t been able to visit Burchell Lake, it did inspire him to embark on a ghost town road trip down Highway 7 all the way to Ottawa a few years ago.\n\nI’m fortunate enough to own five of Jerry Leger’s albums, and after listening to Time Out For Tomorrow, I felt compelled to listen to his previous albums to try and hear if and how Jerry has evolved as a songwriter and performer.\n\nIn my opinion, Jerry Leger’s greatest strength is his songwriting. It’s been strong for years and Time Out For Tomorrow is another great example of that strength. It features lyrics and arrangements that don’t feel the least bit contrived or formulaic. Jerry chooses not to be constricted by rigid song structure, in favour of letting the feel of the song dictate how it will unfold. The result is a fantastic album that easily engages the listener from start to finish.\n\nI certainly lost myself during Jerry Leger’s Troubadour Festival set and again when I previewed my advance copy of his forthcoming album. If you’re looking to escape into honest stories told through song I’d highly recommend Jerry Leger and the Situation’s Time Out For Tomorrow.\n\nIf you are enjoying this content, please take a second to support Roots Music Canada on Patreon!"}, {"url": "https://jerryleger.com/about/", "page_content": "Bio\n\nBorn in the mid-80s, singer-songwriter Jerry Leger came of age in the Upper Beaches area of Toronto. Surrounded by music from a young age, his grandfather first turned him onto Hank Williams, constantly playing the youngster a plethora of the honky tonk master’s great recordings. Although Williams’ voice came from another world in terms of time, geography, and class, Leger was intrigued by the ways that Williams’ songs told a story and often conjured up mysterious images in his head. Other seminal influences were slowly added including John Lennon (and the Beatles), Bob Dylan, Lightnin’ Hopkins, Leonard Cohen, Elvis Costello, Neil Young, the Everly Brothers, Tom Waits, and Gordon Lightfoot.\n\nIn 2005 as Leger turned nineteen he cut his first independently released album. In the sixteen years since then the multi-talented singer-songwriter has recorded nine additional studio albums as well as one live compilation under his own name. In 2014 he was signed to the Cowboy Junkies’ label, Latent Recordings, releasing the critically acclaimed Early Riser that same year. His second Latent release, Nonsense and Heartache, followed in 2017. A year later the two-album set was picked up by Proper Records for distribution in the U.K and Europe, leading to extensive touring throughout the continent, in the process opening up a whole new audience for Leger’s finely crafted songs. With his next Latent album, 2019’s Time Out for Tomorrow, Leger began to receive positive notices in such high-profile music magazines as Uncut and Rolling Stone.\n\nA restless hungry spirit, when not performing and recording under his own name, Leger stays busy with a plethora of side projects including The Del Fi’s (loose improvisatory rock and roll) and the Bop Fi’s (Leger reciting his poetry over jazz accompaniment). He has also been known to work under the pseudonym Hank Holly (bonus points go to those who can figure out where that name came from!). Making the most of his time while off the road due to the pandemic, in 2020 Leger published his first book of poetry Just the Night Birds, made a film for his mailing list subscribers, The Apartment Show He Never Gave, while releasing what he terms a “surprise” album, Songs from the Apartment. In between all that activity, Leger also cut a handful of one-off singles. One of those tracks, “Halfway ‘Till Gone” recorded with former Moby Grape member Don Stevenson, turned the Replacements’ Tommy Stinson into a fan!\n\nSongs from the Apartment was a stripped-down lo-fi affair recorded in Leger’s home using a cheap tape recorder with an internal microphone. Two songs from the current album, “Underground Blues” and “Sinking In,” were also recorded in Leger’s home, this time using two SM58 microphones fed into his vintage 1981 Tascam 4-track tape recorder. The remaining nine tracks included on Nothing Pressing present Leger’s work in two starkly contrasting soundscapes. “Nothing Pressing,” “Protector,” and “Still Patience,” are solo acoustic recordings cut live in the studio with little embellishment save Dan Mock’s overdubbed harmony vocals and, on the title track, producer Michael Timmins’ ukulele. The other six tracks are prime roots rock and roll featuring his long-time band The Situation (drummer Kyle Sullivan and bass player Dan Mock). Among the latter songs, “Kill It With Kindness” and “Have You Ever Been Happy?” have the kind of drive, energy and spirit that are sure to make them highlights of his future live shows.\n\nLeger often times finds himself at a loss as to explain the source of his songs. He feels his songwriting, while clearly drawing on experiences filtered through a panoply of influences, often verges on being a supernatural experience. Over the course of the eleven songs on Nothing Pressing, the songwriter’s songwriter engages with questions of existence, mortality, hope, trust and heartbreak while simultaneously conjuring feelings of isolation, reflection, longing and gratitude.\n\nPaired with such evocative lyrics are wonderfully crafted melodies, soulful vocals and the spirit and energy of a mature songwriter, comfortable in his skin and growing as an artist with every release. Nothing Pressing serves a wonderfully refreshing tonic in troubling times."}], "Jerry Leger's music has been compared to John Prine, Neil Young, and Tom Waits.": [{"url": "https://www.npr.org/2022/01/13/1072064891/barn-is-neil-youngs-best-album-in-quite-a-while", "page_content": "'Barn' is Neil Young's best album in quite a while\n\nYoung has long been a nature writer, composing pastorals about the environment. Barn finds him composing lyrical hymns to the earth and sky, or raging against destruction on the horizon.\n\nTERRY GROSS, HOST:\n\nThis is FRESH AIR. Neil Young's new album is called \"Barn,\" and that's where it was recorded - in an old barn on Young's property in the Colorado Rockies. It was cut in about 10 days with Young's longtime band, Crazy Horse, the musicians Young has performed with off and on for more than half a century. Rock critic Ken Tucker says \"Barn\" is the best Neil Young album in quite a while.\n\n(SOUNDBITE OF SONG, \"CHANGE AIN'T NEVER GONNA\")\n\nNEIL YOUNG: (Singing) Ten men working had to get a new job, try to save the planet from a fuel-burning mob who turned on everyone for being so controlling, taking away all the freedom they've been knowing.\n\nKEN TUCKER, BYLINE: There's a sound you're likely to be familiar with - Neil Young's expressive yowling, backed by the ramshackle rhythms of Crazy Horse pounding out new material on \"Barn.\" If you haven't listened to a Neil Young and Crazy Horse album in a long time, or maybe even thought about Neil Young in a long time, I ask you, has he ever written a prettier song than this one called \"Tumbling Through The Years\"?\n\n(SOUNDBITE OF SONG, \"TUMBLIN' THRU THE YEARS\")\n\nYOUNG: (Singing) Well, I was walking down the road, one step at a time, heading home. I was thinking about the love we shared, you and me. It's a complicated thing, this life. If I wasn't here with you, tumbling through the years without our love.\n\nTUCKER: But, you may say, hasn't Neil Young made some of his loudest, most raw music with Crazy Horse? You're probably thinking of great, big and, yes, loud albums like \"Zuma\" and \"Rust Never Sleeps.\" That aspect of Young's music, wielding his guitar like a sword slashing across his melodies, is very much a part of this album as well.\n\n(SOUNDBITE OF SONG, \"CANERICAN\")\n\nYOUNG: (Singing) I am American. American is what I am. I cast my vote, and now I got my man. Out on the range, I see the changes coming to this country. I am American. American is what I am.\n\nTUCKER: Young's wife, the actor Daryl Hannah, filmed the making of the album in a drafty old barn, shaping a fine documentary that's available on the deluxe version of the album or as a separate release. Since this collection was recorded live, first or second takes only and just a few overdubs, you're essentially seeing \"Barn\" being built right in front of your eyes and ears. In Hannah's intimate images, Young and the three members of the current version of Crazy Horse - drummer Ralph Molina, bassist Billy Talbot and guitarist Nils Lofgren - look like grizzled, old prospectors, still sifting for gold in the countryside. They find it - the music version, anyway - more than once.\n\n(SOUNDBITE OF SONG, \"WELCOME BACK\")\n\nYOUNG: (Singing) Going to sing an old song to you right now - one that you heard before. Might be a window to your soul I can open slowly. I've been singing this way for so long, riding through the storm. Might remind me of who we are and why we walk so lowly.\n\nTUCKER: That's the beginning of \"Welcome Back,\" an eight-minute mood piece that only seems to ramble. It gathers strength and purpose to become one of Young's very best we're-all-in-this-mess-together songs. For a long time, Young has also been a nature writer, a composer of pastorals fretting over the environment. This album finds him sometimes composing lyric hymns to the Earth and sky or raging against destruction on the horizon.\n\n(SOUNDBITE OF SONG, \"HUMAN RACE\")\n\nYOUNG: (Singing) Today no one cares. Tomorrow no one shares because they all will be gone but the children - children of the fires and floods.\n\nTUCKER: Neil Young's voice now sounds almost exactly the same as it did when he was a skinny Canadian telling us, everybody knows this is nowhere. A half-century later, he's cutting songs in a barn made from logs, the wind whistling through their cracks. The music here waves to us, a fond hello that's more full of spirit and life than we might've expected.\n\nGROSS: Ken Tucker reviewed Neil Young's new album \"Barn.\" If you'd like to catch up on FRESH AIR interviews you missed, like this week's interviews with Benedict Cumberbatch, who stars in the new film \"The Power Of The Dog,\" and Brian Cox, one of the stars of \"Succession,\" check out our podcast. You'll find lots of FRESH AIR interviews.\n\n(SOUNDBITE OF SONG, \"DON'T FORGET LOVE\")\n\nYOUNG: (Singing) Don't forget love. Don't forget love. Don't forget love. Don't forget love. Don't forget love. Don't forget love. When you're angry and you're lashing out, don't forget love. You don't know what you're talking about, don't forget love. When the wind blows through the crime scene and the TV man starts talking fast, don't forget love. Don't forget love. Don't forget love.\n\nGROSS: FRESH AIR's executive producer is Danny Miller. Our senior producer today is Sam Briger. Our technical director and engineer is Audrey Bentham, with additional engineering from Adam Staniszewski. Our interviews and reviews are produced and edited by Amy Salit, Phyllis Myers, Lauren Krenzel, Heidi Saman, Therese Madden, Ann Marie Baldonado, Thea Chaloner, Seth Kelley and Kayla Lattimore. Our digital media producer is Molly Seavy-Nesper. Roberta Shorrock directs the show. I'm Terry Gross.\n\n(SOUNDBITE OF SONG, \"DON'T FORGET LOVE\")\n\nYOUNG: (Singing) When you're taking and you could be giving, when you're dying and you could be living, don't forget love. Don't forget love. Don't forget love. Don't forget love. Don't forget love. Don't forget love. Don't forget love. When you're waking up...\n\nCopyright © 2022 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\n\nNPR transcripts are created on a rush deadline by an NPR contractor. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record."}, {"url": "https://www.theguardian.com/music/2021/dec/10/neil-young-and-crazy-horse-barn-review-reliably-ragged-and-still-sounding-great", "page_content": "More than 50 years on from their first recordings together, and 14 albums in, there’s not much mystery to a new release from Neil Young and Crazy Horse. The band will sound ragged, as if they have tumbled half-asleep into the studio; Young’s guitar solos will sound like forked lightning; there will be volume, but also the restraint that comes from not indulging in millions of overdubs. And so it proves. Barn – titled for its recording location (“Barn, high in the Rockies) – sounds much as you’d expect, although that’s a tribute to the ensemble’s reliability rather than a complaint about repetition.\n\nSometimes the old sounds are recontextualised in slightly different ways: on the brilliant Heading West, Young’s burning, acidic lead guitar is backed by rolling piano rather than yet more guitars and married to a melody that would shine on one of his classic albums. That’s one of a pair of tracks on which he’s fretting away at the past, and at movement; the other, Canerican, sees him recalling how “I was born in Canada, came south to join a band” and how that has shaped his identity.\n\nBarn highlights both the strengths and weaknesses of this set-up: They Might Be Lost barely feels like a song, just the same chords Young has been strumming all his adult life, yet it manages to be eternal and deeply moving. Equally – and this is a little like complaining fire is too hot – one can’t help but feel some of these songs sound as though they were being written as they were recorded. But that Crazy Horse sound? Well, they could more or less be playing Crazy Frog and it would still sound great."}, {"url": "https://www.rollingstone.com/music/music-features/inside-the-life-of-john-prine-the-mark-twain-of-american-songwriting-115459/", "page_content": "John Prine sits behind the wheel of his Cadillac DeVille on a sunny Nashville afternoon, humming along to a cassette of Jerry Lee Lewis’ country hits. He slows down as he approaches a series of television-production trucks parked near his house. They’re probably here because his neighbor, country singer Kellie Pickler, is filming a reality show for CMT. Prine’s 21-year-old son, Tommy – home from college for the weekend and riding shotgun – says he’s gotten to know Pickler while out walking his dog. “Never met her,” Prine rasps. “All I know is she has three garbage cans and I have one.”\n\nThe singer’s presence, Prine adds, has invited “Homes of the Stars” tour vans to his neighborhood, which stop outside his house twice a day. Tommy recently caught his dad spacing out as he stood near his mailbox – “bright-red sweatpants, gravy-stained T-shirt” – oblivious to the tourists taking photos of him. “God knows what they say about our place,” Prine says.\n\nPrine, 70, has never been the kind of artist to draw much attention to himself. But in his own unassuming way, he’s built one of the most impressive catalogs of any songwriter of his generation. He emerged on the Chicago folk scene in the late Sixties, singing about the characters he encountered in the Midwest – heroin-addicted veterans, lonely housewives, the elderly – in songs that combined heavy realism and deceptive wit and often took surreal and unexpected turns. Bob Dylan’s favorite Prine song is “Lake Marie,” in which three radically different storylines – an Indian legend, a troubled couple on a camping trip and a brutal murder – converge at Prine’s childhood vacation spot. “Prine’s stuff is pure Proustian existentialism,” Dylan said in 2009. “Midwestern mind-trips to the nth degree.”\n\nToday, Prine is giving his own version of a “Homes of the Stars” tour. “There’s Waylon’s old place,” Prine says, gesturing at a big Victorian brick house on Music Row. “Used to be outlaw central for a while.” He points out the house that once belonged to Cowboy Jack Clement, the former Sun Records house engineer who wrote several rock & roll classics, including Johnny Cash’s “Ballad of a Teenage Queen.” Cowboy, as Prine calls him, is the reason Prine came to Nashville. In 1977, after Prine’s contract with Atlantic Records expired, Cowboy invited him out here to make a rockabilly album. “Cowboy’s motto was, ‘If we’re not having fun, we’re in the wrong business,'” Prine says. Backed by Nashville’s best session players, they recorded in Cowboy’s attic six days a week, around the clock. “We were high as dogs and playing some really good stuff,” adds Prine. They had so much fun that they never finished the album, but Prine fell in love with Nashville anyway.\n\nEditor’s picks\n\nPrine lives a quieter life these days. Usually he wakes up late, eats lunch at one of his favorite greasy meat-and-threes, then maybe washes his car, shoots pool or takes a nap before browsing eBay for old cars late into the night. “I look busy for a living,” Prine deadpans. “I leave the house so it appears I did something. Fiona knows to never ask me what I did today. She knows it’s absolutely nothing.”\n\nFiona is Prine’s third wife; together with their son Jody, they run Prine’s independent record label, Oh Boy, out of a home they converted into an office. His live shows are a similarly do-it-yourself enterprise. Mitchell Drosin, Prine’s longtime road manager, books shows directly with promoters, and Prine drives himself between gigs. Overhead is low: Venues’ $3,000 catering options are turned down in favor of a $12 deli tray and a few six-packs.\n\nLately, Prine’s audiences have been growing. His songs have become a key reference point for young Americana stars like Sturgill Simpson, Jason Isbell and Margo Price, all of whom open for Prine. “We hold him up as our Hank Williams,” says Todd Snider, who has released music on Oh Boy. “His music is like Huckleberry Finn. You get it, then you listen to it five years later and you really get it. And you listen to it five years later and you go, ‘I get it!’ And then 10 years later you go, ‘Now I get it.'”\n\nAt Boston’s John F. Kennedy Presidential Library this fall, Prine was honored with PEN New England’s Song Lyrics of Literary Excellence Award, which had previously been given to Chuck Berry and Leonard Cohen. Simpson, Rosanne Cash and John Mellencamp showed up to pay tribute. “I can’t help but think about a couple of my high school English teachers that are rolling in their graves,” Prine said in his short acceptance speech. To capitalize on all the recent attention, Fiona convinced Prine to record For Better or Worse, a country covers album on which he sings with fans like Miranda Lambert, Kacey Musgraves and Amanda Shires. Prine says he’s received three book-deal offers in the past year alone. “We’ve heard from all the big publishers,” he says. “I think I’ll wait a little bit. Till I make my big comeback.”\n\nRelated\n\nPrine’s office feels like a clubhouse: There’s a pool table, black-and-white family photos, a pinball machine and Christmas lights all over. Prine loves Christmas; back when he was single, he kept a tree in his house year-round. It’s one in a long series of Prine’s endearingly eccentric qualities. He’ll also pack at least four bags of luggage for his weekend tours – everything from framed family photos to Heinz ketchup to Archie comic books. “I never gave up on Archie,” Prine tells me. “I started picking up Archie comics when I was in my thirties, and then I started subscribing to them. I like that they put your age on there: ‘To Johnny Prine, age 43.’ I like Jughead mainly. He had this persona that he was shifty and lazy, but he always kinda knew what was going on.”\n\n“John’s mind don’t work like everybody else’s mind,” says Prine’s friend and engineer David “Fergie” Ferguson. “He really thinks outside the box, you know. And when he comes up with something, it might strike you as being really off-the-wall, but then after you think about it for a minute, it’s like, ‘OK, now it’s obvious.'”\n\nIn one corner of Prine’s office is a pristine 1942 Wurlitzer jukebox, stacked with old country 78s. It was a gift from his late friend and music partner Steve Goodman after they wrote “You Never Even Called Me by My Name,” a goofy satire of country music. “I thought it was a joke,” says Prine, explaining why he declined to list himself as a writer on the song. “Next thing I know, David Allan Coe does it, and it goes to Number One.” (The song actually went to Number Eight – Prine admits he tends to exaggerate.)\n\nHe likes the Wurlitzer because it reminds him of his dad. Bill Prine, a factory worker in Maywood, Illinois, a blue-collar suburb of Chicago, would take John and his brothers out to the honky-tonks and play the jukebox. “He was a big guy – six-two, 250 pounds,” Prine says. “He would more or less go into bars and announce that if anybody thought about doing anything like fighting, that they should get it over with, so he could have a good time.”\n\nThough the Prine family grew up in Maywood, Bill Prine drilled into the kids that they were also from somewhere else: Paradise, Kentucky, a small coal-mining town where Bill grew up before moving north to find work. “One time I went to school and they asked us all to find out where our roots were,” Prine says. “It’s goin’ around the class, and the kids were going, ‘I’m Swedish-German’ or ‘I’m English-Irish.’ They got to me and I said, ‘Pure Kentuckian.’ ” (In 1971, Prine would release “Paradise,” a song that became a country classic, covered by everyone from Roy Acuff to the Everly Brothers.)\n\nThe family spent its summers in Paradise, where bluegrass was big, leading John to study Doc Watson–style fingerpicking with his older brother, Dave. It wasn’t until John heard Dylan that he saw a future for himself as a songwriter. “By the time Bob Dylan and Johnny Cash hooked up [for Nashville Skyline], that’s when I thought, ‘Man, there’s something there where their two paths crossed. My stuff belongs right in the middle.'”\n\nBefore he could pursue songwriting, Prine was drafted into the Army in January 1966. He lucked out when he was sent to West Germany instead of Vietnam, working as a mechanical engineer, “drinking beer and pretending to fix trucks.” He often reminds himself that other draftees weren’t so fortunate: On his office table he spreads out a stack of small black-and-white photos of various boot-camp buddies who went to Vietnam and came home in a box. “Look how many of them are African-Americans,” he says. “And they tell me that that’s the lottery system?”\n\nAfter coming back from Germany, Prine returned to his job as a mailman in Maywood. On his postal route, he worked out songs like “Your Flag Decal Won’t Get You Into Heaven Anymore” – a hilarious indictment of misguided patriotism – and “Sam Stone,” about a vet who gets hooked on morphine during his service and comes home a different person. The chorus: “There’s a hole in Daddy’s arm where all the money goes/Jesus Christ died for nothin’, I suppose.”\n\nWhen Prine played “Sam Stone” at his first-ever performance, an open-mic night at Chicago’s Fifth Peg in 1969, he was greeted with icy silence. The “Jesus” line made many audiences angry. “They’d start to have an argument with me when I was onstage,” says Prine. (Johnny Cash had Prine rewrite the “Jesus” line when he covered “Sam Stone” in the Eighties, to “Daddy must have hurt a lot back then, I suppose.” “If it hadn’t have been Johnny Cash,” Prine says, “I would’ve said, ‘Are you nuts?'”)\n\nPrine’s career took off fast: A couple of open-mic appearances got him a residency at the Fifth Peg, and then a $1,000-a-week regular gig at Earl of Old Town, the center of the Chicago folk scene. The club was across the street from the Second City theater, and Bill Murray and John Belushi (who later helped Prine secure a slot as a musical guest during the second season of Saturday Night Live) frequented his sets. Roger Ebert, then a young Chicago Sun-Times staff writer, stopped by one night and wrote an article titled “Singing Mailman Who Delivers a Powerful Message in Few Words.” On another occasion, Steve Goodman brought Kris Kristofferson to the Earl. “By the end of the first line, we knew we were hearing something else,” Kristofferson recalled later. “It must’ve been like stumbling onto Dylan when he first busted onto the Village scene.” Kristofferson soon invited Prine onstage in front of an industry-heavy audience at New York’s Bitter End. The next morning, Atlantic Records president Jerry Wexler offered Prine a $25,000 contract. “This is my first night in New York, so it was like Oz to me,” Prine says.\n\nKristofferson would also introduce Prine to Dylan. One night Prine wound up at Carly Simon’s apartment, where Dylan – largely off the grid after his 1966 motorcycle accident – shocked Prine by singing along with several songs from Prine’s not-yet-released debut album. “The album wasn’t even out and he knew the words because he had an early copy,” Prine says. “I’m thinking, ‘This is like a dream.'”\n\nPrine became a fixture of the Seventies folk scene, smoking and drinking beer while spinning yarns between songs. “He was incredibly endearing and witty,” says Bonnie Raitt, who would cover one of Prine’s most famous songs, “Angel From Montgomery,” in 1974. “The combination of being that tender and that wise and that astute mixed with his homespun sense of humor – it was probably the closest thing for those of us that didn’t get the blessing of seeing Mark Twain in person.”\n\nThough his record sales slowed down, Prine’s writing grew more adventurous and profound. “Jesus the Missing Years” theorizes what Christ might have done during the 18 years of his life unaccounted for in the Bible, while “Sabu Visits the Twin Cities Alone” uses the sad story of Sabu Dastagir – the Indian actor from 1937’s Elephant Boy – as a meditation on loneliness. “Who writes songs like that?” Mellencamp asked onstage at Prine’s PEN Award ceremony. “Two people come to mind: God and John Prine. … John taught me a lot, whether he knew it or not. He was a natural-born earthshaker. I know the record companies had no idea what to do with John Prine. ‘He’s not country, he’s not rock – what are we gonna do?’ And he said, ‘To hell with it. I’m gonna do what I’m gonna do.’ And he did.”\n\nPrine calls the Eighties his “bachelor years.” “I was also married to my bass player in that time,” he clarifies, referring to his second marriage, which lasted from 1984 to 1988. “But I think our marriage was doomed from the get-go.” Back then, Prine would wake up around 3:30 in the afternoon and head to Brown’s Diner for fried eggs and his first beer of the day, then chat with fellow regulars Townes Van Zandt and Don Everly and play the poker machine. Brown’s didn’t serve liquor, so he’d go to Melrose Billiards (which he calls Chandler’s), one of many Nashville bars that still serve a Handsome Johnny – vodka and ginger ale. Then he’d hit the grocery store. “All my buddies knew that my dinner would be ready about one in the morning,” he says. “So when they were on their way home from the clubs, they’d all stop at my house and stay until about the time the sun came up.”\n\n“He was on the night shift for a long time,” says Ferguson, who remembers sitting at Prine’s Fifties Formica table and playing Hank Williams and Merle Haggard records as friends like Van Zandt and Guy Clark dropped by to play cards. Cocaine and quaaludes were rampant. Prine wasn’t much of a weed guy: “If you smoke hash, it was kinda like buying a train ticket. You just run a straight train ride and you know what town you were getting off at. With some of the weed going around, you don’t know where you’re goin’.”\n\nToday, Chandler’s is empty, apart from a smoking bartender and a few grizzled locals here to gamble on a horse race. One of them is Hooter, a friendly, pony-tailed character who worked for decades as the Everly Brothers’ tour manager. “Hooter was there in my wild years,” Prine says.\n\n“I was totally involved in his wild years,” Hooter corroborates. Hooter shares a few stories, like the one about Prine’s tropical-fish tank. One night, while they were out barhopping, Prine’s heater shorted out and killed all of his fish. Prine was distraught. He had become attached to a goldfish that had grown to a pound and a half. After storing it in the freezer for months, Prine took the fish to a taxidermist and had it mounted, explaining it was the family’s favorite pet. “I said, ‘The kids miss it,’ ” says Prine, who had no children at the time.\n\nPrine admits he was basically a child himself back then. All that changed when he met Fiona in 1988 at an after-party in Dublin, where she was working as a recording-studio business manager. They kept in touch for years before she left Ireland for Nashville in 1993. (The Prines still keep a summer home near Galway.) “There were a lot of things stacked against us,” Fiona says later. “He was on the road and had been through two marriages.”\n\n“I was a high risk,” Prine says. At 48, Prine became a father for the first time when their son Jack was born. Tommy followed the next year, and Prine also adopted another son, Jody, from Fiona’s previous relationship. “It put my feet right on the ground,” he says. “I didn’t know that I was missing that until I found it. All of a sudden I felt normal with a capital N. I didn’t realize it, but it was something that I was striving for after years and years of being a total daydreamer.”\n\nThe honeymoon ended in 1996, when Prine visited a doctor about a lump on his neck. He’d been shaving around it for a while, thinking it was a blood vessel; it was actually stage-three neck cancer. Prine was dumbfounded. “I felt fine,” he says. “It doesn’t hit you until you pull up to the hospital and you see ‘cancer’ in big letters, and you’re the patient. Then it all kind of comes home.”\n\nSurgeons removed the tumor, taking a chunk of Prine’s neck with it. The surgery left his head permanently slumped, which means he spends a lot of time staring at his shoes when he walks. It also makes him stick out in public – he’s used to getting stared at, especially by curious children. “I didn’t think there was any use in me wearing a turtleneck sweater,” he says.\n\nIn the wake of the surgery, he felt weak and his voice lost a lot of its power. He took a year and a half off before booking a small theater show in Bristol, Tennessee, as a test. He was nervous. “The crowd was with me. Boy, were they with me,” he says, his eyes tearing up. “And I think I shook everybody’s hand afterward. I knew right then and there that I could do it.”\n\n“It sounds a little cliché, or Pollyannaish,” says Fiona. “But John and I don’t laugh at this: That neck is proof there is a God. That neck is the hand of God, because it gave him more than was taken away. Not to say it wasn’t hard. It was very hard for him.”\n\nIt could be hard for his kids, too. According to Fiona, Prine’s physical ailments made it difficult for him to keep up with the boys. They also struggled with the fact that he was on the road a lot. “He wasn’t a PTA dad, but he did what he could,” she says. But lately, their relationship has improved, especially with Jack starting to write songs and Tommy studying music management and hoping to work at Oh Boy. When Fiona recently asked Tommy how he felt about his father’s absence when he was younger, his response was definitive. “Mom,” he said, “my dad’s a freakin’ legend.”\n\nPrine says there’s one downside to finding happiness late in life: His writing has slowed down. “The one thing I can’t remember about writing songs is just how fucking simple it is,” he says. The Black Keys’ Dan Auerbach, who’s been co-writing with Prine, says Prine can write when he wants to: “These phrases you’re looking for – they just pop out of his mouth,” Auerbach says. “Like it’s magic or something.”\n\nThis year, Prine is hoping to release his first album of new songs since 2005, but he’s finding it to be a torturous process. “I don’t wanna just sit down and write a little couplet that’s kind of witty, or something. I’ve done that,” he says. Occasionally, he stumbles upon an idea he can hang onto. At Chandler’s, we end up discussing religion. Prine believes in God, but he’s sick of the way evangelical Christians use the Bible as a political weapon against gays and transgender people. “I think of the Bible as an unauthorized biography,” says Prine. “I think that the disciples were all trying to vie for their personal time that they spent around Jesus. If I wrote anything, I would go toward that. I think I would make the center of it like, ‘Kitty Kelley Wrote the Bible.’ That’s a little marble that’s rolling around in my head right now. And that marble gets bigger every day.”\n\nAfter a couple of beers at Chandler’s, we head to Prine’s house and sit on a porch overlooking his pool and Fiona’s large garden. Fiona comes by to ask if salmon is OK for dinner. Prine yawns – he’s not used to drinking beer during the day anymore, and it’s made him a little tired. “I can tell,” Fiona says.\n\nAt dinner, Prine sits at the head of the table, next to Tommy and his college friends, chiming in on matters from college hockey to whether Tommy should get his real-estate license. “Not a bad idea,” Prine says. “You’d make a killing in one summer. You just smile a lot. When the doorknob breaks, or the plumbing, you just go, ‘It’s very fixable.'” After dinner, Tommy and his friends make their escape, promising Fiona on their way out that they won’t be drinking. She’s skeptical. “Youth,” Prine grumbles when they leave.\n\nHe and Fiona look over a proof of a coffee-table book that includes guitar chords, lyrics and photos from throughout Prine’s life. She points out lyrics to various songs, like “Space Monkey” – written about one of the monkeys the Soviet Union sent into space in the Fifties – and 1972’s amiably apocalyptic “The Late John Garfield Blues.” “Your handwriting was a lot better then,” says Fiona. “I was a lot more together,” he replies. “You should’ve known me back then.”\n\nNext is a picture from around the time of Prine’s 1978 album Bruised Orange. As part of the promotional campaign, three twentysomething girls in a record store dressed in big round costumes meant to look like oranges, though they ended up looking like pumpkins. “We invited them back to the hotel, actually,” Prine says. “And it turns out they were stuffed with old pages of Rolling Stone inside their costumes.”\n\n“We won’t ask how you found that out,” Fiona says with an eye roll.\n\nAs I prepare to leave, Prine disappears and comes back with two more items to show off. One is a gift Jody got him for Christmas last year, a custom painting of Prine with the characters from Archie, titled “John Prine Plays Riverdale.” He looks at it and lets out a big, whooping laugh, despite having seen it countless times. The second is the mounted goldfish, which he displays outside, overlooking the pool. “I like hanging it somewhere prominent,” Prine says. “So people go, ‘What’s this?’ Then I get to tell the story.”\n\nFrom his thoughts on “retro” records to his friendship with John Prine, here are some things we learned hanging out with the Black Keys’ Dan Auerbach.\n\n"}, {"url": "https://www.rollingstone.com/music/music-country/hank-williams-john-prine-neil-young-recordings-earn-spot-in-grammy-hall-of-fame-183600/", "page_content": "Classic recordings from Hank Williams, John Prine and Neil Young are among the 27 inductees into the Recording Academy’s Grammy Hall of Fame for 2015. Their inclusion will bring the grand total of titles in the Hall of Fame to 987. (See the complete list of 2015 Grammy Hall of Fame inductees below.)\n\nHank Williams‘ 1947 recording of his self-penned “Honky Tonkin'” joins his previous Hall of Fame inductees — “Hey Good Lookin’,” “I’m So Lonesome I Could Cry,” “Jambalaya (on the Bayou)” and “Your Cheatin’ Heart” — as a recipient of the honor. The songs will be commemorated this year with a special collector’s edition book focusing on the Grammy Foundation’s Grammy Camp program and the organization’s preservation and archiving initiatives.\n\nSinger-songwriter John Prine‘s 1971 self-titled debut album, released on Atlantic Records and produced by Arif Mardin, will also be inducted. The LP includes essential Prine compositions “Sam Stone,” “Illegal Smile,” “Hello in There” and “Angel From Montgomery.”\n\nAlso selected for induction was Neil Young’s 1972 classic Harvest, the majority of which was recorded in Nashville and featured performances from Linda Ronstadt, James Taylor and some of Music City’s finest session players.\n\nOther inductees include Stardust, Willie Nelson’s career-defining (and record-breaking) 1975 album of standards, and Bob Wills and His Texas Playboys‘ “San Antonio Rose,” as well as recordings by ABBA, the Sex Pistols, the Four Seasons, Bonnie Raitt, Fats Waller and more.\n\nTo be considered for induction into the Grammy Hall of Fame, albums and single recordings must be at least 25 years old and deemed of “lasting qualitative or historical importance.” Inductees are selected annually by a special member committee of eminent and knowledgeable professionals from all branches of the recording arts.\n\nTrending The FDA Warned Ozempic Users. They Don’t Give a F-ck Oh-So-Mature Trump Aides Want Him to Focus on DeSantis’ Penis Right-Wing Media Is Saying the Wildfire Smoke Is Good, Actually Kimberly Perry on The Band Perry's Breakup: 'Did We Leave or Were We Kicked Out?' Editor’s picks\n\nThe 57th Annual Grammy Awards will be broadcast live on CBS, February 8, 2015. The full list of inductees is below:\n\nKraftwerk, Autobahn\n\nThe Four Seasons, “Big Girls Don’t Cry”\n\nBob Dylan, Blood on the Tracks\n\nSonny Rollins, The Bridge\n\nHarry Belafonte, Calypso\n\nABBA, “Dancing Queen”\n\nNeil Young, Harvest\n\nHank Williams and His Drifting Cowboys, “Honky Tonkin'”\n\nBobby Fuller Four, “I Fought the Law”\n\n“Fats” Waller, His Rhythm and His Orchestra, “Jitterbug Waltz”\n\nJohn Prine, John Prine\n\nChic, “Le Freak”\n\nFontella Bass, “Rescue Me”\n\nBob Wills and His Texas Playboys, “San Antonio Rose”\n\nAlice Cooper, “School’s Out”\n\nThe Dominoes, “Sixty Minute Man”\n\nLeonard Cohen, Songs of Leonard Cohen\n\nWillie Nelson, Stardust\n\nFisk Jubilee Singers, “Swing Low, Sweet Chariot”\n\nPaul Robeson, “Swing Low, Sweet Chariot”\n\nAaron Neville, “Tell It Like It Is”\n\nOtis Redding, “Try a Little Tenderness”\n\nLou Reed, “Walk on the Wild Side”"}, {"url": "https://www.rollingstone.com/music/music-lists/john-prine-25-essential-songs-974926/", "page_content": "John Prine wrote his first two songs, “Sour Grapes” and “The Frying Pan,” when he was 14. Even at that young age, Prine could channel humor and heartbreak just like his heroes Hank Williams and Roger Miller. As he served in the Vietnam War and joined the post office as a mailman, Prine kept writing songs about his life: “Hello in There,” about the loneliness of an old empty-nest couple, the kind he encountered on his mail route, and “Sam Stone,” about a drug-addicted veteran who never really came home from the war, were just two examples. Prine wrote for working people, sad people, old people, and lost people. His style, inspired by John Steinbeck, was deceptively simple. Many emulated it, but only he could do it.\n\nPrine, modest about his talent, didn’t give a lot of interviews. But his conversation with Paul Zollo for Bluerailroad is a master class in songwriting. “I think the more the listener can contribute to the song, the better; the more they become part of the song, and they fill in the blanks,” Prine told Zollo. “Rather than tell them everything, you save your details for things that exist. Like what color the ashtray is. How far away the doorway was. So when you’re talking about intangible things, like emotions, the listener can fill in the blanks and you just draw the foundation. I still tend to believe that’s the way to tackle it today.”\n\nThere’s really no such thing as a bad Prine song. Here are 25 of the best."}, {"url": "https://faroutmagazine.co.uk/the-song-neil-young-wrote-about-led-zeppelin/", "page_content": "\n\n\n\n\n\n\n\nAfter being a giant of the music scene for decades, one would presume Neil Young wouldn’t have the capacity to still get awestruck by his peers. From Bob Dylan to The Beatles and back again, Young has played with most of the great songwriters of the world. But then again, Led Zeppelin are no ordinary band.\n\nYoung was simply blown away by the band when he came across Jimmy Page, Robert Plant and the rest of Led Zeppelin. After a life-affirming experience at the hands of the group, Shakey had no choice but to channel his intense feelings through song.\n\nFor one night only in 1995, Young had the opportunity that every guitarist worth their salt would swim the Atlantic Ocean for — he became an honorary member of Led Zeppelin. While there was hostile tension between the three surviving members of the rock behemoth, Young was in his element.\n\nTheir memory of the evening is a stark contrast from Young, who was reportedly so exhilarated after the concert that he wanted to reunite Led Zeppelin permanently with him in the fold. In his head, Young dreamt up a grand plan to bring one of his favourite bands back to life and even wanted to make a full album with the dynamic group.\n\nIt’s safe to say that the feeling after the Rock and Roll Hall of Fame ceremony was different in the Led Zeppelin camp. The previous year, Robert Plant and Jimmy Page had reunited without John Paul Jones, with the bassist happy to make sure everyone in the arena was aware of his displeasure. During their acceptance speech, Jones brutally said to his bandmates, “Thank you, my friends, for finally remembering my phone number”.\n\nThankfully, once they picked up their instruments, the anger held by Jones disappeared, and the addition of Neil Young for ‘When The Levee Breaks’ made spines tingle all across the arena. Towards the end of the song, Plant even paid tribute to Young by throwing in a section of Buffalo Springfield’s ‘For What It’s Worth’.\n\nZeppelin guitarist, Page is one of the few players to make Young feel like an amateur, the ‘Harvest’ singer once saying, “I’m a hack compared to him. He can really play.” While his scheme to reform Led Zeppelin and become a bandmate of the guitarist was to no avail, that night would still inspire his song, ‘Downtown’.\n\nThe track was the lead single from his twenty-third studio album, Mirror Ball, which is the record that Shakey made with Pearl Jam, and the single was even nominated for a Grammy Award the following year.\n\n‘Downtown’ is set in the utopian ’60s, with a concert by Led Zeppelin taking centre stage in Young’s fantastical world. On the track, Young sings, “Jimi’s playin’ in the back room, Led Zeppelin on stage, There’s a mirror ball twirlin’, And a note from Page, Like a water-washed diamond”.\n\nPlaying live with Led Zeppelin profoundly affected him and made Young fall back in love with them. Young was enjoying working with other artists at this time, having just collaborated with Pearl Jam. However, what we lose in the idea of a possible new Led Zeppelin album, we retain in their impressive, and untarnished, legacy."}, {"url": "https://www.killbeatmusic.com/media-releases/2022/1/25/jerry-leger-announces-new-lp-nothing-pressing-shares-video-for-first-track", "page_content": "“Have You Ever Been Happy?” Single Artwork // DOWNLOAD HIGH-RES\n\nMORE ABOUT NOTHING PRESSING\n\nLeger’s previous album, Songs from the Apartment was a stripped-down lo-fi affair recorded in his home using a cheap tape recorder with an internal microphone. Two songs from the current album, “Underground Blues” and “Sinking In”, were also recorded in Leger’s home, this time using two SM58 microphones fed into his vintage 1981 Tascam 4-track tape recorder. The remaining nine tracks included on Nothing Pressing present Leger’s work in two starkly contrasting soundscapes. “Nothing Pressing”, “Protector”, and “Still Patience”, are solo acoustic recordings cut live in the studio with little embellishment save Dan Mock’s overdubbed harmony vocals and, on the title track, producer Michael Timmins’ ukulele. The other six tracks are prime roots rock and roll featuring his long-time band The Situation (drummer Kyle Sullivan and bass player Dan Mock). Among the latter songs, “Kill It With Kindness” and “Have You Ever Been Happy?” have the kind of drive, energy and spirit that are sure to make them highlights of his future live shows.\n\nLeger often times finds himself at a loss as to explain the source of his songs. He feels his songwriting, while clearly drawing on experiences filtered through a panoply of influences, often verges on being a supernatural experience. Over the course of the eleven songs on Nothing Pressing, the songwriter’s songwriter engages with questions of existence, mortality, hope, trust, and heartbreak while simultaneously conjuring feelings of isolation, reflection, longing, and gratitude.\n\nPaired with such evocative lyrics are wonderfully crafted melodies, soulful vocals, and the spirit and energy of a mature songwriter, comfortable in his skin and growing as an artist with every release. Nothing Pressing serves a wonderfully refreshing tonic in troubling times.\n\nBorn in the mid-80s, singer-songwriter Jerry Leger came of age in the Upper Beaches area of Toronto. Surrounded by music from a young age, his grandfather first turned him onto Hank Williams, constantly playing the youngster a plethora of the honky tonk master’s great recordings. Although Williams’ voice came from another world in terms of time, geography, and class, Leger was intrigued by the ways that Williams’ songs told a story and often conjured up mysterious images in his head. Other seminal influences were slowly added including John Lennon (and the Beatles), Bob Dylan, Lightnin' Hopkins, Leonard Cohen, Elvis Costello, Neil Young, the Everly Brothers, Tom Waits, and Gordon Lightfoot.\n\nIn 2005 as Leger turned nineteen he cut his first independently released album. In the sixteen years since then the multi-talented singer-songwriter has recorded nine additional studio albums as well as one live compilation under his own name. In 2014 he was signed to the Cowboy Junkies’ label, Latent Recordings, releasing the critically acclaimed Early Riser that same year. His second Latent release, Nonsense and Heartache, followed in 2017. A year later the two-album set was picked up by Proper Records for distribution in the U.K and Europe, leading to extensive touring throughout the continent, in the process opening up a whole new audience for Leger’s finely crafted songs. With his next Latent album, 2019’s Time Out for Tomorrow, Leger began to receive positive notices in such high-profile music magazines as Uncut and Rolling Stone.\n\nA restless hungry spirit, when not performing and recording under his own name, Leger stays busy with a plethora of side projects including The Del Fi’s (loose improvisatory rock and roll) and the Bop Fi’s (Leger reciting his poetry over jazz accompaniment). He has also been known to work under the pseudonym Hank Holly (bonus points go to those who can figure out where that name came from!)."}, {"url": "https://www.jambase.com/article/happy-75th-birthday-neil-young-5-rock-roll-hall-of-fame-collaborations", "page_content": "Neil Young was born in Toronto on this date in 1945. The 75-year-old Canadian musician was raised in Winnipeg, where as a teenager he formed his first bands, laying the foundation for a career in music that twice landed him in the Rock And Roll Hall Of Fame.\n\nYoung was first inducted in 1995 as a solo artist. He became a two-time member in 1997 when the Rock And Roll Hall Of Fame inducted Buffalo Springfield whose lineup included Young, Stephen Stills, Dewey Martin, Bruce Palmer and Richie Furay. While some aspects of Young’s solo career have found him truly working or performing alone, along with Buffalo Springfield, Young is closely associated with many other musicians, like Crosby, Stills & Nash, Crazy Horse, The Stray Gators, Pearl Jam, Booker T. Jones, Promise of the Real and many others.\n\nAdvertisement\n\nBelow are five videos in the JamBase Live Video Archive (JBLVA) featuring Young collaborating with other musical legends at Rock And Roll Hall Of Fame induction ceremonies from the past 34 years. Click to check out other Neil Young live videos in the JBLVA and keep scrolling for five Hall Of Fame worthy collaborations.\n\nAdvertisement"}, {"url": "https://americana-uk.com/jerry-leger-latent-uncovers", "page_content": "Intriguing covers choices given a respectful, energetic make over.\n\nThe Cowboy Junkies have a an interesting way with choices of cover versions and have recorded a couple of EPs and albums of them. They have now exported the idea and Jerry Leger has offered four songs which were recorded and filmed live in the studio as part of a covers series for the Junkies’ Latent Recordings.\n\nOpening with a garage rock take on Lou Reed’s ‘What Goes On’ with a guitar solo reminiscent of Michael Timmons, this is a carefully curated set of songs. The high energy guitar rock of ‘What Goes On’ is followed by a version of Leonard Cohen’s ‘The Law’ from his 1984 ‘ Various Positions’ album. Multi-instrumentalist James McKie switches to violin for this song and adds a slightly middle eastern feel. Leger speeds up Cohen’s version slightly and uses the violin to add a stronger lead line compared to the synths and guitar Cohen used. Leger confirms “We play this song a little faster and with more punch than the original. ‘The Law’ has one of my favourite Leonard Cohen lines, “My heart’s like a blister from doing what I do””.\n\nJeff Tweedy’s ‘You Are Not Alone’, originally recorded by Mavis Staples, is given a Neil Young style twist. With McKie’s lap steel dominating the song, Leger describes this as one of Tweedy’s best songs and is rightly proud of the version he and his band, which also includes Dan Mock on bass and drummer Kyle Sullivan have delivered. Finally, we have ‘Janine’. Taken from David Bowie’s self-titled second album this is an unusual choice of a Bowie cover, especially given that his label bosses chose the more obvious ‘Five Years’ for their own covers album. Played as a straight update of the 1969 recording Leger says, ” ‘Janine’ is one of my favourite hidden gems from David Bowie. It’s a track off of the first Bowie album I owned as a kid. This EP kind of turned into a collection of some of my favourite hidden gems.”\n\nIt comes as no surprise that the EP was produced by Michael Timmins at his regular studio, The Hangar, in Toronto. The live in the studio method is one that Timmons’ own band have used effectively and there is a definite Junkies feel to much of the music here, even if it is noticeably more raucous than anything in their catalogue. Watching a song writer’s choice of cover version is usually informative and Leger has done a fine job with his selections, making them his own while remaining respectful of songs he clearly loves.\n\n9/10 9/10\n\nShare this:\n\nTweet\n\nWhatsApp\n\n"}, {"url": "https://www.npr.org/2021/12/12/1063483598/neil-youngs-latest-album-got-its-name-from-where-it-was-recorded-in-a-barn", "page_content": "Neil Young's latest album got its name from where it was recorded – in a barn\n\nHandmade music, raw and rootsy, recorded in a 19th-century log barn. That's the setting for the new album titled \"Barn\" by Neil Young & Crazy Horse.\n\nDON GONYEA, HOST:\n\nSongwriter Neil Young is standing in the present while looking both to the past and the future. The past is his massive online archive, chock-full of recordings and unreleased live performances. The future is the new music he's making, like the album he and his longtime collaborators, the band known as Crazy Horse, have just released.\n\n(SOUNDBITE OF SONG, \"THEY MIGHT BE LOST\")\n\nNEIL YOUNG AND CRAZY HORSE: (Singing) I'm waiting for the boys to bring the truck in. It should've been here by now.\n\nGONYEA: Its title is \"Barn.\" And we're to take that literally. It was recorded in a 19th century barn high in the Rocky Mountains. Neil Young joins us now to talk about all of this. Neil, welcome.\n\nNEIL YOUNG: Hi. How are you?\n\nGONYEA: Great. Great. So to say you recorded this album in a remote place is very much an understatement. Can you just set the scene for us of this beautiful barn? Maybe even start by taking us up the driveway and then on inside.\n\nYOUNG: Well, the way I get to the barn, I walk for a couple of miles through some aspen forest and then down past an old windmill and a couple of lakes with my two dogs. And then I'm halfway there. And I walk through a great valley with the Rockies behind me. And it's a beautiful old barn. It's restored to exactly the way it was when it was built in, like, 1850, 1860 or something. And it's a historic place with a great vibe and surrounded by Rockies.\n\n(SOUNDBITE OF DOCUMENTARY, \"BARN\")\n\nUNIDENTIFIED PERSON #1: It goes on the riser.\n\nUNIDENTIFIED PERSON #2: Just on the floor.\n\nGONYEA: We get to go inside thanks to a documentary film that you've also released, a film about the making of the album shot by your wife, the actor-director Daryl Hannah. You get inside. The walls are timber. It's not weatherproof. Sunlight streams through the spaces in the wall. So this is far from a controlled acoustic space.\n\nYOUNG: Well, actually, it's a perfect acoustic space because of the logs. There's no flat surfaces. The barn has a sound. But it's not an echo. It's like you're inside of a - you're being held inside something that is very friendly.\n\n(SOUNDBITE OF SONG, \"WELCOME BACK\")\n\nNEIL YOUNG AND CRAZY HORSE: (Singing) Gonna sing an old song to you right now, one that you heard before.\n\nGONYEA: Your band consists of your longtime musical partners, Crazy Horse. They certainly seem to fit right in here. Their sound is as raw and as unpolished as the barn is. And you're doing all this during the pandemic.\n\nYOUNG: Yeah. And that's - the pandemic really made this a challenge. But it also made it possible. We, of course, had to make sure that everybody was vaccinated and that everybody was clean and didn't have the virus. We just love playing music. And this is a great environment for us.\n\n(SOUNDBITE OF SONG, \"SONG OF THE SEASONS\")\n\nNEIL YOUNG AND CRAZY HORSE: (Singing) Looking through a wavy, glass window in this old place by the lake.\n\nGONYEA: OK. Let's talk about some of the songs. Tell us about the album opener, \"Song Of The Seasons.\"\n\nYOUNG: It's just a reflection of the times. It was written up in Canada. I was just thinking about things, you know, looking out the window of the cottage where we lived - a beautiful, wavy glass. It's, like, a hundred and - maybe 150 years old or something - just looking out the window at the lake and the wildlife and everything and reflecting, you know?\n\n(SOUNDBITE OF SONG, \"SONG OF THE SEASONS\")\n\nNEIL YOUNG AND CRAZY HORSE: (Singing) We're so together in the way that we feel, that we could end up anywhere.\n\nGONYEA: Some of these songs are autobiographical, looking at different phases of your life. Tell us about \"Heading West.\" And I guess west in this case is Winnipeg.\n\nYOUNG: Yeah. Well, you know, I was heading west to with my mom and her little car. And our family had just split up, which was kind of traumatic for everybody. And my mom was going back to her hometown. And I was going with her. My brother was staying with my dad.\n\nGONYEA: And you're, like, 12 years old at this time.\n\nYOUNG: Yeah, 11 or 12, something like that.\n\n(SOUNDBITE OF SONG, \"HEADING WEST\")\n\nNEIL YOUNG AND CRAZY HORSE: (Singing) When I was a little boy, pulled my wagon all through the town, went fishing at the mill, run home before the streetlights came on.\n\nYOUNG: And so I'm traveling with my mom in the car, and then we get to Winnipeg - and buys me an electric guitar. My mom was a great supporter of the band. And I used to be able to practice in our living room, and she was always cool about it.\n\n(SOUNDBITE OF NEIL YOUNG AND CRAZY HORSE SONG, \"HUMAN RACE\")\n\nGONYEA: So on the song \"Human Race,\" both frustration and anger come through, I think, more than they do on any other song.\n\n(SOUNDBITE OF SONG, \"HUMAN RACE\")\n\nNEIL YOUNG AND CRAZY HORSE: (Singing) Today, no one cares. Tomorrow...\n\nGONYEA: You and the band sing of children of the fires and floods.\n\n(SOUNDBITE OF SONG, \"HUMAN RACE\")\n\nNEIL YOUNG AND CRAZY HORSE: (Singing) Children of the fires and floods.\n\nGONYEA: I know, over the years, you've written a lot about the state of the planet and man's role in climate change. You've written songs that are warnings and wake-up calls. But this one seems particularly dire.\n\nYOUNG: Well, it's real. We don't have enough reality in what we're hearing about. People are used to getting what they want. You order something, and you get it. They don't want to give up the things that they would have to give up. So people generally just are ignoring climate change.\n\nYou know, we say we've got eight or nine years, maybe 10 years before we reach a point where, if we haven't done a lot, it's going to be irreversible damage. That's what that song's about.\n\n(SOUNDBITE OF SONG, \"HUMAN RACE\")\n\nNEIL YOUNG AND CRAZY HORSE: (Singing) Who's gonna save the human race?\n\nYOUNG: I wrote the song on my way to the barn on little pieces of paper walking across the field on the full moon in June. And I got into the barn and showed the band the chord changes. And I just said, we're only doing it once, so make every note count.\n\nGONYEA: It's interesting. It's certainly the darkest moment, I think, both musically and lyrically on the album. But it will be juxtaposed by another song. I'm thinking of \"Don't Forget Love.\"\n\n(SOUNDBITE OF SONG, \"DON'T FORGET LOVE\")\n\nNEIL YOUNG AND CRAZY HORSE: (Singing) Don't forget love.\n\nGONYEA: A song that just includes a simple reminder that almost feels like a prayer.\n\n(SOUNDBITE OF SONG, \"DON'T FORGET LOVE\")\n\nNEIL YOUNG AND CRAZY HORSE: (Singing) Don't forget love. Don't forget love. Don't forget love. When you're angry and you're lashing out, don't forget love. You don't know what you're talking about. Don't forget love.\n\nYOUNG: It's intense what we're going through and what we're going to go through. And it's going to get more intense and I think remembering that we're all together and really trying to take care of each other and stop fighting and disagreeing on everything - it's going to - it's a little bit of a rough situation we're in here. But I think love is one of the main things that can - could help us to cope.\n\n(SOUNDBITE OF SONG, \"DON'T FORGET LOVE\")\n\nNEIL YOUNG AND CRAZY HORSE: (Singing) When you got no one you can confide in, don't forget love. In every story, there's a secret hidin'. Don't forget love.\n\nGONYEA: I want to ask you about the Neil Young archives. The pandemic did give you space in your life and your schedule that you had never really had. You weren't on the road for the past couple of years. You were hunkered down, as we all were. But you had time to dive into your old work, old tapes and more. What's that been like?\n\nGONYEA: Well, the archives is, like, an ongoing thing. I've collected my music over the years and kept track of it. Things that were recorded in bootleg fashion and put out years ago, concerts at Carnegie Hall and different places that I played around the planet are all bootlegged and everything. But I recorded everything in very high quality. I use the bootleg covers and stuff.\n\nGONYEA: You're bootlegging the bootleggers.\n\nYOUNG: Yeah. I'm bootlegging the bootleggers. I thought it was pretty funny. But we got better quality than them. So...\n\nGONYEA: I bet (laughter).\n\nYOUNG: ...You know (laughter)?\n\nGONYEA: Does going through your past like this inform your present day and your future work?\n\nYOUNG: I have one rule with the archives. And it's that anything new trumps anything old. In other words, what I'm doing now is more important than what I already did. I got to do the new ones first, so they have the same chance as all those old ones do.\n\n(SOUNDBITE OF NEIL YOUNG AND CRAZY HORSE SONG, \"TUMBLIN' THRU THE YEARS\")\n\nGONYEA: Neil Young and Crazy Horse's latest album, \"Barn,\" is out now. Neil Young, thank you so much for speaking to us today.\n\nYOUNG: Thanks a lot. Take care. Good luck to you.\n\n(SOUNDBITE OF SONG, \"TUMBLIN' THRU THE YEARS\")\n\nNEIL YOUNG AND CRAZY HORSE: (Singing) Well, I was walking down the road on step at a time getting home. I was thinking about the love we share, you and me. It's a complicated thing...\n\nCopyright © 2021 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\n\nNPR transcripts are created on a rush deadline by an NPR contractor. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record."}]}