{"The Cranberries achieved international success in the 1990s with the hit singles \"Linger\" and \"Zombie\".": [{"url": "https://www.irishcentral.com/culture/irish-song-cranberries-dreams", "page_content": "The Cranberries, a rock band from Limerick, Ireland, achieved international success with their 1993 hit song \"Dreams.\" Written by lead singer Dolores O'Riordan, \"Dreams\" was the band's first single from their debut album \"Everybody Else Is Doing It, So Why Can't We?\" and remains one of their most recognizable and beloved songs.\n\n\"Dreams\" is a powerful and emotional track that showcases Dolores O'Riordan's unique vocal range and the band's musical talent. The song's catchy guitar riff and memorable chorus make it a timeless classic that has stood the test of time. \"Dreams\" quickly rose up the charts and peaked at number 27 on the US Billboard Hot 100, while also reaching the top 20 in several other countries including the UK, Canada, and Australia.\n\nThe success of \"Dreams\" propelled The Cranberries to stardom, as they soon became one of the most popular bands of the 1990s. The band's debut album, \"Everybody Else Is Doing It, So Why Can't We?\" was a commercial success, selling over 6 million copies worldwide. The album featured other hit songs such as \"Linger\" and \"Sunday,\" which further solidified The Cranberries' status as one of the most exciting new bands in the music industry.\n\nThe Cranberries continued their success with subsequent albums, including 1994's \"No Need to Argue,\" which featured the hit song \"Zombie,\" a politically charged track that has become one of the band's most iconic songs. The band's next album, \"To the Faithful Departed\" (1996), explored themes of social and political injustice and featured collaborations with artists such as The Pretenders' Chrissie Hynde and The Smiths' Johnny Marr.\n\nSign up to IrishCentral's newsletter to stay up-to-date with everything Irish! Subscribe to IrishCentral\n\nThe Cranberries' success in the 1990s was largely due to their unique sound and O'Riordan's powerful vocals. The band's blend of alternative rock and Celtic folk music, combined with O'Riordan's distinctive voice and poetic lyrics, set them apart from other bands of the time. The band's music tackled a variety of social and political issues, including the Troubles in Northern Ireland, animal rights, and the environment, making them a favorite among fans who appreciated their meaningful lyrics.\n\nSadly, in 2018, Dolores O'Riordan passed away at the age of 46. Her death was a huge loss to the music world and to The Cranberries' devoted fanbase. However, the band's legacy lives on through their timeless music, including their iconic hit \"Dreams.\" The song's enduring popularity is a testament to the band's talent and the impact they had on the music industry during the 1990s and beyond.\n\nCheck out the video here:\n\nLyrics of \"Dreams\" by The Cranberries:\n\nOh, my life is changing every day\n\nIn every possible way\n\nAnd oh, my dreams\n\nIt's never quite as it seems\n\nNever quite as it seems\n\nI know I felt like this before\n\nBut now I'm feeling it even more\n\nBecause it came from you\n\nThen I open up and see\n\nThe person falling here is me\n\nA different way to be\n\nAah, la-ah-la-ah\n\nLa-la-la\n\nLa-ah-la-ah\n\nI want more, impossible to ignore\n\nImpossible to ignore\n\nAnd they'll come true\n\nImpossible not to do\n\nPossible not to do\n\nAnd now I tell you openly\n\nYou have my heart so don't hurt me\n\nYou're what I couldn't find\n\nA totally amazing mind\n\nSo understanding and so kind\n\nYou're everything to me\n\nOh, my life is changing every day\n\nIn every possible way\n\nAnd oh, my dreams\n\nIt's never quite as it seems\n\n'Cause you're a dream to me\n\nDream to me."}, {"url": "https://www.encyclopedia.com/people/literature-and-arts/music-popular-and-jazz-biographies/cranberries", "page_content": "The Cranberries\n\nRock band\n\nEntranced by a Country Girl’s Voice\n\nDebut Release Delayed\n\nUnexpected Success Abroad\n\nSelected discography\n\nSources\n\nIrish quartet the Cranberries burst onto the scene in 1992 with their ethereal hit “Dreams,” the first single from a debut album that eventually went platinum. “What sets it apart—other, that is, from that continually astonishing voice and the effortlessly graceful arrangements—is a faintly tangible sense of ruptured innocence, of shattered hope,” mused Melody Maker writer Andrew Mueller about the group’s distinctive sound. Indeed, the youthful band survived a series of problematic encounters with bad management and a capricious press that nearly disbanded them; their astounding success in the United States was relatively unexpected but a welcome vote of confidence in their cohesive musicianship.\n\nFronted by lead singer Dolores O’Riordan, lead and bass guitars are the respective domains of brothers Noel and Mike Hogan; Feargal Lawler sits behind the drums. O’Riordan and Noel Hogan write most of the band’s material. “Truth be told, what separates the Cranberries from much of the current flock is age and experience,” wrote Rolling Stone’s Chris Mundy. “Or, in their case, the lack thereof.”\n\nO’Riordan, the Hogans, and Lawler all came into the world at Limerick’s Maternity Hospital in the early 1970s. Like others in Ireland, the bandmates grew up in relatively reduced circumstances—O’Riordan was the youngest of seven children in a household supported by her mother; Noel Hogan collected unemployment for a time. The Hogans and Lawler were originally part of an ensemble called the Cranberry Saw Us, whose fourth member, another Limerick fellow, wrote all their material in addition to his singing duties. When the band’s writer left the band in mid-1990, they began looking around for a new vocalist.\n\nO’Riordan, then living just outside Limerick, heard about the band from a school friend and showed up at an audition. “They were all laughing at me and I was really embarrassed, [because] there was about nine fellas in the room and I was the girl from the country,” the singer told Everett True in Melody Maker. “They thought I was a scream.” The three young men, however, apparently liked the sound of O’Riordan’s voice, with which she had been attracting attention since her preschool years; as a teenager she had won competitions for her solos with her church and school choirs.\n\nEntranced, the Cranberry Saw Us members invited O’Riordan to join. After practicing and shortening the band’s name to the Cranberries, they cut a three-song\n\nFor the Record …\n\nMembers include Mike Hogan (born April 29, 1973), bass; Noel Hogan (born December 25, 1971), guitar; Feargal Lawler (born March 4, 1971), drums; and Dolores O’Riordan (born September 6, 1971), vocals, guitar; all members born in Limerick, Ireland.\n\nO’Riordan worked as a clothes shop assistant and in a factory; Noel Hogan studied to be an electrician; Mike Hogan worked as a baker; Lawler was a hairdresser. Group formed in Limerick, Ireland, 1990; signed with Island Records, 1991, and released debut album, Everybody Else Is Doing It, So Why Can’t We?, 1993.\n\nAwards: Platinum record award for Everybody Else Is Doing It, So Why Can’t We?\n\nAddresses: Record company —Island Records, 825 8th Ave., New York, NY 10019.\n\ncassette titled Nothing Left at All. A second five-track release was sent out on a lark to a few record companies and to the band’s surprise, Rough Trade Records—the former home of their idols, the Smiths—expressed interest. A bidding war ensued, and the Cranberries were signed to Island Records before a mention of their name had even appeared in the music press.\n\nThe band’s obscurity was short-lived, however, as the energetic but snarky British music press instantly touted the Cranberries as the next big thing. “Wince-inducing interview after cringeworthy feature painted a picture of a band of four pristine, untainted, awestruck country souls, standing welly-deep in peat and creating the music of the Gods in between saying their rosaries and worrying the local sheep,” wrote Mueller in Melody Maker of the articles that appeared in both his paper and the New Musical Express in 1991. InOctober of that year, after they had relocated to London, the band released their first single, “Uncertain.” Melody Maker’s True termed it “as fresh and stimulating as a breeze blowing in from the North Sea.”\n\nThe Cranberries began playing various spots around Britain and wrote songs for a full-length album. In the studio, they teamed up with Stephen Street, who had produced a number of records for the Smiths and the Psychedelic Furs. Problems with management, however, proved worrisome. They had recorded their demos and “Uncertain” with a Limerick producer and studio owner who was also their manager. Yet they eventually discovered that he had been lying to each of them to varying degrees. Contemplating a breakup, they sat down on a street corner and instead opted to fire Street. “We used to trust everybody,” Noel Hogan told Melody Maker’s Mueller. “We used to think everyone was here to help us. Then we realized that they were here to help themselves.”\n\nThe resulting contractual delays and legal problems pushed back the release of the Cranberries’ first full-length album, Everybody Else Is Doing It, So Why Can’t We?, until March of 1993. Melody Maker was quick to call the LP “a superb coincidence of riches: six dozen immaculately-conceived melodies compressed into a mere 12 songs, and a voice that ravages your mood,” according to critic Peter Paphides. Kara Manning of Rolling Stone described the album as “sublimely understated yet seductively, chillingly alive.” Melody Maker reviewer Jennifer Nine noted, “Like many small things, Dolores’ voice is neither as simple nor as frail as it seems, and there’s a world of headstrong energy inside it.”\n\nO’Riordan’s vocal style, in fact, has often been cited as the group’s most undeniable hook and even sent Mueller into a reverie in his Melody Maker piece: “It comes down to the voice, doesn’t it always? The Voice: A gentle, pure Irish whisper with a tinge of huskiness which sends melancholy-splattered shards of pain and hope and love straight to your heart. The Voice: a melodic mini-scream which oscillates and reverberates out into the darkening, overcast sky…. It can sound both young and ancient simultaneously. It can span the ages. It’s so filled with emotion, it will break your heart with the merest slipped quaver.”\n\nThe Cranberries’ melodies, combined with O’Riordan’s voice, struck a chord with the listening public, and by mid-1994 Everybody’s Doing It had sold 2.8 million copies. Oddly, success in the United States from airplay on alternative and Top 40 radio helped spur sales in Britain. “I think the more the press stays away from us, the better we are,” O’Riordan told Rolling Stone’s Manning in mid-1993. “The American press is slightly more mature, but the British press is a very small group of people and they all jump on the same band at once, and they jump off the same band at once.”\n\nThe Cranberries traveled to the United States to capitalize on the success of their debut album, doing a number of opening dates for rock band The The as well as headlining appearances on their own. They also used the between-gig time to write songs for a second album and headed back into the studio in the spring of 1994 with Stephen Street. The result was No Need to Argue, released in the fall of that year. Its first single, “Zombie,” was a far cry from the band’s other hits, featuring a hard-edged guitar sound and a more strident vocal style from O’Riordan that called to mind fellow Irish singer Sinead O’Connor. Additionally, the song’s theme—a tirade against the sectarian violence that has rocked Northern Ireland, especially since 1968, was another step away from the dreamy love-struck songs of their first release.\n\nPeople’s Michael Small praised both No Need to Argue and “Zombie,” noting that “O’Riordan’s intense delivery brings out a slight tartness—which, of course, is the mark of a truly good cranberry.” Spin reviewer Jonathan Bernstein termed “Zombie” the album’s best song, “[lurching] between grindcore and whimsy, with O’Riordan mood-swinging from her normal soothing allure into growling and barnyard impersonations.” Yet Bernstein conjectured that while the Cranberries offer more than the average dream-pop band, No Need to Argu’s strong points might not be sufficient enough to sustain the group’s lasting success.\n\nThe Cranberries, their legions of fans, and their label seemed to feel differently, however, and major concert tours—including ones in Asia and Australia—were set to coincide with the success of No Need to Argue. “By the time we came to do this album, we knew what we were capable of,” Noel Hogan told Billboard writer Thom Duffy. “We’re really happy with it. We did it the way we wanted to do it. It is what it’s meant to be.”\n\nSingles\n\n“Uncertain,” Xeric, 1991.\n\n“Dreams,” Island, 1992.\n\n“Linger,” Island, 1993.\n\nAlbums\n\nEverybody Else Is Doing It, So Why Can’t We?, Island, 1993.\n\nNo Need to Argue, Island, 1994.\n\nBillboard, August 14, 1993; August 20, 1994.\n\nEntertainment Weekly, October 7, 1994; October 28, 1994.\n\nMelody Maker, October 26, 1991; October 3, 1992; January 30, 1993; March 6, 1993; March 13, 1993; November 6, 1993.\n\nMusician, November 1994.\n\nPeople, October 17, 1994.\n\nPulse!, June 1994.\n\nRolling Stone, September 2, 1993; December 23, 1993; April 21, 1994; December 1, 1994; March 23, 1995.\n\nSpin, November 1994.\n\nTime, November 7, 1994.\n\n—Carol Brennan"}, {"url": "https://www.allmusic.com/artist/the-cranberries-mn0000784814/biography", "page_content": "Combining the melodic jangle of post-Smiths indie guitar pop with the lilting, trance-inducing sonic textures of late-'80s dream pop and adding a slight Celtic tint, the Cranberries became one of the more successful groups to emerge from the pre-Brit-pop indie scene of the early '90s. Led by vocalist Dolores O'Riordan, whose keening, powerful voice was the most distinctive element of the group's sound, they initially had little impact in the United Kingdom. It wasn't until the lush ballad \"Linger\" became a worldwide hit in 1993 that the band achieved mass success. Following \"Linger,\" the Cranberries quickly became international stars, as both their 1993 debut album, Everybody Else Is Doing It, So Why Can't We?, and its 1994 follow-up, No Need to Argue, sold millions of copies and produced a string of hit singles. By the time of their third album, 1996's To the Faithful Departed, they had added distorted guitars to their sonic palette and began crafting more socially conscious music. They continued down this path into the 21st century before taking an extended hiatus in 2003 to pursue solo efforts. After nearly a decade, the quartet returned with 2012's Roses and 2017's Something Else. However, in early 2018, O'Riordan died from an accidental drowning in London. Her last vocal recordings were used to construct the Cranberries' final work, 2019's Grammy-nominated In the End, a goodbye to O'Riordan, fans, and the band itself.\n\nOriginally, the Cranberries were a band called the Cranberry Saw Us. Brothers Noel and Mike Hogan (guitar and bass, respectively) formed the band in Limerick, Ireland, with drummer Fergal Lawler in 1990. Following the departure of the group's original singer, Niall Quinn, the trio placed an advertisement for a female singer. Dolores O'Riordan responded to the advertisement and auditioned by writing lyrics and melodies to some of the band's existing demos. When she returned with a rough version of \"Linger,\" the group hired her on the spot. Shortly after she joined, the band recorded a demo tape and sold it in record stores throughout Ireland. After the original run of 300 copies sold out, the group truncated its name to the Cranberries and sent another demo tape, which featured early versions of both \"Linger\" and \"Dreams,\" to record companies throughout the U.K. The tape was made at Xeric Studios, which was run by Pearse Gilmore, who would later become their manager. At the time the tape was made, all of the members were still in their late teens.\n\nThe demo tape earned the attention of both the U.K. press and record industry, and there was soon a bidding war between major British record labels. Eventually, the group signed with Island. The Cranberries headed into the studio with Gilmore as their producer to record their first single, \"Uncertain.\" The title proved to be prophetic, as the band did indeed sound ill at ease on the single, leading to poor reviews in the press in addition to tensions between the group and Gilmore. Before they were scheduled to record their debut in 1992, the Cranberries discovered that Gilmore had signed a secret deal with Island to improve his studios. The tensions within the band became so great they nearly broke up. Instead, the Cranberries severed all relations with Gilmore, hired Geoff Travis of Rough Trade as their new manager, and hired Stephen Street, who had previously worked with the Smiths, as their new producer.\n\nThe band's debut album, Everybody Else Is Doing It, So Why Can't We?, was released in the spring of 1993, followed by a single of \"Dreams.\" Neither the album nor the single gained much attention, nor did the second single, \"Linger.\" In the summer and fall of 1993, the band toured the United States, opening for The The and Suede, respectively; frequently, the Cranberries were given a friendlier reception than either of the headliners. Their strong live shows led MTV to put \"Linger\" into heavy rotation. By the end of the year, the single was on its way to becoming a crossover hit. Eventually, the single reached number eight on the U.S. charts, while the album went double platinum. Everybody Else and \"Linger\" began to take off in Britain in early 1994; the album eventually peaked at number one during the summer.\n\nO'Riordan married the band's tour manager, Don Burton, in a much-publicized ceremony in July 1994. The marriage, as well as the group's videos, emphasized the singer as the focal point of the band. O'Riordan's position in the group continued to rise with the fall release of the group's second album, No Need to Argue. Boasting a slightly harder, more streamlined sound, yet still produced by Stephen Street, the record debuted at number six on the U.S. charts and eventually outsold its predecessor; within a year it went triple platinum, spawning the number one modern rock hit \"Zombie\" and the number 11 \"Ode to My Family.\"\n\nDuring the tour for No Need to Argue, rumors began to circulate that O'Riordan was going to leave the band to pursue a solo career, all of which the band vehemently denied. Nevertheless, the rumors persisted until the Cranberries began recording their next album with producer Bruce Fairbairn, who had previously worked with Aerosmith. The resulting effort, To the Faithful Departed, was a tougher, more rock-oriented affair. Upon its spring 1996 release, it entered the charts at number six, but its first single, \"Salvation,\" failed to become a hit on par with \"Zombie,\" \"Linger,\" or \"Ode to My Family.\" Consequently, the album slipped down the charts relatively quickly and only went platinum, which was slightly disappointing in light of its two predecessors' multi-platinum status.\n\nDuring the fall of 1996, the group canceled its Australian and European tours, sparking another round of rumors about O'Riordan launching a solo career. In 1999, the group released Bury the Hatchet, their last big chart hit, and quickly followed with 2001's Wake Up and Smell the Coffee. Shortly after the release of a greatest-hits compilation in 2003, Stars: The Best of 1992-2002, the Cranberries officially declared that they were taking a break. This finally gave O'Riordan the time she needed to work on her long-talked-about solo album, Are You Listening?, which hit shelves in 2007. In 2009, O'Riordan released her second solo album, No Baggage. Around the same time, the Cranberries reunited for a North American tour that continued throughout Europe in 2010. Several live albums also appeared in 2010.\n\nIn 2011, the band began work on a new album in Toronto with longtime producer Street. Released nearly a decade after the start of their extended hiatus, the resulting album, Roses, arrived in March 2012. A supporting tour followed, recorded for posterity at London's Hammersmith Apollo on Live 2012. At the end of 2013, O'Riordan performed a New Year's Eve concert in Limerick with a string quartet from the Irish Chamber Orchestra. Inspired by the classical interpretation of the Cranberries sound, she approached the band with an idea to celebrate their silver anniversary. The result was a full album comprising string quartet renditions of the band's biggest hits. Something Else arrived in the spring of 2017, featuring their ten most successful singles culled from their first four albums, as well as three new songs. The band kicked off a tour in support of the album, but it was cut short due to O'Riordan's ongoing back problems.\n\nOn January 15, 2018, O'Riordan died of an accidental drowning at the age of 46 in London. At the time of her death, the Cranberries were in the middle of recording a new effort. After taking some time to process the tragedy, the remaining bandmembers decided to finish the project. Along with Stephen Street, they completed the LP using O'Riordan's demo vocals. Released in April 2019, In the End featured the single \"All Over Now\" and served as the Cranberries' final album. Peaking in the Top 10 across Europe and in the U.S. side charts, the farewell set was later nominated for a Grammy for Best Rock Album."}, {"url": "https://www.independent.co.uk/news/obituaries/dolores-o-riordan-irish-singer-songwriter-cranberries-childhood-abuse-linger-zombie-a8166776.html", "page_content": "For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails Sign up to our free breaking news emails Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\n\nIrishness was in vogue on the British music scene of the early 1990s, with U2 maintaining their global popularity, Enya and Sinéad O’Connor gaining traction on both sides of the Atlantic and The Commitments enjoying success at the cinema.\n\nThe Cranberries though, led by the extraordinary, distinctive vocals of Dolores O’Riordan, would have broken through in any era.\n\nQuite apart from the powerful, lilting tone of her mezzo-soprano voice, what distinguished O’Riordan from the indie-rock crowd was her refusal to disown her roots.\n\nShe delivered her songs in the accent of the area where she was born and grew up; Ballybricken near the city of Limerick in the west of Ireland.\n\nO’Riordan, who was 46, was found dead in a London hotel hours before she was due to record a cover of one of the Cranberries’ best-known numbers, “Zombie”, with the hard-rock band Bad Wolves.\n\nAdding to the poignancy was the revelation on the day of her death that the parents of 12-year-old Tim Parry – one of two children killed in Warrington, Cheshire in 1993 by an IRA bomb – were unaware until they read in reports of her passing that she wrote the song in response to their son’s killing.\n\nWith hindsight, the brutal, haunting feel of “Zombie” may have been influenced by O’Riordan’s experience of being sexually abused by a family friend as a child. She did not speak publicly about the assaults until 2013.\n\nBorn into a staunchly Catholic family, O’Riordan was 17 when she responded to a press advert for a female vocalist to join The Cranberry Saw Us, comprising brothers Noel and Mike Hogan and Fergal Lawler, in 1989. Soon after she became lead singer, they became The Cranberries and cut a three-track EP on an independent label.\n\nThe Cranberries in 1999, 10 years after their formation (Rex ) (Rex)\n\nO’Riordan and Noel Hogan contributed several songs to a demo disc which was sent to the major British labels. Island Records won the tussle to sign them and released the singles “Dreams” and “Linger”, both from their debut album Everybody Else Is Doing It, So Why Can’t We. Their burgeoning reputation as a live act, honed when they supported REM and Suede, helped them reach numbers 27 and 14 respectively in the UK charts.\n\nThe tracks highlighted O’Riordan’s versatility as a singer and a writer, the pretty and ethereal “Dreams” contrasting with “Linger”, a bitter tale of unrequited love set, deceptively, to swooning strings and a gorgeous melody.\n\nO’Riordan based the latter’s lyrics on personal experience, explaining she had expected her first teenage kiss with tongues, in a Limerick disco, to be “disgusting”. Instead she enjoyed it so much, she had to “let it linger”.\n\nWhen she next saw the object of her lingering desire, he ignored her and asked her friend to dance. “Everyone saw me being dumped,” O’Riordan recalled. “Everything’s so dramatic at 17, so I poured it into a song.”\n\nModest chart success came in 1994 for “Zombie” and O’Riordan’s wistful paean to childhood, “Ode To My Family” (both from the second album No Need to Argue, which sold 17 million copies worldwide including 7 million in America).\n\nYet only three of the seven singles between 1995 and 2000 reached the UK top 20 – The Cranberries obviously did not fit the Britpop fad – but 1996’s To the Faithful Departed and 1999’s Bury the Hatchet peaked at number 4 and number 13 in the album best-sellers, suggesting a good proportion of their fanbase had stuck with them.\n\nO’Riordan performs at the Cognac Blues Passions festival in 2016 (AFP/Getty)\n\nO’Riordan was married to Don Burton, Duran Duran’s tour manager, and had three children with him before they divorced after more than 20 years’ marriage. Two solo albums, 2007’s Are You Listening? and 2009’s No Baggage, fared well with reviewers but found limited commercial success. The Cranberries had effectively disbanded in 2003 but after six years apart they reunited for an album and worldwide tour.\n\nIn 2015 she cited her divorce and the death of her father in mitigation of assaults on police at Shannon Airport in what was described as an “air rage incident”. She was diagnosed with bipolar disorder and spoke about her struggle with eating disorders, alcoholism and the abuse she suffered in early life.\n\nThere were other extracurricular recording projects, one with Twin Peaks composer Angelo Badalamenti and another with former Smiths bassist Andy Rourke, before The Cranberries again regrouped for a tour last year to promote the acoustic album Something Else. O’Riordan had to withdraw because of back problems, but friends reported she seemed well in London shortly before her death.\n\nDolores Mary Eileen O’Riordan, singer and songwriter, born 6 September 1971, died 15 January 2018"}, {"url": "https://entertainment.inquirer.net/34627/the-cranberries-life-is-sweeter-the-second-time-around", "page_content": "The Cranberries stood out in the 1990s alternative rock scene because its lead singer-songwriter, Dolores O’Riordan, possessed a distinct, captivating voice. The Irish group recorded five albums that yielded a number of hit singles—“Linger,” “Dreams,” “Zombie,” “Ode to My Family,” “Ridiculous Thoughts,” “Salvation,” “Free to Decide,” “Promises”—before going on a four-year hiatus.\n\nReuniting in 2009, The Cranberries proceeded to record a new album, “Roses,” which was released this year.\n\nADVERTISEMENT\n\nThe band’s cofounder and guitarist, Noel Hogan, spoke to the Inquirer by phone from Sydney while resting in between shows for its current tour. The Cranberries’ Manila concert is on April 10 at the Smart Araneta Coliseum.\n\nWhat was the scene like in Limerick before The Cranberries was formed?\n\nEverybody wanted to be in a band. There were gigs seven nights a week. We saw The Smiths, The Cure, Echo and the Bunnymen, all these bands, playing.\n\nThe band’s original vocalist was Niall Quinn, who left before the remaining members took on the name The Cranberries. Why did you choose a female singer to front it?\n\nWe were looking for a replacement. When Dolores came in, she sounded completely different. She had such a strong voice and she sang in an effortless manner. I don’t think she was even aware of it.\n\nThe band had just started out when it fired its first manager, who also produced its first EP. What went wrong?\n\nWe had different ideas on how the songs should sound. There was a lot of pressure from the record company on what direction to take. We also thought the EP was overproduced.\n\nADVERTISEMENT\n\nThe Cranberries achieved commercial success and one of its most famous songs was “Zombie,” which was about political strife in Ireland. Was it natural at that time for the band to tackle social issues through songs?\n\nBefore “Zombie” came out, most of the songs we wrote were about love and relationships. We were on tour and CNN was on TV when Dolores started writing the lyrics to “Zombie.” She felt strongly about it and we had no idea it was going to be a massive hit.\n\nWhat were the pitfalls of fame and fortune in the case of The Cranberries?\n\nThe downside is you tend to lose your way … There’s always the pressure of coming up with another hit. The trick is how to avoid falling into that trap.\n\nWhat led to the band’s breakup in 2004?\n\nWe felt we were not doing anything different. It was just album, tour, album, tour … and nobody was enjoying it anymore. I had ideas, Dolores had her own ideas. And then we started raising kids and focused more on family life.\n\nDid you find fulfillment in your solo projects?\n\nGoing solo was like having a massive weight off my shoulders. I was able to move on after years of being in a band. Suddenly, every dream is yours alone … You make good and bad choices but it’s all right. I started doing production work… I totally enjoyed life on my own.\n\nThe band said it felt right to get back together recently. What was different this time around?\n\nWe were getting older and there was no point in worrying over petty things in the past. We laugh a lot more these days.\n\nWhat have you learned so far from the music industry?\n\nThis is a job that can be fun. It’s important for musicians to enjoy every minute of it, because in the blink of an eye it could be over. And then you wonder where it all went. You have to soak it all in, everything that happens while you’re on the scene.\n\nYour subscription could not be saved. Please try again. Your subscription has been successful. Subscribe to our daily newsletter SIGN ME UP\n\nRead Next\n\nFollow @Inq_Lifestyle on Twitter"}, {"url": "https://www.liveabout.com/top-irish-pop-groups-3248216", "page_content": "The island of Ireland has a strong pop music tradition ranging from the days of punk and new wave to contemporary pop. These are the best of the Irish pop groups.\n\n10 of 10 U2 U2. Photo by Chris Jackson / Getty Images U2 first came together in 1976 when the group members were still teenagers. They have since become one of the top pop-rock bands of all time. U2 are credited with record sales of more than 150 million worldwide and are members of the Rock and Roll Hall Of Fame. They topped the U.S. album chart with seven studio albums and two compilations. Six singles reached the top 10 on the U.S. pop singles chart. In the course of their career, U2 won 22 Grammy Awards, more than any other rock band. They are also champions of human rights and philanthropic work. Among the causes the group and/or individual members support are Amnesty International, War Child, and Music Rising. U2 released the album Songs of Experience in December 2017. It reached #1 on the U.S. album chart, their first chart-topper in eight years. Top Hits \"With Or Without You\"\n\n\"One\"\n\n\"I Still Haven't Found What I'm Looking For\" Watch Video\n\n09 of 10 Westlife Westlife. Photo by Patrick Ford / Redferns Westlife began as a group called Six To One that changed their name to IOYOU. They came to the attention of Irish manager Louis Walsh, and Simon Cowell expressed interest in signing them but insisted on cutting three members. New auditions resulted in adding two new group members. The group had their first big break in 1998 opening for Boyzone and Backstreet Boys in Dublin. Westlife released ten consecutive top 3 charting studio albums in the U.K. The group topped the U.K. pop singles chart 13 times. Westlife officially broke up in 2012. In a 2016 interview, group member Shane Filan said, while there were no official plans, he wouldn't rule out a reunion at some point in the future. All Westlife members have released solo albums. Brian McFadden has experienced the greatest success. Three of his solo singles have reached the top 10 on the U.K. pop charts. Shane Filan also released a significant pop hit single. \"Everything to Me\" went to #14 in the U.K. in 2013. Top Hits \"Uptown Girl\"\n\n\"You Raise Me Up\"\n\n\"Queen Of My Heart\" Watch Video\n\n08 of 10 Boyzone Boyzone. Photo by Dan Kitwood / Getty Images The boy band Boyzone began in 1993 when manager Louis Walsh placed advertisements for applicants to take part in an \"Irish Take That.\" More than 300 applicants responded, and they all sang George Michael's \"Careless Whispers\" for the initial audition. Eventually, producers narrowed the applicants down to the membership that became Boyzone. They soon became one of the world's most successful boy bands. The group signed a major label contract in 1994 and their first single, a cover of the Four Seasons' \"Working My Way Back To You,\" reached #3 at home in Ireland. It was followed by 16 consecutive top 5 hit singles in the U.K. before the group went on hiatus in 2001. Boyzone came back together in 2008 and earned two more top 10 hits. Stephen Gately, one of the group's two lead vocalists, died suddenly in 2009. Boyzone rallied to release the #1 charting U.K. album Brother in 2010. They followed it with BZ20 in 2013 that climbed to #6. However, they have failed to have significant hit singles off either album. Boyzone planned a 25th-anniversary concert tour for 2018. In April 2018, the group announced that they would break up permanently after the release of one more studio album, a tribute to Stephen Gately, and the concert tour. Top Hits \"No Matter What\"\n\n\"Words\"\n\n\"When the Going Gets Tough\" Watch Video\n\n07 of 10 Snow Patrol Snow Patrol. Photo by Stephen Shugerman / Getty Images The members of Snow Patrol are Irish, but they hail from Northern Ireland instead of the Irish Republic. The group first came together in 1994. Snow Patrol did not have significant commercial success until their major label debut album Final Straw in 2003. It included the top 5 U.K. pop hit single \"Run,\" but it was the follow-up, 2006' s Eyes Open and the single \"Chasing Cars\" that turned the group into international superstars. \"Chasing Cars\" earned a Grammy Award nomination for Best Song and became one of the biggest U.K. pop hits of all time. Snow Patrol's two most recent albums, 2008's A Hundred Million Suns and 2011's Fallen Empires have both reached the top 10 on the U.S. album chart. However, they have failed to generate a significant pop hit single to follow up \"Chasing Cars.\" The group initially announced their next studio album would reach stores in 2016. However, group leader Gary Lightbody said that he battled a period of writer's block and scrapped a set of songs in favor of even better new songs. Snow Patrol announced in January 2018 that their next album Wildness is on track for a May 2018 release. Top Hits \"Chasing Cars\"\n\n\"Run\"\n\n\"Signal Fire\" Watch Video\n\n06 of 10 The Script The Script. Photo by Scott Barbour / Getty Images Rock band The Script was formed in Dublin in 2001. Lead vocalist Danny O'Donoghue is the group's leader. The group's music featured in a wide range of TV shows. Their self-titled debut album hit #1 on the U.K. album chart in 2008. It included the band's breakthrough pop hit in the U.S. \"Breakeven\" which sold over two million copies and reached #1 on the adult pop and adult contemporary charts. 2010's \"For the First Time\" continued the group's success in the U.S. and 2012's \"Hall Of Fame\" became The Script's first #1 pop hit single in the U.K. The Script released their fourth studio album No Sound Without Silence in 2014. Danny O'Donoghue described it as a prequel to the group's debut album. It debuted at #1 on the UK album chart, the group's third to top that chart, and reached the top 10 in the U.S. The single \"Superheroes\" was a #3 charting pop single in the U.K. In September 2017, the Script released their fifth studio album Freedom Child. It addresses including terrorism and political division in the U.S. Critics were mixed in their opinions of the new album. It reached #1 on the Irish album chart. Top Hits \"Breakeven\"\n\n\"For the First Time\"\n\n\"Hall Of Fame\" with will.i.am Watch Video\n\n05 of 10 The Cranberries The Cranberries. Photo by Catherine McGann / Getty Images The Cranberries are an Irish rock band led by vocalist Dolores O'Riordan that came together in 1990. The group achieved significant worldwide success in the 1990s and sold over 40 million albums worldwide. The group's first breakthrough occurred with the 1993 single \"Linger.\" MTV latched on to the song and its music video turning it into a top 10 pop hit in the U.S. The Cranberries turned to heavier rock with their next album No Need To Argue and the single \"Zombie\" which referenced the 1916 Easter Rising in Ireland. The Cranberries went on hiatus from 2004 to 2008 while group members worked on other projects. They reunited for a North American and European tour in 2009 in the wake of the released of Dolores O'Riordan's solo album No Baggage. The group released their next album Roses in 2012. It hit #51 on the US album chart. Lead vocalist Dolores O'Riordan died unexpectedly at age 46 in January 2018. She was in London to work on new recordings. The group plans to complete a final album with vocals already recorded by O'Riordan. Top Hits \"Linger\"\n\n\"Zombie\"\n\n\"Salvation\" Watch Video\n\n04 of 10 The Corrs The Corrs. Photo by Dave Hogan / Getty Images The Corrs are a family group who play a combination of pop and traditional Irish folk music. The band consists of the Corr siblings, three sisters, and their brother. The group's career began to take off when they appeared in the 1991 hit movie The Commitments. The Corrs' 2000 recording of \"Breathless\" with producer Robert John \"Mutt\" Lange hit #1 in the UK and broke them into the top 40 in the U.S. The group went on temporary hiatus in 2006 while the members worked on other projects. In 2015 the group came back together for a European tour and a sixth studio album titled White Light. It hit the top 10 on the U.K. albums chart but failed to produce any hit singles. The group announced in 2017 that they were at work at a seventh album to be produced by T-Bone Burnett. The group released the album titled Jupiter Calling in November 2017. It reached the top 20 on the U.K. album chart, and the Corrs promoted it with a concert at the Royal Albert Hall in London. Top Hits \"Breathless\"\n\n\"Runaway\"\n\n\"Summer Sunshine\" Watch Video\n\n03 of 10 Boomtown Rats The Boomtown Rats. Photo by Fin Costello / Redferns The Boomtown Rats were a critical new wave band of the late 1970s and early 1980s led by Bob Geldof. When the group's \"Rat Trap\" hit #1 in the U.K. in 1978, it was the first #1 U.K. pop hit single by any Irish group. The band is probably best remembered for the 1979 #1 hit \"I Don't Like Mondays.\" The song tells the story of 16-year-old Brenda Ann Spencer who went on a shooting spree at a San Diego, California elementary school. It won the Ivor Novello Award for Best Pop Song. However, many radio stations banned the song due to its violent content. The Boomtown Rats continued to hit the U.K. charts with singles into the mid-1980s. They released a total of five top 10 pop hit singles. Lead vocalist Bob Geldof co-wrote the charity holiday hit \"Do They Know It's Christmas?\" and played a crucial role in putting together the Live Aid charity concerts. Queen Elizabeth II knighted him. The Boomtown Rats came back together as a functioning band in 2013. The group performed shows in the U.K. and Ireland, and they re-entered the studio to record an as-yet-unreleased new album. It will be the band's first set of new songs since 1984's In the Long Grass. Top Hits \"I Don't Like Mondays\"\n\n\"Rat Trap\"\n\n\"Banana Republic\" Watch Video\n\n02 of 10 The Pogues The Pogues. Photo by ShowBizIreland / Getty Images The Pogues are a legendary Celtic punk band. The best-known lineup operated through most of the 1980s with lead vocalist Shane MacGowan. They first gained significant attention opening for The Clash on a 1984 concert tour. For a short time in the 1990s, Joe Strummer, a founding member of the Clash, sang with the Pogues. The group first broke into the top 10 of the U.K. pop singles chart with a version of the Irish folk song \"Irish Rover\" recorded with the Dubliners. Two of their songs went all the way to #1 on the pop singles chart at home in Ireland. In 1987 they released \"Fairytale Of New York,\" recorded with singer-songwriter Kirsty MacColl which has become a perennial Christmas hit in the U.K. It has sold more than 1.2 million copies in the U.K. alone. The Pogues broke up in 1996, but they decided to come back for a Christmas tour in 2001 and have remained together roughly ever since. However, they are only a touring band and have no plans to record new studio music. Their final studio album Pogue Mahone was released in 1996. Top Hits \"Fairytale Of New York\" with Kirsty MacColl\n\n\"Irish Rover\" with the Dubliners\n\n\"If I Should Fall From Grace With God\" Watch Video"}, {"url": "https://www.thesun.co.uk/tvandshowbiz/5347722/cranberries-hit-songs-zombie-linger-lyrics-about/", "page_content": "The Cranberries found global success in the 1990s with their unique take on rock music\n\nDOLORES O'Riordan tragically passed away during a January 2018 recording session for her band The Cranberries.\n\nHere are all their biggest hits and what Dolores said about their most-loved tracks...\n\n2 The Cranberries found worldwide success in the 1990s Credit: AFP - Getty\n\nWhat were The Cranberries' biggest hits?\n\nThe Cranberries released 20 tracks throughout their career.\n\nTheir biggest hits in the UK include:\n\nDreams #27\n\nLinger #14\n\nZombie #14\n\nOde to me Family #26\n\nI Can't Be With You #23\n\nRidiculous Thoughts #20\n\nSalvation #13\n\nFree to Decide #33\n\nPromises #13\n\nTheir 1994 album No Need To Argue achieved triple platinum status in the United Kingdom and sold over seven million copies in the US.\n\nIt peaked at No2 in the UK album charts as did To The Faithful Departed.\n\nTheir debut album Everybody Else Is Doing It, So Why Can't We? reached No1.\n\nBury The Hatchet was also a top 10 hit, with a high of No7.\n\nWere The Cranberries working on new music?\n\nDolores passed away during a time when the band were recording new music.\n\nShe'd previously expressed interest in releasing brand new music during a TV interview in 2017.\n\nDolores said: \"It's like riding a bike, you click back into it very quickly, it's like second nature.\n\n\"We hope not to have too many gaps because we are getting older and it's been such a long time since we did anything.\n\n\"The only thing is health permitting, we would like to tour extensively in the next 12 months and we would like to bring out an album of new material for our fans.\"\n\n2 Dolores O'Riordan has died aged 46 Credit: Copyright (c) 2017 Rex Features. No use without permission.\n\n\n\n\n\nWhat are the lyrics to Zombie?\n\nAnother head hangs lowly\n\nChild is slowly taken\n\nAnd the violence caused such silence\n\nWho are we mistaken\n\nBut you see it's not me\n\nIt's not my family\n\nIn your head, in your\n\nHead they are fighting\n\nWith their tanks and their bombs\n\nAnd their bombs and their guns\n\nIn your head,\n\nIn your head they are crying\n\nIn your head, in your head\n\nZombie, zombie, zombie\n\nHey, hey\n\nWhat's in your head, in your head,\n\nZombie, zombie, zombie\n\nHey, hey, hey, oh\n\nDo, do, do, do\n\nDo, do, do, do\n\nDo, do, do, do\n\nDo, do, do, do\n\nAnother Mother's breaking\n\nHeart is taking over\n\nWhen the violence causes silence\n\nWe must be mistaken\n\nIt's the same old theme since nineteen-sixteen\n\nIn your head,\n\nIn your head they're still fighting\n\nWith their tanks and their bombs\n\nAnd their bombs and their guns\n\nIn your head, in your head they are dying\n\nIn your head, in your head\n\nZombie, zombie, zombie\n\nHey, hey\n\nWhat's in your head, in your head\n\nZombie, zombie, zombie\n\nHey, hey, hey\n\nOh, oh, oh, oh, oh, oh, oh\n\nHey, oh, ya, ya\n\nWhat are the lyrics to Linger?\n\nIf you, if you could return\n\nDon't let it burn\n\nDon't let it fade\n\nI'm sure I might be rude\n\nBut it's just your attitude\n\nIt's tearing me apart\n\nIt's ruining every day\n\nAnd I swore, I swore I would be true\n\nAnd honey, so did you\n\nSo why were you holding her hand?\n\nIs that the way we stand?\n\nWere you lying all the time?\n\nWas it just a game to you?\n\nBut I'm in so deep\n\nYou know I'm such a fool for you\n\nYou've got me wrapped around your finger\n\nDo you have to let it linger?\n\nDo you have to, do you have to, do you have to let it linger?\n\nOh, I thought the world of you\n\nI thought nothing could go wrong\n\nBut I was wrong, I was wrong\n\nIf you, if you could get by\n\nTrying not to lie\n\nThings wouldn't be so confused\n\nAnd I wouldn't feel so used\n\nBut you always really knew\n\nI just want to be with you\n\nAnd I'm in so deep\n\nYou know I'm such a fool for you\n\nYou've got me wrapped around your finger\n\nDo you have to let it linger?\n\nDo you have to, do you have to, do you have to let it linger?\n\nAnd I'm in so deep\n\nYou know I'm such a fool for you\n\nYou've got me wrapped around your finger\n\nDo you have to let it linger?\n\nDo you have to, do you have to, do you have to let it linger?\n\nYou know I'm such a fool for you\n\nYou've got me wrapped around your finger\n\nDo you have to let it linger?\n\nDo you have to, do you have to, do you have to let it linger?"}, {"url": "https://www.thesun.ie/tvandshowbiz/music/2051655/what-were-the-cranberries-hit-songs-when-did-dolores-oriordan-write-zombie-and-linger-and-what-are-the-lyrics/", "page_content": "The Cranberries found global success in the 1990s with their unique take on rock music\n\nDOLORES O'Riordan tragically passed away during a January 2018 recording session for her band The Cranberries.\n\nHere are all their biggest hits and what Dolores said about their most-loved tracks...\n\n2 The Cranberries found worldwide success in the 1990s Credit: AFP - Getty\n\nWhat were The Cranberries' biggest hits?\n\nThe Cranberries released 20 tracks throughout their career.\n\nTheir biggest hits include:\n\nDreams (UK #27)\n\nLinger (UK #14)\n\nZombie (UK #14)\n\nRidiculous Thoughts (UK #20)\n\nSalvation (UK #13)\n\nTheir 1994 album No Need To Argue achieved triple platinum status in the United Kingdom and sold over seven million copies in the US.\n\nWere The Cranberries working on new music?\n\nDolores passed while in a recording session for the band.\n\nShe'd previously expressed interest in releasing brand new music during a TV interview in 2017.\n\nDolores said: \"It's like riding a bike, you click back into it very quickly, it's like second nature.\n\n\"We hope not to have too many gaps because we are getting older and it's been such a long time since we did anything.\n\n\"The only thing is health permitting, we would like to tour extensively in the next 12 months and we would like to bring out an album of new material for our fans.\"\n\n2 Dolores O'Riordan has died aged 46 Credit: Copyright (c) 2017 Rex Features. No use without permission.\n\n\n\n\n\nWhat are the lyrics to Zombie?\n\nAnother head hangs lowly\n\nChild is slowly taken\n\nAnd the violence caused such silence\n\nWho are we mistaken\n\nBut you see it's not me\n\nIt's not my family\n\nIn your head, in your\n\nHead they are fighting\n\nWith their tanks and their bombs\n\nAnd their bombs and their guns\n\nIn your head,\n\nIn your head they are crying\n\nIn your head, in your head\n\nZombie, zombie, zombie\n\nHey, hey\n\nWhat's in your head, in your head,\n\nZombie, zombie, zombie\n\nHey, hey, hey, oh\n\nDo, do, do, do\n\nDo, do, do, do\n\nDo, do, do, do\n\nDo, do, do, do\n\nAnother Mother's breaking\n\nHeart is taking over\n\nWhen the violence causes silence\n\nWe must be mistaken\n\nIt's the same old theme since nineteen-sixteen\n\nIn your head,\n\nIn your head they're still fighting\n\nWith their tanks and their bombs\n\nAnd their bombs and their guns\n\nIn your head, in your head they are dying\n\nIn your head, in your head\n\nZombie, zombie, zombie\n\nHey, hey\n\nWhat's in your head, in your head\n\nZombie, zombie, zombie\n\nHey, hey, hey\n\nOh, oh, oh, oh, oh, oh, oh\n\nHey, oh, ya, ya"}, {"url": "https://www.officialcharts.com/artist/28619/cranberries/", "page_content": "Title, Artist Peak\n\nPos WoC Wks\n\nNo 1 Chart\n\nFacts\n\nBURY THE HATCHET CRANBERRIES ISLAND US/MERCURY 5246442 07 06 00 Buy\n\nROSES CRANBERRIES COOKING VINYL COOKCD552 37 02 00 Buy Listen"}, {"url": "https://sydneytrads.com/2014/03/31/delores-oriordan-the-icicle-melts/", "page_content": "What follows are programme notes for the “Conservative Song” segment of Radio Carpe Diem compiled by Dominik Giemza. The notes were produced for a broadcast of Monday, 25 October 2010, and form the basis of a live on-air discussion about conservative and traditionalist themes that can be inferred from items of popular music. Radio Carpe Diem is Australia’s only paleoconservative and traditionalist radio programme and can be accessed online or free to air at 88.9FM at 8:00pm to 10:00pm Mondays (Sydney, Australia). Readers’ comments are welcome here at SydneyTrads. Listeners are encouraged to tune in and engage in the discussion.\n\nThe Cold Heart of Feminism\n\nIntroduction\n\nHere on Carpe we love Western Cultural values particularly when they are expressed in the wonderful Country and Western music of the United States of America. However there is a very broad range of conservative music that hails from around the world and takes its forms in many different genres. Tonight we will hear a piece from the traditional Catholic country of Ireland from that so not conservative decade of music – the 1990’s. Our conservative song is “The Icicle Melts” by the “Cranberries” a very Irish rock song sung in a very Irish way by an Irish woman about something dear to the hearts of Catholics (and the Irish) – the gift of life and the assault on it by modern feminism.\n\nBackground\n\nThe “Cranberries” were formed in Limerick, Ireland in 1989 under the name “The Cranberry Saw Us”, later changed to simply the “Cranberries.” The band consists of singer and song writer Delores O’Riordan, guitarist Noel Hogan, bassist Mike Hogan and drummer Fergal Lawler. Although widely associated with alternative rock, the band’s sound also incorporates indie, indie pop, rock, post-punk, Irish folk and pop rock elements.\n\nThe Cranberries rose to international fame in the 1990s with their debut album, “Everybody Else Is Doing It, So Why Can’t We?” which became a commercial success and sold over five million copies in the United States. The group was one of the most successful rock acts of the ’90s and sold over 14.5 million albums in the United States alone. The band has achieved four top 20 albums on the Billboard 200 chart (“Everybody Else Is Doing It”, “So Why Can’t We?”, “No Need to Argue”, “To the Faithful Departed” and “Bury the Hatchet”) and eight top 20 singles (“Linger”, “Dreams”, “Zombie”, “Ode to My Family”, “Ridiculous Thoughts”, “Salvation”, “Free To Decide” and “Promise”) which everyone was singing around my campus during my undergraduate years.\n\nThe song is found on “No Need to Argue” the second album by the band, released in 1994. It was the band’s most successful album, and has sold about 17 million copies worldwide. According to Wikipedia “the album’s mood is darker than that on Everybody Else Is Doing It, So Why Can’t We?. It shows a more mature performance by lyricist and vocalist Dolores O’Riordan, writing about war, death, love and disappointment.” Notice how Wikipedia does not mention the subject matter of this song!\n\nThe song’s singer and writer, Dolores O’Riordan was born on 6 September 1971 in Ballybricken, Limerick, Ireland the youngest of seven children. She has been married since 1994 and now has three children of her own and in 2009 was awarded the Honorary Patronage of the University Philosophical Society, Trinity College Dublin. It doesn’t take Sherlock Holmes to determine that she is a Catholic.\n\nNotes for the Discussion\n\nThe “Icicle Melts” was included in the National Review top 50 conservative rock songs compilation. John J Miller simply noted in that compilation that this was: “A pro-life tune sung by Irish warbler Dolores O’Riordan.”\n\nBut that description sells it short for this is a truly heartfelt piece sung from a woman’s perspective – an impassioned critique of the heartlessness of the process of abortion (and more importantly the “choice” it is sold as) that is presented as an icicle as a metaphor for a cold heart and the reasoning for it as a “picture show” for its detachment from reality through an illusion not unlike the suspension of disbelief that exists when viewing the cinema. One also wonders whether “picture show” is a reference to a particular life and/or series of expectations that is sold as a fantasy to women.\n\nBut the reality is of course far starker, as the following words show:\n\nThere’s a place for the baby that died,\n\nAnd there’s time for the mother who cried.\n\nAnd she will hold him in her arms sometime,\n\n‘Cause nine months is too long, too long, too long…\n\nNote the reference to the “place” a reference to heaven, a reference to “time” a period for the conscience to find reckoning and redemption – the icicle melting as reflection reveals the reality of what is lost. The reference to “nine months” puts it all into perspective, nine months of pain and inconvenience in a woman’s life as against a lifetime that is entirely lost. But wait, there’s more:\n\nHow could you hurt the child?\n\nNow, does this make you satisfied,\n\nSatisfied, satisfied?\n\nThis passage powerfully juxtaposes the ultimate hurt to a child with the nihilistic notion of satisfaction. Are women in reality being peddled a myth, a picture show, a sugary story of detached selfishness masquerading as satisfaction? And that is the real cold hard reality – that such myths are peddled in order to freeze the heart of a mother to make a decision based on wants and utility rather than one based on a respect for humanity and all that goes with it.\n\nThe freezing of hearts appears to be what the feminists are doing and I don’t think Ms O’Riordan will have a bar of it. It’s time to get real, this is not a victimless crime, and time and time again the final reckoning shows that this crime has two victims, one dead (never having lived) and the other at best living a lie (suspending disbelief in the gravity of her act) or at worst silently crying at the life that once lost cannot be taken back.\n\nLyrics\n\nWhen, when will the icicle melt,\n\nThe icicle, icicle?\n\nAnd when, when will the picture show end,\n\nThe picture show, picture show? I should not have read the paper today,\n\n‘Cause a child, child, child, child he was taken away. There’s a place for the baby that died,\n\nAnd there’s time for the mother who cried.\n\nAnd she will hold him in her arms sometime,\n\n‘Cause nine months is too long, too long, too long… How, how could you hurt the child,\n\nHow could you hurt the child?\n\nNow, does this make you satisfied,\n\nSatisfied, satisfied? I don’t know what’s happ’ning to people today,\n\nWhen a child, child, child, child, he was taken away. There’s a place for the baby that died,\n\nAnd there’s time for the mother who cried.\n\nAnd she will hold him in her arms sometime,\n\n‘Cause nine months is too long, too long, too long… There’s a place for the baby that died,\n\nAnd there’s time for the mother who cried.\n\nAnd you will hold him in your arms sometime,\n\n‘Cause nine months is too long, too long, too long,\n\nToo long.\n\n– Dominik Giemza\n\nThe writer is a legal practitioner and the co-host of Carpe Diem Radio’s regular segment: the “Conservative Song” . The above notes were drafted for a live and on air debate about conservative and traditionalist themes which can be found in popular music. Listeners can access Radio Carpe Diem either on air at 2RSR 88.9FM in the greater Sydney region, each Monday between 8:00pm and 10:00pm, or streaming live via TuneIn.com. Feedback is welcome."}]}