{"The Third Dalai Lama was a great patron of the arts and was responsible for the construction of many temples and monasteries.": [{"url": "http://en.youth.cn/Inter_Channel/Top_News/201207/t20120702_2246463.htm", "page_content": "Not a \"spiritual leader,\" but a political figure clad in kasaya.\n\nPerhaps, the followers and supporters of the 14th Dalai Lama have seldom questioned the role of the political monk in essence in Tibetan history, nor realized what it would mean for the Tibetan people if the Dalai Lama and his clique returned to power.\n\nThe memory should unfold from 1959, in the year the Dalai Lama fled China and went into exile in India, where he set up a state apparatus called \"Tibetan government-in-exile\" run by aristocratic, nepotistic monks that collected taxes, jailed and tortured dissenters and engaged in all the usual political intrigues.\n\nWas this a myth? The monastic nobility headed by the Dalai Lama controlled all land on behalf of the \"gods\". They monopolized the common wealth by exacting tribute and labor services from peasants and herders. This system was somewhat akin to how the medieval Catholic Church exploited peasants in feudal Europe.\n\nTibetan peasants and herders had little personal freedom. Without the permission of the priests, or lamas, they could not do anything. They were considered appendages to the monastery. The peasantry lived in dire poverty while enormous wealth accumulated in the monasteries and in the Dalai Lama's palace in Lhasa.\n\nIn 1956 the Dalai Lama, fearing that \"the Chinese central government would soon move on Lhasa,\" issued an appeal for gold and jewels to construct another throne for himself. This, he argued, would help rid Tibet of \"bad omens\". One hundred and twenty tons were collected. When the Dalai Lama fled to India in 1959, he was preceded by more than 60 tons of treasure.\n\nWhat makes the \"colorful\" Dalai Lama more \"legendary\" is nothing more than his close links with the CIA.\n\nHis \"government\" set up in exile in India, at least until the 1970s, received $US1.7 million a year from the CIA.\n\nThe money was to pay for guerilla operations against the Chinese PLA, notwithstanding the Dalai Lama's public stance in support of non-violence, for which he was awarded the Nobel Peace Prize in 1989.\n\nThe Dalai Lama himself was on the CIA's payroll from the late 1950s until 1974, reportedly receiving $US180,000 a year.\n\nBut apparently the guerrilla army never did more than engage in border skirmishing. As early as 1964, in fact, its effectiveness and efficiency were called into question by the CIA, which nevertheless stuck with the plan. Funds to pay this army were funnelled through the Dalai Lama and his organization, which received US$1.7 million a year, later reduced to $1.2 million. (Of this, the Dalai Lama himself was paid $186,000 a year.\n\nOne former CIA agent named Ralph McGehee, admittedly a professional thorn in the side of his former employer, alleged that the CIA has been a prime funder of the Dalai Lama's media profile as a symbol of \"meditative peace and Buddhist mindfulness.\"\n\nHowever, the romantic notions about the \"peaceful\" and \"harmonious\" Shangri-la the Dalai Lama has all along preached and boasted of should be tested against reality.\n\nWhen suddenly the words \"democracy\" and \"human rights\" entered the vocabulary of the Dalai Lama's government-in-exile in India's Dharamsala, some Western media, so intoxicated, might have cheered for it.\n\nBut Dharamsala is by no means a Shangri-la, as where Dalai Lama's commitment to \"democracy\" seems weak.\n\nAn Office of Tibet document claims \"soon after His Holiness the Dalai Lama's arrival in India, he re-established the Tibetan Government in exile, based on modern democratic principles\". Yet it took more than 30 years for an Assembly of Tibetan People's Deputies to be directly elected from among the 130,000 exiles. Of 46 assembly members, only 30 are elected. The other 16 are appointed by religious authorities or directly by the Dalai Lama.\n\nThe Dalai Lama's proposals now amount to calling for negotiations with Beijing to allow him and his exiled government to resume administrative power in an \"autonomous\", albeit larger, Tibet.\n\nThe Dalai Lama's call for international pressure on Beijing seeks only to achieve this.\n\nThe political monk has since turned to the \"underground battle\", stealthily sowing discord between Tibetans and the Han Chinese and inciting ethnic hatred, while trotting globally and lobbying for international support.\n\nThe Tibetan people deserve due respect. But the Dalai clique and his \"government-in-exile\" can only be judged from their actions and, their willingness to tell the truth."}, {"url": "http://www.chinatoday.com.cn/english/tourism/2017-10/11/content_747947.htm", "page_content": "A Mystical Metropolis on the Snowy Plateau\n\nLHASA, the 1,400-year-old capital of Tibet Autonomous Region located in its southeast, is among the world’s highest-altitude cities. The region’s political, economic, cultural, and religious center, Lhasa, which in the Tibetan language means Sacred City, is the starting point for tours of Tibet, and has become even more popular since the modernization of its infrastructure. But these advances in no way encroach upon Lhasa’s sun-bathed, snow-capped mountains and grasslands, pristine air, ancient beliefs, and serene lifestyle. Whether in the Potala Palace, Jokhang Temple, Norbulingka or Barkhor Street, Lhasa offers ample sources of sustenance for the soul.\n\nSongtsen Gampo and Princess Wencheng\n\nClans and tribes, large and small, appeared on the Qinghai-Tibet Plateau around the first century AD. After years of war, they merged and united to form a tribal alliance. In the year 632, Songtsen Gampo built a fortress in the wilderness, cleared river routes, and constructed monasteries, so laying the foundations for Lhasa, and established the powerful Tubo Kingdom.\n\nBarkhor Street preserves the traditional features and lifestyle of the ancient city.\n\nTo consolidate his rule, Songtsen Gampo sought an alliance with Tang Dynasty Emperor Gaozu of the Central Plains area. This he achieved through his marriage to Princess Wencheng, the emperor’s daughter. Soon after he built the Potala Palace in Lhasa, on Mount Maburi. During the later decline of the Tubo Kingdom the palace was destroyed in successive years of war and natural disasters. Today’s Potala Palace was rebuilt on the original site.\n\nThe Jokhang Temple was constructed around the same time as the old Potala Palace. It is said that Sakyamuni the Buddha opposed idolatry and the building of temples and statues, but eventually assented to statues of him at three different ages, and personally painted pictures in this respect. Among the statues of Buddha, the gilded bronze one of the 12-year-old Sakyamuni created in India is considered the finest. Princess Wencheng brought it with her to Tibet from the Central Plains area of China, and placed it in Jokhang Temple. The statue is priceless, not only by virtue of its historical value and as a cultural relic, but because Buddhists believe that beholding this image is equivalent to seeing the Buddha in his original incarnation 2,500 years ago.\n\nThere exist many historical accounts and folk legends about Princess Wencheng’s journey to Tibet and what she accomplished there. They show that the princess was indeed committed to exchanges and communications between the Tubo Kingdom and the Tang Dynasty, and that she was integral to the development of the friendship between the two. This cultured and knowledgeable princess exerted tremendous influence on Tibet’s openness. This is apparent in her recommendation to Songtsen Gampo that the children of Tubo nobles be sent to the Tang capital to study and acquire the Han’s advanced knowledge and culture.\n\nStage photo of the large-scale epic drama Princess Wencheng.\n\nPrincess Wencheng not only introduced to Tibet Tang milling and pottery techniques, medicine, agriculture, and textiles, but also Buddhist scriptures, and books on medicine, history and agriculture, among others. She thus helped to advance Tibet’s economy and culture, and her memory is consequently loved and respected by the Tibetan people in the many temples dedicated to her.\n\nLhasa and Buddhism Lhasa is a city of temples.\n\nLocal residents and pilgrims walk the streets of Lhasa, spinning its many prayer wheels. Their devotions evoke a feeling of deep humility. Pilgrims from afar making their sacred journey to the holy city of Lhasa prostrate themselves every few steps of the way as the ultimate expression of their devoutness. Worshipping at Jokhang Temple is their lifelong wish.\n\nIn the 13th century, the central government of the Yuan Dynasty (1271-1368) incorporated Tibet into its unified territory, and gradually strengthened the region’s local authority. In the mid-17th century, Qing Emperor Shunzhi officially conferred on Lobsang Gyamco the title of the 5th Dalai Lama, so establishing a theocratic feudal serfdom with Lhasa as its capital, and strengthening the Dalai Lama’s Gelug Sect. Lhasa has since remained the capital of Tibet.\n\nIn 1645, the 5th Dalai Lama rebuilt the Potala’s White Palace and made it his living quarters and place of work. After completion of the pagoda containing the 13th Dalai Lama’s remains in 1936, the Potala Palace was expanded to its present scale. The 5th Dalai Lama also expanded the Jokhang Temple, an important monastery under the jurisdiction of the local government of Tibet, and site of its administrative offices. The Golden Urn, from which lots are customarily drawn to select the living Buddha, is housed in Jokhang Temple, where the ceremony to choose the current 11th Panchen Lama Gyaincain Norbu in 1995 is held.\n\nThere are now more than 200 temples in the city of Lhasa. Since 1980, the state has invested heavily in the maintenance of 97 ancient edifices in the city, including Jokhang Temple and the Potala Palace.\n\nA “Heavenly Road” on the Plateau\n\nLhasa is on the Qinghai-Tibet Plateau – the world’s highest. Owing to its remote location and consequently difficult logistics, local residents were until recent times firmly entrenched in the region’s autarkic manorial economy. In 1949 Tibet had just one one-km-long surfaced road. American travel writer Paul Theroux wrote in his book Sailing Through China: “The Kunlun Mountains preclude any railway to Lhasa.”\n\nNight scene of the Potala Palace.\n\nIn the 1950s, the central government nevertheless decided to build a railway to Lhasa. In 1956, the Ministry of Railways carried out a comprehensive survey of Tibet to work out the planning and design for this task. After decades of research and debates, in June 2001, the railway connecting Golmud in Qinghai to Lhasa started construction. Its main obstacles were permafrost, a cold and anoxic environment, and fragile ecology. Having overcome all three, in July 2006 the railway started operation.\n\nThe Qinghai-Tibet Railway, with a total length of 1,956 kilometers, is the first railway to Lhasa and the world’s highest, which is why it is known as the “Heavenly Road.” The railway goes through the Hoh Xil, Sanjiangyuan, Qiangtang and other national nature reserves. To protect the plateau’s blue skies, clear lakes, and wildlife, the State Environmental Protection Administration, Ministry of Land and Resources, and Ministry of Railways formed a joint expert group on preserving the ecological environment.\n\nAfter in-depth research, the team formulated specific environmental protection measures. To protect the living environment of wildlife such as the Tibetan antelope, the railway established 33 wildlife channels, and to preserve wetlands it constructed the first man-made wetland in the alpine region. In efforts to protect the landscape, achieve zero emissions, and improve the ecological environment along the railway, it also built a green corridor that stretches for hundreds of kilometers. These unique environmental designs, construction and operation concepts render the Qinghai-Tibet Railway China’s first “green railway.”\n\nThere are other choices of transport to Tibet in addition to the railway, notably by road. China National Geography magazine called the Sichuan-Tibet Highway one of the best sightseeing routes in China. It provides a breathtakingly beautiful, ever-changing landscape from the Chengdu Plain to the Qinghai-Tibet Plateau, and the chance to experience four seasons in one day. People walk, ride and drive along this road.\n\nLhasa Today\n\nConvenient transportation has provided the conditions necessary for Lhasa’s development.\n\nHistorical records show that Lhasa’s urban area in 1950 covered less than three square kilometers, and had only 30,000 residents. The city had neither water-supply lines nor sewers, and none of the roads was surfaced. Groups of girls fetched water in wooden pails from the foot of Chakpori Mountain and the Lhasa River every morning.\n\nVisitors watch a ceremony at Drepung Monastery in Lhasa.\n\nAt the end of 2012, Lhasa invested about RMB 1.5 billion in preserving the old city. After six months of construction, the circumambulation paths around the Jokhang Temple had been widened, and vendors on Barkou Street no longer traded outdoors. The backward municipal infrastructure was modified, and streets and lanes in the old city were made neat and orderly.\n\nUrban planning continues to enlarge the city of Lhasa. Its 60-sq-km area is 20 times larger than it was decades ago. The city region straddles the Lhasa River, making it Lhasa’s second administrative district. There are 100 or so inns and restaurants along the riverside, whose banks are also venues for drama performances such as that paying tribute to Princess Wencheng. Having debuted in August 2013, the play is now synonymous with the city.\n\nToday, with the Potala Palace at its core, row upon row of high-rise buildings dotted with gardens have formed a modern city. Its flourishing hotels, banks, shopping malls, and designer shops make one forget Lhasa’s remote location on a snow plateau. The popularity of mobile phones and Internet also connects the city with the world outside.\n\nWalking along the bustling Barkhor Street, and seeing devout believers in the Potala Palace square, one will be touched by the sincerity of the people’s faith. Spinning prayer wheels, listening to the sounds of the city from a teahouse on a sunny afternoon, or strolling along the Lhasa River make it impossible not to fall in love with Lhasa."}, {"url": "https://en.tibet3.com/culture/2016-10-27/1553.html", "page_content": "A citizen walks past the square of the Potala Palace in Lasha, capital of southwest China's Tibet Autonomous Region, March 10, 2016. Spring is coming in Lasha. (Xinhua/Zhang Rufeng)\n\nTibet, a remote land in the midst of the Himalayan Mountains, has long been shrouded in mystery and myth.\n\nThe myth brew illusions that have been skillfully peddled for political purposes around the world by the Dalai Lama, the biggest serf owner in old Tibet, who has thus instilled lies into people's concepts, especially Westerners' concepts about Tibet.\n\nNow let's have a look at what a true Tibet is really like in the eyes of foreign scholars and experts who have conducted in-depth studies and extensive field researches about this mysterious land.\n\nLuxembourg scholar Albert Ettinger said that the picture painted by the Dalai Lama about Tibet for the rest of the world is twisted by lies.\n\n\"People in Western countries learn about Tibet dominantly from the media. However, large amounts of fiction about Tibet published in those countries have nothing to do with the reality of Tibet...They haven't made any factual research at all,\" said Ettinger, who had two books published in German -- \"Free Tibet? \" and \"Fight for Tibet\" -- in 2014 and 2015 respectively after six years of intensive study.\n\n\"For instance, the Dalai Lama said old Tibet was not perfect, it had problems but generally it was a good society,\" Ettinger said. \"I always laugh at that.\"\n\nMany facts mirror and confirm that old Tibet, a society of serfdom, was a poor ignorant feudal society ridden with problems such as violence, insults, sexual discrimination, he said.\n\nIn addition, \"the repression of Tibet's language and culture\" claimed by Dalai Lama is also a lie, Ettinger said. \"It can be seen nowadays that though pupils in Tibet's schools learn Chinese characters, Tibetan is still widely used among them as well.\"\n\nEchoing Ettinger's opinions, German sinologist and ethnologist Ingo Nentwig said that, when it comes to Tibet, \"what you hear about may be false, what you see is true.\"\n\nThe image of the traditional Tibetan society, which is far from reality, is widespread \"mainly due to the propaganda of Tibet separatists and gullible, ignorant journalists who are willing to redistribute this nonsense,\" Nentwig said.\n\nThe expert said the truth is the old Tibet was \"a society dominated by poverty, misery and violence, ruled by a degenerated system of political tyranny, an institutionalized embodiment of systematic injustice and inequality, in other words, a 'hell on Earth.'\"\n\nAnd for the German scholar, the so-called \"cultural genocide\" in Tibet is just nonsense.\n\n\"It is a fact that the Han ethnic group is the largest among the 56 ethnic groups in China. It's normal for China's modernization to have more or less some Han cultural elements. But the encounter of a variety of cultures actually benefits and inspires cultures of ethnic minorities,\" Nentwig said.\n\nA file photo shows Nyima Tsering reading books in his room at Jokhang Temple in Lhasa, capital of southwest China's Tibet Autonomous Region, Aug. 16, 2015. The 48-year-old monk Nyima Tsering is proficient in Chinese and English. After graduating from the High-level Tibetan Buddhism College in Beijing, Nyima Tsering did the reception work at Jokhang Temple administration committee and introduced temple information to tourists from home and abroad as a tour guide. (Xinhua/Chogo)\n\nIn 2008, Tibetan Tripitaka, a massive collection of 232 volumes of classic Buddhist scriptures, was published in Tibetan characters by the China Tibetology Press after more than 20 years of collation by experts.\n\nNentwig cited it as a good example of China's efforts to protect and promote the ancient Tibetan culture.\n\nHe noted that prior to the 1950s, Tibet had few books except religious classics, but now there are a variety of Tibetan publications of philosophical classics, Western literature and modern scientific literature.\n\n\"Culture is not only religion. Tibetans now have perfect conditions to enjoy a full-blown spiritual life with their own language. This is indeed a great development,\" Nentwig said.\n\n\"For any culture, preservation for its own sake without renewal could only lead to its decay. For Tibetan culture, the encounter and exchange with cultures of all Chinese ethnic groups, including that of Han Chinese, just enables it to survive and prosper in the long term,\" Nentwig said.\n\nBelgian Tibetologist Andre Lacroix praised Tibet's development over the past decades, saying the region's living standards have improved a lot with \"indisputably huge\" progress being made.\n\n\"It (the Qinghai-Tibet railway launched in 2006) is an extraordinary project and it's really impressive. I think it's a win-win project, with which Tibet further develops and improves its economy, strengthens external exchanges and elevates living standards. The railway line has opened up areas isolated for centuries and helped promote responsible tourism as well.\"\n\n\"I think Tibetan culture is much less threatened than many other minority cultures in the world, because there are still some research institutes working on it,\" Lacroix said, refuting claims that the government was damaging Tibet's indigenous cultures.\n\n\"The Tibetan language is mandatory in primary schools. I believe there is a real willingness by the Chinese government to protect Tibetan culture,\" said the expert."}, {"url": "http://www.chinatoday.com.cn/english/report/2015-11/10/content_707997.htm", "page_content": "The First Chinese to Present Tibet to the West\n\nBy QUAN YI\n\nI still have the October 1912 issue of National Geographic. The cover is worn and torn, but my whole family nevertheless treasures this faded magazine, because it contains the travelogue Lhasa of Tibet that my grandfather wrote, and the 60 photos he took there.\n\nTibetan soldiers armed with harquebus, bows and arrows – their main weapons.\n\nTibet Photography\n\nOur family is descended from the imperial lineage of the Qing Dynasty. My grandfather, Quan Shaoqing, whose family name was Aisin Gioro, was born in Wanping (southwest of present-day downtown Beijing) in 1884. In 1904 he graduated from the Beiyang Medical College in Tianjin, China’s first institution of Western medicine. Taught in English, courses were modeled on those at Western medical schools, and student selection was strict. Graduates mostly became army or navy surgeons. According to my father, as a student my grandfather was passionate about photography, but if he ever took any shots while at university, none has been found.\n\nIn 1906, the Qing government appointed Zhang Yintang Resident Minister in Tibet. Among the official convoy that traveled west was my grandfather, who served as a military doctor. During his two years in Tibet, he had time to travel throughout the region, interact with Tibetans from all walks of life, and experience local customs. Armed with his camera, he recorded his experiences there.\n\nThe Qing Dynasty was overthrown in 1911. The following year, my grandfather went to the U.S. to study at Johns Hopkins University. The same year the National Geographic published its October issue about China, in which appeared my grandfather’s photos and travelogue. He was the first Chinese to present Tibet to the West through a photo essay.\n\nDuring the next 20 years, my grandfather was regularly invited to share his knowledge about Tibet in the United States, France and China. His vivid talks were well received, according to reports. “He presented several hundred color slides that enabled the audience to admire palaces in the region and discover local customs, making them feel as if they were actually present at these scenes.”\n\nYak skin coracles loaded with wool.\n\nPhotolog\n\nMy grandfather wrote of his tour of Tibet: “I am glad about the advantageous conditions that allow me to understand Lhasa, as most of my ancestors were not so lucky. First, the indigenous inhabitants are unwary of or hostile towards me. I am also equipped with all the advanced equipment I need to record my journey, and my position gives me the chance to obtain permission to see and shoot scenes that previous explorers could not even dream of. Finally, my tenure was long enough to give me adequate time to thoroughly undertake this creative work.”\n\nBefore him, very few Chinese from other parts of the country, let alone foreigners, had been to Tibet. My grandfather wrote in his notes: “In 1904, British troops sent an expedition to Tibet that was eager to unravel the mysteries of this enigmatic city, and which forced opened the gates of Lhasa. However, their curiosity was not rewarded, because they received only hatred and rejection from the local people.” During the 19th century, no more than 10 foreign travelers entered Tibet as scientific explorers or political representatives. But they seldom stayed long due to harsh natural conditions, lack of materials and facilities, and animosity from the local population. Very few managed to reach the holy city – Lhasa.\n\nMore than a century ago, Tibetans refused to be photographed. They did not trust photographic equipment, believing that photographing their image would sully their souls. This is why the shots my grandfather took which are of the greatest historical value are the portraits of Tibetan aristocrats, because his position gave him the chance to photolog.\n\nMy grandfather said that one day, the abbot of the Sera Monastery came at sunset to pay his respects to Zhang Yintang. My grandfather decided to photograph this lama. Under the pretext of admiring the setting sun he discreetly set his flash, pressed the shutter and snapped the lama. The next day, he offered the shot to him, explaining the principles of photography. The lama was very happy and invited my grandfather to dinner, and asked him to take a family photo. Later, he introduced my grandfather to several high-ranking influential people in Lhasa, including the younger brother of the 13th Dalai Lama, then chief of police and governor of the city.\n\nMy grandfather’s pictures cover a variety of topics: politics, religion, traditions, architecture, geography, local people, and wildlife. Among those published in the National Geographic are shots of the Potala, Jokhang and Sera monasteries and the treasures they housed. Other pictures are of unique local vessels – coracles made from yak skin, typical houses with flat roofs and white walls, Tibetan mastiffs, bowls made from human skulls, drums made from human skin, and celestial burial rites.\n\nQuan Shaoqing (second left) and his family.\n\nA Century of Vicissitudes\n\nAlthough taken more than 100 years ago, these photos are still clear. They reflect the Lhasa of that time: poor sanitation, houses that were light in color on the outside, but whose inner walls were blackened by cooking smoke due to having no windows or chimneys, and people and yaks sleeping alongside one another. Rats proliferated in monasteries and infectious diseases were rampant. Many people bore facial scars from smallpox.\n\nMy grandfather used to say, “Here, means of transport remain primitive. People do not yet know about coaches. Walking is the most common way of traveling. The local population use yaks and horses when they need to move heavy loads. Only the Dalai Lama and two resident ministers from the central government have the privilege of a palanquin.”\n\nMoreover, he was struck by the contrast between high-born women, who wore precious jewels, silk clothes and furred robes, girls from ordinary families dressed in simple clothes, and poverty-stricken girls in rags. His observations of ethnic clothing styles in the region made my grandfather aware of the strict social hierarchy in Tibet. “Every day, from morning to night, uneducated pilgrims flock to the doors of monasteries which are already crammed with beggars. These poor and ignorant people are in sharp contrast to the lamas who meditate calmly in monasteries loaded with wealth.”\n\nHowever, the first Westerners to adventure in Tibet described it as a paradise because they acquired only superficial knowledge based on limited impressions, something like the buildings my grandfather photographed in Lhasa: an ostensibly clear and beautiful exterior with a dark, dirty interior.\n\nMore than a century has since passed. Tibet has undergone tremendous changes. At the time my grandfather stayed there, it was accessible by only three roads. One was from Qinghai: a relatively flat road, but the trip along it took 18 months. Another was from Sichuan, a faster but more perilous track. The third was from India to the Himalayas and then to Lhasa, which was the route my grandfather took. It took him 103 days to reach Lhasa, and he spent 55 day traversing high mountains in extreme conditions. Today, Lhasa is no longer out of reach. Beijing offers travelers several options: by air in a few hours, by train in two days, or by car in two weeks.\n\nThe religion, language and folklore of Tibet are as alive today as they ever were, and most historical monuments and cultural treasures have been well preserved. Visitors to Lhasa can still see worshipers spinning prayer wheels, as in the pictures my grandfather took. They can also still savor Tibetan tea prepared with respect for tradition, and admire Thangka and performances of Tibetan Opera. They can marvel at the Potala Palace, at the Shakyamuni Buddha statue inside the Jokhang Monastery, cliff inscriptions, and the 10,000-Buddha Wall at Mount Yaowang. It is thus possible to take pictures similar to those of my grandfather all those years ago. However, Norbulingka is no longer the attractive but exclusive garden it used to be, but a place of relaxation open to the public. Lamas are not the only group to have mastered writing and medicine. They are still highly revered by the faithful, but more respect is now inspired by religious faith for its own sake rather than as submission to those in power. In addition, the development of the Internet has enabled Lhasa to link up with other Chinese places – even to the world. One can now simply reserve a hotel room or a ticket online to a tourist site in Lhasa, Beijing or the United States."}, {"url": "http://zqb.cyol.com/content/2009-03/25/content_2595636.htm", "page_content": "益多\n\n1959年3月28日，周恩来总理签署国务院令，宣布解散原西藏地方政府，由西藏自治区筹备委员会行使西藏地方政府职权，由此拉开了西藏民主改革序幕，由此百万农奴站了起来。这不仅从根本上扫除了西藏社会发展进步的社会制度障碍，而且标志着世界上最后一个主要的农奴制堡垒被扫进了历史的垃圾堆，在人类废奴史和人权史上写下了浓墨重彩的一笔。在西藏民主改革50周年之际，2009年1月19日，西藏自治区人民代表大会九届二次会议庄严决定，每年3月28日为“西藏百万农奴解放纪念日”。此时，口口声声代表“全体藏人利益”、以“民主”、“自由”自我标榜的十四世达赖喇嘛一伙不仅没有任何反思、悔恨的表示，反而攻击中国此举“无任何实质意义”，“是对藏人的侮辱”，将“制造新的不稳定因素”。达赖喇嘛一伙这种蛮横和情绪化的反应并不奇怪，因为他们本来就与旧西藏政教合一的封建农奴制度有着无法割舍的情缘。\n\n当年妄图“永远不改”\n\n1959年以前，西藏实行的是延续了千百年的政教合一的封建农奴制度。除了一些别有用心或者对旧西藏一无所知的人把这个“喇嘛王国”描绘、想象成“人间天堂”，所有历史事实和档案文物，所有古今中外学者负责任的论述，都揭示出旧西藏的落后、黑暗、野蛮。比如英国记者埃德蒙・坎德勒（Edwudn Candler）在《拉萨真面目》（The Unveiling of Lhasa）一书中说：“这个地方实行的是封建制度。喇嘛是太上皇，农民是他们的奴隶”。美国藏学家梅・戈尔斯坦（M・Goldstein）指出，宗教和寺院集团是“西藏社会进步的沉重桎梏”和“极端保守的势力”。旧西藏社会政治制度的一个主要特点，就是达赖喇嘛作为藏传佛教格鲁派的主要首领，同时兼任西藏地方政府的首脑，集政教大权于一身。达赖喇嘛本人既是这个政教合一制度的总代表，也是最大的农奴主。在民主改革前，十四世达赖喇嘛一家在西藏占有27座庄园、30个牧场、6000多名农牧奴，每年在农奴身上榨取的青稞33000多“克”（1“克”相当于14公斤），酥油2500多“克”，藏银200多万两，牛羊300头，氆氇175卷。1959年,十四世达赖喇嘛本人手上有黄金16万两，白银9500万两，珠宝玉器2万多件，有各种绸缎、珍贵裘皮衣服1万多件，其中镶有珍珠宝石的斗篷100多件。无怪乎西班牙记者安德烈斯・桑切斯・迪亚斯不无揶揄地说“达赖喇嘛所拥有的奴隶多于他的智慧”。\n\n这样一套制度，在当时世界上绝大多数国家和地区已经成为历史，西藏当然不能自外于人类文明进步潮流。但是考虑到当时西藏社会的特殊情况，中央政府对西藏社会改革问题采取了非常稳慎的方针。1951年，中央政府和原西藏地方政府签署“十七条协议”，规定“有关西藏改革的各项事宜，中央不加强迫，西藏地方政府应自动进行改革，人民提出改革要求时，得采取与西藏领导人员协商的方法解决之”。也就是说：西藏社会制度必须进行改革；改革的办法采取上层统治阶级和广大群众协商，中央不包办；什么时候改革，中央不强迫。\n\n中央有关改革问题的方针，已经最大限度地照顾了西藏上层的利益。但是达赖喇嘛一伙人要求的是他们的既得利益永远不受任何触动。签订“十七条协议”的原西藏地方政府首席全权代表阿沛・阿旺晋美后来在回忆录中写道：“据我所知，在西藏和平解放以后，上层统治者中确有一部分人死心塌地维护封建农奴制度，害怕民主改革，反对民主改革”，进而“把维护封建农奴制、反对民主改革同西藏独立融为一体”。事实确实如此，从西藏和平解放以来，在改与不改问题上，西藏封建农奴主上层反复与中央讨价还价，竭力维护封建农奴制度和自身特权地位。考虑到他们思想认识转变需要时间，中央采取了耐心等待、教育的办法。1956年8月毛主席给达赖喇嘛写信，告诉他“现在不是实行改革的时候”。达赖喇嘛当年底到印度参加释迦牟尼涅��2500周年活动，一度想滞留不归，正在印度访问的周总理三次找他谈话，转达毛主席的意见，西藏未来6年不改革，6年以后改不改，还是由达赖喇嘛决定。\n\n以达赖喇嘛为首的西藏封建农奴主上层为了“永远不改”，最终不惜发动武装叛乱，图谋从中国分裂出去。1957年7月，身为全国人大常委会副委员长的达赖喇嘛接受叛乱组织“四水六岗”敬献的“金宝座”，并向在场的500名代表回赠礼品、挂哈达，极大鼓舞了叛乱活动。达赖喇嘛身边的人积极参与各种阴谋活动，他的三哥洛桑三旦明确要求江达地区头人齐美贡布发动叛乱，说“这是达赖喇嘛的指令”。正是在达赖喇嘛的支持、庇护下，1959年3月10日，西藏封建农奴主上层顽固势力发动了全面武装叛乱。\n\n顺便说一句，这场叛乱并不是达赖喇嘛宣扬的所谓“和平起义”。3月10日当天叛乱分子就打死爱国藏族人士索朗降措，随后向驻藏部队、机关发起武装进攻。达赖喇嘛在他的“自传”中交待，“甚至我的私人厨子也扛着一具火箭炮”。\n\n至今仍然美化旧西藏社会政治制度\n\n达赖喇嘛出逃后，生存成了第一位的问题。要让被裹胁出去的藏民继续拥护他的封建农奴制度，服服帖帖跟他走；又要让西方人觉得他领导下的旧西藏是人类社会最后的“香格里拉”，痛痛快快地给钱，方法只能是说谎了。早在1964年3月10日，达赖喇嘛就在达兰萨拉向境外藏胞“描绘”说，“实现西藏独立的原则，是政教合一的自由独立，这样今生和来世都有了寄托。我们大家共同享用政教合一的生活，很有必要”。针对有些人对“政教合一”的前景产生怀疑，1965年3月10日他又说，“有些人以为法和世道不能同时并进，这种认识是错误的，政教合一是可以办得到的”。1993年，达赖集团炮制出所谓《以事实证明西藏的真相》的文件，称“过去的西藏社会绝不是中国所说的那样极端残酷与黑暗”，“社会制度的宽松可以与当时亚洲大部分地区相媲美”。到1998年3月10日，达赖喇嘛对一个名为“茉莉”的人谈话时，对旧西藏的美化又上到一个新台阶，“虽然旧西藏社会是落后的，但是绝不像中国共产党所说的最黑暗、最残酷、最野蛮，绝对不是这样。在旧西藏社会中生长的人，绝对是充满快乐的、笑眯眯的。从总的来说，旧西藏的制度是比较好的，其中有一些仁慈、以善待人的观念，与中国和印度其他国家，特别是与欧洲中世纪的农奴制相比好多了。”到了今年，达赖喇嘛在3月10日声明中，干脆直接把1959年前他领导的西藏说成是“自由的西藏”，好像就根本没有过什么政教合一的封建农奴制度这回事。\n\n达赖喇嘛这种态度并不会令人感到奇怪，因为他的地位、权力和利益就是建立在这一制度上的。在达赖喇嘛看来，一直沿用至上世纪五十年代末的《十三法典》和《十六法典》中对农奴剜目、残肢、抽筋、投崖、溺水等酷刑，“为了给达赖喇嘛念经祝寿，急需湿肠一副，头颅两个，多种血，人皮一张”等血淋淋的命令，只要编织在宗教特权的神圣色彩之中，就都是“仁慈、以善待人”的。换句话说，如果有朝一日达赖喇嘛在西藏重执政教大权，他将理所当然地“充满快乐的、笑眯眯的”把这一套重加到西藏人民头上！\n\n还在做着复辟政教合一的迷梦\n\n从出逃至今，达赖喇嘛一直苦心经营着他领导的流亡“小朝廷”，当然也需要“化妆”一下，化妆品就是“民主”。而由一个代表封建农奴制的政教合一的流亡团体搞出来的“民主”，不能不在世人面前显得十分古怪。\n\n民主是属于达赖喇嘛一个人的。1963年,达赖喇嘛领导制定了所谓《西藏未来政体及宪法要旨》，其中规定“西藏政府的主要职权由达赖喇嘛负责”。1991年又制定《流亡藏人宪章》，再次重申“政府的一切权力都属于至尊的达赖喇嘛”，“政府的一切只能以达赖喇嘛的名义进行”。1992年达赖喇嘛又亲自撰文说：未来“西藏恢复自由后”他要交出权力，这样就有一个过渡期，“过渡总统”的产生有两个办法：其一由藏人代表选出不超过7个候选人，“由我指定一人为临时政府总统”；其二“如这样的选举方式出现不妥，则直接由我指定一人为临时总统”。总而言之，选不选举、过不过渡、交不交权，一切终归听达赖喇嘛的，这不能不算作达赖喇嘛对人类民主事业的一大“贡献”。\n\n政教合一是不能放弃的。《流亡藏人宪章》明确规定未来西藏实行“政教结合”制度。去年达赖集团专门开了一个讨论未来前途的“特别大会”，“一致认为达赖喇嘛是境内外西藏人民的最高政教领袖”，“全体藏人一致尊重和支持达赖喇嘛在任何时候做出的任何决定”。此外，在这个“流亡政府”中，作为行政领导人的桑东是活佛，“议会”中设有10个固定的各宗教教派代表席位。更有意思的是这个“政府”动不动就要操办各种名目的法会，特别是给达赖喇嘛祈福的法会屡办不烦，今年3月7日开始又大办了5天。桑东早在1996年《西藏未来蓝图》中对这个“政府”的职能作过一番勾画：“将成立一个享有宪法权力的‘宗教事务委员会’，达赖喇嘛将是这个委员会的最高领导人。每位年满18岁的信教者将依法不定期交付‘宗教税’。政府根据信教的基本人数给予财政支持”。今年3月桑东又在“宗教领袖会议”上说：“历数过去50年西藏流亡社会的成就，最重要一点就是为藏传佛教和苯教的发展壮大作出了突出贡献。藏民族的政治离不开宗教的支持，政治自治只是我们发扬藏传佛教的一个条件”。笔者提醒读者注意一个细节：所谓“西藏流亡政府”的英文全称是“Central Tibetan Administration of His Holiness the DalalLama”，即“神圣的达赖喇嘛的西藏中央政府”。达赖喇嘛的民主是什么货色，难道还不清楚吗？\n\n写到这里，笔者想起为废除美国奴隶制度、维护国家统一不惜一战的林肯总统说的一句话，你可以在某些时候欺骗某些人，但你绝不能在所有的时候欺骗所有人。达赖喇嘛那一伙人的把戏一点就透，还指望“在所有时候欺骗所有人”，可谓期望值过高。\n\n新华社北京3月24日电"}, {"url": "https://mil.huanqiu.com/article/9CaKrnJqzJz", "page_content": "[西藏人大主任：达赖去世对藏大局没任何影响]\n\n达赖赴美（资料图）\n\n据3月17日出版的《环球时报》报道 达赖喇嘛“退休”之说生出新的变数。设在印度达兰萨拉的“西藏流亡政府”16日传出消息，“流亡政府内阁”和“议会”在是否批准达赖喇嘛的“退休”申请上产生严重分歧。“流亡政府内阁”同意接受达赖“退休”，而“议会”的大多数“议员”则拒绝接受达赖的申请。同日，泰国《民族报》称，达赖在接受该报的专访时说，他自信能活到113岁，“亲手挑选下一代达赖喇嘛”，“回到北京，看到自由的西藏”。\n\n《印度快报》16日以“流亡政府内阁接受达赖退休”为题报道称，“西藏流亡政府”15日举行讨论会，“内阁”成员一致同意达赖辞去政治领袖的申请，“情绪激昂”的“议员”们则“强烈呼吁”达赖“重新考虑退休的决定”。\n\n印度《德干先驱报》16日称，达赖喇嘛的“政治退休”举动现在遇到了障碍，因为他的“退休”需要“流亡政府议会”修改章程，而修改章程需要得到多数“议员”的支持。报道引述“西藏流亡政府”一名“议员”的话称，如果接受达赖“退休”，流亡藏人运动就会颜面尽失，“西藏在国际社会的地位是跟达赖紧密相关的。没有他，就没有方向”。\n\n路透社16日称，20日，8.3万名流亡藏人“选民”将选择“西藏流亡政府”的下一任领导者，对北京进行新一轮施压。同时，这也可能加剧流亡藏人群体的分裂，已经有人对长期依赖达赖喇嘛的流亡藏人运动有诸多不满。\n\n达赖本月10日发表“退休”声明后，也引发外界对他身体状况的猜测。泰国《民族报》16日以“达赖自信能活到113岁”为题报道称，达赖在接受该报采访时说：“40年前我算过命说可以活到113岁。100年前的一本藏文书里写道，当今世界上有一个人能活到113岁。这个人应该就是我，因为我具备这个人的品质。我对自己的年龄有信心。”达赖还称，他将“回到北京”，看到“自由的西藏”，并“亲手挑选下一个达赖喇嘛”。 (本报驻印度特约记者 郭西山)\n\n责任编辑：杨琪"}, {"url": "http://chinaplus.cri.cn/news/politics/11/20171021/42346.html", "page_content": "A senior Communist Party of China (CPC) official reaffirmed Saturday China's opposition to Dalai Lama's visits to foreign countries.\n\nZhang Yijiong, executive vice minister of the United Front Work Department of the Central Committee of the Communist Party of China (CPC), speaks at a press conference held by the press center of the 19th CPC National Congress in Beijing, capital of China, Oct. 21, 2017. The press conference was themed on the united front work and the external work of the CPC. [Photo: Xinhua]\n\nSpeaking at a press conference on the sidelines of the 19th CPC National Congress, executive deputy head of the United Front Work Department of the CPC Central Committee Zhang Yijiong urged foreign governments to exercise \"caution in both words and deeds.\"\n\n\"The 14th Dalai Lama is not only a religious figure, but also a political one,\" Zhang said.\n\nThe aim of the so-called \"Tibetan government-in-exile\" organized by him in a foreign country in 1959 is, in essence, seeking \"Tibet independence\" and splitting the motherland, according to the official.\n\n\"As head of the group, the 14th Dalai Lama has never stopped his activities in this regard over the past decades,\" Zhang said.\n\n\"No country in the world recognizes the so-called 'Tibetan government-in-exile,'\" he said, noting that although individual officials in some countries had received the Dalai Lama, their countries do not recognize the group.\n\n\"The Chinese government opposes governments and organizations in any country in the world to receive the Dalai Lama in any name,\" said the official.\n\n\"We consider such visit as a severe insult to the feelings of the Chinese people and a deviation from their commitment to recognizing the Government of the People's Republic of China as the sole legal government representing the whole of China,\" he warned.\n\n\"So we hope governments around the world exercise caution in both words and deeds and give full consideration to their friendship with China and their respect for China's sovereignty,\" he added.\n\nZhang said there has been a decreasing number of countries receiving the Dalai Lama in their official capacity in recent years and the Dalai Lama could only manage to give lectures in universities or hold religious activities instead."}, {"url": "https://www.bbrtv.com/2021/0730/663408.html", "page_content": "New Tibet, the rising 'Roof of the World'\n\nupdatetime:2021-07-30 12:19:15 Views： 0 Source：Xinhua\n\nThere are very few places on this earth where humanity can transcend the boundaries of race and nationality, where one can go beyond the human perspective and understand that we are one with the universe.\n\nTibet is one such destination.\n\n\"There's natural beauty around the world, but Tibet is an example of real natural beauty,\" said American economist David Blair. \"It's great to have an opportunity to see.\"\n\n\"It's very spiritual,\" said Shaun Rein, another American expat living in China and founder of a Shanghai-based market research firm.\n\nInvited by Xinhua's China Chat show, Blair and Rein spent a week in southwest China's Tibet Autonomous Region on a fact-finding mission to acquire firsthand experience of the lives of everyday Tibetans, local socioeconomic development, and the real face of new Tibet, possibly one of the most misunderstood places in the world.\n\nThis year marks the 70th anniversary of the peaceful liberation of Tibet. On May 23, 1951, the central government of the People's Republic of China, then still in its infancy, signed an agreement with the local government of Tibet on the peaceful liberation of the region, helping the people of Tibet break free from the fetters of imperialist invaders for good.\n\nA subsequent democratic reform in the late 1950s abolished theocracy and feudal serfdom in Tibet. The 14th Dalai Lama, clinging jealously to the system of serfdom and slavery that dominated old Tibet, fled China in the wake of a failed coup to resist the reform.\n\nThese great changes, as noted in the late American journalist Israel Epstein's 1983 book Tibet Transformed, \"were profoundly emancipatory, physically and mentally, for the overwhelming majority of Tibetans.\"\n\nWith strong support from the central government and the rest of China, and boosted by the great endeavors of people of all ethnic groups in the region, Tibet is catching up with other parts of the country in terms of socioeconomic development.\n\nA new modern socialist Tibet that is united, prosperous, culturally advanced, harmonious and beautiful is taking shape, underpinned by sustained stability and rapid development.\n\nCONNECTIVITY: ROADS, INTERNET AND INFRASTRUCTURE\n\nHaving lived in China for most of the past 24 years and having first traveled to Tibet in 2001, Shaun Rein, founder and managing director of China Market Research Group, had feared his return to the region would be a journey back in time to the Tibet of old, to a region left behind by the rest of the country.\n\n\"Tibet was so poor when I came here the first time,\" Rein said, recalling long bumpy journeys along winding dirt roads that left him clutching for a barf bag.\n\nBefore his return to Tibet, Rein planned for the worst and told his team they would probably not be able to reach him due to a lack of access to phone or Internet.\n\nYet Rein was in for a pleasant surprise. Today, fast highways connect the capital city of Lhasa to other smaller cities throughout the region, while cell phone towers dot the landscape providing incredible Internet speeds.\n\nRein was shocked by the changes in Tibet's transport sector over the last 20 years, even if they paled in comparison to those witnessed by Epstein as he took a grinding 12-day trip by jeep and truck convoy from Chengdu in Sichuan Province to Lhasa in 1955.\n\n\"Even that seemed wonderfully speedy then,\" Epstein wrote, recalling his first visit to Tibet in his book. \"For thousands of years in the past, the only transport had been by yak or mule caravan -- six months being considered good time for the trip.\"\n\nSince 1951, Tibet has gradually built a comprehensive transport network composed of highways, railways and air routes.\n\nAccording to a white paper issued by China's State Council Information Office in May, 118,800 km of highways have been built, providing access to all administrative villages in the region. Ninety-four percent of towns and 76 percent of administrative villages now have direct access to asphalt and concrete roads.\n\nBuilding and fixing roads in Tibet can be very costly, and many of the roads are underused due to the low population density in more remote parts of the region, according to Dong Gengyun, a Beijing official who has been sent to Lhasa on a three-year assignment to support Tibet's development.\n\n\"But we have to do it, because we're not here for sightseeing, but to help develop the local economy and improve people's livelihoods,\" Dong said.\n\nDavid Blair, vice president and senior economist at the Beijing-based Center for China and Globalization, regards infrastructure spending as critical because it allows people to run businesses. In Tibet, he saw people setting up B&Bs and even innovation centers.\n\n\"In many remote areas of the United States, you cannot get high-speed Internet either by wireless or wired network, and there's no incentive to provide it,\" Blair said, amazed by the \"great 4G connectivity in a little village in the middle of Tibet.\"\n\nOPPORTUNITY: TEENS, PILGRIMS AND ENTREPRENEURS\n\nThere was not a single school in the modern sense of the word in old Tibet. The illiteracy rate exceeded 95 percent, to say nothing of the complete lack of understanding of modern science and technology.\n\nFounded in 1956 with only 20 to 30 students, Lhasa Middle School in the downtown area of the city is the first modern and standard middle school in the history of Tibet.\n\nAt present, the school has some 3,000 students, with Tibetan students accounting for about 62 percent, said Tang Yong, the school's principal, adding that most of the students aspire to one day attend college.\n\nFrom 1951 to 2020, the central government invested 224 billion yuan (about 35 billion U.S. dollars) in Tibet's education. Now, the region has established a modern educational system which includes preschool, primary and middle schools, vocational and technical schools, institutions of higher learning, and special education institutions.\n\nAccording to Gong Xiaotang, Party secretary of the Lhasa No. 2 Secondary Vocational School, Tibet has taken the lead in China in providing students with 15 years of publicly funded compulsory education.\n\nStudents at the vocational school have a wide variety of courses to choose from, including cooking, traditional Tibetan clothing and medicine production, thangka painting, and other disciplines. The school is also teaching hotel management, accounting, advertisement design and drone operation.\n\n\"I was impressed by the kids. They were learning a skill that was going to make them money, and they seem to understand that at a very young age,\" Blair said. \"And I was amazingly impressed by how much these kids knew, how hardworking they were, and how dedicated they are to building their own futures.\"\n\nThe American economist was also struck by a maker's center in Lunang, Nyingchi City, where primary students are taught to use computers and 3D printers.\n\n\"They're creating a spirit of dynamism in the young kids, and that's going to pay off,\" Blair said, noting that the youngsters will grow up dreaming of being innovators, building businesses and taking advantage of economic opportunities.\n\nBarkhor Street, which circles the Jokhang Temple, a UNESCO World Heritage site and part of the historic ensemble of the Potala Palace, is the most famous pilgrim circuit in Lhasa and is always packed with pilgrims from across the region. The faithful complete the circuit clockwise, spinning their prayer wheels in the same direction.\n\nThere are more than 1,700 sites for Tibetan Buddhist activities with 46,000 monks and nuns in Tibet, while traditional religious activities are carried out regularly in accordance with the law.\n\nEvery year, large sums of money are spent by the government on the renovation and maintenance of the Potala Palace to ensure that the pilgrims have a safe environment where they can practice their religion, according to Jorden, director of the administrative office of the Potala Palace.\n\n\"We saw many people still retain their religious ideals, while at the same time, they don't want to be poor because of that,\" Blair said.\n\nThis sentiment was echoed by Rein, who found that the religious beliefs of Tibetan locals have proven no obstacle to bringing about economic prosperity. \"I don't think there's a disconnection or conflict between the two.\"\n\nIn 2020, the per capita disposable income of people in Tibet was double the figure from 2010. The average per capita disposable income of rural residents enjoyed double-digit growth over the past 18 years, while that of urban residents in 2020 reached 41,156 yuan, a year-on-year increase of 10 percent.\n\nRein believed the most impressive part of the trip was seeing the rise of the middle class in Tibet, as a growing number of locals bid farewell to poverty. \"When you have a vibrant middle class, you have a vibrant, sustainable and successful society,\" he said.\n\nThe Tibet Yougecang Enterprise, a Tibetan incense producer with fewer than 60 employees, has received a 50-million-yuan line of credit from the Agricultural Bank of China, according to Dawa, the enterprise's deputy general manager.\n\nHaving seen the implementation of Beijing's policy supporting small businesses and encouraging mass entrepreneurship in Tibet, Rein and Blair were optimistic about the future development of the region as well as the Chinese economy.\n\nHowever, finding a viable business model remains the greatest challenge for Tibet, so that the region can ultimately wean itself off support from the rest of the country, Blair noted.\n\nREALITY: A FAREWELL TO LIES AND SLANDER\n\nWhile Epstein wrote of a rekindled enthusiasm and passion for life among ordinary Tibetans since the democratic reform, Rein and Blair observed a Tibet far removed from its portrayal in Western media.\n\nRein and Blair saw for themselves the bilingual signs and software used by doctors to write out diagnoses for patients at the Tibetan Medicine Hospital of Tibet Autonomous Region, as well as students learning Tibetan language in a classroom in Lhasa Middle School.\n\n\"It was very clear that the government is doing a pretty good job at protecting Tibetan culture and Tibetan language,\" Rein said, adding that he was upset with the baseless accusations made by former U.S. Secretary of State Mike Pompeo and his successor Antony Blinken.\n\n\"I don't like the false narrative that Blinken is perpetuating after Pompeo, which a lot of U.S. media are talking about simply because China wants to create a unified, patriotic country,\" Rein said.\n\nThe term also bothered Blair, who mentioned that such grave accusations should not be made so lightly. \"I don't think there's anything like that going on, so we should take that term off the table,\" he said.\n\nThe population of Tibet has increased from 1.23 million in 1959 to 3.5 million in 2019, with ethnic Tibetan people accounting for over 90 percent of the region's total. The average life expectancy in Tibet reached a record high of 71.1 in 2020, double the figure from 1951.\n\nChina attaches great importance to the protection and development of traditional Tibetan culture, with the study and use of the Tibetan language protected by law. The region now has 16 periodicals and 12 newspapers in the Tibetan language, and has published more than 40 million copies of 7,185 Tibetan-language books. In addition, the language is widely used in the sectors of health, postal services, communications, transport, finance, and science and technology.\n\nThe disconnect between the region's flourishing cultural scene and its depiction in Western circles was described by Albert Ettinger, a Tibet researcher from Luxembourg, in his 2015 book Battleground Tibet as \"stories from wonderland.\" These tall tales seek to conflate unprecedented population growth with \"genocide\" and a cultural renaissance with \"cultural genocide.\"\n\nRein and Blair also found that younger Tibetans seem to be the most optimistic of all the different segments of society, thanks to the great advancements made in the quality of life of locals.\n\nAs the first two foreigners to visit the Zam Hydropower Station along the Yarlung Zangbo River, the largest plant of its kind in Tibet, they were glad to see the balance struck between development and environmental protection.\n\nThe hydropower plant currently provides 30 percent to 35 percent of Tibet's energy needs, saving some 400,000 tonnes of diesel oil every year, according to Liu Feng, who is in charge of its operation. In addition, hundreds of millions of yuan has been spent to ensure fish can safely bypass the facility and swim back upstream.\n\n\"If people's livelihoods are to be improved, the region needs to have sufficient electricity,\" Liu said. \"People should not demonize the utilization of hydroelectric energy.\"\n\nSince 1978 when China started its reform and opening-up push, the Communist Party of China Central Committee has held seven national meetings on Tibet, making major decisions and plans for the region.\n\nChina began to provide pairing-up support for Tibet in 1994, with central government departments, other provinces and equivalent administrative units along with centrally administered state-owned enterprises offering paired assistance through 6,330 projects, representing a total investment of 52.7 billion yuan by 2020. A total of 9,682 outstanding officials were selected and dispatched to assist the region during the period.\n\nAccording to Rein, these policies show that the whole country has been trying to progress and work together to build a strong China.\n\n\"You don't see, say in the United States, where a wealthy state like California is sending some of their tax money to poor states like West Virginia,\" he said. \"And that's why they are falling further and further behind under the income level.\"\n\nIn comparison, China, Rein noted, \"doesn't want to leave any provinces behind.\"\n\n\n\n\n\nWeb Editor：MXJ"}, {"url": "http://en.youth.cn/news/china/200811/t20081111_820574.htm", "page_content": "China said Monday that no concessions would be made on issues concerning the national sovereignty following talks between central government officials and private envoys of the Dalai Lama. \"The unification of the motherland, territorial integrity and the national dignity are the greatest interests of the Chinese people. We will never make a concession,\" Zhu Weiqun, executive vice minister of the United Front Work Department (UFWD) of the Communist Party of China (CPC) Central Committee, told reporters.\n\nThe Dalai Lama's private representatives, Lodi Gyari and Kelsang Gyaltsen, were in China from October 31 to November 5, during which period Zhu, UFWD Vice Minister Sita and Executive Vice Chairman of the Tibet Autonomous Region Pelma Trilek held talks with them.\n\nDu Qinglin, vice-chairman of the National Committee of the Chinese People's Political Consultative Conference, also met with them.\n\nThis is the ninth round of talks between Chinese central government officials and the Dalai Lama's private envoys since 2002 and the third round of talks this year.\n\nZhu admitted contacts and talks \"failed to make progress\". He said the Dalai Lama side should \"shoulder full responsibility for that\".\n\nAsked to comment on the reports in which the Dalai Lama said he would not follow a so-called \"middle way\" if the talks failed, Zhu said the claim of \"middle way\" aimed at outright Tibetan independence and thus unacceptable to the central government.\n\nThe Dalai Lama put forward the idea of \"middle way\" in the 1980s.\n\nZhu said the Dalai Lama explained the approach many times, including in the \"five-point peace plan\" in 1987, the \"seven-point new suggestions\" in 1988 and a \"Memorandum\" tabled to the central government by his private representatives during the recent talks.\n\nZhu said those remarks and documents showed that the Dalai Lama's \"middle way\" had five basic features. \"The first is that the Dalai Lama does not acknowledge that Tibet is part of China since ancient times.\"\n\n\"The Dalai Lama said on many occasions that when the Chinese People's Liberation Army (PLA) entered Tibet, Tibet was an independent country and now Tibet is still an independent country, which was illegally occupied,\" Zhu said.\n\nHe said it is known to all people with some historical knowledge that the Chinese central authorities have exerted undisputable and effective administration over Tibet since the beginning of the Yuan Dynasty (1271-1368).\n\n\"By denying China's sovereignty over Tibet, the Dalai Lama is seeking a legal basis for his activities of 'Tibet independence', 'semi-independence and 'independence in a disguised form',\" Zhu said.\n\n'Secondly, the Dalai Lama is scheming for a 'Greater Tibet', which has never existed,\" he said.\n\nZhu said the so-called \"Greater Tibet\" included not only the whole Tibet Autonomous Region, but also a large territory of Qinghai Province, Tibetan Autonomous Prefecture of Gannan in Gansu Province, Tibetan Autonomous Prefecture of Garze and Aba in Sichuan Province, Tibetan Autonomous Prefecture of Deqen in Yunnan Province and some other areas.\n\n\"In total, it covers one fourth of China's entire territory,\" Zhu said.\n\nZhu said Tibetan areas outside Tibet had never been under the administration of Tibet's local government. When Tibet was peacefully liberated in 1951, the jurisdiction of the local Tibet government did not exceed the current area of the Tibet Autonomous Region.\n\nZhu said the attempt at a \"Greater Tibet\" also harbors malicious intentions.\n\n\"China is a country in which various ethnic groups live together. If ethnic groups in China all ask for an autonomous region in which only people of their own groups could live, the whole country would be cast into chaos,\" he said.\n\nZhu said the third feature of the \"middle way\" was to overthrow the current social and political system in the Tibet Autonomous Region under the pretense of \"high degree of autonomy\".\n\nThe official said the Dalai Lama and key supporters had said on many occasions that a \"high degree of autonomy\" meant that except for diplomatic and military affairs, all political, economic, cultural, educational and religious affairs should be subject to the administration of Tibetans.\n\nIn that case, feudal serfdom would be re-established over one-fourth of the Chinese territory, he said.\n\nZhu said the fourth feature was that it asked the central government to withdraw the PLA from \"Greater Tibet\" area.\n\n\"Everybody knows that the army is a basic guarantee of territorial integrity, national security and social stability,\" Zhu said. \"I believe not a single nation would agree to withdraw its own army from its own territory.\"\n\nZhu said the fifth feature of the \"middle way\" is the exclusion of other ethnic groups from the area of \"Greater Tibet\".\n\nZhu said the Dalai Lama's \"five-point peace plan\" stated clearly that the migration of other ethnic groups to Tibet must be curbed and the Han migrants must leave Tibet.\n\nThat means, once the Dalai Lama retained power in Tibet, racial discrimination, segregation and purges would be inevitable, Zhu said.\n\nThe official urged the Dalai Lama to \"do some good things for the country and the people including the Tibetans\". He reiterated that the door for the Dalai Lama's return to a patriotic stance had always been open and would remain open.\n\n\"But the door for 'Tibet independence', 'half independence' and 'independence in a disguised form' had never been open, nor would it be open in the future,\" he said."}, {"url": "http://www.chinatoday.com.cn/english/culture/2014-02/27/content_599683.htm", "page_content": "DEEP in the snowy mountains of the Qinghai-Tibet Plateau, legend recalls, is a blessed valley in the shape of an eight-petal lotus. Spectacular snowcapped mountains, steep gorges and alpine meadows sprinkled with wildflowers are found here. It is Shangri-La in Yunnan Province’s Di-qing Tibetan Autonomous Prefecture.\n\nDiqing, or Deqen, sits in the transitional zone between the Yunnan-Guizhou Plateau and the Qinghai-Tibet Plateau. Its ancient history, distinctive landforms, mysterious religions and diverse ethnic groups lend a great appeal to this faraway land.\n\nThe Gedeng Neolithic Site in Weixi County attests to human habitation as early as 7,000 years ago. And inscribed slates unearthed in the region reveal a thriving civilization dating back 2,400 years.\n\nLocated on the ancient Tea-Horse Trail, also known as the Southern Silk Road, Diqing is an intersection of exchanges between China’s east and west, north and south. In addition to Tibetans, who account for one third of the local population, it is home to 25 other ethnic communities, including the Lisu, Naxi and Bai. They all live in concord with each other, while retaining their respective cultures, which have converged and co-developed over the past generations.\n\nThe Ganden Songtsen Ling Monastery, Dondrup Ling Monastery and the Dongba pictographs are among the most iconic manifestations of Diqing’s diverse and mysterious folk traditions, which add brilliance to the region’s scenic panorama.\n\nDiqing remained unknown to the outside world until 1933, when English writer James Hilton wrote Lost Horizon, which describes an isolated but pleasurable valley called Shangri-La whose residents of different ethnic backgrounds enjoyed peace and longevity. The novel was made into a film in 1937, and the theme song “Beautiful Shangri-La” then spread across the world.\n\nThe book was thought to present Shangri-La as an imaginary place. The exact location could not be identified, though a number of countries around the world have claimed it is on their territory. Now 60 years of research provide sufficient evidence that Diqing is none other than Shangri-La.\n\nThe English “Shangri-La” sounds like it originates in the Tibetan dialect spoken in Zhongdian, capital of Diqing. In the Tibetan language, the word means “moon in one’s heart.” Moreover, the folklore and natural environment depicted in the novel bear a strong resemblance to Zhongdian. In 2001, the region officially changed its name to Shangri-La.\n\nDiqing boasts a wide diversity of landforms – mountains, lakes, glaciers, karsts, meadows – and climate zones, owing to its peculiar geographic location, complex geological structures and sharp altitudinal differences. What’s more, the region is rich in biodiversity. Almost all plants that usually grow in the tropical, temperate and frigid zones of the northern hemisphere can be found here. The region is thus treasured as a botanical gene bank.\n\nThe Ganden Songtsen Ling Monastery\n\nShangri-La is about 200 km from Lijiang, an ancient city inhabited by the Naxi people. Heading north from Lijiang, the scenery changes dramatically with the increasing altitude. The sight of wildflowers bathed in glorious sunshine and cows and sheep grazing on the meadows lightens the heart.\n\nNo visitor to Shangri-La should miss the Ganden Songtsen Ling Monastery, known as the soul of Diqing.\n\nBuilt in 1679, at the order of the fifth Dalai Lama following an augury, it is the largest Tibetan Buddhist shrine in Yunnan Province. Rising along a hillside, this majestic complex, with its towering roofs of gilded brass tiles gleaming in the sun, along with vermilion walls, white windows and black curtains standing out against a clear blue sky, evokes a heavenly aura. This design wins it the renown of “minor Potala Palace.”\n\nGanden Songtsen Ling was significant for the seventh Dalai Lama Kelzang Gyatso. Before the sixth Dalai Lama Tsangyang Gyasto (1683-1708) passed away, he predicted, “The white crane will not stay afar. Someday, it will return from Litang.” It turned out that his soulboy was indeed found to be born in Litang, now a county in Sichuan Province."}]}