{"Jack Straw served in the Cabinet from 1997 to 2010.": [{"url": "https://www.britannica.com/biography/Jack-Straw", "page_content": "Jack Straw, in full John Whitaker Straw, (born August 3, 1946, Essex, England), British Labour Party politician who held numerous government posts, including home secretary (1997–2001), foreign minister (2001–06), leader of the House of Commons (2006–07), and lord chancellor and secretary of state for justice (2007–10).\n\nStraw studied law at the University of Leeds and then received training as a barrister in London at the Inns of Court School of Law (now The City Law School, part of City University London). He served (1971–74) on the Inner London Education Authority and was its chair in 1973, before working as a special adviser to Labour Party cabinet ministers Barbara Castle (1974–76) and Peter Shore (1976–77). After a brief stint as a television researcher, Straw entered Parliament in 1979 as MP for Castle’s former seat of Blackburn, Lancashire. He rose steadily through Labour’s ranks and was elected to the party’s opposition shadow cabinet in 1987. During the party’s internal ideological conflict in the 1980s, he moved from being a traditional left-winger to becoming a more centrist modernizer. He was the first leading member of the Labour Party to propose that it repeal its socialist commitment—Clause IV of the party’s constitution—to the state control of industry. In 1994 Straw managed Tony Blair’s successful campaign to be elected party leader, and one of Blair’s first acts on becoming leader was to win the party’s agreement to rewrite Clause IV.\n\nFollowing Labour’s election victory in 1997, Straw was appointed home secretary. He quickly established his progressive credentials by setting up an inquiry into charges of racism in the London police force, promoting the incorporation of the European Convention on Human Rights into British law, and refusing to allow the former Chilean head of state, Augusto Pinochet, to return home following Pinochet’s October 1998 arrest in London. (The arrest followed a request by the Spanish government that Pinochet be extradited to Spain to face charges of murder. He was allowed to return to Chile in March 2000 when a panel of doctors advised that he was unfit to face trial.) Straw upset many progressives, however, by initiating legislation to withdraw the right of some defendants to be tried by a jury, introducing stricter requirements for people seeking political asylum in Great Britain, diluting Labour’s pre-1997 election promise to establish a freedom of information law, and resisting calls to decriminalize the consumption of so-called “soft” drugs, such as marijuana.\n\nIn a 2001 cabinet reshuffle, Straw received the foreign and Commonwealth affairs portfolio. As foreign minister, Straw supported the invasion of Iraq as well as the expansion of the European Union (EU). Despite the latter position, however, Straw was a known skeptic of the euro, the EU’s single currency. Shortly after Labour’s poor showing in the May 2006 local elections, Blair overhauled his cabinet, and Straw was removed as foreign minister and made leader of the House of Commons. Later that year he caused controversy when he stated that Muslim women should not wear full veils. After Gordon Brown became prime minister in 2007, Straw was named justice secretary and lord chancellor, thereby becoming the first member of the House of Commons to take up the latter post. The following year he outlined potential reforms to the House of Lords, which included the election of a certain percentage of members and a reduction in the number of lords. In 2009 he sparked debate after stating that oil deals with Libya had played a “very big part” in the decision to release Abdelbaset Ali Mohmed al-Megrahi—a Libyan convicted of bombing Pan Am flight 103 in 1988—from a Scottish prison. In the general election of 2010 Straw easily retained his Blackburn constituency but lost his cabinet position when Labour was ousted from office. In February 2015 Straw temporarily resigned from the Labour Party after allegations surfaced of his involvement in an influence-peddling scandal that resulted from a sting investigation conducted by Channel Four and The Daily Telegraph. Having already announced in 2013 that he would not stand for reelection, Straw retired from the House of Commons in 2015."}, {"url": "https://www.wikiwand.com/en/John_Whitaker_Straw", "page_content": "John Whitaker Straw (born 3 August 1946) is a British politician who served in the Cabinet from 1997 to 2010 under the Labour governments of Tony Blair and Gordon Brown. He held two of the traditional Great Offices of State, as Home Secretary from 1997 to 2001, and Foreign Secretary from 2001 to 2006 under Blair. He was a Member of Parliament (MP) for Blackburn from 1979 to 2015.\n\nBritish Labour politician (born 1946)\n\nQuick facts: The Right HonourableJack Straw, Secretary of ... ▼\n\nStraw was born in Essex and educated at Oaklands School, where his mother worked as a teacher, and later at Brentwood School. He studied Law at the University of Leeds before having a career as a barrister. He served as an adviser to cabinet minister Barbara Castle and was selected to succeed her as MP for the Blackburn constituency when she stood down at the 1979 United Kingdom general election.\n\nFrom 2007 to 2010, he served as Lord High Chancellor of Great Britain and the Secretary of State for Justice throughout the Brown ministry. Straw is one of only three individuals to have served in Cabinet continuously during the Labour governments from 1997 to 2010, the others being Brown and Alistair Darling. After the Labour Party lost power in the 2010 United Kingdom general election, he briefly served as Shadow Deputy Prime Minister and Shadow Secretary of State for Justice, with the intention of standing down from the frontbench after the subsequent 2010 Labour Party Shadow Cabinet election."}, {"url": "https://rusi.org/people/straw/", "page_content": "The Rt Hon Jack Straw is one of three senior Ministers to remain in Cabinet throughout the 1997 to 2010 Labour Government. He served as Foreign Secretary (2001 to 2006), Home Secretary (1997 to 2001), Leader of the Commons (2006 to 2007), and Lord Chancellor and Justice Secretary (2007 to 2010). He was Member of Parliament for Blackburn from 1979 to 7 May 2015, when he retired from the Commons.\n\nBefore becoming an MP, Jack practiced as a Barrister, and then worked as a Special Adviser in the Labour Government of 1974 to 1979. He served on the Opposition Front Bench from 1980 to 1997.\n\nAppointed Foreign Secretary in 2001, Jack played a leading role in the dramatic foreign policy problems arising from the 9/11 terrorist attacks in New York and the resulting interventions in Afghanistan and Iraq. He was instrumental in helping avoid an extremely dangerous armed conflict between India and Pakistan over Kashmir in 2002. He was a member of the European Council for five years. In 2005 he led successful efforts to open formal EU membership negotiations with Turkey. He is co-Chairman of the government-sponsored British-Turkish Forum. He was given the Order of the Republic of Turkey by President Abdullah Gül in 2012.\n\nWith his French and German counterparts, Jack initiated the “E3” (later “E3+3”) negotiations with Iran over their nuclear programme, and has taken a close interest in Iran ever since, having visited it eight times.\n\nHe is a Visiting Professor at University College London School of Public Policy. Since 2015 he has been Chairman of the Blackburn Youth Zone, and from 2017 a Trustee of the Tauheedul Education Trust. He is a Trustee of the Global Strategy Forum, and of the Atlantic Partnership.\n\nHis publications include: ‘Last Man Standing: Memoirs of a Political Survivor’ (Macmillan: 2012); Hamlyn Lectures 2012 on Law Reform (CUP)."}, {"url": "https://pantheon.world/profile/person/Jack_Straw/", "page_content": "Jack Straw\n\nJohn Whitaker Straw (born 3 August 1946) is a British politician who served in the Cabinet from 1997 to 2010 under the Labour governments of Tony Blair and Gordon Brown. He held two of the traditional Great Offices of State, as Home Secretary from 1997 to 2001, and Foreign Secretary from 2001 to 2006 under Blair . Read more on Wikipedia\n\nSince 2007, the English Wikipedia page of Jack Straw has received more than 1,050,748 page views. His biography is available in 31 different languages on Wikipedia . Jack Straw is the 14,799th most popular politician (down from 12,748th in 2019), the 4,048th most popular biography from United Kingdom (down from 3,538th in 2019) and the 514th most popular British Politician."}, {"url": "https://www.liquisearch.com/jack_straw/member_of_parliament/lord_chancellor_and_secretary_of_state_for_justice", "page_content": "Lord Chancellor and Secretary of State For Justice\n\nStraw was appointed Lord High Chancellor of Great Britain and Secretary of State for Justice on the first full day of Gordon Brown's ministry, 28 June 2007. He was the first Lord Chancellor since the sixteenth century to serve in the role whilst a member of the House of Commons. His appointment meant that he continued to be a major figure in the Labour Government. Only Straw, Brown and Alistair Darling served in the cabinet continuously during Labour's 13 year administration from 1997 to 2010.\n\nIn February 2009, Straw used his authority as Justice Secretary to veto publication of government documents requested under the Freedom of Information Act: in particular, those pertaining to early government meetings concerning the (forthcoming) Iraq War.\n\nStraw represented the government on a controversial edition of Question Time on 22 October 2009, against British National Party leader Nick Griffin on his first ever appearance. Griffin's first comment was to attack Straw's father's wartime record, to general disdain. As Griffin claimed that European laws prevented him from explaining his stance on holocaust denial Straw later offered his personal assurance as Justice Secretary, which Griffin declined."}, {"url": "https://londonspeakerbureau.com/speaker-profile/jack-straw/", "page_content": "Rt Hon Jack Straw is one of three senior Ministers to remain in Cabinet throughout the 1997 to 2010 Labour Governments under Tony Blair and Gordon Brown. He was Foreign Secretary (2001-2006), Home Secretary (1997-2001), Leader of the Commons (2006-7), and Lord Chancellor and Justice Secretary (2007-10). After Labour lost power in 2010, Straw served for six months as Shadow Deputy Prime Minister, and then stood down from the Shadow Cabinet, having served on Labour’s Front Bench for over thirty years.\n\nStraw was a Member of Parliament for Blackburn from 1979 to 2015, when he retired from the Commons. His approach won praise from Margaret Thatcher, who once declared “I would trust Jack Straw’s judgement. He is a very fair man”. Before becoming an MP, Straw practised as a Barrister, and then worked as a Special Adviser in the 1974-79 Labour Government. Appointed Foreign Secretary in 2001, Straw played a leading role in the dramatic foreign policy problems arising from the 9/11 terrorist attacks in New York and the resulting interventions in Afghanistan and Iraq. He was instrumental in helping to avoid an extremely dangerous armed conflict between India and Pakistan over Kashmir in 2002.\n\nJack Straw was a member of the European Council for five years. In 2005 he led successful efforts to open formal EU membership negotiations with Turkey. He is co-Chairman of the government-sponsored British-Turkish Forum. Straw was given the Order of the Republic of Turkey by President Abdullah Gül in 2012. With his French and German counterparts, Jack initiated the “E3” (later “P5+1”) negotiations with Iran over their nuclear programme, and has taken a close interest in Iran ever since, having visited it eight times. In July 2019 he published “The English Job: Understanding Iran, and why it distrusts Britain” (Biteback), which has been very well reviewed: ‘Highly readable, full of vivid history” (Observer); “Essential reading..clear-sighted and lucid” (Sunday Times).\n\nHe is a Visiting Professor at University College London School of Public Policy. Since 2015 he has been Chairman of the Blackburn Youth Zone, and from 2017 a Trustee of the Star (Tauheedul) Education Trust, which runs over twenty mainly Muslim state-funded schools. Straw is a Trustee of the Global Strategy Forum, and of the Atlantic Partnership. He is a Distinguished Fellow of the Royal United Services Institute (RUSI), and a Bencher of the Inner Temple. He is an adviser to a number of companies. He is Honorary Vice-President of the Blackburn Rovers Football Club.\n\nJack Straw was appointed by Prime Minister David Cameron as a member of the Independent Commission on Freedom of Information (2015-16), and served as a member of the Archbishops’ Council on the future of Cathedrals. In 2012 he published ‘Last Man Standing: Memoirs of a Political Survivor’ (2012, Macmillan). The Times’ reviewer said that this was a ‘masterclass in the art of government…lucid, engaging, humorous, occasionally self-deprecating, and generally frank’."}, {"url": "https://www.independent.co.uk/news/uk/politics/jack-straw-to-be-denied-knighthood-and-peerage-under-labour-leader-jeremy-corbyn-a6862701.html", "page_content": "Sign up for the View from Westminster email for expert analysis straight to your inbox Get our free View from Westminster email Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nView from Westminster email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\n\nJack Straw, one of the longest-serving Cabinet ministers in a Labour government, is to be denied a place in the House of Lords for as long Jeremy Corbyn is Labour leader, according to a senior Labour Party figure.\n\nMr Straw served in the Cabinet for the entire time Labour was in power from 1997 to 2010. He is despised by some members of the Labour Party for his role as Foreign Secretary in the 2003 Iraq war.\n\nIn February last year, Mr Straw was filmed by undercover reporters from Channel 4 and The Daily Telegraph, seemingly agreeing to use his political contacts for financial gain. He revealed during that conversation that he was expecting to go into the Lords when he stepped down from the Commons in May, after 36 years as an MP.\n\nThe Labour grandee served in both Tony Blair and Gordon Brown's administrations (Getty)\n\nThe then-Labour leader Ed Miliband was willing to nominate Mr Straw for a peerage, but had to shelve the idea pending an investigation by Parliament’s standards watchdog Kathryn Hudson, who eventually cleared Mr Straw of wrongdoing – although the broadcasting regulator, Ofcom, came out strongly in defence of the Channel 4 investigation.\n\nMr Corbyn’s spokesman said the Opposition leader was not thinking of nominating anyone for a peerage or honour – but would not be drawn on whether Mr Straw had any chance of being on any future list."}, {"url": "https://wikispooks.com/wiki/Jack_Straw", "page_content": "Jack Straw (born 3 August 1946) is a British politician who was the Member of Parliament for Blackburn from 1979 to 2015. Straw served in the Cabinet from 1997 to 2010 under the governments of Tony Blair and Gordon Brown. He held two of the traditional Great Offices of State, as Home Secretary from 1997 to 2001 and Foreign Secretary from 2001 to 2006 under Blair. From 2007 to 2010 he served as Lord Chancellor and Justice Secretary throughout Brown's premiership. Straw is one of only three individuals to have served in Cabinet continuously under the Labour government from 1997 to 2010.\n\nAfter the Labour Party lost power in May 2010, Straw briefly served as Shadow Deputy Prime Minister and Shadow Justice Secretary, with the intention of standing down from the frontbench after the subsequent 2010 Labour Shadow Cabinet election.[1]\n\nImpropriety\n\nIn February 2015 Channel 4 Dispatches and the Daily Telegraph accused Straw of impropriety following a meeting they set up with a fictitious Chinese company. Straw strongly denied the allegations and referred himself to Parliament’s Commissioner for Standards. In September 2015, the Commissioner for Standards dismissed all allegations that he had brought the House of Commons into disrepute and criticised the conduct of Channel 4 and the Daily Telegraph.\n\nNo Sir or Lordship\n\nIn February 2016, The Guardian reported \"Jack Straw to be 'denied knighthood and peerage' under Jeremy Corbyn\" explaining that Straw's support for Iraq War and comments in ‘cash for access’ sting among reasons for denial:\n\nHaving served as home secretary, foreign secretary and then lord chancellor, Straw is understood to have been lined up for a seat in the Lords during the final days of Ed Miliband’s period as party leader. But he suspended himself from party membership last February after being secretly filmed by undercover reporters while apparently offering his services to a private company for cash. This prevented an offer of a peerage at the time.\n\nAlthough Straw was subsequently cleared of misconduct by the parliamentary standards watchdog, his chances of a seat in the Lords are said to have disappeared after Corbyn’s election as leader in September:\n\n“The chances of Jeremy awarding him with either a knighthood or a peerage are close to zero,” said one senior party source, before adding: “Actually, they are zero.”\n\nStraw, who stood down as MP at the last general election, did not respond to requests for comment. He is currently serving on a panel that is reviewing the Freedom of Information Act, although his appointment was criticised by some, as he has been a vocal opponent of the act.\n\nOn Monday, the Guardian reported that Straw led two of the Whitehall departments most likely to reject public requests for information. Straw’s ministries never ranked higher than 15 out of 21 government departments in terms of releasing information in full, according to a Guardian analysis of government-wide figures.\n\nAccording to party sources, there are several reasons for the decision not to nominate the former minister for a peerage: his support for the 2003 invasion of Iraq; a damages claim that is being brought against him by a Libyan couple who were “rendered” to one of Muammar Gaddafi’s prisons; an ongoing inquiry by Westminster’s Intelligence and Security Committee (ISC) into that and other rendition allegations; and the words that were captured by the undercover reporter.\n\nIt appears Straw’s support for the war in Iraq counts most heavily against him among the Labour leader and his closest supporters.\n\nSting operation\n\nBoth Straw and the Tory MP Sir Malcolm Rifkind, the then chair of the ISC, were caught in a sting mounted by the Daily Telegraph and Channel 4 in February last year. The transcript of the exchanges indicated that Straw hoped for a seat in the Lords. The two men were filmed as they offered to use their positions as politicians in return for payments of thousands of pounds from a fictitious Chinese company. At one point, one of the reporters asked Straw about the implications of his leaving the House of Commons. Straw replied: “Well, the implications are that I can do a lot more for you.”\n\nA Telegraph reporter then asked: “Ah ha, in what way?”\n\nJS: “Well, it’s not subject to regulation. Obviously ... I’m still the same person – I mean, if you are a member of parliament and you have commercial interests, you have to be so careful ... if I was ever to stand up in the House of Commons and talk about sugar, I could end up being disqualified … Because there are very strict rules against advocating on behalf of companies who are paying you.”\n\nTel: “Right.”\n\nJS: “ ... Well obviously if I’m not in the House of Commons, I’m not in that position. I could end up in the House of Lords, so you’re aware ... you may have seen that ...”\n\nTel: “That’d be good. You mentioned.”\n\nJS: “ ... I mean there’s speculation in the paper at the moment – no one has said anything to me officially. But the rules there are different and plenty of people have commercial interests there.”\n\nTel: “Ah great, so you’ll be able to help us a lot more potentially?”\n\nJS: “I’ll be able to help you more, Claire, I’ll be able to help you more.”\n\nBoth politicians denied any wrongdoing, and said that they had acted in accordance with parliamentary rules. Rifkind was suspended from his parliamentary party while Straw suspended himself. Senior Labour sources say Straw had been in line for a peerage until this point.\n\nIn September, Conservative sources briefed journalists that Rifkind would be “near the top of the list” the next time David Cameron proposed a list of new political peers.\n\nThe Parliamentary Standards Commissioner, Kathryn Hudson, and the House of Commons standards committee cleared both of any wrongdoing and criticised the way the exchanges had been reported.\n\nBoth the Telegraph and Channel 4 were angered by the commissioner’s conclusions. The Telegraph published a leader which condemned them as “deeply troubling” and “shameful”, while Channel 4 reported itself to the regulator, Ofcom.\n\nIn December, Ofcom found that the reporting was of significant public interest and did not unfairly represent the two politicians. It also concluded that the undercover filming was “proportionate and warranted”.\n\nRendition\n\nA damages claim is being brought against Straw by Abdelhakim Belhadj, who was abducted in Thailand and flown to Tripoli along with his pregnant wife, Fatima Bouchar, in March 2004, with the assistance of MI6 and the CIA.[2] Straw was foreign secretary at the time.\n\nA cache of secret documents that detailed the involvement of MI6’s then head of counter-terrorism, Mark Allen, in that rendition was discovered during the 2011 Libyan revolution. After Straw gave an interview to the BBC in which he said that “no foreign secretary can know all the details of what its intelligence agencies are doing at any one time”, well-placed sources told the Guardian that the rendition operations were “ministerially authorised government policy”.\n\nGovernment lawyers are arguing that the claim should be thrown out on the grounds that the case will involve the acts of other countries. A decision is expected from the Supreme Court in the next few months.\n\nA Scotland Yard investigation, Operation Lydd, examined the Libyan rendition operation. A police file was given to Alison Saunders, the Director of Public Prosecutions. In 2016, the CPS announced their decision \"that there is insufficient evidence to charge the suspect with any criminal offence.\"[3]\n\nThe treatment of Belhadj and Bouchar is also being investigated by the ISC, after an interim inquiry by Sir Peter Gibson, a retired appeal court judge, reported that there were “serious allegations of UK involvement” which “plainly require investigation”.\n\nWhen asked about the Libyan renditions in the past, Straw has said:\n\n“At all times I was scrupulous in seeking to carry out my duties in accordance with the law, and I hope to be able to say more about this at an appropriate stage in the future.”[4]\n\nIn June 2017, it was reported that the FCO wants the Abdelhakim Belhadj rendition case against Jack Straw to be held in private.[5]\n\nA Document by Jack Straw\n\nA Quote by Jack Straw\n\nRelated Quotation\n\nPage Quote Author Craig Murray “Can I just say how pleasant it is to be vindicated ten years after being sacked by Jack Straw for opposing the torture and extraordinary rendition programme – which Blair and Straw claimed I was inventing.” Craig Murray\n\nEvents Participated in\n\nRelated Document\n\n\n\n"}, {"url": "https://peoplepill.com/people/jack-straw/", "page_content": "John Whitaker \"Jack\" Straw (born 3 August 1946) is an English politician who served as the Member of Parliament (MP) for Blackburn from 1979 to 2015. Straw served in the Cabinet from 1997 to 2010 under the governments of Tony Blair and Gordon Brown. He held two of the traditional Great Offices of State, as Home Secretary from 1997 to 2001 and Foreign Secretary from 2001 to 2006 under Blair. From 2007 to 2010 he served as Lord Chancellor and the Secretary of State for Justice throughout Brown's Premiership. Straw is one of only three individuals to have served in Cabinet continuously under the Labour government from 1997 to 2010, the others being Gordon Brown and Alistair Darling.\n\nAfter the Labour Party lost power in May 2010, Straw briefly served as Shadow Deputy Prime Minister and Shadow Justice Secretary, with the intention to stand down from the frontbench after the subsequent 2010 Labour Shadow Cabinet election.\n\nIn February 2015 Channel 4 Dispatches and The Daily Telegraph accused Straw of impropriety following a meeting they set up with a fictitious Chinese company. Straw strongly denied the allegations and referred himself to Parliament’s Commissioner for Standards. In September 2015 the Commissioner for Standards dismissed all allegations that he had brought the House of Commons into disrepute and criticised Channel 4 and the Daily Telegraph’s conduct.\n\nEarly life\n\nJack Straw was born in Buckhurst Hill in Essex, the son of Walter Arthur Whitaker Straw, an insurance salesman, and Joan Sylvia Gilbey. After his father left the family, Straw was brought up by his mother on a council estate in Loughton. Known to his family as John, he started calling himself Jack while in school, in reference to Jack Straw, one of the leaders of the Peasants' Revolt of 1381. Straw is of 1/8th Jewish descent (his maternal grandfather's mother came from an Eastern European Jewish family). Straw himself is a Christian.\n\nJack Straw was educated at Brentwood School and the University of Leeds. He graduated with a 2:2 degree in Law. He was alleged by the Foreign Office to have disrupted a student trip to Chile to build a youth centre. They branded him a \"troublemaker acting with malice aforethought.\"\n\nStraw was then elected president of the Leeds University Union. At the 1967 National Union of Students (NUS) Conference, he unsuccessfully ran for office in the NUS. In April 1968, he stood unsuccessfully for election as NUS President, to be defeated by Trevor Fisk. However, he was elected as NUS President in 1969, holding this post until 1971. In 1971, he was elected as a Labour councillor in the London Borough of Islington, a position he held until 1978.\n\nA motion of Leeds University Union Council in 2000 removed Jack Straw's life membership of the Union and removed his name from the Presidents' Board, citing his support for asylum and immigration bill and limits to trial by jury and legal aid. In 2007 the Union Council reinstated his life membership and place on the Presidents' Board.\n\nStraw subsequently qualified as a barrister at Inns of Court School of Law, practising criminal law for two years from 1972 to 1974. He is a member of The Honourable Society of the Inner Temple and remains active in lecturing to fellow members and students.\n\nBetween 1971 and 1974, Jack Straw was a member of the Inner London Education Authority, and Deputy Leader from 1973 to 1974. He served as a political adviser to Barbara Castle at the Department of Social Security from 1974 to 1976, and as an adviser to Peter Shore at the Department for the Environment from 1976 to 1977. From 1977 to 1979, Straw worked as a researcher for the Granada TV series, World in Action.\n\nStraw stood unsuccessfully as the Labour parliamentary candidate for the safe Conservative Tonbridge and Malling constituency in the February 1974 election. He was later selected to stand for Labour in its safe Blackburn seat at the 1979 General Election.\n\nMember of Parliament from 1979–2015\n\nStraw was selected to stand for Parliament for the Lancashire constituency of Blackburn in 1977, after Barbara Castle decided not to seek re-election there. He won the seat in 1979. On 25 October 2013 he announced that he would stand down as an MP at the next election.\n\nShadow Cabinet (1987–1997)\n\nStraw's first Shadow Cabinet post was as Education spokesman from 1987. In this role, he called on local education authorities to give private Muslim and Orthodox Jewish schools the right to opt out of the state system and still receive public funds. He also stated that the schools should be free to enter the state system. His comments came at a time of great controversy regarding the funding of Muslim schools. Straw argued that the controversy arose out of ignorance and stereotyping about women's role in Islam, pointing out that Muslim women acquired property rights centuries before European women.\n\nStraw briefly served as Shadow Secretary of State for the Environment under John Smith from 1992 to 1994, speaking on matters concerning local government. When Tony Blair became leader after Smith's death, he chose Straw to succeed him as Shadow Home Secretary. Like Blair, Straw believed Labour's electoral chances had been damaged in the past by the party appearing to be \"soft on crime\" and he developed a reputation as being even more authoritarian than the Conservative Home Secretary Michael Howard. Straw garnered particular attention for comments condemning \"aggressive beggars, winos and squeegee merchants\" and calling for a curfew on children.\n\nHome Secretary (1997–2001)\n\nAppointed as Home Secretary after the 1997 general election, he brought forward the Regulation of Investigatory Powers Act 2000, increased police powers against terrorism and proposed to remove the right to trial by jury in certain cases. These policies won praise from Margaret Thatcher who once declared \"I would trust Jack Straw's judgement. He is a very fair man.\" They were deemed excessively authoritarian by his former students' union, which in 2000 banned him from the building—a policy which lapsed in 2003. However, he also incorporated the European Convention on Human Rights into British law, finalising the de jure abolition of the death penalty with the passage of the Human Rights Act 1998.\n\nOn 31 July 1997, Straw ordered a public inquiry, to be conducted by Sir William Macpherson and officially titled \"The Inquiry into the Matters Arising from the Death of Stephen Lawrence\". Its report, produced in February 1999, estimated that it had taken \"more than 100,000 pages of reports, statements, and other written or printed documents\" and concluded that the original Metropolitan Police Service (MPS) investigation had been incompetent and that officers had committed fundamental errors, including: failing to give first aid when they reached the scene; failing to follow obvious leads during their investigation; and failing to arrest suspects. The report found that there had been a failure of leadership by senior MPS officers and that recommendations of the 1981 Scarman Report, compiled following race-related riots in Brixton and Toxteth, had been ignored and concluded that the force was \"institutionally racist\". It also recommended that the double jeopardy rule should be abrogated in murder cases to allow a retrial upon new and compelling evidence; this became law in 2005. Straw commented in 2012 that ordering the inquiry was \"the single most important decision I made as Home Secretary\".\n\nAs Home Secretary, Straw was also involved in changing the electoral system for the European Parliament elections from plurality to proportional representation. In doing so, he advocated the use of d'Hondt formula as being the one that produces the most proportional outcomes. The d'Hondt formular, however, is less proportional to the Sainte-Laguë formula which was proposed by the Liberal Democrats. Straw later apologised to the House of Commons for his misleading comments, but the d'Hondt formula stayed in place.\n\nIn March 2000, Jack Straw was responsible for allowing former Chilean dictator Augusto Pinochet to return to Chile. There were requests from several countries for Pinochet to be extradited and face trial for crimes against humanity. Pinochet was placed under house arrest in Britain while appealing the legal authority of the Spanish and British courts to try him, but Straw eventually ordered his release on medical grounds before a trial could begin, and Pinochet returned to Chile.\n\nThe Rotherham sexual abuse scandal continued at this time, and according to the Telegraph, Straw had highlighted the problem four years prior to the Jay Report being published, saying “ there was a \"specific problem\" in some areas of the country where Pakistani men \"target vulnerable young white girls\". White girls were, he said, viewed as “easy meat”.\n\nAlso in 2000, Straw turned down an asylum request from a man fleeing Saddam Hussein's regime, stating \"we have faith in the integrity of the Iraqi judicial process and that you should have no concerns if you haven’t done anything wrong.\"\n\nHe worried, along with William Hague, about the possibility of English nationalism: \"As we move into this new century, people's sense of Englishness will become more articulated and that's partly because of the mirror that devolution provides us with and because we're becoming more European at the same time.\"\n\nForeign & Commonwealth Secretary (2001–2006)\n\nStraw appears at a press conference with United States Secretary of State, Condoleezza Rice Straw appears at a press conference with United States Secretary of State, Condoleezza Rice\n\nHe was instead appointed Foreign Secretary in 2001 to succeed Robin Cook. Within months, Straw was confronted by the 11 September attacks in the United States. He was initially seen as taking a back seat to Tony Blair in Her Majesty's Government's prosecution of the \"war against terrorism\". In late September 2001, he became the first senior British government minister to visit Iran since the 1979 Revolution.\n\nIn 2003 the governments of the USA and UK agreed a new Extradition Treaty between them, intended to speed up extradition of terrorist suspects. The provisions of the treaty were enacted in the Extradition Act 2003. The treaty later attracted controversy with opponents alleging it to be one-sided: a British request to the USA needed to provide a prima facie case against a suspect while a US request to Britain needed only to provide reasonable suspicion for an arrest. There have been a series of causes célèbres involving the treaty, including the NatWest Three who later pleaded guilty to fraud against the US parent company of their employers, and Gary McKinnon who admitted hacking US defence computers. An inquiry into extradition arrangements by retired Judge Sir Scott Baker reported in September 2011 that the treaty was not unbalanced and \"there is no practical difference between the information submitted to and from the United States\".\n\nIn a letter to The Independent in 2004, he claimed that Trotskyists \"can usually now be found in the City, appearing on quiz shows or ranting in certain national newspapers,\" and recommended \"Left-Wing\" Communism: An Infantile Disorder by Vladimir Lenin.\n\nIn the 2004 Equatorial Guinea coup d'état attempt, Jack Straw was personally informed months in advance of the plans for the takeover attempt and failed to accomplish the duty under international law of alerting the country's government. The involvement of British oil companies in the funding of the coup d'état, and the changing of British citizens evacuation plans for Equatorial Guinea before the attempt, posed serious challenges for the alleged ignorance of the situation. Later on, British officials and Jack Straw were forced to apologise to The Observer after categorically denying they had prior knowledge of the coup plot.\n\nIn the run up to the 2005 general election Straw faced a potential backlash from his Muslim constituents over the Iraq War – the Muslim Public Affairs Committee UK (MPAC) attempted to capitalise on anti-war sentiment with 'operation Muslim vote' in Blackburn. The swing to the second placed Conservatives was less than 2%, much lower than the national average; the Liberal Democrat's increase in vote share (+12.5%) surpassed Labour's loss (-12.1%) . Craig Murray, who had been withdrawn as the ambassador to Uzbekistan, stood against his former boss (Straw was then Foreign Secretary) on a platform opposing the use of information gathered under torture in the \"War on Terror\"; he received a 5% vote share. Straw was re-elected, and following his victory called MPAC an \"egregious group\", and criticised their tactics during the election.\n\nAt the 2005 Labour Conference, the then Foreign Secretary Jack Straw was heckled by Walter Wolfgang, a German Jew who had suffered persecution under the Nazis, and a prominent Labour Party member. At a point when Straw claimed his support for the invasion of Iraq was solely for the purpose of supporting the Iraqi government, 82-year-old Wolfgang was heard to shout \"Nonsense\", and was forcibly removed from the auditorium by several bouncers. The incident gained considerable publicity, with party chairman Ian McCartney initially supporting the right to remove hecklers by force. McCartney, PM Tony Blair and other senior Labour members later issued apologies; Wolfgang was later elected to the National Executive Committee of the Labour Party.\n\nOn 13 October 2005 Straw took questions from a public panel of individuals in a BBC Newsnight television special on the subject of Iraq, addressing widespread public concerns about the exit strategy for British troops, the Iraqi insurgency and, inevitably, the moral legitimacy of the war. On several occasions Straw reiterated his position that the decision to invade was in his opinion the right thing to do, but said he did not 'know' for certain that this was the case. He said he understood why public opinion on several matters might differ from his own—a Newsnight/ICM poll showed over 70% of respondents believed the war in Iraq to have increased the likelihood of terrorist attacks in Britain, but Straw said he could not agree based on the information presented to him.\n\nStraw meets with US Deputy Secretary of Defence Paul Wolfowitz and UK Ambassador to the US Christopher Meyer in 2001. Straw meets with US Deputy Secretary of Defence Paul Wolfowitz and UK Ambassador to the US Christopher Meyer in 2001.\n\nIn February 2006, Straw attracted publicity after he condemned the publication of cartoons picturing Mohammed in the Danish newspaper Jyllands-Posten.\n\nIn August 2006, it was claimed by William Rees-Mogg in The Times that there was evidence that Straw was removed from this post upon the request of the Bush administration, possibly owing to his expressed opposition to bombing Iran. This would be ironic, as Richard Ingrams in The Independent wondered whether Straw's predecessor as Foreign Secretary, Robin Cook, was also removed at Bush's request, allowing Straw to become Foreign Secretary in the first place. It has also been alleged that another factor in Straw's dismissal was the large number of Muslims amongst his Blackburn constituents, supposedly considered a cause for concern by the US. Some Iranian dissidents mocked Straw as \"Ayatollah Straw\" after his frequent visits to Tehran in the aftermath of the 11 September attacks.\n\nStraw gave evidence to the Iraq Inquiry on 21 January 2010, making him the second member of Tony Blair's cabinet to do so. He told the inquiry that the decision to go to war in Iraq had \"haunted him\" and that it was the \"most difficult decision\" of his life. He also said that he could have stopped the invasion, had he wanted to.\n\nRendition and torture allegations\n\nDespite repeated denials about his complicity in extraordinary rendition—he once dismissed the suggestion of UK involvement in the practice as a \"conspiracy theory\"—Straw had been dogged for years over his alleged leading role in it, with specific accusations about the case of Abdel Hakim Belhadj arising in April 2012. In October 2012, the Guardian reported on the filing of court papers, which alleged that MI6 alerted Muammar Gaddafi's intelligence services to the whereabouts of dissidents, co-operated in their rendition, sent officers and detailed questions to assist in their interrogation, and that Straw attempted to conceal this from MPs.\n\nLeader of the House of Commons (2006–2007)\n\nAfter the Labour Party suffered major defeats in local elections on 4 May 2006, losing 317 seats in balloting for 176 councils, Tony Blair acted the following day with a major reshuffle of his ministers during which he moved Straw from Foreign Secretary to Leader of the House of Commons and Lord Privy Seal. Straw had apparently requested a break from high ministerial office after serving in two of the four great departments of state for nearly ten years. To lessen the apparent demotion, Blair gave Straw responsibility for House of Lords reform and party funding, issues which had been part of the portfolio of the Department for Constitutional Affairs. In addition, Straw was given the chairmanship of the Constitutional Affairs cabinet committee where he was responsible for attempting to force through a flat-fee charge for Freedom of Information requests.\n\nOn 25 March 2007, Straw announced he was to run Gordon Brown's campaign for the Labour leadership. This was the first official confirmation the Chancellor would stand.\n\n2006 debate over veils\n\nIn October 2006 Straw attracted controversy by suggesting to a local newspaper, The Lancashire Evening Telegraph (now The Lancashire Telegraph), that Muslim women who wear veils that cover their faces (the niqab) can inhibit inter-community relations, though he denied the issue was raised for political gain, stating that he had raised it in private circles in the past and it had never progressed beyond discussions. Although he did not support a law banning a woman's right to choose to wear the veil, he would like them to abandon it altogether. Asked whether he would prefer veils to be abolished completely, Straw said: \"Yes. It needs to be made clear I am not talking about being prescriptive but with all the caveats, yes, I would rather.\" He said that he had asked women visiting his constituency surgeries to consider uncovering their noses and mouths in order to allow better communication. He claimed that no women had ever chosen to wear a full veil after this request.\n\nStraw's comments kicked off a wide-ranging and sometimes harshly worded debate within British politics and the media; Straw was supported by some establishment figures and castigated by others, including Muslim groups. There is an ongoing debate within the Muslim community whether the Qur'an and hadith (traditions of Muhammad) require the use of the full face veil. Jack Straw apologised for these comments regarding the veil on 26 April 2010 at a private hustings organised by Engage in the buildup to the United Kingdom General Election, 2010.\n\nLord Chancellor and Secretary of State for Justice (2007–2010)\n\nStraw canvassing with local councillors in Blackburn Straw canvassing with local councillors in Blackburn\n\nStraw was appointed Lord High Chancellor of Great Britain and Secretary of State for Justice on the first full day of Gordon Brown's ministry, 28 June 2007. He was the first Lord Chancellor since the sixteenth century to serve in the role whilst a member of the House of Commons. His appointment meant that he continued to be a major figure in the Labour Government. Only Straw, Brown and Alistair Darling served in the cabinet continuously during Labour's 13-year government from 1997 to 2010.\n\nIn February 2009, Straw used his authority as Justice Secretary to veto publication of government documents requested under the Freedom of Information Act: in particular, those pertaining to early government meetings held in the run-up to the Iraq war in 2003.\n\nStraw represented the government on a controversial edition of Question Time on 22 October 2009, against British National Party leader Nick Griffin on his first ever appearance. Griffin's first comment was to attack Straw's father's wartime record, to general disdain. As Griffin claimed that European laws prevented him from explaining his stance on holocaust denial Straw later offered his personal assurance as Justice Secretary, which Griffin declined.\n\nAlleged ambitions for premiership\n\nAndrew Thorpe-Apps, writing in the Backbencher, states that Straw knew he would be defeated by Gordon Brown in a leadership contest as Brown was 'consumed by this one ambition.'\n\nExpenses claims\n\nTwo months after learning that MP's expenses were to be made public, Straw wrote to the fees office to confirm that he had over-claimed on the Council Tax for his constituency home. He attributed this to an oversight – he had been entitled to a 'non-occupancy' discount of 50% for four consecutive years, but had continued to claim expenses for the full rate of Council Tax. Included with the letter was a cheque for the amount he believed he had overcharged, which itself turned out to have been miscalculated, leading Straw to send a further cheque with a note saying \"accountancy does not appear to be my strongest suit\".\n\nRetirement from front-bench politics (2010 - present)\n\nIn August 2010, Straw announced his plans to quit his role as Shadow Justice Secretary and move to the backbenches, citing the need for a ‘fresh start’ for the Labour Party under a new leader. Straw has since described Gordon Brown's leadership as a \"tragedy\".\n\nIn December 2010, ahead of the UK Alternative Vote Referendum 2011, Straw was a signatory to a letter to the Guardian arguing in favour of the alternative vote.\n\nIn January 2011, Straw provoked controversy with comments made on Newsnight about Pakistani men. He said \"there is a specific problem which involves Pakistani heritage men ... who target vulnerable young white girls.\" His comments came after two men of Pakistani origin were convicted of rape in Derby.\n\nIn April 2011, Straw was appointed as a consultant to E. D. & F. Man Holdings Ltd., a British company based in London specialising in the production and trading of commodities including sugar, molasses, animal feed, tropical oils, biofuels, coffee and financial services. Commenting on his appointment to ED&F Man on a salary of £30,000 per annum, Straw said, \"There are 168 hours in the week, and I will work in Blackburn for a least 60 and maybe sleep for 50. Providing there’s no conflict, I have long taken the view that I am not against people doing other things. I had two jobs as a minister. I think it's really important that politicians are involved with the outside world.\"\n\nIn late 2011, Straw was appointed to the role of visiting professor to University College London School of Public Policy. He later argued for the abolition of the European Parliament.\n\nAllegations of antisemitism\n\nIn 2013, at a round table event of the Global Diplomatic Forum at the UK's House of Commons, Jack Straw (who has Jewish heritage) was quoted by Israeli politician Einat Wilf, one of the panelists at the forum, as having said that among the main obstacles to peace was the amount of money available to Jewish organizations in the US, which controlled US foreign policy, and also Germany's \"obsession\" with defending Israel. Wilf stated: \"It was appalling to listen to Britain's former foreign secretary. His remarks reflect prejudice of the worst kind... I thought British diplomats, including former ones, were still capable of a measure of rational thought.\" Wilf said that she was shocked to hear Straw's comments and that she responded in the debate by stressing the role of the Palestinian and Arab refusal to accept Israel's legitimacy as a sovereign Jewish state.\n\nThe Zionist Federation of Great Britain and Ireland said that Jack Straw's comments \"echo some of the oldest and ugliest prejudices about 'Jewish power' and go far beyond mere criticism of Israel.\"\n\nSpeaking to The Jerusalem Post, Jack Straw strongly denied claims that his criticism was anti-Semitic. In a statement to The Times of Israel, Straw did not relate to whether he had said what Wilf alleged he said, but did say that there was no justification in any of his remarks for claims that he was being antisemitic. He pointed out that Wilf did not claim that he had embarked on an anti-Semitic diatribe, as had been claimed in many of the media reports. He wrote a statement to the Israeli newspaper Haaretz, which was described as follows:\n\nStraw wrote that he had voiced concerns at the seminar over Israel's \"settlement-building ... on Palestinian land (in East Jerusalem, and the Occupied Territories). This is illegal, as the British Foreign Secretary William Hague has observed and in those terms. I said that this amounted to 'theft' of Palestinians' land.\" In addition, he said that he advocated at the seminar \"a tougher stand on this (and on the related issue of goods exported from the Occupied Territories by Israelis) by the European Union.\" He said that he had pointed out in the past that one of the obstacles to a EU policy on this had been \"the attitude of Germany, who for understandable reasons have been reluctant to be out of line with the Government of Israel.\" Responding to the claim by Wilf that he referred to \"Jewish money\", Straw said that he had spoken at the seminar of the \"Israeli lobby\" and \"the problems which faced President Obama from AIPAC\" and spoke of the way AIPAC spends large sums of money supporting pro-Israeli candidates in American elections. No article covering the allegations has quoted Straw's supposed comments referring to \"Jewish money\".\n\nCash for Access\n\nIn February 2015, Straw was secretly recorded by journalists from The Daily Telegraph and Channel 4 News, who posed as representatives of a fictitious Chinese company that wanted to set up an advisory council. Straw was recorded describing how he operated \"under the radar\" and had used his influence to change EU rules on behalf of a firm which paid him £60,000 a year. Straw voluntarily withdrew from the Parliamentary Labour Party (but remained a member of the party itself) in February 2015 due to allegations from Channel 4 and the Daily Telegraph. Straw denied any wrongdoing or any breach of the parliamentary rules and voluntarily referred himself to the Commissioner on Parliamentary Standards and withdrew from the Parliamentary Labour Party pending the Commissioner's inquiry. He told the BBC, “[I have] acted with complete probity and integrity throughout my parliamentary career”. He was exonerated by the Commissioner in September 2015 after a detailed investigation. The Commissioner for Standards dismissed all allegations that he had brought the House of Commons into disrepute, saying that \"I have seen nothing which suggests that [Mr Straw's] conduct would have merited criticism if the approach made by PMR [a bogus company established by Channel 4] had been genuine.” She said that \"the evidence I have seen supports Mr Straw's assertions that he \"neither exaggerated nor boasted\" in what he said to the reporters.\" The Commissioner was sharply critical of Channel 4 and the Daily Telegraph, saying \"if in their coverage of this story, the reporters for [Channel 4] Dispatches, and the Daily Telegraph had accurately reported what was said by these two members [the other was Sir Malcolm Rifkind] in their interviews and measured their words against the rules of the House it would have been possible to avoid the damage that has been done to the lives of these two individuals and those around them and to the reputation of the House.\"\n\nPersonal life\n\nStraw's first marriage, in 1968, to teacher Anthea Weston, ended in divorce in 1977. They had a daughter, Rachel, born on 24 February 1976, who died after five days because of a heart defect.\n\nOn 10 November 1978, he married Alice Perkins, a senior civil servant. In 2006, Straw's wife joined the board of the country's largest airports operator BAA, shortly before it was taken over by the Spanish firm Ferrovial. The couple have two adult children, Will and Charlotte.\n\nStraw supports his local football club Blackburn Rovers, and was made an honorary vice president of them in 1998 by Jack Walker.\n\nStraw has suffered from depression and tinnitus.\n\nIn October 2015, he was given the Freedom of the Borough of Blackburn with Darwen."}, {"url": "https://www.gov.uk/government/people/jack-straw", "page_content": "Rt Hon Jack Straw was appointed in July 2015 as a Member of the Independent Commission on Freedom of Information. He was Foreign Secretary 2001 to 2006, Home Secretary 1997 to 2001, and Leader of the Commons 2006 to 2007 under Prime Minister Tony Blair. He was Lord Chancellor and Justice Secretary 2007 to 2010 under Prime Minister Gordon Brown. He served from 1979 to 2015 as Member of Parliament for Blackburn.\n\nAfter having been called to the Bar and practiced there, he worked as a Special Advisor. In the Commons Jack was appointed to the Front Bench in 1980 and in 1987 he he became the Opposition spokesman on Education, then on the Environment, and from 1994 to 1997 he was Shadow Home Secretary.\n\nAs Home Secretary Jack oversaw the introduction of the Freedom of Information Act and the incorporation of the European Convention on Human Rights into British law. As Foreign Secretary he played a leading role in the foreign policy problems arising from the 9/11 terrorist attacks in New York and the resulting interventions in Afghanistan and Iraq. He was also closely involved with many major European decisions such as the negotiation of the EU Budget deal in 2005.\n\nHe is a Visiting Professor at the University College London School of Public Policy and Vice President of Blackburn Rovers Football Club. He is a Governor of Blackburn College, and from May 2015 has been Chairman of the Blackburn Youth Zone. He is co-Chairman of the government-sponsored British-Turkish Forum, and the Tatlidil conference that takes place annually between the UK and Turkey. He was given the Order of the Republic of Turkey by President Abdullah Gül in 2012."}], "Tony Blair and Gordon Brown were the governments under which Jack Straw served in the Cabinet.": [{"url": "https://www.britannica.com/place/United-Kingdom/The-Tony-Blair-government-1997-2007", "page_content": "The Tony Blair government (1997–2007)\n\nThe struggle for control of Labour Tony Blair During its years out of power, the Labour Party had undergone a gradual transformation as it attempted to distance itself from the power of the unions on the one hand and the power of the membership on the other, in the guise of the traditional role of the Labour Party Conference. This process had been started before 1992 by Neil Kinnock, who led the party from 1983 to 1992, and it was continued by his successors, first John Smith and then Blair. The need for fundamental reappraisal had been urged as early as 1981, with the founding of the Social Democratic Party, when prominent Labour Party politicians, led by Roy Jenkins, seceded from the party in an attempt to “break the mould” of British politics. Divisions not only between the right and left in the party but also within the left of the party itself added to the chaos that was the British left in the 1980s; the insistence of the radical leftist and former Labour minister Tony Benn on running against the former Labour chancellor Denis Healey in the party election for deputy leadership in 1981 effectively split the radical democratic left and disabled the possibility of an early riposte to Thatcher. It also, ironically enough, contributed to what became known as “New Labour,” rather than a more left-wing variant of labourism eventually replacing the Conservatives.\n\nNew Labour, the repeal of Clause IV, and the “third way” The understanding that the party would have to rethink the market (not only in economic but in social terms), embracing it in a way foreign to many of the unions and the traditional Labour left, grew increasingly after 1992, until, after the Labour victory of 1997, there was a clearly marked path for New Labour. The most symbolically important marker of the change from old to New Labour was the repeal of the party’s Clause IV, engineered by Blair in 1995. The replacement of old Clause IV, which had committed the party to the “common ownership of the means of production,” ended almost 80 years of dedication to that goal. The new path of the party was to be a middle one, in the phraseology of New Labour, a “third way,” supposedly embracing both social justice and the market. Not only in rhetoric but in reality, New Labour was to be different from the old. There was also to be increasing attention to the importance of the media, an attention that the Tories had developed into something of a fine art under Thatcher, with her press secretary Bernard Ingham. Given the increasing role of the media in the presentation of politics and indeed the almost wholesale integration of political substance and political style through the media, this mastery of the art of “spin” was to become a political necessity. Therefore, art for art’s sake (spin for spin’s sake) was to become a feature of Labour government after 1997. This approach was ultimately to rebound upon the party and, indeed, upon the political process in general during the next decade with the emergence of widespread disillusionment with politics in British society, especially among young people.\n\nNavigating the European monetary system and the EU Social Chapter Labour’s landslide victory in 1997, which undoubtedly benefited from the inspirational leadership Blair seemed to offer, nevertheless may have been less the result of an unbounded belief in New Labour than of the discrediting of the Conservative Party. It is certain that Blair was helped into power by the parlous state into which the Conservative Party had fallen under Major after 1992. Promising that “we ran for office as New Labour, and we shall govern as New Labour,” the Blair government in fact began in a rather conservative fashion, by accepting existing government spending limitations. Nonetheless, the difficult and what came to be the increasingly troubled task of combining aspects of Thatcherism with the idea of a “social market” gathered momentum. Certainly, through much of Blair’s tenure a buoyant economy, well managed by Chancellor of the Exchequer Gordon Brown, did a great deal to ease the passage of New Labour and the third way. In his first major initiative and one of his boldest moves, Blair, abetted by Brown, granted the Bank of England the power to determine interest rate policy without government consultation. This was a major move in the disengagement of financial markets from the state. Blair’s government was also more and more taken up with the question of whether Britain should stay in or remain outside the European monetary union. At stake were fundamental ideas about British sovereignty and whether, in a progressively globalized world in which some claimed that the individual nation-state was becoming unviable, sovereignty in its existing forms could remain intact. For the Conservative Party, ever more hostile to the EU, this question was central to its attempts to fight back against the Labour Party. Blair’s government did sign the Treaty on European Union’s Social Chapter—which sought to harmonize European social policies on issues such as working conditions, equality in the workplace, and worker health and safety—despite Major’s earlier negotiation of an “opt out” mechanism to placate the treaty’s Conservative opponents. However, the Labour Party’s implementation of the Social Chapter was at best halfhearted, and its goal became to influence as much as possible the EU itself to moderate the operations of the chapter. As with financial deregulation, the emphasis in labour affairs was on the market.\n\nThe Good Friday Agreement Conspicuous progress was also made in solving the problem of Northern Ireland. Under Major, in 1994, the IRA declared a cease-fire, the Protestant paramilitaries followed suit soon after, and talks between the British government, the Irish government, and Sinn Féin began. The IRA cease-fire secured a long and involved series of negotiations, in which the Good Friday Agreement (Belfast Agreement) of 1998 seemed to have at last brought peace to Northern Ireland. Unionist suspicion and concern about fundamental reforms to the traditional power structure of the province meant, however, that the implementation of the agreement became a tortuous business. Indeed, it took almost another decade to arrive at what looked like a final resolution, when in 2007 the Northern Ireland Assembly was restored on the basis of power sharing between what had erstwhile been bitter enemies, Sinn Féin and the Ian Paisley-led Democratic Unionist Party.\n\nLondon’s local government, House of Lords reform, and devolution for Scotland and Wales In May 1998 voters in London overwhelmingly approved the government’s plan for a new assembly for the city and for its first directly elected mayor, resulting in the capital’s first citywide government since the abolition of the Greater London Council by Thatcher in 1986. However, the precedent of an elected mayor in London was not subsequently followed by similar action in other major British cities. In the late 1990s the Labour government also carried out several other constitutional reforms. The House of Lords, previously dominated by hereditary peers (nobles), was reconstituted as an assembly composed primarily of appointive life peers, with only limited representation of hereditary peers. Nonetheless, the striking contradiction of an unelected legislative assembly in a country that prided itself on its traditions of liberal democracy was apparent. Following referenda in Wales and Scotland, the National Assembly for Wales and the Scottish Parliament were established in 1999 and granted powers previously reserved for the central government. Yet, with the exception of political devolution to the component states of the United Kingdom, the Labour Party remained reluctant to reform the constitution, so that at the beginning of the 21st century it was still the revered mysteries of the uncodified British constitution by which the British were governed.\n\nThe royal family’s “annus horribilis,” the death of Princess Diana, and the Millennium Dome The 1990s were a period of transition and controversy for the monarchy. In 1992, during what Queen Elizabeth II referred to as the royal family’s “annus horribilis,” Charles, prince of Wales, heir to the British throne, and his wife, Diana, princess of Wales, separated, as did Elizabeth’s son Andrew, duke of York, and his wife, Sarah, duchess of York. Moreover, Elizabeth’s daughter, Anne, divorced, and a fire gutted the royal residence of Windsor Castle. After details of extramarital affairs by Charles and Diana surfaced and the couple divorced, observers openly questioned Charles’s fitness to succeed his mother as sovereign, and public support for the monarchy ebbed. The immensely popular Diana (dubbed the “People’s Princess”) died in an automobile accident in Paris in 1997, prompting an outpouring of grief, or at least hysteria, throughout the world. The British royal family came under scrutiny for its handling of the matter—especially the queen’s reluctance, because of tradition, to allow the national flag to fly at half-staff over Buckingham Palace. With the queen celebrating her 50th wedding anniversary, the queen mother, Elizabeth, celebrating her 100th birthday, and Charles working hard to improve his public image, the fortunes of the monarchy improved by the end of the 1990s. Nevertheless, the established institutions of the British state had been called into question in an unprecedented way. If the popularity of the monarchy survived, it was largely the result of the queen’s persona; the royal family as a whole—itself the idealized media creation of late Victorian times—frequently had become the object of ridicule. The transformation of the monarchy was indeed emblematic of the very unevenly progressing severance of the British from the long-lived institutions and culture of the 19th century. To celebrate the new millennium, the monumental Millennium Dome, the largest structure of its kind in the world, and the Millennium Bridge were opened in London. It was perhaps symbolic of the contradictions of this modernity that the dome was dogged by controversy regarding its cost and design and the bridge by the fiasco of its opening, when it was found to move alarmingly above the waters of the Thames when in public use.\n\nThe battle for the soul of the Conservative Party In June 2001 Blair’s government was reelected with a 167-seat majority in the House of Commons—the largest majority ever won by a second-term British government. With the question of European integration continuing to be of great significance in British politics, the new Labour administration chose not to adopt the common European currency, the euro, partly because of a fear of popular response. However, it was on the Conservative side that Britain’s relationship with Europe was most urgently a party issue. It continued to divide a party riven by differences, a party that looked more and more like the Labour Party of the 1980s and early ’90s. Indeed, there is a direct parallel between the recent histories of the two parties: the traditional left of the Labour Party corresponded to the traditional right of the Conservative Party, as both fought hard to stem the tide of party modernization. The battle for the soul of the Conservative Party was joined with growing fervour with the election of David Cameron in December 2005 as its modernizing leader. His subsequent attempt to steer the party back to the political centre, and away from the old order of the Thatcherite legacy, was every bit as difficult as the redirection undertaken by Labour modernizers. In addition to Europe and economic policy, the issue of increased levels of immigration into Britain after 2000 further divided the Conservatives. Indeed, Britain as a whole became divided on this issue. Large bodies of opinion, stirred up by xenophobia in the popular press, responded with fear and anxiety to increased levels of immigration from central and eastern Europe that were a consequence of European integration. In a more globalized and war-ridden world, the burgeoning flow of asylum seekers into Britain added to this climate, as did the “war on terror.” Asian Muslims, many of them long-standing British citizens and British-born, were nonetheless frequently lumped with immigrants and asylum seekers as part of an undifferentiated external threat to Britishness.\n\nResponse to the September 11 attacks Following the September 11 attacks on the United States in 2001, global terrorism dominated the political agenda in Britain, and Blair closely allied himself with the administration of U.S. Pres. George W. Bush. Britain contributed troops to the military effort to oust Afghanistan’s Taliban regime, which was charged with harbouring Osama bin Laden, who had founded al-Qaeda, the terrorist organization linked to the September 11 attacks. Although Blair received strong support for his antiterrorist strategy from the Conservatives and Liberal Democrats in the House of Commons, a small minority of Labour members of Parliament opposed military action. The Blair government also faced a slowing economy and a widespread perception that public services such as health, education, and transportation had not improved. Although large amounts of public money had been spent, particularly on the health service, much of this went into elaborating the new and highly evolved structures of management that came to characterize Labour administration of the state. However, it was the subject of the Iraq War, and Britain’s support for the U.S. position on it, that did most to undermine the standing of Blair."}, {"url": "https://www.theguardian.com/politics/2013/sep/19/tony-blair-gordon-brown-timeline", "page_content": "1983\n\nBlair and Brown are both elected to parliament as MPs. The two share an office at Westminster.\n\n1992\n\nBrown is appointed shadow chancellor while Blair becomes shadow home secretary.\n\n1994\n\nAfter the death of John Smith, Blair is elected Labour leader. Brown agrees not to stand, in exchange for formidable autonomy as shadow chancellor. The deal is sealed at a meal at Granita restaurant in Islington.\n\n1997\n\nBlair becomes prime minister.\n\n1998\n\nAn anonymous Blair aide is reported to have referred to Brown as \"psychologically flawed\" following the publication of a biography of Brown which contained criticisms of Blair and Peter Mandelson.\n\n2003\n\nBrown gives a tub-thumping speech to the Labour conference amid speculation whether there was a deal over the leadership.\n\n2004\n\nThe deputy prime minister, John Prescott, gives an interview to the Times in which he confirms there has been a \"pretty serious breakdown in relations\" between Blair and Brown in the past. Prescott is widely credited with calling a truce between the two in 2003.\n\n2005\n\nJanuary: Blair, recovering from a recurrence of a heart problem, says he will serve a \"full third term\" before he steps down. Brown is said to be infuriated.\n\nMay: Labour wins its third consecutive election under Blair, but with its majority reduced to 66 seats.\n\n2006\n\nSeptember: tensions escalate after Blair gives an interview to the Times in which he shows a willingness to continue without a fixed departure date. Rebel MPs write a letter calling on him to quit and several junior ministers leave in protest. Blair's team rally support from loyalist MPs but after meetings with Brown, Blair says at a school visit that he will step down within a year.\n\nNovember: in the Commons Blair is perceived to be giving support to Brown when he tells David Cameron he can \"dance around\" but will be hit by a \"big clunking fist\".\n\n2007\n\nMay: Blair announces he will step down as prime minister on 27 June.\n\n27 June: Brown enters 10 Downing Street as prime minister, quoting his school motto: \"I will try my utmost.\"\n\n2010\n\n6 May: the general election results in a hung parliament.\n\n11 May: Brown resigns as PM."}, {"url": "https://www.dailyrecord.co.uk/news/politics/tony-blairs-first-1997-labour-24642594", "page_content": "We have more newsletters\n\nSomething went wrong, please try again later.\n\nInvalid email Something went wrong, please try again later.\n\nGet the latest Scottish politics news sent straight to your inbox with our daily newsletter\n\nTony Blair's emphatic election victory in 1997 heralded in a new era in British politics and many new faces as well.\n\nThe Labour leader defeated Tory Prime Minister John Major by winning 418 seats in the House of Commons after securing 145 more MPs than in the 1992 General Election.\n\nMany of the 24 members were not known outside the so-called 'Westminster bubble', however some soon became household names across the United Kingdom.\n\nBlair was the youngest Prime Minister in the twentieth century and the youngest since Lord Liverpool in 1812.\n\nHe promised to breathe new life into politics and attempt to restore trust at the same time.\n\n(Image: AFP via Getty Images)\n\nSo, what has happened to the people who sat in Blair's first cabinet in 1997:\n\nTony Blair - Prime Minister\n\nNo better place to start than the man in charge of the Cabinet.\n\nTony Blair stepped down as Prime Minister in 2007 which allowed Gordon Brown to take over in the lead up to the general election in 2010.\n\nAfter leaving office Blair was confirmed as the Middle East envoy for the UN, EU, US and Russia. He remained in that post until 2015.\n\nA year later he created the Tony Blair Institute which aims to promote global outlooks by governments and organisations.\n\n(Image: AFP via Getty Images)\n\nBlair has appeared a number of times during the covid pandemic to speak about getting as many people across the world vaccinated.\n\nHe also criticised Boris Johnson over his decision to cut international bid by 0.2 per cent from 0.7 to 0.5 per cent.\n\nJohn Prescott - Deputy Prime Minister/Environment, Transport and Regions secretary\n\nJohn Prescott served as the MP for Kingston upon Hull East from 1970 to 2010 when he retired from the House of Commons.\n\nAfter leaving the Commons he entered the House of Lords as a life peer.\n\nThe Welsh-born politician now goes by the name of Baron Prescott of Kingston-upon-Hull.\n\n(Image: Getty Images)\n\nIn 2012 he failed to be elected the Police and Crime Commissioner for Humberside Police, he lost out to a Tory.\n\nAfter a stint as adviser to Ed Miliband in 2015 he headed back to the Lords.\n\nGordon Brown - Chancellor\n\nGordon Brown succeed Tony Blair as Prime Minister in 2007 and remained in post until 2010 when the Tories, under David Cameron, won the most seats.\n\nThe Scot remained in parliament until he stepped down in 2015, however he played a prominent role in the Scottish Independence referendum in 2014.\n\n(Image: PA)\n\nIn 2019, Brown set up the campaign group 'Our Scottish Future' which aims to keep the Union together.\n\nHe recently published the book 'Seven Ways to Change the World'. Brown also appeared on stage to back Scottish Labour leader Anas Sarwar during the election earlier this year.\n\nClare Short - International Development Secretary\n\nLike John Prescott, Clare Short stepped down from the Commons in 2010.\n\nShe served as the MP for Birmingham Ladywood from 1983.\n\nThe 75-year-old was criticised in 2019 when she dismissed allegations the Labour party has a problem with 'Jew-hate'.\n\nSince then she has written a number of articles about the Labour party.\n\nMo Mowlam - Northern Ireland Secretary\n\nThe Watford-born MP held a couple of roles in Tony Blair's cabinet over the years.\n\nShe was the Northern Ireland secretary when the historic Good Friday Agreement was signed back in 1998.\n\nMowlam retired from politics in 2001 after announcing her decision a year earlier.\n\n(Image: PA)\n\nSadly she passed away on August 19, 2005 after she was moved from to Pilgrims Hospice in Kent a week earlier.\n\nIt was announced in 2010 a brain tumour she was first diagnosed with in 1997 was the cause of her death.\n\nChris Smith - Culture Secretary\n\nBritain's first openly gay Cabinet minister had a troubled time as Culture Secretary due to a lack of money. He eventually left the Cabinet in 2001.\n\nIn 2005, he announced that he would be stepping down at the general election. He also revealed in the same year that he was HIV positive.\n\nSince leaving the Commons he has become a life peer in the House of Lords.\n\nLord Smith of Finsbury now campaigns for LGBTQ+ rights in the UK and across the world.\n\nFrank Dobson - Health Secretary\n\nDobson was the Health Secretary for the first two years of Tony Blair's time in government.\n\nIn 2000, he was Labour's candidate to be London Mayor however he finished behind the Tory candidate and winner Ken Livingstone who was an independent politician at the time.\n\nDobson stepped down from the Commons at the 2015 General Election.\n\n(Image: PA)\n\nHe sadly passed away in 2019 at the age of 79. Tributes were paid to the former health secretary from across the political divide.\n\nCurrent Mayor Sadiq Khan said he was a \"hero of the London Labour movement\".\n\nAnn Taylor - Commons Leader\n\nAnn Taylor was the member of parliament for Dewsbury from 1987 to 2005 when she decided to step down from parliament.\n\nDuring Labour's time in office from 1997 to 2010 she held a number of ministerial roles, including being the Minister of State for International Defence and Security.\n\nIn 2005 she was given a life peerage and now goes by the name of Baroness Taylor of Bolton.\n\nHarriet Harman - Social Security Secretary\n\nThe 70-year-old held a number of roles in government throughout the time Labour under Blair and then Brown were in office.\n\nA high profile name in the Labour movement Harman is still an MP to this day.\n\n(Image: Handout)\n\nShe has represented the Camberwell and Peckham constituency since 1982.\n\nRon Davies - Wales Secretary\n\nRon Davies served as Welsh secretary in Tony Blair's government for over a year. He was in post from May 2, 1997 to October 27, 1998.\n\nHe was elected into the Welsh Assembly in May 1999 and two years later stepped away from the UK parliament in 2001.\n\nHis relationship with the Labour Party came to an end in 2004 when he resigned over his opposition to the Iraq War.\n\n(Image: Mirrorpix)\n\nSince leaving Labour Davies has stood for election for nationalist party Plaid Cymru, however he has been failed to be elected.\n\nLord Ivor Richard - Leader of Lords\n\nLord Richard had a long and distinguished career in politics before his death in March 2018 at the age of 85.\n\nDuring his time in Tony Blair's Cabinet he failed in his attempts to introduce election for part membership of the Lords.\n\nAfter failing to persuade Blair he was sacked after just 14 months in post.\n\nFollowing his sacking he was invited to chair a commission on the future powers of the Welsh Assembly.\n\nThe report was published in March 2004.\n\nGavin Strang - Transport Secretary\n\nThe Scottish politician was a member of the House of Commons from 1970 to 2010 when he retired.\n\nBy the time of his retirement from politics he was the longest serving Scottish MP.\n\nDuring his career he served as a minister in Harold Wilson and James Callaghan's governments.\n\n(Image: Twitter)\n\nHis last appearance in public was in 2018 when he was snapped with then Scottish Labour leader Richard Leonard.\n\nSir Robin Butler - Cabinet Secretary\n\nSir Robin Butler had a long career in the civil service.\n\nDuring his time at the heart of Westminster he was the Private Secretary to Edward Heath and Harold Wilson.\n\nHe was the Principal Private Secretary to Margaret Thatcher.\n\n(Image: UGC)\n\nHe was also the Cabinet Secretary to Thatcher and John Major.\n\nFollowing his retirement he took up a post as a cross-bench peer in the House of Lords.\n\nMargaret Beckett - Trade and Industry Secretary\n\nAfter her role in the Trade and Industry department in Tony Blair's government she was promoted to be the Foreign Secretary in 2006. She was the first woman to hold the role.\n\nWhen Gordon Brown replaced Blair she told him she wouldn't carry on in the Foreign Secretary role. She was replaced by David Milliband.\n\n(Image: Derby Telegraph)\n\nIn 2015 she nominated Jeremy Corbyn during the Labour leadership election.\n\nThe 78-year-old is still the member of parliament for Derby South.\n\nJack Straw - Home Secretary\n\nStraw remained as the Home Secretary in Blair's government till 2001 when he was moved to the Foreign Office.\n\nHe replaced Robin Cook in 2001 just months before the terrorist attacks on September 11.\n\nThe 74-year-old remained as Foreign Secretary till 2006. During the Iraq Inquiry he said the invasion by British troops \"haunted him\".\n\n(Image: Corbis via Getty Images)\n\nHe stepped down from frontline politics in 2010 following the election that year.\n\nIn 2015, he was given the Freedom of the Borough of his hometown Blackburn with Darwen.\n\nRobin Cook - Foreign Secretary\n\nThe Belshill born MP served as Foreign Secretary from 1997 to 2001. After the 2001 General Election he was moved department and took up the role of the Leader of the House of Commons.\n\nHe served in the role for two years when he famously quit government over his opposition to the British and American invasion of Saddam Hussein's Iraq.\n\nIn his statement, he said: \"I can't accept collective responsibility for the decision to commit Britain now to military action in Iraq without international agreement or domestic support.\"\n\n(Image: Press Association)\n\nCook held his Livingston seat in the 2005 General Election, however he died just months later of a heart disease.\n\nDavid Blunkett - Education Secretary\n\nDuring Labour's time in government from 1997 to 2010 Blunkett held a number of ministerial roles including Work and Pensions Secretary.\n\nHe decided to step down from the House of Commons in 2015, by then he had been the MP for Sheffield Brightside and Hillsborough for 28 years.\n\nThe 74-year-old now sits in the House of Lords.\n\nHe still appears on political shows to speak out against the Tory government.\n\nJack Cunningham - Agriculture Minister\n\nJack Cunningham was a Labour member of parliament for more than 30 years.\n\nHe represented the Whitehaven seat from 1970 to 1983, then from 1983 to 2005 he served the people of Copeland.\n\nCunningham was moved from the Agriculture brief in 1998. He took up the Duchy of Lancaster role on July 27, 1998 till October 1999.\n\nSign up to our Politics newsletter Get all the top Scottish politics news sent straight to your Inbox by signing up to our Politics newsletter. We cover Holyrood, Westminster and local councils, with a current focus on how our governments are handling the coronavirus pandemic. To sign up, simply enter your email address into the pink box near the top of this article. Alternatively, you can visit our newsletter sign up-centre. Once you are there, enter your email address and select Politics and any other Daily Record newsletters that are of interest.\n\nThe 81-year-old stepped down from the Commons in 2005, however took up a seat in the Lords the same year.\n\nIn 2017-18 he claimed over £75k for 154 days of attendance in the Lords.\n\nIt was the largest claim for attendance and travel expenses of any sitting member.\n\nGeorge Robertson - Defence Secretary\n\nThe Scot, born in Port Ellen, served as the MP for Hamilton from 1978 to 1997, then for Hamilton South from 1997 to 1999.\n\nIn 1999, he was appointed as the 10th Secretary General of Nato. He succeeded Javier Solana.\n\nRobertson was given a life peerage, he is now know as Baron Robertson of Port Ellen.\n\nHe made a number of interventions during the Scottish Independence referendum in 2014.\n\nDuring the campaign he wrote for the Washington post saying: \"The residual United Kingdom would still be a major player in the world, but upon losing a third of its land mass, 5 million of its population and a huge amount of credibility, its global standing would inevitably diminish.\"\n\nLord Irvine of Lairg - Lord High Chancellor\n\nInverness born Andrew Irvine held the role of Lord High Chancellor for six years in Tony Blair's government from 1997 to 2003.\n\nHe was replaced by Lord Falconer.\n\n(Image: PA)\n\nThe Lord was appointed to the Sub-Committee on Lords' Conduct where he remains today.\n\nNick Brown - Chief Whip\n\nBrown has been the member of parliament for Newcastle-upon-Tyne East since 1983. He is currently the fifth longest serving MP in the House of Commons.\n\nUnder Tony Blair he served as his chief whip from 1997 to 1998. When Gordon Brown took office he made Brown the Minister for the North East from 2007 to 2010.\n\n(Image: newcastle chronicle)\n\nFollowing the 2010 General Election he was made the opposition chief whip. He remained in position till May this year when Keir Starmer replaced him.\n\nHe was replaced by Sir Alan Campbell.\n\nAlistair Darling - Chief Treasury Secretary\n\nAlistair Darling held a number of roles while Labour were in power from 1997 to 2010, including Secretary of State for Scotland from 2003 to 2006.\n\nHe was appointed the Chancellor in May 2010 and held the role for a number of months until October 2010.\n\n(Image: Daily Record)\n\nDarling played a huge role during the Scottish Independence referendum when he led the Better Together group in 2014.\n\nHe decided to step down from parliament in 2015. The SNP's Joanna Cherry replaced Darling in Edinburgh South West.\n\nDavid Clark - Duchy of Lancaster\n\nClark who was born in Castle Douglas in Scotland served as the Duchy of Lancaster for a year until 1998.\n\nIn 2001 he was replaced as the Labour candidate for the South Shields constituency by David Miliband who went on to become the Foreign Secretary.\n\nFollowing the election he was made a life peer.\n\nLord Clark of Windermere is a director of Carlisle United football club and Professor in History and Politics at the University of Huddersfield."}, {"url": "https://www.independent.co.uk/voices/tony-blair-years-gordon-brown-new-labour-nick-macpherson-a-view-from-the-treasury-a7579561.html", "page_content": "Sign up for the View from Westminster email for expert analysis straight to your inbox Get our free View from Westminster email Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nView from Westminster email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\n\nNick Macpherson, who was the Permanent Secretary to the Treasury 2005-16, came to speak yesterday to the “Blair Years” class of MA students, which Jon Davis and I teach at King’s College, London. He started by saying: “If you want to understand the destruction of the Labour Party, all the seeds were sown during this period.”\n\nHe was private secretary to Kenneth Clarke, the Chancellor, when Labour came to government in 1997. “Ken Clarke is only 10 or 11 years older than Gordon Brown but you only have to read his autobiography to realise he grew up in a different time.” If you phone Clarke’s mobile, said Macpherson, you get a message saying he doesn’t listen to his messages and asking you to try his secretary on a landline. His working methods were already out of date. John Major as Prime Minister insisted that his Chancellor ought to be contactable, but while Clarke was driving his “boy racer” Ford Escort from his Nottinghamshire constituency to London, puffing on a cigar and listening to his jazz CDs, he could not be reached and it was Macpherson’s job to fend off No 10.\n\nBrown was completely different in his working style. “He believed that if you worked harder it would solve all problems.” Lord Macpherson, a visiting professor at King’s, said: “There’s an element of the tortured genius about him. He’d come into politics to make a difference. He was remarkably uninterested in the trappings of power; he had a driving sense of purpose, and sometimes to get on in politics you have to use means that are unattractive.”\n\nHe and Tony Blair had one overriding economic objective. All Labour governments had ended in economic crises. The first one in 1924 lasted only 10 months, but the 1929 government ended in the Depression with Britain coming off the gold standard and a split in the Labour Party. The Attlee government of 1945 devalued the pound in 1949 and failed to regain sufficient trust on the economy. The 1964 Wilson government devalued again in 1967, and the 1974 government ended up going cap in hand to the International Monetary Fund. “There was a determination that this time it was going to be different,” said Macpherson. Hence independence for the Bank of England and sticking to Clarke’s tight spending plans for the first two years.\n\nRecommended George Osborne on the power of politics for good\n\nFor a long time, Labour’s economic record was different. Macpherson said the changes to the Bank of England – the power to set interest rates given up by the Chancellor and handed to an independent Monetary Policy Committee – were not agreed by the incoming Cabinet. Indeed Brown was filmed by a Scottish TV documentary crew informing other cabinet ministers of a decision that he and Blair had already taken.\n\n“David Cameron and George Osborne were determined to carry on – although they had a coalition to manage which was more complicated – from where Blair and Brown left off,” said Macpherson. When Clarke returned to Cabinet in 2010 he was surprised by the contrast with how it had worked under Major before 1997: decisions were made by Cameron and Osborne (with Nick Clegg and Danny Alexander in the “Quad”) with much less discussion in whole cabinet.\n\nIn answer to questions from students, Macpherson described Universal Credit as “a development of tax credits that we would have liked to do in the late 1990s but which the technology wouldn’t allow us to do”. Brown, influenced by Bill Clinton’s Earned Income Tax Credit in the US, “used the existing system, changed the name and threw money at the problem”. Implementation of tax credits in 2003 should have been delayed by a year to allow problems to be ironed out, he said, but “they did have a big effect, which is why the Tories didn’t dump them”. They were more efficient than raising the national minimum wage or the income tax personal allowance, and were part of a 40-year process of making the UK labour market more efficient in keeping unemployment low. But there is a cost. “One reason why everyone is unhappy is that real wages adjust far more quickly”, which is why living standards for those in work fell during the recession.\n\n“Blair and Brown were the first Labour leaders who genuinely believed in markets.” Macpherson had thought they might revert to Old Labour thinking once in office, but they were neo-Clintonites, believing that markets would produce the tax revenue to pay for public spending. “By 2000 they both decided that something had to be done about the NHS, and they did a good strategic job of creating a consensus for a tax increase.” The 2002 Budget raised National Insurance contributions to pay for increased NHS spending.\n\nMacpherson had heard one of Brown’s jokes many times: “There are two kinds of chancellor – those who fail and those who get out in time.” He said: “Blair got out in time. It is now 10 years ago and it is beginning to feel like another world. This was a good time. The nation was at ease with itself. It felt liberal, with a Prime Minister who was good communicator and Gordon Brown was a good Chancellor.”\n\nHe concluded by commenting that he didn’t think the Labour Party would recover until it came to terms with the successes of the Blair years, and understood the forces in society that Blair represented."}, {"url": "https://www.opendemocracy.net/en/tony_blair_and_europejsp/", "page_content": "Among the pro-European majority that lives on the other side of the Channel, Tony Blair is regarded with envy and disappointment. Envy because in spite of everything he is still seen as the most talented and charismatic of European leaders of his time. Like many notable leaders at the end of their term he is more admired abroad than at home. Disappointment because they had hoped for more from the most pro-European British leader anyone will see for some time. And yet both Britain and Europe are different because of Blair, and, in spite of the disappointment, both are the better for him.\n\nThe incoming Labour government in 1997 was more European in its outlook than its predecessor. That is no surprise: most new governments arrive determined not to make the mess of Europe their predecessors did. Foreign ministers applauded spontaneously when Lord Carrington set out the new Conservative government's approach in 1979. John Major meant it when he said that he wanted Britain to be at the heart of Europe. But by that time his government was tired and his party divided.\n\nTony Blair arrived strong and with a modernising agenda that seemed to put Europe at the heart of Britain as much as the other way round. He was the first prime minister from the post-war generation; his memories were not of defending Britain against evil Germans and feckless French. New Labour was built on respect for German social policy and French economic success. He spoke French well and had already established some good relationships on the continent, notably with Helmut Kohl. A positive approach to Europe was part of his party's platform.\n\nSimon Berlaymont is a pseudonym. The writer has extensive professional knowledge of the inner workings of the European Union. Also by Simon Berlaymont in openDemocracy: \"What the European Union is\" (23 June 2005)\n\nA benign rupture\n\nWhere did it go wrong? Well, in the first place it didn't all go wrong. Blair leaves behind him one lasting landmark in Europe and many useful achievements.\n\nThe latter include a couple of treaty negotiations, Amsterdam and Nice, without the turmoil and angst that had always gone with such occasions in the past - not much of an achievement for anyone else, but for Britain something new.\n\n\n\nAt Amsterdam it was notable that, rather than fight every comma - the Thatcher/Major practice - Blair was tough on the few issues that mattered, and made deals on the secondary points, behaving, that is, much as other countries do. In passing he dropped the United Kingdom's opt-out from the social chapter, a useful step in the normalisation of the British position in Europe (and one which seems to have passed without any of the terrible results forecast by the Conservative Party).\n\nThe summit which finalised the Nice treaty is still remembered as one of the most awful summits of all time, but none of the complaints relate to the British position. It was the awfulness of Nice in fact that persuaded Blair that European institutions needed to be reformed - hence his later espousal of the idea of a permanent chair for the European council.\n\nThis also marks Blair off from his predecessors. The normal British approach is to say that there is no need to interfere with European institutions: we should concentrate instead on getting the policy right, reforming the Common Agricultural Policy (CAP) and the like, and let the institutions look after themselves. This has served Britain badly. It fails to recognise that European institutions do need reform: to adjust to enlargement, to reflect the evolution of the union and new priorities - such as crime and terrorism. In the minds of most of its members the EU is a project which remains unfinished and needs to develop further. Prime ministers who do not see this and go into treaty revision negotiations with a purely defensive agenda not only miss the opportunity to shape Europe but give an image of Britain as a grumpy and negative member of the union. At the very least Blair's approach to treaty revision - aided perhaps by the fact that he and Gordon Brown were in the process of revising the UK's constitution at the same time - made him seem more like a normal European.\n\nA litany of progress\n\nA second achievement, big in some ways, small in others, was \"the Lisbon agenda\". This might be portrayed as Euro-Blairism: putting at the centre of the European agenda the need to reconcile social protection with a dynamic, market-driven economy. This again was an admirable example of Blair behaving as one of his more influential colleagues might have done, using Europe to push his domestic programme. The method by which he tackled this was exemplary: hardly a single colleague was omitted from a series of bilateral summits accompanied by joint initiatives, articles, letters, statements. Everyone was bound in, above all Gerhard Schrőder who briefly espoused the Neue Mitte as a German version of the Third Way.\n\nThe theme was intelligent, the tactics well executed; the trouble is that little was achieved. The European Union has set itself a series of pompous goals - making Europe the most competitive economy in the world by 2010 - but there is no evidence of significant changes in any county's domestic policies as a result. The whole process (which still goes on) became bureaucratised and rather sovietesque in its setting of targets and quotas, and also in its results. This contrasts for example with the transformative impact of monetary union and the single market.\n\nWe might note in passing meanwhile that a radical reform of the CAP has taken place - in which UK pressure over the years has played a part (where have the beef- and butter-mountains gone?) But if you listen to the speeches of UK ministers, including sometimes the prime minister, no one seems to have noticed. Strange: they ought to be hailing it as a triumph for British policy.\n\nThe most important collective achievement of the EU during the Blair years has been enlargement. If anything is remembered in European history it is likely to be the EU's achievement in stabilising central and eastern Europe after the end of communism. That Britain played a leading part in this goes without saying: British politicians have always been in favour of enlargement, some with the (mistaken) hope that of a larger and looser union, some to relativise Franco-German dominance, some because it was the only thing they could find to be positive about in Europe. In the case of Blair there is no need to attribute negative motives; in this and in Nato enlargement he was motivated by a strategic vision. Britain played a leading part, as did Germany.\n\nAlso on the legacy of Tony Blair in openDemocracy:\n\nRoger Scruton, \"Tony Blair's genius\"(18 December 2006)\n\nNorman Fairclough, \"Tony Blair and the language of politics\"(20 December 2006)\n\nFelix Blake, \"Blair's foreign-policy legacy\"(21 December 2006)\n\nBrian Brivati, \"The Blair audit: war, human rights, liberalism\"(8 January 2007)\n\nTina Beattie, \"Religion in Britain in the Blair era\" (10 January 2007)\n\nTony Curzon Price, \"Tony Blair and centralisation\"(20 February 2007)\n\nGodfrey Hodgson, \"London and Washington: Tony Blair's special relationship\"(5 March 2007)\n\nMore exceptional is the case of Turkey. Here Britain had a special role in relaunching the idea of Turkish accession (at the Helsinki summit of December 1999), then in keeping it alive, and finally in getting the negotiations started. In the last of these it was the personal stubbornness of Jack Straw that finally won the day.\n\nThis was one of the important results of the second UK presidency under Blair. Another was the budget settlement. Some in Europe would probably say that this hardly counts as an achievement since it was the UK that created the obstacle to a deal which it than removed, enabling a settlement. This satisfies the natural preference for blaming others - and the British have been willing victims - but it does not reflect a much more interesting reality.\n\nOne part of this is the incendiary nature of European budgetary matters in UK domestic politics. The sensible compromise which Blair proposed, almost certainly against the advice of the chancellor/treasury, leaves both Europe and the UK in good shape. The skilful diplomatic operation that brought the solution about was secretly admired by the Brussels professionals. This was then backed by a bravura Blair presentation in the European parliament in which he argued that the British rebate was the other side of the coin for the way in which the CAP dominated EU spending. The parliament applauded him as enthusiastically as they had earlier when Jean-Claude Juncker attacked him. But it was Blair who solved the problem. It would be nice if, in the UK, this might have laid to rest the idea, stemming from Margaret Thatcher's iconic struggles, that compromise on budgetary matters is always wrong. It is also worth remarking that here as in other areas Blair was part of a pro-European minority in the cabinet (his most solidly pro-European supporters - Peter Mandelson, Charles Clarke and Robin Cook were all gone by then).\n\nThe UK presidency was also notable for the useful special summit at Hampton Court, which put energy on the European agenda, at the level where it belongs. The fruits of this will not be apparent for some time to come - energy as well as Europe is a long-term business - but the rewriting of UK energy policy in European terms may (we should hope) be an important part of the Blair legacy.\n\nA new road\n\nThe most important bequest is already visible, though like much else remains incomplete. (It is in the nature of things that big changes take time). This is the possibility of a real foreign and security policy for Europe, effectively launched by Blair and Chirac at St Malo in their September 1998 summit. Without a security dimension - the ability to deploy forces - and without the machinery that the deployment of forces requires, namely a standing committee for political consultation, there is no foreign policy.\n\nThis was one lesson of Europe's failures in the Balkans in the early 1990s. At that moment Europe found itself facing a security crisis too near to home - both geographically and emotionally - to ignore. Nato was unavailable because the United States was not interested. \"We don't have a dog in that fight\", then secretary of state James A Baker was reported to have said. It is also questionable whether Nato would have been able to bring together the political and economic pressures and incentives that were required, in addition to the military. The EU however had no way of deploying military force itself, nor of engaging seriously in political business: monthly meeting of senior officials from capitals are not capable of handling crises.\n\nThe Blair/Chirac proposals at St Malo were not just about giving the European Union a rapid-reaction force. They opened the possibility of the EU becoming a real political actor in international affairs. The pre-St Malo situation was well illustrated by the debates on Yugoslavia. These were overwhelmingly about trade preferences - keeping out Yugoslav sour cherries and raspberries - even at a time when the political system there was breaking apart.\n\nBehind foreign policy, ultimately, there always lies the possibility of force. A foreign policy without this possibility is only half a policy, or less. So long as Nato remained the only forum for collective military efforts, and so long as Nato is dominated by the US, European effectiveness and independence in foreign policy would always have limits.\n\nThe new road opened by Blair and Chirac leads, potentially, a long way. Not to a Europe which is hostile to the US - this is unthinkable - but to one which is a more integrated and more independent and therefore a better partner for America. The St Malo ideas were embodied in the Nice treaty. Since then the European Union has built up machinery for dealing with political and military questions on a daily basis, including a modest military staff. It has undertaken four military missions, two in the Balkans and two in the Congo - one of these may have prevented serious bloodshed. In addition to this, and not foreseen at St Malo, the EU has also undertaken a whole series of non-military missions in crisis areas including the monitoring of the peace settlement in Aceh and the border crossing at Rafah (between Gaza and Egypt). It is now contemplating the possibility of a major administrative and rule-of-law assistance mission in Kosovo as well as a police-training mission in Afghanistan. In a relatively short time the St Malo initiative has been fruitful in many, often unanticipated ways.\n\nAn unwise promise\n\nThere is still some way to go before the European Union is capable of taking a place among other continental-scale actors. But these developments are as important in their way as the euro. Any pro-European Briton should be proud of Blair's personal role in them.\n\nBritain being generally a grouchy place, most will probably prefer to remember what they see as Blair's principle sin of omission: the failure to join the euro early in the first term when it seemed as if the prime minister could walk on water and the people would follow him. You cannot be out of the euro and be at the heart of Europe - as Blair always understood. In his own terms therefore, this was a failure. It is nevertheless one we should understand. The previous Labour government collapsed in a series of economic disasters, leaving New Labour with the need to demonstrate financial responsibility. Would it have been wise to risk all on the euro, which was highly contested domestically and which fitted the UK's economic position particularly badly at the moment of decision (at the time the UK was close to overheating and European economies were tending towards recession)?.\n\nArguably the UK's interest-rate structure (a high proportion of variable-rate mortgage lending) would make it a difficult case at any time. The fact that the UK has prospered outside the eurozone does not make it easier to argue that this was a terrible mistake. The domestic economic success of New Labour has since become a factor against the prime minister's ambitions for Britain in Europe: it is difficult to argue for adopting the euro when the UK economy seems to be doing better than that of the eurozone. And even more difficult to change the psychology in Britain: that we turn to Europe as a remedy for British failure rather than a way to enhance success. If Britain had joined the euro then eurozone interest rates would have been higher by half a point or more over the period; this would not necessarily have been good for other members.\n\nWhat was a mistake and what does deserve to be criticised was the commitment to a referendum on joining the euro. Clearly a debate would have been needed; and probably it would have been wrong to take such a decision against widespread and determined opposition. But that is what parliament and election campaigns are for. Why should the machinery of monetary policy be subject to a popular vote when less complicated questions such as capital punishment are not? This is a failure in constitutional policy rather than in European policy, but that it should come on these issues illustrates the poisonous nature of the European debate in Britain.\n\nThe virus of referenda is contagious. Blair caught it from a weak and divided Conservative Party that needed to avoid the responsibility for taking decisions itself. Later he found himself too weak to resist when they called for a referendum on the constitutional treaty. There is some irony in the espousal of referenda by the Eurosceptics: the basic constitutional principle in Britain is the supremacy of parliament, with no procedural distinction between constitutional and other law. Referenda are more associated with continental countries, and then not always with their most democratic moments. The virus then spread to France and the Netherlands; in France in particular it was always going to difficult to resist calls for a popular vote on something calling itself a constitution, and Blair's decision in Britain made it impossible.\n\nThis was also the result of collective European hubris. For once the UK was right in arguing that this was not a constitution and should not be called one. Jack Straw's line that golf clubs also have constitutions was clever but it did not respond to the real point: golf clubs do not try to pretend that they are states - which was what the more ambitious members of the EU were about when they named the treaty a \"constitution\". One of the difficulties with the European Union is that even its friends do not well understand what it is - which is perhaps not surprising since it is still in the making. But this does not make it easy to explain, or a good subject for referenda. Its opponents on the other hand are all too certain they know what it is, and they do not want it (see Simon Berlaymont, \"What the European Union is\" (23 June 2005).\n\nThe balance-sheet\n\nBlair's biggest European failure came also with a moment of hubris, primarily American. He too was also seduced by the glamour of power and the illusion of influence, just as his European colleagues were trapped by their desire to make the EU into something grander than it was. Iraq is the great failure of foreign policy under Blair; but it is also a failure of European policy.\n\nAt the heart of this failure is the unwillingness to take Europe seriously as a place to make foreign policy. The only way of standing up to America, of taking an independent line in classical foreign policy as well as in areas such as trade, is through the European Union. This requires a change of psychology on the part of Britain - which has never thought much about standing up to the US in the first place. A united European position on Iraq might have had a chance of persuading the US either not to invade until the case on weapons of mass destruction (WMD) had been proved (ie, as it turned out, never) or to have handled the campaign less incompetently. Perhaps not, of course. Perhaps there was no possibility at all of influencing the US in its hysterical, fearful, hubristic, mood at that time. What is certain is that Britain on its own had no influence; likewise France also on its own. And Europe divided had none either.\n\nA joint policy by Britain and France might have had a chance of setting a different, more responsible and more influential, course for both countries and for Europe. The blame belongs in the Elysée as well in Downing Street (both have implicitly recognised their failure by handling Iran in a strikingly different fashion). But the real failure is deeper.\n\nUnless Europe is conceived of as the place where foreign policy is made (Peter Riddell in his excellent chapter in The Blair Effect makes the point that the existence of separate advisers on foreign policy and European affairs in Downing Street tends to reinforce the idea that Europe is about technical matters and foreign policy takes place on a grander stage elsewhere); unless it is equipped with the machinery and the habits of mind and of action to cope with real crises - then it will always be easiest to revert to national escapism: grandstanding Gaullism in France, subservience to American power in Britain. Blair himself, with Chirac, began building that machinery at St Malo; the next stage (the creation of a jointly owned foreign service) was set in the constitutional treaty. This is slow and often tedious work but it remains the only way to a serious foreign policy.\n\nAs Geoff Mulgan commented on leaving Downing Street, governments overestimate what they can change in the short term and underestimate what they can change in the long term. But the constant theme in Blair's speeches of Britain at the centre of a network of relationships, of which Europe is an important element but always mentioned co-equally with the United States, suggests that in the end the vision of a European alternative may never have been there in the first place.\n\nBlair himself may see his greatest failure on Europe as the failure to create a pro-European public in Britain. In fact opinion polls suggest that opinion has become more anti-European during his term of office. To reverse this would be a Herculean task under the best of circumstances, given the difficulty of explaining the importance of Europe to people who have lost their sense of history, and the distortions they are daily fed by the press. Perhaps this failure, crucial though it is, should not be taken too hard, since Britain is by no means unique in this respect. Such levelling down elsewhere may not be entirely undesirable if it means a more realistic view of what Europe is and what it can be; but it would be better if it were matched by some levelling up on the part of Britain.\n\nHere the news is perhaps not uniformly bad. Away from the press and the opinion polls the visitor to Brussels today would be struck by the degree to which, in contrast to the 1980s and early 1990s, Britain operates as a normal European country, difficult at times - but then that is true of all the larger countries - but no longer automatically the awkward squad. In a world where lasting results are always achieved slowly, this may not be not such a bad record after all."}, {"url": "https://londonspeakerbureau.com/speaker-profile/jack-straw/", "page_content": "Rt Hon Jack Straw is one of three senior Ministers to remain in Cabinet throughout the 1997 to 2010 Labour Governments under Tony Blair and Gordon Brown. He was Foreign Secretary (2001-2006), Home Secretary (1997-2001), Leader of the Commons (2006-7), and Lord Chancellor and Justice Secretary (2007-10). After Labour lost power in 2010, Straw served for six months as Shadow Deputy Prime Minister, and then stood down from the Shadow Cabinet, having served on Labour’s Front Bench for over thirty years.\n\nStraw was a Member of Parliament for Blackburn from 1979 to 2015, when he retired from the Commons. His approach won praise from Margaret Thatcher, who once declared “I would trust Jack Straw’s judgement. He is a very fair man”. Before becoming an MP, Straw practised as a Barrister, and then worked as a Special Adviser in the 1974-79 Labour Government. Appointed Foreign Secretary in 2001, Straw played a leading role in the dramatic foreign policy problems arising from the 9/11 terrorist attacks in New York and the resulting interventions in Afghanistan and Iraq. He was instrumental in helping to avoid an extremely dangerous armed conflict between India and Pakistan over Kashmir in 2002.\n\nJack Straw was a member of the European Council for five years. In 2005 he led successful efforts to open formal EU membership negotiations with Turkey. He is co-Chairman of the government-sponsored British-Turkish Forum. Straw was given the Order of the Republic of Turkey by President Abdullah Gül in 2012. With his French and German counterparts, Jack initiated the “E3” (later “P5+1”) negotiations with Iran over their nuclear programme, and has taken a close interest in Iran ever since, having visited it eight times. In July 2019 he published “The English Job: Understanding Iran, and why it distrusts Britain” (Biteback), which has been very well reviewed: ‘Highly readable, full of vivid history” (Observer); “Essential reading..clear-sighted and lucid” (Sunday Times).\n\nHe is a Visiting Professor at University College London School of Public Policy. Since 2015 he has been Chairman of the Blackburn Youth Zone, and from 2017 a Trustee of the Star (Tauheedul) Education Trust, which runs over twenty mainly Muslim state-funded schools. Straw is a Trustee of the Global Strategy Forum, and of the Atlantic Partnership. He is a Distinguished Fellow of the Royal United Services Institute (RUSI), and a Bencher of the Inner Temple. He is an adviser to a number of companies. He is Honorary Vice-President of the Blackburn Rovers Football Club.\n\nJack Straw was appointed by Prime Minister David Cameron as a member of the Independent Commission on Freedom of Information (2015-16), and served as a member of the Archbishops’ Council on the future of Cathedrals. In 2012 he published ‘Last Man Standing: Memoirs of a Political Survivor’ (2012, Macmillan). The Times’ reviewer said that this was a ‘masterclass in the art of government…lucid, engaging, humorous, occasionally self-deprecating, and generally frank’."}, {"url": "https://www.tutor2u.net/politics/reference/tony-blairs-cabinets", "page_content": "This study note explores some of the key features of Tony Blair's Cabinets during his time as Prime Minister.\n\nTony Blair’s first cabinet was the only one he did not entirely choose for himself. His Shadow Cabinet stepped up to the cabinet table and, in the Labour Party at that time, the MPs (the Parliamentary Labour Party or PLP) elected MPs to sit on the front bench.\n\nHowever, Blair did have control over what position they held in his cabinet, and some of the people he might not have chosen for himself were kept in junior positions (e.g. the veteran left-winger Michael Meacher). Others who had full cabinet positions, like David Clark and Gavin Strang, were shuffled out of the cabinet at the first opportunity (July 1998, Blair’s first major reshuffle).\n\nHaving said that many of Blair’s ministers remained in position for a longer period of time.\n\nGordon Brown remained in the same post (Chancellor of the Exchequer) for the full premiership (10 years), alongside John Prescott who remained Deputy Prime Minister (although this was seen as being linked with his role as Deputy Leader of the Labour Party, which was an elected position).\n\nBlair only had:\n\nTwo Secretaries for Culture Media and Sport (Chris Smith and Tessa Jowell)\n\nThree Foreign Secretaries (Robin Cook, Jack Straw and Margaret Beckett)\n\nFour Home Secretaries (Jack Staw, David Blunkett, Charles Clarke and John Reid)\n\nFour Defence Secretaries (George Robertson, Geoff Hoon, John Reid and Des Browne), and\n\nFour Health Secretaries (Frank Dobson, Alan Milburn, John Reid and Patricia Hewitt)\n\nAs can be seen, certain ministers, like Jack Straw and John Reid, performed several senior roles across the period.\n\nOther departments saw more regular changes with five education secretaries, six cabinet ministers looking after social security/work and pensions, seven Chief Secretaries to the Treasury and nine Cabinet Office ministers. At junior levels, there were very regular changes, as is to be expected, as often those roles are seen as rungs on the ladder to more senior roles.\n\nWe have a few insights into what Blair’s cabinets were like. These come from some diaries (such as those of Robin Cook) and also from comments and speeches from those who left or were removed from the cabinet (such as Clare Short). These give the impression of Blair taking something of a presidential approach to cabinet, with short full-cabinet meetings generally rubber-stamping decisions that had been taken elsewhere (either in various bilateral meetings, cabinet committees or in what came to be described as “sofa government”: Blair’s meetings with close advisers and supporters outside the formal government structures).\n\n"}, {"url": "https://institutmontaigne.org/en/expressions/kinship-daggers-drawn-tony-blair-and-gordon-brown", "page_content": "At the time, many blamed Blair's \"presidentialism\" and an informal \"sofa government\" approach where Blair would take advice from a small unofficial group of advisers rather than from his Cabinet, and the rising power of \"spin doctors\" - that is, spokespeople who give favourable interpretations of events to the media.\n\nBut arguably the most damaging force to the Cabinet government was the Blair-Brown competitive duopoly. When two powerful figures in the British government effectively ran the government in competition with each other, power crystallised around them, bypassing the rest of the Cabinet. It is revealing that, when Blair stepped down and only Brown remained, Cabinet regained some degree of importance.\n\nThis might not matter as much if, through rigorous debate and power distribution between their camps, the Blair-Brown competition led to better policy making, as Mulgan claims. But it is far from clear that this was true. Indeed, it sometimes led to the scenario where each man accumulated too much power in their different power bases. Brown was probably one of the most powerful Chancellors in modern British history. Blair, meanwhile, famously devoted the latter years of his prime ministership to a hugely contentious foreign policy agenda, especially the Iraq War. The catastrophe of the Iraq War can be traced to many myriad failings, and there were other \"big beasts\" directly involved in decision-making like British Foreign Secretary Jack Straw. But it is suggestive that Blair turned so completely to foreign policy at the same time as he was hitting a Brownite wall on his domestic agenda.\n\nIndeed, in his memoirs Brown blames his failure to raise too many questions about the Iraq invasion on his toxic relationship with Blair:\n\n\"In 2002 and 2003 I was on the road to a head-on collision with Tony over three matters: the euro, the NHS and tuition fees. All coincided with our decision to go into Iraq. Embroiled in these battles, I was, rightly or wrongly, anxious to avoid a fourth area of dispute\".\n\nThere is some suspiciously convenient hindsight here, and other ministers like Robin Cook and Clare Short did resign over Iraq in 2003. Nonetheless, the process by which the Iraq War became Blair's personal mission, unhindered by truly effective checks elsewhere in the executive, is another example of the ways in which the Blair-Brown duopoly could facilitate the unhealthy concentration of power in different parts of government, as each jealously guarded their areas of control.\n\nAn instructive model?\n\nThe dysfunctionality of the Blair-Brown relationship was, to some extent, specific to their personality mix: Blair's slipperiness and tendency to a messianic complex, Brown's famously short temper and domineering, sometimes bullying demeanour. The toxicity of their relationship was only compounded by their past friendship. As Blair recalled in his memoir:\n\n\"Gordon and I had been well-nigh inseparable for over ten years. We were as close as two people ever are in politics. It was not simply a professional relationship, it was a friendship. Later, when things became difficult, then fraught, and finally dangerous, the wrench was all the harder because the intimacy had been so real\".\n\nThere are, nevertheless, some wider lessons that we can draw from the Blair-Brown case study for any duo at the apex of politics. Firstly, partnerships can, in theory, constrain the dangerous concentration of power in one person, but this is not an inevitable benefit. If not properly integrated into existing systems of governance, an overpowered political duo, each with their own fiefdoms, can undermine pre-existing checks and balances and, thus, facilitate abuses of power. The disempowerment of Cabinet, Treasury power grabs, and the Iraq War all provide ample evidence of this danger.\n\nSecondly, partnerships can be collaborative, or even creatively destructive. Their competitive edge can also force rigour. But, if not carefully cultivated and managed with sensitivity, they can also be simply destructive. Constant clashing between two powerful leaders will monopolise attention, drain energies, and wreck agendas in any government. That was, undoubtedly, the fate of the Blair-Brown governments, and they should serve as a cautionary tale for any future political pair."}, {"url": "https://www.theguardian.com/commentisfree/2023/mar/20/putin-arrest-illegal-invasion-iraq-gordon-brown-condoleezza-rice-alastair-campbell-russia", "page_content": "It goes beyond hypocrisy. It’s an assault on memory. Gordon Brown, calling for a special tribunal to punish the Russian government, correctly states that an act of aggression – invading another nation – was identified by the Nuremberg tribunal as “the supreme international crime”. It is, he wrote in the Guardian, not just Vladimir Putin who should be prosecuted, but also his “henchmen”. These include members of the Russian and perhaps Belarusian national security councils, and a range of political and military leaders. All should be held to account for this “manifestly illegal war”, he wrote on his website.\n\nCondoleezza Rice, who was George W Bush’s national security adviser, was asked of Russia’s aggression on Fox News, “when you invade a sovereign nation, that is a war crime?” She replied: “It is certainly against every principle of international law and international order.”\n\nBrown and Rice are right about Russia. Its government, in invading Ukraine, has clearly committed the crime of aggression, a crime in which, as Brown points out, its senior officials are complicit. The same applies to the US and UK governments, which invaded Iraq 20 years ago today. Among the most senior perpetrators were Rice and Brown.\n\nThe seventh of the Nuremberg Principles, which Brown cites in calling for Russian prosecutions, points out that “complicity” in a war of aggression “is a crime under international law”. Both officials would clearly qualify as complicit. Rice was one of the architects of the war. Brown, as a cabinet member, was party to the decision. As chancellor of the exchequer, he financed the war.\n\nNo one can credibly deny that the invasion of Iraq met the Nuremberg definition. The Chilcot inquiry, whose terms were set by Brown when he was prime minister, was forbidden to pronounce on the legality of the war. But it concluded that “the UK chose to join the invasion of Iraq before the peaceful options for disarmament had been exhausted. Military action at that time was not a last resort.” In other words, it failed to meet the UN charter’s criteria for legal warfare. The former law lord, Lord Steyn, came to the same conclusion: “In the absence of a second UN resolution authorising invasion, it was illegal”. The former lord chief justice, Lord Bingham, called the Iraq war “a serious violation of international law”. A Dutch inquiry, led by a former supreme court judge, found that the invasion had “no sound mandate in international law”.\n\nThe attackers went out of their way to eliminate peaceful alternatives. Saddam Hussein desperately sought to negotiate, eventually offering everything the US and UK governments said they wanted, but they slapped his hand away, then lied to us about it. When the UN sought diplomatic solutions, US officials went into what they called “thwart mode”, sabotaging negotiations.\n\nWhen the head of the Organisation for the Prohibition of Chemical Weapons, José Bustani, offered to resolve the impasse over weapons inspections in Iraq, the US government illegally ousted him. The first government to support his sacking was the United Kingdom’s.\n\nThe government in which Brown was chancellor was repeatedly warned that its planned invasion would be illegal. A year before the war, the then foreign secretary, Jack Straw, explained that for a war to be legal, “i) There must be an armed attack upon a State or such an attack must be imminent; ii) The use of force must be necessary and other means to reverse/avert the attack must be unavailable; iii) The acts in self-defence must be proportionate and strictly confined to the object of stopping the attack”. None of these conditions applied. The Foreign Office, according to its deputy legal adviser, Elizabeth Wilmshurst, consistently counselled that an invasion would be unlawful without a new UN resolution. She explained that “an unlawful use of force on such a scale amounts to the crime of aggression”. A Cabinet Office memo warned: “A legal justification for invasion would be needed. Subject to Law Officers’ advice, none currently exists.”\n\nAs for “law officers’ advice”, the then attorney general, Lord Goldsmith, warned that there were only three ways in which an invasion could be legally justified. They were “self-defence, humanitarian intervention, or UNSC [UN security council] authorisation. The first and second could not be the base in this case.” The government failed to obtain UN security council authorisation. At the Chilcot inquiry, Lord Goldsmith testified that, after he gave advice Tony Blair didn’t want to hear, the prime minister stopped asking. Just before the war, though the facts had not changed, Goldsmith changed his mind.\n\nThere is another way of saying “crime of aggression”: an act of mass murder. The invasion of Iraq killed hundreds of thousands of people. We cannot be more precise than that, as the invading forces refused to measure the carnage. But it is almost certainly the greatest crime against humanity so far this century. Blair, Brown, Bush and Rice are as guilty of a “manifestly illegal war” as Putin and his close advisers.\n\nBut who gets prosecuted is a matter of victors’ justice. For example, until it issued a warrant last week on another charge for the arrest of Putin and one of his officials, there had been 31 cases brought before the international criminal court. Every one of the defendants in these cases is African. Is this because Africa is the only continent where crimes against humanity had occurred? No. It’s because Africans accused of such crimes do not enjoy the political protections afforded to the western leaders who perpetrate even greater atrocities.\n\nInstead of facing justice, the killers walk among us, respected, revered, treated as the elder statesmen to whom media and governments turn for counsel. Brown can pose as an august humanitarian. Alastair Campbell, who oversaw the compilation of the “dodgy dossier”, which provided a false case for war, and is therefore as complicit as any of Putin’s “henchmen”, has been thoroughly screenwashed: in other words, rehabilitated, like other grim political figures, by television. He is now treated as a kind of national agony uncle.\n\nThere has been no reckoning and nor will there be. This greatest of crimes has been so thoroughly airbrushed that its perpetrators can anoint themselves the avenging angels of other people’s atrocities. To quote King Lear: “Plate sin with gold, and the strong lance of justice hurtless breaks: arm it in rags, a pigmy’s straw does pierce it.”"}, {"url": "https://www.theguardian.com/politics/2015/may/25/labour-and-the-legacy-of-blair-and-brown", "page_content": "Jonathan Freedland is wrong to say “Labour has to get over its Tony Blair problem” (Opinion, 23 May), since evidence from elsewhere in your paper indicates clearly that it was not the failure to be sufficiently New Labour that led to defeat at the election (Election 2015: who really voted for whom?, 23 May). Labour lost because it failed to bring out the under-40s and those living in social housing in sufficient numbers. In most social groups under 65, there was no dramatic swing to the Tories in the recent election.\n\nFreedland urges us to consider the successful policies of the Blairites, including “the minimum wage, the pensioners lifted out of poverty, the civil partnerships, the Sure Start centres, devolution, the windfall tax, the rebuilding of broken schools and rundown hospitals”. However, these policies were and are neither particularly radical, nor are they the prerogative of Blairites. Some were part of the grain of history and enacted elsewhere without New Labour administrations – notably Scotland and our partners in Europe; while others, including investment in schools and hospitals, were paid for through the private finance initiative, to the everlasting debt of the British taxpayer and generations to come.\n\nWe do not need to disinter Tony Blair to win, we simply need radical and green policies that bring Labour supporters to the voting booth and stop defections to other parties (including the SNP, Green and Ukip).\n\nMichael Redclift\n\nEmeritus professor of international environmental policy, King’s College London\n\nI’d suggest the task of getting over the Gordon Brown problem is much more pressing. This was a man who came to power with income tax at 23p, which almost no one thought was too high. Yet, for the sake of a couple of dispatch-box flourishes, Brown reduced it to 20p, leaving revenue spending underfunded and capital spending dependent on expensive PFI schemes which will contribute to the budget deficit for years to come. Underpinning all this was an economy heavily reliant on financial services and a debt-fuelled consumer boom.\n\nThis did precisely nothing for core Labour voters in towns across Britain which once had economic hearts, but which now are characterised by decay and the onward march of Ukip. After 2010 the Brown government decamped to the opposition benches, its thinking and personnel largely unchanged, with a result that was entirely predictable. And now the Labour party looks likely to move forward by choosing between two more members of this discredited clique, Burnham and Cooper.\n\nMichael Woodgate\n\nBristol\n\nThe high point for many of the recent general election campaign was the BBC Question Time event from Leeds during which a cross-section of voters confronted David Cameron, Ed Miliband and Nick Clegg. I suggest it might help the Labour party in its current travails if it could arrange a similar event for those leadership candidates vying to succeed Mr Miliband. How better to gauge which, if any, of them is able to engage with voters and craft a new, more attractive political message?\n\nRobin Lustig\n\nLondon\n\nYour editorial (The party has got its leadership election process back to front, 21 May) hits the nail on the head. The system Labour has for choosing its leader is contemptuous of its membership. The lessons to be drawn from the general election must be confronted, however painful. In particular, those defending Ed Miliband’s leadership (Letters, 18 May) need to get a grip on reality.\n\nThere was no way the public would elect him as prime minister. He was not up to the job and most people knew this. A man so ruthless as to stand against his gifted elder brother, David, in the leadership contest was not to be trusted. The membership voted for David, but Ed won on a leftwing ticket because of the union block vote. The election strategy did not show the electorate that Labour favoured the growth of a strong economy. Debt and more debt seemed to be the message, as populist bits of policy were drip-fed to the public. One could not imagine this man performing on a world stage – not that foreign policy was given serious consideration. A trusted interim leader, as you suggest, could help to sort out the mess, including the big question of why a party that claims to be concerned with equality has not yet elected a woman leader.\n\nJune Purvis\n\nPortsmouth\n\nMany Labour members would agree that the leadership race is being rushed. The five-year parliament gives the Labour party the space to elect an interim leader. This would have been inconceivable previously, when a prime minister could call an election almost at will. An interim leader can drive an effective opposition in parliament. They can draw together the strands of thought needed for assessing why the Labour loss was so great and where the party should go next. Such a leader can also encourage the rebuilding of the party grass roots and its damaged local government base.An interim leader has the luxury not to play the Westminster game. They can ignore PMQs, derided by most Britons outside the political bubble, and allow backbench talent to flower. It is not too late for one or more such candidates to announce themselves, committing themselves to resign in 2017, and for the existing candidates to withdraw from the present race.\n\nAndy Jordan\n\nWirksworth, Derbyshire\n\nJonathan Freedland’s interesting analysis of the “haunting” of Labour by its erstwhile “three-time election winner” omits a critically important ingredient in Blair’s electoral success. From the outset, Blair set out to cultivate the Tory press: Lord Rothermere, Conrad Black (whom he knew through the Bilderberg Conferences that he flatly denied attending) and particularly Rupert Murdoch. He was greatly assisted by the fact that the then prime minister, John Major, kept distant from the press and was much more ideologically committed to the EU than Blair affected to be, a red-line issue for Murdoch.\n\nHaving persuaded Murdoch that his version of Labour, which ditched the term socialist in favour of New, along with clause IV, was no threat to Murdoch’s global ambitions, Blair secured the tacit and even overt support of the Tory press. In any case, the Tories were exhausted, corrupt and riven with dissent, just as in 1964. Major’s three successors as Tory leader were equally diffident about appealing to Murdoch et al. Blair was succeeded by Gordon Brown and Ed Miliband, who were respectively indifferent to and hostile to the Tory press barons. David Cameron has been lavish in his attentions to editors and proprietors, taking his cue from Blair and Margaret Thatcher. Miliband’s direct threat to the tax arrangements of Rothermere and the Barclay brothers guaranteed brutal treatment in return.\n\nIn my view, the next Labour leader needs to combat rather than cultivate the Tory press. A ruthless rapid-rebuttal unit should counter every example of black propaganda immediately and repeatedly. The internet is ideal for this, so much more effective than belatedly securing an insincere retraction at the bottom of page 16. A crack team of old-school yellow journalists should be deployed to dig up everything knowable about the owners, editors and political correspondents of the newspapers, along with the Tory frontbench, to be kept for retaliation and/or pre-emption. Labour needs to fight back and fight back dirty, and it should be perfectly open about its intention to do so.\n\nW Stephen Gilbert\n\nCorsham, Wiltshire\n\nJonathan Freedland wants us to think about how Blair won three elections. Well, as I remember it, he put all the emphasis on himself as leader, rather than the party – like Ed Miliband. He went scurrying to secure the support of Rupert Murdoch – like David Cameron. And he focused on securing the support of floating voters in key marginals – like Lynton Crosby. Yippee. I can hardly wait to sign up.\n\nPaul Francis\n\nMuch Wenlock, Shropshire\n\nJonathan Freedland’s call for Labour to make peace with Blair is misguided. The reason why Blair won three elections on the trot and why the Tories have won a second term comes down to one thing: the economy, stupid. And as soon as this goes into recession again, which it is bound to do, there will be a change of government.\n\nThe reason why Labour needs to cut all links with Blair is because three election wins turned him into something of a megalomaniac, with a sprinkling of the religious zealot thrown in for good measure. To invite Blair back into the Labour fold would be utterly misguided and counterproductive. Yes, Labour needs to make its policies more relevant, convincing and financially attractive, but it certainly does not need to go back to a very controversial past. Blair is history; let’s keep him that way.\n\nJonathan Cockburn\n\nLydney, Gloucestershire"}]}